{
  "content": [
    {
      "type": "text",
      "text": "# 100 Queen's Gate Hotel London Kensington\n\n| map_dot_label       = 100 Queen's Gate\n| former_names        = }}\n| building_type       = Hotel\n| address             = 100 Queen's Gate\n| location           = London, United Kingdom\n| owner               = Hilton Worldwide\n| hotel_chain         = Curio Collection\n| classification     =\n| renovation_date     =  2013\n| number_of_rooms     = 228\n| number_of_suites   = 11\n| floors             = 5\n| parking            = Yes\n| number_of_restaurants = 2\n| height              = 16.68 m\n| opened_date         = 17 Dec 2015 (DoubleTree Hotel) 31 Mar 2019 (Curio Collection Hotel)\n| website             =\n| references          =\n}}\n'''100 Queen's Gate Hotel London Kensington, Curio Collection by Hilton is a historic 228-room townhouse hotel, part of the Curio Collection by Hilton, situated in the Royal Borough of Kensington and Chelsea, within close proximity of Hyde Park. The hotel features three food and beverage venues: Cento Restaurant, an all-day brasserie and bar offering British-Italian fusion cuisine; Botanica, housed in a botanical glasshouse, designed for afternoon teas and cocktails; and ESQ bar.\nHistory\nOriginally built in 1870 as the home of Victorian aristocrat William Alexander, the building was later used as a hospital in the 1960s. A private hotel was first established on the site as early as 1908. In 1974, the building was converted to The Regency Hotel.\nThe building was renovated by Agenda 21 Architects Studio Ltd and finished by Jan 2013. The project included full refurbishment of the existing hotel to new interior design, including full remodeling of the guest rooms, bathrooms and reception areas. Done in several phases in order to retain operation.\nFrom 17 December 2015, the hotel operated as DoubleTree by Hilton Hotel London - Kensington'''. On 31 March 2019 it became part of Hilton's Curio brand.\nThe hotel has been listed as a Grade II building since 15 April 1969.\nReferences\nExternal links\n*"
    }
  ]
}