{
  "content": [
    {
      "type": "text",
      "text": "# 109th Infantry Division (German Empire)\n\nThe 109th Infantry Division (109. Infanterie-Division) was a formation of the Imperial German Army in World War I. The division was formed in November 1915. It was the last of a wave of new infantry divisions formed in 1915. The division was disbanded in August 1918 and its assets distributed to other units.\nThe division was formed primarily from the excess infantry regiments of existing divisions that were being triangularized. The division's 2nd Grenadier Regiment came from the 3rd Infantry Division. The 26th Reserve Infantry Regiment came from the 6th Reserve Division. The 376th Infantry Regiment was formerly the 2nd Ersatz Infantry Regiment \"Königsberg\" (Ersatz-Infanterie-Regiment Nr. 2 \"Königsberg\").\nCombat chronicle\nThe 109th Infantry Division initially served on the Eastern Front, serving in the Baltic region until late October 1916. It then went south to participate in the Romanian Campaign. The division's 2nd Grenadiers were the first troops into Bucharest in December 1916. It then occupied the line on the Putna and Siret Rivers until the armistice on the Romanian Front in December 1917, after which the division remained in the occupation forces in the region. In March 1918, the division was sent to the Western Front. It participated in the German spring offensive, fighting in the First Battle of the Somme (1918), also known as the Second Battle of the Somme (to distinguish it from the 1916 battle). It remained in the Somme region until it was dissolved on August 24, 1918. Allied intelligence rated the division as third class.\nOrder of battle on formation\nThe 109th Infantry Division was formed as a triangular division. The order of battle of the division on November 12, 1915, was as follows:\n*174. Infanterie-Brigade\n**Grenadier-Regiment König Friedrich Wilhelm IV (1. Pommersches) Nr. 2\n**Infanterie-Regiment Nr. 376\n**Reserve-Infanterie-Regiment Nr. 26\n*Kavallerie-Regiment Nr. 89\n*Feldartillerie-Regiment Nr. 227\n*Landwehr-Fußartillerie-Bataillon Nr. 28\n*1.Garde-Landwehr-Pionier-Kompanie\nLate-war order of battle\nThe division underwent relatively few organizational changes over the course of the war. Cavalry was reduced, artillery and signals commands were formed, and combat engineer support was expanded to a full pioneer battalion. The order of battle on February 8, 1918, was as follows:\n*174. Infanterie-Brigade\n**Grenadier-Regiment König Friedrich Wilhelm IV (1. Pommersches) Nr. 2\n**Infanterie-Regiment Nr. 376\n**Reserve-Infanterie-Regiment Nr. 26\n*5.Eskadron/Dragoner-Regiment König Albert von Sachsen (Ostpreußisches) Nr. 10\n*Artillerie-Kommandeur 109\n**Feldartillerie-Regiment Nr. 227\n**Fußartillerie-Bataillon Nr. 64 (from April 24, 1918)\n*Pionier-Bataillon Nr. 218\n**1.Garde-Landwehr-Pionier-Kompanie\n**Pionier-Kompanie Nr. 388\n**Minenwerfer-Kompanie Nr. 109\n*Divisions-Nachrichten-Kommandeur 109\nReferences\n* [http://www.1914-18.info/erster-weltkrieg.php?u=205 109. Infanterie-Division (Chronik 1915/1918) - Der erste Weltkrieg]\n* Hermann Cron et al., Ruhmeshalle unserer alten Armee (Berlin, 1935)\n* Hermann Cron, Geschichte des deutschen Heeres im Weltkriege 1914-1918 (Berlin, 1937)\n* Günter Wegner, Stellenbesetzung der deutschen Heere 1825-1939. (Biblio Verlag, Osnabrück, 1993), Bd. 1\n* Histories of Two Hundred and Fifty-One Divisions of the German Army which Participated in the War (1914-1918), compiled from records of Intelligence section of the General Staff, American Expeditionary Forces, at General Headquarters, Chaumont, France 1919 (1920)\nNotes"
    }
  ]
}