{
  "content": [
    {
      "type": "text",
      "text": "# 1174–1177 Suzdalian war of succession\n\n''.]]\nThe Suzdalian war of succession of 1174–1177 was a war of succession in Vladimir-Suzdal (Suzdalia), a complex of principalities in the northeast of Kievan Rus'. The casus belli was the assassination of prince Andrey Bogolyubsky on 28 June 1174 by his own boyars. Immediately, his surviving step-brothers, son and nephews started fighting amongst themselves about who had the right to succeed him. The conflict would not be resolved until Vsevolod Yurievich \"the Big Nest\" had defeated his other brothers and his nephews, and seized power across Suzdalia in 1177.\nBelligerents\n|boxstyle_Dol=background-color:lightgrey|2nd=Helena;Yuri's second wife|boxstyle_2nd=background-color:lightgrey}}\nAndrey's son Yury Bogolyubsky was dethroned as prince of Novgorod shortly after Andrey's murder. Yury fled to the Caucasus, playing no role in the Suzdalian succession crisis.\nThe two belligerent factions became Andrey's nephews the Rostislavichi, and Andrey's step-brothers the Yurievichi.\nRostislavichi\nYaropolk Rostislavich and Mstislav Rostislavich \"the Eyeless\" were the sons of Rostislav Yuryevich (died 1151), the older brother of Andrey by Yuri Dolgorukiy's first wife. Their power base was in Rostov and Suzdal in the north, where the boyars supported them. They would ally themselves with the princes of Smolensk, Ryazan (their sister Euphrosyne Rostislavich was married to prince Gleb of Ryazan), Murom, Polotsk, and Vitebsk (Yaropolk married prince Vseslav's daughter in the winter of 1174–75).\nYurievichi\nMikhail or \"Mikhalko\" Yurievich of Vladimir and Vsevolod Yurievich \"the Big Nest\" were the sons of Yuri Dolgorukiy by his second wife Helena, and thus Andrey's step-brothers. Their power base was in Vladimir on the Klyazma in the south, as well as Chernigov (modern Chernihiv), the capital of their Olgovichi allies.\nAlthough the nephews and step-brothers of Andrey would shortly after his death agree to recognise Mikhalko as the senior prince, with the title of prince of Vladimir, conflict soon erupted nevertheless.\nList of battles\nand their neighbours (1216)]]\n* Siege of Vladimir (1174) by Yaropolk Rostislavich for seven weeks, with Mikhalko Yurievich defending the city from within until the inhabitants demanded that he surrender to end their misery. Yaropolk  was recognised as prince of Vladimir, and Mstislav as prince of Rostov.\n* Novgorod-Seversk – Chernigov conflict (1174), when Oleg II Svyatoslavich, Prince of Novgorod-Seversk and husband of the Rostislavichi's aunt Maria, attacked the Yurievichi-allied Olgovichi of Chernigov. Oleg sacked Lutava and Morovsk, and unsuccessfully besieged Starodub, plundering its countryside. The Olgovichi then besieged Novgorod-Seversk, after which they made peace.\n* Battle of the Belekhov plain near Zagor'je (15 June 1175), with the Yurievichi defeating the Rostislavichi and recapturing Vladimir. Mikhalko Yurievich was again recognised as prince of Vladimir.\n* , 27 June 1176, Vladimirian and Chernigovian troops of Vsevolod Yurievich defeated the Rostovian forces under Mstislav Rostislavich.\n* , 7 March 1177, Yurievichi forces of Vladimir, Chernigov and Pereyaslavl defeated the Rostislavichi forces of Rostov, Suzdal', and Ryazan. Decisive Yurievichi victory; Vsevolod became the undisputed prince of Vladimir, imprisoning and blinding the Rostislavichi brothers.\nAftermath\nThe war of succession devastated Suzdalia, leading to infighting, killing and the widely-condemned mutilation of the Rostislavichi brothers within its reigning clan, war-time violence and destruction, and the loss of control over Novgorod. More importantly, due to Andrey's death, the Yurievichi clan also dropped out of the competition for the Kievan throne, never seeking it again, supporting Rurik Rostislavich's accession in 1194. Instead, Vsevolod would focus only on their patrimony in Vladimir-Suzdal, and the neighbouring principalities of Ryazan and Murom (which they did manage to seize control of, at the loss of their previous Olgovichi overlords), and on regaining control of the Novgorod Republic, although the Yurievichi clan would not do so again for another decade.\nWith the death of Vsevolod in 1212, the Yurievichi definitively lost their right to sit on the throne of Kiev. It also triggered yet another war of succession in Vladimir-Suzdal (1212–1216).\nSee also\n* List of wars involving Kievan Rus'\n* Kievan succession crisis of 1015–1019\n* Siege of Vyshgorod (1173), which precipitated Andrey's murder\n* Battle of Lipitsa (1216), which decided the 1212–1216 Vladimir-Suzdal war of succession upon Vsevolod the Big Nest's death\nReferences\nBibliography\nPrimary sources\n* Kievan Chronicle ( 1200)\n** (modern English translation)\n* Suzdalian Chronicle ( 1203)\n* Novgorod First Chronicle ( 1275)\nLiterature\n*\n*\n*\n*  (e-book)"
    }
  ]
}