{
  "content": [
    {
      "type": "text",
      "text": "# 11th Academy Awards\n\nand Frank Capra]]\nThe 11th Academy Awards were held on February 23, 1939, at the Biltmore Hotel in Los Angeles, California, and hosted by Frank Capra.\nFrank Capra became the first person to win three Best Director awards, to be followed by John Ford (who would go on to win four) and William Wyler. La Grande Illusion was the first non-English language film to be nominated for Best Picture.\nThis was the first of only two times in Oscar history in which three of the four acting winners had won before; only Fay Bainter was a first-time award winner. The only other time that this happened was at the 67th Academy Awards in 1994. Fay Bainter was the first performer in the Oscars history to receive two acting nominations in the same year, while Spencer Tracy became the first of two actors to win Best Actor two years in a row; the other, Tom Hanks, also did so in 1994.\nGeorge Bernard Shaw's screenplay win for Pygmalion made him the first—and, for over 60 years, only—person to win both a Nobel Prize and an Academy Award until Bob Dylan received Nobel Prize in Literature in 2016 after having won the Academy Award for Best Original Song in 2001. Shaw protested his win, roaring, from London:  Shaw was one of four to receive the award, along with Ian Dalrymple, Cecil Lewis and W. P. Lipscomb, who had also worked on adapting Shaw's text.|group=n}}}}\nRadio coverage was banned at the ceremony. A reporter, George Fischer from Los Angeles' Mutual Radio Network station, KHJ, which had been reporting from the Academy Awards since 1930, locked himself in a booth and was able to broadcast for about 12 minutes before security guards broke down the door. Partial radio coverage was subsequently permitted again, beginning with the 1942 ceremony.\nWinners and nominees\nAwards\nNominees were announced on February 5, 1939. Winners are listed first and highlighted in boldface.\n{| class=wikitable\n|-\n| valign=\"top\" width=\"50%\" |\n* 'You Can't Take It with You – Frank Capra for Columbia'\n** The Adventures of Robin Hood – Hal B. Wallis and Henry Blanke for Warner Bros.\n** ''Alexander's Ragtime Band – Darryl F. Zanuck and Harry Joe Brown for 20th Century Fox\n** Boys Town – John W. Considine Jr. for Metro-Goldwyn-Mayer\n** The Citadel – Victor Saville for Metro-Goldwyn-Mayer\n** Four Daughters – Hal B. Wallis and Henry Blanke for Warner Bros. and First National\n** Grand Illusion – Frank Rollmer and Albert Pinkovitch for R. A. C. and World Pictures\n** Jezebel – Hal B. Wallis and Henry Blanke for Warner Bros.\n** Pygmalion – Gabriel Pascal for Pascal Film Productions\n** Test Pilot – Louis D. Lighton for Metro-Goldwyn-Mayer\n| valign=\"top\" width=\"50%\" |\n* 'Frank Capra&nbsp;– ''You Can't Take It with You'\n** Michael Curtiz&nbsp;– Angels with Dirty Faces\n** Norman Taurog&nbsp;– Boys Town\n** King Vidor&nbsp;– The Citadel\n** Michael Curtiz&nbsp;– Four Daughters\n|-\n| valign=\"top\" width=\"50%\" |\n* 'Spencer Tracy&nbsp;– Boys Town as Father Edward J. Flanagan'\n** Charles Boyer&nbsp;– Algiers as Pepe le Moko\n** James Cagney&nbsp;– Angels with Dirty Faces as William \"Rocky\" Sullivan\n** Robert Donat&nbsp;– The Citadel as Dr Andrew Manson\n** Leslie Howard&nbsp;– Pygmalion as Professor Henry Higgins\n| valign=\"top\" width=\"50%\" |\n* 'Bette Davis&nbsp;– Jezebel as Julie Marsden'\n** Fay Bainter&nbsp;– White Banners as Hannah Parmalee\n** Wendy Hiller&nbsp;– Pygmalion as Eliza Doolittle\n** Norma Shearer&nbsp;– Marie Antoinette as Marie Antoinette\n** Margaret Sullavan&nbsp;– Three Comrades as Patricia Hollmann\n|-\n| valign=\"top\" width=\"50%\" |\n* 'Walter Brennan&nbsp;– Kentucky as Peter Goodwin'\n** John Garfield&nbsp;– Four Daughters as Mickey Borden\n** Gene Lockhart&nbsp;– Algiers as Regis\n** Robert Morley&nbsp;– Marie Antoinette as King Louis XVI\n** Basil Rathbone&nbsp;– If I Were King as King Louis XI\n| valign=\"top\" width=\"50%\" |\n* 'Fay Bainter&nbsp;– Jezebel as Aunt Belle Massey'\n** Beulah Bondi&nbsp;– Of Human Hearts as Mary Wilkins\n** Billie Burke&nbsp;– Merrily We Live as Emily Kilbourne\n** Spring Byington&nbsp;– ''You Can't Take It with You as Penelope \"Penny\" Sycamore\n** Miliza Korjus&nbsp;– The Great Waltz as Carla Donner\n|-\n| valign=\"top\" width=\"50%\" |\n* 'Boys Town&nbsp;– Eleanore Griffin and Dore Schary'\n** Alexander's Ragtime Band&nbsp;– Irving Berlin\n** Angels with Dirty Faces&nbsp;– Rowland Brown\n** Blockade&nbsp;– John Howard Lawson\n** Mad About Music&nbsp;– Marcella Burke and Frederick Kohner\n** Test Pilot&nbsp;– Frank Wead\n| valign=\"top\" width=\"50%\" |\n* 'Pygmalion&nbsp;– George Bernard Shaw, Ian Dalrymple, Cecil Lewis, and W. P. Lipscomb, based on the play by Shaw'\n** Boys Town&nbsp;– John Meehan and Dore Schary, based on a story by Schary and Eleanore Griffin\n** The Citadel&nbsp;– Ian Dalrymple, Elizabeth Hill and Frank Wead, based on the novel by A. J. Cronin\n** Four Daughters&nbsp;– Lenore Coffee and Julius J. Epstein, based on the short story \"Sister Act\" by Fannie Hurst\n** You Can't Take It with You&nbsp;– Robert Riskin, based on the play by George S. Kaufman and Moss Hart\n|-\n| valign=\"top\" width=\"50%\" |\n* 'That Mothers Might Live&nbsp;– MGM'\n** The Great Heart&nbsp;– MGM\n** Timber Toppers&nbsp;– 20th Century Fox\n| valign=\"top\" width=\"50%\" |\n* 'Declaration of Independence&nbsp;– Warner Bros.'\n** Swingtime in the Movies&nbsp;– Warner Bros.\n** They're Always Caught&nbsp;– MGM\n|-\n| valign=\"top\" width=\"50%\" |\n* 'Ferdinand the Bull&nbsp;– Walt Disney Productions and RKO Radio'\n** Brave Little Tailor&nbsp;– Walt Disney Productions and RKO Radio\n** Good Scouts&nbsp;– Walt Disney Productions and RKO Radio\n** Hunky and Spunky&nbsp;– Paramount\n** Mother Goose Goes Hollywood&nbsp;– Walt Disney Productions and RKO Radio\n| valign=\"top\" width=\"50%\" |\n* 'The Adventures of Robin Hood&nbsp;– Erich Wolfgang Korngold'\n** Army Girl&nbsp;– Victor Young\n** Block-Heads&nbsp;– Marvin Hatley\n** Blockade&nbsp;– Werner Janssen\n** Breaking the Ice&nbsp;– Victor Young\n** The Cowboy and the Lady&nbsp;– Alfred Newman\n** If I Were King&nbsp;– Richard Hageman\n** Marie Antoinette&nbsp;– Herbert Stothart\n** Pacific Liner&nbsp;– Russell Bennett\n** Suez&nbsp;– Louis Silvers\n** The Young in Heart&nbsp;– Franz Waxman\n|-\n| valign=\"top\" width=\"50%\" |\n* '''Alexander's Ragtime Band&nbsp;– Alfred Newman'\n** Carefree&nbsp;– Victor Baravalle\n** ''Girls' School&nbsp;– Morris Stoloff and Gregory Stone\n** The Goldwyn Follies&nbsp;– Alfred Newman\n** Jezebel&nbsp;– Max Steiner\n** Mad About Music&nbsp;– Charles Previn and Frank Skinner\n** Storm Over Bengal&nbsp;– Cy Feuer\n** Sweethearts&nbsp;– Herbert Stothart\n** There Goes My Heart&nbsp;– Marvin Hatley\n** Tropic Holiday&nbsp;– Boris Morros\n** The Young in Heart&nbsp;– Franz Waxman\n| valign=\"top\" width=\"50%\" |\n* '\"Thanks for the Memory\" from The Big Broadcast of 1938&nbsp;– Music by Ralph Rainger; Lyrics by Leo Robin'\n** \"Always and Always\" from Mannequin&nbsp;– Music by Edward Ward; Lyrics by Chet Forrest and Bob Wright\n** \"Change Partners\" from Carefree&nbsp;– Music and Lyrics by Irving Berlin\n** \"The Cowboy and the Lady\" from The Cowboy and the Lady&nbsp;– Music by Lionel Newman; Lyrics by Arthur Quenzer\n** \"Dust\" from Under Western Stars&nbsp;– Music and Lyrics by Johnny Marvin\n** \"Jeepers Creepers\" from Going Places&nbsp;– Music by Harry Warren; Lyrics by Johnny Mercer\n** \"Merrily We Live\" from Merrily We Live&nbsp;– Music by Phil Charig; Lyrics by Arthur Quenzer\n** \"A Mist Over the Moon\" from The Lady Objects&nbsp;– Music by Ben Oakland; Lyrics by Oscar Hammerstein II\n** \"My Own\" from That Certain Age&nbsp;– Music by Jimmy McHugh; Lyrics by Harold Adamson\n** \"Now It Can Be Told\" from Alexander's Ragtime Band&nbsp;– Music and Lyrics by Irving Berlin\n|-\n| valign=\"top\" width=\"50%\" |\n* 'The Cowboy and the Lady&nbsp;– Thomas T. Moulton'\n** Army Girl&nbsp;– Charles L. Lootens\n** Four Daughters&nbsp;– Nathan Levinson\n** If I Were King&nbsp;– Loren L. Ryder\n** Merrily We Live&nbsp;– Elmer Raguse\n** Suez&nbsp;– Edmund H. Hansen\n** Sweethearts&nbsp;– Douglas Shearer\n** That Certain Age&nbsp;– Bernard B. Brown\n** Vivacious Lady&nbsp;– John O. Aalberg\n** You Can't Take It with You&nbsp;– John P. Livadary\n| valign=\"top\" width=\"50%\" |\n* 'The Adventures of Robin Hood&nbsp;– Carl Jules Weyl'\n** The Adventures of Tom Sawyer&nbsp;– Lyle R. Wheeler\n** Alexander's Ragtime Band&nbsp;– Bernard Herzbrun and Boris Leven\n** Algiers&nbsp;– Alexander Toluboff\n** Carefree&nbsp;– Van Nest Polglase\n** The Goldwyn Follies&nbsp;– Richard Day\n** Holiday&nbsp;– Stephen Goosson and Lionel Banks\n** If I Were King&nbsp;– Hans Dreier and John B. Goodman\n** Mad About Music&nbsp;– Jack Otterson\n** Marie Antoinette&nbsp;– Cedric Gibbons\n** Merrily We Live&nbsp;– Charles D. Hall\n|-\n| valign=\"top\" width=\"50%\" |\n* 'The Great Waltz&nbsp;– Joseph Ruttenberg'\n** Algiers&nbsp;– James Wong Howe\n** Army Girl&nbsp;– Ernest Miller and Harry J. Wild\n** The Buccaneer&nbsp;– Victor Milner\n** Jezebel&nbsp;– Ernest Haller\n** Mad About Music&nbsp;– Joseph Valentine\n** Merrily We Live&nbsp;– Norbert Brodine\n** Suez&nbsp;– Peverell Marley\n** Vivacious Lady&nbsp;– Robert De Grasse\n** You Can't Take It with You&nbsp;– Joseph Walker\n** The Young in Heart&nbsp;– Leon Shamroy\n| valign=\"top\" width=\"50%\" |\n* 'The Adventures of Robin Hood&nbsp;– Ralph Dawson'\n** Alexander's Ragtime Band&nbsp;– Barbara McLean\n** The Great Waltz&nbsp;– Tom Held\n** Test Pilot&nbsp;– Tom Held\n** You Can't Take It with You&nbsp;– Gene Havlick\n|}\nSpecial Awards\n* To Deanna Durbin and Mickey Rooney for their significant contribution in bringing to the screen the spirit and personification of youth, and as juvenile players setting a high standard of ability and achievement. (Shared; miniature statuette)\n* To Harry M. Warner in recognition of patriotic service in the production of historical short subjects presenting significant episodes in the early struggle of the American people for liberty. (Scroll)\n* To Walt Disney for Snow White and the Seven Dwarfs, recognized as a significant screen innovation which has charmed millions and pioneered a great new entertainment field for the motion picture cartoon. (One statuette and seven miniature statuettes, representing the Seven Dwarfs, on a stepped base.) This is a rare case of a film being recognized in two succeeding ceremonies, as the film was also nominated for Best Score the previous year at the 10th Academy Awards.\n* To Oliver Marsh and Allen Davey for the color cinematography of the Metro-Goldwyn-Mayer production, Sweethearts. (Plaque)\n* For outstanding achievement in creating Special Photographic and Sound Effects in the Paramount production, Spawn of the North. Special Effects by Gordon Jennings, assisted by Jan Domela, Dev Jennings, Irmin Roberts and Art Smith. Transparencies by Farciot Edouart, assisted by Loyal Griggs. Sound Effects by Loren Ryder, assisted by Harry Mills, Louis H. Mesenkop and Walter Oberst. (Plaque)\n* To J. Arthur Ball for his outstanding contributions to the advancement of color in Motion Picture Photography. (Scroll)\nIrving G. Thalberg Memorial Award\n* Hal B. Wallis\nMultiple nominations and awards\n{| class=\"wikitable\" rowspan=\"2\" style=\"text-align:center;\"\n|+ Films with multiple nominations\n|-\n! scope=\"col\" style=\"width:55px;\" |Nominations\n! scope=\"col\" style=\"text-align:center;\" |Film\n|-\n| rowspan=\"1\" style=\"text-align:center\" | 7\n| You Can't Take It with You\n|-\n| rowspan=\"1\" style=\"text-align:center\" | 6\n| Alexander's Ragtime Band\n|-\n| rowspan=\"4\" style=\"text-align:center\" | 5\n| Boys Town\n|-\n| Four Daughters\n|-\n| Jezebel\n|-\n| Merrily We Live\n|-\n| rowspan=\"7\" style=\"text-align:center\" |4\n| The Adventures of Robin Hood\n|-\n| Algiers\n|-\n| The Citadel\n|-\n| If I Were King\n|-\n| Mad About Music\n|-\n| Marie Antoinette\n|-\n| Pygmalion\n|-\n|rowspan=\"8\" style=\"text-align:center\" | 3\n| Angels with Dirty Faces\n|-\n| Army Girl\n|-\n| Carefree\n|-\n| The Cowboy and the Lady\n|-\n| The Great Waltz\n|-\n| Suez\n|-\n| Test Pilot\n|-\n| The Young in Heart\n|-\n|rowspan=\"5\" style=\"text-align:center\" | 2\n| Blockade\n|-\n| The Goldwyn Follies\n|-\n| Sweethearts\n|-\n| That Certain Age\n|-\n| Vivacious Lady\n|-\n|}\n{| class=\"wikitable\" rowspan=\"2\" style=\"text-align:center;\"\n|+ Films with multiple awards\n|-\n! scope=\"col\" style=\"width:55px;\" |Awards\n! scope=\"col\" style=\"text-align:center;\" |Film\n|-\n| rowspan=1, style=\"text-align:center\" | 3\n| The Adventures of Robin Hood\n|-\n| rowspan=3, style=\"text-align:center\" | 2\n| Boys Town\n|-\n| Jezebel\n|-\n| You Can't Take It with You''\n|-\n|}\nSee also\n* 1938 in film\nReferences\nNotes\nExternal links\n* [http://www.oscar.com/ Official Website of the Academy of Motion Picture Arts and Sciences]"
    }
  ]
}