{
  "content": [
    {
      "type": "text",
      "text": "# 11th century in science\n\nThis is a summary of the 11th century in science and technology.\nof different phases of the moon, from Kitab al-Tafhim (in Persian)]]\nAl-Biruni is regarded as one of the greatest scholars of 11th century and was well versed in physics, mathematics, astronomy, and natural sciences, and also distinguished himself as a historian, chronologist and linguist.\nOf the 146 books known to have been written by Bīrūnī, 95 were devoted to astronomy, mathematics, and related subjects like mathematical geography.\nPredicted and scheduled events\n* List of 11th-century lunar eclipses\n* List of solar eclipses in the 11th century\nOptics\n]]\n* Book of Optics (كتاب المناظر) was written by Alhazen.\nGeography\n* Al-Bakri wrote about Europe, North Africa, and the Arabian Peninsula. Only two of his works have survived. His ''Mu'jam  mā ista'jam contains a list of place names mostly within the Arabian peninsular with an introduction giving the geographical background.\n* The Mas'udi Canon'' (Persian قانون مسعودي) - an extensive encyclopedia on astronomy, geography, and engineering, named after Mas'ud, son of Mahmud of Ghazni, to whom he dedicated.\n* Leif Ericsson claims to have made landfall at three lands in North America, one of which he names Vinland meaning the land of wine.\nWarfare\n* A Chinese manual on warfare includes the earliest known description of gunpowder.\nPrinting\n* The concept of movable kind for printing is pioneered in China, using fired clay, but it proves impractical.\nAstronomy\n* The Book of Instruction in the Elements of the Art of Astrology (Kitab al-tafhim li-awa’il sina‘at al-tanjim).\n* The Remaining Signs of Past Centuries (Arabic الآثار الباقية عن القرون الخالية) - a comparative study of calendars of different cultures and civilizations, interlaced with mathematical, astronomical, and historical information.\n* ''The Mas'udi Canon'' (Persian قانون مسعودي) - an extensive encyclopedia on astronomy, geography, and engineering, named after Mas'ud, son - a question and answer style book about mathematics and astronomy, in Arabic and Persian.\n* Astronomers in China and Japan observe the explosion of the supernova which is still visible as the Crab Nebula.\nMedicines\n* Pharmacy - about drugs and medicines.\nSurgery\n* The first illustrated manual of surgery is written by Abul Kasim in Cordoba.\nGeology and minerals\n* Gems (Arabic الجماهر في معرفة الجواهر) about geology, minerals, and gems, dedicated to Mawdud son of Mas'ud.\nOther\n* Su Sung, a Buddhist monk, created in China the principle of the escapement in his tower clock worked by a water wheel.\n* Three lustre decorations were developed in Syria between the 11th century and 13th century. These include Tell Minis (a yellow-orange color), Raqqa (a red-brown color) and Damascus (a yellow-brown color).\nBirths\nRecord keeping was not great at the time, so the births of significant figures in science in the 11th century are primarily unknown.\nDeaths\nRecord keeping was not great at the time, so the deaths of significant figures in science in the 11th century are primarily unknown.\nSee also\n* Science in the medieval Islamic world\nReferences"
    }
  ]
}