{
  "content": [
    {
      "type": "text",
      "text": "# 12th Canadian Screen Awards\n\nThe 12th Canadian Screen Awards were presented by the Academy of Canadian Cinema & Television to honour achievements in Canadian film, television and digital media production in 2023. They were held at the Canadian Broadcasting Centre in Toronto from 28–31 May 2024, as part of Canadian Screen Week, with highlights of the final gala ceremony broadcast in a CBC Television special on 31 May 2024.\nNominations were announced on 6 March; television drama Little Bird led in overall nominations with 19, while Matt Johnson's film BlackBerry received 17 nominations—becoming the most-nominated film in the history of the ceremony. Both BlackBerry and Little Bird would win the most awards in their respective categories.\nCeremony information\nDue to venue availability issues in Toronto, the ceremony was delayed from a provisional April scheduling to May 2024. In addition, the ceremonies were held at the Canadian Broadcasting Centre rather than Meridian Hall as in past years. Academy CEO Tammy Frick later stated that this scheduling also aligned the ceremony with the television upfronts season, as well as the period of industry activity between the Cannes Film Festival and the Banff World Media Festival. To streamline the event, the ceremony for children's and animated programming was discontinued, with its awards dispersed into the six remaining ceremonies.\nCBC Television would air an hour-long special on 31 May, featuring highlights of the final gala. In response to criticism over the format and delayed broadcast of the special for the previous year's ceremonies (which aired on the Sunday following the ceremony), the Academy announced that the special would instead air on the same day. Frick stated that broadcasting the special on the same day as the final gala would help preserve its \"energy\" and immediacy, while still allowing time to edit out \"industry-heavy elements\" that may not be interesting to television audiences.\nThe main gala was hosted by comedian Mae Martin. The Canadian Screen Week events were hosted by Sarah Davis (news, entertainment and sports), Andrew Phung (television craft), Keshia Chanté (television program and performance), Anne-Marie Mediwake (documentary, factual, lifestyle, and reality), and Sabine Daniel (cinematic arts).\nCategory changes\nFilm\nThe Best Lead Performance in a Film and Best Supporting Performance in a Film categories were split into separate categories for comedy and drama films. They were also accompanied by a new award for Best Performance in a Live Action Short Drama. The number of nominees in each acting category remain at eight. The categories for best director, best original and adapted screenplay and the John Dunning Award for best first film are now allowed to name six nominees instead of five if the number of eligible submissions reaches or exceeds nine. A new category was also introduced for Best Sound Design in a Documentary.\nTelevision\nThe award for Best Performance in a Children's or Youth Program or Series were split into separate new lead and supporting awards, and new awards were introduced for best ensemble performance in comedy and drama.\nThe former category for Best Talk Program or Series, which considered talk and interview programming regardless of its topic and format, was split into distinct new categories: Best Talk Series for entertainment and cultural talk series, and Best Political News Program or Series for news-oriented shows. One-off entertainment talk specials which may formerly have been considered under the old category are now restricted to Best Entertainment News Program or Series.\nA new category for Best Comedy Special was introduced, with stand-up comedy specials becoming ineligible for Best Variety or Entertainment Special and Best Performing Arts Program as a result.\nAdult animation productions became eligible for Best Comedy Series.\nA new category was introduced for Best Picture Editing in Animation.\nDigital media\nThe awards for Best Virtual Reality Game and Best Children's Video Game, which existed as distinct submission categories but had not consistently been presented in recent years due to high variability in the number of eligible submissions, were discontinued. All games in those categories will remain eligible for the main Best Video Game category.\nA new category was introduced for Best Picture Editing in a Web Program or Series.\nSpecial awards\nThe first special award recipients were announced in March 2024: Several further special awards were announced in early April, with a third round of honorees announced on May 1.\n*Lifetime Achievement: Marilyn Denis\n*Board of Directors Tribute: John Brunton, Jeff Barnaby\n*Changemaker Award: Tonya Williams\n*Radius Award: Devery Jacobs, Lamar Johnson\n*Gordon Sinclair Award: Paul Workman\n*Sustainable Production Award: Science North, Jane Goodall: Reasons for Hope\n*Academy Icon Award: Denis Villeneuve\n*Industry Leadership Award: Michael MacMillan\n*Earle Grey Award: Patrick Huard\nFilm\n{| class=wikitable width=\"100%\"\n|-\n! style=\"background:#EEDD82; width:50%\" | Best Motion Picture\n! style=\"background:#EEDD82; width:50%\" | Best Direction\n|-\n| valign=\"top\" |\n* 'BlackBerry — Niv Fichman, Matthew Miller, Fraser Ash, Kevin Krikst'\n*Humanist Vampire Seeking Consenting Suicidal Person (Vampire humaniste cherche suicidaire consentant) — Jeanne-Marie Poulain, Line Sander Egede\n*Infinity Pool — Karen Harnisch, Andrew Cividino, Christina Piovesan, Noah Segal, Rob Cotterill, Anita Juka, Daniel Kresmery, Jonathan Halperyn\n*Red Rooms (Les Chambres rouges) — Dominique Dussault\n*Richelieu — Geneviève Gosselin-G.\n*Solo — Étienne Hansez\n| valign=\"top\" |\n* 'Matt Johnson, BlackBerry'\n*Brandon Cronenberg, Infinity Pool\n*Sophie Dupuis, Solo\n*Ariane Louis-Seize, Humanist Vampire Seeking Consenting Suicidal Person (Vampire humaniste cherche suicidaire consentant)\n*Henri Pardo, Kanaval\n*Pascal Plante, Red Rooms (Les Chambres rouges)\n|-\n! style=\"background:#EEDD82; width:50%\" | Best Lead Performance in a Comedy Film\n! style=\"background:#EEDD82; width:50%\" | Best Lead Performance in a Drama Film\n|-\n| valign=\"top\" |\n* 'Jay Baruchel, BlackBerry'\n*Félix-Antoine Bénard, Humanist Vampire Seeking Consenting Suicidal Person (Vampire humaniste cherche suicidaire consentant)\n*Alexandra Billings, Queen Tut\n*Susan Kent, ''Who's Yer Father?\n*Magalie Lépine-Blondeau, The Nature of Love (Simple comme Sylvain)\n*Cody Lightning, Hey, Viktor!\n*Chris Locke, Who's Yer Father?\n*Sara Montpetit, Humanist Vampire Seeking Consenting Suicidal Person (Vampire humaniste cherche suicidaire consentant)\n| valign=\"top\" |\n* 'Amrit Kaur, The Queen of My Dreams'\n*Ariane Castellanos, Richelieu\n*Rayan Dieudonné, Kanaval\n*Juliette Gariépy, Red Rooms (Les Chambres rouges)\n*Mia Goth, Infinity Pool\n*Oyin Oladejo, Orah\n*Théodore Pellerin, Solo\n*Alexander Skarsgård, Infinity Pool\n|-\n! style=\"background:#EEDD82; width:50%\" | Best Supporting Performance in a Comedy Film\n! style=\"background:#EEDD82; width:50%\" | Best Supporting Performance in a Drama Film\n|-\n| valign=\"top\" |\n* 'Glenn Howerton, BlackBerry'\n*Hannah Cheesman, Hey, Viktor!\n*Charlie Gillespie, Suze\n*Matt Johnson, BlackBerry\n*Steve Laplante, Humanist Vampire Seeking Consenting Suicidal Person (Vampire humaniste cherche suicidaire consentant)\n*Marc-André Leclair, One Summer (Le temps d'un été)\n*Guy Nadon, One Summer (Le temps d'un été)''\n*Noémie O'Farrell, Humanist Vampire Seeking Consenting Suicidal Person (Vampire humaniste cherche suicidaire consentant)\n| valign=\"top\" |\n* 'Chantal Thuy, Ru'\n*Laurie Babin, Red Rooms (Les Chambres rouges)\n*Nelson Coronado, Richelieu\n*Martin Dubreuil, Kanaval\n*Frances Fisher, The King Tide\n*Charles-Aubey Houde, The Dishwasher (Le Plongeur)\n*Alexis Vincent-Wolfe, Slash/Back\n*Aden Young, The King Tide\n|-\n! style=\"background:#EEDD82; width:50%\" | Best Original Screenplay\n! style=\"background:#EEDD82; width:50%\" | Best Adapted Screenplay\n|-\n| valign=\"top\" |\n* 'Ariane Louis-Seize and Christine Doyon, Humanist Vampire Seeking Consenting Suicidal Person (Vampire humaniste cherche suicidaire consentant)'\n*Monia Chokri, The Nature of Love (Simple comme Sylvain)\n*Brandon Cronenberg, Infinity Pool\n*Delphine Girard, Through the Night (Quitter la nuit)\n*Cody Lightning and Samuel Miller, Hey, Viktor!\n*Pascal Plante, Red Rooms (Les Chambres rouges)\n| valign=\"top\" |\n* 'Matt Johnson and Matthew Miller, BlackBerry'\n*Sarah-Maude Beauchesne, Billie Blue (Cœur de slush)\n*Éric K. Boulianne and Francis Leclerc, The Dishwasher (Le Plongeur)\n*Jacques Davidts, Ru\n*Fawzia Mirza, The Queen of My Dreams\n*Alexandra Weir, North of Normal\n|-\n! style=\"background:#EEDD82; width:50%\" | Best Feature Length Documentary\n! style=\"background:#EEDD82; width:50%\" | Best Short Documentary\n|-\n| valign=\"top\" |\n* 'Twice Colonized — Lin Alluna, Stacey Aglok Macdonald, Alethea Arnaquq-Baril, Emile Hertling Péronard, Bob Moore'\n*Beyond Paper (Au-delà du papier) — Oana Suteu Khintirian, Nathalie Cloutier\n*Kite Zo A: Leave the Bones — Kaveh Nabatian\n*The Longest Goodbye — Paul Cadieux, Ido Mizrahy, Nir Sa'ar\n*Someone Lives Here — Zack Russell, Matt King, Andrew Ferguson, Marianna Khoury, Will Goldbloom, Tinu Sinha, Will Lomoro\n| valign=\"top\" |\n* 'Madeleine — Raquel Sancinetti'\n*Cherry — Laurence Gagné-Frégeau\n*Oasis — Justine Martin, Louis-Emmanuel Gagné-Brochu\n*Violet Gave Willingly — Claire Sanford\n*Zug Island — Nicolas Lachapelle\n|-\n! style=\"background:#EEDD82; width:50%\" | Best Live Action Short Drama\n! style=\"background:#EEDD82; width:50%\" | Best Performance in a Live Action Short Drama\n|-\n| valign=\"top\" |\n* 'Motherland ― Jasmin Mozaffari, Priscilla Galvez, Caitlin Grabham'\n*Death to the Bikini! (À mort le bikini!) ― Justine Gauthier, Léonie Hurtubise\n*''Heat Spell (L'Été des chaleurs) — Amélie Tremblay, Marie-Pier Dupuis, Dominique Dussault\n*Invincible ― Samuel Caron, Vincent René-Lortie\n*Mothers and Monsters ― Patrick Francke-Sirois, Isabelle Grignon-Francke, Édith Jorisch\n| valign=\"top\" |\n* 'Behtash Fazlali, Motherland'\n*Léokim Beaumier-Lépine, Invincible\n*Florence Blain Mbaye, Making Babies (Faire un enfant)\n*Éric K. Boulianne, Making Babies (Faire un enfant)\n*Marine Johnson, Until You Die (Jusqu’à ce que tu meures)\n*Agathe Ledoux, Heat Spell (L'Été des chaleurs)\n*Ilyes Tarmasti, Muscat\n*Anthony Therrien, Until You Die (Jusqu’à ce que tu meures)\n|-\n! style=\"background:#EEDD82; width:50%\" | Best Animated Short\n! style=\"background:#EEDD82; width:50%\" | John Dunning Best First Feature\n|-\n| valign=\"top\" |\n* '''Where Rabbits Come From (D'où viennent les lapins) — Colin Ludvic Racicot, Bertrand Paquette, Simon Allard'\n*Aphasia (Aphasie) — Marielle Dalpé, Marc Bertrand\n*Miserable Miracle (Misérable Miracle) — Ryo Orikasa, Emmanuel-Alain Raynal, Pierre Baussaron, Jelena Popović, Nobuaki Doi, Rob McLaughlin, Michael Fukushima\n*Return to Hairy Hill (Retour à Hairy Hill) — Emily Paige, Daniel Gies\n*The Temple (Le Temple) — Alain Fournier\n| valign=\"top\" |\n* 'In Flames — Zarrar Kahn'\n*Humanist Vampire Seeking Consenting Suicidal Person (Vampire humaniste cherche suicidaire consentant) — Ariane Louis-Seize\n*Kanaval — Henri Pardo\n*Richelieu — Pier-Philippe Chevigny\n*Something You Said Last Night — Luis De Filippis\n*Through the Night (Quitter la nuit) — Delphine Girard\n|-\n! style=\"background:#EEDD82; width:50%\" | Best Art Direction/Production Design\n! style=\"background:#EEDD82; width:50%\" | Best Cinematography\n|-\n| valign=\"top\" |\n* 'Adam Belanger, Kerry Noonan and Lucy Larkin, BlackBerry'\n*Ludovic Dufresne, Humanist Vampire Seeking Consenting Suicidal Person (Vampire humaniste cherche suicidaire consentant)\n*Thea Hollatz, Fitting In\n*Marie-Hélène Lavoie, Ru\n*Michael Pierson, The Queen of My Dreams\n| valign=\"top\" |\n* 'Jared Raab, BlackBerry'\n*Gabriel Brault-Tardif, Richelieu\n*Alexandre Bussière, Montreal Girls\n*Karim Hussain, Infinity Pool\n*Mathieu Laverdière, Solo\n*Jean-François Lord, Ru\n*Mike McLaughlin, Hands That Bind\n*André Turpin, The Nature of Love (Simple comme Sylvain)\n|-\n! style=\"background:#EEDD82; width:50%\" | Best Costume Design\n! style=\"background:#EEDD82; width:50%\" | Best Editing\n|-\n| valign=\"top\" |\n* 'Hanna Puley, BlackBerry'\n*Kelly-Anne Bonieux, Humanist Vampire Seeking Consenting Suicidal Person (Vampire humaniste cherche suicidaire consentant)\n*Rosalie Clermont, Ru\n*Athena Theny, Seagrass\n*Mara Zigler, Something You Said Last Night\n| valign=\"top\" |\n* 'Curt Lobb, BlackBerry'\n*Pauline Gaillard, The Nature of Love (Simple comme Sylvain)\n*Stéphane Lafleur, Humanist Vampire Seeking Consenting Suicidal Person (Vampire humaniste cherche suicidaire consentant)\n*Isabelle Malenfant, The Dishwasher (Le Plongeur)\n*James Vandewater, Infinity Pool\n|-\n! style=\"background:#EEDD82; width:50%\" | Best Sound Editing\n! style=\"background:#EEDD82; width:50%\" | Best Sound Mixing\n|-\n| valign=\"top\" |\n* 'Matthew Chan, Gabe Knox, Michelle Irving, Lucas Prokaziuk, Stefan Fraticelli and Jason Charbonneau, BlackBerry'\n*Pierre-Jules Audet, Marie-Miel Lacasse Hévey, Monique Vézina and Natalie Fleurant, Ru\n*John Blerot, Hands That Bind\n*Alex Bullick, Jill Purdy, Rob Bertola and Craig MacLellan, Infinity Pool\n*J.R. Fountain, PAW Patrol: The Mighty Movie\n| valign=\"top\" |\n* 'Matthew Chan, Bret Killoran, Nathan Street, Paul Lynch, Randy Wilson, Ron Mellegers and Justin Helle, BlackBerry'\n*Tyler Bogaert, Ian Rankin and Will Stephens, The Young Arsonists\n*Bernard Gariépy Strobl and J.R. Fountain, PAW Patrol: The Mighty Movie\n*Hans Laitres, Guillaume Daoust, Maxime Vermette, Daniel Bisson and Mathieu Maillé, Ru\n*Brent Planiden and Chris Ferguson, Cold Road\n|-\n! style=\"background:#EEDD82; width:50%\" | Best Original Score\n! style=\"background:#EEDD82; width:50%\" | Best Original Song\n|-\n| valign=\"top\" |\n* 'Jay McCarrol, BlackBerry'\n*Alysha Brilla, The Queen of My Dreams\n*Suad Bushnaq, Queen Tut\n*Steph Copeland, Cascade\n*Ryan Shore, Zombie Town\n| valign=\"top\" |\n* 'Qurram Hussain, \"Ishq Ki Na Koi Bhi Hud Hai\" — The Queen of My Dreams'\n*Kamel Bushnaq, Ashley Jane and Suad Bushnaq, \"I Won't Break\" — Queen Tut\n*Suad Bushnaq and Omar El-Deeb, \"Chez Habibi (Kul illi Batmannah)\" — Queen Tut\n*Melissa D'Agostino, David Brock and Rebecca Everett, \"Mothers and Daughters, Daughters and Moms\" — Mother of All Shows\n*Lawrence Gowan, \"Zombie Hideout\" — Zombie Town\n|-\n! style=\"background:#EEDD82; width:50%\" | Best Makeup\n! style=\"background:#EEDD82; width:50%\" | Best Hair\n|-\n| valign=\"top\" |\n* 'Dan Martin, Traci Loader and Svetlana Gutic, Infinity Pool'\n*Katie Ballantyne, Jonathan Craig and Karlee Morse, The Hyperborean\n*Dominique T. Hasbani, Ru\n*Fatema Hoque, ''Who's Yer Father?\n*Karlee Morse and Mary Cuffe, Polaris\n*Erin Pidgeon, Zombie Town\n*Ashley Vieira, Erin Sweeney and Thea Samuels, BlackBerry\n| valign=\"top\" |\n* 'Dylan Twigg and Philippe Bertrand-Hudon, BlackBerry'\n*Vincent Dufault, Ru\n*Nermin Grbic and Carole Bertini, One Summer (Le temps d'un été)\n*Mykola Korolyov, Better Days\n*Isabelle Paganine, Seagrass\n*Rikki Zucker, Mother of All Shows\n|-\n! style=\"background:#EEDD82; width:50%\" | Best Cinematography in a Documentary\n! style=\"background:#EEDD82; width:50%\" | Best Editing in a Documentary\n|-\n| valign=\"top\" |\n* 'Kaveh Nabatian, Kite Zo A: Leave the Bones'\n*Ben Giesbrecht and Luke Connor, Aitamaako'tamisskapi Natosi: Before the Sun\n*Patrick McGowan and Jason Providence, Coven\n*Ernesto Pardo, The White Guard (La Garde blanche)\n*Étienne Roussy, Beyond Paper (Au-delà du papier)\n| valign=\"top\" |\n* 'Anouk Deschênes, The Longest Goodbye'\n*Denys Desjardins and Michel Giroux, I Lost My Mom (J'ai placé ma mère)\n*Derek Esposito and Cecilio Escobar, Summer Qamp\n*Marianna Khoury, Someone Lives Here\n*Rich Williamson, Cynara\n|-\n! style=\"background:#EEDD82; width:50%\" | Best Original Music in a Documentary\n! style=\"background:#EEDD82; width:50%\" | Best Sound Design in a Documentary\n|-\n| valign=\"top\" |\n* 'Ramachandra Borcar, The Longest Goodbye'\n*Olivier Alary and Johannes Malfatti, Twice Colonized\n*Antoine Berthiaume, Greyland\n*Kat Duma, Verity Susman and Matthew Simms, Tramps!\n*Stéphanie Hamelin Tomala, I Lost My Mom (J'ai placé ma mère)\n| valign=\"top\" |\n* 'Sam Rodgers, James Lazarenko, Claire Dobson, Krystin Hunter, Graham Rogers, Jane Tattersall, Stefana Fratila, Paul Germann, Steve Medeiros, Marilee Yorston, Steve Hammond, David Yonson and Steve Copley, Swan Song'\n*Sylvain Bellemare and Isabelle Lussier, Days (Les jours)\n*Brian Eimer, Jane Goodall: Reasons for Hope\n*Hans Laitres, Sylvain Bellemare and Daniel Capeille, The White Guard (La Garde blanche)\n*Catherine Van Der Donckt, Stéphane Cadotte, Jean Paul Vialard and Geoffrey Mitchell, Beyond Paper (Au-delà du papier)\n|-\n! style=\"background:#EEDD82; width:50%\" | Best Visual Effects\n! style=\"background:#EEDD82; width:50%\" | Best Casting in a Film\n|-\n| valign=\"top\" |\n* 'Andy Robinson, Infinity Pool'\n*Jeff Bruneel, James Miligan, Tamara Young, Nick Winger and Adam Graves, In Flames\n*Adam Graves, The King Tide\n*Marie-Claude Lafontaine, Jean-François Ferland and Simon Beaupré, One Summer (Le temps d'un été)\n*Tristan Zerafa, Lou Gatti, Matthew Nayman and Mike Boers, BlackBerry\n| valign=\"top\" |\n* 'Pam Dixon, Jenny Lewis and Sara Kay, BlackBerry'\n*Tania Arana, Humanist Vampire Seeking Consenting Suicidal Person (Vampire humaniste cherche suicidaire consentant)\n*Mark Bennett and Deirdre Bowen, Infinity Pool\n*Ariane Castellanos and Victor Tremblay-Blouin, Richelieu\n*Jason Knight and John Buchan, Fitting In\n|-\n! style=\"background:#EEDD82; width:50%\" | Golden Screen Award\n|-\n| valign=\"top\" |\n* PAW Patrol: The Mighty Movie\n|}\nTelevision\nPrograms\n{| class=wikitable width=\"100%\"\n|-\n! style=\"background:#EEDD82; width:50%\" | Best Drama Series\n! style=\"background:#EEDD82; width:50%\" | Best Comedy Series\n|-\n| valign=\"top\" |\n* Little Bird\n*Essex County\n*Plan B\n*Slasher: Ripper\n*Transplant\n| valign=\"top\" |\n* Bria Mack Gets a Life\n*Letterkenny\n*Shelved\n*Son of a Critch\n*Workin' Moms\n|-\n! style=\"background:#EEDD82; width:50%\" | Animated program or series\n! style=\"background:#EEDD82; width:50%\" | Documentary program\n|-\n| valign=\"top\" |\n* Wild Kratts\n*Interstellar Ella\n*Pinecone & Pony\n*Snoopy Presents: One-of-a-Kind Marcie\n*The Snoopy Show\n| valign=\"top\" |\n* Broken: The Toxic Culture of Canadian Gymnastics\n*Charlotte's Castle\n*The Cowichan Sweater: Our Knitted Legacy\n*Offside: The Harold Ballard Story\n*War for the Woods''\n|-\n! style=\"background:#EEDD82; width:50%\" | Children's or youth fiction\n! style=\"background:#EEDD82; width:50%\" | Children's or youth non-fiction\n|-\n| valign=\"top\" |\n* The Hardy Boys\n*Home Sweet Rome\n*Macy Murdoch\n*Malory Towers\n| valign=\"top\" |\n* All-Round Champion\n*Dream It to Be It\n*Green Squad\n*''Sunny's Quest\n|-\n! style=\"background:#EEDD82; width:50%\" | TV Movie\n! style=\"background:#EEDD82; width:50%\" | History Documentary Program or Series\n|-\n| valign=\"top\" |\n* The Girl Who Escaped: The Kara Robinson Story\n*Christmas Island\n*Never Too Late to Celebrate\n*Richard III (CBC Presents the Stratford Festival)\n*Take Me Back for Christmas\n| valign=\"top\" |\n* Stuff the British Stole\n*The Man Who Stole Einstein's Brain\n*Mi'kma'ki\n*The Nature of Things: \"Secret Agents of the Underground Railroad\"\n*Telling Our Story\n|-\n! style=\"background:#EEDD82; width:50%\" | Biography or Arts Documentary Program or Series\n! style=\"background:#EEDD82; width:50%\" | Lifestyle Program or Series\n|-\n| valign=\"top\" |\n* 'eTalk: \"In Conversation with Jully Black\"'\n*I'm Sandie Rinaldo\n*2023 Indspire Awards\n*Queen of the Deuce\n*Star Wars Kid: The Rise of the Digital Shadows\n| valign=\"top\" |\n* Time to Eat\n*Drag Heals\n*Property Brothers: Forever Home\n*Sarah's Mountain Escape\n*Scott's Vacation House Rules\n|-\n! style=\"background:#EEDD82; width:50%\" | Factual series\n! style=\"background:#EEDD82; width:50%\" | Reality/Competition Program or Series\n|-\n| valign=\"top\" |\n* Thunder Bay\n*Bollywed\n*Cocaine, Prison & Likes: Isabelle's True Story\n*Dark Side of the Ring\n*Little Big Community\n| valign=\"top\" |\n* '''Canada's Drag Race: Canada vs. the World'\n*The Amazing Race Canada\n*Best in Miniature\n*Big Brother Canada\n*''Canada's Ultimate Challenge\n|-\n! style=\"background:#EEDD82; width:50%\" | Pre-School program or series\n! style=\"background:#EEDD82; width:50%\" | Sketch comedy program or series\n|-\n| valign=\"top\" |\n* PAW Patrol\n*Aunty B's House\n*Builder Brothers Dream Factory\n*Daniel Tiger's Neighbourhood\n*Dino Ranch\n| valign=\"top\" |\n* This Hour Has 22 Minutes\n*Abroad\n*The Dessert\n*Pillow Talk\n|-\n! style=\"background:#EEDD82; width:50%\" | Science or Nature Documentary Program or Series (Rob Stewart Award)\n! style=\"background:#EEDD82; width:50%\" | Social/Political Documentary Program (Donald Brittain Award)\n|-\n| valign=\"top\" |\n* The Water Brothers\n*Ageless Gardens\n*The Nature of Things: \"Apocalypse, Plan B\"\n*The Nature of Things: \"True Survivors\"\n| valign=\"top\" |\n* Coming Home: Wanna Icipus Kupi\n*Category Woman\n*Marketplace: \"Mortgage Fraud Caught on Camera\"\n*Naked: Sex and Gender\n*The Passionate Eye: \"Inside the Statue Wars\"\n|-\n! style=\"background:#EEDD82; width:50%\" | Comedy special\n! style=\"background:#EEDD82; width:50%\" | Variety or entertainment special\n|-\n| valign=\"top\" |\n* 'Comedy Invasion: \"Rez Style\"'\n*Hannah Gadsby: Dry\n*The New Wave of Standup: \"Andrea Jin, Hoodo Hersi, Nick Nemeroff\"\n*Winnipeg Comedy Festival: \"Misguidance Systems\"\n| valign=\"top\" |\n* 'This Hour Has 22 Minutes: \"This Special Has 30 Years\"'\n*Canada's New Year's Eve: Countdown to 2023\n*eTalk: \"Pageboy, The Elliot Page Interview\"\n*Jann: Alone for the Holidays\n|-\n! style=\"background:#EEDD82; width:50%\" | Talk series\n! style=\"background:#EEDD82; width:50%\" | Live entertainment special\n|-\n| valign=\"top\" |\n* The Marilyn Denis Show\n*CBC News: It Changed Everything\n*CityLine\n| valign=\"top\" |\n* 2023 Legacy Awards\n*2023 Canadian Country Music Awards\n*eTalk: \"Live at the Oscars\"\n*Juno Awards of 2023\n|}\nActors\n{| class=wikitable width=\"100%\"\n|-\n! style=\"background:#EEDD82; width:50%\" | Lead performance, drama\n! style=\"background:#EEDD82; width:50%\" | Supporting performance, drama\n|-\n| valign=\"top\" |\n* 'Darla Contois, Little Bird'\n*Victor Garber, Family Law\n*Hamza Haq, Transplant\n*Ellyn Jade, Little Bird\n*Laurence Leboeuf, Transplant\n*Meredith MacNeill, Pretty Hard Cases\n*Adrienne C. Moore, Pretty Hard Cases\n*Mayko Nguyen, Hudson & Rex\n| valign=\"top\" |\n* 'Braeden Clarke, Little Bird'\n*Salvatore Antonio, Slasher: Ripper\n*Paula Brancati, Slasher: Ripper\n*Kevin Durand, Essex County\n*Emma Hunter, Moonshine\n*Ayisha Issa, Transplant\n*Ksenia Daniela Kharlamova, Robyn Hood\n*Lynn Rafferty, Bad Behind Bars: Jodi Arias\n|-\n! style=\"background:#EEDD82; width:50%\" | Lead performance, comedy\n! style=\"background:#EEDD82; width:50%\" | Supporting performance, comedy\n|-\n| valign=\"top\" |\n* 'Meaghan Rath, Children Ruin Everything'\n*Benjamin Evan Ainsworth, Son of a Critch\n*Mark Critch, Son of a Critch\n*Dani Kind, Workin' Moms\n*Andrew Phung, Run the Burbs\n*Catherine Reitman, Workin' Moms\n*Chris Sandiford, Shelved\n*Carolyn Taylor, I Have Nothing\n| valign=\"top\" |\n* 'Ennis Esmer, Children Ruin Everything'\n*Amanda Cordner, Sort Of\n*Ali Hassan, Run the Burbs\n*Jonathan Langdon, Run the Burbs\n*Sarah McVie, Workin' Moms\n*Ellora Patnaik, Sort Of\n*Jonathan Torrens, Vollies\n*Supinder Wraich, Sort Of\n|-\n! style=\"background:#EEDD82; width:50%\" | Performance in a television film or miniseries\n! style=\"background:#EEDD82; width:50%\" | Performance in an animated program or series\n|-\n| valign=\"top\" |\n* 'Katie Douglas, The Girl Who Escaped: The Kara Robinson Story'\n*Robyn Alomar, Terror Train\n*Katherine Barrell, Making Scents of Love\n*Jonathan Langdon, Faith Heist: A Christmas Caper\n*Ashley Leggat, Life with Luca\n*Alex Mallari Jr., One Delicious Christmas\n*Niall Matter, Family History Mysteries: Buried Past\n*Sherry Miller, Never Too Late to Celebrate\n| valign=\"top\" |\n* 'Jayne Eastwood, PAW Patrol'\n*Cory Doran, Super Wish\n*Sara Garcia, Unicorn Academy\n*Ana Sani, Strawberry Shortcake and the Beast of Berry Bog\n*Patty Sullivan, Mittens & Pants\n|-\n! style=\"background:#EEDD82; width:50%\" | Performance in a guest role in a comedy series\n! style=\"background:#EEDD82; width:50%\" | Performance in a guest role in a drama series\n|-\n| valign=\"top\" |\n* 'Mae Martin, I Have Nothing'\n*Jann Arden, Workin' Moms\n*Dan Aykroyd, Workin' Moms\n*Jay Baruchel, Son of a Critch\n*Ali Hassan, Sort Of\n| valign=\"top\" |\n* 'Daniel Maslany, Transplant'\n*Imajyn Cardinal, Little Bird\n*Lauren Holly, Family Law\n*Dani Kind, SkyMed\n*Manuel Rodriguez, Robyn Hood''\n|-\n! style=\"background:#EEDD82; width:50%\" | Lead performance in a children's or youth program or series\n! style=\"background:#EEDD82; width:50%\" | Supporting performance in a children's or youth program or series\n|-\n| valign=\"top\" |\n* 'Khalilah Brooks, Aunty B's House'\n*Mia Bella, Popularity Papers\n*Kaileen Chang, I Woke Up a Vampire\n*Glee Dango, Popularity Papers\n*Zoe Wiesenthal, Ruby and the Well\n| valign=\"top\" |\n* 'Millie Davis, Popularity Papers'\n*Paula Boudreau, Ruby and the Well\n*Nendia Lewars, ''Aunty B's House\n*Claire Poon, Aunty B's House\n|-\n! style=\"background:#EEDD82; width:50%\" | Ensemble performance in a comedy series\n! style=\"background:#EEDD82; width:50%\" | Ensemble performance in a drama series\n|-\n| valign=\"top\" |\n* 'Letterkenny — Jared Keeso, Nathan Dales, Michelle Mylett, K. Trevor Wilson, Dylan Playfair, Andrew Herr, Tyler Johnston, Evan Stern, Jacob Tierney, Mark Forward, Lisa Codrington, Kaniehtiio Horn'\n*Acting Good — Paul Rabliauskas, Roseanne Supernault, Billy Merasty, Gabriel Daniels, Avery Sutherland, Cheyenna Sapp, Tina Keeper\n*Shelved — Lyndie Greenwood, Chris Sandiford, Dakota Ray Hebert, Paul Braunstein, Taylor Love, Robin Duke, Varun Saranga, Paloma Nuñez\n*Slip — Zoe Lister-Jones, Tymika Tafari, Amar Chadha-Patel\n*Workin' Moms — Catherine Reitman, Dani Kind, Jessalyn Wanlim, Enuka Okuma, Sarah McVie, Sadie Munroe\n| valign=\"top\" |\n* 'Little Bird — Darla Contois, Ellyn Jade, Osawa Muskwa, Lisa Edelstein, Michelle Thrush, Braeden Clarke, Imajyn Cardinal, Joshua Odjick'\n*Essex County — Molly Parker, Stephen McHattie, Kevin Durand, Finlay Wojtak-Hissong, Brian J. Smith, Rossif Sutherland, Hannah Gross, Tamara Podemski, Daniel Maslany, Ryan Bruce, Matia Jackett, Stephen Kalyn, Derek Johns, Alexandra Ordolis\n*Pretty Hard Cases — Meredith MacNeill, Adrienne C. Moore, Daren A. Herbert, Al Mukadam, Karen Robinson, Tricia Black, Miguel Rivas\n*Robyn Hood — Jessye Romeo, Nykeem Provo, Idrissa Sanogo Bamba, Ksenia Daniela Kharlamova, Jonathan Langdon, Kira Guloien, Ian Matthews, Matias Garrido, Nadeem Phillip, Lisa Michelle Cornelius, Sydney Kuhne, Emily Piggford, Kayla Hutton\n|-\n! style=\"background:#EEDD82; width:50%\" | Ensemble performance in a variety or sketch comedy program or series\n|-\n| valign=\"top |\n* 'This Hour Has 22 Minutes — Mark Critch, Trent McClellan, Aba Amuquandoh, Stacey McGunnigle, Chris Wilson'\n*Abroad — Isabel Kanaan, Aldrin Bundoc, Joy Castro, Nicco Lorenzo Garcia, Justin Santiago\n*Pillow Talk — Nicola Correia-Damude, Matt Mazur, Carlos Gonzalez-Vio, Sydney Scotia, Gregory Prest, Paolo Santalucia, Chris Robinson, Kwasi Thomas, Andrew Wheeler, Sharon Crandall\n*Roast Battle Canada'' — Ennis Esmer, Russell Peters, Sabrina Jalees, K. Trevor Wilson, Allie Pearse, Bren D'Souza, Tyler Morrison, Crystal Ferrier\n|}\nNews and information\n{| class=wikitable width=\"100%\"\n|-\n! style=\"background:#EEDD82; width:50%\" | National newscast\n! style=\"background:#EEDD82; width:50%\" | Local newscast\n|-\n| valign=\"top\" |\n* CTV National News\n*CBC News: The National\n*Global National\n| valign=\"top\" |\n* CBC News Vancouver at 6\n*CBC News Winnipeg at 6\n*CityNews Toronto\n*CTV News Toronto at 6\n*Global BC News Hour\n|-\n! style=\"background:#EEDD82; width:50%\" | News anchor, national\n! style=\"background:#EEDD82; width:50%\" | News anchor, local\n|-\n| valign=\"top\" |\n* 'Adrienne Arsenault, CBC News: The National'\n*Dawna Friesen, Global National\n*Omar Sachedina, CTV National News\n*Dennis Ward, APTN: Remembering the Children\n| valign=\"top\" |\n* 'Debra Arbec, CBC News Montreal'\n*Chris Gailus and Sophie Lui, Global BC News Hour\n*Cynthia Mulligan, CityNews Toronto\n*Marivel Taruc, CBC News Toronto\n|-\n! style=\"background:#EEDD82; width:50%\" | News reporter, national\n! style=\"background:#EEDD82; width:50%\" | News reporter, local\n|-\n| valign=\"top\" |\n* 'Jorge Barrera, CBC News: The National'\n*Neetu Garcha, Global National\n*Adrian Ghobrial, CTV National News\n*Judy Trinh, CTV National News\n| valign=\"top\" |\n* 'Bartley Kives, CBC News Winnipeg'\n*Faiza Amin, CityNews Toronto\n*Michelle Ghoussoub, CBC News Vancouver\n*Jon Woodward, CTV Toronto\n|-\n! style=\"background:#EEDD82; width:50%\" | News special\n! style=\"background:#EEDD82; width:50%\" | News or information segment\n|-\n| valign=\"top\" |\n* 'Global News: \"Decision Alberta 2023\"'\n*CBC News: Here & Now: \"Picking up the Pieces: The Aftermath of Fiona\"\n*CityNews: \"The Coronation of King Charles III\"\n| valign=\"top\" |\n* 'W5: \"Narco Avocados\"'\n*APTN Investigates: \"Inside Corrections 2180 Days\"\n*CBC News Calgary: \"Who Was Behind the Coastal Gas Link Explosion?\"\n*CBC News: The National: \"Boomer's Story\"\n|-\n! style=\"background:#EEDD82; width:50%\" | Entertainment news series\n! style=\"background:#EEDD82; width:50%\" | Political news series\n|-\n| valign=\"top\" |\n*  Entertainment Tonight Canada\n* eTalk\n* Indigenous Artists & Icons: Inspiring Change\n| valign=\"top\" |\n* Power Play\n*Power & Politics\n*Question Period\n|-\n! style=\"background:#EEDD82; width:50%\" | News or information series\n! style=\"background:#EEDD82; width:50%\" | News or information program\n|-\n| valign=\"top\" |\n* APTN Investigates\n*The Fifth Estate\n*W5\n| valign=\"top\" |\n* 'Adrienne Arsenault Reports: \"Inside Ukraine\"'\n*APTN Investigates: \"Buried Truths\"\n*The Fifth Estate: \"Death at the Border\"\n*W5: \"Cocaine Cargo\"\n|-\n! style=\"background:#EEDD82; width:50%\" | Host or interviewer, news or information program or series\n! style=\"background:#EEDD82; width:50%\" | Host, talk show or entertainment news\n|-\n| valign=\"top\" |\n* 'Sarain Fox, VeraCity: \"Indigiqueer\"'\n*Harry Forestell, CBC News: The National\n*Avery Haines, W5\n*Ian Hanomansing, CBC News: The National\n*Vassy Kapelos, Question Period\n| valign=\"top\" |\n* 'Marilyn Denis, The Marilyn Denis Show'\n*Tyrone Edwards, Traci Melchor, Elaine Lui, Chloe Wilde, Sonia Mangat, Liz Trinnear and Priyanka, eTalk\n*Cheryl Hickey, Sangita Patel, Carlos Bustamante, Morgan Hoffman, Keshia Chanté, Brittnee Blair and Jed Tavernier, Entertainment Tonight Canada\n*Tracy Moore, CityLine\n*Sid Seixeiro and Dina Pugliese, Breakfast Television\n|-\n! style=\"background:#EEDD82; width:50%\" | Host, live entertainment special\n! style=\"background:#EEDD82; width:50%\" | Host, lifestyle\n|-\n| valign=\"top\" |\n* 'Simu Liu, Juno Awards of 2023'\n*Keshia Chanté, 2023 Legacy Awards\n*Tyrone Edwards, Elaine Lui and Traci Melchor, eTalk: \"Live at the Oscars\"\n*Rupi Kaur and Sarah Gadon, 2022 Scotiabank Giller Prize\n| valign=\"top\" |\n* 'Melissa Grelo, Cynthia Loyst, Elaine Lui, Andrea Bain and Jessica Allen, The Social'\n*Mary Berg, Mary Makes It Easy\n*Mena Massoud, Evolving Vegan\n*Drew Scott and Jonathan Silver Scott, Property Brothers: Forever Home\n*Tracey Erin Smith, Drag Heals\n|-\n! style=\"background:#EEDD82; width:50%\" | Host or presenter, factual or reality competition\n! style=\"background:#EEDD82; width:50%\" | Morning show\n|-\n| valign=\"top\" |\n* 'Brooke Lynn Hytes, Traci Melchor and Brad Goreski, Canada's Drag Race: Canada vs. the World'\n*Gerry Dee, Family Feud Canada\n*Lindsay Ell, Howie Mandel, Lilly Singh, Trish Stratus and Kardinal Offishall, ''Canada's Got Talent\n*Jonny Harris, Still Standing\n*Alan Shane Lewis and Ann Pornel, The Great Canadian Baking Show\n| valign=\"top\" |\n* Breakfast Television\n*CBC News: Morning Live\n*Your Morning\n|}\nSports\n{| class=wikitable width=\"100%\"\n|-\n! style=\"background:#EEDD82; width:50%\" | Live sporting event coverage\n! style=\"background:#EEDD82; width:50%\" | Sports analysis or commentary\n|-\n| valign=\"top\" |\n* '109th Grey Cup – Paul Graham, Jon Hynes\n* 2023 IIHF World U18 Championships – Paul Graham, Chris Edwards'\n*2023 IIHF Women's World Championship – Paul Graham, Sam Cicirello\n*2023 Stanley Cup Finals – Rob Corte, Ed Hall, Jeff Girodat, Brian Spear\n| valign=\"top\" |\n* 'Kevin Bieksa, Hockey Night in Canada'\n*Jennifer Botterill, Hockey Night in Canada\n*Craig Button, 2023 IIHF World U18 Championships\n*Byron MacDonald, CBC Sports\n*Cheryl Pounder, 2023 IIHF Women's World Championship\n|-\n! style=\"background:#EEDD82; width:50%\" | Sports host\n! style=\"background:#EEDD82; width:50%\" | Sports play-by-play\n|-\n| valign=\"top\" |\n* 'Kate Beirness, CFL Touchdown Atlantic'\n*James Duthie, TSN at the Masters\n*Ron MacLean, Hockey Night in Canada\n*Jay Onrait, SC with Jay Onrait\n| valign=\"top\" |\n* 'Rob Snoek, CBC Sports'\n*Signa Butler, CBC Sports\n*Chris Cuthbert, Hockey Night in Canada\n*Scott Russell, CBC Sports\n*Rod Smith, 109th Grey Cup\n|-\n! style=\"background:#EEDD82; width:50%\" | Sports feature segment\n! style=\"background:#EEDD82; width:50%\" | Sports opening\n|-\n| valign=\"top\" |\n* \"For All of Us\" — TSN – Rob Dunn, Jacob Frenkel, Vince Tremblay, Mike McKay, Cedrik Dessureault\n*\"How Ryan Francis is honouring his late grandmother\" — Sportsnet – Donnovan Bennett, David Zelikovitz, Sam Nasrawi\n*\"Knuckle Hop Arctic Winter Games\" — CBC Sports – Ryan Johnston, Monika Platek, Aaron Dutra, Camryn Kern, Devin Heroux\n*\"Staring Back\" — TSN – Matt Dorman, Dave Naylor, Darren Oliver, Steve Denheyer, Curry Leamen\n| valign=\"top\" |\n* '109th Grey Cup — TSN – Matt Dorman, Darren Oliver, Devon Burns, Steve Denheyer, Richard Liani'\n*2023 Calgary Stampede Open — Sportsnet – Cindy Giles, Michael Little\n*2023 Stanley Cup Eastern Conference Semifinals Game 1: \"Will Arnett Tease\" — Sportsnet – Sean Cleary, James Sharpe, Kevin Fallis, Carson Illidge, Will Arnett\n*\"You can say Hockey is for Everyone. Or you can join the fight to ensure that’s true\" — Sportsnet – Donnovan Bennett, Sam Nasrawi, Ed Hall, David Zelikovitz\n|-\n! style=\"background:#EEDD82; width:50%\" | Sports program or series\n|-\n| valign=\"top\" |\n* '''Serge Ibaka's How Hungry Are You?: \"Giannis Antetokounmpo\" – Serge Ibaka, Jordi Vila Sanchez, Paul Sidhu, Mark Wade, Michael Adach, Devon Burns'\n*Camp of Dreams – Karen Zylak, Mark Kristofic, Alex Browne\n*SC with Jay Onrait – Jay Onrait, Kyle Lawson, Thomas Csercsa, Greg Bonnetta, Eric O'Neill, Michael Harrison, Michael Skrzyniak, Francesco Pietropaolo\n*Scotiabank Hockey Day in Canada – Joel Darling, Rod McLachlan, John Whaley, Dan Fernandes, Deidre Hambly\n|}\nCraft awards\n{| class=wikitable width=\"100%\"\n|-\n! style=\"background:#EEDD82; width:50%\" | Editorial research\n! style=\"background:#EEDD82; width:50%\" | Visual research\n|-\n| valign=\"top\" |\n* 'Max Berger, Liz Hysen, Catherine Machado and Judy Ruzylo, Mr. Dressup: The Magic of Make-Believe'\n*Lina Cino, Aïcha Diop and Sunny Grewal, Black Life: Untold Stories: \"Revolution Remix\"\n*Jenny Cowley and Eric Szeto, Marketplace: \"Busting Miracle Cures\"\n*Robbie Hart and Gary J. Smith, ''Ice-Breaker: The '72 Summit Series\n*Victoria Lean, Brittany Wray, Simone Zucker and Ashley Renders, The Climate Baby Dilemma\n| valign=\"top\" |\n* 'Max Berger, Liz Hysen, Catherine Machado and Judy Ruzylo, Mr. Dressup: The Magic of Make-Believe'\n*Joanna S. Anaquod, Jennifer Podemski, Na’kuset, Raven Sinclair, Sharon Anaquod and Charity Gadica, Little Bird: \"Love Is All Around\"\n*João Vitor Corrêa, Jalana Lewis and Stefanie McCarrol, Black Life: Untold Stories: \"Revolution Remix\"\n*Robbie Hart, Ania Smolenskaia, Sean Stoyles, Anastasia Trofimova, Connie Littlefield and Mick Gzowski, Ice-Breaker: The '72 Summit Series\n*Kyle Parry, Thea Toole and Jon Boucher, Dark Side of the Ring: \"Abdullah the Butcher: Legacy of Blood\"\n|-\n! style=\"background:#EEDD82; width:50%\" | Make-Up\n! style=\"background:#EEDD82; width:50%\" | Costume Design\n|-\n| valign=\"top\" |\n* 'Nina McArthur, Megan Stark and Kelly Harmon, Little Bird: \"Bineshi Kwe\"'\n*Rachel Affolter, Workin' Moms'': \"It's All Gone\"\n*Julie Brisebois and Bruno Gatien, Transplant: \"Crete\"\n*Katie Minnis, Urban Legend: \"The White Dress\"\n*Kim Primeau, Sort Of: \"Sort Of Hospital Again\"\n| valign=\"top\" |\n* 'Charity Gadica, Little Bird: \"I Want My Mom\"'\n*Nicole Manek, Pretty Hard Cases: \"Always a Bridesmaid\"\n*Sarah Haydon Roy, Moonshine: \"How to Lose Friends and Shit-Can Your Reputation\"\n*Marissa Schwartz, Sort Of: \"Sort Of Married\"\n*Joanna Syrokomla, Murdoch Mysteries: \"Murder in F Major\"\n|-\n! style=\"background:#EEDD82; width:50%\" | Casting, Fiction\n! style=\"background:#EEDD82; width:50%\" | Casting, Non-Fiction\n|-\n| valign=\"top\" |\n* 'Lisa Parasyn and Carmen Kotyk, Little Bird'\n*Jenny Lewis and Sara Kay, Children Ruin Everything\n*Jenny Lewis and Sara Kay, Letterkenny\n*Jenny Lewis and Sara Kay, Son of a Critch\n*Larissa Mair and Colleen Rush, Shelved\n| valign=\"top\" |\n* 'Heather Muir, Canada's Drag Race: Canada vs. the World'\n*Julie J. Fitzsimmons and Jason Boyd, Black Life: Untold Stories\n*Lauren McCuaig, Tanner Sawatzky and Jesse Storey, The Amazing Race Canada\n*Jake Rehorst, Jesse Storey, Nancy Yeboah and Michael Yerxa, ''Canada's Ultimate Challenge\n*Meredith Veats, The Great Canadian Baking Show\n|-\n! style=\"background:#EEDD82; width:50%\" | Production design/art direction in a fiction program or series\n! style=\"background:#EEDD82; width:50%\" | Production design/art direction in a non-fiction program or series\n|-\n| valign=\"top\" |\n* 'David Brisbin, Jon Van Winkle, Robert K. Laurie and C. Summer Holmes, Little Bird: \"Burning Down the House\"'\n*Tim Bider, Pretty Hard Cases: \"Right Hand Red\"\n*Ben Gerlis, Bria Mack Gets a Life: \"Bria Mack Gets Laid\"\n*André Guimond, Transplant: \"Sinkhole\"\n*Ingrid Jurek, M-A Orenstein and Jenn Luckas, Sort Of: \"Sort Of the Worst Yoda\"\n| valign=\"top\" |\n* 'Rudin Causi and Javed Ali, Mr. Dressup: The Magic of Make-Believe'\n*Monika Geresz, Canada's Ultimate Challenge: \"Kelowna, BC\"\n*Tim Luke, Best in Miniature: \"The Finale\"\n*Callum Maclachlan and Mark Hockin, Blue Jays on Sportsnet\n*Michael “Spike” Parks and Mike Gelinas, The Great Canadian Baking Show: \"Holiday Special\"\n|-\n! style=\"background:#EEDD82; width:50%\" | Visual effects\n! style=\"background:#EEDD82; width:50%\" | Hair\n|-\n| valign=\"top\" |\n* 'Sébastien Chartier, Transplant: \"Crete\"'\n*Lawren Bancroft-Wilson, Liam Karp, Justin Reimer, Dmitry Vinnik, Terry Kalinich, Jeremy Stewart, Vardan Aleksanyan, Natalya MacKinnon, Alexandr Kurdyaev and Sebastian Weber, SkyMed: \"Return to Base\"\n*Marc Hall, Loïc Surprenant and Juan Manuel Pardo Salamanca, Plan B: \"Episode 6\"\n*Aaron Wright, Minas Kotsopoulos, Leila White, Michael Bitton, Joel Chambers, Iyi Tubi, Jeffrey King, Daniel Knight and Graham Tucker, Robyn Hood: \"Outlaws\"\n| valign=\"top\" |\n* 'Pina Robinson, Little Bird: \"So Put Together\"'\n*Leanne Morrison, Workin' Moms'': \"It's All Gone\"\n*Lydia Pensa, Sort Of: \"Sort Of Aftermath\"\n*Lydia Pensa and Arlette Pender, Pretty Hard Cases: \"Creatures of Habit\"\n*Norma Richard, Son of a Critch: \"Who Dares Dare Hudaro?\"\n|}\nPhotography\n{| class=wikitable width=\"100%\"\n|-\n! style=\"background:#EEDD82; width:50%\" | Photography in a comedy series\n! style=\"background:#EEDD82; width:50%\" | Photography in a documentary program or factual series\n|-\n| valign=\"top\" |\n* 'Ann Tipper, Sort Of: \"Sort Of the Worst Yoda\"'\n*Daniel Grant, Slip: \"The Wife\"\n*Ben Lichty, ''Workin' Moms: \"The End\"\n*Chet Tilokani, I Have Nothing: \"Package for the Bird\"\n*Ann Tipper, Run the Burbs: \"Phlashback\"\n| valign=\"top\" |\n* 'Ashley Iris Gill and Keenan Lynch, Black Community Mixtapes'\n*Mark Caswell, Sasha Appler and Alan Poon, Charlotte's Castle\n*Keenan Lynch and Daniel Tahmizian, Dark Side of the Ring\n*Jeff Morales, The Nature of Things: \"Rat City\"\n*Elad Winkler and Ken Woo, Billionaire Murders\n|-\n! style=\"background:#EEDD82; width:50%\" | Photography in a drama program or series\n! style=\"background:#EEDD82; width:50%\" | Photography in a lifestyle or reality program or series\n|-\n| valign=\"top\" |\n* 'Claudine Sauvé, Little Bird: \"I Want My Mom\"'\n*Guy Godfree, Little Bird: \"So Put Together\"\n*James Klopko, Essex County: \"Episode 101\"\n*Craig Wright, Ride: \"Legend of the Fall\"\n*Yuri Yakubiw, Murdoch Mysteries: \"Murder in F Major\"\n| valign=\"top\" |\n* 'Ryan Shaw, The Amazing Race Canada: \"Light the Candle\"'\n*Shane Geddes, Best in Miniature: \"First Impressions\"\n*Shane Geddes, Drink Masters: \"Botanical Bevvies\"\n*Adam Gladstone, The Great Canadian Baking Show: \"Biscuits and Bars Week\"\n*Kevin C. W. Wong, Mary Makes It Easy: \"Comfort Food\"\n|-\n! style=\"background:#EEDD82; width:50%\" | Photography in a news or information program, series or segment\n|-\n| valign=\"top\" |\n* 'Rob Smith, APTN Investigates: \"Reawakening the Mountains\"'\n*David de la Harpe, The New Reality: \"Missing Children\"\n*Adrian di Virgilio, CBC News: The National: \"Pakistanis struggle to survive with no flood relief in sight\"\n*Jared Thomas, CBC News: Adrienne Arsenault Reports: \"Inside Ukraine\"\n|}\nEditing\n{| class=wikitable width=\"100%\"\n|-\n! style=\"background:#EEDD82; width:50%\" | Editing in a comedy program or series\n! style=\"background:#EEDD82; width:50%\" | Editing in a dramatic program or series\n|-\n| valign=\"top\" |\n* 'Maureen Grant, Sort Of: \"Sort Of Hospital Again\"'\n*Lindsay Allikas, Workin' Moms: \"Funny Business\"\n*Kyle Martin, Children Ruin Everything: \"Money\"\n*Sam Thomson, Sort Of: \"Sort Of Gone Again\"\n*Gloria Tong, Bria Mack Gets a Life: \"Bria Mack Gets a Job\"\n| valign=\"top\" |\n* 'Maxime Lahaie-Denis, Little Bird: \"Burning Down the House\"'\n*Wesley Finucan, The Love Club: Tara\n*Justin Lachance, Little Bird: \"The Land That Takes You\"\n*Kimberlee McTaggart, Moonshine: \"High Season\"\n*Sandy Pereira, Dev Singh and Chris Mutton, Essex County'': \"Episode 103\"\n|-\n! style=\"background:#EEDD82; width:50%\" | Editing in a children's or youth program or series\n! style=\"background:#EEDD82; width:50%\" | Editing in a documentary program or series\n|-\n| valign=\"top\" |\n* 'Lindsay Ragone, All-Round Champion: \"Arcathlon\"'\n*Victor C. H. Fan and Rob Chandler, I Woke Up a Vampire: \"I Woke Up a Vampire\"\n*Thomas Lieu, The Hardy Boys: \"A Vanishing Act\"\n*Mike Reisacher, Popularity Papers: \"New School, New Start\"\n*Shelley Therrien, The Hardy Boys: \"At the Old House\"\n| valign=\"top\" |\n* 'Ashley Gilmour, Black Life: Untold Stories'\n*Steven Budd and AJ McLauchlin, Dark Side of Comedy\n*Nick Hector, ''The Man Who Stole Einstein's Brain\n*David New, Charlotte's Castle\n*Ken Yan, Offside: The Harold Ballard Story\n|-\n! style=\"background:#EEDD82; width:50%\" | Editing in a factual program or series\n! style=\"background:#EEDD82; width:50%\" | Editing in a reality or competition program or series\n|-\n| valign=\"top\" |\n* 'Christina To and Burak Ozgan, Billionaire Murders: \"Something Wicked This Way Comes\"'\n*Claire Elson, Mary Makes It Easy: \"Comfort Food\"\n*Jessica Graore, Mary Makes It Easy: \"Fake It Til You Bake It\"\n*Marc Ricciardelli and Curt Lobb, Dark Side of the Ring: \"Breaking the Cycle: The Graham Dynasty\"\n*Radek Zurawiecki and James Hebbard, Sarah's Mountain Escape: \"Shrink Wrap Reno\"\n| valign=\"top\" |\n* 'Jonathan Dowler, ''Canada's Drag Race: Canada vs. the World: \"Grand Finale\"'\n*Megan Day, Ellora Dela Fuente, Ryan Monteith, Ben O'Neil, Keith Ross, Jon Wong, Jordon Wood, Peter Antonakos, ichael Emberley, Pat Fairburn, Jessica Graore, Alexandra Mastronardi and Heather Skeoch, Big Brother Canada: \"Episode 1\"\n*Wesley Finucan and Baun Mah, The Big Bake: \"Creepy Carnival\"\n*Allan Hughes and Lara Mrkoci, The Great Canadian Baking Show: \"Finale\"\n*Kyle Power, ''Canada's Drag Race: Canada vs. the World: \"Comedy Queens\"\n|-\n! style=\"background:#EEDD82; width:50%\" | Editing in an animated program or series\n|-\n| valign=\"top\" |\n* 'Joshua Guitar, Pinecone & Pony: \"The Sturdy Stone\"'\n*Jamie Ebata and Kirk Hudson, Super Wish: \"The Ballooniverse Pageant / The Way Back Home\"\n*Paul Gitlin and Marc Brenzil, Daniel Spellbound: \"The Tickle Pit\"\n*Carolina Tran-Yong, Red Ketchup: \"Dope and the Red Rope\"\n|}\nSound\n{| class=wikitable width=\"100%\"\n|-\n! style=\"background:#EEDD82; width:50%\" | Sound in a fiction program or series\n! style=\"background:#EEDD82; width:50%\" | Sound in a documentary or factual program or series\n|-\n| valign=\"top\" |\n* 'Paul Lucien Col, Louis Gignac, Evelio Manfred Gay Salinas, Claire Pochon, Anton Fischlin, Simon Meilleur, Éric Med Lagacé and Delphine Measroch, Little Bird: \"Love Is All Around\"'\n*Rob Ainsley, Rachelle Audet, Paul Germann, Martin Gwynn Jones, Jesse Fellows, Davi Aquino, Kevin Schultz and Kevin Jung, Sort Of: \"Sort of Hospital Again\"\n*David Caporale, Krystin Hunter, John Dykstra, Adam Raley, David Yonson and Marilee Yorston, SurrealEstate: \"Trust the Process\"\n*Scott Donald, John Laranger, Jill Purdy, Faustine Pelipel, Dan Sexton, Daniel Pellerin, Chris Russell and Evelio Manfred Gay Salinas, The Spencer Sisters'': \"The Scholar's Snafu\"\n*Richard Spence-Thomas, Gary Vaughan, Gary Tompkins and Doug McClement, Richard III (CBC Presents the Stratford Festival)\n| valign=\"top\" |\n* 'Bridget Tang, Malcolm Wegg and Derek Brin, Black Community Mixtapes: \"Hip Hop\"'\n*Ewan Deane, The Nature of Things: \"Rat City\"\n*Matt Drake and Daniel Pellerin, Revival 69: The Concert That Rocked the World\n*David Draper, Rachael Zerafa, Michael Bonini and Brian Eimer, ''The Man Who Stole Einstein's Brain\n*Bret Killoran, Chris Russell, Joe Scandella, Scott Hitchon, Francois Maurice and Ryan MacNeill, Eternal Spring\n|-\n! style=\"background:#EEDD82; width:50%\" | Sound in a lifestyle, reality or entertainment program or series\n! style=\"background:#EEDD82; width:50%\" | Sound in an animated program or series\n|-\n| valign=\"top\" |\n* 'John Diemer, Scott Brachmayer, Rosie Eberhard, Levi Linton, Rob Taylor, Eric Leigh and Alastair Sims, ''Canada's Drag Race: Canada vs. the World: \"Bonjour Hi\"'\n*David Best, Daniel Hewett, Justin Ladd, Brian Mellersch, Malcom Owen Flood, Simon Paine, Mark Krupka, Sammy Yi, Chandra Bulucon and Lisa Meitin, ''Canada's Ultimate Challenge: \"Carcross, Yukon\"\n*John Diemer, Scott Brachmayer, Rosie Eberhard, Eric Leigh, Rob Taylor, Kara MacKinlay, Alastair Sims and Phil Nagy, Drink Masters: \"Botanical Bevvies\"\n*Mark Krupka, Luke McLean, Brian Gallant and Lisa Meitin, The Amazing Race Canada: \"This Is Going to Be a Spicy Leg\"\n*Mark Vreeken, Jeff Kozak, Charles-Émile Beaudin and Doug McClement, Juno Awards of 2023\n| valign=\"top\" |\n* 'Richard Spence-Thomas, Tim Muirhead, Luke Dante, Katie Pagacz, Kyle Peters, Ryan Ongaro, Patton Rodrigues and Mitch Conners, PAW Patrol: \"Aqua Pups Save a Floating Castle\"'\n*Ryan Araki, Evan Turner, Neil Parfitt, Andrew McDonnell and Richard Spence-Thomas, Super Wish: \"The Ballooniverse Pageant / The Way Back Home\"\n*Gregorio Gomez, Greg Stewart, Angelo Nicoloyannis, John Franco, Bonnie Lambie and Rick Senechal, Snoopy Presents: One-of-a-Kind Marcie\n*Mike Mancuso, Joe Tetreau, Evan Turner, Ryan Eligh, Patrick Mallan and Matt McKenzie, Pinecone & Pony: \"The Sturdy Stone\"\n*Ethan Myers, Julian Rudd, Art Mullin, Sebastian Biega, Chris Battaglia and Kevin Chamberlain, Unicorn Academy''\n|}\nDirecting\n{| class=wikitable width=\"100%\"\n|-\n! style=\"background:#EEDD82; width:50%\" | Children's or youth\n! style=\"background:#EEDD82; width:50%\" | Comedy\n|-\n| valign=\"top\" |\n* 'Felipe Rodriguez, The Hardy Boys: \"The Crash\"'\n*Kara Harun, ''Aunty B's House: \"Dumpling of My Heart\"\n*Rennata López, Dream It to Be It: \"I Dream of Soccer\"\n*Graeme Lynch, All-Round Champion: \"Adaptive Boxing\"\n*Stefan Scaini, Home Sweet Rome: \"Tanti Auguri A Lucy\"\n| valign=\"top\" |\n* 'Fabrizio Filippo, Sort Of: \"Sort Of Gone Again\"'\n*Kelly Fyffe-Marshall, Bria Mack Gets a Life: \"Bria Mack Gets Laid\"\n*Melanie Orr, Children Ruin Everything: \"Screen Time\"\n*Jacob Tierney, Letterkenny: \"Degens\"\n*Jacob Tierney, Shoresy: \"Players Only\"\n|-\n! style=\"background:#EEDD82; width:50%\" | Documentary or factual series\n! style=\"background:#EEDD82; width:50%\" | Documentary program\n|-\n| valign=\"top\" |\n* 'Marshall Jay Kaplan and John Seongho Choi, Dark Side of Comedy'\n*Alison Duke and Ngardy Conteh George, Black Community Mixtapes\n*Andrew Gregg, The Nature of Things'': \"Bug Sex: It's Complicated\"\n*Alicia K. Harris, Black Life: Untold Stories\n*Nadine Pequeneza, The Nature of Things: \"Last of the Right Whales\"\n| valign=\"top\" |\n* 'Robert McCallum, Mr. Dressup: The Magic of Make-Believe'\n*Jamie Kastner, ''Charlotte's Castle\n*Victoria Lean, The Climate Baby Dilemma\n*Jennifer Podemski and Jade Harper, 2023 Indspire Awards\n*Michelle Shephard, The Man Who Stole Einstein's Brain\n|-\n! style=\"background:#EEDD82; width:50%\" | TV Movie\n! style=\"background:#EEDD82; width:50%\" | Dramatic series\n|-\n| valign=\"top\" |\n* 'Simone Stock, The Girl Who Escaped: The Kara Robinson Story'\n*Heather Hawthorne Doyle, Make Me a Match\n*Heather Hawthorne Doyle, The More Love Grows\n*Samantha MacAdam, Fashionably in Love\n*Rama Rau, Bad Behind Bars: Jodi Arias\n| valign=\"top\" |\n* 'Elle-Máijá Tailfeathers, Little Bird: \"Love Is All Around\"'\n*Sheri Elwood, Moonshine: \"Get My Baby Back\"\n*Danishka Esterhazy, SurrealEstate: \"Trust the Process\"\n*Zoe Leigh Hopkins, Little Bird: \"Bineshi Kwe\"\n*Winnifred Jong, Pretty Hard Cases: \"Spin Me Round\"\n|-\n! style=\"background:#EEDD82; width:50%\" | Lifestyle or information program or mini–series\n! style=\"background:#EEDD82; width:50%\" | Live sporting event\n|-\n| valign=\"top\" |\n* 'John Keffer, The Marilyn Denis Show: \"The Final Farewell\"'\n*Frederick Kroetsch and Heather Hatch, Dr. Savannah: Wild Rose Vet: \"Nine Lives\"\n*Jan McCharles, Mary Makes It Easy: \"Fake It Til You Bake It\"\n*Erin Redden, Sarah's Mountain Escape: \"Shrink Wrap Reno\"\n*Cheryl Zalameda, Listing Large: \"Hurricane Brittany\"\n| valign=\"top\" |\n* 'Ron Forsythe, 2023 Stanley Cup Finals Game 5'\n*Andy Bouyoukos, 109th Grey Cup\n*Andy Bouyoukos, 2023 IIHF World Junior Gold Medal Game\n*Mike Mills, 2023 NHL Entry Draft\n|-\n! style=\"background:#EEDD82; width:50%\" | Reality or competition program or series\n! style=\"background:#EEDD82; width:50%\" | Variety or sketch comedy program or series\n|-\n| valign=\"top\" |\n* 'Shelagh O'Brien, ''Canada's Drag Race: Canada vs. the World: \"Bonjour Hi\"'\n*Rob Brunner, The Amazing Race Canada: \"Light the Candle\"\n*Dave Russell, Drink Masters: \"Enter the Bar\"\n*Harbinder Singh, Battle of the Generations: \"Episode 116\"\n*Harbinder Singh and Jan McCharles, Cross Country Cake Off: \"Western Holiday Play Offs\"\n| valign=\"top\" |\n* 'Jocelyn Corkum and Allison Johnston, This Hour Has 22 Minutes: \"Surviving Winter\"'\n*Sherali Najak and Tanisha Scott, 2023 Legacy Awards\n*Shelagh O'Brien, Hannah Gadsby: Dry\n*Shelagh O'Brien, Roast Battle Canada\n*Dave Russell, Juno Awards of 2023\n|-\n! style=\"background:#EEDD82; width:50%\" | Animated program or series\n! style=\"background:#EEDD82; width:50%\" | Factual\n|-\n| valign=\"top\" |\n* 'Tammy Langton, Daniel Tiger's Neighbourhood: \"The Neighbourhood Wedding\"'\n*Diana Basso and Joey So, Rubble & Crew: \"The Crew & Chase Are on the Case\"\n*Martin Kratt and Louis Champagne, Wild Kratts: \"Clever Raven\"\n*Wayne-Michael Lee, Pinecone & Pony: \"The Sturdy Stone\"\n*Heejung Yun and Paul Riley, ''Rosie's Rules'': \"Crystal's New Bunny\"\n| valign=\"top\" |\n* 'Eva Thomas, Still Standing: \"New Richmond, QC\"'\n*Sebastian Cluer, Bollywed: \"I Am Social Media\"\n*Ryan McMahon and Leslie Lucas, Thunder Bay: \"Whodunit\"\n*Daniel Oron, Deadly Science: \"Female Innovators\"\n*Bobbi Wilson, Lost Car Rescue: \"Slick Finds\"\n|}\nMusic\n{| class=wikitable width=\"100%\"\n|-\n! style=\"background:#EEDD82; width:50%\" | Best Original Music, Animation\n! style=\"background:#EEDD82; width:50%\" | Best Original Music, Comedy\n|-\n| valign=\"top\" |\n* 'Erica Procunier, Thomas & Friends: All Engines Go: \"The Mystery of Lookout Mountain\"'\n*Caleb Chan and Brian Chan, Pinecone & Pony: \"The Sturdy Stone\"\n*Jeremy Fisher and Matt Ouimet, Jeremy and Jazzy: \"You Can Be Anything\"\n*Ian LeFeuvre and Earl Tomo, Builder Brothers Dream Factory: \"Dancing Shoes\"\n*Neil Parfitt, Super Wish: \"The Ballooniverse Pageant / The Way Back Home\"\n| valign=\"top\" |\n* 'Peter Chapman and Maylee Todd, Workin' Moms: \"The End\"'\n*Alan Doyle and Keith Power, Son of a Critch: \"Halley's Comet\"\n*Todor Kobakov, Faith Heist: A Christmas Caper\n*Catalin Marin, Well Suited for Christmas\n*Carmen Yanuziello, Haviah Mighty, Kimberly Villagante and Terrell Morris, Sort Of: \"Sort Of Anything You Want\"\n|-\n! style=\"background:#EEDD82; width:50%\" | Best Original Music, Drama\n! style=\"background:#EEDD82; width:50%\" | Best Original Music, Documentary\n|-\n| valign=\"top\" |\n* 'Ari Posner and Amin Bhatia, Sullivan's Crossing'': \"Can't Help Falling\"'\n*Robert Carli, Murdoch Mysteries: \"D.O.A.\"\n*Gary Koftinoff and Phillip J. Bennett, Hudson & Rex: \"Northern Rexposure\"\n*Rob Melamed and Ryan McLarnon, The Spencer Sisters'': \"The Executive's Elegy\"\n*Ari Posner and Amin Bhatia, Ride: \"Speak Now or Forever Hold Your Peace\"\n| valign=\"top\" |\n* 'La-Nai Gabriel, Black Community Mixtapes'\n*Deanna H. Choi, The Nature of Things: \"Last of the Right Whales\"\n*Bruce Fowler and Neil Chapman, The Nature of Things: \"Bug Sex: It's Complicated\"\n*Ben Fox, The Climate Baby Dilemma\n*David Wall, ''The Man Who Stole Einstein's Brain\n|-\n! style=\"background:#EEDD82; width:50%\" | Best Original Music, Factual, Lifestyle, Reality or Entertainment\n! style=\"background:#EEDD82; width:50%\" | Best Original Song\n|-\n| valign=\"top\" |\n* 'Greg Johnston, Paranormal Revenge: \"Love you to Death: The Case of Lori Kinrade\" and \"Photo Negative: The Case of Clyde Morrison\"'\n*Adrian Ellis, Mapping Disaster: \"Danger Beyond the Horizon\"\n*Adrian Ellis, Mysteries of the Ancient Dead: \"Egypt, Rome, Nepal\"\n*Jorge Lopez, Ari Posner and Kris Kuzdak, Bestest Day Ever with My Best Friend'': \"Henry the Tortoise's Bestest Day Ever\"\n*Joseph Shabason, Searching with Chef Sang: \"The Farm\"\n| valign=\"top\" |\n* 'Kimberly Villagante, \"Made Up My Mind\" — Sort Of'\n*Caleb Chan and Brian Chan, \"Builder Brothers Dream Factory Theme\" — Builder Brothers Dream Factory\n*Steph Copeland, \"Love Is a Mystery\" — The Jane Mysteries: Inheritance Lost\n*Meiro Stamm and Antonio Naranjo, \"Mittens & Pants Theme\" — Mittens & Pants\n*Carmen Yanuziello, \"Don't Carry Things That Weigh You Down\" — Sort Of\n|}\nWriting\n{| class=wikitable width=\"100%\"\n|-\n! style=\"background:#EEDD82; width:50%\" | Comedy series\n! style=\"background:#EEDD82; width:50%\" | Drama series\n|-\n| valign=\"top\" |\n* 'Kurt Smeaton, Children Ruin Everything: \"Arguments\"'\n*Bilal Baig, Sort Of: \"Sort Of the Worst Yoda\"\n*Bilal Baig and Fabrizio Filippo, Sort Of: \"Sort Of Gone Again\"\n*Sasha Leigh Henry, Bria Mack Gets a Life: \"Bria Mack Gets a Job\"\n*Kathleen Phillips, Children Ruin Everything: \"Me Time\"\n| valign=\"top\" |\n* 'Joseph Kay and Rachel Langer, Transplant: \"Who Is Mags?\"'\n*Tassie Cameron and Sherry White, Pretty Hard Cases: \"Always a Bridesmaid\"\n*Jeff Lemire and Eilis Kirwan, Essex County: \"Episode 104\"\n*Jillian Locke and Carina Samuels, Pretty Hard Cases: \"Creatures of Habit\"\n*Evany Rosen, The Spencer Sisters: \"The Decorator's Debacle\"\n|-\n! style=\"background:#EEDD82; width:50%\" | Animated program or series\n! style=\"background:#EEDD82; width:50%\" | Children's or youth\n|-\n| valign=\"top\" |\n* 'Louise Moon, PAW Patrol: \"All Paws on Deck\"'\n*Jocelyn Geddie, Pinecone & Pony: \"Speak from the Art\"\n*Stephanie Kaliner, Pinecone & Pony: \"The Sturdy Stone\"\n*Martin Kratt, Wild Kratts: \"Clever Raven\"\n*Corey Liu, Pinecone & Pony: \"Pinecone and Horse\"\n| valign=\"top\" |\n* 'Chris Pozzebon, The Hardy Boys: \"At the Old House\"'\n*Cole Bastedo, Home Sweet Rome: \"Coconut Dog Day\"\n*Vivian Lin and Maryan Haye, Popularity Papers: \"Teamwork Makes the Scene Work\"\n*Vivian Lin and Amanda Brooke Perrin, Popularity Papers: \"New School, New Start\"\n*Courtney Jane Walker and Matt Huether, Home Sweet Rome: \"Tanti Auguri A Lucy\"\n|-\n! style=\"background:#EEDD82; width:50%\" | Documentary\n! style=\"background:#EEDD82; width:50%\" | Factual program or series\n|-\n| valign=\"top\" |\n* 'Robert McCallum and Jordan Christopher Morris, Mr. Dressup: The Magic of Make-Believe'\n*Alison Duke, Black Community Mixtapes\n*Victoria Lean, The Climate Baby Dilemma\n*Nadine Pequeneza, The Nature of Things: \"Last of the Right Whales\"\n*Michelle Shephard and Carolyn Abraham, ''The Man Who Stole Einstein's Brain\n| valign=\"top\" |\n* 'Ryan McMahon and Michael Alcock, Thunder Bay: \"Whodunit\"'\n*Michael Alcock and Peter Horton, Paranormal Revenge: \"Dark Pond: The Case of Todd Narron\" and \"The Smile: The Case of Stephanie Bingham\"\n*Jonny Harris, Fraser Young, Steve Dylan, Graham Chittenden and Aisha Brown, Still Standing: \"Oneida of the Thames, ON\"\n*Sarah Hewitt, Deadly Science: \"Female Innovators\"\n*Todd Serotiuk, Edi Osghian and Amanda Worrall, Heavy Rescue: 401: \"Deep, Steep and Stuck\"\n|-\n! style=\"background:#EEDD82; width:50%\" | Lifestyle or reality/competition program or series\n! style=\"background:#EEDD82; width:50%\" | Pre-school program or series\n|-\n| valign=\"top\" |\n* 'Brandon Ash-Mohammed, Trevor Boris, Spencer Fritz and Kevin Hazlehurst, ''Canada's Drag Race: Canada vs. the World: \"Spy Queens\"'\n*Rob Brunner, Mark Lysakowski, Paulina Robak and Michael Tersigni, The Amazing Race Canada: \"Light the Candle\"\n*Nadine Djoury, The Great Canadian Baking Show: \"Holiday Special\"\n*Elvira Kurt and Nadine Djoury, Drink Masters: \"At the Speakeasy\"\n*Simu Liu, Luciano Casimiri, Jemeni G, Julie Kim, Kristeen Von Hagen, Kim Wheeler and Andrea Jin, Juno Awards of 2023\n| valign=\"top\" |\n* 'Richard Young, Dino Ranch: \"The Odd Partners\"'\n*Ken Cuperus, ''Aunty B's House: \"A Trip to Paris\"\n*Katherine Sandford, Mittens & Pants: \"Bunny Family Wedding\"\n*Ashley Spires, Agent Binky: Pets of the Universe: \"A Guide To Being the WURST\"\n*Tyra Sweet and Rennata López, Bestest Day Ever with My Best Friend'': \"Henry the Tortoise's Bestest Day Ever\"\n|-\n! style=\"background:#EEDD82; width:50%\" | TV Movie\n! style=\"background:#EEDD82; width:50%\" | Variety or sketch comedy program or series\n|-\n| valign=\"top\" |\n* 'Dennis Heaton, The Amityville Curse'\n*Gadi Harel, Owen Maxwell and Jimmy Ruggiero, Faith Heist: A Christmas Caper\n*Michael J. Murray, Designing Christmas\n*Kate Pragnell, Take Me Back for Christmas\n*Carley Smale and Katelyn James, A Gingerbread Christmas\n| valign=\"top\" |\n* 'Jordan Foisy, Mark Critch, Jeremy Woodcock, Nigel Grinstead, Aisha Brown, Aba Amuquandoh, Chris Wilson, Travis Lindsay, Stacey McGunnigle, Ashley Botting, Sarah Blackmore, Dan Dillabough, Ajahnis Charley, Allana Reoch, Salma Hindy and Trent McClellan, This Hour Has 22 Minutes: \"Surviving Winter\"'\n*Leonard Chan, 2022 Scotiabank Giller Prize\n*Jemeni G, Makayla Campbell and Milca Kuflu, 2023 Legacy Awards\n*Leah Gauthier and Jennica Harper, Jann: Alone for the Holidays\n*George Reinblatt, Aisha Brown, Jeff Rothpan and Rob Michaels, Roast Battle Canada\n|}\nAll-platform awards\nOne major category is currently presented without regard to the distinction between film, television or web media content.\n{| class=wikitable width=\"100%\"\n|-\n! style=\"background:#EEDD82; width:50%\" | Stunt Coordination\n|-\n| valign=\"top\" |\n* 'Sean Skene, Dan Skene and Cam Fergus, Shoresy: \"Set the Tone\"'\n*Angelica Lisk-Hann, Kirpa Budwal, Victoria Goodman, Howard Green, Dillon Jagersky, Daniel Lavigne, Greg Leach and Yvette McKoy, Robyn Hood: \"Outlaws\"\n*Stéphane Lefebvre, Marry F*** Kill\n*Dan Skene, Letterkenny: \"Degens\"\n*John Stead, Pretty Hard Cases: \"Always a Bridesmaid\"\n|}\nAudience awards\n{| class=wikitable width=\"100%\"\n|-\n! style=\"background:#EEDD82; width:50%\" | Cogeco Fund Audience Choice\n! style=\"background:#EEDD82; width:50%\" | Shaw Rocket Fund Kids' Choice\n|-\n| valign=\"top\" |\n* Son of a Critch\n*Acting Good\n*''Canada's Drag Race: Canada vs. the World\n*Canada's Got Talent\n*Our Big Punjabi Family\n*Robyn Hood\n*Shoresy\n*SkyMed\n*Sort Of\n*Sullivan's Crossing\n| valign=\"top\" |\n* '''Aunty B's House'\n*Agent Binky: Pets of the Universe\n*Dream It to Be It\n*Green Squad\n*Silly Paws\n|}\nDigital media\n{| class=wikitable width=\"100%\"\n|-\n! style=\"background:#EEDD82; width:50%\" | Original Program or Series, Fiction\n! style=\"background:#EEDD82; width:50%\" | Original Program or Series, Non-Fiction\n|-\n| valign=\"top\" |\n* 'How to Fail as a Popstar — Elise Cousineau, Caroline Habib, Laura Perlmutter, Bruno Dubé, Jennifer Kawaja, Vanessa Matsui, Vivek Shraya'\n*The Drop — Elizabeth Yake, Liz Whitmere, Dani Pagliarello, Aisha Evelyna\n*Gay Mean Girls — Maddy Falle, Heyishi Zhang, Hayley Wong\n*I Hate People, People Hate Me — Lauren Corber, Evan Dell'Aquila, Lisa Filipelli, Palmer Baranek, Bobbi Summers\n*Less Than Kosher — Michael Goldlist, Shaina Silver-Baird, Laura Nordin, Emily Andrews\n| valign=\"top\" |\n* 'Here & Queer — Peter Knegt, Lucius Dechausay, Mercedes Grundy, Chelle Turingan'\n*2022 Reel Asian Awards — Christine Vu, Deanna Wong\n*Being Black in Canada: Friends and Allies — Tamika Forrester, Nazima Walji, Nathaniel Smith, Alicia Lee\n*Farm Crime — Geoff Morrison, Lucy Cameron\n*Indigenous Futures: How These Teens Are Reclaiming Their Joy — Lisa Fender, Lenard Monkman, Angelica Cooper, Jaime McMahon, Sabrina Fabian, Nina Corfu, Sophia Smoke, Janna McGinn, Philip Street, Kevin Nepitabo, Jaison Empson, Bryan Harder, Mia Rodak, Marie McCann, Sally Catto\n|-\n! style=\"background:#EEDD82; width:50%\" | Lead Performance in a Web Program or Series\n! style=\"background:#EEDD82; width:50%\" | Supporting Performance in a Web Program or Series\n|-\n| valign=\"top\" |\n* 'Aisha Evelyna, The Drop'\n*Elley-Ray Hennessy, Pink Is In\n*Liam Ma, Streams Flow from a River\n*Patrick McKenna, Pink Is In\n*Dani Pagliarello, The Drop\n*Adrian Pavone, How to Fail as a Popstar\n*Bobbi Summers, I Hate People, People Hate Me\n*Mary Walsh, The Missus Downstairs\n| valign=\"top\" |\n* 'Aurora Browne, The Drop'\n*Nadine Bhabha, How to Fail as a Popstar\n*Jayne Eastwood, Pink Is In\n*Tina Jung, ''You're My Hero\n*Patrick McKenna, 1 Man's Treasure\n*Bif Naked, I Hate People, People Hate Me\n*Dana Puddicombe, What Odds\n*Tara Spencer-Nairn, You're My Hero\n|-\n! style=\"background:#EEDD82; width:50%\" | Direction in a Web Program or Series\n! style=\"background:#EEDD82; width:50%\" | Host in a Web Program or Series\n|-\n| valign=\"top\" |\n* 'Christopher Yip, Streams Flow from a River'\n*Aisha Evelyna, The Drop\n*Maya Annik Bedward, Farm Crime\n*Jonathan Torrens, 1 Man's Treasure\n*Heyishi Zhang, Gay Mean Girls\n| valign=\"top\" |\n* 'Jen Pogue, County Blooms'\n*Andrew Chang, About That with Andrew Chang\n*Gabriella de la Torre, ACTRA Toronto at TIFF\n*Sophia Smoke, Indigenous Futures: How These Teens Are Reclaiming Their Joy\n*Mark Kenneth Woods, Saba Akhtar, Kimberly Ho, Christian Yves Jones and Michael Venus, Pride: The LGBTQ+ History Series\n|-\n! style=\"background:#EEDD82; width:50%\" | Picture Editing in a Web Program or Series\n! style=\"background:#EEDD82; width:50%\" | Writing in a Web Program or Series\n|-\n| valign=\"top\" |\n* 'Maureen Grant, I Hate People, People Hate Me'\n*Ben Lee Allan, Less Than Kosher\n*Tiffany Beaudin and Pauline Decroix, How to Fail as a Popstar\n*Cameron Hucker and Jordan Krug, Northern Tracks: A Canadian Mixtape\n*David Schmidt, Kyle Cucco and Ashley Brook, Canadiana\n| valign=\"top\" |\n* 'Vivek Shraya, How to Fail as a Popstar: \"The Producer\"'\n*Leonard Chan, Streams Flow from a River: \"Benny and the Jets\"\n*Mark Little, Gary and His Demons: \"Forest of Despair\"\n*Christopher Yip, Streams Flow from a River: \"Frank Liquor & Laundromat\"\n*Heyishi Zhang, Gay Mean Girls: \"The Business of Justice\"\n|-\n! style=\"background:#EEDD82; width:50%\" | Immersive Experience, Fiction\n! style=\"background:#EEDD82; width:50%\" | Immersive Experience, Non-Fiction\n|-\n| valign=\"top\" |\n* Survivorman VR\n*Broken Spectre\n*Journey to Foundation\n| valign=\"top\" |\n* This Is Not a Ceremony\n*Eternal Spring VR\n*In Your Shoes VR\n|-\n! style=\"background:#EEDD82; width:50%\" | Video game\n! style=\"background:#EEDD82; width:50%\" | Live Production for Social Media\n|-\n| valign=\"top\" |\n* Venba\n*Little Learning Machines\n*Return to Grace\n| valign=\"top\" |\n*ET Canada Live\n*Intimate and Interactive\n*Soccer North Live: Men's and Women's World Cup\n|-\n! style=\"background:#EEDD82; width:50%\" | Interactive production\n|-\n| valign=\"top\" |\n* Dino Dana World\n*CardiacCrash: Chantal\n*Fossil Hunt at Home\n*Illuminated Text\n|}\nReception\nReviewing the television broadcast, Barry Hertz of The Globe and Mail'' wrote that while it still had significant problems, it had succeeded in being better than the previous year's \"utter disaster\". He noted a technical snafu which left viewers who were watching the broadcast on the CBC Gem streaming platform unable to hear the sound for the first few minutes, and the fact that the condensed one-hour format had left too many memorable moments from the presentations on the cutting-room floor, but praised Martin as a solid host who \"anchored the show with an energetic, sharp mix of self-deprecation and confidence\", and noted that the highlights of the broadcast were the heartfelt special award acceptance speeches of Tonya Williams and Denis Villeneuve. While granting that the 2024 awards' scheduling in May was attributable to the last-minute venue change, he also felt that even the typical April scheduling no longer makes sense, and opined that the awards should shift to being presented in February to capitalize on award-season energy, or September to capitalize on the industry activity around the Toronto International Film Festival.\nReferences"
    }
  ]
}