{
  "content": [
    {
      "type": "text",
      "text": "# 131st Infantry Brigade (United Kingdom)\n\nThe 131st Infantry Brigade, originally the Surrey Brigade was an infantry formation of Britain's Territorial Army that saw service during both the First and the Second World Wars. In the First World War the brigade was in British India for most of the war and did not see service as a complete unit but many of its battalions would see service in the Middle East.\nThe brigade, assigned to the 44th (Home Counties) Division, saw extensive service in the Second World War, in France and was later evacuated at Dunkirk in May 1940. It later saw service in the North African Campaign in late 1942 at El Alamein and Tunisia, Salerno in Italy, both in late 1943, and the invasion of Normandy and throughout North-west Europe from June 1944 until May 1945. From late 1942, when 44th Division was broken up, the brigade served with the 7th Armoured Division. Some sources call the brigade the 131st (Queen's) Brigade, due it being composed solely composed of battalions from the Queen's Royal Regiment (West Surrey).\nOrigin\nThe Volunteer Force of part-time soldiers was created following an invasion scare in 1859, and its constituent units were progressively aligned with the Regular British Army during the later 19th Century. The Stanhope Memorandum of December 1888 introduced a Mobilisation Scheme for Volunteer units, which would assemble in their own brigades at key points in case of war. In peacetime these brigades provided a structure for collective training.\nThe Surrey Brigade was one of the formations organised at this time. Brigade Headquarters was at 71 New Street in Kennington Park (later at 97 Barkston Gardens) and the commander was Colonel Alexander Hamilton (later 10th Lord Belhaven and Stenton), a retired officer in the Royal Engineers. The assembly point for the brigade was at Caterham Barracks, the Brigade of Guards' depot conveniently situated for the London Defence Positions along the North Downs. The brigade's original composition was:\nSurrey Brigade\n* 1st Volunteer Battalion, The Queen's (Royal West Surrey Regiment)\n* 2nd Volunteer Battalion, The Queen's\n* 3rd Volunteer Battalion, The Queen's\n* 4th Volunteer Battalion, The Queen's\n* 1st Surrey Rifles\t (formally the 1st Volunteer Battalion, East Surrey Regiment)\n* 2nd Volunteer Battalion, East Surrey Regiment\n* 3rd Volunteer Battalion, East Surrey Regiment\n* 4th Volunteer Battalion, East Surrey Regiment\n* Supply Detachment, Army Service Corps\n* Bearer Company, Medical Staff Corps\nIn the reorganisation after the end of the 2nd Boer War in 1902, separate East and West Surrey Brigades were formed, under command of the respective regimental districts.\nTerritorial Force\nWhen the Volunteers were subsumed into the Territorial Force (TF) under the Haldane Reforms in 1908, the battalions in North Surrey, whose recruiting areas had fallen in the County of London since its formation 1889, became part of the all-Territorial London Regiment. These became the 21st to 24th Battalions and constituted the 6th London Brigade in the 2nd London Division. The four remaining battalions became battalions of their parent regiments and formed a single Surrey Brigade once more, as part of the Home Counties Division.\nFirst World War\nOrder of Battle\nOn the outbreak of war the Surrey Brigade was composed as follows:\nCommander: Brigadier-General J. Marriott (remained in the United Kingdom)\n* 4th Battalion, Queen's (Royal West Surrey Regiment) (from Croydon)\n* 5th Battalion, Queen's (Royal West Surrey Regiment) (from Guildford)\n* 5th Battalion, East Surrey Regiment (from Wimbledon)\n* 6th Battalion, East Surrey Regiment (from Kingston upon Thames)\nMoblisation\nOn the outbreak of the First World War, most of the men of the division accepted liability for overseas service to go to British India to relieve Regular Army troops for the fighting fronts. However, the brigade staffs and Regular adjutants of the battalions remained behind. The division embarked at Southampton and sailed on 30 October 1914, disembarking at Bombay on 1–3 December.\nService in India\nOn arrival, the division's units were distributed to various peacetime stations across India, Aden and Burma to continue their training for war. For a time the two East Surrey battalions were attached to the Allahabad Brigade in 8th (Lucknow) Division, where they were joined by the 4th Queens. In May 1915, the division was numbered 44th (Home Counties) Division and the brigade formally became 131st (1/1st Surrey) Brigade (though without a commander or staff). The TF battalions had all taken the prefix '1' (1/4th Queen's etc) to distinguish them from their 2nd Line battalions forming in the United Kingdom.\nDuring 1915 there was a regular drain on the battalions as they lost their best Non-Commissioned Officers for officer training, sent detachments to various places in India, and provided drafts to replace casualties among units fighting in Mesopotamia. 1/5th Queens was transferred to Mesopotamia at the end of the year, landing at Basra on 10 December and transferring to 15th Indian Division.\nBy early 1916 it had become obvious that the Territorial Divisions in India (there were two others in addition to the 44th, the 43rd (Wessex) Division and 45th (2nd Wessex) Division were never going to be able to reform and return to Europe to reinforce the Western Front as had been originally intended. They continued training in India for the rest of the war, providing drafts and detachments as required. 1/6th East Surreys served in garrison at Aden from February 1917 to January 1918, and 1/5th East Surreys was transferred to Mesopotamia at the end of 1917, landing at Basra on 27 December and joining 55th Indian Brigade, 18th Indian Division.\nThe only battalion of the 131st Brigade that had not deployed outside India at any time during the war, 1/4th Queen's, finally saw active service in 1919 during the Third Anglo-Afghan War.\nBetween the wars\nDuring 1919 the remaining units were gradually reduced and was finally disbanded, along with the rest of the Territorial Force, which was reformed as the Territorial Army in 1920. The division was also reconstituted as the 44th (Home Counties) Division. The brigade re-formed as the 131st (Surrey) Infantry Brigade with the same composition it had before the First World War, with two battalions of the Queen's and two of the East Surreys.\nHowever, in the late 1930s there was an increasing need to strengthen the anti-aircraft defences of the United Kingdom, particularly in London and Southern England. As a result, in 1938, the 4th Battalion, Queen's was converted into the 63rd (Queen's) Searchlight Regiment. In the same year, all infantry brigades in the British Army were reduced from four to three battalions and so the 5th East Surreys was transferred to the Royal Artillery, converted into the 57th (East Surrey) Anti-Tank Regiment, Royal Artillery, becoming the anti-tank regiment for the division. The 6th East Surreys were at the same time transferred to 132nd (Middlesex and Kent) Infantry Brigade. They were replaced in the brigade by the 6th (Bermondsey) and 7th (Southwark) battalions of the Queen's Royal Regiment, previously the 22nd and 24th battalions of the London Regiment, both from the now disbanded 142nd (6th London) Infantry Brigade of 47th (2nd London) Infantry Division (converted into 1st AA Division). In 1939 the brigade was redesignated the 131st Infantry Brigade.\nSecond World War\nThe brigade was mobilised in late August 1939, as was most of the rest of the Territorial Army, due to the worsening situation in Europe. The German Army invaded Poland on 1 September 1939 and the Second World War began two days later, on 3 September 1939.\nUpon mobilisation in September 1939, 131st Brigade HQ became HQ Eastern Sub-Area in the United Kingdom and the units of the brigade were temporarily under the command of other formations until the brigade reassembled in 44th (Home Counties) Infantry Division on 7 October 1939. Initially, it comprised the three 1st Line Territorial Army battalions of the Queen's Royal Regiment (West Surrey).\nOrder of Battle\n131st Brigade was constituted as follows:\n* 1/5th Battalion, Queen's Royal Regiment (West Surrey)\n* 1/6th Battalion, Queen's Royal Regiment (West Surrey) (left 3 December 1944)\n* 1/7th Battalion, Queen's Royal Regiment (West Surrey) (left 4 May 1940, rejoined 2 July 1941; left 3 December 1944)\n* 131st Infantry Brigade Anti-Tank Company (formed 1 December 1939, disbanded 1 January 1941)\n* 2nd Battalion, Buffs (Royal East Kent Regiment) (from 4 May 1940 until 2 July 1941 then transferred to 132nd Infantry Brigade)\n* C Company, 1st Battalion, Cheshire Regiment (Machine Gun Company) (from 1 August 1943 until 6 January 1944)\n* 2nd Battalion, Devonshire Regiment (from 1 December 1944)\n* 9th Battalion, Durham Light Infantry (from 2 December 1944)\nCommanders\nThe following officers commanded 131st Brigade during the war:\n* Brigadier J.S. Hughes (until 9 November 1939)\n* Lieutenant-Colonel I.T.P. Hughes (Acting, from 9 to 17 November 1939)\n* Brigadier J.E. Utterson-Kelso (from 17 November 1939 until 31 March 1941, again from 8 to 15 April 1941)\n* Lieutenant-Colonel G.V. Palmer (Acting, from 31 March until 8 April 1941, again from 15 April to 5 May 1941)\n* Brigadier I.T.P. Hughes (from 5 May 1941 until 20 March 1942)\n* Lieutenant-Colonel R.M. Burton (Acting, from 20 to 23 March 1942)\n* Brigadier E.H.C. Frith (from 23 March until 8 October 1942)\n* Brigadier W.D. Stamer (from 8 October until 17 November 1942)\n* Lieutenant-Colonel L.C. East (Acting, from 17 to 29 November 1942)\n* Brigadier L.G. Whistler (from 29 November 1942 until 14 July 1943, again from 26 July 1943 until 28 January 1944)\n* Lieutenant-Colonel R.N. Thicknesse (Acting, from 14 to 26 July 1943)\n* Brigadier M.S. Ekins (from 28 January until 2 July 1944)\n* Brigadier E.C. Pepper (from 2 July until 2 October 1944)\n* Lieutenant-Colonel J. Freeland (Acting, from 2 to 8 October 1944, again from 27 January to 6 February 1945 and 16 May to 7 June 1945)\n* Brigadier W.R. Cox (from 8 October until 2 December 1944)\n* Brigadier J.M.K. Spurling (from 2 December 1944 until 26 January 1945, again from 6 February until 16 May 1945, and from 7 June 1945)\n* Lieutenant-Colonel P. Brind (Acting, from 26 to 27 January 1945)\nService\nThe 131st Infantry Brigade, commanded at the time by Brigadier John Utterson-Kelso, landed in France with the rest of 44th Division on 3 April 1940 to join the British Expeditionary Force (BEF) in France. The division came under command of III Corps, serving alongside the 5th and 42nd (East Lancashire) Infantry Divisions. Both the 42nd and 44th Divisions had been kept back from strengthening the BEF sooner for potential operations in Northern Europe which, as it turned out, did not come to anything. In early May the brigade was bolstered by the 2nd Battalion, Buffs (Royal East Kent Regiment), a Regular Army unit, replacing the 1/7th Queen's which transferred to 25th Infantry Brigade, under 5th Division at the time. This was one of the BEF's official policies and was intended to strengthen the inexperienced Territorial divisions, giving them much-needed experience.\nAfter fighting in the Battle of France in May 1940, the brigade retreated to Dunkirk and was evacuated on 31 May 1940, after the German Army threatened to cut off the BEF from the French Army. During the fighting the brigade, together with the rest of 44th Division, had sustained heavy losses, with 1/6th Queen's losing 9 officers and 400 other ranks, 3 of the officers and 130 men taken as prisoners of war (POWs) and 1/5th 125 casualties. Back in England, the brigade was reformed in numbers and re-equipped and positioned in Southeast England to defend what the divisional commander, Major-General Brian Horrocks, regarded as 'the No 1 German invasion area, stretching from the Isle of Thanet to Dover and on to Folkestone'.\nThe brigade (now with 1/7th Queen's reunited), along with the rest of the 44th Division, now under Major-General Ivor Hughes (who had commanded the 1/6th Queen's at Dunkirk), was sent to North Africa in May 1942 where, shortly after arrival in August, they became part of the British Eighth Army, under Lieutenant-General Bernard Montgomery, and fought at the Battle of Alam el Halfa in late August. In late September the brigade fought in Operation Braganza with fairly light casualties, except the 1/5th Queen's which suffered heavy casualties of 12 officers and 260 other ranks killed, wounded or missing. The brigade later played a large part in the Second Battle of El Alamein and, again, suffered heavy casualties: 1/5th Queen's had 118 casualties, 1/6th had 197 and the 1/7th had had similar losses.\nWhen the 44th Division was broken up to provide infantry for other units (and Headquarters disbanded on 31 January 1943) 131st Brigade was redesignated as, on 1 November 1942, 131st Lorried Infantry Brigade and transferred to the 7th Armoured Division, nicknamed \"The Desert Rats\", and would remain with them for the rest of the war. The 7th Armoured was under command of XXX Corps, under Lieutenant-General Oliver Leese. The brigade, now under command of Brigadier Lashmer Whistler (nicknamed \"Private Bolo\" by men of the brigade), fought throughout the rest of the Tunisian Campaign until it ended in mid-May 1943, when the Germans and Italians fighting in North Africa finally surrendered, with the Allies capturing over 230,000 POWs.\nAfter the victory in Tunisia, the brigade did not take part in the Allied invasion of Sicily but instead the whole division rested at Homs and trained in amphibious warfare for the invasion of Italy. The brigade landed in Italy on 16 September 1943 during the early stages of fighting in the Italian theatre with British X Corps, commanded by Lieutenant-General Richard McCreery, temporarily under command of U.S. Fifth Army during the Battle for the Salerno beachhead where the brigade relieved its duplicate 169th (London) Infantry Brigade (consisting of the three 2nd Line duplicate battalions: 2/5th, 2/6th, and 2/7th, formed when the TA was doubled in size in 1939), part of the 56th (London) Infantry Division. The assembly of six battalions of a single regiment in two brigades is believed to be a unique event in the history of the British Army and is now a special Regimental Day, called Salerno Day, in the Princess of Wales's Royal Regiment (the successor regiment to the Queen's).\nThe brigade later helped breach the Volturno Line and saw little major action thereafter and, with the rest of the 7th Armoured Division, returned to the United Kingdom in early January 1944 and Brigadier Whistler was soon transferred to take command of the inexperienced 160th Infantry Brigade, part of the 53rd (Welsh) Infantry Division, and was replaced by Brigadier Maurice Ekins. With the rest of the 7th Armoured Division, the brigade was brought back up to strength again and began training for operations to open the Second Front. On 4 March 1944 the brigade was redesignated again as 131st Infantry Brigade.\ns drive past German POWs in Echt, 18 January 1945.]]\nThe brigade fought in North West Europe with the rest of 7th Armoured Division from 7 June, the day after the D-Day landings, until Victory in Europe Day, fighting in particular throughout the Battle of Normandy in the Battle for Caen in Operation Perch, Villers-Bocage, Operation Goodwood and Operation Bluecoat. In December 1944, due to recent heavy losses suffered by the brigade, the 1/6th and 1/7th Queen's were exchanged for the 2nd Battalion, Devonshire Regiment (from 231st (Malta) Brigade) and 9th Battalion, Durham Light Infantry (from 151st (Durham) Brigade), which were both formerly part of the 50th (Northumbrian) Infantry Division that was being sent back to the United Kingdom to serve as a training division. Both the 1/6th and 1/7th Queen's were reduced to a small cadre, each of 100 officers and men, and the remainder of the men were transferred to fill gaps in the 1/5th Queen's, now commanded by Lieutenant-Colonel Ian Freeland, or transferred to the 4th King's Shropshire Light Infantry or 1st Herefordshire Light Infantry of 159th Infantry Brigade, 11th Armoured Division. The reorganised 131st Brigade then fought through the battles after Operation Blackcock and the Rhine crossing in March 1945. The brigade took part in the Berlin Victory Parade of 1945.\nBattles\n131st Brigade participated in the following actions during the Second World War:\n* Battle of France\n**St Omer-La Bassée\n*Western Desert Campaign\n**Alam el Halfa\n**Second Battle of El Alamein\n*Tunisia Campaign\n**Medenine\n**Mareth\n**Enfidaville\n**Capture of Tunis\n*Italian Campaign\n**Salerno landings\n**Capture of Naples\n**Volturno Crossing\n*Battle of Normandy\n**Operation Overlord\n**Battle of Villers-Bocage\n**Operation Goodwood\n*Operation Blackcock\n*Operation Plunder\nPost-war\nThe brigade was disbanded after the war in 1946 and reformed in 1947, as the 131st (Surrey) Infantry Brigade, in the post-war reorganisation of the Territorial Army, consisting of the 5th, 6th (Bermondsey) and 7th (Southwark) battalions of the Queen's Royal Regiment (West Surrey), after amalgamating with the 2nd Line units. However, the 7th Queen's, after absorbing the duplicate 2/7th Battalion, was converted into 622nd Heavy Anti-Aircraft Regiment, Royal Artillery (7th Battalion, The Queen's Royal Regiment). The 6th Battalion, East Surrey Regiment replaced it but was disbanded in 1961 when the divisions amalgamated with the districts, and the 44th Division became 44th (Home Counties) Division/District.\nNotes\nReferences\nBibliography\n* Maj A.F. Becke,History of the Great War: Order of Battle of Divisions, Part 2a: The Territorial Force Mounted Divisions and the 1st-Line Territorial Force Divisions (42–56), London: HM Stationery Office, 1935/Uckfield: Naval & Military Press, 2007, ISBN 1-84734-739-8.\n* Maj A.F. Becke,History of the Great War: Order of Battle of Divisions, Part 3b: New Army Divisions (30–41) and 63rd (R.N.) Division, London: HM Stationery Office, 1939/Uckfield: Naval & Military Press, 2007, ISBN 1-84734-741-X.\n* Ian F.W. Beckett, Riflemen Form: A Study of the Rifle Volunteer Movement 1859–1908, Aldershot: Ogilby Trusts, 1982, .\n* John K. Dunlop, The Development of the British Army 1899–1914, London: Methuen, 1938.\n* Fraser, David (1999) [1983]. And We Shall Shock Them: The British Army in the Second World War. Cassell military. .\n* Lt-Gen Sir Brian Horrocks, A Full Life, London: Collins, 1960.\n* Lt-Col H.F. Joslen, Orders of Battle, United Kingdom and Colonial Formations and Units in the Second World War, 1939–1945, London: HM Stationery Office, 1960/London: London Stamp Exchange, 1990, ISBN 0-948130-03-2/Uckfield: Naval & Military Press, * H.R. Martin, Historical Record of the London Regiment, 2nd Edn (nd)\n* R. Money Barnes, The Soldiers of London, London: Seeley Service, 1963.\n* Brian Robson, Crisis on the Frontier: The Third Afghan War and the Campaign in Waziristan 1919–20, Staplehurst: Spellmount, 2004, .\n* Ray Westlake, Tracing the Rifle Volunteers, Barnsley: Pen and Sword, 2010, .\nExternal links\n* [https://web.archive.org/web/20130528220855/http://warpath.orbat.com/ The Regimental Warpath 1914–1918]\n* [http://www.longlongtrail.co.uk/ Chris Baker, The Long, Long Trail]"
    }
  ]
}