{
  "content": [
    {
      "type": "text",
      "text": "# 142nd Battlefield Surveillance Brigade\n\n|branch=\n|type= Military Intelligence\n|role= Provide intelligence analysis and collection support\n|command_structure=Alabama National Guard\n|garrison=Decatur, Alabama\n|motto= Truth Through Vigilance\n|identification_symbol=\n|identification_symbol_label= Distinctive unit insignia\n}}\nThe 142nd Battlefield Surveillance Brigade (142nd BfSB) was located at Decatur, Alabama. The 142nd BfSB was a Major Command (MACOM) of the Alabama Army National Guard.\nThe 142nd BfSB stood up as a brigade in the Alabama Army National Guard Surveillance Brigade of the United States Army in 2011.\nThe brigade was tasked to improve the situational awareness for commanders at division level or higher, so they can adapt their units combat power for the current operations. For this the Battlefield Surveillance Brigades can deploy unmanned aerial vehicles, signals gathering equipment, human intelligence collectors and long range surveillance patrols.\nThe 142nd BfSB was composed of:\n* Headquarters & Headquarters Company, Decatur, Alabama, Alabama Army National Guard\n* 31st Brigade Support Company, Ozark, Alabama, Alabama Army National Guard\n* Company A, 136th Signal Battalion, Arab, Alabama, Alabama Army National Guard\n* 115th Signal Battalion, Florence, Alabama, Alabama Army National Guard\n*  1st Squadron, 131st Cavalry Regiment, Enterprise, Alabama, Alabama Army National Guard\n* 67th Network Support Company, Billings, Montana, Montana Army National Guard\n* 321st Military Intelligence Battalion, Austin, Texas, U.S. Army Reserve\nThe 142nd BfSB conducted intelligence, surveillance, and reconnaissance operations. It held an inactivation ceremony on September 18, 2016 at the Fort Quarles-Flowers Armory in Decatur, Alabama.\nHistory\nSymbolism of 142nd shoulder sleeve insignia\nThe eight pointed star polygon, symbolic of Helios the Greek God of the Sun, who could see and hear everything, denotes alertness.  The red diagonal cross of the white star polygon signifies the Alabama State flag, the home state of the Brigade.  The crossed swords suggest the aggressive and protective requirements and the elements of physical danger inherent in the mission.  The following colors represent the branches that form the Brigade:  oriental blue refers to the Military Intelligence functions and yellow and red indicates the Cavalry capabilities to accomplish its reconnaissance mission.\nThe shoulder sleeve insignia was approved on 3 March 2011. (TIOH Dwg. No. A-1-1045)\nSymbolism of 142nd unit crest\nThe shield, a warrior’s primary piece of equipment, represents the Brigade’s responsibility to the defense of national security.  The lightning bolt symbolizes swiftness of communication, a basic category to Military Intelligence.  The following colors represent the branches that form the Brigade:  oriental blue refers to the Military Intelligence functions and yellow and red indicates the Cavalry capabilities to accomplish its reconnaissance mission.\nThe distinctive unit insignia was approved on 3 March 2011.\nExternal links\n* [https://web.archive.org/web/20150318021423/http://alguard.state.al.us/Pages/Default.aspx Alabama National Guard]\n* [https://web.archive.org/web/20150402090555/http://relievedofcommand.com/images/142_BFSB_Overview.pdf 142nd BfSB]\nReferences"
    }
  ]
}