{
  "content": [
    {
      "type": "text",
      "text": "# 143rd Sustainment Command (Expeditionary)\n\nThe 143rd Sustainment Command (Expeditionary) (formerly: 143rd Transportation Command), is one of seven general officer sustainment commands in the United States Army Reserve. It has command and control of more than 10,000 Army Reserve Soldiers throughout the southeastern United States in Alabama, Florida, Georgia, Louisiana, North Carolina, South Carolina, Tennessee, Arkansas and Mississippi. It is made up of more than 100 Army Reserve units whose missions are diverse and logistical in nature. The mission of the 143rd ESC is to provide command and control of sustainment forces and to conduct sustainment, deployment, redeployment and retrograde operations in support of U.S. and multinational forces. The mission of the 143rd when not deployed is to ensure readiness of the soldiers under its command and control.\nThe ESC is a peacetime subordinate to the 377th Theater Sustainment Command.\nHistory\nThe 143rd Sustainment Command (Expeditionary) [referred to as an ESC] was originally constituted as the 143rd Transportation Command 24 November 1967 in the Army Reserve and activated 2 January 1968 in Orlando, Florida. It was reorganized and redesignated 16 October 1985 as the 143d Transportation Command. From 2003 to 2007, the 143d Transportation Command maintained a continuous presence in Southwest Asia in support of US Military Units engaged in Operations ENDURING FREEDOM and IRAQI FREEDOM. In a ceremony 17 September 2007, the 143rd Transportation Command cased its command colors for the last time signifying the end of the unit's era as a major transportation command headquarters. Immediately following, the new 143rd ESC Commanding General, Brigadier General Daniel I. Schultz, uncased the 143rd ESC colors, signifying the standup of this new logistics headquarters and the start of a new era for the 143rd.\nSix months after the transition ceremony the 143rd ESC received a Department of the Army warning order for mobilization and deployment of the 143rd headquarters. Since receipt of the warning order, the 143rd ESC prepared for deployment by completing various Soldier readiness activities including soldier readiness processing, a sustainment training exercise conducted at Ft. Lee, Virginia and warrior training at the Regional Training Center, Ft. Hunter Liggett, California.\nOn 9 January 2009, the 143rd ESC deployed in support of the troop buildup in Afghanistan for Operation Enduring Freedom. The 143rd's deployment is the first time an ESC has deployed to Afghanistan. The mission of the 143d ESC during this deployment is to provide command and control of assigned forces, and to conduct sustainment, deployment, redeployment and retrograde operations in support of U.S. and multinational forces in the U.S. Central Command area of operations. In December 2009 the 143rd ESC turned over command of the Joint Sustainment Command-Afghanistan to the 135th Sustainment Command (Expeditionary).\nIn June 2013, the 143rd ESC once again mobilized in support of Operation Enduring Freedom and deployed 265 Soldiers to Kuwait and Afghanistan in support of the 1st Theater Sustainment Command and operations in the US Central Command area of operations. The unit assumed responsibility for operational sustainment in the ARCENT AOR in October 2013 from the 135th Sustainment Command (Expeditionary), and served as the senior operational sustainment headquarters in Kuwait until May 2014, when the unit redeployed, having transferred responsibility for operational sustainment to the 1st Sustainment Command (Theater).\nSubordinate units\nStructure: November 2022.\n* 143d Sustainment Command (Expeditionary) Headquarters at Orlando, FL\n** 333d Quartermaster Detachment at\tFort Bragg, NC\n** 310th Human Resources Sustainment Center at Fort Jackson, SC\n** 336th Financial Management Support Center at\tLake Charles, LA\n*207th Regional Support Group\n**207th Regional Support Group Headquarters\tat Fort Jackson, SC\n** 362nd Quartermaster Battalion at Winterville, NC\n*** 216th Transportation Detachment at Fort Bragg, NC\n*** 385th Transportation Detachment at Fort Bragg, NC\n*** 431st Quartermaster Detachment\tat Winterville, NC\n*** 565th Transportation Detachment at Fort Bragg, NC\n*** 650th Transportation Company at Wilmington, NC\n*** 849th Quartermaster Company at Rocky Mount, NC\n*** 998th Quartermaster Company at North Charleston, SC\n** 812th Transportation Battalion at Charlotte, NC\n*** 175th Maintenance Company at Columbia, SC\n*** 414th Transportation Company at Orangeburg, SC\n*** 596th Transportation Detachment at North Charleston, SC\n*** 846th Transportation Company at Salisbury, NC\n*** 941st Transportation Company at North Charleston, SC\n*** 991st Transportation Company at Salisbury, NC\n*  518th Sustainment Brigade\n** 518th Sustainment Brigade Headquarters at Knightdale, NC\n** 518th Special Troops Battalion at Knightdale, NC\n** 352nd Combat Sustainment Support Battalion at Macon, GA\n*** 231st Transportation Company at Athens, GA\n*** 346th Quartermaster Company at Los Alamitos, CA\n*** 377th Quartermaster Company\tat Macon, GA\n*** 421st Quartermaster Company\tat Fort Valley, GA\n*** 514th Transportation Detachment\tat Statham, GA\n*** 802nd Ordnance Company at Gainesville, GA\n** 275th Combat Sustainment Support Battalion at Fort Lee, VA\n*** 460th Quartermaster Company\tat Suffolk, VA\n*** 470th Quartermaster Company\tat Fort Bragg, NC\n*** 824th Quartermaster Company\tat Fort Bragg, NC\n*** 861st Quartermaster Company\tat Nashville, TN\n*** 1006th Quartermaster Company at Knightdale, NC\n* 641st Regional Support Group at Saint Petersburg, FL\n**  332nd Transportation Battalion at Tampa, FL\n*** 94th Transportation Detachment at Perrine, FL\n*** 451st Quartermaster Company\tat Cape Cora, FL\n*** 528th Transportation Detachment\tat Perrine, FL\n*** 558th Transportation Detachment\tat Tampa, FL\n*** 623rd Transportation Company at West Palm Beach, FL\n*** 839th Transportation Detachment\tat Perrine, FL\n*** 873rd Quartermaster Company\tat Lake Park, FL\n**  257th Transportation Battalion at Gainesville, FL\n*** 146th Transportation Detachment\t at Orlando, FL\n*** 196th Transportation Company at Orlando, FL\n*** 399th Transportation Detachment at Gainesville, FL\n*** 410th Quartermaster Detachment at Jacksonville, FL\n*** 442nd Adjutant General Company at Tallahassee, FL\n*** 489th Transportation Company at Jacksonville, FL\n*** 520th Transportation Detachment at Orlando, FL\n*** 912th Personnel Company\tat Orlando, FL\n*** 993rd Transportation Company at Palatka, FL\n*** 576th Transportation Detachment at Panama City, FL\n* 642nd Regional Support Group at Decatur, GA\n** 145th Transportation Detachment at Anniston, AL\n** 403rd Transportation Detachment atAnniston, AL\n** 787th Combat Sustainment Support Battalion at Dothan, AL\n*** 461st Adjutant General Company\tat Decatur, GA\n*** 803rd Quartermaster Company\tat Opelika, AL\n*** 939th Transportation Company at Statham, GA\n*** 228th Transportation Company at Statham, GA\n*** 282nd Quartermaster Company\tat Montgomery, AL\n*** 809th Adjutant General Company at Athens, GA\n*** 1015th Maintenance Company at Fort Gillem, GA\n**  828th Transportation Battalion at Livingston, AL\n*** 206th Transportation Company at Opelika, AL\n*** 287th Transportation Company at Livingston, AL\n*** 319th Transportation Company at Augusta, GA\n*** 441st Transportation Company at New Orleans, LA\n*** 814th Adjutant General Detachment at Starkville, MS\nLineage\n*Constituted 24 November 1967 in the Army Reserve as Headquarters and Headquarters Company, 143d Transportation Brigade.\n*Activated 2 January 1968 at Orlando, Florida\n*Reorganized and redesignated 16 October 1985 as Headquarters and Headquarters Company, 143d Transportation Command\n*(Elements ordered into active military service 2003–2007 in support of the War on Terrorism)\n*Converted, reorganized, and redesignated 17 September 2007 as Headquarters and Headquarters Company, 143d Sustainment Command\n*Ordered into active military service 9 January 2009 at Orlando, Florida; released from active military service 12 February 2010 and reverted to reserve status\n*Ordered into active military service 14 June 2013 at Orlando, Florida; released from active military service 15 June 2014 and reverted to reserve status\nUnit insignia\nShoulder sleeve insignia (SSI)\nDescription\n:On a brick red upright rectangle with a  brick red border  in height and  in width overall, two golden yellow ribbands lined white with an arrowhead at each end interlaced and reversed at a 90-degree angle, fimbriated brick red.\nSymbolism\n:Brick red and golden yellow are the colors used for Transportation units, the previous designation of the unit. The interlacing represents a strong support and simulates roads and viaducts, suggesting travel. The arrowheads denote leadership and a determined direction.\nBackground\n:The shoulder sleeve insignia was originally approved 24 October 1968 for the 143d Transportation Brigade. It was redesignated for the 143d Transportation Command on 16 October 1985, and amended to revise the description and symbolism. The insignia was redesignated effective 17 September 2007, for the 143d Sustainment Command with the description and symbolism updated.\nDistinctive unit insignia (DUI)\nDescription\n:A gold color metal and enamel device  in height overall consisting of an upright winged gold arrow with wings down, surmounted by a brick red annulet inscribed in the upper arc, \"MOVEMENT\" and on the lower \"BRINGS VICTORY\" in gold letters, the area within the annulet green.\nSymbolism\n:Brick red and golden yellow (gold) are the colors used for Transportation, the previous designation of the unit and green is basic for \"all traffic forward.\" The annulet simulates both a wheel, alluding to motor transport, and an enclosure, symbolizing a terminal. The arrow, a sign of direction, denotes controlled determination, and is used to represent the implements and armaments of warfare, while the wings relate to the unit's air transport aspects and symbolizes the speed in the organization's operations.\nBackground\n:The distinctive unit insignia was originally approved for the 143d Transportation Brigade on 13 January 1969. It was redesignated for the 143d Transportation Command on 16 October 1985 and amended to revise the description. The insignia was redesignated effective 17 September 2007, for the 143d Sustainment Command with the description and symbolism updated.\nUnit honors\n* Meritorious Unit Commendation, Streamer Embroidered SOUTHWEST ASIA 2004-2005\n* Meritorious Unit Commendation, Streamer Embroidered SOUTHWEST ASIA 2009-2010\n* Meritorious Unit Commendation, Streamer Embroidered SOUTHWEST ASIA 2013-2014\nReferences\nExternal links\n* [https://web.archive.org/web/20111206230719/http://www.usar.army.mil/arweb/organization/commandstructure/USARC/OPS/377Sus/Commands/143ESC/Pages/default.aspx 143rd Sustainment Command (Expeditionary) home page]\n* [http://www.globalsecurity.org/military/agency/army/143transcom.htm Global Security: 143rd TRANSCOM]"
    }
  ]
}