{
  "content": [
    {
      "type": "text",
      "text": "# 15th century in poetry\n\nEvents\n* 1445 - Printing press developed in Europe.\nWorks\n* Moses da Rieti, ''Miqdash me'at, Hebrew poet writing in Italy\n* Per Raff Lille, Mariaviser (\"Songs to Mary\"), Denmark\n*  (\"The Great Rhymed Chronicle\"), Sweden\n* 1402&ndash;1403 &ndash; Christine de Pisan, Le Livre du chemin de long estude, describing a trial of the faults of this world in the \"Court of Reason\"\n* 1403 &ndash; Christine de Pisan, La Mutacion de Fortune (\"The Changes of Fortune\")\n* c.1434 &ndash; John Lydgate, The Life of St. Edmund, King and Martyr\n* c.1470&ndash;1485 &ndash; Pietru Caxaro, Il Cantilena, oldest known Maltese text\n* c.1480s &ndash; Robert Henryson, cycle The Morall Fabillis of Esope the Phrygian in Scotland\n* 1473&ndash;1480 &ndash; Maladhar Basu, Sri Krishna Vijaya (শ্রীকৃষ্ণবিজয়, \"Triumph of Lord Krishna\"), Bengal\nBirths and deaths\n.]]\nMexico\n*Axayacatl (1449-1481), huey tlatoani (supreme leader or emperor) of Tenochtitlan and poet\n*Ayocuan Cuetzpaltzin (mid 15th-early 16th centuries) wise man, poet, white eagle from Tecamachalco\n*Cacamatzin (1483-1520), tlatoani of Texcoco and poet\n*Chichicuepon (15th century) poet from Chalco (altépetl)\n*Cuacuauhtzin (1410-1443), tlatoani (ruler) of Tepechpan wrote a poem about his betrayal by Nezahualcoyotl.\n*Macuilxochitzin (c. 1435-?), daughter of Tlacaelel\n*Nezahualcoyotl (tlatoani) (1402-1472), ruler of Texcoco (altepetl), poet, and architect\n*Tecayehuatzin of Huexotzinco (second half of 15th to early 16th century), poet and philosopher (Huexotzinco was a semi-independent state, alternately  loyal to the Aztec Empire or to Tlaxcala.)\n*Temilotzin (end of 15th century-1525), born in Tlatelolco (altepetl) and Tlatoani of Tzilacatlan\n*Tochihuitzin coyolchiuhqui, (late 14th-mid 15th centuries) Tlatoani and poet from Teotlatzinco, son of Itzcoatl\n*Xicotencatl I (1425-1522) tlatoani of Tizatlan (Tlaxcala)\nEurope\n* Per Raff Lille (c. 1450 &mdash; c. 1500), Danish\n* Tomas af Strangnas, (died 1443), Swedish\n* François Villon (1431&ndash;1463), French\n* Janus Pannonius (1431&ndash;1472), Latin from Hungary\nJapan\n* Arakida Moritake 荒木田守武 (1473&ndash;1549), the son of Negi Morihide, and a Shinto priest; said to have excelled in waka, renga, and in particular haikai\n*Ikkyū 休宗純, Ikkyū Sōjun 1394&ndash;1481), eccentric, iconic, Rinzai Zen Buddhist priest, poet and sometime mendicant flute player who influenced Japanese art and literature with an infusion of Zen attitudes and ideals; one of the creators of the formal Japanese tea ceremony; well-known to Japanese children through various stories and the subject of a popular Japanese children's television program; made a character in anime fiction\n* Shōtetsu 正徹 (1381&ndash;1459), considered by some the last great poet in the courtly waka tradition; his disciples were important in the development of renga, which led to haiku\n* Sōgi 宗祇 (1421&ndash;1502), Japanese Zen monk who studied waka and renga poetry, then became a professional renga poet in his 30s\n*Yamazaki Sōkan 山崎宗鑑, pen name of Shina Norishige (1465&ndash;1553), renga and haikai poet, court calligrapher for Shōgun Ashikaga Yoshihisa; became a secluded Buddhist monk following the shōgun's death in 1489\nPersian language\n* Jami, poet (1414&ndash;1492)\n* Mir Ali Shir Nava'i, poet (1441&ndash;1501)\nSouth Asia\n* Bhalan (c. 1426&ndash;1500), Indian, Gujarati-language poet\n* Chandidas (চন্ডীদাস) (born 1408 CE) refers to (possibly more than one) medieval Indian Bengali-language poet\n* Meerabai (मीराबाई) (1498-1547), alternate spelling: Meera, Mira, Meera Bai; Hindu poet-saint, mystical poet whose compositions, extant version of which are in Gujarati and a Rajasthani dialect of Hindi, remain popular throughout India\n* Nund Reshi (1377&ndash;1440), Indian, Kashmiri-language poet\n* Zainuddin (fl. 1470s), Bengali-language poet\nSee also\n* 15th century in literature\n* Macronic poetry\nDecades and years\nNotes"
    }
  ]
}