{
  "content": [
    {
      "type": "text",
      "text": "# 15th Ward (Syracuse, New York)\n\nThe 15th Ward was a predominantly black historical neighborhood in the city of Syracuse, New York. Located in the central part of the city, the district played a crucial role in the demographic and social landscape of Syracuse from the early 1900’s until the early 1960’s. Making up nearly 90% of the African-American population within Syracuse. Consisting of not only dozens of black owned businesses and homes, but Jewish neighborhoods as well. The 15th ward became a refuge for many African-Americans before it was demolished during the urban renewal projects of the 1950s and 1960s. The ward created a safe space for African-Americans during an extremely oppressive time, facing so many challenges and obstacles both nationwide and locally.\nHistory\nThe 15th Ward was originally a densely populated area that emerged in the early 19th century located in the southeastern part of Syracuse, bounded roughly by Erie Boulevard East, South State Street, East Fayette Street, and South Townsend Street. The 15th ward was heavily influenced and created from a widely adapted oppressive system in the US, redlining, which allowed people of color and many new Americans only very limited housing in specific parts of the city, such as the 15th Ward. The ward was not only a home to African-Americans, but for many new Americans (Irish, Italian, and Polish immigrants) and a fairly large population of Jewish people as well.\nThroughout the early and mid-20th century, the ward served as a hub for African American culture and life in Syracuse. Primarily due to the influx of millions of African-Americans fleeing the south of the United States during a time of mass migration known as the Great Migration. The ward became known for its vibrant African-American community, while fostering a space for a chance at black financial success and social acceptance. However, many of the African-Americans fleeing the south describe the city as “no different” or “just as bad” as the south. Many stated how they felt like they were only accepted and allowed to work in the colored part of the city (15th Ward). This prompted the ward to be deemed as a working class district. Leading to the creation of black business in a predominantly white city, which was almost an impossible task for many African-American citizens during the time period in all parts of the country.\nHowever, the neighborhood underwent significant changes in the 1950’s and 1960’s due to urban renewal projects, specifically the construction of interstate-81. The project allowed the construction of Interstate-81 through the center of the city, exactly where the 15th Ward was located. These projects were allowed to happen due to the lack of African-American official representation, which led to the involvement of a certain civil right movement organization. There were also several protests against the destruction of the 15th ward by members of the community, students of Syracuse University, and members of the civil rights movement. These projects were aimed at revitalizing the city, leading to the displacement of 75% of the ward's residents and the demolition of a large portion of the ward's historical structures. Structures such as black owned business, home, and churches. Many of the ward residents were placed into some of the earliest housing projects in the United states, specifically Pioneer Homes, which is directly next to Interstate- 81.\nDemographic\nHistorically, the 15th Ward was predominantly African American, but with a mix of other cultures and ethnic backgrounds (Italians ,Irish, and polish), including a significant Jewish population. The area was known for its very close knit community bonds and a strong sense of neighborhood identity, described as everyone knowing each other. But, there was a drastic increase in the population of African-Americans in the 15th Ward during the shift from the 19th century to the 20th century, due to the mass of people fleeing the south during the Great Migration.\nCurrent Status\nToday, the 15th Ward has transformed significantly. While it tries to maintain the elements of its rich cultural heritage, much of the area has been developed into commercial and residential properties, reflecting broader urban development trends seen in many other urban places throughout the United States. For instance, the Pioneer Homes housing project located within the reminiscence of the 15th ward. This housing project today consists of predominantly African Americans, and is located directly next to I-81. Due to the proximity of pioneer homes to I-81, many residents are subject to air pollution and a lack of grocery stores within the area, creating a food desert and an increase of reports of lung infections and asthma.\nHowever, recent developments have decided that I-81 has reached the end of its life and has to be taken down. Due to this there have been attempts and efforts to commemorate the historical importance of the 15th Ward which are evident in local initiatives and cultural programs, as well as being given federal funding to start a \"new 15th ward\" public housing project. This project is intended to create better affordable public housing as well as creating a workforce development initiative through impoverished parts of the city, such as pioneer homes. These initiatives and programs are aimed to both bring awareness and to preserve the memory of the vibrant past of the 15th ward.\nReferences"
    }
  ]
}