{
  "content": [
    {
      "type": "text",
      "text": "# 16th century in Canada\n\nThe 16th century in Canada saw the first contacts, since the Norsemen 500 years earlier, between the indigenous peoples in Canada living near the Atlantic coast and European fishermen, whalers, traders, and explorers.\nFollowing the discovery of the Americas by Christopher Columbus in 1492 and the subsequent voyage to the land that became known as Canada by John Cabot in 1497, Europeans visited the Atlantic coast with increasing frequency. Cabot's report of abundant codfish drew European fishermen to the waters near Canada. Most of the visits in the 16th century were unrecorded, although by mid-century the number of European fishing boats and whaling ships visiting Newfoundland, Labrador, the Gulf of St. Lawrence, and Nova Scotia ran into the hundreds annually. Many of the Europeans came ashore to trade with the indigenous peoples or process their catch.\nThe tribes of indigenous people living in the area visited by Europeans were the Inuit in Labrador, the Beothuk in Newfoundland, the Micmaq in Nova Scotia and the southern part of the Gulf of St. Lawrence, the St. Lawrence Iroquoians along the St. Lawrence River in Quebec and Ontario, and the Innu (Montagnais), north of the St. Lawrence River. The tribes of the Wabenaki and Haudenosaunee (Iroquois) Confederacies would also play a role in the history of Canada during this century.\nThe principal resources drawing Europeans to Canada were a seemingly inexhaustible fishery of cod and marine mammals (for oil). Toward the end of the century, trading with indigenous people for furs became important.\nEvents: 1500 to 1550\n* 1501: At the direction of the king of Portugal, Gaspar Corte-Real led three caravels to North America, probably sailing along the eastern coast of Newfoundland and possibly to Labrador. Two vessels made it back to Portugal with as many as 49 captured indigenous people, probably Beothuk. Corte-Real and his vessel disappeared, fate unknown.\n* 1502. The Cantino World Map was the first map showing the world-wide discoveries of Portugal. The map shows a representation of what is probably Newfoundland with the caption that this land belongs to Portugal.\n* c. 1502: A vessel, the Gabriel, owned by Bristol merchants returned from  North America with three indigenous captives. This vessel (or another one in the same year) may also have brought the first cargo of codfish from the Americas to Europe.\n* 1504: Breton and Norman fishermen from France are known to have begun fishing near \"New Found Land,\" probably on the Grand Banks southeast of Newfoundland.\n* 1504: Sebastian Cabot, the son of John Cabot, headed a two ship expedition from Bristol to North America and came back to England with a cargo of salted codfish and fish livers.\n* 1504: Portugal imposed tariffs on American codfish imported into the country.\n* 1506: A ship's captain, Jean Denys, visited Newfoundland on a fishing expedition. He was from Honfleur in Normandy and was the first Frenchman known to have visited Canada.\n* 1508: France sent out an exploratory mission of two ships from the city of Dieppe under the command of Thomas Aubert. He brought back to France seven indigenous captives, the first the French had seen. Aubert named the St. Lawrence River and said he ascended the river for 80 leagues, about . He reported that the country was rich in fur-bearing animals.\n* 1508-1509: Sebastian Cabot sailed from Bristol and looked for a Northwest Passage to Asia, possibly entering Hudson Bay before his mutinous crew made him turn back. He then turned south and followed the Atlantic coast to the approximate latitude of Washington, D.C. before returning to England.\n* 1517: Basque fishermen visited Newfoundland for the first time.\n* 1520: João Álvares Fagundes sailed to the Americas on behalf of Portugal. He sailed along the south coast of Newfoundland. Some historians believe he founded a short-lived colony on Cape Breton Island, Nova Scotia.\n* 1523-24: Giovanni da Verrazzano, sailing for France, sailed along the Atlantic coast from North Carolina north to Nova Scotia and Newfoundland.\n* 1529: A large wooden enclosure built in the 1520s at the , Labrador indicates that whaling was underway in the Strait of Belle Isle.\n* 1534: In his first voyage to the Americas, Frenchman Jacques Cartier circled the Gulf of St. Lawrence. On the southern shore of the Gaspe Peninsula near the future town of Carleton-sur-Mer he met a group of 300 Micmaq people who were fishing from canoes. Later, he met a group of more than 200 Iroquoians, men, women, and children on Gaspe Bay. They had travelled in 40 canoes to Gaspé to fish for Atlantic mackerel which abounded in the area. They were more than  from their home of Stadacona, on the site of present-day Quebec City. Both the Micmaq and the Iroquoians met the French \"very familiarly\" probably indicating previous trading contacts with Europeans. Cartier seized two Iroquoians and took them back to France with him.\n* 1535-1536: Cartier with three ships and 110 men returned to Canada. He sailed up the St. Lawrence River and reached the St. Lawrence Iroquoian villages of Stadacona and Hochelaga (now Quebec City and Montreal). He was guided by the two Iroquoians he had seized on his previous voyage. Cartier wintered near Stadacona. Twenty-five of his men died of scurvy before the Iroquoians told him that tea made from the needles of the white cedar tree would prevent the disease. After growing conflict, Cartier kidnapped about ten of the Iroquoians, including the leader, Donnacona, and sailed back to France. Cartier told stories in France of the existence of a rich kingdom of Saguenay in the interior of North America.\n* 1536: Spanish Basque whaling ventures began at Red Bay in southernmost Labrador on the Strait of Belle Isle. The Basques whaling operation in the 16th century was large, with an average of 15 large and often armed ships and 600 men visiting Red Bay annually during the next 40 years to hunt bowhead and right whales. Bowhead whales migrated through the Strait of Belle Isle beginning in October and right whales in June. Red Bay has been designated as a UNESCO World Heritage Site to preserve the remains of the whale oil processing operations at the site.\n* 1537: Iron goods in quantity were being traded by Europeans to Indigenous peoples for marten skins in the Strait of Belle Isle.\n* c. 1540: Many thousands of fur skins were being transported from Canada to France each year.\n* 1541: Jacques Cartier and Sieur de Roberval led an attempt to colonize Quebec. Cartier left France with five ships and 500 colonists and founded the first French settlement in America, Charlesbourg-Royal, at the mouth of the Rivière du Cap Rouge in what would become Quebec City. However, he encountered problems with the St. Lawrence Iroquoians at Stadacona and in other sites. His account of experiences ends at this point and what happened afterward at Charlesbourg-Royal is unknown.\n* 1542: Cartier abandoned Charlesbourg-Royal and set off for France with his remaining ships and men. He met Roberval in Newfoundland and was ordered to turn back to Charlesbourg-Royal, but Cartier defied the order and left secretly for France. Roberval and his three ships continued on to Charlesbourg-Royal where he reestablished the colony. The colony was beset by problems of cold winters, famine, tension with the Iroquoians, and Roberval's dictatorial temperament.\n* 1542: At Blanc-Sablon in the Strait of Belle Isle, a St. Lawrence Iroquoian chief from Stadacona dined on board a Basque vessel and bragged of killing 35 woodcutters in the settlement established by Cartier. The Spanish Basques and the Iroquoians appear to have forged a partnership against other indigenous people of the region and other European powers. The name \"Iroquois\" probably derives from a Basque language word, as does the names of several other indigenous peoples in the region.\n* 1543: Roberval abandoned his colony at Charlesbourg-Royal and returned to France with all the colonists. The only wealth he had found was fool's gold and false diamonds. Cartier's and Roberval's failures in Canada inspired the proverb \"as false as Canadian diamonds.\" For the next 50 years, France had no interest in attempting to establish a colony in Canada.\nEvents: 1550-1599\n* 1550: Pottery found at the Red Bay Basque whaling station in the Strait of Belle Isle is suggestive of the presence of St. Lawrence Iroquoians at the site, more than  from their villages along the St. Lawrence River. An Englishmen visiting the area said that the indigenous people helped the Basques \"with great diligence and patience to kill, cut up and boil the whales to make...oil.\"\n* 1570s: Isolated from the trade in Canada, and also from trade originating from the coast of the future United States, the Mohawk tribe of the Haudenosaunee or Iroquois Confederacy aggressively attacked northward from their homeland along the Mohawk River in New York. Possibly they were assisted by neighbouring Algonquin speaking tribes who contested the control of the St. Lawrence River by the St. Lawrence Iroquoians. Many historians believe that the disappearance of the St. Lawrence Iroquoians by about 1580 was caused by the Mohawk attacks.\n* 1576: With three small ships, Martin Frobisher of England made his first attempt to find a Northwest Passage. He landed in Frobisher Bay on Baffin Island, persuaded that he had found a way to the \"South Sea\" (the Pacific Ocean) and Asia. He came into contact with the Inuit. Five of his men disappeared, apparently captured by the Inuit. Frobisher took an Inuk hostage in retaliation.\n* 1577: With financial support from the Queen of England, Frobisher set out with three vessels and about 150 men for the Americas on his second expedition. He again found his way to Frobisher Bay and spent his time loading his ships with 200 tons of \"gold.\" He also captured three Inuit and attempted to find the five men he had lost on his previous expedition. Returning to England, his \"gold\" turned out to be worthless.\n* 1578: Frobisher departed England with 15 ships and 400 men with the objective of founding a colony in the Arctic lands he had previously visited. He landed in Greenland and entered the Hudson Strait between the mainland of Canada and Baffin Island which could have led him to a Northwest Passage, but he turned back because of bad weather and ice-clogged waters and returned to England.\n* 1578: Records suggest that 500 French, primarily Breton and Norman, fishing boats were engaged in the Newfoundland fishery. Basque and Portuguese fishing boats may have numbered 200 to 300. English fishing boats numbered about 50.\n* 1579. The English parliament closed all ports to imports of Basque whale oil, effectively ending the Spanish Basque dominance of whaling in Canada. Only five Basque whalers visited North American waters in 1579, down from an average of 30 in the earlier 1570s. Basques, mostly French Basques, continued to be important in Canada for whaling and trade, especially trading for furs.\n* c. 1580. The St. Lawrence Iroquoians disappeared from the St. Lawrence Valley, possibly destroyed by warfare, European diseases, or dispersed among other nearby peoples, such as the Huron-Wendat. All these scenarios may have played a role in their disappearance. Their disappearance opened up the Saint Lawrence River valley to European traders, especially the French who would soon be dominant in the region.\n* 1583.  After being absent for 40 years, the French returned to the St. Lawrence River. Members of the French Basque Hoyarsabal family of Saint-Jean-de-Luz ascended the river and traded and hunted whales at Tadoussac. Jacques Noël also ascended the St. Lawrence to Montreal, the site of the abandoned colony of his uncle, Jacques Cartier, and the St. Lawrence Iroquoian town of Hochelaga. The Iroquoians had disappeared.\n* 1584: Micheau de Hoyarsabal took with him for trade with the indigenous people at Tadoussac 100 copper kettles, 1,921 knives, 50 axes, several swords, a variety of textile products, and glass beads. The most important products traded by the indigenous people were beaver pelts, other valuable furs, and caribou and moose hides. In the late 16th century Tadoussac became an important multi-national trading center with an estimated 100 European ships visiting annually.\n* 1585: The Anglo-Spanish War (1585-1604) began. England sent ships to the Grand Banks, the Newfoundland expedition led by Bernard Drake, and captured many boats in the Portuguese and Spanish fishing fleets. The British and French gradually replaced the Spanish and Portuguese fishermen in Canadian waters.\n* 1590. Basque fisherman named a place \"Pequeña Canada\" (Little Canada), located at the mouth of the Saint-Augustin River near the Strait of Belle Isle. The name \"Canada\" is the Iroquoian word for settlement or village and possibly indicates that some of the St. Lawrence Iroquoians who had disappeared before 1583 had settled at this place.\n* 1598: The Marquis de la Roche de Mesgouez was appointed lieutenant-general of Canada by the king of France and established a colony with 50 men, mostly convicts, on Sable Island. The colony lasted until 1603 when it dissolved in chaos.\n* 1599: Samuel de Champlain, who would later establish the first permanent French colony in Canada, set out on his first voyage from France to the Caribbean Sea.\nSee also\n*Former colonies and territories in Canada\n*List of North American settlements by year of foundation\n*Timeline of the European colonization of North America\n*History of Canada\n*Timeline of Canada history\n*List of years in Canada\nReferences\nFurther reading\n*\n}}"
    }
  ]
}