{
  "content": [
    {
      "type": "text",
      "text": "# 1790 Holy Roman Empire imperial election\n\n| image1            =\n| nominee1          = Leopold II\n| party1            = House of Habsburg\n| electoral_vote1   = 6\n| percentage1       = 100%\n| title             = Holy Roman Emperor\n| before_election   = Joseph II\n| before_party      = House of Habsburg\n| after_election    = Leopold II\n| after_party       = House of Habsburg\n}}\nThe 1790 Holy Roman Empire imperial election was held on 30 September in Frankfurt. The winner was Grand Duke Leopold of the House of Habsburg, who assumed the title of Holy Roman Emperor.\nLeopold succeeded his brother Joseph II, who died 20 February 1790. The election was uncontested, with Leopold securing unanimous support from the six voting prince-electors. The election occurred during the Great Turkish War and the early French Revolution.\nBackground\nThe Holy Roman Empire’s elective monarchy, codified by the Golden Bull of 1356, entrusted seven prince-electors to select the King of the Romans, typically crowned Holy Roman Emperor.\nAn Emperor with an adult son could summon the electors to formally elect his heir presumptive as King of the Romans, allowing the son to succeed the father as Emperor without further elections upon the father's death; Emperor Francis I had done this for his son Joseph in 1764, and Joseph became Emperor upon Francis's death the next year. However, when Joseph died in 1790, he had only daughters, and the throne became vacant, prompting a new election. Joseph’s reign had involved controversial reforms and the Great Turkish War against the Ottoman Empire, alongside tensions with revolutionary France. Joseph's brother Leopold, Grand Duke of Tuscany, was the sole candidate.\nElection results\nThe election occurred in Frankfurt on 30 September 1790. Leopold, as King of Bohemia, abstained from voting to avoid a tie, per custom. The six voting electors unanimously chose Leopold, with no other candidates recorded. He was crowned King of the Romans in Frankfurt on 9 October 1790.\n{| class=wikitable\n! Elector\n! Vote\n|-\n| Friedrich Karl Joseph von Erthal (Archbishop of Mainz)\n| Leopold\n|-\n| Clemens Wenceslaus of Saxony (Archbishop of Trier)\n| Leopold\n|-\n| Maximilian Francis of Austria (Archbishop of Cologne)\n| Leopold\n|-\n| Charles Theodore, Elector of Bavaria (Elector of Bavaria)\n| Leopold\n|-\n| Frederick Augustus III of Saxony (Elector of Saxony)\n| Leopold\n|-\n| Frederick William II of Prussia (Elector of Brandenburg)\n| Leopold\n|}\nSee also\n* List of imperial elections in the Holy Roman Empire\n* Holy Roman Emperor\n* Prince-elector\n* Golden Bull of 1356\n* House of Habsburg\nReferences\nExternal links\n*\n*"
    }
  ]
}