{
  "content": [
    {
      "type": "text",
      "text": "# 17th Primetime Emmy Awards\n\n| next = 18th\n}}\nThe 17th Emmy Awards, later known as the 17th Primetime Emmy Awards, were handed out on September 12, 1965.  The ceremony was hosted by Sammy Davis Jr. and Danny Thomas.  Winners are listed in bold and series' networks are in parentheses.\nThe structure of the ceremony was a complete departure from previous years. Categories were streamlined so that there were only four major categories (the previous year had 20 major categories). As a result of this, only five shows won an award. NBC's Hallmark Hall of Fame was the top show of the night, winning three major awards. The new format would be scrapped for the traditional one the following year and all subsequent Primetime Emmy Awards ceremonies.\nWinners and nominees\nWinners are listed first, highlighted in boldface, and indicated with a double dagger (‡).\nPrograms\n{| class=\"wikitable\"\n|+\n|-\n| style=\"vertical-align:top;\" |\n* 'The Dick Van Dyke Show (CBS)\n* Hallmark Hall of Fame: \"The Magnificent Yankee\" (NBC)\n* My Name Is Barbra (CBS)\n* New York Philharmonic Young People's Concerts: \"What Is Sonata Form?\" (CBS)'\n** The Andy Williams Show (NBC)\n** Bob Hope Presents the Chrysler Theatre (NBC)\n** A Carol for Another Christmas (ABC)\n** The Defenders (CBS)\n** Hallmark Hall of Fame (NBC)\n** The Man from U.N.C.L.E. (NBC)\n** Mr. Novak (NBC)\n** Profiles in Courage (NBC)\n** ''Walt Disney's Wonderful World of Color (NBC)\n** Who Has Seen the Wind? (ABC)\n** The Wonderful World of Burlesque (NBC)\n|}\nActing\n{| class=\"wikitable\"\n|+\n|-\n| style=\"vertical-align:top;\" |\n* 'Leonard Bernstein – ''New York Philharmonic Young People's Concerts as himself (CBS)\n* Lynn Fontanne – Hallmark Hall of Fame: \"The Magnificent Yankee\" as Fanny Bowditch Holmes (NBC)\n* Alfred Lunt – Hallmark Hall of Fame: \"The Magnificent Yankee\" as Oliver Wendell Holmes (NBC)\n* Barbra Streisand – My Name Is Barbra as herself (CBS)\n* Dick Van Dyke – The Dick Van Dyke Show as Rob Petrie (CBS)'\n** Julie Andrews – The Andy Williams Show as herself (NBC)\n** Johnny Carson – The Tonight Show Starring Johnny Carson as himself (NBC)\n** Gladys Cooper – The Rogues as Auntie Margaret (NBC)\n** Robert Coote – The Rogues as Timmy Fleming (NBC)\n** Richard Crenna – ''Slattery's People as James Slattery (CBS)\n** Julie Harris – Hallmark Hall of Fame: \"The Holy Terror\"  as Florence Nightingale (NBC)\n** Bob Hope – Bob Hope Presents the Chrysler Theatre: \"Bob Hope Comedy Special\" as himself (NBC)\n** Dean Jagger – Mr. Novak as Principal Albert Vane (NBC)\n** Danny Kaye – The Danny Kaye Show as himself (CBS)\n** David McCallum – The Man from U.N.C.L.E. as Illya Kuryakin (NBC)\n** Red Skelton – The Red Skelton Show as various characters (CBS)\n|}\nDirecting\n{| class=\"wikitable\"\n|+\n|-\n| style=\"vertical-align:top;\" |\n* 'The Defenders: \"The 700 Year Old Gang\" – Paul Bogart (CBS)'\n** Hallmark Hall of Fame: \"The Magnificent Yankee\" – George Schaefer (NBC)\n** My Name Is Barbra – Dwight Hemion (CBS)\n|}\nWriting\n{| class=\"wikitable\"\n|+\n|-\n| style=\"vertical-align:top;\" |\n* 'The Defenders: \"The 700 Year Old Gang\" – David Karp (CBS)'\n** The Dick Van Dyke Show: \"Never Bathe on Sunday\" – Carl Reiner (CBS)\n** Hallmark Hall of Fame: \"The Magnificent Yankee\" – Robert Hartung (NBC)\n** That Was the Week That Was – Gerald Gardner, Larry Siegel, Buck Henry, Gloria Steinem, Robert Emmett, Calvin Trillin, Dee Caruso, William Boardman, Joseph Hurley, Herbert Sargent, David Frost, Jim Stevenson, Thomas Meehan, and Saul Turteltaub (NBC)\n** The Wonderful World of Burlesque – Arnie Rosen and Coleman Jacoby (NBC)\n|}\nMost major nominations\n{| class=\"wikitable\"\n|+Networks with multiple major nominations\n|-\n! Network !! Number ofNominations\n|-\n| NBC || 21\n|-\n| CBS || 14\n|-\n| ABC || 2\n|}\n{| class=\"wikitable\"\n|+Programs with multiple major nominations\n|-\n! Program !! Network !! Number ofNominations\n|-\n| Hallmark Hall of Fame || NBC || 6\n|-\n| The Defenders || rowspan=\"3\"|CBS || rowspan=\"3\"|3\n|-\n| The Dick Van Dyke Show\n|-\n| My Name is Barbra\n|-\n| The Andy Williams Show || rowspan=\"6\"|NBC || rowspan=\"7\"|2\n|-\n| Bob Hope Presents the Chrysler Theatre\n|-\n| The Man from U.N.C.L.E.\n|-\n| Mr. Novak\n|-\n| The Rogues\n|-\n| The Wonderful World of Burlesque\n|-\n| Young People's Concerts || CBS\n|}\nMost major awards\n{| class=\"wikitable\"\n|+Networks with multiple major awards\n|-\n! Network !! Number ofAwards\n|-\n| CBS || 8\n|-\n| NBC || 3\n|}\n{| class=\"wikitable\"\n|+Programs with multiple major awards\n|-\n! Program !! Network !! Number ofAwards\n|-\n| Hallmark Hall of Fame || NBC || 3\n|-\n| The Defenders || rowspan=\"4\"|CBS || rowspan=\"4\"|2\n|-\n| The Dick Van Dyke Show\n|-\n| My Name is Barbra\n|-\n| Young People's Concerts''\n|}\n;Notes\nReferences\nExternal links\n* [http://www.emmys.com/awards/nominees-winners/1965 Emmys.com list of 1965 Nominees & Winners]\n*"
    }
  ]
}