{
  "content": [
    {
      "type": "text",
      "text": "# 17th Electronic Warfare Squadron\n\nTaken about 1975.}}\n|dates=1943–1947; 1974–1979; 2024–present\n|country=\n|branch=\n|type=\n|role=Electronic warfare\n|size=\n|command_structure=Air Combat Command\n|current_commander=\n|garrison=Robins Air Force Base, GA\n|nickname=Crebain\n|motto=\n|colors=\n|mascot=\n|battles=\n|decorations=Meritorious Unit CommendationAir Force Outstanding Unit Award\n|identification_symbol=\n|identification_symbol_label=17th Electronic Warfare Squadron emblem\n|identification_symbol_2=\n|identification_symbol_2_label=17th Defense Systems Evaluation Squadron emblem\n|identification_symbol_3=\n|identification_symbol_3_label=17th Tow Target Squadron emblem\n}}\nThe 17th Electronic Warfare Squadron is an active United States Air Force unit, assigned to the 950th Spectrum Warfare Group at Robins Air Force Base, Georgia, where it was activated on 1 August 2024.\nThe squadron was first activated as the 17th Tow Target Squadron during World War II at Wheeler Field, Hawaii.  It provided gunnery training to fighter aircraft of Seventh Air Force until being inactivated in 1947 as the United States military reduced in size.\nThe squadron was again activated under Air Defense Command (ADC) at Vincent Air Force Base, Arizona in 1955 as an element of the 4750th Air Defense Wing, taking over the equipment and personnel of another unit.  It moved with the wing to MacDill Air Force Base, Florida in 1959, where it was inactivated when ADC concentrated its fighter weapons training at Tyndall Air Force Base, Florida.\nThe squadron was activated as the 17th Defense Systems Evaluation Squadron at Malmstrom Air Force Base, Montana in 1974, again replacing an existing unit.   It tested and calibrated air defense radars until it was inactivated on 13 July 1979.\nMission\nThe squadron mission is to provide electromagnetic spectrum operations to support combat operations. It develops and applies electromagnetic spectrum operations based criteria to combatant commands through all phases of conflict, which include combat plans development, execution in near real-time, and post-mission analysis. It accomplishes this through the Electronic Warfare Assessment Center (EWAC) at Robins Air Force Base, Georgia. The EWAC is an operations floor that incorporates intelligence and operational mission data from multiple networks to provide electromagnetic spectrum situational awareness from which assessments can be made and passed to the warfighter in near real-time.\nHistory\nTow target operations\nThe squadron was first activated as the 17th Tow Target Squadron in December 1943, during World War II at Wheeler Field, Hawaii.  For most of its time in Hawaii, it was assigned to 7th Fighter Wing.  The squadron provided gunnery training to fighter aircraft of Seventh Air Force.  It also provided training for anti-aircraft artillery (AAA) units in Hawaii. For its \"resourcefulness and efficiency\" during the period from September 1944 to March 1945, the squadron was awarded a Meritorious Unit Citation.\nThe squadron operated Culver PQ-8s and Culver PQ-14 Cadets, each of which could be flown as a crewed aircraft, or as a drone aircraft, controlled by a Cessna UC-78 Bobcat mother ship.  Cadet missions were primarily flown to train AAA units.  Pilots flying drones from the UC-78s were trained and qualified on the drone aircraft they would fly and on flights controlled by the mother ship, a safety pilot would be in the drone.  Squadron pilots included members of the Womens Airforce Service Pilots, or WASPs.\nAlthough the war against Japan continued, after V-E Day support and service units at Wheeler, like the 17th, began to experience a continuous loss in personnel. After April 1946, the squadron flew very few missions as it prepared for inactivation. The squadron was inactivated in February 1947 in the post war reduction of the United States military.\nIn September 1954, Air Defense Command (ADC) organized the 4750th Tow Target Squadron at Vincent Air Force Base, Arizona to fly aerial targets for the 4750th Air Defense Wing's mission of providing air-to-air gunnery training for pilots of interceptor aircraft assigned to ADC. In January 1955, this squadron was discontinued and its personnel and equipment were transferred to the 17th, which was activated in its place and assigned to the 4750th Air Defense Group.\nWhen the 4750th Group was discontinued in 1958, the 17th was reassigned directly to the 4750th Air Defense Wing.  It moved with the wing to MacDill Air Force Base, Florida in 1959, where it was inactivated in June 1960, when ADC concentrated its fighter weapons training at Tyndall Air Force Base, Florida, where drone aircraft were used for air-to-air rocket training by ADC's more advanced aircraft.\nRadar evaluation\nThe squadron was redesignated the 17th Defense Systems Evaluation Squadron and activated at Malmstrom Air Force Base, Montana, where it assumed the radar evaluation mission, equipment and Martin EB-57E Canberra aircraft of the 4677th Defense Systems Evaluation Squadron. Although the squadron was administratively assigned to the 24th Air Division, which was also located at Malmstrom, operational control of the squadron was exercised directly by Aerospace Defense Command.\nThe 4677th had been organized at Hill Air Force Base, Utah on 18 March 1954 as the 4677th Radar Evaluation Flight, when it replaced the 7th Radar Evaluation Squadron, which had been at Hill since January 1953. It upgraded to a squadron on 8 July 1958 and was redesignated as a defense systems evaluation unit on 1 January 1960, then moved from Hill to Malmstrom on 31 August 1972  In 1974, ADC decided to replace the 4677th, which was a Major Command controlled (MAJCON) unit, with an Air Force controlled (AFCON) squadron, whose history could be continued if it were inactivated.\nThe squadron's peacetime mission was to train and evaluate ADC's ground and airborne defense units by realistically simulating enemy attacks supplemented by electronic countermeasures (ECM).  It provided \"faker\" target aircraft against Convair F-102 Delta Dagger and Convair F-106 Delta Dart interceptors.  The squadron also had a wartime mission to provide jamming support for attack aircraft.  The squadron also flew operational tests for EXM systems.\nThe squadron remained active until July 1979, and was the last active duty unit to fly the B-57.  Its evaluation mission was assumed by the 158th Defense Systems Evaluation Group of the Vermont Air National Guard.\nLineage\n* Constituted as the 17th Tow Target Squadron on 23 November 1943\n* Activated on 4 December 1943\n* Inactivated 10 February 1947\n* Activated on 8 January 1955\n* Discontinued and inactivated on 15 June 1960\n* Redesignated 17th Defense Systems Evaluation Squadron on 8 March 1974\n* Activated on 1 July 1974\n* Inactivated on 13 July 1979\n* Redesignated 17th Electronic Warfare Squadron on 15 July 2024\n* Activated on 1 August 2024\nAssignments\n* Seventh Air Force, 4 December 1943\n* Army Air Forces, Pacific Ocean Area, 15 August 1944 (attached to VI Air Service Area Command until 21 September 1944)\n* 7th Fighter Wing, 22 September 1944 (attached to Air Control Group, 7th Fighter Wing (Provisional), September 1944)\n* Seventh Air Force, 1 March 1946 (attached to Headquarters, Army Air Base, Wheeler Field)\n* 7th Fighter Wing, 15 August 1946 – 10 February 1947\n* 4750th Air Defense Group, 8 January 1955\n* 4750th Air Defense Wing, 1 October 1958 – 15 June 1960\n* 24th Air Division, 1 July 1974 – 13 July 1979 (attached to Aerospace Defense Command)\n* 950th Spectrum Warfare Group, 1 August 2024 - present\nStations\n* Wheeler Field, 4 December 1943 – 10 February 1957\n* Vincent Air Force Base, Arizona, 8 January 1955\n* MacDill Air Force Base, Florida, 11 June 1959 – 15 June 1960\n* Malmstrom Air Force Base, Montana. 1 July 1974 – 13 July 1979\n* Robins Air Force Base, Georgia, 2 August 2024 – present\nAircraft\n* Culver PQ-8 Bobcat, WW II\n* Culver PQ-14 Cadet, WW II\n* North American AT-6 Texan, WW II\n* Martin AT-23 Marauder, WW II\n* Douglas B-18 Bolo, WW II\n* Cessna UC-78 Bobcat, WW II\n* Douglas RA-24B Banshee, WW II\n* Consolidated B-24 Liberator, 1944\n* Boeing TB-29 Superfortress, 1955–1959\n* North American B-45 Tornado, 1955\n* Martin EB-57E Canberra, 1974–1979\nAwards and campaigns\n{| class=\"wikitable\"\n|- style=\"background:#efefef;\"\n! Campaign Streamer\n! Campaign\n! Dates\n! Notes\n|-\n|200px||Pacific Theater||1 December 1943–2 September 1945 ||17th Tow Target Squadron\n|}\nSee also\n* List of United States Air Force electronic combat squadrons\n* List of United States Air Force defense systems evaluation squadrons\n* B-24 Liberator units of the United States Army Air Forces\n* List of Martin B-26 Marauder operators\n* List of B-29 units of the United States Air Force\n* List of B-57 units of the United States Air Force\nReferences\nNotes\n; Explanatory notes\n; Citations\nBibliography\n*\n*\n*\nExternal links\n*"
    }
  ]
}