{
  "content": [
    {
      "type": "text",
      "text": "# 17th Colonial Infantry Division (France)\n\n1919\n}}\n| country =\n| branch = French Army\n|type= Infantry\n|role=\n|size=Division\n| battles =\n:Gallipoli campaign\n::Battle of Kumkale\n::First Battle of Krithia\n::Second Battle of Krithia\n:Salonika front\n::Battle of Doiran (1916)\n::Battle of the River Cherna\n::Battle of the Crna Bend (1917)\n::Battle of Dobro Pole\n| notable_commanders =\n}}\n17th Colonial Infantry Division was an infantry division of the French Army during the First World War. It was deployed overseas, seeing action during the Gallipoli campaign, and thereafter on the Salonika front, fighting alongside British troops in both theatres of war. It was sent to the Crimea in December 1918 as part of the Army of the Danube.\nCreation and nomenclature\n* February 1915 : '''1st Infantry Division of the Corps expéditionnaire d'Orient\n* 5 October 1915 : 1st Infantry Division of the corps expéditionnaire des Dardanelles\n* 6 January 1916 : 17th Colonial Infantry Division\n* 19 April 1919 : Disbandment\nCommanders\n* 16 March 1915 – 6 August 1915 : General Masnou\n* 6 August 1915 – 29 February 1916 : General Brulard\n* 29 February 1916 – 23 March 1917 : General Gérôme\n* 23 March 1917 – 1 January 1918 : General Têtart\n* 1 January - 29 May 1918 : General Bordeaux\n* 29 May 1918 – 19 April 1919 : General Pruneau\nChronology\n1915\n:Transported to the Aegean\nTransporting the troops by boat, for concentration at Lemnos.\nThe vanguard embarked on the Armand-Béhic and the Savoie (TM) at Toulon, departing 4 February; on the Djurdjura and the Vin-Long at Bizerte, the Chaouïa at Philippeville (Skikda) and the Carthage at Oran which concentrate at Sidi-Abdallah (Bizerte) to form a convoy and leave on 4 March. All arrived in Malta on 6 March to join the St-Louis and the Edgar-Quinet which set sail for Lemnos on 6 March and arrived on 11 March.\nA second departure from Marseille on 4 March: Lorraine, Dumbéa, Magellan, Australian, Charles-Roux, Moulouya, Théodore Mante, Italy, Pelion, from Toulon on 4 March: :fr:La Savoie (paquebot de 1901), :fr:La Lorraine (paquebot), the Paul Lecat, the Bien-Hoa, the Ceylan departed from Oran on 7 March. To go through Bizerte and then form two groups:\nFirst group: :fr:La Provence (paquebot de 1906), Dumbéa, Magellan, Théodore Mante, Moulouya, Charles-Roux. Departure from Bizerte on 14 March to arrive in Lemnos on 15 March.\nSecond group: Savoy (CA), Lorraine, Paul Lecat, Bien-Hoa, Italy, Pelion, Ceylon. Departure from Bizerte on 13 March to arrive in Lemnos on 17 March.\nThe 1st echelon on the Hérault leaves on the 4th from Marseille, passes the 6th in Toulon and arrives in Lemnos on the 10th. The 2nd echelon on Admiral-Hammelin passed through Bizerte on the 17th and arrived at Lemnos on the 27th.\n:25 April – 6 May'''\nHastily formed, after assembling on Lemnos there had been no time for the corps to undertake large-scale training before it was committed to the land campaign. During the initial Allied landing on 25 April, the corps undertook a diversionary landing on the Dardanelles Asiatic coast around Kum Kale, to divert Ottoman forces away from the main landings on the Gallipoli Peninsula, and to disrupt Ottoman artillery that could have fired upon the main landings. The 6th Mixed Colonial Regiment led the division ashore, supported by three battleships and a Russian warship. Part of the first wave was turned back by heavy fire, but the rest managed to get ashore and they proceeded to secure the village and an Ottoman fort. Throughout the course of 26 April, the Ottoman 3rd Division counterattacked, but the following day, having lost over 2,200 killed or wounded, the Ottomans began surrendering to the French in large numbers. Nevertheless, the French were withdrawn shortly afterwards, having lost about 300 killed and 500 wounded.\nFollowing this, the French force re-embarked and was landed at Cape Helles, where they took up a position on the right flank around 'S' Beach. On 28 April, the commander of the C.E.O. set up the French headquarters at the old castle situated at Sedd el Bahr. With a strength of 24 companies, they subsequently took part in the First Battle of Krithia on 28 April. In early May, the Ottoman forces launched a heavy counterattack on the Allied positions with a force of over 16,000 men. The attack was beaten back, but the French division suffered heavy casualties – up to 2,000 men – and at the height of the assault some of the Senegalese and Zouaves \"broke and ran\". As a result, the 2nd Naval Brigade from the British Royal Naval Division, had to take over some of their positions. Reinforcements were brought in, including a second French division, which arrived between 6 and 8 May, although they did not arrive in time to take part in the Second Battle of Krithia, during which the 1st Division  attacked towards the Kereves Dere gully, and although they made slow progress they eventually managed to secure the high ground overlooking this position before the attack petered out.\n:6 May – 13 July\n* Engaged  in the Battle of Krithia: took part, on 6, 7 and 8 May, 4 and 21 June, and from 12 to 14 July, 1st, 2nd, 3rd and 5th engagements of Kereves Dere.\n:13 July 1915 – 6 January 1916\n* Preparations for the offensive in the Gallipoli peninsula\n* From 17 August, 6th engagement of Kereves Dere, then took up positions in a sector in this region.\nA period of stalemate followed, and the August Offensive failed to break the deadlock. Following Bulgaria's entry into the war, on 24 September, a secret telegram was despatched from the French Minister of War to Bailloud. He was ordered to prepare a division of the C.E.O. composed exclusively of metropolitan units to be sent to aid Serbia. Bailloud and the reconstituted division commenced embarkation on 30 September. The French began to refocus their actions in the Mediterranean around Salonika.\nIn the autumn of 1915, there were concerns as to the ability of the Senegalese to cope with the winter weather, and their withdrawal from Gallipoli was proposed, once the British agreed to replace them. In order to facilitate this, the 57th and 58th regiments were to be composed of Senegalese, with the 54th and 56th composed of Marsouins. This reconstitution took place on 11 December 1915. Similarly, five companies of creoles were detached from the 54th and 56th in order to be sent to a wintering camp. The plan did not go ahead. The creole companies of the 54th were detached on 15 December, and returned to their unit on 22 January 1916. The two locations for the \"wintering\" were either Egypt or Algeria. For political reasons, it was deemed inappropriate to send  them there, but to keep them on Lesbos. It was usual practice for Senegalese to be sent to Fréjus for a period of \"wintering\" (hivernage), but this location did not get proposed as an alternative, notwithstanding its previous mention by General Joffre. The men of the 58th were evacuated in batches between 16 December and 5 January, whilst the 57th were evacuated by a convoy of several ships on 13 December 1915. The marsouins of the 54th and the 56th were evacuated on 2 and 3 January 1916 respectively. Six older artillery pieces were destroyed and abandoned, two 140&nbsp;mm guns (modèle 1884) and four 240&nbsp;mm guns (modèle 1876), given that it was not possible to embark all of the heavy guns.\n1916\n:6 January – 10 February\n* A telegram dated 6 January 1916 proclaims that the troops of the CED are to be known henceforth as the 17th Colonial Infantry Division. On 8 February, the commander-in-chief announces that the division is now part of the Armée d'Orient (1915–1919). This reflects the secret order dated 18 January 1916 that the marsouins of the 17th Division stationed at Moudros, Tenedos and Lesbos should be redeployed to Salonika, to join the AFO.\n:10 February – 28 April\n* On 6 February, the war diary records that the government has decided that the marsouins of the 1st Colonial Infantry Brigade garrisoned on Lesbos should be transported to Salonika as soon as possible. In keeping with this order, the troops embarked on 10 February and disembarked on 12 February at Salonika. The headquarters staff of the 2nd Colonial Infantry Brigade arrive at Salonika on 15 February. Thereafter, the infantry component of the 2nd Colonial Infantry Brigade is replenished by two colonial infantry regiments arriving at Salonika via France. The 1st Regiment's three battalions had disembarked on 21 February.  Two battalions of the 3rd Regiment disembarked on 26 February. The remainder of the 3rd Regiment were embarked aboard the Provence 2 which departed Toulon on 23 February, and was torpedoed in the Ionian Sea on 26 February. Only 500 other ranks and 7 officers survived the sinking. The two groups of survivors were taken to Milos and Malta, and were disembarked at Salonika on 21 and 26 March respectively.\n* The redeployment of the six battalions of Tirailleurs remained uncertain at this time, notwithstanding the fact that as stated already in this article, this has been a subject of debate since October 1915. The Tirailleurs were to remain on Lesbos until 28 April 1916, when they were embarked for passage to Fréjus via Toulon.\n* From 20 February onwards, the division was charged with the setup and upkeep of defensive positions towards Livaritikon Oros (20&nbsp;km south-east of Salonika) and the northern and southeastern heights of :fr:Galatista in Chalkidiki.\nin the Galatista sector, April 1916.]]  , photographed 26–27 June 1916.]]\n:28 April - 9 June\n* Occupation of a sector on the right bank of the lower Struma (river): development work on the road from Salonica to Serres.\n:9 June – 9 August\n* Relief by the 28th Division (United Kingdom); movement towards Irikli and Dérésélo (20&nbsp;km & 16&nbsp;km south-east of Doiran respectively); works and occupation of a sector towards Gola (in Thesprotia, 6&nbsp;km south of Lake Doiran) and Hill 576.\n:9 August – 14 September\n* Engaged from 9 to 18 August in the Battle of Doiran (1916), then organization of the conquered positions northwest of Akritas (Vladaya).\n:14 September – 12 October\n* Withdrawal from the front and rest of the 33rd Colonial Brigade in the region of Banitsa (12&nbsp;km west of Lake Ostrovo), then in that of Negovani (10&nbsp;km south-east of Florina) and Sakulevo (:mk:Сакулево)\n* Participation of this brigade in the formation of a provisional division .\n* The 34th Colonial  Brigade continued to hold the Doiran sector (at the direct disposal of the command of the Allied Army of the Orient.)\n:12 October – 29 December\n*The two brigades are successively placed at the disposal of the Serbian army  : participation in the Battle of the River Cherna:\n** Offensive of the 33rd Colonial Brigade between Tcherna and Kenali (:sh:Kremenica (Bitolj)) (engagements of the 27, 28 October and 14 November).\n** 15 November, advance east of Kenali; 27 November, advance to the line of Hill 1050, Novaci, North Macedonia; then further progression to Vlaklar (12&nbsp;km north-east of Bitola).\n** From 11 December, organization of conquered positions.\n* From 28 October, relief of the 34th Colonial Brigade, south of Doiran, by British troops of XII Corps (United Kingdom). Elements of this brigade, carried on the right bank of the Vardar, are made available to the 122nd Infantry Division (France). Other elements, carried in the region of Alexsia (20&nbsp;km south-east of Doiran), joined the 17th Division in stages, towards Bitola, between 22 November and 5 December.\n1917\n:29 December 1916 – 9 May 1917\n* Relief by Italian elements, withdrawal from the front and rest between Monastir and Florina; then occupation of a new sector in the :fr:Rapech region, Bernik (17&nbsp;km east of Bitola).\n* 4 April: the last elements, remained towards Doiran with the 122nd Division, join the 17th Division\n:9 May 1917 – 13 August 1918\n* Attack of the Bulgarian lines, in the Battle of the Crna Bend (1917), then organization of a sector in this region.\n* At the end of April 1918, elements at rest near Polok (25&nbsp;km south-east of Bitola).\n1918\n:13 August – 10 September\n* Withdrawal from the front, movement towards Vladova (5&nbsp;km west of Vodena); rest.\n:10 September – 12 October\n* Movement towards the front, in the region of the Cerna bend.\n* Engaged, alongside the Second Army (Serbia), on 15 and 16 September, in the Battle of Dobro Pole:\n* Attack on the lines of the Kravitza Plateau and Kravitchki Kaméne (in the Voras Mountains) ; continuation towards :fr:Ribartsi.\n*24 September, taken from the :fr:Dolno Tchitchevo Monastery  ; Vardar crossing at :fr:Oulantsi; continuation, by Štip, towards :fr:Neokazi  ; then halted at Kriva Palanka.\n:12 October – 20 November\n* Transport by rail, from Kriva Palanka, in the Pirot region (of Serbia)\n* From 29 October: movement towards Knjaževac, then towards Zaječar and operations on the Danube, towards the Orșova river bend.\n* 4 November: Cessation of hostilities with Austria-Hungary .\n* December: transport to Neusatz and occupation of the Banat of Timișoara.\n1919\n* 19 April 1919 : from this date, dissolution of the division\nOrder of battle\nFebruary 1915\nSources:\n1st Division (renamed as :fr:17e division d'infanterie coloniale on 6 January 1916) under Jean-Marie Brulard\n* 1st (Metropolitan) Brigade\n**175th Regiment\n***three battalions of metropolitan infantry\n**1st Provisional African Regiment\n***composed of a French Foreign Legion battalion and two Zouave battalions.  composed of ethnic Greek volunteers forming the 13th and 14th companies of the provisional regiment.|group=Note}}\n* 2nd (Colonial) Brigade\n**4th Mixed Colonial Regiment|group=Note}}\n***mixed composition of two Senegalese Tirailleurs battalions and one \"Marsouin\" (European) battalion\n**6th Mixed Colonial Regiment\n***mixed composition of two Senegalese battalions and one European battalion\n*Divisional Troops\n**Groupe Holtzapfel – 3 batteries (4x 75mm field guns apiece) of the 1st Field Artillery Regiment commanded by Major Holtzapfel\n**Groupe Charpy – 3 batteries (4x 75mm field guns apiece) of the 8th Field Artillery Regiment commanded by Major Charpy\n**Groupe Benedittini – 2 batteries (4x 65&nbsp;mm mountain guns apiece) of the 2nd Mountain Artillery Regiment commanded by Major Benedittini (succeeded by Major Grépinet)\n**Supporting elements for engineering, logistical and medical services\nOctober 1915\n* 1st (Metropolitan) Brigade transfers out, to be part of the 156th Infantry Division (France)\n* 2nd (Colonial) Brigade is now designated as 1st Colonial Infantry Brigade as of 9 October, and on 23 May 1916 is further redesignated as the 33rd Colonial Infantry Brigade.\n* The 4th (Colonial) Brigade is now designated as 2nd Colonial Infantry Brigade, and takes the place of the 1st Metropolitan Brigade, which redeploys to Salonika. This brigade is composed of the 57th and 58th Colonial Infantry Regiments, containing a mix of marsouins and Senegalese Tirailleurs.\n* Divisional artillery\n** Transfer out to 156th Infantry Division by Groupe Grépinet - 2 batteries (4x 65&nbsp;mm mountain guns apiece) of the 2nd Mountain Artillery Regiment formerly commanded by Major Benedittini (succeeded by Major Grépinet)\n** Transfer in of Groupe Mercadier - 3 batteries (4x 75mm field guns apiece) of the 47th Field Artillery Regiment formerly commanded by Captain Roux (succeeded by Major Mercadier)}}\nFebruary 1916\nSince February 1916, its infantry component is now made up of the 1st and 3rd regiments of colonial infantry, having arrived between 18 and 27 February, taking the place of the six Tirailleur battalions of the 57th and 58th Colonial Infantry Regiments that have remained on Lesbos.\nof the 1st Colonial Infantry Regiment at Akritas, Kilkis in Central Macedonia in August 1916.]]\n*Additional divisional artillery\n**Groupe Le Maître - 49th, 50th, 54th batteries (4x 65&nbsp;mm mountain guns apiece) of the 1st Mountain Artillery Regiment commanded by Major Le Maître (later succeeded by Major Grenié). They joined the division on 31 March 1916.\n**Mortar Battery - 101st Battery of the 1st Field Artillery Regiment, equipped with the Mortier de 58 mm type 2, to remain with the Division, and to be designated part of the 201st Field Artillery Regiment in January 1918.\n*A squadron of cavalry, from the Chasseurs d'Afrique were assigned to the division in April 1916.\n*The 2nd Colonial Infantry Brigade is further redesignated as the 34rd Colonial Infantry Brigade on 23 May 1916.\nAugust 1917\nAll of the 75mm batteries above were grouped together in April 1917 to form the 201st Field Artillery Regiment.\nFour Battalions of Tirailleurs Sénégalais arrive in Salonika, the 81st, 93rd, 95th and 96th, are assigned to the division, and are collectively known as the Groupement des Bataillons Sénégalais du 17e D.I.C. with effect from 21 November 1917. The Commanding Officer of the :fr:96e bataillon de tirailleurs sénégalais, Major Albert Jean René Desaulses De Freycinet, assumes overall command of the Groupement In due course Lieutenant Colonel Auguste Marie Louis Debieuvre commanded the Groupement, following his service on the western front with the 58th Regiment and then the :fr:33e régiment d'infanterie coloniale, until he was promoted and handed over command once more to Major De Freycinet. Lieutenant Colonel Debieuvre had served as the commanding officer of the 58th Regiment since 21 August 1915 up to its disbandment in May 1917.\nMay 1918\nThe battery of 58mm trench mortars are now redesignated as the 8th Battery of the 179th Trench Artillery Regiment, with effect from 1 April 1918.\nThe Groupe of 65mm artillery batteries of the 1st Mountain Artillery Regiment are now redesignated as the 3rd Groupe of the 13th Colonial Artillery Regiment, with effect from 1 May 1918.\nNotes and citations\nNotes\nCitations\nReferences\n*\n*\n*\n*\n|series=History of the Great War Based on Official Documents by Direction of the Historical Section of the Committee of Imperial Defence (History of the Great War)|title=Military Operations Macedonia: From the Outbreak of War to the Spring of 1917 |volume=I |last=Falls |first=C. |author-link=Cyril Falls |year=1996 |orig-year=1933 |publisher=HMSO |location=London |edition=Imperial War Museum and Battery Press |isbn=978-0-89839-242-5}}\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\nWar Diaries\n*\n*\n*\n*\n*\n*\n*\n*"
    }
  ]
}