{
  "content": [
    {
      "type": "text",
      "text": "# 17th CableACE Awards\n\nThe 17th Annual CableACE Awards were held on December 6, 1995. Below are the nominees and winners from that ceremony in the major categories.\nWinners and nominees\nWinners in bold.\nMovie or Miniseries\n* Citizen X (HBO)\n* The Burning Season (HBO)\n* Choices of the Heart: The Margaret Sanger Story (Lifetime)\n* Indictment: The McMartin Trial (HBO)\n* Kingfish: A Story of Huey P. Long (TNT)\nActor in a Movie or Miniseries\n* Raúl Juliá – The Burning Season (HBO)\n* John Goodman – Kingfish: A Story of Huey P. Long (TNT)\n* Tommy Lee Jones – The Good Old Boys (TNT)\n* Raúl Juliá – Down Came a Blackbird (Showtime)\n* James Woods – Indictment: The McMartin Trial (HBO)\nActress in a Movie or Miniseries\n* Linda Hamilton – ''A Mother's Prayer (USA)\n* Laura Dern – Down Came a Blackbird (Showtime)\n* Marlee Matlin – Against Her Will: The Carrie Buck Story (Lifetime)\n* Vanessa Redgrave – Down Came a Blackbird (Showtime)\n* Mercedes Ruehl – Indictment: The McMartin Trial (HBO)\nSupporting Actor in a Movie or Miniseries\n* Jeffrey DeMunn – Citizen X (HBO)\n* Robert Carlyle – Cracker (Episode: \"To Be a Somebody\") (A&E)\n* Tony Haygarth – The Infiltrator (HBO)\n* Ben Kingsley – Joseph (TNT)\n* Max Von Sydow – Citizen X (HBO)\nSupporting Actress in a Movie or Miniseries\n* Jean Marsh – Fatherland (HBO)\n* Lolita Davidovich – Indictment: The McMartin Trial (HBO)\n* Shirley Knight – Indictment: The McMartin Trial (HBO)\n* Kay Lenz – Shame II: The Secret (Lifetime)\n* Diana Rigg – Screen Two (Episode: \"Genghis Cohn\") (A&E)\nDirecting a Movie or Miniseries\n* John Frankenheimer – The Burning Season (HBO)\n* Tim Fywell – Cracker (Episode: \"To Be a Somebody\") (A&E)\n* Chris Gerolmo – Citizen X (HBO)\n* Mick Jackson – Indictment: The McMartin Trial (HBO)\n* Jean Stewart – Cracker (Episode: \"Men Should Weep\") (A&E)\nWriting for a Movie or Miniseries\n* Stanley Price – Screen Two (Episode: \"Genghis Cohn\") (A&E)\n* Joseph Dougherty – Witch Hunt (HBO)\n* Chris Gerolmo – Citizen X (HBO)\n* John Hopkins and Toshiro Ishido – Hiroshima (Showtime)\n* Jimmy McGovern – Cracker (Episode: \"To Be a Somebody\") (A&E)\nComedy Series\n* The Larry Sanders Show (HBO)\n* Dream On (HBO)\n* Exit 57 (Comedy Central)\n* The State (MTV)\nActor in a Comedy Series\n* Garry Shandling – The Larry Sanders Show (HBO)\n* Brian Benben – Dream On (HBO)\n* Howie Mandel – Howie Mandel's Sunny Skies (Showtime)\n* Jeffrey Tambor – The Larry Sanders Show (HBO)\n* Rip Torn – The Larry Sanders Show (HBO)\nActress in a Comedy Series\n* Wendie Malick – Dream On (HBO)\n* Denny Dillon – Dream On (HBO)\n* Janeane Garofalo – The Larry Sanders Show (HBO)\n* Jodi Lennon – Exit 57 (Comedy Central)\n* Amy Sedaris – Exit 57 (Comedy Central)\nDirecting a Comedy Series\n* Todd Holland – The Larry Sanders Show (Episode: \"Doubt of the Benefit\") (HBO)\n* Robby Benson – Dream On (Episode: \"Try Not to Remember\") (HBO)\n* Robert Ginty – Dream On (Episode: \"Bess, You Is Not My Woman Now\") (HBO)\n* John Landis – Dream On'' (Episode: \"The Courtship of Martin's Father\") (HBO)\n* Alan Myerson – The Larry Sanders Show (Episode: \"Arthur's Crisis\") (HBO)\nWriting a Comedy Series\n* Drake Sather, Garry Shandling, and Peter Tolan – The Larry Sanders Show (Episode: \"Doubt of the Benefit\") (HBO)\n* H. Jon Benjamin, Loren Bouchard, Bill Braudis, Dom Irrera, Jonathan Katz, Karen LeBlanc, Annette LeBlanc Cate, Will Lebow, Richard Luongo, Andre Lyman, Julianne Shapiro, Laura Silverman, Tom Snyder, and Mark Usher – Dr. Katz, Professional Therapist (Comedy Central)\n* Maya Forbes – The Larry Sanders Show (Episode: \"The Fourteenth Floor\") (HBO)\n* Maya Forbes, Steve Levitan, and Garry Shandling – The Larry Sanders Show (Episode: \"Roseanne's Return\") (HBO)\n* Paul Simms – The Larry Sanders Show (Episode: \"Hank's Divorce\") (HBO)\nDramatic Series\n* The Outer Limits (Showtime)\n* Avonlea (Disney Channel)\n* Tales From the Crypt (HBO)\n* The Showtime 30-Minute Movie (Showtime)\nDramatic or Theatrical Special\n* Cosmic Slop (Episode: \"Space Traders\") (HBO)\n* Cosmic Slop (Episode: \"Tang\") (HBO)\n* Cosmic Slop (Episode: \"The First Commandment\") (HBO)\n* Tokyo Bound (International Channel)\nActor in a Dramatic Special or Series\n* John Hurt – Picture Windows (Episode: \"Two Nudes Bathing\") (Showtime)\n* Beau Bridges – The Outer Limits (Episode: \"The Sandkings\") (Showtime)\n* Larry Drake – The Outer Limits (Episode: \"The Message\") (Showtime)\n* Kiefer Sutherland – Fallen Angels (Episode: \"Love and Blood\") (Showtime)\n* Jim True – The Showtime 30-Minute Movie (Episode: \"Two Over Easy\") (Showtime)\nActress in a Dramatic Special or Series\n* Paula Jai Parker – Cosmic Slop (Episode: \"Tang\") (HBO)\n* Jackie Burroughs – Avonlea (Disney Channel)\n* Jennifer Grey – Fallen Angels (Episode: \"A Dime a Dance\") (Showtime)\n* Isabella Rossellini – Tales From the Crypt (Episode: \"You, Murderer\") (HBO)\n* Helen Shaver – The Outer Limits (Episode: \"The Sandkings\") (Showtime)\nDirecting a Dramatic Special or Series\n* Stuart Gillard – The Outer Limits (Episode: \"The Sandkings\") (Showtime)\n* Jim McBride – Fallen Angels (Episode: \"Fearless\") (Showtime)\n* Patricia Resnick – The Showtime 30-Minute Movie (Episode: \"Grandpa's Funeral\") (Showtime)\n* Steven Soderbergh – Fallen Angels (Episode: \"Professional Man\") (Showtime)\n* Robert Zemeckis – Tales From the Crypt (Episode: \"You, Murderer\") (HBO)\nWriting a Dramatic Special or Series\n* Patricia Resnick – The Showtime 30-Minute Movie (Episode: \"Grandpa's Funeral\") (Showtime)\n* John Boorman – Picture Windows (Episode: \"Two Nudes Bathing\") (Showtime)\n* Trey Ellis – Cosmic Slop (Episode: \"Space Traders\") (HBO)\n* Ted Henning and Stephen Kay – The Showtime 30-Minute Movie (Episode: \"Two Over Easy\") (Showtime)\n* Frank Pugliese – Fallen Angels (Episode: \"Love and Blood\") (Showtime)\nAnimated Special or Series\n* Dr. Katz, Professional Therapist (Comedy Central)\n* Duckman (USA)\n* Rocko's Modern Life (Nickelodeon)\n* Rugrats (Nickelodeon)\nComedy Special\n* HBO Comedy Hour (Episode: \"Kathy & Mo: The Dark Side\") (HBO)\n* South Bank Show (Episode: \"British Comedy Special\") (Bravo)\n* South Bank Show (Episode: \"Dawn French and Large Women\") (Bravo)\n* South Bank Show (Episode: \"Lenny Henry: African-American Humor\") (Bravo)\n* State of the Union: Undressed (Comedy Central)\nStandup Comedy Special or Series\n* Full Frontal Comedy (Showtime)\n* A&E's An Evening at the Improv (A&E)\n* HBO Comedy Hour (Episode: \"Rosie O'Donnell\") (HBO)\n* HBO Comedy Hour (Episode: \"Women of the Night IV Hosted by Tracey Ullman\") (HBO)\n* The Mommies: My Kid Beat Up Your Honor Student (Showtime)\nPerformance in a Comedy Special\n* Mo Gaffney and Kathy Najimy – HBO Comedy Hour (Episode: \"Kathy & Mo: The Dark Side\") (HBO)\n* Danny Bonaduce, Franklin Cover, Frank Gorshin, Robert Hegyes, Sherman Hemsley, Lawrence Hilton-Jacobs, Shirley Jones, Dave Madden, Ron Palillo, Isabel Sanford, and Adam West – 1995 MTV Movie Awards (MTV)\n* Karen Hines – Married Life (Comedy Central)\n* Dennis Miller – State of the Union: Undressed (Comedy Central)\nDirecting a Comedy Special\n* Anthony Morina – The Clinic (Comedy Central)\n* Ken Finkleman – Married Life (Comedy Central)\n* Vince Paterson – In Search of Dr. Seuss (TNT)\nNews Special or Series\n* Rwanda: Cry Justice (CNN International)\n* CNN Presents (Episode: \"America Mourns\") (CNN)\n* CNN Presents (Episode: \"Kingdom of Cocaine\") (CNN)\n* New Religions: The Cult Question (MTV)\n* Vietnam: Coming to Terms (CNN)\nTalk Show Series\n* Politically Incorrect with Bill Maher (Comedy Central)\n* Ask E. Jean (America's Talking)\n* Charles Grodin (CNBC)\n* Four on the Floor (VH1)\n* Inside the Actors Studio (Bravo)\nDocumentary Series\n* '''Desmond Morris' The Human Animal''' (TLC)\n* 20th Century (A&E)\n* A Baby's World (TLC)\n* Biography (A&E)\n* VH1 to 1 (VH1)\nEntertainment Host\n* Garry Shandling – HBO Comedy Hour (Episode: \"The 1995 Young Comedians Special\") (HBO)\n* Bobby Collins – Stand Up Spotlight (VH1)\n* John Henson – Talk Soup (E!)\n* Bill Maher – Politically Incorrect with Bill Maher (Comedy Central)\n* Dennis Miller – Dennis Miller Live (HBO)\nWriting an Entertainment Special\n* Jeff Cesario, Ed Driscoll, David Feldman, Eddie Feldmann, Greg Greenburg, and Kevin Rooney – Dennis Miller Live (Episode: \"America: Where Did Our Sense of Humor Go?\") (HBO)\n* Trace Beaulieu, Paul Chaplin, Jim Mallon, Kevin Murphy, Michael J. Nelson, Mary Jo Pehl – The MST3K Little Gold Statue Preview Special (Comedy Central)\n* Rosie O'Donnell – HBO Comedy Hour (Episode: \"Rosie O'Donnell\") (HBO)\n* Marilyn Kentz and Caryl Kristensen – The Mommies: My Kid Beat Up Your Honor Student (Showtime)\n* Rita Rudner – HBO Comedy Hour (Episode: \"Rita Rudner: Married Without Children\") (HBO)\nProgram Interviewer\n* Jane Wallace – Under Scrutiny with Jane Wallace (FX)\n* Larry King – Larry King Live (CNN)\n* Cal Thomas – Cal Thomas (CNBC)\nSports Information Series\n* MTV Sports (MTV)\n* Inside the NFL (HBO)\n* The Sporting Life With Jim Huber (CNN)\n* The Sports Reporters (ESPN)\n* Up Close: Primetime (ESPN)\nSports Host\n* Keith Olbermann – SportsCenter (ESPN)\n* Chris Berman (ESPN)\n* Jim Lampley (HBO)\n* Dan Patrick (ESPN)\n* Al Trautwig (Madison Square Garden Network)\nSports Commentator/Analyst\n* Dick Schaap – The Sports Reporters (ESPN)\n* Doug Collins (TNT)\n* Peter Gammons (ESPN)\n* Dick Vitale (ESPN)\nReferences"
    }
  ]
}