{
  "content": [
    {
      "type": "text",
      "text": "# 17th Canadian Film Awards\n\nThe 17th Canadian Film Awards were held on May 15, 1965 to honour achievements in Canadian film.\nEntries this year numbered 104, including four features. Interest in the event, which was hosted by radio personality Max Ferguson, was such that an overflow crowd had to spill into the Hot Stove Club at Maple Leaf Gardens, where they viewed the ceremony on closed-circuit television.\nThe entire Canadian film industry was presented with a special medal to commemorate International Co-Operation Year (ICY), a celebratory designation by the United Nations to direct attention to the common interest and purpose of humanity in achieving peace and human dignity. Dr. J. Roby Kidd, founding director of the CFA and head of ICY Canada, presented the medal to cinematographer Roy Tash, who accepted it on behalf of the industry.\nWinners\nFilms\n*Film of the Year: Not awarded\n*Feature Film: The Luck of Ginger Coffey — Crawley Films, Roth-Kershner Productions, Leon Roth producer, Irvin Kershner director\n*Arts and Experimental: Canon — National Film Board of Canada, Norman McLaren and Grant Munro directors\n::Le Monde va nous prendre pour des sauvages (People Might Laugh at Us) — National Film Board of Canada, Jacques Godbout and Françoise Bujold directors\n*TV Information: Summer in Mississippi — Canadian Broadcasting Corporation, Beryl Fox producer and director\n*TV Entertainment: The Open Grave — Canadian Broadcasting Corporation, Ron Kelly producer and director\n*Films for Children: Québec 1603 - Samuel de Champlain — National Film Board of Canada, Fernand Dansereau and André Belleau producers, Denys Arcand director\n*Travel and Recreation: Upper Canada Village — Moreland-Latchford Productions\n::Valley of the Swans — Photographic Branch, Government of British Columbia, Bernard H. Atkins director\n*General Information: Caroline — National Film Board of Canada, Georges Dufaux and Clément Perron directors\n::Some Are Sunfishers - Chetwynd Films, Arthur Chetwynd producer, Robert Barclay director\n*Public Relations: Something Personal — Master Films\n*Sales Promotion: A Solid Investment — Williams, Drege & Hill\n*Training and Instruction: The Perception of Orientation — National Film Board of Canada, Sidney Goldsmith producer, Grahame Parker and Jacques Parent directors\n*Filmed Commercial, Company or Product: Rose Brand Pickles, Obsession — Robert Lawrence Productions\n*Filmed Commercial, Public Service: Money Burned — National Film Board of Canada, Grant McLean director\n*Amateur: Portrait of Lydia — John Straiton director\n::Certificate of Merit: Kente — Gordon Rose director\n::Certificate of Merit: Restless Journey — Hugh Greig producer and director\n::Certificate of Merit: The World Is Our Classroom — Helen Webb-Smith and Doris Kerr directors\nNon-Feature Craft Awards\n*Black and White Cinematography: Jean-Claude Labrecque, Walls of Memory (Mémoire en fête) (NFB)\n*Colour Cinematography: Francis Chapman and Christopher Chapman, Expedition Bluenose\nSpecial Award\n*Sweet Substitute (aka Caressed), Larry Kent producer and director  — \"for the very great promise and already substantial accomplishment clearly shown by director and actors alike, and for the sensitive and imaginative handling of the story\".\nReferences"
    }
  ]
}