{
  "content": [
    {
      "type": "text",
      "text": "# 1800 United States presidential election in New York\n\nIn the 1800 United States presidential election, electors could be selected in each state at any time after October 31 and all electors were required to vote on  December 3, 1800.  In the 1800 United States presidential election in New York The state legislature chose 12 representatives, or electors to the Electoral College on November 6, 1800.  Based on the constitutional provision in effect at that time electors cast two votes. The candidate receiving most votes would be President. The runner up would be elected Vice President.\nBackground\nLike many states at the time, New York chose its presidential electors by a vote of the New York legislature. Therefore, the April 1800 elections were the decisive contest in the presidential campaign, and with New York shaping up as a critical swing state, its legislative elections were sharply contested.\nThough the upstate New York, through political loyalty to former Governor George Clinton, was reliably Republican, the Federalist Party remained strong in New York City and the lower Hudson Valley, where the majority of legislative seats were.\nLegislative election\nThe Federalist campaign was led by former Secretary of the Treasury Alexander Hamilton. The Republican campaign in New York City was led by Aaron Burr and his supporters, primarily made up of members of the city Tammany Society, who would eventually become the city's Tammany Hall political machine. Matthew L. Davis, William P. Van Ness, and John Swartwourt were Burr's key advisors; they established a steering committee to direct the campaign and canvassing committees to raise funds from wealthy donors.\nTo effectively challenge the Federalists in their stronghold of Manhattan, Burr assembled a ticket of Republican luminaries who could win Federalist votes. Operating covertly to avoid Hamilton's response, Burr recruited governor Clinton, Revolutionary hero Horatio Gates, Brockholst Livingston, and president of the New York Insurance Company John Broome. Initially, Clinton, Gates and Livingston attempted to decline, but Burr prevailed on them to join the ticket.\nThe campaign was furious, before and during the three-day balloting period. Burr ran the campaign out of his country estate on Manhattan, serving refreshments and keeping mattresses for campaign staff. Meetings were also held at Martling's Long Room, which would become the headquarters of Tammany Hall. To generate support, Davis planted stories in prominent newspapers claiming that Republican supporters were meeting nightly in all corners of the city, at which attendance and enthusiasm were high. Later, it would be revealed that most meetings consisted of Davis and two friends. Burr himself criss-crossed polling places to harangue voters; on more than one occasion, he met Hamilton, whom he engaged in impromptu debate.\nOn May 1, balloting closed; Burr and the Republicans had swept New York.\nAftermath\nThe state was ultimately decisive in the Republican victory in the election\nElectoral vote\nDuring this election, New York cast 12 electoral votes for Democratic-Republican Party candidates Thomas Jefferson and Aaron Burr.\nSee also\n* United States presidential elections in New York\nBibliography\n*\nReferences"
    }
  ]
}