{
  "content": [
    {
      "type": "text",
      "text": "# 1808 in the United Kingdom\n\nIreland  Scotland  Wales|label2=Sport|data2=1808 English cricket season}}\nEvents from the year 1808 in the United Kingdom.\nIncumbents\n* Monarch – George III\n* Prime Minister –  William Cavendish-Bentinck, 3rd Duke of Portland (Tory)\n* Foreign Secretary – George Canning\n* Home Secretary – Lord Liverpool\n* Secretary of War – Lord Castlereagh\nEvents\n* 1 January – Sierra Leone becomes a British Crown Colony.\n* 3 January – The first issue of The Examiner appears, edited by Leigh Hunt and published by his brother John Hunt.\n* 12 January – John Rennie's scheme to defend St Mary's Church, Reculver in south east England, founded in 669, from coastal erosion is abandoned in favour of demolition, despite the church being an exemplar of Anglo-Saxon architecture and sculpture.\n* February – William Bradbery first cultivates watercress commercially, at Springhead, Kent.\n* 15 February – Laying of the foundation stone for Nelson's Pillar in Dublin.\n* 18 February – First recorded rescue using the Manby Mortar when the crew of the Plymouth brig Elizabeth stranded off Great Yarmouth are hauled safely to shore under the direction of Captain Manby.\n* 1 March – Slave trade abolished in all of British colonies as the Slave Trade Act 1807 takes effect. This year, the Royal Navy establishes the West Africa Squadron on the coast of West Africa to enforce the abolitionist Blockade of Africa.\n* 2 March – Inaugural meeting of the Wernerian Natural History Society, a Scottish learned society, held in Edinburgh.\n* 22 March – English Wars: Battle of Zealand Point – British ships defeat those of Denmark and Norway.\n* 6 May – As the kingdom of Spain passes under the control of Napoleon, the Anglo-Spanish War (1796–1808) effectively ends as the United Kingdom allies with Spain and Portugal against the French in the Peninsular War.\n* 30 June – Chemist Humphry Davy informs the Royal Society of London of his isolation and discovery of two elements by electrolysis. From lime, he has produced calcium and established that lime is calcium oxide; by heating boric acid and potassium in a copper tube, he creates a substance he calls boracium, and which is eventually called boron. This year he also isolates magnesium and strontium.\n* 20 July – Henry Crabb Robinson makes the first despatch from a specialist war reporter, to The Times newspaper.\n* 1 August – Peninsular War: British expeditionary force lands near Porto.\n* 17 August – Peninsular War: Battle of Roliça: A British-Portuguese army under Sir Arthur Wellesley defeats an outnumbered French force.\n* 21 August – Peninsular War: Battle of Vimeiro: British-Portuguese troops under Wellesley defeat the French.\n* 20 September – The original Theatre Royal, Covent Garden in London is destroyed by fire along with most of the scenery, costumes and scripts. Rebuilding begins in December.\nUndated\n* George Ponsonby becomes de facto'' first (whig) Leader of the Opposition in the House of Commons.\n* Society for Promoting the Lancasterian System for the Education of the Poor formed to develop Joseph Lancaster's system of elementary schools for nonconformists. In 1814, the Society is renamed the British and Foreign School Society for the Education of the Labouring and Manufacturing Classes of Society of Every Religious Persuasion.\n* John Dalton begins publication of A New System of Chemical Philosophy, explaining his atomic theory of chemistry.\n* English patents are obtained\n** By Bryan Donkin for a steel nib pen.\n** By John Heathcoat for a bobbinet lace machine.\n* Osmington White Horse cut in Dorset.\nOngoing\n* Anglo-Russian War, 1807–1812\n* Napoleonic Wars, 1803–1815\nBirths\n* 20 March – Charles Henry Cooper, antiquarian (died 1866)\n* 22 March – Caroline Norton, campaigner for married women's rights (died 1877)\n* 27 April – William Cavendish, 7th Duke of Devonshire, politician (died 1891)\n* 2 May – Emma Darwin, née Wedgwood, wife of Charles Darwin (died 1896)\n* 9 May – John Scott Russell, Scottish-born shipbuilder (died 1882)\n* 12 May – Edwin Abbott, educator (died 1882)\n* 30 May – Caroline Chisholm, humanitarian (died 1877)\n* 11 June – James Ballantine, artist and author (died 1877)\n* 12 June – George Wilshere, 1st Baron Bramwell, judge (died 1892)\n* 19 June – Montagu Bertie, 6th Earl of Abingdon, politician (died 1884)\n* 1 July – Henry Doubleday, entomologist and ornithologist (died 1875)\n* 15 July – Henry Cole, civil servant (died 1882)\n* 30 July – Frederick Nicholls Crouch, composer and cellist (died 1896)\n* 19 August – James Nasmyth, engineer (died 1890)\n* 24 August – William Lindsay Alexander, church leader (died 1884)\n* 5 September – Arthur William Buller, Member of Parliament (died 1869)\n* 15 September – John Hutton Balfour, botanist (died 1884)\n* 6 November – Thomas Legh Claughton, academic, poet and clergyman (died 1892)\n* 22 November – Thomas Cook, English travel entrepreneur (died 1892)\n* 28 September – Joseph Thornton, Oxford-based bookseller (died 1891)\n* 15 December – Henry Chorley, critic (died 1872)\n* Undated\n** William Cureton, Orientalist (died 1864)\n** Charles Geach, industrialist, banker and politician (died 1854)\nDeaths\n* 28 May – Richard Hurd, bishop and writer (born 1720)\n* 5 September – John Home, writer (born 1722)\n* 10 November – Guy Carleton, 1st Baron Dorchester, soldier and governor of Quebec (born 1724)\n* Theophilus Lindsey, theologian (born 1723)\nReferences"
    }
  ]
}