{
  "content": [
    {
      "type": "text",
      "text": "# 1809 in the United Kingdom\n\nIreland  Scotland  Wales|label2=Sport|data2=1809 English cricket season}}\nEvents from the year 1809 in the United Kingdom.\nIncumbents\n* Monarch – George III\n* Prime Minister –  William Cavendish-Bentinck, 3rd Duke of Portland (Tory) (until 4 October); Spencer Perceval (Tory) (starting 4 October)\n* Foreign Secretary – George Canning (until 11 October) Henry Bathurst, 3rd Earl Bathurst (until 6 December) Richard Wellesley, 1st Marquess Wellesley (from 6 December)\n* Home Secretary – Lord Liverpool (until 1 November) Richard Ryder (after 1 November)\n* Secretary of War – Robert Stewart, Viscount Castlereagh (until 1 November) Robert Jenkinson, 2nd Earl of Liverpool (after 1 November)\nEvents\nby Abraham Pether, 1809]]\n* 5 January – The Treaty of the Dardanelles between the United Kingdom and the Ottoman Empire is concluded.\n* 16 January – Peninsular War: Battle of Corunna in Galicia (Spain): The British (under General Sir John Moore, who is killed) resist an attempt by the French (under Marshal Soult) to prevent them embarking.\n* 22 January – Royal Navy brig-sloop  (bound for the Peninsular War) is wrecked in a snowstorm on The Manacles reef off The Lizard peninsula in Cornwall with only a drummer boy surviving and the transport Dispatch is wrecked on Black Head nearby with 104 homeward bound soldiers lost and only seven survivors.\n* 24 February – The Theatre Royal, Drury Lane in London is destroyed by fire.\n* 1 March – The literary and political periodical The Quarterly Review is first published by John Murray.\n* 11–15 April – Napoleonic Wars: Battle of the Basque Roads – Royal Navy victory over the French fleet in the mouth of the Charente, although officers on both sides face subsequent courts-martial.\n* 18 April – First running of the 2,000 Guineas Stakes horse race at Newmarket, won by Wizard.\n* 22 April – General Sir Arthur Wellesley arrives at Lisbon on board HMS Surveillante'' to take command of the British troops in Portugal.\n* 10–11 May – Peninsular War: Battle of Grijó: the Anglo-Portuguese Army commanded by Sir Arthur Wellesley defeats the French army commanded by Marshal Soult in Portugal.\n* 12 May – Peninsular War: Second Battle of Porto: the Anglo-Portuguese Army commanded by Wellesley crosses the Douro, drives the French army commanded by Marshal Soult out of Porto and forces them to retreat into Spain.\n* 24 May – Dartmoor Prison opens, to house French prisoners of war.\n* 25 May – Prince Frederick, Duke of York and Albany, the king's second son, is forced to resign as Commander-in-Chief of the Forces following a scandal in which his ex-mistress Mary Anne Clarke admits before the House of Commons to having sold army commissions with his knowledge (first raised in the House on 27 January by Gwyllym Lloyd Wardle). Clarke publishes her memoirs this year.\n* 7 June – Shoja Shah of Afghanistan signs a treaty with the British. Only weeks later, he is succeeded by Mahmud Shah.\n* 19 June – Law passed to prevent blatant sale of seats in the House of Commons to supporters.\n* June – Members of the militia at Ely, Cambridgeshire, mutiny over pay. They are surrounded by a squadron of cavalry from the King's German Legion, a summary court-martial is held and the ringleaders are sentenced to flogging.\n* 26 July–4 August – Court-martial of James, Lord Gambier, at Portsmouth harbour over his conduct at the Battle of the Basque Roads; he is honourably acquitted.\n* 27–28 July – Wellesley's British, Portuguese, and Spanish army defeats a much larger French force at the Battle of Talavera in Spain.\n* 30 July – Walcheren Campaign against the French puppet state of the Kingdom of Holland: The British begin to land a 40,000-strong invasion army on the swampy island of Walcheren at the mouth of the Scheldt.\n* 4 September – Wellesley is appointed Baron Douro and Viscount Wellington in the peerage of the United Kingdom.\n* 18 September – A new Theatre Royal, Covent Garden (pictured) opens in London to replace the first burnt down in 1808. An increase in ticket prices causes the Old Price Riots which last for 64 days.\nLord Castelreagh wounds his cabinet colleague George Canning during the Castlereagh–Canning duel.]]\n* 21 September – Cabinet ministers Viscount Castlereagh (Secretary of State for War and the Colonies) and George Canning (Secretary of State for Foreign Affairs) fight a duel with pistols on Putney Heath over policy in the Walcheren Campaign.\n* 4 October – Portland resigns as Prime Minister due to ill health; Spencer Perceval takes over,\n* 21 October – Nelson's Pillar in Dublin is completed.\n* 25 October – Statue of Horatio Nelson by Richard Westmacott, erected by public subscription, is unveiled in Birmingham, the first statue of Admiral Lord Nelson in the country.\n* 10 November – The Berners Street Hoax: Theodore Hook manages to attract dozens of people to 54 Berners Street in London.\n* 25 November – Benjamin Bathurst, a British diplomat, mysteriously disappears (having possibly been murdered) in Perleberg, west of Berlin.\n* 9 December – Walcheren Campaign: The last British forces withdraw from Vlissingen. The unsuccessful campaign has cost the British 4,000 dead, wounded or captured (but only 106 through combat) and at least 12,000 sick.\nOngoing\n* Napoleonic Wars, 1803–1815\n* Anglo-Russian War, 1807–1812\n* Peninsular War, 1808–1814\nUndated\n* \"Preventive Water Guard\", forerunner of Her Majesty's Coastguard, formed.\n* Jenny Pipes becomes the last woman in England to suffer punishment in the ducking stool for being a common scold, in Leominster.\n* William Combe begins publication of the verse Tour of Dr Syntax in search of the Picturesque in Ackermann's Political Magazine, illustrated by Thomas Rowlandson.\n* Stalybridge Old Band formed, perhaps the first civilian brass band in the world.\n* The seeds that will give rise to the Bramley apple are planted in Southwell, Nottinghamshire.\n* The ambitious Tyburnia estate near Paddington is designed by Samuel Pepys Cockerell, but delays mean much of it is not completed until the Victorian era.\n* John Wilson Croker's poem The Battles of Talavera is published by John Murray, becoming a bestseller\nBirths\n* 18 January – Evan James, lyricist of the Welsh national anthem (died 1878)\n* 12 February – Charles Darwin, naturalist (died 1882)\n* 15 February – Owen Jones, interior designer (died 1874)\n* 31 March – Edward Fitzgerald, poet (died 1883)\n* 7 April – James Glaisher, meteorologist and aeronaut (died 1903)\n* 4 June – John Henry Pratt, clergyman and mathematician (died 1871)\n* 19 June – Richard Monckton Milnes, man of letters and politician (died 1885)\n* 6 August – Alfred Tennyson, poet (died 1892)\n* 27 August – John West, Scottish-born American pioneer of food canning (died 1888)\n* 12 October – John Liptrot Hatton, composer, conductor, pianist and singer (died 1886)\n* 31 October - Edmund Sharpe, architect, architectural historian, railway engineer and sanitary reformer (died 1877)\n* 27 November – Fanny Kemble, British-born American actress and writer (died 1893)\n* 29 December – William Ewart Gladstone, Prime Minister of the United Kingdom (died 1898)\nDeaths\n* 16 January – John Moore, general (killed in battle) (born 1761)\n* 20 February – Richard Gough, antiquary (born 1735)\n* 25 February – John Murray, 4th Earl of Dunmore, Scottish peer, colonial governor in British North America (born 1730)\n* 11 March – Hannah Cowley, dramatist, poet and social reformer (born 1743)\n* 25 March – Anna Seward, novelist (born 1747)\n* 23 April – Charles Francis Greville, antiquary, collector, politician, protector of Emma Hart and founder of Milford Haven (born 1749)\n* 13 May – Beilby Porteus, bishop and abolitionist (born 1731)\n* 21 June – Daniel Lambert, fattest man in Britain, weighing 52 stones 11 pounds, dies in Stamford, Lincolnshire (born 1770)\n* 18 August – Matthew Boulton, manufacturer and engineer (born 1728)\n* 8 October – James Elphinston, philologist (born 1721)\n* 30 October – William Cavendish-Bentinck, 3rd Duke of Portland, Prime Minister of the United Kingdom (born 1738)\n* 9 November – Paul Sandby, cartographer and painter (born 1725)\nReferences"
    }
  ]
}