{
  "content": [
    {
      "type": "text",
      "text": "# 1815 in the United Kingdom\n\nIreland  Scotland  Wales|label2=Sport|data2=1815 English cricket season}}\n]]\nEvents from the year 1815 in the United Kingdom. 1815 marks the end of years of war between the United Kingdom and France when the Duke of Wellington wins a decisive victory over Napoleon at the Battle of Waterloo. Fighting in the War of 1812 between the UK and the United States also ceases, peace terms having been agreed at the end of 1814. The year also sees the introduction of the Corn Laws which protect British land owners from cheaper foreign imports of corn.\nIncumbents\n* Monarch – George III\n* Regent – George, Prince Regent\n* Prime Minister – Robert Jenkinson, 2nd Earl of Liverpool (Tory)\n* Foreign Secretary – Robert Stewart, Viscount Castlereagh\n* Home Secretary – Lord Sidmouth\n* Secretary of War – Lord Bathurst\nEvents\nJanuary to June\nat the end of the Napoleonic Wars in 1815]]\nby George Cruikshank, a caricature of Lord Castlereagh dividing up Europe between the great powers at the Congress of Vienna.]]\n* 2 January\n** Lord Byron marries Anna Isabella Milbanke at Seaham, County Durham.\n** The Prince Regent divides the Order of the Bath into three classes: the Knights Grand Cross, Knights Commander and Companions.\n* 3 January – Austria, Britain and Bourbon-restored France form a secret defensive alliance treaty against Prussia and Russia.\n* 8 January – War of 1812: Battle of New Orleans – American forces under General Andrew Jackson defeat the British in the last major battle of the war.\n* 16 January–15 February – Lieutenant-General Sir John Murray, 8th Baronet, MP, is court-martialed and admonished for his conduct before Tarragona in the Peninsular War; he will be the most senior officer so to appear until 2021.\n* 13 February – The Cambridge Union Society, one of the oldest debating societies in the world, founded at the University of Cambridge.\n* 15 March – Importation Act, first of the Corn Laws, passed by Parliament, preventing the import of cheap foreign grain.\n* 29 March – The Duke of Wellington leaves Vienna, where he has been leading Britain's delegation at the Congress of Vienna, to take command of British and allied army gathering near Brussels\n* 30 May – The East Indiaman Arniston, repatriating wounded troops to Britain from Ceylon, is wrecked near Waenhuiskrans, South Africa with the loss of 372 of the 378 on board.\n* 16 June – Napoleonic Wars: Battle of Quatre Bras – Marshal Ney wins a strategic victory over an Anglo-Dutch force.\n* 18 June – Napoleonic Wars: the Duke of Wellington wins a decisive victory over Napoleon at the Battle of Waterloo.\nin August 1815, by John James Chalon. HMS Bellerophon is at the centre of the picture, surrounded by crowds in small boats who have come to see Napoleon]]\n* 21 June – News of the victory at Waterloo reaches London from Broadstairs late that evening.\nJuly to December\n* 10 July – Apothecaries Act prohibits unlicensed medical practitioners.\n* 15 July – Napoleon boards  off Rochefort and surrenders to Captain Frederick Lewis Maitland of the Royal Navy.\n* 24 July–4 August –  anchors off the south Devon coast with Napoleon on board prior to his being taken into exile.\n* 31 July – The 1815 Philadelphia train accident, a boiler explosion, kills at least 13 people in County Durham.\n* 1 August – William Smith publishes the first national geological map of the UK, A Delineation of the Strata of England and Wales, with part of Scotland''.\n* 18 October – The Bible Christian Church, a Wesleyan Methodist denomination, is founded by William O'Bryan in north Devon and Cornwall.\n* 3 November – Sir Humphry Davy announces his invention of the Davy lamp as a coal mining safety lamp.\n* 5 November – Ionian Islands become a British protectorate.\nUndated\n* Jones, Watts and Doulton begin life as a stoneware pottery in South London.\n* ''Wisden Cricketers' Almanack'' retrospectively recognises statistics for first-class cricket in England from this year.\nPublications\n* Jane Austen's novel Emma (anonymous; 23 December, dated 1816).\n* Lord Byron's poems with musical settings Hebrew Melodies, including \"She Walks in Beauty\"; sells over 10,000 copies in a few months.\n* Thomas Love Peacock's first novel Headlong Hall (anonymous; dated 1816).\n* Walter Scott's novel Guy Mannering (anonymous).\nBirths\n* 24 January  – Thomas Gee, Welsh publisher (died 1898)\n* 12 February – Edward Forbes, naturalist (died 1854)\n* 24 April – Anthony Trollope, English novelist (died 1882)\n* 11 May – Richard Ansdell, English painter and engraver (died 1885)\n* 19 May – Thomas Thornycroft, English sculptor (died 1885)\n* 5 August – Edward John Eyre, English explorer and colonial governor (died 1901)\n* 23 August – Henry Acland, English physician (died 1900)\n* 2 November – George Boole, English-born mathematician and philosopher (died 1864)\n* 10 December – Ada King, Countess of Lovelace, née Byron, early English computer pioneer (died 1852)\n* 30 December – Joseph Toynbee, English otologist (died 1866)\nDeaths\n* 8 January – Sir Edward Pakenham, general (killed in battle) (born 1778)\n* 14 January – William Creech, Scottish publisher and Lord Provost of Edinburgh (born 1745)\n* 15 January – Emma, Lady Hamilton, mistress of Horatio Nelson (born 1765)\n* 24 January – Sir Charles Malet, 1st Baronet, British East India Company official (born 1752)\n* 22 February – Smithson Tennant, chemist (born 1761)\n* 4 March – Frances Abington, actress (born 1737)\n* 7 May – Andrew Fuller, Particular Baptist minister, promoter of missionary work (born 1754)\n* 1 June – James Gillray, caricaturist (born 1757)\n* 18 June – Killed at Battle of Waterloo:\n** Sir Alexander Gordon, staff officer (born 1786)\n** Sir Thomas Picton, general (born 1758)\n** Sir William Ponsonby, general (born 1772)\n* 26 June – William Howe De Lancey, quartermaster-general (mortally wounded at Waterloo) (born 1778)\n* 25 August – Peter William Baker, politician (born 1756)\n* 8 December – Mary Bosanquet Fletcher, Methodist preacher and philanthropist (born 1739)\n* 9 December – Patrick Miller of Dalswinton, banker and steamboat promoter (born 1730)\n* 29 December – Samuel Henley, clergyman, schoolteacher, college principal, antiquarian, writer and poet (born 1740)\nReferences"
    }
  ]
}