{
  "content": [
    {
      "type": "text",
      "text": "# 1816 United States presidential election in Indiana\n\nA presidential election was held in Indiana on November 14, 1816 as part of the 1816 United States presidential election. The Democratic-Republican ticket of the U.S. secretary of state James Monroe and the governor of New York Daniel D. Tompkins received three votes from electors chosen by the Indiana General Assembly. The Federalist Party failed to nominate a candidate. Monroe won the national election handily, defeating the senior U.S. senator from New York Rufus King, who received 34 votes from unpledged electors despite not being a candidate.\nIndiana's right to participate in the election was disputed during the 1817 electoral college vote count. John W. Taylor, the U.S. representative for New York's 11th congressional district, argued that as the resolution recognizing Indiana's admission as the 19th state had not been approved until after the meeting of the electoral colleges, the three votes from Indiana should not be counted. Daniel Cady, the member for New York's 14th congressional district, and William Hendricks, the newly-elected member from Indiana, responded that Indiana's congressional representatives had been seated upon acceptance of the state's constitution, and that Indiana was therefore entitled to participate in the election. Opinion in Congress overwhelmingly favored counting Indiana's votes. On the motion of Samuel D. Ingham, the question was postponed indefinitely, and the count proceeded with Indiana's votes included.\nGeneral election\nResults\n{| class=wikitable\n|+ 1816 United States presidential election in Indiana\n|-\n!colspan=2 style=\"width: 130px\"| Party\n!style=\"width: 17em\"| Candidate\n!style=\"width: 5em\"| Votes\n|-\n|style=\"background-color:#008000; width:5px;\"|\n| Democratic-Republican\n| Jesse Lynch Holman\n|align=right| 37\n|-\n|style=\"background-color:#008000\"|\n| Democratic-Republican\n| Thomas H. Blake\n|align=right| 36\n|-\n|style=\"background-color:#008000\"|\n| Democratic-Republican\n| Joseph Bartholomew\n|align=right| 25\n|-\n!align=right colspan=3|\n!align=right|\n|}\nElectoral college\n{| class=wikitable\n|+ 1816 United States Electoral College vote in Indiana\n!colspan=4| For President\n!colspan=4| For Vice President\n|-\n! Candidate\n! Party\n! Home state\n! Electoralvote\n! Candidate\n! Party\n! Home state\n! Electoralvote\n|-\n| James Monroe\n| Democratic-Republican\n| Virginia\n|align=right| 3\n| Daniel D. Tompkins\n| Democratic-Republican\n| New York\n|align=right| 3\n|-\n!colspan=3|\n!\n!colspan=3|\n!\n|}\nSee also\n* United States presidential elections in Indiana\nNotes\nReferences"
    }
  ]
}