{
  "content": [
    {
      "type": "text",
      "text": "# 1818 in the United Kingdom\n\nIreland  Scotland  Wales|label2=Sport|data2=1818 English cricket season}}\nEvents from the year 1818 in the United Kingdom.\nIncumbents\n* Monarch – George III\n* Regent – George, Prince Regent\n* Prime Minister – Robert Jenkinson, 2nd Earl of Liverpool (Tory)\n* Foreign Secretary – Robert Stewart, Viscount Castlereagh\n* Home Secretary – Lord Sidmouth\n* Secretary of War – Lord Bathurst\nEvents\n'' by Thomas Lawrence. Liverpool led the Tories to victory in the 1818 general election.]]\n* 2 January – The Institution of Civil Engineers is founded at a meeting in London.\n* 6 January – Treaty of Mundosir annexes Indore and the Rajput states to the British East India Company.\n* 3 February – Jeremiah Chubb is granted a patent for the Chubb detector lock.\n* 4 February – The Honours of Scotland are put on display in Edinburgh Castle after being found in store there; Walter Scott has been one of the prime movers in the discovery.\n* 11 February – Marie André Cantillon attempts to assassinate the Duke of Wellington in Paris.\n* 16 April – The Court of King's Bench (England) decides the case of Ashford v Thornton, upholding the right of the defendant, on a private appeal from an acquittal for murder, to trial by battle. Four days later, the plaintiff declines to fight.\n* 18 April – John Ross sets sail from London on the Isabella on an Admiralty expedition to search for the Northwest Passage.\n* 7 May – The king's son Prince Adolphus, Duke of Cambridge, marries Princess Augusta of Hesse-Kassel in Kassel, and again on 1 June at Buckingham Palace, one of three royal marriages this year with a view to ensuring the succession to the crown, as the king now has no surviving legitimate grandchild.\n* 11 May\n** The Old Vic is founded as the Royal Coburg Theatre in South London by James King, Daniel Dunn and John T. Serres.\n** The Westmorland Gazette is first published at Kendal in the Lake District of England; in July, Thomas De Quincey will begin a 16-month term as editor.\n* 29 May – The king's son Prince Edward, Duke of Kent and Strathearn, marries Princess Victoria of Saxe-Coburg-Saalfeld at Schloss Ehrenburg, Coburg, and again on 11 July at Kew Palace, the only one of this year's royal marriages which will ensure the succession to the crown, as the Duke will be the father of Queen Victoria.\n* 30 May – Church Building Act makes available £1 million for the construction of new Anglican \"Commissioners' churches\" to serve the expanding urban population.\n* 3 June – Third Anglo-Maratha War: Baji Rao II, ruler of the Maratha Empire, surrenders to the British East India Company.\n* 17 June – The 1818 general election begins after Prime Minister Lord Liverpool had asked the Regent to dissolve Parliament on 10 June. It is the first election to be held since 1812 and the first since the end of the Napoleonic Wars.\n* 11 July – The king's son Prince William, Duke of Clarence, marries Adelaide of Saxe-Meiningen at Kew Palace. Although William will succeed as king, he leaves no surviving issue from this marriage.\n* 18 July – The general election ends in victory for Liverpool's Tory government over the Whig opposition, though with some seats lost.\n* 23 July – The Crown agrees sale of its rights in the royal forest of Exmoor. Thomas Dyke Acland secures a herd of Exmoor ponies, the nucleus of the modern breed.\n* 25 September – Dr James Blundell carries out the first blood transfusion using human blood, in London.\n* 1 October – The Congress of Aix-la-Chapelle commences with Britain represented by Lord Castlereagh, the Duke of Wellington and Lord Stewart.\n* 20 October – The Treaty of 1818 between the United States and the United Kingdom establishes the northern boundary of the former as the forty-ninth parallel from the Lake of the Woods to the Rocky Mountains, also creating the Northwest Angle.\n* 15 November − At the Congress of Aix-la-Chapelle Britain becomes a member of the Quintuple Alliance while also signing a secret protocol to continue the Quadruple Alliance (1815).\n* 30 November – The Allied Occupation of France ends with the last British troops under the command of the Duke of Wellington being withdrawn.\n* Undated – Besses o' th' Barn brass band is formed at Whitefield in the Manchester cotton district.\nPublications\n* Jane Austen's novels Northanger Abbey and Persuasion (posthumous; actually issued in December 1817).\n* John Evelyn's Diary (posthumous).\n* John Keats' poem Endymion (4 vols.)\n* Thomas Love Peacock's novel Nightmare Abbey (anonymous).\n* Walter Scott's novel The Heart of Midlothian (as by 'Jedediah Cleishbotham').\n* Thomas Bowdler's expurgated The Family Shakspeare, 2nd edition.\n* Mary Shelley's novel Frankenstein (anonymous).\n* Percy Bysshe Shelley's poems \"Ozymandias\" (published as by 'Glirastes' in The Examiner 11 January) and The Revolt of Islam (actually issued in December 1817).\n* Mary Martha Sherwood's children's novel The History of the Fairchild Family (vol. 1; anonymous).\nBirths\n* 2 January – Priscilla Horton, contralto, dancer and actress-manager (died 1895)\n* 18 January – George Palmer, biscuit manufacturer (died 1897)\n* 24 January – John Mason Neale, Anglican priest, scholar and hymnwriter (died 1866)\n* 28 January – Alfred Stevens, sculptor (died 1875)\n* 14 February – Emperor Norton, eccentric (died 1880 in the United States)\n* 21 February – George Wilson, chemist (died 1859)\n* 10 March – William Menelaus, mechanical engineer (died 1882)\n* 22 March – John Ainsworth Horrocks, explorer of South Australia (died 1846)\n* 19 April – Sir Arthur Elton, 7th Baronet, Liberal politician and writer (died 1883)\n* 23 April – James Anthony Froude, religious controversialist and historian (died 1894)\n* 1 May – Lyon Playfair, chemist and Liberal politician (died 1898)\n* 11 June – Alexander Bain, philosopher and educationalist (died 1903)\n* 20 June – Eugenius Birch, civil engineer specialising in seaside pleasure piers (died 1884)\n* 21 June – Richard Wallace, francophile art collector and philanthropist (died 1890)\n* 11 July – William Edward Forster, Liberal politician (died 1886)\n* 22 July – Thomas Stevenson, lighthouse designer and meteorologist (died 1887)\n* 30 July – Emily Brontë, novelist and poet (died 1848)\n* 3 October – Alexander Macmillan, publisher (died 1896)\n* 7 December – John Blackwood, publisher (died 1879)\n* 24 December\n** Eliza Cook, writer, poet and radical campaigner (died 1889)\n** James Prescott Joule, physicist (died 1889)\nDeaths\n]]\n* 6 March – John Gifford, loyalist political writer (born 1758)\n* 24 March – Humphry Repton, garden designer (born 1752)\n* 14 or 16 May – Matthew \"Monk\" Lewis, Gothic writer (born 1775)\n* 11 August – Robert Carr Brackenbury, Methodist preacher (born 1752)\n* 22 August – Warren Hastings, Governor-General of India (born 1732)\n* 1 September – Robert Calder, admiral (born 1745)\n* 9 September – Seymour Fleming, noblewoman of scandalous reputation, in France (born 1758)\n* 17 November – Charlotte of Mecklenburg-Strelitz, Queen consort of the United Kingdom, wife of George III (born 1744)\nReferences"
    }
  ]
}