{
  "content": [
    {
      "type": "text",
      "text": "# 1832 United States presidential election__disambig_1\n\n| needed_votes = 145 electoral\n| turnout = 57.0%  0.3 pp\n| election_date = November 2 – December 5, 1832\n| image1 =\n| nominee1 = Andrew Jackson\n| party1 = Democratic Party (United States)\n| home_state1 = Tennessee\n| running_mate1 = Martin Van Buren\n| electoral_vote1 = 219\n| states_carried1 = 16\n| popular_vote1 = 701,780\n| percentage1 = 54.2%\n| image2 =\n| nominee2 = Henry Clay\n| party2 = National Republican Party\n| home_state2 = Kentucky\n| running_mate2 = John Sergeant\n| electoral_vote2 = 49\n| states_carried2 = 6\n| popular_vote2 = 484,205\n| percentage2 = 37.4%\n| image4 =\n| nominee4 = John Floyd\n| party4 = Nullifier Party\n| home_state4 = Virginia\n| running_mate4 = Henry Lee\n| electoral_vote4 = 11\n| states_carried4 = 1\n| popular_vote4 = N/A\n| percentage4 = N/A\n| image5 =\n| nominee5 = William Wirt\n| party5 = Anti-Masonic Party\n| home_state5 = Maryland\n| running_mate5 = Amos Ellmaker\n| electoral_vote5 = 7\n| states_carried5 = 1\n| popular_vote5 = 100,715\n| percentage5 = 7.8%\n| map_size = 350px\n| map =\n| map_caption = Presidential election results map. Blue denotes states won by Jackson and Van Buren or Wilkins, Astra denotes those won by Clay/Sergeant, Turquoise denotes those won by Floyd/Lee, and Gold denotes those won by Wirt/Ellmaker. Numbers indicate the number of electoral votes allotted to each state. Two votes were not given in Maryland.\n| title = President\n| before_election = Andrew Jackson\n| before_party = Democratic Party (United States)\n| after_election = Andrew Jackson\n| after_party = Democratic Party (United States)\n}}\nPresidential elections were held in the United States from November 2 to December 5, 1832. Incumbent president Andrew Jackson, candidate of the Democratic Party, defeated Henry Clay, candidate of the National Republican Party.\nThe election saw the first use of the presidential nominating conventions, and the Democrats, National Republicans, and the Anti-Masonic Party all used conventions to select their candidates. Jackson won renomination with no opposition, and the 1832 Democratic National Convention replaced Vice President John C. Calhoun with Martin Van Buren. The National Republican Convention nominated a ticket led by Clay, a Kentuckian who had served as Secretary of State under President John Quincy Adams. The Anti-Masonic Party, one of the first major U.S. third parties, nominated former Attorney General William Wirt.\nJackson faced heavy criticism for his actions in the Bank War, but remained popular among the general public. He won a majority of the popular vote and 219 of the 288 electoral votes, carrying most states outside New England. Clay won 37.4% of the popular vote and 49 electoral votes, while Wirt won 7.8% of the popular vote and carried the state of Vermont. Though he had not actively campaigned, Virginia Governor John Floyd received the electoral votes of South Carolina, which remained the only state where presidential electors were appointed at the discretion of the state legislature rather than by popular vote (and would continue to be in every presidential election through 1860). After the election, members of the National Republican Party and the Anti-Masonic Party formed the Whig Party, which became the Democrats' primary opponent over the next two decades.\nNominations\nWith the demise of the congressional nominating caucus in the election of 1824, the political system was left without an institutional method on the national level for determining presidential nominations. For this reason, the candidates of 1832 were chosen by national conventions. The first national convention was held by the Anti-Masonic Party in Baltimore, Maryland, in September 1831. The National Republican Party and the Democratic Party soon imitated them, also holding conventions in Baltimore, which would remain a favored venue for national political conventions for decades.\nDemocratic Party\n{| class=\"wikitable\" style=\"font-size:90%; text-align:center;\"\n|-\n| style=\"background:#f1f1f1;\" colspan=\"30\"|1832 Democratic Party ticket\n|-\n! style=\"width:3em; font-size:135%; background:#3333FF; width:200px;\"|\n! style=\"width:3em; font-size:135%; background:#3333FF; width:200px;\"|\n|-\n| style=\"width:3em; font-size:100%; color:#000; background:#C8EBFF; width:200px;\"|for President\n| style=\"width:3em; font-size:100%; color:#000; background:#C8EBFF; width:200px;\"|for Vice President\n|-\n|\n|\n|-\n| 7thPresident of the United States(1829–1837)\n| 13th\nU.S. Minister to Great Britain(1831–1832)\n|-\n|}\nPresident Jackson and Vice President Calhoun had a strained relationship for a number of reasons, most notably a difference in opinion about the Nullification Crisis and the involvement of Calhoun's wife Floride in the Eaton affair. As a result, Secretary of State Martin Van Buren and Secretary of War John H. Eaton resigned from office in April 1831, and Jackson requested the resignation of all other cabinet officers except one. Van Buren instigated the procedure as a means of removing Calhoun supporters from the Cabinet. Calhoun further aggravated Jackson in the summer of 1831 when he issued his \"Fort Hill Letter,\" in which he outlined the constitutional basis for a state's ability to nullify an act of Congress. The final blow to the Jackson-Calhoun relationship came when Jackson nominated Van Buren to serve as Minister to Great Britain and the vote in the Senate ended in a tie, which Calhoun broke by voting against confirmation on January 25, 1832.\nIn January it was not clear who the Democrats' candidates would be in the election later that year. Jackson had already been nominated by several state legislatures, following the pattern in 1824 and 1828, but he worried that the various state parties would not unite on a vice-presidential nominee. As a result, the Democratic Party followed the pattern of the opposition and called a national convention.\n{| align=left cellspacing=10\n|\n{| class=\"wikitable\" style=\"text-align:right\"\n|+ Convention vote\n|-\n! colspan=2 | President\n! colspan=2 | Vice President\n|-\n| align=left | Andrew Jackson\n| 283\n| align=left | Martin Van Buren\n| 208\n|-\n| colspan=2 | &nbsp;\n| align=left | Philip P. Barbour\n| 49\n|-\n| colspan=2 | &nbsp;\n| align=left | Richard M. Johnson\n| 26\n|}\n|}\nThe 1832 Democratic National Convention, the Democratic Party's first, was held in the Athenaeum in Baltimore (the same venue as the two opposition parties) from May 21 to May 23, 1832. Several decisions were made at the convention. On the first day, a committee was appointed to provide a list of delegates from each state. This committee, later called the Credentials Committee, reported that all states were represented. Delegates were present from the District of Columbia, and on the first contested roll call vote in convention history, the convention voted 126–153 to deprive the District of Columbia of its voting rights in the convention. The Rules Committee gave a brief report that established several other customs. Each state was allotted as many votes as it had presidential electors; several states were overrepresented and many were underrepresented. Second, balloting was taken by states and not by individual delegates. Third, two-thirds of the delegates would have to support a candidate for nomination, a measure intended to reduce sectional strife. The fourth rule, which banned nomination speeches, was the only one the party quickly abandoned.\nNo roll call vote was taken to nominate Jackson for a second term. Instead, the convention passed a resolution stating that \"we most cordially concur in the repeated nominations which he has received in various parts of the union.\" Martin Van Buren was nominated for vice president on the first ballot, receiving 208 votes to 49 for Philip P. Barbour and 26 for Richard Mentor Johnson. Afterward, the convention approved an address to the nation and adjourned.\nBarbour Democrats\nVirginia Democrats opposed to Van Buren's candidacy held a convention in June 1832 in Staunton, Virginia. Jackson was nominated for president and Philip P. Barbour for vice president. Barbour withdrew, but the ticket appeared on the ballot in Alabama, Georgia, Mississippi, North Carolina, and Virginia. Barbour's supporters in Alabama, North Carolina, and South Carolina also organized tickets.\nNational Republican Party\n{| class=\"wikitable\" style=\"font-size:90%; text-align:center;\"\n|-\n| style=\"background:#f1f1f1;\" colspan=\"30\"|1832 National Republican ticket\n|-\n! style=\"width:3em; font-size:135%; background:#F0DC82; width:200px;\"|\n! style=\"width:3em; font-size:135%; background:#F0DC82; width:200px;\"|\n|- style=\"color:#000000; font-size:100%; background:#F0DC82;\"\n| style=\"width:3em; font-size:100%; color:#000; background:lightyellow; width:200px;\"|for President\n| style=\"width:3em; font-size:100%; color:#000; background:lightyellow; width:200px;\"|for Vice President\n|-\n|\n|\n|-\n| U.S. Senatorfrom Kentucky(1806–1807, 1810–1811, & 1831–1842)\n| U.S. Representativefor Pennsylvania's 2nd(1827–1829)\n|-\n|}\nSoon after the Anti-Masonic Party held its national convention, supporters of Henry Clay called a national convention of the National Republican Party. 18 of the 24 states sent delegations to the convention, which convened on December 12, 1831. The convention was attended by 168 delegates from eighteen states although one-fourth of the delegates were late due to winter weather.\nOn the convention's fourth day, the roll call ballot for president took place. The chairman of the convention called the name of each delegate, who gave his vote orally. Clay received 155 votes, with delegate Frederick H. Shuman of North Carolina abstaining because he believed that Clay could not win and should wait until 1836. As additional delegates arrived, they were allowed to cast their votes for Clay, and by the end of the convention he had 167 votes to one abstention. A similar procedure was used for the vice-presidential ballot. Former Congressman John Sergeant of Pennsylvania was nominated with 64 votes to six abstentions. A prominent Philadelphia attorney with connections to the Second Bank of the United States and a reputation as an opponent of slavery, Sergeant gave the ticket geographical balance.\n{| class=\"wikitable\" style=\"text-align:right\"\n|+ Convention vote\n|-\n! colspan=2 | President\n! colspan=2 | Vice President\n|-\n| align=left | Henry Clay\n| 167\n| align=left | John Sergeant\n| 162\n|-\n| Abstaining\n| 1\n| Abstaining\n| 6\n|}\nAnti-Masonic Party\n{| class=\"wikitable\" style=\"font-size:90%; text-align:center;\"\n|-\n| style=\"background:#f1f1f1;\" colspan=\"30\"|1832 Anti-Masonic Party ticket\n|-\n! style=\"width:3em; font-size:135%; background:#FF7F50; width:200px;\"|\n! style=\"width:3em; font-size:135%; background:#FF7F50; width:200px;\"|\n|- style=\"color:#000000; font-size:100%; background:#F0DC82;\"\n| style=\"width:3em; font-size:100%; color:#000; background:#FFDAB9; width:200px;\"|for President\n| style=\"width:3em; font-size:100%; color:#000; background:#FFDAB9; width:200px;\"|for Vice President\n|-\n|\n|\n|-\n| 9thU.S. Attorney General(1817–1829)\n| 12thAttorney General of Pennsylvania(1816–1819, 1828–1829)\n|-\n|}\n\", an Anti-Jacksonian poster shows Andrew Jackson as a monarch trampling the Constitution, the federal judiciary, and the Bank of the United States]]\nThe first national nominating convention for a presidential candidate in American history was held by the Anti-Masonic Party in Baltimore, Maryland from September 26–28, 1831. The convention was attended by 116 delegates from thirteen states with Maryland being the furthest state in the South represented. The leaders of the party attempted to give the presidential nomination to Clay and Supreme Court Justice John McLean, but both declined.\nSeveral prominent politicians were considered for the presidential nomination. Richard Rush would have been the nominee, but pointedly refused. As a result of this action, along with his softness toward Jackson, former President John Quincy Adams never forgave him. Adams was willing to run as the Anti-Masonic candidate, but the party leaders did not want to risk running someone so unpopular.\nThe delegates met behind closed doors for several days before the convention officially opened, making some initial decisions. Several unofficial presidential ballots and one official ballot were taken, in which William Wirt defeated Rush and John McLean for the nomination. Ironically, Wirt was a Mason and even defended the Order in a speech before the convention that nominated him. Wirt hoped for an endorsement from the National Republicans. When the National Republican Party nominated Henry Clay, Wirt's position became awkward. He did not withdraw, even though he had no chance of being elected.\nThe convention was organized on September 26 and heard reports of its committees on the 27th. The 28th was spent on the official roll call for president and vice president. During the balloting, each delegate's name was called, after which that delegate placed a written ballot in a special box. Wirt was nominated for president with 108 votes to one for Rush and two abstentions. Amos Ellmaker was nominated for vice president with 108 votes to one for John C. Spencer (chairman of the convention) and two abstentions.\n{| class=\"wikitable\" style=\"text-align:right\"\n|+ Convention vote\n|-\n! colspan=2 | President\n! colspan=2 | Vice President\n|-\n| align=left | William Wirt\n| 108\n| align=left | Amos Ellmaker\n| 108\n|-\n| align=left | Richard Rush\n| 1\n| align=left | John C. Spencer\n| 1\n|-\n| Abstaining\n| 2\n| Abstaining\n| 1\n|}\nNullifier Party\nWhile the South Carolina state legislature remained nominally under Democratic control, it refused to support Jackson's reelection due to the ongoing Nullification Crisis, and instead opted to back a ticket proposed by the Nullifier Party led by John C. Calhoun. The Nullifiers were made up of former members of the Democratic-Republican Party who had largely supported Jackson at the previous election, but were much stauncher proponents of states' rights, which ultimately led them to repudiate Jackson during his first term. Calhoun himself declined to head the ticket, instead nominating Governor of Virginia John Floyd, who also opposed Jackson's stance on states' rights. Merchant and economist Henry Lee was nominated as Floyd's running mate.\nUltimately, Floyd's candidacy amounted to little more than a protest against Jackson, as his ticket did not run in any state outside of South Carolina. He nonetheless received all the state's electoral votes.\nGeneral election\nCampaign\nJackson rode into office in 1828 on the strength of a coalition that included southern opponents of the Tariff of 1828, western advocates of internal improvements, many former Democratic-Republicans, and some former Federalists. Henry Clay predicted this unwieldy marriage of disparate and in many cases hostile interests would soon collapse under the pressures of office. Clay determined to split the Jacksonian party on the issue of the American System by engineering a confrontation over the Second Bank of the United States. He persuaded the president of the bank, Nicholas Biddle, to request recharter a full four years early in order to coincide with the presidential election. As expected, Jackson vetoed the recharter bill and issued a stinging veto message criticizing the bank's interference in national politics. Clay predicted the president's hostility to the nationalist economic program would prove unpopular with voters, particularly in Pennsylvania where the bank was headquartered, and hand the Anti-Jacksonians victory at the polls.\nSimultaneously, Jackson faced defections from the southern wing of his party over the Nullification Crisis. These southerners objected strongly to the tariff and argued for the right of the states to nullify unfriendly federal laws, a position Jackson refused to endorse. Clay hoped to bring the disgruntled ex-Jacksonians into the fold, but his tactic of promoting the American System as the major issue of the campaign was ill-designed for this purpose. While some Southerners did favor the bank, they were unwilling to break publicly with Jackson on this issue, and Vice President Calhoun was overtly hostile to the American System by 1832. In South Carolina, the faction loyal to Calhoun nominated a slate of independent electors who voted for Governor John Floyd of Virginia. Elsewhere, dissident Southern Jacksonians protested the nomination of Martin Van Buren by supporting Philip P. Barbour for vice president but were unwilling to break with Jackson himself. As the Barbour movement suggests, Jackson's personal popularity worked against the growth of opposition politics in the South despite the growing dissatisfaction with the national administration.\nMeanwhile, Jackson's northern opponents were hurt by the divided state of the opposition. The failure of Anti-Jacksonians to unite behind a single candidate for president alarmed leaders like William Henry Seward and Thurlow Weed, who worked feverishly to avoid a disastrous split in the opposition vote. In New York, Ohio, and Pennsylvania, Anti-Masons and National Republicans organized fusion tickets with electors pledged to support whichever candidate stood the best chance of defeating Jackson in the electoral college. Jackson carried all three states, however, along with their combined 93 electoral votes. His margin in Pennsylvania was much reduced from 1828, but still wider than the Democratic majority in the gubernatorial election held in October, due largely to the drop in support for the Anti-Masons. The Anti-Jacksonian \"Union ticket\" foreshadowed the merger of both parties with disaffected Southern Jacksonians in 1834 to form the Whig Party, which would constitute the major opposition to the Jacksonian Democrats for the remainder of the Second Party System.\nWhile Clay hoped to alienate the different wings of the Democratic Party from each other by promoting the bank as an issue, his strategy backfired, as Jackson's veto message compellingly portrayed him as the defender of the common people against the furious assault of the financial interests. Events of the previous decade had not endeared the bank to working people, and they identified with Jackson's portrait of the \"Monster Bank\" as corrupt, self-interested, and destructive to democratic egalitarianism. Meanwhile, Clay's high-handed treatment of the Anti-Masons discouraged unity among Anti-Jacksonians, and the unpopularity of the National Republicans frustrated efforts to unite all opponents of the administration under a single roof.\nResults\n20.6% of the voting age population and 56.7% of eligible voters participated in the election. Jackson won the election in an electoral college landslide. Jackson received 219 electoral votes, defeating Clay (49), Floyd (11), and Wirt (7) by a large margin.\nJackson's popularity with the American public and the vitality of the political movement with which he was associated is confirmed by the fact that no president was again able to secure a majority of the popular vote in two consecutive elections until Ulysses S. Grant in 1872. Only two other presidents from the Democratic party were ever able to replicate this feat: Franklin D. Roosevelt (for the first time in 1936) and Barack Obama (in 2012). Furthermore, no president succeeded in securing re-election again until Abraham Lincoln in 1864, and no Democrat would secure a second consecutive term until Woodrow Wilson in 1916.\nAs of 2024, Jackson was the second of eight presidential nominees to win a significant number of electoral votes in at least three elections, the others being Thomas Jefferson, Henry Clay, Grover Cleveland, William Jennings Bryan, Franklin D. Roosevelt, Richard Nixon, and Donald Trump. Of these, Jackson, Cleveland, and Roosevelt, also won the popular vote in at least three elections.\nJackson was the second of only five presidents to win re-election with a smaller percentage of the popular vote than in prior elections, the other four are James Madison in 1812, Grover Cleveland in 1892, Franklin Roosevelt in 1940 and 1944 and Barack Obama in 2012.\nFollowing the election and Clay's defeat, an Anti-Jackson coalition would be formed out of National Republicans, Anti-Masons, disaffected Jacksonians, and small remnants of the Federalist Party whose last political activity was with them a decade before. In the short term, it formed the Whig Party in a coalition against President Jackson and his reforms.\n|ev_footnote=(d)}}\n(a) The popular vote figures exclude South Carolina where the Electors were chosen by the state legislature rather than by popular vote.\n(b) 66,706 Pennsylvanians voted for the Union slate, which represented both Clay and Wirt. These voters have been assigned to Wirt and not Clay.\n(c) ''All of John Floyd's electoral votes came from South Carolina where the Electors were chosen by the state legislatures rather than by popular vote.\n(d) Two electors from Maryland for Clay failed to cast votes.''\n|54.23}}\n|37.42}}\n|7.78}}\n}}\n|76.57}}\n|17.13}}\n|3.85}}\n|2.45}}\n}}\nResults by state\nThe 1832 presidential election results are displayed in the maps below.\n1832 Electoral Map.png|Results by state\n1832 United States presidential election results map by county.svg|Results by county, shaded according to winning candidate's percentage of the vote\n{|class=\"wikitable\"\n|-\n|States/districts won by Jackson/Van Buren\n|-\n|States/districts won by Clay/Sergeant\n|-\n|States/districts won by Wirt/Ellmaker\n|--\n|States/districts won by Floyd/Lee\n|}\n{| class=\"wikitable sortable\" style=\"text-align:right\"\n|-\n! colspan=2 |\n! align=center colspan=3 | Andrew JacksonDemocratic\n! align=center colspan=3 | Henry ClayNational Republican\n! align=center colspan=3 | William WirtAnti-Masonic\n! align=center colspan=3 | John FloydNullifier\n! colspan=\"2\" |Margin\n! align=center colspan=2 | State Total\n|-\n! align=center | State\n! style=\"text-align:center; font-size: 60%\" | electoralvotes\n! align=center | #\n! align=center | %\n! style=\"text-align:center; font-size: 60%\" | electoralvotes\n! align=center | #\n! align=center | %\n! style=\"text-align:center; font-size: 60%\" | electoralvotes\n! align=center | #\n! align=center | %\n! style=\"text-align:center; font-size: 60%\" | electoralvotes\n! align=center | #\n! align=center | %\n! style=\"text-align:center; font-size: 60%\" | electoralvotes\n! align=center | #\n! align=center | %\n! align=center | #\n!\n|-\n! style\"text-align:left\" | Alabama\n! 7\n| 0001361814,286\n| 99.97\n| 7\n| 000486695\n| 0.03\n| -\n| colspan=3 align=center | no ballots\n| colspan=3 align=center | no ballots\n|14,281\n|99.94\n| 14,291\n! AL\n|-\n! style\"text-align:left\" | Connecticut\n! 8\n| 11,269\n| 34.32\n| -\n| 18,155\n| 55.29\n| 8\n| 3,409\n| 10.38\n| -\n| colspan=3 align=center | no ballots\n| -6,886\n| -20.97\n| 32,833\n! CT\n|-\n! style\"text-align:left\" | Delaware\n! 3\n| 4,110\n| 49.01\n| -\n| 4,276\n| 50.99\n| 3\n| colspan=3 align=center | no ballots\n| colspan=3 align=center | no ballots\n| -166\n| -1.98\n| 8,386\n! DE\n|-\n! style\"text-align:left\" | Georgia\n! 11\n| 20,750\n| 100\n| 11\n| colspan=3 align=center | no ballots\n| colspan=3 align=center | no ballots\n| colspan=3 align=center | no ballots\n|20,750\n|100.00\n| 20,750\n! GA\n|-\n! style\"text-align:left\" | Illinois\n! 5\n| 14,609\n| 68.01\n| 5\n| 6,745\n| 31.40\n| -\n| 97\n| 0.45\n| -\n| colspan=3 align=center | no ballots\n|7,864\n|36.61\n| 21,481\n! IL\n|-\n! style\"text-align:left\" | Indiana\n! 9\n| 31,551\n| 67.10\n| 9\n| 15,472\n| 32.90\n| -\n| colspan=3 align=center | no ballots\n| colspan=3 align=center | no ballots\n|16,079\n|34.20\n| 47,023\n! IN\n|-\n! style\"text-align:left\" | Kentucky\n! 15\n| 36,292\n| 45.51\n| -\n| 43,449\n| 54.49\n| 15\n| colspan=3 align=center | no ballots\n| colspan=3 align=center | no ballots\n| -36,249\n| -8.98\n| 79,741\n! KY\n|-\n! style\"text-align:left\" | Louisiana\n! 5\n| 3,908\n| 61.67\n| 5\n| 2,429\n| 38.33\n| -\n| colspan=3 align=center | no ballots\n| colspan=3 align=center | no ballots\n|1,479\n|23.34\n| 6,337\n! LA\n|-\n! style\"text-align:left\" | Maine\n! 10\n| 33,978\n| 54.67\n| 10\n| 27,331\n| 43.97\n| -\n| 844\n| 1.36\n| -\n| colspan=3 align=center | no ballots\n|6,647\n|10.70\n| 62,153\n! ME\n|-\n! style\"text-align:left\" | Maryland-1\n! 4\n| 5,097\n| 37.60\n| -\n| 8,458\n| 62.40\n| 2\n| colspan=3 align=center | no ballots\n| colspan=3 align=center | no ballots\n| -3,361\n| -24.79\n| 13,555\n! MD1\n|-\n! style\"text-align:left\" | Maryland-2\n! 2\n| 5,025\n| 54.19\n| 2\n| 4,248\n| 45.81\n| -\n| colspan=3 align=center | no ballots\n| colspan=3 align=center | no ballots\n|777\n|8.38\n|9,273\n! MD2\n|-\n! style\"text-align:left\" | Maryland-3\n! 1\n| 2,900\n| 100\n| 1\n| colspan=3 align=center | no ballots\n| colspan=3 align=center | no ballots\n| colspan=3 align=center | no ballots\n|2900\n|100\n|2900\n! MD3\n|-\n! style\"text-align:left\" | Maryland-4\n! 3\n| 6,129\n| 41.70\n| -\n| 6,454\n| 51.29\n| 3\n| colspan=3 align=center | no ballots\n| colspan=3 align=center | no ballots\n| -325\n| -2.58\n| 12,583\n! MD4\n|-\n! style\"text-align:left\" | Massachusetts\n! 14\n| 13,933\n| 20.61\n| -\n| 31,963\n| 47.27\n| 14\n| 14,692\n| 21.73\n| -\n| colspan=3 align=center | no ballots\n| -10,737\n| -25.54\n| 67,619\n! MA\n|-\n! style\"text-align:left\" | Mississippi\n! 4\n| 5,750\n| 100\n| 4\n| colspan=3 align=center | no ballots\n| colspan=3 align=center | no ballots\n| colspan=3 align=center | no ballots\n|5,750\n|100.00\n| 5,750\n! MS\n|-\n! style\"text-align:left\" | Missouri\n! 4\n| 8,904\n| 65.16\n| 4\n| 4,760\n| 34.84\n| 0\n| colspan=3 align=center | no ballots\n| colspan=3 align=center | no ballots\n|5,192\n|30.32\n| 5,192\n! MO\n|-\n! style\"text-align:left\" | New Hampshire\n! 7\n| 24,855\n| 56.67\n| 7\n| 18,938\n| 43.24\n| -\n| colspan=3 align=center | no ballots\n| colspan=3 align=center | no ballots\n|5,917\n|13.43\n| 43,793\n! NH\n|-\n! style\"text-align:left\" | New Jersey\n! 8\n| 23,826\n| 49.89\n| 8\n| 23,466\n| 49.13\n| -\n| 468\n| 0.98\n| -\n| colspan=3 align=center | no ballots\n|360\n|0.76\n| 47,760\n! NJ\n|-\n! style\"text-align:left\" | New York\n! 42\n| 168,497\n| 52.10\n| 42\n| 154,896\n| 47.90\n| -\n| colspan=3 align=center | no ballots\n| colspan=3 align=center | no ballots\n|13,601\n|4.20\n| 323,393\n! NY\n|-\n! style\"text-align:left\" | North Carolina\n! 15\n| 25,261\n| 84.77\n| 15\n| 4,538\n| 15.23\n| -\n| colspan=3 align=center | no ballots\n| colspan=3 align=center | no ballots\n|20,723\n|69.54\n| 29,799\n! NC\n|-\n! style\"text-align:left\" | Ohio\n! 21\n| 81,246\n| 51.33\n| 21\n| 76,539\n| 48.35\n| -\n| 509\n| 0.32\n| -\n| colspan=3 align=center | no ballots\n|4,707\n|2.98\n| 158,294\n! OH\n|-\n! style\"text-align:left\" | Pennsylvania\n! 30\n| 91,949\n| 57.96\n| 30\n| colspan=3 align=center | no ballots\n| 66,689\n| 42.04\n| -\n| colspan=3 align=center | no ballots\n|25,260\n|15.92\n| 158,638\n! PA\n|-\n! style\"text-align:left\" | Rhode Island\n! 4\n| 2,126\n| 43.07\n| -\n| 2,810\n| 56.93\n| 4\n| colspan=3 align=center | no ballots\n| colspan=3 align=center | no ballots\n| -684\n| -13.86\n| 4,936\n! RI\n|-\n! style\"text-align:left\" | South Carolina\n! 11\n| colspan=3 align=center | no popular vote\n| colspan=3 align=center | no popular vote\n| colspan=3 align=center | no popular vote\n| colspan=2 align=center | no popular vote\n| 11\n| -\n| -\n| -\n! SC\n|-\n! style\"text-align:left\" | Tennessee\n! 15\n| 28,078\n| 95.42\n| 15\n| 1,347\n| 4.58\n| -\n| colspan=3 align=center | no ballots\n| colspan=3 align=center | no ballots\n|26,731\n|90.84\n| 29,425\n! TN\n|-\n! style\"text-align:left\" | Vermont\n! 7\n| 7,870\n| 24.50\n| -\n| 11,152\n| 34.71\n| -\n| 13,106\n| 40.79\n| 7\n| colspan=3 align=center | no ballots\n| -5,236\n| -6.08\n| 32,128\n! VT\n|-\n! style\"text-align:left\" | Virginia\n! 23\n| 34,243\n| 74.96\n| 23\n| 11,436\n| 25.03\n| -\n| 3\n| 0.01\n| -\n| colspan=3 align=center | no ballots\n|22,807\n|49.92\n| 45,682\n! VA\n|-\n! TOTALS:\n! 288\n! 702,735\n! 54.74\n! 219\n! 474,107\n! 36.93\n! 49\n! 99,817\n! 7.78\n! 7\n! -\n! -\n! 11\n! 228,628\n! 17.81\n! 1,276,659\n! US\n|-\n! TO WIN:\n! 145\n! colspan=\"17\" |\n|}\nStates that flipped from National Republican to Democratic\n* Maine\n* New Hampshire\n* New Jersey\nStates that flipped from Democratic to National Republican\n* Kentucky\nStates that flipped from National Republican to Anti-Masonic\n* Vermont\nStates that flipped from Democratic to Nullifier\n* South Carolina\nClose states\nStates where the margin of victory was under 1%:\n#New Jersey 0.76% (360 votes)\nStates where the margin of victory was under 5%:\n#Delaware 1.98% (166 votes)\n#'''Maryland's 4th District 2.58% (325 votes)\n#Ohio 2.98% (4,707 votes)\n#New York 4.20% (13,601 votes)\nStates where the margin of victory was under 10%:\n#Vermont 6.08% (5,236 votes)\n#Maryland's 2nd District 8.38% (777 votes)\n#Kentucky 8.98% (36,249 votes)\nTipping point states:\n#Maine 10.70% (6,647 votes) (tipping point state for a Jackson victory)\n#Pennsylvania 15.90% (25,260 votes)' (tipping point state for a Clay victory)\nElectoral College selection\n}}\nSee also\n* Second inauguration of Andrew Jackson\n* History of the United States (1789–1849)\n* 1832–1833 United States House of Representatives elections\n* 1832–1833 United States Senate elections\nNotes\nReferences\nBibliography\n*\n* Belko, William S. \"Toward the Second American Party System: Southern Jacksonians, the Election of 1832, and the Rise of the Democratic Party.\" Ohio Valley History 14.1 (2014): 28–50. [https://muse.jhu.edu/article/571708/summary online]\n* Cheathem, Mark R. [https://jhupbooks.press.jhu.edu/title/coming-democracy The Coming of Democracy: Presidential Campaigning in the Age of Jackson] (2018)\n* Cole, Donald B. \"The Presidential Election of 1832 in New Hampshire.\" Historical New Hampshire'' 21#1 (1966) pp: 32–50.\n* Eriksson, Erik McKinley. \"Official Newspaper Organs and Jackson's Re-election, 1832.\" Tennessee Historical Magazine 9.1 (1925): 37-58 [https://www.jstor.org/stable/42638001 online].\n* Folsom, Burton W. \"Party Formation and Development in Jacksonian America: The Old South.\" Journal of American Studies 7#3 (1973): 217–229.\n* Gammon, Samuel Rhea.  The Presidential Campaign of 1832 (Johns Hopkins Press, 1922) [https://archive.org/details/prescampaign00gammrich/page/n3/mode/2up  online]\n* Holt, Michael F. The Rise and Fall of the American Whig Party: Jacksonian Politics and the Onset of the Civil War (Oxford University Press, 1999)\n* Remini, Robert V. Henry Clay: Statesman for the Union (1993)\n* Remini, Robert V. Andrew Jackson and the Course of American Freedom 1822-1832 (1981), detailed biography\n* Remini, Robert V. \"Election of 1832.\" in Arthur M. Schlesinger Jr. ed. History of American Presidential Elections (1968) vol 1 pp 494–516, Detailed coverage plus primary source\n*Ward, John William.(1955) Andrew Jackson, Symbol for an Age. New York: Oxford University Press.\nPrimary sources\n* [https://www.loc.gov/rr/program/bib/elections/election1832.html Presidential Election of 1832: A Resource Guide] from the Library of Congress\n*\n*  Note: the account of the convention in ''Niles' Weekly Register has more information than the printed proceedings.\n* [https://books.google.com/books?id=CYFJAAAAIAAJ&pg=PA74 The proceedings of the United States Anti-Masonic Convention: held at Philadelphia, September 11, 1830.]''\nWebsites\n:*\n:*\n:** source for \"Electoral college selection\"\n:*\nExternal links\n* [http://www.countingthevotes.com/1832/ Election of 1832 in Counting the Votes]"
    }
  ]
}