{
  "content": [
    {
      "type": "text",
      "text": "# 1847 in the United Kingdom\n\nIreland  Scotland  Wales|label2=Sport|data2=1847 English cricket season}}\nEvents from the year 1847 in the United Kingdom.\nIncumbents\n* Monarch – Victoria\n* Prime Minister – Lord John Russell (Whig)\n* Foreign Secretary – Henry John Temple, 3rd Viscount Palmerston\nEvents\n* 1 January – the UK's first Medical Officer of Health is appointed, Dr. William Henry Duncan in Liverpool.\n* 13 January – the Irish Confederation is formed by people in the Young Ireland movement who had broken away from the Repeal Association.\n* 14 January – all thirteen members of the Point of Ayr life-boat crew are drowned when it capsizes off Rhyl.\n* 25–27 February – 1847 University of Cambridge Chancellor election: Prince Albert is unsuccessfully challenged for the chancellorship of the University of Cambridge by The Earl of Powis. The winning margin is less than 120 votes.\n* 5 March – an explosion at The Oaks in the Barnsley seam in Yorkshire kills 73 men and boys.\n* 15 March – new system of county courts, with 60 judicial circuits and 491 courts, comes into operation in England and Wales under terms of the County Courts Act (28 August 1846).\n* 24 March (starting 12 midday) – National Day of Fast and Humiliation for the Great Famine (Ireland) is held across the UK by royal proclamation.\n* 5 April – the world's first civic public park, Birkenhead Park in Birkenhead, Merseyside is opened.\n* 15 April – the House of Lords in the Palace of Westminster, designed by Charles Barry and Augustus Pugin, is opened.\n* 28 April – the brig Exmouth carrying emigrants from Derry bound for Quebec is wrecked off Islay with only three survivors from more than 250 on board.\n* May\n** United Presbyterian Church of Scotland constituted.\n** The Architectural Association School of Architecture is founded in London.\n* 24 May – the Dee bridge disaster: a cast iron girder bridge across the river Dee at Chester, designed by Robert Stephenson for the Chester and Holyhead Railway, collapses under a Shrewsbury and Chester Railway train with five fatalities.\n* June – E. H. Booth & Co. Ltd, which becomes the Northern England supermarket chain Booths, is founded when 19-year-old tea dealer Edwin Henry Booth opens a shop called \"The China House\" in Blackpool.\n* 1 June\n** Military General Service Medal and Naval General Service Medal, the first British campaign medals, are introduced.\n** The public school Ratcliffe College opens near Leicester as a Catholic institution.\n* 8 June – Factory Act establishes a maximum 10-hour working day for women, and for boys aged 13–18.\n* 9 June – the public school Radley College is founded near Oxford as a High Anglican institution.\n* 1 July – publication of Reports of the Commissioners of Inquiry into the state of education in Wales containing opinions hostile to Welsh culture, and commonly known in Wales as the \"Treason of the Blue Books\".\n* 14 July – Faversham guncotton explosion kills 18.\n* 22 July – Town Police Clauses Act 1847 provides powers to regulate urban streets, some of which remain in force into the 21st century.\n* 9 August – the Whig Party under Lord John Russell wins the general election.\n* 13 August – John Russell Hind makes the first British discovery of an asteroid, from London, 7 Iris. On 18 October he discovers 8 Flora.\n* 16 September\n** William Shakespeare's birthplace in Stratford-upon-Avon (pictured) is bought by the United Shakespeare Company for preservation.\n** The Band of Hope is established to promote teetotalism among young people by Rev. Jabez Tunnicliff in Leeds.\n* 30 September – the Vegetarian Society is formed. It remains the oldest in the world.\n* November – Rev. Henry Francis Lyte writes the hymn Abide with Me (in its final form) at Brixham; it is first sung a few weeks later at his funeral.\n* 4–8 November – James Young Simpson discovers the anaesthetic properties of chloroform and first uses it, successfully, on a patient, in an obstetric case in Edinburgh.\n* December – the Christmas cracker is marketed by Tom Smith of London.\n* 20 December – Royal Navy steam frigate  is wrecked on the Sorelle Rocks in the Mediterranean Sea with the loss of 246 lives and only eight survivors.\nUndated\n*Ongoing – Great Famine (Ireland): this summer's potato crop is free from blight, but inadequate due to the small area sown. The British Relief Association is founded and raises money throughout England, the United States and Australia to relieve distress, with the help of the \"Queen's Letters\", two letters from Queen Victoria appealing for assistance.\n*Panic of 1847: A crisis in the banking sector prompted largely by the collapse of Railway Mania. On 25 October the Bank Charter Act 1844 is suspended.\nPublications\n* Anne Brontë's novel Agnes Grey under the pen name of Acton Bell.\n* Emily Brontë's novel Wuthering Heights under the pen name of Ellis Bell.\n* Charlotte Brontë's novel Jane Eyre under the pen name of Currer Bell.\n* Benjamin Disraeli's \"Young England\" novel Tancred.\n* Thomas Guthrie's tract A Plea for Ragged Schools.\n* Frederick Marryat's children's historical novel The Children of the New Forest.\n* Christina Rossetti's Verses by Christina G. Rossetti.\n* Alfred Tennyson's poetry collection The Princess: a medley.\n* William Makepeace Thackeray's novel Vanity Fair.\nBirths\n* 20 January – William Baldock, cricketer (died 1923)\n* 9 February – Hugh Price Hughes, theologian and social reformer (died 1902)\n* 10 February – A. N. Hornby, sportsman (died 1925)\n* 13 February – Sir Robert McAlpine, builder (died 1930)\n* 16 February – Thomas Andrews, metallurgical chemist (died 1907)\n* 20 February – Reginald Alexander, physician (died 1916)\n* 28 February – William Heap Bailey, Scottish footballer (died 1926)\n* 3 March – Alexander Graham Bell, Scottish-born inventor (died 1922)\n* 8 March\n** William Bosomworth, English county cricketer (died 1891)\n** John Lister, politician and philanthropist (died 1933)\n* 22 March – Alfred Bayliss, English-American educator (died 1911)\n* 2 April – Flora Annie Steel, writer (died 1929)\n* 27 April – Walter Simon Andrews, policeman (Whitechapel murders) (died 1899)\n* 7 May – Archibald Primrose, 5th Earl of Rosebery, Prime Minister of the United Kingdom (died 1929)\n* 19 May – Henry Somerset, 9th Duke of Beaufort, aristocrat (died 1924)\n* 5 June – Sir Eric Barrington, civil servant (died 1918)\n* 9 June – John Romilly Allen, archaeologist (died 1907)\n* 11 June – Dame Milicent Fawcett, suffragist and feminist (died 1929)\n* 19 June – Robert Barker, footballer (died 1915)\n* 24 June –  Robert Bickersteth, politician (died 1916)\n* 13 July  – Sir George Atkinson-Willes, Royal Navy admiral (died 1921)\n* 24 July\n** Harry Anstey, English metallurgist and gold prospector (died 1921)\n** Evelyn Boscawen, 7th Viscount Falmouth, artistocrat and army officer (died 1918)\n* 31 July  – James Allen Harker, entomologist (died 1894)\n* 6 August – Laurence George Bomford, artist (died 1926)\n* 11 August – Sir Harry Barron, army officer and Governor of Tasmania (1909-1913) and Western Australia (1913-1917) (died 1921)\n* 28 August – Sir George Bonham, 2nd Baronet, diplomat (died 1927)\n* 30 August – Morton Betts, footballer (died 1914)\n* 1 September – Archibald Kennedy, 3rd Marquess of Ailsa, aristocrat (died 1938)\n* 14 September – William Edward Ayrton, physicist and electrical engineer (died 1908)\n* 24 September – William Edward Briggs, politician (died 1903)\n* 25 September – Edward Austin, cricketer (died 1891)\n* 1 October – Annie Besant, née Wood, Theosophist, social and political campaigner and feminist (died 1933)\n* 17 October – Sir Jervoise Baines, colonial civil servant (died 1925)\n* 24 October – Sir John Bonser, colonial judge, Chief Justice of Ceylon (died 1914)\n* 4 November  – William Allen, English-born Australian Congregational clergyman (died 1919)\n* 8 November\n** Charles Alexander, cricketer (died 1902)\n** Bram Stoker, novelist (died 1912)\n* 23 November – Walter Biggar Blaikie, astronomer, engineer, historian and printer (died 1928)\n* 25 November – George W. Anson, actor (died 1920)\n* 5 December – Francis Baker, cricketer (died 1901)\n* 6 December – John Elmes Beale, politician and merchant (died 1928)\n* 9 December – George Grossmith, actor and comic writer (died 1912)\n* 18 December – Sir William Acland, 2nd Baronet, admiral (died 1924)\n* 27 December – Ferdinand Begg, Scottish stockbroker and politician (died 1926)\nDeaths\n* 11 February – Macvey Napier, lawyer and encyclopaedia editor (born 1776)\n* 13 February – Sharon Turner, historian (born 1768)\n* 9 March – Mary Anning, palaeontologist (born 1799)\n* 7 June – David Mushet, metallurgist (born 1772)\n* 29 August – William Simson, painter (born 1800)\n* 3 September – Simon Goodrich, mechanical engineer, in Portugal (born 1773)\n* 3 October – Charles Hatchett, chemist (born 1765)\n* 20 November – Henry Francis Lyte, hymn-writer (born 1793)\n* 7 December – Robert Liston, surgeon (born 1794)\n* 29 December – William Crotch, composer (born 1775)\nReferences"
    }
  ]
}