{
  "content": [
    {
      "type": "text",
      "text": "# 1855 in the United Kingdom\n\nIreland  Scotland  Wales|label2=Sport|data2=1855 English cricket season}}\nEvents from the year 1855 in the United Kingdom.\nIncumbents\n* Monarch – Victoria\n* Prime Minister – George Hamilton-Gordon, 4th Earl of Aberdeen (Coalition) (until 30 January); Henry John Temple, 3rd Viscount Palmerston (Whig) (starting 6 February)\nEvents\n* 9 January – the Earl of Aberdeen loses a vote of no confidence against his government over the management of the Crimean War.\n* 22 January – French political exile Emmanuel Barthélemy is hanged after being convicted of murdering a London man. Barthélemy had previously killed a fellow Frenchman in the last fatal duel in England, but had only been convicted of manslaughter on that occasion.\n* 29 January – Aberdeen resigns as Prime Minister.\n* 5 February – Viscount Palmerston becomes Prime Minister.\n* 8 February – the Devil's Footprints, a series of mysteriously hoof-like marks, appear in the snow in Devon and continue throughout the countryside for over .\n* 19 February – bread riots in Liverpool break out.\n* 28 February – Society of the Holy Cross (SSC) established as an association of Anglo-Catholic priests with a mission to the urban poor under the mastership of Charles Lowder.\n* 11 April – the first pillar boxes in London are installed, at the suggestion of Rowland Hill.\n* 16 April – Emperor of the French Napoleon III, with Empress Eugénie, begins a 6-day state visit to Britain, staying at Windsor Castle and Buckingham Palace.\n* 18 April – The Bowring Treaty is signed between the UK and the kingdom of Siam, allowing foreigners to trade freely in Bangkok.\n* 15 May – Great Gold Robbery from a train between London Bridge and Folkestone.\n* 15 June – stamp duty is removed from newspapers creating mass market media in the UK.\n* 29 June – The Daily Telegraph newspaper begins publication in London.\n* 4 July – Thomas Cook escorts his first party of excursionists to tour the European continent, travelling via Belgium and enabling the tourists to visit the Exposition Universelle in Paris.\n* 16 July – Australian colonies granted self-governing status.\n* 31 July – Limited Liability Act protects investors in the event of corporate collapse.\n* 18 August – Queen Victoria, with Prince Albert, begins a 10-day state visit to Paris, the first visit of a reigning British monarch to France since 1413. While there, she visits the Exposition Universelle.\n* 3 September – last Bartholomew Fair in London.\n* 9 September – Siege of Sevastopol (1854–55) (Crimean War): Sevastopol falls to the British and their allies.\n* 17 October – Henry Bessemer files his patent for the Bessemer process for the production of steel.\n* 17 November – explorer David Livingstone discovers Victoria Falls in Africa.\n* 22 December – Metropolitan Board of Works established in London.\nUndated\n* James Clerk Maxwell unifies electricity and magnetism into a single theory, classical electromagnetism, thereby showing that light is an electromagnetic wave.\n* The London School of Jewish Studies opens as the Jews' College, a rabbinical seminary, in London.\n* Last minting of the fourpence coin (groat) for use in the U.K.\n* The island of Samson, in the Isles of Scilly, is depopulated.\nPublications\n* Samuel Orchart Beeton's weekly ''The Boys' Own Magazine'' (begins publication January).\n* Mrs Archer Clive's novel Paul Ferroll.\n* Serialisation of Charles Dickens' novel Little Dorrit.\n* Mrs Gaskell's novel North and South.\n* Charles Kingsley's novel Westward Ho!\n* William Makepeace Thackeray's novel The Newcomes.\n* Anthony Trollope's novel The Warden.\n* The Ancient Music of Ireland, including the first published version of the Londonderry Air.\nBirths\n* 21 January – Henry B. Jackson, admiral (died 1929).\n* 1 May – Marie Corelli, novelist (died 1924).\n* 23 May – Isabella Ford, socialist, feminist, trade unionist and writer (died 1924).\n* 2 June – Archibald Berkeley Milne, admiral (died 1938).\n* 28 August – Alexander Bethell, admiral (died 1932).\n* 17 December – Frank Hedges Butler, wine merchant and founding member of the Aero Club of Great Britain (died 1928).\nDeaths\n* 3 January – Julius Hare, theological writer (born 1795).\n* 10 January – Mary Russell Mitford, novelist and dramatist (born 1787).\n* 25 January – Dorothy Wordsworth, poet and diarist (born 1771).\n* 20 February – Joseph Hume, doctor and politician (born 1777).\n* 27 February – Bryan Donkin, engineer and inventor (born 1768).\n* 3 March – Copley Fielding, watercolour landscape painter (born 1787).\n* 31 March – Charlotte Brontë, author (born 1816).\n* 13 April – Sir Henry De la Beche, geologist (born 1796).\n* 15 April – William John Bankes, MP, explorer and Egyptologist (born 1786; died in Venice).\n* 5 May – Sir Robert Inglis, 2nd Baronet, politician (born 1786).\n* 23 May – Charles Robert Malden, explorer (born 1797).\n* 28 June – Fitzroy Somerset, 1st Lord Raglan, commander of British forces in the Crimean War (born 1788).\n* 6 July – Andrew Crosse, 'gentleman scientist', pioneer experimenter in electricity and poet (born 1784).\n* 8 July – Sir Edward Parry, Arctic explorer (born 1790).\n* 30 August – Feargus O'Connor, political radical and Chartist leader (born 1794 in Ireland).\n* 4 September – Emma Tatham, poet (born 1829).\n* 18 September – James Finlay Weir Johnston, chemist (born 1796).\n* 27 September – John Adamson, antiquary and expert on Portuguese (born 1787)\n* 3 December – Robert Montgomery, poet (born 1807).\n* 18 December – Samuel Rogers, poet (born 1763).\n* 20 December – Thomas Cubitt, master builder (born 1785).\nReferences"
    }
  ]
}