{
  "content": [
    {
      "type": "text",
      "text": "# 1861 Victorian colonial election\n\nThe 1861 Victorian colonial election was held from 2−19 August 1861 to elect the 3rd Parliament of Victoria.  All 78 seats in 49 electorates in the Legislative Assembly were up for election, though four seats were uncontested.\nThere were 24 single-member, 21 two-member and 4 three-member electorates.\nThe liberal ministry led by Richard Heales was returned \"with materially increased support\", supported by the Protectionist League and the goldfields electorates.\nResults\n{| class=\"wikitable\" style=\"text-align:right; margin-bottom:0\"\n|+ Legislative Assembly (FPTP)\n! style=\"width:10px;\" colspan=3 | Party / Grouping\n! style=\"width:70px;\"| Votes\n! style=\"width:40px;\"| %\n! style=\"width:40px;\"| Swing\n! style=\"width:40px;\"| Seats\n! style=\"width:40px;\"| Change\n|-\n| style=\"text-align:left;background:#CEF2CE\" | &nbsp;\n| style=\"text-align:left;\" colspan=\"2\"| Ministerial\n| style=\"width:70px;\"| 59,730\n| style=\"width:40px;\"| 52.34\n| style=\"width:45px;\"|\n| style=\"width:40px;\"| 40\n| style=\"width:55px;\"|\n|-\n|  | &nbsp;\n| style=\"text-align:left;\" colspan=\"2\"| Opposition\n| style=\"width:70px;\"| 29,129\n| style=\"width:40px;\"| 25.53\n| style=\"width:45px;\"|\n| style=\"width:40px;\"| 35\n| style=\"width:55px;\"|\n|-\n|  | &nbsp;\n| style=\"text-align:left;\" colspan=\"2\"| Independent & unspecified\n| style=\"width:70px;\"| 25,259\n| style=\"width:40px;\"| 22.13\n| style=\"width:45px;\"|\n| style=\"width:40px;\"| 3\n| style=\"width:55px;\"|\n|-\n! colspan=\"3\"| &nbsp;Totals\n| 114,118\n|\n|\n| 78\n|\n|}\nAftermath\nThe first session of the third Victorian parliament commenced on 30 August 1861.  Though outnumbered, the opposition had more political experience than ministry led by Richard Heales.  Soon after the election support for the government began to wane after several ministerial defections and on 14 November 1861 the Heales ministry was defeated on their budget proposals.\nThe government resigned and Governor Barkly intervened to encourage an alliance between former political opponents, John O'Shanassy and William Haines.  O'Shanassy then formed his third government, which included Haines as treasurer and Charles Gavan Duffy as lands minister.\nBarkly expressed concerns about the new government's \"small and unreliable majority\", but the alliance managed to hold office until June 1863 and passed significant legislation affecting Crown lands, the electoral system, the public service and local government.  The government's Crown Lands Act had the intention of opening up agricultural land to selectors, but loosely drafted clauses enabled manipulation of the system by speculators and large landholders.  The Civil Service Act classified public service salaries and set out principles for promotion.  The Electoral Act Amendment Act abolished public nominations and imposed a deposit of £50 for candidates in elections for the Legislative Assembly.  Included in the changes to the electoral laws was a provision that put ratepayers automatically onto the voters' roll, a change that unintentionally gave the vote to women ratepayers.\nIn June 1863 O'Shanassy's ministry was defeated in parliament by twelve votes after Duffy proposed that the rental on pastoral runs be calculated upon stock numbers.  The ministry resigned on June 19 and was replaced by a ministry formed by an alliance of the supporters of James McCulloch and Richard Heales.  McCulloch became premier and Heales took charge of Crown lands.\nIn 1863 and early 1864 Heales, as lands minister, introduced bills amending the 1862 Land Act.  His provisions included the reservation of agricultural land for selection and strict conditions of payment.  Both bills were rejected in the Legislative Council and allowed to lapse.  Heales was granted leave from parliament in April 1864 due to ill-health and died two months later.\nMcCulloch made land policy the central issue for the October–November 1864 elections and included the proposed reform of the Legislative Council as a secondary issue.\nSee also\n* Members of the Victorian Legislative Assembly, 1861–1864\nNotes\nReferences\nSources\n* Henry Gyles Turner (1904), [https://archive.org/details/historyofcolonyo02turn/page/n7/mode/2up?ref=ol&view=theater A History of the Colony of Victoria (Volume II)], London: Longmans, Green and Co.\n* John Waugh (2006), 'Haines, O'Shanassy, Nicholson and Heales: The Old Guard, 1855-1863', Chapter 2 (in) Paul Strangio & Brian Costar (eds.) (2006), The Victorian Premiers 1856-2006, Leichhardt, NSW: The Federation Press."
    }
  ]
}