{
  "content": [
    {
      "type": "text",
      "text": "# 1864 Victorian colonial election\n\nThe 1864 Victorian colonial election was held from 5 October to 3 November 1864 to elect the 4th Parliament of Victoria.  All 78 seats in 49 electorates in the Legislative Assembly were up for election, though sixteen seats were uncontested.\nThere were 24 single-member, 21 two-member and 4 three-member electorates.\nSupport for liberal protectionist candidates dominated this election, to such an extent that the colonial newspapers made no attempt to classify individual elected members as Ministerialists or Oppositionists.  While the election was still underway an editorial in The Argus commented that \"the Opposition apparently is defunct\", adding that \"a surprising spirit of concord reigns throughout our political world\".\nResults\nNewspapers made no attempt to classify individual elected members as Ministerialists or Oppositionists.\nThe members of the Legislative Assembly returned in the 1864 election were overwhelmingly supporters of the protectionist policies of the McCulloch ministry.  Many of those elected were new to the Legislative Assembly, with only thirty-eight of the seventy-eight members having seats in the previous parliament.\n{| class=\"wikitable\" style=\"text-align:right; margin-bottom:0\"\n|+ Legislative Assembly (FPTP)\n! style=\"width:10px;\" colspan=3 | Party / Grouping\n! style=\"width:70px;\"| Votes\n! style=\"width:40px;\"| %\n! style=\"width:40px;\"| Swing\n! style=\"width:40px;\"| Seats\n! style=\"width:40px;\"| Change\n|-\n| style=\"text-align:left;background:#CEF2CE\" | &nbsp;\n| style=\"text-align:left;\" colspan=\"2\"| Ministerial\n| style=\"width:70px;\"|\n| style=\"width:40px;\"|\n| style=\"width:45px;\"|\n| style=\"width:40px;\"| 53\n| style=\"width:55px;\"|\n|-\n|  | &nbsp;\n| style=\"text-align:left;\" colspan=\"2\"| Opposition\n| style=\"width:70px;\"|\n| style=\"width:40px;\"|\n| style=\"width:45px;\"|\n| style=\"width:40px;\"| 14\n| style=\"width:55px;\"|\n|-\n|  | &nbsp;\n| style=\"text-align:left;\" colspan=\"2\"| Independent\n| style=\"width:70px;\"|\n| style=\"width:40px;\"|\n| style=\"width:45px;\"|\n| style=\"width:40px;\"| 11\n| style=\"width:55px;\"|\n|-\n! colspan=\"3\"| &nbsp;Totals\n| 74,946\n|\n|\n| 78\n|\n|}\nAftermath\nJames McCulloch and his ministry remained in office throughout this parliament.\nThe Land Act of 1865, amending an act passed in 1862, became law on 28 March 1865, allowing selection of Crown land subject to residential and improvements conditions.\nWith the majority of members in the Legislative Assembly supporting protectionist policies, the government's 1865 budget included restructured customs duties that increased the taxation of imports into the colony that competed with local products.  McCulloch included the protective tariff measures in the annual appropriation bill.  The Upper House, dominated by conservative free-trade pastoralists, had no constitutional power to amend the appropriation bill and was therefore unable to block the tariff without rejecting the entire bill, which it did in July 1865.  In November 1865 McCulloch agreed to separate the tariff legislation from the appropriation bill.  The Tariff Bill was passed in the assembly and sent to the council, where it was also rejected.  On 11 December 1865 parliament was dissolved in order for a general election to be held on the issue.\nSee also\n* Members of the Victorian Legislative Assembly, 1864–1865\nNotes\n:A.\nReferences\nSources\n* Henry Gyles Turner (1904), [https://archive.org/details/historyofcolonyo02turn/page/n7/mode/2up?ref=ol&view=theater A History of the Colony of Victoria (Volume II)], London: Longmans, Green and Co.\n* John Waugh (2006), '\"The inevitable McCulloch\" and his rivals, 1863-1877',  Chapter 3 (in) Paul Strangio & Brian Costar (eds.) (2006), The Victorian Premiers 1856-2006, Leichhardt, NSW: The Federation Press."
    }
  ]
}