{
  "content": [
    {
      "type": "text",
      "text": "# 1868 Hayward earthquake\n\n| relief = yes\n| width = 250\n| float = right\n| caption = }}\n| anss-url = ushis139\n| timestamp = 1868-10-21 15:53\n| local-date        =\n| local-time        = 07:53\n| duration    =\n| magnitude   = 6.3–6.7\n| depth       =\n| location    =\n| fault       = Hayward Fault Zone\n| type        = Strike-slip\n| affected    = San Francisco Bay Area  California  United States\n| damage     = $350,000 / Moderate\n| intensity   =\n| pga         =\n| tsunami     =\n| landslide   =\n| foreshocks  =\n| aftershocks =\n| casualties  = 30\n}}\nThe 1868 Hayward earthquake occurred in the San Francisco Bay Area, California, United States on October 21. With an estimated moment magnitude of 6.3–6.7 and a maximum Mercalli intensity of IX (Violent), it was the most recent large earthquake to occur on the Hayward Fault Zone. It caused significant damage and a number of deaths throughout the region, and was known as the \"Great San Francisco earthquake\" prior to the 1906 San Francisco earthquake and fire.\nEarthquake\nThe earthquake occurred at 7:53&nbsp;a.m. on October 21, 1868. Its epicenter was likely located near Hayward, California, and its magnitude has been estimated to have been 6.3–6.7 on the moment magnitude scale. At the surface, ground rupture was traced for , from San Leandro to what is now the Warm Springs District in Fremont.\nDamage\nThe town of Hayward experienced the most damage, with nearly every building destroyed or significantly damaged in the earthquake. The Alameda County Courthouse in San Leandro was destroyed, which resulted in the re-location of the County Seat to Oakland, its current site. The adobe chapel of Mission San José in what is now Fremont was also destroyed, as were several buildings in San Jose, San Francisco and throughout Alameda County. Damage was reported from Santa Rosa in the north to Gilroy and Santa Cruz in the south. Thirty deaths were attributed to the earthquake.\nIntensity\nThe United States Geological Survey estimates that Hayward experienced shaking measuring IX (Violent) on the modified Mercalli scale. San Leandro experienced shaking measuring VIII (Severe), while San Francisco and Oakland experienced shaking measuring VII (Very strong).\nSee also\n*List of earthquakes in California\n*List of earthquakes in the United States\n*List of historical earthquakes\nReferences\n}}\nFurther reading\n*\n*\nExternal links\n*[http://1868alliance.org/ 1868 Hayward Earthquake Alliance]\n*[http://www.oac.cdlib.org/findaid/ark:/13030/tf5z09p42w/ Images from the 1868 earthquake aftermath] – The Bancroft Library\n*[http://sflib1.sfpl.org:82/search/d?SEARCH=Earthquakes+1868 Photos of damage in San Francisco following the 1868 earthquake] – San Francisco Public Library\n*[http://news.stanford.edu/pr/96/960711haywfault.html Prepare for big ruptures on Hayward fault, scientists say] – Stanford University\n*[https://www.youtube.com/watch?v=D6bmBq-mUUA&t=1623s The 150th Anniversary of the Damaging 1868 Hayward Earthquake: Why It Matters and How We Can Prepare for Its Repeat] – Tom Brocher (USGS)"
    }
  ]
}