{
  "content": [
    {
      "type": "text",
      "text": "# 1879 in the United Kingdom\n\nIreland  Scotland  Wales\n|label2= Sport\n|data2 =\n1879 English cricket season\nFootball: England\n}}\nEvents from the year 1879 in the United Kingdom.\nIncumbents\n* Monarch – Victoria\n* Prime Minister – Benjamin Disraeli (Conservative)\nEvents\n* 1 January – Benjamin Henry Blackwell opens the first Blackwell's bookshop in Oxford.\n* 8 January – British army occupies Kandahar in Afghanistan.\n* 11 January – Anglo-Zulu War begins.\n* 22 January – Zulu troops led by King Cetshwayo massacre British troops at the Battle of Isandlwana. At Rorke's Drift, outnumbered British soldiers drive the attackers away after hours of fighting.\n* 3 February – Mosley Street in Newcastle upon Tyne becomes the world's first public highway to be lit by the electric incandescent light bulb, invented by Joseph Swan.\n* March – the standard design of pillar box reverts to a cylindrical shape (the \"anonymous\" style cast by Andrew Handyside and Company).\n* 2 March – murder of Julia Martha Thomas at Richmond upon Thames.\n* 12 March – Anglo-Zulu War: At the Battle of Intombe, a British force over one-hundred strong is ambushed and destroyed by Zulu forces.\n* 13 March – marriage of The Duke of Connaught and Strathearn, third son of Queen Victoria, to Princess Louise Marguerite of Prussia.\n* 28 March – Anglo-Zulu War: British forces suffer a defeat at the Battle of Hlobane.\n* 29 March – Anglo-Zulu War: Battle of Kambula – British forces defeat 20,000 Zulus.\n* 3 April – Anglo-Zulu War: British forces successfully lift the two-month Siege of Eshowe.\n* 12 May – John Henry Newman elevated to Cardinal.\n* 26 May – Russia and the United Kingdom sign the Treaty of Gandamak establishing an Afghan state.\n* June&ndash;August – the wettest summer in England and Wales since records began in 1766, and the equal seventh-coolest since the CET series begins in 1659.\n* 6 June – William Denny and Brothers launch the world's first ocean-going ship to be built of mild steel, the SS Rotomahana, at Dumbarton.\n* 14 June – Sidney Faithorn Green, an Anglican priest in the Church of England, is tried and convicted for using Ritualist practices.\n* 4 July – the Anglo-Zulu War effectively ends with British victory at the Battle of Ulundi.\n* 16 August – Fulham F.C. founded in London as the Fulham St Andrew's Church Sunday School football club.\n* 19 August – the foundation stone of the fourth Eddystone Lighthouse is laid by The Prince of Wales and The Duke of Edinburgh.\n* September – Doncaster Rovers F.C. formed by railway fitter Albert Jenkins.\n* 18 September – Blackpool Illuminations lit for the first time.\n* 2 October – William Denny and Brothers launch the world's first transatlantic steamer to be built of mild steel, the SS Buenos Ayrean, at Dumbarton for Liverpool owners. On 1 December she makes her maiden voyage out of Glasgow for South America.\n* 13 October – first female students admitted to study for degrees at the University of Oxford, at the new Lady Margaret Hall and Somerville Hall and with the Society of Oxford Home-Students.\n* 17 October – Sunderland A.F.C. is formed as 'Sunderland and District Teachers A.F.C.' in the North East.\n* 27 October – Liverpool Echo newspaper first published.\n* November&ndash;March 1880 – probably the longest ever fog in the city's history engulfs London.\n* December – the world's first Christmas grotto opens in Lewis's Liverpool department store as 'Christmas Fairyland'.\n* 15&ndash;23 December – Second Anglo-Afghan War: British victory at the Siege of the Sherpur Cantonment.\n* 28 December – the Tay Bridge Disaster: The central part of the Tay Rail Bridge in Dundee, Scotland collapses in a storm as a train passes over it, killing 78.\n* 30 December – the comic opera The Pirates of Penzance is first presented in Paignton, Devon in a token performance for U.K. copyright reasons; the world première is given the following day in New York City, the only Gilbert and Sullivan work to have its official debut outside England.\n* 1 January to 31 December – the combination of the severest winter since 1814, a late spring, an exceptionally cool summer and a cold dry autumn produces the third-coldest year in the CET series and the coldest since 1740, with an annual mean of .\nUndated\n* Gabardine is invented by Thomas Burberry, founder of the Burberry fashion house in Basingstoke.\n* School meals provided for destitute and poorly nourished children in Manchester.\nPublications\n* Kate Greenaway's first book, with her own colour illustrations, Under the Window: Pictures & Rhymes for Children.\n* Silas Hocking's novel Her Benny.\n* George Meredith's novel The Egoist.\n* Anthony Trollope's last Palliser novel ''The Duke's Children (serialised in All the Year Round).\n* The Boy's Own Paper first published (19 January).\nBirths\n* 1 January\n** E. M. Forster, novelist (died 1970)\n** Ernest Jones, psychoanalyst (died 1958)\n* 8 January – Charles Bryant, actor and director (died 1948)\n* 10 January –  Bobby Walker, Scottish footballer (died 1930)\n* 13 January – William Reid Dick, sculptor (died 1961)\n* 28 January – Una Duval, née Dugdale, suffragette (died 1975)\n* 26 February – Frank Bridge, composer (died 1941)\n* 5 March – William Beveridge, economist and social reformer (died 1963)\n* 20 April – Robert Wilson Lynd, essayist and writer (died 1949)\n* 26 April – Owen Willans Richardson, physicist, Nobel Prize laureate (died 1959)\n* 29 April – Thomas Beecham, conductor (died 1961)\n* 19 May – Viscount Waldorf Astor, businessman and politician (died 1952)\n* 25 May – Max Aitken, 1st Baron Beaverbrook, Canadian-British business tycoon, politician and writer (died 1964)\n* 30 May –\n**Colin Blythe, bowler (cricket) (killed on active service 1917)\n**Vanessa Bell, painter (died 1961)\n* 4 June – Mabel Lucie Attwell, illustrator (died 1964)\n* 6 June – Patrick Abercrombie, town planner (died 1957)\n* 13 July – Alan Wace, archaeologist (died 1957)\n* 15 July – Joseph Campbell, poet and lyricist (died 1944)\n* 1 August – William Percival Crozier, editor of The Manchester Guardian'' (died 1944)\n* 7 August – James Peters, black rugby union international (died 1954)\n* 13 August – John Ireland, composer (died 1962)\n* 27 September – Cyril Scott, composer and writer (died 1970)\n* 10 December – E. H. Shepard, artist and book illustrator (died 1976)\n* 23 December – Louise Hampton, English actress (died 1954)\n* 27 December – Sydney Greenstreet, actor (died 1954)\nDeaths\n* 22 January – John Vivian, Liberal MP, member of the Vivian family, 60\n* 18 February – Rayner Stephens, radical reformer and Methodist minister (born 1805)\n* 25 February – Charles Peace, criminal (executed) (born 1832)\n* 3 March\n** William Kingdon Clifford, geometer and philosopher (born 1845)\n** William Howitt, historical writer and poet (born 1792)\n** Annie Keary, novelist, poet and children's writer (born 1825)\n* 22 March – Sir John Woodford, general and archaeologist (born 1785)\n* 23 March – Sir Walter Trevelyan, naturalist and geologist (born 1797)\n* 8 April – Sir Anthony Panizzi, librarian (born 1797 in Italy)\n* 21 April – George Hadfield, radical politician (born 1787)\n* 25 April – Charles Tennyson Turner, poet (born 1808)\n* 4 May – William Froude, hydrodynamicist (born 1810)\n* 8 May – Henry Collen, royal miniature portrait painter (born 1797)\n* 10 May – Robert Thompson Crawshay, ironmaster (born 1817)\n* 3 June – Frances Ridley Havergal, religious poet (born 1836)\n* 7 June – William Tilbury Fox, dermatologist (born 1836)\n* 3 August – Joseph Severn, painter (born 1793)\n* 10 August – George Long, classical scholar (born 1800)\n* 20 August – Sir John Shaw-Lebevre, barrister, Whig politician and civil servant (born 1797)\n* 19 September – Clara Rousby, actress (born 1848)\n* 23 September – Francis Kilvert, diarist (peritonitis) (born 1840)\n* 26 September – Sir William Rowan, field marshal (born 1789)\n* 5 November – James Clerk Maxwell, physicist (born 1831)\n* 6 December – John Bentinck, 5th Duke of Portland (born 1800)\n* 11 December – William Thomas (Gwilym Marles), minister and poet (born 1834)\n* 13 December – William Calcraft, hangman (born 1800)\nReferences"
    }
  ]
}