{
  "content": [
    {
      "type": "text",
      "text": "# 1884 Republican National Convention\n\nThe 1884 Republican National Convention was a presidential nominating convention held at the Exposition Hall in Chicago, on June 3–6, 1884. It resulted in the nomination of former House Speaker James G. Blaine from Maine for president and Senator John A. Logan of Illinois for vice president. The ticket lost in the election of 1884 to Democrats Grover Cleveland and Thomas A. Hendricks.\nIn attendance were 1,600 delegates and alternates and 6,000 spectators. There were 820 official delegates; 411 votes were needed to win the nomination. The incumbent president, Chester A. Arthur, was not a serious contender due to ill health. Blaine was the favorite going in, but there was a possibility that President Arthur could build a coalition with smaller candidates such as George F. Edmunds. There were also rumors that members of the party would bolt if Blaine won the nomination. Neither Blaine nor Arthur were in attendance. Blaine was at his home in Augusta, Maine, and Arthur followed the events from the White House by telegraphy.\nPreparations and logistics\nThe convention was held in Chicago, Illinois at the Exhibition Hall building, which was located on Michigan Avenue. Since hosting the 1860 Republican National Convention, Chicago had established itself as a frequent site of United States presidential nominating conventions. This was in large part due to its relatively central geographic location and its accessibility by railroad.\nOn April 7, a meeting was held in Chicago with members of a subcommittee of the Republican National Committee and a local host committee in order plan arrangements for the convention. At this meeting, a decision was made to limit the capacity of the convention hall to 9,000. It was also agreed that the local host committee would be given 1,000 tickets to be distributed to Chicago locals. The meeting also saw various local subcommittees established to organize specific aspects of the convention's logistics. The local subcommittees established for arrangements included subcommittees on finance, transportation, decoration, music, official register, press, hotel, telegraph, official publication, official reporting.\nOn May 26, W. R. Sullivan (the secretary for the local host committee) sent a report to the Republican National Committee summarizing the state of preparations, and detailing the proceedings of meetings that the local host committee had held. He reported that preparations were nearly complete. John C. New (chairman of the Republic National Committee's subcommittee for convention preparations) arrived in Chicago that same day to oversee the final preparations. He established his headquarters at the Palmer House hotel. On his first day in Chicago, New inspected the convention hall, accompanied by individuals overseeing various aspects of convention preparations. He was also accompanied by William Henry Smith of the Associated Press as well as the local Western Union Telegraph Company manager, touring and assessing the spaces set aside for the anticipated 300 journalists that would cover the convention on behalf of newspapers.\nExhibition hall arrangement\nWhile the 1880 Republican convention held at the same venue had been staged in the southern end of Exhibition Hall, it was decided to stage the 1884 convention in its northern end. The 9,000 person capacity of the convention hall setup was smaller than the capacity of the 1880 convention. However, all attendees of the 1884 convention were given chair seating, a change from the uncomfortable bench seating that made up a bulk of seating at the 1880 convention. The walls of the convention hall were painted with fireproof blue and red paint. Signs over entrances were colored to match the color-coding of corresponding tickets. Work tables for newspaper reporters were placed on the floor of the convention hall (some located directly in front of the stage and perpendicular to it, others erected to the sides of the stage and set at a right angle from it), as well as a special balcony for those press representatives who did not need a worktable. Other spaces for newspaper reporters included rooms set aside for additional workspace, as well as telegraphy rooms.\nA New York Evening Post press dispatch released before the convention reported on the convention hall,\nThe majority individuals selected by James A. Saxton (the convention sergeant-at-arms) to fill operations roles were locals of Chicago. Saxton selected twelve assistant sergeant-at-arms, 75 ushers, 25 pages, between thirty and forty watchmen, 75 doorkeepers, and thirty janitors (\"sweepers\" and \"scrubbers\"). All of those selected to be doorkeepers were recruited from the Union Veteran Club.\nThe convention was attended by 1,600 delegates and alternates as well as 6,000 spectators. 9,451 entrance tickets were printed for the convention on engraved steel by the Western Bank Note and Engraving Company.\nHotels\nThe local hotel subcommittee was dissolved at its members request after they discovered that state delegations were already independently taking care of arranging their overnight accommodations.\nThe Sherman House accommodated delegates from Alabama, Arkansas, Iowa, South Carolina, and Tennessee. The Palmer House accommodated delegates from California, Georgia, Florida, Kansas, Kentucky, Maryland, Mississippi, Missouri, Nebraska, Rhode Island, Texas, Vermont, Virginia, and Wyoming. The Grand Pacific Hotel accommodated delegates from Colorado, Connecticut, District of Columbia, Illinois, Indiana, Louisiana, Minnesota, New Hampshire, New Jersey, New York, Ohio, Oregon, Pennsylvania, and Wisconsin. The Leland Hotel accommodated delegates from Delaware, Massachusetts, as well as portions of the Maine and New York delegations. The Crawford House accommodated delegates from West Virginia. The Tremont House accommodated delegates from Michigan. The Sherman House, Palmer House, Grand Pacific, and Tremont House were considered the \"big four\" prestigious hotels constructed in Chicago after the Great Chicago Fire of 1871.\nPre-balloting maneuvers\nTo test the waters, Blaine supporters nominated Powell Clayton as temporary chair of the convention. A former Arthur supporter, Clayton was now in Blaine's camp. He was popular with veterans, but was also associated with the Star Route Frauds. Edmunds's supporters, led by Henry C. Lodge, moved to nominate John R. Lynch instead, an African-American from Mississippi. The speech supporting Lynch was given by Theodore Roosevelt. Lynch won the vote 424 to 384, and Blaine's nomination seemed for the first time vulnerable.\nBlaine's future seemed more vulnerable the next day when, to address the rumors of party members bolting, his supporters made a motion to remove seats of delegates who failed to pledge support of the eventual nominee. The motion failed, again by the fortitude of Edmunds's supporters. The day closed with John B. Henderson being elected permanent chair of the convention.\nThat evening leaders of Arthur's and Edmunds's camps met in private in the Grand Pacific Hotel and tried to create a viable coalition. Arthur's team could not guarantee that his supporters would back Edmunds. It was more likely that the second choice of Arthur delegates was Blaine.\nThe selection of the delegates for the convention saw the advent of a new system which included some delegates selected at the congressional-district level rather than at the state-level. This led to more than 225 delegates being individuals regarded to be relatively independent in their views rather than lockstep with their state party.\nPresidential nomination\nPresidential candidates\nFile:Unsuccessful 1884.jpg|Former Secretary of StateJames G. Blainefrom Maine\nFile:20 Chester Arthur 3x4.jpg|PresidentChester A. Arthurfrom New York\nFile:GFEdmunds.jpg|President pro temporeGeorge F. Edmundsfrom Vermont\nFile:John Alexander Logan crop.jpg|SenatorJohn A. Loganfrom Illinois\nFile:JohnSherman.png|SenatorJohn Shermanfrom Ohio\nFile:Joseph Roswell Hawley - Brady-Handy.jpg|SenatorJoseph R. Hawleyfrom Connecticut\nDeclined to contest\n* Secretary of War Robert Todd Lincoln from Illinois\n* General William Tecumseh Sherman from Ohio\n* Lieutenant General Philip Sheridan from New York\nThe roll call of the States began the next evening. When Maine was called, the cheering lasted ten minutes, during which time William H. West came to the platform and gave a rabble-rousing speech to second the nomination. After West's speech, pandemonium continued in the building, much to West's chagrin. Further speeches seconding the nomination were given by Cushman Kellogg Davis and Thomas C. Platt.\nWhen the roll call reached New York, it was Arthur's turn to be nominated. Martin I. Townsend's speech was lackluster at best and poorly prepared, Townsend having been selected for the responsibility only after the roll call began. His speech was occasionally drowned out by hisses and eruptions of side conversations. The nomination was seconded by Harry H. Bingham, John R. Lynch and Patrick H. Winston. Bingham's speech was strong, Lynch's brief, and Winston's irritating. Although it was already 11 PM, a motion to adjourn failed. Another speech for Arthur was given by P. B. S. Pinchback, but like the others, it did not sway any support.\nTo close the night Joseph B. Foraker nominated John Sherman and John Davis Long nominated Edmunds. The delegates adjourned just after midnight.\nOn the morning of June 6, balloting began.\nOn the first ballot Blaine received 334½, Arthur 278, Edmunds 93, Logan 63½, and Sherman 30, with Joseph Roswell Hawley, Robert Todd Lincoln and William Tecumseh Sherman receiving parts of the remainder. Arthur received only a third of his votes from the North, none from Ohio, 1 of 44 from Illinois, 9 of 30 from Indiana, 11 of 60 from Pennsylvania and only 31 of 72 from his home state of New York. It was expected that Logan's delegates would shift to Blaine.\nOn the third ballot, Blaine received 375 (gaining delegates from Edmunds), Arthur 274. On the fourth ballot, Blaine received 541, Arthur 207, and Edmunds 41. Blaine received 130 more than the majority needed, grabbing 67 from Arthur's camp and 28 from Edmunds's.\n{| class=\"wikitable sortable\" style=\"text-align:center\"\n! colspan=\"5\" | Presidential ballot\n|-\n! Candidate !!1st !! 2nd !! 3rd !! 4th\n|-\n!Blaine\n|style=\"background:#fbb;\"|334.5\n|style=\"background:#fbb;\"|349\n|style=\"background:#fbb;\"|375\n|style=\"background:#fbb;\"|541\n|-\n!Arthur *\n|style=\"background:#fdd;\"|278\n|style=\"background:#fdd;\"|276\n|style=\"background:#fdd;\"|274\n|style=\"background:#fdd;\"|207\n|-\n!Edmunds\n|style=\"background:#fee;\"|93\n|style=\"background:#fee;\"|85\n|style=\"background:#fee;\"|69\n|style=\"background:#fee;\"|41\n|-\n!Logan\n|63.5\n|61\n|53\n|7\n|-\n!J. Sherman\n|30\n|28\n|25\n|style=\"background:#d3d3d3\"|0\n|-\n!Hawley\n|13\n|13\n|13\n|15\n|-\n!Lincoln\n|4\n|4\n|8\n|2\n|-\n!W. T. Sherman\n|2\n|3\n|2\n|style=\"background:#d3d3d3\"|0\n|-\n!Not Voting\n|2\n|1\n|1\n|7\n|}\nPresidential balloting / 4th day of convention (June 6, 1884)\nFile:1884RepublicanPresidentialNomination1stBallot.png|1st Presidential Ballot\nFile:1884RepublicanPresidentialNomination2ndBallot.png|2nd Presidential Ballot\nFile:1884RepublicanPresidentialNomination3rdBallot.png|3rd Presidential Ballot\nFile:1884RepublicanPresidentialNomination4thBallot.png|4th Presidential Ballot\nVice-presidential nomination\nVice-presidential candidates\nFile:John Alexander Logan crop.jpg|SenatorJohn A. Loganfrom Illinois\nImage:WQ Gresham (cropped).jpg|Postmaster GeneralWalter Q. Greshamof Indiana(Not nominated)\nImage:Joseph B. Foraker (10506807396) (1).jpg|Gubernatorial CandidateJoseph B. Forakerof Ohio(Not nominated)\nIn the evening of the day of Blaine's nomination, Logan was selected to be the Republican vice presidential nominee.\n{| class=\"wikitable sortable\" style=\"text-align:center\"\n|-\n! colspan=\"2\" | Vice-presidential ballot\n|-\n! Candidate !!1st\n|-\n!Logan\n|style=\"background:#fbb;\"|779\n|-\n!Gresham\n|style=\"background:#fdd;\"|6\n|-\n!Foraker\n|style=\"background:#fee;\"|1\n|-\n!Not voting\n|34\n|}\nVice-presidential balloting / 4th Day of convention (June 6, 1884)\nFile:1884RepublicanVicePresidentialNomination1stBallot.png|1stVice-presidential ballot\nSee also\n* List of Republican National Conventions\n* 1884 United States presidential election\n* United States presidential nominating convention\n* History of the United States Republican Party\n* 1884 Democratic National Convention\nReferences\nBibliography\n*\nExternal links\n* [http://www.presidency.ucsb.edu/ws/index.php?pid=29626 Republican Party platform of 1884] at The American Presidency Project\n* [https://books.google.com/books?id=YSENAAAAIAAJ Official Proceedings of the Republican National Convention Held at Chicago, June 3, 4, 5, and 6, 1884]"
    }
  ]
}