{
  "content": [
    {
      "type": "text",
      "text": "# 1885 hangings at Battleford\n\n, who sentenced the men to hang at Battleford.]]\nThe hangings at Battleford refers to the hanging on November 27, 1885, of eight Indigenous men for murders committed in the First Nations uprising that occurred at the time of the North-West Rebellion. The executed men were found guilty of murder in the Frog Lake Massacre and in the Looting of Battleford. These murders took place outside the military combat that took place during the North-West Rebellion.\nThe court trials were presided over by magistrate Charles Rouleau. The trials and hangings followed the Looting of Battleford, where the judge himself suffered material loss.\nPrior to the rebellion the Canadian government's actions in the District of Saskatchewan resulted in starvation, disease, and death among the Indigenous peoples of the area. Traditional means of self-support, such as buffalo disappeared with the sale of lands.\nAt both Frog Lake and Battleford, some people took up arms against the wishes of their leaders. Some were sentenced to prison terms or death. Others fled to the United States.\nTrial and charges of bias\nIn the Frog Lake Massacre, Indian Agent Thomas Trueman Quinn was shot in the head. Quinn was a notoriously harsh Indian agent, who kept Indigenous people near Frog Lake on the brink of starvation (\"no work, no rations\"). Quinn treated the Cree with harshness and arrogance. Before dawn on April 2, 1885, a party of Cree warriors captured Quinn at his home. He refused to go to another location with the Cree warriors, and Wandering Spirit shot him dead. In the moments of panic following Quinn's shooting, eight other settler prisoners were shot dead.\nHBC employee William Bleasdell Cameron, later the author of Blood Red the Sun, first published in 1926 as The War Trail of Big Bear, was there at the time. His life was spared by Wandering Spirit. Blood Red the Sun describes the events leading up to the Frog Lake Massacre and the executions in significant detail. Cameron's friends and colleagues were killed at the Frog Lake Massacre. Cameron testified at the trials against Wandering Spirit and others who participated in the incident.\nFollowing the end of the rebellion, marked by the capture of Batoche, the participants of the events at Frog Lake were arrested and taken to Battleford.\non September 22, Wandering Spirit pleaded guilty, and Stipendiary Magistrate Charles Rouleau sentenced him to hang.\nRouleau, a Battleford resident, also heard the cases against five other Frog Lake participants. The December issue of the Saskatchewan Herald described Rouleau as a \"heavy loser pecuniarily\" after the Looting of Battleford  his house had been burned to the ground, and he reportedly promised that \"every Indian and Half-breed and rebel brought before him after the insurrection was suppressed, would be sent to the gallows if possible.\" A \"memorial\" was sent to the Department of Justice alleging Rouleau was too personally involved to perform his job as presiding judge in an unbiased manner but his rulings in almost all cases were not struck down. Rouleau found the five guilty and sentenced them to hang.\nRouleau found two others guilty of murder in the looting of Battleford and sentenced them to hang.\nAs well, he found Dressy Man and Charlebois guilty of the murder of a Native woman feared to have become a wehtigo. He also sentenced Louison Mongrain, killer of NWMP Cowan, to death by hanging. The death sentences of  Dressy Man, Charlebois and Mongrain were later commuted.\nDuring the trial, the accused Cree-speaking men were not provided with translation.\nThe eight hanged\nThe following people were hanged in Battleford on November 27. The first six were convicted of murders in the Frog Lake Massacre, while the final two were convicted of murders in the Looting of Battleford.\n* Kah - Paypamahchukways (Wandering Spirit) for the murder of T. T. Quinn, Indian Agent.\n* Pah Pah-Me-Kee-Sick (Round the Sky) for the murder of Léon Fafard, a priest of the Oblates of Mary Immaculate.\n* Manchoose (Bad Arrow) for the murder of Charles Govin, Quinn's interpreter.\n* Kit-Ahwah-Ke-Ni (Miserable Man) for the murder of Govin.\n* Nahpase (Iron Body) for the murder of George Dill, a free trader.\n* A-Pis-Chas-Koos (Little Bear) for the murder of Dill. (A-Pis-Chas-Koos was a Cree chief but not to be confused with Little Bear (Imasees), son of Big Bear, who was active in the Frog Lake incident and went unpunished.)\n* Itka (Crooked Leg) for the murder of Payne, a farm instructor of the Stoney Reserve south of Battleford.\n* Waywahnitch (Man Without Blood) for the murder of Barney Tremont, a rancher out of Battleford.\nHangings\nThe eight convicted murderers went to the scaffold singing their war songs. Although a different eyewitness noted that, unlike the other seven, Wandering Spirit hummed a love song to his wife as his final moment approached.\nStudents from Battleford Industrial School were brought from the school to witness the hangings as a \"warning\".\nThe eight bodies were buried in a mass grave near the fort.\nThere are a number of first-hand historical records, the majority written from the perspective of settlers in the area. One example is Blood Red the Sun, by William Bleasdell Cameron.\nHistorical significance\nIn his 1970s-era histographical account of Indian policy in Canada, Prisons of Grass, Howard Adams gives his opinion on the hangings:\n}}\nRediscovery of the gravesite\nThe mass grave near the fort remained unmarked and forgotten for many years. In 1972, the gravesite was rediscovered by students who followed old plans of the fort to find the burial. The location was marked with a concrete pad and chain fence. In later years, this was removed and replaced with a modern headstone bearing the names of the executed men. There is also an interpretive panel explaining the history of the burial site.\nThe gravesite is on public property in the Town of Battleford at  near the Eiling Kramer Campground and Fort Battleford.\nMemorials held\nThe hanged warriors were remembered with a pipe ceremony and feast held on June 22, 2019. The news report said \"this ceremony takes place every year at this same time [around the time of] the National Indigenous Peoples Day on June 21.\"\nIn popular culture\n* Vancouver-based Celtic punk band the Dreadnoughts released a song on the hangings in 2022 titled \"Battleford 1885\".\n* In 2022, Canadian artist Kent Monkman completed a painting depicting students from Battleford Industrial School brought to witness the hangings entitled Compositional Study for The Going Away Song.\nReferences"
    }
  ]
}