{
  "content": [
    {
      "type": "text",
      "text": "# 1890 in the United Kingdom\n\nIreland  Scotland  Wales\n|label2= Sport\n|data2 =\n1890 English cricket season\nFootball: England\n}}\nEvents from the year 1890 in the United Kingdom.\nIncumbents\n* Monarch – Victoria\n* Prime Minister – Robert Gascoyne-Cecil, 3rd Marquess of Salisbury (Conservative)\nEvents\nis opened.]]\n* 4 January – first edition of the Daily Graphic, the first British 'picture paper'.\n* 11 January – the British government delivers an ultimatum to Portugal forcing the retreat of Portuguese military forces from land between Portuguese colonies of Mozambique and Angola.\n* 6 February – an underground explosion at Llanerch Colliery, Abersychan in Monmouthshire kills 176.\n* 15 February – Kent Coalfield located.\n* 4 March – the Forth Bridge in Scotland opens to rail traffic. It is  in length with 2 cantilever spans of  making it the longest bridge in Britain and the bridge with the greatest cantilever span in the world.\n* 27 March – Preston North End finish the second season of the Football League as title winners once again.\n* 29 March – Blackburn Rovers win their fourth FA Cup with a 6–1 victory over Sheffield Wednesday in the final at Kennington Oval, London.\n* 12 May – the first official County Championship cricket match begins in Bristol. Yorkshire beat Gloucestershire by eight wickets.\n* 15 May – new elected county councils in Scotland, created by the Local Government (Scotland) Act 1889, take up their powers. The County of Edinburgh formally adopts the title Midlothian; the formerly administratively separate counties of Ross and Cromarty are merged; and the Shetland county council formally adopts the spelling Zetland.\n* 28 June – the Baseball Ground is opened in Derby to serve one of eight teams competing in a new national baseball league.\n* 1 July – the Heligoland-Zanzibar Treaty is signed between the United Kingdom and Germany: Britain cedes sovereignty of the Heligoland archipelago (in the German Bight) to Germany in return for protectorates over Wituland and the Sultanate of Zanzibar (the islands of Pemba and Unguja) in east Africa.\n* 21 July – Battersea Bridge over the River Thames opens in London.\n* 7–15 September – Southampton Dock strike.\n* 8–11 September – royal baccarat scandal: in a house party at Tranby Croft in Yorkshire attended by the Prince of Wales, the future Edward VII, an army officer is accused of cheating in an illegal gambling game, giving rise to an 1891 trial for slander.\n* 20 October – explorer of Africa Richard Francis Burton dies of a heart attack in Trieste, aged 69.\n* 22 October – colony of Western Australia granted self-governing status.\n* November\n** Baring crisis, a financial panic precipitated by the need to guarantee Barings Bank's risky debts in Argentina.\n** Scotland Yard, headquarters of the Metropolitan Police Service, moves to a building on London's Victoria Embankment, as New Scotland Yard.\n* 4 November – London's City & South London Railway, the first deep-level underground railway in the world, opens. It runs a distance of  between the City of London and Stockwell.\n* 9 November – Royal Navy torpedo cruiser  is shipwrecked off Camariñas in Spain with the loss of 173 out of her crew of 176.\n* 17 November – Captain Willy O'Shea divorces his wife, Kitty, for adultery; Charles Stewart Parnell, leader of the Irish Parliamentary Party, is named as co-respondent.\n* 21 November – Edward King (bishop of Lincoln) is convicted in a special ecclesiastical court (revived for the first time since 1699) of using ritualistic practices in Anglican worship, although on a majority of counts the court finds in his favour.\n* 18 December – British East Africa Company takes control of Uganda.\nUndated\n* Construction of the first large-scale electrical power station, at Deptford.\n* Blackwall Buildings, Whitechapel, noted philanthropic housing, is built in the East End of London.\n* Construction begins of Britain's first council housing at Arnold Cross, Shoreditch in the East End of London.\n* The Rhymers' Club, a group of poets gathered around W. B. Yeats and Ernest Rhys, begins to meet informally at the Cheshire Cheese in Fleet Street, London.\nPublications\n* Arthur Conan Doyle's Sherlock Holmes novel The Sign of Four (originally published as The Sign of the Four in ''Lippincott's Monthly Magazine'' dated February).\n* James George Frazer's study in religion, The Golden Bough, volume 1.\n* Rudyard Kipling's novel The Light that Failed (in ''Lippincott's Monthly Magazine'' dated January 1891).\n* Arthur Machen's novella The Great God Pan (in the magazine The Whirlwind).\n* Alfred Marshall's textbook Principles of Economics.\n* William Morris's utopian socialist novel News from Nowhere (serialised in Commonweal).\n* Oscar Wilde's only novel The Picture of Dorian Gray (in ''Lippincott's Monthly Magazine'' dated July).\nBirths\n* 2 January – Madoline Thomas, actress (died 1989)\n* 14 January – Arthur Holmes, geologist (died 1965)\n* 30 January – Stewart Menzies, chief of the Secret Intelligence Service (died 1968)\n* 14 February – Nina Hamnett, painter (died 1956)\n* 17 February – Ronald Fisher, statistician and geneticist (died 1962 in Australia)\n* 18 February - Ishobel Ross, nurse and diarist (died 1965)\n* 25 February – Myra Hess, pianist (died 1965)\n* 20 March – Owen Williams, civil engineer (died 1969)\n* 31 March – William Lawrence Bragg, physicist, Nobel Prize laureate (died 1971)\n* 15 April – Percy Shaw, inventor (died 1976)\n* 16 April – Fred Root, cricketer (died 1954)\n* 23 May –  Herbert Marshall, actor (died 1966)\n* 16 June – Stan Laurel, comic film actor (died 1965 in the United States)\n* 26 July – David Margesson, politician (died 1965)\n* 15 September – Agatha Christie, detective fiction writer (died 1976)\n* 19 September – Montague Dawson, maritime painter (died 1973)\n* 24 September – A. P. Herbert, comic writer and independent politician (died 1971)\n* 1 October – Stanley Holloway, actor, comedian, singer and poet (died 1982)\n* 17 October – Roy Kilner, cricketer (died 1928)\n* 15 November – Richmal Crompton, writer (died 1969)\n* 22 November – Harry Pollitt, communist politician (died 1960)\n* 24 November – Ernest Bader, businessman and philanthropist (died 1982)\n* 3 December – Walter H. Thompson, Winston Churchill's bodyguard (died 1978)\n* 5 December – David Bomberg, painter (died 1957)\n* 30 December – Lanoe Hawker, fighter pilot (killed in action 1916 over France)\n* 31 December – Bentley Purchase, coroner (died 1961)\nDeaths\n*11 April – Joseph Merrick (the \"Elephant Man\"), pathological curiosity (born 1862)\n*7 May – James Nasmyth, engineer (born 1808)\n*2 June – Sir George Burns, Scottish shipowner (born 1795)\n*18 July – Lydia Becker, suffragette (born 1827)\n*20 July\n**David Davies, Welsh industrialist (born 1816)\n**Sir Richard Wallace, 1st Baronet, art collector (born 1818)\n*11 August – John Henry Newman, Roman Catholic Cardinal, canonised (born 1801)\n*30 August – Marianne North, botanical artist (born 1830)\n*4 October – Catherine Booth, Mother of The Salvation Army (born 1829)\n*20 October – Sir Richard Francis Burton, explorer (born 1821)\n*12 December – Sir Joseph Boehm, sculptor (born 1834 in Vienna)\nSee also\n* List of British films before 1920\nReferences"
    }
  ]
}