{
  "content": [
    {
      "type": "text",
      "text": "# 1893 United Kingdom miners' strike\n\nsupported themselves by independently working a coal seam they discovered]]\nThe '''1893 miners' strike''' was a major industrial action affecting many areas of Great Britain.\nThe strike involved about 300,000 coal miners in the Federated District, making it larger than any previous strike in the UK.  This consisted of Yorkshire, Lancashire and Cheshire, Staffordshire, Worcestershire, Cannock Chase and Shropshire, Nottinghamshire, South Derbyshire and Leicestershire, Forest of Dean, Radstock, Bristol, Warwickshire, North Wales, Stirlingshire and Monmouth.  All these areas had active unions, which were affiliated to the recently founded Miners' Federation of Great Britain (MFGB).\nThe price of coal had fallen since the start of the 1890s, and in the hope of reducing surplus coal stocks, the MFGB instructed all its members in the Federated District to take a week's holiday, starting on 12 March 1892.  This was almost universally observed, despite the protests of many mine owners, who feared that it would worsen their individual financial position, and perhaps also that it would strengthen the position of the MFGB.  At the same time, mine owners in County Durham proposed a 10% reduction in wages, and when the Durham Miners' Association's (DMA) members voted strongly to reject this, they were locked out.  In Durham, the union was defeated, miners returning to work after 12 weeks with their wages cut as originally proposed, and this experience inspired the DMA to affiliate to the MFGB.\nThe Federated District unions maintained their levels of pay until 30 June 1893, when mine owners in the district collectively announced a 25% cut in wages.  This was strongly opposed by the MFGB.  At the end of July, unionised miners in most pits in the district were locked out, with just a few strikebreakers continuing to work.  At some pits, no notice of a proposed reduction had been given, and miners instead initiated strike action themselves, although there were a handful of these pits where work continued.  However, the miners in Durham, Northumberland and Monmouthshire did not take part in the co-ordinated action, and their unions resigned or were expelled from the MFGB.  During August, there was a stand-off, but at the start of September, there were widespread clashes between striking miners and strikebreakers in Yorkshire.  Troops were deployed to the areas where violence had occurred, and the Yorkshire Miners' Association called for peace.  On 7 September, two miners were killed by troops in Featherstone, in what became known as the \"Featherstone Massacre\".\nThe MFGB accepted the gradual return to work among miners who were able to do so at their old pay rate, and by the end of October, the number of locked out workers was down to 87,000.  The mine owners reduced their demand to a 15% wage reduction, which was considered at a conference held in Derby on 3 and 4 November, chaired by A. J. Mundella.  The MFGB refused this offer, maintaining a demand for no cuts in wages, and for the formation of a board of conciliation to consider future disputes.  A second conference was organised, chaired by Lord Rosebery, which agreed a Board of Conciliation and a return to work with no cut in wages, and for no cuts to take place before 1 February 1894.  Having won their demands, on 17 November, the miners returned to work.\nBy February 1894, the price of coal had risen, and so the two sides were able in July to agree to a 10% pay cut, with no further reductions.\nReferences\nFurther reading\n* Campolieti, Michele. \"Strikes in British Coal Mining, 1893–1940: Testing Models of Strikes.\" Industrial Relations 60.2 (2021): 243-273. https://doi.org/10.1111/irel.12276\n* Church, R., and Q. Outram. \"British Coal Mining Strikes, 1893-1940.\" (2022). http://doi.org/10.5255/UKDA-SN-3899-1"
    }
  ]
}