{
  "content": [
    {
      "type": "text",
      "text": "# 1894 in the United Kingdom\n\nIreland  Scotland  Wales\n|label2= Sport\n|data2 =\n1894 English cricket season\nFootball: England  Scotland\n}}\nEvents from the year 1894 in the United Kingdom.\nIncumbents\n* Monarch – Victoria\n* Prime Minister – William Ewart Gladstone (Liberal) (until 2 March); Archibald Primrose, 5th Earl of Rosebery (Liberal) (starting 5 March)\nEvents\n* 15 February – 04:51 GMT, French anarchist Martial Bourdin attempts to destroy the Royal Greenwich Observatory in London with a bomb but succeeds only in killing himself through its accidental explosion.\n* 1 March – Local Government Act (coming into effect December 1894&ndash;January 1895) creates a system of urban and rural districts with elected councils, with elected civil parish councils in rural areas, reforms the boards of guardians of poor law unions, and gives women, irrespective of marital status, the right to vote and stand in local (but not national) elections.\n* 2 March – William Ewart Gladstone (at the age of 84) resigns as Prime Minister over high Navy estimates.\n* 5 March – Archibald Primrose, 5th Earl of Rosebery becomes Prime Minister and forms a minority Liberal Party government.\n* 11 April – Britain establishes a Protectorate over Uganda.\n* 12 April – the annual Budget establishes death duties with effect from 2 August.\n* 16 April – Ardwick Association Football Club changes its name to Manchester City F.C.\n* 21 April – debut of the George Bernard Shaw play Arms and the Man in London.\n* 23 April (St. George's Day) – Howard Ruff founds the Royal Society of St George, to foster the love of England and to strengthen England and the Empire by spreading the knowledge of English history, traditions and ideals.\n* 14 May – Blackpool Tower opened in Blackpool, Lancashire, as a visitor attraction.\n* 21 May – the Manchester Ship Canal is officially opened, linking the previously landlocked city of Manchester to the Irish Sea.\n* 6 June – Ladas becomes the first horse to win the Epsom Derby for owner Lord Rosebery, the Prime Minister.\n* 23 June – a firedamp explosion at Albion Colliery, Cilfynydd, Glamorgan, kills 290 coal miners and 123 horses underground.\n* 30 June – Tower Bridge in London opened for traffic.\n* September – British Association for the Advancement of Science inaugurates an Ethnographic Survey of the United Kingdom.\n* 28 September – Michael Marks forms the partnership of Marks & Spencer with Thomas Spencer, opening its first store in Manchester.\n* 13 October – Everton and Liverpool Football Clubs meet in the first Merseyside derby.\n* 17–18 October – First Kinetoscope parlour in the UK opens in London.\n* December – Frederick Bremer, a plumber and gasfitter from Walthamstow, runs the first British four-wheeled petrol-engined motor car (self-built) on the public highway.\nUndated\n* Argon discovered by Lord Rayleigh and Sir William Ramsay.\n* Patrick Manson develops the thesis that malaria is spread by mosquitoes.\n* Alfred Harmsworth buys the London Evening News newspaper.\n* Grace Kimmins founds the Guild of the Brave Poor Things for the education of crippled boys.\n* The National College of Music is founded by the Moss family in London.\n* Spillers Records is founded in Cardiff; by 2010 it will be regarded the world's oldest surviving record shop.\nPublications\n* Edward Carpenter's book Homogenic Love, and its place in a free society.\n* Arthur Conan Doyle's collection The Memoirs of Sherlock Holmes.\n* George du Maurier's novel Trilby (serialised).\n* Robert Hichens' anonymous satirical novel The Green Carnation.\n* Anthony Hope's novel The Prisoner of Zenda; also his collected sketches The Dolly Dialogues, the first major commission for the illustrator, Arthur Rackham.\n* Rudyard Kipling's story collection The Jungle Book (in book form).\n* The Yellow Book begins publication (April).\nBirths\n* 18 January – Ethel Haythornthwaite, born Ward, environmental campaigner (died 1986)\n* 30 January – Sybil Cholmondeley, Marchioness of Cholmondeley, socialite and aristocrat (died 1989)\n* 10 February – Harold Macmillan, Prime Minister of the United Kingdom (died 1986)\n* 7 March – Frank Halford, aeronautical engineer (died 1955)\n* 5 April – Chesney Allen, entertainer and singer (died 1982)\n* 25 April – Billy Smart Sr., circus owner (died 1966)\n* 2 May – Joseph Henry Woodger, theoretical biologist (died 1981)\n* 4 May - Mary Louisa Avery , mother, grandmother and great grandmother (died 1988)\n* 9 May – Benjamin Graham, born Grossbaum, economist in the United States (died 1976 in France)\n* 1 June – Percival Mackey, pianist, composer and bandleader (died 1950)\n* 6 June – Violet Trefusis, writer and socialite (died 1972)\n* 23 June – King Edward VIII, later Duke of Windsor (died 1972 in France)\n* 26 July – Aldous Huxley, novelist (died 1963)\n* 28 July – Freda Dudley Ward, born Winifred Birkin, socialite (died 1983)\n* 24 August – Elisha Scott, Northern Irish footballer (died 1959)\n* 13 September – J. B. Priestley, novelist and playwright (died 1984)\n* 24 September – Tommy Armour, golfer (died 1968)\n* 1 October – Beatrice Green, labour activist (died 1927)\n* 21 November – Max Miller, born Thomas Sargent, stand-up comedian (died 1963)\n* 24 November – Herbert Sutcliffe, cricketer (died 1978)\n* 7 December – Freddie Adkins, cartoonist (died c. 1986)\n* 10 December – William Sydney Marchant, colonial official (died 1953)\n* 25 December – Xenia Field, councillor, horticulturalist and author (born in India; died 1998)\nDeaths\n* 20 January – Robert Halpin, mariner and cable layer (born 1836)\n* 27 January – Benjamin Waterhouse Hawkins, sculptor and natural history artist (born 1807)\n* 8 February – R. M. Ballantyne, Scottish author of juvenile fiction (born 1825) (dies in Rome)\n* 11 February  – Margaret Henley, inspiration for the name Wendy in Peter Pan (born 1888)\n* 15 February – Martial Bourdin, French anarchist (born 1868) (accidentally kills himself while attempting to blow up the Royal Observatory, Greenwich)\n* 9 April – Arthur Hill Hassall, physician, microbiologist and chemical analyst (born 1817) (dies in Sanremo)\n* 29 April – Augusta Theodosia Drane, religious writer and Catholic prioress (born 1823)\n* 23 May – Brian Houghton Hodgson, civil servant, ethnologist and naturalist (born 1800)\n* 14 June – John Coleridge, 1st Baron Coleridge, Lord Chief Justice (born 1820)\n* 1 September – Boston Corbett, Union Army soldier who shot and killed Abraham Lincoln's assassin, John Wilkes Booth (born 1832)\n* 5 September – Augusta Webster, poet (born 1837)\n* 20 October – James Anthony Froude, historian and religious controversialist (born 1818)\n* 3 December – Robert Louis Stevenson, Scottish author (born 1850) (dies in Samoa)\n* 19 December – James Allen Harker, entomologist (born 1847)\n* 24 December – Frances Buss, pioneer of women's education (born 1827)\n* 29 December – Christina Rossetti, poet (born 1830)\nReferences"
    }
  ]
}