{
  "content": [
    {
      "type": "text",
      "text": "# 1902 Ōtani expedition__disambig_1\n\nThe 1902 Ōtani expedition was a Japanese archaeological expedition to a series of Silk Road sites in the Taklamakan Desert, led by Count Ōtani Kōzui and lasting from 1902 until 1904. The expedition aimed to study the early transmission of Buddhism through Central Asia into China, and conducted major excavations in the Kucha area.\nBackground\nBetween 1900 and 1902, Ōtani, a Buddhist priest, lived in London studying Western theology and came into contact with a number of European explorers including Aurel Stein and Sven Hedin. Hedin had made his first expedition to Tibet in 1893, and had brought back a large number of documents from his second expedition, while Stein had recently completed his first expedition in the Taklamakan Desert. Having learned of the results of these expeditions, Ōtani decided to return to Japan by land via Tibet, with the intent of researching the spread of Buddhism through Central Asia.\nExpedition\nThe expedition consisted of Ōtani, as the lead, and four other Japanese scholars - Honda Eryu, Inoue Koen, Hori Kenyu, and Wanatabe Tesshin. The group met in St. Petersburg in August 1902, and traveled through the Russian Empire to Kashgar in far western China. Here, the group split; Ōtani, Inoue and Honda were to return to Japan via India, while Hori and Wanatabe would remain in Tibet to study ancient sites.\nBoth groups headed along the edge of the Taklamakan Desert to Yarkand, then south-west into the mountains to Tashkurgan. Here, Ōtani's group left to head south through the Mintaka Pass towards India, while the others returned to Yarkand and traveled south and east around the desert to Hotan, where they stopped to excavate historic sites. They crossed the desert to the north, visiting Aksu and Turfan, before turning back to Kashgar. After a short rest, they retraced their steps through Tumxuk and arrived at Kucha, where they set up a base from which to investigate local sites including the Kizil Caves, Kumtura Caves, Duldulokur, and Subashi. After four months at Kucha, they headed eastwards through China to return to Japan.\nThe group focused their work on sites in the Kucha area, as Stein had recently completed research at Khotan, and a German group was still working at Turfan. The Kizil Caves were first discovered and explored in 1902-1904 by Tesshin Watanabe (渡辺哲信) and Kenyu Hori (堀賢雄), funded by Count Otani, but the expedition left hurriedly after four months of exploration in the area of Kucha, following a local earthquake.\nFile:Kizil Caves, Small Ravine, as photogrpahed by the Otani Expedition 1902-1904.jpg|Kizil Caves, Small Ravine (Cave 175-190), as photographed by the Otani Expedition 1902-1904\nFile:Otani Expedition returning from Dunhuang to Holland.jpg|Otani Expedition returning from Dunhuang to Holland\nSubsequent expeditions\nFollowing Ōtani's return to Japan, he succeeded his father as 22nd Abbot of the Nishi Honganji sect. While this greatly limited his own ability to travel, it gave him the opportunity to fund and organize future expeditions. In 1908, Ōtani dispatched a second expedition to the Taklamakan, followed by a third in 1910.\nNotes\nReferences\n*"
    }
  ]
}