{
  "content": [
    {
      "type": "text",
      "text": "# 1914 in the United Kingdom\n\nIreland  Scotland  Wales\n|label2= Sport.\n|data2 =\n1914 English cricket season\nFootball: England  Scotland\n}}\nEvents from the year 1914 in the United Kingdom. This year saw the start of the First World War, ending the Edwardian era.\nIncumbents\n* Monarch – George V\n* Prime Minister – H. H. Asquith (Liberal)\nEvents\n, Secretary of State for Foreign Affairs at the outbreak of war]]\n* January&ndash;February – Leeds rent strike.\n* 20 February – the Fethard-on-Sea life-boat capsizes on service off the County Wexford coast: nine crew are lost.\n* 9 March – the prime minister proposes to allow the Ulster counties to hold a vote on whether or not to join a home rule parliament in Dublin.\n* 10 March – suffragette Mary Richardson damages the Velázquez painting the Rokeby Venus in the National Gallery, London, with a meat cleaver.\n* 15 March – cover price of The Times halved to one penny.\n* 20 March – Curragh incident: British Army officers stationed in Ireland at the Curragh Camp resign their commissions rather than be ordered to resist action by Unionist Ulster Volunteers if the Government of Ireland Act 1914 (\"Third Home Rule Bill\"} is passed by the Parliament of the United Kingdom. The government backs down and they are reinstated.\n* 29 March – Katherine Routledge and her husband arrive in Easter Island to make the first true study of it (departing August 1915).\n* 9 April – showing of the first colour feature film in Britain: The World, the Flesh and the Devil.\n* 11 April – first British performance of George Bernard Shaw's play Pygmalion at His Majesty's Theatre in London.\n* 17 April – suffragette arson attack on Britannia Pier, Great Yarmouth.\n*24–25 April – Larne gun-running: 35,000 rifles and over 3 million rounds of ammunition from a German dealer are landed at Larne, Bangor and Donaghadee for the Unionist Ulster Volunteers.\n* 28 April – suffragette arson attack on the Bath Hotel, Felixstowe.\n* 4 May – suffragette Mary Wood attacks John Singer Sargent's portrait of Henry James at the Royal Academy Summer Exhibition in London with a meat cleaver. At the same exhibition on 12 May, Gertrude Mary Ansell attacks the recently deceased Hubert von Herkomer's portrait of the Duke of Wellington, and on 26 May 'Mary Spencer' (Maude Kate Smith) attacks George Clausen's painting Primavera.\n* 9 May – J. T. (Jack) Hearne becomes the first bowler to take 3000 first-class wickets.\n* 21 May – a women's suffrage march on Buckingham Palace with a petition is thwarted by police.\n* 25 May – the House of Commons of the United Kingdom passes the Irish Home Rule Bill.\n* 30 May\n**  makes her maiden voyage.\n** An explosion at Wharncliffe Silkstone Colliery in the South Yorkshire Coalfield kills 11.\n* 5 June – All Saints' Church, Breadsall, Derbyshire, gutted by fire, blamed on a suffragette arson attack.\n* 23 June\n** The Royal Naval Air Service is established.\n** Kiel Canal is reopened (following deepening) by the Kaiser: visit of the British Fleet under Sir George Warrender; the Kaiser inspects the Dreadnought .\n* 29 June – international exhibition opens at the \"White City\", Ashton Gate, Bristol. It closes on 15 August and the site is used as a military depot.\n* 14 July – the Government of Ireland Bill completes its passage through the House of Lords. It allows Ulster counties to vote on whether or not they wish to participate in Home Rule from Dublin.\n* 18&ndash;20 July – fleet review by the King at Spithead.\n* 21&ndash;24 July – a conference at Buckingham Palace (called by the King on 19 July) fails to resolve differences between Irish unionists and nationalists over Home Rule.\n* 26 July – Howth gun-running: former British civil servant and novelist Erskine Childers and his wife Molly sail into Howth in Ireland in his yacht  and land 2,500 guns for the nationalist Irish Volunteers from a German dealer. Troops of the King's Own Scottish Borderers, returning to Dublin having been called out to assist police in attempting to prevent the Volunteers from moving the arms to the city, perpetrate the Bachelor's Walk massacre, firing on a crowd of protestors at Bachelors Walk, killing three; a fourth man dies later from bayonet wounds and more than 30 others are injured.\n* 31 July – London Stock Exchange closes until 4 January 1915.\n]]\n* 3 August\n** Sir Edward Grey, the Foreign Secretary, makes a speech which encourages the House of Commons to support going to war with Germany. This evening, looking from the Foreign Office windows, he observes, \"The lamps are going out all over Europe; we shall not see them lit again in our lifetime.\"\n** Banks remain closed until 7 August.\n** English language teacher Henry Hadley is shot in an altercation with a Prussian officer on a train at Gelsenkirchen in Germany, dying two days later, just 3 hours after the UK declares war on Germany.\n* 4 August\n** World War I: German invasion of Belgium – At 08:02 (local time) Imperial German Army troops enter Belgium, bringing the July Crisis to a climax. At 23:00 (GMT) the British entry into World War I takes place when the King in London declares war on Germany for this violation of Belgian neutrality (protected by the Treaty of London (1839)) and especially to defend France. This means a declaration of war by the whole British Empire against the German Empire.\n** Admiral Sir John Jellicoe is appointed Commander-in-Chief of the newly designated Grand Fleet, based at Scapa Flow.\n* 5 August – Imperial German Navy minelayer , laying a minefield about  off the Thames Estuary (Lowestoft), is intercepted by the Royal Navy's 3rd Destroyer Flotilla. Destroyer  fires the first British shot of the war (using her 4\" Vickers gun) at her and light cruiser  sinks her, the first German naval loss of the war.\n* 6 August\n**  strikes mines laid by the Königin Luise and is sunk with some loss of life, the first British casualties of the war.\n** , stationed in the West Indies, becomes the first Royal Navy ship to engage with the enemy when she pursues the  (which escapes).\n** Currency and Bank Notes Act gives wartime powers of banknote issue to HM Treasury; the first notes, with the signature of John Bradbury, are issued on 7 August. The sovereign rapidly vanishes from circulation.\n* 8 August\n** First Defence of the Realm Act passed.\n** Sir Ernest Shackleton's Imperial Trans-Antarctic Expedition sets sail on the Endurance from Plymouth in an attempt to cross Antarctica.\n* 9 August – World War I:  rams and sinks German Navy submarine U-15 off Fair Isle, the first U-boat claimed by the Royal Navy.\n* 10 August – all suffragette prisoners released unconditionally.\n* 12 August – World War I: formal declaration of war by the United Kingdom on Austria-Hungary.\n* 13 August – World War I: twelve Royal Aircraft Factory B.E.2 observation aircraft from No. 2 Squadron, Royal Flying Corps, flying from Swingate, Kent, become the first British aircraft to arrive in France to join the British Expeditionary Force.\n* 21 August – World War I: reconnaissance cyclist Private John Parr (aged 17) becomes the first British soldier to be killed by the enemy on the Western Front, at Obourg in Belgium.\n* 22 August – World War I: the British Expeditionary Force reaches Mons. Just after 06:30 British cavalryman Captain Hornby is reputed to have become the first British soldier to kill a German soldier using his sword, and Drummer Edward Thomas of the 4th (Royal Irish) Dragoon Guards is reputed to have fired the British Army's first shot of the War near the Belgian village of Casteau, the first British shot fired in anger in combat on mainland Europe since the Battle of Waterloo 99 years earlier.\n* 23 August – World War I: in the first major action for the British Expeditionary Force, they hold the German forces at the Battle of Mons but then begin a month-long fighting Great Retreat to the Marne.\n* 26 August\n** World War I: The German West African colony of Togoland surrenders to Britain and France.\n** Rutland Boughton's fairy opera The Immortal Hour is first performed in Glastonbury Assembly Rooms at the inaugural Glastonbury Festival co-founded by the socialist composer and opening on 5 August.\n* 28 August – World War I: the Battle of Heligoland – British cruisers under Admiral Beatty sink three German cruisers.\n* 30 August – World War I: \"Amiens Dispatch\" – in a special Sunday edition The Times newspaper publishes the first news of the Great Retreat (from its war correspondent Arthur Moore).\n* August – World War I: the Order of the White Feather is established by Admiral Charles Cooper Penrose-Fitzgerald, RN (retd), in Folkestone, aiming to persuade women to offer white feathers to men not in uniform to shame them into enlisting.\n: London recruiting poster]]\n* September\n** J. R. R. Tolkien writes a poem about Eärendil, the first appearance of his mythopoeic Middle-earth legendarium. Eärendil will much later appear in The Silmarillion. At this time Tolkien is an Oxford undergraduate staying at Phoenix Farm, Gedling near Nottingham.\n** Rumours spread that Russian troops, landed on the east coast of Scotland, have passed on trains through England en route to the Western Front.\n** The Neptune Film Company opens the Neptune Studios (the first \"dark stage\" in England) at Borehamwood in Hertfordshire.\n* 5 September\n** London Agreement: no member of Triple Entente (Britain, France, or Russia) may seek a separate peace with Central Powers.\n** Scout cruiser  is sunk by German submarine U-21 in the Firth of Forth, the first ship ever to be sunk by a locomotive torpedo fired from a submarine.\n** Cover of magazine London Opinion first carries the iconic drawing by Alfred Leete of Lord Kitchener with the recruiting slogan Your Country Needs You.\n* 5&ndash;12 September – World War I: First Battle of the Marne begins: Northeast of Paris, the British Expeditionary Force and the French 6th Army under General Maunoury attack German forces nearing Paris. Over 2 million fight (500,000 killed/wounded) in the Allied victory.\n* 8 September – World War I: Private Thomas Highgate becomes the first British soldier to be executed for desertion during the War, suffering execution by firing squad in France.\n* 13&ndash;28 September – World War I: the First Battle of the Aisne involving British, French forces against those of the German Empire, ending indecisively.\n* 18 September – the Government of Ireland Act, granting home rule to the whole of Ireland, and the Welsh Church Act, disestablishing the Church in Wales, receive royal assent (although George V has contemplated refusing the Irish act) but implementation of both is postponed for the duration of World War I by the simultaneous Suspensory Act. The Government of Ireland Act in practice never comes into effect in its original form, and Welsh disestablishment is deferred until 1920.\n* 20 September – in a speech at Woodenbridge, County Wicklow, John Redmond, leader of the Irish Parliamentary Party, calls on members of the Irish Volunteers to enlist in the National Volunteers as part of the British New Army. The majority do so, fighting in the 10th and 16th (Irish) Division alongside their Ulster Volunteer counterparts from the 36th (Ulster) Division (formed this month); the rump Irish Volunteers split off on 24 September.\n* 22 September – World War I: Action of 22 September 1914: German submarine U-9 torpedoes three Royal Navy armoured cruisers, Aboukir, Cressy and Hogue, with the death of more than 1,400 men, in the North Sea.\n* 8 October – \"Keep the Home Fires Burning\" (music by Ivor Novello; words by Lena Guilbert Ford) is first published (as \"Till the Boys Come Home\") in London.\n* 14 October – World War I: the Canadian Expeditionary Force arrives on 32 ocean liners in Plymouth Sound.\n* 15 October – World War I:  is torpedoed by German submarine U-9 in the North Sea and sinks in less than 10 minutes with the loss of 524 lives.\n* 17 October – London anti-German riots break out in Deptford.\n: aftermath]]\n* 19 October&ndash;22 November – World War I: First Battle of Ypres: British and French forces are victorious against the Germans at Ypres in Belgium.\n* 27 October – World War I: the British super-dreadnought battleship HMS Audacious (23,400 tons), is sunk off Tory Island, north-west of Ireland, by a minefield laid by the armed German merchant-cruiser Berlin, a loss not officially admitted until the end of the war.\n* 30 October – the , requisitioned as a military hospital ship, is lost by grounding in a storm on rocks off Whitby with the loss of 85 lives.\n* 1 November – World War I: Battle of Coronel fought – a Royal Navy squadron commanded by Rear-Admiral Sir Christopher Cradock is met in the eastern Pacific and defeated by superior German forces led by Vice-Admiral Graf Maximilian von Spee in the first British naval defeat of the war, resulting in the loss of HMS Good Hope and HMS Monmouth and 1,660 fatalities (including Cradock).\n* 3 November – World War I: German naval raid on Yarmouth.\n* 5 November – World War I: Britain annexes Cyprus and declares war on the Ottoman Empire.\n* 6 November – World War I: German reservist Carl Hans Lody becomes the first spy to be executed for war treason during the War, suffering execution at dawn by firing squad in the Tower of London, the first execution for treason here since 1747.\n* 11&ndash;24 November – World War I: Battle of Basra results in British Empire forces taking Basra from the Ottoman Empire.\n* 17 November – announcement that income tax is to be doubled as a result of the War.\n* 26 November –  is blown apart by an internal explosion at her moorings on the Medway off Kingsnorth, Kent, killing all but nine of her 805 crew.\nused as a propaganda poster]]\n* 8 December – World War I: the Battle of the Falkland Islands results in a decisive British naval victory over a German squadron.\n* 9 December – the Royal Navy's first aircraft carrier, HMS Ark Royal, is commissioned.\n* 16 December – World War I: German naval raid on Scarborough, Hartlepool and Whitby. 137 are killed by bombardment, mostly civilians, but including the first death of a Kitchener volunteer, Theo Jones.\n* 18 December – Egypt becomes a British protectorate.\n* 21 December – World War I: First bombing raid on Britain when a German floatplane drops bombs in Dover Harbour.\n* 24 December – World War I:\n** British and German soldiers begin an unofficial Christmas truce.\n** Britain's mainland is bombed for the first time when a German floatplane drops a bomb on Dover.\n* 25 December – World War I: Cuxhaven Raid – British aircraft launched from warships attack the German port of Cuxhaven with submarine support, although little damage is caused. A German floatplane flies up the Thames and drops bombs at Cliffe, Kent.\nUnknown dates\n* Official importation of Friesian cattle which is influential in establishing them as an eminent long-living dairy breed in Britain.\n* Rosebuds, later renamed Brownies, established as the youngest section of The Guide Association, run by Agnes Baden-Powell.\n* Jacob Epstein's Vorticist sculpture [http://www.tate.org.uk/art/artworks/epstein-torso-in-metal-from-the-rock-drill-t00340 The Rock Drill] completed.\nPublications\n* Clive Bell's formalist study Art.\n* Laurence Binyon's poem For the Fallen, containing his Ode of Remembrance, first published in The Times 21 September.\n* James Joyce's semi-autobiographical novel A Portrait of the Artist as a Young Man commences serialization in The Egoist (2 February) and his collection of short stories Dubliners is published (June).\n* Arthur Machen's short story The Bowmen, origin of the legend of the Angels of Mons, published in The Evening News (London) 29 September.\n* Elsie J. Oxenham's children's novel Girls of the Hamlet Club, first in the Abbey Series.\n* Robert Tressell's socialist novel The Ragged Trousered Philanthropists (posthumously, 23 April).\n* First issue (of two) of the Vorticist literary magazine BLAST edited by Wyndham Lewis published in June.\n* The Times Literary Supplement published separately for the first time in March.\nIn fiction\n* The action of John Buchan's novel The Thirty-Nine Steps (1915) and Arthur Conan Doyle's Sherlock Holmes story His Last Bow (1917) are both set on the eve of World War I.\nBirths\n* 7 January – Edwin La Dell, artist (died 1970)\n* 8 January – Norman Nicholson, poet (died 1987)\n* 9 January\n** Derek Allhusen, equestrian (died 2000)\n** Christian O'Brien, geologist (died 2001)\n* 13 January – Ted Willis, television dramatist and author (died 1992)\n* 15 January – Hugh Trevor-Roper, Baron Dacre of Glanton, historian (died 2003)\n* 20 January – Roy Plomley, radio broadcaster, producer, playwright and novelist (died 1985)\n* 22 January – Syd Hartley, English association football player (died 1987)\n* 26 January – Kaye Webb, editor and publisher (died 1996)\n* 4 February – Ida Lupino, actress, director and writer (died 1995)\n* 5 February – Alan Hodgkin, scientist, winner of the Nobel Prize in Physiology or Medicine (died 1998)\n* 9 February – Helen Brotherton, conservationist (died 2009)\n* 12 February – Alison Munro, civil servant and headmistress (died 2008)\n* 13 February – Derek Gardner, artist (died 2007)\n* 19 February – Henry Thomas Davies, lifeboatman (died 2002)\n* 20 February – Peter Rogers, film producer (died 2009)\n* 24 February – Ralph Erskine, architect (died 2005)\n* 25 February – John Arlott, cricket commentator and writer (died 1991)\n* 27 February – Pat Fillingham, test pilot (died 2003)\n* 10 March – Michael Torrens-Spence, pilot (died 2001)\n* 12 March – Frank Soo, English footballer and manager (died 1991)\n* 13 March – Olaf Pooley, actor and screenwriter (died 2015)\n* 14 March – Bill Owen, actor (died 1999)\n* 22 March – Donald Stokes, industrialist (died 2008)\n* 2 April – Alec Guinness, actor (died 2000)\n* 5 April – Sheila Callender, physician (died 2004)\n* 7 April – Arthur Hezlet, admiral and historian (died 2007)\n* 12 April – Frances Macdonald, artist (died 2002)\n* 14 April – Michael Maclagan, historian (died 2003)\n* 22 April – C. H. Sisson, writer and poet (died 2003)\n* 26 April – Charlie Chester, comedian (died 1997)\n* 28 April – Philip E. High, science fiction author (died 2006)\n* 10 May – John James, racing driver (died 2002)\n* 13 May – Phil Drabble, country author and television personality (died 2007)\n* 19 May – Max Perutz, Austrian-born molecular biologist (died 2002)\n* 22 May\n** Howard Lawson, cricketer (died 2006)\n** Edward Arthur Thompson, historian (died 1994)\n* 25 May\n** William Gardner, coin designer (died 2000)\n** Toby Low, 1st Baron Aldington, politician (died 2000)\n* 26 May – Geoffrey Unsworth, cinematographer (died 1978)\n* 27 May – Frederick Erroll, 1st Baron Erroll of Hale, politician (died 2000)\n* 28 May – W. G. G. Duncan Smith, World War II pilot (died 1996)\n* 29 May\n** W. S. Barrett, classical scholar (died 2001)\n** Charles Mozley, artist (died 1991)\n* 4 June\n** Edward Evans, actor (died 2001)\n** Alec Skempton, scientist (died 2001)\n* 5 June\n** Felix Aprahamian, music critic (died 2005)\n** Rose Hill, actress and soprano (died 2003)\n* 12 June – John Seymour, author and self-sufficiency campaigner (died 2004)\n* 14 June\n** Sir Peter Hayman, diplomat and paedophile (died 1992)\n** Lena Kennedy, romantic novelist (died 1986)\n* 15 June\n** Louis Edwards, Manchester United Football Club chairman 1965–1980 (died 1980)\n** Morgan Morgan-Giles, admiral and politician (died 2013)\n** Terence Otway, World War II lieutenant-colonel (born in Egypt; died 2006)\n* 20 June – Celia Fremlin, writer of detective fiction (died 2009)\n* 24 June\n** Bernard Braine, politician (died 2000)\n** Pearl Witherington, World War II secret agent (died 2008)\n* 25 June – Mavis Pugh, actress (died 2006)\n* 26 June – Laurie Lee, poet and author (died 1997)\n* 27 June – William Stobbs, illustrator (died 2000)\n* 1 July – Thomas Pearson, Army officer (died 2019)\n* 5 July – Ilija Monte Radlovic, Army officer and author (died 2000)\n* 10 July – Charles Donnelly, poet (died 1937)\n* 14 July – Hubert Gregg, English broadcaster, writer and actor (died 2004)\n* 15 July\n** Hammond Innes, adventure novelist (died 1998)\n** Gavin Maxwell, Scottish naturalist and author (died 1969)\n* 17 July – Paul Brand, doctor and surgeon (died 2003)\n* 19 July – Hubert Gregg, actor and screenwriter (died 2004)\n* 25 July – Winifred Foley, writer (died 2009)\n* 29 July – Abram Games, graphic designer (died 1996)\n* 30 July – Michael Morris, 3rd Baron Killanin, president of the International Olympic Committee (died 1999)\n* 1 August\n** Cecil Allan, Irish footballer (died 2003)\n** W. J. Burley, crime writer (died 2002)\n* 5 August – Bert Millichip, football manager (died 2002)\n* 7 August – Constance Stuart Larrabee, journalist and war correspondent (died 2000)\n* 9 August – Joe Mercer, football manager (died 1990)\n* 10 August – Ken Annakin, film director (died 2009)\n* 19 August – Rose Heilbron, barrister (died 2005)\n* 20 August\n** Levi Fox, archivist and historian (died 2006)\n** Ray Holmes, World War II pilot (died 2005)\n** Colin MacInnes, novelist (died 1976)\n* 22 August – Trevor Leggett, author and translator (died 2000)\n* 30 August – Sydney Wooderson, lawyer and athlete (died 2006)\n* 31 August – Edward “Tap” Gordon Jones, Air Marshal (died 2007)\n* 2 September – George Brown, politician (died 1985)\n* 5 September – Stuart Freeborn, make-up artist (died 2013)\n* 8 September – Denys Lasdun, architect (died 2001)\n* 11 September – Sidney Hart, trade unionist and religious administrator (died 2005)\n* 12 September – Desmond Llewelyn, actor (died 1999)\n* 18 September – Jack Cardiff, cinematographer, director and photographer (died 2009)\n* 19 September – Fraser McLuskey, Church of Scotland minister (died 2005)\n* 20 September – Kenneth More, actor (died 1982)\n* 23 September – Bethsabée de Rothschild, philanthropist and patron of dance (died 1999)\n* 25 September – John Manners, cricketer and naval officer (died 2020)\n* 29 September – Arnold W. G. Kean, civil aviation lawyer (died 2000)\n* 1 October\n**Dan Eley, chemist (died 2015)\n**Stuart Hampshire, philosopher (died 2004)\n* 6 October – Joan Littlewood, theatre director (died 2002)\n* 23 October – George Neil Jenkins, scientist (died 2007)\n* 27 October – Dylan Thomas, Welsh poet and author (died 1953)\n* 28 October – Richard Laurence Millington Synge, chemist, winner of the Nobel Prize in Chemistry (died 1994)\n* 6 November\n**Dorothy Edwards, children's author (died 1982)\n**Leonard Miall, British broadcaster and television personality (died 2005)\n* 7 November – John Welsh, Irish-born actor (died 1985)\n* 8 November – John Nevill, 5th Marquess of Abergavenny, peer (died 2000)\n* 9 November – Alan Caillou, author (died 2006)\n* 12 November – Peter Whitehead, racing driver (died 1958)\n* 13 November – Leonard Appelbee, artist (died 2000)\n* 21 November – Michael Grant, ancient historian (died 2004)\n* 23 November – Roger Avon, actor (died 1998)\n* 24 November – Lynn Chadwick, sculptor (died 2003)\n* 28 November – David Croom-Johnson, judge (died 2000)\n* 29 November – Coleridge Goode, Jamaican-born British jazz bassist (died 2015)\n* 30 November – Charles Hawtrey, comedy actor (died 1988)\n* 3 December – Trevor Foster, rugby union player (died 2005)\n* 12 December\n** Patrick O'Brian, novelist (died 2000)\n** Frank Roper, sculptor (died 2000)\n* 13 December – Alan Bullock, historian (died 2004)\n* 16 December – Norman Blamey, painter (died 2000)\n* 24 December – D. B. H. Wildish, admiral (died 2017)\n* 25 December\n** Barbara Fawkes, nurse (died 2002)\n** Philip John Gardner, soldier and Victoria Cross recipient (died 2003)\n* 28 December – Bernard Youens, actor (died 1984)\n* 29 December – Margaret Hubble, radio presenter (died 2006)\nDeaths\n* 19 January – William Turner, Roman Catholic bishop (born 1844)\n* 21 January – Donald Smith, 1st Baron Strathcona and Mount Royal, Scottish-born Canadian businessman and philanthropist (born 1820)\n* 1 March – Gilbert Elliot-Murray-Kynynmound, 4th Earl of Minto, Viceroy of India (born 1845)\n* 28 March – Robert Fraser, Scottish Roman Catholic bishop (born 1858)\n* 30 March – Rollo Russell, meteorologist and science writer (born 1849)\n* 4 April – Sir Henry Hallam Parr, army officer (born 1847)\n* 19 April – Morton Betts, footballer (born 1847)\n* 2 May – John Campbell, 9th Duke of Argyll, husband of Princess Louise of the United Kingdom (born 1845)\n* 13 May – Isabella Fyvie Mayo, poet and novelist (born 1843)\n* 20 May – George Edward Bond, Medway architect and surveyor (born 1853)\n* 23 May – Gustav Hamel, pioneer aviator (born 1889)\n* 27 May – Sir Joseph Swan, scientist (born 1828)\n* 19 June – Brandon Thomas, actor and playwright (born 1850)\n* 2 July – Joseph Chamberlain, politician (born 1836)\n* 7 August – Charles Davis Lucas, naval officer, Victoria Cross recipient (born 1834)\n* 9 August – Henry Hadley, civilian shot in Germany (born 1863)\n* 16 August – Mary Bird, Anglican missionary (born 1859)\n* 17 August – Sir James Grierson, Scottish-born lieutenant general (of heart aneurism on service in France) (born 1859)\n* 23 October – Edward Wilkinson, Anglican bishop in Africa and Europe (born 1837)\n* 25 October – Charles W. H. Douglas, general (born 1850)\n* 1 November – Christopher Cradock, admiral (killed in action) (born 1862)\n* 5 November – Robert Kekewich, general (suicide) (born 1854)\n* 11 November – A. E. J. Collins, cricketer and soldier (killed in action) (born 1885)\n* 14 November – Frederick Roberts, 1st Earl Roberts of Kandahar, field marshal (born 1832)\n* 9 December – Sir John Bonser, colonial judge, Chief Justice of Ceylon (born 1847)\n* 26 December – Sir Thomas Kelly-Kenny, general (born 1840)\nSee also\n* List of British films before 1920\nReferences"
    }
  ]
}