{
  "content": [
    {
      "type": "text",
      "text": "# 1917 in the United Kingdom\n\nIreland  Scotland  Wales\n|label2= Sport\n|data2 =\n1917 English cricket season\nFootball: England  Scotland\n}}\nEvents from the year 1917 in the United Kingdom. The year was dominated by the First World War.\nIncumbents\n* Monarch – George V\n* Prime Minister – David Lloyd George (Coalition)\nEvents\nrecruitment poster]]\n* January – J. R. R. Tolkien, on medical leave from the British Army at Great Haywood, begins writing The Book of Lost Tales (the first version of The Silmarillion), starting with the \"Fall of Gondolin\"; thus Tolkien's mythopoeic Middle-earth legendarium is first chronicled in prose.\n* 19 January – Silvertown explosion: a blast at a munitions factory in London kills 73 and injures over 400. The resulting fire causes over £2M-worth of damage.\n* 25 January – armed merchantman  is sunk by mines off Lough Swilly with the loss of 354 of the 475 aboard.\n* 26 January – the sea defences at the village of Hallsands, Devon are breached, leading to all but one of the houses becoming uninhabitable.\n* 1 February – Atlantic U-boat Campaign (World War I): Germany announces its U-boats will resume unrestricted submarine warfare, rescinding the 'Sussex pledge'.\n* 2 February – bread rationing introduced.\n* 21 February – Elder Dempster Line troopship  is accidentally rammed by SS Darro off the Isle of Wight, killing 646, mainly members of the South African Native Labour Corps.\n* February – formation of the Women's Land Army, superseding the Women's National Land Service Corps.\n* March – establishment of the Imperial War Cabinet, a body composed of the chief British ministers and the prime ministers of the Dominions (Australia, Canada, New Zealand and South Africa) to set policy.\n* 11 March – World War I: British forces led by Sir Stanley Maude capture Baghdad, the southern capital of the Ottoman Empire.\n* 17 March – World War I: Action of 17 March 1917 – German warships attack British naval patrols off the Goodwin Sands (sinking ) and shell Ramsgate and Margate.\n* 26 March – World War I: First Battle of Gaza – British cavalry troops retreat after 17,000 Turks block their advance.\n* 28 March – the Women's Army Auxiliary Corps begins recruiting.\n* 5 April – Food Hoarding Order issued to prevent households from hoarding food in short supply.\n* 20–21 April – World War I: Second Battle of Dover Strait: German torpedo boats raid the Dover Barrage.\n* 6/7 May – World War I: bomb dropped on London by a fixed-wing aircraft (one death).\n* 25 May – World War I: first daylight bombing raid on the UK by fixed-wing aircraft: 95 killed in Folkestone area.\n* 4 June – the Most Excellent Order of the British Empire is established as an order of chivalry by George V under letters patent.\n* 7 June – World War I: Battle of Messines in Flanders opens with the British Army detonating 19 ammonal mines under the German lines, killing 10,000 in the deadliest deliberate non-nuclear man-made explosion in history, which can be heard in London.\n* 13 June\n** World War I: daylight bombing raid on London by fixed-wing aircraft: 162 killed.\n** Ashton-under-Lyne munitions explosion: 43 killed.\n* 1–7 July – first National Baby Week, a campaign for improved infant health.\n* 9 July – HMS Vanguard is blown apart by an internal explosion at her moorings in Scapa Flow, Orkney, killing an estimated 843 crew with no survivors.\n* 17 July\n** King George V issues a Proclamation stating that the male line descendants of the British royal family will bear the surname Windsor.\n** Winston Churchill is appointed Minister of Munitions.\n* 31 July&ndash;10 November – World War I: Battle of Passchendaele (\"Third Battle of Ypres\"): Allied offensive in Flanders.\n* July – first Cottingley Fairies photographs taken, apparently depicting fairies; a hoax not admitted by the child creators until 1981\n* 1 August – Women's Forestry Service under Miss Rosamond Crowdy instituted under the Timber Supply Department of the Board of Trade.\n* 2 August – Squadron Commander E. H. Dunning becomes the first pilot to land his aircraft on a ship when he lands his Sopwith Pup on  in Scapa Flow but is killed five days later during another landing on the ship.\n* 17 August – one of English literature's most important and famous meetings takes place when Wilfred Owen introduces himself to Siegfried Sassoon at Craiglockhart War Hospital in Edinburgh. Owen's war poems \"Anthem for Doomed Youth\" and \"Dulce et Decorum est\" are written at this time.\n* 21 August – most provisions of Corn Production Act 1917 come into force. This guarantees minimum prices for wheat and oats and specifies a minimum wage for agricultural workers.\n* 12 September – Gay Crusader completes the English Triple Crown by finishing first in the Derby, 2,000 Guineas and St. Leger, the latter being run as the September Stakes at Newmarket because of the war.\n* 17 September – Constance Coltman becomes the first English woman ordained as a Christian minister in a mainstream denomination, the Congregational Church, at the King's Weigh House church in London.\n* 1–4 October – White Lund explosions: blasts at National Filling Factory No. 13, a munitions works near Morecambe, kill 10.\n* 5 October – Sir Arthur Lee donates the country house Chequers (in Buckinghamshire) to the nation; it is to be used as an official country residence for the Prime Minister, the first recognition in law that such an office exists.\n* 19 October – World War I: Last major German Zeppelin raids: 11 airships spread across the country, killing 36 people, but 5 of the craft are lost on their return.\n* November – World War I: Some British troops are moved to the Italian Front.\n* 2 November – Foreign Secretary Arthur Balfour makes the Balfour Declaration proclaiming British support for establishment of a homeland for the Jewish people in Palestine.\n* 7 November – World War I: Third Battle of Gaza ends – British forces capture Gaza from the Ottoman Empire.\n* 16 November – British troops occupy Tel Aviv and Jaffa in Palestine.\n* 17 November – People's Dispensary for Sick Animals established by Maria Dickin.\n* 20 November – World War I: Battle of Cambrai begins – British forces make early progress in an attack on German positions but are soon beaten back.\n* 29 November – Women's Royal Naval Service established.\n* 6 December – U.S. Navy destroyer  is torpedoed and sunk in the Atlantic Ocean south west of the British Isles by German submarine , killing 66 crew in the first significant American naval loss of the war and first ever U.S. destroyer loss to an enemy. Survivors are rescued by British craft.\n* 11 December – World War I: Battle of Jerusalem – General Edmund Allenby leads units of the British Egyptian Expeditionary Force into Jerusalem on foot following the Ottoman Empire's surrender of the city.\n* 25 December – Dick, Kerr's Ladies F.C. plays its first match, in Preston, Lancashire.\n* 31 December – World War I: British government imposes rationing of sugar (8 oz per person per week).\nUndated\n* Nuclear fission: Ernest Rutherford (at the Victoria University of Manchester) achieves nuclear transmutation, the first observation of a nuclear reaction, in which he also discovers and names the proton.\n* Announced 12 November 1918; presented 1 June 1920 – Charles Glover Barkla wins the 1917 Nobel Prize in Physics \"for his discovery of the characteristic Röntgen radiation of the elements.\"\nPublications\n* The anthology of British war poetry The Muse in Arms.\n* Joseph Conrad's novella The Shadow-Line (in book form).\n* Arthur Conan Doyle's Sherlock Holmes short story collection His Last Bow.\n* T. S. Eliot's poems Prufrock, and other observations.\n* Robert Graves' poems Fairies and Fusiliers.\n* Ivor Gurney's poems Severn and Somme.\n* Daniel Jones's An English Pronouncing Dictionary.\n* Siegfried Sassoon's The Old Huntsman, and Other Poems.\n* Edward Thomas's posthumous collection Poems (including \"Adlestrop\").\n* Alec Waugh's controversial semi-autobiographical novel of life in a boys' school The Loom of Youth.\n* P. G. Wodehouse's short story collection The Man with Two Left Feet.\n* W. B. Yeats's poetry collection The Wild Swans at Coole.\nBirths\n* 1 January – Celia Whitelaw, Viscountess Whitelaw, noblewoman, horticulturist and philanthropist (died 2011)\n* 4 January – Maurice Wohl, philanthropist (died 2007)\n* 5 January – Lucienne Day, textile designer (died 2010)\n* 9 January – Claud William Wright, civil servant and scientific expert (died 2010)\n* 12 January\n** Stella Cunliffe, statistician (died 2012)\n** John Rennie, diplomat (died 2002)\n* 16 January\n** Leila Buckley, poet, novelist and translator (died 2013)\n** Bill Lucas, British RAF officer, Olympic long-distance runner (d. 2018)\n* 19 January\n** Graham Higman, mathematician (died 2008)\n** Nigel Nicolson, writer and politician (died 2004)\n* 22 January – Guy Millard, diplomat (died 2013)\n* 27 January – Tufton Beamish, Baron Chelwood, army officer and politician (died 1989)\n* 1 February – Maurice Levitas, academic and communist (died 2001)\n* 2 February – Mary Ellis, pilot (died 2018)\n* 5 February\n** Ruth Mott, television cook (died 2012)\n** Cedric Smith, statistician (died 2002)\n* 12 February – Denis Eadie, Scottish World War II army officer and Military cross recipient (died 2015)\n* 18 February – Arthur Norman, industrialist (died 2011)\n* 20 February – Frederick Page, aircraft designer (died 2005)\n* 22 February – Jocelyn Herbert, stage designer (died 2003)\n* 25 February – Anthony Burgess, author (died 1993)\n* 1 March – Tom Keating, artist and art forger (died 1984)\n* 2 March\n** Laurie Baker, architect (died 2007)\n** John Gardner, composer (died 2011)\n* 6 March – Frankie Howerd, comedian and actor (died 1992)\n* 7 March – Reginald Maudling, politician (died 1979)\n* 10 March – Kenneth Boyd Fraser, virologist (died 2001)\n* 12 March – Googie Withers, actress (died 2011)\n* 13 March – Robert Mark, police officer (died 2010)\n* 14 March – Alan Smith, World War II spitfire fighter ace (died 2013)\n* 20 March\n** Vera Lynn, singer (died 2020)\n** Mona Moore, painter and illustrator (died 2000)\n* 22 March\n** W. Brian Harland, geologist (died 2003)\n** Paul Rogers, actor (died 2013)\n* 23 March\n** Patricia Burke, actress and singer (died 2003)\n** Josef Locke, born Joseph McLaughlin, Irish tenor (died 1999)\n* 24 March – John Kendrew, molecular biologist, recipient of the Nobel Prize in Chemistry (died 1997)\n* 25 March – Allan Cameron, Scottish soldier and curler (died 2011)\n* 29 March – Ieuan Maddock, Welsh nuclear scientist (died 1988)\n* 30 March – Alec Stock, footballer (died 2001)\n* 1 April – Michel Donnet, military officer and RAF wing commander (died 2013)\n* 4 April – Peter Olver, World War II fighter ace (died 2013)\n* 6 April – Leonora Carrington, surrealist painter and fiction writer working in Mexico (died 2011)\n* 9 April – Basil Mitchell, philosopher (died 2011)\n* 13 April\n** William Burley Lockwood, linguist (died 2012)\n** Olivia Robertson, religious leader (died 2013)\n* 14 April\n** Richard Chopping, illustrator (died 2008)\n** Jean Wilks, educator and headmistress (died 2014)\n* 22 April – Leo Abse, lawyer and politician (died 2008)\n* 23 April Bill Green, fighter pilot (died 2014)\n* 29 April – Shirley Becke, police officer (died 2011)\n* 1 May – Wendy Toye, dancer and actress (died 2010)\n* 4 May – C. K. Barrett, theologian (died 2011)\n* 6 May – Paul Weatherley, botanist (died 2001)\n* 7 May – David Tomlinson, actor (died 2000)\n* 11 May – Montague Woodhouse, politician (died 2001)\n* 12 May – Rita Barisse, writer and translator (died 2001)\n* 14 May\n** Geoffrey E. Coates, organometallic chemist (died 2013)\n** W. T. Tutte, English-born mathematician and cryptanalyst (died 2002)\n* 18 May – Dorrit Dekk, Czech-born graphic designer (died 2014)\n* 20 May – Ann Welch, glider pilot (died 2002)\n* 21 May – Frank Bellamy, comics artist (died 1976)\n* 24 May\n** Ian Russell, 13th Duke of Bedford, peer (died 2002)\n** Alan Campbell, Baron Campbell of Alloway, life peer, politician and judge (died 2013)\n* 4 June – John Walter Baxter, civil engineer (died 2003)\n* 9 June – Eric Hobsbawm, historian (died 2012)\n* 10 June – Ruari McLean, Scottish typographer (died 2006)\n* 15 June – Charles Chilton, writer, producer and presenter (died 2013)\n* 21 June – Leslie Shepard, author and archivist (died 2004)\n* 23 June\n** Peter Brunt, ancient historian (died 2005)\n** Tony Deane-Drummond, army general (died 2012)\n** Frank Godwin, film producer (died 2012)\n* 24 June\n** Joan Clarke, cryptanalyst and numismatist (died 1996)\n** John Willett, translator (died 2002)\n* 25 June – Arthur Bonsall, civil servant (died 2014)\n* 26 June – Willie Hamilton, politician (died 2000)\n* 29 June – Mary Berry, canoness, choral conductor and musicologist (died 2008)\n* 1 July – Humphry Osmond, psychiatrist (died 2004)\n* 5 July – Geraldine Mucha, Scottish composer (died 2012)\n* 8 July – Pamela Brown, English actress (died 1975)\n* 10 July – Reg Smythe, cartoonist (died 1998)\n* 14 July – Frank Vigar, English cricketer (died 2004)\n* 17 July – John Beech Austin, aviator (died 2012)\n* 20 July – Harold Faragher, English cricketer (died 2006)\n* 23 July – John Stokes, politician (died 2003)\n* 27 July – John Cunningham, World War II pilot and air ace (died 2002)\n* 29 July – Jake Saunders, banker (died 2002)\n* 6 August – Nigel Walker, criminologist (died 2014)\n* 13 August – Diana Collins, activist (died 2003)\n* 14 August – Cardew Robinson, comic actor (died 1992)\n* 22 August – Kent Walton, sports commentator (died 2003)\n* 24 August – Charles Causley, poet (died 2003)\n* 29 August – John King, Baron King of Wartnaby, businessman (died 2005)\n* 30 August – Denis Healey, politician and author (died 2015)\n* 31 August – Hugh McGregor Ross, computer scientist and theologian (died 2014)\n* 3 September – Anthony Robert Klitz, artist (died 2000)\n* 7 September\n** Leonard Cheshire, RAF pilot (died 1992)\n** John Cornforth, Australian-born chemist (died 2013)\n** Johnnie Stewart, television presenter (died 2005)\n* 13 September\n** Osgood Hanbury, flying ace (killed in action 1943)\n** Frank Thewlis, Methodist preacher (died 1990)\n* 15 September – Richard Arnell, composer (died 2009)\n* 18 September – Phil Taylor, footballer and manager (died 2012)\n* 30 September – Peter Malam Brothers, flying ace (died 2008)\n* 2 October\n** Christian de Duve, biologist, recipient of the Nobel Prize in Physiology or Medicine (died 2013)\n** Francis Jackson, organist and composer (died 2022)\n* 4 October – Paul Hogarth, artist and illustrator (died 2001)\n* 8 October\n** Edward Eveleigh, judge and barrister (died 2014)\n** Rodney Robert Porter, biochemist, recipient of the Nobel Prize in Physiology or Medicine (died 1985)\n** George Webb, jazz musician (died 2010)\n* 10 October\n** David Lloyd Owen, army general (died 2001)\n** John Stanton Ward, artist (died 2007)\n* 13 October – Denis Forman, Scottish television executive (died 2013)\n* 18 October – William Clark, Baron Clark of Kempston, politician (died 2004)\n* 20 October – Daphne Hardy Henrion, sculptor (died 2003)\n* 21 October\n** Ralph Barker, writer (died 2011)\n** Geoffrey Langlands, officer and educator (died 2019)\n* 22 October\n** Lord Michael Fitzalan-Howard, soldier and courtier (died 2007)\n** Joan Fontaine, film actress in Tokyo (died 2013 in the United States)\n* 25 October – Don Clark, footballer (died 2014)\n* 28 October – Honor Frost, underwater archaeologist (died 2010)\n* 7 November\n** Johnnie Stewart, television producer (died 2005)\n** Tom Tuohy, chemist (died 2008)\n* 12 November – Leila Berg, children's author (died 2012)\n* 15 November – E. J. Mishan, economist (died 2014)\n* 16 November – John Forfar, Scottish paediatrician and academic (died 2013)\n* 21 November – Bill Cross, World War II soldier (died 2015)\n* 22 November\n** Andrew Huxley, scientist, recipient of the Nobel Prize in Physiology or Medicine (died 2012)\n** Shabtai Rosenne, English-born Israeli diplomat and recipient of the Israel Prize (died 2010)\n* 24 November – John Justin, actor (died 2002)\n* 25 November – William \"Bill\" Ralph Merton, military scientist and banker (died 2014)\n* 28 November – Marni Hodgkin, American-born book editor (died 2015)\n* 29 November – Pamela Rose, actress and Bletchley Park indexer (died 2021)\n* 30 November – Bill Ash, American-born writer and broadcaster (died 2014)\n* 6 December – Tony Hibbert, army officer (died 2014)\n* 9 December – Eleanor Mears, medical practitioner and campaigner (died 1992)\n* 12 December – Fred Stansfield, Welsh footballer (died 2014)\n* 15 December – Douglas Allen, Baron Croham, politician and civil servant (died 2011)\n* 16 December\n** Arthur C. Clarke, science fiction author and inventor (died 2008)\n** Jasper Hollom, banker (died 2014)\n* 20 December – Billy Drake, World War II fighter pilot (died 2011)\n* 21 December – Diana Athill, author (died 2019)\n* 22 December – Freddie Francis, cinematographer (died 2007)\n* 24 December – Edward Crew, World War II air ace (died 2002)\n* 27 December – Derek Hodgkinson, air chief marshal (died 2010)\n* 28 December – John Moreton, diplomat (died 2012)\nDeaths\n* 2 January – Sir Edward Burnett Tylor, anthropologist (born 1832)\n* 8 January – Sir George Warrender, 7th Baronet, admiral (born 1860)\n* 29 January – Evelyn Baring, 1st Earl of Cromer, diplomat and colonial administrator (born 1841)\n* 14 March – Princess Louise Margaret of Prussia (Duchess of Connaught and Strathearn), member of the royal family (born 1860)\n* 19 March – Samuel Pasco, United States Senator from Florida from 1887 to 1899 (born 1834)\n* 25 March – John George Will, Scottish international rugby player (killed in action) (born 1892)\n* 2 April – Bryn Lewis, Wales international rugby player (killed in action) (born 1891)\n* 9 April – Edward Thomas, poet (killed in action) (born 1878)\n* 13 May – Sir Lambton Loraine, 11th Baronet, naval officer (born 1838)\n* 16 May – Robert Sandilands Frowd Walker, colonial administrator (born 1850)\n* 18 May – John Nevil Maskelyne, stage magician (born 1839)\n* 26 June – John Dunville, Army officer (killed in action) (born 1896)\n* 3 July – Basil Temple Blackwood, lawyer and book illustrator (killed in action) (born 1870)\n*31 July\n**Ellis Humphrey Evans (\"Hedd Wyn\"), Welsh-language poet (killed in action) (born 1887)\n**James Llewellyn Davies, Victoria Cross recipient (killed in action) (born 1886)\n**James Milne Henderson, Scottish international rugby player (killed in action) (born 1891)\n**Francis Ledwidge, Irish poet (killed in action) (born 1887)\n* 7 August – Edwin Harris Dunning, aviator (born 1892)\n* 15 August – Thomas Crisp, Victoria Cross recipient (born 1876)\n* 30 August – Alan Leo, astrologer (born 1860)\n* 8 November – Colin Blythe, cricketer (born 1879)\n* 8 December – Arthur Matthew Weld Downing, astronomer (born 1850)\n*14 December – Phil Waller, Wales and British Lions rugby player (killed in action) (born 1889)\n*17 December – Elizabeth Garrett Anderson, doctor and suffragist (born 1836)\nSee also\n* List of British films before 1920\nReferences"
    }
  ]
}