{
  "content": [
    {
      "type": "text",
      "text": "# 1918 War Honours (New Zealand)\n\nThe 1918 War Honours in New Zealand were appointments by King George V to the Order of the British Empire to recognise services in or for New Zealand in connection with World War I. They were announced on 4 October 1918.\nThe recipients of honours are displayed here as they were styled before their new honour.\nOrder of the British Empire\nKnight Grand Cross (GBE)\n* His Excellency The Right Honourable Sir Arthur William de Brito Savile Foljambe, Earl of Liverpool  – Governor-General and Commander-in-Chief of the Dominion.\nLord of Liverpool.jpg|Earl of Liverpool\nCommander (CBE)\n* Colonel Ralph Anderson Chaffey – of Christchurch; officer commanding Canterbury Military District.\n* The Honourable George Fowlds – of Auckland. For work in connection with various patriotic undertakings.\n* Ellen, Countess of Hardwicke – of London. For work in connection with New Zealand War Contingent Association.\n* Lieutenant-Colonel Thomas Anderson Hunter – of Wellington; director of dental services, New Zealand Military Forces.\n* Helen Mackenzie – of London; joint secretary, New Zealand War Contingent Association.\n* Colonel Joseph Cowie Nichols – of Dunedin; officer commanding Otago Military District.\nFile:George Fowlds, ca 1910.jpg|George Fowlds\nFile:Thomas Anderson Hunter 1905 (cropped).jpg|Thomas Hunter\nOfficer (OBE)\n* Jane Ann Bean – of Christchurch. For services in connection with the Countess of Liverpool Fund for the New Zealand Expeditionary Force.\n* William Edward Bidwill – of Featherston. For patriotic work.\n* Alice Australia Gertrude Buckleton – of Auckland. For services in connection with patriotic work.\n* Etta Close – of London. For services in providing comforts for New Zealand officers in London.\n* George Elliot – of Auckland. For services in connection with patriotic funds.\n* Agnes Dyke Empson – of London. For services in connection with New Zealand War Contingent Association.\n* James Arthur Flesher – of Christchurch. For services in connection with the New Zealand branch of the British Bed Cross Society and Order of St John.\n* George Harper – of Christchurch. For services in connection with the Citizens' Defence Corps.\n* Lieutenant-Colonel Arthur Stanley Herbert – New Zealand Medical Corps. For special services in connection with military hospitals at Rotorua.\n* Elizabeth Ann Hill – of Christchurch. For services in connection with the New Zealand Branch of the British Red Cross Society and Order of St John.\n* Henry Charles Hodder – of Wellington; New Zealand commissioner, Salvation Army. For patriotic services.\n* The Reverend Vincent George Bryan King – of Dunedin. For services in connection with the New Zealand branch of the British Ked Cross Society and Order of St John.\n* Ripeka Wharawhara Love – of Petone. For services in connection with the Maori Expeditionary Force Funds.\n* Edith Mary Macfarlane – of Auckland. For services in connection with patriotic work.\n* Alfred Henry Miles – of Wellington. For services in connection with advising the New Zealand Munitions and Supplies Board.\n* Jessie Matilda Moorhouse – of Wellington. For work in connection with the New Zealand branch of the British Red Cross Society and Order of St John.\n* Rahera Muriwai Mutu – of Kaiapoi. For services in connection with the Maori Expeditionary Force Funds.\n* Ellen Laura Amy Rhodes – of Christchurch. For services in connection with sick and wounded soldiers.\n* Frances Cochrane Rattray – of Dunedin. For services in connection with the New Zealand branch of the British Red Cross Society and Order of St John.\n* Leonard Owen Howard Tripp – of Wellington. For services in connection with patriotic funds.\n* Grace Anna Mary Wood – of Christchurch. For services in connection with the Women's National Reserve.\nFile:Sir George Elliot NZ.jpg|George Elliot\nFile:James Arthur Flesher.jpg|James Flesher\nFile:George Harper (portrait).jpg|George Harper\nFile:Ripeka Love (cropped).jpg|Ripeka Love\nFile:EdithMaryMacfarlane1918.png|Edith Macfarlane\nMember (MBE)\n* Constance Palgrave Abraham – of Palmerston North. For services in connection with the New Zealand branch of the British Red Cross Society and Order of St John.\n* Alfred Seymour Bankart – of Auckland. For services in connection with patriotic funds.\n* Thyra Talvase Bethell – of Amuri. For services in connection with the New Zealand branch of the British Red Cross Society and Order of St John.\n* Annie Sanetta Boden – of Wellington. For patriotic work on behalf of soldiers.\n* Louisa Bollard – of Tamahere. For patriotic work.\n* Elizabeth Chilton – of Christchurch. For services in connection with the Countess of Liverpool Fund for the New Zealand Expeditionary Force.\n* Robert Conn – of Dunedin. For services in connection with the New Zealand branch of the British Red Cross Society and Order of St John.\n* Alice Maude Corry – of Blenheim. For services in connection with the Countess of Liverpool Fund for the New Zealand Expeditionary Force.\n* Jane Duthie Crooke – of New Plymouth. For services in connection with the New Zealand branch of the British Red Cross Society and Order of St John.\n* Ada Maud Donaldson – of Waihi. For services in connection with the New Zealand branch of the British Red Cross Society and Order of St John.\n* Ellen Kent Findlay – of Wellington; treasurer of the Countess of Liverpool Fund for the New Zealand Expeditionary Force.\n* Marion Galbraith – of Ashburton. For services in connection with the New Zealand branch of the British Red Cross Society and Order of St John.\n* William Henry Harrison George – of Wellington. For patriotic work in connection with the Young Men's Christian Association.\n* Helen Graham – of Te Kūiti. For services in connection with the New Zealand branch of the British Red Cross Society and Order of St John.\n* Margaret Isabella Grimmond – of Ross. For services in connection with the New Zealand branch of the British Red Cross Society and Order of St John.\n* Jessie Hill – of Rotorua. For services in connection with the New Zealand branch of the British Red Cross Society and Order of St John, and in connection with the Countess of Liverpool Fund for the New Zealand Expeditionary Force.\n* Jane Winfield Lee – of Oamaru. For patriotic work.\n* Esther Georgina Lock – of Nelson. For services in connection with the New Zealand branch of the British Red Cross Society and Order of St John, and in connection with the Countess of Liverpool Fund for the New Zealand Expeditionary Force.\n* Mabel Jane MacGibbon – of Gore. For services in connection with the New Zealand branch of the British Red Cross Society and Order of St John.\n* Isobelle Mary Agnes Mackay – of Wanganui. For services in connection with the New Zealand branch of the British Red Cross Society and Order of St John.\n* Jessie Mackenzie – of Masterton. For services in connection with patriotic societies.\n* Emily Herbert Maguire – of Auckland. For services in connection with the New Zealand branch of the British Red Cross Society and Order of St John.\n* Erina Mete – of Awanui. For services in connection with the Maori Expeditionary Force Fund.\n* Cecilia Margaret Morris – of Reefton. For services in connection with the Countess of Liverpool Fund for the New Zealand Expeditionary Force.\n* Hannah Murphy – of Wellington. For services in connection with the Countess of Liverpool Fund for the New Zealand Expeditionary Force.\n* Sybil Caroline Nathan – of Wellington. For services in connection with the New Zealand branch of the British Red Cross Society and Order of St John.\n* Helen Young Petrie – of Milton. For services in connection with the New Zealand branch of the British Red Cross Society and Order of St John.\n* Mary Raymond – of Timaru. For services in connection with the New Zealand branch of the British Red Cross Society and Order of St John.\n* Joan Leslie Reeve – of Gisborne. For services in connection with the Countess of Liverpool Fund for the New Zealand Expeditionary Force.\n* Maggie Robin – of Wellington. For services in connection with the Countess of Liverpool Fund for the New Zealand Expeditionary Force.\n* Robert William Shallcrass – of Wellington. For patriotic work.\n* Charles Bowtell Smith – of Dunedin. For services in connection with the New Zealand branch of the British Red Cross Society and Order of St John.\n* Mary Euphemia Roseborough Smith – of Christchurch. For services in connection with the Countess of Liverpool Fund for the New Zealand Expeditionary Force.\n* George Vesey Stewart – of Katikati. For patriotic work.\n* Riria Thompson – of Whakatāne. For services in connection with the Maori Expeditionary Force Fund.\n* William Archibald Tripe – of Wellington. For services in connection with the Countess of Liverpool Fund for the New Zealand Expeditionary Force.\n* Charlotte Sarah Ward – of Tauranga. For patriotic work.\n* Violet Helen Webster – of Pukekohe. For services in connection with the New Zealand branch of the British Red Cross Society and Order of St John.\n* Howitt Key Wilkinson – of Dunedin. For patriotic work in connection with the Young Men's Christian Association.\n* Helen Lucy Williams – of Dunedin. For services in connection with the New Zealand branch of the British Red Cross Society and Order of St John.\nFile:Sir Alfred Bankart.jpg|Alfred Bankart\nFile:George Vesey Stewart.jpg|George Vesey Stewart\nReferences"
    }
  ]
}