{
  "content": [
    {
      "type": "text",
      "text": "# 1925 in the United Kingdom\n\nNorthern Ireland  Scotland  Wales\n|label2= Popular culture\n|data2 =\n1925 English cricket season\nFootball: England  Scotland\n1925 in British radio\n1925 in British music\n}}\nEvents from the year 1925 in the United Kingdom.\nIncumbents\n* Monarch – George V\n* Prime Minister – Stanley Baldwin (Conservative)\nEvents\n* January – Construction of the Royal Tweed Bridge in Berwick-upon-Tweed begins.\n* February – The statue of Eros is taken away from Piccadilly Circus in London so that the new Underground station can be built. It will not return until 1931.\n* 9 March–1 May – Pink's War: The British Royal Air Force bombards mountain strongholds of Mahsud tribesmen in South Waziristan.\n* 9 April – Administration of Estates Act abolishes the legal rule of primogeniture in England and Wales and the remnants of gavelkind in Kent; Law of Property Act modernises the law relating to real estate (both Acts come into effect 1 January 1926).\n* 28 April – Presenting the Baldwin ministry's budget, Chancellor of the Exchequer Winston Churchill announces Britain's return to the gold standard (the gold bullion standard rather than the specie standard).\n* 1 May – Cyprus becomes a Crown Colony.\n* 29 May – Last communication from the British explorer Percy Fawcett, a telegram to his wife, before he disappears in the Amazon.\n* 10 June – Dibbles Bridge coach crash: a tour coach runs away following brake failure and falls off a bridge near Hebden, North Yorkshire, en route to Bolton Abbey, killing seven passengers.\n* 1–30 June – The second-driest month in the EWP series (and driest of twentieth century) with an average rainfall of only .\n* 27 July – The British Broadcasting Company's Daventry transmitting station on Borough Hill, Daventry in central England opens as the world's first longwave broadcast radio transmitter, taking over from its Chelmsford facility.\n* 31 July – Red Friday: the Government announces that it will grant a subsidy to the coal industry for nine months to maintain existing wage levels while a Royal Commission conducts an inquiry into the industry's problems.\n* 5 August – Establishment of political party Plaid Genedlaethol Cymru, initially focussing on Welsh language issues.\n* 7 August\n** Honours (Prevention of Abuses) Act 1925 passed in the aftermath of Lloyd George's sale of peerages and other honours for political party funds.\n** National Library of Scotland established by Act of Parliament to take over the national responsibilities of the Advocates' Library in Edinburgh.\n* 2 October – In London:\n** John Logie Baird successfully transmits the first television pictures with a greyscale image.\n** The city's first double-decker buses with covered top decks are introduced.\n* 29 October – Observer Corps established as a volunteer civil defence organisation for the visual detection, identification, tracking and reporting of raids by aircraft over Britain.\n* 2 November – Eigiau Dam disaster kills seventeen in the North Wales village of Dolgarrog.\n* 3 November – Alfred Hitchcock's first (silent) film, The Pleasure Garden, completed (but not released in the UK until 16 January 1927).\n* 7 November – The Morning Post, a Conservative London newspaper, publishes a leaked report of the Irish Boundary Commission's (limited) proposals for altering the border between the Irish Free State and Northern Ireland, which are contrary to the Free State's view; publication effectively ends the work of the commission.\n* 12 November – Submarine  sinks in the English Channel after collision with a civilian surface vessel with the loss of all 69 hands.\n* 16 November – Carmaker Vauxhall Motors of Luton is purchased by American giant General Motors for $2.5 million.\n* 1 December – Locarno Treaties signed in London. The United Kingdom is a joint guarantor of the boundaries of Belgium, France and Germany.\n* 3 December – A settlement on the boundary question between the Irish Free State and Northern Ireland is presented in London. Controversially, there is no change to the border, in exchange for the Free State's liability for service of the U.K. public debt in respect of war pensions being dropped. The agreement is approved during this month by the U.K. and Free State legislatures.\n* 10 December – Austen Chamberlain wins the Nobel Peace Prize for his work on the Locarno Pact.\n* 16 December – Construction of the Queensway Tunnel beneath the River Mersey begins.\nUndated\n* Clough Williams-Ellis begins construction of Portmeirion in North Wales.\n* American newspaper magnate William Randolph Hearst buys the medieval St Donat's Castle in the Vale of Glamorgan.\nPublications\n* Elinor Brent-Dyer's schoolgirl story The School at the Chalet, first in the Chalet School series.\n* G. K. Chesterton's book The Everlasting Man.\n* Agatha Christie's novel The Secret of Chimneys.\n* Warwick Deeping's novel Sorrell and Son.\n* T. S. Eliot's poem \"The Hollow Men\".\n* Aldous Huxley's novel Those Barren Leaves.\n* Margaret Kennedy's novel The Constant Nymph.\n* Virginia Woolf's novel Mrs. Dalloway.\nBirths\n* 3 January – Jill Balcon, actress (died 2009)\n* 7 January – Gerald Durrell, naturalist, zookeeper, author and television presenter (at Jamshedpur, India) (died 1995)\n* 8 January – James Saunders, playwright (died 2004)\n* 13 January – David Francis Clyde, physician (died 2002)\n* 19 January – Nina Bawden, writer (died 2012)\n* 24 January – Owen Maddock, racing car designer (died 2000)\n* 26 January\n** Desmond Cassidi, admiral (died 2019)\n** David Jenkins, Anglican bishop (died 2016)\n* 31 January – Fred Brown, virologist (died 2004)\n* 2 February – David Whitfield, actor and singer (died 1980)\n* 3 February – John Gingell, air marshal (died 2009)\n* 11 February – Peter Berger, admiral (died 2003)\n* 13 February – Stuart Wagstaff, English-Australian actor (died 2015)\n* 10 February – Joseph McKeown, photojournalist (died 2007)\n* 12 February – Anthony Berry, British Conservative politician (murdered by IRA terrorists in the Brighton hotel bombing 1984)\n* 17 February – Ron Goodwin, composer and conductor (died 2003)\n* 28 February\n** Harry H. Corbett, actor (died 1982)\n**Billy March, footballer (died 1974)\n* 4 March – Alan R. Battersby, organic chemist (died 2018)\n* 7 March – Richard Vernon, actor (died 1997)\n* 11 March – Peter R. Hunt, film director (died 2002)\n* 14 March – John Jacobs, English golfer (died 2017)\n* 15 March – Francis Dennis Ramsay, portrait painter (died 2009)\n* 20 March – Billy Elliott, footballer (died 2008)\n* 21 March\n** Peter Brook, theatre and film director (died 2022)\n** Ronald Whittam, scientist (died 2023)\n* 23 March – David Watkin, cinematographer (died 2008)\n* 24 March – Bill Nankeville, Olympic middle distance runner (died 2021)\n* 25 March – Anthony Quinton, philosopher (died 2010)\n* 26 March\n**Ted Graham, Baron Graham of Edmonton, politician (died 2020)\n**Michael Ward, mountaineer and surgeon (died 2005)\n* 27 March – Henry Plumb, Baron Plumb, farmer and politician (died 2022)\n* 28 March - Morris Perry, actor (died 2021)\n* 1 April – Kathy Stobart, saxophonist (died 2014)\n* 2 April – George MacDonald Fraser, author (died 2008)\n* 3 April – Tony Benn, politician (died 2014)\n* 9 April – Michael Richardson, investment banker (died 2003)\n* 12 April – Oliver Postgate, animator, puppeteer and writer (died 2008)\n* 14 April – William Lucas, actor (died 2016)\n* 15 April – Geraint Howells, politician (died 2004)\n* 21 April – John Swinton of Kimmerghame, English general and politician (died 2018)\n* 22 April – George Cole, actor (died 2015)\n* 24 April – Leslie Alcock, archaeologist (died 2006)\n* 25 April\n** Tony Christopher, Baron Christopher, businessman\n** Patrick David Wall, neuroscientist (died 2001)\n* 27 April – Vere Harmsworth, 3rd Viscount Rothermere, newspaper publisher (died 1998)\n* 1 May – Helen Bamber, psychotherapist and academic (died 2014)\n* 4 May – Rex Roe, air marshal (died 2002)\n* 11 May – Rhodes Boyson, English educator and politician (died 2012)\n* 14 May – Tristram Cary, composer (died 2008)\n* 15 May – Roy Stewart, actor (born in Jamaica; died 2008)\n* 26 May – Alec McCowen, actor (died 2017)\n* 27 May – John L. Harper, biologist (died 2009)\n* 30 May – John Marks, physician and author (died 2022)\n* 3 June – Thomas Winning, Archbishop of Glasgow (died 2001)\n* 4 June – Gerald Sim, actor (died 2014)\n* 5 June – Bill Sellars, television producer (died 2018)\n* 6 June – Michael ffolkes, illustrator and cartoonist (died 1988)\n* 9 June – Margaret Rhodes, aristocrat and courtier (died 2016)\n* 15 June – Richard Baker, broadcaster (died 2018)\n* 18 June – Carmel Budiardjo, human rights activist (died 2021)\n* 19 June – Charlie Drake, comedian, actor and singer (died 2006)\n* 22 June – Frank Hindle, footballer (died 2013)\n* 23 June – Miriam Karlin, actress (died 2011)\n* 26 June –  Richard Waring, comedy writer (died 1994)\n* 29 June – Mervyn Alexander, Roman Catholic bishop (died 2010)\n* 11 July – David Graham, actor and voice artist (died 2024)\n* 12 July – Rosie Harris, author\n* 17 July – Hugh David, actor and director (died 1987)\n* 18 July – Hubert Doggart, sports administrator, cricketer and schoolmaster (died 2018)\n* 19 July – Jack Petchey, businessman (died 2024)\n* 27 July – Harry Towb, actor (died 2009)\n* 28 July\n** Kenneth Alwyn, conductor, composer and writer (died 2020)\n** John Stonehouse, disgraced government minister (died 1988)\n* 29 July – Matthew White Ridley, 4th Viscount Ridley, nobleman (died 2012)\n* 30 July\n** Stan Stennett, Welsh comedian, actor and jazz musician (died 2013)\n** Alexander Trocchi, Scottish writer (died 1984)\n* 1 August – Pam Gems, English playwright (d. 2011)\n* 11 August – Michael Argyle, psychologist (died 2002)\n* 12 August\n** Norris McWhirter, co-founder of the Guinness Book of Records (died 2004)\n** Ross McWhirter, co-founder of the Guinness Book of Records (killed 1975)\n* 18 August – Brian Aldiss, science fiction author (died 2017)\n* 22 August\n** Honor Blackman, actress (died 2020)\n** Ivor Salter, actor (died 1991)\n* 26 August – Sangharakshita, born Dennis Lingwood, Buddhist teacher (died 2018)\n* 27 August – Nat Lofthouse, footballer (died 2011)\n* 28 August – Philip Purser, author and television critic (died 2022)\n* 2 September – Ronnie Stevens, comedian and actor (died 2006)\n* 5 September – Patrick Leo McCartie, Roman Catholic bishop (died 2020)\n* 6 September – Nina Lowry, judge (died 2017)\n* 8 September – Peter Sellers, comedian and actor (died 1980)\n* 10 September – Dick Lucas, minister and cleric\n* 15 September – John Eden, Baron Eden of Winton, politician (died 2020)\n* 22 September\n** William Franklyn, actor (died 2006)\n** Stratford Johns, actor (died 2002)\n* 23 September – Denis Twitchett, Cambridge scholar and Chinese historian (died 2006)\n* 27 September – Robert Edwards, physiologist and pioneer of in vitro fertilisation (died 2013)\n* 1 October\n** Christine Pullein-Thompson, English children's novelist (died 2005)\n** Diana Pullein-Thompson, English children's novelist (died 2015)\n* 5 October – Ken Middleditch, motorcycle speedway racer (died 2021)\n* 6 October – John Stanier, field marshal (died 2007)\n*  1925–2013]]13 October – Margaret Thatcher, Prime Minister of the United Kingdom (died 2013)\n* 14 October – Christopher French, judge (died 2003)\n* 15 October\n** Tony Hart, artist and television presenter (died 2009)\n** Jean Briggs Watters, cryptanalyst and Women's Royal Naval Service personnel (died 2018)\n* 16 October – Angela Lansbury, actress (died 2022)\n* 17 October\n** Harry Carpenter, boxing commentator (died 2010)\n** Patricia Kneale, actress (died 2008)\n* 19 October – Bernard Hepton, stage and television actor and director (died 2018)\n* 27 October\n** Paul Fox, television executive (died 2024)\n** Monica Sims, radio executive (died 2018)\n* 29 October\n** Paul Daneman, actor (died 2001)\n** Sir William Gladstone, 7th Baronet, aristocrat and Chief Scout (died 2018)\n** Robert Hardy, actor (died 2017)\n* 31 October\n** John Pople, chemist, Nobel Prize laureate (died 2004)\n** Tommy Watt, jazz bandleader (died 2006)\n* 1 November – Dickson Mabon, politician (died 2008)\n* 9 November – Ken Ashton, journalist and trade unionist (died 2002)\n* 10 November – Richard Burton, actor (died 1984)\n* 11 November\n** Nigel Cecil, naval officer (died 2017)\n** John Guillermin, director (died 2015)\n** June Whitfield, comic actress (died 2018)\n* 15 November – Paul Raymond, publisher (died 2008)\n* 23 November – Elaine Horseman, author and educator (died 1999)\n* 25 November – Priscilla Young, social worker (died 2006)\n* 27 November\n** John Maddox, science writer (died 2009)\n** Ernie Wise, comedian (died 1999)\n* 30 November – Gordon Parry, Baron Parry, politician (died 2004)\n* 5 December – Alastair McCorquodale, cricketer and athlete (died 2009)\n* 6 December – Oliver Bernard, English poet and translator (died 2013)\n* 11 December – Patrick Reyntiens, stained glass artist (died 2021)\n* 23 December\n** Duncan Hallas, Trotskyist (died 2002)\n** Rayner Unwin, publisher (died 2000)\n* 30 December – Ian MacNaughton, Scottish actor (died 2002 in Germany)\n* 31 December\n** Richard Gordon, producer (died 2011)\n** Daphne Oram, composer and musician (died 2003)\nDeaths\n* 14 January – Harry Furniss, cartoonist, illustrator and pioneer animator (born 1854)\n* 18 January – J. M. E. McTaggart, English philosopher (born 1866)\n* 26 January – Sir James Mackenzie, Scottish cardiologist (born 1853)\n* 30 January – Jim Driscoll (\"Peerless Jim\"), Welsh featherweight boxer (born 1880)\n* 3 February – Oliver Heaviside, mathematician and physicist (born 1850)\n* 4 February – William Haggar, cinema pioneer (born 1851)\n* 6 February – James Kenyon, businessman and cinema pioneer (born 1850)\n* 22 February – Sir Clifford Allbutt, physician (born 1836)\n* 24 February – Joseph Rowntree, Quaker sweet manufacturer and philanthropist (born 1836)\n* 4 March – James Ward, philosopher and psychologist (born 1843)\n* 20 March – George Curzon, 1st Marquess Curzon of Kedleston, Viceroy of India (born 1859)\n* 23 March – Bessie Rayner Parkes, journalist and feminist (born 1829)\n* 28 March – Henry Rawlinson, 1st Baron Rawlinson, general (born 1864)\n* 4 April – W. W. Rouse Ball, mathematician and lawyer (born 1850)\n* 6 April  – Xie Kitchin, child photographic model for Lewis Carroll (born 1864)\n* 14 April – John Singer Sargent, American-born portrait painter (born 1856)\n* 20 April – Herbert Lawford, tennis player (born 1851)\n* 7 May\n** William Lever, 1st Viscount Leverhulme, soap-maker and philanthropist (born 1851)\n** Sir Doveton Sturdee, admiral (born 1859)\n* 13 May – Alfred Milner, 1st Viscount Milner, politician and colonial administrator (born 1854)\n* 14 May – H. Rider Haggard, adventure novelist (born 1856)\n* 22 May – John French, 1st Earl of Ypres, World War I field marshal (born 1852)\n* 19 July –  John Indermaur, lawyer (born 1851)\n* 30 July –  William Wynn Westcott, freemason (born 1848)\n* 20 November – Alexandra of Denmark, dowager queen consort of Edward VII of the United Kingdom (born 1844)\n* 24 November – Margaret Sinclair (Sister Mary Francis of the Five Wounds), Scottish-born nun and venerable (born 1900)\n* 26 November – Sir Jervoise Baines, colonial civil servant (born 1847)\n* 17 December – A. N. Hornby, cricketer and rugby player (born 1847)\n* 18 December – Sir Hamo Thornycroft, figure sculptor (born 1850)\n* 28 December – Louisa Aldrich-Blake, surgeon (born 1865)\nSee also\n* List of British films of 1925\nReferences"
    }
  ]
}