{
  "content": [
    {
      "type": "text",
      "text": "# 1927 in the United Kingdom\n\nNorthern Ireland  Scotland  Wales\n|label2= Popular culture\n|data2 =\n1927 English cricket season\nFootball: England  Scotland\n1927 in British radio\n1927 in British television\n1927 in British music\n}}\nEvents from the year 1927 in the United Kingdom.\nThis year saw the renaming of the United Kingdom of Great Britain and Ireland into the United Kingdom of Great Britain and Northern Ireland, recognising in name the Irish Free State's independence, it having come into existence with the Anglo-Irish Treaty in 1922.\nIncumbents\n* Monarch – George V\n* Prime Minister – Stanley Baldwin (Conservative)\nEvents\n* 1 January – the British Broadcasting Company becomes the British Broadcasting Corporation, when it is granted a Royal Charter. John Reith becomes the first Director-General.\n* 7 January – first transatlantic telephone call from New York City to London.\n* 15 January – first live sports broadcast on the BBC. The rugby union international England v Wales is commented on by Teddy Wakelam. A week later the first football match is broadcast.\n* 19 January – Britain sends troops to China.\n* 28–30 January – gale-force winds batter the British Isles, with a gust of  recorded in Paisley (Scotland) and 23 killed.\n* 4 February – at Pendine Sands, Sir Malcolm Campbell sets a new world land speed record covering the Flying Kilometre in a mean average of 174.883&nbsp;mph (281.44&nbsp;km/h) and the Flying Mile in 174.224 m.p.h. driving the Napier-Campbell Blue Bird, the last time this record will be attained on British soil.\n* 12 February – first British troops land in Shanghai.\n* 14 February – Alfred Hitchcock's silent film thriller The Lodger: A Story of the London Fog released.\n* 19 February – general strike in Shanghai in protest at the presence of British troops.\n* 1 March – an underground gas and coal dust explosion at Marine Colliery, Cwm, Monmouthshire, kills 52.\n* 6 March – 1000 people a week die from an influenza epidemic.\n* 29 March – Henry Segrave breaks the land speed record driving the Sunbeam 1000 hp at Daytona Beach, Florida.\n* 5 April – Trade Disputes and Trade Unions Act 1927 forbids strikes of support.\n* 12 April – the Royal and Parliamentary Titles Act renames the United Kingdom of Great Britain and Ireland to the United Kingdom of Great Britain and Northern Ireland. The change acknowledges that the Irish Free State is no longer part of the Kingdom.\n* 21 April – National Museum of Wales officially opened in Cathays Park, Cardiff.\n* 23 April – Cardiff City F.C., members of the English Football League despite being based in Wales, win the FA Cup beating Arsenal 1–0 at Wembley Stadium and taking the trophy out of England for the first time.\n* 23 April – publication of first edition of The Countryman magazine, still being issued 90 years later.\n* 1 May – Dioceses of Guildford and of Portsmouth created in the Church of England.\n* 7 May – Newcastle United finish the football season as First Division champions. George Camsell, centre-forward of their local rivals Middlesbrough, scores a Football League record of 59 goals this season and a total of 63 in all competitions.\n* 9 May – Joe Davis wins the first World Snooker Championship final held in Birmingham, an event he will continue to win each year until 1940.\n* 12 May – British police raid the London office of the Soviet trading company ARCOS.\n* 13 May – George V proclaims the change of his style from King of the United Kingdom of Great Britain and Ireland to King of Great Britain and Ireland.\n* 20 May – Treaty of Jeddah: Saudi Arabia becomes independent of the United Kingdom.\n* 24 May – Britain severs diplomatic relations with the Soviet Union because of revelations of espionage and underground agitation.\n* 9 June – Soviet Union executes twenty British for alleged espionage.\n* 23 June – England and Yorkshire cricketer Wilfred Rhodes becomes the first person to play in 1,000 first-class cricket matches.\n* 29 June – Solar eclipse of June 29, 1927: totality is visible across Northern England and Wales (though weather conditions are poor for viewing).\n* 7 July\n** Diocese of Derby created in the Church of England.\n** Christopher Stone presents a record programme on BBC radio, becoming the first British disc jockey.\n* 7 September – the Television Society is founded. It will gain Royal patronage in 1966, becoming the Royal Television Society.\n* 5 October – the Labour Party votes in favour of nationalisation of the coal industry.\n* 7 October – Mercedes Gleitze becomes the first British woman to swim the English Channel.\n* 28 October – Cleggan Bay Disaster: A severe windstorm batters the British Isles, with coastal flooding in the Irish Sea along Cardigan Bay and 5 fatalities in Fleetwood, Lancashire.\n* 5 November – Britain's first automatic traffic lights are deployed experimentally in Wolverhampton.\n* 17 November – Leyland Titan double deck bus introduced. Its low chassis sets a significant trend in bus design which lasts for forty years.\n* December – Joshua Powell of Clacton begins the domestic radio relay service which will become Rediffusion.\n* 21 December (\"Slippery Wednesday\") – 1,600 people are hospitalised in the London area when they hurt themselves on icy streets.\n* 25 December – a Christmas Day blizzard affects Cardiff and much of South Wales together with the Midlands and London area.\nUndated\n* Last new cotton mills completed in Lancashire: Holden's Astley Bridge Mill, Bolton and Elk Mill, Royton (powered by a steam turbine).\n* Yorkshire captaincy affair: controversy over the decision (eventually reversed) to appoint a professional cricketer, Herbert Sutcliffe, as captain of Yorkshire County Cricket Club.\n* The National Gardens Scheme is established to open private gardens of interest to the public to raise money to assist the Queen's Nursing Institute.\n* Stanley Spencer completes his painting The Resurrection, Cookham.\nPublications\n* Board of Education's Report of the Consultative Committee on the Education of the Adolescent (Chairman: W. H. Hadow; dated 1926) recommending a division between primary and secondary schools at age 11.\n* Agatha Christie's Hercule Poirot novel The Big Four.\n* F. Tennyson Jesse's children's story Moonraker, or, The Female Pirate and Her Friends.\n* H. V. Morton's travelogue In Search of England, in book form.\n* Dorothy L. Sayers' Lord Peter Wimsey novel Unnatural Death.\n* Evelyn Sharp's The London Child about the plight of slum children in London.\n* Nevil Sidgwick's The Electronic Theory of Valency, an important work in chemistry.\n* Alfred North Whitehead and Bertrand Russell, 2nd edition of Principia Mathematica, one of the most important and seminal works in mathematical logic and philosophy.\n* Henry Williamson's novel Tarka the Otter.\n* P. G. Wodehouse's short story \"Pig-hoo-o-o-o-ey\", introducing Lord Emsworth's prize pig, Empress of Blandings.\n* Virginia Woolf's novel To the Lighthouse.\n* The Economic History Review begins publication (January).\nBirths\n* 8 January – Charles Tomlinson, poet and academic (died 2015)\n* 12 January\n** Richard Bebb, actor (died 2006)\n** Leslie Orgel, chemist (died 2007)\n* 13 January – Sydney Brenner, South African-born biologist, recipient of the Nobel Prize in Physiology or Medicine (died 2019)\n* 14 January – John Mallard, medical physicist (died 2021)\n* 20 January – Bill Le Sage, jazz pianist (died 2001)\n* 28 January – Ronnie Scott, jazz saxophonist and club owner (died 1996)\n* 31 January – Arnold Ziff, businessman and philanthropist (died 2004)\n* 7 February – John Buller, composer (died 2004)\n* 9 February – David Wheeler, computer scientist (died 2004)\n* 10 February – Nigel Bagnall, army general (died 2002)\n* 11 February – Robert Squires, admiral (died 2016)\n* 15 February – Frank Dunlop, theatre director\n* 16 February – June Brown, actress (died 2022)\n* 18 February – Peter Fryer, English journalist and author (died 2006)\n* 21 February – Anne Sunnucks, English author and chess player (died 2014)\n* 25 February – David Oates, English archaeologist (died 2004)\n* 26 February – Gerald Priestland, English journalist and broadcaster (died 1991)\n* 1 March – George Davies, English footballer (died 2025)\n* 3 March – Nicolas Freeling, novelist (died 2003)\n* 5 March – Robert Lindsay, 29th Earl of Crawford, politician and aristocrat (died 2023)\n* 9 March – Julian Tudor-Hart, physician, writer and political campaigner (died 2018)\n* 10 March – H. Douglas Keith, physicist (died 2003)\n* 11 March – Ron Todd, trade union leader (died 2005)\n* 12 March – Francis Wilford-Smith, cartoonist (died 2009)\n* 15 March – Brian Shenton, track and field sprinter (died 1987)\n* 17 March – Patrick Allen, actor (died 2006)\n* 26 March\n** Harold Chapman, photographer (died 2022)\n** Tom Christie, doctor, Olympic rower (died 2017)\n* 29 March – John Vane, pharmacologist, recipient of the Nobel Prize in Physiology or Medicine (died 2004)\n* 30 March – Robert Armstrong, Baron Armstrong of Ilminster, English civil servant (died 2020)\n* 1 April – Peter Cundall, English-Australian soldier, horticulturist and author (died 2021)\n* 2 April – Kenneth Tynan, theatre critic (died 1980)\n* 6 April – John Brooke-Little, herald (died 2006)\n* 8 April – Tilly Armstrong (alias Tania Langley and Kate Alexander), British writer (died 2010)\n* 9 April – Clive Lythgoe, pianist (died 2006)\n* 15 April – Colin Bean, actor (died 2009)\n* 16 April\n** Alan Geldard, cyclist (died 2018)\n** Robert Wilson, astrophysicist (died 2002)\n* 18 April – Sidney Cooke, English serial killer and paedophile\n* 25 April – Dickie Dale, English motorcycle road racer (died 1961)\n* 26 April\n** Jack Douglas, actor (died 2008)\n** Anne McLaren, geneticist and developmental biologist (died 2007)\n** Derek Waring, actor (died 2007)\n* 27 April\n** Sheila Scott, aviator (died 1988)\n** Elizabeth Craig-McFeely, former director of the Women's Royal Naval Service\n* 2 May – Michael Broadbent, wine critic (died 2020)\n* 4 May – Terry Scott, actor and comedian (died 1994)\n* 5 May – Beverley Sisters Babs (d. 2018) and Teddie, close harmony singers\n* 9 May – Keith Ross, surgeon (died 2003)\n* 11 May – Bernard Fox, actor (died 2016)\n* 21 May – Brian Manning, historian (died 2004)\n* 25 May – Paul Oliver, architectural historian (died 2017)\n* 27 May\n** John Chapman, actor and screenwriter (died 2001)\n** Bryan Cowgill, television executive (died 2008)\n* 29 May – Trevor Holdsworth, businessman (died 2010)\n* 31 May – Joe Robinson, actor and wrestler (died 2017)\n* 2 June\n** Colin Brittan, footballer (died 2013)\n** Christopher Slade, lawyer and judge (died 2022)\n* 4 June – Geoffrey Palmer, actor (died 2020)\n* 6 June – David Chipp, journalist (died 2008)\n* 7 June – Ian McColl, footballer and football manager (died 2008)\n* 8 June\n** Michael Levey, art historian (died 2008)\n** Anne Warburton, academic and diplomat (died 2015)\n* 11 June\n** Marcus Fox, politician (died 2002)\n** Beryl Grey, ballet dancer (died 2022)\n* 12 June – Al Fairweather, jazz musician (died 1993)\n* 13 June\n** Paul Ableman, novelist (died 2006)\n** Brian Wilde, actor (died 2008)\n* 15 June – R. A. C. Parker, historian (died 2001)\n* 18 June – Paul Eddington, actor (died 1995)\n* 23 June – John Habgood, Archbishop of York (died 2019)\n* 25 June – Arnold Wolfendale, astronomer (died 2020)\n* 28 June – Correlli Barnett, military historian (died 2022)\n* 1 July – Richard Chaloner, 3rd Baron Gisborough\n* 3 July\n**Ken Rowlands, Welsh boxer (died 2011)\n**Ken Russell, film director (died 2011)\n* 4 July – Derek Bond, English bishop (d. 2018)\n* 10 July – Don Revie, footballer and football manager (died 1989)\n* 12 July – Harold Walker, politician (died 2003)\n* 11 July – Chris Leonard, English footballer (died 1987)\n* 15 July – Ted Slevin, professional rugby league footballer (died 1998)\n* 16 July\n** Derek Hawksworth, footballer (died 2021)\n** Shirley Hughes, children's book author and illustrator (died 2022)\n** John Warr, Middlesex cricketer (died 2016)\n* 26 July – Danny La Rue, Irish-born British drag entertainer (d. 2009)\n* 30 July – Tony Hiller, songwriter and record producer (died 2018)\n* 31 July – Peter Nichols, playwright (died 2019)\n* 1 August – Franklyn Perring, botanist (died 2003)\n* 8 August – Basil Kirchin, drummer and composer (died 2005)\n* 9 August\n**Robert Malpas, engineer and businessman (died 2023)\n**Robert Shaw, actor and novelist (died 1978)\n* 11 August – Raymond Leppard, conductor (died 2019)\n* 19 August – Ivan Owen, voice actor (died 2000)\n* 20 August – Peter Oakley, pensioner and internet celebrity (died 2014)\n* 26 August – Duncan Inglis Cameron, university administrator (died 2006)\n* 1 September – Maurice Stonefrost, civil servant (died 2008)\n* 4 September – Richard Chorley, geographer (died 2002)\n* 6 September – Jack Parker, hurdler (died 2022)\n* 7 September\n** Freddie Glidden, Scottish footballer (died 2019)\n** Eric Hill, author and illustrator (died 2014)\n* 8 September – James Culliford, actor (died 2002)\n* 10 September – Johnny Keating, Scottish musician (died 2015)\n* 11 September – Vernon Corea, Sri Lankan-born broadcaster (died 2002)\n* 18 September – Muriel Turner, Baroness Turner of Camden, British politician (died 2018)\n* 20 September – John Dankworth, jazz musician (died 2010)\n* 21 September – Bill Speakman, soldier (died 2018)\n* 22 September – Gordon Astall, footballer (died 2020)\n* 25 September – Colin Davis, orchestral conductor (died 2013)\n* 6 October – Antony Grey, born Anthony Wright, LGBT rights activist (died 2010)\n* 9 October – John Margetson, scholar and diplomat (died 2020)\n* 11 October\n** Liza Picard, English lawyer and historian (died 2022)\n** Jim Prior, Conservative politician, cabinet minister (died 2016)\n* 14 October – Roger Moore, screen actor (died 2017)\n* 15 October – Jeannette Charles, actress (died 2024)\n* 20 October – Brian Nissen, actor (died 2001)\n* 24 October – John Winston, actor (died 2019)\n* 28 October – Cleo Laine, singer (died 2025)\n* 31 October – Charles Cameron, Scottish magician (died 2001)\n* 3 November – Tiny Wharton, Scottish football referee (died 2005)\n* 5 November – Kenneth Waller, English actor (died 2000)\n* 7 November – Ivor Emmanuel, actor (died 2007)\n* 8 November – Ken Dodd, comedian and singer (died 2018)\n* 12 November – David Butler, screenwriter (died 2008)\n* 15 November – Gregor Mackenzie, Labour Party politician (died 1992)\n* 16 November – Gerry Lowe, rugby player (d. 2018)\n* 17 November – Fenella Fielding, actress (died 2018)\n* 23 November\n** John Cole, journalist and broadcaster (died 2013)\n** Michael Coulson, lawyer and politician (died 2002)\n* 24 November – Jonathan Routh, humorist (died 2008)\n* 27 November – Eppie Gibson, rugby league player and coach (died 2018)\n* 3 December – Richard Pankhurst, academic (died 2017)\n* 7 December – Helen Watts, contralto (died 2009)\n* 9 December – Benny Green, jazz saxophonist (died 1998)\n* 19 December – James Booth, actor (died 2005)\n* 26 December\n** Denis Gifford, writer, broadcaster and journalist (died 2000)\n** Denis Quilley, actor (died 2003)\n* 28 December – Simon Raven, novelist (died 2001)\nDeaths\n* 21 January – Sir Charles Warren, police officer and Biblical archeologist (born 1840)\n* 24 February – Sir Edward Marshall Hall, defence barrister (born 1858)\n* 25 January – Mark Judge, architect and engineer (born 1847)\n* 28 February – Sir Luke Fildes, genre painter and illustrator (born 1843)\n* 3 March – J. G. Parry-Thomas, Welsh automotive engineer and racing driver, killed in attempt on world land speed record (born 1884)\n* 6 March – Marie Spartali Stillman, painter (born 1844)\n* 12 March – Sam Mussabini, athletics coach (born 1867)\n* 16 March – Sir Henry Craik, 1st Baronet, civil servant, writer and Unionist politician (born 1846)\n* 18 March – Philip Wicksteed, theologian and critic (born 1844)\n* 31 March – Mabel Collins, theosophist and author (born 1851)\n* 10 April – Arthur Reid Lempriere, army officer (born 1835)\n* 2 May – Ernest Starling, physiologist (born 1866)\n* 3 May – Tom Gallaher, Irish tobacco manufacturer (born 1840)\n* 6 May – Henry Lowry-Corry, army officer and politician (born 1845)\n* 11 June – William Attewell, cricketer (born 1861)\n* 14 June – Jerome K. Jerome, humorous writer (born 1859)\n* 2 July – Frank Curzon, theatre manager (born 1868)\n* 6 July – Harry Anstey, metallurgist and gold prospector (born 1847)\n* 27 July – Solomon Joseph Solomon, portrait painter (born 1860)\n* 31 July\n** Sir George Bonham, diplomat (born 1847)\n** Sir Harry Johnston, explorer and colonial administrator (born 1858)\n** Emélie Polini, stage actress (born 1881)\n* 3 August – Edward B. Titchener, psychologist (born 1867)\n* 17 August – Sir Ernest Hatch, politician (born 1859)\n* 9 September – Henry Ward, architect (born 1852)\n* 8 October – Mary Webb, novelist (born 1881)\n* 19 October – Beatrice Green, labour activist (born 1894)\nSee also\n* List of British films of 1927\nReferences"
    }
  ]
}