{
  "content": [
    {
      "type": "text",
      "text": "# 1931 United Kingdom general election\n\n0.1 pp)\n| image1 =\n| leader1 = Stanley Baldwin\n| leader_since1 = 23 May 1923\n| party1 = Conservative Party (UK)\n| alliance1 = National\n| leaders_seat1 = Bewdley\n| last_election1 = 260 seats, 38.1%\n| seats1 = 470\n| seat_change1 = 210\n| popular_vote1 = 11,377,022\n| percentage1 = 55.0%\n| swing1 = 16.9 pp\n| image2 =\n| leader2 = Arthur Henderson\n| leader_since2 = 1 September 1931\n| party2 = Labour Party (UK)\n| alliance2 =\n| leaders_seat2 = Burnley(lost seat)\n| last_election2 = 287 seats, 37.1%\n| seats2 = 52\n| seat_change2 = 235\n| popular_vote2 = 6,339,306\n| percentage2 = 30.6%\n| swing2 = 6.5 pp\n| image4 =\n| leader4 = Herbert Samuel\n| leader_since4 = October 1931\n| party4 = Liberal Party (UK)\n| alliance4 = National\n| leaders_seat4 = Darwen\n| last_election4 = 59 seats, 23.6%\n| seats4 = 33\n| seat_change4 = 26\n| popular_vote4 = 1,346,571\n| percentage4 = 6.5%\n| swing4 = 17.1 pp\n| image3 =\n| leader3 = John Simon\n| leader_since3 = 5 October 1931\n| party3 = Liberal National\n| alliance3 = National\n| leaders_seat3 = Spen Valley\n| last_election3 = Did not contest\n| seats3 = 35\n| seat_change3 = 35\n| popular_vote3 = 761,705\n| percentage3 = 3.7%\n| swing3 = New party\n| image5 =\n| leader5 = Ramsay MacDonald\n| leader_since5 = 24 August 1931\n| party5 = National Labour Organisation\n| alliance5 = National\n| leaders_seat5 = Seaham\n| last_election5 = Did not contest\n| seats5 = 13\n| seat_change5 = 13\n| popular_vote5 = 316,741\n| percentage5 = 1.5%\n| swing5 = New party\n| image6 =\n| leader6 = David Lloyd George\n| leader_since6 = 1931\n| party6 = Independent Liberals (UK, 1931)\n| leaders_seat6 = Caernarvon Boroughs\n| last_election6 = Did not contest\n| seats6 = 4\n| seat_change6 = 4\n| popular_vote6 = 106,106\n| percentage6 = 0.5%\n| swing6 = New party\n| map_image = 1931 UK general election map.svg\n| map_size = 330px\n| map_caption = Colours denote the winning party—as shown in\n| title = Prime Minister\n| posttitle = Prime Minister after election\n| before_election = Ramsay MacDonald\n| before_party = Labour Party (UK)\n| after_election = Ramsay MacDonald\n| after_party = UK National Government\n| map2 =\n| map2_caption = Composition of the House of Commons after election\n}}\nThe 1931 United Kingdom general election was held on Tuesday, 27 October 1931. It saw a landslide election victory for the National Government, a three-party coalition which had been formed two months previously after the collapse of the second Labour government. Journalist Ivor Bulmer-Thomas described the result as \"the most astonishing in the history of the British party system\".\nUnable to secure support from his cabinet for his preferred policy responses to the economic and social crises brought about by the Great Depression, Prime Minister Ramsay MacDonald split from the Labour Party and formed a new national government in coalition with the Conservative Party and a number of Liberals. MacDonald subsequently campaigned for a \"Doctor's Mandate\" to do whatever was necessary to fix the economy, running as the leader of a new party called National Labour within the coalition. Disagreement over whether to join the new government also resulted in the Liberal Party splitting into three separate factions, including one led by former Prime Minister David Lloyd George.\nCollectively, the parties forming the National Government won 67% of the popular vote and 554 (90.1%) of 615 seats in the House of Commons. Although the bulk of the National Government's support came from the Conservative Party, which won a majority in its own right with 470 seats, MacDonald remained Prime Minister. The Labour Party suffered its greatest ever defeat—losing four-fifths of its seats, including the seat of leader Arthur Henderson—and became the official opposition with just 52 MPs. The collapse of the Liberals into competing factions also ended their time as a significant force in British politics; the breakaway National Liberals were eventually absorbed into the Conservatives in 1947, while the main Liberal Party would remain in the political wilderness until its revival in the 1970s.\nIt is the most recent election in which any single party (the Conservatives) received an absolute majority of the votes cast, and the last UK general election not to take place on a Thursday. It was also the last election until 1997 in which any single party won more than 400 seats.\nBackground\nAfter battling with the Great Depression for two years, the Labour government of Ramsay MacDonald was faced with a budget crisis in August 1931. The cabinet deadlocked over its response, with several influential members—such as Arthur Henderson—unwilling to support budget cuts (in particular a cut in the rate of unemployment benefit) which were pressed by the civil service and opposition parties. Crucially, Chancellor of the Exchequer Philip Snowden refused to consider deficit spending or tariffs as alternative solutions, and without any other options to address the crisis the government was forced to resign. However, MacDonald was encouraged by King George V to form an all-party National Government in coalition with the Conservatives and Liberals in order to break the deadlock.\nThe initial hope was that the coalition government would hold office for only a few weeks in order to address the country's immediate economic crises, then dissolve for a return to ordinary party politics—but when the government was forced to remove the pound sterling from the gold standard it became clear that it would require more time in office. Meanwhile, the Labour Party expelled all those who were supporting the government, and MacDonald's decision to lead a Conservative-dominated coalition instead of the party he had co-founded was labelled a \"betrayal\" by his erstwhile colleagues and supporters.\nThe Conservatives began pressing their partners to fight an election together as a combined unit in order to secure a mandate for radical economic reform, and MacDonald's supporters from the Labour Party formed the National Labour Organisation to support him. While initially against an early election, MacDonald came to endorse the idea in order to take advantage of Labour's unpopularity due to its poor economic record in office.\nHowever, the Liberals were sceptical about an election and had to be persuaded. The key issue was the Conservatives' wish to introduce protectionist trade policies: the majority of the Liberals, led by Sir Herbert Samuel, were opposed, considering support for free trade to be a non-negotiable component of the Liberal political tradition. The argument split the party in half: Samuel withdrew the Liberals from the National Government (though continued to lend it their confidence, and still stood in the election as part of the coalition), while the National Liberals—under the leadership of Sir John Simon—remained, willing to support protectionism.\nWhile this was happening, former prime minister David Lloyd George was still technically the Liberal Party's leader—however, due to having undergone an operation in early 1931, with a long recuperation, he was unable to take up a ministerial role when the National Government was formed. While initially supportive of both the coalition and its protectionist trade policy, he strongly opposed the proposal for an election. He and a third faction of Liberal MPs—the Independent Liberals—also broke away, and ran in the election on an anti-National Government platform.\nParliament was dissolved on 7 October. In order to appease the various factions within the coalition its manifesto avoided proposing any specific policy, and instead asked voters for a \"Doctor's Mandate\" to do whatever was necessary to rescue the economy. Individual candidates were then allowed to state their support for policies such as trade tariffs.\nLabour campaigned on opposition to public spending cuts, but this was a difficult position to justify when many of the cuts had initially been agreed when Labour was in government. By 1931, Labour had lost significant economic credibility due to soaring unemployment—especially in coal, textiles, shipbuilding and steel—and the party's working class base increasingly lost confidence in its ability to solve the most pressing problems facing the country.\nAn additional problem for Labour came from the 2.5 million Irish Catholics in England and Scotland, who had traditionally been a major component of their working class base. By 1930 a number of Catholic bishops had grown increasingly alarmed at the party's stances on Communist Russia, birth control, and especially regarding funding Catholic schools, and the Church began to warn its members against voting Labour. This shift played a major role in Labour's collapse in support in some urban areas.\nOutcome\nThe election was a landslide for the National Government coalition, which won 67.2% of the popular vote and 518 seats out of 615 in the House of Commons—for both, it stands as the largest share ever secured in a British general election since the passage of the Reform Act 1832. (The next-best results for both was secured by the Whigs in 1832, who won 67.01% of the vote and 67.02% of seats under a substantially different electoral system with a much smaller electorate.) However, by far the largest share of the government's seats was won by the Conservatives, and the party's 470 seats also remains the record for the largest share of the total seats in Parliament (76.4%) won by any single party.\nThe victory gave the National Government a clear mandate to enact its policy platform, which the coalition believed would pull the economy out of the doldrums of the Great Depression. MacDonald remained Prime Minister, but the Conservatives were the dominant party within the coalition—National Labour contested only 20 seats, winning 13—and with his increasingly poor health over the course of the parliament he came to be more of a figurehead for the government rather than an active leader.\nLabour's loss of vote share (a drop of 6.5%) was average by historical standards, but the inefficiency of its vote distribution under first-past-the-post meant that the party suffered a net loss of 235 out of 287 seats. This remains Labour's most significant absolute and per capita election loss, and it stood as the record for greatest number of seats lost by any party in a single general election until the Conservatives lost a net of 251 seats under Rishi Sunak in 2024.\nResults\n|colspan=12 bgcolor=#E0E0E0 align=\"center\"|National Government\n|-\n|-\n|colspan=1 bgcolor=#000000 align=\"left\"|\n|colspan=1 bgcolor=#efefef align=\"left\"| National Government (total)\n|colspan=1 bgcolor=#efefef align=\"right\"| Ramsay MacDonald\n|colspan=1 bgcolor=#efefef align=\"right\"| 694\n|colspan=1 bgcolor=#efefef align=\"right\"| 554\n|colspan=1 bgcolor=#efefef align=\"right\"|\n|colspan=1 bgcolor=#efefef align=\"right\"|\n|colspan=1 bgcolor=#efefef align=\"right\"| +236\n|colspan=1 bgcolor=#efefef align=\"right\"| 90.1\n|colspan=1 bgcolor=#efefef align=\"right\"| 67.2\n|colspan=1 bgcolor=#efefef align=\"right\"| 13,902,232\n|colspan=1 bgcolor=#efefef align=\"right\"|+5.5\n|-\n|colspan=12 bgcolor=#E0E0E0 align=\"center\"|Labour Opposition\n|-\n|-\n|colspan=1 bgcolor=#DC241f align=\"left\"|\n|colspan=1 bgcolor=#efefef align=\"left\"| Labour (total)\n|colspan=1 bgcolor=#efefef align=\"right\"| Arthur Henderson\n|colspan=1 bgcolor=#efefef align=\"right\"| 516\n|colspan=1 bgcolor=#efefef align=\"right\"| 52\n|colspan=1 bgcolor=#efefef align=\"right\"|\n|colspan=1 bgcolor=#efefef align=\"right\"|\n|colspan=1 bgcolor=#efefef align=\"right\"| &minus;235\n|colspan=1 bgcolor=#efefef align=\"right\"| 8.5\n|colspan=1 bgcolor=#efefef align=\"right\"| 30.6\n|colspan=1 bgcolor=#efefef align=\"right\"|  6,395,065\n|colspan=1 bgcolor=#efefef align=\"right\"|&minus;6.5\n|-\n|colspan=12 bgcolor=#E0E0E0 align=\"center\"|Other opposition parties\n|}\nVotes summary\n|55.21}}\n|31.04}}\n|6.54}}\n|3.70}}\n|1.54}}\n}}\n|31.04}}\n}}\nSeats summary\n|76.42}}\n|8.46}}\n|5.69}}\n|5.20}}\n|2.11}}\n}}\n|8.46}}\n}}\nTransfers of seats\nThis differs from the above list in including seats where the incumbent was standing down and therefore there was no possibility of any one person being defeated. The aim is to provide a comparison with the previous election. In addition, it provides information about which party gained the seat.\n* All comparisons are with the 1929 election.\n**In some cases the change is due to the MP defecting to the gaining party. Such circumstances are marked with a *.\n**In other circumstances the change is due to the seat having been won by the gaining party in a by-election in the intervening years, and then retained in 1931. Such circumstances are marked with a †.\n{| class=\"wikitable sortable\" style=\"margin:1em\"\n!colspan=2|To\n!colspan=2|From\n!No.\n!class=unsortable|Seats\n|-\n|\n|\n|4\n|Merthyr*, Shettleston*, Bridgeton*, Gorbals*\n|- class=\"sortbottom\"\n! style=\"text-align:left\" colspan=\"4\" |Independent Labour gains:\n! style=\"text-align:left\" colspan=\"2\" |4\n|-\n| rowspan=\"2\" style=\"color:inherit;background:\" |\n| rowspan=\"2\" |\n|\n|1\n|Govan*\n|-\n|\n|1\n|Liverpool Scotland†\n|- class=\"sortbottom\"\n! style=\"text-align:left\" colspan=\"4\" |Labour gains:\n! style=\"text-align:left\" colspan=\"2\" |2\n|-\n|\n|\n|16\n|Dundee (one of two), Paisley, Edinburgh East, South Shields, Durham, Bristol North, Leicester West, Lambeth North, Whitechapel and St Georges, Walsall, Middlesbrough East, Bradford South, Dewsbury, Colne Valley2, Wrexham, Carmarthen\n|- class=\"sortbottom\"\n! style=\"text-align:left\" colspan=\"4\" |Liberal gains:\n! style=\"text-align:left\" colspan=\"2\" |16\n|-\n|\n| rowspan=2 style=\"color:inherit;background:\" |\n| rowspan=2 |\n|13\n|Kilmarnock*, Ilkeston, Derby (one of two)*, Seaham*, Forest of Dean, Ormskirk*, Finsbury*, Tottenham South, Bassetlaw*, Nottingham South*, Lichfield*, Leeds Central*, Cardiff C*\n|-\n| rowspan=\"2\" bgcolor=\" |\n| rowspan=\"2\" |\n|11\n|Dunfermline Burghs, Bishop Auckland, Consett, Gateshead, Southampton (one of two), Burnley, Shoreditch, Southwark North, Huddersfield, Barnsley, Swansea West\n|-\n|\n|26\n|Inverness*, Ross and Cromarty*, Western Isles*, Montrose Burghs*, Fife East*, Greenock*, Leith*, Dumfriesshire*, Luton*, Huntingdonshire*, Eddisbury*, St Ives*, Devonport*, South Molton*, Harwich*, Bosworth*, Holland with Boston*, Great Yarmouth*, Norfolk East*, Norwich (one of two)*, Newcastle upon Tyne East*, Eye*, Spen Valley*, Denbigh*, Flintshire*, Montgomeryshire*\n|- class=\"sortbottom\"\n! style=\"text-align:left\" colspan=\"4\" |National Liberal gains:\n! style=\"text-align:left\" colspan=\"4\" |37\n|-\n|  Independent\n| rowspan=2 style=\"color:inherit;background:\" |\n| rowspan=2 |\n|1\n|Mossley\n|-\n|\n|2\n|Southwark Central, Burslem\n|-\n| rowspan=\"5\" bgcolor=\" |\n| rowspan=\"5\" |\n|\n|1\n|Dundee (one of two)\n|-\n|\n|194\n|Aberdeen N, Stirling and Falkirk, Clackmannan and E Stirlingshire, Stirlingshire W, Fife W, Kirkcaldy Burghs, Dunbartonshire, Lanark, Partick, Lanarkshire N, Renfrewshire W, Maryhill, Motherwell, Camlachie, Bothwell, Coatbridge, Springburn, Rutherglen, Tradeston, Ayrshire S, Edinburgh W, Edinburgh C, Midlothian S & Peebles, Linlithgow, Berwick & Haddington, Reading, Birkenhead W, Crewe, Stalybridge and Hyde, Stockport (one of two), Carlisle, Whitehaven, Derbyshire NE, Chesterfield, Derby (one of two), Belper, Derbyshire S, Drake, Blaydon, Houghton-le-Spring, Jarrow, Barnard Castle, Sedgefield, Darlington, Stockton-on-Tees, Sunderland (one of two), Sunderland (one of two)†, Leyton E, East Ham N, East Ham S, Essex SE, Leyton W, Romford, Walthamstow E, Upton, Bristol C, Bristol S, Portsmouth C, Southampton (one of two), Dudley, Stourbridge, Kingston upon Hull C, Kingston upon Hull E, Kingston upon Hull SW, Chatham2, Dartford, Accrington, Barrow-in-Furness, Blackburn (both seats), Nelson and Colne, Preston (one of two), Rossendale, Ashton-under-Lyne, Bolton (both seats), Eccles, Farnworth, Ardwick, Clayton, Gorton, Hulme, Platting, Oldham (both seats), Rochdale, Salford N, Salford S, Salford W, Bootle, Edge Hill, Everton, Kirkdale, W Toxteth, Newton, St Helens, Warrington, Widnes, Leicester E, Loughborough, Brigg, Lincoln, Battersea N, Battersea S, Camberwell N, Camberwell NW, Deptford, Greenwich, Hackney C, Hackney S, Hammersmith N, Hammersmith S, Islington E, Islington N, Islington S, Islington W, Kennington, Kensington N, Peckham, Rotherhithe, St Pancras N, St Pancras SE, St Pancras SW, Fulham W†, Southwark SE, Mile End, Wandsworth C2, Acton, Enfield, Willesden W, Edmonton, Tottenham N, Norfolk N, Norfolk SW, Norwich (one of two), Kettering, Northampton, Peterborough, Wellingborough, Morpeth, Newcastle C, Newcastle W, Wallsend, Wansbeck, Nottingham W, The Wrekin, Frome, Cannock, Hanley, Kingswinford, Leek, Smethwick1, Stoke1, Wednesbury, W Bromwich, Bilston, Wolverhampton W4, Nuneaton, Duddeston, Coventry, Aston1, Deritend, Erdington, Ladywood, Yardley, Swindon, York, Cleveland, Sheffield C, Bradford N, Sowerby, Elland, Leeds W, Halifax, Bradford E, Shipley†, Wakefield, Sheffield Park, Rotherham, Bradford C, Keighley, Pontefract, Hillsborough, Attercliffe, Brightside, Penistone, Leeds S, Doncaster, Batley and Morley, Newport, Brecon and Radnor, Llandaff & Barry, Cardiff E, Cardiff S\n|-\n|\n|13\n|Aberdeenshire W & Kincardine, Galloway1, Bedfordshire Mid, Camborne, Penryn & Falmouth, Dorset E, Hereford, Ashford, Preston (one of two)3, Heywood & Radcliffe, Blackley, Withington, Nottingham E\n|-\n|\n|1\n|Stretford\n|-\n|\n|1\n|Exeter\n|- class=\"sortbottom\"\n! style=\"text-align:left\" colspan=\"4\" |Conservative gains:\n! style=\"text-align:left\" colspan=\"2\" |210\n|}\n:1 Sitting MP had defected to the New Party\n:2 Sitting MP had defected to National Labour\n:3 Sitting MP had defected to Labour\n:4 Sitting MP had defected to Independent Labour\nResults by constituency\nThese are available at the PoliticsResources website, a link to which is given below.\nSee also\n*List of MPs elected in the 1931 United Kingdom general election\n*List of MPs for constituencies in Wales (1931–1935)\n*1931 United Kingdom general election in Scotland\n*1931 United Kingdom general election in Northern Ireland\nFootnotes\nReferences\nFurther reading\n*\n* Bassett, R.Nineteen Thirty-One Political Crisis (1958)\n*\n*\n* Mowat, Charles L. \"The Fall of the Labour Government in Great Britain, August, 1931,\" Huntington Library Quarterly 7#4 (1944), pp. 353–386 [http://www.jstor.org/stable/3815737 online]\n*\n*\n*\nExternal links\n*[https://web.archive.org/web/20171115141436/http://www.politicsresources.net/area/uk/ge31/ge31index.htm 1931 election results by constituency]\n*[http://www.election.demon.co.uk/geresults.html United Kingdom election results—summary results 1885–1979]\nManifestos\n*[http://www.conservativemanifesto.com/1931/1931-conservative-manifesto.shtml 1931 Conservative manifesto]\n*[https://web.archive.org/web/20031204210418/http://www.labour-party.org.uk/manifestos/1931/1931-labour-manifesto.shtml 1931 Labour manifesto]\n*[http://www.libdemmanifesto.com/1931/1931-liberal-manifesto.shtml 1931 Liberal manifesto]"
    }
  ]
}