{
  "content": [
    {
      "type": "text",
      "text": "# 1931 Salvadoran presidential election\n\nPresidential elections were held in El Salvador in 1931, with a popular vote taking place alongside concurrent legislative elections from 11 to 13 January 1931. Observers described the 1931 election as El Salvador's first free and fair election.\nNone of the five candidates won an absolute majority, leading to the Legislative Assembly unanimously electing Arturo Araujo of the Salvadoran Laborist Party (PLS), who won a plurality in the popular election, as El Salvador's next president on 12 February 1931.\nThe legislature also unanimously elected General Maximiliano Hernández Martínez of the National Republican Party (PNR), who supported Araujo's campaign, as vice president. Araujo was overthrown in December 1931 and Martínez became president, ruling until 1944.\nBackground\nPresident Pío Romero Bosque implemented democratic reforms in El Salvador during his presidency, though his motivations for doing so are disputed. Theories include that it was to combat the radicalization of laborers, to foster relations with the United States, or to \"leave his mark on history\" by breaking with the Meléndez–Quiñónez dynasty that ruled El Salvador from 1913 to 1927. The reforms enabled the 1931 presidential and legislative elections to be conducted in a genuinely democratic manner, in contrast to the fraudulent elections held under the Meléndez–Quiñónez dynasty. Polling stations were staffed by observer groups from each political party to ensure there was no fraud. The government also increased its presence at polling stations by sending soldiers from the armed forces who, according to General Salvador Peña, would \"maintain order and guarantee freedom of suffrage\".\n}}\nAlthough Romero introduced several democratic reforms, he also issued a decree that banned worker's rallies and the spread of Marxist propaganda on 12 August 1930 to curb the rise in popularity of the Regional Federation of the Workers of El Salvador (FRTS). The National Guard arrested workers who protested the decree throughout August and September. In October, workers organized the Campaign for the Liberation of Political Prisoners, but this was also banned. In November, Romero released many who were arrested to diminish tensions with the workers, but on 21 December, General Enrique Leitzelar (the chief of the National Police) led a massacre in Santa Ana that killed worker leader Pedro Alonzo and seven others.\nPresidential candidates\nThe presidential election had six candidates: Arturo Araujo of the Salvadoran Laborist Party (PLS), General Antonio Claramount Lucero of the Progressive Fraternal Party (PFP), Enrique Córdova of the National Development Party (PDN), Alberto Gómez Zárate of the Patriotic Action Party (PAP), General Maximiliano Hernández Martínez of the National Republican Party (PNR), and Miguel Tomás Molina of the Constitutional Party (PC). Additionally, Prudencia Ayala attempted to run as El Salvador's first female presidential candidate, but the Supreme Court of Justice blocked her from running because she was a woman.\n{| class=\"vertical-align-top wikitable sortable\" style=\"text-align:center\"\n! colspan=\"2\" | Party\n! colspan=\"2\" | Candidate\n|-\n| style=\"background-color:\" |\n| Salvadoran Laborist Party\n|\n| data-sort-value=\"Araujo, Arturo\" style=\"line-height:1.0\" | Arturo Araujo\n|-\n| style=\"background-color:plum\" |\n| Progressive Fraternal Party\n|\n| data-sort-value=\"Claramount Lucero, Antonio\" style=\"line-height:1.0\" | Antonio Claramount Lucero\n|-\n| style=\"background-color:#54D673\" |\n| National Development Party\n|\n| data-sort-value=\"Cordova, Enrique\" style=\"line-height:1.0\" | Enrique Córdova}}\n|-\n| style=\"background-color:#4168E1\" |\n| Patriotic Action Party\n|\n| data-sort-value=\"Gomez Zarate, Alberto\" style=\"line-height:1.0\" | Alberto Gómez Zárate}}\n|-\n| style=\"background-color:#FF0000\" |\n| National Republican Party\n|\n| data-sort-value=\"Hernandez Martinez, Maximiliano\" style=\"line-height:1.0\" | Maximiliano Hernández Martínez\n|-\n| style=\"background-color:blue\" |\n| Constitutional Party\n|\n| data-sort-value=\"Molina, Miguel Tomas\" style=\"line-height:1.0\" | Miguel Tomás Molina}}\n|}\nThe candidates' ideologies varied. Araujo was a prominent laborist leader who was stylized as the \"champion of labor\". Martínez also attempted to gain the favor of the laborist movement but was considered to be a political unknown. Gómez Zárate was a conservative who had ties to the Meléndez–Quiñónez dynasty, having held several offices during its rule, while Claramount was an \"extreme conservative\". Córdova and Molina were reformists who were supported by progressives in the middle class.\nRomero did not choose a designated successor as had occurred in prior presidential elections. In July 1929, he wrote that \"the Salvadoran people will select freely their future President without recommendation of imposition of any kind\". Although Romero never publicly picked a successor, according to American historian Thomas Anderson, Romero sympathized with Córdova and Molina, as both were fellow reformers, but that Romero was unable to pick between the two. According to Anderson, this is why Romero allowed all candidates to participate in the election.\nElection campaign\n}}\nBy 11 May 1930, Córdova, Gómez Zárate, and Molina declared their participation in the 1931 presidential election. Araujo, who ran as a presidential candidate in the 1919 election, was named as a potential candidate by the Diario del Salvador newspaper on 20 May, but he had not yet made any formal announcement. On 28 May, both Martínez and Claramount resigned from their positions in the army and declared their candidacies. On 13 June, Claramount, Gómez Zárate, Martínez, and Molina held a meeting to establish the election's rules where it was decided the winner would be the candidate of the \"masses\". Araujo declared his candidacy on 4 July.\nAll of the candidates held campaign rallies and organized local political party chapters, but many of their campaign promises were vague or similar to those of the other candidates. For example, Gómez Zárate ran a broad campaign that sought to appease all voters. Conversely, Araujo openly aligned himself with El Salvador's labor movement. In July 1930, his party published an \"Open Letter Directed to the Salvadoran Workers and Peasants\" that described Araujo as a \"true friend of the working class [...] who knows [the worker's] sufferings, the precarious situation in which they live, and who listens to their anguished voices\". Party members also promised land redistribution, but Araujo himself publicly denied that he had made this promise as he was a wealthy landowner.\nAraujo and Gómez Zárate were the election's frontrunners. As Gómez Zárate served as Romero's Minister of War, the Navy, and Aviation, he had the military's support. Araujo attempted to tie Gómez Zárate to events that occurred during the Meléndez–Quiñónez dynasty, including the 1922 Christmas Day Massacre of people who supported Molina in the 1923 presidential election. One week before the election, Martínez suspended his campaign and endorsed Araujo in exchange for becoming Araujo's running mate, likely due to Martínez believing he would not be able to win the election. Meanwhile, Araujo hoped that Martínez being his vice president would ease relations with the armed forces as Gómez Zárate was the armed forces' preferred candidate. This was the only coalition formed for the 1931 presidential election. American historian Thomas Anderson believed that Martínez's endorsement did not sway many voters.\nResults\n}}\nThe 1931 presidential and legislative elections were held on 11 through 13 January. There were 392,383 registered voters in the 1931 elections accounting for 27.4 percent of El Salvador's population. In total, 228,866 valid votes were cast. All men were eligible to vote. A candidate had to receive an absolute majority of the votes in order to become President; if no candidate won an absolute majority, the Legislative Assembly would elect the president.\nPrior to and during the three days that votes were cast, there were hundreds of complaints of electoral fraud, although none reported any violence. When the votes were counted, Araujo finished first with 106,777 votes, followed by Gómez Zárate in second with 64,280 votes, Córdova in third with 34,499 votes, Claramount in fourth with 18,399 votes, and Molina in fifth with 4,911 votes.}}}} Araujo won a plurality of the votes but not an absolute majority.\nAs no candidate won an absolute majority, the Legislative Assembly was scheduled to elect the president on 12 February 1931. The legislature was able to pick from the top three candidates. Córdova told his supporters in the Legislative Assembly to vote for Araujo. On 12 February, the members of the Legislative Assembly elected in the 1931 legislative election convened for the legislature's first session. They unanimously elected Araujo as El Salvador's next president and Martínez as El Salvador's next vice president.\n}}\nAftermath\n(second from the right), Pío Romero Bosque (to Araujo's right), and Maximiliano Hernández Martínez (far left) at Araujo's inauguration in 1931]]\nMost the candidates accepted the result of the election, but Claramount claimed that there was fraud and called for the armed forces to stage a coup d'état. Leitzelar mobilized police officers in San Salvador to prevent this from occurring. Warren Delano Robbins, the United States minister to El Salvador, was worried that the armed forces would stage a coup and ordered the USS Sacramento gunboat stationed in Panama to be on standby for a potential mobilization to El Salvador. This never occurred, however, as Martínez being Araujo's running mate satisfied the armed forces. Robbins later described the conduct of the 1931 presidential election as \"[being] carried through in admirable fashion\". Contemporary observers described the election as having been free and fair.\nAraujo and Martínez became President and Vice President of El Salvador, respectively, on 1 March 1931. Araujo reaffirmed his commitment to supporting Salvadoran workers. He became President when El Salvador's economy was struggling in part due to the Great Depression and the collapse of coffee prices. Araujo's presidency only lasted ten months, culminating in a military coup d'état on 2 December 1931 that overthrew Araujo. On 4 December, the armed forces proclaimed Martínez as the country's president. The following week, Martínez convinced two of the 1931 presidential candidates—Gómez Zárate and Molina—to legitimize his presidency by publicly supporting it. Córdova withdrew from public life and came under surveillance for opposing Martínez, while Claramount's party challenged Martínez in the 1932 municipal election. Martínez ruled El Salvador as its longest serving president until his resignation in 1944.\nNotes\nReferences\nCitations\nBibliography\nBooks\n*\n*\n* }}\n*\n*\nJournals\n*\nNewspapers\n* }}"
    }
  ]
}