{
  "content": [
    {
      "type": "text",
      "text": "# 1935 United Kingdom general election\n\n5.3 pp)\n| image1 =\n| leader1 = Stanley Baldwin\n| leader_since1 = 23 May 1923\n| party1 = Conservative Party (UK)\n| alliance1 = National Government\n| leaders_seat1 = Bewdley\n| last_election1 = 470 seats, 55.0%\n| seats1 = 387\n| seat_change1 = 84\n| popular_vote1 = 10,025,083\n| percentage1 = 47.8%\n| swing1 = 7.2 pp\n| image2 =\n| leader2 = Clement Attlee\n| leader_since2 = 25 October 1935\n| party2 = Labour Party (UK)\n| leaders_seat2 = Limehouse\n| last_election2 = 52 seats, 30.6%\n| seats2 = 154\n| seat_change2 = 102\n| popular_vote2 = 7,984,988\n| percentage2 = 38.0%\n| swing2 = 7.4 pp\n| image3 =\n| leader3 = John Simon\n| leader_since3 = 5 October 1931\n| party3 = Liberal National\n| alliance3 = National Government\n| leaders_seat3 = Spen Valley\n| last_election3 = 35 seats, 3.7%\n| seats3 = 33\n| seat_change3 = 2\n| popular_vote3 = 784,608\n| percentage3 = 3.7%\n| swing3 = 0.0 pp\n| image4 =\n| leader4 = Herbert Samuel\n| leader_since4 = 1931\n| party4 = Liberal Party (UK)\n| leaders_seat4 = Darwen  (defeated)\n| last_election4 = 33 seats, 6.5%\n| seats4 = 21\n| seat_change4 = 12\n| popular_vote4 = 1,414,010\n| percentage4 = 6.7%\n| swing4 = 0.2 pp\n| image5 =\n| leader5 = Ramsay MacDonald\n| leader_since5 = 24 August 1931\n| party5 = National Labour Organisation\n| alliance5 = National Government\n| leaders_seat5 = Seaham (defeated)\n| last_election5 = 13 seats, 1.5%\n| seats5 = 8\n| seat_change5 = 5\n| popular_vote5 = 321,028\n| percentage5 = 1.5%\n| swing5 = 0.0 pp\n| map_image = 1935_UK_general_election_map.svg\n| map_size = 340px\n| map_caption = Colours denote the winning party—as shown in\n| title = Prime Minister\n| posttitle = Prime Minister after election\n| before_election = Stanley Baldwin\n| before_party = National Government (UK)\n| after_election = Stanley Baldwin\n| after_party = National Government (UK)\n| map2_image =\n| map2_caption = Composition of the House of Commons after the election\n}}\nThe 1935 United Kingdom general election was held on Thursday 14 November 1935. It resulted in a second (though reduced) landslide victory for the three-party National Government, which was led by Stanley Baldwin of the Conservative Party after the resignation – due to ill health – of Ramsay MacDonald earlier in the year. It is the most recent British general election to have seen any party or alliance of parties win a majority of the popular vote.\nAs in 1931, the National Government was a coalition of the Conservatives with small breakaway factions of the Labour and Liberal parties, and the group campaigned together under a shared manifesto on a platform of continuing its work addressing the economic crises caused by the Great Depression. The re-elected government was again dominated by the Conservatives, but, while the National Liberals remained relatively stable in terms of vote share and seats, National Labour lost most of its seats – including that of leader Ramsay MacDonald.\nThe Labour Party, under what was then regarded internally as the caretaker leadership of Clement Attlee, was the main beneficiary of the swing away from the Conservatives and National Labour. The party achieved its then-best-ever result in terms of share of the popular vote, and won back around half of the seats it had lost in the previous election. The Liberals, who had split from the National Government in 1932 over the issue of free trade, continued their decline, losing more than half of their seats (including that of leader Sir Herbert Samuel).\nThe election ushered-in an era of two-party politics dominated by the Conservatives and Labour, which would last until the revival of the Liberals in the 1970s under Jeremy Thorpe. It was also the first election since 1895 in which the Independent Labour Party stood separately from the Labour Party, having disaffiliated in 1932. In Scotland, it was the first general election contested by the Scottish National Party, and the Communist Party gained its first seat in ten years (West Fife).\nDue to the outbreak of the Second World War in 1939, the next general election was not held until 1945. It was also the last election to be held during the reign of George V, who died in January 1936.\nBackground\nNational Labour leader Ramsay MacDonald had led the National Government since its victory in 1931, but the Conservatives were by far the largest party within the coalition, with 470 of its 554 seats. MacDonald's health was increasingly poor throughout his time as Prime Minister, and in June 1935 he handed his office to Conservative leader Stanley Baldwin.\nAfter the near-wipeout of 1931 saw Labour leader Arthur Henderson lose his seat, George Lansbury became the party's new leader. However, as a radical Christian pacifist he strongly opposed rearmament, putting him at odds with his party's membership, his own MPs, and many of the party's affiliated trade unions, all of whom had begun to view investing in the UK's military capabilities as a necessary response to the rising threat of European fascism.\nThis disagreement came to a head at Labour's annual conference in October 1935, where a motion was tabled for the party to endorse sanctions against Italy for its invasion of Abyssinia. Lansbury opposed the motion, but when it passed he decided that his position was untenable and he resigned on 8 October. Baldwin, recognising that the government's main opposition was in disarray and seeking a mandate for his new administration, called an election on 19 October, and Parliament was subsequently dissolved on 25 October. Without time to choose a new leader before the general election, Lansbury's deputy, Clement Attlee, was appointed interim leader.\nAs in 1931 the election was dominated by the impact of the Great Depression—in particular persistently high unemployment—and the National Government sought to continue its program of reforms designed to repair the economy. However, foreign policy and defence were significantly more important than in the previous election, with the role of the League of Nations, the increasing belligerence of the Empire of Japan, the remilitarisation of Germany under Adolf Hitler, and the Italian invasion of Abyssinia all key issues. There was a heated internal debate within the National Government over the extent to which rearmament should be pursued in response to the rising threat of another war in Europe. Baldwin was generally opposed to rearmament, and the coalition's manifesto reflected his position, promising that rearmament would be \"strictly confined to what is required to make the country and the Empire safe.\"\nThe Liberal Party had fractured into three separate factions in 1931 over the question of whether to support the National Government's policy of trade protectionism, and it remained just as divided over economic policy in 1935. The party and the Independent Liberal group set up by former leader David Lloyd George had gradually been re-aligning during the previous years, but a full reunification did not occur in time for the election, causing Lloyd George to restrict his personal fortune (on which the Liberals had relied greatly during his time as leader) to funding the campaigns of his allies. Lacking financial resources, the main Liberal Party was only able to put up candidates in 159 constituencies.\nOutcome\nThe election resulted in another landslide for the National Government, with two-thirds of the seats in the House of Commons and a narrow majority of the overall popular vote. This was a less dominating performance than in 1931 – when the coalition had won two-thirds of the vote and 90.1% of seats – but it was still a clear mandate for the National Government to continue its programme of economic reforms.\nIt remains the most recent election in which any party or alliance of parties secured a majority of the popular vote. (The coalition between the Conservatives and Liberal Democrats that formed after the 2010 general election represented 59.1% of votes cast, but the two parties campaigned against each other.) It was also the last election until 1997 in which any party or alliance of parties won more than 400 seats.\nDespite Labour's success in terms of vote share – higher than Ramsay MacDonald's result in 1929, Harold Wilson's in February 1974, Tony Blair's in 2005, and Keir Starmer's in 2024, all of which put the party into government – the 1935 general election remains the most recent at which the party has won fewer than 200 seats. Attlee won Labour's subsequent leadership election on 26 November 1935, and he would go on to become the first Labour leader to both win a plurality of votes in a general election and a majority of seats in the House of Commons (in 1945).\nLabour's revival came at the expense of National Labour, which lost five of its 13 seats, including Ramsay MacDonald's own seat of Seaham. MacDonald was able to rejoin the Commons thanks to a by-election victory only two months later, in January 1936; however, after his death in November 1937 the party struggled under the new leadership of his son, Malcolm MacDonald, and it eventually disbanded ahead of the 1945 election.\nThe election also marked the continued decline of the Liberals from a natural party of government into a fringe third party within a two-party system dominated by the Conservatives and Labour. The 21 seats secured in 1935 and the 12 seats secured in 1945 proved to be the last occasions until 1966 that the Liberal Party won more than ten seats at an election, and the 1935 election was the last time (before its alliance and merger with the Social Democratic Party in the 1980s) that the party won more than 20 seats. The National Liberals within the government, meanwhile, struggled in the following years to differentiate themselves from their coalition partners, and the party's small rump of MPs were absorbed into the Conservatives in 1968.\nThe resulting parliamentary term would see two changes of Prime Minister: Neville Chamberlain took over from Baldwin in 1937, and then Chamberlain himself resigned in 1940 and was replaced by Winston Churchill, who formed a new cross-party wartime coalition which included the Labour and Liberal parties. Due to the war, another general election was not held until Allied victory was confirmed in 1945.\nResults\n|colspan=12 bgcolor=#E0E0E0 align=\"center\"|National Government\n|-\n|-\n|colspan=1 bgcolor=#000000 align=\"left\"|\n|colspan=1 bgcolor=#efefef align=\"left\"| National Government (total)\n|colspan=1 bgcolor=#efefef align=\"left\"| Stanley Baldwin\n|colspan=1 bgcolor=#efefef align=\"right\"| 583\n|colspan=1 bgcolor=#efefef align=\"right\"| 429\n|colspan=1 bgcolor=#efefef align=\"right\"| 12\n|colspan=1 bgcolor=#efefef align=\"right\"| 139\n|colspan=1 bgcolor=#efefef align=\"right\"| &minus;125\n|colspan=1 bgcolor=#efefef align=\"right\"| 69.8\n|colspan=1 bgcolor=#efefef align=\"right\"| 51.8\n|colspan=1 bgcolor=#efefef align=\"right\"| 11,183,908\n|colspan=1 bgcolor=#efefef align=\"right\"|&minus;15.4\n|-\n|colspan=12 bgcolor=#E0E0E0 align=\"center\"|Opposition\n|-\n|seats      = 154\n|gain       = 105\n|loss       = 3\n|net        = +102\n|votes      = 7,984,988\n|votes %    = 38.0\n|seats %    = 25.0\n|plus/minus = +7.4\n}}\n|seats      = 4\n|gain       = 0\n|loss       = 0\n|net        = 0\n|votes      = 67,653\n|votes %    = 0.3\n|seats %    = 0.7\n|plus/minus = &minus;0.2\n}}\n|}\n}}\nVotes summary\n|47.76}}\n|38.04}}\n|6.74}}\n|3.74}}\n|1.53}}\n}}\n|38.04}}\n|6.74}}\n}}\nSeats summary\n|62.93}}\n|25.04}}\n|5.37}}\n|3.41}}\n|1.30}}\n}}\n|25.04}}\n|3.41}}\n}}\nTransfers of seats\n* All comparisons are with the 1931 election.\n**In some cases the change is due to the MP defecting to the gaining party. Such circumstances are marked with a *.\n**In other circumstances the change is due to the seat having been won by the gaining party in a by-election in the intervening years, and then retained in 1935. Such circumstances are marked with a †.\n{| class=\"wikitable sortable\" style=\"margin:1em\"\n!colspan=2|To\n!colspan=2|From\n!No.\n!class=unsortable|Seats\n|-\n|\n| bgcolor=\"\" rowspan=\"2\" |\n| rowspan=\"2\" |\n|1\n|Fife West\n|-\n|\n|1\n|Camlachie\n|-\n| bgcolor=\"\" rowspan=\"5\" |\n| rowspan=\"5\" |\n|\n|11\n|Edinburgh East, South Shields, Durham, Bethnal Green North-East†, Lambeth North†, Whitechapel and St Georges, Middlesbrough East, Dewsbury, Colne Valley, Wrexham, Carmarthen\n|-\n|\n|6\n|Ilkeston, Seaham, Forest of Dean, Finsbury, Tottenham South, Bassetlaw\n|-\n|\n|7\n|Western Isles, Dunfermline Burghs, Bishop Auckland, Consett, Shoreditch, Barnsley, Burnley\n|-\n|  Independent\n|2\n|Southwark Central, Burslem\n|-\n|\n|79\n|Aberdeen North, Stirling and Falkirk, Clackmannan and Eastern Stirlingshire, Stirlingshire West, Kirkcaldy Burghs, Maryhill, Motherwell, Bothwell, Coatbridge, Springburn, Tradeston, Ayrshire South, Linlithgow, Whitehaven, Derbyshire North East, Chesterfield, Blaydon, Houghton-le-Spring, Jarrow, Barnard Castle, Sedgefield, East Ham S, Leyton West, Romford, Upton†, Bristol South, Kingston upon Hull Central, Kingston upon Hull East, Ashton-under-Lyne, Farnworth, Ardwick, Clayton, Gorton, Platting, Rochdale, Everton, West Toxteth, Newton, St Helens, Brigg, Battersea North, Camberwell North, Deptford, Hackney Central, Hackney South, Hammersmith North†, Islington South, Islington West, Rotherhithe, Southwark South East, Mile End, Willesden West, Edmonton, Tottenham North, Morpeth, Nottingham West, Cannock, Hanley, Kingswinford, Leek, Stoke, Wednesbury†, West Bromwich, Nuneaton, Shipley, Wakefield†, Sheffield Park, Rotherham†, Bradford Central, Keighley, Pontefract, Hillsborough, Attercliffe, Brightside, Penistone, Leeds South, Doncaster, Batley and Morley, Nelson and Colne\n|- class=\"sortbottom\"\n! style=\"text-align:left\" colspan=\"4\" |Labour gains:\n! style=\"text-align:left\" colspan=\"2\" |105\n|-\n|\n|\n|3\n|Cumberland North, Barnstaple, Berwick-upon-Tweed\n|-\n|\n| rowspan=\"2\" bgcolor=\"\" |\n| rowspan=\"2\" |\n|1\n|Leicester West\n|-\n| bgcolor=\"\" rowspan=\"2\" |\n| rowspan=\"2\" |\n|1\n|Walsall*\n|-\n|\n|2\n|Sunderland (one of two), Oldham (one of two)\n|- class=\"sortbottom\"\n! style=\"text-align:left\" colspan=\"4\" |National Liberal gains:\n! style=\"text-align:left\" colspan=\"2\" |3\n|-\n|  Independent\n|\n|1\n|Brecon and Radnor\n|-\n| bgcolor=\"\" rowspan=\"2\" |\n| rowspan=\"2\" |\n|\n|4\n|Orkney and Shetland, Banff, Bodmin, Darwen\n|-\n|\n|1\n|Flintshire\n|- class=\"sortbottom\"\n! style=\"text-align:left\" colspan=\"4\" |Conservative gains:\n! style=\"text-align:left\" colspan=\"2\" |5\n|}\nConstituency results\nThese are available on the Political Science Resources Elections Database, a link to which is given below.\nSee also\n*List of MPs elected in the 1935 United Kingdom general election\n*List of MPs for constituencies in Wales (1935–1945)\n*1935 United Kingdom general election in Northern Ireland\n*1935 United Kingdom general election in Scotland\nReferences\nFurther reading\n*\n*\n*\nManifestos\n*[http://www.conservativemanifesto.com/1935/1935-conservative-manifesto.shtml 1935 Conservative manifesto]\n*[https://web.archive.org/web/20031204211301/http://www.labour-party.org.uk/manifestos/1935/1935-labour-manifesto.shtml 1935 Labour manifesto]\n*[http://www.libdemmanifesto.com/1935/1935-liberal-manifesto.shtml 1935 Liberal manifesto]"
    }
  ]
}