{
  "content": [
    {
      "type": "text",
      "text": "# 1937 in the Spanish Civil War\n\nIn 1937, the Nationalists, under the leadership of Francisco Franco began to establish their dominance. An important element of support was their greater access to foreign aid, with their German and Italian allies helping considerably. This came just as the French ceased aid to the Republicans, who continued, however, to be able to buy arms from the Soviet Union. The Republican side suffered from serious divisions among the various communist and anarchist groupings within it, and the communists undermined much of the anarchists' organisation.\nWith his ranks being swelled by Italian troops and Spanish colonial soldiers from Morocco, Franco made additional attempts to capture Madrid in January and February 1937, but failed again.\nOn February 21 the League of Nations Non-Intervention Committee ban on foreign volunteers went into effect. The large city of Málaga was taken on February 8. On March 7, the German Condor Legion equipped with Heinkel He 51 biplanes arrived in Spain; on April 26 they bombed the town of Guernica (Gernika) in the Basque Country; two days later, Nationalist General Emilio Mola's men entered the town.\nAfter the fall of Guernica, the Republican government began to fight back with increasing effectiveness. In July, they made a move to recapture Segovia, forcing Franco to pull troops away from the Madrid front to halt their advance. Mola, Franco's second-in-command, died in a plane crash on June 3, and in early July, despite the fall of Bilbao in June, the Republican government launched a strong counter-offensive in the Madrid area, which the Nationalists repulsed with some difficulty. This was the Battle of Brunete (Brunete is a town in the province of Madrid).\nFranco soon regained momentum, invading Aragon in August and then taking the city of Santander (now in Cantabria). On August 28, the Vatican recognized the Franco government. Two months of bitter fighting followed and, despite determined Asturian resistance, Gijón fell in late October, effectively ending the war in the North. At the end of November, with the Nationalists closing in on Valencia, the government moved again, from Valencia to Barcelona.\nDetailed chronology\nJanuary–March\n;January 5: Nationalist General Orgaz with 18,000 men attacks the roads north west of Madrid in an attempt to cut the city's supply lines. Madrid is suffering several air raids daily, and sometimes nighttime raids as well.\n;January 6: Nationalists take Boadilla del Monte. The International Brigades (IBs) defended the town; one of the few survivors of the Internationals is Esmond Romilly, 18-year-old nephew of Winston Churchill. Romilly volunteered despite his famous uncle's open sympathy for Francisco Franco, like that of most of his colleagues in the ruling British Conservative Party.\n;January 11: The Nationalist offensive northwest of Madrid is stopped. Both sides, temporarily exhausted after heavy casualties, start to build trenches and dig themselves in.\n;January 17: The Nationalists begin the battle to take Málaga. Three Nationalist columns converge on the city from Sevilla and Granada.\n;January 19: General Enrique Líster with the IBs gains back the Cerro de los Ángeles next to Madrid. This hill overlooks the city; the heavy Nationalist artillery there had been shelling the city. The IBs become more and more the key units in the Spanish Republican Army.\n;February 5: A Nationalist army approaches Málaga. The situation in Málaga epitomizes the worst conditions existing in the Republican zone: perhaps 600 hostages are held on a prison ship in the harbor, and groups of them are shot in reprisal for the air raids over the port. The sailors' committees in the fleet and the city administration are divided in mortal rivalry between the CNT and the Communist Party of Spain. Like all Republican cities, there is no anti-aircraft defense. Its militiamen, mostly anarchists, and not yet reorganized into the new Popular Army, built no trenches or roadblocks, because they consider this cowardice. The government assigns Colonel Villalba, a professional officer, to organize the defense, but without guns to place on the heights, without ammunition to give his soldiers, and without the slightest possibility of controlling the rivalries within the city, there is virtually nothing he can do. The invading force consists of some 10,000 Moors, 5,000 Requetés (right-wing militiamen), 5,000 Italians and plentiful supplies of trucks and artillery. They have only a few tanks and planes, but they can use these with maximum effectiveness in the virtual absence of effective deterrents.\n;February 6: Nationalists start a powerful offensive in the Jarama Valley. Nationalist General Orgaz is in command of around 40,000 troops, most of them Spanish Foreign Legion and Moroccan cavalry, supported by anti-tank artillery, two battalions of German-operated heavy machine guns (German ground troops under the command of the Condor Legion), German-operated tanks and planes (Condor Legion), and 600 Blueshirts under the command of the right-wing Eoin O'Duffy. The Nationalists want to cut the main Madrid-Valencia highway. General Pozas, commander of the new Central Army of the Republic, is planning his own offensive against the Nationalist line and is therefore massing men and material in the same area. Due to their own planned offensive, the Republicans fail to fortify their high ground, and the Nationalist offensive takes them completely by surprise. The hills are quickly lost, as are the two principal bridges. The Republican guards on the bridges are killed in the night by Moorish commando units. The guards on the Pindoque Bridge manage to mine the bridge during the attack, but it remains usable for enemy tanks and trucks. Citizens flee Málaga. About 100,000 people begin a disorganized mass exodus along the coastal road to Almería. The road is blocked by slow vehicles and wounded people; for the next two weeks, the Nationalist air force and navy bomb the road at will. German warships of the Non-Intervention Committee participate in the shelling, sometimes in the presence of Royal Navy vessels which do nothing to intervene. (Until the 1960s, truck drivers continued to find skeletons of those who fled Málaga in February 1937)\n;February 8: Málaga taken by Franco's troops. The militiamen resisted rifle and grenade fire, but broke at the totally unfamiliar sight of tanks. The Nationalists start immediately to take an enormous number of prisoners and to execute them. For example, participation in a strike several years previously is grounds for execution. The Italian military authorities are horrified at the number of executions and the mutilations practiced on the corpses and those who were wounded, as well as the mass rape of women. Nationalists advance in the Jarama Valley. Soviet tanks slow down the advance for brief periods, but the Nationalists quickly concentrate heavy artillery fire and force their withdrawal. The planes of the Condor Legion control the air.\n;February 10: The XIV and XV IBs fortify the Republican army in the Jarama. The troops stop the Nationalist advance, but take horrible losses in doing so. At one point the Nationalists force approximately 30 survivors of a captured British machine gun group to advance in front of their attack; half of these men die under fire of their own comrades.\n;February 12: Air supremacy for the Republic at the Jarama front, all-out attack on the last Republican positions. 40 new Russian airplanes arrive at the Jarama front, giving the Republic air supremacy in the area. These planes consist of 15 ground strafers and 25 fighters, the fighters are nicknamed \"Chatos\". The arrival of these planes forces the enemy planes to retreat. On the night of February 12, Nationalist General Orgaz commits all his reserves to gain control over the last key positions that still prevent his forces from cutting the Valencia highway. Several companies of the IBs &mdash; including British and Polish &mdash; as well as Spanish companies, were \"cut to pieces\" attempting to hold these positions.\n;February 15: The force of the offensive in the Jarama had spent itself. As in the Battle of the Corunna Road, the Nationalists have gained ground, but strategic victory had escaped them. The Foreign Legion is broken. Around 20,000 men died in the 10 days of the Jarama Battle, two thirds of them Republicans.\n;February 17: The anarchist writer Pedro Orobon dies in an air raid at Madrid.\n;February 21: Republican General José Asensio Torrado dismissed, after the fall of Málaga.The League of Nations Non-Intervention Committee's ban on foreign national and stateless \"volunteers\" went into effect.\n;February 27: The newly formed Abraham Lincoln Battalion, part of the IBs, consisting mostly of North Americans had arrived at the Jarama front February 13; they are ordered to carry out a suicidal attack. 127 men die and more than 200 are wounded. Responsibility for poorly planned attack lies on Brigade Commander Copic, who refuses to see the wounded leader of the \"Lincolns\", Robert Hale Merriman, after the disastrous, failed action.\n;March 5: First council of the PCE (Communist Party of Spain) in the war. The PCE makes a declaration in favor of democracy and against revolution and Trotskyism. The delegates sharply attack the government and the CNT.\n;March 8: Strong Nationalist attack in the Guadalajara starts at 7 a.m. Italian troops quickly break the front and, by the end of the day, dominate the heights, from which they can \"roll\" downhill to Madrid. Their plan is to advance to Madrid via Brihuega and Guadalajara. The attacking force includes 250 tanks, 180 pieces of artillery, 4 motorized machine gun companies, about 70 planes and a large number of trucks.\n;March 9–March 11: The Italians are moving too rapidly for their units to preserve communications and supply lines. A sudden turn in the weather catches the Italian trucks in a snow and sleet storm, just as the Republicans begin to hold firm south of Brihuega and Trijueque. While the Italian planes are grounded by the weather, the Republican air force is operating at considerable risk from airfields outside of the bad weather zone. Low-flying fighters are machine-gunning the stalled truck columns while vintage 1918 Breguets, which had survived the summer air battles, run bombing missions. Vittorio Vidali and Luigi Longo, the political leaders of the IB Garibaldi battalion (Italian volunteers on the Republican side), mount a propaganda campaign intended to destroy the morale of the CTV, pulling loudspeakers up to the lines and dropping leaflets from the air, exhorting the Italian soldiers not to shoot against their brother workers and to leave the Fascists.\n;March 12: The Republican forces start a massive counterattack, with the support of 70 Russian tanks and strong air cover. The CTV has no AA artillery, and it suffers heavily from air attack; most casualties belong to XI Gruppo de Banderas, whose commander (Console Liuzzi) is killed.\n;March 13: Improving weather allows the Italian planes to cover the withdrawal of Division III \"Penne Nere\" from the Trijueque sector, and the battle is more or less stabilized.\n;March 18: Republican divisions under Cipriano Mera and Enrique Líster with 60 T-26 tanks of the Pavlov Brigade take back Brihuega, causing the collapse of the Italian front and the rout of Division I \"Dio lo Vuole\", which in turn forces Division IV \"Littorio\" to abandon its positions. The rout is not stemmed until the morning of next day.\n;March 19: The Guadalajara battle ends, the rout stops short of the bases from which the Nationalist attack started. The Italians admit the loss of 650 killed, 1,994 wounded and some 500 prisoners, plus 90 vehicles and 25 guns. During the retreat of the Nationalists, the Republicans capture large stocks of equipment, and a mass of documentary evidence about the Italian intervention in Spain. The government is hoping to lay this evidence before the Nonintervention committee. The so-called \"London Committee\" will declare itself incompetent to receive this evidence from any source not represented in the Committee itself. Thereupon the Spanish Foreign Minister, Alvarez del Vayo, will exhibit the documents before the League of Nations Assembly in Geneva.Ernest Hemingway is reporting for United States newspapers from the battle and the war. He collected US$40,000 in the US to buy ambulances for the Republic. U.S. public opinion tends strongly in favor of the Republic, but right-wing and anti-Communist forces in the government control U.S. foreign policy.\n;March 31: Nationalist General Mola starts a new offensive in the north with 50,000 troops. After failing in the capture of Madrid, the Nationalist army is concentrating in a campaign against the Basques. In the morning hours the Condor Legion starts a new tactic: massive terror strikes against nonmilitary targets, the annihilation of complete villages. The small town Durango suffers the first attack; some of the first bombs fall into the church during the well attended morning Mass. Fighters fly low and machine-gun the fleeing population. The Nationalists also attack a nearby cloister, killing 15 nuns. Around 300 people die in this air raids, 2,500 are wounded, practically all of them civilians. A second air attack takes place as fire brigades, police and ambulances from Bilbao try to help the victims.\nApril–June\n;April 3: The CNT declares that the revolution must continue. In opposition to the declaration of the Spanish Communist Party (PCE) last month, which was pro-parliamentary democracy and against social revolution, the anarchist CNT declares that \"revolution must go on\" and that such a policy  constitutes the greatest strength against fascism. The anarchists control the province of Aragon and are strong throughout all of Spain.\n;April 5: To tie down Nationalist forces and to help therefore the Basque Army in the north, the Republican Army initiates a big offensive in Brunete.\n;April 8: The PCE and the PSOE (Spanish Socialist Workers' Party) sign a pact, committing them to work together. This creates tensions between the socialist unions and Spain's strongest union, the anarchist CNT.General Miaja's troops attack Nationalist positions in Garabitas and Casa de Campo.\n;April 11: Republican army attacks Nationalist positions in Santa Quitera.\n;April 14: 6th anniversary of the Second Spanish Republic\n;April 16: The Republican government restricts the attributions of war commissars, made under pressure of the Soviet advisors and the PCE.\n;April 19: Decree of Unification: Franco declares the amalgamation of the hard right Falange and the conservative Catholic Carlists, creating the Falange Española Tradicionalista y de las Juntas de Ofensiva Nacional-Sindicalista (FET y de las JONS). With this Franco is not only the military leader of the rebellion, but also its political leader.\n;April 23: Dissolution of Madrid \"Junta de defensa\"; the high command of the Republican army, under the ministry of war, resumes command of the frontlines at Madrid.\n;April 26: Bombing of Guernica, the Condor Legion's terror bombing of the city most strongly identified with Basque national identity. Gernika is nearly destroyed by close to three hours of bombing; civilian targets hit and the retreating Basque Army are hit; military factories are specifically not targeted, presumably because the Nationalists intend to capture these intact. Also spared are the Gernikako Arbola, traditional seat of the Biscayne assembly, and the adjoining neoclassical Casa de Juntas, its modern seat. The attack comes on a market day, so the human carnage is vast. Initially proud of the attack, the Nationalists soon realize that they have shocked the world; they soon spread the tale that the retreating Basque Army destroyed the city themselves.\n;April 30: The Nationalist battleship España (formerly the Alfonso XIII) hits a mine and sinks off the coast of Santander.\n;May 1 : This year's parade for the international labour day is prohibited in Barcelona. In recent weeks in Barcelona, confrontations between city police and worker-organized Control Patrols (a sort of police militia, in duty since the outbreak of the military rebellion in June 1936), have led to such a tense atmosphere that the regional Catalan Government prohibits the traditional May Day parade.\n;May 3 : Violent incident at the Barcelona central telephone office. Without knowledge of the Catalan government, the Catalan councilor for public order, the Communist Rodriguez Salas, tries to take control over the city's central telephone office, which has been controlled since the beginning of the war by the CNT and UGT. Salas got this order directly from the Catalan minister for inner affairs, Ayguade, also a Communist. A company of Assault Guards storms the building around 3 p.m., arresting everybody they can. The armed guards on the machine gun post at the stairs on the second floor are not informed in advance, nor is anyone else in the building. When they see armed uniformed men coming up the stairs and hear the yells and shouting from the first floor they shout \"stop there and don't come up\" at which point a gunfight breaks out. The anarchist guards resist their attackers and keep control of the upper floors of the building. This skirmish leads to fighting throughout the city. Several hundred barricades are built; Communist-controlled police units occupy high buildings and church towers, shooting at everything that moves. The Communists attack not only the CNT, they also arrest the Workers' Party of Marxist Unification (POUM) members. The actions are obviously well planned. Some police units and the Republican army stay neutral in the fighting, although army officers, if members of CNT/Iberian Anarchist Federation (FAI) or POUM, are also arrested if caught at Communist-controlled check points. The police director of Barcelona &mdash; a member of the CNT &mdash; together with the leader of the Control Patrols comes to the telephone central in an attempt to get the occupying police forces to leave the central peacefully. They have no success, instead Catalan prime minister Lluis Companys declares that he, like everyone else, was not informed in advance by his minister for internal affairs, but that he agrees all in all with the police action. The radio stations of the CNT and FAI call hourly upon their members to maintain public order and keep calm.\n;May 4: General strike in Barcelona. Gunfights throughout the city.\n;May 5: Companys obtains a fragile truce between the different fighting groups, on the basis of which Rodriguez Salas, now blamed for the police action against the telephone central, has to resign. Communist commandos are still arresting people and the Communist/Socialist official Antoni Sese is murdered, probably by anarchist gunmen.\n;May 6: \"Neutral\" police troops from Valencia arrive in Barcelona to stop the fighting. The 5,000 Assault Guards (chosen more or less carefully for their political opinions, to ensure a \"neutral\" force and the trust of both sides) occupy several strategic points throughout the city. The workers abandon the barricades and the telephone central is handed over to the government. When the Assault Guards enter the city and passed by the central building of the anarchist CNT, several hundreds of them salute the black and red anarchist flag on the building. Nevertheless, reprisals against the anti-Stalinist left are starting throughout the Republic.\n;May 7: The fighting in Barcelona concludes, with more than 500 dead and over 1500 wounded. Many are still under illegal arrest in several Communist-controlled police stations, militia barracks and secret prisons.\n;May 8: In Barcelona, police find the horribly mutilated bodies of 12 murdered young men.  Eight of the bodies are so mutilated that they cannot be identified. The four identified bodies belong to young anarchists, illegally arrested together with eight friends on May 4 outside the Communist militia barracks in Barcelona, when they were passing by on a truck with \"CNT\" written on it. The names of the identified young men are: Cesar Fernández Neri, Jose Villena, Juan Antonio, and Luis Carneras. Police also found the dead bodies of the Italian anarchist professor Berneri and two of his friends, who were arrested during the May incidents by Communist militias.\n;May 11: The Communist parties (PCE, PSUC) accuse the POUM of responsibility for the May incidents in Barcelona. While Spanish prime minister Caballero opposes accusation and the concurrent demand of the immediate removal of the Spanish minister of the Interior, Angel Galarza for failing to uncover the \"Trotskyite plot\" in Barcelona, he continues to lose power to the Communists.\n;May 13: The Communist ministers demand the suppression of the POUM, calling them a Fascist organization working for Franco, an accusation the Communist press has made for several months in propaganda campaigns against political opponents such as the Anarchist councils in Aragon.\n;May 15: Largo Caballero resigns, Juan Negrín becomes prime minister of the Spanish Republic. After fighting against domination of Spain by any one faction &mdash; Communist, anarchist,  or left Socialists &mdash; Caballero is left alone with no one on his side. Juan Negrín is presented as the man of the hour, leader of the \"Government of the Victory\", as the press presents him and his cabinet. There are no CNT ministers in this new government.\n;May 27: The new Negrín government accepts the accusations against the POUM and prohibits their newspaper La Batalla.\n;May 29: Daily air raids on Madrid continue, with the Nationalist air force again superior to the Republican. The German airplanes piloted by members of the Condor Legion are technically more advanced than the Russian airplanes used by the Republic. Spanish pilots are invited to Russia for training in Russian airplanes.During an attack by the Republican air force against Nationalist air bases and the port of Ibiza, the German heavy cruiser  enters the area of the port to threaten the Republican planes. Two Russian pilots, Captain Anton Progrorin and Lieutenant Wassily Schmidt, drop their bombs on the Deutschland, causing severe damage on the ship and killing 31 seamen.\n;May 30: German forces bomb Almería to repress Republican air attacks on the cruiser Deutschland. Because of the Deutschland incident, Germany and Italy leave the meetings of the Nonintervention committee. The German heavy cruiser  shells the port and the city of Almería with 200 shells, causing 19 deaths, 55 wounded, and destroying 150 houses. German and Italian capital ships are concentrated in the Mediterranean Sea next to Spain.\n;June 3: Nationalist General Mola dies in an airplane accident. Fidel Dávila takes over as commander of his troops, attacking Bilbao.\n;June 6: The Basque Army loses the last of its air force: the last Basque air fighters are shot down, the culmination of a suicidal resistance against the Condor Legion. Totally outnumbered, the pilots were flying day by day to relieve the soldiers in the trenches, and being destroyed one after the other by the enemy.\n;June 7: Falange official Manuel Hedilla, leader of the left wing of the fascist Falange, is condemned to death by a court martial. He had opposed Franco over aspects of his leadership of the war effort and the administration of the Nationalist occupied zone.\n;June 11: General Paul Lukacs, also known as Zalka Mate, born Bela Fankl, dies during an inspection of the Republican lines at Huesca. His car is hit by an artillery shell, the driver dies immediately. General Lukacs himself is mortally wounded on his right temple and dies several hours later.The \"Iron Ring\", el cinturón de hierro, is a vast, labyrinthine fortification around Bilbao, consisting of bunkers, tunnels, and fortified trenches in several rings, protected by artillery. The Basque Army had hoped to position themselves in the Iron Ring to resist constant air raids and prevent the enemy from reaching the Basque capital. However, the layout of the Ring was betrayed to the Nationalist army, and since the first days of June the Condor Legion have been able to target so accurately that the Ring is bombed to pieces. Basque President Aquirre comes to the front; he witnesses a horrible event at Mount Urcullu: A dried-out forest just behind part of the Iron Ring is shelled with fire bombs from enemy airplanes and artillery. Along a length of three kilometers, the defenders on this part of the Ring are overcome by the smoke. The attackers break through and occupy the heights near Bilbao, around 10 kilometers from the city. Basque General Gámir and the Basque government decide to organize a slow retreat to Santander.\n;June 12: The Nationalist troops breach the \"Iron Ring\".\n;June 13: Street fights in Bilbao, uprising of Nationalist supporters. As the army retreats, fifth columnists favoring the Nationalist side start a riot in the city to take over control of strategic buildings and are defeated under heavy losses by anarchist militias (the army is already retreating). Afterwards, Basque police prevent the militias from attacking Bilbao's prisons and killing imprisoned Nationalists.\n;June 16: The POUM is outlawed and its leaders are arrested. The secret police arrest most of the POUM leaders, though its head, Andreu Nin, cannot yet be found.\n;June 17: Nin is arrested in Barcelona. His arrest is not announced in public; Communist agents take him secretly to an illegal prison in Alcalá de Henares, near Madrid. Nin is interrogated under torture by NKVD agent Alexander Orlov.An explosion aboard the Republican battleship Jamie I at Cartagena causes about 300 deaths and the total loss of the ship.Bilbao shelled by 20,000 shells. President Aquirre gives the secret order to send 900 Nationalist prisoners over to the enemy, fearing for their lives in the city after the total retreat of the Basque Army. Juan Manuel Epalza leads the prisoners to the Nationalists in the night to June 19.\n;June 18: The Basque government refuses the order to destroy factories in Bilbao that are of value to a war effort. The Republican government want to prevent the Nationalists from gaining control of these plants. The Basque government refuses and is counting on the outbreak very soon of a general European war, in which the Nationalists will be beaten and they can gain back the plants.\n;June 19: The Nationalists enter Bilbao without opposition and begin immediately to distribute food to thousands of women lining the streets. Around 200,000 people flee the city. Thousands try to reach the French coast by sea, but the Nationalist navy is waiting for them in the Bay of Biscay. The bay is full of fugitive's overcrowded boats, some sinking. The ships from the Nonintervention Committee (in the Bay of Biscay, mostly British) are watching the scene. Franco concedes two thirds of the production from the mines and steel factories of the Basque country to his German ally. Hitler needs these resources for his own war preparations.\n;June 20: Soviet agents assassinate the POUM leader Andreu Nin.\nJuly–September\n;July 6: The International Brigades (IBs) under General Lister launch an offensive at Brunete, 25&nbsp;km west of Madrid, to lift the siege of Madrid and to draw some pressure off of the Basque army in the north. The Republic launches this attack with their best troops and equipment: around 50,000 men of four IBs (mostly the divisions of generals Lister, Kleber and Campesino), 100 modern Russian tanks and 100 Russian planes (about half the Republican air force). The armament of the soldiers themselves is poor: they are supplied with machine guns, grenades and artillery dating from World War I.\n;July 8: Franco sends reinforcements to the Brunete front. With this the Brunete offensive achieves one of it main goals, the relief of the Basque army, giving the Republican troops in the north the possibility of reorganizing their resistance. Franco sends 31 battalions, 7 batteries of artillery and the entire Condor Legion (around 70 planes and several motorized units). The Condor Legion uses their new and improved Bf 109s and Heinkel He 111s, superior to the Russian planes.\n;July 9: IBs take Quijorna.\n;July 11: Republican troops take Villanueva del Pardillo. Nationalist reinforcements reach the Brunete Front, artillery and Condor Legion hammering the Republican troops without pause; both sides are suffering horrible losses.\n;July 12: France opens the border. Angry at the permanent and obvious breaks of the Nonintervention by the Fascist states, France opens its border for several days, allowing a large amount of armaments from several countries to pass into the Spanish Republic.\n;July 14: The Republic bans criticism of the Soviet Union. This censorship is aimed especially against the anarchist and POUMist press and follows a large number of complaints by the Communist party and their press.\n;July 19: The Republican army retreats at Brunete, overwhelmed by the Nationalist forces. Until today the Republic, at terrible cost, held the bulge they created in taking Brunete. During  this period, the Nationalists concentrated overwhelming artillery and air power on the bulge, drawing upon supplies that had been accumulated for the Santander offensive; the Republican had no uncommitted reserves of men or weapons upon which to draw. Hundreds of retreating Republican soldiers, whose lives could have been saved by retreating while the Republican air force was still able to limit the freedom of the Condor Legion, die under the machine-gun fire of Heinkels and Messerschmitts. Gerda Taro, companion of Robert Capa, is heavily injured by an accident during the retreat.\n;July 26 : End of Battle of Brunete: Republican forces are thrown back to a position only 5&nbsp;km from where they started the offensive. The Republic lost around 20,000 men and half their air force, the Nationalists lost around 17,000 men.\n;August 2:  Nationalist militia leader Hedilla, sentenced to death for opposing General Franco, is imprisoned in Las Palmas. The death sentence against him is suspended by General Franco.\n;August 6: A fierce dogfight over the town of Torrelavega results in the loss of a dozen republican fighters, worsening the aerial support of republicans in the North.\n;August 7: Private Catholic worship is permitted in the Republic.\n;August 10: Consejo de Aragón (Council of Aragon) dissolved. Prime Minister Negrín is working steadily to affirm the authority of his government against all forms of regional and political dissidence. Today the government announces the dissolution of the anarchist-dominated Consejo de Aragón administration which had been recognized by Largo Caballero in December 1936. The Anarchist officials are arrested and the troops of General Lister, mostly Communists, behave like invaders. The revolutionary efforts and changes made by the Anarchists will be undone. The arrested officials will be released in a couple of weeks, after the authority of the council has been broken and central government authority established.\n;August 13: Nationalist under the command of General Dávila start their offensive against Santander, the next big city in their race towards Gijón. The Republican forces were the XIV Corps of the Army (Basque), XV Corps of the Army (Cantabrian), and the XVI and XVII Corps of the Army (Asturian). They lack an airforce and are further weakened by a dispute between the Basque prime minister Aguirre and the commanding general of the army, Gamir Ulibarri.\n;August 15: SIM created; political meetings in Barcelona forbidden. The SIM (Servicio de Inteligencia Militar) gives back the control of secret police activities to the government, rather than leaving it in the hands of Soviet and Communist intelligence organizations. Political meetings are forbidden in Barcelona from now on. The mixture of regionalism, anarchism, and defeatism, constituted a steady drain of the Republican war effort. Also the situation was unstable after the May incidents.\n;August 17: Socialist Party and Communist Party unity pact. The Communist party had demanded the fusion of the Socialist Party with the Communist Party, as would later happen in all Communist-controlled countries. The government refuses this demand as not appropriate for a democratic country. To put an end to this demand, the government moved the involved parties to declare a unity pact instead, leaving them independent.\n;August 24: The Republican Army, including International Brigades, starts a major offensive at Belchite and Quinto. The intent is to lay the ground for a later recapture of Zaragoza, a pro-Republican city in the hands of the Nationalists. Belchite and Quinto, the most important towns in their area, are defended by around 7,000 Nationalist militiamen, who turn out to be fanatically brave and resourceful defending the towns, involving the Republican troops in heavy streetfights.\n;August 26: The Republican Army at Santander breaks down under continual attack from troops, artillery and around 250 airplanes. Ten thousands of soldiers and civilians flee to the port of Santander. Only a few, among them General Gamir Ulibarri and the leader of the Basque government, Aguirre, can escape over the stormy Bay of Biscay, where overcrowded boats are sinking. In secret consultations the Autonomous Basque Government agreed with the Italian allies of General Franco to surrender in Santoña, east of Santander, on condition that the Basque heavy industry and economy was left untouched. Around 25,000 soldiers, 3,000 officers and several hundred officials of the Basque army and administration surrender themselves and hand over their weapons, the Italians agreeing to allow the Basque officers and civil servants to go aboard two British ships waiting in the port. For many Republicans in Spain this event is known as the Treason of Santoña, as many of the Basque soldiers went then to join the Francoist army in the rest of the Northern front\n;August 27: The troops at Santoña are captured by Franco's troops, while embarking to the British ships, Nationalist battle cruisers enter the port and force the Basques to disembark. The Italians withdraw from the port and the Eusko Gudarostea are made to choose between being imprisoned or joining Franco's army. The International Brigades attack at Fuentes de Ebro to establish a third position, besides Belchite and Quinto, from which to retake Zaragoza.\n;August 28\n: The Vatican recognizes the Franco government.\n;September 1: The Republican Army attacks Peñarroya and Córdoba.\n;September 4&ndash;5: Nationalists cross the river Deva and invade  Asturias from the East; Nationalists capture Llanes.\n;September 6&ndash;22: The Battle of El Mazuco; fewer than 5,000 Asturians and Basques hold off more than 33,000 Nationalists and the Condor Legion in and around the Sierra de Cuera.\n;September 7: Battle of Cape Cherchell between the Nationalist heavy cruiser Baleares and the Republican light cruisers Libertad and Méndez Núñez. In the early morning hours Baleares unexpectedly meets a Republican convoy consisting of several merchant ships escorted by Republican battleships. The biggest danger for the convoy is not the Baleares itself, but Nationalist airplanes who might approach after their sighting. While the convoy flees, along with most of the escorting ships, Libertad and Méndez Núñez engage Baleares. After losing contact with each other, they meet again in the afternoon, and Libertad hits Baleares twice. While Baleares then waits for her sister-ship Canarias, the retreating Republican ships are attacked, ineffectively, by several Nationalist airplanes, including Italian airplanes from the Non-Intervention-Committee blockade on Spain.\n;September 22: The Nationalist 6th Brigade of Navarre overruns Peñas Blancas. The battle of Sella begins.\n;September 27: Solchaga's forces enter Ribadesella.\nOctober–December\n;October 1: Nationalist forces occupy Covadonga.The new main board of the UGT expels their member and former prime minister Francisco Largo Caballero. Caballero is traveling the country holding lectures against communist synchronizing and Stalinism. The Cortez, the Spanish parliament, also expels parliamentarians known to be close to Caballero. Prime Minister Negrn is not willing or not able to back Caballero.\n;October 5 : Franklin Delano Roosevelt, president of the United States condemns the 'Nazi-Fascist aggressors' in Spain.\n;October 10 : The Brigades of Navarre enter Cangas de Onis.International Brigades and Republican army launch new attacks in the South Ebro region.\n;October 13 : The Madrid council of socialist parties, unions, etc., unhappy with the overwhelming influence of the PCE (Spanish Communist Party) on the Spanish government, confronts the Spanish Cortez over the expulsion of \"Caballeristas\".\n;October 17:  The Consejo Soberano decides to evacuate Asturias. The Nationalists are gaining absolute control of Asturias and closing in on Gijón. Asturian officials, their families and members of the Republican army have to be evacuated quickly. Many Asturian fighters organize a guerilla campaign from the high and inaccessible mountains. With memories of the 1934 workers' revolt and its bloody suppression still fresh, Asturian villages empty in terror at the approach of the Nationalists. The Asturian miners practice a scorched earth policy, and from the ruins of their houses often fight to the death with dynamite charges.Largo Caballero arrested during a speech in the Madrid cinema 'Pardinas', in which he criticized the PCE; he is placed under house arrest.\n;October 21: The fall of Gijón. Nationalists enter Gijón and plunder the city for days; death sentences over Asturians are so frequently imposed and carried out that the Nationalists themselves call their jurisdiction \"the machine gun\". Rapes and murders are tolerated by the Nationalists leadership for several days. There is no reliable count of the thousands of civilians murdered during these days.\n;October 30: The Republican government abandons Valencia for Barcelona.\n;December 15: Start of the Battle of Teruel.\nSee also\n* 1936 in the Spanish Civil War\n* 1938–1939 in the Spanish Civil War\n* Timeline of Spanish history#20th century\n* List of Spanish Nationalist military equipment of the Spanish Civil War\n* List of weapons of the Corpo Truppe Volontarie\n* Aviazione Legionaria\n* Condor Legion\n* List of Spanish Republican military equipment of the Spanish Civil War\nReferences\n* [https://web.archive.org/web/20050208123111/http://www.lacucaracha.info/scw/diary/ La Cucaracha, The Spanish Civil War Diary], a detailed chronicle of the events of the war, although definitely from a pro-Republican point of view"
    }
  ]
}