{
  "content": [
    {
      "type": "text",
      "text": "# 1945 Empire State Building B-25 crash\n\n|passengers=|missing=|survivors=0|stopover=|stopover0=|last_stopover=|total_injuries=24|ground_fatalities=11|total_fatalities=14|occupants=3 (flight crew members)\n}}\nOn July 28, 1945, a B-25 Mitchell bomber of the United States Army Air Forces accidentally crashed into the north side of the Empire State Building in New York City while flying in thick fog. The crash killed fourteen people (three crewmen and eleven people in the building), and an estimated twenty-four others were injured. Damage caused by the crash was estimated at million|link=yes}} (equivalent to about $ million in ), but the building's structural integrity was not compromised.\nIncident\nOn Saturday, July 28, 1945, Lieutenant Colonel William Franklin Smith Jr., of Watertown, Massachusetts, was piloting a B-25 Mitchell bomber on a routine personnel transport mission from Bedford Army Air Field in Massachusetts. Due to thick fog, the aircraft was unable to land at LaGuardia Airport as scheduled. The pilot requested to divert to Newark Metropolitan Airport in New Jersey. Smith asked for clearance to land, but he was advised of zero visibility. Proceeding anyway, he became disoriented by the fog and turned right instead of left after flying dangerously close to the Chrysler Building on East 42nd Street.\nAt 9:40&nbsp;a.m., the aircraft crashed into the north side of the Empire State Building, between the 78th and 80th floors, making an  hole in the building into the offices of the War Relief Services and the National Catholic Welfare Council. One engine shot through the south side opposite the impact, flew as far as the next block, dropped , landed on the roof of a nearby building and caused a fire that destroyed a penthouse art studio. The other engine and part of the landing gear fell down an elevator shaft, severing its cables.  The resulting fire was extinguished in 40 minutes. The Empire State Building fire is the highest structural fire to be brought under control by New York firefighters.\nBetween 50 and 60 sightseers were on the 86th floor observation deck when the crash happened. Fourteen people were killed: Lieutenant Colonel William Franklin Smith Jr., Staff Sergeant Christopher Domitrovich, Aviation Machinist's Mate Albert Perna, who was hitching a ride, and 11 civilians in the building. Perna's body was not found until two days later, when search crews discovered that his body had entered an elevator shaft and fallen to the bottom. The other two crewmen were burned beyond recognition. Approximately 20 to 24 others were injured as a result of the crash. Elevator operator Betty Lou Oliver was thrown from her elevator car on the 80th floor and suffered severe burns. First aid workers placed her on another elevator car to transport her to the ground floor, but the cables supporting that elevator had been damaged in the incident, and it fell 75 stories, ending up in the basement. Oliver survived this more than  fall due to the softening cushion of air created by the falling elevator car within this elevator shaft; however, she had suffered a broken pelvis, back and neck when rescuers found her amongst the rubble. This remains the world record for the longest survived elevator fall.\nAftermath\nDespite the damage and deaths, the building was open for business on many floors on the next Monday morning, less than 48 hours later. After the debris had been cleared away, Armand Hammer purchased the damaged 78th floor, refurbished it, and made it the headquarters of his United Distillers of America.\nThe crash spurred the passage of the long-pending Federal Tort Claims Act, which was signed into law by President Harry S. Truman in August 1946, initiating retroactive provisions into the law and allowing people to sue the government for the accident.\nOn July 24, 1946, four days before the first anniversary of the crash, another aircraft narrowly missed striking the building. The unidentified twin-engine plane, described as bearing no military insignia, flew past the 68th floor, startling workers and tourists.\nThe events of the crash were the subject of an episode of the 2001 History channel documentary Disasters of the Century, \"It Came from the Sky\".\nIn 2004 an episode of Mythbusters referenced the accident and Betty Lou Oliver's survival when testing the myth that jumping just before a falling elevator crashes would save your life.  They ruled this myth \"Busted\", as a human's jumping power (approximately 2-3 mph/3-5 kph) cannot cancel out the falling velocity of an elevator (approximately 53 mph/85 kph).  The program speculated that Oliver's survival in 1945 was due to the tight elevator shaft creating an air cushion which, combined with the spring action from a slack elevator cable, could have slowed the elevator to a survivable speed.\nSee also\n* 1945 in aviation\n* List of accidents and incidents involving airliners in the United States\n* List of accidents and incidents involving military aircraft (1945–1949)\n* Skyscraper fire\n* Similar aircraft accidents and incidents:\n** 1946 40 Wall Street plane crash\n** Convent Crash\n** El Al Flight 1862\n** September 11 attacks\n** 2002 Tampa Cessna 172 crash\n** 2002 Pirelli Tower airplane crash\n** 2005 Iranian Air Force C-130 crash\n** 2006 New York City Cirrus SR20 crash\n** 2010 Austin suicide attack\nReferences\nExternal links\n* [http://nycaviation.com/2009/07/28/on-this-day-in-aviation-history-july-28th/ On This Day in Aviation History: July 28th]&nbsp;– NYCAviation\n*\n* [https://web.archive.org/web/20040715113106/http://www.eng.uab.edu/cee/faculty/ndelatte/case_studies_project/Bomber.htm Bomber Crash into Empire State Building], engineering case study calculating the impact force of the bomber (Archived from [http://www.eng.uab.edu/cee/faculty/ndelatte/case_studies_project/Bomber.htm the original] on 2004-07-15. Retrieved 2016-06-26.)\n*\n* [http://watch.opb.org/video/2260080600/ Empire State Crash]&nbsp;– Video produced by the PBS Series History Detectives"
    }
  ]
}