{
  "content": [
    {
      "type": "text",
      "text": "# 1948 Chinese presidential election\n\n| before_party = Kuomintang\n| after_election = Chiang Kai-shek\n| after_party = Kuomintang\n}}\nThe 1948 Chinese presidential election was held on April 20, 1948, at the National Assembly House in Nanjing. The election was conducted by the National Assembly to elect the president and vice president of China. This was the first election under the newly adopted 1947 Constitution of the Republic of China, and the last prior to the retreat of the government of the Republic of China to Taiwan following their loss in the Civil War the following year.\nThis indirect election was held during the Chinese Civil War. Chiang Kai-shek, the incumbent leader of the Nationalist government, won a landslide victory against the same party candidate Ju Zheng in the presidential election. However, Sun Fo, Chiang's preferred vice-presidential candidate, was defeated by General Li Zongren in the vice-presidential elections.\nChiang and Li were inaugurated at the Presidential Palace in Nanjing on May 20, 1948. This also marked the transition of Nationalist government to the constitutional government.\nOverview\nAfter the Northern Expedition, the Kuomintang-led Nationalist government acquired control of a unified China nominally. The party began to draft a constitution to transit the government from tutelage period to constitutional period, according to the political philosophy of Sun Yat-sen.\nDuring the Second Sino-Japanese War, China established a close partnership with the United States and was given military and financial supports. George Marshall was appointed ambassador to Chongqing, the wartime capital, as to broker a negotiation between the Kuomintang (Nationalist Party) and Communist Party after the war. Two parties agreed to rebuild the country with democratization and military nationalization.\nSimultaneously, the Nationalist government continued to draft the Constitution of the Republic of China, however it was boycotted by the Communists and the full-scale Chinese Civil War was resumed.\nElectors\nThe election was conducted by the National Assembly in its meeting place National Assembly House in Nanjing. There were 2,961 delegates elected during the 1947 Chinese National Assembly election for the 3,045 seats. In total, there were 2,859 delegates reported to the secretariat to attend this first session of the first National Assembly.\nThe election regulations had a 50% requirement for the president and vice president to be elected. Since there were 3,045 seats in the National Assembly, the candidates needed to obtain 1,523 votes to be elected. This requirement could be relieved if no candidate passed this threshold in the first three rounds of voting.\nResults\nPresident\nVice-President\n{| class=wikitable style=text-align:right\n!rowspan=2 colspan=2|Party!!rowspan=2|Candidate!!colspan=2|First round!!colspan=2|Second round!!colspan=2|Third round!!colspan=2|Fourth round\n|-\n!Votes!!%!!Votes!!%!!Votes!!%!!Votes!!%\n|-\n|bgcolor=| || align=left|Li Zongren|| align=left|Kuomintang||754||27.30||1,163||42.69||1,156||42.64||1,438||52.62\n|-\n|bgcolor=| || align=left|Sun Fo|| align=left|Kuomintang||559||20.24||945||34.69||1,040||38.36||1,295||47.38\n|-\n|bgcolor=| || align=left|Cheng Qian|| align=left|Kuomintang||522||18.90||616||22.61||515||19.00||colspan=2|\n|-\n|bgcolor=| || align=left|Yu Youren||align=left|Kuomintang||493||17.85||colspan=6 rowspan=3|\n|-\n|bgcolor=| || align=left|Mo Teh-hui|| align=left|Independent||218||7.89\n|-\n|bgcolor=#008000| || align=left|Xu Fulin|| align=left|China Democratic Socialist Party||216||7.82\n|-\n|colspan=3 align=left|Total||2,762||100.00||2,724||100.00||2,711||100.00||2,733||100.00\n|}\nVice President Candidates\nFile:副總統候選人李宗仁.jpg|Li Zongren\nFile:副總統候選人孫科.jpg|Sun Fo\nFile:副總統候選人程潛.jpg|Cheng Qian\nFile:副總統候選人于右任.jpg|Yu Youren\nFile:副總統候選人莫德惠.jpg|Mo Teh-hui\nFile:副總統候選人徐傅霖.jpg|Xu Fulin\nPrevious and next elections\nThere were some regime changes in China during the first half of the 20th century. Depending on the definition, possible previous and next elections for the leader of China are listed below.\n{|class=wikitable\n!Order!!Election!!Political entity!!Title (term)!!Electoral college\n|-\n|align=center rowspan=2|Previous\n|1923 Chinese presidential election\n| Republic of China (1912–1949)\n|President the Republic of China (3rd)||National Assembly (1st, Beiyang government)\n|-\n|1943 Chinese chairmanship election\n| Republic of China (1912–1949)\n|Chairman of the Nationalist government (4th)||Central Committee of Kuomintang\n|-\n|align=center rowspan=3|Next\n|1949 Chinese chairmanship election|| People's Republic of China\n|Chairman of the Central People's Government||Chinese People's Political Consultative Conference\n|-\n|1954 Chinese presidential election|| Republic of China (on Taiwan)\n|President the Republic of China (2nd)||National Assembly (1st, Constitutional government)\n|}\nSee also\n*History of Republic of China\n*Nationalist government\n*President of the Republic of China\n*Vice President of the Republic of China\nReferences"
    }
  ]
}