{
  "content": [
    {
      "type": "text",
      "text": "# 1953 Nutts Corner BEA Vickers Viking accident\n\nOn 5 January 1953, a Vickers Viking airliner operated by British European Airways crashed on approach to Belfast Nutts Corner Airport, Northern Ireland. The aircraft was on a domestic flight from London Northolt Airport with 31 passengers and 4 crew on board. Twenty-four of the passengers and three crew members died in the accident.\nAircraft\nThe Vickers Type 610 Viking 1B airliner, powered by two Bristol Hercules 634 14-cylinder radial engines, was registered G-AJDL with manufacturer's serial number 262. It was delivered to British European Airways in March 1949. Originally named Vortex by the airline, it was renamed Lord St Vincent around 1951.\nAccident\nG-AJDL left Northolt at 07:27, 25 minutes late. Two hours later it was on approach to Nutts Corner. When the aircraft was  out from the runway threshold it was  above the glideslope. The aircraft then rapidly lost height and hit the pole supporting an approach light a short distance from the aerodrome. Following the initial impact the aircraft hit further poles; it then hit a mobile standard beam approach van before striking a brick building housing equipment operating the instrument landing system about  from the runway. This impact caused the aircraft to break up. There was a slight fire after the accident.\nInvestigation\nA board of inquiry was formed to investigate the accident, chaired by David Scott Cairns, QC. It opened in London on 14 April 1953. After hearing evidence, the board concluded that the pilot, Captain Hartley, made \"errors of judgement\" but that no moral blame was to be attached to him regarding the accident. The board mentioned that hitting the van stopped any chance of the aircraft reaching the runway, and then hitting the building made a tragedy inevitable. The approach lights were found to not be at the top of the poles, to ease maintenance; although that was not judged a factor in the crash, the lights were moved to the top of the poles following the accident. It was also recommended that when the ILS building was rebuilt that it should be offset from the approach path, or that it should be sited underground.\n}}\nBibliography"
    }
  ]
}