{
  "content": [
    {
      "type": "text",
      "text": "# 1956 United States presidential election__disambig_1\n\n3.1 pp\n| image_size = x200px\n| image1 = File:Dwight David Eisenhower 1952 crop.jpg\n| nominee1 = Dwight D. Eisenhower\n| party1 = Republican Party (United States)\n| home_state1 = Pennsylvania\n| running_mate1 = Richard Nixon\n| electoral_vote1 = 457\n| states_carried1 = 41\n| popular_vote1 = 35,579,180\n| percentage1 =\n| image2 = File:Adlai Stevenson close-up.jpg\n| nominee2 = Adlai Stevenson II\n| party2 = Democratic Party (United States)\n| home_state2 = Illinois\n| running_mate2 = Estes Kefauver\n| electoral_vote2 = 73\n| states_carried2 = 7\n| popular_vote2 = 26,028,028\n| percentage2 =\n| map_size = 350px\n| map =\n| map_caption = Presidential election results map. Red denotes states won by Eisenhower/Nixon, blue denotes those won by Stevenson/Kefauver, and orange indicates an Alabama faithless elector who cast an electoral vote for Jones/Talmadge. Numbers indicate the number of electoral votes allotted to each state.\n| title = President\n| before_election = Dwight D. Eisenhower\n| before_party = Republican Party (United States)\n| after_election = Dwight D. Eisenhower\n| after_party = Republican Party (United States)\n| ongoing =\n}}\nPresidential elections were held in the United States on November 6, 1956. Incumbent Republican President Dwight D. Eisenhower and his running mate, incumbent Vice President Richard Nixon, were reelected, defeating Democrat Adlai Stevenson II, former Illinois governor and Senator Estes Kefauver, in a rematch of 1952.\nEisenhower, who first became famous for his military leadership in World War II, remained widely popular. A heart attack in 1955 provoked speculation that he would not seek a second term, but his health recovered and he faced no opposition at the 1956 Republican National Convention. Stevenson remained popular with a core of liberal Democrats, but held no office and had no real base. He defeated New York Governor W. Averell Harriman and several other candidates on the first presidential ballot of the 1956 Democratic National Convention. Stevenson called for a significant increase in government spending on social programs and a decrease in military spending.\nWith the end of the Korean War and a strong economy, Eisenhower was the heavy favorite to win reelection. Supporters of the president focused on his \"personal qualities ... his sincerity, his integrity and sense of duty, his virtue as a family man, his religious devotion, and his sheer likeableness\", rather than on his leadership record. The weeks before the election saw two major international crises in the Middle East and Eastern Europe, and Eisenhower's handling of the crises boosted his popularity.\nEisenhower slightly improved on his 1952 majorities in both the popular and electoral vote. He increased his 1952 gains among Democrats, especially Northern and Midwestern white ethnic groups and city-dwelling and suburban White Southerners. Surprisingly, Eisenhower narrowly lost Missouri, a bellwether state for most of the 20th century, and which had voted for him in 1952; at the same time he carried Kentucky, Louisiana, and West Virginia, which had voted against him in the previous election. Eisenhower was the first Republican presidential candidate to win Louisiana, and by extension any Deep South state, since 1876.\nThis was the sixth and most recent rematch of an American presidential election, and the second time (after 1900) that the incumbent won a rematch. This was the last election before term limits established by the Twenty-second Amendment to the United States Constitution, which first applied to Eisenhower, became effective. This was the last presidential election before the admissions of Alaska and Hawaii in 1959, as well as the final presidential election in which a major party candidate was born in the 19th century. Eisenhower's victory was the first for an incumbent Republican president since 1924, and he became the first Republican to serve two full terms since Ulysses S. Grant in 1869–1877.\nRepublican Party\n{| class=\"wikitable\" style=\"font-size:90%; text-align:center;\"\n|-\n| style=\"background:#f1f1f1;\" colspan=\"30\"|1956 Republican Party ticket\n|-\n! style=\"width:3em; font-size:135%; background:#E81B23; width:200px;\"|\n! style=\"width:3em; font-size:135%; background:#E81B23; width:200px;\"|\n|-  style=\"color:#000; font-size:100%; background:#FFD0D7;\"\n| style=\"width:3em; width:200px;\"|for President\n| style=\"width:3em; width:200px;\"|for Vice President\n|-\n|\n|\n|-\n| 34thPresident of the United States(1953–1961)\n| 36thVice President of the United States(1953–1961)\n|-\n| colspan=2 |Campaign\n|-\n|}\nRepublican candidates\nFile:Dwight David Eisenhower 1952 crop.jpg|\nFile:S. C. Arnold (Montana Secretary of State).jpg|\nFile:John W. Bricker cph.3b31299 (cropped 3x4).jpg|\nFile:William F. Knowland headshot.jpg|\nFile:Joe Foss official portrait as Governor.jpg|\nEarly in 1956, there was speculation that President Eisenhower would not run for a second term because of concerns about his health. In 1955, Eisenhower had suffered a serious heart attack. However, he soon recovered and decided to run for a second term. (In June 1956 he also underwent surgery for ileitis.) Given Eisenhower's enormous popularity, he was renominated with no opposition at the 1956 Republican National Convention in San Francisco.\nAccording to Steven Ambrose, Nixon was anguished that Eisenhower never liked him and had repeatedly delayed saying Nixon should be renominated for vice president. Ambrose also stated that Eisenhower favored Robert B. Anderson, a former Democrat who had served as United States Secretary of the Navy and United States Deputy Secretary of Defense, but Anderson declined to be considered. With Eisenhower worried about his health, he decided that Nixon had his shortcomings, but was better prepared to assume the presidency than any possible alternative. In Ambrose's view, \"In itself, that was the highest possible tribute he could pay Nixon.\" Harold Stassen was the only Republican to publicly oppose Nixon's re-nomination for vice president, and Nixon remained highly popular among the Republican rank-and-file voters. Nixon had worked hard to reshape the vice presidency. It became his platform to campaign for Republican state and local candidates across the country, and these candidates came to his defense. In the spring of 1956, Eisenhower publicly announced that Nixon would again be his running mate, and Stassen was forced to second Nixon's nomination at the Republican Convention. Unlike 1952, conservative Republicans (who had supported Robert A. Taft against Eisenhower in 1952) did not attempt to shape the platform. At the convention, Nebraska delegate Terry McGovern Carpenter voted for a fictitious \"Joe Smith\" for vice president to prevent a unanimous vote.\nDemocratic Party\n{| class=\"wikitable\" style=\"font-size:90%; text-align:center\"\n|-\n| style=\"background:#f1f1f1;\" colspan=\"30\"|1956 Democratic Party ticket\n|-\n! style=\"width:3em; font-size:135%; background:#3333FF; width:200px\" |\n! style=\"width:3em; font-size:135%; background:#3333FF; width:200px\" |\n|-\n| style=\"width:3em; font-size:100%; color:#000; background:#C8EBFF; width:200px;\"|for President\n| style=\"width:3em; font-size:100%; color:#000; background:#C8EBFF; width:200px;\"|for Vice President\n|-\n|\n|\n|-\n| 31stGovernor of Illinois\n| U.S. Senator from Tennessee\n|-\n| colspan=2 |Campaign\n|-\n| colspan=2 |\n|-\n|}\nDemocratic candidates\nFile:Adlai Stevenson close-up.jpg|\nFile:SenatorKefauver(D-TN).jpg|\nFile:William Averell Harriman.jpg|\nPrimaries\nAdlai Stevenson, the Democratic Party's 1952 nominee, fought a tight primary battle with populist Tennessee Senator Estes Kefauver for the 1956 nomination. Kefauver won the New Hampshire primary unopposed (though Stevenson won 15% on write-ins). After Kefauver upset Stevenson in the Minnesota primary, Stevenson, realizing that he was in trouble, agreed to debate Kefauver in Florida. Stevenson and Kefauver held the first televised presidential debate on May 21, 1956, before the Florida primary. Stevenson carried Florida by a 52–48% margin. By the time of the California primary in June 1956, Kefauver's campaign had run low on money and could not compete for publicity and advertising with the well-funded Stevenson. Stevenson won the California primary by a 63–37% margin, and Kefauver soon withdrew from the race.\nPopular vote results\n* Adlai Stevenson - 3,051,347 (52.3%)\n* Estes Kefauver - 2,278,636 (39.1%)\n* Frank Lausche - 276,923 (4.7%)\n* Unpledged - 171,198 (2.9%)\n* John William McCormack - 26,128 (0.4%)\n* Others - 28,360 (0.6%)\nSource\nDemocratic National Convention\nAt the 1956 Democratic National Convention in Chicago, New York Governor W. Averell Harriman, who was backed by former President Harry S. Truman, challenged Stevenson for the nomination. However, Stevenson's delegate lead was much too large for Harriman to overcome, and Stevenson won on the first ballot.\nThe roll call, as reported in Richard C. Bain and Judith H. Parris, Convention Decisions and Voting Records, pp.&nbsp;294–298:\n{| class=\"wikitable\" style=\"text-align:left\"\n|-\n! colspan=\"2\" | Presidential balloting, DNC 1956\n|-\n! Contender\n! Vote\n|-\n! Adlai Stevenson\n! 905.5\n|-\n! W. Averell Harriman\n! 210\n|-\n! Lyndon B. Johnson\n! 80\n|-\n! Stuart Symington\n! 45.5\n|-\n! Happy Chandler\n! 36.5\n|-\n! James C. Davis\n! 33\n|-\n! John S. Battle\n! 32.5\n|-\n! George Bell Timmerman Jr.\n! 23.5\n|-\n! Frank Lausche\n! 5.5\n|}\nVice-presidential nomination\n{| class=wikitable\n! Candidate\n! Current position\n|-\n| Estes Kefauver\n| U.S. Senator from Tennessee\n|-\n| John F. Kennedy\n| U.S. Senator from Massachusetts\n|-\n| Albert Gore Sr.\n| U.S. Senator from Tennessee\n|-\n| Robert F. Wagner Jr.\n| Mayor of New York City\n|-\n| Hubert Humphrey\n| U.S. Senator from Minnesota\n|}\nThe highlight of the 1956 Democratic Convention came when Stevenson, to create excitement for the ticket, made the surprise announcement that the convention's delegates would choose his running mate. This set off a desperate scramble among several candidates to win the nomination. Potential vice presidential candidates had only one hectic day to campaign among the delegates before the voting began. The two leading contenders were Senator Kefauver, who retained the support of his primary delegates, and Senator John F. Kennedy from Massachusetts, who was not well known at the time. Although Stevenson privately preferred Senator Kennedy to be his running mate, he did not attempt to influence the balloting for Kennedy in any way. Kennedy surprised the experts by surging into the lead on the second ballot; at one point, he was only 15 votes shy of winning. However, a number of states then left their \"favorite son\" candidates and switched to Kefauver, giving him the victory. Kennedy then gave a gracious concession speech. The defeat was a boost for Kennedy's long-term presidential chances: as a serious contender, he gained favorable national publicity, yet by losing to Kefauver he avoided blame for Stevenson's loss to Eisenhower in November. The vote totals in the vice presidential balloting are recorded in the following table, which also comes from Bain & Parris.\n{| class=\"wikitable\" style=\"text-align:left\"\n|-\n! colspan=\"4\" | Vice Presidential balloting, DNC 1956\n|-\n! Ballot\n! 1\n! 2 before shifts\n! 2 after shifts\n|-\n! Estes Kefauver\n! 466.5\n! 551.5\n! 755.5\n|-\n! John F. Kennedy\n! 294.5\n! 618\n! 589\n|-\n! Albert Gore Sr.\n! 178\n! 110.5\n! 13.5\n|-\n! Robert F. Wagner Jr.\n! 162.5\n! 9.5\n! 6\n|-\n! Hubert Humphrey\n! 134\n! 74.5\n! 2\n|-\n! Luther H. Hodges\n! 40\n! 0.5\n! 0\n|-\n! P.T. Maner\n! 33\n! 0\n! 0\n|-\n! LeRoy Collins\n! 29\n! 0\n! 0\n|-\n! Clinton Presba Anderson\n! 16\n! 0\n! 0\n|-\n! Frank G. Clement\n! 14\n! 0\n! 0\n|-\n! Pat Brown\n! 1\n! 0\n! 0\n|-\n! Lyndon B. Johnson\n! 1\n! 0\n! 0\n|-\n! Stuart Symington\n! 1\n! 0\n! 0\n|}\nGeneral election\nPolling\n{| class=\"wikitable sortable mw-collapsible mw-collapsed\" style=\"text-align:center;font-size:90%;line-height:17px\"\n|- valign= bottom\n! Poll source\n! Date(s)administered\n! class=\"unsortable\" style=\"width:100px;\"| DwightEisenhower (R)\n! class=\"unsortable\" style=\"width:100px;\"| AdlaiStevenson (D)\n! class=\"unsortable\" | Other\n! class=\"unsortable\" | Undecided\n! class=\"unsortable\" | Margin\n|-\n! | Election Results\n|November 6, 1956\n|align=\"center\" |57.37%\n|align=\"center\" | 41.97%\n|align=\"center\" | 0.66%\n| -\n|  align=\"center\" | 15.40\n|-\n| rowspan=1 | Gallup\n| rowspan=1 |Oct. 30-Nov. 2, 1956\n|  align=\"center\" | 57%\n| 39%\n| 1%\n| 3%\n|  align=\"center\" | 18\n|-\n| rowspan=1 | Roper\n| rowspan=1 |October 28, 1956\n|  align=\"center\" | 52%\n| 43%\n| -\n| 5%\n|  align=\"center\" | 9\n|-\n| rowspan=1 | Gallup\n| rowspan=1 |October 7-12, 1956\n|  align=\"center\" | 51%\n| 41%\n| -\n| 8%\n|  align=\"center\" | 10\n|-\n| rowspan=1 | Gallup\n| rowspan=1 |September 20-25, 1956\n|  align=\"center\" | 52%\n| 40%\n| -\n| 8%\n|  align=\"center\" | 12\n|-\n| rowspan=1 | Roper\n| rowspan=1 |September 16, 1956\n|  align=\"center\" | 48%\n| 41%\n| -\n| 11%\n|  align=\"center\" | 7\n|-\n| rowspan=1 | Gallup\n| rowspan=1 |September 9-14, 1956\n|  align=\"center\" | 52%\n| 41%\n| -\n| 7%\n|  align=\"center\" | 11\n|-\n| rowspan=1 | Gallup\n| rowspan=1 |August 23-28, 1956\n|  align=\"center\" | 52%\n| 41%\n| -\n| 7%\n|  align=\"center\" | 11\n|-\n| colspan=\"10\"  align=\"center\" | August 20–23: Republican National Convention\n|-\n| colspan=\"10\"  align=\"center\" | August 13–17: Democratic National Convention\n|-\n| rowspan=1 | Gallup\n| rowspan=1 |July 12-17, 1956\n|  align=\"center\" | 61%\n| 37%\n| -\n| 2%\n|  align=\"center\" | 24\n|-\n| rowspan=1 | Gallup\n| rowspan=1 |April 19-24, 1956\n|  align=\"center\" | 62%\n| 36%\n| -\n| 3%\n|  align=\"center\" | 26\n|-\n| rowspan=1 | Gallup\n| rowspan=1 |Mar. 29-Apr. 3, 1956\n|  align=\"center\" | 61%\n| 37%\n| -\n| 2%\n|  align=\"center\" | 24\n|-\n| rowspan=1 | Gallup\n| rowspan=1 |March 8-13, 1956\n|  align=\"center\" | 61%\n| 37%\n| -\n| 2%\n|  align=\"center\" | 24\n|-\n| rowspan=1 | Gallup\n| rowspan=1 |February  16-21, 1956\n|  align=\"center\" | 63%\n| 33%\n| -\n| 4%\n|  align=\"center\" | 30\n|-\n| rowspan=1 | Gallup\n| rowspan=1 |January 6-11, 1956\n|  align=\"center\" | 56%\n| 40%\n| -\n| 4%\n|  align=\"center\" | 16\n|-\n| rowspan=1 | Gallup\n| rowspan=1 |November 17-22, 1955\n|  align=\"center\" | 58%\n| 39%\n| -\n| 3%\n|  align=\"center\" | 19\n|-\n| rowspan=1 | Gallup\n| rowspan=1 |August 25-30, 1955\n|  align=\"center\" | 59%\n| 37%\n| -\n| 4%\n|  align=\"center\" | 22\n|-\n| rowspan=1 | Gallup\n| rowspan=1 |May 12-17, 1955\n|  align=\"center\" | 55%\n| 39%\n| -\n| 6%\n|  align=\"center\" | 16\n|-\n| rowspan=1 | Gallup\n| rowspan=1 |January 20-25, 1955\n|  align=\"center\" | 57%\n| 40%\n| -\n| 3%\n|  align=\"center\" | 17\n|-\n| rowspan=1 | Gallup\n| rowspan=1 |September 5-10, 1954\n|  align=\"center\" | 53%\n| 47%\n| -\n| -\n|  align=\"center\" | 6\n|-\n| rowspan=1 | Gallup\n| rowspan=1 |March 19-24, 1954\n|  align=\"center\" | 45%\n| 37%\n| -\n| 18%\n|  align=\"center\" | 8\n|-\n|}\nCampaign\nStevenson campaigned hard against Eisenhower, with television ads for the first time being the dominant medium for both sides. Eisenhower's 1952 election victory had been due in large part to winning the female vote; hence, during this campaign there was a plethora of \"housewife\"-focused ads. Some commentators at the time also argued that television's new prominence was a major factor in Eisenhower's decision to run for a second term at the age of 66, considering his weak health after the heart attack in 1955. Television allowed Eisenhower to reach people across the country without enduring the strain of repeated coast-to-coast travel, making a national campaign more feasible.\n/Andrews (Independent/States' Rights).]]\n/Andrews (Independent/States' Rights).]]\nStevenson proposed significant increases in government spending for social programs and treaties with the Soviet Union to lower military spending and end nuclear testing on both sides. He also proposed to end the military draft and switch to an \"all-volunteer\" military. Eisenhower publicly opposed these ideas, even though in private he was working on a proposal to ban atmospheric nuclear testing. Eisenhower had retained the enormous personal and political popularity he had earned during World War II, and he maintained a comfortable lead in the polls throughout the campaign.\nEisenhower was also helped by his handling of two developing foreign-policy crises that occurred in the weeks before the election. In the Soviet-occupied People's Republic of Hungary, many citizens had risen in revolt in the Revolution of 1956 against Soviet domination, but the Soviets responded by invading the country on October 26. Three days later, a combined force of Israeli, British, and French troops invaded Egypt to topple Gamal Abdel Nasser and seize the recently nationalized Suez Canal. The resolution of the latter crisis rapidly moved to the United Nations, and the Hungarian revolt was brutally crushed within a few days by re-deployed Soviet troops. Eisenhower condemned both actions, but was unable to help Hungary; he did, however, forcefully pressure the western forces to withdraw from Egypt.\nWhile these two events led many Americans to rally in support of the president and swelled his expected margin of victory, the campaign was seen differently by some foreign governments. The Eisenhower administration had also supported the Brown v. Board of Education ruling in 1954; this ruling by the U.S. Supreme Court ended legal segregation in public schools. Meanwhile, Stevenson voiced disapproval about federal court intervention in segregation, saying about Brown that \"we don't need reforms or groping experiments.\" This was an about-face from the national Democratic party platform's endorsement of civil rights in the 1948 campaign. Although Eisenhower \"avoid[ed] a clear stand on the Brown decision\" during the campaign, in the contest with Stevenson, he won the support of nearly 40% of black voters; he was the last Republican presidential candidate to receive such a level of support from black voters.\nResults\nEisenhower led all opinion polls by large margins throughout the campaign. On Election Day Eisenhower took over 57% of the popular vote and won 41 of the 48 states. Stevenson won only six Southern states and the border state of Missouri, becoming the first losing candidate since William Jennings Bryan in 1900 to carry Missouri. Eisenhower carried Louisiana, making him the first Republican presidential candidate to carry the state, or any state in the Deep South for that matter, since Rutherford Hayes had done so in 1876 during Reconstruction, Eisenhower was the first Republican to win two presidential terms since William McKinley in 1900.\nEisenhower, who had won in twenty-one of the thirty-nine cities with a population above 250,000 in the 1952 election, won in twenty-eight of those cities in the 1956 election. He had won six of the eight largest cities in the Southern United States in the 1952 election and won seven of them with Atlanta being the only one to remain Democratic.\nOf the 3,101 counties/independent cities making returns, Eisenhower won the most popular votes in 2,143 (69.11%) while Stevenson carried 924 (29.80%). Unpledged Electors prevailed in 32 counties (1.03%) while Andrews carried two counties (0.06%).\nThis election was the last in which Massachusetts voted Republican until 1980 and the last in which Connecticut, Maryland, Michigan, Minnesota, New York, Pennsylvania, Rhode Island, Texas, and West Virginia did so until 1972. Conversely this was the last election in which Mississippi voted Democratic until 1976, and is also the last election until 1976 when Alabama gave a majority of its electoral votes to the Democratic candidate. As of 2023, this remains the last time that Missouri, Arkansas, Mississippi, Alabama, South Carolina, and North Carolina would back a losing Democratic presidential candidate. This was the last election in which both Massachusetts and Minnesota simultaneously voted Republican.\nIn 9 Southern states, a slate of third party options emerged as a protest to the civil rights movement. This was a continuation of the former Dixiecrat party from 1948. The states of Tennessee, Arkansas, Texas, and Virginia went a step farther, nominating Thomas Andrews for president, meanwhile in Kentucky they nominated senator Harry Byrd for president. The remaining states of Mississippi, South Carolina, Alabama, and Louisiana, left their electors as \"Unpledged\".\nSource (Popular Vote): Source (Electoral Vote):\n|57.37}}\n|41.97}}\n|0.32}}\n}}\n|86.06}}\n|13.75}}\n|0.19}}\n}}\nImage:1956 United States presidential election results map by county.svg|Results by county, shaded according to winning candidate's percentage of the vote\nFile:1956 US Presidential election by congressional district.svg|Results by districts, shaded according to winning candidate's percentage of the vote\nResults by state\nSource:\n{|class=\"wikitable\"\n|-\n|States/districts won by Stevenson/Kefauver\n|-\n|States/districts won by Eisenhower/Nixon\n|}\n{| class=\"wikitable sortable\" style=\"text-align:right\"\n|-\n! colspan=\"2\" |\n! colspan=\"3\" align=\"center\" | Dwight D. EisenhowerRepublican\n! colspan=\"3\" align=\"center\" | Adlai StevensonDemocratic\n! colspan=\"3\" align=\"center\" |T. Coleman Andrews/Unpledged Electors States' Rights\n! colspan=\"3\" align=\"center\" | Eric Hass Socialist Labor\n! colspan=\"2\" align=\"center\" | Margin\n! colspan=\"2\" align=\"center\" | State Total\n|-\n! align=\"center\" | State\n! style=\"text-align:center; font-size: 60%\" data-sort-type=\"number\" | electoralvotes\n! align=\"center\" data-sort-type=\"number\" | #\n! align=\"center\" data-sort-type=\"number\" | %\n! style=\"text-align:center; font-size: 60%\" data-sort-type=\"number\" | electoralvotes\n! align=\"center\" data-sort-type=\"number\" | #\n! align=\"center\" data-sort-type=\"number\" | %\n! style=\"text-align:center; font-size: 60%\" data-sort-type=\"number\" | electoralvotes\n! align=\"center\" data-sort-type=\"number\" | #\n! align=\"center\" data-sort-type=\"number\" | %\n! style=\"text-align:center; font-size: 60%\" data-sort-type=\"number\" | electoralvotes\n! align=\"center\" data-sort-type=\"number\" | #\n! align=\"center\" data-sort-type=\"number\" | %\n! style=\"text-align:center; font-size: 60%\" data-sort-type=\"number\" | electoralvotes\n! align=\"center\" data-sort-type=\"number\" | #\n! align=\"center\" data-sort-type=\"number\" | %\n! style=\"text-align:center; font-size: 60%\" data-sort-type=\"number\" | #\n!\n|-\n| style=\"text-align:center;\" | Alabama\n| style=\"text-align:center;\" | 11\n| 195,694\n| 39.39\n| -\n| 280,844\n| 56.52\n| 10\n| 20,323\n| 4.09\n| -\n| -\n| -\n| -\n| -85,150\n| -17.13\n| 496,871\n| style=\"text-align:center;\" | AL\n|-\n| style=\"text-align:center;\" | Arizona\n| style=\"text-align:center;\" | 4\n| 176,990\n| 60.99\n| 4\n| 112,880\n| 38.90\n| -\n| 303\n| 0.10\n| -\n| -\n| -\n| -\n| 64,110\n| 22.09\n| 290,173\n| style=\"text-align:center;\" | AZ\n|-\n| style=\"text-align:center;\" | Arkansas\n| style=\"text-align:center;\" | 8\n| 186,287\n| 45.82\n| -\n| 213,277\n| 52.46\n| 8\n| 7,008\n| 1.72\n| -\n| -\n| -\n| -\n| -26,990\n| -6.64\n| 406,572\n| style=\"text-align:center;\" | AR\n|-\n| style=\"text-align:center;\" | California\n| style=\"text-align:center;\" | 32\n| 3,027,668\n| 55.39\n| 32\n| 2,420,135\n| 44.27\n| -\n| 6,087\n| 0.11\n| -\n| 300\n| 0.01\n| -\n| 607,533\n| 11.11\n| 5,466,355\n| style=\"text-align:center;\" | CA\n|-\n| style=\"text-align:center;\" | Colorado\n| style=\"text-align:center;\" | 6\n| 394,479\n| 59.49\n| 6\n| 263,997\n| 39.81\n| -\n| 759\n| 0.11\n| -\n| 3,308\n| 0.50\n| -\n| 130,482\n| 19.68\n| 663,074\n| style=\"text-align:center;\" | CO\n|-\n| style=\"text-align:center;\" | Connecticut\n| style=\"text-align:center;\" | 8\n| 711,837\n| 63.72\n| 8\n| 405,079\n| 36.26\n| -\n| -\n| -\n| -\n| -\n| -\n| -\n| 306,758\n| 27.46\n| 1,117,121\n| style=\"text-align:center;\" | CT\n|-\n| style=\"text-align:center;\" | Delaware\n| style=\"text-align:center;\" | 3\n| 98,057\n| 55.09\n| 3\n| 79,421\n| 44.62\n| -\n| -\n| -\n| -\n| 110\n| 0.06\n| -\n| 18,636\n| 10.47\n| 177,988\n| style=\"text-align:center;\" | DE\n|-\n| style=\"text-align:center;\" | Florida\n| style=\"text-align:center;\" | 10\n| 643,849\n| 57.27\n| 10\n| 480,371\n| 42.73\n| -\n| -\n| -\n| -\n| -\n| -\n| -\n| 163,478\n| 14.54\n| 1,124,220\n| style=\"text-align:center;\" | FL\n|-\n| style=\"text-align:center;\" | Georgia\n| style=\"text-align:center;\" | 12\n| 216,652\n| 32.65\n| -\n| 441,094\n| 66.48\n| 12\n| -\n| -\n| -\n| -\n| -\n| -\n| -224,442\n| -33.83\n| 663,480\n| style=\"text-align:center;\" | GA\n|-\n| style=\"text-align:center;\" | Idaho\n| style=\"text-align:center;\" | 4\n| 166,979\n| 61.17\n| 4\n| 105,868\n| 38.78\n| -\n| -\n| -\n| -\n| -\n| -\n| -\n| 61,111\n| 22.39\n| 272,989\n| style=\"text-align:center;\" | ID\n|-\n| style=\"text-align:center;\" | Illinois\n| style=\"text-align:center;\" | 27\n| 2,623,327\n| 59.52\n| 27\n| 1,775,682\n| 40.29\n| -\n| -\n| -\n| -\n| 8,342\n| 0.19\n| -\n| 847,645\n| 19.23\n| 4,407,407\n| style=\"text-align:center;\" | IL\n|-\n| style=\"text-align:center;\" | Indiana\n| style=\"text-align:center;\" | 13\n| 1,182,811\n| 59.90\n| 13\n| 783,908\n| 39.70\n| -\n| -\n| -\n| -\n| 1,334\n| 0.07\n| -\n| 398,903\n| 20.20\n| 1,974,607\n| style=\"text-align:center;\" | IN\n|-\n| style=\"text-align:center;\" | Iowa\n| style=\"text-align:center;\" | 10\n| 729,187\n| 59.06\n| 10\n| 501,858\n| 40.65\n| -\n| 3,202\n| 0.26\n| -\n| 125\n| 0.01\n| -\n| 227,329\n| 18.41\n| 1,234,564\n| style=\"text-align:center;\" | IA\n|-\n| style=\"text-align:center;\" | Kansas\n| style=\"text-align:center;\" | 8\n| 566,878\n| 65.44\n| 8\n| 296,317\n| 34.21\n| -\n| -\n| -\n| -\n| -\n| -\n| -\n| 270,561\n| 31.23\n| 866,243\n| style=\"text-align:center;\" | KS\n|-\n| style=\"text-align:center;\" | Kentucky\n| style=\"text-align:center;\" | 10\n| 572,192\n| 54.30\n| 10\n| 476,453\n| 45.21\n| -\n| -\n| -\n| -\n| 358\n| 0.03\n| -\n| 95,739\n| 9.09\n| 1,053,805\n| style=\"text-align:center;\" | KY\n|-\n| style=\"text-align:center;\" | Louisiana\n| style=\"text-align:center;\" | 10\n| 329,047\n| 53.28\n| 10\n| 243,977\n| 39.51\n| -\n| 44,520\n| 7.21\n| -\n| -\n| -\n| -\n| 85,070\n| 13.78\n| 617,544\n| style=\"text-align:center;\" | LA\n|-\n| style=\"text-align:center;\" | Maine\n| style=\"text-align:center;\" | 5\n| 249,238\n| 70.87\n| 5\n| 102,468\n| 29.13\n| -\n| -\n| -\n| -\n| -\n| -\n| -\n| 146,770\n| 41.73\n| 351,706\n| style=\"text-align:center;\" | ME\n|-\n| style=\"text-align:center;\" | Maryland\n| style=\"text-align:center;\" | 9\n| 559,738\n| 60.04\n| 9\n| 372,613\n| 39.96\n| -\n| -\n| -\n| -\n| -\n| -\n| -\n| 187,125\n| 20.07\n| 932,351\n| style=\"text-align:center;\" | MD\n|-\n| style=\"text-align:center;\" | Massachusetts\n| style=\"text-align:center;\" | 16\n| 1,393,197\n| 59.32\n| 16\n| 948,190\n| 40.37\n| -\n| -\n| -\n| -\n| 5,573\n| 0.24\n| -\n| 445,007\n| 18.95\n| 2,348,506\n| style=\"text-align:center;\" | MA\n|-\n| style=\"text-align:center;\" | Michigan\n| style=\"text-align:center;\" | 20\n| 1,713,647\n| 55.63\n| 20\n| 1,359,898\n| 44.15\n| -\n| -\n| -\n| -\n| -\n| -\n| -\n| 353,749\n| 11.48\n| 3,080,468\n| style=\"text-align:center;\" | MI\n|-\n| style=\"text-align:center;\" | Minnesota\n| style=\"text-align:center;\" | 11\n| 719,302\n| 53.68\n| 11\n| 617,525\n| 46.08\n| -\n| -\n| -\n| -\n| 2,080\n| 0.16\n| -\n| 101,777\n| 7.60\n| 1,340,005\n| style=\"text-align:center;\" | MN\n|-\n| style=\"text-align:center;\" | Mississippi\n| style=\"text-align:center;\" | 8\n| 60,685\n| 24.46\n| -\n| 144,498\n| 58.23\n| 8\n| 42,966\n| 17.31\n| -\n| -\n| -\n| -\n| -83,813\n| -33.78\n| 248,149\n| style=\"text-align:center;\" | MS\n|-\n| style=\"text-align:center;\" | Missouri\n| style=\"text-align:center;\" | 13\n| 914,289\n| 49.89\n| -\n| 918,273\n| 50.11\n| 13\n| -\n| -\n| -\n| -\n| -\n| -\n| -3,984\n| -0.22\n| 1,832,562\n| style=\"text-align:center;\" | MO\n|-\n| style=\"text-align:center;\" | Montana\n| style=\"text-align:center;\" | 4\n| 154,933\n| 57.13\n| 4\n| 116,238\n| 42.87\n| -\n| -\n| -\n| -\n| -\n| -\n| -\n| 38,695\n| 14.27\n| 271,171\n| style=\"text-align:center;\" | MT\n|-\n| style=\"text-align:center;\" | Nebraska\n| style=\"text-align:center;\" | 6\n| 378,108\n| 65.51\n| 6\n| 199,029\n| 34.49\n| -\n| -\n| -\n| -\n| -\n| -\n| -\n| 179,079\n| 31.03\n| 577,137\n| style=\"text-align:center;\" | NE\n|-\n| style=\"text-align:center;\" | Nevada\n| style=\"text-align:center;\" | 3\n| 56,049\n| 57.97\n| 3\n| 40,640\n| 42.03\n| -\n| -\n| -\n| -\n| -\n| -\n| -\n| 15,409\n| 15.94\n| 96,689\n| style=\"text-align:center;\" | NV\n|-\n| style=\"text-align:center;\" | New Hampshire\n| style=\"text-align:center;\" | 4\n| 176,519\n| 66.11\n| 4\n| 90,364\n| 33.84\n| -\n| 111\n| 0.04\n| -\n| -\n| -\n| -\n| 86,155\n| 32.27\n| 266,994\n| style=\"text-align:center;\" | NH\n|-\n| style=\"text-align:center;\" | New Jersey\n| style=\"text-align:center;\" | 16\n| 1,606,942\n| 64.68\n| 16\n| 850,337\n| 34.23\n| -\n| 5,317\n| 0.21\n| -\n| 6,736\n| 0.27\n| -\n| 756,605\n| 30.46\n| 2,484,312\n| style=\"text-align:center;\" | NJ\n|-\n| style=\"text-align:center;\" | New Mexico\n| style=\"text-align:center;\" | 4\n| 146,788\n| 57.81\n| 4\n| 106,098\n| 41.78\n| -\n| 364\n| 0.14\n| -\n| 69\n| 0.03\n| -\n| 40,690\n| 16.02\n| 253,926\n| style=\"text-align:center;\" | NM\n|-\n| style=\"text-align:center;\" | New York\n| style=\"text-align:center;\" | 45\n| 4,340,340\n| 61.19\n| 45\n| 2,750,769\n| 38.78\n| -\n| -\n| -\n| -\n| -\n| -\n| -\n| 1,589,571\n| 22.41\n| 7,093,336\n| style=\"text-align:center;\" | NY\n|-\n| style=\"text-align:center;\" | North Carolina\n| style=\"text-align:center;\" | 14\n| 575,062\n| 49.34\n| -\n| 590,530\n| 50.66\n| 14\n| -\n| -\n| -\n| -\n| -\n| -\n| -15,468\n| -1.33\n| 1,165,592\n| style=\"text-align:center;\" | NC\n|-\n| style=\"text-align:center;\" | North Dakota\n| style=\"text-align:center;\" | 4\n| 156,766\n| 61.72\n| 4\n| 96,742\n| 38.09\n| -\n| 483\n| 0.19\n| -\n| -\n| -\n| -\n| 60,024\n| 23.63\n| 253,991\n| style=\"text-align:center;\" | ND\n|-\n| style=\"text-align:center;\" | Ohio\n| style=\"text-align:center;\" | 25\n| 2,262,610\n| 61.11\n| 25\n| 1,439,655\n| 38.89\n| -\n| -\n| -\n| -\n| -\n| -\n| -\n| 822,955\n| 22.23\n| 3,702,265\n| style=\"text-align:center;\" | OH\n|-\n| style=\"text-align:center;\" | Oklahoma\n| style=\"text-align:center;\" | 8\n| 473,769\n| 55.13\n| 8\n| 385,581\n| 44.87\n| -\n| -\n| -\n| -\n| -\n| -\n| -\n| 88,188\n| 10.26\n| 859,350\n| style=\"text-align:center;\" | OK\n|-\n| style=\"text-align:center;\" | Oregon\n| style=\"text-align:center;\" | 6\n| 406,393\n| 55.25\n| 6\n| 329,204\n| 44.75\n| -\n| -\n| -\n| -\n| -\n| -\n| -\n| 77,189\n| 10.49\n| 735,597\n| style=\"text-align:center;\" | OR\n|-\n| style=\"text-align:center;\" | Pennsylvania\n| style=\"text-align:center;\" | 32\n| 2,585,252\n| 56.49\n| 32\n| 1,981,769\n| 43.30\n| -\n| -\n| -\n| -\n| 7,447\n| 0.16\n| -\n| 603,483\n| 13.19\n| 4,576,503\n| style=\"text-align:center;\" | PA\n|-\n| style=\"text-align:center;\" | Rhode Island\n| style=\"text-align:center;\" | 4\n| 225,819\n| 58.26\n| 4\n| 161,790\n| 41.74\n| -\n| -\n| -\n| -\n| -\n| -\n| -\n| 64,029\n| 16.52\n| 387,611\n| style=\"text-align:center;\" | RI\n|-\n| style=\"text-align:center;\" | South Carolina\n| style=\"text-align:center;\" | 8\n| 75,700\n| 25.18\n| -\n| 136,372\n| 45.37\n| 8\n| 88,511\n| 29.45\n| -\n| -\n| -\n| -\n| -47,863\n| -15.92\n| 300,583\n| style=\"text-align:center;\" | SC\n|-\n| style=\"text-align:center;\" | South Dakota\n| style=\"text-align:center;\" | 4\n| 171,569\n| 58.39\n| 4\n| 122,288\n| 41.61\n| -\n| -\n| -\n| -\n| -\n| -\n| -\n| 49,281\n| 16.77\n| 293,857\n| style=\"text-align:center;\" | SD\n|-\n| style=\"text-align:center;\" | Tennessee\n| style=\"text-align:center;\" | 11\n| 462,288\n| 49.21\n| 11\n| 456,507\n| 48.60\n| -\n| 19,820\n| 2.11\n| -\n| -\n| -\n| -\n| 5,781\n| 0.62\n| 939,404\n| style=\"text-align:center;\" | TN\n|-\n| style=\"text-align:center;\" | Texas\n| style=\"text-align:center;\" | 24\n| 1,080,619\n| 55.26\n| 24\n| 859,958\n| 43.98\n| -\n| 14,591\n| 0.75\n| -\n| -\n| -\n| -\n| 220,661\n| 11.28\n| 1,955,545\n| style=\"text-align:center;\" | TX\n|-\n| style=\"text-align:center;\" | Utah\n| style=\"text-align:center;\" | 4\n| 215,631\n| 64.56\n| 4\n| 118,364\n| 35.44\n| -\n| -\n| -\n| -\n| -\n| -\n| -\n| 97,267\n| 29.12\n| 333,995\n| style=\"text-align:center;\" | UT\n|-\n| style=\"text-align:center;\" | Vermont\n| style=\"text-align:center;\" | 3\n| 110,390\n| 72.16\n| 3\n| 42,549\n| 27.81\n| -\n| -\n| -\n| -\n| -\n| -\n| -\n| 67,841\n| 44.35\n| 152,978\n| style=\"text-align:center;\" | VT\n|-\n| style=\"text-align:center;\" | Virginia\n| style=\"text-align:center;\" | 12\n| 386,459\n| 55.37\n| 12\n| 267,760\n| 38.36\n| -\n| 42,964\n| 6.16\n| -\n| 351\n| 0.05\n| -\n| 118,699\n| 17.01\n| 697,978\n| style=\"text-align:center;\" | VA\n|-\n| style=\"text-align:center;\" | Washington\n| style=\"text-align:center;\" | 9\n| 620,430\n| 53.91\n| 9\n| 523,002\n| 45.44\n| -\n| -\n| -\n| -\n| 7,457\n| 0.65\n| -\n| 97,428\n| 8.47\n| 1,150,889\n| style=\"text-align:center;\" | WA\n|-\n| style=\"text-align:center;\" | West Virginia\n| style=\"text-align:center;\" | 8\n| 449,297\n| 54.08\n| 8\n| 381,534\n| 45.92\n| -\n| -\n| -\n| -\n| -\n| -\n| -\n| 67,763\n| 8.16\n| 830,831\n| style=\"text-align:center;\" | WV\n|-\n| style=\"text-align:center;\" | Wisconsin\n| style=\"text-align:center;\" | 12\n| 954,844\n| 61.58\n| 12\n| 586,768\n| 37.84\n| -\n| 6,918\n| 0.45\n| -\n| 710\n| 0.05\n| -\n| 368,076\n| 23.74\n| 1,550,558\n| style=\"text-align:center;\" | WI\n|-\n| style=\"text-align:center;\" | Wyoming\n| style=\"text-align:center;\" | 3\n| 74,573\n| 60.08\n| 3\n| 49,554\n| 39.92\n| -\n| -\n| -\n| -\n| -\n| -\n| -\n| 25,019\n| 20.16\n| 124,127\n| style=\"text-align:center;\" | WY\n|-\n! TOTALS:\n! 531\n! 35,579,180\n! 57.37\n! 457\n! 26,028,028\n! 41.97\n! 73\n! 301,417\n! 0.49\n! -\n! 44,300\n! 0.07\n! -\n! 9,551,152\n! 15.40\n! 62,021,979\n| style=\"text-align:center;\" | US\n|}\nStates that flipped from Republican to Democratic\n*Missouri\nStates that flipped from Democratic to Republican\n*Kentucky\n*Louisiana\n*West Virginia\nClose states\nMargin of victory less than 1% (24 electoral votes):\n# Missouri, 0.22% (3,984 votes)\n# Tennessee, 0.62% (5,781 votes)\nMargin of victory less than 5% (14 electoral votes):\n# North Carolina, 1.33% (15,468 votes)\nMargin of victory over 5%, but under 10% (46 electoral votes)\n# Arkansas, 6.64% (26,990 votes)\n# Minnesota, 7.60% (101,777 votes)\n# West Virginia, 8.16% (67,763 votes)\n# Washington, 8.47% (97,428 votes)\n# Kentucky, 9.09% (95,739 votes)\nTipping point state:\n# Florida, 14.54% (163,478 votes)\n(a) ''Alabama faithless elector W. F. Turner, who was pledged to Adlai Stevenson and Estes Kefauver, instead cast his votes for Walter Burgwyn Jones, who was a circuit court judge in Turner's home town, and Herman Talmadge, governor of the neighboring state of Georgia. Because of the admission of Alaska and Hawaii as states in 1959, the 1956 presidential election was the last in which there were 531 electoral votes.\nStatistics\nCounties with Highest Percent of Vote (Republican)\n# Gillespie County, Texas 92.61%\n# Kenedy County, Texas 92.59%\n# Kane County, Utah 90.20%\n# Jackson County, Kentucky 88.35%\n# Johnson County, Tennessee 87.44%\nCounties with Highest Percent of Vote (Democratic)\n# Baker County, Georgia 96.07%\n# Greene County, North Carolina 93.67%\n# Berrien County, Georgia 93.56%\n# Atkinson County, Georgia 93.37%\n# Madison County, Georgia 93.24%\nCounties with Highest Percent of Vote (Other)\n# Williamsburg County, South Carolina 73.00%\n# Clarendon County, South Carolina 66.88%\n# Sumter County, South Carolina 62.00%\n# Bamberg County, South Carolina 59.66%\n# Calhoun County, South Carolina 58.73%\nSee also\n* 1956 United States gubernatorial elections\n* 1956 United States House of Representatives elections\n* 1956 United States Senate elections\n* History of the United States (1945–1964)\n* Second inauguration of Dwight D. Eisenhower\nNotes\nCitations\nReferences\n*\n*\n* [http://www.livingroomcandidate.org/commercials/1956 Campaign commercials from the 1956 election]\n*\n*\n*\nFurther reading\n* Converse, Philip E., Warren E. Miller, Donald E. Stokes, Angus Campbell. The American Voter (1964) the classic political science study of voters in 1952 and 1956\n* , pp 87–182.\n* Johnstone, Andrew, and Andrew Priest, eds.  US Presidential Elections and Foreign Policy: Candidates, Campaigns, and Global Politics from FDR to Bill Clinton (2017) pp 105–127. [https://muse.jhu.edu/book/50578/ online]\n* Martin, John Bartlow. Adlai Stevenson and the World: The Life of Adlai E. Stevenson (1977) [https://archive.org/details/adlaistevensonwo00john online]\n* Moon, Henry Lee. \"The Negro Vote in the Presidential Election of 1956.\" Journal of Negro Education (1957): 219–230. [https://www.jstor.org/stable/2293404 online]\n* Nichols, David A. Eisenhower 1956: The President's Year of Crisis--Suez and the Brink of War (2012).\n* Scheele, Henry Z. \"The 1956 Nomination of Dwight D. Eisenhower: Maintaining the Hero Image.\" Presidential Studies Quarterly (1987): 459–471. [https://www.jstor.org/stable/27550439 online]\nPrimary sources\n*\n* Chester, Edward W  A guide to political platforms (1977) [https://archive.org/details/guidetopolitical0000ches online]\n* Porter, Kirk H. and Donald Bruce Johnson, eds. National party platforms, 1840-1964'' (1965) [https://archive.org/details/nationalpartypla00port online 1840-1956]\nExternal links\n* [https://web.archive.org/web/20120109123830/http://electionwall.org/1956.php The Election Wall's 1956 Election Video Page]\n* [http://geoelections.free.fr/USA/elec_comtes/1956.htm 1956 popular vote by counties]\n* [https://web.archive.org/web/20080604224809/http://livingroomcandidate.movingimage.us/ The Living Room Candidate: Presidential Campaign Commercials: 1952 – 2004]\n* [http://eisenhower.archives.gov/All_About_Ike/Presidential/1956Campaign/1956_Campaign.html Eisenhower's 1956 presidential campaign, Dwight D. Eisenhower Presidential Library]\n*\n*\n*\n* [http://www.countingthevotes.com/1956/ Election of 1956 in Counting the Votes]\n* [https://www.youtube.com/watch?v=y_Ywq6sASGM See You at the Polls] - A \"Get Out the Vote\" TV special for the 1956 presidential election. Produced by the Heritage Foundation and the Ad Council."
    }
  ]
}