{
  "content": [
    {
      "type": "text",
      "text": "# 1962 Italian presidential election\n\n| needed_votes      = 570 (1st–3rd ballots) or 428 (4th ballot onwards)\n| image1            = File:Antonio Segni Official 1962.jpg\n| image_size = 170x170px\n| nominee1          = Antonio Segni\n| party1            = Christian Democracy (Italy)\n| electoral_vote1   = 443\n| percentage1       = 51.9%\n| image2            = File:Giuseppe Saragat (3x4 cropped).jpg\n| nominee2          = Giuseppe Saragat\n| party2            = Italian Democratic Socialist Party\n| electoral_vote2   = 334\n| percentage2       = 39.1%\n| title             = President\n| before_election   = Giovanni Gronchi\n| before_party      = DC\n| after_election    = Antonio Segni\n| after_party       = DC\n}}\nThe 1962 Italian presidential election was held in Italy on 2–6 May 1962.\nOnly members of Parliament and regional delegates were entitled to vote, most of these electors having been elected in the 1958 general election. As head of state of the Italian Republic, the President has a role of representation of national unity and guarantees that Italian politics comply with the Italian Constitution, in the framework of a parliamentary system.\nIt was the first time the official candidate of the Christian Democracy party was elected President of the Italian Republic.\nProcedure\nIn accordance with the Italian Constitution, the election was held in the form of a secret ballot, with the Senators and the Deputies entitled to vote. The election was held in the Palazzo Montecitorio, home of the Chamber of Deputies, with the capacity of the building expanded for the purpose. The first three ballots required a two-thirds majority of the 854 voters in order to elect a president, or 570 votes. Starting from the fourth ballot, an absolute majority was required for candidates to be elected, or 428 votes. The presidential mandate lasts seven years.\nThe election was presided over by the President of the Chamber of Deputies Giovanni Leone, who proceeded to the public counting of the votes, and by the President of the Senate Cesare Merzagora.\nProposed nominees\n* Antonio Segni, proposed by Christian Democracy, supported by Aldo Moro;\n* Umberto Terracini, former President of the Constituent Assembly, sustained by the Communist Party;\n* Giuseppe Saragat, leader of Democratic Socialist Party and former President of the Constituent Assembly;\n* Giovanni Gronchi, outgoing President, not officially endorsed by the chairman of Eni, Enrico Mattei.\nTimeline\ntaking the oath on 11 May 1962]]\nOn 2 May 1962, the Italian Parliament convened in order to elect the new President of the Republic, since President Giovanni Gronchi's term was about to end. Christian Democracy leader Aldo Moro decided to endorse the candidacy of Antonio Segni, former Prime Minister and member of the conservative faction of the party. With that choice, Moro wanted to reassure the conservatives representatives of his own party, worried about a possible extreme shift on leftist stances by their party after the beginning of the Organic centre-left period in February 1962.\nItalian Communist Party decided to vote for Umberto Terracini on the first round, while Italian Socialist Party sustained Sandro Pertini.\nAfter the third round, communists and socialists decided to converge on the candidacy of the democratic socialist Giuseppe Saragat, who also gained the favor of some christian democrat snipers representatives.\nAfter several ballots, on 6 May 1962 Antonio Segni was finally elected President with just the 51% of the votes. His election was allowed thanks to the votes of monarchist and neo-fascist representatives. It was the first time that Christian Democracy's official candidate succeeded in being elected President of the Republic.\nResults\n{| class=\"wikitable sortable\" style=text-align:right\n!Candidate\n!First round2 May 1962\n!Second round2 May 1962\n!Third round2 May 1962\n!data-sort-type=\"number\" |Fourth round3 May 1962\n!data-sort-type=\"number\" |Fifth round4 May 1962\n!data-sort-type=\"number\" |Sixth round4 May 1962\n!data-sort-type=\"number\" |Seventh round5 May 1962\n!data-sort-type=\"number\" |Eighth round6 May 1962\n!data-sort-type=\"number\" |Ninth round6 May 1962\n|-\n|align=left|Antonio Segni||333||340||341||354||396||399||389||424||bgcolor=#CEF6D8|443\n|-\n|align=left|Umberto Terracini||200||196||–||–||–||–||–||–||–\n|-\n|align=left|Sandro Pertini||120||–||–||–||–||–||–||–||–\n|-\n|align=left|Augusto De Marsanich||46||–||–||–||–||–||–||–||–\n|-\n|align=left|Giuseppe Saragat||42||92||299||321||321||314||332||337||334\n|-\n|align=left|Giovanni Gronchi||20||32||44||45||43||43||29||20||–\n|-\n|align=left|Attilio Piccioni||12||41||51||40||28||17||–||–||–\n|-\n|align=left|Paolo Rossi||10||–||–||–||–||–||–||–||–\n|-\n|align=left|Achille Lauro||–||38||–||–||–||–||–||–||–\n|-\n|align=left|Cesare Merzagora||–||12||13||11||14||18||12||–||–\n|-\n|align=left|Calogero Volpe||–||–||37||–||–||–||–||–||–\n|-\n|align=left|Orazio Condorelli||–||–||–||38||–||–||–||–||–\n|-\n|- class=\"sortbottom\"\n|align=left|Other candidates||8||15||11||8||3||4||15||17||13\n|- class=\"sortbottom\"\n|align=left|Blank papers||43||65||46||26||35||46||58||45||51\n|- class=\"sortbottom\"\n|align=left|Invalid papers||–||–||–||–||1||–||5||–||1\n|- class=\"sortbottom\"\n|align=left|Abstentions||20||23||12||11||13||13||14||13||12\n|- class=\"sortbottom\"\n|align=left|Total||854||854||854||854||854||854||854||854||854\n|- class=\"sortbottom\"\n|align=left colspan=10|Source: [http://presidenti.quirinale.it/Segni/seg-elezione.htm Presidency of the Republic]\n|}\nNotes\nReferences"
    }
  ]
}