{
  "content": [
    {
      "type": "text",
      "text": "# 1963 in the United Kingdom\n\nNorthern Ireland  Scotland  Wales\n|label2= Popular culture\n|data2 =\n1963 British Grand Prix\n1963 English cricket season\nFootball: England  Scotland\n1963 in British television\n1963 in British music\n1963 in British radio\nUK in the Eurovision Song Contest 1963\n}}\nEvents from the year 1963 in the United Kingdom. This year sees changes in the leadership of both main political parties, the Profumo affair and the rise of The Beatles as well as the launch of the long-running sci-fi series Doctor Who.\nIncumbents\n* Monarch – Elizabeth II\n* Prime Minister - Harold Macmillan (Conservative) (until 18 October), Alec Douglas-Home (Conservative) (starting 19 October)\nEvents\n* January–April – Winter of 1963: The UK experiences the worst winter since 1946–47. Low temperatures keep snow lying around until early-April in some areas.\n* 7 January – Granada Television first broadcasts World in Action, its influential investigative current affairs series, which will run for thirty-five years.\n* 11 January – Musical film Summer Holiday starring Cliff Richard premieres in London.\n* 16 January – The Macmillan-led Conservative government announces that a new town will be developed in Shropshire. Dawley New Town will incorporate existing communities including: Dawley, Ironbridge and Madeley, and is intended to be largely used as an overspill town for Birmingham and Wolverhampton.\n* 18 January – The Labour Party leader, Hugh Gaitskell, dies suddenly aged 56 in London.\n* 23 January – Double agent Kim Philby disappears from Beirut having defected to the Soviet Union.\n* 29 January – Charles de Gaulle, President of France, vetoes the UK's entry into the European Economic Community.\n* February – The Royal Air Force deploys Blue Steel nuclear standoff missiles to arm its V bomber force.\n* 11 February – The Beatles record their debut album Please Please Me in a single day at the Abbey Road Studios in London.\n* 14 February – The Labour Party elects 46-year-old Huyton MP, Harold Wilson as its new leader and Leader of the Opposition. Missing out in the leadership contest is Cardiff South East MP James Callaghan. Opinion polls are currently showing strong support for the Labour Party, with a general election due before the end of next year.\n* 16 February – Opinion polls indicate that in a general election Labour would defeat the Conservatives, who have governed since 1951.\n* March – The divorce case of the Duke and Duchess of Argyll takes place.\n* 15 March – Ridge v. Baldwin, a landmark case in the law of judicial review, is decided on appeal: a public official is held to be wrongfully dismissed because he had no notice of the grounds on which the decision was made, and no opportunity to be heard in his own defence.\n* 22 March – The Beatles release their debut album, Please Please Me.\n* 27 March – Chairman of British Railways Dr. Richard Beeching issues a report calling for huge cuts to the UK's rail network. This is expected to result in the closure of more than 2,000 railway stations as well as the loss of up to 68,000 jobs and the scrapping of some 8,000 coaches.\n* c. April – Engineering Building at the University of Leicester is completed, the first major work by James Stirling with James Gowan, and a leading example of Brutalist architecture.\n* 6 April – Polaris Sales Agreement with the United States, leading to commencement of construction of nuclear submarine facilities at Faslane Naval Base.\n* 9 April – Sir Winston Churchill becomes an honorary citizen of the United States.\n* 15 April – 70,000 protesters arrive in London, having marched 50 miles (80&nbsp;km) from Aldermaston to demonstrate against nuclear weapons.\n* 24 April – Princess Alexandra of Kent marries the Hon. Angus Ogilvy at Westminster Abbey.\n* 30 April – The Bristol Bus Boycott arises, due to the refusal of the Bristol Omnibus Company to employ Black or Asian bus crews in the city of Bristol, and lasts for 4 months.\n* 2 May\n** The Beatles reach #1 in the UK Singles chart for the first time with \"From Me to You\".\n** The Rootes Group's new car plant at the town of Linwood, Renfrewshire is opened by The Duke of Edinburgh for the production of its new rear-engined mini-car – the Hillman Imp – to compete against BMC's Mini. It has an economical 875cc engine, and is expected to be developed into luxury Singer and sporty Sunbeam variants in the near future. It is the first new car to be produced in Scotland for thirty years.\n* 7–13 May – The last servicemen are released from conscription as National Service ends.\n* 11 May\n** The Beatles album Please Please Me goes to the top of the UK Albums Chart.\n** Everton F.C. win the Football League First Division title.\n* 15 May – Tottenham Hotspur become the first British football team to win a European trophy when a 5–1 win over Atlético Madrid in Rotterdam gives them the European Cup Winners' Cup.\n* 25 May – Manchester United F.C. beat Leicester City 3–1 in the FA Cup final at Wembley Stadium with two goals from David Herd and another from Denis Law. It is Manchester United's first major trophy since eight of their players died in the Munich air disaster five years earlier.\n* 4 June – The high society nightclub Annabel's opens at 44 Berkeley Square, Mayfair.\n* 5 June – Profumo affair: John Profumo, Secretary of State for War, admits to misleading Parliament and resigns over his affair with Christine Keeler.\n* 8 June – Profumo affair: Stephen Ward is charged with living on immoral earnings.\n* 17 June – The Profumo affair has done the Conservative government no favours in the opinion polls, which continue to show that a Labour victory would be inevitable at a general election.\n* 1 July – Kim Philby named as the \"Third Man\" in the Burgess and Maclean spy ring.\n* 12 July – Pauline Reade, 16, is reported missing on her way to a dance in Gorton, Manchester, the first victim of the Moors murders.\n* 31 July – Water Resources Act provides for the regulation of water abstraction, principally through the establishment of regional river authorities.\n* August – Race riots in Dudley.\n* 5 August – The United States, United Kingdom and Soviet Union sign a nuclear test ban treaty.\n* 8 August – The Great Train Robbery takes place in Buckinghamshire.\n* 20 August – The Royal Shakespeare Company introduces its performance cycle of Shakespeare's history plays under the title The War of the Roses, adapted and directed by John Barton and Peter Hall, at the Royal Shakespeare Theatre, Stratford-upon-Avon.\n* September\n** First Leeds International Piano Competition: Michael Roll is the winner.\n** The Sindy fashion doll is first marketed by Pedigree.\n* 5 September – Christine Keeler is arrested for perjury. On 6 December, she is sentenced to nine months in prison.\n* 7 September – Geophysicists Fred Vine and Drummond Matthews publish proof of seafloor spreading on the Atlantic Ocean floor.\n* 12 September – The Beatles reach #1 for the second time, with the single \"She Loves You\" (released on 23 August).\n* 17 September – RAF Fylingdales radar station on the North York Moors begins operation as part of the United States Ballistic Missile Early Warning System.\n* 18 September – Rioters burn down the British Embassy in Jakarta to protest against the formation of Malaysia.\n* 23 September – The Robbins Report (the report of the Committee on Higher Education, chaired by Lord Robbins) is published. It recommends immediate expansion of universities, and that university places \"should be available to all who were qualified for them by ability and attainment\". Its conclusions are accepted by the government on 24 October.\n* 25 September – The Denning Report on the Profumo affair is published.\n* 26 September – Vauxhall launches the new Viva, a small family saloon, similar in size to BMC's 1100 and the Ford Anglia.\n* 29 September\n** The University of East Anglia opens in Norwich.\n** Release of the film Tom Jones.\n* 2 October – Ford Motor Company begins production of its Ford Anglia car at their new Halewood Body & Assembly plant on Merseyside.\n* 10 October\n** Prime Minister Harold Macmillan announces his resignation after nearly seven years in office, at the age of 69, on the grounds of ill health.\n** From Russia with Love, the second James Bond film, premieres at Odeon Leicester Square in London.\n* 17 October – Two British scientists (Alan Lloyd Hodgkin and Andrew Fielding Huxley) and an Australian (John Carew Eccles) are announced in Stockholm as winners of the Nobel Prize in Physiology or Medicine \"for their discoveries concerning the ionic mechanisms involved in excitation and inhibition in the peripheral and central portions of the nerve cell membrane\".\n* 18 October – Macmillan resigns as Prime Minister.\n* 19 October – Alec Douglas-Home replaces Macmillan as Prime Minister following discussion among members of the Cabinet, renouncing his peerage.\n* 22 October – The National Theatre Company, newly formed under artistic director Laurence Olivier, gives its first performance, with Peter O'Toole as Hamlet at The Old Vic in London.\n* November – Publication of Traffic in Towns, a report on urban transport planning policy produced for the Department of Transport by a team headed by Colin Buchanan.\n* 18 November – The Dartford Tunnel opens.\n* 22 November – C. S. Lewis, the author most famous for the Narnia books (1950–1955), dies aged 65 in Oxford. However, media coverage of his death (as also that of Aldous Huxley in the United States on the same day) is overshadowed by the assassination of American President John F. Kennedy, news of which reaches the UK just after 18:30 UTC.\n* 23 November\n** First episode of the BBC Television science fiction series Doctor Who is broadcast with William Hartnell as the First Doctor. The series runs until 1989 and is revived from 2005.\n** Police in Ashton-under-Lyne, Lancashire, begin a missing persons investigation following the disappearance of 12-year-old John Kilbride; he is the second victim of the Moors murders.\n* 25 November – The Duke of Edinburgh, Prime Minister Sir Alec Douglas-Home and Leader of the Opposition Harold Wilson attend the funeral of U.S. President John F. Kennedy in Washington, D.C.\n* 30 November – After an unbroken 30-week spell at the top of the UK Albums Chart, The Beatles album Please Please Me is knocked off the top of the charts by the group's latest album With the Beatles (released on 22 November).\n* 12 December\n** Kenya gains independence from the United Kingdom, with Jomo Kenyatta as Prime Minister.\n** The Beatles reach #1 for the third time with \"I Want to Hold Your Hand\" (released on 29 November).\n* 19 December – Zanzibar gains independence from the United Kingdom, as a constitutional monarchy under Sultan Jamshid bin Abdullah.\n* 21 December – First episode of the seven-part serial The Daleks broadcast in the Doctor Who series, introducing the alien Daleks (revealed fully in the following week's episode).\nUndated\n* BMC's new Rover P6 luxury saloon is the first winner of the prestigious European Car of the Year award.\n* S. Hille & Co market the Polypropylene stacking chair designed by Robin Day.\n* The launch of the Astro or lava lamp by the founder of Mathmos, Edward Craven-Walker.\n* The motorway network continues to grow with the opening of the first section of the M4 in Berkshire, the M6 between Warrington and Preston in Lancashire, and the M2 in Kent.\n* Economic growth for the year reaches a postwar high of 7.5% (slightly above the previous record of 7.2% in 1959), with GDP reaching 4.3% in the second quarter of the year.\nPublications\n* Agatha Christie's Hercule Poirot novel The Clocks.\n* Margaret Drabble's first novel A Summer Bird Cage.\n* Ian Fleming's James Bond novel ''On Her Majesty's Secret Service''.\n* John Fowles' novel The Collector.\n* The Group's poetry collection A Group Anthology edited by Edward Lucie-Smith and Philip Hobsbaum.\n* John le Carré's novel The Spy Who Came in From the Cold.\n* Alistair MacLean's thriller Ice Station Zebra.\n* Sylvia Plath's only novel The Bell Jar (under the pseudonym Victoria Lucas).\n* John Robinson (bishop of Woolwich)'s controversial religious book Honest to God.\n* C. P. Snow's novel Corridors of Power.\n* E. P. Thompson's social history The Making of the English Working Class.\n* The Sunday Pictorial newspaper is rebranded as the Sunday Mirror.\nBirths\nJanuary – April\n* 1 January – Linda Henry, actress\n* 3 January – Matthew Taylor, Liberal Democrat politician and MP for Truro and St Austell\n* 6 January – Ian Lavery, English trade unionist and politician\n* 11 January – Jason Connery, actor, voice actor and director\n* 15 January – Conrad Lant, English singer-songwriter and bass player\n* 16 January\n** Simon Johnson, English-born economist\n** James May, English motoring journalist and television presenter\n* 18 January – Ian Crook, English footballer\n* 19 January\n** Martin Bashir, British television journalist\n** John Bercow, English Conservative politician, MP for Buckingham and Speaker of the House of Commons\n** Caron Wheeler, British singer-songwriter (Soul II Soul)\n* 22 January – Huw Irranca-Davies, Welsh Labour politician and MP for Ogmore\n* 26 January\n** Jazzie B, DJ and music producer (Soul II Soul)\n** Andrew Ridgeley, English musician\n* 27 January – George Monbiot, British journalist and weekly columnist for The Guardian\n* 2 February – Stephen McGann, actor, author and science communicator\n* 3 February – Sarah Raven, gardener and writer\n* 6 February – Quentin Letts, journalist\n* 10 February – Philip Glenister, actor\n* 13 February – John King, English long jumper\n* 17 February – Alison Hargreaves, British mountain climber (died 1995)\n* 19 February – Seal, singer\n* 22 February – Andrew Adonis, Baron Adonis, English journalist and politician, Secretary of State for Transport\n* 7 March – Russell Williams, British-born Canadian military colonel and serial killer\n* 11 March – Alex Kingston, English actress\n* 12 March – Ian Holloway, English football player and manager\n* 14 March – Michael John Foster, English Labour politician and MP for Worcester\n* 16 March – Jerome Flynn, British actor\n* 20 March – David Thewlis, English actor\n* 22 March\n** Deborah Bull, British dancer and life peer\n** Susan Ann Sulley, British musician\n* 3 April – Karl Beattie, director, husband of Yvette Fielding\n* 4 April – Martin Firrell, public artist and activist\n* 6 April – Andrew Weatherall, English disc jockey (died 2020)\n* 7 April – Nick Herbert, Conservative politician and MP for Arundel and South Downs\n* 8 April – Julian Lennon, musician son of John Lennon\n* 11 April – Mark Thomas, comedian and activist\n* 13 April – Mo Johnston, Scottish footballer\n* 20 April – Rachel Whiteread, artist\n* 22 April – Sean Lock, comedian and actor (died 2021)\n* 25 April – David Moyes, Scottish football player and manager\n* 27 April – Russell T Davies, Welsh screenwriter and television producer\nMay – August\n* 9 May\n** Barry Douglas Lamb, musician, author and preacher\n** Richard Moore, diplomat\n* 10 May – Debbie Wiseman, composer\n* 11 May – Natasha Richardson, actress (died 2009)\n* 15 May – Inga Beale, insurance executive\n* 26 May – Simon Armitage, poet laureate\n* 1 June – David Westhead, actor and producer\n* 6 June\n** Jason Isaacs, actor\n** James Palumbo, Baron Palumbo of Southwark, businessman and politician\n* 11 June\n** Chic Charnley, Scottish footballer\n** Andy Street, businessman and metropolitan mayor\n* 13 June – Sarah Connolly, operatic mezzo-soprano\n* 18 June – Adam Hargreaves, children’s author\n* 23 June – Colin Montgomerie, Scottish golfer\n* 25 June – George Michael, pop singer (died 2016)\n* 27 June – Meera Syal, comedian, writer, singer and actress\n* 29 June\n** Tom Butcher, actor\n** Errol Christie, boxer (died 2017)\n* 1 July –\n** Mike Joyce, drummer\n** Kenneth Erskine, serial killer\n* 2 July – Mark Kermode, film critic\n* 3 July – Tracey Emin, artist\n* 6 July – Stuart Garrard, English guitarist\n* 7 July – Alister Jack, politician\n* 9 July\n** Adrian Flook, politician\n** John Mark Ainsley, English lyric tenor\n* 20 July – John Simmit, actor and stand-up comedian\n* 25 July – Julian Hodgson, English chess grandmaster\n* 29 July – Graham Poll, English football referee\n* 31 July\n** Fatboy Slim (born Quentin Leo Cook), English musician\n** Fergus Henderson, English chef\n* 1 August\n** Laura Janner-Klausner, Reform rabbi\n** Amber Rudd, politician\n* 3 August – Tasmin Archer, English singer\n* 5 August – Mark Strong, actor\n* 7 August – Wendy van der Plank, actress\n* 15 August – Simon Hart, politician\n* 17 August – James Whitbourn, composer\n* 30 August\n** Phil Mills, race car driver\n** Paul Oakenfold, disc jockey\n** Mark Strong, actor\nSeptember – December\n* 3 September – Malcolm Gladwell, writer\n* 6 September – Pat Nevin, Scottish footballer\n* 19 September\n** Jarvis Cocker, English musician (Pulp)\n** David Seaman, English footballer\n* 26 September – Lysette Anthony, English actress\n* 5 October – Nick Robinson, journalist\n* 12 October\n** Dave Legeno, English actor and mixed martial artist (died 2014)\n** Alan McDonald, Northern Irish footballer\n* 31 October\n** Sanjeev Bhaskar, comic actor\n** Sarah Brown, wife of Gordon Brown\n** Johnny Marr, English musician\n* 1 November\n** Rick Allen, British musician (Def Leppard)\n** Mark Hughes, Welsh footballer and football manager\n* 3 November – Ian Wright, English footballer and radio/TV personality\n* 4 November – Lena Zavaroni, Scottish entertainer (died 1999)\n* 5 November – Jo Malone, perfumer and businesswoman\n* 8 November – Paul McKenna, hypnotist\n* 10 November – Hugh Bonneville, English actor\n* 14 November – Keith Curle, English footballer, football manager and football coach\n* 15 November – Andrew Castle, English tennis player and broadcaster\n* 19 November – Jon Potter, British field hockey player and businessman\n* 20 November – William Timothy Gowers, British mathematician\n* 21 November – Nicollette Sheridan, English actress\n* 26 November – Joe Lydon, English rugby league footballer of the 1980s and 1990s, rugby union coach of the 2000s and 2010s\n* 28 November – Armando Iannucci, Scottish satirist\n* 5 December – Eddie 'the Eagle' Edwards, English ski jumper\n* 7 December\n** Mark Bowen, Welsh footballer\n** Paul Dobson, voice actor\n* 8 December – Brian McClair, Scottish footballer and football coach\n* 22 December\n** Bryan Gunn, Scottish footballer and football coach\n** Russell Lewis, television writer and former child actor\n* 24 December – Caroline Aherne, comic television actress/writer (died 2016)\n* 29 December – Dave McKean, English artist and filmmaker\nDeaths\n* 15 January – Morgan Phillips, general secretary of the Labour Party (born 1902)\n* 18 January\n** Hugh Gaitskell, leader of the Labour Party (born 1906)\n** Edward Charles Titchmarsh, mathematician (born 1899)\n* 22 January – Lily Montagu, pioneer of reform Judaism (born 1873)\n* 30 January – Cecil McGivern, broadcasting executive and writer (born 1907)\n* 11 February – Sylvia Plath, American poet and writer, suicide (born 1932)\n* 5 March – Cyril Smith, Scottish actor, heart attack (born 1892)\n* 16 March – William Beveridge, economist and social reformer (born 1879)\n* 18 March – Sir Hubert Gough, general (born 1870)\n* 31 March – Sir Harold Franklyn, general (born 1885)\n* 25 April – Christopher Hassall, actor, dramatist, librettist, lyricist and poet (born 1912)\n* 26 April – Roland Pertwee, playwright, screenwriter, director and actor (born 1885)\n* 7 May – Max Miller, music hall comedian (born 1894)\n* 29 May – Netta Muskett, novelist (born 1887)\n* 5 June – Sir Adrian Carton de Wiart VC, general (born 1880 in Belgium)\n* 12 June – Andrew Cunningham, admiral (born 1883)\n* 17 June\n** Alan Brooke, 1st Viscount Alanbrooke, field marshal (born 1883)\n** John Cowper Powys, novelist, lecturer and philosopher (born 1872)\n* 4 July – Bernard Freyberg, 1st Baron Freyberg, general and Governor-General of New Zealand (born 1889)\n* 10 July – Teddy Wakelam, sports broadcaster and rugby union player (born 1893)\n* 16 August – Joan Eardley, painter (born 1921)\n* 22 August – William Morris, 1st Viscount Nuffield, founder of Morris Motors and philanthropist (born 1877)\n* 30 August – Guy Burgess, spy, one of the Cambridge Five, in Moscow (born 1911)\n* 3 September – Louis MacNeice, poet and playwright (born 1907)\n* 20 September – Peter Craven, English motorcycle racer, in racing accident (born 1934)\n* 22 November\n** Aldous Huxley, novelist (born 1894)\n** C.S. Lewis, Irish-born British writer (born 1898)\n* 30 November – Cyril Newall, 1st Baron Newall, air marshal and Governor-General of New Zealand (born 1886)\n* 21 December – Jack Hobbs, cricketer (born 1882)\n* December – Andy Kennedy, Northern Irish footballer (born 1897)\nSee also\n* 1963 in British music\n* 1963 in British television\n* List of British films of 1963\nReferences"
    }
  ]
}