{
  "content": [
    {
      "type": "text",
      "text": "# 1964 Democratic Party vice presidential candidate selection\n\n| image1 = File:Hubert Humphrey crop.jpg\n| nominee1 = Hubert Humphrey\n| colour1 = 1E90FF\n| home_state1 = Minnesota\n| map_image =\n| map_size =\n| map_caption =\n| title = Vice Presidential nominee\n| before_election = Lyndon B. Johnson\n| before_party =\n| after_election = Hubert Humphrey\n| after_party =\n}}The selection of the Democratic Party's vice presidential candidate for the 1964 United States presidential election occurred at the party's national convention and resulted in the selection of Senate majority whip Hubert Humphrey to join the ticket with President Lyndon B. Johnson, who was running for election to a full term. Humphrey would go on to become the Democratic presidential nominee in 1968 after Johnson withdrew his bid from re-election to a second full term, but ultimately lost to former Vice President Richard Nixon in the close general election.\nBackground\nAfter the assassination of President John F. Kennedy in 1963, Vice President Lyndon B. Johnson ascended to the presidency. As the Twenty-fifth Amendment to the United States Constitution had not yet been passed, there was no process for filling the office of vice president until the next post-election inauguration, and Speaker of the House John William McCormack was next-in-line for the presidency from November 1963 to January 1965. Johnson carefully considered his running mate for the 1964 election, and put up \"trial balloons\" in the media.\nSpeculation\nThose who were the subject of speculation included Humphrey, who was a key lieutenant for Johnson in the Senate, particularly in regards to the 1964 Civil Rights Act. Others included Connecticut Senators Abraham Ribicoff and Thomas J. Dodd, Secretary of Defense Robert McNamara, New York Mayor Robert Wagner, California Governor Pat Brown, and Minnesota Senator Eugene McCarthy. Many Democrats also hoped for Attorney General Robert F. Kennedy, the brother of former President John F. Kennedy, but Johnson carefully maneuvered to keep Kennedy off the ticket due to personal enmity between the two.\nSelection\nAs the convention got underway, a potential issue was that there were competing delegations from Mississippi. The Mississippi Freedom Democratic Party, which included black and white members opposed to racial segregation, challenged the delegate credentials of Mississippi Democratic Party members who favored segregation. Johnson wanted no disruptions to distract from his nomination, and he assigned Humphrey to solve the problem. Humphrey worked with his protegee, the then-Attorney General of Minnesota and future appointee to Humphrey's own Senate seat, Walter Mondale, to craft a compromise which satisfied Johnson.\nOn August 27, Humphrey met with Johnson in the Oval Office. In their discussion, they agreed that if Humphrey joined the ticket and Johnson and Humphrey won the general election, Humphrey would have important executive branch responsibilities, including oversight of the administration's nuclear disarmament, antipoverty, and space programs. In addition, they agreed that Humphrey would have a high profile role in Johnson's foreign policy. After this interview, Johnson announced his choice of Humphrey for the vice presidential nomination.\nHumphrey easily won the vice presidential nomination on the first ballot at the 1964 Democratic National Convention. The Johnson–Humphrey ticket went on to beat the Goldwater–Miller ticket in the 1964 election.\nPotential running mates\nFinalists\nFile:Hubert Humphrey crop.jpg|alt=|\nFile:1964 Portrait Eugene McCarthy (cropped).jpg|\nFile:Thomasjdodd.jpg|\nOthers\nFile:Pat Brown, 1963.jpg|alt=|\nFile:Ribicoff.jpg|alt=|\nFile:RobertFWagner.png|alt=|\nFile:Orville L. Freeman, Secretary of Agriculture (1961-1969).jpg|alt=|\nFile:Robert F Kennedy crop.jpg|alt=|\nFile:AdlaiEStevenson 3x4 (A).jpg|alt=|\nFile:Michael Joseph Mansfield.jpg|alt=|\nFile:Sargent Shriver 1961 (cropped 3x4).jpg|\nFile:RobertMcNamara55.jpg|\nSee also\n*1964 Democratic National Convention\n*1964 Democratic Party presidential primaries\nReferences"
    }
  ]
}