{
  "content": [
    {
      "type": "text",
      "text": "# 1964 FLHP rebellion\n\nProvisional Government of South Vietnam\n| combatant2        =  FLHP\n| commander1        = Phan Khắc SửuNguyễn KhánhDương Văn MinhTrần Thiện KhiêmNguyễn Phước Vĩnh LộcHoàng Xuân Lãm\n| commander2        = Y Bham EnuolY Dhơn Adrong\n| units1            = II Corps\n* 23rd Division\n| units2            = None\n| casualties1       = 35 killed\n| casualties2       = Unknown\n}}\nFLHP rebellion, fought in Central Highlands, South Vietnam, was an uprising of the Vietnam War, between the Army of the Republic of Vietnam (ARVN) and the  Central Highlands Liberation Front (FLHP).\nRebellion\nOn 26 August 1964, a congress of 55 moderate Montagnards, representing ethnic minorities, met in Pleiku, Vietnam. Fearing being excluded from the negotiations, the rebels staged an uprising on the night of 19 September 1964. Special Forces commandos and Highlands Civilian Combat Teams captured a number of outposts in Quảng Đức province such as Đức Lập, Bù Đăng, and Bù Đốp. The rebels controlled Highway 14, attacked Srépok post, then advanced to Buôn Ma Thuột, occupied the VTVN radio station, and called on the Montagnards to rise up against the Kinh to build an independent nation. The uprising killed 35 Republic of Vietnam soldiers.\nOn 20 September 1964, General Nguyễn Phước Vĩnh Lộc, commander of Tactical Zone II, declared martial law in Buôn Ma Thuột, the 23rd Division, along with several commando and armored battalions, were mobilized to retake the radio station and other rebel-occupied outposts. Suddenly the US embassy advised Vĩnh Lộc to negotiate.\nAftermath\nY Bhăm Êñuôl á representative of the moderate faction of FLHP, was invited to negotiate with the rebels. The results of the agreements:\n*Y Bhăm Êñuôl was appointed as the official president of the FLHP movement. However, Y Bham Eñuol fled to Cambodia on the afternoon of 20 September.\n*Rebel commanders were not prosecuted and were not pursued as they withdrew through Cambodia.\nSee also\n* FULRO\n* Degar State\nReferences\nFurther reading\n*"
    }
  ]
}