{
  "content": [
    {
      "type": "text",
      "text": "# 1966 United States House of Representatives election in Delaware\n\n| title = U.S. Representative\n| before_election = Harris McDowell\n| before_party = Democratic Party (United States)\n| after_election = William Roth\n| after_party = Republican Party (United States)\n}}\nThe 1966 United States House of Representatives election in Delaware took place on November 8, 1966, to decide who would represent Delaware's at-large congressional district in the United States House of Representatives. Incumbent Representative Harris McDowell ran for re-election to a sixth term but lost to Republican challenger William Roth by 11 percentage points. Prior to the election, the seat was regarded as being a safe Democratic seat. With the loss, Harris McDowell became the last Democrat to represent Delaware in the House until Tom Carper in 1982. The election was held during Democratic President Lyndon B. Johnson's second term; his party lost 47 seats in the House.\nRoth and McDowell both ran again in 1968 with Roth increasing his margin of victory.\nBackground\nIncumbent Harris McDowell was a veteran Democrat and was expected to easily hold the seat. In 1964, he had won reelection by 13 points and over 26 thousand votes. McDowell had previously lost a re-election bid in 1956 before returning to the House of Representatives in 1958. The election was held during the midterm election cycle of Democratic President Lyndon B. Johnson second term.\nPrimaries and candidates\n* Harris McDowell (Democrat), incumbent representative seeking a sixth term\n*William Roth (Republican), attorney and unsuccessful candidate for Lieutenant Governor of Delaware in 1960\n*James M. Tunnel Jr. (Democrat), former member of the Delaware Supreme Court, defeated in the primary\n*George W. Cripps (Republican), defeated in the primary\nDemocratic primary\nThere was some effort from the Delaware Democratic Party to get McDowell to run against Republican Senator J. Caleb Boggs in the concurrent Senate election. McDowell declined, opting to instead seek another term in the House. McDowell was challenged by James M. Tunnell Jr., a former judge on the Delaware Supreme Court.\nRepublican Primary\nThe first person to announce their candidacy for the Republican nomination was George W. Cripps. Following the death of his son in the Vietnam War, Cripps called for further US engagement in Vietnam. Cripps was challenged for the nomination by attorney and former Republican State Committee of Delaware (GOP) chairman William Roth. Cripps and Roth did not run negative campaign advertisements and avoided attacking each other. Roth explained that since Republicans were the minority party they \"cannot afford the luxury of disunity\". At the GOP state convention, Cripps withdrew from the race and endorsed Roth's campaign, describing him as \"The kind of man we need in the Republican party.\" He subsequently won the nomination for Delaware's Auditor of Accounts.\nGeneral election\nThroughout the campaign, Roth appeared alongside his wife, Jane, and their dog, Ludwig. Roth stated that he hoped to shake hands with 50 thousand voters. He frequently wore a yellow button reading \"I am Bill Roth\", Roth had previously worn the button during his unsuccessful 1960 campaign for Lieutenant Governor of Delaware.\nDuring the campaign, Roth aggressively criticized then-President Lyndon B. Johnson, particularly his foreign policy. Cy Liberman of The Morning News joked that Roth was \"running against the President of the United States in addition to the Democratic Congressman.\" McDowell made a similar comment saying that Roth was \"running against President Johnson, the Department of Defense and all the liberal legislation passed in the past six years.\" He further criticized Roth, saying that his political positions were unclear. On October 28, 1966, Roth and McDowell participated in a debate at the University of Delaware. The debate was sponsored by the Student Government Association. Questions were written by students of the university's political science department.\nAllegations of voting irregularities\nDuring the campaign, John J. Smith, a Republican candidate for the state legislature, claimed there were irregularities with voting registration. Smith asked the United States Department of Justice to investigate and monitor the election, but was rejected due to a lack of legal basis for the request. A report by the grand jury of New Castle County found that there was some evidence of illegal activity, including voters participating in primaries for parties they were not registered for and allowing them to vote without proper voter identification. A list of absentee voters was made available to select Democratic candidates, including McDowell. No Republicans received the list, Delaware GOP chairman Clayton S. Harrison criticized this decision, referencing the findings of the grand jury report. Reportedly, McDowell used the list to send out campaign materials.\nResults\nThe election took place on November 8, 1966, concurrently with various other elections. Like with most cycles the President's party struggled, losing 47 house seats along with various governorships and Senate seats. Roth defeated McDowell by around 11 percent of the vote. He received 97,268 votes, nearly 30 thousand more than McDowell's 67,281. Roth received the second highest number of votes of any Republican candidate elected at-large, behind only incumbent Insurance Commissioner Robert A. Short.\nAdditionally, Roth won all three of Delaware's counties. His strongest showing was in New Castle County where he received 66,871 votes. McDowell's strongest showing was also in New Castle County where he received 49,718 votes. The closest was Kent County where Roth won by just 723 votes.\n12.4\n}}\n12.3}}\nAftermath\nFollowing his victory, Roth resigned from his position as a senior councilman at Hercules Inc. McDowell, like several other lame duck representatives, McDowell was set travel to Europe as part of a congressional delegation. However, he, alongside fellow Democratic representatives Ronald B. Cameron of California and Roy H. McVicker of Colorado, decided to cancel his trip. When asked why, McDowell explained that he did not believe it was fair for an outgoing congressman to go abroad.\nMcDowell and Roth competed again in the following election; Roth won re-election, increasing his margin of victory to seventeen points. Following the second loss, McDowell retired from politics. During Roth's second term, he resigned from the House to fill a vacant Senate seat. He was succeeded by Republican state representative Pete du Pont. McDowell was the last Democrat to represent Delaware in the House until Delaware Treasurer Tom Carper's 1982 victory. After his defeat, McDowell was appointed to a position within the Government of Delaware by then-Governor Charles L. Terry Jr. Despite this, during the following election Terry endorsed candidates to run against McDowell in the Democratic primary.\nReferences"
    }
  ]
}