{
  "content": [
    {
      "type": "text",
      "text": "# 1967 South Vietnamese presidential election\n\n| running_mate1 =  Nguyễn Cao Kỳ\n| party1 = Democratic Progressive\n| popular_vote1 = 1,649,561\n| percentage1 = 34.83%\n| image2 = Trương Đình Dzu.png\n| nominee2 = Trương Đình Dzu\n| party2 = The White Dove\n| color2 = 808080\n| running_mate2 = Trần Văn Chiêu\n| popular_vote2 = 817,120\n| percentage2 = 17.26%\n| image3 = Portrait of Phan Khắc Sửu, Chief of State.jpg\n| nominee3 = Phan Khắc Sửu\n| party3 = Democratic Socialist\n| color3 = 8B0000\n| running_mate3 = Phan Quang Đán\n| percentage3 = 10.84%\n| popular_vote3 = 513,374\n| image4 = 越南前總理陳文香.jpg\n| nominee4 = Trần Văn Hương\n| party4 = Independent\n| running_mate4 =\n| percentage4 = 10.01%\n| popular_vote4 = 474,100\n| image5 = Hà_Thúc_Ký.png\n| nominee5 = Hà Thúc Ký\n| party5 = VNQDĐ\n| running_mate5 = Nguyễn Văn Đình\n| percentage5 = 7.38%\n| popular_vote5 = 349,473\n| image6 =\n| nominee6 =\n| party6 = The Buffalo\n| color6 = 800080\n| running_mate6 = Trần Cửu Chấn\n| percentage6 = 6.16%\n| popular_vote6 = 291,718\n| after_party = Democratic Progressive\n| after_election = Nguyễn Văn Thiệu\n| title = President\n}}\nPresidential elections were held in South Vietnam on 3 September 1967, following the promulgation of a new constitution on 1 April. The result was a victory for Nguyễn Văn Thiệu, who received 35% of the vote. Voter turnout was 83%. The elections are widely considered to have been fraudulent. Senate elections were held in South Vietnam on 3 September 1967, alongside presidential elections. The lower house elections took place on October 22.\nBackground\nThe military junta chaired by Nguyễn Cao Kỳ intended to endorse only one candidate for the presidency. Kỳ intended to run, but at the last minute changed his mind and backed Thiệu, a move he later called \"the biggest mistake of my life.\" Thiệu nominated Kỳ as his running mate. American policymakers heard rumors that the generals had agreed to subvert the constitution, and The New York Times revealed the formation of a secret military committee that would control the government after the elections.\nDuring the negotiations within the military, Kỳ had agreed to stand aside in exchange for behind-the-scenes power through a military committee that would shape policy and control the civilian arm of the government. Kỳ flatly denied these reports to Ambassador Ellsworth Bunker, and the American embassy notified Washington that The New York Times story was baseless. However, the story was later vindicated, as intelligence sources obtained the charter that told of the functions of the secret Supreme Military Committee (SMC). Walt Rostow briefed President Lyndon B. Johnson and concluded that the SMC was \"in effect, a scheme for 'guided democracy' in which a half dozen generals would decide finally what was good and bad for the country.\"\nCampaign\nThe campaign was overshadowed by American media criticism of Kỳ and Thiệu's unfair electoral practices. All the candidates were scheduled to attend a rally at Quảng Trị in the far north of the country on 6 August. Owing to the security situation and the possibility of communist attacks, the politicians were transported to joint campaign events by the military, rather than being free to go to separate events as their strategy dictated. However, the Quảng Trị event had to be cancelled after the candidates' plane landed 23&nbsp;km away at an air base in Đông Hà.\nBelieving that the mishap was a deliberate attempt to make them look chaotic and disorganized (Thiệu and Kỳ had decided not to attend rallies) the candidates boycotted the event and flew back to Saigon. There they denounced the government bitterly. The leading opposition candidate, Trần Văn Hương, claimed that Thiệu and Kỳ \"purposefully arranged the trip to humiliate us and make clowns out of us.\" As air force chief, Kỳ had previously stranded opposition politicians on a trip to the Central Highlands. Kỳ and Thiệu maintained that no malice was involved, but their opponents did not believe it. None of the candidates made good on their threat to withdraw, but their strident attacks over the alleged dirty tricks dominated the media coverage of the election for a period.\nThe adverse publicity embarrassed Washington; instead of hearing reports about progress and good governance in South Vietnam, most reports focused on corruption and fraud. The heavy and negative coverage of the election provoked angry debate in Congress, criticising Kỳ's junta and Johnson's policies. Such sentiment came from both houses and political parties. On 10 August 57 members of the United States House of Representatives signed a statement condemning Kỳ's electoral malpractices and threatening a review of U.S. policy in Vietnam.\nKỳ and Thiệu were reluctant to campaign and meet the populace as they saw such events as liabilities rather than opportunities to win over the public, and showed little interest in gaining popular support in any case, as they could always count on a rigging of the ballot. The CIA reported that the pair had no intention of participating on the arranged rallies with the civilian candidates because they felt that \"possible heckling from the audience that would be too humiliating.\" Thiệu and Kỳ were correct; they made one public campaign appearance at a rally, where a very disapproving crowd in Huế assailed Kỳ as a \"hooligan\" and \"cowboy leader\".\nKỳ and Thiệu decided to campaign indirectly by appearing at set piece ceremonial appointments, such as transferring land titles to peasants, as hostile elements from the general population were less likely to be present. Thiệu took a restrained and more moderate stance during the campaign toward the issue of democracy, while Kỳ, the public face of the ticket and the incumbent government, went on the attack, damaging the pair's image and supposed commitment to democracy. Kỳ did not hide his distaste for democracy or his opponents and \"described the civilian candidates as 'ordure' [dirt, filth, excrement], 'traitors,' and 'destroyers of the national interest.'\" He continued on to say that if his opponents continued to attack him, he would cancel the poll. In the accompanying Senate elections, Kỳ openly endorsed 11 slates, but only one was successful in gaining one of the six seats.\nDuring the elections it was reported that armed soldiers \"show[ed] voters how to mark their ballots\" and that soldiers and police surrounded the legislature as it certified the election results.\nResults\nThe elections were held under plurality voting and are largely considered to have been fraudulent.|vp6=Trần Cửu Chấn|party6=|votes6=291718\n|cand7=|vp7=Nguyễn Thế Truyền|party7=|votes7=160790\n|cand8=Vũ Hồng Khanh|vp8=Dương Trung Đường|party8=|votes8=149276\n|cand9=|vp9=Lưu Quang Khình|party9=|votes9=131071\n|cand10=Phạm Huy Cơ|vp10=Lý Quốc Sinh|party10=|votes10=106317\n|cand11=Trần Văn Lý|vp11=Huỳnh Công Đương|party11=|votes11=92604\n|invalid=132862\n|electorate=5853251\n|source=[https://books.google.com/books?id=FlumEwyJqLgC&dq=south%20vietnam%20invalid%201967%20132862&pg=PA31043 Congressional Record]\n}}\nReferences"
    }
  ]
}