{
  "content": [
    {
      "type": "text",
      "text": "# 1967 United Kingdom foot-and-mouth outbreak\n\nThe 1967 United Kingdom foot-and-mouth outbreak was a major outbreak of foot and mouth disease in the United Kingdom. The only centre of the disease, in contrast to the three concentrated areas in the 2001 crisis, was on the Wales border with Shropshire. France and other European countries were also affected by the crisis.\nBackground\nThere were three official inquiries into the foot-and-mouth epidemics and the Government’s response in the fifty years prior to the 1967 outbreak. These occurred in 1922, 1923-1924, and 1953. In the 1950s, there was a substantial outbreak across the United Kingdom. Of the thirteen years leading up to the 1967 outbreak, there were only two years that there was no reported outbreak. During this period, foot-and-mouth was prevalent across Europe.\nOutbreak\nIn October 1967, a farmer from Bryn Farm near Oswestry in the county of Shropshire, concerned by the health of one of their sows, sought veterinary advice and the animal was found to have contracted foot-and-mouth disease. Bryn Farm was immediately put into quarantine and general animal movement was banned. The virus rapidly spread to the nearby Ellis Farm. Two cows from the latter had already been sent to market, leaving the farmers in a vulnerable position. In the following months, over 2,364 outbreaks were detected in the United Kingdom. Ninety-four percent of the cases occurred in North-West Midlands and North Wales.\nReports\nThe Minister for Agriculture, Frederick Peart, appointed a committee to investigate the outbreak. The Report of the Committee of Inquiry on Foot-and-Mouth Disease part 1 and part 2 were published on 7 March 1969 and 3 November 1969. This report became more commonly known as the Northumberland Report, after its chairman the Duke of Northumberland, a member of the House of Lords. It provided recommendations to keep the disease out of the country and plans for fighting the foot-and-mouth disease.\nOrigins of the 1967-8 Foot-and-Mouth Disease Epidemic was published by the Chief Veterinary Officer, John Reid, on 7 February 1968. This report described the lessons learned from the outbreak.\nAftermath\nAfter the outbreak, the United Kingdom adopted a policy to control imports from countries where foot-and-mouth is endemic. After creating this policy, the only outbreak to occur until 2001 was in 1981 on the Isle of Wight.\nIssues\nSpread of disease\nAccording to John Bennett, a young farmer at the time of the crisis at Manor Farm in Worcestershire, the disease was introduced into the county \"when a local farmer fed skimmed milk, bought from Shropshire where the disease was raging out of control, to his pigs\".\nAnimal slaughter\nOver the course of six months, 430,000 animals across 2300 farms were slaughtered.\nHuman transmission\nThe 1967 crisis saw the last reported case of human foot-and-mouth disease. The victim was a farm-worker who was believed to have contracted the virus by consuming contaminated milk. The disease was not life-threatening and they were able to recover within several weeks.\nIn popular culture\nThe outbreak was referenced by the villain Ernst Stavro Blofeld in the 1969 James Bond film ''On Her Majesty's Secret Service.  It also featured in the drama series Heartbeat''.\nSee also\n* 2001 United Kingdom foot-and-mouth crisis\n* 2007 United Kingdom foot-and-mouth outbreak\nReferences\nFurther reading\n*"
    }
  ]
}