{
  "content": [
    {
      "type": "text",
      "text": "# 1968 in the Vietnam War\n\n| image       = Cholon after Tet Offensive operations 1968.jpg\n| image_size  = 300px\n| alt         = Cholon after Tet Offensive operations 1968\n| caption     = Cholon after Tet Offensive operations 1968\n| date        =\n| place       = Vietnam\n| coordinates =\n| result      = The American war effort in Vietnam peaks in 1968 as the American public support takes a huge hit after the Tet Offensive\n| combatant1  = Anti-Communist forces:\nKingdom of Laos\n| combatant2  = Communist forces:\nViet Cong Khmer Rouge Pathet Lao\n| commander1  =\n| commander2  =\n| strength1   = US: 536,100   South Vietnam: 820,000\nSouth Korea: 50,003\nThailand: 6,005\nAustralia: 7,661\nPhilippines:  1,576\nNew Zealand:  516\n| strength2   = PAVN/VC: 420,000\n| casualties1 = US: 16,899 killed 87,388 woundedSouth Vietnam: 27,915 killed 172,512 wounded\n| casualties2 = U.S estimates: 191,000 – 181,149 killed |group=\"A\"}})North Vietnamese Records:KIA: 44,842Total casualties: 111,306 killed and wounded\n}}\nThe year 1968 saw major developments in the Vietnam War. The military operations started with an attack on a US base by the North Vietnamese People's Army of Vietnam (PAVN) and the Viet Cong (VC) on January 1, ending a truce declared by the Pope and agreed upon by all sides. At the end of January, the PAVN and VC launched the Tet Offensive.\nHanoi erred monumentally in its certainty that the offensive would trigger a supportive uprising of the population. PAVN/VC troops throughout the South, from Hue to the Mekong Delta, attacked in force for the first time in the war, but to devastating cost as the Army of the Republic of Vietnam (ARVN) and American troops killed close to 37,000 of the ill-supported enemy in less than a month for losses of 3,700 and 7,600 respectively. These reversals on the battlefield (the VC would never again fight effectively as a cohesive force) failed to register on the American home front, however and fueled what would ultimately prove to be a propaganda victory for Hanoi.\nU.S. troop numbers peaked in 1968 with President Johnson approving an increased maximum number of U.S. troops in Vietnam at 549,500. The year was the most expensive in the Vietnam War with America spending US$ (US$ }} in ) on the war. The year also became the deadliest of the Vietnam War for America and its allies with 27,915 ARVN soldiers killed and the Americans suffering 16,592 killed compared to around two hundred thousand PAVN/VC killed. The deadliest  day of the Vietnam War for the U.S. was 31 January at the start of the Tet Offensive when 246 Americans were killed in action.\nJanuary\n;1–2 January\nThe PAVN violated the New Year's truce in the New Year's Day Battle of 1968. Among the Americans fighting were future writer Larry Heinemann and future film director Oliver Stone. The PAVN lost 328 killed, while U.S. losses were 23 killed.\nIn Newsweek magazine Robert Komer touted the early success of the Civil Operations and Revolutionary Development Support (CORDS) pacification program he led. He said that \"only one South Vietnamese in six now lives under VC [Viet Cong] control.\"\n;2 January\nElements of the 12th Cavalry Regiment engaged a unit from the PAVN 2nd Division in a four-hour-long battle 5&nbsp;km south of Firebase Ross resulting in 3 U.S. and 39 PAVN killed.\n;3 January\nThe VC launched more than 50 122&nbsp;mm rockets at Da Nang Air Base destroying a United States Marine Corps (USMC) F-4B and two United States Air Force (USAF) aircraft and damaging 17 others.\nThe PAVN 3rd Regiment, 2nd Division attacked four U.S. firebases in the Quế Sơn Valley southwest of Hội An, launching ground attacks against Landing Zone Leslie and Firebase Ross. Leslie was occupied by D Company and a platoon from A Company, 2nd Battalion, 12th Cavalry. The PAVN penetrated the base, attacking bunkers with flamethrowers and satchel charges before being pushed out in the afternoon. Losses were 15 U.S and 63 PAVN. The PAVN emplaced heavy machine guns around Leslie and over a nine-day period shot down seven 1st Cavalry Division helicopters and damaged a further 26. At Ross the attack was repulsed with losses of 18 U.S. and 331 PAVN killed.\n;4 January\nA unit of the U.S. 4th Infantry Division operating in Đắk Tô District captured a classified five-page North Vietnamese document, titled \"Urgent Combat Order No. 1\", that described the strategy for a series of attacks to take place in Pleiku in conjunction with the upcoming Tết holiday.\nA PAVN rocket and mortar attack on Ban Me Thuot East Airfield destroyed two UH-1s and severely damaged three others.\n;5 January\nThe \"Boston Five\" Michael Ferber, Dr. Benjamin Spock, William Sloan Coffin, Mitchell Goodman and Marcus Raskin were indicted by a Grand jury in Boston on charges of conspiring to counsel young men to violate draft laws.\n;8 January\nA CH-53A of HMH-463 crashed in the Hải Lăng Forest south of Đông Hà Combat Base, killing all 46 personnel on board\n;9 January\nAt a meeting with Commander of the Military Assistance Command, Vietnam (MACV) General William Westmoreland, II Field Force, Vietnam commander Major General Frederick C. Weyand showed Westmoreland that PAVN/VC main force units in the III Corps area were moving in from the Cambodian border towards Saigon. Weyand received permission from Westmoreland to cancel scheduled operations near the border and shift his forces back towards Saigon.\n;10 January\nVC sappers penetrate the perimeter of Kontum Airfield and destroyed several helicopters with Satchel charges, killing 7 Americans and wounding 25. An estimated 16 VC were killed in the attack.\n;12 January\nThe Kampuchean Revolutionary Army was established by the orders of Pol Pot, the leader of the Communist Party of Kampuchea (CPK).\n;15 January to 9 February\nOperation San Angelo was a 1st Brigade, 101st Airborne Division search and destroy operation in Quang Duc and Phước Long Provinces. the operation resulted in 63 PAVN/VC and 12 U.S. killed.\n;18 January\nPresident Lyndon Johnson nominates Clark Clifford to succeed Robert McNamara as United States Secretary of Defense.\nAt a White House luncheon with First Lady Lady Bird Johnson in a discussion about juvenile delinquency, singer Eartha Kitt said \"You send the best of this country off to be shot and maimed. They rebel in the street. They will take pot ... and they will get high. They don't want to go to school because they're going to be snatched off from their mothers to be shot in Vietnam.\" Her remarks caused Mrs. Johnson to burst into tears and led to Kitt being blacklisted and investigated by the CIA, effectively ending her career.\n;19 January\nIn the first two weeks of 1968, PAVN/VC forces shelled 49 district and provincial capitals in South Vietnam and temporarily occupied two of them. General Westmoreland described the fighting to Time magazine \"as the most intense of the entire war.\"  MACV claimed that 5,000 PAVN/VC had been killed.\n;20 January\nRon Kovic serving with the 1st Amphibian Tractor Battalion, 3rd Marine Division was shot and paralysed during a battle with the PAVN in the vicinity of the village of My Loc, in the Demilitarized Zone (DMZ).\n;20–31 January 1969\nOperation McLain a security operation conducted by the U.S. 3rd Battalion, 506th Infantry Regiment, 101st Airborne Division and ARVN 44th Regiment, 23rd Division in Bình Thuận Province commences. The operation results in 1,042 VC and 69 U.S. killed.\n;21 January\nNorth Korean commandos carry out the Blue House raid, the most significant escalation in the low-intensity conflict that had been underway in South Korea since October 1966. The attack raised the possibility that the South Korean Government might want to withdraw some of their forces in South Vietnam for homeland defense, requiring their replacement by already overstretched American forces.\n;21 January – 31 March\nOperation Jeb Stuart was planned as an operation by the 1st Cavalry Division to attack PAVN base areas in I Corps, but instead saw the division supporting other Allied forces during the Tet Offensive.\n;21 January – 9 July\nThe long and bloody Battle of Khe Sanh began with an assault by the PAVN on Khe Sanh Combat Base in northwestern Quảng Trị Province. The combatants were elements of the U.S. III Marine Amphibious Force (III MAF) and the ARVN against two to three PAVN division-size elements. PAVN General Võ Nguyên Giáp later claimed that his objective was to create a diversion to draw U.S. forces away from the populated areas of South Vietnam. Khe Sanh diverted 30,000 US troops away from the cities that would be the main targets of the Tet Offensive. The USAF began Operation Niagara to provide continuous air support during the siege.\n;21 January - 23 November\nOperation Lancaster II a security operation to keep Route 9 open to Ca Lu Combat Base in northern Quảng Trị Province commences. By the end of the operation the Marines had lost 359 killed; PAVN fatalities were estimated to be in excess of 1,800.\n;23 January\nNorth Korean forces seize the .\n;23–4 January\nThe Battle of Ban Houei Sane began on the night of 23 January, when the 24th Regiment of the PAVN 304th Division overran the small Royal Lao Army (RLA) outpost at Ban Houei Sane. The PAVN lost 29 killed, while RLA losses are unknown. The RLA survivors fled across the border to Lang Vei Special Forces Camp.\n;23 January - 12 February\nOperation Coronado X conducted by the U.S. Mobile Riverine Force (MRF) and the ARVN, was originally planned as a sweep of western Dinh Tuong Province and eastern Kien Phong Province, however with the outbreak of the Tet Offensive on 31 January 1968 it instead became the MRF reaction to eject VC forces from Mỹ Tho and Vĩnh Long. The operation resulted in 269 VC killed for the loss of 12 U.S. killed.\n;24 January − 1 March\nOperation Coburg was an Australian military action that saw heavy fighting between the 1st Australian Task Force (1ATF) and PAVN and VC forces during the wider fighting around Long Binh and Biên Hòa.\n;26 January\nIn Time magazine, General Westmoreland said, \"the Communists seem to have run temporarily out of steam.\"\nTwo companies of the PAVN 408th Sapper Battalion attacked Camp Holloway destroying five UH-1 helicopters and an ammunition storage area.\n;28 January\nGeneral Westmoreland in his annual report said \"In many areas the enemy has been driven away from the population centers; in others he has been compelled to disperse and evade contact thus nullifying much of his potential.  The year ended with the enemy increasingly resorting to desperation tactics in attempting to achieve military/psychological victory; and he has experienced only failure in those attempts.\"\n;January – February 1973\nOperation Igloo White was a covert U.S. military electronic warfare operation carried out by the USAF 553d Reconnaissance Wing and the United States Navy VO-67 squadron to detect and interdict the Ho Chi Minh Trail.\nTet Offensive\n]]\n;29 January\nAt half-past midnight on Wednesday morning the PAVN launch the Tet Offensive at Nha Trang. At 2:45 that morning the US Embassy in Saigon is attacked, the VC fail to enter the Embassy building and 18 are killed and one captured, U.S. losses are five killed.\n;29–30 January\nThe VC fired rockets at Da Nang Air Base and then at 02:30 on 30 January they launched a sapper and mortar attack on the south of the base killing four Marines. At 03:30 a renewed rocket attack on the base began with 55 122&nbsp;mm rockets hitting within 20 minutes, killing three marines and wounding 11 and destroying five aircraft and damaging a further 14.\n;30 January-4 February\nThe PAVN 406th Sapper Battalion and a company from the VC 304th Local Force Battalion attacked Kontum Airfield but were forced back by U.S. helicopter gunships and armor. The PAVN renewed their attack but failed to penetrate the airfield defenses. On 31 January, Company D, 1st Battalion, 22nd Infantry Regiment was landed at the airfield and the next day two companies from the 1st Battalion, 12th Infantry Regiment were flown into the airfield securing its northern perimeter. By 4 February the city had been secured and normal operations resumed at the airfield.\n;30 January – 3 March\nThe Battle of Huế was one of the bloodiest and longest battles. The ARVN and three understrength U.S. Marine battalions attacked and defeated more than 10,000 entrenched PAVN/VC. The PAVN/VC lost 5,113 killed and 98 captured in the battle, the ARVN lost 452 killed and the U.S. 216 killed. 844 Civilians were killed in the fighting. In the Massacre at Huế the PAVN/VC massacred 2,800–6,000 civilians and prisoners of war during their occupation of the city. In the aftermath of the battle South Vietnamese forces killed an estimated 1,000-2,000 people suspected of being VC or VC sympathisers.\n;31 January\nIn the deadliest single day for U.S. forces during the war 246 Americans were killed.\n;31 January – 7 March\nThe PAVN/VC attacked major politico-military installations in and around Saigon. At Tan Son Nhut Air Base more than 670 PAVN are killed and 26 captured for the loss of 22 U.S. and 29 ARVN. In the attack on the Joint General Staff Compound 10 VC are killed and 10 captured for the loss of 17 U.S. killed. In the attacks on Bien Hoa Air Base and Long Binh Post 527 VC were killed and 47 captured for the loss of 11 U.S. killed. In the battle of Cholon 170 VC were killed for the loss of 12 U.S. killed.\nIn the attack on Quảng Trị the PAVN/VC lost 914 killed and 86 captured.\nA VC rocket and mortar attack on Chu Lai Air Base triggered an explosion in the bomb dump destroying three aircraft and damaging a further 23.\nThe VC attack on Quảng Ngãi Airfield and Quảng Ngai was repulsed at a cost of 56 ARVN and over 500 VC killed.\nThe VC attack on Vĩnh Long Airfield was repulsed at a cost of seven U.S. killed and three UH-1 helicopters destroyed.\nFebruary\nwith his picture of the Execution of Nguyễn Văn Lém.]]\n;1 February\nThe ARVN 3rd Armored Cavalry Squadron, fought a pitched battle with the VC H-15 Local Force Battalion near Pleiku. They were later awarded the United States Presidential Unit Citation for extraordinary heroism against hostile forces during the Tet Offensive, making them one of only a few non-U.S. military units to receive the highest U.S. military honor awarded at the unit level.\nSouth Vietnamese National Police chief General Nguyễn Ngọc Loan is captured on film executing a VC prisoner by American photographer Eddie Adams. The Pulitzer Prize-winning photograph becomes yet another rallying point for anti-war protesters.\nFormer U.S. Vice President Richard M. Nixon announced his candidacy for the Republican Party nomination for President of the United States.\n;2 February\nDeputy U.S. Secretary of Defense Paul H. Nitze inaugurated a program to curtail the growing use of marijuana among U.S. troops fighting in Vietnam.\n;5–17 February\nOperation Tran Hung Dao was the ARVN 1st, 3rd, 6th, 8th and 11th Airborne Brigades, VNMC 1st, 2nd, 3rd, 4th & 6th Brigades, 30th, 33rd, 35th, 38th & 41st Ranger Battalions, 3rd Battalion, 7th Infantry Regiment and 199th Infantry Brigade operation to defend the Saigon area during the Tet Offensive. The operation resulted in 953 PAVN/VC killed.\n;6–7 February\nThe Battle of Lang Vei was fought on the night of 6 February 1968, between elements of the PAVN, supported by PT-76 light tanks and the United States-led Detachment A-101, 5th Special Forces Group.\n;7 February\nInternational reporters arrive at the embattled city of Bến Tre in South Vietnam. Peter Arnett, then of the Associated Press, writes a dispatch quoting an unnamed US major as saying, \"It became necessary to destroy the town to save it.\"\nIn a telephone conversation with General Westmoreland, Chairman of the Joint Chiefs of Staff General Earle Wheeler advised that the U.S. government \"is not prepared to accept a defeat in South Vietnam... In summary... if you need more troops, ask for them.\"\n;8–9 February\nIn the Battle of Lo Giang the U.S. 1st Marine Division and elements of the U.S. 23rd Infantry Division defeated an attack by the PAVN 2nd Division on Da Nang Air Base. The battle resulted in 286 PAVN and 18 U.S. killed.\n;10 February – 10 March\nOperation Hop Tac I was a road security operation by the U.S. 9th Infantry Division along Route 4 in Dinh Tuong Province. The operation resulted in 345 VC and 92 U.S. killed.\n;12 February\nIn the Phong Nhị and Phong Nhất massacre the South Korean 2nd Marine Brigade killed 69–79 South Vietnamese civilians in Phong Nhị and Phong Nhất villages, Điện Bàn District.\n;12 February – 3 March\nOperation Coronado XI was conducted by the MRF and ARVN forces to secure Cần Thơ in the aftermath of the Tet Offensive. The operation resulted in 297 VC killed.\n;13 February\nA Gallup poll indicated that 50 percent of the American public disapproved of Johnson's handling of the war, 35 percent approved and the rest were undecided.\n;14-5 February\nThe 3rd Brigade, 82nd Airborne Division begins deploying to South Vietnam arriving at Chu Lai Base Area.\n;14–21 February\nThe 27th Marine Regiment landed at Da Nang.\n;16 February\nNorth Vietnam released three American prisoners of war, the first of nine, to the custody of peace activists Daniel Berrigan and Howard Zinn. As part of the propaganda event, the POWs each \"expressed their thanks to their captors for the humane and lenient treatment\" that they had received, and \"expressed remorse over the war\". All but one of the nine met the order of release approved by the senior ranking officers (SROs) in each POW camp (\"sick and injured first, then enlisted personnel and the remaining officers by order of shoot-down\". The exception would be a Navy seaman who was given permission by his superiors to accept release because he had memorized the names of all his fellow prisoners of war.\nThe Selective Service System revised its rules for deferments and exemptions from the draft, allowing the induction of most graduate students who were pursuing a master's degree, a decision that affected 600,000 men. Students in medical school, dental school, or other health field remained exempt, as did those in a theological seminary who planned on \"going into ministry\".\n;16 February to 1 March\nOperation Maeng Ho X was an ROK Capital Division search and destroy operation in Bình Định Province. The operation resulted in 664 PAVN/VC killed.\n;17 February to 28 March\nOperation Tran Hung Dao II was a continuation of Operation Tran Hung Dao I in the Saigon area with slightly reduced forces. The operation resulted in 713 PAVN/VC killed.\n;18 February\nA VC rocket and mortar attack on Tan Son Nhut Air Base destroyed 6 aircraft and damaged 33 others and killed one person.\nBetween 8,000 and 20,000 people attended an antiwar demonstration in West Berlin. The city government organised a similarly sized counter-demonstration.\n;19 February\nA VC rocket attack on Tan Son Nhut Air Base hit the civilian air terminal at Tan Son Nhut Airport killing one person and six further rocket/mortar attacks over this period killed another six people and wounded 151.\n;23-6 February\nGeneral Wheeler, Major General William E. DePuy and Philip Habib visited South Vietnam. During the visit Wheeler and Westmoreland prepared a reinforcement request for up to 205,000 additional troops to support all possible contingencies in Vietnam.\n;24 February\nA VC rocket and mortar attack on Tan Son Nhut Air Base killed four U.S. personnel and wounded 21 and damaged base buildings.\n;25 February\nThe Khmer Rouge launched their first widespread campaign, \"The Blow of 25 February\", with simultaneous attacks on military installations in Battambang, Takéo, Kampot, Koh Kong, Kompong Chhnang and Kompong Speu and seized rifles and machine guns.\nPAVN rocket and mortar fire hit Firebase Betty exploding an ammunition bunker and this was followed by a PAVN sapper attack. U.S. losses were three killed and 29 wounded and 21 PAVN killed and one captured.\n;26 February to 12 September\nOperation Houston, a security operation conducted by the U.S. Marines' Task Force X-Ray to reopen and secure Route 1 between Da Nang and Phu Bai Combat Base, results in 702 PAVN/VC killed and 29 captured for the loss of 117 U.S. killed.\n;27 February\nWalter Cronkite, reporting after his recent trip to Vietnam for his television special \"Who, What, When, Where, Why?\" gives a highly critical editorial and urges America to leave Vietnam \"...not as victors, but as an honorable people who lived up to their pledge to defend democracy, and did the best they could.\"\n;28 February\nGeneral Wheeler briefed President Johnson and his national security team. Wheeler gave the impression that General Westmoreland needed the entire 205,000 troops simply to repel another PAVN/VC offensive and\nregain lost ground in South Vietnam. Wheeler portrayed the Tet Offensive as coming close to success in many places, with the Allies' victory margin \"very very small indeed.\" He predicted that the PAVN/VC would renew the attack with even greater force. The South Vietnamese forces had held together under the first assault and recouped many of their losses. However, their staying power against a renewed offensive was uncertain. Westmoreland's US forces were in good shape and fighting well, but they were stretched thin and \"he does not have a theater reserve.\" Under these circumstances, \"If the enemy synchronizes his\nexpected major attacks with increased pressure throughout the country, General Westmoreland's margin will be paper thin.\" The only alternative to the requested reinforcements, would be a decision \"to be prepared to give up areas in lieu of more troops,\" specifically \"the 2 northern provinces of South Vietnam.\" Wheeler's report was a staggering blow to a politically beleaguered administration already shaken by Tet. Johnson and his advisers were dismayed by Wheeler's gloomy assessment of the Vietnam situation, which was in sharp contrast to the more reassuring reports they had been receiving from Westmoreland and Ambassador Bunker. In response Johnson appointed a task force, headed by incoming Secretary of Defense Clark Clifford, to examine afresh the reinforcement and mobilization issue as part of a major review of Vietnam policy and strategy\nMarch\n;March – November 1968\nProject Combat Lancer was the combat testing of six USAF F-111A  swing-wing fighter-bombers. F-111A #66-0022 disappeared on 28 March, #66-0017 disappeared on 30 March and #66-0024 crashed on 22 April and this halted combat operations and all aircraft were returned to the U.S. in November.\n;1 March\nThree North Vietnamese fishing trawlers were destroyed by the U.S. Navy and South Vietnamese forces while attempting to resupply the VC and a fourth was turned back as part of Operation Market Time. Because the fourth trawler got more than  away from the coast and reached international waters, the U.S. Navy was forbidden from firing on the ship.\n;1–30 March\nOperation Patrick was a security operation conducted by the U.S. 3rd Brigade, 4th Infantry Division in Bình Định Province. The operation resulted in 70 PAVN killed.\n;2 March\nWhile patrolling  north of Tan Son Nhut Air Base near the small village of Quoi Xuan to locate VC rocket sites, Company C, 4th Battalion, 9th Infantry Regiment walked into an ambush losing 48 killed in just 8 minutes. U.S. forces claimed they killed 20 VC.\n;3–6 March\nIn the Battle of Tam Kỳ the 1st Squadron, 1st Cavalry Regiment and Company A, 3rd Battalion, 23rd Infantry Regiment engaged the PAVN 3rd Regiment, 3rd Division The battle resulted in 436 PAVN killed.\n;4 March\nA USAF C-123 was shot down by PAVN anti-aircraft fire near Khe Sanh killing all 44 persons on board.\nThe \"Clifford Committee\" proposed the immediate deployment of about 22,000 reinforcements to South Vietnam, which could be done from existing resources. A decision on deploying the rest of the 205,000 should be deferred, contingent upon a \"week-by-week\" review of the situation in South Vietnam, effectively killing the request.\n;6–10 March\nOperation Rock was a 3rd Battalion, 7th Marines sweep on the peninsula formed by the Vu Gia and Thu Bồn Rivers, the so-called \"Arizona Territory\" northwest of An Hoa Combat Base. the operation resulted in 35 PAVN and three Marines killed.\n;7 March – 7 August\nOperation Truong Cong Dinh was a security operation to reestablish South Vietnamese control over the northern Mekong Delta conducted by the U.S. 9th Infantry Division, the MRF and the ARVN 7th Division. The operation resulted in 343 VC and 51 U.S. killed.\n;10 March\nSigned by President Ho Chi Minh four months earlier, a decree took effect in North Vietnam outlawing local opposition to the nation's conduct of the war. A long list of \"counterrevolutionary\" crimes was subject to punishments ranging from brief detention, to life in prison or the death penalty.\nThe New York Times published details of the 205,000-man reinforcement request and Johnson administration policy debates denouncing the proposal as \"suicidal escalation\" and called for abandonment of this \"bankrupt policy.\" In the Senate, Democrats and Republicans alike condemned the troop request as a disastrous and futile escalation of the war.\n;10–11 March\nThe Battle of Lima Site 85 was a battle for control of a secret radar site at Phou Pha Thi, Laos. The U.S. lost 13 killed and the RLA and Thai forces lost 42 killed, PAVN losses are unknown.\n;11 March - 7 April\nOperation Quyet Thang was a U.S./ARVN security operation to reestablish South Vietnamese control over the areas immediately around Saigon in the aftermath of the Tet Offensive. 2,658 VC were killed and 427 captured.\n;12 March\nPresident Johnson barely edged out antiwar candidate Eugene McCarthy in the New Hampshire Democratic primary, the opening event in nominations for the 1968 U.S. presidential election. The vote highlighted deep divisions in the country, and the party, over the war, and would demonstrate Johnson's increasing unpopularity. Johnson received 49.6% of the votes cast, but McCarthy who had campaigned on a platform of ending U.S. involvement in Vietnam got 41.9% despite being relatively unknown outside of his home state.\n;12–26 March\nOperation Worth was a 1st Battalion, 7th Marines, 2nd Battalion, 7th Marines and 3rd Squadron, 5th Cavalry Regiment search and destroy operation 24&nbsp;km northwest of Da Nang. The operation resulted in 160 PAVN and 27 U.S. killed.\n;14 March\nAfter a run on gold buying in Europe, the London gold market closes at the request of the U.S. The U.S. Federal Reserve raises the discount rate to 5% to strengthen the United States dollar and reduce inflation.\n;14–20 March\nOperation Ford was a 2nd Battalion, 3rd Marines and 1st Battalion, 1st Marines sweep of the Phu Thu Peninsula east of Phu Bai Combat Base to engage the VC 804th Main Force Battalion. The operation resulted in 145 VC and 14 Marines killed.\n;16 March\nUS troops from C Company, 1st Battalion, 20th Infantry Regiment, 11th Brigade and B Company, 4th Battalion, 3rd Infantry Regiment, 23rd Infantry Division carry out the My Lai Massacre killing more than 500 Vietnamese civilians from infants to the elderly. The event would remain concealed for more than a year.\n;17 March\nAn antiwar demonstration outside the U.S. Embassy in London's Grosvenor Square turned violent; 91 people were injured and 200 demonstrators arrested.\n;17 March to 30 July\nOperation Duong Cua Dan/Operation People's Road was a U.S. 9th Infantry Division security operation for repair of Route 4 between Cat Lay and Mỹ Tho. The operation resulted in 1,357 PAVN/VC and 93 U.S. killed.\n;17 March to 31 January 1969\nOperation Walker was a security operation conducted by the U.S. 1st Battalion, 503rd Infantry Regiment, 173rd Airborne Brigade in Bình Định Province. The operation resulted in 272 PAVN/VC and 42 U.S. killed.\n;18 March – 17 May\nOperation Carentan and Operation Carentan II were security operations conducted by the U.S. 1st and 2nd Brigades, 101st Airborne Division and the 3rd Brigade, 82nd Airborne Division in Thừa Thiên Province. The operations resulted in 2,320 PAVN and 214 U.S. killed.\n;24 March\nGenerals Westmoreland and Wheeler met at Clark Air Base in the Philippines. Wheeler advised Westmoreland that a major reinforcement and expansion of ground operations were out of the question. Westmoreland advised that in the light of the improved situation after the defeat of the Tet Offensive and the strong showing of the South Vietnamese forces, further reinforcements beyond those already committed would not be required.\n;25 March\nA Harris Poll found that 60% of Americans regarded the Tet Offensive as a defeat of U.S. objectives and basic support for the war had dropped from 74 to 54 percent.\n;26 March\nPresident Johnson met with his group of advisers, led by Secretary of State Dean Rusk and Secretary of Defense Clifford, who had come to be known as \"The Wise Men\".  After long supporting and encouraging Johnson's conduct of the war, a majority of the group informed him that \"an American military solution in Vietnam was no longer attainable\" and that he should take steps to disengage the U.S. from further participation. Another author would note that former Secretary of State Dean Acheson told Johnson \"the financial and social costs of the struggle... would be hard for the United States to sustain\" and noted that \"The Wise Men's conclusion that the United States had to find a new way out of Vietnam rocked Johnson as nothing else had.\"\nThe PAVN 7th Battalion, 209th Regiment attacked Firebase 14 on Hill 995  west of Kontum defended by units of the 4th Brigade, 4th Infantry Division. The PAVN lost 135 killed and the U.S. 19 killed.\n;30 March\nA Gallup Poll shows that 63% of Americans disapprove of Johnson's handling of the war.\n;30 March – 31 January 1969\nOperation Cochise Green was a security and pacification operation conducted by the 173rd Airborne Brigade in Bình Định Province. The operation resulted in 929 PAVN/VC killed and 25 captured and 114 U.S. killed.\n;31 March\nPresident Johnson addresses the nation, announcing steps to limit the war in Vietnam and reporting his decision not to seek reelection. The speech announces the first in a series of limitations on US bombing, promising to halt these activities above the 20th parallel north.\nSecretary of Defense Clark Clifford gets the President to authorize 24,500 more troops on an emergency basis, raising authorized strength to the Vietnam War's peak of 549,500, a figure never reached.\nApril\n;1 April\nU.S. aircraft ceased attacking North Vietnam north of the 20th parallel, an area which included Hanoi and Haiphong. Missions would continue for the remainder of the country, between the 17th parallel and 20th parallel.\n;1–14 April\nIn Operation Pegasus the 1st Cavalry Division relieved the Marines at Khe Sanh.\n;2 April\nNorth Vietnam's official government radio station broadcast that \"The North Vietnamese government declares its readiness to send its representatives to make contact with U.S. representatives to decide with the U.S. side the unconditional cessation of bombing and all other war acts... so that talks could begin.\"\n;8 April\nCaptain Max Cleland serving with the 2nd Battalion, 12th Cavalry Regiment was seriously wounded by a grenade blast near Khe Sanh losing both legs and his right forearm.\n;8–19 April\nOperation Norfolk Victory was a 1st Battalion, 20th Infantry Regiment clear and search operation in Nghĩa Hành District, Quảng Ngãi Province. the operation resulted in 43 PAVN/VC and five U.S. killed.\n;8 April to 31 May\nOperation Toan Thang I was a US and ARVN operation conducted between 8 April 1968 and 31 May 1968. Toan Thang, or \"Complete Victory\", was part of a reaction to the Tet Offensive designed to put pressure on the PAVN/VC. The PAVN/VC lost 7,645 killed and 1,708 captured for the loss of 762 ARVN and 564 U.S. killed.\n;8 April to 11 November\nOperation Burlington Trail was a security operation conducted by the U.S. 198th Infantry Brigade in Quảng Nam Province. The operation resulted in 1,931 VC and 129 U.S. killed.\n;10 April\nA 250-man PAVN force attempted to block Route 19 west of Landing Zone Schueller. A reaction force from the 1st Battalion, 69th Armor Regiment at Schueller was called forward and quickly overwhelmed the PAVN ambushers some of whom retreated to a nearby hill where they were assaulted by the 1st Battalion, 503rd Infantry Regiment. The engagement resulted in 1 U.S. and 40 PAVN killed.\nThe Anderson Platoon won the 1967 Academy Award for Best Documentary Feature. The film by Pierre Schoendoerffer followed a platoon of the 1st Cavalry Division in September and October 1966.\n;10-4 April\nOperation Jasper Square was a 3rd Battalion, 7th Marines operation on Go Noi Island, Quảng Nam Province. The operation resulted in 54 PAVN/VC and six Marines killed.\n;13 April\nIn an unnamed operation east of Huế, the 1st Battalion, 27th Marines killed 60 PAVN/VC for the loss of 24 Marines.\n;15 April – 28 February 1969\nFollowing the relief of Khe Sanh the 3rd Marine Division began Operation Scotland II in the area round Khe Sanh. The operation continued until February 28, 1969, and results in 3,304 PAVN killed and 435 Marines killed.\n;19-26 April\nOperation Baxter Garden was a harvest security operation on the Phu Thu peninsula by the 2nd Battalion, 5th Marines supported by two ARVN battalions. The operation resulted in 55 PAVN/VC and 13 Marines killed.\n;19 April – 17 May\nOperation Delaware was a military operation in the A Shau Valley, an important PAVN logistics corridor and base area. American and South Vietnamese had not been present in the area since the Battle of A Shau, when a Special Forces camp located there was overrun. The PAVN lost 869 killed while the U.S. lost 142 killed and 47 missing and the ARVN lost 26 killed.\n;24 April\nThe positions of the 1st Battalion, 26th Marines at Wunder Beach were mistakenly hit by 11–15 rounds of 5\" naval gunfire from  killing two Marines.\n;27 April\nU.S. Vice President Hubert Humphrey formally announced that he would seek the Democratic Party nomination to run for President of the United States.\n;30 April – 3 May\nIn the Battle of Dai Do the 2nd Battalion, 4th Marines and the 1st Battalion, 3rd Marines, fight a pitched, hand-to-hand battle with two full-strength battalions of the PAVN 320th Division. The Marines suffer 50% casualties with 81 killed, while the PAVN lose more than 600 men killed. \"E\" Co & \"F\" Co Commanders are each awarded the Medal of Honor, while 2/4th Marines Commander, Lieutenant Colonel Weise is awarded the Navy Cross.\nMay\n;1 May – 20 November\nOperation Kudzu was a 9th Infantry Division reconnaissance and security operation around Đồng Tâm Base Camp. The operation resulted in 187 PAVN/VC killed and 41 captured and 28 U.S. killed.\n;3 May\nThe U.S. and North Vietnam agreed that their representatives would meet in Paris on 10 May to begin the first discussions on the format for peace talks to end the war.\n;3–10 May\nIn the deadliest week of the war for American forces, 562 U.S. troops are killed.\n;4 May – 24 August\nOperation Allen Brook was a 1st Marine Division security and pacification operation on Go Noi Island. The operation resulted in 917 PAVN/VC killed and 11 captured and 172 Marines killed.\n;5 May\nMay Offensive was launched in the early morning hours of 4 May, in which PAVN/VC units initiated PHASE II of the Tet Offensive of 1968 (also known as the May Offensive, \"Little Tet\", and \"Mini-Tet\") by striking 119 targets throughout South Vietnam, including Saigon. The PAVN/VC lost over 24,000 killed and 2,000 captured while the U.S. lost 2,169 killed and the ARVN lost 2,054 killed. The offensive caused extensive destruction in west and south Saigon.\nAfter midnight the PAVN/VC shelled Bien Hoa Air Base for 3 hours and then shelled it again at dawn, wounding 11 USAF personnel and damaging 13 aircraft, 5 trucks and 3 50,000-gallon rubber fuel bladders.\nLanding Zone Peanuts located approximately 5&nbsp;km southwest of Khe Sanh Combat Base  and occupied by Companies A and B, 1st Battalion, 5th Cavalry Regiment and Company A, 1st Battalion, 77th Artillery Regiment was hit by 120&nbsp;mm mortar rounds and B-40 rockets followed by a PAVN sapper attack. The attack was repulsed with 11 U.S. and 32 PAVN killed.\n;5–25 May\nIn the Battle of Landing Zone Center the PAVN lost 365 killed in its attacks on a U.S. base in Quảng Tín Province.\n;6 May\nUnited Press International photographer Toshio Sakai wins the Pulitzer Prize for Feature Photography for his photo \"Dreams of Better Times\".\n;9–16 May\nOperation Concordia Square/Lam Son 224 was a 2nd Brigade, 1st Cavalry Division operation in Quảng Trị Province. The operation resulted in 349 PAVN and 19 U.S. killed.\n;10 May\nRepresentatives of the U.S. and North Vietnam met at Paris for the first time to discuss peace talks and agreed that discussions would take place at the International Conference Center of the French Foreign Ministry, located in the former Hotel Majestic. W. Averell Harriman led the American delegation with the assistance of Cyrus Vance, and former North Vietnamese foreign minister Xuan Thuy was assisted by Colonel Ha Van Lau.\n;10–12 May\n]]\nThe Battle of Kham Duc was the struggle for the United States Army Special Forces camp located in Quảng Tín Province. The camp was occupied by the 1st Special Forces detachment consisting of U.S. and South Vietnamese special forces, as well as Montagnard irregulars. A USAF C-130B was shot down after takeoff from the base killing all 155 on board.\n;12 May – 6 June\nThe Battle of Coral–Balmoral was a series of actions fought between 1 ATF and PAVN/VC forces, north-east of Saigon. The battle resulted in 267 PAVN/VC killed and 11 captured and 25 Australians killed.\n;13 May\nThe first US and North Vietnamese delegations meet at the Paris peace talks to discuss American withdrawal.\n;13/4 May\nThe U.S. radio relay station on Nui Ba Den was attacked and overrun by the VC before they were driven off by helicopter gunship and artillery fire. The attack killed 24 U.S. and 25 VC.\n;17 May\nA group of anti-war demonstrators, later dubbed the Catonsville Nine, entered the Selective Service offices in Catonsville, Maryland, took draft records, and burned them with homemade napalm.\n;17 May – 3 November\nOperation Jeb Stuart III was conducted by the U.S. 1st Cavalry Division to attack PAVN base areas in Quảng Trị and Thừa Thiên Provinces. The operation resulted in 2,014 PAVN killed and 251 captured and 222 U.S. killed.\n;17 May – 28 February 1969\nOperation Nevada Eagle was a security operation conducted by the 101st Airborne Division and 3rd Brigade, 82nd Airborne Division in Thừa Thiên Province. The operation resulted in 3,299 PAVN killed and 853 captured and U.S. 175 killed.\n;18 May\nNguyen Van Loc resigned as Prime Minister of South Vietnam, along with his entire cabinet.\n;19 May – 23 October\nOperation Mameluke Thrust was a 1st Marine Division spoiling attack into the valleys west of Danang and around Thường Ðức Camp. The operation resulted in 2,728 PAVN killed and 47 captured and U.S. losses of 269 killed.\n;23 May\nThe U.S. Navy guided-missile cruiser , operating off of the coast of North Vietnam shot down a Vietnam People's Air Force (VPAF) jet fighter with a RIM-8 Talos missile fired from a distance of  making it the first combat kill by a naval surface to air missile.\n;24 May to 12 June\nOperation Mathews was a 1st Brigade, 4th Infantry Division and 3rd Brigade, 101st Airborne Division search and destroy operation in Kon Tum Province. The operation resulted in 352 PAVN and 69 U.S. killed.\n;25 May to 10 June\nThe second phase of the May Offensive attacks on Saigon began. The VC lost an estimated 600 killed and another 107 captured in the attacks, while the South Vietnamese lost 42 killed.\n;26–30 May\nSustained PAVN mortar and rocket fire hits U.S. 1st Battalion, 14th Infantry Regiment at Landing Zone Brillo Pad followed by a ground assault which results in U.S. and 41 PAVN killed.\n;27 May\nTrần Văn Hương, a former schoolteacher, was sworn in as the new Prime Minister of South Vietnam.\n;29 May\nA VC unit stopped all traffic on Route 155 in Vĩnh Bình Province; 50 civilians were kidnapped, including a Protestant minister; two buses and 28 three-wheeled taxis were burned.\n;May to August\nThe USAF 8th Tactical Fighter Wing conducted combat evaluations of the first generation of Laser-guided bombs: the BOLT-117 and the Paveway 1. The first combat drop was made using BOLT-117s on 23 May. The Paveway-1 was found to be superior achieving a circular error probability of  with one in every four bombs scoring a direct hit.\nJune\n;1 June - 16 February 1969\nOperation Toan Thang II was designed to keep pressure on PAVN/VC forces in III Corps, the PAVN/VC lost 25,428 killed and 10,724 captured while the U.S. lost 1,798 killed.\n;2 June\nA gunship from the 120th Assault Helicopter Company fired a 2.75-inch rocket that struck a building that contained the forward command post of the ARVN 30th Ranger Battalion. The blast killed 6 high-ranking South Vietnamese officials allied to Prime Minister Kỳ, including Saigon Police chief Lieutenant Colonel Nguyen Van Luan.\n;2–19 June\nOperation Robin was a 3rd Marine Division operation into the \"Vietnam Salient\" of Quảng Trị Province. The operation resulted in 635 PAVN killed and 48 captured and Marine losses of 65+ killed.\n;10 June\nGeneral Creighton Abrams assumes command of MACV from General Westmoreland who is promoted to Chief of Staff of the United States Army.\nSouth Vietnamese Minister of Information Tôn Thất Thiện described the impact of the U.S. presence on South Vietnamese life as \"devastating\" and \"disintegrating.\"\n;12 June\nA VC rocket and mortar attack on Tan Son Nhut Air Base destroyed two aircraft and killed one USAF airman.\n;16-7 June\nUSAF jets mistakenly sank PCF-19 killing five U.S. Navy crewmen and attacked the ,  and  near Tiger Island killing two Royal Australian Navy crewmen.\n;18 June\nThe South Vietnamese military mobilization law was promulgated. The law lowered the military draft age from 20 to 18 and allowed the government to conscript males between the ages of 18 and 38 for service in either the ARVN or the territorial Regional Force and Popular Forces. The term of service was made indefinite, or as long as the war lasted. In addition, the legislation specified that youths of 17 and men between the ages of 39 and 43 could be conscripted for noncombat military service, and all other males between 16 and 50 were to serve in a new paramilitary organization, the People's Self-Defense Force, a part-time hamlet militia.\n152 members of the VC Quyet Thang Regiment surrendered to ARVN forces, the largest communist surrender of the war.\n;21 June\nU.S. Secretary of State Rusk stated that nearly three months after the U.S. had limited its bombing to below the 17th parallel, infiltration by PAVN troops into South Vietnam had increased to record levels and North Vietnam had started a campaign of indiscriminate rocket attacks into residential areas of Saigon.\n;22 June\nIn a complete reversal from previous statements, North Vietnam (through their representative in Budapest) admitted that it had troops stationed and fighting in South Vietnam.\n;27-8 June\nIn the Battle of Binh An the U.S. 3rd Squadron, 5th Cavalry Regiment and Troop D, 1st Squadron, 9th Cavalry Regiment defeated the PAVN K14 Battalion, 812th Regiment. The battle resulted in 233 PAVN killed and 44 captured and three U.S. killed.\n;28-9 June\nThe VC kill 88 South Vietnamese civilians in Sơn Trà village, Bình Sơn District, Quảng Ngãi Province.\nJuly\n;1 July\nThe Phoenix Program to identify and neutralize the VC infrastructure, was launched by the CIA and South Vietnamese agencies.\n;1-8 July\nOperation Thor was a U.S. combined arms operation against PAVN positions around, Mũi Lay, North Vietnam. The operation resulted in 125 PAVN killed and 500+ targets destroyed and U.S. losses of one killed and three aircraft shot down.\n;4 July\nA PAVN rocket and mortar attack followed by ground probes against Dầu Tiếng Base Camp resulted in five U.S. and 16 PAVN killed.\n;6 July\nThe first OV-10 Broncos arrive at Marble Mountain Air Facility for service with VMO-2.\n;6–31 July\nOperation Pocahontas Forest was a security operation conducted by the U.S. 23rd Infantry Division and the ARVN 2nd Division in the Quế Sơn Valley. The operation resulted in 127 PAVN and 18 U.S. killed.\n;14–18 July\nClifford visited South Vietnam.\n;17 July\nA U.S. Army Landing Craft Utility (LCU) and its crew of 11 Americans and one South Vietnamese, was seized by Cambodia after veering into the Cambodian side of the Mekong River that marked its border with South Vietnam. Cambodia's leader Prince Norodom Sihanouk, demanded a ransom of 12 bulldozers or tractors for return of the LCU and its men, and refused an American apology. Although treated well during their captivity, the Americans would not be released until December 20.\n;18–20 July\nJohnson met Thiệu in Honolulu and reaffirmed the U.S. commitment to defend South Vietnam. Thiệu stated that the South Vietnamese would \"continue to assume all the responsibility that the scale of forces of South Vietnam and their equipment will permit.\"\n;22 July\nIn a briefing with his staff after a visit to South Vietnam, Secretary Clifford stated that: \"[We] must get out of there.\" and that \"No way can we terminate the war militarily.\" He expressed suspicion that the South Vietnamese government \"doesn't want war to stop now\" as long as the money kept flowing. \"Corruption runs through everything.\" He saw a need to \"convey to our representatives in Saigon they [are] seeing it too narrowly, from GVN pt. of view\" and that they should \"look at it from interest of U.S.\"\n;22–31 July\nThe 1st Brigade, 5th Infantry Division (Mechanized) deployed to South Vietnam.\n;23 July\nUSAF Major General Robert F. Worley was killed when his RF-4C Phantom was hit by ground fire and crashed approximately  northwest of Da Nang Air Base.\n;26 July\nTrương Đình Dzu an unsuccessful candidate in the 1967 Presidential election was sentenced to five years imprisonment by a Special Military Court for proposing the formation of a coalition government to end the war.\n;28 July\nFour VC detonated a 60-pound plastique charge in city room of Chợ Lớn Daily News, the most prominent of city's seven Chinese language newspapers, after ordering workers out of building; the four escaped before police arrived.\n;29 July\nA VC sapper attack on Tuy Hoa Air Base destroyed two C-130s and damaged a further five C-130s, one F-100 and one C-47.\n;31 July\nAdmiral John S. McCain Jr. became Commander-in-Chief, Pacific Command (CINCPAC) replacing Admiral U. S. Grant Sharp Jr., his son John S. McCain III, a naval aviator was a prisoner in North Vietnam having been shot down on 26 October 1967.\nAugust\n;2 August – 24 April 1969\nOperation Lam Son 245 was a security operation by the ARVN 54th Regiment, 1st Division in Thừa Thiên Province. The operation resulted in 636 PAVN/VC killed.\n;3 August – 30 November\nOperation Quyet Chien was a security operation by U.S. 9th Infantry Division, MRF and the ARVN 7th Division in the Mekong Delta. The operation resulted in 1,571 VC killed and 94 U.S. killed and ten missing.\n;4–20 August\nOperation Somerset Plain was a 1st Brigade, 101st Airborne Division and ARVN 1st Division operation in the A Sầu Valley. The operation resulted in 181 PAVN killed and four captured and seven U.S. and 11 ARVN killed.\n;5–8 August\nThe 1968 Republican National Convention took place in Miami Beach, Florida. Richard Nixon and Spiro T. Agnew were selected as the party's candidates for the Presidential Election. Nixon pledged to \"bring an honorable end to the war in Vietnam\" and to restore \"the strength of America so that we shall always negotiate from strength and never from weakness.\"\n;10 August\nA USAF F-100 Super Sabre accidentally hit Company D, 2nd Battalion, 327th Infantry Regiment in the A Sầu Valley, killing seven and wounding fifty-four men.\n;15 August\nXXIV Corps was activated to control the activities of U.S. Army ground combat units deployed in I Corps.\n;17 August to 27 September\nThe Phase III Offensive — also known as the \"August Offensive\" or the \"Third Offensive\", was launched by the PAVN/VC. The Offensive followed from the May Offensive and had the similar aim of diverting U.S. forces from urban areas through attacking multiple border towns simultaneously. The operation was a failure; American forces pre-emptively stopped an assault on Danang, and some other attacks failed to materialize. PAVN/VC losses exceed 29,000 and 1,0936 civilians are killed.\n;19 August\nIn a speech to the Veterans of Foreign Wars convention, Johnson called on North Vietnam to respond to his 31 March limitation of bombing. He also said that \"there are some among us who appear to be searching for a formula which would get us out of Vietnam and Asia on any terms , leaving the people of South Vietnam, Laos and Thailand... to an uncertain fate.\"\nA Harris Poll showed that 61% of Americans opposed a bombing halt.\n;22 August\nA PAVN/VC rocket attack on Saigon killed 18 and wounded 59.\n;22–3 August\nA company from the VC R20 Battalion and a sapper platoon infiltrated Forward Operating Base 4, killing 17 Special Forces soldiers (their largest one-day loss of the war) and wounding another 125 Allied soldiers. Thirty-two VC were killed.\n;23–4 August\nU.S. forces captured a PAVN regimental headquarters  south of Huế, killing 176 PAVN, many youths only 15–17 years old, for the loss of seven U.S. killed. Seven anti-aircraft guns and 435 individual weapons were captured.\n;23-5 August\nThe PAVN 95C Regiment attempted to overrun Duc Lap Camp. The assault was defeated at a cost of six U.S., one ARVN, 37 CIDG, 20 civilians and over 303 PAVN killed.\nThe Rolling Stones released Street Fighting Man, their most political song to date, inspired in part by the Grosvenor Square demonstration on 17 March which Mick Jagger had attended.\n;24 August – 9 September\nOperation Tien Ho was a security operation in Quang Duc Province conducted by the ARVN 23rd Division. The operation resulted in 1,091 PAVN/VC casualties.\n;28 August\nU.S. Vice President Humphrey was nominated as the Democratic Party's candidate for president on the first ballot at the 1968 Democratic National Convention in Chicago. Afterward, after different speakers at Chicago's Grant Park addressed a crowd of 15,000 antiwar protesters, a crowd of about 1,500 people marched along Michigan Avenue toward the convention site at the International Amphitheatre where the convention was taking place, protesting Humphrey's nomination. The Chicago police confronted and attacked the protesters with billy clubs and tear gas at various places between the park and the convention center as violence reached its peak. As one historian would note later, \"Millions of Americans turned on their televisions expecting to see Hubert Humphrey win the Democratic presidential nomination,\" but saw the networks cut away to live coverage of the riots; recognizing what was happening, the protesters began to chant \"The whole world is watching!\".\n;29 August - 7 September\nAfrican-American inmates rioted at the Long Bình Jail, the military prison for U.S. servicemen near Saigon. The uprising would last for 9 days; one inmate was killed and 52 inmates and 63 military policemen were injured and numerous buildings burnt down.\n;30 August – 2 September\nThe PAVN captured Hà Thanh Special Forces camp  west of Quảng Ngai with 12 PAVN and four U.S. killed. Allied forces would recapture the camp on 2 September.\nSeptember\n;4–24 September\nOperation Champaign Grove was a security operation conducted by elements of the 11th Infantry Brigade in Quảng Ngãi Province. The operation resulted in 378 PAVN/VC and 41 U.S. killed.\n;5–7 September\nTyphoon Bess hit I Corps causing most Allied operations to be suspended and inflicting major damage on civilian homes and rice crops.\n;8 September\nU.S. negotiator W. Averell Harriman had his first private meeting with Le Duc Tho in the Paris suburb of Vitry-sur-Seine.\nBrigadier General Trương Quang Ân, commander of the 23rd Division was the first ARVN general killed in action when his helicopter crashed near Duc Lap Camp. Also killed were his wife and an adviser and three U.S. crewmen.\n;10 September\nHarvard University professor Henry Kissinger began a relationship with Republican presidential nominee Richard Nixon with a telephone call to the Nixon campaign's foreign policy adviser, Richard V. Allen, offering his services that would lead to Kissinger's appointment as Nixon's National Security Adviser and, later, as the U.S. Secretary of State. Allen recounted later that Kissinger said that he had many friends who were involved in the Paris Peace Talks on behalf of President Johnson, and began providing the Nixon campaign with classified information from the talks. In 2016, notes from another Nixon adviser, H. R. Haldeman, would confirm suspicion that Nixon had used Kissinger's information to sabotage the peace talks in the days before the election.\nIn a speech before the American Legion, Johnson stated that Abrams had advised that a U.S. bombing halt without reciprocal North Vietnamese de-escalation would result in increased U.S. losses.\n;10–29 September\nOperation Vinh Loc was a security operation conducted by the 2nd Brigade, 101st Airborne Division and ARVN 54th Regiment on Vinh Loc Island, Phú Vang District. The operation resulted in 154 VC killed, 370 captured and 56 Chieu Hoi. U.S. losses were two killed.\n;11 September\nChairman of the Joint Chiefs of Staff General Wheeler advised President Johnson not to halt bombing of North Vietnam.\n;11 September – 24 April 1969\nOperation Lam Son 261 was conducted by the ARVN 1st Division in Quảng Trị and Thừa Thiên Provinces. The operation resulted in 724 PAVN/VC killed.\n;12 September\nA VC report (captured in Bình Dương Province) from the Châu Thành District Security Section to the provincial Party Central Committee stated that seven prisoners in the district's custody were shot prior to an expected Allied sweep operation, the report read: \"we killed them to make possible our safe escape.\"\n;13 September\n1st Infantry Division commander Major General Keith L. Ware and seven others are killed when their helicopter is shot down near Lộc Ninh.\n;25 September\nThe VC attacked Katum Camp but the attack was repulsed at a cost of 14 CIDG killed and 61 VC killed and 10 captured.\n;26 September\nIn his annual report, the UN Secretary General U Thant stated that the war was a nationalist struggle and that the major powers should \"let the Vietnamese themselves deal with their own problems.\"\n;28–30 September\nIn the Battle of Thượng Đức the PAVN 2nd Division attempted to overrun Thường Ðức Camp. The attack was repulsed and 70+ PAVN killed.\n;30 September\nTrailing Richard Nixon in presidential preference polls, Democratic Party candidate and U.S. Vice President Hubert H. Humphrey made the decision to come out against U.S. President Johnson's policy on the war, delivering a speech pledging that if elected, he would halt U.S. bombing of North Vietnam unconditionally. He further stated that he would support the resumption of bombing if the North Vietnamese \"were to show bad faith\".\n;30 September – 1 April 1969\nThe battleship  joined the gunline off the coast of South Vietnam initially providing naval gunfire support against PAVN targets in and near the DMZ.\nOctober\n;1–19 October\nOperation Maui Peak was a 1st Marine Division operation near Thường Ðức Camp to keep pressure on the PAVN 2nd Division. The operation resulted in 202 PAVN and 28 Marines killed.\n;3 October\nU.S. presidential candidate George C. Wallace, who was running as the American Independent Party selection against Republican Richard Nixon and Democrat Hubert  Humphrey, introduced his running mate, retired USAF General Curtis E. LeMay. LeMay told a press conference that although he didn't believe that nuclear weapons would be necessary in the Vietnam War, he wouldn't be opposed to their use. \"It doesn't make any difference to the soldier whether he is killed by a rusty knife or a nuclear explosion,\" LeMay commented, adding, \"In fact, I'd lean toward the nuclear weapon.\"\nA USAF C-7 Caribou (#63-9753) that had just taken off from the Camp Evans airstrip collided with a 1st Cavalry Boeing CH-47 Chinook (#66-19041) resulting in the death of all 24 passengers and crew on both aircraft.\n;8 October\nOperation Sealords was launched to disrupt PAVN/VC supply lines in and around the Mekong Delta. As a two-year operation, by 1971 all aspects of Sealords had been turned over to the Republic of Vietnam Navy.\n;12 October\nFormer Johnson Administration national security adviser McGeorge Bundy called for a bombing halt and substantial U.S. troop reductions.\n;14 October\nThe Defense Department announced that up to 16,000 Army and 6,000 Marine career officers and NCOs would be sent back to South Vietnam for involuntary second tours due to a shortage of experienced personnel.\n;16 October\nIn a telephone conference call with all three of the major U.S. presidential candidates, President Johnson informed them that he had no plans to change the U.S. bombing of North Vietnam.\n;16 October – 24 April 1969\nOperation Lam Son 271 was conducted by the ARVN, 2nd Regiment, 1st Division in Quảng Trị Province. The operation resulted in 603 PAVN/VC killed.\n;20 October\nA USAF C-47D crashed 32&nbsp;km south of Buôn Ma Thuột killing all 23 on board.\n;22 October\nRepublican presidential candidate Richard Nixon instructed H. R. Haldeman to get intermediaries to persuade South Vietnamese President Thiệu to refuse to participate in the Paris Peace Talks to end the war. Efforts by private citizens to \"defeat the measures of United States\" were a federal crime, but this interference remained secret for 48 years.\n;23-7 October\nOperation Rich was a 1st Brigade, 5th Infantry Division (Mechanized) combined arms assault near the Bến Hải River. The operation resulted in 308 PAVN and eight U.S. killed.\n;23 October to 6 December\nOperation Henderson Hill was a 1st Marine Division operation in Happy Valley, Quảng Nam Province. the operation resulted in 700 PAVN/VC killed and 94 captured and 35 Marines killed.\n;25 October to 2 November\nOperation Vernon Lake was an 11th Infantry Brigade clear and search operation west of Quảng Ngai. the operation resulted in 455 PAVN/VC and 35 U.S. killed.\n;25 October to 16 November\nOperation Garrard Bay was a 2nd Battalion, 26th Marines clear and search operation in Quảng Nam Province. The operation resulted in 19 PAVN/VC and seven Marines killed.\n;26 October\nThe 1st Cavalry Division was ordered to move from northern I Corps to III Corps northwest of Saigon near the Cambodian border in an operation named Operation Liberty Canyon. The 3rd Brigade, 1st Cavalry Division was the lead element of the Division and was air-lifted to Quần Lợi Base Camp to begin operations.\n;27 October\nIn the largest anti-American protest in British history, a crowd of 30,000 demonstrators marched through London near the U.S. Embassy.\n;29 October\nAbrams met with Johnson and advised him that given battlefield conditions a complete halt on bombing North Vietnam is acceptable.\n;30 October\nA PAVN sapper and mortar attack on Camp Radcliff resulted in two South Vietnamese guards killed, four vehicles destroyed and damage to several buildings.\n;31 October\nPresident Johnson announces a total halt to US bombing in North Vietnam.\nNovember\n]]\n;1 November\nAfter three-and-a-half years, Operation Rolling Thunder comes to an end. In total, the campaign had cost more than 900 American aircraft. Eight hundred and eighteen pilots are dead or missing and hundreds are in captivity. Nearly 120 VPAF planes have been destroyed in air combat, accidents, or by friendly fire. According to U.S. estimates, 182,000 North Vietnamese civilians have been killed. Twenty thousand Chinese support personnel also have been casualties of the bombing.\nThe Accelerated Pacification Program began in South Vietnam.\n;2 November\nPresident Thiệu announced to the National Assembly that South Vietnam would refuse to participate in the Paris Peace Talks: \"The Republic of Vietnam government is very sorry that such conditions for direct and serious talks between us and Hanoi have not yet come about. And therefore, the Republic of Vietnam cannot participate in the present Paris conference.\" At the same time, North Vietnamese negotiators in Paris said that it was up to the United States to guarantee that South Vietnam would join the peace talks.\n;2–7 November\nOperation Commanche Falls III was a clear and search operation conducted by elements of the 1st Cavalry Division, 1st Brigade, 5th Infantry Division and ARVN 1st Division clear southeast of Quảng Trị City. the operation resulted in 107 PAVN/VC killed and ten captured and 20 U.S. killed.\n;5 November\nRichard Nixon won the 1968 United States presidential election. The results of the popular vote were 31,770,000 for Nixon, 43.4 percent of the total; 31,270,000 or 42.7 percent for Humphrey; 9,906,000 or 13.5 percent for Wallace; and 0.4 percent for other candidates.\nThe Paris Peace Talks were called off less than 24 hours before they were to open, after the VC negotiator, Nguyen Thi Binh, said at her press conference that the group had a series of demands before it would negotiate, and the conditions were unacceptable to South Vietnam.\n;7 November – 4 April 1969\nOperation Sheridan Sabre was a security operation conducted by the 1st Cavalry Division (which had just moved from I Corps to III Corps), U.S. 11th Armored Cavalry Regiment and ARVN 36th Rangers in Bình Long Province to prevent PAVN infiltration from Cambodia. The operation resulted in 2,898 PAVN killed and 53 captured, 219 U.S. killed and six missing and 32 ARVN killed and one missing.\n;11 November\nA VC mortar and recoilless rifle attack on Camp Radcliff killed four South Vietnamese civilians and ignited 13,643 barrels of POL, one VC was killed.\nNixon was briefed on the war by members of the Johnson Administration and agreed that Johnson could follow current policy until his inauguration.\n;12 November\nClifford warned that if South Vietnam continued refusing to participate in the Paris Peace Talks the U.S. would start negotiating without them.\n;13 November\nA 1,000-man PAVN force attacked Landing Zone Dot which was defended by the ARVN 36th Regiment supported by Battery D, 1st Battalion, 5th Artillery. The attack was beaten back with support from aerial rocket artillery and artillery at nearby firebases. PAVN losses were 287 killed, while ARVN losses were 4 killed and 23 wounded.\n;14 November\nPAVN sappers attacked Firebase Vera under cover of mortar fire, killing six U.S. for the loss of six PAVN.\nPFC Francis Baldino, a rifleman with the 2nd Platoon, D Company, 1st Battalion, 4th Marines was killed by a tiger while on a night patrol out of LZ Alpine  northwest of Khe Sanh Combat Base.\n;15 November\nMACV reported a massive increase in PAVN activity in southern North Vietnam and that all bombed bridges below the 19th parallel had been repaired.\n;15 November – 29 March 1972\nOperation Commando Hunt was a covert USAF Seventh Air Force and U.S. Navy Task Force 77 aerial interdiction campaign against the Ho Chi Minh Trail.\n;20 November - 9 December\nOperation Meade River was a 1st Marine Division cordon and search operation in Dodge City, Quảng Nam Province. The operation resulted in 1,023 PAVN/VC killed and 123 captured and 108 Marines killed.\n;25 November\nNew rules of engagement (ROE) were promulgated for U.S. Navy and USAF fighters that were escorting reconnaissance aircraft over North Vietnam. Although bombing of North Vietnam had been halted, planes still flew in North Vietnamese airspace as far north as the 19th parallel. Under the new ROE, U.S. escort planes were allowed to fire missiles if their missions came under attack, including not just anti-aircraft weapons, as well as \"installations and immediate supporting facilities.\" \"American pilots,\" a U.S. Navy historian would later note, \"became more aggressive over time, occasionally attacking sites that illuminated them with radar even if no shots were fired.\"\nAn Air America C-46 crashed shortly after takeoff from Savannakhet Airport killing 26 on board.\n;26 November\nUnder American pressure, President Thiệu reversed his 2 November decision not to participate in the Paris Peace Talks.\n;26 November – 7 January 1969\nOperation Pigfat was mounted by the RLA against PAVN/Pathet Lao forces around Lima Site 85. While initially successful the arrival of PAVN reinforcements from the 316th Division forced the RLA to withdraw. RLA losses were 300 killed and 400 missing while PAVN/Pathet Lao losses are unknown.\n;28 November\nNorth Vietnam announced that it would negotiate only with the United States, or refuse to attend the talks altogether.\n;29 November\nRadio Hanoi broadcast a VC directive for a new offensive to \"utterly destroy\" Allied forces, particularly the Phoenix Program units.\nDecember\n;December to 11 May 1969\nOperation Speedy Express a controversial United States military operation conducted in the Mekong Delta provinces of Kien Hoa and Vĩnh Bình begins. The operation was launched to prevent VC units from interfering with pacification efforts and to interdict lines of communication and deny them the use of base areas.\n;3 December – 19 February 1969\nIn the Battle of Hat Dich 1ATF and ARVN forces engaged PAVN/VC units in the Hat Dich Secret Zone, Hắc Dịch. The battle resulted in 245 PAVN/VC killed and 17 captured and 22 Australians/New Zealanders and 31 ARVN killed.\n;8 December - 10 February 1969\nOperation Le Loi I was a security operation conducted by the ARVN 1st Ranger Group in Quảng Nam Province. The operation resulted in 695 PAVN/VC killed.\n;9 December to 28 February 1969\nOperation Marshall Mountain was a 1st Brigade, 5th Infantry Division (Mechanized) and ARVN 1st Regiment, 1st Division clear and search operation in eastern Quảng Trị Province. The operation resulted in 78 PAVN and six U.S. killed.\n;12 December – 9 March 1969\nOperation Taylor Common was a search and destroy operation conducted by Task Force Yankee, a task organized force of the 1st Marine Division. The objective was to clear the An Hoa Basin, neutralize the PAVN's Base Area 112 and develop Fire Support Bases (FSBs) to interdict PAVN infiltration routes leading from the Laotian border. The operation resulted in 1,398 PAVN killed and 29 captured and 183 Marines and 100 ARVN killed.\n;15 December\nClifford states that the U.S. has no obligation to maintain current force levels in South Vietnam and that U.S. and North Vietnamese forces can be withdrawn as talks progress.\n;15 December to 5 January 1969\nOperation Valiant Hunt was a BLT 2nd Battalion, 26th Marines and HMM-362 clear and search operation on Barrier Island, south of Hội An. the operation resulted in 33 PAVN/VC and three Marines killed.\n;15 December to 28 February 1969\nOperation Fayette Canyon was a security operation conducted by the 196th Infantry Brigade in \"Antenna Valley\", Hiệp Đức District and in the Nui Mat Rang mountains northwest of Tam Kỳ. The operation resulted in 327 PAVN/VC killed and four captured and two U.S. killed.\n;17 December\nDemocratic senator George McGovern described Kỳ as a \"little tinhorn dictator\" in comments that Saigon was delaying the peace negotiations.\n;18 December\nWriting in Foreign Affairs Henry Kissinger proposed twin track negotiations with the U.S. and North Vietnam agreeing a mutual de-escalation and South Vietnam and the VC agreeing a political settlement. He said that once the U.S. had withdrawn its forces from South Vietnam it was under no obligation to maintain South Vietnam by force.\n;28 December\nThe 3rd Marine Division base at Camp Carroll is deactivated and control passed to the ARVN.\nYear in numbers\n{| style=\"width:800px;\"\n|-\n! Armed Force\n! Strength\n! KIA\n! Reference\n!\n! Military costs – 1968\n! Military costs in  US$\n! Reference\n|-\n|\n| 820,000\n| 27,915\n|\n|\n|\n|\n|\n|-\n|\n| 536,100\n| 16,899\n|\n|\n| US$77,350,000,000\n| US$ }}\n|\n|-\n|\n| 50,003\n| 663\n|\n|\n|\n|\n|\n|-\n|\n| 6,005\n|\n|\n|\n|\n|\n|\n|-\n|\n| 7,661\n|\n|\n|\n|\n|\n|\n|-\n|\n| 1,576\n|\n|\n|\n|\n|\n|\n|-\n|\n| 516\n|\n|\n|\n|\n|\n|\n|-\n|  (PAVN/VC)\n| 420,000\n| North Vietnamese Source: 44,824\n191,000–208,254 (US estimates)\n|\n|\n|\n|\n|\n|}\nAnnotations\nReferences\nSee also\nList of allied military operations of the Vietnam War (1968)\nExternal links"
    }
  ]
}