{
  "content": [
    {
      "type": "text",
      "text": "# 1968–69 Pakistan revolution\n\n)Aftermath:23 March 1969–25 March 1969 (two days)\n| place =\n| coordinates =\n| causes = *Authoritarianism\n*Indo-Pakistani War of 1965\n*Inequality\n*Left-wing populism\n| goals = *Ayub Khan's resignation\n*Withdrawal of Agartala Conspiracy Case\n*Free & fair general election\n*Federalism\n| methods = Occupations, wildcat strikes, general strikes\n| status =\n| result = Ayub Khan resigned\n| side1 = Students\n*National Students Federation\nTrade unions\n* Trade unions in Pakistan\nPolitical Parties\n* Pakistan People's Party\n* Awami League\n| side2 =  Government of Pakistan\n*Pakistan Armed Forces\nConvention Muslim League\n| leadfigures1 = Non-centralized leadership\n| leadfigures2 = Ayub Khan\n| leadfigures3 =\n| howmany1 =\n| howmany2 =\n| howmany3 =\n| casualties1 = 239 deaths\n| casualties2 =\n| casualties3 =\n| injuries =\n| fatalities =\n| arrests =\n| detentions =\n| casualties_label =\n| notes =\n}}\nThe 1968-69 revolution in Pakistan was part of the protest against the dictatorial regime of Ayub Khan. It took the form of a mass uprising of students and workers, attracting people from every profession. The uprising took place from early November 1968, to the end of March 1969 with 10 to 15 million people participating. The protests resulted in President Ayub Khan resigning from office.\nBackground\nSince the nation's birth in 1947, Pakistan had been governed though bureaucracy. In 1958, the army seized power through a coup led by Ayub Khan. Under his rule, the country's economy grew at an average yearly rate of more than 5%. However, due to uneven economic growth, Pakistan became a country with extreme wealth inequality. Ayub Khan's policies nourished the capitalist class, whose fortunes amassed, but it oppressed ordinary people with increasing material poverty, as well as intellectual poverty due to rigorous political and cultural censorship. On April 21, 1968, Dr. Mahbub ul Haq, then the Chief Economist of the Planning Commission, identified Pakistan's 22 richest families that controlled 66 percent of the industries and owned 87 percent shares in the country's banking and insurance industry. Similarly, the Ayub regime implemented its own version of land reforms, under which a limit was imposed upon land holding. However, it failed miserably, and over 6,000 landowners exceeded his defined ceilings, owning 7.5 million acres of land.  The average income in West Pakistan was a mere £35 per year; in East Pakistan, the figure was lower at £15. In 1965, presidential elections were held. These elections did not extend the franchise to all adults. A few thousand so-called elected representatives of local bodies elected the president. There were wide speculations of election interference which also led to opposition protests. That same year, Pakistan went to war with India. The costs of the war put an end to economic growth and saw massive increase in defence spending. Private investment growth in Pakistan saw a 20% decline in the following years.\nMovement '68\nIn the early months of 1968, Ayub Khan celebrated what was called the \"Decade of Development\", but outraged citizens erupted in protest. In response to the \"Decade of Development\" in the early weeks of October 1968 the National Students Federation, associated with the Maoist faction of the Communist Party of Pakistan, started holding \"Demands Week\" protests and a campaign to expose the growing divide between rich and poor. Demands Week started on 7 October 1968 and the first demonstration took place in front of the Board of Secondary Education in Karachi. The movement spread across the country when later in November a group of students from Rawalpindi were heading back from Landi Kotal, and were stopped at customs checkpoints near Attock. They were aggressively searched by customs officials and charged with smuggling. On returning to Rawalpindi, they staged a protest against their mishandling by police as result of their experience. Protests grew to a sizeable amount, resulting in the police trying to dismantle the protests and shots being fired. A student of Rawalpindi Polytechnic College, Abdul Hameed, was shot dead. Already, outraged citizens were protesting against a rise in the price of sugar; the death of Hameed sparked the whole of society and many workers to join. The activist and writer Tariq Ali narrated the incident in the following words; Without any physical provocation the police, who were fully armed with rifles, batons, and tear-gas bombs, opened fire. One bullet hit Abdul Hamid, a first-year student aged seventeen, who died on the spot. Enraged, the students fought back with bricks and paving stones, and there were casualties on both sides.In February and March 1968, a wave of strikes erupted in the country. On February 13, for the first time in ten years, the red flag was hauled up in Lahore, as more than 25,000 rail workers marched along the main street chanting: \"Solidarity with the Chinese people: Destroy capitalism.\" However, there was no mass Marxist party to provide leadership. In the industrial district of Lyallpur, the district administration had to seek the permission of a local labor leader named Mukhtar Rana to secure the passage of trucks carrying supplies. All attempts at censorship failed. Trains carried word of the revolution and its messages across the country. Workers invented new methods of communication. It was the industrialisation, exploitation, and oppression widening the gulf between rich and poor which brought this change. In an interview for the book, ''Pakistan's Other Story-The 1968–69 Revolution'', Munnu Bhai revealed some anecdotes from the upsurge. \"At a public meeting in Ichra, Lahore, Jamaat-e-Islami leader Abul A'la Mawdudi held a piece of bread in his one hand and the Holy Koran in the other. He asked the crowd, 'Do you want roti (bread) or the Koran?' The people had replied, 'We have the Koran in our homes, but we don't have bread.' \"\nAccording to Mubashar Hasan's book, The crises of Pakistan and their solution,\"In this movement, a total of 239 people were killed, 196 in East Pakistan and 43 in West Pakistan. According to details police firing killed 41 in West Pakistan and 88 in East Pakistan. Most of them were students. In East Pakistan, they included Asad, Matiur, Anwar, Rostom, Dr. Shamsuzzoha and Sergeant Zahrul Huq\".By early 1969, peasant committees and organisations in the country's rural areas joined the movement. In March 1969, a group of senior military men advised Ayub to step down, fearing the eruption of a full-scale civil war in East Pakistan and the political and social anarchy in the country's west wing. Ayub Khan himself conceded that the movement had paralyzed the functioning of the state and society.\"The civilian labor force in Karachi dockyards had struck and stopped work. No loading or unloading of ships was being done. In one case a ship went back empty as it could not be loaded with cotton. Bhashani has been in Karachi and elsewhere spreading disaffection. Expectations were that the situation was likely to deteriorate\".\nAftermath\nOn the 25th of March, Ayub Khan resigned as President of Pakistan and announced he was turning over the government of the nation to the Army Chief of Staff, General Yahya Khan. Two days later, Ayub highlighted the reasons for his resignation in letter to Yahya in the following words;I am left with no option but to step aside and leave it to the Defence Forces of Pakistan, which today represent the only effective and legal instrument, to take full control of the country. They are by the grace of God in a position to retrieve the situation and to save the country from utter chaos and total destruction. They alone can restore sanity and put the country back on the road to progress in a civil and constitutional manner.The Police Service of Pakistan was unable to control the situation and law and order began to deteriorate in the country, especially in the East where the most serious uprising and riots were quelled in 1969. Unrest became so serious that at one point, Home and Defence Minister Vice-Admiral Rahman told the journalists that the \"country was under the mob rule and that police were not strong enough to tackle the situation.\" According to the demands of the protesters, the One Unit scheme was disbanded & the 4 provinces - Punjab, Sindh, North West Frontier Province & Baluchistan were recreated out of West Pakistan. In the 1970 Pakistani general election,  the Awami League won 98 percent of the allotted national and provincial assembly seats in East Pakistan, whereas in West Pakistan, the Pakistan People's Party swept the polls in the region's two largest provinces, Punjab and Sindh. The National Awami Party performed well in the former NWFP and Balochistan. Most of the \"status quo parties\" (such as the many Muslim League factions) and most religious outfits (except Jamaat-e-Islami & Jamiat Ulema Islam) were decimated.\nReferences\n__FORCETOC__"
    }
  ]
}