{
  "content": [
    {
      "type": "text",
      "text": "# 1970 United Kingdom general election\n\n3.8 pp)\n| image1 =\n| leader1 = Edward Heath\n| leader_since1 = 28 July 1965\n| party1 = Conservative Party (UK)\n| leaders_seat1 = Bexley\n| last_election1 = 253 seats, 41.9%\n| seats1 = 330\n| seat_change1 = 77\n| popular_vote1 = 13,145,123\n| percentage1 = 46.4%\n| swing1 = 4.5 pp\n| image2 =\n| leader2 = Harold Wilson\n| leader_since2 = 14 February 1963\n| party2 = Labour Party (UK)\n| leaders_seat2 = Huyton\n| last_election2 = 364 seats, 48.0%\n| seats2 = 288\n| seat_change2 = 75\n| popular_vote2 = 12,208,758\n| percentage2 = 43.1%\n| swing2 = 4.9 pp\n| image3 =\n| leader3 = Jeremy Thorpe\n| leader_since3 = 18 January 1967\n| party3 = Liberal Party (UK)\n| leaders_seat3 = North Devon\n| last_election3 = 12 seats, 8.5%\n| seats3 = 6\n| seat_change3 = 6\n| popular_vote3 = 2,117,035\n| percentage3 = 7.5%\n| swing3 = 1.0 pp\n| map_image = UK General Election, 1970.svg\n| map_size = 200px\n| map_caption = Colours denote the winning party—as shown in\n| map2_image = File:1970 UK GE Westminster diagram.svg\n| map2_caption = Composition of the House of Commons after the election\n| title = Prime Minister\n| posttitle = Prime Minister after election\n| before_election = Harold Wilson\n| before_party = Labour Party (UK)\n| after_election = Edward Heath\n| after_party = Conservative Party (UK)\n}}\nThe 1970 United Kingdom general election was held on Thursday 18 June 1970. It resulted in a surprise victory for the Conservative Party under leader Edward Heath, which defeated the governing Labour Party under Prime Minister Harold Wilson. The Liberal Party, under its new leader Jeremy Thorpe, lost half its seats. The Conservatives, including the Ulster Unionist Party (UUP), secured a majority of 30 seats. This general election was the first in which people could vote from the age of 18, after passage of the Representation of the People Act the previous year, and the first UK election in which party affiliations of candidates were put on the ballots.\nMost opinion polls prior to the election indicated a comfortable Labour victory, and put Labour up to 12.4% ahead of the Conservatives. On election day, however, a late swing gave the Conservatives a 3.4% lead and ended almost six years of Labour government, although Wilson remained leader of the Labour Party in opposition. Writing in the aftermath of the election, the political scientist Richard Rose described the Conservative victory as \"surprising\" and noted a significant shift in votes between the two main parties. The Times journalist George Clark wrote that the election would be \"remembered as the occasion when the people of the United Kingdom hurled the findings of the opinion polls back into the faces of the pollsters\".\nThe result would provide the mandate for Heath as Prime Minister to begin formal negotiations for the United Kingdom to become a member state of the European Communities (EC)—or the \"Common Market\" as it was more widely known at the time, before it later became the European Union; the UK officially joined the EC on 1 January 1973, along with the Republic of Ireland and Denmark.\nFrontbench Labour politicians George Brown and Jennie Lee were voted out at this election.\nThis marked the end of a series of elections where both main parties won over 40% of the vote.  This would not occur again for the Conservatives for nine years; Labour would wait 27.\nThe result was cast as a two-party politics outcome, with no third party reaching 10% of the (total) vote. Such an outcome would not happen again until the 2017 election.\nThe election was the last in which a nationwide UK party gained seats in Northern Ireland. The UUP sat with the Conservative Party at Westminster, traditionally taking the Conservative parliamentary whip. To all intents and purposes the UUP functioned as the Northern Ireland branch of the Conservative Party. However, hardline unionist Ian Paisley unseated the UUP incumbent in North Antrim, a clear sign that the UUP's complete dominance over unionist politics in Northern Ireland was already starting to weaken. In 1972, in protest over the permanent prorogation of the Parliament of Northern Ireland,  Westminster UUP MPs withdrew from the alliance.\nElection date\nThe date of 18 June was supposedly chosen because Harold Wilson wanted as Prime Minister to go to the polls before the introduction of decimal coinage in early 1971, for which his government had been responsible and which he thought was hugely unpopular, and because Wilson sought to gain some momentum by surprising the Conservatives, who were expecting an October election.\nOverview\nCommentators believed that an unexpectedly bad set of balance of payments figures (a £31-million trade deficit) published three days before the election and a loss of national prestige after the England football team's defeat by West Germany on 14 June in the World Cup contributed to the Labour defeat.\ncampaigning in York.]]\nOther factors that were cited as reasons for the Conservative victory included union indiscipline, rising prices, the risk of devaluation, the imposition of Selective Employment Tax (SET), and a set of jobless figures released on final week of the campaign showing unemployment at its highest level since 1940. Interviewed by Robin Day, the outgoing Prime Minister Harold Wilson highlighted the possibility that \"complacency engendered by the opinion polls\" may have resulted in a poor turnout of Labour supporters.\nAs defending world champions, England's venture in the World Cup attracted a much keener public interest than the general election did. However an analysis by pollster Matt Singh for the 50th anniversary of the election concluded that the late swing had been caused by the weak economic data and that there was \"no evidence\" that the World Cup had influenced the outcome.\nAmerican pollster Douglas Schoen and Oxford University academic R. W. Johnson asserted that Enoch Powell had attracted 2.5 million votes to the Conservatives, although the Conservative vote only increased by 1.7 million. Johnson later stated \"It became clear that Powell had won the 1970 election for the Tories&nbsp;... of all those who had switched their vote from one party to another, 50 per cent were working class Powellites\". The Professor of Political Science Randall Hansen assessed a range of studies, including some which contended that Powell had made little or no difference to the result, but concluded that \"At the very least, Powell's effect was likely to have fired up the Conservative vote in constituencies which would have voted Tory in any event\". Election night commentators Michael Barratt and Jeffrey Preece dismissed any special \"Powell factor\", as did Conservative MPs Reginald Maudling, Timothy Raison and Hugh Dykes.\nThe 1970–74 Parliament has to date been the only time since the 1924–29 Parliament in which the Conservative Party were only in government for one term before returning to opposition.\nThe most notable casualty of the election was George Brown, deputy leader of the Labour Party, who lost to the Conservative candidate in the Belper constituency. Brown had held the seat since 1945. Labour Minister for the Arts, Jennie Lee lost her Cannock seat, held by Labour since 1935  on a swing of 10.7% to the Conservatives in what Richard Rose called \"the biggest upset\" of the election.\nUnusually for the Liberal Party, the by-elections between 1966 and 1970 had proved almost fruitless, with many Liberal candidates losing deposits. The one exception was its by-election gain of Birmingham Ladywood in June 1969; this was promptly lost in the 1970 general election. The party found itself struggling to introduce its new leader Jeremy Thorpe to the public, owing to the extensive coverage and attention paid to Enoch Powell. The election result was poor for the Liberals, with Thorpe only narrowly winning his own seat in North Devon. Indeed, of the six MPs returned, three (Thorpe, David Steel and John Pardoe) were elected by a majority of less than 1,000 votes.\nThe BBC's election coverage was led by Cliff Michelmore, along with Robin Day, David Butler and Robert McKenzie. There were periodic cutaways to the BBC regions. This coverage has been rerun on BBC Parliament on several occasions, including on 18 July 2005 as a tribute to Edward Heath after his death the previous day. Its most recent screening was on the 20th of June 2020, to commemorate the 50th anniversary of its first transmission. The BBC coverage was parodied by ''Monty Python's Flying Circus'' in its famous \"Election Night Special\" sketch.\nBoth BBC and ITN carried their 1970 election night broadcasts in colour, although segments broadcast from some remote locations and some BBC and ITN regional bureaus were transmitted in black-and-white. Some ITV regions were not yet broadcasting in colour at the time of the 1970 elections.\nThe right to vote in this election was widened by the Labour government's Sixth Reform Act, which reduced the voting age from 21 to 18 years. The United Kingdom was the first major democratic nation to extend suffrage to this age group. Case law subsequently established the right for undergraduate students to vote in the constituency of their university. This followed an appeal to the High Court.\nTimeline\nThe Prime Minister, Harold Wilson, visited Buckingham Palace on 18 May and asked the Queen to dissolve Parliament on 29 May, announcing that the election would be held on 18 June. The key dates were as follows:\n{| class=\"wikitable\"\n|-\n|style=\"width:25%\"|Friday 29 May||Dissolution of the 44th Parliament and campaigning officially begins\n|-\n|Monday 8 June||Last day to file nomination papers\n|-\n|Wednesday 17 June|| Campaigning officially ends\n|-\n|Thursday 18 June|| Polling day\n|-\n|Friday 19 June|| The Conservative Party wins power with a majority of 31\n|-\n|Monday 29 June||45th Parliament assembles\n|-\n|Thursday 2 July||State Opening of Parliament\n|}\nOpinion poll summary\nSummary of the final polling results before the general election.\n{| class=\"wikitable sortable\" style=\"font-size:95%\"\n|-\n! colspan=2|Party !! Marplan !! Gallup !! National opinion polls (NOP) !! Opinion Research Centre (OPC) !! Harris\n|-\n|\n| 41.5% || 42.0% || 44.1% || 46.5% || 46.0%\n|-\n|\n| 50.2% || 49.0% || 48.2% || 45.5% || 48.0%\n|-\n|\n| 7.0% || 7.5% || 6.4% || 6.5% || 5.0%\n|-\n|\n| 1.3% || 1.5% || 1.3% || 1.5% || 1.0%\n|- class=\"sortbottom\" style=\"font-weight: bold; background: #f2f2f2;\"\n! colspan=2 scope=row | Labour lead\n| 8.7% || 7.0% || 4.1% || &minus;1.0% || 2.0%\n|- class=\"sortbottom\" style=\"background: #f2f2f2;\"\n! colspan=2 | Fieldwork dates\n| 11–14 June || 14–16 June || 12–16 June || 13–17 June || 20 May16 June\n|- class=\"sortbottom\" style=\"background: #f2f2f2;\"\n! colspan=2 | Sample size\n| 2,267 || 2,190 || 1,562 || 1,583 || 4,841\n|}\nResults\nThis was the first general election where 18-year-olds had the right to vote. Therefore, despite 1.1 million more people voting in 1970 compared to 1966, turnout actually fell by 3%. This 72% turnout was the lowest since the 1935 general election and compared with a post-War high of 84% in 1950. Professor Richard Rose described the low turnout, which he noted was \"one of the lowest since the introduction of the democratic franchise\", as surprising to politician and pollsters. Changes to electoral law as part of the Representation of the People Act 1969 had made postal voting easier and polling stations were open an hour later than in past elections, and this would have been expected to improve turnout. On top of this it was reported by Rose that an estimated 25% of 18- to 21-year-olds who were now eligible to vote had not put their names on the electoral register, meaning the turnout was even lower than the percentage figure suggested. Rose also argued that the turnout figures in Britain were \"now among the lowest in the Western world.\" Because the previous election had been in 1966, some people had not had their chance to vote in a general election until the age of 25. Labour's number of votes, 12.2 million, was ironically the same amount they had needed to win in 1964. The Conservative vote surge cost Labour in many marginal seats. Rose suggested the absolute fall in the number of Labour votes suggested that many of the party's supporters had decided to abstain. He also noted that the Labour Party's local organisation was poorer than that of the Conservatives, but did not feel this was a significant factor in Labour supporters failing to come out to vote for the Party given that this organisational difference had been the case in past elections without having this effect. For the Liberals, a small 1% drop in their vote share saw them lose 6 seats, 3 of which were held by the narrowest of margins.\nIn the end the Conservatives achieved a swing of 4.7%, enough to give them a comfortable working majority. As for the smaller parties, they increased their number in the Commons from 2 to 6 seats.\nThe Scottish National Party won its first ever seat at a general election (they had won several by-elections previously, going back as far as 1945), although they did lose Hamilton, which they won in a by-election in 1967.\n|seats      = 288\n|gain       = 1\n|loss       = 77\n|net        = &minus;76\n|votes      = 12,208,758\n|votes %    = 43.1\n|seats %    = 45.7\n|plus/minus = &minus;4.9\n}}\n|-\n|+ style=\"caption-side: bottom; font-weight:normal\" |All parties shown.\n|}\n{| class=\"wikitable\" style=\"width:70%\"\n|'''Government's new majority\n|30'''\n|-\n|Total votes cast\n|28,305,534\n|-\n|Turnout\n|72%\n|}\nVotes summary\n|46.44}}\n|43.13}}\n|7.48}}\n|1.08}}\n}}\nSeats summary\n|52.38}}\n|45.71}}\n|0.95}}\n|0.16}}\n}}\nTelevised declarations\nThese declarations were covered live by the BBC where the returning officer was heard to say \"duly elected\".\n{| class=\"wikitable plainrowheaders\"\n|+ From BBC Parliament Replay\n!rowspan=2|Constituency\n!colspan=2 rowspan=2|Winning party 1966\n! colspan=\"4\" rowspan=\"1\" |Constituency result by party\n!colspan=2 rowspan=2|Winning party 1970\n|-\n!Con\n!Lab\n!Lib\n!Others\n|-\n!scope=row|Guildford\n|\n|align=right|27,203\n|align=right|13,108\n|align=right|8,822\n|align=right|\n|  hold\n|-\n!scope=row|Cheltenham\n|\n|align=right|22,823\n|align=right|14,213\n|align=right|8,431\n|align=right|\n|  hold\n|-\n!scope=row|Salford West\n|\n|align=right|14,310\n|align=right|16,986\n|align=right|\n|align=right|\n|  hold\n|-\n!scope=row|Wolverhampton North East\n|\n|align=right|15,358\n|align=right|17,251\n|align=right|\n|align=right|1,592\n|  hold\n|-\n!scope=row|Salford East\n|\n|align=right|9,583\n|align=right|15,853\n|align=right|3,000\n|align=right|\n|  hold\n|-\n!scope=row|Wolverhampton South West\n|\n|align=right|26,252\n|align=right|11,753\n|align=right|2,459\n|align=right|318\n|  hold\n|-\n!scope=row|Newcastle upon Tyne Central\n|\n|align=right|4,256\n|align=right|13,671\n|align=right|1,433\n|align=right|\n|  hold\n|-\n!scope=row|Newcastle upon Tyne North\n|\n|align=right|15,978\n|align=right|12,518\n|align=right|\n|align=right|\n|  hold\n|-\n!scope=row|Exeter\n|\n|align=right|21,680\n|align=right|20,409\n|align=right|6,672\n|align=right|\n|  gain\n|-\n!scope=row|North Devon\n|\n|align=right|18,524\n|align=right|5,268\n|align=right|18,893\n|align=right|175\n|  hold\n|-\n!scope=row|West Aberdeenshire\n|\n|align=right|18,396\n|align=right|6,141\n|align=right|12,847\n|align=right|2,112\n|  gain\n|}\nIncumbents defeated\n{| class=\"wikitable sortable\" style=\"font-size: 95%;\"\n! colspan=\"2\" |Party\n!Name\n!Constituency\n!Office held whilst in Parliament or by-election\n!Defeated by\n! colspan=\"2\" |Party\n|-\n| rowspan=\"1\" style=\"background-color: \" |\n| rowspan=\"62\" |\n|Donald Dewar\n|Aberdeen South\n|\n|Iain Sproat\n| style=\"background-color: \" |\n|\n|-\n| rowspan=\"1\" style=\"background-color: \" |\n|Edwin Brooks\n|Bebington\n|\n|Eric Cockeram\n| style=\"background-color: \" |\n|\n|-\n| rowspan=\"1\" style=\"background-color: \" |\n|Brian Parkyn\n|Bedford\n|\n|Trevor Skeet\n| style=\"background-color: \" |\n|\n|-\n| rowspan=\"1\" style=\"background-color: \" |\n|Gwilym Roberts\n|Bedfordshire South\n|\n|David Madel\n| style=\"background-color: \" |\n|\n|-\n| rowspan=\"1\" style=\"background-color: \" |\n|George Brown\n|Belper\n|Deputy Leader of the Labour Party\n|Geoffrey Stewart-Smith\n| style=\"background-color: \" |\n|\n|-\n| rowspan=\"1\" style=\"background-color: \" |\n|Eric Moonman\n|Billericay\n|\n|Robert McCrindle\n| style=\"background-color: \" |\n|\n|-\n| rowspan=\"1\" style=\"background-color: \" |\n|Christopher Price\n|Birmingham Perry Barr\n|\n|Joseph Kinsey\n| style=\"background-color: \" |\n|\n|-\n| rowspan=\"1\" style=\"background-color: \" |\n|Ioan Evans\n|Birmingham Yardley\n|Comptroller of the Household\n|Derek Coombs\n| style=\"background-color: \" |\n|\n|-\n| rowspan=\"1\" style=\"background-color: \" |\n|Robert Howarth\n|Bolton East\n|\n|Laurance Reed\n| style=\"background-color: \" |\n|\n|-\n| rowspan=\"1\" style=\"background-color: \" |\n|Gordon Oakes\n|Bolton West\n|\n|Robert Redmond\n| style=\"background-color: \" |\n|\n|-\n| rowspan=\"1\" style=\"background-color: \" |\n|Woodrow Wyatt\n|Bosworth\n|\n|Adam Butler\n| style=\"background-color: \" |\n|\n|-\n| rowspan=\"1\" style=\"background-color: \" |\n|Norman Haseldine\n|Bradford West\n|\n|John Wilkinson\n| style=\"background-color: \" |\n|\n|-\n| rowspan=\"1\" style=\"background-color: \" |\n|Colin Jackson\n|Brighouse and Spenborough\n|\n|Wilfred Proudfoot\n| style=\"background-color: \" |\n|\n|-\n| rowspan=\"1\" style=\"background-color: \" |\n|Dennis Hobden\n|Brighton Kemptown\n|\n|Andrew Bowden\n| style=\"background-color: \" |\n|\n|-\n| rowspan=\"1\" style=\"background-color: \" |\n|Raymond Dobson\n|Bristol North East\n|Assistant Whip\n|Robert Adley\n| style=\"background-color: \" |\n|\n|-\n| rowspan=\"1\" style=\"background-color: \" |\n|John Ellis\n|Bristol North West\n|\n|Martin McLaren\n| style=\"background-color: \" |\n|\n|-\n| rowspan=\"1\" style=\"background-color: \" |\n|Robert Maxwell\n|Buckingham\n|\n|William Benyon\n| style=\"background-color: \" |\n|\n|-\n| rowspan=\"1\" style=\"background-color: \" |\n|Jennie Lee\n|Cannock\n|Minister for the Arts\n|Patrick Cormack\n| style=\"background-color: \" |\n|\n|-\n| rowspan=\"1\" style=\"background-color: \" |\n|Ted Rowlands\n|Cardiff North\n|\n|Michael Roberts\n| style=\"background-color: \" |\n|\n|-\n| rowspan=\"1\" style=\"background-color: \" |\n|Alistair Macdonald\n|Chislehurst\n|\n|Patricia Hornsby-Smith\n| style=\"background-color: \" |\n|\n|-\n| rowspan=\"1\" style=\"background-color: \" |\n|Ednyfed Hudson Davies\n|Conway\n|\n|Wyn Roberts\n| style=\"background-color: \" |\n|\n|-\n| rowspan=\"1\" style=\"background-color: \" |\n|David Winnick\n|Croydon South\n|\n|Richard Thompson\n| style=\"background-color: \" |\n|\n|-\n| rowspan=\"1\" style=\"background-color: \" |\n|Sydney Irving\n|Dartford\n|Chairman of Ways and Means\n|Peter Trew\n| style=\"background-color: \" |\n|\n|-\n| rowspan=\"1\" style=\"background-color: \" |\n|David Ennals\n|Dover\n|Minister of State for Social Services\n|Peter Rees\n| style=\"background-color: \" |\n|\n|-\n| rowspan=\"1\" style=\"background-color: \" |\n|Stan Newens\n|Epping\n|\n|Norman Tebbit\n| style=\"background-color: \" |\n|\n|-\n| rowspan=\"1\" style=\"background-color: \" |\n|Gwyneth Dunwoody\n|Exeter\n|Parliamentary Secretary at the Board of Trade\n|John Hannam\n| style=\"background-color: \" |\n|\n|-\n| rowspan=\"1\" style=\"background-color: \" |\n|John Dunwoody\n|Falmouth and Camborne\n|\n|David Mudd\n| style=\"background-color: \" |\n|\n|-\n| rowspan=\"1\" style=\"background-color: \" |\n|Terence Boston\n|Faversham\n|\n|Roger Moate\n| style=\"background-color: \" |\n|\n|-\n| rowspan=\"1\" style=\"background-color: \" |\n|John Diamond\n|Gloucester\n|Chief Secretary to the Treasury\n|Sally Oppenheim\n| style=\"background-color: \" |\n|\n|-\n| rowspan=\"1\" style=\"background-color: \" |\n|Albert Murray\n|Gravesend\n|Parliamentary Secretary to the Ministry of Transport\n|Roger White\n| style=\"background-color: \" |\n|\n|-\n| rowspan=\"1\" style=\"background-color: \" |\n|Ben Whitaker\n|Hampstead\n|Parliamentary Secretary to the Minister of Overseas Development\n|Geoffrey Finsberg\n| style=\"background-color: \" |\n|\n|-\n| rowspan=\"1\" style=\"background-color: \" |\n|Roy Roebuck\n|Harrow East\n|\n|Hugh Dykes\n| style=\"background-color: \" |\n|\n|-\n| rowspan=\"1\" style=\"background-color: \" |\n|Peter Jackson\n|High Peak\n|\n|Spencer Le Marchant\n| style=\"background-color: \" |\n|\n|-\n| rowspan=\"1\" style=\"background-color: \" |\n|Alan Lee Williams\n|Hornchurch\n|\n|John Loveridge\n| style=\"background-color: \" |\n|\n|-\n| rowspan=\"1\" style=\"background-color: \" |\n|Arnold Shaw\n|Ilford South\n|\n|Albert Cooper\n| style=\"background-color: \" |\n|\n|-\n| rowspan=\"1\" style=\"background-color: \" |\n|Dingle Foot\n|Ipswich\n|Solicitor General for England and Wales\n|Ernle Money\n| style=\"background-color: \" |\n|\n|-\n| rowspan=\"1\" style=\"background-color: \" |\n|John Binns\n|Keighley\n|\n|Joan Hall\n| style=\"background-color: \" |\n|\n|-\n| rowspan=\"1\" style=\"background-color: \" |\n|John Page\n|King's Lynn\n|\n|Christopher Brocklebank-Fowler\n| style=\"background-color: \" |\n|\n|-\n| rowspan=\"1\" style=\"background-color: \" |\n|Stanley Henig\n|Lancaster\n|\n|Elaine Kellett-Bowman\n| style=\"background-color: \" |\n|\n|-\n| rowspan=\"1\" style=\"background-color: \" |\n|Harold Davies\n|Leek\n|Parliamentary Private Secretary to the Prime Minister\n|David Knox\n| style=\"background-color: \" |\n|\n|-\n| rowspan=\"1\" style=\"background-color: \" |\n|James Dickens\n|Lewisham West\n|\n|John Gummer\n| style=\"background-color: \" |\n|\n|-\n| rowspan=\"1\" style=\"background-color: \" |\n|William Howie\n|Luton\n|Comptroller of the Household\n|Charles Simeons\n| style=\"background-color: \" |\n|\n|-\n| rowspan=\"1\" style=\"background-color: \" |\n|Jeremy Bray\n|Middlesbrough West\n|\n|John Sutcliffe\n| style=\"background-color: \" |\n|\n|-\n| rowspan=\"1\" style=\"background-color: \" |\n|Denis Coe\n|Middleton and Prestwich\n|\n|Alan Haselhurst\n| style=\"background-color: \" |\n|\n|-\n| rowspan=\"1\" style=\"background-color: \" |\n|Donald Anderson\n|Monmouth\n|\n|John Stradling Thomas\n| style=\"background-color: \" |\n|\n|-\n| rowspan=\"1\" style=\"background-color: \" |\n|Bert Hazell\n|Norfolk North\n|\n|Ralph Howell\n| style=\"background-color: \" |\n|\n|-\n| rowspan=\"1\" style=\"background-color: \" |\n|George Perry\n|Nottingham South\n|\n|Norman Fowler\n| style=\"background-color: \" |\n|\n|-\n| rowspan=\"1\" style=\"background-color: \" |\n|John Horner\n|Oldbury and Halesowen\n|\n|John Stokes\n| style=\"background-color: \" |\n|\n|-\n| rowspan=\"1\" style=\"background-color: \" |\n|Evan Luard\n|Oxford\n|\n|Montague Woodhouse\n| style=\"background-color: \" |\n|\n|-\n| rowspan=\"1\" style=\"background-color: \" |\n|Ronald Atkins\n|Preston North\n|\n|Mary Holt\n| style=\"background-color: \" |\n|\n|-\n| rowspan=\"1\" style=\"background-color: \" |\n|Peter Mahon\n|Preston South\n|\n|Alan Green\n| style=\"background-color: \" |\n|\n|-\n| rowspan=\"1\" style=\"background-color: \" |\n|John Lee\n|Reading\n|\n|Gerard Vaughan\n| style=\"background-color: \" |\n|\n|-\n| rowspan=\"1\" style=\"background-color: \" |\n|Anne Kerr\n|Rochester and Chatham\n|\n|Peggy Fenner\n| style=\"background-color: \" |\n|\n|-\n| rowspan=\"1\" style=\"background-color: \" |\n|Antony Gardner\n|Rushcliffe\n|\n|Kenneth Clarke\n| style=\"background-color: \" |\n|\n|-\n| rowspan=\"1\" style=\"background-color: \" |\n|Frank Hooley\n|Sheffield Heeley\n|\n|John Spence\n| style=\"background-color: \" |\n|\n|-\n| rowspan=\"1\" style=\"background-color: \" |\n|Bob Mitchell\n|Southampton Test\n|\n|James Hill\n| style=\"background-color: \" |\n|\n|-\n| rowspan=\"1\" style=\"background-color: \" |\n|Arnold Gregory\n|Stockport North\n|\n|Idris Owen\n| style=\"background-color: \" |\n|\n|-\n| rowspan=\"1\" style=\"background-color: \" |\n|Ernest Davies\n|Stretford\n|\n|Winston Churchill\n| style=\"background-color: \" |\n|\n|-\n| rowspan=\"1\" style=\"background-color: \" |\n|Gerald Fowler\n|The Wrekin\n|\n|Anthony Trafford\n| style=\"background-color: \" |\n|\n|-\n| rowspan=\"1\" style=\"background-color: \" |\n|John Ryan\n|Uxbridge\n|\n|Charles Curran\n| style=\"background-color: \" |\n|\n|-\n| rowspan=\"1\" style=\"background-color: \" |\n|Malcolm Macmillan\n|Western Isles\n|\n|Donald Stewart\n! class=\"unsortable\" style=\"background-color: \" |\n|Scottish National Party\n|-\n| rowspan=\"1\" style=\"background-color: \" |\n|Hugh Gray\n|Yarmouth\n|\n|Anthony Fell\n| style=\"background-color: \" |\n|\n|-\n| style=\"background-color: \" |\n| rowspan=\"6\" |\n|Kenneth Baker\n|Acton\n|Elected in the 1968 Acton by-election\n|Nigel Spearing\n| rowspan=\"1\" style=\"background-color: \" |\n| rowspan=\"1\" |\n|-\n| style=\"background-color: \" |\n|Donald Williams\n|Dudley\n|Elected in the 1968 Dudley by-election\n|John Gilbert\n| rowspan=\"1\" style=\"background-color: \" |\n| rowspan=\"1\" |\n|-\n| style=\"background-color: \" |\n|Esmond Wright\n|Glasgow Pollok\n|Elected in the 1967 Glasgow Pollok by-election\n|James White\n| rowspan=\"1\" style=\"background-color: \" |\n| rowspan=\"1\" |\n|-\n| style=\"background-color: \" |\n|Bruce Campbell\n|Oldham West\n|Elected in the 1968 Oldham West by-election\n|Michael Meacher\n| rowspan=\"1\" style=\"background-color: \" |\n| rowspan=\"1\" |\n|-\n| style=\"background-color: \" |\n|Christopher Ward\n|Swindon\n|Elected in the 1969 Swindon by-election\n|David Stoddart\n| rowspan=\"1\" style=\"background-color: \" |\n| rowspan=\"1\" |\n|-\n| style=\"background-color: \" |\n|Fred Silvester\n|Walthamstow West\n|Elected in the 1967 Walthamstow West by-election\n|Eric Deakins\n| rowspan=\"1\" style=\"background-color: \" |\n| rowspan=\"1\" |\n|-\n| style=\"background-color: \" |\n| rowspan=\"5\" |\n|Wallace Lawler\n|Birmingham Ladywood\n|Elected in the 1969 Birmingham Ladywood by-election\n|Doris Fisher\n| rowspan=\"1\" style=\"background-color: \" |\n| rowspan=\"1\" |\n|-\n| style=\"background-color: \" |\n|Michael Winstanley\n|Cheadle\n|\n|Tom Normanton\n| style=\"background-color: \" |\n|\n|-\n| style=\"background-color: \" |\n|Richard Wainwright\n|Colne Valley\n|\n|David Clark\n| rowspan=\"1\" style=\"background-color: \" |\n| rowspan=\"1\" |\n|-\n| style=\"background-color: \" |\n|Eric Lubbock\n|Orpington\n|Liberal Chief Whip\n|Ivor Stanbrook\n| style=\"background-color: \" |\n|\n|-\n| style=\"background-color: \" |\n|Alasdair Mackenzie\n|Ross and Cromarty\n|\n|Hamish Gray\n| style=\"background-color: \" |\n|\n|-\n! class=\"unsortable\" style=\"background-color: \" |\n| rowspan=\"2\" |Ulster Unionist\n|Henry Clark\n|Antrim North\n|\n|Ian Paisley\n| style=\"background-color: \" |\n|Democratic Unionist\n|-\n! class=\"unsortable\" style=\"background-color: \" |\n|James Hamilton\n|Fermanagh and South Tyrone\n|\n|Frank McManus\n| style=\"background-color: \" |\n|Unity\n|-\n! class=\"unsortable\" style=\"background-color: \" |\n|Scottish National Party\n|Winnie Ewing\n|Hamilton\n|Elected in the 1967 Hamilton by-election\n|Alex Wilson\n| rowspan=\"1\" style=\"background-color: \" |\n| rowspan=\"1\" |\n|-\n! class=\"unsortable\" style=\"background-color: \" |\n|Plaid Cymru\n|Gwynfor Evans\n|Carmarthen\n|Elected in the 1966 Carmarthen by-election\n|Gwynoro Jones\n| rowspan=\"1\" style=\"background-color: \" |\n| rowspan=\"1\" |\n|-\n|\n|Democratic Party\n|Desmond Donnelly\n|Pembrokeshire\n|Former Labour MP\n|Nicholas Edwards\n| style=\"background-color: \" |\n|\n|}\nSee also\n*List of MPs elected in the 1970 United Kingdom general election\n*1970 United Kingdom general election in Northern Ireland\n*1970 United Kingdom general election in Scotland\n*1970 United Kingdom general election in England\n*1970 United Kingdom local elections\nNotes\nReferences\nFurther reading\n* the standard scholarly study.\n*\nExternal links\n*[http://www.election.demon.co.uk/geresults.html United Kingdom election results—summary results 1885–1979]\nManifestos\n*[https://web.archive.org/web/20100213135915/http://www.conservative-party.net/manifestos/1970/1970-conservative-manifesto.shtml A Better Tomorrow], 1970 Conservative Party manifesto\n*[https://web.archive.org/web/20170509104426/http://www.politicsresources.net/area/uk/man/lab70.htm ''Now Britain's stronglet's make it great to live in], 1970 Labour Party manifesto\n*[https://web.archive.org/web/20170516071332/http://www.politicsresources.net/area/uk/man/lib70.htm What a Life!''], 1970 Liberal Party manifesto"
    }
  ]
}