{
  "content": [
    {
      "type": "text",
      "text": "# 1972 South Korean presidential election\n\n| title = President\n| before_election = Park Chung-hee\n| before_party = Democratic Republican Party (South Korea)\n| after_election = Park Chung-hee\n| after_party = Democratic Republican Party (South Korea)\n}}\nPresidential elections were held in South Korea in December 1972 following the promulgation of the Yushin Constitution, which created the National Conference for Unification, a body whose functions included being an electoral college for presidential elections. Incumbent President Park Chung-hee claimed that Western-style liberal democracy would bring more chaos to the economically struggling nation than it could afford. In contrast, he argued that the Yushin system created a \"Korean-style democracy\" with a strong, unchallenged presidency. He argued this system was necessary to keep the country stable.\nNational Conference for Unification election\nThe 2,359 members of the first National Conference for Unification were elected to their six-year term on 5 December 1972, with a voter turnout of 70%. All candidates were required to run as independents. The Constitution gave the body many powers, such as forming policies related to inter-Korean relationship, and determining the president as well as one-third of the National Assembly. However, the body was little more than a rubber stamp, as all of its actions were controlled by the president.\n{| class=\"wikitable sortable\" style=\"text-align:right\"\n!Province/City\n!Electorate\n!Turnout\n!%\n!Valid votes\n!Delegates\n|-\n| align=\"left\" |Seoul\n|3,113,767\n|1,773,454\n|57.0\n|1,702,369\n|303\n|-\n| align=\"left\" |Busan\n|941,884\n|642,641\n|68.2\n|622,823\n|104\n|-\n| align=\"left\" |Gyeonggi\n|1,664,447\n|1,154,711\n|69.4\n|1,123,083\n|280\n|-\n| align=\"left\" |Gangwon\n|788,276\n|629,915\n|79.9\n|613,395\n|145\n|-\n| align=\"left\" |North Chungcheong\n|602,554\n|461,547\n|76.6\n|447,557\n|127\n|-\n| align=\"left\" |South Chungcheong\n|1,278,743\n|924,874\n|72.3\n|900,402\n|231\n|-\n| align=\"left\" |North Jeolla\n|1,092,516\n|838,211\n|76.7\n|810,011\n|200\n|-\n|align=\"left\" |South Jeolla\n|1,636,382\n|1,174,364\n|71.8\n|1,138,441\n|312\n|-\n|align=\"left\" |North Gyeongsang\n|1,970,647\n|1,507,092\n|76.5\n|1,457,409\n|354\n|-\n|align=\"left\" |South Gyeongsang\n|1,339,583\n|1,038,388\n|77.5\n|1,009,869\n|278\n|-\n|align=\"left\" |Jeju\n|170,818\n|138,596\n|81.1\n|135,242\n|25\n|- class=\"sortbottom\"\n| align=\"left\" |Total\n|14,599,617\n|10,283,793\n|70.4\n|9,960,601\n|2,359\n|}\nThe newly sworn-in members of the National Conference for Unification convened on 23 December to elect Park to a fourth term as president. With no opposition candidates, Park was elected with the support of 2,357 out of the 2,359 delegates. The elections were regarded as a formality.\nThe National Conference for Unification members elected in 1972 would later approve Park's slate of nominees for one-third of the National Assembly in 1973 and 1976.\nPresidential election\nIn order to be elected, a candidate had to receive the vote of over 50% of the incumbent members of the National Council for Unification. With 2,359 delegates in office, Park had to receive at least 1,180 votes to be elected. He received 2,357 votes, 99.92% of the total possible.\nAs there was only one candidate registered, the only way the deputies could vote against Park was by casting invalid ballots. One of the two deputies who did that, Song Dong-heon from Daejeon-1 District, revealed later in his life that he purposefully wrote \"박정의\" (Park Chung-ee) instead of \"박정희\" (Park Chung-hee) on his ballot in order to protest the dictatorial regime.\nReferences"
    }
  ]
}