{
  "content": [
    {
      "type": "text",
      "text": "# 1973 Kings Cross strippers' strike\n\nThe '''1973 Kings Cross strippers' strike' was a strike among strippers working in clubs in the Sydney, Australia suburb of Kings Cross. Strippers went on strike from October to December 1973 over poor wages and working conditions and the sackings of workers who protested. The strippers received some support from the wider trade union movement, and emerged successful, with the reinstatement of striking workers and improved wages and working conditions.\nIn October 1973, a number of strippers at two major Kings Cross strip clubs, the Pink Panther and the Staccato, joined the Actors Equity union. Janine Gair, a stripper who had been a union member for several years, discovered that the union had agreed to accept strippers and encouraged her colleagues to join. The strippers wanted to take action to improve their working conditions, but the union wanted to gather more information first, and the union organiser representing them, Colin Voight, went on leave for two weeks. The strippers, frustrated, contacted television program A Current Affair'', for which four of them were sacked on 29 October. Another seven workers had gone out on strike demanding their reinstatement by 1 November, and by mid-November another five were on strike, for a total of sixteen. It was reported that the last group had walked out in the middle of the 11.30 show on a Friday evening. The union was initially dismissive of strippers' concerns about violence and the urgency of change, but subsequently changed their view. The clubs were owned by Peter Farrugia, who was rumoured to be a frontman for organised crime figure Abe Saffron. The clubs brought in non-union labour from Adelaide, reportedly from other clubs that Saffron owned; the move was met with a picket from the striking workers.\nThe strippers complained that they were working more hours for less pay than they had in the past, had dressing room and safety facilities that were \"almost non-existent\", were fined for calling in sick or if they refused to perform for the manager at the conclusion of a shift, and were fired for not working Christmas Eve or Good Friday. They drew up a log of sixteen claims sought, including a fee for extra performances, the ability to decline extra performances, and a ban on requiring strippers to perform in films. The clubs reportedly paid the lowest rates in Kings Cross.\nOn 9 November 1973, Actors Equity organiser Voight was seriously assaulted by bouncers while attempting to enter the Pink Panther. The boyfriend of one of the strippers had also been assaulted earlier in the strike. By mid-November, with no progress three weeks into the strike, Actors Equity requested that the State Labor Council cut off all supplies, goods and services to the clubs. The State Labor Council approved the ban on 15 November, cutting off \"all services and goods, including mail, water, electricity, food, drinks, cigarettes and tobacco\", and seeking a meeting with Premier Robert Askin about violence in the entertainment industry. The council's acting secretary, John Ducker, a powerful right-wing Catholic unionist, released a statement that \"there is no place for this sort of business in Australia\".\nBy 20 November, it was reported that the clubs had offered an increase in wages to $150 per week and some improvements in working conditions, but had refused to re-employ all the strikers. The approach of the striking workers towards reinstatement was described at that time as \"one back all back\". Gair told media that she was \"delighted by the union movement's support\" and that \"it will force the club's management to realise that trade unions are not to be laughed at\". She stated that she believed they would get their jobs back and that the workers hoped for a management change.\nOn 23 November, the striking workers held a protest march along Darlinghurst Road through Kings Cross to the El Alamein Fountain. A \"shoving duel\" between demonstrators and \"heavies\" took place as they passed the Pink Panther. The march was addressed by state Labor MP George Petersen, federal Building Workers' Industrial Union secretary Pat Clancy and the federal organiser of Actors Equity, N. Kirkpatrick. Clancy announced that he would request that the Australian Council of Trade Unions support the state black ban on the clubs, and Petersen told media that \"it is incredible that these clubs are allowed to operate under conditions that are illegal\". The Builders Labourers Federation leadership were also present at pickets and demonstrations during the strike.\nOn 26 November, the Staccato club blew up in an explosion caused by petrol spread over the club's floor, which gutted the club. On 30 November, the Builders Labourers Federation put a work ban on reconstruction until both the strike and the assault on Voight had been settled. The fire was started by club and organised crime figure James Macartney Anderson, a friend of Farrugia's. Anderson claimed that he had seen two men \"acting suspiciously\", had stopped to investigate, and had not smelled petrol before he lit a cigarette, which started the fire. Farrugia supported Anderson's story, and police told a 1974 inquest that Anderson had \"inadvertently\" started the fire. Author Duncan McNab wrote that Farrugia \"had wanted to get out of that particular strip club, which was losing him money\".\nOn 7 December, strippers and supporters picketed outside the Pink Panther, at which Kirkpatrick read a message from state Opposition Leader Neville Wran criticising the lack of award wages for the strippers. Gair announced that, as spokesperson for the striking workers, she had received five death threats during the strike to that date. Kirkpatrick sought entry to the club under union entry laws with a police escort, but was refused, and announced an intention to prosecute the club for breaching the Industrial Arbitration Act. It was announced at that time that the State Labour Council would assist the striking workers in negotiating with the club to end the strike.\nThe strike ended on 12 December 1973, when the Pink Panther agreed to reinstate the striking workers with improved working conditions.\nReferences"
    }
  ]
}