{
  "content": [
    {
      "type": "text",
      "text": "# 1981 King George VI and Queen Elizabeth Stakes\n\nThe 1981 King George VI and Queen Elizabeth Stakes was a horse race held at Ascot Racecourse on Saturday 25 July 1981. It was the 31st running of the King George VI and Queen Elizabeth Stakes.\nThe winner was Aga Khan's Shergar, a three-year-old bay colt trained at Newmarket, Suffolk by Michael Stoute and ridden by Walter Swinburn. Shergar's victory was the first in the race for his owner, trainer and jockey.\nThe contenders\nThe race attracted a field of seven runners, all of whom were trained in the United Kingdom. The favourite was Shergar, a three-year-old colt who had won the Epsom Derby by a record ten lengths and the Irish Derby by four. The only other three-year-old in the field was Madam Gay, a filly who had won the Prix de Diane. Shergar's biggest challenges were expected to come from the four-year-olds Master Willie who had finished second in the 1980 Epsom Derby before winning the International Stakes, Coronation Cup and Eclipse Stakes, Light Cavalry the winner of the 1980 St Leger Stakes and Pelerin, who had defeated Light Cavalry in the Hardwicke Stakes at Royal Ascot. The other runners were the Cumberland Lodge Stakes winner Fingal's Cave and the five-year-old Cracaval, best known for beating Ile de Bourbon in the September Stakes. Shergar headed the betting at odds of 2/5 ahead of Master Willie (7/1), Pelerin (15/2) and Light Cavalry (12/1).\nThe race\nThere was no recognised pacemaker in the race and Light Cavalry led the field at a slow pace from Master Willie, who fought against his jockey's attempts to restrain him with Shergar in third. Madam Gay and Pelerin followed, ahead of Fingal's Cave and Cracaval. Master Willie moved past Light Cavalry with half a mile left to run as Madam Gay began a forward move which left Shergar temporarily boxed-in on the rail. Entering the straight, Master Willie held the advantage from Madam Gay as Light Cavalry drifted left. allowing Walter Swinburn to drive Shergar through the resulting gap on the inside. Shergar overtook Master Willie approaching the final furlong and drew away to win by four lengths. Madam Gay took second by a short-head from the fast-finishing Fingal's Cave, with the weakening Master Willie four lengths away in fourth. There was a gap of two and a half lengths back to Pelerin who took fifth place, a short head and half a length ahead of Cracaval and Light Cavalry.\nRace details\n* Sponsor: De Beers\n* First prize: £119,206\n* Surface: Turf\n* Going: Good to Firm\n* Distance: 12 furlongs\n* Number of runners: 7\n* '''Winner's time: 2:35.4\nFull result\n{| class = \"sortable\" | border=\"1\" cellpadding=\"0\" style=\"border-collapse: collapse;\"\n|-  style=\"background:#7d7; text-align:center;\"\n! style=\"width:35px;\"| Pos.\n! style=\"width:45px;\"| Marg.\n! style=\"width:160px;\"| Horse (bred)\n! style=\"width:30px;\"| Age\n! style=\"width:160px;\"| Jockey\n! style=\"width:210px;\"| Trainer (Country)\n! style=\"width:50px;\"| Odds\n|-\n| 1\n|\n| Shergar (IRE)\n| 3\n| Walter Swinburn\n| Michael Stoute (GB)\n| 2/5 fav\n|-\n| 2'\n| 4\n| Madam Gay (GB)\n| 3\n| Greville Starkey\n| Paul Kelleway (GB)\n| 40/1\n|-\n| 3\n| shd''\n| Fingal's Cave (IRE)\n| 4\n| Pat Eddery\n| John Dunlop (GB)\n| 40/1\n|-\n| 4\n| 4\n| Master Willie (GB)\n| 4\n| Philip Waldron\n| Henry Candy (GB)\n| 7/1\n|-\n| 5\n| 2½\n| Pelerin (FR)\n| 4\n| Brian Taylor\n| Harry Wragg (GB)\n| 15/2\n|-\n| 6\n| hd\n| Cracaval (IRE)\n| 5\n| Steve Cauthen\n| Barry Hills (GB)\n| 80/1\n|-\n| 7\n| ½\n| Light Cavalry (GB)\n| 4\n| Lester Piggott\n| Henry Cecil (GB)\n| 12/1\n|}\n* Abbreviations: nse = nose; nk = neck; shd = head; hd = head; dist = distance; UR = unseated rider\nWinner's details\nFurther details of the winner, Shergar\n* Sex: Colt\n* Foaled: 3 March 1978\n* Country: Ireland\n* Sire: Great Nephew; Dam: Sharmeen (Honeyway)\n* Owner: Aga Khan IV\n* Breeder: Aga Khan IV\nReferences"
    }
  ]
}