{
  "content": [
    {
      "type": "text",
      "text": "# 1981 Palanca Awards\n\n| image            =\n| imagesize        =\n| previous         = 1980\n| next             = 1982\n}}\nThe 31st Don Carlos Palanca Memorial Awards for Literature was held to commemorate the memory of Don Carlos Palanca Sr. through an endeavor that would promote education and culture in the country.\nLIST OF WINNERS\nThe 1981 winners were divided into twelve categories, open only to English and Filipino [Tagalog] novel, short story, poetry, essay, one-act play, and full-length play:\nEnglish Division\nNovel\n* Grand Prize: F. Sionil Jose, Mass\n: Wilfrido D. Nolledo, Sangria Tomorrow\nShort Story\n* First Prize: Jessie B. Garcia, \"In Hog Heaven\"\n* Second Prize: Luning Bonifacio Ira, \"The Party Hopper\"\n* Third Prize: Jesus Q. Cruz, \"In These Hallowed Halls\"\nPoetry\n* First Prize: Edel Garcellano, \"Poems\"\n* Second Prize: Jose M. Lansang Jr., \"15 Poems\"\n: Samuel Peralta, \"Pacific\"\n* Third Prize: Cesar Mella, \"It is Autumn in China and Am Far Away from Home\"\n: Simeon Dumdum, Jr., \"Selected Poems\"\nEssay\n* First Prize: Cirilo F. Bautista, \"Philippine Poetics: The Past Eight Years\"\n* Second Prize: Jesus S.M. Dimapilis, \"Fifteen Days in the Life of Jun San Juan, Filipino, Member of the Family of Man\"\n* Third Prize: Alfredo N. Salanga, \"The Aglipay Question\"\nOne-Act Play\n* First Prize: Tony Perez, \"Sacraments of the Dead\"\n* Second Prize: Dong Delos Reyes, \"Penumbra\"\n* Third Prize: Leoncio P. Deriada, \"Abattoir\"\n: Alfredo O. Cuenca Jr., \"The Players\"\nFull-Length Play\n* First Prize: No Winner\n* Second Prize: No Winner\n* Third Prize: No Winner\n* Special Prize: Lemuel Torrevillas, \"Gateau La Sans Rival...\"\nFilipino Division\nNobela\n* Special Prize: Reynaldo A. Duque, Mga Tinapay sa Ibabaw ng Tubig\nMaikling Kwento\n* First Prize: Benjamin P. Pascual, \"Di Ko Masilip Ang Langit\"\n* Second Prizes: Rosario Balmaceda-Gutierrez, \"Ambos ng Bayan\"\n: Generoso Taduran Jr., \"Sulat Mula Sa Libon\"\n* Third Prize: Lamberto E. Antonio, \"May Hatid na Subyang ang Hangin at Ulan\"\nTula\n* First Prize: Romulo Sandoval, \"Taga sa Bato\"\n* Second Prize: Tomas F. Agulto, \"Lagi na'y Kailangan Kong Gumising nang Maaga't iba pang Pagdidili-dili\"\n* Third Prize: Benigno R. Juan, \"Kaya Bang Ipiit at Saka Tanuran ang Isang Gunita\"\nSanaysay\n* First Prize: Wilfredo Pa. Virtusio, \"Ang Kuwento ng Nawawalang Ilog\"\n: Pedro L. Ricarte, \"Sa Sariling Panunuring Pampanitikan: Mga Hamon at Pananagutan\"\n* Second Prize: Romulo Sandoval, \"Hagkis ni Lamberto E. Antonio: Ang Tula Bilang Sandatang Pampulitika\"\n: Ligaya Tiamson-Rubin, \"Paano Nagsusulat ang Isang Ina\"\n* Third Prize: Ernesto Cabling, \"Ang Manlalakbay\"\n: Reuel Molina Aguila, \"Talababa sa Kontemporaryong Dula\"\nDulang May Isang Yugto\n* First Prize: Rene O. Villanueva, \"May Isang Sundalo\"\n* Second Prize: Bienvenido Noriega Jr., \"Barkada\"\n* Third Prize: Mariano Calangasan, \"Ganito Bang Lahat Ang Tatay\"\nDulang Ganap ang Haba\n* First Prize: Bienvenido Noriega Jr., \"Mga Idolong Romantiko sa Isang Dulang Sumusuri ng Lipunan\"\n* Second Prize: Bienvenido Noriega Jr., \"Juan Luna\"\n* Third Prize: Noel De Leon, \"Anghel\"\nReferences\n*"
    }
  ]
}