{
  "content": [
    {
      "type": "text",
      "text": "# 1982 Glasgow Queen's Park by-election\n\n8.4%\n| candidate2 = Peter Mallan\n| image2 =\n| party2 = Scottish National Party\n| popular_vote2 = 3,157\n| percentage2 = 20.0%\n| swing2 = 10.3%\n| candidate4 = Jackson Carlaw\n| image4 =\n| party4 = Conservative Party (UK)\n| popular_vote4 = 1,888\n| percentage4 = 12.0%\n| swing4 = 12.0%\n| candidate5 = Graham Watson\n| image5 =\n| party5 = Liberal Party (UK)\n| popular_vote5 = 1,487\n| percentage5 = 9.4%\n| swing5 =\n| map_image =\n| map_size =\n| map_caption =\n| title = MP\n| before_election = Frank McElhone\n| before_party = Labour Party (UK)\n| after_election = Helen McElhone\n| after_party = Labour Party (UK)\n| turnout = 47.0% 21.4%\n}}\nThe '''1982 Glasgow Queen's Park by-election''' was a parliamentary by-election held on 2 December 1982 for the UK House of Commons constituency of Glasgow Queen's Park.\nPrevious MP\nThe seat fell vacant when the constituency's Labour Member of Parliament (MP), Francis Patrick \"Frank\" McElhone (5 April 1929 – 22 September 1982) died.\nMcElhone was elected Member of Parliament for Glasgow Gorbals at a 1969 by-election, serving until the constituency was abolished in boundary changes for the February 1974 general election.\nHe was then elected as MP for Glasgow Queen's Park, and held that seat until he died in office in 1982 at the age of 53.  He served as Parliamentary Under-Secretary of State for Scotland from 1975 to 1979.\nCandidates\nSeven candidates were nominated. The list below is set out in descending order of the number of votes received at the by-election.\n1. Representing the Labour Party was Helen McElhone, born Helen Margaret Brown in 1933.\nFollowing the death of her husband Frank McElhone MP in 1982, Helen McElhone was elected as his successor in the resulting by-election. However, she served for only six months as the seat was abolished by boundary changes before the 1983 general election.\nAfter her brief term as MP, she was a Strathclyde Regional Councillor for a number of years until 1995 for the Scottish Labour Party, on whose Selection Panel she served to approve candidates for the 1999 Scottish Parliament elections.\n2. The Scottish National Party candidate was Peter Mallan (1934–2014)gn. He worked as a teacher and broadcaster. He also contested Glasgow Central in the 1983 general election.\n3. The Conservative nominee was 23-year-old Jackson Carlaw. Margaret Thatcher personally helped campaign for Carlaw during the by-election. He later became an MSP and one-time leader of the Scottish Conservative Party.\n4. The Liberal Party candidate, representing the SDP-Liberal Alliance, was Graham Watson. He had, as an Independent Liberal candidate, stood in the Glasgow Central constituency, in a by-election on 29 June 1980.\nHe subsequently became a prominent figure in the politics of the European Union.\n5. John R. Kay, a draughtsman who had become the full-time Glasgow secretary of the Communist Party of Great Britain, was born in June 1926. He was the Communist nominee in the last two elections in the Glasgow Gorbals constituency (a 1969 by-election and the 1970 general election) and all the contests in Glasgow Queen's Park (the two 1974 and the 1979 general elections, as well as the 1982 by-election).\n6. John Connell was an Independent, using the ballot paper label \"Peace and Socialist\". He later contested the 1983 Penrith and The Border by-election, the 1984 Chesterfield by-election, and the 1985 Tyne Bridge by-election.\n7. A. H. Tennent represented the Scottish Republican Socialist Party.\nPrevious election\n* Death of Frank McElhone\nResult\n}}\nAftermath\nWriting of the result of the by-election in the next day's edition of The Glasgow Herald, political correspondent called the result \"a reasonable one for the Labour Party\" adding that Labour's leader Michael Foot would be perfectly pleased with it. On the other hand, he argued that it was \"a bad result for the Conservatives\", but noted that the party \"could really have expected little more in an area like Queen's Park.\" He considered the result a good one for the SNP, which \"could not have come at a better time with their internal problems once again in the news.\" He also speculated that the SNP's performance could \"revive thoughts of devolution in the minds of some Labour politicians who have been keeping conspicuously quiet on the subject as of late.\" another Glasgow newspaper, the Evening Times, reported that Labour's \"majority was substantially bigger than party analysts had predicted.\"\nHelen McElhone's election meant that the number of female MP's in Scotland was increased to two, as Judith Hart had been the only woman returned in Scotland at the 1979 general election\nSee also\n* Glasgow Queen's Park constituency\n* Lists of United Kingdom by-elections\n* United Kingdom by-election records\nReferences\n* British Parliamentary Election Results 1974–1983, compiled and edited by F.W.S. Craig (Parliamentary Research Services 1984).\n* Times Guide to the House of Commons, 1979 and 1983 editions\nExternal links\n*[https://web.archive.org/web/20090821055356/http://www.by-elections.co.uk/glasgowqueens82.html Campaign literature from the by-election]"
    }
  ]
}