{
  "content": [
    {
      "type": "text",
      "text": "# 1982 Vickers Viscount hijacking\n\n| summary = Failed highjacking by Zheng Yanwu to redirect the plane to Taiwan\n| site = Over Wuxi, Jiangsu, China\n| mapframe = no\n| aircraft_type = Vickers Viscount\n| origin = Shanghai Hongqiao International Airport, Shanghai, China\n| destination = Beijing Xijiao Airport, Beijing, China\n| tail_number = 50258\n| operator = People's Liberation Army Air Force\n| fatalities = 1 (Highjacker)}}\nThe 1982 Vickers Viscount hijacking was an aircraft incident on board a Chinese People's Liberation Army Air Force flight from Shanghai Hongqiao International Airport to Beijing Xijiao Airport which occurred on July 30, 1982. As the aircraft was flying over Wuxi, Zheng Yanwu, a security officer accompanying the delegation, highjacked the Vickers Viscount aircraft numbered 50258. In the end, Zheng Yanwu was killed.\nBackground\nOn July 30, 1982, a senior military delegation from Uganda, led by a Ugandan Army Major General visiting China, concluded their visit to Shanghai and took the Viscount aircraft No. 50258 to Beijing to participate in the Chinese People's Liberation Army's 'August 1st' Army Day commemoration activities.\nHighjacking\nAt 9:12 on July 30, 1982, the airport dispatch centre issued the takeoff command, and the Viscount took off. Twenty minutes after takeoff, Zheng Yanwu rushed into the cockpit, locked the door from the inside, poured a bottle of gasoline on the floor, drew a loaded pistol with his right hand, and took out a lighter with his left. Zheng Yanwu removed the headset from pilot Lan Dingshou and demanded that the plane change course 150° and head for Taiwan Taoyuan Airport. Zhang Jinghai immediately reported to the ground and the rear cabin, but Zheng Yanwu discovered this. Zhang Jinghai was forced to remove his headset, and all communication between the front cabin, rear cabin, and the ground was completely cut off. While Zheng Yanwu wiped his sweat, Lan Dingshou turned off the switch for the right rudder compass, and Zhang Jinghai operated the plane using the left compass switch. The plane did not fly to Taiwan.\nLan Dingshou and Zhang Jinghai quietly turned on the autopilot, switched on the ventilation to let the gasoline evaporate quickly, unbuckled their seatbelts, and used the seat adjustment switch to move their seats to the farthest position. After a half-hour standoff, the plane flew near Taiping Lake between the Huangshan and  Jiuhua mountains in Anhui. Lan Dingshou pretended that they had reached the seaside. When Zheng Yanwu looked forward, Lan Dingshou and Zhang Jinghai took the opportunity to overpower him. Zheng Yanwu fired several shots; Zhang Jinghai was shot in the right leg, and Lan Dingshou's flight suit over his chest and abdomen was pierced by a bullet but he was not injured. The remaining shots hit the cabin equipment and walls. During the struggle, the cockpit door was broken open, and navigator Liu Tiejun killed Zheng Yanwu with an axe. Eventually, the plane was flown by Lan Dingshou to Nanjing Daxiaochang Airport.\nCommendations\nAt the Air Force's celebration ceremony, the crew of the Viscount was awarded the title of 'Hero Crew'; Zhang Jinghai and Lan Dingshou were awarded the title of 'Anti-Hijacking Heroes' and received the First-Class Hero Medal of the Central Military Commission; Liu Tiejun and other crew members were commended and awarded by the Air Force.\nReferences"
    }
  ]
}