{
  "content": [
    {
      "type": "text",
      "text": "# 1985 King George VI and Queen Elizabeth Stakes\n\nThe 1985 King George VI and Queen Elizabeth Stakes was a horse race held at Ascot Racecourse on Saturday 27 July 1985. It was the 35th running of the King George VI and Queen Elizabeth Stakes.\nThe winner was Lady Beaverbrook's Petoski, a three-year-old bay colt trained at West Ilsley in Berkshire by Dick Hern and ridden by the Scottish jockey Willie Carson. Petoski's victory was the first in the race for his owner, and the fourth for Hern after Brigadier Gerard (1972), Troy (1979) and Ela-Mana-Mou (1980). in 1982. Troy and Ela-Mana-Mou had also been ridden to victory by Willie Carson.\nThe contenders\nThe race attracted a field of twelve runners, seven trained in the United Kingdom, two in France, two in Ireland and one in Japan. The favourite was the Henry Cecil-trained Oh So Sharp, a three-year-old filly owned by the Sheikh Mohammed who had won the 1000 Guineas and Epsom Oaks. The Irish challengers were Law Society who had finished second in the Epsom Derby before winning the Irish Derby, and Princess Pati the winner of the 1984 Irish Oaks. France was represented by the former Australian Horse of the Year Strawberry Road and Treizieme, a filly who had won the Grand Critérium in 1983. The Japanese challenger was the three-year-old Sirius Symboli, winner of the Japanese Derby. Apart from Oh So Sharp, the best of the British-trained runners appeared to be the Coronation Cup winner Rainbow Quest (accompanied by his pacemaker August) and Petoski, who had recovered from a poor run in the Derby to win the Princess of Wales's Stakes and who was expected to be suited by the prevailing firm ground. The other runners were Crazy (Ebor Handicap), Raft (Prix de la Côte Normande) and Infantry (Dee Stakes). A notable absentee was the Derby winner Slip Anchor who had been an intended runner before he was ruled out with a leg injury. Oh So Sharp headed the betting at odds of 4/5 ahead of Law Society (3/1) with Strawberry Road, Petoski and Rainbow Quest next in the betting at 12/1.\nThe race\nAs expected, August took the lead shortly after the start and set a very fast pace from Infantry. The pacemaker weakened with half a mile to run and was overtaken by Infantry, who led the field into the straight ahead of Oh So Sharp and Rainbow Quest on the outside, with Petoski making progress along the rail. Oh So Sharp took the lead with a furlong to run but was immediately challenged by Rainbow Quest as Willie Carson switched left on Petoski to make his challenge on the outside. The favourite successfully repelled the challenge of Rainbow Quest but was caught in the final strides by Petoski who won by a neck with three-quarters of a length back to Rainbow Quest in third place. Law Society finished strongly to take fourth from Raft and Strawberry Road with a gap of four lengths back to the weakening Infantry in seventh. There were further gaps back to Sirius Symboli, Trezieme, Crazy and Princess Pati, with August finishing last. The winning time of 2:26.71 was the second fastest in the race's history up to that time behind Grundy's 2:26.98 in 1975.\nRace details\n* Sponsor: De Beers\n* First prize: £134,274\n* Surface: Turf\n* Going: Firm\n* Distance: 12 furlongs\n* Number of runners: 12\n* '''Winner's time: 2:27.61\nFull result\n{| class = \"sortable\" | border=\"1\" cellpadding=\"0\" style=\"border-collapse: collapse;\"\n|-  style=\"background:#7d7; text-align:center;\"\n! style=\"width:35px;\"| Pos.\n! style=\"width:45px;\"| Marg.\n! style=\"width:160px;\"| Horse (bred)\n! style=\"width:30px;\"| Age\n! style=\"width:160px;\"| Jockey\n! style=\"width:210px;\"| Trainer (Country)\n! style=\"width:50px;\"| Odds\n|-\n| 1\n|\n| Petoski (GB)\n| 3\n| Willie Carson\n| Dick Hern (GB)\n| 12/1\n|-\n| 2'\n| nk\n| Oh So Sharp (GB)\n| 3\n| Steve Cauthen\n| Henry Cecil (GB)\n| 4/5 fav\n|-\n| 3\n| ¾\n| Rainbow Quest (USA)\n| 4\n| Walter Swinburn\n| Jeremy Tree (GB)\n| 12/1\n|-\n| 4\n| 1½''\n| Law Society (USA)\n| 3\n| Pat Eddery\n| Vincent O'Brien (IRE)\n| 3/1\n|-\n| 5\n| 1½\n| Raft (USA)\n| 4\n| Greville Starkey\n| Guy Harwood (GB)\n| 22/1\n|-\n| 6\n| hd\n| Strawberry Road (AUS)\n| 6\n| Yves Saint-Martin\n| Patrick Biancone (FR)\n| 12/1\n|-\n| 7\n| 4\n| Infantry (GB)\n| 3\n| Brent Thomson\n| Barry Hills (GB)\n| 33/1\n|-\n| 8\n| 15\n| Sirius Symboli (JPN)\n| 3\n| Y. Okabe\n| T. Nihonyanagi (JPN)\n| 100/1\n|-\n| 9\n| 5\n| Treizieme (USA)\n| 4\n| Alain Lequeux\n| Maurice Zilber (FR)\n| 66/1\n|-\n| 10\n| 2\n| Crazy (FR)\n| 4\n| Lester Piggott\n| Robert Armstrong (GB)\n| 22/1\n|-\n| 11\n| 6\n| Princess Pati (IRE)\n| 4\n| Pat Shanahan\n| Con Collins (IRE)\n| 100/1\n|-\n| 12\n| 6\n| August (USA)\n| 4\n| Steve Raymont\n| Jeremy Tree (GB)\n| 1000/1\n|}\n* Abbreviations: nse = nose; nk = neck; shd = head; hd = head; dist = distance; UR = unseated rider\nWinner's details\nFurther details of the winner, Petoski\n* Sex: Colt\n* Foaled: 24 February 1982\n* Country: United Kingdom\n* Sire: Niniski; Dam: Sushila (Petingo)\n* Owner: Lady Beaverbrook\n* Breeder: Kirsten Rausing\nReferences"
    }
  ]
}