{
  "content": [
    {
      "type": "text",
      "text": "# 1986 Bangladeshi presidential election\n\nPresidential elections were held in Bangladesh on 15 October 1986. The result was a victory for incumbent Hussain Muhammad Ershad, who had assumed the office in 1983 following a military coup. Ershad reportedly received 84% of the vote with a voter turnout of 55%. However the elections were controversial as they were boycotted by all major opposition candidates and there were reports of irregularities.\nBackground\nIn 1982 a coup d'état led by Army Chief Hussain Muhammad Ershad overthrew democratically elected President Abdus Sattar. Parliament was dissolved and all political activity was banned. Ershad appointed Justice A. F. M. Ahsanuddin Chowdhury as President on 27 March 1982, a position which he held until December 1983 when Ershad assumed the presidency himself. In 1983 Ershad promised to hold presidential elections in May 1984 and to restore parliamentary government the following year. However, neither elections were held until 1986.\nAmid opposition from the general public, Ershad aimed to legitimise his regime by holding a referendum in March 1985. The official result of the referendum was overwhelmingly in support of his regime, however there were allegations of large-scale vote rigging.\nErshad planned to hold presidential elections in early 1986, but was faced with vigorous opposition from the Awami League-led eight-party alliance, Bangladesh Nationalist Party-backed seven-party alliance and the left-leaning five-party alliance, which all demanded the lifting of martial law and the holding of parliamentary elections prior to a presidential election. On 1 January 1986 Ershad formed Jatiya Party (Ershad) to represent his interests in elections and, conceding to opposition demands, parliamentary elections were held on 7 May 1986, which were won by Ershad's Jatiya Party. However the result was controversial as the elections were boycotted by the BNP and Awami League, which accused the Jatiya Party of election rigging. A British team of observers termed the elections a \"tragedy for democracy\" and a \"cynically frustrated exercise\".\nErshad resigned as Chief of Army Staff on 30 August 1986 and, with the approval of the new parliament, a presidential election was scheduled for 15 October 1986. However, the election was boycotted by all major opposition party candidates, who demanded the lifting of martial law.\nResults\nThe elections saw Ershad win in a landslide victory, reportedly receiving 84% of the vote. However, the result was viewed with scepticism, with reports of widespread irregularities. The New York Times reported that voter turnout was much lower than the government claimed and that very few people were able to vote in Dhaka due to an opposition-sponsored strike. The newspaper also reported that election officials were seen putting ballots in the boxes themselves and that \"reporters saw voter sheets in which all the votes on one page were listed as having been cast, while almost none of the voters on another page had voted, suggesting that officials had marked up the lists themselves\". Some people were seen with more than one purple stamp on their hands, suggesting that they had been able to vote more than once.\nDespite the opposition boycott and reports of widespread irregularities, Ershad claimed victory stating \"This is the day that we negotiated the last bridge toward a democratic government. Today my pledge to the nation stands fulfilled.\"\nAftermath\nIn November 1986 Parliament passed the seventh constitutional amendment bill, protecting Ershad and his regime from prosecution for actions taken under the years of military rule. Martial law was subsequently lifted on 11 November.\nIn July 1987 the opposition groups united to lead mass demonstrations and strikes in opposition to the Ershad regime. Ershad declared a state of emergency on 27 November. Parliament was dissolved on 6 December, and parliamentary elections were held in March 1988. All major political parties refused to participate resulting in a victory for Jatiya Party (Ershad).\nIn 1988 Parliament passed the eighth amendment to the Constitution, which made Islam the state religion, in contravention of the original secular nature of the Constitution.\nIn 1990 a popular mass uprising led by future Prime Ministers Khaleda Zia and Sheikh Hasina led to Ershad resigning from the Presidency, and the country returning to parliamentary democracy, with the Office of the President becoming a largely ceremonial one.\nReferences"
    }
  ]
}