{
  "content": [
    {
      "type": "text",
      "text": "# 1987 South Korean presidential election\n\n| popular_vote1 = 8,282,738\n| percentage1 = 36.64%\n| image2 = Kim Young-sam presidential portrait (cropped).jpg\n| nominee2 = Kim Young-sam\n| party2 = Reunification Democratic Party\n| popular_vote2 = 6,337,581\n| percentage2 = 28.04%\n| image4 = Kim Dae-jung presidential portrait.jpg\n| nominee4 = Kim Dae-jung\n| party4 = PeaceDemocratic\n| popular_vote4 = 6,113,375\n| percentage4 = 27.05%\n| image5 = Kim Jong-pil.png\n| nominee5 = Kim Jong-pil\n| party5 = New Democratic Republican Party\n| popular_vote5 = 1,823,067\n| percentage5 = 8.07%\n| map =\n| title = President\n| before_election = Chun Doo-hwan\n| before_party = Democratic Justice Party\n| after_election = Roh Tae-woo\n| after_party = Democratic Justice Party\n}}\nPresidential elections were held in South Korea on 16 December 1987. They marked the establishment of the Sixth Republic, as well as the end of the authoritarian rule that had prevailed in the country for all but one year since its founding in 1948. They were the first direct presidential elections since 1971. During the intervening period, presidents had been indirectly elected by the National Conference for Unification, an electoral college dominated by the governing party.\nThe elections took place following a series of protests and before the 1988 Summer Olympics, which would be held in Seoul. Roh Tae-woo of the governing Democratic Justice Party won the elections with 37% of the vote. The two major opposition candidates, Kim Young-sam and Kim Dae-jung, received over 55% of the vote between them. Voter turnout was 89%.\nBackground\nin 1987, Chun Doo-hwan. His term expired on 25 February 1988.]]\nThe elections were held following a series of nationwide protests for free and fair elections and civil liberties. This period from 10 to 29 June became known as the June Struggle, and protestors were successful in persuading the regime of then President Chun Doo-hwan, and his designated successor Roh Tae-woo to accede to key demands and create the 9th amendment of the constitution.\nProcess of constitutional revision\nUnder the presidency of Chun Doo-hwan, the constitution was rewritten to be somewhat less authoritarian than Park's Yushin Constitution. The revised document protected the secrecy of correspondence, banned torture, and voided confessions obtained by force. It also restricted the presidency to a single seven-year term, and stipulated that any amendment to extend the president's term would not apply to the incumbent, preventing any attempt to allow Chun to run again in 1987. At the same time, the presidency retained fairly broad powers, including the right to dissolve the legislature, suspend constitutional freedoms in time of emergency, and amend or abolish laws in time of crisis. During this time, legislation such as the Basic Press Law, which closed hundreds of media organizations, was passed.\nHowever, following the success of the opposition New Korean Democratic Party (NKDP) in the National Assembly elections in April 1985, calls were made for constitutional changes. On 13 April 1986 Chun made a speech defending the constitution, stating that the successor to the presidency would be a member of his own party, the Democratic Justice Party (DJP), and that any constitutional debate would be put off until the end of the 1988 Olympics, which South Korea was to host. In its argument, the DJP argued that the opposition was splintered, and could not act as a negotiating partner. They believed that political uncertainty would injure both the Olympic setup and the upcoming election.\nNearly a month later on 10 June, mass protests broke out as Roh Tae-woo, the chair of the DJP, was announced as Chun's successor. The public nature of the announcement and the death of a university student who was tortured by the police triggered protests across Korea. In the following weeks, multiple protests were held, and on 29 June Roh capitulated to demands for constitutional amendments, proposing an eight-point plan. It included the following concessions:\n* Direct participation in upcoming presidential election for all citizens over age 20\n* Freedom of candidacy and fair competition\n* Amnesty for Kim Dae-jung and other political prisoners\n* Protection of human dignity and promotion of basic human rights\n* Freedom of the press and abolishment of the restrictive Basic Press Law (see: Media of South Korea)\n* Educational autonomy and local self-government\n* The creation of a new political climate for dialogue and compromise\n* Commitment to enact bold social reforms to build a clean, honest, and more just society.\nThe new constitutional amendment was ratified by the National Assembly on 12 October, and was submitted to a referendum to the South Korean public on 27 October. 93% of voters cast ballots in favor of the amendment, which permitted the direct, democratic election of the 6th President of South Korea. The new constitution reduced the presidential term to five years, and retained the 1980 document's ban on any sort of presidential re-election. The president also lost the right to suspend constitutional freedoms and dissolve the legislature. While the president retained the right to take emergency measures, it also required them to submit such measures to the National Assembly; any measures not approved by the legislature could be revoked.\nPresidential nominations\nDemocratic Justice Party\nThe Democratic Justice Party (DJP) National Convention was held on 10 June at Jamsil Gymnasium in Seoul. At the convention, 7,378 delegates nominated former Commander of Capital Defense Roh Tae-woo, who was the only option on the ballot paper, for president.\nNew Democratic Republican Party\nThe New Democratic Republican Party (NDRP) National Convention was held on 30 October at Heungsadan Hall in Seoul. Kim Jong-pil, former prime minister and former five-term lawmaker from South Chungcheong, was chosen as the party's candidate.\nReunification Democratic Party\nThe Reunification Democratic Party (RDP) National Convention was held on 9 November at Sejong Center for Performing Arts in Seoul. Kim Young-sam, a former seven-term lawmaker from Busan, was nominated for president by the acclamation of 1,203 delegates.\nPeace Democratic Party\nThe Peace Democratic Party (PDP) National Convention was held on 12 November at Sejong Center for Performing Arts in Seoul. Kim Dae-jung, a former four-term lawmaker from South Jeolla and 1971 presidential candidate, was nominated for president.\nCampaign\nAs only a minority of votes would be required to win under the first-past-the-post system, the candidates sought to maximise regional and partisan appeal to maximise their votes.\nKim Young-sam\nKim, viewed as a more moderate, pragmatic politician and open to compromise, attracted the backing of senior retired military figures opposed to the incumbent government, and South Korea's growing middle class who wanted an end to the military in politics, and in particular, urban white collar workers seeking stability to continue economic growth. Kim's middle-class base also included strength among the large Protestant population. Kim's main base of support came from his native South Gyeongsang Province and the city of Busan. In particular, Jeong Seung-hwa, the former army chief of staff falsely accused of plotting Park Chung Hee's assassination which Chun and Roh used to justify their power grab in 1979, came out to support Kim.\nKim Jong-pil\nKim, who was an associate of former president and dictator Park Chung Hee campaigned on Park's legacy of economic development which transformed South Korea from a mainly agriculture economy into a modern industrialized economy and major trading power. He promised to continue Park's policy framework, appealing to some conservative elements of South Korea's middle class. His main base of support came from his home province of South Chungcheong Province, particularly in the major city of Daejeon.\nKim Dae-jung\nKim, a devout Roman Catholic, campaigned on liberal democracy, social welfare, and a free-market economy. However, he was widely seen as a radical, and the candidate which the military feared would win, along with many middle-class voters. Despite attempts to moderate that image, he attracted most appeal among the dissident movement, such as human rights activists, students, organized labor, and lower-income voters. Kim's strongest support came from North and South Jeolla Provinces, his home region. He was expected to receive 80 to 90 percent of the Jeolla vote, and do well in the capital Seoul and Gyeonggi Province.\nRoh Tae-woo\nRoh Tae-woo worked hard to dissociate himself from the widely unpopular Chun Doo-hwan. Roh promised continued democratization and economic reforms, while emphasizing stability. The ruling DJP's support base came from the rural areas, the farming population which made up 20 percent of the total population, while in urban areas, Roh attracted conservative middle-class voters and less-educated, low-income workers. Roh's home base was North Gyeongsang Province, where the major city of Daegu, his hometown, is situated. Daegu was also the home town of Chun and Park Chung Hee. Roh was expected to dominate in  Gangwon Province as it borders North Korea and is strongly anticommunist; the island province of Jeju; and North Chungcheong Province.\nResults\nBy province and city\n{| class=\"wikitable nowrap sortable\" style=\"text-align:right;\"\n|-\n! rowspan=\"3\" | Province/City\n! colspan=2 class=\"unsortable\" | Roh Tae-woo\n! colspan=\"2\" class=\"unsortable\" | Kim Young-sam\n! colspan=\"2\" class=\"unsortable\" | Kim Dae-jung\n! colspan=\"2\" class=\"unsortable\" | Kim Jong-pil\n! colspan=\"2\" class=\"unsortable\" | Shin Jeong-yil\n|-\n! colspan=2 style=\"background:\" |\n! colspan=2 style=\"background:\" |\n! colspan=2 style=\"background:\" |\n! colspan=2 style=\"background:\" |\n! colspan=\"2\" style=\"background:darkred\" |\n|-\n! width=\"75px\" | Votes\n! %\n! width=\"75px\" | Votes\n! %\n! width=\"75px\" | Votes\n! %\n! width=\"75px\" | Votes\n! %\n! width=\"75px\" | Votes\n! %\n|-\n| align=\"left\" style=\"text-align:left\" | Seoul\n|1,682,824\n|29.95\n|1,637,347\n|29.14\n| bgcolor=\"\" |1,833,010\n| bgcolor=\"\" |32.62\n|460,988\n|8.20\n|4,560\n|0.08\n|-\n| align=\"left\" style=\"text-align: left;\" |Busan\n|640,622\n|32.11\n| bgcolor=\"\" |\n| bgcolor=\"\" |\n|182,409\n|9.14\n|51,663\n|2.59\n|3,612\n|0.18\n|-\n| align=\"left\" style=\"text-align: left;\" |Daegu\n| bgcolor=\"\" |\n| bgcolor=\"\" |\n|274,880\n|24.28\n|29,831\n|2.64\n|23,230\n|2.05\n|3,774\n|0.33\n|-\n| align=\"left\" style=\"text-align: left;\" |Incheon\n| bgcolor=\"\" |\n| bgcolor=\"\" |\n|248,604\n|29.99\n|176,611\n|21.31\n|76,333\n|9.21\n|1,126\n|0.14\n|-\n| align=\"left\" style=\"text-align: left;\" |Gwangju\n|22,943\n|4.82\n|2,471\n|0.52\n| bgcolor=\"\" |449,554\n| bgcolor=\"\" |94.41\n|1,111\n|0.23\n|74\n|0.02\n|-\n| align=\"left\" style=\"text-align: left;\" |Gyeonggi\n| style=\"background:; color:white;\" |1,204,235\n| style=\"background:; color:white;\" |41.45\n|800,274\n|27.55\n|647,934\n|22.30\n|247,259\n|8.51\n|5,621\n|0.19\n|-\n| align=\"left\" style=\"text-align: left;\" |Gangwon\n| style=\"background:; color:white;\" |546,569\n| style=\"background:; color:white;\" |59.53\n|240,585\n|26.20\n|81,478\n|8.87\n|46,954\n|5.11\n|2,628\n|0.29\n|-\n| align=\"left\" style=\"text-align: left;\" |North Chungcheong\n| style=\"background:; color:white;\" |355,222\n| style=\"background:; color:white;\" |46.90\n|213,851\n|28.23\n|83,132\n|10.98\n|102,456\n|13.53\n|2,796\n|0.37\n|-\n| align=\"left\" style=\"text-align: left;\" |South Chungcheong\n|402,491\n|26.22\n|246,527\n|16.06\n|190,772\n|12.43\n| bgcolor=\"\" |\n| bgcolor=\"\" |\n|3,902\n|0.25\n|-\n| align=\"left\" style=\"text-align: left;\" |North Jeolla\n|160,760\n|14.14\n|17,130\n|1.51\n| bgcolor=\"\" |948,955\n| bgcolor=\"\" |83.46\n|8,629\n|0.76\n|1,501\n|0.13\n|-\n| align=\"left\" style=\"text-align: left;\" |South Jeolla\n|119,229\n|8.17\n|16,826\n|1.15\n| bgcolor=\"\" |1,317,990\n| bgcolor=\"\" |90.28\n|4,831\n|0.33\n|994\n|0.07\n|-\n| align=\"left\" style=\"text-align: left;\" |North Gyeongsang\n| style=\"background:; color:white;\" |1,108,035\n| style=\"background:; color:white;\" |66.39\n|470,189\n|28.17\n|39,756\n|2.38\n|43,227\n|2.59\n|7,812\n|0.47\n|-\n| align=\"left\" style=\"text-align: left;\" |South Gyeongsang\n|792,757\n|41.17\n| bgcolor=\"\" |\n| bgcolor=\"\" |\n|86,804\n|4.51\n|51,242\n|2.66\n|7,567\n|0.39\n|-\n| align=\"left\" style=\"text-align: left;\" |Jeju\n| style=\"background:; color:white;\" |120,502\n| style=\"background:; color:white;\" |49.77\n|64,844\n|26.78\n|45,139\n|18.64\n|10,930\n|4.51\n|683\n|0.28\n|- class=\"sortbottom\"\n! colspan=\"11\" |\n|- class=\"sortbottom\" style=\"font-weight:bold; background:#E9E9E9;\"\n| align=\"left\" | Total\n| style=\"background:; color:white;\" |8,282,738\n| style=\"background:; color:white;\" |36.64\n| 6,337,581\n| 28.04\n| 6,113,375\n| 27.05\n| 1,823,067\n| 8.07\n|46,650\n|0.21\n|- class=\"sortbottom\"\n| colspan=\"11\" align=\"left\" | Source: [http://info.nec.go.kr/ National Election Committee]\n|}\nPlanned rigging of results in event of opposition win\nAccording to American Central Intelligence Agency (CIA) documents obtained by Hong Kong's South China Morning Post through a freedom of information request in July 2019, the military-backed ruling forces feared the loss of its hand-picked candidate Roh Tae-woo that it drew up detailed plans to fix the election result. The CIA briefing added that a \"plan for extensive fraud is already being implemented\".\nThe brief added that the government was \"considering black propaganda and dirty tricks, reportedly to include ballot tampering; some officials now appear prepared to go even further\" and \"ruling-camp planners have thought about fabricating evidence of ruling-party fraud to give Chun an opportunity to declare the election null and void if government projections from early returns indicate Roh is losing\".\nThe documents suggested that the government was prepared to crack down hard on any unrest following the vote, with an Intel briefing stating that an \"open arrest order\" had been prepared for opposition candidate Kim Dae-jung if he tried to \"instigate a popular revolt against the election results\".\nReaction\nAccording to Lynn Turk, at the time a Seoul-based US State Department foreign service officer who watched the campaign and the election closely on a moment-to-moment basis noted the allegations as \"a very interesting story\", but stated \"the votes were counted fairly and Roh really did win fair and square.\" He added: \"On election night each of the four parties had observers at each polling place and got a carbon copy of the public hand-counted vote. So the totals their command posts registered matched the official count.\"\nPark Chul-un, brother-in-law and aide to Roh Tae-woo, said 'no election fraud was planned or carried out' in the 1987 election in response to the SCMP report.\nReferences"
    }
  ]
}