{
  "content": [
    {
      "type": "text",
      "text": "# 1988 Sri Lankan presidential election\n\n25.74 pp)\n| image1 = File:President premadasa.jpg\n| nominee1 = Ranasinghe Premadasa\n| party1 = United National Party\n| popular_vote1 = 2,569,199\n| percentage1 = 50.43%\n| image2 = Sirimavo Bandaranaike, Prime Minister of Ceylon 1960 (cropped).PNG\n| nominee2 = Sirimavo Bandaranaike\n| party2 = Sri Lanka Freedom Party\n| popular_vote2 = 2,289,860\n| percentage2 = 44.95%\n| map_image = Sri Lankan Presidential Election 1988.png\n| map_caption = Results by polling division\n| title = President\n| before_election = J. R. Jayewardene\n| after_election = Ranasinghe Premadasa\n| before_party = United National Party\n| after_party = United National Party\n}}\nPresidential elections were held in Sri Lanka on 19 December 1988. This was the 2nd Presidential election held in the country's history, and the Nominations were accepted on 10 November 1988. Prime Minister Ranasinghe Premadasa of the governing United National Party was elected, receiving 50.4% of all votes cast and defeating both the Sri Lanka Freedom Party candidate, former Prime Minister Sirimavo Bandaranaike, and the Sri Lanka Mahajana Pakshaya candidate, Ossie Abeygunasekera.\nThe election was held amidst both the Sri Lankan Civil War and the 1987–1989 JVP insurrection. Voter turnout was only 55%, substantially lower than the previous election and the lowest turnout for a Sri Lankan presidential election.\nBackground\nUnder the Provisions of the Constitution, the president is elected to a six-year term and the president can call for an early presidential election after completing four years of his first term. Then-incumbent president J. R. Jayawardene was inaugurated for a second term on 4 February 1983, and he was Constitutionally barred from seeking a third term in office. Therefore, the next election was scheduled to take place between 4 December 1988, and 4 January 1989.\nJayawardene initially hinted at seeking a third term by amending the constitution ahead of the Presidential Election. However, citing his advanced age and the fragile political climate, Jayewardene eventually abandoned these plans and chose to endorse Prime Minister Ranasinghe Premadasa as the United National Party (UNP) candidate.\nNominations were accepted from 9.00am to 11.00am IST, on 10 November 1988, and the Date of the election was announced by the Gazette Extraordinary No.531/12, on 11 November 1988.\nThe 1988 Sri Lankan presidential election was held against a backdrop of severe political and social unrest. The country was in the midst of a violent insurgency led by the Janatha Vimukthi Peramuna (JVP), whose second uprising from 1987 to 1989 involved widespread assassinations, attacks on security forces, and targeted violence against civilians. The insurgency contributed to a climate of fear and intimidation, which affected daily life and the political process.\nAt the same time, Sri Lanka was engaged in an ongoing civil war with the Liberation Tigers of Tamil Eelam (LTTE), who sought an independent Tamil state in the north and east, leading to widespread violence, displacement, and military operations. Sri Lanka faced heightened ethnic tensions and political polarization following the Indo-Sri Lanka Accord of 1987 and the deployment of the Indian Peace Keeping Force (IPKF) in the north and east. Opposition among Sinhalese nationalist groups further destabilized the political environment.\nThe election itself was marred by allegations of intimidation and manipulation. Reports indicated that both violence and coercion, including suppression of opposition supporters and manipulation of election procedures, influenced voter turnout and the conduct of the election. These factors, combined with the ongoing civil conflict and economic difficulties, shaped the highly contested and controversial nature of the 1988 presidential election. Sirimavo Bandaranaike, the SLFP candidate, publicly accused the government of manipulating the election, alleging that the 1988 presidential poll was rigged in favor of her opponent.\nBoth major party candidates promised to abrogate the Indo-Sri Lanka Accord negotiated by outgoing president J. R. Jayewardene and would ask Indian troops to leave the country. Voting was not held in the LTTE-controlled areas of the north and east.\nPremadasa was declared the winner of the election on 20 December 1988. He was inaugurated as the 3rd President of Sri Lanka at the Octagonal Pavilion of the Sacred Temple of the Tooth on 2 January 1989.\nResults\nDespite the looming threat of the JVP insurgents, UNP candidate Ranasinghe Premadasa won a narrow but firm victory.\nReferences\n*\n*"
    }
  ]
}