{
  "content": [
    {
      "type": "text",
      "text": "# 1989 Palanca Awards\n\n| image            =\n| imagesize        =\n| previous         = 1988\n| next             = 1990\n}}\nThe 39th Don Carlos Palanca Memorial Awards for Literature was held to commemorate the memory of Don Carlos Palanca Sr. through an endeavor that would promote education and culture in the country. This year saw the inclusion of a new category, Short Story for Children/Maikling Kwentong Pambata, for both the English and Filipino Divisions.\nLIST OF WINNERS\nThe 1989 winners were divided into twelve categories, open only to English and Filipino [Tagalog] short story, short story for children, poetry, essay, one-act play, and full-length play:\nEnglish Division\nShort story\n* First Prize: César Ruiz Aquino, “Stories”'\n* Second Prize: Eli Ang Barroso, “Afternoon Fever”\n: Maria Fe G. Parco, “The 3 Juans and How They Joined the Revolution”\n* Third Prize:  Charlson Ong, “Owl”\n: Timothy Montes, “The Doubters”\nShort story for children\n* First Prize: Gretchen B. Ira, “The Great Green Grove of Ato”\n* Second Prize: Ma. Elena Paterno-Locsin, “The Boy Who Listened to the Sea”\n: Ma. Elena Paterno-Locsin, “The Offering to the Sea”\n* Third Prize: Amado Lacuesta Jr. and Andrea P. Lacuesta, “The Little Girl Who Saved her Yawn”\n: Leoncio P. Deriada, \"The Vacant Lot\"\nPoetry\n* First Prize: Francis Macansantos, “Poems in Our Own Sweet Country”\n* Second Prize: Rene Estrella Amper, “All Else is Grass”\n: Ma. Fatima V. Lim, “Angel of Stone”\n* Third Prize: Eli Ang Barroso, “Faces and Masks”\n: Clovis Nazareno, “Fear in the World”\n: Juaniyo Arcellana, “Nearness of the Sea”\nEssay\n* First Prize: Florentino Hornedo, “Discourse of Power in Florante at Laura”\n: Marjorie Evasco, “Threading Our Lives of the Story of the Open Strand”\n* Second Prize: No Winner\n* Third Prize: Jaime An Lim, “The Changing of the Guard: Three Critical Essays”\n: Florentino Hornedo, “The Visitors and the Native in Filipino Folk and Popular Literature”\nOne-act play\n* First Prize: No Winner\n* Second Prize: Bobby Flores Villasis, “Brisbane”\n* Third Prize: No Winner\nFull-length play\n* First Prize: Ametta Suarez-Taguchi, “A Time to Love”\n* Second Prize: Jessie B. Garcia, “Candle in the Wind”\n* Third Prize: Jomar Fleras, “Angst”\nFilipino Division\nMaikling Kwento\n* First Prize: Noel Salonga, “Minero”\n* Second Prize: Ariel Valerio, “Ikaw, Ang Aking Saksi”\n* Third Prize: Rowena Festin, “Ulahing”\nMaikling Kwentong Pambata\n* First prize: Edgardo B. Maranan, “Pamana ng Bundok”\n* Second prize: Pat V. Villafuerte, “Yawyawen: Munting Lam-Ang”\n* Third prize: Rene O. Villanueva, “Bertdey ni Guido”\n: Rene O. Villanueva, \"Sa Bayang Walang Batas\"\nTula\n* First Prize: Tomas F. Agulto, “Batanes at Iba pang Pulo”\n: Rolando S. Tinio, “Himutok at Iba Pa”\n* Second Prize: Merlinda Bobis, “Lupang di Hinirang”\n: Donato Mejia Alvarez, “San Isidro, Safehouse, Mga Panaginip at iba pang Tula”\n* Third Prize: Romeo J. Santos, “Ang Aking Mga Kapatid”\n: Romulo P. Baquiran Jr., “Mga Tula ng Paglusong”\nSanaysay\n* First Prize: Buenaventura S. Medina Jr., “Subersiyon ng Romansa: Kamalayang Balagtas ng Teatro...”\n* Second Prize: Anacleta Encarnacion, “Ang Abril ng Laksa-laksa Kong Pangarap”\n* Third Prize: Rolando S. Tinio, “Ang Dula sa Ating Dulaan”\nDulang May Isang Yugto\n* First Prize: Rolando Dela Cruz, “Gamugamo sa Kanto ng East Avenue”\n* Second Prize: Ramon C. Jocson, “Bulong-bulongan sa Sangandaan”\n* Third Prize: Reuel Molina Aguila, “Isang Magsasaka”\nDulang Ganap ang Haba\n* First Prize: Manuel R. Buising, “Pwera Usog”\n* Second Prize: Bonifacio Ilagan, “Muling Pag-ibig”\n* Third Prize: Dennis Marasigan, “Ang Buhay ay Pelikula”\nReferences\nSources\n*"
    }
  ]
}