{
  "content": [
    {
      "type": "text",
      "text": "# 1989 Independence Bowl\n\nThe 1989 Independence Bowl was the final Independence Bowl without sponsorship. It featured the Oregon Ducks and the Tulsa Golden Hurricane.\nBackground\nThis was Tulsa's first bowl appearance since 1976, also in the Independence Bowl. This was Oregon's first bowl game since 1963. Oregon finished tied for second in the Pacific-10 Conference with Washington (who went to the Freedom Bowl) and Arizona (who went to the Copper Bowl). This was their highest finish in the conference since 1970.\nGame summary\nBrett Adams gave Tulsa the lead with a touchdown run early in the game, but Oregon responded with two long drives that culminated with a Musgrave touchdown pass and a field goal to take a 10–7 lead. Tulsa tied the game with two minutes remaining in the second quarter to make it 10–10. But as Oregon went to punt late in the first half, Herbert Harvey blocked the punt and Derrick Williams recovered it and ran 21 yards for a touchdown that gave Tulsa a 17-10 lead heading into halftime. Adams added his second touchdown run in the third quarter to make it 24–10 Tulsa. But Oregon would score twice in six minutes on Musgrave passing and rushing touchdowns to tie the game at 24 early in the fourth quarter. With just over three minutes to play, a Tulsa fumble recovery was overturned by the officials, which kept Oregon's drive alive. That drive culminated in a field goal to give the Ducks a 27-24 lead. That field goal would prove to be the game-winner, giving Oregon their first bowl win since 1963.\nAftermath\nOregon has returned to the Independence Bowl just once since this game, in 1992. Tulsa would make its next appearance in the Independence Bowl in 2015.\nStatistics\n{| class=\"wikitable\"\n! Statistics !! Oregon  !! Tulsa\n|-\n| First Downs || 16|| 14\n|-\n| Yards Rushing|| 140|| 70\n|-\n| Yards Passing || 320|| 183\n|-\n| Total Yards || 460|| 253\n|-\n|Punts-Average ||3-23.5|| 5-34.8\n|-\n|Fumbles-Lost ||2-1|| 3-1\n|-\n|Interceptions|| 2|| 2\n|-\n|Penalties-Yards ||5-49|| 1-1\n|-\n|}\nReferences"
    }
  ]
}