{
  "content": [
    {
      "type": "text",
      "text": "# 1990 Palanca Awards\n\n| image            =\n| imagesize        =\n| previous         = 1989\n| next             = 1991\n}}\nThe 40th Don Carlos Palanca Memorial Awards for Literature was held to commemorate the memory of Don Carlos Palanca Sr. through an endeavor that would promote education and culture in the country. This year saw the inclusion of a new category, Dulang Pantelebisyon [Teleplay], for the Filipino Division.\nLIST OF WINNERS\nThe 1990 winners were divided into fifteen categories, open only to English and Filipino [Tagalog] novel, short story, short story for children, poetry, essay, one-act play, and full-length play, plus the Dulang Pantelebisyon, open only for the Filipino Division:\nEnglish Division\nNovel\n* Grand Prize: Azucena Grajo Uranza, Bamboo in the Wind\nShort Story\n* Special Prize:\n: Charlson Ong, \"A Tropical Winter's Tale\"\n: Vicar Rosales, \"Islas\"\n: Isagani R. Cruz, \"Once Upon A Time Some Years From Now\"\n: Victorino Manalo, \"The Hunting Season\"\n: Isagani R. Cruz, \"What I Did Last Summer\"\nShort Story for Children\n* First Prize: Ramon Sunico, \"Two Friends, One World\"\n* Second Prize: Alfred A. Yuson, \"The Boy Who Ate the Stars\"\n* Third Prize: Jaime An Lim, \"Yasmin\"\nPoetry\n* First Prize: Ricardo M. De Ungria, \"Body English\"\n: Ricardo M. De Ungria, \"Decimal Places\"\n* Second Prize: Jose Y. Dalisay Jr., \"Pinoy Septych and Other Poems\"\n: Jaime An Lim, \"Trios\"\n: Fidelito Cortes, \"Waitressing for the Exterminator\"\n* Third Prize: Ma. Luisa A. Igloria, \"Cartography\"\n: J. Neil C. Garcia, \"Fish Wife and Other Poems\"\n: Lina Sagaral Reyes, \"Istorya\"\nEssay\n* First Prize: Isagani R. Cruz, \"The Other Other: Towards a Post Colonial Poetics\"\n* Second Prize: Buenaventura S. Medina Jr., \"The Conscious Unconscious\"\n: Eric Gamalinda, \"The Unbearable Lightness of EDSA\"\n* Third Prize: No Winner\nOne-Act Play\n* First Prize: No Winner\n* Second Prize: No Winner\n* Third Prize: Dean Francis Alfar, \"Fragments of Memory\"\nFull-Length Play\n* Honorable Mention:\n: Bobby Flores Villasis, \"Eidolon\"\n: Wilfrido Ma. Guerrero, \"Retribution\"\nFilipino Division\nNobela\n* Honorable Mentions: Reynaldo A. Duque, Gagamba\n: Rosauro Dela Cruz, Kwadresentinyal\nMaikling Kwento\n* First Prize: Danilo Consumido, \"Agam-agam ng Isang Historyador\"\n* Second Prize: Lav Indico Diaz, \"Pula, Puti at Saka Blu, At Marami Pang Kolor\"\n* Third Prize: Henry Empeno, \"Sanlibo't Isang Gabi ng mga Palabas sa Pag-aantay...\"\nMaikling Kwentong Pambata\n* First Prize: Rene O. Villanueva, \"Ang Unang Baboy sa Langit\"\n: Rene O. Villanueva, \"Tungkung Langit at Alunsina\"\n* Second Prize: Ruben D. Canlas Jr., \"Ang mga Kagila-gilalas na Pakikipagsapalaran nina Alegria at Andante sa Bimbolimbo\"\n: Reynaldo A. Duque, \"Angalo at Aran\"\n* Third Prize: Ramon Sunico, \"Mata at Mangga\"\n: Edgardo B. Maranan, \"Si Kidlat, Si Kulog, Si Kilot\"\nTula\n* First Prize: Ruth Elynia S. Mabanglo, \"Anyaya ng Imperyalista\"\n* Second Prize: Romulo P. Baquiran Jr., \"Baryo\"\n* Third Prize: Lilia Quindoza Santiago, \"Ordinaryo at Iba pang Tula\"\nSanaysay\n* First Prize: Isagani R. Cruz, \"Ang Buhay sa Salamin ng Sining: Ang Kudeta Bilang Texto\"\n* Second Prize: Josephine Barrios, \"Ang Sinderelang Hindi Sinderela\"\n* Third Prize: Virgilio S. Almario, \"Pasyon at Katwiran sa Likod ng Salamin\"\nDulang May Isang Yugto\n* First Prize: Chris Millado, \"Usapang Babae\"\n* Second Prize: Rosauro Dela Cruz, \"Ang Pagliliwanag ng Isip ni Cecillo Segismundo\"\n* Third Prize: Bienvenido Noriega Jr., \"Naikuwento Lang sa Akin\"\nDulang Ganap ang Haba\n* First Prize: Bienvenido Noriega Jr., \"Deuterium\"\n* Second Prize: Manuel R. Buising, \"Lista sa Tubig\"\n* Third Prize: Rene O. Villanueva, \"Botong\"\nDulang Pantelebisyon\n* First Prize: Emmanuel Q. Palo, \"Ang Pagbabalik ni Kiwada\"\n: Manuel R. Buising, \"Patay-Bata\"\n* Second Prize: Eli Rueda Guieb III, \"Pilat\"\n* Third Prizes: Melchor Salandanan Ventura, \"Mrs. Raquel V. Matias\"\n: Jovenal Velasco, \"Si Tomboy, atbp.\"\n* Honorable Mentions: Rolando S. Salvana, \"Spirit\"\n: Elsa M. Coscolluela, \"Without Ceremony\"\nReferences\nSources\n*"
    }
  ]
}