{
  "content": [
    {
      "type": "text",
      "text": "# 1992 Ross Perot vice presidential candidate selection\n\nIndependent candidate Ross Perot chose retired Vice Admiral [[James Stockdale as his running mate in 1992.]]\nThis article lists running mates considered by Ross Perot during his 1992 independent candidacy for President of the United States. On March 30, 1992, Perot announced that retired vice admiral James Stockdale would serve as his \"interim\" running mate, so that Perot could qualify for the ballot in several states. At the time, Perot planned to pick a permanent running mate during the summer, around the time of the 1992 Democratic National Convention and the 1992 Republican National Convention. Perot suspended his campaign during the summer of 1992, possibly preventing him from choosing a different running mate. After he decided to run again, Perot decided to keep Stockdale as his running mate. John Silber, the president of Boston University, was also rumored as a potential running mate for Perot. Stockdale appeared at the 1992 vice presidential debate. The Perot–Stockdale ticket took 18.9% of the popular vote, but the Clinton–Gore ticket won the election.\nMedia speculation of vice presidential candidates\nFederal executive branch officials\nFile:Od jeane-kirkpatrick-official-portrait 1-255x301.jpg|alt=|}}\nFile:Portrait of Ann Dore McLaughlin, Under Secretary Dept. of Interior ME1670-10.jpg|alt=|\nFile:Bill Moyers by Gage Skidmore.jpg|alt=|\nFile:Rumsfeld1.jpg|alt=|\nMembers of Congress\nFile:Warren Rudman.jpg|alt=|\nGovernors\nFile:George Deukmejian official photograph.jpg|alt=|\nFile:Lweicker.jpg|alt=|\nOther individuals\nFile:Jesse Jackson portrait.jpg|alt=|\nFile:GEN Colin Powell.JPG|alt=|\nFile:General Norman Schwarzkopf, USA (uncovered).jpg|alt=|\nFile:Peter Ueberroth 1985.jpg|alt=|\nDeclined\nFile:Dr. Bernadine Healy (14172776968).jpg|alt=|}}\nFile:John Silber (6789866467).jpg|alt=|\nSee also\n*1992 United States presidential election\n*Ross Perot 1992 presidential campaign\nReferences"
    }
  ]
}