{
  "content": [
    {
      "type": "text",
      "text": "# 1993 Independence Bowl\n\nThe 1993 Independence Bowl was a post-season American college football bowl game between the Virginia Tech Hokies and the Indiana Hoosiers at Independence Stadium in Shreveport, Louisiana on December 31, 1993. The 18th edition of the Independence Bowl was the final contest of the 1993 NCAA Division I-A football season for both teams, and ended in a 45&ndash;20 victory for Virginia Tech. The game was the first bowl victory for Virginia Tech head coach Frank Beamer, and began a streak of 27&nbsp;consecutive bowl appearances for Virginia Tech.}}\nThe 1993 Independence Bowl kicked off at 12:30&nbsp;p.m. EST on December 31 at mid sunny skies and  temperatures. Indiana took an early 7&ndash;0 lead, but Virginia Tech responded, taking a 14&ndash;7 lead with two touchdowns—one late in the first quarter, and the other early in the second. Indiana closed the gap to 14&ndash;13 with two field goals in the second. In the final 23&nbsp;seconds of the first half, however, Virginia Tech scored an additional 14&nbsp;points. Tech's defense recovered and returned a fumble 20&nbsp;yards for a touchdown, then blocked a 51-yard field goal attempt and returned the ball 80 yards for the first blocked-kick touchdown in Virginia Tech history. After a scoreless third quarter, Virginia Tech scored 17 points in the fourth quarter to secure an insurmountable lead. Indiana scored one more touchdown and brought the game's final score to 45&ndash;20.\nThe game paid $700,000 to each team in exchange for their participation. The official attendance for the game was 33,819. Maurice DeShazo of Virginia Tech was named the game's offensive most valuable player (MVP), while Antonio Banks, also of Virginia Tech, was named the game's defensive MVP.\nSeveral Independence Bowl records were set during the game, some of which still stand. Indiana's Thomas Lewis returned eight&nbsp;punts in the game and earned 177&nbsp;receiving yards, including the third-longest pass in Independence Bowl History—a 75-yard reception from quarterback John Paci. Hokie Kicker Ryan Williams set the record for the most extra points in an Independence Bowl game with six, a mark that was tied during the 1995 Independence Bowl.\nTeam selection\nIndiana\nIndiana was coached by Bill Mallory, who would go on to accumulate the winningest record in IU football history. The Indiana Hoosiers football team ended the 1992 college football season with a record of 5&ndash;6, and prior to the 1993 season was picked to finish no better than eighth in the 11-team Big Ten conference during the regular season. From the start, however, Indiana set out to upset those expectations. Indiana raced out to a 3&ndash;0 record in the first three games of the season, with the third win coming against Southeastern Conference opponent Kentucky.\nIn the fourth week of the season, however, Indiana suffered its first loss: a 27&ndash;15 conference defeat at the hands of No.&nbsp;22 Wisconsin. The Hoosiers recovered from the setback, however, and won their next four games—all of which were against Big Ten opponents. The fourth of those victories came against the Michigan State Spartans, who had replaced Wisconsin at the No.&nbsp;22 spot in the country. Indiana held the Spartans scoreless in a tough defensive battle, earning a 10&ndash;0 victory. With a 7&ndash;1 record, Indiana appeared to be in position to compete for the Big Ten championship, but consecutive losses to highly ranked Penn State and Ohio State put an end to any thoughts of a championship. The Hoosiers ended the season with a 24&ndash;17 win over traditional rival Purdue and accepted a bid to the Independence Bowl.\nVirginia Tech\nThe Virginia Tech Hokies football team ended the 1992 college football season with a record of 2&ndash;8&ndash;1. Some Tech fans called for Tech head coach Frank Beamer's firing after the worst Tech football season since 1987, but Tech athletic director Dave Braine refused to do so. After a shakeup that saw several assistant coaches replaced and new defensive and offensive formations implemented, Tech players and coaches promised a \"complete turnaround\" for the 1993 season.\nIn the first two games of the season, Tech followed through on that promise, winning 33&ndash;16 and 63&ndash;21 against Bowling Green and Pittsburgh, respectively. A loss to No.&nbsp;3 Miami followed, but a victory over Maryland in the game that followed gave Tech a 3&ndash;1 record, already better than its 1992 win total. After a close loss at No.&nbsp;14 West Virginia that was determined by a missed last-second field goal by Tech placekicker Ryan Williams, the Hokies won five of their last six regular-season games. These wins included victories over Big East opponent Syracuse and No.&nbsp;23 Virginia, Tech's traditional rival. With an 8&ndash;3 regular-season record and ranked No.&nbsp;22 in the country by the Associated Press, Tech was extended an invitation to the Independence Bowl, its first bowl bid since the 1986 Peach Bowl.\nPregame buildup\nThe matchup of No.&nbsp;21 Indiana and No.&nbsp;22 Virginia Tech was the first matchup of ranked teams in Independence Bowl history. Despite that fact, the bowl had difficulty selling tickets for the game. Slightly more than 33,000&nbsp;tickets were sold by the day of the game, far less than the stadium's 50,459-seat capacity. In exchange for their participation in the game, each team received $700,000, the minimum payout required by the NCAA at that time. Spread bettors favored Virginia Tech to win by three points. The matchup was Indiana's first time playing Virginia Tech, and was the first time Virginia Tech played any team from the Big Ten.\nVirginia Tech's turnaround from a 2&ndash;8&ndash;1 season in 1992 was the largest single-season turnaround in school history and was the second-best in the country that year. Tech hoped to improve upon a 1&ndash;4 all-time record in bowl games, while Indiana hoped to do likewise for its 3&ndash;4 historical bowl-game record. In the week prior to the game, bad weather in Virginia caused travel delays that prevented many fans and the Virginia Tech marching band from arriving at the game early. Two days prior to the Independence Bowl, Tech was shocked by the death of Dr. Richard Bullock, who served as the team's physician from 1971 to 1988. Bullock designed a special football neck protector worn by players during the 1980s and 1990s before being phased out in favor of more advanced padding.\nIndiana offense\nIndiana's offense averaged 21.6&nbsp;points and 320&nbsp;total yards per game during the regular season, good enough for ninth in the Big Ten. As a whole, the Hoosiers accumulated 3,818&nbsp;yards of offense before the Independence Bowl. 2,156&nbsp;yards of this total were passing yards and came through the air, while the remaining 1,662&nbsp;yards were gained by Indiana's running backs and fullbacks on the ground.\nIndiana quarterback John Paci was the cornerstone of Indiana's offense, and completed 133 of 258&nbsp;passes for 1,796&nbsp;yards and eight&nbsp;touchdowns during the regular season. During the team's regular-season game against Penn State, Paci completed the longest passing play in Indiana history, completing a 99-yard pass to wide receiver Thomas Lewis for a touchdown. That play in part helped make Paci's performance against Penn State the fourth-highest single-game passing total for an Indiana quarterback in school history. Paci suffered a separated shoulder during the regular season, but despite the injury, he was predicted to start at quarterback against Virginia Tech and undergo surgery following the Independence Bowl.\nPaci's favorite passing target was wide receiver Thomas Lewis, who completed the regular season having caught 55&nbsp;passes for 1,058&nbsp;yards and seven&nbsp;touchdowns. Lewis' 1,058&nbsp;receiving yards were the second most ever accumulated by an Indiana player, and his 285&nbsp;receiving yards in the Hoosiers' game against Penn State were the most in a single game by an Indiana player in school history. On the ground, Indiana's offense was led by running back Jermaine Chaney, who finished the regular season with 186&nbsp;carries for 716&nbsp;yards and six&nbsp;touchdowns.\nVirginia Tech offense\nVirginia Tech's offense was ranked 11th nationally in scoring, averaging 36.4&nbsp;points per game, and 10th in rushing offense, averaging 242.8 yards per game. The totals were the most recorded to that point by a Virginia Tech offense. That high-ranking rushing attack was led by Dwayne Thomas, who accumulated 1,130&nbsp;yards and 11&nbsp;touchdowns during the regular season. Thomas' 11&nbsp;touchdowns were the most for a Tech running back since 1969. Thomas was ably assisted by a capable offensive line anchored by center Jim Pyne, who earned consensus All-America honors in recognition of his performance. By being named to every All-America team in the country, Pyne became the first consensus All-American in Virginia Tech history.\nTech quarterback Maurice DeShazo was also a major part of the record-breaking Tech offense. DeShazo threw 22 touchdown passes during the regular season, setting what was then a school record. He completed 129 of 230&nbsp;passes for 2,080&nbsp;yards and seven&nbsp;interceptions in addition to the touchdown record. DeShazo's favorite target passing the ball was wide receiver Antonio Freeman, who set a Tech record with nine touchdown receptions during the regular season. Freeman caught 32&nbsp;passes for 644&nbsp;yards in addition to the touchdown mark.\nIndiana defense\nThe Hoosiers' defense was ranked seventh in scoring defense, allowing an average of just 13.8&nbsp;points per game. In overall defense, Indiana was ranked 10th, allowing just 303.3&nbsp;yards per game. In total, the Hoosiers allowed 3,654&nbsp;yards; 1,997 of these were passing yards, while the remaining 1,657 were rushing yards.\nOne of the stars of that IU defense was defensive tackle Hurvin McCormack, who led the Hoosiers in sacks with seven. Another important defensive player was linebacker Alfonzo Thurman, whose 108&nbsp;tackles during the regular season were the most of any Indiana player.\nVirginia Tech defense\nVirginia Tech's defense allowed a Big East-worst 2,761&nbsp;passing yards and permitted an average of 388&nbsp;total yards per game, fifth-worst in the conference. Linebacker Ken Brown had the most tackles of any Tech defender, accumulating 113 during the course of the regular season. Two Tech players tied for the most interceptions on the team. Torrian Gray and Antonio Banks each had three&nbsp;interceptions during the regular season.\nGame summary\nThe 1993 Independence Bowl kicked off at 12:30&nbsp;p.m. EST on December 31, 1993, at Independence Stadium in Shreveport, Louisiana. Official attendance estimates indicate a crowd of 33,819, but many seats in the 50,459-seat stadium were empty, indicating a smaller-than-official crowd. The game was broadcast on ESPN in the United States, and Joel Meyers, Rick Walker, and Mike Mayock were the broadcasters. Weather at kickoff was sunny and .\nFirst quarter\nIndiana received the Virginia Tech kickoff in the end zone for a touchback and began the first drive of the game at their 20-yard line. On the first play of the game, Indiana rushed up the middle for a six-yard gain. After Paci threw an incomplete pass, he attempted to scramble for the first down but was tackled one yard short. Indiana punted the ball, and after a block-in-the-back penalty against Virginia Tech, the Hokies began their first possession at their 15-yard line. After a five-yard false start penalty on Tech's first play, Hokie running back Dwayne Thomas rushed the ball for a 10-yard gain, making up twice the yardage lost to the penalty. Tech's second play was another rush by Thomas, who ran to the Tech 27-yard line for the game's first first down. Once there, DeShazo completed two consecutive passes, pushing Tech to their 45-yard line. Tech was able to continue the advance across midfield and into Indiana territory, but the Hoosiers' defense stiffened and denied Tech another first down. After a Hokie punt, Indiana began its second offensive drive at its 15-yard line.\nIndiana's first play on the new drive was stopped for a loss, and the Hoosiers were forced to punt after a short gain was nullified by a Paci sack on third down. The kick was a short one, and Tech began its second drive from IU's 49-yard line. The first play was stopped for no gain, DeShazo threw two incomplete passes, and Virginia Tech punted after going three and out. Indiana recovered the ball at its 23-yard line, where their offense began work. A five-yard false start penalty against the Hoosiers pushed them back, and Indiana was stopped for little gain on the first two plays of its drive. On the third play, however, Paci connected on a 75-yard pass to Thomas Lewis, who ran into the end zone for a touchdown and the game's first points. Following the extra point kick, Indiana had a 7&ndash;0 lead with 5:36 remaining in the first quarter.\nVirginia Tech returned Indiana's post-touchdown kickoff to its 27-yard line, and Tech's offense returned to the field hoping to answer the Hoosiers' score. Two rushes by Thomas gave Tech a first down near the 40-yard line. Aided by a penalty against Indiana, Tech gained another first down in the Hoosiers' side of the field with a pass by DeShazo. A 15-yard late-hit penalty against Indiana gave Tech another first down and pushed the Hokies to the Indiana 31-yard line. Tech continued to drive with runs from DeShazo, Thomas, and fullback Joe Swarm. Inside the Indiana 10-yard line, Tech was stopped for losses on consecutive plays before DeShazo connected on a 14-yard touchdown pass to Thomas. The extra point was good, and with nine&nbsp;seconds remaining in the first quarter, Virginia Tech tied the game at 7&ndash;7.\nIndiana fielded Virginia Tech's post-touchdown kickoff and returned it to their 25-yard line. The Hoosiers attempted a long pass, but the throw fell incomplete and the quarter came to an end with the score still tied at 7&ndash;7.\nSecond quarter\nIndiana began the second quarter in possession of the ball and facing a second down at its 25-yard line. After a rushing play was stopped for a loss and Paci was forced to throw the ball away to avoid a sack, Indiana punted for the first time in the second quarter. Tech resumed offense at its 41-yard line. DeShazo completed a pass to the Indiana 47-yard line, then a 25-yard toss to Cornelius Wright, who carried it to the Indiana 22. Swarm carried the ball for a first down inside the Indiana 10-yard line, and two plays later, he carried it across the goal line for Virginia Tech's second touchdown of the game. Following the extra point, Tech took a 14&ndash;7 lead with 11:14 remaining in the first half.\nIndiana's Jermaine Chaney fielded the post-score kickoff and returned it 51&nbsp;yards, setting up Indiana inside Tech territory. On the Hoosiers' first play, Paci completed a 34-yard pass to tight end Ross Hales for Indiana's second first down of the game. Just outside the Tech 10-yard line, Indiana was stopped short and prevented from scoring a touchdown. Indiana's head coach sent in placekicker Bill Manolopolous, whose 26-yard kick soared through the uprights and cut Virginia Tech's lead to 14&ndash;10 with 8:47 remaining before halftime.\nTech returned Indiana's post-score kickoff to the 22-yard line, where the Hokie offense returned to action. Tech picked up nine yards on a pass from DeShazo, but two plays later, DeShazo threw his first interception of the game as Indiana's Mose Richardson jumped in front of a Tech pass. Following the turnover, Indiana's offense began work from the Virginia Tech 31-yard line. The Hoosiers picked up a first down rushing the ball, but a holding call on first down pushed Indiana away from the end zone. Following the penalty, Virginia Tech's defense prevented the Hoosiers gaining another first down, and IU was forced to attempt another field goal. As before, Manopolous' kick—this one a 40-yard attempt—was good, and Indiana sliced Tech's lead to a single point, 14&ndash;13, with 5:25 remaining in the first half.\nThe Hokies returned the post-score kickoff to their 20-yard line, and Tech's offense began work. Thomas gained a first down with three consecutive runs, then the Hokies fumbled when a backwards pass from DeShazo fell incomplete. Indiana recovered the ball, and the turnover allowed the Hoosiers' offense to start work from the Tech 25-yard line. On Indiana's first play, however, Virginia Tech cornerback Tyronne Drakeford intercepted Paci's pass. Following the turnover, Tech's offense started work at its 20-yard line. The Hokies picked up a first down through the air, then DeShazo scrambled for another. A 10-yard holding penalty pushed Tech backward, and the Hokies were forced to punt the ball away.\nIndiana's offense began play from the Hoosiers' 34-yard line following the kick. Paci scrambled for several yards, then completed a pass for a first down at the 50-yard line. On the next play, however, Paci fumbled the ball, which bounced into the hands of Tech defensive end Lawrence Lewis, who returned it 20&nbsp;yards for a touchdown. The score and extra point gave Tech a 21&ndash;13 lead with 23 seconds remaining before halftime. Virginia Tech's post-score kickoff was returned to the Tech 42-yard line, potentially setting up an Indiana field goal try before halftime. Paci completed a pass to the 36-yard line, and the few seconds remaining in the first half apparently ran off the clock before Indiana could use its final timeout to stop the clock.\nVirginia Tech players and coaches attempted to leave the field, only to be informed that Indiana called a timeout with one second remaining. Despite Tech head coach Frank Beamer's protests, Indiana's Manolopoulos was able to return to the field to attempt a 51-yard goal. The kick was blocked and the ball recovered by Tech's Antonio Banks, who returned it 80&nbsp;yards for a touchdown. The score, which came with no time remaining on the clock, gave Tech a 28&ndash;13 lead at halftime.\nThird quarter\nBecause Virginia Tech kicked off to Indiana to begin the game, Indiana kicked off to Virginia Tech to begin the second half. In response to the celebration following the 80-yard touchdown prior to halftime, Virginia Tech was assessed two 15-yard unsportsmanlike conduct penalties. Indiana kicked off from the Tech 40-yard line, and the ball was downed at the Virginia Tech 11-yard line. A false-start penalty against the Hokies didn't prevent them from gaining a first down on a pass from DeShazo to Swarm. Swarm picked up another first down on his own, advancing the ball to the Tech 38-yard line with a rush up the middle. Tech continued to advance the ball with Thomas, Swarm and DeShazo rushing the ball and picking up first downs. Now on the Indiana side of the field, DeShazo attempted a deep pass, but the ball was intercepted by Indiana cornerback Jason Orton.\nFollowing the turnover, Indiana's offense began work at its 32-yard line. Despite the opportunity presented by the interception, the Hoosiers were unable to gain a first down and punted back to Virginia Tech. Tech's Steve Sanders returned the kick to the Tech 27-yard line, and Tech's offense returned to the field. The Hokie offense was no more successful than Indiana's had been, and Tech punted after going three and out. Following the kick and a short return, the Hoosiers began work at their 41-yard line. After being stopped for no gain on two consecutive plays, Paci completed a long pass to Tech's 40-yard line for the Hoosiers' first first down of the second half. Indiana continued advancing the ball via short passes, but came up one&nbsp;yard short of a first down. Instead of punting on fourth down, Indiana attempted to gain the first down via a rush up the middle. Tech's defense held fast, and Indiana turned the ball over after failing to gain the needed yard.\nIndiana's defense also held fast on the next possession, and Tech was unable to gain a first down following the turnover. Tech's punt was returned to the Indiana 38-yard line, where the Hoosier offense returned to the field. At first, the Hoosiers were successful moving the ball as they picked up a first down in Tech territory via a pass from Paci. The success was short-lived, however, as the Hoosiers were unable to gain a first down once on the Tech side of the field and had to punt. Sanders returned the kick to the Tech 21-yard line, where Tech began its third possession of the second half. Tech picked up a first down via two DeShazo passes, but couldn't gain another. Tech's punt was downed at the Indiana 20-yard line, and Indiana's offense began work with 3:02 remaining in the quarter.\nIndiana earned a first down with two rushes, but as before, Tech's defense stiffened and refused to allow a second as Tech's Bernard Basham sacked Paci for a loss. Indiana's punt was fair caught at the Tech 30-yard line as the quarter came to an end. With one quarter remaining in the game and neither team having scored in the third quarter, the score remained 28&ndash;13.\nFourth quarter\nVirginia Tech began the fourth quarter in possession of the ball with a first down at its 30-yard line. The Hokie drive fizzled, as had most of the offense in the third quarter, after DeShazo was sacked for a big loss on third down. Indiana returned the Tech punt to its 43-yard line, and Indiana brought in its backup quarterback, Chris Dittoe, to lead the offense. After being sacked on his first play, Dittoe completed a pass to near midfield, making up the yardage that had been lost on the sack. Despite that gain, Indiana couldn't make up the yardage lost to the sack and appeared to be ready to punt the ball. Instead, the Hoosiers faked the punt and threw a pass to an undefended Indiana player who dropped the ball. Following the turnover, Virginia Tech's offense started work at the Indiana 49-yard line. After being stopped short on two rushes, DeShazo completed a 42-yard pass to Antonio Freeman, who raced down the field and into the end zone. The extra point was good, and with 9:37 remaining in the game, Tech took a 35&ndash;13 lead.\nTech's post-touchdown kickoff was downed in the end zone for a touchback, and Indiana's offense started work at its 10-yard line after a Hoosier penalty. On the first play of Indiana's drive, Dittoe was sacked and fumbled the ball, which rolled into the arms of a Virginia Tech defender. The Hokie offense quickly returned to the field and Tech's Tommy Edwards scored on the first play after being set up at the Indiana five-yard line after the turnover. The extra point gave Tech a 42&ndash;13 lead with 9:21 remaining.\nIndiana's offense started at its 20-yard line after a touchback on the kickoff. Dittoe threw two incomplete passes, was sacked, and the Hoosiers punted after going three and out. The Indiana punt was a poor one, flying out of bounds at the Indiana 28-yard line and giving Tech excellent field position. With a large lead secured, Virginia Tech backup quarterback Jim Druckenmiller came into the game for the Hokies, who were unable to gain a first down. Despite failing to advance the ball 10 yards, the excellent starting field position allowed Tech kicker Ryan Williams to attempt a 42-yard field goal, his longest kick of the season. The kick sailed through the uprights, and Tech extended its lead to 45&ndash;13 with exactly six minutes remaining in the game.\nFollowing a touchback, Indiana's offense started from its 20-yard line. The Hoosiers picked up a first down with two short rushes, then Dittoe completed a first-down pass to Lewis and advanced the ball into Tech territory. On his second play in Tech territory, Dittoe completed a long pass to Lewis for Indiana's first touchdown of the second half. The score cut Virginia Tech's lead to 45&ndash;20, but with only 4:26 remaining in the game, the odds were long against Indiana challenging Tech's lead in a serious fashion. The Hoosier kickoff went out of bounds, and the Hokie offense began a drive from its 35-yard line. Virginia Tech began running out the clock, executing rushing plays and staying in bounds to maximize the amount of time run off the game clock. Tech was unable to get a first down, and the Hokie punt was returned to the Indiana 29-yard line. Indiana was stopped on three consecutive plays and appeared to be punting the ball. As they had earlier in the game, however, the Hoosiers executed a trick play, snapping the ball to linebacker Alfonzo Thurman instead of the punter. Thurman ran forward for 37&nbsp;yards—the Hoosiers' longest run of the game—and a first down. Despite the gain and a 15-yard pass interference penalty against Tech, Indiana was unable to score. Time ran out in the fourth quarter, and Virginia Tech earned the 45&ndash;20 victory.\nStatistical summary\n{| class=\"wikitable\"\n|+ Statistical Comparison\n!  || IU || VT\n|-\n| 1st downs || 11 || 17\n|-\n| Total yards || 296 || 318\n|-\n| Passing yards || 276 || 193\n|-\n| Rushing yards || 20 || 125\n|-\n| Return yards || 61 || 38\n|-\n| Penalties || 7&ndash;55 || 8&ndash;84\n|-\n| Time of possession || 27:12 || 32:48\n|}\nIn recognition of his performance during the game, Virginia Tech quarterback Maurice DeShazo was named the game's offensive most valuable player. DeShazo completed 19 of his 33&nbsp;pass attempts for two&nbsp;touchdowns, 193&nbsp;yards, and two&nbsp;interceptions. DeShazo's favorite passing target, wide receiver Antonio Freeman, finished the game with five&nbsp;catches for 66&nbsp;yards and a touchdown. Running back Dwayne Thomas, Tech's second-leading receiver, had four&nbsp;catches for 27&nbsp;yards and a touchdown. He also led Tech's offense on the ground, carrying the ball 24&nbsp;times for 65&nbsp;yards. Fullback Joe Swarm was the second-leading rusher for the Hokies, accumulating 40&nbsp;yards on nine carries.\nIndiana's offense outgained the Hokies through the air and finished with 276 passing yards, its second-highest total that season. Starting quarterback John Paci completed 10 of 22 passes for 171&nbsp;yards and a touchdown, while backup quarterback completed 7 of 14&nbsp;passes for 105&nbsp;yards and a touchdown. Both players' favorite target was Thomas Lewis, who finished the game leading all receivers with six catches for 177&nbsp;yards and two touchdowns. On the ground, the Hoosiers were led by linebacker Alfonzo Thurman, who, although a defensive player, ran for 37&nbsp;yards on a fake punt.\nVirginia Tech's defense performed well overall against the Hoosiers. The 20&nbsp;rushing yards allowed by the Tech defense were the fewest permitted all season. In addition, the Hokie defense accumulated seven sacks and four tackles for loss. The seven sacks were the most for Tech that season, and Indiana's 11 first downs also were the fewest Tech allowed that season. The Hokie defense also performed well on an individual level. Antonio Banks and Torrian Gray each had nine tackles, tying for the most of any player in the game. Banks also had a fumble recovery for a touchdown, an interception, and a pass breakup. For these accomplishments, he was named the game's defensive MVP. Tech linebacker Ken Brown finished with eight tackles.\nThe Hoosiers' defense had some success stopping Tech behind the line of scrimmage, accumulating seven tackles for loss during the course of the game. Indiana cornerback Mose Richardson had nine tackles and one interception, leading the Hoosiers in tackles, and teammate Chris Dyer came in second for IU with seven.\nThe block of Bill Manolopolous' 51-yard field goal attempt by Tech defensive lineman Jeff Holland prior to halftime was the 36th blocked kick in Frank Beamer's seven years as Tech head coach. The 80-yard touchdown return of the blocked kick by Antonio Banks was the first such touchdown in Virginia Tech history.\nVirginia Tech set several then-records during the game. Its 21&nbsp;second-quarter points were the most ever scored in that quarter, and tied the record for most points in any quarter. It set the Independence Bowl record for most points scored, and tied the record for fewest first downs allowed. Some records set during the game still stand. Indiana's Thomas Lewis returned a record eight punts in the game and earned 177&nbsp;receiving yards, including the third-longest pass in Independence Bowl History—a 75-yard reception from quarterback John Paci.  Hokie Kicker Ryan Williams set the record for the most extra points in an Independence Bowl game with six, a mark that was tied during the 1995 Independence Bowl.\nPostgame effects\nVirginia Tech's victory was just its second bowl win in school history and brought the Hokies to a final 1993 record of 9&ndash;3. Indiana's loss took it to 8&ndash;4, one win short of tying a nine-win season in 1967 that featured an appearance in the Rose Bowl. Tech's win was also its first televised victory since 1990. Despite those accolades, the victory failed to move the Hokies up in the AP poll, which kept Tech at No. 22 in the final ranking of the season.\nAt the time, Tech officials viewed the victory as a turning point for the program. Virginia Tech president Paul Torgersen said, \"Incredible. ... A very fine job. We've turned it around. No question, we've turned it around.\" Later observers also concurred, pointing to the game as the start of Virginia Tech's 23-season bowl appearance streak, which included a trip to the national championship game.\nIndiana, which had appeared in bowl games six times in the eight years prior to the Independence Bowl, suffered after the loss. Indiana went 6&ndash;5 in the 1994 season, and head coach Bill Mallory was fired after two consecutive losing seasons in 1995 and 1996. The Hoosiers would not appear in a bowl again until the 2007 season, when they played in the 2007 Insight Bowl.\nSeveral players from each team later went on to play in the National Football League. Tech center Jim Pyne played for nine years in the NFL before becoming an assistant coach in the league.  He subsequently had his number retired by Virginia Tech, becoming just the fourth player in Tech history to be honored in that fashion.\nNotes\nReferences"
    }
  ]
}