{
  "content": [
    {
      "type": "text",
      "text": "# 1996 in the United Kingdom\n\nNorthern Ireland  Scotland  Wales\n|label2= Popular culture\n|data2 =\n1996 British Grand Prix\n1996 English cricket season\nFootball: England  Scotland\n1996 in British television\n1996 in British music\n1996 in British radio\nUK in the Eurovision Song Contest 1996\n}}\nin Windsor, Berkshire opened on 17 March]]\nEvents from the year 1996 in the United Kingdom.\nThis year is noted for the Dunblane Massacre, the divorces of the Duke and Duchess of York (Andrew and Sarah) and of the Prince and Princess of Wales (Charles and Diana) and the birth of Dolly the sheep.\nIncumbents\n* Monarch – Elizabeth II\n* Prime Minister – John Major (Conservative)\nEvents\nJanuary\n* 10 January – Terry Venables announces that he will resign as manager of the England national football team after this summer's European Championships, which will be hosted in England.\n* 13 January – National Union of Mineworkers' leader Arthur Scargill announces that he is defecting from the Labour Party to set up his own Socialist Labour Party.\n* 19 January\n** The first MORI poll of 1996 shows Labour still comfortably ahead of the Conservatives with a showing of 55% and a lead of 26 points.\n** Ian and Kevin Maxwell, sons of the late media mogul Robert Maxwell, are cleared of fraud at the Old Bailey after a trial lasting eleven days.\n* 23–26 January – Much of Britain is struck with sub-zero temperatures and snowstorms. Schools and transport are disrupted.\nFebruary\n* 4 February – The first two passenger train operating companies begin operation of their service franchises as part of the privatisation of British Rail: South West Trains (part of the Stagecoach Group) and Great Western Trains (management buyout).\n* 5 February – The first genetically modified food products go on sale in the UK.\n* 9 February\n** The Provisional Irish Republican Army (IRA) carry out the Docklands bombing in London, a lorry bomb which kills two men (whose bodies are discovered the following day) and injures 39 people. This incident ends the 17-month ceasefire in Northern Ireland.\n** The Parole Board announces that Moors murderer Myra Hindley could soon be transferred to an open prison. Hindley, 53 and in her thirtieth year of imprisonment, is currently being held at Durham Prison, but if Home Secretary Michael Howard backs the Parole Board's recommendation, Hindley could soon be transferred to a prison with a more relaxed regime.\n* 15 February – A report on the Arms-to-Iraq affair is critical of government ministers.\n* 18 February – An IRA bomb explodes on a bus in Central London, killing the transporter, Edward O'Brien, and injuring eight other people, including the driver.\n* 19–20 February – Approximately 1,000 passengers are trapped in the Channel Tunnel when two Eurostar trains break down due to electronic failures caused by snow and ice.\n* 22 February – Conservative MP Peter Thurnham announces his resignation from the House of Commons, reducing the Conservative Government's majority to just two seats. Resignations and by-election defeats have cost the Conservatives nineteen seats since the general election just under four years ago.\n* 28 February\n** Diana, Princess of Wales, agrees to give the Prince of Wales (the later Charles III) a divorce, more than three years after separating.\n** Sandra Gregory, a British teacher, is sentenced to 25 years in prison in Thailand for drug smuggling, three years after her arrest at Bangkok Airport. Her co-accused, Robert Lock, is cleared of the same charge and returns home.\nMarch\n* 13 March – A gunman kills sixteen children, a teacher and himself in the Dunblane massacre in Scotland. The killer is quickly identified as 43-year-old former scout leader Thomas Hamilton. It is the worst killing spree in the United Kingdom since the Hungerford massacre in 1987.\n* 17 March – Legoland Windsor opens its doors for the public. It becomes the second Legoland in Europe.\n* 20 March\n** Home Secretary Michael Howard unveils plans to give courts the power to hand down heavier prison sentences, including sending burglars to prison for at least three years after a third offence and all drug dealers to prison for at least six years. The plans spark controversy, with some critics pointing out that it will increase the prison population by at least 20%.\n** United Kingdom BSE outbreak: Secretary of State for Health Stephen Dorrell announces a link between the potentially-fatal variant Creutzfeldt–Jakob disease and the eating of beef infected with bovine spongiform encephalopathy.\n* 22 March – The European Union prohibits exports of British beef because of the BSE crisis.\n* 29 March – Three British soldiers are sentenced to life imprisonment in Cyprus for the abduction, attempted rape and manslaughter of Danish woman Louise Jensen. The three soldiers are Allan Ford from Birmingham, Justin Fowler from Falmouth and Jeffrey Pernell from Oldbury.\nApril\n* 1 April – The Local Government etc. (Scotland) and Local Government (Wales) Acts of 1994 come into effect, creating new unitary authorities.\n* 16 April – South East Staffordshire by-election: In a 22-point swing, Labour wins the Staffordshire South East seat from the Conservative Party at a by-election, cutting the Conservative Government's majority to just three seats almost exactly four years after they began the current term of Parliament with a 21-seat majority.\n* 17 April – The Duke and Duchess of York are divorced after ten years of marriage and four years after their separation.\nMay\n* 2 May\n** The Conservatives lose 578 seats in local council elections, while Labour increases its total number of councillors nationally to almost 11,000.\n** The Football Association announces that Glenn Hoddle, the current Chelsea manager, will succeed Terry Venables as manager of the England national football team after next month's European Championships, which England is hosting for the first time.\n* 5 May – Manchester United win the FA Premier League title for the third time in four seasons.\n* 11 May – Manchester United win the FA Cup for a record ninth time by beating Liverpool 1–0 and become the first team to win the double of the league title and FA Cup twice.\n* 17 May – Timothy Morss and Brett Tyler are found guilty of the murder of Daniel Handley, a nine-year-old who disappeared near his London home in October 1994 and whose body was found near Bristol five months later. The Old Bailey trial judge sentences them to life imprisonment and recommends that neither of them is ever released.\n* 20 May – Actor and comedian Jon Pertwee dies aged 76 of a heart attack in Connecticut, United States, shortly after the release of the Doctor Who television film.\n* 30 May\n** The Duke and Duchess of York complete their divorce proceedings. The former Duchess loses the title HRH and becomes Sarah, Duchess of York.\n** Sara Thornton, a Warwickshire woman who was jailed for life in 1990 for the murder of her abusive husband Malcolm the previous year, is released from prison after the Court of Appeal reduces her conviction to manslaughter.\nJune\n* 8 June – The European Football Championships begin in England, with the host nation drawing 1–1 with Switzerland in the opening game.\n* 13 June – The parliament of Guernsey, Channel Islands, votes to legalise abortion 86 years after it was outlawed.\n* 15 June\n** 1996 Manchester bombing: The Provisional Irish Republican Army (IRA) detonates a massive lorry bomb in Manchester city centre, causing considerable damage but no fatalities.\n** England and Scotland meet for the first time in a major football tournament when they play their group match at Euro '96. England win the match (played at Wembley) 2–0.\n* 16 June – Launch of The Planet on Sunday, a new Sunday tabloid focusing on environmental issues. Publication of the newspaper ceases after one edition because the owner is unhappy with its content.\n* 19 June – The government selects the Greenwich Peninsula site on the banks of the River Thames as the location for the Millennium Dome exhibition which is set to open for the year 2000.\n* 21 June – The latest MORI poll shows the Conservatives on 31%, their best showing for three years, but they are still 21 points behind Labour with just under a year to go before the next general election is due to be held.\n* 26 June – England's hopes of being European champions of football for the first time are ended with a penalty shootout defeat to Germany after a 1–1 draw in the semi-final.\n* 30 June – Germany wins the European Championship final with a 2–1 victory over the Czech Republic at Wembley.\nJuly\n* 5 July – Dolly the sheep, the first mammal to have been successfully cloned from an adult cell, is born at the Roslin Institute in Scotland.\n* 12 July – South African President Nelson Mandela visits the UK.\n* 15 July – A Provisional Irish Republican Army unit plotting to disrupt the London electricity supply is arrested in Operation AIRLINES.\n* 18 July – Howard Hughes, 31, is found guilty of the murder of Sophie Hook, 7, in Llandudno, North Wales, twelve months ago. He is sentenced to life imprisonment at Chester Crown Court and the trial judge Mr Justice Curtis recommends that he is never released.\n* 19 July–9 August – Great Britain and Northern Ireland compete at the 1996 Summer Olympics in Atlanta, Georgia, United States, and win 1 Gold, 8 Silver and 6 Bronze medals. The only gold medal is won by Matthew Pinsent and Steve Redgrave in rowing (men's coxless pair).\n* 30 July – Alan Shearer becomes the most expensive footballer in the world in a £15,000,000 transfer from Blackburn Rovers to Newcastle United F.C.\nAugust\n* 9 August – Sir Frank Whittle, inventor of the turbojet engine, dies of cancer at his home in Columbia, Maryland, United States, aged 89.\n* 14 August – Unemployment has fallen to 2,126,200 – its lowest level since the summer of 1991.\n* 28 August – The Prince and Princess of Wales (Charles and Diana) complete their divorce proceedings after fifteen years of marriage. Their separation was first announced nearly four years ago. The former Princess of Wales loses her style of Royal Highness and assumes the style Diana, Princess of Wales.\n* 29 August – Ketamine is legalised in the United Kingdom for the first time.\nSeptember\n* September\n** Ford launches its new Ka city car, which makes use of a shortened Fiesta chassis. A revamped Mondeo goes on sale next month.\n** Launch of the second generation Nissan Primera, built at Nissan's Sunderland factory.\n* 4 September – BBC2 shows the first episode of lifestyle reality television show Changing Rooms.\n* 5 September – Matthew Harding, vice-chairman of Chelsea FC, makes a £1,000,000 donation to the Labour Party – the largest donation made to the party by any individual.\n* 20 September – Jockey Willie Carson is injured by a horse at Newbury, Berkshire.\n* 24 September – Cadbury launches the Fuse chocolate bar. 40 million bars are sold this week, by December 1996 it became the UK's favourite confectionary.\nOctober\n*2 October –  Lawyer and politician John Taylor is made a Life Peer as Baron Taylor of Warwick, the first black Conservative peer.\n* 7 October – The Thiepval barracks bombing in Lisburn (Northern Ireland) injures many people, including a soldier who later dies from his injuries.\n* 12 October – The Conservative government's majority has dwindled to a single seat following the defection of Peter Thurnham to the Liberal Democrats.\n* 13 October\n** Racing driver Damon Hill wins the Japanese Grand Prix, thus clinching the Drivers' World Championship.\n** The Queen opens Durham County Cricket Club's new Riverside Ground in Chester-le-Street, the first new purpose-built first-class county cricket ground in the UK for over 100 years.\n* 16 October – The government announces plans to make possession of handguns illegal in the UK, following the Dunblane massacre.\nNovember\n* 3 November – Barry Porter, Conservative MP for Wirral South, dies of cancer aged 57.\n* 8 November – With the next general election no more than six months away, Labour still look set for a return to power after eighteen years in opposition, but the Conservatives have cut their lead to seventeen points in the latest MORI opinion poll – one of the narrowest gaps seen between the two leading parties in any opinion poll over the last three years.\n* 13 November – The Stone of Scone is taken away from King Edward's Chair in Westminster Abbey, its location since 1296, and returned to Scotland.\n* 18 November – Channel Tunnel fire: The Channel Tunnel is closed when a truck on a transporter wagon catches fire, disrupting Eurotunnel Shuttle and Eurostar services.\n* 24 November – BBC1 airs The Simpsons for the first time with \"There's No Disgrace Like Home\" being the first episode shown.\n* 30 November – The Stone of Scone is installed in Edinburgh Castle 700 years after it was removed from Scotland by King Edward I of England.\nDecember\n* 7 December – Sir John Gorst, 68-year-old Conservative MP for Hendon North in London, resigns the party whip, leaving the Conservative Party without a majority in the House of Commons.\n* 10 December\n** James Mirrlees wins the Nobel Prize in Economics jointly with William Vickrey \"for their fundamental contributions to the economic theory of incentives under asymmetric information\".\n** Harold Kroto wins the Nobel Prize in Chemistry jointly with Robert Curl and Richard Smalley \"for their discovery of fullerenes\".\n* 11 December – Comedian Willie Rushton dies aged 59 in hospital in Kensington, London, of a heart attack, ten years after jokingly predicting it.\n* 18 December – Unemployment has fallen below 2,000,000 for the first time in almost six years, four years since it peaked at nearly 3,000,000 during the recession. Despite the strong economic recovery and falling unemployment, the Conservatives are still trailing behind Labour in the opinion polls, a stark contrast to their performance at the last election, where they retained power despite Britain being in recession.\nUndated\n* Remaining provincial branches of the Bank of England, at Leeds, Newcastle, Manchester, Birmingham and Bristol, are closed.\n* More than 4% of the UK population (some 2,500,000 people) now have internet access.\n* New car sales in the United Kingdom are above 2,000,000 for this year, a level last seen in 1990.\n* Panathlon Foundation is formed by  Ashley Iceton.\nPublications\n* Iain M. Banks's novel Excession.\n* Seamus Deane's novel Reading in the Dark.\n* Terry Pratchett's Discworld novels Feet of Clay and Hogfather; and his Johnny Maxwell novel Johnny and the Bomb.\n* Graham Swift's novel Last Orders.\n* Meera Syal's semi-autobiographical novel Anita and Me.\nBirths\nJanuary\n* 3 January – Florence Pugh, British actress\n* 4 January – Jade Jones, athlete\n* 5 January – Maxim Baldry, actor\n* 8 January – Hiram Boateng, footballer\n* 10 January – Lauren McCrostie, actress\n* 11 January – Charlie Coulson, footballer\n* 17 January – Kirsty Hickey, actor, singer and dancer\n* 21 January – Kyle Lander, footballer\n* 22 January – Angus Gunn, footballer\n* 23 January – Ruben Loftus-Cheek, footballer\n* 26 January – Tyger Drew-Honey, actor\n* 29 January – Megan Jossa, actress\n* 31 January – Gavin Whyte, footballer\nFebruary\n* 1 February\n** Josh Bates, motorcycle speedway rider\n** Dionne Bromfield, singer-songwriter and television presenter\n* 7 February – Nathan Curtis, footballer\n* 14 February – Bethany Firth, swimmer\n* 20 February – Patrick Brough, footballer\n* 21 February – Sophie Turner, actress\nMarch\n* 11 March – William Lenney, YouTuber\n* 12 March – Byron Lawrence, footballer\n* 16 March – Ivan Toney, footballer\n* 17 March – Lydia Lloyd-Henry, actress\n* 19 March – Kaiya Jones, Scottish-born Australian actress\n* 20 March – Charley Hull, golfer\n* 21 March – Adam Ellis, French-born grasstrack and speedway rider\n* 22 March\n** Jonathan Mason, actor\n** Izzy Meikle-Small, actress\n* 31 March – Barney Gibson, cricketer\nApril\n* 1 April – Samuel Blenkin, actor and director\n* 3 April – Anna Jobarteh, actress\n* 5 April – Lowri Shone, ballerina\n* 11 April – Dele Alli, footballer\n* 12 April – Georgia Hall, golfer\n* 17 April – Lorna Fitzgerald, actress\n* 23 April – Charlie Rowe, actor\n* 25 April\n** Bryn Morris, footballer\n** Brad Walker, footballer\nMay\n* 3 May – Danielle Alakija, athlete\n* 15 May – Birdy, musician\n* 16 May – Jermaine Anderson, footballer\n* 31 May – Martha Thomas, footballer\nJune\n* 1 June – Tom Holland, actor and dancer\n* 4 June – Ruby Harrold, gymnast\n* 11 June – Hakeeb Adelakun, footballer\n* 23 June – Charlie Jones, actor\n* 24 June – Harris Dickinson, actor, writer and director\n* 27 June – James Forde, actor\n* 28 June – William Miller, actor\n* 30 June – Gregor Ramsay, racing driver\nJuly\n* 9 July – Scott McMann, footballer\n* 11 July – Ross Stewart, footballer\n* 13 July – Ché Adams, footballer\n* 15 July – Mason Bennett, footballer\n* 16 July – Daniel Pearson, actor and presenter\n* 20 July – Martin James Bartlett, pianist\n* 24 July – Jordan McGhee, footballer\n* 26 July\n** Olivia Breen, athlete\n** CDawgVA, youtuber\n* 28 July\n** Anya Chalotra, actress\n** Samuel Chatto, son of Lady Sarah Chatto and Daniel Chatto\nAugust\n* 1 August – Katie Boulter, tennis player\n* 2 August – Robert Madge, actor\n* 5 August – Hannah Russell, paralympic swimmer\n* 9 August – Céline Buckens, Belgian-born actress\n* 20 August – Sophie Kamlish, paralympic\n* 22 August\n** Jessica-Jane Applegate, swimmer\n** Shannon Flynn, actress\n* 26 August – Tom Harwood, journalist\n* 29 August – Nadia Whittome, Labour Member of Parliament\nSeptember\n]]\n* 2 September – Hannah Jones, snooker player\n* 11 September – Swarmz, rapper\n* 17 September – Ella Purnell, actress\n* 20 September – Jerome Sinclair, footballer\n* 25 September\n** Jake Pratt, actor\n** John Souttar, footballer\n* 28 September – Aiden Moffat, racing driver\nOctober\n]]\n* 4 October &ndash; Ella Balinska, actress\n* 7 October – Lewis Capaldi, Scottish singer-songwriter\n* 11 October – Hollie Doyle, flat racing jockey\n* 16 October – Sam Thornton, diver\n* 19 October\n** Daniel Goodfellow, diver\n** Samuel Honywood, actor\n* 21 October – Alicia Blagg, diver\n* 22 October – Mason Holgate, footballer\n* 25 October – Georgia Lock, actress and presenter\n* 26 October – Rebecca Tunney, gymnast\n* 31 October – Connor Wilkinson, actor\nNovember\n* 11 November – Ryan Kent, footballer\n* 12 November\n** Scott McKenna, footballer\n** Alexander Ogilvy, son of James Ogilvy\n* 20 November – Jack Harrison, footballer\n* 23 November – James Maddison, footballer\n* 24 November – Harry Lewis, YouTuber\n* 28 November – Peter Moore, trombonist\nDecember\n* 9 December – Deji Olatunji, YouTuber and brother of KSI\n* 18 December – Devaanshi Mehta, started the Asian Donor Campaign (ADC) (died 2012)\n* 21 December – Ben Chilwell, footballer\n* 26 December – Cassius Taylor, son of Lady Helen Taylor\nFull date unknown\n* Maz Totterdell, singer-songwriter\nDeaths\nJanuary\n* 3 January – Terence Cuneo, painter and conservationist (born 1907)\n* 6 January\n** Henry Hopkinson, 1st Baron Colyton, politician and diplomat (born 1902)\n** John Philipps Kenyon, historian (born 1927)\n* 7 January – Seton Lloyd, archaeologist (born 1902)\n* 8 January\n** Joyce McCartan, Northern Irish community worker and peace activist (born 1929)\n** Norrie McCathie, Scottish footballer (born 1961); poisoning\n* 9 January – Ronnie Bell, physical chemist (born 1907)\n* 11 January\n** Harold Walter Bailey, linguist (born 1899)\n** Eric Hebborn, painter and author (born 1934)\n* 15 January – Richard Cobb, historian and professor (born 1917)\n* 16 January – Harry Potts, footballer and manager (born 1920)\n* 17 January\n** Charles Madge, poet, journalist and sociologist (born 1912)\n** Harry Robertson, musician and composer (born 1932)\n* 18 January – John Hope, 1st Baron Glendevon, peer and politician (born 1912)\n* 21 January – Peter Stadlen, pianist (born 1910 in Austria-Hungary)\n* 23 January – Norman MacCaig, poet and teacher (born 1910)\n* 27 January – Barbara Skelton, socialite (born 1916)\n* 29 January – Terence Reese, bridge player and writer (born 1913)\nFebruary\n]]\n* 6 February\n** Renee Roberts, actress (born 1908)\n** Patsy Smart, actress (born 1918)\n* 9 February\n** Sir Stephen Hope Carlill, Royal Navy admiral (born 1902)\n** Gerald Savory, playwright and screenwriter (born 1909)\n** Sir George Trevelyan, 4th Baronet, educational pioneer (born 1906)\n* 10 February – Giovanni Pontiero, scholar (born 1932)\n* 11 February\n** Cyril Poole, cricketer (born 1921)\n** Bob Shaw, Northern Irish science fiction writer (born 1931)\n* 14 February\n** Lady Caroline Blackwood, writer (born 1931)\n** Eva Hart, fifth-last survivor of the sinking of the Titanic (born 1905)\n** Čeněk Kottnauer, chess player, International Master (1950) (born 1910 in Austria-Hungary)\n** Bob Paisley, footballer and manager (born 1919)\n* 15 February – Margaret Courtenay, actress (born 1923)\n* 16 February – Kenneth Robinson, politician (born 1911)\n* 17 February – Evelyn Laye, actress (born 1900)\n* 19 February – Brenda Bruce, actress (born 1919)\n* 20 February\n** Walter Marshall, Baron Marshall of Goring, physicist (born 1932)\n** Jeffrey Quill, RAF test pilot (born 1913)\n* 22 February – George Christopher Archibald, economist (born 1926)\n* 26 February – John Dalrymple, 13th Earl of Stair, Scottish peer (born 1906)\n* 27 February\n** Iain Murray, 10th Duke of Atholl, Scottish peer (born 1931)\n** Pat Smythe, show jumper (born 1928)\nMarch\n]]\nwith John Priestley]]\n* 5 March – Joshua Compston, art curator (born 1970); drug overdose\n* 6 March\n** Simon Cadell, actor (born 1950)\n** Douglas Jay, Baron Jay, politician (born 1907)\n* 7 March – Willie Fraser, Scottish footballer (born 1929)\n* 8 March – Jack Churchill, British Army officer (born 1906 in Hong Kong)\n* 11 March\n** Sir Granville Beynon, physicist (born 1914)\n** Paul Crossley, English footballer (born 1948)\n**  Sir Charles Oatley, physicist (born 1904)\n* 15 March – Helen Chadwick, sculptor (born 1953)\n* 16 March – Dennis Jennings, English footballer (born 1910)\n* 18 March – Jacquetta Hawkes, prehistoric archaeologist (born 1910)\n* 19 March\n** W. H. Murray, mountaineer and writer (born 1913)\n** Alan Ridout, composer (born 1934)\n* 22 March – Ron Hayward, politician (born 1917)\n* 25 March – John Snagge, radio personality (born 1904)\n* 29 March – Gordon Pask, psychologist (born 1928)\n* 30 March – Frederick Miller, paediatrician (born 1911)\nApril\n]]\n]]\n* 4 April\n** Brian Abel-Smith, economist (born 1926)\n** Winifred Shotter, actress (born 1904)\n* 6 April – Greer Garson, actress (born 1904)\n* 7 April – Berkely Mather, writer (born 1909)\n* 8 April – Donald Adams, operatic bass-baritone (born 1928), brain tumour\n* 13 April\n** George Mackay Brown, Scottish poet and dramatist (born 1921)\n** Denis Sargan, econometrician (born 1924)\n* 14 April – Mervyn Levy, artist and writer on art (born 1914)\n* 18 April – Mike Leander, songwriter and record producer (born 1941)\n* 19 April – John Martin, spree killer (born 1959); executed in Singapore\n* 20 April – Christopher Robin Milne, author and bookseller (born 1920)\n* 23 April – P. L. Travers, novelist (Mary Poppins) (born 1899 in Australia)\n* 24 April\n** Donald Cammell, Scottish screenwriter and film director (born 1934); suicide\n** Preston Lockwood, actor (born 1912)\n* 25 April – John Lorne Campbell, Scottish historian (born 1906)\n* 27 April – Joan Sterndale-Bennett, actress (born 1914)\nMay\n]]\n]]\n* 1 May – Eric Houghton, English footballer and manager (born 1910)\n* 2 May\n** Douglas Houghton, Baron Houghton of Sowerby, politician, last Cabinet minister born in the 19th century (born 1898)\n** Peter Swales, businessman and football chairman (born 1932)\n* 5 May – Beryl Burton, racing cyclist (born 1937)\n* 6 May – Wally Nightingale, guitarist (born 1956)\n* 7 May\n** Albert Meltzer, anarchist writer (born 1920)\n** Howard Smith, diplomat (born 1919)\n* 14 May – Vera Chapman, writer (born 1898)\n* 19 May – Margaret Rawlings, actress (born 1906)\n* 20 May – Jon Pertwee, actor (born 1919)\n* 23 May – Patrick Cargill, actor (born 1918)\n* 24 May\n** John Abbott, actor (born 1905)\n** Sir Harry Campion, statistician (born 1905)\n* 25 May – John Morrison, 1st Baron Margadale, peer and politician (born 1906)\n* 29 May – Jeremy Sinden, actor (born 1950)\n* 30 May\n** John Cameron, Lord Cameron, Scottish judge (born 1900)\n** Heather Canning, actress (born 1933)\nJune\n* 2 June – Leon Garfield, children's fiction writer (born 1921)\n* 3 June – Peter Glenville, actor and director (born 1913)\n* 7 June – Percy Edwards, animal impersonator (born 1908)\n* 8 June – Phyllis Stedman, Baroness Stedman, politician (born 1916)\n* 15 June\n** Allenby Chilton, footballer and football manager (born 1918)\n** Sir Fitzroy Maclean, 1st Baronet, Scottish soldier, writer and politician (born 1911)\n* 17 June – James Hamilton, disc jockey and journalist (born 1942)\n* 19 June – Vivian Ellis, composer and lyricist (born 1903)\n* 20 June – John Buchan, 2nd Baron Tweedsmuir, peer (born 1911)\n* 21 June – Cyril Holmes, Olympic sprinter (1936) (born 1915)\n* 25 June – Ray Howard-Jones, painter (born 1903)\n* 29 June – Pamela Mason, actress and screenwriter (born 1916)\nJuly\n]]\n* 1 July – Alfred Marks, actor and comedian (born 1921)\n* 7 July – Michael McGoldrick, Northern Irish taxi driver (born 1965); murdered\n* 8 July – Ernest Armstrong, politician (born 1915)\n* 9 July – Christopher Casson, actor (born 1912)\n* 12 July – Walter Hassan, automotive engineer (born 1907)\n* 14 July – Richard Ripley, athlete (born 1901)\n* 17 July\n** Chas Chandler, musician and record producer (born 1938)\n** Sir Geoffrey Jellicoe, landscape architect (born 1900)\n* 19 July – Mervyn Cowie, conservationist (born 1909)\n* 20 July – Colin Mitchell, Army soldier and politician (born 1925)\n* 21 July – Wolfe Morris, actor (born 1925)\n* 22 July – Rob Collins, musician (born 1963); died in a car accident\n* 23 July – Jessica Mitford, author, one of the Mitford sisters (born 1917)\n* 24 July – Jock Wallace, Scottish footballer and manager (born 1935)\n* 27 July – Jane Drew, writer, architect and academic (born 1911)\n* 29 July – Hilary Pritchard, actress (born 1942)\nAugust\n]]\n* 4 August – Geoff Hamilton, television presenter (born 1936)\n* 5 August – Frank Marcus, playwright (born 1928)\n* 6 August\n** Ossie Clark, fashion designer (born 1942); murdered\n** Charles Hadfield, historian (born 1909)\n* 7 August – Anne Kristen, actress (born 1937)\n* 8 August – Sir Neville Francis Mott, physicist (born 1905)\n* 9 August – Sir Frank Whittle, RAF officer and inventor (born 1907)\n* 10 August – Rex Tucker, television director (born 1913)\n* 12 August – Anthony Parsons, diplomat (born 1922)\n* 14 August – Albert Neuberger, biochemist (born 1908, German Empire)\n* 18 August\n** Geoffrey Dearmer, poet (born 1893)\n** Hugo Gryn, rabbi (born 1930)\n* 24 August – Eric Heaton, priest and scholar (born 1920)\n* 27 August – Abram Games, graphic designer (born 1914)\n* 29 August – Phyllis Pearsall, cartographer and creator of the A–Z (born 1906)\nSeptember\n]]\n* 3 September – Julian Amery, Baron Amery of Lustleigh, politician (born 1919)\n* 4 September – Joan Clarke, cryptanalyst and numismatist (born 1917)\n* 10 September\n** Ray Coleman, journalist and author (born 1937)\n** Plantagenet Somerset Fry, historian (born 1931); suicide\n* 11 September – Brenda Forbes, actress (born 1909)\n* 13 September – Jane Baxter, actress (born 1909)\n* 19 September\n** George Hunt, English footballer (born 1910)\n** Douglas Hyde, journalist and writer (born 1911)\n* 22 September – Brook Bernacchi, lawyer (born 1922)\n* 23 September – Stuart Piggott, archaeologist (born 1910)\n* 24 September\n** I. E. S. Edwards, Egyptologist (born 1909)\n** Mark Frankel, actor (born 1962); accidentally killed\n* 26 September – Sir Geoffrey Wilkinson, chemist (born 1921)\n* 29 September – Leslie Crowther, comedian and TV presenter (born 1933)\n* 30 September – Kenneth Muir, literary scholar (born 1907)\nOctober\n]]\n* 3 October – Eustace Roskill, Baron Roskill, lawyer and judge (born 1911)\n* 6 October – Winifred Drinkwater, aviator and aeroplane engineer (born 1913)\n* 7 October – Richard Clarkson, aeronautical engineer (born 1904)\n* 8 October – Geoffrey Finsberg, politician (born 1926)\n* 9 October\n** Nigel Fisher, politician (born 1913)\n** George F. Kerr, screenwriter (born 1918)\n** Roy Lewis, writer and small press printer (born 1913)\n* 11 October – Terry Patchett, politician (born 1940)\n* 13 October – Beryl Reid, actress (born 1919)\n* 14 October – William John Hooper, cartoonist (born 1916)\n* 16 October\n** Sir Anthony Griffin, Royal Navy admiral (born 1920)\n** Eric Malpass, novelist (born 1910)\n* 17 October\n** Chris Acland, rock drummer and songwriter (born 1966); suicide\n** Berthold Goldschmidt, composer (born 1903, German Empire)\n** Bert Hopwood, motorcycle designer (born 1908)\n* 19 October – John Hillaby, travel writer and explorer (born 1917)\n* 21 October – Eric Halsall, author and television presenter (born 1920)\n* 22 October – helicopter crash:\n** John Bauldie, journalist (born 1949)\n** Matthew Harding, businessman (born 1953)\n* 24 October\n** Sir Roderick Barclay, diplomat (born 1909)\n** Gladwyn Jebb, diplomat and politician (born 1900)\n* 26 October – Derek Tangye, novelist (born 1912)\n* 28 October – Robert Hankey, 2nd Baron Hankey, peer and diplomat (born 1905)\nNovember\n]]\n* 3 November – Barry Porter, politician (born 1939)\n* 6 November – Tommy Lawton, footballer (born 1919)\n* 8 November\n** Laurence Baxter, statistician (born 1954)\n** Peter Fowler, physicist (born 1923)\n** Sydney Selwyn, physician (born 1934)\n* 9 November – Roger Makins, 1st Baron Sherfield, diplomat (born 1904)\n* 10 November – Marjorie Proops, journalist (born 1911)\n* 11 November – Janice Adair, film actress (born 1905)\n* 13 November – Margaret Steuart Pollard (Peggy Pollard), bard of the Cornish Gorsedd, philanthropist, oriental scholar and eccentric (born 1904)\n* 14 November – Derek Marlowe, playwright, novelist and painter (born 1938)\n* 16 November\n** Reginald Bevins, politician (born 1908)\n** Jack Popplewell, playwright (born 1909)\n* 18 November\n** Douglas Guest, organist and conductor (born 1916)\n** Charles Hare, tennis player (born 1915)\n** John Vassall, Soviet spy (born 1924)\n* 21 November – Bernard Rose, organist, soldier and academic (born 1916)\n* 24 November – Sorley MacLean, Scottish Gaelic poet (born 1911)\n* 26 November – Michael Bentine, comedian and comic actor (born 1922)\n* 28 November – Anna Pollak, operatic mezzo-soprano (born 1912)\n* 29 November – Denis Jenkinson, motorsports journalist (born 1920)\nDecember\n]]\n* 9 December\n** Mary Leakey, archaeologist (born 1913)\n** Diana Morgan, playwright and screenwriter (born 1908)\n** Ivor Roberts-Jones, sculptor (born 1913)\n** Raphael Samuel, Marxist historian (born 1934)\n* 11 December\n** Willie Rushton, comedian, actor and cartoonist (born 1937)\n** W. G. G. Duncan Smith, World War II air ace (born 1914)\n* 13 December\n** Edward Blishen, author and broadcaster (born 1920)\n** Sir James Cassels, Army field marshal (born 1907)\n** Arthur Jacobs, musicologist (born 1922)\n* 15 December – Dave Kaye, pianist (born 1906)\n* 16 December\n** Quentin Bell, biographer and art historian (born 1910)\n** Joe Coral, entrepreneur and founder of Coral bookmakers (born 1904, Russian Empire)\n* 17 December – Ruby Murray, Northern Irish singer (born 1925)\n* 18 December – Gwilym Hugh Lewis, World War I air ace (born 1897)\n* 19 December – Ronald Howard, actor and writer (born 1908)\n* 23 December\n** Ronnie Scott, jazz musician and club owner (born 1927)\n** Emrys Thomas, Welsh politician (born 1900)\n* 29 December – Alma Birk, Baroness Birk, politician and journalist (born 1917)\n* 30 December – Michael Roberts, historian (born 1908)\nSee also\n* List of British films of 1996\nReferences"
    }
  ]
}