{
  "content": [
    {
      "type": "text",
      "text": "# 1999–2000 Chilean presidential election\n\n| election_date = 12 December 1999 (first round)\n| turnout = 89.95% (first round)  1.28pp90.63% (second round)\n| image1 = Ricardo Lagos (2002).jpg\n| candidate1 = Ricardo Lagos\n| party1 = Party for Democracy\n| alliance1 = Concertación\n| colour1 = FFA500\n| popular_vote1 = 3,683,158\n| percentage1 = 51.31%\n| image2 = Joaquín Lavín.jpg\n| candidate2 = Joaquín Lavín\n| party2 = Independent Democratic Union\n| alliance2 = Alliance for Chile\n| colour2 = 4682B4\n| popular_vote2 = 3,495,569\n| percentage2 = 48.69%\n| title =President\n| before_election = Eduardo Frei Ruiz-Tagle\n| before_party = PDC\n| after_election = Ricardo Lagos\n| after_party = PPD\n}}\nPresidential elections were held in Chile on 12 December 1999, with a second round on 16 January 2000.\nSix candidates contested the first round, including two women running for the first time. The elections also saw the introduction of a two-round system. Ricardo Lagos and Joaquín Lavín emerged as the top two candidates in the first round, with Lagos having a slight lead. In the second round, Lagos won with 51% of the vote against Lavín's 49%.\nCandidates\nThe candidates, in order of appearance on the ballot, were:\n* Arturo Frei Bolívar, independent with the support of the Popular Alliance (Union of Center Center and independent movements).\n* Sara María Larraín Ruiz-Tagle, independent with the support of environmentalist groups.\n* Gladys Marín Millie, Communist Party.\n* Tomás Hirsch Goldschmidt, Humanist Party (also supported by The Greens).\n* Ricardo Lagos Escobar, Concert of Parties for Democracy (Party for Democracy).\n* Joaquín Lavín Infante, Alliance for Chile (Independent Democratic Union).\nConcertación candidate\nThe 1999 presidential race was overshadowed by the economic crisis that plagued the country, causing significant turmoil for Eduardo Frei Ruiz-Tagle's administration. The country was grappling with negative growth and an unemployment rate of nearly 11%. Despite the challenging circumstances, the Christian Democracy (PDC), the primary governing party, aspired to win its third consecutive term. Gabriel Valdés Subercaseaux, Alejandro Foxley, Enrique Krauss, and Andrés Zaldívar were among the notable figures who vied for the position. Finally, Senator Andrés Zaldívar was nominated as a pre-candidate by the PDC.\nMeanwhile, Ricardo Lagos Escobar, who had contested for the left wing of the Concertación in 1993, emerged as the left's candidate once again. Lagos stepped down from his role as Minister of Public Works on July 31, 1998, to focus on his presidential campaign. He started his campaign from the Chile XXI Foundation, where he assembled a team that would play a vital role in his campaign.\nOn Sunday, May 30, 1999, an open and binding primary was held, in which over 1.2 million voters participated. Ricardo Lagos emerged victorious with a 71% vote, defeating Andrés Zaldívar.\nAlianza candidate\nJoaquín Lavín emerged as the leading contender for the presidential nomination on the right. He had served two successful terms as the mayor of Las Condes from 1992 to 1999, winning 78% of the votes in his re-election campaign in 1996. Lavín appeared to be a promising candidate who could achieve what was often elusive for right-wing candidates. During his tenure as mayor, Lavín introduced a leadership style that focused on resolving specific community issues through municipal plebiscites, security measures, and exceptional communication management.\nIn National Renewal, businessman Sebastián Piñera had initially been favored, but he withdrew his candidacy in favor of Lavín after four months of campaigning.\nOther candidacies\nGladys Marín, a member of the Communist Party, became the Leftist Unity's presidential candidate for the 1999 elections in June 1998. This was the first time that a Communist Party member had been nominated for this position. Her candidacy aimed to establish an alternative social and political movement to the existing system.\nTomás Hirsch, a former ambassador to New Zealand, was proclaimed a presidential candidate in 1999. He was previously a member of the Humanist party until they left the Concertación in 1993. Hirsch received the endorsement of his party as well as Los Verdes.\nSara Larraín, an independent candidate, received support from various environmental groups. She was able to collect 0.5% of the signatures required to present her candidacy.\nArturo Frei Bolívar, a former PDC member, was proclaimed a candidate on August 9. He received support from the Union of Center Center, independents, and other sectors, forming the Popular Alliance. He did not receive support from his cousin, president Eduardo Frei Ruiz-Tagle.\nFailed candidacies\nThe evangelical pastor Salvador Pino Bustos presented his independent presidential candidacy, but it was rejected for not reaching the minimum number of signatures required by law and for exceeding the maximum percentage of signatories affiliated with political parties.\nFirst round\nThe Concertación's celebration of the open primaries filled them with optimism, as the high level of participation in the clean and organized process led many to believe that the December election was already won. Lagos' victory with over 71% of the votes from over 1.4 million voters further fueled this triumphalist atmosphere.\nWith a sense of sure victory, Lagos and his campaign team delayed their presidential campaign to incorporate the Christian Democracy, which was experiencing internal turmoil after their candidate's defeat. However, Joaquín Lavín's active campaign helped him counteract Lagos' winning momentum by positioning himself as the candidate of change, while Lagos was perceived as responsible for the economic crisis.\nLavín was able to distance himself from the dictatorship with the arrest of Pinochet, and the fact that the ruling coalition's candidate was located further to the left than his predecessors allowed him to capitalize on popular discontent caused by the economic crisis.\nForty days before the election, Lagos and Lavín participated in a televised debate that achieved a high audience rating of 75%. Lagos was declared the winner of the debate with 45.9% compared to Lavín's 35.7%. Polls leading up to the debate showed a minimal difference between the two candidates, which was maintained until the end of the first round.\nCampaign slogans\n* Arturo Frei Bolívar: One like you\n* Sara Larraín: Vote freely\n* Gladys Marín: For a true Chile with Gladys\n* Tomás Hirsch: With the strength of the human\n* Ricardo Lagos:\n** Growing with equality (1st round)\n** A much better Chile (2nd round)\n* Joaquín Lavín\n** Long live the change (1st round)\n** Join the change (2nd round)\nPolls\n{| class=\"wikitable\"\n!Poll\n!Field dates\n!Lagos\n!Lavín\n!Marín\n!Hirsch\n!Larraín\n!Frei\n!Undecided\n|- align=\"right\"\n| align=\"left\" |CEP\n| align=\"center\" |April/May, 1999\n| bgcolor=\"#FFE5B4\" |40%\n|29%\n|2%\n|1%\n| align=\"center\" | -\n|2%\n|8%\n|- align=\"right\"\n| align=\"left\" |CEP\n| align=\"center\" |September/October, 1999\n| bgcolor=\"#FFE5B4\" |46.4%\n|44.4%\n|3.4%\n|0.8%\n|0.7%\n|1.3%\n|2.9%\n|}\nSecond round\nAfter Ricardo Lagos narrowly defeated Joaquín Lavín with 47.96% and 47.51% of the vote, respectively, in the first round, a second round was held in January 2000 to decide the winner. Lagos' failure to secure an absolute majority of votes in the initial round had repercussions for his campaign, and Soledad Alvear, Eugenio Tironi, and Carlos Montes took on the role of executive directors to help turn things around. Meanwhile, Lavín's campaign was marked by his \"crusade for change,\" during which he traveled to over 70 cities throughout the country.\nThis was the first time that a presidential second round, which was established in the 1980 Constitution, took place. Despite the Communist Party's call for a null vote, the votes garnered by their candidate, Gladys Marín, as well as those received by candidates Sara Larraín and Tomás Hirsch, were transferred to Lagos, enabling him to win by a narrow margin of 2.6 percentage points. Arturo Frei Bolívar, another candidate, gave his endorsement to Joaquín Lavín.\nResults\n}}\nReferences"
    }
  ]
}