{
  "content": [
    {
      "type": "text",
      "text": "# 1999 Algerian presidential election\n\nPresidential elections were held in Algeria on 15 April 1999. Abdelaziz Bouteflika was elected with 74% of the vote after the other six candidates withdrew on the eve of the elections.\nBackground\nIncumbent president Liamine Zéroual announced in September 1998 that early presidential elections would be held in February 1999. He also said that he would not be a candidate, in a move which was reported as being due to infighting within the Algerian army. The election date was later set for 15 April and the official campaign began on 25 March. The government set up the Independent National Commission for Monitoring the Presidential Election (CNISEP) to oversee the elections, and Zéroual called upon all government officials to remain neutral.\nThe elections took place amidst a backdrop of continuing conflict in the Algerian Civil War. Restoring peace to the country was the major election issue.\nCandidates\nThe frontrunner was former foreign minister, Abdelaziz Bouteflika, who was supported by much of the military and establishment. Bouteflika had the backing of the two main parties in the governing coalition and said that he would work to increase trust in the government and would not rule out talking to anyone. Pro-government newspapers described Bouteflika as the \"national consensus candidate\".\nThe other candidates included Ahmed Taleb Ibrahimi, a former education and foreign minister, who received backing from the outlawed Islamic Salvation Front (FIS). He supported talking with the FIS and for the military to withdraw from politics. Another candidate Abdallah Djaballah, the founder of the Movement for National Reform, called for a government of national unity to be formed.\nTwo former prime ministers were candidates. Mouloud Hamrouche, prime minister from 1989 to 1991 was a former member of the governing National Liberation Front (FLN) who had fallen out with the leaders of the party. Mokdad Sifi was prime minister from 1993 to 1995 and was backed by part of the National Rally for Democracy (RND) which did not support Bouteflika. He opposed an amnesty or negotiations with murderers of women and children.\nYoucef Khatib was an independent candidate and former advisor to Zéroual's 1995 election campaign. Hocine Aït Ahmed, the founder of the Socialist Forces Front, campaigned by calling for Algeria to be neither a military dictatorship or Islamic fundamentalist state. Near the end of the campaign Ahmed had a heart attack and had to go to Switzerland for treatment.\nMass withdrawal\nFewer than 24 hours before the elections, all candidates except Bouteflika withdrew, claiming the vote would not be fair. The candidates claimed that electoral fraud by the army ensured that Bouteflika would win the election, and that voter lists were being padded and extra ballot papers being printed to support Bouteflika. The United States said they were disappointed with how the election occurred and was a 'step back' for democracy.\nZéroual refused to meet the candidates to discuss their grievances and criticised them for withdrawing, describing the move as illegal.\nResults\nOfficial figures showed turnout to be 61% with Bouteflika winning easily. However, the other candidates claimed that turnout was much lower, with Ibrahimi estimating it had only been around 25%.\nReferences"
    }
  ]
}