{
  "content": [
    {
      "type": "text",
      "text": "# 19th-century Catholic periodical literature\n\nThe 19th-century Catholic periodical literature is unique in many respects. Most of the periodical publications in mainly Catholic countries can be regarded as \"Catholic\" literature up to a few decades before 1800: the editorial line is implicitly Catholic in most instances.\nThe development of the press in the 19th century was in general terms a major factor in secularization according to Owen Chadwick. On the other hand, mass printing also meant that the \"Pope of 1889 was far more influential that the Pope of 1839 because the later Pope was surrounded by the press and the earlier Pope was not\" wrote Chadwick.\nBackground\nThe Catholic Encyclopedia of 1913 offered an analysis in terms of several factors. Periodical literature includes the political newspaper, the weekly, and literary and specialized magazines and journals appearing less frequently: in some countries such as Spain the implicit Catholicism persisted in the press for many years. The American-style, news-led paper would sell on its news content, rather than editorial line, and therefore Catholic newspapers could compete as dailies. European papers and weeklies relied more on the feuilleton and generally had more op-ed content. This meant they showed \"greater animosity to the Church\".\nCase studies\n19th-century England\nThe pioneer Catholic publication in England, ''Andrews' Orthodox Journal'', was first issued in 1812 by Eusebius Andrews, a Catholic printer and bookseller of London. It had just a few years of chequered existence, as there was not a sufficiently large reading public to make it self-supporting.\nThe real beginnings of Catholic periodical literature were made more than twenty years later, by which time the growth of the Catholic body in its new emancipation, the progress of Catholic education, and the interest excited by the Tractarian movement had combined to supply a wider circle of readers. Nicholas Wiseman and Daniel O'Connell founded a quarterly, the Dublin Review (1836). The fame of the Edinburgh Review suggested a territorial title, and Dublin was chosen as a Catholic centre; but from the first it was edited and published in London. The review was intended to provide a record of current thought for educated Catholics and at the same time to be an exponent of Catholic views to non-Catholic inquirers. Beginning before the first stirrings of the Oxford Movement, it presents a record of the intellectual life of the century and produced articles which had an immense influence upon the religious thought of the times. It was in August 1839 that an article by Wiseman on the Anglican Claim caught the attention of John Henry Newman. Impressed by the application of the words of St. Augustine, securus judicat orbis terrarum, which interpreted and summed up the course of ecclesiastical history, he saw the theory of the Via media \"absolutely pulverized\" (Apologia, 116–7). I\nGradually the Tractarian converts appeared in the lists of contributors: Ward, Frederick Oakeley, Marshall, John Brande Morris, Christie, Henry Formby, Capes, Thomas William Allies, Anderson, Manning, and a glance through the volumes of the \"Dublin' will reveal names prominent in the great religious, scientific, and literary movements of the century. During the sixties and the early seventies it was under the direction of Dr. W. G. Ward. After his retirement it was edited by John Cuthbert Hedley, afterwards Bishop of Newport, and then acquired by Cardinal Manning, who appointed Canon Moyes editor. It was the property and under the direction of Wilfrid Ward, son of its previous editor.\nThe first issue of the annual Catholic Directory appeared in 1837. Owing to the Oxford Movement, the forties were a time of marked literary activity. In 1840 two new enterprises were inaugurated. Charles Dolman, a Catholic publisher in London who had issued a number of important books including the writings of John Lingard and Husenbeth, produced in \"Dolman's Magazine\" a high class literary monthly, and on 16 May 1840, Frederick Lucas became the pioneer of the Catholic newspaper press in England by publishing the first number of The Tablet, a weekly newspaper and review. Lucas regarded his work as founder and editor of a Catholic paper as a sacred mission. His uncompromising views led to difficulties with his financial supporters, but he emerged triumphant.\nFor a while after the crisis of 1848 Lucas, then active in Irish politics, removed The Tablet office to Dublin, but it was brought back to London by the new proprietors, into whose hands it passed when failing health compelled Lucas to give up the editorship. For many years after his death, in 1855, \"The Tablet\" was a mere humdrum record of news. Among the distinguished editors was Cardinal Vaughan who conducted the \"Tablet\" during the stormy discussions on papal infallibility and the First Vatican Council. When he became Bishop of Salford, he placed the editorship in the hands of Elliot Ranken, who was succeeded by John George Snead-Cox. \"The Tablet\",  under the terms of the trust created by Cardinal Vaughan, had its profits go to the support of St. Joseph's Missionary College, of which he was the founder.\nIn 1846, Bradley founded The Lamp, a penny magazine whose price was intended to make it accessible to Catholics who could not afford the five-cent Tablet. It featured Catholic fiction, essays, news, and lectures by Wiseman, among other similar topics. The paper struggled financially, and Bradley spent some time in the debtors' prison at York, where he continued to act as editor.\nThe first issue of The Rambler appeared on 1 January 1848. It was intended to be a review of literature, art, and science. In 1859, Lord Acton, who had then just returned from the Continent, succeeded Newman in the editorship. The price, sixpence, limited its public and in 1862 it became a quarterly under the title of \"The Home and Foreign Review\". In its last years this review was a source of trouble and disedification, and its sale, which dwindled yearly, was largely among Anglicans and other non-Catholics.\nIn the mid years of the nineteenth century the abolition of the various taxes on newspapers and the cheapening of the processes of production led to the coming of the penny newspapers. The first Catholic penny paper with permanent success was The London Universe. Its origin was connected with the earlier activity of Lucas, who successfully advocated the introduction of the Conferences of St. Vincent de Paul into England. It was a group of members of the London Conferences who produced \"The Universe\". Speaking to their president George Blount, one evening in 1860 Cardinal Wiseman after alluding to the attacks in the Press against the Holy See said: \"Cannot the Society of St. Vincent de Paul do something to answer those frightful calumnies, by publishing truths, as M. Louis Veuillot is doing in Paris in 'L'Univers'? We want a penny paper, and now that the tax has been removed it should be possible.\" It was decided that, though the society, as such, could not found a newspaper, a committee of its members should undertake the task. It included George Blount, Stuart Knill (afterwards the first Catholic Lord Mayor of London), Viscount Fielding (Lord Denbigh), Viscount Campden (the convert Sir Charles George Noel, 2nd Earl of Gainsborough), Sidney Lescher, Archibald Dunn, Arthur William à Beckett, and George J. Wigley, the London correspondent of the Paris Univers. Wigley secured a foreign news service for the projected paper from Louis Veuillot's Paris office, and at his suggestion the name of The Universe was chosen. Denis Lane undertook the printing, Mr. Dunn the editorship, and on 8 December 1860, the first Catholic penny paper in England was started.\nAt first it was strictly non-political. The editor and staff gave their services gratuitously, but even with this help expenses were greater than receipts. To attract a larger circulation political articles were inserted, which led to the resignation of the greater part of the staff. Mr. Lane then took over the paper and conducted it for many years as a Catholic paper, giving a general support to the Liberals and the Irish national cause. He had always a priest as \"theological editor\"; amongst those who thus assisted him were Father W. Eyre, S.J., Father Lockhart, and Cardinal Manning. The movement for the rescue of destitute Catholic children originated in \"The Universe\" office. It amalgamated with another paper, The Catholic Weekly, founded to give a record of Catholic news without any party politics, thus reverting to its original programme.\n\"The Lamp\" was reorganized about the same time and had for some years a prosperous existence as a popular magazine. Fathers Rawes and Caswall, Lady Georgiana Fullerton, Augusta Theodosia Drane, Cecilia Caddell were among its contributors. In 1864 Miss Taylor founded The Month, at first an illustrated magazine giving much of its space to fiction and the lighter forms of literature. When she founded her first community of nuns (Poor Servants of the Mother of God), her magazine passed to the Jesuits, under the editorship of the Father Henry J. Coleridge. It had many notable contributors, and in its pages Newman's Dream of Gerontius first appeared.\nNumerically, the main strength of English Catholicism has always been in the North, and after the foundation of \"The Universe\" several efforts were made to produce a Catholic penny paper in Lancashire. Three successive enterprises had a brief career. A fourth, a paper known as \"The Northern Press\" was barely existing, when, in 1867, it was taken over by Father James Nugent of Liverpool. He renamed it \"The Catholic Times\" and gradually made it the most widely circulated Catholic paper in England. Printed for many years by the boys of the refuge he had founded in Liverpool, when it became a profit-earning paper it helped support this work of charity. Offices were opened in Manchester and London. A special London edition was produced, and in 1878 a Christmas supplement issued under the title of \"The Catholic Fireside\" was so successful that it was continued as a monthly penny magazine; in 1893 it was made a weekly publication. \"The Catholic Times\" appealed largely to the Catholics of Irish descent in Great Britain, and championed the Irish Nationalist cause.  P. L. Beazley directed it for many years.\nIn the sixties other papers were founded, for a while fairly prosperous, though they never won the established position of \"The Catholic Times\" and \"The Tablet\". \"The Weekly Register\" was a threepenny paper, of much the same character as \"The Tablet\", but favouring the Liberals and Nationalists. Later, under the editorship of Charles Kent and then of Wilfrid Meynell, it had a marked literary quality. \"The Weekly Register\" ceased to exist and with it \"The Westminster Gazette\", whose name is now that of a London evening paper. The \"Westminster\" was owned and edited by Pursell, afterwards biographer of Manning. During the months of newspaper controversy that preceded the definition of papal infallibility the \"Westminster\" was \"non-opportunist\", and Cardinal Vaughan, while he avoided all controversy on the subject in \"The Tablet\", contributed, week after week, letters to the \"Westminster\", combating its editorial views. It never had much circulation, and Vaughan was able a few years later to end its competition by buying and stopping it. Father Lockhart edited for some years \"Catholic Opinion\", a penny paper giving extracts from the Catholic press at home and abroad. After his death it was amalgamated with \"The Catholic Times\".\nCharles Diamond, for some time a member of the Irish Parliamentary party, started in 1884 \"The Irish Tribune\" in Newcastle upon Tyne. Shortly after, he purchased two other Catholic papers, the Glasgow \"Observer\" and the Preston \"Catholic News\", which were in difficulties for want of capital. He then formed the idea of working several papers from a common centre, much of the matter being common to all, but each appearing under a local title and having several columns of special matter of local interest. He  issued the Catholic Herald from London, as the centre of the organization, and thirty-two other local weekly papers in various towns of England, Wales, and Scotland. He also produced on the same system ten different parish magazines and \"The Catholic Home Journal\", with which the old \"Lamp\" was amalgamated.\nThere were a considerable number of minor Catholic monthlies, mostly founded in recent years to advocate and promote special objects. The \"Annals of the Propagation of the Faith\" and \"illustrated Catholic Missions\" specialize on the news of the mission field. \"Catholic Book Notes\", a monthly issued by the Catholic Truth Society and edited by James Britten, was a record of current literature and reviews. \"The Second Spring\", edited by Father Philip Fletcher, was a record of the work of the Ransom League for the conversion of England. \"The Crucible\" was a monthly review of social work for Catholic women.\nDevotional magazines were issued by various religious orders, the most widely circulated of which was the \"Messenger of the Sacred Heart\", edited by the Jesuits. There were also several college magazines. In general circulations were quite low.\nPoland under foreign partitions\nThe Polish Catholic press reflected the political conditions of the empires that had annexed the territory of Poland. In Galicia, part of Austria-Hungary, it was considerably freer; in Imperial Russia and in the German Empire there was severe censorship of all Polish language periodicals. Greater development took place from 1831 to 1864 in the period of national insurrections against the occupying powers.\nOne of the oldest Polish publications in the Austrian Partition was the  (Time) daily, the organ of the Conservative party. Its publication began in 1848. In 1866 there appeared the  (Polish Review), which had from its beginning the collaboration of Count Stanisław Tarnowski and Stanisław Egbert Koźmian. The  and the  always maintained a strictly Catholic character. In 1867 Juliusz Starkla and Tadeusz Romanowicz established at Lemberg (Lwów) the  (Literary Journal), which had a short life; Jan Dobrzański founded the  (National Gazette), to which was united in 1869 the  (Polish Journal). In 1871, Edward Podolski established the  (Lemberg Review), which strenuously defended Catholic interests. In the same city there appeared the  (Lemberg Gazette), the organ of the imperial viceroy in Galicia.\nIn 1884 the Polish Jesuits began at Kraków (Cracow) the publication of the  (Universal Review), covering scientific and literary points of view. In the same city from 1881 to 1886 there was published the  (Literary and Artistic Review). In 1894 in the whole of Austria-Hungary there were 126 Polish periodicals and daily papers, of which 65 appeared at Lemberg (Lwów, in Polish) and 29 at Kraków. At Lemberg the daily papers were the , the , the , the , and the . There were two Catholic weeklies, the  and the .\nThe  (Ecclesiastical Gazette), representative of the Catholic press, was a small semi-weekly, poor in doctrine and immersed in politics. From the scientific standpoint the most important periodical was the  (Tri-monthly historical periodical), which began publication in 1886. Also important were the  (Literary Memoirs), the , the  (the organ of the society of naturalists of Lemberg), and the .\nAt Kraków, besides the , there were the  and the  (Voice of the People), an organ of the clergy and of the militant Catholic party. The Socialists published there the  (Forward), the official organ of their party, and the monthly periodical . In following years there has been established the  (Slavic World), the organ of the Slav club of Kraków, containing valuable information relating to the various Slavic countries. The Academy of Sciences of Kraków published a Bulletin international, monthly; and the  (Dissertations) of mathematics, physics, and biology. Daily papers and periodicals were published also in the other Galician cities of Tarnów, Rzeszów, Sambor, Stanisławów, Jarosław, and Przemyśl.\nOne of the oldest Polish daily papers in Prussia was the  (Posen Journal), established in 1859. From 1845 to 1865 there appeared the , an ardent defender of Catholicism, edited by Jan Koźmian; in 1860, Jan Prusinowski published the  (illustrated weekly). In 1865, Ludwik Rzepecki began the publication of the scientific periodical  (Culture), which, however, had only a short life, and was followed by the  (Review of Greater Poland), edited by Emil Kierski. In 1870, Edmond Callier founded the , to which leading Polish writers contributed. The , established by Teodor Żychliński in 1872, also acquired great importance. In 1894 there were published in Prussia and in the Grand Duchy of Posen the following daily papers: the , the , the , the nationalist  (Advocate), and the . The  resumed its publications under the direction of Władysław Rabski, while other daily papers were published at Danzig (Gdańsk), Thorn (Toruń), Pelplin, and Allenstein (Olsztyn).\nIn 1841 the publication of the , a monthly periodical dedicated especially to literature, began in Russian Poland. There were published in Warsaw the  (Day); the  (Universal Journal); the  (Voice of Warsaw);  (Voice of Morning); the ; ; ; ;  (Daily News);  (Word), a nationalist paper that had great influence; and the . Other dailies were published at Lublin, Kiev (), at Vilna ( and ) at Łódź and at St. Petersburg. Among the periodicals, besides the , were the  (Literary Banquet), splendidly illustrated; the , hostile to religiocity; the  (Philosophical Review), a quarterly publication; the  (Historical Review), scientific, twice monthly; the  (World), an illustrated weekly; and the . The Catholic press was represented by the , of Warsaw, a publication dedicated to politics. This paper was the one most read by the clergy. Count Roger Łubieński () established the  (Faith), a weekly devoted to ecclesiastical news; and these two publications were later united into one. A scientifically important periodical, the , lasted only a few years. By the early twentieth century, of the daily papers or periodicals for the clergy, or having a strictly Catholic programme, those most read were: the ; the , of Częstochowa; and the , of the seminary of Włocławek, a monthly scientific publication.\nIn 1864 Polish exiles established the  (Native Land) at Leipzig, the  (The Future) at Paris, and the  at Dresden. At Chicago, U.S.A., the chief centre of Polish emigration, were published the , the  (Holy Day), the , the , the  (New Life), the , , , , and , a musical publication. Other papers were published at Milwaukee, Buffalo, N.Y., New York City, Detroit, Philadelphia, Winona, Cleveland, Ohio, Toledo, Baltimore, Pittsburgh, Stevens Point, Manitowoc, Mahanoy City, and Wilkes-Barre. Brazil also had a Polish publication.\nNotes\n:a.  Orędownik continued to be published well into the 1930s in sovereign Poland, embracing religious intolerance and social conservatism. It was printed in Poznań by Wydawnictwo Drukarnia Polska with Bohdan Jarochowski as its editor-in-chief.\nReferences\n;Bibliography\n*\n*\n*\n*\n*\n*\n*\n*"
    }
  ]
}