{
  "content": [
    {
      "type": "text",
      "text": "# 19th Light Brigade (United Kingdom)\n\n| type                          = Infantry\n| role                          = Reserve Light Infantry\n| size                          = Brigade\n| command_structure             = 1st (UK) Division\n| garrison                      = Imphal Barracks\n| current_commander             = Brigadier Lisa Brooks\n| notable_commanders            = Horace Smith-DorrienGeneral Sir Mark Carleton-Smith\n| battles                       = First World WarSecond World WarWar in AfghanistanOperation Telic\n}}\nThe 19th Brigade is an Army Reserve formation of the British Army. As the 19th Infantry Brigade, it fought in the First and Second World War.\nThe formation became 19th Light Brigade in 2005, and moved to Northern Ireland following the end of Operation Banner and \"normalisation\" of British military operations in the province. Following the 2010 Strategic Defence and Security Review (SDSR), the brigade entered suspended animation in March 2013. As part of the Future Soldier reform, the brigade was reactivated in 2022.\nFirst World War\n19th Infantry Brigade was not part of the original British Expeditionary Force (BEF) but was formed in France between 19 and 22 August 1914 from line of communication defence battalions as an independent brigade. It immediately went into action at the Battle of Mons on 23 August, then participated in the Retreat from Mons and subsequent battles under various corps headquarters.\nFrom 12 October 1914 the brigade was attached to 6th Division at the time of the Battle of Armentières, transferring to 27 Division on 31 May 1915. On 19 August 1915, 19th Bde formally joined 2nd Division (replacing 4th (Guards) Bde, which had left to join the new Guards Division). It served with 2nd Division at the Battle of Loos.\nThese attachments had all been to formations of the Regular Army, but on 25 November 1915, 2nd Division exchanged 19th Bde with a brigade from 33rd Division, a newly-arrived 'New Army' ('Kitchener's Army') formation. The intention was to share experience, and as soon as it joined 33rd Division, the brigade exchanged one of its veteran battalions with one of the  newcomers. It remained with 33rd Division on the Western Front until the Armistice with Germany. Like the rest of the BEF, it was reduced from a four-battalion to a three-battalion establishment in February 1918.\nOrder of battle\nThe independent brigade's initial composition was as follows:\n* 2nd Battalion, Royal Welch Fusiliers – to 38th (Welsh) Division 4 February 1918\n* 1st Battalion, Cameronians (Scottish Rifles)\n* 1st Battalion, Middlesex Regiment – to 98th Bde in 33rd Division 27 November 1915\n* 2nd Battalion, Argyll and Sutherland Highlanders – to 98th Bde 27 November 1915\n* 19th Bde Ammunition Column, Royal Field Artillery – probably absorbed into 2nd Divisional Ammunition Column\n* 19th Field Ambulance, Royal Army Medical Corps\n* No 8 Company, Army Service Corps (ASC) – to 33rd Divisional Train, ASC, 25 November 1915\nSubsequent additions:\n* 1/5th Battalion, Cameronians (Scottish Rifles) (later 5th/6th Battalion) (Territorial Force) – joined 19 November 1914\n* Section, 2nd Division Signal Company, Royal Engineers (RE) – transferred with brigade to 33rd Division\n* 11th Field Company, RE – transferred with brigade to 33rd Division\n* 20th (Service) Battalion, Royal Fusiliers (3rd Public Schools) – from 98th Bde 27 November 1915; disbanded 2–15 February 1918\n* 1/6th Battalion, Cameronians (Scottish Rifles) (TF) – joined from 100th Bde, 33rd Division, and amalgamated with 1/5th Bn 29 May 1916\n* 1st Battalion Queen's (Royal West Surrey Regiment) – joined from 100th Bde 5 February 1918\n* 19th Bde Machine Gun Company, Machine Gun Corps (MGC) – formed in the brigade 24 February 1916; joined No 33 Battalion, MGC,  9–19 February 1918\n* A/19 Light Trench Mortar Battery – formed by 26 January 1916; became 19/1 LTMB 23 March 1916; amalgamated by 24 June 1916\n* B/19 Light Trench Mortar Battery – formed by 15 March 1916; became 19/2 LTMB 23 March 1916; amalgamated by 24 June 1916'\n* 19 Light Trench Mortar Battery – formed by 24 June 1916\nCommanders\nThe following officers commanded the brigade:\n* Maj-Gen L.G. Drummond, 22 August 1914, sick 27 August 1914\n* Lt-Col B.E. Wards, acting 27 August–5 September 1914\n* Brig-Gen Hon F. Gordon, 5 September 1914 – 14 June 1915\n* Brig-Gen P.R. Robertson, 14 June 1915 – 13 July 1916\n* Brig-Gen C.R.G. Mayne, 13 July 1916–Armistice\n* Lt-Col J.G. Chaplin, acting 28–31 August 1916\n* Lt-Col St B.R. Sladen, acting 8 March, killed 12 March 1918\n* Lt-Col H. Storr, acting 12 March, wounded 13 March 1918\n* Lt-Col H.B. Spens, acting 13–25 March 1918\nSecond World War\nThe 19th Infantry Brigade was a regular British Army formation at the beginning of the Second World War. It had been raised in 1938 for Internal Security in Palestine, and appears to have joined the 7th Infantry Division on its reformation in September–October 1938. On 3 September 1939, it was converted to HQ Jerusalem Area.\nPost-1945\nIn the late 1970s, as 19 Airportable Brigade, throughout the 1980s, as 19 Infantry Brigade the 19th Brigade was based at Colchester as part of the 3rd Infantry Division.\nStructure 1989\nComponent units in 1989:\n* Headquarters 19th Infantry Brigade and 209th Signal Squadron, Royal Corps of Signals\n* The Royal Hussars (PWO) (Tidworth)\n* 1st Battalion, King's Own Royal Border Regiment\n* 1st Battalion, Royal Anglian Regiment\n* 3rd Battalion, Royal Anglian Regiment\n* 34 Field Squadron, Royal Engineers\nIt would have had to cross the English Channel to join the rest of the division, stationed with the British Army of the Rhine in Germany. Following the disbandment of the 3rd Armoured Division following the end of the Cold War, the brigade joined the new 3rd Mechanised Division, and moved to Catterick Garrison in Yorkshire in April 1993. The brigade signal squadron was based at Gaza Barracks, Catterick Garrison. The brigade deployed as part of Operation Grapple 5, the UK contribution to the United Nations Protection Force (UNPROFOR) in the former Yugoslavia, between November 1994 and May 1995. They were replaced by 20 Armoured Brigade HQ and Signal Sqn.\nIn September 1995, the HQ and Signal Sqn deployed on Exercise SUMAN WARRIOR at Canberra Lines, Terendak Camp, Malaysia. Members of the Signal Sqn also deployed on EX Med Man 5 in 1996 as part of the 1KORBR battle group at British Army Training Unit Suffield, Canada. The HQ and Signal Sqn then deployed to Operation Lodestar in the Former Yugoslavia between November 1997 and May 1998.  This was as part of the NATO SFOR deployment. The brigade HQ and Signal Squadron were part of MND SW HQ AND SIGNAL SQN based at the Banja Luka metal factory and other locations.\nAs part of the Delivering Security in a Changing World review in 2003, it was announced that the brigade was to become a 'light' formation. The brigade deployed on Operation Telic 2 between May and November 2003 taking over from 7 Armoured Brigade. The brigade became 19 Light Brigade as of 1 January 2005, and deployed to Iraq on Operation Telic 9 (November 2006 – May 2007) for an unusually long 7-month tour before handing over to 1 Mechanised Brigade and returning to Catterick. It then began moving to Northern Ireland following the end of Operation Banner and \"normalisation\" of British military operations in the province.\nThe brigade deployed on Operation Herrick 10 in April 2009, replacing 3 Commando Brigade, where it planned and executed Operation Panther's Claw – named after Bagheera, the panther forming the brigade insignia. The brigade returned to the UK in October 2009 having taken over 70 fatalities --- significantly more than seen in previous operational tours of Afghanistan.\nSecretary of Defence Liam Fox announced on 18 July 2011 that the 19th Brigade was to be disbanded as part of the 2010 Strategic Defence and Security Review (SDSR) in March 2013.\nBrigade Commanders\nRecent commanders have included:\n;19th Infantry Brigade\n* 1967–1969 Brigadier WNR Scotter, Late KORBR\n* 1969–1971 Brigadier GLC Cooper, Late RE\n* 1973–1975 Brigadier JM Glover, Late RGJ\n* 1975–1977 Brigadier RF Vincent, Late RA\n* 1985–1987 Brigadier TP Toyne Sewell, Late KOSB\n* 1989–1991 Brigadier CD Farrar-Hockley, Late PARA\n* 1991–1993 Brigadier EJ Webb-Carter, Late GREN GDS\n* 1994–1995 Brigadier RDS Gordon, Late 17/21L\n* 1995–1997 Brigadier ADA Duncan, Late PWO\n* 1997–2000 Brigadier PTC Pearson, Late RGR\n* 2000–2001 Brigadier NH Rollo, Late RE\n* 2001–2003 Brigadier WH Moore, Late RA\n;19th Light Brigade\n* 2003–2005 Brigadier C Chapman, Late PARA\n* 2005–2007 Brigadier TP Evans, Late RIFLES\n* 2007–2010 Brigadier TB Radford, Late RIFLES\n* 2010–2012 Brigadier SR Skeates, Late RA\n* 2012–2013 Brigadier EJR Chamberlain, Late RIFLES\n;19th Brigade\n* 2022–2024 Brigadier O Lyttle, Late R IRISH\n* 2024-present Brigadier L Brooks, Late RA\nReformation\nIn 2021, as part of the Future Soldier initiative, it was announced that the 19th Brigade would be reformed with its headquarters at Imphal Barracks, York. The brigade, tasked with home defence and resilience duties, officially re-formed on 23 July 2022 under the command of the 1st (United Kingdom) Division.\nOn its reformation in July 2022 the brigade's units were listed as:\n*Queen's Own Yeomanry, at Fenham Barracks, Newcastle upon Tyne\n*Scottish and North Irish Yeomanry, at Redford Barracks, Edinburgh\n*52nd Lowland Volunteers, 6th Battalion, Royal Regiment of Scotland, at Walcheren Barracks, Glasgow\n*51st Highland Volunteers, 7th Battalion, Royal Regiment of Scotland at Queen's Barracks, Perth\n*4th Battalion, Duke of Lancaster's Regiment (King's, Lancashire and Border), at Kimberley Barracks, Preston\n*3rd Battalion, Royal Anglian Regiment, in Bury St Edmunds\n*4th Battalion, The Royal Yorkshire Regiment (14th/15th, 19th and 33rd/76th Foot), at Worsley Barracks, York\n*2nd Battalion, Royal Irish Regiment (27th (Inniskilling), 83rd, 87th and Ulster Defence Regiment), at Thiepval Barracks, Lisburn\n*6th Battalion, The Rifles, at Wyvern Barracks, Exeter\n*8th Battalion, The Rifles, in Bishop Auckland\nReferences\nBibliography\n* A.F. Becke,History of the Great War: Order of Battle of Divisions, Part 1: The Regular British Divisions, London: HM Stationery Office, 1934/Uckfield: Naval & Military Press, 2007, .\n* A.F. Becke,History of the Great War: Order of Battle of Divisions, Part 3b: New Army Divisions (30–41) and 63rd (R.N.) Division, London: HM Stationery Office, 1939/Uckfield: Naval & Military Press, 2007, .\n* James E. Edmonds, History of the Great War: Military Operations, France and Belgium, 1914, Vol I, 3rd Edn, London: Macmillan,1933/Woking: Shearer, 1986, .\n*\nExternal links\n* [http://www.longlongtrail.co.uk Chris Baker, The Long, Long Trail]\n* [https://web.archive.org/web/20130117215141/http://army.mod.uk/structure/29025.aspx 19 Light Brigade]- on British Army official website\n*[http://niehorster.org/017_britain/39_army/palestine.html British Army Dispositions in 1939]\n* [http://www.britishpathe.com/record.php?id=34018 \"Reinforcements Fly To M.E.\" British Pathe newsreel 1951]"
    }
  ]
}