{
  "content": [
    {
      "type": "text",
      "text": "# 19th-century glassmaking innovations in the United States\n\n]]\nVery few 19th-century glassmaking innovations in the United States happened at the beginning of the century. Only ten glass manufacturers are thought to have been operating in 1800. High-quality glassware was imported from England, and glassmaking knowledge was kept secret. England controlled a key ingredient for producing high–quality glassware and kept its price high—making it difficult for American glass manufacturers to compete price-wise. European glassmakers with the knowledge to produce high–quality glassware were, in some cases, smuggled to the United States. Eventually the American glass industry grew, and the second half of the century saw numerous innovations.\nThe two most significant innovations of the 19th century were mechanical pressing and a new formula for high quality glass. Mechanical pressing increased productivity and allowed more of the public to afford glassware. It was developed simultaneously at several locations during the 1820s. Among those that received pressing-related patents were John P. Bakewell of Bakewell and Company; Henry Whitney and Enoch Robinson of New England Glass Company; and Phineas C. Dummer, George Dummer, and James Maxwell of the Jersey City Glass Works. A new formula for glass, developed by William Leighton Sr. at J. H. Hobbs, Brockunier and Company, lowered costs and allowed even more people to afford glassware.\nMany mechanical innovations in the last half of the century involved the procedure for melting ingredients, cooling (annealing) newly made glass, and automation. By the end of the century a new machine designed by John H. Lubbers began to make many glassblowers obsolete, and work was being conducted on a bottle-making machine by Michael J. Owens that eventually revolutionized the bottle industry. Preliminary work by Irving Wightman Colburn had started that would change the way window glass was made. Owens and Colburn worked together to finish this new window glass process during the 20th century. A new formula for ruby glass, which did not need gold as an additive, was developed by Nicholas Kopp Jr. in the 1890s around the time of the start of the American auto industry.\nTwo fathers\nGlass is made by starting with a batch of ingredients, melting it, forming the glass product, and gradually cooling it. Other ingredients such as soda ash, potash, and lime are added. The batch is placed inside a pot or tank that is heated by a furnace to roughly 3090&nbsp;°F (1700&nbsp;°C). In the glass-making industry, the melted batch is called \"metal\". The metal is typically shaped into the glass product (other than window glass) by either a glassblower or pressing it into a mold. Window glass production during the 19th century involved blowing a long cylinder and flattening it. All glass products must then be cooled gradually (annealed) after the product is shaped, or else it will become brittle and possibly break. Annealing was originally conducted in the United States using a kiln that was sealed with the fresh glass inside, heated, and gradually cooled. Kilns were eventually replaced by a conveyer oven called a lehr.|group=Note}} In 1800, the United States is thought to have had no more than a ten operating glass factories. Most of the nation's glass products came from Europe. Lead ore, known as red lead, was a key ingredient necessary to make high-quality glassware, but England controlled the world's known supply.|group=Note}} The United States Embargo Act of 1807, and the War of 1812, made red lead extremely difficult to acquire. After the war England kept the price of red lead high, and dumped low-priced glass products in the United States. This drove some American glass companies into bankruptcy.\nOne of the few successful American glass companies was the New England Glass Company, which was incorporated in 1818 and led by Deming Jarves—who has been called the \"father of the American glass industry.\" Using assistance from the Harvard University library and a British engineer named James B. Barnes, Jarves developed a way to produce red lead from domestic sources of lead oxide. Jarves' red lead was good enough that his New England Glass Company was exporting cut crystal glassware to Europe by 1825. Jarves smuggled European glassmaking talent to America at a time when it was forbidden by European countries. However, the glassmakers themselves kept their techniques and recipes secret. If a company lost a skilled glassworker, it was possible that certain types of glass could no longer be made at the glassworks. Jarves began to keep records of glass recipes and procedures. This gave him more control over the intellectual rights of his company. New England Glass Company was a \"great innovator under the leadership of Deming Jarves\" and Jarves \"revolutionized the American glass industry\".\nBenjamin Bakewell founded a glass manufacturing company in Pittsburgh in 1808. This company, which began as Bakewell & Ensell, became Pittsburgh's best known glass manufacturer. It changed its name many times, but always had Bakewell as part of the name. Among the names used were Bakewell, Page & Bakewell; and Bakewell, Pears & Company. The Bakewell and Pears families were involved with the company for most of its existence, and Benjamin Page was an important member of the company in its early years. Bakewell needed skilled glassworkers early in the company's existence, so English glass men were smuggled to Pittsburgh. The company received its supply of red lead from Deming Jarves. Bakewell became well known for its lead crystal glass, and also made engraved and cut glassware. Other products, such as window glass and bottles, were also made. Jarves considered Benjamin Bakewell the \"father of the flint-glass [crystal] business in this country\".|group=Note}} In the 1820s and 1830s, Bakewell glassware was purchased for the White House by presidents James Monroe and Andrew Jackson.\n19th century innovations\nThe mechanical innovations, and other innovations, listed below are from an essay published in the December 1920 edition of Scientific American. The essay was titled Modern Glass-Making, and it was written by E. Ward Tillotson, assistant director of the Mellon Institute of Industrial Research. The essay contains a list titled Some Notable Developments in the Glass Industry. Some of these innovations were first developed in the United States, while others were already in operation in foreign countries. During the 19th century and earlier, European countries (and their skilled glassworkers) tried to keep glassmaking methods secret—causing some processes to need to be rediscovered in the United States. The leading manufacturers (and exporters) of European glass, based on statistics from near 1880, were England, France, Belgium, Germany, and Austria–Hungry. France was known for its art glass and plate glass—including stained glass windows, while Belgium made the best window glass in the world. The German states were known for mirrors, low cost tableware, vases, and ruby glass. Johann Kunckel developed ruby glass in 1679. The Bohemian portion of Austria–Hungry was known for its art glass, including its engraving and decoration of its glassware.|group=Note}} William Leighton Jr., chemist at J. H. Hobbs, Brockunier and Company, wrote a newspaper article in 1880 that called pressing and the new soda-lime glass formula the two great steps in American glassmaking.|group=Note}} Professor Warren C. Scoville of the Massachusetts Institute of Technology, in an essay titled Growth of the American Glass Industry to 1880, considered the five outstanding glassmaking innovations up to that time to be 1) mechanical pressing; 2) the new soda-lime (a.k.a. lime) glass formula; 3) the shift from wood to coal for fuel; 4) the beginning of plate glass manufacturing; and 5) the gas furnace. Tillotson's list did not include the shift to coal.|group=Note}}\nMechanical Innovations\n]] glassmaking advertisement 1883]]\n* Pressed glass: The most important innovation for the 1820s was the development of machine pressed glass—pressing glass into a mold. Although pressing glass by hand had long existed, mechanical pressing of glass did not exist until the 1820s—and it was an American invention. John P. Bakewell of Bakewell, Page & Bakewell patented a pressing method for making glass furniture knobs in 1825. Henry Whitney and Enoch Robinson of New England Glass Company received a pressing–related patent in 1826; and Phineas C. Dummer, George Dummer, and James Maxwell of the Jersey City Glass Works received pressing and mold–related patents in 1828. The use of a machine to press glass enabled two workers to produce four times as much glassware as a team of three or four glassblowers. Mechanical pressing of glass reduced the time and labor necessary to make glass products, which lowered costs and made glass products available to more of the public. An 1884 U.S. government report considered mechanical pressing and a new formula for glass to be the two great advances in American glassmaking during the 19th century. One author called mechanical pressing \"the greatest contribution of America to glassmaking, and the most important development since the Romans discovered glassblowing....\"\n* Regenerative pot furnace: In 1865 Pittsburgh's O'Hara Glass Works of James B. Lyons and Company installed the first regenerative pot furnace for use with producer gas. These furnaces save on fuel expense by using waste heat to separately heat the air and gas prior to burning. A more intense heat is produced, which reduces the time for melting the batch. First used in Europe, makers of these types of furnaces were Siemens, Nicholson, and Gill. The O'Hara Glass Works in Pittsburgh was the first to use a Siemens regenerative pot furnace, but experienced difficulty utilizing the new technology.\n* Continuous tank: In March 1880 the first successful continuous tank used for the production of glass in the United States began operations.;  |group=Note}} The success was realized by the Anglo–American Glass Company, which was organized in July 1879 in Poughkeepsie, New York. The company was reorganized as a corporation in November 1880 as the Poughkeepsie Glass Works. The plant's major product was bottles. Raw materials for the glass were continuously fed into the furnace, and the melting was continuous. The glass made using this methodology could be only one color.\n* Natural gas for melting glass: Natural gas began being used in the United States to melt glass batch during the early 1880s. The Bradford Window Glass Company of Bradford, Pennsylvania, was the first user—beginning in 1883. The first try using this fuel was not successful, and it was not until 1885 the furnace was configured to use natural gas effectively. In 1884 the Riverside Glass Works of Wellsburg, West Virginia, was the first flint glass manufacturer to achieve success with natural gas. This led to a gas boom in Northwest Ohio and another gas boom in East Central Indiana, where glass manufacturers were attracted by the discovery low–cost natural gas in those regions. Waste and mismanagement caused the natural gas to be depleted in less than 20 years.\n* Prepressed blank: In 1882 Philip Arbogast received a patent for \"Manufacture of Glassware\" that involved using a machine to press the neck of a bottle. This was an important step in automating the production of glass bottles. Arbogast sold his patent and did not build the machine specified in his patent, but others used his idea.\n* Window glass: Two advances were made in window glassmaking during the 1880s. In 1882 Cleon Tondeur received a patent for what he called a \"Glass–Annealing Furnace\". This was the first continuous lehr (also spelled \"leer\") for window glass. Later innovations, including work by Theodore Zeller, led to a linear design for the lehr that is still used today.|group=Note}} The sheets of glass were \"received by the furnace\" (the start of the lehr), and \"discharged by their exit ends\" (the finished end of the lehr) \"out of the tunnel without opening the furnace or tunnel....\" A 1915 report noted that continuous lehrs had replaced intermittent kilns \"to a large extent\", and the \"Tondeur rod lehr is the type which is commonly used today [1915]\". The second innovation for window glassmaking in the 1880s was the use of a continuous tank for window glass. This was introduced in 1884 by the United Glass Works in Streator, Illinois, according to Tillotson. Another source cites the Chambers and McKee Window Glass Company of Jeanette, Pennsylvania, as the first user of a continuous melting tank furnace in the United States. The start year for this factory's innovation was 1889, and the continuous tank helped mechanize window glass production.\n* Flint glass melted in tank: In 1898 Charles H. Runyon of the Keystone Glass Company in Rochester, Pennsylvania, was the first in the United States to melt the batch for flint glass in a tank.|group=Note}} A second source calls the Rochester company operating at that time (1897–1905) by the name of Keystone Tumbler Company.\n* Continuous lehr for plate glass: The Marsh Plate Glass Works of Walton, Pennsylvania, has been listed as the innovator for a continuous lehr for plate glass. George A. Marsh of the Marsh Plate Glass Company applied for multiple glass–related patents during 1898 that were granted in 1899: \"Table for Holding Plate–glass\", \"Apparatus for Grinding, Smoothing, and Polishing Glass\", \"Apparatus for Holding Glass\", and \"Glass–holding Table\". The Marsh Plate Glass Company built a plant to use the new technology, which was purchased by Pittsburg Plate Glass Company before 1901. In addition to the two just–mentioned companies, the Edward Ford Plate Glass Company became involved with continuous lehrs for plate glass in 1900. In 1909 W. L. Clause, president of Pittsburgh Plate Glass Company, testified before Congress that \"...it is a matter of common knowledge that the Marsh Plate Glass Works were a failure and that the works have never operated successfully. The lehr referred to was a prophecy rather than a realization.\" He also added his company's development of a successful lehr took years of time.\n* Fire polishing cut glass blanks: In 1899 Michael J. Owens introduced a machine for fire polishing glass. Owens and Amos R. Wilson applied for a patent on a \"Machine for Fire–Finishing Glass Articles\" on June 24, 1899, and received the patent on September 10, 1901.\n* Automatic bottle machine: In 1895 Edward Libbey formed the Toledo Glass Company, where Michael Owens would work on creating an automatic bottle machine. His first success occurred in 1899 when he developed a machine that could produce a four-ounce (29.57ml) petroleum jelly jar. Producing the long neck of a bottle required more research. His first commercial bottle making machine was produced from 1904 to 1908. Although the machine replaced glassblowers, it created more jobs because it increased demand for bottles. The uniformity in bottle size led to new types of bottles: beer bottles, milk bottles, and baby bottles.\n* Machine drawn window glass: John H. Lubbers created a glass blowing machine. Experiments began in 1896. The machine withdrew the molten glass and blew a cylinder as the first step in the Cylinder method for making window glass—replacing the task of highly skilled and highly-paid glassblowers. An application for a patent on the Lubbers machine was filed during 1900, and a patent for \"Apparatus for Drawing Glass\" was issued in 1902. American Window Glass Company, a trust with many factories, used the machine at various locations while Lubbers continued to improve his invention over the next decade. A decade later, human glassblowers that made approximately $2,000 () for nine months of work were replaced by machine operators that made about $600 () over the same time. Glass produced by machine could total 50 boxes over an eight-hour shift, while human glassblowers could produce only 60 boxes in six days.\nOther Innovations\n* Plate glass: In his list of notable developments in the glass industry, Tillotson lists an unnamed glass works in Williamsburg, New York (a neighborhood in Brooklyn), as the site of the first plate glass factory in America—with a date of 1857. The works was put out of business by competition from Belgium and France. In August 1857 the U.S. Manufacturing and Polishing Plate Glass Company was formed in New York for the purpose of plate glass manufacturing. It had not opened a glass works, although it had been conducting experiments. In 1882 Captain John B. Ford, after several failures, started the first commercially successful plate glass company in the United States. Production began in 1884, and the company name was changed to Pittsburgh Plate Glass Company after an investor bought a significant number of shares of company stock.\n* Lime–flint glass: In 1864 William Leighton Sr., a former employee of New England Glass company now working for J. H. Hobbs, Brockunier and Company, conducted experiments making high quality glass without lead. In December he used  a formula consisting of bicarbonate of soda instead of soda ash. His formula was similar to the long-lost soda-lime formula used many years earlier in Europe. The glass made using this formula had good enough quality that the company could compete in the high-end of the glassware market. The ingredients used to make the glass were lower-cost than those used to make lead glass. In addition, the glass hardened faster, meaning the workforce was forced to shape or press it quicker—lowering costs for labor in addition to lower costs for ingredients. This new formula for glass quickly replaced the recipe consisting of lead at most American factories specializing in glassware.\n* Wire glass: Frank Shuman developed a process for embedding wire in glass, which functioned as reinforcement and made the glass safer. This type of glass, safety glass, was used in overhead lighting and where it was wise to protect people from the possible impacts of shattering glass. Shuman received two patents in 1892, and they were the only United States patents for embedding wire netting in glass at the time.\n* Favrile glass: Louis Comfort Tiffany developed Favrile glass around 1892. It has an iridescent surface created by spraying hot glass with metallic salts that were absorbed into the glass. Tiffany trademarked the name \"Favrile\" in 1894, and it is derived from the word \"fabrile\"—which is the old English word for hand–wrought. Favrile glass is displayed in museums such as the Corning Museum of Glass, the Metropolitan Museum of Art, and the Rhode Island School of Design Museum.\n* Selenium ruby glass: During 1894, Nicholas Kopp discovered a formula for making ruby (deep red) glass using selenium instead of gold. The new formula replaced the older gold–based formula, and it came as the growing automobile industry increased demand for ruby glass. The older formula, which was based on gold as an essential ingredient, had been lost (to Americans) until Thomas Leighton of New England Glass re–discovered it in 1848. Ruby glass, also known as cranberry glass, was originally developed in Prussia during the 1600s.\nNotes\nFootnotes\nCitations\nReferences\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*"
    }
  ]
}