{
  "content": [
    {
      "type": "text",
      "text": "# 19th Division (German Empire)\n\nThe 19th Division (19. Division) was a unit of the Prussian/German Army. It was formed on October 11, 1866, and was headquartered in Hannover. The division was subordinated in peacetime to the X Army Corps (X. Armeekorps). The division was disbanded in 1919, during the demobilization of the German Army after World War I.\nRecruitment\nDuring the Franco-Prussian War, the division was a mixed unit, with Hannoverian, Oldenburg and Westphalian elements. It was subsequently reorganized so that it was recruited primarily from the former Kingdom of Hannover, which had become the Prussian Province of Hanover after 1866, along with Oldenburg, a grand duchy mostly surrounded by the Prussian province. Among the division's units were several that perpetuated the traditions of the King's German Legion, a British Army unit of the Napoleonic Wars.\nCombat chronicle\nDuring the Franco-Prussian War, the 19th Infantry Division fought in the battles of Mars-la-Tour and Gravelotte, and then in the Siege of Metz. It then fought in the Loire Campaign, including the battles of Beaune-la-Rolande, Beaugency-Cravant, and Le Mans.\nIn World War I, the 19th Infantry Division participated in the 1914 Battle of Liège and the subsequent Allied Great Retreat, including the First Battle of the Marne and the First Battle of the Aisne. It was sent to the Eastern Front in 1915 and again in 1916, seeing action in the Gorlice-Tarnów Offensive and the Russian Brusilov Offensive. It returned to the Western Front and, after a period in the trenches, saw action in the German 1918 Spring Offensive and the subsequent Allied counteroffensives, including the Hundred Days Offensive. The division was rated a first class division and regarded as one of the best German divisions by Allied intelligence.\nOrder of battle in the Franco-Prussian War\nDuring wartime, the 19th Division, like other regular German divisions, was redesignated an infantry division. The organization of the 19th Infantry Division in 1870 at the beginning of the Franco-Prussian War was as follows:\n*37. Infanterie-Brigade\n**Infanterie-Regiment Nr. 78\n**Oldenburgisches Infanterie-Regiment Nr. 91\n*38.Infanterie-Brigade\n**Infanterie-Regiment Nr. 16\n**Infanterie-Regiment Nr. 57\n*Dragoner-Regiment Nr. 9\nPre-World War I organization\nGerman divisions underwent various organizational changes after the Franco-Prussian War. As noted above, the 19th Division was reorganized to become primarily a Hannover/Oldenburg unit. The organization of the 19th Division in 1914, shortly before the outbreak of World War I, was as follows:\n*37. Infanterie-Brigade\n**Infanterie-Regiment Herzog Friedrich Wilhelm von Braunschweig (Ostfriesisches) Nr. 78\n**Oldenburgisches Infanterie-Regiment Nr. 91\n*38.Infanterie-Brigade\n**Füsilier-Regiment Generalfeldmarschall Prinz Albrecht von Preußen (Hannoversches) Nr. 73\n**1. Hannoversches Infanterie-Regiment Nr. 74\n*19. Kavallerie-Brigade\n**Oldenburgisches Dragoner-Regiment Nr. 19\n**Königs-Ulanen-Regiment (1. Hannoversches) Nr. 13\n*19. Feldartillerie-Brigade\n**2. Hannoversches Feldartillerie-Regiment Nr. 26\n**Ostfriesisches Feldartillerie-Regiment Nr. 62\nOrder of battle on mobilization\nOn mobilization in August 1914, at the beginning of World War I, most divisional cavalry, including brigade headquarters, was withdrawn to form cavalry divisions or split up among divisions as reconnaissance units. Divisions received engineer companies and other support units from their higher headquarters. The 19th Division was again renamed the 19th Infantry Division and its initial wartime organization was as follows:\n*37. Infanterie-Brigade\n**Infanterie-Regiment Herzog Friedrich Wilhelm von Braunschweig (Ostfriesisches) Nr. 78\n**Oldenburgisches Infanterie-Regiment Nr. 91\n*38.Infanterie-Brigade\n**Füsilier Regiment Generalfeldmarschall Prinz Albrecht von Preußen (Hannoversches) Nr. 73\n**1. Hannoversches Infanterie-Regiment Nr. 74\n*3. Eskadron/Braunschweigisches Husaren-Regiment Nr. 17\n*19. Feldartillerie-Brigade\n**2. Hannoversches Feldartillerie-Regiment Nr. 26\n**Ostfriesisches Feldartillerie-Regiment Nr. 62\n*1.Kompanie/Hannoversches Pionier-Bataillon Nr. 10\nLate World War I organization\nDivisions underwent many changes during the war, with regiments moving from division to division, and some being destroyed and rebuilt. During the war, most divisions became triangular - one infantry brigade with three infantry regiments rather than two infantry brigades of two regiments (a \"square division\"). An artillery commander replaced the artillery brigade headquarters, the cavalry was further reduced, the engineer contingent was increased, and a divisional signals command was created. The 19th Infantry Division's order of battle on March 8, 1918, was as follows:\n*37. Infanterie-Brigade\n**1. Hannoversches Infanterie-Regiment Nr. 74\n**Infanterie-Regiment Herzog Friedrich Wilhelm von Braunschweig (Ostfriesisches) Nr. 78\n**Oldenburgisches Infanterie-Regiment Nr. 91\n**Maschinengewehr-Scharfschützen-Abteilung Nr. 30\n*3.Eskadron/Braunschweigisches Husaren-Regiment Nr. 17\n*Artillerie-Kommandeur 19\n**2. Hannoversches Feldartillerie-Regiment Nr. 26\n**Fußartillerie-Bataillon Nr. 93\n*Pionier-Bataillon Nr. 127\n*Divisions-Nachrichten-Kommandeur 19\nReferences\n* [http://www.1914-18.info/erster-weltkrieg.php?u=149 19. Infanterie-Division (Chronik 1914/1918) - Der erste Weltkrieg]\n* Claus von Bredow, bearb., Historische Rang- und Stammliste des deutschen Heeres (1905)\n* Hermann Cron et al., Ruhmeshalle unserer alten Armee (Berlin, 1935)\n* Hermann Cron, Geschichte des deutschen Heeres im Weltkriege 1914-1918 (Berlin, 1937)\n* Günter Wegner, Stellenbesetzung der deutschen Heere 1815-1939. (Biblio Verlag, Osnabrück, 1993), Bd. 1\n* Histories of Two Hundred and Fifty-One Divisions of the German Army which Participated in the War (1914–1918), compiled from records of Intelligence section of the General Staff, American Expeditionary Forces, at General Headquarters, Chaumont, France 1919 (1920)\nNotes"
    }
  ]
}