{
  "content": [
    {
      "type": "text",
      "text": "# 1 Kings 8\n\n1 Kings 8 is the eighth chapter of the Books of Kings in the Hebrew Bible or the First Book of Kings in the Old Testament of the Christian Bible. The book is a compilation of various annals recording the acts of the kings of Israel and Judah by a Deuteronomic compiler in the seventh century BCE, with a supplement added in the sixth century BCE. This chapter belongs to the section focusing on the reign of Solomon over the unified kingdom of Judah and Israel (1 Kings 1 to 11). The focus of this chapter is the dedication of Solomon's Temple in Jerusalem.\nText\nThis chapter was originally written in the Hebrew language and since the 16th century is divided into 66 verses.\nTextual witnesses\nSome early manuscripts containing the text of this chapter in Hebrew are of the Masoretic Text tradition, which includes the Codex Cairensis (895), Aleppo Codex (10th century), and Codex Leningradensis (1008). Fragments containing parts of this chapter in Hebrew were found among the Dead Sea Scrolls, that is, 4Q54 (4QKings; 50–25 BCE) with extant verses 1–9, 16–18.\nThere is also a translation into Koine Greek known as the Septuagint, made in the last few centuries BCE. Extant ancient manuscripts of the Septuagint version include Codex Vaticanus (B;  \\mathfrak{G}B; 4th century) and Codex Alexandrinus (A;  \\mathfrak{G}A; 5th century).}}\nOld Testament references\n*:\n*:\n*:\n*:\nAnalysis\nThis chapter serves as the climax of the narrative about Solomon in the Books of Kings, which is also an 'event of world-historical importance' because YHWH, the creator of the universe, settles his Temple in Jerusalem. One key moment of the Temple dedication was the transfer of the Ark of the Covenant from Mount Zion to Mount Moriah (Temple Mount), and once the ark was in the temple, YHWH descended and consecrated the Temple as his holy place. Hereafter, the ark was never mentioned again in the Books of Kings and not listed among the Temple furniture seized by Nebuchadnezzar, king of Babylon (2 Kings 25).\nSolomon made seven petitions in the center of the passage, which provide a 'rough preview of the events Israel would face later, with some mentioned curses also listed in Deuteronomy 28:\n* Defeat before an enemy (1 Kings 8:33; Deuteronomy 28:25, 48)\n* Heavens shut without rain (1 Kings 8:35; Leviticus 26:19; Deuteronomy 28:24)\n* Famine, pestilence, blight, mildew, locust, grasshopper, plague, siege (1 Kings 8:37; Deuteronomy 28:21–22, 38, 59)\n* Exile (1 Kings 8:46–51; Deuteronomy 28:58–63)\nIn Kings 8:46–48 there is a running pun on the Hebrew words , ' (\"take captive\"; referring to \"exile\"; used four times), and , ' (\"return\" or \"repent\"; used three times).\nThese two verbs 'alternate chiastically', indicating a connection between captivity and repentance, which could suggest that the solution to \"exile\" is to \"return\" to YHWH, so they can \"return to the land\".\nThe dedication of the Temple (8:1–21)\nThe temple dedication began with a procession of the ark from the tent in the city of David (cf. 2 Samuel 6:16–17; 7:2; 1 Kings 3:15) to the temple grounds. The ark, containing the two tablets of the Ten Commandments (verse 9; Exodus 25:21; ), was originally designed as a 'transportable war palladium' which could be carried into battle in the conviction that 'YHWH was enthroned upon it and would lead his people to victory' (cf. 1 Samuel 4; ). It was placed in the most holy place in the temple, beneath the spread wings of the cherubim, still retaining the signs of mobility with its staves (may symbolize that YHWH is not bound to one place). Next in the ceremony is the blessing of the assembly, opened with a short sermon by Solomon (verses 12–13; 15–21) that since 'the Exodus from Egypt (cf. 1 Kings 6:1), God had intended to reside in Jerusalem' and finally the house of the name of the Lord could be built there.\nVerse 2\n:And all the men of Israel assembled themselves unto king Solomon at the feast in the month Ethanim, which is the seventh month.\n*\"Feast in the...seventh month\": This was the \"Feast of Tabernacles\" or \"Sukkot\", see .\n*\"The month of Ethanim\": or Tishrei/Tishri, which is September or October in Gregorian calendar.\nVerse 9\n:There was nothing in the ark except for the two tablets of stone that Moses put there at Horeb when the Lord made a covenant with the children of Israel after they had come out of the land of Egypt.\n*Cross reference: 2 Chronicles 5:10\n*\"There was nothing in the ark except...\": The statement seems intended to emphasize that the various things placed in there \"before the testimony\"—the pot of manna (Exodus 16:33-34), the rod of Aaron (Numbers 17:10), the copy of the Law (Deuteronomy 31:24-26)—were not in the ark. Hebrews 9:4 wrote according to tradition that during the worship in the Tabernacle, in the ark of the covenant 'was the golden pot that had manna, and Aaron's rod that budded' as well as the tablets of the covenant. The command to placet the tablets in the ark is recorded in Exodus 25:16, and the actual placement of them there in Exodus 40:20, immediately after the Tabernacle was set up.\n*\"Two tablets\": as described in Deuteronomy 10:1–5\n*\"Horeb\": the name used for Mount Sinai in the book of Deuteronomy.\nVerse 21\nThe theme of the Exodus in Samuel-Kings was altered in the Chronicles, where the portrayal of David in relationship with Moses was sharpened, especially by comparing 1 Kings 8:21 and 2 Chronicles 6:11.\n{| class=wikitable\n|+ Comparison in Masoretic Text and KJV\n! 1 Kings 8:21 !! 2 Chronicles 6:11\n|-\n|\n־\n|\n־\n&nbsp;\n|-\n|And I have set there a place for the ark,\nwherein is the covenant of the Lord,\nwhich he made with our fathers,\nwhen he brought them out of the land of Egypt.\n|And in it have I put the ark,\nwherein is the covenant of the Lord,\nthat he made with the children of Israel.\n&nbsp;\n|}\nSolomon's dedicational prayer at the Temple (8:22–61)\nthe Temple at Jerusalem. (painting by James Tissot or follower, c. 1896–1902)]]\nThe dedicational prayer reflects the relationship between God's promise to David (2 Samuel 7) and the people's loyalty to the Torah (verses 23–26), and between the inestimable\nsize of God and his residence in Zion (verses. 27–30). God cannot literally 'dwell on earth' (verse 27), but he can listen in heaven (verses 32, 34, 36, 39, 43, 45, 49) when 'people pray toward the Temple'. In the main prayer Solomon asked God to hear all future prayers made to heaven in this temple, especially in the time of difficult trials (verses 31–32), wartime hardship (verses 33–34), drought (verses 35–36), and other calamities (verses 37–40), also the prayers of the proselytes who would come to Jerusalem (verses 41–43) and of the Israelites who would dwell in other countries (verses 44–45, 46–51) as this would 'give every member of YHWH's chosen people a common\nidentity' (verses 52–53). Finally, Solomon plead for God 'to instil in their hearts a willingness to abide by the commandments, expresses their awe of God's judgement and acceptance of their own insufficiencies'. Israel's existence is solely due to God's mercy and serves the purpose of 'manifesting God to all the peoples of the world' (cf. Isaiah 43:10-12; 45:4-6).\nThe Feast of the Temple Dedication (8:62–66)\nThe festivities of the dedication lasts seven days involving more sacrifices than what Solomon made in Gibeon (1 Kings 3:4) and far too many for the usual altar to deal with (verse 64), to show that Solomon was always 'generous in making every effort to satisfy God and God's people'.\nSee also\n*Related Bible parts: Leviticus 23, Leviticus 26, Deuteronomy 28, 2 Samuel 7, 1 Kings 5, 1 Kings 6, 2 Chronicles 2, 2 Chronicles 3, 2 Chronicles 4, Isaiah 43, Isaiah 45\nNotes\nReferences\nSources\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\nExternal links\n* Jewish translations:\n** [https://www.chabad.org/library/bible_cdo/aid/15892 Melachim I - I Kings - Chapter 8 (Judaica Press)]. Hebrew text and English translation [with Rashi's commentary] at Chabad.org\n* Christian translations:\n** [http://www.gospelhall.org/bible/bible.php?passage=1+Kings+8 Online Bible at GospelHall.org] (ESV, KJV, Darby, American Standard Version, Bible in Basic English)\n** [http://www.biblegateway.com/passage/?book_id=11&chapter=8&version=9 1 Kings chapter 8. Bible Gateway]"
    }
  ]
}