{
  "content": [
    {
      "type": "text",
      "text": "# 1st Airlanding Brigade (United Kingdom)\n\n|allegiance=\n|branch=\n|type=Airborne forces\n|role=Glider infantry\n|size=4 battalions (maximum)\n|command_structure=1st Airborne Division\n|garrison=\n|current_commander=\n|ceremonial_chief=\n|colonel_of_the_regiment=\n|notable_commanders=Pip Hicks\n|identification_symbol=\n|identification_symbol_label=Emblem of the British airborne forces\n|nickname=\n|patron=\n|motto=\n|colors=\n|march=\n|mascot=\n|battles=Sicily landingsBattle of ArnhemOperation Doomsday\n|anniversaries=\n|decorations=\n|battle_honours=\n}}\nThe 1st Airlanding Brigade was an airborne infantry brigade of the British Army during the Second World War and the only glider infantry formation assigned to the 1st Airborne Division, serving alongside the 1st Parachute Brigade and 4th Parachute Brigade.\nThe brigade was formed in late 1941 during the Second World War, through the conversion of an existing infantry brigade previously stationed in India, the 31st Independent Infantry Brigade. Two of the initial four infantry battalions left in May 1943 to form the new 6th Airlanding Brigade of the 6th Airborne Division and were replaced by a single new battalion, thereby reducing the brigade's strength by one quarter.\nThe brigade only saw action on two occasions during the Second World War, in Operation Ladbroke, as part of the Allied invasion of Sicily, in July 1943 and later in Operation Market Garden in September 1944. During the second operation, in the fighting around Arnhem, 1st Airlanding Brigade along with the rest of 1st Airborne Division held out against overwhelming German odds, sustaining very heavy losses. Only around 20 percent of the brigade were evacuated south of the River Rhine. The rest had either been killed, were missing or became prisoners of war.\nFollowing the German surrender in mid-1945, 1st Airlanding Brigade were sent to Norway to disarm the German garrison. Later the same year the brigade was disbanded.\nFormation\nUnder the command of Brigadier George Hopkinson, the 1st Airlanding Brigade Group was formed on 10 October 1941 through the re-designation of the 31st Independent Infantry Brigade, which had just returned to the United Kingdom after training for mountain warfare in British India. Upon formation, the brigade consisted of the 1st Battalion, Border Regiment (Borders), the 2nd Battalion, South Staffordshire Regiment (Staffords), the 2nd Battalion, Oxfordshire and Buckinghamshire Light Infantry (OBLI), the 1st Battalion, Royal Ulster Rifles (Ulsters) and supporting units. These were the brigade's original infantry battalions and all remained part of its order of battle. Men in the battalions who were unsuitable for airborne service were weeded out and replaced by volunteers.\ninside an Airspeed Horsa glider]]\nThe strength of the airlanding brigade almost equalled that of an airborne division's two parachute brigades. To support the four infantry battalions, the brigade also had its own artillery, engineer and reconnaissance units until 1942, when they became divisional assets. Another change that affected the brigade occurred in May 1943, when the Ulsters and the OBLI left to form the 6th Airlanding Brigade, of the 6th Airborne Division. When the brigade returned to the United Kingdom, it was assigned the 7th Battalion, King's Own Scottish Borderers (KOSB) in December 1943, a 2nd Line Territorial Army unit, which had until then been on home defence duties, stationed in the Orkney and Shetland islands.\nThe brigade's glider infantry battalions consisted of 806 men in four rifle companies, each with four platoons along with a support company consisting of two Anti-tank platoons each with four 6&nbsp;pounder guns, two mortar platoons armed with six 3&nbsp;inch mortars, and two Vickers machine gun platoons.\nTransport for the brigade was normally the Airspeed Horsa glider, piloted by two men from the Glider Pilot Regiment. With a wingspan of  and a length of , the Horsa had a maximum load capacity of —space for two pilots, a maximum of twenty-eight troops or two jeeps, one jeep and an artillery gun or one jeep with a trailer.\nSixty–two Horsa and one General Aircraft Hamilcar gliders were required to carry the airlanding battalion into action. The Hamilcar carried the battalion's two Universal Carriers used to support the mortar and machine-gun platoons.\nOperations\nSicily\nThe 1st Airborne Division, including the 1st Airlanding Brigade, left England for North Africa in June 1943. The brigade now comprised only two battalions, the 1st Border Regiment and the 2nd South Staffordshire Regiment, with Brigadier Philip \"Pip\" Hicks, in command, Brigadier Hopkinson having been promoted to major-general and given command of the 1st Airborne Division from Major-General Browning. The 1st Ulster Rifles and the 2nd Ox and Bucks remained in England to help create the 6th Airlanding Brigade. Once they arrived in the theatre the brigade was based in the Oran area on the north-western Mediterranean coast of Algeria. Now part of the British Eighth Army, training for the Allied invasion of Sicily, code-named Operation Husky, started in earnest.\nMajor-General Hopkinson had persuaded General Bernard Montgomery, commander of the Eighth Army, to include the 1st Airborne Division in the invasion of Sicily, against the wishes of both the commander of the British Airborne Forces, Major-General Browning and the commander of the Glider Pilot Regiment, Lieutenant Colonel Chatterton. Both men were concerned that they had insufficient aircraft for the complete division to take part while British pilots and infantry were not familiar with the Waco CG-4 gliders that were to be used. Their concerns proved correct as there were only enough aircraft for two of the division's four brigades to take part in the invasion. The 1st Parachute Brigade was assigned to Operation Fustian with orders to seize and hold the Primosole Bridge over the River Simeto. Prior to that, the 1st Airlanding Brigade was to take part in Operation Ladbroke, a glider assault on the Ponte Grande bridge across the Anapo river south of Syracuse. The brigade was to hold the bridge until relieved by the advance of the British 5th Infantry Division. The 1st Airlanding Brigade was allocated 136 Waco and eight Airspeed Horsa gliders for the operation. Six of the Horsas carrying two infantry companies were scheduled to land at the bridge at 23:15 on 9 July in a coup-de-main operation. The remainder of the brigade would arrive at 01:15 on 10 July using a number of landing-zones between  away, then converge on the bridge to reinforce the defence.\ns being loaded aboard a Waco glider]]\nOn 9 July, 2,075 men of the brigade along with seven Willys MBs, six artillery guns and ten mortars, boarded their gliders in Tunisia and took off at 18:00 bound for Sicily. En route they encountered strong winds, poor visibility and at times were subjected to anti-aircraft fire. To avoid gunfire and searchlights, pilots of the towing aircraft climbed higher or took evasive action. In the confusion surrounding these manoeuvres, some gliders were released too early and 65 of them crashed into the sea, drowning around 252 men. Of the remaining gliders only 12 landed at the correct landing-zones. Another 59 landed up to  away while the remainder were either shot down or failed to release and returned to Tunisia. Only one Horsa with a platoon of infantry from the Staffords landed near the bridge. Its commander, Lieutenant Louis Withers, divided his men into two groups then swam across the river with half of them to take up positions on the opposite bank. Thereafter the bridge was captured following a simultaneous assault from both sides. The platoon then dismantled demolition charges that had been fitted to the bridge and dug in to wait for reinforcement or relief. Another Horsa landed about  from the bridge but exploded on landing, killing all on board. Three of the other Horsas carrying the coup-de-main party, landed within  of the bridge—their occupants eventually finding their way to the site. Reinforcements began to arrive at the bridge but by 06:30 they numbered only 87 men.\nElsewhere, about 150 men landed at Cape Murro di Porco and captured a radio station. Based on a warning of imminent glider landings transmitted by the station's previous occupants, the local Italian commander ordered a counter-attack but his troops failed to get the message. The scattered nature of the landings now worked in the brigade's favour as they were able to cut all telephone wires in the immediate area. Forces at the bridge came under repeated attacks from the Italians while the expected 5th Infantry Division relief did not appear at 10:00 as planned. By 15:30 only 15 of men at the bridge remained fit to fight and they were out of ammunition, as a result the Italians then recaptured the bridge. The first unit from the 5th Division, the 2nd Northamptonshire Regiment of the 17th Brigade, arrived at the bridge at 16:15 and mounted a successful counterattack. The prior removal of demolition charges from the bridge had prevented the Italians from destroying it. The brigade then took no further part in the fighting and was withdrawn back to North Africa on 13 July. During the landings in Sicily, the losses by the 1st Airlanding Brigade were the worst of all the British units involved so far. They amounted to 313 killed and 174 missing or wounded. The accompanying glider pilots lost 14 killed, and a further 87 were missing or wounded.\nArnhem\ninspects men of the 7th Battalion, King's Own Scottish Borderers, 1st Airborne Division, in the North Midlands, 1944.]]\nAfter service in the Mediterranean the brigade returned to Woodhall Spa in Lincolnshire, where it was reinforced by the arrival of the 7th Battalion, King's Own Scottish Borderers in November 1943. During the Normandy landings, the 1st Airlanding Brigade was part of the strategic reserve, on standby to deploy wherever they were needed to support the invasion. The division and brigade were next assigned to Operation Market Garden at Arnhem in the Netherlands. This entailed three airborne divisions capturing bridges to be used subsequently by the British Second Army. Prior to the operation, more than 15 planned airborne missions into France and Belgium had been cancelled due to the speed of the Allied advance.\nA shortage of transport aircraft meant that it would take three days to transport the division to Arnhem. The plan called for the majority of the 1st Airlanding Brigade and the 1st Parachute Brigade to land on day one. The parachute brigade would head for Arnhem and capture the bridges over the Lower Rhine while the airlanding brigade secured drop zones for units arriving on the second and third days. When all the division's units had arrived the brigade would take up defensive positions to the west of Arnhem. The 1st Airlanding Brigade units arriving on the second lift were to be two companies plus one mortar, one machine gun and one anti-tank platoon of the Staffords, along with three platoons and sections from the mortar, machine gun and anti-tank platoons of the KOSB. The Borders contingent amounted to a further eight platoons.\nOn 17 September 1944, the first lift successfully carried the majority of the brigade to Arnhem—only 12 gliders failed to arrive due to technical problems. While the 1st Parachute Brigade headed for Arnhem the airlanding brigade dug in to secure the landing grounds. The Staffords dug in around landing zone 'S', the KOSB around drop zone 'Y' and the Borders around landing zone 'X'. Also under command of the brigade, co-located with brigade headquarters at Wolfheze were the Glider pilots of No. 2 Wing, Glider Pilot Regiment, the equivalent of a small infantry battalion.\nadvance toward Arnhem, towing a 6 pounder Anti–Tank gun, 18 September]]\nOn the night of 17–18 September, divisional commander Major-General Roy Urquhart was reported missing. Brigadier Philip Hugh Whitby Hicks assumed command of the division while Colonel Hilaro Barlow replaced Hicks as brigade commander.\nOn day two, problems in Arnhem forced Hicks to change the divisional plan. Only the 2nd Parachute Battalion had reached the road bridge—strong German defences had halted the other battalions so Hicks decided that the Staffords would link up with the 1st Parachute Brigade in an attempt to reach their objective. However, the Staffords also failed to break through the German defenders. Bad weather over England kept the planned second lift on the ground. The first troops did not arrive until 15:00, a delay that gave the Germans time to approach the landing grounds and engage the KOSB in numerous probing attacks on the northern perimeter. At one stage KOSB commanding officer Lieutenant Colonel Payton-Reid led a bayonet charge to clear the Germans from the area. Meanwhile, the Borders were repeatedly attacked from the south of landing zone's 'X' and 'Z', and were eventually forced to call on the 75&nbsp;mm guns of the 1st Airlanding Light Regiment to break up the attacks. Hicks had previously decided to send the Staffords on the second lift to join their battalion fighting in Arnhem, while he also sent the 11th Parachute Battalion on the same lift to support 1st Parachute Brigade. The KOSB, until then responsible for defending the landing ground, were attached to 4th Parachute Brigade to replace the 11th Parachute Battalion. However they were still responsible for defending landing ground 'L', for the arrival of the Poles gliders on day three. This left only the Borders, No. 2 Wing GPR and the field ambulance under brigade command.\nAs day three dawned, the Staffords, and the 1st Parachute Battalion attacked at 04:00, their first objective being to link up with the 3rd Parachute Battalion trapped around St Elizabeth's Hospital. The attack failed but allowed Urquhart to rejoin the division from a position where he had been trapped by the Germans. This allowed Hicks to resume command of the brigade, whereupon Urquhart dispatched Colonel Barlow to take over command of 1st Parachute Brigade and co-ordinate the attack in Arnhem. He left in a jeep and was killed in a mortar barrage just outside Arnhem. The 1st Airlanding Brigade, still holding landing zone 'L' for the expected Polish and resupply gliders, then came under attack from the west and north-west. During the night the KOSB had tried to take the high ground at Koepel, but were stopped by heavy machine gun fire and instead dug in. The remainder of 4th Parachute Brigade advancing north of the railway line also encountered a strong German defence line and were unable to progress any further. All three battalions were ordered to withdraw south of the railway line towards Wolfheze. Although the northernmost battalion of the KOSB had thus far enjoyed a quiet morning, in the two hours it took them to advance south of the railway, two companies were now cut off and the entire battalion transport lost. Still under fire from the pursuing Germans, the battalions crossed landing zone 'L' just as the third lift gliders were landing. While attempting to unload the gliders the Poles came under fire. Assuming the approaching men were Germans, they opened fire and caused some casualties.\nat Arnhem, 1944]]\nWith no one in command, around 100 men, the remnants of the Staffords, along with about 400 troops from the 1st Parachute Brigade, pulled back towards Oosterbeek. Here they were gathered together in an ad hoc formation known as the \"Lonsdale Force\" after Major Richard Lonsdale who was put in command. The Lonsdale Force deployed to the south-east of Oosterbeek to defend the division's artillery line. Here, as dusk approached, Lance Serjeant John Baskeyfield of the Staffords, although wounded and with the rest of his men dead or wounded, engaged three tanks as they emerged from the woods with his anti-tank gun. He destroyed the first tank and disabled the second before his own weapon was destroyed. Moving to a nearby gun where the crew were already dead, he continued to fight the third tank alone. Shortly after he managed to disable it, he was killed a shell from a German tank. For his actions Baskeyfield received a posthumous Victoria Cross, the highest British military decoration. The KOSB had by now arrived at the perimeter being formed around Oosterbeek and took up positions south of the railway line just north of division headquarters.\n]]\nBy day four, the battalions of the 1st Airlanding Brigade were dispersed over a wide area. While the Borders were to the west on a line from the River Rhine east of Heveadorp to the Heelsum road, the remaining KOSB companies lay to the north with the remnants of the Staffords forming part of Lonsdale Force in the east. Brigade headquarters was established on open ground at the centre of the divisional area. On day five (21 September), defence of the divisional area was divided between the two remaining brigade headquarters. The 1st Airlanding Brigade in the west now commanded the remaining three companies of Borders, the remnants of the KOSB, and what remained of the Royal Engineers, 21st Independent Company, Glider Pilots and Poles. Lonsdale Force Major Robert Henry Cain of the Staffords disabled a tank with a PIAT and then, although wounded by machine gun fire, positioned one of the division's artillery guns and destroyed it. This was the first of a number of actions by Major Cain which led to the award of a Victoria Cross. This second medal for the Staffords meant it became the only British battalion to receive two Victoria Crosses in one battle during the Second World War.\nThe Germans did not mount an all-out infantry assault on the divisional area, which was under continuous mortar and artillery attack. Instead, each sector was subjected to small scale assaults at times supported by tanks or self-propelled guns. Enemy troops first attacked the Independent Company, then the Borders who were forced off the high ground overlooking the river, and finally the KOSB. The Germans mounted a strong assault following the landing of the 1st Polish Parachute Brigade south of the river beside Driel. This attack forced the KOSB out of their positions, which were only regained after a bayonet charge. Fighting was so fierce that first reports suggested the KOSB had been annihilated, although it turned out that the counter-attack had in fact reduced the battalion's strength to only 150 men.\nBy day six, 22 September, the battle had settled into a routine of mortaring and small probing attacks at times supported by armoured vehicles and sniper fire. The Poles, dug in south of the river, relieved part of the pressure on the division, as some German forces were diverted to confront them. The following day began in a similar way to previous days with a mortar and artillery bombardment, followed by infantry and armour trying to find a gap in the perimeter. The KOSB, Glider Pilots and the 21st Independent Company who were all defending the brigade area were repeatedly attacked. Furthermore, food and water shortages also took their toll on the men, with foraging parties subjected to sniper fire. On day eight, 24 September, although German attacks continued, the enemy were engaged by artillery of the XXX Corps south of the river and aircraft from the Royal Air Force. This broke up most assaults before they got started.\nOn 25 September Lieutenant-General Brian Horrocks, commander of XXX Corps, decided not to reinforce the position north of the Rhine and instead prepare for the evacuation of all survivors in Operation Berlin. The evacuation took place on the night of 25–26 September. Of the 2,526 men of 1st Airlanding Brigade that left England for Operation Market Garden, there were 230 killed, 476 evacuated and 1,822 were missing or prisoners of war.\nNorway\n, Oslo]]\nAfter Arnhem, replacements for the 1st Airlanding Brigade began to bring the brigade up to strength. Among the replacements was Brigadier Roger Bower who took the place of the injured Brigadier Hicks. However, the Germans surrendered before they were involved in further action. The 1st Airborne Division including the airlanding brigade, the Special Air Service Brigade and an ad hoc brigade formed from the divisional artillery were sent to disarm the German occupation forces in Norway in May 1945. On entering Norway, the division would be responsible for maintaining law and order in the areas it occupied, ensuring that German units followed the terms of their surrender, securing and then protecting captured airfields, and finally preventing the sabotage of essential military and civilian structures. After landing nearby, 1st Airlanding Brigade occupied the Norwegian capital Oslo, where Brigadier Bower became Commander, Oslo Area for the duration of the division's time in Norway. The city was chosen because as well as being the Norwegian capital it was also the centre of the Norwegian and German administration. The brigade returned to the United Kingdom in August 1945, when the 1st Airborne Division was disbanded and the airlanding battalions returned to a conventional infantry role.\nBrigade composition\nCommanding Officers\n* Brigadier George Hopkinson\n* Brigadier Pip Hicks\n* Brigadier Roger Bower\nOn formation 1941\n* 1st Battalion, Border Regiment\n* 2nd Battalion, South Staffordshire Regiment\n* 2nd Battalion, Oxfordshire and Buckinghamshire Light Infantry\n* 1st Battalion, Royal Ulster Rifles\n* 1st Airlanding Reconnaissance Squadron, Royal Armoured Corps\n* 9th Field Company (Airborne), Royal Engineers\n* 223rd Anti-Tank Battery, Royal Artillery\n* 458th Light Battery, Royal Artillery\nFrom December 1943\n* 1st Battalion, Border Regiment\n* 2nd Battalion, South Staffordshire Regiment\n* 7th (Galloway) Battalion, King's Own Scottish Borderers\n* 181st Airlanding Field Ambulance, Royal Army Medical Corps\nReferences\nNotes\nCitations\nBibliography\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*"
    }
  ]
}