{
  "content": [
    {
      "type": "text",
      "text": "# 1st Aviation Brigade Combat Team (United Kingdom)\n\n| country                       =\n| branch                        =\n| type                          = Army aviation\n| role                          = AttackReconnaissance\n| size                          =\n| command_structure             = Joint Aviation Command\n| current_commander             =\n| garrison                      = Middle Wallop Flying Station\n| ceremonial_chief              =\n| ceremonial_chief_label        =\n| colonel_of_the_regiment       =\n| nickname                      =\n| patron                        =\n| motto                         = Fly, Fight, Lead\n| colors                        =\n| march                         =\n| mascot                        =\n| battles                       =\n| notable_commanders            =\n| anniversaries                 =\n| decorations                   =\n| battle_honours                =\n| identification_symbol         =\n| identification_symbol_label   =\n| identification_symbol_2       =\n| identification_symbol_2_label =\n| aircraft_helicopter           =\n| aircraft_helicopter_attack    = Boeing AH-64E Apache\n| aircraft_helicopter_cargo     =\n| aircraft_helicopter_multirole =\n| aircraft_helicopter_observation = Wildcat AH1\n| aircraft_helicopter_trainer   =\n| aircraft_helicopter_utility   =\n}}\nThe 1st Aviation Brigade Combat Team is an aviation formation of the British Army. Most of its units are from the Army Air Corps (AAC). It was stood up on 1 April 2020 by combining the Wattisham Flying Station Headquarters (WFS HQ), formerly the Attack Helicopter Force (AHF) at Wattisham and the Aviation Reconnaissance Force at the Royal Naval Air Station Yeovilton. It reached initial operating capability on 1 April 2021 and full operating capability on 1 January 2023.\nStructure\nThe units of the brigade are as follows:\n* Headquarters, 1st Aviation Brigade Combat Team, at Middle Wallop Flying Station\n** 1 Regiment Army Air Corps, at RNAS Yeovilton (HMS Heron) (Aviation Reconnaissance, equipped with AgustaWestland Wildcat AH1)\n** 3 Regiment Army Air Corps, at Wattisham Flying Station (Aviation Attack, equipped with Boeing AH-64E Apache)\n** 4 Regiment Army Air Corps, at Wattisham Flying Station (Aviation Attack, equipped with Boeing AH-64E Apache)\n** 5 Regiment Army Air Corps, at Middle Wallop Flying Station\n** 6 Regiment Army Air Corps (Army Reserve), at Middle Wallop Flying Station (Ground Crew Reserve)\n** 47th Regiment Royal Artillery, at Larkhill operating Thales Watchkeeper WK450 Unmanned Air Systems, since April 2021.\n** No. 653 Squadron, Army Air Corps, at Wattisham Flying Station (Conversion Training Unit)\n** 7 Aviation Support Battalion REME, Royal Electrical and Mechanical Engineers, at Wattisham Flying Station\n*** 132 Aviation Support Squadron, Royal Logistic Corps\nSee also\n* List of Army Air Corps aircraft units (United Kingdom)\nFootnotes\nReferences\n*\n*"
    }
  ]
}