{
  "content": [
    {
      "type": "text",
      "text": "# 1st Army Tank Brigade (United Kingdom)\n\n| branch                        =\n| type                          = Armoured formation\n| role                          = Armoured warfare\n| size                          = Brigade\n| command_structure             = BEF\n| battles                       = * Battle of France\n* Operation Crusader\n}}\nThe 1st Army Tank Brigade was a formation of the British Army during the Second World War. A Tank Brigade was intended to support the Infantry and was mostly equipped with slow moving Infantry tanks, unlike an Armoured Brigade, which was equipped with faster cruiser tanks and later its own motorised infantry. Initially using infantry nomenclature for its smaller units, company  and section and having 175 light and infantry tanks, it later adopted cavalry nomenclature of squadron and troop and later in the War grew to 240 tanks. Its designation was changed on 14 April 1940 to 1st Tank Brigade.\nHistory\nThe 1st Army Tank Brigade took part in the Battle of France, serving as part of the British Expeditionary Force. It fought against the Germans in Belgium and Northern France, providing the armour for the counter-attack at the Battle of Arras and covered the Allied retreat to Dunkirk. It lost all of its equipment on the beaches following the evacuation.\nThe reformed 1st Army Tank Brigade was transferred to North Africa, equipped with Valentine infantry tanks. The brigade took part in Operation Crusader, as part of the XIII Corps. Attached to the 2nd South African Division, it took part in the conquest of Bardia (December 1941 – January 1942).\nThe 1st Tank Brigade was disbanded 21 November 1944.\nOrder of battle\nFrom\n* 4th Royal Tank Regiment (September 1939 – December 1940)\n* 7th Royal Tank Regiment (September 1939 – December 1940)\n* 8th Royal Tank Regiment (September 1939 – September 1942) did not go to France\n* 44th Royal Tank Regiment (December 1940 – May 1943)\n* 49th Royal Tank Regiment (December 1940 – October 1944)\n* 42nd Royal Tank Regiment (April 1941 – November 1944)\n* 11th Royal Tank Regiment (October 1942 – October 1944)\nBattle honours\n* Tobruk 1941\n* Gazala\n* Defence of Alamein Line\n* El Alamein\nSee also\n* British Armoured formations of World War II\n* British Army Order of Battle (September 1939)\n* List of British brigades of the Second World War\nReferences\nBibliography\n*\nExternal links\n* [http://www.ordersofbattle.com/UnitData.aspx?UniX=1396&Tab=Sub&Titl=1 Army Tank Brigade]"
    }
  ]
}