{
  "content": [
    {
      "type": "text",
      "text": "# 1st Warsaw Armoured Brigade\n\n| image                         = Naszywka 1 Warszawskiej BPanc.JPG\n| dates                         = 1994–present\n| country                       = Poland\n| branch                        = Polish Land Forces\n| type                          = Armoured\n| size                          = Brigade\n| command_structure             = 18th \"Żelazna\" Mechanised Division\n| garrison                      = Wesoła (Warsaw)\n| patron                        = Tadeusz Kościuszko\n| battles                       =\n| anniversaries                 = 23 September\n| battle_honours                =\n| website                       =\n| commander1                    = Brigadier General Artur Kozłowski\n| identification_symbol         =\n| identification_symbol_label   =\n}}\nThe 1st Warsaw Armoured Brigade () is a brigade of the Polish Armed Forces, based in Warsaw.\nHistory\nPolish 1st Armoured Brigade \"defenders of Westerplatte\" () or Polish 1st Warsaw Armoured Brigade (Polish: 1 Warszawska Brygada Pancerna) was a military unit in the Ludowe Wojsko Polskie. It was formed on August 19, 1943, from a regiment (pułk) of the same name.\nThe unit fought at the Battle of Lenino (September 1943) and at the Battle of Studzianki during the Lublin-Brest Offensive (Magnuszew bridgeheads in August 1944). From mid-August it was subordinate to the Polish First Army. Later the unit fought in the East Pomeranian Offensive.\nIn January 1945 it received another honorary name, Warszawska (of Warsaw). In July and August 1945 fought against Polish anti-Communist guerrilla. In January 1946 it was downsized to regiment (becoming 1st Warsaw Tank Regiment), and from June it was stationed in the Modlin area.\nThe modern version of the 1st Warsaw Armoured Brigade was formed in 1994 and was subordinated to the 16th Pomeranian Mechanised Division. On August 29, 2019, the brigade was transferred under the command of the newly formed 18th \"Żelazna\" Mechanised Division, which is intended to help safeguard Poland's eastern border.\nIn April 2021, 1WAB troops were deployed to the Belarus-Poland border.\nIn August 2023, 10,000 troops were sent to help the Polish Border Guard police the border with Belarus so as \"to deter the aggressor, so that he does not dare to attack us.\" Defense Minister Mariusz Błaszczak he was not ruling out closing the border, and \"Everything that happens in Belarus is coordinated with Russia’s actions.\" 1WAB troops were deployed there as a result of this announcement.\nOn 6 June 2024 a 1WAB soldier by the name of Mateusz Sitek was murdered by an illegal immigrant on the Belarus-Poland border. He had been serving in the 1WAB from 18 December 2023; initially, he had served in the ranks of the Territorial Defense Force.\nStructure\n* The '1st Warsaw Armoured Brigade \"Tadeusz Kościuszko\"' is headquartered in Wesoła and structured as follows:\n** Command Battalion in Wesoła\n** Tank Battalion in Wesoła with M1A1 FEP Abrams\n** 1st Mechanised Battalion in Chełm with BWP-1 infantry fighting vehicles\n** 3rd Mechanised Battalion in Zamość with BWP-1 infantry fighting vehicles\n** Self-propelled Artillery Group in Chełm with 2S1 Gvozdika 122mm self-propelled howitzers\n** Anti-aircraft Group in Siedlce with ZUR-23-2&nbsp;kg \"Jodek-G\" anti-aircraft systems and Grom surface-to-air missiles\n** Reconnaissance Company in Siedlce with BRDM-2 vehicles\n** Engineer Company in Siedlce\n** Logistic Battalion in Wesoła\nPopular culture\nThe Polish TV series Czterej pancerni i pies (Four tank men and a dog)  featured the adventures of a tank crew from this brigade.\nReferences\nExternal links"
    }
  ]
}