{
  "content": [
    {
      "type": "text",
      "text": "# 2000 Australia Beechcraft King Air crash\n\nsouth-east of Burketown, Queensland, Australia\n| coords =\n| aircraft_type = Beechcraft 200 Super King Air\n| callsign = SIERRA KILO CHARLIE\n| tail_number = VH-SKC\n| origin = Perth Airport, Perth, Western Australia\n| destination = Leonora Airport, Leonora, Western Australia\n| passengers = 7\n| crew = 1\n| fatalities = 8\n| survivors = 0\n| injuries =\n| missing =\n| aircraft_name =\n| operator =\n| stopover =\n| stopover0 =\n| last_stopover =\n}}\nOn 4 September 2000, a chartered Beechcraft 200 Super King Air departed Perth for a flight to the mining town of Leonora, Western Australia. The aircraft crashed near Burketown, Queensland, Australia, resulting in the deaths of all eight occupants. During the flight, the aircraft climbed above its assigned altitude. When air traffic control (ATC) contacted the pilot, the pilot's speech had become significantly impaired, and he was unable to respond to instructions. Three aircraft intercepted the Beechcraft, but were unable to make radio contact. The aircraft continued flying on a straight north-easterly heading for five hours, before exhausting its fuel and crashing  south-east of Burketown. The crash became known in the media as the \"ghost flight\".\nA subsequent investigation by the Australian Transport Safety Bureau (ATSB) concluded that the pilot and passengers had become incapacitated and had been suffering from hypoxia, a lack of oxygen to the body, meaning the pilot would have been unable to operate the aircraft. Towards the end of the flight, the left engine stopped due to fuel exhaustion, and the aircraft crashed into the ground. The investigation report said that, due to extensive damage to the aircraft, investigators were unable to conclude if any of the eight aboard had used the oxygen system. The final report stated that the ATSB could not determine what incapacitated the occupants. A number of safety recommendations were made following the crash.\nBackground\nThe aircraft involved in the crash was a Beechcraft 200 Super King Air, registration VH-SKC, serial number BB-47, manufactured in 1975. The aircraft had about 19,000 hours of service before the crash. The amount of air passed into the cabin is controlled by bleed air valves on the engines. The positions of the bleed air valves can be altered by the pilot. According to the investigation report, \"The aircraft was not fitted with a high cabin altitude aural warning device, nor was it required to be.\" The aircraft was fitted with an emergency oxygen system—an oxygen tank which could supply oxygen to the crew through two masks located in the cockpit, and to passengers through masks which drop from the ceiling of the cabin.\nInvestigators concluded the aircraft was airworthy at the time the crash occurred, and a pilot who flew the aircraft earlier in the day said the aircraft functioned normally. The investigation report stated that \"the maintenance release was current, and an examination of the aircraft's maintenance records found no recurring maintenance problems that may have been factors in the accident.\"\nCrash\n, in Leonora, Western Australia.|alt=A black and white photograph of a busy mine with several smoking chimneys and industrial buildings]]\nOn Monday 4 September 2000, the Beechcraft, chartered by mining company Sons of Gwalia, departed Perth, Western Australia, for the town of Leonora, Western Australia. On board were seven mine workers travelling to Gwalia Gold Mine. The aircraft took off from Perth at 6:09&nbsp;pm local time (1009 Coordinated Universal Time (UTC)), and was cleared by ATC to climb to FL130 (). Five minutes later, at 1015, it was further cleared to its cruising altitude of FL250 (); with an instruction to be at FL160 () by  from Perth. The pilot acknowledged this transmission.\nFive minutes later, at 1020, as the aircraft climbed through FL156 (), it was cleared to waypoint DEBRA. The pilot again acknowledged. At approximately 1033, the aircraft passed through its cleared level, and at FL256 (), ATC asked the pilot to confirm his altitude. \"Sierra Kilo Charlie—um—standby,\" the pilot replied. This was the final spoken transmission from the aircraft, and its climb continued. According to the investigation report, several open-microphone transmissions followed, with the sound of background noise from the engines, a person breathing, \"one unintelligible syllable,\" and \"two chime-like tones, similar to those generated by electronic devices.\" During this time, ATC attempted to regain contact with the pilot. At 1040, the controller called out, \"Sierra Kilo Charlie Sierra Kilo Charlie, Melbourne Centre, if receiving this transmission squawk ident.\" At 1041, the controller asked again, \"Sierra Kilo Charlie, only receiving open mike from you. Would you contact me on one two five decimal two.\"\n, northwest of Alice Springs|alt=An expansive plain with a large mountainous ridge running through it along a curved line]]\nThe aircraft continued to climb, and left radar coverage at 1102, passing FL325 (). Thirty-one minutes later, Australian Search and Rescue asked the crew of a business jet to approach the Beechcraft. They reported that it was in level flight at FL343 (), and they could see no movement on the flight deck or in the cabin. However, the conditions made it difficult to observe closely.\nTwo other aircraft which were asked to monitor the Beechcraft intercepted it over the Northern Territory, north-west of Alice Springs. The pilots reported that it was now in a steady descent, and both aircraft followed it as its airspeed increased. The investigation report stated that the pilots observed that \"although its external lights were on, nothing could be seen inside the cabin.\" The investigation report then describes how \"the crews of the chase aircraft attempted to contact the pilot of the Beechcraft by radio, but they did not receive a response.\" At 1510, the aircraft turned left through 90 degrees as it descended through . About  south-east of Burketown, Queensland, it hit the ground and disintegrated. The pilot and seven passengers were killed.\nInvestigation\nThe crash was investigated by the Australian Transport Safety Bureau (ATSB), a federal body responsible for investigating transportation accidents in Australia. The final report was published in March 2001. The report was unable to make a definitive conclusion as to the cause of the crash.\nThe report found all those aboard the aircraft, including the pilot, had likely become incapacitated and begun suffering from hypoxia.\nThe report stated, \"After the aircraft climbed above the assigned altitude of FL250, the speech and breathing patterns of the pilot, evidenced during the radio transmissions, displayed changes consistent with hypoxia.\" Investigators were, however, unable to conclusively dismiss toxic fumes as the cause. \"The incapacitation of the pilot and passengers was probably due to hypobaric hypoxia because of the high cabin altitude and their not receiving supplemental oxygen\" the report said, adding, \"The reasons for the pilot and passengers not receiving supplemental oxygen [from the oxygen tank aboard the aircraft] could not be determined.\"\nThe ATSB found it likely that the autopilot was engaged, and this caused the aircraft to fly on a straight heading; the vertical path of the aircraft indicated climb power had been set before the occupants of the aircraft were incapacitated. According to the report, \"the design of the aircraft systems were such that, with the autopilot engaged, the engines would continue to operate, and the aircraft would continue to fly without human input until it was disrupted by other events, such as collision or fuel exhaustion.\" It was suggested that, towards the end of the flight, the fuel tank for the left engine was almost empty. \"The near exhaustion of fuel in the left wing tanks may have produced at least one, and probably several, momentary losses of left engine power shortly before all power was lost,\" the report said. \"The aircraft yawed and rolled towards the left engine, as was observed shortly before the aircraft collided with the ground.\"\nThe report said due to the damage to the aircraft upon impact with the ground, investigators were unable to conclude if any of the eight aboard used the oxygen system. However, the report stated \"The absence of a distress radio call, or an attempt to descend the aircraft, and the likelihood that the pilot did not don his oxygen mask, suggested that the pilot was unaware that the aircraft was unpressurised or depressurising.\" The passengers, the report added, were also likely not wearing their oxygen masks, as there was no noise recorded on the ATC transmissions indicating they were attempting to assist the pilot.\nInvestigators were not able to determine what caused the depressurisation of the aircraft, but stated likely causes included either an incorrect switch selection due to pilot error, or a mechanical failure in the aircraft pressurisation system. The air traffic control recordings suggested it was unlikely that a rapid decompression had occurred. The report explains how \"during an explosive or rapid depressurisation of a pressurised aircraft, however, the noise, pressure changes, temperature changes, and draughts within the cabin would have alerted the occupants that a substantial failure had occurred.\" The document listed the two main factors in the crash as:\nAural warning\nIn the aftermath of an incident in 1999 in which the pilot of a Beechcraft Super King Air suffered hypoxia, the ATSB published Report 199902928, and recommended an aural warning be fitted on the flight deck of all Australian Beechcraft Super King Air aircraft. The flight deck of the Beechcraft Super King Air only has visual warning of inadequate cabin pressure.\nIn the aftermath of the Ghost Flight, the Civil Aviation Safety Authority issued a Discussion Paper and a Notice of Proposed Rule Making (NPRM), both proposing aural warning in the Beechcraft Super King Air and other pressurised aircraft. The outcome of consultation on the NPRM was that the Civil Aviation Safety Authority did not mandate aural warning of inadequate cabin pressure, and this angered the families of some of the victims. Instead, the Civil Aviation Safety Authority issued a notice to owners of pressurised aircraft registered in Australia and recommended installation of an aural warning, but did not make it mandatory. The notice said: \"The benefit to your pilots and passengers lies in the reduction in risk of an uncommanded depressurisation leading to an incident or fatal accident. The benefit is much greater than the cost of purchase and installation of one of these low-cost systems.\"\nCoroner's inquest\nto the victims of the crash]]\nThe West Australian Coroner, Mr. Alistair Hope, conducted an inquest into the deaths of the eight occupants of the aircraft. The inquest determined that the deaths were accidental, but was unable to determine the cause of the crash. The Coroner recommended an aural alarm system for pressurised aircraft, and a low-cost flight data recorder.\nThe Coroner was critical of the poor co-ordination between the ATSB, the Queensland Police, and the Civil Aviation Safety Authority (CASA). He also criticised the ATSB for failing to take notes when interviewing witnesses, and for its poor presentation of evidence.\nAir traffic control\nWhen the air traffic controller responsible for the Beechcraft received the open-microphone transmissions, he alerted his supervisor that he was concerned the pilot could be suffering from hypoxia. The controller and his supervisor completed the standard checklist which, at the time, did not include a procedure to follow in the case of incapacitation or hypoxia. In the aftermath of the crash, the checklist was changed to \"incorporate procedures to be followed by air traffic controllers, when a controller suspects that a pilot has been affected by hypoxia.\"\nSee also\n*1999 South Dakota Learjet crash\n*2000 in aviation\n*2000 in Australia\n*Helios Airways Flight 522\n*2022 Baltic Sea Cessna crash\n*Notable decompression accidents and incidents\nReferences\n;Notes\nFurther reading\n*"
    }
  ]
}