{
  "content": [
    {
      "type": "text",
      "text": "# 2000 Wyoming Democratic presidential caucuses\n\n| image1 =\n| candidate1 = Al Gore\n| colour1 = 3333FF\n| home_state1 = Tennessee\n| delegate_count1 = 13\n| popular_vote1 = 223\n| percentage1 = 85.44%\n| image2 =\n| candidate2 = Lyndon LaRouche Jr.\n| colour2 = 6c00e8\n| home_state2 = Virginia\n| delegate_count2 = 0\n| popular_vote2 = 19\n| percentage2 = 7.28%\n| map_image =\n| map_size =\n| map_caption =\n| outgoing_members = IL\n| elected_members = DE (caucus)\n| votes_for_election = 18 delegates to the Democratic National Convention (13 pledged, 5 unpledged)The number of pledged delegates received is determined by the popular vote\n}}\n{| class=\"wikitable sortable\" style=\"font-size:90%;text-align:center;float:right;padding:5px;\"\n! colspan=\"2\"| Pledged nationalconvention delegates\n|-\n! Type\n!\n|-\n| CD at-large\n| 8\n|-\n|\n| 2\n|-\n| At-large\n| 3\n|-\n! Total pledged delegates\n! 13\n|}\nThe 2000 Wyoming Democratic presidential caucuses took place on March 25, 2000, the only contest scheduled that day. The Wyoming caucuses were a closed caucus, with the state awarding 18 delegates to the 2000 Democratic National Convention, of which 13 were pledged delegates allocated on the basis of the results of the caucus.\nVice president and presumptive nominee Al Gore won the caucus, taking close to 85% of the vote and all 13 pledged delegates after the distribution of preferences, compared to senator Bill Bradley's third-place finish with just under 5% and 0 delegates. Conspiracy theorist Lyndon LaRouche Jr., who had gained ballot access in virtually every contest, placed ahead of Bradley with 7%.\nProcedure\nWyoming's Democratic caucuses took place on March 25, 2000, the sole contest on that date.\nOnly registered Democrats (defined as all persons residing in the county and registered to vote as Democrats) were able to vote in the election. County caucuses began across the state at 11:00&nbsp;a.m. on March 25. In the closed caucuses, candidates had to meet a threshold of 15 percent statewide in order to be considered viable. The 13 pledged delegates to the 2000 Democratic National Convention were allocated proportionally on the basis of the results of the caucus. Of these, 8 district delegates would have corresponded to the result of the statewide vote (coterminous with Wyoming's sole congressional district), and another 2 were allocated to party leaders and elected officials (PLEO delegates), in addition to 3 at-large delegates, both also according to the statewide result.\nThe state convention was held on May 20, 2000, and voted on all pledged delegates for the Democratic National Convention. The delegation also included 4 unpledged PLEO delegates: 4 members of the Democratic National Committee, and 1 add-on.\nCandidates\nThe following candidates appeared on the ballot:\n*Al Gore\n*Lyndon LaRouche Jr.\nWithdrawn\n*Bill Bradley\nResults\n{| class=\"wikitable sortable\" style=\"text-align:right;\"\n|+ style=\"background-color:#f2f2f2;margin-bottom:-1px;border:1px solid #aaa;padding:0.2em 0.4em;\" | 2000 Wyoming Democratic presidential primary\n! Candidate\n! Votes\n! %\n! Delegates\n|-\n| style=\"text-align:left;\" data-sort-value=\"Gore, Al\" | Al Gore\n| 223\n| 85.44\n| 13\n|-\n| style=\"text-align:left;\" data-sort-value=\"LaRouche Jr., Lyndon\" | Lyndon LaRouche Jr.\n| 19\n| 7.28\n| rowspan=3\n|-\n| style=\"text-align:left;\" data-sort-value=\"Bradley, Bill\" | Bill Bradley (withdrawn)\n| 13\n| 4.98\n|-\n| style=\"text-align:left;\" data-sort-value=\"ZZZ\" | Write-in votes\n| 6\n| 2.30\n|-\n| style=\"text-align:left;\" data-sort-value=\"ZZZ\" | Unallocated\n| -\n| -\n| 5\n|-\n! Total\n! 261\n! 100%\n! 18\n|}\nReferences"
    }
  ]
}