{
  "content": [
    {
      "type": "text",
      "text": "# 2000 Democratic Party vice presidential candidate selection\n\n| image1 = File:Joe Lieberman official portrait 2 (cropped 3x4).jpg\n| nominee1 = Joe Lieberman\n| colour1 = 1E90FF\n| home_state1 = Connecticut\n| map_image =\n| map_size =\n| map_caption =\n| title = Vice Presidential nominee\n| before_election = Al Gore\n| before_party =\n| after_election = Joe Lieberman\n| after_party =\n}}This article lists those who were potential candidates for the Democratic nomination for Vice President of the United States in the 2000 election. Incumbent Vice President Al Gore won the 2000 Democratic nomination for President of the United States, and chose Connecticut Senator Joseph Lieberman as his running mate on August 7, 2000. Lieberman, a centrist two-term Democratic senator, was chosen for being \"tough on defense\" and foreign policy issues. Lieberman was the first Jewish nominee chosen for a national ticket. The choice of Lieberman was announced shortly before the 2000 Democratic National Convention. Former Secretary of State Warren Christopher led the vetting process. The Gore–Lieberman ticket ultimately lost to the Bush–Cheney ticket in the general election. Coincidental to the presidential election, Lieberman was re-elected to a third term as senator from Connecticut and subsequently changed his party affiliation to Independent in 2006.\nSelection\nShortlist\nFile:Evan Bayh official portrait v2 (cropped).jpg|\nFile:John Edwards, official Senate photo portrait (cropped 3x4 v2).jpg|\nFile:Dick Gephardt portrait (3x4 crop).jpg|\nFile:John F. Kerry (closein cropped 3x4).jpg|\nFile:Joe Lieberman official portrait (cropped2).jpg|\nFile:Jeanne Shaheen 2008 NH (cropped).jpg|\nAnnouncement\nIn August 2000, Gore announced that he had selected Senator Joe Lieberman of Connecticut as his vice presidential running mate. Lieberman became the first person of the Jewish faith to appear on a major party's presidential ticket (Barry Goldwater, the Republican presidential nominee in 1964, was of Jewish descent but identified as an Episcopalian). Lieberman, who was a more conservative Democrat than Gore, had publicly blasted President Clinton for the Monica Lewinsky affair. Many pundits saw Gore's choice of Lieberman as another way of trying to distance himself from the scandals of the Clinton White House.\nMedia speculation on possible vice presidential candidates\nMembers of Congress\nFile:BarbaraBoxer (cropped).jpg|\nFile:Bill Bradley LBJ Foundation DIG14009 178 (32647287026) (1) (cropped).jpg|\nFile:D2sm (3x4).gif|\nFile:Dianne Feinstein congressional portrait (cropped).jpg|alt=|\nFile:BobGrahamCropped.jpg|\nFile:Tom Harkin official portrait (cropped).jpg|alt=|\nFile:Senator Bob Kerrey (cropped).jpg|alt=|\nFile:Robert Menendez official photo (3x4).jpg|\nFile:Zell B Miller (3x4).jpg|\nFile:Barbara Mikulski (cropped).jpg|\nFile:George Mitchell in Tel Aviv July 26, 2009 (3x4).jpg|alt=|\nFile:Sam Nunn 1991 (cropped).jpg|\nGovernors\nFile:Gray Davis, portrait (3x4).jpg|\nFile:Jim Hunt official portrait (3x4).jpg|\nFederal executive branch officials\nFile:Andrew Cuomo (cropped).png|\nFile:Bill Richardson official photograph as Secretary of Energy.jpg|\nFile:Pr4262ls-treasury-rubin.jpg|\nFile:William Cohen, official portrait (cropped).jpg|\nOthers\nFile:Kathleen Kennedy Townsend giving out awards, 2001, cropped (cropped).jpg|\nSee also\n*Al Gore 2000 presidential campaign\n*2000 Democratic Party presidential primaries\n*2000 Democratic National Convention\n*2000 United States presidential election\n*List of United States major party presidential tickets\nReferences"
    }
  ]
}