{
  "content": [
    {
      "type": "text",
      "text": "# 2000 Michigan Democratic presidential caucuses\n\n| image1 =\n| candidate1 = Al Gore\n| colour1 = 3333FF\n| home_state1 = Tennessee\n| delegate_count1 = 120\n| popular_vote1 = 15,853\n| percentage1 = 82.74%\n| image2 =\n| candidate2 = Bill Bradley(withdrawn)\n| colour2 = FA8320\n| home_state2 = New Jersey\n| delegate_count2 = 9\n| popular_vote2 = 3,117\n| percentage2 = 16.27%\n| map_image = MI President Democratic Primary 2000 Congressional Districts.svg\n| map_size = 300px\n| map_caption = Primary results by congressional districtGore:\n| outgoing_members = AZ\n| elected_members = MN\n| votes_for_election = 158 delegates to the Democratic National Convention (129 pledged, 29 unpledged)The number of pledged delegates received is determined by the popular vote\n}}\nThe 2000 Michigan Democratic presidential caucuses took place on March 11, 2000, as one of three states voting the weekend after Super Tuesday in the Democratic Party primaries for the 2000 presidential election. The Michigan primary was a modified open primary, with the state awarding 158 delegates towards the 2000 Democratic National Convention, of which 129 were pledged delegates allocated on the basis of the results of the caucus.\nVice president Al Gore decisively won the caucuses, getting almost 83% of the vote and 120 delegates. Senator Bill Bradley received around 16% of the vote and 9 delegates.\nProcedure\nMichigan was one of three states which held primaries on March 11, 2000, the weekend after Super Tuesday.\nMichigan held an \"Iowa style\" caucus with each caucus convening on the same day and at the same time across the state. All participants had to complete a registration sign-in, including a public declaration that they were a Democrat. Participants then \"broke out\" by presidential preference to cast and count the vote, which is lining up to show the number of people supporting each candidate. Each caucus adjourned no later than two hours after convening and results were reported back to the Michigan Democratic Party that day.\nVoting took place throughout the state from 11:00&nbsp;a.m. until 8:00&nbsp;p.m. local time. In the semi-open caucuses, candidates had to meet a threshold of 15 percent at the congressional district or statewide level in order to be considered viable. The 129 pledged delegates to the 2000 Democratic National Convention were allocated proportionally on the basis of the results of the caucuses. Of these, between 4 and 8 were allocated to each of the state's 16 congressional districts and another 17 were allocated to party leaders and elected officials (PLEO delegates), in addition to 28 at-large delegates.\nAfter district conventions on May 6, 2000, during which district-level delegates were selected, the state central committee meeting subsequently was held on May 20, 2000, to vote on the 28 at-large and 17 pledged PLEO delegates for the Democratic National Convention. The delegation also included 27 unpledged PLEO delegates: 15 members of the Democratic National Committee, 11 members of Congress (Senator Carl Levin and 7 representatives, Bart Stupak, James Barcia, Debbie Stabenow, Dale Kildee, David Bonior, Sander Levin, Lynn Rivers, John Conyers, Carolyn Cheeks Kilpatrick, and John Dingell), and 2 add-ons.\n{| class=\"wikitable sortable\" style=\"font-size:90%;text-align:center;float:none;padding:5px;\"\n! colspan=\"4\"| Pledged nationalconvention delegates\n|-\n! Type\n!\n! Type\n!\n|-\n| CD1\n| 5\n| CD9\n| 5\n|-\n| CD2\n| 4\n| CD10\n| 5\n|-\n| CD3\n| 4\n| CD11\n| 5\n|-\n| CD4\n| 5\n| CD12\n| 5\n|-\n| CD5\n| 5\n| CD13\n| 5\n|-\n| CD6\n| 4\n| CD14\n| 8\n|-\n| CD7\n| 4\n| CD15\n| 8\n|-\n| CD8\n| 7\n| CD16\n| 5\n|-\n|\n| 17\n| At-large\n| 28\n|-\n! colspan=\"3\"| Total pledged delegates\n! 129\n|}\nCandidates\nThe following candidates appeared on the ballot:\n*Al Gore\n*Lyndon LaRouche Jr.\nWithdrawn\n*Bill Bradley\nResults\n{| class=\"wikitable sortable\" style=\"text-align:right;\"\n|+ style=\"background-color:#f2f2f2;margin-bottom:-1px;border:1px solid #aaa;padding:0.2em 0.4em;\" | 2000 Michigan Democratic presidential caucuses\n! Candidate\n! Votes\n! %\n! Delegates\n|-\n| style=\"text-align:left;\" data-sort-value=\"Gore, Al\" | Al Gore\n| 15,853\n| 82.74\n| 120\n|-\n| style=\"text-align:left;\" data-sort-value=\"Bradley, Bill\" | Bill Bradley (withdrawn)\n| 3,117\n| 16.27\n| 9\n|-\n| style=\"text-align:left;\" data-sort-value=\"LaRouche Jr., Lyndon\" | Lyndon LaRouche Jr.\n| 190\n| 0.99\n| rowspan=1\n|-\n| style=\"text-align:left;\" data-sort-value=\"ZZZ\" | Unallocated\n| -\n| -\n| 29\n|-\n! Total\n! 19,160\n! 100%\n! 158\n|}\nReferences"
    }
  ]
}