{
  "content": [
    {
      "type": "text",
      "text": "# 2002 Barking and Dagenham London Borough Council election\n\n5\n|popular_vote1      = 14,654\n|percentage1        = 55.6\n|swing1             = -14.4\n|image2             =\n|leader2            =\n|leader_since2      =\n|party2             = Chadwell Heath RA\n|last_election2     = 3 seats\n|seats2             = 4\n|seat_change2       = 1\n|popular_vote2      = 1,444\n|percentage2        = 5.5\n|swing2             = -1.0\n|image4             =\n|leader4            =\n|leader_since4      =\n|party4             = Liberal Democrats (UK)\n|last_election4     = 1 seats\n|seats4             = 3\n|seat_change4       = 2\n|popular_vote4      = 6,115\n|percentage4        = 23.2\n|swing4             = +21.6\n|image5             =\n|leader5            =\n|leader_since5      =\n|party5             = Conservative Party (UK)\n|last_election5     = 0 seats\n|seats5             = 2\n|seat_change5       = 2\n|popular_vote5      = 3,638\n|percentage5        = 13.8\n|swing5             = -4.8\n|map_image          = Barking and Dagenham UK local election 2002 map.svg\n|map_size           = 300px\n|map_caption        = Map of the results of the 2002 Barking and Dagenham council election. Labour in red, Chadwell Heath Residents Association in grey, Liberal Democrats in yellow and Conservatives in blue.\n|title              = Council control\n|posttitle          = Council control after election\n|before_election    =\n|before_party       = Labour Party (UK)\n|after_election     =\n|after_party        = Labour Party (UK)\n}}\nElections for Barking and Dagenham London Borough Council were held on 2 May 2002 to elect members to the council. All seats were up for election following boundary changes since the last election in 1998. The Labour Party kept overall control of the council, but lost 5 seats. Overall turnout was 22.76%.\nBackground\n100 candidates were nominated in total. Labour again ran a full slate (51) and was the only party to do so. By contrast the Conservative Party ran only 12 candidates , whilst the Liberal Democrats ran 28.\nElection result\n|}\n}}\nThe by-election was called following the death of Cllr. Susan Bramley.\nEastbrook\nThe by-election was called following the death of Cllr. Lawrence Bunn and the resignation of Cllr. Sidney Summerfield.\nEastbury\nThe by-election was called following the death of Cllr. Daniel Felton\nChadwell Heath\nThe by-election was called following the death of Cllr. Robert Jeyes.\nValence\nThe by-election was called following the death of Cllr. Vera Cridland.\nGoresbrook\nThe by-election was called following the resignation of Cllr. Matthew Huggins.\nVillage\nThe by-election was called following the death of Cllr. Darrin Best.\nBecontree\nThe by-election was called following the death of Cllr. John Wainwright.\nGoresbrook\nThe by-election was called following the resignation of Cllr. Daniel Kelly.\nReferences"
    }
  ]
}