{
  "content": [
    {
      "type": "text",
      "text": "# 2003 Central African Republic coup d'état__disambig_1\n\n| coordinates       =\n| map_type          =\n| map_relief        =\n| latitude          =\n| longitude         =\n| map_size          =\n| map_marksize      =\n| map_caption       =\n| map_label         =\n| territory         =\n| result            = President Patassé overthrown, General Bozizé suspends constitution and declares curfew\n| status            =\n| combatants_header = Belligerents\n| combatant1        =  Supporters of François BozizéAlleged support:\n| combatant2        =  Government of the Central African RepublicSupport:CEMAC:\n*\nLibya\n| combatant3        =\n| commander1        = Gen. François BozizéAbakar Sabone\n| commander2        = President Ange-Félix Patassé\n| commander3        =\n| units1            = Unknown\n| units2            = Central African Armed Forces\n| units3            =\n| strength1         = 1,000\n| strength2         =  Unknown\n370 soldiers\n| strength3         =\n| casualties1       = Unknown\n| casualties2       =  Unknown\n3 soldiers killed\n| casualties3       =\n| notes             =\n| campaignbox       =\n}}\nA '''coup d'état''' occurred in March 2003 in the Central African Republic when the forces of General François Bozizé marched on Bangui, the country's capital, while President Ange-Félix Patassé was attending a regional Community of Sahel–Saharan States leaders' summit in Niger.\nBackground\nIn 2001, a failed coup had taken place against the Patassé government. Officers including André Kolingba and possibly Bozizé had been involved in this coup attempt. After a long trial, the Central African criminal court handed a death sentence to Kolingba (then in exile in Uganda) and 21 other coup plotters in October 2002; the charges against Bozizé had already been dropped in late 2001, although he was dismissed as army chief.\nIn the period that followed the coup attempt, political and ethnic tensions mounted. Militias that were loyal to Bozizé (who enjoyed support among the Gbaya people) clashed with Libyan troops as well as Congolese rebels from the MLC, both deployed by Patassé. The MLC troops committed war crimes against civilians and hundreds of unarmed civilians, most of them Yakoma people, were extrajudicially executed.\nOn 25 October 2002, forces local to Bozizé invaded Bangui. They withdrew after six days of fighting. On 27 November 2002, armed forces recaptured Bossembélé, killing five rebels and reopening the road to Bouar. On 7 December, armed forces recaptured Damara from rebels. On 20 December armed forces recaptured Bozoum. On 14 January 2003, Bouar was reportedly under rebel control.\nCoup\nOn Thursday, 13 March 2003, President Ange-Félix Patassé left Bangui to attend a regional Community of Sahel–Saharan States (CEN-SAD) summit in Niamey, Niger. He was accompanied by a delegation of approximately twenty people, including First Lady Angèle Patassé, Foreign Minister Martial Beti Marace, and presidential advisor Prosper Ndouba, who had recently been freed from rebel captivity just two months before. The presidential delegation flew from Bangui to Niamey on board a Libyan Douglas DC-8, which had been loaned to Patassé by Libyan leader Muammar Gaddafi for use on this trip. Before his departure, the president's Chief of Staff, Colonel Antoine Gambi, assured Patassé that François Bozizé's militias were contained to the north of the country and were not a threat to Bangui during the trip.\nWhile Patassé was away, Bozizé led 1,000 fighters towards the capital city of Bangui. On Friday, 14 March 2003, the rebels captured the towns of Bossembélé and Bouali, where President Patassé owned a small farm, en route to Bangui. Meanwhile, at the same time that rebels were marching on Bangui, President Patassé was in Niamey meeting with Gaddafi and Chad President Idriss Déby.\nBozizé and his rebels entered Bangui on 15 March 2003, while President Patassé was still out of the country. They captured the international airport and the presidential palace. Government troops, many of whom had not been paid in months, put up little resistance. The 370 CEMAC peacekeepers abandoned their posts rather than fight.\nPresident Ange-Félix Patassé and his delegation had also intended to return to the Central African Republic on March 15, the same day that the rebels were seizing Bangui. However, the flight carrying President Patassé back to Bangui was delayed from taking off from Niger because First Lady Angèle Patassé was running late from a shopping trip in Niamey. While no one on board the presidential plane was aware of the ongoing coup at the time, the first lady's lengthy Niamey shopping trip \"probably saved the couple's life,\" according to journalist François Soudan in Jeune Afrique.\nBozizé and his rebels occupied Bangui M'Poko International Airport just as Patassé's delayed aircraft was on approach to the airport. Had they attempted to land any sooner, Patassé and his presidential entourage likely would have been captured or shot down. Rebels shot at Patassé's plane as it approached Bangui, forcing the plane to divert to Yaoundé Nsimalen International Airport outside Yaoundé, Cameroon. The deposed presidential delegation was taken to the Yaoundé Hilton Hotel, where Angèle and Ange-Félix Patassé learned that their two young children, Salomon and Providence, had been taken to safety at the French embassy in Bangui.  The children were soon evacuated by a Transall C-160 military transport aircraft to Libreville, Gabon, with other members of the Patassé family and their Togolese servants. At least fifteen people were killed in the coup.\nA curfew was imposed afterwards by Bozizé and the constitution was suspended.\nOn Sunday, March 16, 2003, one day after taking power, François Bozizé proclaimed himself president of the Central African Republic. He would go on to form a union government with Abel Goumba as prime minister, which ruled the country until the 2005 election. France deployed a number of troops to the country for the first time in four years in order to protect foreign nationals. After the coup, Bozizé created a new division in the Central African Armed Forces, made up of \"patriots\" who took part in the coup with him, called the Republican Guard. They committed numerous crimes against civilians in the capital.\nBy Monday, March 17, 2003, international African support for Ange-Félix Patassé had faded. Cameroon President Paul Biya had refused to call or acknowledge Patassé, though First Lady of Cameroon Chantal Biya met with her former counterpart, Angèle Patassé, and sent the family African food as part of her condolences over the coup. Gabonese President Omar Bongo backpaddled from his initial support for French intervention in the Central African Republic, which Patassé calls \"a betrayal.\"\nOn Tuesday, March 18, 2003, two Cameroonian officials, Minister of State for Territorial Administration Hamidou Marafa Yaya and Secretary General of the Presidency Jean-Marie Atangana Mebarao met with Patassé and told him to leave Cameroon within 48 hours. Cameroon President Paul Biya flew to the United States the next day having never called or met with Patassé.\nPatassé considered going to South Africa or Libya, before settling on Togo, where he had spent previously time in exile during the 1980s and met his Togolese second wife, Angèle Patassé. Togolese President Gnassingbé Eyadema welcomed the Patassés to the country. Malian President Amadou Toumani Touré and Senegalese President Abdoulaye Wade also offered invitations for Patassé to come to their countries.\nThe Patassé family flew from Yaoundé to Lomé, Togo, on March 19, 2003, to begin their exile from the Central African Republic.\nAlleged Chadian involvement\nMilitants from Chad were spotted among the rebel fighters. However, the President of Chad, Idriss Déby, denied providing any military support to Bozizé. Shortly after the coup, Patassé openly accused Déby, whom he had met with in Niamey while it was taking place, of supporting Bozizé, as Chadian forces and other groups were reportedly looting parts of Bangui. Patassé said that Chad has an economic interest in gaining control of Central African oil fields and that Déby hoped to annex the northern CAR for this purpose. In relation to these accusations, the USIP stated that \"CAR and Chad have a history of harboring each other's insurgent groups\". More generally, foreign mercenaries played a large role in the power struggle between Patassé and Bozizé, with the former relying on Libyan and Congolese fighters and the latter on Chadian fighters.\nAfter Bozizé took power, he and Déby went on to establish a strong political relationship, thereby aiming to \"prevent closer cooperation between rebel groups on both sides of the border\".\nInternational response\n* and : Foreign ministers of the two countries visited General Bozizé after the coup, saying that they would negotiate with him.\n*: The President of Chad, Idriss Déby, denied allegations that Chadian troops helped Bozizé.\nSee also\n*2001 Central African Republic coup attempt\n*2002 Central African Republic coup attempt\n*Central African Republic Bush War\n*Central African Republic Civil War\nReferences"
    }
  ]
}