{
  "content": [
    {
      "type": "text",
      "text": "# 2003 Czech presidential election\n\n| image1 = Vaclav Klaus headshot.jpg\n| nominee1 = Václav Klaus\n| party1 = Civic Democratic Party (Czech Republic)\n| electoral_vote1 = 142\n| percentage1 = 53.4%\n| image2 = Jan Sokol.jpg\n| nominee2 = Jan Sokol\n| party2 = Czech Social Democratic Party\n| electoral_vote2 = 124\n| percentage2 = 46.6%\n| title = President\n| before_election = Václav Havel\n| before_party = Independent politician\n| after_election = Václav Klaus\n| after_party = Civic Democratic Party (Czech Republic)\n}}\nIndirect presidential elections were held in the Czech Republic in January and February 2003 to elect a new President. The Parliament of the Czech Republic failed to elect a candidate on the first two ballots on the 15 and 24 January. However, on the third round of the third ballot on 28 February, Václav Klaus was elected.\nBackground and procedure\nIn 2003 Václav Havel had served the maximum 2 consecutive terms as President of the Czech Republic, with his second term ending on 2 February 2003. A joint session of the Parliament of the Czech Republic was held on the 15 January 2003 to elect his successor.\nBefore the constitution was amended in 2012 to establish direct presidential election, the President of the Czech Republic was elected indirectly by a joint session of the Czech Parliament. Each ballot had 3 rounds, with a candidate needing an absolute majority of both the 200 members of the Chamber of Deputies and the 81 members of the Senate in order to be elected in the first round. When no candidate achieved a majority in both houses of parliament in the first round, then a second round was held between the best-placed candidate in the Chamber vote and the best-placed candidate in the Senate vote, again with an absolute majority needed to get in both houses, but only among the members who were present at the election.\nIf the second round was also unsuccessful, then in the third round a candidate needed to win a majority of all present members of parliament, but with votes of both chambers being taken together. So if all the members of parliament were present a candidate would need 141 votes, from a combination of deputies and senators, in order to be elected in the third round. When no candidate is elected in all 3 rounds, the process would be repeated at further joint sessions until a candidate was elected.\nParties in parliament\n{| class=wikitable style=text-align:left style=text-align:center;font-size:85%;line-height:14px;\"\n|-\n! rowspan=\"2\" colspan=\"2\"|Party\n! rowspan=\"2\"| Chamber of Deputies\n! rowspan=\"2\"| Senate\n! rowspan=\"2\"| Both Chambers\n! colspan=\"3\"|Endorsed Candidate\n|-\n! 1st Ballot\n! 2nd Ballot\n! 3rd Ballot\n|-\n| bgcolor=\"\" |\n| Czech Social Democratic Party (ČSSD)\n| }}\n| }}\n| }}\n| Jaroslav Bureš\n| Miloš Zeman\n| Jan Sokol\n|-\n| bgcolor=\"\" |\n| Civic Democratic Party (ODS)\n| }}\n| }}\n| }}\n| colspan=\"3\"| Václav Klaus\n|-\n| bgcolor=\"\" |\n| Communist Party of Bohemia and Moravia (KSČM)\n| }}\n| }}\n| }}\n| Miroslav Kříženecký\n|\n| Václav Klaus\n|-\n|  bgcolor=\"\" |\n| Christian and Democratic Union - Czechoslovak People's Party (KDU-ČSL)\n| }}\n| }}\n| }}\n| Petr Pithart\n| Jaroslava Moserová\n| Jan Sokol\n|-\n| style=\"background:#228b22;\"|\n| Freedom Union – Democratic Union (US-DEU)\n|\n|\n|\n| Petr Pithart\n| Jaroslava Moserová\n| Jan Sokol\n|-\n| style=\"background:#0000FF;\"|\n| Civic Democratic Alliance (ODA)\n|\n|\n|\n| Petr Pithart\n| Jaroslava Moserová\n|\n|-\n| style=\"background:#FFCB03;\"|\n| SNK European Democrats (SNK ED)\n|\n|\n|\n|\n|\n|\n|-\n| style=\"background:#292829;\"|\n| INDEPENDENTS (NEZ)\n|\n|\n|\n|\n|\n|\n|-\n| style=\"background:#A9A9A9;\"|\n| Independents\n|\n|\n|\n|\n|\n|\n|}\nCandidates\n{| class=\"wikitable\" style=text-align:center;font-size:85%;line-height:14px;\"\n|-\n! colspan=3|Name\n! Party\n! Occupation\n! Note\n|-\n| style=\"background-color:;\" |\n|\n| Jaroslav Bureš\n| ČSSD\n| Minister of Justice\n| He participated in Social democratic primaries but came second. He was nominated for the first ballot of election.\n|-\n| style=\"background-color:;\" |\n|\n| Václav Klaus\n| ODS\n| Leader of ODS, former Prime Minister\n| He decided to run for president after his party lost 2002 legislative election. He announced his candidature on 12 October 2002. He was nominated by ODS. His victory was considered unlikely.\n|-\n| style=\"background-color:;\" |\n|\n| Miroslav Kříženecký\n| KSČM\n| Lawyer, politician\n| He was nominated by Communist party.\n|-\n| style=\"background:#0000FF;\"|\n|\n| Jaroslava Moserová\n| ODA\n| Senator\n| She was nominated by a group of Liberal parties for the second ballot.\n|-\n| style=\"background-color:;\" |\n|\n| Petr Pithart\n| KDU–ČSL\n| Senator and former Prime Minister\n| He was nominated by KDU-ČSL. He participated in 1st ballot in which he was front-runner prior to voting.\n|-\n| style=\"background-color:;\" |\n|\n| Jan Sokol\n| ČSSD\n| Philosopher\n| He was nominated by ČSSD for the third ballot.\n|-\n| style=\"background-color:;\" |\n|\n| Miloš Zeman\n| ČSSD\n| Former leader of ČSSD, former  Prime Minister\n| He announced his candidature on 22 September 2002. He won party's primaries and was nominated in 2nd ballot because he refused to participate in 1st ballot.\n|-\n|}\nOther potential candidates\n{| class=\"wikitable\" style=text-align:center;font-size:85%;line-height:14px;\"\n|-\n! colspan=3|Name\n! Party\n! Occupation\n! Note\n|-\n| style=\"background-color:;\" |\n|\n| Madeleine Albright\n| Democratic Party\n| American politician and diplomat, former United States Secretary of State\n| She was suggested by Václav Havel as his successor. There were rumors that she seriously considered running. She eventually refused to run for president.\n|-\n| style=\"background-color:;\" |\n|\n| Petra Buzková\n| ČSSD\n| Minister of Education\n| She was suggested as possible candidate by Václav Havel and she was offered nomination by some members of ČSSD but she refused.\n|-\n| style=\"background-color:;\" |\n|\n| Václav Fischer\n| Independent\n| Senator and businessman\n| His candidature was speculated due to his popularity in 2002. There was a poll that gave him a chance to win the direct vote. He said that he plans to run in 2008 if the direct vote is introduced.\n|-\n| style=\"background-color:;\" |\n|\n| Karel Gott\n| Independent\n| Singer\n| Gott said that he would run for the office if Czech president is elected directly. He later endorsed Václav Klaus.\n|-\n| style=\"background-color:;\" |\n|\n| Helena Illnerová\n| ČSSD, KDU-ČSL, US-DEU\n| President of Czech Academy of Sciences\n| Suggested as potential candidate of governing coalition for third ballot.\n|-\n| style=\"background-color:;\" |\n|\n| Pavel Klener\n| ČSSD, KDU-ČSL, US-DEU\n| Chairman of Czech Oncologist Society\n| Suggested as potential candidate of governing coalition for third ballot.\n|-\n| style=\"background-color:;\" |\n|\n| Otakar Motejl\n| ČSSD\n| Ombudsman of the Czech Republic\n| He participated in presidential primaries of ČSSD and was considered one of the front-runners in the election. His presidential bid ended when he came third in the primaries and lost to Zeman and Bureš. Despite his lost, he still had strong support in party's leadership. He was later suggested for third ballot but it was declined by governing parties.\n|-\n| style=\"background-color:;\" |\n|\n| Martin Potůček\n| ČSSD\n| University professor, public policy analyst, journalist.\n| He participated in presidential primaries of ČSSD but received only 5% of votes.\n|-\n| style=\"background-color:;\" |\n|\n| Pavel Rychetský\n| ČSSD\n| Minister of Justice\n| He was suggested by ČSSD for third ballot but Rychetský declined .\n|-\n| style=\"background-color:;\" |\n|\n| Jakub S. Trojan\n| ČSSD\n| Theologist\n| Planned to participate in presidential primaries of ČSSD.\n|-\n| style=\"background-color:;\" |\n|\n| Ivan Wilhelm\n| ČSSD, KDU-ČSL, US-DEU\n| Chairman of Charles University\n| Suggested as potential candidate of governing coalition for third ballot.\n|-\n| style=\"background-color:;\" |\n|\n| Rudolf Zahradník\n| ČSSD\n| Former President of Czech Academy of Sciences\n| Announced as candidate in presidential primaries of ČSSD but withdrawn prior voting.\n|-\n|}\nOpinion polls\nFirst ballot\nInitial candidates\nThe leading party in the government coalition, the Social Democratic Party, nominated a former justice minister Jaroslav Bureš. He defeated a former leader of his party and Prime Minister, Miloš Zeman, for the nomination, despite Zeman winning a party primary, causing splits in the party. Zeman was a rival of the Prime Minister and Social Democrat leader Vladimír Špidla and Bureš was an attempted compromise candidate for the party.\nThe junior party in the coalition, the Christian Democratic Party, meanwhile nominated the chairman of the Senate and former Prime Minister between 1990 and 1992, Petr Pithart as their candidate. He was also supported by the Freedom Union party, another party in the governing coalition.\nThe main opposition party, the Civic Democratic Party, chose the former leader of the party and prime minister, Václav Klaus, as their candidate. Klaus declared his candidacy in October 2002 and stepped down as leader of his party in December, after having led his party to defeat at the 2002 parliamentary election.\nThe final candidate in the election was Miroslav Kříženecký, a former military prosecutor, who was supported by the Communist Party.\nVoting\nReports before the election had Petr Pithart and Václav Klaus as the favourites for the election, due to disunity in the Social Democrats, with the Social Democrats and some Communists expected to support Pithart on the second round against Václav Klaus. However, there was scepticism that any candidate would be able to be elected in the first ballot on the 15 January 2003. Before the votes the outgoing President Václav Havel delivered a farewell speech for which he received a standing ovation, after urging legislators to follow their conscience.\nThe first vote saw no candidate elected, but with the Social Democrat candidate, Jaroslav Bureš, and the Communist candidate, Miroslav Kříženecký being eliminated with both receiving 46 votes from deputies and senators. Almost half of the Social Democrats lawmakers did not vote for Bureš, highlighting the divisions within the party. Very surprising was low support for Petr Pithart. He received only 20 votes in Chamber of Deputies even though KDU-ČSL that nominated him had 21 Members of the Chamber.\nVáclav Klaus and Petr Pithart competed in the next two rounds but neither was able to be elected, with Klaus getting the most votes in the Chamber of Deputies, while Pethart received the most votes in the Senate in all three election rounds. Klaus led throughout and in the third round received 113 votes to 89 for Pithart, but as 84 legislators submitted empty ballots neither was able to reach the required 141 votes. The first ballot showed disunity of ČSSD during the election. It also showed that Klaus has much higher support than it was expected.\n{| class=\"wikitable\"\n|-\n! rowspan=\"2\" | Round\n! colspan=\"2\" | Václav Klaus\n! colspan=\"2\" | Petr Pithart\n! colspan=\"2\" | Jaroslav Bureš\n! colspan=\"2\" | Miroslav Kříženecký\n|-\n! Deputies\n! Senators\n! Deputies\n! Senators\n! Deputies\n! Senators\n! Deputies\n! Senators\n|-\n| rowspan=\"2\" style=\"text-align:center;\"| 1st\n| align=center | 92\n| align=center | 31\n| align=center | 20\n| align=center | 35\n| align=center | 39\n| align=center | 7\n| align=center | 44\n| align=center | 2\n|- style=\"text-align:center;\"\n| colspan=\"2\"| 123\n| colspan=\"2\"| 55\n| colspan=\"2\"| 46\n| colspan=\"2\"| 46\n|-\n| rowspan=\"2\" style=\"text-align:center;\"| 2nd\n| align=center | 77\n| align=center | 32\n| align=center | 46\n| align=center | 43\n| align=center | -\n| align=center | -\n| align=center | -\n| align=center | -\n|- style=\"text-align:center;\"\n| colspan=\"2\"| 109\n| colspan=\"2\"| 89\n| colspan=\"2\"| -\n| colspan=\"2\"| -\n|-\n| rowspan=\"2\" style=\"text-align:center;\"| 3rd\n| align=center | 80\n| align=center | 33\n| align=center | 44\n| align=center | 40\n| align=center | -\n| align=center | -\n| align=center | -\n| align=center | -\n|- style=\"text-align:center;\"\n| colspan=\"2\"| 113\n| colspan=\"2\"| 89\n| colspan=\"2\"| -\n| colspan=\"2\"| -\n|-\n|}\nSecond ballot\nFollowing the first ballot the five parties in parliament agreed to try again on the 24 January. Václav Klaus, after leading in the first ballot, was renominated by the Civic Democrats, but no other party again supported the candidates they had nominated in the first ballot.\nOn the 18 January the Social Democrats nominated the former Prime Minister Miloš Zeman as their candidate in the next ballot. The party leadership was reported to have given him an \"overwhelming majority\" in the vote on the party's candidate. However Zeman was a rival of the Social Democrat leader and prime minister, Vladimír Špidla, and his election was seen as possibly furthering divisions in the party. Meanwhile, the 2 junior parties in the governing coalition, the Christian Democrats and the Freedom Union, nominated senator and former diplomat Jaroslava Moserová, who would have been the first female Czech president if she had won the election. It was expected that second ballot will be duel between Klaus and Zeman. This was nicknamed \"Clash of Titans.\"\nIn the first round Miloš Zeman was surprisingly eliminated after winning 78 votes from deputies and 5 from senators. His elimination came after Klaus came first among deputies with 89 votes, while Moserová came first among the senators with 43 votes. Zeman was reported to have been opposed by some Social Democratic legislators in order to prevent him from getting into a position to challenge Prime Minister Špidla. In the second round the deputies again supported Klaus, but the senate voted 42-33 in favour of Moserová. This led to a third round being held, which Klaus won by 127 votes to 65, but with 85 blank votes Klaus failed to reach the required 141 votes.\n{| class=\"wikitable\"\n|-\n! rowspan=\"2\" | Round\n! colspan=\"2\" | Václav Klaus\n! colspan=\"2\" | Jaroslava Moserová\n! colspan=\"2\" | Miloš Zeman\n|-\n! Deputies\n! Senators\n! Deputies\n! Senators\n! Deputies\n! Senators\n|-\n| rowspan=\"2\" style=\"text-align:center;\"| 1st\n| align=center | 89\n| align=center | 32\n| align=center | 25\n| align=center | 43\n| align=center | 78\n| align=center | 5\n|- style=\"text-align:center;\"\n| colspan=\"2\"| 121\n| colspan=\"2\"| 68\n| colspan=\"2\"| 83\n|-\n| rowspan=\"2\" style=\"text-align:center;\"| 2nd\n| align=center | 85\n| align=center | 33\n| align=center | 32\n| align=center | 42\n| align=center | -\n| align=center | -\n|- style=\"text-align:center;\"\n| colspan=\"2\"| 118\n| colspan=\"2\"| 74\n| colspan=\"2\"| -\n|-\n| rowspan=\"2\" style=\"text-align:center;\"| 3rd\n| align=center | 95\n| align=center | 32\n| align=center | 26\n| align=center | 39\n| align=center | -\n| align=center | -\n|- style=\"text-align:center;\"\n| colspan=\"2\"| 127\n| colspan=\"2\"| 65\n| colspan=\"2\"| -\n|-\n|}\nBetween the second and third ballots\nThe presidential term of Václav Havel finished on the 2 February, which meant that legislators had 30 days to elect a successor according to the constitution. During the period in which there was no president, the powers of the president were assumed jointly by the Prime Minister Vladimír Špidla and the Speaker of the Chamber of Deputies Lubomír Zaorálek. This was the first time the Czech Republic had been without a president.\nOpinion polls showed the population strongly supported changing the constitution to allow the direct election of the president by popular vote, with political leaders indicating they would attempt to make this change if a third attempt to elect a president was unsuccessful. On the 5 February a popular Czech singer, Karel Gott, indicated he would be interested in standing if direct popular election was introduced.\nFollowing his defeat in the first round of the second ballot Social Democrat Milos Zeman announced he would not run in a third ballot. However the leader of the opposition Civic Democrats, Mirek Topolánek, restated his party's support for Václav Klaus on the 3 February and called for a new election date to be set. The Speaker Lubomír Zaorálek said on the 7 February that the third ballot would be held on the 28 February.\nThird ballot\nSince the failed second ballot the 3 parties in the governing coalition, the Social Democrats, Christian Democrats and Freedom Union, had held talks in an attempt to agree on a candidate. On the 19 February 2003 the 3 parties nominated Jan Sokol, the Dean of Charles University in Prague, who formerly had for a short time been education minister in a caretaker government. Sokol had been unanimously backed by the 63 Social Democratic deputies present at a party meeting earlier and if all the legislators from the governing coalition backed Sokol they would be able to elect him as president. By the 25 February a total of 97 legislators from the governing coalition in the Chamber of Deputies signed a declaration to officially nominate Sokol.\nAt the third ballot on the 28 February 2003, Václav Klaus led on the first 2 votes against Jan Sokol, but failed to reach the necessary majority, as deputies voted in favour of Klaus, but senators favored Sokol. However, on the third vote Klaus won the support of 142 legislators, narrowly achieving the necessary 141 votes to defeat Sokol who won 124 votes, while 14 legislators abstained and one was absent. Decisive was the support of members of the Communist Party and of a group of rebels from the governing coalition that refused to support Sokol.  Klaus was sworn in as president on the 8 March.\n{| class=\"wikitable\"\n|-\n! rowspan=\"2\" | Round\n! colspan=\"2\" | Václav Klaus\n! colspan=\"2\" | Jan Sokol\n|-\n! Deputies\n! Senators\n! Deputies\n! Senators\n|-\n| rowspan=\"2\" style=\"text-align:center;\"| 1st\n| align=center | 115\n| align=center | 32\n| align=center | 81\n| align=center | 47\n|- style=\"text-align:center;\"\n| colspan=\"2\"| 147\n| colspan=\"2\"| 128\n|-\n| rowspan=\"2\" style=\"text-align:center;\"| 2nd\n| align=center | 109\n| align=center | 30\n| align=center | 83\n| align=center | 46\n|- style=\"text-align:center;\"\n| colspan=\"2\"| 139\n| colspan=\"2\"| 129\n|-\n| rowspan=\"2\" style=\"text-align:center;\"| 3rd\n| align=center | 109\n| align=center | 33\n| align=center | 78\n| align=center | 46\n|- style=\"text-align:center;\"\n| colspan=\"2\"| 142\n| colspan=\"2\"| 124\n|-\n|}\nAftermath\nAfter the election the Prime Minister Vladimír Špidla called a vote of confidence, as the coalition had failed to elect the candidate they had backed. This showed that some legislators from the coalition must have voted for Klaus, however the government won a vote of confidence on the 11 March after all 101 government deputies voted in favour in the 200 member Chamber of Deputies, while the whole opposition voted against. Spidla then fired the minister of trade and industry, Jiri Rusnok, due to \"personal differences\", but Rusnok said he thought it was because he had backed Klaus in the presidential vote.\nKlaus was elected for second term in 2008 and left the office in 2013 when he wasn't eligible to reelection. He endorsed his former rival Miloš Zeman during 2013 presidential election. Zeman previously endorsed Klaus during 2008 presidential election.\nZeman's defeat is considered to have strong impact on Czech politics. It is stated that he distanced himself from ČSSD since the election. He later left the party and founded Party of Civic Rights (SPO). He became SPO's presidential candidate in 2013 presidential election and became first directly elected Czech president. His presidency is influenced by his conflicts with leadership of ČSSD.\nReferences"
    }
  ]
}