{
  "content": [
    {
      "type": "text",
      "text": "# 2004 German presidential election\n\nAn indirect presidential election (officially the 12th Federal Convention) was held in Germany on 23 May 2004.\nThe president of Germany (Bundespräsident) was the titular head of state of the Federal Republic of Germany. Germany is today often referred to as a \"chancellor democracy\", reflecting the role of the chancellor as the country's chief executive, and so consequently the president's tasks are mostly ceremonial, but for the signing of all new federal laws before they go into effect. In practice however, all presidents have had informal influence on politics and society but mostly in a non-partisan way.\nThe president is not elected directly by the voters but by a special Federal Convention (Bundesversammlung) which is assembled every five years for this task alone, the exception being if the federal president’s term of office ends prematurely. This body consists of the members of the Bundestag and an equal number of members selected by the sixteen federal state parliaments.\nThe election date was set for 23 May in Berlin, the anniversary of the adoption of the German constitution. Of the 1,206 members only 549 belonged to the parties that controlled the federal government - the Social Democrats (SPD) and the German Green Party. Also in their camp were the 31 members of the Party of Democratic Socialism (PDS). The opposition parties, the  (Christian Democratic Union/Christian Social Union (CDU/CSU) and Free Democratic Party (FDP)), however, had a majority of 624 members because they commanded more seats in the federal states. One member belonged to a regional party; one was non-aligned.\nParties nominate candidates for the position, although the outcome of the election is very predictable because the members of the convention normally vote with strict party loyalty. As the majority of the opposition was not overwhelming (624 of 604 needed), \"dissident\" members could cause a surprise.\nCDU/CSU and FDP nominated Horst Köhler, the head of the International Monetary Fund in Washington, D.C. Before that, he had been a senior official and was involved in negotiating both the German reunification treaty and the Maastricht Treaty on behalf of the German government. He is said to be rather modest but independently minded.\nSPD and Greens had nominated Gesine Schwan, the head of the Viadrina European University in Frankfurt (Oder). She is a political scientist who also has been active for a long time in politics for the SPD - but has not always been in line with the party.\nAll eight preceding presidents had been men. Once in office, the president can be re-elected only once. The previous president Johannes Rau (SPD) cited personal reasons for his decision not to run for a second term and died in 2006.\nKöhler won in the first voting round, receiving an immediate absolute majority of 604 (50.1%). Schwan won 589 votes, apparently attracting opposition voters.\n{| class=\"wikitable\"\n|- class=\"hintergrundfarbe5\"\n! width=\"25%\" | Round\n! width=\"30%\" | Candidate\n! width=\"15%\" | Votes\n! width=\"10%\" | %\n! width=\"20%\" | Party\n|-\n| rowspan=\"2\" | First round\n| Horst Köhler\n| 604\n| 50.1%\n| CDU/CSU, FDP\n|-\n| Gesine Schwan\n| 589\n| 48.9%\n| SPD, The Greens\n|}\nReferences"
    }
  ]
}