{
  "content": [
    {
      "type": "text",
      "text": "# 2005 Prince Edward Island electoral reform referendum\n\n| yes_text = Yes\n| yes = 11750\n| no_text = No\n| no = 20515\n| total = 32,265\n| electorate =\n| map =\n| mapdivision = riding\n| website =\n}}\nA referendum was held in the Canadian province of Prince Edward Island on November 28, 2005, to determine whether to adopt the Mixed Member Proportional (MMP) system [http://www.gov.pe.ca/photos/original/er_premier2003.pdf as recommended by the Prince Edward Island Electoral Reform Commission] in 2003.\nThe referendum failed, with \"Yes\" receiving only 36.42% of the popular vote.\nHowever, a subsequent nonbinding plebiscite in November 2016 resulted in a vote of 52.4% in favour of MMP vs. 42.5% for the First-past-the-post system. This was followed by a referendum pitting FPTP and MMP against each other in conjunction with the April 23, 2019 provincial election. The result of that referendum was 49% for MMP vs. 51% for FPTP, but neither side reached the threshold of a majority in 60% of the seats for the referendum to be binding.\nResults\nThe question asked was: ''Should Prince Edward Island change to the Mixed Member Proportional System as presented by the Commission of PEI's Electoral Future? ''\n{| class=\"wikitable\"\n!rowspan=\"2\" colspan=2|Option\n!colspan=\"2\" |Popular Vote\n!colspan=\"2\" |Districts carried\n|-\n!#\n!%\n!#\n!%\n|-\n!X\n|No\n|align=\"right\"|20,515\n|align=\"right\"|63.58%\n|align=\"right\"|25\n|align=\"right\"|92.59%\n|-\n|\n|Yes*\n|align=\"right\"|11,750\n|align=\"right\"|36.42%\n|align=\"right\"|2\n|align=\"right\"|7.41%\n|-\n!colspan=2|Total\n!align=\"right\"|32,265\n!align=\"right\"|100.0%\n!align=\"right\"|27\n!align=\"right\"|100.0%\n|}\nIn order to pass, the referendum had to receive 60% of the province-wide popular vote and a simple majority in 60% (16 of 27) of the electoral districts.\nAnalysis\nThe referendum was held in response to some extraordinarily lopsided results in PEI from the first-past-the post system - cases where the opposition was reduced to only one or two seats despite having a combined 45% share of the vote. The referendum failed to pass by a vote of 64% to 36% in favour of the status quo for a number of reasons, but for Jeannie Lea, the primary lesson to be learned appears to be the need for a referendum such as this to be done as a two-step process, in which the first step is to ask whether a change is considered desirable and the second step involves the choice of a specific model, as was done successfully in New Zealand under the 1992/93 referendum. Otherwise, a bias is created because some people will vote against the proposed because they would prefer something somewhat different.\nOn the other hand, in a 2018 referendum held in the Canadian province of British Columbia, which included a two step question, the voters rejected switching to proportional representation (PR) voting by a similar (61% to 39%) margin.\nReferences\nExternal links\n*[https://web.archive.org/web/20070707072815/http://www.electionspei.ca/plebiscites/pr/index.php Elections PEI]"
    }
  ]
}