{
  "content": [
    {
      "type": "text",
      "text": "# 2005 King George VI and Queen Elizabeth Stakes\n\nThe 2005 King George VI and Queen Elizabeth Stakes was a horse race held at Newbury Racecourse on Saturday 23 July 2005. It was the 55th King George VI and Queen Elizabeth Stakes. The race was run at Newbury as Ascot Racecourse, the event's traditional home, was being redeveloped. Whereas Ascot is a right-handed, triangular course with a short straight, Newbury is a wide, left-handed oval with a five furlong straight, giving the race a very different complexion.\nThe winner was the Aga Khan's Azamour, a four-year-old bay colt trained in Ireland by John Oxx and ridden by Mick Kinane. Azamour's victory was the second for Oxx after Alamshar in 2003 and the fifth for Kinane after Belmez (1990), King's Theatre (1994), Montjeu (2000) and Galileo (2001). The Aga Khan was winning the race for the third time after being successful with Shergar in 1981 and Alamshar.\nThe race\nThe race attracted a field of twelve runners from the United Kingdom, France and Ireland. The French-trained runners were Bago (horse), the winner of the 2004 Prix de l'Arc de Triomphe and the 33/1 outsider Policy Maker. The Irish challengers were the Aidan O'Brien-trained Ace, the  2004 Irish Derby winner Grey Swallow and the favourite Azamour. The last-named had won the St James's Palace Stakes and the Irish Champion Stakes in 2004 and the Prince of Wales's Stakes at York Racecourse in 2005. The Godolphin stable were represented by Doyen who had won the race in the previous year at Ascot. The British runners included the dual Coronation Cup winner Warrsan, the Epsom Oaks winner Eswarah and Phoenix Reach, the winner of the Hong Kong Vase and the Dubai Sheema Classic. Azamour headed the betting at odds of 5/2 ahead of Grey Swallow (100/30), Bago (5/1) and Ace (13/2).\nDoyen started quickly, but was soon overtaken by Gamut, who set a strong pace from Mubtaker and Ace, with Azamour restrained by his rider Mick Kinane in last place. Mubtaker took the lead with half a mile to run but was overtaken by Doyen three furlongs form the finish. Bago took the lead two furlongs out but Kinane produced Azamour with a strong run on the outside to take the lead approaching the final furlong. Azamour stayed on well in the closing stages to win by one and a quarter lengths from the outsider Norse Dancer who finished strongly to deprive Bago of second place by a head. Warrsan, Ace and Doyen filled the next three places.\nRace details\n* Sponsor: De Beers\n* Purse: £703,500; First prize: £408,030\n* Surface: Turf\n* Going: Good to Firm\n* Distance: 12 furlongs and 5 yards\n* Number of runners: 12\n* '''Winner's time: 2:28.26\nFull result\n{| class = \"sortable\" | border=\"1\" cellpadding=\"0\" style=\"border-collapse: collapse;\"\n|-  style=\"background:#7d7; text-align:center;\"\n! style=\"width:35px;\"| Pos.\n! style=\"width:45px;\"| Marg.\n! style=\"width:160px;\"| Horse (bred)\n! style=\"width:30px;\"| Age\n! style=\"width:160px;\"| Jockey\n! style=\"width:210px;\"| Trainer (Country)\n! style=\"width:50px;\"| Odds\n|-\n| 1\n|\n| Azamour (IRE)\n| 4\n| Mick Kinane\n| John Oxx (IRE)\n| 5/2 fav\n|-\n| 2'\n| 1¼\n| Norse Dancer (IRE)\n| 5\n| J. F. Egan\n| David Elsworth (GB)\n| 50/1\n|-\n| 3\n| shd\n| Bago (FR)\n| 4\n| Thierry Gillet\n| Jonathan Pease (FR)\n| 5/1\n|-\n| 4\n| 5\n| Warrsan (IRE)\n| 7\n| Seb Sanders\n| Clive Brittain (GB)\n| 66/1\n|-\n| 5\n| 2½''\n| Ace (IRE)\n| 4\n| Kieren Fallon\n| Aidan O'Brien (IRE)\n| 13/2\n|-\n| 6\n| hd\n| Doyen (FR)\n| 5\n| Kerrin McEvoy\n| Saeed bin Suroor (GB)\n| 16/1\n|-\n| 7\n| 3\n| Grey Swallow (IRE)\n| 4\n| Pat Smullen\n| Dermot Weld (IRE)\n| 100/30\n|-\n| 8\n| 6\n| Eswarah (GB)\n| 3\n| Richard Hills\n| Michael Jarvis (GB)\n| 9/1\n|-\n| 9\n| ¾\n| Gamut (IRE)\n| 6\n| Johnny Murtagh\n| Michael Stoute (GB)\n| 14/1\n|-\n| 10\n| nk\n| Phoenix Reach (IRE)\n| 5\n| Martin Dwyer\n| Andrew Balding (GB)\n| 20/1\n|-\n| 11\n| ½\n| Mubtaker (USA)\n| 8\n| Willie Supple\n| Marcus Tregoning (GB)\n| 40/1\n|-\n| 12\n| 3\n| Insurance policy Maker (IRE)\n| 5\n| Olivier Peslier\n| Élie Lellouche (FR)\n| 33/1\n|}\n* Abbreviations: nse = nose; nk = neck; shd = head; hd = head\nWinner's details\nFurther details of the winner, Azamour\n* Sex: Colt\n* Foaled: 8 March 2001\n* Country: Ireland\n* Sire: Night Shift; Dam: Asmara (Lear Fan)\n* Owner: Aga Khan IV\n* Breeder:  Aga Khan IV\nReferences"
    }
  ]
}