{
  "content": [
    {
      "type": "text",
      "text": "# 2005 United Kingdom general election in Northern Ireland\n\n| country =\n| type = parliamentary\n| ongoing = no\n| previous_election = 2001 United Kingdom general election in Northern Ireland\n| previous_year = 2001\n| previous_mps = List of MPs elected in the 2001 United Kingdom general election\n| next_election = 2010 United Kingdom general election in Northern Ireland\n| next_year = 2010\n| seats_for_election = All 18 Northern Irish seats to the House of Commons\n| elected_mps = List of MPs for constituencies in Northern Ireland (2005–2010)\n| election_date =\n| turnout = 62.5% (5.5%)\n| image1 =\n| leader1 = Ian Paisley\n| leader_since1 = 30 September 1971\n| leaders_seat1 = North Antrim\n| party1 = Democratic Unionist Party\n| popular_vote1 = 241,856\n| percentage1 = 33.7%\n| swing1 = 11.2%\n| last_election1 = 5 seats, 22.5%\n| seats_before1 =\n| seats1 = 9\n| seat_change1 = 4\n| image2 =\n| leader2 = Gerry Adams\n| leader_since2 = 13 November 1983\n| leaders_seat2 = Belfast West\n| party2 = Sinn Féin\n| last_election2 = 4 seats, 21.7%\n| seats_before2 =\n| seats2 = 5\n| seat_change2 = 1\n| popular_vote2 = 174,530\n| percentage2 = 24.3%\n| swing2 = 2.6%\n| image4 =\n| leader4 = Mark Durkan\n| leader_since4 = 2001\n| leaders_seat4 = Foyle\n| party4 = Social Democratic and Labour Party\n| last_election4 = 3 seats, 21.0%\n| seats_before4 =\n| seats4 = 3\n| seat_change4 = 0\n| popular_vote4 = 125,626\n| percentage4 = 17.5%\n| swing4 = 3.5%\n| image5 =\n| leader5 = David Trimble\n| leader_since5 = 28 August 1995\n| leaders_seat5 = Upper Bann (defeated)\n| party5 = Ulster Unionist Party\n| last_election5 = 6 seats, 26.8%\n| seats_before5 =\n| seats5 = 1\n| seat_change5 = 5\n| popular_vote5 = 127,414\n| percentage5 = 17.8%\n| swing5 = 9.0%\n| map_image = Northern Ireland Election Map 2005.jpg\n| map_size = 320px\n| map_caption = Colours on map indicate winning party for each constituency\n}}\nThe 2005 United Kingdom general election in Northern Ireland was held on 5 May 2005 and all 18 seats in Northern Ireland were contested. 1,139,993 people were eligible to vote, down 51,016 from the 2001 general election. 63.49% of eligible voters turned out, down 5.1 percentage points from the last general election.\nThe election resulted in the Ulster Unionist Party losing its place as the largest Northern Irish political party at Westminster, being replaced by the Democratic Unionist Party. Both the DUP and Sinn Féin increased their share of the vote as well as their number of seats. The Social Democratic and Labour Party were unable to regain its formerly held status as the largest nationalist political party in Northern Ireland, though they retained 3 seats overall, albeit with a reduced share of the vote.\nBoth John Hume and David Trimble, 1998 Nobel Peace Prize laureates for their roles in the Peace Process, did not remain MPs with Hume standing down in Foyle and Trimble losing his Upper Bann seat. The UUP's dismal electoral performance led to Trimble's resignation as leader.\nBackground\nNorthern Ireland has a distinct regional political scene compared to the rest of the United Kingdom. The major mainland UK political entities maintain a nominal presence in the country and local parties campaign to represent Northern Irish issues. Politics is mainly split on unionist and nationalist divides, with those wanting to remain part of the United Kingdom on one side and those wanting to unite with the Republic of Ireland on the other. Cross community parties exist, but have not gained as much political support.\nFollowing the previous general election in 2001 and the 2003 Assembly elections, both moderate unionist and nationalist parties continued to lose support as the electorate turned towards the DUP and Sinn Féin. Policing and the fallout from Stormontgate dominated the election campaign. The devolved government in Northern Ireland was suspended in October 2002 after an alleged Provisional IRA spy ring was uncovered at Stormont. Policing in Northern Ireland was a sensitive topic for nationalists, who associated the Royal Ulster Constabulary with the unionist community for their actions during the Troubles. In November 2001, the Police Service of Northern Ireland was established to replace the RUC. Done as an attempt to reform policing, it was viewed with skepticism by Sinn Féin.\nThe UUP continued its decline under Trimble's leadership. After a poor showing at the 2001 elections, following the signing of the Good Friday Agreement, the party experienced more defections to the DUP in the run up to the 2005 elections. At the start of 2004 Lagan Valley MP, Jeffrey Donaldson, along with assembly members Norah Beare and Arlene Foster announced that they had left the UUP and joined the DUP. Many were disillusioned by the concessions made in the 1998 agreement and supported the DUP's harder line against nationalist demands. Stormontgate, along with the Northern Bank robbery in December 2004 and murder of Robert McCartney the following month, reaffirmed to unionists that the IRA were still active and, by association, planted further distrust in Sinn Féin. Towards the end of January, veteran UUP MP Martin Smyth announced that he would not be contesting his South Belfast seat in order to spend more time with his ailing wife. In March 2005, the Orange Order formally separated its ties with the UUP, ending a 100-year association with the party.\nIn the early 2000s, the SDLP went through a period of political upheaval, when long term leader John Hume and his deputy Seamus Mallon began their gradual withdrawal from politics. Having stepped down from his assembly post towards the end of 2000, Hume resigned the party leadership due to ill health less than a year later and was replaced by his former Foyle MLA colleague, Mark Durkan. Hume did not defend his MEP seat in 2004 and also announced that he was standing down as MP for Foyle. Similarly, Mallon resigned his Newry and Armagh assembly post in 2003 and chose not to contest his Westminster seat in 2005.\nSinn Féin maintained its policy of abstentionism at Westminster in 2005; refusing to recognise the legitimacy of British government in Ireland.\nElection constituencies\nNorthern Ireland returned eighteen Members of Parliament to House of Commons, one for each of its 18 parliamentary constituencies.\nResults\nThe DUP won the most out of the 2005 parliamentary elections, taking four seats from the UUP to become the largest Northern Irish political party at Westminster. Sinn Féin managed to take Newry and Armagh from the SDLP, though the SDLP did gain South Belfast from the UUP.\nUnionist\nThe UUP lost all but one of their previously held seats. UUP leader, David Trimble was unseated in Upper Bann by David Simpson of the DUP, despite declaring that his party would not lose any seats. Sylvia Hermon managed to retain her seat in North Down for the UUP. The loss led to Trimble standing down as UUP leader.\nThe DUP was the major beneficiary of the UUP's demise. Along with Simpson's seat, the DUP took East Antrim, Lagan Valley and South Antrim. Sammy Wilson defeated incumbent Roy Beggs in East Antrim. Jeffrey Donaldson kept the seat he previously won for the UUP in Lagan Valley. William McCrea unseated his 2001 general election opponent David Burnside in South Antrim. DUP leader, Ian Paisley kept his long held seat in North Antrim, as did DUP deputy leader Peter Robinson in East Belfast. His wife, Iris kept her Strangford seat she won in 2001. Both Nigel Dodds and Gregory Campbell retained their seats in North Belfast and East Londonderry respectively.\nNationalist\nThe SDLP maintained three seats at Westminster. SDLP leader, Mark Durkan regained his party's seat in Foyle and Eddie McGrady kept his South Down seat. Alasdair McDonnell took South Belfast after a split in the unionist vote, following Martin Smyth's decision to stand down.\nSinn Féin bettered its 2001 total by taking Newry and Armagh. Sinn Féin leader, Gerry Adams successfully defended his seat in West Belfast, as did Martin McGuinness in Mid Ulster. Michelle Gildernew strengthened her mandate in Fermanagh and South Tyrone, the seat she won in 2001 by just 53 votes. Pat Doherty also retained the West Tyrone seat he won in the same election. Conor Murphy won in Newry and Armagh after Seamus Mallon's departure.\nFull results\n{| class=\"wikitable sortable\" style=\"text-align:right; font-size:95%;\"\n|+\n! colspan=\"2\" rowspan=\"2\" |Party\n! colspan=\"5\" |Seats\n! colspan=\"3\" |Aggregate Votes\n|-\n! Total !! Gains !! Losses\n!Net +/-\n!Of all (%)\n!Total\n!Of all (%)\n!Difference\n|-\n|\n| 9 || 4 || 0 || 4 || 50.0 || 241,856 || 33.7 || 11.2\n|-\n|\n| 5 || 1 || 0 || 1 || 27.8 || 174,530 || 24.3 || 2.6\n|-\n|\n| 1 || 0 || 5 || 5 || 5.6 || 127,414 || 17.8 || 9.0\n|-\n|\n| 3 || 1 || 1 ||  || 16.7 || 125,626 || 17.5 || 3.5\n|-\n|\n| 0 || 0 || 0 ||  || 0.0 || 28,291 || 3.9 || 0.3\n|-\n|\n| 0 || 0 || 0 ||  || 0.0 || 2,718 || 0.4 || 0.1\n|-\n|\n| 0 || 0 || 0 ||  || 0.0 || 1,669 || 0.2 ||0.1\n|-\n|\n| 0 || 0 || 0 ||  || 0.0 || 1,649 || 0.2 || New\n|-\n|\n| 0 || 0 || 0 ||  || 0.0 || 890 || 0.1 ||\n|-\n|style=\"background:silver;\" | &nbsp;\n| align=left| Others\n| 0 || 0 || 0 ||  || 0.0 || 12,959 || 1.9 || 1.1\n|- class=\"sortbottom\"\n! colspan=\"2\" style=\"background:#f2f2f2\" | Total\n|style=\"background:#f2f2f2;\" | 18\n|style=\"background:#f2f2f2;\" |\n|style=\"background:#f2f2f2;\" |\n|style=\"background:#f2f2f2;\" |\n|style=\"background:#f2f2f2;\" |\n|style=\"background:#f2f2f2;\" | 717,602\n|style=\"background:#f2f2f2;\" | 62.5\n|style=\"background:#f2f2f2;\" | 5.5\n|}\nReferences"
    }
  ]
}