{
  "content": [
    {
      "type": "text",
      "text": "# 2006 Transnistrian presidential election\n\nPresidential elections were held in Transnistria on 10 December 2006. Incumbent President Igor Smirnov won despite opposition having stiffened during the final weeks of the campaign. Three candidates registered to run besides the incumbent Smirnov: Bender MP for Obnovlenie (Renewal) Peter Tomaily, Transnistrian Communist Party candidate Nadezhda Bondarenko and journalist Andrey Safonov.\nBackground\nAndrey Safonov's candidacy was at first rejected on the basis of insufficient and allegedly fraudulent signatures, but on 30 November the Tiraspol law court accepted it.\nDespite the court ruling, at the Electoral Commission meeting on 27 November Safonov's registration was not accepted with some members claiming that the court decision needed to be challenged at a higher instance. The Commission finally allowed the candidacy on 5 December.\nStarting with 7 December, early voting was allowed for those persons for whom it was impossible to come to the polls on 10 December.\nConduct\nAndrey Safonov, one of the opposition candidates, suggested that election results were rigged in favour of the incumbent leader. He claimed that there was a strange difference between the exit polls results and the official results. According to an article by the ethnic Russian researcher from Moldova Alla Skvortsova, \"polls and elections in the PMR may to some extent have been rigged\". Moreover, according to the 2004 Transnistrian census, only 90% of the population of Transnistria had Transnistrian citizenship.\nResults\n}}\nReferences\nExternal links\n*[http://news.bbc.co.uk/2/hi/europe/6218786.stm BBC coverage]\n*[https://web.archive.org/web/20061216151942/http://www.olvia.idknet.com/vibori.htm Official news coverage] (Russian)\n*[http://www.iht.com/articles/ap/2006/12/10/europe/EU_GEN_Moldova_Trans_Dniester_Separatists.php International Herald Tribune 10 December 2006]\n*[http://www.tiraspoltimes.com/node/430 No surprise: Smirnov wins re-election by wide margin in Transdniester]\n*"
    }
  ]
}