{
  "content": [
    {
      "type": "text",
      "text": "# 2006 Hawaii Warriors football team\n\nThe 2006 Hawaii Warriors football team represented the University of Hawaii at Manoa in the 2006 NCAA Division I FBS football season. The Warriors tied the school record for most victories in a season with 11, with their only losses coming against Alabama in Tuscaloosa, an undefeated Boise State team that went on to participate in the Bowl Championship Series and Oregon State, which won ten games and finished the season nationally ranked. The Warriors finished in second place in the Western Athletic Conference behind Boise State and returned to the Hawaii Bowl after missing out on postseason play in 2005 due to a losing record. The Warriors defeated the Arizona State Sun Devils in the bowl game by a score of 41–24 to round out one of the school's most successful football seasons ever.\nJunior quarterback Colt Brennan returned from a breakout 2005 campaign to put together statistically one of the best seasons of any quarterback in college football history. Brennan would end up setting NCAA single-season records for touchdown passes in a season (58) and passing efficiency rating (185.96) on his way to a sixth-place finish in the Heisman Trophy voting, WAC Offensive Player of the Year honors and numerous All-America honors as well. Head coach June Jones would go on to be named WAC Coach of the Year and the Warriors would place nine players on the All-WAC first team as a result of the team's outstanding play throughout the season.\nPreseason\nThe Warriors were picked to finish fourth in the WAC by both the Preseason Media Poll and the Preseason Coaches Poll behind Nevada, Fresno State and Boise State.\nColt Brennan was voted the WAC's Preseason Offensive Player of the Year after a breakout 2005 campaign that saw him set 11 Hawaii offensive records and lead the nation in passing yards (4,301 yards) and total yards (371.2 YPG.)\nPre-season award watchlists\nColt Brennan\n* Maxwell Award watch list\n* Walter Camp Award watch list\n* Manning Award watch list\n* Davey O'Brien Award watch list\n* WAC Preseason Offensive Player of the Year\nSamson Satele\n* Rimington Trophy watch list\n* Outland Trophy watch list\nIkaika Alama-Francis\n* Ted Hendricks Award watch list\nMid-season award semifinalist announcements\nColt Brennan\n* Walter Camp Award \"Ten Players to Watch\"\n* Davey O'Brien Award\n* Manning Award\nMid-season award finalist announcements\nColt Brennan\n* Walter Camp Award\n* Davey O'Brien Award\n* Manning Award\nSchedule\n|\n|\n|\n}}\n|\n|\n|\n|\n|\n|\n|\n|\n|\n|\n}}\nPersonnel\nDepth chart – offense\n* Offensive Scheme: run and shoot\n{| class=\"wikitable\"\n|-\n! Position\n! Number\n! Name\n! Class\n|-\n| QB\n| 15\n| Colt Brennan\n| Jr.\n|-\n| RB\n| 4\n| Nate Ilaoa\n| Sr.\n|-\n| SB\n| 1\n| Ryan Grice-Mullen\n| So.\n|-\n| WR\n| 84\n| Jason Rivers\n| Jr.\n|-\n| WR\n| 3\n| Ross Dickerson\n| Sr.\n|-\n| SB\n| 7\n| Davone Bess\n| So.\n|-\n| LT\n| 70\n| Tala Esera\n| Sr.\n|-\n| LG\n| 65\n| Hercules Satele\n| Jr.\n|-\n| C\n| 64\n| Samson Satele\n| Sr.\n|-\n| RG\n| 55\n| John Estes\n| Fr.\n|-\n| RT\n| 72\n| Dane Uperesa\n| Sr.\n|}\nDepth chart – defense\n* Base Defense: 3–4\n{| class=\"wikitable\"\n|-\n! Position\n! Number\n! Name\n! Class\n|-\n| DE\n| 98\n| Melila Purcell III\n| Sr.\n|-\n| NT\n| 67\n| Michael Lafaele\n| Jr.\n|-\n| DE\n| 91\n| Ikaika Alama-Francis\n| Sr.\n|-\n| OLB\n| 26\n| Micah Lau\n| Jr.\n|-\n| ILB\n| 41\n| Solomon Elimimian\n| So.\n|-\n| ILB\n| 44\n| Adam Leonard\n| So.\n|-\n| OLB\n| 8\n| Tyson Kafentzis\n| So.\n|-\n| CB\n| 23\n| Gerard Lewis\n| Jr.\n|-\n| SS\n| 31\n| Jacob Patek\n| Jr.\n|-\n| FS\n| 42\n| Leonard Peters\n| Sr.\n|-\n| CB\n| 38\n| Myron Newberry\n| Jr.\n|}\nDepth chart – special teams\n{| class=\"wikitable\"\n|-\n! Position\n! Number\n! Name\n! Class\n|-\n| FGS\n| 86\n| Dan Kelly\n| So.\n|-\n| PATS\n| 40\n| Briton Forester\n| Fr.\n|-\n| P\n| 25\n| Kurt Milne\n| Sr.\n|-\n| KR\n| 82\n| Ross Dickerson\n| Sr.\n|-\n| PR\n| 38\n| Myron Newberry\n| Jr.\n|-\n| KOS\n| 84\n| Dan Kelly\n| So.\n|}\nRoster\n{| class=\"toccolours\" style=\"border-collapse: collapse; font-size:90%;\"\n|-\n| colspan=\"7\" style=\"text-align:center;\"|[https://web.archive.org/web/20021223213537/http://www.mgoblue.com/roster.cfm?section_id=258&top=2&level=3 (as of 10/4/2006)]\n|-\n|valign=\"top\"|\nQuarterbacks\n* &nbsp;6 Tyler Graunke –  Sophomore\n* 11 Inoke Funaki –  Freshman\n* 12 William Brogan – Freshman\n* 15 Colt Brennan –  Junior\nRunning backs\n* &nbsp;4 Nate Ilaoa –  Senior\n* 19 Jayson Rego –  Freshman\n* 21 Jazen Anderson – Junior\n* 23 Alonzo Chopp – Junior\n* 27  Khevin Peoples –  Sophomore\n* 34 Reagan Mauia –  Senior\n* 37 Josh Berry – Freshman\n* 39 Siave Seti –  Junior\n* 44 Gabriel Weisbarth – Freshman\n* 45 Jason Laumoli – Senior\n* 48 David Farmer –  Sophomore\n* 99 Hammy Vasconcelos –  Freshman\nWide receivers\n* &nbsp;1 Ryan Grice-Mullen –  Sophomore\n* &nbsp;2 Jason Ferguson –  Sophomore\n* &nbsp;3 Ian Sample –  Senior\n* &nbsp;5 Michael Washington – Sophomore\n* &nbsp;7 Davone Bess – Sophomore\n* &nbsp;9 Rick Taylor – Freshman\n* 36 Greg Salas – Freshman\n* 80 Antwan Mahaley –  Freshman\n* 81 Dylan Linkner –  Sophomore\n* 82 Ross Dickerson –  Senior\n* 83 Mitch Farney – Freshman\n* 84 Jason Rivers – Junior\n* 85 Aaron Bain – Sophomore\n* 87 Marquez Jackson –  Freshman\n* 88 Chad Mock –  Senior\n* 89 Malcolm Lane – Freshman\n|width=\"25\"|&nbsp;\n|valign=\"top\"|\nOffensive line\n* 50 Laupepa Letuli –  Freshman\n* 51 Clarence Tuioti-Mariner –  Sophomore\n* 55 John Estes –  Freshman\n* 56 Kavan Bannigan – Junior\n* 58 Joey Lipp – Freshman\n* 60 Marques Kaonohi –  Senior\n* 62 Keith Ah-Soon –  Sophomore\n* 63 Brysen Ginlack – Freshman\n* 64 Samson Satele –  Senior\n* 65 Hercules Satele –  Junior\n* 66 Adrian Thomas – Freshman\n* 69 Daniel Johnson –  Freshman\n* 70 Tala Esera –  Senior\n* 72 Dane Uperesa –  Senior\n* 73 Larry Sauafea –  Junior\n* 74 Raphael Ieru –  Freshman\n* 76 Nathan McKay –  Sophomore\n* 77 Aaron Kia –  Freshman\n* 78 Keoni Steinhoff –  Sophomore\n* 79 Cameron Allen-Jones – Sophomore\nDefensive line\n* 50 Laupepa Letuli –  Freshman\n* 54 Amani Purcell – Junior\n* 56 Nathan Russell – Sophomore\n* 57 Jake Ingram – Sophomore\n* 67 Michael Lafaele –  Junior\n* 68 Kahai La Count –  Senior\n* 77 Matthew R Gerhardt – Junior\n* 90 Elliott Purcell – Freshman\n* 91 Ikaika Alama-Francis – Senior\n* 92 Rocky Savaiigaea –  Freshman\n* 93 Keala Watson – Sophomore\n* 94 David Veikune – Junior\n* 96 Fale Laeli –  Sophomore\n* 97 Renolds Fruean –  Senior\n* 98 Melila Purcell III – Senior\n* 99 Lawrence Wilson – Senior\n|width=\"25\"|&nbsp;\n|valign=\"top\"|\nLinebackers\n* &nbsp;8  Tyson Kafentzis –  Sophomore\n* 10 Timo Paepule –  Junior\n* 11 Victor Fergerstrom – Senior\n* 12 Karl Noa –  Junior\n* 13 Brashton Satele –  Freshman\n* 26 Micah Lau – Junior\n* 33&nbsp;C.J. Allen-Jones –  Sophomore\n* 39 Waikaloa Noa – Junior\n* 41 Solomon Elimimian – Sophomore\n* 43 Brad Kalilimoku – Junior\n* 44 Adam Leonard – Sophomore\n* 47 Joshua Rice –  Freshman\n* 49 Jared Lene – Freshman\n* 51 Victor Clore – Freshman\n* 52 Rustin Saole –  Junior\n* 53 Blaze Soares –  Freshman\n* 59 R.J. Kiesel-Kauhane –  Freshman\n* 95 Sebastian Siaki – Freshman\nDefensive backs\n* &nbsp;9 Ryan Keomaka – Junior\n* 14 Kirk Alexander Jr. – Sophomore\n* 15 Josh Aufai –  Freshman\n* 16 JoPierre Davis – Freshman\n* 17 Desmond Thomas – Sophomore\n* 18 Guyton Galdeira –  Sophomore\n* 19&nbsp;C.J. Hawthorne – Junior\n* 20 Michael Malala –  Senior\n* 23 Gerard Lewis – Junior\n* 24 Kenny Patton – Senior\n* 25 Ryan Perry – Junior\n* 28 Erik Pedersen –  Freshman\n* 29 Keenan Jones – Junior\n* 30 Dane Porlas –  Sophomore\n* 31 Jacob Patek – Junior\n* 34 A.J. Martinez –  Junior\n* 35 Keao Monteilh –  Junior\n* 38 Myron Newberry – Junior\n* 42 Leonard Peters – Senior\n* 45 Spencer Smith – Freshman\n|width=\"25\"|&nbsp;\n|valign=\"top\"|\nPunters\n* 25 Kurt Milne –  Senior\nKickers\n* 86 Dan Kelly – Sophomore\nLong snappers\n* 48 David Farmer –  Sophomore\n* 57 Jake Ingram – Sophomore\nHolders\n* 11 Inoke Funaki –  Freshman\n* 25 Kurt Milne –  Senior\n|}\nCoaching staff\n{| class=\"wikitable\"\n|-\n! Name !! Position !! Yearsat UH || Alma mater (year)\n|- style=\"text-align:center;\"\n| June Jones || Head Coach || 8 || New York State Regents College\n|- style=\"text-align:center;\"\n| George Lumpkin || Associate head coachOutside linebackers || 34 || University of Hawaii at Manoa (1972)\n|- style=\"text-align:center;\"\n| Dan Morrison || Quarterbacks || 8 || University of California, Los Angeles (1971)\n|- style=\"text-align:center;\"\n| Wes Suan || Offensive line || 8 || Linfield College (1975)\n|- style=\"text-align:center;\"\n| Rich Miano || Secondary || 8 || University of Hawaii at Manoa (1987)\n|- style=\"text-align:center;\"\n| Ron Lee || Wide receivers || 9 || Willamette University (1967)\n|- style=\"text-align:center;\"\n| Cal Lee || Linebackers || 4 || Willamette University (1970)\n|- style=\"text-align:center;\"\n| Mel deLaura || Strength coach || 8 || Portland State University\n|- style=\"text-align:center;\"\n| Jerry Glanville || Defensive coordinator || 2 || Northern Michigan University (1964)\n|- style=\"text-align:center;\"\n| Mouse Davis || Special teamsRunning backs || 3 || Western Oregon University (1955)\n|- style=\"text-align:center;\"\n| Jeff Reinebold || Special teamsDefensive line || 2 || Indiana University Bloomington (1981)\n|}\nGame summaries\nAlabama\nJohn Parker Wilson threw for 253 yards and a touchdown in his first collegiate start as Alabama got a late defensive stand to hold off Hawaii 25–17.\nLeigh Tiffin added three field goals for the Crimson Tide, which had two apparent touchdowns overturned on replay challenges by Hawaii.\nWilson started slowly, completing only four of 10 passes for 80 yards in the first half. Looking more comfortable after halftime, he was 12-of-19 attempts for 173 yards and a 35-yard touchdown pass to Keith Brown.\nDown by a touchdown and 2-point conversion late in the fourth quarter, Hawaii drove the ball to the Alabama 26 with 13&nbsp;seconds left. On fourth down with 1&nbsp;second remaining, Colt Brennan lofted a pass to the goal line, where the Tide's Lionel Mitchell jumped for an interception to preserve the win.\nIn June 2009 Alabama was forced to vacate this win along with 20 others occurring from 2005 to 2007 after violating NCAA regulations.\n* Weekly accolades: None\nUNLV\nColt Brennan threw for 296 yards and two touchdowns while running in another score as Hawaii defeated UNLV 42–13.\nDavone Bess caught 10 passes for 124 yards and a touchdown and Nate Ilaoa ran for 104 yards and two scores for the Warriors (1–1), who racked up 583 yards of total offense, including 359 in the first half.\nThe Warriors raced to a 42–0 lead behind Brennan's hot hand. He was 24-of-35 before coming out of the game, along with the rest of Hawaii's offensive starters, late in the third quarter.\nThe loss was UNLV's 11th straight on the road. The Rebels haven't won an away game since beating Brigham Young 24–20 on Oct. 8, 2004.\n* Weekly accolades: WAC Offensive Player of the Week: Nate Ilaoa, RB\nBoise State\nJared Zabransky threw for 273 yards and three touchdowns and Ian Johnson ran for 178 yards and two scores as Boise State defeated Hawaii 41–34.\nThe Broncos (4–0) won the Western Athletic Conference opener for both teams for their 48th win in their 50 games on their home blue turf.\nHawaii (1–2) trailed by 18 points in the second quarter, but closed to 34–27 early in the fourth on Colt Brennan's 14-yard pass to Davone Bess on fourth down. After Hawaii botched an extra point try in the second quarter, Orlando Scandrick came up with the ball in the ensuing scramble and went 88 yards for a two-point defensive conversion, repeating a feat he accomplished last season at Hawaii that gave the Broncos the final margin in that wild 44–41 win.\nBrennan completed 25 of 36 passes for 388 yards and five touchdowns and an interception. But he also fumbled as Hawaii was driving in the fourth quarter for the tie, and Boise State's Gerald Alexander recovered.\nHad Hawaii not had so many miscues in the kicking game, Hawaii would have had the opportunity to win the game.\nBoise State had 515 total offensive yards to Hawaii's 476. Boise had 308 yards of offense in the first half, 150 rushing and 158 passing. Hawaii had 267 total yards in the first half, 232 on passing.\n* Weekly accolades: None\nEastern Illinois\n* Previous meeting: Hawaii 61, Eastern Illinois 36 (2002)\nColt Brennan threw for 409 yards and five first-half touchdowns as Hawaii coasted past Division I-Championship Subdivision (formerly known as I-AA) Eastern Illinois 44–9.\nThe Warriors (2–2) aired it out against the Panthers (2–3), scoring early and often. Hawaii attempted 38 passes and called just one run play in the first half, while jumping out a 34–9 lead. Brennan passed for 369 yards in the one-sided half and led the Warriors to a 32-point lead before being taken out midway through the third quarter.\nBefore a sparse crowd of 22,480, the Warriors put up 571 yards of offense compared with the Panthers' 291.\nThe Panthers were playing their second Bowl Subdivision opponent this season. They lost at Illinois 42–17 on Sept. 2.\n* Weekly accolades: None\nNevada\nColt Brennan threw four first-half touchdown passes and ran for another score as Hawaii held on to a 41–34 victory over Nevada.\nNate Ilaoa carried 14 times for 151 yards and caught eight passes for 68 yards as the Warriors (3–2, 1–1 Western Athletic Conference) snapped the Wolf Pack's three-game winning streak.\nBrennan's 7-yard run in the fourth quarter put Hawaii up 41–21 and helped seal the win. He finished the night 36-of-47 for 419 yards, moving into second place on Hawaii's career passing list.\nHawaii took control in the first half with its offense and relied on its defense to hold off a late rally by Nevada (3–3, 0–2) on a muggy, windless night at Aloha Stadium.\n* Weekly accolades: WAC Offensive Player of the Week: Colt Brennan, QB\nFresno State\nColt Brennan picked apart Fresno State's defense, throwing for 409 yards, and matched a season-high five touchdowns in Hawaii's 68–37 victory over the Bulldogs.\nHawaii (4–2, 2–1 Western Athletic Conference) picked up its first win over Fresno State (1–5, 1–2) in three years. Two seasons ago, Fresno State rolled to a 70–14 victory over Hawaii at Bulldog Stadium.\nHawaii's defense stepped up in the first quarter forcing two fumbles that later resulted in touchdowns. Ikaika Alama-Francis recovered Dwayne Wright's fumble at the Bulldogs 24. Four plays later, Nate Illaoa scored his second TD on a 5-yarder.\nFresno State's only lead came in the first quarter when Tom Brandstater hit Bear Pascoe for a 75-yard touchdown pass. Sean Norton, who took over for Tom Brandstater in the second quarter, was 14-of-24 for 225 yards and three touchdowns.\n* Weekly accolades: WAC Offensive Player of the Week: Colt Brennan, QB\nNew Mexico State\nColt Brennan threw for five touchdowns and 330 yards and Hawaii never had to punt in a 49–30 win over New Mexico State.\nBrennan, who came into the game second in the country in total offense behind New Mexico State's Chase Holbrook, methodically picked apart the porous Aggies defense. He completed 22 of 31 passes, with no interceptions.\nHawaii (5–2, 3–1 WAC) took control early in handing New Mexico State (2–5, 0–3 WAC) its 18th straight loss to a Division I-A opponent.\nBrennan completed his first nine passes, including a 34-yard TD pass to wide receiver Ross Dickerson that gave the Warriors a 14–0 lead with 2:09 left in the first quarter. Dickerson also caught a 36-yard scoring pass. Brennan's other touchdown passes were to Davone Bess for 16 yards, 9 yards to Ian Sample and 13 yards to Jason Rivers.\n* Weekly accolades: WAC Defensive Player of the Week: Melila Purcell, DE & WAC Special Teams Player of the Week: Ross Dickerson, WR\nIdaho\nColt Brennan threw for 333 yards and five touchdowns and Ross Dickerson returned the opening kickoff 100 yards for a touchdown as Hawaii rolled to a 68–10 win over Idaho.\nThe victory was Hawaii's fifth straight and gave the Warriors (6–2, 4–1 Western Athletic Conference) sole possession of second place in the WAC standings behind No. 15 Boise State, which had a bye.\nThe Warriors, ranked No. 1 in the nation in total offense and No. 2 in scoring, had their way behind Brennan's sharp passing.\nHe was 31-of-38 and picked apart Idaho's defense before he was replaced in the third quarter with a 38-point lead. Brennan also rushed five times for 63 yards.\nBrennan had scoring passes of 10, 2, 18, 34 and 11 yards to five different players to push his NCAA-leading TD passes to 33. He has passed for 1,920 yards and 24 TDs with just one interception during Hawaii's winning streak.\nThe Warriors scored just eight seconds into the game on Dickerson's 100-yard kickoff return. Dickerson, who had a 100-yard return against Appalachian State in 2003, caught the ball at the goal line, followed a wall of blockers and sprinted untouched down the left sideline.\nHawaii punted just once, late in the game. It was the Warriors' first punt in two games.\nIdaho (4–5, 3–2) came into the game tied with Hawaii for second in the WAC and couldn't get much going against Hawaii's aggressive defense.\n* Weekly accolades: WAC Special Teams Player of the Week: Ross Dickerson, WR\nUtah State\nColt Brennan threw for 413 yards and six touchdowns while setting two school records as Hawaii beat Utah State 63–10.\nBrennan's six touchdown passes gives him 39 for the year, the most in a single season. Timmy Chang held the previous mark of 38 set in 2004.\nBrennan also set a record for the most pass attempts without an interception. Before being intercepted by Utah State safety Terrance Washington in the third quarter, Brennan had thrown 182 times without an interception.\nChang held the previous record of 178, which was also set in 2004.\nRunning back Nate Ilaoa caught two of Brennan's touchdown passes and rushed for another score for Hawaii (7–2, 5–1 Western Athletic Conference), which has won seven straight.\nIlaoa caught six passes for 155 yards and Ryan Grice-Mullen had four catches for 135 yards and two touchdowns.\nKevin Robinson caught five passes for 84 yards for Utah State (1–8, 1–4), which had four turnovers.\nAfter the game, Hawaii accepted an invitation to the Sheraton Hawaii Bowl, making the Warriors the first team to receive and accept a bowl invitation in 2006.\n* Weekly accolades: WAC Offensive Player of the Week, USA TODAY Player of the Week & Walter Camp National Offensive Player of the Week: Colt Brennan, QB\nLouisiana Tech\nColt Brennan threw for 406 yards and four touchdowns and ran for 60 yards and another score as Hawaii scored 52 straight points and beat Louisiana Tech 61–17.\nThe victory was Hawaii's seventh straight and kept the Warriors (8–2, 6–1 Western Athletic Conference) in second place in the WAC behind No. 14 Boise State.\nThe Warriors fell behind 10–9 before their wide-open offense got going in the second quarter against the Bulldogs (3–7, 1–4)\nThe surging Hawaii Bowl-bound Warriors entered the game ranked No. 1 in the nation in total offense (534 yards a game), passing (429) and scoring (47.3).\nBrennan was 27-of-40 and threw TD passes of 18, 13, 19 and 3 yards to four different players before sitting out the final quarter with the game in hand.\nHe now has 43 touchdown passes for the season and needs just 11 TD passes to tie the NCAA record of 54 set by Houston's David Klingler in 1990. He has four games left in the season, including the Hawaii Bowl.\nThe Warriors were without starting running back Nate Ilaoa who has a sprained ankle. But 300-pound Reagan Mauia filled in nicely with six carries for 52 yards and two touchdowns.\n* Weekly accolades: None\nSan Jose State\nColt Brennan passed for 402 yards and five touchdowns as Hawaii rolled to its eighth straight victory by beating San Jose State 54–17\nNate Ilaoa had 100 yards rushing and 66 yards receiving for the Warriors (9–2, 7–1 Western Athletic Conference) who kept alive their hopes for a WAC title. Hawaii needs No. 13 Boise State to lose next week to Nevada for a share of the conference championship.\nHawaii racked up 568 yards of offense while holding San Jose State to 192.\nThe Spartans (6–4, 3–3) kept it competitive until the Brennan broke the game open in the second half with four straight touchdown passes.\nBrennan, who also had a rushing touchdown, completed 28-of-39 passes. He now has 48 TD passes this season and is six shy of tying the NCAA season mark of 54 held by Houston's David Klingler in 1990.\n* Weekly accolades: WAC Defensive Player of the Week: Melila Purcell, DE\nPurdue\nColt Brennan threw three fourth-quarter touchdowns, including the game-winning 23-yarder to Ian Sample with 1:27 left, and No. 25 Hawaii rallied to beat Purdue 42–35.\nThe win was the ninth straight for the Warriors (10–2), a school record for a single season. It was also the 63rd for Hawaii coach June Jones, which ties him with Dick Tomey as the second winningest coach in school history.\nBrennan finished 33-of-48 for 434 yards with TD passes of 14, 5, and 23 yards in the final quarter. He is now just three TD passes shy of tying former Houston quarterback David Klingler's NCAA single-season touchdown mark of 54 set in 1990.\nThe Warriors have won by an average margin of 35.5 points in the previous eight games, but had all it could handle against the Boilermakers.\nNate Ilaoa rushed 12 times for 159 yards and two first-half touchdowns for the Hawaii-bowl bound Warriors. He also had two costly fumbles that led to 14 points for Purdue (8–5).\nPurdue, headed to the Dec. 29 Champs Sports Bowl, concluded the regular season against an opponent other than Indiana for the second time since 1919. The Boilermakers finished their 2001 season against Notre Dame.\nHawaii finished second in the Western Athletic Conference with No. 12 Boise State's 38–7 victory over Nevada earlier in the day.\n* Weekly accolades: None\nOregon State\nMatt Moore passed for three touchdowns and Sabby Piscitelli had two interceptions as Oregon State upset No. 24 Hawaii 35–32.\nThe Beavers (9–4) snapped the Warriors' winning streak at nine and became the first team to beat Hawaii (10–3) since Boise State on Sept. 23.\nMoore was 11-of-17 for 245 yards and outshone Brennan, who finished one touchdown pass shy of tying the NCAA single-season mark of 54 set by Houston's David Klingler in 1990. Brennan still has the Hawaii Bowl for another shot at the record.\nBrennan finished 37-of-50 for 401 yards and two TDs but his pass attempt on fourth-and-14 from Oregon State's 26 fell short and so did Hawaii's comeback.\nThe loss was the first at Aloha Stadium this season.\nThe Warriors will play another Pac-10 opponent, Arizona State, in the Dec. 24 Hawaii Bowl. The Beavers play in the Sun Bowl Dec. 29 against Missouri.\n* Weekly accolades: None\nArizona State—Hawaii Bowl\nColt Brennan broke the NCAA single-season record for touchdown passes with 58, throwing five in the second half to lead Hawaii to a 41–24 victory over Arizona State in the Hawaii Bowl.\nBrennan, 33-of-42 for 559 yards, threw a 7-yard scoring pass to Ryan Grice-Mullen on the Warriors' second series of the second half to break the previous mark of 54 set by Houston's David Klingler in 1990, also against the Sun Devils.\nBrennan tied the record with his 54th TD pass on the previous series, throwing a 38-yard scoring pass to Jason Rivers.\nBrennan and Rivers, selected the co-MVPs for Hawaii, also teamed on the final touchdown pass, a 79-yarder late in the fourth quarter. Rivers finished the game with 308 yards on 14 catches, the most in a college bowl game since 1937, which is as far as the record books go back.\nBrennan also set the WAC single-season record for most passing yards (5,549), which was previously held by BYU's Ty Detmer in 1990.\nThe Warrior offense racked up a season high 680 total yards, while the defense held Arizona State to 391 yards, sacked Sun Devil quarterback Rudy Carpenter four times, and forced two fumbles, one in the red zone halting an ASU drive, and another which led to a field goal.\nBrennan finished the season with 5,549 yards to become just the third quarterback in college history with 5,000 yards and 50 TDs in a season, joining Klingler and Texas Tech's B. J. Symons.\nHawaii (11–3) matched the school mark for most wins in a season, set in 1992 when the team went 11–2. The Sun Devils (7–6) concluded their disappointing season, unable to send coach Dirk Koetter out with a win. He coached his final game after being fired the previous month. Dennis Erickson has been hired to take over the team.\nHead coach June Jones recorded his 64th victory in eight seasons at the Warrior helm, making him the school's all-time winningest coach, surpassing Dick Tomey who amassed 63 wins in 10 seasons.\n* Game MVPs: Jason Rivers, WR & Colt Brennan, QB: Hawaii. Ryan Torain, RB: Arizona State\nStatistics\nThrough Week 14, December 2 Oregon State game.\nTeam\n{|\n|-\n| valign=\"top\" |\n{| class=\"wikitable\" style=\"white-space:nowrap;\"\n|-\n! !! UH !! Opp\n|-\n| Scoring || 615 || 313\n|-\n| &nbsp;&nbsp;Points per Game || 47.3 || 24.1\n|-\n| First Downs || 352 || 270\n|-\n| &nbsp;&nbsp;Rushing || 79 || 97\n|-\n| &nbsp;&nbsp;Passing || 255 || 149\n|-\n| &nbsp;&nbsp;Penalty || 18 || 24\n|-\n| Total Offense     || 7,149 || 4,898\n|-\n| &nbsp;&nbsp;Avg per Play  || 8.5 || 5.6\n|-\n| &nbsp;&nbsp;Avg per Game  || 549.9 || 376.8\n|-\n| Fumbles-Lost     || 26–15 || 25–13\n|-\n| Penalties-Yards  || 93–826 || 67–603\n|-\n| &nbsp;&nbsp;Avg per Game || 63.5 || 46.4\n|}\n| valign=\"top\" |\n{| class=\"wikitable\" style=\"white-space:nowrap;\"\n|-\n! !! UH !! Opp\n|-\n| Punts-Yards      || 16–602 || 56–2,304\n|-\n| &nbsp;&nbsp;Avg per Punt || 37.6 || 41.1\n|-\n| Time of Possession/Game  || 28:40  || 31:20\n|-\n| 3rd Down Conversions || 71/123 (58%) || 67/171 (39%)\n|-\n| 4th Down Conversions || 8/20 (40%) || 7/22 (32%)\n|-\n| Touchdowns Scored    || 84 || 40\n|-\n| Field Goals-Attempts || 11–14 || 11–13\n|-\n| PAT-Attempts || 70–77 || 34–37\n|-\n| Attendance   || 292,708 || 189,511\n|-\n| &nbsp;&nbsp;Games/Avg per Game || 8/36,588 || 5/37,902\n|}\n|}\nScores by quarter\n{|\n|- style=\"text-align:left;\"\n|\n|}\nOffense\nPassing\n{| class=\"wikitable\" style=\"white-space:nowrap;\"\n! Name !! Att-Cmp-Int !! Pct !! Yds !! TD !! Lng !! Effic\n|-\n|Brennan, Colt || 559–406–12 || 72.6% || 5,549 || 58 || 79 || 185.96\n|-\n|Graunke, Tyler || 43–32–0 || 74.4% || 501 || 4 || 62 || 202.99\n|-\n|Funaki, Inoke || 12–6–0 || 50.0% || 128 || 0 || 58 || 139.60\n|-\n|Milne, Kurt || 1–0–0 || 0% || 0 || 0 || 0 || 0.00\n|- style=\"font-weight:bold;\"\n| Total || 615–444–12 || 72.2% || 6,178 || 62 || 79 || 185.94\n|}\nRushing\n{| class=\"wikitable\" style=\"white-space:nowrap;\"\n|-\n! Name  !! Att !! Net !! TD !!  Avg\n|-\n|Ilaoa, Nate || 131 || 990 || 13 || 7.6\n|-\n|Brennan, Colt || 86 || 366 || 5 || 4.3\n|-\n|Mauia, Reagan || 31 || 153 || 2 || 4.9\n|-\n|Funaki, Inoke || 10 || 34 || 0 || 3.4\n|-\n|Laumoli, Jason || 4 || 34 || 0 || 8.5\n|-\n|Graunke, Tyler || 9 || 30 || 1 || 3.3\n|-\n|Farmer, David || 7 || 30 || 1 || 4.3\n|-\n|Grice-Mullen, Ryan || 2 || 24 || 0 || 12.0\n|-\n|Dickerson, Ross || 4 || 13 || 0 || 3.2\n|-\n|Peoples, Khevin || 4 || 7 || 0 || 1.8\n|-\n|Seti, Siave || 3 || 2 || 0 || 0.7\n|-\n|TEAM || 7 || −32 || 0 || −4.6\n|- style=\"font-weight:bold;\"\n|Total || 298 || 1,651 || 22 || 5.5\n|}\nReceiving\n{| class=\"wikitable\" style=\"white-space:nowrap;\"\n|-\n!           Name !! No. !! Yds !! TD !! Avg\n|-\n|Bess, Davone || 96 || 1,220 || 15 || 12.7\n|-\n|Rivers, Jason || 72 || 1,178 || 10 || 16.4\n|-\n|Ilaoa, Nate || 67 || 837 || 5 || 12.5\n|-\n|Dickerson, Ross || 54 || 726 || 7 || 13.4\n|-\n|Sample, Ian || 54 || 690 || 10 || 12.8\n|-\n|Grice-Mullen, Ryan || 46 || 770 || 11 || 16.7\n|-\n|Mock, Chad || 26 || 378 || 3 || 14.5\n|-\n|Mauia, Reagan || 10 || 109 || 1 || 10.9\n|-\n|Bain, Aaron || 7 || 69 || 0 || 9.9\n|-\n|Farmer, David || 4 || 12 || 0 || 3.0\n|-\n|Lane, Malcolm || 3 || 120 || 0 || 40.0\n|-\n|Washington, Michael || 3 || 50 || 0 || 16.7\n|-\n|Dylan Linkner || 1 || 15 || 0 || 15.0\n|-\n|Seti, Siave || 1 || 4 || 0 || 4.0\n|- style=\"font-weight:bold;\"\n|Total || 444 || 6,178 || 62 || 13.9\n|}\nDefense\n{| class=\"wikitable\" style=\"white-space:nowrap;\"\n|-\n! rowspan=\"2\" | Name\n! colspan=\"5\" | Tackles\n! colspan=\"3\" | Fumbles\n! colspan=\"3\" | Pass Defense\n!| Block Kick\n! colspan=\"2\" | Sacks\n|-\n! Solo !! Ast !! Total !! TFL !! TFL Yds !! Forced !! Recovery !! Yds !! Int. !! Yds !! BreakUp !! Blkd !! No. !! Yards\n|-\n|Leonard, Adam || 62 || 52 || 114.0 || 3.5 || 9 || 1 || 4 || 20 || 1 || 5 || 9 || 0 || 1.0 || 2\n|-\n|Elimimian, Solomon || 51 || 38 || 89.0 || 2.0 || 5 || 2 || 1 || 0 || 0 || 0 || 1 || 0 || 0.0 || 0\n|-\n|Peters, Leonard || 43 || 31 || 74.0 || 3.0 || 23 || 2 || 0 || 0 || 3 || 101 || 7 || 0 || 1.0 || 13\n|-\n|Purcell, Melila || 36 || 24 || 60.0 || 15.5 || 47 || 4 || 0 || 0 || 0 || 0 || 1 || 0 || 9.5 || 39\n|-\n|Patek, Jacob || 34 || 21 || 55.0 || 1.0 || 1 || 3 || 0 || 0 || 1 || 31 || 3 || 0 || 1.0 || 6\n|-\n|Alama-Francis, Ikaika || 21 || 18 || 39.0 || 10.0 || 51 || 1 || 3 || 0 || 0 || 0 || 2 || 0 || 4.0 || 28\n|-\n|Kalilimoku, Brad || 19 || 15 || 34.0 || 5.5 || 18 || 0 || 0 || 0 || 0 || 0 || 0 || 0 || 2.0 || 13\n|-\n|Lewis, Gerard || 20 || 13 || 33.0 || 0.5 || 4 || 0 || 0 || 0 || 3 || 33 || 4 || 0 || 0.0 || 0\n|-\n|Lafaele, Michael || 18 || 14 || 32.0 || 5.5 || 22 || 0 || 0 || 0 || 0 || 0 || 0 || 0 || 2.0 || 14\n|-\n|Newberry, Myron || 22 || 10 || 32.0 || 0.0 || 0 || 0 || 2 || 0 || 2 || 49 || 2 || 0 || 0.0 || 0\n|-\n|Lau, Micah || 14 || 11 || 25.0 || 1.5 || 10 || 0 || 1 || 0 || 0 || 0 || 0 || 0 || 0.0 || 0\n|-\n|Kafentzis, Tyson || 15 || 8 || 23.0 || 2.0 || 3 || 0 || 0 || 0 || 0 || 0 || 0 || 0 || 0.0 || 0\n|-\n|Patton, Kenny || 13 || 5 || 18.0 || 0.0 || 0 || 0 || 1 || 0 || 1 || 19 || 3 || 0 || 0.0 || 0\n|-\n|Martinez, AJ || 10 || 7 || 17.0 || 2.0 || 9 || 0 || 0 || 0 || 0 || 0 || 4 || 0 || 0.0 || 0\n|-\n|Saole, Rustin || 16 || 1 || 17.0 || 0.0 || 0 || 0 || 0 || 0 || 0 || 0 || 0 || 0 || 0.0 || 0\n|-\n|Keomaka, Ryan || 14 || 2 || 16.0 || 0.5 || 1 || 0 || 0 || 0 || 2 || 52 || 0 || 0 || 0.0 || 0\n|-\n|Paepule, Timo || 10 || 5 || 15.0 || 1.0 || 2 || 0 || 0 || 0 || 0 || 0 || 0 || 0 || 0.0 || 0\n|-\n|Allen-Jones, CJ || 6 || 9 || 15.0 || 2.0 || 5 || 0 || 0 || 0 || 0 || 0 || 2 || 1 || 0.0 || 0\n|-\n|Soares, Blaze || 14 || 0 || 14.0 || 3.0 || 24 || 1 || 0 || 0 || 0 || 0 || 1 || 0 || 2.0 || 20\n|-\n|Malala, Michael || 7 || 7 || 14.0 || 0.0 || 0 || 1 || 1 || 0 || 0 || 0 || 2 || 0 || 0.0 || 0\n|-\n|Hawthorne, CJ || 12 || 2 || 14.0 || 0.0 || 0 || 2 || 0 || 0 || 1 || 0 || 1 || 0 || 0.0 || 0\n|-\n|Noa, Karl || 7 || 5 || 12.0 || 2.0 || 11 || 0 || 0 || 0 || 0 || 0 || 0 || 0 || 1.0 || 8\n|-\n|Purcell, Amani || 6 || 5 || 11.0 || 1.0 || 12 || 0 || 0 || 0 || 0 || 0 || 0 || 0 || 1.0 || 12\n|-\n|Veikune, David || 8 || 2 || 10.0 || 3.0 || 14 || 0 || 0 || 0 || 0 || 0 || 0 || 0 || 2.0 || 12\n|-\n|Porlas, Dane || 7 || 1 || 8.0 || 0.0 || 0 || 0 || 0 || 0 || 0 || 0 || 0 || 0 || 0.0 || 0\n|-\n|Fruean, Renolds || 4 || 3 || 7.0 || 1.5 || 4 || 0 || 0 || 0 || 0 || 0 || 0 || 0 || 1.5 || 4\n|-\n|Pedersen, Erik || 5 || 2 || 7.0 || 0.0 || 0 || 0 || 0 || 0 || 0 || 0 || 0 || 0 || 0.0 || 0\n|-\n|Galdeira, Guyton || 4 || 3 || 7.0 || 0.0 || 0 || 0 || 0 || 0 || 0 || 0 || 0 || 0 || 0.0 || 0\n|-\n|Wilson, Lawrence || 4 || 3 || 7.0 || 1.5 || 1 || 0 || 0 || 0 || 0 || 0 || 0 || 0 || 0.0 || 0\n|-\n|Watson, Keala || 3 || 4 || 7.0 || 0.5 || 1 || 0 || 0 || 0 || 0 || 0 || 0 || 0 || 0.0 || 0\n|-\n|Savaiigaea, Rocky || 6 || 0 || 6.0 || 2.0 || 2 || 1 || 0 || 0 || 0 || 0 || 0 || 0 || 0.0 || 0\n|-\n|Fergerstrom, Victor || 2 || 3 || 5.0 || 0.0 || 0 || 0 || 0 || 0 || 0 || 0 || 0 || 0 || 0.0 || 0\n|-\n|Kelly, Dan || 4 || 0 || 4.0 || 0.0 || 0 || 0 || 0 || 0 || 0 || 0 || 0 || 0 || 0.0 || 0\n|-\n|Thomas, Desmond || 4 || 0 || 4.0 || 0.0 || 0 || 0 || 0 || 0 || 0 || 0 || 0 || 1 || 0.0 || 0\n|-\n|Noa, Waikaloa || 2 || 1 || 3.0 || 0.5 || 1 || 0 || 0 || 0 || 0 || 0 || 0 || 0 || 0.0 || 0\n|-\n|Kiesel-Kauhane, RJ || 2 || 1 || 3.0 || 0.0 || 0 || 0 || 0 || 0 || 0 || 0 || 0 || 0 || 0.0 || 0\n|-\n|Laeli, Fale || 0 || 2 || 2.0 || 0.0 || 0 || 0 || 0 || 0 || 0 || 0 || 0 || 0 || 0.0 || 0\n|-\n|Clore, Victor || 2 || 0 || 2.0 || 0.0 || 0 || 0 || 0 || 0 || 0 || 0 || 0 || 0 || 0.0 || 0\n|-\n|Satele, Brashton || 2 || 0 || 2.0 || 0.0 || 0 || 0 || 0 || 0 || 0 || 0 || 0 || 0 || 0.0 || 0\n|-\n|Mock, Chad || 2 || 0 || 2.0 || 0.0 || 0 || 0 || 0 || 0 || 0 || 0 || 0 || 0 || 0.0 || 0\n|-\n|Letuli, Laupepa || 0 || 1 || 1.0 || 0.5 || 1 || 0 || 0 || 0 || 0 || 0 || 0 || 0 || 0.0 || 0\n|-\n|Rice, Joshua || 1 || 0 || 1.0 || 1.0 || 13 || 0 || 0 || 0 || 0 || 0 || 0 || 0 || 1.0 || 13\n|-\n|Ieru, Raphael || 0 || 1 || 1.0 || 0.0 || 0 || 0 || 0 || 0 || 0 || 0 || 0 || 0 || 0.0 || 0\n|-\n|Funaki, Inoke || 1 || 0 || 1.0 || 0.0 || 0 || 0 || 0 || 0 || 0 || 0 || 0 || 0 || 0.0 || 0\n|-\n|Farmer, David || 1 || 0 || 1.0 || 0.0 || 0 || 0 || 0 || 0 || 0 || 0 || 0 || 0 || 0.0 || 0\n|-\n|Mauia, Reagan || 1 || 0 || 1.0 || 0.0 || 0 || 0 || 0 || 0 || 0 || 0 || 0 || 0 || 0.0 || 0\n|-\n|Grice-Mullen, Ryan || 1 || 0 || 1.0 || 0.0 || 0 || 0 || 0 || 0 || 0 || 0 || 0 || 0 || 0.0 || 0\n|-\n|LaCount, Kahai || 1 || 0 || 1.0 || 0.0 || 0 || 0 || 1 || 0 || 0 || 0 || 0 || 0 || 0.0 || 0\n|-\n|Rivers, Jason || 1 || 0 || 1.0 || 0.0 || 0 || 0 || 0 || 0 || 0 || 0 || 0 || 0 || 0.0 || 0\n|-\n|Bess, Davone || 1 || 0 || 1.0 || 0.0 || 0 || 0 || 0 || 0 || 0 || 0 || 0 || 0 || 0.0 || 0\n|-\n|Ilaoa, Nate || 1 || 0 || 1.0 || 0.0 || 0 || 0 || 0 || 0 || 0 || 0 || 0 || 0 || 0.0 || 0\n|- style=\"font-weight:bold;\"\n|Total || 510 || 310 || 820.0 || 68.0 || 269 || 16 || 13 || 20 || 14 || 290 || 41 || 2 || 26.0 || 166\n|}\nSpecial teams\n{| class=\"wikitable\" style=\"white-space:nowrap;\"\n|-\n! rowspan=\"2\" | Name\n! colspan=\"6\" | Punting\n! colspan=\"5\" | Kickoffs\n! colspan=\"11\"| Scoring / Field Goals\n|-\n! No. !! Yds !! Avg !! Long !! I20 !! TB\n! No. !! Yds !! TB !! OB !! Avg\n! PAT !! 10–19 !! 20–29 !! 30–39 !! 40–49 !! 50–59 !! 60+ !! FG-FGA !! Pct. !! Long !! Points\n|-\n| Milne, Kurt || 16 || 602 || 37.6 || 52 || 3 || 0 || 4 || 246 || 0 || 0 || 61.5 || || || || || || || || || ||\n|-\n| Kelly, Dan || || || || || || || 104 || 6,422 || 40 || 7 || 61.8 || 42–45 || 0–0 || 5–6 || 4–5 || 1–1 || 1–2 || 0–0 || 11–14 || 78.6% || 52 || 75\n|-\n| Forester, Briton || || || || || || || || || || || || 28–31 || || || || || || || || || || 28\n|-\n| TEAM || || || || || || || || || || || || 0–1 || || || || || || || || || || 0\n|- style=\"font-weight:bold;\"\n| Total || 16 || 602 || 37.6 || 52 || 3 || 0 || 108 || 6,668 || 40 || 7 || 61.7 || 70–77 || 0–0 || 5–6 || 4–5 || 1–1 || 1–2 || 0–0 || 11–14 || 78.6% || 52 || 103\n|}\nReturns\n{| class=\"wikitable\" style=\"white-space:nowrap;\"\n|-\n! rowspan=\"2\" | Name\n! colspan=\"4\" | Punt Returns\n! colspan=\"4\" | Kick Returns\n! colspan=\"4\" | Interception Returns\n|-\n! No. !! Yds !! Long !! TD !! No. !! Yds !! Long !! TD !! No. !! Yds !! Long !! TD\n|-\n|Newberry, Myron || 22 || 130 || 25 || 0 || 0 || 0 || 0 || 0 || 2 || 49 || 49 || 0\n|-\n|Bess, Davone || 4 || 69 || 35 || 0 || 0 || 0 || 0 || 0 || 0 || 0 || 0 || 0\n|-\n|Hawthorne, CJ || 1 || 2 || 2 || 0 || 0 || 0 || 0 || 0 || 1 || 0 || 0 || 0\n|-\n|Patton, Kenny || 1 || 18 || 18 || 0 || 5 || 98 || 35 || 0 || 1 || 19 || 19 || 0\n|-\n|Dickerson, Ross || 0 || 0 || 0 || 0 || 23 || 603 || 100 || 1 || 0 || 0 || 0 || 0\n|-\n|Vergerstrom, Victor || 0 || 0 || 0 || 0 || 3 || 15 || 12 || 0 || 0 || 0 || 0 || 0\n|-\n|Lane, Malcolm || 0 || 0 || 0 || 0 || 6 || 87 || 22 || 0 || 0 || 0 || 0 || 0\n|-\n|Mock, Chad || 0 || 0 || 0 || 0 || 1 || 12 || 12 || 0 || 0 || 0 || 0 || 0\n|-\n|Soares, Blaze || 0 || 0 || 0 || 0 || 2 || 18 || 10 || 0 || 0 || 0 || 0 || 0\n|-\n|Veikune, David || 0 || 0 || 0 || 0 || 2 || 25 || 18 || 0 || 0 || 0 || 0 || 0\n|-\n|Chopp, Alonzo || 0 || 0 || 0 || 0 || 1 || 4 || 4 || 0 || 0 || 0 || 0 || 0\n|-\n|Peters, Leonard || 0 || 0 || 0 || 0 || 0 || 0 || 0 || 0 || 3 || 101 || 54 || 2\n|-\n|Keomaka, Ryan || 0 || 0 || 0 || 0 || 0 || 0 || 0 || 0 || 2 || 52 || 29 || 1\n|-\n|Lewis, Gerard || 0 || 0 || 0 || 0 || 0 || 0 || 0 || 0 || 3 || 33 || 33 || 0\n|-\n|Patek, Jacob || 0 || 0 || 0 || 0 || 0 || 0 || 0 || 0 || 1 || 31 || 31 || 0\n|-\n|Leonard, Adam || 0 || 0 || 0 || 0 || 0 || 0 || 0 || 0 || 1 || 5 || 5 || 0\n|- style=\"font-weight:bold;\"\n|Total || 28 || 219 || 35 || 0 || 43 || 862 || 100 || 1 || 14 || 290 || 54 || 3\n|}\nAwards and honors\nTeam awards\n* Alec Waterhouse Most Valuable Player Award: Ross Dickerson, WR\n* Ben Yee Most Inspirational Award: Tala Esera, OL\n* Scholar-Athlete Award: Dane Uperesa, OL\n* Captains Award (Offense): Samson Satele, OL\n* Captains Award (Defense): Leonard Peters, DB\n* Captains Award (special teams): Michael Malala, DB\n* Warrior Club Award (Offense): Nate Ilaoa, RB & Colt Brennan, QB\n* Warrior Club Award (Defense): Ikaika Alama-Francis, DE & Melila Purcell, DE\n* Warrior Club Award (special teams): Timo Paepule, LB\n* Scout Team Award (Offense): William Brogan, QB\n* Scout Team Award (Defense): Ryan Perry, DB\n* Fan of the Year Award: Tom Cavalli,\nWAC awards\n* Offensive Player of the Year: Colt Brennan, QB\n* Coach of the Year: June Jones\nNational awards\n* Sammy Baugh Trophy: Colt Brennan, QB\nAll-WAC\n;First team\n* Davone Bess, WR\n* Tala Esera, OL\n* Samson Satele, OL\n* Colt Brennan, QB\n* Nate Ilaoa, RB\n* Ikaika Alama-Francis, DT\n* Melila Purcell, DT\n* Leonard Peters, DB\n* Ross Dickerson, ST\n;Second team\n* Jason Rivers, WR\n* Dane Uperesa, OL\n* Michael Lafaele, DL\n* Adam Leonard, LB\nAll-Americans\nColt Brennan\n* Associated Press third team\n* Walter Camp Football Foundation second team\n* SI.com honorable mention\n* CollegeFootballNews.com second team\n* JCGridiron.com JUCO transfer team\nSamson Satele\n* SI.com second team\nDavone Bess\n* CollegeFootballNews.com honorable mention\n* CollegeFootballNews.com sophomore honorable mention\n2007 NFL draft\n* The following Warriors were taken in the 2007 NFL draft, held on April 28 and April 29.\n{|class=\"wikitable\"\n|-\n!Round/Pick\n!Player\n!Position\n!Team\n|-\n|2/58\n|Ikaika Alama-Francis\n|Defensive end\n|Detroit Lions\n|-\n|2/60\n|Samson Satele\n|Center\n|Miami Dolphins\n|-\n|6/181\n|Reagan Mauia\n|Fullback\n|Miami Dolphins\n|-\n|6/200\n|Melila Purcell\n|Defensive end\n|Cleveland Browns\n|-\n|7/236\n|Nate Ilaoa\n|Running back\n|Philadelphia Eagles\n|}\nReferences"
    }
  ]
}