{
  "content": [
    {
      "type": "text",
      "text": "# 2006 President of the Chamber of Deputies of the Parliament of the Czech Republic election\n\nElection of the President of the Chamber of Deputies of the Parliament of the Czech Republic was held in June, July and August 2006. Chamber of Deputies was unable to elect new President for 2 months. Miloslav Vlček was eventually elected the new President. Vlček was considered a provisory President but remained in the position whole term.\nVoting\nFirst attempt\nFirst election was held on 29 June 2006. Civic Democratic Party nominated Miroslava Němcová for the position. She was the only candidate. She received 98 votes in the first round while 27 MPs voted against. Němcová needed 100 votes to be elected. Second round was held but Němcová was once again unable to secure enough votes. She received 98 votes while 26 MPs voted against. It was speculated that at least one MP of her party voted against her. Czech Social Democratic Party assured its support for the incumbent President Lubomír Zaorálek.\nSecond election\nSecond election was held on 7 July 2006. Christian and Democratic Union – Czechoslovak People's Party (KDU-ČSL) nominated Jan Kasal. Kasal had support of the governing coalition of ODS, KDU-ČSL and Greens. Kasal received 99 votes in the first round while 27 MPs voted against. Second round was held and Kasal received 99 votes and wasn't elected.\nThird election\nThird election was scheduled for 12 July 2006. No candidate was nominated and the election wasn't held.\nFourth election\nFourth election was scheduled for 21 July 2006. Opposition Czech Social Democratic Party nominated Lubomír Zaorálek for the position. Zaorálek's candidacy was withdrawn prior voting and election didn't take place. Social Democrats and coalition government decided to negotiate about possible conjoint candidate.\nFifth election\nFifth election took place on 28 July 2006. Jan Kasal became the only candidate when Social Democrats withdrew their candidate Lubomír Zaorálek. Kasal received 100 votes while 100 MPs didn't vote. The result was repeated in the second round.\nSixth election\nAnother election was scheduled for 4 August 2006. No candidate was nominated.\nSeventh election\nCoalition parties agreed to support Social Democrat Miloslav Vlček for the position. Seventh election was held on 14 August 2006. Vlček received 174 votes of 197. Vlček agreed to remain in the position only temporarily.\nReferences"
    }
  ]
}