{
  "content": [
    {
      "type": "text",
      "text": "# 2006 Navajo Nation presidential election\n\nThe Navajo Nation Presidential elections took place on November 7, 2006. Primary elections took place on August 8, 2006. Incumbent President Joe Shirley Jr. was re-elected, defeating 11 candidates, including former New Mexico State senator Lynda Lovejoy.\nCandidates\n* Frank Dayish Jr., then vice-president of the Navajo Nation announced his bid for president on May 6, 2006 at the Shiprock Chapter as 450 concern Diné.\n* Lynda Lovejoy, a former New Mexico state representative, declared her candidancy on April 1, 2006, at the Crownpoint Chapter House in Crownpoint, New Mexico.\n* Calvin Tsosie, from Yatahey, New Mexico\n* Frank Dayish, from Shiprock, New Mexico\n* Lynda Lovejoy, from Crownpoint, New Mexico\n* Ernest H Begay, from Rock Point, Arizona\n* James Henderson, from Ganado, Arizona\n* Wilbur Nelson\n* Harrison Todichiini, from Shiprock, New Mexico\n* Vern Lee, from Kirtland, New Mexico\n* Joe Shirley Jr., from Chinle, Arizona\nResults\nShirley Jr. (Chinle) and Lovejoy (Crownpoint) proceeded to a runoff in November 2007. This was he first time in Navajo government history that a woman made it to the runoff. Immediately after the first round, Mrs. Lovejoy selected Walter Phelps from Leupp, Arizona as her running mate to challenge Shirley, who picked Navajo Nation Council Delegate Ben Shelly (Thoreau).\nShirley defeated Lovejoy in the second round by a margin of 4,000. Becoming the first leader of the Navajo nation to be re-elected since Chairman Peter MacDonald.\n}}\nReferences\nExternal links\n* Johnson, Natasha Kaye. (2006). [http://www.gallupindependent.com/2006/mar/031706lvjy.html Lovejoy enters race] ([https://web.archive.org/web/20081120014551/http://www.gallupindependent.com/2006/mar/031706lvjy.html Archived] 2009-05-16). The Gallup Independent\n* Hassler, Brian. (2007). [http://www.gallupindependent.com/2006/may/050906dyshcpgn.html Dayish campaign begins with rally in Shiprock] ([https://web.archive.org/web/20081020070625/http://www.gallupindependent.com/2006/may/050906dyshcpgn.html Archived] 2009-05-16). The Gallup Independent"
    }
  ]
}