{
  "content": [
    {
      "type": "text",
      "text": "# 2007 Pan-democracy camp primary election\n\nThe Hong Kong Island by-election, 2007 Pro-democracy primary was a primary election held to select a single candidate to represent all the Pan-democrat parties, also referred to as the \"pro-democracy camp\", in the Hong Kong Island by-election, 2007.\nScope of Pan-democrats\nThe pro-democracy parties and organisations participating in the coordination were Democratic Party, Civic Party, League of Social Democrats, The Frontier, Hong Kong Confederation of Trade Unions, Neighbourhood and Workers Service Centre, Civic Act-up, Civil Human Rights Front, Women's Alliance (婦盟) and the Association for Democracy and People's Livelihood. The selection mechanism was organized by Frederick Fung, Emily Lau, Ronny Tong and Joseph Lee (李國麟).\nSelection mechanism\nThe selection mechanism for the Democrat candidate consisted of a public debate, an opinion poll and primary elections. The weightings were: 50% from the opinion poll, 30% from the 300 delegates, 10% from Legislative Councillors and 10% from District Councillors.\n*a debate was held at the University of Hong Kong on 24 September.\n*after the debate, the 25 pro-democracy Legislative Councilors, the 28 pro-democracy Hong Kong Island District Councillors and 300 delegates (30 each from the 10 organisations) participated in a primary election.\n*an opinion poll of at least 1000 eligible voters was carried out by HKU POP between 25 and 29 September.\nThe debate format is based on those held for the 2007 Chief Executive election. University professors Ma Ngok (馬嶽), Chan Kin-man (陳健民) and Benny Tai (戴耀廷) questioned the candidates while culture critic Leung Man-tao (梁文道) acted as moderator. One hundred members of the public participated and asked questions. The debate was broadcast live on television and radio. Rev. Chu Yiu-ming (朱耀明) acted as the returning officer for the voting.\nThe selection mechanism cost an estimated HK$140,000, with the result announced on 30 September.\nChan won the primary by a clear margin, with 77.3 points compared with Lo's 22.7 points.\nReferences"
    }
  ]
}