{
  "content": [
    {
      "type": "text",
      "text": "# 2007 Republika Srpska presidential election\n\nThe presidential election of 2007 in the Republika Srpska entity of Bosnia and Herzegovina was announced after the premature death of President Milan Jelić on 30 September 2007 and was held on 9 December 2007.[http://www.24sata.info/7767 9. decembar: Prijevremeni izbori za predsjednika Republike Srpske | 24sata.info - Vijesti, gradovi, sport, zabava, tehnologija, lifestyle, kolumne] Until the election took place, Igor Radojičić, also from the ruling Alliance of Independent Social Democrats, was acting president.[http://www.iht.com/articles/ap/2007/10/01/europe/EU-GEN-Bosnia-Next-President.php Radojcic nominated as interim president in Republika Srpska – International Herald Tribune] The election had to be called within fifteen days of Jelić's death;[http://www.earthtimes.org/articles/show/117996.html Thousands expected at late Bosnian Serb leader Jelic's funeral : World] it was called on 11 October 2007, with candidates to be nominated by 16 October 2007.\nCandidates\nThere were ten candidates,[https://news.bbc.co.uk/2/hi/europe/7135341.stm BBC NEWS | Europe | Bosnian Serbs get new president] with the frontrunners being the Republika Srpska Academy of Sciences chairman Rajko Kuzmanović of the ruling Alliance of Independent Social Democrats, MP Ognjen Tadić of the main opposition Serbian Democratic Party, and former Prime Minister of Republika Srpska and Bosnia and Herzegovina Foreign Minister Mladen Ivanić of the Party of Democratic Progress.[http://www.setimes.com/cocoon/setimes/xhtml/en_GB/newssummary/#setimes/newsbriefs/2007/11/26/nb-04 News]\nAll three main candidates supported Republika Srpska's status in Bosnia and Herzegovina and the Dayton Accords. President of Serbia Boris Tadić and the Democratic Party in Serbia supported the SNSD and its candidate Kuzmanović. According to the electoral law, there would be no run-off.[http://www.setimes.com/cocoon/setimes/xhtml/en_GB/features/setimes/features/2007/12/06/feature-02 Republika Srpska poised to elect new president Sunday (SETimes.com)]\nThe other candidates were:[http://derstandard.at/?id=3138248 derStandard.at / Registrierung]\n* Mirko Blagojević of the Serbian Radical Party \"Dr. Vojislav Šešelj\"\n* Slobodan Popović of the Social Democratic Party\n* Krsto Jandrić of the National Democratic Party\n* Anton Josipović of the People's Party Work for Prosperity\n* Nedžad Delić of the Democratic Party of the Disabled\n* Dragan Đokanović independent candidate\n* Nikola Lazarević of the European Ecological Party E5\nResults\nAccording to unofficial results (with 55% of the votes counted), Kuzmanović won the election with 44.53% of the votes to Tadić's 33.28% and Ivanić's 16%.[http://www.setimes.com/cocoon/setimes/xhtml/en_GB/features/setimes/features/2007/12/10/feature-01 Unofficial results declare Kuzmanovic new president of Republika Srpska (SETimes.com)] Turnout was close to 36%.\nOfficial results released on 2007-12-17 confirmed these preliminary results. Kuzmanović was sworn in on 2007-12-28.[http://www.iht.com/articles/ap/2007/12/28/europe/EU-GEN-Bosnia-Serb-President.php New Bosnian Serb president vows to work to prevent further unification of country – International Herald Tribune]\nReferences"
    }
  ]
}