{
  "content": [
    {
      "type": "text",
      "text": "# 2007–08 Queens Park Rangers F.C. season\n\nDuring the 2007–08 season, Queens Park Rangers were playing in the Football League Championship.\nReview\nPre-season\nManager John Gregory began rebuilding the squad before the new season, bringing in Daniel Nardiello, Chris Barker and John Curtis on free transfers. Andrew Howell, Kieron St Aimie and Aaron Goode all signed one-year professional contracts after impressing in the youth team under Joe Gallen, who was later sacked, despite his under 18s winning the league. Gregory also signed more backroom staff, including Paul Hunter as the new physio, Mick Harford as assistant manager, Ed de Goey and Warren Neill as coaches and Steve Brown and Keith Ryan as youth team coaches. Creative left winger Lee Cook was sold to rivals Fulham for a deal reported as potentially worth between £2.5 million and £4.5 million. Michael Mancienne also extended his loan for a further season. On 26 July, QPR completed the loan signing of Ben Sahar for three months (subsequently extended until January 2008). The signings of Lee Camp and Simon Walton followed the day after on 27 July, totalling £500,000.\nDuring pre-season, new signing Simon Walton fractured his leg in a non-competitive 2–1 victory against Fulham and was side-lined for several months.\nTragic start\nThe season began turbulently, with a draw against recently promoted Bristol City, a loss in the League Cup 2–1 at home to League One Leyton Orient followed by a further 2–0 defeat at home by Cardiff City. The match against Burnley on 25 August was postponed after promising teenage player Ray Jones was killed in a car crash in the early hours of the morning. A week later QPR crashed to a 3–0 defeat at home to Southampton, followed by a draw with Leicester and a further home defeat by Plymouth (0–2) before picking up only their second point of the month (and the third of the season) at home to Watford on 22 September.\nNew manager\nOn 1 October it was announced that John Gregory had been sacked after 13 months in charge. This came after a comprehensive 5–1 defeat in front of the Sky Sports cameras against West Bromwich Albion on 30 September. First-team coach Mick Harford was placed in temporary charge. Three consecutive  fixtures against East Anglian opposition saw Rangers defeated at the hands of Colchester before earning their first win of the season at home to Norwich and salvaging a draw with Ipswich at Loftus Road. After a goalless draw at Preston and a rare victory away to Charlton, Harford left the club later in the month and was replaced by Luigi De Canio. His first game in charge was a 2–0 victory against Hull City.\nSigns of recovery\nFollowing the arrival of De Canio, Rangers endured defeats at the hands of Coventry, Stoke, Blackpool and Crystal Palace before a brief run of four games without defeat in mid-December indicated signs of a recovery. On 11 December 2007 QPR were drawn away from home at Chelsea in the third round of the FA Cup, a tie due to be played on 5 January 2008. The fixture would be the first competitive West London derby between the two sides since 1996.\nThe Christmas and New Year period was largely successful for the club with Rangers bouncing back from a defeat at Plymouth on Boxing Day and picking up wins away from home at second-placed Watford (4–2) and at Loftus Road against fellow strugglers Leicester (3–1).\nInvestment\nShortly prior to the traditional Christmas fixture period on 20 December 2007 it was announced that the family of Lakshmi Mittal had purchased a 20 per cent shareholding in the club. As part of the investment Lakshmi Mittal's son-in-law took a place on the board of directors. Continuing the theme of previous seasons a number of loan signings featured for the club including Gavin Mahon, Ákos Buzsáky and Rowan Vine. The investment potential of the club's new backers resulted in a number of speculative storylines in the football press throughout the season, including rumoured signings of former World Player of the Year winners Luís Figo and Zinedine Zidane, the latter as a possible manager.\nNew recruits\nRangers signed several players during the January transfer window: Ákos Buzsáky who had previously been on loan from Plymouth Argyle, Hogan Ephraim from West Ham, Kieran Lee on loan from Manchester United, Gavin Mahon on loan from Watford, Matthew Connolly from Arsenal, Patrick Agyemang from Preston and Fitz Hall from Wigan. Early in January QPR also managed to secure striker Rowan Vine in a permanent move following his brief loan spell which had ended in December.\nJanuary onwards\nAround 6,000 Rangers fans made the short trip to Stamford Bridge on the first weekend in January to see QPR put up a determined effort against their Premier League neighbours Chelsea in the FA Cup third round. Ultimately the R's lost 1–0 to an unfortunate deflected own goal from Lee Camp. The Cup defeat was followed by defeat away to Sheffield United. The month ended for Rangers with a 2–0 home win over Barnsley followed by a defeat at Cardiff. As the January transfer window closed, QPR secured American goalkeeper Matt Pickens and Northern Irish defender Damien Delaney and parted ways with a number of players including Marcus Bignot, Danny Cullip, Nick Ward, Dominic Shimmin, Sampsa Timoska, Shabazz Baidoo, Kieron St Aimie, Stefan Moore and Pat Kanyuka. Adam Bolder, Daniel Nardiello and Simon Walton were also put out on loan.\nFebruary\nThe club started February well defeating third-placed Bristol City 3–0 at Loftus Road followed by a 3–2 away win at Southampton. Showing some signs of a recovery from the start to the season, the Southampton victory left QPR 6 points off the playoffs and 8 points above the relegation zone. At the same time, Flavio Briatore took over from Alejandro Agag as the chairman of QPR's holding company. Briatore's arrival also signalled the demise of the club mascot, 'Jude the stadium cat'. According to newspaper reports, the black cat was incompatible with Briatore's superstitions and the matchday programme on 2 February subsequently announced Jude the Cat had \"gone on holiday\". On 12 February the club's erratic form then saw them fall to a 6th home defeat of the season, losing to Burnley 2–4 after at one stage leading 2–0.\nTaking advantage of their next league fixture opponents Barnsley playing Liverpool in the FA Cup on 16 February, QPR organised a mid-season training camp to the Vale de Lobo resort in the Algarve region of Portugal. Gareth Ainsworth was appointed club captain in place of Adam Bolder following his loan move to Sheffield Wednesday. Rangers closed out February with draws against Sheffield United (1–1) at home and away in the rearranged fixture with Barnsley (0–0).\nMarch\nA televised fixture at home to Stoke on 2 March saw QPR convincingly defeat the second-placed side 3–0, continuing the club's successful form against the top sides in the division. In contrast, Rangers' following game against relegation-zone Coventry City ended in a hard-fought 0–0 draw with Coventry dominating much of the play, acknowledged by the praise directed at Lee Camp for his goalkeeping performance. Similarly their next game against a struggling Sheffield Wednesday at Hillsborough saw them lose 2–1, before returning to winning ways at home to Blackpool (3–2); a result which left them 12th in the league, 8 points outside the play-offs and 7 points above the relegation zone.\nReflecting the increasingly high profile of the club, the mid-week Blackpool match was watched from the Directors' Box by Asantehene King Otumfuo Nana Osei Tutu II as well as Real Madrid's president, Ramón Calderón accompanying the club's three owners Mittal, Ecclestone and Briatore. Continuing their solid home form in which Rangers had lost just once in their previous ten games at Loftus Road and scored 22 goals, the club ran out 3–1 winners against a Scunthorpe side battling relegation. With only seven fixtures remaining, the victory meant QPR remained 12th in the Championship, 7 points from the play-off positions and 8 points clear of relegation. Continuing speculation around the level of new investment in the club fuelled rumours of the possible signing of Luís Figo, although they were promptly dismissed by the player's representatives.\nRangers travelled to play-off hopefuls Wolves on the Easter weekend (22 March) and squandered the lead three times, twice in injury time periods at the end of each half and ultimately conspiring in a 3–3 final score. On 25 March the board announced a five-year kit sponsorship deal with Lotto Sport Italia, which could be worth up to £20 million should QPR win promotion to the Premier League. The contract comes into effect for the 2008–09 season and is the most financially rewarding in the club's history. On 29 March Rangers frustrated Ipswich's play-off ambitions by holding them to a goal—less draw at Portman Road – principally as a result of Lee Camp's goalkeeping heroics. Following the match approximately 15 QPR supporters caused an affray at Manningtree station prompting three arrests.\nApril\nOn 1 April QPR fan website Vital QPR declared an exclusive that Microsoft founder Bill Gates was to invest in the club, which, despite being an apparent April Fools' Day joke, was repeated on general news and QPR fan sites. Striker Rowan Vine fractured his leg in a training incident on 3 April 2008 and was ruled out for the rest of the season. Two days later on 5 April, Rangers narrowly avoided a 2–0 home defeat to an in-form Preston side by dramatically scoring twice in injury time at the end of the second half.\nAfter a Friday which saw Briatore promote his vision of QPR as a global super brand, and with both relegation and promotion now an irrelevance QPR travelled to Hull City on 12 April to face a team who had netted five and kept two clean-sheets in their previous two games. A contentious first-half goal by Rangers was cancelled-out late in the game by Hull's Michael Turner. The 1–1 result left QPR 14th in the Championship and ten points adrift of the play-offs with just 3 games (9 points) remaining.\nRangers nevertheless continued to contribute to the fate of the Championship's promotion hopefuls, despite being unable to affect their own playoff chances, consigning fellow-Londoners Charlton Athletic to a further season in the second tier after beating them 1–0 at Loftus Road courtesy of Dexter Blackstock. A heavy defeat to Norwich at Carrow Road (0–3), where Damion Stewart was sent off after just 4&nbsp;minutes, drew April to a disappointing close.\nEnd of the season\nQPR's final game of the season on 4 May was at home against Championship title hopefuls West Brom, the team whose comprehensive defeat of Rangers in September signalled the end of John Gregory's reign. Prior to the game QPR unveiled a new badge which was introduced to signify a new era for the club, although newspapers had earlier erroneously speculated that the announcement would reveal Zinedine Zidane as the new manager. Following a red card for Martin Rowlands, Rangers fell to a 2–0 defeat and suffered the indignity of seeing the Championship title trophy presented to West Brom at Loftus Road. The result meant QPR finished 14th in the Championship table with 58 points, 12 points below the play-off zone and 6 points from relegation.\nFollowing the game Martin Rowlands was named both the club's ''Ray Jones Players' Player of the Year and the Supporters' Player of the Year. Chelsea loan player and England U21 international defender Michael Mancienne was awarded the Supporters' Young Player of the Year award. Akos Buzsaky won the Kiyan Prince Goal of the Season award for his goal against Blackpool at Loftus Road on 11 March.  Zesh Rehman was also awarded for his Community Commitment''.\nOn 8 May, QPR announced that Luigi De Canio had left the club \"by mutual consent\" and that a further announcement regarding a new manager for the following season would be made in due course.\nKit\nLe Coq Sportif continued as QPR's kit manufacturers. Retailer Cargiant continued as kit sponsors.\nSquad\n{| class=\"wikitable\" style=\"text-align:center; font-size:90%; width:90%;\"\n|-\n! style=\"background:#0066CC; color:#FFFFFF; text-align:center;\"| Shirt Number\n! style=\"background:#0066CC; color:#FFFFFF; text-align:center;\"| Position\n! style=\"background:#0066CC; color:#FFFFFF; text-align:center;\"| Nationality\n! style=\"background:#0066CC; color:#FFFFFF; text-align:center;\"|Name\n! style=\"background:#0066CC; color:#FFFFFF; text-align:center;\"|League Appearances\n! style=\"background:#0066CC; color:#FFFFFF; text-align:center;\"|League Goals\n! style=\"background:#0066CC; color:#FFFFFF; text-align:center;\"|Cup Appearances\n! style=\"background:#0066CC; color:#FFFFFF; text-align:center;\"|League.Cup Goals\n! style=\"background:#0066CC; color:#FFFFFF; text-align:center;\"|F.A.Cup Goals\n! style=\"background:#0066CC; color:#FFFFFF; text-align:center;\"|Total Appearances\n! style=\"background:#0066CC; color:#FFFFFF; text-align:center;\"|Total Goals\n|-\n|1\n|GK\n|\n|Lee Camp\n|46\n|\n|2\n|\n|\n|48\n|\n|-\n|12\n|GK\n|\n|Jake Cole\n|\n|\n|\n|\n|\n|\n|\n|-\n|15\n|GK\n|\n|Chris Goodchild\n|\n|\n|\n|\n|\n|\n|\n|-\n|18\n|GK\n|\n|Matt Pickens\n|\n|\n|\n|\n|\n|\n|\n|-\n|33\n|GK\n|\n|Reece Crowther\n|\n|\n|\n|\n|\n|\n|\n|-\n|16\n|DF\n|\n|Matthew Connolly\n|18\n|\n|1\n|\n|\n|21\n|\n|-\n|14\n|DF\n|\n|Martin Cranie\n|6\n|\n|\n|\n|\n|6\n|\n|-\n|6\n|DF\n|\n|Michael Mancienne\n|26\n|\n|1\n|\n|\n|31\n|\n|-\n|27\n|DF\n|\n|Sampsa Timoska\n|3\n|\n|\n|\n|\n|7\n|\n|-\n|3\n|DF\n|\n|Chris Barker\n|25\n|\n|1\n|\n|\n|26\n|\n|-\n|2\n|DF\n|\n|Marcus Bignot\n|\n|\n|1\n|\n|\n|3\n|\n|-\n|2\n|DF\n|\n|Damien Delaney\n|17\n|1\n|\n|\n|\n|17\n|1\n|-\n|29\n|DF\n|\n|Fitz Hall\n|14\n|\n|1\n|\n|\n|15\n|\n|-\n|25\n|DF\n|\n|Bob Malcolm\n|10\n|\n|\n|\n|\n|11\n|\n|-\n|5\n|DF\n|\n|Damion Stewart\n|35\n|5\n|1\n|\n|\n|41\n|5\n|-\n|4\n|DF\n|\n|Danny Cullip\n|5\n|\n|1\n|\n|\n|7\n|\n|-\n|28\n|DF\n|\n|Zesh Rehman\n|17\n|\n|1\n|\n|\n|22\n|\n|-\n|19\n|MF\n|\n|Simon Walton\n|1\n|\n|4\n|\n|\n|5\n|\n|-\n|4\n|MF\n|\n|Gavin Mahon\n|11\n|1\n|1\n|\n|\n|17\n|1\n|-\n|7\n|MF\n|\n|Adam Bolder\n|20\n|2\n|1\n|\n|\n|24\n|2\n|-\n|29\n|MF\n|\n|Nick Ward\n|\n|\n|1\n|\n|\n|2\n|\n|-\n|14\n|MF\n|\n|Martin Rowlands\n|43\n|6\n|2\n|\n|1\n|46\n|7\n|-\n|25\n|MF\n|\n|Hogan Ephraim\n|20\n|2\n|1\n|\n|\n|30\n|\n|-\n|21\n|MF\n|\n|John Curtis\n|3\n|\n|\n|\n|\n|4\n|\n|-\n|21\n|MF\n|\n|Kieran Lee\n|2\n|\n|\n|\n|\n|7\n|\n|-\n|37\n|MF\n|\n|Romone Rose\n|\n|\n|\n|\n|\n|1\n|\n|-\n|11\n|MF\n|\n|Gareth Ainsworth\n|16\n|2\n|1\n|\n|\n|25\n|2\n|-\n|16\n|MF\n|\n|Jason Jarrett\n|1\n|\n|\n|\n|\n|1\n|\n|-\n|32\n|MF\n|\n|Mikele Leigertwood\n|33\n|5\n|\n|\n|\n|40\n|5\n|-\n|23\n|MF\n|\n|Stefan Bailey\n|1\n|\n|1\n|\n|\n|2\n|\n|-\n|34\n|FW\n|\n|Scott Sinclair\n|8\n|1\n|1\n|\n|\n|9\n|1\n|-\n|10\n|FW\n|\n|Akos Buzsaky\n|24\n|10\n|1\n|\n|\n|28\n|10\n|-\n|8\n|FW\n|\n|Daniel Nardiello\n|4\n|\n|\n|\n|\n|8\n|\n|-\n|26\n|FW\n|\n|Rowan Vine\n|31\n|7\n|2\n|\n|\n|33\n|7\n|-\n|18\n|FW\n|\n|Stefan Moore\n|5\n|1\n|1\n|\n|\n|12\n|1\n|-\n|17\n|FW\n|\n|Patrick Agyemang\n|17\n|9\n|\n|\n|\n|18\n|9\n|-\n|30\n|FW\n|\n|Marc Nygaard\n|6\n|1\n|1\n|\n|\n|21\n|1\n|-\n|20\n|FW\n|\n|Kieron St Aimie\n|\n|\n|\n|\n|\n|1\n|\n|-\n|9\n|FW\n|\n|Dexter Blackstock\n|26\n|6\n|1\n|\n|\n|36\n|6\n|-\n|17\n|FW\n|\n|Ben Sahar\n|6\n|\n|\n|\n|\n|9\n|\n|-\n|36\n|FW\n|\n|Angelo Balanta\n|6\n|1\n|\n|\n|\n|12\n|1\n|}\nOut on loan\nTransfers\nIn\n{| class=\"wikitable\" style=\"text-align:center\"\n|-\n! Date\n! Pos.\n! Name\n! From\n! Fee\n! Source\n|-\n| 5 June 2007\n| DF\n|  Chris Barker\n|  Cardiff City\n| Free\n|\n|-\n| 27 June 2007\n| FW\n|  Daniel Nardiello\n|  Barnsley\n| Free\n|\n|-\n| 30 June 2007\n| DF\n|  John Curtis\n|  Nottingham Forest\n| Free\n|\n|-\n| 27 July 2007\n| GK\n|  Lee Camp\n|  Derby County\n| £300,000\n|\n|-\n| 27 July 2007\n| MF\n|  Simon Walton\n|  Charlton Athletic\n| £200,000\n|\n|-\n| 31 August 2007\n| MF\n|  Mikele Leigertwood\n|  Sheffield United\n| £900,000\n|\n|-\n| 2 January 2008\n| DF\n|  Matthew Connolly\n|  Arsenal\n| Undisclosed\n|\n|-\n| 2 January 2008\n| MF\n|  Hogan Ephraim\n|  West Ham United\n| Undisclosed\n|\n|-\n| 2 January 2008\n| MF\n|  Ákos Buzsáky\n|  Plymouth Argyle\n| Undisclosed\n|\n|-\n| 3 January 2008\n| FW\n|  Patrick Agyemang\n|  Preston North End\n| Undisclosed\n|\n|-\n| 4 January 2008\n| DF\n|  Fitz Hall\n|  Wigan Athletic\n| Undisclosed\n|\n|-\n| 8 January 2008\n| FW\n|  Rowan Vine\n|  Birmingham City\n| £1,000,000\n|\n|-\n| 17 January 2008\n| DF\n|  Damien Delaney\n|  Hull City\n| Undisclosed\n|\n|-\n| 7 February 2008\n| GK\n|  Matt Pickens\n| Unattached\n| Free\n|\n|}\nOut\n{| class=\"wikitable\" style=\"text-align:center\"\n|-\n! Date\n! Pos.\n! Name\n! To\n! Fee\n! Source\n|-\n| 1 July 2007\n| GK\n|  Simon Royce\n| Unattached\n| Released\n|\n|-\n| 1 July 2007\n| GK\n|  Paul Jones\n| Unattached\n| Released\n|\n|-\n| 1 July 2007\n| DF\n|  Mauro Milanese\n| Unattached\n| Released\n|\n|-\n| 1 July 2007\n| MF\n|  Armel Tchakounte\n| Unattached\n| Released\n|\n|-\n| 1 July 2007\n| MF\n|  Marc Bircham\n| Unattached\n| Released\n|\n|-\n| 1 July 2007\n| MF\n|  Steve Lomas\n| Unattached\n| Released\n|\n|-\n| 1 July 2007\n| FW\n|  Kevin Gallen\n| Unattached\n| Released\n|\n|-\n| 1 July 2007\n| FW\n|  Paul Furlong\n| Unattached\n| Released\n|\n|-\n| 19 July 2007\n| MF\n|  Lee Cook\n|  Fulham\n| £2.500,000\n|\n|-\n| November 2007\n| DF\n|  Danny Cullip\n| Unattached\n| Contract terminated\n|\n|-\n| 4 December 2007\n| MF\n|  Nick Ward\n| Unattached\n| Contract terminated\n|\n|-\n| 3 January 2008\n| MF\n|  Tommy Doherty\n|  Wycombe Wanderers\n| Free\n|\n|-\n| 15 January 2008\n| DF\n|  Marcus Bignot\n| Unattached\n| Contract terminated\n|\n|-\n| 17 January 2008\n| DF\n|  Patrick Kanyuka\n| Unattached\n| Contract terminated\n|\n|-\n| 17 January 2008\n| MF\n|  Kieron St Aimie\n| Unattached\n| Contract terminated\n|\n|-\n| 17 January 2008\n| FW\n|  Shabazz Baidoo\n| Unattached\n| Contract terminated\n|\n|-\n| 23 January 2008\n| FW\n|  Stefan Moore\n| Unattached\n| Contract terminated\n|\n|-\n| 28 January 2008\n| DF\n|  Dominic Shimmin\n| Unattached\n| Contract terminated\n|\n|-\n| January 2008\n| FW\n|  Marc Nygaard\n|  Randers\n| Undisclosed\n|\n|-\n| 7 February 2008\n| DF\n|  Sampsa Timoska\n| Unattached\n| Contract terminated\n|\n|}\nCompetitions\nLeague table\nResults\nFriendly matches\n{| class=\"wikitable plainrowheaders sortable\" style=\"text-align:center\"\n|+ Friendly match details\n|-\n!scope=\"col\"|Date\n!scope=\"col\"|Opponents\n!scope=\"col\"|Venue\n!scope=\"col\"|Result\n!scope=\"col\"|ScoreF–A\n!scope=\"col\" class=\"unsortable\"|Scorers\n!scope=\"col\"|Attendance\n!scope=\"col\" class=\"unsortable\"|\n|-\n!scope=row|\n|align=left|Wycombe Wanderers||A\n|bgcolor=#CCFFCC|W||1–0\n|Rowlands 41'||||\n|}\nFootball League Championship\n{| class=\"wikitable plainrowheaders sortable\" style=\"text-align:center\"\n|+ Championship match details\n|-\n!scope=\"col\"|Date\n!scope=\"col\"|Opponents\n!scope=\"col\"|Venue\n!scope=\"col\"|Result\n!scope=\"col\"|ScoreF–A\n!scope=\"col\" class=\"unsortable\"|Scorers\n!scope=\"col\"|Attendance\n!scope=\"col\"|Leagueposition\n!scope=\"col\" class=\"unsortable\"|\n|-\n!scope=row|\n|align=left|Bristol City\n|A\n|bgcolor=#FFFFCC|D||2–2\n|align=left|Blackstock 34' Stewart 90'\n|18,228\n|12th\n|\n|-\n!scope=row|\n|align=left|Cardiff City\n|H\n|bgcolor=#FFCCCC|L||0–2\n|align=left|\n|12,596\n|19th\n|\n|-\n!scope=row|\n|align=left|Southampton\n|H\n|bgcolor=#FFCCCC|L||0–3\n|align=left|\n|15,560\n|22nd\n|\n|-\n!scope=row|\n|align=left|Leicester City\n|A\n|bgcolor=#FFFFCC|D||1–1\n|align=left|Leigertwood 82'\n|21,893\n|23rd\n|\n|-\n!scope=row|\n|align=left|Plymouth Argyle\n|H\n|bgcolor=#FFCCCC|L||0–2\n|align=left|\n|10,850\n|23rd\n|\n|-\n!scope=row|\n|align=left|Watford\n|H\n|bgcolor=#FFFFCC|D||1–1\n|align=left|Moore 59'\n|14,240\n|23rd\n|\n|-\n!scope=row|\n|align=left|West Bromwich Albion\n|A\n|bgcolor=#FFCCCC|L||1–5\n|align=left|Ainsworth 24'\n|24,757\n|24th\n|\n|-\n!scope=row|\n|align=left|Colchester United\n|A\n|bgcolor=#FFCCCC|L||2–4\n|align=left|Ephraim 29', Vine 58'\n|5,361\n|24th\n|\n|-\n!scope=row|\n|align=left|Norwich City\n|H\n|bgcolor=#CCFFCC|W||1–0\n|align=left|Rowlands 67' pen.\n|10,514\n|24th\n|\n|-\n!scope=row|\n|align=left|Ipswich Town\n|H\n|bgcolor=#FFFFCC|D||1–1\n|align=left|Nygaard 73'\n|13,946\n|24th\n|\n|-\n!scope=row|\n|align=left|Preston North End\n|A\n|bgcolor=#FFFFCC|D||0–0\n|align=left|\n|11,407\n|24th\n|\n|-\n!scope=row|\n|align=left|Charlton Athletic\n|A\n|bgcolor=#CCFFCC|W||1–0\n|align=left|Bolder 72'\n|23,671\n|23rd\n|\n|-\n!scope=row|\n|align=left|Hull City\n|H\n|bgcolor=#CCFFCC|W||2–0\n|align=left|Ephraim 26', Leigertwood 56'\n|12,375\n|21st\n|\n|-\n!scope=row|\n|align=left|Coventry City\n|H\n|bgcolor=#FFCCCC|L||1–2\n|align=left|Buzsaky 50'\n|11,922\n|21st\n|\n|-\n!scope=row|\n|align=left|Crystal Palace\n|A\n|bgcolor=#FFFFCC|D||1–1\n|align=left|Sinclair 45'\n|17,010\n|22nd\n|\n|-\n!scope=row|\n|align=left|Sheffield Wednesday\n|H\n|bgcolor=#FFFFCC|D||0–0\n|align=left|\n|15,241\n|22nd\n|\n|-\n!scope=row|\n|align=left|Stoke City\n|A\n|bgcolor=#FFCCCC|L||1–3\n|align=left|Vine 63'\n|11,147\n|22nd\n|\n|-\n!scope=row|\n|align=left|Blackpool\n|A\n|bgcolor=#FFCCCC|L||0–1\n|align=left|\n|8,527\n|22nd\n|\n|-\n!scope=row|\n|align=left|Crystal Palace\n|H\n|bgcolor=#FFCCCC|L||1–2\n|align=left|Stewart 10'\n|13,300\n|24th\n|\n|-\n!scope=row|\n|align=left|Scunthorpe United\n|A\n|bgcolor=#FFFFCC|D||2–2\n|align=left|Buzsaky 12', 42'\n|5,612\n|24th\n|\n|-\n!scope=row|\n|align=left|Burnley\n|A\n|bgcolor=#CCFFCC|W||2–0\n|align=left|Stewart 60', Vine 90'\n|10,522\n|23rd\n|\n|-\n!scope=row|\n|align=left|Wolverhampton Wanderers\n|H\n|bgcolor=#FFFFCC|D||0–0\n|align=left|\n|13,482\n|24th\n|\n|-\n!scope=row|\n|align=left|Colchester United\n|H\n|bgcolor=#CCFFCC|W||2–1\n|align=left|Buzsaky 27', 52'\n|12,464\n|21st\n|\n|-\n!scope=row|\n|align=left|Plymouth Argyle\n|A\n|bgcolor=#FFCCCC|L||1–2\n|align=left|Ainsworth 20'\n|16,502\n|23rd\n|\n|-\n!scope=row|\n|align=left|Watford\n|A\n|bgcolor=#CCFFCC|W||4–2\n|align=left|Rowlands 13' pen., 40', Stewart 29', Buzsaky 80'\n|18,698\n|20th\n|\n|-\n!scope=row|\n|align=left|Leicester City\n|H\n|bgcolor=#CCFFCC|W||3–1\n|align=left|Stewart 15', Bolder 26', Blackstock 56'\n|13,326\n|18th\n|\n|-\n!scope=row|\n|align=left|Sheffield United\n|A\n|bgcolor=#FFCCCC|L||1–2\n|align=left|Agyemang 45'\n|28,894\n|20th\n|\n|-\n!scope=row|\n|align=left|Barnsley\n|H\n|bgcolor=#CCFFCC|W||2–0\n|align=left|Agyemang 5', Vine 45'\n|16,197\n|17th\n|\n|-\n!scope=row|\n|align=left|Cardiff City\n|A\n|bgcolor=#FFCCCC|L||1–3\n|align=left|Ephraim 76'\n|13,602\n|19th\n|\n|-\n!scope=row|\n|align=left|Bristol City\n|H\n|bgcolor=#CCFFCC|W||3–0\n|align=left|Agyemang 18', 33', Buzsaky 63'\n|16,502\n|18th\n|\n|-\n!scope=row|\n|align=left|Southampton\n|A\n|bgcolor=#CCFFCC|W||3–2\n|align=left|Rowlands 38', Agyemang 45', 60'\n|22,505\n|15th\n|\n|-\n!scope=row|\n|align=left|Burnley\n|H\n|bgcolor=#FFCCCC|L||2–4\n|align=left|Mahon 14', Agyemang 30'\n|13,410\n|17th\n|\n|-\n!scope=row|\n|align=left|Sheffield United\n|H\n|bgcolor=#FFFFCC|D||1–1\n|align=left|Balanta 19'\n|15,383\n|16th\n|\n|-\n!scope=row|\n|align=left|Barnsley\n|A\n|bgcolor=#FFFFCC|D||0–0\n|align=left|\n|9,019\n|15th\n|\n|-\n!scope=row|\n|align=left|Stoke City\n|H\n|bgcolor=#CCFFCC|W||3–0\n|align=left|Leigertwood 12', 21', Buzsaky 56'\n|13,398\n|15th\n|\n|-\n!scope=row|\n|align=left|Coventry City\n|A\n|bgcolor=#FFFFCC|D||0–0\n|align=left|\n|15,225\n|15th\n|\n|-\n!scope=row|\n|align=left|Sheffield Wednesday\n|A\n|bgcolor=#FFCCCC|L||1–2\n|align=left|Delaney 15'\n|18,555\n|15th\n|\n|-\n!scope=row|\n|align=left|Blackpool\n|H\n|bgcolor=#CCFFCC|W||3–2\n|align=left|Buzsaky 11', Vine 40', Rowlands 47'\n|11,538\n|12th\n|\n|-\n!scope=row|\n|align=left|Scunthorpe United\n|H\n|bgcolor=#CCFFCC|W||3–1\n|align=left|Rowlands 43' pen., Agyemang 79', Vine 90'\n|14,499\n|12th\n|\n|-\n!scope=row|\n|align=left|Wolverhampton Wanderers\n|A\n|bgcolor=#FFFFCC|D||3–3\n|align=left|Buzsaky 28', Blackstock 49' pen., Leigertwood 79'\n|24,290\n|14th\n|\n|-\n!scope=row|\n|align=left|Ipswich Town\n|A\n|bgcolor=#FFFFCC|D||0–0\n|align=left|\n|24,517\n|15th\n|\n|-\n!scope=row|\n|align=left|Preston North End\n|H\n|bgcolor=#FFFFCC|D||2–2\n|align=left|Ainsworth 90', Blackstock 90'\n|14,966\n|15th\n|\n|-\n!scope=row|\n|align=left|Hull City\n|A\n|bgcolor=#FFFFCC|D||1–1\n|align=left|Blackstock 14'\n|22,468\n|14th\n|\n|-\n!scope=row|\n|align=left|Charlton Athletic\n|H\n|bgcolor=#CCFFCC|W||1–0\n|align=left|Blackstock 15'\n|17,035\n|14th\n|\n|-\n!scope=row|\n|align=left|Norwich City\n|A\n|bgcolor=#FFCCCC|L||0–3\n|align=left|\n|25,497\n|14th\n|\n|-\n!scope=row|\n|align=left|West Bromwich Albion\n|H\n|bgcolor=#FFCCCC|L||0–2\n|align=left|\n|18,309\n|14th\n|\n|}\nFA Cup\n{| class=\"wikitable plainrowheaders\" style=\"text-align:center\"\n|+ FA Cup match details\n|-\n!scope=\"col\"|Round\n!scope=\"col\"|Date\n!scope=\"col\"|Opponent\n!scope=\"col\"|Venue\n!scope=\"col\"|Result\n!scope=\"col\"|ScoreF–A\n!scope=\"col\"|Scorers\n!scope=\"col\"|Attendance\n!scope=\"col\"|\n|-\n!scope=row|Third round\n|align=left|5 January 2008\n|align=left|Chelsea||A\n|bgcolor=#FFCCCC|L||0–1||||41,289||\n|}\nLeague Cup\n{| class=\"wikitable plainrowheaders\" style=\"text-align:center\"\n|+ League Cup match details\n|-\n!scope=\"col\"|Round\n!scope=\"col\"|Date\n!scope=\"col\"|Opponent\n!scope=\"col\"|Venue\n!scope=\"col\"|Result\n!scope=\"col\"|ScoreF–A\n!scope=\"col\"|Scorers\n!scope=\"col\"|Attendance\n!scope=\"col\"|\n|-\n!scope=row|First round\n|align=left|14 October 2007\n|align=left|Leyton Orient||H\n|bgcolor=#FFCCCC|L||1–2||Rowlands 68'||5,260||\n|}\nStatistics\nGoalscorers\n{| class= border=\"2\" cellpadding=\"4\" cellspacing=\"0\" style=\"text-align:center; margin: 1em 1em 1em 0; background: #f9f9f9; border:1px #aaa solid; border-collapse: collapse; font-size: 95%;\"\n|-\n!Rank\n!Player\n!Position\n!Championship\n!League Cup\n!FA Cup\n!Total\n|-\n|align=center|1||align=left| Ákos Buzsáky||align=center|MF||align=center|10||align=center|0||align=center|0||align=center|10\n|-\n|align=center|2||align=left| Patrick Agyemang||align=center|FW||align=center|9||align=center|0||align=center|0||align=center|9\n|-\n|align=center|3||align=left| Martin Rowlands||align=center|MF||align=center|6||align=center|1||align=center|0||align=center|7\n|-\n|align=center|4||align=left| Rowan Vine||align=center|FW||align=center|6||align=center|0||align=center|0||align=center|6\n|-\n|align=center|=||align=left| Dexter Blackstock||align=center|FW||align=center|6||align=center|0||align=center|0||align=center|6\n|-\n|align=center|6||align=left| Damion Stewart||align=center|FW||align=center|5||align=center|0||align=center|0||align=center|5\n|-\n|align=center|=||align=left| Mikele Leigertwood||align=center|MF||align=center|5||align=center|0||align=center|0||align=center|5\n|-\n|align=center|8||align=left| Gareth Ainsworth||align=center|MF||align=center|3||align=center|0||align=center|0||align=center|3\n|-\n|align=center|9||align=left| Hogan Ephraim||align=center|MF||align=center|2||align=center|0||align=center|0||align=center|2\n|-\n|align=center|=||align=left| Adam Bolder||align=center|MF||align=center|2||align=center|0||align=center|0||align=center|2\n|-\n|align=center|11||align=left| Stefan Moore||align=center|FW||align=center|1||align=center|0||align=center|0||align=center|1\n|-\n|align=center|=||align=left| Marc Nygaard||align=center|FW||align=center|1||align=center|0||align=center|0||align=center|1\n|-\n|align=center|=||align=left| Scott Sinclair||align=center|MF||align=center|1||align=center|0||align=center|0||align=center|1\n|-\n|align=center|=||align=left| Gavin Mahon||align=center|MF||align=center|1||align=center|0||align=center|0||align=center|1\n|-\n|align=center|=||align=left| Ángelo Balanta||align=center|MF||align=center|1||align=center|0||align=center|0||align=center|1\n|-\n|align=center|=||align=left| Damien Delaney||align=center|DF||align=center|1||align=center|0||align=center|0||align=center|1\n|-\n|align=center; colspan=\"3\"|TOTAL||align=center|60||align=center|1||align=center|0||align=center|61\n|}\nClean sheets\n{| class=\"wikitable\"\n|-\n!Rank\n!Player\n!Position\n!Championship\n!League Cup\n!FA Cup\n!Total\n|-\n|align=center| 1\n| Lee Camp\n|align=center | GK\n|align=center|14\n|align=center|0\n|align=center|0\n|align=center|14\n|-\n|}\nReferences\nNotes"
    }
  ]
}