{
  "content": [
    {
      "type": "text",
      "text": "# 2007 Mauritanian presidential election\n\n|title = President\n|before_election = Ely Ould Mohamed Vall\n|before_party = Independent (politician)\n|after_election = Sidi Ould Cheikh Abdallahi\n|after_party = Independent (politician)\n}}\nPresidential elections were held in Mauritania on 11 March 2007. As no candidate received a majority of the votes, a second round was held on 25 March between the top two candidates, Sidi Ould Cheikh Abdallahi and Ahmed Ould Daddah. Abdallahi won the second round with about 53% of the vote and took office in April.\nThe 2007 election followed a military coup in August 2005 that ousted long-time President Maaouya Ould Sid'Ahmed Taya. The head of the junta, Ely Ould Mohamed Vall, said that he and the other members of the junta would not run for president in the election, which marks the last stage of the transition to civilian rule.\nCampaign\nFirst round\n21 candidates registered to run for president of which 19 were approved to contest the election.[http://www.thepoint.gm/headlines1744.htm \"19 eye Mauritanian election\"] , The Point (The Gambia), March 2, 2007. Sidi Ould Cheikh Abdallahi, who served as a minister under Moktar Ould Daddah during the 1970s and briefly under Ould Taya in the 1980s, announced his candidacy for president on July 4, 2006. Ba Mamadou Alassane, President of the Party for Freedom, Equality and Justice (PLEJ), announced his candidacy on July 19, 2006. The former head of the Central Bank, Zeine Ould Zeidane, announced his candidacy on December 18, 2006. Dahane Ould Ahmed Mahmoud announced his candidacy on December 23. Former military ruler Mohamed Khouna Ould Haidalla, who came in second place, behind Taya, in the 2003 presidential election, announced his candidacy on December 27.  On January 2, 2007, Mohamed Ould Maouloud, President of the Union of the Forces of Progress, was designated as his party's candidate. Former coup attempt leader Saleh Ould Hanenna was chosen by his party, the Mauritanian Party for Union and Change (HATEM), as its candidate on January 9. Ahmed Ould Daddah, the half-brother of Moktar Ould Daddah and the leader of the Rally of Democratic Forces — part of the Coalition of Forces for Democratic Change, which took a large portion of seats in the November–December 2006 parliamentary election — announced his candidacy on January 12. Another former coup attempt leader, Mohamed Ould Cheikhna, announced his candidacy on January 14. On January 20, Messaoud Ould Boulkheir, President of the People's Progressive Alliance (APP), announced his candidacy. Chbih Ould Cheikh Melainine announced on February 3 that he was withdrawing his candidacy and backing Haidalla, but he was not allowed to officially withdraw his candidacy, although according to Melainine he had requested the withdrawal two days before the February 4 deadline.\nAbdallahi, who ran as an independent, was viewed by some as the candidate representing the ruling junta, and in January he received the backing of an important coalition of 18 parties composed of former supporters of Taya. Abdallahi denied being the junta's candidate. The Coalition of Forces for Democratic Change sent a letter to various international organizations, including the African Union, accusing the junta of \"running an open campaign in favour of one candidate\" through various methods, including asking influential people in the country to back their favored candidate, although the letter did not directly name Abdallahi as this candidate.\nVall suggested at one point the possibility that, with blank ballots included in the total, no candidate would win a majority of the vote in two rounds, in which case new elections would have to be held. This caused a controversy, and the law was changed so that blank ballots would not count towards the total.\nA record 1.1 million of the population of 3.2 million people registered to vote. Prior to the election, the frontrunners were considered to be Daddah, Zeidane and Abdallahi.\nSecond round\nAfter no candidate received a majority of the vote in the first round and Sidi Ould Cheikh Abdallahi and Ahmed Ould Daddah advanced to the second round, on March 14, the Islamist \"Réformateurs centristes\", which supported Hanenna in the first round, backed Daddah for the second round. Hanenna also backed Daddah, as did the candidates Ba Mamadou Alassane, Mohamed Ould Maouloud, and Ibrahima Sarr.\nAbdallahi received the support of the third and fourth place candidates from the first round: on March 17, Zeidane announced his support for Abdallahi, and on March 19, Boulkheir also announced his support. Boulkheir's support came in spite of the fact that he was part of the Coalition of the Forces for Democratic Change along with Daddah. Abdallahi also received the support of several minor candidates: Dahane Ould Ahmed Mahmoud, Mohamed Ahmed Ould Babahmed Ould Salihi, Moulaye El Hacen Ould Jiyed, Isselmou Ould Mustapha, and Mohamedou Ould Ghoulam Ould Sidaty.\nA televised debate between Abdallahi and Daddah was held on March 22. It was conducted in a non-confrontational style, with the candidates each explaining their positions. The candidates advocated similar policies, including measures against slavery, which persists in the country.\nAbdallahi said that it would be easier for him to accomplish things as president because his supporters would constitute a parliamentary majority. He also said that if he won, he would be willing to include Daddah in the government, as long as his allies agreed.\nResults\nOn March 12, with about 26% of the vote counted, Abdallahi and Daddah were reported to both have about 25% of the vote; Zeidane was in third place with about 13%. With 86% of the vote counted, Abdallahi led with 22.76% of the vote, while Daddah had 21.46% and Zeidane was third. Later on March 12, Interior Minister Mohamed Ahmed Ould Mohamed Lemine announced the provisional results and said that Abdallahi and Daddah would compete in a second round on March 25. Final results were proclaimed by the Constitutional Council on March 15: Abdallahi received 24.80% of the first round vote, while Daddah received about 20.69% and Zeidane received about 15.28%. Messaoud Ould Boulkheir was fourth with about 9.79% of the vote, followed by Ibrahima Moctar Sarr with 7.95%. There were 794,979 voters out of the 1,133,152 who were registered, a turnout rate of 70.16%.\n|party7=Union of the Forces of Progress|votes7=30254|color7=#FFA500\n|cand8=Dahane Ould Ahmed Mahmoud|party8=Independent|votes8=15326\n|cand9=|party9=Independent|votes9=14200\n|cand10=Mohamed Khouna Ould Haidalla|party10=Independent|votes10=12813\n|cand11=|party11=Independent|votes11=10868\n|cand12=Ba Mamadou Alassane|party12=Party for Liberty, Equality and Justice|votes12=4076|colour12=#FEFF01\n|cand13=Mohamed Ahmed Ould Baba Ahmed Ould Salihi|party13=Independent|votes13=2779\n|cand14=Moulaye El Hacen Ould Jeid|party14=Mauritanian Party for Renewal and Concord|votes14=2535\n|cand15=Ch'bih Ould Cheikh Melainine|party15=Independent|votes15=2111|color15=#FDD003\n|cand16=Rajel dit Rachid Moustapha|party16=Mauritanian Party for Renewal|votes16=1977\n|cand17=Sidi Ould Isselmou Ould Mohamed Ahid|party17=Independent|votes17=1784\n|cand18=Isselmou Ould El Moustapha|party18=Party of Democratic Convergence|votes18=1779\n|cand19=Mohamed Ould Mohamed El Moctar Ould Tomi|party19=Independent|votes19=1465\n|cand20=Mohamed Ould Ghoulam Ould Sidaty|party20=Independent|votes20=652\n|invalid=54129\n|invalid2=57340\n|electorate=1133152\n|electorate2=1132877\n|source=[http://africanelections.tripod.com/mr.html African Elections Database]\n}}\nFirst round\nBy wilaya\n{| class=\"wikitable sortable\" style=text-align:right\n!Wilaya\n!Cheikh Abdallahi\n!Daddah\n!Zeidane\n!Boulkheir\n!Sarr\n!Hannena\n!Maouloud\n|-\n| align=\"left\"| Adrar\n| 32.59\n| 8.98\n| 30.66\n| 7.18\n| 1.50\n| 3.26\n| 1.96\n|-\n| align=\"left\"| Assaba\n| 31.40\n| 15.93\n| 21.49\n| 5.30\n| 0.79\n| 7.98\n| 7.32\n|-\n| align=\"left\"| Brakna\n| 35.26\n| 19.45\n| 4.21\n| 7.27\n| 14.58\n| 6.12\n| 3.15\n|-\n| align=\"left\"| Dakhlet Nouadhibou\n| 10.50\n| 16.41\n| 17.45\n| 19.79\n| 12.06\n| 7.05\n| 2.38\n|-\n| align=\"left\"| Gorgol\n| 29.14\n| 7.34\n| 8.65\n| 13.01\n| 19.56\n| 1.62\n| 8.35\n|-\n| align=\"left\"| Guidimaka\n| 29.46\n| 8.03\n| 12.95\n| 14.86\n| 12.92\n| 4.61\n| 8.12\n|-\n| align=\"left\"| Hodh Ech Chargui\n| 35.85\n| 10.42\n| 29.47\n| 4.82\n| 0.42\n| 7.28\n| 2.10\n|-\n| align=\"left\"| Hodh El Gharbi\n| 30.86\n| 9.65\n| 22.56\n| 2.80\n| 0.41\n| 20.63\n| 3.00\n|-\n| align=\"left\"| Inchiri\n| 27.90\n| 24.23\n| 21.42\n| 4.39\n| 3.00\n| 3.41\n| 1.50\n|-\n| align=\"left\"| Nouakchott\n| 10.28\n| 23.80\n| 14.38\n| 16.05\n| 13.29\n| 8.98\n| 3.27\n|-\n| align=\"left\"| Tagant\n| 39.54\n| 12.15\n| 15.10\n| 4.69\n| 0.40\n| 2.16\n| 16.85\n|-\n| align=\"left\"| Tiris Zemmour\n| 18.89\n| 11.37\n| 15.20\n| 16.97\n| 7.22\n| 6.16\n| 3.65\n|-\n| align=\"left\"| Trarza\n| 24.65\n| 52.67\n| 5.47\n| 5.17\n| 2.43\n| 4.97\n| 0.91\n|- class=sortbottom\n| colspan=8 align=\"left\"|Source: [http://www.electoralgeography.com/en/countries/m/mauritania/2007-presidential-election-mauritania.html Electoral Geography]\n|}\nAftermath\nFollowing the election, on March 26, Interior Minister Mohamed Ahmed Ould Mohamed Lemine declared Abdallahi the winner, saying that he won 52.85% of the vote. Abdallahi won 10 out of the country's 13 regions; Daddah won in Nouakchott, Inchiri Region, and Trarza Region. Turnout was about 67.5%. Daddah accepted the results and congratulated Abdallahi on his victory. The results were confirmed on 29 March 2007.\nAbdallahi was sworn in on April 19. He named Zeidane as prime minister the next day, and Boulkheir was elected as president of the National Assembly on April 26.\nSee also\n*2008 Mauritanian coup d'état\nReferences\nFurther reading\n*\n*"
    }
  ]
}