{
  "content": [
    {
      "type": "text",
      "text": "# 2007 Manly Warringah Sea Eagles season\n\nThe 2007 Manly Warringah Sea Eagles season was the 58th in the club's history. They competed for the National Rugby League's 2007 Telstra Premiership and finished the regular season in 2nd (out of 16) place. The Sea Eagles went on to reach the 2007 NRL grand final which they lost to minor premiers, the Melbourne Storm (who were later stripped of this title after being found guilty of salary cap breaches).\nSeason summary\nIn June English club Warrington Wolves signed 30-year-old Manly winger Chris Hicks on a two-year deal from the following season.\nManly only lost six matches in the 2007 season. Their 50-16 mauling of Newcastle ensured they would finish in the top two. Throughout the season they were the only club chasing Melbourne (whom they beat in round 11) for the minor premiership.\nAfter defeating North Queensland at the Sydney Football Stadium 28–6, Manly played in their 15th grand final against Melbourne. Manly were beaten 34–8 by the Storm on 30 September at Telstra Stadium. Melbourne was later stripped of the 2007 title for salary cap breaches. Manly were not recognised as the 2007 premiers (the premierships for 2007 and 2009 being declared null and void).\nOn Sunday 30th Sept 2007, Manly lost the grand final to Melbourne Storm. This title has since been stripped from the Storm; this had led to calls for Manly to be given the 2007 title, however the NRL have refused. The Sea Eagles however did win the 2008 premiership, and, given that the Storm also lost its 2009 title, Manly have argued they should be the defending premiers in 2010, but again the NRL have refused to acknowledge this.\nLadder\nPlayers\n{| class=\"wikitable sortable\" width=\"65%\" style=\"font-size:90%\"\n|- bgcolor=\"#efefef\"\n|- bgcolor=\"#efefef\"\n|-\n|+ Current  to Round 19, 2007\n! Player!! Appearances !! Tries !! Goals !! F Goals !! Points\n|}\nPlayer movements\nGains\n{| class=\"wikitable\" width=\"65%\" style=\"font-size:90%\"\n|- bgcolor=\"#efefef\"\n! colspan=11 | 2007 Signings/Transfers\n|- bgcolor=\"#efefef\"\n|-\n|-\n! Player !! Previous club !! Years signed !! Until the end of\n|}\nLosses\n{| class=\"wikitable\" width=\"65%\" style=\"font-size:90%\"\n|- bgcolor=\"#efefef\"\n! colspan=11 | Losses\n|- bgcolor=\"#efefef\"\n|-\n! Player !! Notes\n|}\nRe-Signings\n{| class=\"wikitable\" width=\"65%\" style=\"font-size:90%\"\n|- bgcolor=\"#efefef\"\n! colspan=11 | Re-Signings\n|- bgcolor=\"#efefef\"\n|}\nReferences"
    }
  ]
}