{
  "content": [
    {
      "type": "text",
      "text": "# 2008 United States presidential election in Missouri\n\n| map_size = 300px\n| map_caption =\nMcCain\nObama\nTie/No Data\n| title = President\n| before_election = George W. Bush\n| before_party = Republican Party (United States)\n| after_election = Barack Obama\n| after_party = Democratic Party (United States)\n}}\nThe 2008 United States presidential election in Missouri was held on November 4, 2008, and was part of the 2008 United States presidential election, which took place throughout all 50 states and D.C. Voters chose 11 representatives, or electors to the Electoral College, who voted for president and vice president.\nMissouri was won by Republican nominee John McCain by 3,903 votes, a 0.14% margin of victory. Prior to the election, most news organizations considered this state a toss-up, or a swing state. On election day, Missouri was the closest state in 2008, with most news organizations not calling the state until two weeks after the election. A high turnout of voters in the GOP strongholds of Greene County (Springfield) and St. Charles County, combined with Democrat Barack Obama's lackluster performance in the more rural parts of the state, gave the edge to McCain. Since the margin of victory was less than 1%, Obama could have legally called for a recount at no expense to himself, but he ultimately chose not to do so. This was likely because he had already received enough electoral votes to win the presidency which rendered Missouri's 11 electoral votes inconsequential and a recount would have been unlikely to change the outcome.\nObama became the first Democrat to ever win the presidency without carrying Missouri, and McCain the first Republican to carry Missouri without winning the presidency.\nCombined with the state's swing to the right in 2000 and 2004 and the further bleeding of Democratic support in white, rural areas, this would be the last time when Missouri was seriously contested and considered to be a swing/bellwether state. The state continued moving deeper and safer into the Republican side four years later and onward, and as such, this is the most recent election when the Republican candidate won less than 50% of the state's popular vote. As of 2024, this is the last time that Iron, Jefferson, Washington, Ste. Genevieve, and Buchanan Counties voted for the Democratic candidate. Despite losing, Obama's 1,441,911 votes are the most received by a Democratic presidential candidate in the state's history.\nPrimaries\n* 2008 Missouri Democratic presidential primary\n* 2008 Missouri Republican presidential primary\nCampaign\nWith the advent of the September financial crisis, Obama began to look viable. John McCain's lead diminished and then disappeared; for several weeks Obama even led Missouri polls. Obama started visiting Republican-leaning states, including Missouri. In one of the more memorable trips of the campaign, he drew crowds of 75,000 at Kansas City and 100,000 at St. Louis. However, John McCain's campaign managed to close the gap and most polls showed a dead tie on and before Election Day.\nAlthough seven of Missouri's eight neighboring states offered the option of early voting, the option was not available in Missouri. Election results must go through a certification process before they are official; local election officials had until November 18 to verify their results and process the provisional ballots cast throughout Missouri.\nPredictions\nThere were 16 news organizations who made state-by-state predictions of the election. Here are their last predictions before election day:\n{| class=\"wikitable\"\n|+\n!Source\n!Ranking\n|-\n|D.C. Political Report\n|\n|-\n|Cook Political Report\n|\n|-\n|The Takeaway\n|\n|-\n|Electoral-vote.com\n|\n|-\n|The Washington Post|Washington Post\n|\n|-\n|Politico\n|\n|-\n|RealClearPolitics\n|\n|-\n|FiveThirtyEight\n|\n|-\n|CQ Politics\n|\n|-\n|The New York Times\n|\n|-\n|CNN\n|\n|-\n|NPR\n|\n|-\n|MSNBC\n|\n|-\n|Fox News\n|\n|-\n|Associated Press\n|\n|-\n|Rasmussen Reports\n|\n|}\nPolling\nThroughout the general election, McCain consistently won the state's pre-election polls, even reaching above 50% in some of them. In the fall campaign, polls were back and forth with both. In the last few weeks when Obama was having the momentum, the final 5 polls taken in the state were all a tie.\nHere are the final polls in the state:\n{| class=\"wikitable\"\n|- valign=bottom\n! Poll Source\n! Date administered\n! Democrat\n! %\n! Republican\n! %\n! Lead Margin\n|-\n|Reuters/Zogby\n|October 31-November 3, 2008\n| Barack Obama\n| 48.8%\n| John McCain\n| 48.8%\n|\n|-\n|Rasmussen Reports/Fox News[https://web.archive.org/web/20080912062353/http://www.rasmussenreports.com/public_content/politics/election_20082/2008_presidential_election/missouri/election_2008_missouri_presidential_election Rasmussen Reports/Fox News]\n|November 2, 2008\n| Barack Obama\n| 49%\n| John McCain\n| 49%\n|\n|-\n|Public Policy Polling\n|October 31 – November 2, 2008\n| Barack Obama\n| 49.4%\n| John McCain\n| 48.6%\n|style=\"background:#3399FF\" |\n|-\n|Reuters/Zogby\n|October 30-November 2, 2008\n| Barack Obama\n| 47.4%\n| John McCain\n| 45.7%\n|style=\"background:#3399FF\" |\n|-\n|Survey USA\n|October 30 – November 2, 2008\n| Barack Obama\n| 48%\n| John McCain\n| 48%\n|\n|}\nFundraising\nJohn McCain raised a total of $2,904,162 in the state. Barack Obama raised $4,999,812.\nAdvertising and visits\nObama and his interest groups spent $11,323,706. McCain and his interest groups spent $9,428,559.\nThe Democratic ticket visited the state 13 times throughout the general election. The Republican ticket visited here 14 times.\n'''McCain's Visits:\n* June 18: Springfield\n* July 15: St. Louis\n* July 17: Kansas City\n* July 30: Kansas City\n* August 31: St. Louis\n* October 8: Vice presidential nominee Sarah Palin campaigned in Cape Girardeau at the Show-Me Center on the campus of Southeast Missouri State University in an effort to reach out to the base of the GOP.\nObama's Visits:'''\n* May 13: During the course of the ongoing Democratic presidential primary, Obama visited Thorngate factory in Cape Girardeau in Southeast Missouri alongside U.S. Senator Claire McCaskill to speak to a group of factory workers. These blue-collar, working-class whites were a voting bloc that strongly backed Hillary Clinton throughout the primary.\n* June 9 – 10: St. Louis\n* June 30: Independence\n* July 5: St. Louis\n* July 7: St. Louis (unscheduled; plane maintenance)\n* July 30: Springfield, Rolla, Union\n* August 25, 26: Kansas City\n* October 18: St. Louis\n* October 30: Columbia\n* November 1: Springfield\nAnalysis\nFor the better part of a century, Missouri was considered to be the nation's prime bellwether state. From 1904 to 2004, Missouri voted for the winner in every presidential election except 1956, when the state narrowly voted for Democrat Adlai Stevenson of neighboring Illinois over incumbent Republican President Dwight D. Eisenhower. In recent years, however, it has trended Republican. Although Bill Clinton of neighboring Arkansas won the state with ease during both of his elections in 1992 and 1996, Al Gore and John Kerry considered Missouri a lost cause and did not campaign much there. Despite being from neighboring Illinois, Obama too initially put the state as a secondary concern in relation to other swing states such as Ohio and Virginia where he thought he had a better chance. As his lead diminished in the summer months, he and McCain moved the campaign to more Democratic-friendly states, as McCain maintained a comfortable polling lead in Missouri. Similar hypothetical general match-up polls taken between McCain and Hillary Clinton, however, showed Clinton always leading in Missouri.\nA record 2.9 million Missourians, or 69% of eligible voters, cast their ballots in the general election, about 200,000 more than the previous record in the 2004 elections. On Election Day, McCain clung to a tiny lead, with absentee and provisional ballots yet to be counted. By November 19, McCain led Obama by 1,445,813–1,441,910 votes, or approximately 0.14% of the total popular vote in Missouri. CNN called the state for McCain that day. The 2008 election was only the second time in 104 years that it had not voted for the winner of the general election. Missouri was, however, the closest state of the 2008 election.\nThe Democratic base of Missouri rests in its two largest cities in the west and east – Kansas City and St. Louis, respectively. Obama did extremely well here, winning 83.55% of the vote in St. Louis City and 78.4% in Kansas City. Obama was already a familiar face to St. Louis-area voters, since the St. Louis metro area spills into Illinois. McCain narrowly won the areas in Jackson County outside Kansas City with 49.9% to Obama's 48.8%, but Obama carried the county with 62.14% of the vote due to his strong performance in Kansas City. These two cities had contributed to close margins for elections in Missouri, and 2008 was no different, as these cities frequently create large margins for Democrats.\nOne of the most important counties in the state for either candidate in Missouri elections is St. Louis County. The county has a population of more than 1 million, and had delivered victories for Democrats since 1992, but by relatively small margins of 6 points in 2000 and 9 points in 2004. Obama outperformed both Gore and Kerry, delivering a 20-point margin for Obama. St. Louis County (where he also won 59.50% of the vote), combined with his landslide wins in Kansas City and St. Louis gave him a 300,000 margin over McCain.\nSt. Louis County had been growing increasingly more of a Democratic stronghold, the last time a Republican was able to win the county was in 1988. As reflected nationally, suburban counties practiced a moderate form of conservatism, and had rejected the growing social conservatism of the Republican party. The county, the most affluent in the state, is largely suburban with a racially diverse population. His victory was the strongest performance for a Democrat in the county since 1964. Obama was also able to carry Boone County, home to the large college town of Columbia (Missouri's fifth-largest city and home of the state's flagship University of Missouri campus), and Jefferson County, which consists of the southern St. Louis suburbs such as Arnold and Festus. George W. Bush narrowly won Jefferson County in 2004 over John Kerry.\nHowever, Obama was unable to substantially improve on Kerry's performance in rural Missouri, which is largely responsible for Missouri's Republican tilt. During the 2008 Missouri Democratic Primary, every rural county in Missouri (with the exception of Nodaway County, home of Northwest Missouri State University in Maryville in Northwestern Missouri), strongly backed Hillary Clinton, often by more than two-to-one margins. Many, if not all, of these counties that Clinton won in the Missouri Primary ended up voting for McCain in the general election. A number of these counties are ancestrally Democratic. However, these counties are very similar in character to Yellow Dog Democrat areas in neighboring Tennessee, Arkansas and Oklahoma. The Democrats in these areas are nowhere near as liberal as their counterparts in St. Louis and Kansas City, and much like their counterparts in neighboring Tennessee and Arkansas, had become increasingly willing to support Republicans at the national level.\nObama lost by an almost two-to-one margin in Southwest Missouri, a Republican stronghold for the better part of a century. This region is entrenched in the Bible Belt and embedded with deep pockets of social conservatives that includes Springfield and Joplin. Even Bill Clinton could not win Southwest Missouri in 1992 despite the fact that he won the state by double digits. Rural Northern Missouri voted against Obama by a three-to-two margin; this region warmly supported Bill Clinton in both of his bids. Obama also lost much of rural Southeast Missouri. Unlike Northern and Southwest Missouri, Southeast Missouri, which strongly backed Bill Clinton both times, is more Democratic at the local and state levels. The region takes in the Lead Belt, the Bootheel and the Ozark Plateau and includes the largest city of Cape Girardeau, a booming college town but also a conservative, upper-middle class community that votes overwhelmingly Republican. Southeast Missouri is socially conservative but economically liberal, consistently electing Democrats at the local and state levels. While Obama ran even in the area southwest of St. Louis, he did worse than John Kerry in the Bootheel. Obama was, however, able to pick up two counties in Southeast Missouri: Washington County (by a margin of five votes) and Iron County. Both counties are predominantly rural and White but are some of the most impoverished counties in the state that are controlled by Democrats at the local and state levels. Both counties gave Hillary Clinton over 70% of the vote in the Missouri Primary as well.\nObama was allowed to request a recount under state law since preliminary results showed a difference of less than 1% of the votes. The request would have had to be granted by the state. However, since Obama already won the election and Missouri would not have affected the outcome, he ultimately did not request one. As of 2024, this is the closest a Northern Democrat has come to winning Missouri since John F. Kennedy of Massachusetts did so in 1960, as the previous three Democratic presidential candidates to win the state were all from the South (Lyndon B. Johnson of Texas, Jimmy Carter of Georgia, and Bill Clinton of Arkansas). This was the first presidential election that a Democrat won without winning the state of Missouri, a feat Obama would repeat in 2012, as well as his former running mate Joe Biden in 2020.\nDuring the same election, Democratic Attorney General Jay Nixon defeated U.S. Representative Kenny Hulshof in a landslide for the Governor's Mansion. Incumbent Republican Governor Matt Blunt did not seek a second term. Nixon performed extremely well in rural Missouri and clinched 58.40% of the total statewide vote compared to Hulshof's 39.49% to become Governor of Missouri. Republicans were, however, able to hold on to the U.S. House seat in Missouri's 9th Congressional District that was vacated by Hulshof in his unsuccessful gubernatorial bid. Republican Blaine Luetkemeyer narrowly defeated Democrat Judy Baker by less than 3 percentage points, in large part due to McCain winning it by 11 points. At the state level, Democrats picked up three seats in the Missouri House of Representatives but Republicans expanded their majority in the Missouri Senate, picking up three seats here. Furthermore, upon the 2008 election, Democrats controlled all statewide offices but one; Lieutenant Governor Peter Kinder was the sole Republican. Democrats held on to the office of Attorney General that was vacated by Governor-elect Nixon; Democrat Chris Koster defeated Republican Mike Gibbons 52.83% to 47.17%. Democrats also picked up the office of State Treasurer that was vacated by Republican Sarah Steelman in her unsuccessful bid for the GOP gubernatorial nomination. Democrat Clint Zweifel defeated Republican Brad Lager 50.47% to 47.14%.\nResults\n{| class=\"wikitable\" style=\"font-size: 95%;\"\n|-\n! colspan=\"7\" | 2008 United States presidential election in Missouri\n|-\n! colspan=\"2\" style=\"width: 15em\" |Party\n! style=\"width: 17em\" |Candidate\n! style=\"width: 17em\" |Running mate\n! style=\"width: 5em\" |Votes\n! style=\"width: 7em\" |Percentage\n! style=\"width: 5em\" |Electoral votes\n|-\n! style=\"background-color:#FF3333; width: 3px\" |\n| style=\"width: 130px\" | Republican\n| John McCain\n| Sarah Palin\n| align=\"right\" | 1,445,814\n| align=\"right\" | 49.43%\n| align=\"right\" | 11\n|-\n! style=\"background-color:#3333FF; width: 3px\" |\n| style=\"width: 130px\" | Democratic\n| Barack Obama\n| Joe Biden\n| align=\"right\" | 1,441,911\n| align=\"right\" | 49.29%\n| align=\"right\" | 0\n|-\n! style=\"background-color:#DDDDDD; width: 3px\" |\n| style=\"width: 130px\" | Independent\n| Ralph Nader\n| Matt Gonzalez\n| align=\"right\" | 17,813\n| align=\"right\" | 0.61%\n| align=\"right\" | 0\n|-\n! style=\"background-color:#FFCC00; width: 3px\" |\n| style=\"width: 130px\" | Libertarian\n| Bob Barr\n| Wayne Allyn Root\n| align=\"right\" | 11,386\n| align=\"right\" | 0.39%\n| align=\"right\" | 0\n|-\n! style=\"background-color:#A356DE; width: 3px\" |\n| style=\"width: 130px\" | Constitution\n| Chuck Baldwin\n| Darrell Castle\n| align=\"right\" | 8,201\n| align=\"right\" | 0.28%\n| align=\"right\" | 0\n|-\n! style=\"background-color:#0BDA51; width: 3px\" |\n| style=\"width: 130px\" | Green  (write-in)\n| Cynthia McKinney\n| Rosa Clemente\n| align=\"right\" | 80\n| align=\"right\" | 0.00%\n| align=\"right\" | 0\n|-bgcolor=\"#EEEEEE\"\n| colspan=\"4\" align=\"right\" | Totals\n| align=\"right\" | 2,925,205\n| align=\"right\" | 100.00%\n| align=\"right\" | 11\n|-bgcolor=\"#EEEEEE\"\n| colspan=\"6\" align=\"right\" | Voter turnout (Voting age population)\n| colspan=\"1\" align=\"right\" | 66.1%\n|}\nBy county\n{|width=\"60%\" class=\"wikitable sortable\"\n! rowspan=\"2\" |County\n! colspan=\"2\" |John McCainRepublican\n! colspan=\"2\" |Barack ObamaDemocratic\n! colspan=\"2\" |Various candidatesOther parties\n! colspan=\"2\" |Margin\n! rowspan=\"2\" |Total\n|-\n! style=\"text-align:center;\" data-sort-type=\"number\" |#\n! style=\"text-align:center;\" data-sort-type=\"number\" |%\n! style=\"text-align:center;\" data-sort-type=\"number\" |#\n! style=\"text-align:center;\" data-sort-type=\"number\" |%\n! style=\"text-align:center;\" data-sort-type=\"number\" |#\n! style=\"text-align:center;\" data-sort-type=\"number\" |%\n! style=\"text-align:center;\" data-sort-type=\"number\" |#\n! style=\"text-align:center;\" data-sort-type=\"number\" |%\n|- style=\"text-align:center;\"\n|  |Adair\n|  |5,891\n|  |49.63%\n|  |5,735\n|  |48.31%\n|  |245\n|  |2.06%\n|  |156\n|  |1.32%\n|  |11,871\n|- style=\"text-align:center;\"\n|  |Andrew\n|  |5,279\n|  |60.06%\n|  |3,345\n|  |38.05%\n|  |166\n|  |1.89%\n|  |1,934\n|  |22.01%\n|  |8,790\n|- style=\"text-align:center;\"\n|  |Atchison\n|  |1,936\n|  |65.05%\n|  |1,000\n|  |33.60%\n|  |40\n|  |1.35%\n|  |936\n|  |31.45%\n|  |2,976\n|- style=\"text-align:center;\"\n|  |Audrain\n|  |6,167\n|  |57.20%\n|  |4,434\n|  |41.13%\n|  |180\n|  |1.67%\n|  |1,733\n|  |16.07%\n|  |10,781\n|- style=\"text-align:center;\"\n|  |Barry\n|  |9,758\n|  |66.63%\n|  |4,630\n|  |31.62%\n|  |256\n|  |1.75%\n|  |5,128\n|  |35.01%\n|  |14,644\n|- style=\"text-align:center;\"\n|  |Barton\n|  |4,414\n|  |74.21%\n|  |1,455\n|  |24.46%\n|  |79\n|  |1.33%\n|  |2,959\n|  |49.75%\n|  |5,948\n|- style=\"text-align:center;\"\n|  |Bates\n|  |4,833\n|  |58.35%\n|  |3,271\n|  |39.49%\n|  |179\n|  |2.16%\n|  |1,562\n|  |18.86%\n|  |8,283\n|- style=\"text-align:center;\"\n|  |Benton\n|  |5,759\n|  |59.92%\n|  |3,629\n|  |37.76%\n|  |223\n|  |2.32%\n|  |2,130\n|  |22.16%\n|  |9,611\n|- style=\"text-align:center;\"\n|  |Bollinger\n|  |3,972\n|  |68.67%\n|  |1,690\n|  |29.22%\n|  |122\n|  |2.11%\n|  |2,282\n|  |39.45%\n|  |5,784\n|- style=\"text-align:center;\"\n|  |Boone\n|  |36,849\n|  |43.22%\n|  |47,062\n|  |55.20%\n|  |1,340\n|  |1.58%\n|  |-10,213\n|  |-11.98%\n|  |85,251\n|- style=\"text-align:center;\"\n|  |Buchanan\n|  |19,110\n|  |48.68%\n|  |19,164\n|  |48.81%\n|  |986\n|  |2.51%\n|  |-54\n|  |-0.13%\n|  |39,260\n|- style=\"text-align:center;\"\n|  |Butler\n|  |11,805\n|  |68.09%\n|  |5,316\n|  |30.66%\n|  |217\n|  |1.25%\n|  |6,489\n|  |37.43%\n|  |17,338\n|- style=\"text-align:center;\"\n|  |Caldwell\n|  |2,654\n|  |58.15%\n|  |1,814\n|  |39.75%\n|  |96\n|  |2.10%\n|  |840\n|  |18.40%\n|  |4,564\n|- style=\"text-align:center;\"\n|  |Callaway\n|  |11,389\n|  |58.81%\n|  |7,580\n|  |39.14%\n|  |397\n|  |2.05%\n|  |3,809\n|  |19.67%\n|  |19,366\n|- style=\"text-align:center;\"\n|  |Camden\n|  |14,074\n|  |63.40%\n|  |7,773\n|  |35.02%\n|  |350\n|  |1.58%\n|  |6,301\n|  |28.38%\n|  |22,197\n|- style=\"text-align:center;\"\n|  |Cape Girardeau\n|  |24,768\n|  |66.14%\n|  |12,208\n|  |32.60%\n|  |470\n|  |1.26%\n|  |12,560\n|  |33.54%\n|  |37,446\n|- style=\"text-align:center;\"\n|  |Carroll\n|  |2,955\n|  |65.12%\n|  |1,535\n|  |33.83%\n|  |48\n|  |1.05%\n|  |1,420\n|  |31.29%\n|  |4,538\n|- style=\"text-align:center;\"\n|  |Carter\n|  |1,840\n|  |63.49%\n|  |984\n|  |33.95%\n|  |74\n|  |2.56%\n|  |856\n|  |29.54%\n|  |2,898\n|- style=\"text-align:center;\"\n|  |Cass\n|  |29,695\n|  |58.99%\n|  |19,844\n|  |39.42%\n|  |802\n|  |1.59%\n|  |9,851\n|  |19.57%\n|  |50,341\n|- style=\"text-align:center;\"\n|  |Cedar\n|  |4,194\n|  |66.01%\n|  |2,060\n|  |32.42%\n|  |100\n|  |1.57%\n|  |2,134\n|  |33.59%\n|  |6,354\n|- style=\"text-align:center;\"\n|  |Chariton\n|  |2,339\n|  |55.51%\n|  |1,799\n|  |42.69%\n|  |76\n|  |1.80%\n|  |540\n|  |12.82%\n|  |4,214\n|- style=\"text-align:center;\"\n|  |Christian\n|  |25,382\n|  |67.08%\n|  |11,883\n|  |31.41%\n|  |572\n|  |1.51%\n|  |13,499\n|  |35.67%\n|  |37,837\n|- style=\"text-align:center;\"\n|  |Clark\n|  |1,782\n|  |51.56%\n|  |1,572\n|  |45.49%\n|  |192\n|  |2.95%\n|  |210\n|  |6.07%\n|  |3,456\n|- style=\"text-align:center;\"\n|  |Clay\n|  |54,516\n|  |49.55%\n|  |53,761\n|  |48.86%\n|  |1,748\n|  |1.59%\n|  |755\n|  |0.69%\n|  |110,025\n|- style=\"text-align:center;\"\n|  |Clinton\n|  |5,709\n|  |54.61%\n|  |4,545\n|  |43.48%\n|  |200\n|  |1.91%\n|  |1,164\n|  |11.13%\n|  |10,454\n|- style=\"text-align:center;\"\n|  |Cole\n|  |24,385\n|  |62.79%\n|  |13,959\n|  |35.95%\n|  |490\n|  |1.26%\n|  |10,426\n|  |26.84%\n|  |38,834\n|- style=\"text-align:center;\"\n|  |Cooper\n|  |4,902\n|  |61.08%\n|  |2,996\n|  |37.33%\n|  |128\n|  |1.59%\n|  |1,906\n|  |23.75%\n|  |8,026\n|- style=\"text-align:center;\"\n|  |Crawford\n|  |6,007\n|  |59.56%\n|  |3,911\n|  |38.78%\n|  |167\n|  |1.66%\n|  |2,096\n|  |20.78%\n|  |10,085\n|- style=\"text-align:center;\"\n|  |Dade\n|  |2,864\n|  |69.65%\n|  |1,184\n|  |28.79%\n|  |64\n|  |1.56%\n|  |1,680\n|  |40.86%\n|  |4,112\n|- style=\"text-align:center;\"\n|  |Dallas\n|  |4,895\n|  |63.71%\n|  |2,656\n|  |34.57%\n|  |132\n|  |1.72%\n|  |2,239\n|  |29.14%\n|  |7,683\n|- style=\"text-align:center;\"\n|  |Daviess\n|  |2,263\n|  |59.77%\n|  |1,400\n|  |36.98%\n|  |123\n|  |3.25%\n|  |863\n|  |22.79%\n|  |3,786\n|- style=\"text-align:center;\"\n|  |DeKalb\n|  |2,889\n|  |61.29%\n|  |1,692\n|  |35.89%\n|  |133\n|  |2.82%\n|  |1,197\n|  |25.40%\n|  |4,714\n|- style=\"text-align:center;\"\n|  |Dent\n|  |4,655\n|  |67.78%\n|  |2,056\n|  |29.94%\n|  |157\n|  |2.28%\n|  |2,599\n|  |37.84%\n|  |6,868\n|- style=\"text-align:center;\"\n|  |Douglas\n|  |4,405\n|  |65.63%\n|  |2,140\n|  |31.88%\n|  |167\n|  |2.49%\n|  |2,265\n|  |33.75%\n|  |6,712\n|- style=\"text-align:center;\"\n|  |Dunklin\n|  |7,044\n|  |59.88%\n|  |4,540\n|  |38.59%\n|  |180\n|  |1.53%\n|  |2,504\n|  |21.29%\n|  |11,764\n|- style=\"text-align:center;\"\n|  |Franklin\n|  |27,355\n|  |55.31%\n|  |21,256\n|  |42.98%\n|  |847\n|  |1.71%\n|  |6,099\n|  |12.33%\n|  |49,458\n|- style=\"text-align:center;\"\n|  |Gasconade\n|  |4,763\n|  |61.29%\n|  |2,899\n|  |37.31%\n|  |109\n|  |1.40%\n|  |1,864\n|  |23.98%\n|  |7,771\n|- style=\"text-align:center;\"\n|  |Gentry\n|  |1,964\n|  |59.66%\n|  |1,235\n|  |37.52%\n|  |93\n|  |2.82%\n|  |729\n|  |22.14%\n|  |3,292\n|- style=\"text-align:center;\"\n|  |Greene\n|  |77,683\n|  |57.06%\n|  |56,181\n|  |41.26%\n|  |2,283\n|  |1.68%\n|  |21,502\n|  |15.80%\n|  |136,147\n|- style=\"text-align:center;\"\n|  |Grundy\n|  |3,006\n|  |63.42%\n|  |1,580\n|  |33.33%\n|  |154\n|  |3.25%\n|  |1,426\n|  |30.09%\n|  |4,740\n|- style=\"text-align:center;\"\n|  |Harrison\n|  |2,512\n|  |64.16%\n|  |1,287\n|  |32.87%\n|  |116\n|  |2.97%\n|  |1,225\n|  |31.29%\n|  |3,915\n|- style=\"text-align:center;\"\n|  |Henry\n|  |6,095\n|  |54.62%\n|  |4,869\n|  |43.63%\n|  |195\n|  |1.75%\n|  |1,226\n|  |10.99%\n|  |11,159\n|- style=\"text-align:center;\"\n|  |Hickory\n|  |2,850\n|  |55.72%\n|  |2,171\n|  |42.44%\n|  |94\n|  |1.84%\n|  |679\n|  |13.28%\n|  |5,115\n|- style=\"text-align:center;\"\n|  |Holt\n|  |1,794\n|  |68.14%\n|  |802\n|  |30.46%\n|  |37\n|  |1.40%\n|  |992\n|  |37.68%\n|  |2,633\n|- style=\"text-align:center;\"\n|  |Howard\n|  |2,708\n|  |55.78%\n|  |2,036\n|  |41.94%\n|  |111\n|  |2.28%\n|  |672\n|  |13.84%\n|  |4,855\n|- style=\"text-align:center;\"\n|  |Howell\n|  |10,982\n|  |64.49%\n|  |5,736\n|  |33.68%\n|  |311\n|  |1.83%\n|  |5,246\n|  |30.81%\n|  |17,029\n|- style=\"text-align:center;\"\n|  |Iron\n|  |2,090\n|  |47.35%\n|  |2,213\n|  |50.14%\n|  |111\n|  |2.51%\n|  |-123\n|  |-2.79%\n|  |4,414\n|- style=\"text-align:center;\"\n|  |Jackson\n|  |124,687\n|  |36.75%\n|  |210,824\n|  |62.14%\n|  |3,755\n|  |1.11%\n|  |-86,137\n|  |-25.39%\n|  |339,266\n|- style=\"text-align:center;\"\n|  |Jasper\n|  |31,667\n|  |65.67%\n|  |15,730\n|  |32.62%\n|  |822\n|  |1.71%\n|  |15,937\n|  |33.05%\n|  |48,219\n|- style=\"text-align:center;\"\n|  |Jefferson\n|  |50,804\n|  |47.91%\n|  |53,467\n|  |50.42%\n|  |1,779\n|  |1.67%\n|  |-2,663\n|  |-2.51%\n|  |106,050\n|- style=\"text-align:center;\"\n|  |Johnson\n|  |12,183\n|  |55.18%\n|  |9,480\n|  |42.93%\n|  |417\n|  |1.89%\n|  |2,703\n|  |12.25%\n|  |22,080\n|- style=\"text-align:center;\"\n|  |Knox\n|  |1,212\n|  |59.73%\n|  |759\n|  |37.41%\n|  |58\n|  |2.86%\n|  |453\n|  |22.32%\n|  |2,029\n|- style=\"text-align:center;\"\n|  |Laclede\n|  |10,875\n|  |66.40%\n|  |5,218\n|  |31.86%\n|  |286\n|  |1.74%\n|  |5,657\n|  |34.54%\n|  |16,379\n|- style=\"text-align:center;\"\n|  |Lafayette\n|  |9,442\n|  |56.88%\n|  |6,902\n|  |41.58%\n|  |256\n|  |1.54%\n|  |2,540\n|  |15.30%\n|  |16,600\n|- style=\"text-align:center;\"\n|  |Lawrence\n|  |11,263\n|  |67.50%\n|  |5,097\n|  |30.55%\n|  |325\n|  |1.95%\n|  |6,166\n|  |36.95%\n|  |16,685\n|- style=\"text-align:center;\"\n|  |Lewis\n|  |2,594\n|  |57.62%\n|  |1,837\n|  |40.80%\n|  |71\n|  |1.58%\n|  |757\n|  |16.82%\n|  |4,502\n|- style=\"text-align:center;\"\n|  |Lincoln\n|  |12,924\n|  |54.72%\n|  |10,234\n|  |43.33%\n|  |461\n|  |1.95%\n|  |2,690\n|  |11.39%\n|  |23,619\n|- style=\"text-align:center;\"\n|  |Linn\n|  |3,140\n|  |52.94%\n|  |2,638\n|  |44.48%\n|  |153\n|  |2.58%\n|  |502\n|  |8.46%\n|  |5,931\n|- style=\"text-align:center;\"\n|  |Livingston\n|  |3,993\n|  |60.94%\n|  |2,435\n|  |37.16%\n|  |124\n|  |1.90%\n|  |1,558\n|  |23.78%\n|  |6,552\n|- style=\"text-align:center;\"\n|  |Macon\n|  |4,586\n|  |61.36%\n|  |2,784\n|  |37.25%\n|  |104\n|  |1.39%\n|  |1,802\n|  |24.11%\n|  |7,474\n|- style=\"text-align:center;\"\n|  |Madison\n|  |2,897\n|  |57.62%\n|  |2,042\n|  |40.61%\n|  |89\n|  |1.77%\n|  |855\n|  |17.01%\n|  |5,028\n|- style=\"text-align:center;\"\n|  |Maries\n|  |2,853\n|  |62.58%\n|  |1,599\n|  |35.07%\n|  |107\n|  |2.35%\n|  |1,254\n|  |27.51%\n|  |4,559\n|- style=\"text-align:center;\"\n|  |Marion\n|  |7,705\n|  |61.38%\n|  |4,703\n|  |37.47%\n|  |145\n|  |1.15%\n|  |3,002\n|  |23.91%\n|  |12,553\n|- style=\"text-align:center;\"\n|  |McDonald\n|  |5,499\n|  |67.60%\n|  |2,454\n|  |30.17%\n|  |182\n|  |2.23%\n|  |3,045\n|  |37.43%\n|  |8,135\n|- style=\"text-align:center;\"\n|  |Mercer\n|  |1,169\n|  |66.88%\n|  |519\n|  |29.69%\n|  |60\n|  |3.43%\n|  |650\n|  |37.19%\n|  |1,748\n|- style=\"text-align:center;\"\n|  |Miller\n|  |7,797\n|  |67.43%\n|  |3,553\n|  |30.73%\n|  |213\n|  |1.84%\n|  |4,244\n|  |36.70%\n|  |11,563\n|- style=\"text-align:center;\"\n|  |Mississippi\n|  |3,034\n|  |56.65%\n|  |2,247\n|  |41.95%\n|  |75\n|  |1.40%\n|  |787\n|  |14.70%\n|  |5,356\n|- style=\"text-align:center;\"\n|  |Moniteau\n|  |4,467\n|  |67.02%\n|  |2,084\n|  |31.27%\n|  |114\n|  |1.71%\n|  |2,383\n|  |35.75%\n|  |6,665\n|- style=\"text-align:center;\"\n|  |Monroe\n|  |2,533\n|  |58.72%\n|  |1,703\n|  |39.48%\n|  |78\n|  |1.81%\n|  |830\n|  |19.24%\n|  |4,314\n|- style=\"text-align:center;\"\n|  |Montgomery\n|  |3,428\n|  |58.54%\n|  |2,347\n|  |40.08%\n|  |81\n|  |1.38%\n|  |1,081\n|  |18.46%\n|  |5,856\n|- style=\"text-align:center;\"\n|  |Morgan\n|  |5,451\n|  |59.58%\n|  |3,565\n|  |38.97%\n|  |133\n|  |1.45%\n|  |1,886\n|  |20.61%\n|  |9,149\n|- style=\"text-align:center;\"\n|  |New Madrid\n|  |4,593\n|  |56.76%\n|  |3,370\n|  |41.65%\n|  |129\n|  |1.59%\n|  |1,223\n|  |15.11%\n|  |8,092\n|- style=\"text-align:center;\"\n|  |Newton\n|  |17,637\n|  |69.42%\n|  |7,450\n|  |29.32%\n|  |319\n|  |1.26%\n|  |10,187\n|  |40.10%\n|  |25,406\n|- style=\"text-align:center;\"\n|  |Nodaway\n|  |5,568\n|  |54.49%\n|  |4,493\n|  |43.97%\n|  |158\n|  |1.54%\n|  |1,075\n|  |10.52%\n|  |10,219\n|- style=\"text-align:center;\"\n|  |Oregon\n|  |2,652\n|  |57.77%\n|  |1,811\n|  |39.45%\n|  |128\n|  |2.78%\n|  |841\n|  |18.32%\n|  |4,591\n|- style=\"text-align:center;\"\n|  |Osage\n|  |5,062\n|  |71.51%\n|  |1,907\n|  |26.94%\n|  |110\n|  |1.55%\n|  |3,155\n|  |44.57%\n|  |7,079\n|- style=\"text-align:center;\"\n|  |Ozark\n|  |2,918\n|  |62.27%\n|  |1,661\n|  |35.45%\n|  |107\n|  |2.28%\n|  |1,257\n|  |26.82%\n|  |4,686\n|- style=\"text-align:center;\"\n|  |Pemiscot\n|  |3,954\n|  |56.11%\n|  |3,029\n|  |42.98%\n|  |64\n|  |0.91%\n|  |925\n|  |13.13%\n|  |7,047\n|- style=\"text-align:center;\"\n|  |Perry\n|  |5,527\n|  |63.92%\n|  |3,005\n|  |34.75%\n|  |115\n|  |1.33%\n|  |2,522\n|  |29.17%\n|  |8,647\n|- style=\"text-align:center;\"\n|  |Pettis\n|  |11,018\n|  |60.32%\n|  |6,932\n|  |37.95%\n|  |315\n|  |1.73%\n|  |4,086\n|  |22.37%\n|  |18,265\n|- style=\"text-align:center;\"\n|  |Phelps\n|  |11,706\n|  |59.96%\n|  |7,394\n|  |37.87%\n|  |424\n|  |2.17%\n|  |4,312\n|  |22.09%\n|  |19,524\n|- style=\"text-align:center;\"\n|  |Pike\n|  |4,268\n|  |53.97%\n|  |3,487\n|  |44.09%\n|  |153\n|  |1.94%\n|  |781\n|  |9.88%\n|  |7,908\n|- style=\"text-align:center;\"\n|  |Platte\n|  |24,460\n|  |52.44%\n|  |21,459\n|  |46.01%\n|  |721\n|  |1.55%\n|  |3,001\n|  |6.43%\n|  |46,640\n|- style=\"text-align:center;\"\n|  |Polk\n|  |8,956\n|  |65.39%\n|  |4,553\n|  |33.24%\n|  |188\n|  |1.37%\n|  |4,403\n|  |32.15%\n|  |13,697\n|- style=\"text-align:center;\"\n|  |Pulaski\n|  |9,552\n|  |63.68%\n|  |5,249\n|  |34.99%\n|  |199\n|  |1.33%\n|  |4,303\n|  |28.69%\n|  |15,000\n|- style=\"text-align:center;\"\n|  |Putnam\n|  |1,591\n|  |68.02%\n|  |695\n|  |29.71%\n|  |53\n|  |2.27%\n|  |896\n|  |38.31%\n|  |2,339\n|- style=\"text-align:center;\"\n|  |Ralls\n|  |2,987\n|  |58.75%\n|  |2,041\n|  |40.15%\n|  |56\n|  |1.10%\n|  |946\n|  |18.60%\n|  |5,084\n|- style=\"text-align:center;\"\n|  |Randolph\n|  |6,457\n|  |60.59%\n|  |3,984\n|  |37.39%\n|  |215\n|  |2.02%\n|  |2,473\n|  |23.20%\n|  |10,656\n|- style=\"text-align:center;\"\n|  |Ray\n|  |5,593\n|  |50.60%\n|  |5,241\n|  |47.42%\n|  |219\n|  |1.98%\n|  |352\n|  |3.18%\n|  |11,053\n|- style=\"text-align:center;\"\n|  |Reynolds\n|  |1,782\n|  |54.21%\n|  |1,418\n|  |43.14%\n|  |87\n|  |2.65%\n|  |364\n|  |11.07%\n|  |3,287\n|- style=\"text-align:center;\"\n|  |Ripley\n|  |3,407\n|  |63.53%\n|  |1,795\n|  |33.47%\n|  |161\n|  |3.00%\n|  |1,612\n|  |30.06%\n|  |5,363\n|- style=\"text-align:center;\"\n|  |Saline\n|  |4,962\n|  |50.39%\n|  |4,712\n|  |47.85%\n|  |174\n|  |1.76%\n|  |250\n|  |2.54%\n|  |9,848\n|- style=\"text-align:center;\"\n|  |Schuyler\n|  |1,139\n|  |57.44%\n|  |775\n|  |39.08%\n|  |69\n|  |3.48%\n|  |364\n|  |18.36%\n|  |1,983\n|- style=\"text-align:center;\"\n|  |Scotland\n|  |1,249\n|  |59.53%\n|  |793\n|  |37.80%\n|  |56\n|  |2.67%\n|  |456\n|  |21.73%\n|  |2,098\n|- style=\"text-align:center;\"\n|  |Scott\n|  |11,563\n|  |63.95%\n|  |6,258\n|  |34.61%\n|  |261\n|  |1.44%\n|  |5,305\n|  |29.34%\n|  |18,082\n|- style=\"text-align:center;\"\n|  |Shannon\n|  |2,075\n|  |54.06%\n|  |1,637\n|  |42.65%\n|  |126\n|  |3.29%\n|  |438\n|  |11.41%\n|  |3,838\n|- style=\"text-align:center;\"\n|  |Shelby\n|  |2,166\n|  |65.32%\n|  |1,114\n|  |33.59%\n|  |36\n|  |1.09%\n|  |1,052\n|  |31.73%\n|  |3,316\n|- style=\"text-align:center;\"\n|  |St. Charles\n|  |102,550\n|  |54.27%\n|  |84,183\n|  |44.55%\n|  |2,224\n|  |1.18%\n|  |18,367\n|  |9.72%\n|  |188,957\n|- style=\"text-align:center;\"\n|  |St. Clair\n|  |2,981\n|  |59.76%\n|  |1,886\n|  |37.81%\n|  |121\n|  |2.43%\n|  |1,095\n|  |21.95%\n|  |4,988\n|- style=\"text-align:center;\"\n|  |St. Francois\n|  |12,660\n|  |51.57%\n|  |11,540\n|  |47.01%\n|  |350\n|  |1.42%\n|  |1,120\n|  |4.56%\n|  |24,550\n|- style=\"text-align:center;\"\n|  |St. Louis\n|  |221,705\n|  |39.60%\n|  |333,123\n|  |59.50%\n|  |5,026\n|  |0.90%\n|  |-111,418\n|  |-19.90%\n|  |559,854\n|- style=\"text-align:center;\"\n|  |St. Louis City\n|  |24,662\n|  |15.50%\n|  |132,925\n|  |83.55%\n|  |1,517\n|  |0.95%\n|  |-108,263\n|  |-68.05%\n|  |159,104\n|- style=\"text-align:center;\"\n|  |Ste. Genevieve\n|  |3,732\n|  |42.29%\n|  |4,979\n|  |56.42%\n|  |114\n|  |1.29%\n|  |-1,247\n|  |-14.13%\n|  |8,825\n|- style=\"text-align:center;\"\n|  |Stoddard\n|  |9,172\n|  |69.16%\n|  |3,899\n|  |29.40%\n|  |191\n|  |1.44%\n|  |5,273\n|  |39.76%\n|  |13,262\n|- style=\"text-align:center;\"\n|  |Stone\n|  |11,147\n|  |67.78%\n|  |5,029\n|  |30.58%\n|  |269\n|  |1.64%\n|  |6,118\n|  |37.20%\n|  |16,445\n|- style=\"text-align:center;\"\n|  |Sullivan\n|  |1,607\n|  |56.01%\n|  |1,173\n|  |40.89%\n|  |89\n|  |3.10%\n|  |434\n|  |15.12%\n|  |2,869\n|- style=\"text-align:center;\"\n|  |Taney\n|  |14,736\n|  |67.78%\n|  |6,683\n|  |30.74%\n|  |322\n|  |1.48%\n|  |8,053\n|  |37.04%\n|  |21,741\n|- style=\"text-align:center;\"\n|  |Texas\n|  |7,215\n|  |66.49%\n|  |3,410\n|  |31.43%\n|  |226\n|  |2.08%\n|  |3,805\n|  |35.06%\n|  |10,851\n|- style=\"text-align:center;\"\n|  |Vernon\n|  |5,334\n|  |60.08%\n|  |3,381\n|  |38.08%\n|  |163\n|  |1.84%\n|  |1,953\n|  |22.00%\n|  |8,878\n|- style=\"text-align:center;\"\n|  |Warren\n|  |8,675\n|  |55.69%\n|  |6,705\n|  |43.05%\n|  |196\n|  |1.26%\n|  |1,970\n|  |12.64%\n|  |15,576\n|- style=\"text-align:center;\"\n|  |Washington\n|  |4,706\n|  |48.95%\n|  |4,711\n|  |49.00%\n|  |197\n|  |2.05%\n|  |-5\n|  |-0.05%\n|  |9,614\n|- style=\"text-align:center;\"\n|  |Wayne\n|  |3,784\n|  |61.49%\n|  |2,243\n|  |36.45%\n|  |127\n|  |2.06%\n|  |1,541\n|  |25.04%\n|  |6,154\n|- style=\"text-align:center;\"\n|  |Webster\n|  |10,431\n|  |63.77%\n|  |5,685\n|  |34.76%\n|  |240\n|  |1.47%\n|  |4,746\n|  |29.01%\n|  |16,356\n|- style=\"text-align:center;\"\n|  |Worth\n|  |707\n|  |60.22%\n|  |427\n|  |36.37%\n|  |40\n|  |3.41%\n|  |280\n|  |23.85%\n|  |1,174\n|- style=\"text-align:center;\"\n|  |Wright\n|  |5,784\n|  |67.94%\n|  |2,557\n|  |30.03%\n|  |173\n|  |2.03%\n|  |3,227\n|  |37.91%\n|  |8,514\n|-\n!Totals!!1,445,814!!49.36%!!1,441,911!!49.23%!!41,386!!1.41%!!3,903!!0.13%!!2,929,111\n|}\n;Counties that flipped from Republican to Democratic\n* Boone (largest city: Columbia)\n* Buchanan (largest city: St. Joseph)\n* Iron (largest city: Ironton)\n* Jefferson (largest city: Arnold)\n* Washington (largest city: Potosi)\nBy congressional district\nMcCain carried six of the state's nine congressional districts, including one district held by a Democrat.\n{|class=wikitable\n! District\n! McCain\n! Obama\n! Representative\n|- align=center\n! |\n| 19.38%\n| 79.70%\n| |William Lacy Clay, Jr.\n|- align=center\n! |\n| 54.98%\n| 44.04%\n| |Todd Akin\n|- align=center\n! |\n| 39.06%\n| 59.50%\n| |Russ Carnahan\n|- align=center\n! |\n| 60.58%\n| 37.87%\n| |Ike Skelton\n|- align=center\n! |\n| 35.45%\n| 63.47%\n| |Emanuel Cleaver\n|- align=center\n! |\n| 53.58%\n| 44.67%\n| |Sam Graves\n|- align=center\n! |\n| 63.07%\n| 35.39%\n| |Roy Blunt\n|- align=center\n! |\n| 61.92%\n| 36.42%\n| |Jo Ann Emerson\n|- align=center\n! rowspan=2 |\n| rowspan=2|54.77%\n| rowspan=2|43.66%\n| |Kenny Hulshof (110th Congress)\n|- align=center\n| |Blaine Luetkemeyer (111th Congress)\n|}\nElectors\nTechnically the voters of Missouri cast their ballots for electors: representatives to the Electoral College. Missouri is allocated 11 electors because it has 9 congressional districts and 2 senators. All candidates who appear on the ballot or qualify to receive write-in votes must submit a list of 11 electors, who pledge to vote for their candidate and his or her running mate. Whoever wins the majority of votes in the state is awarded all 11 electoral votes. Their chosen electors then vote for president and vice president. Although electors are pledged to their candidate and running mate, they are not obligated to vote for them. An elector who votes for someone other than his or her candidate is known as a faithless elector.\nThe electors of each state and the District of Columbia met on December 15, 2008, to cast their votes for president and vice president. The Electoral College itself never meets as one body. Instead the electors from each state and the District of Columbia met in their respective capitols.\nThe following were the members of the Electoral College from the state. All 11 were pledged to John McCain and Sarah Palin:\n# Willis Corbett\n# Scott Dickenson\n# Robert Haul\n# Ronny Margason\n# Cathy Owens\n# Ron Muck\n# Gene Hall\n# R. Mellene Schudy\n# Nadine Thurman\n# Paul Nahon\n# Jerry Dowell\nSee also\n* United States presidential elections in Missouri\nReferences"
    }
  ]
}