{
  "content": [
    {
      "type": "text",
      "text": "# 2008 Democratic Party presidential debates and forums\n\nDebates took place prior to and during the 2008 Democratic primaries. The debates began on April 26, 2007, in Orangeburg, South Carolina.\nElection 2008\nThe 2008 United States presidential election was November 4, 2008. The debates, campaigns, primaries, and conventions occurred several months before Election Day. The new president and vice president were sworn on January 20, 2009. It was the first presidential election lacking an incumbent president or vice president since 1952, and was projected to be the largest and most expensive election in U.S. history.\n2008 Democratic candidates\nAlready, eight Democrats had formally filed papers with the Federal Election Commission, making them formal candidates for the Democratic Nomination and the Presidency. The candidates who attracted the most media attention included Hillary Clinton, Barack Obama, and John Edwards. Other candidates included Dennis Kucinich, who withdrew, and Mike Gravel, before he defected to the Libertarian Party. Tom Vilsack, one of the earliest candidates to announce a campaign for president, withdrew before participating in any debates. Christopher Dodd and Joe Biden dropped out of the race following the Iowa caucuses, and Bill Richardson dropped out after the New Hampshire primary.\nCandidates in debate\n* Senator Barack Obama - Illinois.\nWithdrawn candidates\n*Senator Chris Dodd - Connecticut (withdrew January 3, 2008)\n*Senator Joe Biden - Delaware (withdrew January 3, 2008)\n*Governor Bill Richardson - New Mexico (withdrew January 9, 2008)\n*Congressman Dennis Kucinich - Ohio (withdrew January 24, 2008)\n*Senator John Edwards - North Carolina (withdrew January 30, 2008)\n*Senator Mike Gravel - Alaska (withdrew from Democratic Party March 25, 2008)\n*Senator Hillary Clinton - New York (withdrew June 7, 2008)\nDebate table\nKey:  denotes candidate participated in debate;  denotes candidate was not invited;  denotes candidate absent but was invited;  denotes candidate was out of the race.\n{| class=\"wikitable\" style=\"text-align:center; font-size:85%;\"\n|+ Debates among candidates for the 2008 Democratic Party U.S. presidential nomination\n|-†\n|-\n|\n! colspan=\"3\" | Details\n! colspan=\"8\" | Invitees\n|-\n!No.\n! Date\n! Place\n! Compere\n! Sen. Biden\n! Sen. Clinton\n! Sen. Dodd\n! Sen. Edwards\n! Sen. Gravel\n! Rep. Kucinich\n! Sen. Obama\n! Gov. Richardson\n|-\n|1\n|April 26, 2007\n|Orangeburg, South Carolina\n|MSNBC\n|\n|\n|\n|\n|\n|\n|\n|\n|-\n|2\n|June 3, 2007\n|Goffstown, New Hampshire\n|CNN\n|\n|\n|\n|\n|\n|\n|\n|\n|-\n|3\n|June 28, 2007\n|Washington, D.C.\n|PBS\n|\n|\n|\n|\n|\n|\n|\n|\n|-\n|4\n|July 12, 2007\n|Detroit, Michigan\n|none\n|\n|\n|\n|\n|\n|\n|\n|\n|-\n|5\n|July 23, 2007\n|Charleston, South Carolina\n|CNN / YouTube\n|\n|\n|\n|\n|\n|\n|\n|\n|-\n|6\n|August 4, 2007\n|Chicago, Illinois\n|none\n|\n|\n|\n|\n|\n|\n|\n|\n|-\n|7\n|August 7, 2007\n|Chicago, Illinois\n|MSNBC\n|\n|\n|\n|\n|\n|\n|\n|\n|-\n|8\n|August 9, 2007\n|Los Angeles, California\n|Logo\n|\n|\n|\n|\n|\n|\n|\n|\n|-\n|9\n|August 19, 2007\n|Des Moines, Iowa\n|ABC\n|\n|\n|\n|\n|\n|\n|\n|\n|-\n|10\n|September 9, 2007\n|Coral Gables, Florida\n|Univision\n|\n|\n|\n|\n|\n|\n|\n|\n|-\n|11\n|September 12, 2007\n|online-only\n|none\n|\n|\n|\n|\n|\n|\n|\n|\n|-\n|12\n|September 20, 2007\n|Davenport, Iowa\n|PBS\n|\n|\n|\n|\n|\n|\n|\n|\n|-\n|13\n|September 26, 2007\n|Hanover, New Hampshire\n|MSNBC\n|\n|\n|\n|\n|\n|\n|\n|\n|-\n|14\n|October 30, 2007\n|Philadelphia, Pennsylvania\n|MSNBC\n|\n|\n|\n|\n|\n|\n|\n|\n|-\n|15\n|November 15, 2007\n|Las Vegas, Nevada\n|CNN\n|\n|\n|\n|\n|\n|\n|\n|\n|-\n|16\n|December 4, 2007\n|Des Moines, Iowa\n|none (radio only, NPR)\n|\n|\n|\n|\n|\n|\n|\n|\n|-\n|17\n|December 13, 2007\n|Johnston, Iowa\n|CNN, Fox News Channel, IPTV, MSNBC\n|\n|\n|\n|\n|\n|\n|\n|\n|-\n|18\n|January 5, 2008\n|Goffstown, New Hampshire\n|ABC\n|\n|\n|\n|\n|\n|\n|\n|\n|-\n|19\n|January 15, 2008\n|Las Vegas, Nevada\n|MSNBC\n|\n|\n|\n|\n|\n|\n|\n|\n|-\n|20\n|January 21, 2008\n|Myrtle Beach, South Carolina\n|CNN\n|\n|\n|\n|\n|\n|\n|\n|\n|-\n|21\n|January 31, 2008\n|Hollywood, California\n|CNN\n|\n|\n|\n|\n|\n|\n|\n|\n|-\n|22\n|February 2, 2008\n|New York, New York\n|MTV\n|\n|\n|\n|\n|\n|\n|\n|\n|-\n|23\n|February 21, 2008\n|Austin, Texas\n|CNN\n|\n|\n|\n|\n|\n|\n|\n|\n|-\n|24\n|February 26, 2008\n|Cleveland, Ohio\n|MSNBC\n|\n|\n|\n|\n|\n|\n|\n|\n|-\n|25\n|April 13, 2008\n|Grantham, Pennsylvania\n|CNN\n|\n|\n|\n|\n|\n|\n|\n|\n|-\n|26\n|April 16, 2008\n|Philadelphia, Pennsylvania\n|ABC\n|\n|\n|\n|\n|\n|\n|\n|\n|}\nKey:  denotes candidate participated in debate;  denotes candidate was not invited;  denotes candidate absent but was invited;  denotes candidate was out of the race.\nDebates\nApril 26, 2007 – Orangeburg, South Carolina, South Carolina State University\n{| class=\"wikitable sortable floatright\"\n! Candidate !! Polls\n|-\n| Clinton || 35.2%\n|-\n| Obama || 25.5%\n|}\nThe first Democratic debate was in the evening of April 26, 2007, in Orangeburg, South Carolina, at South Carolina State University. State party chairman Joe Erwin said that he chose South Carolina State because it is a historically black college, noting that African Americans have been the \"most loyal\" Democrats in the state. The debate was 90 minutes, with a 60-second time limit for answers, and no opening or closing statements. It was broadcast via cable television and online video streaming by MSNBC. The debate was moderated by Brian Williams of NBC Nightly News.\nThe Iraq War was the major topic of the discussion, and all of the candidates strongly criticized President George W. Bush. Although, some public fanfare occurred initially, pundits considered the debate unspectacular, and no single \"breakout\" candidate was identified.\nA poll of 403 South Carolinians who watched the debate indicated a belief that Obama won the debate, with support of 31% compared to Clinton's 24%. However, journalists Tom Baldwin, of The Times, and Ewen MacAskill, of The Guardian, both reported that Clinton appeared to retain her frontrunner status. Political pundits such as Chris Matthews, Howard Fineman, Keith Olbermann and Joe Scarborough declared Clinton the most \"presidential\", stating that her appearance and answers were: succinct, within the time limit, unambiguous and thorough.\nThe opinions of pundits varied in regard to the third-polled candidate, Former Senator John Edwards (D-NC), with some asserting that his performance was weak and not akin to the energetic performance that he portrayed during his first election campaign in 2003.\n*[https://www.nbcnews.com/id/wbna18352397 MSNBC Transcript]\nJune 3, 2007 – CNN 7 pm EDT – Goffstown, New Hampshire, Saint Anselm College\nWMUR-TV, CNN and the New Hampshire Union Leader hosted both Democratic and Republican debates in the Manchester, New Hampshire area, at Saint Anselm College in Goffstown. The Democratic debate was Sunday, June 3, started at 7 p.m. EDT, was commercial free and lasted two hours. The moderator was Wolf Blitzer, host of Late Edition with Wolf Blitzer and The Situation Room. Blitzer was joined by Tom Fahey of the New Hampshire Union Leader and Scott Spradling from the local television station WMUR.\nThe first half of the debate was a directed question-and-answer session, with candidates questioned while standing at the podiums, as in the first debate, responding to questions from Fahey and Spradling. Participating candidates were Obama, Edwards, Clinton, Kucinich, Gravel, Dodd, Richardson and Biden.\nFor the second half of the debate, the candidates sat in chairs while New Hampshire live audience members—mostly undecided Democratic and independent voters—asked questions that were then deflected by Blitzer to specific candidates.\nJune 28, 2007 – PBS – Washington, D.C., Howard University\nPBS held and televised a debate at Howard University, a historically black college. The moderator was Tavis Smiley and all eight candidates discussed a range of topics, including education, poverty, unemployment, racial discrimination, and health in the black community.\nJuly 12, 2007 – Detroit, Michigan\nAttended by all eight candidates, this candidate forum was held during the NAACP convention. An on-stage conversation between Edwards and Clinton was overheard—due to activated microphones—in which they talked about eventually ceasing the participation of non-frontrunner candidates in future debates.\nJuly 23, 2007 – CNN – Charleston, South Carolina, The Citadel military college\nCNN and YouTube held this debate on the campus of The Citadel. All questions were selected from, and posed as videos submitted via, YouTube by members of the public; the debate was moderated by Anderson Cooper of Anderson Cooper 360. YouTube and Google streamed the event live.[http://www.democrats.org/a/2007/05/dnc_announces_d_1.php The Democratic Party | DNC Announces Dates, Media Sponsors and Locations for Sanctioned Debates]  It was also simulcast on CNN en Español.\n*[https://web.archive.org/web/20071101151443/http://www.cfr.org/publication/13876/democratic_debate_transcript_cnnyoutube.html CFR Transcript]\n*[http://www.cnn.com/2007/POLITICS/07/23/debate.transcript/ CNN Transcript]\n*[http://www.cnn.com/2007/POLITICS/07/24/youtube.debate.video/ CNN Video]\n*[https://web.archive.org/web/20071122002524/http://www.taudiobook.com/closed_caption/democratic_debate_cnn_youtube.html Video with Closed Caption from Taudiobook.com]\nAugust 4, 2007 – Chicago, Illinois\nThe Yearly Kos Presidential Leadership Forum was an informal discussion attended by seven of the eight presidential candidates, with Biden not attending due to votes in Congress. New York Times Magazine writer Matt Bai, DailyKos Contributing Editor /Fellow Joan McCarter and author and blogger Jeffrey Feldman moderated. The debate was broken down into Domestic Policy, Foreign Policy, and Philosophy and Leadership. Candidates were allotted 90 seconds for each question with 45 second rebuttals, although the time limits were not strictly enforced. After the debate, breakout sessions were held where convention goers could question each candidate individually.\n*[http://www.yearlykosconvention.org/node/741 YearlyKos Video]\nAugust 7, 2007 – Chicago, Illinois\n{| class=\"wikitable sortable floatright\"\n! Candidate !! Polls\n|-\n| Clinton || 41.0%\n|-\n| Obama || 22.2%\n|}\nThe AFL–CIO Working Families Vote Presidential Forum was held at Soldier Field in Chicago, Illinois in front of approximately 15,000 union members and their families. The questions in the debate were to be used to determine if and whom the AFL–CIO would endorse in the Democratic primary. MSNBC host Keith Olbermann hosted the debate, which featured seven of the candidates. Mike Gravel was excluded because he failed to submit a written questionnaire by the August 6 deadline. Gravel claimed that the questionnaire \"fell through the cracks\" and requested to be invited to the debate anyway, which was rejected by the AFL–CIO. Questionnaires were also sent to Republicans but no candidates responded.\n*[https://web.archive.org/web/20080206192805/http://www.cfr.org/publication/14004/democratic_debate_transcript_chicago.html CFR Transcript]\n*[https://web.archive.org/web/20071014062910/http://blogs.suntimes.com/sweet/2007/07/sweet_dem_debate_full_transcri.html Chicago Sun-Times Transcript]\n*[https://www.nytimes.com/2007/08/08/us/politics/07demsforum.html New York Times Transcript]\n*[https://web.archive.org/web/20070824014428/http://video.msn.com/v/us/msnbc.htm?g=198f3986-adaf-4ede-8b40-fa33157e199a&f=00&fg=copy MSNBC Video]\n*[https://web.archive.org/web/20080203095934/http://www.taudiobook.com/closed_caption/democratic_afl_cio/ Video with Closed Caption]\nAugust 9, 2007 – Los Angeles, California\nLGBT network Logo hosted this debate focusing on LGBT issues, moderated by Human Rights Campaign President Joe Solmonese and singer Melissa Etheridge. Barack Obama, Hillary Clinton, Bill Richardson, John Edwards, Dennis Kucinich, and Mike Gravel participated. Mike Gravel was originally to be excluded from this debate, it being cited that his campaign had not raised enough money to qualify for participation. Rallying from Gravel's supporters reversed this decision. Dodd and Biden both stated scheduling conflicts prevented them from attending. Logo invited the Republicans presidential candidates to a similar debate, but all the candidates declined.\n*[https://web.archive.org/web/20071014062914/http://blogs.suntimes.com/sweet/2007/08/sweet_dem_gay_forum_special_pa.html Chicago Sun-Times Transcript]\n*[http://visiblevote08.logoonline.com/index.php The Visible Vote '08 Video]\nAugust 19, 2007 – Des Moines, Iowa\ngreet supporters while arriving to the debate in his campaign bus]]\nABC News in conjunction with the Iowa Democratic Party held a debate streamed on This Week moderated by George Stephanopoulos.[http://www.ovaloffice2008.com/2007/02/primary-debates-schedule.html www.ovaloffice2008.com]  ABC has been accused of spinning the results of the debate due to extreme differences in the time allotted to candidates.\n*[https://abcnews.go.com/Politics/Decision2008/story?id=3498294 ABC Transcript]\n*[https://abcnews.go.com/Video/playerIndex?id=3498128 ABC Video (incomplete, edited, and out of chronological order)]\n*[https://web.archive.org/web/20071226005410/http://www.taudiobook.com/closed_caption/democratic_debate_iowa_081907/ Video with Closed Caption]\nSeptember 9, 2007 – Coral Gables, Florida, University of Miami\nUnivision hosted a forum, Destino 2008, in Spanish at the University of Miami's Bank United Center in Coral Gables, Florida and moderated by Univision's anchors Jorge Ramos and Maria Elena Salinas.[http://www.univision.com/content/content.jhtml?cid=1200711 Candidatos presidenciales en Univision : Un debate en español para los hispanos – Foros y Debates Presidenciales – Elecciones 2008]  Joe Biden did not participate in the debate.\nBill Richardson and Chris Dodd objected to the debate being conducted in English with simultaneous translation in Spanish. Both are fluent in Spanish but it was perceived to cause an unfair advantage for the two. The TV audience of 2.2 million was also the debate season's youngest, at an average of 36 years old.\n*[http://www6.miami.edu/communications/events/destino2008/ Official web site]\n*[http://media.miamiherald.com/smedia/2007/09/09/23/English_transcript.source.prod_affiliate.56.pdf Transcript of debate]\nSeptember 12, 2007\nYahoo!, in partnership with The Huffington Post, produced a \"mashup\" debate with Charlie Rose interviewing the candidates. Segments were recorded on September 12, with the \"mashups\" posted on September 13.\n*[http://debates.news.yahoo.com/ interactive mashup site]\nSeptember 20, 2007 – Davenport, Iowa\nPBS held a forum focused on domestic issues, specifically health care and financial security. It was moderated by Judy Woodruff, and was a joint venture between IPTV and AARP.[https://www.pbs.org/ombudsman/2007/09/debates_are_on_debaters_are_off.html PBS | Ombudsman | Debates Are On; Debaters Are Off] Obama rejected PBS's invitation, and Gravel and Kucinich were excluded from the debate because they did not have at least one paid staff member or office space in Iowa.\n*[https://web.archive.org/web/20071025090513/http://www.aarp.org/issues/dividedwefail/elections/aarp_iptv_2008_presidential_candidates_forums_in_d.html AARP – Divided We Fail debate page]\n*[http://www.youdecide2008.com/video/video-aarp-ipt-democratic-debate-from-davenport-iowa/ Fox News video]\n*[https://web.archive.org/web/20071210160222/http://www.iptv.org/video/detail.cfm/634 Iowa Public Television video]\n*[https://www.youtube.com/user/IowaPublicTelevision IPT on YouTube video]\nSeptember 26, 2007 – Hanover, New Hampshire, Dartmouth College\n{| class=\"wikitable sortable floatright\"\n! Candidate !! Polls\n|-\n| Clinton || 40.5%\n|-\n| Obama || 23.3%\n|}\nMSNBC held a debate at Dartmouth College in conjunction with New England Cable News and New Hampshire Public Radio. The moderator was Tim Russert.\n*[https://web.archive.org/web/20080214092700/http://video.msn.com/?mkt=en-us&brand=msnbc&tab=m5&rf=http%3A%2F%2Fwww.msnbc.msn.com%2Fid%2F18296908%2F&fg=&from=00&vid=dd47450d-1c0e-4981-b05f-9c2246f5b646&playlist=videoByTag%3Amk%3Aus%3Avs%3A0%3Atag%3ANews_Editors%20Picks%3Ans%3AMSNVideo_Top_Cat%3Aps%3A10%3Asd%3A-1%3Aind%3A1%3Aff%3A8A MSNBC video]\n*[https://web.archive.org/web/20071226012507/http://www.taudiobook.com/closed_caption/democratic_debate_nh_092607.html Video with Closed Caption]\n*[https://web.archive.org/web/20080206192752/http://www.cfr.org/publication/14313/ CFR transcript]\n*[https://ipol-2008.blogspot.com/2007/09/transcript-of-dartmouth-debate.html iPol transcript]\n*[https://www.nytimes.com/2007/09/26/us/politics/26DEBATE-TRANSCRIPT.html New York Times transcript]\nOctober 30, 2007 – NBC 9 pm EDT – Philadelphia, Pennsylvania,  Drexel University\n{| class=\"wikitable sortable floatright\"\n! Candidate !! Polls\n|-\n| Clinton || 45.0%\n|-\n| Obama || 22.1%\n|}\nThe debate was held at Drexel University and was televised by NBC News. All candidates except former Alaskan Senator Mike Gravel attended the debate. It was announced on October 19 that Senator Gravel did not meet the polling requirements for the debate, though the DNC did not specifically say what the requirements were; Gravel has suggested that GE, which owns NBC and is a \"war-profiteer,\" conspired to exclude him from the event after, during the previous debate, he questioned Hillary Clinton's signing a resolution that would possibly facilitate entering war with Iran. Instead of attending the debate, Senator Gravel staged an event at the nearby World Cafe Live.[http://www.philly.com/philly/news/breaking/20071030_Democratic_debate_starts_at_9.html The debate is on. Here. Tonight. | Philadelphia Inquirer | 10/30/2007]\nSeven Democratic presidential candidates participated in a two-hour debate starting at 9 p.m. EDT Tuesday (0100 GMT Wednesday) and telecast on MSNBC and streamed live on msnbc.com.[https://web.archive.org/web/20131012194343/http://www.nbcnews.com/id/21548813/ Democrats target Clinton’s vote on Iran – The Debates – nbcnews.com] The moderators of the debate were Tim Russert and Brian Williams. Nielson Ratings estimated the debate attracted 2.5 million viewers.\nDemocratic rivals focused their attacks on Senator Clinton, and were particularly critical of her response to a proposal from New York Governor Eliot L. Spitzer which would allow illegal immigrants to obtain driver's licenses. After the debate, moderator Tim Russert was criticized for asking a misleading question to Senator Clinton regarding the release of her records as first lady. Tim Russert raised the issue of a letter which Bill Clinton wrote in which the former president ordered \"a ban\" on the release of his records by the National Archives. Following the exchange, President Clinton's records representative Bruce Lindesey released a statement clarifying the request, saying that \"Bill Clinton has not asked that records related to communications with Senator Clinton be withheld,\" saying the \"Archives is in the process of making records available as quickly as they can.\"\n* [https://www.nytimes.com/2007/10/30/us/politics/30debate-transcript.html NYT transcript from the Federal News Service]\n* [https://web.archive.org/web/20071102115610/http://video.msn.com/video.aspx?mkt=en-US&brand=msnbc&vid=74d330c5-a0a8-432b-84b7-c0d9843c823c MSNBC Video]\n* [https://web.archive.org/web/20071226012501/http://www.taudiobook.com/closed_caption/democratic_debate_pa.html Video with Closed Caption] from Taudiobook.com\n* [https://archive.today/20070725114952/http://creepysleepy.com/2007/11/03/creepy-sleepy-show-129-from-the-democratic-debate-in-philadelphia/ The Creepy Sleepy podcast] from Twitter and behind the scenes at the debate.\nNovember 15, 2007 – CNN – Paradise, Nevada\n{| class=\"wikitable sortable floatright\"\n! Candidate !! Polls\n|-\n| Clinton || 44.3%\n|-\n| Obama || 22.6%\n|}\nThe Nevada Democratic Party hosted a Democratic debate held on the campus of the University of Nevada, Las Vegas in Paradise, Nevada and aired on CNN. The moderator was Wolf Blitzer. Former Alaskan Senator Mike Gravel was excluded from the debate, and so held a debate alternative, online at [https://web.archive.org/web/20071118202655/http://ustream.tv/channel/senator-mike-gravels-alternative-democratic-debat www.ustream.tv] where a TiVo system is used to screen the official debate simultaneously. According to Nielsen Media Research, the debate drew a record Cable TV audience for a presidential primary debate, an estimated 4.4 million viewers.\nThe candidates present at the debate were Joe Biden, Bill Richardson, Dennis Kucinich, Hillary Clinton, Barack Obama, Chris Dodd, and John Edwards.\nSome commentators have attacked CNN for the debate, calling it biased and poorly handled. Their accusations include claims that the final audience question was planted, that moderator Wolf Blitzer was overly favorable to Hillary Clinton, and that the use of James Carville, a long-time adviser to the Clintons, as a debate commentator was biased.\n*[https://www.nytimes.com/2007/11/15/us/politics/15debate-transcript.html New York Times transcript and video], from the Federal News Service\n*[https://web.archive.org/web/20071119012500/http://blogs.suntimes.com/sweet/2007/11/sweet_las_vegas_dem_debate_ful.html Chicago Sun-Times transcript], from CNN\n*[https://web.archive.org/web/20071122003220/http://www.taudiobook.com/closed_caption/democratic_debate_nv.html Video with Closed Caption], from Taudiobook.com\nDecember 4, 2007 – NPR (radio only) – Des Moines, Iowa\nNational Public Radio, in conjunction with Iowa Public Radio, hosted a \"radio-only\" Democratic Debate. NPR hosts Steve Inskeep, Michele Norris, and Robert Siegel moderated the debate. The debate was broadcast from the State Historical Society of Iowa in Des Moines to NPR stations around the country and was streamed online. All of the major candidates were present other than New Mexico Governor Bill Richardson who was attending the funeral of a Korean war casualty.\nSenators Obama and Edwards were given the most speaking time; Senator Gravel, the least.\n*[https://www.npr.org/templates/story/story.php?storyId=16843353 Debate recap with audio and transcript]\n*[https://www.npr.org/templates/story/story.php?storyId=16898435 Transcript]\nDecember 13, 2007 – Johnston, Iowa\n{| class=\"wikitable sortable floatright\"\n! Candidate !! Polls\n|-\n| Clinton || 43.1%\n|-\n| Obama || 24.6%\n|}\nThe Des Moines Register and Iowa Public Television hosted a Democratic debate in Johnston, Iowa. Six of the eight candidates were invited. Dennis Kucinich was excluded because he had not rented office space in the state. The Register determined \"that a person working out of his home did not meet our criteria for a campaign office and full-time paid staff in Iowa.\" Mike Gravel was excluded for presumably the same reason.\n*This debate was originally scheduled for January 6, 2008, but because the Iowa Caucus was moved up to January 3, 2008, the Des Moines Register moved the debate up to December 13.\n*[https://web.archive.org/web/20071214164315/http://www.iptv.org/campaign08/ Iowa Public Television video (in full and by segment) and transcript]\n*[https://www.npr.org/templates/story/story.php?storyId=17246532 NPR Election 2008] – Podcast [http://download.npr.org/anon.npr-mp3/npr/news/2007/12/20071213_news_desmoinesdemdebate.mp3?dl=1 Direct link to download podcast]\n*[https://archive.today/20130121105734/http://desmoinesregister.com/apps/pbcs.dll/section?category=debatedemafter Des Moines Register video (in full and by segment)]\n*[http://www.youdecide2008.com/video/video-des-moines-register-democratic-debate-from-iowa-121307/ Fox News video (in full only)]\n*[https://web.archive.org/web/20071226005415/http://www.taudiobook.com/closed_caption/democratic_iowa_121307/ Video with Closed Caption]\n*[http://transcripts.cnn.com/TRANSCRIPTS/0712/13/se.01.html CNN Transcript]\nJanuary 5, 2008 – ABC 8:45 pm EST – Goffstown, New Hampshire, Saint Anselm College\n{| class=\"wikitable sortable floatright\"\n! Candidate !! Polls\n|-\n| Clinton || 44.2%\n|-\n| Obama || 24.2%\n|}\nABC News, WMUR-TV and Facebook jointly hosted back-to-back Democratic and Republican debates from Saint Anselm College on Saturday, January 5—three days before the official first-in-the-nation primary the following Tuesday, January 8—with Charles Gibson acting as moderator. According to Nielsen Media Research, the debate drew the largest televised audience of the primary season with an estimated 9.36 million viewers.[http://www.abcmedianet.com/web/progcal/dispDNR.aspx?id=010708_28 ABC Medianet]\nAt 8:47&nbsp;p.m. EST, between the two debates, Democrats Barack Obama, Hillary Clinton, John Edwards and Bill Richardson joined the Republican candidates on the stage at St. Anselm College in greater Manchester. This was the first time all of the major candidates from both parties had been together on stage, as defined by ABC News. ABC News eliminated Democrats Dennis Kucinich and Mike Gravel from the debate because they did not place first through fourth in Iowa, poll 5 percent or higher in one of the last four major New Hampshire surveys, or poll 5 percent or higher in one of the last four major national surveys.\nMajor topics were introduced with a short news-clip-style video produced by ABC and the candidates were encouraged to interact with each other. One question, \"...how much you would spend with the programs you've proposed and the promises you've made.\", was inexplicably withdrawn by Gibson at the last second after its introductory video had been shown. Aside from that, the debate ran smoothly. There were commercial breaks before and after each debate. The candidates were seated during the debates.\nDuring the debate, Obama, Clinton, and Edwards all battled over who best exemplified the buzzword of the campaign, \"change\". In one noted exchange, Edwards said that Clinton could not bring change, while he and Obama can. \"Any time you speak out powerfully for change, the forces for status quo attack.\" He made clear that he was referring to Clinton, adding, \"I didn't hear these kind of attacks from Senator Clinton while she was ahead. Now that she's not we hear them.\" Clinton passionately retorted: \"Making change is not about what you believe; it's not about a speech you make. It's about working hard. I'm not just running on a promise for change. I'm running on 35 years of change. What we need is somebody who can deliver change. We don't need to be raising false hopes.\"  Obama replied that \"The truth is, actually, words do inspire. Words do help people get involved.\"\nAt another point in the debate, when one moderator asked Clinton why polls showed she was less \"likeable\" than other candidates, particularly Obama, she jokingly replied, \"Well that hurts my feelings ... but I'll try to go on.\"\nJanuary 15, 2008 – MSNBC 6 pm PST – Las Vegas, Nevada, College of Southern Nevada\n{| class=\"wikitable sortable floatright\"\n! Candidate !! Polls\n|-\n| Clinton || 42.3%\n|-\n| Obama || 33.3%\n|}\nThe Nevada Democratic Party partnered with the U.S. Hispanic Chamber of Commerce and IMPACTO, 100 Black Men of America, and the College of Southern Nevada to hold the second Democratic presidential debate in Las Vegas. The debate was telecast live by MSNBC and held at the Cashman Center in Las Vegas on Tuesday, January 15, 2008, from 6–8 pm Pacific Standard Time.[https://www.nbcnews.com/id/wbna22574335 Your chance to ask the candidates a question – Politics – nbcnews.com]\nClinton, Edwards and Obama participated in the debate. Kucinich was originally invited to the debate after meeting publicly announced criteria, but the invitation was retracted after NBC changed its criteria shortly before the event. Kucinich sued for the right to participate in the debate, but after lower courts sided with Kucinich, the Nevada Supreme Court ruled in favor of MSNBC.\n*[https://web.archive.org/web/20080126073258/http://www.taudiobook.com/closed_caption/democratic_011508/ Video with Closed Caption]\n*[http://www.lasvegassun.com/news/2008/jan/15/debate-transcript/ Las Vegas Sun transcript]\n*[https://www.nytimes.com/2008/01/15/us/politics/15demdebate-transcript.html New York Times transcript]\nJanuary 21, 2008 – CNN 8 pm EST – Myrtle Beach, South Carolina\n{| class=\"wikitable sortable floatright\"\n! Candidate !! Polls\n|-\n| Clinton || 41.6%\n|-\n| Obama || 33.6%\n|}\nThe Congressional Black Caucus and CNN hosted a debate in Myrtle Beach, South Carolina at 8 pm EST. This debate set another record for a Cable TV audience with an estimated 4.9 million total viewers, according to Nielsen Fast Nationals Ratings. The participants were Hillary Clinton, Barack Obama and John Edwards. The debate, chaired by Wolf Blitzer, had an unusual format; for the last forty minutes the candidates sat down and the debate took a much more casual tone.\n*[https://web.archive.org/web/20080109021135/http://www.cbcimyrtlebeachdebate.com/default.html Official website]\n*[https://web.archive.org/web/20080130203322/http://www.taudiobook.com/closed_caption/democratic_012108/ Video with closed caption]\n*[http://www.cnn.com/2008/POLITICS/01/21/videos.debate/index.html CNN video] and [http://www.cnn.com/2008/POLITICS/01/21/debate.transcript/index.html transcript]\n*[https://www.nytimes.com/2008/01/21/us/politics/21demdebate-transcript.html New York Times transcript]\nJanuary 31, 2008 – CNN 5:00pm PDT – Hollywood, California\n{| class=\"wikitable sortable floatright\"\n! Candidate !! Polls\n|-\n| Clinton || 44.6%\n|-\n| Obama || 36.0%\n|}\nThe Los Angeles Times, Politico, and CNN hosted a Democratic debate in Hollywood, California, at the Kodak Theatre.[https://allthingscnn.blogspot.com/2007/07/cnn-debate-schedule.html All Things CNN: CNN Debate Schedule] The debate set another Cable TV viewing record for a presidential primary debate, with 8,324,000 million total viewers.[https://web.archive.org/web/20080216030542/http://www.mediabistro.com/tvnewser/cnn/cnn_dem_debate_most_watched_in_cable_history_76412.asp mediabistro.com: TVNewser]\nThis was the final Democratic party-specific debate before Super Tuesday on February 5, 2008. This debate included two candidates, Barack Obama and Hillary Clinton, and started at 5 pm Pacific, ending at 6:30 pm. Topics in this cordial debate included health care, the Iraq War, and immigration.\n*[http://www.cnn.com/2008/POLITICS/01/31/dem.debate.transcript/index.html CNN transcript]\n*[http://www.cnn.com/2008/POLITICS/01/31/debate.main/index.html#cnnSTCVideo CNN video]\n*[https://web.archive.org/web/20080203100208/http://www.taudiobook.com/closed_caption/democratic_013108/index.html Video with Closed Caption]\nFebruary 2, 2008 – MTV 6:00pm EST – MTV Myspace Debate\nMTV and Myspace hosted a cross-party candidate dialogue Live on February 2, 2008, at 6PM EST/3PM PST on MTV. Barack Obama, Hillary Clinton, Ron Paul, and Mike Huckabee attended the forum. John McCain and Mitt Romney were invited but did not attend. Mike Gravel was not invited to attend due to little support in the state primaries and caucuses.\n*[https://web.archive.org/web/20080204123707/http://www.mtv.com/overdrive/?id=1580846&vid=207153 MTV Video]\nFebruary 21, 2008 – CNN 7 pm CST – Austin, Texas, University of Texas at Austin\n{| class=\"wikitable sortable floatright\"\n! Candidate !! Polls\n|-\n| Obama || 44.6%\n|-\n| Clinton || 43.0%\n|}\nCNN, Univision and the Texas Democratic Party jointly hosted a debate between Obama and Clinton on February 21 at 7 pm CST on the campus of the University of Texas at Austin. The debate was rebroadcast at 10:30 in Spanish. Questions focused heavily on illegal immigration and the economy, among other issues. redblueamerica.com |access-date=2008-02-25 |archive-url=https://web.archive.org/web/20080303113309/http://redblueamerica.com/blog/2008-02-21/debate-live-blog-clinton-obama-rumble-austin-1129 |archive-date=2008-03-03 |url-status=dead}}\n*[http://www.cnn.com/2008/POLITICS/02/21/debate.transcript/index.html CNN transcript] [http://www.cnn.com/2008/POLITICS/02/21/videos.21feb.debate/index.html video]\n*[https://web.archive.org/web/20080227030740/http://www.taudiobook.com/closed_caption/democratic_univision/ Video with Closed Caption]\nFebruary 26, 2008 – MSNBC 9 pm EST – Cleveland, Ohio, Cleveland State University\n{| class=\"wikitable sortable floatright\"\n! Candidate !! Polls\n|-\n| Obama || 48.3%\n|-\n| Clinton || 41.7%\n|}\nin the spin room  at the February 26 debate]]\nNBC News held a debate between Clinton and Obama on February 26 at the Wolstein Center on the campus of Cleveland State University. The debate was broadcast live at 9:00 EST on MSNBC. It was moderated by Brian Williams with Tim Russert.[https://web.archive.org/web/20040205132832/http://msnbc.msn.com/id/3036697/ MSNBC – Hardball with Chris Matthews Monday through Friday on MSNBC 5 and 7 PM EST – Join the Hardballers Front Page] CNN had proposed with the Ohio Democratic Party a debate on February 27 which was cancelled.[http://blog.cleveland.com/openers/2008/02/clinton_obama_to_face_off_in_c.html Clinton, Obama to face off in Cleveland debate Feb. 26 – OPENERS – Ohio Politics Blog by The Plain Dealer]\n*[https://web.archive.org/web/20080218073549/http://www.csuohio.edu/debate08/index.html Official web site]\n*[https://web.archive.org/web/20130129090138/http://www.nbcnews.com/id/21134540/ MSNBC Video]\n*[https://www.nytimes.com/2008/02/26/us/politics/26text-debate.html?pagewanted=all New York Times Transcript]\n*[https://web.archive.org/web/20080303020118/http://www.taudiobook.com/closed_caption/democratic_022608/ Video with Closed Caption]\nApril 13, 2008 – CNN 8 pm EDT – Grantham, Pennsylvania, Messiah College\n{| class=\"wikitable sortable floatright\"\n! Candidate !! Polls\n|-\n| Obama || 48.0%\n|-\n| Clinton || 41.6%\n|}\nClinton and Obama appeared at the Compassion Forum, discussing faith, values, and religion on April 13, 2008, at 8PM EDT at Messiah College in Grantham, Pennsylvania. The forum was a question-and-answer session in which CNN commentator Campbell Brown and Jon Meacham of Newsweek as well as select members of the audience, posed questions about faith and politics to Clinton and Obama. Both appeared separately. The forum was broadcast live on CNN.[http://www.messiah.edu/compassion_forum/ The Compassion Forum at Messiah College] The event was organized by the religious organization Faith in Public Life.\n* [http://www.messiah.edu/compassion_forum/ Official web site]\n* [http://transcripts.cnn.com/TRANSCRIPTS/0804/13/se.01.html CNN Transcript]\nApril 16, 2008 – ABC 8 pm EDT – Philadelphia, Pennsylvania\n{| class=\"wikitable sortable floatright\"\n! Candidate !! Polls\n|-\n| Obama || 49.0%\n|-\n| Clinton || 41.0%\n|}\nBoth Clinton and Obama appeared in a debate moderated by ABC News on April 16, 2008, at 8 PM EDT at the National Constitution Center.[http://www.kyw1060.com/pages/1825228.php?contentType=4&contentId=1720910 KYW Newsradio 1060 Philadelphia – Constitution Center to Host Clinton-Obama Debate] The debate was nationally televised at 8 PM Eastern and Pacific (tape delayed) and 7 pm Central/Mountain (tape delayed). This was the second debate shown nationally on over-the-air television.\nModerators Charles Gibson and George Stephanopoulos were criticized by viewers, bloggers and media critics for the poor quality of their questions.\nDuring the debate neither Obama or Clinton would answer whether or not they would name the other as their running mate.\nSome of the questions that many viewers said they considered irrelevant when measured against the faltering economy or the Iraq war, like why Senator Barack Obama did not wear an American flag pin on his lapel, the incendiary comments of Obama's former pastor, or Senator Hillary Rodham Clinton's assertion that she had to duck sniper fire in Bosnia more than a decade ago. The questions from the moderators were considered to be focused on campaign gaffes and training most of their ammunition on Obama, to which Stephanopoulos responded by saying that \"Senator Obama [was] the front-runner\" and the questions were \"not inappropriate or irrelevant at all.\"\n* [https://web.archive.org/web/20080411123513/http://www.constitutioncenter.org/PressRoom/Debate/index.shtml Official web site]\n* [https://www.nytimes.com/2008/04/16/us/politics/16text-debate.html?pagewanted=all New York Times transcript]\n* [https://web.archive.org/web/20100720074920/http://www.cfr.org/publication/16044/democratic_debate_transcript_philadelphia.html Council on Foreign Relations transcript]\n* [https://web.archive.org/web/20120215153741/http://www.taudiobook.com/closed_caption/democratic_041608/ Video with Closed Caption]\nSee also\n* 2004 Democratic Party presidential debates and forums\n* 2016 Democratic Party presidential debates and forums\n* 2020 Democratic Party presidential debates and forums\nReferences\nExternal links\n*[https://www.nbcnews.com/id/wbna18352397 MSNBC transcript, April 26, 2007]\n*[http://transcripts.cnn.com/TRANSCRIPTS/0706/03/se.01.html CNN transcript, June 3, 2007]\n*[https://www.pbs.org/kcet/tavissmiley/special/forums/transcript.html PBS transcript, June 28, 2007]\n*[https://web.archive.org/web/20071009204452/http://www.naacpwebcast.com/naacp2007/player_naacp07_01.asp NAACP webcast (click on Democratic Candidates forum), July 12, 2007]\n*[https://www.nytimes.com/2008/01/05/us/politics/05text-ddebate.html?pagewanted=all New York Times transcript, January 5, 2008]"
    }
  ]
}