{
  "content": [
    {
      "type": "text",
      "text": "# 2009 Catalan independence referendum in Arenys de Munt\n\nThe Arenys de Munt query on Catalonia independence was a municipal non-binding query promoted by the ''Moviment Arenyenc per l'Autodeterminació (Arenyenc Movement for Self-determination) held in Arenys de Munt on 13 September 2009. The query was formulated exclusively for residents of this village on the following question: Està d'acord que Catalunya esdevingui un Estat de dret, independent, democràtic i social, integrat a la Unió Europea? (Do you agree on Catalonia becoming an independent, democratic and social State of law, integrated in the European Union?).\nThis query was the first democratic one on Catalonia independence and, despite being municipal and symbolic, had a remarkable influence on Catalan and Spanish politics.\nResults\n{| class=\"wikitable\" style=\"margin:auto; font-size: 95%;\"\n! colspan=\"5\" | Independence query on 13 September 2009\n|-\n! colspan=\"2\" style=\"width: 17em\" |Voting options\n! style=\"width: 5em\" |Votes\n! style=\"width: 7em\" |Percentage\n|-\n| colspan=\"2\" | 14px Yes\n| style=\"text-align: right; margin-right: 0.5em\" | 2.569\n| style=\"text-align: right; margin-right: 0.5em\" | 96,2%\n|-\n| colspan=\"2\" | 14px No\n| align=\"right\" | 61\n| align=\"right\" | 2,3%\n|-\n| colspan=\"2\" | Blank ballots\n| align=\"right\" | 29\n| align=\"right\" | 1,1%\n|- bgcolor=\"#EEEEEE\"\n! colspan=\"2\" style=\"text-align: right\" |Valid ballots\n!  align=\"right\" | 2.659\n! align=\"right\" | 99,6%\n|- bgcolor=\"#EEEEEE\"\n! colspan=\"2\" style=\"text-align: right\" |Void ballots\n! align=\"right\" | 12\n! align=\"right\" | 0,4%\n|-\n|-bgcolor=\"#EEEEEE\"\n! colspan=\"2\" style=\"text-align: right; margin-right: 0.5em\" | Total ballots\n! align=\"right\" | 2.671\n! align=\"right\" | 100%\n|- bgcolor=\"#EEEEEE\"\n! colspan=\"2\" style=\"text-align: right\" | Participation\n! colspan=\"2\" align=\"right\" | 41.0%\n|- bgcolor=\"#EEEEEE\"\n! colspan=\"2\" style=\"text-align: right\" | Voters\n! colspan=\"2\" align=\"right\" | 6.517\n|-\n! align=\"left\" colspan=\"4\" | Sources: [http://www.llibertat.cat/content/view/6423/1/ Llibertat.cat], [http://www.3cat24.cat/noticia/404231/politica/El-96-dels-arenyencs-que-han-votat-es-pronuncien-a-favor-de-la-independencia-de-Catalunya 3cat24.cat]\n|}\nReactions in the media\nThe query had wide media coverage all around the world and more than 300 journalists were granted to cover it by the organizers.\n*The New York Times (United States): Catalan Town Votes For Independence From Spain\n*France Press'' (France): Espagne: vote massif pour l'indépendance catalane lors d'un référendum symbolique\n*Le Monde (France): La Catalogne se mobilise pour défendre son statut d'autonomie élargie\n*Ouest France (France): Une commune de Catalogne vote pour l'indépendance de la région\n*Nouvel Observateur (France): Vote massif en faveur de l'indépendance de la Catalogne\n*France24 (France): Espagne: référendum local controversé sur l'autodétermination catalane\n*n-TV (Germany): Katalanischer Ort gegen Spanien\n*Der Standard (Austria): Katalanische Gemeinde stimmte über Unabhängigkeit ab\n*CNN Türk (Turkey): Katalonya'nın bağımsızlığına referandum!\n*Milliyet (Turkey): Barcelona'da Katalonya için bağımsızlık gösterisi...\n*Expresso (Portugal): Espanha/Catalunha: Maioria de votantes em Arenys de Munt apoia independência em referendo com 41% de participação\n*NOS (Netherlands): Catalaans dorp wil los van Spanje\n*El Mundo (Spain): Sí masivo en la consulta independentista, que tuvo un 41% de participación\n*STV (Great Britain): Catalan town votes for independence from Spain\n*ORF (Austria): Katalanisches Dorf stimmt für die Unabhängigkeit\n*7sur7 (Belgium): Référendum polémique sur l'autodétermination de la Catalogne\n*El Universal (Venezuela): Realizan en España consulta no vinculante por la independencia de Cataluña\n*Euronews (Europe): Catalan town votes for independence\n*El País (Spain): Convergència y ERC llaman an extender el alarde soberanista de Arenys\n*De Morgen (Flandes): Catalaanse gemeente stemt over onafhankelijkheid\nSee also\n* Catalan separatism\n* Independence referendum\n* Query on Catalonia independence\n* Institut Nova Història\nExternal links\n* [http://www.coc130909.org/ Official website]\nReferences"
    }
  ]
}