{
  "content": [
    {
      "type": "text",
      "text": "# 2009 Box Office Entertainment Awards\n\n| website        =\n| most_wins      =\n| previous       = 38th ed.\n| main           = Box Office Entertainment Awards\n| next           = 41st ed.\n}}\n(right) and Gerald Anderson (left), Most Popular Loveteam of Movies & TV winners.]]\nThe 40th Guillermo Mendoza Memorial Scholarship Foundation Box Office Entertainment Awards (GMMSF-BOEA) is a part of the annual awards in the Philippines held on June 21, 2009. The award-giving body honors Filipino actors, actresses and other performers' commercial success, regardless of artistic merit, in the Philippine entertainment industry.\nThe yearly event is supposed to be 39th this year, but they believe that it is an unlucky number. Thus they skipped the 39th and renamed the event the 40th instead.\nWinners selection\nThe winners are chosen from the Top 10 Philippine films of 2008, top-rating shows in Philippine television, top recording awards received by singers, and top gross receipts of concerts and performances.\nAwards ceremony\nOn June 21, 2009 at Carlos P. Romulo Auditorium, RCBC Plaza, Ayala Avenue in Makati, Philippines, the 40th Box Office Entertainment Awards night was held. The event was then aired on June 28 on ABS-CBN.\nAwards\nMajor awards\n*Box Office King - John Lloyd Cruz (A Very Special Love)\n*Box Office Queen - Sarah Geronimo (A Very Special Love)\n*Female Concert Performer of the Year - Sarah Geronimo (The Next One)\n*Female Recording Artist of the Year - Sarah Geronimo (Just Me)\n*Male Concert Performer of the Year - Gary Valenciano (Gary Live@25)\n*Male Recording Artist of the Year - Martin Nievera (Milestone)\nFilm and Television category\n*Film Actor of the Year - Christopher de Leon (Magkaibigan)\n*Film Actress of the Year - Sharon Cuneta (Caregiver)\n*Most Popular Film Director - Cathy Garcia-Molina (A Very Special Love)\n*Most Popular Screenwriter - Raz Sobida dela Torre (A Very Special Love)\n*Most Popular Film Producer - Star Cinema\n*Prince & Princess of Philippine Movies & TV - Richard Gutierrez & KC Concepcion (For The First Time)\n*Most Popular Child Actor, Movies & TV - Robert \"Buboy\" Villar (GMA-7)\n*Most Popular Child Actress, Movies & TV - Sharlene San Pedro (ABS-CBN)\n*Most Popular Loveteam of Movies & TV - Gerald Anderson & Kim Chiu (ABS-CBN)\n*Most Popular Television Program - Dyesebel (GMA-7)\n*Most Popular TV Director - Bb. Joyce Bernal (Dyesebel - GMA-7)\n*Most Promising Female Star of Movies & TV - KC Concepcion (ABS-CBN)\n*Most Promising Male Star of Movies & TV - Aljur Abrenica (GMA-7)\nMusic category\n*Most Popular Novelty Singer - Moymoy Palaboy\n*Most Popular Recording Group - Spongecola\n*Most Promising Performing Group - You've Got Male (Gian Magdangal, Jan Nieto, Harry Santos, and Bryan Termulo)\n*New Female Recording Artist of the Year (Promising Singer) - KC Concepcion (A.k.a Cassandra)\n*New Male Recording Artist of the Year (Most Promising Singer) - Bugoy Drilon (Paano Na Kaya?)\n*Most Popular Dance Group - EB Babes\nSpecial awards\n*Bert Marcelo Award (for Comedians) - Eugene Domingo\n*Comedy Box Office King/s - Vic Sotto & Dolphy (Dobol Trobol)\n*Comedy Box Office Queen - Ai-Ai delas Alas (''Ang Tanging Ina N'yong Lahat)\n*Most Phenomenal Loveteam - Dingdong Dantes & Marian Rivera\n*Outstanding Global Achievement by a Filipino Artist - Arnel Pineda & Charice\n*Outstanding/Special Merit Award for Music (Posthumous Award) - Francis Magalona\n*Valentine Box Office King & Queen - Richard Gutierrez & Marian Rivera (My Best Friend's Girlfriend)\nMultiple awards\nIndividuals with multiple awards\nThe following individual names received two or more awards:\n{| class=\"wikitable\" style=\"text-align:center\"\n|-\n! scope=\"col\" | Awards\n! scope=\"col\" | Name\n|-\n|rowspan=2|3\n|align=left|Sarah Geronimo\n|-\n|align=left|KC Concepcion\n|}\n*Note: Special Award winners are not included.\nCompanies with multiple awards\nThe following companies received two or more awards in the television category:\n{| class=\"wikitable\" style=\"text-align:center\"\n|-\n! scope=\"col\" | Awards\n! scope=\"col\" | Company\n|-\n|4\n|align=left|GMA-7\n|-\n|3\n|align=left|ABS-CBN''\n|}\nReferences"
    }
  ]
}