{
  "content": [
    {
      "type": "text",
      "text": "# 2009 southeast Queensland oil spill\n\n| spill_date     = 11 March 2009\n| cause          = MV Pacific Adventurer spilled oil and cargo during a storm\n| operator       = Swire Shipping\n| volume         = 100,000 litres\n| area           =\n| coast          =\n}}\nThe 2009 southeast Queensland oil spill occurred off the coast of southeast Queensland, Australia on 11 March 2009, when 230 tonnes of fuel oil, 30 tonnes of other fuel and 31 shipping containers containing 620 tonnes of ammonium nitrate spilled into the Coral Sea, north of Moreton Bay during Cyclone Hamish. It happened after unsecured cargo on  damaged other cargo, causing the spillage. Over the following days, the spill washed ashore along  of coastline encompassing the Sunshine Coast, Moreton Bay, Bribie Island and Moreton Island.\nThe ship proceeded through Moreton Bay and docked at the Port of Brisbane where it continued to spread a  long slick in the mouth of the Brisbane River.\nThe Queensland government declared a state of emergency. Premier Anna Bligh described the spill as the \"worst environmental disaster Queensland has ever seen.\" It took over 1,425 people 16 months to clean up the affected areas.\nCause and initial responses\nMV Pacific Adventurer was sailing from Newcastle to the Port of Brisbane in Moreton Bay. Cyclone Hamish had formed off the coast of Queensland. Subsequently, the improperly stowed cargo dislodged from the deck damaging other cargo and containers, causing various substances to spill into the ocean. The ship was damaged at and below the waterline and began to leak fuel and lubricant oil.\nOver the following days the spill washed ashore over a 60&nbsp;km stretch of coastline. In an interview, crew members stated that the captain, Bernardino Santos, was to blame for the incident. The captain decided to stay on course, directly through the storm. As the ship encountered heavy swells, the 20 crew members went below deck, fearing for their lives. At 3:12&nbsp;a.m., a wave broke the restraints for the cargo and sent 31 containers of ammonium nitrate overboard. The Queensland maritime safety authorities estimated that the ship was at a 25-degree angle at the time the containers were knocked off. When the ship came back down, one of the containers damaged the hull. After rolling to the opposite side, it crashed onto another container, creating a large hole underneath the ship, which was not noticed until it docked in Brisbane.\nSwire Shipping initially reported that only 20 tonnes had been spilled. This was later revised to 30 tonnes, 100 tonnes, 230 tonnes and 250 tonnes. The Queensland Government reacted to the situation based on the initial information of 20 tonnes, which was later discovered to be inaccurate, leading to claims of an inadequate initial clean-up response. After divers inspected the ship for the source of the spill, two holes were found. One, located just above the waterline, was  long  wide. The second and larger hole was underneath the ship and measured about  long and  wide.\nAffected areas\nIn the days following the spill, substances washed ashore along a  stretch of coastline. Oil covered beaches, rocky reefs, coastal wetlands and mangrove wetlands. Most of these areas were declared restricted zones and public access was limited. Radar satellite images acquired in preparation for cyclone damage captured the extent of the spill before it hit the coastline.\n*Sunshine Coast\n**Bokarina beach\n**Marcoola beach\n**Maroochy River mouth\n**Minyama beach\n**Mudjimba beach\n**Warana beach\n**Wurtulla beach\n*Moreton Bay\n:Bribie Island – northern coastline\n:Moreton Island – from Eagers Creek on the ocean beach, north around Cape Moreton and on to Comboyuro Point, in Moreton Bay\n*Brisbane River mouth –  long slick\nClean-up\nFollowing the oil spill Queensland Premier Anna Bligh declared two islands and parts of the Sunshine Coast disaster areas. Clean-up efforts were reportedly going to cost at least A$100,000 a day and last more than a week as the oil continued to spread. Several search parties have been sent to the spill area to attempt to find the potentially explosive materials that were in the 31 containers. Press reports stated that if the ammonium nitrate were to mix with the heavy fuel, the mixture could ignite and cause a large explosion. If the chemical did not react with the fuel but still leaked out, marine life could be threatened by large blooms of algae. By 15 March, the cost of the spill jumped to $A10&nbsp;million (US$6.6&nbsp;million). A team of 88 people were sent out to begin the clean-up process and a further 58 were expected to join within the following days. On 16 March, the Royal Australian Navy began searching for the 31 containers of ammonium nitrate that were knocked off the ship. A navy minehunter was sent to look for the containers to reduce the amount of impact the chemical could cause.\nThe clean-up was a delicate operation, because high tides had already eroded beaches after ex-tropical cyclone Hamish battered the coast over the previous week. At the same time, high tides carried off some of the fuel oil initially deposited along shorelines and dispersed it back into the sea. By 15 March, the federal government reported that 50% of the oil had been contained and that the slick had been removed from about 95% of Bribie Island, 85% of the Sunshine Coast and 25% of the waters around Moreton Island. On Moreton Island, 290 people worked to clean up the oil, with most focusing on Middle Creek and Cape Moreton. Even though hundreds of people had worked on cleaning the spill, the average amount of oil cleaned each day was  per day. At that rate, it would have taken more than a month to clean all the affected areas. The Federal Government promised to provide $A2&nbsp;million (US$1.3&nbsp;million) to help with the clean-up.\nClean-up in process\nIn late July 2010, the clean-up effort was declared \"complete\". Federal Environment Minister Peter Garrett attended clean-up sites to celebrate the end of clean-up efforts. 1,425 personnel took 16 months to clean up 155&nbsp;hectares of coastal area and included installation of 21,220 plants and 2.6&nbsp;km of fencing to protect recovering vegetation.\nEffects and consequences\nDisaster declaration\nShortly after the slick washed ashore the Queensland government declared a state of emergency. The disaster declaration restricted public access to beaches affected by the oil slick and allow clean-up teams unobstructed access. The declaration covers all of Moreton Island, coastal waters and beaches in the Sunshine Coast, Redcliffe and Brisbane disaster districts and the southern tip of Bribie Island to Point Arkwright.\nLocal economy\nSeveral of the local restaurants which receive shipments of fish from the waters off the Queensland coast refused to stock any more fish due to the spill. The cost of the clean-up also hurt the economy, costing at least A$10&nbsp;million. In July 2009 the total bill was estimated to be A$34 million.\nThe Australian Government provided A$750,000 to help jump-start the tourist industry. Fourteen of the 19 beaches affected along the Sunshine Coast that had been cleaned were reopened in March 2009.\nFines and legal implications\nOnce the ship was at port, Captain Santos was forced to surrender his passport to Australian officials and he was to remain in Brisbane for at least two weeks to help with the investigation. On 14 October 2011, Swire Navigation and Bluewind Shipping were fined $A600,000 each and ordered to publish a public apology after earlier pleading guilty to causing the spill. The court heard the two companies have already paid $A17.5 million under a limitation order in the Federal Court, as well as an additional $A7.5 million to help cover the $A31 million cost of cleaning up the damage. Charges against Santos were dropped earlier in the week.\nWildlife\nThe Environmental Protection Agency reports that the full extent of wildlife affected by the spill has yet to be realised. \"The flow-on effects of oil spills can be substantive,\" according to a spokesperson for the agency. \"The longer-term impacts are yet to be realised.\" Several birds have been found covered with oil. By 17 March, about 30 animals had been recovered after being covered with oil. All of the animals were immediately treated and cleaned. Oiled animals included pelicans, ghost crabs and sea snakes.\nSee also\n*2010 Great Barrier Reef oil spill\n*Environmental issues in Australia\n*List of oil spills\n*Spill containment\nReferences\nExternal links\n*[https://web.archive.org/web/20090316095535/http://www.abc.net.au/news/infographics/moreton-oilspill/default.htm Map of affected areas from ABC News]"
    }
  ]
}