{
  "content": [
    {
      "type": "text",
      "text": "# 2010 Palanca Awards\n\n| image            =\n| imagesize        =\n| date             = September 1, 2010\n| location         = The Peninsula Manila, Makati, Philippines\n| host             =\n| most_wins        =\n| previous         = 2009\n| next             = 2011\n}}\nThe 60th Don Carlos Palanca Memorial Awards for Literature was held on September 1, 2010, at The Peninsula Manila in Makati to commemorate the memory of Don Carlos Palanca Sr. through an endeavor that would promote education and culture in the country. Among the 50 awardees this year, more than half (54 percent) or 27 are former winners who have already won a Palanca before, while 46 percent or 23 are new winners. This year's youngest winner was aged 12 while the oldest was 66. Gregorio Brillantes was Guest of Honor and Speaker at this year's awarding ceremony.\nLIST OF WINNERS\nThe 2010 winners are divided into four categories:\nEnglish Division\nShort Story\n* First Prize: Ma. Elena L. Paulma, \"Three Kisses\"\n* Second Prize: Ma. Rachelle Tesoro, \"Waiting for Rain\"\n* Third Prize: Catherine Rose Galang Torres, \"Café Masala\"\nShort Story for Children\n* First Prize: Irene Carolina A. Sarmiento, \"Tabon Girl\"\n* Second Prize: Hiyasmin Ledi C. Mattison, \"Little Bear Goes Home: A Love Story\"\n* Third Prize: Grace D. Chong, \"I am an Apple\"\nPoetry\n* First Prize: Merlie M. Alunan, \"Tales of the Spiderwoman\"\n* Second Prize: Rafael Antonio C. San Diego, \"My Name in Reverse\"\n* Third Prize: Joel H. Vega, \"Latitudes and Other Poems\"\nPoetry Written for Children\n* First Prize: Duffie Alejandrino H. Osental, \"After the Storm and Other Poems\"\n* Second Prize: Patricia Marie Grace S. Gomez, \"Poems from the Pantry and Prehistoric Times\"\n* Third Prize: Ma. Celine Anastasia P. Socrates, \"Playgrounds\"\nEssay\n* First Prize: Miro Frances D. Capili, \"Vinyl\"\n* Second Prize: Florianne Marie L. Jimenez, \"Postcards from Somewhere\"\n* Third Prize: Corinna Esperanza A. Nuqui, \"Library\"\nOne-Act Play\n* First Prize: No Winner\n* Second Prize: No Winner\n* Third Prize: Peter Solis Nery, \"The Wide Ionian Sea\"\nFull-Length Play\n* First Prize: Jay Crisostomo IV, \"God of the Machine\"\n* Second Prize: Jorshinelle Taleon-Sonza, \"The Encounter\"\n* Third Prize: Lito Casaje, \"Shooting the Boys\"\nFilipino Division\nMaikling Kwento\n* First Prize: No Winner\n* Second Prize: Rommel B. Rodriguez, \"Toxic\"\n* Third Prize: Thomas David F. Chavez, \"Sa Kabilang Lupalop ng Mahiwagang Kaharian\"\nMaikling Kwentong Pambata\n* First Prize: Christopher S. Rosales, \"Si Berting, ang Batang Uling\"\n* Second Prize: Renerio R. Concepcion, \"Ang Kagilagilalas na Paglalakbay nina Mumo at Am-I\"\n* Third Prize: Bernadette V. Neri, \"Parada ng mga Alingawngaw\"\nTula\n* First Prize: Carlos M. Piocos III, \"Guerra Cantos\"\n* Second Prize: Romulo P. Baquiran Jr., \"Parokya\"\n* Third Prize: Mark Anthony S. Angeles, \"Engkantado\"\nTulang Pambata\n* First Prize: No Winner\n* Second Prize: No Winner\n* Third Prize: Will P. Ortiz, \"May Puso Ang Saging\"\nSanaysay\n* First Prize: Maria Clarissa N. Estuar, \"Ang Reyna ng mga Tumbong\"\n* Second Prize: Ferdinand P. Jarin, \"D’Pol Pisigan Band\"\n* Third Prize: Mark Gil M. Caparros, \"Sina Bunso at ang mga Batang Preso\"\nDulang May Isang Yugto\n* First Prize: Nicolas B. Pichay, \"Isang Araw sa Karnabal\"\n* Second Prize: Floy C. Quintos, \"Suor Clara\"\n* Third Prize: Allan B. Lopez, \"Higit Pa Dito\"\nDulang Ganap ang Haba\n* First Prize: No Winner\n* Second Prize: Liza C. Magtoto, \"Rated PG\"\n* Third Prize: Christian R. Vallez, \"Kapeng Barako Club: Samahan ng mga Bitter\"\nDulang Pampelikula\n* First Prize: Kristoffer G. Brugada, \"Patikul\"\n* Second Prize: Jerry B. Gracio, \"Magdamag\"\n* Third Prize: No Winner\nRegional Division\nShort Story [Cebuano]\n* First Prize: Richel G. Dorotan, \"Si Tarzan\"\n* Second Prize: Jonecito R. Saguban, \"Tinuboang Sapatos\"\n* Third Prize: Noel P. Tuazon, \"Patas\"\nShort Story [Hiligaynon]\n* First Prize: Andy P. Perez, \"Bayuso\"\n* Second Prize: Ferdinand L. Balino, \"Dumdumon Ko Ang Imo Guya\"\n* Third Prize: Jesus C. Insilada, \"Walingwaling\"\nShort Story [Iluk]\n* First Prize: Sherma E. Benosa, \"Dagiti Pasugnod ni Angelo\"\n* Second Prize: Ariel S. Tabag, \"Voice Tape\"\n* Third Prize: Joel B. Manuel, \"Apo Bannual! Apo Bannual!\"\nKabataan Division\nKabataan Essay\n* First Prize: Miro Frances D. Capili, \"The Nature of Nurture\"\n* Second Prize: Anton Raphael S. Cabalza, \"A Shot at Perfection\"\n* Third Prize: Catherine D. Tan, \"Green at Heart\"\nKabataan Sanaysay\n* First Prize: Christopher S. Rosales, \"Gulayan Klasrum\"\n* Second Prize: Marianito L. Dio Jr., \"Ang Aking Pangalan, Ang Aking Kababata at ang Mithing Tilamsik para kay Third\"\n* Third Prize: No Winner\nReferences"
    }
  ]
}