{
  "content": [
    {
      "type": "text",
      "text": "# 2010 Brazilian presidential election debates\n\n(PT), José Serra (PSDB), and Marina Silva (PV) were the leading candidates according to polls.]]\nThe Brazilian presidential election debates of 2010 were held from August 5 to September 30. For the 2010 election, the Superior Electoral Court approved three televised debates, in addition to an unprecedented internet debate.\nAccording to the Superior Electoral Court's guidelines, the candidates whose parties are not represented in the lower chamber of the National Congress are not able to participate in televised debates. Such candidates unsuccessfully challenged this decision in order to participate on the debates.\nThe first televised debate took place on August 5, held by Rede Bandeirantes. The last debate was held on September 30 by Rede Globo, the country's leading free-to-air television network.\nThe first debate\n|Image_Name     =\n|Image_Caption  =\n|AKA            =\n|Participants   = Dilma&nbsp;RousseffJosé&nbsp;SerraMarina&nbsp;SilvaPlínio de Arruda(PT, PSDB, PV and PSOL presidential candidates)\n|Location       = Rua Radiantes, 13Morumbi,São Paulo, São Paulo\n|Date           = August 5, 2010\n|Result         =\n}}\nThe first debate was held on August 5, at 9 PM UTC-3, and it was sponsored by Rede Bandeirantes. Dilma Rousseff from the Workers' Party (PT), José Serra from the Brazilian Social Democracy Party (PSDB), Marina Silva from the Green Party (PV), and Plínio de Arruda Sampaio from the Socialism and Liberty Party (PSOL) were invited, and all of them attended. José Maria de Almeida from the United Socialist Workers' Party (PSTU) tried to participate, but his request was unanimously denied by the Superior Electoral Court.\nThe debate, moderated by Bandeirantes' news anchor Ricardo Boechat, was divided in five blocks of approximately two hours each. This was the first debate broadcast in high-definition television in the country. The topics which dominated the debate were health, public safety, education and infrastructure.\nAnalysis\nMaurício Caleiro, in an analysis published on Observatório da Imprensa, argued that the candidates' performance \"offered no new arguments or data which can decisively influence the polls\".\nJuan Arias, correspondent for El País on Brazil, felt that Rousseff \"revealed her inexperience and nervousness with hesitations, slips of speech, repetition and sweat on her face\". He felt that Serra, on the other hand, \"mastered the subjects, feeling at ease\".\nContrary to many expectations, the name of the highly popular President Luiz Inácio Lula da Silva was almost entirely out of the debate.\nReaction\nAccording to Ibope, the first debate – which aired simultaneously to a soccer match between São Paulo FC and Sport Club Internacional, which were contesting among each other to represent Brazil in the Copa Libertadores finals – was watched by about 5% of viewers (241,000 people) in the Greater São Paulo, while the soccer match was watched by 37%.\nAccording to the local press, the time coincidence between the soccer match and the debate made it clear which is the preference of Brazilians just two months before the election. The press also said the debate was \"boring\", \"predictable\", \"tepid\", and \"bland\".\nArruda, which jokingly attacked Serra during the debate, accusing him of being a hypochondriac for polarizing public health in his speech, was the number one trending topic on Twitter after the debate aired.\n{| border=\"3\" style=\"margin-left: 3em;\"\n|-\n| colspan=\"2\" |\n|-\n| Land reform, public healthcare system, public security, education, and infrastructure\n|}\nThe second debate\n|Image_Name     =\n|Image_Caption  =\n|AKA            =\n|Participants   = José&nbsp;SerraMarina&nbsp;SilvaPlínio de Arruda(PSDB, PV and PSOL presidential candidates)\n|Location       = Av. Paulista, 900Cerqueira César,São Paulo, São Paulo\n|Date           = September 8, 2010\n|Result         =\n}}\nThe second debate was held on September 8, at 11 PM UTC-3, and it was sponsored by TV Gazeta and O Estado de S. Paulo. All candidates were invited to participate, but Dilma Rousseff did not attend. She claimed that her schedule was already full – she attended a Workers' Party rally in her native Minas Gerais.\nThe debate was moderated by TV Gazeta's anchorwoman Maria Lydia Flandoli. Dilma's absence was the high point of the night, with both José Serra and Plínio de Arruda Sampaio harshly criticizing her for not attending. Sampaio made the most striking comment against her, saying that \"[Dilma] is a bluff. She was invented. She is advocating wandering politics\". Serra said that Dilma refused to attend because she has a \"difficulty in explaining what she thinks\". Marina Silva also criticized the Workers' Party presidential candidate absence.\nAccording to guidelines previously established by representatives of PSDB, PV and PSOL, Dilma's podium was left alone in the stage. Serra mistakenly stayed at the podium for a while upon his arrival.\nIn addition to the absence of the leading candidate, the other topic which dominated the debate was the disclosure of tax data of members of Serra's party (including of his daughter Verônica) by employees of the Bureau of Revenue, which Serra had attributed to Dilma's campaign. Silva criticized Guido Mantega's response and said that, if elected, she would take \"all measures so that this outrage does not happen\". Serra once again blamed \"Dilma's Workers' Party\" for the disclosure of the data.\nReaction\nTV Gazeta is a minor television network, and is not available on all major Brazilian cities. Therefore, the second debate had less impact on the public than the first one. According to Ibope, it was watched by 76,000 people in the Greater São Paulo, which corresponded to about 1% of the viewers.\nDilma's absence also contributed to the lack of interest in this debate, once she is the leading candidate in all polls. As a matter of fact, her name was the most tweeted while the debate was airing.\n{| border=\"3\" style=\"margin-left: 3em;\"\n|-\n| colspan=\"2\" |\n|-\n| Natural environment, public data security, sanitation, and education\n|}\nReferences"
    }
  ]
}