{
  "content": [
    {
      "type": "text",
      "text": "# 2010 Hungarian presidential election\n\nAn indirect presidential election was held in Hungary on 29 June 2010. The Prime Minister's nominee Pál Schmitt was elected with two-third majority.\nBackground\nFollowing the 2010 Hungarian parliamentary election, Fidesz came out with an overwhelming majority of seats. With a two-thirds majority requirement needed to elect the president, Fidesz was expected to win since it already had the necessary numbers.\nCandidates\nNominations were due by midday of 25 June 2010; the Hungarian Socialist Party nominated university lecturer and Hungarian ambassador to Thailand András Balogh on 6 June 2010. Fidesz and KDNP nominated Speaker of the House Pál Schmitt on 23 June 2010. Jobbik intended to nominate Krisztina Morvai, and Politics Can Be Different wished to nominate incumbent President László Sólyom, but neither had enough MPs to respectively do so.\nOnce elected, the new president would take office on 5 August 2010.\nPopular poll\nMost Hungarians said they didn't think the President should be a member of any party. 48% of respondents said that the president's independence from the government is among the most important considerations for the office, though 46% said it is also important that the president be able to work well with the prime minister.\nHowever, polling suggested that should the election be a popular one, Schmitt would get 32% of the vote, outgoing President László Sólyom would get 24%, Socialist Party nominee András Balogh would get 14% and Jobbik's Krisztina Morvai would get 6%. 24% said they would not vote for any of the candidates or declined to answer the question.\nResults\n{| class=wikitable style=text-align:right\n|+ 2010 Hungarian presidential election\n!colspan=2 rowspan=2|Candidate\n!rowspan=2|Party\n!colspan=2|First round\n|-\n!Votes!!%\n|-\n|-\n|bgcolor=|\n|align=left|Pál Schmitt\n|align=left|Fidesz\n|263||68.13\n|-\n|bgcolor=|\n|align=left|András Balogh\n|align=left|MSZP\n|59||15.28\n|-\n!colspan=\"5\"|\n|-\n|colspan=3 align=left|Valid votes\n|322||83.41\n|-\n|colspan=3 align=left|Invalid votes\n|44||11.41\n|-\n|colspan=3 align=left|Total\n|366||94.82\n|-\n|colspan=3 align=left|Absentees\n|20||5.18\n|-\n|colspan=3 align=left|Eligible voters/Turnout\n|386||100\n|-\n|}\nReactions\nSeveral Fidesz MP's expressed concern over the electoral outcome saying that though Schmitt was \"a charmer and very capable person,\" they didn't feel he was right for the job because any mistake he may make would reflect poorly on Prime Minister Viktor Orbán, who had selected him.\nThe President of the European Parliament Jerzy Buzek welcomed the election of Schmitt.\nReferences"
    }
  ]
}