{
  "content": [
    {
      "type": "text",
      "text": "# 2010 BBC Sports Personality of the Year Award\n\n| network   =\n| runtime   = 125 minutes\n| previous  = 2009\n| main      = BBC Sports Personality of the Year Award\n| next      = 2011\n}}\nThe 2010 BBC Sports Personality of the Year Award, held on 19 December, was the 57th presentation of the BBC Sports Personality of the Year Awards. Presented by Sue Barker, Jake Humphrey, and Gary Lineker from the LG Arena in Birmingham, it was broadcast on BBC One. Awarded annually by the BBC, the main titular award honours an individual's British sporting achievement over the past year. The winner is selected by public vote from a 10-person shortlist.\nAward process\nThe ten sportspersons on the award shortlist was drawn up by a \"panel of 30 sports editors from national and regional newspapers and magazines\", and announced on 29 November 2010. As a preview to the awards, the nominees were interviewed for Sports Personality of the Year: The Contenders, a special edition of BBC One's Inside Sport, presented by Gabby Logan and broadcast on 13 December 2010.\nThe award ceremony was held on Sunday 19 December at the LG Arena in Birmingham. It was the first time Birmingham had hosted the show since 2007. It was broadcast live on BBC One, with returning presenters Sue Barker, Gary Lineker and Jake Humphrey. The winner was decided by a public telephone vote during the ceremony.\nWinner and nominees\nThe ten nominees featured two from the sport of golf, and one each from athletics, boxing, cricket, cycling, darts, diving, horse racing, and skeleton.\nAP McCoy was named the winner, with 41.98% of the vote. McCoy became the first jockey to win the main award of the night, having finished third in 2002. In 1996, Frankie Dettori had also finished in third. McCoy was also only the second person from Northern Ireland to win the award, after Dame Mary Peters. Phil Taylor finished second with 10.33% of the vote, becoming the first darts players to finish in the top three. Jessica Ennis finished in third place, with 9.02% of the vote. Ennis had also finished in third in the previous year.\nMcCoy was presented the trophy by previous winner Andrew Flintoff and Cesc Fàbregas.\n{| class=\"wikitable sortable\"\n! width=\"130\" |Nominee\n! width=\"100\" |Sport\n!2010 achievement\n!BBC Profile\n!Votes (percentage)\n|- style=\"font-weight:bold; background:gold;\"\n| AP McCoy || Horse racing || Rode ''Don't Push It'' to win the Grand National for the very first time at his 15th attempt, having won more races than any jump jockey in history. || [https://news.bbc.co.uk/sport2/hi/tv_and_radio/sports_personality_of_the_year/9204227.stm]||\n|- style=\"background:silver;\"\n| Phil Taylor || Darts || Becoming the World Darts Champion for a record 15th time by winning the PDC tournament in January, hitting a double Nine-dart finish in the PDC Premier League Darts and winning a further six major titles during the year. || [https://news.bbc.co.uk/sport2/hi/tv_and_radio/sports_personality_of_the_year/9204249.stm]||\n|- style=\"background:tan;\"\n| Jessica Ennis || Athletics || Winning the heptathlon gold medal at the European Athletics Championships in Barcelona, as well as winning the pentathlon gold at the World Indoor Championships. || [https://news.bbc.co.uk/sport1/hi/tv_and_radio/sports_personality_of_the_year/9204228.stm]||\n|-\n| Lee Westwood || Golf || Becoming the first European World Number One since 1994, in a season which included victory at the St. Jude Classic, being a runner-up at The Masters and The Open, and key contributions in The Ryder Cup. || [https://news.bbc.co.uk/sport1/hi/tv_and_radio/sports_personality_of_the_year/9204231.stm]||\n|-\n| Graeme McDowell || Golf || Becoming the first European winner of the U.S. Open since 1970 and first person from the UK since 1999 to win a major, scoring 284 at the tournament at Pebble Beach. || [https://news.bbc.co.uk/sport1/hi/tv_and_radio/sports_personality_of_the_year/9204196.stm]||\n|-\n| Tom Daley || Diving || Winning two gold medals in the 10m platform and the synchronized 10m platform at the Commonwealth Games. || [https://news.bbc.co.uk/sport1/hi/tv_and_radio/sports_personality_of_the_year/9204287.stm]||\n|-\n| Mark Cavendish || Cycling || Winning five stages of the Tour de France, followed by taking 3 stages and the Points Jersey in the Vuelta a España || [https://news.bbc.co.uk/sport2/hi/tv_and_radio/sports_personality_of_the_year/9204239.stm]||\n|-\n| Amy Williams || Skeleton || By winning the gold medal in the Women's Skeleton at the Winter Olympics, Williams became the first British individual winter gold medallist in thirty years. || [https://news.bbc.co.uk/sport1/hi/tv_and_radio/sports_personality_of_the_year/9204234.stm]||\n|-\n| Graeme Swann || Cricket || For his spin bowling for England against Bangladesh and Pakistan, and in the World Twenty20 competition, in which Swann was England's leading wicket taker. || [https://news.bbc.co.uk/sport2/hi/tv_and_radio/sports_personality_of_the_year/9204235.stm]||\n|-\n| David Haye || Boxing || Making two successful defences of his WBA World Heavyweight Championship belt, against both John Ruiz and Audley Harrison in an all-British showdown. || [https://news.bbc.co.uk/sport2/hi/tv_and_radio/sports_personality_of_the_year/9216834.stm]||\n|-\n|}\nOther Awards\nHelen Rollason Award\nThe first award of the night, the Helen Rollason Award, was awarded to the co-founder and boss of the Williams Formula One team. Since 1986, Williams has been confined to a wheelchair, but despite this the team have won sixteen Formula One World Championships, becoming the third most successful team in the sport's history. Damon Hill presented Williams with the award.\nYoung Sports Personality\nThe shortlist of three for the Young Sports Personality of the Year was whittled down from a longlist of ten, which featured footballer Conor Coady, taekwondo athlete Jade Jones, wheelchair racer Dan Lucker, gymnast Sam Oldham, table tennis player Liam Pitchford, tennis player Laura Robson, and swimmer Emma Saunders. The panel deciding the shortlist was chaired by broadcaster John Inverdale, and also featured BBC Sport presenter Jake Humphrey, Blue Peter's Helen Skelton, Newsround presenter Ore Oduba, and former winners of the award Amy Spencer and Harry Aikines-Aryeetey.\nThe award was presented by Zara Phillips and Denise Lewis. Tom Daley won the award for the third time, having won it in 2007 and 2009.\n{| class=\"wikitable\"\n|+Winner and Nominees of the 2010 BBC Young Sports Personality of the Year Award\n!Nominee\n!Sport\n!2010 Achievement\n|- style=\"font-weight:bold; background:gold;\"\n|Tom Daley\n|Diving\n|Won two golds at the Commonwealth Games to become the second youngest double Commonwealth champion in history.\n|-\n|Zoe Smith\n|Weightlifting\n|At the Commonwealth Games, Smith became the first English woman to win a Commonwealth medal, with a bronze in the 58 kg.\n|-\n|Jodie Williams\n|Athletics\n|At the World Junior Championships, won gold in the 100m and silver in the 200m. She later recorded a European youth record in the 200m.\n|}\nUnsung Hero Award\nThe Unsung Hero Award was presented to Lance Haggith, a basketball coach. The winner of the BBC East region, Higgins had worked with children and young people of all abilities and disabilities for over thirty years. He had set up two charities to support youngsters in sport, and chaired the Bedfordshire Basketball Association.\nTeam of the Year\nThe Team of the Year Award was awarded to the Europe Ryder Cup Team. Colin Montgomerie collected the award on behalf of the team. The award had previously been awarded to the Ryder Cup team in 1969, 1985, 1987, 1995, and 2002, making this the sixth time it had collected this award.\n{| class=\"wikitable\"\n|+Winner and Nominees of the 2010 BBC Sports Team of the Year Award\n!Nominee\n!Sport\n!2010 Achievement\n|- style=\"font-weight:bold; background:gold;\"\n|Europe Ryder Cup Team\n|Golf\n|Behind after two sessions, the Europeans fought back in the Ryder Cup to beat the USA and regain the historic title.\n|-\n|Chelsea F.C.\n|Football\n|Won both the Premier League and FA Cup in the same season, the first time the club had achieved such a feat.\n|-\n|England\n|Cricket\n|Won the ICC World Twenty20, beating Australia in the final. This was the first time England had won a Cricket World Cup.\n|}\nOverseas Sports Personality\nThe BBC Overseas Sports Personality of the Year was awarded to tennis player Rafael Nadal. After an injury-filled 2009, Nadal won the French Open, Wimbledon, and the US Open, completing his Career Grand Slam. Nadal was only the seventh man to do so in the sport's history. Nadal was the thirteenth tennis player to win the Overseas Sports Personality, the last being three-time winner Roger Federer.\nMichael Johnson presented the award.\nCoach of the Year\nThe BBC Sports Personality of the Year Coach Award had three nominees. Montgomerie was the first golfer to take the award home.\n{| class=\"wikitable\"\n|+Winner and Nominees of the 2010 BBC Sports Personality of the Year Coach Award\n!Nominee\n!Sport\n!2010 Achievement\n|- style=\"font-weight:bold; background:gold;\"\n|Colin Montgomerie\n|Golf\n|As captain, Montgomerie masterminded Europe's victory over the USA in the Ryder Cup.\n|-\n|Andy Flower\n|Cricket\n|Coached England to victory at the ICC World Twenty20 competition.\n|-\n|Ian Holloway\n|Football\n|Guided Blackpool F.C. to the Premier League, ending the club's forty year absence from the top-flight.\n|}\nLifetime Achievement Award\nThe Lifetime Achievement Award was given to footballer David Beckham. The award was given for Beckham's playing career, which includes being England's most-capped outfield player, winning six Premier Leagues, and playing across the world. It also recognised Beckham's roles in the London 2012 Olympics bid, and in the attempt to bring the 2018 World Cup to England. Beckham had won the main award back in 2001.\nSir Bobby Charlton presented the award to Beckham, who received a standing ovation from the audience.\n}}\nExternal links\n*[https://www.bbc.co.uk/sport/sports-personality Official website]"
    }
  ]
}