{
  "content": [
    {
      "type": "text",
      "text": "# 2011 Kids' Choice Awards\n\n| next             = 2012\n}}\nThe '''24th Annual Nickelodeon Kids' Choice Awards''' was held on April 2, 2011, at the Galen Center at the University of Southern California in Los Angeles, California, US's University Park neighborhood due to renovations disallowing use of traditional venue Pauley Pavilion until at least 2013. Jack Black returned as host for the third time since 2006. The 2011 telecast was the first Kids' Choice Awards to take place in the month of April since 2006, as the previous four Kids' Choice telecasts from 2007 to 2010 were held on the last Saturday in March. Nominees were announced on February 10, 2011, for twenty categories. During the show, the Big Green Help Award was presented to Justin Timberlake, an honor given each year. More than 200 million record-breaking votes were cast for this year's 20-category awards.\nMusical performances during the awards telecast included Big Time Rush, who performed their single \"Boyfriend\" from their gold certified debut album BTR with a surprise appearance by Snoop Dogg, who was slimed at the end of the song.  (This marked the second time a Nickelodeon act performed during the actual Kids' Choice telecast after The Naked Brothers Band in 2008); The Black Eyed Peas and Willow Smith also performed during the awards telecast, and each sang a medley of some of their 2 latest hit singles.\nFor the third year in a row, the award show was preceded by a ''Countdown to Kids' Choice! pre-show telecast, which aired live from 7 to 8 p.m. ET as wraparound segments during regularly scheduled programming; the pre-show was hosted by BrainSurge host Jeff Sutphen, Victorious cast member Daniella Monet, iCarly'' cast member Noah Munck, and recording artist Aaron Fresh. Train performed their 2010 hit single \"Hey, Soul Sister\" during the pre-show; Victoria Justice, who was also a presenter during the awards telecast, performed the single \"Beggin' on Your Knees\" from the upcoming soundtrack to her Nickelodeon series Victorious during the pre-show. The song was also featured during a new episode of Victorious, also titled \"Beggin' on Your Knees\", which aired immediately following the awards at 9:35&nbsp;p.m. ET/PT.\nLike the previous year, Nickelodeon's sister channels TeenNick and Nicktoons suspended regular programming during the 95-minute duration of the award show, allowing viewers to see the awards. A portion of Figueroa Street and Jefferson Boulevard fronting Galen Center was blocked off for the \"orange carpet\", a stage, and the grandstand for fans to watch the broadcasting of the pre-show. On April 1, Nickelodeon reported the slime was stolen as part of the April Fool's Day joke.\nAs with previous years, voting took place online via the (no longer active) program's official webpage (www.nick.com/kca11) and mobile site (m.nick.com/kca11) beginning on March 7, along with an iPhone/iPad application made specifically for the awards as introduced in the previous year. In addition, the network's Facebook page also allowed voting via the Facebook accounts of 'fans' of the channel for the first time.\nPresenters and performers, and stunts for KCA 2011\nHosts\n* Jack Black\n* Pre-show hosts: Aaron Fresh, Daniella Monet, Noah Munck, and Jeff Sutphen\nPresenters\n* Russell Brand\n* Nick Cannon\n* Miranda Cosgrove\n* Rosario Dawson\n* Randy Jackson\n* Joe Jonas\n* Victoria Justice\n* Kim and Kourtney Kardashian\n* Heidi Klum\n* Jane Lynch\n* Taylor Momsen\n* Cory Monteith\n* Keke Palmer\n* Rico Rodriguez\n* Jason Segel\n* Steven Tyler\n* Sofia Vergara\n* Shaun White\n* The Big Show\nPerformers\n* Big Time Rush – \"Boyfriend\" (feat. Snoop Dogg)\n* The Black Eyed Peas – \"I Gotta Feeling\" with Jack Black, \"The Time (Dirty Bit)\", \"Just Can't Get Enough\"\n* Willow Smith – \"21st Century Girl\", \"Whip My Hair\"\n* Victoria Justice – \"Beggin' on Your Knees\" (pre-show)\n* Train – \"Hey, Soul Sister\" (pre-show)\nAnnouncer\n* Tom Kenny\nSpecial appearances\n* Britney Spears only appeared in the skit when she was calling security on Po from Kung Fu Panda.\n* Jim Carrey appeared at the end of the show in a giant hot-air balloon.\n* Po the Panda Bear from Kung Fu Panda (voiced by Jack Black) appeared in the audience at least three times performing in mini-skits with Britney Spears.\n*Blu and Jewel from Rio (voiced by Jesse Eisenberg and Anne Hathaway) appeared backstage at the awards.\nNicktoon appearances\nThe following characters (except Po) announce certain unseen awards between commercials.\n*Kung Fu Panda 2 and Kung Fu Panda: Legends of Awesomeness – Po\n*The Penguins of Madagascar – The Penguins and King Julien, announcing Favorite Butt-kicker\n*T.U.F.F. Puppy – Agents Dudley Puppy and Kitty Katswell, announcing Favorite Animated Movie\n*The Fairly OddParents – Cosmo, Wanda and Poof (in CGI), announcing Favorite Male Singer\n*Planet Sheen – Sheen and Nesmith, announcing Favorite Book.\n*Rio – Blu and Jewel (not Nicktoons but to promote their movie), announcing Favorite Female Singer\n*Monkey Quest – Monkeys, announcing Favorite Cartoon, Favorite TV Actor, and Favorite Video Game\n*Fanboy & Chum Chum – Fanboy and Chum Chum, announcing Favorite Male Athlete\nWinners and nominees\nWinners are listed first, in bold. Other nominees are in alphabetical order.\nMovies\n{| class=\"wikitable\" style=\"width:100%;\"\n|-\n! style=\"background:#EEDD82; width:50%\"| Favorite Movie\n! style=\"background:#EEDD82; width:50%\"| Favorite Movie Actor\n|-\n| valign=\"top\" |\n*The Karate Kid\n**Alice in Wonderland\n**Diary of a Wimpy Kid\n**Harry Potter and the Deathly Hallows – Part 1\n| valign=\"top\" |\n*Johnny Depp – Alice in Wonderland as Tarrant Hightopp / The Mad Hatter\n**Jack Black – ''Gulliver's Travels as Lemuel Gulliver\n**Dwayne Johnson – Tooth Fairy as Derek Thompson / Tooth Fairy\n**Jaden Smith – The Karate Kid as Dre Parker\n|-\n! style=\"background:#EEDD82; width:50%\"| Favorite Movie Actress\n! style=\"background:#EEDD82; width:50%\"| Favorite Animated Movie\n|-\n| valign=\"top\" |\n*Miley Cyrus – The Last Song as Veronica \"Ronnie\" Miller\n**Ashley Judd – Tooth Fairy as Carly Harris\n**Kristen Stewart – The Twilight Saga: Eclipse as Bella Swan\n**Emma Watson – Harry Potter and the Deathly Hallows – Part 1 as Hermione Granger\n| valign=\"top\" |\n*Despicable Me\n**How to Train Your Dragon\n**Shrek Forever After\n**Toy Story 3\n|-\n! style=\"background:#EEDD82; width:50%\"| Favorite Voice From an Animated Movie\n! style=\"background:#EEDD82; width:50%\"| Favorite Buttkicker\n|-\n| valign=\"top\" |\n*Eddie Murphy – Shrek Forever After as Donkey\n**Tim Allen – Toy Story 3 as Buzz Lightyear\n**Cameron Diaz – Shrek Forever After as Princess Fiona\n**Tom Hanks – Toy Story 3 as Woody\n| valign=\"top\" |\n*Jackie Chan – The Karate Kid as Mr. Han\n**Steve Carell – Despicable Me as Gru\n**Robert Downey Jr. – Iron Man 2 as Tony Stark / Iron Man\n**Will Ferrell – Megamind as Megamind\n|}\nTelevision\n{| class=\"wikitable\" style=\"width:100%;\"\n|-\n! style=\"background:#EEDD82; width:50%\"| Favorite TV Show\n! style=\"background:#EEDD82; width:50%\"| Favorite TV Actor\n|-\n| valign=\"top\" |\n*iCarly\n**Big Time Rush\n**The Suite Life on Deck\n**Wizards of Waverly Place\n| valign=\"top\" |\n*Dylan Sprouse – The Suite Life on Deck as Zack Martin\n**Joe Jonas – Jonas as Joseph \"Joe\" Lucas\n**Nick Jonas – Jonas as Nicholas \"Nick\" Lucas\n**Cole Sprouse – The Suite Life on Deck as Cody Martin\n|-\n! style=\"background:#EEDD82; width:50%\"| Favorite TV Actress\n! style=\"background:#EEDD82; width:50%\"| Favorite TV Sidekick\n|-\n| valign=\"top\" |\n*Selena Gomez – Wizards of Waverly Place as Alex Russo\n**Miranda Cosgrove – iCarly as Carly Shay\n**Miley Cyrus – Hannah Montana as Miley Stewart / Hannah Montana\n**Victoria Justice – Victorious as Tori Vega\n| valign=\"top\" |\n*Jennette McCurdy – iCarly as Sam Puckett\n**David Henrie – Wizards of Waverly Place as Justin Russo\n**Noah Munck – iCarly as Gibby Gibson\n**Brenda Song – The Suite Life on Deck as London Tipton\n|-\n! style=\"background:#EEDD82; width:50%\"| Favorite Reality Show\n! style=\"background:#EEDD82; width:50%\"| Favorite Cartoon\n|-\n| valign=\"top\" |\n*American Idol\n**America's Funniest Home Videos\n**America's Got Talent\n**Wipeout\n| valign=\"top\" |\n*SpongeBob SquarePants\n**The Penguins of Madagascar\n**Phineas and Ferb\n**Scooby-Doo! Mystery Incorporated\n|}\nMusic\n{| class=\"wikitable\" style=\"width:100%;\"\n|-\n! style=\"background:#EEDD82; width:50%\"| Favorite Music Group\n! style=\"background:#EEDD82; width:50%\"| Favorite Male Singer\n|-\n| valign=\"top\" |\n*The Black Eyed Peas\n**Big Time Rush\n**Jonas Brothers\n**Lady Antebellum\n| valign=\"top\" |\n*Justin Bieber\n**Jay Z\n**Bruno Mars\n**Usher\n|-\n! style=\"background:#EEDD82; width:50%\"| Favorite Female Singer\n! style=\"background:#EEDD82; width:50%\"| Favorite Song\n|-\n| valign=\"top\" |\n*Katy Perry\n**Miley Cyrus\n**Selena Gomez\n**Taylor Swift\n| valign=\"top\" |\n*\"Baby\" – Justin Bieber feat. Ludacris\n**\"California Gurls\" – Katy Perry feat. Snoop Dogg\n**\"Hey, Soul Sister\" – Train\n**\"Mine\" – Taylor Swift\n|}\nSports\n{| class=\"wikitable\" style=\"width:100%\"\n|-\n! style=\"background:#EEDD82; width:50%\"| Favorite Male Athlete\n! style=\"background:#EEDD82; width:50%\"| Favorite Female Athlete\n|-\n| valign=\"top\" |\n*'Shaquille O'Neal\n**Peyton Manning\n**Michael Phelps\n**Shaun White\n| valign=\"top\" |\n*Lindsey Vonn\n**Danica Patrick\n**Serena Williams\n**Venus Williams\n|}\nMiscellaneous\n{| class=\"wikitable\" style=\"width:100%\"\n|-\n! style=\"background:#EEDD82; width:50%\"| Favorite Book\n! style=\"background:#EEDD82; width:50%\"| Favorite Video Game\n|-\n| valign=\"top\" |\n*Diary of a Wimpy Kid'\n**Dork Diaries\n**Vampire Academy\n**Witch and Wizard\n| valign=\"top\" |\n*Just Dance 2\n**Mario vs. Donkey Kong: Mini-Land Mayhem!\n**Need for Speed: Hot Pursuit\n**Super Mario Galaxy 2''\n|}\nEvents within the show\nSlime stunts\nA giant monster truck jumps over a 50-foot Nickelodeon blimp award into a pool of slime. Hosted by Big Show.\nSlimed celebrities\nIn a pre-show promo, Miranda, Jennette, Nathan, Jerry, and Keke were slimed in slow motion.\n* Jack Black – Jack Black was slimed near the end of the program during a special appearance by Jim Carrey, who himself was slimed while in a hot air balloon-shaped apparatus.\n* Russell Brand – This was not a planned sliming, but Brand and Rico Rodriguez had slime flicked at them by audience members who were slimed by Johnny Depp, following his acceptance of his Favorite Movie Actor award.\n* Nick Cannon – Collateral slime from Heidi Klum.\n* Jim Carrey – Carrey made a special cameo appearance near the end of the program, and was slimed while in a hot air balloon-shaped apparatus. This is also his 2nd sliming since his big sliming at the 2003 KCA's.\n* Johnny Depp – Johnny Depp was not slimed himself, though he slimed several young audience members during his acceptance of his Favorite Movie Actor award.\n* Snoop Dogg – Snoop Dogg was slimed at the end of a performance of the single \"Boyfriend\" by Big Time Rush, in which the rapper also performed as well.\n* Kaley Cuoco – During the Arm Fart Hall of Fame to help win the contest.\n* Josh Duhamel – Duhamel was showered with slime while sitting on a throne, during his acceptance of the viewer-voted celebrity \"Arm Fart Hall of Fame\" award.\n*Jewel and Blu (animated, from Rio) – From backstage, someone spilled slime on Jewel. She shakes some slime off and landed on Blu's eyes, making him see a girl's blue high heel, mistaking him for Jewel, who jokingly leads him off to get his eyes checked.\n* Heidi Klum – Heidi was slimed by an envelope intended to reveal the winner of the Favorite TV Actress award (which went to Selena Gomez for her role in the Disney Channel series Wizards of Waverly Place).\n* Rico Rodriguez – This was not a planned sliming, but Rodriguez and Russell Brand had slime flicked at them by audience members who were slimed by Johnny Depp, following his acceptance of his Favorite Movie Actor award. Beforehand, Brand had \"scolded\" the audience for the mess caused by Depp's sliming.\n* Jason Segel – Segel was slimed by co-presenter Jane Lynch (in an homage to a scene from the pilot episode of the Fox series Glee), in which Lynch dumped a cup filled with slime on Segel's head.\n*Po (animated, from Kung Fu Panda and Kung Fu Panda 2) – Jack Black sends down the slime on his character and Po shouted, \"Awesome!\" and returned to his ancient cartoon China, as stated by Jack Black.\nReferences\n*[https://web.archive.org/web/20120322071437/http://blog.zap2it.com/pop2it/2011/02/kids-choice-awards-2011-nominees-miley-cyrus-justin-bieber-and-selena-gomez-lead.html Nominations]\nExternal links\n*"
    }
  ]
}