{
  "content": [
    {
      "type": "text",
      "text": "# 2012 Serbian presidential election\n\n21.86 pp)\n| image1 = Tomislav Nikolić official portrait, headshot (cropped).jpg\n| candidate1 = Tomislav Nikolić\n| party1 = Serbian Progressive Party\n| popular_vote1 = 1,552,063\n| percentage1 = 51.16%\n| alliance1= Let's Get Serbia Moving\n| image2 = Boris Tadić tokom glasanja 2012 (cropped).jpg\n| candidate2 = Boris Tadić\n| party2 = Democratic Party (Serbia)\n| popular_vote2 = 1,481,952\n| percentage2 = 48.84%\n| alliance2 = Choice for a Better Life\n| title = President\n| posttitle = Elected president\n| before_election = Slavica Đukić Dejanović(acting)\n| before_party = Socialist Party of Serbia\n| after_election = Tomislav Nikolić\n| after_party = Serbian Progressive Party\n| map_image =\n| First round results by municipality\n|\n| Second round results by municipality\n| default = 2\n}}}}\nPresidential elections were held in Serbia on 6 May 2012 alongside parliamentary elections. The elections were called following President Boris Tadić's early resignation in order to coincide with the parliamentary and local elections to be held on the same date. The Speaker of the Parliament, Slavica Đukić Dejanović, took over as the Acting President. As no candidate won a majority, a runoff was on 20 May, with incumbent Tadić facing Tomislav Nikolić of the Serbian Progressive Party.\nAccording to preliminary results published by CeSID, Ipsos and RIK, Tomislav Nikolić had beaten his opponent Boris Tadić to become President of Serbia. Official results confirmed this, putting Nikolić at 51% against Tadić's 49%.\nCandidates\nDespite being elected president of Serbia in 2004 and 2008, Boris Tadić was allowed to run for president for a third time, despite the 2 term constitutional limit, as the Constitutional Law for the Implementation of the Constitution of the Republic of Serbia from 2006 declared that the 2008 election would be considered the first election, following the break-up of Serbia and Montenegro.\nFirst round of the elections was held on 6 May. Republic Electoral Commission has confirmed twelve candidates. Candidate numbers were decided using a random draw on 20 April.\n{| class=\"wikitable\"\n|-\n! No.\n! colspan=2|Candidate\n! colspan=2|Party affiliation\n! Background\n! Proof of nomination\n|-\n| style=\"text-align:center;\"| 1.\n|\n| Zoran Stanković\n| style=\"width:5px; background: ;\" | &nbsp;\n| United Regions of Serbia\n| Former Minister of Health and former Minister of Defence, his first presidential nomination.\n| Submitted 12,332 valid signatures to the electoral commission.\n|-\n| style=\"text-align:center;\"| 2.\n|\n| Vladan Glišić\n|  style=\"width:5px; background:red;\"| &nbsp;\n| Independent, supported by Dveri Organization.\n| Master from University of Belgrade Faculty of Law\n| Submitted 12,733 valid signatures to the electoral commission.\n|-\n| style=\"text-align:center;\"| 3.\n|\n| Boris Tadić\n| style=\"width:5px; background: ;\" | &nbsp;\n| Democratic Party\n| Democratic Party party president. He is running for his third consecutive mandate since 2004 (second since the dissolution of State Union of Serbia and Montenegro).\n| Submitted 27,606 valid signatures to the electoral commission.\n|-\n| style=\"text-align:center;\"| 4.\n|\n| Vojislav Koštunica\n| style=\"width:5px; background: ;\" | &nbsp;\n| Democratic Party of Serbia\n| Leader of Democratic Party of Serbia, former President of the Federal Republic of Yugoslavia (2000–2003) and former Prime Minister of Serbia (2004–2008). He would be running for presidency for a third time. In previous two attempts, in September–October 2002 (30.89% won in first, and 68.4% won in second round) and December 2002 (57.5% won) elections he finished first, however both ballots were declared invalid because the turnout failed to reach the 50% turnout requirement.\n| Submitted 13,089 valid signatures to the electoral commission.\n|-\n| style=\"text-align:center;\"| 5.\n|\n| Zoran Dragišić\n|  style=\"width:5px;\"| &nbsp;\n| Independent\n| Leader of the Movement of Workers and Peasants\n| Submitted 11,464 valid signatures to the electoral commission.\n|-\n| style=\"text-align:center;\"| 6.\n|\n| Jadranka Šešelj\n| style=\"width:5px; background: ;\" | &nbsp;\n| Serbian Radical Party\n| Wife of SRS party leader Vojislav Šešelj. She would be running for presidency for a first time.\n| Submitted 15,312 valid signatures to the electoral commission.\n|-\n| style=\"text-align:center;\"| 7.\n|\n| Muamer Zukorlić\n|  style=\"width:5px;\"| &nbsp;\n| Independent\n| Islamic Community in Serbia Chief Mufti.\n| Submitted 10,653 valid signatures to the electoral commission.\n|-\n| style=\"text-align:center;\"| 8.\n|\n| Danica Grujičić\n|  style=\"width:5px; background:red;\"| &nbsp;\n| Social Democratic Alliance\n| Chief of department of Neurosurgery at Clinical Center of Serbia.\n| Submitted 11,301 valid signatures to the electoral commission.\n|-\n| style=\"text-align:center;\"| 9.\n|\n| Ivica Dačić\n| style=\"width:5px; background: ;\" | &nbsp;\n| Socialist Party of Serbia\n| Leader of SPS and current Minister of Internal Affairs of Serbia, who is running for presidency for a second time, having finished fifth with 4.04% of the vote in the first round of 2004 elections.\n| Submitted 15,666 valid signatures to the electoral commission.\n|-\n| style=\"text-align:center;\"|10.\n|\n| Čedomir Jovanović\n| style=\"width:5px; background: ;\" | &nbsp;\n| Liberal Democratic Party\n| Leader of Liberal Democratic Party, who would also be running for presidency for a second time, having finished fifth with 5.34% of the vote in the first round of 2008 elections.\n| Submitted 11,006 valid signatures to the electoral commission.\n|-\n| style=\"text-align:center;\"|11.\n|\n| István Pásztor\n|  style=\"width:5px; background:green;\"| &nbsp;\n| Alliance of Vojvodina Hungarians\n| Leader of Alliance of Vojvodina Hungarians, who would also be running for presidency for a second time, having finished sixth with 2.26% of the vote in the first round of 2008 elections\n| Submitted 12,533 valid signatures to the electoral commission.\n|-\n| style=\"text-align:center;\"|12.\n|\n| Tomislav Nikolić\n| style=\"width:5px; background: ;\" | &nbsp;\n| Serbian Progressive Party\n| Leader of Serbian Progressive Party, who would be running for presidency for a fourth time having lost previous two times in second round of elections to Boris Tadić, and having won in 2003, but that elections were cancelled due to low turnout (38.8%).\n| Submitted 18,743 valid signatures to the electoral commission.\n|}\nCampaign\nBoth the SNS and the DS supported Serbia's candidature for the EU, with the SNS' Nikolić having sharply contrasted his stance in the past few years. A few hours before the voting centres opened, Tadić told Croatian television that \"anything else [than a Democratic Party victory] would be a big risk and a big gamble for Serbia's European integration [and] for regional politics.\"\nShortly after the first round, a preliminary coalition agreement between the DS and the SPS was reached, which meant that the SPS would also endorse Tadić in the run-off. The DSS officially supported Nikolić in the run-off.\nMonitors\nThe Center for Free Elections and Democracy were amongst the electoral observers.\nResults\nAbout 6.7 million people were eligible to vote for the 12 candidates. The Organization for Security and Co-operation in Europe will undertake the organization of voting for the roughly 109,000 Serb voters in Kosovo.  These results include the districts of the newly formed Republic of Kosovo, which at the same time has elections independent of the Serbian nation. Voting stations were open from 7:00 to 20:00 with no incidents reported across the country. Voter turnout by 18:00 was 46.34% in Belgrade, 48.37% in central Serbia and 47.89% in Vojvodina. The first round resulted in no clear victory for any candidate. With 25% of ballots counted, Boris Tadić was leading with 26.7% over Tomislav Nikolić who had 25.5% of the vote.\nIn the second round Nikolić received 51% of the vote to 49% for Tadić. The results were a surprise, as stated by Russian media, based on previous polls. \"This was an electoral earthquake, a totally unexpected result,\" political analyst Slobodan Antonić said on Serbia's RTS state television.\nReferences"
    }
  ]
}