{
  "content": [
    {
      "type": "text",
      "text": "# 2012 Outer Critics Circle Awards\n\n| venue = Sardi's\n| hosts = Jerry Stiller, Anne Meara, Josh Gad, Montego Glover, Jon Robin Baitz, James Corden, Tracie Bennett, Audra McDonald, James Earl Jones, Michael McGrath and Judy Kaye\n}}\nThe 2012 Outer Critics Circle Awards winners were announced on May 14, 2012, recognizing excellence in Broadway and Off-Broadway productions during the 2011–12 season. Nominations were announced on April 23, 2012, with Nice Work If You Can Get It leading the nominations with nine. Following close behind were Once and Newsies with seven each. Among plays, the revival of Death of a Salesman and led with five nominations, the most of any play.\nOnce and One Man, Two Guvnors won the most awards, with three each. Close behind were Newsies, Follies, Nice Work If You Can Get It and Spider-Man: Turn Off the Dark with two wins each.\nAwards and nominations\nThe award winners were announced on May 14, 2012, followed by an awards ceremony at Sardi's featuring Jerry Stiller, Anne Meara, Josh Gad, Montego Glover, Jon Robin Baitz, James Corden, Tracie Bennett, Audra McDonald, James Earl Jones, Michael McGrath and Judy Kaye as presenters.\nWinners include One Man, Two Guvnors as | Outstanding New Broadway Play, Once as Outstanding New Broadway Musical, Sons of the Prophet by Stephen Karam as Outstanding New Off-Broadway Play, and Michael John LaChiusa's Queen of the Mist as Outstanding New Off-Broadway Musical. The Submission by Jeff Talbot received the John Gassner Award.\n{| class=\"wikitable\"\n|+\n!Category\n!Winner and nominees\n|-\n| Outstanding New Broadway Play\n|\n|-\n| Outstanding New Broadway Musical\n|\n|-\n| Outstanding New Off-Broadway Play\n|\n|-\n| Outstanding New Off-Broadway Musical\n|\n|-\n| Outstanding Revival of a Play\n|\n|-\n| Outstanding Revival of a Musical\n|\n|-\n| John Gassner Award\n|\n|-\n| Outstanding New Score (Broadway or Off-Broadway)\n|\n|-\n| Outstanding Director of Play\n|\n|-\n| Outstanding Director of a Musical\n|\n|-\n| Outstanding Choreography\n|\n|-\n|Outstanding Actor in a Play\n|\n|-\n|Outstanding Actress in a Play\n|\n|-\n|Outstanding Featured Actor in a Play\n|\n|-\n|Outstanding Featured Actress in a Play\n|\n|-\n| Outstanding Actor in a Musical\n|\n|-\n|Outstanding Actress in a Musical\n|\n|-\n|Outstanding Featured Actor in a Musical\n|\n|-\n|Outstanding Featured Actress in a Musical\n|\n|-\n| Outstanding Solo Performance\n|\n|-\n|Outstanding Scenic Design\n|\n|-\n|Outstanding Costume Design\n|\n|-\n|Outstanding Lighting Design\n|\n|}\nReferences"
    }
  ]
}