{
  "content": [
    {
      "type": "text",
      "text": "# 2012 Egyptian presidential election__disambig_1\n\n| turnout = 46.42% (first round) 51.85% (second round)\n| candidate1 = Mohamed Morsi\n| image1 = Mohamed Morsi official portrait.jpg\n| party1 = Freedom and Justice Party (Egypt)\n| popular_vote1 = 13,230,131\n| percentage1 = 51.73%\n| candidate2 = Ahmed Shafik\n| image2 = File:Ahmad Shafik.png\n| party2 = Independent politician\n| popular_vote2 = 12,347,380\n| percentage2 = 48.27%\n| title = Head of state\n| before_election = Mohamed Hussein Tantawi  Chairman of the Military Council\n| before_party = Independent politician\n| after_election = Mohamed Morsi\n| after_party = Freedom and Justice Party (Egypt)\n| map_image = 2012 Egyptian presidential election by governorate.svg\n| map_caption = Second round results by governorateMorsi:    Shafik:\n}}\nPresidential elections were held in Egypt in 2012, with the first round on 23 and 24 May 2012 and the second on 16 and 17 June. They were the first democratic presidential elections in Egyptian history. The Muslim Brotherhood declared early 18 June 2012 that its candidate Mohamed Morsi had won, the first victory of an Islamist as head of state in the Arab world. It was the second presidential election in Egypt's history with more than one candidate, following the 2005 election, and the first presidential election after the 2011 Egyptian revolution which ousted president Hosni Mubarak, during the Arab Spring. However, Morsi's presidency was brief and short-lived. He later faced massive protests for and against his rule, only to be ousted in a military coup in July the following year.\nIn the first round, with a voter turnout of 46%, vote-splitting between the major moderate or pro-democracy candidates created a center squeeze, leading to the elimination of Hamdeen Sabahi and Amr Moussa (the likely majority-preferred candidates) in the first round. The elections set the stage for the divisions that were to follow, along sharia and secular lines, and those opposed to and those supporting the former political elite. Islamist candidates Morsi and Fotouh won roughly 42% of the vote, while the remaining three secular candidates won 56% of the vote. Candidates Shafik and Moussa held positions under the Mubarak regime and won 35% of the vote, while Sabahi was a prominent dissident during the Sadat and Mubarak regimes.\nFollowing the second round, with a voter turnout of 52%, on 24 June 2012, Egypt's election commission announced that Muslim Brotherhood candidate Mohamed Morsi had won Egypt's presidential elections. Morsi won by a narrow margin over Ahmed Shafik, the final prime minister under deposed President Hosni Mubarak. The commission said Morsi took 51.7% of the vote versus 48.3% for Shafik. Morsi was sworn in on 30 June 2012. To date, this is the last (and only) presidential election in Egyptian history which is broadly considered to have been democratically free and fair. Morsi's victory also marked the first time civilians ruled Egypt since the 1952 coup.\nRules\nThe rules for the election were released on 30 January 2012. The election would be held under the two-round system. Candidates had to be born in Egypt to Egyptian parents, may not have held dual nationality and may not have been married to a foreigner. To be nominated, they required the support of 30 Members of Parliament or 30,000 voters. According to the electoral committee, the formal registration process for candidates started on 10 March and ended on 8 April 2012 at 2&nbsp;pm.\nQualified candidates\n23 candidates officially registered to contest the elections. The Supreme Presidential Electoral Commission (SPEC) was expected to release the list of candidates who fulfil the legal requirements and are eligible for the presidency on 26 April.\nOn 14 April 2012, the Supreme Presidential Electoral Commission (SPEC) announced the disqualification of ten candidates: Omar Suleiman, Khairat El-Shater, Hazem Salah Abu Ismail, Ayman Nour, Ahmad Awad Al-Saidi, Mortada Mansour, Ibrahim El-Gharib, Mamdouh Qutb, Houssam Khayrat, and Ashraf Barouma. Reasons for the disqualifications were not given, but the affected candidates were given 48 hours to appeal the decisions. Abu Ismail, El-Shater, and Suleiman's campaigns stated they would file appeals. All appeals were rejected.\nOn 23 April, the SCAF ratified the Corruption of Political Life Law (aka the Disenfranchisement Law), which was passed by the People's Assembly on 12 April. The new law stipulated that any individual who served as President of the Republic, vice president, prime minister, or a high-ranking NDP official during the ten years prior to 11 February 2011 (day of Hosni Mubarak's resignation) would not be eligible to run or hold public office for ten years, effective 11 February 2011. The law disqualified presidential hopefuls Ahmed Shafik (prime minister) and Omar Suleiman (vice-president), but did not exclude Amr Mussa.\nOn 25 April the Supreme Presidential Electoral Commission (SPEC) accepted the appeal filed by Ahmed Shafik against its previous decision to exclude him from running for president. Therefore, a total of 13 candidates were left standing in SPEC's final list. The appeal also requested the new Parliamentary law be brought before the Supreme Constitutional Court to determine its constitutionality.\nOn 16 May 2012, Mohammad Fawzi Issa announced his withdrawal from the race in support of Amr Moussa. His name however was not removed from the ballot paper as the official date of withdrawal had already passed.\nMain registered presidential candidates\n{| class=\"wikitable\" style=\"text-align:center\"\n|-\n! Photo\n! Candidate\n! Details\n! Party affiliation\n! Electoral Symbol\n|-\n|\n| Ahmed Shafik\n| Air Marshal, former Minister of Civil Aviation and last Prime Minister of Egypt under Hosni Mubarak.\n| Independent\n|Ladder\n|-\n|\n| Khaled Ali\n| Lawyer and labor activist. Former head of the Egyptian Center for Economic and Social Rights (ECESR), founding member of Hisham Mubarak Law Center (HMLC)\n| Independent\n|Tree\n|-\n|\n| Mohammad Salim Al-Awa\n| Ex-Secretary General of the International Union of Muslim Scholars and head of the Egyptian Association for Culture and Dialogue\n| Independent\n|Umbrella\n|-\n|\n| Hisham Bastawisy\n| Egyptian judge and the vice president of the Egyptian Court of Cassation. Tagammu nominee\n| Tagammu\n|Watch\n|-\n|\n| Abu Al-Izz Al-Hariri\n| The Revolution Continues Alliance MP, and Socialist Popular Alliance Party nominee\n| Socialist Popular Alliance Party\n|Pyramid\n|-\n|\n| Mohamed Morsi\n| Candidate of the Freedom and Justice Party. Replacement candidate after the elimination of Khairat El-Shater. Former Member of Parliament (2000–2005).\n| Freedom and Justice Party\n|Balance\n|-\n|\n| Amr Moussa\n| The ex-Secretary-General of the League of Arab States and former Foreign Minister.\n| Independent\n|Sun\n|-\n|\n| Hamdeen Sabahi\n| Founder of the Nasserist Dignity Party.\n| Dignity Party\n|Eagle\n|-\n|\n| Abdel Moneim Aboul Fotouh\n| Secretary general of the Arab Medical Union\n| Independent\n(received the endorsement of Salafi Al-Nour Party, moderate Islamic Al-Wasat Party and Egyptian Current Party.)\n|Horse\n|}\nMohamed Morsi\nMohamed Morsi was the chairman of the Freedom and Justice Party (FJP), a political party that was founded by the Muslim Brotherhood after the 2011 Egyptian revolution, since 30 April 2011.[http://www.ikhwanonline.com/new/Article.aspx?ArtID=83459&SecID=211  He was a Member of Parliament from 2000 to 2005.\nMorsi received a bachelor's and master's degree in engineering from Cairo University in 1975 and 1978. He received his PhD in engineering from the University of Southern California in 1982. He was an assistant professor at California State University, Northridge from 1982 to 1985. In 1985 he went back to Egypt to teach at Zagazig University.\nKairat El-Shater had been put forward as candidate, but he was excluded from the race. As a replacement, the Muslim Brotherhood in Egypt fielded Mohamed Morsi, chairman of the Freedom and Justice Party, he faced Ahmed Shafik in a run-off vote on 16–17 June 2012.\nOn 24 June 2012, Egypt's election commission announced that Muslim Brotherhood candidate Mohamed Morsi has won Egypt's presidential runoff. Morsi won by a narrow margin over Ahmed Shafik, the last prime minister under deposed leader Hosni Mubarak. The commission said Morsi took 51.7 percent of the vote versus 48.3 for Shafik.\nAhmed Shafik\nAhmed Shafik officially launched his presidential campaign on 2 November 2011. He was the last Prime Minister appointed by Hosni Mubarak after the beginning of the 2011 revolution in January. He resigned only three weeks after the deposition of the long-term president. Shafik claims to be on good terms with the ruling Supreme Council of the Armed Forces.\nShafik was first disqualified in the wake of the ratification of the Corruption of Political Life Law (aka the Disenfranchisement Law), which banned Mubarak-era PMs from nomination. He immediately appealed the decision and on 25 April the Supreme Presidential Electoral Commission (SPEC) accepted his appeal, which puts him back in the race.\nShafik collected 48.3 percent of the vote in the presidential runoff.\nAbdel Moneim Aboul Fotouh\nAbdel Moneim Aboul Fotouh, a doctor by practice and a former Muslim Brotherhood figure popular with Egyptian youths, declared his candidacy in May 2011. He was expelled from the Brotherhood for this decision on 20 June of that year, as it contradicted an earlier decision that the Brotherhood would not put forward a candidate in 2011. The Muslim Brotherhood contradicted their initial position on 31 March 2012 when they put forward Khairat El-Shater as the Brotherhood's candidate and Mohamed Morsi as his replacement. Aboul Fotouh is well known for his staunch opposition to both the Sadat and Mubarak regimes, as well as his openness towards people of different political views. He was detained once during Sadat's rule and twice during Mubarak's rule. He promised to appoint a vice-president who is a youth revolutionary and to fill over half of the country's important posts with people under the age of 45.\nDespite coming from the moderate-to-liberal wing of the Islamist movement, Aboul Fotouh won the endorsement of the Salafi Al-Nour Party on 28 April 2012.\nKhaled Ali\nKhaled Ali announced his campaign on 27 February 2012 and applied for election on 8 April 2012 as an independent, with the support of 32 elected officials in both chambers of parliament. At 40 years old, he was the youngest candidate to enter the race.  Ali is a prominent Egyptian lawyer and activist, known for his work advocating reform of corruption in the government and private sector and his promotion of social justice and labor rights. Al-Ahram Weekly called him a \"legendary anti-corruption crusader\". In 2011 he won the \"Egyptian Corruption Fighter\" award.\nMany of Ali's supporters saw him as filling the void left by Mohamed ElBaradei's withdrawal. Ali was not well known to the majority of Egyptians, and even those familiar with him tended to be surprised by his decision to run. Ali's lack of experience as a politician was a concern, and many, even in the revolutionary movement, remained skeptical about his candidacy. Critics argued that he was unlikely to win, and expressed concern that he could split the vote in a way that would sway the election towards representatives of the prior regime.\nSocialist Popular Alliance Party and Egyptian Socialists members told Egypt Independent that they are seriously considering backing Ali's candidacy. \"Up until now, the situation is unclear. Khaled may be our choice. Some are proposing a potential partnership between Khaled Ali and Abouel Fotouh [where Ali can run as his deputy],\" said Marwa Farouk, a member of the Popular Alliance.\nMohammed Salim Al-Awa\nMohammad Salim Al-Awa, an Islamic thinker, declared his candidacy on 14 June 2011. The fact that Al-Awa and Aboul Fotouh belong to the same school of thought have led to press speculation about vote-splitting and the possibility of their uniting behind a single candidate. Aboul Fotouh recognized this possibility.\nHisham Bastawisy\nHisham Bastawisy is an Egyptian judge and the vice president of the Egyptian Court of Cassation. He was one of the leaders of the Egyptian opposition before and during the 2011 Egyptian revolution. He is running for the Egyptian presidential elections as a representative of the National Progressive Unionist Party (Tagammu).\nAbu Al-Izz Al-Hariri\nAbu Al-Izz Al-Hariri is an Alexandria MP representing the Socialist Popular Alliance Party and The Revolution Continues Alliance. He filed his application on 13 March 2012.\nAmr Moussa\nWhen asked about the rumors that he might run for the 2012 presidential elections, Amr Moussa refused to rule out the possibility of running for the office, leaving the door open to expectations. He argued that, \"It's the right of every citizen that has the capacity and efficiency to aspire to any political office that would allow him to contribute to the service of his nation\". He further stated to the press that the qualities required of the president also apply to Gamal Mubarak, arguing that the citizenship, rights and obligations which apply to himself can also be applied to Gamal. He also expressed appreciation for \"the confidence expressed by many people when they talk about his candidacy for the Egyptian presidency, and expressed that the message reached him.\".\nOn 27 February 2011 he announced he would be running for president saying \"God willing, I will be one of them.\"\nHamdeen Sabahi\nHamdeen Sabahi, the leader of the Nasserist Dignity Party officially filed his application on 6 April 2012. He would later run for the presidency again two years later in the 2014 presidential election against Abdel Fattah el-Sisi, although the latter won a landslide victory, in an election described as a sham by 14 human rights groups who dismissed the results as \"farcical\". They said the authorities had \"trampled over even the minimum requirements for free and fair elections\", stifling basic freedoms and eliminating key challengers.\nMinor candidates\nThe remaining candidates are:\n*Abdullah Alashaal, previous foreign minister assistant, retired ambassador. Authenticity Party nominee.\n*Mahmoud Houssam, as an independent with the support of 30,000 voters. President of the Beginning Party.\n*Houssam Khairallah, Democratic Peace Party nominee.\n*Mohammad Fawzi Issa, Democratic Generation Party nominee – withdrew on 16 May 2012 in favor of Amr Moussa. However, his name remained on the ballot paper as the official date of withdrawal had already passed.\nDisqualified candidates\nMain disqualified candidates\n{| class=\"wikitable\" style=\"text-align:center\"\n|-\n! Photo\n! Candidate\n! Details\n! Party affiliation\n|-\n|\n| Hazem Salah Abu Ismail\n| A Salafist and ultra-conservative figure.\n| Independent\n|-\n|\n| Ayman Nour\n| Founder of the liberal El-Ghad Party and leader of the Ghad El-Thawra Party.\n| Ghad El-Thawra Party\n|-\n|\n| Khairat El-Shater\n| Businessman and deputy supreme guide of the Muslim Brotherhood in Egypt\n| Freedom and Justice Party\n|-\n|\n| Omar Suleiman\n| General and Director of the intelligence service (Mukhabarat), and briefly Vice President under Hosni Mubarak\n| Independent\n|}\nHazem Salah Abu Ismail\nHazem Salah Abu Ismail is an independent, ultra-conservative Salafi Islamist lawyer and politician.\nHe rejects the idea of reconciling the religious law of Islam with personal freedom. He announced to make wearing the veil mandatory for Egyptian women in case of being elected. He would ban the consumption of alcohol in public, even for tourists. Abu Ismail advocates the closure of gambling casinos, which are currently reserved for foreign visitors. Tourists wearing two-piece swimsuits should be arrested, according to Abu Ismail. Moreover, he calls for the abolishment of the Shura Council, which is the upper house of the Egyptian parliament.\nBy 28 March, Abu Ismail had collected 150,000 signatures supporting his candidacy. He was endorsed by 58 members of parliament, the Salafist Scholars Shura Council, and the Salafist Front.\nOn 11 April, the State Council decided that the Ministry of Interior is obliged to provide documents verifying the nationality of the candidate's mother. Thus, he would fail the premise that candidates, their spouses and their parents must hold exclusive Egyptian citizenship. Abu Ismail denies the ministry's assertion and insists that his mother was exclusively Egyptian. The threat to Abu Ismail's candidacy has triggered protests by his supporters.\nAs of 14 April 2012, Abu-Ismail had been barred from the election by the Presidential Election Commission. He had been given 48 hours to appeal the decision.\nAyman Nour\nAyman Nour is the founder of Al-Ghad Party, leader of the Ghad El-Thawra Party and former candidate in the 2005 presidential elections in which he emerged as runner-up to the winning President Hosni Mubarak.\nAyman Nour was jailed in 2006 few months after the presidential elections when he was convicted in charges of forgery. He was later removed from the presidency of Al-Ghad Party. In February 2009, he was released from prison under an amnesty for health reasons. It has been alleged that his release from prison was due to US President Barack Obama demanding his release as a condition to meet with Mubarak.\nAyman Nour's ability to candidate was doubtful, because of being an ex-convict and a former prisoner. However, he was pardoned by the Supreme Council of the Armed Forces (SCAF) and is thus not longer banned from political activity but eligible for the presidency. Nour was also barred from running for the presidency by the Presidential Election Commission.\nKhairat El-Shater\nAfter initially deciding not to field a candidate, the Muslim Brotherhood in Egypt announced on 31 March 2012 that its deputy supreme guide Khairat El-Shater would run in the election.\nEl-Shater, who was convicted and imprisoned for several years during the rule of Mubarak, might be excluded from the race due to the ban of ex-convicts from political activity. The ruling military council had pardoned him, but a case was filed to eliminate him from the election, because the pardon has not been endorsed by a criminal court. The Muslim Brotherhood in Egypt fielded Mohamed Morsi, chairman of the Freedom and Justice Party, as an alternative candidate in case El-Shater's candidacy was invalidated.\nAs of 14 April 2012, El-Shater has been barred from the election by the Presidential Election Commission. His campaign has stated that they would appeal the decision.\nOmar Suleiman\nGeneral Omar Suleiman, who was director of the General Intelligence Service and in 2011 shortly the last vice president under ousted President Hosni Mubarak, announced his candidacy on 6 April 2012.\nAs of 14 April 2012, Suleiman has been barred from the election by the Presidential Election Commission. His campaign appealed the decision but was rejected. Suleiman left the country for medical treatment, reportedly going to Abu Dhabi, then to Germany, then finally to the United States, where he died suddenly on 19 July 2012 while undergoing medical tests in Cleveland, Ohio. His body was taken back to Egypt for a military funeral.\nMinor disqualified candidates\n*Ahmad Awad Al-Saidi, National Party of Egypt nominee.\n*Mortada Mansour, previous Zamalek SC chairman. National Party of Egypt nominee.\n*Ibrahim El-Gharib, as an independent with the support of 30,000 voters.\n*Mamdouh Qutb, previous director general of the Egyptian General Intelligence Directorate, Civilisation Party nominee.\n*Houssam Khayrat, Egyptian Arab Socialist Party nominee.\n*Ashraf Barouma, Quiver Party party president.\nWithdrawn candidates\nMohamed ElBaradei\nIn November 2009 amidst the political controversy over the then prospective 2011 presidential election and the constitutional impediments placed in the faces of candidates under the amended Article 76 in the 2007 constitution and amidst speculation about then-president Hosni Mubarak's son Gamal running for the post, Mohamed ElBaradei decided to respond to the continuous pressing from people who asked him to run for the 2011 election. ElBaradei said in a statement sent from his office in Vienna to Al-Shorouk newspaper that \"He did not announce willingness or unwillingness to participate in the upcoming presidential election... and that he will clear his position on the presidency after November\". His office manager added:\nAt the same time, the New Wafd Party and other opposition political forces have announced that they are ready to support ElBaradei if he decided to run for the election. However, Mohamed ElBaradei stated that if he decides to run for the 2011 elections, he prefers to run as an independent candidate, rather than running as a candidate of any of the existing political parties.\nOn 24 February 2010, ElBaradei met with several opposition leaders and notable intellects at his home in Cairo. The meeting included an announcement of a new non-party-political movement known as the \"National Association for Change\", which called for political reform. A representative of the then-banned Muslim Brotherhood attended the meeting.\nOn 14 January 2012, he withdrew his candidacy in protest against the Supreme Council of the Armed Forces' alleged usurpation of power as he criticised the roadmap of transition to a civilian government following the 2011 revolution. ElBaradei called it a \"travesty\" to elect a president before a new constitution had been drafted.\nAbdelazim Negm\nAbdelazim Negm is a professor of hydraulic engineering at Zagazig University and former vice dean for education and student affairs. He announced his candidacy on 4 March 2011, and withdrew it on 2 April 2012.\nBothaina Kamel\nBothaina Kamel, a media personality and pro-democracy activist, announced her candidacy in April 2011. She dropped out of the race after failing to acquire the necessary number of signatures.\nSaad El-Soghayar\nAl-Sughayar headed to the High Presidential Elections Commission (HPEC) on Tuesday to collect the official application documents and learn of the requirements for running for presidency. A large crowd and folklore music accompanied Al-Sughayar and his band on their visit to the HPEC.\nUpon his visit to the HPEC, the pop star said that he has collected 30,000 recommendations, which were declined due to his failure to fill in required documents prior the submission, reported the Middle East News Agency. He insisted that he will collect more than 55,000 recommendations. He added that his presidential agenda is ambitious and includes several priorities important to the common citizen, with a full healthcare-for-all system at the front line of these priorities.\nHowever, in a television show later that same day, he went to state he did not think that he was qualified for office and not even for any elected office. He added that he pulled this stunt to show the government and the SCAF that the criteria of 30,000 signatures is not a true obstacle to prevent non-serious candidates.\nOpinion polls\nThe first opinion poll conducted in Egypt post-Mubarak was conducted by YouGov. According to the YouGov survey of 1871 Egyptians between 15 and 20 February 2011, Almost half of all Egyptians (49%) believed that Amr Moussa, the secretary general of the Arab League, was the man most capable of leading the next Egyptian government. Other potential presidents, Ahmed Zewill (13%) & Ayman Nour, Mubarak's 2005 Presidential rival (1%), trailed Moussa by a huge margin. Almost 1 in 10 (9%) believed former vice president, Omar Sulieman, should be Egypt's new leader. The majority (81%) of Egyptians believed that the army would facilitate free and fair elections.\nAn April 2011 survey of 1,000 Egyptians by Pew Research Center's Global Attitudes Project with a margin of error of four percentage points found that the most popular Egyptian politician was Amr Moussa with 41% of Egyptians viewing him as \"very favourable,\" followed by Ayman Nour with 32% and Mohamed ElBaradei with 25%. Some 75% had a favourable view of the Muslim Brotherhood, but only 17% believed they should lead the next government.\nA poll conducted during the 2011 protests asking \"who do you think should be the next President of Egypt?\" showed Moussa in the lead, with 26% of respondents naming him.\n{| class=\"wikitable\" style=\"text-align:center\"\n|-\n! Conducted/ Published\n! Polling Organisation/Client\n! Sample size\n! Amr Moussa\n! Abu Ismail\n! Abdel Moneim Aboul Fotouh\n! Omar Suleiman\n! Ahmed Shafik\n! Hamdeen Sabahi (DP)\n! Mohamed Morsi (FJP)\n! Salim Al-Awa\n! Khairat El-Shater (FJP)\n! Ayman Nour (Ghad)\n! Kamal Ganzouri\n! Mohamed ElBaradei (CP)\n! other\n! undecided\n|-\n|Feb 2011  ||YouGov|| 1871 || 49% || – || – || 9% || – || 1% || – || – || – || 1% || – || 2% || 24% || 13%\n|-\n|9–20 March 2011  ||IPI|| 615 || 37% || – || – || 5% || – || – ||  – || – || – || 1% || – || 2% ||37% || 14%\n|-\n|Jun 2011  ||IPI || 800 || 32% || – || – || – || – || 3% || – || – || – || 3% || – || 2% || 42% || –\n|-\n|Jun/Jul 2011  || Newsweek/Daily Beast || 1008 || 16% || – || 5% || 4% || 12% || 2% || – || 6% || – || 4% || – || 12% || 13% || 27%\n|-\n| \" || (3-way race) || \" || 47% || – || 16% || – || – || – || – || – || – || – || – || 19% || – || 18%\n|-\n|Aug 2011 || ACPSS || 2,400 || 44% || 5.2% || 2% || 9% || 12% || 5% || – || 5% || – || 6% || – || 4% || 7.8% || 45%\n|-\n|Oct 2011 || ACPSS || 2,400 || 44.8% || 5.2% || 1.6% || 10.8% || 13.2% || 5.7% || – || 4.7% || – || 5.0% || – || 3.5% || 5.5% || ?\n|-\n|Nov 2011 || ACPSS || 2,400 || 38.9% || 5.7% || 1.5% || 6.6% || 8.5% || 4.0% || – || 5.7% || – || 3.2% || – || 2.9% || 24.5% || ?\n|-\n|Mar 2012 || Al Ahram  || 1,200 || 31.5% || 22.7% || 8.3% || 9.3% || 10.2% || 5.0% || – || 4.0% || – || 1.0% || 3.0% || 1.0% || 4.0% || ?\n|-\n|Apr 2012 || Al Ahram  || 1,200 || 30.7% || 28.8% || 8.5% || 8.2% || 7.5% || 3.9% || – || 3.2% || 1.7% || 1.4% || 1.3% || – || 6.5% || ?\n|-\n|Apr 2012 || Al-Masri Al-Yom  || 2,034 || 6.4% || 11.7% || 12.4% || 20.1% || 2.2% || 2.7% || – || 1% || 3.2% || –  || –  || – || 2.2% || 38.1%\n|-\n|Apr 2012 || Al Ahram|| 1,200 || 22.3% || 21.4% || 6.2% || 31.7% || 3.4% || 4.3% || – || 1.2% || 4.3% || 0.9%  || –  || – || 4.3% || –\n|-\n|Apr 2012 || Al Ahram  || 1,200 || 40.9% || – || 25.2% || – || 10.5% || 9.3% || 0.9% || 4.4% || – || –  || –  || – || ? || ?\n|-\n|Apr 2012 ||  Al-Masri Al-Yom  || 2,129 || 12.5% || – || 15.5% || – || 6% || 5% || 1.5% || –  || – || –  || –  || – || 5.1% || 54.4%\n|-\n|Apr 2012 ||  Al Ahram  || 1,200 || 41.1% || – || 27.3% || – || 11.9% || 7.4% || 3.6% || 5.7%  || – || –  || –  || – || 3.0% || 12.3%\n|-\n|Apr 2012 ||  Al Masry Al Youm || 2,100 || 14.1% || – || 18.5% || – || 5.3% || 5% || 3.6% || 1.4% || – || –  || –  || – || 2% || 50.1%\n|-\n|April–May 2012 || IDSC|| 1,209 || 11% || – || 11% || – || 6% || – || 2% || –  || – || –  || –  || – || 2% || 42% 1\n|-\n|April–May 2012 || Al Ahram || 1,200  || 39% || – || 24% || – || 17.2% || 6.7% || 7% || 2.9%  || – || –  || –  || – || 3.2% || –\n|-\n|May 2012 || Shorouk|| 1,014 || 16% || – || 20.8% || – || 15.2% || 5.7% || 5.2% || ?  || – || –  || –  || – || 3.4% || 33.6%\n|-\n|May 2012 || Al Masry Al Youm|| 2,152|| 17% || – || 15.7% || – || 14.8% || 6% || 5.2% || ?  || – || –  || –  || – || 3.7% || 37.6%\n|-\n|May 2012 || IDSC|| 2,264 || 7% || – || 9% || – || 8% || 2% || 4% || –  || – || –  || –  || – || 2% 2\n|| 39% 3\n|-\n|May 2012 || Al Ahram  || 1,200 || 40.8% || – || 17.8% || – || 19.9% || 7% || 9.4% || 2.7% || – || – || – || – || 2.5% || 15.3%\n|-\n|May 2012 || Al Masry Al Youm || ?|| 16% || – || 12.5% || – || 16.3% || 7% || 8.8% || –  || – || – || – || – || 2% || 37.4%\n|-\n|May 2012 || IDSC  || 1,390 || 11% || – || 9% || – || 12% || 5% || 6% || 1% || – || – || – || – || 2% || 37% 4\n|-\n|May 2012 || IDSC || 1,366 || 11% || – || 7% || – || 12% || 7% || 7% || ? || – || – || – || – || ? || 35%\n|-\n|May 2012 || Al Aharam || 1,200 || 31.7% || – || 14.6% || – || 22.6% || 11.7% || 14.8% || 2.3% || – || – || – || – || 1.7%5 || ?\n|-\n|May 2012 || Al Masry Al Youm || 2,287 || 14.6% || – || 12.4% || – || 19.3% || 9.5% || 9% || 1% || – || – || – || – || 1.2% || 33%\n|-\n|May 2012 || Shorouk  || 1,185 || 15.1% || – || 13.2% || – || 15.8% || 12.3% || 9.5% || 1.3% || – || – || – || – || 2.9% || 29.8%\n|-\n|May 2012 || U of Maryland  || 772 || 28% || – || 32% || – || 14% || 8% || 8% || ? || – || – || – || – || ? || ?\n|}\nNotes:\n1 In addition, another 7% decided not to vote, 16% haven't decided if they will participate, and 3% refused to say their nominee\n2 2% for Khaled Ali\n3 In addition, another 8% will not vote, 6% did not disclose nominee, and 17% have yet to decide if they will participate.\n4 In addition, another 6% will not vote, 3% did not disclose nominee, and 8% have yet to decide if they will participate.\n5The article doesn't mention \"other\", but mentions Ali and Hariri, which are not placed on the table, getting 1.1% and 0.6% respectively (hence, total of 1.7).\nRunoff polls\n{| class=\"wikitable\"\n|-\n! candidate\n! Al Ahram\n(28 Apr–1 May 2012)\n|-\n| Amr Moussa || 63.8%\n|-\n| Abdel Moneim Aboul Fotouh || 36.2%\n|-\n! colspan=\"2\" style=\"text-align:right;\" |\n|-\n| Amr Moussa || 77.6%\n|-\n|Mohamed Morsi || 22.4%\n|-\n! colspan=\"2\" style=\"text-align:right;\" |\n|-\n| Amr Moussa || 68%\n|-\n|Ahmed Shafik || 32%\n|-\n! colspan=\"2\" style=\"text-align:right;\" |\n|-\n|Abdel Moneim Aboul Fotouh || 52.9%\n|-\n|Ahmed Shafik || 47.1%\n|-\n! colspan=\"2\" style=\"text-align:right;\" |\n|-\n|Abdel Moneim Aboul Fotouh || 74.7%\n|-\n|Mohamed Morsi || 25.3%\n|-\n! colspan=\"2\" style=\"text-align:right;\" |\n|}\nFavorability ratings\nUnlike traditional preference polling, favorability ratings allow individuals to independently rate each candidate. This provides a comprehensive impression of a candidate's electorate appeal without vote splitting distortion, where votes divide between ideologically similar candidates in multi-candidate polls. Favorability indicates general candidate acceptance among voters, irrespective of final vote choice.  The table uses the percentage of \"Somewhat favorable\" or \"Very favorable\" responses.\n{| class=\"wikitable sortable mw-datatable\" style=\"font-size:90%;text-align:center;\"\n|- valign=\"bottom\" style=\"font-size:90%;\"\n! Poll source\n! Date(s)administered\n! Sample size\n! Amr Moussa\n! Mohamed Hussein Tantawi\n! Ayman Nour (Ghad)\n! Abdel Moneim Aboul Fotouh\n! Abu Ismail\n! Mohamed ElBaradei (CP)\n! Faiza Abou el-Naga\n! Omar Suleiman\n! Hosni Mubarak\n|-\n| Pew Research\n| March 19–April 10, 2012\n| 1000\n| %\n| %\n| %\n| %\n| %\n| %\n| %\n|\n|\n|-\n| Pew Research\n| March 24–April 7, 2011\n| 1000\n| %\n| %\n| %\n|\n|\n| %\n|\n| %\n| %\n|}\nResults\nOn 24 June 2012, Egypt's election commission announced that Morsi had won the run-off. Egypt's benchmark stock index celebrated Morsi's election by closing up 7.6 percent, its largest single-day gain in nine years.\nSecond round results by governorate\n{| class=\"wikitable sortable\" style=text-align:right\n!Governorate\n!Valid votes\n!Invalid votes\n!Turnout %\n!Morsi votes !!%\n!Shafik votes !!%\n|- style=\"background:#E9967A\"\n|align=left|Aswan\n|317,424\n|7,776\n|37.9\n|164,826\n|51.9\n|152,598\n|48.1\n|- style=\"background:#E9967A\"\n|align=left|Asyut\n|901,539\n|26,837\n|44.6\n|554,519\n|61.5\n|347,020\n|38.5\n|- style=\"background:#B0C4DE\"\n|align=left|Luxor\n|264,353\n|6,781\n|40.3\n|124,120\n|47.0\n|140,233\n|53.0\n|- style=\"background:#E9967A\"\n|align=left|Alexandria\n|1,687,148\n|76,274\n|53.7\n|970,131\n|57.5\n|717,017\n|42.5\n|- style=\"background:#E9967A\"\n|align=left|Ismailia\n|376,576\n|11,642\n|55.5\n|204,307\n|54.3\n|172,269\n|45.7\n|- style=\"background:#B0C4DE\"\n|align=left|Red Sea\n|94,791\n|2,687\n|43.5\n|46,803\n|49.4\n|47,988\n|50.6\n|- style=\"background:#E9967A\"\n|align=left|Beheira\n|1,548,271\n|45,043\n|49.4\n|907,377\n|58.6\n|640,894\n|41.4\n|- style=\"background:#E9967A\"\n|align=left|Beni Suef\n|770,342\n|24,261\n|55.9\n|512,079\n|66.5\n|258,263\n|33.5\n|- style=\"background:#B0C4DE\"\n|align=left|Port Said\n|239,890\n|13,577\n|58.1\n|109,768\n|45.8\n|130,122\n|54.2\n|- style=\"background:#E9967A\"\n|align=left|Giza\n|2,263,425\n|82,263\n|54.8\n|1,351,526\n|59.7\n|911,899\n|40.3\n|- style=\"background:#B0C4DE\"\n|align=left|South Sinai\n|24,742\n|733\n|40.8\n|12,286\n|49.7\n|12,456\n|50.3\n|- style=\"background:#B0C4DE\"\n|align=left|Dakahlia\n|1,904,744\n|51,243\n|53.3\n|845,390\n|44.4\n|1,059,354\n|55.6\n|- style=\"background:#E9967A\"\n|align=left|Damietta\n|461,403\n|14,569\n|55.9\n|258,475\n|56.0\n|202,928\n|44.0\n|- style=\"background:#E9967A\"\n|align=left|Suez\n|205,963\n|7,550\n|56.0\n|129,229\n|62.7\n|76,734\n|37.3\n|- style=\"background:#E9967A\"\n|align=left|Sohag\n|912,853\n|26,103\n|40.1\n|531,636\n|58.2\n|381,217\n|41.8\n|- style=\"background:#B0C4DE\"\n|align=left|Al Sharqia\n|1,928,216\n|50,070\n|56.6\n|881,581\n|45.7\n|1,046,635\n|54.3\n|- style=\"background:#E9967A\"\n|align=left|North Sinai\n|94,964\n|2,401\n|46.9\n|58,415\n|61.5\n|36,549\n|38.5\n|- style=\"background:#B0C4DE\"\n|align=left|Gharbia\n|1,575,883\n|45,103\n|55.8\n|583,748\n|37.0\n|992,135\n|63.0\n|- style=\"background:#E9967A\"\n|align=left|Faiyum\n|761,330\n|23,091\n|50.6\n|591,995\n|77.8\n|169,335\n|22.2\n|- style=\"background:#B0C4DE\"\n|align=left|Cairo\n|3,399,110\n|158,687\n|54.8\n|1,505,103\n|44.3\n|1,894,007\n|55.7\n|- style=\"background:#B0C4DE\"\n|align=left|Qalyubia\n|1,460,537\n|42,562\n|57.9\n|609,253\n|41.7\n|851,284\n|58.3\n|- style=\"background:#E9967A\"\n|align=left|Qena\n|514,089\n|15,179\n|33.1\n|285,894\n|55.6\n|228,195\n|44.4\n|- style=\"background:#E9967A\"\n|align=left|Kafr el-Sheikh\n|768,005\n|23,223\n|42.6\n|425,514\n|55.4\n|342,491\n|44.6\n|- style=\"background:#B0C4DE\"\n|align=left|Monufia\n|1,323,265\n|33,949\n|61.5\n|376,677\n|28.5\n|946,588\n|71.5\n|- style=\"background:#E9967A\"\n|align=left|Minya\n|1,332,677\n|43,607\n|51.8\n|858,557\n|64.4\n|474,120\n|35.6\n|- style=\"background:#E9967A\"\n|align=left|Matrouh\n|81,242\n|1,629\n|40.6\n|65,095\n|80.1\n|16,147\n|19.9\n|- style=\"background:#E9967A\"\n|align=left|New Valley\n|63,009\n|1,320\n|45.4\n|39,934\n|63.4\n|23,075\n|36.6\n|- style=\"background:#E9967A\"\n|align=left| expatriates\n|301,720\n|5,092\n|\n|225,893\n|74.9\n|75,827\n|25.1\n|- class=\"sortbottom\"|style=\"background:#\"\n|align=left|Total\n|\n|\n|\n|13,230,131\n|51.7\n|12,347,380\n|48.3\n|- class=\"sortbottom\"\n| colspan=\"14\" style=\"background:#e9e9e9;\"|\n|- class=\"sortbottom\"\n|align=left colspan=\"14\" align=left| Source:\n|}\nAnalysis\nPre-election polling showed Moussa to have a substantially higher favorability rating (81%) than Fotouh (58%), and to be preferred head-to-head against Morsi (78%), Shafik (68%), and Fotouh (64%).  Fotouh in turn was preferred head-to-head over Morsi (75%) and Shafik (53%), making Moussa the likely Condorcet winner, and Fotouh the runner-up.  However, due to the use of the two-round system, and vote-splitting between the three moderate / non-Islamist candidates, Moussa came in 5th, and Fotouh came in 4th, and both were eliminated. The two candidates who qualified for the runoff election, Morsi (24.8%) and Shafik (23.7%), were both considered polarizing.\nUnder instant-runoff voting, Top Four or Final Five Voting, and related systems, Moussa would also have been eliminated before the other four candidates, though it is unknown how the ballots would have been transferred and who would have next been eliminated.\nClaims of election interference\nAllegations have arisen that the interior ministry handed out over 900,000 ID cards to Egyptian soldiers so that they could vote for Shafik in the first round, which would be a major campaign violation. Sabahi asked for the Egyptian election to be temporarily suspended until an investigation was carried out.  The government rejected the appeal.\nIn August 2013, former Israeli negotiator Yossi Beilin wrote that an Egyptian official had told him that the true results had Shafik winning, but the military gave the presidency to Morsi out of fear of unrest.\nPresidential powers\nShortly after it became apparent that Morsi would win the election, SCAF made the following changes to the 30 March 2011 Egypt Constitutional Declaration in order to define the powers of the new president:\n- Article 30: In situation that parliament is dissolved the president will be vowed into office in front of High Constitutional Court's General Assembly.\n- Article 53: The incumbent SCAF members are responsible for deciding on all issues related to the armed forces including appointing its leaders and extending the terms in office of the aforesaid leaders.  The current head of the SCAF is to act as commander-in-chief of the armed forces and minister of defense until a new constitution is drafted.\n- Article 53/1: The president can only declare war after the approval of the SCAF.\n- Article 53/2: If the country faces internal unrest which requires the intervention of the armed forces, the president can issue a decision to commission the armed forces – with the approval of the SCAF – to maintain security and defend public properties. Current Egyptian law stipulates the powers of the armed forces and its authorities in cases where the military can use force, arrest or detain.\n- Article 56 B: The SCAF will assume the authorities set out in sub-article 1 of Article 56 as written in the 30 March 2011 Constitutional Declaration until a new parliament is elected.\n- Article 60 B:  If the constituent assembly encounters an obstacle that would prevent it from completing its work, the SCAF within a week will form a new constituent assembly- to author a new constitution within three months from the day of the new assembly's formation. The newly drafted constitution will be put forward after 15 days of the day it is completed, for approval by the people through a national referendum. The parliamentary elections will take place one month from the day the new constitution is approved by the national referendum.\n- Article 60 B1: If the president, the head of SCAF, the prime minister, the Supreme Council of the Judiciary or a fifth of the constituent assembly find that the new constitution contains an article or more which conflict with the revolution's goals and its main principles or which conflict with any principle agreed upon in all of Egypt's former constitutions, any of the aforementioned bodies may demand that the constituent assembly revises this specific article within 15 days. Should the constituent assembly object to revising the contentious article, the article will be referred to the High Constitutional Court (HCC) which will then be obliged to give its verdict within seven days. The HCC's decision is final and will be published in the official gazette within three days from the date of issuance.\n- Article 38 will be replaced with: \"The parliamentary elections will be conducted in accordance to the law.\"\nSee also\n*Democracy in the Middle East\n*President of Egypt\nNotes\nReferences\nFurther reading\n*\n*\n*\nExternal links\n*[https://web.archive.org/web/20120725043143/http://www.aucegypt.edu/GAPP/CairoReview/Pages/articleDetails.aspx?aid=162 Candidates in the 2012 Egyptian Presidential Election] – American University in Cairo\n*[http://www.elections.eg/ The official website of Supreme Committee for Presidential Elections]\n* [http://www.americanprogress.org/issues/2011/05/egypt_leaders.html/ Future Leaders of Egypt Bios on the Center for American Progress]\n*[https://web.archive.org/web/20111116034051/http://egypt.jadaliyya.com/ Egypt Elections Watch] – Jadaliyya\n*[https://web.archive.org/web/20120529054156/http://egyptelectsblog.com/ Egypt Elects]\n*[http://english.ahram.org.eg/NewsContent/36/122/41802/Presidential-elections-/Presidential-elections-news/Egypts-presidential-favourites-Where-they-stand,-i.aspx Egypt's presidential favourites: Where they stand, issue by issue]\n*[http://english.ahram.org.eg/NewsContent/36/122/36418/Presidential-elections-/Presidential-elections-news/Ahram-Online-presents-The-Idiots-Guide-to-Egypt%E2%80%99s-.aspx Guide to Egypt’s presidential elections 2012]\n*[https://www.theguardian.com/world/middle-east-live/2012/may/24/egypt-election-day-2-live Egyptian presidential election, 2012 coverage at The Guardian]\n*Joseph Mayton [http://en.qantara.de/From-Outlier-to-Serious-Contender/19143c20191i1p497/index.html \"Egyptian Presidential Candidate Hamdeen Sabahi: From Outlier to Serious Contender,\"]  Qantara.de (22 May 2012).\n*[http://english.ahram.org.eg/NewsContent/36/122/43085/Presidential-elections-/Presidential-elections-news/Presidential-finalists-Mursi-vs-Shafiq-Where-they-.aspx Presidential finalists Mursi vs Shafiq: Where they stand, issue by issue]"
    }
  ]
}