{
  "content": [
    {
      "type": "text",
      "text": "# 2012 United Kingdom fuel crisis\n\nIn March 2012 Unite trades union warned it was considering a strike over health and safety standards. Unite represents around 2,000 tanker drivers, who deliver fuel to 90% of Britain's forecourts. Although no strike took place, Government action precipitated panic-buying and a woman was seriously injured after following a minister's advice to store extra petrol.\nBackground\nTowards the end of 2007, fuel prices exceeded £1 per litre with a two-pence rise in fuel tax in October, resulting in the highest diesel prices and the fourth highest for petrol in Europe. New protests were planned by two unconnected groups, one called Transaction 2007 and the Road Haulage Association (RHA). Protesters claimed that forecourts and oil firms were profiteering. Tanker drivers also claimed that they were being neglected and over-worked. They were also concerned that outsourcing in the haulage industry had triggered relentless pressure on cutting costs, with firms like Asda, Shell and Esso all contracting out their deliveries to low-quality rivals.\nUnion representatives and tanker drivers revealed that some vehicles can weigh 44 tonnes and can carry around 36,000 to 40,000 litres of fuel. Some drivers can start at two in the morning and work until two in the afternoon, with one weekend off every 14 weeks.\nNews of the planned industrial action days after George Osborne had outlined the imposition of 20 per cent VAT on hot pies, more public sector cuts, council workers' pension cuts and the planned NHS reforms in mid-March.\nThe Panic buying at forecourts across the UK in March 2012 began after Unite members threatened to vote to strike. According to their critics (including the AA), both statements from UK Prime Minister David Cameron, Cabinet Minister Francis Maude, and poor media coverage, encouraged tens of thousands of motorists to panic buy, leading to a number of forecourts running out of fuel.\nUnite members must legally give seven days' prior notification of a strike; no such notification had been given as of 30 March.\nPanic buying and long queues at garages were reported in Banbury, Christchurch and Crawley.\nThe Unite trades union threatened a strike over health and safety standards earlier in March 2012. Unite represents around 2,000 tanker drivers, who deliver fuel to 90% of Britain's forecourts.\nEvent\n25 March\nThe Cabinet Office Minister, Francis Maude, called upon by the Unite union, who was balloting for a drivers' strike at seven fuel distribution firms, to seek an agreement with distribution companies via ACAS. The Unite Union's rep's argued that the outsourcing in the haulage industry has triggered relentless pressure on cutting costs, with firms likes of Asda, Shell and Esso all contracting out their deliveries to low quality rivals.\nThe Government said preparations were underway, the army tanker fleet was put on standby as petrol tanker drivers at 5 of the 7 firms voted on strike action.\nThe Petrol Retailers Association, whose membership represents more than 5,500 petrol stations, said that it knew nothing about any form of planned government contingency plans and was advising members to keep fuel levels high. The group's chairman, Brian Madderson told the BBC: \"We have had no word from the Department of Energy and Climate Change whatsoever.\"\n27 March\nMinisters consider plans to train up military personnel to ensure that fuel supplies are maintained at a cabinet meeting. Confused statements from UK Prime Minister David Cameron, Cabinet Minister Francis Maude, and later media coverage lead tens of thousands of motorists to panic buying in Banbury, Christchurch and Crawley.\nBy midday, Francis Maude had told drivers that they should make sure they have enough fuel in their vehicles and \"maybe a little bit in their garage as well in a jerry can\".  However, both the AA and fire-fighters have now called on him to withdraw the advice, because of the risk of explosions in garages. The shadow transport secretary, Maria Eagle, warned of a danger of panic fuel buying, as did the AA after the government urged motorists to be ready for a strike-induced shortage. The AA also warned of the danger of panic-buying. Andrew Howard, its spokesman, said: \"If people begin panic-buying we could well have shortages in fuel even before the strike.\".\nAs the day progressed there were scenes of long queues at petrol pumps in Liverpool, Preston and Kent, while pumps ran dry in Wilmslow in Cheshire and Llandudno Junction in North Wales.\nSome garages capped individual sales to stretch reserves, by using methods such as a 25-litre or £20 maximum spend on any one purchase.\nOther forecourts had introduced 'minimum spend' rules of £35, to try to prevent motorists who have a half-full tank from filling up again, as well as to turn an extra profit in a time of crisis.\n28 March\nThat morning David Cameron told a press conference that the fuel tanker drivers' strike has no justification and was part of a supposed Labour party plot to undermine his government.\nLater on BBC Radio 4's World at One, Maude denied that he had earlier told people to fill jerry cans.\nPetrol ran low in some Dorset, Hertfordshire and Herefordshire forecourts.\n29 March\nPetrol Retailers Association said petrol sales increased by more than 170% and sales of diesel were up by almost 80%. Babu Jha, manager of MPK Filling Station in Leicester's Dysart Way, said on the 29th: \"We have been really busy, probably three times as much as usual. People seem to be panicking.\" as demand rose heavily in Leicester. The Aintree forecourt attendant Farhaan Mohammed, 21, said expected petrol to have run out by the end of trading and that there was no guarantee from Esso of more fuel. Motorists in Crawley and Horley queued for petrol.\nThe Texaco garage in Telscombe Cliffs ran out of fuel and customers began rowing outside the petrol station at Asda in Hollingbury after accusations of queue jumping, as the stretched from the forecourt in to Carden Avenue.\nTaxi drivers reported long petrol queues in Clarence Place, Corporation Road and parts of Maindee in Newport.  ABC Taxis told drivers to top up amid fears stations would sell out.\nA van driver in Leeds said he had to wait for 30 minutes to get fuel, while a forecourt on the outskirts Harrogate had run out of fuel by 11:30&nbsp;am.\nRetail store Halfords reported \"high\" sales of fuel cans. Sales of all cans have soared by 225% compared with this time last year, with motorists buying in \"the thousands\", while sales of jerry cans are up by more than 500%.\nThe Energy Secretary, Ed Davey urged motorists to \"Keep tanks two-thirds full, but don't panic.\".\nThe London Fire Brigade urged businesses to place legal warnings on websites and petrol cans. Chief Inspector Nick Maton of Dorset Police warned motorists not to panic.\n30 March\nThat morning, Crawley's MP, Henry Smith said to the local newspaper's reporters that he supported the Government was right to warn people to prepare for a potential fuel strike, backed up France's Maude's advice (despite criticism that it caused panicked queues of spooked drivers and shortages at several petrol pumps). He also condemned the Labour Party's funding by the Trades Unions and accused the tanker drivers of being \"lazy fat cats\".\nLater, the Government and national media went on to claim that the panic buying had led to an incident in which a woman from Moorgate, in Acomb, near York was badly burned at home, when petrol ignited as she transferred it between containers in her kitchen on 30 March. The North Yorkshire Fire and Rescue Service issued a warning online and on Radio 5 over the storage of petrol.\nDiesel ran out in Banbury and Adderbury. Petrol and diesel both ran out in Hammersmith Bridge in South Shields and Newcastle upon Tyne. Long queues occurred in several places such as Banbury, Crawley and Gateshead in N.E. England.\nPolice in southwest England asked many petrol stations to close temporarily amid violent and desperate panic buying by hysterical and fear-crazed motorists (A phenomenon called 'fuel rage' by police and forecourt staff). Later that evening the Tesco filling station at Inshes, Inverness, finally ran out of fuel. Motorists in Crawley and Horley queued for petrol.\nBy mid-day the Unite's leadership ruled out Easter fuel strikes and negotiations were started at ACAS. and talks were planned for the next week.\nMorrisons in Freemen's Common, Leicester, and Asda at Fosse Park, used supermarket staff to act as marshals in an attempt manage motorists panicked motorists pumps. The Shell garage on the A6, near Leicester Racecourse, by midday and Tesco filling station in Hamilton, near Leicester, was out of both petrol and diesel by the evening, with later reports of several other stations exhausting their supplies. Queuing also occurred at the Shell Trocadero in Uppingham Road, Leicester.\n300 Army personnel were eventually trained to drive fuel tankers and were placed on standby to help maintain essential supplies.\nDuring the middle of the day London's Mayor, Boris Johnson called for the creation of a National Emergency Plan.\nLabour peer Lord Harris called for Francis Maude to resign in the wake of Diane Hill burning herself.\nThe UK Petroleum Industry Association described fuel crisis as \"self-inflicted insanity and condemned the Department of Energy's poor handling of the crisis. Several business leaders also said in a press release late that evening, warning that a strike would destroy the economy, cause a recession, and close small businesses.\n31 March\nThe government told people via the Department for Energy and Climate Change web page to stop panic buying after the Unite union ruled out a strike over Easter.\nThere was still little sign of the situation easing as drivers formed queues of up to half a mile at those filling stations still holding supplies. Many forecourts were rationing drivers to as little as £10 each, while others imposed a minimum spend of £25. A Cornish garage even refused to serve anyone who was \"not local\" after the owner decided to turn away holidaymakers in favour of regular customers and account holders as supplies in Cornwall began to dry up.\nTrade at Banbury's Texaco and Adderbury's Esso had slackened, but were still out of diesel. Some afternoon queues and shortages at the petrol stations in Leeds, Tonbridge in Kent, Egham, Bromley in south-east London, Finchampstead in Berkshire and St Albans. PCSOs manned the pumps at Esso Tesco Express petrol station on Soundwell Road, Bristol.\nEvening demand for fuel appeared to be dropping, with unleaded petrol sales down from 172% above normal on Thursday to 57% above normal on 30th, according to independent retailers' group RMI Petrol. Diesel sales were down from 77% above normal on 29th to 29% above normal on the 30th. The AA estimated that one in five stations ran out of fuel that day.\nA BP spokesperson stated that there had been a reduction in demand on the forecourts but some were still low or had completely run out of stock and were awaiting deliveries.\nMotoring organisations also warned of a 2-3-day backlog as tanker crews attempt to refuel petrol stations.\nSeveral Labour MPs have also called for the resignation of the Cabinet Office Minister Francis Maude over comments he made advising storing petrol in jerrycans.\n1 April\nThe planned strike was abandoned in the face of continuing talks at ACAS. The government introduces new taxes to make up for 'lost' tax revenue.\n2 April\nConciliation talks were planned between UNITE and Bosses at ACAS on 4 April according to an ACAS spokesperson.\nThe RMI chairman, Brian Madderson, warning of a repeat of the previous week's fuel panic if talks failed.\n4 April\nTalks continue at ACAS.\n18 April\nTalks began to break down between the Unite Union and bosses at the Acas summit. A conference of 60 oil tanker drivers Unite's London headquarters rejected the proposals made by fuel distributors. The tanker drivers asked for the Health and Safety Executive and to create a tanker driver accreditation licence or \"passport\".\n8 May\nA Unite spokesman said that 57.5% of members on a turnout of 79.5% voted for action short of strike in the union's re-ballot on the issue.\n11 May\nUnite members voted by 51% in favour of the boss's proposals, which included the introduction of an industrywide accreditation covering health safety and training, a Unite said in a statement issued at its website.\n12 May\nUnite chairwoman Diana Holland said the narrow vote would lead to no strike action taking place.\nPublic Safety issues\nAn AA statement said: \"A lady about 75 was seen filling up 20 empty one-gallon paint tins with plastic lids and also a tray of jam jars in her boot with petrol\". The incident was in Macclesfield, Cheshire.\nOne motorist tried to fill a pair of 1 gallon glass flagons with petrol in South Wales. The nozzle of the pump was, in fact, bigger than the neck of the flagon, and the fuel was spilt over the surrounding ground.\nA motorist in Ilkley, Yorkshire, was ejected from a garage forecourt after he had snatched the pump out of the hand of another driver.\nFirefighters were called to deal with a fuel spillage after a car was overfilled with petrol in Deerswood Road, Crawley, West Sussex.\nFirefighters were called to deal with a fuel spillage after a motorist was ejected from a garage because he had snatched the pump out of the hand of an elderly driver.\nAftermath\nIt was estimated that the panic buying would bring in £32 million in fuel excise duty.\nThe government announced new taxes on 1 April to compensate for 'lost' strike related tax revenue. The APD tax for short-haul flights went up from £12 to £13, while the tax on a long-haul rose to between £62 (to the United States) and £92 (to Australia).\nAn increase in NHS prescription charges in England of 25p to £7.65.\nA new Northern Irish Assembly business levy on large stores comes into force in Northern Ireland on 2 April.  It revalued rates on commercial premises that have a rateable value of more than £500,000. The proceeds will be used to reduce rates for smaller businesses, affecting 76 and is thought it will cost big shops an average of £66,000 a year. Ikea claimed that Finance Minister Sammy Wilson could be putting jobs at risk.\nResponses\n*The Petrol Retailers Association's chairman, Brian Madderson told the BBC: \"We have had no word from the Department of Energy and Climate Change whatsoever.\" on 25 March.\n*Unite's assistant general secretary, Diana Holland, said in a letter to Davey: \"We have been tireless in seeking talks to avoid industrial action, but we have been frustrated at every turn.\" on 28 March.\n*The AA also warned of the danger of panic-buying. Andrew Howard, its spokesman, said: \"If people begin panic-buying we could well have shortages in fuel even before the strike.\" on the 28th.\n*Babu Jha, manager of MPK Filling Station, in Leicester's Dysart Way, said on the 29th: \"We have been really busy, probably three times as much as usual. People seem to be panicking.\"\n*Michelle Watson of the Texaco garage in Telscombe Cliffs, Sussex said: \"We closed at about 12.30pm after selling three days' worth of fuel in a day.\" on 29 March.\n* The Energy Secretary, Ed Davey urged motorists to \"keep tanks two-thirds full, but don't panic.\" on 29 March.\n*Chief Inspector Nick Maton of Dorset Police warned motorists not to panic and said in the 29th in a local press conference \"There is no disruption to the fuel supply in the UK and members of the public should not panic buy. The actions of some motorists in queuing irresponsibly at petrol stations is causing danger to other road users. Police are taking action, requesting petrol stations to close temporarily in order to keep traffic flowing. Once the queues have dispersed, the petrol stations may re-open for short periods.\"\n*The AA president Edmund King said on 29 March: \"We plead with drivers who really don't need to fill up to stay away from the pumps. The AA also stresses that drivers do not and should not hoard extra supplies of fuel in jerry cans or other containers. Hoarding fuel is dangerous and is not required.\"\n*The Petrol Retailers Association said it was waiting for \"practical and well-considered\" leadership from the Government and said that \"300 Army drivers cannot possibly replace 2,000 striking civilian drivers\" on 30 March.\n*The Department for Transport repealed the EU hours and working-time rules for drivers of fuel tankers from 30 March to 5 April.\n*RAC and AA spokesmen said the panic buying was unnecessary and condemned the government for stoking the crisis up. The AA blamed the 'unnecessary and self-inflicted' shortages are due to the poor government advice to drivers on 30 March.\n*Shadow Chancellor Ed Balls told BBC Radio Leeds that David Cameron of playing \"schoolboy political games\" in stoking up panic over fuel to try to distract attention from his troubles with Budget tax rises and the scandal over donations to the Tories on 30 March.\n*Crawley's Member of Parliament, Henry Smith said to the local newspaper's reporter: \"A fuel tanker driver strike is unjustified, most earn over £45,000 and UK safety conditions are the best in the world. All parties should condemn the threat of industrial action which would cause massive disruption and threaten lives and livelihoods.\", \"Local and national Labour Party leaders should soul-search as to why they allow themselves to be to heavily funded and supported by the Unite Union which is threatening to seriously disrupt the lives of people in Crawley and across the country.\" and \"The Government are right to make contingency plans and warn people so the lessons of the fuel stoppages a decade ago aren't ignored.\" on 30 March.\n*An ACAS spokesman said: \"We are pleased that Unite have confirmed they are ready to start substantive talks as soon as possible. We are meeting all of the employers involved in the dispute on Monday to complete our exploratory talks with them. We hope that more formal talks involving both Unite and the employers will start as soon as possible after Monday, on March 30th.\"\n*Energy Secretary Ed Davey chaired a meeting in Whitehall with the haulage firms involved in the dispute as well as the defence and transport secretaries. An Energy Department spokesman said: \"It was a productive meeting... Discussions focused on contingency planning, covering training more military drivers in the event that a strike is called. There is no strike at the moment, and we are calling for a swift resolution to this industrial dispute on March 30th.\"\n*Professor Stephen Glaister, director of the RAC Foundation, said Unite's decision to hold off on strike action \"should give everyone breathing space and ease the pressure at the pumps.\" on 31 March.\n*The RAC motoring group also said it was \"business as usual\" on the 31st.\n*The AA described \"a rapidly improving picture at fuel stations\" 31st.\n*The AA president Edmund King said on 1 April: \"We hope that the weekend will bring back some sanity in this silly situation. It is almost as if the last five days have been one big April Fool come early\"., \"AA patrols estimate that about one fifth of garages ran out of fuel on Friday. We have also noted that more cars are cruising at 56mph on motorways in order to conserve fuel.\"\n*The RMI chairman, Brian Madderson, warned: \"The government needs to understand that the panic buying witnessed last week will be instantly repeated should the supply-side logistics come under renewed threat. This is merely the consumer's self-preservation instinct as our society is completely structured around road transport, especially in rural areas.\", on 2 April.\nSee also\n*Fuel protests in the United Kingdom\n*2011 United Kingdom public sector strikes\n*2021 United Kingdom fuel supply crisis\nReferences"
    }
  ]
}