{
  "content": [
    {
      "type": "text",
      "text": "# 2012 Palanca Awards\n\n| image            =\n| imagesize        =\n| date             = September 1, 2012\n| location         = The Peninsula Manila, Makati, Philippines\n| host             =\n| most_wins        =\n| previous         = 2011\n| next             = 2013\n}}\nThe 62nd Don Carlos Palanca Memorial Awards for Literature was held on September 1, 2012, at The Peninsula Manila in Makati to commemorate the memory of Don Carlos Palanca Sr. by promoting education and culture in the country. This year, the Palanca received a total of 1,077 entries in 20 categories. Out of these submissions, 59 winning works were selected from 58 writers – with half (29 authors) are first-time winners. Department of Tourism Secretary Ramon R. Jimenez Jr. was Guest of Honor and Speaker at this year’s awarding ceremony.\nPeter Solis Nery was this year's Palanca Hall of Fame awardee. He clinched his fifth first prize for “Punctuation” under the Poetry for Children category. The said award is given to writers who have won five first places in any category.\nThe 2012 winners are divided into four categories:\nEnglish Division\nShort Story\n* First Prize: Rebecca E. Khan, \"In Transit\"\n* Second Prize: Ian Rosales Casocot, \"It Always Breaks My Heart a Little to See You Go\"\n* Third Prize: Lystra Aranal, \"Bright Lights\"\nShort Story for Children\n* First Prize: Grace D. Chong, \"The White Shoes\"\n* Second Prize: Raymund M. Garlitos, \"Lauan, The Seed that Wanted to Fly\"\n* Third Prize: Aleli Dew B. Ayroso, \"Mister World and His Magical Box\"\nPoetry\n* First Prize: Carlomar Arcangel Daoana, \"The Elegant Ghost\"\n* Second Prize: Charmaine L. Carreon, \"The Yonic Lover\"\n* Third Prize: Jason Leo G. Asistores, \"Waiting and Other Poems\"\nPoetry Written for Children\n* First Prize: Peter Solis Nery, \"Punctuation\"\n* Second Prize: Anca Bautista, \"Magic Is and Nine Other Magical Poems\"\n* Third Prize: Raymundo T. Pandan Jr., \"The Ocelot and Other Poems\"\nEssay\n* First Prize: Hammed Q. Bolotaolo, \"Of Legends\"\n* Second Prize: Martin V. Villanueva, \"Dao\"\n* Third Prize: Iriwin Allen B. Rivera, \"Patterns\"\nOne-Act Play\n* First Prize: No Winner\n* Second Prize: Joachim Emilio B. Antonio, \"The Dust in Your Place\"\n* Third Prize: Patrick John R. Valencia, \"In Bed with My Mother\"\nFull-Length Play\n* First Prize: Robert Arlo B. De Guzman, \"Practical Aim\"\n* Second Prize: Jorshinelle Taleon-Sonza, \"The Passion of Andres\"\n* Third Prize: Jose Ma. D. Manalo, \"Manilatown\"\nFilipino Division\nMaikling Kuwento\n* First Prize: Mark Benedict F. Lim, \"Banaag\"\n* Second Prize: Honorio Bartolome de Dios, \"Ang Tawo sa Puso ni Teresa\"\n* Third Prize: Mar Anthony Simon dela Cruz, \"Darleng\"\nMaikling Kuwentong Pambata\n* First Prize: Will P. Ortiz, \"Ang Tatlong Bubwit at Bangkang Marikit\"\n* Second Prize: Bernadette V. Neri, \"Atang sa Kaluluwa Nina Apong Salawal at Apong Saya\"\n* Third Prize: Luz B. Maranan, \"Ang Pangat, ang Lupang Ninuno, at ang Ilog\"\nTula\n* First Prize: Enrique S. Villasis, \"Crocopedia\"\n* Second Prize: Kristian Sendon Cordero, \"Pagsalat sa Pilat\"\n* Third Prize: Alvin C. Ursua, \"Kumpuni\"\nTulang Pambata\n* First Prize: John Enrico C. Torralba, \"Gusto Ko Nang Lumaki\"\n* Second Prize: Peter Solis Nery, \"Sa Mundo ng mga Kulisap\"\n* Third Prize: Nely T. Azada, \"Sampung Tula Para sa mga Bata\"\nSanaysay\n* First Prize: Niles Jordan Breis, \"Go-See, Kraw Gen, Intro: Sa Daigdig ng Promo\"\n* Second Prize: Elyrah L. Salanga-Torralba, \"Utang Ina\"\n* Third Prize: Jing Panganiban-Mendoza, \"Redempsiyon\"\nDulang May isang Yugto\n* First Prize: Joshua Lim So, \"Joe Cool: Aplikante\"\n* Second Prize: Renerio R. Concepcion, \"Kumandong Nakaiswat\"\n* Third Prize: Erick D. Aguilar, \"Terminal\"\nDulang Ganap ang Haba\n* First Prize: Vincent M. Tanada, \"Ang Bangkay\"\n* Second Prize: Luciano Sonny O. Valencia, \"Ang Penitensiya ni Tiyo Renato\"\n* Third Prize: Allan B. Lopez, \"Melodrama Negra\"\nDulang Pampelikula\n* First Prize: Rodolfo Vera, \"Death March\"\n* Second Prize: Richard S. Legaspi, \"Primera Bella\"\n* Third Prize: Mia A. Buenaventura, \"Ang Bulag na Musikero\"\nRegional Division\nShort Story [Cebuano]\n* First Prize: Noel P. Tuazon, \"Duhiraw\"\n* Second Prize: Richel G. Dorotan, \"Ang Tulo Ka Mayor sa Hinablayan\"\n* Third Prize: Rev. Fr. Rey B. Araneta, \"Abog sa Flyover\"\nShort Story [Hiligaynon]\n* First Prize: Alice Tan Gonzales, \"Lanton\"\n* Second Prize: Dr. Jesus C. Insilada, \"Panubok sa Pula Nga Pulos\"\n* Third Prize: Alain Russ Dimzon, \"Binukot\"\nShort Story [Iluko]\n* First Prize: Danilo B. Antalan, \"Dagiti Sala Ti Panawen\"\n* Second Prize: Fernando Sanchez, \"Babato\"\n* Third Prize: Sherma E. Benosa, \"Dagiti “No La Koma” ni Monika\"\nKabataan Division\nKabataan Essay\n* First Prize: Katrina Bonillo, \"Chapter One: DOWNLOADING\"\n* Second Prize: Sari Katharyn Molintas, \"Being Bookish\"\n* Third Prize: Jhesset Thrina O. Enano, \"What We Are Losing\"\nKabataan Sanaysay\n* First Prize: Jan Francis B. Asis, \"Sa Ingit ng Pinto\"\n* Second Prize: Gerome E. De Villa, \"Sa Aking Pagbuklat sa mga Makabagong Pahina\"\n* Third Prize: Jueliand Peter A. Perez, \"Madyik Bisikleta\"\nReferences"
    }
  ]
}