{
  "content": [
    {
      "type": "text",
      "text": "# 2012 Egyptian presidential debate\n\nThe 2012 Egyptian presidential debate was the first-ever presidential debate held in Egyptian history as well as the first in any Arabic-speaking nation-state. Held in preparation for the upcoming presidential election, it was held between presidential candidates Abdel Moneim Aboul Fotouh (independent, endorsed by Al-Nour Party, moderate Islamic Al-Wasat Party and Egyptian Current Party) and Amr Moussa (independent). It was broadcast live on ONtv on May 10, 2012 and moderated by Yosri Fouda of ONTV and Mona el-Shazly of Dream TV. The format was developed for ONTV by an Egyptian company: Belail Media Production and Consulting.\nReferences\nSources\nBefore Debate\n*[http://www.egyptindependent.com/news/abouel-fotouh-moussa-appear-first-aired-presidential-debate-nehal-news-2 Egypt Independent - Abouel Fotouh and Moussa to face off in first-ever televised presidential debate]\nDuring Debate\n*[https://www.theguardian.com/world/middle-east-live/2012/may/10/egypt-presidential-election-debate?newsfeed=true The Guardian - Egyptian presidential election TV debate – as it happened]\n*[http://thelede.blogs.nytimes.com/2012/05/10/live-updates-on-egypts-presidential-debate/ New York Times -  Live Updates on Egypt’s Presidential Debate]\nAfter Debate\n*[https://www.telegraph.co.uk/news/worldnews/africaandindianocean/egypt/9258958/Egyptians-watch-first-presidential-debate-with-bemusement.html The Telegraph - Egyptians watch first presidential debate with bemusement]\n* [http://www.latimes.com/news/nationworld/world/la-fg-egypt-presidential-debate-20120511,0,988768.story LA Times - Egypt presidential candidates clash in TV debate]\n*[http://www.egyptindependent.com/news/egypts-first-presidential-debate-digest Egypt Independent - Egypt's first presidential debate: A digest]\n*[https://www.nytimes.com/2012/05/11/world/middleeast/egyptian-candidates-clash-in-tv-debate-an-arab-first.html?_r=1 New York Times - Egyptian Candidates Clash in TV Debate, an Arab First]\n*[https://www.bbc.co.uk/news/world-middle-east-18023479 BBC News - Egypt presidential election candidates in first TV debate]\n*[https://edition.cnn.com/2012/05/10/world/meast/egypt-elections/ CNN - 2 presidential candidates face off in Egypt's first such televised debate]\n*[https://www.wsj.com/articles/SB10001424052702304543904577396343506886790?mod=googlenews_wsj Wall Street Journal - First Debate Marks Race to Lead Egypt]\n*[http://www.dw.de/dw/article/0,,15943356,00.html Deutsche Welle - Egypt presidential candidates spar in first TV debate]\n*[http://www.aljazeera.com/news/middleeast/2012/05/201251104423738925.html Al Jazeera - Egypt rivals clash in presidential debate]\n*[https://www.washingtonpost.com/world/top-two-contenders-participate-in-egypts-first-presidential-debate/2012/05/10/gIQAfvciGU_story.html Washington Post - Top two contenders participate in Egypt's first presidential debate]\n*[http://english.ahram.org.eg/NewsContent/36/122/41410/Presidential-elections-/Presidential-elections-news/Egypts-first-televised-presidential-debate.aspx Ahram Online - Egypt's first televised presidential debate]\nExternal links\n* [https://www.theguardian.com/world/middle-east-live/2012/may/10/egypt-presidential-election-debate?newsfeed=true Egyptian presidential election TV debate – as it happened] - The Guardian"
    }
  ]
}