{
  "content": [
    {
      "type": "text",
      "text": "# 2012 Civic Democratic Party presidential primaries\n\nCivic Democratic Party presidential primaries, 2012 were held for 2013 Czech presidential election from 30 April to 28. June 2012. They were the first presidential primaries in the Czech Republic. Přemysl Sobotka on the primaries with 61% of votes against 39 votes for the other candidate, Evžen Tošenovský. Primaries suffered for low voter turnout as only 6,203 from 27,000 party members voted.\nThere were members of ODS who were of  opinion that the party should support Miloš Zeman instead of having its own candidate as neither Tošenovský or Sobotka is a strong candidate that can win. It was one of the reasons for a low turnout.\nCandidates\n*Přemysl Sobotka, a vice-chairman of Senate.\n*Evžen Tošenovský, a Member of European Parliament .\nDeclined\n* Miroslava Němcová, a vice-chairman of Chamber of Deputies was expected to run. She decided to not participate in election. Her decision was speculated to be a result of low performance in opinion polls for  presidential election.\n*Jaroslav Kubera, senator and mayor of Teplice. He was offered nomination by Ústí nad Labem regional organisation of ODS in April 2012. He declined the offer. He stated that he has too much respect for presidential office to run and that he knows his limits. He ran in senate election instead.\n*Tomáč Töpfer, an actor and former senator. Some members of party offered him support but he declined. \"I would run only if some Neo-Nazi threatens democracy.\"\n*Cyril Höschl, a psychiatrist. He decided to not participate as he is responsible for too many other projects.\nDebates\nThe first debate was held on 3 May 2012. Debate was very calm and without confrontation. Sobotka only criticised presidential front-runner Jan Fischer. He said that Fischer is popular because he wasn't brave to make any important decision as Prime Minister. Tošenovský said that wants to be a similar president to Václav Klaus.\nSupport of candidates in opinion polls\n{| class=\"wikitable\" style=text-align:center\n|-\n! Date !! Agency !! Miroslava Němcová !! Přemysl Sobotka !! Evžen Tošenovský\n|-\n| 14–21 January 2012 || Sanep || |7.6% || 2.8% ||\n|-\n| 14–19 May || South (Vysočina Region, South Bohemian Region) || 409 || 215 || 25.5%\n|-\n| 21–26 May || West (Plzeň Region, Karlovy Vary Region) || 416 || 143 || 19.3%\n|-\n| 28 May - 2 June || North (Ústí nad Labem Region, Liberec Region) || 722 || 170 || 29.5%\n|-\n| 4–9 June || Moravian-Silesian Region || 229 || 895 || 46%\n|-\n| 11–16 June || Central Bohemian Region || 425 || 168 || 24%\n|-\n| 18–23 June || Prague || 543 || 181 || 24%\n|-\n| 25–28 June || South Moravian Region || 329 || 224 ||\n|-\n| 30 April - 28 June|| Czech Republic || 3771 || 2432 || 23%\n|}\nAftermath\nSobotka participated in 2013 Czech presidential election but received only 2.46% of votes. It was considered a devastating defeat. Some Journalists called the result \"Blue Waterloo.\"\nSee also\n*Civic Democratic Party (Czech Republic)\n*2013 Czech presidential election\n*Primary election\nReferences\nExternal links\n*[https://web.archive.org/web/20120523212044/http://www.ods.cz/primarky Official Site of the Primaries]"
    }
  ]
}