{
  "content": [
    {
      "type": "text",
      "text": "# 2012 Kiribati presidential election\n\n| 1data1 = Tabuaeran\n| 1data2 = Tabiteuea\n| image_size = 100px\n| image3 = File:Rimeta Beniamina 2014 (cropped).jpg\n| 1data3 = Nikunau\n| map_image =\n| map_caption =\n| party1 = Pillars of Truth\n| party2 = United Coalition Party\n| party3 = Maurin Kiribati Party\n}}\nPresidential elections were held in Kiribati on 13 January 2012, following two-round parliamentary elections held in October 2011. Incumbent President Anote Tong sought re-election to a third four-year term, ending months of speculation about his decision.\nTong beat Tetaua Taitai of the United Coalition Party and Rimeta Beniamina of the Maurin Kiribati Party with a little over 42% of the vote.\nBackground\nThe elections, initially scheduled for 30 December 2011, were postponed to 13 January 2012 in order to allow citizens of the country to travel to celebrate the New Year.\nElectoral system\nThe president was elected by popular vote from among three or four candidates chosen by MPs, and was limited to three four-year terms under the constitution.\nCampaign\nThe new House of Assembly of Kiribati nominated three candidates for the presidency following the 2011 parliamentary election.\n*Anote Tong, incumbent President of Kiribati since 2003, member of Pillars of Truth\n*Tetaua Taitai, physician and politician, member of the United Coalition Party\n*Rimeta Beniamina, former leader of the United Coalition Party and standing on behalf of the Maurin Kiribati Party\nResults\nIncumbent President Anote Tong was the outright winner and re-elected as president of Kiribati, with an aggregate total of 14,315 votes or 42% of the total vote. President Tong defeated his closest challenger, Tetaui Taitai, by more than 7%, or 2,500 votes. The third challenger, Rimeta Beniamina, only received 7,738 votes. Tong was the leading candidate in 14 out of the 23 constituencies.\nPresident Tong's percentage of the vote (42%) was much less than his 2007 re-election, when he received 64% of the popular vote.\nVoter turnout was approximately 68% for the election. This was higher than the 2007 presidential elections, when voter participation was a little over 50%.\nReferences\nExternal links\n*[https://web.archive.org/web/20150212001741/http://pidp.eastwestcenter.org/pireport/2011/November/11-28-04.htm East West Center: Parliament Nominates 3 Candidates for Kiribati President]\n*[https://web.archive.org/web/20111124034058/http://www.islandsbusiness.com/islands_business/index_dynamic/containerNameToReplace=MiddleMiddle/focusModuleID=19917/overideSkinName=issueArticle-full.tpl Islands Business: Open race for the presidency in Kiribati] 15 November 2011"
    }
  ]
}