{
  "content": [
    {
      "type": "text",
      "text": "# 2012 President of the Hong Kong Legislative Council election\n\nThe election for the President of the Fifth Legislative Council took place on 10 October 2012 for members of the 5th Legislative Council of Hong Kong to elect the President of the Legislative Council of Hong Kong for the duration of the council.\nProceedings\npresided over the election|left]]\nAccording to Article 71 of the Hong Kong Basic Law and Rule 4 of the Rules of Procedure of the Legislative Council, the President of the Legislative Council has to be a Chinese citizen of 40 years old or above, a permanent resident of Hong Kong with no right of abode in any foreign country and has ordinarily resided in Hong Kong for not less than 20 years continuously.\nAs the most senior member of the parliament, Albert Ho presided over the special forum on 8 October, which allowed candidates to present their manifesto and answer questions from other members and the election. Before the voting began, three radical democrats, Leung Kwok-hung, Wong Yuk-man, and Chan Wai-yip, questioned if Tsang was a member of the Chinese Communist Party, but Ho insisted no Q&A for the voting session.\nWhile all democrats voted for Leong, Tsang was re-elected with the backing of the pro-Beijing camp.\nCandidates\n{|class=\"wikitable\" style=\"text-align:center;\"\n|-\n! scope=\"col\" style=\"width: 120px;\" | Candidate\n! colspan=\"2\" style=\"width: 140px;\" | Party affiliation\n! scope=\"col\" style=\"width: 140px;\" | Political camp\n! scope=\"col\" style=\"width: 180px;\" | Born\n! scope=\"col\" style=\"width: 480px;\" | Political office\n|-\n|\n|\n|Pro-Beijing\n| (age )Guangzhou, China\n|President of the Legislative Council Chairman of Committee on Rules of Procedure of the Legislative Council Member of the Legislative Council for Hong Kong Island Member of the Legislative Council for Kowloon West Member of the Provisional Legislative Council Non-official Member of the Executive Council Chairman of the DAB\n|-\n|\n|\n|Pan-democracy\n| (age )Hong Kong\n|Member of the Legislative Council for Kowloon East Leader of the Civic Party\n|}\nResults\n{| class=wikitable style=\"font-size: 90%;\"\n|-\n! colspan=\"2\" | Candidate\n! style=\"width: 50px\" | Votes\n! style=\"width: 40px\" | %\n|-\n! style=\"background-color: \" |\n| style=\"width: 170px\" |Jasper Tsang\n| align=\"center\" |43\n| align=\"center\" |61.43\n|-\n! style=\"background-color: \" |\n| style=\"width: 170px\" | Alan Leong\n| align=\"center\" | 27\n| align=\"center\" | 38.57\n|-\n| colspan=\"2\" | Spoilt/rejected ballots\n| align=\"center\" | 0\n| align=\"center\" | 0\n|-\n! colspan=\"2\" style=\"text-align:right\"|Turnout\n| align=\"center\" | 70\n| align=\"center\" | 100\n|}\nReferences"
    }
  ]
}