{
  "content": [
    {
      "type": "text",
      "text": "# 2014 American Society of Cinematographers Awards\n\n| site            = Hollywood & Highland Ray Dolby Ballroom\n| free_award_type = Cinematography in Theatrical Releases\n| free_award      = Birdman\n| last_link       = 2013 American Society of Cinematographers Awards\n| last            = 2013\n| next_link       = 2015 American Society of Cinematographers Awards\n| next            = 2015\n}}\nThe 29th American Society of Cinematographers Awards were held on February 15, 2015, at the Hollywood & Highland Ray Dolby Ballroom, honoring the best cinematographers of film and television in 2014.\nThe film nominees were announced on January 7, 2015. Roger Deakins received a record thirteenth nomination for Unbroken. Óscar Faura and Robert Yeoman are first-time nominees, while veterans Emmanuel Lubezki and Dick Pope also received nominations.\nWinners and nominees\nBoard of Directors Award\n* Awarded to actress and singer Barbra Streisand.\nFilm\nOutstanding Achievement in Cinematography in Theatrical Release\n* 'Emmanuel Lubezki, ASC, AMC – Birdman'\n** Roger Deakins, ASC, BSC – Unbroken\n** Óscar Faura – The Imitation Game\n** Dick Pope, BSC – Mr. Turner\n** Robert Yeoman, ASC – The Grand Budapest Hotel\nSpotlight Award\nThe Spotlight Award nominees were announced on January 16, 2014. The award \"recognize[s] outstanding cinematography in features and documentaries that are typically screened at film festivals, in limited theatrical release, or outside the United States\".\n* 'Peter Flinckenberg, FSC – Concrete Night (Betoniyö)'\n** Darius Khondji, ASC, AFC – The Immigrant\n** Daniel Landin, BSC – Under the Skin\nTelevision\nThe previous \"One-Hour\" and \"Half-Hour\" categories have been merged into one:\nOutstanding Achievement in Cinematography in Episode of a Regular Series\n* 'Jonathan Freeman, ASC – Boardwalk Empire (Episode: \"Golden Days for Boys and Girls\") (HBO)'\n** P.J. Dillon – Vikings (Episode: \"Blood Eagle\") (History)\n** Anette Haellmigk – Game of Thrones (Episode: \"The Children\") (HBO)\n** Christopher Norr – Gotham (Episode: \"Spirit of the Goat\") (Fox)\n** Richard Rutkowski – Manhattan (Episode: \"Perestroika\") (WGN America)\n** Fabian Wagner, BSC – Game of Thrones (Episode: \"Mockingbird\") (HBO)\nOutstanding Achievement in Cinematography in Television Movie, Miniseries, or Pilot\n* 'John Lindley, ASC – Manhattan (Episode: \"You Always Hurt the One You Love\") (WGN America)'\n** David Greene, CSC – The Trip to Bountiful (Lifetime)\n** David Stockton, ASC – Gotham (Episode: \"Pilot\") (Fox)\n** Theo van de Sande, ASC – Deliverance Creek (Lifetime)\nOther awards\n* ASC International Award: Phil Méheux\n* Bud Stone Award of Distinction: Denny Clairmont and Otto Nemenz\n* Career Achievement in Television: Bill Roe\n* Lifetime Achievement Award: John Bailey\n* Presidents Award: Matthew F. Leonetti\nReferences"
    }
  ]
}