{
  "content": [
    {
      "type": "text",
      "text": "# 2014 Afghan presidential election\n\nGhani\nAbdullah\n|title = President\n|before_election = Hamid Karzai\n|before_party = Independent (politician)\n|after_election = Ashraf Ghani\n|after_party = Independent (politician)\n}}\nPresidential elections were held in Afghanistan on 5 April 2014, with a second round held on 14 June. Incumbent President Hamid Karzai was not eligible to run due to term limits. The registration period for presidential nominations was open from 16 September 2013 until 6 October 2013. A total of 27 candidates were confirmed to be running for office. However, on 22 October Afghanistan's Independent Election Commission disqualified 16 of the candidates, leaving only 11 in the race. By April 2014 three candidates gave up the race and decided to support some of the eight remaining candidates. Opinion polls showed Abdullah Abdullah and Ashraf Ghani as the front-runners and indeed the results of the first round of the election had Abdullah in the lead and Ghani behind him. The second set of results came after the run-off on 14 June, two months after the first round. Preliminary results were expected on 2 July and the final result on 22 July. However, widespread accusations of fraud delayed these results. As a result, John Kerry, then United States Secretary of State, mediated the negotiations between the two final candidates, Ghani and Abdullah. After a series of negotiations and talks between Ghani, Abdullah and Kerry, the two candidates agreed to sign an Agreement to form a National Unity Government based on 50–50 power sharing. As a result of that political agreement, a separate position was created for Abdullah as Chief Executive. The National Unity Government's term ran out after the next Afghan presidential election was held in September 2019.\nThe election was the first time (and, so far, the only time) in Afghanistan's history that power was democratically transferred.\nProcedure\nOn 17 July 2013, the Parliament of Afghanistan passed a pair of election laws considered crucial to holding the election on time; President Karzai signed one and was expected to sign the other quickly. The first law to be signed laid out the composition and rules for Afghanistan's election commission and a separate commission to adjudicate complaints about voter fraud and other irregularities. The other one governed how the vote will be held.\nPakistan sealed its border with Afghanistan during the electoral period in order to reduce the chances of cross-border attacks.\nThere have been reports of polling sites running out of ballot papers due to a high turnout.\nCandidates\nA total of 27 candidates were confirmed to have submitted their nominations by Afghanistan's Independent Election Commission on 6 October 2013, the closing day of the nomination period.\n*Ashraf Ghani, former Minister of Finance\n*Dil Agha Kohdamani\n*Ishaq Gailani\n*Hashmat Ghani Ahmadzai\n*Qutbuddin Hilal\n*Qayum Karzai, brother of current President Hamid Karzai, businessman and politician\n*Fazil Karim Najmi\n*Zalmai Rassoul, former Minister of Foreign Affairs\n*Abdul Rasul Sayyaf\n*Bismillah Sher, leader of the Wefaq Millie Party\n*Abdul Rahim Wardak, former Minister of Defense\n*Abdullah Abdullah, former Minister of Foreign Affairs, leader of National Coalition of Afghanistan, presidential candidate in 2009\nHowever, on 22 October Afghanistan's Independent Election Commission disqualified 16 of the candidates, leaving only 11 in the race. The different candidates were disqualified for a number of reasons, among them were education levels, documentation and the number of required signatures. The disqualified candidates had 20 days to appeal the decision and the Independent Election Commission was due to present the final list of confirmed candidates on 19 November 2013.\nOn 25 November 2013, the Independent Election Commission announced the ordering of the candidate names for the election ballot as follows:\n{| class=\"sortable wikitable\" style=\"text-align:center;\"\n|- style=\"background:#ececec; vertical-align:top;\"\n! Candidate !! Running mate !! Coalition !! Occupation !! Political spectrum\n|-\n|FischerAbdullah AbdullahNational Coalition\n| Mohammad KhanHezbi Islami  Mohammad MohaqiqHizb-e Wahdat Islami Mardum-e Afghanistan\n| \"National Coalition of Afghanistan\"(National Front, Jamiat-e Islami, NUPA)\nSupported by(Hezbi Islami, Hizb-e Wahdat Islami Mardum-e Afghanistan, Yunus Qanuni, Atta Muhammad Nur)\n|style=\"text-align:left;\"| Politician. Former Foreign Minister.\n|style=\"text-align:left;\"| Islamic democracy, Reform\n|-\n|FischerAshraf GhaniIndependent\n| Abdul Rashid DostumNational Islamic Movement  Sarwar DanishHizb-e Wahdat Islami Afghanistan\n| NoneSupported by (National Solidarity Party of Afghanistan, Afghan Mellat, National Islamic Front, Sayed Mansoor Naderi, Milli Nijat Party),)\n|style=\"text-align:left;\"| Politician. Former Finance Minister.\n|style=\"text-align:left;\"| ReformPro-BSA\n|-\n|FischerZalmai RassoulIndependent\n| Ahmad Zia MassoudJamiat-e Islami  Habiba SarobiTruth and Justice\n| NoneSupported by(Qayum Karzai, Abdul Rahim Wardak, Sardar Mohammad Nadir Naeem, Hezb-e-Islami Shura Alliance, Hezbi Islami of Waheedullah Sabaoon)\n|style=\"text-align:left;\"| Politician. Former Foreign Minister.\n|style=\"text-align:left;\"| Centrism\n|-\n|FischerAbdul Rasul SayyafIslamic Dawa\n| Mohammad Ismail KhanJamiat-e Islami  Abdul Wahab Urfan ErfanIndependent\n| —\n|style=\"text-align:left;\"| Politician.\n|style=\"text-align:left;\"| Wahhabi Islamism\n|-\n|FischerGul Agha SherzaiIndependent\n| Sayed Hussain Alimi BalkhiIndependent  Mohammad Hashim ZareIndependent\n| —\n|style=\"text-align:left;\"| Politician. Former Governor of Nangarhar.\n|style=\"text-align:left;\"|\n|-\n|FischerQutbuddin HilalIndependent\n| Enayatullah EnayatIndependent  Mohammad Ali NabizadaIndependent\n| NoneSupported by(Hezb-e Islami Gulbuddin)\n|style=\"text-align:left;\"| Politician. Former Deputy Prime Minister. Former member of Hezbi Islami.\n|style=\"text-align:left;\"| Conservative Islamism\n|-\n|FischerMohammad Daud SultanzoyIndependent\n| Ahmad SaeediIndependent  Kazima MohaqiqIndependent\n| —\n|style=\"text-align:left;\"| Politician.\n|style=\"text-align:left;\"|\n|-\n|FischerHidayat Amin ArsalaIndependent\n| Gen. KhudaidadIndependent  Safia SeddiqiIndependent\n| —\n|style=\"text-align:left;\"| Politician, Economist, Former Finance and Foreign Minister.\n|style=\"text-align:left;\"|\n|-\n!colspan=5|Withdrawn Candidates\n|-\n|FischerQayum KarzaiIndependent\n| Wahidullah ShahraniIndependent  Ibrahim QasmiIndependent\n| Withdrew and supported Rassoul\n|style=\"text-align:left;\"| Politician & Businessman.\n|style=\"text-align:left;\"| ReformPro-Western\n|-\n|FischerAbdul Rahim WardakIndependent\n| Shah Abdul Ahad AfzaliIndependent  Sayed Hussein AnwariIslamic Movement\n| Withdrew and supported Rassoul\n|style=\"text-align:left;\"| Politician. Former Minister of Defence.\n|style=\"text-align:left;\"|\n|-\n|FischerSardar Mohammad Nadir NaeemIndependent\n| Taj Mohammad AkbarIndependent  Azizullah PuyaIndependent\n| Withdrew and supported Rassoul\n|style=\"text-align:left;\"| Secretary to former King of Afghanistan.\n|style=\"text-align:left;\"|\n|}\nDeclined to run\n*Sarwar Ahmedzai\n*Mohammad Hanif Atmar\n*Ali Ahmad Jalali\n*Zalmay Khalilzad\n*Fawzia Koofi\n*Mohammad Mohaqiq\n*Atta Muhammad Nur\n*Mohammad Yunos Qanuni\n*Ghulam Farooq Wardak\n*Mirwais Yasini\nCampaign\nOn 6 March 2014 Qayum Karzai ended his bid for the presidency, and instead announced his support for Zalmai Rassoul. Due to the lateness of his announcement Karzai's name still appeared on the ballot paper; however, Karzai told supporters to vote for Rassoul instead. Two other candidates – Sardar Mohammad Nadir Naeem and Abdul Rahim Wardak – did the same thing to create a strong Pashtun ticket.\nDebates\nAfghanistan's TOLOnews hosted several debates between the presidential candidates.\nFirst debate\nThe first debate took place on 4 February 2014 and included five candidates: Abdullah Abdullah, Qayoum Karzai, Ashraf Ghani Ahmadzai, Zalmai Rassoul, and Abdul Rahmi Wardak. The debate focused on the issues of security, the economy, and corruption.\nSecond debate\nThe second debate took place on 18 February 2014 and included four candidates: Daoud Sultanzoy, Mohammad Nader Naeem, Hedayat Amin Arsala, and Qotbuddin Helal. As with the first debate, the second debate focused on the issues of security, the economy, and corruption.\nOn the issue of security Arsala emphasised the need for better cooperation between the various Afghan security agencies. Sultanzoy focused on the issue of a lack of motivation and high desertions in the Afghan security forces. Naeem emphasised the need to combat insecurity by providing better services.\nOn the issue of peace negotiations with the Taliban Naeem argued that certain parts of the Taliban want peace and could be compromised with. Sultanzoy argued that the Taliban was a tool of foreign intelligence agencies, and that in order to marginalize the Taliban the Afghan people needed to unite behind a unifying goal. Hilal argued that the Taliban was a diverse group, with certain members being driven by poverty, whilst others were \"agents of intelligence agencies.\" Hilal argued that the former parts could and should be negotiated with. Arsala argued that if the Taliban embraced politics, instead of violence, that they could be given a \"chair in the cabinet.\"\nSultanzoy also argued that corruption was resulting in poverty, and that increases in pensions and salaries could be afforded through a reduction in corruption. Arsala also focused on the issue of corruption, arguing that \"government administration overall must be reformed.\" Hilal advocated reducing corruption through a mixture of better policing and the digitizing of government records. Naeem argued that corruption was a major issue for the Afghan bureaucracy, and had increased over the past 12 years. He argued that as an issue it must be dealt with from the top down.\nHilal also argued that whilst women should be educated and involved in society, this should be done \"within the limits of Sharia.\" Naeem argued that Afghan constitution and Afghan democracy had been achieved in a way in line with Islam. Sultanzoy argued that Afghanistan had made great sacrifices for democracy, and that equal rights under the law must be ensured. Arsala advocated an \"independent, developed and Muslim Afghanistan.\"\nThird debate\nThe third debate took place on 4 March 2014 and included three candidates: Abdullah Abdullah, Ashraf Ghani Ahmadzai, and Zalmai Rassoul. The debate focused on foreign policy. On the issue of the Durand Line, both Rassoul and Abdullah argued that the Afghan government alone cannot decide on the issue of the Durand Line, but that instead policy must be set according to the will of the people. Ahmadzai however argued that the issue of the Durand Line cannot be discussed if the conditions are not right.\nAll three candidates expressed their support for the Bilateral Security Agreement. On the subject of the zero-option, whereby the United States would fully pull out of Afghanistan, Rassoul argued that Afghanistan would still be in a position to accept international aid. Ahmadzai argued against the zero-option, stating that Afghan remained dangerous, but that Afghanistan would likely be stable by the end of the decade. Abdullah attacked Karzai's opposition to the zero-option, claiming that the danger of a zero-option had been caused by Karzai's \"unbalanced and emotional decisions.\"\nAll three candidates accused Pakistan of aiding the Taliban. Abdullah claimed that Pakistan used the Taliban \"as a tool for foreign policy.\" Rassoul argued that when discussing the issue a distinction had to be made between the Pakistani government and the Pakistani people, and that the Pakistani people \"have been friends to the people of Afghanistan.\" Ahmadzai argued that extremism posed a threat to both countries, but that Afghan sovereignty had to be maintained, and that the Afghan government had to prevent Pakistan from destabilizing Afghanistan through proxies.\nOpinion polls\nThe 2014 election was the first election in Afghanistan to make use of opinion polling. A December 2013 poll by Glevum was the first of nine planned polls funded by the United States. The polls were to be conducted by three different companies, with the United States paying for them due to Afghan institutions lacking the ability and funding to conduct the polling themselves. Following the publication of a subsequent Democracy Institute poll some Afghan electoral authorities and candidate supporters alleged the polling had been biased. As response the United States cancelled funding for any further polling in order to avoid any perception of bias.\n{| class=\"wikitable\" style=\"text-align:center;font-size:95%;line-height:14px;\"\n|- style=\"background:lightgrey;\"\n! rowspan=\"2\" style=\"width:80px;\"| Poll source\n! rowspan=\"2\" style=\"width:130px;\"| Date(s) administered\n! rowspan=\"2\" style=\"width:70px;\"| Sample size\n! style=\"width:50px;\"| Abdullah AbdullahNational Coalition\n! style=\"width:50px;\"| Mohammad Daud SultanzoyIndependent\n! style=\"width:50px;\"| Abdul Rahim WardakIndependent\n! style=\"width:50px;\"| Qayum KarzaiIndependent\n! style=\"width:50px;\"| Ashraf GhaniIndependent\n! style=\"width:50px;\"| Sardar Mohammad Nadir NaeemIndependent\n! style=\"width:50px;\"| Zalmai RassoulIndependent\n! style=\"width:50px;\"| Qutbuddin HilalIndependent\n! style=\"width:50px;\"| Gul Agha SherzaiIndependent\n! style=\"width:50px;\"| Abdul Rab Rasoul SayyafIslamic Dawa\n! style=\"width:50px;\"| Hidayat Amin ArsalaIndependent\n! rowspan=\"2\" style=\"width:50px;\"| None\n! rowspan=\"2\" style=\"width:50px;\"| Lead\n|-\n| style=\"background:#034f97;\"|\n| bgcolor= |\n| bgcolor= |\n| bgcolor= |\n| bgcolor= |\n| bgcolor= |\n| bgcolor= |\n| bgcolor= |\n| bgcolor= |\n| style=\"background:#4ac948;\"|\n| bgcolor= |\n|-\n| Glevum\n| December, 2013\n| 2,148\n| style=\"background:#C4DDF9\"| 25% || 1% || 5% || 8% || style=\"background:#DBD7D2\"| 29% || 1% || 6% || 2% || 4% || 6% ||\n| December, 2013\n| 2,500\n| style=\"background:#C4DDF9\"| 31% || – || – || 13% || style=\"background:#DBD7D2\"| 25% || – || – || – || - || 10% || – || –\n| style=\"background:#1569C7; color:white;\"| 6\n|-\n| ATR Consulting / Tolo News\n| 11–21 December 2013\n| 2,063\n| style=\"background:#C4DDF9\"| 27% || 0.4% || – || 4% || style=\"background:#DBD7D2\"| 19% || – || – || – || – || – || 0.1% || 7%\n| style=\"background:#1569C7; color:white;\"| 8\n|-\n| ATR Consulting / Tolo News\n| 8–12 October 2013\n| 1,300\n| style=\"background:#C4DDF9\"| 21% || – || 0.8% || 5.7% || style=\"background:#DBD7D2\"| 13.6% || – || 0.9% || – || 1.1% || 3.4% || – || 50%\n| style=\"background:#1569C7; color:white;\"| 7.4\n|-\n|colspan=\"16\" style=\"background:#D0D0D0; color:black\" | 2013\n|- style=\"background:#EFEFEF; font-weight:bold;\"\n|\n|\n| 4,597,727\n| 30.59% || - || – || - || 2.94% || – || – || – || – || – || 0.05% ||\n|-\n|colspan=\"16\" style=\"background:#D0D0D0; color:black\" | 2014\n|- style=\"background:#EFEFEF; font-weight:bold;\"\n|\n|\n| 6,604,546\n| 45.00% || 0.46% || – || - || 31.56% || – || 11.37% || 2.75% || 1.57% || 7.04% || 0.23% ||\n|\n|}\nConduct\nSecurity concerns\nduring the 2014 presidential election.]]\nOn 7 April 2014, a roadside bomb was detonated in the Maywand District when a van drove over it, killing all 13 people on board. Some suspected the Taliban were responsible, though the group blamed international forces for the attack. The 2014 presidential elections is the first year Afghan National Security Forces (ANSF) have taken the lead for such an event.\n.]]\nOn 6 June 2014, candidate Abdullah Abdullah narrowly survived an assassination attempt. In the attack, suicide bombers targeted his armored car, severely damaging the vehicle and killed three of his bodyguards as well as three bystanders. Abdullah escaped largely unscathed, strongly condemning the attack while commenting, \"the best response to this conspiracy is to go to vote on election day.\" No group immediately claimed responsibility for the attack, though the Taliban has previously threatened to violently disrupt the electoral process.\nOn July 1, 2014, Afghan security forces seized weapons, ammunitions and explosives and killed around 27 Taliban during operations in Kunar, Kunduz, Badakhshan, Balkh, Zabul and Helmand provinces.\nThe next day, a suicide bomber riding a bicycle targeted a vehicle of the Afghan National Army (ANA) at around 6.30 a.m. in which 14 people, including civilians were killed.\nThe Afghan Intelligence – National Directorate of Security (NDS) Chief, Rahmatulllah Nabil accused Pakistan's ISI and Iranian Revolutionary Guard Corps (IRGC) of escalating clashes in the Helmand Province.\nThe Taliban is said to have gathered hundreds of fighters in a bid of overtaking this region, amidst the U.S. withdrawal, which will be completed by December 2014.\nAllegations of fraud\nIn July, certain allegations regarding fraudulent practices in the voting process emerged. The European Union sent 6 observers in Kabul, Balkh and Herat provinces. Thijs Berman, head of the EU election assessment team, called for an in-depth review of the electoral fraud claims and said that necessary steps would be taken to clean it.\nAbudullah accused President Hamid Karzai of conspiring in the rigging of the elections.\nThe NDS recorded Ziaul Haq Amarkhel, the secretary of Afghanistan's Independent Election Commission, telling local officials to \"take sheep to the mountains, stuff them, and bring them back,\" in an apparent reference to ballot stuffing. In total, Nabil informed Karzai that NDS had intercepted approximately 5,000 communications with indicia of electoral fraud. Some of this evidence was leaked to Abdullah by an NDS officer. Steve Coll recounts: \"Ghani's surge of votes in the second round from Pashtun areas racked by violence was inherently suspect. Some analysts guessed that if all the fraud could be identified accurately, Abdullah would have won the election, but not every international analyst agreed.\"\nResults\nThe preliminary results were announced on 26 April and were finalised on 15 May. About 12&nbsp;million Afghans were registered to vote in the country and about 8&nbsp;million members of Afghan diaspora were also eligible to vote. Nearly two-thirds of the Afghan population were under the age of 25.\nNo candidate secured more than the 50% of the vote, so there was a second round run-off on 14 June. Preliminary results for the second round were due on 2 July, but were delayed to 7 July. When they were announced, Ashraf Ghani had won with 56.4% of the vote.\nDue to allegations of widespread fraud, US Secretary of State John Kerry announced on 12 July that all ballots would be audited under UN supervision. Following the recount, the number of valid votes had dropped from 7,972,727 in the preliminary results to 7,120,585 in the final results. The final results also showed that Ghani's vote share had decreased to 55.3%.\nBy province\n{| class=\"wikitable sortable\" style=\"text-align:right\"\n!rowspan=2|Province\n!colspan=2|Abdullah Abdullah\n!colspan=2|Ashraf Ghani\n|-\n!Votes\n!%\n!Votes\n!%\n|-\n|align=left|Kabul||389,584||49.62||248,220||31.62\n|-\n|align=left|Kapisa||52,544||78.81||2,745||4.12\n|-\n|align=left|Parwan||107,478||71.80||8,395||5.61\n|-\n|align=left|Wardak||36,253||36.37||15,064||15.11\n|-\n|align=left|Logar||6,169||18.65||20,953||63.35\n|-\n|align=left|Ghazni||194,264||54.01||68,328||19.00\n|-\n|align=left|Paktika||19,097||10.55||118,089||65.21\n|-\n|align=left|Paktia||13,610||5.37||157,826||62.32\n|-\n|align=left|Khost||4,040||3.57||83,691||74.01\n|-\n|align=left|Nangarhar||63,689||19.00||200,409||59.80\n|-\n|align=left|Kunar||13,257||12.35||69,545||64.76\n|-\n|align=left|Laghman||8,495||10.4||40,673||49.82\n|-\n|align=left|Nuristan||23,234||37.64||9,001||14.58\n|-\n|align=left|Badakhshan||191,260||64.85||42,548||14.43\n|-\n|align=left|Takhar||159,375||50.35||121,100||38.25\n|-\n|align=left|Baghlan||152,560||60.14||51,953||20.48\n|-\n|align=left|Kunduz||100,413||47.05||80,893||37.91\n|-\n|align=left|Samangan||86,845||61.33||37,632||26.58\n|-\n|align=left|Balkh||238,582||60.92||109,694||28.01\n|-\n|align=left|Jowzjan||29,375||19.94||101,985||69.23\n|-\n|align=left|Sar-i-Pul||74,711||50.41||57,097||38.53\n|-\n|align=left|Faryab||77,633||29.31||173,225||65.39\n|-\n|align=left|Badghis||86,620||67.52||12,577||9.8\n|-\n|align=left|Herat||301,364||61.15||54,618||11.08\n|-\n|align=left|Farah||18,029||31.78||22,708||40.03\n|-\n|align=left|Nimroz||9,674||20.88||15,562||33.59\n|-\n|align=left|Helmand||17,905||17.29||34,110||32.94\n|-\n|align=left|Kandahar||26,500||10.61||34,698||13.9\n|-\n|align=left|Zabul||3,856||18.93||7,782||38.19\n|-\n|align=left|Urozgan||5,317||23.8||6,022||26.95\n|-\n|align=left|Ghor||180,446||59.51||39,698||13.09\n|-\n|align=left|Bamyan||113,324||67.93||18,427||11.05\n|-\n|align=left|Panjshir||37,925||87.29||166||0.38\n|-\n|align=left|Daikundi||128,713||75.05||19113||11.14\n|-\n|align=left|Total||2,972,141||45.00||2,084,547||31.56\n|-\n|align=left colspan=5|Source: [http://www.mutazilah.org/afghan2014.xls Mutazilah] [https://web.archive.org/web/20160130102924/http://www.iec.org.af/results/en/finalresults/presidentialbyprovince IEC]\n|}\nConclusion\nsits with Afghan presidential candidates Abdullah Abdullah, left, and Ashraf Ghani, right, at the U.S. Embassy in Kabul, Afghanistan on July 12, 2014, after he helped broker an agreement on a technical and political plan to resolve the disputed outcome of the election between them.]]\nOn 24 August President Karzai met with the two candidates, and told them they should rapidly conclude the audit process. The inauguration ceremony was set for 2 September 2014, one month after it was scheduled by the UN. He also said that the inability of the candidates to compromise on the results had led to Afghanistan deteriorating. Although Karzai had insisted he would step down on 2 September, he remained in office due to security concerns. The results of the election remained in dispute, despite a proposal by the United States that the candidates agree to a power-sharing deal, which was initially agreed to. A UN-led audit failed to sway Abdullah as he insisted the audit team could not explain a million extra votes counted in the run-off. Ghani supporters insisted they wanted to do a deal and were leaving the door open to negotiations\nOn 19 September the Independent Election Commission announced Ghani as the winner. Five hours later, Abdullah and Ghani signed a power-sharing agreement, with Ghani being named president and Abdullah taking on an important position in the government; the deal was signed in front of the presidential palace, with incumbent president Hamid Karzai in attendance. Part of the deal stipulated that the Independent Election Commission would not release the exact vote totals of the second round of voting.\nReferences\nExternal links\n*[http://www.english.rfi.fr/asia-pacific/20140313-afghan-presidential-election-2014-your-questions-answered Radio France International in English]"
    }
  ]
}