{
  "content": [
    {
      "type": "text",
      "text": "# 2015 Republic of the Congo constitutional referendum\n\n|yes=1223940\n|no=73648\n|invalid=23069\n|electorate=1855792\n|outcome=\n}}\nA constitutional referendum was held in the Republic of the Congo on 25 October 2015 regarding a proposal to change the constitution, primarily to modify the rules regarding presidential terms.\nBackground\nAfter Denis Sassou Nguesso returned to power in the 1997 civil war, a new constitution was approved in the January 2002 constitutional referendum. The 2002 constitution provided for a strong executive presidency, without a prime minister, and weakened the legislature; the length of presidential terms was increased to seven years (with a limit of two terms), and an age limit of 70 years for presidential candidates was established, apparently to exclude Sassou Nguesso's most important political opponents, who had either reached that age or were nearing it. Parties opposed to Sassou Nguesso criticized the new constitution and called for the people to boycott the 2002 referendum.\nUnder the 2002 constitution, Sassou Nguesso was elected as President in 2002 and re-elected in 2009. As the end of Sassou Nguesso's second term approached, and he passed the age limit of 70 years, the ruling Congolese Labour Party (PCT) promoted public discussion of the idea of replacing the 2002 constitution. While the opposition saw these discussions strictly in light of the presumed intention of Sassou Nguesso to remain in power beyond 2016, the PCT argued that a new constitution would provide for better governance, and Sassou Nguesso himself said nothing about whether or not he wanted to run for re-election. Eventually it was announced that a referendum would be held on a proposed new constitution, and on 5 October 2015 it was announced that the referendum would be held on 25 October.\nProposed changes\nThe draft constitution was divided into 246 articles. It would allow a person to be elected as President three times, eliminate an age limit of 70 years for candidates, and reduce the length of presidential terms from seven years to five years. While eliminating the maximum age limit, it would reduce the minimum age requirement for candidates from 40 to 30 years. It would also establish the post of Prime Minister as head of government, rather than the President. The changes would allow President Denis Sassou Nguesso, whose second term was due to expire in 2016, to run for re-election.\nCampaign\nThe official campaign period for the referendum was scheduled to run from 9 October to 23 October 2015. Speaking at the beginning of the campaign period, Raymond Mboulou, the Minister of the Interior, stressed the importance of campaigning being conducted \"in a climate of social peace, a climate of tolerance, of acceptance of different opinions, a climate that excludes provocations ... and which fundamentally preserves the public order.\"\nA large rally in support of the referendum was held in Brazzaville on 10 October. Speaking at the rally, the Secretary-General of the Congolese Party of Labour (PCT), Pierre Ngolo, declared that \"this human tide simply wants to say that changing the constitution is the will of the people, and as such no one can stop it.\"\nA protest against the referendum was held in Brazzaville on 20 October. The demonstration had been banned by the government and was dispersed by police. Protesters set up barricades in the streets and attacked police stations. Police fired into the air and used tear gas to break up the protest, and four people were reportedly shot and killed by police during the violence.\nProtests continued for a second day in the Makélékélé section of Brazzaville on 21 October, with the protesters again setting up barricades and burning tires. The army was called in and helped police disperse the protesters. Hardline opponents of the referendum planned to boycott the vote, viewing it as nothing more than a way for Sassou Nguesso to remain in power, and said they would continue protesting. Ngolo, on the other hand, argued that it was necessary to change the constitution \"for the future of the country, to ensure peace and stability\". Meanwhile, François Hollande, the President of France, said that \"Sassou can consult his people. That's part of his right and the people must respond.\"\nAs the official campaign period drew to a close, the opposition decided not to hold protests on 23 October, and Brazzaville was reportedly calm. Paul-Marie Mpouele, leader of an opposition coalition, the Republican Front for the Respect of Constitutional Order and Democracy (FROCAD), urged people to oppose the referendum but also refrain from violence. Meanwhile, security forces surrounded the home of Guy Brice Parfait Kolélas, leader of the opposition Congolese Movement for Democracy and Integral Development (MCDDI), who had been involved in the protests earlier in the week.\nConduct\nWhen the referendum was held on 25 October, turnout in the cities was reportedly low, although support for the change was apparently overwhelming among those who showed up to vote. Kolelas claimed that people were respecting the opposition's call for a boycott. Voting in Brazzaville, Sassou Nguesso said that \"we want change in order to have a constitution of the future\", rejecting the opposition's claim that the true purpose of the referendum was to keep him in power. He said that if people opposed changing the constitution they should simply vote against it, not boycott the referendum. \"The Congolese are a free and sovereign people\", he declared, predicting that the referendum would succeed \"because I know that our people love peace.\"\nThe vote was held peacefully, without any reports of violence. Turnout reportedly improved as the day progressed and \"logistical problems\" were resolved. However, Pascal Tsaty Mabiala, the leader of the main opposition party, the Pan-African Union for Social Democracy, argued on 26 October that the referendum was \"totally discredited\" due to low turnout and that as a result it should be annulled.\nResults\nRaymond Mboulou, the Minister of the Interior, announced the results of the referendum on 27 October, stating that the proposal to change the constitution was overwhelmingly approved by voters, with 92.96% in favor. Turnout was placed at 72.44%. Mboulou said that the new constitution was thus adopted and would officially become the law of the land once it was promulgated by President Sassou Nguesso. Meanwhile, the opposition FROCAD coalition denounced the referendum and vowed \"civil disobedience until the withdrawal of the planned constitution\".\nOn 27 October, Ngolo expressed satisfaction with the results \"without triumphalism\": \"The most important thing is not what we gain but what the country gains. It is the victory of Congolese democracy.\" He also explained that, according to the new constitution, existing elected institutions would remain in place until their normal terms expired, at which point they would be replaced by institutions elected under the terms of the new constitution. Therefore, the National Assembly, for example, would remain in place until the end of its normal five-year term in 2017.\nThe opposition planned to hold a protest on 30 October, but because the government's ban on protests remained in place, the opposition decided to cancel the protest. Kolelas said that if they went ahead with the protest, the security forces \"would shoot at us again\", and \"we cannot lead our people to the slaughterhouse\". Instead, the opposition held a ceremony to commemorate the protesters who were killed by security forces on 20&ndash;21 October. The opposition claimed that 17 people died during the protests, considerably more than the official death toll of four. On 2 November, the opposition announced that it was also abandoning its plans for civil disobedience.\nThe new constitution was formally promulgated by President Sassou Nguesso on 6 November 2015.\n{| class=wikitable style=text-align:right\n!Choice\n!Votes\n!%\n|-\n|align=left|For||1,223,940||94.32\n|-\n|align=left|Against||73,648||5.68\n|-\n|align=left|Invalid/blank votes||23,069||–\n|-\n|align=left|Total||1,320,657||100\n|-\n|align=left|Registered voters/turnout||1,855,792||71.16\n|-\n|align=left colspan=3|Source: [https://cour-constitutionnelle.cg/admincc/decisions/DCC-003-du-5-nov-15.pdf Constitutional Court]\n|}\nReferences"
    }
  ]
}