{
  "content": [
    {
      "type": "text",
      "text": "# 2015 timeline of the Somali Civil War\n\nThis is a 2015 timeline of events in the Somali Civil War (2009–present).\nJanuary\nJanuary 1\n*Somali government forces and al-Shabaab militants engage in a gunfight near the southern town of Kurtun Waarey. Al-Shabaab commander Ibrahim Filey is killed during the skirmish, in addition to three other insurgents.\nJanuary 3\n*Al-Shabaab insurgents attack a Somali military base on the outskirts of Baidoa. The insurgents briefly seize the station until they are eventually repelled. According to national military officer Ahmed Idow, three al-Shabaab fighters were killed during the gunfight, while seven soldiers died. A spokesman for the insurgent group claims instead that the militants killed 10 soldiers.\nJanuary 5\n*According to Interior Ministry spokesman Mohamed Yusuf, security forces are warned of a car laden with explosives in Mogadishu. The security officers trail the vehicle in question, which abruptly detonates near the Aden Adde International Airport. The car was reportedly targeting a convoy carrying soldiers of the Alpha Group intelligence unit. Officials indicate that four people are killed during the blast. Al-Shabaab spokesman Sheikh Abdul Aziz Abu Musab also claims responsibility for the explosion.\nJanuary 7\n*Al-Shabaab militants execute four men in the Bardhere district by firing squad. The executions come after a Gedo province court belonging to the insurgent group accuses the individuals of spying for the Federal Government of Somalia, Ethiopia and the United States.\nJanuary 8\n*AU Special Representative to Somalia Ambassador Maman Sidikou announces that, following joint military operations by Somali government forces and AMISOM troops, al-Shabaab has lost control of over 80% of territory that it previously held. He indicates that the insurgents have now concentrated their capacity in the Lower Juba province. Sidikou does not specify when exactly the cleanup operations against al-Shabaab will conclude, but they are expected to be launched within a few weeks.\nJanuary 13\n*Somali government forces and AMISOM troops clash with al-Shabaab militants for control of Trako locality. The insurgent bastion is situated 50 kilometers west of the Bardhere district. According to local residents, the joint forces advanced to the area from Elwak district. The gunfight reportedly involves both light and heavy arms. Casualties are uncertain.\nJanuary 15\n*Al-Shabaab militants attack a police station in the northeastern city of Bosaso with grenades and gunfire. Local residents report that the ensuing gunfight with Puntland security forces lasts 30 minutes. The insurgents flee ahead of police reinforcements at the garrison. According to Puntland police captain Mohammud Saciid, two policemen are killed and three are wounded during the raid. Al-Shabaab military operations spokesman Abdiasis Abu Musab asserts that the insurgents killed three officers. Security forces subsequently launch a crackdown in the city, with arrests pending. The skirmish comes after Puntland security forces successfully concluded a campaign against al-Shabaab in the Galgalga hills, scattering the remaining militants. Operation Indian Ocean in the southern part of the country has similarly confined the rebels to rural areas, from which they have resorted to launching hit-and-run attacks in urban centers.\nJanuary 17\n*Security forces launch house-to-house searches and other safety measures in Mogadishu and environs. The stabilization operations are prompted by gathered intelligence indicating possible breaches of security. A number of al-Shabaab suspects and illicit arms are in the process seized in the Kaxda district. Following tips from residents, local police patrol specific areas in the Howlwadaag district, detain suspects that were planning attacks, and impound their vehicles. Additionally, security forces discover a small bullet- and explosive-making factory in Heliwaa district. They subsequently apprehend five suspects, and dismantle the weapons center.\n*Luq District Police Commissioner Siyad Abdulkadir Mohamed announces that Sheikh Osman Sheikh Mohamed, the commander of al-Shabaab's militia in the Luq area, has turned himself in to the federal authorities. The rebel leader likewise reportedly hands over all of his weaponry. According to the police official, further al-Shabaab members intend to defect. He also indicates that the federal government welcomes all former insurgents who disavow of the use of violence and instead pledge to take part in the peace process.\nJanuary 18\n*Al-Shabaab militants and AMISOM forces engage in a gunfight in Arbaow. The skirmish begins after the insurgents attack AMISOM bases in the region at midnight, also firing rockets. According to a local resident, AMISOM troops in return inadvertently launch rockets into civilian areas. Casualties are uncertain.\nJanuary 19\n*Somali government forces and AMISOM troops launch a security operation in Jalalaqsi district in the south-central Hiran province. According to the Jalalaqsi mayor Omar Osman Maow, they in the process disarmed a number of residents that were causing disruption in the district. He also indicates that the joint forces arrested seven suspected al-Shabaab militants during the raid.\nJanuary 20\n*The just appointed Mayor of Afgoye Ali Jalil dies in a landmine explosion targeting him near the Lower Shabelle province's Hawa Abdi locality. Provincial Governor Abdikadir Mohamed Nuur indicates that al-Shabaab militants were likely responsible for the killing as they previously targeted governmental and military officials stationed in the area, including himself. He also announces that the provincial administration has launched an investigation into the slaying.\nJanuary 22\n*A suicide bomber drives a vehicle loaded with explosives into the gates of the SYL hotel in Mogadishu. According to a Somali intelligence official, a 70-member Turkish delegation was at the time staying at the establishment, one day ahead of a scheduled visit by the President of Turkey Recep Tayyip Erdoğan. Turkish Prime Minister Ahmet Davutoğlu indicates that all of the delegates are safe, and that casualties besides the bomber include three local residents and some broken windows. He also states that it is unclear whether the Turkish delegation was the target of the explosion, and that Erdoğan would continue with his planned visit. A witness reports that two of the dead are police officers. Al-Shabaab spokesman Sheikh Abdiasis Abu Musab subsequently claims responsibility for the attack, but makes no mention of Erdoğan's trip. He instead asserts that the militants disrupted a gathering of local police, killing several officers. President of Somalia Hassan Sheikh Mohamud and Davutoğlu both indicate that their respective administrations will launch probes into the blast. A few hours later, Erdoğan's scheduled visit is postponed to 25 January so that he and Mohamud may attend the funeral service of King Abdullah of Saudi Arabia, who has just died. Erdoğan also asserts that the explosion was likely not targeting Turkish officials, reaffirms Turkey's support for Somalia, and suggests that any party who resents the Turkish authorities' various development projects in Somalia is an enemy of the state. Security forces subsequently apprehend over 10 senior police and intelligence officials for allegedly facilitating the attack, including several generals and colonels. The bombers had reportedly traversed a number of vehicle checkpoints before carrying out their suicide raid.\nJanuary 24\n*Somali government forces and AMISOM troops capture Bulo-Jadid, Bulo-Yusuf and El Jarmed villages in the Bakool province from al-Shabaab. The insurgent group had for some time imposed a blockade on the three southwestern towns. According to Tiyeglow Mayor Mohamed Abdulle Hassan, the militants mounted little resistance to the advancing forces. Al-Shabaab also does not issue a statement on the raid. The joint forces are slated to continue their cleanup operation in the remaining central and southern areas that are under insurgent control.\nJanuary 29\n*Somali government forces engage al-Shabaab militants near Garbaharay in the southwestern Gedo province. According to Somali National Army commander Abdullahi Mohamed Abshir, SNA soldiers therein apprehend two mid-level insurgent leaders. Gedo remains one of the last regions with a few districts controlled by the militant group.\n*Interim Juba Administration forces and AMISOM troops seize three small towns in the Lower Juba province from al-Shabaab. According to IJA commander Mustaf Geedi, the joint forces killed many militants, whereas two allied soldiers sustained minor wounds. The raid is part of a larger cleanup operation by IJA forces in Jubaland.\n*Somali government forces assisted by AMISOM troops capture Janay-Abdalla and Farwamo villages in the Middle Jubba province from al-Shabaab. The joint forces liberate the Jubba river localities after a brief skirmish with the militants. No casualties have thus far been reported. Additionally, al-Shabaab does not issue a statement on the raid.\nJanuary 31\n*Somali government forces engage al-Shabaab militants on the outskirts of Baladwein in the south-central Hiran province. According to the commander of the Somali National Army's tenth battalion Colonel Isak Idris, the state troops killed a number of insurgents while sustaining some wounds.  Total casualties are uncertain. Al-Shabaab does not issue a statement on the skirmish. Idris also indicates that they have flushed out the militants from the area.\n*Governor of the Lower Shebelle province Abdulkadir Mohamed Nor \"Sidi\" announces that an airstrike has struck an al-Shabaab convoy and training base in the Dugale village. According to Nor, a U.S. aircraft fired at least three missiles, respectively targeting a fighting vehicle, a residence containing foreign fighters, and a militant installation where they were wrapping up a training course. He asserts that between 45 and 60 insurgents are in the process killed. Their training base is also demolished. Additionally, a local resident reports that the area's inhabitants vacated the area upon hearing the loud explosion. Bay province official Ahmed Adan later specifies that the airstrike was targeting a convoy of senior al-Shabaab leaders near Dinsoor. According to Adan, two local residences as well as a militant training base were targeted. He also indicates that he has ground confirmation that a number of the group's fighters and one senior commander were killed during the aerial attack, which took place as the insurgents were traveling in vehicles toward the training facility. The identity of the slain al-Shabaab leader is not yet known. The Dinsoor locality is one of the last remaining urban areas under militant control. Pentagon Press Secretary Rear Admiral John Kirby later confirms that the U.S. Hellfire missile strike was targeting al-Shabaab's chief of external operations and planning for intelligence and security, Yusuf Dheeq. He indicates that whether the militant leader was slain is being assessed, and that there appear to be no civilian casualties. The Federal Government of Somalia subsequently issues a press statement officially confirming that Dheeq has been killed.\nFebruary\nFebruary 1\n*Somali National Army commander in the Gedo province Jama Muse announces that government forces have captured a senior al-Shabaab official. Muse does not specify the insurgent leader's identity. However, he indicates that the rebel commander was in charge of bomb making. The seizure comes seven days after President Hassan Sheikh Mohamud called for more militant defections.\nFebruary 3\n*Somali national army troops apprehend al-Shabaab commander Olow Barrow in the Middle Shabelle province. Senior military official Mohamed Osman indicates that the insurgent leader had been injured during a skirmish near Fidow locality. Barrow is slated to be transferred to Mogadishu for interrogation.\nFebruary 8\n*Al-Shabaab militants attack Puntland police at a security checkpoint in Bosaso. According to Abshir Mohamed, head of security at the adjacent residence of deputy police commander Muhidin Ahmed in Bosaso, the insurgents drove up in a van and began shooting and hurling grenades at officers when their vehicle was stopped for inspection. He indicates that casualties include five injured and two dead policemen, as well as one slain militant. Al-Shabaab spokesman for military operations Sheikh Abdiasis Abu Musab later confirms responsibility for the raid.\nFebruary 9\n*Federal MP Abdullahi Qayat Barre is gunned down in Mogadishu's Hamar Jajab district as he is exiting his house. The shooting takes place a few hours before the legislature is slated to vote for a new council of ministers. Head of Parliament Secretariat Abdikarim Haji Buuh later confirms that the lawmaker died from the wounds he sustained. The gunmen are unknown.\nFebruary 10\n*Tiyeglow Mayor Mohamed Abdalla Hasan announces that Somali National Army forces and AMISOM troops have made significant territorial gains against al-Shabaab and are advancing toward the insurgent group's last bastions in the Hudur region. The march aims to liberate the remaining parts of the Bakool area that the militants have cut off.\nFebruary 12\n*Somali government forces and AMISOM troops launch security operations in Jalalaqsi and environs. According to the local deputy district commissioner Ibrahim Madoobe Noor, the joint forces are in pursuit of individuals believed to be causing unrest, and are slated to remove al-Shabaab militants from the main trade routes they blocked.\nFebruary 13\n*Puntland army troops launch a raid against al-Shabaab insurgents in Madashon. The locality is situated 23&nbsp;km west of the Galgala Mountains. According to officials, casualties include three dead Puntland soldiers, seven wounded state troops, and five slain militants. One insurgent is also captured. The raid comes in the wake of a broader cleanup operation by Puntland Defence Forces of the last al-Shabaab hideouts in the mountainous Galgala area. Puntland Security Minister Hassam Osman Mohamud \"Allore\" later specifies that 2 state troops died and 6 other soldiers were wounded during the raid, while 16 al-Shabaab militants were killed and 26 other insurgents were injured. He also indicates that the aim of the operation was to rescue civilians that the militants had captured, and asserts that Puntland forces will eliminate the remaining insurgent elements shortly.\nFebruary 16\n*Gunmen kill four aviation officials during a drive-by shooting at the KM4 junction in Mogadishu. The slain workers include director of air transport Abuukar Adnani, head of civil aviation administration Mohamed Kediye Jim’aale, air navigation manager Mohamed Ahmed Haruun, and civil aviation chauffeur Hussein Hillow Adnan. The attackers had been trailing the officials' vehicle before they opened fire on it and fled the scene. No group has claimed responsibility for the attack. The Federal Ministry of National Security later puts on display two of the five alleged assassins. According to ministry spokesman Mohamed Yusuf Osman, the pair were apprehended, while two of the other killers managed to escape, and one was slain on the scene of the murder of the airport workers. He adds that the two captured men were trying to switch the plate armour of their vehicle when they were seized.\n*Somali National Army and al-Shabaab militants engage in a gunfight in Jalalaqsi. According to the local district commissioner Omar Osman Ma'ow, the skirmish began after the insurgents attempted to seize control of the town from government forces. He indicates that the army troops managed to repel the militants. The official also asserts that casualties include three slain insurgents, and one wounded soldier. Al-Shabaab does not issue a statement on the raid.\nFebruary 17\n*Gunmen kill prominent local business man Haji Omar Mohamed Nur (Xaaji Qurow) in Baladweyne. According to the mayor, Nur was at the time renovating the district's office building. Baladweyne district governor Mohamed Osman Abdi indicates that the entrepreneur's bodyguards are also slain. Witnesses report that the gunmen wore military fatigues. The perpetrators flee the scene before government forces arrive. Security personnel subsequently launch a probe into the shooting. Somali government forces assisted by AMISOM troops subsequently launch a large security sweep in Baladweyne. They in the process apprehend 50 individuals that are suspected of having been involved in Nur's murder. According to the local mayor Mohamed Osman, the suspects are now being held at the police station, where they are being interrogated. Residents also indicate that the raid is the largest door-to-door operation of its kind in months.\nFebruary 18\n*Government forces launch a security operation in the Bakool province, seizing two senior al-Shabaab commanders. According to the Somali National Army head of operations in the region Abdiladhif Mohamed Botan, the apprehended insurgent leaders are Sheikh Hassan Dhubow and Sheikh Abdi Barow. Botan indicates that the pair are among the main operatives within al-Shabaab, and that state troops encountered heavy gunfire while attempting to capture them. Al-Shabaab do not issue a statement on the raid. Analysts suggest that the security operation may represent a breakthrough, which significantly hinders the proper functioning of local militant cells.\n*Somali National Intelligence and Security Agency (NISA) special forces launch a security operation in Mogadishu. According to Ministry of National Security spokesman Mohamed Yussuf, the soldiers were deployed at night at various road junctions in the capital, and subsequently began searching and tracking vehicles transporting security guards with illegal arms at dawn. The official also indicates that the operation will be conducted throughout the city to ensure tranquility.\n*Somali National Army forces assisted by AMISOM troops launch a large security sweep in villages in the Buula-burde district. According to local SNA commander Abdullahi Elmi Barre, the operations aim to firm up on security and apprehend militants and bandits hiding in the area. The joint forces in the process capture dozens of al-Shabaab suspects, whom the army official indicates will be tried following a probe. The sweep comes in the wake of a pledge by the district administration to eliminate insurgents who were impeding road transportation.\nFebruary 20\n*Al-Shabaab militants launch a surprise attack on the Central Hotel in Mogadishu, when a vehicle laden with explosives smashes into the compound's gate. Gunmen then penetrate the premises and open fire in the hotel mosque. Police Major Nur Mohamed indicates that a suicide bomber also blows himself up within the complex. 20 people are reportedly killed in the attack, including the local deputy mayor and a legislator according to the government. Minister of Information Mohamed Hayir Maareeye states that Deputy Prime Minister Mohamed Omar Arte and other federal ministers were at the time in the compound, but survived the raid. An al-Shabaab spokesman later claims responsibility for the attack, indicating that the militants had targeted the officials during prayer-time as retribution for \"apostasy\". Security subsequently cordon off the area around the hotel.\nFebruary 24\n*Somali government forces assisted by AMISOM troops carry out a security operation in the vicinity of Mahas town. According to the local district commissioner Mohamed Muumin Sanay, the sweep is successful, with the joint forces killing an al-Shabaab tax collection leader after an exchange of gunfire. He adds that the troops are also pursuing other militants in the area. Al-Shabaab does not issue a statement on the raid. The security sweep is part of a larger cleanup operation in the Hiraan province.\nFebruary 26\n*Police announce that unknown attackers have launched several mortars that landed near the presidential palace in Mogadishu. Al-Shabaab militants claim responsibility for the shelling, and assert that the mortar rounds landed inside the compound. Casualties if any are uncertain. According to officer Ali Hussein, the police have launched a probe to find out who are the perpetrators.\nMarch\nMarch 1\n*Custom Duty Chief for Galkayo Duran Omar Dahir is killed downtown after a bomb is planted in his vehicle. No group claims responsibility for the blast. Security forces subsequently reach the area and begin probing the circumstances surrounding the attack.\n*Somali National Army forces and al-Shabaab militants engage in a skirmish in El-Bur district. According to SNA Colonel Mohamed Arale, the government troops manage to secure the area. He also indicates that the army forces and AMISOM troops, with intelligence assistance provided by the general public, are in the final stages of flushing out the insurgents.\nMarch 4\n*Somali National Army forces assisted by AMISOM troops launch a sweep in Eel-Buur district against al-Shabaab. According to local SNA commander Mohamud Mohamed, the security crackdown is prompted by complaints from residents. He also indicates that the joint forces have apprehended several suspected insurgents and are in pursuit of the remaining ones in the area. Additionally, the Buur-hakaba district administration announces that the state forces have launched a manhunt for other militants who put up illicit roadblocks in the Bay region.\nMarch 6\n*Somali National Army forces launch a search operation for unidentified gunmen that robbed travelers in Leego. The locality is situated in the Lower Shabelle province. According to the Leego division commissioner Abuukar Issack al-Adaal, government troops are liaising with local residents to apprehend the robbers, who are hiding out in the area.\nMarch 7\n*Gunmen shoot down a traditional elder at his home in Baladweyn. They also injure his wife and two of his children. Additionally, the attackers reportedly seize a young man from the house, who is later found dead in Barjo Eento locality.\n*The Dhusamareeb administration announces that al-Shabaab landmine expert Abdullahi Mohamed \"Madoobe\" has surrendered to government forces stationed in the town. According to the local district commissioner Abdirahman Ali Mohamed \"Geeda-Qorow\" and police commander Abdullahi Garar, the bomb specialist is now under their protective custody. Garar indicates that Mohamed also previously trained as a bodyguard. At a press conference, Mohamed concurrently renounces ties with al-Shabaab, denounces its ideology, and urges young fighters within the militant group to follow suit and defect.\n*The Federal Government of Somalia announces that it will deploy drones in its military operations against al-Shabaab. According to Ministry of Security spokesperson Mohamed Yusuf Osman, the Somali National Army is slated to use the unmanned aerial vehicles separately from AMISOM. However, he does not specify the quantity or provenance of the equipment. The drones will target the insurgent group's remaining bases and installations in the countryside.\nMarch 8\n*The US government officially removes al-Shabaab defector Zakaria Ismail Hersi (\"Zaki\") from its Rewards for Justice List. The decision is reached after negotiations between the Somali federal government and US authorities, which concluded that Zaki had met the conditions unambiguously establishing that he is no longer associated with the militant group. This in turn comes after the former insurgent commander had publicly disavowed ties to al-Shabaab, renounced violence, and fully took part in the post-conflict reconstruction process. The federal government also uses the opportunity to reiterate its offer of amnesty to all al-Shabaab leaders and fighters who follow suit and join the peace process.\nMarch 10\n*Somali government forces attack an al-Shabaab custom duty in Masajid Ali Gudud. The village is situated in the Middle Shabelle province, a few kilometers away from Adale. According to a Somali National Army commander, the raid was scheduled, but he does not specify whether state troops seized control of the militant base. Three insurgents are killed.\n*Somali government forces apprehend four foreign al-Shabaab recruits attempting to sneak into the militant group's bases in Dhobley in the Lower Jubba province. According to the local Somali National Army commander Haybe Ahmed Abdullahi, the captured fighters include two Kenyans and two Tanzanians, who were holding documents indicating that they were heading toward al-Shabaab-held areas. Two Somali insurgents are also stopped.\nMarch 11\n*Somali Armed Forces launch door-to-door search operations in residential areas in Baladwein. The security sweep comes a week after the murder of local elder Ahmed Adan Siyar, one of several assassinated traditional elders and politicians. The military, police and other forces are also patrolling the town's main streets.\nMarch 12\n*Al-Shabaab militants attack the official residence and headquarters of South West State President Sharif Hassan Sheikh Adan in Baidoa. According to witnesses, the skirmish begins when insurgents blow up a vehicle outside the house, which then ignites a gunfight with security forces. Regional police commissioner Colonel Mahad Abdiraham reports that eight of the insurgents are killed, as well as three Somali government soldiers and one troop serving in the Ethiopian AMISOM contingent. Three individuals are also injured, but Aden is unharmed. Pro-Al-Shabaab websites subsequently claim responsibility for the raid. Minister for Security of the South West State Abdifatah Geesey later announces that his administration had received a tip that a vehicle containing a bomb was attempting to make its way to the regional presidential palace. The explosives went off just as the security forces reached the car. A public tip-off subsequently led the police to one of the attackers, who was hiding out in the local ADC grocery store. The man was then apprehended and taken to the central police station for questioning.\n*Somali government forces and AMISOM troops engage in a skirmish with al-Shabaab militants in a village between Ceelbuur and Dhusamareb in the south-central Galgudud province. The gunfight begins when the insurgents attempt to waylay an allied convoy carrying inmates from Ceelbuur. According to a senior Somali National Army officer stationed in Dhusamareb, the joint forces subsequently repel the insurgents. Casualties are uncertain. The state forces and AMISOM troops also indicate that they incinerated an al-Shabaab battle-wagon.\n*Somali National Army officials based in the southwestern Gedo province announce that SNA and AMISOM troops are advancing towards al-Shabaab's base in Baardhere. According to SNA Col. Khalif Noor Xirey, seizing Baardhere will greatly facilitate the capture of the last remaining insurgent-held areas.\n*A US drone strike near Abu-Halul reportedly kills two senior al-Shabaab commanders. The militants were traveling in a vehicle on the outskirts of the village, which is situated between Bardere and Dinsoor. The identity of the two insurgent leaders is uncertain, as they were incinerated in the blast. However, one of the men is believed to be Aden Garaar, the head of external operations of al-Shabaab. No party has claimed responsibility for the airstrike. Additionally, neither the Somali federal government nor al-Shabaab issue a statement on the raid. Unnamed U.S. officials later confirm that Garaar was targeted and killed in the airstrike, which was carried out by a Predator unmanned aerial vehicle using Hellfire missiles. The slain militant commander had reportedly orchestrated the 2013 Westgate shopping mall attack in Nairobi. The Pentagon subsequently also confirms that Garaar has been killed in the airstrike.\nMarch 13\n*Somali National Army forces and al-Shabaab militants engage in a skirmish on the perimeter of Bur-Dubo. The rebels reportedly waylaid a Somali military convoy as it was moving towards the Gedo province town. According to army officials, the state forces managed to repel the insurgents during the armed attack, which lasted several hours. Military officer Osman Nooh Haji indicates that army soldiers in the process killed three al-Shabaab members, including local commander Mohamed Musa. The militant group does not issue a statement on the raid.\nMarch 14\n*Somali government forces engage in a skirmish with al-Shabaab fighters on the outskirts of Jalalaqsi. According to Somali National Army Col. Omar Hassan Omar, the state troops managed to defeat the rebels, killing seven militants and wounding 15 others. He adds that the gunfight began when the insurgents attacked the area. Al-Shabaab does not issue a statement on the raid.\n*National Intelligence and Security Agency spokesperson Qasim Ahmed Roble announces that Somali government forces have captured four suspected al-Shabaab insurgents. The men reportedly shot at state forces during a security sweep in Mogadishu the day before. According to Roble, one of the suspects was in his early 60s, whereas the average al-Shabaab members tend to be young males.\nMarch 15\n*Interim Juba Administration forces launch a large security operation in Kismayo and environs. According to the local commander, the sweep is meant to strengthen safety in the IJA's administrative capital. An unspecified number of al-Shabaab militants are concurrently arrested. Additionally, security forces control the flow of passenger and vehicle traffic as they patrol the city's roads.\nMarch 16\n*A court in the northeastern Puntland regional state sentences three alleged al-Shabaab members to death. According to the Puntland Ministry of Security, the three fighters, Mohamed Abdi Ahmed, Hajow Shiekh Noor Osman and Ismail Abdulkadir Jama’a, are later executed. They are among several al-Shabaab militants sentenced to death in the wake of the Galgala campaign by Puntland security forces against the insurgent group.\n*Kenyan fighter jets reportedly launch airstrikes against an al-Shabaab base close to Bardere in southern Somalia. The attack follows recommendations by Aden Duale, the Majority Leader of the National Assembly of Kenya, to negotiate with the militant group. The legislator later recants the suggestions. Casualties sustained during the aerial raid are uncertain.\nMarch 17\n*Unidentified gunmen kill Muslim cleric Elmi Abdi Hassan Rooble in Baladwein. The Qur'an instructor was reportedly returning from a local mosque after the Isha prayer. Hiran region spokesman Hassan Mohamed Ibrahim later announces that his administration has apprehended several suspects in connection with the shooting. He also sends his condolences to the family of the slain cleric. Additionally, Ibrahim indicates that no security roadblocks have been set up in the area.\n*Somali National Army launch a large security sweep in Leego. According to the local district officer Abuukar Abdullahi Isack, the operation was prompted by complaints of gunmen holding up residents in the area. He adds that no individuals have yet been apprehended, and that state troops are pursuing anti-peace elements in the locality.\nMarch 18\n*Residents in the Tiyeglow district of the Bakool province engage in a skirmish with al-Shabaab militants. According to the local Mayor Mohamed Abdullahi, the gunfight began after the insurgents descended upon the area and attempted to forcibly collect livestock taxes from the community. The locals subsequently took up arms in self-defense. Abdullahi indicates that casualties include one fatality and several injured individuals. He also vows to help the residents repel the militant group.\nMarch 20\n*Somali National Army forces and AMISOM troops are attacked by al-Shabaab fighters as they are marching toward the militant group's base in Bardere. The joint forces manage to repel the insurgents. According to SNA commander in Bur-Dubo town Osman Noah Haji, the SNA and AMISOM troops are likely to easily capture Bardere since the militant group's strength has been sapped following successive battle losses and the assassination of several of its leaders by US unmanned aerial vehicles. He adds that the forces aim to seize the remaining areas under insurgent control as soon as possible.\nMarch 21\n*Somali National Army forces and AMISOM troops launch a security sweep in the Bulo Burde district to clear an al-Shabaab blockade in the area. The cleanup operation commences in Baladweyne, with the joint forces removing militants from settlements on both sides of the main road leading towards the district center. Casualties include around five SNA troops and one AMISOM soldier. Local officials do not issue a statement pending arrival at Bulo Burde.\nMarch 22\n*Interim Juba Administration forces assisted by AMISOM troops recapture Kudha Island from al-Shabaab. The strategic Lower Shabelle province island had been under insurgent control for a few months. The joint forces were approaching the area over the past 24 hours. According to a Jubaland forces commander, the militants vacated the island before their arrival. No fighting or casualties are reported. The raid is part of a broader security sweep by IJA and AMISOM forces in the Jubba region, with the aim of seizing the remaining areas held by the insurgents.\nMarch 23\n*The Leego administration announces that it has apprehended several individuals that are believed to have robbed passengers on the road between Mogadishu and Baidoa. According to the local commissioner Abukar Abdullahi Isak, the move represents a significant accomplishment given challenges in security by the al-Shabaab militant group. The suspects are now expected to appear in court, helping to further stabilize liberated areas. Isak adds that the road is once again safe for public use.\nMarch 24\n*According to local residents, AMISOM troops vacate Awdhegle and Bariire villages at night. The forces reportedly leave in convoys, taking their fixed heavy equipment with them. No reason for the withdrawal is provided. The two Lower Shabelle localities had been liberated by Somali National Army and AMISOM forces, with SNA troops still stationed in the towns.\n*Somali National Army forces and AMISOM troops launch a large security sweep in Jowhar. The government forces consist of SNA, security and police officials, who conduct door-to-door inspections over several hours in Hanti-Wadaad and other suburbs in the town. The troops also control vehicular and pedestrian traffic. According to the commander of government forces in the Middle Shabelle province Abdiweli Ibrahim, the operation aims to strengthen local security. It is the first such sweep in the area by state forces since they evicted al-Shabaab militants.\nMarch 26\n*Interim Juba Administration forces and AMISOM troops deploy soldiers against al-Shabaab in Kulbiyow and other new fronts in the Lower Shabelle province. Since losing Kudha Island, the militants have been hiding out in the Badamadow forest area. According to local commissioner Mohamed Ismael, the joint forces are aiming to dislodge the insurgents from Kulbiyow and other parts of the countryside.\nMarch 27\n*Police launch a counter-terrorism sweep in Mogadishu. According to Interior Security Ministry spokesman Mohamed Yusuf, the security forces in the process find an arms cache in a pit at a Daynile district residence. The officers also arrest several al-Shabaab suspects. Additionally, police stop a vehicle during a parallel raid, confiscate explosive devices and other weapons found in it, and apprehend the car's driver. The sweeps are among several operations in the city aimed at firming up on security.\n*Al-Shabaab insurgents attack the Hotel Maka Al Mukaram in Mogadishu. After a car laden with explosives detonates, five armed militants penetrate the grounds. The blast shatters the mirrors inside the hotel. A number of government officials are at the time staying at the establishment, which is also patronized by foreigners. Security agents with the National Intelligence and Security Agency's elite Gaashaan unit subsequently storm the hotel and begin engaging the militants. The siege lasts four hours. According to the Minister of Information Mohamed Abdi, four of the gunmen are killed, including the suicide car bomber. Four government soldiers, four hotel guards and five civilians are also slain, as well as Ambassador of Somalia to the UN Human Rights Office in Geneva Yusuf Mohamed Ismail. Injuries include around 20 wounded soldiers, state officials and hotel personnel. The security forces also succeed in rescuing over 50 hotel guests, including Somalia's Ambassador to Germany Mohamed Tifow, who was saved by ladder. The hotel's owner Gurey Abdi Hassan partly blames Hodan district officials and state forces for the attack. He indicates that the local Hodan district commissioner had ignored his request to set up a security checkpoint in the hotel's rear, while simultaneously providing lax security despite the premises having been attacked three times before. Al-Shabaab concurrently claims responsibility for the raid, with the group's spokesman Sheikh Ali Mahamud Rage emailing that some militants had survived the attack and escaped the scene. Al Shabaab's military operations spokesman Abdiasis Abu Musab also indicates that the insurgents were targeting government officials only and had left civilians unharmed. Government forces display the bodies of the slain militants at a press gathering, deeming the counter-terrorist operation a success. Additionally, President of Somalia Hassan Sheikh Mohamud commends the security forces for their competence, describes the attack as futile and spineless, and vows to continue the ongoing reconstruction and development process unimpeded. He also instructs the national security agencies to immediately launch a probe into the attack. President of the Puntland regional state Abdiweli Mohamed Ali likewise sends his condolences to the slain diplomat's family, and wishes the injured parties a rapid recovery. AMISOM also issues a statement condemning the raid. Government forces and AMISOM troops subsequently cordon off roads flanking the hotel.\nMarch 29\n*A remote-controlled bomb targets an AMISOM convoy in the Merca suburbs. AMISOM troops subsequently open fire, killing two pedestrians. No one is apprehended for the attack, as AMISOM forces are reportedly in pursuit of the attackers. AMISOM also does not specify the number of casualties, nor does it issue a statement on the bomb attempt.\nMarch 30\n*Senior al-Shabaab officer Bashaan Ali Hassan (\"Mohamed Ali\") turns himself in to Somali National Army officials in Hudur. According to local residents, the militant leader had served in the insurgent group's Bakool and Lower Shabelle province contingents. SNA commander in Bakool Abdirahman Mohamed Osman \"Tima-Adde\" indicates that the government forces are conducting a probe to ascertain the circumstances surrounding Hassan's surrender. He also hails the defection as a major setback for al-Shabaab and its leadership.\nMarch 31\n*Somali National Army forces and AMISOM troops apprehend 15 suspected gunmen between Leego and Burhakabo. A few of the suspects are subsequently transferred to Mogadishu, where the circumstances surrounding their arrest will be further probed. According to the Leego commissioner Abukar Abdulahi Isak, three additional suspects were shot dead after trying to get away. The sweep by the security forces  is intended to quell attacks on army installations and public transport by gunmen in Lower Shabelle.\nApril\nApril 2\n*The Federal Cabinet passes a new anti-terrorism law. The bill was originally formulated by the Ministry of National Security, and aims to empower the national security agencies to efficaciously handle anti-peace elements. It is now slated for deliberation and approval in the Federal Parliament.\nApril 5\n*Somali National Army forces assisted by AMISOM troops launch a large security sweep in the El-Bur district. According to the SNA commander in the Galgaduud province Mohamed Kariye Dhagadhere, the operation is intended to strengthen security in the district. It is part of a larger clampdown on criminal elements in the area. The joint forces in the process capture several suspects during door-to-door searches. Additionally, the commander urges residents to cooperate with the authorities to firm up on safety, and notes that security in the province has considerably ameliorated.\n*Alleged al-Shabaab militants attack two security checkpoints in Bosaso. They also raid the residence of the Armo district commissioner Mohamed Ali Shire. One of the official's bodyguards is killed in the ensuing shootout. Shire survives, but sustains gunshot wounds to his upper body. Total casualties are uncertain, and no party claims responsibility for the attacks. The Puntland authorities also do not issue a statement on the raids.\n*A roadside bomb targets the convoy of the Deputy Governor of the Mudug province Ahmed Muse Noor in the Garsoor suburb of Galkayo. The official is reportedly unharmed. At least six individuals are wounded, mainly pedestrians. Security forces subsequently cordon off the area and begin pursuing the perpetrators. No one is as yet apprehended for the landmine, nor does any party claim responsibility. The Puntland administration also does not issue a statement on the blast.\nApril 6\n*Kenyan jets launch airstrikes against two al-Shabaab bases in the southwestern Gedo province of Somalia. According to the Kenya Defence Forces spokesman David Obonyo, the warplanes have demolished the camps. Al-Shabaab military operations spokesman Sheikh Abdiasis Abu Musab denies that the bases are struck, and asserts that the missiles instead hit farmland.\n*A Somali military court sentences to death two suspected al-Shabaab operatives, Shucayb Ibrahim Mahdi (aged 27) and Farah Ali Abdi (aged 30). The men are accused of having assassinated several federal legislators, including Saado Ali Warsame, Adan Mohamed Ali (Sheikh Adan Madeer), and Mohamed Mahamud Hayd, as well as security officer Ahmed Odawaa. According to the court's chairman Hassan Ali Shuute, the alleged militants are to be executed by firing squad.\nApril 7\n*Government forces launch a major security operation in Jalalaqsi in the Hiran province. The sweep is prompted by intelligence received by the Somali National Army and AMISOM. According to SNA commander Omar Mohamed Kunteenar, the government forces have in the process apprehended five key al-Shabaab suspects, two of whom are carrying weapons. He adds that the security forces are honing in on several other suspects, and are scheduled to dismantle sleeping militant cells operating in the district.\nApril 10\n*Al-Shabaab militants reportedly behead two individuals in Abaq-Beeday, situated 18&nbsp;km east of Hudur. The Hudur administration indicates that the slain pair were well known locally, and that the insurgents tied their hands prior to the execution. According to Hudur deputy district commissioner Mustaf Adan Hussein, government forces have arrived at the locality and are in pursuit of the culprits.\n*The Federal Government of Somalia offers a $250,000 reward for the capture of al-Shabaab commander Ahmed Diriye. It also places bounties of between $100,000 to $150,000 for information on the whereabouts or leading to the arrest of several other of the militant group's leaders, including Mahad Warsame Galay (Mahad Karate), Ali Mohamed Raage (Ali Dhere), Abdullahi Abdi (Daud Suheyb), Mohamed Mohamud Noor \"Sultan\", Ali Mohamed Hussein (Ali Jeesto), Mohamed Mohamud (Gama-Dhere), Hassan Mohamed Afgoye, Mohamed Abdi Muse Mohamed, Yasin Osman Kilwa and Abdullahi Osman. Additionally, the federal government indicates that any leads forwarded to it vis-a-vis the wanted insurgent commanders will be kept strictly confidential.\nApril 11\n*Police apprehend nine suspected al-Shabaab insurgents in Bakara market in Mogadishu and in Kismayo. The security forces had been trailing the suspects for almost a month. While the police do not specify the identities of the alleged militants, they assert that the individuals were senior al-Shabaab insurgents. According to Security Ministry spokesman Mohamed Yusuf, the suspects were found hiding in two hotels in the Mogadishu market and in a hotel in Kismayo. The police subsequently close down the hotels for assisting criminal elements. Yusuf also indicates that hotel owners in the capital were warned that their establishments would be shut down and they would be charged under the law if they employ or give succor to purported al-Shabaab members.\n*Suspected al-Shabaab militants attack the residence of Lower Shabelle province Governor Abdikadir Mohamed Noor \"Sidii\". According to the official, the skirmish began after his bodyguards finished patrolling at midnight. He indicates that the gunmen were led by a commander from Morocco, and that they arrived from Fon-Buraale village, situated between Kuntuwaaray and Qoryooley. The governor also asserts that casualties include five al-Shabaab insurgents, one of his security detail, five wounded bodyguards, and seven injured militants. Additionally, he outlines his administration's counterinsurgency operations, and indicates that the majority of al-Shabaab leaders stationed in the province have been killed.\nApril 14\n*A suicide car bomb detonates at the gate of the Ministry of Higher Education and Ministry of Petroleum and Resources building in Mogadishu. Armed insurgents in military fatigues then penetrate the premises. However, no senior government officials are on the grounds. According to witnesses, there are between two or three gunmen, who are armed with light and heavy weapons and have on suicide vests. Special Forces units arrive at the area shortly afterwards, and quickly recapture control of the compound after a brief exchange in gunfire with the militants. Interior Minister Abdirizak Omar indicates that the security forces also rescued dozens of individuals. A federal government spokesman states that casualties include seven al-Shabaab militants, eight pedestrians and two soldiers. Around 15 people are also wounded and are taken to the hospital for treatment. Al-Shabaab claims responsibility for the attack.\nApril 15\n*The Somali military court in Mogadishu sentences 7 suspected al-Shabaab members to 10 years imprisonment. The men are alleged to have ties with the group, including providing its militants with protection and hiding places as well as offering intelligence. A military court spokesman also indicates that the suspects may appeal the verdict once it is announced.\nApril 16\n*Mareeray chief Sayid Baale Mayaw announces that government forces have launched a security operation in the locality. According to the official, the sweep is intended to remove illegal road barriers, which some gunmen had erected in the area in order to extort funds from public vehicles and passengers. He indicates that the operation concluded successfully, with several of the militants arrested.\nApril 18\n*Unknown gunmen kill Puntland MP Adan Hajji Hussein Ismail (Adan Yare) at the Taleh junction in the Howl-wadag district of Mogadishu. The legislator was reportedly in the city to seek treatment for his ailing wife. According to witnesses, Ismail was driving to his residence when the shooters, who were traveling behind him in a car, opened fire on his vehicle. The attackers leave the scene shortly before security forces reached the area. The Puntland administration does not yet issued a statement on the shooting. Al-Shabaab later claims responsibility for the attack. Ismail is subsequently laid to rest at the Madina hospital in the capital, with his funeral attended by well-wishing federal government officials, cabinet members and legislators.\n*Somali government forces and AMISOM troops launch a security sweep in Bullo-Burde and environs. According to local commanders, the cleanup operation is aimed at firming up on security in the area. It comes after al-Shabaab militants blockaded the primary commercial routes between Bullo-Burde, Jalalaqsi and other towns in the Hiran province. Arrests if any are unspecified. The sweep is among several broader security maneuvers by the joint forces.\nApril 19\n*Al-Shabaab insurgents attack Kenyan AMISOM troops in the southern Delbio area of Somalia. The insurgents reportedly shoot at the Kenyan soldiers' vehicle, with a gunfight ensuing. AMISOM fatalities include three dead troops. Officials indicate that eight wounded AMISOM soldiers are also being transported to Nairobi for treatment. The militants reportedly retreat into the forest.\n*Al-Shabaab attack AMISOM troops that are garrisoned between Lego and Balidogle. According to AMISOM Colonel Paul Njuguna, three soldiers are killed in the ensuing skirmish. He adds that the Somali National Army and AMISOM are endeavoring to liberate the remaining areas under insurgent control, with al-Shabaab in a much weaker state than only two years prior.\nApril 20\n*Militants plant a bomb in a UN van in the northeastern city of Garowe. According to police Colonel Ali Salad, at least seven workers are killed in the ensuing blast. Four individuals are also injured. Police officer Yusuf Ali indicates that the explosive devise was lodged under a seat in the vehicle and detonated via remote control. Al-Shabaab later claims responsibility for the attack through its radio station. The Puntland administration subsequently appoints a five-member governmental committee to probe the circumstances surrounding the attack.\nApril 21\n*An explosive laden vehicle detonates near the Banoda restaurant in Mogadishu. Casualties reportedly include at least three individuals, with seven others injured during the last. Ambulances ferry the wounded to the hospital. No group claims responsibility for the explosion.\nApril 22\n*Somali government forces and AMISOM troops launch a large security sweep in the Bullo-Burde area. According to local army commander Mohamed Ibrahim Baakay, the operation is aimed at tightening safety in the broader district, which has already considerably improved. He also indicates that 20 al-Shabaab suspects have been arrested, and that the authorities are slated to probe the security situation shortly.\nApril 23\n*Insurgents kill senior military officer Major Sabriye in Mogadishu. According to army official Colonel Abdullahi Hussein, the officer died from several gunshot wounds to the chest area. He also indicates that the gunmen escaped. Al-Shabaab military spokesman Sheikh Abdiasis Abu Musab later claims that his insurgent group was responsible for the shooting.\nApril 25\n*Gunmen shoot down former federal legislator Hai Ali Aden Abdulle \"Fartag\" in Mogadishu's Bakara market. The attackers had reportedly trailed the MP before killing him and absconding. No party claims responsibility for the attack. Security forces later launch operations in pursuit of the culprits.\nApril 26\n*Unknown gunmen shoot a Somali Custodial Corps officer at the KPP junction in Mogadishu's Hodan district. According to witnesses, the officer Abdullahi Kamaal Ismail was gunned down at close range. They also indicate that the shooters immediately absconded. No party claims responsibility for the attack.\nApril 28\n*A vehicle bomb targets local electricity company head Mohamed Abdirahman \"Dhabancad\" in Galkayo. The explosive device was planted under the former UNOCHA officer's car seat and was detonated via remote control. It goes off as he is exiting the car. The official is unharmed; two other individuals are wounded according to police. Al-Shabaab is suspected of being behind the bomb attempt, as it often targets electricity workers for installing bulbs throughout the city, which impede its nighttime attacks. No party officially claims responsibility for the blast.\nApril 30\n*Gunmen shoot down journalist Da'ud Ali Omar in Baidoa. The reporter had been working with Radio Baidoa at its Bay province main offices. The armed attackers reportedly killed him, his wife and neighbor while they were sleeping. No group claims responsibility for the shootings.\n*Somali government forces and al-Shabaab militants engage in a skirmish in Hudur district. According to the deputy district commissioner for security affairs Adan Abdi Abaaray, the state troops manage to flush out the insurgents from Mooragabay locality and environs. He also indicates that the government forces are now marching toward the remaining insurgent held areas situated at a 10&nbsp;km radius from Hudur town.\nMay\nMay 2\n*A military court tries several al-Shabaab suspects, sentencing alleged member Ahmed Aweys to death. Another suspected militant Abdi Ibrahim Mohamed is sentenced to 10 years imprisonment, and a third individual constable Mahat Ahmed is acquitted in absentia. Among the charges were membership in al-Shabaab, and harboring, protecting and offering information to the insurgents. According to the spokesman for the military court, more hearings of al-Shabaab suspects are scheduled in the offing.\nMay 3\n*Security forces in Mogadishu impound a car that was loaded with explosives. The vehicle is owned by a Somali National Army commander, who the bombing device was reportedly targeting. Whether any arrests are also made in connection with the assassination attempt is uncertain.\n*Somali National Army, security and police forces as well as AMISOM troops launch a large security sweep in Mogadishu. The house-to-house search operation is conducted in Howlwadag and Warta-Nabadda, among other districts. According to Ministry of Security spokesman Mohamed Yussuf Osman, the sweep is intended to quell anti-peace elements in the area. He indicates that the security forces subsequently arrest dozens of al-Shabaab suspects, whose culpability will be adjudicated. The official also urges residents to cooperate with the security forces.\nMay 4\n*Former senior Ahlu-Sunna Waljamaa official Mohamed Shidane Diriye is gunned down in Mogadishu. The man had at one time reportedly served as the group's head of security in the town of Dusamareb. According to witnesses, Diriye had returned from South Africa a few months earlier and was shot in front of his store in Bakara market. The gunmen abscond before police arrive. Although al-Shabaab is antagonistic toward Ahlu-Sunna Waljamaa, no group claims responsibility for the shooting.\n*According to Hudur deputy district commissioner Mustaf Adan Hussein, al-Shabaab militants kill two women and kidnap several others in the Baalo locality. He indicates that the insurgents also instruct the local residents to not inter the bodies. Al-Shabaab does not claim responsibility for the raid. Somali government forces subsequently arrive in the area to probe the circumstances surrounding the attack.\nMay 6\n*Wadajir deputy commissioner Abdifitah Gure is gunned down in Mogadishu. Gunmen spray his vehicle with bullets while he is making his way to his office in the Wadajir district. One of the official's staff members is also shot dead. No group claims responsibility for the shootings, but militants are suspected to be behind them.\nMay 7\n*Somali government forces assisted by AMISOM troops launch a security sweep in the Wadajir district in Mogadishu. The operation is district-wide, with soldiers carrying out house-to-house searches in pursuit of anti-peace elements. Several dozen youths are apprehended in connection with the killing of the district's deputy commissioner the day prior. According to the Wadajir district commissioner, the security situation is stable. He also urges residents to cooperate with the forces, and indicates that the security personnel are on guard to quell any threats to safety in the area.\n*Somali government forces and al-Shabaab militants engage in a skirmish in the Bulla-Burde district in Hiran province. According to local commander Colonel Abdirahman Abdi Mumin, the state troops launched an attack on Aboorey in order to expel insurgents from the area. The locality is situated around 47&nbsp;km to the east of the town of Bulla-Burde. Mumin also indicates that fatalities include two al-Shabaab fighters in addition to several wounded militants, with government troops sustaining few casualties. Al-Shabaab does not issue a statement on the raid. Additionally, the army commander vows to root out the remaining insurgents. SNA commander Colonel Abdullahi Barre Elmi later confirms that the government forces have seized the locality from al-Shabaab.\nMay 8\n*Somali government forces and al-Shabaab militants engage in a skirmish in the Hudur district. According to the local deputy district commissioner for security affairs Adan Abdi Abaaray, the state troops have captured the area from the insurgents. He indicates that they killed several of the anti-peace elements. The official also announces that the government forces are now heading toward other areas in the district to flush out the remaining militants.\n*Gunmen shoot down Puntland legislator Saed Nur Hussein in Galkayo. The attackers open fire on and throw hand grenades at the regional lawmaker's vehicle shortly after he leaves a local mosque following Maqrib prayers. Both the MP and his bodyguard are killed during the attack. Puntland security forces launch an immediate probe and arrest several hundred suspects in connection with the shooting. Al-Shabaab later claims responsibility for the attack on its affiliated Andalus media outlet. The late legislator is concurrently given a state funeral at the principal cemetery in Galkayo, with Puntland Vice President Abdihakim Abdullahi Haji Omar among other senior regional officials attending the ceremony.\nMay 10\n*Unidentified attackers hurl a hand grenade at an AMISOM convoy traveling close to the Marka police station. According to eyewitnesses, two pedestrians are wounded during the blast. AMISOM does not specify any additional casualties. The security forces subsequently block off the road and launch an operation in pursuit of the assailants, with business hubs and shops in the area closed down. No group claims responsibility for the explosion, but al-Shabaab is suspected of being behind it.\nMay 11\n*Somali government forces and al-Shabaab militants engage in a skirmish in Qasah-dhere. According to the Qasah-dhere district commissioner Adan Abdi, the fighting begins after the insurgents attack soldiers garrisoned in the town. The shootout lasts several hours, causing some infrastructural damage. Casualties include at least five individuals. The district official indicates that the Somali National Army troops manage to repel the insurgents. Al-Shabaab does not issue a statement on the raid.\n*Unknown gunmen shoot immigration department officer Abdullahi Mohamed Osoble from a vehicle stationed in Mogadishu's Hodan district. According to eyewitnesses, the shooters had snuck into the Siigaale neighborhood, where they launched their attack prior to the arrival of police. An individual close to the official indicates that he was rushed to the Madina Hospital, where he was treated for minor injuries. National Intelligence and Security Agency forces subsequently launch a door-to-door search operation in the Taleh, African-Village and al-Baraka areas where the culprits are believed to be hiding, and arrest several suspects. Al-Shabaab later claims responsibility for the attack.\n*Somali National Army forces and Djibouti AMISOM troops seize Burweyn from al-Shabaab. The locality is situated around 28&nbsp;km to the south of the town of Bulla-Burde. According to Section 10 SNA commander in the Hiraan province Osman Abdi Mumin, army forces capture the area following a brief skirmish with the militants. He also indicates that the soldiers have apprehended three suspected al-Shabaab insurgents. The militant group does not issue a statement on the raid.\nMay 12\n*Somali government forces and AMISOM troops launch a large security sweep in Baladwein. According to the Hiran province police commissioner Isack Ali Abdullahi, the operations are aimed at strengthening safety in the broader district during a local reconciliation conference. Soldiers are stationed on the main roads and are inspecting vehicles and pedestrians. The commissioner indicates that the security forces have arrested a number of al-Shabaab suspects, who are slated to be interrogated. He also urges residents to cooperate with the state troops.\nMay 13\n*Al-Shabaab operatives Shu’ayb Ibrahim Mahdi and Farah Ali Abdi, who were found guilty of assassinating five officials during the past Ramadan, are executed by firing squad. Among the slain legislators was the singer Saado Ali Warsame and the MPs Mohamud Hayd and Adan Mohamed Ali (Mader). According to military court chairman Hassan Ali Shuute, the two militants also killed intelligence officials Mohamed Ahmed Mohamed (Qaanuun) and Ahmed Odawa Balle.\n*Al-Shabaab capture 14 crew members of an Iranian fishing vessel that washes ashore in Yasin Maalin. According to a local resident, the Galgadud province town is a militant bastion. Iranian state television indicates that the boat had incurred a technical fault. Al-Shabaab does not claim responsibility for the seizure.\nMay 15\n*Al-Shabaab militants launch attacks against government garrisons in Aw-Dhegle and Makaraan, situated 75&nbsp;km west of Mogadishu. The heavily armed insurgents recapture both towns from the state troops during the skirmish, which lasts several hours. Casualties occur on both sides, with dozens of fighters, soldiers and civilians wounded. Al-Shabaab radio claims that its militants killed at least ten government troops and impounded battle wagons and ammunition. According to Lower Shabelle Governor Abdulkadir Mohamed Noor, government forces have been deployed to re-seize the area. Two hours later, Somali military forces recapture the towns from the insurgents.\nMay 16\n*Puntland forces launch a large security sweep in Bosaso. The door-to-door operation is conducted over all of the city's suburbs, with vehicles and popular locations inspected. Several suspects are apprehended and taken to the police stations for questioning. Further regional state forces are also deployed in Garowe to strengthen security.\nMay 17\n*A suspected US unmanned aerial vehicle crashes in Kula-Rooble locality, situated on the outskirts of Buur-Hakaba town. Local residents report that al-Shabaab insurgents have descended on the broader district and cordoned off the area. A commander of the group also confirms on the pro-militant Andalus radio that its fighters have seized the fallen drone. Additionally, Buur-Hakaba deputy district commissioner Hussein Mohamed indicates that the drone had been reconnoitering. The crash is reportedly caused by mechanical issues.\nMay 18\n*A landmine targets a convoy transporting South West State President Sharif Hassan Sheikh Adan in the Lower Shabelle province. The vehicles are traveling between Afgoye and Arbiska localities, en route to a Mogadishu function. Presidential spokesman Abdikadir Mohamed Ashara (Nadarta) indicates that Adan is unharmed. The blast comes around a week after the regional president announced that he would relaunch the local Airport 50, which had been shut down for a few years. No party claims responsibility for the blast, but it fits al-Shabaab's modus operandi.\nMay 19\n*Gunmen kill a senior Somali army official in Beledweyne. The officer is identified as Nur Adde, a colonel. According to Hiraan province police official Aden Hussein, the shooters shot the commander at his residence. Al-Shabaab claims responsibility for the shooting through an affiliated website and radio station.\nMay 21\n*Two pistol-wielding gunmen kill elder Mohamoud Hassan Dhogor in Kismayo. The man dies instantly from the wounds. He had previously participated in local reconciliation initiatives. Jubaland forces subsequently launch a security sweep in pursuit of the culprits, who absconded.\nMay 23\n*Gunmen shoot legislators Yussuf Mohamed Dirir and Abdalla Boos Ahmaed in Mogadishu, as well as a government worker and civilian in Wadajir district. Dirir later dies from his wounds, but Ahmaed is unharmed. No group claims responsibility for the shootings.\n*Al-Shabaab fighters attack Somali government forces garrisoned in Aw-Dhegle and Mubarak towns. According to Aw-Dheegle district commissioner Mohamed Aweys Abukar, the army troops manage to repel the insurgents after several hours of gunfire exchange. He also indicates that casualties total 26 militants and 19 soldiers, with some fighters also wounded. Al-Shabaab claims responsibility for the raid and asserts that its militants killed 25 soldiers.\n*Somali government forces and AMISOM troops launch a large security sweep in Mahas. According to local commander Mohamed Mumin Saney, the forces apprehended several al-Shabaab suspects, who he indicates would be interrogated. He also urges residents to cooperate with the security forces. The operation is part of a broader security sweep in the district.\nJune\nJune 26\n* 2015 Leego attack,  Al Shabaab militants attack an African Union base in the Leego district of Somalia and kills more than 70 AMISOM soldiers and seizes control of their military base.\nJune 28\n* Somali and AMISOM troops reportedly retook the base and town of Leego while al-Shabab retreated and offered no resistance to them but not before beheading the local Deputy District commissioner among the captives they took.\nJuly\nJuly 26\n* The Jazeera Palace Hotel in Mogadishu, situated close to the airport, is struck by a car bomb; at least fifteen people are confirmed killed in the blast. The hotel is popular with foreign diplomats, and was allegedly targeted in response to recent military operations by the government and AMISOM. Al-Shabaab has claimed responsibility for the attack.\nAugust\nAugust 22\n* In Kismayo, a car bomb targeting a military training ground exploded; al-Shabaab claims responsibility for the deaths of over a hundred soldiers in the attack, but Somali National Army officials confirmed the deaths of fourteen soldiers, with an additional nine wounded. Two al-Shabaab militants are killed and two more arrested in response to the attack. Later, four civilians die in an attack on a bus station in Mogadishu; al-Shabaab also claims responsibility for this attack, bringing the total number of fatalities to eighteen.\nSeptember\nSeptember 1\n* Between 20 and 50 AMISOM peacekeepers are killed after the Janale base, 90&nbsp;km (55 miles) south-east of the capital, is overrun by al-Shabab militants. After bombing a bridge to eliminate a potential escape route and breaching the gate with a car bomb, al-Shabab militants were able to enter and take over the base. AMISOM peacekeepers were stated to have withdrawn. After looting the base of weaponry, the militants withdrew and AMISOM troops were seen retaking the area. There have also been reports of troops taken captive during the assault.\nSeptember 18\n* Al-Shabaab launched an offensive operation against AMISOM positions in the Lower Shabelle region, overrunning the garrisons in the towns of Yaqbariweyne and Janele and ultimately taking both cities; al-Shabaab claimed responsibility for the deaths of thirteen soldiers, but AMISOM spokesmen claimed only seven died and an additional five were wounded. The AMISOM forces are said to have retreated to the outskirts and insist the loss of both towns is strategically insignificant to their efforts in diminishing al-Shabaab's influence on the region. However, the situation in Lower Shabelle, which stretches to the south of Mogadishu, remains unstable.\nSeptember 21\n* A car bomb is detonated on the grounds of the Somali Presidential Palace in Mogadishu, killing eleven people, including two diplomats, two soldiers, and the bomber, and injuring 22 other victims. The blast destroyed several other vehicles as well as the palace gates. Somali Army officials speculate that the intended target may have been the departing UN convoy or the diplomats as they were exiting the compound. Al-Shabaab claimed responsibility for the attack, and three foreigners, among them two Polish citizens were confirmed to be among the victims. Among the victims was Abdulcadir Gabeire Farah, a Polish-Somali social activist and historian, who had returned to his native country to campaign for President of Somalia in the forthcoming 2016 presidential election. A delegation from the United Nations, which had arrived at the presidential palace, escaped the attack unharmed.\nOctober\nOctober 21\n* AMISOM forces reported that they recaptured the Islamist-held town of Wabho in Central Somalia. According to military officials, al-Shabaab abandoned the town and AMISOM and pro-government forces moved in unopposed.\nOctober 25\n* Kenyan Defense Forces launched a raid against the al-Shabaab stronghold of Yantooy near the Jubba River as part of Operation Jubba Corridor. During the raid, Kenyan forces destroyed at least two boats used by al-Shabaab militants to infiltrate the Lower Shabelle region from Jilib, the organization's primary stronghold in the region. Kenyan spokesmen confirmed the deaths of at least fifteen al-Shabaab fighters during the battle, and are intent on resuming their advance towards Jilib in a bid to break the group's hold on the area.\nOctober 29\n* A Kenyan-registered Dornier DO-328 aircraft ferrying supplies for AMISOM out of Nairobi to Balidogle military airstrip outside Mogadishu crashed south of the capital city in the Afgoye district, with at least twelve crew members on board. Government officials in the Lower Shabelle region speculate that bad weather and strong winds were the likely cause of the crash. Somali National Army forces have been deployed to secure the crash site, but sources indicate that al-Shabaab has seized the site and taken the survivors hostage; the situation of the aircraft and of the crew remain unclear.\nOctober 31\n* Al-Shabaab militants besieged the Sahafi Hotel in Mogadishu, attacking the entrance with a suicide car bombing before armed gunmen stormed the building, which is a popular residence for government personnel. Somali government forces were deployed to retake the hotel from the militants; during this engagement, two more bombs detonated at separate instances, one believed to have been targeting incoming emergency responders. The Army forces eventually retook the building, with at least fifteen people confirmed dead, including civilians.\nNovember\nNovember 3\n* Al-Shabaab militants ambush government forces stationed in the town of Wanlaweyn in the Lower Shabelle region, outside Mogadishu. The Islamist militia claimed to have killed over thirty Somali soldiers, but army spokesmen confirmed the deaths of only fifteen soldiers as a result of the attack.\nDecember\nDecember 13\n* Pro-government Somali forces in the Jubba region successfully recaptured the village of Barwaaqo near the border with Kenya. The government says it has rooted out many Islamic militants with alleged ties to Islamic State after they had captured the area a week earlier. No reports on the casualties sustained on either side.\nSee also\n*Operation Indian Ocean\n*Somali Civil War (2009–present)\n*2009 timeline of the Somali Civil War\n*2010 timeline of the Somali Civil War\n*2011 timeline of the Somali Civil War\n*2012 timeline of the Somali Civil War\n*2013 timeline of the Somali Civil War\n*2014 timeline of the Somali Civil War\nReferences"
    }
  ]
}