{
  "content": [
    {
      "type": "text",
      "text": "# 2015 Evening Standard Theatre Awards\n\nThe '61st Evening Standard Theatre Awards' were awarded on Sunday 22 November 2015 at the Old Vic Theatre in London. Nominations were announced on 2 November 2015. The ceremony was presented by Rob Brydon and co-hosted by Evening Standard owner Evgeny Lebedev, Dame Judi Dench and Sir Ian McKellen.\nNon-competitive awards\nThe Lebedev award went to American composer and lyricist Stephen Sondheim.\nThe Editor’s award, awarded in partnership with The Ivy, went to Vanessa Redgrave.\nThe V&A’s exhibition Alexander McQueen: Savage Beauty won the Beyond Theatre award.\nWinners and nominees\n{| class=\"wikitable\"\n!width:50%;\"|Best Play\n!width:50%;\"|Best Musical\n|-\n|\n* The Motherfucker with the Hat '''by Stephen Adly Guirgis, National Theatre's Lyttelton'\n** Hangmen by Martin McDonagh, Royal Court Theatre\n** The Father by Florian Zeller, translated by Christopher Hampton, Ustinov Bath, Tricycle Theatre & Wyndham’s Theatre\n|\n* Kinky Boots, Adelphi Theatre\n** Assassins, Menier Chocolate Factory\n** Beautiful: The Carole King Musical, Aldwych Theatre\n** Bend It Like Beckham: The Musical, Phoenix Theatre\n** Gypsy, Savoy Theatre\n|-\n!width:50%;\"|Best Actor\n!width:50%;\"|Natasha Richardson Award for Best Actress\n|-\n|\n* James McAvoy', The Ruling Class, Trafalgar Studios'\n** Simon Russell Beale, Temple, Donmar Warehouse\n** Kenneth Cranham, The Father'', Ustinov Bath, Tricycle Theatre & Wyndham's Theatre\n** Ralph Fiennes, Man And Superman, National Theatre’s Lyttelton\n|\n* 'Nicole Kidman, Photograph 51, Noël Coward Theatre'\n** Denise Gough, People, Places and Things, National Theatre’s Dorfman\n** Gugu Mbatha-Raw, Nell Gwynn, Shakespeare’s Globe\n** Lia Williams, Oresteia, Almeida Theatre & Trafalgar Studios\n|-\n!width:50%;\"|Best Musical Performance\n!width:50%;\"|Milton Shulman Award for Best Director\n|-\n|\n* 'Imelda Staunton, Gypsy, Savoy Theatre'\n** Katie Brayben, Beautiful: The Carole King Musical, Aldwych Theatre\n** Rosalie Craig, City of Angels, Donmar Warehouse\n** Killian Donnelly, Kinky Boots, Adelphi Theatre\n|\n* 'Robert Icke, Oresteia, Almeida Theatre & Trafalgar Studios'\n** Jamie Lloyd, Assassins, Menier Chocolate Factory\n** Indhu Rubasingham, The Motherfucker with the Hat, National Theatre’s Lyttelton\n|-\n!width:50%;\"|Best Design\n!width:50%;\"|Charles Wintour Award for Most Promising Playwright\n|-\n|\n* Anna Fleischle', Hangmen, Royal Court Theatre'\n** Tim Hatley, Temple, Donmar Warehouse\n** Robert Jones, City of Angels, Donmar Warehouse\n|\n* 'Molly Davies, God Bless The Child, Royal Court Upstairs'\n** Alistair McDowall, Pomona, Orange Tree Theatre & National Theatre’s Temporary Space\n** Diana Nneka Atuona, Liberian Girl, Royal Court Upstairs (Peckham & Tottenham pop-up venues)\n|-\n!width:50%;\"|Emerging Talent Award\n!width:50%;\"|Newcomer in a Musical\n|-\n|\n* 'David Moorst, Violence And Son, Royal Court Upstairs'\n** Calvin Demba, The Red Lion, National Theatre’s Dorfman\n** Patsy Ferran, Treasure Island, National Theatre’s Olivier\n|\n* 'Gemma Arterton, Made in Dagenham, Adelphi Theatre'\n** Ellie Bamber, High Society, The Old Vic\n** Natalie Dew, Bend It Like Beckham: The Musical, Phoenix Theatre\n|}\n* The Best Musical award was awarded in partnership with BBC Radio 2 and voted for by the public.\n* The Emerging Talent Award was awarded in partnership with Burberry.\nSee also\n* 2015 Laurence Olivier Awards\nReferences"
    }
  ]
}