{
  "content": [
    {
      "type": "text",
      "text": "# 2015 FC Barcelona presidential election\n\n5 pp\n| image_size = 150x150px\n| image1 = Josep_Maria_Bartomeu_(cropped).jpg\n| candidate1 = Josep Maria Bartomeu\n| popular_vote1 = 25,823\n| percentage1 = 54.6%\n| image2 = Joan_Laporta_-_001.jpg\n| candidate2 = Joan Laporta\n| popular_vote2 = 15,615\n| percentage2 = 33.0%\n| image3 = Agustí Benedito.jpg\n| candidate3 = Agustí Benedito\n| popular_vote3 = 3,386\n| percentage3 = 7.1%\n| image4 = Toni Freixa.jpg\n| candidate4 = Toni Freixa\n| popular_vote4 = 1,750\n| percentage4 = 3.7%\n| title = President\n| before_election = Josep Maria Bartomeu\n| after_election = Josep Maria Bartomeu\n}}\nThe 2015 FC Barcelona presidential election was the thirteenth FC Barcelona presidential election, held on Saturday 18 July 2015. The interim president Josep Maria Bartomeu's candidacy got re-elected by defeating the three other main challengers: Joan Laporta, former President of the club, Toni Freixa, a former executive, and Agustí Benedito, an entrepreneur. The voters of the election were the 109,637 FC Barcelona socis (members) at the Camp Nou, who voted through a universal suffrage system and elected their new president for 6 years. The final turnout was 43.12%, a decrease of a 5% since the last election.\nElectoral calendar\nThe electoral calendar was the following:\n* 11 June: Election called\n* 24-26 June: Census collected\n* 29 June - 4 July: Candidacy announcements and signatures\n* 6-8 July: Proclamation of the valid candidacies\n* 9-16 July: Electoral campaign\n* 17 July: Election silence\n* 18 July: Election\nCandidacies\nThere were 7 pre-candidacies: Josep Maria Bartomeu, Agustí Benedito, Jordi Farré, Toni Freixa, Joan Laporta, Jordi Majó, and Joan Batiste. Even when the club has more than 140,000 members, the only people who could vote were the 109,637 members who had the age to do so. Each candidate had to get 2,534 butlletes de suport (support tickets) before 4 July. As the day arrived, Josep Maria Bartomeu, Joan Laporta, Toni Freixa and Agustí Benedito were able to collect the tickets, effectively making them formal and official candidates to the presidency.\nResults\nWith the final participation of 47,270 socis (43.12% of the census), Josep Maria Bartomeu got 25,823 votes (54.63%) and won the election, Joan Laporta got 15,615 votes (33.03%), and finally Agustí Benedito with 3,386 votes (7.16%) and Toni Freixa with 1,750 votes (3.70%).\nSee also\n* FC Barcelona\n* History of FC Barcelona\n* List of FC Barcelona presidents\n* La Liga\n* Football in Spain\nReferences"
    }
  ]
}