{
  "content": [
    {
      "type": "text",
      "text": "# 2015 SIU Edwardsville Cougars softball team\n\nThe 2015 SIU Edwardsville Cougars softball team represented Southern Illinois University Edwardsville (SIUE) during the 2015 NCAA Division I softball season. The Cougars, led by twenty-seventh year head coach Sandy Montgomery, played their home games at Cougar Field on the SIUE campus  as a member of the Ohio Valley Conference (OVC).\nPreseason\nEleven players returned from the 2013 squad that finished with a 30–23 overall record (19–5 in the OVC) and advanced to the NCAA tournament after winning the OVC championship. They were joined by four freshmen, a junior college All-American transfer, and a senior who was a member of the Cougars' OVC champion women's soccer team.\nThe Cougars were picked by the coaches and sports information directors of the Ohio Valley Conference to finish first in the conference.\nRegular season\nThe 2015 season cast the Cougars in the role of road warriors, with only 17 home games on their 55-game regular-season schedule.\nThe schedule opened with tournaments in Louisiana, Alabama, Georgia, and Florida and included 36 schools from 14 states and the District of Columbia. Although the early season schedule was not as grueling as 2014's, the Cougars faced four other teams that were in the 2014 NCAA tournament, including two that were ranked in the preseason Top 25.\nThe Cougars opened the season traveling to three weekend tournaments in the South. They started by winning the Lady Techster Invitational at Louisiana Tech with a 4–1 record. The following weekend, they went 3–1 and finished second to the 10th-ranked Bulldogs at their Georgia Softball Classic.  The third weekend took them to Auburn, Alabama for the Wilson/DeMarini Classic and another second-place finish behind the 16th-ranked host Auburn Tigers with a 3–2 record.\nFollowing a week off, the team went to Florida during break for five games at the USF Series - Under Armour Showcase and a pair of games in Fort Myers. After sweeping the games at Clearwater, the Cougars ran their win streak to seven games before falling at FGCU and finishing the pre-conference schedule with a record of 16–5. At this point, the first NCAA Rating Percentage Index (RPI) was issued, with the Cougars earning the number 32 ranking of the 295 Division I teams.\nOn March 20, Haley Chambers struck out 20 Morehead State batters en route to the second perfect game of her Cougar career. She became the first Cougar pitcher to toss two perfect games. It was the sixth SIUE perfect game and the program's 32nd no-hitter. The game was also her fourth no-hitter. Only current Cougar coach Sandy Montgomery has thrown more no-hit games, with six during her Cougar playing career, 1982–85. As a result, the junior not only was named the OVC Pitcher of the Week (her fourth of five awards for the season), but she was also named the Louisville Slugger/National Fastpitch Coaches Association (NFCA) Division I National Pitcher of the Week.\nOn April 16, Cougar pitcher Baylee Douglass was named as one of the twenty-five finalists for the NFCA Division I National Freshman of the Year Award. At the time, she had a 13–4 record with a 1.97 earned run average (ERA). She was also nationally ranked in several statistical categories: 12th in saves (4), 38th in walks allowed/seven innings (1.40), 61st in ERA (1.97), 61st in hits allowed/seven innings (5.41), and 73rd in strikeouts/seven innings (7.6). Douglass was the only OVC player to be named a finalist.\nThe Cougars clinched their first OVC regular season championship with a 7–2 win in the first game of the season's final series at Eastern Illinois on May 2. However, losses in five of their last ten games dropped the Cougars' RPI to number 50, essentially making it a near necessity that they win the OVC tournament, since the chance of an at-large bid was then problematic.\nHonors\nThe Ohio Valley Conference awards were announced at a banquet prior to the start of the league tournament. The Cougars team accepted the 2015 OVC softball regular-season championship trophy. Haley Chambers was named OVC Pitcher of the Year and a member of the All-OVC First Team. Rebecca Gray was also named to the All-OVC First Team. Baylee Douglas was named OVC Freshman of the Year and a member of both the All-OVC Second Team and the OVC All-Newcomer Team. Cougars head coach Sandy Montgomery was named the OVC Coach of the Year.\nPostseason\nThe Cougar hosted the Ohio Valley Conference softball tournament at Cougar Field beginning on Wednesday, May 6.\nIn the opening game, the Cougars came back from a 0–3 first inning deficit to defeat Morehead State 8–3 behind Haley Chambers' 10 strikeout three hit game. Chambers, Alex McDavid, and Jordan Lafave homered in the win.\nAs the visiting team on their own field (determined by coin flip), the Cougars again fell behind in the first inning of the second game, with an error allowing Tennessee Tech (the only OVC squad  they had not defeated) to take a 2–0 lead. The host team got one run back in the third, but gave up single runs in the fifth and sixth innings. Haley Chambers struck out nine, but allowed four runs (two earned) on four hits, while TTU pitcher Danielle Liberatore struck out 10, allowing only one run on six hits. The Cougars moved to the loser's bracket to face Eastern Illinois.\nAgain the visitors at home, the Cougars wasted no time in taking the lead on Eastern Illinois, getting four runs on three hits in the top of the first. They added three runs in the second, two in the third, and their tenth run in the fourth. Eastern managed to get on the board with a two-run homer in the fifth, but that was all, and the game ended at 10–2 in five innings with EIU eliminated from the tournament. The Cougars move on to play the winner of the Jacksonville State–Eastern Kentucky game, which was scheduled to be the last game of the day. A five-hour rain delay after the Cougars win would have moved the last game to a start time of around 9:39 PM, but the other two games both ran long, putting the start time after 10:PM, so the SIUE–Jacksonville State game was rescheduled for 10:00 AM on Saturday. For SIUE or JSU to win the tournament, either team would need to win three games on Saturday and one on Sunday.\nIn the first of a possible three Saturday games, the top-seeded Cougars went up on the second-seeded Jacksonville State Gamecocks 1–0 in the first. They added a second run in the third, then scored five in the fifth while Haley Chambers did not allow a hit until the fifth. Alex McDavid's fourth RBI of the game ran the score to 8–0 in the bottom of the sixth, ending the game on the mercy rule and advancing the Cougars to play the final elimination game against Murray State for the right to play Tennessee Tech in the Championship game(s).\nAfter another long rain delay, SIUE and Murray State played in a rare pitchers' duel in this high-scoring OVC tournament. Murray got on the board first with a single run in the third on a double, a wild pitch, and a sacrifice fly. The Cougars were held scoreless by CheyAnne Gaskey on only two hits through five innings before getting two runs on two hits and a Racers error in the top of the sixth to take the lead. Haley Chambers went 4 before giving way to Baylee Douglass, who got the win after 2 hitless innings. The Cougars earned a 45-minute break before again facing Tennessee Tech in the championship round.\nIn the championship, Baylee Douglass threw three hitless innings before giving up a homer, a walk, and a second homer to open the fourth, giving Tennessee Tech a 3–0 lead. Danielle Liberatore once more seemingly owned the Cougars, allowing only four hits until there were two out in the seventh, when the Cougars finally found their offense. Three singles cut the lead to one run with the tying and winning runs on base before Liberatore threw her ninth strikeout to win the game and the tournament for the Golden Eagles.\nCougar shortstop Alex McDavid, pitcher/designated player Haley Chambers, and second baseman Allison Smiley were named to the OVC All-Tournament Team.\nRoster\nBuff background indicates players returning from 2014.\n{| class=\"wikitable sortable\" style=\"font-size: 95%;width:65%\"\n|-\n| colspan=\"7\" style=\"background-color: #FF0000; color: #FFFFFF; text-align:center;\" | 2015 SIUE Cougars roster\n|-\n!#\n! Name\n! Position\n! Bats/Throws\n! Year\n! Hometown\n! High school\n|-\n| 0\n| Maria Prete\n| Infielder\n| R/R\n| Freshman\n| Westmont, IL\n| Westmont High School\n|- bgcolor=#FFF2E6\n| 2\n| Haley Chambers\n| Pitcher\n| L/L\n| Junior\n| Coatesville, IN\n| Cascade HS\n|- bgcolor=#FFF2E6\n| 3\n| Alex McDavid\n| Shortstop\n| R/R\n| Senior\n| Suwanee, GA\n| North Gwinnett HS\n|- bgcolor=#FFF2E6\n| 4\n| Alexis Kohrs\n| Pitcher\n| R/R\n| Sophomore\n| DuQuoin, IL\n| DuQuoin HS\n|- bgcolor=#FFF2E6\n| 5\n| Rebecca Gray\n| Outfielder\n| L/R\n| Senior\n| Crete, IL\n| Marian Catholic HS\n|- bgcolor=#FFF2E6\n| 6\n| Kelsey Hansen\n| Utility/Infield\n| R/R\n| Junior\n| East Peoria, IL\n| East Peoria Comm. HS\n|-\n| 7\n| Baylee Douglass\n| Pitcher\n| L/R\n| Freshman\n| Centralia, Missouri\n| Centralia HS\n|-\n| 8\n| Haley Adrian\n| Infielder\n| R/R\n| Freshman\n| Auburn, AL\n| Auburn HS\n|-\n| 9\n| Tess Eby\n| Catcher\n| R/R\n| Freshman\n| Grapevine, TX\n| Colleyville Heritage HS\n|- bgcolor=#FFF2E6\n| 11\n| Whitney Lanphier\n| Outfield/3rd Base\n| R/R\n| Junior\n| Plainfield, IL\n| Plainfield South HS\n|- bgcolor=#FFF2E6\n| 12\n| Rachel Keller\n| 1st Base\n| R/R\n| Junior\n| Bethalto, IL\n| Civic Memorial HS\n|- bgcolor=#FFF2E6\n| 13\n| Allison Smiley\n| 2nd Base\n| R/R\n| Sophomore\n| Johnston City, IL\n| Johnston City HS\n|- bgcolor=#FFF2E6\n| 22\n| Amy Hunt\n| Catcher\n| R/R\n| Sophomore\n| Troy, IL\n| Triad HS\n|- bgcolor=#FFF2E6\n| 23\n| Brittany Toney\n| Right Fielder\n| R/R\n| Senior\n| Hendersonville, TN\n| Goodpasture Christian School\n|-\n| 25\n| Allie Hill\n| Utility/Infielder\n| R/R\n| Junior\n| Bethalto, IL\n| Civic Memorial HS\n|- bgcolor=#FFF2E6\n| 26\n| Jordan LaFave\n| Outfielder\n| L/R\n| Junior\n| Valrico, FL\n| Durant HS\n|-\n|-\n| 31\n| Samantha Jones\n| Utility\n| R/R\n| Senior\n| Florissant, Missouri\n| McCluer North HS\n|-\n|}\nSchedule\n|-\n!colspan=9| Louisiana Tech's Lady Techster Invitational\n|-\n!colspan=9| Georgia Softball Classic\n|-\n!colspan=9| Auburn's Wilson/DeMarini Classic\n|-\n!colspan=9| USF Series - Under Armour Showcase\n|-\n!colspan=9|\n|-\n!colspan=9| 2015 Ohio Valley Conference softball tournament\nReferences"
    }
  ]
}