{
  "content": [
    {
      "type": "text",
      "text": "# 2016 Gambian presidential election\n\nPresidential elections were held in The Gambia on 1 December 2016. In a surprise result, opposition candidate Adama Barrow defeated long-term incumbent Yahya Jammeh. The election marked the first change of presidency in The Gambia since a military coup in 1994, and the first transfer of power by popular election since independence from the United Kingdom in 1965.\nOn 2 December, before the final results were announced, Jammeh graciously conceded defeat, shocking a populace that had expected him to retain power. BBC News called it \"one of the biggest election upsets West Africa has ever seen\". The final official results showed Barrow winning a 43.3% plurality, achieving a 3.7% margin of victory over Jammeh's 39.6%—with a third candidate, Mama Kandeh, receiving 17.1% of the votes. Following the election, 19 opposition prisoners were released, including Ousainou Darboe, the leader of Barrow's United Democratic Party (UDP). There was widespread celebration of the result by the opposition, along with some caution over whether the transition would proceed without incident.\nInitially, Jammeh conceded and congratulated Barrow. However, on 9 December Jammeh announced that he was rejecting the results and called for a new election, sparking a constitutional crisis. Troops were deployed in Banjul, the capital city, and Serekunda, the country's largest city. Jammeh's rejection of the results was condemned by several internal and external bodies, including the Gambia bar association, the Gambia teachers' union, the Gambia Press Union, the University of the Gambia, the Gambia medical association, the Economic Community of West African States (ECOWAS), the African Union (AU), and the United Nations Security Council (UNSC). The situation further escalated on 19 January, when Jammeh's term expired and Barrow was sworn in as president on Gambian soil at the embassy in Senegal. Despite extensive diplomatic efforts that included the personal involvement of several African heads of state, an\nECOWAS military intervention took place.\nFinally, on 21 January, Jammeh left the Gambia for an ECOWAS-arranged exile, allowing the transition of power to take place. According to the Senegalese government and the office of the United Nations High Commissioner for Refugees, during the dispute around 45,000 people fled to Senegal and at least another 800 people fled to Guinea-Bissau.\nBackground\nThe incumbent president, Yahya Jammeh, took power in a military coup in 1994 and remained the President through elections held in 1996, 2001, 2006 and 2011. The coup led by Jammeh unseated Dawda Jawara, who had led The Gambia since independence in 1965. The 22 years of Jammeh's presidency were characterised by suppression of dissent, restrictions of freedom of the press, and many allegations of human rights violations. Jammeh also claimed to have cured various diseases such as HIV/AIDS and cancer with herbs, cracked down on sorcery in the nation, and prosecuted acts of homosexuality. In 2011, he said that, God willing, he could \"rule for a billion years\".\nElectoral system\nThe President of the Gambia is elected in one round by plurality vote for a five-year term.\nInstead of using paper ballots, elections in the Gambia are conducted using marbles. Each voter receives a marble and places it in a tube on top of a sealed drum that corresponds to that voter's favoured candidate. The drums for different candidates are painted in different colours corresponding to the party affiliation of the candidate, and a picture of the candidate is affixed to their corresponding drum. The system has the advantages of low cost and simplicity, both for understanding how to vote and for counting the results. The method is reported to have an extremely low error rate for miscast ballots.\nCandidates and campaigns\nThe Independent Electoral Commission registered three political organisations and accepted their nominations for candidates:\n*The candidate for the Gambia Democratic Congress (GDC), Mama Kandeh, was accepted on 7 November 2016.\n*The candidate for Coalition 2016, Adama Barrow, was accepted on 10 November.\n*Incumbent President Yahya Jammeh representing the Alliance for Patriotic Reorientation and Reconstruction (APRC) was accepted on 10 November 2016.\nA Coalition of seven recognised opposition parties managed to unite and endorse Barrow as their preferred candidate, overcoming the fragmentation that could otherwise have led to Jammeh prevailing through the plurality voting system. The coalition included the United Democratic Party (UDP), the People's Democratic Organisation for Independence and Socialism (PDOIS), the National Reconciliation Party (NRP), the Gambia Moral Congress (GMC), the National Convention Party (NCP), the People's Progressive Party (PPP), and the Gambia Party for Democracy and Progress (GPDP). Barrow had been a member of the UDP and had previously served as its treasurer. To allow him to run as an independent candidate endorsed by the coalition rather than as a representative of the UDP, Barrow officially resigned from membership in the UDP prior to the election.\nTwo other political parties—the National Democratic Action Movement (NDAM) and the Gambia Democratic Party (GDP)—had been considered for recognition in the election, but were disqualified by the commission under the rules established for the election, which included residency requirements for the party officials, the establishment of offices in the seven administrative regions of The Gambia, and the submission of audited accounting records. The leader of the NDAM, Lamin Waa Juwara, also encouraged the formation of a coalition to unseat Jammeh.\nThe two-week period of the official election campaigns was peaceful, and it included many large rallies by both Jammeh's supporters and opposition parties.\nHowever, before the election, concerns had been raised about the government cracking down on the political opposition and using state resources and its domination of mass media to influence the outcome.\nPresident Jammeh had said that protests after the election would not be tolerated, saying \"In this country we don't allow demonstrations.\" Mobile messaging applications such as WhatsApp and Viber were blocked by Gambian authorities in the period before the election, and during the election, internet access and international phone calls were also blocked. International observers from the European Union and the Economic Community of West African States were banned from monitoring the election, but a few observers from the African Union were allowed access.\nAdama Barrow, a real estate businessman who had not previously held any political office, said that, if elected, he would set up a temporary transition government formed of members from the opposition coalition and would step down from the presidency within three years.\nBarrow referred to Jammeh as a \"soulless dictator\", and said that if elected, he would reverse some of Jammeh's key actions, including Jammeh's decisions for The Gambia to withdraw from the Commonwealth of Nations and from the jurisdiction of the International Criminal Court. He also said he would establish a two-term limit for the office of the presidency and conduct judicial reform, emphasising an independent judiciary. Barrow said he wanted to \"put aside all party, tribal, religious, gender and other differences\" to \"unify a divided nation\" and \"promote and consolidate Democracy, Rule of Law, Good Governance and respect for the Human Rights of our people\".\nThe only recognised opposition party not in the coalition, the Gambia Democratic Congress (GDC), fielded its own candidate—Mama Kandeh, a former deputy of the APRC ruling party who had been expelled by the APRC. The GDC was The Gambia's youngest political party. It was formed in the summer of 2016 by Kandeh along with some other former key members and supporters of the APRC. It had gained some popular support and was involved in some of the early discussions that led to the formation of the coalition, but the negotiations broke down about its position in the alliance and the attitude of some members of the other parties toward the GDC, so it did not join. Some members of other opposition groups accused the GDC and its backers of trying to divide the opposition voting constituency so that Jammeh would win.\nResults\nJammeh conceded to Barrow on 2 December before the results were released. Jammeh called and congratulated Barrow on his victory, saying \"you are elected president of The Gambia, and I wish you all the best\", and adding \"I have no ill will.\" He also proposed to arrange to meet with Barrow toward organising the transition process for his new presidency. On state television he said he would \"take the backseat\" and not contest the results, further saying \"I will help him work towards the transition.\" BBC News said the outcome was a \"huge surprise\", as most had expected Jammeh would do whatever was necessary to retain power.\nAfter the election commission released ballot results on 2 December, it reported modified results on 5 December, saying there had been an error in the counting. The modified results showed a smaller lead for Barrow (reducing the margin of victory from 8.8% to 3.7%) and a 9.1% lower number of total votes cast.\nBy constituency\n{|class=wikitable style=text-align:right\n!rowspan=3|Constituency\n!colspan=2|Adama BarrowCoalition 2016\n!colspan=2|Yahya JammehAPRC\n!colspan=2|Mama KandehGDC\n|-\n|bgcolor=#333333 colspan=2|\n|bgcolor=#009900 colspan=2|\n|bgcolor=#990099 colspan=2|\n|-\n!Votes\n!%\n!Votes\n!%\n!Votes\n!%\n|-\n|align=left|Banjul\n|style=\"background:#999999;\"| 6,639\n|style=\"background:#999999;\"| 50\n||5,704\n||42\n|| 1,028\n|| 8\n|-\n|align=left|Kanifing\n| style=\"background:#999999;\"| 56,107\n| style=\"background:#999999;\"| 50\n|| 44,873\n|| 40\n|| 11,127\n|| 10\n|-\n|align=left|West Coast\n||74,823\n||43\n|style=\"background:#9f9;\"| 76,880\n|style=\"background:#9f9;\"| 44\n|| 21,656\n|| 13\n|-\n|align=left|North Bank\n| style=\"background:#999999;\"| 23,346\n| style=\"background:#999999;\"| 37\n|| 18,316\n|| 29\n|| 22,039\n|| 34\n|-\n|align=left|Lower River\n| style=\"background:#999999;\"| 16,476\n| style=\"background:#999999;\"| 56\n|| 7,996\n|| 27\n|| 5,048\n|| 17\n|-\n|align=left|Central River\n||22,215\n||32\n|style=\"background:#9f9;\"| 30,228\n|style=\"background:#9f9;\"| 43\n|| 17,581\n|| 25\n|-\n|align=left|Upper River\n| style=\"background:#999999;\"| 28,102\n| style=\"background:#999999;\"| 44\n|| 24,490\n|| 38\n|| 11,289\n|| 18\n|-\n|align=left colspan=7|Source: [https://web.archive.org/web/20170620021703/http://iec.gm/download/presidential-election-results-1st-december-2016/#.pdf IEC]\n|}\nAftermath\nFollowing the announcement of the results of the elections, opposition supporters widely celebrated the surprise victory and were stunned by Jammeh's concession of defeat. Thousands of people celebrated in the streets of Banjul, the capital city.\nHowever, some expressed caution about what Jammeh might do next—suggesting that he could still try to retain power despite what had happened. A businessman said, \"I will only believe it when I see him leaving state house. He still controls the army, and his family are the top brass.\"\nThe fear that Jammeh would try to cling to power proved well-founded when, on 9 December, Jammeh appeared on Gambian state television and said he had \"decided to reject the outcome of the recent election\" due to \"serious and unacceptable abnormalities ... during the electoral process\". He declared that a new election must be held under \"a god-fearing and independent electoral commission\" and refused to leave office. Despite extensive diplomatic efforts that included several African heads of state, the situation further escalated until there was a military intervention by armed forces from several nearby ECOWAS countries that forced Jammeh to leave.\nOn 21 January 2017, Jammeh finally left the Gambia for an ECOWAS-arranged exile—initially in Guinea.\nReferences"
    }
  ]
}