{
  "content": [
    {
      "type": "text",
      "text": "# 2016 Woking Borough Council election\n\nThe 2016 Woking Borough Council election took place on 5 May 2016 to elect members of Woking Borough Council in England. This was on the same day as other elections across the UK and the Police and Crime Commissioner election for Surrey Police.\nBoundary changes had included a shrinking of the council from 36 councillors to 30 councillors, and all 30 council seats in the 10 new wards were up for election. In each ward, 3 candidates were elected, with the leading candidate in each ward being elected for 4 years, the second-placed candidate being elected for 3 years and the third-placed candidate being elected for 2 years. As a result, there will be no borough elections in 2017, but a third of the council will be due for re-election in each of 2018, 2019 and 2020.\nSummary\nPrior to this all-out election on new ward boundaries, the Conservatives had a strong majority on the council, with 24 seats compared to 9 for the Liberal Democrats, 2 Labour councillors, and one Independent.\nDespite remaining the largest party by a clear margin of 10 seats over their nearest rivals, the result was considered slightly disappointing for the Conservatives, who saw their council majority over all other parties reduced to four seats.\nIndependent candidates won all three seats in Byfleet, defeating sitting LibDem councillor and former Mayor Anne Roberts and the Conservative councillors Gary Elson and Richard Wilson. The Liberal Democrats won all three seats in the new Hoe Valley ward and shared the spoils with the Conservatives in Goldsworth Park, Mount Hermon and St Johns. Labour took all three seats in the Canalside Ward (where the Conservative council was taking forward a controversial redevelopment and regeneration scheme in the Sheerwater area). However, the Conservatives did rack up four extremely convincing wins (with majorities in each ward of c.1,000 votes) in the wards of Heathlands, Horsell, Knaphill and Pyrford.\nThere were very close battles, resulting in three ‘split wards’, in Goldsworth Park, Mount Hermon and St Johns, but, arguably, no results were closer than those in the Mount Hermon ward, where Conservative councillor Carl Thomson and Liberal Democrat councillor Liam Lyons both lost their seats, and where only 64 votes separated the second and fifth placed candidates, and just 22 votes separated those who placed second and fourth.\nIn the election, the Conservatives and the Liberal Democrats were the only two parties to field a full slate of thirty candidates. UKIP stood one candidate in each of the ten wards, and two in Canalside, for a total of eleven candidates in all. Labour nominated sixteen candidates in total, but stood them across just seven out of the ten wards. The Greens fielded one candidate in each of seven wards, for a total of seven nominations. The best result for the Greens was in Knaphill, where their candidate James Brierley was the runner-up to the three successful Conservative candidates.\nAfter the election, long-standing council leader Councillor John Kingsbury continued in office with the support of the Conservative group. Councillor Kingsbury later announced his retirement as council leader in 2017, and stood down as a councillor at the 2018 local elections.\n|- style=\"background-color: #e9e9e9; font-weight: bold;\"\n| colspan=\"2\" style=\"width: 130px; padding-left: 4px;\" | Totals\n| style=\"text-align:right;\" | 30\n| style=\"text-align:right;\" | N/A\n| style=\"text-align:right;\" | N/A\n| style=\"text-align:right;\" | –6\n| style=\"text-align:right;\" | 100%\n| style=\"text-align:right;\" | 100%\n| style=\"text-align:right;\" | 73,623\n| style=\"text-align:right;\" | —\n|-\nWard by ward\nByfleet and West Byfleet\n}}\nCanalside\nGoldsworth Park\nHeathlands\nHoe Valley\nHorsell\nKnaphill\nMount Hermon\nPyrford\nSt Johns\nReferences"
    }
  ]
}