{
  "content": [
    {
      "type": "text",
      "text": "# 2016 United States presidential election in the District of Columbia\n\n| image_size        = 200x200px\n| image1            = Hillary Clinton by Gage Skidmore 2.jpg\n| nominee1          = Hillary Clinton\n| party1            = Democratic Party (United States)\n| home_state1       = New York\n| running_mate1     = Tim Kaine\n| electoral_vote1   = 3\n| popular_vote1     = 282,830\n| percentage1       = 90.86%\n| image2            = Donald Trump official portrait (cropped).jpg\n| nominee2          = Donald Trump\n| party2            = Republican Party (United States)\n| home_state2       = New York\n| running_mate2     = Mike Pence\n| electoral_vote2   = 0\n| popular_vote2     = 12,723\n| percentage2       = 4.09%\n| title             = President\n| before_election   = Barack Obama\n| before_party      = Democratic Party (United States)\n| after_election    = Donald Trump\n| after_party       = Republican Party (United States)\n| map_image =\n| map_size = 250px\n| map_caption =\nClinton\n}}\nThe 2016 United States presidential election in the District of Columbia was held on Tuesday, November 8, 2016, as part of the 2016 United States presidential election in which all fifty states and the District of Columbia participated. District of Columbia voters chose electors to represent them in the Electoral College via a popular vote, pitting the Republican Party's nominee, businessman Donald Trump, and running mate Indiana Governor Mike Pence against Democratic Party nominee, former Secretary of State Hillary Clinton, and her running mate Virginia Senator Tim Kaine. The District of Columbia has three electoral votes in the Electoral College. Prior to the election, Clinton was considered to be virtually certain to win Washington DC.\nClinton won the election with 282,830 votes, or 90.9%, thereby becoming the first presidential candidate to win over 95% of the district's two-party vote. Trump received 12,723 votes, or 4.1%, which is both the lowest popular vote total and the lowest share of the vote received by any Republican candidate since voters in the District were granted presidential electors under the Twenty-third Amendment.\nNotably, Clinton's 86.77-point margin of victory also represented the largest secured by any major-party presidential candidate, in any jurisdiction, since Franklin D. Roosevelt's landslide re-election in 1944 in Mississippi. It is the largest ever in the district. Trump's 4.1% is the lowest vote share for a major party nominee since Alf Landon in the 1936 United States presidential election, and the lowest ever in the district. Along with 11 other states, the District of Columbia shifted towards the Democrats in this election.\nPrimary elections\nThe incumbent President of the United States, Barack Obama, a Democrat and former U.S. Senator from Illinois, was first elected president in the 2008 election, running with former Senator Joe Biden of Delaware. Defeating the Republican nominee, Senator John McCain of Arizona, with 52.9% of the popular vote and 68% of the electoral vote, Obama succeeded two-term Republican President George W. Bush, the former Governor of Texas. Obama and Biden were reelected in the 2012 presidential election, defeating former Massachusetts Governor Mitt Romney with 51.1% of the popular vote and 61.7% of electoral votes. Although Barack Obama's approval rating in the RealClearPolitics poll tracking average remained between 40 and 50 percent for most of his second term, it experienced a surge in early 2016 and reached its highest point since 2012 during June of that year. Analyst Nate Cohn noted that a strong approval rating for President Obama would equate to a strong performance for the Democratic candidate, and vice versa.\nFollowing his second term, President Obama was not eligible for another reelection. In October 2015, his running-mate and two-term Vice President Biden decided not to enter the race for the Democratic presidential nomination either. With their term expiring on January 20, 2017, the electorate was asked to elect a new president, the 45th president and 48th vice president of the United States, respectively.\nRepublican convention\nDue to the small geographical size of the District of Columbia and the very small number of Republicans in the District, the local Republican party decided go directly to a \"state convention\", which took place at the Loews Madison Hotel at 1177 15th St NW from 10 a.m. – 4 p.m. The Convention/Caucus method was chosen because the June 14th primary was deemed too late, and DC would be penalized and only get 16 delegates.\nDemocratic primary\nThe Democratic primary was held June 14. The date was chosen because it was thought that by then the race would be over and the voters could then concentrate on local races.\nResults\nBy ward\n{| style=\"width:60%;\" class=\"wikitable sortable\"\n|- style=\"background:lightgrey;\"\n! style=\"width:11%;\"| County\n! style=\"width:10%;\"| Clinton\n! style=\"width:10%;\"| Votes\n! style=\"width:10%;\"| Sanders\n! style=\"width:10%;\"| Votes\n!Totals\n!TO%\n|-\n| style=\"background:#D4AA00;\" |\tWard 1\t                                        ||73.8%||        9,893|| 25.3%|| 3,181\n|12,563\n|24.34%\n|-\n| style=\"background:#D4AA00;\" |\tWard 2                                          ||79.6%||        7,294|| 19.4%|| 1,777\n|9,164\n|25.29%\n|-\n| style=\"background:#D4AA00;\" |\tWard 3                                          ||77.1%||\t10,893|| 21.8%|| 3,087\n|14,135\n|32.00%\n|-\n| style=\"background:#D4AA00;\" |\tWard 4\t                                        ||77.9%||\t12,863|| 20.7%|| 3,421\n|16,516\n|29.46%\n|-\n| style=\"background:#D4AA00;\" |\tWard 5                    \t                ||78.2%||\t 9,214|| 20.5%|| 2,419\n|11,779\n|19.89%\n|-\n| style=\"background:#D4AA00;\" |\tWard 6                              \t        ||77.9%||\t11,898|| 20.9%|| 3,198\n|15,275\n|24.89%\n|-\n| style=\"background:#D4AA00;\" |\tWard 7                                          ||82.1%||        8,657|| 16.2%|| 1,707\n|10,548\n|18.82%\n|-\n| style=\"background:#D4AA00;\" |\tWard 8                                          ||78.6%||\t 6,612|| 18.7%|| 1,571\n|8,418\n|15.17%\n|-\n|                             |Total                                      ||78.0%||         76,704||   20.7%         ||20,361\n|98,398\n|23.42%\n|}\nBallot controversy\nOn March 30, ten weeks ahead of the Washington D.C. primary, NBC affiliate News 4 reported that the Democratic Party's D.C. State Committee had submitted registration paperwork for listing presidential candidate Bernie Sanders on the primary ballots a day late, even though the Sanders campaign had correctly and timely registered with the state party. After a voter filed a challenge, this would possibly lead to Sanders' name being missing on the ballots. As the D.C. Council announced it would hold an emergency vote to put Sanders back on the ballots, and with Clinton's campaign chairman John Podesta asking to make sure an administrative error wouldn't exclude a candidate, D.C. Democratic Party chairwoman Anita Bonds told CNN that \"Bernie will be on the ballot.\" She further explained that the party has always notified the D.C. board of elections a day after the deadline, with the only difference being that this time, someone challenged the inclusion of Sanders.\nGeneral election\nVoting history\nThe Twenty-third Amendment to the United States Constitution, ratified in 1961, grants the District of Columbia the right to choose presidential electors equal to the number from the least populous state (currently Wyoming's three). Since the amendment's ratification, the District of Columbia has cast its electoral votes for the Democratic candidate in every election. A Republican has never been the District's Mayor, and the current Council has 10 Democrats and two Independents.\nPredictions\n{| class=\"wikitable\" style=\"text-align:center\"\n|-\n!Source\n!Ranking\n!As of\n|-\n|align=\"left\" |Los Angeles Times\n|\n| November 6, 2016\n|-\n| style=\"text-align:left;\"|CNN\n|\n|November 4, 2016\n|-\n| style=\"text-align:left;\"|Cook Political Report\n|\n|November 7, 2016\n|-\n| style=\"text-align:left;\"|Electoral-vote.com\n|\n|November 8, 2016\n|-\n| style=\"text-align:left;\"|Sabato's Crystal Ball\n|\n|November 7, 2016\n|-\n|align=\"left\" |Fox News\n|\n|November 7, 2016\n|}\nResults\n0.05%'''\n}}\n3.19%\n}}\n1.84%\n}}\n0.87%\n}}\n0.53%\n}}\nResults by Ward\n{| width=\"60%\" class=\"wikitable sortable\"\n! rowspan=\"2\" |Ward\n! colspan=\"2\" |Hillary ClintonDemocratic\n! colspan=\"2\" |Donald TrumpRepublican\n! colspan=\"2\" |Various CandidatesOther Parties\n! colspan=\"2\" |Margin\n! rowspan=\"2\" |Total Votes Cast\n|-\n! style=\"text-align:center;\" data-sort-type=\"number\" |#\n! style=\"text-align:center;\" data-sort-type=\"number\" |%\n! style=\"text-align:center;\" data-sort-type=\"number\" |#\n! style=\"text-align:center;\" data-sort-type=\"number\" |%\n! style=\"text-align:center;\" data-sort-type=\"number\" |#\n! style=\"text-align:center;\" data-sort-type=\"number\" |%\n! style=\"text-align:center;\" data-sort-type=\"number\" |#\n! style=\"text-align:center;\" data-sort-type=\"number\" |%\n|- style=\"text-align:center;\"\n||Ward 1\n||37,490\n||92.50%\n||1,066\n||2.63%\n||1,973\n||4.87%\n||35,517\n||87.63%\n||40,529\n|- style=\"text-align:center;\"\n||Ward 2\n||28,714\n||86.59%\n||2,304\n||6.95%\n||2,143\n||6.46%\n||26,410\n||79.64%\n||33,161\n|- style=\"text-align:center;\"\n||Ward 3\n||36,475\n||85.66%\n||3,323\n||7.80%\n||2,784\n||6.54%\n||33,152\n||77.86%\n||42,582\n|- style=\"text-align:center;\"\n||Ward 4\n||37,962\n||92.60%\n||1,358\n||3.31%\n||1,677\n||4.09%\n||36,285\n||88.51%\n||40,997\n|- style=\"text-align:center;\"\n||Ward 5\n||37,021\n||92.72%\n||1,141\n||2.86%\n||1,766\n||4.42%\n||35,255\n||88.30%\n||39,928\n|- style=\"text-align:center;\"\n||Ward 6\n||45,540\n||88.11%\n||2,506\n||4.85%\n||3,641\n||7.04%\n||41,899\n||81.07%\n||51,687\n|- style=\"text-align:center;\"\n||Ward 7\n||31,784\n||95.47%\n||547\n||1.64%\n||961\n||2.89%\n||30,823\n||92.58%\n||33,292\n|- style=\"text-align:center;\"\n||Ward 8\n||27,844\n||95.71%\n||478\n||1.64%\n||770\n||2.65%\n||27,074\n||93.06%\n||29,092\n|- style=\"text-align:center;\"\n!Total!!282,830!!90.86%!!12,723!!4.09%!!15,715!!5.05%!!267,115!!85.81%!!311,268\n|}\nSee also\n* 2016 Democratic Party presidential primaries\n* 2016 Republican Party presidential primaries\nNotes\nReferences"
    }
  ]
}