{
  "content": [
    {
      "type": "text",
      "text": "# 2016 Box Office Entertainment Awards\n\n| website        =\n| most_wins      =\n| network        = ABS-CBN\n| previous       = 46th ed.\n| main           = Box Office Entertainment Awards\n| next           = 48th ed.\n}}\nThe 47th Guillermo Mendoza Memorial Scholarship Foundation Box Office Entertainment Awards (GMMSF-BOEA), honored the personalities, movies and TV programs in the Philippines, and  took place on April 17, 2016, at the Novotel Grand Ballroom, Araneta Center, Cubao, Quezon City. The award-giving body honors Filipino actors, actresses and other performers' commercial success, regardless of artistic merit, in the Philippine entertainment industry. The awards night was aired on ABS-CBN's \"Sunday Best\" on May 1, 2016.\nWinners selection\nThe GMMSF selects the high-ranking Philippine films of 2015 based on total average rankings at box office published results (MMFF has not released the final gross tally for the 2015 edition.) as basis for awarding the three major categories in the awarding ceremonies, The Phenomenal Box Office Star, The Box Office King and The Box Office Queen.\nThe deliberations were held at the Barrio Fiesta Restaurant in Greenhills, San Juan on February 20, 2016, attended by the representatives of GMMSF. An additional three more categories were introduced in the 2016 edition: the Breakthrough Male and Female Star of Philippine Movies and TV (given to Alden Richards and Maine Mendoza, collectively known as the AlDub loveteam), and the Breakthrough Recording/Performing Artist. (to be given also to Richards). Vice Ganda reprises his title as the Phenomenal Box Office Star with his other kapamilya co-stars namely Coco Martin, John Lloyd Cruz and Bea Alonzo for their blockbuster movies Beauty and the Bestie and A Second Chance. Both are Star Cinema-produced.\nAwards\n*Phenomenal Box Office Star\n**Bea Alonzo and John Lloyd Cruz (A Second Chance) (tied with) Vice Ganda and Coco Martin (Beauty and the Bestie)\n*Box Office King\n**Vic Sotto (My Bebe Love)\n*Box Office Queen\n**Ai-Ai Delas Alas (My Bebe Love)\n*Film Actor of the Year\n**Jericho Rosales (Walang Forever)\n*Film Actress of the Year\n**Jennylyn Mercado (Walang Forever)\n*Prince of Philippine Movies\n**Daniel Padilla (Crazy Beautiful You)\n*Princess of Philippine Movies\n**Kathryn Bernardo (Crazy Beautiful You)\n*Prince of Philippine Television\n**James Reid (On the Wings of Love - ABS-CBN 2)\n*Princess of Philippine Television\n**Nadine Lustre (On the Wings of Love - ABS-CBN 2)\n*Breakthrough Male Star of Philippine Movies and TV\n**Alden Richards\n*Breakthrough Female Star of Philippine Movies and TV\n**Maine Mendoza\n*Most Popular Love Team of Movies and TV\n**Enrique Gil and Liza Soberano (Forevermore, Just the Way You Are, Everyday I Love You)\n*Most Promising Love Team on TV\n**Andre Paras and Barbie Forteza (The Half Sisters - GMA 7)\n*Most Promising Male Star\n**Ken Chan (Destiny Rose – GMA 7)\n*Most Promising Female Star\n**Maine Mendoza (My Bebe Love)\n*Male Concert Performers of the Year\n**Martin Nievera and Gary Valenciano (The Ultimate Concert at MOA)\n*Female Concert Performers of the Year\n**Regine Velasquez and Lani Misalucha (The Ultimate Concert at MOA)\n*Male Recording Artist of the Year\n**Jed Madela (Iconic)\n*Female Recording Artist of the Year\n**Sarah Geronimo (Perfectly Imperfect)\n*Promising Male Recording Artist of the Year\n**Enchong Dee (Chinito Problems)\n*Promising Female Recording Artist of the Year\n**Kim Chiu (Chinita Princess)\n*Promising Male Concert Performer\n**Darren Espanto (The Birthday Concert)\n*Promising Female Concert Performer\n**Maja Salvador (Majasty)\n*Most Popular Recording/Performing Group\n**The Company  (Lighthearted)\n*Most Promising Recording/Performing Group\n**Harana (Harana)\n*Most Popular Novelty Singer\n**Michael Pangilinan (Pare Mahal Mo Raw Ako)\n*Breakthrough Recording/Performing Artist\n**Alden Richards (Wish I May)\n*Most Popular Child Performer\n**Simon \"Onyok\" Pineda (Ang Probinsyano - ABS-CBN 2)\n*Most Popular Film Producer\n**Star Cinema\n*Most Popular Screenwriter\n**Carmi Raymundo and Vangie Valdez (A Second Chance) (tied with) Wenn Deramas (Beauty and the Bestie)\n*Most Popular Film Director\n**Cathy Garcia Molina (A Second Chance) (tied with) Wenn Deramas (Beauty and the Bestie)\n*Most Popular TV Program for News and Public Affairs\n**Kapuso Mo, Jessica Soho (GMA 7)\n*Most Popular Daytime Drama\n**The Half Sisters (GMA 7)\n*Most Popular Primetime Drama\n**Forevermore (ABS-CBN 2)\n*Most Popular TV Talent/Reality Program\n**Your Face Sounds Familiar (ABS-CBN 2)\n*Most Popular TV Program for Noontime/Variety\n**Eat Bulaga! (GMA 7)\nSpecial awards\n*Bert Marcelo Lifetime Achievement Award\n**Jose Manalo, Wally Bayola, Paolo Ballesteros\n*Corazon Samaniego Lifetime Achievement Award\n**Vilma Santos\n*Highest Record Rating by a Primetime Teleserye of All Time\n**Ang Probinsyano (ABS-CBN 2) (46.7%)\n*Highest Opening Day Gross of All Time\n**My Bebe Love ()\n*Highest Record Rating of a Noontime Show of All Time (Local & Global)\n**Eat Bulaga! - AlDub: Sa Tamang Panahon event @ Philippine Arena (50.8%)\n*Highest Grossing Historical Film of All Time\n**Heneral Luna ()\n*Posthumous Award for Entertainment Excellence & Star Builder\n**German Moreno\nNotes\n:\n:\n:\n}}\nReferences"
    }
  ]
}