{
  "content": [
    {
      "type": "text",
      "text": "# 2018 Cameroonian presidential election\n\n14.43pp)\n| next_election = 2025 Cameroonian presidential election\n| next_year = 2025\n| image_size = 130x130px\n| nominee1 = Paul Biya\n| image1 = Paul Biya 2014.png\n| party1 = Cameroon People's Democratic Movement\n| popular_vote1 = 2,521,934\n| percentage1 = 71.28%\n| nominee2 = Maurice Kamto\n| image2 = Maurice Kamto.jpg\n| party2 = Cameroon Renaissance Movement\n| popular_vote2 = 503,384\n| percentage2 = 14.23%\n| nominee3 = Cabral Libii\n| image3 = Cabral Libii meeting 2018.jpg\n| party3_name = no\n| party3 = Univers\n| color3 = B22222\n| popular_vote3 = 221,995\n| percentage3 = 6.28%\n| map_image = 2018 Cameroonian presidential election results by department.svg\n| map_caption = Results by department Biya:      Kamto:  Libii:\n| title = President\n| before_election = Paul Biya\n| before_party = Cameroon People's Democratic Movement\n| after_election = Paul Biya\n| after_party= Cameroon People's Democratic Movement\n}}\nPresidential elections were held in Cameroon on 7 October 2018.\nBackground\nThe previous presidential elections on 9 October 2011 saw incumbent president Paul Biya, in power since 1982, elected for another seven-year term following a 2008 constitutional amendment that removed term limits, allowing Biya to run again. Going into the 2018 elections, Cameroon experienced unrest in the English-speaking portions of the country where separatists have attempted to create the state of Ambazonia. The worst of the unrest occurred in Manyu where several Western countries issued travel warnings to their citizens. The Social Democratic Front, a party that traditionally performs well in the English-speaking portions of the country, has been vocal in their criticism of the handling of the unrest. Biya has responded to the unrest by stating that he would like to see faster progress made on decentralization reforms that were begun in 2010 so that local regions would have more self governance.\nOn 15 June 2018, the BBC obtained a copy of a letter from Paul Biya to the leader of Cameroon's Senate, appearing to request that the elections be postponed until October 2019. In July, President Biya announced that the election would be held on October 7, 2018.\nElectoral system\nThe President of Cameroon is elected by first-past-the-post voting; the candidate with the most votes is declared the winner with no requirement to achieve a majority.\nCandidates\nAccepted\n*Garga Haman Adji, leader of the Alliance for Democracy and Development\n*Paul Biya, incumbent president and candidate for the Cameroon People's Democratic Movement\n*Maurice Kamto, candidate for the Cameroon Renaissance Movement\n*Cabral Libii, journalist and law professor at University of Yaoundé II; candidate for Univers\n*, Douala city councilman and leader of United People for Social Renovation\n*Akere Muna, candidate for Now!\n*, candidate for the National Citizens' Movement of Cameroon\n*Adamou Ndam Njoya, candidate for the Cameroon Democratic Union\n*Joshua Osih, selected as the Social Democratic Front candidate on 24 February 2018\nDid not run\n*Samuel Eto'o; the former footballer was rumoured to be considering running.\n*Dieudonné M'bala M'bala, French comedian of Cameroonian descent\n*Bernard Muna\n*Bernard Njonga; leader of Believe in Cameroon\nResults\n|votes3=222020\n|cand4=Joshua Osih|party4=Social Democratic Front|votes4=118706\n|cand5=Adamou Ndam Njoya|party5=Cameroon Democratic Union|votes5=61220\n|cand6=Garga Haman Adji|party6=Alliance for Democracy and Development|votes6=55048\n|cand7=|party7=Cameroonian National Citizen Movement|votes7=23687\n|cand8=|party8=United People for Social Renovation|votes8=19704\n|cand9=Akere Muna|party9=Now!|votes9=12262|color9=#FCC40D\n|invalid=52716\n|electorate=6667754\n|source=[https://www.camerlex.com/wp-content/uploads/2018/10/resultat-presidentielle.pdf Camerlex]\n}}\nAftermath\nOn 28 January 2019 Maurice Kamto was arrested in Douala while at a supporter's house.\nReferences"
    }
  ]
}