{
  "content": [
    {
      "type": "text",
      "text": "# 2018 Turkish presidential election candidate nominations\n\nMultiple political parties in Turkey underwent candidate selection processes in the run-up to the 2018 presidential election. Parties represented in the Grand National Assembly were able to field candidates directly by collecting signatures from at least 20 of their Members of Parliament, as were parties who had no representation but won more than 5% in the previous general election. Candidates that did not meet either criterion were required to obtain over 100,000 signatures from Turkish citizens between 4 and 9 May.\nThe incumbent President Recep Tayyip Erdoğan was declared as the candidate for the People's Alliance, an electoral alliance between his Justice and Development Party (AKP) and the far-right Nationalist Movement Party (MHP). The main opposition Republican People's Party (CHP) nominated Yalova MP Muharrem İnce. The pro-Kurdish Peoples' Democratic Party (HDP) nominated their imprisoned former leader Selahattin Demirtaş. Three other candidates, namely İyi Party leader Meral Akşener, Felicity Party leader Temel Karamollaoğlu and Patriotic Party leader Doğu Perinçek received more than 100,000 signatures and were thus nominated to contest the election.\nOfficial candidates\nThe formal list of presidential candidates will be announced on 13 May 2018 by the Supreme Electoral Council of Turkey (YSK).\nNomination process\nPeople's Alliance (AKP and MHP)\nThe governing Justice and Development Party (AKP) entered the elections in an alliance with the smaller Nationalist Movement Party (MHP). Having won public support from MHP leader Devlet Bahçeli, incumbent president and AKP leader Recep Tayyip Erdoğan is widely expected to be the Alliance candidate.\nIn the 2014 presidential election, the Nationalist Movement Party (MHP) opted to support the candidacy of Ekmeleddin İhsanoğlu, who was also backed by main opposition Republican People's Party and 12 minor parties. İhsanoğlu ultimately lost the election to Recep Tayyip Erdoğan, the Justice and Development Party. Following the 2015 parliamentary elections and the failed 15 July 2016 military coup, the MHP moved closer to President Erdoğan and the AKP, supporting the latter's push for the ultimately successful 2017 referendum to switch Turkey from a parliamentary to a presidential system. In the aftermath of the referendum, there were speculations surrounding the MHP's choice of candidate for the next presidential election, scheduled for November 2019. While former MHP deputy Sinan Oğan declared his pre-candidacy for the presidency in 2017, party leader Devlet Bahçeli announced on 8 January 2018 that the MHP would support a potential re-election bid for Erdoğan, and that they would seek to enter formal talks with the AKP on co-operation in both presidential and parliamentary elections. On 20 February 2018, the Nationalist Movement party formally entered into the People's Alliance coalition with the AKP.\n{| class=\"wikitable\" style=\"margin:1em auto; font-size:90%; text-align:center;\"\n|-\n|\n|-\n! style=\"width:100px; font-size:100%; background:;\"|\n|-\n| style=\"width:100px; font-size:100%; background:#DEFDE6;\"| Recep Tayyip Erdoğan\n|-\n| style=\"width:100px; font-size:100%; background:#DEFDE6;\"| President\n|-\n| style=\"width:100px; font-size:100%; background:#DEFDE6;\"| Nominated\n|}\n*Recep Tayyip Erdoğan , incumbent President of Turkey and leader of the Justice and Development Party (AKP)\nRepublican People's Party (CHP)\nand Felicity Party leader Temel Karamollaoğlu meet to discuss a potential joint candidate on 23 April 2018]]\nThe Republican People's Party (CHP) declared on 24 April 2018 that its parliamentary group would decide its presidential candidate. The party's leader Kemal Kılıçdaroğlu is regarded as the most likely candidate, despite ruling himself out on multiple occasions before the election was announced. Two days after the election was called, CHP Members of Parliament Öztürk Yılmaz and Didem Engin declared interest in running as their party's candidate, while Muharrem İnce and Haluk Pekşen were also rumoured to have started gathering support for a potential run. On 23 April, it was reported that the CHP had narrowed down their potential candidates to two, namely &nbsp;Muharrem İnce and Eskişehir Mayor Yılmaz Büyükerşen, although İstanbul MP İlhan Kesici was still mentioned as a third option.\nAt the same time as attempting to determine a party candidate, the CHP conducted meetings with other parties to explore the prospect of a joint nominee. On 22 April, the CHP took the decision to allow 15 CHP MPs to cross over to the İyi Party to guarantee them an election run, raising speculation over İyi leader Meral Akşener as a potential joint candidate. On 23 April, Kılıçdaroğlu met with Felicity Party (SP) leader Temel Karamollaoğlu, with Karamollaoğlu calling for a triple alliance between the CHP, İyi and his own party to nominate former President Abdullah Gül. The potential joint candidacy of Gül, a former member of the AKP, was not outrightly denied by the CHP, leading to criticism across CHP voters. With the İyi Party insisting on nominating Akşener, the probability of a triple alliance has decreased.\nAfter forming the Nation alliance with the İyi, Felicity, and Democratic parties in early May 2018, the leadership of the Republican People's Party reiterated its intention to field its own candidate for the presidential election. On 3 May 2018, the central CHP figure İlhan Kesici announced that the party would nominate Muharrem İnce, a CHP member of parliament for Yalova, as its presidential candidate. Party leader Kemal Kılıçdaroğlu is scheduled to formally proclaim İnce's candidacy during a press conference on 4 May 2018.\nParty members\n{| class=\"wikitable\" style=\"margin:1em auto; font-size:90%; text-align:center;\"\n|-\n! colspan=7 | CHP members\n|-\n|\n|\n|\n|\n|\n|\n|\n|-\n! style=\"width:100px; font-size:100%; background:;\"|\n! style=\"width:100px; font-size:100%; background:;\"|\n! style=\"width:100px; font-size:100%; background:;\"|\n! style=\"width:100px; font-size:100%; background:;\"|\n! style=\"width:100px; font-size:100%; background:;\"|\n! style=\"width:100px; font-size:100%; background:;\"|\n! style=\"width:100px; font-size:100%; background:;\"|\n|-\n| Kemal Kılıçdaroğlu\n| Öztürk Yılmaz\n| Didem Engin\n| style=\"width:100px; font-size:100%; background:#DEFDE6;\"| Muharrem İnce\n| Deniz Baykal\n| Yılmaz Büyükerşen\n| İlhan Kesici\n|-\n| İzmir (II) MP and CHP leader\n| Ardahan MP and deputy leader\n| İstanbul (II) MP\n| style=\"width:100px; font-size:100%; background:#DEFDE6;\"| Yalova MP\n| Antalya MP and former leader\n| Mayor of Eskişehir\n| İstanbul (I) MP\n|-\n| Declined\n| Declared interest\n| Declared interest\n| style=\"width:100px; font-size:100%; background:#DEFDE6;\"| Nominated\n| Speculated\n| Speculated\n| Speculated\n|-\n! colspan=7 |\n|-\n|\n|\n|\n|\n|\n|\n|\n|-\n! style=\"width:100px; font-size:100%; background:;\"|\n! style=\"width:100px; font-size:100%; background:;\"|\n! style=\"width:100px; font-size:100%; background:;\"|\n! style=\"width:100px; font-size:100%; background:;\"|\n! style=\"width:100px; font-size:100%; background:;\"|\n! style=\"width:100px; font-size:100%; background:;\"|\n! style=\"width:100px; font-size:100%; background:;\"|\n|-\n| Özgür Özel\n| Haluk Pekşen\n| Aziz Kocaoğlu\n| Faik Öztrak\n| Murat Karayalçın\n| Mehmet Haberal\n| Haluk Koç\n|-\n| Manisa MP\n| Trabzon MP\n| Mayor of İzmir\n| Tekirdağ MP\n| Former Deputy Prime Minister\n| Former Zonguldak MP\n| Ankara (II) MP\n|-\n| Speculated\n| Speculated\n| Speculated\n| Speculated\n| Speculated\n| Speculated\n| Speculated\n|}\n*Kemal Kılıçdaroğlu, leader of the Republican People's Party (CHP) and Member of Parliament for İzmir's second electoral district (declined July 2017, still speculated)\n*Öztürk Yılmaz, CHP Member of Parliament for Ardahan and deputy leader responsible for foreign affairs (declared interest 20 April)\n*Didem Engin, CHP Member of Parliament for İstanbul's second electoral district (declared interest 20 April)\n*Muharrem İnce , CHP Member of Parliament for Yalova\n*Deniz Baykal, former Deputy Prime Minister, former leader of the CHP and current Member of Parliament for Antalya (hospitalised since October 2017)\n*Yılmaz Büyükerşen, current Mayor of Eskişehir\n*İlhan Kesici, CHP Member of Parliament for İstanbul's first electoral district\n*Haluk Koç, CHP Member of Parliament for Ankara's second electoral district and former party spokesperson\n*Özgür Özel, CHP Member of Parliament for Manisa and Deputy Parliamentary Group Leader\n*Haluk Pekşen, CHP Member of Parliament for Trabzon\n*Aziz Kocaoğlu, Mayor of İzmir\n*Faik Öztrak, CHP Member of Parliament for Tekirdağ\n*Murat Karayalçın, former Deputy Prime Minister of Turkey\n*Mehmet Haberal, former CHP MP for Zonguldak\nCross-party members\n{| class=\"wikitable\" style=\"margin:1em auto; font-size:90%; text-align:center;\"\n|-\n! colspan=8 | Independent or cross-party candidates\n|-\n|\n|\n|\n|\n|\n|\n|\n|\n|-\n! style=\"width:100px; font-size:100%; background:;\"|\n! style=\"width:100px; font-size:100%; background:;\"|\n! style=\"width:100px; font-size:100%; background:;\"|\n! style=\"width:100px; font-size:100%; background:;\"|\n! style=\"width:100px; font-size:100%; background:;\"|\n! style=\"width:100px; font-size:100%; background:;\"|\n! style=\"width:100px; font-size:100%; background:;\"|\n! style=\"width:100px; font-size:100%; background:;\"|\n|-\n| Abdullah Gül\n| Ali Babacan\n| Meral Akşener\n| İlker Başbuğ\n| Ali Koç\n| Metin Feyzioğlu\n| Abdüllatif Şener\n| Kemal Derviş\n|-\n| Former President\n| Former Deputy Prime Minister and AKP MP\n| İyi Party leader\n| Former Chief of General Staff\n| Businessman\n| TBB president\n| Former Deputy Prime Minister\n| Former Minister of Economic Affairs\n|-\n| Declined\n| Speculated\n| Speculated\n| Speculated\n| Speculated\n| Speculated\n| Speculated\n| Speculated\n|}\n*Abdullah Gül, former AKP Prime Minister and 11th President of Turkey\n*Ali Babacan, AKP Member of Parliament and former Deputy Prime Minister of Turkey\n*Meral Akşener, leader of the İyi Party (potential CHP support speculated)\n*İlker Başbuğ, former Chief of General Staff of Turkey\n*Cem Boyner, CEO of Boyner Holding\n*Ali Koç, Turkish businessman, son of Rahmi Koç and former Vice President of Fenerbahçe S.K.\n*Metin Feyzioğlu, President of the Turkish Bars Association (TBB)\n*Abdüllatif Şener, former Deputy Prime Minister of Turkey\n*Kemal Derviş, former Minister of Economic Affairs and former Administrator to the United Nations Development Program\n*Özgür Demirtaş, Turkish economics professor, recommended by Kemal Derviş\nPeoples' Democratic Party (HDP)\nThe co-leader of the Peoples' Democratic Party (HDP) Pervin Buldan announced in March 2018 that they would field a candidate. Since then, the party's former co-leader and 2014 presidential candidate Selahattin Demirtaş has been widely regarded as the frontrunner to be the HDP's candidate. However, Demirtaş has remained imprisoned since November 2016 awaiting trial on a multitude of charges ranging from insulting the president to inciting terrorism. Following the announcement of the early election, Demirtaş announced that his party would work to find an effective and encompassing candidate, ruling himself out of the race.\nOn 24 April, HDP co-leader Sezai Temelli announced that they would field a candidate that was 'strong and will encompass all of Turkey.' On 24 April, it was reported that despite initial speculation to the contrary, Demirtaş would be the HDP's candidate for the second time. This was confirmed on 25 April, as the HDP executive voted to nominate him as their candidate.\n{| class=\"wikitable\" style=\"margin:1em auto; font-size:90%; text-align:center;\"\n|-\n|\n|\n|\n|\n|\n|\n|\n|\n|\n|-\n! style=\"width:100px; font-size:100%; background:;\"|\n! style=\"width:100px; font-size:100%; background:;\"|\n! style=\"width:100px; font-size:100%; background:;\"|\n! style=\"width:100px; font-size:100%; background:;\"|\n! style=\"width:100px; font-size:100%; background:;\"|\n! style=\"width:100px; font-size:100%; background:;\"|\n! style=\"width:100px; font-size:100%; background:;\"|\n! style=\"width:100px; font-size:100%; background:;\"|\n! style=\"width:100px; font-size:100%; background:;\"|\n|-\n| style=\"width:100px; font-size:100%; background:#DEFDE6;\"| Selahattin Demirtaş\n| Filiz Kerestecioğlu\n| Sırrı Süreyya Önder\n| Ertuğrul Kürkçü\n| Rıza Türmen\n| Figen Yüksekdağ\n| Ufuk Uras\n| Gençay Gürsoy\n| Şebnem Korur Fincancı\n|-\n| style=\"width:100px; font-size:100%; background:#DEFDE6;\"| İstanbul (I) MP\n| İstanbul (II) MP\n| Ankara (I) MP\n| former HDP co-leader and İzmir (I) MP\n| Former CHP MP\n| Former HDP co-leader\n| Former ÖDP leader\n| Medical surgeon\n| Medical surgeon and journalist\n|-\n| style=\"width:100px; font-size:100%; background:#DEFDE6;\"| Nominated\n| Declined\n| Ineligible\n| Ineligible\n| Speculated\n| Ineligible\n| Declined\n| Declined\n| Declined\n|}\n*Selahattin Demirtaş , former co-leader of the HDP, 2014 presidential candidate and Member of Parliament for İstanbul's first electoral district (imprisoned since November 2016; nominated 25 April 2018)\n*Filiz Kerestecioğlu, HDP Member of Parliament for İstanbul's second electoral district (declined 18 April 2018)\n*Sırrı Süreyya Önder, HDP Member of Parliament for Ankara's first electoral district (ineligible due to the lack of a university degree)\n*Ertuğrul Kürkçü, former HDP co-leader and Member of Parliament for İzmir's first electoral district (ineligible due to the lack of a university degree)\n* Rıza Türmen, former CHP Member of Parliament\n* Figen Yüksekdağ, former HDP co-leader (party membership legally revoked as of March 2017, lacks university degree)\n* Ufuk Uras, former leader of the ÖDP and former Member of Parliament under the Labour, Democracy and Freedom Bloc\n* Gençay Gürsoy, Turkish medical surgeon\n* Şebnem Korur Fincancı, Turkish medical surgeon and journalist\nİyi Party\nThe İyi Party, formed on 25 October 2017, has campaigned on the promise of reverting Turkey back to a parliamentary system of government, as opposed to the executive presidency that will take effect following the elections. The party's leader Meral Akşener declared her candidacy for the presidency on the day of her party's establishment, becoming one of the earliest declared candidates. On 18 April 2018, shortly after the early election was announced, Akşener re-affirmed her candidacy and stated that her party would find 100,000 signatures nominated her as a candidate. Early in the evening of May 4, 2018, it was announced that Akşener received 127,850 signatures, becoming the first of the four candidates to cross the threshold.\n{| class=\"wikitable\" style=\"margin:1em auto; font-size:90%; text-align:center;\"\n|-\n|\n|-\n! style=\"width:100px; font-size:100%; background:;\"|\n|-\n| style=\"width:100px; font-size:100%; background:#DEFDE6;\"| Meral Akşener\n|-\n| style=\"width:100px; font-size:100%; background:#DEFDE6;\"| İyi Party leader\n|-\n| style=\"width:100px; font-size:100%; background:#DEFDE6;\"| Nominated\n|}\n*Meral Akşener , former Interior Minister, Deputy Speaker of the Grand National Assembly and leader of the İyi Party (declared 25 October 2017, nominated 24 April 2018)\nFelicity Party\nDespite winning less than 1% of the vote in the previous general election, the Felicity Party's (SP) candidate selection process was subject to much media speculation due to the prospect of them joining an anti-Erdoğan alliance and fielding a joint candidate. The recent success of SP leader Temel Karamollaoğlu in gaining media attention for his party meant that the leaders of both the Republican People's Party (CHP) and the İyi Party met with Karamollaoğlu to discuss a joint alliance. Karamollaoğlu proposed Abdullah Gül as a joint candidate, but heavy opposition from the CHP and the insistence of Meral Akşener on being her own party's candidate led to this proposal being rejected.\nThe SP conducted an internal poll of four candidates, which emerged with Temel Karamollaoğlu being announced as the party's candidate on 1 May. Early in the evening of May 4, 2018, it was announced that Karamollaoğlu received 44,967 signatures, representing a deficit of 55,033. As of May 6, 2018, Karamollaoğlu received 135,945 signatures, becoming the second out of the four candidates to cross the threshold.\n{| class=\"wikitable\" style=\"margin:1em auto; font-size:90%; text-align:center;\"\n|-\n|\n|\n|\n|\n|-\n! style=\"width:100px; font-size:100%; background:;\"|\n! style=\"width:100px; font-size:100%; background:#fdc400;\"|\n! style=\"width:100px; font-size:100%; background:;\"|\n! style=\"width:100px; font-size:100%; background:;\"|\n|-\n| style=\"width:100px; font-size:100%; background:#DEFDE6;\"| Temel Karamollaoğlu\n| Abdullah Gül\n| Haşim Kılıç\n| Abdüllatif Şener\n|-\n| style=\"width:100px; font-size:100%; background:#DEFDE6;\"| Felicity Party leader\n| Former President\n| Former President of the Constitutional Court\n| Former Deputy Prime Minister of Turkey\n|-\n| style=\"width:100px; font-size:100%; background:#DEFDE6;\"| Nominated\n| Declined\n| Speculated\n| Speculated\n|}\n*Temel Karamollaoğlu , former Mayor of Sivas and leader of the SP (nominated 1 May 2018)\n*Abdullah Gül, former President of Turkey (declined 28 April 2018)\n*Haşim Kılıç, former President of the Constitutional Court\n*Abdüllatif Şener, former Deputy Prime Minister of Turkey\nOthers\nA number of candidates also announced their interest in contesting the presidency. These included nominees of smaller parties and independents. Akşener, Karamollaoğlu, Perinçek and Öz were the only candidates that applied by the deadline required for the collection of 100,000 signatures.\n{| class=\"wikitable\" style=\"margin:1em auto; font-size:90%; text-align:center;\"\n|-\n|\n|\n|\n|\n|\n|-\n! style=\"width:100px; font-size:100%; background:;\"|\n! style=\"width:100px; font-size:100%; background:;\"|\n! style=\"width:100px; font-size:100%; background:;\"|\n! style=\"width:100px; font-size:100%; background:;\"|\n! style=\"width:100px; font-size:100%; background:;\"|\n|-\n| style=\"width:100px; font-size:100%; background:#DEFDE6;\"| Doğu Perinçek\n| style=\"width:100px; font-size:100%; background:#DEFDE6;\"| Vecdet Öz\n| Sinan Oğan\n| Tuna Bekleviç\n| Levent Gültekin\n|-\n| style=\"width:100px; font-size:100%; background:#DEFDE6;\"| VATAN leader\n| style=\"width:100px; font-size:100%; background:#DEFDE6;\"| Justice Party (AP) leader\n| Former MHP MP\n| Economist\n| Journalist\n|-\n| style=\"width:100px; font-size:100%; background:#DEFDE6;\"| Nominated\n| style=\"width:100px; font-size:100%; background:#DEFDE6;\"| Nominated\n| Declared\n| Declared\n| Declared\n|}\n*Doğu Perinçek, leader of the Patriotic Party (announced 27 January 2018)\n*Vecdet Öz, leader of the Justice Party (AP), nominated as the joint candidate of the AP, True Path Party and Motherland Party (ANAP)\n*Sinan Oğan, former MHP Member of Parliament for Iğdır (declared interest 18 April 2017, suspended from MHP on 19 July 2017).\n*Tuna Bekleviç, Former consultant to the Ministry of European Union Affairs and leader of the Hayır Party (announced 26 September 2017)\n*Levent Gültekin, journalist (announced 18 April 2018)\n*Necdet Can, candidacy rejected by the Supreme Electoral Council\n*Selami Karagöz, candidacy rejected by the Supreme Electoral Council\n*Bülent Gürkut, candidacy rejected by the Supreme Electoral Council\nSignature collection process\nVoters were able to give signatures to their preferred presidential candidate between 4 May and 9 May at their local electoral council branch. They were only permitted to nominate one candidate. The number of signatures needed to formally become a candidate was 100,000.\nVoters abroad were not eligible to give signatures, prompting Perinçek to appeal to the Constitutional Court, arguing that the YSK had violated the rights of Turkish citizens abroad. Overseas citizens were, however, allowed to send a signed declaration by post to their local electoral council in Turkey. Only 72 overseas citizens did so, with 17 signing for Akşener, 18 signing for Karamollaoğlu, 35 signing for Perinçek and no signatures for Öz.\n{| class=wikitable style=\"font-size:90%;\"\n|-\n!rowspan=\"2\" colspan=\"2\"|Party\n!rowspan=\"2\"|Candidate\n! colspan=\"6\"|Daily signatures\n!rowspan=\"2\"| Result\n|-\n!width=\"90px\"| May 4\n!width=\"90px\"| May 5\n!width=\"90px\"| May 6\n!width=\"90px\"| May 7\n!width=\"90px\"| May 8\n!width=\"90px\"| May 9\n|-\n|style=\"background: \"| || İYİ || Meral Akşener || style=\"background: #DEFDE6\" | 127,850}} ||style=\"background: #DEFDE6\" | ||style=\"background: #DEFDE6\" |  ||style=\"background: #DEFDE6\" |  ||style=\"background: #DEFDE6\" |\n| style=\"background: #DEFDE6\" |  ||style=\"background: #DEFDE6\" |  Nominated}}\n|-\n|style=\"background: \"| || SP || Temel Karamollaoğlu\n|||||| style=\"background: #DEFDE6\" | 135,945}} || style=\"background: #DEFDE6\" | ||style=\"background: #DEFDE6\" |\n| style=\"background: #DEFDE6\" |  || style=\"background: #DEFDE6\" |  Nominated}}\n|-\n|style=\"background: \"| || VATAN || Doğu Perinçek\n|||||||||||| style=\"background: #DEFDE6\" |  118,575}} || style=\"background: #DEFDE6\" |  Nominated}}\n|-\n|style=\"background: \"| || AP || Vecdet Öz\n||||||||||||  || style=\"background: #FF9595\" |  Not nominated}}\n|-\n! colspan=3|Totals !!!!!!!!!!!!!!\n|-\n|}\nReferences"
    }
  ]
}