{
  "content": [
    {
      "type": "text",
      "text": "# 2018 Central Queensland bushfires\n\n|structures=36 Destroyed, 89 Damaged}}\nThe 2018 Central Queensland bushfires were a series of 1,250 bushfires which ignited and moved across areas of the Central Queensland region of Australia in November and December 2018, during the 2018-19 Australian bushfire season.\nSummary\nWith much of the region experiencing hot, dry and gusty weather conditions during the event, the Queensland Fire and Emergency Services took the unprecedented step of upgrading the fire risk in the Capricornia and Central Highlands and Coalfields weather forecast districts in Central Queensland to the highest level of \"catastrophic\". Following this, a number of bush fires already burning throughout the region flared up and began moving quickly through dry vegetation, making it difficult for firefighters to control.\nThe local government areas of Bundaberg, Gladstone, Rockhampton and Mackay were most seriously affected by the fires.  This included the communities of Deepwater, Baffle Creek, Rules Beach, Agnes Water, Oyster Creek, Captain Creek, Winfield, Mount Larcom, Ambrose, Gracemere, Kabra, Stanwell, The Caves, Campwin Beach, Sarina Beach, Finch Hatton, Eungella and Bloomsbury.\nThere was one fatality during the event when a man was killed by a falling tree while clearing a firebreak on a property near Rolleston in the Central Highlands Region.\nNine dwellings, and 27 sheds were destroyed by the fires while another 17 dwellings, 72 sheds and 28 vehicles sustained damage. Approximately 1.4 million hectares was burnt out during the event, destroying sugarcane and banana crops as well as 110,000 hectares of the Eungella National Park.\nAccording to Queensland Government statistics, the fires were fought by 4,200 firefighters, including 1,200 brought in from other Australian states, with 59 aerial firefighting aircraft used to drop 12 million litres of suppressant onto the fires in a bid to stop them spreading.\nMore than 70 schools and early education centres were closed during the fires, including Mount Larcom State School where an agricultural shed was destroyed when a fire front arrived at the township.\nDuring the fires, residents of Bloomsbury were critical of the apparent lack of support and direction from Mackay Regional Council in relation to a bushfire burning in their area.  However, Mackay mayor Greg Williamson said the council had not received any request for assistance at Bloomsbury but were aware there were rural fire brigades on the ground attempting to save properties.\nEvacuations\nMany residents from various affected communities were evacuated including those in Deepwater, Baffle Creek, Mount Larcom, Campwin Beach and Sarina Beach.\nThe town of Gracemere, to the immediate south-west of the city of Rockhampton was also completely evacuated when a fast-moving fire front travelling through Stanwell and Kabra threatened the town.   Gracemere's 8,000 residents were forced to travel into Rockhampton where an evacuation centre was established at the Rockhampton Showgrounds.\nThe efforts of firefighters were credited with saving Gracemere, and residents were allowed to return to their homes the following day.   However, it's believed the bushfires came very close to causing significant damage to the community.\nIncidents during bushfires\nDuring the event, two men were arrested in separate incidents for allegedly attempting to light fires in the Rockhampton area.  A 26-year-old man was arrested and charged with one count of endanger property by fire for allegedly trying to set fire to vegetation in the Rockhampton suburb of Kawana.  A 27-year-old man was arrested after allegedly trying to start a grass fire beside the Burnett Highway in the locality of Port Curtis.  Another man was fined $750 after pleading guilty to one charge of lighting an unauthorised fire during a fire ban, when he attempted to perform a backburn on a property near Yeppoon Road, north-east of Rockhampton.\nThe distraction of the Central Queensland bushfires is what a Queensland funeral driver said in court caused him to drive off with a corpse of a stillborn baby on the roof of his vehicle which then fell onto the roadside, following a transfer between vehicles on the Sunshine Coast while it was being transported from Rockhampton to Brisbane.  The driver said he had become distracted by the fires in Gracemere where his family was being evacuated.  The corpse was later found by roadworkers.  The driver was fined $5000 after pleading guilty to misconduct with regard to a corpse.\nPolitical reaction\nQueensland Premier Annastacia Palaszczuk visited affected bushfire areas with Queensland Fire Commissioner Katarina Carroll during the event.  Deputy Prime Minister Michael McCormack also visited affected areas.  On 9 December 2018, Palaszczuk appointed Major General Stuart Smith to assist bushfire impacted communities in their long-term recovery.\nFollowing the event, a political debate occurred when critics of Queensland Government's newly legislated tree clearing laws, questioned whether the strict laws made it harder for landholders to legally clear land before the fires broke out, contributing to a heavier fuel load and exacerbating the severity of the fires.   Palaszczuk denied this and blamed climate change for the fires.\nIn April 2019, a disaster recovery plan to support the Central Queensland communities affected by the 2018 bushfires was released by the Queensland Government.\nFollowing a request by State Minister for Fire and Emergency Services, Craig Crawford, for a review into the effectiveness of the Queensland disaster management system in its preparation and response to the bushfires, the Inspector-General of Emergency Management, Iain Mackenzie, delivered the independent 2018 Queensland Bushfires Review Report in June 2019.  The Queensland Government accepted, or accepted-in-principle, all 23 recommendations made in the report.\nHowever, the report's findings were criticised by Opposition Leader Deb Frecklington, Shadow Emergency Services Minister Lachlan Millar and Federal Minister for Emergency Services David Littleproud.  Frecklington said the report failed to address key disaster prevention concerns, while Millar said it was unacceptable the report didn't make any recommendations relating to issues surrounding the alleged mismanagement of state-controlled land and the timely approval of fire permits.  Littleproud said the state government needed to apologise to farmers as the report had found landholders couldn't clear appropriate fire breaks without breaking the government's vegetation management laws.\nReferences"
    }
  ]
}