{
  "content": [
    {
      "type": "text",
      "text": "# 2019 state visit by Donald Trump to the United Kingdom\n\nFrom 3 to 5 June 2019, the president of the United States, Donald Trump, made a state visit to the United Kingdom with his wife, the first Lady of the United States, Melania Trump. He was received by Queen Elizabeth II at Buckingham Palace and stayed at Winfield House, and later met Prime Minister Theresa May at 10 Downing Street where they held a joint news conference to discuss a range of topics, including Brexit. The Trumps had previously met the Queen at Windsor Castle in July 2018, and Trump had expressed his admiration for her.\nThis was Trump's first state visit to the United Kingdom, which occurred during his first presidency, the second occurring in September 2025 when he was received by King Charles III during his second presidency.\nSchedule\n3 June\nOn the first day, President Donald Trump and his wife, First Lady Melania Trump, landed at Stansted Airport and taken to Winfield House. They then arrived at Buckingham Palace by helicopter and were received by Charles, Prince of Wales (later King Charles III) and Camilla, Duchess of Cornwall (later Queen Camilla). They were then taken to the West Terrace of the palace where they were greeted by Queen Elizabeth II. 41-gun salutes were fired in Green Park and from the Tower of London to mark their arrival. This was followed by the inspection of the Guard of Honour by the Nijmegen Company Grenadier Guards by Trump, a private lunch with members of the British royal family, and viewing items from the Royal Collection. The couple was then accompanied by Prince Andrew, Duke of York to lay a wreath at the grave of the Unknown Warrior at Westminster Abbey and they were hosted by the Prince of Wales and the Duchess of Cornwall for an afternoon tea at Clarence House. The President and the First Lady attended a state banquet at Buckingham Palace in the evening, hosted by the Queen in their honour. In her speech the Queen spoke of demonstrating \"the immense importance that both our countries attach to our relationship\". Trump in return described the Queen as a \"constant symbol of these priceless traditions\" of freedom and sovereignty.\n4 June\nIn the morning, President Trump attended a business breakfast with Prime Minister Theresa May at St James's Palace in the presence of the Duke of York, while First Lady Melania Trump attended a 10 Downing Street garden party and visited the Churchill War Rooms with the prime minister's husband Philip May. President Trump then held bilateral talks with the Prime Minister at Downing Street. During a joint press conference, Trump praised May's handling of Brexit. Brexit Party leader Nigel Farage headed to Winfield House for a meeting with Trump and later described Trump as a believer in Brexit. The couple then hosted the Prince of Wales and the Duchess of Cornwall for dinner at Winfield House. The First Lady was reported to have overseen the preparation of the menu, guest list, seating charts and flowers.\n5 June\nThe President and the First Lady attended commemorations for the 75th anniversary of D-Day in Portsmouth alongside other heads of state and government and bid farewell to the Queen at the end of the service.\nOpposition and protests\nA group of 100 protestors gathered outside Buckingham Palace ahead of the state banquet, though Trump also referenced \"tremendous crowds of well wishers\" in his tweets. Both the Labour leader Jeremy Corbyn and Liberal Democrat leader Sir Vince Cable declined an invitation to the state banquet due to their opposition to Trump's political positions and policies. John Bercow, the speaker of the House of Commons, stated that he would not allow President Trump to address the UK Parliament and similarly declined an invitation to the state banquet. On 4 June, protestors flew a Donald Trump baby balloon in Parliament Square and Labour leader Jeremy Corbyn addressed protestors at a rally of thousands at Trafalgar Square. The mayor of London, Sadiq Khan, had previously argued that the invitation for a state visit should have been rescinded. Trump in turn described both Corbyn and Khan as \"negative forces\" and stated that he had refused a meeting with Corbyn. The Guardian reported that contracts placed by the United States Department of State showed U.S. taxpayers spent more than $1.5 million alone on hotel accommodations for Trump and his family in addition to costs for chauffeured vehicles and back-up generators.\nGallery\nFile:President Trump and First Lady Melania Trump Arrive at London Stansted Airport (47999967618).jpg|President Trump and First Lady Melania Trump arriving at Stansted Airport.\nFile:President Trump and First Lady Melania Trump's Trip to the United Kingdom (48007685091).jpg|The President and the First Lady are greeted by the Prince of Wales and the Duchess of Cornwall after disembarking Marine One at Buckingham Palace.\nFile:President Trump and First Lady Melania Trump's Trip to the United Kingdom (48000120943).jpg|President Trump and First Lady Melania Trump with Queen Elizabeth II at the West Terrace of Buckingham Palace, listening to the U.S. national anthem being played by the band of the Grenadier Guards.\nFile:President Trump and First Lady Melania Trump's Trip to the United Kingdom (48007720513).jpg|The President and the First Lady viewing items of significance to the U.S. from the Royal Collection alongside the Queen.\nFile:President Trump and First Lady Melania Trump's Trip to the United Kingdom (48007684146).jpg|President Trump and First Lady Melania Trump laying a wreath at the grave of the Unknown Warrior at Westminster Abbey as the Duke of York (left) looks on.\nFile:President Trump and First Lady Melania Trump's Visit to the United Kingdom (48007906747).jpg|From left to right: The President, the Queen, the First Lady, the Prince of Wales and the Duchess of Cornwall pose for a photograph head of the state banquet at Buckingham Palace.\nFile:The President and First Lady in the U.K. (48051546872).jpg|President Trump and First Lady Melania Trump with Prime Minister Theresa May and her husband Philip May outside 10 Downing Street.\nFile:Trump and May at a 2019 press conference in London.jpg|President Trump and Prime Minister May holding a joint press conference in the afternoon of 4 June.\nFile:President Trump and First Lady Melania Trump at Winfield House (48008208457).jpg|The President and the First Lady hosting the Prince of Wales and the Duchess of Cornwall for dinner at Winfield House.\nFile:75th anniversary of the landing of Allied forces in Normandy 02.jpg|The President and the First Lady attending commemorations for the 75th anniversary of D-Day alongside the Queen, the Prince of Wales, Prime Minister May and other heads of state and government.\nReferences"
    }
  ]
}