{
  "content": [
    {
      "type": "text",
      "text": "# 2019 Calamba Beechcraft King Air crash\n\n| summary = Loss of control\n| site = Agojo Resort, Pansol, Calamba, Laguna, Philippines\n| coordinates =\n| total_fatalities = 9\n| total_injuries = 2\n| occupants = 9\n| passengers = 7\n| crew = 2\n| fatalities = 9\n| survivors = 0\n| aircraft_type = Beechcraft B300 King Air 350\n| aircraft_name =\n| operator = Lionair (Philippines)\n| tail_number = RP-C2296\n| origin = Dipolog Airport, Zamboanga del Norte, Philippines\n| destination = Ninoy Aquino International Airport, Manila, Philippines\n| ground_injuries = 2\n}}\nOn September 1, 2019, a Beechcraft King Air 350 crashed into a tourist resort in Calamba, Laguna, Philippines while performing a medevac flight from Dipolog to Manila. All nine occupants aboard were killed in the crash.\nAccident\nAccording to the Civil Aviation Authority of the Philippines (CAAP), the aircraft with registration RP-C2296, which had taken off from Dipolog Airport in Zamboanga del Norte at 1:40pm local time (UTC+8), was bound for Ninoy Aquino International Airport in Manila when it lost radar contact with air traffic control (ATC) at around 3.10pm, while flying 37 miles (60 km) south of Manila. Witnesses nearby reported that the aircraft trailed smoke before plummeting onto the ground.\nThe aircraft crashed and bursted into flames at the privately owned Agojo Resort in Pansol,Calamba, Laguna near the foothills of Mount Makiling, killing all nine occupants aboard and injuring two others on the ground. Among the dead were a patient being transported and his wife.\nDebris from the aircraft landed in separate locations of the subdivision, suggesting that the aircraft disintegrated mid-air. A number of residential houses were destroyed in the blaze, and a nearby resort had a wall damaged in the fiery crash. The accident occurred during the country's monsoon season, when a small number of tourists visit Pansol's resorts compared to the dry season which ended in June.\nAftermath\nFollowing another aircraft crash of an IAI Westwind II at Ninoy Aquino International Airport just months after the accident, the Civil Aviation Authority of the Philippines (CAAP) grounded the entire Lionair fleet while both crashes were still under investigation.\nInvestigation\nThe Civil Aviation Authority of the Philippines (CAAP) and the Aircraft Accident Investigation and Inquiry Board (AAIIB) were dispatched to the scene to investigate the accident. The aircraft's cockpit voice recorder, which was badly damaged, was retrieved from the crash site and was brought to Australia for analysis.\nThe CAAP said that it has partial information to determine the cause, but would release its final report once the AAIIB has concluded its investigation.\nAccording to the final report released by CAAP, the aircraft encountered adverse weather conditions which led to the aircraft's loss of control in-flight and subsequent breakup. Contributory cause factors to the accident are the presence of inclement weather conditions en route, failure of the pilot to maintain situational awareness and the failure of CRM to apply proper procedures during the situation they encountered.\nReferences\nExternal links\n*"
    }
  ]
}