{
  "content": [
    {
      "type": "text",
      "text": "# 2019 Democratic Republic of the Congo Senate election\n\nSenate elections were held in the Democratic Republic of the Congo on 14 March 2019 to elect the 108 Senators. Former DRC President Joseph Kabila, who stepped down from office in January 2019 following the inauguration of the recently elected Félix Tshisekedi, has also joined the upper house of the legislature as a senator for life, for a total of 109 seats.\nBackground\nThe Senate is elected indirectly by the 780 members of the provincial assemblies.\nThis Senate election was postponed one year from an earlier date in June 2012 and another year from a later date in June 2013. The Independent National Electoral Commission (CENI) planned on holding them in early 2016, but they did not occur.\nOn 30 December 2018, a general election was held that resulted in opposition leader Félix Tshisekedi being elected president. Incumbent President Joseph Kabila, in office since 2001 and whose constitutional mandate ended in 2016, stepped down from office in January 2019, when Tshisekedi was inaugurated. This was the first democratic transition of power in the DRC since it gained independence from Belgium in 1960. As a former president, Kabila will be a senator for life, according to the DRC's constitution. Kabila-allied parties gained a majority in both the National Assembly and the provincial assemblies, which were also elected on that date.\nResults\nThe election for the eight seats from the provinces of North Kivu and Mai-Ndombe were delayed.\nAftermath\nA police officer was killed during protests in the city of Mbuji-Mayi over the massive victory of the Common Front for Congo (FCC) coalition, supported by former President Joseph Kabila. Protests were also held in Kinshasa. Recently inaugurated President Félix Tshisekedi has pledged to reform the country, but his ability to do this will be limited by the fact that the pro-Kabila FCC has the majority of seats in both the National Assembly and also the Senate. Supporters of Tshisekedi's UPDS party protested in Kinshasa and Tshisekedi's strongholds in the central DRC because they alleged that the results were rigged, and party supporters also attacked offices of FCC legislators in Kasaï-Oriental province. In Kinshasa, protests occurred outside the parliament building. Allegations have been made that provincial assemblymen were bribed to vote for the FCC.\nReferences"
    }
  ]
}