{
  "content": [
    {
      "type": "text",
      "text": "# 2019 WTA Awards\n\nAshleigh Barty\n| most_improved_player_of_the_year =  Sofia Kenin\n| newcomer_of_the_year             =  Bianca Andreescu\n| comeback_player_of_the_year      =  Belinda Bencic\n| previous = 2018\n| next     = 2020\n}}\nThe 2019 WTA Awards are a series of awards given by the Women's Tennis Association to players who have achieved something remarkable during the 2019 WTA Tour.\nThe awards\nThese awards are decided by either the media, the players, the association, or the fans. Nominees were announced by the WTA's Twitter account and on the WTA official website.\n:Note: award winners in bold\nPlayer of the Year\n* Ashleigh Barty\n* Karolína Plíšková\n* Naomi Osaka\n* Simona Halep\n* Bianca Andreescu\nDoubles Team of the Year\n* Elise Mertens &  Aryna Sabalenka\n* Hsieh Su-wei &  Barbora Strýcová\n* Tímea Babos &  Kristina Mladenovic\n* Samantha Stosur &  Peng Shuai\nMost Improved Player of the Year\n* Belinda Bencic\n* Sofia Kenin\n* Alison Riske\n* Donna Vekić\n* Amanda Anisimova\n* Zheng Saisai\nNewcomer of the Year\n* Bianca Andreescu\n* Coco Gauff\n* Dayana Yastremska\n* Karolína Muchová\n* Elena Rybakina\n* Iga Świątek\nComeback Player of the Year\n* Belinda Bencic\n* Svetlana Kuznetsova\n* Bethanie Mattek-Sands\nKaren Krantzcke Sportsmanship Award\n* Petra Kvitová\nPeachy Kellmeyer Player Service Award\n* Gabriela Dabrowski\nDiamond Aces\n* Kiki Bertens\nWTA Coach of the Year\n* Craig Tyzzer (worked with  Ashleigh Barty)\n* Torben Beltz  (worked with  Donna Vekić)\n* Sylvain Bruneau (worked with  Bianca Andreescu)\nFan Favourite Player\n* Johanna Konta\n* Iga Świątek\n* Sloane Stephens\n* Markéta Vondroušová\n* Maria Sharapova\n* Elina Svitolina\n* Petra Kvitová\n* Amanda Anisimova\n* Donna Vekić\n* Ashleigh Barty\n* Hsieh Su-wei\n* Belinda Bencic\n* Simona Halep\n* Maria Sakkari\n* Venus Williams\n* Dayana Yastremska\n* Serena Williams\n* Sofia Kenin\n* Bianca Andreescu\n* Kiki Bertens\n* Karolína Plíšková\n* Karolína Muchová\n* Naomi Osaka\n* Petra Martić\n* Alison Riske\n* Aryna Sabalenka\n* Madison Keys\n* Elise Mertens\n* Angelique Kerber\nFan Favorite WTA Shot of the Year\n* Simona Halep, second round of Dubai Championships (31%)\n* Iga Świątek, semifinals of Lugano Open (40%)([https://www.youtube.com/watch?v=HLvsjOaxOWY])\n* Patricia Maria Țig, semifinals of Bucharest Open (5%)\n* Elina Svitolina, round robin of WTA Finals (24%)\nFan Favorite WTA Match of the Year\n* Naomi Osaka vs  Bianca Andreescu, China Open quarterfinals (5–7, 6–3, 6–4)([https://www.youtube.com/watch?v=qkdBjsKE9b4])\nFan Favorite Grand Slam Match of the Year\n* Naomi Osaka vs  Petra Kvitová, Australian Open final (7–6, 5–7, 6–4)([https://www.youtube.com/watch?v=uCj5XgNwKYk&feature=emb_title ])\nThe awards and honours of the decade (2010s)\nIn December 2019 WTA announced five top 10 categories of different aspects which marked 2010s in WTA tennis.\nTop 10 Rivalries of the Decade\n#  Serena Williams vs  Venus Williams, 18–12 (four times at Majors in 2010s, including 2017 Australian Open final) ([https://www.youtube.com/watch?v=Ft6KmWh7cj0 ])\n#  Maria Sharapova vs  Simona Halep, 7–2 (most matches went to third set, includes Sharapova's three set victory in 2014 French Open final)\n#  Angelique Kerber vs  Karolína Plíšková, 7–5 (five matches in finals, including Kerber's three set victory in 2016 US Open final)\n#  Serena Williams vs  Maria Sharapova, 20–2 (Serena won 19 matches since Maria was leading the head to head 2–1 in 2004)\n#  Petra Kvitová vs  Agnieszka Radwańska, 8–5 (including Radwańska's three set victory in final at 2015 WTA Finals)\n#  Victoria Azarenka vs  Li Na, 6–5 (including Azarenka's three set victory in 2013 Australian Open final)\n#  Belinda Bencic vs  Naomi Osaka, 3–0 (Bencic ended Osaka's title defence at 2019 Indian Wells and 2019 US Open)\n#  Maria Sharapova vs  Li Na, 10–5 (played 9 times in 2010s, 2 Major semifinal matches)\n#  Simona Halep vs  Elina Svitolina, 5–5 (most of the matches being played in the final stages of the biggest tournaments)\n#  Serena Williams vs  Karolína Plíšková, 2–2 (three of the four matches happened at Majors)\nTop 10 Streaks of the Decade\n#  Serena Williams, winning second \"Serena Slam\", 2014–15 non-calendar year Grand Slam ([https://www.youtube.com/watch?v=AKkKOdKwi78 ])\n# 2019 season, 18 different tournaments, 18 different champions at the start of the year\n#  Victoria Azarenka, 26-match win streak, ascent to world No. 1 and first Major at Australian Open to start the 2012 season\n#  Martina Hingis &  Sania Mirza, 41-match winning streak in doubles during 2015–16\n#  Bianca Andreescu, 8–0 vs top 10 in 2019\n#  Caroline Wozniacki, 2010 season 32–4 record after Wimbledon, including 4 titles and becoming world No. 1\n#  Belinda Bencic, 4–0 vs world No. 1s\n#  Serena Williams, 20-match win streak in Miami from 2013 to 2016 which included 3 titles\n#  Johanna Konta, 2015 season translate from ITF tour to having success at US Open and Wuhan\n#  Aryna Sabalenka, having a perfect record at Premier 5 tournament in Wuhan, which includes two titles in a row (2018–2019)\nTop 10 Comebacks of the Decade\n#  Serena Williams, comeback after maternity leave, reaching four Major finals, the first coming just 10 months after giving birth ([https://www.youtube.com/watch?v=AU0WJIk4br0 ])\n#  Petra Kvitová, comeback in just six months from stabbing, to win Birmingham just two weeks back\n#  Bethanie Mattek-Sands, comeback from injury to win US Open in mixed doubles, a year after dislocating her knee cap\n#  Martina Hingis, comeback from retirement in 2013 to play doubles, winning eventually four Majors and having 41-match winning streak during 2015–16\n#  Ashleigh Barty, return to tennis in early 2016 after playing cricket during two-year-hiatus from tennis, going on to win her first Major and finishing 2019 as the world No. 1\n#  Venus Williams, comeback after Sjögrens Syndrome diagnosis in 2011, winning Olympic gold less than year later, and reaching two Major finals in 2017\n#  Justine Henin, comeback from retirement after 18 months in 2010, reaching immediately finals of Sydney and Australian Open\n#  Belinda Bencic, comeback from injury to reach again top 10 in 2019 after three years and winning Dubai and Moscow\n#  Elena Vesnina, comeback from injury to win Olympic gold in doubles and Indian Wells in singles\n#  Victoria Azarenka, comeback after maternity leave, climbing from No. 978 to the top 50 in 2017\nTop 10 Upsets of the Decade\n#  Roberta Vinci vs  Serena Williams, semifinals of 2015 US Open (2–6, 6–4, 6–4), Vinci playing first Slam semifinal and being outside top 40, ended Serena's Calendar Slam hunt ([https://www.youtube.com/watch?v=1G72-g05eM0 ])\n#  Monica Puig vs  Angelique Kerber, final of the 2016 Olympics (6–4, 4–6, 6–1), Puig winning the gold unseeded and beating three Grand Slam champions and two current top 3 players\n#  Jeļena Ostapenko vs  Simona Halep, final of 2017 French Open (4–6, 6–4, 6–3), Ostapenko winning first Slam and also title of any kind at 20 years old, being ranked No. 47\n#  Dominika Cibulková vs  Angelique Kerber, final of 2016 WTA Finals (6–3, 6–4), Cibulková winning the tournament after first going 0–2 in round robin and avenging loss to Kerber in that stage\n#  Bianca Andreescu vs  Angelique Kerber, final of 2019 Indian Wells (6–4, 3–6, 6–4), Andreescu becoming first wild card champion in Indian Wells at 18 years old\n#  Li Na vs  Caroline Wozniacki, semifinals of 2011 Australian Open (3–6, 7–5, 6–3), Li saving match point to become first Chinese Major finalist and later that year a champion\n#  Victoria Azarenka vs  Maria Sharapova, final of 2012 Australian Open (6–3, 6–0), Azarenka winning 12 of the last 13 games in her first Major final\n#  Flavia Pennetta vs  Li Na, semifinals of 2014 Indian Wells (7–6, 6–3), Pennetta going on to win the title in less than a year after comeback from injury\n#  Hsieh Su-wei vs  Agnieszka Radwańska, third round of 2018 Australian Open (6–2, 7–5), with Hsieh being ranked at No. 88\n#  Ashleigh Barty vs  Petra Kvitová, quarterfinals of 2019 Miami Open (7–6, 3–6, 6–2), Barty winning first match of rivalry after previously being down 4–0\nTop 10 WTA Outfits of the Decade\n#  Maria Sharapova, 2017 US Open ([https://www.youtube.com/watch?v=rZYIvd6E_rU ])\n#  Maria Sharapova, 2017 US Open (second outfit)\n#  Naomi Osaka, 2019 US Open\n#  Serena Williams, 2015 Australian Open\n#  Caroline Wozniacki, 2010 US Open\n#  Sorana Cîrstea, 2019 French Open\n#  Andrea Petkovic, 2018 Australian Open\n#  Venus Williams, 2017 Australian Open\n#  Ana Ivanovic, 2016 US Open\n#  Kristina Mladenovic, 2017 Wimbledon\nReferences"
    }
  ]
}