{
  "content": [
    {
      "type": "text",
      "text": "# 2020 Alaska Democratic presidential primary\n\n| party_name = no\n}}\n{| class=\"wikitable sortable\" style=\"font-size:90%;text-align:center;float:right;padding:5px;\"\n! colspan=\"2\"| Pledged nationalconvention delegates\n|-\n! Type\n!\n|-\n| CD at-large\n| 9\n|-\n|\n| 2\n|-\n| At-large\n| 4\n|-\n! Total pledged delegates\n! 15\n|}\nThe 2020 Alaska Democratic presidential primary had been scheduled to take place on April 4, 2020, in the Democratic Party primaries for the 2020 presidential election, but in-person voting was cancelled due to the COVID-19 pandemic and mail-in voting was extended to April 10, 2020. The Alaska primary was a closed party-run primary, with the state awarding 19 delegates to the 2020 Democratic National Convention, of which 15 were pledged delegates allocated on the basis of the results of the primary. Voters cast ranked-choice voting ballots, with a voter's ballot counting for four ranked backup choices if their original choice was in last place and below the 15 percent threshold for winning delegates.\nFormer vice president and presumptive nominee Joe Biden won the rather narrow primary, taking 55% of the vote and 8 delegates after the distribution of preferences compared to senator Bernie Sanders' 44% and one delegate less. On the count of first choices, Biden and Sanders had taken approximately 50% and 39% of the vote, while 11% were spread between six other candidates who had withdrawn from the race, including 7% for senator Elizabeth Warren. On the final count, around 1% of votes were inactive, as they did not include a choice for one of the candidates that had overcome the 15 percent hurdle.\nOf the 2,133 first round votes (10.8%) not cast for Biden or Sanders, overall, 45.6% went to Biden, 46.4% to Sanders and 8% to neither (i.e., were inactive). Of those who did give a preference for Biden or Sanders, 49.5% went to Biden, 50.5% to Sanders; this slight advantage for Sanders was not enough to overcome Biden's lead for winning the state.\nProcedure\nAlaska had been scheduled to hold its primary on April 4, 2020, a Saturday, along with the Hawaii and Louisiana primaries and Wyoming caucuses on the same day, but because of the COVID-19 pandemic the state party decided on March 23, 2020 that all voting had to occur by mail instead and that ballots received by April 10 would be counted. The Alaska Democratic Party's draft delegate selection plan had called for a party-run primary using ranked-choice voting, abandoning the caucus system used in past years and matching a national trend for primaries. After the first round of vote-counting, when candidates had less than 15% of the vote, the candidate with the fewest votes was eliminated and votes for that candidate were applied to the voter's next choice. This process was repeated until all remaining candidates met the 15% threshold.\nVoting with paper ballots was originally expected to take place throughout the state from 10:00&nbsp;a.m. until 2:00&nbsp;p.m. on a Saturday (though some parts of the Alaska Democratic Party's delegate selection plan made note of a voting period between 9:00&nbsp;a.m. and 12:00&nbsp;p.m.). Prospective voters would also have had the option to cast electronic and absentee ballots between March 3 and March 24 given the short voting window; this period was then extended to include all ballots arriving by April 10, as in-person voting had been cancelled. In the party-run closed primary, candidates had to meet a threshold of 15 percent statewide (coterminous with the state's sole congressional district) in order to be considered viable.\nThe 15 pledged delegates to the 2020 Democratic National Convention were allocated proportionally on the basis of the results of the primary. Of these, 9 were district delegates allocated in proportion to the statewide result, and another 2 were allocated to party leaders and elected officials (PLEO delegates), in addition to 4 at-large delegates, both also according to the statewide result. Originally planned with 14 delegates, the final number included a 10% bonus of 1 additional delegate on the 9 district and 3 at-large delegates by the Democratic National Committee due to the April date, which belonged to Stage II on the primary timetable.\nFollowing the primary, precinct and house district caucuses met on April 18, 2020 and elected delegates to the state convention. On May 16, 2020, the state convention elected all delegates for the Democratic National Convention. The delegation also included 4 unpledged PLEO delegates: 4 members of the Democratic National Committee.\nCandidates\nThe following individuals appeared on the ballot in Alaska:\nRunning\n*Joe Biden\nWithdrawn\n*Michael Bloomberg\n*Pete Buttigieg\n*Tulsi Gabbard\n*Amy Klobuchar\n*Bernie Sanders\n*Tom Steyer\n*Elizabeth Warren\nThere was also an \"undeclared\" option. Bloomberg, Buttigieg, Klobuchar and Steyer had submitted their withdrawal with the Alaska Democratic Party (while the other withdrawn candidates were considered as suspended by the party), but they remained on the ballot, and votes for them were counted.\nResults\n{| class=\"wikitable sortable\" style=\"text-align:right;\"\n|+ style=\"background-color:#f2f2f2;margin-bottom:-1px;border:1px solid #aaa;padding:0.2em 0.4em;\" |2020 Alaska Democratic presidential primary final results\n! Candidate\n! Votes\n! %\n! Delegates\n|-\n| style=\"text-align:left;\" data-sort-value=\"Biden, Joe\" | Joe Biden\n| 10,834\n| 54.83\n| 8\n|-\n| style=\"text-align:left;\" data-sort-value=\"Sanders, Bernie\" | Bernie Sanders (withdrawn)\n| 8,755\n| 44.31\n| 7\n|-\n| style=\"text-align:left;\" data-sort-value=\"ZZ\" | Inactive votes\n| 170\n| 0.86\n|\n|-\n! Total\n! 19,759\n! 100%\n! 15\n|}\n{| class=\"wikitable sortable\" style=\"text-align:right;\"\n|+ style=\"background-color:#f2f2f2;margin-bottom:-1px;border:1px solid #aaa;padding:0.2em 0.4em;\" class=\"nowrap\" |Vote count by round\n|-\n! rowspan=\"2\" style=\"text-align:center;\" | Candidate\n! colspan=\"2\" | Round 1\n! colspan=\"2\" | Round 2\n! colspan=\"2\" | Round 3\n! colspan=\"2\" | Round 4\n! colspan=\"2\" | Round 5\n! colspan=\"2\" | Round 6\n! colspan=\"2\" | Round 7\n! colspan=\"2\" | Round 8\n|-\n!Votes\n!%\n!Votes\n!%\n!Votes\n!%\n!Votes\n!%\n!Votes\n!%\n!Votes\n!%\n!Votes\n!%\n!Votes\n!%\n|-\n| style=\"text-align:left;\" data-sort-value=\"Biden, Joe\" |Joe Biden\n|9,862\n|49.91\n|9,873\n|50.05\n|9,892\n|50.15\n|9,946\n|50.45\n|9,968\n|50.62\n|10,011\n|50.85\n|10,147\n|51.59\n|10,834\n|55.31\n|-\n| style=\"text-align:left;\" data-sort-value=\"Sanders, Bernie\" |Bernie Sanders (withdrawn)\n| 7,764\n|39.29\n| 7,766\n|39.37\n| 7,780\n|39.45\n| 7,796\n|39.55\n| 7,846\n|39.84\n| 7,862\n|39.93\n| 7,918\n|40.26\n| 8,755\n|44.69\n|-\n| style=\"text-align:left;\" data-sort-value=\"Warren, Elizabeth\" |Elizabeth Warren (withdrawn)\n| 1,402\n|7.10\n| 1,406\n|7.13\n| 1,415\n|7.17\n| 1,424\n|7.22\n| 1,434\n|7.28\n| 1,489\n|7.56\n| 1,604\n|8.15\n| colspan=\"2\" bgcolor=\"lightgray\" align=\"center\" |Eliminated\n|-\n| style=\"text-align:left;\" data-sort-value=\"Buttigieg, Pete\" |Pete Buttigieg (withdrawn)\n| 248\n|1.26\n| 250\n|1.27\n| 257\n|1.30\n| 268\n|1.36\n| 280\n|1.42\n| 326\n|1.66\n| colspan=\"4\" bgcolor=\"lightgray\" align=\"center\" |Eliminated\n|-\n| style=\"text-align:left;\" data-sort-value=\"Klobuchar, Amy\" |Amy Klobuchar (withdrawn)\n| 133\n|0.67\n| 137\n|0.69\n| 143\n|0.73\n| 149\n|0.76\n| 165\n|0.84\n| colspan=\"6\" bgcolor=\"lightgray\" align=\"center\" |Eliminated\n|-\n| style=\"text-align:left;\" data-sort-value=\"Gabbard, Tulsi\" |Tulsi Gabbard (withdrawn)\n| 124\n|0.63\n| 128\n|0.65\n| 130\n|0.66\n| 131\n|0.66\n| colspan=\"8\" bgcolor=\"lightgray\" align=\"center\" |Eliminated\n|-\n| style=\"text-align:left;\" data-sort-value=\"Bloomberg, Michael\" |Michael Bloomberg (withdrawn)\n| 97\n|0.49\n| 99\n|0.50\n| 106\n|0.54\n| colspan=\"10\" bgcolor=\"lightgray\" align=\"center\" |Eliminated\n|-\n| style=\"text-align:left;\" data-sort-value=\"Steyer, Tom\" |Tom Steyer (withdrawn)\n| 65\n|0.33\n| 66\n|0.33\n| colspan=\"12\" bgcolor=\"lightgray\" align=\"center\" |Eliminated\n|-\n| style=\"text-align:left;\" data-sort-value=\"ZZ\" | Undeclared\n| 64\n|0.32\n| colspan=\"14\" bgcolor=\"lightgray\" align=\"center\" |Eliminated\n|-\n! Total\n! 19,759\n!100%\n! 19,725\n!99.8%\n! 19,723\n!99.8%\n! 19,714\n!99.8%\n! 19,693\n!99.7%\n! 19,688\n!99.6%\n! 19,669\n!99.5%\n! 19,589\n!99.1%\n|}\nReferences\nExternal links\n*[https://www.thegreenpapers.com/P20/AK-D The Green Papers delegate allocation summary]\n*[https://static1.squarespace.com/static/54bee0c9e4b0441ce96c4681/t/5c9feff5ec212db222108a25/1553985527476/2020+ADP+Delegate+Selection+Plan+3.30.19.pdf Alaska Democratic Party draft delegate selection plan]"
    }
  ]
}