{
  "content": [
    {
      "type": "text",
      "text": "# 2020 Green Party presidential debates and forums\n\nThe Green presidential debates are a series of political debates between the Green candidates for president in the United States 2020 presidential election.\nPrimary debates\nIn addition to Free & Equal's open presidential debate, six debates were sponsored by the Green Party and its affiliates.\nJuly 19, 2019 – Green Party of Minnesota\nOn July 19, 2019, the Green Party had its first presidential candidate forum for 2020 election, hosted by the Green Party of Minnesota in Dayton's Bluff, Saint Paul moderated by Danielle Swift, a candidate for St. Paul City Council\nJuly 26, 2019 – Green Party PCSC\nAt the Green Party Annual National Meeting on July 26, 2019, in Salem, Massachusetts, the party's Presidential Campaign Support Committee (PCSC) sponsored a debate open to all candidates, regardless of recognition. The moderators were 2016 nominee Dr. Jill Stein and journalist Margaret Kimberley.\nAugust 11, 2019 – Missouri Green Party\nThe Missouri Green Party sponsored a presidential debate in Springfield, Missouri on August 11, 2019.\nSeptember 20, 2019 – Green Party Black Caucus\nThe party's Black Caucus sponsored a debate in Muncie, Indiana on September 20, 2019.\nOctober 19, 2019 – Green Party of Idaho\nThe Green Party of Idaho sponsored a debate in Boise, Idaho with Jayson Prettyboy of Indigenous Idaho Alliance facilitating the event.\nDecember 7, 2019 – Green Party of California\nThe last debate held in 2019 was sponsored by the Green Party of California in Fresno with the \"Not Safe For Wonks Podcast\" facilitating the debate.\nMarch 4, 2020 – Free & Equal\nFree & Equal Elections Foundation hosted its first presidential debate for 2020 on March 4, 2020, in Chicago, Illinois. The event was open to all presidential candidates from all political parties, but the only Green candidates to participate were Howie Hawkins and Sedinam Moyowasifza-Curry.\nGeneral election town hall forums and debates\nJuly 11, 2020 – C-SPAN\nC-SPAN's Washington Journal held a special Campaign 2020 segment for presumed Green nominee Howie Hawkins followed by a segment for Libertarian nominee Jo Jorgensen. Jesse J. Holland facilitated the virtual event, taking questions from live callers as is typical with the program's format.\nSeptember 24, 2020 – James Madison University\nJames Madiscon University's civic organization hosted a Green Party town hall on September 24, 2020. Green nominee Howie Hawkins and his running mate Angela Walker appeared in the event.\nOctober 8, 2020 – Free & Equal\nFree & Equal Elections Foundation hosted its second presidential debate on October 8, 2020, in Denver, Colorado, limiting participation to candidates on the ballot in at least 10 states. Green nominee Howie Hawkins was the only candidate in attendance with ballot access in enough states to conceivably win the electoral college.\nOctober 24, 2020 – C-SPAN\nC-SPAN's Washington Journal will again hold a special Campaign 2020 segment for presumed Green nominee Howie Hawkins followed by a segment for Libertarian nominee Jo Jorgensen, with Jesse J. Holland facilitating the virtual event.\nOctober 24, 2020 – Free & Equal\nFree & Equal Elections Foundation hosted its third and final presidential debate on October 24, 2020, in Cheyenne, Wyoming.  Green nominee Howie Hawkins was again the only candidate in attendance with ballot access in enough states to conceivably win the electoral college.\nSee also\n*2020 Green Party presidential primaries\n*2020 Republican Party presidential debates and forums\n*2020 Democratic Party presidential debates and forums\n*2020 Libertarian Party presidential debates and forums\nReferences"
    }
  ]
}