{
  "content": [
    {
      "type": "text",
      "text": "# 2020 Puerto Rico Democratic presidential primary\n\n}}\n{| class=\"wikitable sortable\" style=\"font-size:90%;text-align:center;float:right;padding:5px;\"\n! colspan=\"2\"| Pledged nationalconvention delegates\n|-\n! Type\n!\n|-\n| SDI\n| 4\n|-\n| SDII\n| 4\n|-\n| SDIII\n| 5\n|-\n| SDIV\n| 4\n|-\n| SDV\n| 4\n|-\n| SDVI\n| 4\n|-\n| SDVII\n| 4\n|-\n| SDVIII\n| 4\n|-\n|\n| 7\n|-\n| At-large\n| 11\n|-\n! Total pledged delegates\n! 51\n|}\nThe 2020 Puerto Rico Democratic presidential primary took place on July 12, 2020, a Sunday, in the Democratic Party primaries for the 2020 presidential election. The primary was originally scheduled for March 29, 2020, but was postponed twice because of the COVID-19 pandemic. The Puerto Rico primary was an open primary, with the territory awarding 58 delegates, of which 51 were pledged delegates allocated on the basis of the results of the primary.\nPresumptive nominee and former vice president Joe Biden won with 56%, but lost a rather unusual number of votes and delegates in the penultimate primary to withdrawn candidates, senator Bernie Sanders and former mayor Michael Bloomberg. With both of them winning around 13% and respectively five and two delegates on the district-level, together they received 26% of the vote, and spoiled ballots (blank ballots, as well as undervotes and overvotes) also made up more than 10% of the votes.\nProcedure\nThe Puerto Rico Democratic primary had been originally scheduled for June 7, 2020, but on August 2, 2019, then-governor Ricardo Rosselló signed a law that moved the date to the last Sunday in March, which would have been on March 29. Due to concerns amid the 2020 coronavirus pandemic, governor Wanda Vázquez first postponed the date to April 26, 2020, signing the approvement on March 21. Later on April 2, the local Democratic party, as it was allowed to by the territory's new law, postponed the primary indefinitely until a new date would be chosen. On May 21, the party announced the primary date for July 12, meaning it would be the penultimate contest, only before Connecticut's primary held much later in August.\nIn the open primary, candidates had to meet a threshold of 15 percent at the district level (using the senatorial districts for the territory's senate) or across the entire territory in order to be considered viable. The 51 pledged delegates to the 2020 Democratic National Convention were allocated proportionally on the basis of the results of the primary. Of these, between four and five were allocated to each of the territory's eight senatorial districts, and another seven were allocated to party leaders and elected officials (PLEO delegates), in addition to eleven at-large delegates. Due to the original March date as part of Stage I on the primary timetable, the Puerto Rico primary had received no bonus delegates.\nWhile district-level delegates for the national convention were voted on in the primary ballot, the state convention voted on July 26, 2020 on the eleven at-large and seven pledged PLEO delegates for the Democratic National Convention. In addition, if presidential candidates were entitled to more district delegates than delegate candidates presented, additional delegates were chosen at the state convention. The delegation also included seven unpledged PLEO delegates: seven members of the Democratic National Committee.\nCandidates\nThe following candidates were on the ballot in Puerto Rico:\nRunning\n*Joe Biden\nWithdrawn\n*Michael Bloomberg\n*Pete Buttigieg\n*Tulsi Gabbard\n*Amy Klobuchar\n*Bernie Sanders\n*Tom Steyer\n*Elizabeth Warren\nResults\n{| class=\"wikitable sortable\" style=\"text-align:right;\"\n|+ style=\"background-color:#f2f2f2;margin-bottom:-1px;border:1px solid #aaa;padding:0.2em 0.4em;\" | 2020 Puerto Rico Democratic presidential primary\n! style=\"text-align:left;\" | Candidate\n! Votes\n! %\n! Delegates\n|-\n| style=\"text-align:left;\" data-sort-value=\"Biden, Joe\" | Joe Biden\n| 3,930\n| 55.97\n| 44\n|-\n| style=\"text-align:left;\" data-sort-value=\"Sanders, Bernie\" | Bernie Sanders (withdrawn)\n| 932\n| 13.27\n| 5\n|-\n| style=\"text-align:left;\" data-sort-value=\"Bloomberg, Michael\" | Michael Bloomberg (withdrawn)\n| 894\n| 12.73\n| 2\n|-\n| style=\"text-align:left;\" data-sort-value=\"Gabbard, Tulsi\" | Tulsi Gabbard (withdrawn)\n| 194\n| 2.76\n| rowspan=6\n|-\n| style=\"text-align:left;\" data-sort-value=\"Buttigieg, Pete\" | Pete Buttigieg (withdrawn)\n| 158\n| 2.25\n|-\n| style=\"text-align:left;\" data-sort-value=\"Warren, Elizabeth\" | Elizabeth Warren (withdrawn)\n| 101\n| 1.44\n|-\n| style=\"text-align:left;\" data-sort-value=\"Steyer, Tom\" | Tom Steyer (withdrawn)\n| 62\n| 0.88\n|-\n| style=\"text-align:left;\" data-sort-value=\"Klobuchar, Amy\" | Amy Klobuchar (withdrawn)\n| 31\n| 0.44\n|-\n| style=\"text-align:left;\" data-sort-value=\"ZZ\" | Undervotes / Overvotes / Blank Ballots\n| 720\n| 10.25\n|-\n! Total\n! 7,022\n!100%\n!51\n|}\nReferences\nNotes\nExternal links\n*[https://www.thegreenpapers.com/P20/PR-D The Green Papers Democratic Party delegate allocation summary]\n*[https://drive.google.com/file/d/1yVPe23muQE-V6RGBlAA8zz9VJRIaggG4/view Puerto Rico Democratic Party delegate selection plan]"
    }
  ]
}