{
  "content": [
    {
      "type": "text",
      "text": "# 2020 Kansas Democratic presidential primary\n\n}}\n{| class=\"wikitable sortable\" style=\"font-size:90%;text-align:center;float:right;padding:5px;\"\n! colspan=\"2\"| Pledged nationalconvention delegates\n|-\n! Type\n!\n|-\n| CD1\n| 5\n|-\n| CD2\n| 7\n|-\n| CD3\n| 8\n|-\n| CD4\n| 6\n|-\n|\n| 4\n|-\n| At-large\n| 9\n|-\n! Total pledged delegates\n! 39\n|}\nThe 2020 Kansas Democratic presidential primary took place until May 2, 2020, in the Democratic Party primaries for the 2020 presidential election, as in-person voting had been cancelled because of the COVID-19 pandemic. The Kansas primary was a closed party-run primary, undertaken completely by mail-in voting, it was the sole contest held on that date. The state awarded 45 delegates to the 2020 Democratic National Convention, of which 39 were pledged delegates allocated on the basis of the results of the primary. Voters cast ranked choice voting ballots, with a voter's ballot counting for four ranked backup choices if their original choice was in last place and below the 15 percent threshold for winning delegates.\nFormer vice president Joe Biden won nearly 75% of the vote and 29 delegates after the distribution of preferences, while withdrawn senator Bernie Sanders picked up a little more than 22% and 10 delegates. On the initial vote Biden and Sanders had taken 70% and 18%, with the rest of the vote shared between three other options, particularly 8% for senator Elizabeth Warren. On the final count 2.5% of votes were inactive, as they did not include a choice for one of the candidates that had overcome the 15 percent hurdle.\nProcedure\nKansas was one of two contests in the Democratic primaries with in-person voting set for May 2, a Saturday, alongside the territorial Guam caucus, which was cancelled and postponed. Because of the coronavirus pandemic, in person voting was cancelled and only mail-in voting was utilized, while the date was not moved. Instead of a caucus to apportion delegates, the Kansas Democratic Party, for the first time since 1992, used a party-run primary with ranked-choice voting. Mail-in voting had been planned for March 30 until April 24, with ballots planned to be mailed to every registed Democrat in the state by April 4. Due to the pandemic every registered Democrat received mail-in ballots already on March 30, the first day to vote in the election. The postmark deadline to return completed mail-in ballots was extended to voting day, May 2. Election results were then released the next day, May 3. Kansans would have been able to utilize same-day voter registration for in-person voting.\nIn the closed party-run primary, voters ranked their top five candidates for the Democratic presidential nomination. Among candidates who did not receive a minimum 15% of all first-choice votes, the candidate with the fewest first-choices was eliminated. Voters who chose this candidate as their top choice had their votes given to their next choice. If after redistribution there were still candidates with fewer than 15% of the vote, the process repeated, round by round, until all candidates remaining had reached at least 15% of the vote. Candidates earned their proportional share of delegates, based on the percentage that each candidate received in the final round of the total tally.\nThe 39 pledged delegates to the 2020 Democratic National Convention were allocated proportionally on the basis of the results of the primary. Of these, between five and eight were allocated to each of the state's four congressional districts and another four were allocated to party leaders and elected officials (PLEO delegates), in addition to nine at-large delegates. Originally planned with 33 delegates, the final number included a 20% bonus of 6 additional delegates on the 22 district and 7 at-large delegates awarded by the Democratic National Committee due to the May date, which belonged to Stage III on the primary timetable.\nState senate district conventions met on May 9 to nominate delegates for subsequent congressional district conventions on May 16, where the district-level national convention delegates were designated. At the state convention held on June 6 the state party committee voted on at-large and pledged PLEO delegates for the Democratic National Convention. The delegation also included 6 unpledged PLEO delegates: 4 members of the Democratic National Committee, a sole representative from Congress in Sharice Davids, and the governor Laura Kelly.\nCandidates\nThe following individuals appeared on the ballot in Kansas:\n*Joe Biden\n*Tulsi Gabbard (withdrawn)\n*Bernie Sanders (withdrawn)\n*Elizabeth Warren (withdrawn)\nThere was also an uncommitted option.\nPolling\n{| class=\"wikitable\" style=\"font-size:90%;text-align:center;\"\n|- valign=bottom style=\"font-size:90%;\"\n! Poll source\n! Date(s)administered\n! Samplesize}}\n! Margin\n! JoeBiden\n! TulsiGabbard\n! BernieSanders\n! Other\n! Undecided\n|- style=\"background:lightyellow;\"\n| style=\"border-right-style:hidden;\" |\n| style=\"border-right-style:hidden;\" | Apr 8, 2020\n| colspan=\"9\" | Sanders suspends campaign\n|-\n|- style=\"background:lightyellow;\"\n| style=\"border-right-style:hidden;\" |\n| style=\"border-right-style:hidden;\" | Mar 19, 2020\n| colspan=\"9\" | Gabbard withdraws from the race\n|-\n| style=\"text-align:left;\"|Public Policy Polling\n| Mar 10–11, 2020\n| 550 (LV)\n| –\n||59%\n|3%\n|35%\n| –\n|4%\n|}\nResults\n{| class=\"wikitable sortable\" style=\"text-align:right;\"\n|+ style=\"background-color:#f2f2f2;margin-bottom:-1px;border:1px solid #aaa;padding:0.2em 0.4em;\" |2020 Kansas Democratic presidential primary final results\n! Candidate\n! Votes\n! %\n! Delegates\n|-\n| style=\"text-align:left;\" data-sort-value=\"Biden, Joe\" | Joe Biden\n| 110,041\n| 74.92\n| 29\n|-\n| style=\"text-align:left;\" data-sort-value=\"Sanders, Bernie\" | Bernie Sanders (withdrawn)\n| 33,142\n| 22.57\n| 10\n|-\n| style=\"text-align:left;\" data-sort-value=\"ZZ\" | Inactive votes\n| 3,690\n| 2.51\n|\n|-\n! Total\n! 146,873\n! 100%\n! 39\n|}\n{| class=\"wikitable sortable\" style=\"text-align:right;\"\n|+ style=\"background-color:#f2f2f2;margin-bottom:-1px;border:1px solid #aaa;padding:0.2em 0.4em;\" class=\"nowrap\" |Vote count by round\n|-\n! rowspan=\"2\" style=\"text-align:center;\" | Candidate\n! colspan=\"2\" | Round 1\n! colspan=\"2\" | Round 2\n! colspan=\"2\" | Round 3\n! colspan=\"2\" | Round 4\n|-\n!Votes\n!%\n!Votes\n!%\n!Votes\n!%\n!Votes\n!%\n|-\n| style=\"text-align:left;\" data-sort-value=\"Biden, Joe\" |Joe Biden\n|102,829\n|70.01\n|103,165\n|70.35\n|103,922\n|72.33\n|110,041\n|76.85\n|-\n| style=\"text-align:left;\" data-sort-value=\"Sanders, Bernie\" |Bernie Sanders (withdrawn)\n| 26,555\n|18.08\n| 26,907\n|18.35\n| 27,320\n|19.02\n| 33,142\n|23.15\n|-\n| style=\"text-align:left;\" data-sort-value=\"Warren, Elizabeth\" |Elizabeth Warren (withdrawn)\n| 11,518\n|7.84\n| 11,934\n|8.14\n| 12,434\n|8.65\n| colspan=\"2\" bgcolor=\"lightgray\" align=\"center\" |Eliminated\n|-\n| style=\"text-align:left;\" data-sort-value=\"ZZ\" | Uncommitted\n| 4,367\n|2.97\n| 4,636\n|3.16\n| colspan=\"4\" bgcolor=\"lightgray\" align=\"center\" |Eliminated\n|-\n| style=\"text-align:left;\" data-sort-value=\"Gabbard, Tulsi\" |Tulsi Gabbard (withdrawn)\n| 1,604\n|1.09\n| colspan=\"6\" bgcolor=\"lightgray\" align=\"center\" |Eliminated\n|-\n! Total\n! 146,873\n!100%\n! 146,642\n!99.8%\n! 143,676\n!97.8%\n! 143,183\n!97.5%\n|}\nSee also\n* 2020 Kansas elections\nNotes\nReferences\nExternal links\n*[https://www.thegreenpapers.com/P20/KS-D The Green Papers delegate allocation summary]\n*[https://kansasdems.org/2020primary/ Kansas Democratic Party draft delegate selection plan]"
    }
  ]
}