{
  "content": [
    {
      "type": "text",
      "text": "# 2020 U.S. Virgin Islands presidential caucuses\n\n| module             =\n}}\n}}\nAlthough the United States Virgin Islands did not participate in the 2020 presidential election because it is a U.S. territory and not a state, it still participated in the U.S. presidential caucuses and primaries. Former vice president Joe Biden won the Democratic caucuses, held on June 6. The Republican caucuses, held on March 14 in the form of a territorial convention, voted for incumbent president Donald Trump.\nDemocratic caucuses\nThe U.S. Virgin Islands Democratic presidential caucuses were held on June 6, 2020, a Saturday, on multiple islands, in the Democratic Party primaries and caucuses for the 2020 presidential election alongside the Guam caucus on the same day. The Virgin Islands caucuses were a closed caucus, with the territory awarding 13 delegates to the 2020 Democratic National Convention, of which 7 were pledged delegates allocated on the basis of the results of the caucus. Former vice president and presumptive nominee Joe Biden overwhelmingly won all delegates with his highest result in the primary cycle of more than 91%, while the sole other candidate, senator Bernie Sanders, who still competed for delegates, only got 28 out of 550 votes, his lowest result in the primary cycle.\nProcedure\nWhen the U.S. Virgin Islands Democratic Party published its draft delegate selection plan on June 12, 2019, it specified a June 6 date for the 2020 caucuses, originally being the only entity voting on that day, before Guam postponed its caucus and joined the Virgin Islands on June 6, due to the COVID-19 pandemic.\nVoting took place between 10:00&nbsp;a.m. and 6:00&nbsp;p.m. In the closed caucuses, candidates had to meet a threshold of 15 percent across the territory to be considered viable. The 7 pledged delegates to the 2020 Democratic National Convention were allocated proportionally on the basis of the results of the caucuses. Of these, all 7 were at-large pledged delegates. Originally planned with 6 delegates, the final number included a 20% bonus of 1 additional delegate by the Democratic National Committee due to the June date, which belonged to Stage III on the primary timetable.\nThe delegation also included 6 unpledged PLEO delegates: 4 members of the Democratic National Committee, one member of Congress (House of Representatives nonvoting delegate Stacey Plaskett), and the governor Albert Bryan.\nResults\n{| class=\"wikitable sortable\" style=\"text-align:right;\"\n|+ style=\"background-color:#f2f2f2;margin-bottom:-1px;border:1px solid #aaa;padding:0.2em 0.4em;\" |2020 U.S. Virgin Islands Democratic presidential caucuses\n! Candidate\n! Votes\n! %\n! Delegates\n|-\n| style=\"text-align:left;\" data-sort-value=\"Biden, Joe\" | Joe Biden\n| 502\n| 91.27\n| 7\n|-\n| style=\"text-align:left;\" data-sort-value=\"Sanders, Bernie\" | Bernie Sanders (withdrawn)\n| 28\n| 5.09\n| rowspan=\"2\"\n|-\n| style=\"text-align:left;\" data-sort-value=\"ZZ\" | Uncommitted\n| 20\n| 3.64\n|-\n! Total\n! 550\n! 100%\n! 7\n|}\nRepublican caucuses\nThe U.S. Virgin Islands Republican presidential caucuses were scheduled to take place as a territorial convention on multiple islands on April 4, in the Republican Party primaries and caucuses for the 2020 presidential election, but due to the COVID-19 pandemic they were moved. Party chairman John Canegata controversially announced a caucus for May 30 only two days before, including a \"presidential preference vote\", even though his proposal for such a vote had been downvoted by the party in the past. Canegata gave multiple challenges in court and with the Republican National Committee against the legitimacy of his chairmanship as the reason for the late announcement. Of the 9 delegates, according to the standing local party rules, 6 would have been bound in the sense that they would be individually elected as delegates at the caucuses, while binding themselves to their preferred candidate. The other 3 would have been automatic delegates and unbound as party leaders. Assuming, however, that the party did a binding presidential preference vote even though not stipulated by the local rules, this would mean under the national party rules adopted in 2015 that the automatic delegates would be bound by the result just as the other delegates, making 9 bound delegates.\nThere were no media reports or a press release about the outcome of the caucus at all, and virtually all delegate tracking sources like CNN or 270toWin did not contain results for the delegate allocation either. The website The Green Papers, specialised on presidential primary contests, reported an unofficial result of around 90% for Donald Trump. As the Republican National Committee did not recognize Canegata as party chair, he was ultimately not allowed to attend the 2020 Republican National Convention, following a recommendation of the Committee on Contests, and the Virgin Islands' delegate votes were only read out by the convention secretary, without anyone representing their delegation.\nReferences\nExternal links\n* [https://www.thegreenpapers.com/P20/VI-D The Green Papers Democratic Party delegate allocation summary]\n* [https://www.thegreenpapers.com/P20/VI-R The Green Papers Republican Party delegate allocation summary]"
    }
  ]
}