{
  "content": [
    {
      "type": "text",
      "text": "# 2020 Robert Morris Colonials football team\n\nThe 2020 Robert Morris Colonials football team represented Robert Morris University during the 2020–21 NCAA Division I FCS football season. They were led by third-year head coach Bernard Clark and played their home games at Joe Walton Stadium.\nOn June 15, 2020, Robert Morris announced that it would be leaving the Northeast Conference for the Horizon League in all sports except football, with the move officially taking place on July 1, 2020. The football team originally planned to play as an FCS independent for the 2020 season before moving to the Big South Conference in 2021. Robert Morris's 2020 football schedule was initially unchanged, meaning that all NEC opponents would have lost a conference game.\nThese plans would be upended by COVID-19, which led most FCS conferences to cancel their originally scheduled fall 2020 seasons. Most of these leagues, among them the Big South and NEC, eventually moved football to spring 2021. Of the eight schools that had planned to field teams in the Big South's 2020 fall season, only Campbell and North Alabama played in the fall, and Hampton chose not to play football at all in the 2020–21 school year. The Big South ultimately chose to hold a  spring 2021 season with the remaining four teams plus RMU, with the Colonials eligible for the conference title.\nSchedule\nRobert Morris released their original football schedule on April 9, 2020. A game against Hawaii (scheduled for September 26) was added on July 14, to compensate for Hawaii having to cancel four non-conference games due to the COVID-19 pandemic. On July 15, Robert Morris's game against Bryant, scheduled for November 7, was canceled due to Robert Morris's reclassification as an independent. On July 27, Robert Morris's game against Dayton was canceled due to the Pioneer Football League's decision to play a conference-only schedule due to the COVID-19 pandemic. On November 9, 2020, the Big South announced a spring 2021 schedule, with RMU competing.\nReferences"
    }
  ]
}