{
  "content": [
    {
      "type": "text",
      "text": "# 2020s in United Kingdom history\n\n2020s in United Kingdom history refers to significant political and societal historical events in the United Kingdom in the 2020s, presented as a historical overview in narrative format.\nPremiership of Boris Johnson (2020-2022)\nannounces his pending resignation outside 10 Downing Street on 7 July 2022; he left office on 6 September.]]\nLess than two months after the 2019 general election, cases of COVID-19 had reached the UK, and Boris Johnson himself was hospitalised with the disease in March 2020. The government responded to the pandemic in March 2020 by enacting emergency powers and widespread societal measures including several lockdowns, and approved a vaccination programme which began in December 2020. Reception for Johnson's leadership during the COVID-19 pandemic was mixed. The media later reported that there had been social gatherings by the Conservative Party and government staff which contravened COVID-19 restrictions. Johnson was personally implicated, and he, his wife Carrie Johnson, and the Chancellor of the Exchequer Rishi Sunak, were given fixed penalty notices by the police in April 2022, becoming the first prime minister to be sanctioned for a criminal action while in office. Public dissatisfaction over the events led to a decline in public support for Johnson, the government led by him, and the Conservative Party as a whole.\nThe publishing of the Sue Gray report in May 2022 and a widespread sense of dissatisfaction led in June 2022 to a vote of confidence in his leadership among Conservative MPs, which he won. In late June 2022, the Conservative MP Chris Pincher resigned as deputy chief government whip after an allegation was made that he had sexually assaulted two men. Johnson initially refused to suspend the whip from him, and his spokesperson said Johnson had not been aware of \"specific allegations\" against Pincher. On 4 July, Johnson's spokesperson said that Johnson was aware of allegations that were \"either resolved or did not proceed to a formal complaint\" at the time he appointed him. Several ministers resigned on 5 July, including Sunak and health secretary Sajid Javid. Following dozens of government resignations, Johnson announced on 7 July his intention to resign. Voting in the July–September 2022 Conservative Party leadership election took place between 13 July and 2 September. After a series of MP ballots, the list of candidates was narrowed down to Liz Truss, who served as Foreign Secretary and Minister for Women and Equalities under Johnson's leadership, and Rishi Sunak, who served as Chancellor of the Exchequer until 5 July.\nPremiership of Liz Truss\nannounces her pending resignation outside 10 Downing Street on 20 October 2022; she left office on 25 October.]]\nTruss defeated Rishi Sunak in the July–September 2022 Conservative Party leadership election on 5 September and was appointed prime minister the following day. Elizabeth II's death on 8 September caused government business to be suspended during a national mourning period of 10 days. In response to the cost-of-living crisis and energy supply crisis, the Truss ministry announced the Energy Price Guarantee, which reduced energy prices for households, businesses, and public sector organisations. Kwasi Kwarteng, then Chancellor of the Exchequer,   announced large-scale borrowing and tax cuts in a mini-budget on 23 September. The mini-budget was widely criticised and largely reversed, expeditiously having led to financial instability.\nTruss dismissed Kwarteng without explanation on 14 October and appointed Jeremy Hunt to succeed him. Suella Braverman resigned as Home Secretary on 19 October after admitting to having used her personal email address to send a Cabinet document. Her resignation letter was critical of Truss's government. On the evening of 19 October, MPs voted to reject a motion which would guarantee parliamentary time for a bill to ban fracking in the UK. The vote was controversial as it was unclear whether a three-line-whip had been issued to Conservative MPs, ordering them to vote against it. Allegations of \"manhandling\" and intimidation were made by a number of MPs against some government ministers. Following these events, together with mounting criticism and loss of confidence in her leadership, Truss announced on 20 October her intention to resign as party leader and as prime minister.\nPremiership of Rishi Sunak (2022-2024)\n's first speech outside 10 Downing Street on 25 October 2022]]\nRishi Sunak was elected unopposed in the October 2022 Conservative Party leadership election to succeed Truss on 24 October and was appointed the following day. Sunak went on to further reverse many of the economic measures she had made as prime minister but retained Hunt as chancellor.\nAs prime minister, Sunak has reshuffled his Cabinet twice, the latter of which resulted in the return of the former prime minister David Cameron to frontline politics as foreign secretary. Sunak and Hunt have continued the levelling up policy introduced during the premiership of Boris Johnson. In January 2023, Sunak outlined five key priorities; halving inflation, growing the economy, cutting debt, reducing NHS waiting lists, and stopping the boats, and expected voters to hold his government and himself to account on delivering those goals. In February 2023, Sunak negotiated a proposed agreement with the European Union (EU) on Northern Ireland's trading arrangements which was published as the \"Windsor Framework\". Sunak has made the Rwanda asylum plan a key policy of his government.\nOn foreign policy, Sunak has authorised foreign aid and weapons shipments to Ukraine in response to the Russian invasion of the country, promising £2.5&nbsp;billion in military aid to Ukraine in 2024. In the aftermath of the 2023 Hamas-led attack on Israel, Sunak pledged the UK's support for Israel and declared that Israel \"has an absolute right to defend itself\" and has backed calls for humanitarian pauses however, Sunak later condemned the high number of civilian casualties during the Israeli bombardment of Gaza and called for a \"sustainable ceasefire\".\nUnder Sunak's leadership, the Conservatives performed poorly at the 2022 and 2023 local elections, where Labour and the Liberal Democrats made gains from Conservatives, often by very wide margins. The parties made further gains in the 2024 local elections. On 22 May 2024, Sunak called a general election for July 2024 despite being widely expected to call the election in the autumn; the Conservatives lost this election in a landslide to the opposition Labour Party led by Keir Starmer, ending 14 years of Conservative government.\nPremiership of Keir Starmer (2024–present)\n's first speech outside 10 Downing Street on 5 July 2024]]\nKeir Starmer's tenure as Prime Minister of the United Kingdom began on 5 July 2024 when he accepted an invitation from King Charles III to form a government, succeeding Rishi Sunak of the Conservative Party, after the Labour Party had won the 2024 general election.\nDomestically, Starmer has said he will focus on economic growth, planning system reforms, infrastructure, energy, healthcare, education, childcare, and strengthening workers' rights, all of which were outlined in the Labour Party's 2024 election manifesto. He established the Border Security Command to replace the Rwanda asylum plan, to tackle smuggling gangs which facilitate illegal migrant crossings over the English Channel. Within his first month in office, Starmer faced his first major domestic event, the ongoing riots across the country following the Southport stabbing, which Starmer responded to by announcing the establishment of a national violent disorder programme to facilitate greater cooperation between police forces when dealing with violent disorder.\nIn foreign policy, Starmer has supported Ukraine in its war against Russia and Israel in its war against Hamas, but has also called for an immediate ceasefire in the Gaza Strip. At the 2024 NATO summit, Starmer signaled that Ukraine could use Britain's Storm Shadow missile donations to strike military targets inside Russia, and in a meeting with Volodymyr Zelenskyy, Starmer called for an \"irreversible\" membership strategy for Ukraine to join NATO. Starmer told Benjamin Netanyahu later that month that the UK would continue cooperation to deter malign threats with Israel.\nHistory by issue\nBrexit\nIn January 2020, the United Kingdom and Gibraltar left the European Union, beginning an 11-month transition period, during which they remain in the Single Market and Customs Union.\nClimate change\nIn December 2019, the World Meteorological Organization released its annual climate report revealing that climate impacts are worsening. They found the global sea temperatures are rising as well as land temperatures worldwide. 2019 is the last year in a decade that is the warmest on record.\nGlobal carbon emissions hit a record high in 2019, even though the rate of increase slowed somewhat, according to a report from Global Carbon Project.\nCOVID-19 pandemic\nGeorge Floyd protests\nCost-of-living crisis\nGaza war protests in the United Kingdom\nAs a result of the Gaza war, nationwide protests occurred across the UK. These demonstrations occurred as part of a broader movement of Gaza war protests occurring around the world. The march on 11 November 2023 was one of the largest in the UK in years, with some estimating it was the largest since the 2003 protest against the invasion of Iraq.\nRiots and unrest\nHistory by major political party\nConservatives\nLeadership elections for the Scottish Conservatives were held in February and August 2020. Douglas Ross is now the leader\nIn 2022, Rishi Sunak became the first British Asian and the first Hindu to become the UK prime minister and conservative leader.\nIn 2024, Kemi Badenoch became the first black leader of any major UK political party and the fourth woman to lead the Conservative Party.\nLabour\nAs both the Labour leader (Jeremy Corbyn) and deputy leader (Tom Watson) had resigned or announced their intention to do so in late 2019, the party had both a leadership and deputy leadership contest in early 2020. The leadership contest was won by Shadow Secretary of State for Exiting the European Union Keir Starmer with 275,780 votes (56.2% of the vote share). Angela Rayner became the deputy leader, achieving 192,168 first preference votes (41.7% of the vote share) and winning a majority of votes after the third round.\nOn 16 March 2024 Vaughan Gething was elected to lead Welsh Labour, and became First Minister of Wales. He became Wales's first black leader. With Gething's win it meant that three of the four governments in the UK will have non-white leaders.\nThe landslide victory for Keir Starmer in the 2024 United Kingdom general election lead to Labour forming government for the first time since 2010.\nLiberal Democrats\nAfter their leader (Jo Swinson) lost her seat at the 2019 general election, the Liberal Democrats announced early in 2020 that they planned to have new leader in place by the middle of July that year. The contest was delayed by six weeks due to the COVID-19 pandemic with the winner being declared in late August, until then MP Sir Ed Davey and the party's president Mark Pack remained its acting leadership. The contest was won by Ed Davey with 63.5% of the vote.\nThe Liberal Democrats were victorious in by-elections in Chesham and Amersham, North Shropshire and Tiverton and Honiton. In North Shropshire it was thought to have been the largest majority ever overturned in a by-election.\nScottish National Party\nSNP Chief Whip in the House of Commons Patrick Grady resigned following a complaint of sexual misconduct by an SNP staff member. The SNP won a plurality of seats in the 2021 Scottish Parliament election. The Third Sturgeon government was formed with support from the Scottish Greens in the Bute House Agreement.\nIan Blackford announced his intention to stand down from his role of Leader of the Scottish National Party in the House of Commons on 1 December 2022. He denied being forced out by SNP MPs. His successor, Stephen Flynn, was elected on 6 December.\nHumza Yousaf succeeded Nicola Sturgeon as First Minister in 2023. Yousaf became the first Scottish Asian and Muslim to hold the office since it was created in 1999.\nGreen Parties\nIn 2021, the Green Party of England and Wales elected co-leaders Carla Denyer and Adrian Ramsay. In October 2022, at their national conference the Scottish Greens voted to sever ties with the Green Party of England and Wales over the issue of transphobia. In the 2023 local elections, the Greens won majority control of Mid Suffolk District Council, the party's first ever council majority. The 2024 general election was the best ever election result for the Greens with them winning four seats.\nIn the 2025 Scottish Greens co-leadership election, Gillian Mackay and Ross Greer were elected as co-leaders. Zack Polanski was elected in the 2025 Green Party of England and Wales leadership election.\nPlaid Cymru\nIn Wales, Plaid Cymru was led by Adam Price and underperformed against Welsh Labour in the 2021 Senedd election with the high-profile former leader Leanne Wood being unseated. Rhun ap Iorwerth was elected in the 2023 Plaid Cymru leadership election and 28-year-old Carmen Smith became a baroness in the 2024 Special Honours.\nPlaid Cymru hopes to win the 2026 Senedd election.\nReform UK\nReform UK was relaunched out of the Brexit party. In 2024, Conservative MP Lee Anderson defected to the Reform UK. Reform UK won the most seats and votes in the 2025 United Kingdom local elections. The Reform UK has lead many opinion polls challenging Labour and the Conservatives.\nOther parties\nGeorge Galloway won the 2024 Rochdale by-election for the Workers Party of Britain.\nIn 2021, Alba Party was formed by Alex Salmond, being joined by former SNP politicians Kenny MacAskill, Tasmina Ahmed-Sheikh, Neale Hanvey, Ash Regan, Tommy Sheridan and Corri Wilson. In the 2025 Alba Party leadership election, Kenny MacAskill was elected.\nOther parties in the UK and overseas territories founded in the 2020s include Advance UK, Breakthrough Party, Homeland Party, Pirate Party UK, Social Justice Party, Transform, Independent Alliance, Reclaim Party, True and Fair Party, United Alliance and the Yoruba Party.\nHistory by devolved administration\nGreater London Authority\nThe London mayoral election originally due to take place in May 2020 was suspended for a year to 6 May 2021 due to the COVID-19 pandemic. The mayoral race saw London Labour's Sadiq Khan win on second preferences with 55.2% of the vote. The 2021 London Assembly election took place on the same day. The assembly elections saw Labour lose a seat while the London Conservatives, London Liberal Democrats and London Greens each gained one.\nScottish government\nThe 2021 Scottish Parliament election took place on 6 May 2021. The election saw limited changes in vote share and seats with each party gaining or losing less than 2% of the overall share in each category of voting.  The SNP gained one seat but fell one short of an overall majority. The Scottish Conservatives maintained their second-place position with the same number of seats as in 2016. Whilst, Scottish Labour continued in third place with a loss of two seats. The Scottish Greens gained two extra seats with a small increase in their vote share. The election also had an unusually high voter turnout compared to previous Scottish parliament elections of 63.2%. It was suggested that this may have been in part due to the COVID-19 pandemic leading to higher postal voting and lockdown giving people more time to engage with political activists and go to the polling station. Later that year, the SNP and Scottish Greens established a powersharing agreement where the latter was given non-cabinet ministerial positions in exchange for support on votes of confidence, budgets and some areas of policy.\nHumza Yousaf succeeded Nicola Sturgeon as First Minister in 2023. He resigned in 2024 and was succeeded by John Swinney.\nWelsh government\nThe 2021 Senedd election took place on 6 May 2021. It was the first Welsh Parliament election where 16- and 17-year-olds could vote, following the enactment of Senedd and Elections (Wales) Act that lowered the voting age to 16 for Welsh Senedd elections. The election saw Welsh Labour gain one seat falling one short of an overall majority (which no party had ever achieved). The Welsh Conservatives gained five seats returning their strongest ever result of 16. Plaid Cymru made a net gain of one seat returning 13. The Welsh Liberal Democrats lost their only constituency but kept a seat through the regional vote, whilst UKIP lost all its seats from 2016 and no other party gained any. While Labour lacked an overall majority it decided to not make any kind of coalition or confidence pact and its leader Mark Drakeford was reconfirmed as First Minister of Wales a few days later with none of the other parties attempting to mount any kind of challenge. Though, in late 2021, Welsh Labour and Plaid Cymru reached an agreement to cooperate for three years.\nIn March 2024, Vaughan Gething won the Welsh Labour leadership election to replace Mark Drakeford and become First Minister of Wales, making him the first black leader of any European country. He resigned following the 2024 Welsh government crisis and was replaced by Eluned Morgan.\nNorthern Irish Executive\nThe Northern Irish Assembly returned to business in January 2020 after a three-year hiatus with a new power sharing agreement between Sinn Féin and the DUP.\nOn 30 April, First Minister of Northern Ireland Arlene Foster resigned as leader of the Democratic Unionist Party. She was replaced as First Minister of Northern Ireland by Paul Givan who was confirmed on 17 July. Meanwhile, the role of DUP leader was handled separately, being given first to Edwin Poots on 14 May and following his resignation after just 21 days in the role it was taken by Jeffrey Donaldson.\nThe 2022 Northern Ireland Assembly election resulted Sinn Féin winning the most seats for the first time. Powersharing was suspended until the Northern Ireland Executive reformation in February 2024. Michelle O'Neill became the first ever Irish nationalist First Minister of Northern Ireland.\nBritish Virgin Islands\nOn 28 April 2022, Premier of the British Virgin Islands Andrew Fahie was arrested in the United States on charges related to drug trafficking and money laundering. Shortly afterwards, on 5 May 2022, he was removed as Premier by a near-unanimous vote in the House of Assembly, and replaced by his deputy Natalio Wheatley. On 8 June 2022, the British Government decided against direct rule for the islands.\nDeaths\nHistory by local government\nLocal elections in England as well as police and crime commissioner elections in England and Wales were postponed from May 2020 to 2021 due to the COVID-19 pandemic. Taking place on 6 May, the local elections saw the conservatives make a net gain of 294 councillors and 13 councils, whilst labour lost 264 and eight respectively. The Green Party of England and Wales gained 85 council seats and the Liberal Democrats increased their total by three. The Conservatives gained both a mayor and a police and crime commissioner of Labour, who themselves gained the same from the Conservatives and Plaid Cymru.\nAt the 2022 local elections, the Conservatives made a net loss of 487 seats in comparison to 2017 in Scotland and Wales and 2018 in England, whilst Labour gained 108 seats (22 in England, 20 in Scotland, and 66 in Wales). The Liberal Democrats and Greens made gains of 224 seats and 87 seats, respectively, which exceeded those of the Labour Party in England but were also seen to a more modest extent in Scotland and Wales. The Scottish National Party (SNP) gained 22 seats in Scotland whilst Plaid Cymru made a net loss of 6 seats in Wales.\nAt the 2023 United Kingdom local elections there were significant losses for the governing Conservative Party, which lost over 1,000 council seats. The Labour Party, the Liberal Democrats and the Green Party of England and Wales all made gains, with Labour becoming the party with most members elected to local government for the first time since 2002. The 2023 Northern Ireland local elections marked the first time that nationalist parties had garnered a greater share of the vote than unionist parties.\nThe 2024 United Kingdom local elections saw massive gains for Labour and the Liberal Democrats at the expense of the Conservatives.\nReform UK won the most seats and votes in the 2025 United Kingdom local elections. -->\n}}"
    }
  ]
}