{
  "content": [
    {
      "type": "text",
      "text": "# 2021 in the Democratic Republic of the Congo\n\nEvents in the year 2021 in the Democratic Republic of the Congo.\nIncumbents\n* President: Félix Tshisekedi\n* Prime Minister\n**Sylvestre Ilunga (until January 29)\nEvents\nOngoing – COVID-19 pandemic in the Democratic Republic of the Congo, Allied Democratic Forces insurgency (2021 Democratic Republic of the Congo attacks)\nJanuary and February\n*January 1 – Two soldiers and 14 Allied Democratic Forces (ADF) rebels are killed in fighting in Loselose village, Beni. Twenty-five civilians were killed on December 31, 2020.\n*January 4 – Allied Democratic Forces (ADF) kill 25 civilians in villages of Tingwe, Mwenda and Nzenga.\n*January 6\n**China extends debt relief. Congo’s exports to China, mostly in copper (Cu) and cobalt (Co), surged 30% in 2020 compared with 2019.\n**Two children and a woman drown when a boat carrying 100 passengers capsizes near Goma, North Kivu, in Lake Kivu.\n*January 8 – President Tshisekedi pardons and releases twenty-two men, including Colonel Eddy Kapend, convicted for the 2001 assassination of former president Laurent-Désiré Kabila.\n*January 9 – Six rangers are killed by Mai-Mai fighters in Virunga National Park.\n*January 15\n**Forty-six African Pygmies, mostly women and children, are killed (some beheaded) by ADF fighters in Irumu Territory, Ituri Province. Two rebels are arrested.\n**The United States lifts sanctions on Israeli mining magnate Dan Gertler, who has been accused of corruption in the Congo.\n*January 17 – President Felix Tshisekedi pays tribute to Patrice Lumumba on the 60th anniversary of his assassination.\n*January 22 – The National Assembly files a motion of no-confidence in Prime Minister Sylvestre Ilunga Ilunkamba.\n*January 26 – Nine die and 19 are missing after a barge sinks on the Congo River in Tshopo.\n*January 29 – Prime Minister Sylvestre Ilunga resigns.\n*February 7 – A new case of ebola is reported in North Kivu.\n*February 15 – Jean-Michel Sama Lukonde becomes the new Prime Minister; 2021 Congo River disaster\n*February 22 – The Italian ambassador to the Democratic Republic of the Congo, Luca Attanasio, is killed in an apparent kidnapping attempt near Kanyamahoro, north of Goma. A carabiniere and their driver are also killed by the attackers. Their group was part of a larger World Food Programme convoy visiting a WFP-run school feeding program in Rutshuru.\n*February 24 – Thirteen civilians are killed in Beni and Kisima. 1,010 civilians have been killed in fighting in Kiva since November 2019.\nMarch and April\n*March 8\n**The International Criminal Court will provide $30 million to compensate victims of Bosco Ntaganda.\n**Julienne Lusenge, human rights activist, is awarded the International Women of Courage Award.\n*March 14 - At least twelve people were killed in a mass stabbing in Bulongo village, blamed on the Allied Democratic Forces.\n*April 12 - The new Lukonde cabinet is formed.\nMay and June\n*May 22 - 2021 Mount Nyiragongo eruption begins.\n*May 8 – Militia chief Jackson Muhukambuto is arrested in connection with 19 murders of rangers in Virunga National Park over a period of three years.\nScheduled events\n*April 3-5 — The foreign ministers of Egypt, Ethiopia, and Sudan will meet in Kinshasa for talks on the Grand Ethiopian Renaissance Dam.\nCulture\nSports\n*January 27 – FIFA announces on that Constant Omari failed an integrity and eligibility check and is barred from seeking reelection.\nBirths\n*February 12 – Virunga National Park announces the birth of the first mountain gorilla, a male, of 2021.\nDeaths\n*January 8 – Dorine Mokha, 31, dancer; malaria.\n*February 19 – Joseph Kesenge Wandangakongu, 92, Bishop of Roman Catholic Diocese of Molegbe (1968–1997).\n*February 22 – Luca Attanasio, 43, Italian diplomat, ambassador; assassinated\n*February 24 – N'Singa Udjuu, 86, politician, First State Commissioner of Zaire (1981–1982).\n*March 7 – Josky Kiambukuta, 72, singer (TPOK Jazz).\n*March 10 Henri-Thomas Lokondo, 65, politician, MP (since 2006); COVID-19.\n*March 21 – Honoré Ngbanda, 74, politician, minister of defense (1990–1997).\nSee also\n*COVID-19 pandemic in the Democratic Republic of the Congo\n*African Continental Free Trade Area\n*Sexual violence in the Democratic Republic of the Congo\n*Democratic Forces for the Liberation of Rwanda\n*Politics of the Democratic Republic of the Congo\n*International Conference on the Great Lakes Region\nReferences"
    }
  ]
}