{
  "content": [
    {
      "type": "text",
      "text": "# 2022 Turkmenistan presidential election\n\n| turnout = 97.17%\n| image_size = 130x130px\n| image1 = Serdar Berdimuhamedow (2022-06-10).jpg\n| nominee1 = Serdar Berdimuhamedow\n| party1 = Democratic Party of Turkmenistan\n| popular_vote1 = 2,452,705\n| percentage1 = 72.97%\n| image2 = 3x4.svg\n| nominee2 = Hydyr Nunnaýew\n| party2 = Independent\n| popular_vote2 = 372,525\n| percentage2 = 11.08%\n| image3 = 3x4.svg\n| nominee3 = Agajan Bekmyradow\n| party3 = Agrarian Party of Turkmenistan\n| popular_vote3 = 242,685\n| percentage3 = 7.22%\n| map_image =\n| map_size =\n| map_caption =\n| title = President\n| before_election = Gurbanguly Berdimuhamedow\n| before_party = Independent politician\n| after_election = Serdar Berdimuhamedow\n| after_party = Democratic Party of Turkmenistan\n}}\nEarly presidential elections were held in Turkmenistan on 12 March 2022. The elections were called after incumbent president Gurbanguly Berdimuhamedow announced his intention to resign, having already announced on January 25, 2020, that he would not seek re-election to a fourth term, leaving the office open for the first time since 2007, when Berdimuhamedow was first elected, following the death of president-for-life Saparmurat Niyazov on 21 December 2006.\nThe Democratic Party, which has ruled the country since independence after the dissolution of the Soviet Union, chose Berdimuhamedow's son Serdar as its candidate. Serdar Berdimuhamedow was subsequently elected with 73% of the vote. However, the elections were seen by many international observers as neither free nor fair.\nBackground\nNo prior elections in Turkmenistan have been free and fair and the 2022 elections took place in an authoritarian context. The country has been described as a totalitarian dictatorship under the rule of Saparmurat Niyazov and Gurbanguly Berdimuhamedow. The Democratic Party of Turkmenistan is seen as the only legitimate force, with other parties having been founded after 2012 in order to give the appearance of a multi-party system. All legal parties currently support the government.\nIn 2016, the constitution was amended to extend the term of presidents from five to seven years and to eliminate the age-limit of 70. This was seen as an effort to allow the incumbent Gurbanguly Berdimuhamedow to stay in office. Despite this, he signaled his resignation just five years into his seven-year term. On 12 February 2022, the Mejlis passed a resolution scheduling the election for 12 March in accordance with article 81 of the constitution. The son of the former president, Serdar Berdimuhamedow, was widely seen as the successor to his father.\nElectoral system\nThe President of Turkmenistan is elected using the two-round system for a seven-year term.  The minimum age for a candidate is 40.\nCandidates\n{| class=\"wikitable\" style=\"text-align:center\"\n|-\n!\n! Image\n! Name\n! Party\n! Primary\n! Declaration\n! Note\n|-\n| style=\"background:;\" |\n|\n| Serdar Berdimuhamedow\n| TDP\n|\n| 14 February 2022\n| A congress of the ruling Democratic Party of Turkmenistan nominated Serdar Berdimuhamedow as its candidate on 14 February 2022\n|-\n| style=\"background:;\" |\n|\n| Agajan Bekmyradow\n| TAP\n|\n| 16 February 2022\n| A congress of the Agrarian Party of Turkmenistan nominated Agadzhan Bekmyradov as its candidate on 16 February 2022\n|-\n| style=\"background:;\" |\n|\n| Perhat Begenjow\n| TDP\n|\n| 20 February 2022\n| Nominated by the initiative group of the Lebap Region\n|-\n| style=\"background:;\" |\n|\n| Berdimämmet Gurbanow\n| Independent\n|\n| 20 February 2022\n| Nominated by the initiative group of the Balkan Region\n|-\n| style=\"background:;\" |\n|\n| Babamyrat Meredow\n| TSTP\n|\n| 21 February 2022\n| The Party of Industrialists and Entrepreneurs of Turkmenistan nominated Babamurat Meredov as its candidate on 21 February 2022\n|-\n| style=\"background:;\" |\n|\n| Maksatmyrat Öwezgeldiýew\n| Independent\n|\n| 21 February 2022\n|  Nominated by the initiative group of the Ahal Region\n|-\n| style=\"background:;\" |\n|\n| Kakageldi Saryýew\n| Independent\n|\n| 21 February 2022\n|Nominated by the initiative group of the Mary Region\n|-\n| style=\"background:;\" |\n|\n| Maksat Ödeşow\n|  TDP\n|\n| 22 February 2022\n| Nominated by the initiative group of the Daşoguz Region\n|-\n| style=\"background:;\" |\n|\n| Hydyr Nunnaýew\n| Independent\n|\n| 22 February 2022\n| Nominated by the initiative group of Ashgabat city\n|}\nCampaign\nThe campaign stage began on 21 February. In accordance with Article 51 of the Electoral Code of Turkmenistan, candidates from the moment of their registration have equal rights to speak at pre-election meetings, campaign meetings, and in the media. Bodies of state power and local self-government, officials of institutions, organizations and enterprises are obligated to assist candidates in obtaining the necessary information related to elections.\nAccording to Article 52 of the Electoral Code of Turkmenistan, each candidate for the President of Turkmenistan can have up to three proxies in each etrap and each city with the rights of an etrap. Candidate meetings throughout the territory of Turkmenistan are held with broad participation of the public, representatives of labor collectives of enterprises and organizations, honorary elders and youth.\nConduct\nOn 28 February 2022, an observer mission from the Commonwealth of Independent States (CIS) arrived in Turkmenistan. Early voting began on 2 March, where a total of 41 polling stations were opened in 30 countries.\nResults\nThe Central Election Committee reported on 15 March that Serdar Berdimuhamedow won the election with 72.97% of the vote. University official Hydyr Nunnaýew came in second place with 11.09%. Unlike in prior elections, the preliminary results were not available on the day after the election. Berdimuhamedow received the lowest number of votes out of any winning candidate in all Turkmen presidential elections. Turnout was reported at 97% according to the Central Election Committee.\nReactions\nGeneral Secretary of the Chinese Communist Party Xi Jinping sent a message of congratulations to Serdar Berdimuhamedow after the results were announced. Russian President Vladimir Putin reportedly extended his congratulations in a phone call with both Gurbanguly and Serdar Berdimuhamedow. The Organization of Turkic States congratulated him via Twitter.\nReferences"
    }
  ]
}