{
  "content": [
    {
      "type": "text",
      "text": "# 2022 Seattle Film Critics Society Awards\n\n| last             = 2021\n| next             = 2023\n}}\nThe 7th Seattle Film Critics Society Awards were announced on January 17, 2023.\nThe nominations were announced on January 9, 2023, with Everything Everywhere All at Once leading the nominations with fourteen, followed by The Banshees of Inisherin with nine and Top Gun: Maverick with eight.\nEverything Everywhere All at Once received the most awards with four wins, including Best Picture and Best Director, followed by The Banshees of Inisherin with three.\nThe awards were dedicated this year to Sheila Benson (Los Angeles Times) and John Hartl (The Seattle Times), two of the \"finest\" film critics to live and work in the Pacific Northwest. After her retirement from the Los Angeles Times in 1991, Benson wrote for several print publications and websites, at both the local and national level, while Hartl was a Seattle icon who spent his entire 52-year career writing for The Seattle Times. They will be missed for their \"incisive contributions, as well as their warm and wise camaraderie at press screenings and festival events\".\nThis year, a new category—Achievement in Pacific Northwest Filmmaking—was added to specifically honor Pacific Northwest filmmaking. The award is meant to celebrate the many talented filmmakers who call the region home and who produce work there. A nominating committee carefully considered a wide variety of feature films released during 2022 with strong connections to the region and selected five finalists. The winner was determined by a vote of the full membership and announced alongside the SFCS's other awards on January 17, 2023; the nominees were announced via YouTube on December 5, 2022.\nWinners and nominees\n, Best Director winners]]\n, Best Actor in a Leading Role winner]]\n, Best Actress in a Leading Role and Villain of the Year winner]]\n, Best Actor in a Supporting Role winner]]\n, Best Supporting Actress winner]]\n, Best Screenplay winner]]\n, Best Costume Design winner]]\n, Best Original Score winner]]\n, Best International Film winner]]\nWinners are listed first and highlighted in bold\n{| class=wikitable\n|-\n| valign=\"top\" width=\"50%\"|\n'Everything Everywhere All at Once (A24)'\n* Aftersun (A24)\n* The Banshees of Inisherin (Searchlight Pictures)\n* Cha Cha Real Smooth (Apple TV+)\n* Decision to Leave (MUBI)\n* The Fabelmans (Universal Pictures)\n* Glass Onion: A Knives Out Mystery (Netflix)\n* Nope (Universal Pictures)\n* Tár (Focus Features)\n* Top Gun: Maverick (Paramount Pictures)\n| valign=\"top\" width=\"50%\"|\n'Daniel Kwan and Daniel Scheinert – Everything Everywhere All at Once'\n* Todd Field – Tár\n* Joseph Kosinski – Top Gun: Maverick\n* Martin McDonagh – The Banshees of Inisherin\n* Charlotte Wells – Aftersun\n|-\n| valign=\"top\" width=\"50%\"|\n'Colin Farrell – The Banshees of Inisherin as Pádraic Súilleabháin'\n* Austin Butler – Elvis as Elvis Presley\n* Tom Cruise – Top Gun: Maverick as Captain Pete \"Maverick\" Mitchell\n* Brendan Fraser – The Whale as Charlie\n* Paul Mescal – Aftersun as Calum Paterson\n| valign=\"top\" width=\"50%\"|\n'Cate Blanchett – Tár as Lydia Tár'\n* Danielle Deadwyler – Till as Mamie Till-Mobley\n* Mia Goth – Pearl as Pearl\n* Margot Robbie – Babylon as Nellie LaRoy\n* Michelle Yeoh – Everything Everywhere All at Once as Evelyn Quan Wang\n|-\n| valign=\"top\" width=\"50%\"|\n'Ke Huy Quan – Everything Everywhere All at Once as Waymond Wang'\n* Paul Dano – The Fabelmans as Burt Fabelman\n* Brendan Gleeson – The Banshees of Inisherin as Colm Doherty\n* Brian Tyree Henry – Causeway as James Aucoin\n* Barry Keoghan – The Banshees of Inisherin as Dominic Kearney\n| valign=\"top\" width=\"50%\"|\n'Kerry Condon – The Banshees of Inisherin as Siobhán Súilleabháin'\n* Angela Bassett – Black Panther: Wakanda Forever as Queen Ramonda\n* Stephanie Hsu – Everything Everywhere All at Once as Joy Wang / Jobu Tupaki\n* Janelle Monáe – Glass Onion: A Knives Out Mystery as Helen Brand / Cassandra \"Andi\" Brand\n* Keke Palmer – Nope as Emerald \"Em\" Haywood\n|-\n| valign=\"top\" width=\"50%\"|\n'Glass Onion: A Knives Out Mystery – Bret Howe and Mary Vernieu, casting directors'\n* The Banshees of Inisherin – Louise Kiely, casting director\n* Everything Everywhere All at Once – Sarah Halley Finn, casting director\n* Top Gun: Maverick – Denise Chamian, casting director\n* Women Talking – John Buchan and Jason Knight, casting directors\n| valign=\"top\" width=\"50%\"|\nRRR\n* Avatar: The Way of Water\n* Everything Everywhere All at Once\n* The Northman\n* Top Gun: Maverick\n|-\n| valign=\"top\" width=\"50%\"|\n'The Banshees of Inisherin – Martin McDonagh'\n* Decision to Leave – Park Chan-wook and Chung Seo-kyung\n* Everything Everywhere All at Once – Daniel Kwan and Daniel Scheinert\n* Glass Onion: A Knives Out Mystery – Rian Johnson\n* Tár – Todd Field\n| valign=\"top\" width=\"50%\"|\n'Marcel the Shell with Shoes On – Dean Fleischer Camp, director'\n* ''Guillermo del Toro's Pinocchio – Guillermo del Toro and Mark Gustafson, directors\n* Mad God – Phil Tippett, director\n* Puss in Boots: The Last Wish – Joel Crawford, director; Januel Mercado, co-director\n* Turning Red – Domee Shi, director\n|-\n| valign=\"top\" width=\"50%\"|\n'Fire of Love – Sara Dosa, director'\n* All the Beauty and the Bloodshed – Laura Poitras, director\n* Good Night Oppy – Ryan White, director\n* Navalny – Daniel Roher, director\n* [https://www.imdb.com/title/tt2551628/ Sweetheart Deal] – Elisa Levine and Gabriel Miller, directors\n| valign=\"top\" width=\"50%\"|\n'Decision to Leave – Park Chan-wook, director'\n* All Quiet on the Western Front – Edward Berger, director\n* EO – Jerzy Skolimowski, director\n* RRR – S. S. Rajamouli, director\n* Saint Omer – Alice Diop, director\n|-\n| valign=\"top\" width=\"50%\"|\n'Top Gun: Maverick – Claudio Miranda'\n* Avatar: The Way of Water – Russell Carpenter\n* Decision to Leave – Kim Ji-yong\n* Everything Everywhere All at Once – Larkin Seiple\n* Nope – Hoyte van Hoytema\n| valign=\"top\" width=\"50%\"|\n'Elvis – Catherine Martin'\n* Babylon – Mary Zophres\n* Black Panther: Wakanda Forever – Ruth E. Carter\n* Everything Everywhere All at Once – Shirley Kurata\n* The Northman – Linda Muir\n|-\n| valign=\"top\" width=\"50%\"|\n'Everything Everywhere All at Once – Paul Rogers'\n* Aftersun – Blair McClendon\n* Decision to Leave – Kim Sang-beom\n* Tár – Monika Willi\n* Top Gun: Maverick – Eddie Hamilton\n| valign=\"top\" width=\"50%\"|\n'Babylon – Justin Hurwitz'\n* The Banshees of Inisherin – Carter Burwell\n* The Batman – Michael Giacchino\n* The Fabelmans – John Williams\n* Nope – Michael Abels\n|-\n| valign=\"top\" width=\"50%\"|\n'Babylon – Florencia Martin (Production Design); Anthony Carlino (Set Decoration)'\n* Elvis – Catherine Martin and Karen Murphy (Production Design); Bev Dunn (Set Decoration)\n* Everything Everywhere All at Once – Jason Kisvarday (Production Design); Kelsi Ephraim (Set Decoration)\n* The Northman – Craig Lathrop (Production Design); Niamh Coulter (Set Decoration)\n* White Noise – Jess Gonchor (Production Design); Claire Kaufman (Set Decoration)\n| valign=\"top\" width=\"50%\"|\n'Avatar: The Way of Water – Joe Letteri, Richard Baneham, Eric Saindon, and Daniel Barrett'\n* Everything Everywhere All at Once – Zak Stoltz, Ethan Feldbau, Benjamin Brewer, and Jeff Desom\n* Nope – Guillaume Rocheron, Jeremy Robert, Sreejith Venugopalan, and Scott R. Fisher\n* RRR – Srinivas Mohan, Pete Draper, and Daniel French\n* Top Gun: Maverick – Ryan Tudhope, Scott R. Fisher, Seth Hill, and Bryan Litson\n|-\n| valign=\"top\" width=\"50%\"|\n'Frankie Corio – Aftersun as Sophie Paterson'\n* Vanessa Burghardt – Cha Cha Real Smooth as Lola\n* Anna Cobb – We're All Going to the World's Fair as Casey\n* Eden Dambrine – Close as Léo\n* Banks Repeta – Armageddon Time as Paul Graff\n| valign=\"top\" width=\"50%\"|\n'Lydia Tár – Tár (portrayed by Cate Blanchett)'\n* Jean Jacket – Nope\n* Pearl – X / Pearl (portrayed by Mia Goth)\n* The Riddler / Edward Nashton – The Batman (portrayed by Paul Dano)\n* Jobu Tupaki – Everything Everywhere All at Once (portrayed by Stephanie Hsu)\n|-\n| valign=\"top\" width=\"50%\" colspan=\"2\"|\n'[https://www.imdb.com/title/tt2551628/ Sweetheart Deal] (Elisa Levine and Gabriel Miller's deeply moving portrait of sex workers on Seattle's Aurora Avenue seeking salvation from the spiral of addiction)'\n* [https://www.imdb.com/title/tt9043484/ All Sorts]'' (J. Rick Castañeda's absurdist office comedy set in the secret world of underground filing)\n* Kimi (Steven Soderbergh's Seattle-set thriller starring Zoë Kravitz as an agoraphobic computer programmer enmeshed in a corporate scandal)\n* [https://www.imdb.com/title/tt15275946/ Know Your Place] (Zia Mohajerjasbi's slice of life drama about two teens traversing present-day Seattle)\n* [https://www.imdb.com/title/tt11742162/ Sam Now] (Reed Harkness's 25-years in the making story of brothers on a 2,000-mile road trip to solve a family mystery)\n|}\nReferences\nExternal links\n* [https://seattlefilmcritics.com/ Official website]"
    }
  ]
}