{
  "content": [
    {
      "type": "text",
      "text": "# 2022 in United Kingdom politics and government\n\nA list of events relating to politics and government in the United Kingdom during 2022.\nEvents\nJanuary\n* 12 January\n** The High Court rules that the government's use of a \"VIP lane\" to award contracts for personal protective equipment (PPE) to two companies was unlawful.\n** Partygate: At Prime Minister's Questions, Boris Johnson confirms he did attend a party in the No 10 garden during the first lockdown in May 2020 and offers his \"heartfelt apology\". Opposition MPs and the leader of the Scottish Conservatives Douglas Ross call for his resignation.\n* 19 January\n** Conservative MP Christian Wakeford crosses the house to Labour, after submitting a letter of no confidence in Boris Johnson in light of the \"partygate\" scandal.\n** In Prime Minister's Questions Conservative MP David Davis invokes Oliver Cromwell in a question to Boris Johnson: \"In the name of God, go\".\n* 20 January – Conservative MP William Wragg accuses whips of blackmail against Conservative MPs who are believed to support the ousting of Johnson. The Speaker, Sir Lindsay Hoyle, tells the Commons that potentially criminal offences would be a matter for the police. A Downing Street spokesperson says: \"We are not aware of any evidence to support what are clearly serious allegations.\"\n* 24 January\n** Johnson orders an inquiry into allegations by Conservative MP Nus Ghani that she was sacked as a minister after being told her \"Muslim-ness” was \"making colleagues uncomfortable\".\n** Conservative peer Lord Agnew publicly resigns in the House of Lords after criticising the government's handling of fraudulent Covid business loans.\n* 31 January – The initial findings of a report by Sue Gray into Downing Street parties are published. She notes that, \"At least some of the gatherings in question represent a serious failure to observe not just the high standards expected of those working at the heart of Government but also of the standards expected of the entire British population at the time,\" and concludes that \"a number of these gatherings should not have been allowed to take place or to develop in the way that they did. There is significant learning to be drawn from these events which must be addressed immediately across Government.\"\nFebruary\n* 2 February – The government publishes a white paper on its \"levelling up\" strategy, which aims to reduce the gap between rich and poor parts of the country by 2030. This includes a 40% increase in research and development spending for the North, Midlands, South West, Scotland, Wales, and Northern Ireland.\n* 3 February –\n** Munira Mirza resigns as Director of the Number 10 Policy Unit, saying it was in protest at Johnson's comments about Keir Starmer being responsible for the failure to prosecute serial sex offender Jimmy Savile. Three other senior aides resign hours later – Director of Communications Jack Doyle, Chief of Staff Dan Rosenfield, and Principal Private Secretary to the Prime Minister Martin Reynolds.\n** Paul Givan resigns as First Minister of Northern Ireland in protest over Brexit checks in the Irish Sea, which are part of the Northern Ireland protocol.\n** The Southend West by-election, following the murder of Sir David Amess, is won by the Conservative candidate, Anna Firth. The by-election is not contested by the major opposition parties out of respect for Amess.\n* 4 February\n** Policy adviser Elena Narozanski becomes the fifth of Johnson's aides to resign within 24 hours.\n** Peer Nazir Ahmed is jailed for sexual offences against children.\n* 8 February –\n** Johnson implements a cabinet reshuffle, which includes Jacob Rees-Mogg becoming Minister of State for Brexit Opportunities and Government Efficiency, with Mark Spencer replacing him as Leader of the House.\n** Health Secretary Sajid Javid sets out the government's plans to reduce the NHS backlog resulting from the pandemic, including new facilities paid for by an extra £8bn of investment over the next three years.\nMarch\n* 3 March – Paulette Hamilton wins the 2022 Birmingham Erdington by-election for Labour with 55.5% of the votes in a turnout of 27% of the electorate.\n* 23 March – The Chancellor, Rishi Sunak, delivers his Spring statement to the House, which includes a raising of the National Insurance threshold and a cut in fuel duty.\n* 24 March – The Fixed-term Parliaments Act 2011 is repealed after the Dissolution and Calling of Parliament Act receives royal assent, meaning that the Prime Minister will again be able to request the monarch to dissolve Parliament and call an early election, with 25 working days' notice.\n* 30 March – Jamie Wallis comes out as the UK's first openly transgender MP.\nApril\n* 7 April –\n** The government's plan to introduce a photo ID requirement for elections is defeated in the House of Lords by 199 votes to 170.\n** The government's new energy strategy is published, which includes a plan for eight new nuclear reactors and 95% of the UK's electricity coming from low-carbon sources by 2030.\n* 12 April – Frances O'Grady confirms she will retire from the role of General Secretary of the Trades Union Congress at the end of the year.\n* 21 April – MPs debate a motion calling for an inquiry into claims that Johnson misled Parliament over Partygate.\n* 24 April – The Elections Act 2022 receives royal assent, The Act introduces voter photo identification for in-person voting to the United Kingdom for the first time. The requirement would apply to UK general elections, English local elections, and police and crime commissioner elections in England and Wales.\n* 27 April – In a statement, Conservative Chief Whip Chris Heaton-Harris says he is investigating reports that a Conservative MP watched pornography on his phone in the House of Commons chamber, after complaints from female Tory MPs. The MP is later revealed to be Neil Parish, Conservative MP for Tiverton and Honiton (see 29 April).\n* 29 April – Conservative MP Neil Parish is suspended from the Conservative Whip over allegations that he watched pornography on his phone in the House of Commons.\n* 30 April – Neil Parish admits to watching pornography twice in the House of Commons and says that he will resign as an MP.\nMay\n* 5 May –\n** 2022 United Kingdom local elections: The Conservatives suffer a net loss of 485 seats, which includes the London boroughs of Barnet, Wandsworth, and Westminster, formerly considered Tory strongholds. Labour gain than 108 seats, while the Liberal Democrats gain 240. The Green Party has one of its best ever results, with a net gain of 87 seats. In Scotland, the SNP gains 22 seats, while in Northern Ireland, Sinn Féin receives the largest vote share.\n** The 2022 Welsh local elections are contested under new boundaries. This is the first time Welsh councils can choose between the first-past-the-post system and a proportional single transferable vote (STV) system, but councils need to give advance notice of such a change. Overall, Welsh Labour gain control of one council and Plaid Cymru three, whilst the Welsh Conservatives lose one and Independents two.\n** The 2022 Northern Ireland Assembly election is held.\n* 8 May – Sinn Féin is declared the largest party in the Northern Ireland Assembly election, winning 27 seats, followed by the DUP winning 25.\n* 9 May – Meghan Gallacher is appointed Deputy Leader of the Scottish Conservatives.\n* 10 May – 2022 State Opening of Parliament: Charles, Prince of Wales and Prince William, Duke of Cambridge open the third session of the 2019 Parliament on behalf of Queen Elizabeth II with the traditional Queen's Speech, the first time an heir-apparent to the throne has opened Parliament since George IV did so on behalf of his father, George III.\n* 17 May – Brexit: Foreign Secretary Liz Truss announces a plan to unilaterally abandon parts of the Northern Ireland protocol.\n* 25 May – Partygate: The full version of the Gray Report is published. In the 37-page document, Sue Gray concludes that senior Downing Street officials, both political and non-political, \"bear responsibility\" for the culture of partying during COVID lockdowns.\n* 26 May – Chancellor Rishi Sunak announces a £15 billion package of measures to address soaring energy costs, partly offset by a 25% windfall tax on oil and gas firms' profits. He tells the Commons that every UK household will get an energy bill discount of £400 in October, while the poorest households will also get a payment of £650 to ease living costs.\n* 27 May – A new version of the Ministerial Code is published, removing the need for a minister to resign over breaches of its rules.\nJune\n* 6 June – Sir Graham Brady, Chairman of the 1922 committee of the Conservative Party, announces a vote of confidence in Boris Johnson's leadership of the party. A secret ballot is held from 6-8pm. The party's MPs decide that they have confidence in Johnson's leadership. However, more than 40% vote against him, with a result of 211 to 148.\n* 23 June – By-elections take place in Wakefield and Tiverton and Honiton. Labour win in Wakefield, while the Liberal Democrats win in Tiverton and Honiton, overturning a substantial Conservative majority.\n* 25 June – Following Conservative losses at the Wakefield and Tiverton and Honiton by-elections, it is reported that Prime Minister Boris Johnson has said he is \"thinking actively\" about fighting the next two general elections, which would make him the UK's longest serving post-war prime minister.\n* 27 June – The Conduct of Employment Agencies and Employment Businesses (Amendment) Regulations 2022 and Liability of Trade Unions in Proceedings in Tort (Increase of Limits on Damages) Order 2022 are brought before Parliament.\n* 28 June – Scotland's First Minister, Nicola Sturgeon, announces the publication of the Scottish Government's Scottish Independence Referendum Bill, and proposes 19 October 2023 as the date for a second Scottish independence referendum.\n* 30 June – Tamworth MP Chris Pincher resigns as Conservative Party deputy chief whip, saying he \"embarrassed myself and other people\" and \"drank far too much\" following an incident at a party at the Carlton Club the previous evening.\nJuly\n* 1 July –\n** Chris Pincher has the Conservative Party Whip withdrawn and will sit in the House of Commons as an independent MP.\n** A formal complaint about the conduct of Chris Pincher is lodged with the Independent Complaints and Grievance Scheme (ICGS).\n* 3 July –\n** A further six allegations against Chris Pincher emerge, involving behaviour over a decade. Three complaints are that Pincher made unwanted advances against other male MPs, one in a bar at the House of Commons and one in Pincher's parliamentary office. One complainant is reported to have given 10 Downing Street details in February 2022 and expressed concerns over Pincher becoming a whip in charge of other MPs' welfare. Pincher maintains he has no intention of resigning as an MP.\n** Work and Pensions Secretary Therese Coffey tells the BBC Prime Minister Boris Johnson was not aware of \"specific allegations\" against Pincher at the time of his appointment as Deputy Chief Whip in February 2022.\n* 5 July –\n** Downing Street concedes that Johnson was aware of some allegations against Chris Pincher when he was appointed as Deputy Chief Whip in February 2022.\n** In an interview with the BBC's Chris Mason, Johnson says he had been told about a misconduct complaint against Pincher before appointing him to the role of Deputy Chief Whip in February 2022. Johnson describes his decision as a \"bad mistake\".\n** Sajid Javid resigns as health secretary, saying he \"can no longer, in good conscience, continue serving in this government.\"\n** Rishi Sunak, the chancellor, also resigns, saying the public expect government to be conducted \"properly, competently and seriously.\"\n** Andrew Murrison resigns as Prime Ministerial Trade Envoy to Morocco, commenting \"Others must square their continuing enjoyment of your patronage with their personal sense of decency, honour and integrity but I no longer can\".\n** Bim Afolami, vice chair of the Conservative party, resigns on air during an interview with TalkTV.\n** Jonathan Gullis resigns as Parliamentary Private Secretary to the Secretary of State for Northern Ireland, saying \"we have been focused on dealing with our reputational damage rather than delivering for the people.\"\n** Saqib Bhatti, Parliamentary Private Secretary to now former health secretary Sajid Javid, also resigns.\n** Nicola Richards, Parliamentary Private Secretary to the Department for Transport, quits her role, describing the Conservative Party as \"currently unrecognisable.\"\n** Virginia Crosbie, Parliamentary Private Secretary to the Wales Office, also resigns.\n** Alex Chalk resigns as Solicitor General, citing the Owen Paterson scandal, Partygate and the Chris Pincher scandal.\n** Saqib Bhatti resigns as Parliamentary Private Secretary to the Secretary of State.\n** Laura Trott resigns as Parliamentary Private Secretary to the Department for Transport, citing \"trust in politics is – and must always be – of the utmost importance, but sadly in recent months this has been lost\".\n* 6 July –\n** Will Quince an education minister, resigns after \"accepting and repeating assurances to the media [from No 10] which have now been found to be inaccurate\".\n** Robin Walker resigns as Minister of State for School Standards, saying he cannot \"in good conscience\" serve in Johnson's government.\n** John Glen resigns as Economic Secretary to the Treasury, citing \"poor judgment\" shown by Johnson.\n** Victoria Atkins resigns as Minister of State for Prisons and Probation, citing concerns with party leadership.\n** Jo Churchill resigns as Parliamentary Under-Secretary of State for Agri-Innovation and Climate Adaptation, citing concerns over \"integrity, competence, and judgement\" by the Prime Minister.\n** Stuart Andrew resigns as Minister of State for Housing, saying \"our party and more importantly our great country deserve better.\"\n** Felicity Buchan resigns as Parliamentary Private Secretary in the Department for Business, Energy and Industrial Strategy.\n** Selaine Saxby resigns as Parliamentary Private Secretary to the Treasury, citing concerns over \"trust, truth and integrity\" in government.\n** Claire Coutinho resigns as Parliamentary Private Secretary to the Treasury, saying \"events of recent weeks\" are a distraction.\n** David Johnston resigns as Parliamentary Private Secretary in the Department for Education, citing concerns over Johnson's leadership.\n** Five ministers – Kemi Badenoch, Neil O'Brien, Alex Burghart, Lee Rowley and Julia Lopez – issue a joint resignation letter, saying \"it has become increasingly clear that the government cannot function given the issues that have come to light\" and calling on Johnson to resign.\n** Mims Davies resigns as Parliamentary Under-Secretary at the Department for Work and Pensions, saying Johnson has failed to uphold \"the highest standards in public life\".\n** Duncan Baker resigns as Parliamentary Private Secretary to the Department for Levelling Up, saying he does not have confidence in the Prime Minister.\n** Craig Williams resigns as Parliamentary Private Secretary to the chancellor, saying that rebuilding public trust is now \"impossible\" for Johnson.\n** Rachel Maclean resigns as Minister for Safeguarding, saying \"values, principles, integrity and decency matter more than anything\".\n** Mark Logan resigns as a Parliamentary Private Secretary, saying \"there is only so much anyone can expect my constituents to accept and ignore.\"\n** Mike Freer resigns as both Minister for Exports and Minister for Equalities stating it was in addition “creating an atmosphere of hostility for LGBT+ people” and in protest over Johnson's leadership.\n** Boris Johnson sacks Secretary of State for Levelling Up Michael Gove, due to Gove's calls for him to resign.\n** In an interview with ITV's Robert Peston, Attorney General Suella Braverman announces that she will stand in a Conservative Party leadership election if one is called.\n* 7 July\n** Education Secretary Michelle Donelan resigns after 36 hours in the post.\n** Boris Johnson resigns as Conservative Party leader as a result of the resignations from his ministry, prompting a leadership election.\n** Tom Tugendhat, Chair of the Foreign Affairs Select Committee, announces he will put his name forward for the July 2022 Conservative Party leadership election.\n** Deputy Prime Minister Dominic Raab, former Secretary of State for Levelling Up Michael Gove and former Health Secretary Matt Hancock rule themselves out of the race to succeed Johnson.\n* 8 July –\n** Former Chancellor Rishi Sunak launches his campaign for the July 2022 Conservative Party leadership election.\n** Stephen Greenhalgh resigns as Building Safety and Fire Minister, citing the events leading up to Johnson's resignation.\n* 9 July –\n** Former Health Secretary Sajid Javid launches his campaign to be the next leader of the Conservative Party.\n** Jeremy Hunt, also a former Health Secretary, launches his bid to be the next Conservative Party leader.\n** Transport Secretary Grant Shapps launches his Conservative Party leadership campaign.\n** Chancellor Nadhim Zahawi announces his intention to run in the Conservative Party leadership election.\n** Former Equalities Minister Kemi Badenoch announces her candidacy for the 2022 Conservative Party leadership election.\n** Defence Secretary Ben Wallace, considered a favourite to succeed Johnson in a recent ConservativeHome poll, rules himself out of entering the leadership contest.\n* 10 July –\n** Secretary of State for Trade Policy Penny Mordaunt launches her Conservative Party leadership campaign.\n** Foreign Secretary Liz Truss becomes the tenth Conservative MP to launch a bid to succeed Johnson as leader.\n** Rehman Chishti declares his intention to enter the Conservative leadership race.\n* 11 July –\n** Prime Minister Boris Johnson refuses to give his public support to any of the eleven candidates, instead preferring to concentrate on the job of government.\n** 1922 Committee chair Sir Graham Brady unveils the timetable for the leadership election, with the election due to complete on 5 September.\n** The Conduct of Employment Agencies and Employment Businesses (Amendment) Regulations 2022 is approved by MPs by 289 votes to 202.\n* 12 July –\n** Deputy Prime Minister Dominic Raab endorses Rishi Sunak.\n** Home Secretary Priti Patel rules herself out of running for the leadership role.\n** Transport Secretary Grant Shapps withdraws from the race and endorses Rishi Sunak.\n** Rehman Chisti withdraws from the race.\n** Former Health Secretary Sajid Javid withdraws from the race.\n** Nominations confirmed, with eight candidates going into the leadership race.\n** The UK government declines a Labour Party motion for a House of Commons vote of no confidence in a Johnson-led government.\n** Paul Nowak is named as the next General Secretary of the Trades Union Congress, and will succeed Frances O'Grady when she retires at the end of the year.\n* 13 July – Jeremy Hunt and Nadhim Zahawi are eliminated in the first round of voting, while Rishi Sunak and Penny Mordaunt are the frontrunners.\n* 14 July – Suella Braverman is eliminated in the second round of voting, while Rishi Sunak and Penny Mordaunt continue to be the frontrunners.\n* 18 July –\n** Tom Tugendhat is eliminated in the third round of the Conservative leadership election, with Rishi Sunak leading the votes.\n** The caretaker Johnson Government wins a House of Commons vote of confidence by 349 votes to 238.\n* 19 July –\n** Tobias Ellwood has the Conservative Whip withdrawn for missing the previous day's confidence vote in the Johnson ministry.\n** Kemi Badenoch is eliminated in the fourth round of Conservative leadership voting, with Rishi Sunak again topping the poll.\n* 20 July –\n** In the Commons, Johnson takes his final Prime Minister's Questions.\n** Penny Mordaunt is knocked out of the Conservative Party leadership race, leaving Rishi Sunak and Liz Truss to go head-to-head in a ballot of party members.\n** The Sizewell C nuclear power station receives government approval, with an estimated cost of £20 billion.\n* 21 July –\n** The UK's COVID-19 public inquiry launches with chair Baroness Hallett promising a robust look into the UK's handling of the pandemic and whether more could have been done.\n** The Conduct of Employment Agencies and Employment Businesses (Amendment) Regulations 2022 comes into force.\n* 27 July – Sam Tarry, a Labour MP representing Ilford South, is dismissed from his post as a shadow transport minister after joining picketing railway workers at London's Euston station during the 2022 railway strike. Labour says his dismissal has nothing to do with his decision to join the picket line, but is due to unauthorised media interviews he gave throughout the day.\nAugust\n* 3 August – The sending out of ballot papers for the Conservative leadership election has been delayed amid security concerns after GCHQ warned hackers could change people's votes.\n* 8 August – Buckingham Palace confirms the Queen will interrupt her annual holiday at Balmoral Castle to meet the incoming prime minister in September.\n* 11 August – The Prime Minister, Chancellor, and Business Secretary meet representatives of energy companies to discuss the ongoing price rises, but the meeting concludes without any firm resolution.\n* 15 August – The Cabinet Office announces the launch of an emergency warning system to send alerts about severe weather and other life-threatening events to mobile phones. The system will launch in October and cover England, Scotland and Wales.\n* 16 August – Conservative MP William Wragg announces on Twitter that he is taking a break from his duties, due to severe depression and anxiety.\n* 18 August – SNP Margaret Ferrier pleads guilty to breaking COVID restrictions at Glasgow Sheriff Court.\n* 31 August – Buckingham Palace confirms that the Queen will appoint the next Prime Minister at Balmoral, breaking with tradition by not returning to London to make the appointment.\nSeptember\n* 1 September – In one of his last actions as Prime Minister, Johnson confirms that the government will provide £700 million in funding for the Sizewell C nuclear power station.\n* 2 September –\n** Sky News has reported that a Cabinet minister and a senior Downing Street aide in the Johnson Government are facing allegations of sexual misconduct following claims made by two women at Westminster.\n** Johnson appoints journalist and author Harry Mount to the House of Lords appointments commission, the body that oversees the appointment of new peers; he takes up the role on 11 September.\n** Voting closes for the Conservative Party leadership election.\n** A review carried out by former chief inspector of constabulary Sir Tom Winsor concludes that Dame Cressida Dick \"felt intimidated\" into resigning as Commissioner of the Metropolitan Police after an ultimatum from Mayor of London Sadiq Khan. Khan accuses the report of being biased.\n** During a tour of the House of Commons members of Extinction Rebellion stage a protest by gluing themselves together around the Speaker's Chair, leading to eight arrests and questions about security.\n* 5 September –\n** July 2022 Conservative Party leadership election: Liz Truss is elected as the leader of the Conservative Party, winning 57.4% of the final vote to Rishi Sunak's 42.6%.\n** Priti Patel resigns as Home Secretary and Ben Elliot resigns as Co-chairman of the Conservative Party.\n** Dean Lockhart resigns from the Scottish Parliament and is replaced by Roz McCall.\n** 2022 House of Commons protest.\n* 6 September –\n** Boris Johnson makes his final speech as prime minister before stepping down from the role, referencing Lucius Quinctius Cincinnatus, a Roman general who was called upon to return to Rome as a dictator.\n** Boris Johnson travels to Balmoral to officially offer his resignation to The Queen.\n** The Queen performs her final duty by appointing the new Prime Minister, Liz Truss.\n** Liz Truss becomes Prime Minister of the United Kingdom, and forms the Truss ministry.\n*** Therese Coffey is appointed as Secretary of State for Health and Deputy Prime Minister.\n*** Kwasi Kwarteng is appointed as Chancellor of the Exchequer.\n*** James Cleverly is appointed Foreign Secretary.\n*** Suella Braverman is appointed as Home Secretary.\n*** Wendy Morton is appointed Chief Whip.\n*** Ben Wallace is appointed Secretary of State for Defence.\n*** Brandon Lewis is appointed as Secretary of State for Justice.\n** Scotland's First Minister Nicola Sturgeon announces a number of measures to offset the effect of the cost of living crisis in Scotland. These include a rent freeze for public and private rented properties, a temporary eviction ban, a freeze on rail fares and an increase in the Scottish Child Payment to £25 per week.\n** The Scottish government announces the Criminal Justice (Scotland) Bill 2022 which will abolish the not proven verdict from Scottish law.\n* 7 September –\n** Liz Truss attends her first Prime Minister's Questions as prime minister.\n** Buckingham Palace announces that the Queen has postponed an online meeting of the Privy Council after being advised to rest by doctors.\n* 8 September –\n** Liz Truss announces plans to limit energy bills, with a bill for a typical household capped at £2,500 a year for the next two years. A new six month scheme to limit bills for businesses is also announced.\n** Buckingham Palace issues a statement at lunchtime announcing that The Queen is under 'medal supervision' at Balmoral and that her doctors were 'concerned' for her health.\n** House of Commons Speaker Sir Lindsay Hoyle, and many other senior political figures, make statements about the health of the Queen.\n** The Duke of York, The Earl & Countess of Wessex and The Duke of Cambridge travel to Balmoral over concerns of The Queen's health.\n** At 3.10pm, The Queen died peacefully at Balmoral.\n** At 6.30pm, Buckingham Palace announces the death of The Queen.\n** Charles, Prince of Wales becomes King of the United Kingdom and head of the Commonwealth of Nations upon the death of his mother.\n* 9 September –\n** The House of Commons begins two days of tributes to the Queen, after which Parliament will be suspended until after 21 September. Liz Truss opens the proceedings by describing the late monarch as \"one of the greatest leaders the world has known\".\n** The King and The Queen Consort travel from Balmoral to London. The King enters Buckingham Palace for his first time as monarch.\n** The King addresses the nation for the first time as The King and grants the title of Prince of Wales to The Duke of Cornwall & Cambridge.\n* 10 September –\n** Historic ceremonies take place at St James's Palace and the Royal Exchange, with Prince William, Queen Camilla, serving politicians and former prime ministers in attendance, as Charles III is formally proclaimed king.\n** Senior MPs, including Prime Minister Liz Truss, swear an Oath of Allegiance to Charles III in a special session of Parliament.\n** The UK Government announces that Monday 19 September, the date of the state funeral of Elizabeth II, will be a national bank holiday.\n* 11 September –\n** The Coffin bearing the late Queen travels from Balmoral to Edinburgh.\n* 12 September –\n** The King addresses Parliament as monarch for the first time.\n** The King visits Scotland where he makes his first address to the Scottish Parliament as monarch.\n** A Service of Thanksgiving is held in St. Giles Cathedral for The late Queen.\n* 13 September – The King travels to Northern Ireland, where he meets senior politicians from Northern Ireland and the Irish Republic\n* 14 September – The Coffin bearing The Late Queen travels to London.\n* 15 September – The Late Queen lies in State in Westminster Hall until the morning of the day of her funeral.\n* 16 September – The King travels to Wales, where he meets senior politicians and addresses the Senedd in both Welsh and English.\n* 19 September – The state funeral of Elizabeth II takes place at Westminster Abbey, followed by a burial at St George's, Windsor.\n* 21 September –\n** The House of Commons returns following the funeral of Elizabeth II.\n** The UK government announces a scheme that will freeze wholesale gas and electricity prices for businesses for six months from 1 October.\n* 22 September –\n** The UK government reverses the ban on fracking in the UK.\n**UK interest rates rise from 1.75 to 2.25%, the biggest increase in 27 years, as the Bank of England attempts to curb inflation.\n** The UK government announces a 1.25% rise in National Insurance contributions will be reversed from 6 November. The planned Health and Social Care Levy will also be scrapped.\n* 23 September – Chancellor Kwasi Kwarteng delivers an emergency mini-budget in which he announces the biggest tax cuts in the UK since 1972. The 45% top rate of income tax, paid by only the highest earners, will be scrapped, while the basic rate will be reduced from 20% to 19%. The cap on bankers' bonuses is lifted, and a planned rise in corporation tax is also scrapped. An increase in National Insurance is reversed, while the threshold before stamp duty is paid in England and Northern Ireland is raised to £425,000 for first time buyers and £250,000 for everyone else.\n* 27 September – Keir Starmer delivers his speech at the Labour Party Conference in Liverpool, presenting his vision for a \"fairer, greener Britain\". Alongside a boost in NHS funding, this plan would include a new publicly owned company, Great British Energy, and a target for 100% of the country's electricity being from zero carbon sources by 2030.\nOctober\n* 3 October – Following a backlash, the government announces the cancellation of their plan to abolish the highest income tax band.\n* 5 October – Liz Truss makes her first Conservative Party Conference speech as Prime Minister, saying she is focused on \"growth, growth, growth\" and decrying what she calls an \"anti-growth coalition\". The event is interrupted by protesters from Greenpeace.\n* 7 October – Conor Burns is dismissed as Minister of State for Trade Policy after a complaint of serious misconduct.\n* 8 October – The Scottish National Party hold their first in-person annual conference in Aberdeen since the start of the COVID-19 pandemic.\n* 10 October – Greg Hands is named to replace Conor Burns at the Department for International Trade.\n* 14 October –\n** Kwasi Kwarteng is sacked as Chancellor following the continued economic turmoil sparked by the mini-budget, and replaced by Jeremy Hunt. At the same time, Chris Philp is replaced by Edward Argar as Chief Secretary to the Treasury.\n** In a Downing Street press conference, Truss confirms a reversal of her plan to scrap an increase in corporation tax and admits \"it is clear that parts of our mini-budget went further and faster than markets were expecting.\"\n* 15 October – Speaking on BBC Radio 4's Today programme the day after his appointment as Chancellor Jeremy Hunt concedes that mistakes were made with the mini-budget outlined by his predecessor, chiefly that Kwarteng was wrong to cut the top tax rate, and that some taxes will have to be increased.\n* 17 October –\n** The new Chancellor, Jeremy Hunt, delivers an emergency statement to the Commons, in which he announces that the government \"will reverse almost all the tax measures\" from the mini-budget. The reconfigured budget will raise £32bn, out of the £70bn needed to close the funding gap.\n** First Minister of Scotland Nicola Sturgeon released the third paper in her Building a New Scotland series, explaining how Scotland's economy would function post-independence.\n* 19 October – Suella Braverman resigns as Home Secretary, following a breach of security protocol. She is succeeded by Grant Shapps.\n* 20 October – Liz Truss resigns as Prime Minister of the United Kingdom, triggering another Conservative Party leadership election.\n* 21 October – Penny Mordaunt becomes the first Conservative MP to formally put her name forward as Liz Truss's successor.\n* 23 October –\n** Rishi Sunak enters the race to be the next Conservative leader.\n** Boris Johnson rules himself out of the race to become the next prime minister.\n* 24 October – Penny Mordaunt drops out of the Conservative leadership race, leaving Rishi Sunak to be declared the winner. The next day, he became the first British Asian prime minister, and the youngest person to hold the office for more than 200 years.\n* 25 October –\n** Rishi Sunak becomes the 57th Prime Minister of the United Kingdom after meeting King Charles III at Buckingham Palace.\n** Dominic Raab is appointed as deputy prime minister, replacing Therese Coffey.\n** Jeremy Hunt remains as chancellor.\n** James Cleverly remains as foreign secretary.\n** Ben Wallace remains as defence secretary.\n** Suella Braverman is reappointed as home secretary six days after resigning.\n** Grant Shapps is appointed as business secretary, replacing Jacob Rees Mogg, who resigns from the post.\n** Steve Barclay is appointed as health secretary, replacing Therese Coffey.\n* 26 October –\n** Sunak reimposes a ban on fracking in the UK, undoing the plan by Liz Truss, and in line with the Conservative Party's original election manifesto of 2019.\n** Chancellor Jeremy Hunt defers the statement on the government's Medium Term Fiscal Plan from 31 October to 17 November, and confirms it will be an autumn statement.\n* 28 October –\n** Northern Ireland Secretary Chris Heaton-Harris announces that a fresh election will be called after efforts to form a government were blocked by the Democratic Unionist Party in protest at the impact of the Northern Ireland Protocol.\n** Ash Regan resigns as Scottish Minister for Community Safety.\n* 29 October – ITV News journalist Amber de Botton is appointed as the new Downing Street Director of Communications.\nNovember\n* 1 November – Former Health Secretary Matt Hancock is suspended from the Conservative Party after joining the cast of ''I'm a Celebrity...Get Me Out of Here!''. He now sits as an independent MP.\n* 4 November – Northern Ireland Secretary Chris Heaton-Harris indefinitely postpones plans for a snap Northern Ireland Assembly election.\n* 6–7 November – Prime Minister Sunak attends the high level segment of COP27.\n* 8 November –\n** Details of the 2023 review of Westminster constituencies are published, and are expected to be finalised in July 2023.\n** Sir Gavin Williamson resigns as Minister of State without Portfolio following allegations of bullying.\n* 10 November – Northern Ireland Secretary Chris Heaton-Harris announces that Northern Ireland will hold an election in 2023.\n* 14 November – Charles III begins the process of increasing the number of senior royals who can stand in for him on official duties, proposing Princess Anne and Prince Edward be added to the four presently named in a request read to the House of Lords.\n* 17 November – The Chancellor, Jeremy Hunt, delivers his autumn statement to the House of Commons.\n* 19 November – Sunak makes his first visit as prime minister to Kyiv to meet with President Volodymyr Zelenskyy.\n* 23 November –\n** The Supreme Court rules that the Scottish Government cannot hold a second Scottish independence referendum without the UK government's consent.\n** The Advisory Committee on Business Appointments finds that Matt Hancock broke government rules on post-ministerial jobs by not consulting the watchdog before joining ''I'm A Celebrity...Get Me Out of Here!'', but its chairman, Eric Pickles, advises it would be disproportionate to take action against him.\nDecember\n* 1 December –\n** A parliamentary by-election is held in Chester. Labour's Samantha Dixon holds the seat with an increased majority.\n** Ian Blackford announces his resignation as Leader of the Scottish National Party in the House of Commons.\n* 2 December –\n** Former Health Secretary Matt Hancock returns to Westminster following his participation in ''I'm a Celebrity...Get Me Out of Here!''.\n** Former Chancellor of the Exchequer and Health Secretary Sajid Javid announces he will stand down as an MP at the next general election.\n* 6 December –\n** Stephen Flynn is elected to lead the SNP at Westminster, replacing Ian Blackford.\n** Conservative Party peer Michelle Mone is to request a leave of absence from the House of Lords to clear her name after allegations she benefitted a company she recommended for a COVID contract.\n* 7 December –\n** Former Health Secretary Matt Hancock confirms he will not stand for Parliament again at the next general election.\n** Kate Bell is appointed as Assistant General Secretary of the TUC and will take up the role when Paul Nowak assumes the role of General Secretary.\n* 14 December – Following previous allegations of bullying by Deputy Prime Minister Dominic Raab, five further complaints are investigated, taking the total number to eight.\n* 15 December –\n**A parliamentary by-election is held in Stretford and Urmston. Andrew Western holds the seat for Labour.\n**The UK government extends the current parliamentary session to allow more time for legislation to pass through parliament, with the next State Opening of Parliament now expected to occur in Autumn rather than Spring 2023.\n* 22 December –\n** Sir Laurie Magnus, chairman of Historic England, is appointed by Sunak as his new Independent Adviser on Ministers' Interests.\n** MSPs vote to approve the Gender Recognition Reform (Scotland) Bill by 86 votes to 39.\n* 29 December – Paul Nowak succeeds Frances O'Grady as General Secretary of the Trades Union Congress.\nDeaths\n* 7 January\n** Jack Dromey, Labour MP for Birmingham Erdington (since 2010) and Shadow Minister, husband of Harriet Harman (b. 1948).\n** Robert Hughes, Baron Hughes of Woodside, politician, MP (1970–1997) and chair of the Anti-Apartheid Movement (1976–1995) (b. 1932).\n* 16 January – Paul Myners, Baron Myners, politician, member of the House of Lords (since 2008) (b. 1948).\n* 24 January – Ronnie Fearn, Baron Fearn, politician, MP (1987–1992, 1997–2001), member of the House of Lords (2001–2018) (b. 1931).\n* 9 February – Peter Neilson, English-born New Zealand politician, minister of works and development (1990) and MP (1981–1990) (b. 1954).\n* 13 February – Aled Roberts, Welsh politician, AM (2011–2016) (b. 1962).\n* 15 February – David Chidgey, Baron Chidgey, politician, MP (1994–2005) and member of the House of Lords (since 2005) (b. 1942).\n* 19 February –\n** Sir Richard Shepherd, politician, MP (1979–2015) (b. 1942).\n** Christopher Stalford, Northern Irish politician, MLA (since 2016) (b. 1983).\n* 6 April – Jill Knight, politician, MP (1966–1997), member of the House of Lords (1997–2016) (b. 1923).\n* 15 April – Henry Plumb, Baron Plumb, politician, member (1979–1999) and president (1987–1989) of the European Parliament, member of the House of Lords (1987–2017) (b. 1925).\n* 5 June – Roger Swinfen Eady, 3rd Baron Swinfen, politician and philanthropist, member of the House of Lords (since 1977) (b. 1938).\n* 23 June – Sally Greengross, Baroness Greengross, politician, member of the House of Lords (since 2000) and wife of Alan Greengross (b. 1935).\n* 24 July – Sir William Wright, Northern Irish bus manufacturer (Wrightbus) and politician, member of the constitutional convention (1975–1976) (b. 1927).\n* 25 July – David Trimble, Baron Trimble, Northern Irish politician, first minister (1998–2002), MP (1990–2005) and member of the House of Lords (since 2006), Nobel Prize laureate (1998) (b. 1944).\n* 23 August – David Shaw, politician, MP for Dover (1987–1997) (b. 1950).\n* 25 August – Giles Radice, politician, MP (1973–2001) and member of the House of Lords (2001–2022), cancer (b. 1936).\n* 29 August – Mick Bates, Welsh politician, AM (1999–2011), cancer (b. 1947).\n* 8 September – Elizabeth II, Queen of the United Kingdom (1952–2022) (b. 1926).\n* 9 September – Clive Tanner, English-born Canadian politician, British Columbia MLA (1991–1996) (b. 1934).\n* 11 September – Malcolm Erskine, 17th Earl of Buchan, Scottish peer, member of the House of Lords (1984–1999) (b. 1930).\n* 21 October – May Blood, Baroness Blood, Northern Irish politician (b. 1938).\n* 7 November – Nigel Jones, Baron Jones of Cheltenham, politician, MP (1992–2005) and member of the House of Lords (since 2005), complications during surgery (b. 1948).\n* 8 November – Sam Gardiner, Northern Irish politician, MLA (2003–2016) and three-time mayor of Craigavon (b. 1940).\n* 22 November – Edward Kellett-Bowman, politician, MEP (1979–1984, 1988–1999) (b. 1931).\n* 9 December – David Young, Baron Young of Graffham, politician, secretary of state for trade and industry (1987–1989) and employment (1985–1987), member of the House of Lords (1984–2022) (b. 1932).\n* 12 December – Philippa Roe, Baroness Couttie, politician, leader of Westminster City Council (2012–2017) and member of the House of Lords (since 2016), cancer (b. 1962).\n* 15 December – Veronica Linklater, Baroness Linklater of Butterstone, politician, member of the House of Lords (1997–2016), complications from Alzheimer's disease (b. 1943).\nReferences"
    }
  ]
}