{
  "content": [
    {
      "type": "text",
      "text": "# 2022 Queenstown-Lakes District Council election\n\n5.81 pp   (12,492 out of 28,088 enrolled voters)\n| module = }}}}\nThe 2022 Queenstown-Lakes District Council election took place between 16 September and 8 October 2022 via postal vote as part of nation-wide local elections.\nElectoral System\nAlongside the mayor, there are eleven councillors elected across three wards. The three wards are Queenstown-Whakatipu (four councillors), Wānaka-Upper Clutha (four councillors), and Arrowtown-Kawarau (three councillors). The ward arrangements are new following a representation review in 2021.\nThis replaced the previous structure of three wards: Queenstown-Wakatipu (six councillors), Arrowtown (one councillor), and Wānaka (three councillors). Wānaka-Upper Clutha retains the same boundaries as the former Wānaka ward, but was renamed and gained an additional councillor. Queenstown-Whakatipu largely covers the same area as Queenstown-Wakatipu, although it transferred its eastern area (including the settlements of Gibbston, Arthurs Point, Shotover Country and Lake Hayes Estate) to the newly created Arrowtown-Kawarau.\nAll officials were elected through a  first-past-the-post system via postal voting.\nMayoral Election\nThe incumbent Mayor, Jim Boult, decided not to stand after serving two terms. Glyn Lewers, a sitting councillor was elected mayor.\nResults\nCouncil\nQueenstown-Whakatipu Ward\nThe Queenstown-Whakatipu ward returned four councillors to the district council. Councillors Valerie Miller and Penny Clark who represented the former Queenstown-Wakatipu ward decided not to stand for re-election.\nArrowtown-Kawarau Ward\nThe Arrowtown-Kawarau ward returned three councillors to the district council.\nWānaka-Upper Clutha Ward\nThe Wānaka-Upper Clutha ward returned four councillors to the district council. Incumbent councillors Calum MacLeod and Niamh Shaw decided not to stand for re-election.\nOther local elections\nDepending on where in Queenstown-Lakes they lived, voters also voted in concurrent local elections for the:\n*Wānaka-Upper Clutha Community Board\nReferences"
    }
  ]
}