{
  "content": [
    {
      "type": "text",
      "text": "# 2022 Delaware Senate election\n\n1\n| popular_vote1 = 144,347\n| percentage1 = 52.18%\n| swing1 =\n| 1data1 =\n| 2data1 =\n| seats_needed1 =\n| image2 = File:Gerald Hocker.jpg\n| image_size = 150x150px\n| leader2 = Gerald Hocker\n| party2 = Republican\n| colour2 = ff3333\n| leaders_seat2 = 20th - Ocean View\n| leader_since2 = November 7, 2018\n| last_election2 = 7\n| seats_before2 = 7\n| seats2 = 6\n| seat_change2 =  1\n| popular_vote2 = 132,280\n| percentage2 = 47.82%\n| swing2 =\n| 1data2 =\n| 2data2 =\n| seats_needed2 =  4\n| map_image = 2022 Delaware State Senate election.svg\n| map_size = 200px\n| map_caption = Results:\n| title = President pro tempore\n| before_election = David Sokola\n| before_party = Delaware Democratic Party\n| after_election = David Sokola\n| after_party = Delaware Democratic Party\n}}\nThe 2022 Delaware Senate election were held on November 8, 2022, concurrently with the elections for the Delaware House of Representatives, to elect members to the Delaware General Assembly. All of the 21 seats in the Delaware Senate were up for election. The Democratic and Republican primaries were held on September 13, 2022.\nDemocrats gained one seat, increasing their supermajority to 15 out of 21 seats.\nBackground\nPredictions\n{| class=\"wikitable\" style=\"text-align:center\"\n!Source\n!Ranking\n!As of\n|-\n| align=\"left\" |Sabato's Crystal Ball\n|\n|May 19, 2022\n|}\nOverview\n{| class=\"wikitable\"\n| colspan=\"13\" align=\"center\" |\n|-\n! colspan=\"2\" rowspan=\"2\" |Party\n! rowspan=\"2\" |Candidates\n! colspan=\"2\" |Votes\n! colspan=\"3\" |Seats\n|-\n!\n! %\n!Before\n!After\n!+/–\n|-\n! style=\"background-color:\" |\n|Democratic\n| align=\"right\" |16\n| align=\"right\" |144,368\n| align=\"right\" |51.85\n| align=\"right\"  |14\n| align=\"right\" |15\n| align=\"right\" | 1\n|-\n! style=\"background-color:\" |\n|Republican\n| align=\"right\" |14\n| align=\"right\" |132,293\n| align=\"right\" |47.51\n| align=\"right\" |7\n| align=\"right\" |6\n| align=\"right\" | 1\n|-\n! style=\"background-color:\" |\n|Independent\n| align=\"right\" |0\n| align=\"right\" |1,257\n| align=\"right\" |0.45\n| align=\"right\" |0\n| align=\"right\" |0\n| align=\"right\" |\n|-\n! style=\"background-color:\" |\n|Libertarian\n| align=\"right\" |1\n| align=\"right\" |541\n| align=\"right\" |0.19\n| align=\"right\" |0\n| align=\"right\" |0\n| align=\"right\" |\n|-\n| colspan=\"3\" align=\"left\" |Total\n| align=\"right\" |278,459\n| align=\"right\" |100.00\n| align=\"right\" |21\n| align=\"right\" |21\n| align=\"right\" |\n|}\nSummary by district\n{| class=\"sortable wikitable\" style=\"font-size:95%;line-height:14px;\"\n! class=\"unsortable\" |District\n! class=\"unsortable\" |Incumbent\n! colspan=\"2\" |Party\n! class=\"unsortable\" |Elected Senator\n! colspan=\"2\" |Party\n|-\n|1st\n|Sarah McBride\n| style=\"background:;\" |\n|Dem\n|Sarah McBride\n| style=\"background:;\" |\n|Dem\n|-\n|2nd\n|Darius Brown\n| style=\"background:;\" |\n|Dem\n|Darius Brown\n| style=\"background:;\" |\n|Dem\n|-\n|3rd\n|Elizabeth Lockman\n| style=\"background:;\" |\n|Dem\n|Elizabeth Lockman\n| style=\"background:;\" |\n|Dem\n|-\n|4th\n|Laura Sturgeon\n| style=\"background:;\" |\n|Dem\n|Laura Sturgeon\n| style=\"background:;\" |\n|Dem\n|-\n|5th\n|Kyle Evans Gay\n| style=\"background:;\" |\n|Dem\n|Kyle Evans Gay\n| style=\"background:;\" |\n|Dem\n|-\n|6th\n| style=\"background:#E9E9E9;\" |Ernesto Lopez\n| style=\"background:;\" |\n|Rep\n|Russ Huxtable\n| style=\"background:;\" |\n|Dem\n|-\n|7th\n|Spiros Mantzavinos\n| style=\"background:;\" |\n|Dem\n|Spiros Mantzavinos\n| style=\"background:;\" |\n|Dem\n|-\n|8th\n|David Sokola\n| style=\"background:;\" |\n|Dem\n|David Sokola\n| style=\"background:;\" |\n|Dem\n|-\n|9th\n|Jack Walsh\n| style=\"background:;\" |\n|Dem\n|Jack Walsh\n| style=\"background:;\" |\n|Dem\n|-\n|10th\n|Stephanie Hansen\n| style=\"background:;\" |\n|Dem\n|Stephanie Hansen\n| style=\"background:;\" |\n|Dem\n|-\n|11th\n|Bryan Townsend\n| style=\"background:;\" |\n|Dem\n|Bryan Townsend\n| style=\"background:;\" |\n|Dem\n|-\n|12th\n|Nicole Poore\n| style=\"background:;\" |\n|Dem\n|Nicole Poore\n| style=\"background:;\" |\n|Dem\n|-\n|13th\n|Marie Pinkney\n| style=\"background:;\" |\n|Dem\n|Marie Pinkney\n| style=\"background:;\" |\n|Dem\n|-\n|14th\n| style=\"background:#E9E9E9;\" |Bruce Ennis\n| style=\"background:;\" |\n|Dem\n|Kyra Hoffner\n| style=\"background:;\" |\n|Dem\n|-\n|15th\n|Dave Lawson\n| style=\"background:;\" |\n|Rep\n|Dave Lawson\n| style=\"background:;\" |\n|Rep\n|-\n|16th\n|Colin Bonini\n| style=\"background:;\" |\n|Rep\n|Eric Buckson\n| style=\"background:;\" |\n|Rep\n|-\n|17th\n|Trey Paradee\n| style=\"background:;\" |\n|Dem\n|Trey Paradee\n| style=\"background:;\" |\n|Dem\n|-\n|18th\n|Dave Wilson\n| style=\"background:;\" |\n|Rep\n|Dave Wilson\n| style=\"background:;\" |\n|Rep\n|-\n|19th\n|Brian Pettyjohn\n| style=\"background:;\" |\n|Rep\n|Brian Pettyjohn\n| style=\"background:;\" |\n|Rep\n|-\n|20th\n|Gerald Hocker\n| style=\"background:;\" |\n|Rep\n|Gerald Hocker\n| style=\"background:;\" |\n|Rep\n|-\n|21st\n|Bryant Richardson\n| style=\"background:;\" |\n|Rep\n|Bryant Richardson\n| style=\"background:;\" |\n|Rep\n|}\nClosest races\nSeats where the margin of victory was under 10%:\n#  gain\n#\nRetiring incumbents\nDemocrats\n# District 14: Bruce Ennis retired.\nRepublicans\n# District 6: Ernesto Lopez retired.\nIncumbents defeated\nIn primary elections\nRepublicans\n# District 16: Colin Bonini lost renomination to Eric Buckson.\nDetailed results\n{| class=\"toc\" id=\"toc\" summary=\"Contents\"\n| align=\"center\" |\nDistrict 1 • District 2 • District 3 • District 4 • District 5 • District 6 • District 7 • District 8 • District 9 • District 10 • District 11 • District 12 • District 13 • District 14 •\nDistrict 15 • District 16 • District 17 • District 18 • District 19 • District 20 • District 21\n__NOTOC__\n|}\nDistrict 1\nThe 1st district covers the northeastern tip of New Castle County along the Delaware River, including Claymont, Bellefonte, most of Edgemoor, and parts of northern Wilmington. First-term Democratic incumbent Sarah McBride, who was elected in 2020 with 73.3% of the vote, won a second term unopposed.\nDistrict 2\nThe 2nd district is based in southern and eastern Wilmington along the Delaware River in New Castle County, also covering Minquadale and parts of New Castle and Edgemoor. First-term Democratic incumbent Darius Brown, who was unopposed in 2018, won a second term unopposed.\nDistrict 3\nThe 3rd district is based in downtown Wilmington, also covering some unincorporated areas to the south. First-term Democratic incumbent Elizabeth Lockman, who was unopposed in 2018, won a second term unopposed.\nDistrict 4\nThe 4th district covers many of Wilmington's northwestern suburbs in New Castle County, including Hockessin, Greenville, Pike Creek, Talleyville, Granogue, Brandywine, Alapocas, Montchanin, Runnymeade, Delaware Heights, Rockland, Winterthur, Wooddale, and other unincorporated areas. First-term Democratic incumbent Laura Sturgeon, who was elected in 2018 with 53.1% of the vote, won a second term.\nDistrict 5\nThe 5th district covers the northern suburbs of Wilmington in New Castle County including Arden, Ardencroft, Ardentown, Windsor Hills, Naamans Manor, Wilmont, Talleys Corner, Afton, Shellburne, Windybush, Heatherbrooke, Chalfonte, and other unincorporated areas. First-term Democratic incumbent Kyle Evans Gay, who was elected in 2020 with 52.3% of the vote, won a second term.\nDistrict 6\nThe 6th district is based in the Cape Region in coastal Sussex County, covering Rehoboth Beach, Lewes, Milton, and the surrounding communities. Three-term Republican incumbent Ernesto Lopez, who was re-elected in 2018 with 52.6% of the vote, announced in July 2022 that he would not run for re-election. Democrat Russ Huxtable went on to flip the seat in the general election.\nDemocratic primary\nGeneral election\nDistrict 7\nThe 7th district covers the immediate western suburbs of Wilmington in New Castle County, including Elsmere, Newport, Westminster, Anglesey, and other unincorporated areas. First-term Democratic incumbent Spiros Mantzavinos, who was elected in 2020 with 51.4% of the vote, won a second term.\nDistrict 8\nThe 8th district is based in Newark – the state's third-largest city – and also covers parts of Hockessin and North Star. Ten-term Democratic incumbent David Sokola, who was unopposed in 2020, won an eleventh term.\nDistrict 9\nThe 9th district covers the areas between Newark and Wilmington in New Castle County, including parts of Pike Creek, Pike Creek Valley, Newport, Stanton, and far eastern Newark proper. Second-term Democratic incumbent Jack Walsh, who was elected in 2020 with 67.1% of the vote, won a third term.\nDistrict 10\nThe 10th district is based in Middletown, also covering Mount Pleasant, Summit Bridge, western Glasgow, and the southernmost reaches of Newark. First-term Democratic incumbent Stephanie Hansen, who was elected in 2018 with 62.1% of the vote, won a second term unopposed.\nDistrict 11\nThe 11th district covers communities immediately to the east of Newark in New Castle County, including Brookside, Christiana, Woodshade, Taylortown, and some of Bear. Third-term Democratic incumbent Bryan Townsend, who was elected in 2018 with 75.8% of the vote, won a fourth term unopposed.\nDistrict 12\nThe 12th district covers much of central New Castle County along the Delaware River, including Delaware City, Wrangle Hill, Williamsburg, Kirkwood, Greylag, Bayview Manor, Monterey Farms, and parts of Glasgow, Bear, New Castle, and Wilmington Manor. Third-term Democratic incumbent Nicole Poore, who was unopposed in 2020, won a fourth term.\nDistrict 13\nThe 13th district covers much of unincorporated New Castle County to the south of Wilmington, including Red Lion, Monterey Farms, Fairwinds, Duross Heights, Clearvier Manor, and parts of Bear and Wilmington Manor. First-term Democratic incumbent Marie Pinkney, who was elected in 2020 with 75.8% of the vote, won a second term unopposed.\nDistrict 14\nThe 14th district straddles the border between New Castle County and Kent County, covering all of Smyrna, Clayton, Odessa, Blackbird, and Leipsic, as well as parts of Middletown. Four-term Democratic incumbent Bruce Ennis, who was re-elected in 2020 with 59.5% of the vote, announced in 2021 that he would not run for re-election. Democrat Kyra Hoffner went on to win the seat in the general election.\nDemocratic primary\nGeneral election\nDistrict 15\nThe 15th district covers much of Kent County to the west of Dover, including Cheswold, Felton, Kenton, Marydel, Hartly, Willow Grove, Petersburg, Sandtown, and part of Viola. Four-term Republican incumbent Dave Lawson, who was elected in 2020 with 55.3% of the vote, won a fifth term unopposed.\nDistrict 16\nThe 16th district covers southern Dover and its suburbs in Kent County, including Highland Acres, Rising Sun-Lebanon, Kent Acres, Riverview, Magnolia, Woodside, Woodside East, Frederica, Little Creek, Bowers, and Little Heaven. Nine-term Republican incumbent Colin Bonini, who was elected in 2018 with 55% of the vote, lost the September 13th Republican primary, finishing last place in a 3-way race. Republican Eric Buckson went on to win the general election unopposed.\nRepublican primary\nGeneral election\nDistrict 17\nThe 17th district is based in Dover, covering most of the city proper as well as the nearby Kent County communities of Camden, Wyoming, and Rodney Village. First-term Democratic incumbent Trey Paradee, who was elected in 2018 with 64.3% of the vote, won a second term.\nDistrict 18\nThe 18th district covers southern Kent County and northern Sussex County, including the communities of Milford, Harrington, Greenwood, Ellendale, Houston, Farmington, Slaughter Beach, and Lincoln. First-term Republican incumbent Dave Wilson, who was elected in 2018 with 65.2% of the vote, won a second term.\nDistrict 19\nThe 19th district covers central Sussex County, including the communities of Georgetown, Bridgeville, and Long Neck. Third-term Republican incumbent Brian Pettyjohn, who was unopposed in 2020, won a fourth term unopposed.\nDistrict 20\nThe 20th district is based in southeastern Sussex County along the Atlantic Ocean, including the communities of Millsboro, Selbyville, Ocean View, Bethany Beach, Dagsboro, Frankford, Fenwick Island, Millville, South Bethany, Roxana, and Oak Orchard. Third-term Republican incumbent Gerald Hocker, who was unopposed in 2020, won a fourth term unopposed.\nDistrict 21\nThe 21st district is based in the southwestern corner of Sussex County, including the communities of Seaford, Laurel, Delmar, Bethel, Gumboro, and Reliance. Third-term Republican incumbent Bryant Richardson, who was elected in 2018 with 65.0% of the vote, won a fourth term.\nReferences"
    }
  ]
}