{
  "content": [
    {
      "type": "text",
      "text": "# 2022 Mexican presidential recall referendum\n\n| yes_text =\n| no_text = Should continue as President\n| yes = 1,063,209\n| no = 15,159,323\n| map = Consulta de revocación de mandato de México de 2022 por distrito federal.svg\n| mapdivision = federal electoral district\n| invalid = 280,104\n| electorate = 92,823,216\n}}\nA presidential recall referendum was held in Mexico on 10 April 2022 to decide if incumbent president Andrés Manuel López Obrador should stay in office and serve his full six-year term.\nThe recall had to be approved by an absolute majority of valid votes, and turnout had to be at least 40% for it to be valid. This was the first national recall election in Mexico. It was proposed by López Obrador himself during his candidacy in the 2018 election and requested by opponents and supporters of his government. It was organized by the Instituto Nacional Electoral, triggered by 2.7 million signatures from 17 states representing 3% of the electoral roll, following rules set by the constitution and the Federal Law of Revocation of Mandate.\nThe INE, which started preparations in August 2021, stated there was a lack of resources for the consultation organization, causing it to challenge the budget approved by the Chamber of Deputies and ask the Supreme Court of Justice of the Nation for their stance. In contrast, the president and other government figures assured that the organization did have the appropriate money. After suspending preparations, the decision for suspension was revoked by the Supreme Court's recess commission and the Federal Electoral Tribunal, which ordered the INE to perform the consultation. With that, on 4 February, the call for consultation was approved, causing the installation of 57,377 polling stations and 1.5 billion Mexican pesos available for the INE, less than half of the initially requested money.\nBackground\nDuring his presidential campaign, López Obrador promised to hold a recall election two years into his eventual government. Later, in government, on 19 March 2019, he signed a letter that stated ″In 2021, a consultation will be held to ask the citizens if they want me to continue governing or resign″ and rejected that ″the proposition of organizing the recall conceals the intention to reelect me in 2024,″ an accusation made by some opposition figures of the government. In October of the same year, the Mexican Senate approved the recall election in general, with 98 votes in favor, 22 against, and one abstention. For the particular changes in the Constitution relative to the recall election, the Senate voted 90 in favor and 22 against. In November, the Chamber of Deputies also approved it in general, with 372 votes in favor and 75 against. For the particular modifications in the Constitution, the Chamber of Deputies voted 356 in favor and 84 against. In December, once endorsed by 17 state congresses, the decree was published in the Official Journal of the Federation.\nDespite being planned for 2021, the constitutional changes stipulated its realization one year later, in 2022. At the start of August 2021, after the corruption trial referendum, López Obrador insisted that he promote the recall election. To this end, later in that month, the leader of the senators for the governing party Morena, Ricardo Monreal Ávila, signaled that he would look for an extraordinary period of the Congress to address the regulation of the recall process with the proposal ″Federal Law of Revocation of Mandate″ and seeking to eliminate the phrase ″because of loss of confidence″ from the proposal. The initial referendum wording proposed was: ″Do you agree that the tenure of the person holding the position of the president of the Republic be terminated early due to loss of confidence?″ Nevertheless, the legislative groups of Morena, the Ecologist Green Party of Mexico (PVEM), and the Labor Party (PT) did not get the necessary votes to convene the special session.\nOpinion polls\nThese polls were conducted after the federal law for recall elections and the referendum question were published. Some of these polls asked if the respondents approved of the president, not necessarily their stance on the referendum.\n{| class=\"wikitable toccolours sortable\" cellpadding=\"6\" cellspacing=\"0\" style=\"text-align:center; margin-right:.4em; margin-top:.4em; font-size:90%;\"\n|-\n! Date\n! Brand\n! class=\"unsortable\" |Sample size\n! class=\"unsortable\" style=\"background:#ffc010;color:#fff;\" | Resign\n! class=\"unsortable\" style=\"background:#0069b5;color:#fff;\" | Continue\n! class=\"unsortable\" style=\"background:#aaa;color:#fff;\" | Undecided\n! class=\"unsortable\"| Margin of error\n|-\n| 8-12 March 2022\n| SIMO Consulting\n| 800\n| 24%\n| style=\"background:#acf\" | 74%\n| 2%\n| ±3.46%\n|-\n| 11-13, 18-19, and 25-26 February 2022\n| El Financiero\n| 1,000\n| 30%\n| style=\"background:#acf\" | 63%\n| 7%\n| ±3.1%\n|-\n| 21 February 2022\n| Massive Caller\n| 2,000\n| 30.3%\n| style=\"background:#acf\" | 69.7%\n| —\n| ±2.2%\n|-\n| 13-14 February 2022\n| TResearch\n| 1,000\n| 36.4%\n| style=\"background:#acf\" | 60.5%\n| 3.0%\n| Unknown\n|-\n| 7 February 2022\n| Massive Caller\n| 1,000\n| 37.0%\n| style=\"background:#acf;\" | 59.5%\n| 3.5%\n| ±3.4%\n|-\n| 14-15 and 28-30 January 2022\n| El Financiero\n| 1,000\n| 40%\n| style=\"background:#acf;\" | 55%\n| —\n| ±3.1%\n|-\n| 4-6 December 2021\n| Parametría\n| 800\n| 27%\n| style=\"background:#acf;\" | 67%\n| 6%\n| ±3.5%\n|-\n| 10-12 and 17-19 December 2021\n| El Financiero\n| 1,100\n| 33%\n| style=\"background:#acf;\" | 63%\n| —\n| ±3.0%\n|-\n| 24-28 November 2021\n| Reforma\n| 1,000\n| 26%\n| style=\"background:#acf;\" | 68%\n| —\n| ±4.5%\n|-\n| 12-13 and 26-28 November 2021\n| El Financiero\n| 1,000\n| 34%\n| style=\"background:#acf;\" | 62%\n| —\n| ±3.1%\n|-\n| 18-23 November 2021\n| El Universal\n| Unknown\n| 22%\n| style=\"background:#acf;\" | 76%\n| 2%\n| Unknown\n|-\n| 15-16 and 29-31 October 2021\n| El Financiero\n| 1,002\n| 30%\n| style=\"background:#acf;\" | 69%\n| 1%\n| ±3.1%\n|-\n| 10-11 and 24-28 September 2021\n| El Financiero\n| 900\n| 31%\n| style=\"background:#acf;\" | 66%\n| 3%\n| ±3.3%\n|}\nReferences"
    }
  ]
}