{
  "content": [
    {
      "type": "text",
      "text": "# 2022–2024 United Kingdom railway strikes\n\n–\n| status =\n| goals = Improved pay and working conditionsOpposition to ticket office closures\n| methods =\n| result =\n| side1 =\n| side2 =\n| leadfigures1 =\n| leadfigures2 = General secretaries:\n}}\nThe 2022–2024 United Kingdom railway strikes were an industrial dispute between rail workers and companies, with the latter supported by the UK government. The rail workers were represented by several unions including the National Union of Rail, Maritime and Transport Workers (RMT) and the Associated Society of Locomotive Engineers and Firemen (ASLEF). The railway strikes commenced on 21 June 2022 after workers walked out over wages, threat of redundancies and planned changes to working practices (the removal of guards from trains, ticket office closures, and age changes to rail cards). The industrial action was the largest in the sector since 1989, and involved 40,000 workers nationwide. The dispute lasted for two years and ultimately resulted in victory for the unions, with improved pay deals concluded region by region. The last dispute was resolved in London in November 2024.\nThe dispute took place amid political interference by Conservative governments which blocked resolutions in England, and passed laws to restrict industrial action. They were unable to block a deal in Scotland and Wales as transport is devolved in those jurisdictions; as a result those disputes were resolved by the RMT in December 2022, and by ASLEF in May 2023. The Conservatives refused to negotiate in England until their defeat at the 2024 general election. Negotiations resumed with the incoming Labour government, and the last disputes outside of London were resolved that September. ASLEF suspended its London strike action in November and declared victory, ending the strikes. A concurrent dispute within Avanti West Coast continued until its resolution in March 2025, but this was not part of the wider regional issue.\nBackground\nThe rail network of Great Britain has operated under a franchising system since its privatisation in 1997, with services in England, Wales, and Scotland being run by a number of operating companies. (Northern Ireland's network is managed separately.) Following the onset of the COVID-19 pandemic in March 2020, the UK government relieved the companies of their franchises to protect them from financial harm, and issued new contracts that made rail revenue a government concern. Around £16billion of public money was also given by government to support the railways during the pandemic. With revenue from train fares having fallen by an estimated £2billion as a result of COVID, Network Rail and the various train operators were told to make savings. National negotiations for a wage increase for rail workers were ongoing, but with the Department for Transport (DfT) stating this had to be \"with clear direction from government about the modernisation that needs to be achieved\".\nModernisation programme\nThe National Union of Rail, Maritime and Transport Workers (RMT) has claimed that Network Rail is threatening to cut safety-critical jobs (an allegation rejected by Network Rail) as part of its modernisation programme, which would also include an increase in working hours. In 2022, rail workers also asked for a 7% pay rise to keep up with rising inflation (which stood at 9.1% in June 2022), but were initially offered 2%, with an extra 1% linked to redundancies. Critics of the strike, including Network Rail, point to changing commuter habits, such as a reduction in ticket office use, as well as more working from home since the COVID-19 pandemic, and passenger numbers continuing to be significantly below pre-COVID levels. The need for efficiency improvements and an end to outdated practices has also been highlighted, cited examples include requiring teams of up to nine people to do a job that could be completed by one person, and \"walking time\" of up to 12 minutes for staff members walking from their duties to the mess room during their breaks. On 23 June 2022, The Guardian reported it had seen documents confirming rail operators planned to \"repurpose\" all ticket offices within 18 months, requiring customers to buy every ticket online or via a ticket machine. The documents reportedly also contain plans to hire new employees on inferior terms and conditions, including a requirement they work on Sundays and work for longer to qualify for a pension. According to The Guardian this is linked to a maximum 3% pay rise.\nGovernment response\nWhile discussions have been ongoing between the RMT and the various train companies, the UK Government initially took a hands-off approach to negotiations. Grant Shapps, the Secretary of State for Transport until 6 September 2022, under the second Johnson ministry, said that it was not the government's job to negotiate with unions over pay and conditions. This stance has drawn criticism from RMT union officials, such as General Secretary Mick Lynch, as well as some politicians, including Conservative MP Jake Berry, who urged the government to join discussions. On 30 July 2022, Mick Whelan, General Secretary of the Associated Society of Locomotive Engineers and Firemen (ASLEF), another rail union involved in a dispute over pay and conditions, said during an appearance on LBC that he had not spoken to the Secretary of State for Transport for over two years, saying the last time they had spoken was \"very early on in the pandemic\".\nInitial ballot\nFollowing a ballot of National Union of Rail, Maritime and Transport Workers members over whether to take industrial action, it was announced on 24 May 2022 that they had voted in favour of strike action, paving the way for the UK's first national rail strike for three decades. Workers at Avanti West Coast, c2c, Chiltern Railways, CrossCountry, East Midlands Railway, Greater Anglia, Great Western Railway, London North Eastern Railway, Northern Trains, Southeastern, South Western Railway, TransPennine Express and West Midlands Trains voted to strike, with 71% of those balloted taking part in the vote; of those 89% voting in favour of strike action and 11% against. The ballot at Thameslink, Southern and Great Northern did not support strike action but supported industrial action short of a strike. Mick Lynch, General Secretary of the RMT said the decision \"sends a clear message that members want a decent pay rise, job security and no compulsory redundancies\". The action would see the largest outbreak of industrial action in the United Kingdom since 1989, and the first national strike involving the UK's railways since 1994, when signal workers walked out over a pay dispute with Railtrack.\nIndustrial action\nNationwide period (2022-23)\nInitial strikes\nmembers striking outside Network Rail property near Cambridge Station on 21 June 2022]]\nOn 7 June, initial strike dates were announced for 21, 23 and 25 June, with rail employees at Network Rail and 13 train operators joining the action. It was also announced that the 21 June strike would coincide with a planned 24-hour strike to be held by workers on the London Underground. Talks between the RMT and managers at the train operators affected were held in an attempt to avoid the strike, but after these reached impasse, on 18 June it was confirmed the rail and tube strikes would go ahead. Last-ditch talks on 20 June also failed to reach an agreement, meaning the strike would go ahead the following day, with talks breaking down after Network Rail management informed the RMT of its intention to consult on plans for 1,800 redundancies. The 21 June walkout involved 40,000 rail staff, as well as 10,000 workers from London Underground. A further round of talks on 22 June also concluded without resolution, leading to a second day of industrial action on 23 June. It was reported on 24 June that talks remained deadlocked, meaning a third day of industrial action was inevitable. On 30 June, the Transport Salaried Staffs' Association (TSSA) confirmed its members at Avanti West Coast had voted overwhelmingly for strikes and action short of a strike, ostensibly over the same issues that had triggered the RMT dispute, with 86% voting for strike action and 91% voting for action short of a strike on a 91% turnout. The union said it also planned to ballot staff at Network Rail and other train companies who operate at stations along the West Coast Main Line.\nSummer 2022 talks and further action\nTalks between the RMT and Network Rail resumed on 30 June, with union leaders warning of further strike action if the consultation, scheduled to begin the following day, was to go ahead. The RMT argued the regulations were incompatible with their demand for no compulsory redundancies. Members of the Associated Society of Locomotive Engineers and Firemen (ASLEF) at eight train operators voted to take strike action in a dispute over pay, while members of the Transport Salaried Staffs Association (TSSA) at Southeastern also voted to take industrial action on 11 July. Network Rail made a fresh pay offer the following day, which it said was worth more than 5%, but that was again linked to workers accepting \"modernising reforms\". They refused to make any further improvements on their pay offer, and made threats on redundancies and pay if strike action was not withdrawn. On 13 July, the RMT announced a fourth day of strike action after rejecting Network Rail's latest pay offer, which it described as \"paltry\". In a press release on 22 July, the RMT union additionally accused Network Rail of \"threatening to impose compulsory redundancies and unsafe 50% cuts to maintenance work\" if strike action was not withdrawn. On 14 July, ASLEF announced that train drivers at eight train companies – Arriva Rail London, Chiltern Railways, Great Western Railway, LNER, Greater Anglia, Southeastern, Hull Trains and West Midlands Trains – would strike on 30 July, involving around 5,500 union members. RMT strikes at Network Rail and 14 train operators were announced for 18 and 20 August, with the TSSA later announcing it would also strike on these two dates.  On 30 July, 5,000 members of ASLEF at eight rail companies, including Southeastern and West Midlands Trains, staged a 24-hour strike. On 5 August, Network management staff belonging to the Transport Salaried Staffs' Association voted to accept a 4% pay rise, meaning the railway network would be able to continue providing a skeleton service on strike days.\nA fifth day of RMT strike action went ahead on 18 August, with Network Rail signal workers from England, Scotland and Wales also joining the industrial action. RMT General Secretary Mick Lynch warned that the dispute could go on \"indefinitely\" unless a pay settlement is reached. Additionally, RMT members in London planned to stage a 24-hour strike on 19 August, effecting the majority of services in London. The RMT staged their sixth day of nationwide strike action on 20 August. Shapps said that a revised pay deal worth 8% was on the table, but that the union bosses would not put this proposal to their members. He urged the RMT to accept what he described as a \"fair\" deal, but Lynch said that \"only half the people in this dispute\" would be covered by the deal. On 25 August, train drivers at Chiltern Railways, Northern Trains and TransPennine Express belonging to the ASLEF union voted to take strike action in a dispute over pay and conditions.\nFurther strikes were planned for September by all three unions, but these were cancelled following the death of Queen Elizabeth II. On 20 September, both the RMT and ASLEF unions announced a strike for 1 October, with ASLEF announcing an additional strike for 5 October. On 22 September an RMT strike was announced for 8 October, which the union described as \"effectively shutting down the railway network\". The strike on 1 October involved around 54,000 workers from four trade unions – the RMT, ASLEF, the TSSA and Unite – and was the most disruptive of the strikes to date. As the 8 October strike approached, and with no further national strikes scheduled for after then, Mick Lynch announced that members would be balloted to determine if they wished to continue with the strikes. On 19 October, the RMT announced a further three strike days for November, on 3, 5, and 7 November. On 25 October, the RMT announced these would be rescheduled to 5, 7, and 9 November to avoid Royal British Legion Poppy Day.\nIn Scotland, a separate strike was called for 10 October after the RMT rejected a 5% pay offer from ScotRail that was described as a \"kick in the teeth\". An RMT strike involving staff at Avanti West Coast was held on 22 October, forcing the cancellation of a number of services throughout the day.\nNovember 2022 negotiations\nOn 4 November the RMT announced the strikes had been suspended and that they would enter into \"a period of intensive negotiations\" with Network Rail and the train operators. On 10 November, the ASLEF union announced that around 9,500 train drivers at 12 train operators would strike on 26 November. A strike by London Overground workers, also scheduled for 26 November, was suspended while they considered a fresh pay offer.\nOn 22 November, the RMT announced four 48-hour strikes in the run up to Christmas and early 2023, with strike action scheduled for 13–14 December, 16–17 December, 3–4 January and 6–7 January. On 5 December, RMT staff working for Network Rail (roughly half of those involved in the dispute) announced a strike over Christmas, beginning at 6pm on Christmas Eve and continuing until 6am on 27 December. On 20 December, ASLEF announced drivers at 15 train companies would strike on 5 January 2023, on the day between the two RMT strikes announced for January.\nDecember 2022 RMT Scotland & Wales deal, government intervention in England\nIn December 2022 the Rail Delivery Group offered a pay rise worth 10%, and this was initially warmly received by the RMT. However in England the government intervened, reducing the offer to 8% and amending an expansion of Driver-only operated trains into the deal. This revision was then rejected by the RMT, with Lynch commenting \"they might as well have come in with a fish and slapped me round the chops with it\". The DfT in turn retorted that it was a \"good offer for their membership that provides a significant uplift in pay and assurances around compulsory redundancies\". The dispute was resolved with negotiations in Scotland and Wales, with Lynch noting that in those locations the DfT could not block a resolution between the unions and train companies as they could in England, as transport was devolved to the Scottish and Welsh governments. \"There is no prospect of settling this dispute. If we had got an offer, we'd have had to consult. We're blocked by this government.\" He further alleged that the government wanted to keep the strikes going in order to make changes to strike laws. Secretary of State for Transport Mark Harper stopped negotiating with ASLEF for an England deal at that time.\nJanuary 2023 negotiations\nIn January 2023, the Rail Delivery Group made their first pay offer to ASLEF, described as being worth 4% in backdated pay for 2022, and 4% in 2023. The pay rise would see the wages of train drivers rise by £5,000 by the end of 2023, and no compulsory redundancies until 2024, but was conditional on the acceptance of new working conditions. The changes included allowing managers to drive trains, changes in technology used for training, and flexible working changes including Sunday working. On 17 January 2023, ASLEF announced a further two strikes for 1 and 3 February.\nOn 19 January 2023 the Rail Delivery Group made a fresh offer to the RMT, with a backdated pay rise to 2022 and worth 5% for 2022 and 4% for 2023, but this was again linked to changes in working conditions. The RMT said they were \"considering\" the offer, but rejected it on 10 February. The Rail Delivery Group and Network Rail had described it as their \"best and final\" offer, and said they would seek further discussions. The deal was rejected by the RMT's executive committee, but the rail industry and UK government wanted the deal to be put to a vote of members. In response, the RMT announced four new days of strikes during March and April, with the dates confirmed as 16, 18 and 30 March, and 1 April.\nMarch–April 2023 negotiations\nRMT staff working for Network Rail called off the 16 March strike after being given a fresh pay offer. On 22 March the strikes scheduled for 30 March and 1 April were called off following discussions with RMT representatives of train company staff and the Rail Delivery Group. This offer was ultimately rejected in April, and fresh strike dates were announced for May and June. The Rail Delivery Group were accused by union leaders of changing the terms of the pay offer, something the Rail Delivery Group rejected. They also said they had been \"blindsided\" by the announcement of fresh strikes. Communication between ASLEF and the English rail companies ended in April, and had not resumed by September.\nMay 2023 ASLEF deal in Scotland & Wales\nOn 4 May 2023, members of the RMT voted to renew the union's mandate to take strike action for a further six months. The union voted in favour, and further strikes were announced for early June. The ASLEF dispute was resolved in Scotland and Wales after negotiations with devolved authorities and ScotRail; these resulted in pay offers that were accepted by the union.\nEngland-only period (2023-24)\nThe Conservative government continued to block a resolution in England until its defeat at the 2024 general election. Scottish and Welsh transport are devolved matters, and so not under direct control of Westminster, which is why the dispute was resolved in those areas first. Whelan argued that Westminster needed to \"act like the grown-ups in the room\".\nOn 22 June, three further days of strike action were announced by the RMT for 20, 22 and 29 July. ASLEF drivers for 16 train operators announced a six-day overtime ban beginning from Monday 3 July, threatening disruption to services.\nJuly 2023 mass ticket office closure proposal\nThe RMT addressed rumours of mass ticket office closures on 26 June, commenting that they would \"vigorously oppose\" such action. The policy was announced by the English rail companies on 5 July 2023, when they launched a 21-day consultation over plans to closing hundreds of ticket offices at railway stations. The proposed changes have been criticised by disabled travellers, and involve statutory redundancy notices for hundreds of staff. For some train operators, the proposed cuts equate to two thirds of their workforce. Lynch downplayed notions of a swift resolution, noting that no minister had spoken to him since January, and that the train companies were not negotiating. By 26 July, organisers Transport Focus and London TravelWatch said they had received more than 170,000 responses from passengers. On 26 July the consultation process was extended until 1 September after organisers heard that not all train companies had provided the information in accessible format. By 29 July the RMT estimated that one billion pounds had been spent by the government to cover the losses of the train companies during the dispute, in order to remove the financial incentive for the rail companies to come to a resolution, and keep the dispute going. An RMT organised protest march took place in London on 31 August. Aslef indicated that no further negotiations with Secretary of State for Transport Mark Harper had taken place since December, and negotiations with train companies had stalled in April.\nOn 31 October 2023, Harper confirmed the plans would be scrapped, and said the government \"has asked train operators to withdraw their proposals\" because they \"failed to meet high passenger standards\". This followed the public consultation into the cost-cutting proposals, which attracted 750,000 responses, in which 99% were objections.\nNovember 2023 negotiations, RMT deal in England\nOn 19 October 2023, members of the RMT voted to stage a further six months of strike action. On 8 November, it was confirmed that members of the RMT would vote on a revised pay offer and guarantee of job security that would end the strike action if accepted. On 30 November, RMT members voted to accept the pay deal from 14 train companies, ending their dispute across much of England. No deal was reached with Transport for London, which means the dispute there is still ongoing, along with the England-wide ASLEF dispute. Further strikes were held in early December by ASLEF, and more were scheduled by the RMT for London in January 2024.\nOn 7 January the RMT announced that it had suspended its planned strike action after talks with Transport for London, after the mayor of London apparently made new funds available. The strikes had been expected to stop almost all underground services. On 14 February 2024, ASLEF announced that drivers at five train operators – Chiltern Railways, c2c, East Midlands Railway, Northern and TransPennine Express – had voted for a further six months of industrial action. Strikes continued intermittently through the spring as the train companies refused to negotiate; Whelan commented that April that it had been a full year since the last negotiations for ASLEF workers.\nLabour government and final negotiations\nIn April, Labour announced plans to renationalise passenger rail should it win the upcoming General Election. The Conservatives suffered a historic defeat, and negotiations were held with ASLEF for the first time since spring 2023. ASLEF were optimistic about the talks. On 14 August, ASLEF announced it would ballot its members on a revised pay offer following negotiations with the DfT. On 18 September, ASLEF announced that its members had accepted a pay deal of 15% from the UK government, ending two years of strike action albeit for in London. The membership of the RMT accepted their offer on September 25.\nThis left only the dispute in London active; the final strike dates were called off on November 5, 2024, and a final deal was conducted on November 27. ASLEF declared this the end to the national disputes, and claimed victory. Mick Whelan criticised the Conservatives, adding that the union's strength would be \"burned on their dissolute, deceitful and corrupt memories forever\".\nList of strikes\nAction that was announced, but then suspended before it could take place, is struck through.\n{| class=\"wikitable defaultcenter\"\n|+ Nationwide action (2022–23)\n|-\n! Start date !! End date !! ASLEF !! RMT !! TSSA\n|-\n|colspan=2|  || - || Strike || -\n|-\n|colspan=2|  || Strike || Strike || -\n|-\n|colspan=2|  || - || Strike || -\n|-\n|  ||  || Strike || - || -\n|-\n|  ||  || Strike || - || -\n|-\n|colspan=2|  || - || Strike || Strike\n|-\n|colspan=2|  || Strike || - || -\n|-\n|colspan=2|  || - || Strike || Strike\n|-\n|colspan=2|  || - || Strike || -\n|-\n| ||   || - || - || Strike\n|-\n|colspan=2|  || Strike || Strike ||  Strike\n|-\n| ||  || Strike || Strike || Strike\n|-\n| ||  || - || - ||\n|-\n| ||  || - ||  ||-\n|-\n| ||  || - ||  ||-\n|-\n| ||  || - || Strike || Strike\n|-\n| ||  || - || Strike || Strike\n|-\n| ||  || - || Strike ||-\n|-\n| ||  || - || - || Strike\n|-\n|  || || - || Strike ||-\n|-\n|colspan=2|   || Strike || - ||-\n|-\n|  || || - || Strike ||-\n|-\n|colspan=2|  || - || - || Strike\n|-\n|colspan=2|  || Strike || Strike ||-\n|-\n|colspan=2|  || Strike || Strike ||-\n|-\n|  || || - ||  ||-\n|-\n|colspan=2|  || Strike || - ||-\n|-\n|colspan=2|  || Overtime ban || Strike ||-\n|}\n{| class=\"wikitable defaultcenter\"\n|+ England-only action (2023–24)\n|-\n! Start date !! End date !! ASLEF !! RMT !! TSSA\n|-\n|  || || Overtime ban || - ||-\n|-\n|colspan=2|  || Strike || - ||-\n|-\n|colspan=2|  || - || Strike ||-\n|-\n|colspan=2|  || Strike || - ||-\n|-\n|  ||  || Overtime ban || Strike ||-\n|-\n|colspan=2|  || - || Strike ||-\n|-\n|||  || Overtime ban || - ||-\n|-\n|||  || Overtime ban || - ||-\n|-\n|colspan=2|  || - || Strike ||-\n|-\n|colspan=2|  || Strike || - ||-\n|-\n|colspan=2|  || Overtime ban || Strike ||-\n|-\n|||  || - || Strike  ||-\n|-\n|colspan=2|  || Overtime ban || - ||-\n|-\n|colspan=2|  || Strike || - ||-\n|-\n|||  || Overtime ban || - ||-\n|-\n|colspan=2|  || Strike || Strike||-\n|-\n|colspan=2|  || Overtime ban || - ||-\n|-\n|colspan=2|  || Overtime ban || ||-\n|-\n|||  || Strike || - ||-\n|-\n|  ||  ||  Strike || - || -\n|-\n|colspan=2|  || Strike || - || -\n|-\n|  ||  ||  Strike || - || -\n|-\n|colspan=2|  || - || - || Strike\n|-\n||  || || - || - || Overtime ban\n|-\n|  ||  ||  Strike || - || -\n|-\n|colspan=5| Thereafter disputes only active in London\n|-\n|colspan=2|  ||   || - || -\n|-\n|colspan=2|  ||   || - || -\n|-\n|}\nImpact\nAn emergency timetable was published for the week of 20–26 June 2022, with only half of lines open on strike days and rail operators running around 20% of the normal daily service, with priority given to mainline and urban services. Services were operated between 7.30am and 6.30pm, beginning later and finishing earlier than usual. Trains on non-strike days ran at 60%, with earlier services affected because of the knock-on effect of staff not having worked on the previous day. Ticketholders whose trains were cancelled because of industrial action were advised they would be entitled to a refund. People were advised not to travel by train on strike days unless their journey was essential, while roads and motorways were expected to be busier than usual, prompting National Highways to advise motorists to check their vehicles before setting out.\nOn 21 June, and on subsequent strike days, many areas of the UK were without train services, including most of Scotland and Wales, the whole of Cornwall and Dorset, and places such as Chester, Hull, Lincoln and Worcester. On 21 June Sky News reported on the effectiveness of the strike, stating there appeared to have been less of an impact than anticipated, and cited the large number of white collar workers who would be able to work from home, as they had done during the COVID-19 pandemic. Sky's Paul Kelso reported a 2% increase in traffic in Greater Manchester when compared to the same day the previous week. Rail Business Daily reported a 13% increase in London traffic.\nA BBC News report published on 22 June suggested that passengers in cities such as London, Manchester, Liverpool and Glasgow appeared to have heeded advice not to travel as railway stations were virtually empty, while ScotRail, which was not involved in the dispute, cancelled 90% of their services because of their reliance on staff from Network Rail. Rail services in Wales were also reported to be running at around 10%, with the few operating services by Transport for Wales Rail also not in dispute with the RMT, centred on the Core Valley Lines north of Radyr, which were transferred to the Welsh Government from Network Rail in 2020, as well as a GWR Cardiff to London service. A similar picture also emerged on 23 June, with empty railway stations as people remained at home. Gemma Dale, a lecturer at Liverpool John Moores University Business School, suggested the ability of white collar workers to work from home has lessened the strike's potential impact and taken pressure off the government to bring a swift resolution to the situation.\nThe 21 and 23 June strikes fell on days when A-Level examinations were scheduled to take place in England and Wales, with around 90,000 students taking a maths exam on 21 June and 55,000 taking a chemistry exam on 23 June. FE Week reported that further education colleges had been required to pay taxi fares for students who would normally travel to college by train, or arrange bed and breakfast accommodation to ensure they could sit the exams, mentioning Hereford Sixth Form College as an example of one such institution that had done so. The Department for Education said that it \"did not expect exams to be rescheduled because of the strike\", because \"this would not be fair on students\", but establishments could \"draw on existing contingency arrangements\" such as budgets when there was no alternative solution. Some colleges had also re-established remote learning classes first used during the COVID-19 pandemic, in order to minimise disruption to their students' education.\nITV News highlighted the impact the railway's industrial action was having on retail businesses that rely on train passengers, such as coffee shops located in railway stations, with one outlet reporting a 90% drop in footfall on the first day of strike action. On 24 June The Scotsman reported on the potential impact on the hospitality industry. Leon Thompson, executive director of UKHospitality Scotland, suggested that the initial three days of strikes planned in June may lose the industry as much as £50 million.\nThe strike action coincided with the 2022 Glastonbury Festival, an event that usually sees an increase in the number of rail passengers. On 23 June BBC News reported that around 25 festivalgoers were waiting at London's Paddington station for trains going to Glastonbury, suggesting many had either travelled on non-strike days or found other ways of getting to the festival. The third day of action also coincided with a Test cricket match in Leeds, prompting TransPennine Express to urge people to avoid travelling there by train.\nOn 27 July, BBC News reported that one in five trains were running, but that some places such as Blackpool, Bournemouth and Portsmouth had no services, and it was expected the strike action would affect travel to the 2022 UEFA Women's Euro semi-final in Milton Keynes. The ASLEF strike action on 30 July coincided with the 2022 Commonwealth Games being held in Birmingham from 28 July to 8 August, as well as the opening day of the 2022–23 English Football League season on 30 July, impacting both events. On 30 July, West Midlands Trains ran an emergency shuttle service between Birmingham New Street and Birmingham International, while in London travel to Lady Gaga's Chromatica Ball show in Tottenham was affected by a lack of London Overground services.\nAhead of the 13 August ASLEF strike Network Rail confirmed that Birmingham New Street station, the UK's busiest railway station outside London, would be closed for the day, with drivers from four of the five companies that use New Street – Avanti West Coast, CrossCountry, London Northwestern Railway and West Midlands Railway – taking industrial action. Transport for Wales, whose drivers are not involved in the strike, announced its services to Birmingham would terminate at either Wolverhampton or Shrewsbury. Transport for London also warned passengers there would be no London Overground services on the strike day. Other train operators planned a limited service, with London North Eastern Railway running one return service between Leeds and London and a limited London to Edinburgh timetable, while Great Western would run a limited service between Bristol and London Paddington, as well as Reading and Oxford. Events impacted by this strike included a Coldplay concert at Wembley Stadium and English Premier League fixtures, with concertgoers and spectators advised to make alternative travel arrangements. The 13 August strike also coincided with a severe heat wave for which the Met Office had issued an amber heat warning. This prompted National Highways to urge drivers to plan any journeys in advance as the lack of trains would lead to an increase in road traffic.\nOn 18 August, Network Rail planned to run around 4,300 train services, the highest number to operate on a strike day, but still only 20% of the network. The RMT strike involving railway workers in London on 19 August would affect large parts of the network in London, but Transport for London confirmed trains on the Elizabeth line would be operating relatively normally throughout the day. Events impacted by the 20 August strike included a Becky Hill concert at London's Crystal Palace Park and the All Points East festival in Victoria Park. Camp Bestival in Shropshire was also in progress that weekend, but it was believed most of those attending were already present, having arrived earlier in the week, so the impact to travellers would be minimal.\nAs the 1 October strike involved signal workers and drivers, only 11% of train services would be running. The strike would also coincide with the 2022 Conservative Party Conference in Birmingham, a city where no trains would be running, while the 2022 London Marathon on 2 October also faced disruption as an overhang from the previous day's strike. Following the announcement of strikes in November, the Royal British Legion announced it would cancel its London Poppy Day fundraising event scheduled for 3 November and look at other ways to \"lessen the impact\" of the expected £1million loss the event's cancellation would cause. The RMT subsequently rescheduled the 3 November strike to 9 November to avoid affecting the Poppy Day appeal. Because the strikes scheduled for early November were called off at the eleventh hour, Network Rail warned that services on 5 November would still be \"severely disrupted\" while services on 7 November would also be affected. The Rail Delivery Group, which represents the UK's train operators, said this was because rotas are agreed with train drivers a week in advance.\nIn November 2022, the UK hospitality sector estimated the strike action had cost it £1.5bn, a similar amount to the impact on the sector of the Omicron variant of COVID-19. The Rail Delivery Group estimated that £300m of sales had been lost because of the strikes.\nThe strikes announced for May and June 2023 would coincide with the 2023 Eurovision Song Contest on 13 May and the 2023 FA Cup final on 3 June. Speaking shortly after these strikes were announced, Mark Harper, the Secretary of State for Transport, accused the rail unions of \"cynically targeting the Eurovision song contest\", something he described as \"appalling [because] that's not our song contest. We're hosting it for Ukraine\". On 19 July 2023, the Latitude Festival opened its campsite a day early to help festivalgoers avoid potential travel disruption. The August 2023 strike coincided with that year's Reading and Leeds Festivals and Notting Hill Carnival.\nResponse\nUK Government\nAt a meeting of his cabinet on 21 June 2022, Prime Minister Boris Johnson said that the UK should be prepared to \"stay the course\" because \"these reforms, these improvements in the way we run our railways are in the interests of the travelling public, they will help to cut costs for farepayers up and down the country\". On the second day of strike action, Downing Street urged union members to call off the strikes \"as quickly as possible\", but Lynch warned that the strike on 25 June was likely to go ahead, along with future industrial action. He also urged Shapps to \"tone down the rhetoric and get on with his job\" as a third day of industrial action got under way on 25 June.\nAs the strike got underway, Grant Shapps, the Secretary of State for Transport, confirmed government plans to make changes to the law that would allow agency workers, or those  from elsewhere within an organisation, to fill the jobs of striking workers, and for rules that would ensure \"minimum service levels\" during industrial action. The Conduct of Employment Agencies and Employment Businesses (Amendment) Regulations 2022 and Liability of Trade Unions in Proceedings in Tort (Increase of Limits on Damages) Order 2022 were brought before Parliament on 27 June. The new regulations repealed previous legislation that prohibited the use of agency staff to replace striking workers, and raise the amount of damages a company can seek from a trade union because of industrial action from £250,000 to £1 million. In addition it will also repeal the Trade Union (Wales) Act 2017 passed by the Senedd to outlaw the practice of using agency workers during strikes that occur in Wales. The Conduct of Employment Agencies and Employment Businesses (Amendment) Regulations 2022 was approved by MPs by 289 votes to 202 on 11 July, and came into force on 21 July.\nAlthough any legislation would not be quick enough to prevent disruption from the strike action in June, the UK government argued it was required because \"unions are threatening action across the economy\". But the Trades Union Congress (TUC) criticised the plans, saying they undermined the right to strike and would put safety at risk. TUC Secretary General Frances O'Grady accused the government of being \"more interested in cynically picking a fight with unions than reaching a negotiated settlement\", while Kwasi Kwarteng, the Secretary of State for Business, said that a situation where trade unions \"are holding the country to ransom by grinding crucial public services and businesses to a halt\" is one that was \"not sustainable\". But some industry figures have expressed caution. On 1 July the directors of 13 of the UK's largest recruitment companies, including Hays plc, Adecco Group, Randstad NV and ManpowerGroup, wrote to the business secretary urging him to reconsider the plans amid concerns they could further exacerbate the situation.\nOn 27 June the UK government announced that it would \"legislate to remove the Trade Union (Wales) Act 2017 through primary legislation when Parliamentary time allows, to ensure trade union legislation applies equally across Great Britain\". The Welsh branch of the GMB trade union said that it would fight the plans, with its political officer Tom Hoyles accusing the UK government of \"overstepping the mark\", while the Welsh Government described the changes as \"counter-productive and against everything we stand for in Wales\" and said they would \"resist\" attempts to overturn the 2017 Act. But BBC News reported that the 2017 law had been passed before changes the Senedd's powers had made clear industrial relations is a \"reserved\" matter for Westminster.\nDuring a televised debate between the two candidates in the July 2022 Conservative Party leadership election held on 25 July, both Rishi Sunak and Liz Truss responded affirmatively to a question on whether they would legislate to prohibit strikes on \"essential public services like the railways\". On 18 August The Times reported that Shapps had announced a 16-point government plan to offset the impact of industrial action, which includes lifting the ban on the use of emergency powers to prevent strikes if they could create a national emergency, introducing legislation to ensure a minimum level of services during industrial action, and raising the required threshold of support for strike action from 40%.\nAlleged political interference\nThe RMT has alleged several times throughout the dispute that the UK government has intervened to keep the dispute going, in order to pass legislation restricting unions. The government intervened to block a nationwide resolution to the RMT dispute in December 2022. The government were unable to intervene in Scotland and Wales, as transport is devolved, and the dispute was resolved by the deal in those areas. By July 2023 the RMT estimated that one billion pounds had been spent by the government to cover the losses of the train companies during the dispute, in order to remove the financial incentive for the rail companies to come to a resolution, and keep the dispute going.\nLabour Party\nLabour Party leader (and Leader of the Opposition) Keir Starmer drew criticism from the RMT, as well as some members of his own party, for choosing not to support the strike action. He also instructed Labour MPs not to join picket lines, but several, including John McDonnell, Diane Abbott, Kate Osborne and Nadia Whittome, then went on to do so. Commenting on this, Shadow Foreign Secretary David Lammy said \"a serious party of government does not join picket lines\". On 27 July, Labour MP Sam Tarry was dismissed from his post as a shadow transport minister after joining picketing railway workers at London's Euston station. Labour said his dismissal had nothing to do with his decision to join the picket line, but was due to unauthorised media interviews he gave throughout the day.\nNetwork Rail\nOn 29 August 2023, it was reported that Network Rail would not pay annual bonuses worth around £300 to staff members who took part in strike action. The decision, which would affect around 20,000 employees, follows the resolution of the RMT dispute with Network Rail in March 2023, when members voted to accept a 5% pay rise.\nPublic opinion\nA YouGov poll found that in October 2022, 45% of British adults strongly or somewhat supported the rail strike compared to 42% who strongly or somewhat opposed it. According to a poll by Savanta ComRes in December 2022, 47% of respondents supported rail strike action, 34% opposed and 19% were undecided. YouGov found that support for striking rail unions remained consistent throughout the first half of 2023, following a similar pattern to other unions.\nOther industrial disputes\nOther disputes within the railway sector\nOn 9 June 2022, members of the Associated Society of Locomotive Engineers & Firemen (ASLEF) voted to strike in a separate dispute. The union, which represents train drivers, announced plans to hold strike action on 23 and 26 June and 13 and 14 July. The train operators affected were Hull Trains, Greater Anglia and Tramlink. ASLEF members staged a strike on 2 July, affecting 90% of train services operated by Greater Anglia.\nOn 22 June 2022 it was reported that members of the Transport Salaried Staffs' Association (TSSA) had voted to accept a 7.1% pay rise following an ongoing dispute with Merseyrail which had led to strike action. Unlike the train operators involved in the national dispute, Merseyrail is a fully devolved train operating company and therefore not required to consult the government on issues such as levels of pay and industrial disputes. Manuel Cortes, General Secretary of the TSSA, described the deal as \"a sensible outcome to a reasonable offer\".\nOn 24 June 2022, members of the RMT working on the London Underground voted to continue with strike action for a further six months in an ongoing dispute over pensions and job cuts. The continued industrial action was supported by 90% of voting members on a 53% turnout. On 3 August RMT workers on the London Underground network, and London Overground trains served by Arriva Rail London, announced a 24-hour strike for 19 August; workers at Arriva Rail London had rejected a 5% pay offer. On 6 July 2023, RMT workers on the London Underground announced six days of strikes from Sunday 23 July to Friday 28 July.\nOn 16 June 2023, drivers at Avanti West Coast announced a one day strike on 2 July over the terms of sick pay. This strike, concerning a separate dispute to the long-term industrial dispute, was subsequently called off on 22 June after Avanti agreed to remove the policy regarding sick pay.\nStrikes were planned on the London Underground between 23 and 28 July 2023, with the RMT set to walk out for six days, while members of Unite and ASLEF would strike on 26 and 28 July. On 21 July it was announced the strikes had been called off following last minute talks between union representatives and Transport for London.\nDisputes in other sectors\nIndustrial action involving the railways coupled with potential unrest in other sectors sparked media concerns of a \"summer of discontent\" involving multiple disputes and strikes, and mirroring the Winter of Discontent of 1978–79 that had seen widespread disruption across the UK economy. On 19 June The Observer reported that the National Education Union would ballot its 450,000 members on industrial action if teachers did not receive a pay rise close to the rate of inflation, while it was also reported that Unison had warned of industrial action among medical staff if they were not offered a pay rise. On 23 June, it was announced that 700 staff at Heathrow Airport who belong to the GMB and Unite unions had voted to hold strike action during the summer holidays, when the number of overseas travellers was expected to be at pre-pandemic levels. On 7 July the strike action was suspended following further discussions between union representatives and British Airways, which had resulted in what the union described as a \"vastly improved\" pay offer.\nOn 27 June, members of the Criminal Bar Association in England and Wales began four weeks of industrial action after rejecting a 15% pay rise; the walkout disrupted 90% of proceedings at the Old Bailey as barristers demanded a 25% increase. Having rejected a 15% pay offer from the government, on 22 August it was announced that barristers had voted to strike indefinitely from 5 September, with 79.9% of those voting on the issue in favour of the plans.\nOn 27 June, it was announced that members of the Communication Workers Union (CWU) at 114 Crown Post Offices, the largest branches typically on a high street or city centre, would walk out on 11 July in an ongoing dispute over pay. It would be the third time the union had staged industrial action during 2022 after members rejected a 3% pay rise and £500 lump sum.\nOn 28 June, GPs at the Annual General Meeting of the British Medical Association voted to take industrial action over new contracts requiring them to work on weekday evenings and Saturdays. On 29 June, Royal Mail managers belonging to the Unite union voted to take industrial action in a dispute over redundancies and a redeployment programme to bring in what they described as \"worsening terms and conditions\"; the vote for strike action was 86% in the UK mainland and 89% in Northern Ireland. On 19 July Royal Mail workers belonging to the Communication Workers Union voted to take strike action; the stoppage would involve roughly 115,000 staff members. The first of four one day Royal Mail strikes was held on 26 August, with further industrial action planned for 31 August, and 8 and 9 September.\nOn 30 June CWU members working for BT Group voted to take industrial action over pay, with strike action expected to involve around 40,000 of the company's frontline workers, mostly engineering and call centre staff, and would be BT's first nationwide industrial action since 1987. Two days of strike action were subsequently announced for 29 July and 1 August, and went ahead as scheduled.\nOn 1 July it was confirmed that roughly 370 Unite members employed as bus drivers at Stagecoach in Merseyside  would begin eight days of strike action from 4 July in a dispute over wages.\nOn 5 August, the Unite union announced that 1,900 workers at Felixstowe Docks, one of the UK's largest ports, would stage an eight-day strike from 21 August after rejecting a 7% pay rise from the Felixstowe Dock and Railway Company. Unite described the pay offer as \"significantly below\" the rate of inflation. The strike represented the first such industrial action for three decades. Around 1,600 Unite members working for London United Busways staged a 48-hour strike on 19 and 20 August, affecting bus routes in West and South West London, as well as parts of Surrey.\nOn 28 August it was reported that the Unison and Unite unions had submitted motions ahead of the Trades Union Congress, due to be held in September, calling for co-ordinated strike action throughout the autumn as a way to create a greater impact.\nOn 9 November, the Royal College of Nursing (RCN) announced it had a mandate to strike in the majority of NHS trusts. On 17 November, the union warned the Secretary of State for Health and Social Care, Steve Barclay, that he had 5 days to open formal negotiations or strikes would be announced for December 2022.\nSee also\n* 2016–2019 United Kingdom railway strikes\n* 2022 British barristers' industrial action\n* Rail transport in Great Britain\n* Rail transport in the United Kingdom\n* 2021–present United Kingdom cost-of-living crisis\nNotes\nReferences"
    }
  ]
}