{
  "content": [
    {
      "type": "text",
      "text": "# 2023 Move Forward Party leadership election\n\n| title = Leader\n| posttitle =\n| before_election = Pita Limjaroenrat\n| after_election = Chaithawat Tulathon\n| previous_year = 2020\n| previous_election = 2020 Move Forward Party leadership election\n}}The 2023 Move Forward Party leadership election was triggered on 15 September 2023 after incumbent leader Pita Limjaroenrat announced his intention to step down as leader of the Move Forward Party amidst his suspension as a Member of the House of Representatives by the Constitutional Court.\nPita had served as party leader for three years, leading Move Forward to victory in the 2023 general election. The party won 151 seats, more than any other party. After forming a coalition with other parties, Pita was submitted as a candidate for Prime Minister in the National Assembly. While he had a majority of support in the lower house, the military-appointed Senate mostly rejected his candidacy. Before the 2nd premiership election could take place, the Constitutional Court suspended Pita over alleged violation of election laws. Move Forward would be relegated to the opposition after their agreement with their main coalition partner, the Pheu Thai Party, fell apart. Unable to continue his duties in the House, Pita was not able to be appointed Leader of the Opposition. He announced he would resign as party leader, with a successor being elected on 23 September.\nChaithawat Tulathon, the party’s Secretary-General, won the election unopposed. He stated that he would be willing to step down were Pita to seek the party leadership after his presumed acquittal of any wrongdoing by the Court. Chaithawat was subsequently appointed as Leader of the Opposition on 17 December 2023. Pita was cleared of any wrongdoing by the Constitutional Court on 24 January 2024. He returned to Parliament the following day, with no leadership election being held at the party's general meeting on 6 April 2024.\nBackground\n2023 general election\nPita Limjaroenrat, a member of the House of Representatives since 2019, had led the Move Forward Party (MFP) since his unanimous election in 2020. He led the party in the 2023 general election, which saw a major realignment from pro-junta and royalists parties to pro-democratic and populists ones. In the election, the MFP won the most (151) seats and 38% of the popular vote. When the results were announced, no single party commanded a majority of seats in the House to govern alone. After the election, Pita announced plans to be elected Prime Minister and lead the next government. Reaching out to fellow pro-democracy parties, Move Forward formed a coalition in an attempt of a government formation. The Pheu Thai party, which had come in second place in the election, was the most notable coalition partner.\nThe 2017 Constitution stipulated that the Senate, whose members were appointed by the National Council for Peace and Order (the military junta that took power after the 2014 coup), are to vote for the Prime Minister after a general election along with the House of Representatives for the next two elections after the charter was implemented. This effectively gave the military influence over the next government regardless of the election outcome after the 2019 and 2023 elections. Nevertheless, on 27 June Pita stated he had ‘enough’ support from the unelected Senate to become Prime Minister.\nOn 13 the National Assembly met to elect the next prime minister. The pro-democracy coalition, led by Move Forward, submitted Pita’s name as a nomination for the office. Voting went forward without any other names being submitted. 324 members of the National Assembly voted to approve Pita's premiership (311 of which were MPs and 13 of which were junta-appointed senators), 182 disapproved and 199 abstained. Of the 705 votes, Pita fell 51 votes short of a majority, as he required 375 votes in order to be appointed Prime Minister. Protestors criticized the system of an electing the prime minister as undemocratic, as the desired government was effectively blocked from power by the Senate.\nSuspension by Constitutional Court\n, Pita Limjaroenrat was suspended as an MP by the Constitutional Court in July 2023.]]\nThe Assembly met again on 19 July. On the same day, the Constitutional Court unanimously voted to accept a case against Pita regarding his inherited shares of the defunct iTV. They also voted 7–2 to suspend him from MP duty until it reached a ruling, but it did not preclude him from being nominated for prime minister. The Assembly blocked Pita’s nomination over a supposed violation of a parliamentary rule prohibiting a repeat motion.\nAs it became Move Forward could not lead the government, and because Pita was their only prime minister candidate, Pheu Thai took charge of the coalition following Pita’s suspension as an MP. After originally signaling support for each other, both parties split as Pheu Thai left the original coalition to form one of their own. The split occurred after the Pheu Thai party rescinded a campaign pledge to not reform Thailand’s strict lèse-majesté laws, a pledge they shared with Move Forward. Appeasing the military-appointed Senate, Pheu Thai was able to form the next government with the confidence of the National Assembly.\nResignation of Pita\nOn 15 September 2023, Pita announced he would resign as Leader of the Move Forward Party. He cited his inability to perform duties in the House, pending a ruling regarding his suspension status as an MP in the Constitutional Court. Pita did not have much desire to become Leader of the Opposition, and stressed the importance of the role as one that must provide \"checks and balances\" to the government. He reiterated he would remain active in Thai politics and the party, regardless of his role.\nCandidates\nDeclared\n{| class=\"wikitable sortable\" style=\"text-align:center\"\n! colspan=\"2\" |Candidate\n!Positions\n!Announced\n|-\n|\n|Chaithawat Tulathon\n|Secretary-General of the Move Forward Party (2020-present)\nMember of the House of Representatives (2023–present)\n|15 September 2023\n|}\nDeclined\n* Pita Limjaroenrat, Leader of the Move Forward Party (2020-2023), Member of the House of Representatives (2019-2024)\n* Sirikanya Tansakun, Fourth Deputy Leader of the Move Forward Party (2020-present), Member of the House of Representatives (2019-present)\n* Parit Wacharasindhu, Member of the House of Representatives (2019-present)\nProcess\nPita said that Move Forward would select a new leader to replace him on 23 September, who would lead the party and the opposition in the House of Representatives. He stated that an election would take place at an extraordinary general meeting in Bangkok, and would coincide with the appointment of a new executive committee. Pita said that the new leader must be a sitting MP so that they could become Leader of the Opposition.\nChaithawat Tulathon, the party’s Secretary-General and second party-list MP, was speculated as Pita’s likely successor shortly after his resignation announcement. Sirikanya Tansakun, a deputy leader and third party-list MP also emerged as a potential candidate.\nBy 19 September, Chaithawat had consolidated enough support within the party to guarantee his leadership, as Sirikanya would ultimately decline to run herself. Reportedly, the party didn't want to risk losing Sirikanya as potential future leader in the case of a ban of senior party executives from politics by the Constitutional Court. Parit Wacharasindhu, the eleventh party-list MP, also declined on the following day.\nResults\nChaithawat Tulathon easily won the election on 23 September, receiving 330 votes. 5 voters opposed Chaithwat’s leadership while 3 abstained. Apichart Sirisunthon succeeded Chaithawat as Secretary-General, Sirikanya Tansakul continued as Fourth Deputy Leader, Parit Wacharasindhu was made the party’s spokesperson, and Pita was made Chairman of the party’s Advisory Board. Several other MPs were also given or simply retained executive positions.\nAftermath\nAfter his election, Chaithawat said his leadership was part of \"temporary restructure\", and said he would be \"willing to step down once Pita resumes the position as an MP in the parliament again\" Chaithawat was appointed Leader of the Opposition on 17 December.\nIn late December, Chaithawat said he would be ready to resign as party leader were Pita to be acquitted, believing most party members would support Pita for the position at the party’s upcoming general meeting in April 2024. When asked if he will return to party leadership, Pita stated it would be decided at the April meeting. Pita was officially reinstated by the Constitutional Court on 24 January, and returned to Parliament the next day. After his acquittal, he stated he was “ready, willing, and able” to lead the country as the next prime minister, if the political situation demanded it. Although a general meeting of the party did occur on 6 April, no leadership election was held, and Chaithawat remained as opposition leader.\nSee also\n* Chaitawat Tulathon\n* Pita Limjaroenrat\n* Move Forward Party\n* 2023 Thai general election\nReferences"
    }
  ]
}