{
  "content": [
    {
      "type": "text",
      "text": "# 2023 Turkish presidential election candidate nominations\n\nIn the lead up to the 2023 Turkish presidential election, discussions took place around the nomination of presidential candidates.\nRecep Tayyip Erdoğan, the incumbent president and leader of the Justice and Development Party (AKP), announced that he would run as the presidential candidate of the electoral alliance, the People's Alliance. Other parties of the People's Alliance, the Nationalist Movement Party (MHP) and the Great Unity Party (BBP), supported Erdoğan's candidacy. This was Erdoğan's third presidential campaign, following two prior successful campaigns in 2014 and 2018.\nKemal Kılıçdaroğlu, leader of the Republican People's Party and the Main Opposition Leader since 2010, was the joint candidate of the Nation Alliance. The Nation Alliance was a newly created electoral alliance of opposition parties consisting of the Table of Six: the Republican People's Party, the Good Party, the Democrat Party, the Felicity Party, DEVA Party and the Future Party. The Alliance held its nomination meeting on 2 March 2023, with an official announcement confirming Kılıçdaroğlu as its joint candidate occurring on 6 March 2023.\nMuharrem İnce, who was the presidential candidate of the Republican People's Party in the 2018 election and finished second with 30.6% of the vote, announced that he would be a candidate again as the leader of the Homeland Party. İnce withdrew from the race three days before the election even after gaining ballot access. Sinan Oğan was nominated by the right-wing Ancestral Alliance and also achieved ballot access.\nFour candidates, Erdoğan, Kılıçdaroğlu, İnce, and Oğan appeared on the ballot in the first round. After no candidate received a majority of the vote in the first round, the top two candidates, Erdoğan and Kılıçdaroğlu, were the only eligible candidates to appear on the ballot for the second round. Third and fourth place candidates Oğan and İnce endorsed Erdoğan and Kılıçdaroğlu respectively.\nOfficial candidates\n{| class=\"wikitable\" style=\"width:130px; text-align:center\"\n|-\n|-\n! colspan=15 | List of presidential candidates in the order they appeared on ballots in the first round\n|-\n| colspan=\"4\"| 1\n| 2\n| colspan=\"6\"| 3\n| colspan=\"4\"| 4\n|-\n| colspan=\"4\" |\n|\n| colspan=\"6\" |\n| colspan=\"4\" |\n|-\n| colspan=\"4\" |Recep Tayyip Erdoğan\n|Muharrem İnce\n| colspan=\"6\" |Kemal Kılıçdaroğlu\n| colspan=\"4\" |Sinan Oğan\n|-\n| colspan=\"4\" |'''People's Alliance\n|\n| colspan=\"6\" |Nation Alliance\n| colspan=\"4\" |Ancestral Alliance\n|-\n| style=\"background:; width:2px;\"|\n| style=\"background:; width:2px;\"|\n| style=\"background:; width:2px;\"|\n| style=\"background:; width:2px;\"|\n|style=\"background:; width:2px;\"|\n| style=\"background:; width:2px;\"|\n| style=\"background:; width:2px;\" |\n| style=\"background:; width:2px;\"|\n| style=\"background:; width:2px;\"|\n| style=\"background:; width:2px;\"|\n| style=\"background:; width:2px;\"|\n| style=\"background:; width:2px;\"|\n| style=\"background:#D1050C; width:2px;\"|\n| style=\"background:#0B69B1; width:2px;\"|\n| style=\"background:#00A01A; width:2px;\"|\n|-\n|\n|\n|\n|\n|MP\n|\n|\n|\n|\n|\n|\n|ZP\n|AP\n|ÜP\n|TÜİP'''\n|-\n| colspan=\"4\" |Campaign\n|Campaign\n| colspan=\"6\" |Campaign\n| colspan=\"4\" |Campaign\n|}\nNomination process\nPeople's Alliance\n{| class=\"wikitable\" style=\"margin:1em auto; font-size:90%; text-align:center;\"\n|-\n! colspan=\"4\" | Possible People's Alliance candidates\n|-\n|\n|\n|\n|\n|-\n! style=\"width:100px; font-size:100%; background:;\"|\n! style=\"width:100px; font-size:100%; background:;\"|\n! style=\"width:100px; font-size:100%; background:;\"|\n! style=\"width:100px; font-size:100%; background:;\"|\n|-\n| style=\"background:#DEFDE6;\"| Recep Tayyip Erdoğan\n|  Devlet Bahçeli\n| Süleyman Soylu\n| Hulusi Akar\n|-\n| style=\"background:#DEFDE6;\"| Current President and AK Party leader\n| Nationalist Movement Party leader\n| Current Minister of the Interior\n| Current Minister of National Defense\n|-\n| style=\"background:#DEFDE6;\"| '''People's Alliance candidate'''\n| Rejected by himself\n| Speculated\n| Speculated\n|}\nOn 9 June 2022, Recep Tayyip Erdoğan, the leader of the Justice and Development Party and the incumbent president since 2014, announced that he would be a candidate in the 2023 presidential election. Erdogan's candidacy was supported by the other member parties of the People's Alliance, the Nationalist Movement Party (MHP) and the Great Unity Party (BBP). MHP leader Devlet Bahçeli stated more than once that the candidate for the People's Alliance would be Erdoğan. Some lawyers and opposition politicians stated that since Erdoğan was elected president twice in the 2014 and 2018 elections, he could not be a candidate again unless the parliament decided to hold early elections, according to the law. Mustafa Şentop, Ersan Şen, Metin Feyzioğlu and other lawyers said that the 2018 election was Erdoğan's first term, arguing that a new office was formed, apart from the name similarity, as the presidential system was adopted in 2018 following a constitutional referendum. According to Freedom House, Erdoğan has the right to run again in the new system in 2023, as his first term ended early. Stating that Erdoğan cannot be a candidate, the lawyers oppose this view by stating that the maximum term of office in the constitution has not been changed and in this case, the constitution should be taken as the basis, not the systems.\nThere was speculation that if Erdoğan was not the candidate, possible alternatives would have been Minister of Interior Süleyman Soylu or Minister of National Defense Hulusi Akar.\nNation Alliance and Table of Six\n{| class=\"wikitable\" style=\"margin:1em auto; font-size:90%; text-align:center;\"\n|-\n! colspan=\"6\" | Possible Republican People's Party candidates\n|-\n|\n|\n|\n|\n|\n|\n|-\n! style=\"width:100px; font-size:100%; background:;\" |\n! style=\"width:100px; font-size:100%; background:;\" |\n! style=\"width:100px; font-size:100%; background:;\" |\n! style=\"width:100px; font-size:100%; background:;\" |\n! style=\"width:100px; font-size:100%; background:;\" |\n! style=\"width:100px; font-size:100%; background:;\" |\n|-\n| style=\"background:#DEFDE6;\"| Kemal Kılıçdaroğlu\n| Ekrem İmamoğlu\n| Mansur Yavaş\n| Lütfü Savaş\n| İlhan Kesici\n| Tanju Özcan\n|-\n| style=\"background:#DEFDE6;\"| Republican People's Party leader\n| Istanbul mayor\n| Ankara mayor\n| Hatay mayor\n| Republican People's Party deputy\n| Bolu mayor\n|-\n| style=\"background:#DEFDE6;\"| Nation Alliance candidate\n| Rejected by himself\n| Rejected by himself\n| Declared his interest\n| Speculated\n| Declared his interest\n|}\n{| class=\"wikitable\" style=\"margin:1em auto; font-size:90%; text-align:center;\"\n|-\n! colspan=\"9\" | Other possible Table of Six candidates\n|-\n|\n|\n|\n|\n|\n|\n|\n|\n|\n|-\n! style=\"width:100px; font-size:100%; background:;\" |\n! style=\"width:100px; font-size:100%; background:;\" |\n! style=\"width:100px; font-size:100%; background:;\" |\n! style=\"width:100px; font-size:100%; background:;\" |\n! style=\"width:100px; font-size:100%; background:;\" |\n! style=\"width:100px; font-size:100%; background:;\" |\n! style=\"width:100px; font-size:100%; background:;\" |\n! style=\"width:100px; font-size:100%; background:;\" |\n! style=\"width:100px; font-size:100%; background:;\" |\n|-\n| Meral Akşener\n| Ali Babacan\n| Ahmet Davutoğlu\n| Temel Karamollaoğlu\n| Gültekin Uysal\n| Abdullah Gül\n| Haşim Kılıç\n| Muhtar Kent\n| Özgür Demirtaş\n|-\n| Good Party leader\n| DEVA Party leader\n| Future Party leader and former Prime minister\n| Felicity Party leader\n| Democrat Party leader\n| Former President of Turkey\n| Former Constitutional Court President\n| Business executive\n| Academician\n|-\n| Rejected by herself\n| Speculated\n| Speculated\n| Speculated\n| Speculated\n| Speculated\n| Speculated\n| Speculated\n| Speculated\n|}\nThe Nation Alliance was founded by the opposition parties which made up the Table of Six: the Republican People's Party, the Good Party, the Democrat Party, the Felicity Party, DEVA Party and the Future Party. It was agreed that six political parties would not nominate more than one candidate and would agree on a common candidate in order to \"not give the appearance of discrimination and competition\". At the meeting of Table of Six on 25 January 2023, it was discussed for the first time how the presidential candidate will be determined. The Table of Six was expected to decide on a joint candidate at a meeting held on 13 February. However, the meeting was postponed to 2 March due to the 2023 Turkey–Syria earthquake.\nKemal Kılıçdaroğlu\nThere was a high degree of media speculation concerning possible candidates within the current main opposition party, the Republican People's Party, that could possibly run as its candidate for president. Party leader Kemal Kılıçdaroğlu's candidacy was supported by CHP deputies and mayors such as parliamentary CHP group Deputy Chairman Özgür Özel, Deputy Chairman Veli Ağbaba, and mayor of Antalya Muhittin Böcek. Despite this, according to opinion polls taken before any official candidate was declared, Kılıçdaroğlu was one of the least likely to win against Erdoğan among the possible CHP candidates.\nThe Table of Six met on 2 March 2023 to determine the candidate. Although the name of the candidate was determined that day, the name of the candidate would be announced later. At the meeting, it was claimed that all parties, except the Good Party, approved Kemal Kılıçdaroğlu's candidacy. His candidacy was officially announced on 6 March 2023.\nEkrem İmamoğlu and Mansur Yavaş\nIn the 2019 local elections and the repeat Istanbul mayoral election, the presidential candidacy debates continued about Ekrem İmamoğlu, who won against the AK Party candidate Binali Yıldırım twice and won the Istanbul mayorship that the AK Party held since 2004. İmamoğlu was considered to be one of the strongest candidates if he chose to run against Erdoğan in 2023. In his own statement, he said \"I do not have an agenda regarding the presidency\" and stated that the process will be determined by the Table of Six.\nAnkara Mayor Mansur Yavaş, who won against the ruling party's candidate in the 2019 Ankara mayoral election, was also among the possible candidates. Yavaş, like Ekrem İmamoğlu, was considered a strong candidate who could win against Erdoğan. He was similarly ahead of Erdogan in most of the presidential election polls. On 6 December 2022, Yavaş answered a question regarding his potential candidacy saying, \"We will obey whatever the Table of Six says.\"\nVictory Party Chairman Ümit Özdağ requested Mansur Yavaş to be nominated. Özdağ later stated that if the Table of Six did not nominate Yavaş, they would propose a candidacy to Yavaş. Peoples' Democratic Party parliamentary group Deputy Chairman Meral Danış Beştaş said that they were against Mansur Yavaş's candidacy.\nReaction by the Good Party\nAlthough a member of the Nation Alliance, many members of the Good Party were noted as opposing a potential Kılıçdaroğlu candidacy throughout the electoral alliance's consideration of candidates. Orhun Erktürkmen, who is responsible for the youth policies of the Good Party, came out in support of the candidacies of İmamoğlu and Yavaş.\nOn 2 March 2023, when the Table of Six met and decided to endorse Kemal Kılıçdaroğlu's presidential candidacy, some Good Party members made online posts to indicate that the party was against Kılıçdaroğlu's candidacy. On 3 March 2023, the Good Party officially decided to leave the Table of Six because it did not support Kılıçdaroğlu as the joint candidate.  On the same day, Meral Akşener called for Ekrem İmamoğlu and Mansur Yavaş to be candidates in her statement. After this call, 5 CHP mayors, including Ekrem İmamoğlu and Mansur Yavaş, met with Kemal Kılıçdaroğlu. After the meeting, Akşener's call was rejected by İmamoğlu and Yavaş. Three days later, the Good Party rejoined the Table of Six after its meetings with the CHP.\nOther CHP members\nHatay mayor Lütfü Savaş and Bolu mayor Tanju Özcan announced that they would accept the presidential candidacy proposal.\nArea Research head Murat Karan claimed that if Kılıçdaroğlu did not run, Table of Six would nominate İlhan Kesici.\nOther Table of Six members\nGood Party leader Meral Akşener announced that she will not be a presidential candidate and that she will be a prime minister candidate if the strengthened parliamentary system supported by the main opposition is passed. Democracy and Progress Party leader Ali Babacan said he would accept it if he was nominated as a presidential candidate.\nOn 11 March 2022, Kemal Kılıçdaroğlu said that one of the leaders in the Table of Six could be a candidate. On 6 September 2022, Kemal Kılıçdaroğlu made the statement that \"Everyone has the right to be a candidate\" for the candidacy of former president Abdullah Gül. Abdullah Gül was also mentioned in the candidacy talks of the opposition in the 2018 Turkish presidential election.\nJournalist Nihat Genç claimed that the opposition's candidate would be former Constitutional Court Haşim Kılıç. Good Party Secretary Uğur Poyraz and CHP deputy Gürsel Tekin denied this claim. Tekin said that the candidate would be from the CHP. Journalist Emin Çapa said in a statement on Halk TV that the candidate must be clear and has no ties to politics. Upon this statement, it was claimed that Muhtar Kent or Özgür Demirtaş would be candidates. These allegations were denied by the CHP and it was stated that neither of the two names would be candidates and that they did not have such a potential.\nLabour and Freedom Alliance\n{| class=\"wikitable\" style=\"margin:1em auto; font-size:90%; text-align:center;\"\n|-\n! colspan=\"5\" |Possible Labour and Freedom Alliance candidates\n|-\n|\n|\n|\n|\n|\n|-\n! style=\"width:100px; font-size:100%; background:;\"|\n! style=\"width:100px; font-size:100%; background:;\"|\n! style=\"width:100px; font-size:100%; background:;\"|\n! style=\"width:100px; font-size:100%; background:;\"|\n! style=\"width:100px; font-size:100%; background:;\"|\n|-\n| Selahattin Demirtaş\n| Gültan Kışanak\n| Rıza Türmen\n| Ahmet Türk\n| Şebnem Korur Fincancı\n|-\n| Former Peoples' Democratic Party co-chair and political prisoner\n| Former Peace and Democracy Party co-chair\n| Former European Court of Human Rights judge\n| Former Democratic Society Party leader\n| President of the Turkish Medical Association\n|-\n| Speculated\n| Speculated\n| Speculated\n| Speculated\n| Speculated\n|}\nNo candidate was put forth by the Labour and Freedom Alliance. Prior to its announcement on 22 March 2023, it was speculated that if the Nation Alliance nominated Kılıçdaroğlu, the alliance would not nominate a candidate. After Kılıçdaroğlu was announced as the Nation's Alliance joint candidate, the Labour and Freedom Alliance chose to not nominate a candidate, which was seen as a strategic move to limit vote splitting against President Erdoğan. The alliance later endorsed Kılıçdaroğlu's candidacy on 27 April.\nOther parties\n{| class=\"wikitable\" style=\"margin:1em auto; font-size:90%; text-align:center;\"\n|-\n! colspan=\"7\" | Other possible candidates\n|-\n|\n|\n|\n|\n|\n|\n|\n|-\n! style=\"width:100px; font-size:100%; background:;\" |\n! style=\"width:100px; font-size:100%; background:;\" |\n! style=\"width:100px; font-size:100%; background:;\" |\n! style=\"width:100px; font-size:100%; background:#EE171F;\" |\n! style=\"width:100px; font-size:100%; background:#E4010B;\" |\n! style=\"width:100px; font-size:100%; background:;\" |\n! style=\"width:100px; font-size:100%; background:;\" |\n|-\n| style=\"background:#DEFDE6;\" | Sinan Oğan\n| style=\"background:#DEFDE6;\" | Muharrem İnce\n| Doğu Perinçek\n| Fatih Erbakan\n| Mustafa Sarıgül\n| Cem Uzan\n| Serdar Savaş\n|-\n| style=\"background:#DEFDE6;\" | Independent\n| style=\"background:#DEFDE6;\" | Homeland Party leader\n| Patriotic Party leader\n| New Welfare Party leader\n| Party for Change in Turkey leader\n| Former Young Party leader\n| Scientist\n|-\n| style=\"background:#DEFDE6;\" | Ancestral Alliance candidate\n| style=\"background:#DEFDE6;\" | Homeland Party candidate\n| Declared his candidacy\n| Declared and withdrew\n| Speculated\n| Declared his candidacy\n| Declared his candidacy\n|}\nSinan Oğan was nominated by the Ancestral Alliance, a right-wing electoral alliance formed to contest the 2023 elections headed by the Victory Party and Justice Party. Oğan, a former member of the Nationalist Movement Party before becoming an independent, was announced as the alliance's joint presidential candidate on 11 March 2023.\nMuharrem İnce served as the presidential candidate for the Homeland Party, of which he was the leader and founder. The Homeland Party split from the Republican People's Party in 2020, after İnce served as the party's presidential candidate in his failed 2018 campaign against President Erdoğan. Initially he considered joining the Nation Alliance as well as the Ancestral Alliance, but announced on 6 March 2023 he was leaving the alliance and soon after announced his own candidacy. This was considered mainly as a result of the choosing of as its joint presidential candidate, after earlier comments made by İnce stating that he wouldn't have considered supporting him under normal conditions. After qualifying for the ballot, three days before the election İnce withdrew himself from the race. His name still appeared on the ballot.\nDoğu Perinçek, the leader of the Patriotic Party and a candidate in the 2018 election, announced that he would be a candidate again. Fatih Erbakan announced his candidacy but later withdrew from the race and endorsed Erdogan. Former Young Party leader Cem Uzan and doctor Serdar Savaş are among those who also announced their candidacy. Mustafa Sarıgül, the leader of the Party for Change in Turkey, released a statement on his potential candidacy in January 2021, saying that his party would discuss the candidacy and make a decision. After the Nation Alliance's candidate was determined as Kemal Kılıçdaroğlu on 6 March 2023, Sarıgül supported Kılıçdaroğlu's candidacy by saying, \"The most suitable candidate for this transition period is Kemal Kılıçdaroğlu at that table.\"\nNominations\nNotes\nReferences"
    }
  ]
}