{
  "content": [
    {
      "type": "text",
      "text": "# 2023 President of Confederation of Industry of the Czech Republic election\n\n| elected_members    =\n| next_election      = 2027 President of Confederation of Industry of the Czech Republic election\n| next_year          = 2027\n| seats_for_election =\n| turnout            =\n| image1             =\n| candidate1         = Jan Rafaj\n| party1             =\n| colour1           = 007D94\n| electoral_vote1    = 78\n| percentage1        = 62.4%\n| image2             =\n| candidate2         = Mirek Topolánek\n| party2             =\n| colour2            = 06387F\n| electoral_vote2    = 47\n| percentage2        = 37.6%\n| title = President\n| before_election = Jaroslav Hanák\n| after_election = Jan Rafaj\n}}\nThe 2023 election of the President of the Confederation of Industry of the Czech Republic was held on 16 May 2023. Jan Rafaj and Mirek Topolánek advanced to second round in which Rafaj defeated Topolánek with 78 votes to Topolánek's 47.\nBackground\nConfederation of Industry of the Czech Republic was led by Jaroslav Hanák since 2011. Hanák was reelected in 2015 and 2019 elections. Hanák isn't running for another term. Former Prime Minister of the Czech Republic Mirek Topolánek announced his candidacy on 13 December 2022 during his interview for e15. Topolánek is a nominee of EGEM company which is part of EP Industries group. Bohdan Wojnar announced his candidacy on 10 February 2023. Wojnar is nominated by Association of the Automotive Industry. Jan Rafaj announced candidacy on the same day. Miroslav Palát was confirmed as a candidate on 16 February 2023.\nCandidates\n*Miroslav Palát, Member of the board of directors.\n*Jan Rafaj, Deputy President of Confederation of Industry and Director-General of Heimstaden company.\n*Mirek Topolánek, former Prime Minister of the Czech Republic and leader of the Civic Democratic Party was nominated by EGEM company.\n*Bohdan Wojnar, Manager at Škoda Auto is nominated by Association of the Automotive Industry.\nReferences"
    }
  ]
}