{
  "content": [
    {
      "type": "text",
      "text": "# 2023 in the Central African Republic\n\nEvents in the year 2023 in the Central African Republic.\nIncumbents\n* President: Faustin-Archange Touadéra\n* Prime Minister: Félix Moloua\nEvents\nOngoing – COVID-19 pandemic in the Central African Republic, Central African Republic Civil War\nJanuary\n* CPC fighters capture 20 national soldiers near Sikikédé, as political repression is intensified ahead of a referendum.\n* January 11 – Two French international consultants working for MINUSCA are arrested, with national authorities involved to resolve the situation.\nMarch\n* March 19 – Nine Chinese nationals are killed and two others are injured when suspected rebels storm the Chinese-run Chimbolo gold mine in Ouaka.\nJune\n* Oumar Al Bachir dies in hospital, after previously being arrested for crimes against humanity.\n* June 27 – The U.S. Treasury sanctions Midas Ressources SARLU and Diamville SAU, two Central African Republic–based companies accused of helping finance Wagner Group operations through gold and diamond mining and trade.\nJuly\n* July 28 – President Faustin-Archange Touadéra meets with Russian President Vladimir Putin in the Russia–Africa Summit in Saint Petersburg.\n* July 30 – A constitutional referendum is held, proposing the removal of presidential term limits and extending the mandate from five to seven years. The Constitutional Court later validates the results, thereby allowing President Faustin-Archange Touadéra to seek a third term.\nAugust\n* August 19 – The Government of CAR signs a decree granting prima facie refugee status to all Sudanese nationals fleeing violence since April 2023.\nSeptember\n* The Special Criminal Court charges Abdoulaye Hissène and arrests Edmond Patrick Abrou for war crimes, and exiled former president François Bozizé is sentenced in absentia to forced labor for life.\n* September 28 – 1,825 Sudanese refugees are relocated to the Korsi neighborhood in Birao.\nNovember\n* November 15 – The UN Security Council adopts Resolution 2709, renewing the mandate of MINUSCA; 14 are in favor, and Russia abstains.\nDecember\n* December 22 – Suspected 3R gunmen attack an army outpost in the village of Nzakoundou, killing a soldier and wounding many more, before attacking and burning civilian homes in the village and killing 20 more people.\nSee also\n*COVID-19 pandemic in Africa\n*African Continental Free Trade Area\n*Community of Sahel–Saharan States\nReferences"
    }
  ]
}