{
  "content": [
    {
      "type": "text",
      "text": "# 2024 Israeli invasion of Lebanon\n\n}}See here for a more detailed map\n| date              = 1 October – 27 November 2024 (}})\n| place             = Southern Lebanon\n| coordinates       =\n| result            = Israeli victory\n* 2024 Israel–Lebanon ceasefire agreement\n| territory         = Continued Israeli occupation force in parts of Southern Lebanon\n| combatant1        =\n| combatant2        =  Amal Movement Islamic Group SSNP-L Popular Front for the Liberation of Palestine\nIslamic Resistance in Iraq}}\n| combatant3        =  UNIFIL}}\n| commander1        =  Benjamin Netanyahu Israel Katz Herzi Halevi  Ori Gordin Guy Levi  Elad Tzuri Yeftah Norkin\n| commander2        =  Naim Qassem Hashem Safieddine Maurice Sleem Joseph Aoun\n| commander3        =   Aroldo Lázaro Sáenz  Chok Bahadur Dhakal  Jean-Jacques Fatinet  Axel Schulz  M Ghoffar Ngismangil  Johan Effendi Mohd Salleh\n| units1            =\n*\n** &nbsp;36th Division\n***  1st Infantry Brigade\n***  6th Infantry Brigade\n***  7th Armored Brigade\n***  188th Armored Brigade\n***\n**  91st Division\n***  3rd Infantry Brigade\n***  8th Armored Brigade\n***\n***  769th Territorial Brigade\n**  98th Division\n***  35th Paratroopers Brigade\n***  89th Oz Brigade\n****  Unit 621 (Egoz)\n***  Unit 5515\n** &nbsp;146th Division\n***  Carmeli Brigade\n***\n***\n***  226th Paratroopers Brigade\n**  210th Division\n***  HeHarim Brigade\n**  Yahalom\n*\n**  Unit 669\n*\n*  General Staff of the Israel Defense Forces\n**  Intelligence Directorate\n***  Unit 8200\n}}\n| units2            =  Hezbollah military wing\n*  Lebanese Resistance Brigades\n*  Redwan Force\n*  Imam Hussein Division\n*  Aziz Unit\n*  Nasser Unit\n*  Bader Unit\n*  Unit 4400\n*  Engineering Corps\n*  Artillery Corps\nAmal military wing\n* Al-Abbas Force\nFajr Forces Eagles of the Whirlwind&nbsp;&nbsp;Yemeni Armed Forces (|Supreme Political Council}}) Abu Ali Mustafa Brigades Harakat Hezbollah al-Nujaba Lebanese Armed Forces }}\n| units3            =  Garuda Contingent MALBATT 121st/125th Infantry Battalion\n| strength1         =  15,000Per Hezbollah: 70,000+ soldiers 100+ military vehicles\n| strength2         =  20,000–100,000 80,000\n| strength3         =  10,000\n| casualties1       = Per IDF:60 soldiers killed}}900 soldiers injuredPer Hezbollah:95+ soldiers killed900+ soldiers injured42 Merkava tanks destroyed4 military bulldozers destroyed\n| casualties2       = Per Lebanon:2,720 Lebanese killed (mostly civilians)41 Lebanese Army soldiers killed28 medics killed (including medics affiliated with Hezbollah, and the Amal Party)40 search and rescue personnel killedPer Hezbollah: 5,000 Hezbollah fighters killed and 13,000 woundedPer IDF: 2,762 Hezbollah fighters killed8 surrenderedThousands injured, at least 7,000 severely or moderately80% of pre-war Hezbollah rockets and missiles destroyed (denied by Hezbollah)\n| casualties3       = Per UNIFIL:42 UN peacekeepers wounded}}\n| notes             = }}\n| campaignbox       =\n| image_size        = 300\n}}\nOn 1 October 2024, Israel invaded Southern Lebanon, marking the sixth Israeli invasion of Lebanon since 1978. The invasion took place after nearly 12 months of conflict between Israel and Hezbollah. On 26 November, Israel and Lebanon signed a ceasefire agreement, mediated by France and the United States. The ceasefire went into effect on 27 November, though some attacks continue.\nHostilities between Hezbollah and Israel erupted shortly after Hamas' October 7 attack on Israel, when Hezbollah joined the conflict in support of Hamas, launching rockets into northern Israel and the Israeli-occupied Golan Heights. Cross borders attacks resulted in a large number of displaced people on both sides of the border. Prior to the incursions, Israel had conducted major attacks in Lebanon including an attack on pagers and electronic devices, and assassination of Hezbollah leader Hassan Nasrallah. Israel had also conducted an aerial bombing campaign throughout Lebanon, killing over 800 Lebanese people in one week in late September. Israel stated that it had been attacking in Lebanon to destroy Hezbollah's military capabilities so that they no longer pose a threat to it.\nAt the start of the invasion, the Lebanese Armed Forces (LAF) withdrew from parts of the Blue Line. On 27 November, the ceasefire agreement came into effect. Israel has reported 56 of its soldiers and 2,762 Hezbollah militants killed in the invasion, while the Lebanese government has reported Israel killing 2,720 people in Lebanon, mostly civilians.\nUnder the ceasefire agreement, Israeli forces were to withdraw from Lebanon by 26 January 2025, but Israel refused to do so, leading to a new deadline of Israeli withdrawal by 18 February 2025. Israel did not fully withdraw by the new deadline, as it withdrew troops from Lebanese villages but kept Israeli forces maintaining five military outposts on highlands in Southern Lebanon.\nBackground\nThe last time Israel invaded southern Lebanon and engaged in ground combat with Hezbollah was during the month-long 2006 Lebanon War.\nAccording to security expert Sobelman, Israel had spent two decades preparing for the next war with Hezbollah.\nShortly after the onset of the Gaza war in October 2023, Hezbollah joined the conflict, citing solidarity with Palestinians, which quickly escalated into regular cross-border military exchanges impacting areas in or around northern Israel, southern Lebanon and the Israeli-occupied Golan Heights of Syria. Hezbollah said it aimed to pressure Israel by forcing it to fight on two fronts. Hezbollah has offered an immediate ceasefire should a ceasefire also happen in Gaza. From 8 October 2023 to 20 September 2024, Hezbollah has launched 1,900 cross border attacks, and Israel has launched another 8,300. The fighting killed 564 in Lebanon (including 133 civilians), and 52 in Israel (including 27 civilians), displaced entire communities in Israel and Lebanon, with significant damage to civilian infrastructure.\nIsrael requested that Hezbollah implement United Nations Security Council Resolution 1701 (UNSCR 1701) and withdraw its forces north of the Litani River. Hezbollah has stated it will continue attacking Israel until Israel halts its operations in Gaza. Both Israel and Hezbollah have outstanding obligations under UNSCR 1701. Hezbollah has established strong military presence in southern Lebanon, storing rockets in civilian sites, building tunnels into Israel, and obstructing United Nations Interim Force in Lebanon's (UNIFIL) access. Israel continues to occupy Ghajar and an adjacent area, and has repeatedly breached Lebanese airspace, waters, and borders. UNIFIL reports that Israel entered Lebanese airspace on more than 22,000 occasions between 2007 and 2021. Diplomatic efforts, led by U.S. envoy Amos Hochstein and France, were not effective in resolving the conflict by 18 September 2024.\nSeptember 2024 escalation\nOn 15 September, leaflets bearing an IDF logo were observed in southern Lebanon. They contained the text, \"Hezbollah is firing from your area\", urging residents to relocate north and to refrain from returning \"until the war is over\". The IDF said that they were distributed without senior authorisation and that the incident was being investigated.\nOn 17 and 18 September, thousands of Hezbollah's handheld pagers and walkie-talkies exploded in a coordinated series of attacks. The explosions killed 42 people and injured at least 3,500, including civilians. Reuters reported that, according to an unnamed Hezbollah official, 1,500 Hezbollah fighters were taken out of action due to injuries, with many blinded or having lost their hands. Despite Israel denying involvement with the attack, unnamed Israeli sources told Reuters and other media that it was orchestrated by Israel's intelligence service (Mossad) and military. In response, Hezbollah, who described the attack as a possible declaration of war by Israel, launched a rocket attack on northern Israel a few days later.\nOn 20 September, tensions further rose after Ibrahim Aqil was killed in an Israeli strike in Beirut, along with other senior commanders from the unit.\nPeople in southern Lebanon and Beirut received mobile phone calls and messages that told them to relocate. IDF spokesperson Daniel Hagari said in a video address, \"We advise civilians from Lebanese villages located in and next to buildings and areas used by Hezbollah for military purposes, such as those used to store weapons, to immediately evacuate for their own safety\".\nThe IDF began a series of airstrikes on 23 September, killing over 800 and injuring more than 5,000 in the first week.\nOn 27 September 2024, Hassan Nasrallah, the secretary-general of Hezbollah, and several other senior Hezbollah leaders, including Ali Karaki, commander of Hezbollah's southern front, were killed in an Israeli airstrike in Beirut. The strike took place while Hezbollah leaders were meeting at a headquarters located underground beneath residential buildings in Haret Hreik in the Dahieh suburb to the south of Beirut.\nPrevious Israeli raids\nOn 1 October, the IDF revealed that its special forces had carried out more than 70 small covert raids into southern Lebanon since November 2023, but had not clashed with Hezbollah fighters during these raids. The IDF said it had uncovered Hezbollah tunnels, weaponry, and invasion plans in villages near the border, including Ayta ash-Shaab, Mais al-Jabal and Kfar Kila. IDF Spokesman Daniel Hagari said they found Hezbollah plans to launch an attack similar to Hamas' 7 October attacks, which sparked the conflict. Hagari also mentioned that evidence from these operations, including videos and maps, would be presented to the international community. Hezbollah had not commented on his claims by the end of September.\nHagari alleged that the group was preparing for an attack similar to the 7 October Hamas-led attack on Israel.\nPreparations\nOn 30 September, Israel informed the United States that it intended to carry out a ground maneuver in Lebanon aimed at clearing Hezbollah's militant infrastructure along the border. That evening, the Lebanese Armed Forces (LAF) and United Nations Interim Force in Lebanon (UNIFIL) withdrew from the Israeli-Lebanese border to the north to a distance of  from the border, and the Israel Defense Forces (IDF) declared that the communities of Metula, Misgav Am and Kfar Giladi are a closed military area. Since then the LAF has reported an incident of fire exchange with the IDF. IDF troops were amassing on the border in Southern Lebanon, with Israel stating that they were preparing for a limited ground operation, with no intentions for long-term occupation.\nInitial timeline\n1 October\nOn 1 October, IDF troops crossed the border into Lebanon in a series of small scale raids intended to precede a broader ground incursion. Witnesses have said that they have heard sounds of tanks in Southern Lebanon. There were also reports of heavy artillery striking the border towns of Southern Lebanon. On 1 October, the IDF confirmed the existence of their ground operation in a statement on Telegram, specifying that they intended to strike Hezbollah infrastructure. Shortly after the release of this statement, IDF Spokesperson Daniel Hagari also confirmed the operation. Prior to the release of these statements, the IDF had made no announcements about the operation. The IDF ordered residents of 25 villages in southern Lebanon to immediately relocate to north of the Awali River.\nIDF Arabic-language spokesperson Avichay Adraee said that heavy fighting was taking place in southern Lebanon with Hezbollah. He warned residents to not move in vehicles from north of Litani River to south of the river. The IDF also said that projectiles were launched to Avivim and Metula. However, IDF spokesperson Daniel Hagari said they were not yet fighting Hezbollah face-to-face. Another Israeli military official said that they had not yet clashed with Hezbollah on the ground, and that IDF troops had so far been operating in villages only hundreds of meters across the border. Hezbollah denied that Israeli troops had entered Lebanon.\nThe IDF claimed that in coordination with the Intelligence Division, IDF forces led by the Northern Command and special forces had captured Hezbollah infrastructure in the towns of Kafr Kila, Ayta ash Shab, Meiss Ej Jabal amongst other sites and destroyed the facilities after they were abandoned after the retreat of Hezbollah. Hezbollah also claimed that it had targeted IDF soldiers in towns opposite of Odaisseh and Kafr Kila.\nThe IAF struck 100 Hezbollah targets in Lebanon while soldiers of the Northern Command destroyed several military sites and weapons.\nAn Israeli strike on a house in Al-Dawoudiya killed at least ten people and injured five others.\nRetaliation by Hezbollah\nHezbollah launched ten rockets from southern Lebanon to Israel and a drone towards central Israel. Hezbollah said that it targeted IDF sites, Israeli communities and soldiers with 12 separate strikes. Three rockets were launched from Lebanon towards Upper Galilee. Hezbollah said that it targeted Israeli soldiers in Metula with rockets and artillery.\n\"A number of\" rockets were launched from Lebanon to Israel, moderately injuring two people. Hezbollah said that it targeted Unit 8200 headquarters in Tel Aviv with Fadi-4 rockets and Mossad headquarters in the suburbs of Tel Aviv. Approximately 30 rockets were launched from Lebanon towards northern Israel. Hezbollah said that its missiles targeted Sde Dov, an airport and airbase in the outskirts of Tel Aviv that was closed and demolished more than four years before the attack.\nIsraeli strikes elsewhere\nThe IDF called for evacuations of at least 500 meters from particular buildings with Hezbollah facilities in parts of southern Beirut, the capital of Lebanon, as they were preparing to bomb them. The IDF conducted at least two airstrikes in Dahieh. The IDF claimed that Muhammad Jaafar Qasir, a Hezbollah commander responsible for transferring Iranian weapons to Hezbollah in Lebanon, was killed in an airstrike in Beirut. The IDF said that it killed the commander of Hezbollah's Imam Hussein division in an airstrike in Beirut.\nAn Israeli strike on the house of Munir al-Maqdah, a brigadier general of Al-Aqsa Martyrs' Brigades in Lebanon in Ein al-Hilweh refugee camp killed at least five people.\nSyrian military sources said that Israel struck two Syrian anti-aircraft radar stations west of Sweida and a Syrian anti-aircraft radar station in Daraa Governorate.\nIranian strikes on Israel\nIran's Islamic Revolutionary Guard Corps (IRGC) launched at least 181 missiles toward Israel, with at least one building being hit in Tel Aviv. The attack was in response to the assassination of Abbas Nilforoushan, Hassan Nasrallah and Ismail Haniyeh. At least two Israelis were injured in Tel Aviv and a Palestinian was killed by shrapnel in Nu'eima, West Bank.\n2 October\nduring the Israeli invasion of southern Lebanon]]\nOn 2 October, Israeli forces were ambushed by Hezbollah fighters in Odaisseh and forced to retreat while attempting to dismantle militant infrastructure. Six soldiers from the Egoz Unit were killed and several others were injured, including five seriously. The IDF said that another 20 Hezbollah militants were killed during the clash. Two soldiers of the Golani Brigade were killed and another was injured in combat in southern Lebanon. Hezbollah said it destroyed three Merkava tanks with guided missiles as they approached Maroun al-Ras. A medic from the brigade was injured in a separate incident. The IDF also announced that an officer of the Paratroopers Brigade's 202nd Battalion was killed in combat.\nAn Israeli air strike destroyed three houses in the Bekaa Valley killing 11 people.\nMore forces from the IDF 36th Division entered southern Lebanon including the Golani Brigade, the 188th Armored Brigade, the Etzioni Reserve Brigade and the 282nd Artillery Brigade.\nHezbollah fired around 100 rockets at northern Israel. Hezbollah said that it targeted areas north of Haifa using missiles. It also targeted Shtula and Israeli infantry in Misgav Am.\nBeirut suburbs strike\nIsraeli aircraft struck the southern suburbs of Beirut. Israeli soldiers from the 98th division's two Brigades managed to capture a Hezbollah installation in southern Lebanon capturing a large cache of weaponry, ammunition amongst other things as well as claiming to have captured/destroyed 150 Hezbollah targets in Southern Lebanon in coordination with IAF. After the airstrike, Beirut residents reported a sulphur-like smell. The National News Agency reported that Israel had used phosphorus bombs in the heavily populated Bashoura district. According to Protocol III of the Convention on Certain Conventional Weapons, the use of phosphorus bombs in civilian areas is prohibited.\nHezbollah engaged Israeli soldiers entering Maroun al-Ras from its eastern side claiming to have inflicted several casualties amongst the Israelis. The LAF said that an IDF force crossed the Blue Line in the areas of Khirbet Yaroun and Odaisseh and claimed they retreated after an incursion of about 400m. The IDF announced that the IAF struck 150 Hezbollah sites since the ground offensive began. A LAF soldier was injured in an IDF drone strike while one of its units was working to open a road at the entrance of Kawkaba.\nHezbollah claimed that it killed or injured Israeli soldiers trying to circumvent Yaroun by detonating an explosive device.\nHezbollah fired 40 rockets at Safed and several drones at the Upper Galilee.\nDeaths and injuries\nThe IDF announced the death of nine soldiers during combat in southern Lebanon. It also said that since the start of the invasion, 50 Hezbollah militants have been killed, with thirty of them being killed in a single battle with the Egoz unit. Moreover, thirty Israeli soldiers were wounded, including seven seriously which were evacuated by Unit 669.\nHezbollah claimed to have destroyed three Israeli Merkava tanks with guided missiles as they approached Maroun al-Ras.\nDamascus drone strike\nSyrian state media reported that at least three civilians were killed and three injured in an Israeli drone strike in Damascus. The strike killed the brother of the commander of Hezbollah's Unit 4400, who was also killed the day prior.\nHezbollah claimed to have killed or injured all members of an Israeli infantry unit sheltering in a home outside Kafr Kila by detonating an explosive device in the house and targeting it using bullets and rocket-propelled grenades. Hezbollah said that it targeted Israeli soldiers in Ya'ara with rockets.\nBeirut health facility strike\nAn Israeli airstrike on a Hezbollah-affiliated health facility a kilometre away from the Lebanese Parliament in central Beirut killed nine people, including seven paramedics, and injured 14 other people.\n3 October\nAttack on the Lebanese army and response\nThe LAF stated that the IDF targeted an army post in the Bint Jbeil area, and the LAF — for the first time in the invasion — fired back at the IDF. One LAF soldier was killed. Another LAF soldier was killed and four Lebanese Red Cross medics and another LAF soldier were injured in an Israeli strike in Taybeh while they were working on a rescue and evacuation mission.\nThe LAF said that one of its soldiers was killed in an Israeli strike on a military outpost in Bint Jbeil. It also said that its soldiers responded to the sources of fire.\nHezbollah strikes\nTwo drones targeted Bat Yam in central Israel, one of which was shot down and the other hit an open area.\nHezbollah said that it launched surface-to-air missiles targeting an IDF helicopter flying above Beit Hillel claiming that it forced it to retreat. Approximately 25 rockets and two drones were launched from Lebanon towards Israel.\nHezbollah launched more than a dozen of strikes on Israeli targets. Hezbollah claimed to have killed or wounded a group of Israeli soldiers in the vicinity of Maroun al-Ras by detonating two explosive devices.\nHezbollah fired ten rockets at the Lower Galilee, causing no casualties.\nHezbollah claimed that it detonated a Sejil bomb at IDF forces in Yaroun, causing casualties. It also claimed to have launched a missile against a Merkava tank in Netu'a, while a rocket salvo targeted Israeli troops in Al-Thaghra in the outskirts of Odaisseh.\nHezbollah fired 100 Katyusha rockets, six Falaq rockets and mortars at Metula. Hezbollah said that it targeted Safed and Kafr Giladi using rockets.\nAccording to Hezbollah, six IDF infiltration attempts into southern Lebanon were repelled by its forces.\nCasualties\nTwo Belgian journalists were wounded in Beirut. A US resident was killed in an Israeli airstrike in Lebanon.\nThe IDF announced the death of two soldiers killed in combat. Hezbollah stated that it had killed 17 IDF soldiers on 3 October.\nThe World Health Organization said that 28 health care workers were killed in Lebanon over the past 24 hours. Lebanese Health Minister Firass Abiad said that 40 paramedics and firefighters including emergency personnel from organisations affiliated with Hezbollah were killed in Lebanon in three days.\nIsraeli strikes\nThe IAF struck Hezbollah intelligence and communications sites in Beirut.\nAn Israeli strike on the municipality building in Bint Jbeil killed 15 people. The IDF said that Hezbollah fighters were killed and the building was used by Hezbollah to store weapons.\nAn Israeli airstrike on a building in southern Lebanon, around the area where soldiers from the Golani Brigade were operating, killed a Hezbollah field commander.\nAn IRGC adviser died from wounds he sustained from an Israeli airstrike in Damascus three days prior.\nPersonnel of the Golani Brigade attacked a military site where Hezbollah commanders were staying and captured the building. A commander of the Hezbollah Artillery Corps, a commander of the Hezbollah Engineering Corps and a local Redwan Force commander were killed in the battle.\nIDF reports\nThe IDF said that it struck 15 Hezbollah sites in Beirut, including weapon depots and manufacturing sites.\nIn total, the IDF said it have killed more than 100 Hezbollah militants since the start of the war.\nDahieh airstrike\nSenior Hezbollah official Hashem Safieddine, who was expected to succeed Nasrallah as the group's secretary-general following his assassination, was reportedly targeted by an Israeli airstrike in Beirut. It was unclear whether Safieddine had been killed. Hezbollah said it had lost contact with Safieddine after the strike.\n4 October\nUNIFIL\nOn 4 October, an international dispute occurred as the IDF ordered an Irish UNIFIL peacekeeping unit deployed in southern Lebanon to abandon their border outpost. Ireland rejected the orders, with President Michael D. Higgins calling them \"outrageous\".\nMasnaa Border Crossing strike\nThe IDF halted traffic at the Masnaa Border Crossing between Syria and Lebanon by striking \"vital transportation infrastructure\" using two missiles. The IDF had alleged that the border crossing was being used by Hezbollah for transferring weapons from Syria to Lebanon one day prior to the strike.\nHezbollah strikes\nHezbollah said that it targeted Haifa using rockets. A rocket launched from Lebanon fell in Upper Galilee area causing a forest fire. About 50 instances of rockets or shrapnel falling were reported in Metula in the past 24 hours. Hezbollah launched more than 100 rockets towards Israel. Hezbollah claimed to have struck a group of Israeli soldiers in the vicinity of Maroun al-Ras. Hezbollah said that it launched a missile strike on the Nafah IDF base in the Golan Heights and it also said that it targeted Kfar Giladi. The IDF said that it struck Hezbollah weapons warehouses and infrastructure, including its intelligence headquarters in Beirut.\nCasualties\nThe Lebanese National News Agency reported that four health workers were killed in an Israeli drone strike in the vicinity of a government hospital in Marjayoun.\nThe IDF said that over 250 Hezbollah fighters were killed in southern Lebanon since it began its ground offensive, including 21 field commanders.\nHezbollah said that at least 20 Israeli elite soldiers were killed or wounded in clashes in a Lebanese village.\nIsraeli control in Lebanon\nIsrael claimed operational control of \"multiple\" Shi'ite villages in southern Lebanon.\npersonnel operating in Southern Lebanon on 4 October]]\n5 October\nHezbollah strikes\nOn 5 October 2024, Hezbollah claimed to have hit an Israeli Merkava tank as it was advancing in the Maroun al-Ras forest area using a guided anti-armor missile, resulting in casualties.\nHezbollah claimed that it launched rockets targeting Israeli soldiers in Khallet Ubair village in Yaroun, as well as on Kafrioufel and Kfar Giladi in northern Israel.\nHezbollah said that it launched at least seven strikes on IDF soldiers including launching Fadi 1 missiles targeting Ramat David IDF base and launching rockets targeting IDF soldiers in the vicinity of the border.\nIsraeli strikes\nAn Israeli strike on a mosque in Bint Jbeil also hit nearby Salah Ghandour Hospital injuring nine of its medical staff. The IDF said that it targeted Hezbollah fighters in a command center embedded inside the mosque without providing evidence.\nIDF stated that it had started pouring cement into Hezbollah tunnels to make them unusable.\nPresident of France Emmanuel Macron called for a halt on arms deliveries to Israel, which Netanyahu condemned. In an apparent retaliation of this, the IDF blew up a gas station in Beirut owned by the French petroleum company TotalEnergies. The explosion resulted in a large fire, but no injuries were reported.\nCasualties\nA female Red Cross volunteer from Baalbek died of a head injury sustained in an Israeli airstrike. A missile hit in the vicinity of a paramedic team to prevent them from reaching the site of a bigger strike in a Beirut suburb.\nHamas confirmed the death of Saeed Atallah Ali, one of its military officials, along with his wife and two young daughters in an Israeli drone strike in Beddawi refugee camp.\nA Hezbollah rocket attack lightly injured three people in Deir al-Asad and caused damage in Karmiel.\n6 October\nPope Francis called for an immediate ceasefire in both Gaza and Lebanon.\nThe Lebanese Education Ministry announced that 40% of the 1.25 million students in Lebanon had been displaced by the Israeli invasion and bombings.\n7 October\nIsraeli strikes\nOn 7 October, two Israeli airstrikes in towns south of Beirut killed at least 12 people, including several Lebanese children.\nIsraeli warplanes struck a fire station building affiliated with the Islamic Health Authority in Baraachit, killing ten firefighters.\nHezbollah strikes\nOn the anniversary of the Hamas-led attack on Israel, Hezbollah fired several rockets at northern Israel, wounding at least 10 people in Haifa and another in Tiberias. Alerts were activated in Upper Galilee after 15 rockets were detected. The IDF announced the deaths of two soldiers in combat in the past 24 hours, on the Lebanese border, while another two were seriously injured.\n8 October\nin southern Lebanon on 8 October]]\nThe IDF was filmed raising the Israeli flag in Maroun al-Ras, seemingly indicating they had captured the village. However, according to UNIFIL, IDF troops there later withdrew from Maroun al-Ras to unknown positions. Lebanese fishermen were forced to keep their boats ashore after Israel warned that it would expand its operations against Hezbollah to coastal areas south of Sidon.\n9 October\nHezbollah-affiliated sources stated the IDF had withdrawn from Odaisseh and Kfar Kila. Netanyahu released an address to the government and people of Lebanon in English, saying that the country would face \"destruction and suffering like we see in Gaza\" if they did not rise up against Hezbollah. IDF reported the death of one soldier during clashes in south Lebanon.\nDerdghaya Melkite Church airstrike\nIsrael struck a church of the Melkite Greek Catholic Eparchy of Tyre that was being used to shelter displaced people in Derdghaya, killing at least eight people.\n10 October\nIsraeli attacks on UN peacekeepers\nUNIFIL stated that the IDF had fired upon three peacekeeper positions, one being fired at on 9 October and two others being fired upon on 10 October. In one of the incidents, two were injured after a tank had shot at an observation tower, causing them to fall. No peacekeepers were harmed in the other two incidents.\nOn the same day, Israeli troops opened fire at three UNIFIL positions in south Lebanon, including UNIFIL's main base at Naqoura. The following day an IDF tank fired at the UNIFIL observation tower in Naqoura injuring two Indonesian peacekeepers. In the evening, a joint statement of condemnation was released by France, Italy and Spain, while US President Joe Biden asked Israel not to attack UNIFIL forces.\nBachoura airstrike\nIsraeli airstrikes in two densely populated neighborhoods in Bachoura in central Beirut killed at least 22 Lebanese people and injured another 117. Israel said it was targeting Wafiq Safa, Hezbollah's liaison with Lebanon's security agencies. Safa survived the attack. This was the deadliest strike on Beirut since the start of the post-2023 Israel-Hezbollah conflict, leveling an apartment building and destroying nearby cars and building interiors. A US-made munition was used in the attack.\n11 October\nOn that night, UNIFIL reported receiving \"significant damage\" to its buildings in Ramyah due to explosions from nearby shelling.\nIsraeli attack on Lebanese military checkpoint\nAccording to the Lebanese army, an Israeli airstrike hit a building near a military checkpoint in Kafra, Bint Jbeil District in southern Lebanon, killing two LAF soldiers and wounding three other Lebanese troops.\n12 October\nIsraeli strikes\nNine people were killed and 24 others were wounded in Israeli strikes on the Lebanese villages of Maaysrah, in the mountains north of Beirut, and Barja, south of Beirut.\nIsrael also struck the central commercial area of Nabatieh in the south. The Lebanese Red Cross said it was initially unable to reach the area of the strike due to large fires from the blast.\nGunfire and explosions near UNIFIL facilities\nA UNIFIL press release stated that \"Last night, a peacekeeper at UNIFIL's headquarters in Naqoura was hit by gunfire due to ongoing military activity nearby.\" The statement also referred to buildings in their UN positions receiving \"significant damage due to explosions from nearby shelling\" in a separate incident in Ramyah. A joint statement was made through the initiative of Poland, with 44 countries including three UN Security Council permanent members condemned the attack.\n13 October\nIsraeli attack on Ramyah UNIFIL post\nIsraeli Prime Minister Benjamin Netanyahu has called for UNIFIL peacekeepers to immediately withdraw from Lebanon, calling them \"human shields\" for Hezbollah. Later in the day, two Israeli tanks destroyed the main gate of a UNIFIL post in Ramyah and forcibly entered the post. Two hours later, the IDF fired rounds into the camp that caused smoke to rise, injuring 15 UNIFIL peacekeepers due to skin irritations and gastrointestinal reactions. A report by one of the countries providing troops to UNIFIL said that the smoke was suspected to be white phosphorus, the use of which is unlawful in populated areas under international law.\nDrone attack on IDF base\nA Hezbollah drone attack on a gathering of IDF soldiers in Zar'it barracks in Binyamina killed at least four Israeli soldiers and wounded another 61.\n14 October\nAitou airstrike\nAn Israeli airstrike hit the Maronite Christian town of Aitou in northern Lebanon, killing at least 21 and wounding eight. The dead included including twelve women and two children and injured eight others.\n15 October\nOn 15 October, the UNHCR said that over 25% of Lebanon was under evacuation orders of Israel. Israeli air strikes in Qana killed 15 people and injured 15 others.\nThe French Armed Forces Minister Sébastien Lecornu stated he supported UNIFIL remaining in place in Lebanon, despite Israel's orders for them to leave.\nIsraeli strikes\nIsrael bombed homes and a healthcare center in Qana, which is notable for having previously experienced massacres in 1996 and 2006. At least 10 people died in the attacks, and 54 were injured.\n16 October\nAttack on Nabatieh municipal council\nIsrael bombed a meeting of the municipal council of Nabatieh, killing at least 16 municipality staff, including the mayor Ahmad Kahil, and injuring more than 52.\nHezbollah strikes\nHezbollah fired a barrage of 30 rockets towards Karmiel, wounding two Israelis in Upper Galilee.\nIsraeli attack on a UNIFIL watchtower\nIsraeli tanks fired at a UNIFIL watchtower in Kafr Kila. UNIFIL called the attack \"deliberate fire on a UNIFIL position\" and reported that the watchtower was damaged, along with two cameras.\nIsraeli destruction of Mhaibib\nThe IDF released footage of them destroying a village. The Daily Telegraph reported that the village in the video was \"confirmed to be Mhaibib by local officials\". Al Jazeera also reported that the village was Mhaibib. In the same report, Al Jazeera published footage of soldiers they claimed were celebrating the destruction of the village, quoting the IDF as 'saying they were targeting \"terrorist infrastructure.\"' Reuters connected an IDF statement that it had '\"dismantled\" a tunnel network used by Hezbollah's elite Redwan Force in the heart of a town near the border with Israel' to the destruction of the village. While the three outlets quoted the IDF regarding \"terrorist infrastructure\", they did not suggest that they had independently corroborated the IDF's allegation.\nCasualties\nFive IDF soldiers were reported killed in combat in southern Lebanon.\n17 October\nThe IDF confirmed that 5 soldiers had been killed in clashes with Hezbollah and 8 others were injured.\nUNIFIL shoots down armed drone\nA German warship operating as a part of UNIFIL shot down a drone of unknown origin in the Mediterranean Sea about  northwest of the Lebanese port of Naqoura. According to the German defense ministry, there was no damage to the warship and no injuries to its crew.\n18 October\nThe IDF reported that an Israeli soldier died from wounds suffered in a 9 October attack in south Lebanon.\n19 October\nSahel Alma airstrike\nOn 19 October 2024, the Israel Defense Forces conducted an airstrike on a car in the village of Sahel Alma, part of the city of Jounieh, as part of the 2024 Israeli invasion of Lebanon. An Israeli drone targeted a Honda sports utility vehicle driving on the main highway from Byblos to Jounieh in Sahel Alma. The drone hit the car causing it to lose control before it stopped 100 meters down the highway where a man and woman, reported to be husband and wife, ran out of the car and into a field on the side of the highway before being killed in another blast. This was the first time that the predominantly Christian city of Jounieh was struck since the war began. A witness saw the charred remains of one of the persons in the field. It was reported that there were three rocket strikes in the attack.\nA member of the Jounieh municipality, Fadi Fayad, stated that \"It seems they were coming from Jbeil toward Jounieh at the time of the strike...We urge citizens to be vigilant and responsible and to inform the municipality of any new leasing operations (new individuals renting apartments) to maintain the security of the area, as no area can be considered safe.\" The Lebanese National News Agency has referred to the two killed as martyrs.\nDrone attack on Benjamin Netanyahu's residence\nA drone attack believed to have originated from Lebanon was made on the residence of Benjamin Netanyahu in the resort town Caesarea. Netanyahu was not in the residence at the time, and no casualties were reported. In response, Netanyahu stated that \"the proxies of Iran who today tried to assassinate me and my wife made a bitter mistake.\" Iran has attributed the reported attack to Hezbollah, with the state-run IRNA news agency quoting Iran's mission to the UN saying: \"The action in question has been carried out by Hezbollah in Lebanon.\"\n20 October\nDestruction of observation tower in Marwahin\nUNIFIL released a press statement stating that the IDF deliberately bulldozed a UNIFIL observation tower and perimeter fence in the Lebanese border town of Marwahin.\nIDF strike on LAF soldiers\nAn IDF airstrike killed three LAF soldiers driving in a vehicle near an IDF area of operation.\nHezbollah rocket attack\nAbout 200 missiles were fired at northern Israel.\n21 October\nA bomb hit a residential building across the street from the Rafik Hariri University hospital, killing at least 18, including four children, and injuring 60.\nClashes\nHezbollah and the IDF engaged in clashes in the villages of Ayta ash Shab and Ramiya as the IDF attempted to advance into the villages.\n22 October\nAn Israeli airstrike on a house in Teffahta killed 19 people.\nHezbollah rocket barrage\nHezbollah conducted a rocket barrage on Neot Mordechai in northern Israel, a 27-year-old IDF reservist from Tel Aviv was killed and three other soldiers were seriously wounded. Another soldier was killed in south Lebanon.\n23 October\nAir attacks on Dahieh resumed in what was called one of the worst nights of bombing in the neighborhood to date. Six buildings, including the offices of Al Mayadeen, were destroyed in seventeen raids.\nCasualties\nThe IDF said that four of its soldiers were killed in southern Lebanon, while six others were evacuated from Lebanon after being seriously wounded. Hezbollah said that its fighters have killed more than 70 Israeli soldiers.\n24 October\nAyta al-Shaab clashes\nHezbollah reported that its fighters were engaged in ongoing \"intense\" clashes against IDF vehicles in Ayta al-Shaab. On the same day, Hezbollah said that it destroyed an Israeli tank with a guided missile, killing and wounding the soldiers inside.\nMilitary casualties\nFive IDF soldiers were killed and 19 others were wounded in a southern Lebanon village. According to the IDF, Hezbollah forces attacked the building in which the soldiers were accepting logistics supplies.\n25 October\nThree journalists were killed in an Israeli airstrike on a residential compound housing media workers in Hasbaya. Two were employees of Al Mayadeen, and the other worked for Al Manar TV.\n26 October\nThe IDF said five of its soldiers were killed in southern Lebanon, bringing the IDF's reported casualties up to 32 since 1 October, according to CNN.\nIDF attack on UNIFIL observation post near Dhayra on 22 October\nA UNIFIL press release on 25 October stated that IDF soldiers fired at an observation post near the town of Dhayra on 22 October 2024.\n27 October\nAt least eight people were killed and 25 wounded in an Israeli strike on the Haret Saida neighoorhood of Sidon.\n28 October\nBeqaa Valley airstrikes\nThe Lebanese Health Ministry reported that at least 60 people, including two children, were killed and 58 wounded in strikes on 12 areas of the Beqaa Valley. Israel bombed the southern towns of Rachaya al-Fakhar, Kfar Hamam, Alma ash-Shaab, and Naqoura with artillery shells.\n29 October\nOn 29 October, nine people were killed and a girl was trapped under rubble in an Israeli airstrike in Haret Saida, southeast of Sidon. An Israeli airstrike in Sarafand killed 10 people and injured 21 others. Israeli defence minister Yoav Gallant claimed that Hezbollah maintained only 20% of the rockets and missiles it initially had before the conflict. Hezbollah denied the claim. The IDF said that its military goals in Lebanon had been achieved with the Israeli government planning to go ahead with diplomatic negotiations. Israeli officials said the ceasefire negotiations were \"in advanced stages\" as White House special envoy Amos Hochstein traveled to the region to mediate the negotiations.\nAn IDF soldier died of wounds suffered during battle the previous days.\n30 October\nIsraeli struck Baalbek, killing 19 people, including eight women. 20 strikes were reported in the area, five of which were in the city limits.\nThe IDF claimed to have killed dozens of militants one day prior. Israeli airstrikes in Sohmor killed 11 people and injured 15 others. Israeli strikes killed 19 people, including eight women in two towns in Baalbek District.\n31 October\nOn 31 October, SANA reported that Israeli strikes hit a number of residential buildings in Al-Qusayr, causing \"material damage\" to its industrial zone and some of its residential neighbourhoods killing 10 people, including civilians. The IDF said that it struck Hezbollah command centers and weapon depots.\nHezbollah fired rockets at the Haifa region, killing two Israelis, while four Thai workers and one Israeli national were killed in Metula.\n1 November\nAt least 52 Lebanese people were killed and 72 wounded in Israeli airstrikes in northeastern Lebanon.\nAn Israeli airstrike on a home in Amhaz killed at least 12 people and injured several others.\n2 November\nIsraeli kidnapping\nThe IDF claimed it had killed a commander of the Nasser Unit rocket unit of Hezbollah, Jaafar Khader Faoura, and captured an unnamed \"senior Hezbollah operative\" from northern Lebanon and transported them into Israeli territory. The Lebanese government stated that it would file a complaint to the United Nations Security Council in response to the abduction.\nHezbollah rocket attack\nA rocket fired by Hezbollah injured 19 people in Tayibe in central Israel.\n3 November\nAt least three people were killed and nine wounded in an Israeli strike in Haret Saida.\n5 November\nAn Israeli strike on a residential building in Barja killed at least 30 people and injured several others including a woman and her child.\nAn IDF soldier died from wounds suffered in the north.\n7 November\nUNIFIL confirmed that five of its Malaysian peacekeepers were injured by an Israeli airstrike on Sidon. This was followed by a statement from the Lebanese Army who confirmed that three of its soldiers were also injured in the same attack. The attack was heavily condemned by France, which called for an immediate cessation of hostilities and the complete implementation of UN Security Council Resolution 1701 to enable displaced people in Israel and Lebanon to safely return home.\n8 November\nAn IDF soldier died from wounds sustained on 26 October.\n10 November\nAn Israeli airstrike in Aalmat village, Lebanon, killed at least 23 people, including seven children, and injured six others.\nAn Israeli strike on a civil defense centre affiliated to the Islamic Mission Scouts Association in Ras al-Ain, Lebanon killed 15 people and injured two others.\n11 November\nAn Israeli airstrike on a building in Ain Yaaqoub killed at least 14 people, injured 15 others and trapped some people under the rubble.\n12 November\nAn Israeli air strike in Joun killed 15 people including eight women and four children and wounded 12 others.\n13 November\nSix IDF soldiers from the Golani Brigade were killed in southern Lebanon.\n14 November\nThe IDF struck a building in the vicinity of Beirut International Airport, and footage shared by Lebanese media showed a passenger plane being taxied on the runway near the strike. An Israeli airstrike on a civil defense center in Duris, Lebanon killed at least 15 people. One IDF platoon commander of the Golani Brigade was killed in Lebanon.\n15 November\nTwelve paramedics were killed in an Israeli airstrike on Duris. One IDF soldier of the Golani Brigade was killed in south Lebanon.\n16 November\nIsraeli troops reached the deepest point in Lebanon since the start of the invasion. They briefly captured a hill in Chamaa and according to Lebanese state media, destroyed the Shrine of Shamoun Al Safa. Israeli warplanes attacked Dahiyeh, wounding footballer Celine Haidar, and also attacked Tyre. A strike on Khreibeh killed a family of six.\n19 November\nUNICEF spokesperson James Elder stated that more than 200 children have been killed since the start of the Israeli invasion. One IDF soldier was killed in south Lebanon.\n20 November\nThree IDF soldiers were killed in southern Lebanon.\n22 November\nLebanon's health ministry stated that a hospital director and six others were killed by an Israeli airstrike in northeastern Lebanon, and a separate Israeli airstrike killed five paramedics in southern Lebanon.\n23 November\nAn Israeli airstrike on a building in Basta area of Beirut Central District targeting Hezbollah official Muhammad Haydar killed at least 29 people and injured 67 others. The target was reportedly not present in the building.\n26 November\nIDF troops reached the Litani River hours before Israel's security cabinet reached a ceasefire with Hezbollah. The ceasefire stipulates that Hezbollah's militants would leave the border with Israel in exchange for the withdrawal of Israeli troops from southern Lebanon.\n27 November\nThe IDF estimated that it killed several dozens of Hezbollah operatives in its strikes on a Radwan Force base in Beqaa Valley in the night leading up to the truce. The ceasefire deal between Israel and Hezbollah went into effect at 4:00a.m. UTC+02:00.\nPost-ceasefire events\n28 November 2024\nDespite the ceasefire being in effect, Israel continued its offensive, with at least 18 strikes as of the evening of 28 November, in one case citing the presence of \"several suspects\" in vehicles arriving in southern Lebanon. The IDF opened fire on at least six targets, with the Lebanese Army stating that the IDF was in violation of the ceasefire. Details on the alleged suspects were not released, though the IDF said it was launching strikes against \"terrorist activity.\" Additionally, the IDF told Lebanese citizens not to move south of the Litani River, establishing a night-time curfew from 5:00pm local time until 7:00am the next day.\n29 November\nDespite the ceasefire being in effect, the IDF continued its offensive into Khiam.\n2 December\nHezbollah launched two mortars towards Shebaa Farms, claiming that it was responding defensively to repeated ceasefire violations by the IDF. In response, the IDF struck dozens of Hezbollah members and rocket launchers, including the one used in the mortar attack. Six people were killed in Haris and four others in Talloussah.\n9 December\nFour IDF soldiers were killed in a tunnel explosion during an operational detonation of a Hezbollah cache in south Lebanon.\n17 December\nAn Israeli drone targeted a car in Majdal Zun injuring two. Israel also demolished homes in Naqoura.\nThe town of Kfar Kila was completely demolished by the IDF while Halta and Shebaa were targeted by Israeli artillery.\nAccording to the Middle East Monitor, a Qatari-financed not-for-profit press monitoring organisation and lobbying group, Israel had violated the ceasefire 12 times, bringing the total number of violations to 248, with casualties post-ceasefire numbering 30 dead and 36 wounded, as of 17 December.\n18 December\nA group of Israeli settlers of the far-right Uri Tzafon Movement attempted to cross the Blue Line and establish a settlement in the Lebanese village of Maroun al-Ras but were dispersed by the IDF, as the area was a closed military zone. The IDF described the situation as a \"grave incident\", and emphasized the risks of uncoordinated civilian movement into Lebanon.\n20 December 2024\nIsrael violated the ceasefire 6 times, flying drones near Tyre and bombarding Alma al-Shaab.\n3 January 2025\nThe UN called on Israel to withdrawal from southern Lebanon in accordance to the ceasefire, which they have yet to do.\n4 January\nThe IDF announced that it planned to renew its offensive for at least 30 days after the 60 day ceasefire runs out claiming that they will seek to occupy all territory south of the Litani River, should the Lebanese army not evict Hezbollah.\n10 January\nAn Israeli drone-strike on Tayr Dibba killed 5.\n26 January\nThe ceasefire's deadline for the withdrawal of Israeli forces from Lebanon was due to expire on 26 January. The Israeli forces still remained in Lebanon at this time and the ceasefire was extended to mid-February. Israel accused the Lebanese government of failing to remove Hezbollah forces from the area as stipulated by the ceasefire agreement. The Lebanese government in turn blamed Israel for not withdrawing by the agreed deadline.\nLebanon’s Ministry of Public Health stated that Israeli soldiers attacked Lebanese civilians who attempted to return to towns still occupied by Israeli forces. AP reported that 24 people were killed on that day and two more on the next day. According to the IDF, its forces opened fire on suspects who approached Israeli troops and posed \"imminent threat.\"\n8 February\nSix people were killed and two others were wounded in Israeli airstrikes near Jannata, South Governorate.\n14 February\nThe deputy commander of UNIFIL was injured after his convoy was attacked by Hezbollah supporters after two planes from Iran were barred from landing in Beirut.\n17 February\nDespite the ceasefire agreement giving an extended deadline for Israeli forces to leave Lebanon by 18 February 2025, the Israeli military announced on 17 February that it would retain and maintain five military outposts on hills and mountains in southern Lebanon near the Israeli communities of Shlomi, Zar'it, Avivim, Margaliot and Metula.\n18 February\nLebanese state media reported that Israeli forces mostly left Lebanon, except for five Israeli military outposts in Lebanon. The Lebanese government stated it would not tolerate IDF troops remaining in Lebanon as it would be an \"occupation\".\n12 April\nAccording to reports Hezbollah has largely dismantled its military presence in southern Lebanon, handing over control of 190 military positions out of 265 to the Lebanese army. The move complies with a U.S.-brokered ceasefire agreement from November 2024, which requires Hezbollah to reposition north of the Litani River and deploy around 5,000 Lebanese troops to the south. Intended to ease tensions along the Israel-Lebanon border and support the return of displaced residents, the withdrawal involved removing heavy weaponry, though some local fighters remain lightly armed. International observers continue to monitor the fragile situation to ensure adherence to the agreement.\n16 April\nIsraeli defense minister Israel Katz on 16 April 2025 declared that Israeli forces would indefinitely remain in \"security zones\" that they \"cleared and seized\" in Lebanon, Gaza and Syria, as \"a buffer between the enemy and [Israeli] communities\". At the time, while Israeli forces had departed from villages in Lebanon, Israeli forces continued their presence in \"five strategic overlook locations inside Lebanon\", along the Israel-Lebanon border, reported the Associated Press.\nImpacts\nLebanese healthcare\nAccording to a CNN analysis of verified Lebanese Health Ministry data, between 23 September and 23 October, Israeli airstrikes damaged 34 hospitals, hit 107 ambulances, and killed 111 emergency medical technicians (EMTs) in Lebanon. The analysis also found that Israel had dropped bombs within \"lethal proximity\", , of at least 19 hospitals and within  of 24 hospitals.\nAccording to the Lebanese health ministry, Israeli strikes targeted 40 hospitals, 84 medical and ambulance centers, and a total of 243 medical facilities, killing at least 178 Lebanese medical staff members since October 2023.\nThe World Health Organization (WHO) reported that it would be unable to \"deliver a large shipment of trauma and medical supplies\" originally scheduled for October 4 to Lebanon due to the almost complete closure of Beirut's airport. In a statement released on 16 October, the WHO stated that \"[Israeli] attacks on hospitals and health workers jeopardize provision of health in Lebanon,\" adding that \"out of 207 primary health care centres and dispensaries in conflict-affected areas, 100 are now closed.\"\nEarly in the invasion, the near total closure of Beirut's airport prevented medical aid supply deliveries from the WHO.\nDuring the invasion, hospitals in Lebanon have experienced an increase in patients with miscarriages, early births, and other pregnancy complications, as people have been forced to flee their homes.\nAt least one case of cholera has been confirmed in Lebanon, emerging from the poor sanitation and water conditions those displaced have been living in. The crowded shelters and public schools used to house the displaced population combined with the strained healthcare system have prompted fears of communicable disease outbreaks.\nCasualties\nSince mid-September 2024, Israeli strikes on Lebanon have killed at least 2,267 people and injured 11,022 more, according to a CNN tally. While in Mid-November 2024 Lebanon Ministry of Public Health reported 3,583 killed, including 231 children. UNICEF confirmed that more than 200 children has been killed. The Lebanese Health Ministry has reported that most Lebanese killed by Israel are civilians.\nThe Hezbollah leader Naim Qassem said that 5,000 Hezbollah fighters were killed and 13,000 were wounded in the war.\nAdditionally, at least 1.2 million Lebanese civilians have been displaced as a result of Israeli bombings and evacuation orders, which the United Nations described as \"the largest wave of displacement Lebanon has seen in decades\".\nWar crimes\nBy Israel\nHuman Rights Watch states that it has documented \"flagrant violations of the laws of war and war crimes by the Israeli military, including apparently deliberate or indiscriminate attacks on journalists, civilians, medics, financial institutions, and peacekeepers, in addition to the widespread and unlawful use of white phosphorus in populated areas, among other violations.\" Twenty NGOs have called on the UN members states of the UN Human Rights Council to convene a Special Session on the situation in Lebanon to investigate all violations of humanitarian and human rights law.\nKilling of civilians in Lebanon\nOn 5 November 2023, an Israeli airstrike hit a car near Ainata, Lebanon, killing three children and their grandmother, and injuring their mother. The IDF admitted to striking the vehicle. Human Rights Watch stated that their killings should be investigated as an apparent war crime. Najib Mikati, Lebanon's caretaker prime minister, called the attack a \"heinous crime\" and said that Lebanon would file a complaint to the UN Security Council. According to the Syrian Observatory for Human Rights, at least 78 Syrian civilians were killed by the IDF.\nAttacks on Lebanese healthcare facilities and healthcare workers\nAccording to Al Jazeera, Israel has \"carried out more than 280 attacks on emergency medical facilities in Lebanon\" in the first 13 months of the war. This has resulted in the deaths of at least 208 health care workers, and 311 other injuries. Targeting health establishments and units, including hospitals and their medical staff, is illegal under international humanitarian law. Human Rights Watch states that it has documented three Israeli attacks on Lebanese medical workers and healthcare facilities and refers to the attacks as \"apparent war crimes.\"\nIsrael justified the strikes as targeting Hezbollah bunkers beneath the hospitals, as medical facilities lose protections when they are used for militant activity.\nAttacks on civilian Hezbollah targets\nIn October 2024, Israel bombed financial institutions it stated were affiliated with Hezbollah, leading Amnesty International to state the strikes should be investigated as possible war crimes.\nAttacks on journalists\nReporters without Borders called for an independent investigation into a \"possible war crime\" in response to an Israeli airstrike that hit a guesthouse in the town of Hasbaya killing and injuring several journalists.\nAttacks on UNIFIL positions\nIn October 2024, Israel attacked the UNIFIL peacekeeping bases in southern Lebanon. In response, UNIFL stated, \"Any deliberate attack on peacekeepers is a grave violation of international humanitarian law and of Security Council resolution 1701\". According to the Israeli Ambassador to the UN, \"Hezbollah terrorists are using UNIFIL outposts as hiding places and as places of ambushes.\" Human Rights Watch has called for a UN inquiry on the Israeli military's repeated attacks on UNIFIL's peacekeepers.\nBy Hezbollah\nAttacks on civilian targets\nHezbollah repeatedly announced intentions to launch inaccurate rockets at civilian cities, per Amnesty International reporting. Amnesty characterized the attacks as \"attacking the civilian city or town\". Amnesty further describes the rockets being used by Hezbollah as \"inherently inaccurate, as it is not possible to aim them with any degree of confidence or determine exactly where they will strike.\"\nKilling of civilians in Israel\nAn Amnesty International investigation reported 3 cases of Hezbollah rockets that targeted civilian areas in Israel in October 2024. 8 civilians were killed and at least 16 more were injured. The deaths included Mohammed Naim, a 23-year-old Arab Israeli.\nAttacks on UNIFIL positions\nIn October 2024, Hezbollah attacked the UNIFIL peacekeeping headquarters in Naquora, Lebanon. UNIFIL reported \"“A rocket hit UNIFIL’s headquarters in Naqoura, setting a vehicle workshop on fire, [which] was fired from north of UNIFIL’s headquarters, likely by Hezbollah or an affiliated group” Eight Austrian peacekeepers were injured.\nReactions\nLebanese government\nThe government of Lebanon and the Lebanese Armed Forces (LAF) issued a statement stating they would not be getting involved in the conflict between Israel and Hezbollah, following a meeting between Commander of the Lebanese Armed Forces Joseph Aoun and Speaker of Parliament Nabih Berri. The LAF withdrew some personnel from observation posts along the blue line, however, despite this, they have given no intention of withdrawing from territory south of the Litani River and have stated they will \"respond to Israeli fire on its positions.\" Prime Minister of Lebanon, Najib Mikati, has offered to deploy the LAF along the Blue Line if Hezbollah withdraws to the Litani River.\nForeign Policy reported that \"Lebanese and Western military officials as well as local politicians and notables\" stated the LAF would stay out of the conflict \"as long as it can\" due to concerns that the LAF doesn't have the capability to win, or even credibly participate in fighting as the LAF only numbers 70,000 soldiers, many of whom also work other jobs, lacks any fighter jets and only owns outdated tanks. Instead the LAF is focusing on being a \"police force\" to keep the various internal factions within Lebanon at peace while Hezbollah and Israel fight. Additionally, the LAF has no intention of siding with Hezbollah, as that would cause all western arms shipments to the LAF to cease, since Hezbollah is recognized by the LAF's arms suppliers as a terrorist organization. However, the LAF is at risk of losing the position of \"the only legitimate defender of Lebanon\" to Hezbollah should it remain out of the conflict, which would only strengthen Hezbollah's internal support within Lebanon.\nInternational community\n* : Started evacuating its nationals from Lebanon by reserving 800 passenger seats on available commercial flights. Foreign Minister Mélanie Joly said that \"The security situation in Lebanon is becoming increasingly dangerous and volatile\".\n* : The Spokesperson of the Foreign Ministry stated that China opposes \"the violation of Lebanon's sovereignty, security and territorial integrity.\" China's embassy in Beirut announced on 2 October that it had evacuated over 200 Chinese citizens and their family members from Lebanon to China and Cyprus.\n* : The Foreign Ministry organized the evacuation of 117 Colombians from Lebanon in Beirut by Colombia's Air Force while it was delivering humanitarian aide on 2 October. In a statement on the evacuations, the Foreign Ministry \"reiterate[d] Colombia's rejection of any military action against innocent citizens and call[ed] for an immediate ceasefire\".\n* : Prime Minister Mette Frederiksen stated that she supports an international intervention to support the two-state solution and end the conflict.\n* : Deployed a naval warship off the coast of Lebanon to aid in the evacuation of its nationals, as well as sent humanitarian aid to Lebanon with the plane used on the way back to evacuate French citizens. Foreign Minister Jean-Noël Barrot traveled to Lebanon two days prior to the start of the invasion, stating France \"stands with Lebanon\" ahead of a war \"it did not choose\". On 8 October, he called Israeli Prime Minister Benjamin Netanyahu's rhetoric on Israel's military operations in Lebanon a \"provocation\".\n* : President Michael D. Higgins criticized Israel's actions as \"outrageous\" after it ordered an Irish UNIFIL peacekeeping unit to abandon their outpost in southern Lebanon.\n* : Foreign Minister Antonio Tajani announced that Italy would be willing to send troops to the UN for the establishment of a Palestinian state due to instability caused by the invasion.\n* : Deputy Prime Minister and Minister of Foreign Affairs Ayman Safadi talked to Lebanese prime minister Najib Mikati and expressed Jordan's support for Lebanese sovereignty. Additionally, Abdullah II directed two aid planes to Lebanon.\n* : Secretary-General Mark Rutte expressed hope that \"hostilities will end as soon as possible\".\n* : The Foreign Ministry released a statement saying that it \"expresses the Sultanate of Oman's condemnation and denunciation of the raids launched by the Israeli occupation forces on Lebanese territory.\" It also iterated Oman's \"solidarity with the sisterly Lebanese Republic\" and its \"complete rejection of any violations of Lebanon's sovereignty and territory\".\n* : Palestinian President Mahmoud Abbas accused Israel of \"genocide\".\n* : Prime Minister Sheikh Mohammed bin Abdulrahman Al Thani held phone calls with Lebanon's army chief and prime minister expressing \"deep concern\" over the situation. Minister for international cooperation, Lolwah Al-Khater condemned the attack, stating on X that \"A monster has been unleashed in our region\".\n* : Kremlin spokesman Dmitry Peskov stated that Moscow is concerned with the recent escalation in Lebanon. The Foreign Ministry condemned Israel's invasion and called on Israel to \"immediately cease hostilities, withdraw their troops from Lebanese territory and engage in a real search for peaceful ways to resolve the Middle East conflict.\"\n* : The Foreign Ministry stated the attack violates Lebanon's sovereignty. President Recep Tayyip Erdoğan, accused Israel of \"genocide\".\n* : The Ministry of Foreign Affairs stated that it held \"deep concern\" about the situation, that it had \"reaffirmed its unwavering position towards the unity of Lebanon, national sovereignty, and territorial integrity\", and that President Mohamed bin Zayed Al Nahyan had \"directed the delivery of an urgent $100m relief package to the people of Lebanon\".\n* : Foreign Secretary David Lammy stated the UK had chartered a commercial flight for its citizens wishing to leave Lebanon and that the flight would leave on 2 October from Beirut–Rafic Hariri International Airport adding that \"The safety of British citizens in Lebanon is our absolute priority\". Prior to the start of the invasion, Lammy had called for a \"an immediate ceasefire\" and \"a political solution\".\n* : During a 30 September press conference, President Joe Biden responded to a reporter's question on Israel's actions in Lebanon saying he was aware of Israel's plans, but \"comfortable with them stopping\", adding \"we should have a ceasefire now.\" On 1 October however, Defense Secretary Lloyd Austin told Israeli Defense Minister Yoav Gallant that the United States supported Israel's ground offensive. On 7 October, State Department spokesperson Matthew Miller said the United States supports Israel's \"ability to target militants, to degrade Hezbollah's infrastructure, to degrade Hezbollah's capability\".\n* : On 14 October, Spain and Ireland requested the European Commission to suspend the EU–Israel Association Agreement as human rights (article 2 of the Agreement) are being violated by Israel due to its invasion of Lebanon.\nEvacuations\nreceiving repatriated Brazilian nationals from Lebanon on 6 October 2024. Brazil has the highest number of Lebanese descendants and expatriates in the world.]]\nSince the escalation of the conflict between Israel and Hezbollah, many countries have called on their citizens to leave Lebanon and/or started evacuating them such as Australia, Canada, Colombia, Brazil, France, Germany, Italy, Turkey, the United Kingdom, and the United States.\nIn the case of the United States, the U.S. Embassy in Beirut announced on 27 September 2024 that it was \"not evacuating U.S. citizens at this time.\" In response, U.S. Representative Rashida Tlaib stated the State Department was \"leaving Americans behind and failing to protect their own citizens\". After the U.S. government announced a first flight, Al Jazeera wrote: \"State Department spokesperson Matthew Miller said the flight carried 100 US citizens – a fraction of the nearly 6,000 Americans who have contacted the US embassy for information and help.\" Lebanese-Americans filed a class-action lawsuit against the State Department in the hopes of expediting an evacuation.\nEvacuation has been taking place through the use of the countries' military aircraft, chartered flights or maritime routes via Cyprus. As of 5 October 2024, many airlines have indefinitely shut their services at Beirut–Rafic Hariri International Airport due to Israeli airstrikes hitting areas nearby, though Lebanon's Middle East Airlines and regional carriers such as Iraqi Airways and Saudi Arabian Airlines have been operating.\nAnalysis\nUnited States' waning influence\nWriting for The Guardian, Andrew Roth assessed that the invasion showed Israel's willingness to ignore its chief ally, the United States, and the latter's lack of influence over the Netanyahu government. Aaron David Miller, a senior fellow at the Carnegie Endowment for International Peace, stated that this was in part caused by the Democrats trying to avoid criticising Netanyahu before the U.S. presidential elections. Analysts believe that Netanyahu had a limited time frame before the US elections to attack Iranian proxies in the region. Writers for ITV News, The Washington Post, and Politico agreed that the invasion highlighted the waning influence the U.S. government has on Israel.\nPersonal motivations of Netanyahu\nAccording to CNN's Stephen Collinson as well as Israeli observers, there is a long-standing suspicion among observers in Washington that Netanyahu has a strong personal interest in continuing the war to make amends for his failure to prevent the 7 October attacks and to delay ongoing legal proceedings against him for bribery, fraud, and breach of public trust.\nHezbollah capabilities\nPrior the ground invasion, the Institute for the Study of War (ISW) on September 28 noted that while Israeli strikes led to \"temporary organizational paralysis\" and \"internal disarray\", Hezbollah \"should be able to overcome this disruption, however, if given the time and space to do so\", and furthermore that killed Hezbollah commanders \"have deputies who should in principle be able to fill those roles and help the force recover\" despite \"difficult circumstance\". The ISW termed damage done to Hezbollah's leadership as \"short term\" and a \"temporary effect\" if given the chance to reconstitute.\nOn 5 October, the ISW reported that Hezbollah capabilities may have not been as degraded as previously thought, despite the extensive Israeli killing of its commanders and likely reduction in combat effectiveness of some of its forces. The report stated that Hezbollah has kept the bulk of its forces in positions deeper inside Lebanon while only engaging in limited-contact attacks against the IDF at the frontlines, concluding that the group \"retains effective command-and-control at least at the tactical level and possibly higher\". Writing for the Center for Strategic and International Studies, Daniel Byman assessed that Israel had learnt lessons from the 2006 Lebanon War and had a number of intelligence successes prior to the invasion, such as the detonation of pagers used by Hezbollah. However, Byman also noted that Hezbollah had expanded its rocket arsenal since, and benefited from a number of factors such as being able to retreat away from the border and dragging the war out to its benefit. The New Statesman noted that though Israel enjoyed military superiority over Hezbollah, the latter had been able to bounce back from prior military defeats, and could exploit the fact that Israel is unlikely to win the conflict on the battlefield alone.\nThe ISW reported on 28 October that Hezbollah's military forces in southern Lebanon were disorganized and struggling against the IDF, which have effectively disrupted their operations. It also claimed that despite Hezbollah's attempts to portray itself as a competent military organization, it had failed to execute significant military strategies and lost valuable equipment to the IDF.\nIsrael's methods\nAccording to Karim Emilie Bitar, a professor of international relations at the Saint Joseph University of Beirut, IDF airstrikes outside of south Lebanon are meant to foster civil strife.\nSee also\n* 1978 South Lebanon conflict\n* 1982 Lebanon War\n* Israeli occupation of Southern Lebanon (1982–2000)\n* 2006 Lebanon War\n* Operation Accountability\n* Operation Grapes of Wrath\n* Hezbollah tunnels\n* Israeli invasion of Syria (2024–present)\nNotes\nReferences"
    }
  ]
}