{
  "content": [
    {
      "type": "text",
      "text": "# 2024 Iranian presidential election\n\n8.55pp49.68% (second round)\n| image1 = Masoud Pezeshkian 14040616 (cropped).jpg\n| nominee1 = Masoud Pezeshkian\n| party1 = Independent politician\n| popular_vote1 = 16,384,403\n| percentage1 = 54.76%\n| color1 = 48D1CC\n| alliance1 = Reformists\n| image2 = Saeed Jalili in 2024 (cropped).jpg\n| nominee2 = Saeed Jalili\n| party2 = Independent politician\n| popular_vote2 = 13,538,179\n| percentage2 = 45.24%\n| color2 = E73232\n| alliance2 = Principlists\n| map_image =\n}}\nEarly presidential elections in Iran were held on 28 June and 5 July 2024 following the death of incumbent president Ebrahim Raisi in a helicopter crash on 19 May.\nFour candidates contested the first round of the election, in which Masoud Pezeshkian won 44%, Saeed Jalili won 40%, Mohammad Bagher Ghalibaf won 14% and Mostafa Pourmohammadi won less than 1% of the vote. Pezeshkian was the only reformist candidate on the ballot. As no candidate won a majority in the first round, a run off vote was held on 5 July between Jalili and Pezeshkian, which the latter won with 53.7% of the vote. On 6 July 2024, the Ministry of Interior declared Pezeshkian the winner of the election, with Jalili conceding defeat shortly thereafter.\nWith a 39.93% turnout, the first round of the election saw the lowest participation for a presidential election in the Islamic Republic's history. The turnout improved in the second round to 49.68%. Pezeshkian was seated as president after the ballot certification process was completed. His inauguration was held on 28 July.\nBackground\nOn 19 May 2024, after Iranian President Ebrahim Raisi inaugurated a hydroelectric complex at the Giz Galasi Reservoir near the Iran-Azerbaijan border, together with the President of Azerbaijan Ilham Aliyev, Raisi departed from the site in a helicopter. The helicopter carrying Raisi and seven other passengers and crew crashed at approximately 13:30 IRST (UTC+03:30) near the village of Uzi in Varzaqan County in East Azerbaijan province. Later that day, the wreckage of the helicopter was located, with everyone on board found dead. This led to First Vice President Mohammad Mokhber becoming the acting president according to Article 131 of the Constitution.\nElectoral system\nThe president of Iran is usually elected every four years by a \"direct vote of the people\", as set out by Article 114 of the Iranian Constitution. The upcoming presidential election was scheduled to take place on or before 18 June 2025, but was held earlier due to the death of the president. Under Iran's political system, the President is the country's highest directly elected official, the chief of the executive branch, and the second most important position after that of the Supreme Leader. The minimum voting age is 18.\nAccording to the Islamic Republic of Iran's constitution, any Iranian citizen who believes in Shia Islam, is loyal to the Constitution, the ideology of Guardianship of the Islamic Jurist and the Islamic Republic can participate in the election as a presidential candidate. The Election Monitoring Agency (EMA), managed by the Guardian Council, vets registered candidates and selects a handful to run in the election.\nThe Guardian Council does not publicly announce the reason for rejections of particular candidates, although those reasons are privately explained to each candidate. Women are not constitutionally restricted from running, but all who have registered as candidates have been disqualified by the Guardian Council. The council has officially denied rejecting a woman's candidacy because of her gender.\nCandidates approved by the Guardian Council are put to a public vote. The winner is the candidate who receives a majority (50% plus one) of votes. If no candidate receives enough votes, a run-off election is held between the two candidates with the most votes the following Friday. Iranians who vote during the election receive a stamp that indicates so on their birth certificates.\nAccording to the constitution, once the result is known, the Supreme Leader must sign the decree of the elected president, and if he refuses to sign, the elected president will not assume the presidency. As of 2024, Supreme Leaders have always signed the decree of the elected president. After that, the elected president must recite and sign an oath in a session of the Islamic Consultative Assembly, in the presence of the members of the Guardian Council and the head of the Supreme Court.\nFor this election, more than 61 million citizens were eligible to vote, with about 18 million of them between 18 and 30 years old. Voters were required to present identity booklets, passports or smart Iranian identity cards The Ministry of Intelligence warned that presidential nominees were under constant monitoring.\nOverseas voting\nVoting for overseas Iranians was held in 344 locations worldwide. In Australia, polling was canceled in Brisbane and Sydney due to protests by the Iranian diaspora. Opponents of the Iranian government, who wanted a boycott of the election, criticized the Biden administration for allowing the installation of voting stations in the United States. Saudi Arabia and Canada refused to grant Iran permission to install overseas ballot boxes, though the decision was later reversed in Saudi Arabia.\nVoting stations for Canadian voters were instead placed on the US-Canada border.\nDates\nFollowing the announcement of Raisi's death on 20 May, authorities announced that voting would be held on 28 June. Registration of candidates began on 30 May and ran until 3 June, while campaigning lasted from 12 June until 27 June.\nCandidates\nThe registration to run for the presidency started on 30 May and ended on 3 June. A total of 80 people, including four women, filed their candidacies for president. Most candidates were considered as conservatives or ultra conservatives. The final list of candidates was released by the Guardian Council on 9 June. Per Article 99 of the Constitution, those rejected by the council are not allowed to protest the rejection.\nApplied\n{| class=\"wikitable sortable mw-collapsible mw-collapsed\" style=\"text-align:center;\"\n! scope=\"col\" |Name\n!\n!Born\n!class=\"unsortable\" |Experience\n!Campaign\n!Ref\n|-\n| data-sort-value=\"Ahmadinejad, Mahmoud\" |Mahmoud Ahmadinejad\n| style=\"background:;\" |\n|(age )Aradan, Iran\n|Member of the Expediency Discernment Council(since 2013)President of Iran(2005–2013)Mayor of Tehran(2003–2005)Disqualified presidential candidate (2017, 2021)\n|Islamic Society of Engineers\n|\n|-\n| data-sort-value=\"Bazrpash, Mehrdad\" |Mehrdad Bazrpash\n| style=\"background:;\" |\n|(age )Tehran, Iran\n|Minister of Roads and Urban Development(since 2022)President of the Supreme Audit Court(2020–2022)Member of the Islamic Consultative Assembly(2012–2016)\n|Front of Islamic Revolution Stability\n|\n|-\n| data-sort-value=\"Elahian, Zohreh\" |Zohreh Elahian\n| style=\"background:;\" |\n|(age )Kermanshah, Iran\n|Member of the Islamic Consultative Assembly(2008–2012; 2020–2024)\n|Society of Pathseekers\n|\n|-\n| data-sort-value=\"Esmaili, Mohammad Mehdi\" |Mohammad Mehdi Esmaili\n| style=\"background:;\" |\n|(age )Kabudarahang, Iran\n|Minister of Culture and Islamic Guidance(since 2021)\n|Independent\n|\n|-\n| data-sort-value=\"Ghalibaf, Mohammad Bagher\" |Mohammad Bagher Ghalibaf\n| style=\"background:;\" |\n|(age )Torqabeh, Iran\n|Speaker of the Islamic Consultative Assembly(since 2020)Member of Expediency Discernment Council(2017–2020)Mayor of Tehran(2005–2017)Presidential candidate (2013, 2017)\n|Progress and Justice Population of Islamic Iran\n|\n|-\n|data-sort-value=\"Haghanian, Vahid\"|Vahid Haghanian\n|style=\"background:;\" |\n|(age )Tehran, Iran\n|Deputy for Special affairs in the Office of the Supreme Leader.\n|Independent\n|\n|-\n|data-sort-value=\"Hemmati, Abdolnasser\"|Abdonnaser Hemmati\n|style=\"background:;\" |\n|(age )Kabudarahang, Iran\n|Governor of the Central Bank of Iran(2018–2021)Ambassador to China(2018)Governor of the Central Insurance of Iran(2016–2018, 1994–2006)Presidential candidate (2021)\n|Executives of Construction Party\n|\n|-\n|data-sort-value=\"Jahangiri, Eshaq\"|Eshaq Jahangiri\n|style=\"background:;\" |\n|(age )Sirjan County, Iran\n|First Vice President of Iran(2013–2021)Minister of Industries and Mines(2001–2005)Minister of Mines and Metals(1997–2001)Governor of Isfahan province(1992–1997)Disqualified presidential candidate (2021)\n|Executives of Construction Party\n|\n|-\n|data-sort-value=\"Jalili, Saeed\"|Saeed Jalili\n|style=\"background:;\" |\n|(age )Mashhad, Iran\n|Member of the Expediency Discernment Council(since 2013)Secretary of the Supreme National Security Council(2007–2013)Chief Nuclear Negotiator(2007–2013)Presidential candidate (2013, 2021)\n|Independent\n|\n|-\n|data-sort-value=\"Kavakebian, Mostafa\"|Mostafa Kavakebian\n|style=\"background:;\" |\n|(age )Semnan, Iran\n|Member of the Islamic Consultative Assembly(2008–2012; 2016–2020)Disqualified presidential candidate (2005, 2013, 2017)\n|Democracy Party\n|\n|-\n|data-sort-value=\"Khalilian, Sadeq\"|Sadeq Khalilian\n|style=\"background:;\" |\n|(age )Ahvaz, Iran\n|Governor General of Khuzestan(2021–2022)Minister of Agriculture(2009–2013)\n|Independent\n|\n|-\n|data-sort-value=\"Larijani, Ali\"|Ali Larijani\n|style=\"background:;\" |\n|(age )Najaf, Iraq\n|Member of the Expediency Discernment Council(1997–2008; since 2020)Speaker of the Islamic Consultative Assembly(2008–2020)Member of the Islamic Consultative Assembly (2008–2020)Presidential candidate (2005)Disqualified presidential candidate (2021)\n|Independent\n|\n|-\n|data-sort-value=\"Mirtajodini, Mohammad Reza\"|Mohammad Reza Mirtajodini\n|style=\"background:;\" |\n|(age )Tabriz, Iran\n|Member of the Islamic Consultative Assembly(2004–2009, 2020–2024)Vice President of Iran(2009–2013)\n|Independent\n|\n|-\n|data-sort-value=\"Pezeshkian, Masoud\"|Masoud Pezeshkian\n|style=\"background:;\" |\n|(age )Mahabad, Iran\n|Member of the Islamic Consultative Assembly(2008–2024)Ministry of Health and Medical Education(2001–2005)\n|Independent\n|\n|-\n|data-sort-value=\"Pour Ebrahimi, Mohammad Reza\"|Mohammad RezaPour Ebrahimi\n|style=\"background:;\" |\n|(age )Rafsanjan, Iran\n|Member of the Islamic Consultative Assembly(2012–2024)\n|Islamic Coalition Party\n|\n|-\n|data-sort-value=\"Sabbaghian, Mohammad Reza\"|MohammadrezaSabaghian\n|style=\"background:;\" |\n|(age )Bafq, Iran\n|Member of the Islamic Consultative Assembly(since 2016)\n|Independent\n|\n|-\n|data-sort-value=\"Sadeghi, Mahmoud\"|Mahmoud Sadeghi\n|style=\"background:;\" |\n|(age )Aligudarz, Iran\n|Member of the Islamic Consultative Assembly(2016–2020)Presidential candidate (2021)\n|Islamic Association of University Instructors\n|\n|-\n|data-sort-value=\"Shariatmadari, Mohammad\"|Mohammad Shariatmadari\n|style=\"background:;\" |\n|(age )Tehran, Iran\n|Minister of Cooperatives, Labour and Social Welfare(2018–2021)Vice President of Iran for Executive Affairs(2013–2017)Minister of Commerce(1997–2005)Presidential candidate (2013)\n|Independent\n|\n|-\n|data-sort-value=\"Zakani, Alireza\"|Alireza Zakani\n|style=\"background:;\" |\n|(age )Ray, Iran\n|Mayor of Tehran(since 2021)Member of the Islamic Consultative Assembly(2004–2016; 2020–2021)Presidential candidate (2013, 2017, 2021)\n|Society of Pathseekers\n|\n|-\n|Hamideh Zarabadi\n|style=\"background:;\" |\n|(age 43–44)Qazvin, Iran\n|Member of the Islamic Consultative Assembly(2016–2021)\n|Independent\n|\n|-\n|data-sort-value=\"Zaribafan, Masoud\"|Masoud Zaribafan\n|style=\"background:;\" |\n|(age )Tehran, Iran\n|Vice President of Iran(2009–2013)Cabinet Secretary of Iran(2005–2006)Member of the Islamic City Council of Tehran(2003–2007)\n|Society of Devotees of the Islamic Revolution\n|\n|-\n|}\nSowlat Mortazavi\n|style=\"background:;\" |\n|(age )Chaharmahal and Bakhtiari, Iran\n|Minister of Cooperatives, Labour and Social Welfare(since 2022)Vice President of Iran for Executive Affairs(2021–2022)Mayor of Mashhad(2013–2017)Governor General of South Khorasan(2005–2009)\n|Society of Devotees of the Islamic Revolution\n|\n|-\n|data-sort-value=\"Akhoundi, Abbas\"|Abbas Akhoundi\n|style=\"background:;\" |\n|(age )Najaf, Iraq\n|Minister of Roads and Urban Development(2013–2018)Minister of Housing(1993–1997)\n|Independent\n|}\n-->\nRejected\nA total of 74 aspirants had their candidacies rejected by the Guardian Council. These included all four women who applied to run in the election. The applications of at least 30 candidacies were rejected on 30 May for failure to meet the \"basic conditions for qualification\". Former President Mahmoud Ahmadinejad was the most notable to be disqualified by the Guardian Council, having been disqualified previously in 2021.\nApproved\nSix candidates were allowed by the Guardian Council to run for president, namely Mohammad Bagher Ghalibaf, Saeed Jalili, Masoud Pezeshkian, Mostafa Pourmohammadi, Amirhossein Ghazizadeh Hashemi and Alireza Zakani. On 26 June, Hashemi withdrew his candidacy and called on other candidates to follow \"so that the front of the revolution will be strengthened\". He was followed on 27 June by Zakani, who did so citing the need to \"block the formation of a third administration\" of former President Hassan Rouhani. Both candidates, as well as Ghalibaf, subsequently endorsed Jalili in the second round.\n{|class=\"wikitable sortable\" style=\"text-align:center;\"\n! colspan=\"2\" scope=\"col\" |Name\n!Born\n!class=\"unsortable\" |Experience\n!Party\n!Result\n!class=unsortable|Ref\n|-\n| data-sort-value=\"Pezeshkian, Masoud\" |Masoud Pezeshkian\n| style=\"background:#48D1CC;\" |\n|(age )Mahabad, Iran\n|Member of the Islamic Consultative Assembly(since 2008)Minister of Health and Medical Education(2001–2005)\n|Independent\n|\n|\n|-\n| data-sort-value=\"Jalili, Saeed\" |Saeed Jalili\n| style=\"background:#E73232;\" |\n|(age )Mashhad, Iran\n|Member of the Expediency Discernment Council(since 2013)Secretary of the Supreme National Security Council(2007–2013)Chief Nuclear Negotiator(2007–2013)Presidential candidate (2013, 2021)\n|Independent\n|\n|\n|-\n| data-sort-value=\"Ghalibaf, Mohammad Bagher\" |Mohammad Bagher Ghalibaf\n| style=\"background:#ffbf00;\" |\n|(age )Torqabeh, Iran\n|Speaker of the Islamic Consultative Assembly(since 2020)Member of Expediency Discernment Council(2017–2020)Mayor of Tehran(2005–2017)Presidential candidate (2005, 2013 and 2017)\n|Progress and JusticePopulation of Islamic Iran\n|\n|\n|-\n| data-sort-value=\"Pourmohammadi, Mostafa\" |Mostafa Pourmohammadi\n| style=\"background:#9370db;\" |\n|(age )Qom, Iran\n|Minister of Justice(2013–2017)Minister of Interior(2005–2008)\n|Combatant Clergy Association\n|\n|\n|-\n| data-sort-value=\"Ghazizadeh, Amir-Hossein Hashemi\" |Amir-Hossein Ghazizadeh Hashemi\n|style=\"background:#00008B;\" |\n|(age )Fariman, Iran\n|Vice President of Iran(since 2021)Member of the Islamic Consultative Assembly(2008–2021)Presidential candidate (2021)\n|Islamic Law Party\n|#FF0033}}\n|\n|-\n|data-sort-value=\"Zakani, Alireza\"|Alireza Zakani\n|style=\"background:#FE6100;\" |\n|(age )Ray, Iran\n|Mayor of Tehran(since 2021)Member of the Islamic Consultative Assembly(2004–2016; 2020–2021)Presidential candidate (2021)\n|Society of Pathseekers\n|#FF0033}}\n|\n|-\n|}\nCampaign platforms\nIn a speech on 3 June, Supreme Leader Ayatollah Ali Khamenei told candidates not to attack each other and expressed his preference for a \"revolutionary president\".\nThe authorities gave 20GB of free internet data for use on domestic messengers and Telewebion for 30 days to mobile phones to promote information regarding the election. US-funded Radio Farda anticipated the total cost of the election to be more than US$357 million.\nSaeed Jalili\nSaeed Jalili of the Front of Islamic Revolution Stability ran for president for the fourth time. He is the Supreme Leader's personal representative to the Supreme National Security Council and was formerly its Secretary, during which he was involved in the Iran nuclear negotiations. Jalili was involved in governmental activities for the decade leading into the election. He was backed by the Islamic Society of Students. Jalili opposed negotiations with the West and the ratification of the Financial Action Task Force (FATF). In addition, Jalili supported the completion of an additional one million housing units. Jalili opposed importing cars from overseas while Ghalibaf supported the import of cars. Jalili promised three days of free vacation to government tourist residences for every citizen per year.\nMasoud Pezeshkian\nOf the six candidates confirmed by the Guardian Council, Masoud Pezeshkian was regarded to be the only one representing moderates and reformists. He was backed by Nedaye Iranian, the National Trust Party, Moderation and Development Party, Coalition of Reformist Women's Parties, as well as former President Mohammad Khatami, former foreign minister Mohammad Javad Zarif and the Assembly of the Forces of Imam's Line. Pezeshkian's campaign slogan is \"Living without Shamefulness\". He campaigned against the Guidance patrol's 2024 Nour program and criticized Iranian laws on the wearing of the hijab.\nIn his campaign speech, Pezeshkian said that he could not do anything for political prisoners as the power to release them does not belong to the president. He told students not to insult Khamenei and that he had \"assimilated into the Supreme leader\". His campaign staff used the song Baraye written by imprisoned singer Shervin Hajipour. Pezeshkian also supported the banning of Afghan immigrants.\nMohammad Bagher Ghalibaf\nGhalibaf promised to reduce the number of Afghan immigrants and build a wall along Iran's borders with Afghanistan and Pakistan. He expressed his support for strengthening the Axis of Resistance. Ghalibaf promised better pay to health workers in order to stop emigration. He said that he is open to closer relations with the United States and negotiating a new nuclear deal to alleviate Iran of its economic woes.\nMostafa Pourmohammadi\nMostafa Pourmohammadi pledged an end to internet censorship and supports nuclear negotiations but from a position of power. He criticized Iranian military support for the Russian invasion of Ukraine due to what he called a lack of reciprocal benefits from Russia.\nAlireza Zakani\nAlireza Zakani pledged to give away 120 tons of free meat every day. He promised free health care for women and seniors and cash payments to the poor.\nDebates\nFirst round\nIRIB exclusively held and broadcast the presidential debates. The questions to be asked in the debates were shared with all candidates beforehand. The IRIB and the Election Office warned candidates against ruining the country's public image. Documentaries will be also produced by IRIB for nominees. The government also banned displaying images of candidates with Ali Khamenei and his predecessor as Supreme Leader, Ruhollah Khomeini.\nThe candidates were asked during the first debate on issues such as inflation, the government's budget deficit, housing and corruption. All candidates pledged to have sanctions against Iran lifted, strengthen the rial and introduce reforms. In the debate, Ghalibaf made several false claims on the economy, regarding energy waste in the country, national GDP and productivity rate. Journalist Vahid Ashtari alleged that Ghalibaf falsely claimed about never having sued any journalist. Ashtari was arrested on 20 June after posting luggage records of Ghalibaf's daughter, who travelled to Turkey. Zakani falsely said that there were no hijab police deployed in the Tehran Metro and that he had not opposed imported COVID-19 vaccines. Pourmohammedi claimed that IRIB TV2's news program 20:30 censored and manipulated a video he sent them.\nDuring the 20 June debates, while discussing culture Pezeshkian's advisor Mohammed Fazeli threw his microphone and left the debate after getting into an argument with one of the hosts. Economic issues were again discussed during the debate, as well as fuel subsidies and education. In the third debate Hashemi promised to make an area in beaches for women to ride jet skis and do water sports, while Pourmohammedi promised to decriminalize not wearing a hijab and stop violent responses by police and Basij. Jalili criticized media attention to Mahsa Amini's death rather than the deaths of thousands of women in Gaza. Ghalibaf claimed Iran's National Information Network has progressed 75%, which  said was \"unverifiable\".\nIn the fourth debate Pourmohammadi called Jalili a traitor for sabotaging the FATF ratification and Ahmadinejad's Crescent petroleum deal, which Jalili denied and said the Crescent agreement was flawed. Hashemi criticized Hassan Rouhani and the reformists for warmongering in Afghanistan and praised Ebrahim Raisi for making peace and not letting Israel advance. Pourmohammadi called the 1988 executions of Iranian political prisoners a \"project of difficult times of the government\" and that \"only People's Mojahedin Organization of Iran members who were fighting against the people were executed.\"\nIn the fifth debate Hashemi promised to eliminate twelve months conscription for males. Hashemi denied that Internet censorship in Iran exists, while Pezeshkian defended the 2019 Internet blackout in Iran. Pourmohammadi pledged to bring transparency to the Tehran Stock Exchange. Ghalibaf blamed Debsh government corruption on inequity. During a debate on women, a representative of Jalili blamed women for being assaulted for not wearing a hijab. Jalili himself told an interviewer that they did not understand the \"strategic depth\" of the hijab laws. IRIB censored Pezeshkian's talk where he supported Mahsa Amini.\n{| class=\"wikitable\"\n|+Debate list\n!No\n!Date and time\n!Viewership\n|-\n|1\n|17 June\n|26–27%\n|-\n|2\n|20 June\n|\n|-\n|3\n|21 June\n|\n|-\n|4\n|24 June\n|\n|-\n|5\n|25 June\n|\n|}\nSecond round\nDuring a two-hour televised debate on IRIB on 1 July, Pezeshkian criticized Jalili over his lack of managerial experience, his stance on nuclear negotiations and his pledge to achieve an economic growth rate of 8% while in office, adding that authorities should be allowed to \"execute\" Jalili if his target was not met. Jalili accused Pezeshkian of having no plans to manage the country and instead lead it to a \"backward position\". Both candidates pledged to address issues involving the poor, workers, women, ethnic groups and religious minorities, as well as improve internet services. They also called for an investigation into the low turnout in the first round. Pezeshkian called a situation in Iran a deadlock and said that no government will grow in a cage. He again criticized Jalili for his shadow state.\nDuring the final debate on 2 July, Pezeshkian pledged to revive a nuclear agreement with foreign powers, while Jalili called on the US to honor its commitments on par \"with the commitments we fulfilled.\" Both candidates pledged to improve the economy, provide energy subsidies to the poor and facilitate the importation of cars while supporting domestic automobile makers. Jalili made several misleading claims over the economy that sought to criticize the Rouhani administration and praise that of Raisi's.\nCriticism\nThe Guardian Council denied allegations that they had rigged the election. Abdolhamid Ismaeelzahi, the Sunni Friday Imam of Sistan and Baluchistan, criticized the system for not allowing women and religious minority candidates and closing down Sunni mosques and questioned the presidency's powers. Four Sunni clerics were arrested in Urmia for criticizing the election. Overseas monarchist opposition figures and groups such as Reza Pahlavi, the former crown prince of Iran, and the re-formed Iran-Novin Party called the election a circus. United Against Nuclear Iran, an anti-Iran lobby group in the US, claimed that IRGC Baqiatallah HQ was engineering the election. The National Front boycotted the election.\nAlthough doing so is criminalized, the Iranian Complainant Mothers, Faezeh Hashemi Rafsanjani (the daughter of former president Akbar Rafsanjani), Nobel Peace Prize laureate Narges Mohammadi, imprisoned activist Abolfazl Ghadyani, house-arrested former prime minister Mir-Hossein Mousavi and his wife Zahra Rahnavard and the  have called for the boycotting of the election. Various reformist political prisoners like Mostafa Tajzadeh refused to support participating. The hashtag #ElectionCircus became prominent topics among Iranians on social media, as well as the hashtag \"traitorous minority\", referring to calls against voting for either Pezeshkian or Jalili in the second round and calling anyone who does so a \"traitor\".\nIn the first round, a majority of voters abstained from voting, resulting in a turnout of 39.93%, the lowest in the history of the Islamic Republic. Turnout increased to 49.68% of votes in the runoff, possibly to prevent the election of Jalili.\nMasoud Pezeshkian's victory sparked controversy over Saeed Jalili's self-styled shadow government. Critics challenged its legitimacy, funding, and transparency, arguing it disrupts governance and lacks a clear legal basis in Iran.\nOpinion polling and forecasts\n{|class=\"wikitable\" style=\"text-align:center;font-size:85%;line-height:13px\"\n|-style=\"height:30px;background-color:#8B8B8B\"\n!rowspan=2|Date\n!rowspan=2|Pollster\n!rowspan=2|Sample size\n!rowspan=2|Margin of error\n!Jalili\n!Ghalibaf\n!Pezeshkian\n!Hashemi\n!Zakani\n!Pourmohammadi\n!rowspan=2|Haven't decided\n!rowspan=2|Lead\n|-\n| bgcolor=\"#A10000\" |\n| bgcolor=\"#ffbf00\" |\n| bgcolor=\"#00989D\" |\n| bgcolor=\"#123456\" |\n| bgcolor=\"#FE6100\" |\n| bgcolor=\"#9370db\" |\n|-\n|4 July\n|Islamic Consultative Assembly\n|\n|\n|44.2%\n|\n|style=\"background:#00989D;color:#FFFFFF;\" |53.7%\n|\n|\n|\n|\n|style=\"background:#00989D;color:#FFFFFF;\" |9.5%\n|-\n|3 July\n|Iranian Students News Agency\n|\n|±2%\n|43.9%\n|\n|style=\"background:#00989D;color:#FFFFFF;\" |49.5%\n|\n|\n|\n|\n|style=\"background:#00989D;color:#FFFFFF;\" |5.6%\n|-\n|26 June\n|Tehran University\n|\n|3.5%\n|26.8%\n|23.3%\n|style=\"background:#00989D;color:#FFFFFF;\" |32.9%\n|3.6%\n|1.7%\n|1.6%\n|7.7%\n|style=\"background:#00989D;color:#FFFFFF;\" |6.1%\n|-\n|26 June\n|Iranian Students Polling Agency\n|3589\n|\n|28.8%\n|19.1%\n|style=\"background:#00989D;color:#FFFFFF;\" |33.1%\n|2.8%\n|2.1%\n|1.4%\n|10.5%\n|style=\"background:#00989D;color:#FFFFFF;\" |4.3%\n|-\n|22–24 June\n|Mellat Opinion Poll Institute (Islamic Consultative Assembly)\n|1100\n|\n|16.3%\n|16.9%\n|style=\"background:#00989D;color:#FFFFFF;\"  |23.5%\n|3.2%\n|1.2%\n|0.5%\n| style=\"background:lightgrey\" |38.4%\n|style=\"background:#00989D;color:#FFFFFF;\" |6.6%\n|-\n|22–23 June\n|Shenaakht\n|1000\n|\n|20%\n|19%\n|style=\"background:#00989D;color:#FFFFFF;\"  |28%\n|3%\n|1%\n|1%\n| style=\"background:lightgrey\" |28%\n|style=\"background:#00989D;color:#FFFFFF;\" |8%\n|-\n|22–23 June\n|Imam Sadeq University\n|1500\n|\n|21.5%\n|23.4%\n|style=\"background:#00989D;color:#FFFFFF;\" |24.4%\n|4.5%\n|2.4%\n|2%\n|21.8%\n|style=\"background:#00989D;color:#FFFFFF;\" |1%\n|-\n|22–23 June\n|Iranian Students Polling Agency\n|4057\n|\n|24%\n|14.7%\n|style=\"background:#00989D;color:#FFFFFF;\"  |24.4%\n|2%\n|1.7%\n|0.7%\n| style=\"background:lightgrey\" | 30.6%\n|style=\"background:#00989D;color:#FFFFFF;\" | 0.4%\n|-\n|18–20 June\n|Mellat Opinion Poll Institute (Islamic Consultative Assembly)\n|850\n|\n|18.2%\n| style=\"background:#ffbf00\" | 20.7%\n|18.9%\n| 4.6%\n| 2%\n| 1.8%\n| style=\"background:lightgrey\" |33.8%\n| style=\"background:#ffbf00\" | 1.8%\n|-\n|18–19 June\n|Iranian Students Polling Agency\n|4545\n|\n|style=\"background:#A10000;color:#FFFFFF;\"   | 26.2%\n|19%\n|19.8%\n|2.6%\n|2%\n|0.9%\n| style=\"background:lightgrey\" | 27.4%\n|style=\"background:#A10000;color:#FFFFFF;\" | 6.4%\n|-\n|18–19 June\n|Imam Sadeq University\n|\n|\n|23.5%\n|29.3%\n|style=\"background:#00989D;color:#FFFFFF;\" |30%\n|2.7%\n|1.2%\n|1.1%\n|12.4%\n|style=\"background:#00989D;color:#FFFFFF;\"| 0.7%\n|-\n|\n|Research Center for Culture, Art and Communication\n|\n|\n|style=\"background:#A10000;color:#FFFFFF;\"|36.7%\n| 30.4%\n| 28.3%\n|1.4%\n|1.7%\n|1.4%\n| style=\"background:lightgrey\" | 62%\n|style=\"background:#A10000;color:#FFFFFF;\"| 6.3%\n|-\n| 30 May\n| colspan=\"12\" |Beginning of registration\n|}\nThe Iranian Students Polling Agency predicted a turnout of 44.4%. According to a poll conducted between 26 and 29 May 2024 by the Majlis Research Center, the voter turnout is predicted to be over 53%. At the other end of the spectrum, polling conducted by the Ministry of Culture and Islamic Guidance predicted just 30% participation in Tehran. The Law Enforcement Command of the Islamic Republic of Iran warned people against sharing posts with fake polls, declaring it a crime.\nOn 25 June, Supreme Leader Ayatollah Ali Khamenei called for \"high participation\" in the election, calling it \"the pride of the Islamic republic\". He also warned against supporting candidates who believe that \"all ways to progress\" come from the United States. Abbas Abdi, one of Iran's most influential reformist figures, predicted a maximum turnout of 60%, and a minimum of 55%. The IRGC's Telegram channel conducted a poll in which Pezeshkian won 60% of the votes.\nConduct\nVoting was held in nearly 60,000 voting stations and 90,000 \"voting points\" nationwide, while more than 300 voting stations were set up overseas. Polling in the first round was initially expected to run from 08:00 to 18:00, but was extended at the last minute by the Interior Ministry to 20:00. Polling was also extended until midnight on the second round of voting.\nIncidents\nA video was posted during the campaign of a pro-Pezeshkian lawyer in Tabriz being beaten up in a desert by security forces. The Ministry of Justice opened an investigation. Two members of the security forces were killed in a gun attack on a vehicle carrying election boxes in Sistan and Baluchistan.\nIran's Internet Minister claimed that the country's fiber optic network was sabotaged on 28 June. The interior ministry said it had arrested members of \"Project 1000 Squares\" which had planned to celebrate the election win of an undisclosed candidate.\nOn 19 July, the governor of Basht was arrested on charges of electoral misconduct.\nResults\nOfficial results showed Pezeshkian and Jalili heading into a run-off scheduled on 5 July. Turnout in the first round was at 40 percent, the lowest for a presidential election in Iran since 1979, while a total of 1,056,159 ballots were deemed as spoiled. The election also saw the first presidential run-off vote in Iran since 2005.\nBy province (first round)\n{| class=\"wikitable sortable\" style=text-align:right\n! rowspan=\"2\" |Province\n! colspan=\"2\" |Pezeshkian\n! colspan=\"2\" |Jalili\n! colspan=\"2\" |Ghalibaf\n! colspan=\"2\" |Pourmohammadi\n! colspan=\"2\" |Voter turnout\n|-\n!Votes\n!%\n!Votes\n!%\n!Votes\n!%\n!Votes\n!%\n!Votes\n!%\n|-\n|align=left|Alborz\n|300,040\n|42.7%\n|260,197\n|37.1%\n|107,158\n|15.3%\n|6,868\n|1.0%\n|702,037\n|40.13\n|-\n|align=left|Ardabil\n|382,647\n|75.8%\n|72,878\n|14.4%\n|36,377\n|7.2%\n|2,676\n|0.5%\n|504,602\n|48.5\n|-\n|align=left|Bushehr\n|144,138\n|38.5%\n|167,217\n|44.7%\n|40,850\n|10.9%\n|2,618\n|0.7%\n|374,345\n|46.5\n|-\n|align=left|Chaharmahal and Bakhtiari\n|123,046\n|42.2%\n|118,523\n|40.6%\n|38,241\n|13.1%\n|2,464\n|0.8%\n|291,790\n|40\n|-\n|align=left|East Azerbaijan\n|1,067,087\n|76.1%\n|244,369\n|17.4%\n|57,382\n|4.1%\n|7,033\n|0.5%\n|1,402,108\n|44.11\n|-\n|align=left|Esfahan\n|428,098\n|28.0%\n|868,431\n|56.7%\n|139,979\n|9.1%\n|16,524\n|1.1%\n|1,530,747\n|41\n|-\n|align=left|Fars\n|532,947\n|39.0%\n|634,294\n|46.4%\n|132,848\n|9.7%\n|10,292\n|0.8%\n|1,365,988\n|36\n|-\n|align=left|Gilan\n|317,248\n|48.3%\n|216,339\n|32.9%\n|90,019\n|13.7%\n|6,759\n|1.0%\n|656,941\n|32.6\n|-\n|align=left|Golestan\n|275,366\n|46.7%\n|205,981\n|34.9%\n|81,103\n|13.7%\n|5,023\n|0.9%\n|590,041\n|41.16\n|-\n|align=left|Hamadan\n|199,466\n|34.8%\n|266,872\n|46.6%\n|76,583\n|13.4%\n|5,283\n|0.9%\n|572,842\n|39\n|-\n|align=left|Hormozgan\n|206,013\n|37.7%\n|229,602\n|42.0%\n|84,035\n|15.4%\n|4,051\n|0.7%\n|546,939\n|TBD\n|-\n|align=left|Ilam\n|119,843\n|57.7%\n|44,706\n|21.5%\n|30,852\n|14.8%\n|1,704\n|0.8%\n|207,798\n|47\n|-\n|align=left|Kerman\n|329,470\n|30.8%\n|477,589\n|44.6%\n|215,892\n|20.2%\n|8,513\n|0.8%\n|1,070,286\n|46\n|-\n| align=\"left\" |Kermanshah\n|294,139\n|57.1%\n|113,287\n|22.0%\n|76,393\n|14.8%\n|4,608\n|0.9%\n|515,382\n|TBD\n|-\n| align=\"left\" |Khuzestan\n|433,699\n|35.9%\n|524,084\n|43.4%\n|175,732\n|14.6%\n|12,529\n|1.0%\n|1,207,403\n|29.6\n|-\n| align=\"left\" |Kohgiluyeh and Boyer-Ahmad\n|123,240\n|42.7%\n|102,112\n|35.3%\n|55,348\n|19.2%\n|1,518\n|0.5%\n|288,937\n|49.3\n|-\n| align=\"left\" |Kurdistan\n|192,743\n|63.8%\n|45,110\n|14.9%\n|37,204\n|12.3%\n|2,693\n|0.9%\n|302,192\n|TBD\n|-\n| align=\"left\" |Lorestan\n|234,721\n|42.6%\n|191,510\n|34.7%\n|100,967\n|18.3%\n|4,395\n|0.8%\n|551,573\n|36\n|-\n| align=\"left\" |Markazi\n|136,282\n|29.8%\n|233,645\n|51.1%\n|61,359\n|13.4%\n|4,354\n|1.0%\n|457,074\n|39.9\n|-\n| align=\"left\" |Mazandaran\n|406,485\n|39.0%\n|448,308\n|43.0%\n|132,151\n|12.7%\n|9,629\n|0.9%\n|1,043,570\n|42.3\n|-\n| align=\"left\" |North Khorasan\n|115,697\n|36.1%\n|115,672\n|36.1%\n|72,433\n|22.6%\n|2,762\n|0.9%\n|320,071\n|45\n|-\n| align=\"left\" |Qazvin\n|156,853\n|39.8%\n|166,852\n|42.3%\n|51,811\n|13.1%\n|3,385\n|0.9%\n|394,400\n|42.8\n|-\n| align=\"left\" |Qom\n|106,148\n|21.8%\n|290,622\n|59.6%\n|67,735\n|13.9%\n|6,221\n|1.3%\n|487,849\n|57\n|-\n| align=\"left\" |Razavi Khorasan\n|655,727\n|27.2%\n|1,214,340\n|50.4%\n|432,361\n|17.9%\n|18,367\n|0.8%\n|2,411,579\n|49.39\n|-\n| align=\"left\" |Semnan\n|73,287\n|28.0%\n|137,081\n|52.3%\n|34,759\n|13.3%\n|2,302\n|0.9%\n|261,892\n|49.2\n|-\n| align=\"left\" |Sistan and Baluchestan\n|443,226\n|58.2%\n|199,976\n|26.3%\n|87,788\n|11.5%\n|4,368\n|0.6%\n|761,058\n|40\n|-\n| align=\"left\" |South Khorasan\n|102,354\n|26.2%\n|225,825\n|57.7%\n|48,776\n|12.5%\n|2,319\n|0.6%\n|391,392\n|64\n|-\n| align=\"left\" |Tehran\n|1,348,685\n|40.2%\n|1,165,518\n|34.7%\n|673,673\n|20.1%\n|35,582\n|1.1%\n|3,357,833\n|33\n|-\n| align=\"left\" |West Azerbaijan\n|806,435\n|77.6%\n|146,436\n|14.1%\n|59,372\n|5.7%\n|4,577\n|0.4%\n|1,039,350\n|40\n|-\n| align=\"left\" |Yazd\n|165,696\n|37.9%\n|213,513\n|48.9%\n|35,680\n|8.2%\n|3,829\n|0.9%\n|436,722\n|58.18\n|-\n| align=\"left\" |Zanjan\n|195,165\n|49.7%\n|132,409\n|33.7%\n|48,479\n|12.4%\n|3,151\n|0.8%\n|392,477\n|46.2\n|- class=sortbottom\n|align=left colspan=11|Source: Tejarat News, Iran Data Portal\n|}\nMaps and graphs\nFirst round\nFile:Iranian presidential election, 2024 by province.svg|Winner by province\nFile:Iranian presidential election, 2024 by province - First Round Percentage.svg|Result of the Iranian presidential election by province (in percentage)\nFile:Cartogram of Iran - First Round.svg|First round results by province. The area of each province is proportional to the number of its voters.\nSecond round\nFile:Iranian presidential election, 2024 by province - Second Round.svg|Winner by province\nIranian presidential election, 2024 by province - Second Round Percentage.svg|Result of the Iranian presidential election by province (in percentage)\nFile:Cartogram of Iran - Second Round.svg|Second round results by province. The area of each province is proportional to the number of its voters.\nTurnout\nFile:Iran 2024 election first round turnout.svg|First round turnout by province\nFile:Iran 2024 election second round turnout.svg|Second round turnout by province\nFile:Ghalibaf 2024.svg|Ghalibaf votes by province\nAftermath\nIn his first statements following his victory, Pezeshkian said that \"the difficult path ahead will not be smooth\", while pledging to serve all Iranians. In his concession statement, Jalili called for Pezeshkian to be respected. Pezeshkian is expected to assume the presidency within 30 days of the election, after he resigns from his seat in the Islamic Consultative Assembly and gains the formal approval of Khamenei. In his speech in the Mausoleum of Ruhollah Khomeini, Pezeshkian thanked Khamenei for his support. Khamenei praised the turnout despite what he called a campaign \"by the enemies of the Iranian nation to induce despair and a feeling of hopelessness\" and called on Pezeshkian to \"set his vision on high, bright horizons.\"\nSenior Khamenei advisor Kamal Kharazi stated that the election would not affect Iranian foreign policy as it is controlled by the .\nIn his first post victory op-ed Pezeshkian called the 25 year cooperation between China and Iran a milestone and commended Iran-Russia détente.\nOn 28 July, Pezeshkian received Khamenei's official endorsement to hold office as president. Pezeshkian also appointed as his first vice president Mohammad Reza Aref, a reformist politician who had previously served in the same position under Mohammad Khatami.\nReactions\nDomestic\nKhamenei downplayed the low turnout in the first round, saying that it did not indicate opposition to the political system, but ordered an investigation into its causes. Former minister Ata'ollah Mohajerani criticized the administration of President Mokhber for failing to fulfill its mandate and campaigning instead for Jalili. Mokhber has denied this. The newspaper Kayhan published an editorial saying that the government will not give in to blackmail by election boycotters. The reformist newspapers Sazandegi and Hammihan urged voters to participate in the election through their editorials.\nFormer MP Mahmoud Sadeghi said that the Islamic Development Organization paid clerics to campaign for Jalili. Commanding general of the IRGC, Hossein Salami called the election \"today's jihad\". The Alliance for Democracy and Freedom in Iran's Hamed Esmaeilion, Reza Pahlavi and Masih Alinejad hailed the historically low turnout as a \"victory against the regime\".\nInternational\n* : Ministry of Foreign Affairs of the Islamic Emirate of Afghanistan (which is not nominally recognized by Iran) congratulated Pezeshkian.\n* : President Abdelmadjid Tebboune congratulated Pezeshkian.\n* : Prime Minister Nikol Pashinian congratulated \"the brotherly Islamic Republic of Iran\" on electing a new president and expressed hope that Pezeshkian will continue to implement existing Armenian-Iranian agreements.\n* : President Ilham Aliyev congratulated Pezeshkian and invited him to visit the country.\n* : King Hamad bin Isa Al Khalifa congratulated Pezeshkian.\n* : President Alexander Lukashenko described Pezeshkian's victory as \"an unconditional victory of the Iranian people\".\n* : President Xi Jinping congratulated Pezeshkian on the election.\n* : President Miguel Díaz-Canel congratulated Pezeshkian.\n* : President Abdel Fattah el-Sisi congratulated Pezeshkian.\n* : Prime Minister Irakli Kobakhidze sent a message to Pezeshkian, congratulating him on his election, expressing hopes that his efforts as president will \"ensure a bright, stable and secure future\" for Iran.\n* : Interim president Mamady Doumbouya congratulated Pezeshkian on his election.\n* : Secretary-General Hassan Nasrallah congratulated Pezeshkian on his election, adding that his group would continue \"relying on Iran as a stronger supporter\".\n* : President Tamás Sulyok congratulated Pezeshkian on his election, adding \"the centuries-longstanding commercial and cultural cooperation\" is of \"great importance\".\n* : Prime Minister Narendra Modi congratulated Pezeshkian, saying he \"looks forward to working closely\" with him on strengthening their relationship.\n* : President Abdul Latif Rashid congratulated Pezeshkian and the country in a Twitter post.\n** : President Nechirvan Barzani congratulated Pezeshkian on his victory, saying that he looks forward to advancing ties between the autonomous region and Iran.\n* : President Michael D. Higgins congratulated Pezeshkian.\n* : King Abdullah II congratulated Pezeshkian.\n* : President Kassym-Jomart Tokayev congratulated Pezeshkian.\n* : Emir Mishal Al-Ahmad Al-Jaber Al-Sabah congratulated Pezeshkian, saying he wished \"more prosperity and development for the Islamic Republic\".\n* : Prime Minister Abdul Hamid Dbeibah congratulated Pezeshkian on Twitter and wished him all the success in serving his country, and looking forward to strengthening bilateral relations between Iran and Libya, and working together to promote peace, stability and prosperity in the region.\n* : Prime Minister Anwar Ibrahim congratulated Pezeshkian on Facebook, saying that the election \"reflects the vibrant spirit of Iranian democracy and heralds a promising future for Iran\".\n*: President Mohamed Muizzu congratulated Pezeshkian at his victory on Twitter and said he looked forward to working with him.\n* : Kim Jong Un congratulated Pezeshkian and wishing him \"success in your responsible work for building a powerful and prosperous Islamic state\".\n* : Sultan Haitham bin Tariq congratulated Pezeshkian.\n* : Prime Minister Shehbaz Sharif expressed his intent to work with Pezeshkian and ensuring \"a bright future for our two peoples through mutually beneficial cooperation\".\n* : Emir Tamim bin Hamad Al Thani congratulated Pezeshkian and expressed his desire for \"further development and prosperity of joint relations\".\n* : President Vladimir Putin congratulated Pezeshkian and expressed hope that his tenure will reinforce bilateral ties.\n* : King Salman and Crown Prince Mohammed bin Salman both congratulated Pezeshkian, with the King hoping that his election leads to \"deepening\" ties.\n* : President Aleksandar Vučić congratulated Pezeshkian, saying his election reflected the Iranian's people's trust in his \"vision for the future\" and \"dedication to peace.\"\n* : The Foreign Ministry congratulated Pezeshkian and said it looked forward to \"further enhancing our friendly relations with Iran\".\n*  Ba'athist Syria: President Bashar al-Assad said he intended to work with the new administration \"to boost the Syrian-Iranian strategic relationship and open new promising horizons for bilateral cooperation\".\n* : President Emomali Rahmon congratulated Pezeshkian.\n* : President Recep Tayyip Erdoğan congratulated Pezeshkian and expressed his confidence that their relations will \"continue to develop in every realm\".\n* : President Serdar Berdimuhamedow congratulated Pezeshkian.\n* : President Sheikh Mohamed bin Zayed Al Nahyan said he wished Pezeshkian \"success in his role\" and was looking forward \"to working together to further strengthen ties\" with Iran.\n* : The State Department described the election as \"not free or fair\" and noted the significant rate of voter abstention, adding that it did not expect the results to produce a change in Iran's policy and human rights situation. White House National Security Communications Advisor John Kirby said that the election of a reformist president did not mean that the US would be willing to restart nuclear talks with Iran, citing their continued support for extremist groups such as Hamas, Hezbollah and the Houthis, as well as to Russia in its war against Ukraine. He also said that the US did not expect any change in Iran's behavior.\n* : President Shavkat Mirziyoyev congratulated Pezeshkian.\n* : Foreign minister Yván Gil praised voters for their \"commitment demonstrated to democracy\", adding that Pezeshkian would have the \"absolute support\" of President Nicolas Maduro.\n*  (Houthi): Chairman of the Supreme Political Council Mahdi al-Mashat congratulated Pezeshkian.\nSee also\n* 2024 Iranian Assembly of Experts election\n* 2024 Iranian legislative election\nNotes\nReferences\nExternal links\n*\n*[https://web.archive.org/web/20240705060842/https://www.pdoo.ir/ Dr Masoud Pezeshkian]\n*[https://jebhepaydari.ir/ Jebhe Paydari (Jalili's party)], [https://nitter.poast.org/DrSaeedJalili Jalily's X account]\n*[https://111.ir/ Office of the president]"
    }
  ]
}