{
  "content": [
    {
      "type": "text",
      "text": "# 2025 Queens Finalissima\n\n| team1score                = 5\n| team2                     = Peluche Caligari\n| team2association          =\n| team2score                = 4\n| man_of_the_match1a        = Maria Pi\n| man_of_the_match1atitle   =\n| man_of_the_match1aname    = MVP\n| details                   =\n| date                      =\n| stadium                   = Cupra Arena at Parc des Expositions de Villepinte\n| city                      = Paris, France\n| referee                   = Manuela Nicolosi (Italy)\n| attendance                =\n| weather                   =\n| previous                  =\n| next                      = 2026\n}}\nThe 2025 Queens Finalissima was a women's seven-a-side football match based on the Queens League format, which pitted the top team of the Spanish Queens League against the top team of the Américas Queens League. It is considered the first international club competition of the Queens League franchise (while the teams from the Américas Queens League ostensibly represent the countries of their founding chairpersons, the league is entirely contested in Mexico and most of its players are Mexican). The Finalissima was contested on 13 June 2025 in Paris, concurrently with the 2025 Kings World Cup Clubs.\nOn April 26, 2025, before the conclusion of the second split of each competition counted towards qualification, Las Troncas FC and Peluche Caligari both mathematically secured their spots as Spain's and the Americas' representatives, respectively.\nTeams\nEach league's representative was chosen from the champions of the two most recent splits, with the champion club that ranks highest on an aggregate table of both splits' league phases being the selected team.\n{| class=\"wikitable\"\n|-\n!Team\n!Qualification\n|-\n| Las Troncas FC\n|Top-ranked 2024/25 Queens League Spain champion on aggregate\n|-\n| Peluche Caligari\n|Top-ranked 2024/25 Queens League Américas champion on aggregate\n|}\nSquads\nLas Troncas FC\nManager:  Carlos Sánchez\n; Peluche Caligari\nManager:  Ileana Dávila\n}}\nMatch\n|score=5–4\n|report=https://queensleague.pro/es/finalissima\n|team2= Peluche Caligari\n|goals1=Pi Velasco Pichardo Cros\n|goals2=Mellado Cárdenas Martínez\n|stadium=Cupra Arena at Parc des Expositions de Villepinte, Paris\n|attendance=\n|referee=Manuela Nicolosi (Italy)\n}}\n{| width=\"100%\" cellspacing=\"0\"\n| align=\"center\" |\n|-\n| align=\"center\" |ChampionLas Troncas FC1st title\n|}\nReferences"
    }
  ]
}