{
  "content": [
    {
      "type": "text",
      "text": "# 2025 in the Democratic Republic of the Congo\n\nEvents of the year 2025 in the Democratic Republic of the Congo.\nIncumbents\n* President: Félix Tshisekedi\n* Prime Minister: Judith Suminwa\nEvents\nOngoing\n* M23 offensive (2022–present)\n**2025 Goma offensive\n* Democratic Republic of the Congo–Rwanda tensions (2022–present)\n*2025 Kinshasa riots\n*Allied Democratic Forces insurgency\n*Ituri conflict\nJanuary\n* 5 January – M23 rebels seize the town of Masisi, North Kivu.\n* 9 January – The government bans Al Jazeera from operating in the country after the network airs an interview with M23 leader Bertrand Bisimwa the previous day.\n* 15 January – At least ten people are killed in an attack by the Allied Democratic Forces on the village of Makoko in Lubero Territory, North Kivu.\n* 21 January – M23 rebels seize the towns of Minova, Lumbishi, Numbi and Shanje in South Kivu, as well as Bweremana in North Kivu.\n* 23 January – Major General Peter Cirimwami, the military governor of North Kivu, is killed in action during clashes with M23.\n* 25 January – The DRC cuts diplomatic relations with Rwanda and orders its diplomatic personnel to leave the country amid accusations by Kinshasa of Rwandan support for the M23 offensive.\n* 27 January – 2025 Goma offensive: M23 claims that it had taken Goma, the capital of North Kivu.\n* 28 January – 2025 Kinshasa riots: The French embassy in Kinshasa is set on fire by protesters demonstrating against the conflict in the eastern DRC. The Rwandan, French, Belgian and US embassies are also attacked.\n* 29 January – M23 launches an offensive into South Kivu, taking the districts of Kanyezire and Mukwija.\nFebruary\n* 4 February – A humanitarian ceasefire is declared by the antigovernment Congo River Alliance, which includes M23.\n* 5 February – M23 seizes the city of Nyabibwe in South Kivu despite declaring a ceasefire.\n* 10 February – At least 55 people are killed in an attack by CODECO militants in the Djaiba area of Ituri.\n* 12 February – Kasanga massacre: The Allied Democratic Forces kill 70 Christians inside a church in Lubero Territory.\n* 14 February – 2025 Bukavu offensive: M23 claims to have seized Kavumu Airport and are confirmed to have entered Bukavu, the capital of South Kivu.\n* 17 February – The Ugandan military enters Bunia, the capital of Ituri, to augment the Congolese military.\n* 19 February – A boat carrying refugees from the M23 offensive capsizes in Lake Edward, killing 22 passengers.\n* 20 February – The United States imposes sanctions on Rwandan minister for regional integration James Kabarebe and M23 spokesperson Lawrence Kanyuka Kingston for their roles in the M23 offensive.\n* 24 February – At least 53 people are reported to have died in an outbreak of an unidentified disease that began on 21 January in Boloko, with 419 cases recorded. Authorities subsequently identify that outbreak as being caused by malaria.\n* 27 February – Twelve people are killed following explosions at an M23 rally in Bukavu.\nMarch\n* 8 March – Nine people are killed in an attack by ADF militants on the village of Ngohi Vuyinga in Lubero Territory, North Kivu.\n* 9 March – A boat capsizes along the Kwa River in Mushie, killing 25 people.\n* 10 March - The DRC's military prosecutor questions Joseph Kabila’s party officials amid rising tensions over M23 rebels, as President Tshisekedi accuses Kabila of sponsoring them.\n* 13 March – South Africa, Tanzania and Malawi announce the withdrawal of their military contingents from the Southern African Development Community peacekeeping mission to the eastern DRC.\n* 19 March – M23 rebels take the mining town of Walikale in North Kivu.\n* 28 March – M23 announces a ceasefire with the SADC peacekeeping mission to facilitate the latter's withdrawal from the DRC.\nApril\n* 4 April –\n**M23 rebels withdraw from Walikale as part of what it calls a goodwill gesture ahead of peace negotiations with the government mediated by Qatar.\n**At least 33 people are killed following floods caused by heavy rain in Kinshasa.\n*7 April – M23 officials participate in the opening ceremony of the Caisse Générale d'Épargne du Congo (CADECO) in Goma.\n* 9 April – Three American nationals convicted for participating in the 2024 Democratic Republic of the Congo coup attempt are repatriated to the United States after their death sentences are commuted to life imprisonment by President Tshisekedi on 1 April.\n* 11 April – Forty-one captives held by the ADF are rescued in a joint operation by DRC and Ugandan soldiers in North Kivu.\n* 12 April – At least 50 people are reported killed in clashes between the DRC military and M23 in the Goma area.\n* 15 April – A boat catches fire and capsizes along the Congo River near Mbandaka, killing at least 33 people.\n* 19 April – The government suspends the People's Party for Reconstruction and Democracy of former president Joseph Kabila, citing his \"overt\" activism following his visit to M23-occupied Goma.\n* 23 April – Ten people are killed in a collapse at the Luhihi mine in Kabare Territory, South Kivu.\nMay\n* 9 May – At least 62 people are killed following floods caused by heavy rain along Lake Tanganyika in South Kivu.\n* 20 May – The Constitutional Court sentences former prime minister Matata Ponyo Mapon to 10 years of forced labor for the embezzlement of more than $245 million intended for the Bukangalonzo agro-industrial park project.\n* 22 May – The Senate votes in favour of lifting the parliamentary immunity of Joseph Kabila over his involvement with the M23 Movement.\nJune\n* 3 June – The DRC is elected to a rotating seat at the United Nations Security Council for the third time.\n* 11 June – A boat sinks along Lake Tumba in Bikoro Territory, Équateur Province, killing 30 passengers.\n* 13 June – At least 45 people are killed following severe flooding in Kinshasa.\n* 15 June – Customs official Floribèrt Bwana Chui Bin Kositi, who was killed in 2007 for blocking the entry of spoiled rice that was to be fed to refugees in Goma, is beatified by the Roman Catholic Church.\n* 18 June – Constant Mutamba resigns as justice minister amid allegations that he had embezzled $19 million in funds meant to build a prison in Kisangani.\n* 19 June – A collapse at an artisanal coltan mine near Rubaya in North Kivu province kills at least 12 people.\n* 23 June – An FARDC soldier opens fire on fellow soldiers during a pay dispute in Mungazi, North Kivu, killing three and injuring eight.\n* 27 June –\n**The DRC and Rwanda sign a peace agreement to end the Kivu conflict following negotiations mediated by the United States.\n**Eleven people are killed in an attack by CODECO militants on a displaced persons camp in Djangi, Ituri.\nJuly\n* 12 July –\n** Uganda reopens its border with the DRC following a six-month closure caused by the 2025 Goma offensive.\n** Sixty-six civilians are killed in an attack by ADF militants in Irumu Territory, Ituri.\n* 17 July – The government signs an investment agreement with KoBold Metals valued at more than $1 billion dollars to develop the country's mining reserves, particularly the Manono-Kitolo mine.\n* 19 July – The government and M23 sign a ceasefire agreement in Qatar.\n* 20 July –\n**At least 12 miners are rescued while several others are reported missing following the collapse of the Lomera golf mine in South Kivu.\n**A Congolese diplomat stationed in Belgium is arrested on suspicion of smuggling cocaine in Bulgaria.\n*25 July – Two Mai-Mai militias clash over the control of agricultural routes in the Babila-Babombi chiefdom in Mambasa Territory, causing several villagers to flee.\n*27 July – At least 43 people are killed in an attack by ADF militants on a church in Komanda, Ituri.\nAugust\n* 1 August – An agreement is signed in Ethiopia for the African Union to take over all peacekeeping operations in the eastern DRC.\n*7 August – The government implements a cabinet reshuffle.\n*12 August – The United States imposes sanctions on the rebel group PARECO for abuses committed at the Rubaya mines in North Kivu. It also sanctions the Congolese mining firm CDMC and the Hong Kong-based exports East Rise and Star Dragon for illegal transactions involving resources extracted from the mines.\n*15 August –\n**Kenya appoints a consul-general for the M-23 held city of Goma, prompting criticism from the government in Kinshasa.\n**At least 30 people are killed following attacks by suspected ADF militants on the village of Bapere in North Kivu.\n*16 August – An Antonov An-2 aircraft operated by Air Kasaï crashes near Kisangani, killing all seven people onboard.\n*17 August – At least nine people are killed following an ADF attack on Oicha in North Kivu.\nSeptember\n* 2 September – The Court of Cassation sentences former justice minister Constant Mutamba to three years' forced labor for embezzling $19 million in public funds meant for the construction of a prison in Kisangani.\n* 4 September – The Ministry of Public Health declares an outbreak of ebola in Kasai Province, with a total of 28 suspected cases, one confirmed case in Boulape, and 15 deaths.\n* 7 September – M23 retakes the town of Shoa in North Kivu, a day after it was taken by the FARDC and Wazalendo militias.\n* 8 September –\n**At least 71 people are killed in an ADF attack on a funeral in the village of Nyoto in Lubero Territory, North Kivu.\n**At least three people are killed after the FARDC opens fire on protesters demonstrating against a local FARDC commander in Uvira, South Kivu.\n* 9 September – At least 18 people are killed in an ADF attack in Beni, North Kivu.\n* 10 September – A boat capsizes in Basankusu Territory, Équateur Province, killing at least 86 people.\n* 11 September – A boat catches fire and capsizes along the Congo River near Malange in Lukolela Territory, Équateur Province, killing 107 people.\n* 22 September – Vital Kamerhe resigns as president of the National Assembly on the eve of a vote to remove him.\n* 30 September – Former President Joseph Kabila is sentenced to death in absentia by a military court in Kinshasa for war crimes, treason, and crimes against humanity.\nOctober\n* 6 October – A court-martial in Beni sentences 23 people to up to 20 years' imprisonment for collaborating with the ADF.\n* 13 October – ADF rebels kill 19 civilians and burn 26 houses in an overnight attack on Mukondo, North Kivu.\n* 14 October – The Congolese government and M23 sign a ceasefire monitoring agreement in Qatar, establishing a body including representatives from Congo, M23, and the International Conference on the Great Lakes Region.\nNovember\n* 13 November – Aimé Boji is unanimously elected as president of the National Assembly.\n* 14 November – At least 17 people are killed in an ADF attack on a hospital in Byambwe in Lubero Territory, North Kivu.\n* 15 November –\n**The Congolese government and M23 sign a framework agreement in Doha, outlining eight protocols for advancing a long-term peace process.\n**A bridge collapse at the Kalando copper mine in Lualaba Province causes kills at least 32 people.\n* 17 November –\n**An aircraft carrying 20 people including Mines Minister Louis Watum Kabamba undergoes a runway excursion during landing at Kolwezi Airport and catches fire. All on board survive.\n**A barge capsizes along the mouth of the Sankuru River in Kasaï Province, leaving 64 passengers missing.\nHolidays\n:\n* 1 January – New Year's Day\n* 4 January – Martyrs' Day\n* 16 January – Laurent-Désiré Kabila Assassination\n* 17 January – Patrice Lumumba Assassination\n* 1 May – Labour Day\n* 17 May – Liberation Day\n* 30 June – Independence Day\n* 1 August – Parents' Day\n* 17 November – Army Day\n* 25 December – Christmas Day\nSee also\n* 2025 Democratic Republic of the Congo attacks\n* List of massacres in the Democratic Republic of the Congo\n* Attacks on humanitarian workers\nReferences\nExternal links\n* [https://www.timeanddate.com/calendar/?year=2025&country=84 Online calendar]"
    }
  ]
}