{
  "content": [
    {
      "type": "text",
      "text": "# 2025 Democratic Party of Korea presidential primary\n\n| candidate1 = Lee Jae Myung\n| candidate2 = Kim Dong-yeon\n| image2 = Kim Dong-yeon 20250324.jpg\n| colour2 =\n| image_size = x150px\n| before_election = Lee Jae Myung\n| after_election = Lee Jae Myung\n| election_name = 2025 Democratic Party presidential primary\n| title = Presidential nominee\n| 1data4 =\n| 1data5 =\n| 2data4 =\n| 2data5 =\n| votes_for_election = 100% of party members voting\n| needed_votes = 50% membership\n| flag_image = Democratic Party of South Korea banner.svg\n| popular_vote1 = 623,695\n| percentage1 = 89.77%\n| image3 = 김경수 경남도지사.jpg\n| colour3 =\n| candidate3 = Kim Kyoung-soo\n| popular_vote2 = 41,307\n| percentage2 = 6.87%\n| popular_vote3 = 25,512\n| percentage3 = 3.36%\n}}\n(left, pictured in November 2024) declared martial law and was removed from office on 4 April 2025.]]\nPresidential primaries were held by the Democratic Party of Korea from 10 – 27 April 2025 to select the party's nominee for the snap 2025 South Korean presidential election, which was held on 3 June. The primary was held after President Yoon Suk Yeol was impeached and removed from office on 4 April, immediately requiring a snap election to determine the country's 14th president. After Yoon's impeachment, three candidates declared their candidacy for the DPK nomination. The primary was held concurrently with the primary of the opposition People Power Party.\nOn 27 April, the party nominated former DPK leader Lee Jae Myung after a landslide victory in the primaries.\nBackground\n2022 election and opposition status\nOn 10 October 2021, Gyeonggi governor Lee Jae Myung won the nomination for president, defeating three other candidates. Lee won a majority with 50.2% of the vote. In the closest South Korean presidential election in the country's history, Lee was defeated with 47.8% to 48.6%, losing by a margin less than 1%. Although defeated, Lee led the DPK to a strong victory in the 2024 parliamentary elections obtaining a total of 173 seats, while the PPP obtained 108 seats.\n2024 martial law crisis and impeachment of Yoon\nYoon declared martial law on 3 December 2024, leading to a political crisis. On 14 December, Yoon was impeached after the National Assembly voted 204–85, with 11 boycotting the vote. On 4 April 2025, Yoon's impeachment was upheld, terminating his presidency, and leaving a vacancy in the office. Acting president Han Duck-soo announced on 8 April that the election would be held on 3 June.\nPrimary schedule and process\nOn 12 April 2025, the Democratic Party of Korea announced that its presidential primary would equally weight between votes by dues-paying members and a public poll conducted by two polling companies that would survey one million people. The final decision would be released on 27 April, following a full party vote on 14 April and an online vote by its central committee on 15 April.\nBy 18 April, there were three candidates; leader Lee, Gyeonggi governor Kim Dong-yeon, and former South Gyeongsang governor Kim Kyoung-soo, who was originally sentenced to prison in July 2021 and disqualified from running for public office until April 2028, but was pardoned in August 2024, disqualifying this rule.\nCandidates\n{| class=\"wikitable\" style=\"font-size:90%; text-align:center;\"\n!\n|-\n! style=\"font-size:135%; background:\" |\n|- style=\"font-size:100%; color:black; background:#c8ebff\"\n|for President\n|-\n|\n|-\n| style=\"width:16em\" |Leader of the Democratic Party\n(2022–2025)\n|}\nDPK leader (2022–2025) and Assemblyman Lee Jae Myung, resigned from DPK leadership on 9 April, announced his presidential bid on 10 April, and won the nomination on 27 April.\n{| class=\"wikitable\"\n|+Candidates for the 2025 Democratic Party presidential primary\n!Name\n!Born\n!Experience\n!Announced\n!References\n|-\n|\nLee Jae Myung\n|December 1963}} (age 61)}}\nAndong\n|Leader of the Democratic Party\n(2022–2025)\nMember of the National Assembly\n(2022–2025)\nGovernor of Gyeonggi Province\n(2018–2021)\nMayor of Seongnam\n(2010–2018)\n|10 April 2025\n|\n|-\n|\nKim Dong-yeon\n|28 January 1957 (age 68)\nEumseong\n|Governor of Gyeonggi Province\n(2022–present)\nDeputy Prime Minister and Minister of Economy and Finance\n(2017–2018)\nMinister for Government Policy Coordination\n(2013–2014)\n|9 April 2025\n|\n|-\n|\nKim Kyoung-soo\n|1 December 1967 (age 57)\nGoseong\n|Governor of South Gyeongsang Province\n(2018–2021)\nMember of the National Assembly\n(2016–2018)\n|10 April 2025\n|\n|}\n{| class=\"wikitable\"\n|+Candidates who withdrew from the 2025 Democratic Party presidential primary\n|\nKim Doo-kwan\n|10 April 1959 (age 66)\nNamhae\n|Member of the National Assembly\n(2016–2024)\nGovernor of South Gyeongsang Province\n(2010–2012)\nMinister of the Interior (2003)\n|5 April 2025\n|\n|}\nDebates\nFirst debate\nOn 18 April, the first debate began, which was televised.\n{| class=\"wikitable\"\n! rowspan=\"2\" |Date\n! colspan=\"3\" | Participant&nbsp;  Invited   Not invited   Absent   Eliminated\n! rowspan=\"2\" |Source\n|-\n!Kim\n!Lee\n!Kim\n|-\n|April 18, 2025\n|P\n|P\n|P\n|\n|}\nSecond debate\nOn 23 April, the party held its second televised debate. During the debate, the three candidates discussed constitutional amendments to either shorten presidential terms or allow multiple terms, and when the changes would take effect.\n{| class=\"wikitable\"\n! rowspan=\"2\" |Date\n! colspan=\"3\" | Participant&nbsp;  Invited   Not invited   Absent   Eliminated\n! rowspan=\"2\" |Source\n|-\n!Kim\n!Lee\n!Kim\n|-\n|April 23, 2025\n|P\n|P\n|P\n|\n|}\nResults\nThe results saw Lee Jae Myung win the nomination in a landslide, with 89.77% of the vote.\n{| class=\"wikitable\"\n|+\n!Candidate\n!Votes\n!%\n|-\n|Lee Jae Myung\n|623,695\n|89.77%\n|-\n|Kim Dong-yeon\n|41,307\n|6.87%\n|-\n|Kim Kyoung-soo\n|25,512\n|3.36%\n|}\nNotes\nReferences"
    }
  ]
}