{
  "content": [
    {
      "type": "text",
      "text": "# 2026 Delaware House of Representatives election\n\nThe 2026 Delaware House of Representatives election will be held on November 3, 2026, alongside the Delaware Senate election and the other 2026 United States elections. Voters will elect members of the Delaware House of Representatives in all 41 of the U.S. state of Delaware's legislative districts to serve a two-year term.\nSummary of results by district\n{| class=\"sortable wikitable\" style=\"font-size:95%;line-height:14px;\"\n! District !! Incumbent !! colspan=\"2\" | Party !! Elected Representative !! colspan=\"2\" | Outcome\n|-\n| 1st\n|\n| style=\"background:;\"|\n| Dem\n| TBD\n|\n|\n|-\n| 2nd\n|\n| style=\"background:;\"|\n| Dem\n| TBD\n|\n|\n|-\n| 3rd\n|\n| style=\"background:;\"|\n| Dem\n| TBD\n|\n|\n|-\n| 4th\n|\n| style=\"background:;\"|\n| Rep\n| TBD\n|\n|\n|-\n| 5th\n|\n| style=\"background:;\"|\n| Dem\n| TBD\n|\n|\n|-\n| 6th\n|\n| style=\"background:;\"|\n| Dem\n| TBD\n|\n|\n|-\n| 7th\n|\n| style=\"background:;\"|\n| Dem\n| TBD\n|\n|\n|-\n| 8th\n|\n| style=\"background:;\"|\n| Dem\n| TBD\n|\n|\n|-\n| 9th\n|\n| style=\"background:;\"|\n| Rep\n| TBD\n|\n|\n|-\n| 10th\n|\n| style=\"background:;\"|\n| Dem\n| TBD\n|\n|\n|-\n| 11th\n|\n| style=\"background:;\"|\n| Rep\n| TBD\n|\n|\n|-\n| 12th\n|\n| style=\"background:;\"|\n| Dem\n| TBD\n|\n|\n|-\n| 13th\n|\n| style=\"background:;\"|\n| Dem\n| TBD\n|\n|\n|-\n| 14th\n|\n| style=\"background:;\"|\n| Dem\n| TBD\n|\n|\n|-\n| 15th\n|\n| style=\"background:;\"|\n| Dem\n| TBD\n|\n|\n|-\n| 16th\n|\n| style=\"background:;\"|\n| Dem\n| TBD\n|\n|\n|-\n| 17th\n|\n| style=\"background:;\"|\n| Dem\n| TBD\n|\n|\n|-\n| 18th\n|\n| style=\"background:;\"|\n| Dem\n| TBD\n|\n|\n|-\n| 19th\n|\n| style=\"background:;\"|\n| Dem\n| TBD\n|\n|\n|-\n| 20th\n|\n| style=\"background:;\"|\n| Dem\n| TBD\n|\n|\n|-\n| 21st\n|\n| style=\"background:;\"|\n| Dem\n| TBD\n|\n|\n|-\n| 22nd\n|\n| style=\"background:;\"|\n| Rep\n| TBD\n|\n|\n|-\n| 23rd\n|\n| style=\"background:;\"|\n| Dem\n| TBD\n|\n|\n|-\n| 24th\n|\n| style=\"background:;\"|\n| Dem\n| TBD\n|\n|\n|-\n| 25th\n|\n| style=\"background:;\"|\n| Dem\n| TBD\n|\n|\n|-\n| 26th\n|\n| style=\"background:;\"|\n| Dem\n| TBD\n|\n|\n|-\n| 27th\n|\n| style=\"background:;\"|\n| Dem\n| TBD\n|\n|\n|-\n| 28th\n|\n| style=\"background:;\"|\n| Dem\n| TBD\n|\n|\n|-\n| 29th\n|\n| style=\"background:;\"|\n| Dem\n| TBD\n|\n|\n|-\n| 30th\n|\n| style=\"background:;\"|\n| Rep\n| TBD\n|\n|\n|-\n| 31st\n|\n| style=\"background:;\"|\n| Dem\n| TBD\n|\n|\n|-\n| 32nd\n|\n| style=\"background:;\"|\n| Dem\n| TBD\n|\n|\n|-\n| 33rd\n|\n| style=\"background:;\"|\n| Rep\n| TBD\n|\n|\n|-\n| 34th\n|\n| style=\"background:;\"|\n| Rep\n| TBD\n|\n|\n|-\n| 35th\n|\n| style=\"background:;\"|\n| Rep\n| TBD\n|\n|\n|-\n| 36th\n|\n| style=\"background:;\"|\n| Rep\n| TBD\n|\n|\n|-\n| 37th\n|\n| style=\"background:;\"|\n| Rep\n| TBD\n|\n|\n|-\n| 38th\n|\n| style=\"background:;\"|\n| Rep\n| TBD\n|\n|\n|-\n| 39th\n|\n| style=\"background:;\"|\n| Rep\n| TBD\n|\n|\n|-\n| 40th\n|\n| style=\"background:;\"|\n| Rep\n| TBD\n|\n|\n|-\n| 41st\n|\n| style=\"background:;\"|\n| Rep\n| TBD\n|\n|\n|}\nList of districts\n{| id=toc class=toc summary=Contents\n| align=center |\nDistrict 1 • District 2 • District 3 • District 4 • District 5 • District 6 • District 7 • District 8 • District 9 • District 10 • District 11 • District 12 • District 13 • District 14 • District 15 • District 16 • District 17 • District 18 • District 19 • District 20 • District 21 • District 22 • District 23 • District 24 • District 25 • District 26 • District 27 • District 28 • District 29 • District 30 • District 31 • District 32 • District 33 • District 34 • District 35 • District 36 • District 37 • District 38 • District 39 • District 40 • District 41 • __NOTOC__\n|}\nDistrict 1\nThe 1st district is represented by Democrat Nnamdi Chukwuocha, who is eligible to run for re-election but has not yet stated if he will do so.\nDistrict 2\nThe 2nd district is represented by Democrat Stephanie Bolden, who is eligible to run for re-election but has not yet stated if she will do so.\nDistrict 3\nThe 3rd district is represented by Democrat Josue Ortega, who is eligible to run for re-election but has not yet stated if he will do so.\nDistrict 4\nThe 4th district is represented by Republican Jeff Hilovsky, who is eligible to run for re-election but has not yet stated if he will do so.\nDistrict 5\nThe 5th district is represented by Democrat Kendra Johnson, who is eligible to run for re-election but has not yet stated if she will do so.\nDistrict 6\nThe 6th district is represented by Democrat Debra Heffernan, who is eligible to run for re-election but has not yet stated if she will do so.\nDistrict 7\nThe 7th district is represented by Democrat Larry Lambert, who is eligible to run for re-election but has not yet stated if he will do so.\nDistrict 8\nThe 8th district is represented by Democrat Sherae'a Moore, who is eligible to run for re-election but has not yet stated if she will do so.\nDistrict 9\nThe 9th district is represented by Republican Kevin Hensley, who is eligible to run for re-election but has not yet stated if he will do so.\nDistrict 10\nThe 10th district is represented by Democrat Melanie Ross Levin, who is eligible to run for re-election but has not yet stated if she will do so.\nDistrict 11\nThe 11th district is represented by Republican Jeffrey Spiegelman, who is eligible to run for re-election but has not yet stated if he will do so.\nDistrict 12\nThe 12th district is represented by Democrat Krista Griffith, who is eligible to run for re-election but has not yet stated if she will do so.\nDistrict 13\nThe 13th district is represented by Democrat DeShanna Neal, who is eligible to run for re-election but has not yet stated if they will do so.\nDistrict 14\nThe 14th district is represented by Democrat Claire Snyder-Hall, who is eligible to run for re-election but has not yet stated if she will do so.\nDistrict 15\nThe 15th district is represented by Democrat Kamela Smith, who is eligible to run for re-election but has not yet stated if she will do so.\nDistrict 16\nThe 16th district is represented by Democrat Franklin Cooke Jr., who is eligible to run for re-election but has not yet stated if he will do so.\nDistrict 17\nThe 17th district is represented by Democrat Melissa Minor-Brown, who is eligible to run for re-election but has not yet stated if she will do so.\nDistrict 18\nThe 18th district is represented by Democrat Sophie Phillips, who is eligible to run for re-election but has not yet stated if she will do so.\nDistrict 19\nThe 19th district is represented by Democrat Kimberly Williams, who is eligible to run for re-election but has not yet stated if she will do so.\nDistrict 20\nThe 20th district is represented by Democrat Alonna Berry, who is eligible to run for re-election but has not yet stated if she will do so.\nDistrict 21\nThe 21st district is represented by Democrat Frank Burns, who is eligible to run for re-election but has not yet stated if he will do so.\nDistrict 22\nThe 22nd district is represented by Republican Michael F. Smith, who is eligible to run for re-election but has not yet stated if he will do so.\nDistrict 23\nThe 23rd district is represented by Democrat Mara Gorman, who is eligible to run for re-election but has not yet stated if she will do so.\nDistrict 24\nThe 24th district is represented by Democrat Edward Osienski, who is eligible to run for re-election but has not yet stated if he will do so.\nDistrict 25\nThe 25th district is represented by Democrat Cyndie Romer, who is eligible to run for re-election but has not yet stated if she will do so.\nDistrict 26\nThe 26th district is represented by Democrat Madinah Wilson-Anton, who is eligible to run for re-election but has not yet stated if she will do so.\nDistrict 27\nThe 27th district is represented by Democrat Eric Morrison, who is eligible to run for re-election but has not yet stated if he will do so.\nDistrict 28\nThe 28th district is represented by Democrat William Carson Jr., who is eligible to run for re-election but has not yet stated if he will do so.\nDistrict 29\nThe 29th district is represented by Democrat William Bush IV, who is eligible to run for re-election but has not yet stated if he will do so.\nDistrict 30\nThe 30th district is represented by Republican W. Shannon Morris, who is eligible to run for re-election but has not yet stated if he will do so.\nDistrict 31\nThe 31st district is represented by Democrat Sean Lynn, who is eligible to run for re-election but has not yet stated if he will do so.\nDistrict 32\nThe 32nd district is represented by Democrat Kerri Evelyn Harris, who is eligible to run for re-election but has not yet stated if she will do so.\nDistrict 33\nThe 33rd district is represented by Republican Charles Postles Jr., who is eligible to run for re-election but has not yet stated if he will do so.\nDistrict 34\nThe 34th district is represented by Republican Lyndon Yearick, who is eligible to run for re-election but has not yet stated if he will do so.\nDistrict 35\nThe 35th district is represented by Republican Jesse Vanderwende, who is eligible to run for re-election but has not yet stated if he will do so.\nDistrict 36\nThe 36th district is represented by Republican Bryan Shupe, who is eligible to run for re-election but has not yet stated if he will do so.\nDistrict 37\nThe 37th district is represented by Republican Valerie Jones Giltner, who is eligible to run for re-election but has not yet stated if she will do so.\nDistrict 38\nThe 38th district is represented by Republican Ronald E. Gray, who is eligible to run for re-election but has not yet stated if he will do so.\nDistrict 39\nThe 39th district is represented by Republican Daniel Short, who is eligible to run for re-election but has not yet stated if he will do so.\nDistrict 40\nThe 40th district is represented by Republican Timothy Dukes, who is eligible to run for re-election but has not yet stated if he will do so.\nDistrict 41\nThe 41st district is represented by Republican Richard G. Collins, who is eligible to run for re-election but has not yet stated if he will do so.\nReferences"
    }
  ]
}