{
  "content": [
    {
      "type": "text",
      "text": "# 2028 Cypriot presidential election\n\nPresidential elections will be held in Cyprus in 2028. Should no candidate receive a majority of the vote in the first round, a runoff will be held. The elections may be held earlier under exceptional circumstances, such as the resignation or death of the incumbent president Nikos Christoudoulides. Christodoulides, being in office since 2023, is eligible to run for a second term.\nPotential candidates\nDemocratic Rally\nFile:Annita Demetriou visits Ireland, June 2023 01 (cropped).jpg|Annita Demetriou\nFile:Averof Neofytou 2022 cropped.jpg|Averof Neofytou\nFile:Phedon Phedonos.jpg|Phedonas Phedonos\n* MP Annita Demetriou, President of DISY (2023-present) and President of the House of Representatives (2021-present).\n* MP Averof Neofytou, former President of DISY (2013-2023) and DISY's candidate for the 2023 presidential election.\n* Phedonas Phedonos, Member of DISY and Mayor of Paphos since 2015.\nThe Democratic Rally has announced that its presidential nominee will be elected by its 50,000 members.\nProgressive Party of Working People (AKEL)\nFile:Andreas Mavroyiannis 2022 (cropped).jpg|Andreas Mavroyiannis (Independent)\nFile:Odysseas Michaelides (cropped).png|Odysseas Michaelides (Independent)\nFile:Irene Charalambides, Special Representative on Fighting Corruption, Marrakech, 4 October 2019 (cropped).jpg|Irene Charalambidou\n* Andreas Mavroyiannis (Independent, supported by AKEL), former negotiator of the Greek Cypriot community in the Cyprus talks, former Permanent Representative of Cyprus to the UN, former Permanent Representative of Cyprus to the EU and Deputy Minister for European Affairs (2012). Mavroyiannis was an independent candidate for the 2023 presidential election, supported by AKEL.\n* Odysseas Michaelides (Independent, potentially supported by AKEL), former auditor general of Cyprus, controversially dismissed from his position due to inappropriate conduct.\n* MP Irene Charalambidou, vice-president of the Parliamentary Assembly of the Organization for Security and Co-operation in Europe.\nDemocratic Party (DIKO)\nFile:Christodoulides2019a.jpg|Nikos Christodoulides (Independent)\nFile:Nikolas papadopoulos 2020.jpg|Nikolas Papadopoulos\n* Nikos Christodoulides (Independent, supported by DIKO), incumbent President of Cyprus, former Minister of Foreign Affairs (2018–2022), former Government Spokesman (2013–2018) and former member of DISY.\n* Nikolas Papadopoulos, President of DIKO since 2013 and DIKO's candidate in the 2018 presidential election.\nDeclined to be candidates\n* Efthimios Diplaros, Deputy President of the Democratic Rally.\nReferences"
    }
  ]
}