{
  "content": [
    {
      "type": "text",
      "text": "# 20th Electronic Warfare Battalion (Ukraine)\n\n| image                         = 20th Electronic Warfare Battalion.png\n| image_size                    = 200\n| caption                       = Insignia\n| dates                         = 2013-present\n| country                       =\n| branch                        =\n| type                          = Battalion\n| role                          = Electronic Warfare\n| command_structure             =\n| garrison                      =\n| motto                         =\n| battles                       = Russo-Ukrainian War\n| website                       =\n| identification_symbol =\n| identification_symbol_label = Former Insignia\n}}\nThe 20th Electronic Warfare Battalion (A1828) is a battalion level unit of the Armed Forces of Ukraine, concerned with electronic warfare. It is headquartered in Cherkaske and has seen action during both the War in Donbass and the Russian invasion of Ukraine.\nHistory\nThe Battalion was established on 27 September 2013.\nSince the beginning of the War in Donbass, the battalion's personnel have been actively participating in action, both as part of maneuver groups and as entire units. On 1 November 2018, the battalion suffered its first combat fatality during heavy machine gun and small arms fire on a Ukrainian Armed Forces stronghold near Zaitseve when a soldier of the battalion (Honcharenko Ihor Andriyovych) was killed.\nThe battalion has taken part in the Battle of Izium, the liberation of Husarivka, the Battle of Kharkiv, 2022 Kharkiv counteroffensive, the Battle of Trostyanets, Battle of Okhtyrka and the Battle of Staromarivka among others. In August 2022, the 20th EW Battalion started providing support to units during the Battle of Bakhmut including communications jamming, direct assault and counterdrone warfare, and after a short break returned to the city in January 2023 and remained deployed until May. On 20 January 2023, a soldier of the battalion (Plokhotyuk Ivan Vasylovych) was killed during the Battle of Kreminna. On 13 August 2024, a soldier of the battalion (Yakovenko Yaroslav Oleksandrovych) was killed in Sadly.\nReferences"
    }
  ]
}