{
  "content": [
    {
      "type": "text",
      "text": "# 20th Century Fox Records\n\n| founder = Henry Onorati\n| defunct =\n| status = Sold to PolyGram in 1982–1991 and absorbed into Casablanca Records\n| distributor = Independent distribution (except 1966–1971 ABC Records, 1979–1981 RCA Records)\n| genre = Various\n| country = United States\n}}\n20th Century Fox Records (also known as 20th Fox Records and 20th Century Records, or simply 20th Century Fox Film Scores) was a wholly owned subsidiary of film studio 20th Century-Fox. The history of the label covers three distinct 20th Century Fox-related operations in the analog era, ranging chronologically from about 1938 to 1981.\nHistory\n20th Century-Fox (now 20th Century Studios) was formed through the merger of Darryl F. Zanuck's Twentieth Century Pictures with the Fox Film Corporation on May 31, 1935. Before the merger, Fox Film Corporation tried out a couple of short-lived record labels in conjunction with its Movietone sound system. Although Movietone was a dedicated sound-on-film system, in 1929-30 Fox produced some soundtracks on disc to accompany features shown in theaters not yet equipped for optical sound. Between 1933 and 1937, a custom record label called Fox Movietone was produced starting at F-100 and running through F-136.  It featured songs from Fox movies, first using material recorded and issued on the RCA Victor Bluebird label and halfway through switched to material recorded and issued on ARC's dime store labels. These scarce records were sold only at Fox Theaters.\nIn 1938, 20th Century-Fox began a new, semi-private line of records employing white labels with typed, or mimeographed, information. Matrix numbers are variable, but the earliest known records in this series correspond to the picture Sally, Irene and Mary (1938) and the latest ones to ''The Gang's All Here (1943). These discs were limited exclusively to studio properties recorded on 20th Century-Fox soundstages and were used for promotional purposes and as giveaways to staff and visitors to the studio itself. After this small scale venture was discontinued, 20th Century-Fox stayed out of record production for about 15 years, though its music division remained very active in licensing 20th Century-Fox musicals and soundtrack music for use on record albums to other companies, such as that for the 1956 film The King and I, released on Capitol Records. The studio also had success in the 1950s with films starring popular singers Elvis Presley and Pat Boone, with Presley making his film debut in Love Me Tender (1956) and Boone debuting in Bernardine and then following it up with April Love (both 1957).\nFox set up a record company in South Africa and started talks with Roulette Records to form a partnership in the US but talks fell through and Fox decided to set up their own company in the US.\n20th Fox Records\n20th Fox Records was established in 1958 with Henry Onorati at its head; Onorati was hired away from Dot Records to run the new label. Onorati brought with him \"Carol of the Drum,\" a Katherine K. Davis Christmas carol that had been recorded at Dot, but not released; it was retooled as \"The Little Drummer Boy\" and issued on 20th Fox as a single by the Harry Simeone Chorale. It became a Christmas standard in short order  and put the label on a sound footing. During Onorati's tenure, 20th Fox was at its most ambitious and the album program was oriented towards an adult audience, whereas the singles attempted, without much success, to crack the sales charts.\n20th Fox albums often appeared in deluxe packaging, and sometimes the film soundtrack albums featured narration or were bridged with dialog from the films.\nOther releases, such as those featuring Glenn Miller, George Gershwin, and Shirley Temple, were sourced from vault film elements. 20th Fox also featured new albums by veteran artists such as Eubie Blake, Claude Hopkins and Stuff Smith; Hugo Winterhalter made his debut as a leader on 20th Fox.\nIn 1962, Onorati resigned from 20th Fox and went back to Dot; his last 20th Fox project was the soundtrack album for The Longest Day. Onorati was replaced by Basil J. Bova.\n20th Century-Fox Records\nUpon assuming the top job at 20th Fox, Basil Bova's first order of business was to quell rumors that the label planned to merge with Cameo-Parkway Records. In May 1963, Bova renamed 20th Fox Records as 20th Century-Fox Records and the label design was changed to incorporate the movie studio logo. 20th Century-Fox was unusual in that its singles and album programs were separate entities; whereas the singles exploited pop and novelty fare, the album program was considerably more adult and represented a continuation of the plan Onorati had originally devised for the label. Exceptions include albums based around successful singles, such as Sing We Now of Christmas which included \"The Little Drummer Boy\" by The Harry Simeone Chorale, Navy Blue by Diane Renay and two albums by Mary Wells who enjoyed five mid-chart hits in 1964 and 1965.\nBova anticipated that the soundtrack album for Cleopatra would be \"the blockbuster of them all\". Appearing before the film's release by about two months in June 1963, the soundtrack debuted at #2 on the Billboard album chart and sold steadily. But the film opened to losses so great that belt-tightening was felt throughout the studio structure, and in 1965 it reached the record label. The 20th Century-Fox studio closed its newsreel division in 1963, cutting off the label's access to documentary audio for use in a series of current events albums, and tentative steps towards branching out into folk music and psychedelic rock were stopped altogether.\nFrom 1966, ABC Records handled distribution of 20th Century-Fox Records, and the label issued soundtrack LPs only, but also briefly instituted a budget subsidiary, Movietone Records, to handle back catalog.\n20th Century-Fox Records enjoyed one more hit album with the soundtrack to Valley of the Dolls, though it did not contain Dionne Warwick's version of the film's theme. They also released the soundtrack to Hello Dolly, starring Barbra Streisand, among other film-related projects.\nIn 1970, the 20th Century-Fox studio shut down the record label, though ABC Records still continued to distribute stock on The Little Drummer Boy, a repackaging of Sing We Now of Christmas.\n20th Century Records\nThe label was dormant (with ABC Records distributing the label's back catalog during that time) from 1970 to early 1972, when the label was revived as 20th Century Records by Russ Regan on a budget of $1 million a year for the first 3 years.\nThe first three acts signed to the 20th Century label were The DeFranco Family, Maureen McGovern, and Barry White; however, Brighter Side of Darkness gave the newly renamed label their first hit record in 1973 with Love Jones.  The label also had major hits with Barry White's The Love Unlimited Orchestra, Love Unlimited, Carl Douglas (best known for the song \"Kung Fu Fighting\"), Edwin Starr, Stephanie Mills, Leon Haywood, Carl Carlton and the Star Wars soundtrack in 1977. The label also released the debut album from The Alan Parsons Project in 1976 in most of the world except Europe.\nOther projects\nThe company also re-released the Harry Simeone Chorale's recording of \"Little Drummer Boy\" and the album on which it was first featured, Sing We Now of Christmas, later reissued as The Little Drummer Boy (this was part of the first 1958-era label series). It became the best selling Christmas album of all time. The rights were later acquired by PolyGram, which released it on CD in 1988, on the Mercury Records label.\nAmong the movie soundtrack albums released by 20th Century Fox Records were those of Zorba the Greek, The Bible: In the Beginning, Doctor Dolittle, and Patton, all of them 20th Century Fox films. However, the label did not issue the soundtrack albums of any of the Rodgers and Hammerstein films released by the studio. Instead, the albums made from five of these films were released by Capitol Records (Oklahoma! and Carousel due to star Shirley Jones' recording contract and The King and I due to contractual obligations of Yul Brynner), and the remaining two albums by RCA Victor (South Pacific and The Sound of Music due to stars Mitzi Gaynor's and Julie Andrews' recording contracts with that label). Years later, the Capitol albums reappeared on CD in expanded versions issued by Angel Records. (The film versions of Oklahoma and South Pacific, although released in roadshow format by the Magna Corporation, were given general release by 20th Century Fox.)\nLater years\nIn 1966, Fox had a deal with ABC Records for distribution and until 1970, this partnership enjoyed success. By 1970, with the parent 20th Century Fox in financial trouble (which eventually led to discontent that resulted in the ousting of Darryl Zanuck), the new output of the record company dropped to zero. Although albums that had been selling were distributed by ABC Records, no new product was forthcoming and 20th Century-Fox then shut down its record subsidiary.\nIt was re-activated in 1972 as 20th Century Records and designed a smart new blue label with a new logo. Russ Regan, a veteran \"record man\", became the new head of the label, a move that increased their credibility in the business considerably. Promotion seemed better, too, as the first two singles issued by the new incarnation both charted. Their biggest selling artist at the time, Barry White, scored two number one hits with \"Love's Theme\" with Love Unlimited Orchestra and his own \"Can't Get Enough of Your Love, Babe\".  20th Century-Fox had budgeted a million dollars a year for three years to support the revived label, but it began paying its own way after only six months.\nIn 1976, Russ Regan left to form his own Parachute Records label which was distributed by Casablanca Records (Regan folded Parachute in mid-1979, and, ironically, Casablanca would later redistribute 20th Century's back catalog after PolyGram bought the label). Barry White then set up his own label, Unlimited Gold Records, through CBS, which had performed the pressing duties for 20th since 1972, after he chose not to renew his contract with Fox in 1978.\nThe company reverted to 20th Century-Fox Records with a new label design featuring the movie studio's logo and launched a new distribution deal for Carl Davis' Chi Sound Records in 1978 after leaving their deal with United Artists Records. In 1979, RCA Records took over distribution of the label.\nClosure\nManagerial and operational control of the label were sold to PolyGram in April 1982; the company acquired its catalog in July. Oil magnate Marvin Davis, who had acquired 20th Century Fox, was not interested in the record company, hence its sale. All of its catalog and contracts for then-current artists including Stephanie Mills, Dusty Springfield and Carl Carlton were transferred to Casablanca Records, which PolyGram had purchased in 1977. In 1986, PolyGram dissolved Casablanca Records, moving that label's entire catalogue to Mercury Records.\nUniversal Music Group, the successor of PolyGram, now owns the old 20th Century-Fox Records catalog with reissues handled by Universal Music Enterprises (UMe), on behalf of Mercury Records/Republic Records. Soundtracks that 20th Century Fox owned are controlled by Fox Music (now Hollywood Records) but are often licensed to other entities for reissues.\nRelated record labels\nFox Music\nIt was launched in 1992 as Fox Records in a joint venture with BMG Music. One of the artists of the label was Jamie Foxx. It folded again in 1995.\nFox Music licensed music heard on Fox feature films or TV shows to other record companies. For example, the rights to the soundtrack of the film Titanic are licensed to Sony Music. Also, Glee cast albums are licensed to Sony Music's Columbia Records in a 50/50 venture with 20th Century Fox. These albums were issued using the 20th Century Fox TV Records imprint, which was launched in 2009 and distributed by Columbia.\nIn 2019, Fox Music was absorbed into the Disney Music Group upon The Walt Disney Company's absorption of parent company 21st Century Fox. Disney Music Group is distributed by Universal Music, which owns the 20th Century Fox Records catalog.\nFestival Records\nBetween 1961 and 2005, Australian label Festival Records was a subsidiary of News Limited. News Limited was the Australian arm of Rupert Murdoch's News Corporation, which between 1985 and 2013, owned 20th Century Fox.\nRestless Records\n20th Century Fox had a 20% stake in film production company Regency Enterprises during 1997–2019. Between 1997 and 2001, Regency themselves owned Restless Records, a rock-focused label that occasionally handled soundtrack albums for Fox/Regency co-productions.\nArtists\n*Al Martino\n*Alan Parsons Project\n*Ambrosia\n*Richard Barrett\n*Big Country\n*Brighter Side of Darkness\n*Carl Carlton\n*Gene Chandler\n*Cotton, Lloyd & Christian\n*Patti Dahlstrom\n*DeFranco Family\n*Carl Douglas\n*The Emotions\n*The Exciters\n*Fire & Rain\n*Leif Garrett\n*Byrdie Green\n*Harry Simeone Chorale\n*Leon Haywood\n*Patti Hendrix\n*Dan Hill\n*Honk\n*Lena Horne\n*The Impalas\n*Ahmad Jamal\n*Jigsaw\n*Kitty Kallen\n*Kinsman Dazz\n*Love Unlimited\n*Frankie Lymon\n*Mahogany Rush\n*Peter McCann\n*Maureen McGovern\n*Milan the Leather Boy\n*Stephanie Mills\n*Nite City\n*Kenny Nolan\n*Jim Photoglo\n*Genya Ravan\n*Diane Renay\n*Rhyze\n*Rubicon\n*Harriet Schock\n*Dusty Springfield\n*Edwin Starr\n*Evelyn Thomas\n*Triple S Connection\n*Mary Wells\n*Adam West\n*Barry White and the Love Unlimited Orchestra\n*Betty Grable\nSee also\n*List of record labels\nReferences\nExternal links\n*[http://www.bsnpubs.com/fox/index.html The 20th Century Records Story]"
    }
  ]
}