{
  "content": [
    {
      "type": "text",
      "text": "# 20th GMA Dove Awards\n\n| next     = 21st\n}}\nThe 20th Annual GMA Dove Awards were held on April 13, 1989, recognizing accomplishments of musicians for the year 1988. The show was held in Nashville, Tennessee.\nAward recipients\n*Song of the Year\n**\"Friend Of A Wounded Heart\"; Wayne Watson, Claire Cloninger; Word (ASCAP)\n*Songwriter of the Year\n**Steven Curtis Chapman\n*Male Vocalist of the Year\n**Wayne Watson\n*Female Vocalist of the Year\n**Sandi Patty\n*Group of the Year\n**Take 6\n*Artist of the Year\n**Amy Grant\n*New Artist of the Year\n**Take 6\n*Southern Gospel Album of the Year\n**''Goin' In Style; The Cathedrals; Lari Goss; Homeland\n*Southern Gospel Recorded Song of the Year\n**\"Champion Of Love\"; The Cathedrals; Phil Cross, Caroly Cross; RiverSong\n*Inspirational Album of the Year\n**Make His Praise Glorious''; Sandi Patty; Greg Nelson, Sandi Patti Helvering*; Word\n*NOTE:  The legal name was not changed until 1994.\n*Inspirational Recorded Song of the Year\n**\"In Heaven's Eyes\"; Sandi Patty; Phil McHugh; Word\n*Pop/Contemporary Album of the Year\n**Lead Me On; Amy Grant; Brown Bannister; Myrrh\n*Pop/Contemporary Recorded Song of the Year\n**\"His Eyes\"; Steven Curtis Chapman; Steven Curtis Chapman; Sparrow\n*Contemporary Gospel Album of the Year\n**Take 6; Take 6; Mark Kibble, Claude V. McKnight III, Mervyn E. Warren; Reprise Records\n*Contemporary Gospel Recorded Song of the Year\n**\"If We Ever\"; Take 6; Public Domain; Reunion\n*Traditional Gospel Album of the Year\n**Live...In Chicago; Shirley Caesar; Bubba Smith, Shirley Caesar; Rejoice\n*Traditional Gospel Recorded Song of the Year (formerly Traditional Black Gospel)\n**\"Hold My Mule\"; Shirley Caesar; Shirley Caesar Williams; Word\n*Country Album of the Year\n**Richest Man In Town; Bruce Carroll; Bubba Smith; New Canaan\n*Country Recorded Song of the Year\n**\"Above And Beyond\"; Bruce Carroll; Bruce Carroll, Paul Smith; Word\n*Rock Album of the Year\n**Russ Taff; Russ Taff; Jack Joseph Puig; Myrrh\n*Rock Recorded Song of the Year\n**\"Won By One\"; Mylon & Broken Heart; Scot Allen, Trent Arganti, Kenneth Bentley, Ben Hewitt, Paul Joseph, Mylon LeFevre, Joe Hardy; Star Song\n*Hard Music Album of the Year\n**In God We Trust; Stryper; Stryper, Michael Lloyd; Enigma\n*Hard Music Recorded Song of the Year\n**\"In God We Trust\"; Stryper; Stryper; Benson\n*Instrumental Album of the Year\n**A Symphony Of Praise; Sandi Patti; David T Clydesdale; Word\n*Praise and Worship Album of the Year\n**Praise 10; Maranatha! Singers; Smitty Price, Tom Coomes; Maranatha!\n*Children's Music Album of the Year\n**Wise Guys and Starry Skies; Kathie Hill; Kathie Hill, Randall Dennis; Sparrow\n*Musical Album\n**In His Presence, The Ridden King; Dick and Melodie Tunney; Dick and Melodie Tunney; Genevox\n*Choral Collection Album\n**Sandi Patty Choral Praise; Greg Nelson; Word Music\n*Short Form Music Video of the Year\n**\"Lead Me On\"; Amy Grant; Tina Silvey; Andrew Doucette; Myrrh\n*Long Form Music Video of the Year\n**Carmen Live...Radically Saved; Carman; Cindy Dupree; George J. Flanigen IV and Robert Deaton; Benson\n*Recorded Music Packaging of the Year\n**PATRICK POLLEI, JOAN TANKERSLEY; PHILLIP DIXON; Russ Taff; Russ Taff\nReferences\n*\nExternal links\n* https://doveawards.com/awards/past-winners/"
    }
  ]
}