{
  "content": [
    {
      "type": "text",
      "text": "# 21st-century classical music\n\n21st-century classical music is art music in the contemporary classical tradition that has been produced since the year 2000. A loose and ongoing period, 21st-century classical music is defined entirely by the calendar and does not refer to a musical style in the sense of Baroque or Romantic music.\nMany elements of the previous century have been retained, including postmodernism, polystylism, and eclecticism, which seek to incorporate elements of all styles of music irrespective of whether these are \"classical\" or not—these efforts represent a slackening differentiation between the various musical genres. Important influences include rock, pop, jazz, and the dance traditions associated with these. The combination of classical music and multimedia is another notable practice in the 21st century; the Internet and its related technology are important resources in this respect. Attitudes towards female composers are also changing. Artificial intelligence is also being used to create music.\nOverview\nDuring the 20th century, composers started drawing on an ever wider range of sources for inspiration and developed a wide variety of techniques. Debussy became fascinated by the music of a Vietnamese theatre troupe and a Javanese gamelan ensemble, and composers were increasingly influenced by the musics of other cultures. Schoenberg and the Second Viennese School developed the dodecaphonic system and serialism. Varèse, Stockhausen, and Xenakis helped pioneer electronic music. Jazz and the popular music of the West became increasingly important—both as influences on art music and as genres of their own. La Monte Young experimented with performance art; John Cage applied the I Ching to his music; Reich and Glass developed minimalism. Music generally became more and more diverse in style as the century progressed.\nThis trend has continued into the 21st century: in 2009 BBC Music Magazine asked 10 composers, mostly British (John Adams, Julian Anderson, Henri Dutilleux, Brian Ferneyhough, Jonathan Harvey, James MacMillan, Michael Nyman, Roxanna Panufnik, Einojuhani Rautavaara, and John Tavener), to discuss the latest trends in western classical music. The consensus was that no particular style is favoured and that individuality is to be encouraged. The works of each of these composers represent different aspects of the music of this century, but these composers all came to the same basic conclusion: music is too diverse to categorise or limit. In his interview with the magazine, Dutilleux argued that \"there is only good or bad music, whether serious or popular\". The music of the 21st century is mostly post-modernist, drawing on many different styles and open to a great many influences. Yet it is still a struggle to encourage the public to listen to contemporary music. Dutilleux, Harvey, Rautavaara, and Tavener have since died.\nStyles and influence\nPost-modernism continues to exert an influence on composers in the 21st century. Styles developed in the 20th century, such as minimalism (Philip Glass, Michael Nyman, Steve Reich), postminimalism (Louis Andriessen (died 2021), Gavin Bryars, John McGuire, Pauline Oliveros (died 2016), Julia Wolfe), New Complexity (James Dillon, Brian Ferneyhough), and New Simplicity (Wolfgang Rihm) continue to be developed.\nPolystylism and musical eclecticism are growing trends in the 21st century. They combine elements of diverse musical genres and compositional techniques, often alien to the composers' own culture, into a unified and coherent body of works. Composers have often started their musical career in one discipline and have later migrated to or embraced others, while retaining important elements from the former discipline. In some cases, a composer now labelled \"classical\" may have started out in another discipline. For example, a specific label for John Zorn's music is difficult to choose: he started out as a performance artist and moved through various genres including jazz, hardcore punk, film music, and classical, and often embraces Jewish musical elements. All of these diverse styles appear in his works. Julian Anderson combines elements from many different musical genres and practices in his works. Elements of modernism, spectral music, and electronic music are combined with elements of the folk music of Eastern Europe and the resulting works are often influenced by the modality of Indian ragas. His large-scale Book of Hours for 20 players and live electronics premiered in 2005. Tansy Davies's music also fuses elements of pop and classical music. Prince and Iannis Xenakis are both major influences. Kati Agócs' work for chorus and orchestra The Debrecen Passion (2015) surrounds settings of poetry by Szilárd Borbély with mystical texts of Medieval Latin, Hungarian, and Georgian origin, as well as a Kabalistic prayer.\nComposers are influenced from around the world. For example, in 2002, La Monte Young, along with Marian Zazeela and senior disciple Jung Hee Choi, founded the Just Alap Raga Ensemble which performs Indian classical music of the Kirana Gharana and merges the traditions of Western and Hindustani classical music, Young applying his own compositional approach to traditional raga performance, form, and technique.\nOther composers have also drawn upon diverse cultural and religious influences. For example, John Tavener (died 2013) drew his inspiration from eastern mysticism and the music of the Eastern Orthodox Church, and James MacMillan is influenced by both traditional Scottish music and his own Roman Catholic faith. In a more abstract manner, religious and mystical associations are also found in the works of Sofia Gubaidulina, a devout member of the Russian Orthodox church. The influence of electronic music, numerology, unusual instrumentation, and improvisational techniques are also apparent. Marxist songs serve as basic material for Konrad Boehmer in many works. Roman Turovsky-Savchuk is influenced by his Ukrainian heritage and Baroque music. He composes for the lute, orpharion, and torban, and is an advocate of musical historicism and has collaborated with Hans Kockelmans and the New York Bandura Ensemble led by Julian Kytasty. Tan Dun, best known for his scores for the movies Crouching Tiger, Hidden Dragon, and Hero, attempts to connect Buddhist, Christian and other cultures in his works. His works often incorporate audiovisual elements\nComposers find inspiration from other sources, too. The music of John Luther Adams (an Alaskan environmentalist and no relation to the other John Adams discussed in this article) is informed by nature, especially that of his native Alaska. His Pulitzer Prize-winning symphony Become Ocean was inspired by climate change. ''Frank's House'' by Andrew Norman tries to evoke the architecture of Frank Gehry's house in Santa Monica.\nPéter Eötvös employed a variety of timbres and sound-worlds within his music. Extended techniques such as over-pressure bowings coexist with lyrical folk songs and synthesized sounds. He died in 2024.\nComposers have even created mashups, more commonly found in pop music. Jeremy Sams' The Enchanted Island is one example: he draws from Handel, Vivaldi, Rameau, and other Baroque composers to create a combination of pasticcio and musical collage, which also combines the baroque and the modern in its staging and costume. According to A History of Western Music, \"it calls into question ideas of authorship and originality, making it a thoroughly postmodern work\".\nThe music of Osvaldo Golijov often combines the classical, modern, and popular traditions within a single work juxtaposing contrasting styles—an important trend in the music of the 1960s onward.\nGenre developments\nOpera\nJohn Adams, George Benjamin, Osvaldo Golijov, Cristóbal Halffter (died 2021), James MacMillan, Einojuhani Rautavaara (died 2016), Kaija Saariaho (died 2023), Karlheinz Stockhausen (died 2007), and Judith Weir have all made important contributions in this field:\n* Licht, Stockhausen's cycle of seven operas, begun in 1977, was completed in 2003 with the opera Sonntag aus Licht.\n* Weir's opera Armida was premiered on television, rather than on stage. Channel 4 commissioned the work in 2005. The libretto, also written by Weir, updates Torquato Tasso's 1581 epic poem, La Gerusalemme liberata, setting it in a modern Middle-East conflict which alludes to but never specifically mentions the Iraq War. Weir's opera calls for props that could not be used practically in an opera house, such as a helicopter.\n* Doctor Atomic by Adams (which covers Robert Oppenheimer, the Manhattan Project, and the building of the first atomic bomb). Oppenheimer's aria Batter my heart blends post-minimalist techniques with an expressive vocal line recalling 19th-century opera. In October 2008, just before the premiere, Adams told BBC Radio 3 that he had been blacklisted by the U.S. Homeland Security department and immigration services, probably because of controversy surrounding his 1991 opera The Death of Klinghoffer, which was based on the hijacking of the passenger liner Achille Lauro by the Palestinian Liberation Front in 1985 and the hijackers' murder of wheelchair-bound 69-year-old Jewish-American passenger Leon Klinghoffer.\n* Saariaho's ''L'amour de loin uses her spectralist-influenced orchestral style to tell the story of 12th-century troubadour Jaufré Rudel. In the last tableau of Act IV, the modernist technique of cells based on arrays of semitones and tritones within perfect fifths is applied to the melodic material, while troubadour songs are evoked in the patterns of repeating phrases and the melodic style of short phrases focussed around certain pitches. Thus, 12th- and 20th-century musical ideas are fused in a unique manner.\n* The Spanish composer Halffter wrote his second and third operas, Lazarus (2008) and Schachnovelle'' (2013), both for the Kiel Opera House.\n* In 2023, Canadian composer Airat Ichmouratov, composed an opera The Man Who Laughs to a libretto in french by poet Bertrand Laverdure, adapted from an eponymous novel. Commissioned by Festival Classica, it was premiered on May 31, 2023, in Montreal, Canada\n* Golijov's Grammy-award winning Ainadamar (2005) is about the murder in 1936 of Spanish poet Federico García Lorca by the Fascists. The score combines computer music, musique concrète and modernist dissonance with elements from Flamenco music, Latin American popular music and Cuban rhythms.\n* Written on Skin by Benjamin, The Sacrifice by MacMillan and Rasputin by Rautavaara are other representative works.\n* Animal Farm is a 2023 English-language opera by Russian composer Alexander Raskatov based on George Orwell's 1944 novella of the same name.\n* Mináǧi kiŋ dowáŋ: A Zitkála-Šá Opera (English: My Spirit Sings) is a 2022 operatic film about the life and work of Yankton Dakota author and activist Zitkála-Šá. It is considered by some to be the first opera that uses Dakota language. The opera was composed by Lyz Jaakola (Fond du Lac Anishinaabe), directed by Sequoia Hauck (Anishinaabe, Hupa), and produced by Kelly Turpin of An Opera Theater (AOT). Jaysalynn Western Boy is one of four actors to play Zitkála-Šá. It premiered October 12, 2022 at Water Works Park in Minneapolis, Minnesota.\nChamber opera is an important type of opera developed in the mid-twentieth century. They use smaller scale forces than regular operas. Examples from the 21st century include Pauline by Tobin Stokes (libretto by Margaret Atwood), The Corridor by Harrison Birtwistle, El Caballero de la triste figura by Tomás Marco and The Sound of a Voice by Philip Glass.\nBallet\nEmbrace is a ballet written in 2018 by the American composer Sarah Kirkland Snider and choreographed by the British choreographer George Williamson. Debra Craine of The Times wrote, \"Embrace is an earnest and heartfelt gay coming-out tale, with dramatic music (from Sarah Kirkland Snider, played live) and a clearly defined choreographic journey from confusion and confrontation to acceptance and reconciliation.\"\nChroma is a one-act contemporary ballet created by Wayne McGregor for the Royal Ballet. The work received its premiere at the Royal Opera House, Covent Garden, on 17 November 2006. The ballet is performed to a combination of original music by Joby Talbot and arrangements of music by Jack White of the White Stripes, with orchestrations by Christopher Austin.\nSong and choral music\nAdams' On the Transmigration of Souls (2002) is a choral piece commemorating the victims of the 11 September 2001 attacks (for which he won the Pulitzer Prize for Music in 2003). Roxanna Panufnik's recent output includes The Song of Names and All Shall be Well.\nGolijov's La Pasión según San Marcos, Gubaidulina's Johannes-Passion, Tan Dun's Water Passion, and Wolfgang Rihm's Deus Passus were all composed for the Passion 2000 project, through which the Internationale Bachakademie Stuttgart commemorated the 250th anniversary of the death of J.S. Bach. Golijov, being a Jew and Latin American, offered a different perspective on the Passion: he drew on African-influenced traditions from Cuba and Brazil, flamenco and Baroque music to create a work that enacts the story as a ritual through voices, dance and movement.\nHenri Dutilleux's last works (died 2013) include Correspondances and ''Le temps l'horloge'', both of which are song cycles.\nOrchestral works\nArvo Pärt's Symphony No. 4, Los Angeles is the first of his symphonies to be written post-1976 and is the first of his pieces to focus on larger scale, instrumental tintinnabulation.\nJennifer Higdon's blue cathedral, premièred in 2000, is a one-movement orchestral tone-poem and is ranked among the most widely performed works of the early 21st century. It was written in memory of her brother and features flute (her instrument) and clarinet (his instrument) in dialogue in their upper registers. The work evokes Debussy's more accessible form of modernism: parallel triads in strings and brass; changes in pitch set demarcating musical units, such as phrases, and providing a sense of harmonic progression; and Debussy's distinctive orchestral colour.\nSamuel Adler's compositions for orchestra from this century include: A Bridge to Understanding (2008), All Nature Plays (2009), Drifting on Winds and Currents (2010), and In the Spirit of Bach (2014).\nJonathan Harvey's Body Mandala (2006) and Speakings (2008), Anna Clyne's Night Ferry, Elliott Carter's Three Illusions for Orchestra, Christopher Theofanidis' Rainbow Body, Peter Maxwell Davies's Eighth (2001), Ninth (2012), and Tenth (2013) Symphonies, and Per Nørgård's Seventh (2006) and Eighth (2011) Symphonies, Airat Ichmouratov's Symphony in A minor, Overture \"The Myth of Falcon\", Overture \"Maslenitsa\"  are just some of the other important orchestral works produced since 2000.\nComposers have also written concertos in the 21st century. Oliver Knussen's Violin Concerto, Op. 30, written for Pinchas Zukerman, premièred in 2003. Milky Ways is concerto for cor anglais and orchestra written in 2022 by the Finnish composer Outi Tarkiainen.  The composer included a moment of blocking during which the solo performer rises, walks behind the orchestra, and exits through the stage door, all the while being followed by a spotlight while a string trio, offstage, plays. There were also 4 violin concertos in 2021: Missy Mazzoli, James MacMillan, Unsuk Chin, and John Williams. Concertos for Orchestra have also been written: Walkabout: Concerto for Orchestra by Gabriela Lena Frank and one by André Previn both premiered in 2016. Christopher Rouse's Concerto for Orchestra was premiered in 2008. Jennifer Higdon (Oboe Concerto, Percussion Concerto both in 2005), Dieter Lehnhoff, Elliot Carter, Philip Glass, Ellen Taaffe Zwilich, Airat Ichmouratov, Thomas Adès, Magnus Lindberg, Hans Abrahamsen,  Helen Grime, and many others continue to add concertos to the repertiore in the 21st century.\nChamber music\nElliott Carter (died 2012) has written a large body of music for chamber groups and soloist since 2000. These include Tintinnabulation for percussion sextet, Double Trio for trumpet, trombone, percussion, piano, violin and cello, a string trio, Hiyoku for two clarinets, as well as several new pieces in his Retracing and Figment series for soloists and Two Thoughts about the Piano. His Caténaires for solo piano (2006) evokes both the texture of the finale of Chopin's B minor Sonata and 20th-century serialism.\nStockhausen's last major work, the unfinished cycle of twenty-four compositions collectively titled Klang, is predominantly made up of chamber-music pieces.\nNotable string quartets composed since 2000 include:\n* the quartet by Hanspeter Kyburz\n* the Sixth (2002), Seventh (\"Espacio de silencio\", 2007), Eighth (\"Ausencias\", 2013), and Ninth (\"In memoriam Miguel de Cervantes\", 2016) Quartets by Cristóbal Halffter\n* two numbered quartets—the Fifth (2006) and Sixth (2009)—and Dum transisset I–IV (2007), Exordium (2008), and Silentium (2014) by Brian Ferneyhough\n* the series of ten Naxos Quartets (2001–07) by Peter Maxwell Davies.\nAt his death in 2016, Davies also left an unfinished final String Quartet, Op. 338, of which only the first movement was completed.\nThe German composer Wolfgang Rihm extended his list of string quartets, first with the Twelfth Quartet (2001), the brief Fetzen 2 (2002), and a Quartettstudie (2003–04), then with a revised version of String Quartet No. 11 (2010) and the Thirteenth Quartet (2011), as well as another short work, In Verbundenheit (2014). Austrian Georg Friedrich Haas has written a Third (\"In iij. Noct.\", 2003) and Fourth String Quartet (2003), and the Hungarian composer György Kurtág has also extended his series of (unnumbered) works for this medium, with Six Moments Musicaux (1999–2005), Hommage à Jacob Obrecht (2004–2005), and—in collaboration with György Kurtág junior—Zwiegespräch for string quartet and electronics (1999–2006).\nConcentricities is a piano trio by Graham Waterhouse composed in 2019 for clarinet, cello and piano.\nElectronic music\nElectronic, electroacoustic, and computer music, pioneered in the 20th century, continue to develop in the 21st century. One of the major figures in the early development of electronic music, Karlheinz Stockhausen, composed his last electronic works—Cosmic Pulses and eight further pieces derived from it—as hours 13 to 21 of his Klang cycle (2005–2007).\nMario Davidovsky has extended his series Synchronisms, which in live performance incorporate both acoustic instruments and electroacoustic sounds played from a tape. Other composers including Mason Bates, Jean-Claude Éloy, Rolf Gehlhaar, Jon Hassell, York Höller, Hanspeter Kyburz, Mesías Maiguashca, Philippe Manoury, and Gérard Pape are active is this field. Bates' The B-Sides is a symphony in five movements for electronica and orchestra and Hassell's music exploits unusual electronic manipulation of the trumpet sound.\nMultimedia and music\nClassical composers continue to write film music: Philip Glass (The Hours, Naqoyqatsi, and Notes on a Scandal), Michael Nyman (Everyday), John Williams (Harry Potter film series, Indiana Jones and the Kingdom of the Crystal Skull, and Star Wars: The Force Awakens) are some of the most notable.\nApart from film composers and Judith Weir, mentioned above, other composers have embraced the growing technological advances of the 21st century.\nThe work In Seven Days (2008), by Thomas Adès, was composed for a piano, an orchestra, and six video screens. The video segments were created by Tal Rosner, Adès's civil partner. Polaris for orchestra and five video screens was released in 2011.\nIn 2008, Tan Dun (best known for the score for Crouching Tiger, Hidden Dragon) was commissioned by Google to compose Internet Symphony No. 1—\"Eroica\" to be performed collaboratively by the YouTube Symphony Orchestra. This work used the internet to recruit orchestra members and the final result was compiled into a mashup video, which premiered worldwide on YouTube.\nLudovico Einaudi is one other notable composer still working in the 21st century, blending classical, folk, pop, rock and world musics. Polystylism and musical eclecticism are therefore important. He came to prominence in 1996 with his piano album Le Onde and is still very popular in Britain and Italy. His latest work is Elements, for piano, electronics and orchestra (2014), and he has written the film music for This Is England (2006) and its sequels (2010, 2011, and 2015), the trailer music for Black Swan (2010), and the classical album Una Mattina (2004). His album, In a Time Lapse, was released on 21 January 2013, with US and Canadian supporting tours.\nArtificial Intelligence (AI) and music\nComposers are starting to use artificial intelligence to create all or part of their music. Robert Laidlow's Silicon is for symphony orchestra and artificial intelligence. Likewise, his Post-Singularity Songs uses ChatGPT.\nTod Machover, an American composer who uses AI in his works and his teaching, says the technology needs the human touch: “[it] is generating infinite music that isn’t actually composed by anybody, and that’s a terrible, scary, awful way of thinking about where music could go. I mean, really, it’s the worst kind of elevator music.” Machover heads the Opera of the Future group at Massachusetts Institute of Technology's Media Lab which focuses on the exploration of “concepts and techniques to help advance the future of musical composition, performance, learning, and expression”.  Machover's City Symphonies uses AI to organise sounds from cities; these sounds have been crowdsourced.\nAIVA is an algorithmic composer using AI. It is recognised by SACEM, the French professional association collecting payments of artists’ rights and distributing the rights to the original songwriters, composers, and music publishers.\nComposers\nA 2019 survey by BBC Music Magazine created a list of 'greatest composers', based on the feedback of 174 living composers; the living composers included on the list were Saariaho, Reich, Glass, Birtwistle and Sondheim.\nOther important composers include Eric Whitacre, Kaija Saariaho, Jennifer Higdon, Magnus Lindberg, Michael Finnissy, Michel van der Aa, Airat Ichmouratov and Nico Muhly.\nFemale composers\nRoxanna Panufnik, in the aforementioned interview with the BBC, says:\n, and Thea Musgrave. Hip young things like Tansy Davies and Emily Hall will exert a great influence on the new music scene in the next ten years.}}\nImportant female composers working in the 21st century (not already mentioned in this article) include Elisabetta Brusa, Chaya Czernowin, Gabriela Lena Frank, Cevanne Horrocks-Hopayian, Sophie Lacaze, Liza Lim, Meredith Monk, Onutė Narbutaitė, Olga Neuwirth, Doina Rotaru, Rebecca Saunders, Linda Catlin Smith, Joan Tower and Agata Zubel.\nImportant composers who have died\nSeveral important composers active in the 20th century have died in the early part of the 21st century. These include: Konrad Boehmer, Pierre Boulez, Elliott Carter, Eötvös, Dutilleux, Maxwell Davies, Rautavaara, Stockhausen, and Tavener (already mentioned); Maryanne Amacher, an installation artist and experimental composer; Milton Babbitt whose final works included songs, chamber music and Concerti for Orchestra (2004); Hans Werner Henze whose opera ''L'Upupa und der Triumph der Sohnesliebe  was premièred in 2003 followed by Sebastian im Traum (2004) for large orchestra and the opera Phaedr (2007); Peter Lieberson whose Shing Kham for percussion and orchestra (2010–11) was finished by Oliver Knussen and Dejan Badnjar after his death; John McCabe whose final works include the seventh symphony (Labyrinth) and chamber music; Emmanuel Nunes whose La Main noire for 3 violas (2006–2007) was based on his opera Das Märchen; and Peter Sculthorpe whose Thoughts from Home for piano was intended to form part of the Gallipoli Symphony'' for Anzac Day (2015).\nPerformance of 21st-century music\nDuring the earlier part of the 20th century, new music was sometimes written for and performed by closed circles of musicians: In 1918, Schoenberg founded the Society for Private Musical Performances in Vienna, a membership-only organization which deliberately kept out \"sensation-seeking\" members of the public, and, although similar societies that sprang up in New York at the same time tried to be more inviting to the general public, the International Composers' Guild founded by Varèse and championed by Carl Ruggles, was perceived as elitist. In the latter half of the century, this started to change as composers again started to embrace a wider public.\nIn the 21st century, there are a number of musicians and groups whose primary purpose is the promotion of new music :\n* Pierre-Laurent Aimard, French pianist\n* Alarm Will Sound, 20-member chamber orchestra\n* Arditti Quartet, led by British violinist Irvine Arditti\n* AskoSchönberg, Dutch chamber orchestra based in Amsterdam\n* Bang on a Can, an organization founded by American composers Julia Wolfe, David Lang and Michael Gordon\n* Marco Blaauw, Dutch trumpet player\n* Boston Modern Orchestra Project, led by Gil Rose\n* Ensemble Musikfabrik, from Cologne\n* Ensemble Modern, an international ensemble based in Frankfurt\n* ensemble recherche, based in Freiburg\n* The Esoterics, a vocal ensemble based in Seattle, Washington\n* Judd Greenstein, an American composer and promoter of new music in New York\n* Michael Gielen, Austrian conductor\n* Peter Hannan, Canadian recorder player\n* Oliver Knussen, British conductor\n* Kronos Quartet, a string quartet with over 750 new works written for them\n* International Contemporary Ensemble, or ICE, an ensemble that has premiered over 500 new works\n* Claire Chase, American flautist, founder of ICE (International Contemporary Ensemble)\n* Nicholas Isherwood, American-born bass singer\n* Reinbert de Leeuw, Dutch conductor, pianist, and composer\n* Christian Lindberg, Swedish trombonist\n* London Sinfonietta, chamber orchestra\n* Paul Méfano, French conductor and composer\n* Les Percussions de Strasbourg, French percussion ensemble\n* Ensemble 2e2m, French musical ensemble specializing in the interpretation of works of the twentieth and twenty-first centuries.\n* Steven Schick, American percussionist\n* Peter Serkin, American pianist\n* Greg Anderson and Elizabeth Roe, pianists who regularly perform duets and works for two pianos\n*Alan Gilbert and the New York Philharmonic\n*Michele Marelli, Italian clarinetist\n*Ludovic Morlot, French conductor\n*Esa-Pekka Salonen, Finnish conductor\n*Robert Spano, American conductor\n*Harry Sparnaay, Dutch bass clarinetist\n*Tambuco, Mexican percussion ensemble\n*Theatre of Voices, an international vocal ensemble based in Copenhagen\n*Frances-Marie Uitti, American-born Dutch cellist\nReferences\nSources\n*\n*  |isbn=978-0-8108-6765-9 }}\n*\nFurther reading\n*  }}\n*  }}\n*\n*  |jstor=10.1525/j.ctv1xxxq7 }}\nExternal links\n* [http://www.composers21.com/ The Living Composers Project] — A massive database of living composers"
    }
  ]
}