{
  "content": [
    {
      "type": "text",
      "text": "# 21st Street–Queensbridge station\n\n| division = IND\n| line = IND 63rd Street Line\n| service = 63rd IND\n| other =  NYCT Bus:   MTA Bus:\n| platforms = 2 side platforms\n| tracks = 2\n| structure = Underground\n| opened =\n| services = |note-right1=\n|line2= 63rd IND|left2 = Roosevelt Island |right2= Jackson Heights–Roosevelt Avenue |note-left2=|note-right2=\n|header3=Future services (Dec 2025)\n|line4=63rd IND future|left4=Roosevelt Island|right4=36th Street|note-left4=|note-right4=\n}}\n| other_services2 =\n| footnotes =\n| route_map =\n(local)}}\nuvSTRc1!~MFADEgq\\uvSTR2+4\\uexvSTR!~uvSTRc3\n\\uvSTRc1\\uexvSTR!~uvSTR+4 ~~ ~~ ~~ Stub tracks\n\\\\uvSTRfg\nnumN240\\\\cPLT\\uvSTR\\cPLT\n\\\\cPLT\\uvSTR\\cPLT\n\\\\cPLT\\uvSTR\\cPLT\n\\\\cPLT\\uvSTR\\cPLT\n\\\\uvÜST\n\\\\uvSTRfg\n\\\\uvSTR!~MFADEf ~~ ~~ ~~ to\n}}\n}}\nThe 21st Street–Queensbridge station is a local station on the IND 63rd Street Line of the New York City Subway. Located at the intersection of 21st Street and 41st Avenue within Queensbridge in Long Island City, Queens, it is served by the  .\nThe station contains two tracks and two side platforms, connected by an overhead mezzanine. It opened in October 1989 with the opening of the 63rd Street Line. From its opening until 2001, this was the terminal of the line, although it was not originally intended as a terminal station. The 63rd Street Line was originally part of a plan for a Queens Bypass Line running along the Long Island Rail Road Main Line. However, due to a lack of funds, the line terminated here, with layup tracks going up to 29th Street. As a result, the tunnel became known as the \"tunnel to nowhere.\"\nIn December 2001, the 63rd Street Tunnel Connection opened, allowing trains from the IND Queens Boulevard Line to use the line. This station then became a through station, serving express F trains since then.\n__TOC__\nHistory\nThe current 63rd Street Line was the final version of proposals for a northern midtown tunnel from the IND Queens Boulevard Line to the Second and Sixth Avenue lines, which date back to the IND Second System of the 1920s and 1930s. The current plans were drawn up in the 1960s under the MTA's Program For Action, where the 63rd Street subway line was to be built in the upper portion of the bi-level 63rd Street Tunnel. In the original 1960s plans, there would have been a station (in addition to or as an alternative to 21st Street–Queensbridge) located farther east at Northern Boulevard, one block north of the Queens Plaza station of the Queens Boulevard line. There would have been a pedestrian transfer passageway between the two stations.\nThe station was placed at 21st Street, serving the Queensbridge Houses to the west, and commercial and industrial buildings to the east. The station was added to the plans following lobbying from the local community. During construction, a large amount of disturbance was created along 41st Avenue, which runs through the heart of Queensbridge.\nThe project faced extensive delays. As early as 1976, the Program for Action had been reduced to seven stations on the Archer Avenue and 63rd Street lines and was not projected to be complete for another decade. By October 1980, officials considered stopping construction on the 63rd Street line. Usage estimates for the 21st Street–Queensbridge station were calculated in 1984 at 220 passengers per hour unless a connection was made to the rest of the system. The MTA voted in 1984 to connect the tunnel to the local tracks of the IND Queens Boulevard Line at a cost of $222 million. The section of the line up to Long Island City was projected to open by the end of 1985, but flooding in the tunnel caused the opening to be delayed indefinitely. The MTA's contractors concluded in February 1987 that the tunnel was structurally sound, and the federal government's contractors affirmed this finding in June 1987.\nThis station opened on October 29, 1989, along with the entire IND 63rd Street Line, serving as the line's northern terminal prior to the connection with the IND Queens Boulevard Line. The  train served the station on rush hours and weekday middays, the  train stopped there on evenings and weekends, and the F terminated here during late nights; all services used the Sixth Avenue Line. For the first couple of months after the station opened, the JFK Express to Kennedy Airport also served the station until it was discontinued on April 15, 1990. The tunnel had gained notoriety as the \"tunnel to nowhere\" both during its planning and after its opening, with 21st Street being the line's only stop in Queens. The connection to the Queens Boulevard Line began construction in 1994 and was completed and opened in 2001, almost thirty years after construction of the 63rd Street Tunnel began. Since then, the F train has been rerouted to serve this station at all times.\nThe MTA completed a refurbishment of the station in May 2023. The project included repairing the platforms and stairways, adding lighting, fixing the canopy above the main entrance, and renovating employee rooms. From August 28, 2023, through April 1, 2024, F trains were rerouted via the 53rd Street Tunnel between Queens and Manhattan due to track replacement and other repairs in the 63rd Street Tunnel, and an F shuttle train ran between Lexington Avenue-63rd Street and 21st Street–Queensbridge at all times except late nights, stopping at Roosevelt Island. In 2024, Skanska was hired to replace 21 escalators across the New York City Subway system for $146 million, including six escalators at the 21st Street–Queensbridge station. In April 2025, the 21st Street–Queensbridge station became one of the first New York City Subway stations to have all their MetroCard vending machines removed, amid the replacement of the MetroCard with the OMNY fare payment system. On December 8, 2025, the M train  serving the station on weekdays during the day, running via the 63rd Street Tunnel. The F train  running via the 53rd Street Tunnel during the day, operating via the 63rd Street Tunnel during weekends and nights.\nStation layout\n{| border=0 cellspacing=0 cellpadding=3\n|style=\"border-bottom:solid 1px gray;border-top:solid 1px gray;\" width=100|Ground\n|style=\"border-top:solid 1px gray;border-bottom:solid 1px gray;\" width=100|Street level\n|style=\"border-top:solid 1px gray;border-bottom:solid 1px gray;\" width=500|Exit/entrance\n|-\n|Basement 1\n|Mezzanine\n|Fare control, station agent, MetroCard machines\n|-\n|style=\"border-top:solid 1px gray;border-bottom:solid 1px gray;\" rowspan=4 valign=top|Basement 2Platform level\n|style=\"border-top:solid 1px gray;border-right:solid 2px black;border-left:solid 2px black;border-bottom:solid 2px black;text-align:center;\" colspan=2|Side platform\n|-\n|style=\"border-bottom:solid 1px gray;\"|Southbound\n|style=\"border-bottom:solid 1px gray;\"|←  toward | toward  weekdays,  toward  weekends and nights}} ()\n|-\n|Northbound\n|  toward | toward  weekdays,  toward  weekends and late nights}} ( late nights,  other times) →\n|-\n|style=\"border-top:solid 2px black;border-right:solid 2px black;border-left:solid 2px black;border-bottom:solid 1px gray;text-align:center;\" colspan=2|Side platform\n|-\n|style=\"border-bottom:solid 1px gray;\" rowspan=2 valign=top|Basement 3East Side Access\n|style=\"border-bottom:solid 1px gray;\"|Track 1\n|style=\"border-bottom:solid 1px gray;\"|←\n|-\n|style=\"border-bottom:solid 1px gray;\"|Track 2\n|style=\"border-bottom:solid 1px gray;\"|  →\n|}\nThe 21st Street–Queensbridge station has two tracks and two side platforms.|The M train serves the station on weekdays during the day, while the F train serves the station during weekends and nights.}} The next station to the north is Jackson Heights–Roosevelt Avenue during the day and 36th Street at night. The next station to the south is Roosevelt Island.\nThis underground station's only mezzanine is at the east end of station adjacent to the Manhattan-bound platform. Access to both platforms is via an overpass above the tracks, with staircases, escalators and elevators to platform level. At this point, the station has a high ceiling. The platform walls as well as the floor are made of brick, and towards the top of the platform walls is a line of larger brown sheets, on these are the station signs at regular intervals that say \"21 Street–Queensbridge.\" Above this is a thin black strip of metal and above this are yellow squares that take the platform walls up to the station ceiling that is made of concrete. There are no columns between the two tracks or on the platforms, except near the mezzanine and overpass.\nAs with other stations constructed as part of the Program for Action, the 21st Street–Queensbridge station contained technologically advanced features such as air-cooling, noise insulation, CCTV monitors, public announcement systems, electronic platform signage, and escalator and elevator entrances.\nExits\nOutside of fare control, the mezzanine leads to two street stairs at the northeast corner of 21st Street and 41st Avenue. An elevator and escalators are at the northwest corner of the same intersection.\nTrack layout\nUntil the connection to the Queens Boulevard Line opened, this station shared the characteristic of a two side platformed terminal station with Flatbush Avenue–Brooklyn College on the IRT Nostrand Avenue Line. This is an inefficient terminal setup, requiring passengers to know which track the next train will depart from before going to the platform level. As a terminal from 1989 to 2001, the station had tail tracks that continued eastward as far as 29th Street, ending at bumper blocks. Also, this station has \"punch boxes\", with buttons to indicate route selection to the train dispatcher; a control tower on the west end of Manhattan-bound platform, which can be used if necessary; and a diamond crossover switch to the west which was used to turn trains.\nStub tracks east of the station\nEast of the station, before the line connects to the IND Queens Boulevard Line, the tracks veer left while the tunnel wall goes straight, stopping around Northern Boulevard. This bellmouth is part of an intended \"super-express\" bypass of the IND Queens Boulevard Line running along the mainline of the Long Island Rail Road between Queens Boulevard and Forest Hills–71st Avenue planned in 1968. At a proposed station at Northern Boulevard, for which the 29th Street tail tracks might have also been built, a transfer concourse to the Queens Plaza station would have allowed transfers between local, express, and bypass trains.\nThe current bellmouth, built along with the Queens Boulevard connection, is two levels deep with two additional stub-end subway tracks named T1A and T2A. It is viable for future construction of the bypass or the Northern Boulevard transfer station. The original bellmouth stopped at 29th Street. The lower level of the bellmouth was excavated in 2003 for the LIRR East Side Access project, which also extended the subway stub tracks farther east towards Sunnyside Yard; the lower-level tracks opened in 2023. Just above the connection sits the 29th Street Ventilation Complex, built with the connector, in the site of a former parking lot. West of the station, a second ventilation complex lies in Queensbridge Park between Vernon Boulevard and the East River.\nRidership\nIn 2019, the station had 3,516,992 boardings, making it the 144th most used station in the -station system. This amounted to an average of 11,184 passengers per weekday.\nReferences\nExternal links\n*[https://maps.google.com/?ie=UTF8&ll=40.754003,-73.942419&spn=0,0.013765&z=17&layer=c&cbll=40.754079,-73.942348&panoid=lZkBWDDgAjtxKm6uapKhvg&cbp=12,115.92,,0,4.93 21st Street entrance from Google Maps Street View]\n*[http://www.google.com/maps/@40.754509,-73.9421844,3a,75y,187.49h,90.71t/data=!3m8!1e1!3m6!1s-DtkY3xEUj_E%2FV4bZx5muo-I%2FAAAAAAAAJtI%2FvychskyvEaUdab_4xmEU6-0XAKgyEbn5wCLIB!2e4!3e11!6s%2F%2Flh4.googleusercontent.com%2F-DtkY3xEUj_E%2FV4bZx5muo-I%2FAAAAAAAAJtI%2FvychskyvEaUdab_4xmEU6-0XAKgyEbn5wCLIB%2Fw203-h100-p-k-no%2F!7i9728!8i4864!4m3!8m2!3m1!1e1!6m1!1e1 Platforms from Google Maps Street View]\n*[http://www1.nyc.gov/assets/planning/download/pdf/applicants/env-review/silvercup_west/ch10_feis.pdf#page=6 Station Diagram]\n}}"
    }
  ]
}