{
  "content": [
    {
      "type": "text",
      "text": "# 21st Century Australia Party\n\n|foundation   = 2013\n| dissolved =\n|president      = Brodie Geevs\n|headquarters  = Gold Coast, Australia\n|position = Centre\n|ideology     = Centrism  Direct democracy  Limited government\n|website      = }}\nThe 21st Century Australia Party was an Australian political party formed by Jamie McIntyre. Policies include reviewing the necessity of state government to reduce Australia's political system to two layers rather than three, and reviewing certain taxes.\nThe party was founded in March 2013 by McIntyre, whose objective was to create \"an abundant, prosperous 21st century economy, for all Australians to fairly share in the massive wealth our large nation (Australia) can provide\". The party was launched at Glen Innes RSL on 22 April 2013 and aimed to field candidates in most of the 150 lower house seats of the 2013 Federal election, but was unable to be registered before the deadline. The party was registered with the Australian Electoral Commission on 7 November 2013.\nLabelled a \"controversial spruiker\" by the ABC, McIntyre was investigated by the Australian Securities & Investments Commission (ASIC) from 2002 to 2007. ASIC agreed to discontinue the proceedings in 2007 after he repaid investors.\nHistory\nMcIntyre founded the party in March 2013 and announced that he would challenge Tony Windsor for the New England seat. McIntyre comes from a farming family in New England, New South Wales and owns several rural holdings in the area.\nMcIntyre stood as an independent in the 2013 Australian Federal Election for the Division of New England, the seat that Tony Windsor represented, but Tony Windsor did not stand. The seat was won by Barnaby Joyce representing the National Party of Australia. McIntyre gained 6059 votes (6.6%).\nOn 30 April 2018, the party was formally issued a notice that the Australian Electoral Commission was considering deregistering the party on the grounds that it had failed to maintain a minimum of 500 members. On 6 June 2018, the party was deregistered by the AEC for failure to respond to the notice.\nReferences\nExternal links\n*[https://web.archive.org/web/20130420153104/http://21stcenturyaustraliaparty.com.au/ 21st Century Australia Party] official site"
    }
  ]
}