{
  "content": [
    {
      "type": "text",
      "text": "# 235th Mechanized Infantry Brigade (People's Republic of China)\n\n)\n|patron=\n|motto=\n|colors=\n|colors_label=\n|march=\n|mascot=\n|battles=Chinese Civil War, Korean War, Vietnam War, Sino-Vietnamese War\n|anniversaries=\n|decorations=\n|battle_honours=\n|current_commander=\n|current_commander_label=\n|ceremonial_chief=\n|ceremonial_chief_label=\n|colonel_of_the_regiment=\n|colonel_of_the_regiment_label=\n|notable_commanders=\n|identification_symbol=\n|identification_symbol_label=\n|identification_symbol_2=\n|identification_symbol_2_label=\n}}\nThe 235th Mechanized Infantry Brigade, formerly the 79th Division, is a military formation of the People's Liberation Army Ground Force. It's now a maneuvering brigade of the PLA 71st Group Army.\nHistory\nThe Brigade traces its roots to the 79th Division () raised in February 1949 under the Regulation of the Redesignations of All Organizations and Units of the Army, issued by Central Military Commission on November 1, 1948, on the basis on the 25th Division, 9th Column of Huadong Field Army. Its history could be traced to 5th Division of Shandong Military Region, formed in October 1945, one month after the conclusion of the Second World War.\nThe division was a part of 27th Corps. The 79th division took part in major battles during the Chinese Civil War. On September 23, 1948, 73rd Regiment, 25th Division, later 234th Infantry Regiment, 79th Division, led the assault on Republic of China Army positions inside the city of Jinan. After the battle, the regiment was awarded the title of \"First Regiment of Jinan ()\".\nIn November 1950 the division entered Korea as a part of People's Volunteer Army. During its deployment in Korea, it took part in the Second and Fifth Offensive in late 1950 and early 1951.\nTwo CCF Divisions, the 79th and 89th, attacked the 5th Marine Regiment west of the Chosin Reservoir in the Yudam-ni area. The marines killed the Chinese by the hundreds but were in danger of being cut off from the division headquarters at Hagaru-ri, at the southern end of the reservoir.\nThe 79th Division was ordered to attack Yudam-ni from the north. East of the Chosin, the 80th Division, with one regiment of the 81st attached, would attack and destroy the army forces there. By November 29, they realized the offensive was not going well. The forces at Yudam-ni had failed to break into the perimeter. That evening they changed the plan and shifted the principal effort to the 31st RCT east of the reservoir. They committed the two additional regiments of the 81st Division to the attack, with, possibly an additional regiment of the 94th Division.\nIn June 1952 the division returned from Korea and was renamed as the 79th Infantry Division (). As of late 1953, the division was organized into a division HQ and the following units:\n*235th Infantry Regiment\n*236th Infantry Regiment\n*237th Infantry Regiment\n*284th Tank Self-Propelled Artillery Regiment\n*359th Artillery Regiment\nPost-Korea to Present\nIn April 1960 the division was renamed as the 79th Army Division ().\nIn June 1962, the division took part in the emergency combat alert mission in Zhejiang province. The division was then maintained as a Southern Infantry Division, Category A.\nIn September 1967, 284th Tank Self-Propelled Artillery Regiment detached from the division and transferred to 10th Tank Division, in August 1969 renamed as 38th Tank Regiment.\nOn August 20, 1969, the division moved to Xingtai, Hebei along with the Corps HQ. In December 359th Artillery Regiment was renamed as Artillery Regiment, 79th Army Division. In March 1970, the division moved to Xuanhua, Hebei.\nIn June 1970, the division was re-organized as a motorized army division and received the following units:\n*3rd Tank Regiment, 1st Tank Division attached to the division and renamed as Tank Regiment, 79th Army division\n*Anti-Aircraft Artillery Regiment activated\nDuring the 2nd Sino-Vietnamese War (1984–1988), the 79th Division (reinforced with the 241st Regiment from the 81st Division) fought the Battle of Laoshan from April 1987 to April 1988. They were supported by the 14th Artillery Division (10th and 37th Artillery Regiments), Beijing Military Region. During the 1-year period, they sustained 63 KIA and 172 WIA.\nIn 1985 the division was renamed as the 79th Motorized Infantry Division (). From 1985 to 1998 the division maintained as a northern motorized infantry division, category A. By then the division was composed of:\n*Division HQ\n*235th Infantry Regiment\n*236th Infantry Regiment\n*237th Infantry Regiment\n*Tank Regiment\n*Artillery Regiment\n*Anti-Aircraft Artillery Regiment\nThe division took part in the enforced martial law and the crackdown on protests in Beijing, June 1989.\nIn July–September 1998 the division was reduced and renamed as the 235th Motorized Infantry Brigade (), and inherited history, titles, and honors from the 235th Infantry Regiment. Such a case was a rare practice in the history of People's Liberation Army. The brigade was then composed of:\n*1st Infantry Battalion;\n*2nd Infantry Battalion;\n*3rd Infantry Battalion;\n*Tank Battalion;\n*122mm Howitzer Artillery Battalion;\n*130mm Rocket Artillery Battalion;\n*Twin-37mm AAA Battalion;\n*Communications Battalion;\n*Engineer Battalion;\n*Repairing Battalion;\n*Training Detachment.\nIn 2003 the brigade was reorganized and renamed as the 235th Mechanized Infantry Brigade ().\nIn April 2017 the brigade was reorganized and renamed as the 235th Heavy Combined Arms Brigade ().\nReferences"
    }
  ]
}