{
  "content": [
    {
      "type": "text",
      "text": "# 23rd Peshawar Mountain Battery (Frontier Force)\n\nBritish India (1853 - 1947) Pakistan (1947 - Present)\n|branch= British Indian Army\n|type=Artillery\n|size=Battery\n|command_structure=\n|garrison=\n|ceremonial_chief=\n|ceremonial_chief_label=\n|colonel_of_the_regiment=\n|nickname=\n|motto=\n|colors=Blue; faced scarlet\n|colors_label=Uniform\n|march=\n|mascot=\n|battles=Umbeyla Campaign 1863Lushai Expedition 1871-72Second Afghan War 1878-80First World War (Mesopotamia, Northwest Frontier, Baluchistan) 1914-18Third Afghan War 1919Second World War (Burma) 1939-45Kashmir War 1948  Indo-Pakistan War 1965  Indo-Pakistan War 1971\n|notable_commanders=\n|anniversaries=\n}}\nThe 23rd Peshawar Mountain Battery (Frontier Force) was an artillery unit of the British Indian Army. It was raised in 1853 as the Peshawar Mountain Train. It became the 23rd Peshawar Mountain Battery (Frontier Force) in 1903. In 1947, it was transferred to the Pakistan Army, where it exists as the 3rd Peshawar Battery (Frontier Force) of The First (SP) Medium Regiment Artillery (Frontier Force).\nHistory\nThe 23rd Peshawar Mountain Battery was raised at Peshawar by Captain T Broughman in January 1853 as the Peshawar Mountain Train. Initially, it was manned by European gunners of the 2nd Company, 2nd Battalion Bengal Artillery but in 1854, Europeans were replaced with Indian gunners. One of the first officers of the unit was Lieutenant FS Roberts, later Field Marshal Lord Roberts of Kandahar. The battery was equipped with four 3-pounder guns and four 4.5-inch howitzers. In 1858, it became part of the Punjab Irregular Force (Piffer). The Punjab Irregular Force, later designated as the Punjab Frontier Force, earned legendary fame for its exploits on the Northwest Frontier of India. The Peshawar Battery saw extensive service on the Frontier and took part in numerous operations including the Umbeyla Campaign of 1863 and the Second Afghan War of 1878-80. In 1871-72, it took part in the Lushai Expedition.\nDuring the First World War, 23rd Peshawar Mountain Battery fought with distinction in the Mesopotamian Campaign, where it took part in the capture of Basra and the Battle of Shaiba. In 1916, it was engaged on the Tigris Front, as the British made desperate efforts to raise the Siege of Kut al Amara; fighting in the Battles of Sheikh Sa'ad, the Wadi, Hanna and Dujaila Redoubt.  On returning to India, it operated against Mahsuds in 1917 and against Marri and Khetran tribes in 1918. After the war, it again saw service on the Northwest Frontier during the Third Afghan War in 1919 and in Waziristan during 1919-24. During the Second World War, it fought in the Burma Campaign and then served in Malaya and French Indochina in 1946. In 1944, it became an exclusively Punjabi Muslim unit.\nIn 1947, it was transferred to the Pakistan Army, where it became part of the 1 Mountain Regiment, Royal Pakistan Artillery. The battery fought in the Kashmir War of 1948. In 1957, it was equipped with 105&nbsp;mm Self Propelled Field guns and the 1st Mountain Regiment was re-designated as the 1 (SP) Field Regiment, Artillery. The regiment fought with great gallantry in the Battle of Chawinda during the Indo-Pakistani War of 1965. In the Indo-Pakistani War of 1971, the regiment served in the Zafarwal Sector. In 1980, it was re-equipped with medium guns. The battery is affiliated with the Frontier Force Regiment.\nBattle honours\nAfghanistan 1878-79, Basra, Shaiba, Tigris 1916, Mesopotamia 1914-16, North West Frontier, India 1917, Baluchistan 1918, Afghanistan 1919.\nGenealogy\n*1853 - Peshawar Mountain Train\n*1858 -\tPeshawar Mountain Train, Punjab Irregular Force\n*1862 - Peshawar Mountain Train Battery, Punjab Irregular Force\n*1865 -\tPeshawar Mountain Battery, Punjab Frontier Force\n*1876 -\tNo. 3 Mountain Battery, Punjab Frontier Force\n*1879 -\tNo. 3 Peshawar Mountain Battery, Punjab Frontier Force\n*1890 -\tNo. 3 (Peshawar) Mountain Battery, Punjab Frontier Force\n*1901 -\tPeshawar Mountain Battery\n*1903 -\t23rd Peshawar Mountain Battery (Frontier Force)\n*1920 -\t23rd Peshawar Pack Battery (Frontier Force)\n*1921 -\t103rd (Peshawar) Pack Battery\n*1922 -\t103rd (Peshawar) Pack Battery (Frontier Force) (How)\n*1924 -\t103rd (Peshawar) Pack Battery, Royal Artillery (Frontier Force) (How)\n*1927 -\t3rd (Peshawar) Indian Mountain Battery, Royal Artillery (Frontier Force) (How)\n*1928 -\t3rd (Peshawar) Mountain Battery, Royal Artillery (Frontier Force) (How)\n*1939 -\t3rd (Peshawar) Mountain Battery, Frontier Force, Indian Artillery\n*1942 -\t3rd (Peshawar) Indian Mountain Battery, Frontier Force, Indian Artillery\n*1945 -\t3rd (Peshawar) Indian Mountain Battery, Frontier Force, Royal Indian Artillery\n*1947 -\t3rd (Peshawar) Mountain Battery, Frontier Force, Royal Pakistan Artillery\n*1956 -\t3rd (Peshawar) Mountain Battery, Frontier Force, Artillery\n*1957 -\t3 Peshawar (SP) Field Battery, Artillery (FF)\n*1980 -\t3 Peshawar (SP) Medium Battery, Artillery (FF)\nReferences"
    }
  ]
}