{
  "content": [
    {
      "type": "text",
      "text": "# 24th Division (German Empire)\n\nThe 24th Division (24. Division), also known as the 2nd Division No. 24 (2. Division Nr. 24) was a unit of the Saxon and then Imperial German Army. The division was headquartered in Leipzig. Until 1899, the division was subordinated in peacetime to the XII (1st Royal Saxon) Army Corps (XII. (1. Königlich Sächsisches) Armeekorps); thereafter, it was subordinated in peacetime to the XIX (2nd Royal Saxon) Army Corps (XIX. (2. Königlich Sächsisches) Armeekorps).\nThe 2nd Division No. 24 was officially formed on April 1, 1867. However, this was as part of the convention which integrated the division with the Prussian-led army of the North German Confederation. The division already existed as part of the autonomous Saxon Army. It was originally formed in 1849 as the 2nd Division and from July 1, 1850, the 2nd Infantry Division. It became the 2nd Infantry Division No. 24 on April 1, 1867, and the 2nd Division No. 24 on April 1, 1887. On mobilization for World War I in August 1914, it again became the 2nd Infantry Division No. 24, although it was for convenience referred to outside Saxony as the 24th Infantry Division or the 24th (2nd Royal Saxon) Infantry Division. The division was disbanded in 1919 during the demobilization of the German Army after World War I.\nThe division was recruited in western Saxony, especially around Leipzig.\nCombat chronicle\nSaxony fought as an ally of Austria in the Austro-Prussian War. The Saxon Army Corps, including the 1st and 2nd Saxon Divisions, fought in several of the war's battles, including the decisive Battle of Königgrätz. In the Franco-Prussian War, Saxony was allied with Prussia. The 24th Infantry Division fought in the battles of Gravelotte and Beaumont, and in the major Battle of Sedan. It then participated in the Siege of Paris.\nDuring World War I, the division fought on the Western Front, seeing action in the Allied Great Retreat which culminated in the First Battle of the Marne, and then in the Race to the Sea. In 1916, it fought in the Battle of the Somme. In 1918, it participated in the German spring offensive, including the Second Battle of the Somme. Allied intelligence rated the division \"very good\" in 1917, but third class in 1918; however, its \"conduct... was above average and would warrant a higher rating.\"\nOrder of battle in the Franco-Prussian War\nThe organization of the 24th Infantry Division in 1870 at the beginning of the Franco-Prussian War was as follows:\n*3. Infanterie-Brigade Nr. 47 (47. Infanterie-Brigade)\n**Infanterie-Regiment Nr. 104\n**Infanterie-Regiment Nr. 105\n*4. Infanterie-Brigade Nr. 48 (48. Infanterie-Brigade)\n**Infanterie-Regiment Nr. 106\n**Infanterie-Regiment Nr. 107\n**Jäger-Bataillon Nr. 12\n**Jäger-Bataillon Nr. 13\nPre-World War I organization\nGerman divisions underwent various organizational changes after the Franco-Prussian War. The organization of the 24th Division in 1914, shortly before the outbreak of World War I, was as follows:\n*3. Infanterie-Brigade Nr. 47 (47. Infanterie-Brigade)\n**11. Infanterie-Regiment Nr. 139\n**14. Infanterie-Regiment Nr. 179\n*4. Infanterie-Brigade Nr. 48 (48. Infanterie-Brigade)\n**7. Infanterie-Regiment König Georg Nr. 106\n**8. Infanterie-Regiment Prinz Johann Georg Nr. 107\n*2. Kavallerie-Brigade Nr. 24 (24. Kavallerie-Brigade)\n**2. Husaren-Regiment Nr. 19\n**2. Ulanen-Regiment Nr. 18\n*2. Feldartillerie-Brigade Nr. 24 (24. Feldartillerie-Brigade)\n**7.Feldartillerie-Regiment Nr. 77\n**8.Feldartillerie-Regiment Nr. 78\nOrder of battle on mobilization\nOn mobilization in August 1914 at the beginning of World War I, most divisional cavalry, including brigade headquarters, was withdrawn to form cavalry divisions or split up among divisions as reconnaissance units. Divisions received engineer companies and other support units from their higher headquarters. The division was again redesignated an infantry division. Its initial wartime organization was as follows:\n*3. Infanterie-Brigade Nr. 47 (47. Infanterie-Brigade)\n**11. Infanterie-Regiment Nr. 139\n**14. Infanterie-Regiment Nr. 179\n*4. Infanterie-Brigade Nr. 48 (48. Infanterie-Brigade)\n**7. Infanterie-Regiment König Georg Nr. 106\n**8. Infanterie-Regiment Prinz Johann Georg Nr. 107\n*2. Ulanen-Regiment Nr. 18\n*2. Feldartillerie-Brigade Nr. 24 (24. Feldartillerie-Brigade)\n**7. Feldartillerie-Regiment Nr. 77\n**8. Feldartillerie-Regiment Nr. 78\n*1.Kompanie/2. Pionier-Bataillon Nr. 22\nLate World War I organization\nDivisions underwent many changes during the war, with regiments moving from division to division, and some being destroyed and rebuilt. During the war, most divisions became triangular - one infantry brigade with three infantry regiments rather than two infantry brigades of two regiments (a \"square division\"). An artillery commander replaced the artillery brigade headquarters, the cavalry was further reduced, the engineer contingent was increased, and a divisional signals command was created. The 24th Infantry Division's order of battle on February 21, 1918, was as follows:\n*8. Infanterie-Brigade Nr. 89 (89. Infanterie-Brigade)\n**9. Infanterie-Regiment Nr. 133\n**11. Infanterie-Regiment Nr. 139\n**14. Infanterie-Regiment Nr. 179\n**Maschinengewehr-Scharfschützen-Abteilung Nr. 51\n*1.Eskadron/2. Ulanen-Regiment Nr. 18\n*Artillerie-Kommandeur 24:\n**7.Feldartillerie-Regiment Nr. 77\n**Fußartillerie-Bataillon Nr. 96\n*Stab 2. Pionier-Bataillon Nr. 22:\n**2.Kompanie/2. Pionier-Bataillon Nr. 22\n**5.Kompanie/2. Pionier-Bataillon Nr. 22\n**Minenwerfer-Kompanie Nr. 24\n*Divisions-Nachrichten-Kommandeur 24\nReferences\n* [http://www.1914-18.info/erster-weltkrieg.php?u=418 24. Infanterie-Division (Chronik 1914/1918) - Der erste Weltkrieg]\n* Claus von Bredow, bearb., Historische Rang- und Stammliste des deutschen Heeres (1905)\n* Hermann Cron et al., Ruhmeshalle unserer alten Armee (Berlin, 1935)\n* Hermann Cron, Geschichte des deutschen Heeres im Weltkriege 1914-1918 (Berlin, 1937)\n* Günter Wegner, Stellenbesetzung der deutschen Heere 1815-1939. (Biblio Verlag, Osnabrück, 1993), Bd. 1\n* Histories of Two Hundred and Fifty-One Divisions of the German Army which Participated in the War (1914–1918), compiled from records of Intelligence section of the General Staff, American Expeditionary Forces, at General Headquarters, Chaumont, France 1919 (1920)\nNotes"
    }
  ]
}