{
  "content": [
    {
      "type": "text",
      "text": "# 24th Marine Expeditionary Unit\n\n| country =\n| allegiance =\n| branch =\n| type = Marine Air Ground Task Force\n| role = Forward-deployed, rapid-response force\n| size = 2,200 men\n| command_structure = II Marine Expeditionary Force\n| garrison = MCB Camp Lejeune, North Carolina\n| nickname = 24th MEU\n| patron =\n| motto =\n| colors =\n| march =\n| mascot =\n| battles                       =\n*Multinational Force in Lebanon\n**Beirut barracks bombing\n*Persian Gulf War\n**Operation Provide Comfort\n*Somali Civil War\n**Operation Restore Hope\n*Yugoslav Wars\n**Kosovo War\n***NATO bombing of Yugoslavia\n****Operation Allied Force\n*****Operation Noble Anvil\n*Global War on Terrorism\n**Iraq War\n***Operation Iraqi Freedom\n****Invasion of Iraq\n**Operation Enduring Freedom\n***War in Afghanistan\n**Syrian Civil War\n***Operation Inherent Resolve\n| anniversaries =\n| notable_commanders = Scott Benedict Martin R. Berndt Francis L. Donovan James L. Jones Richard Mills Richard F. Natonski Richard T. Tryon\n| current_commander = Colonel Ryan A. Lynch, USMC\n| ceremonial_chief =\n| colonel_of_the_regiment =\n}}\nThe 24th Marine Expeditionary Unit (24th MEU) is one of seven Marine Expeditionary Units currently in existence in the United States Marine Corps. The Marine Expeditionary Unit is a Marine Air Ground Task Force (MAGTF) with a strength of about 2,200 personnel. The MEU consists of a Command Element, a Ground Combat Element based on a reinforced infantry battalion, an Aviation Combat Element based on a reinforced tiltrotor squadron, and a Logistics Command Element based on a Combat Logistics Battalion. The 24th MEU is currently based out of Marine Corps Base Camp Lejeune, North Carolina.\nIts stated mission is to provide geographic combatant commanders with a forward-deployed, rapid-response force capable of conducting conventional amphibious and selected maritime special operations at night or under adverse weather conditions from the sea, by surface and/or by air while under communications and electronics restrictions.\nCurrent subordinate units\n* Ground Combat Element:\n* Aviation Combat Element:\n* Logistics Combat Element:\nHistory\nEarly years\nWhat is today the 24th Marine Expeditionary Unit (MEU) was activated at various times as the 24th and 34th Marine Amphibious Unit (MAU) in the 1960s and 1970s to participate in exercises and operations in the North Atlantic, Mediterranean and Caribbean.\nFirst activated in 1971 as the 34th Marine Amphibious Unit. In May 1982, it was redesignated the 24th MAU and served twice as part of the multinational peace-keeping force in Lebanon (October 1982 through February 1983, and May through November 1983). The 24th MAU lost 241 servicemen in the 1983 Beirut barracks bombing.\nIt continued to make routine six-month deployments to the Mediterranean during the next six years while also providing forces for operations in the Persian Gulf.\nThe 24th MAU was redesignated the 24th MEU in February 1988.\n1990s\nOn 16 April 1991, following Operation Desert Storm, elements of the 24th MEU, along with other U.S. and allied forces, were mobilized to complete a mission of mercy on behalf of the Kurdish people in Turkey and northern Iraq. During Operation Provide Comfort and Operation Provide Comfort II, the MEU delivered food, supplies and medicine and transported Kurds to \"safe havens\" and temporary tent cities.\nIn April 1992, helicopters from the 24th MEU supported Operation Hot Rock, assisting Italian authorities in efforts to divert lava flows from the erupting Mount Etna that threatened the town of Zafferana Etnea.\nThe 24th MEU SOC (Special Operations Capable) took part in Operation Restore Hope and Operation Continue Hope, in Somalia during March and April 1994. The MEU provided humanitarian aid to the Somalis by transporting food and aid to many remote areas of the country.\nThe MEU then turned eastward, entering the Adriatic Sea, where from May to June 1994, it served in support of Operation Provide Promise and Operation Deny Flight in Bosnia and Herzegovina.\nImmediately upon returning from its six-month deployment, the 24th MEU redeployed to the waters of the Caribbean, off the coast of Haiti. The MEU served there from July to August 1994 as part of Operation Support Democracy.\nIn June 1995, elements of the 24th MEU launched a daring, daylight Tactical Recovery of Aircraft and Personnel mission to rescue Air Force Captain Scott O'Grady, who had been shot down over Bosnia and Herzegovina six days earlier.\nIn 1996, the MEU served as a contingency force in the Adriatic Sea in support of Operation Decisive Endeavor. Near the end of October 1996, units from the MEU assisted U.S. Army and allied engineers with the construction of a bridge across the Drina River in Bosnia.\nIn 1998, the MEU was diverted from its regular deployment schedule to provide a forward presence in the Persian Gulf as the United States 5th Fleet landing force in support of Operation Desert Thunder. In addition, the MEU used its aviation assets to enforce the Iraqi no-fly-zone in support of Operation Southern Watch.\nDuring November and December 1998, Marines from the 24th MEU were called upon to provide security for the American embassy in Tirana, Albania. In March 1999, the MEU conducted 34 battlefield air interdiction missions as part of the NATO air campaign against Yugoslavia, attacking with its AV-8B Harriers from the Adriatic Sea. Throughout the air campaign, the MEU was poised in the Aegean and Adriatic Seas to support Tactical Recovery of Aircraft and Personnel (TRAP) missions in support of Operation Allied Force had U.S. or NATO aircrews required assistance. While in the Aegean, the MEU also participated in humanitarian assistance efforts in the former Yugoslav Republic of Macedonia to assist Kosovar refugees with food, water, shelter and medical aid.\nFrom 1999 to 2001, the 24th MEU participated in numerous multinational military exercises and conducted peace support operations in Kosovo.\nGlobal War on Terrorism\nOn April 25, 2001, USS Kearsarge ARG and 24th MEU began its deployment, where the ship hosted the annual USO Gala in Naples, Italy, participated in several large amphibious operations (Trident D'OR, Alexander the Great and Albanian Phibliex), and provided support to the president of the United States during the G8 Summit in Genoa, Italy. On Sept. 11, 2001, Kearsarge and the 24th MEU were underway in the Mediterranean Sea as the World Trade Centers and Pentagon were attacked by terrorists (United Airlines Flight 93 and American Airlines Flight 11 crashed into the World Trade Center in the Financial District of Lower Manhattan, New York City, United States). Prior to the events of September 11, 2001, the 24th MEU was scheduled to be relieved by the 26th MEU in October 2001. During this deployment, Marines & Sailors on the USS Kearsarge visited 12 ports in seven different countries. Amphibious Ready Group (ARG) ships USS Kearsarge, USS Ponce and USS Carter Hall returned home on Oct. 15, 2001. 24th MEU (SOC), Battalion Landing Team 2/8 (BLT 2/8), Marine Medium Helicopter Squadron 266 (HMM 266), MEU SERVICE SUPPORT GROUP 24 (MSSG 24).\nIn August 2002, the 24th MEU departed Marine Corps Base Camp Lejeune. During its nine-month deployment, the MEU participated in Operation Dynamic Response in Kosovo and Operation Iraqi Freedom before returning home in May 2003.\nIn July 2004, the MEU departed for Iraq again. The deployment marked the first time in recent history that an MEU did not deploy as part of an Amphibious Ready Group. Arriving in Iraq by plane and cargo ships, the MEU served as part of the 1st Marine Division. The MEU was responsible for stability and security in northern Babil and southern Baghdad provinces, reported safe havens for insurgents. The 24th MEU also helped secure the \"Triangle of Death\" for the first free Iraqi elections.\nOn 18 July 2006, it was announced that the MEU, along with the Iwo Jima Expeditionary Strike Group, would be directed to Lebanon, to assist in the evacuation of U.S. nationals in Lebanon.  U.S. nationals had become trapped in Lebanon, following a series of Israeli strikes which made the Beirut International Airport nonoperational, and similarly destroyed a number of major roads out of the country.\nIn February 2008, the 24th MEU began deploying its Marines to Kandahar, Afghanistan. They began their combat operations in April 2008. Marines of the 24th MEU flooded into the Taliban-held town of Garmsir 29 April 2008, in Helmand province, in the first major American operation in the region in years. By 1 June 2008, the Taliban were pushed out of Garmser. By mid-July, after a month and a half of heavy combat, the Marines were reporting that they had killed over 400 Taliban fighters in the Garmser area.\nAs the war in Afghanistan shifts from the expulsion of the Taliban to the stabilization of the country, the role for the MEU also shifts to a mission of winning hearts and minds. This involves close coordination with local Afghan leaders and roles as peace makers instead of just soldiers.\n2010 Haiti earthquake\nAfter the devastating Haitian earthquake on 12 January 2010, the 24th MEU was diverted from its scheduled Middle East deployment to provide humanitarian assistance and disaster relief to Haiti, as part of Operation Unified Response. Having sailed from its homeport Naval Station Norfolk on 18 January, 's amphibious ready group (which included Nassau, , and ) was diverted on 20 January, bringing with it the first V-22 Ospreys to be used for a humanitarian mission. On the 23rd, it joined the 22nd MEU, which departed Camp Lejeune on 15 January with the  ARG and remained until it was ordered to depart for its original deployment on 8 February.\n2012 Deployment as Expeditionary Crisis Response Force\nFrom 27 March to 20 December 2012, the 24th MEU deployed as an expeditionary crisis response force and theater reserve with the Iwo Jima Amphibious Ready Group, which consisted of the amphibious assault ships , , and . They sailed throughout the Navy's 5th Fleet and 6th Fleet areas of responsibility, conducting training operations and planning for real-world crisis response. The MEU took part in two major multilateral events; Exercise African Lion 12 in Morocco and Exercise Eager Lion 12 in Jordan.\nThe majority of the MEU also conducted extensive training packages in Kuwait and Djibouti, Africa, while smaller Travelling Contact Teams dispersed throughout Africa to share experiences with militaries in Tanzania, Uganda, Kenya and Rwanda. The MEU was scheduled to return from deployment around Thanksgiving but was extended until the middle of December in order to support potential crisis response missions.\nExercise African Lion 12\nAfrican Lion 12 was the first operational event for the 24th MEU. It took place from 7–18 April 2012 and focused on the sharing of tactics, procedures, and cultures between each military. The 24th MEU was involved in several significant events with the Royal Moroccan Armed Forces, including an amphibious raid, and an intensive intelligence workshop, which included instruction and a demonstration of an RQ-11B Raven, one of the 24th MEU's organic unmanned aerial systems.\nOn 11 April 2012, a 24th MEU MV-22B Osprey crashed near Agadir, Morocco while training during African Lion. Cpls. Robby Reyes and Derek Kerns, both from Marine Medium Tiltrotor Squadron 261 (Reinforced) were killed and two others seriously injured. A Marine Corps investigation concluded that pilot error was the cause of the accident.\nExercise Eager Lion 12\nFrom 8–30 May 2012, the 24th MEU took part in Exercise Eager Lion 12, the largest recurring, annual exercise in U.S. Central Command, designed to strengthen military-to-military relationships through a joint, whole-of-government, multinational approach. Eager Lion 12 consisted of over 11,000 personnel from 19 countries. The 24th MEU took part in a vast range of events including a simulated non-combatant evacuation operation and scenario-based training between the 24th MEU's CBRN defense team and Jordan's incident response force. The MEU's Battalion Landing Team, organized around 1st Battalion, 2nd Marines worked alongside Lebanese, Italian, and Saudi Arabian Forces while the MEU's air combat element, VMM-261, flew partnered flights alongside Jordanian pilots.\nExpeditionary Crisis Response Force\nThe last half of the 24th MEU's 2012 deployment focused on their duties as an expeditionary crisis response force. After the attack on the U.S. embassy in Benghazi, Libya, the MEU began extensive planning for potential missions to aid and/or evacuate U.S. citizens throughout the region in a number of countries that included Sudan, Lebanon, Egypt, Yemen, Tunisia, Syria and Pakistan. The threat of regional unrest resulted in an extension in the 5th Fleet area of responsibility. The MEU was later extended in November to continue serving as a ready, crisis response force throughout the Mediterranean region in 6th Fleet. This second extension led to the MEU returning home a month later than originally scheduled. They returned to North Carolina on 20 December 2012 in Afghanistan.]]The 24th MEU's inherent task organization and flexibility allowed them to adapt to an ever-changing security environment and generate concurrent mission plans. The MEU/ARG even prepared to conduct disaggregated operations so the ships and staffs could be separated physically but still execute missions with \"Alpha\" and \"Bravo\" command and control elements, therefore maximizing efficiency and economy of MEU organic assets.\nThe crisis response mission was the hallmark of the 24th MEU deployment. The MEU commander, Colonel Francis L. Donovan, spent his post-deployment months briefing military and civilian leaders—including members of the Office of the Secretary of Defense, Congress, Department of the Navy, and Headquarters of the Marine Corps— about the capabilities of the Marine Expeditionary Unit as America's premier crisis response force. During more than 30 separate briefings, Donovan presented details that explained how a MEU is best organized to take on crisis response missions, especially now that physical distance is no longer a serious limiting factor since MEUs have the extended range advantage of MV-22B Ospreys and the refueling assets of KC-130J Hercules, both aircraft organic to a MEU.\nSpecial-Purpose Marine Air-Ground Task Force Crisis Response\nOn 21 March 2013, Col. Scott F. Benedict took over command of the 24th MEU from Col. Frank L. Donovan. Less than four months later, in July, the 24th MEU command element deployed to Moron Air Base, Spain, to take over command and control functions of Special Purpose Marine Air-Ground Task Force - Crisis Response - Africa. Col. Benedict took over command of the Marine Corps' newest unit and brought along the 24th MEU executive officer, sergeant major, and other key staff members to comprise the SP-MAGTF Crisis Response command element.\n2015 deployment\nThe MEU deployed from December 2014 to July 2015 to U.S. 5th and 6th Fleet. Highlights of the deployment included support to contingency efforts in Yemen, augment of security on U.S. Navy Mine Counter Measure ships, and support to Maritime Interdiction Operations. During the 221-day deployment, the ARG/MEU supported two Military Assisted Departures; participated in over 30 joint operations, activities, and actions; and conducted nine Theater Security Cooperation engagements. The USS Iwo Jima spent 155 days underway in U.S. 5th Fleet, at one time steaming for 84 consecutive days between ports, in order to provide critical support to Gulf Cooperation Council nations after the evacuation of the U.S. Embassy in Yemen and departure of President Hadi from Yemen. The MEU supported the Iwo Jima Amphibious Ready Group's presence operations during 160 overt Bab al-Mandeb Strait transits.\nThe MEU composited as a full Marine Air-Ground Task Force (MAGTF) 26 May 2014, and began their Pre-deployment Training Program for their 2015 deployment. During the PTP, the MEU took part in Realistic Urban Training (RUT), PHIBRON/MEU Integration (PMINT), ARG/MEU Exercise (ARG/MEU Ex), Composite Training Unit Exercise (COMPTUEX), and Bold Alligator 15 before setting sail on their deployment in the middle of December.\nThe MEU entered the U.S. 6th Fleet on 20 December and the three ships of the Iwo Jima Amphibious Ready Group—USS Iwo Jima, USS New York, and —steamed into the Mediterranean, each conducting separate port visits in Italy, Spain, and Israel. The Marines from USS New York took part in Amphibious Landing Exercise East with Israeli Defense Forces.\nOn 10 January, the ARG/MEU entered U.S. 5th Fleet and assumed alert postures in response to declining conditions in Yemen. On 13 February, as the security situation in Yemen continued to deteriorate, the ARG/MEU supported the evacuation of U.S. citizens from Yemen at the request of the Department of State. Primarily, ARG/MEU assets were on alert to conduct contingency missions during the departure, including a quick reaction force, casualty evacuation, and recovery assets in case of a Tactical Recovery of Aircraft and Personnel. The ARG/MEU also provided significant planning and Command and Control capabilities to the contingency support effort.\nAfter the evacuations, the ARG/MEU deployment evolved into an atypical maritime- focused deployment. As events in Yemen unfolded, the ARG/MEU became the central focus of U.S. 5th Fleet, supporting sea control and maritime security operations in the Gulf of Aden. The forces embarked on the USS Iwo Jima maintained presence in the Gulf of Aden for the majority of the rest of the deployment, but went ashore to Djibouti for several iterations of sustainment training. Meanwhile, the Marines and Sailors aboard the New York and Fort McHenry took part in several training events and military-to-military exercises. The Fort McHenry conducted Exercise Iron Magic in the UAE, Exercise Eagle Resolve in Kuwait, Exercise Eager Lion in Jordan, and Exercise Sea Soldier in Oman. The New York conducted sustainment training in Kuwait and Djibouti.\nAt the end of April, a small contingent of the MEU embarked on the Mine Countermeasures Ship USS Sentry to augment the ship's security during a transit through the Strait of Bab al-Mandeb. This was the first of two operations where MEU Marines augmented ship security on MCMs to increase the ship's force protection. The ARG/MEU also supported several training events with Special Operations Forces while in U.S. 5th Fleet, to include Subject Matter Expert Exchanges in Bahrain and Kuwait.\nat Ali Al Salem Air Base, Kuwait, August 13, 2021]]\nThe MEU/ARG entered U.S. 6th Fleet on 19 June and Marines off New York conducted the unit's final Theater Security Cooperation Exercise with Greece. The MEU/ARG closed out the deployment with port visits in Spain, Portugal, France, and Montenegro. The ARG/MEU returned to the U.S. on 17–20 July.\n2016 Haiti Hurricane Matthew\nDuring their pre-deployment workup, the 24th MEU was directed to provide HA/DR support to Haiti in October 2016, after their country was devastated by Hurricane Matthew. The Marines were embarked aboard USS Iwo Jima and USS Mesa Verde.\n2017 deployment\nThe 24th MEU embarked upon the Bataan Amphibious Ready Group (BATARG) on March 1, 2017 out of Naval Station Norfolk.  The BATARG consisted of three ships: the , , and the . The 24th MEU conducted disaggregated operations across Europe, Africa, and the Middle East simultaneously including maritime security and the deployment of a force of Marines in Syria in support of the Syrian Democratic Forces as they took back Raqqa from ISIS fighters.  The 2017 deployment lasted from March to September and included multiple multi-national exercises including Eager Lion 17.\n24th MEU commanding officers\n{| class=\"wikitable\"\n|-\n| Col. Thomas M. Stokes, USMC (July 1982 – May 1983) || Col. Timothy J. Geraghty, USMC (May 1983 – January 1984)\n|-\n| Col. Myron C. Harrington, USMC (January 1984 – October 1985( || Col. Gordon W. Keiser October 1985 – May 1988\n|-\n| Col. Ronald R. Matthews, USMC (May 1988 – June 1990) || Col. James L. Jones August 1990 – June 1992\n|-\n| Col. Matthew E. Broderick, USMC (July 1992 – April 1994) || Col. Martin R. Berndt, USMC (April 1994 – January 1996)\n|-\n| Col. Richard F. Natonski, USMC (January 1996 – April 1998) || Col. Richard T. Tryon, USMC (May 1998 – August 2000)\n|-\n| Col. Richard P. Mills, USMC (August 2000 – June 2003) || Col. Ronald J. Johnson, USMC (June 2003 – April 2005)\n|-\n| Col. Peter Petronzio, USMC (April 2007 – September 2010) || Col. Robert G. Petit, USMC (September 2010 – February 2011)\n|-\n| Lt. Col. Jason E. Waldron, USMC (February 2011 – May 2011) || Col. Francis L. Donovan, USMC (May 2011 – March 2013)\n|-\n| Col. Scott F. Benedict, USMC (March 2013 – September 2015) ||Col. Ryan S. Rideout, USMC (September 2015 – December 2017)\n|-\n| Col. Eric D. Cloutier, USMC (December 2017 – November 2021)||Col. Ryan M. Hoyle, USMC (November 2021 – June 2023)\n|-\n| Col. Todd E. Mahar, USMC (June 2023 – May 2025)||Col. Ryan A. Lynch, USMC (May 2025 – present)\n|}\nUnit awards\nA unit citation or commendation is an award bestowed upon an organization for the action cited. Members of the unit who participated in said actions are allowed to wear on their uniforms the awarded unit citation. The 24th MEU has been presented with the following awards:\n{| style=\"margin:1em auto; text-align:center;\"\n| colspan=\"3\" |\n|-\n|\n|\n|\n|-\n|\n|\n|\n|-\n|\n|\n|\n|-\n|\n|\n|\n|-\n|}\n{| class=\"wikitable\" style=\"margin:1em auto; text-align:center;\"\n|-\n| colspan=\"3\" |Navy Presidential Unit Citation\n|-\n|Joint Meritorious Unit Award w/ 1 oak leaf\n|Navy Unit Commendation w/ 7 service stars\n|Navy Meritorious Unit Commendation w/ 7 service stars\n|-\n|Marine Corps Expeditionary Medal\n|National Defense Service Medal w/ 2 service stars\n|Armed Forces Expeditionary Medal w/ 3 service stars\n|-\n|Southwest Asia Service Medal w/ 1 campaign star\n|Kosovo Campaign Medal w/ 2 campaign star\n|Afghanistan Campaign Medal w/ 2 campaign stars\n|-\n|Iraq Campaign Medal w/ 1 campaign star\n|Global War on Terrorism Expeditionary Medal\n|Global War on Terrorism Service Medal\n|-\n|}\nIn popular culture\nColonel Terry L. Childers, played by Samuel L. Jackson, in the 2000 film Rules of Engagement, is telling his friend Colonel Hayes Hodges, played by Tommy Lee Jones, that he was taking command of 24th MEU.\nIn the 1998 movie, Enemy of the State; two individuals played by Jake Busey and Scott Caan are hired by the government to track down Will Smith's character. Bussey and Caans characters claim their qualifications include serving as Force Reconnaissance Marines with the 24th MEU.\nLogo\nThe 24th Marine Expeditionary Unit's logo is composed of many distinct parts.\nThe symbols in the center of the logo represent each facet of the force. The shield means defense. The Marine Corps' coat of arms, the Eagle, Globe and Anchor, is emblazoned on the shield surrounded by the words \"Sea, Land, and Air\". The Trident represents maritime roots and ability to strike from the sea, and the upturned sword represents readiness.\nThe 24th MEU's use of the arrow in its logo is unique among MEUs.\nAnnual Warrior Competition\nThe 24th Marine Expeditionary Unit 2nd Force Reconnaissance Company won the 2010 Annual Warrior Competition against tactical units from all over the world.\nSee also\n*Marine Air-Ground Task Force\n*List of Marine Expeditionary Units\n*Organization of the United States Marine Corps\n*Special Purpose Marine Air-Ground Task Force - Crisis Response - Africa\nReferences\n;Notes\n:\n;Bibliography\n;Web\n*[https://www.24thmeu.marines.mil/ 24th MEU's official website]\nExternal links\n*[https://web.archive.org/web/20130616043649/http://www.beirutveterans.info/ BeirutVeterans.info - Information for and about the Beirut Veteran]\n* [https://archive.today/20120907140809/http://www.pbs.org/now/shows/428/index.html PBS NOW | Afghanistan: The Forgotten War - (Follows the 24th MEU)]"
    }
  ]
}