{
  "content": [
    {
      "type": "text",
      "text": "# 24th Genie Awards\n\nThe 24th Genie Awards were held on May 1, 2004, to honour films released in 2003. The ceremony was hosted by Scott Thompson. The ceremony was broadcast on CHUM Limited's terrestrial Citytv and Access Alberta networks, as well as on the cable channels Bravo! and Star!.\nNominations were announced on March 16, 2004. The film Seducing Doctor Lewis garnered the most nominations with 11 nods, although it was virtually shut out on the night of the ceremony, winning only the award for Best Cinematography. Denys Arcand's The Barbarian Invasions was the night's big winner, winning six awards including Best Picture. Arcand joked, however, that he had won only because neither David Cronenberg nor Atom Egoyan had a film in competition.\nSarah Polley's Best Actress win for My Life Without Me was the only one of the six top awards not won by The Barbarian Invasions. Polley took the opportunity in her speech to lament the state of Canadian film: \"We make great movies in this country and it's a shame that the Canadian public never gets to see them.\"\nNominees and winners\n{| class=wikitable width=\"100%\"\n|-\n! style=\"background:#EEDD82; width:50%\" | Motion Picture\n! style=\"background:#EEDD82; width:50%\" | Direction\n|-\n| valign=\"top\" |\n* 'The Barbarian Invasions (Les Invasions barbares) — Denise Robert, Daniel Louis, Fabienne Vonier'\n*Far Side of the Moon (La Face cachée de la lune) — Bob Krupinski, Mario St-Laurent\n*Owning Mahowny — Alessandro Camon, Seaton McLean, Andras Hamori\n*Seducing Doctor Lewis (La Grande séduction) — Luc Vandal, Roger Frappier\n*The Snow Walker — Robert Merilees, William Vince\n| valign=\"top\" |\n* 'Denys Arcand, The Barbarian Invasions (Les Invasions barbares)'\n*Robert Lepage, Far Side of the Moon (La Face cachée de la lune)\n*Guy Maddin, The Saddest Music in the World\n*Jean-François Pouliot, Seducing Doctor Lewis (La Grande séduction)\n*Charles Martin Smith, The Snow Walker\n|-\n! style=\"background:#EEDD82; width:50%\" | Actor in a leading role\n! style=\"background:#EEDD82; width:50%\" | Actress in a leading role\n|-\n| valign=\"top\" |\n* 'Rémy Girard, The Barbarian Invasions (Les Invasions barbares)'\n*Raymond Bouchard, Seducing Doctor Lewis (La Grande séduction)\n*Philip Seymour Hoffman, Owning Mahowny\n*Robert Lepage, Far Side of the Moon (La Face cachée de la lune)\n*Barry Pepper, The Snow Walker\n| valign=\"top\" |\n* 'Sarah Polley, My Life Without Me'\n*Rebecca Jenkins, Marion Bridge\n*Micheline Lanctôt, How My Mother Gave Birth to Me During Menopause (Comment ma mère accoucha de moi durant sa ménopause)\n*Molly Parker, Marion Bridge\n*Karine Vanasse, Séraphin: Heart of Stone (Séraphin: un homme et son péché)\n|-\n! style=\"background:#EEDD82; width:50%\" | Actor in a supporting role\n! style=\"background:#EEDD82; width:50%\" | Actress in a supporting role\n|-\n| valign=\"top\" |\n* 'Stéphane Rousseau, The Barbarian Invasions (Les Invasions barbares)'\n*Benoît Brière, Seducing Doctor Lewis (La Grande séduction)\n*Roy Dupuis, Séraphin: Heart of Stone (Séraphin: un homme et son péché)\n*David Hayman, The Wild Dogs\n*Christopher Plummer, Blizzard\n| valign=\"top\" |\n* 'Marie-Josée Croze, The Barbarian Invasions (Les Invasions barbares)'\n*Olympia Dukakis, The Event\n*Emily Hampshire, A Problem with Fear\n*Meredith McGeachie, Punch\n*Annabella Piugattuk, The Snow Walker\n|-\n! style=\"background:#EEDD82; width:50%\" | Original Screenplay\n! style=\"background:#EEDD82; width:50%\" | Adapted Screenplay\n|-\n| valign=\"top\" |\n*  'Denys Arcand, The Barbarian Invasions (Les Invasions barbares)'\n* Louis Bélanger, Gaz Bar Blues\n* Sébastien Rose, How My Mother Gave Birth to Me During Menopause (Comment ma mère accoucha de moi durant sa ménopause)\n* Ken Scott, Seducing Doctor Lewis (La Grande séduction)\n* Peter Wellington, Luck\n| valign=\"top\" |\n*  'Robert Lepage, Far Side of the Moon (La Face cachée de la lune)'\n* Maurice Chauvet, Owning Mahowny\n* Daniel MacIvor, Marion Bridge\n* Charles Martin Smith, The Snow Walker\n* Esta Spalding, Falling Angels\n|-\n! style=\"background:#EEDD82; width:50%\" | Best Live Action Short Drama\n! style=\"background:#EEDD82; width:50%\" | Best Animated Short\n|-\n| valign=\"top\" |\n* 'Noël Blank — Christiane Ciupka and Jean-François Rivard'\n*Evelyn: The Cutest Evil Dead Girl — Jim Mauro, Brad Peyton\n*Lonesome Joe — Leah Mallen, Mark Sawers\n*Short Hymn, Silent War — Kate Kung, Charles Officer, Sandy Reimer\n*''Why Don't You Dance? — Joel Awerbuck, Michael Downing\n| valign=\"top\" |\n* 'Falling in Love Again — Marcy Page, Munro Ferguson'\n*Islet (Îlot) — Michèle Bélanger, Nicolas Brault\n*Stormy Night (Nuit d'orage) — Marcel Jean, Jean-Jacques Leduc, Michèle Lemieux\n|-\n! style=\"background:#EEDD82; width:50%\" | Art Direction/Production Design\n! style=\"background:#EEDD82; width:50%\" | Cinematography\n|-\n| valign=\"top\" |\n* 'Rob Gray and Christina Kuhnigk, Falling Angels'''\n*Don Taylor and Carolyn 'Cal' Loucks, The Gospel of John\n*Normand Sarazin, Seducing Doctor Lewis (La Grande séduction)\n*Jean Bécotte, Séraphin: Heart of Stone (Séraphin: un homme et son péché)\n*Christian Légaré, Saved by the Belles\n| valign=\"top\" |\n* 'Allen Smith, Seducing Doctor Lewis (La Grande séduction)'\n* François Dutil, Saved by the Belles\n* Stefan Ivanov, A Problem with Fear\n* Gregory Middleton, Falling Angels\n* Jean-Pierre St. Louis, Gaz Bar Blues\n|-\n! style=\"background:#EEDD82; width:50%\" | Costume Design\n! style=\"background:#EEDD82; width:50%\" | Editing\n|-\n| valign=\"top\" |\n* 'Meg McMillan, The Saddest Music in the World'\n*Abram Waterhouse, Blizzard\n*Debra Hanson, The Gospel of John\n*Louise Gagné, Seducing Doctor Lewis (La Grande séduction)\n*Michèle Hamel, Séraphin: Heart of Stone (Séraphin: un homme et son péché)\n| valign=\"top\" |\n* 'David Wharnsby, The Saddest Music in the World'\n*Dominique Fortin, Seducing Doctor Lewis (La Grande séduction)\n*Isabelle Dedieu, The Barbarian Invasions (Les Invasions barbares)\n*Alison Grace, The Snow Walker\n*Michael Weir, The Wild Dogs\n|-\n! style=\"background:#EEDD82; width:50%\" | Overall Sound\n! style=\"background:#EEDD82; width:50%\" | Sound Editing\n|-\n| valign=\"top\" |\n* '''Bruce Carwardine, Todd Beckett, Michael O'Farrell and Don White, The Statement'\n*Warren St. Onge, Steph Carrier and Lou Solakofski, Falling Angels\n*Claude Hazanavicius and Michel Descombes, Seducing Doctor Lewis (La Grande séduction)\n*Michel Descombes, Gavin Fernandes and Patrick Rousseau, The Barbarian Invasions (Les Invasions barbares)\n*Chris Duesterdiek, Mark Berger, Dean Giammarco and Bill Sheppard, The Snow Walker\n| valign=\"top\" |\n* 'Michael O'Farrell, Mark Gingras, Paul Intson, Goro Koyama, John Laing, Andy Malcolm, Jill Purdy, and John Douglas Smith, The Statement'\n*David McCallum, Steven Hammond, Ronayne Higginson, David Rose and Jane Tattersall, Falling Angels\n*Marcel Pothier, Guy Francoeur, Carole Gagnon, Antoine Morin and Jacques Plante, Seducing Doctor Lewis (La Grande séduction)\n*Marie-Claude Gagné, Diane Boucher, Jérôme Décarie, Claire Pochon and Jean-Philippe Savard, The Barbarian Invasions (Les Invasions barbares)\n*Maureen Murphy, Dean Giammarco, Robert Hunter, Johnny Ludgate and Christine McLeod, The Snow Walker\n|-\n! style=\"background:#EEDD82; width:50%\" | Achievement in Music: Original Score\n! style=\"background:#EEDD82; width:50%\" | Achievement in Music: Original Song\n|-\n| valign=\"top\" |\n*  'Christopher Dedrick, The Saddest Music in the World'\n* Richard Grassby-Lewis, Jon Hassell, Bob Locke, Tim Norfolk, Owning Mahowny\n* Michel Cusson, Séraphin: Heart of Stone (Séraphin: un homme et son péché)\n* Mychael Danna, The Snow Walker\n* Sandy Moore, The Wild Dogs\n| valign=\"top\" |\n*  'Ken Whiteley, \"Tell Me\" — Falling Angels'\n* Pamela Phillips-Oland, David Martin and LeVar Burton, \"Center of My Heart\" — Blizzard\n* Adam James Broughton, Jeanne Dompierre, Steve Galluccio and FM Le Sieur, \"Montréal Italiano\" — Mambo Italiano\n* Brian C. Warren and Mark Anthony, \"La Vie\" — Saved by the Belles\n* Luc Plamondon and Michel Cusson, \"Depuis le premier jour\" — Séraphin: Heart of Stone (Séraphin: un homme et son péché)\n|-\n! style=\"background:#EEDD82; width:50%\" | Best Documentary\n! style=\"background:#EEDD82; width:50%\" | Special awards\n|-\n| valign=\"top\" |\n* 'FIX: The Story of an Addicted City — Betsy Carson, Nettie Wild'\n*Go Further — Ron Mann\n*The Last Round: Chuvalo vs. Ali — Silva Basmajian, Joseph Blasioli\n| valign=\"top\" |\n*Claude Jutra Award: 'Sébastien Rose, How My Mother Gave Birth to Me During Menopause (Comment ma mère accoucha de moi durant sa ménopause)\n*Golden Reel Award: Séraphin: Heart of Stone (Séraphin: un homme et son péché)'''\n*Special Achievement: Peter R. Simpson\n|}\nReferences\nExternal links\n*[https://www.imdb.com/event/ev0000276/2004 Genie Awards 2004] at IMDb"
    }
  ]
}