{
  "content": [
    {
      "type": "text",
      "text": "# 2 Kings 19\n\n2 Kings 19 is the nineteenth chapter of the second part of the  Books of Kings in the Hebrew Bible or the Second Book of Kings in the Old Testament of the Christian Bible. The book is a compilation of various annals recording the acts of the kings of Israel and Judah by a Deuteronomic compiler in the seventh century BC, with a supplement added in the sixth century BC. This chapter records the invasion of Assyrian to Judah during the reign of Hezekiah, the king of Judah, a part of the section comprising 2 Kings 18:1 to 20:21, with a parallel version in Isaiah 36–39.\nText\nThis chapter was originally written in the Hebrew language. It is divided into 37 verses.\nTextual witnesses\nSome early manuscripts containing the text of this chapter in Hebrew are of the Masoretic Text tradition, which includes the Codex Cairensis (895), Aleppo Codex (10th century), and Codex Leningradensis (1008).\nThere is also a translation into Koine Greek known as the Septuagint, made in the last few centuries BCE. Extant ancient manuscripts of the Septuagint version include Codex Vaticanus (B;  \\mathfrak{G}B; 4th century) and Codex Alexandrinus (A;  \\mathfrak{G}A; 5th century).}}\nAnalysis\nThe last part of the previous chapter (2 Kings 18:17–37) and this chapter form a subunit in the account of king Hezekiah (2 Kings 18–20) focusing on YHWH's deliverance of Jerusalem from Sennacherib's invasion. It begins on 2 Kings 18:13 with a conjunctive waw and a reference to the fourteenth year of Hezekiah's reign, proceeding with 'a form of prophetic confrontation narrative' featuring Sennacherib, represented by his officers who tried to intimidate Jerusalem to surrender, against Hezekiah and YHWH, represented by the prophet Isaiah.\nThe whole narrative is presented in a parallel structure:\n:A Assyrians arrive at Jerusalem (18:13–16)\n::B messengers from Assyria speak to the people (18:17–37)\n:::C Hezekiah seeks the prophet and prays (19:1–5)\n::::D Isaiah prophesies (19:6–7)\n:A' Assyrians leave (19:8–9a) (break in text)\n::B' Assyrian letter to Jerusalem (19:9b–13)\n:::C' Hezekiah responds by entering temple to pray (19:14–19)\n::::D' Isaiah prophesies (19:20–34)\n:A\" Assyrians leave for good (19:35–37)\nIsaiah's first oracle (19:1–8)\nThis section records the response of king Hezekiah and prophet Isaiah to the speeches of Rabshakeh in the previous chapter. Aware of the serious predicament of the Assyrian attack, Hezekiah sent a delegation to Isaiah for advice from YHWH. The answer from Isaiah is the classic opening, 'Do  not be afraid', followed by a positive oracle that YHWH will send a 'spirit' to the Assyrian king (cf. 1 Kings 22:21–22), so the king will be in panic after merely hearing a rumor and retreat to Assyria, then there he will be murdered. Each part of this oracle is recorded as \"fulfilled\" in 2 Kings 19:8, 9a, 36–37. The Bible text states that an Egyptian army appeared and forced Sennacherib to retreat. In his annals (ANET 287), the Assyrian king also mentions the advance of an Egyptian army, though he claims to have defeated them at Eltekeh, near the border of Philistine and Egypt (cf. Joshua 19:44).\nVerse 2\n:And he sent Eliakim, which was over the household, and Shebna the scribe, and the elders of the priests, covered with sackcloth, to Isaiah the prophet the son of Amoz.\n*\"The elders of the priests\" or \"the leading priests\".\nVerse 7\n:[Isaiah conveyed that the Lord said:] ''\"'Behold, I will put a spirit in him, so that he shall hear a rumor and return to his own land, and I will make him fall by the sword in his own land.'\"\n*\"Spirit\": from , ruakh'',  may refer to \"a spiritual being who will take control of one's mind\" (cf. 1 Kings 22:19), or \"a disposition of concern and fear\"; either case shows the Lord's sovereignty over the king.\nVerse 8\n:So Rabshakeh returned, and found the king of Assyria warring against Libnah: for he had heard that he was departed from Lachish.\nAfter capturing Lachish, the big city in the region, Sennacherib attacked to smaller targets, such as Libnah, identified with 'Tell Bornat',  northeast of Lachish.\nSennacherib's letter and Hezekiah's prayer (19:9–19)\nThe Assyrians were still in Syria-Palestine, and even after hearing a report of Taharqa's attack, Sennacherib became bolder than Rabshakeh in mocking YHWH to be at the same level as the useless gods of other defeated nations. Hezekiah appeared more pious than in verses:1–4, acknowledging that YHWH is only one that exists, as opposed to all other gods.\nVerse 9\n:And the king heard concerning Tirhakah king of Ethiopia, \"Look, he has come out to make war with you.\" So he again sent messengers to Hezekiah, saying,\n*Cross references:\n*\"The king\": the actual Hebrew word means \"he\"; referring to Sennacherib.\n*\"Tirhakah\": identified with Taharqa.\n*\"Ethiopia\": Hebrew: Cush.\nNelson suggests that the narrator exploits the ambiguity of the Hebrew verb shub to 'tease the readers' of the impending confrontation, because it would be expected that when the Assyrian king heard a \"report\" (about Tirhakah), as prophesied, he soon '\"returned'\" (shub) home, but, instead, he \"once more\" (another use of shub) sent messengers to Hezekiah. Therefore, it would not be a 'relatively uneventful withdrawal' as in , but a more pronounced retreat.\nIsaiah's second oracle and Jerusalem's liberation (19:20–37)\n]]\nThe second response from Isaiah is much more detailed than his first, containing three oracles in Isaiah's message this time:\n# speaking against Sennacherib's arrogance and god-like pretentious, in a 'long taunting poem' (verses 21–28)\n# offering a sign to Hezekiah that the word of God will come true (verses 29–31)\n# promising that the siege will end as God will act for His own sake or for David's sake (verses 32–34)\nThe  speech  has  an  ABCBA  structure, bracketed by an introductory and a concluding  formula  ('thus  says the  LORD—says  the  LORD'), containing a central message with a double assurance that the enemy shall not enter this city: his weapons will not harm Jerusalem and he shall retreat in failure. Verse 34 is thought to be a late-Deuteronomistic inclusion (cf. 1 Kings 11:12–13).\nThe song of scorn in verses 21–28 that YHWH himself challenges the king of Assyria for his faulty theological logic:\n* the king boast about his power (verses 22–24; cf. Isaiah 10:7-10)\n* although it was God who granted it to him (verses 25–27)\n* now God will take it away from him (verse 28)\nThe prophecy took an immediate effect: in one night, a plague-bringing angel kills 185,000 Assyrian soldiers in their camp (verse 35), forcing Sennacherib to retreat and never to return (verse 36b). The \"great army\" (2 Kings 18:17) was destroyed overnight, leaving behind dead bodies (cf. Exodus 14:30). Even Sennacherib's own (pseudo-)god \"NIsroch\" cannot protect him in his own temple (#Verse 37|verse 37).\nVerse 35\n:And that night the angel of the Lord went out and struck down 185,000 in the camp of the Assyrians. And when people arose early in the morning, behold, these were all dead bodies.\nThe account of Sennacherib invasion into Judah is corroborated by some extrabiblical sources:\n* The Assyrian literature: including prisms, cylinder, and the Lachish reliefs from the period of Sennacherib. Naturally, the loss of many soldiers in Jerusalem is omitted from the record, but the siege in Jerusalem is clearly noted in Sennacherib's Annals.\n* The Greek literature, based on Egyptian narratives, in the writing of  Herodotus, Histories (II.141, 5a), mentions the swarm of mice in the Assyrian camp at one night, chewing the weapons of the soldier, so they suffered a huge loss the next day, although he placed the location of the destruction in Pelusium, not Jerusalem, and the opponent of Sennacherib being Sethos the Egyptian, instead of Hezekiah. His statements were considered by some biblical scholars as an allusion that the Assyrian army was decimated by a mouse or rat borne disease such as bubonic plague.\n* The Jewish literature, such as  Babylonian Talmud, attributes the destruction of the Assyrian army to the lightning, as repeated by some Targums, referring to the combination of hot winds and lightning that often destroyed caravans in the Arabian area.\n* Flavius Josephus, the Jewish Roman historian (37-100 CE), wrote in the Antiquities of the Jews, that Sennacherib withdrew his army because of the plague or pestilence that God sent them.\nVerse 36\nfrom the ruin of Assyrian palace in Nineveh, British Museum]]\n:Then Sennacherib king of Assyria departed and went home and lived at Nineveh.\nThis point marks the end of the Assyrian threat against the kingdom of Judah, although the Assyrians claimed to control Judah through the mid-seventh century BCE.\nSennacherib indeed decorated his palace in Nineveh with the image of his invasion, in particular, his victory over Lachish in a stone relief (Lachish reliefs, now in the British Museum) and described Hezekiah's desperate situation, although somehow was left alive, on several victory monuments (Sennacherib's Annals):\n: 'As to Hezekiah, the Jew, he did not submit to my yoke, I laid siege to 46 of his strong cities... Himself I made a prisoner in Jerusalem, his royal residence, like a bird in a cage. I surrounded him with earthwork in order to molest those who were leaving his city's gate' (ANET 288).'\nSennacherib never claimed to have captured Jerusalem or forced Hezekiah from the throne, uncharacteristic for a king who led a revolt against the Assyrian empire, but his records are still showing successes as typical in Assyrian annals. On the other hand, Judah's records emphasize the protection of YHWH over Jerusalem and the house of David (cf. Psalm 2, Psalm 46, Psalm 47, Psalm 48).\nVerse 37\n:And it came to pass, as he was worshipping in the house of Nisroch his god, that Adrammelech and Sharezer his sons smote him with the sword: and they escaped into the land of Armenia. And Esarhaddon his son reigned in his stead.\n*Cross references:\nAccording to Assyrian records, Sennacherib was assassinated in 681 BCE, twenty years after the 701 BCE invasion of Judah.\n* \"Adrammelech\": Identified as the murderer of his father Sennacherib in an Assyrian letter to Esarhaddon ([https://archive.org/details/assyrianandbaby10harpgoog ABL] 1091), in which he is called Arda-Mulissi.\n* \"Armenia\": or Ararat.\nExtrabiblical documentation\nHezekiah\n.]]\nExtra-biblical sources specify Hezekiah by name, along with his reign and influence. \"Historiographically, his reign is noteworthy for the convergence of a variety of biblical sources and diverse extrabiblical evidence often bearing on the same events. Significant data concerning Hezekiah appear in the Deuteronomistic History, the Chronicler, Isaiah, Assyrian annals and reliefs, Israelite epigraphy, and, increasingly, stratigraphy\". Archaeologist Amihai Mazar calls the tensions between Assyria and Judah \"one of the best-documented events of the Iron Age\" and Hezekiah's story is one of the best to cross-reference with the rest of the Mid Eastern world's historical documents.\nSeveral bullae  bearing the name of Hezekiah have been found:\n# a royal bulla with the inscription in ancient Hebrew script: \"Belonging to Hezekiah [son of] Ahaz king of Judah\" (between 727 and 698 BCE).\n#  seals with the inscription: \"Belonging to [the] servant of Hezekiah\"\nOther artifacts bearing the name \"Hezekiah\" include LMLK stored jars along the border with Assyria \"demonstrate careful preparations to counter Sennacherib's likely route of invasion\" and show \"a notable degree of royal control of towns and cities which would facilitate Hezekiah's destruction of rural sacrificial sites and his centralization of worship in Jerusalem\". Evidence suggests they were used throughout his 29-year reign and the Siloam inscription.\nShebna\n\" on the lintel of the tomb of \"Sebna-yahu\", now in British Museum]]\nAn inscription bearing the name \"Shebnayahu\" was discovered on the lintel above the entrance of a rock-cut tomb which suggests the connection to Shebna, the court officer mentioned in  and .\nSennacherib\n, near Cizre.]]\nThe accounts of Sennacherib of Assyria, including his invasion into the Kingdom of Judah, especially the capture of Lachish and the siege of  Jerusalem, are recorded in a number of ancient documents and artifacts:\n* Lachish reliefs from his palace in Nineveh\n* Prisms containing the annals of the Assyrians (Sennacherib's Annals)\n* Traces of Assyrian siege around the location of ancient Lachish.and the uncovered walls near the Tel Lachish digs, which fit the descriptions shown in the Lachish reliefs.\nIllustration\nFile:Book of Isaiah Chapter 37-1 (Bible Illustrations by Sweet Media).jpg|King Hezekiah asked for God's help\nFile:Second Book of Kings Chapter 19-2 (Bible Illustrations by Sweet Media).jpg|Prophet Isaiah conveyed God's response to Hezekiah\nFile:Book of Isaiah Chapter 38-1 (Bible Illustrations by Sweet Media).jpg|Isaiah prophesied that God would take action\nFile:Second Book of Kings Chapter 19-4 (Bible Illustrations by Sweet Media).jpg|Many Assyrian soldiers died in their camp\nFile:Book of Isaiah Chapter 37-3 (Bible Illustrations by Sweet Media).jpg|Sennacherib was murdered by his own sons.\nSee also\n* Related Bible parts: 2 Kings 17, 2 Kings 18, 2 Kings 20, 2 Chronicles 29, 2 Chronicles 32, Isaiah 36, Isaiah 37, Jeremiah 39\nNotes\nReferences\nSources\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\nExternal links\n* Jewish translations:\n** [https://www.chabad.org/library/bible_cdo/aid/15925 Melachim II - II Kings - Chapter 19 (Judaica Press)] translation [with Rashi's commentary] at Chabad.org\n* Christian translations:\n** [http://www.gospelhall.org/bible/bible.php?passage=2+Kings+19 Online Bible at GospelHall.org] (ESV, KJV, Darby, American Standard Version, Bible in Basic English)\n** [http://www.biblegateway.com/passage/?book_id=12&chapter=19&version=9 2 Kings chapter 19. Bible Gateway]"
    }
  ]
}