{
  "content": [
    {
      "type": "text",
      "text": "# 2 Kings 2\n\n2 Kings 2 is the second chapter of the second part of the  Books of Kings in the Hebrew Bible or the Second Book of Kings in the Old Testament of the Christian Bible. The book is a compilation of various annals recording the acts of the kings of Israel and Judah by a Deuteronomic compiler in the seventh century BCE, with a supplement added in the sixth century BCE. The first part of this chapter (verses 1–18) records the appointment of Elisha to succeed Elijah, and Elijah's ascension to heaven, while the second part (verses 19–25) records some miraculous acts of Elisha showing that he has been granted power similar to Elijah's.\nText\nThis chapter was originally written in the Hebrew language and since the 16th century is divided into 25 verses.\nTextual witnesses\nSome early manuscripts containing the text of this chapter in Hebrew are of the Masoretic Text tradition, which includes the Codex Cairensis (895), Aleppo Codex (10th century), and Codex Leningradensis (1008).\nThere is also a translation into Koine Greek known as the Septuagint, made in the last few centuries BCE. Extant ancient manuscripts of the Septuagint version include Codex Vaticanus (B;  \\mathfrak{G}B; 4th century}}) and Codex Alexandrinus (A;  \\mathfrak{G}A; 5th century).}}\nAnalysis\nThe story of Elisha's inheritance of Elijah's prophetic power is placed in this chapter after the reign of Ahaziah is closed but before the reign of Jehoram opens, underscoring its importance, as the only account of a prophetic succession recorded in the Tanakh. It is also one of the two occasions (the other is at the death of Elisha; 13:14-21) that a story stands outside the narrated time (in the midst of, but separate from, the sequential and interlocking formulas of royal succession), setting \"prophetic over against royal power.\"\nThe narratives of this chapter recall the past history of Israel, with Elijah as a new Moses, Elisha as his Joshua, Ahab as Pharaoh, and when one son died (Passover), Elijah departs on the far side of Jordan (as Moses does), while Elisha crosses the Jordan back into the west bank ‘to carry on a conquest, significantly starting at Jericho’.\nStructure\nThis whole chapter has a chiastic structure,}}\nmapping the scenes of a journey and a return: Elijah and Elisha journeyed from Gilgal to Bethel to Jericho and then to the other side of the Jordan where the climactic ascent of Elijah occurs. Elisha then returned alone via Jericho, Bethel, Mount Carmel and ended in Samaria.\nThe diagram of the narratives is as follows:\n:A Elijah and Elisha leave Gilgal (2:1-2)\n::B Elijah and Elisha at Bethel (2:3-4)\n:::C Elijah and Elisha at Jericho (2:5-6)\n::::D Elijah and Elisha leave the sons of the prophets and cross the Jordan river (2:7-8)\n:::::X The ascent of Elijah (2:9-12a)\n::::D' Elisha crosses the Jordan River and confronts the sons of the prophets (2:12b-18)\n:::C' Elisha at Jericho (2:19-22)\n::B' Elisha at Bethel (2:23-24)\n:A' Elisha returns to Samaria (2:25)\nElisha's Appointment and Elijah's Ascension (2:1–18)\n(1832-1883), in: The Bible (1865).]]\nElijah's life was coming to an end with an ascension to heaven, one of the very few breaches of the \"wall of death\" in the Hebrew Bible/Old Testament.\nBecause he 'only departed rather than died', he was expected to return without the need of resurrection to 'announce the Messiah's arrival' as noted at the time of the New Testament (; ). Verses 2–6 indicate that Elijah, Elisha, and many prophet disciples were aware of Elijah's impending departure. While Elijah seems to wish to be alone when the time comes, Elisha wants to accompany him: he is to be 'a witness to the miracle and an heir to the master'. Elisha requested and was granted the inheritance of Elijah's 'spirit' (as 'the double portion due the eldest son', verse 9, cf. ), which is considered closest to 'the sphere of God' (cf. Judges 3:10; 14:6; 1 Samuel 10:10; 11:6; Isaiah 11:2, among others). Elisha also inherits Elijah's mantle, one of the older prophet's hallmark (1 Kings 19:13, 19; cf. 2 Kings 1:8), which is also proved to have magical powers (both Elijah and Elisha could divide the river Jordan with it, reminding us of Moses' division of the Red Sea in Exodus 14:21). The military title of honor, 'chariot of Israel and its horsemen' (verse 12; or \"horses\"), is also applied to Elisha (2 Kings 13:14) in relation to wartime successes achieved by the kingdom of Israel with his help (the later acts of Elisha are recorded mainly in 2 Kings 3; 6–7).\nVerse 1\n:Then when the Lord was about to take Elijah up to heaven by a whirlwind, Elijah went with Elisha from Gilgal.\nThe first clause of the opening verse summarizes the events to happen, whereas the second one relates the beginning of the journey that leads up to it. Since the start, YHWH is 'named as the subject of this occurrence' with săarah (\"storm, whirlwind\"; often associated with theophany, such as in ) as the agent of Elijah's ascent. Elisha is mentioned for the first time since Elijah chose him (), accompanying the prophet from Gilgal (probably north of Beth-el) and setting up the conflict between the two in the next three scenes as Elijah insists that he journey alone, while Elisha swears to follow.\nVerse 9\n:And so it was, when they had crossed over, that Elijah said to Elisha, \"Ask! What may I do for you, before I am taken away from you?\"\n:Elisha said, “Please let a double portion of your spirit be upon me.”\n*\"Double portion\": from , -, \"double mouth\", referring to the portion inherited by the firstborn son (), marking Elisha as the preeminent one among the \"sons of the prophet\". According to Jewish tradition, Elisha performed twice as many miracles as Elijah (by one count: 16 to 8).\nVerse 11\n:Then it happened, as they continued on and talked, that suddenly a chariot of fire appeared with horses of fire, and separated the two of them; and Elijah went up by a whirlwind into heaven.\n*\"That suddenly a chariot of fire appeared with horses of fire\": from Hebrew: , wə- - wə- , “and look, a chariot of fire and horses of fire.”\nThe early acts of Elisha: bringing life and death (2:19-25)\nin Jericho (also known as \"Elisha's Spring\"), believed to be the fountain purified by Elisha in 2 Kings 2:19–22, now inside a protective building.]]\nThis section records some of Elisha's first actions, confirming that 'Elisha has the same power to perform miracles as Elijah before him'. The spring named after Elisha (attributed to the miracle recorded in verses 19–22) can still be seen today at the oasis in Jericho with its fresh and abundant life-giving water. By stark contrast, ridiculing prophets can cost lives (verses 23–24; cf. 2 Kings 1:9–14; another 42 deaths are by Jehu in 2 Kings 10:12–14).\nVerse 23,24\n:Then he went up from there to Bethel; and as he was going up the road, some young boys came from the city and mocked him, and said to him, \"Go up, you baldhead! Go up, you baldhead!\" So he turned around and looked at them, and pronounced a curse on them in the name of the Lord. And two female bears came out of the woods and mauled forty-two of the youths.\n*\"Youths\": from the Hebrew phrase: ,  ,  which can be translated as “young boys,” “youths,” or “subordinates,” depending on context. Since Bethel was the site of the golden calf shrine built by Jeroboam, some believe that the context suggests that the phrase does not refer to \"children\" but to those serving (similar to the \"Levites\") in the idolatrous shrine. However, more translations interpret “na’ar” in 2 Kings 2:23 as “children,” while the phrase “ûn'äriym q'ţaNiym” found in 2 Kings 2:23 is translated into English as “little children” or “young/small/little boys” in a majority of BibleGateway’s English translations.\nSee also\n*Related Bible parts: 1 Kings 19, 2 Kings 3, 2 Kings 6\nNotes\nReferences\nSources\n*\n*\n*\n*\n*\n*\n*\n*\nExternal links\n* Jewish translations:\n** [https://www.chabad.org/library/bible_cdo/aid/15908 Melachim II - II Kings - Chapter 2 (Judaica Press)] translation [with Rashi's commentary] at Chabad.org\n* Christian translations:\n** [http://www.gospelhall.org/bible/bible.php?passage=2+Kings+2 Online Bible at GospelHall.org] (ESV, KJV, Darby, American Standard Version, Bible in Basic English)\n** [http://www.biblegateway.com/passage/?book_id=12&chapter=2&version=9 2 Kings Chapter 2. Bible Gateway]"
    }
  ]
}