{
  "content": [
    {
      "type": "text",
      "text": "# 2 Kings 21\n\n2 Kings 21 is the twenty-first chapter of the second part of the  Books of Kings in the Hebrew Bible or the Second Book of Kings in the Old Testament of the Christian Bible. The book is a compilation of various annals recording the acts of the kings of Israel and Judah by a Deuteronomic compiler in the seventh century BCE, with a supplement added in the sixth century BCE. This chapter records the events during the reign of Manasseh and Amon, the kings of Judah.\nText\nThis chapter was originally written in the Hebrew language. It is divided into 26 verses.\nTextual witnesses\nSome early manuscripts containing the text of this chapter in Hebrew are of the Masoretic Text tradition, which includes the Codex Cairensis (895), Aleppo Codex (10th century), and Codex Leningradensis (1008).\nThere is also a translation into Koine Greek known as the Septuagint, made in the last few centuries BCE. Extant ancient manuscripts of the Septuagint version include Codex Vaticanus (B;  \\mathfrak{G}B; 4th century) and Codex Alexandrinus (A;  \\mathfrak{G}A; 5th century).}}\nOld Testament references\n*:\n*:\n*:\nAnalysis\nA parallel pattern of sequence is observed in the final sections of 2 Kings between 2 Kings 11–20 and 2 Kings 21–25, as follows:\n:A. Athaliah, daughter of Ahab, kills royal seed (2 Kings 11:1)\n::B. Joash reigns (2 Kings 11–12)\n:::C. Quick sequence of kings of Israel and Judah (2 Kings 13–16)\n::::D. Fall of Samaria (2 Kings 17)\n:::::E. Revival of Judah under Hezekiah (2 Kings 18–20)\n:A'. Manasseh, a king like Ahab, promotes idolatry and kills the innocence (2 Kings 21)\n::B'. Josiah reigns (2 Kings 22–23)\n:::C'. Quick succession of kings of Judah (2 Kings 24)\n::::D'. Fall of Jerusalem (2 Kings 25)\n:::::E'. Elevation of Jehoiachin (2 Kings 25:27–30)\nManasseh king of Judah (21:1–18)\nThe passage recording the reign of Manasseh consists of the 'introductory regnal form' (verses 1–3), the body/regnal account (verses 4–16; with major subunits in verses 4–5, 6–8, 9–15 and 16, each in the waw-consecutive narrative form) and the 'concluding regnal form' (verses 17–18). Manasseh's 55-year reign is the longest of all the kings of Judah, but in the Books of Kings he is considered the worst king of the southern kingdom. Manasseh behaved like Ahab, the king of Israel in Samaria:\n# Introducing the worship of Baal and Asherah to Jerusalem (cf. verses 3, 7 with 1 Kings 16:32–33).\n# Shedding innocent blood (cf. verse 16 with 1 Kings 18:4; 19:10; 21)\n# Strongly opposed by prophets (verses 10–15; Ahab by Elijah).\nLater, his grandson, king Josiah, must abolish all the deities reintroduced by Manasseh (cf. 2 Kings 23).\nManasseh was Assyria's vassal, that Assyrian sources mention as 'a bringer of tribute and as a military follower', without the slightest indication of resistance. This might be the reason for the length of his reign.\nVerse 1\ns were stamped on the handles of large storage jars mostly in and around Jerusalem during the reign of King Hezekiah (circa 700 BC) in Hecht Museum, Israel.]]\n:''Manasseh was twelve years old when he began to reign, and he reigned fifty-five years in Jerusalem. His mother's name was Hephzibah.''\n* Cross reference: 2 Chronicles 33:1\n*\"Reigned fifty-five years\": in Thiele's chronology (improved by McFall), Manasseh became coregent (while his father was still the king) in September 697 BCE and became the sole king between September 687 and September 686 BCE until he died between September 643 and September 642 BCE.\nTwo seals appeared on the antiquities market in Jerusalem (first reported in 1963), both bearing the inscription, \"Belonging to Manasseh, son of the king.\"  As the term \"son of the king\" refers to royal princes, whether they eventually ascended the throne or not, the seal is considered to be Manasseh's during his co-regency with his father. It bears the same iconography of the Egyptian winged scarab as the seals attributed to King Hezekiah, recalling the alliance between Hezekiah and Egypt against the Assyrians (; ), and may symbolize 'a desire to permanently unite the northern and southern kingdoms together with God's divine blessing'.\nJar handles bearing  a stamp with a winged-beetle and the phrase LMLK (\"to the king\"), along with the name of a city, have been unearthed throughout ancient Judah as well as in a large administrative complex discovered outside of the old city of Jerusalem and used to hold olive oil, food, wine, etc. – goods that were paid as taxes to the king, dated to the reigns of Hezekiah (cf. \"Hezekiah's storehouses\"; ) and Manasseh. These artifacts provide the evidence of 'a complex and highly organized tax system in Judah' from the time of Hezekiah extending into the time of Manasseh, among others to pay the tribute to the Assyrians.\nAmon, king of Judah (21:19–26)\nAmon, Manasseh's son and successor, is recorded to have 'walked in the way\nwhich his father walked' (verse 21), but, unlike his father, he had a short period of reign. Then, 'the people of the land'—the same political group\nwho brought down the 'evil' queen Athaliah, enabling the 'good' king Joash to seize the throne (2 Kings 11:18, 20)—intervene to 'punish the king's murderers' and place Josiah, Amon's son, on the throne.\nVerse 19\n:''Amon was twenty-two years old when he began to reign, and he reigned two years in Jerusalem. His mother's name was Meshullemeth the daughter of Haruz of Jotbah.''\n* Cross reference: 2 Chronicles 33:21\n*\"Reigned two years\": in Thiele's chronology (improved by McFall), Amon became king between September 643 and September 642 BCE and died between September 641 and September 640 BCE.\nArchaeology\nBM 91028.]]\nwith translation of the First Assyrian Conquest of Egypt, 643 BCE.]]\nManasseh and the kingdom of Judah are only mentioned in the list of subservient kings/states in Assyrian inscriptions of Esarhaddon and Ashurbanipal. Manasseh is mentioned in the Esarhaddon Prism (dates to 673–672 BCE), discovered by archaeologist Reginald Campbell Thompson during the 1927–28 excavation season at the ancient Assyrian capital of Nineveh. The 493 lines of cuneiform inscribed on the sides of the prism describe the history of King Esarhaddon's reign and an account of the reconstruction of the Assyrian palace in Babylon, which reads \"Together 22 kings of Hatti [this land includes Israel], the seashore and the islands. All these I sent out and made them transport under terrible difficulties\"; one of these 22 kings was King Manasseh of Judah (\"Menasii šar [âlu]Iaudi\").\nA record by Esarhaddon's son and successor, Ashurbanipal, mentions \"Manasseh, king of Judah\" who contributed to the invasion force against Egypt. This was recorded on the \"Rassam cylinder\" (or \"Rassam Prism\", now in the British Museum), named after Hormuzd Rassam, who discovered it in the North Palace of Nineveh in 1854. The ten-faced, cuneiform cylinder contains a record of Ashurbanipal's campaigns against Egypt and the Levant, that involved 22 kings \"from the seashore, the islands and the mainland\", who are called \"servants who belong to me\", clearly denoting them as Assyrian vassals. Manasseh was one of the kings who 'brought tribute to Ashurbanipal and kissed his feet'.\nIn rabbinic literature on \"Isaiah\" and Christian pseudepigrapha \"Ascension of Isaiah\", Manasseh is accused of executing the prophet Isaiah, who was identified as the maternal grandfather of Manasseh.\nManasseh is mentioned in chapter 21 of 1 Meqabyan, a book considered canonical in the Ethiopian Orthodox Tewahedo Church, where he is used as an example of ungodly king.\nSee also\n* Related Bible parts: 2 Kings 11, 2 Kings 23, 2 Chronicles 33\nNotes\nReferences\nSources\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\nExternal links\n* Jewish translations:\n** [https://www.chabad.org/library/bible_cdo/aid/15927 Melachim II - II Kings - Chapter 21 (Judaica Press)]. Hebrew text and English translation [with Rashi's commentary] at Chabad.org\n* Christian translations:\n** [http://www.gospelhall.org/bible/bible.php?passage=2+Kings+21 Online Bible at GospelHall.org] (ESV, KJV, Darby, American Standard Version, Bible in Basic English)\n** [http://www.biblegateway.com/passage/?book_id=12&chapter=21&version=9 2 Kings chapter 21. Bible Gateway]"
    }
  ]
}