{
  "content": [
    {
      "type": "text",
      "text": "# 2 Kings 15\n\n2 Kings 15 is the fifteenth chapter of the second part of the  Books of Kings in the Hebrew Bible or the Second Book of Kings in the Old Testament of the Christian Bible. The book is a compilation of various annals recording the acts of the kings of Israel and Judah by a Deuteronomic compiler in the seventh century BCE, with a supplement added in the sixth century BCE. This chapter records the events during the reigns of Azariah (Uzziah) and his son, Jotham, the kings of Judah, as well as of Zechariah, Shallum, Menahem, Pekahiah and Pekah, the kings of Israel. Twelve first verses of the narrative belong to a major section 2 Kings 9:1–15:12 covering the period of Jehu's dynasty.\nText\nThis chapter was originally written in the Hebrew language. It is divided into 38 verses.\nTextual witnesses\nSome early manuscripts containing the text of this chapter in Hebrew are of the Masoretic Text tradition, which includes the Codex Cairensis (895), and Codex Leningradensis (1008).}}\nThere is also a translation into Koine Greek known as the Septuagint, made in the last few centuries BCE. Extant ancient manuscripts of the Septuagint version include Codex Vaticanus (B;  \\mathfrak{G}B; 4th century) and Codex Alexandrinus (A;  \\mathfrak{G}A; 5th century).}}\nStructure\nThis chapter can be divided into the following sections:\n* : Regnal account of Azariah (Uzziah) ben Amaziah of Judah\n* : Regnal account of Zechariah ben Jeroboam of Israel\n* : Regnal account of Shallum ben Jabesh of Israel\n* : Regnal account of Menahem ben Gadi of Israel\n* : Regnal account of Pekahiah ben Menahem of Israel\n* : Regnal account of Pekah ben Remaliah of Israel\n* : Regnal account of Jotham ben Uzziah of Judah\nAnalysis\nThis chapter displays a contrast between the stability of the southern kingdom and the downward sliding of the northern kingdom, with two royal records of Judah bracketing the narrative of five Israel kings in quick succession. Each reign is judged using a standard formula, one for the kings of Judah (verses , ) and another for the kings of Israel (verses , , , ).\nAzariah (Uzziah), king of Judah (15:1–7)\nThe regnal records of Azariah the son of Amaziah, the king of Judah, can be demarcated by the introductory form (verses 1–4) and the concluding form (verses 5–7). The main account is in verse 5 regarding the king's leprosy and the active role of his son, Jotham, in ruling the kingdom on his behalf, but the length of the co-regency is not explicitly recorded. The period of his reign coincides largely with the reign of Jeroboam, who ruled over a kingdom territory comparable to that of Solomon, so Azariah's kingdom was a vassal to the kingdom of Israel.   provides a more detailed account of Azariah's reign, especially the reason God striking him with leprosy, his 'military actions against Philistia, the Arabs of Geur-Baal, and  the Meunites', as well as 'his efforts to fortify Jerusalem and to secure the hold on the Shephelah.'\nVerse 1\n:In the twenty-seventh year of Jeroboam king of Israel, Azariah the son of Amaziah, king of Judah, began to reign.\n*\"In the 27th year of Jeroboam\": According to Thiele's chronology, following \"accession year method\", Azariah the son of Amaziah of Judah started to reign alone as the 10th king of Judah between April and September 767&nbsp;BCE, following a period of co-regency (since the capture of Amaziah by Joash of Israel).\nVerse 2\n:He was sixteen years old when he became king, and he reigned fifty-two years in Jerusalem. His mother’s name was Jecholiah of Jerusalem.\n*Cross reference: 2 Chronicles 26:3\n*\"He reigned 52 years\": according to Thiele's chronology, following the \"accession year method\", Azariah became king at the age of 16 when his father, Amaziah, was taken as hostage to the kingdom of Israel in 791&nbsp;BCE, as a co-regent until his father's death between April and September 767&nbsp;BCE, when he ruled alone at the age of 39, until his death between September 740&nbsp;BCE and September 739&nbsp;BCE at the age of 68.\n*\"Jecholiah of Jerusalem\" (also written as \"Jecoliah\" (ESV) or \"Jekoliah\" (MEV)) could be arranged as a wife for Amaziah to 'consolidate Amaziah's hold on Jerusalem following a failed attempt at revolt'.\nVerse 5\n:''And the Lord touched the king, so that he was a leper to the day of his death, and he lived in a separate house. And Jotham the king's son was over the household, governing the people of the land.''\n*\"A leper\": suffered from \"leprosy\", which was a 'term for several skin diseases' (cf. ). As a leper, Azariah was deemed impure (), and unfit to carry out the state functions or to appear at the temple.\n*\"A separate house\": from , bet hakhofshit; the meaning is uncertain. The Torah commands lepers to live apart from the population ().\nVerse 7\n:And Azariah slept with his fathers, and they buried him with his fathers in the city of David, and Jotham his son reigned in his place.\nThe time of Azariah's death coincides with the time Isaiah received his call to be a prophet (\"in the year that King Uzziah died\"; Isaiah 6:1).\nE.L. Sukenik found an Aramaic inscription that reads, \"Here were brought the bones of Uzziah, king of Judah. Do not open!\" and once marked the tomb of Uzziah outside Jerusalem.\nZechariah, king of Israel (15:8–12)\nZechariah, the last ruler of the Jehu dynasty, only reigned for six months  and his assassination ends a long period of stability in the kingdom of Israel. It is set in the frame of the divine guidance that God himself announced to the founder of the dynasty (2 Kings 10:30) and confirms the fulfillment of it in verse 12.\nVerse 8\n:In the thirty-eighth year of Azariah king of Judah, Zechariah the son of Jeroboam reigned over Israel in Samaria six months.\n*\"In the 38th year of Azariah\": based on Thiele's chronology, McFall determines that Jeroboam should have died between the month Elul (6th month; August/September) and Tishrei (7th month; September/October) 753&nbsp;BCE, and immediately was succeeded by Zechariah, his son, while still counted as the 38th year of Azariah (which was calculated from Tishrei to Tishrei or September to September).\n*\"Six months\": Zechariah's assassination happened probably in the early months of 752&nbsp;BCE (before 1 Nisan 752&nbsp;BCE), which is counted as the 39th year of Azariah.\nVerse 10\n:And Shallum the son of Jabesh conspired against him, and smote him before the people, and slew him, and reigned in his stead\n*\"Before the people\" (KJV, ASV, NASB, NIV, NRSV, NLT): from the Masoretic Hebrew text , qaval ʿam. Lucian's Greek version reads “in Ibleam” ( beyivleʿam (cf. NAB, TEV), the location where Ahaziah of Judah is slain by Jehu (2 Kings 9:27), which provides a certain irony when Zechariah, the last of Jehu's dynasty, was also slain in the same place. The Greek Septuagint text in Codex Vaticanus and some Hebrew text reads Keblaʿam.\nVerse 12\n:This was the word of the Lord which He spoke to Jehu, saying, “Your sons shall sit on the throne of Israel to the fourth generation.” And so it was.\n*\"To the fourth generation\": a fulfillment of the word of YHWH in 2 Kings 10:30 that Jehu and four generations of his descendants (Jehoahaz, Jehoash, Jeroboam II, and Zechariah) ruled from approximately 814-753 BCE; Jehu's dynasty ended when Shallum assassinated Zechariah in 753 BCE.\nShallum, king of Israel (15:13–16)\nAfter bringing an end to the Jehu dynasty (verse 10), Shallum could only reign for a month before he was slain by Menahem. The literary structure consists of an 'introductory regnal form' (verse ), the body of the account (verse 14) and the 'concluding regnal form' (verse ). Menahem's submission to Assyria (verses ) suggests that his action was to stop an attempt to revolt against the Assyrian by Shallum.\nMenahem, king of Israel (15:17–22)\nThe 10-year reign of Menahem provides a 'rare period of stability' in the final years of the northern kingdom, which was the result of Menahem's tributary payment to the Assyrian king, Tiglath-Pileser III (also known as Pul, cf. ANET 272). The tribute, along with those from other monarch, is listed with Menahem's name explicitly in the annals of the Assyria (ANET 283–284). To pay that tribute, Menahem instituted an oppressive tax, fifty shekels (about 1 pounds, or 575 grams) of silver per person from all the wealthy men in Israel (verse 20), which may contribute to the coup against his son after he died.\nVerse 17\n:In the thirty-ninth year of Azariah king of Judah, Menahem the son of Gadi began to reign over Israel, and he reigned ten years in Samaria.\n*\"In the 39th year of Azariah\": based onThiele's chronology, Menahem would start to reign by the end of April 752&nbsp;BCE and died between September 742&nbsp;BCE and April 741&nbsp;BCE after sitting on the throne for 10 years.\nVerse 19\n\", king of Assyria. Stone panel, Assyrian artwork, ca. 728&nbsp;BC. From the Central Palace in Nimrud.]]\n:And Pul the king of Assyria came against the land: and Menahem gave Pul a thousand talents of silver, that his hand might be with him to confirm the kingdom in his hand.\n*\"Assyria\": from this verse to the end of the book, Assyria is mentioned 48 times (12 times 4), replacing Aram as the principal threat to the northern kingdom (Aram essentially disappears after 2 Kings 16, except one brief mention in ).\n*\"1000 talents\" of metal: is about 38 tons, or 34 metric tons. One talent was about 75 pounds or 34 kilograms.\nTiglath-Pileser records the tribute from Menahem in one of his inscriptions (ANET 283).\nPekahiah, king of Israel (15:23–26)\nThe main regnal account of Pekahiah, the 17th king of Israel, only mentions his assassination by a group of 50 men from Gilead led by Pekah ben Remaliah, his own captain (verse 25).\nVerse 23\n:In the fiftieth year of Azariah king of Judah Pekahiah the son of Menahem began to reign over Israel in Samaria, and reigned two years.\n*\"In the 50th year of Azariah\": based onThiele's chronology, Pekahiah would start to reign between September 742&nbsp;BCE and April 741&nbsp;BCE after the death of his father, Menahem.\n*\"Two years\": Pekahiah would have died between September 740&nbsp;BCE and April 739&nbsp;BCE based on the accession year method in Thiele's chronology.\nPekah, king of Israel (15:27–31)\nThe main record of Pekah's reign in this section focuses on the invasion of Tiglath-Pileser III into Israel in 734–732&nbsp;BCE and his murder in a coup led by Hosea ben Elah, backed by the Assyrians, as noted in the annals of Assyria (ANET 284). Pekah's alliance with Rezin of Damascus in the Syro-Ephraimite War to resist the Assyrians and attack Judah, a vassal to the Assyrians, is recorded in multiple passages (verse 37, 2 Kings 16:5, 7–9; Isaiah 7:1–17; Isaiah 9:1) and also in the annals of the Assyrians (ANET 283–284).\nVerse 27\n:In the fifty-second year of Azariah king of Judah, Pekah the son of Remaliah became king over Israel in Samaria, and reigned twenty years.\n* \"In the 52nd year of Azariah\": based on Thiele's chronology, Pekah reign as a sole king in Samaria between September 740&nbsp;BCE and April 739&nbsp;BCE after the death of Pekahiah, but he may have been considered to reign together with Menahem 12 years earlier.\n* \"Reigned 20 years\": Thiele-McFall chronology maintains that Pekah started to reign together with Menahem since the 29th year of Azariah at the end of Nisan (April) 752&nbsp;BCE, and was a sole king starting between September 740&nbsp;BCE and April 739&nbsp;BCE  for 8 years until his death between September 732&nbsp;BCE and April 731&nbsp;BCE, so the total years of his reign is 20 years.\nJotham, king of Judah (15:32–38)\nLike his father (Azariah or Uzziah), Jotham was given a good assessment 'in the sight of the ' (verse 34; cf. verse 3), although both kings did not remove the 'high places', which was later done by Hezekiah () and Josiah (), nor perform notable political actions. Jotham's memorable achievement was the building of 'the upper gate of the house of the LORD' (verse ).\nVerse 32\n:In the second year of Pekah the son of Remaliah, king of Israel, Jotham the son of Uzziah, king of Judah, began to reign.\n*Cross reference:\n*\"'In the 2nd year of Pekah\": According to Thiele-McFall chronology, Jotham started co-regency with his father, Uzziah, around April 750&nbsp;BCE, when Uzziah became a leper, and only reign as sole king after Uzziah's death between September 740&nbsp;BCE and September 739&nbsp;BCE, until he stepped down around September 735&nbsp;BCE (16th year of his reign), but still held some state functions until his death around April 731&nbsp;BCE (20th year of \"his reign\"). The synchronization with Hosea's reign indicates that Jotham died between September 732&nbsp;BCE and September 731&nbsp;BCE. Thiele notes that the year of Jotham's ascension on the throne is counted as the \"first regnal year\" (not the \"ascension year\") as usually used for co-regency. However, the information that it starts on the 2nd year of Pekah indicates that the ascension occurred between Nisan (April) and Tishrei (September) 750&nbsp;BCE, not as usual in the month of Tishrei for the kings of Judah.\nVerse 33\n:''He was twenty-five years old when he began to reign, and he reigned sixteen years in Jerusalem. His mother's name was Jerusha the daughter of Zadok.''\n*Cross references: 2 Chronicles 27:1,\n* \"16 years\": according to Thiele's chronology, Jotham started to reign at the age of 25 in co-regency with his father, Uzziah (57 years old), around April 750&nbsp;BCE, and became a sole king between September 740&nbsp;BCE and September 739&nbsp;BCE, after Uzziah's death (68 years old). Jotham transferred the throne to his son, Ahaz, around September 735&nbsp;BCE to conclude his reign for a total of 16 years. However, Jotham seems to hold some state functions until April 731&nbsp;BCE, while Ahaz officially was on the throne, resulting a phrase \"in the 20th year of Jothan\") in the synchronization with the reign of Hosea in the kingdom of Israel (verse ), despite the official count of 16 years of Jotham's reign. Jotham died between September 732&nbsp;BCE and  September 732&nbsp;BCE. A royal bulla (seal) with the inscription: “Belonging to Ahaz (son of) Yehotam (=Jotham), King of Judah” was discovered and authenticated.\n*\"Jerusha\": written as \"Jerushah\" in 2 Chronicles 27:1.\nSee also\n* Related Bible parts: 2 Kings 10, 2 Kings 13, 2 Kings 14, 2 Chronicles 26, 2 Chronicles 27\nNotes\nReferences\nSources\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\nExternal links\n* Jewish translations:\n** [https://www.chabad.org/library/bible_cdo/aid/15921 Melachim II - II Kings - Chapter 15 (Judaica Press)] translation [with Rashi's commentary] at Chabad.org\n* Christian translations:\n** [http://www.gospelhall.org/bible/bible.php?passage=2+Kings+15 Online Bible at GospelHall.org] (ESV, KJV, Darby, American Standard Version, Bible in Basic English)\n** [http://www.biblegateway.com/passage/?book_id=12&chapter=15&version=9 2 Kings chapter 15. Bible Gateway]"
    }
  ]
}