{
  "content": [
    {
      "type": "text",
      "text": "# 2nd Canadian Division during World War II\n\n|allegiance=\n|branch= Canadian Army\n|type=Infantry\n|role=\n|size=Division\n|command_structure=\n|garrison=\n|ceremonial_chief=\n|colonel_of_the_regiment=\n|nickname=\n|patron=\n|motto=\n|colors=\n|march=\n|mascot=\n|battles= World War II\n* Dieppe Raid\n* Caen\n* Verrières Ridge\n* Cintheaux\n* Falaise\n* The Scheldt\n* The Rhineland\n* Battle of Groningen\n|notable_commanders= John RobertsCharles FoulkesBruce Matthews\n|identification_symbol=alt=A rectangular organizational symbol\n|identification_symbol_label=Formation patch\n|anniversaries=\n}}\nThe 2nd Canadian Division, an infantry division of the Canadian Army, was mobilized for war service on 1September 1939 at the outset of World War II. Adopting the designation of the 2nd Canadian Division, it was initially composed of volunteers within brigades established along regional lines, though a halt in recruitment in the early months of the war caused a delay in the formation of brigade and divisional headquarters. With questions concerning overseas deployment resolved, the division's respective commands were formed in May and June 1940, and at British Prime Minister Winston Churchill's request, the division was deployed to the United Kingdom between 1August and 25December 1940, forming part of the Canadian Corps.\nHaving performed well in training exercises during 1941 and early 1942, elements of the 2nd Division were selected as the main force for Operation Jubilee, a large-scale amphibious raid on the port of Dieppe in German-occupied France. On 19August 1942, with air and naval gunfire support, the division's 4th and 6th Infantry Brigades assaulted Dieppe's beaches. The Germans were well prepared and, despite being reinforced, the Canadians sustained heavy losses and had to be evacuated, with fewer than half their number returning to the United Kingdom.\nFollowing a period of reconstruction and retraining from 1942 to 1944, the division joined II Canadian Corps as part of the British Second Army for the Allied invasion of Normandy. The division was redesignated as 2nd Canadian Infantry Division in January 1943. The 2nd Division saw significant action from 20July to 21August in the battles for Caen and Falaise. Joining the newly activated headquarters of the First Canadian Army in the assault on northwestern Europe, the 2nd Canadian Infantry Division played a significant role in the retaking of the Channel Ports, the Battle of the Scheldt, and the liberation of the Netherlands.  The division was deactivated shortly after the end of the war.\nFormation, garrison duties and organization (1939–1940)\nAt the start of the Second World War, the Canadian Active Service Force (CASF) was initially composed of two divisions; the 1st and 2nd Canadian Infantry Divisions, both raised on 1September 1939. The fighting power of this force lay in its constituent infantry brigades, of which each division had three. These were in turn composed of three rifle and one machine gun battalion, with additional divisional artillery and engineer units in support.\nFormed under the command of Major-General Victor Odlum, a highly distinguished veteran of the First World War, with an authorized strength of between 13,000 and 17,000 personnel, the 2nd Canadian Infantry Division, like its sister formation, was originally organized along regional lines. Its 4th Brigade was composed of regiments from Ontario, the 5th Brigade of regiments from Quebec, and 6th Brigade of regiments from Western Canada. These were the same infantry brigades—although their constituent battalions were different—that had formed part of the 2nd Canadian Division during its service on the Western Front as part of the Canadian Expeditionary Force during the First World War.\nIt was over a year before the 2nd Division came together as a cohesive unit and, during the interim period between formation and arrival in the United Kingdom, many changes to its organization were made. The first brigade concentrations took place in May and June 1940, until which time all units had trained in their own garrisons. The 4th Brigade assembled at Camp Borden in Ontario, the 5th at Valcartier Camp in Quebec, and the 6th at Camp Shilo in Manitoba. The divisional artillery was concentrated at artillery training centres at Camp Petawawa in Ontario, and at Shilo.\nThe 2nd Division's structure was altered in early 1940, reducing its number of machine-gun battalions from three to one. The Camerons and the Chaudières (now a rifle battalion) were reassigned to the newly mobilized 3rd Canadian Infantry Division, and the Winnipeg Grenadiers were sent to Jamaica for garrison duty, after which they returned to Canada then redeployed to Hong Kong, where they were captured when it fell to the Japanese on 25December 1941.\nIn May 1940, The Black Watch were moved from Valcartier to Newfoundland, and in June, the 2nd Division was earmarked for garrison duty by the forces of the British Commonwealth, with the Royal Regiment of Canada and Les Fusiliers Mont Royal arriving in Iceland later that month. However, at the request of Winston Churchill, the British prime minister, these deployments were cut short, as the division was badly needed in England to supplement the British Army—then facing the imminent possibility of German invasion.\nAs a result, most of the 2nd Division's units were sent to the United Kingdom in August 1940, although the Iceland garrison remained in place until 31October. The absence of the Mont Royals allowed Odlum to reassign the Calgary Highlanders to the 5th Brigade in September, in an attempt to ethnically mix the brigades of the division. By late December 1940, the 2nd Canadian Division was joined with the 1st to form the Canadian Corps (later renamed to I Canadian Corps).\nTraining in the United Kingdom (1941)\nof the Calgary Highlanders' Sniper Platoon]]\nIn 1941, the Toronto Scottish Regiment was transferred from the 1st Division to become the machine-gun battalion of the 2nd Division. Around the same time, the 8th Reconnaissance Regiment (14th Canadian Hussars) was raised from 2nd Division personnel supplemented by reinforcements from Canada. Due to equipment shortages, it was often difficult to adequately supply newly arrived divisions in England. Artillery units had to make use of outmoded 75&nbsp;mm guns with steel tires, and a lack of anti-aircraft guns—diverted to civil defence during the height of the Battle of Britain—left Canadian units to fend for themselves with small arms. However, by February 1941, enough Bren guns had been issued to the infantry units and, by September, the artillery had been equipped with 25-pounder () howitzers, although signals equipment and transport were still lacking and anti-tank guns were dangerously scarce.\nWhen the division was not engaged in coastal-defence duties or unit training, formation-level training took the form of increasingly larger exercises. Exercise Waterloo, conducted from 14 to 16June 1941, was the largest in the United Kingdom to date, with ICanadian Corps counter-attacking an imagined German sea and air landing. Exercise Bumper, held from 29September to 3October, was larger still, involving 250,000 men. These exercises tended to concentrate on traffic control, communications, and logistical concerns, and were of little practical value to the infantry.\nOn 23December 1941, Major-General Harry Crerar was appointed as divisional commander, replacing Odlum who had ceased command in November, temporarily handing over to Major-General John Roberts. However, Crerar was appointed temporary corps commander the same day and as a result never actually fulfilled the role of divisional commander, with Roberts eventually being confirmed in the role in April 1942. Meanwhile, on 30December 1941, the Calgary Highlanders introduced \"battle drill\" to the division. This new type of training emphasized small unit tactics as well as \"hardening\" training through use of live ammunition, slaughterhouse visits, and obstacle courses, and was adopted throughout Commonwealth forces stationed in Britain.\nOperation Jubilee (1942)\nSoldiers' corpses from the 2nd Canadian Infantry Division following the Dieppe Raid\nIn early 1942, under Roberts, the 2nd Canadian Infantry Division participated in several additional full-scale combat exercises, again gauging the ability of Commonwealth divisions to repel a possible German invasion. As April and May progressed, the exercises intensified, becoming significantly more demanding on the participants. As a result, the 2nd Division was judged to be one of the four best divisions in the United Kingdom, and was selected as the primary force for the upcoming Allied attack on the German-occupied port of Dieppe—codenamed Operation Jubilee.  Mounted as a test of whether or not such a landing was feasible, the Dieppe raid was to be undertaken by the 4th and 6th Brigades, with additional naval, air, and infantry support. Significant elements of the 5th Brigade were also involved.\nOn 19August 1942, while British commando units attacked bunker positions on the outskirts of Dieppe, forces of the 2nd Division landed on four beaches. The easternmost, Blue Beach, which was at the foot of a sheer cliff, presented the most difficulties; the Royal Regiment of Canada, with a company of the Black Watch, was held at bay by two platoons of German defenders. Only six percent of the men that landed on Blue Beach returned to Britain.\nThe main beaches, codenamed White and Red, lay in front of Dieppe itself. Making only minor gains, the majority of the 4th and 6th Brigades became pinned down on the beach, and despite the arrival of an armoured squadron from the Calgary Tank Regiment, casualties were heavy. Reinforcements from the Mont Royals had little effect, and surviving forces were withdrawn by 11:00. Of the nearly 5,000 Canadian troops that participated, more than half were killed, wounded or captured.\nAt Green Beach to the west, part of the South Saskatchewan Regiment was landed on the wrong side of the Scie River, necessitating an assault over the machine gun swept bridge there so they could assault the cliffs on the west. The village of Pourville was captured but the eastern cliffs proved impossible to capture so blocking their assault on an artillery battery and a radar station. The Queen's Own Cameron Highlanders were landed with the objective of moving south to attack an airfield and a divisional HQ. Neither battalion was able to achieve their objectives. As with the other three beaches, casualties among the Canadians were high with 160 fatalities.\nRebuilding (1942–1944)\nThroughout 1943, the 2nd Division focused on rebuilding its ranks, having lost close to half its strength at Dieppe. In April 1943, Major-General Guy Simonds—the first officer to command the division who had not served in the Great War—assumed command of the division, taking over from Roberts, before handing over the following month to Major-General E. L. M. Burns. In January 1944, Major-General Charles Foulkes—another officer who, like Simonds, had been too young to serve in the Great War—replaced Burns, who went to Italy to command I Canadian Corps, where it had been deployed towards the end of 1943. The following month, all three brigade commanders were replaced as part of a general move to modernize the Canadian forces' higher echelons; further sweeping changes throughout all levels of command, coupled with the lingering effects of the large influx of new personnel during 1943, lowered morale in the division. However, in March 1944, training again intensified, heralding the coming invasion of Europe. On 9March, the 2nd Division was inspected by King George VI, and by May the division numbered close to 18,000 fully equipped and trained soldiers. When D-Day arrived on 6June 1944, the main Canadian assault was led by the 3rd Canadian Infantry Division, while the 2nd Division was held in reserve. At this time, the division consisted of three brigades—4th, 5th and 6th—each of three infantry battalions, and a brigade ground defence platoon provided by Lorne Scots. In addition, at divisional level there was a machine gun battalion and a reconnaissance regiment provided by the Toronto Scottish Regiment (machine gun) and 8th Reconnaissance Regiment (14th Canadian Hussars), as well as various combat support and service support elements including field, anti-tank and anti-aircraft artillery, field engineers, electrical and mechanical engineers, and signals, medical, ordnance, service corps troops and provosts.\nBattle of Normandy\nThe attack on Juno Beach by the 3rd Canadian Infantry Division was the most successful of the five beaches attacked on D-Day, 6June 1944. Having successfully landed in Normandy, Allied forces soon became embroiled in battles against German armour and were unable to significantly expand their beachhead; by the time the 2nd Division came ashore at the end of the first week of July, the entire front had congealed. Assigned to the II Canadian Corps, and subordinated to the British Second Army, the division assembled its brigades for combat while British and Canadian forces launched Operation Charnwood. It was a tactical success, but could not clear all Caen of its German defenders. Although originally a D-Day objective, Caen proved a difficult prize, holding out until 19July when it finally fell to British troops during Operation Goodwood. In the aftermath, General Bernard Montgomery, commander of the Anglo-Canadian 21st Army Group, ordered elements of II Canadian Corps, commanded by Lieutenant-General Guy Simonds, to push forward towards Verrières Ridge, the dominant geographical feature between Caen and Falaise. By keeping up the pressure, Montgomery hoped to divert German attention away from the American sector to the west.\nOperation Atlantic\nOperation Atlantic, launched on 18July alongside Goodwood, had the objectives of securing the western bank of the Orne River and Verrières Ridge. The 2nd Division's 5th and 6th Brigades were selected as the assaulting forces, with the 5th Brigade focusing on the Orne and the 6th on Verrières. The 4th Brigade were tasked with securing the flank of the operation, and the Royal Regiment of Canada attacked Louvigny on 18July. Early on 19July, the Calgary Highlanders seized Point 67, directly north of Verrières Ridge, and the following morning the Royal Highland Regiment of Canada crossed the Orne River and secured the flanks of the advance. In the afternoon, the 6th Brigade's South Saskatchewan Regiment attacked the well-entrenched German positions on the ridge, with support from Typhoon fighter-bombers and tanks. However, the attack ran into torrential rain, and the Germans counterattacked in force. This and further German attacks inflicted heavy casualties on the South Saskatchewan Regiment and its supporting battalions, the Essex Scottish Regiment and the Queen's Own Cameron Highlanders of Canada. On 21July, the 5th Canadian Infantry Brigade reinforced Canadian positions on Point 67. In two days of fighting, the division suffered 1,349 casualties.\nOperation Spring\nOn 22July 1944, Montgomery elected to use the Anglo-Canadian forces south of Caen in an all-out offensive aimed at breaking the German defensive cordon keeping his forces bottled up in Normandy. To meet Montgomery's objectives, General Simonds was ordered to design a large breakout assault, codenamed Operation Spring. The attack was planned in three tightly timed phases of advance, pitting two Canadian and two British divisions against three German SS-Panzer divisions, which would be launched in conjunction with an American offensive, Operation Cobra, scheduled to take place on 25July 1944.\nThe 4th Brigade attacked in the east with some success, taking Verrières village itself, but were repulsed at Tilly-la-Campagne by German counterattacks. The 5th Brigade, in the centre, made a bid for Fontenay-le-Marmion; of the 325 members of the Black Watch who left the start-lines, only 15 answered evening roll-call. German counterattacks on 26 and 27July pushed Canadian forces back to Point 67. However, the situation eventually eased for the 2nd Canadian Division when US forces went on the offensive. Throughout the first week of August, significant German resources were transferred from the Anglo-Canadian front to that of the U.S. Third Army, under Lieutenant-General George Patton, while reinforcements moved from Pas de Calais to the Falaise–Calvados area. By 7August 1944, only one major formation—the 12th SS Panzer Division Hitlerjugend—faced Canadian forces on Verrières Ridge.\nOperation Totalize\nBy 1August 1944, the British had made significant gains on the Vire and Orne Rivers during Operation Bluecoat, while the Americans had achieved a complete breakthrough in the west. On 4August, Simonds and General Harry Crerar—newly appointed commander of the First Canadian Army—were given the order to prepare an advance on Falaise. Three days later, with heavy bomber support, Operation Totalize began, marking the first use of Kangaroo Armoured Personnel Carriers. While the 3rd Canadian Infantry Division attacked east of the Caen–Falaise Road, 2nd Division attacked to the west. By noon Verrières Ridge had finally fallen, and Canadian and Polish armour was preparing to exploit south towards Falaise. However, strong resistance by the 12th SS Panzer Division and the 272nd Volksgrenadier Division halted the advance. Although 12&nbsp;km (7.5&nbsp;mi) of ground had been gained, Canadian forces had failed to reach Falaise itself.\nSimultaneously, the Germans had launched Operation Luttich, a desperate and ill-prepared armoured thrust towards Mortain, beginning on 6August 1944. This was halted within a day and, despite the increasingly dangerous threat presented by the Anglo–Canadian advance on Falaise, the German commander Field Marshal Günther von Kluge was prohibited by Hitler from redeploying his forces. Thus, as American armoured formations advanced towards Argentan from the south, the Allies were presented with an opportunity to encircle large sections of the German Seventh Army. The First Canadian Army was ordered south, while the Americans prepared to move on Chambois on 14August. Simonds and Crerar quickly planned a further offensive that would push through to Falaise, trapping the German Seventh Army in Normandy.\nOperation Tractable\nOn 14August, the First Canadian Army launched Operation Tractable with the aim of capturing Falaise and achieving a linkup with American forces in Chambois. A daylight attack was executed after artillery provided smoke-screen cover and medium bombers softened up the German defences. The offensive was largely successful and, although the 2nd Division was not an active participant, divisional troops entered Falaise on 16August as the remainder of First Canadian Army moved south-east towards Trun and Chambois. By 21August the remnants of the battered German Seventh Army had surrendered in the Falaise Pocket, bringing the Battle of Normandy to a close. The German forces committed to Normandy since D-Day had been virtually annihilated—by the end of Operation Tractable, the 12th SS Panzer Division, the main adversary of the Canadians, had lost 80% of its tanks, 70% of its personnel carriers, and 60% of its artillery.\nShortly afterwards, the 2nd Division moved to Foret de la Londe, along the valley of the River Seine. From 27to 29August, the 4th and 6th Brigades were engaged in heavy fighting against the rearguard of German forces seeking to withdraw across the Seine.\nThe Channel Ports and the Scheldt\nCanadian movements during the Battle of the Scheldt, October 1944\nThroughout September and October 1944, the First Canadian Army moved along the coast of France with the aim of securing the Channel Ports. On 1September, while the 3rd Division made for Boulogne and Calais, the 2nd Division entered Dieppe, encountering virtually no resistance. Five days later they were tasked by Montgomery and Crerar with retaking Dunkirk. Heavy fighting around the outskirts would hold the division for several days but, by 9September, the 5th Brigade had captured the port. The Dunkirk perimeter was handed over to the British on 15September, and the 2nd Division made for Antwerp.\nAlthough the Belgian White Brigade, the 11th Armoured Division, and elements of the British 3rd Infantry Division had entered Antwerp as early as 4September, taking the city and docks, a strategic oversight meant that the nearby bridges over the Albert Canal were not seized, leaving the Germans in control of the Scheldt estuary. The failure to make an immediate push on the estuary ensured the strategically vital port would remain useless until the Scheldt was cleared. Strong formations of the German Fifteenth Army, which had withdrawn from the Pas de Calais, were able to consolidate their positions on the islands of South Beveland and Walcheren, as well as the Albert Canal directly northwest of Antwerp, and were further reinforced by elements of General Kurt Student's First Parachute Army.\nDuring the initial phases of the battle, the 2nd Canadian Infantry Division sought to force a crossing of the Albert Canal. On 2October, the entire First Canadian Army—under the temporary command of General Simonds—moved against the German defences. Two days later, 2nd Division had cleared the canal, and was moving northwest towards South Beveland and Walcheren Island. On Friday, 13October, later known as \"Black Friday\", the 5th Brigade's Black Watch attacked positions near the coast, losing all four company commanders and over 200 men. Three days later, the Calgary Highlanders conducted a more successful offensive, capturing the initial objective of Woensdrecht. Simultaneously, the 3rd Canadian Infantry Division and the 4th Canadian (Armoured) Division captured Bergen, cutting off South Beveland and Walcheren from reinforcement.\nBattles for the Rhine (November 1944 – March 1945)\nBy November 1944, the First Canadian Army had entered the Nijmegen Salient which was being held for use in the development of future offensives. The 2nd Division came under the command of Major-General Bruce Matthews, with Foulkes being transferred to command the I Canadian Corps on the Italian Front. The First Canadian Army launched no major offensive operations from November 1944 to January 1945; the longest hiatus the Canadians had enjoyed since landing on the Normandy beaches the previous June.\nof the 10th Armoured Regiment (The Fort Garry Horse) with infantry of the Royal Regiment of Canada massing in preparation for the assault on Goch, 17 February 1945]]\nOperation Veritable was designed to bring the 21st Army Group to the west bank of the Rhine River, the last natural obstacle before entering Germany. Initially scheduled for December 1944, the operation was delayed until February by the German Ardennes Offensive. Plans were developed to breach three successive defensive lines: the outpost screen; a formidable section of the Siegfried Line running through the Hochwald Forest; and finally the Hochwald Layback covering the approach to the ultimate objective of Xanten. The first phase began on 8February 1945, with the 2nd Division's advance following up one of the largest artillery barrages seen on the Western Front. The Germans had prepared significant defences in depth, both within the outpost screen and the Siegfried Line itself, and to add to the Canadians' difficulties, constant rain and cold weather obscured the battlefield. However, by the end of the first day, the 2nd Division had captured their objectives—the fortified towns of Wyler and Den Heuvel. On 11February, the division moved southeast to assist British XXX Corps in their assault on Moyland Wood.\nThe operational plan's second phase called for the 2nd and 3rd Divisions to take the Hochwald Forest. Following its capture, the 4th Canadian Armoured would sweep through the Hochwald Gap towards Wesel, followed by the 2nd Division \"leap-frogging\" towards Xanten. Operation Blockbuster was scheduled for 27February, but despite initial gains, stubborn German resistance prolonged the battle for six days. It was not until 3March that the forest was cleared—during the intense close-quarter fighting, Major Frederick Tilston of the Essex Scottish Regiment won a Victoria Cross.\nOperation Blockbuster's final phase was the attack on Xanten itself, which lasted from 8to 10March. This fell primarily to the 2nd Division and 2nd Canadian Armoured Brigade, although the 43rd (Wessex) Infantry Division was temporarily assigned to Simonds's II Canadian Corps for the assault. Despite an elaborate preceding artillery barrage, dogged German resistance caused the battle to degenerate into one of attrition. Because effective air-support was prevented by fog and movement was hindered by German mortar barrages, the British and Canadians suffered heavy casualties. However, by 10March, the 2nd Division's 5th Brigade had linked up with elements of the 52nd (Lowland) Infantry Division, bringing the offensive to a close. Total Canadian casualties during Veritable and Blockbuster were 5,304 killed or wounded.\nNorth of the Rhine (March–May 1945)\nCanadian troops at Groningen\nAs Canadian forces had incurred heavy casualties in clearing a path to the Rhine, the 2nd Division was excluded from the massive crossing operation that took place on 23March 1945, instead crossing unopposed a week later after a bridgehead had been secured. After a brief detour through German territory, the First Canadian Army—now unified with the arrival of I Canadian Corps from the Italian Front—prepared to assault German positions in the Netherlands. The 2nd Division moved northwards towards Groningen. In the nine days preceding their attack, German resistance had been light and uncoordinated, but opposition stiffened as the assault progressed, leading to heavy losses among the battalions of the 5th Brigade. By 13April, the division had been shifted eastward to guard the flanks of a British assault on Bremen, and the following day ICanadian Corps liberated Arnhem. On 2May, the 2nd Division took Oldenburg, solidifying Canadian positions throughout the Netherlands. German and Canadian forces declared a ceasefire on 5May, and all fighting came to an end with the surrender of German forces in Western Europe on 7May 1945. In October 1945, after four months in the Netherlands, General Order 52/46 officially disbanded the headquarters of the 2nd Canadian Infantry Division. By December, the entirety of the division had been stood down and returned to Canada. The division suffered heavy casualties through 1944 and 1945; according to Bercuson it had the \"highest casualty ratio in the Canadian Army – from the time it returned to combat in early July 1944 until the end of the war\".\nCommanding officers\nThe following officers commanded the division:\n* Major-General Victor Odlum (1940–1941)\n* Major-General Harry Crerar (1941–1942)\n* Major-General John Roberts (1941–1943)\n* Major-General Guy Simonds (1943)\n* Major-General Eedson Burns (1943–1944)\n* Major-General Charles Foulkes (1944)\n* Major-General Bruce Matthews (1944–1945)\nSee also\n* Canadian Armed Forces\n* Military history of Canada\n* Military history of Canada during World War II\nNotes\nReferences\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\nFurther reading\n*"
    }
  ]
}