{
  "content": [
    {
      "type": "text",
      "text": "# 2nd Parachute Brigade (United Kingdom)\n\n|allegiance=\n|branch=\n|type=Airborne forces\n|role=Parachute infantry\n|size=Brigade\n|command_structure=1st Airborne Division2nd New Zealand Division8th Indian Infantry Division6th Airborne Division\n|garrison=\n|current_commander=\n|ceremonial_chief=\n|colonel_of_the_regiment=\n|notable_commanders=Brigadier Ernest DownBrigadier Charles Pritchard\n|identification_symbol=\n|identification_symbol_label=Emblem of the British Airborne Forces, Bellerophon riding the flying horse Pegasus\n|identification_symbol_2=\n|nickname=\n|patron=\n|motto=\n|colors=\n|march=\n|mascot=\n|battles=Operation SlapstickOperation HastyOperation DragoonBattle of Monte CassinoOperation MannaPalestine\n|anniversaries=\n|decorations=\n|battle_honours=\n}}\nThe 2nd Parachute Brigade was an airborne forces brigade formed by the British Army during the Second World War.\nThe 2nd Parachute Brigade was the second parachute infantry brigade to be formed by the British Army in 1942; it was initially part of the 1st Airborne Division but in 1943, after the invasion of Italy, became an independent formation. As an independent brigade it was variously assigned at different times, and served under the command of the 2nd New Zealand Division, the 8th Indian Infantry Division, and the 1st Airborne Task Force.\nBefore the end of the Second World War in Europe the brigade saw active service in Italy, the South of France and Greece. At the end of the European war the brigade returned to the United Kingdom and was intended to join the 44th Indian Airborne Division in the Far East, for service against the Japanese Empire, but the war ended before they sailed. Instead the brigade was assigned to the 6th Airborne Division, which had been named the Imperial Strategic Reserve, and sent to serve in the Mandate of Palestine.\nDefence cuts in the British armed forces after the war forced a reduction in the number of parachute brigades. By 1948 the 2nd Parachute Brigade was the last surviving parachute formation dating from the Second World War, all other parachute divisions and brigades having been disbanded. The last three battalions of the Regular Army comprised in the brigade returned to the United Kingdom; later in the same year the unit was posted to the British Army of the Rhine and re-designated as the 16th Independent Parachute Brigade Group.\nBackground\nImpressed by the success of German airborne operations during the Battle of France in May 1940, the British Prime Minister, Winston Churchill, directed the War Office to investigate the possibility of creating a corps of 5,000 parachute troops. On 22 June 1940 No. 2 Commando was turned over to parachute duties and on 21 November re-designated the 11th Special Air Service Battalion, with a parachute and glider wing and was later redesignated the 1st Parachute Battalion. It was these men who took part in the first British airborne operation, Operation Colossus, on 10 February 1941. The success of the raid prompted the War Office to expand the existing airborne force, setting up the Airborne Forces Depot and Battle School in Derbyshire in April 1942 and creating the Parachute Regiment, as well as converting several Territorial line infantry battalions into airborne battalions in August 1942. The result was the formation of the 1st Airborne Division with the 1st Parachute and the 1st Airlanding Brigades under command, together with supporting units. Its General Officer Commanding (GOC), Major-General Frederick Arthur Montague \"Boy\" Browning, expressed his opinion that the fledgling force must not be sacrificed in \"penny packets\" and urged the formation of a third brigade.\nPermission was granted to form another parachute brigade in July 1942, numbered the 2nd Parachute Brigade, and Brigadier Ernest E. Down was selected to become its first commander. The brigade was assigned the existing 4th Parachute Battalion, transferred from the 1st Parachute Brigade, and two new battalions converted from normal line infantry battalions to parachute duties: the 5th (Scottish) Parachute Battalion, converted from the 7th Battalion, Queen's Own Cameron Highlanders in May 1942; and the 6th (Royal Welch) Parachute Battalion, converted from the 10th Battalion, Royal Welch Fusiliers in August 1942.\nOperations\nThe 2nd Parachute Brigade trained in the United Kingdom until June 1943, when they left for North Africa, alongside the 1st Airlanding Brigade. On arrival the two brigades were joined by the 1st Parachute Brigade, which had already been carrying out independent operations in the area during the Tunisian campaign, and by the 4th Parachute Brigade, which had been forming in the Middle East. The 1st Airborne Division, now commanded by Major General George Frederick \"Hoppy\" Hopkinson, and with one air-landing and three parachute brigades, was based at Oran, preparing for the Allied invasion of Sicily under the command of the British Eighth Army, commanded by General Sir Bernard Montgomery. During the invasion the 1st Airborne Division was to conduct three brigade-scale airborne operations: the Ponte Grande road bridge south of Syracuse was to be captured by the 1st Airlanding Brigade, the port of Augusta was to be seized by the 2nd Parachute Brigade, and finally the Primasole Bridge over the River Simeto was to be taken and secured by the 1st Parachute Brigade. A lack of transport aircraft reduced the number of men that could be deployed, and the 2nd Parachute Brigade remained in Tunisia in a reserve role.\nFighting ended in Sicily on 17 August without use of the brigade; they were, however, selected to take part in Operation Slapstick, an amphibious landing at the port of Taranto on mainland Italy. The brigade left Bizerta on 8 September, the day before the Italian surrender, and landed unopposed. Their only casualties were 58 men from the 6th Parachute Battalion who drowned after their transport ship, HMS Abdiel, hit a mine in the harbour. While the 4th Parachute Brigade pushed inland, the 2nd Brigade assumed responsibility for securing the port and surrounding area. During fierce fighting around the town and airfield of Gioia del Colle the division's General Officer Commanding (GOC), Major General Hopkinson, was killed in action and replaced by Brigadier Down. Command of the 2nd Parachute Brigade was given to Brigadier Charles Pritchard.\nThe British 1st Airborne Division was withdrawn to England soon after, in preparation for Operation Overlord, codename for the Allied invasion of Normandy, leaving the 2nd Parachute Brigade in Italy. This was at the request of General Sir Harold Alexander, Commander-in-Chief (C-in-C) of the Allied Armies in Italy (AAI), who believed that he still needed to retain some airborne forces in Italy for future operations. The brigade thus became an independent parachute brigade group that came under command of the 2nd New Zealand Division. To support an independent role the brigade was assigned its own artillery with nine 6-pounder anti-tank guns and eight 75mm pack howitzers. They also had their own engineers and other support units were attached, including a pathfinder platoon and a glider squadron.\nIndependent brigade\nmortar team in action, Italy 1944.]]\nOn 2 December 1943 the 2nd Parachute Brigade formed the left flank of the 2nd New Zealand Division during the advance towards Orsogna. The New Zealanders were relieved by the 8th Indian Infantry Division, and the brigade continued the advance under their command. The brigade temporarily returned to the 2nd New Zealand Division on 16 January, then fought to the Sangro with the 8th Indian Division again, before going into the reserve at Guardia, from the end of March. The brigade returned to the front line and took part in the Battle of Monte Cassino on 4 April, once again coming under command of the 2nd New Zealand Division.\nThe 2nd Brigade's next parachute operation was Operation Hasty in June 1944. This was a small diversionary raid carried out by sixty men from the 6th Parachute Battalion. They were dropped into the area between Sora and Avezzano, their objective being to harass the Germans withdrawing to the Gothic Line. The mission was a success: a German brigade was diverted to hunt the small force, and a German division was retained on rear-area security duties instead of going into the front line. In June 1944, the brigade was released from the Eighth Army and joined the 1st Airborne Task Force for airborne operations in the south of France.\nFrance\nThe 2nd Independent Parachute Brigade carried out a brigade-sized parachute landing during Operation Dragoon. On 15 August 1944 the brigade's pathfinders landed in the south of France and set up Eureka beacons to guide the main brigade force to their drop zones. Despite the pathfinders' success at marking the drop zones, only seventy-three planes placed their parachutists in the correct location. The brigade commanding officer and eighty men were landed near Fayence, as were the 5th (Scottish) Battalion's commanding officer, with half of battalion headquarters, 'C' Company, and 'D' Company. Other men were landed as far away as Cannes. The dispersed landings resulted in only about forty per cent of the 4th Battalion making it to the brigade forming-up point. Only seventy per cent of the 6th (Welch) Battalion and only a single company of the 5th (Scottish) Battalion had arrived. The brigade headquarters was established at Le Mitan with the 5th (Scottish) Battalion company by 04:00, and by 07:30 the 4th Battalion had occupied the heights at Le Muy. The 6th (Welch) Battalion occupied La Motte and, when the Germans at Clastron surrendered, moved a company into the village. Le Serres was captured by 'C' Company, 4th Battalion, as was the bridge over the River Naturby on the road to Le Muy.\nAt the drop zone the pathfinders and Royal Engineers were removing anti-glider poles so that the brigade's glider force could land. The gliders, except for those carrying the anti-tank battery, which were unable to locate the site in the heavy mist and had returned to Italy, landed successfully at 09:20. The other gliders and towing aircraft had circled until the mist cleared. It was the sight of the gliders landing that persuaded the Germans at Clastron to surrender. By 10:15 the brigade had achieved all its objectives apart from capturing Le Muy, which had been allocated to the 5th (Scottish) Battalion. Units of the brigade fought off several counter-attacks supported by the 64th Airlanding Battery's guns. The missing men continued to come into the brigade's area during the morning, and contact was made with American units who had dropped west and south of them.\nMen continued to arrive in the brigade area, and by 16:00 the 4th Battalion could muster over two companies while the 6th (Welch) Battalion had over 300 men. Patrols were sent out to ambush German convoys retreating from Le Muy and to reconnoitre the town. At 18:00 the brigade anti-tank battery arrived by glider with two American battalions and other supporting units. Patrolling continued over the night of 15/16 August, and Le Muy was captured by an American battalion at 15:30. At the same time 115 men of the 5th (Scottish) Battalion arrived in the brigade area. On the morning of 18 August units of the American 36th Infantry Division, advancing from the coast, reached Le Muy. The 2nd Brigade then moved to the Frejus area, on 20 August; Cannes was liberated on 25 August. The next day the brigade sailed for Naples arriving on 28 August.\nGreece\nOn its return to Italy the 2nd Independent Parachute Brigade was sent to Rome on 3 September, and moved again on 8 September to a camp near Taranto to prepare for a possible mission in Greece, Operation Manna. The Russian advance in the east had forced the Germans to withdraw from Greece or be cut off from support and reinforcements. Over the night of 12/13 October 1944 'C' Company of the 4th Parachute Battalion, were parachuted onto Megara airfield near Athens to prepare a landing strip for the follow-up waves from the rest of the brigade. The company sustained several casualties while landing in adverse weather conditions that forced the remainder of the brigade to delay their arrival for another two days.\nat Salonika, 8 November 1944.]]\nOnce the brigade had deployed it advanced towards Athens, entering the city on 15 October, just behind the 2nd Commando Brigade. They fought the retreating Germans for the next three months, advancing from Athens to Salonika, where elements of the 2nd Para Brigade arrived by landing craft on 8 November. While in Greece the brigade also participated in the occupation of Athens, maintaining order and providing supplies to the population. Having been moved to Italy, the brigade had to return to Greece immediately after the outbreak of the Greek Civil War in December, becoming involved in several fights, suffering heavy casualties. The brigade was joined in Greece by the British 23rd Armoured Brigade. During the civil war the brigade was involved in street fighting in Athens until the communist Greek People's Liberation Army fighters were forced out of the capital in January 1945; they also provided food and other supplies to around 20,000 people in Athens every day.\nPost war\nIn January 1945 the 2nd Parachute Brigade was withdrawn from further operations and relocated to Italy. After the war ended in Europe, the brigade returned to the United Kingdom and reformed as a conventional brigade, losing its additional supporting arms. It had been planned for the brigade to go to the Far East and join the 44th Indian Airborne Division, fighting in Burma against the Japanese. However, the war ended before they departed, and instead the brigade was assigned to the 6th Airborne Division, which had been sent to Palestine. Leaving the United Kingdom the brigade arrived in Palestine on 22 October, and were based around Gaza.\nThe 6th Airborne Division had been named the Imperial Strategic Reserve and served in Egypt until September 1945, when it moved to Palestine in an internal-security role, to counter the activities of the Jewish paramilitary movements Hagana, Palmach, Irgun and the Stern Gang. When the 1st Airborne Division was disbanded in November 1945, the 6th became the only airborne division in the British Army.\nWhile in Palestine in December 1947, the 4th Parachute Battalion was amalgamated with the 6th (Royal Welch) Battalion and renamed the 4th/6th Parachute Battalion. To fill the vacancy created by this amalgamation, the 7th (Light Infantry) Parachute Battalion was assigned to the 2nd Parachute Brigade.\n16th Independent Parachute Brigade Group\nIn February 1948 the 2nd Independent Parachute Brigade left the 6th Airborne Division and moved to Germany, becoming part of the British Army of the Rhine. The 6th Airborne Division was disbanded soon afterwards, leaving the 2nd Independent Parachute Brigade as the only brigade-sized airborne formation in the British Army.\nBeing the only surviving parachute formation, in June its battalions were renumbered: the 5th (Scottish) Parachute Battalion became the 2nd Battalion, Parachute Regiment, while the 4th/6th Parachute Battalion became the 1st Battalion, Parachute Regiment, and the 7th (Light Infantry) Parachute Battalion became the 3rd Battalion, Parachute Regiment. On 25 June 1948, the brigade was re-designated the 16th Independent Parachute Brigade Group, taking the numbers \"1\" and \"6\" from the two wartime airborne divisions.\nOrder of battle\nCommanders\n*Brigadier Ernest Down\n*Brigadier Charles Pritchard\n2nd Parachute Brigade\n*4th Parachute Battalion\n*5th (Scottish) Parachute Battalion\n*6th (Royal Welch) Parachute Battalion\n2nd Independent Parachute Brigade\n*4th Parachute Battalion\n*5th (Scottish) Parachute Battalion\n*6th (Royal Welch) Parachute Battalion\n*127th (Parachute) Field Ambulance\n*300th Airlanding Anti-tank Battery Royal Artillery\n*64th Airlanding Battery Royal Artillery\n*2nd Parachute Squadron Royal Engineers\n*2nd Independent Parachute Brigade Group Signal Company Royal Signals\n*1st Independent Glider Squadron Army Air Corps\n*23rd Independent Platoon Army Air Corps (Pathfinders)\n*2nd Independent Parachute Brigade Group Company Royal Army Service Corps\n*751st Parachute Brigade Company Royal Army Service Corps\n*T Company Royal Army Service Corps\n*2nd Independent Parachute Brigade Group Workshop Royal Electrical and Mechanical Engineers\n*2nd Independent Parachute Brigade Group Provost Section Royal Military Police\n2nd Parachute Brigade 1948\n*4th/6th Parachute Battalion\n*5th (Scottish) Parachute Battalion\n*7th (Light Infantry) Parachute Battalion\nRenumbered 16th Parachute Brigade\n*1st Parachute Battalion\n*2nd Parachute Battalion\n*3rd Parachute Battalion\nNotes\nReferences\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*"
    }
  ]
}