{
  "content": [
    {
      "type": "text",
      "text": "# 30th Screen Actors Guild Awards\n\n| location         = Shrine Auditorium and Expo Hall, Los Angeles, California\n| country          = United States\n| presenter        = SAG-AFTRA\n| reward           =\n| year             = 1995\n| year2            =\n| holder           =\n| host             =Idris Elba\n| preshow_host     =Tan FranceElaine Welteroth\n| acts             =\n| network          = Netflix\n| runtime          = 2 hours, 14 minutes\n| ratings          =\n| producer         = Silent House Productions\n| director         =  Alex Rudzinski\n| most_awards      = FilmOppenheimer (3)TelevisionThe Bear (3)\n| most_nominations = FilmBarbie (4)Oppenheimer (4)TelevisionSuccession (5)\n| website          =\n| image2           =\n| image2size       =\n| alt2             =\n| caption2         =\n| previous         = 29th\n| main             = Screen Actors Guild Awards\n| next             = 31st\n}}\nThe 30th Annual Screen Actors Guild Awards, honoring the best achievements in film and television performances for the year 2023, was presented on February 24, 2024, at the Shrine Auditorium and Expo Hall in Los Angeles, California. For the first time, the ceremony streamed live on Netflix, starting at 8:00p.m. EST / 5:00p.m. PST.\nHosted by English actor Idris Elba, while Tan France and Elaine Welteroth presented the show's red-carpet and backstage interviews. The telecast was produced for the first time by Silent House Productions, with Alex Rudzinski serving as director.\nBefore the nominations announcement, Entertainment Weekly and the Screen Actors Guild co-hosted the inaugural SAG Awards Season Celebration, presented by City National Bank, on December 14, 2023, in Los Angeles. The nominees were announced on January 10, 2024, by Kumail Nanjiani and Issa Rae via the SAG Awards' and Netflix's Instagram Live.\nBarbra Streisand was announced as the 2023 SAG Life Achievement Award recipient on December 14, 2023.\nCeremony information\nThis year's ceremony marked its live debut on Netflix. In January 2023, Netflix struck an 11th hour deal to televise the show, after its previous deal with TBS/TNT expired in May 2022, but the previous year's ceremony was broadcast on Netflix's YouTube channel because Netflix was still experimenting with live broadcasts at that time.\nWinners and nominees\n* Note: Winners are listed first and highlighted in boldface.\n, Outstanding Performance by a Male Actor in a Leading Role winner]]\n, Outstanding Performance by a Female Actor in a Leading Role winner]]\n, Outstanding Performance by a Male Actor in a Supporting Role winner]]\n, Outstanding Performance by a Female Actor in a Supporting Role winner]]\n, Outstanding Performance by a Male Actor in a Television Movie or Limited Series winner]]\n, Outstanding Performance by a Male Actor in a Drama Series winner]]\n, Outstanding Performance by a Female Actor in a Drama Series winner]]\n, Outstanding Performance by a Male Actor in a Comedy Series winner]]\n, Outstanding Performance by a Female Actor in a Comedy Series winner]]\nFilm\n{| class=wikitable style=font-size:100%\n|+\n|-\n| style=\"vertical-align:top;\" width=\"50%\"|\n* 'Cillian Murphy – Oppenheimer as J. Robert Oppenheimer'\n** Bradley Cooper – Maestro as Leonard Bernstein\n** Colman Domingo – Rustin as Bayard Rustin\n** Paul Giamatti – The Holdovers as Paul Hunham\n** Jeffrey Wright – American Fiction as Thelonious \"Monk\" Ellison\n| style=\"vertical-align:top;\" width=\"50%\"|\n* 'Lily Gladstone – Killers of the Flower Moon as Mollie Burkhart'\n** Annette Bening – Nyad as Diana Nyad\n** Carey Mulligan – Maestro as Felicia Montealegre\n** Margot Robbie – Barbie as Barbie\n** Emma Stone – Poor Things as Bella Baxter\n|-\n| style=\"vertical-align:top;\" width=\"50%\"|\n* 'Robert Downey Jr. – Oppenheimer as Lewis Strauss'\n** Sterling K. Brown – American Fiction as Clifford Ellison\n** Willem Dafoe – Poor Things as Dr. Godwin Baxter\n** Robert De Niro – Killers of the Flower Moon as William Hale\n** Ryan Gosling – Barbie as Ken\n| style=\"vertical-align:top;\" width=\"50%\"|\n* '''Da'Vine Joy Randolph – The Holdovers as Mary Lamb'\n** Emily Blunt – Oppenheimer as Kitty Oppenheimer\n** Danielle Brooks – The Color Purple as Sofia\n** Penélope Cruz – Ferrari as Laura Ferrari\n** Jodie Foster – Nyad as Bonnie Stoll\n|-\n| colspan=\"2\" style=\"vertical-align:top;\" width=\"50%\" |\n* 'Oppenheimer – Casey Affleck, Emily Blunt, Kenneth Branagh, Matt Damon, Robert Downey Jr., Josh Hartnett, Rami Malek, Cillian Murphy, and Florence Pugh'\n** American Fiction – Erika Alexander, Adam Brody, Sterling K. Brown, Keith David, John Ortiz, Issa Rae, Tracee Ellis Ross, Leslie Uggams, and Jeffrey Wright\n** Barbie – Michael Cera, Will Ferrell, America Ferrera, Ryan Gosling, Ariana Greenblatt, Kate McKinnon, Helen Mirren, Rhea Perlman, Issa Rae, and Margot Robbie\n** The Color Purple – Halle Bailey, Fantasia Barrino, Jon Batiste, Danielle Brooks, Ciara, Colman Domingo, Aunjanue Ellis-Taylor, Louis Gossett Jr., Corey Hawkins, Taraji P. Henson, Phylicia Pearl Mpasi, and Gabriella Wilson \"H.E.R.\"\n** Killers of the Flower Moon – Tantoo Cardinal, Robert De Niro, Leonardo DiCaprio, Brendan Fraser, Lily Gladstone, John Lithgow, and Jesse Plemons\n|-\n| style=\"vertical-align:top;\" width=\"50%\" colspan=\"2\"|\n* Mission: Impossible – Dead Reckoning Part One\n** Barbie\n** Guardians of the Galaxy Vol. 3\n** Indiana Jones and the Dial of Destiny\n** John Wick: Chapter 4\n|}\nTelevision\n{| class=wikitable style=font-size:100%\n|-\n| style=\"vertical-align:top;\" width=\"50%\"|\n* 'Steven Yeun – Beef (Netflix) as Danny Cho'\n** Matt Bomer – Fellow Travelers (Showtime) as Hawkins \"Hawk\" Fuller\n** Jon Hamm – Fargo (FX) as Roy Tillman\n** David Oyelowo – Lawmen: Bass Reeves (Paramount+) as Bass Reeves\n** Tony Shalhoub – Mr. Monk's Last Case: A Monk Movie (Peacock) as Adrian Monk\n| style=\"vertical-align:top;\" width=\"50%\"|\n* 'Ali Wong – Beef (Netflix) as Amy Lau'\n** Uzo Aduba – Painkiller (Netflix) as Edie Flowers\n** Kathryn Hahn – Tiny Beautiful Things (Hulu) as Clare Pierce\n** Brie Larson – Lessons in Chemistry (Apple TV+) as Elizabeth Zott\n** Bel Powley – A Small Light (Nat Geo) as Miep Gies\n|-\n| style=\"vertical-align:top;\" width=\"50%\"|\n* 'Pedro Pascal – The Last of Us (HBO) as Joel Miller'\n** Brian Cox – Succession (HBO) as Logan Roy\n** Billy Crudup – The Morning Show (Apple TV+) as Cory Ellison\n** Kieran Culkin – Succession (HBO) as Roman Roy\n** Matthew Macfadyen – Succession (HBO) as Tom Wambsgans\n| style=\"vertical-align:top;\" width=\"50%\"|\n* 'Elizabeth Debicki – The Crown (Netflix) as Princess Diana'\n** Jennifer Aniston – The Morning Show (Apple TV+) as Alex Levy\n** Bella Ramsey – The Last of Us (HBO) as Ellie\n** Keri Russell – The Diplomat (Netflix) as Kate Wyler\n** Sarah Snook – Succession (HBO) as Shiv Roy\n|-\n| style=\"vertical-align:top;\" width=\"50%\"|\n* 'Jeremy Allen White – The Bear (FX / Hulu) as Carmen \"Carmy\" Berzatto'\n** Brett Goldstein – Ted Lasso (Apple TV+) as Roy Kent\n** Bill Hader – Barry (HBO) as Barry Berkman\n** Ebon Moss-Bachrach – The Bear (FX / Hulu) as Richard \"Richie\" Jerimovich\n** Jason Sudeikis – Ted Lasso (Apple TV+) as Ted Lasso\n| style=\"vertical-align:top;\" width=\"50%\"|\n* 'Ayo Edebiri – The Bear (FX / Hulu) as Sydney Adamu'\n** Alex Borstein – The Marvelous Mrs. Maisel (Prime Video) as Susie Myerson\n** Rachel Brosnahan – The Marvelous Mrs. Maisel (Prime Video) as Miriam \"Midge\" Maisel\n** Quinta Brunson – Abbott Elementary (ABC) as Janine Teagues\n** Hannah Waddingham – Ted Lasso (Apple TV+) as Rebecca Welton\n|-\n| colspan=\"2\" style=\"vertical-align:top;\" width=\"50%\" |\n* 'Succession (HBO) – Nicholas Braun, Juliana Canfield, Brian Cox, Kieran Culkin, Dagmara Domińczyk, Peter Friedman, Justine Lupe, Matthew Macfadyen, Arian Moayed, Scott Nicholson, David Rasche, Alan Ruck, Alexander Skarsgård, J. Smith-Cameron, Sarah Snook, Fisher Stevens, Jeremy Strong, and Zoë Winters'\n** The Crown (Netflix) – Khalid Abdalla, Sebastian Blunt, Bertie Carvel, Salim Daw, Elizabeth Debicki, Luther Ford, Claudia Harrison, Lesley Manville, Ed McVey, James Murray, Jonathan Pryce, Imelda Staunton, Marcia Warren, Dominic West, and Olivia Williams\n** The Gilded Age'' (HBO) – Ben Ahlers, Ashlie Atkinson, Christine Baranski, Denée Benton, Nicole Brydon Bloom, Michael Cerveris, Carrie Coon, Kelley Curran, Taissa Farmiga, David Furr, Jack Gilpin, Ward Horton, Louisa Jacobson, Simon Jones, Sullivan Jones, Celia Keenan-Bolger, Nathan Lane, Matilda Lawler, Robert Sean Leonard, Audra McDonald, Debra Monk, Donna Murphy, Kristine Nielsen, Cynthia Nixon, Kelli O'Hara, Patrick Page, Harry Richardson, Taylor Richardson, Blake Ritson, Jeremy Shamos, Douglas Sills, Morgan Spector, John Douglas Thompson, and Erin Wilhelmi\n** The Last of Us (HBO) – Pedro Pascal and Bella Ramsey\n** The Morning Show (Apple TV+) – Jennifer Aniston, Nicole Beharie, Shari Belafonte, Néstor Carbonell, Billy Crudup, Mark Duplass, Jon Hamm, Theo Iyer, Hannah Leder, Greta Lee, Julianna Margulies, Tig Notaro, Karen Pittman, and Reese Witherspoon\n|-\n| colspan=\"2\" style=\"vertical-align:top;\" width=\"50%\" |\n* 'The Bear (FX / Hulu) – Lionel Boyce, Jose Cervantes Jr., Liza Colón-Zayas, Ayo Edebiri, Abby Elliott, Richard Esteras, Edwin Lee Gibson, Molly Gordon, Corey Hendrix, Matty Matheson, Ebon Moss-Bachrach, Oliver Platt, and Jeremy Allen White'\n** Abbott Elementary (ABC) – Quinta Brunson, William Stanford Davis, Janelle James, Chris Perfetti, Sheryl Lee Ralph, Lisa Ann Walter, and Tyler James Williams\n** Barry (HBO) – Anthony Carrigan, Sarah Goldberg, Zachary Golinger, Bill Hader, Andre Hyland, Fred Melamed, Charles Parnell, Stephen Root, Tobie Windham, Henry Winkler, and Robert Wisdom\n** Only Murders in the Building (Hulu) – Gerald Caesar, Michael Cyril Creighton, Linda Emond, Selena Gomez, Allison Guinn, Steve Martin, Ashley Park, Don Darryl Rivera, Paul Rudd, Jeremy Shamos, Martin Short, Meryl Streep, Wesley Taylor, Jason Veasey, and Jesse Williams\n** Ted Lasso (Apple TV+) – Annette Badland, Kola Bokinni, Edyta Budnik, Adam Colborne, Phil Dunster, Cristo Fernández, Kevin \"KG\" Garry, Brett Goldstein, Billy Harris, Anthony Head, Brendan Hunt, Toheeb Jimoh, James Lance, Nick Mohammed, Jason Sudeikis, Jeremy Swift, Juno Temple, Hannah Waddingham, Bronson Webb, and Katy Wix\n|-\n| style=\"vertical-align:top;\" width=\"50%\" colspan=\"2\"|\n* 'The Last of Us (HBO)'\n** Ahsoka (Disney+)\n** Barry (HBO)\n** Beef (Netflix)\n** The Mandalorian (Disney+)\n|}\nScreen Actors Guild Life Achievement Award\n* Barbra Streisand\nIn Memoriam\nThe segment, introduced by Naomi Watts, honoring the following who died in 2023 and early 2024.\n* Richard Roundtree\n* Glynis Johns\n* David Soul\n* George Maharis\n* Angus Cloud\n* David McKnight\n* Paxton Whitehead\n* Shelley Smith\n* David McCallum\n* Joss Ackland\n* Frances Sternhagen\n* Ray Stevenson\n* Mark Goddard\n* Jim Brown\n* Dick Butkus\n* Bill Hayes\n* Julian Sands\n* Jeffrey Carlson\n* Burt Young\n* Adan Canto\n* Ellen Holly\n* Nicolas Coster\n* Joanna Merlin\n* Barry Newman\n* Tyler Christopher\n* Suzanne Shepherd\n* Casey Kramer\n* Ron Cephas Jones\n* Billy Miller\n* Hinton Battle\n* Carlin Glynn\n* Maurice Hines\n* Chita Rivera\n* Don Murray\n* Joseph Melendez\n* David Emge\n* Andrea Fay Friedman\n* Tom Smothers\n* Suzanne Somers\n* Richard Moll\n* Inga Swenson\n* Mark Margolis\n* Treat Williams\n* Michael Gambon\n* Sharon Farrell\n* Conrad E. Palmisano\n* Gary Kent\n* Tina Turner\n* Paul Reubens\n* Michael Lerner\n* Shecky Greene\n* James McCaffrey\n* Lance Reddick\n* Arleen Sorkin\n* Kamar de los Reyes\n* Richard Romanus\n* Lee Sun-kyun\n* Chaim Topol\n* Piper Laurie\n* Tom Sizemore\n* Frederic Forrest\n* Joyce Randolph\n* Ryan O'Neal\n* Glenda Jackson\n* Andre Braugher\n* Alan Arkin\n* Carl Weathers\n* Tom Wilkinson\n* Matthew Perry\n* Harry Belafonte\nPresenters\nThe awards and segments were presented by the following individuals:\n{| class=\"wikitable sortable\"\n|+\n|-\n! scope=\"col\"| Name(s)\n! scope=\"col\"| Role\n|-\n|\n| Presented the highlights of nominated acting performances\n|-\n| Emily BluntAnne Hathaway\n| Presented Outstanding Performance by a Male Actor in a Comedy Series\n|-\n| Glen Powell\n| Presented Outstanding Performance by a Female Actor in a Miniseries or Television Movie\n|-\n| America Ferrera\n| Presented the film Barbie on the Outstanding Performance by a Cast in a Motion Picture segment\n|-\n| Billie Eilish\n| Presented Outstanding Performance by a Female Actor in a Comedy Series\n|-\n| Tracee Ellis RossSterling K. BrownJeffrey Wright\n| Presented the film American Fiction on the Outstanding Performance by a Cast in a Motion Picture segment\n|-\n| Storm Reid\n| Presented Outstanding Performance by a Male Actor in a Drama Series\n|-\n| Sean Astin\n| Presented Outstanding Performance by a Female Actor in a Supporting Role\n|-\n| Robert De NiroTantoo Cardinal\n| Presented the film Killers of the Flower Moon on the Outstanding Performance by a Cast in a Motion Picture segment\n|-\n| Troy Kotsur\n| Presented Outstanding Performance by a Male Actor in a Miniseries or Television Movie\n|-\n| The Cast of Modern Family\n| Presented Outstanding Performance by an Ensemble in a Comedy Series\n|-\n| Bradley Cooper\n| Presented the Screen Actors Guild Life Achievement Award for Barbra Streisand\n|-\n|\n| Presented Outstanding Performance by a Male Actor in a Supporting Role\n|-\n| Omar Sy\n| Presented Outstanding Performance by a Female Actor in a Drama Series\n|-\n| The Cast of Breaking Bad\n| Presented Outstanding Performance by an Ensemble in a Drama Series\n|-\n| Robert Downey Jr.Cillian Murphy\n| Presented the film Oppenheimer on the Outstanding Performance by a Cast in a Motion Picture segment\n|-\n|\n| Presented the In Memoriam tribute\n|-\n|\n| Presented Outstanding Performance by a Male Actor in a Leading Role\n|-\n| Halle BaileyTaraji P. Henson\n| Presented the film The Color Purple on the Outstanding Performance by a Cast in a Motion Picture segment\n|-\n|\n| Presented Outstanding Performance by a Female Actor in a Leading Role\n|-\n| Jeff Goldblum\n| Presented Outstanding Performance by a Cast in a Motion Picture\n|}\nReferences\nExternal links\n*\n*"
    }
  ]
}