{
  "content": [
    {
      "type": "text",
      "text": "# 31st Marine Expeditionary Unit\n\n| branch                        =\n| type                          = Marine Air Ground Task Force\n| role                          = Forward-deployed expeditionary Crisis Response Force\n| size                          = Around 2,200 Marines and Sailors\n| command_structure             = III Marine Expeditionary Force\n| website                       = https://www.31stmeu.marines.mil/\n| current_commander             = Colonel Chris P. Niedziocha\n| garrison                      = Camp Hansen, MCB Camp Butler\n| ceremonial_chief              =\n| colonel_of_the_regiment       =\n| nickname                      = SAVAGE\n| patron                        =\n| motto                         = Ready, Partnered, Lethal\n| colors                        =\n| march                         =\n| mascot                        =\n| battles                       = Vietnam WarOperation UnionOperation Eagle PullOperation Frequent WindMultinational Force in LebanonOperation Southern WatchOperation Desert FoxOperation Iraqi FreedomOperation Phantom FuryOperation Caring ResponseOperation Tomodachi\n| specialization                = Marine Air-Ground Task Force Crisis Response Force\n| anniversaries                 = Activated 1 March 1967\n}}\nThe 31st Marine Expeditionary Unit (31st MEU) is one of seven Marine Expeditionary Units in existence in the United States Marine Corps. The Marine Expeditionary Unit is a Marine Air Ground Task Force with a strength of about 2,200 Marines and sailors. The 31st MEU consists of a company-sized command element, a battalion landing team (BLT), (an infantry battalion reinforced with artillery, amphibious vehicles and other attachments), a medium tiltrotor squadron (reinforced), (which includes detachments of short take-off, vertical landing airplanes and heavy, light, and attack helicopters), and a combat logistics battalion. The 31st MEU is based at Camp Hansen, Marine Corps Base Camp Smedley D. Butler, Okinawa, Japan.  The 31st MEU is the only permanently forward-deployed MEU, and provides a flexible and lethal force ready to perform a wide range of military, humanitarian, and diplomatic operations as the premier crisis response force in the Indo-Pacific region.\nThe 31st MEU is the only MEU that retained a battalion landing team small boat capability to conduct raids.\nCurrent subordinate units\n*Ground Combat Element: Battalion Landing Team 1st Battalion, 7th Marines\n*Aviation Combat Element: VMM-262 (Reinforced)\n*Logistics Combat Element: Combat Logistics Battalion 31\nHistory\nVietnam War\nCombat operations\nThe 31st Marine Expeditionary Unit was commissioned on March 1, 1967, as Special Landing Force Alpha, for operations in Vietnam. The unit made the first of many amphibious deployments from Okinawa to the coast of Vietnam on April 10, 1967.\nThe first operation conducted was on April 14, 1967, when the MEU conducted a rescue of the crew of the SS Silver Peak, a Panamanian vessel run aground by Typhoon Violet, in vicinity of Minami Ko Shima Island, Japan. Days later, SLF Alpha was committed to Operation Union, a search and destroy mission in Vietnam.\nIt was during this period of intense combat that SLF Alpha earned the Presidential Unit Citation. The unit participated in continuing combat operations ashore over the next three years, including the Vietnam Tet counteroffensive in 1969, while returning to Okinawa periodically for re-outfitting and the rotation of forces.\nSpecial Landing Force Alpha was officially designated as the 31st Marine Amphibious Unit (MAU) on November 24, 1970. Once more the unit returned to the Gulf of Tonkin. This time, however, the 31st MAU was not be committed to overt land operations as the Vietnam War was winding down. The 31st MAU performed presence missions and conducted a series of special operations through May 1971. From June 1971 until April 1975, the 31st MAU conducted many deployments to the waters off Vietnam.\nOperation Eagle Pull\nOn January 6, 1975, Commander in Chief Pacific Command (CINCPAC) placed the 31st MAU on 96-hour alert to move the evacuation fleet into the Gulf of Thailand for the possible implementation of Operation Eagle Pull, the evacuation of the United States Embassy in Phnom Penh, Cambodia. On the afternoon of April 11, 1975, the 31st MAU received orders to execute Operation Eagle Pull.\nAt 06:00 on April 12, 12 x CH-53s of HMH-462 launched from the deck of the USS Okinawa and moving a security force of 36o Marines ashore. The majority of the evacuation proceeded smoothly with HMH-462 transporting 84 US nationals and 205 Cambodians and third country nationals. By 10:41 all the evacuees, including Ambassador John Gunther Dean and President Saukham Khoy had been extracted. Helicopters of HMH-463, operating from the USS Hancock, began to land to extract the ground security force. Beginning at approximately 10:50, 107&nbsp;mm rocket and 82&nbsp;mm mortar fire began impacting in the vicinity of LZ Hotel. At 10:59, the last element of 2nd Battalion, 4th Marines left the zone and the last Marine helicopter landed on USS Okinawa at 12:15.\nOn April 13, the evacuees were flown to U-Tapao Air Base in Thailand and Amphibious Ready Group Alpha proceeded to the South China Sea to rendezvous with Task Force 76 as it stood by to implement Operation Frequent Wind, the evacuation of Saigon.\nOperation Frequent Wind\nAfter departing the Gulf of Thailand, the 31st MAU was attached to the 9th Marine Amphibious Brigade in support of Operation Frequent Wind, the final evacuation of Saigon as North Vietnamese forces entered the city.\n1980s and 1990s\nThe 31st MAU at this time was established as the only permanently forward-deployed U.S. presence in the Western Pacific, Southern Pacific, and Indian Ocean with Special Operations capabilities. In February 1980 the USS Okinawa (LPH-3) task force, already with Marine Cobra gunship and Harrier attack aircraft from California, made port at Pearl Harbor to take aboard the final elements of the MEU which consisted of 3rd Battalion, 3rd Marines (3/3), helicopters from MAG-24, Force Recon, and Marine Amphibious Unit Service Support Group 31 (MSSG-31) in support, all out of Kaneohe Bay's 1st Marine Brigade. On April 24, this group in support of 3/3 Marines rendezvoused with USS Nimitz off the coast of Iran as reserve in the ill-fated Operation Eagle Claw, the failed attempt to rescue of the 53 American captives at the Embassy of the United States, Tehran.\nCombat operations were replaced by regional exercises, which allowed training opportunities in a variety of countries.\nDuring the late 1970s and early 1980s, the 31st MEU engaged in humanitarian operations, for example the floods in Bangladesh (1984). In 1983, the 31st MEU was recalled from a combined exercise with local forces in Kenya and positioned in the Mediterranean Sea. Its mission from September to October 1983 was to support the Multinational U.S. peacekeeping forces in Beirut during an intense period of complex political and life-threatening conditions in Lebanon. They took over the command operations after their sister unit (24th MEU) was attacked in the Beirut bombing. It was the 31st MEU's last military operation of that period and the unit was deactivated in May 1985 on ship off the shore of San Diego.  During this time the 31st MEU was based at the Marine Barracks, Subic Bay Naval Station.\nThe unit was redesignated as the 31st Marine Expeditionary Unit (Special Operations Capable) on September 9, 1992. In 1994, the unit was relocated to its current home station at Camp Hansen, in Okinawa, Japan.\nIraq 1998-99\nIn November 1998, Saddam Hussein’s regime was failing to comply with United Nations resolutions and interfering with weapons inspectors looking for weapons of mass destruction. As the crisis came to a head, the 31st MEU was recalled back to Okinawa. At the time, most of the MEU's Marines were on Guam conducting urban warfare training and a new infantry battalion had just arrived from CONUS. All Marines and equipment were eventually loaded by November 11 at which time the ships set sail for the Persian Gulf. From November 1998 through February 1999, the 31st MEU sailed off the coast of Kuwait, participating in Operation Southern Watch and Operation Desert Fox.\nEast Timor\nThe 31st MEU, in concert with Amphibious Squadron Eleven (PhibRon 11), deployed to support Australian Defence Force (ADF) operations in East Timor from September 30, 1999, through October 26, 1999.  Flying from the USS Belleau Wood (LHA-3), the MEU conducted \"lily pad\" operations around East Timor providing security, logistics, and communications support for the  International Force East Timor (INTERFET) led by  Major General Peter Cosgrove from the Australian Army. The Marines distributed more than 500 tons of food, water, and supplies around East Timor during this time.\nIn January 2000, a Special Purpose Marine Air-Ground Task Force consisting of Golf Company, 2nd Battalion, 5th Marines, Charlie Company 1st Battalion 5th Marines, then the MEU's Battalion Landing Team; portions of the Command Element; HMM-265, and MSSG-31 deployed to East Timor aboard the . In East Timor, the Marines and Sailors supported the transition from the Australian-led INTERFET to the new United Nations Transitional Administration East Timor (UNTAET).\n9-11\nLate in the evening of September 11, 2001, all US Forces were secured to their quarters as Super Typhoon Nari was passing over Okinawa.  After the September 11 attacks, the MEU received a 96-hour warning order for deployment and was notified that naval shipping was en route to embark them soonest. Marines prepared to deploy and began stagin equipment as the storm continued. The helicopter squadron was the last to board due to the passing storm, and the on-load was successfully completed in 93 hours.  The MEU immediately steamed south towards its expected destination, Afghanistan.  As the ships passed Singapore, the MEU was re-tasked to support UNTAET operations in East Timor.  The 15th Marine Expeditionary Unit, returning from a deployment to East Timor, was assigned the task of supporting combat operations in Afghanistan.\n21st century\nFrom September 2004 to March 2005, the 31st MEU, including Battalion Landing Team 1st Battalion 3rd Marines with attached Charlie Battery of 1st Battalion 12th Marines, conducted combat actions during the Iraq War.  Participation included a major role in Operation Phantom Fury, the clearing of Fallujah in November 2004.\nWith organizational changes to Marine Corps' reconnaissance units in 2006, all the MEU's Special Operations Capable (SOC) designations were removed. The 31st MEU then became titled as a Maritime Contingency Force, although it remains capable of conducting the same wide variety of specialized missions on both sea and land.\nIn February 2006, the 31st MEU was sent to the Philippines to provide relief assistance during the mudslides in southern Leyte.\nOn September 21, 2007, the 31st MEU Command Element dedicated its headquarters building at Camp Hansen, Okinawa to Sergeant Rafael Peralta, who died in Iraq during Operation Phantom Fury while assigned to the 31st MEU BLT 1/3 Alpha Company 1st Platoon.  Sgt Peralta received the Navy Cross for his actions in Fallujah.\nFrom May 13 through June 5, 2008, Marines of the 31st MEU sailing aboard the 's expeditionary strike group waited off the coast of Burma prepared to provide relief as part of Operation Caring Response following Cyclone Nargis. US leaders sent the strike group home in early June after failing to gain permission for them to come ashore from the Burmese government\nIn October 2009 the MEU assisted in humanitarian & disaster relief in Luzon, Philippines after Typhoons Ketsana and Parma hit back to back.  Simultaneously, elements of the MEU assisted in Sumatra, Indonesia after earthquakes struck the region.\nIn October 2010, the 31st MEU conducted humanitarian assistance and disaster relief operations in northern Luzon after Super Typhoon Megi hit the Philippines.\nOperation Tomodachi, Japan - 2011\nThe 31st MEU was split into three separate parts on 11 March 2011, the day of the 9.0 earthquake and tsunami.  The largest ship, , with most of the Marines and Sailors of the 31st MEU aboard, had just completed an exercise in Cambodia and had arrived in Malaysia for a port visit. When 31st MEU leadership received news of the tsunami, they initiated an immediate recall of all personnel who were away from the ship on liberty. The ship quickly took on some supplies, and in less than 24 hours was underway to Japan where it would meet up with  and .\nGermantown and Harpers Ferry were both in Indonesia with elements of the 31st MEU embarked, and marines and sailors aboard the USS Harpers Ferry were scheduled to participate in a large humanitarian assistance and disaster relief exercise starting 12 March.  Both ships were immediately alerted upon news of the disaster in Japan and headed north for the stricken country in support of what would become Operation Tomodachi.\nThe Essex Amphibious Ready Group and the 31st MEU first arrived off the coast of Akita, Japan, 17 March and began flying coastal surveillance flights in the initial stages of Operation Tomodachi. Then, on 22 March, the ARG repositioned off the east coast of Japan, near Hachinohe, and the 31st MEU immediately began delivering relief supplies ashore via helicopters of Marine Medium Helicopter Squadron 262 (Reinforced). Supplies delivered included water, blankets, and other health and comfort items. HMM-262 (REIN) conducted a total of 15 survey missions and 204 supply delivery missions with nearly 300 hours of flight time.\nOn 27 March, the MEU and Essex ARG's priority became support to the isolated island of Oshima as part of Operation Tomodachi. Elements of the 31st MEU, including Marine Medium Helicopter Squadron 262 (Reinforced), Combat Logistics Battalion 31, 2nd Battalion 5th Marines and the command element went ashore on Oshima Island to remove debris, deliver critical supplies to the isolated area, and provide life support.\nCombat Logistics Battalion 31 began by transporting relief supplies, which included moving commercial electric utility vehicles, a fuel truck, a water re-supply vehicle and civilian workers from the Tohoku Power Company by U.S. Navy landing craft to attempt to restore partial power to the cut-off island.  The same day the utility vehicles were delivered, the island received power for the first time since the disaster.\nDuring the Oshima operation, pallets of clothes, blankets, and food were flown to the JMSDF helicopter destroyer JS Hyuga (DDH 181) by Marine helicopters, where they were distributed to displaced residents of the island who were temporarily embarked aboard the ship.\nWorking alongside the JGSDF, the 31st MEU delivered 15,000 pounds of supplies to the island and cleared tons of debris from harbors, roads and beaches. Marines also created temporary shower facilities allowing residents to bathe. For some it was the first time they had been able to take a shower since the tsunami struck.\nIn total, the 31st MEU and the Essex ARG moved 164,000 pounds of relief supplies to those affected by the disaster, including five cities, Oshima Island and the Japanese ship.\nTyphoon Haiyan and Operation Damayan - 2013\nIn November 2013, the 31st MEU acted as a contingency reserve in wake of Typhoon Haiyan in the Republic of the Philippines.  The MEU was conducting unit turnover when they were tasked to respond and quickly embarked aboard the USS Ashland (LSD 48) and USS Germantown (LSD 42) of Amphibious Squadron 11 to assist in disaster relief operations in conjunction with the U.S. Department of State and Joint Task Force 505.  The Aviation Combat Element of the 31st MEU, Marine Medium Tiltrotor Squadron 265, flew over 415 flight hours to deliver aid supplies throughout the region.  The rest of the MEU remained at sea in the Leyete Gulf of the Philippines to act as a contingency reserve in the event any more assistance was needed or another disaster were to strike the area.\nSouth Korean ferry Sewol - 2014\nIn April 2014, the 31st MEU on board the USS Bonhomme Richard assisted in air-sea search and rescue operations of the Korean ferry Sewol that \"sank near the island of Jindo off the southwestern coast of the Republic of Korea 16 April\".\nthat sank 16 April 2014]]\nTyphoon Soudelor, Saipan - 2015\nFrom 2–3 August 2015, Typhoon Soudelor devastated the island of Saipan in the Commonwealth of Northern Mariana Islands. Approximately 600 Marines and sailors of the 31st MEU responded to assist local and federal agencies with disaster relief efforts. Over the course of two weeks, the 31st MEU delivered more than 19,000 gallons of water and 47,000 individual meals provided by the Federal Emergency Management Agency to five distribution sites across the island. The Marines distributed an additional 366,000 gallons of potable water to the people of Saipan, 279,000 gallons of which were purified using a Lightweight Water Purification System and a Tactical Water Purification System. The 31st MEU also distribute more than 10,000 pounds of emergency supplies provided by the Red Cross.\nOperation Chinzei, Japan - 2016\nFrom 15–17 April 2016, a series of earthquakes struck the Japanese prefecture of Kumamoto, causing 48 deaths and displacing some 100,000 people. At the request of the Government of Japan, approximately 130 Marines and Sailors of the 31st MEU provided support to operations conducted by Joint Task Force Chinzei, led by the Japan Self-Defense Force. From 18–23 April, 31st MEU MV-22B Ospreys operating out of Marine Corps Air Station Iwakuni, Japan, delivered more than 82,000 pounds of food, water, blankets, toiletries and other items to be distributed to earthquake victims.\nDefense Support of Civil Authorities, Commonwealth of the Northern Mariana Islands, September–November 2018\nDuring Fall Patrol 2018, the 31st MEU and CLB-31 provided assistance to the people of the Commonwealth of the Northern Mariana Islands (CNMI), a U.S. territory, after two devastating typhoons. On September 10, Super Typhoon Mangkhut swept across CNMI, causing widespread damage to the islands of Rota and Saipan. The Marines and sailors of the 31st MEU and CLB-31, then embarked aboard the  and USS Ashland (LSD-48), began providing assistance to CNMI officials and the Federal Emergency Management Agency (FEMA) as soon as the skies cleared over CNMI. During Mangkhut relief efforts, the 31st MEU and CLB-31, partnering with Amphibious Squadron 11, cleared roads and flew 63 air missions to deliver assistance personnel and more than 29,000 pounds of cargo for the people of CNMI. Mangkhut relief efforts ended on September 14, when the 31st MEU and CLB-31 re-embarked aboard the Wasp and Ashland to continue deployment.\nJust over a month later, on October 25, the second-strongest storm ever to hit U.S. soil, Super Typhoon Yutu, made a direct hit on the islands of Tinian and Saipan. The 31st MEU and CLB-31, which had just returned to Okinawa after completing deployment, received orders to assist relief efforts just days after returning to Camp Hansen. The 31st MEU arrived on October 29, establishing ashore at Tinian International Airport. A more robust follow-on force arrived aboard the USS Ashland on 3 November, aiding with water purification, route clearance, damage assessments and restoration of municipal utilities. All told, the 31st MEU and CLB-31, which led the multiservice response effort on Tinian, cleared miles of roadway, purified more than 20,000 gallons of drinking water, and helped deliver and assemble more than 150 FEMA-provided shelters, handing control of the DSCA effort to the U.S. Navy Seabees of Naval Mobile Construction Battalion 1 on November 14.\n31st MEU commanding officers\n{| class=\"wikitable\"\n|-\n| Col. Walter Lee Miller Jr. May 2004-June 20, 2006 || Col. John L. Mayer June 20, 2006 – June 15, 2008\n|-\n| Col. Paul L. Damren June 16, 2008 – June 17, 2010 || Col. Andrew R. MacMannis June 18, 2010 – June 1, 2012\n|-\n| Col. John E. Merna June 2, 2012-May 20, 2014\n|| Lt. Col. G. Troy Roesti May 21, 2014 to June 9, 2014\n|-\n| Col. Romin Dasmalchi June 9, 2014 – May 20, 2016 ||  Col. Tye R. Wallace May 20, 2016-June 2018\n|-\n| Col. Robert Brodie June 2018-June 25, 2020 ||Col. Michael Nakonieczny July 26, 2020-June 2022\n|-\n|Col. Matthew C. Danner June 2022 - May 2024\n|Col. Chris P. Niedziocha June 2024 – Present\n|}\nUnit awards\nA unit citation or commendation is an award bestowed upon an organization for the action cited. Members of the unit who participated in said actions are allowed to wear on their uniforms the awarded unit citation. The 31st Marine Expeditionary Unit has been presented with the following awards:\n{| class=\"wikitable\" style=\"margin:1em auto;\"\n! Streamer\n! Award\n! Year(s)\n! Additional Info\n|-\n||\n||Presidential Unit Citation Streamer\n||1967\n||Vietnam\n|-\n||\n||Navy Unit Commendation Streamer with three Bronze Stars\n||1968, 1998, 2001–2003, 2004–2005\n||Vietnam, Western Pacific, Iraq\n|-\n||\n||Meritorious Unit Commendation Streamer with two Bronze Stars\n||1975, 1983, 1998–2000\n||Vietnam, Lebanon\n|-\n||\n||Marine Corps Expeditionary Streamer\n||1983\n||Lebanon\n|-\n||\n||National Defense Service Streamer with two Bronze Stars\n||1961–1974, 1990–1995, 2001–present\n||Vietnam War, Gulf War, War on Terrorism\n|-\n||\n||Vietnam Service Streamer with two Silver and four Bronze Stars\n||April 1967 - March 1973, March - April 1975\n||\n|-\n||\n||Global War on Terrorism Expeditionary Streamer\n||2004–2005\n||Iraq\n|-\n||\n||Global War on Terrorism Service Streamer\n||2001 – present\n||\n|-\n||\n||Vietnam Gallantry Cross with Palm Streamer\n||\n||\n|-\n|}\nSee also\n*Marine Air-Ground Task Force\n*List of Marine Expeditionary Units\n*Organization of the United States Marine Corps\nNotes\n:\nReferences\n;Bibliography\n*\n*\nExternal links\n*[http://www.usmc.mil/unit/31stmeu/Pages/default.aspx 31st MEU's official website]"
    }
  ]
}