{
  "content": [
    {
      "type": "text",
      "text": "# 33rd Golden Raspberry Awards\n\nThe 33rd Golden Raspberry Awards, or Razzies, was a parodic award ceremony that identified the worst films the film industry had to offer in 2012, according to votes from members of the Golden Raspberry Foundation. Razzies co-founder John J. B. Wilson has stated that the intent of the awards is \"to be annoying and agenda-driven.\" Nominations were revealed on January 8, 2013. Unlike the previous year, when the winners were announced on April Fools' Day, the winners were announced on February 23, one day before the Academy Awards ceremony, reverting to Razzie tradition. The nominees of worst remake/sequel were selected by the general public via Rotten Tomatoes.\nWinners and nominees\n, Worst Actor winner]]\n, Worst Actress winner]]\n, Worst Supporting Actor winner and Worst Screen Couple co-winner]]\n, Worst Supporting Actress winner]]\n, Worst Screen Couple co-winner]]\n, Worst Director winner]]\n, Worst Screenplay winner]]\n{| class=\"wikitable\"\n|-\n! Category\n! Recipient\n|-\n| rowspan=5|Worst Picture\n|style=\"background:#B0C4DE\"|'The Twilight Saga: Breaking Dawn – Part 2 (Summit)'\n|-\n|Battleship (Universal)\n|-\n|The Oogieloves in the Big Balloon Adventure (Freestyle Releasing/Kenn Viselman Presents)\n|-\n|''That's My Boy (Columbia)\n|-\n|A Thousand Words (Paramount / DreamWorks)\n|-\n| rowspan=5|Worst Actor\n|style=\"background:#B0C4DE\"|'Adam Sandler in ''That's My Boy as Donny Berger'\n|-\n|Nicolas Cage in Ghost Rider: Spirit of Vengeance and Seeking Justice as Johnny Blaze/Ghost Rider and Will Gerard (respectively)\n|-\n|Eddie Murphy in A Thousand Words as Jack McCall\n|-\n|Robert Pattinson in The Twilight Saga: Breaking Dawn – Part 2 as Edward Cullen\n|-\n|Tyler Perry in Alex Cross and Good Deeds as Alex Cross and Wesley Deeds (respectively)\n|-\n| rowspan=5|Worst Actress\n|style=\"background:#B0C4DE\"|'Kristen Stewart in Snow White and the Huntsman and The Twilight Saga: Breaking Dawn – Part 2 as Snow White and Bella Swan' (respectively)\n|-\n|Katherine Heigl in One for the Money as Stephanie Plum\n|-\n|Milla Jovovich in Resident Evil: Retribution as Alice\n|-\n|Tyler Perry in ''Madea's Witness Protection as Madea\n|-\n|Barbra Streisand in The Guilt Trip as Joyce Brewster\n|-\n| rowspan=5| Worst Supporting Actor\n|style=\"background:#B0C4DE\"|'Taylor Lautner in The Twilight Saga: Breaking Dawn – Part 2 as Jacob Black'\n|-\n|David Hasselhoff (as himself) in Piranha 3DD\n|-\n|Liam Neeson in Battleship and Wrath of the Titans as Admiral Terrence Shane and Zeus (respectively)\n|-\n|Nick Swardson in That's My Boy as Kenny\n|-\n|Vanilla Ice (as himself) in That's My Boy\n|-\n| rowspan=5|Worst Supporting Actress\n|style=\"background:#B0C4DE\"|'Rihanna in Battleship as Cora Raikes'\n|-\n|Jessica Biel in Playing for Keeps and Total Recall as Stacie Dryer and Melina (respectively)\n|-\n|Brooklyn Decker in Battleship and What to Expect When You're Expecting as Samantha Shane and Skyler Cooper (respectively)\n|-\n|Ashley Greene in The Twilight Saga: Breaking Dawn – Part 2 as Alice Cullen\n|-\n|Jennifer Lopez in What to Expect When You're Expecting as Holly\n|-\n| rowspan=5|Worst Screen Couple\n|style=\"background:#B0C4DE\"|'Mackenzie Foy and Taylor Lautner in The Twilight Saga: Breaking Dawn – Part 2'\n|-\n|Any two cast members from Jersey Shore in The Three Stooges\n|-\n|Robert Pattinson and Kristen Stewart in The Twilight Saga: Breaking Dawn – Part 2\n|-\n|Tyler Perry and his drag get-up in Madea's Witness Protection\n|-\n|Adam Sandler and either Leighton Meester, Andy Samberg or Susan Sarandon in That's My Boy\n|-\n| rowspan=5|Worst Remake, Rip-off or Sequel\n|style=\"background:#B0C4DE\"|'The Twilight Saga: Breaking Dawn – Part 2 (Summit)'\n|-\n|Ghost Rider: Spirit of Vengeance (Columbia)\n|-\n|Madea's Witness Protection (Lionsgate)\n|-\n|Piranha 3DD (Dimension)\n|-\n|Red Dawn (FilmDistrict)\n|-\n| rowspan=5|Worst Director\n|style=\"background:#B0C4DE\"|'Bill Condon for The Twilight Saga: Breaking Dawn – Part 2'\n|-\n|Sean Anders for That's My Boy\n|-\n|Peter Berg for Battleship\n|-\n|Tyler Perry for Good Deeds and Madea's Witness Protection\n|-\n|John Putch for Atlas Shrugged: Part II\n|-\n| rowspan=5|Worst Screenplay\n|style=\"background:#B0C4DE\"|'''That's My Boy (written by David Caspe)'\n|-\n|Atlas Shrugged: Part II (screenplay by Duke Sandefur, Brian Patrick O'Toole, & Duncan Scott, based on the novel by Ayn Rand)\n|-\n|Battleship (written by Jon Hoeber and Erich Hoeber, based on the boardgame by Hasbro)\n|-\n|A Thousand Words (written by Steve Koren)\n|-\n|The Twilight Saga: Breaking Dawn – Part 2 (screenplay by Melissa Rosenberg, based on the novel by Stephenie Meyer)\n|-\n| rowspan=5|Worst Screen Ensemble\n|style=\"background:#B0C4DE\"|'The entire cast of The Twilight Saga: Breaking Dawn – Part 2'\n|-\n|The entire cast of Battleship\n|-\n|The entire cast of ''Madea's Witness Protection\n|-\n|The entire cast of The Oogieloves in the Big Balloon Adventure\n|-\n|The entire cast of That's My Boy\n|}\nFilms with multiple nominations\nThe following films received multiple nominations:\n{| class=\"wikitable\" rowspan=2 style=\"text-align: center; background: #f6e39c\"\n|-\n! scope=\"col\" width=\"55\" | Nominations\n! scope=\"col\" align=\"center\"| Film\n|-\n| rowspan=\"1\" text-align:center\"| 11\n| The Twilight Saga: Breaking Dawn – Part 2\n|-\n| rowspan=\"1\" text-align:center\"| 8\n| That's My Boy\n|-\n| rowspan=\"1\" style=\"text-align:center\"| 7\n| Battleship\n|-\n| rowspan=\"1\" style=\"text-align:center\"| 5\n| Madea's Witness Protection\n|-\n| rowspan=\"1\" style=\"text-align:center\"| 3\n| A Thousand Words\n|-\n| rowspan=\"6\" |2\n|Atlas Shrugged: Part II\n|-\n|Ghost Rider: Spirit of Vengeance\n|-\n|Good Deeds\n|-\n|The Oogieloves in the Big Balloon Adventure\n|-\n|Piranha 3DD\n|-\n|What to Expect When You're Expecting''\n|}\nReferences"
    }
  ]
}