{
  "content": [
    {
      "type": "text",
      "text": "# 33rd Producers Guild of America Awards\n\n| location      = Fairmont Century Plaza, Los Angeles, California\n| country       = United States\n| presenter     = Producers Guild of America\n| award1_type   = Best Producer(s) Motion Picture:\n| award1_winner = CODA – Fabrice Gianfermi, Philippe Rousselet, and Patrick Wachsberger\n| award2_type   = Best Producer(s) Animated&nbsp;Feature:\n| award2_winner = Encanto – Yvett Merino and Clark Spencer\n| award3_type   = Best Producer(s) Documentary Motion Picture:\n| award3_winner = Summer of Soul (...Or, When the Revolution Could Not Be Televised) – Joseph Patel, David Dinerstein, and Robert Fyvolent\n| award4_type   =\n| award4_winner =\n| award5_type   =\n| award5_winner =\n| previous      = 32nd\n| main          = PGA Awards\n| next          = 34th\n}}\nThe 33rd Producers Guild of America Awards (also known as 2022 Producers Guild Awards or 2022 PGA Awards), honoring the best film and television producers of 2021, were held at the Fairmont Century Plaza in Los Angeles, California on March 19, 2022. Originally scheduled to take place on February 26, 2022, the ceremony was postponed amid a surge in COVID-19 infections due to the Omicron variant. The nominations in the documentary category were announced on December 10, 2021, the nominees in the sports, children's and short-form categories were announced on January 18, 2022, and the remaining nominations for film and television were announced on January 27, 2022. The nominations for the PGA Innovation Award were announced on February 24, 2022.\nWinners and nominees\nFilm\n{| class=wikitable style=\"width=\"100%\"\n|-\n! colspan=\"2\" style=\"background:#abcdef;\"| Darryl F. Zanuck Award for Outstanding Producer of Theatrical Motion Pictures\n|-\n| colspan=\"2\" style=\"vertical-align:top;\"|\n* 'CODA – Fabrice Gianfermi, Philippe Rousselet, and Patrick Wachsberger'\n** Being the Ricardos – Todd Black\n** Belfast – Laura Berwick, Kenneth Branagh, Becca Kovacik, and Tamar Thomas\n** ''Don't Look Up – Adam McKay and Kevin Messick\n** Dune – Mary Parent, Denis Villeneuve, and Cale Boyter\n** King Richard – Tim White, Trevor White, and Will Smith\n** Licorice Pizza – Sara Murphy, Paul Thomas Anderson, and Adam Somner\n** The Power of the Dog – Jane Campion, Tanya Seghatchian, Emile Sherman, Iain Canning, and Roger Frappier\n** Tick, Tick... Boom! – Julie Oh and Lin-Manuel Miranda\n** West Side Story – Steven Spielberg and Kristie Macosko Krieger\n|-\n! colspan=\"2\" style=\"background:#abcdef;\"| Outstanding Producer of Animated Theatrical Motion Pictures\n|-\n| colspan=\"2\" style=\"vertical-align:top;\"|\n* 'Encanto – Yvett Merino and Clark Spencer'\n** Luca – Andrea Warren\n** The Mitchells vs. the Machines – Phil Lord, Christopher Miller, and Kurt Albrecht\n** Raya and the Last Dragon – Osnat Shurer and Peter Del Vecho\n** Sing 2 – Chris Meledandri and Janet Healy\n|-\n! colspan=\"2\" style=\"background:#abcdef;\"| Outstanding Producer of Documentary Theatrical Motion Pictures\n|-\n| colspan=\"2\" style=\"vertical-align:top;\"|\n* 'Summer of Soul (...Or, When the Revolution Could Not Be Televised) – Joseph Patel, David Dinerstein, and Robert Fyvolent'\n** Ascension – Jessica Kingdon, Kira Simon-Kennedy, and Nathan Truesdell\n** The First Wave\n** Flee\n** In the Same Breath – Nanfu Wang, Jialing Zhang, Julie Goldman, Christopher Clements, and Carolyn Hepburn\n** The Rescue\n** Simple as Water – Robin Hessman and Megan Mylan\n** Writing with Fire – Rintu Thomas and Sushmit Ghosh\n|}\nTelevision\n{| class=wikitable style=\"width=\"100%\"\n|-\n! colspan=\"2\" style=\"background:#abcdef;\"| Norman Felton Award for Outstanding Producer of Episodic Television, Drama\n|-\n| colspan=\"2\" style=\"vertical-align:top;\"|\n* 'Succession (HBO) – Jesse Armstrong, Adam McKay, Will Ferrell, Frank Rich, Kevin Messick, Mark Mylod, Jane Tranter, Tony Roche, Scott Ferguson, Jon Brown, Lucy Prebble, Will Tracy, Georgia Pritchett, Ted Cohen, Susan Soon He Stanton, Francesca Gardiner, Dara Schnapper, and Gabrielle Mahon'\n** The Handmaid's Tale (Hulu)\n** The Morning Show (Apple TV+)\n** Squid Game (Netflix)\n** Yellowstone (Paramount Network)\n|-\n! colspan=\"2\" style=\"background:#abcdef;\"| Danny Thomas Award for Outstanding Producer of Episodic Television, Comedy\n|-\n| colspan=\"2\" style=\"vertical-align:top;\"|\n* 'Ted Lasso (Apple TV+) – Bill Lawrence, Jason Sudeikis, Brendan Hunt, Joe Kelly, Jeff Ingold, Bill Wrubel, Jane Becker, Jamie Lee, Liza Katzer, Kip Kroeger, Declan Lowney, Leann Bowen, and Ashley Nicole Black'\n** Cobra Kai (Netflix)\n** Curb Your Enthusiasm (HBO)\n** Hacks (HBO Max) – Jen Statsky, Paul W. Downs, Lucia Aniello, Michael Schur, David Miner, Morgan Sackett, Joanna Calo, Andrew Law, David Hyman, Joe Mande, and Jessica Chaffin\n** Only Murders in the Building (Hulu)\n|-\n! colspan=\"2\" style=\"background:#abcdef;\"| David L. Wolper Award for Outstanding Producer of Limited or Anthology Series Television\n|-\n| colspan=\"2\" style=\"vertical-align:top;\"|\n* 'Mare of Easttown (HBO) – Paul Lee, Mark Roybal, Craig Zobel, Kate Winslet, Brad Ingelsby, Ron Schmidt, and Karen Wacker'\n** Dopesick (Hulu)\n** The Underground Railroad (Amazon)\n** WandaVision (Disney+)\n** The White Lotus (HBO)\n|-\n! colspan=\"2\" style=\"background:#abcdef;\"| Outstanding Producer of Streamed or Televised Motion Pictures\n|-\n| colspan=\"2\" style=\"vertical-align:top;\"|\n* 'Tom Petty, Somewhere You Feel Free: The Making of Wildflowers (YouTube) – Peter Afterman'\n** 8-Bit Christmas (HBO Max) – Tim White, Trevor White, and Allan Mandelbaum\n** Come from Away (Apple TV+)\n** Oslo (HBO)\n** Robin Roberts Presents: Mahalia (Lifetime)\n** Single All the Way (Netflix) – Joel S. Rice)\n|-\n! colspan=\"2\" style=\"background:#abcdef;\"| Outstanding Producer of Non-Fiction Television\n|-\n| colspan=\"2\" style=\"vertical-align:top;\"|\n* 'The Beatles: Get Back (Disney+) – Paul McCartney, Ringo Starr, Yoko Ono Lennon, Olivia Harrison, Peter Jackson, Clare Olssen, Jonathan Clyde, Jeff Jones, and Ken Kamins'\n** 60 Minutes (CBS)\n** Allen v. Farrow (HBO)\n** Queer Eye (Netflix)\n** Stanley Tucci: Searching for Italy (CNN)\n|-\n! colspan=\"2\" style=\"background:#abcdef;\"| Outstanding Producer of Game & Competition Television\n|-\n| colspan=\"2\" style=\"vertical-align:top;\"|\n* '''RuPaul's Drag Race (VH1) – Fenton Bailey, Randy Barbato, Tom Campbell, RuPaul Charles, Mandy Salangsang, Steven Corfe, Michele Mills, Zoe Jackson, John Polly, Lisa Steele, Camilo Valdes, Thairin Smothers, Alicia Gargaro-Magana, Carson Kressley, Ross Mathews, and Michelle Visage'\n** ''America's Got Talent (NBC)\n** Nailed It! (Netflix)\n** Top Chef (Bravo)\n** The Voice (NBC)\n|-\n! colspan=\"2\" style=\"background:#abcdef;\"| Outstanding Producer of Live Entertainment, Variety, Sketch, Standup & Talk Television\n|-\n| colspan=\"2\" style=\"vertical-align:top;\"|\n* 'Last Week Tonight with John Oliver (HBO) – John Oliver, Tim Carvell, Liz Stanton, Jeremy Tchaban, Christopher Werner, Laura L. Griffin, Kate Mullaney, Catherine Owens, Matt Passet, Marian Wang, and Charles Wilson'\n** The Daily Show with Trevor Noah (Comedy Central)\n** Dave Chappelle: The Closer (Netflix)\n** The Late Show with Stephen Colbert (CBS)\n** Saturday Night Live (NBC)\n|-\n! colspan=\"2\" style=\"background:#abcdef;\"| Outstanding Sports Program\n|-\n| colspan=\"2\" style=\"vertical-align:top;\"|\n* '100 Foot Wave (HBO)'\n** Formula 1: Drive to Survive (Netflix)\n** Naomi Osaka (Netflix)\n** Real Sports with Bryant Gumbel (HBO)\n** Tiger'' (HBO)\n|-\n! colspan=\"2\" style=\"background:#abcdef;\"| Outstanding Children's Program\n|-\n| colspan=\"2\" style=\"vertical-align:top;\"|\n* 'Muppets Haunted Mansion (Disney+)'\n** Animaniacs (Hulu)\n** Harry Potter: Hogwarts Tournament of Houses (TBS)\n** See Us Coming Together: A Sesame Street Special (HBO Max)\n** Waffles + Mochi (Netflix)\n|-\n! colspan=\"2\" style=\"background:#abcdef;\"| Outstanding Short-Form Program\n|-\n| colspan=\"2\" style=\"vertical-align:top;\"|\n* 'Carpool Karaoke: The Series (Apple TV)'\n** Full Frontal with Samantha Bee Presents: Pandemic Video Diaries: Vaxxed And Waxxed (TBS)\n** Jordan Klepper Fingers the Pulse – The Daily Show (Comedy Central)\n** Saturday Night Live Presents: Stories from the Show (NBC)\n** Stephen Colbert Presents Tooning Out the News (Paramount+)\n|}\nPGA Innovation Award\n{| class=wikitable style=\"width=\"100%\"\n|-\n! colspan=\"2\" style=\"background:#abcdef;\"| PGA Innovation Award\n|-\n| colspan=\"2\" style=\"vertical-align:top;\"|\n* 'For All Mankind: Time Capsule (Apple)'\n** Artificial: Factions (96 Next)\n** ''Breonna's Garden (YesUniverse)\n** Eschaton (Chorus Productions Holdings, INC)\n** Eternals: AR Story Experience (Walt Disney Studios)\n** Live@Expo (Hovercast)\n** Madrid Noir (Atlas V / No Ghost)\n** Namoo (Baobab Studios)\n** Pacha Mama (Noitom International, Inc.)\n** The MetaMovie Presents: Alien Rescue (The MetaMovie)\n** The Severance Theory: Welcome to Respite (Ferryman Collective)\n** Tutankhamun: Enter the Tomb'' (CityLights)\n|}\nMilestone Award\n* George Lucas and Kathleen Kennedy\nStanley Kramer Award\n* Rita Moreno\nVisionary Award\n* Issa Rae\nDavid O. Selznick Achievement Award in Theatrical Motion Pictures\n* Mary Parent\nNorman Lear Achievement Award in Television\n* Greg Berlanti\nReferences\nExternal links\n* [https://producersguild.org/producers-guild-awards/ PGA Awards website]"
    }
  ]
}