{
  "content": [
    {
      "type": "text",
      "text": "# 378th Air Expeditionary Wing\n\n|country=\n|branch=\n|type=\n|role=expeditionary\n|size=\n|command_structure=Air Combat Command\n|current_commander=\n|garrison=Prince Sultan Air Base, Saudi Arabia\n|website=\n|nickname=\n|motto=\n|colors=\n|march=\n|mascot=\n|battles=\n|notable_commanders=\n|anniversaries=\n|identification_symbol=\n|identification_symbol_label=378th Air Expeditionary Wing emblem\n}}\nThe 378th Air Expeditionary Wing is a provisional United States Air Forces Central Command unit. As a provisional unit, it may be activated or inactivated by Central Command when needed.  It has been garrisoned at Prince Sultan Air Base, Saudi Arabia since 2019.\nThe unit was first activated as the 378th Bombardment Group. It was assigned to the Army Air Forces Antisubmarine Command at Langley Field, Virginia, where it was stationed from October to December 1942.  The group participated in the antisubmarine campaign along the Atlantic coast of the United States until it was inactivated, when the Antisubmarine Command assigned its squadrons directly to the command's two antisubmarine wings.\nMission\nThe mission of 378th Air Expeditionary Wing is to sustain and defend joint and partner forces at Prince Sultan Air Base while projecting combat airpower in support of theater plans and operations.\nStructure\n* 378th Air Expeditionary Wing\n** 378th Expeditionary Operations Group\n***378th Expeditionary Operations Support Squadron\n*** 378th Expeditionary Maintenance Squadron\n** 378th Expeditionary Mission Support Group\n*** 378th Expeditionary Civil Engineer Squadron\n*** 378th Expeditionary Communications Squadron\n***378th Expeditionary Contracting Squadron\n*** 378th Expeditionary Force Support Squadron\n*** 378th Expeditionary Logistics Readiness Squadron\n*** 378th Expeditionary Security Forces Squadron\n**378th Expeditionary Medical Group\nHistory\nWorld War II\nThe group was activated at Langley Field, Virginia on 18 October 1942 with the 520th, 521st, and 523d Bombardment Squadrons assigned.  Although designated a medium bombardment unit, it was equipped with Douglas O-46 and North American O-47 single-engine observation aircraft.\nThe group conducted its operations along the southeastern coast of the United States. Only the 523d Squadron was located with the group's headquarters at Langley. The 520th Squadron operated from Jacksonville Municipal Airport, Florida, while the 521st was stationed at Charleston Army Air Field, South Carolina.\nIn late November, Army Air Forces Antisubmarine Command began a series of organizational actions to more nearly align it with United States Navy headquarters engaged in the antisubmarine campaign.  On 20 November, the 522d Bombardment Squadron at Lantana Airport, Florida was assigned to the group, At the same time, the group's 520th Squadron was attached directly to the new 25th Antisubmarine Wing, which had been established to manage Army Air Forces antisubmarine units in the area of the Navy's Eastern Sea Frontier.  The group's squadrons were redesignated as antisubmarine squadrons.  Finally, in December, after less than two months of operation, the group was inactivated and its component squadrons were reassigned to the 25th Antisubmarine Wing.\nTwenty-first century\nThe unit was converted to provisional status as the 378th Air Expeditionary Group 24 October 2005. It was activated in August 2019, then redesignated the 378th Air Expeditionary Wing on 14 November 2019.\nIn June 2019, members of the 621st Contingency Response Group, \"Devil Raiders\", deployed to Saudi Arabia to reopen Prince Sultan Air Base, servicing fighter aircraft operating from the base from 24 June.  On 31 July the 621st contingent began downsizing, as the 378th Group was activated on 2 August to manage the base.  Although the 621st's mission ended on 13 September, some members remained to assist the 378th until it expanded to become the 378th Air Expeditionary Wing.\nOn 17 December 2019, in response to increasing tensions with Iran, the unit was formally activated as the 378th Air Expeditionary Wing at Prince Sultan Air Base, Saudi Arabia. The newly reactivated wing received its first combat aircraft shortly thereafter, when McDonnell Douglas F-15E Strike Eagles from the 494th Expeditionary Fighter Squadron arrived in early January 2020. The 494th would be replaced by General Dynamics F-16 Fighting Falcons from the Triple Nickel 555th Expeditionary Fighter Squadron in late February 2020. Due to the COVID-19 pandemic, the originally planned March redeployment to Aviano Air Base was rescheduled to 20 April 2020.\nIn addition to hosting the 494th EFS and 555th EFS for traditional CENTCOM deployments, the 378th AEW has also conducted \"Agile Combat Employment\" exercises with Lockheed Martin F-35A Lightning II, Northrop Grumman E-8C JSTARS and Boeing E-3 Sentry. The intent of these exercises (which are considerably shorter than a normal deployment) was to demonstrate the Wing's ability to rapidly increase its number and variety of combat aircraft in the event tensions in the region were to escalate.\nThe wing has supported deployments where numerous operational units have acted as the major force provider of expeditionary units.  These have included:\n: The 77th Expeditionary Fighter Squadron, operating the General Dynamics F-16 Fighting Falcon, October 2020\n: The 430th Expeditionary Electronic Combat Squadron, operating the Bombardier\n* The 494th Expeditionary Fighter Squadron, operating the F-15E Strike Eagle: 3 January - c. 5 March 2020\n*430th Expeditionary Electronic Combat Squadron (E-11A BACN): Unknown - present\nOn 16 May 2020, the Department of Defense confirmed that an undisclosed F-15C Eagle squadron, and United States Marine Corps (USMC) McDonnell Douglas AV-8B Harrier II from Marine Attack Squadron 214 (VMA-214) had replaced the Triple Nickel. The USAF eventually revealed that the F-15C's belonged to the 44th Expeditionary Fighter Squadron.\nHarriers assigned to VMA-214 ended their deployment to Prince Sultan on 21 July 2020, while the F-15C's of the 44th EFS returned to Kadena Air Base by 7 October 2020. F-16C's from the 20th Fighter Wing, 77 EFS arrived on 10 October 2020 to replace the departed AV-8B's and F-15C's.\nLineage\n* Constituted as the 378th Bombardment Group (Medium) on 13 October 1942\n: Activated on 18 December 1942\n: Inactivated on 14 December 1942\n* Redesignated 378th Air Expeditionary Group and converted to provisional status on 24 October 2005\n: Activated on 2 August 2019\n* Redesignated 378th Air Expeditionary Wing on 14 November 2019\nIt operates out of Prince Sultan Airbase, Saudi Arabia.\nAssignments\n* Army Air Forces Antisubmarine Command, 13 October — 14 December 1942\n* Air Combat Command, 2 August 2019 – present\nComponents\n; Groups\n* 378th Maintenance Group, 14 November 2019 – c. 30 June 2020\"\n* 378th Medical Group, 14 November 2019 – present\n* 378th Mission Support Group, 14 November 2019 – present\n* 378th Operations Group, 14 November 2019 – present\n; Squadrons\n* 520th Bombardment Squadron (later 15th Antisubmarine Squadron): 18 October – 14 December 1942 (attached to 25th Antisubmarine Wing after 20 November)\n* 521st Bombardment Squadron (later 16th Antisubmarine Squadron): 18 October – 14 December 1942\n* 522d Bombardment Squadron (later 17th Antisubmarine Squadron): 20 November – 14 December 1942\n* 523d Bombardment Squadron (later 2d Antisubmarine Squadron): 18 - 14 October 14 December 1942\n* 555th EFS (F-16CM Fighting Falcon): February - 20 April 2020\n* Marine Attack Squadron 214 (VMA-214) (AV-8B Harrier II): May 2020 -21 July 2020\n* 44th Expeditionary Fighter Squadron (F-15C Eagle): May 2020 - October 2020\n* 77th Expeditionary Fighter Squadron (F-16C Fighting Falcon): October 2020 — present\n* 968th Expeditionary Airborne Air Control Squadron (E-3G Sentry): March 2022 — present\n* 908th Expeditionary Air Refueling Squadron (KC-10A Extender): March 2022 - present\nStations\n* Langley Field, Virginia, 18 October, - 14 December 1942\n* Prince Sultan Air Base, Saudi Arabia, 17 December 2019 – present\nAircraft\n* Boeing E-3G Sentry\n* Douglas O-46\n* North American O-47\n* General Dynamics F-16CM Fighting Falcon\n* McDonnell Douglas F-15E Strike Eagle\n* McDonnell Douglas F-15C Eagle\n* McDonnell Douglas AV-8B Harrier II\n* McDonnell Douglas KC-10A Extender\n* General Dynamics F-16C Fighting Falcon\n* Bombardier E-11A BACN\nCampaign\n{| class=\"wikitable\"\n|- style=\"background:#efefef;\"\n! Campaign Streamer\n! Campaign\n! Dates\n! Notes\n|-\n|||Antisubmarine||18 October 1942 – 14 December 1942||\n|-\n|||Operation Inherent Resolve||17 December 2019 – present||\n|}\nSee also\n* List of Air Expeditionary units of the United States Air Force\nReferences\nCitations\nBibliography\n*\n*\n*\nExternal links\n*\n*\n*\n*\n*\n*\n*\n*"
    }
  ]
}