{
  "content": [
    {
      "type": "text",
      "text": "# 384th Air Expeditionary Group\n\nThe 384th Air Expeditionary Group (384 AEG) is a provisional United States Air Force unit assigned to the Air Combat Command. The 384 AEG may be activated or inactivated at any time.\nIts last assignment was with to the United States Central Command Air Forces, being stationed at Shaikh Isa Air Base, Bahrain. It was inactivated on 3 September 2003.\nDuring World War II, its predecessor unit, the 384th Bombardment Group was a VIII Bomber Command B-17 Flying Fortress unit in England. Assigned to RAF Grafton Underwood in early 1943, the group dropped the last Eighth Air Force bombs of the war on 25 April 1945.\nHistory\n: For additional history and lineage, see 384th Air Expeditionary Wing\nWorld War II\nLockheed/Vega B-17G-45-VE Fortress Serial 44-8007 \"Screaming Eagle\" of the 545th Bomb Squadron.\nB-17s of the 384th Bomb Group on a bomb run.\nActivated 1 December 1942 at Gowen Field, Idaho. Began training at Wendover, Utah on 2 January 1943 to 1 April 1943. Unit moved to Sioux City AAB, Iowa for final training. The ground unit left for Camp Kilmer on 9 May 1943, sailing on the Queen Elizabeth on 27 May 1943 and arrived in Greenock on 2 June 1943. The aircraft left Sioux City for Kearney, Nebraska on 3 May 1943, and then to the United Kingdom via Bangor, Goose Bay, and then Gander. One B-17 ditched in the Atlantic but the crew was rescued. The first aircraft arrived into England on 25 May 1943, being stationed at RAF Grafton Underwood. The 384th was assigned to the 41st Combat Bombardment Wing of the 1st Bombardment Division. Its tail code was Triangle-P.\nThe Group's targets included aerodromes at Orléans, Bricy, and Nancy; motor works at Cologne; a coking plant at Gelsenkirchen; an aircraft component parts factory at Halberstadt; weapons manufacturers at Solingen; steel works at Magdeburg; and ball-bearing plants at Schweinfurt. The Group made a damaging raid on aircraft factories in central Germany on 11 January 1944 and received a Distinguished Unit Citation for the action.\nThe 384th took part in the campaign of heavy bombers against the German aircraft industry during Big Week, 20–25 February 1944. Received another DUC for the mission of 24 April 1944 when the group, although crippled by heavy losses of men and planes, led the 41st Bomb Wing through almost overwhelming opposition to attack an aircraft factory and airfield at Oberpfaffenhofen. The group also bombed ports, communications centers, oil facilities, and cities, attacking such targets as oil storage plants in Leipzig and Berlin, ports at Hamburg and Emden, and marshalling yards at Duren and Mannheim.\nAt times the Group flew interdictory and support missions. Attacked installations along the coast of Normandy prior to and during the invasion in June 1944 and then bombed airfields and communications beyond the beachhead. Supported ground troops during the breakthrough at Saint-Lô, 24–25 July, by bombing enemy strong points just beyond Allied lines. Hit tank and gun concentrations north of Eindhoven to assist the airborne assault on the Netherlands in September. Struck enemy communications and fortifications during the Battle of the Bulge, December 1944 – January 1945. Aided the Allied assault across the Rhine in March 1945 by attacking marshalling yards, railway junctions, and bridges to cut off enemy supplies.\nFor the 1945 film The Way to the Stars, footage of B-17 Flying Fortresses of the 384th landing and taking off was filmed at RAF Grafton Underwood in April and May 1945. One of the USAAF aircrew involved recorded in his diary seeing B-17s of the 384th and ground scenes being filmed at RAF Grafton Underwood.\nScheduled for occupational air forces and moved to Istres, France in June 1945 to participate in Green Project—which was to move troops to staging areas. Also moved displaced persons and Greek military. In 1946 the remaining aircraft and personnel were absorbed into the 306th Bomb Group and the unit was inactivated at Istres on 28 February 1946.\nBriefly was activated as an Air Force Reserve B-29 Superfortress unit, 1947–1949\nModern era\nOn 1 September 1991, the 384th Operations Group was activated as a result of the 384th Wing implementing the USAF objective wing organization. Upon activation, the 384 OG was bestowed the lineage and history of the 384th Bombardment Group. The 384 OG was assigned control of the 28th Bomb Squadron (B-1B) and the 384th Air Refueling Squadron (KC-135R) as its operational units. 384th Wing was inactivated on 1 January 1994, and 384 OG redesignated as 384th Bomb Group, being assigned to 22d Air Refueling Wing without personnel or equipment. Inactivated on 1 October 1994.\nReactivated as Air Expeditionary Group as part of Global War on Terrorism, 2003.\nLineage\n* Constituted as 384th Bombardment Group (Heavy) on 25 November 1942\n: Activated on 1 December 1942\n: Inactivated on 28 February 1946\n* Redesignated 384th Bombardment Group (Very Heavy)\n: Activated on 16 July 1947\n: Inactivated on 27 June 1949\n* Redesignated 384th Operations Group on 1 September 1991 and activated\n: Redesignated 384th Bomb Group, 1 January 1994\n: Inactivated on 1 October 1994\n* Redesignated 384th Air Expeditionary Group and converted to provisional status on 1 June 2003\n: Activated on 4 June 2003\n: Inactivated on 3 September 2003\nAssignments\n* II Bomber Command, 1 December 1942 – 9 May 1943\n* 1st Bombardment Wing, June 1943\n: Assigned to: 103d Provisional Combat Bombardment Wing, June 1943-13 September 1943\n* 41st Combat Bombardment Wing, 13 September 1943\n* European Air Materiel Command, 16 June 1945 – 28 February 1946\n* Tenth Air Force, 16 July 1947 – 27 June 1949\n* 384th Wing, 1 September 1991\n* 22d Air Refueling Wing, 1 January – 1 October 1994\n* Air Combat Command to activate or inactivate at any time after 1 June 2003\nComponents\n* 28th Bomb Squadron, 1 September 1991 – 1 January 1994\n* 338th Bombardment Squadron, 8 October 1947 – 27 June 1949\n* 339th Bombardment Squadron, 8 October 1947 – 27 June 1949\n* 384th Air Refueling Squadron, 1 September 1991 – 1 January 1994\n* 544th Bombardment Squadron (SU), 1 December 1942 – 25 February 1946; 16 July 1947 – 27 June 1949\n* 545th Bombardment Squadron (JD), 1 December 1942 – 25 February 1946; 16 July 1947 – 27 June 1949\n* 546th Bombardment Squadron (BK), 1 December 1942 – 25 February 1946\n* 547th Bombardment Squadron (SO), 1 December 1942 – 25 February 1946\nStations\n* Gowen Field, Idaho, 1 December 1942\n* Wendover Field, Utah, 2 January 1943\n* Sioux City Army Air Base, Iowa, c. 3 April – 9 May 1943\n* RAF Grafton Underwood (USAAF Station 106), England, June 1943\n* Istres Air Base, France, C. June 1945-28 February 1946\n* Nashville Municipal Airport, Tennessee, 16 July 1947 – 27 June 1949\n* McConnell AFB, Kansas, 1 September 1991 – 1 October 1994\n* Shaikh Isa Air Base, Bahrain, 4 June – 3 September 2003\nAircraft assigned\n* B-17 Flying Fortress, 1942–1946\n* B-29 Superfortress, 1947–1949\n* B-1B Lancer, 1991–1994\n* KC-135 Stratotanker, 1991–1994\nReferences\nNotes\nBibliography\n* Beese, Arthur P. \"Crusaders\": 384th—50th, 1942–1992. Rahway, New York: 384th Bomb Group, 1993.\n* Feider, Leo J. 38 Missions with the 384th Bomb Group, 8th Air Force, Camp Underwood, Kettering, Northamps, England, A Memoir. St. Paul, Minnesota: 1987.\n*\n*\n* Owens, Walter E. As Briefed by Walter H. Owens, a Family History of the 384th Bombardment Group. New York: Edward Stern & Co., 1946 (2nd edition 1980, addendum to 1st edition published 1974).\n* Rogers, Brian. United States Air Force Unit Designations Since 1978. Hinkley, UK: Midland Publications, 2005. .\n* Smith, Dale O. Screaming Eagle: Memoir of a B-17 Group Commander. Chapel Hill, North Carolina: Algonquin Books of Chapel Hill, 1990.\nExternal links\n*\n* [http://www.384thbombgroup.com/ 384th Bomb Group, Inc.], a history-preservation organization of the group's World War II veterans (and, more recently, their descendants)"
    }
  ]
}