{
  "content": [
    {
      "type": "text",
      "text": "# 386th Air Expeditionary Wing\n\n7 August 1945, 1956–1957, 2001–present\n| country                       =\n| allegiance                    =\n| branch                        =\n| type                          =\n| role                          =\n| size                          =\n| command_structure             = United States Air Forces Central\n| garrison                      = Ali Al Salem Air Base, Kuwait\n| anniversaries                 =\n| decorations                   =  AFMUA\n| notable_commanders            = Joe W. Kelly\n| current_commander             = Colonel Sergio E. Anaya\n}}\nThe 386th Air Expeditionary Wing (386 AEW) is a provisional United States Air Force unit assigned to United States Air Forces Central. As a provisional unit, it may be activated or inactivated at any time. It is currently stationed at Ali Al Salem Air Base, Kuwait in Southwest Asia. During World War II, the group's predecessor unit, the 386th Bombardment Group (Medium) was a B-26 Marauder bombardment group assigned to the Eighth and later Ninth Air Force. During the Battle of Normandy, it supported Allied forces at Caen, and participated in the massive blows against the enemy at Saint-Lô on 25 July 1944. The unit knocked out targets to help clear the Falaise pocket of German forces in August 1944 and hit strong points at Brest during September.\nMission\nThe 386th Air Expeditionary Wing has a diverse mission which canvases the CENTCOM AOR. The 386th AEW is the primary aerial hub for Operation Inherent Resolve and provides airlift support for various operations around the CENTCOM AOR.\nUnder the new AFFORGEN concept, which is how the Air Force deploys and presents its forces to the combatant commanders, the 386th AEW now has the 386th Expeditionary Air Base Group, A-staff directorates, the special staff, and various flying units under its command. The 386th EABG is composed of units from Civil Engineering, Security Forces, Logistics, Medical, Communications, Contracting, Force Support and Maintenance. The special staff is composed of legal, public affairs and other helping agencies. The A-staff component is there to provide planning to the operational squadrons and answer requests for information from higher headquarters. The flying units consist of C-130s, MQ-9s and U.S. Army helicopters.\nThe wing's mission is to partner, deliver and support to provide combat power and increase regional stability. Its vision is through teamwork to enhance cooperation, invest in enduring relationships, and cultivate inclusive and innovative warfighters. The three campaign priorities are People, Partnership and Project Combat Power.\nThe wing is also home to one of two contingency aeromedical staging facilities (CASF) in the theater. The CASF serves as a gateway for patients airlifted to Germany or the United States for further medical treatment.\nUnits assigned\nThe following units are assigned:\n* 386th Expeditionary Air Base Group\n* 387th Air Expeditionary Group located at Abdullah Al-Mubarak Air Base (Cargo City) and Ali Al Salem Air Base\n* 407th Air Expeditionary Group located at Ali Al Salem Air Base and Ahmad al-Jaber Air Base\n* 386th Expeditionary Operations Group\nThe 586th Expeditionary Security Forces Squadron was part of the wing's 586th Air Expeditionary Group until it was inactivated in 2008.\nHistory\nMartin B-26B Marauder 41-31737, 552d Bomb Squadron\nMartin B-26B Marauder 41-17876, 552d Bomb Squadron\nMartin B-26C Marauder 41-34946 555th Bomb Squadron\nStaff Sgt. Jeffrey Weeks, 386th Expeditionary Aircraft Maintenance Squadron, marshals an EC-130H Compass Call on the flightline\nA U.S. Air Force B-1B Lancer aircraft sits on the hot ramp waiting to be refueled and approved to launch by the 386th Air Expeditionary Wing\nAirmen from the 386th Air Expeditionary Wing proudly render a final salute to C-130 aircraft, tail number 63-7865, from Ramstein AB, Germany, at Ali Al Salem Air Base, Kuwait, in Southwest Asia. The aircraft had just flown its last combat mission and will be flown to Davis–Monthan AFB, Ariz., where it will be laid to rest at the \"boneyard.\" The C-130 became an honorary purple heart recipient in June 1972 for damages sustained from mortar fire in the Vietnam War.\nWorld War II\nThe unit was constituted as the 386th Bombardment Group (Medium) on 25 November 1942, and was activated on 1 December 1942 at MacDill Field, Florida. The group was equipped with the Martin B-26 Marauder medium bomber. Its operational squadrons were the 552d (RG), 553d (AN), 554th (RU) and 555th (YA)\nAfter training at several airfields in the United States, the group was deployed to Europe in June 1943 and was assigned initially to the 3rd Bombardment Wing of the Eighth Air Force at RAF Snetterton Heath, England. The group remained at Snetterton Heath only a few days, being transferred to RAF Boxted in north Essex on 10 June 1943 where the Martin B-26 Marauder groups were being consolidated for operations and retrained in medium altitude bombing after low level tactics had produced disastrous losses. The group flew its first mission on 30 July, with operations concentrating on airfields but also attacked marshalling yards and gun positions along the channel coast.\nThe 386th was again transferred to RAF Great Dunmow on 24 September 1943. Missions of the 386th concentrated on airfields but also bombed marshalling yards and gun positions during the first months of combat. In common with all B-26 Marauder units of the Eighth Air Force, the 386th was transferred to Ninth Air Force on 16 October 1943.\nTactical operations were carried out against V-weapon sites along the coast of France in the winter of 1943–1944, and bombed airfields in the Netherlands and Belgium during Big Week, 20–25 February 1944.\nGreat Dunmow was the first airfield visited by General Eisenhower in his USAAF airfield tour on Tuesday, 11 April 1944, and he arrived in time to see thirty-nine Ninth Air Force Marauders take off at twenty second intervals for a mission to attack the marshalling yards in Charleroi, Belgium.\nThe 386th hammered gun positions, and airfields preceding the invasion of Normandy and made numerous assaults on bridges of the Seinelate in May. Struck coastal batteries on D-Day and hit bridges, supply and fuel stores, gun positions, and defended areas during the remainder of the Battle of Normandy. Supported Allied forces at Caen, and participated in the massive blows against the enemy at Saint-Lô on 25 July 1944. Knocked out targets to help clear the Falaise pocket of German forces in August 1944 and hit strong points at Brest during September.\nIn July 1944, the 553rd Bomb Squadron was selected to host the squadron performing operational testing on the new Douglas A-26 Invader. A special squadron of A-26s was attached to the 386th Bombardment Group by order of \"Special Operations Order #205, Project 3AF JY Class TM 0725\", which created the \"A-26 Combat Evaluation Project Squadron\" - or simply, Project Squadron to the crews. This squadron conducted eight combat missions with the 386th between 6 Sep 1944 and 19 Sep 1944. Having successfully completed their evaluation assignment, the Project Squadron was detached from the 386th and transferred to the 416th Bombardment Group to train their pilots on converting over to the A-26.\nOn 2 October 1944, the 386th Bomb Group moved to Beaumont-sur-Oise (A-60) Airfield, in Normandy, France. On the continent, the 386th BG used the following Advanced Landing Grounds:\n* A-60 Beaumont-sur-Oise, France, 2 October 1944\n* A-92 St Trond, Belgium, 9 April – July 1945\nWhile the unit was at Beaumont-sur-Oise, they were fully converted from the B-26 Marauder to the A-26 Invader. By March 1945, the 386th Bomb Group was flying Invaders in combat missions and the old B-26s had been retired stateside.\nAfter V-E Day, the group returned to the United States, first to Seymour Johnson AFB, then to Westover AFB where the unit was disbanded and their aircraft was dispersed. The 386th Bomb Group was inactivated on 7 November 1945.\nCold War\nNorth American F-100A-20-NA Super Sabre 53-1697 of the 323d Fighter-Bomber Wing, Bunker Hill AFB, Indiana\nThe 386th Troop Carrier Wing, Medium was established on 23 March 1953, but was never made active nor assigned any aircraft or mission.\nThe 386th Fighter-Bomber Group was activated on 8 April 1956 at Bunker Hill AFB, Indiana as part of the 323d Fighter-Bomber Wing. Assigned to the Tactical Air Command, the group had three squadrons, 552d, 553d and 554th. Initially training with North American F-86Fs, these were quickly upgraded to the North American F-86H Sabre and then to the North American F-100A to become proficient in tactical air operations.\nThe wing's aircraft wore a band on the tail, and around the nose edged with small black checkers.\nIn 1955, Strategic Air Command (SAC) began stationing units at the base, and the Eighth Air Force claimed jurisdiction of Bunker Hill AFB in September 1957. With the turnover of the base to SAC, the 323d was phased down and replaced by the SAC 401st Air Base Group on 1 September 1957.\nIraq War\nColonel Al Allenback \"established and commanded the 9th Air Expeditionary Group at Ali Al Salem Air Base, Kuwait, during Operation Desert Thunder.\"\nIn 1998, in preparation for Operation Desert Fox, the 9th Air Expeditionary Group stood up and in 2001 was redesignated as the 386th Air Expeditionary Group.\nEffective Aug. 12, 2002, a few months prior to the start of the Iraq War, the 386th Air Expeditionary Group was redesignated the 386th Air Expeditionary Wing and aligned under the 9th Air Expeditionary Task Force. At the same time, the 363d Air Expeditionary Wing was being inactivated.\nThis unit was literally at the forefront of Operation Southern Watch. For several years following the Persian Gulf War, the base was a sleepy radar site, manned by just a handful of Air Force people monitoring air traffic in the southern Iraq no-fly zone. The 74th Air Control Squadron deployed from August to November 1995 to set up and operate a radar site—the only source of a 24-hour air picture in-theater – as part of Operation Vigilant Sentinel. Exactly one year later, 74th ACS personnel deployed once again, this time for 120 days in support of Southern Watch and Operation Desert Strike.\nAfter tensions in the region flared in late 1997, coalition forces started massing at the base. When the buildup renewed in November 1998, prior to Operation Desert Fox, the base doubled in size to a population of 1,500.\nThe 9th Air Expeditionary Group provided air surveillance and control through that same radar site, while a fleet of C-130 Hercules provide theater airlift and, if necessary, combat search and rescue and aeromedical evacuation for Operation Southern Watch forces. The 9th AEG brought all those functions under one umbrella. Life on The Rock was austere, even by the standards of Southwest Asia's deployed locations. Many Air Force people at other Southern Watch bases lived and worked in permanent buildings but The Rock was almost entirely a tent city, with very few actual buildings. Most \"buildings\" were Quonset-shaped, foldable general purpose structures.\nDuring the summer of 2001, Airmen from all over the world were called to participate in Operation Southern Watch's AEF-6, also called the 386th Air Expeditionary Group. From the late spring to early fall, the active duty Airmen were joined by members of the Air National Guard and Air Force Reserve. Although from different divisions of the same service, they personified the \"seamless air force\" concept.\nAir Expeditionary Force Eight came to a hot start under the desert sun when members of the 729th Air Control Squadron from Hill AFB, Utah, arrived in August 2001. There was a two-thirds changeover of base personnel due to AEF Eight rotations. Approximately one-third of the members assigned to the 729th ACS deployed to here assuming duties as the 386th Expeditionary Air Control Squadron for the next 90 days.\nThe 386th EACS began focused preparations for the deployment about six months earlier. Their wartime mission was to deploy to potentially austere environments, so the base here was not much of a departure. The 386th EACS also conducted field training in the desert environment of Western Utah to practice chemical warfare, security and other combat skills.\nIn 2000, the first hardened structures were built here. Hardened structures continue to be built on The Rock.\nLineage\n* Established as 386th Bombardment Group (Medium) on 25 November 1942\n: Activated on 1 December 1942\n: Redesignated: 386th Bombardment Group, Medium, on 20 August 1943\n: Redesignated: 386th Bombardment Group, Light, on 23 June 1945\n: Inactivated on 7 November 1945\n* Redesignated 386th Fighter-Bomber Group on 31 October 1955\n: Activated on 8 April 1956\n: Inactivated on 8 July 1957\n* Redesignated 386th Tactical Fighter Group on 31 July 1985 (Remained inactive)\n* Redesignated 386th Air Expeditionary Group, and converted to provisional status, on 25 July 2000\nAssignments\n* III Bomber Command, 1 December 1942\n* Eighth Air Force, c. 2 June 1943\n* 3d Bombardment Wing, 4 June 1943\n* IX Bomber Command, 16 October 1943\n* 98th Combat Bombardment (later, 98th Bombardment) Wing, 5 December 1943\n* First Air Force, August-7 November 1945\n* Ninth Air Force, 8 April 1956 – 8 July 1957\n* Air Combat Command to activate or inactivate any time after 25 July 2000\nComponents\n* 552d Bombardment (later Fighter-Bomber) Squadron (RG), 1 December 1942 – 7 November 1945; 8 April 1956 – 8 July 1957\n* 553d Bombardment (later Fighter-Bomber) Squadron (AN), 1 December 1942 – 7 November 1945; 8 April 1956 – 8 July 1957\n* 554th Bombardment (later Fighter-Bomber) Squadron (RU), 1 December 1942 – 7 November 1945; 8 April 1956 – 8 July 1957\n* 555th Bombardment Squadron (YA), 1 December 1942 – 7 November 1945\n* 586th Expeditionary Mission Support [later Air Expeditionary] Group, September 2005 – 17 June 2010\n* 586th Expeditionary Security Forces Squadron, March 2005 – December 2008\n* 886th Expeditionary Security Forces Squadron, ? – May 2008\n* 887th Expeditionary Security Forces Squadron, ? – December 2009\n* 586th Expeditionary Support Squadron, ? – 2010\nBases assigned\n* MacDill Field, Florida, 1 December 1942\n* Lake Charles AAB, Louisiana, 9 February-8 May 1943\n* RAF Snetterton Heath (AAF-138), England, 3 June 1943\n* RAF Boxted (AAF-150), England, 10 June 1943\n* RAF Great Dunmow (AAF-164), England, 24 September 1943\n* Beaumont-sur-Oise Airfield (A-60), France 2 October 1944\n* Sint-Truiden Airfield (A-92), Belgium, 9 April – 27 July 1945\n* Seymour Johnson Field, North Carolina, 7 August 1945\n* Westover Field, Massachusetts, 30 September – 7 November 1945\n* Bunker Hill AFB, Indiana, 8 April 1956 – 8 July 1957\n* Ali Al Salem Air Base, Kuwait, September 2000–present\nMajor aircraft flown\n* Martin B-26 Marauder, 1942–1944\n* Douglas A-26 Invader, Aug 1944–1956\n* North American F-86F/H Sabre, 1956–1957\n* North American F-100 Super Sabre, 1957\n* 2003 – January – GR-4, C-130E, RQ-1B, RC-12, MQ-1\n* 2003 – December – C-130H, C130E, C-12, UC-35, C-23\n* 2004 – April – C-130H, C-12, UC-25, C-23\n* 2004 – June–Present – C-130E, C-130H, EC-130\nSee also\n* List of Martin B-26 Marauder operators\nReferences\nNotes\nBibliography\n* Freeman, Roger A. Airfields of the Eighth: Then and Now. After the Battle, 1978. .\n* Freeman, Roger A. The Mighty Eighth: The Colour Record. Cassell & Co., 1991. .\n* Freeman, Roger A. The Ninth Air Force in Colour: UK and the Continent-World War Two. After the Battle, 1996. .\n* Freeman, Roger A. UK Airfields of the Ninth: Then and Now. After the Battle, 1994. .\n*\n*\n*\n*\n* Uncredited. The History of a Bombing Outfit: The 386th Bomb Group. St. Truiden, Belgium: De Geneffe, 1945.\n* Young, Barnett (ed.) The Story of the Crusaders: The 386th Bomb Group (M) in World War II. Fort Myers, Florida: 386th Bomb Group, Inc., 1988 (2nd Edition. Ft. Myers, Florida: 386th Bomb Group Association, 1991).\n* \"US Air Force Air Power Directory\" World Airpower Journal. Aerospace Publishing: London, 1992. .\nExternal links\n* [https://www.afcent.af.mil/Units/386th-Air-Expeditionary-Wing/ Official website]\n* [https://web.archive.org/web/20110525092818/http://www.b26.com/historian/chester_klier.htm Diary of the 386th Bomb Group]"
    }
  ]
}