{
  "content": [
    {
      "type": "text",
      "text": "# 39th Primetime Emmy Awards\n\n| September 12, 1987\n}}\n| location = Pasadena Civic Auditorium, Pasadena, California\n| presenter = Academy of Television Arts and Sciences\n| host     = Bruce Willis\n| most_awards = Promise (5)\n| most_nominations = L.A. Law (13)\n| award1_type = Outstanding Comedy Series\n| award1_winner = The Golden Girls\n| award2_type = Outstanding Drama Series\n| award2_winner = L.A. Law\n| award3_type = Outstanding Miniseries\n| award3_winner = A Year in the Life\n| award4_type = Outstanding Variety, Music or Comedy Program\n| award4_winner = 41st Tony Awards\n| network  = Fox\n| producer =\n| previous = 38th\n| main     =\n| next     = 40th\n}}\nThe 39th Primetime Emmy Awards were held on Sunday, September 20, 1987. The ceremony was broadcast on Fox for the first time, as the network premiered a year earlier from the Pasadena Civic Auditorium in Pasadena, California.\nFor the second straight year, The Golden Girls won the Primetime Emmy Award for Outstanding Comedy Series. The winner for the Primetime Emmy Award for Outstanding Drama Series was L.A. Law, which, for its first season, won four major awards, and led all shows, with 13 major nominations. The winner for Outstanding Drama/Comedy Special, Promise, set a new record, with five major wins. This record was tied by Temple Grandin in 2010, but still stands for TV movies. The Tracey Ullman Show received three major nominations on the night, making it the first ceremony in which the network Fox received a major nomination. This was the only time that Hill Street Blues wasn't nominated for Outstanding Drama Series, in its seventh and last season; also, no male actors of Hill Street Blues were nominated (even with 20 previous nominations). Only Betty Thomas for Outstanding Supporting Actress in a Drama Series was nominated, and did not win, making her the only one in the cast to be nominated in all seasons.\nNBC continued its dominance of the field, becoming the first network to gain over eighty major nominations (82). Its résumé was highlighted by gaining all five nominations for Outstanding Comedy Series. This had been done only once before (in 1977, but with a field of only four shows), and has not been matched in either field since.\nWinners and nominees\nPrograms\n{| class=\"wikitable\"\n|+\n|-\n| style=\"vertical-align:top;\" |\n* 'The Golden Girls (NBC)'\n** Cheers (NBC)\n** The Cosby Show (NBC)\n** Family Ties (NBC)\n** Night Court (NBC)\n| style=\"vertical-align:top;\" |\n* 'L.A. Law (NBC)'\n** Cagney & Lacey (CBS)\n** Moonlighting (ABC)\n** Murder, She Wrote (CBS)\n** St. Elsewhere (NBC)\n|-\n| style=\"vertical-align:top;\" |\n* 'Promise (CBS)'\n** Escape from Sobibor (CBS)\n** LBJ: The Early Years (NBC)\n** Pack of Lies (CBS)\n** Unnatural Causes (NBC)\n| style=\"vertical-align:top;\" |\n* 'A Year in the Life (NBC)'\n** Anastasia: The Mystery of Anna (NBC)\n** Nutcracker: Money, Madness and Murder (NBC)\n** Out on a Limb (ABC)\n** The Two Mrs. Grenvilles (NBC)\n|-\n| style=\"vertical-align:top;\" colspan=\"2\"|\n* 'The 41st Annual Tony Awards (CBS)'\n** Late Night with David Letterman (NBC)\n** Liberty Weekend (ABC)\n** The Tonight Show Starring Johnny Carson (NBC)\n** The Tracey Ullman Show (Fox)\n|}\nActing\nLead performances\n{| class=\"wikitable\"\n|+\n|-\n| style=\"vertical-align:top;\" |\n* 'Michael J. Fox as Alex P. Keaton in Family Ties (NBC) (Episode: \"A, My Name is Alex\")'\n** Harry Anderson as Judge Harry T. Stone in Night Court (NBC)\n** Ted Danson as Sam Malone in Cheers (NBC) (Episode: \"Diamond Sam\")\n** Bob Newhart as Dick Loudon in Newhart (CBS) (Episode: \"Co-Hostess Twinkie\")\n** Bronson Pinchot as Balki Bartokomous in Perfect Strangers (ABC)\n| style=\"vertical-align:top;\" |\n* 'Rue McClanahan as Blanche Devereaux in The Golden Girls (NBC) (Episode: \"End of the Curse\")'\n** Bea Arthur as Dorothy Zbornak in The Golden Girls (NBC) (Episode: \"The Stan Who Came to Dinner\")\n** Blair Brown as Molly Dodd in The Days and Nights of Molly Dodd (NBC)\n** Jane Curtin as Allison Lowell in Kate & Allie (CBS)\n** Betty White as Rose Nylund in The Golden Girls (NBC) (Episode: \"Isn't It Romantic?\")\n|-\n| style=\"vertical-align:top;\" |\n* 'Bruce Willis as David Addison Jr. in Moonlighting (ABC) (Episode: \"Big Man on Mulberry Street\")'\n** Corbin Bernsen as Arnie Becker in L.A. Law (NBC)\n** William Daniels as Dr. Mark Craig in St. Elsewhere (NBC)\n** Ed Flanders as Dr. Donald Westphall in St. Elsewhere (NBC)\n** Edward Woodward as Robert McCall in The Equalizer (CBS)\n| style=\"vertical-align:top;\" |\n* 'Sharon Gless as Christine Cagney in Cagney & Lacey (CBS) (Episode: \"Turn, Turn, Turn\")'\n** Tyne Daly as Mary Beth Lacey in Cagney & Lacey (CBS)\n** Susan Dey as Grace Van Owen in L.A. Law (NBC)\n** Jill Eikenberry as Ann Kelsey in L.A. Law (NBC)\n** Angela Lansbury as Jessica Fletcher in Murder, She Wrote (CBS)\n|-\n| style=\"vertical-align:top;\" |\n* 'James Woods as D.J. in Promise (CBS)'\n** Alan Arkin as Leon Feldhendler in Escape from Sobibor (CBS)\n** James Garner as Bob Beuhler in Promise (CBS)\n** Louis Gossett Jr. as Mathu in A Gathering of Old Men (CBS)\n** Randy Quaid as President Lyndon Johnson in LBJ: The Early Years (NBC)\n| style=\"vertical-align:top;\" |\n* 'Gena Rowlands as Betty Ford in The Betty Ford Story (ABC)'\n** Ann-Margret as Ann Arden Grenville in The Two Mrs. Grenvilles (NBC)\n** Ellen Burstyn as Barbara Jackson in Pack of Lies (CBS)\n** Lee Remick as Frances Schreuder in Nutcracker: Money, Madness and Murder (NBC)\n** Alfre Woodard as Maude DeVictor in Unnatural Causes (NBC)\n|}\nSupporting performances\n{| class=wikitable width=\"100%\"\n| style=\"vertical-align:top;\" |\n* 'John Larroquette as Dan Fielding in Night Court'' (NBC) (Episode: \"Dan's Operation\")'\n** Woody Harrelson as Woody Boyd in Cheers (NBC)\n** Tom Poston as Clayton George Utley in Newhart (CBS)\n** Peter Scolari as Michael Harris in Newhart (CBS)\n** George Wendt as Norm Peterson in Cheers (NBC)\n| style=\"vertical-align:top;\" |\n* 'Jackée Harry as Sandra Clark in 227 (NBC) (Episode: \"The Washington Affair\") '\n** Justine Bateman as Mallory Keaton in Family Ties (NBC)\n** Julia Duffy as Stephanie Vanderkellen in Newhart (CBS)\n** Estelle Getty as Sophia Petrillo in The Golden Girls (NBC)\n** Rhea Perlman as Carla Tortelli in Cheers (NBC)\n|-\n| style=\"vertical-align:top;\" |\n* 'John Hillerman as Higgins on Magnum, P.I. (CBS) (Episode: \"Autumn Warrior\")'\n** Ed Begley Jr. as Dr. Victor Ehrlich in St. Elsewhere (NBC)\n** John Karlen as Harvey Lacey in Cagney & Lacey (CBS)\n** Jimmy Smits as Victor Sifuentes in L.A. Law (NBC)\n** Michael Tucker as Stuart Markowitz in L.A. Law (NBC)\n| style=\"vertical-align:top;\" |\n* 'Bonnie Bartlett as Ellen Craig in St. Elsewhere (NBC) (Episode: “Last Dance at the Wrecker's Ball\")'\n** Allyce Beasley as Agnes DiPesto in Moonlighting (ABC)\n** Christina Pickles as Nurse Helen Rosenthal in St. Elsewhere (NBC)\n** Susan Ruttan as Roxanne Melman in L.A. Law (NBC)\n** Betty Thomas as Sgt. Lucille Bates in Hill Street Blues (NBC)\n|-\n| style=\"vertical-align:top;\" |\n* 'Dabney Coleman as Martin Costigan in Sworn to Silence (ABC)'\n** Stephen Collins as Billy Grenville Jr. in The Two Mrs. Grenvilles (NBC)\n** John Glover as Richard Behrens in Nutcracker: Money, Madness and Murder (NBC)\n** Laurence Olivier as Harry Burrard in Lost Empires (PBS)\n** Eli Wallach as Norman Voss in Something in Common (CBS)\n| style=\"vertical-align:top;\" |\n* 'Piper Laurie as Annie Gilbert in Promise (CBS)'\n** Claudette Colbert as Alice Grenville in The Two Mrs. Grenvilles (NBC)\n** Olivia de Havilland as Dowager Empress Maria in Anastasia: The Mystery of Anna (NBC)\n** Christine Lahti as Alethea Milford in Amerika (ABC)\n** Elizabeth Wilson as Berenice Bradshaw in Nutcracker: Money, Madness and Murder (NBC)\n|}\nGuest performances\n{| class=wikitable width=\"100%\"\n| style=\"vertical-align:top;\" |\n* 'John Cleese as Dr. Simon Finch-Royce in Cheers (NBC) (Episode: \"Simon Says\")'\n** Art Carney as James \"Weasel\" Cavanaugh in The Cavanaughs'' (CBS) (Episode: \"He Ain't Heavy\")\n** Herb Edelman as Stan Zbornak in The Golden Girls (NBC) (Episode: \"The Stan Who Came To Dinner\")\n** Lois Nettleton as Jean in The Golden Girls (NBC) (Episode: \"Isn't It Romantic?\")\n** Nancy Walker as Angela in The Golden Girls (NBC) (Episode: \"Long Day's Journey Into Marinara\")\n| style=\"vertical-align:top;\" |\n* 'Alfre Woodard as Adrian Moore in L.A. Law (NBC) (Episode: \"Pilot\")'\n** Steve Allen as Lech Osoranski in St. Elsewhere (NBC) (Episode: \"Visiting Daze\")\n** Jeanne Cooper as Gladys Becker on L.A. Law (NBC) (Episode: \"Fry Me to the Moon\")\n** Edward Herrmann as Father Joseph McCabe on St. Elsewhere (NBC) (Episode: \"Where There's Hope, There's Crosby\")\n** Jayne Meadows as Holga Oseransky in St. Elsewhere (NBC) (Episode: \"Visiting Daze\")\n|}\nIndividual performances\n{| class=wikitable width=\"100%\"\n| style=\"vertical-align:top;\" |\n* 'Robin Williams – Carol, Carl, Whoopi and Robin (ABC)'\n** Billy Crystal – The 29th Annual Grammy Awards (CBS)\n** Julie Kavner – The Tracey Ullman Show (Fox)\n** Angela Lansbury – The 41st Annual Tony Awards (CBS)\n** Jon Lovitz – Saturday Night Live (NBC)\n|}\nDirecting\n{| class=\"wikitable\"\n|+\n|-\n| style=\"vertical-align:top;\" |\n* 'The Golden Girls'' (NBC): \"Isn't It Romantic?\" – Terry Hughes'\n** Cheers (NBC): \"Chambers vs. Malone\" – James Burrows\n** The Cosby Show (NBC): \"I Know That You Know\" – Jay Sandrich\n** Designing Women (CBS): \"The Beauty Contest\" – Jack Shea\n** Family Ties (NBC): \"A, My Name is Alex\" – Will Mackenzie\n| style=\"vertical-align:top;\" |\n* 'L.A. Law (NBC): \"Pilot\" – Gregory Hoblit'\n** Cagney & Lacey (CBS): \"Turn, Turn, Turn - Part II\" – Sharron Miller\n** L.A. Law (NBC): \"The Venus Butterfly\" – Donald Petrie\n** Moonlighting (ABC): \"Atomic Shakespeare\" – Will Mackenzie\n** Moonlighting (ABC): \"I Am Curious ... Maddie\" – Allan Arkush\n|-\n| style=\"vertical-align:top;\" |\n* 'The Kennedy Center Honors: A Celebration of the Performing Arts (CBS) – Don Mischer'\n** The 41st Annual Tony Awards (ABC) – Walter C. Miller\n** Late Night with David Letterman Fifth Anniversary Special (NBC) – Hal Gurnee\n** Liberty Weekend (ABC) – Dwight Hemion\n** The Tracey Ullman Show (Fox): \"Golf\" – Ted Bessell and Stuart Margolin\n| style=\"vertical-align:top;\" |\n* 'Promise (CBS) – Glenn Jordan'\n** Escape from Sobibor (CBS) – Jack Gold\n** LBJ: The Early Years (NBC) – Peter Werner\n** Nutcracker: Money, Madness and Murder (NBC): \"Part I\" – Paul Bogart\n** Unnatural Causes (NBC) – Lamont Johnson\n|}\nWriting\n{| class=\"wikitable\"\n|+\n|-\n| style=\"vertical-align:top;\" |\n* 'Family Ties (NBC): \"A, My Name is Alex\" – Gary David Goldberg and Alan Uger'\n** Cheers (NBC): \"Abnormal Psychology\" – Janet Leahy\n** The Days and Nights of Molly Dodd'' (NBC): \"Here's Why Cosmetics Should Come in Unbreakable Bottles\" – Jay Tarses\n** The Golden Girls (NBC): \"Isn't It Romantic?\" – Jeffrey Duteil\n** Newhart (CBS): \"Co-Hostess Twinkie\" – David Mirkin\n| style=\"vertical-align:top;\" |\n* 'L.A. Law (NBC): \"The Venus Butterfly\" – Steven Bochco and Terry Louise Fisher'\n** Cagney & Lacey (CBS): \"Turn, Turn, Turn - Part 1\" – Georgia Jeffries\n** Hill Street Blues (NBC): \"It Ain't Over Till It's Over\" – Jeff Lewis, David Milch and John Romano\n** L.A. Law (NBC): \"Sidney, the Dead-Nosed Reindeer\" – William M. Finkelstein\n** Moonlighting (ABC): \"Atomic Shakespeare\" – Jeff Reno and Ron Osborn\n** Moonlighting (ABC): \"I Am Curious ... Maddie\" –\n** St. Elsewhere (NBC): \"Afterlife\" – Tom Fontana, John Tinker and John Masius\n|-\n| style=\"vertical-align:top;\" |\n* 'Late Night with David Letterman Fifth Anniversary Special (NBC)'\n** The 41st Annual Tony Awards (CBS)\n** Saturday Night Live (NBC)\n** The Tracey Ullman Show (Fox): \"Girl on a Ledge\"\n** The Tonight Show Starring Johnny Carson (NBC)\n| style=\"vertical-align:top;\" |\n* 'Promise (CBS) – '\n** Escape from Sobibor (CBS) – Reginald Rose\n** Nutcracker: Money, Madness and Murder (NBC): \"Part II\" – William Hanley\n** Pack of Lies (CBS) – Hugh Whitemore\n** A Year in the Life (NBC): \"The First Christmas\" – Joshua Brand and John Falsey\n|}\nMost major nominations\n{| class=\"wikitable\"\n|+Networks with multiple major nominations\n|-\n! Network !! Number ofNominations\n|-\n| NBC || 82\n|-\n| CBS || 36\n|-\n| ABC || 15\n|}\n{| class=\"wikitable\"\n|+Programs with multiple major nominations\n|-\n! Program !! Category !! Network !! Number ofNominations\n|-\n| L.A. Law || Drama || rowspan=\"4\"|NBC || 11\n|-\n| The Golden Girls || Comedy || rowspan=\"2\"|10\n|-\n| St. Elsewhere || Drama\n|-\n| Cheers || Comedy || 8\n|-\n| Moonlighting || rowspan=\"2\"|Drama || ABC || 7\n|-\n| Cagney & Lacey || CBS || rowspan=\"3\"|6\n|-\n| Nutcracker: Money, Madness and Murder || Miniseries || NBC\n|-\n| Promise || Special || CBS\n|-\n| Family Ties || rowspan=\"2\"|Comedy || NBC || rowspan=\"2\"|5\n|-\n| Newhart || rowspan=\"3\"|CBS\n|-\n| The 41st Annual Tony Awards || Variety || rowspan=\"4\"|4\n|-\n| Escape from Sobibor || Special\n|-\n| The Tracey Ullman Show || Variety || Fox\n|-\n| The Two Mrs. Grenvilles || Miniseries || rowspan=\"3\"|NBC\n|-\n| LBJ: The Early Years || Special  || rowspan=\"4\"|3\n|-\n| Night Court || Comedy\n|-\n| Pack of Lies || rowspan=\"2\"|Special || CBS\n|-\n| Unnatural Causes || rowspan=\"6\"|NBC\n|-\n| Anastasia: The Mystery of Anna || Miniseries || rowspan=\"10\"|2\n|-\n| The Cosby Show || rowspan=\"2\"|Comedy\n|-\n| The Days and Nights of Molly Dodd\n|-\n| Hill Street Blues || Drama\n|-\n| Late Night with David Letterman Fifth Anniversary Special || rowspan=\"2\"|Variety\n|-\n| Liberty Weekend || ABC\n|-\n| Murder, She Wrote || Drama || CBS\n|-\n| Saturday Night Live || rowspan=\"2\"|Variety || rowspan=\"3\"|NBC\n|-\n| The Tonight Show Starring Johnny Carson\n|-\n| A Year in the Life || Miniseries\n|}\nMost major awards\n{| class=\"wikitable\"\n|+Networks with multiple major awards\n|-\n! Network !! Number ofAwards\n|-\n| NBC || 15\n|-\n| CBS || 9\n|-\n| ABC || 3\n|}\n{| class=\"wikitable\"\n|+Programs with multiple major awards\n|-\n! Program !! Category !! Network !! Number ofAwards\n|-\n| Promise || Special || CBS || 5\n|-\n| L.A. Law || Drama || rowspan=\"3\"|NBC || 3\n|-\n| The Golden Girls || rowspan=\"2\"|Comedy || 3\n|-\n| Family Ties || 2\n|}\n;Notes\nReferences\nExternal links\n* [http://www.emmys.com/awards/nominees-winners/1987 Emmys.com list of 1987 Nominees & Winners]\n*"
    }
  ]
}