{
  "content": [
    {
      "type": "text",
      "text": "# 3rd century in Lebanon\n\n{| class=\"infobox\" style=\"width: 350px; text-align: center;\"\n|-\n| 3rd century in Lebanon\n|-\n| Key event(s):\n|-\n|\n|-\n|, a Lebanese Roman jurist born in Tyre. He was considered one of the great legal authorities of his time and was one of the five jurists upon whom decisions were to be based according to the Law of Citations of Valentinian III.]]\n|-\n| Chronology:\n|-\n|\n|}\nThis article lists historical events that occurred between 201–300 in modern-day Lebanon or regarding its people.\nAdministration\nSeveran dynasty\nDuring the early third century, coastal cities of Phoenicia and numerous \"Punic\" cities of North Africa saw substantial construction by Septimius Severus and his successors, who specifically adorned Lepcis Magna, which was connected to the metropolis of Tyre by coins and inscriptions. Tyre's coins from the Severan period depict Dido overseeing the establishment of Carthage. Thus, by exalting the Aeneid's author and characters, the Severan dynasty purposefully promoted a Phoenician-Roman connection.\nReign of Elagabalus\nTyre was the capital of Phoenice,  but the Roman emperor Elagabalus (r. 218–222) raised his native Emesa (modern-day Homs) to co-capital, leading to a rivalry between the two cities as the head of the province. However, Elagabalus is recognized for bestowing imperial favor on Berytus, along with other cities in the region, and a coin from Berytus during his reign depicts a grand archway adorned with columns and sculptures.\nPropraetorial Imperial Legates of Phoenicia\n{| class=\"wikitable\"  width=\"45%\"\n|- bgcolor=\"#FFDEAD\"\n! width=\"15%\" | Date\n! width=\"39%\" | Propraetorial Imperial Legates (Governors)\n|-\n|c. 207 || Domitius Leo Procillianus\n|-\n|213 || D. Pius Cassius\n|-\n|Between 268 and 270 || Salvius Theodorus\n|-\n|Between 284 and 305 || L. Artorius Pius Maximus\n|-\n|292 – 293 || Crispinus\n|-\n|}\nMilitary\nSince the time of Septimius Severus, it had been the practice to assign not more than two legions to each frontier province, and, although in some provinces one legion was sometimes deemed sufficient, the upper limit was not exceeded. This policy appears to have been continued during the third century AD, as seen in the case of Aurelian raising the garrisons of Phoenice to the normal strength of two legions. Furthermore, during this century, the Third Legio Gallica was stationed in Tyre or Sidon.\nCoinage\nDuring the reign of the Emperor Philip I the Arab (244-249 CE), bronze coins were struck at Heliopolis in honour of the legions Fifth Macedonia and Eighth Augusta.\nEvents\n210s\n* The Phoenician-born Papinian, a celebrated Roman jurist, magister libellorum, attorney general (advocatus fisci) and, praetorian prefect is murdered in 212 AD.\n, surrounded by Socrates and seven wise men (Baalbeck, 3rd century A.D.)|left]]\n* Septimius Severus' wife Julia Domna and son Caracalla tour in Baalbek,  215 AD.\n* Marcus Julius Gessius Marcianus, native of Arqa and a Roman aristocrat and step-father of Severus Alexander, is murdered in 218 AD.\n220s\n* The Tyrian-born Ulpian, Latin: Gnaeus Domitius Annius Ulpianus; a Roman jurist and one of the great legal authorities, under Severus Alexander, serves as praetorian prefect from 222 AD.\n* Ulpian is murdered in 228.\n230s\n* The Third century Crisis begins with the assassination of the Lebanese-born Roman emperor Severus Alexander, 21/22 March 235 AD.\n* Beirut is mentioned for the first time as a major center for the study of law in writing in the works of Gregory Thaumaturgus, 238/239 AD.\n250s\n* Marinus is metropolitan bishop of Tyre, .\n270s\n* The Palmyrene empire is established in 270 AD with the start of Zenobia's expedition against the Tanukhids in the spring of the same year, leading to the occupation of Roman Phoenice by the Syrian Palmyrenes.\n* Pagan temples are attested in a Greek inscription mentioning the date 272 AD found in the Mar Mama church in Ehden.\n* The Palmyrene empire is reconquered by the Romans, 273 AD.\n* A Roman mint is established in Tripolis, 273/274 AD.\n280s\n, Lebanon.|200x200px|left]]\n* Saint Moura, an Egyptian Saint that is almost exclusively celebrated amongst Maronites, is martyred in 283 AD, Ansena, Egypt.\n* The Third century Crisis ends with the ascension of Diocletian and his implementation of reforms in 284 AD.\n* The Roman mint in Tripolis closes down in 286/287 AD.\n290s\n* Aquilina, a native of Byblos and a Christian child, dies in 293 AD, shortly before the executioner could carry out the decapitation sentenced on her for her religion.\n|300x300px]]\n* Ananias \"of Phoenicia\" the Presbyter, Peter the prison guard, and seven soldiers, get martyred in the form of drowning after lengthy torture for their Christianity, 295 AD, Phoenicia.\n* Gelasinus is martyred in Baalbek, 297 AD.\nEcclesiastical administration\nThe ecclesiastical administration of Pheonice paralleled the political, but with some differences. The bishop of Tyre emerged as the pre-eminent prelate of Phoenice by the mid-3rd century.\nCulture\n|375x375px]]\nIn 238 or 239 AD, Beirut was first mentioned in writing as a major center for the study of law in the panegyric of Gregory Thaumaturgus, the bishop of Neo-Caesarea The 3rd-century emperors Diocletian and Maximian issued constitutions exempting the students of the law school of Beirut from compulsory service in their hometowns.\nPeople\n200s\n, Copenhagen]]\n* Roman Emperor Marcus Aurelius Severus Alexander, known simply as Severus Alexander, is born in 1 October 208, Arqa, in modern-day Lebanon.\n230s\n* Porphyry of Tyre, a Neoplatonic philosopher, is born in Tyre, .\n250s\n* Origen, an early Christian scholar, ascetic and theologian, dies in Tyre,  (aged ).\nSee also\n* Palmyrene empire\n* Canalizations of Zenobia\nReferences\nSources\n* A.R. Birley, Septimius Severus: The African Emperor, Routledge, 2002\n*\n*\n*\n*\n*\n*\n*\n* Yammine, Fr. Youssef, Daleel Ehden, Editor El, 2000.\n*\n*\n* Martindale, J. R.; Jones, A. H. M, The Prosopography of the Later Roman Empire, Vol. I AD 260–395, Cambridge University Press (1971)\n* Linda Jones Hall, Roman Berytus: Beirut in late antiquity (2004)"
    }
  ]
}