{
  "content": [
    {
      "type": "text",
      "text": "# 3rd Ward Brooklyn\n\n)\n| founder          = Jason Goodman & Jeremy Lovitt\n| defunct          =\n| location_city    =\n| location_country =\n| locations        =\n| area_served      =\n| key_people       =\n| products         =\n| production       =\n| services         =\n| revenue          = $3.6 million\n| operating_income =\n| net_income       =\n| aum              =\n| assets           =\n| equity           =\n| owner            =\n| num_employees    =\n| parent           =\n| divisions        =\n| subsid           =\n| homepage         =\n| footnotes        =\n| intl             =\n| bodystyle        =\n}}\n3rd Ward was an art centric business in East Williamsburg, Brooklyn. It was variously described in the media as an artist collective or community, a contemporary art facility, an all-encompassing work studio and art space, a finishing school for the Etsy set, and a creative mainstay. It went out of business October 9, 2013.\nFounding\nIn 2005, Jason Goodman and Jeremy Lovitt conceived of 3rd Ward as a continuation of the facilities and atmosphere they had had as students at the School of the Museum of Fine Arts in Boston. Both were struggling artists who worked construction jobs to pay the bills and found that there was a lack of affordable resources available to artists. The concept was to offer skillshare classes and multidisciplinary facilities, including gallery space, a wood and metal shop, dance studio, digital media lab, photo studio, recording studio, and office space. The business was a means of cost-effectively providing access to the creative community and facilities while allowing members the space needed to do work.\nTo raise rent money for the 30,000 square foot space Goodman and Lovitt threw large Burning Man-style parties. The partners also sold all their marketable possessions—a van, a piano, a table saw—and took as tenants a skateboarding troupe called the Silly Pink Bunnies. 3rd Ward received donations and discounts on equipment and materials from many locations. To build the space, Goodman and Lovitt got most of their supplies from donations, the street, and Build it Green! NYC. The space opened May 1, 2006, at 195 Morgan Avenue in Brooklyn. The founders had no business plan.\nHistory\n2006–2008\nThe original idea to focus on being an artist facility quickly expanded to serving as an educational resource. 3rd Ward offered hundreds of classes including woodworking, graphic design, fashion, and high-end sculpture in chocolate. Events and parties continued to be important to the business. They hosted holiday markets, pig roasts, drink & draws, festivals, literary fairs, and illegal all-night parties. The business also diversified being a coworking space, and serving as a gallery space hosting artists such as Dick Chicken. After the first year it had 200 members and was used by promoter Todd P and high-profile acts such as Japanther and TV on the Radio.\nIn 2007, 3rd Ward partnered with underground party promoter William Etundi Jr. to form Artists Wanted. Artist Wanted focused on staging popular art contests and providing free online portfolios to help artists better market themselves. On the opposite end of the business spectrum, the company forged ties with manufacturers such as Lie-Nielsen Toolworks and Makerbot. Meanwhile, Goodman and Lovitt started GroundedNYC.com as an email subscription service that advertised artist studios for rent. 3rd Ward was able to capitalize on this growing creative community as a means to raise its profile as a hub within a burgeoning art scene by connecting manufacturers, landlords, makers, and buyers to each other. 3rd Ward became a visible example of the DIY movement and the cultural renaissance of Brooklyn. There was a greater emphasis on avoiding the old models of giant parties that brought police attention and focus more on expanding the reach on the business.\n2009–2010\nIn 2009, the partners expanded 3rd Ward to 573 Metropolitan Avenue in Brooklyn as a live-work space for artists, classes, and band practice room. The next year Goodman opened a restaurant in a former empty lot at the intersection of Lorimer Street and Metropolitan Avenue called \"Good.\" It was built inside a 25-foot 1946 Spartan trailer that he found in upstate New York. The restaurant delivered and had a 35-seat outdoor garden. The restaurant closed after 10 months. In the morning of October 15, 2010, the New York City Department of Buildings evicted the fifty tenants in the building, giving them until sundown to leave due to the many safety violations. Some tenants claimed Goodman and Levitt moved out a few weeks before the closure because they had notice and did not share it with the other tenants. Goodman claimed the landlord made an unsolicited offer to buy out their rights due to the recent passage of the loft law and that they had no advance notice of the evictions. It was around this time that Levitt was bought out leaving Goodman as CEO.\n2011–2012\nIn 2011, 3rd Ward expanded its retail offerings. It opened a store called \"Shopbox\" within a shipping container where customers could buy wares by text. Shopbox was essentially a luxury vending machine. It also expanded to Long Island City after being temporarily given space from Rockrose Development Corporation to host pool parties where the pools were made from dumpsters. By the end of 2012, 3rd Ward was generating $3.6 million in revenue. Goodman predicted that by 2018 3rd Ward would be a household name.\n2013\nOthers attempted to follow its model in other locations or focus on different mediums. Former students of 3rd Ward started their own skillshare called \"Brooklyn Brainery\" offering lower priced classes were just one of many new competitors. There were also many new investors by the end of 2012. Joanne Wilson, wife of New York venture capitalist Fred Wilson, invested and became the director of 3rd Ward’s board. Billionaire Tony Hsieh gave several million on the promise it would open a 3rd Ward in Las Vegas. Brooklyn Borough President Marty Markowitz gave Goodman a $1.5 million grant to build a kitchen incubator. Goodman was able to find a partner with Brooklyn Flea founder Jonathan Butler at 1000 Dean Street in Crown Heights for the incubator. The goal was to have the space ready for October 2013. 3rd Ward also opened its second outpost in the South Kensington neighborhood of Philadelphia. Developers had offered to give him a building—and build it out, custom-made, to his specifications—for free in order to entice the expansion. The 27,000-square-foot facility, which featured similar coworking, events, and a diverse curriculum of classes, opened in April 2013.\nBehind the scenes there were major problems with funding so many projects and making payments to investors. As a last ditch effort, the company attempted a fundraising campaign with a goal of raising $1.5 million but was only able to collect $375,000. Due to the campaign's failure none of the money was taken from the investors. With little notice to its members and employees about the financial problems 3rd Ward closed abruptly on October 9, 2013. None of its members received refunds.\nIn the aftermath of the closure there were many reasons given for 3rd Ward's demise. The company was promised funds from Next Street, a Boston- and New York-based merchant bank but Next Street then reconditioned the terms to release far fewer funds and used the funds as leverage to force layoffs and increase fees. Goodman himself stated the company suffered from a lack of short-term liquidity due to rapid expansion with the Philadelphia outpost and the kitchen incubator. Others blame mismanagement by Goodman as the reason leading to the financial difficulties.\nReferences"
    }
  ]
}