{
  "content": [
    {
      "type": "text",
      "text": "# 40th Expeditionary Bomb Squadron\n\n|allegiance=\n|branch=\n|type=\n|role=Heavy Bomber\n|size=\n|command_structure=\n|current_commander=\n|garrison=\n|nickname=Fightin' 40th\n|motto=\n|colors=\n|march=\n|mascot=\n|battles=Western Pacific Theater of Operations\n|notable_commanders=\n|anniversaries=\n|decorations=Distinguished Unit CitationAir Force Outstanding Unit Award\n|battle_honours=\n|identification_symbol=\n|identification_symbol_label=Patch with 40th Bombardment Squadron emblem\n|identification_symbol_2=\n|identification_symbol_2_label=\n}}\nThe 40th Expeditionary Bomb Squadron is a provisional United States Air Force unit. It was assigned to the 40th Air Expeditionary Wing, possibly stationed at Diego Garcia. Its current status is unknown.\nHistory\nB-29 Superfortress operations against Japan\nEstablished as a Boeing B-29 Superfortress heavy bomb group in early 1944; trained under Second Air Force in Nebraska. Initially trained with Boeing B-17 Flying Fortresses until B-29 aircraft were manufactured and assigned to the unit.\nDeployed to Tinian, Mariana Islands in December 1944. Entered combat by flying navigational escort for a major attack force bound for Iwo Jima. The squadron then struck Tokyo and other major Japanese cities and facilities during daylight high-altitude bombing raids, with crippling, non-stop incendiary raids which destroyed lines of communication, supply, and numerous kamikaze bases. On 25 May 1945, the squadron flew a low-altitude night mission through alerted enemy defenses to drop incendiary bombs on Tokyo, for which they received their first Distinguished Unit Citation.\nIn addition to incendiary raids, the 40th also participated in mining operations. By mining harbors in Japan and Korea in July 1945, the squadron contributed to the blockade of the Japanese Empire earning their second Distinguished Unit Citation. The 40th's final World War II mission came on 14 August 1945, with the dropping of 500-pound general-purpose bombs on the Marifu railroad yards at Iwakuni.\nWith the war over, the squadron dropped food and supplies to Allied prisoners of war and took part in show-of-force flights over Japan. Aircraft and were returned to the United States in late 1945; unit remained assigned to Twentieth Air Force primarily as an administrative unit where it was unequipped; finally inactivated in 1948.\nStrategic Air Command\nReactivated in January 1951 due to expansion of the Air Force due to the Cold War. Equipped with Convair B-36 Peacemaker intercontinental strategic bombers. Initially was equipped with B-36Fs. Later Featherweight III B-36Js were added, the squadron operating both types. Carried blue stripe on the tip of the vertical stabilizer; the lip of the jet intakes and the \"nose cone\" of the jet itself along with triangle-R tail code. SAC eliminated tail codes in 1953. In September 1957, the B-36s were replaced with Boeing B-52E Stratofortress aircraft and all squadron markings were eliminated. Continued strategic bombardment training until 1967 when the squadron was inactivated with the closing of Walker Air Force Base.\nReactivated as a provisional B-52H strategic bomb squadron as part of the Global War on Terrorism in 2002. Engaged in combat operations over Iraq and Afghanistan. Suspected to have ended combat operations in 2006; current status is undetermined.\nOperations and decorations\n* Combat Operations: Combat in Western Pacific, 27 Jan-14 Aug 1945.\n* Campaigns: Air Offensive, Japan; Eastern Mandates; Western Pacific.\n* Decorations: Distinguished Unit Citations: Tokyo, Japan, 25 May 1945; Japanese Empire, 9–19 Jul 1945. Air Force Outstanding Unit Award: 1 May 1960 – 31 May 1962.\nLineage\n* Constituted as the 40th Bombardment Squadron, Very Heavy on 28 March 1944\n: Activated on 1 April 1944\n: Inactivated on 18 October 1948\n* Redesignated 40th Bombardment Squadron, Medium on 20 December 1950\n: Activated on 2 January 1951\n: Redesignated 40th Bombardment Squadron, Heavy on 16 June 1952\n: Inactivated on 25 January 1967\n* Redesignated 40th Expeditionary Bomb Squadron and converted to provisional status 31 January 2002\n: Activated unknown (2002?)\nAssignments\n* 6th Bombardment Group, 1 April 1944 – 18 October 1948\n* 6th Bombardment Group, 2 January 1951 (attached to 6th Bombardment Wing)\n* 6th Bombardment Wing (later 6th Strategic Aerospace Wing), 16 June 1952 – 25 January 1967\n* 40th Air Expeditionary Wing, 31 Jan 2002-TBD\nStations\n* Dalhart Army Air Field, Texas, 1 April 1944\n* Grand Island Army Airfield, Nebraska, 26 May – 18 November 1944\n* North Field, Tinian, 28 December 1944\n* Clark Field, Philippines, 13 March 1946\n* Kadena Air Base, Okinawa, 1 June 1947 – 18 October 1948\n* Walker Air Force Base, New Mexico, 2 January 1951 – 25 January 1967\n* Diego Garcia, 31 Jan 2002-unknown\nAircraft\n* Boeing B-17 Flying Fortress, 1944\n* Boeing B-29 Superfortress, 1944–1947; 1951–1952\n* Convair B-36 Peacemaker, 1952–1957\n* Boeing B-52 Stratofortress, 1957–1967; 2002-unknown\nSee also\n* List of B-52 Units of the United States Air Force\n* List of B-29 Superfortress operators\n* B-17 Flying Fortress units of the United States Army Air Forces\nReferences\n; Explanatory notes\n; Citations\nBibliography\n*\n*\n*"
    }
  ]
}