{
  "content": [
    {
      "type": "text",
      "text": "# 410th Expeditionary Operations Group\n\n|allegiance=\n|branch=\n|type= Air Expeditionary\n|role=\n|size=\n|command_structure=\n|current_commander=\n|garrison=\n|ceremonial_chief=\n|colonel_of_the_regiment=\n|nickname=\n|patron=\n|motto=\n|colors=\n|march=\n|mascot=\n|decorations=Distinguished Unit Citation\n|battles=\n|anniversaries=\n}}\nThe 410th Expeditionary Operations Group (410 EOG) is a provisional United States Air Force unit assigned to Air Combat Command. It is the operational flying component of the 410th Air Expeditionary Wing. It may be activated or inactivated at any time.\nThe unit began as the 410th Operations Group in September 1991, when Strategic Air Command implemented the Objective Wing reorganization and assigned Operations Groups to its combat wings.  It was the operational component of the 410th Wing at K. I. Sawyer AFB, Michigan until 1995 when that base closed as a result of the first Base Realignment and Closure (BRAC) reductions in military installations.\nOverview\nThe unit was known to be active in 2003 during Operation Iraqi Freedom, when it was activated by ACC to manage various strike assets of the Air National Guard; the Air Force Reserve; the British Royal Air Force and the Royal Australian Air Force to support a counter-SCUD mission in the western desert of Iraq. Elements of the 410 EOG were assigned to several air bases in Jordan to carry out its mission.\nThe unit has also been known to be active in Afghanistan as part of Operation Enduring Freedom.\nModern era\nThe group was first activated on 1 September 1991 as the 410th Operations Group at K. I. Sawyer AFB when Strategic Air Command implemented the Objective Wing organization, and assumed operational responsibility for a B-52 Stratofortress squadron and assigned KC-135 tankers. Aircraft carried Tail Code \"KI\" after 1992. The group was inactivated 1995 when K. I Sawyer was closed by Base Realignment and Closure (BRAC).\nActivated by Air Combat Command in early 2003 especially for the Scud-hunting mission during Operation Iraqi Freedom and to support other special operations forces tasks in western Iraq. Unit was activated at Muwaffaq Salti Air Base, Jordan (also known as Shahid Muafaq Al-Salti Air Base), dubbed Azraq Air Base by the U.S. military.\nFighting alongside their fully integrated special operations ground task forces, the 410 EOG's pilots, flying F-16C and A-10 aircraft, pursued enemy equipment, personnel, and high-value targets, including regime leadership. In total, the wing flew 9,651 fighter and attack hours in twenty-six days flying counter-tactical ballistic-missile missions and never left the special operations forces in western Iraq without air cover.\nOften flying in extremely hazardous conditions in and around Iraq, the wing's crews generated 2,547 sorties, providing around-the-clock, time-sensitive targeting, interdiction, OCA (offensive counterair), CAS (close air support), ISR (intelligence, surveillance, and reconnaissance), NTISR (Non-Traditional intelligence, surveillance, and reconnaissance), and CSAR (combat search and rescue) missions deep within enemy territory.\nThese missions were flown from bare bases with little supporting infrastructure and necessary logistics. The wing accurately employed more than 600 precision-guided munitions and expended a total of 800,000 pounds of weapons. In addition to eliminating TBM support equipment, the wing is credited with destroying aircraft, armored vehicles, artillery pieces, surface-to-air missile systems, ammunition supply dumps, radars, and enemy troops. The wing is also credited with the destruction of two Baath Party headquarters buildings in western and central Iraq. Although the wing was engaged in more than 200 troops-in-contact scenarios, there were no fratricide events.\nDuring OIF, 410th personnel supplied thirty F-16s, four HH-60s, four HC-130s, eight RAF GR.7 Harriers, and two PR.9 Canberras with 130,000 gallons of fuel per day for twenty-three days.\nLineage\n* Constituted as 410th Operations Group on 29 August 1991\n: Activated on 1 September 1991\n: Inactivated on 30 September 1995\n* Redesignated 410th Expeditionary Operations Group and converted to provisional status, September 2002\nAssignments\n* 410th Wing (later Bomb Wing), 1 September 1991 – 30 September 1995\n* Air Combat Command to activate or inactivate any time after September 2002.\n: Attached to: United States Central Command Air Forces, January – March 2003\nComponents\n* 187th Fighter Squadron (Alabama ANG) OIF\n* 140th Fighter Squadron (Colorado ANG) OIF\n* 113th Wing (District of Columbia ANG) OIF\n* 466th Fighter Squadron USAFR Hill AFB Utah OIF\n* 46th Air Refueling Squadron: 1 September 1991 – 8 October 1993\n* 644th Bombardment Squadron: 1 September 1991 – 21 November 1994\nStations\n* K. I. Sawyer AFB, Michigan, 1 September 1991 – 30 September 1995\n* Southwest Asia, 2003\nAircraft assigned\n* B-52 Stratofortress, 1991–1994\n* KC-135 Stratotanker, 1991–1993\n* T-37 Tweet, 1993–1994\n* F-16C Fighting Falcon, 2003\n* A-10 Warthog, 2003\nReferences\n*\n* Rogers, Brian. United States Air Force Unit Designations Since 1978. Hinkley, UK: Midland Publications, 2005. .\n* [http://warthogdeployments.blogspot.com A-10 Units of Operation Iraqi Freedom – Part II]"
    }
  ]
}