{
  "content": [
    {
      "type": "text",
      "text": "# 41st Brigade (United Kingdom)\n\n|branch= New Army\n|type=Infantry\n|role=\n|size=Brigade\n|command_structure=14th (Light) Division\n|current_commander=\n|garrison=\n|ceremonial_chief=\n|colonel_of_the_regiment=\n|nickname=Greenjacket Brigade\n|patron=\n|motto=\n|colors=\n|identification_symbol=\n|march=\n|mascot=\n|battles=Battle of the SommeBattle of ArrasThird Battle of YpresGerman spring offensiveHundred Days Offensive\n|notable_commanders=\n|anniversaries=\n|decorations=\n|battle_honours=\n}}\n41st Brigade (41st Bde) was an infantry formation of the British Army during World War I. It was formed in August 1914 as part of the New Army, also known as Kitchener's Army, and was assigned to the 14th (Light) Division, serving on the Western Front. It was sometimes known as the 'Greenjacket Brigade' because it was composed of battalions of the King's Royal Rifle Corps and the Rifle Brigade, whose full dress uniforms were Rifle green.\nOrigin\nOn 6 August 1914, less than 48 hours after Britain's declaration of war, Parliament sanctioned an increase of 500,000 men for the Regular British Army. The newly-appointed Secretary of State for War, Earl Kitchener of Khartoum, issued his famous call to arms: 'Your King and Country Need You', urging the first 100,000 volunteers to come forward. Men flooded into the recruiting offices and the 'first hundred thousand' were enlisted within days. Army Order No 324 of 21 August authorised six new infantry divisions to be formed from these recruits, which became known as Kitchener's First New Army, or 'K1'. The senior of these division was to be 8th (Light) Division composed of battalions drawn from light infantry and rifle regiments of the British Army, with three brigades numbered 23rd, 24th and 25th. This formation began assembling at Aldershot. However, it soon emerged that sufficient Regular Army battalions would be brought back from overseas garrisons to form an additional division: this became 8th Division, and the Kitchener division was renumbered on 14 September as the 14th (Light) Division, its brigades becoming 41st, 42nd and 43rd.\nOrder of Battle\nThe brigade was composed as follows:\n* 7th (Service) Battalion, King's Royal Rifle Corps – transferred to 43rd Bde 2 February 1918\n* 8th (Service) Battalion, King's Royal Rifle Corps – left division 16 June 1918\n* 7th (Service) Battalion, Rifle Brigade – absorbed by 33rd Bn London Regiment 19 June 1918\n* 8th (Service) Battalion, Rifle Brigade – left division 16 June 1918\n* 41st Company, Machine Gun Corps – formed at Winnezeele 15 February 1916; transferred to 14th Divisional MG Battalion March 1918\n* 41st Trench Mortar Battery – formed at Arras by 2 May 1916; broken up as infantry reinforcements by 14 April 1918\nFollowing massive casualties during the German spring offensive all infantry battalions of 14th (L) Division were reduced to training cadres (TCs) in April. Various other units were attached to the division during May to work on the Lillers–Steenbecque–Morbecque defence line. The division then proceeded to Brookwood in England on 17 June to be reconstituted at Pirbright Camp with troops of medical category B. 41st Brigade was then composed as follows:\n* 18th (Service) Battalion, York & Lancaster Regiment – formed at Margate 11 June 1918, joined 18 June, absorbed TC of 2/7th West Yorkshire Regiment (formerly 62nd (2nd West Riding) Division) 19 June\n* 29th (Service) Battalion, Durham Light Infantry – ''formed at Brookwood 19 June 1918, absorbed TC of  2/7th Duke of Wellington's Regiment (formerly 62nd (2nd WR) Division)\n* 33rd (City of London) Battalion, London Regiment (Rifle Brigade) – formed at Clacton-on-Sea 7 June 1918, absorbed TC of  7th Rifle Brigade, joined 19 June\n* 41st Trench Mortar Battery – reformed in England June 1918\nService\n14th (Light) Division crossed to France in May 1915 and completed its concentration around Watten, north-west of Saint-Omer, by 25 May. Thereafter it served on the Western Front in the following operations:\n1915\n* Hooge (German liquid fire attack) 30–31 July\n* Second Attack on Bellewaarde 25 September\n1916\n* Battle of the Somme:\n** Battle of Delville Wood 13–30 August\n** Battle of Flers–Courcelette 15–16 September\n1917\n* German Retreat to the Hindenburg Line 15 March–5 April\n* Battle of Arras:\n** First Battle of the Scarpe 9–12 April\n** Third Battle of the Scarpe 3–4 May\n* Third Battle of Ypres:\n** Battle of Langemarck 18 August\n** Fighting on the Menin Road 22–28 August\n** First Battle of Passchendaele 12 October\n1918\n* German spring offensive:\n** Battle of St Quentin 21–23 March\n** Battle of the Avre 4 April\nFollowing casualties in the German spring offensive, 14th (L) Division was withdrawn to England to be reconstituted (see above). It returned to the Western Front in July and participated in the following actions:\n* Hundred Days Offensive:\n** Fifth Battle of Ypres 28 September–2 October\n** Battle of Courtrai 14–19 October\nFollowing the Armistice with Germany demobilisation of 14th (L) Division began in December 1918 and the division and its formations ceased to exist on 24 March 1919.\n41st Brigade was not reactivated in World War II.\nCommanders\nThe following officers commanded the brigade:\n* Brigadier-General F.A. Fortescue from 23 August 1914\n* Brig-Gen O.S.W. Nugent from 6 May 1915\n* Lieutenant-Colonel J.D.H. Maitland acting from 12 September 1915\n* Brig-Gen H.S. Jeudwine from 28 September 1915\n* Brig-Gen George Baillie-Hamilton, Lord Binning from 20 December 1915\n* Brig-Gen P.C.B. Skinner from 23 April 1916\n* Lt-Col B.J. Curling acting from 31 March 1918\n* Brig-Gen C.R.P. Winser from 3 April 1918\n* Brig-Gen W.F. Sweny from 3 September 1918\nInsignia\nThe formation sign of 14th (L) Division was a light infantry green rectangle crossed by two white lines, one horizontal the other diagonal. Within the division the units wore a variety of identifying signs; for 41st Bde these were:\n* 7th KRRC: a red square\n* 8th KRRC: a red triangle\n* 7th Rifle Brigade: a black square above a bar of company colour\n* 8th Rifle Brigade: a black inverted triangle above a red (or black) bar, worn on the back of the jacket; an inverted triangle of company colour was worn on the right sleeve\nFootnote\nNotes\nReferences\n* Maj A.F. Becke,History of the Great War: Order of Battle of Divisions, Part 3a: New Army Divisions (9–26), London: HM Stationery Office, 1938/Uckfield: Naval & Military Press, 2007, ISBN 1-847347-41-X.\n* Capt Reginald Berkeley, The History of the Rifle Brigade in the War of 1914–1918, Vol I, August 1914–December 1916, London: The Rifle Brigade Club, 1927/Uckfield: Naval & Military Press, 2003, ISBN 978-1-847346-98-8.\n* Clive Elderton & Gary Gibbs, World War One British Army Corps and Divisional Signs, Wokingham: Military History Society, 2018.\n* Mike Hibberd, Infantry Divisions, Identification Schemes 1917, Wokingham: Military History Society, 2016.\n* Lt-Col H.F. Joslen, Orders of Battle, United Kingdom and Colonial Formations and Units in the Second World War, 1939–1945, London: HM Stationery Office, 1960/London: London Stamp Exchange, 1990, ISBN 0-948130-03-2/Uckfield: Naval & Military Press, 2003, ISBN 1-843424-74-6.\n* Instructions Issued by The War Office During August, 1914, London: HM Stationery Office, 1916.\nExternal sources\n* [http://www.longlongtrail.co.uk Chris Baker, The Long, Long Trail'']"
    }
  ]
}