{
  "content": [
    {
      "type": "text",
      "text": "# 42nd Robert Awards\n\n| site                 =\n| host                 = Nicolai Jørgensen\n| producer             =\n| director             =\n| organizer            = Danish Film Academy\n| best_film            =\n| best_direction       =\n| best_direction_film  =\n| best_actor           =\n| best_actor_film      =\n| best_actress         =\n| best_actress_film    =\n| gold_award           =\n| hall_of_fame         =\n| most_wins            = FilmMatters of the Heart (7)TelevisionBullshit (4)\n| most_nominations     = FilmMatters of the Heart (13)TelevisionThe Orchestra (6)\n| channel              =\n| network              =\n| duration             =\n| ratings              =\n| last                 = 41st\n| next                 =\n}}\nThe 42nd Robert Awards ceremony, was presented by Danish Film Academy on 1 February 2025, to honour the best in Danish film and television of 2024. It took place at the Tivoli Hotel & Congress Centre in Copenhagen, Denmark and hosted by actor Nicolai Jørgensen.\nNominees\nThe nominations were announced on 8 January 2025. Drama film Matters of the Heart led the nominations with thirteen, followed by thriller drama Way Home with eleven and psychological thriller Sons with ten.\nWinners are listed first, highlighted in boldface, and indicated with a double dagger (‡).\nFilm\n{| class=wikitable style=\"width=\"100%\"\n|-\n| valign=\"top\" width=\"50%\"|\n*'Matters of the Heart – Producer: Jonas Frederiksen; Director and Screenwriter: Christina Rosendahl'\n**Birthday Girl – Producers: Matilda Appelin and René Ezra; Director: Michael Noer; Screenwriters: Michael Noer and Jesper Fink\n**Kalak – Producer: Maria Møller Kjeldgaard; Director: Isabella Eklöf; Screenwriters: Isabella Eklöf, Kim Leine, and Sissel Dalsgaard Thomsen\n**Sons – Producer: Lina Flint; Director: Gustav Möller; Screenwriters: Gustav Möller and Emil Nygaard Albertsen\n**Way Home – Producers: Morten Kaufmann and Signe Leick Jensen; Director: Charlotte Sieling; Screenwriters: Charlotte Sieling, Jesper Fink, and Nagieb Khaja\n| valign=\"top\" width=\"50%\"|\n*'Christina Rosendahl – Matters of the Heart'\n**Isabella Eklöf – Kalak\n**Frederik Louis Hviid – The Quiet Ones\n**Gustav Möller – Sons\n**Roja Pakari – The Son and the Moon\n**Charlotte Sieling – Way Home\n|-\n| valign=\"top\" width=\"50%\" colspan=\"2\"|\n*'The Children of Silver Street – Producer: Stephanie Wiese; Director: Mehdi Avaz; Screenwriter: Renée Toft Simonsen'\n**Kontra – Producer: Jasmine Hermann Naghizadeh; Director and Screenwriter: Jonas Risvig\n**Mr. Freeman – Producer: Jonas Bagger; Director and Screenwriter: Mads Matthiesen\n|-\n| valign=\"top\" width=\"50%\"|\n*'Matters of the Heart – Christina Rosendahl'\n**Birthday Girl – Jesper Fink and Michael Noer\n**The Quiet Ones – Anders August\n**Sons – Emil Nygaard Albertsen and Gustav Möller\n**Way Home – Charlotte Sieling, Jesper Fink, and Nagieb Khaja\n| valign=\"top\" width=\"50%\"|\n*'Kalak – Isabella Eklöf, Kim Leine, and Sissel Dalsgaard Thomsen'\n**Børnene fra Sølvgade – Renée Toft Simonsen\n**Boundless – Jakob Weis\n**Kingmaker – Marie Østerbye\n**Paranoia – Birgitte Lorentzen and Henrik Kristensen\n|-\n| valign=\"top\" width=\"50%\"|\n*'Lars Ranthe – Matters of the Heart as Peter'\n**Sebastian Bull – Sons as Mikkel\n**Gustav Giese – The Quiet Ones as Kasper\n**Kristian Halken – When in Rome as Kristoffer\n**Nikolaj Lie Kaas – Way Home as Christian\n| valign=\"top\" width=\"50%\"|\n*'Viilbjørk Malling Agger – Matters of the Heart as Sofia'\n**Trine Dyrholm – Birthday Girl as Nanna\n**Bodil Jørgensen – When in Rome as Gerda\n**Sidse Babett Knudsen – Sons as Eva Hansen\n**Flora Ofelia Hofmann Lindahl – Madame Ida as Cecilia\n|-\n| valign=\"top\" width=\"50%\"|\n*'Nicolas Bro – Mr. Freeman as Father'\n**Afshin Firouzi – Boundless as Assad\n**Joachim Fjelstrup – Boundless as Atu\n**Arian Kashef – Way Home as Abu Hassan\n**Albert Rudbeck Lindhardt – Way Home as Adam\n| valign=\"top\" width=\"50%\"|\n*'Stine Stengade – Matters of the Heart as Helen'\n**Asta Kamma August – Kalak as Lærke\n**Christine Albeck Børge – Madame Ida as Ida\n**Flora Ofelia Hofmann Lindahl – Birthday Girl as Cille\n**Karen-Lise Mynster – Madame Ida as Alma\n|-\n| valign=\"top\" width=\"50%\"|\n*'Madame Ida – Amalie Skovhus Petersen'\n**Eternal – Gustav Pontoppidan\n**Kalak – Josephine Farsø\n**Kingmaker – Thomas Greve\n**Matters of the Heart – Rie Lykke\n| valign=\"top\" width=\"50%\"|\n*'Matters of the Heart – Louise McLaughlin'\n**Eternal – Jacob Møller\n**Kalak – Nadim Carlsen\n**Kingmaker – Sine Vadstrup Brooker\n**Madame Ida – Stroud Rohde Pearce\n**Sons – Jasper J. Spanning\n|-\n| valign=\"top\" width=\"50%\"|\n*'Madame Ida – Nina Grønlund'\n**Kalak – Sascha Valbjørn\n**Matters of the Heart – Juan Bastias\n**The Promise – Stine Gudmundsen-Holmgreen\n**The Quiet Ones – Emilie Bøge Dresler\n| valign=\"top\" width=\"50%\"|\n*'Madame Ida – Louise Weiland'\n**Hunting Season 2 – Tina Helmark\n**Kalak – Eija Hakkarainen and Saara Räisänen\n**The Quiet Ones – Maria Engberg Refsgaard\n**Sons – Kamilla Bjerglind\n|-\n| valign=\"top\" width=\"50%\"|\n*'The Quiet Ones – Anders Albjerg Kristiansen'\n**Kingmaker – Martin Schade\n**Matters of the Heart – Mark Bukdahl and Olivier Bugge Coutté\n**The Son and the Moon – Denniz Göl Bertelsen\n**Sons – Rasmus Stensgaard Madsen\n**Way Home – Sverrir Kristjánsson\n| valign=\"top\" width=\"50%\"|\n*'Way Home – Rune Palving'\n**Boundless – Bo Asdal Andersen and Oskar Skriver\n**Kingmaker – Claus Lynge and Hans Christian Kock\n**Matters of the Heart – Peter Albrechtsen\n**The Quiet Ones – Morten Green\n**Sons – Hans Christian Arnt Torp and Oskar Skriver\n|-\n| valign=\"top\" width=\"50%\"|\n*'Mulm – Josefine Skov'\n**Kingmaker – Alexander Westlund, Aramis Silvereke, and Elvin Matz\n**Matters of the Heart – Jonas Struck\n**The Quiet Ones – Martin Dirkov\n**Sons – Jon Ekstrand\n**Way Home – Alex Vargas and Goran Obad\n| valign=\"top\" width=\"50%\"|\n*'\"Børnene fra Sølvgade\" from The Children of Silver Street – Writer: Thomas Helmig; Performers: Vesterbro Ungdomsgård and Karui featuring Thomas Helmig'\n**\"Deep Sleep\" from Eternal – Writers: Adi Zukanović and Nanna Øland Fabricius; Performer: Oh Land\n**\"Matters of the Heart\" from Matters of the Heart – Writers: Emil Jørgensen, Jonas Struck, Pernille Rosendahl, and Teitur Lassen; Performer: Swan Lee\n**\"Snowdrop\" from Boundless – Writers: Emma Grankvist and Lasse Ziegler; Performer: Eee Gee\n**\"Too Strange for the Air\" from Way Home – Writer and Performer: Alex Vargas\n|-\n| valign=\"top\" width=\"50%\"|\n*'Wild Child – Producer: Christian Lønhart; Director: Sif Lina Lambæk; Screenwriters: Kristine Plechinger Tüchsen & Sif Lina Lambæk'\n**Companion – Producer: Maja Bolette Klit; Director and Screenwriter: Nivetha Balasubramaniam\n**En anden uden mig – Producers: Valdemar Guldbrandsen and Signe Borrevang; Director and Screenwriter: Emilie Fabricius Hacke\n**Seeking Hwa Sun – Producer: Line Aas Sørensen; Director and Screenwriter: Sandra Yi Sencindiver\n**A Study of Empathy – Producer: Asbjørn H. Kelstrup; Director and Screenwriter: Hilke Rönnfeldt\n| valign=\"top\" width=\"50%\"|\n*'Eternal – Alexander Schepelern, Christian Sjöstedt, and Lea Benjovitz'\n**Boundless – Simon Sandin\n**Kalak – Peter Hjorth\n**The Quiet Ones – Hummer Højmark, Katja Glæsner, and Jacob Thorndahl\n**Way Home – Peter Hjorth\n|-\n| valign=\"top\" width=\"50%\"|\n*'The Son and the Moon – Producer: Sara Stockmann; Director: Roja Pakari'\n**Afterwar – Producer: Lise Lense-Møller; Director: Birgitte Stærmose\n**Balomania – Producers: Jesper Jack and Marie Schmidt Olesen; Director: Sissel Dargis Morell\n**Echo of You – Producer: Maria Møller Kjeldgaard; Director: Zara Zerny\n**Før stormen – Producers: Andreas Dalsgaard and Kasper Lykke Schultz; Directors: Juan Palacios and Sofie Husum Johannesen\n| valign=\"top\" width=\"50%\"|\n*'Our Father Wears a Sun – Producers and Directors: Jasper J. Spanning and Rosalinde Mynster'\n**Growing Pains – Producer: Sofie Bergstein; Director: Mikkel Kruse\n**Om sorg – Producer: Signe Leick Jensen; Director: Sami Saif\n**Trans Hero – Producer: Ane Vennize Andersen; Directors: Evo Smilla S. Sidney and Sol Amanda Wendel\n**Tør du drømme om døden? – Producers: Anna Trosko and Smilla Dreinø Khonsari; Director: Smilla Dreinø Khonsari\n|-\n| valign=\"top\" width=\"50%\"|\n*'The Zone of Interest in German – Director: Jonathan Glazer; Distributor: SF Studios'\n**Anatomy of a Fall in French – Director: Justine Triet; Distributor: Filmbazar\n**The Boy and the Heron in Japanese – Director: Hayao Miyazaki; Distributor: Camera Film\n**La chimera in Italian – Director: Alice Rohrwacher; Distributor: Filmbazar\n**No Other Land in Arabic and Hebrew – Directors: Basel Adra, Hamdan Ballal, Yuval Abraham, and Rachel Szor; Distributor: CPH:DOX\n**Perfect Days in Japanese – Director: Wim Wenders; Distributor: Camera Film\n| valign=\"top\" width=\"50%\"|\n*'The Apprentice – Director: Ali Abbasi; Distributor: Nordisk Film Distribution'\n**All of Us Strangers – Director: Andrew Haigh; Distributor: The Walt Disney Company\n**Anora – Director: Sean Baker; Distributor: United International Pictures\n**Past Lives – Director: Celine Song; Distributor: Scanbox Entertainment\n**Poor Things – Director: Yorgos Lanthimos; Distributor: The Walt Disney Company\n|}\nFilms with multiple nominations\n{| class=\"wikitable plainrowheaders\" rowspan=2 style=\"text-align: center;\" border=\"2\" background: #f6e39c;\n|+ Films that received multiple nominations\n|-\n! scope=\"col\" style=\"width:55px;\"| Nominations\n! scope=\"col\" style=\"text-align:center;\"| Film\n|-\n| 13\n| Matters of the Heart\n|-\n| 11\n| Way Home\n|-\n| 10\n| Sons\n|-\n| 9\n| Kalak\n|-\n| 8\n| The Quiet Ones\n|-\n| 7\n| Madame Ida\n|-\n| rowspan=\"2\"|6\n| Boundless\n|-\n| Kingmaker\n|-\n| rowspan=\"2\"|4\n| Birthday Girl\n|-\n| Eternal\n|-\n|rowspan=\"2\"| 3\n| Børnene fra Sølvgade\n|-\n| The Son and the Moon\n|-\n| rowspan=\"2\"|2\n| Mr. Freeman\n|-\n| When in Rome\n|}\n{| class=\"wikitable plainrowheaders\" rowspan=2 style=\"text-align: center;\" border=\"2\" background: #f6e39c;\n|+ Films that received multiple awards\n|-\n! scope=\"col\" style=\"width:55px;\"| Awards\n! scope=\"col\" style=\"text-align:center;\"| Film\n|-\n| 7\n| Matters of the Heart\n|-\n| 3\n| Madame Ida\n|}\nTelevision\n{| class=wikitable style=\"width=\"100%\"\n|-\n| valign=\"top\" width=\"50%\"|\n*'The Black Swan (TV 2)'\n**Bullshit (Prime Video)\n**Dark Horse (TV 2)\n**Families like Ours (TV 2)\n**Velkommen til frontlinjen (DR)\n| valign=\"top\" width=\"50%\"|\n*'The Orchestra (season 2) (DR)'\n**Baby Fever (season 2) (Netflix)\n**The Best Years (TV 2)\n**Prinsesser fra blokken - otte år sener (DR)\n**Ungeren (DR)\n|-\n| valign=\"top\" width=\"50%\"|\n*'Marco Ilsø – Bullshit as Henning (Prime Video)'\n**Rasmus Bruun – The Orchestra as Jeppe Nygren (DR)\n**Elias Budde Christensen – Ungeren as Alex (DR)\n**Nikolaj Lie Kaas – Families like Ours as Jacob (TV 2)\n**Magnus Millang – The Best Years as Mathias (TV 2)\n| valign=\"top\" width=\"50%\"|\n*'Alba August – Bullshit as Pia (Prime Video)'\n**Thit Aaberg – Ungeren as Iben (DR)\n**Frederikke Dahl Hansen – En af os ryster as Silvia (DR)\n**Josephine Park – Baby Fever as Nana (Netflix)\n**Stephania Potalivo – The Best Years as Louise (TV 2)\n|-\n| valign=\"top\" width=\"50%\"|\n*'Clint Ruben – Bullshit as (Prime Video)'\n**Frederik Cilius – The Orchestra as Bo (DR)\n**Albert Rudbeck Lindhardt – Families like Ours as Elías (TV 2)\n**Caspar Phillipson – The Orchestra as Simon (DR)\n**Besir Zeciri – Justice: Those Who Kill as Kim Jensen (Prime Video / Viaplay)\n| valign=\"top\" width=\"50%\"|\n*'Vic Carmen Sonne – Bullshit as Bettina (Prime Video)'\n**Ditte Hansen – The Best Years as Sanne (TV 2)\n**Neel Rønholt – The Orchestra as Regitze (TV 2)\n**Ina-Miriam Rosenbaum – The Orchestra as Vibeke (TV 2)\n**Paprika Steen – Families like Ours as Fanny (TV 2)\n|}\nShows with multiple nominations\n{| class=\"wikitable plainrowheaders\" rowspan=2 style=\"text-align: center;\" border=\"2\" background: #f6e39c;\n|+ Shows that received multiple nominations\n|-\n! scope=\"col\" style=\"width:55px;\"| Nominations\n! scope=\"col\" style=\"text-align:center;\"| Film\n|-\n| 6\n| The Orchestra\n|-\n| 5\n| Bullshit\n|-\n| rowspan=\"2\"|4\n| The Best Years\n|-\n| Families like Ours\n|-\n| 3\n| Ungeren\n|-\n| 2\n| Baby Fever\n|}\n{| class=\"wikitable plainrowheaders\" rowspan=2 style=\"text-align: center;\" border=\"2\" background: #f6e39c;\n|+ Shows that received multiple awards\n|-\n! scope=\"col\" style=\"width:55px;\"| Awards\n! scope=\"col\" style=\"text-align:center;\"| Film\n|-\n| 4\n| Bullshit\n|}\nSpecial awards\n{| class=wikitable style=\"width=\"100%\"\n|-\n| valign=\"top\"|\n*Way Home\n**Børnene fra Sølvgade\n**Boundless\n**Hunting Season 2\n**Kingmaker\n**Kontra\n**Matters of the Heart\n**The Quiet Ones\n**Sons\n**When in Rome\n|-\n| valign=\"top\"|\n*'Louis Emil Ramm Seeberg (Editor) – Englemord and Madame Ida'\n**Patrick A. Hansen (Actor) – Kingmaker\n**Roja Pakari (Director) – The Son and the Moon\n**Pernille Tornøe and Victor Cunha (Producers) – Englemord and Dark Horse\n**Zara Zerny (Director) – Echo of You\n|}\nReferences\nExternal links\n*"
    }
  ]
}