{
  "content": [
    {
      "type": "text",
      "text": "# 43rd Anti-Aircraft Brigade (United Kingdom)\n\n|allegiance=\n|branch= Territorial Army\n|type=Anti-Aircraft BrigadeAGRA\n|role=Air Defence\n|size=\n|command_structure= 3rd AA Division7th AA Division6 AA Group5 AA Group2 AA Group\n|current_commander=\n|garrison= West HartlepoolLeedsYork\n|ceremonial_chief=\n|colonel_of_the_regiment=\n|nickname=\n|patron=\n|motto=\n|colors=\n|march=\n|mascot=\n|battles=Battle of BritainThe BlitzOperation Diver\n|notable_commanders=\n|anniversaries=\n}}\n43rd Anti-Aircraft Brigade was an air defence formation of Britain's Territorial Army (TA). Formed in 1938, it was responsible for protecting Teesside in North East England during the early part of the Second World War, and later defended South East England from V-1 flying bombs. It was reformed postwar and survived under different titles until 1961.\nMobilisation\nWith the expansion of Britain's Anti-Aircraft (AA) defences in the late 1930s, new formations were created to command the growing number of Royal Artillery (RA) and Royal Engineers (RE) AA gun and searchlight units 43rd AA Brigade was raised on 1 October 1938 at West Hartlepool and comprised part-time TA units from Teesside and County Durham. Initially, it formed part of 3rd AA Division, which had responsibility for defending Scotland, Northern Ireland and North East England. The first brigade commander was Brigadier K.D. Yearsley, MC.\nAt the time the brigade was formed, the TA's AA units were in a state of mobilisation because of the Munich crisis, although they were soon stood down. In February 1939 the TA's AA defences came under the control of a new Anti-Aircraft Command. In June a partial mobilisation of AA Command was begun in a process known as 'couverture', whereby each unit did a month's tour of duty in rotation to man selected AA gun and searchlight positions. That summer, 43rd AA Bde came under the command of the newly formed 7th AA Division, which was created to cover North East England, Yorkshire and Humberside. Its exact responsibilities were still being worked out when war broke out. AA Command mobilised fully on 24 August, ahead of the official declaration of war on 3 September.\nOrder of Battle 1939\nThe composition of the brigade upon mobilisation in August 1939 was as follows:\n* 85th (Tees) AA Regiment, RA – new Heavy AA unit formed in 1938\n** HQ at Middlesbrough\n** 174th (1st North Riding) AA Battery – transferred from 62nd (Northumbrian) AA Regiment at Middlesbrough\n** 175th (2nd North Riding) AA Battery – transferred from 62nd AA Regiment at Middlesbrough\n** 220th (County Durham) AA Battery – transferred from 63rd (Northumbrian) AA Regiment at West Hartlepool\n* 47th (The Durham Light Infantry) AA Battalion, RE – Searchlight unit converted from 7th Battalion, Durham Light Infantry\n** HQ, 386th–388th AA Companies at Sunderland\n** 389th AA Company at South Shields\n* 1/5th Battalion, Durham Light Infantry (54th Searchlight Regiment) – Searchlight unit converted from 5th Battalion, Durham Light Infantry\n** HQ, 411th–413th Searchlight Batteries at Stockton-on-Tees\n* 2/5th Battalion, Durham Light Infantry (55th Searchlight Regiment) – duplicate unit formed in April 1939\n** HQ, 414th–416th Searchlight Batteries  at West Hartlepool\n* 43rd Anti-Aircraft Brigade Company, Royal Army Service Corps\nPhoney War\nEquipment was critically short at the outbreak of war. In August 1939, 7 AA Division only had 14 3-inch or 3.7-inch Heavy AA guns deployed on Teesside. Luckily, the months of the Phoney War that followed mobilisation allowed AA Command to address its equipment shortages and a Gun Defence Area (GDA) was established around Teesside including Middlesbrough and Billingham. Vital Points (VPs) such as RAF Fighter Command airfields and factories began to receive a few Bofors LAA guns.\n85th AA Regiment left the brigade in November 1939 to mobilise for overseas service; in April 1940 it joined the British Expeditionary Force in France. Later, 54th S/L Regiment transferred to 31st (North Midland) Anti-Aircraft Brigade covering West Yorkshire.\nBattle of Britain\nAfter the Fall of France and the BEF's evacuation from Dunkirk, returning AA units were re-equipped and re-integrated into AA Command as quickly as possible. By the summer of 1940, all TA searchlight regiments had been transferred to the Royal Artillery (RA), and AA regiments had been redesignated Heavy Anti-Aircraft (HAA) to distinguish them from the new Light Anti-Aircraft (LAA) regiments being formed.\nTeesside and Wearside were important strategic targets because of their concentrations of heavy industry and ports. During the early part of the Battle of Britain, German day and night air raids and mine laying began along the East Coast of England, intensifying through June 1940. Thereafter the Luftwaffe concentrated on Royal Air Force sites in the South of England, with occasional raids on the North East, such as the period 12–15 August.\nOn 15 August, in the belief that the defences of NE England had been denuded, Luftflotte 5 attacked across the North Sea from Norway. Some 65 Heinkel He 111 bombers of Kampfgeschwader 26 escorted by 35 Messerschmitt Bf 110 Zerstörer fighters of Zerstörergeschwader 76 were picked up on radar and ambushed by fighters of No. 13 Group RAF before they reached the coast. Those bombers that succeeded in breaking through then split into two groups, one being engaged by the guns of the Tyne GDA the other by the Tees GDA. Bombs were widely scattered and only at Sunderland was any major damage inflicted. KG 26 lost 8 bombers and 7 fighters for no loss to the RAF, in 'one of the most successful air actions of the war'.\nThe Blitz\nAfter the defeat of the Battle of Britain, the Luftwaffe switched to night raids over Britain's cities (The Blitz) during the winter of 1940–41. By 21 August, the Teesside GDA contained 30 HAA guns, and as more LAA units became available they were distributed to defend VPs. AA 'Z' Regiments were also formed, equipped with Z Battery rocket projectiles.\nThe S/L layouts had been based on a spacing of , but due to equipment shortages this had been extended to . The S/L layout was changed in November to clusters of three lights to improve illumination, but this meant that the clusters had to be spaced  apart. The cluster system was an attempt to improve the chances of picking up enemy bombers and keeping them illuminated for engagement by AA guns or RAF Night fighters. Eventually, one light in each cluster was to be equipped with searchlight control (SLC or 'Elsie') radar and act as 'master light', but the radar equipment was still in short supply. The number of raiders shot down steadily increased until mid-May 1941, when the Luftwaffe scaled down its attacks.\nOrder of Battle 1940–41\nBy now AA Command had been greatly expanded and reorganised. The order of battle of 43 AA Bde was now as follows (temporary attachments omitted):\npreserved at Imperial War Museum Duxford.]]\n* 8th (Belfast) HAA Rgt – returned from Dunkirk and re-equipped\n** 21, 22, 23, 414 HAA Btys\n* 59th (Essex Regiment) HAA Rgt – from 6 AA Division Summer 1941\n** 164, 167, 265, 429 HAA Btys\n* 73rd HAA Rgt – returned from Dunkirk and re-equipped; to 12 AA Division May 1941\n** 209, 210, 311 HAA Btys\n* 126th HAA Rgt – new regiment formed July 1941\n** 423, 425, 426 HAA Btys\n* 50th LAA Rgt – new unit raised in July 1940 from a battery of 14th (West Lothian, Royal Scots) LAA Rgt plus recruits\n** 58, 93 LAA Btys\n** 178 LAA Bty – left July 1941\n* 72nd LAA Rgt – new LAA unit raised in January 1941; to 3 AA Division Summer 1941\n** 212, 213, 217 LAA Btys\n* 47th (Durham Light Infantry) S/L Rgt\n** 386, 387, 388, 389 S/L Btys\n* 55th (Durham Light Infantry) S/L Rgt\n** 414, 415, 416, 530 S/L Btys\n* 3 AA 'Z' Rgt – from 3 AA Division Summer 1941\n** 103, 107, 115, 118 Z Btys\n* 11 AA 'Z' Rgt – from 12 AA Division Summer 1941\n** 134, 147, 148 Z Btys\nMid-war\nDuring 1942 the Luftwaffe switched to 'hit and run' attacks against coastal targets. One notable example was the bombing of Middlesbrough railway station by a lone Dornier bomber on August Bank Holiday (3 August).\nAs the war progressed, AA units began to be sent to overseas theatres. 8th (Belfast) HAA Rgt was posted to GHQ Reserve in November 1941 preparatory to embarking for India. In January 1942, 47th and 55th (DLI) S/L Rgts were converted to the LAA role and became 112th and 113th (DLI) LAA Rgts respectively. Both regiments later served under 21st Army Group in North West Europe. 73rd HAA Rgt was sent to Middle East Forces (MEF) by April 1942.  and 72nd LAA Rgt was in Tunisia by July 1943.\nThis continual turnover of units accelerated with the need to transfer LAA units to counter the hit-and-run attacks and preparations for the invasion of North Africa (Operation Torch) in late 1942. However, newly formed units continued to join AA Command, the HAA and support units increasingly becoming 'Mixed' units, indicating that women of the Auxiliary Territorial Service (ATS) were fully integrated into them.\nAt the end of 1941 this turnover meant that 43 AA Bde consisted only of one new HAA regiment (123rd), one new LAA regiment (41st), and one S/L regiment (53rd (Royal Northumberland Fusiliers)).\nOrder of Battle 1941–42\nDuring this period the brigade had the following composition (temporary attachments omitted):\n* 123rd HAA Rgt\n** 402, 404, 414, 417 HAA Btys\n* 126th HAA Rgt – returned August 1942\n** 423, 425, 426, 431 HAA Btys\n* 145th (Mixed) HAA Rgt – new unit raised in January, joined April 1942\n** 500, 501, 502 (M) HAA Btys\n** 572 (M) HAA Bty – joined June 1942; to 158th (Mixed) HAA Rgt summer 1942\n* 31st LAA Rgt – from Orkney and Shetland Defences (OSDEF) June 1942; left for 6th AA Division June 1942\n** 61, 101, 224, 447 LAA Btys\n* 41st LAA Rgt – to War Office Control April 1942 preparatory to embarking for MEF\n** 133, 134, 143 LAA Btys\n* 68th LAA Rgt – from 30 AA Bde by May 1942; unbrigaded from June 1942; later joined 59th (Staffordshire) Infantry Division\n** 203, 204, 278, 461 LAA Btys\n* 136th LAA Rgt – new unit raised in February 1942; joined June 1942\n** 386, 453, 474, 482 LAA Btys\n* 53rd (RNF) S/L Rgt – to 30 AA Bde August 1942\n** 408, 409, 410, 565 S/L Btys\n* 7 AA 'Z' Rgt – from 30 AA Bde by May 1942\n** 106, 109, 110, 117 Z Btys\n* 43 AA Brigade Signal Office Mixed Subsection – part of 2 Company, 7 AA Division Mixed Signal Unit, Royal Corps of Signals (RCS)\nLater war\nIn October 1942 AA Command reorganised its structure, replacing the AA Divisions with AA Groups coinciding with RAF Fighter Command's Groups. 43 AA Bde came under 6 AA Group, covering Scotland and North-East England.\nBy late 1943 AA Command was being forced to make manpower cuts, releasing men to 21st Army Group for Operation Overlord, the planned Allied invasion of Normandy, and a number of batteries were disbanded.\nOrder of Battle 1942–44\nDuring this period the composition of the brigade was as follows:\n* 123rd HAA Rgt – to East Africa Command November 1942\n** 402, 402, 404, 417 HAA Btys\n* 126th HAA Rgt – to 7 AA Group November 1942\n** 423, 425, 426, 431 HAA Btys\n* 129th (M) HAA Rgt – from 36 (Scottish) AA Bde April 1943\n** 444, 445, 454, 455 (M) HAA Btys\n* 145th (M) HAA Rgt – to 36 AA Bde April 1943\n** 500, 501, 502, 531 (M) HAA Btys\n* 136th LAA Rgt\n** 386, 453, 474 LAA Btys\n** 482 LAA Bty – left November 1943\n* 7 AA 'Z' Rgt – became Mixed February 1943; redesignated 7 AA Area Mixed Rgt April 1944\n** 106, 117 Z Btys\n** 109, 110 Z Btys – left by March 1944\n** 226, 229 Z Btys – joined February 1943\n* 43 AA Brigade Mixed Signal Office Section – part of 2 Company, 6 AA Group Mixed Signal Unit, RCS\nOperation Diver\nIn March 1944, 6 AA Group HQ was transferred to Southern England to assist 2 AA Group by taking over some of the responsibility for defending the assembly camps, depots and embarkation ports for Operation Overlord, and planning for the expected onslaught of V-1 flying bombs (codenamed 'Divers'). 5 AA Group assumed responsibility for NE England, including 43 AA Bde.\nThe first V-1 missiles were fired against London in June, a week after D-Day, and Operation Diver was activated. 2 AA Group's HAA batteries left their 'Overlord' sites and moved to pre-planned sites across the 'funnel' of V-1 flightpaths. 43 AA Brigade was one of four reinforcing brigade HQs moved into the area within two weeks. However, the initial results were disappointing, and after a fortnight AA Command changed its tactics. Firstly, mobile HAA guns were replaced with static installations that could traverse more quickly to track the fast-moving targets. These were emplaced on temporary 'Pile platforms' named after the Commander-in-Chief of AA Command, Gen Sir Frederick 'Tim' Pile. Secondly, the HAA gun belt was moved to the coast and interlaced with LAA guns to hit the missiles out to sea. This new belt was divided into six brigade sectors, with 43 AA Bde HQ taking charge of one sector, with 183rd (M) HAA and 143rd LAA Rgts under command. The whole process involved the movement of hundreds of guns and vehicles and thousands of servicemen and women, but a new 8-gun site could be established in 48 hours. The guns were constantly in action, but success rate against the 'Divers' steadily improved, until over 50 per cent of incoming missiles were destroyed by gunfire or fighter aircraft. This phase of Operation Diver ended in September after the V-1 launch sites in Northern France had been overrun by 21st Army Group.\non anti-Diver duty at Hastings, 28 July 1944.]]\nOrder of Battle 1944–45\nFrom July 1944 the brigade's composition was as follows:\n* 129th (Mixed) HAA Rgt – rejoined from 5 AA Group August 1944, became non-Mixed August 1945\n** 444, 445, 454 (M) Btys\n** 455 (M) HAA Bty - to 137 (M) HAA Rgt November 1944\n* 130th (M) HAA Rgt – from 5 AA Group September 1944\n** 442, 443, 448, 449 (M) HAA Btys\n* 132nd (M) HAA Rgt – from 102 AA Bde October 1944\n** 435, 450, 457, 469 (M) HAA Btys\n* 134th (M) HAA Rgt – from 40 AA Bde October 1944\n** 459, 460, 461, 583 (M) HAA Btys\n* 138th HAA Rgt – from 57 AA Bde August; to 5 AA Bde September 1944\n** 419, 424, 437, 438 HAA Btys\non anti-Diver duty on the South Coast, August 1944.]]\n* 183rd (M) HAA Rgt – to 71 AA Bde August 1944\n** 564, 591, 608, 640 (M) HAA Btys\n* 188th (M) HAA Rgt – joined October 1944\n** 630, 632, 642 (M) HAA Btys\n* 189th (M) HAA Rgt – from 3 AA Group October 1944\n** 575, 577 (M) HAA Btys\n* 95th LAA Rgt – from 102 AA Bde September; left October 1944\n** 297, 302, 460 LAA Btys\n* 97th LAA Rgt – from 101 AA Bde August; to 1 AA Group October 1944\n** 232, 301, 480 LAA Btys\n* 135th LAA Rgt – from 102 AA Bde August; to 5 AA Bde September\n** 445, 447, 450 LAA Btys\n* 143rd LAA Rgt – to 71 AA Bde August 1944\n** 403, 410, 413 LAA Btys\n* 58th (Middlesex) S/L Rgt – from 5 AA Group September 1944\n** 314, 425, 426 S/L Btys\nBy October 1944, the brigade's HQ establishment was 11 officers, 10 male other ranks and 28 members of the ATS, together with a small number of attached drivers, cooks and mess orderlies (male and female). In addition, the brigade had a Mixed Signal Office Section of 1 officer, 5 male other ranks and 19 ATS, which was formally part of the Group signal unit.\nDisbandment\nIn October 1944, AA Command began planning to counter the expected attacks by air-launched V-1s coming in across the North Sea against targets on the East Coast and the Midlands. AA units and formations were moved from the South Coast, and 43 AA Brigade HQ was disbanded on 15 November.\nPostwar\nWhen the TA was constituted in 1947, 43 AA Bde reformed at Leeds as 69 AA Brigade (TA), once again forming part of 5 AA Group at Nottingham. It now comprised the following units from the West Riding of Yorkshire:\n* 466 (Leeds Rifles) (Mixed) HAA Rgt\n* 496 (Mixed) HAA Rgt\n* 584 (West Yorkshire Regiment) (Mobile) HAA Rgt\n* 538 (West Riding) LAA Rgt, converted to LAA/SL in 1949\n* 578 (5th Bn Duke of Wellington's Regiment) SL Rgt, shortly afterwards converted to Mobile HAA\n* 69 Fire Control Troop, RA\n* 37 (Leeds) AA Signal Squadron, Royal Corps of Signals (part of 5 AA Group's 15th (Mixed) Signal Regiment)\n('Mixed' indicated that members of the Women's Royal Army Corps were integrated into the unit.)\nAA Command was disbanded on 10 March 1955, and there was a considerable reduction in the number of TA AA units. 69 AA Bde was converted into an Army Group Royal Artillery (AGRA) and temporarily designated 'V' AGRA; from 1 August 1955 it became 42 (AA) AGRA at York with the following composition:\n* 324 (Northumbrian) HAA\n* 437 LAA Rgt – the former 54th (Durham Light Infantry) S/L Rgt, see above\n* 438 LAA Rgt\n* 463 LAA/SL Rgt\n* 466 (Leeds Rifles) LAA Rgt – converted from HAA, see above\n* 42 AGRA (AA) Signal Squadron, RCS – formed at Leeds, probably from 37 AA Signal Sqn, see above\nIn 1959, 42 AGRA Signals was renumbered 308 Signal Squadron. When the AGRA was disbanded, this unit transferred to become 308 Signal Sqn (Guards Brigade).\n42 (AA) AGRA was disbanded on 1 May 1961.\nFootnotes\nNotes\nReferences\n* [http://www.ibiblio.org/hyperwar/UN/UK/UK-Defence-UK/index.html Basil Collier, History of the Second World War, United Kingdom Military Series: The Defence of the United Kingdom, London: HM Stationery Office, 1957.]\n* Richard Collier, Eagle Day: The Battle of Britain, August 6–September 15, 1940, London: Hodder & Stoughton, 1966/Pan Books, 1968, .\n* Gen Sir Martin Farndale, History of the Royal Regiment of Artillery: The Years of Defeat: Europe and North Africa, 1939–1941, Woolwich: Royal Artillery Institution, 1988/London: Brasseys, 1996, .\n* J.B.M. Frederick, Lineage Book of British Land Forces 1660–1978, Vol II, Wakefield, Microform Academic, 1984, .\n*\n* Norman E.H. Litchfield, The Territorial Artillery 1908–1988 (Their Lineage, Uniforms and Badges), Nottingham: Sherwood Press, 1992, .\n* Cliff Lord & Graham Watson, Royal Corps of Signals: Unit Histories of the Corps (1920–2001) and its Antecedents, Solihull: Helion, 2003, .\n* [https://www.thegazette.co.uk/London/issue/38149/page/5973 Gen Sir Frederick Pile's despatch: \"The Anti-Aircraft Defence of the United Kingdom from 28th July, 1939, to 15th April, 1945\" London Gazette 18 December 1947]\n* Brig N.W. Routledge, History of the Royal Regiment of Artillery: Anti-Aircraft Artillery 1914–55, London: Royal Artillery Institution/Brassey's, 1994, .\nExternal sources\n* [https://ra39-45.co.uk The Royal Artillery 1939–45]\n* [http://www.britishmilitaryhistory.co.uk British Military History]\n* [http://www.patriotfiles.com/index.php?name=Sections&req=listarticles&secid=17 Orders of Battle at Patriot Files]\n* [https://web.archive.org/web/20150829181242/http://british-army-units1945on.co.uk/ British Army units from 1945 on]\n* [http://www.orbat.info/history/historical/uk/ta47.html Graham Watson, The Territorial Army 1947]"
    }
  ]
}