{
  "content": [
    {
      "type": "text",
      "text": "# 4 Kings (2021 film)\n\n| caption        =\n| director       = Phuttipong Nakthong\n| writer         = Phuttipong Nakthong\n| producer       = Thanawat Thampreechapong\n| starring       =\n| cinematography = Pasit Tandaechanurat\n| editing        = Dog Back Dee\n| music          = Terdsak Janpan\n| studio         = Kum-Kub-Nang Neramitnang Film\n| distributor    = M Pictures\n| released       =\n| runtime        = 139 minutes\n| country        = Thailand\n| language       = Thai\n| budget         = ฿15&nbsp;million\n| gross          =  ฿69.82&nbsp;million ฿170&nbsp;million\n}}\n4 Kings ( or 4 Kings ar chee wa yuk 90, lit: 4 Kings 90's vocational) is a 2021 Thai neo-noir crime drama film written and directed by Phuttipong Nakthong, produced by Thanawat Thampreechapong\nThe film follows the conflict between vocational students and students of various institutions in the 1990s.\nPlot\nThe film, set in 1995, was told through the memories of Billy, a former vocational student who turned to be a single dad with Am his teenage daughter. Though this father-daughter relationship is not very healthy, when Am gets injured from a vocational school gangs fight, Billy reminisces his own and his friends' pasts. In the '90s, there were many vocational schools that were notorious for being rowdy students, in those days the most famous were four schools which were Intaraarcheewasueksa, Changkolburanabondh, Technologyprachachol and Kanokarcheewa. They were collectively nicknamed \"4 Kings\".\nBilly got depressed when his mother remarried and his stepfather just hated him. His only getaway is his close friends, so he had to do everything to keep and protect his comradeship with his schoolmates. Billy encountered all sorts of conflicts and lost his best friend. It is such a big life lesson that he has to pay back until these days.\nCast\n* Itkron Pungkiatrussamee (Jaii TaitosmitH) as Billy\n* Poom Rungsrithananon as Lupin\n* Arak Amornsupasiri (Pae Slur) as Da\n* Nat Kitcharit as Oh\n* Sirat Intarachote as Ek\n* Akarin Akaranitimaytharatt as Mot\n* Ukrit Willibrord Dongabriel (ฺBig D Gerrard) as Yat\n* Somphol Rungpanich (Lham Somphol) as Bang\n* Naerunchara Lertprasert as Ou\n* Sukanya Migael as Da's mother\n* Jirawat Wachirasarunpat as Ou's father\n* Paramej Noiam as Billy's stepfather\n* Priya Sangkhachinda as Am, Inthira\n* Ratchanee Boontatharokul as Billy's mother\n* Pimchamai Pattarasinsiri as Ou's mother\n* Warawut Brown as Rang\n* Chanatip Pisutseerewong as X\nProduction and reception\nThe film based on actual events in Thai society about the issue of quarrels among teenage vocational students which injures unrelated persons as well. They often fought on the streets, on buses, or at bus stops. Film director and writer Phuttipong Nakthong had been through these terrible times and therefore used his own experience to convey it into a screenplay. It took up to 7 years for production to be released. It is his debut film from newlyn motion picture production company Neramitnang Film.\n4 Kings develops itself from a short film in same title released on social media in mid-2015 about a battle between vocational students until it became very well known.\nWhen it was released, it quickly gained popularity and became a phenomenon. It was No. 1 at the box office on opening weekend, with a total income of ฿50&nbsp;million after only 4 days of showing, beating Thai-South Korean found footage mockumentary horror film The Medium from the top spot. Separately, Thai Civilized Party leader Mongkolkit Suksintharanon on 14 December invited vocational students to join him at Esplanade Cineplex Ngamwongwan-Khae Rai to watch the film.\nAt each screening in theatres in various locations, vocational students often gather to watch the film. And they often fight after it ends. It has been observed whether this is a film imitation behavior.\nThe film has been in theatres for 9 weeks in a row. Total revenue of ฿170&nbsp;million was considered the highest grossing Thai film in the year.\nIt was selected to screen at the 17th Japan Asian Film Festival or Osaka Asian Film Festival 2022 as a special program New Action! Southeast Asia between 10–20 March 2022, as well as being nominated for 2 awards.\nIt was shown again as an outdoor cinema in the evening of 14 July 2022 at the Vachirabenjatas Park (Rot Fai Park) as part of Open-Air Movie Festival by Bangkok Metropolitan Administration (BMA).\nOriginal soundtrack\n* \"Nak Leng Kao\" (นักเลงเก่า; \"Former Gangster\"), ending theme by TaitosmitH feat D Gerrard\n* \"Mung Kub Ku\" (มึงกับกู; \"You & I\") by Itkron Pungkiatrussamee\n* \"Kid Pai Aeng\" (คิดไปเอง; \"All In Your Head\") by SMF\n* \"Palang Rak\" (พลังรัก; \"Love Power\") by SMF\n* \"Wad Rawaeng\" (หวาดระแวง; \"Paranoid\") by SMF\n* \"Khon\" (\"ก่อน\"; \"Before\") by Modern Dog\n* \"Sabai Dee\" (สบายดี; \"Fine\") by Nakarin Kingsak\nAccolades\n{| class=\"wikitable\"\n|- style=\"background:#b0c4de; text-align:center;\"\n! Award\n! Subject\n! Nominee\n! Result\n! Note\n|-\n|rowspan=2|18th Kom Chad Luek Awards\n|Best Actor\n|Itkron Pungkiatrussamee\n|\n|\n|-\n|Best Supporting Actor\n|Ukrit Willibrord Dongabriel\n|\n|\n|-\n|rowspan=2|Osaka Asian Film Festival 2022\n|Audience Award\n|4 Kings\n|\n|\n|-\n|ABC Award\n|4 Kings\n|\n|\n|-\n|rowspan=5|30th Bangkok Critics Assembly Awards\n|Best Original Song\n|Mung Kub Ku\n|\n|\n|-\n|Best Actor\n|Itkron Pungkiatrussamee\n|\n|\n|-\n|Best Supporting Actor\n|Nat Kitcharit\n|\n|\n|-\n|Best Supporting Actress\n|Sukanya Migael\n|\n|\n|-\n|2021 Highest-grossing Thai Film\n|4 Kings\n|\n|\n|-\n|rowspan=20|30th Suphannahong National Film Awards\n|Best Picture\n|4 Kings\n|\n|\n|-\n|Best Director\n|Phuttipong Nakthong\n|\n|\n|-\n|rowspan=2|Best Actor\n|Itkron Pungkiatrussamee\n|\n|rowspan=2|\n|-\n| Arak Amornsupasiri\n|\n|-\n|Best Supporting Actor\n|Nat Kitcharit\n|\n|\n|-\n|Best Supporting Actress\n|Sukanya Migael\n|\n|\n|-\n|Best Original Screenplay\n|Phuttipong Nakthong\n|\n|\n|-\n|Best Cinematography\n|Pasit Tandaechanurat\n|\n|\n|-\n|Best Sound Editing and Mixing\n|Kantana Sound Studio\n|\n|\n|-\n|Best Editing\n|Dog Back Dee\n|\n|\n|-\n|Best Original Song\n|Mung Kub Ku\n|\n|\n|-\n|Best Original Score\n|Toi Terdsak\n|\n|\n|-\n|Best Art Direction\n|Kacha Ruangthong\n|\n|\n|-\n|Best Costume Design\n|Siriwan Kanchuchor\n|\n|\n|-\n|Best Makeup\n|Tattalee Jarujutarat\n|\n|\n|-\n|Best Visual Effects\n|Brothers Pictures\n|\n|\n|}\nSequel\nAt 9:29&nbsp;a.m. on Friday, 14 October 2022, Neramitnang Film executives and the production team visited Wat Ratchasittharam temple to pray and receive blessings for the filming of 4 Kings Part 2. This ceremony was participated by 4 Kings original actors as well as the cast from the new film.\n4 Kings Part 2 scheduled to be released in 2023. It is believed the story seems to be a conflict between Kanokarcheewa and Changkolburanabondh as shown in a mid-credits scene shows three Kanok students, led by Bang walk to face three Buranabondh students, led by Ek. Bang shoots a gun to threaten the sky and finally saying  \"See you next album, man\".\nNotes\nReferences\nExternal links\n*\n*"
    }
  ]
}