{
  "content": [
    {
      "type": "text",
      "text": "# 4th Ersatz Division (German Empire)\n\nThe 4th Ersatz Division (4. Ersatz-Division) was a unit of the German Army, in World War I. The division was formed on mobilization of the German Army in August 1914. The division was disbanded in 1919, during the demobilization of the German Army after World War I.\nFormation and recruitment\nThe 4th Ersatz Division was formed on mobilization from 13 brigade replacement battalions (Brigade-Ersatz-Bataillone). Each brigade replacement battalion was numbered after its parent infantry brigade, and was formed with two companies taken from the replacement battalion of each of the brigade's two infantry regiments. Thus, collectively, the 13 brigade replacement battalions represented troop contributions from 26 different infantry regiments. The four battalions of the 9th Mixed Ersatz Brigade were from the Prussian Province of Brandenburg, as were the brigade's artillery, cavalry and pioneer formations. Two battalions of the 13th Mixed Ersatz Brigade were from the Prussian Province of Saxony, one was a mixed battalion from Prussian Saxony and the Duchy of Anhalt, and one was a mixed battalion from Prussian Saxony and the Duchy of Saxe-Altenburg. The brigade's artillery, cavalry and pioneer formations were primarily from Prussian Saxony. The five battalions of the 33rd Mixed Ersatz Brigade, from the IX Army Corps area in northern Germany, were even more mixed: the 33rd Brigade Replacement Battalion was from the Hanseatic Cities of Bremen and Hamburg; the 34th from the Grand Duchies of Mecklenburg-Schwerin and Mecklenburg-Strelitz; the 35th and 36th from Schleswig-Holstein; and the 81st from Schleswig-Holstein and the Hanseatic City of Lübeck. The brigade's artillery, cavalry and pioneer formations were mainly from Schleswig-Holstein, Mecklenburg-Schwerin and Hamburg.\nCombat chronicle\nThe 4th Ersatz Division initially fought on the Western Front in World War I. It fought in the Battle of the Frontiers, seeing action in Lorraine and against the French defensive line from Nancy to Epinal. At the end of September 1914, the division was transferred from Lorraine to Belgium, where it participated in the Siege of Antwerp. After Antwerp fell, the division occupied the city and participated in follow-on fighting in Belgian Flanders. It fought in the Battle of the Yser and then went into the line on the Yser until November 1916. During this period, the division fought in the Second Battle of Ypres in April/May 1915 and in the Battle of the Somme in October 1916. It was in the trenchlines in the Somme region from December 1916 to February 1917. After fighting before the German Siegfried position, the division participated in the Battle of Arras. In late May 1917, the division was transferred to the Eastern Front. In July, it resisted the Russian Kerensky Offensive, and then participated in follow-on fighting in eastern Galicia. In December 1917, the division returned to the Western Front. It was in the trenchlines in Flanders and the Artois until April 1918, when it fought in the Battle of Armentières, part of the Battle of the Lys, also known as the German Lys Offensive or the Fourth Battle of Ypres. The division later fought in the Second Battle of the Marne. Allied intelligence considered the division a fairly good division in 1917, but rated it third class in 1918, noting that it had not distinguished itself in the battles of 1918.\nOrder of battle on mobilization\nThe order of battle of the 4th Ersatz Division on mobilization was as follows:\n* 9. gemischte Ersatz-Brigade\n** Brigade-Ersatz-Bataillon Nr. 9\n** Brigade-Ersatz-Bataillon Nr. 10\n** Brigade-Ersatz-Bataillon Nr. 11\n** Brigade-Ersatz-Bataillon Nr. 12\n** Kavallerie-Ersatz-Abteilung/III. Armeekorps\n** Feldartillerie-Ersatz-Abteilung Nr. 18 (Ersatz-Abteilung/Feldartillerie-Regiment Nr. 18)\n** Feldartillerie-Ersatz-Abteilung Nr. 39 (Ersatz-Abteilung/Feldartillerie-Regiment Nr. 39)\n** 2. Ersatz-Kompanie/Brandenburgisches Pionier-Bataillon Nr. 3\n* 13. gemischte Ersatz-Brigade\n** Brigade-Ersatz-Bataillon Nr. 13\n** Brigade-Ersatz-Bataillon Nr. 14\n** Brigade-Ersatz-Bataillon Nr. 15\n** Brigade-Ersatz-Bataillon Nr. 16\n** Kavallerie-Ersatz-Abteilung/IV. Armeekorps\n** Feldartillerie-Ersatz-Abteilung Nr. 40 (Ersatz-Abteilung/Feldartillerie-Regiment Nr. 40)\n** Feldartillerie-Ersatz-Abteilung Nr. 75 (Ersatz-Abteilung/Feldartillerie-Regiment Nr. 75)\n** 1. Ersatz-Kompanie/Magdeburgisches Pionier-Bataillon Nr. 4\n* 33. gemischte Ersatz-Brigade\n** Brigade-Ersatz-Bataillon Nr. 33\n** Brigade-Ersatz-Bataillon Nr. 34\n** Brigade-Ersatz-Bataillon Nr. 35\n** Brigade-Ersatz-Bataillon Nr. 36\n** Brigade-Ersatz-Bataillon Nr. 81\n** Kavallerie-Ersatz-Abteilung Wandsbeck/IX. Armeekorps\n** Feldartillerie-Ersatz-Abteilung Nr. 45 (Ersatz-Abteilung/Feldartillerie-Regiment Nr. 45)\n** Feldartillerie-Ersatz-Abteilung Nr. 60 (Ersatz-Abteilung/Feldartillerie-Regiment Nr. 60)\n** 1. Ersatz-Kompanie/Schleswig-Holsteinsiches Pionier-Bataillon Nr. 9\nOrder of battle on 15 July 1915\nThe division was restructured in the summer of 1915.  The 33rd Ersatz Brigade was dissolved in July 1915.  The other mixed Ersatz brigades were converted to Ersatz infantry brigades as cavalry, artillery, and pioneer Ersatz units were grouped and reorganized.  The brigade replacement battalions were grouped into infantry regiments.  The order of battle on 15 July 1915 was as follows:\n* 9. Ersatz-Infanterie-Brigade\n** Infanterie-Regiment Nr. 359\n** Infanterie-Regiment Nr. 360\n* 13. Ersatz-Infanterie-Brigade\n** Infanterie-Regiment Nr. 361\n** Infanterie-Regiment Nr. 362\n* Kavallerie-Ersatz-Eskadron Nr. 4\n* 4. Ersatz-Feldartillerie-Brigade\n** Feldartillerie-Regiment Nr. 90\n** Feldartillerie-Regiment Nr. 91\n* Pionier-Kompanie Nr. 303\n* Pionier-Kompanie Nr. 304\n* Pionier-Kompanie Nr. 305\nOrder of battle on 1 March 1918\nThe division underwent more structural changes as the war progressed.  The 4th Ersatz Division was triangularized in September 1916.  The 359th Infantry regiment was transferred to the newly formed 206th Infantry Division in August 1916.  Over the course of the war, cavalry was reduced, pioneers were increased to a full battalion, and an artillery command and a divisional signals command were created. The division's order of battle on 1 March 1918 was as follows:\n* 13. Ersatz-Infanterie-Brigade\n** Infanterie-Regiment Nr. 360\n** Infanterie-Regiment Nr. 361\n** Infanterie-Regiment Nr. 362\n* 3. Eskadron/Magdeburgisches Husaren-Regiment Nr. 10\n* Artillerie-Kommandeur 139\n** Feldartillerie-Regiment Nr. 90\n** Fußartillerie-Bataillon Nr. 119 (from 17 August 1918)\n* Pionier-Bataillon Nr. 504\n** Pionier-Kompanie Nr. 304\n** Pionier-Kompanie Nr. 305\n** Minenwerfer-Kompanie Nr. 161\n* Divisions-Nachrichten-Kommandeur 554\nReferences\n* [https://web.archive.org/web/20070930163815/http://www.1914-18.info/erster-weltkrieg.php?u=117 4. Ersatz-Division (Chronik 1914/1918) - Der erste Weltkrieg]\n* [http://www.militaerpass.net/4ed.htm Militaerpass.net - 4. Ersatz-Division order of battle and 1914-1918 overview]\n* Hermann Cron et al., Ruhmeshalle unserer alten Armee (Berlin, 1935)\n* Hermann Cron, Geschichte des deutschen Heeres im Weltkriege 1914-1918 (Berlin, 1937)\n* Günter Wegner, Stellenbesetzung der deutschen Heere 1815-1939. (Biblio Verlag, Osnabrück, 1993), Bd. 1\n* Histories of Two Hundred and Fifty-One Divisions of the German Army which Participated in the War (1914-1918), compiled from records of Intelligence section of the General Staff, American Expeditionary Forces, at General Headquarters, Chaumont, France 1919 (1920)\nNotes"
    }
  ]
}