{
  "content": [
    {
      "type": "text",
      "text": "# 4th Landwehr Division (German Empire)\n\nThe 4th Landwehr Division (4. Landwehr-Division) was an infantry division of the Imperial German Army during World War I.  It was formed on mobilization of the German Army in August 1914 under the \"Higher Landwehr Commander 4\" (Höherer Landwehr-Kommandeur 4).  The Landwehr was the third category of the German Army, after the regular Army and the reserves.  Thus Landwehr divisions were made up of older soldiers who had passed from the reserves, and were intended primarily for occupation and security duties rather than heavy combat.  The division was primarily raised in the Prussian provinces of Upper and Lower Silesia.  It was disbanded in 1919 during the demobilization of the German Army after World War I.\nCombat chronicle\nThe 4th Landwehr Division fought on the Eastern Front in World War I.  It was on the front in Poland from the early days, and participated in the Gorlice-Tarnów Offensive, crossing the Vistula in July and advancing toward the Bug, and eventually reaching the line between the Servech and Shchara rivers near Baranovichi, where the front stabilized.  It remained in the line there until the armistice on the Eastern Front in December 1917.  Thereafter, the division served in Ukraine and in German occupation forces in Russia.  In November 1918, elements of the division were transferred to the Western Front, but had barely arrived in the line by the end of the war.  Allied intelligence rated the division as mediocre.\nOrder of battle on mobilization\nThe order of battle of the 4th Landwehr Division on mobilization in August 1914 was as follows:\n*22.Landwehr-Infanterie-Brigade\n**Landwehr-Infanterie-Regiment Nr. 11\n**Landwehr-Infanterie-Regiment Nr. 51\n*23.Landwehr-Infanterie-Brigade\n**Landwehr-Infanterie-Regiment Nr. 22\n**Landwehr-Infanterie-Regiment Nr. 23\n*21.Ersatz-Infanterie-Brigade\n**Brigade-Ersatz-Bataillon Nr. 21\n**Brigade-Ersatz-Bataillon Nr. 22\n**Brigade-Ersatz-Bataillon Nr. 23\n**Brigade-Ersatz-Bataillon Nr. 24\n**Brigade-Ersatz-Bataillon Nr. 78\n*Ersatz-Kavallerie-Regiment\n*Landwehr-Kavallerie-Regiment Nr. 2\n*Ersatz-Abteilung/Feldartillerie-Regiment von Puecker (1. Schlesisches) Nr. 6\n*Ersatz-Abteilung/2. Oberschlesisches Feldartillerie-Regiment Nr. 57\n*1.Landsturm-Batterie/VI.Armeekorps\n*2.Landsturm-Batterie/VI.Armeekorps\n*Ersatz-Kompanie/Schlesisches Pionier-Bataillon Nr. 6\nDue to losses suffered by the 4th Landwehr Division in the Battle of Tarnawka (7–9 September 1914), the 11th and 51st Landwehr Infantry Regiments were reduced to a single battalion each; the 22nd and 23rd Landwehr Infantry Regiments were reduced to two battalions each. On 14 September 1914, the 21st Ersatz Infantry Brigade was dissolved and its Brigade Ersatz battalions used to replace combat losses in the following Landwehr battalions:\n:21st Brigade Ersatz Battalion absorbed into II Battalion, 51st Landwehr Infantry Regiment\n:22nd Brigade Ersatz Battalion absorbed into II Battalion, 11th Landwehr Infantry Regiment\n:23rd Brigade Ersatz Battalion absorbed into II Battalion, 51st Landwehr Infantry Regiment\n:24th Brigade Ersatz Battalion absorbed into II Battalion, 11th Landwehr Infantry Regiment\n:78th Brigade Ersatz Battalion absorbed into II Battalion, 78th Landwehr Infantry Regiment\nOrder of battle on February&nbsp;5, 1918\nThe division underwent several structural changes as the war progressed.  It was triangularized in September 1916, dissolving the 23rd Landwehr Infantry Brigade.  Cavalry was reduced, pioneers were increased to a full battalion, and a divisional signals command was created. The division's order of battle on February 5, 1918, was as follows:\n*22.Landwehr-Infanterie-Brigade\n**Landwehr-Infanterie-Regiment Nr. 11\n**Landwehr-Infanterie-Regiment Nr. 23\n**Landwehr-Infanterie-Regiment Nr. 51\n*3.Eskadron/Dragoner-Regiment von Bredow (1. Schlesisches) Nr. 4\n*Landwehr-Feldartillerie-Regiment Nr. 4\n*Pionier-Bataillon Nr. 404\n*Divisions-Nachrichten-Kommandeur 504\nNotes\nReferences\n* [http://www.1914-18.info/erster-weltkrieg.php?u=305 4. Landwehr-Division (Chronik 1914/1918) - Der erste Weltkrieg]\n* Hermann Cron et al., Ruhmeshalle unserer alten Armee (Berlin, 1935)\n* Hermann Cron, Geschichte des deutschen Heeres im Weltkriege 1914-1918 (Berlin, 1937)\n* Günter Wegner, Stellenbesetzung der deutschen Heere 1815-1939. (Biblio Verlag, Osnabrück, 1993), Bd. 1\n* Histories of Two Hundred and Fifty-One Divisions of the German Army which Participated in the War (1914-1918), compiled from records of Intelligence section of the General Staff, American Expeditionary Forces, at General Headquarters, Chaumont, France 1919 (1920)\n*\npl:5 Dywizja Landwehry Cesarstwa Niemieckiego"
    }
  ]
}