{
  "content": [
    {
      "type": "text",
      "text": "# 4th Youth in Film Awards__disambig_1\n\nThe 4th Youth in Film Awards ceremony (now known as the Young Artist Awards), presented by the Youth in Film Association, honored outstanding youth performers under the age of 21 in the fields of film and television for the 1981-1982 season, and took place on November 21, 1982, at the Sheraton Universal Hotel in Universal City, California.\nThe big winner that year was E.T. the Extra-Terrestrial, with one of the rare \"sweeps\" in the history of the Youth in Film Awards. The film won all categories for which it was nominated, taking a total of four awards – \"Best 'Fantasy' Family Motion Picture\", \"Best Young Actor in a Motion Picture\" for Henry Thomas, \"Best Young Supporting Actor in a Motion Picture\" for Robert MacNaughton and \"Best Young Supporting Actress in a Motion Picture\" for Drew Barrymore.\nEstablished in 1978 by long-standing Hollywood Foreign Press Association member, Maureen Dragone, the Youth in Film Association was the first organization to establish an awards ceremony specifically set to recognize and award the contributions of performers under the age of 18 in the fields of film, television, theater and music.\nCategories\n★ Bold indicates the winner in each category.\nBest Young Performer in a Feature Film\nBest Young Motion Picture Actor\n★ 'Henry Thomas - E.T. the Extra-Terrestrial (Universal)'\n*Doug McKeon - Night Crossing (Disney)\n*Matt Dillon - Tex (Disney)\nBest Young Motion Picture Actress\n★ 'Aileen Quinn - Annie (Columbia)'\n*Bridgette Andersen - Savannah Smiles (Embassy)\n*Michelle Pfeiffer - Grease 2 (Paramount)\nBest Young Supporting Actor in a Motion Picture\n★ 'Robert MacNaughton - E.T. the Extra-Terrestrial (Universal)'\n*Ian Fried - Rocky III (MGM)\n*Josh Milrad - The Beastmaster (Film Builder's Corp)\n*Ronnie Scribner - Split Image (Orion)\n*Sam Robards - Tempest (Columbia)\nBest Young Supporting Actress in a Motion Picture\n★ 'Drew Barrymore - E.T. the Extra-Terrestrial (Universal)'\n*Toni Ann Gisondi - Annie (Columbia)\n*Heather O'Rourke - Poltergeist (MGM)\n*Molly Ringwald - Tempest (Columbia)\nBest Young Performer in a Television Movie\nBest Young Actor in a Movie Made for Television\n★ 'Neil Billingsley - Million Dollar Infield (CBS)'\n*David Faustino - 40 Days for Danny (ABC)\n*Lance Kerwin - The Shooting (CBS)\n*Meeno Peluce - Million Dollar Infield (CBS)\n*Ricky Schroder - Little Lord Fauntelroy (Norman Rosemont Productions)\nBest Young Actress in a Movie Made for Television\n★ 'Nancy McKeon - The Facts of Life Goes to Paris (NBC)'\n*Susan Blackstone - The Rules of Marriage (20th Century Fox)\n*Tara Kennedy - The Electric Grandmother (NBC)\n*Angela Lee - Breaking Up is Hard To Do (Columbia)\n*Sydney Penny - The Patricia Neal Story (CBS)\n*Sydney Penny - The Capture of Grizzly Adams (NBC)\nBest Young Performer in a Television Special\nBest Young Actor in a Television Special\n★ 'Adam Rich - CBS Children's Mystery Theatre - Zertigo Diamond Caper (CBS)'\n*Scott Constantine - Sam (Associated Film Artists)\n*Jason Hervey - ''ABC Afterschool Special - Daddy, I'm Their Mama Now (ABC)\n*Jason Lively - ABC Afterschool Special - Daddy, I'm Their Mama Now (ABC)\n*Barret Oliver - The Circle Family (NBC)\n*Byron Thames - CBS Afternoon Playhouse - Just Pals (CBS)\nBest Young Actress in a Television Special\n★ 'Nancy McKeon - ''Please Don't Hit Me, Mom! (ABC)'\n*Heather Haase - Goldie and Kids: Listen to Us (ABC)\n*Heather McAdam - CBS Afternoon Playhouse Just Pals (CBS)\n*Sydney Penny - The Circle Family (NBC)\nBest Young Performer in a Television Series\nBest Young Actor in a Drama Series\n★ 'Timothy Gibbs - Father Murphy (NBC)'\n*David Friedman - Little House on the Prairie: A New Beginning (NBC)\n*Matthew Laborteaux - Little House on the Prairie: A New Beginning (NBC)\n*Scott Mellini - Father Murphy (NBC)\n*Adam Rich - Code Red (ABC)\nBest Young Actress in a Drama Series\n★ ' (tie) Melissa Gilbert - Little House on the Prairie: A New Beginning (NBC)★  (tie) Jill Whelan - The Love Boat (ABC)'\n*Allison Balson - Little House on the Prairie: A New Beginning (NBC)\n*Tonya Crowe - Knots Landing (CBS)\n*Shannen Doherty - Little House on the Prairie: A New Beginning (NBC)\n*Missy Francis - Little House on the Prairie: A New Beginning (NBC)\nBest Young Actor in a Comedy Series\n★ 'Gary Coleman - Diff'rent Strokes (NBC)'\n*Peter Billingsley - Real People (NBC)\n*Todd Bridges - ''Diff'rent Strokes (NBC)\n*Glenn Scarpelli - One Day at a Time (CBS)\nBest Young Actress in a Comedy Series\n★ 'Nancy McKeon - The Facts of Life (NBC)'\n*Danielle Brisebois - Archie Bunker's Place (CBS)\n*Mindy Cohn - The Facts of Life (NBC)\n*Missy Gold - Benson (ABC)\n*Kaleena Kiff - Love, Sidney (NBC)\n*Kari Michaelsen - Gimme a Break!'' (NBC)\n*Heather O'Rourke - Happy Days (ABC)\n*Lisa Whelchel - The Facts of Life (NBC)\nBest Young Actor in a New Television Series\n★ 'Ricky Schroder - Silver Spoons (NBC)'\n*Scott Baio - Joanie Loves Chachi (ABC)\n*Jason Bateman - Silver Spoons (NBC)\n*Christian Jacobs - Gloria (CBS)\n*Meeno Peluce - Voyagers! (NBC)\n*River Phoenix - Seven Brides for Seven Brothers (CBS)\nBest Young Actress in a New Television Series\n★ 'Erin Moran - Joanie Loves Chachi (ABC)'\n*Amy Linker - Square Pegs (CBS)\n*Kathy Maisnik - Star of the Family (ABCd)\n*Sarah Jessica Parker - Square Pegs (CBS)\n*Tina Yothers - Family Ties (NBC)\nBest Young Actor in a Daytime Series\n★ 'Michael Damian - The Young and the Restless (CBS)'\n*Dick Billingsley - Days of Our Lives (NBC)\n*Andre Gower - The Young and the Restless (CBS)\n*David Mendenhall - General Hospital (ABC)\n*Damian Shaller - Texas (NBC)\n*John Stamos - General Hospital (ABC)\nBest Young Actress in a Daytime Series\n★'Janine Turner - General Hospital (ABC)'\n*Jennifer Cooke - Guiding Light (CBS)\n*Liz Keifer - The Young and the Restless (CBS)\n*Debbie Lytton - Days of Our Lives (NBC)\n*Lori Loughlin - The Edge of Night (ABC)\nBest Young Actor: Guest on a Series\n★ 'Keith Mitchell - Knight Rider (NBC)'\n*Marc Bentley - The Young and the Restless (CBS)\n*Kirk Brennan - Father Murphy (NBC)\n*Corey Feldman - The Love Boat (ABC)\n*Rossie Harris - Hart to Hart (ABC)\n*Chez Lister - Father Murphy (NBC)\n*Shavar Ross - ''Diff'rent Strokes (NBC)\n*Lance Toyoshima - M*A*S*H (CBS)\nBest Young Actress: Guest on a Series\n★ 'Roxana Zal - Hart to Hart (ABC)'\n*Shannen Doherty - Father Murphy (NBC)\n*Nicole Eggert - Fantasy Island (ABC)\n*Angela Lee - Quincy, M.E. (NBC)\n*Sheri Strahl - Little House on the Prairie: A Christmas To Remember (NBC)\nBest Family Entertainment\nBest Family Motion Picture\n★ 'Rocky III (M.G.M.)'\n*Night Crossing (Disney)\n*Tex (Disney)\n*Savannah Smiles (Embassy)\nBest Family Motion Picture: Animated, Music or Fantasy\n★ 'E.T. the Extra-Terrestrial (Universal)'\n*Annie (Columbia)\n*Grease 2 (Paramount)\n*The Secret of NIMH (M.G.M.)\n*Tron (Disney)\nBest New Family Television Series\n★ 'Silver Spoons (NBC)'\n*Knight Rider (NBC)\n*Little House on the Prairie, A New Beginning (NBC)\n*Seven Brides for Seven Brothers (CBS)\n*Star of the Family'' (ABC)\nReferences\nExternal links\n*[https://www.youngartistacademy.info/newsite/ Official site]"
    }
  ]
}