{
  "content": [
    {
      "type": "text",
      "text": "# 4th Astra TV Awards\n\n}}\n| website          =\n}}\nThe 4th Astra TV Awards, presented by the Hollywood Creative Alliance, were due to take place on August 18, 2024, at the Avalon Hollywood in Hollywood. The ceremony, produced by DIGA Studios and Content.23 Media, was streamed live on the official Astra Awards YouTube channel and KNEKT Television Network. The nominations were announced on July 9, 2024.\nOn August 13, 2024, affected parties were quietly informed that the event was being temporarily shelved. A public announcement was eventually made on August 18, 2024, via The Astra Awards social media account on Twitter at 6:39 p.m. PDT (39 minutes after the event was due to begin live streaming), informing users that \"due to a recent emergency, the Astra TV Awards have been postponed\" and \"a new date will be announced shortly\". The postponement came weeks after a proposed partnership with GALECA: The Society of LGBTQ Entertainment Critics was scrapped days after being announced due to fierce objections from GALECA members.\nOn October 4, 2024, it was announced that the ceremony would occur on December 8, the same day as the 8th Astra Film Awards and the 3rd Astra Creative Arts Awards.\nIn terms of nominations, The Bear led with 15, followed by Hacks and Only Murders in the Building with 13 each; Abbott Elementary, Ghosts, and The Morning Show received 11 apiece. Channelwise, Netflix led the nominees with 66, followed by Apple TV+ with 44, ABC with 41 and CBS with 39.\nThe Astra Creative Arts TV Awards, which had its inaugural ceremony the previous year, was discontinued and reorganized into the main TV Awards. Additionally, three new categories were introduced: \"Best Anime Series\", \"Best Children or Family Series\", and \"Best Saturday Night Live Host\". In total, the Astra TV Awards had more than 50 categories across broadcast network, cable, and streaming.\nWinners and nominees\nWinners are listed first and highlighted with boldface.\nBroadcast Network/Cable Comedy Series\n{| class=\"wikitable\"\n| valign=\"top\" width=\"50%\"|\n* 'Ghosts (CBS)'\n** Abbott Elementary (ABC)\n** Animal Control (Fox)\n** The Conners (ABC)\n** The Neighborhood (CBS)\n** Not Dead Yet (ABC)\n** Son of a Critch (The CW)\n** Young Sheldon (CBS)\n| valign=\"top\" width=\"50%\"|\n* 'What We Do in the Shadows (FX)'\n** Curb Your Enthusiasm (HBO)\n** ''It's Always Sunny in Philadelphia (FX)\n** Resident Alien (Syfy)\n** The Righteous Gemstones (HBO)\n** Shining Vale (Starz)\n|-\n| valign=\"top\" width=\"50%\"|\n* 'Alan Tudyk – Resident Alien as Harry Vanderspeigle (Syfy)'\n** Cedric the Entertainer – The Neighborhood as Calvin Butler (CBS)\n** Dulé Hill – The Wonder Years as Bill Williams (ABC)\n** Iain Armitage – Young Sheldon as Sheldon Cooper (CBS)\n** John Goodman – The Conners as Dan Conner (ABC)\n** Larry David – Curb Your Enthusiasm as Himself (HBO)\n** Matt Berry – What We Do in the Shadows as Leslie \"Laszlo\" Cravensworth (FX)\n** Utkarsh Ambudkar – Ghosts as Jay Arondekar (CBS)\n| valign=\"top\" width=\"50%\"|\n* 'Quinta Brunson – Abbott Elementary as Janine Teagues (ABC)'\n** Gina Rodriguez – Not Dead Yet as Nell Serrano (ABC)\n** Kaitlin Olson – It's Always Sunny in Philadelphia as Dee Reynolds (FX)\n** Marcia Gay Harden – So Help Me Todd as Margaret Wright (CBS)\n** Natasia Demetriou – What We Do in the Shadows as Nadja of Antipaxos (FX)\n** Rose McIver – Ghosts as Samantha \"Sam\" Arondekar (CBS)\n** Sara Tomko – Resident Alien as Asta Twelvetrees (Syfy)\n** Tichina Arnold – The Neighborhood as Tina Butler (CBS)\n|-\n| valign=\"top\" width=\"50%\"|\n* 'Harvey Guillén – What We Do in the Shadows as Guillermo de la Cruz (FX)'\n** Asher Grodman – Ghosts as Trevor Lefkowitz (CBS)\n** Bowen Yang – Saturday Night Live as Various Characters (NBC)\n** Brandon Scott Jones – Ghosts as Captain Isaac Higgintoot (CBS)\n** Chris Perfetti – Abbott Elementary as Jacob Hill (ABC)\n** J. B. Smoove – Curb Your Enthusiasm as Leon Black (HBO)\n** Richie Moriarty – Ghosts as Peter \"Pete\" Martino (CBS)\n** Tyler James Williams – Abbott Elementary as Gregory Eddie (ABC)\n| valign=\"top\" width=\"50%\"|\n* 'Sheryl Lee Ralph – Abbott Elementary as Barbara Howard (ABC)'\n** Annie Potts – Young Sheldon as Constance \"Connie\" Tucker (CBS)\n** Danielle Pinnock – Ghosts as Alberta Haynes (CBS)\n** Janelle James – Abbott Elementary as Ava Coleman (ABC)\n** Kristen Schaal – What We Do in the Shadows as The Guide (FX)\n** Lisa Ann Walter – Abbott Elementary as Melissa Schemmenti (ABC)\n** Rebecca Wisocky – Ghosts as Henrietta \"Hetty\" Woodstone (CBS)\n** Susie Essman – Curb Your Enthusiasm as Susie Greene (HBO)\n|-\n| valign=\"top\" width=\"50%\"|\n* 'Abbott Elementary – Randall Einhorn: \"Party\" (ABC)'\n** Curb Your Enthusiasm – Jeff Schaffer: \"No Lessons Learned\" (HBO)\n** Ghosts'' – Pete Chatmon: \"Halloween 3: The Guest Who Wouldn't Leave\" (CBS)\n** Resident Alien – Robert Duncan McNeill: \"Homecoming\" (Syfy)\n** What We Do in the Shadows – Kyle Newacheck: \"A Weekend at Morrigan Manor\" (FX)\n** The Wonder Years – Melissa Kosar: \"Takeover Spirit\" (ABC)\n| valign=\"top\" width=\"50%\"|\n* 'Ghosts – Sophia Lear: \"Holes are Bad\" (CBS)'\n** Abbott Elementary – Quinta Brunson: \"Career Day\" (ABC)\n** The Righteous Gemstones – John Carcieri and Danny McBride: \"Interlude III\" (HBO)\n** So Help Me Todd – Scott Prendergast: \"Iceland Was Horrible\" (CBS)\n** What We Do in the Shadows – Jake Bender and Zach Dunn: \"Pride Parade\" (FX)\n** Young Sheldon – Chuck Lorre, Steven Molaro, and Steve Holland: \"Funeral\" (CBS)\n|}\nStreaming Comedy Series\n{| class=\"wikitable\"\n|+\n| colspan=\"2\" valign=\"top\" width=\"50%\"|\n* 'Hacks (Max)'\n** The Bear (FX on Hulu)\n** Gen V (Prime Video)\n** The Gentlemen (Netflix)\n** Girls5eva (Netflix)\n** Loot (Apple TV+)\n** Only Murders in the Building (Hulu)\n** Palm Royale (Apple TV+)\n** Reservation Dogs (FX on Hulu)\n** Ted (Peacock)\n|-\n| valign=\"top\" width=\"50%\"|\n* 'Jeremy Allen White – The Bear as Carmen \"Carmy\" Berzatto (FX on Hulu)'\n** David Tennant – Good Omens as Crowley (Prime Video)\n** Jharrel Jerome – ''I'm a Virgo as Cootie (Prime Video)\n** Michael Sheen – Good Omens as Aziraphale (Prime Video)\n** Martin Short – Only Murders in the Building as Oliver Putnam (Hulu)\n** Rhys Darby – Our Flag Means Death as Stede Bonnet (Max)\n** Steve Martin – Only Murders in the Building as Charles-Haden Savage (Hulu)\n** Theo James – The Gentlemen as Edward \"Eddie\" Horniman (Netflix)\n| valign=\"top\" width=\"50%\"|\n* 'Jean Smart – Hacks as Deborah Vance (Max)'\n** Ayo Edebiri – The Bear as Sydney Adamu (FX on Hulu)\n** Devery Jacobs – Reservation Dogs as Edward \"Eddie\" Horniman (FX on Hulu)\n** Kaley Cuoco – Based on a True Story as Ava Bartlett (Peacock)\n** Kristen Wiig – Palm Royale as Maxine Dellacorte-Simmons (Apple TV+)\n** Maya Rudolph – Loot as Molly Wells (Apple TV+)\n** Renée Elise Goldsberry – Girls5eva as Wickie (Netflix)\n** Selena Gomez – Only Murders in the Building as Mabel Mora (Hulu)\n|-\n| valign=\"top\" width=\"50%\"|\n* 'Ebon Moss-Bachrach – The Bear as Richard \"Richie\" Jerimovich (FX on Hulu)'\n** Carl Clemons-Hopkins – Hacks as Marcus (Max)\n** Giancarlo Esposito – The Gentlemen as Stanley Johnston (Netflix)\n** Matty Matheson – The Bear as Neil Fak (FX on Hulu)\n** Oliver Platt – The Bear as Jimmy \"Cicero\" Kalinowski (FX on Hulu)\n** Paul Rudd – Only Murders in the Building as Ben Glenroy (Hulu)\n** Paul W. Downs – Hacks as Jimmy LuSaque Jr. (Max)\n** Ricky Martin – Palm Royale as Robert Diaz (Apple TV+)\n| valign=\"top\" width=\"50%\"|\n* 'Hannah Einbinder – Hacks as Ava Daniels (Max)'\n** Abby Elliott – The Bear as Natalie \"Sugar\" Berzatto (FX on Hulu)\n** Alanna Ubach – Ted as Susan Bennett (Peacock)\n** Allison Janney – Palm Royale as Evelyn Rollins (Apple TV+)\n** Laura Dern – Palm Royale as Linda Shaw / Penelope Rollins (Apple TV+)\n** Liza Colón-Zayas – The Bear as Tina Marrero (FX on Hulu)\n** Meg Stalter – Hacks as Kayla Schaefer (Max)\n** Meryl Streep – Only Murders in the Building as Loretta Durkin (Hulu)\n|-\n| valign=\"top\" width=\"50%\"|\n* 'Jon Bernthal – The Bear as Michael \"Mikey\" Berzatto (FX on Hulu)'\n** Bob Odenkirk – The Bear as \"Uncle\" Lee Lane (FX on Hulu)\n** Bradley Cooper – Abbott Elementary as Himself (ABC)\n** Christopher Lloyd – Hacks as Kayla Schaefer (Max)\n** Christopher McDonald – Hacks as Marty Ghilain (Max)\n** Lamorne Morris – Ghosts as Saul (CBS)\n** Matthew Broderick – Only Murders in the Building as Himself (Hulu)\n** Mel Brooks – Only Murders in the Building as Himself (Hulu)\n** Sean Hayes – Curb Your Enthusiasm as Christopher Mantle (HBO)\n** Steve Buscemi – Curb Your Enthusiasm as Mike DiCarlo (HBO)\n| valign=\"top\" width=\"50%\"|\n* 'Jamie Lee Curtis – The Bear as Donna Berzatto (FX on Hulu)'\n** Allison Janney – Curb Your Enthusiasm as Cynthia (HBO)\n** Christina Hendricks – Hacks'' as Gay Republican (Max)\n** Da'Vine Joy Randolph – Only Murders in the Building as Detective Donna Williams (Hulu)\n** Jane Lynch – Only Murders in the Building as Sazz Pataki (Hulu)\n** Kaitlin Olson – Hacks as DJ Vance (Max)\n** Olivia Colman – The Bear as Chef Andrea Terry (FX on Hulu)\n** Sarah Paulson – The Bear as Michelle Berzatto (FX on Hulu)\n** Tatyana Ali – Abbott Elementary as Krystal (ABC)\n** Vanessa Bayer – What We Do in the Shadows as Evie Russell (FX)\n|-\n| valign=\"top\" width=\"50%\"|\n* 'The Bear – Christopher Storer: \"Fishes\" (FX on Hulu)'\n** Gen V – Steve Boyum: \"The Whole Truth\" (Prime Video)\n** The Gentlemen – Guy Ritchie: \"Refined Aggression\" (Netflix)\n** Hacks – Lucia Aniello: \"Bulletproof\" (Max)\n** Only Murders in the Building – John Hoffman: \"The Show Must...\" (Hulu)\n** Palm Royale – Tate Taylor: \"Maxine Goes to Palm Beach\" (Apple TV+)\n** Reservation Dogs – Sterlin Harjo: \"Dig\" (FX on Hulu)\n** Ted – Seth MacFarlane: \"Just Say Yes\" (Peacock)\n| valign=\"top\" width=\"50%\"|\n* 'Hacks – Lucia Aniello, Paul W. Downs, and Jen Statsky: \"Bulletproof\" (Max)'\n** The Bear – Joanna Calo and Christopher Storer: \"Fishes\" (FX on Hulu)\n** Gen V – Craig Rosenberg, Evan Goldberg, and Eric Kripke: \"God U.\" (Prime Video)\n** Girls5eva – Sam Means and Meredith Scardino: \"Orlando\" (Netflix)\n** Only Murders in the Building – John Hoffman and Ben Smith: \"Opening Night\" (Hulu)\n** Palm Royale – Abe Sylvia: \"Maxine Goes to Palm Beach\" (Apple TV+)\n** Reservation Dogs – Chad Charlie and Sterlin Harjo: \"Dig\" (FX on Hulu)\n** Ted – Seth MacFarlane: \"Just Say Yes\" (Peacock)\n|}\nBroadcast Network/Cable Drama Series\n{| class=\"wikitable\"\n| valign=\"top\" width=\"50%\"|\n* 'Will Trent (ABC)'\n** 9-1-1 (ABC)\n** The Cleaning Lady (Fox)\n** Elsbeth (CBS)\n** The Equalizer (CBS)\n** The Good Doctor (ABC)\n** ''Grey's Anatomy (ABC)\n** Law & Order: Special Victims Unit (NBC)\n| valign=\"top\" width=\"50%\"|\n* 'Outlander (Starz)'\n** Billions (Showtime)\n** Chucky (Syfy)\n** The Curse (Showtime)\n** The Gilded Age (HBO)\n** Winning Time: The Rise of the Lakers Dynasty (HBO)\n|-\n| valign=\"top\" width=\"50%\"|\n* 'Ramón Rodríguez – Will Trent as Will Trent (ABC)'\n** Christopher Meloni – Law & Order: Organized Crime as Detective Elliot Stabler (NBC)\n** Freddie Highmore – The Good Doctor as Dr. Shaun Murphy (ABC)\n** Morgan Spector – The Gilded Age as George Russell (HBO)\n** Paul Giamatti – Billions as Chuck Rhoades (Showtime)\n** Sam Heughan – Outlander as Jamie Fraser (Starz)\n** Shemar Moore – S.W.A.T. as Daniel Harrelson (CBS)\n** Tom Selleck – Blue Bloods as Commissioner Frank Reagan (CBS)\n| valign=\"top\" width=\"50%\"|\n* 'Mariska Hargitay – Law & Order: Special Victims Unit as Detective Olivia Benson (NBC)'\n** Angela Bassett – 9-1-1 as Athena Grant (ABC)\n** Caitríona Balfe – Outlander as Claire Fraser (Starz)\n** Carrie Coon – The Gilded Age as Bertha Russell (HBO)\n** Carrie Preston – Elsbeth as Elsbeth Tascioni (CBS)\n** Emma Stone – The Curse as Whitney Siegel (Showtime)\n** Erika Christensen – Will Trent as Angela Polaski (ABC)\n** Queen Latifah – The Equalizer as Robyn McCall / The Equalizer (CBS)\n|-\n| valign=\"top\" width=\"50%\"|\n* 'Ernie Hudson – Quantum Leap as Herbert \"Magic\" Williams (NBC)'\n** Benny Safdie – The Curse as Dougie Schecter (Showtime)\n** Jake McLaughlin – Will Trent as Michael Ormewood (ABC)\n** Jason Clarke – Winning Time: The Rise of the Lakers Dynasty as Jerry West (HBO)\n** Jason Segel – Winning Time: The Rise of the Lakers Dynasty as Paul Westhead (HBO)\n** Jeremy Sisto – FBI as Jubal Valentine (CBS)\n** Nathan Lane – The Gilded Age as Ward McAllister (HBO)\n** Wendell Pierce – Elsbeth as C.W. Wagner (CBS)\n| valign=\"top\" width=\"50%\"|\n* 'Christine Baranski – The Gilded Age as Agnes van Rhijn (HBO)'\n** Audra McDonald – The Gilded Age as Dorothy Scott (HBO)\n** Carra Patterson – Elsbeth as Kaya Blanke (CBS)\n** Jennifer Love Hewitt – 9-1-1 as Maddie Han (ABC)\n** Kate del Castillo – The Cleaning Lady as Ramona Sanchez (Fox)\n** Lesley-Ann Brandt – The Walking Dead: The Ones Who Live as Pearl Thorne (AMC)\n** Sonja Sohn – Will Trent as Amanda Wagner (ABC)\n** Sophie Skelton – Outlander as Brianna MacKenzie (Starz)\n|-\n| valign=\"top\" width=\"50%\"|\n* 'Law & Order: Special Victims Unit – Mariska Hargitay: \"Children of Wolves\" (NBC)'\n** Chucky'' – John Hyams: \"Jennifer's Body\" (Syfy)\n** The Cleaning Lady – Timothy Busfield: \"Velorio\" (Fox)\n** The Curse – Nathan Fielder: \"Green Queen\" (Showtime)\n** Elsbeth – Rosemary Rodriguez: \"Love Knocked Off\" (CBS)\n** The Gilded Age – Michael Engler: \"In Terms of Winning and Losing\" (HBO)\n** Outlander – Joss Agnew: \"A Practical Guide for Time-Travelers\" (Starz)\n** Will Trent – Howard Deutch: \"Me Llamo Will Trent\" (ABC)\n| valign=\"top\" width=\"50%\"|\n* 'The Cleaning Lady – Miranda Kwok: \"Arman\" (Fox)'\n** Chucky – Alex Delyle, Rachael Paradis, Catherine Schetina, and Amanda Blanchard: \"Jennifer's Body\" (Syfy)\n** The Curse – Nathan Fielder and Benny Safdie: \"Land of Enchantment\" (Showtime)\n** Elsbeth – Jonathan Tolins: \"A Fitting Finale\" (CBS)\n** Found – Sonay Hoffman: \"Missing While Homeless\" (NBC)\n** The Gilded Age – Julian Fellowes: \"In Terms of Winning and Losing\" (HBO)\n** Law & Order: Special Victims Unit – David Graziano and Julie Martin: \"Combat Fatigue\" (NBC)\n** Winning Time: The Rise of the Lakers Dynasty – Max Borenstein and Rodney Barnes: \"One Ring Don't Make a Dynasty\" (HBO)\n|}\nStreaming Drama Series\n{| class=\"wikitable\"\n|+\n| colspan=\"2\"|\n* 'Shōgun (FX on Hulu)'\n** 3 Body Problem (Netflix)\n** Ahsoka (Disney+)\n** The Crown (Netflix)\n** Fallout (Prime Video)\n** Loki (Disney+)\n** Monarch: Legacy of Monsters (Apple TV+)\n** The Morning Show (Apple TV+)\n** Mr. & Mrs. Smith (Prime Video)\n** Silo (Apple TV+)\n|-\n| valign=\"top\" width=\"50%\"|\n* 'Hiroyuki Sanada – Shōgun as Lord Yoshii Toranaga (FX on Hulu)'\n** Colin Farrell – Sugar as John Sugar (Apple TV+)\n** Cosmo Jarvis – Shōgun as John Blackthorne / Anjin (FX on Hulu)\n** Donald Glover – Mr. & Mrs. Smith as John Smith / Michael (Prime Video)\n** Gary Oldman – Slow Horses as Jackson Lamb (Apple TV+)\n** Kurt Russell – Monarch: Legacy of Monsters as Lee Shaw (Apple TV+)\n** Tom Hiddleston – Loki as Loki (Disney+)\n** Walton Goggins – Fallout as the Ghoul / Cooper Howard (Prime Video)\n| valign=\"top\" width=\"50%\"|\n* 'Anna Sawai – Shōgun as Toda Mariko (FX on Hulu)'\n** Ella Purnell – Fallout as Lucy MacLean (Prime Video)\n** Imelda Staunton – The Crown as Queen Elizabeth II (Netflix)\n** Jennifer Aniston – The Morning Show as Alex Levy (Apple TV+)\n** Maya Erskine – Mr. & Mrs. Smith as Jane Smith / Alana (Prime Video)\n** Rebecca Ferguson – Silo as Juliette Nichols (Apple TV+)\n** Reese Witherspoon – The Morning Show as Bradley Jackson (Apple TV+)\n** Rosario Dawson – Ahsoka as Ahsoka Tano (Disney+)\n|-\n| valign=\"top\" width=\"50%\"|\n* 'Billy Crudup – The Morning Show as Cory Ellison (Apple TV+)'\n** Benedict Wong – 3 Body Problem as Clarence \"Da\" Shi (Netflix)\n** Jon Hamm – The Morning Show as Paul Marks (Apple TV+)\n** Jonathan Pryce – The Crown as Prince Philip (Netflix)\n** Ke Huy Quan – Loki as OB (Disney+)\n** Mark Duplass – The Morning Show as Chip Black (Apple TV+)\n** Owen Wilson – Loki as Mobius (Disney+)\n** Wyatt Russell – Monarch: Legacy of Monsters as Young Lee Shaw (Apple TV+)\n| valign=\"top\" width=\"50%\"|\n* 'Greta Lee – The Morning Show as Stella Bak (Apple TV+)'\n** Amy Ryan – Sugar as Melanie Matthews (Apple TV+)\n** Elizabeth Debicki – The Crown as Princess Diana (Netflix)\n** Eiza González – 3 Body Problem as Augustina \"Auggie\" Salazar (Netflix)\n** Gugu Mbatha-Raw – Loki as Ravonna Renslayer (Disney+)\n** Holland Taylor – The Morning Show as Cybil Reynolds (Apple TV+)\n** Mary Elizabeth Winstead – Ahsoka as Hera Syndulla (Disney+)\n** Nicole Beharie – The Morning Show as Christine Hunter (Apple TV+)\n|-\n| valign=\"top\" width=\"50%\"|\n* 'Kyle MacLachlan – Fallout as Henry \"Hank\" MacLean (Prime Video)'\n** Corbin Bernsen – The Curse as Paul (Showtime)\n** John Goodman – Monarch: Legacy of Monsters as Bill Randa (Apple TV+)\n** John Ortiz – Will Trent as Antonio Miranda (ABC)\n** Mark-Paul Gosselaar – Found as Hugh \"Sir\" Evans (NBC)\n** Michael Braugher – The Gilded Age as Booker T. Washington (HBO)\n** Paul Dano – Mr. & Mrs. Smith as Harris Materbach (Prime Video)\n** Ron Perlman – Mr. & Mrs. Smith as Toby Hellinger (Prime Video)\n** Sam Waterston – Law & Order as Jack McCoy (NBC)\n** Wagner Moura – Mr. & Mrs. Smith as Second Other John (Prime Video)\n| valign=\"top\" width=\"50%\"|\n* 'Michaela Coel – Mr. & Mrs. Smith as Bev (Prime Video)'\n** Claire Foy – The Crown as Young Queen Elizabeth II (Netflix)\n** Glenn Close – The New Look as Carmel Snow (Apple TV+)\n** LisaGay Hamilton – Winning Time: The Rise of the Lakers Dynasty as Christine Johnson (HBO)\n** Parker Posey – Mr. & Mrs. Smith as Second Other Jane (Prime Video)\n** Rashida Jones – Silo as Allison Becker (Apple TV+)\n** Retta – Elsbeth as Margo Clarke (CBS)\n** Sarah Paulson – Mr. & Mrs. Smith as Therapist (Prime Video)\n** Susan Kelechi Watson – Will Trent as Cricket Dawson (ABC)\n** Yuko Miyamoto – Shōgun as Gin (FX on Hulu)\n|-\n| valign=\"top\" width=\"50%\"|\n* 'Mr. & Mrs. Smith – Hiro Murai: \"First Date\" (Prime Video)'\n** 3 Body Problem – Derek Tsang: \"Countdown\" (Netflix)\n** Ahsoka – Dave Filoni: \"Part Five: Shadow Warrior\" (Disney+)\n** Fallout – Jonathan Nolan: \"The End\" (Prime Video)\n** Loki – Justin Benson and Aaron Moorhead: \"Science/Fiction\" (Disney+)\n** The Morning Show – Mimi Leder: \"The Overview Effect\" (Apple TV+)\n** Shōgun – Jonathan van Tulleken: \"Chapter One: Anjin\" (FX on Hulu)\n** Sugar – Fernando Meirelles: \"Olivia\" (Apple TV+)\n| valign=\"top\" width=\"50%\"|\n* 'Mr. & Mrs. Smith – Francesca Sloane and Donald Glover: \"First Date\" (Prime Video)'\n** 3 Body Problem – David Benioff, D. B. Weiss, and Alexander Woo: \"Countdown\" (Netflix)\n** The Crown – Peter Morgan: \"Sleep, Dearie Sleep\" (Netflix)\n** Fallout – Graham Wagner and Geneva Robertson-Dworet: \"The End\" (Prime Video)\n** Loki – Eric Martin: \"Glorious Purpose\" (Disney+)\n** The Morning Show – Charlotte Stoudt and Anya Leta: \"The Overview Effect\" (Apple TV+)\n** Shōgun – Rachel Kondo and Justin Marks: \"Chapter One: Anjin\" (FX on Hulu)\n** Silo – Jeffery Wang and Ingrid Escajeda: \"Hanna\" (Apple TV+)\n|}\nLimited Series or TV Movie\n{| class=\"wikitable\"\n|+\n| valign=\"top\" width=\"50%\"|\n* 'Baby Reindeer (Netflix)'\n** Apples Never Fall (Peacock)\n** Black Mirror (Netflix)\n** The Fall of the House of Usher (Netflix)\n** Fargo (FX)\n** Fellow Travelers (Showtime)\n** Lessons in Chemistry (Apple TV+)\n** Ripley (Netflix)\n** True Detective: Night Country (HBO)\n** We Were the Lucky Ones (Hulu)\n| valign=\"top\" width=\"50%\"|\n* 'Red, White & Royal Blue (Prime Video)'\n** First Time Female Director (Roku)\n** ''Mr. Monk's Last Case: A Monk Movie (Peacock)\n** Música (Prime Video)\n** No One Will Save You (Hulu)\n** Quiz Lady (Hulu)\n** Totally Killer (Prime Video)\n** Turtles All The Way Down (Max)\n|-\n| valign=\"top\" width=\"50%\"|\n* 'Andrew Scott – Ripley as Tom Ripley (Netflix)'\n** Bruce Greenwood – The Fall of the House of Usher as Roderick Usher (Netflix)\n** David Oyelowo – Lawmen: Bass Reeves as Bass Reeves (Paramount+)\n** Ewan McGregor – A Gentleman in Moscow as Count Alexander Ilyich Rostov (Paramount+)\n** Jon Hamm – Fargo as Sheriff Roy Tillman (FX)\n** Matt Bomer – Fellow Travelers as Hawkins \"Hawk\" Fuller (Showtime)\n** Mark Hamill – The Fall of the House of Usher as Arthur Pym (Netflix)\n** Nicholas Galitzine – Red, White & Royal Blue as Prince Henry (Prime Video)\n** Richard Gadd – Baby Reindeer as Donny Dunn (Netflix)\n** Tony Shalhoub – Mr. Monk's Last Case: A Monk Movie as Adrian Monk (Peacock)\n| valign=\"top\" width=\"50%\"|\n* 'Brie Larson – Lessons in Chemistry as Elizabeth Zott (Apple TV+)'\n** Alaqua Cox – Echo as Maya Lopez / Echo (Disney+)\n** Annette Bening – Apples Never Fall as Joy Delaney (Peacock)\n** Awkwafina – Quiz Lady as Anne Yum (Hulu)\n** Carla Gugino – The Fall of the House of Usher as Verna (Netflix)\n** Jodie Foster – True Detective: Night Country as Chief Liz Danvers (HBO)\n** Joey King – We Were the Lucky Ones as Halina Kurc (Hulu)\n** Juno Temple – Fargo as Dot Lyon / Nadine Tillman (FX)\n** Kaitlyn Dever – No One Will Save You as Brynn (Hulu)\n** Sandra Oh – Quiz Lady as Jenny Yum (Hulu)\n|-\n| valign=\"top\" width=\"50%\"|\n* 'Jonathan Bailey – Fellow Travelers as Tim Laughlin (Showtime)'\n** Christopher Eccleston – True Detective: Night Country as Captain Ted Connelly (HBO)\n** Finn Bennett – True Detective: Night Country as Officer Peter Prior (HBO)\n** Jason Schwartzman – Quiz Lady as Ron Heacock (Hulu)\n** Joe Keery – Fargo as Gator Tillman (FX)\n** John Cena – Ricky Stanicky as Ricky Stanicky / Rod Rimestead (Prime Video)\n** Lewis Pullman – Lessons in Chemistry as Calvin Evans (Apple TV+)\n** Mark Ruffalo – All the Light We Cannot See as Daniel LeBlanc (Netflix)\n** Robert Downey Jr. – The Sympathizer as Various Characters (HBO)\n** Tom Goodman-Hill – Baby Reindeer'' as Darrien O'Connor (Netflix)\n| valign=\"top\" width=\"50%\"|\n* 'Lily Gladstone – Under the Bridge as Cam Bentland (Hulu)'\n** Aja Naomi King – Lessons in Chemistry as Harriet Sloane (Apple TV+)\n** Alison Brie – Apples Never Fall as Amy Delaney (Peacock)\n** Dakota Fanning – Ripley as Marge Sherwood (Netflix)\n** Jessica Gunning – Baby Reindeer as Martha Scott (Netflix)\n** Kali Reis – True Detective: Night Country as Trooper Evangeline Navarro (HBO)\n** Mary Elizabeth Winstead – A Gentleman in Moscow as Anna Urbanova (Paramount+)\n** Mary McDonnell – The Fall of the House of Usher as Madeline Usher (Netflix)\n** Nava Mau – Baby Reindeer as Teri (Netflix)\n** Riley Keough – Under the Bridge as Rebecca Godfrey (Hulu)\n|-\n| valign=\"top\" width=\"50%\"|\n* 'The Fall of the House of Usher – Mike Flanagan: \"The Tell-Tale Heart\" (Netflix)'\n** Baby Reindeer – Weronika Tofilska: \"Episode 1\" (Netflix)\n** Black Mirror – Ally Pankiw: \"Joan Is Awful\" (Netflix)\n** Fargo – Noah Hawley: \"The Tragedy of the Commons\" (FX)\n** Lessons in Chemistry – Sarah Adina Smith: \"Her and Him\" (Apple TV+)\n** No One Will Save You – Brian Duffield (Hulu)\n** Quiz Lady – Jessica Yu (Hulu)\n** Ripley – Steven Zaillian (Netflix)\n** Red, White & Royal Blue – Matthew López (Prime Video)\n** True Detective: Night Country – Issa López (HBO)\n| valign=\"top\" width=\"50%\"|\n* 'Baby Reindeer – Richard Gadd (Netflix)'\n** The Fall of the House of Usher – Mike Flanagan and Kiele Sanchez: \"The Raven\" (Netflix)\n** Fargo – Noah Hawley: \"The Tragedy of the Commons\" (FX)\n** Fellow Travelers – Ron Nyswaner: \"You're Wonderful\" (Showtime)\n** First Time Female Director – Chelsea Peretti (Roku)\n** Lessons in Chemistry – Lee Eisenberg: \"Little Miss Hastings\" (Apple TV+)\n** ''Mr. Monk's Last Case: A Monk Movie – Andy Breckman (Peacock)\n** Quiz Lady'' – Jen D'Angelo (Hulu)\n** Red, White & Royal Blue – Matthew López and Ted Malawer (Prime Video)\n** True Detective: Night Country – Issa López (HBO)\n|}\nOther categories\n{| class=\"wikitable\"\n|+\n| valign=\"top\" width=\"50%\"|\n* 'X-Men '97 (Disney+)'\n** Big Mouth (Netflix)\n** Clone High (Max)\n** Curses! (Apple TV+)\n** Harley Quinn (Max)\n** Hazbin Hotel (Prime Video)\n** Jurassic World: Chaos Theory (Netflix)\n** Orion and the Dark (Netflix)\n** The Simpsons (Fox)\n** South Park: Joining the Panderverse (Paramount+)\n| valign=\"top\" width=\"50%\"|\n* 'Solo Leveling (Crunchyroll)'\n** Blue Eye Samurai (Netflix)\n** ''Frieren: Beyond Journey's End (Crunchyroll)\n** Ninja Kamui (Adult Swim)\n** Pluto (Netflix)\n** Scott Pilgrim Takes Off (Netflix)\n|-\n| valign=\"top\" width=\"50%\"|\n* 'Bluey (Disney Jr.)'\n** Blue's Clues & You! (Nickelodeon)\n** Gabby's Dollhouse (Netflix)\n** Percy Jackson and the Olympians (Disney+)\n** Sesame Street (PBS)\n** The Spiderwick Chronicles (Roku)\n| valign=\"top\" width=\"50%\"|\n* '''RuPaul's Drag Race (MTV)'\n** The Amazing Race (CBS)\n** American Idol (ABC)\n** The Golden Bachelor (ABC)\n** The Masked Singer (Fox)\n** So You Think You Can Dance (Fox)\n** Squid Game: The Challenge (Netflix)\n** Survivor (CBS)\n** Tournament of Champions (Food Network)\n** The Traitors (Peacock)\n** The Voice (NBC)\n|-\n| valign=\"top\" width=\"50%\"|\n* 'STEVE (Martin): A Documentary in Two Parts (Apple TV+)'\n** Albert Brooks: Defending My Life (Max)\n** In Restless Dreams: The Music of Paul Simon (MGM+)\n** Jim Henson Idea Man (Disney+)\n** Kevin Hart & Chris Rock: Headliners Only (Netflix)\n** Out of the Ring (Fuse)\n** The Greatest Night in Pop (Netflix)\n** This is Not Financial Advice (Fuse)\n| valign=\"top\" width=\"50%\"|\n* 'Quiet on Set: The Dark Side of Kids TV (ID)'\n** American Nightmare (Netflix)\n** Beckham (Netflix)\n** ''Black Twitter: A People's History (Hulu)\n** Bollywed (Fuse)\n** The Jinx: The Life and Deaths of Robert Durst (Max)\n** Thank You, Goodnight: The Bon Jovi Story (Hulu)\n** Where Is Wendy Williams? (Lifetime)\n|-\n| valign=\"top\" width=\"50%\"|\n* 'Celebrity Family Feud (ABC)'\n** The Floor (Fox)\n** Jeopardy! (ABC)\n** Password (NBC)\n** The Price Is Right at Night (CBS)\n** Wheel of Fortune (ABC)\n| valign=\"top\" width=\"50%\"|\n* '''Conan O'Brien Must Go (Max)'\n** An Oprah Special: Shame, Blame, and the Weight Loss Revolution (ABC)\n** Gordon Ramsay: Uncharted (Nat Geo)\n** How Disney Built America (History)\n** My Next Guest with David Letterman and John Mulaney (Netflix)\n** The Reluctant Traveler with Eugene Levy (Apple TV+)\n|-\n| valign=\"top\" width=\"50%\"|\n* 'Love on the Spectrum (Netflix)'\n** Below Deck Down Under (Peacock)\n** Big Freedia Means Business (Fuse)\n** Catfish: The TV Show (MTV)\n** Love Is Blind (Netflix)\n** Queer Eye (Netflix)\n** ''RuPaul's Drag Race (MTV)\n** Shark Tank (ABC)\n** Vanderpump Rules (Bravo)\n** Welcome to Wrexham (FX)\n| valign=\"top\" width=\"50%\"|\n* 'Only Murders in the Building: One Killer Question (Hulu)'\n** 3 Body Problem – Inside the Episodes (Netflix)\n** After the Cut – The Daily Show (Comedy Central)\n** Carpool Karaoke: The Series (Apple TV+)\n** The Eric Andre Show (Adult Swim)\n** Hacks: Bit by Bit (Max)\n** RuPaul's Drag Race: Fashion Photo Ruview (MTV)\n** Saturday Night Live Presents Behind the Sketch (NBC)\n|-\n| valign=\"top\" width=\"50%\"|\n* 'Hot Ones (YouTube)'\n** The Daily Show (Comedy Central)\n** Jimmy Kimmel Live! (ABC)\n** John Mulaney Presents: Everybody's in LA (Netflix)\n** The Late Show with Stephen Colbert (CBS)\n** The Tonight Show Starring Jimmy Fallon (NBC)\n| valign=\"top\" width=\"50%\"|\n* '''Dick Van Dyke's 98 Years of Magic (CBS)'\n** The 30th Annual SAG Awards (Netflix)\n** The 66th Annual Grammy Awards (CBS)\n** The 76th Annual Tony Awards (CBS)\n** The 96th Annual Academy Awards (ABC)\n** 2023 Rock and Roll Hall of Fame (ABC)\n** Gaga Chromatica Ball (Max)\n** Hannah Waddingham: Home for Christmas (Apple TV+)\n** Last Week Tonight with John Oliver (HBO)\n** Saturday Night Live (NBC)\n|-\n| valign=\"top\" width=\"50%\"|\n* Ryan Gosling (NBC)\n** Emma Stone (NBC)\n** Kate McKinnon (NBC)\n** Kristen Wiig (NBC)\n** Maya Rudolph (NBC)\n** Timothée Chalamet (NBC)\n| valign=\"top\" width=\"50%\"|\n* 'Jenny Slate: Seasoned Professional (Prime Video)'\n** Amy Schumer: Emergency Contact (Netflix)\n** Dave Chappelle: The Dreamer (Netflix)\n** Kevin Hart: Reality Check (Peacock)\n** Nikki Glaser: Someday You Die (HBO)\n** Ricky Gervais: Armageddon (Netflix)\n** Tig Notaro: Hello Again (Prime Video)\n** Trevor Noah: Where Was I (Netflix)\n|-\n| colspan=\"2\" valign=\"top\" width=\"50%\"|\n* 'Kaley Cuoco as Harley Quinn – Harley Quinn (Max)'\n** Darren Barnet as Kenji – Jurassic World: Chaos Theory (Netflix)\n** Jacob Tremblay as Orion – Orion and the Dark (Netflix)\n** Jennifer Hale as Jean Grey – ''X-Men '97 (Disney+)\n** Lenore Zann as Rogue – X-Men '97 (Disney+)\n** Matthew Waterson as Erik \"Magnus\" Lehnsherr / Magneto – X-Men '97 (Disney+)\n** Nick Kroll as Maury the Hormone Monster – Big Mouth (Netflix)\n** Paul Walter Hauser as Dark – Orion and the Dark (Netflix)\n** Seth MacFarlane as Ted – Ted (Peacock)\n** Steven Yeun as Mark Grayson / Invincible – Invincible (Prime Video)\n|}\nMost nominations\n{| class=\"wikitable\" rowspan=2 border=2 style=\"text-align:center;\"\n|+ Nominations by series\n|-\n! scope=\"col\" style=\"width:55px;\"| Nominations\n! scope=\"col\" style=\"text-align:center;\"| Series\n|-\n| style=\"text-align:center\"| 15 || The Bear\n|-\n| rowspan=\"2\" style=\"text-align:center\"| 13 || Hacks\n|-\n| Only Murders in the Building\n|-\n| rowspan=\"3\" style=\"text-align:center\"| 11 || Abbott Elementary\n|-\n| Ghosts\n|-\n| The Morning Show\n|-\n| style=\"text-align:center\"| 10 || Mr. & Mrs. Smith\n|-\n| style=\"text-align:center\"| 9 || The Gilded Age\n|-\n| rowspan=\"3\" style=\"text-align:center\"| 8 || Curb Your Enthusiasm\n|-\n| What We Do in the Shadows\n|-\n| Will Trent\n|-\n| rowspan=\"7\" style=\"text-align:center\"| 7 || Baby Reindeer\n|-\n| Elsbeth\n|-\n| The Fall of the House of Usher\n|-\n| Loki\n|-\n| Palm Royale\n|-\n| Shōgun\n|-\n| True Detective: Night Country\n|-\n| rowspan=\"7\" style=\"text-align:center\"| 6 || 3 Body Problem\n|-\n| The Crown\n|-\n| The Curse\n|-\n| Fallout\n|-\n| Fargo\n|-\n| Lessons in Chemistry\n|-\n| Quiz Lady\n|-\n| rowspan=\"3\" style=\"text-align:center\"| 5 || Outlander\n|-\n| Ted\n|-\n| Winning Time: The Rise of the Lakers Dynasty\n|-\n| rowspan=\"13\" style=\"text-align:center\"| 4 || Ahsoka\n|-\n| The Cleaning Lady\n|-\n| Fellow Travelers\n|-\n| The Gentlemen\n|-\n| Law & Order: Special Victims Unit\n|-\n| Monarch: Legacy of Monsters\n|-\n| Red, White & Royal Blue\n|-\n| Reservation Dogs\n|-\n| Resident Alien\n|-\n| Ripley\n|-\n| Silo\n|-\n| X-Men '97\n|-\n| Young Sheldon\n|-\n| rowspan=\"10\" style=\"text-align:center\"| 3 || 9-1-1\n|-\n| Apples Never Fall\n|-\n| Chucky\n|-\n| Gen V\n|-\n| Girls5eva\n|-\n| Mr. Monk's Last Case: A Monk Movie\n|-\n| The Neighborhood\n|-\n| No One Will Save You\n|-\n| Orion and the Dark\n|-\n| Sugar\n|-\n| rowspan=\"21\" style=\"text-align:center\"| 2 || Big Mouth\n|-\n| Billions\n|-\n| Black Mirror\n|-\n| The Conners\n|-\n| The Equalizer\n|-\n| First Time Female Director\n|-\n| Found\n|-\n| A Gentleman in Moscow\n|-\n| The Good Doctor\n|-\n| Good Omens\n|-\n| Harley Quinn\n|-\n| It's Always Sunny in Philadelphia\n|-\n| Jurassic World: Chaos Theory\n|-\n| Loot\n|-\n| Not Dead Yet\n|-\n| The Righteous Gemstones\n|-\n| Saturday Night Live\n|-\n| So Help Me Todd\n|-\n| Under the Bridge\n|-\n| We Were the Lucky Ones\n|-\n| The Wonder Years''\n|}\n{| class=\"wikitable\" rowspan=2 border=2 style=\"text-align:center;\"\n|+ Nominations by network/platform\n|-\n! scope=\"col\" style=\"width:55px;\"| Nominations\n! scope=\"col\" style=\"text-align:center;\"| Network/Platform\n|-\n| style=\"text-align:center\"| 66 || Netflix\n|-\n| style=\"text-align:center\"| 44 || Apple TV+\n|-\n| style=\"text-align:center\"| 41 || ABC\n|-\n| style=\"text-align:center\"| 39 || CBS\n|-\n| rowspan=\"2\" style=\"text-align:center\"| 34 || HBO\n|-\n| Prime Video\n|-\n| style=\"text-align:center\"| 28 || Hulu\n|-\n| style=\"text-align:center\"| 26 || FX on Hulu\n|-\n| style=\"text-align:center\"| 22 || Max\n|-\n| style=\"text-align:center\"| 21 || NBC\n|-\n| style=\"text-align:center\"| 18 || Disney+\n|-\n| style=\"text-align:center\"| 17 || FX\n|-\n| style=\"text-align:center\"| 15 || Peacock\n|-\n| style=\"text-align:center\"| 12 || Showtime\n|-\n| style=\"text-align:center\"| 9 || Fox\n|-\n| style=\"text-align:center\"| 7 || Syfy\n|-\n| style=\"text-align:center\"| 6 || Starz\n|-\n| rowspan=\"2\" style=\"text-align:center\"| 4 || Fuse\n|-\n| Paramount+\n|-\n| rowspan=\"2\" style=\"text-align:center\"| 3 || MTV\n|-\n| Roku\n|-\n| rowspan=\"3\" style=\"text-align:center\"| 2 || Adult Swim\n|-\n| Comedy Central\n|-\n| Crunchyroll\n|}\nSee also\n* 3rd Astra Creative Arts Awards\n* 7th Astra Midseason Movie Awards\n* 8th Astra Film Awards\nReferences\nExternal links\n*"
    }
  ]
}