{
  "content": [
    {
      "type": "text",
      "text": "# 504th Expeditionary Air Support Operations Group\n\n|branch=\n|type=\n|role= Forward Air Control and Air Support Operations\n|size=\n|command_structure= United States Air Forces Central\n|garrison=\n|ceremonial_chief=\n|colonel_of_the_regiment=\n|nickname=\n|patron=\n|motto=\n|colors=\n|march=\n|mascot=\n|battles=\n|notable_commanders=Andrew P. Iosue\n|anniversaries=\n|decorations=Presidential Unit CitationRepublic of Vietnam Gallantry Cross with Palm Air Force Meritorious Unit Award\n|identification_symbol=\n|identification_symbol_label=504th Expeditionary Air Support Operations Group emblem (approved 19 July 1967)\n|identification_symbol_2=\n|identification_symbol_2_label=\n}}\nThe 504th Expeditionary Air Support Operations Group is an inactive United States Air Force unit. It was first activated as the 504th Tactical Air Support Group in 1966 for service during the Vietnam War, and was reactivated in 2009 for service in Afghanistan. It was inactivated on 12 May 2016.\nIn Vietnam the group provided combat ready aircraft and crews in support of air and ground operations in Southeast Asia. It directed ground strikes, conducted visual reconnaissance and convoy escort.  It also trained Air Liaison Officers and Forward Air Controllers. The group was thrice awarded the Presidential Unit Citation for its actions during the war.  It was inactivated in 1972 when the Vietnamese Air Force assumed its remaining mission.\nOn reactivation in 2009 it began to provide air support, air liaison, and weather support for ground operations until it was inactivated on 12 May 2016.\nHistory\nVietnam War\nActivation and initial training\nThe expansion of the U.S. presence in Southeast Asia and the use of airborne forward air controllers (FAC), rather than controllers on the ground, during 1965 and 1966 was accompanied by an increase from the single tactical air support squadron in theater at the beginning of 1965. In 1966, the new squadrons were assigned directly to the 505th Tactical Control Group, which also controlled the three radar squadrons in theater.  By September 1966, they were attached to the Tactical Air Support Group, Provisional, 6253d.  The 504th Tactical Air Support Group was organized at Bien Hoa Air Base, Vietnam in December 1966 to replace the 6253d as the headquarters for five tactical air support squadrons stationed throughout South Vietnam and in Thailand.  In addition, two maintenance squadrons were transferred to provide for the group's fleet of Cessna O-1 Bird Dogs.  Each maintenance squadron provided a central location for two of the group's squadrons in the Republic of Vietnam.\nHowever, the Air Force was unable to provide sufficient trained FACs to meet the demands of the war and the group did not exceed 70% of its manning requirements in this area until 1969. Detachment 1 of the group was established at Binh Thuy Air Base to operate the Theater Indoctrination School. In addition to preparing newly arrived pilots for their tours, the school also trained fighter pilots as FACs until 1968 in a program designed to help relieve the shortage of qualified FACS for operations.\nMore capable aircraft\nIn 1967, the group began to receive its first Cessna O-2 Skymasters. With two engines, the Skymaster was more capable than the Bird Dog, whose slow speed and lack of armor made it \"fair game\" for enemy gunners. Moreover, its limited power and navigational systems limited its use in mountainous areas and foul weather. The O-2 was conceived as an interim replacement for the O-1 until North American Rockwell OV-10 Broncos became available.  However, the demand for 504th FACs continued to grow and the O-2s augmented, rather than replaced the group's Bird Dogs. The 20th Attack Squadron at Da Nang Air Base was the first of the group's units to fly the Skymaster.\nInitially, O-2 pilots received only ground training before deploying to the theater, and the 504th conducted their flying training during theater indoctrination.  However, the separation of ground and flying training for O-2 pilots proved to be problematical and, starting in March 1968, Tactical Air Command conducted both ground and flight training for them in Florida. After this program and the fighter pilot training program were discontinued, theater training was transferred to the group's operational squadrons and the school and Detachment 1 were discontinued in 1969.\nThe final aircraft in the group's inventory, the OV-10 Bronco, began to arrive in 1968. Between July and October, a test and evaluation team, called Project Combat Bronco was attached to the 504th's 19th Tactical Air Support Squadron at Phan Rang Air Base to evaluate the plane's combat capability.  The group began accepting these planes as soon as the evaluation was completed. By 1971, the group was able to retire its last O-1s.\nOperations\nAlthough controlling airstrikes was a large part of the FAC mission, group aircraft performed visual reconnaissance to detect enemy movements.  South Vietnam was divided into sectors, with one or two FACs assigned to each.   About 65% of the sectors were covered each day.  Because Viet Cong forces typically moved during hours of darkness, most sorties were flown at dawn or dusk. The group's comprehensive visual reconnaissance program resulted in Viet Cong forces essentially halting daytime movement in areas visible from the air.  The group also performed some limited photographic reconnaissance, using hand-held cameras It also performed bomb damage assessment immediately following strikes its FACs controlled.\nAs enemy rocket attacks on fixed bases became more frequent, the group began night operations near Saigon and Da Nang with O-1s and O-2s to \"weed out\" enemy rocket firing positions starting in February 1968.  After June, the operation around Saigon expanded, with Army helicopter gunships assuming responsibility for two of the four sectors around the capital.  Diversion of FAC aircraft to this mission was, however, at the expense of the daylight visual reconnaissance program.\nStarting in the summer of 1969, some group OV-10s began to be armed, carrying out strikes while on visual reconnaissance missions.  Although there was concern that arming FACs would divert them from their primary mission by \"playing fighter pilot,\" strikes by FACs against fleeting targets substantially reduced the response time required to call fighters or gunships to the area.  This program was concentrated in Vietnam, although it was expanded to include support for special forces teams operating in Cambodia and Laos.\nWhen Army observers were not available, the unit performed artillery adjustment. The group provided also conducted convoy escort.\nVietnamization\nVietnamization of FAC operations began in 1969, but proceeded slowly.  In May 1971. US FACs ended operations in support of the Vietnamese Army and turned the mission over to the Vietnamese Air Force (VNAF).  By March 1972, VNAF controllers were directing 90% of airstrikes in South Vietnam.  This permitted the 504th's 19th and 22nd Attack Squadrons to transfer to bases in Hawaii and Korea by January 1972.  On 15 March, the group was inactivated and its remaining squadrons were reassigned.\nSummary\nDuring the Vietnam War, the group controlled personnel at over 70 different locations.  Between 1967 and 1969, group pilots accounted for more than one third of all combat hours flown by Seventh Air Force.  It flew 850,000 hours and supported 400 aircraft.\nAfghanistan\nThe group was again activated in late March 2009 as the 504th Expeditionary Air Support Operations Group. From 2009 in Afghanistan the three squadrons of the group performed separate roles. Its 717th Expeditionary Air Support Operations Squadron coordinated with NATO's International Security Assistance Force and U.S. Forces-Afghanistan to provide air support throughout the region. The 817th Expeditionary Air Support Operations Squadron primarily embedded tactical air control parties with Army units.\nThe group's weather squadron created weather forecasts for the Army. Although headquartered at Bagram Air Base, the squadron maintained weather teams at 15 forward operating bases throughout Afghanistan.  Often the sensors at these remote locations were \"outside the wire\", sometimes in locations more than 100 miles from the weather team.\nAs American involvement in Afghanistan was reduced, only the 817th Squadron remained of the group's units by the spring of 2016 and the group was inactivated and its remaining personnel and equipment transferred to the 817th.\nLineage\n* Established as the 504th Tactical Air Support Group and activated on 5 December 1966 (not organized)\n: Organized on 8 December 1966\n: Inactivated on 15 March 1972\n* Redesignated 504th Expeditionary Air Support Operations Group and converted to provisional status on 12 February 2009\n:: Activated c. 30 March 2009\n:: Inactivated on 12 May 2016\nAssignments\n* Pacific Air Forces, 5 December 1966 (not organized)\n* Seventh Air Force, 8 December 1966 – 15 March 1972\n* Air Combat Command 12 February 2009 to activate or inactivate as needed\n:: Ninth Air Force c. 30 March 2009 – 12 May 2016\nComponents\n* 19th Expeditionary Weather Squadron, unknown – 2014\n* 19th Tactical Air Support Squadron, 8 December 1966 – 15 January 1972\n:: Phan Rang Air Base, Vietnam\n* 20th Tactical Air Support Squadron, 8 December 1966 – 15 March 1972\n:: Da Nang Air Base, Vietnam\n* Air Education and Training Command Studies and Analysis Squadron, 8 December 1966 – 15 March 1972\n:: Pleiku Air Base, Vietnam after September 1971, Tan Son Nhut Air Base, Vietnam after January 1972\n* 22d Tactical Air Support Squadron, 8 December 1966 – 15 May 1971\n:: Binh Thuy Air Base until January 1970, Bien Hoa Air Base, Vietnam\n* 23rd Flying Training Squadron, 8 December 1966 – 15 March 1972\n:: Nakhon Phanom Royal Thai Air Force Base, Thailand\n* 505th Tactical Control Maintenance Squadron, 8 December 1966 – 15 March 1972\n:: Tan Son Nhut Air Base, Vietnam\n* 506th Tactical Control Maintenance Squadron, 8 December 1966 – 15 March 1972\n:: Udorn Royal Thai Air Force Base, Thailand\n* 717th Expeditionary Air Support Operations Squadron, c. 30 March 2009 – 12 May 2015\n:: Kabul International Airport, Afghanistan\n* 817th Expeditionary Air Support Operations Squadron, c. 30 March 2009 – 12 May 2016\n* 917th Expeditionary Weather Squadron, c. 30 March 2009 – unknown\nStations\n* Bien Hoa Air Base, Vietnam, 8 December 1966\n* Cam Ranh Bay Air Base, Vietnam, 30 April 1970\n* Phan Rang Air Base, Vietnam, 1 October 1971 – 15 January 1972\n* Bagram Air Base, Afghanistan, c. 30 March 2009 – 30 March 2010\n* Kabul International Airport, Afghanistan, 1 April 2010 – 12 May 2016\nAircraft\n* Cessna O-1 Bird Dog, 1966–1971\n* Cessna O-2 Skymaster, 1967–1972\n* North American Rockwell OV-10 Bronco, 1968–1972\nAwards and campaigns\n{| class=\"wikitable\"\n|- style=\"background:#efefef;\"\n! Campaign Streamer\n! Campaign\n! Dates\n! Notes\n|-\n|200px||Vietnam Air Offensive||8 December 1966 – 8 March 1967||504th Tactical Air Support Group\n|-\n|200px||Vietnam Air Offensive, Phase II||9 March 1967 – 31 March 1968||504th Tactical Air Support Group\n|-\n|200px||Vietnam Air/Ground||22 January 1968 – 7 July 1968||504th Tactical Air Support Group\n|-\n|200px||Vietnam Air Offensive, Phase III||1 April 1968 – 31 October 1968||504th Tactical Air Support Group\n|-\n|200px||Vietnam Air Offensive, Phase IV||1 November 1968 – 22 February 1969||504th Tactical Air Support Group\n|-\n|200px||Tet 1969/Counteroffensive||23 February 1969 – 8 June 1969||504th Tactical Air Support Group\n|-\n|200px||Vietnam Summer-Fall 1969||9 June 1969 – 31 October 1969||504th Tactical Air Support Group\n|-\n|200px||Vietnam Winter-Spring 1970||3 November 1969 – 30 April 1970||504th Tactical Air Support Group\n|-\n|200px||Sanctuary Counteroffensive||1 May 1970 – 30 June 1970||504th Tactical Air Support Group\n|-\n|200px||Southwest Monsoon||1 July 1970 – 30 November 1970||504th Tactical Air Support Group\n|-\n|200px||Commando Hunt V||1 December 1970 – 14 May 1971||504th Tactical Air Support Group\n|-\n|200px||Commando Hunt VI||15 May 1971 – 31 July 1971||504th Tactical Air Support Group\n|-\n|200px||Commando Hunt VII||1 November 1971 – 15 March 1972||504th Tactical Air Support Group\n|-\n|||Consolidation II||1 November 2006 – 30 November 2006||504th Expeditionary Air Support Operations Group\n|}\nReferences\n; Notes\n; Citations\nBibliography\n*\n*\nExternal links\n*\n*\n*\n*  (YouTube Video version)\n* [https://www.afcent.af.mil/Units/455th-Air-Expeditionary-Wing/ 455 AEW's Bagram Airfield Official Site]"
    }
  ]
}