{
  "content": [
    {
      "type": "text",
      "text": "# 50ft Queenie\n\n}}\n}}\n\"50ft Queenie\" is a song by English singer-songwriter PJ Harvey, and the first single from her second studio album, Rid of Me (1993). It is performed by Harvey's trio, consisting of Harvey on vocals and guitar, Rob Ellis on drums and Steve Vaughan on bass. Released in April 1993 by Island Records, the song charted in the United Kingdom and was a top-30 hit, but failed to chart in the United States. A promotional music video directed by Maria Mochnacz was also filmed.\nBackground and history\nThe song was recorded at Pachyderm Studios with Steve Albini, who had previously produced albums for Pixies and The Breeders. Harvey praised Albini's work because she thought \"the instruments on the album sound like they're breathing and real\".\nMusic video\nDirected by British photographer and music video director Maria Mochnacz, the accompanying music video for \"50ft Queenie\" shows PJ Harvey performing the song, with the small leopard skin coat as seen in the single's inlay artwork. The backdrop of the video reads \"HEY I'M ONE BIG QUEEN\". It was released on 19 April 1993 and was shot in a barn in Bristol. The video was later used on Beavis and Butt-Head.\nCritical reception\nUpon its release as a single, Gina Morris of NME picked \"50ft Queenie\" as one of the magazine's \"single[s] of the week\" and described it as \"another startling, emphatic slab of potent punk rock, delivered in a flurry of intensity\" and one which \"again highlights Polly's ability to manoeuvre her voice to sound spent, torn and bleeding in emotive tension\". Morris added that all four tracks on the single are \"equally sublime\" and \"particularly the gripping\" \"Man-Size\". David Bennun of Melody Maker considered it \"pretty good, in a weird frenetic steel-tipped rockabilly kind of way\" but added that it was \"by no means the best thing on the [new] album\". While he encouraged buyers to purchase the album instead, he noted that the single was \"worth having for the stark demo version\" of \"Man-Size\".\nTrack listing\nAll songs written by PJ Harvey.\n* UK CD and European 12\" single (Island Records, CID 538, 862 037–2 / 12IS 538, 862 037–1)[http://www.discogs.com/P-J-Harvey-50ft-Queenie/release/404656 \"PJ Harvey – 50ft Queenie (CD, Maxi)\"], discogs.com. Retrieved 30 April 2010.- [http://www.discogs.com/P-J-Harvey-50ft-Queenie/release/1563933 \"PJ Harvey – 50ft Queenie (12\", Single)\"], discogs.com. Retrieved 30 April 2010.\n# \"50&nbsp;ft Queenie\" – 2:26\n# \"Reeling\" – 2:39\n# \"Man-Size\" (demo) – 3:24\n# \"Hook\" (demo) – 4:33\nNote: Tracks 1 and 2 recorded by Steve Albini. Tracks 3 and 4 recorded by PJ Harvey.\nThe demo version of \"Hook\" later appeared on 4-Track Demos.\n* UK 7\" single (Island Records, IS 538, 862 037–7)\n# \"50&nbsp;ft Queenie\" – 2:26\n# \"Reeling\" – 2:39\n# \"Man-Size\" (demo) – 3:24\nCharts\n{| class=\"wikitable sortable\"\n! Chart (1993)\n! Peakposition\n|-\n|Australia (ARIA)\n|align=\"center\"|179\n|-\n|Europe (Eurochart Hot 100)\n|align=\"center\"|80\n|-\n|UK Singles (OCC)\n|align=\"center\"|27\n|-\n|}\nReferences"
    }
  ]
}