{
  "content": [
    {
      "type": "text",
      "text": "# 513th Electronic Warfare Squadron\n\n|branch=\n|type=\n|role=Electronic Warfare\n|size=\n|command_structure=Air Combat Command\n|current_commander=\n|garrison=Eglin Air Force Base\n|nickname=\n|motto=\n|colors=\n|march=\n|mascot=\n|battles=Mediterranean Theater of Operations\n|notable_commanders=\n|anniversaries=\n|decorations=Distinguished Unit CitationAir Force Outstanding Unit AwardAir Force Organizational Excellence Award\n|battle_honours=\n|identification_symbol=\n|identification_symbol_label=513th Electronic Warfare Squadron emblem\n|identification_symbol_2=\n|identification_symbol_2_label=513th Test Squadron emblem\n|identification_symbol_3=\n|identification_symbol_3_label=513th Bombardment Squadron emblem\n}}\nThe 513th Electronic Warfare Squadron is a United States Air Force unit assigned to the 350th Spectrum Warfare Wing at Eglin Air Force Base, Florida.\nThe squadron was formed as the 513th Bombardment Squadron in the Middle East in 1942 to reinforce the Royal Air Force in North Africa with personnel and aircraft diverted from delivery to the China Burma India Theater.  The squadron moved forward, eventually being stationed in Italy, where it participated in the strategic bombing campaign against Germany, and was awarded three Distinguished Unit Citations for its combat actions.  Following V-E Day, the squadron returned to the United States, where it converted to Boeing B-29 Superfortress bombers, but was inactivated in March 1946.\nThe squadron was redesignated the 513th Reconnaissance Squadron and activated in 1947 as a weather reconnaissance unit.  Except for a brief period of inactivation in the winter of 1948–1949, it continued the reconnaissance mission until February 1951, when it was inactivated and its assets transferred to another squadron.\nThe squadron returned to the bombardment mission later that year, and upgraded to jet Boeing B-47 Stratojet bombers in 1954.  It continued to fly the Stratojet until they were phased out of the Air Force inventory, and the squadron was inactivated in 1965.  It was redesignated the 513th Test Squadron and activated in 1986, serving in that role until inactivating in 1997.  It was activated in its most recent role in 2010.\nMission\nThe role of the squadron is to provide combat-credible mission data to the Lockheed Martin F-35 Lightning II fighters, relying on expertise in intelligence analysis, mission data programming, and software development. It also operates a Hardware-in-the-loop test line for verification and validation testing of data. The 513th provides mission data to all United States Air Force, United States Navy, and United States Marine Corps Lightning II aircraft.\nHistory\nWorld War II\nBackground\nIn early 1942, the Afrika Corps was threatening British forces in Egypt.  In response, two contingents of American heavy bombers were diverted to support the British.  A flight of Consolidated B-24 Liberators being ferried to India was halted from its travel in June and some Boeing B-17 Flying Fortresses from the 9th and 436th Bombardment Squadrons were flown to the Middle East from India.  On 20 July 1942, these elements were organized into the 1st Provisional Group at RAF Lydda, Palestine.\nNorth African operations\nOn 31 October 1942, the 1st Group was dissolved and replaced by a formal Army Air Forces unit, the 376th Bombardment Group. The 513th Bombardment Squadron was activated as one of its four component squadrons. The squadron was originally equipped with a mix of Liberators and Flying Fortresses, but by the end of the year, the B-17s were transferred to Twelfth Air Force and the squadron became an all B-24 unit.\nMoving forward to bases in Egypt and Libya, the squadron attacked shipping in the Mediterranean and harbor installations in Libya, Tunisia, Sicily, and Italy to cut enemy supply lines to North Africa. After the fall of Tunisia in May 1943, the squadron focused on attacks on aerodromes, marshalling yards, and other objectives in Sicily and Italy, moving forward to Enfidaville Airfield, Tunisia in late September.  Its actions during these attacks on enemy targets from its activation through August 1943 earned the squadron its first Distinguished Unit Citation (DUC).\nOn 1 August 1943, operating from Benina Airport, Libya, the squadron participated in Operation Tidal Wave, the low level attack on oil refineries near Ploesti, with the squadron's parent group leading the attack formation. As it approached its assigned targets, the lead aircraft realized that an order from the group commander, who had misidentified the initial point, put the group off course. The group attempted an attack on the Romana Americana refinery, its assigned objective from a different direction.  By this time, enemy air defenses had been alerted and intense flak forced the unit to attack targets of opportunity.  The squadron was awarded its second DUC for this operation.\nStrategic bombing campaign\nThe squadron moved to San Pancrazio Airfield, Italy in November 1943, where it became part of Fifteenth Air Force and would remain until April 1945. It primarily flew long range strategic bombardment missions to targets in Italy, France, Germany, Czechoslovakia, Austria, Hungary, and the Balkans to bomb factories, marshalling yards, oil refineries, oil storage facilities, airdromes, bridges, harbors, and other objectives.  On 16 June 1944, it received a third DUC for an attack on oil industry targets in Bratislava.  The squadron also provided air support for Operation Shingle, the landings at Anzio and flew interdiction missions to support the Battle of Monte Cassino between February and March 1944. In the fall of 1944, it assisted the Red Army in its advance through the Balkans, and in early 1945, supported Operation Grapeshot, the spring offensive in Northern Italy.  The squadron was withdrawn from combat in April 1945 and left Italy for the United States.\nThe squadron arrived at Harvard Army Air Field, Nebraska in May 1945 and began conversion to the Boeing B-29 Superfortress.  However the war in the Pacific ended before the squadron was fully trained.  After it moved to March Field, California on 1 November, the squadron was not fully manned or equipped.  It was inactivated on 28 March 1946, and most of its few resources at MacDill Air Force Base, Florida were absorbed by the 498th Bombardment Group.\nWeather reconnaissance\nThe squadron was redesignated the 513th Reconnaissance Squadron and activated at Gravelly Point, Virginia in May 1947.  Although the squadron was reassigned to Air Weather Service in September, and to the 308th Reconnaissance Group in October, it was not manned before inactivating on 20 September 1948.\nThe squadron was reactivated at Fairfield-Suisun Air Force Base, California in August 1949.  After drawing its cadre and training with the 2078th Weather Reconnaissance Squadron on various models of the Boeing B-29 Superfortress, the squadron moved to Tinker Air Force Base, Oklahoma in November. Air Weather Service reorganized its weather reconnaissance assets at this time, inactivating the 308th Reconnaissance Group, and the squadron was assigned directly to Air Weather Service headquarters.  The squadron was inactivated in February 1951, as Air Weather Service again reorganized its reconnaissance units to focus on overseas operations.\nStrategic Air Command\nThe squadron was redesignated the 513th Bombardment Squadron and reactivated at Forbes Air Force Base, Kansas in June 1951. The squadron was again equipped with Superfortress bombers and assigned to the 376th Group.  It began training in strategic bombardment in August.  However, SAC's mobilization for the Korean War highlighted that SAC wing commanders focused too much on running the base organization and did not spend enough time on overseeing actual combat preparations.  To allow wing commanders the ability to focus on combat operations, SAC air base group commanders became responsible for managing the base housekeeping functions. Under the plan implemented in February 1951 and finalized in June 1952, the wing commander focused primarily on the combat units and the maintenance necessary to support combat aircraft by having the combat and maintenance squadrons report directly to the wing and eliminating the intermediate group structures. As a result of this \"dual deputy\" reorganization, the 376th Group was inactivated and the squadron was assigned directly to the 376th Bombardment Wing in June 1952.\nThe squadron moved to Barksdale Air Force Base, Louisiana in October.  By November 1952, electronic countermeasures (ECM) training began to predominate over bombardment, and by September 1953, ECM had become the unit's primary mission.  In 1954, the squadron converted to Boeing B-47 Stratojet jet medium bombers.  It moved again in 1957, this time to Lockbourne Air Force Base, Ohio.   After 1958, Strategic Air Command (SAC) B-47 units began to assume an alert posture at their home base.\nDuring the 1962 Cuban Missile Crisis, SAC dispersed its B-47s on 22 October.   Most dispersal bases were civilian airfields with Reserve or Air National Guard units.  B-47s were configured for execution of the Emergency War Order as soon as possible after dispersal. On 24 October SAC went to DEFCON 2, placing all aircraft on alert. On 15 November 1/6 of the dispersed B-47s were recalled to their home bases.  The remaining dispersed B-47s and supporting tankers were recalled on 24 November. On 27 November SAC returned to normal alert posture. The squadron continued to train in electronic warfare techniques until beginning to phase down for inactivation in March 1965 with the retirement of the Stratojet from SAC's inventory.\nOperational test unit\nThe squadron was redesignated the 513th Test Squadron and activated at Offutt Air Force Base, Nebraska on 1 July 1986. The squadron conducted operational test and evaluation of Boeing B-52 Stratofortress, Rockwell B-1 Lancer, and Boeing KC-135 Stratotanker aircraft and support systems.  When SAC was disestablished in June 1992, the squadron was transferred to the USAF Air Warfare Center, but continued its mission until inactivated in May 1997.\nElectronic warfare for F-35\nThe squadron was redesignated the 513th Electronic Warfare Squadron and activated at Eglin Air Force Base, Florida in April 2010 with an electronic warfare reprogramming mission.\nLineage\n* Constituted as the 513th Bombardment Squadron (Heavy) on 19 October 1942\n: Activated on 31 October 1942\n: Redesignated 513th Bombardment Squadron, Heavy on 3 May 1944\n: Redesignated 513th Bombardment Squadron, Very Heavy on 23 May 1945\n: Inactivated on 31 March 1946\n* Redesignated 513th Reconnaissance Squadron, Very Long Range, Weather on 6 May 1947\n: Activated on 23 May 1947\n: Inactivated on 20 September 1948\n* Activated on 10 August 1949\n: Inactivated on 20 February 1951\n* Redesignated 513th Bombardment Squadron, Medium on 25 May 1951\n: Activated on 1 June 1951\n: Discontinued and inactivated on 15 March 1965\n* Redesignated 513th Test Squadron on 12 February 1986\n: Activated on 1 July 1986\n: Redesignated 513th Engineering and Test Squadron on 15 April 1993\n: Inactivated on 31 May 1997\n* Redesignated 513th Electronic Warfare Squadron on 30 March 2010\n: Activated on 23 April 2010\nAssignments\n* 376th Bombardment Group, 31 October 1942\n* 497th Bombardment Group, 1 November 1945 – 31 March 1946\n* 376th Reconnaissance Group, 23 May 1947\n* Air Weather Service, 26 September 1947\n* 308th Reconnaissance Group, 14 October 1947 – 20 September 1948\n* 308th Reconnaissance Group, 10 August 1949\n* Air Weather Service, 19 December 1950 – 20 February 1951\n* 376th Bombardment Group, 1 June 1951\n* 376th Bombardment Wing, 16 June 1952 – 15 March 1965\n* Strategic Air Command, 1 July 1986 – 1 June 1992 (attached to SAC Combat Operations Staff)\n* USAF Air Warfare Center, 1 June 1992\n* 68th Electronic Combat Group, 15 April 1993 – 31 May 1997\n* 53d Electronic Warfare Group, 23 April 2010\n* 350th Spectrum Warfare Group, 25 June 2021 – present\nStations\n* RAF Lydda, Palestine, 31 October 1942\n* RAF Abu Sueir, Egypt, 8 November 1942\n* RAF Gambut, Libya, 10 February 1943\n* Soluch Airfield, Libya, 25 February 1943\n* Benina Airport, Libya, 16 April 1943\n* Enfidaville Airfield, Tunisia, c. 26 September 1943\n: Detachment operated from Benina Airport, Libya, 3–11 October 1943\n* San Pancrazio Airfield, Italy, 19 November 1943 – 19 April 1945\n* Harvard Army Air Field, Nebraska, 8 May 1945\n* Grand Island Army Air Field, Nebraska, 25 June 1945\n* March Field, California, 1 November 1945\n* MacDill Field, Florida c. 5 January–31 March 1946\n* Gravelly Point, Virginia, 23 May 1947 – 20 September 1948\n* Fairfield-Suisun Air Force Base, California, 10 August 1949\n* Tinker Air Force Base, Oklahoma, 10 November 1949 – 20 February 1951\n: Detachment operated from Dhahran Airfield, Saudi Arabia, c. 6 March–May 1950\n* Forbes Air Force Base, Kansas, 1 June 1951\n* Barksdale Air Force Base, Louisiana, 10 October 1951\n* Lockbourne Air Force Base, Ohio, 1 December 1957 – 15 March 1965\n* Offutt Air Force Base, Nebraska, 1 July 1986 – 31 May 1997\n* Eglin Air Force Base, Florida, 23 April 2010 – present\nAircraft\n* Boeing B-17 Flying Fortress, 1942–1943\n* Consolidated B-24 Liberator, 1943–1945\n* Boeing B-29 Superfortress, 1945, 1951–1954, 1950–1951\n* Boeing RB-29 Superfortress, 1950–1951\n* Boeing WB-29 Superfortress, 1950–1951\n* Douglas C-47 Skytrain, 1950\n* Douglas C-54 Skymaster, 1950–1951\n* Boeing B-47 Stratojet, 1954–1961\n* Boeing EB-47 Stratojet, 1961–1965\n* Boeing B-52 Stratofortress, 1992–1997\n* Rockwell B-1 Lancer, 1992–1997\n* Boeing KC-135 Stratotanker, 1992–1997\nAwards and campaigns\n{| class=\"wikitable\"\n|- style=\"background:#efefef;\"\n! Campaign Streamer\n! Campaign\n! Dates\n! Notes\n|-\n|200px||Air Offensive, Europe||31 October 1942 – 5 June 1944||513th Bombardment Squadron\n|-\n|200px||Air Combat, EAME Theater||31 October 1942 – 11 May 1945||513th Bombardment Squadron\n|-\n|200px||Egypt-Libya||31 October 1942 – 12 February 1943||513th Bombardment Squadron\n|-\n|200px||Tunisia||12 November 1942 – 13 May 1943||513th Bombardment Squadron\n|-\n|200px||Sicily||14 May 1943 – 17 August 1943||513th Bombardment Squadron\n|-\n|200px||Naples-Foggia||18 August 1943 – 21 January 1944||513th Bombardment Squadron\n|-\n|200px||Anzio||22 January 1944 – 24 May 1944||513th Bombardment Squadron\n|-\n|200px||Rome-Arno||22 January 1944 – 9 September 1944||513th Bombardment Squadron\n|-\n|200px||Central Europe||22 March 1944 – 18 April 1945||513th Bombardment Squadron\n|-\n|200px||Normandy||6 June 1944 – 24 July 1944||513th Bombardment Squadron\n|-\n|200px||Northern France||25 July 1944 – 14 September 1944||513th Bombardment Squadron\n|-\n|200px||Southern France||15 August 1944 – 14 September 1944||513th Bombardment Squadron\n|-\n|200px||North Apennines||10 September 1944 – 4 April 1945||513th Bombardment Squadron\n|-\n|200px||Rhineland||15 September 1944 – 21 March 1945||513th Bombardment Squadron\n|-\n|200px||Po Valley||3 April 1945 – 18 April 1945||513th Bombardment Squadron\n|\n|}\nSee also\n* List of United States Air Force electronic warfare squadrons\n* List of United States Air Force test squadrons\n* List of B-1 units of the United States Air Force\n* List of B-52 Units of the United States Air Force\n* List of B-47 units of the United States Air Force\n* List of B-29 Superfortress operators\n* List of Douglas C-47 Skytrain operators\n* Boeing B-17 Flying Fortress Units of the Mediterranean Theater of Operations\n* B-24 Liberator units of the United States Army Air Forces\nReferences\nNotes\n; Explanatory notes\n; Citations\nBibliography\n*\n*\n*\n*\n*\n*\n*\n*"
    }
  ]
}