{
  "content": [
    {
      "type": "text",
      "text": "# 51st Expeditionary Signal Battalion\n\n| colors                        =  Orange and white\n| march                         =\n| ceremonial_chief              =\n| type                          = Tactical communications\n| country                       =\n| branch                        =\n| dates                         = Present\n| command_structure             = 22d Corps Signal Brigade\n| size                          = Battalion\n| specialization                =\n| current_commander             = LTC Joshua S. Liley\n| garrison                      = Joint Base Lewis McChord (JBLM), WA\n| battles                       = World War I\n*Lorraine 1918\n*St. Mihiel\n*Meuse-Argonne\nWorld War II\n*Sicily (with arrowhead)\n*Naples-Foggia\n*Rome-Arno\n*North Apennines\n*Po Valley\nKorean War\n*UN Defensive\n*UN Offensive\n*CCF Intervention\n*First UN Counteroffensive\n*CCF Spring Offensive\n*UN Summer-Fall Offensive\n*Second Korean Winter\n*Korea, Summer-Fall 1952\n*Third Korean Winter\n*Korea, Summer 1953\nSouthwest Asia\n*Defense of Saudi Arabia\n*Liberation and Defense of Kuwait\n*Cease-Fire\nWar on Terrorism\n*Iraqi Surge\n| decorations                   = LTC Feltzplaceholderplaceholder -->\n| anniversaries                 =\n| identification_symbol         =\n| identification_symbol_label   = Distinctive unit insignia\n| identification_symbol_2       =\n| identification_symbol_2_label =\n}}\nThe 51st Signal Battalion is a United States Army unit which is part of the 22d Corps Signal Brigade located at Joint Base Lewis–McChord, Washington. Its mission is to rapidly deploy worldwide to engineer, install, operate, maintain, and defend the LandWarNet in support of full spectrum operations. The battalion deployed to Iraq in  and in  and sent elements to Afghanistan in 2010 and 2011. The unit was deployed as of January 2015, and 2019.\nThe 51st's heraldric crest was approved 11 July 1928. The bend, from the arms of Lorraine and St. Mihiel, is for service in France in World War I. Its participation in four engagements of that war is represented by the four telephone poles.\nThe 51st Signal Battalion is the oldest continuously serving active-duty signal unit, as well as the signal unit with the most years of support to the United States Army.\nHistory\nWorld War I and Inter-war Years\nThe unit was constituted on 1 July 1916 into the Regular Army as the 5th Telegraph Battalion, Signal Corps. The unit was later activated on 12 July 1917 at Monmouth Park, New Jersey. On 1 October 1917, the battalion was re-designated as the 55th Telegraph Battalion. Soon thereafter, the battalion deployed to France and joined the American Expeditionary Force. During World War I, the battalion participated in three major operations – Lorraine 1918, St. Mihiel, and Meuse-Argonne.\nThe battalion returned to New York on 27 June 1919 and moved to Camp Vail, New Jersey. The battalion was re-designated on 18 March 1921, as the 51st Signal Battalion. At this time, it was the Signal Corps' only battalion-sized unit in existence.\nIn 1935, the battalion took part in the Pine Camp maneuvers in New York, which at the time were the largest peacetime maneuvers ever. The 51st was solely responsible for installation of all communications during this exercise; in this capacity, it employed 177 miles of bare copper wire, 126 miles of twisted pair field wire, and 8,260 feet of lead-covered overhead cable.\nIn 1937, in support of newly-formed combat divisions, the 51st conducted a wheeled road march from Fort Monmouth, NJ to Fort Sam Houston, TX. At the time this was the longest motor convoy of its size in United States Army history.\nThe battalion received additional training at Fort A.P. Hill, Virginia, Camp Blanding, Florida, and Camp Stewart, Georgia. The battalion participated in the Louisiana Maneuvers prior to deploying for Europe,  which was the largest test of tactical communications since World War I. During these years, the 51st provided all tactical communication support for the Army. Chief Signal Officer James B. Allison once remarked to an Army War College audience that 51st's support was so prolific, that each individual member of 51st was probably known by name to the audience.\nWorld War II\nOn 4 March 1943, the battalion headed to North Africa and staged and participated in the Invasion of Sicily, followed by a mission to provide communications support to forces arriving in Italy in October 1943. As Allied forces attacked across the Volturno Line on the evening of 12–13 October, the 51st Signal Battalion provided essential communications support to the Fifth Army.\nAside from its standard signal support, 51st handled nonstandard missions as well. After Allied Forces secured Palermo, the battalion took over an office building in the city, set up a post office, and oversaw mail distribution in the area. Additionally, Officers of the unit frequently carried coded messages between senior staff members, including the commanding general of II Corps, George S. Patton.\nFor its service in World War II, the battalion was credited with five campaigns and received the Meritorious Unit Commendation.\nKorean War\nOn 1 March 1945, the unit was reorganized and redesignated as the 51st Operation Signal Battalion. Then again, on 8 September 1950, the unit became known as the 51st Signal Battalion, Corps. During the Korean War, the battalion supported I Corps in ten campaigns and received two Meritorious Unit Commendations and the Republic of Korea Presidential Unit Citation. The battalion remained in Korea after the hostilities as part of Eighth Army. After the Korean War cease fire, the battalion was reorganized and redesignated as the 51st Signal Battalion. The battalion remained in Korea until 16 March 1981 when it moved to Ludwigsburg, West Germany in support of VII Corps.\nGulf War, Move to Bragg and War on Terror\nOn November 8, 1990, the battalion was mobilized for immediate deployment to Saudi Arabia in support of Gulf War. For its participation, the battalion received three campaign streamers. On April 15, 1991, the unit returned to Germany.\nThree years later, on April 16, 1993, the 51st relocated to Fort Bragg, North Carolina and on October 1, 1993, the unit was re-designated the 51st Signal Battalion (Airborne) by reflagging an existing signal battalion on post.\nDuring the unit's time at Fort Bragg, it deployed extensively in support of the War on Terror. The Army awarded the Meritorious Unit Commendation to 51st three times during this period, as well as one Presidential Unit Citation for Bravo Company.\nMove to JBLM and Modernization\nIn 2007, 51st's parent unit, 35th Signal Brigade transferred to Fort Gordon, GA. This effectively inactivated the brigade on post. With this move, the 51st lineage transferred to Fort Lewis, WA, where an existing signal battalion reflagged as 51st; the unit remained subordinate to 35th Signal Brigade.\nDuring this time, the unit supported combat operations in the Middle East, such as in Afghanistan in 2011 and Iraq in 2015. It also conducted countless missions in locations such as Mihail Kogălniceanu International Airport in Romania, Israel, as well as routine training and support missions in Alaska, Australia, Hawaii, Guam, Japan, Philippines, and Thailand.\nOn 16 November 2021, the battalion became a subordinate unit (and the sole battalion) under the training and readiness authority of 22nd Corps Signal Brigade. The battalion also underwent a major modernization effort which saw a turn-in of its legacy PM WIN-T equipment, and a major fielding of lighter, more scalable tactical communications equipment. This conversion enabled 51st to begin operations as an Expeditionary Signal Battalion-Enhanced.\n51st ESB-E deployed most recently to Southwest Asia, returning in early 2025.\nHonors\nDecorations\n*  Meritorious Unit Commendation (Army), Streamer embroidered EUROPEAN THEATER\n* Meritorious Unit Commendation (Army), Streamer embroidered KOREA 1950-1951\n* Meritorious Unit Commendation (Army), Streamer embroidered KOREA 1953-1954\n* Meritorious Unit Commendation (Army), Streamer embroidered SOUTHWEST ASIA 2003-2004\n* Meritorious Unit Commendation (Army), Streamer embroidered IRAQ 2005\n* Meritorious Unit Commendation (Army), Streamer embroidered IRAQ 2008-2009\n*  Republic of Korea Presidential Unit Citation, Streamer embroidered KOREA 1950-1953\nCompany B additionally entitled to:\n*  Presidential Unit Citation (Army), Streamer embroidered IRAQ\n* Meritorious Unit Commendation (Army), Streamer embroidered KOREA 1952\n}}\nFurther reading\n* Stories from the Veterans History Project | date = n.d. | publisher = Library of Congress | quote =  So they made me Chief of Section of a photo outfit and I went directly to Korea as a staff sergeant, Chief of the 51st Signal Battalion. | url = https://memory.loc.gov/diglib/vhp-stories/loc.natlib.afc2001001.00414/transcript?ID=sr0001 | url-status = live | archive-url = https://web.archive.org/web/20201030195056/https://memory.loc.gov/diglib/vhp-stories/loc.natlib.afc2001001.00414/transcript?ID=sr0001 | archive-date = 2020-10-30 | access-date = 2022-03-09 | df = dmy-all }}\n*December 1938 | title = The Signal Corps School | url =  | format =  | department =  | journal = The Military Engineer | language = en | volume = 30 | issue = 174 | pages = 414417 | issn = \t0026-3982 | jstor = 44566739 | lccn = sn94091632 | oclc = 888556677 | df = dmy-all | last1 = School | first1 = The Signal Corps }}\n*138 | issn = 0024-6816 | jstor = 4231247 | lccn = 62050409 | oclc = 874366123 | df = dmy-all }}"
    }
  ]
}