{
  "content": [
    {
      "type": "text",
      "text": "# 52nd Mountain Motorized Infantry Brigade (People's Republic of China)\n\n| allegiance                    =\n| branch                        = People's Liberation Army Ground ForcePeople's Volunteer Army (1950-1955)\n| type                          = Mountain troops\n| size                          = Brigade\n| command_structure             = Tibet Military District\n| garrison                      = Shigatse, Tibet since 1969\n| nickname                      =\n| patron                        =\n| motto                         =\n| colors                        =\n| march                         =\n| mascot                        =\n| battles                       = Chinese Civil War, Korean War\n| anniversaries                 =\n| decorations                   =\n| battle_honours                =\n| notable_commanders            =\n| current_commander             =\n}}\nThe 52nd Army Division, which consists of the 52nd Mountain Motorized Infantry Brigade and the 52nd Mountain Combined Arms Brigade, was originally the 149th Division. It is an infantry formation of the People's Liberation Army of the People's Republic of China, and is currently a mountain unit stationed near India.\nHistory\nThe 149th division () was formed in January 1949 under the Regulation of the Redesignations of All Organizations and Units of the Army, issued by Central Military Commission on November 1, 1948. Based on the same structure as the 21st Temporary Division, the 60th Corps of the Republic of China Army defected during Liaoshen Campaign. Under the flag of the 149th, it took part in other battles of the Chinese Civil War.\nFrom 1950, it became part of the People's Volunteer Army (Chinese People's Volunteers (CPV) or Chinese Communist Forces (CCF)) during the Korean War, with a standard strength of approximately 10,000 men. It was a component of the 50th Corps, consisting of the 445th, 446th, and 447th Regiments.\nDuring the Fourth Phase Campaign of the Korean War, the 149th operated on battlefields along the Han River near Seoul for 50 days and inflicted heavy losses on the United Nations. In March 1951, it was removed from the battlefield, but the division entered Korea again in July of the same year.\nIn April 1955, the 148th Division pulled out from Korea and was stationed in the Shenyang Military District. The division was then composed of the following:\n*445th Infantry Regiment;\n*446th Infantry Regiment;\n*447th Infantry Regiment;\n*529th Artillery Regiment.\nIn 1960, it was renamed as the 149th Army Division ().\nIn May 1967, the division moved to Sichuan province with the Corps HQ, converting to a \"southern\" unit.\nIn 1969, it swapped its designations and positions with the 52nd Army Division from the Tibet Military District, and became the 52nd Army Division () (3rd Formation). All its regiments were re-designated as the 154th, 155th, and 156th Infantry Regiments. Its 529th Artillery Regiment was renamed the Artillery Regiment, 52nd Army Division.\nFrom September 28, 1975, the division was maintained as a Catalogue B Division. From August 16, 1978, the division was maintained as a Catalogue A Division.\nIn September 1985, the division was reduced and re-organized as the 52nd Mountain Motorized Infantry Brigade (), and was considered a \"Motorized Infantry Brigade of High Altitude.\"\nIn 2017, the brigade was re-organized as the 52nd Mountain Combined Arms Brigade ().\nReferences\nExternal links\n* [http://blog.sina.com.cn/s/blog_a3f74a990101cp1q.html 中国人民解放军各步兵师沿革]"
    }
  ]
}