{
  "content": [
    {
      "type": "text",
      "text": "# 53rd Reserve Division (German Empire)\n\nThe 53rd Reserve Division (53. Reserve-Division) was a unit of the Imperial German Army in World War I.  The division was formed in September 1914 and organized over the next month, arriving in the line in October. It was part of the first wave of new divisions formed at the outset of World War I, which were numbered the 43rd through 54th Reserve Divisions.  The division was initially part of XXVII Reserve Corps.  The division was disbanded in September 1918 and its assets distributed to other units.  The division was recruited in the Kingdom of Saxony.\nCombat chronicle\nThe 53rd Reserve Division initially fought on the Western Front, entering the line in mid-October. As part of the so-called Race to the Sea, it fought in the Battle of the Yser in October–November 1914.  It remained in positional warfare and fighting along the Yser until April 1915, and then was engaged in fighting in the Second Battle of Ypres.  After that battle, the division returned to the line on the Yser until September.  After a brief period of rest, the division fought against the French offensive in the Second Battle of Champagne.  The division again went into army reserve from the end of October 1915 to the end of January 1916, after which it returned to the line on the Yser and then in the Flanders and Artois regions.  It saw several weeks' action in the Battle of the Somme, and then returned to positional warfare in the line.  In November 1916, the division was transferred to the Eastern Front, where it engaged in positional warfare until June 1917.  It then fought against the Russian Kerensky Offensive and in follow-on fighting in Galicia and on the Ukrainian border.  At the end of November 1917, the division was transferred back to the Western Front, arriving in mid-December at border defense positions on the Belgian-Dutch border.  After a few months there and then in the line in Flanders and the Artois, the division fought in the 1918 German spring offensive, seeing action in the First Battle of the Somme (1918), also known as the Second Battle of the Somme (to distinguish it from the 1916 battle).  After that battle, the division went to the Verdun region to recover, and then in June went to the Soisson region, where it saw action in July–August in the Second Battle of the Marne.  The division suffered heavily and was relieved on August 10.  It went to the Argonne region to be dissolved; some of its understrength units were there when the Meuse-Argonne Offensive began and they were sent to the line to bolster other divisions in the face of American attacks. Allied intelligence considered the division as mediocre in 1917 and rated it third class in 1918.\nOrder of battle on formation\nThe 53rd Reserve Division was initially organized as a square division, with essentially the same organization as the reserve divisions formed on mobilization.  The order of battle of the 53rd Reserve Division on September 10, 1914, was as follows:\n*105.Reserve-Infanterie-Brigade\n**Königlich Sächsisches Reserve-Infanterie-Regiment Nr. 241\n**Königlich Sächsisches Reserve-Infanterie-Regiment Nr. 242\n*106.Reserve-Infanterie-Brigade\n**Königlich Sächsisches Reserve-Infanterie-Regiment Nr. 243\n**Königlich Sächsisches Reserve-Infanterie-Regiment Nr. 244\n**Königlich Sächsisches Reserve-Jäger-Bataillon Nr. 25\n*Königlich Sächsische Reserve-Kavallerie-Abteilung Nr. 53\n*Königlich Sächsisches Reserve-Feldartillerie-Regiment Nr. 53\n*Königlich Sächsische Reserve-Pionier-Kompanie Nr. 53\nOrder of battle on March 28, 1918\nThe 53rd Reserve Division was triangularized in May 1917, dissolving the 106th Reserve Infantry Brigade headquarters and sending the 244th Reserve Infantry Regiment to the 96th Infantry Division. Over the course of the war, other changes took place, including the formation of artillery and signals commands and the enlargement of combat engineer support to a full pioneer battalion.  The order of battle on March 28, 1918, was as follows:\n*105.Reserve-Infanterie-Brigade\n**Königlich Sächsisches Reserve-Infanterie-Regiment Nr. 241\n**Königlich Sächsisches Reserve-Infanterie-Regiment Nr. 242\n**Königlich Sächsisches Reserve-Infanterie-Regiment Nr. 243\n*Königlich Sächsische Reserve-Kavallerie-Abteilung Nr. 53\n*Königlich Sächsischer Artillerie-Kommandeur 155\n**Königlich Sächsisches Reserve-Feldartillerie-Regiment Nr. 32\n**IV.Bataillon/Königlich Sächsisches Reserve-Fußartillerie-Regiment Nr. 24\n*Königlich Sächsisches Pionier-Bataillon Nr. 353\n**4.Reserve-Kompanie/Königlich Sächsisches 1. Pionier-Bataillon Nr. 12\n**Königlich Sächsische Reserve-Pionier-Kompanie Nr. 53\n**Königlich Sächsische Minenwerfer-Kompanie Nr. 253\n*Königlich Sächsischer Divisions-Nachrichten-Kommandeur 453\nReferences\n* [http://www.1914-18.info/erster-weltkrieg.php?u=433 53. Reserve-Division (Chronik 1914/1918) - Der erste Weltkrieg]\n* Hermann Cron et al., Ruhmeshalle unserer alten Armee (Berlin, 1935)\n* Hermann Cron, Geschichte des deutschen Heeres im Weltkriege 1914-1918 (Berlin, 1937)\n* Günter Wegner, Stellenbesetzung der deutschen Heere 1815-1939. (Biblio Verlag, Osnabrück, 1993), Bd. 1\n* Histories of Two Hundred and Fifty-One Divisions of the German Army which Participated in the War (1914-1918), compiled from records of Intelligence section of the General Staff, American Expeditionary Forces, at General Headquarters, Chaumont, France 1919 (1920)\nNotes"
    }
  ]
}