{
  "content": [
    {
      "type": "text",
      "text": "# 54th Filmfare Awards\n\n| image =\n| caption =\n| date = 28 February 2009\n| site = Yash Raj Studios\n| host = Ranbir Kapoor Imran KhanDeepika PadukoneKonkana Sen SharmaKaran JoharFarhan Akhtar\n| producer =\n| director =\n| best_film = Jodhaa Akbar\n| best_critic = Mumbai Meri Jaan\n| most_wins = Rock On!! (7)\n| most_nominations = Rock On!! (15)\n| network = Sony Entertainment Television (India)\n| duration =\n| ratings =\n| last = 53rd\n| next = 55th\n}}\nThe 54th Idea Filmfare Awards ceremony, presented by The Times Group and Idea Cellular, was one of India's most prestigious awards ceremony, honoring the best Bollywood films of 2008. It took place on 28 February 2009 at the Yash Raj Studios, Mumbai. Actors Ranbir Kapoor and  Imran Khan hosted the show for the first part, while actresses Konkona Sen Sharma and Deepika Padukone hosted the show in the latter part. It was the first time that any of these actors hosted the awards ceremony. The ceremony was televised in India eight days later, on 8 March 2009.\nThe nominees for the various films were announced on 16 February 2009. Rock On!! led the ceremony with 15 nominations, followed by Jaane Tu... Ya Jaane Na with 12 nominations, Jodhaa Akbar with 11 nominations and Rab Ne Bana Di Jodi with 10 nominations respectively.\nRock On!! won 7 awards, including Best Supporting Actor (for Arjun Rampal) and Best Male Debut (for Farhan Akhtar), thus becoming the most-awarded film at the ceremony.\nJodhaa Akbar won 5 awards under the main category, including Best Film, Best Director (for Ashutosh Gowariker) and Best Actor (for Hrithik Roshan).\nPriyanka Chopra won her first Best Actress award for her performance in Fashion, while Asin Thottumkal won Best Female Debut for her performance in Ghajini.\nAwards and nominees\nMain awards\n{| class=\"wikitable\" |\n|-\n! style=\"background:#EEDD82;\"|Best Film\n! style=\"background:#EEDD82;\"|Best Director\n|-\n| valign=\"top\" |\n*Jodhaa Akbar — Ashutosh Gowariker Productions and UTV Motion Pictures\n**Dostana — Dharma Productions\n**Ghajini — Geetha Arts\n**Jaane Tu... Ya Jaane Na — Aamir Khan Productions\n**Rab Ne Bana Di Jodi — Yash Raj Films\n**Rock On!! — Excel Entertainment\n| valign=\"top\" |\n*Ashutosh Gowariker – Jodhaa Akbar\n**A. R. Murugadoss – Ghajini\n**Abhishek Kapoor – Rock On!!\n**Aditya Chopra – Rab Ne Bana Di Jodi\n**Madhur Bhandarkar – Fashion\n**Neeraj Pandey – A Wednesday\n|-\n! Best Actor\n! Best Actress\n|-\n|\n*Hrithik Roshan – Jodhaa Akbar as Jalaluddin Mohammed Akbar\n**Aamir Khan – Ghajini as Sanjay Singhania/Sachin Chauhan\n**Abhishek Bachchan – Dostana as Sameer \"Sam\" Kapoor\n**Akshay Kumar – Singh Is Kinng as Happy Singh\n**Naseeruddin Shah – A Wednesday as \"The Common Man\"\n**Shah Rukh Khan – Rab Ne Bana Di Jodi as Surinder Sahni / Raj Kapoor\n|\n*Priyanka Chopra – Fashion as Meghna Mathur\n**Aishwarya Rai – Jodhaa Akbar as Jodhaa Bai\n**Anushka Sharma – Rab Ne Bana Di Jodi as Taani Gupta Sahni\n**Asin Thottumkal – Ghajini as Kalpana Shetty\n**Kajol – U Me Aur Hum as Piya Thapar\n|-\n! Best Supporting Actor\n! Best Supporting Actress\n|-\n|\n*Arjun Rampal – 'Rock On!! as Joseph 'Joe' Mascarenhas'\n**Abhishek Bachchan – Sarkar Raj as Shankar Nagre\n**Prateik Babbar – Jaane Tu... Ya Jaane Na as Amit Mahant\n**Sonu Sood – Jodhaa Akbar as Prince Sujamal\n**Tusshar Kapoor – Golmaal Returns as Lucky Gill\n**Vinay Pathak – Rab Ne Bana Di Jodi as Balwinder \"Bobby\" Khosla\n|\n*Kangana Ranaut – Fashion as Shonali Gujral\n**Bipasha Basu – Bachna Ae Haseeno as Radhika / Shreya Rathore\n**Jiah Khan – Ghajini as Sunita Kalantri\n**Kirron Kher – Dostana as Mrs. Acharya\n**Ratna Pathak Shah – Jaane Tu... Ya Jaane Na as Savitri Singh Rathore\n**Shahana Goswami – Rock On!! as Debbie Mascarenhas\n|-\n! Best Male Debut\n! Best Female Debut\n|-\n|\n*Farhan Akhtar – 'Rock On!! as Aditya 'Adi' Shroff\n*Imran Khan – Jaane Tu... Ya Jaane Na as Jai Singh Rathore'\n**Anurag Sinha – Black & White as Numair Qazi\n**Harman Baweja – Love Story 2050 as Karan Malhotra\n**Nikhil Dwivedi – My Name Is Anthony Gonsalves as Anthony Gonsalves\n**Prateik Babbar – Jaane Tu... Ya Jaane Na as Amit Mahant\n**Rajeev Khandelwal – Aamir as Dr. Aamir Ali\n**Sikandar Kher – Woodstock Villa as Sameer / Akshay Kapadia\n|\n*Asin Thottumkal – Ghajini as Kalpana Shetty\n**Adah Sharma – 1920 as Lisa Singh Rathod\n**Anushka Sharma – Rab Ne Bana Di Jodi as Taani Gupta Sahni\n**Mugdha Godse – Fashion as Janet Sequeira Arora\n**Prachi Desai – Rock On!! as Sakshi Shroff\n**Sonal Chauhan – Jannat as Zoya Mathur\n|-\n! Best Music Director\n! Best Lyricist\n|-\n|\n*A. R. Rahman – Jaane Tu... Ya Jaane Na\n**A. R. Rahman – Ghajini\n**A. R. Rahman – Jodhaa Akbar\n**Pritam – Race\n**Shankar–Ehsaan–Loy – Rock On!!\n**Vishal–Shekhar – Dostana\n|\n*Javed Akhtar – Jashn-E-Bahara – Jodhaa Akbar\n**Abbas Tyrewala – Kabhi Kabhi Aditi – Jaane Tu... Ya Jaane Na\n**Gulzar – Tu Hi To Meri Dost Hai – Yuvvraaj\n**Jaideep Sahni – Haule Haule – Rab Ne Bana Di Jodi\n**Javed Akhtar – Socha Hai – Rock On!!\n**Prasoon Joshi – Guzaarish – Ghajini\n|-\n! Best Playback Singer – Male\n! Best Playback Singer – Female\n|-\n|\n*Sukhwinder Singh – Haule Haule – Rab Ne Bana Di Jodi\n**Farhan Akhtar – Socha Hai – Rock On!!\n**K.K. – Khuda Jaane – Bachna Ae Haseeno\n**K.K. – Zara Sa – Jannat\n**Rashid Ali – Kabhi Kabhi Aditi – Jaane Tu... Ya Jaane Na\n**Sonu Niigaam – Inn Lamho Ke Daaman Mein – Jodhaa Akbar\n|\n*Shreya Ghoshal – Teri Ore – Singh Is Kinng\n**Alka Yagnik – Tu Muskura – Yuvvraaj\n**Neha Bhasin – Kuch Khaas Hai – Fashion\n**Shilpa Rao – Khuda Jaane – Bachna Ae Haseeno\n**Shruti Pathak – Mar Jawaan – Fashion\n**Sunidhi Chauhan – Dance Pe Chance – Rab Ne Bana Di Jodi\n|}\nCritics' awards\n{| class=\"wikitable\"\n|-\n!colspan=2|Best Movie\n|-\n|colspan=2|\n*Mumbai Meri Jaan (Nishikant Kamat)\n|-\n!colspan=2|Best Performance\n|-\n|align=center|Male\n|align=center|Female\n|-\n|\n*'Manjot Singh – Oye Lucky! Lucky Oye!\n|\n*Shahana Goswami – Rock On!!\n|}\nTechnical awards\n{| class=\"wikitable\"\n|-\n!Best Story\n!Best Screenplay\n|-\n|\n*Abhishek Kapoor – Rock On!!'\n**Aseem Arora – Heroes\n**Dibakar Banerjee, Urmi Juvekar – Oye Lucky! Lucky Oye!\n**Neeraj Pandey – A Wednesday\n**Santosh Sivan – Tahaan\n|\n*Yogesh Vinayak Joshi, Upendra Sidhaye – Mumbai Meri Jaan\n**Abbas Tyrewala – Jaane Tu... Ya Jaane Na\n**Abhishek Kapoor, Pubali Chaudhary – Rock On!!\n**Ajay Monga, Anuradha Tiwari, Madhur Bhandarkar – Fashion\n**Shiraz Ahmed – Race\n|-\n!Best Dialogue\n!Best Editing\n|-\n|\n*Manu Rishi – Oye Lucky! Lucky Oye!\n**Abbas Tyrewala – Jaane Tu... Ya Jaane Na\n**K. P. Saxena – Jodhaa Akbar\n**Neeraj Pandey – A Wednesday\n**Yogesh Vinayak Joshi – Mumbai Meri Jaan\n|\n*Amit Pawar  – Mumbai Meri Jaan\n|-\n!Best Choreography\n!Best Cinematography\n|-\n|\n*Longines Fernandes – \"'Pappu Can't Dance Saala!\"' from – Jaane Tu... Ya Jaane Na\n|\n*Jason West – Rock On!!\n|-\n!Best Production Design\n!Best Sound Design\n|-\n|\n*Vandan Kataria, Monica Angelina Bhowmick – Oye Lucky! Lucky Oye!\n|\n*Vinod Subramaniyam – Rock On!!\n|-\n!Best Costume Design\n!Best Background Score\n|-\n|\n*'Manoshi Nath, Rushi Sharma – Oye Lucky! Lucky Oye!\n|\n*A. R. Rahman – Jodhaa Akbar\n|-\n!Best Special Effects\n!Best Action\n|-\n|\n*John Deitz – Love Story 2050\n|\n*Peter Hein – Ghajini\n|}\nSpecial awards\n{| class=\"wikitable\"\n|-\n! colspan=2| Lifetime Achievement\n|-\n|\n*Bhanu Athaiya\n|\n*Om Puri\n|-\n! colspan=2| Special Jury Mention (certificate)\n|-\n|\n*Prateik Babbar (actor) – Jaane Tu... Ya Jaane Na\n|\n*Purab Kohli (actor) – Rock On!!\n|-\n!colspan=2| RD Burman Award\n|-\n|colspan=2|\n*Benny Dayal\n|-\n!colspan=2| Best Scene\n|-\n|colspan=2|\n*Rab Ne Bana Di Jodi'\n**Dostana\n**Jodhaa Akbar\n**Rock On!!\n|}\nMultiple nominations and wins\nThe following films received multiple nominations.\n*10 nominations: Rab Ne Bana Di Jodi and Rock On!!\n*9 nominations: Jodhaa Akbar\n*7 nominations: Fashion, Ghajini and Jaane Tu... Ya Jaane Na\n*5 nominations: Dostana\nThe following films received multiple awards.\n*5 wins: Jodhaa Akbar and Rock On!!\n*4 wins: Jaane Tu Ya Jaane Na\n*3 wins: Oye Lucky! Lucky Oye!\n*2 wins: Fashion, Ghajini, Mumbai Meri Jaan and Rab Ne Bana Di Jodi\n*1 win: Love Story 2050 and Singh Is Kinng\nAwards tally\n– winner of the Filmfare Best Film Award,  – nominees for Best Film\n* Note : ''In some cases, the number of nominations can be less than the number of awards won. This is explained by the fact that there are some awards which do not have any nominations. So, a film could have won an award which does not have any list of nominees. Also, Critics' Awards are not included in the number of awards won by the films.\n{| class=\"wikitable sortable\" style=\"text-align: center\"\n|-\n!style=\"width:12em\"|Film\n!style=\"width:6em\"|Awards\n!style=\"width:6em\"|Nominations\n!class=\"unsortable\"|Notes\n|-\n| A Wednesday''\n| 0\n| 4\n| align=\"left\"|\n*This was Neeraj Pandey's first feature film as a director.\n*He was also the scriptwriter of the film, and it was his first time as scriptwriter as well.\n|-\n| Bachna Ae Haseeno\n| 0\n| 3\n| align=\"left\"|\n*Bipasha Basu got her second nomination for Filmfare Award for Best Supporting Actress, after her role in No Entry. However, she failed to win it both times.\n*KK became only the third male playback singer to get multiple nominations in the Filmfare Award for Best Male Playback, after Sonu Nigam and Udit Narayan, since 2000.\n*Shilpa Rao debuted as a female playback singer with this film, and also received her first Filmfare Award for Best Female Playback nomination for this film.\n|-\n| style=\"background:lightyellow;\" | Dostana\n| 0\n| 5\n| align=\"left\"|\n*This film was the directorial debut of Tarun Mansukhani.\n*Dostana was only the second film which was produced by Karan Johar, but not directed by him, to get a nomination under the Filmfare Award for Best Film category (after Kal Ho Naa Ho (2003)). It was the second Karan Johar production which did not win a single Filmfare Award, after Kaal (2005).\n|- 1\n| Fashion\n| 2\n| 6\n| align=\"left\"|\n*This film earned director Madhur Bhandarkar his second nomination under the Filmfare Award for Best Director, after Page 3 in 2006.\n*Priyanka Chopra won her first ever Filmfare Award for Best Actress for this film. Simultaneously, Kangana Ranaut won her first ever Filmfare Award for Best Supporting Actress for this film. Such a feat was last achieved in 2006, when Ayesha Kapoor and Rani Mukherji won the Best Supporting Actress and Best Actress Award respectively for Black.\n|-\n| style=\"background:lightyellow;\" | Ghajini\n| 2\n| 7\n| align=\"left\"|\n*This film saw the directorial debut of South Indian film-maker A. R. Murugadoss, who had also directed the Tamil version of this film. The Tamil version (also titled Ghajini) starred Surya Sivakumar.\n*South Indian actress Asin Thottumkal debuted in Bollywood with this film, and won the Filmfare Award for Best Female Debut. Incidentally, she had also starred as the female lead in the Tamil version of this film. Thus, she became the first actress to act in the same role in two films (remakes) of two different languages.\n*Aamir Khan had nominated for Best Actor, he had won previously Taare Zameen Par (2007).\n|-\n| style=\"background:lightyellow;\" | Jaane Tu... Ya Jaane Na\n| 3\n| 7\n| align=\"left\"|\n*A. R. Rahman became only the fourth music director in the history of Filmfare to win the Filmfare Award for Best Music Director three times in a row, after Shankar–Jaikishan, Laxmikant Pyarelal and Nadeem Shravan.\n|-\n| style=\"background:lightgreen;\" | Jodhaa Akbar\n| 5\n| 9\n| align=\"left\"|\n*Jodhaa Akbar was one of the major award winners, winning five Filmfare Awards, including Best Film, Best Director and  Best Actor.\n|-\n| Love Story 2050\n| 1\n| 0\n| align=\"left\"|\n*Love Story 2050 was the only film which did not receive any nomination under the categories having nominations, and yet won a Filmfare Award.\n*This was the first film of Harry Baweja to win a Filmfare Award.\n|-\n| Mumbai Meri Jaan\n| 2\n| 2\n| align=\"left\"|\n*This was the Bollywood debut for director Nishikant Kamat. He had previously directed films for Marathi and Tamil cinema.\n*It later went on to win the National Film Award for Best Special Effects, which went to Govardhan of Tata Elxsi.\n|-\n| Oye Lucky! Lucky Oye!\n| 3\n| 2\n| align=\"left\"|\n*Manu Rishi won his first ever Filmfare award for Oye Lucky! Lucky Oye!, winning the Filmfare Award for Best Dialogue.\n*This film became the largest Filmfare Award-winning Dibakar Banerjee, ahead of Khosla Ka Ghosla, which had won one Filmfare Award.\n*Manjot Singh received his first award ever for his critically appreciated role in the film, winning the Best Actor (Critics).\n|-\n| style=\"background:lightyellow;\" | Rab Ne Bana Di Jodi\n| 2\n| 10\n| align=\"left\"|\n*This was the debut film for actress Anushka Sharma. She was subsequently nominated for Filmfare Award for Best Female Debut, but lost out to Asin Thottumkal.\n*Shah Rukh Khan did not win an award for the first time under a film directed by Aditya Chopra. He had previously won for Dilwale Dulhaniya Le Jayenge (1995) and Mohabbatein (2000).\n|-\n| style=\"background:lightyellow;\" | Rock On!!\n| 5\n| 10\n| align=\"left\"|\n*Arjun Rampal won his first ever Filmfare Award (Filmfare Award for Best Supporting Actor) for his role in this film.\n*Farhan Akhtar debuted both as a playback singer and as an actor in this film. Subsequently, he won the Filmfare Award for Best Male Debut, and also received a nomination for Filmfare Award for Best Male Playback Singer.\n*Shahana Goswami received the Filmfare Award for Best Actress (Critics), and became the first actress to achieve this honour for a supporting role.\n|-\n| Singh Is Kinng\n| 1\n| 2\n| align=\"left\"|\n|}\nSee also\n* List of highest-grossing Bollywood films\nReferences"
    }
  ]
}