{
  "content": [
    {
      "type": "text",
      "text": "# 55th GMA Dove Awards\n\n| network          = TBN (October 4, 2024 at 8 p.m. ET)\n| runtime          =\n| viewership       =\n| producer         =\n| director         =\n| previous         = 54th\n| main             =\n| next             = 56th\n}}\nThe 55th Annual GMA Dove Awards presentation ceremony was held on Tuesday, October 1, 2024,  at the Allen Arena located in Nashville, Tennessee. The ceremony recognized the accomplishments of musicians and other figures within the Christian music industry for the year 2024. The award ceremony was aired on Trinity Broadcasting Network on Friday, October 4, 2024, at 8PM ET and 10PM ET.\nThe nominees were announced on Tuesday, July 23, 2024. Brandon Lake leads with 16 nominations, followed by songwriter and producer Jeff Pardo who garnered 11 nominations. CeCe Winans and Naomi Raine lead female nominations with five nominations each.\nNominations announcement\nNominees for the 55th GMA Dove Awards were announced on SiriusXM The Message by Tauren Wells, host of the awards ceremony, on July 23, 2024.\nNominees\nThis is a complete list of the nominees for the 55th GMA Dove Awards. Winners are highlighted in bold.\nGeneral\nSong of the Year\n* \"All Things\"\n** \t(writer) Kirk Franklin, (publisher) Aunt Gertrude Music Publishing LLC\n* \"Firm Foundation (He Won't)\"\n** (writers) Cody Carnes, Austin Davis, Chandler Moore, (publishers) Capitol CMG Paragon, Writers Roof Publishing, A.L.K.D. Music, For Humans Publishing, Maverick City Publishing\n* \"Holy Forever\"\n** (writers) Chris Tomlin, Brian Johnson, Jenn Johnson, Jason Ingram, Phil Wickham, (publishers) Capitol CMG Paragon, S.D.G. Publishing, Bethel Music Publishing, Brian And Jenn Publishing, Simply Global Songs, Phil Wickham Music, Be Essential Songs, My Magnolia Music\n* \"I Believe It (The Life of Jesus)\"\n** (writers) Jon Reddick, Daniel Carson, David Leonard, Jess Cates, Jonathan Smith, (publishers) B Reddi Music, House Of Emack Music, Zoom Out Songs, TIM Tunes Music, Capitol CMG Amplifier, Be Essential Songs, Shout It, Storied Journey Songs, So Essential Tunes, Hickory Bill Doc, Hyatt Street Publishing, Integrity's Praise! Music, Cashagamble Jet Music, Simply Global Songs, Daniel Carson Songs, Capitol CMG Genesis, COTC Worship\n* \"More Than Able\"\n** (writers) Chandler Moore, Ben Fielding, Steven Furtick, Naomi Raine, (publishers) Music By Elevation Worship Publishing, Maverick City Publishing, For Humans Publishing, Chandler Moore Publishing Designee, Naomi Raine Publishing Designee, SHOUT! MP Brio, Be Essential Songs, Capitol CMG Paragon\n* \"Praise\"\n** (writers) Chris Brown, Brandon Lake, Chandler Moore, Steven Furtick, Pat Barrett, Cody Carnes, (publishers) Music By Elevation Worship Publishing, Be Essential Songs, Maverick City Publishing, For Humans Publishing, Maverick City Publishing Worldwide, Heritage Worship Publishing, House fires Sounds, Capitol CMG Genesis, Capitol CMG Paragon, Writers Roof Publishing\n* \"Praise You Anywhere\"\n** (writers) Brandon Lake, Ben Fielding, Jacob Sooter, Hank Bentley, (publishers) Brandon Lake Music, Just When Publishing, So Essential Tunes, SHOUT! MP Brio, Songs By That Dog Will Hunt, Capitol CMG Paragon\n* \"Thank God I Do\"\n** (writers) Lauren Daigle, Jason Ingram, P!nk, Jeffrey Bhasker, Nate Ruess, (publishers) Centricity Songs, Capitol CMG Paragon, Be Essential Songs, My Magnolia Music, Way Above Music, EMI Blackwood Music Inc., P!nk Inside Publishing, FBR Music, Bearvon Music, WC Music Corp., Pubalicious, Sony Story Music Publishing, Sony Songs LLC\n* \"This Is Our God\"\n** (writers) Phil Wickham, Steven Furtick, Brandon Lake, Pat Barrett, (publishers) Phil Wickham Music, Simply Global Songs, Be Essential Songs, Music By Elevation Worship Publishing, All Essential Music, Brandon Lake Music, Maverick City Publishing Worldwide, Capitol CMG Genesis, House fires Sounds\n* \"Trust in God\"\n** (writers) Chris Brown, Steven Furtick, Brandon Lake, Mitch Wong, (publishers) Music By Elevation Worship Publishing, Be Essential Songs, Maverick City Publishing Worldwide, Heritage Worship Publishing, Integrity's Praise! Music, A Wong Made Right Publishing\nSongwriter of the Year - Artist\n* Brandon Lake\n* Chandler Moore\n* Chris Brown\n* Cody Carnes\n* Naomi Raine\n* Phil Wickham\nSongwriter of the Year - Non Artist\n* Ben Fielding\n* Brian Johnson\n* Hank Bentley\n* Jason Ingram\n* Jeff Pardo\nArtist of the Year\n* Anne Wilson\n** (record label) Fair Trade Music\n* Brandon Lake\n** (record label) Provident Entertainment\n* CeCe Winans\n** (record label) Fair Trade\n* For King & Country\n** (record label) Curb  Word Entertainment\n* Lauren Daigle\n** (record label) Centricity Music\nNew Artist of the Year\n* Charity Gayle\n** (record label) Blue Duck Records/The Fuel Music\n* Forrest Frank\n** (record label) 10K Projects\n* Josiah Queen\n** (record label) Josiah Queen Music\n* Seph Schlueter\n** (record label) Provident Entertainment\n* Terrian\n** (record label) Gotee Records\nProducer of the Year\n* David Leonard\n* Hank Bentley\n* Jeff Pardo\n* Jonathan Jay\n* Jonathan Smith\nRap/Hip Hop\nRap/Hip Hop Recorded Song of the Year\n* '''\"Love Like That\" – Hulvey (featuring Torey D'Shaun, Alex Jean)\n** (writers) Hulvey, Torey D'Shaun, ACE, Andrew Jason Prim, Juice Cuice, Jaden Owens, Stevie Rizo\n* \"IGWT\" – Jon Keith, KB\n** (writers) Jon Keith, KB\n* \"Miracles\" – KB, Lecrae\n** (writers) KB, Lecrae, Brandon Lake, Steven Furtick, Chris Brown, Quinten Coblentz, Wes Writer\n* \"In the Light\" – Anike (fka Wande)\n** (writers) Anike (fka Wande), Deandre Hunter, Jordan Dollar, Alexandria Dollar, Jeffrey Shannon, David Crooms, Rickey Offord\n* \"Hard Work God First\" – Zauntee\n** (writers) Zauntee\nRap/Hip Hop Album of the Year'\n* Low Blow – Indie Tribe\n** (producers) Mogli the Iceburg, Jon Keith, 1995, Enzo Gran, Carvello, MIXEDBYAC, Scootie Wop, WAUI, wow eli, Nate Rose, IMMORTAL, BMTJ, BLK JCKX\n* 'His Glory Alone II\t – KB\n** (producers) KB, WEARETHEGOOD, Scootie Wop, Cardec Drums, Quinten Coblentz, Maurice Fonville, Dayshawn Mojica, Carvello, Tbabz'\n* Everyone Loves A Comeback Story: Platinum Edition – Social Club Misfits\n** (producers) Grant Lapointe, Martin Santiago, Andy Mineo, Enzo Gran, Samuel Ash, Sajan Nauriyal, Juicebangers, Ben Lopez, Isaiah LaRoi, Elxjah, Josh Cumbee, David Frank, Dave James, Rey King, Avxp, Zach Paradis, Carvello, Gabe Payne\n* The Epilogue. – Trip Lee\n** (producers) Trip Lee, Mashell, Elkan, Enzo Gran, Alexandria Dollar, Jordan Dollar, ACE, Joel McNeill\n* We Already Won'' – Zauntee\n** (producers) Zauntee, Goose, Waylo\nRock/Contemporary\nRock/Contemporary Recorded Song of the Year\n* \"Count 'Em\" – Brandon Lake\n** (writers) Brandon Lake, Jacob Sooter, Hank Bentley\n* \"Faith!?\" – Chris Renzema\n** (writers) Chris Renzema, Hank Bentley\n* \"Grave Robber\" – Crowder\n** (writers) Caleb Ward, Jordan Ward, Iveth Luna\n* \"Whatever It Takes\" – Stephen Stanley\n** (writers) Stephen Stanley, Zach Epps, Jud Harris, Tedd T, Paul Duncan\n* \"Flowers Dressed in Blue\" – Strings and Heart\n** (writer) Angelo Espinosa\nRock/Contemporary Album of the Year\n* 'Manna – Chris Renzema\n** (producers) Chris Renzema, Hank Bentley'\n* ''I Can't Find the Edges of You (Deluxe) – Citizens\n** (producers) Zach Bolen, Cason Cooley, Brian Eichelberger, Ben Cantelon\n* Kenotic Metanoia – Lacey Sturm\n** (producers) Josh Sturm, Evan Rodaniche\n* Divided Frame of Mind – Stephen Stanley\n** (producers) Stephen Stanley, Jake Halm, Tedd T, Mitch Parks, Jeff Pardo, Tommee Profitt\n* 'The Beautiful Letdown (Our Version) [Deluxe Edition] – Switchfoot\n** (producers) The Foreman Brothers, Andy D. Park, Jake Sherman, Dave Hagen, Ben Shive, John Metcalfe, Johnny Simpson, Jon Bellion, Pete Nappi, John Fields, Owl City, Sam Ellis, Dayglow, Tyler Joseph, Boaz Roberts\nPop/Contemporary\nPop/Contemporary Recorded Song of the Year\n* \"Strong\" – Anne Wilson\n** (writers) Anne Wilson, Jeff Pardo, Matthew West\n* \"Any More\" – Cain\n** (writers) Logan Cain, Madison Cain, Taylor Cain, Matthew West, Jeff Pardo\n* \"Good Day\" – Forrest Frank\n** (writer) Forrest Frank\n* \"The Prodigal\" – Josiah Queen\n** (writers) Josiah Queen, Jared Marc\n* \"Counting My Blessings\" – Seph Schlueter\n** (writers) Seph Schlueter, Jonathan Gamble, Jordan Sapp\nPop/Contemporary Album of the Year\n* 'Coat of Many Colors – Brandon Lake\n** (producers) Jonathan Smith, Jacob Sooter, Hank Bentley, Micah Nichols, Joe Laporta'\n* Jesus Music – Cain\n** (producers) Jonathan Smith, Jeff Pardo, AJ Pruis, David Leonard\n* Unsung Hero: The Inspired By Soundtrack – For King & Country\n** (producers) For King & Country, Ben Glover, Dayme, Federico Vindver, Jacob Halm, Jeff Sojka, Matt Hales, Seth Mosley, Tedd T\n* Lauren Daigle – Lauren Daigle\n** (producers) Mike Elizondo, Jon Green, Tofer Brown, Tedd T\n* Joy In the Morning (Horizon Edition) – Tauren Wells\n** (producers) Tauren Wells, Tedd T, Colby Wedgeworth, Chuck Butler, Bernie Herms, Chris Strawder, Christopher Stevens, Gabe Simon, Luis Higuera, William Garrett, Jordan Sapp, Mitchell Solarek\nInspirational\nInspirational Recorded Song of the Year\n* \"Center of My Joy\" – CeCe Winans, Gaither\n** (writers) Bill Gaither, Gloria Gaither, Richard Smallwood\n* \"In Christ Alone (Live from Sydney)\" – CityAlight, Keith & Kristyn Getty\n** (writers) Keith Getty, Stuart Townend\n* \"My Tribute (To God Be the Glory)\" – Natalie Grant (featuring CeCe Winans)\n** (writer) Andrae Crouch\n* \"Higher Name\" – Selah\n** (writers) Allan Hall, Derek Winkley, Todd Smith\n* \"Like Jesus Can\" – TaRanda Greene\n** (writers) TaRanda Greene, Wayne Haun, Joel Lindsey\nInspirational Album of the Year\n* Revelation – David & Nicole Binion\n** (producers) David Binion, Daniel Lopez\n* 'Autobiography – Joseph Habedank\n** (producers) Nick Scwarz, David Leonard, Bernie Herms'\n* Our God Will Go Before Us - The Hymns of Matt Boswell and Matt Papa, Vol 3 – Matt Boswell, Matt Papa\n** (producer) Nathan Nockels\n* Tell Someone – TrueSong\n** (producer) Jason Kyle Saetveit\n* Amazing Grace: Hymns and Gospel Classics (Live) – Wintley Phipps\n** (producer) Wintley Phipps\nSouthern Gospel\nSouthern Gospel Recorded Song of the Year\n* \"Until We Fly Away\" – Ernie Haase & Signature Sound\n** (writers) Joel Lindsey, Pam Thum\n* \"Make the Morning Worth the Midnight\" – Gaither Vocal Band\n** (writers) Bill Gaither, Larry Gatlin\n* \"Here Comes Jesus\" – Jeff & Sheri Easter (featuring Mo Pitney)\n** (writers) Mo Pitney, Bobby Tomberlin, Wil Nance\n* \"Sheaves (Dedicated to Isabel)\" – Karen Peck & New River\n** (writers) Karen Peck Gooch, Dave Clark, Michael Farren\n* \"Unstoppable God\" – Kingsmen\n** (writers) Kenna Turner West, Christopher Bryant, Jason Cox\nSouthern Gospel Album of the Year\n* 'Live In Amsterdam – Ernie Haase & Signature Sound\n** (producers) Wayne Haun, Ernie Haase'\n* Shine (Darker The Night, Brighter The Light) – Gaither Vocal Band\n** (producer) Bill Gaither, Gordon Mote, Nick Schwarz\n* Where You Lead Me – Gordon Mote\n** (producers) Gordon Mote, Wayne Haun\n* 25 – Legacy Five\n** (producers) Wayne Haun, Kris Crunk\n* Quartet Tribute, Vol 3 – Triumphant Quartet\n** (producer) Gerald Wolfe\nBluegrass/Country/Roots\nBluegrass/Country/Roots Recorded Song of the Year\n* \"Praying Woman\" – Anne Wilson (featuring Lainey Wilson)\n** (writers) Anne Wilson, Lainey Wilson, Matthew West, Jeff Pardo, Trannie Anderson\n* \"If I Got Jesus\" – Ben Fuller\n** (writers) Ben Fuller, Ethan Hulse, Jeff Pardo\n* \"Tell the Devil\" – Joseph Habedank\n** (writers) Joseph Habedank, Ethan Hulse, Nick Schwarz\n* \"Man On The Middle Cross\" – Rhett Walker\n** (writers)  Rhett Walker, AJ Pruis, Matthew West, Matt Jenkins\n* '\"Lookin' For You\" – Zach Williams, featuring Dolly Parton\n** (writers) Zach Williams, Jonathan Smith, Tony Wood\nBluegrass/Country/Roots Album of the Year\n* Rebel – Anne Wilson\n** (producers) Jeff Pardo, Jonathan Smith, Zach Kale'\n* The Gospel Sessions, Vol 2 – Authentic Unlimited\n** (producers) Authentic Unlimited\n* Pioneer – Cory Asbury\n** (producers) Paul Mabury\n* Gaither Tribute: Award Winning Artists Honor The Songs of Bill & Gloria Gaither – Gaither\n** (producers) Tony Brown, Michael Sykes, Charles English, Alabama, Rob Galbraith, Ronnie Milsap, Thomas Hardin Jr., Tyrone Jackson\n* Country Chapel – Travis Tritt\n** (producer) Dave Cobb\nContemporary Gospel\nContemporary Gospel Recorded Song of the Year\n* \"Able\" – Jonathan McReynolds (featuring Marvin Winans)\n** (writers) Jonathan McReynolds, Marvin Winans, Darhyl Camper Jr., Demetrius Terrell Wilson, Major Johnson Finley, Tre\n* \"All Things\" – Kirk Franklin\n** (writer) Kirk Franklin\n* \"Look At God\" – Koryn Hawthorne\n** (writers) Charles Jenkins, Christopher Gales, Isaiah Campbell, Koryn Hawthorne, Munson Steed\n* \"God Problems\" – Maverick City Music (featuring Naomi Raine, Chandler Moore)\n** (writers) Naomi Raine, Chris Davenport, Daniel Bashta, Ryan Ellis\n* \"Only One Night Tho (Radio Edit) [Live]\" – Tye Tribbett\n** (writer) Tyrone Tribbett II\nContemporary Gospel Album of the Year\n* Affirmations – Anthony Brown & Group Therapy\n** (producers) Anthony Brown, Darryl Woodson, Justin Savage, William McMillian\n* Note to Self – DOE\n** (producers) DOE, Tommy Iceland, LiLMaN, Judah Jones, Rogest Carstarpen Jr., Slikk Muzik, Juan Winans, Kelby On The Track, Jonathan McReynolds, Jonathan Crone, David Leonard, Isaia Huron\n* I Love You – Erica Campbell\n** (producers) Warryn Campbell, Wozy Campbell\n* '''Father's Day – Kirk Franklin\n** (producers) Kirk Franklin, KP, Maxwell Stark, Devin Morrison, Ron Hill, JP, D Bizzy, Chandler Moore'\n* On God – Koryn Hawthorne\n** (producers) J White Did It, Lil Ronnie, Retro D, Munson Steed, Xavier Wright, Pyro, Charles Jenkins\nTraditional Gospel\nTraditional Gospel Recorded Song of the Year\n* \"I Believe God\" – Jekalyn Carr\n** (writers) Jekalyn Carr\n* \"God Is (Radio Edit)\" – Melvin Crispell III\n** (writers) Robert J. Fryson\n* \"When I Think (Live)\" – Ricky Dillard\n** (writers) Derrick Hall, Richard Smallwood, Ricky Dillard\n* \"In My Name\" – Smokie Norful\n** (writer) Percy Bady\n* \"Burdens Down (Live)\" – Tasha Cobbs Leonard\n** (writer) Tasha Cobbs Leonard\nTraditional Gospel Album of the Year\n* Jekalyn – Jekalyn Carr\n** (producer) Jekalyn Carr\n* He Loves Me – Maurette Brown Clark\n** (producers) Kenneth Shelton, Anthony Brown\n* 'No Failure – Melvin Crispell III\n** (producers) Dontaniel Jamel Kimbrough'\n* Choirmaster II (Live) – Ricky Dillard\n** (producers) Quadrius Salters, Zeke Listenbee, Ricky Dillard\n* Chapter X: See The Goodness – VaShawn Mitchell\n** (producers) VaShawn Mitchell, Thomas Hardin Jr.\nGospel Worship\nGospel Worship Recorded Song of the Year\n* \"That's My King\" – CeCe Winans\n** (writers) Taylor Agan, Lloyd Nicks, Kellie Gamble, Jess Russ\n* \"Lead Us Again\" – DOE\n** (writers) DOE, Ethan Hulse, Tommy Iceland\n* \"All Yours\" – Kierra Sheard (featuring Anthony Brown)\n** (writers) Kierra Sheard, J. Drew Sheard II, Anthony Brown\n* \"Fill the Room\" – Michael Bethany\n** (writers) Michael Bethany, Zac Rowe, KJ Scriven\n* '''\"The Story I'll Tell (Live)\" – Naomi Raine\n** (writers) Alton Eugene, Benji Cowart, Naomi Raine\nGospel Worship Album of the Year\n* More Than This – CeCe Winans\n** (producers) Kyle Lee'\n* The Maverick Way Complete – Maverick City Music\n** (producers) Brunes Charles, Norman Gyamfi, Jonathan Jay\n* Overflow – Michael Bethany\n** (producers) Ryan Rich, Kyle Lee\n* Cover the Earth (Live in New York) – Naomi Raine\n** (producer) Adale Jackson\n* The Journey – Todd Dulaney\n** (producers) Todd Dulaney, Dontaniel Jamel Kimbrough\nSpanish Language\nSpanish Language Recorded Song of the Year\n* '\"Tantas Historias\" – Christine D'Clario\n** (writers) Christine D'Clario, Jordan Sapp, Jonathan Gamble\n* \"Donante de Sangre\" – Daddy Yankee\n** (writer) Daddy Yankee\n* \"Danza\" – KB, Niko Eme, Cardec Drums\n** (writers) KB, Niko Eme, Cardec Drums, James McCurdy\n* \"Amen\" – Nacho (featuring Gilberto Daza, Alex Zurdo)\n** (writers) Nacho, Gilberto Daza, Alex Zurdo, Erasmo Huerta, Hernan Jose Portillo, Homero Gallardo, Juan Camilo Escorcia, Pablo Rodriguez\n* \"Babel\" – Un Corazon\n** (writers) Kim Richards, Kevin Richards, Steven Richards, Lluvia Richards\nSpanish Language Worship Recorded Song of the Year'''\n* \"Holy Forever (Espanol)\" – Chris Tomlin, Miel San Marcos\n** (writers) Chris Tomlin, Brian Johnson, Jenn Johnson, Phil Wickham, Jason Ingram\n* \"Tu Presencia Es Mi Jardin\" – Daniel Calveti, Melody Adorno\n** (writers) Daniel Calveti, Douglas D'Lima, Richeld Vilchez, Sinai Urdaneta, Yao D'Lima\n* \"Alaba\" – Elevation Worship, Elevation Espanol, Unified Sound\n** (writers) Steven Furtick, Chris Brown, Chandler Moore, Brandon Lake, Pat Barrett, Cody Carnes\n* \"Tu Amor No Tiene Fin (Correr A Tus Brazos)\" – Generacion 12, Gateway Worship Espanol\n** (writers) Lorena Castellanos, Johann Manjarres, Fernando Ramos, Anthony Catacoli, Willy Gonzalez, Christine D'Clario\n* \"Hermoso Momento (Sesion Acustica)\" – Kairo Worship\n** (writers) Laurelys Castillo Prensa, Emmanuel Encarnacion, Challenge Salcedo\nSpanish Language Album of the Year\n* A Las Naciones – Christ For The Nations Worship\n** (producers) David Quintana, Robert Quintana, Jorginho Araujo\n* La Mesa – Daniel Calveti\n** (producers) Daniel Calveti, Shari Calveti, Isaac Calveti, Natan Calveti, Daniela Calveti, Luigi Prince, Roberto Bautista\n* Cvrbon Vrmor (C_DE: G_D.O.N.) – Farruko\n** (producers) Sharo Towers, Ghetto, K4G, J. Cross, K LO K, Chris The Genius, IAMCHINO\n* 'Evangelio (En Vivo) – Miel San Marcos\n** (producers) osh Morales, Luis Morales Jr., Samy Morales, Jeffrey Barrera, Chris Rocha, Roberto Prado'\n* Se Fuerte – Sarai Rivera\n** (producer) Steven Richards\nWorship\nWorship Recorded Song of the Year\n* \"Praise You Anywhere\" – Brandon Lake\n** (writers) Brandon Lake, Ben Fielding, Jacob Sooter, Hank Bentley\n* \"Firm Foundation (He Won't) [Live]\" – Cody Carnes\n** (writers) Cody Carnes, Austin Davis, Chandler Moore\n* \"Praise\" – Elevation Worship (featuring Brandon Lake, Chris Brown, Chandler Moore)\n** (writers) Chris Brown, Brandon Lake, Chandler Moore, Steven Furtick, Pat Barrett, Cody Carnes\n* \"Trust in God\" – Elevation Worship (featuring Chris Brown)\n** (writers) Chris Brown, Steven Furtick, Brandon Lake, Mitch Wong\n* \"I Believe\" – Phil Wickham\n** (writers) Phil Wickham, Jonathan Smith, Chris Davenport\nWorship Album of the Year\n* Eight – Brooke Ligertwood\n** (producers) Brooke Ligertwood, Jason Ingram\n* Firm Foundation (Live) – Cody Carnes\n** (producers) Aaron Robertson, Austin Davis, Jeff Pardo\n* Can You Imagine? – Cain\n** (producers) Steven Furtick, Chris Brown, Jacob Sooter, Chandler Moore\n* 'I Believe – Phil Wickham\n** (producer) Jonathan Smith'\n* Ascend – Red Rocks Worship\n** (producer) Aaron Robertson\nChristmas / Special Event\nChristmas Recorded Song Of The Year\n* \"Joy!\" – Elevation Rhythm\n** (writers) Joshua Holiday, Davide Mutendji, Isaac Watts\n* \"Go Tell It on the Mountain (Rewrapped)\" – For King & Country (featuring Gabby Barrett)\n** (writer) Joel Smallbone, Luke Smallbone, Benjamin Backus, Tedd T, John Wesley Work Jr.\n* \"Because of Bethlehem\" – Matthew West\n** (writer) Matthew West\n* \"Manger Throne\" – Phil Wickham\n** (writer) Phil Wickham\n* \"Christmas Hits Different\" – TobyMac, Tasha Layton\n** (writers) TobyMac, Dave Lubben\nChristmas / Special Event Album of the Year\n* 'Lifesongs: A Celebration of the First 20 Years – Casting Crowns\n** (producers) Jonathan Smith, Jeff Pardo, Josh Auer, CHPTRS, Mark Miller, Keith Smith, Keith Thomas, Brad King, David Leonard, AJ Pruis, Jason Hoard, Brent Milligan, Chad Judd, Kuk Harrell, Chuck Butler, Paul Moak, Bernie Herms, Jeremy Redmon'\n* Echo the Angels – Elevation Worship\n** (producers) Aaron Robertson, Chris Brown, Joshua Holiday, Scott Gardner\n* Every Christmas – Michael W. Smith\n** (producers) Michael W. Smith, Tyler Michael Smith, Mark Campbell, David Hamilton\n* This is Christmas (Live From Fisher Center) – Tasha Layton\n** (producer) Keith Smith\n* The Birth of a King (Live) – Tommee Profitt\n** (producer) Tommee Profitt\nOther categories\n'''Children's Recorded Song Of The Year\n* \"Los Libros De La Biblia\" – Pequenos Heroes\n** (writer) Jairo Zuluaga\n* \"Great Is Thy Faithfulness (No Matter What)\" – Semsen Music\n** (writer) Christy Semsen, Aaron Stewart, Keith Hill\n* \"Every Move I Make - 2023 Version\" – Shout Praises Kids\n** (writer) David Ruis\n* \"Jesus Calms the Storm (Hymn for Anxious Little Hearts)\" – The Getty Girls, Keith & Kristyn Getty, Sandra McCracken (featuring Joni Eareckson Tada)\n** (writers) Matt Boswell, Bryan Fowler, Kristyn Getty, Sandra McCracken, Matt Papa\n* \"Holy Forever\" – Yancy\n** (writers) Chris Tomlin, Brian Johnson, Jason Ingram, Jenn Johnson, Phil Wickham\nMusical/Choral Collection of the Year'\n* Behold\n** (creator/arranger) John Bolin, (orchestrator) Cliff Duren\n* My King is Known By Love\n** (arranger/orchestrator) Russell Mauldin, (creators) Sue C. Smith, Lee Black, Jason Cox, Russell Mauldin, Johnathan Crumpton\n* Rejoice\n** (creators) Charity Gayle, Bradley Knight, (arranger/orchestrator) Bradley Knight\n* Snow Globe\n** (creator) Jeff Bumgardner, Houstons First Worship (arrangers) Eric Belvin, Cliff Duren, Wayne Haun, Alfredo Salmeron, Daniel Semsen, (orchestrator) Tim Cates\n* You've Already Won\n** (arranger/orchestrator) Jay Rouse\nRecorded Music Packaging of the Year\n* The Heartbreak and the Healing (Deluxe Edition) – Blanca\n** (art director) Blair McDermott, (graphic artists) Mackenzie K. Moore, Gabe Azucena\n* Coat of Many Colors – Brandon Lake\n** (art directors) Brandon Lake, Rachel Mulcahy, Tim Parker, (graphic artist) Tim Parker, (photographers) Paul C. Rivera, Jeremy Cowart\n* 'Jesus Music – Cain\n** (art directors) Rachel Mulcahy, Tim Parker, (graphic artists) Madison Cain, Taylor Cain, Tim Parker, (photographers) Maddox Fowler, Rachel Mulcahy'\n* Made for More (Live) – Josh Baldwin\n** (art directors/graphic artists/illustrators/photographers) Christian Ostrom, Brady Gibson, Roxy Moure\n* Shelter'' – Pat Barrett\n** (art directors) Jay Argaet, Caleb Nietschke, (graphic artists) Caleb Nietschke, Luke Hastings, Hannah Hastings, Yasmeen Audrelia, (photographer) Paul C. Rivera\nVideos and films\nShort Form Video of the Year (Concept)\n* \"Count 'Em\" – Brandon Lake\n** (director/producer) Noah Taher, (producer) Blaine Fuhs\n* \"Kind\" – Cory Asbury\n** (directors/producers) Kaiser Cunningham, Taylor Kelly\n* \"What Are We Waiting For? (The Single)\" – For King & Country\n** (directors) Joel Smallbone, Kadin Tooley, (producers) Josh Walsh, Chico\n* \"Hold On\" – Katy Nichole\n** (director) Nathan Schneider, (producer) Joshua Wurzelbacher\n* \"Faithfully\" – TobyMac\n** (director) Eric Welch, (producers) Eric Welch, Scott McDaniel\nShort Form Video of the Year (Performance)\n* \"Coat of Many Colors\" – Brandon Lake\n** (Director/ Producer) Noah Taher, (Producer) Rachel Mulcahy\n* \"Any More\" – Cain\n** (director/producer) Preston Leatherman, (producer) Mckinnis Calderala\n* \"Danza\" – KB, Niko Eme, Cardec Drums\n** (directors) Cobe Grandstaff, Karsten Winegeart\n* \"Joy (The Choir Room Version)\" – The Choir Room, Ben Rector\n** (director) Hunter West, (producers) Hunter West, Adam Taylor, Finn Johnston\n* \"In the Light\" – Anike (fka Wande)\n** (director/producer) The Colemans\nLong Form Video of the Year\n* Firm Foundation (Live) – Cody Carnes\n** (director) Mait Hudson, (producer) Jacob Boyles\n* Can You Imagine? – Elevation Worship\n** (director) Chris Dobson, (producers) Chris Brown, Jacob Boyles, Kathleen Jurado\n* Celebrare – Gateway Worship Español\n** (Directors/ Producers) Jakob Serban, Paul Trimble\n* Come Home for Christmas – Matthew West\n** (directors/producers) Russ Hall, Kim White, Elizabeth Suter, Mike Termale, Matthew West, Maggie Laws\n* 'Steven Curtis Chapman: The Great Adventure – Steven Curtis Chapman\n** (directors/producers) Russ Hall, Angelea Floyd, Elizabeth Suter, Alex Whiten, Greg Ham, Kim White, Mike Termale\nFeature Film of the Year'\n* Journey to Bethlehem\n** (director/producer) Adam Anders, (producers) Brandt Andersen, Steve Barnett, Ryan Busse, Stephen Meinen, Alan Powell\n* Ordinary Angels\n** (director) Jon Gunn, (producers) Kevin Downes, Andrew Erwin, Jon Erwin, Jon Berg, Roy Lee, Dave Matthews, Johnathan Dorfman, Sarah Johnson, David Beal\n* Sound of Freedom\n** (director) Alejandro Monteverde, (producer) Eduardo Verastegui\n* The Blind\n** (director) Andrew Hyatt, (producer) Zach Dasher, Korie Robertson, Bob Katz, Brittany Yost, Cole Prine\n* Unsung Hero\n** (directors) Richard Ramsey, Joel Smallbone, (producers) Joel Smallbone, Josh Walsh, Luke Smallbone, Justin Tolley\nTelevision Series of the Year\n* Chasing CAIN\n** (director/producer) Daric Gates, (Producer) Alexander J. Wysocki, Marcus Lopez\n* God. Family. Football.\n** (producer) Aaron Benward\n* Jonathan & Jesus\n** (director) Daniel H.A. Stewart, (producers) Josh Huculiak, Dylan Jenkinson, Katherine Warnock\n* The Wingfeather Saga\n** (director) John Sanford (producer) J. Chris Wall\nReferences\nExternal links\n* [https://doveawards.com/ Official Website]"
    }
  ]
}