{
  "content": [
    {
      "type": "text",
      "text": "# 5th Ward of New Orleans\n\n|frame=yes|text=Map of ward boundary}}\nMardi Gras Indians along Bayou St. John\nThe 5th Ward or Fifth Ward is a division of the city of New Orleans, Louisiana, one of the 17 wards of New Orleans.\nBoundaries\nThe roughly L-shaped ward stretches through the city from the Mississippi River to Lake Pontchartrain. The lower boundary is St. Philip Street, across which is the 6th Ward. The ward boundary then follows Bayou St. John, which back from Esplanade Avenue has the 7th Ward on the other side. The Upper boundary is St. Louis Street, across which is the 4th Ward. The boundary continues on a straight line of St. Louis to City Park Avenue (formerly Bayou Metairie Road), where it curves down to Orleans. It then follows the Orleans Canal route north to the Lake.\nCityscape and landmarks\nThe ward includes some of the earliest and most famous portions of New Orleans settled in colonial times. The riverfront, long busy docks, is now the \"Moonwalk\", a pleasant park along the Mississippi. Just above the Moonwalk is Café du Monde, below it the old Jax Brewery building, converted into an upscale shopping mall. Across Decatur Street is Jackson Square, the heart of the old French Quarter, surrounded by historic buildings. Further back, past the shops and galleries of Royal Street and the bars and clubs of Bourbon Street, is still a primarily residential section of the Quarter. Such famous music venues as Preservation Hall and Donna's are in the portion of the Quarter in the 5th Ward.\nAcross Rampart Street is Louis Armstrong Park and the Municipal Auditorium, site of many Carnival balls. The ward includes the old route of the historic Carondelet Canal, now filled in. The Lafitte Projects along Orleans Avenue were closed in the aftermath of Hurricane Katrina. The area around Bayou St. John and Orleans is a famous gathering place for the Downtown Mardi Gras Indian tribes. Across the Bayou, the old American Can Factory building was renovated into apartments and shops at the end of the 20th century. Continuing back, the ward includes a slice of Mid-City New Orleans. Turning north, the ward includes all of City Park, the former site of the Old Spanish Fort, and the upscale Lake Vista neighborhood, and finally a section of Lakeshore Park.\nReferences"
    }
  ]
}