{
  "content": [
    {
      "type": "text",
      "text": "# 5th Searchlight Brigade (United Kingdom)\n\n|allegiance=\n|branch= British Army\n|type=Anti-Aircraft Brigade\n|role=Air Defence\n|size=\n|command_structure= British Expeditionary ForceAnti-Aircraft Command\n|current_commander=\n|garrison=\n|ceremonial_chief=\n|colonel_of_the_regiment=\n|nickname=\n|patron=\n|motto=\n|colors=\n|march=\n|mascot=\n|battles=Battle of FranceDunkirk evacuationThe BlitzOperation Diver\n|notable_commanders=\n|anniversaries=\n}}\nThe 5th Anti-Aircraft Brigade (5 AA Bde) was an air defence formation of the British Army during the Second World War. It was formed as a searchlight brigade to protect the British Expeditionary Force's bases just before the Battle of France. After the Dunkirk evacuation it was reformed as a conventional anti-aircraft (AA) brigade and served through the rest of the war in Anti-Aircraft Command, defending various parts of the United Kingdom against bombing raids and V-1 flying bombs. It continued to serve in the Regular Army during the early postwar years.\nOrigin\nAs the British Expeditionary Force (BEF) in France expanded during the Phoney War period, new headquarters (HQs) were formed to control the various groups of AA guns and searchlights (S/Ls) of the Royal Artillery  (RA) and Royal Engineers (RE) that were deployed to defend its field formations and base installations. 5th AA Brigade HQ was formed at Blackdown on 2 February, redesignated 5th Searchlight Brigade on 6 April, and sent to France shortly before the Battle of France began on 10 May. Its commander was Brigadier Edmund Rait-Kerr,  RE, who had been commandant of the Army's School of Electric Lighting at Gosport. Coming directly under General Headquarters (GHQ) the brigade's role was to administer the S/L units deployed to protect airfields, ports, and the BEF's forward gun areas.\nOrder of Battle May 1940\nAt the beginning of the Battle of France the brigade had the following composition:\n* 1st Searchlight Regiment, Royal Artillery – Regular Army\n** 1, 2, 3, 4 S/L Batteries – 1 and 2 Btys were newly arrived, replacing RE companies\n* 2nd Searchlight Regiment, RA – Regular Army\n** 5, 6, 8 S/L Btys\n* 3rd (Ulster) Searchlight Regiment, RA – Supplementary Reserve\n** 9, 10, 11, 12 S/L Btys\nBattle of France\nWhen the Battle of France began on 10 May, the BEF started its planned advance north into Belgium (Plan D), but the German Army broke through the Ardennes to the east, forcing the BEF to withdraw again. 1st and 3rd Searchlight Batteries were ordered to hold the bridges on the La Bassée–Béthune Canal 'at all costs' against attacks from the south. They deployed their Boys anti-tank rifles and Bren guns, using S/L lorries as roadblocks, while French forces withdrew through them. The towns were bombed and S/L positions were machine-gunned by Luftwaffe fighters. 4th Searchlight Bty, deployed round Lille, saw constant enemy air activity. On 17 May it detached a group of riflemen with Boys rifles to defend 5 AA Bde HQ at Lens while the remainder joined the Bethune canal guards. On that day 1st S/L Bty was ordered back to Calais, a move made difficult because all the roads were choked with refugees. There it operated in the S/L role to defend the port.\nMeanwhile, Army Group A had cut the BEF's lines of communication into France and driven it back towards the coast at Dunkirk, cutting off the British troops at Calais and Boulogne from the main force. When planning the evacuation from Dunkirk (Operation Dynamo), the BEF's commanders decided that Calais and Boulogne should still be held as supply points for further fighting or possible exit points for a final withdrawal.\nCalais\nBy 20 May, 1st and 2nd S/L Btys of 1st S/L Rgt, with part of 2nd S/L Rgt, were deployed as a screen of S/L detachments one mile apart round the east side of Calais and Lt-Col Goldney of 1st S/L Rgt was appointed AA Defence Commander for the town. They were joined on 22 May by 30th Infantry Brigade, just before advanced German troops began probing the defences, beginning the Siege of Calais. On the night of 22/23 May the AA units engaged Luftwaffe raiders that bombed Calais, starting fires. But ground attack was now the biggest danger, and the S/L men had to man the perimeter as infantry, a role for which they (mainly older Territorials, raw militiamen and a few ex-RE reservists) were untrained. Nevertheless, they put up a stout fight, halting tank columns for several hours before they were overwhelmed. The remnants were forced back to the citadel and harbour, where some were evacuated by sea but most became Prisoners of war (PoWs) when the citadel fell on 26 May. The town's three-day defence, holding up Heinz Guderian's XIX Panzerkorps, had provided some respite for the Dunkirk evacuation.\nHondeghem\n2nd Searchlight Rgt was more widely spread. While part went to Calais, a Troop of one officer and 80 men found themselves attached to K Battery, Royal Horse Artillery, with orders to help hold the small village of Hondeghem which was on the main German axis of advance. The gunners fought a valiant action on 26 May then, running short of ammunition, they charged the German positions and broke through, giving them a route out towards Dunkirk. By now, 2nd S/L Rgt had 5 Bty completely missing, 6 Bty had over 50 per cent missing and 8 Bty was missing just under a quarter. By the time the evacuation was complete, the Regiment had lost over 50 men killed and approximately half the regiment captured.\nDunkirk\n3rd (Ulster) Searchlight Rgt fared much better. Its batteries were deployed relatively close together around the Dunkirk perimeter with 12 Bty in the town itself. On 19 May, after some hard fighting often against tanks, the bulk of the regiment was ordered to destroy their searchlights and make for Dunkirk. By 21 May, 9, 10 and 11 Btys were in defensive positions around the port while 12 Bty continued in its S/L role inside the town.  Over the next six days the regiment withstood many attacks from the enemy. Once the decision had been made on 24 May to evacuate, the HQs of 2 AA Bde and 5 AA Bde bore the brunt of AA defence of Dunkirk and the beaches, taking over those remnants of AA units that made their way back to the port. On 27 May 3rd S/L Rgt was relieved; RHQ and 9, 10 and 11 Btys were evacuated to England the next day. Two Troops of 12 Battery were evacuated in small boats the following day, while the rest of the battery was ordered to destroy the remaining lights and assist in the defence of the beaches. They were eventually taken off the beach in small batches by 31 May. 3 (Ulster) S/L Rgt had been very lucky with only 28 killed, 41 wounded and three men taken prisoner.\nHome defence\nOrders were issued on 13 July for the brigade to be reformed (as 5th AA Brigade) in the Gloucester area within 5 AA Division of AA Command. It became a mixed AA formation containing heavy (HAA) and light (LAA) gun units as well as S/L units. The Gloster Aircraft Company factory at Brockworth, Gloucestershire, was a strategic target in the area and was protected by 24 HAA guns.\nOrder of Battle July 1940\nBy about 18 July the reformed HQ had taken over the following units:\n* 85th (Tees) HAA Rgt – returned from Dunkirk and re-equipped with 3.7-inch guns\n* 88th HAA Rgt – newly formed in London with 3.7-inch guns\n* 47th LAA Rgt – newly formed\n* 37th (Tyne Electrical Engineers) S/L Rgt – returned from France\n* 68th S/L Rgt – from 46 AA Bde\nBlitz\nIn November 1940, as the Luftwaffes night bombing campaign against British cities (The Blitz) was getting under way, there was a major reorganisation of AA Command. 5 AA Division's responsibilities were split, with 9 AA Division created to cover the South Midlands and South Wales. 5 AA Brigade came under this new formation, with responsibility for covering Gloucester and Hereford. There were few air raids in 5 AA Bde's area, although the Gloster  works at Brockworth and Hucclecote were targeted. Otherwise, enemy air activity was reported as 'slight' and 'small scale', and was mainly heading towards Birmingham and Coventry in the neighbouring 11 AA Division area, with one raid on Cheltenham on 11 December.\nFrom November 1940 searchlights were deployed in clusters of three lights in an attempt to improve the chances of picking up enemy bombers and keeping them illuminated for engagement by AA guns or Royal Air Force (RAF) night-fighters. Eventually, one light in each cluster was to be equipped with Searchlight Control (SLC) radar and act as 'master light', but the radar equipment was still in short supply.\nOrder of Battle 1940–41\n.]]\nDuring the Blitz, which ended in May 1941, the composition of 5 AA Bde was as follows:\n* 85th (Tees) HAA Rgt\n** 174 HAA Bty – attached to 61 AA Bde until Summer 1941\n** 175 HAA Bty\n** 220 HAA Bty – attached to 45 AA Bde until Summer 1941\n** 413 HAA Bty – joined by May 1941\n* 88th HAA Rgt (part) – transferred to 1 AA Division by May 1941\n* 47th LAA Rgt\n** 66, 131 LAA Btys\n** 85 LAA Bty – attached to 8 AA Division\n* 37th (TEE) S/L Rgt\n** 307, 308, 348, 349 S/L Btys\nMid-War\nIn the summer of 1941, AA Command began to receive purpose-built SLC radar in sufficient numbers to allow some S/Ls to be 'declustered' into single-light sites. These were redeployed into 'Indicator Belts' of radar-controlled S/L clusters covering approaches to the night-fighter sectors, repeated by similar belts covering AA Command's Gun Defence Areas (GDAs). Inside each belt was a 20-mile deep 'Killer Belt' of single S/Ls spaced at  intervals in a 'Killer Belt' cooperating with night-fighters patrolling defined 'boxes'. The pattern was designed to ensure that raids penetrating deeply towards the Midlands GDAs would cross more than one belt, and the GDAs had more S/Ls at close spacing. The number of LAA units to protect Vital Points (VPs) such as aircraft factories and airfields was growing, albeit slowly. At this stage of the war, experienced units were being posted away to train for service overseas, which led to a continual turnover of units. However, newly formed units continued to join AA Command, the HAA and support units increasingly becoming 'Mixed' units, indicating that women of the Auxiliary Territorial Service (ATS) were fully integrated into them.\nIn December 1941 Lt-Col R.C.M. Raikes was promoted from 79th (Hertfordshire Yeomanry) HAA Rgt to command 5 AA Bde.\nOrder of Battle 1941–42\nDuring this period 5 AA Bde was composed as follows:\n* 52nd (London) HAA Rgt – from 61 AA Bde January 1942; left AA Command February 1942; to Ceylon\n** 154, 155, 271 HAA Btys\n* 58th (Kent) HAA Rgt – from 6 AA Division Autumn 1941; to 4 AA Division January 1942\n** 207, 208, 264 HAA Btys\n* 85th (Tees) HAA Rgt – to 6 AA Division Autumn 1941\n** 174, 175, 220, 413 HAA Btys\n* 143rd (Mixed) HAA Rgt – new unit formed January 1942; to 67 AA Bde June 1942\n** 474 HAA Bty – from 138th HAA Rgt June 1942\n** 489 (M) HAA Bty – attached to 8 AA Division; transferred to 150th (M) HAA Rgt April 1942\n** 494, 495 (M) HAA Btys\n** 496 (M) HAA Bty – attached to 45 AA Bde\n* 34th LAA Rgt – from 5 AA Division March 1942; to 6 AA Division April 1942\n** 65, 92, 246 LAA Btys\n* 46th LAA Rgt – from 12 AA Division June 1942\n** 137, 219, 243 LAA Btys\n* 47th LAA Rgt – to 8 AA Division Autumn 1941\n** 85, 131, 258 LAA Btys\n* 77th LAA Rgt – new unit joined Summer 1941; left AA Command February 1942; to India\n** 269, 270, 286 LAA Btys\n* 112th (Durham Light Infantry) LAA Rgt – newly converted from 47th (DLI) S/L Rgt, joined before May 1942, to 61 AA Bde May 1942\n** 364, 365, 366, 367 LAA Btys\n* 37th (TEE) S/L/ Rgt – to 11 AA Division  June 1942\n** 307, 308, 348, 349 S/L Btys\nHit and run\nThe AA defences of Southern England were severely tested from March 1942 by the Luftwaffes 'hit-and-run' attacks against towns along the South Coast, and there was a pressing need for more LAA guns to be deployed in that area. In June 1942, 5 AA Bde HQ was transferred to reinforce 5 AA Division defending the South Coast. (Unlike most of AA Command's Territorial Army brigades, which retained their strong regional identities, 5 AA Bde was regularly relocated and/or resubordinated as required.)\nIn October 1942 AA Command abolished its hierarchy of divisions and corps, and established a single tier of AA Groups corresponding to the Groups of RAF Fighter Command. 5 AA Brigade came under 2 AA Group covering South East England (outside London) and affiliated to No. 11 Group RAF.\nThe turnover of units accelerated with the need to provide AA cover for the Allied invasion of North Africa (Operation Torch) in late 1942 followed by the landings in Sicily and Italy in 1943. 21st Army Group was established in early 1943 to begin preparing for the Normandy Landings (Operation Overlord). As the threat from the Luftwaffe waned, AA Command was forced to release men for other duties, and a number of searchlight units were disbanded or converted, and some batteries were disbanded.\nOrder of Battle, 1942–43\nWithin 5 AA Division/2 AA Gp, the brigade had a completely new and rapidly changing order of battle (temporary attachments omitted):\n* 64th (Northumbrian) HAA Rgt – from 72 AA Bde August 1942; left November 1942 and went to North Africa\n** 170, 180, 268 HAA Btys\n* 97th (London Scottish) HAA Rgt – from 35 AA Bde June 1942; left AA Command August 1942 and went to Sicily and Italy\n** 298, 299, 319, 376 HAA Btys\n* 106th HAA Rgt – joined from 2 AA Division July; left November 1942 and went to North Africa\n** 270, 327, 331 HAA Btys\n** 332 HAA Bty – disbanded August 1942\n* 107th HAA Rgt – joined from 35 AA Bde November 1942; to 21st Army Group by March 1943\n** 334, 335, 337 HAA Btys\n* 128th HAA Rgt – joined from 10 AA Division June; to 2 AA Division July 1942\n** 287, 309, 407, 436 HAA Btys\n* 146th HAA Rgt – from 7 AA Division by October 1942\n** 176, 414, 465 HAA Btys\n* 148th (M) HAA Rgt – from 35 AA Bde June 1942; returned by March 1943\n** 505, 508, 523, 529 (M) HAA Btys\n* 174th HAA Rgt – newly formed October; to 3 AA Gp November 1942; returned by March 1943\n** 249, 331, 348 HAA Btys\n* 179th (M) HAA Rgt – newly formed October 1942\n** 564 (M) HAA Bty – to 183rd (M) HAA Rgt January 1943\n** 584, 606 (M) HAA Btys\n** 607, 641 (M) HAA Btys – joined by March 1943\n* 4th LAA Rgt – formerly 3rd (Ulster) S/L Rgt (see above); from 27 (Home Counties) AA Bde November 1942; to 21st Army Group April 1943\n** 7, 8, 10 LAA Btys\n* 19th LAA Rgt – joined April 1943; left AA Command May 1943\n** 60, 104, 290 LAA Btys\n* 46th LAA Rgt – from 65 AA Bde September 1942; left November 1942 and went to North Africa\n** 137, 219, 243 LAA Btys\n* 70th LAA Rgt – from 1AA Gp December 1942; left by March 1943 and went to North Africa and Italy\n** 208, 209, 215 LAA Btys\n* 84th LAA Rgt – from 12 AA Division August; to 35 AA Bde November 1942\n** 201, 251, 461, 448 LAA Btys\n* 97th LAA Rgt – from 65 AA Bde June 1942; to 47 AA Bde by March 1943\n** 221, 232, 301, 480 LAA Btys\n* 108th LAA Rgt – attached from 52nd (Lowland) Infantry Division November 1942; returned May 1943\n** 354, 355, 356 LAA Btys\n* 112th (DLI) LAA Rgt – returned April 1943; to 21st Army Group May 1943\n** 364, 365, 366 LAA Btys\n* 124th (Highland) LAA Rgt – from 47 AA Bde November 1942\n** 404, 411, 412 LAA Btys\n* 131st LAA Rgt – from 71 AA Bde November 1942; returned May 1943\n** 432, 433, 434, 435 LAA Btys\n* 139th LAA Rgt – from 5 AA Gp April 1943; later to 21st Army Group\n** 94, 177, 230 LAA Btys\n* 71st (East Lancashire) S/L Rgt – from 4 AA Gp April 1943; reduced to cadre September 1943\n** 462, 463, 464 S/L Btys\n* 409 AA Gun Operations Room (GOR) at Fareham – until October 1942\n** 28, 29 Sub-operations rooms\n* 313 AA GOR at Newhaven, East Sussex – from October 1942\n* 5 AA Bde Mixed Signal Office Mixed Sub-Section – part of 2 Company, 5 AA Division Mixed Signal Unit, Royal Corps of Signals until October 1942\n** 409 AA GOR Mixed Signal Section\n* 4 Mixed Signal Company HQ – part of 2 AA Group Signals, RCS, from October 1942\n** 5 AA Bde Mixed Signal Office Mixed Sub-Section\n** 313 AA GOR Mixed Signal Section\nAfter the constant turnover, 5 AA Bde was reduced to just two operational units by August 1943: 179th (M) HAA Rgt and 130th (Queen's Edinburgh, Royal Scots) LAA Rgt.\nOrder of Battle 1943–44\nAfter August 1943, 5 AA Bde's composition was as follows:\n* 124th HAA Rgt – from 1 AA Gp September; to 3 AA Gp October 1943\n** 219, 410, 412, 415 LAA Btys\n* 134th (M) HAA Rgt – from 4 AA Gp October 1943\n** 459, 460, 461,  583 (M) HAA Btys\n* 179th (M) HAA Rgt – to 4 AA Gp October 1943\n** 584, 606, 607, 641 (M) HAA Btys\n* 19th LAA Rgt – returned January 1944\n* 84th LAA Rgt – returned from 38 AA Bde August 1943; to Shetland Garrison January 1944\n** 201, 448, 461 LAA Btys – disbanded January 1944\n** 251 LAA Bty\n* 130th LAA Rgt – to 71 AA Bde August 1943\n** 406, 407, 428, 446 AA Btys\n* 140th LAA Rgt – from 3 AA Gp August; to 5 AA Gp October 1943\n** 418, 420, 429, 430 LAA Btys\n* 313 GOR at Newhaven\n* 316 GOR at Brighton\n* 346 GOR at Chichester\n* 4 (M) Signal Co\n** 5 AA Bde (M) Signal Section Office\n** 313, 316, 346 GOR (M) Signal Sections\n** 18 Line Maintenance Section\nOperation Overlord\non anti-Diver duty at Hastings, 28 July 1944.]]\n2 AA Group was responsible for defending the assembly camps, depots and embarkation ports for Operation Overlord. In November 1943 it was also ordered to plan for the expected onslaught of V-1 flying bombs (codenamed 'Divers') against London, to which it responded by planning a thick belt of 8-gun HAA positions across the likely flight path, backed by LAA guns. Meanwhile, the Group also had to deal with a sharp increase in Luftwaffe air raids trying to reach London during the winter of 1943–4 (the so-called 'Little Blitz'). AA Command relieved the burden on 2 AA Group by bringing down 6 AA Group HQ from Scotland and giving it responsibility for the Overlord ports in the Solent–Portsmouth area. 5 AA Brigade, together with 134th (M) HAA Rgt, 19th LAA Rgt and its GORs, transferred to the command of 6 AA Group in March 1944.\nOrder of Battle March–August 1944\nDuring this period 5 AA Bde's composition was as follows:\n* 134th (M) HAA Rgt\n** 459, 460, 461, 583 (M) HAA Btys\n* 138th HAA Rgt – from 102 AA Bde May 1944\n** 419, 424, 437, 438 HAA Btys\n* 19th LAA Rgt – to 3 AA Gp June 1944\n** 221, 263, 294 LAA Btys\n* 85th LAA Rgt – from 67 AA Bde May 1944\n** 52, 201, 304, 448 LAA Btys\n* 136th LAA Rgt – from 5 AA Gp May; to 67 AA Bde July 1944\n** 386, 453, 474 HAA Btys\nOperation Diver\nLAA gun keep watch for V-1s, June 1944.]]\nThe first V-1 missiles were fired against London in June, a week after D-Day, and Operation Diver was activated. 2 AA Group's HAA batteries left their 'Overlord' sites and moved to pre-planned sites across the 'funnel' of V-1 flightpaths. 5 AA Brigade was one of four reinforcing brigade HQs moved into the Group within two weeks, taking over units deployed in the area. However, the results were disappointing, and after a fortnight AA Command changed its tactics. Firstly, mobile HAA guns were replaced with static installations that could traverse more quickly to track the fast-moving targets. These were emplaced on temporary 'Pile platforms' named after the Command-in-Chief of AA Command, Gen Sir Frederick 'Tim' Pile. Secondly, the HAA gun belt was moved to the coast and interlaced with LAA guns to hit the missiles out to sea. This new belt was divided into six brigade sectors, with 5 AA Bde HQ taking charge of one sector under 1 AA Gp. The whole process involved the movement of hundreds of guns and vehicles and thousands of servicemen and women, but a new 8-gun site could be established in 48 hours. The guns were constantly in action, but the success rate against the 'Divers' steadily improved, until over 50 per cent of incoming missiles were destroyed by gunfire or fighter aircraft. This phase of Operation Diver ended in September after the V-1 launch sites in Northern France had been overrun by 21st Army Group.\nOrder of Battle August 1944\nWhen it rejoined 2 AA Gp, 5 AA Bde's composition was as follows:\n* 127th HAA Rgt\n** 396, 411, 422, 433 HAA Btys\n* 136th HAA Rgt\n** 182, 409, 432, 468 HAA Btys\n* 140th LAA Rgt\n** 457, 459, 464 LAA Btys\n* 95th LAA Rgt\n** 297, 302, 460 LAA Btys\nOrder of Battle September–November 1944\non anti-Diver duty on the South Coast, August 1944.]]\nAfter it redeployed under 1 AA Gp in September, 5 AA Bde's composition was as follows:\n* 119th HAA Rgt – from 40 AA Bde November 1944\n** 372, 377, 378 HAA Btys\n* 138th HAA Rgt\n** 419, 424, 437, 438 HAA Btys\n* 141st (M) HAA Rgt – to 2 AA Gp October 1944\n** 486, 490, 493 (M) HAA Btys\n* 183rd (M) HAA Rgt – to 2 AA Gp October 1944\n** 564, 591, 608, 640 (M) HAA Btys\n* 85th LAA Rgt – returned by October 1944\n** 52, 201, 304, 438\n* 98th LAA Rgt – from 102 AA Bde November 1944\n** 305, 306, 481 LAA Btys\n* 131st LAA Rgt – to 57 AA Bde October 1944\n** 432, 433, 434 LAA Btys\n* 135th LAA Rgt\n** 445, 447, 450 LAA Btys\n* 136th LAA Rgt – to 102 AA Bde November 1944\n** 386, 453, 474 LAA Btys\n* 140th LAA Rgt – returned from 102 AA Bde November 1944\n** 457, 459, 464\n* 143rd LAA Rgt – to 2 AA Gp October 1944\nBy October 1944, 5 AA Bde's HQ establishment was 11 officers, 9 male other ranks and 28 members of the ATS, together with a small number of attached drivers, cooks and mess orderlies (male and female). In addition, the brigade's Mixed Signal Office Section comprised 5 male other ranks and 19 ATS.\nWinter 1944–45\nA new phase of Operation Diver began when the Luftwaffe began launching V-1s from aircraft over the North Sea. AA Command had to reorganise its defences, stripping HAA guns from inland sites and moving them to the coast of East Anglia, together with Pile platforms and accommodation huts. In November 1944 a new 9 AA Gp was formed to take over the 'Diver' defences in East Anglia and 5 AA Bde was transferred to this new formation.\nBy the end of 1944, 21st Army Group was suffering a severe manpower shortage, particularly among the infantry.  At the same time the Luftwaffe was suffering from such shortages of pilots, aircraft and fuel that serious aerial attacks on the United Kingdom could be discounted. In January 1945 the War Office began to reorganise surplus anti-aircraft regiments in the UK into infantry battalions, primarily for line of communication and occupation duties in North West Europe, thereby releasing trained infantry for frontline service.\nOrder of Battle November 1944–May 1945\nbeing erected at an AA site, November 1944.]]\nAfter 5 AA Bde was transferred to 9 AA Gp it had the following composition:\n* 119th HAA Rgt – left December 1944\n** 372, 377, 378 HAA Btys\n* 122nd HAA Rgt – joined by March 1945\n** 397, 400, 401 HAA Btys\n* 127th HAA Rgt – returned December 1944\n** 396, 422, 433 HAA Btys\n* 134th (M) HAA Rgt – returned by March 1945\n** 459, 460, 461 (M) HAA Btys\n* 138th HAA Rgt – left by March 1945\n** 419, 424, 437, 438 HAA Btys\n* 143rd (M) HAA Rgt – returned by March 1945\n** 494, 495 HAA Btys\n* 67th LAA Rgt – left to become a garrison unit December 1944\n** 200, 202, 279 LAA Btys\n* 135th LAA Rgt – left December 1944\n** 445, 447. 450 LAA Btys\nPostwar\nAfter Victory in Europe, AA Command was rapidly run down. 9 AA Gp was disbanded and 5 AA Bde reverted to the command of 2 AA Gp, with 127th and 140th HAA Rgts, 14th and 19th LAA Rgts under command. By November 1945, 5 AA Bde comprised just 140th and 150th HAA Rgts.\nWhen AA Command was reorganised in 1947 it had some Regular units under its control in addition to its largely Territorial make-up. These included some under 5 AA Bde based at Aldershot under 2 AA Gp, which covered Southern and South-Western England. These units were all disbanded by the late 1950s.\n* 44 S/L Rgt – originally 3rd Field Rgt; converted to 44th HAA Rgt by 30 September 1948, disbanded March 1958\n* 77 HAA Rgt – originally 6th HAA Rgt, to British Army of the Rhine 1951\n* 78 S/L Rgt – originally 1st S/L Rgt (see above), converted to 78th HAA Rgt by 30 September 1948, disbanded February 1954\n* 97 HAA Rgt – originally 150th HAA Rgt (see above), disbanded by 10 November 1948\n5 AA Brigade was converted into 5 Army Group Royal Artillery (AA) in British Army of the Rhine on 1 November 1950, replacing a disbanded formation. It was placed in suspended animation on 31 March 1958 and formally disbanded on 1 January 1962.\nFootnotes\nNotes\nReferences\n* [http://www.ibiblio.org/hyperwar/UN/UK/UK-NWE-Flanders/index.html Major L.F. Ellis, History of the Second World War, United Kingdom Military Series: The War in France and Flanders 1939–1940, London: HM Stationery Office, 1954/Uckfield, Naval & Military Press, 2004.]\n* Major L.F. Ellis, History of the Second World War, United Kingdom Military Series: Victory in the West, Vol II: The Defeat of Germany, London: HM Stationery Office, 1968/Uckfield: Naval & Military, 2004, .\n* Gen Sir Martin Farndale, History of the Royal Regiment of Artillery: The Years of Defeat: Europe and North Africa, 1939–1941, Woolwich: Royal Artillery Institution, 1988/London: Brasseys, 1996, .\n* J.B.M. Frederick, Lineage Book of British Land Forces 1660–1978, Vol II, Wakefield, Microform Academic, 1984, .\n* Maj-Gen B.P. Hughes, Honour titles of the Royal Artillery, Woolwich: Royal Artillery Institution, 1975.\n*\n* Airey Neave, ''The Flames of Calais: A Soldier's Battle 1940'', London: Hodder & Stoughton, 1972/Barnsley: Leo Cooper, 2003, .\n* [https://www.thegazette.co.uk/London/issue/38149/page/5973 Sir Frederick Pile's despatch: \"The Anti-Aircraft Defence of the United Kingdom from 28th July, 1939, to 15th April, 1945\" London Gazette 18 December 1947.]\n* Brig N.W. Routledge, History of the Royal Regiment of Artillery: Anti-Aircraft Artillery 1914–55, London: Royal Artillery Institution/Brassey's, 1994,\n* Col J.D. Sainsbury, The Hertfordshire Yeomanry Regiments, Royal Artillery, Part 2: The Heavy Anti-Aircraft Regiment 1938–1945 and the Searchlight Battery 1937–1945; Part 3: The Post-war Units 1947–2002, Welwyn: Hertfordshire Yeomanry and Artillery Trust/Hart Books, 2003, .\nExternal sources\n* [https://www.bbc.co.uk/history/ww2peopleswar BBC WW2 People's War.]\n* [https://web.archive.org/web/20140518121548/http://www.army.mod.uk/images/images-microsites/RA/RASearchlights-Text-Final.doc Keith Brigstock 'Royal Artillery Searchlights', presentation to Royal Artillery Historical Society at Larkhill, 17 January 2007.]\n* [http://british-army-units1945on.co.uk British Army units from 1945 on]\n* [http://www.generals.dk Generals of World War II]\n* [http://www.historynet.com History Net.]\n* [https://ra39-45.co.uk Royal Artillery 1939–1945]\n* [http://www.orbat.info/history/historical/uk/ta47.html Graham Watson, The Territorial Army 1947]"
    }
  ]
}