{
  "content": [
    {
      "type": "text",
      "text": "# 60th Brigade (United Kingdom)\n\n|branch= New Army\n|type=Infantry\n|role=\n|size=Brigade\n|command_structure=20th (Light) Division\n|current_commander=\n|garrison=\n|ceremonial_chief=\n|colonel_of_the_regiment=\n|nickname=\n|patron=\n|motto=\n|colors=\n|identification_symbol=\n|march=\n|mascot=\n|battles=\n|notable_commanders=\n|anniversaries=\n|decorations=\n|battle_honours=\n}}\n60th Brigade (60th Bde) was an infantry formation of the British Army during World War I. It was formed in September 1914 as part of the new army also known as Kitchener's Army and was assigned to the 20th (Light) Division, serving on the Western Front.\nOrigin\nOn 6 August 1914, less than 48 hours after Britain's declaration of war, Parliament sanctioned an increase of 500,000 men for the Regular British Army. The newly-appointed Secretary of State for War, Earl Kitchener of Khartoum, issued his famous call to arms: 'Your King and Country Need You', urging the first 100,000 volunteers to come forward. Men flooded into the recruiting offices and the 'first hundred thousand' were enlisted within days. This group of six infantry divisions with supporting arms became known as Kitchener's First New Army, or 'K1'. Recruits continued to arrive in large numbers, and Army Order No 382 of 11 September authorised a further six divisions (15th–20th), which became the Second New Army (K2). 20th (Light) Division began forming at Aldershot with the 59th, 60th and 61st Brigades.\nOrder of Battle\nThe brigade was composed as follows:\n* 6th (Service) Battalion, Oxfordshire and Buckinghamshire Light Infantry – disbanded between 2 and 9 Februarey 1918\n* 6th (Service) Battalion, King's Shropshire Light Infantry\n* 12th (Service) Battalion, King's Royal Rifle Corps\n* 12th (Service) Battalion, Rifle Brigade\n* 60th Company, Machine Gun Corps – left Grantham in two parts on 23 February and 1 March 1916, disembarked at Le Havre on 25 February and 2 March, joined 3 March; joined 20th Divisional MG Battalion 15 March 1918\n* 60th Trench Mortar Battery – 60/1 TM Bty formed by 18 April 1916, expanded to full battery by 12 July\nService\n20th (Light) Division crossed to France in July 1915 and completed its concentration in the area west of Saint-Omer by 26 July. Thereafter it served on the Western Front in the following operations:\n1915\n* Attack towards Fromelles 25 September\n1916\n* Battle of Mont Sorrel 2–13 June\n* Battle of the Somme\n** Battle of Delville Wood 21 August–3 September\n** Battle of Guillemont 3–5 September\n** Battle of Flers–Courcelette 16–20 September\n** Battle of Morval 27 September\n** Battle of the Transloy Ridges 1–8 October\n1917\n* German Retreat to the Hindenburg Line 14 March–5 April\n* Actions on the Hindenburg Line 26 May–16 June\n* Third Battle of Ypres\n** Battle of Langemarck 16–18 August\n** Battle of the Menin Road Ridge 20–25 September\n** Battle of Polygon Wood 26–28 September\n* Battle of Cambrai\n** The Tank Attack 20–21 November\n** Capture of Bourlon Wood 23–28 November\n** German Counter-Attacks 30 November–2 December\n1918\n* German spring offensive\n** Battle of St Quentin 22–23 March\n** Actions at the Somme Crossings 24–25 March\n** Battle of Rosières 26–27 March\n* Final Advance in Artois 2–6 October\nFollowing the Armistice with Germany demobilisation of 20th (L) Division began in January 1919 and the division and its formations ceased to exist on 28 May 1919.\n60th Brigade was not reactivated in World War II.\nCommanders\nThe following officers commanded the brigade:\n* Brigadier-General A.E.W. Colville from 14 September 1914\n* Brig-Gen J.W.G Roy from 8 July 1915\n* Brig-Gen Hon L.J.P. Butler from 5 May 1916\n* Brig-Gen F.J. Duncan from 24 October 1917\n* Brig-Gen W.R.H. Dann from 5 June 1918\nInsignia\nThe formation sign of 20th (L) Division was a white circle bearing a black cross with a red bull's-eye at the centre. In the summer of 1917 the division adopted a comprehensive scheme for battalion identification signs worn on both sleeves. These were black geometric shapes, with 60th Bde using triangles. Underneath, one, two, three or four bars indicated the battalion's seniority. Before the adoption of the divisional scheme the 6th KSLI wore a green oval embroidered with 'VI' above a regimental badge.\nNotes\nReferences\n* Maj A.F. Becke,History of the Great War: Order of Battle of Divisions, Part 3a: New Army Divisions (9–26), London: HM Stationery Office, 1938/Uckfield: Naval & Military Press, 2007, ISBN 1-847347-41-X.\n* Clive Elderton & Gary Gibbs, World War One British Army Corps and Divisional Signs, Wokingham: Military History Society, 2018.\n* Mike Hibberd, Infantry Divisions, Identification Schemes 1917, Wokingham: Military History Society, 2016.\n* Lt-Col H.F. Joslen, Orders of Battle, United Kingdom and Colonial Formations and Units in the Second World War, 1939–1945, London: HM Stationery Office, 1960/London: London Stamp Exchange, 1990, ISBN 0-948130-03-2/Uckfield: Naval & Military Press, 2003, ISBN 1-843424-74-6.\n* Instructions Issued by The War Office During August, 1914, London: HM Stationery Office, 1916.\nExternal sources\n* [http://www.longlongtrail.co.uk Chris Baker, The Long, Long Trail]"
    }
  ]
}