{
  "content": [
    {
      "type": "text",
      "text": "# 62nd Expeditionary Signal Battalion\n\n|allegiance=\n|command_structure=11th Signal Brigade\n|size= Battalion\n|specialization=\n|current_commander=\n|garrison=\n|battles=\n|anniversaries=\n|identification_symbol=\n|identification_symbol_label=Distinctive unit insignia\n|identification_symbol_2=\n|identification_symbol_2_label=\n}}\nThe 62nd Expeditionary Signal Battalion is a unit within the 11th Signal Brigade in the Signal Corps of the United States Army.\nHistory\nThe battalion was originally constituted on 1 October 1933 in the Regular Army as the 62nd Signal Battalion, but was not activated until 13 October 1939 at Fort Sam Houston. During World War II, it served in the Tunisian Campaign, and the Rome–Arno, North Apennines, and Po Valley Campaigns during the Italian Campaign. For its actions in support of IV Corps, the 62nd received an Army Meritorious Unit Commendation on 18 March 1945.\nOn 25 September 1949, it was redesignated as the 62nd Signal Battalion, Corps, before being inactivated in Japan on 26 June 1950.\nOn 1 March 1963, it was redesignated as the 62nd Signal Battalion, and activated on 26 March of that year at Fort Bragg. On 25 April 1966, the Headquarters and Headquarters Detachment of the battalion was converted and redesignated as the Headquarters and Main Support Company of the 62nd Maintenance Battalion. It was sent to Vietnam, receiving the Meritorious Unit Commendation for its actions in 1969 and 1970 in 1971. After the United States withdrawal from Vietnam, it was inactivated on 4 October 1972 at Oakland Army Base.\nOn 1 January 1998, it was converted and redesignated as the 62nd Signal Battalion. The 62nd was reactivated on 17 October 2009 at Fort Hood.\nReferences\nCitations\nBibliography\n*\nFurther reading\n* Terrett, Dulany. The Signal Corps: The Emergency. United States Army in World War II. Washington, D.C.: Office of the Chief of Military History, Department of the Army, 1956.\n* Thompson, George Raynor, Dixie R. Harris, Pauline M. Oakes, and Dulany Terrett. The Signal Corps: The Test (December 1941 to July 1943). United States Army in World War II. Washington, D.C.: Office of the Chief of Military History, Department of the Army, 1957."
    }
  ]
}