{
  "content": [
    {
      "type": "text",
      "text": "# 63rd Expeditionary Signal Battalion\n\n| commander2                    = Kevin T. Ike\n| commander2_label              = Previous commander\n| commander3                    = Tia Benning\n| commander3_label              = Previous commander\n| commander4                    = Michael P. Martel\n| commander4_label              = Previous commander\n| commander5                    = Keith A. Garwold\n| commander5_label              = Previous commander\n| commander6                    = Robert L. Edmonson\n| commander6_label              = Previous commander\n| commander7                    = Carlos Morales\n| commander7_label              = Previous commander\n| commander8                    = Robert A. Barker\n| commander8_label              = Previous commander\n| commander9                    =\n| commander9_label              =\n| commander10                   =\n| commander10_label             =\n| garrison                      =\n| battles                       = World War IIVietnam WarWar in Southwest AsiaOperation Iraqi FreedomOperation Enduring FreedomOperation Inherent ResolveOperation Spartan Shield\n| anniversaries                 =\n| identification_symbol         =\n| identification_symbol_label   = Distinctive unit insignia\n| identification_symbol_2       =\n| identification_symbol_2_label =\n}}\nThe 63d Expeditionary Signal Battalion (Enhanced) is headquartered and located on Fort Stewart, Georgia and is a subordinate unit of the 35th Corps Signal Brigade. The 63d ESB was constituted in July 1940. It was redesignated as an ESB-E on June 17, 2024. Our mission is on order, 63d ESB-E rapidly deploys to Engineer, Install, Operate, Maintain, and Defend (EIOMD) the Unified Network to provide expeditionary signal capabilities for Army and Joint Forces in support of XVIII Airborne Corps and enable decision dominance for commanders in support of Large-Scale Combat Operations (LSCO). The battalion's motto \"From the Beginning!\" comes from its involvement at the start of US operations in World War II.\nCrest History\nThe unit crest was originally approved for the 63d Signal Operations Battalion on the 23rd of January 1952. The colors, orange and white, are the traditional colors of the Signal Corps. The four bandlets represent the four battle honors awarded to the organization during World War II. The silhouette of the mosque is taken from the shoulder sleeve insignia of the Fifth Army and represents the unit's service in North Africa. The green boot represents its subsequent wartime service in Italy. The battalion motto “AB INITIO” translates to “FROM THE BEGINNING,” which refers to the 63d's participation in the United States Army's initial campaign in World War II.\nHistory\nThe history of the 63rd Signal Battalion began when it was constituted in the Regular Army on July 1, 1940, and later activated on June 1, 1941, at Camp Claiborne, LA. The battalion was reorganized and redesignated the 63rd Signal Operations Battalion March 1, 1945, while in Europe. The battalion was subsequently inactivated June 20, 1948, in Austria.\nThe 63rd reentered the active force April 1, 1950, while in Austria. On October 1, 1952, the battalion was reorganized and redesignated the 63rd Signal Battalion.\nOn September 10, 1955, the unit was again inactivated.\nHeadquarters and Headquarters Company, 63rd Signal Battalion, was reactivated July 24, 1967, at Fort Riley, Kansas; spent March 1970-January 1972 at Camp Evans, northwest of Huế, Republic of Vietnam, and was inactivated February 15, 1972, at Fort Lewis, Washington.\nOn July 1, 1975, the 63rd was redesignated the Headquarters and Headquarters Detachment, 63rd Signal Battalion. The unit was activated while in Germany, where it remained until inactivation September 1, 1977.\nThe battalion next entered active service on October 1, 1984, when it was reorganized and redesignated the Headquarters and Headquarters Company, 63rd Signal Battalion. The unit was activated in Massweiler, Germany. Companies A and B were concurrently activated.\nOn April 15, 1989, the battalion was reorganized and redesignated an Army Area Signal Battalion. On April 15, 1990, Company E, 67th Signal Battalion, and Company F, 16th Signal Battalion were redesignated Company C and Company D, 63rd Signal Battalion, respectively.\nDuring Operations Desert Storm/Desert Shield, 63rd Signal Battalion installed, operated and maintained a significant portion of what was, at that time, the largest, most technically complex Echelon Above Corps communication network ever developed.\nAfter serving in Desert Shield and Desert Storm, the restationing of the 63rd Signal Battalion from the 7th Signal Brigade in Europe to a new home station at Fort Gordon, Georgia, was announced on 12 November 1991. The battalion was assigned to the 11th Signal Brigade, effective March 16, 1992. The 63rd deployed companies into Somalia in 1992 and 1993 in support of U.S. humanitarian and peace keeping operations.\nEffective February 19, 1998, the 63rd Signal Battalion was reassigned from the 11th Signal Brigade, Fort Huachuca, Arizona, to the 93rd Signal Brigade, Fort Gordon, Georgia.\nThe resolve of 63rd Signal Battalion was challenged once again when it was called into action for Operations Enduring Freedom and Iraqi Freedom in Southwest Asia on February 16, 2003. On G+1, the 63rd crossed into Iraq with the 3rd Infantry Division and the 1st MEF and emplaced signal support stretching from Kuwait to as far north as Baghdad and Fallujah, Iraq. Some of the many sites the 63rd supported were Camp Arifjan, Camp Virginia, Camp Victory, Cedar I and II, Tallil Air Base, LSA Bushmaster, LSA Resolute, Camp Bucca Theater Internment Facility, Basra International Airport, Baghdad International Airport, and two former Iraqi Presidential Palaces. In January 2004, the 63rd conducted a relief in place and transition of authority with the 67th Signal Battalion. After successfully deploying and accomplishing the mission, the 63rd brought every soldier home to Fort Gordon, Georgia, on February 19, 2004.\nThe 63rd Signal Battalion deployed again in January 2005 in support of the Combined Forces Land Component Commander (CFLCC) during Operation IRAQI FREEDOM III. The battalion provided all communications support for Kuwait and provided CFLCC on call contingency communications capabilities. The battalion served as Kuwait DOIM, the Area Support Group Kuwait (ASG Kuwait) S6, and the SYSCON for Kuwait and Southern Iraq. The battalion provided communications to over 40,000 permanent subscribers in Kuwait and to 150,000 subscribers during the 2005 surge operations. The 63rd served as the force provider headquarters for all signal infrastructure projects across Kuwait, Iraq, and Afghanistan providing the command and control of an additional seven signal companies to meet these requirements. After successfully completing the mission, the soldiers of the 63rd once again safely redeployed home to Fort Gordon, Georgia, on January 19, 2006. In March 2007, the 63d Expeditionary Signal Battalion realigned under the 35th Tactical Theater Signal Brigade.\nThe 63rd Signal Battalion also deployed in support of Operation Iraqi Freedom as part of the surge from July 2007-September 2008.\nIn March 2010 Charlie Company deployed for a 12-month rotation to Afghanistan, with the company being dispersed on FOB Shank, FOB Ghazni, FOB Sharana and Baghram Airfield. Charlie Company was under the command of the 25th Signal Battalion headquartered at Bagram Airfield and provided support during the unit's 12-month rotation. Charlie Company redeployed and reintegrated with the 63rd Expeditionary Signal Battalion in March 2011.\nOn Dec 7th 2012 soldiers from Charlie Company deployed to Iraq, to support main backbone communications with their troposphere communications platforms. They spent 9 months providing service and returned home in September 2013. May 4, 2014, the 518th Tactical Installation Networking Company (TIN) deployed to Kuwait and Afghanistan, beginning a nine-month deployment. Because of the Fort Stewart move 518th was realigned under the 67th Expeditionary Signal Battalion\nIn the summer of 2015, the 63d Signal Battalion began moving from Fort Gordon, Georgia to Fort Stewart, Georgia. A year later the 63d Expeditionary Signal Battalion assumed the “Defense Chemical, Biological, Radiological, and Nuclear Response Force” (DCRF) mission and supported response efforts for Puerto Rico and Texas in the Fall of 2017 and border support missions in 2018. The battalion then provided support to COVID-19 Pandemic Response efforts across the country from 2020 to 2021.\nFrom 2022 to 2024 the battalion supported Joint Special Operations task Force – Somalia in support of Counter Terrorism EXORD – AFRICOM with a Signal Detachment consisting of two twelve-month deployments.\nIn May 2023, Soldiers across the 63d Signal Battalion were assembled for Task Force Spur to deploy in support of Combined Joint Task Force-Operation Inherent Resolve. For nine months they served as the lone expeditionary signal company that provided signal support to units in Syria, Iraq, Jordan, and Kuwait. The Soldiers returned home to Fort Stewart in February 2024 and immediately began preparing for the Expeditionary Signal Battalion-Enhanced (ESB-E) conversion with an effective date of 17 June 2024.\nThe redesignation of the 63d ESB to an ESB-E officially marks the beginning of a new chapter in the battalion's storied history. As of 17 June 2024, the battalion has been fielded and trained on a new fleet of equipment that provides more agile, diverse, and flexible signal support options for military forces. The battalion also underwent a significant MTOE restructure that significantly reduced the assigned personnel while increasing the number of points of presence from 30 to 48. The battalion is preparing to deploy an ESC in Fall 2024, again in support of Combined Joint Task Force-Operation Inherent Resolve and the remainder of the battalion in support of Operation Spartan Shield early in 2025.\nReferences\nExternal links\n* http://www.dvidshub.net/image/780174/63rd-signal-battalion-conducts-change-command\n* http://chronicle.augusta.com/slideshow/2012-12-07/deployment-ceremony-63rd-expeditionary-signal-battalion#slide-1"
    }
  ]
}