{
  "content": [
    {
      "type": "text",
      "text": "# 64th Writers Guild of America Awards\n\nThe 64th Writers Guild of America Awards honored the best film, television, and videogame writers of 2011. Winners were announced on February 19, 2012.\nNominees\nFilm\nOriginal\n'Midnight in Paris — Written by Woody Allen; Sony Pictures Classics' †\n*50/50 — Written by Will Reiser; Summit Entertainment\n*Bridesmaids — Written by Annie Mumolo & Kristen Wiig; Universal Pictures\n*Win Win — Screenplay by Tom McCarthy; Story by Tom McCarthy & Joe Tiboni; Fox Searchlight\n*Young Adult — Written by Diablo Cody; Paramount Pictures\nAdapted\n'The Descendants — Screenplay by Alexander Payne and Nat Faxon & Jim Rash; Based on the novel by Kaui Hart Hemmings; Fox Searchlight' †\n*The Girl with the Dragon Tattoo — Screenplay by Steven Zaillian; Based on the novel by Stieg Larsson, originally published by Norstedts; Columbia Pictures\n*The Help — Screenplay by Tate Taylor; Based on the novel by Kathryn Stockett; DreamWorks Pictures\n*Hugo — Screenplay by John Logan; Based on the book The Invention of Hugo Cabret by Brian Selznick; Paramount Pictures\n*Moneyball — Screenplay by Steven Zaillian and Aaron Sorkin; Story by Stan Chervin; Based on the book by Michael Lewis; Columbia Pictures\nDocumentary\n'Better This World — Written by Katie Galloway & Kelly Duane de la Vega; Loteria Films'\n*If a Tree Falls: A Story of the Earth Liberation Front — Written by Marshall Curry and Matthew Hamachek; Oscilloscope Pictures\n*Nostalgia for the Light — Written by Patricio Guzmán; Icarus Films\n*Pina — Screenplay by Wim Wenders; Sundance Selects\n*Position Among the Stars — Script by Hetty Naaijkens-Retel Helmrich and Leonard Retel Helmrich; HBO Documentary Films\n*Senna — Written by Manish Pandey; Producers Distribution Agency\nTelevision\nDrama series\n'Breaking Bad — Sam Catlin, Vince Gilligan, Peter Gould, Gennifer Hutchison, George Mastras, Thomas Schnauz, Moira Walley-Beckett; AMC'\n*Boardwalk Empire — Bathsheba Doran, Dave Flebotte, Howard Korder, Steve Kornacki, Itamar Moses, Margaret Nagle, Terence Winter; HBO\n*Game of Thrones — David Benioff, Bryan Cogman, Jane Espenson, George R. R. Martin, D. B. Weiss; HBO\n*The Good Wife — Courtney Kemp Agboh, Meredith Averill, Corinne Brinkerhoff, Leonard Dick, Keith Eisner, Karen Hall, Ted Humphrey, Michelle King, Robert King, Steve Lichtman, Matthew Montoya, Julia Wolfe; CBS\n*Homeland — Henry Bromell, Alexander Cary, Alex Gansa, Howard Gordon, Chip Johannessen, Gideon Raff, Meredith Stiehm; Showtime\nComedy Series\n'Modern Family'' — Cindy Chupack, Paul Corrigan, Abraham Higginbotham, Ben Karlin, Elaine Ko, Carol Leifer, Steven Levitan, Christopher Lloyd, Dan O'Shannon, Jeffrey Richman, Brad Walsh, Ilana Wernick, Bill Wrubel, Danny Zuker; ABC'\n*30 Rock — Jack Burditt, Hannibal Buress, Kay Cannon, Robert Carlock, Tom Ceraulo, Vali Chandrasekaran, Tina Fey, Jon Haller, Matt Hubbard, Dylan Morgan, John Riggi, Josh Siegal, Ron Weiner, Tracey Wigfield; NBC\n*Curb Your Enthusiasm — Alec Berg, Larry David, David Mandel, Jeff Schaffer; HBO\n*Louie — Pamela Adlon, Louis C.K.; FX\n*Parks and Recreation — Greg Daniels, Katie Dippold, Daniel J. Goor, Norm Hiscock, Emily Kapnek, Dave King, Greg Levine, Aisha Muharrar, Chelsea Peretti, Amy Poehler, Brian Rowe, Michael Schur, Mike Scully, Emily Spivey, Alan Yang, Harris Wittels; NBC\nNew Series\n'Homeland — Henry Bromell, Alexander Cary, Alex Gansa, Howard Gordon, Chip Johannessen, Gideon Raff, Meredith Stiehm; Showtime'\n*Episodes — David Crane, Jeffrey Klarik; Showtime\n*Game of Thrones — David Benioff, Bryan Cogman, Jane Espenson, George R. R. Martin, D. B. Weiss; HBO\n*The Killing — Linda Burstyn, Jeremy Doner, Soo Hugh, Dan Nowak, Nic Pizzolatto, Dawn Prestwich, Veena Sud, Nicole Yorkin, Aaron Zelman; AMC\n*New Girl — Nick Adams, Rachel Axler, Brett Baer, Donick Cary, Dave Finkel, Berkley Johnson, Josh Malmuth, Elizabeth Meriwether, J. J. Philbin, Joe Port, Luvh Rakhe, Joe Wiseman; FOX\nEpisodic Drama\n'\"Box Cutter\" (Breaking Bad) — Vince Gilligan; AMC\n\"The Good Soldier\" (Homeland) — Henry Bromell; Showtime'\n*\"A Dangerous Maid\" (Boardwalk Empire) — Itamar Moses; HBO\n*\"The Age of Reason\" (Boardwalk Empire) — Bathsheba Doran; HBO\n*\"End Times\" (Breaking Bad) — Thomas Schnauz & Moira Walley-Beckett; AMC\n*\"Just Let Go\" (Dexter) — Jace Richdale; Showtime\nEpisodic Comedy\n'\"Caught in the Act\" (Modern Family) —  Steven Levitan & Jeffrey Richman; ABC'''\n*\"Mother's Day\" (Modern Family) —  Dan O'Shannon & Ilana Wernick; ABC\n*\"Goodbye Michael\" (The Office) — Daniels; NBC\n*\"Object Impermanence\" (Weeds) — Falk; Showtime\n*\"PDA\" (The Office) — Robert Padnick; NBC\n*\"Queen of Jordan\" (30 Rock) — Tracey Wigfield; NBC\nLong form – original – over one hour – one or two parts, one or two airing times\n'Cinema Verite — David Seltzer; HBO'\n*Five, \"Pearl,\" Written by Deirdre O'Connor, \"Charlotte,\" Written by Stephen Godchaux, \"Cheyanne,\" Written by Howard Morris, \"Lili,\" Written by Jill Gordon, \"Mia,\" Written by Wendy West; Lifetime\nLong form – adaptation – over one hour – one or two parts, one or two airing times\n'Too Big to Fail — Teleplay by Peter Gould, Based on the book Too Big to Fail by Andrew Ross Sorkin; HBO'\n*Mildred Pierce — Teleplay by Todd Haynes & Jon Raymond, Based on the book Mildred Pierce by James M. Cain; HBO\nShort Form - original new media\n“Episode 1,” “Episode 2,” “Episode 4,” “Episode 5,” “Episode 6”  (Aim High) by Heath Corson & Richie Keen; cambio.com/aim-high\n“Episode 2.1: Employment,” “Episode 2.2: Clientele,” “Episode 2.3: Personal Property,” “Episode 2.4: The American Dream,” “Episode 2.5: Debt Ceiling” '(Downsized) by Daryn Strauss; downsizedthewebseries.com\n“Episode 3.1: The Return,” “Episode 3.5: The Testosterone,” “Episode 3.6: The Advice,” “Episode 3.7: The Date” (Jack in a Box) by Michael Cyril Creighton; jackinaboxsite.com\nAnimation – any length – one airing time\n\"Homer the Father\" (The Simpsons) — Joel H. Cohen; FOX'\n*\"Bart Stops to Smell the Roosevelts\" (The Simpsons) — Tim Long; FOX\n*\"The Blue and the Gray\" (The Simpsons) — Rob LaZebnik; FOX\n*\"Donnie Fatso\" (The Simpsons) — Chris Cluess; FOX\n*\"Moonstruck\" (Ben 10: Ultimate Alien) — Len Uhley; Cartoon Network\n*\"The Silence of the Clamps\" (Futurama) — Eric Rogers; Comedy Central\nComedy/variety – (including talk) series\n'The Colbert Report — Michael Brumm, Stephen Colbert, Rich Dahm, Paul Dinello, Eric Drysdale, Rob Dubbin, Glenn Eichler, Dan Guterman, Peter Gwinn, Jay Katsir, Barry Julien, Frank Lesser, Opus Moreschi, Tom Purcell, Meredith Scardino, Scott Sherman, Max Werner; Comedy Central'\n*Conan — Jose Arroyo, Andres du Bouchet, Deon Cole, Josh Comers, Dan Cronin, Michael Gordon, Berkley Johnson, Brian Kiley, Laurie Kilmartin, Rob Kutner, Todd Levin, Brian McCann, Conan O'Brien, Matt O'Brien, Jesse Popp, Andy Richter, Brian Stack, Mike Sweeney; TBS\n*Jon Benjamin Has a Van — Leo Allen, Jon Benjamin; Comedy Central\n*Late Night with Jimmy Fallon — AD Miles, David Angelo, Patrick Borelli, Gerard Bradford, Jeremy Bronson, Mike DiCenzo, Jimmy Fallon, John Haskell, Eric Ledgin, Dan Opsal, Amy Ozols, Gavin Purcell, Diallo Riddle, Jon Rineman, Bashir Salahuddin, Justin Shanes, Michael Shoemaker, Jen Statsky, CJ Toledano; NBC\n*Real Time with Bill Maher — Scott Carter, Adam Felber, Matt Gunn, Brian Jacobsmeyer, Jay Jaroch, Chris Kelly, Bill Maher, Billy Martin, Amani Redd; HBO\n*Saturday Night Live — Seth Meyers, Doug Abeles, James Anderson, Alex Baze, Heather Anne Campbell, Matt Craig, Jessica Conrad, James Downey, Tom Flanigan, Shelly Gossman, Steve Higgins, Colin Jost, Zach Kanin, Chris Kelly, Erik Kenward, Rob Klein, Jonathan Krisel, Lorne Michaels, John Mulaney, Christine Nangle, Michael Patrick O'Brien, Paula Pell, Simon Rich, Marika Sawyer, Akiva Schaffer, Sarah Schneider, Pete Schultz, John Solomon, Kent Sublette, Jorma Taccone, Bryan Tucker; NBC\n*The Daily Show with Jon Stewart — Rory Albanese, Kevin Bleyer, Richard Blomquist, Steve Bodow, Tim Carvell, Wyatt Cenac, Hallie Haglund, J.R. Havlan, Elliott Kalan, Dan McCoy, Sam Means, Jo Miller, John Oliver, Zhubin Parang, Daniel Radosh, Jason Ross, Jon Stewart; Comedy Central\nReferences\n2. † indicates the winners of the Academy Awards for Best Original Screenplay and Best Adapted Screenplay."
    }
  ]
}