{
  "content": [
    {
      "type": "text",
      "text": "# 65th Academy Awards\n\n| ratings          = 45.7 million31.2% (Nielsen ratings)\n| last             = 64th\n| next             = 66th\n}}\nThe 65th Academy Awards ceremony, presented by the Academy of Motion Picture Arts and Sciences (AMPAS), honored films released in 1992 in the United States and took place on March 29, 1993, at the Dorothy Chandler Pavilion in Los Angeles beginning at 6:00&nbsp;p.m. PST / 9:00&nbsp;p.m. EST. During the ceremony, AMPAS presented Academy Awards (commonly referred to as Oscars) in 23 categories. The ceremony, televised in the United States by ABC, was produced by Gil Cates and directed by Jeff Margolis. Actor Billy Crystal hosted the show for the fourth consecutive year. In related events, during a ceremony held at the Century Plaza Hotel in Los Angeles on March 6, the Academy Awards for Technical Achievement were presented by host Sharon Stone.\nUnforgiven won four Oscars, including Best Picture.  Other winners included ''Bram Stoker's Dracula and Howards End with three awards, Aladdin with two, and The Crying Game, Death Becomes Her, Educating Peter, Indochine, The Last of the Mohicans, Mona Lisa Descending a Staircase, My Cousin Vinny, Omnibus, The Panama Deception, A River Runs Through It, and Scent of a Woman with one. The telecast garnered 45.7 million viewers in the United States. As of the 96th Academy Awards, held in March 2024, this was the last to not feature an \"In memoriam\" section of the show.\nWinners and nominees\nThe nominees for the 65th Academy Awards were announced on February 17, 1993, at the Samuel Goldwyn Theater in Beverly Hills, California, by Robert Rehme, president of the academy, and actress Mercedes Ruehl. Howards End and Unforgiven led all nominees with nine nominations each.\nThe winners were announced during the awards ceremony on March 29, 1993. Best Director winner Clint Eastwood became the seventh person nominated for lead acting and directing for the same film. Best Actor winner Al Pacino was the sixth performer to receive nominations in the lead and supporting categories in the same year. He also became the first person to win in the lead acting category after achieving the aforementioned feat. By virtue of his second straight win in both music categories, Alan Menken became the third person to win two Oscars in two consecutive years.\nAwards\nWinners are listed first, highlighted in boldface, and indicated with a double dagger ().\n{| class=wikitable\n| valign=\"top\" width=\"50%\" |\n*'Unforgiven – Clint Eastwood, producer'\n** The Crying Game – Stephen Woolley, producer\n** A Few Good Men – David Brown, Rob Reiner and Andrew Scheinman, producers\n** Howards End – Ismail Merchant, producer\n** Scent of a Woman – Martin Brest, producer\n| valign=\"top\" |\n*'Clint Eastwood&nbsp;– Unforgiven'\n** Neil Jordan&nbsp;– The Crying Game\n** James Ivory&nbsp;– Howards End\n** Robert Altman&nbsp;– The Player\n** Martin Brest&nbsp;– Scent of a Woman\n|-\n| valign=\"top\" |\n*'Al Pacino&nbsp;– Scent of a Woman as Lieutenant Colonel Frank Slade'\n** Robert Downey Jr.&nbsp;– Chaplin as Charlie Chaplin\n** Clint Eastwood&nbsp;– Unforgiven as William \"Will\" Munny\n** Stephen Rea&nbsp;– The Crying Game as Fergus\n** Denzel Washington&nbsp;– Malcolm X as Malcolm X\n| valign=\"top\" |\n*'Emma Thompson&nbsp;– Howards End as Margaret Schlegel'\n** Catherine Deneuve&nbsp;– Indochine as Éliane Devries\n** Mary McDonnell&nbsp;– Passion Fish as May-Alice Culhane\n** Michelle Pfeiffer&nbsp;– Love Field as Lurene Hallett\n** Susan Sarandon&nbsp;– Lorenzo's Oil as Michaela Odone\n|-\n| valign=\"top\" |\n*'Gene Hackman&nbsp;– Unforgiven as Little Bill Daggett'\n** Jaye Davidson&nbsp;– The Crying Game as Dil\n** Jack Nicholson&nbsp;– A Few Good Men as Colonel Nathan R. Jessup\n** Al Pacino&nbsp;– Glengarry Glen Ross as Ricky Roma\n** David Paymer&nbsp;– Mr. Saturday Night as Stan Young\n| valign=\"top\" |\n*'Marisa Tomei&nbsp;– My Cousin Vinny as Mona Lisa Vito'\n** Judy Davis&nbsp;– Husbands and Wives as Sally Wainwright\n** Joan Plowright&nbsp;– Enchanted April as Mrs. Fisher\n** Vanessa Redgrave&nbsp;– Howards End as Ruth Wilcox\n** Miranda Richardson&nbsp;– Damage as Ingrid Fleming\n|-\n| valign=\"top\" |\n*'The Crying Game&nbsp;– Neil Jordan'\n** Husbands and Wives&nbsp;– Woody Allen\n** Lorenzo's Oil&nbsp;– George Miller and Nick Enright\n** Passion Fish&nbsp;– John Sayles\n** Unforgiven&nbsp;– David Webb Peoples\n| valign=\"top\" |\n*'Howards End&nbsp;– Ruth Prawer Jhabvala based on the novel by E.M. Forster'\n** Enchanted April&nbsp;– Peter Barnes based on the novel by Elizabeth von Arnim\n** The Player&nbsp;– Michael Tolkin based on his novel\n** A River Runs Through It&nbsp;– Richard Friedenberg based upon the story by Norman Maclean\n** Scent of a Woman&nbsp;– Bo Goldman based on the previous film Profumo di donna by Ruggero Maccari and Dino Risi and the novel Il Buio E Il Miele by Giovanni Arpino\n|-\n| valign=\"top\" |\n*'Indochine (France) in French&nbsp;– Régis Wargnier, director'\n** Close to Eden (Russia) in Russian&nbsp;– Nikita Mikhalkov, director\n** Daens (Belgium) in Dutch&nbsp;– Stijn Coninx, director\n** Schtonk! (Germany) in German&nbsp;– Helmut Dietl, director\n** A Place in the World (Uruguay) in Spanish – Adolfo Aristarain, director (nomination revoked)\n| valign=\"top\" |\n*'The Panama Deception&nbsp;– Barbara Trent and David Kasper'\n** Changing Our Minds: The Story of Dr. Evelyn Hooker&nbsp;– David Haugland\n** Fires of Kuwait&nbsp;– Sally Dundas\n** The Liberators: Fighting on Two Fronts in World War II&nbsp;– Bill Miles and Nina Rosenblum\n** Music for the Movies: Bernard Herrmann&nbsp;– Margaret Smilow and Roma Baran\n|-\n| valign=\"top\" |\n*'Educating Peter&nbsp;– Thomas C. Goodwin (posthumous award) and Gerardine Wurzburg'\n** At the Edge of Conquest: The Journey of Chief Wai-Wai''&nbsp;– Geoffrey O'Connor\n** ''Beyond Imagining: Margaret Anderson and the 'Little Review'&nbsp;– Wendy L. Weinberg\n** The Colours of My Father: A Portrait of Sam Borenstein&nbsp;– Richard Elson and Sally Bochner\n** When Abortion Was Illegal: Untold Stories&nbsp;– Dorothy Fadiman\n| valign=\"top\" |\n*'Omnibus&nbsp;– Sam Karmann'\n**Contact&nbsp;– Jonathan Darby and Jana Sue Memel\n** Cruise Control&nbsp;– Matt Palmieri\n** The Lady in Waiting&nbsp;– Christian M. Taylor\n** Swan Song&nbsp;– Kenneth Branagh and David Parfitt\n|-\n| valign=\"top\" |\n*'Mona Lisa Descending a Staircase&nbsp;– Joan C. Gratz'\n** Adam&nbsp;– Peter Lord\n** Reci, reci, reci&nbsp;– Michaela Pavlátová\n** The Sandman&nbsp;– Paul Berry\n** Screen Play&nbsp;– Barry Purves\n| valign=\"top\" |\n*'Aladdin&nbsp;– Alan Menken'\n** Basic Instinct&nbsp;– Jerry Goldsmith\n** Chaplin&nbsp;– John Barry\n** Howards End&nbsp;– Richard Robbins\n** A River Runs Through It&nbsp;– Mark Isham\n|-\n| valign=\"top\" |\n*'\"A Whole New World\" from Aladdin&nbsp;– Music by Alan Menken; Lyrics by Tim Rice'\n** \"Friend Like Me\" from Aladdin&nbsp;– Music by Alan Menken; Lyrics by Howard Ashman (posthumous nomination)\n** \"I Have Nothing\" from The Bodyguard&nbsp;– Music by David Foster; Lyrics by Linda Thompson\n** \"Run to You\" from The Bodyguard&nbsp;– Music by Jud Friedman; Lyrics by Allan Rich\n** \"Beautiful Maria of My Soul\" from The Mambo Kings&nbsp;– Music by Robert Kraft; Lyrics by Arne Glimcher\n| valign=\"top\" |\n*'''Bram Stoker's Dracula&nbsp;– David E. Stone and Tom McCarthy'\n** Aladdin&nbsp;– Mark Mangini\n** Under Siege&nbsp;– John Leveque and Bruce Stambler\n|-\n| valign=\"top\" |\n*'The Last of the Mohicans&nbsp;– Chris Jenkins, Doug Hemphill, Mark Smith and Simon Kaye'\n** Aladdin&nbsp;– Terry Porter, Mel Metcalfe, David J. Hudson and Doc Kane\n** A Few Good Men&nbsp;– Kevin O'Connell, Rick Kline and Robert Eber\n** Under Siege&nbsp;– Donald O. Mitchell, Frank A. Montaño, Rick Hart and Scott D. Smith\n** Unforgiven&nbsp;– Les Fresholtz, Vern Poore, Dick Alexander and Rob Young\n| valign=\"top\" |\n*'Howards End&nbsp;– Art Direction: Luciana Arrighi; Set Decoration: Ian Whittaker'\n** ''Bram Stoker's Dracula&nbsp;– Art Direction: Thomas E. Sanders; Set Decoration: Garrett Lewis\n** Chaplin&nbsp;– Art Direction: Stuart Craig; Set Decoration: Chris A. Butler\n** Toys&nbsp;– Art Direction: Ferdinando Scarfiotti; Set Decoration: Linda DeScenna\n** Unforgiven&nbsp;– Art Direction: Henry Bumstead; Set Decoration: Janice Blackie-Goodine\n|-\n| valign=\"top\" |\n*'A River Runs Through It&nbsp;– Philippe Rousselot'\n** Hoffa&nbsp;– Stephen H. Burum\n** Howards End&nbsp;– Tony Pierce-Roberts\n** The Lover&nbsp;– Robert Fraisse\n** Unforgiven&nbsp;– Jack N. Green\n| valign=\"top\" |\n*'''Bram Stoker's Dracula&nbsp;– Greg Cannom, Michèle Burke and Matthew W. Mungle'\n** Batman Returns&nbsp;– Ve Neill, Ronnie Specter and Stan Winston\n** Hoffa&nbsp;– Ve Neill, Greg Cannom and John Blake\n|-\n| valign=\"top\" |\n*'Bram Stoker's Dracula&nbsp;– Eiko Ishioka'\n** Enchanted April&nbsp;– Sheena Napier\n** Howards End&nbsp;– Jenny Beavan and John Bright\n** Malcolm X&nbsp;– Ruth E. Carter\n** Toys&nbsp;– Albert Wolsky\n| valign=\"top\" |\n*'Unforgiven&nbsp;– Joel Cox'\n** Basic Instinct&nbsp;– Frank J. Urioste\n** The Crying Game&nbsp;– Kant Pan\n** A Few Good Men&nbsp;– Robert Leighton\n** The Player&nbsp;– Geraldine Peroni\n|-\n| valign=\"top\" colspan=\"2\"|\n*'Death Becomes Her&nbsp;– Ken Ralston, Doug Chiang, Douglas Smythe and Tom Woodruff Jr.'\n** Alien 3&nbsp;– Richard Edlund, Alec Gillis, Tom Woodruff Jr. and George Gibbs\n** Batman Returns&nbsp;– Michael L. Fink, Craig Barron, John Bruno and Dennis Skotak\n|}\nHonorary Award\n*To Federico Fellini in recognition of his place as one of the screen's master storytellers.\nJean Hersholt Humanitarian Awards\nThe award recognizes individuals whose humanitarian efforts have brought credit to the motion picture industry.\n*Audrey Hepburn (posthumous award)\n*Elizabeth Taylor\nFilms with multiple nominations and awards\n{| class=\"wikitable\" style=\"text-align: center;\"\n|+ Films that received multiple nominations\n|-\n! scope=\"col\" width=\"55\" | Nominations\n! scope=\"col\" align=\"center\" | Film\n|-\n| rowspan=2 style=\"text-align:center\" | 9\n| Howards End\n|-\n| Unforgiven\n|-\n| style=\"text-align: center;\" | 6\n| The Crying Game\n|-\n| style=\"text-align: center;\" | 5\n| Aladdin\n|-\n| rowspan=3 style=\"text-align:center\" | 4\n| ''Bram Stoker's Dracula\n|-\n| A Few Good Men\n|-\n| Scent of a Woman\n|-\n| rowspan=4 style=\"text-align:center\" | 3\n| Chaplin\n|-\n| Enchanted April\n|-\n| A River Runs Through It\n|-\n| The Player\n|-\n| rowspan=11 style=\"text-align:center\" | 2\n| Basic Instinct\n|-\n| Batman Returns\n|-\n| The Bodyguard\n|-\n| Hoffa\n|-\n| Husbands and Wives\n|-\n| Indochine\n|-\n| Lorenzo's Oil\n|-\n| Malcolm X\n|-\n| Passion Fish\n|-\n| Toys\n|-\n| Under Siege\n|}\n{| class=\"wikitable\" style=\"text-align: center;\"\n|+ Films that received multiple awards\n|-\n! scope=\"col\" width=\"55\" | Awards\n! scope=\"col\" align=\"center\" | Film\n|-\n| style=\"text-align: center;\" | 4\n| Unforgiven\n|-\n| rowspan=3 style=\"text-align:center\" | 3\n|-\n| Bram Stoker's Dracula\n|-\n| Howards End\n|-\n| rowspan=1 style=\"text-align:center\" | 2\n| Aladdin\n|}\nPresenters and performers\nThe following individuals (in order of appearance) presented awards or performed musical numbers:\nPresenters\n{| class=\"wikitable sortable\"\n|-\n! Name(s) !! Role\n|-\n|  || Announcer for the 65th annual Academy Awards\n|-\n|  (AMPAS president) || Gave opening remarks welcoming guests to the awards ceremony\n|-\n|  || Presenter of the \"Women in the Movies\" Montage\n|-\n|  || Presenter of the award for Best Supporting Actress\n|-\n|  || Presenter of the film Unforgiven during the Best Picture segment\n|-\n| Susan Sarandon || Presenters of the award for Best Film Editing\n|-\n|  || Presenter of the award for Best Supporting Actor\n|-\n| Marisa Tomei || Presenters of the award for Best Makeup\n|-\n|  || Presenter of the Jean Hersholt Humanitarian Award to Audrey Hepburn\n|-\n| David Paymer || Presenters of the award for Best Live Action Short Film\n|-\n|  || Presenter of the award for Best Animated Short Film\n|-\n|  || Presenter of the film A Few Good Men on the Best Picture segment\n|-\n|  || Introducer of presenter Glenn Close\n|-\n|  || Presenter of the award for Best Foreign Language Film\n|-\n|  || Presenter of the segment of the Academy Awards for Technical Achievement and the Gordon E. Sawyer Award\n|-\n|  || Presenter of the award for Best Art Direction\n|-\n|  || Presenter of the film Howards End on the Best Picture segment\n|-\n|  || Presenter of the award for Best Visual Effects\n|-\n|  || Presenter of the award for Best Sound Effects Editing\n|-\n| Denzel Washington || Presenters of the awards for Best Documentary Short Subject and Best Documentary Feature\n|-\n| Marcello Mastroianni || Presenters of the Academy Honorary Award to Federico Fellini\n|-\n|  || Presenter of the award for Best Original Score\n|-\n| Dustin Hoffman || Presenters of the awards for Best Screenplay Written Directly for the Screen and Best Screenplay Based on Material Previously Produced or Published\n|-\n|  || Presenter of the film The Crying Game on the Best Picture segment\n|-\n| Alfre Woodard || Presenters of the award for Best Sound\n|-\n| Quincy Jones || Presenters of the award for Best Original Song\n|-\n|  || Presenter of the award for Best Actress\n|-\n| Gene Hackman || Presenters of the award for Best Cinematography\n|-\n|  || Presenter of the award Best Costume Design\n|-\n|  || Presenter of the Jean Hersholt Humanitarian Award to Elizabeth Taylor\n|-\n|  || Presenter of the award for Best Actor\n|-\n|  || Presenter of the film Scent of a Woman on the Best Picture segment\n|-\n|  || Presenter of the award for Best Director\n|-\n|  || Presenter of the award for Best Picture\n|}\nPerformers\n{| class=\"wikitable sortable\"\n|-\n! Name(s) !! Role !! Performed\n|-\n|  || Musical arranger || Orchestral\n|-\n|  || Performer || Opening number: Scent of a Woman'' (to the tune of \"I'm a Woman\" by Peggy Lee), Howards End (to the tune of \"Hooray for Hollywood\" from Hollywood Hotel), A Few Good Men (to the tune of \"Sound Off!\"), The Crying Game (to the tune of \"(Love Is) The Tender Trap\" from The Tender Trap) and Unforgiven to the tune of (\"Unforgettable\" by Nat King Cole)\n|-\n| Lea Salonga || Performers || \"A Whole New World\" from Aladdin\n|-\n| Sheila E. || Performers || \"Beautiful Maria of My Soul\" from The Mambo Kings\n|-\n|  || Performer || \"I Have Nothing\" and \"Run to You\" from The Bodyguard\n|-\n|  || Performer || \"Ladies' Day\" during the musical tribute to women in the film\n|-\n|  || Performer || \"Friend Like Me\" from Aladdin\n|}\nCeremony information\nhosted the 65th Academy Awards.|alt=Photo of Billy Crystal at the 2012 Tribeca Film Festival.]]\nAfter the success of the previous year's ceremony which won several Emmys and critical acclaim, the academy rehired producer Gil Cates for the fourth consecutive year. In February 1993, actor and comedian Billy Crystal was chosen by Cates as host also for the fourth straight time. Cates justified the decision to hire him saying, \"He is a major movie star with a talent for moving the evening's entertainment along.\" According to an article by Army Archerd published in Variety, Crystal initially declined to host again citing his busy film schedule that included Mr. Saturday Night and ''City Slickers II: The Legend of Curly's Gold. However, after Cates sent him a funeral wreath with a poem declaring \"The show and I are dead without you\" followed by a head of a fake dead horse similar to one featured in the film The Godfather'', Crystal accepted the role as emcee.\nAs with previous ceremonies he produced, Cates centered the show around a theme. Inspired by the Year of the Woman in which a record four women were elected to the United States Senate, Cates christened the 1993 show with the theme \"Oscar Celebrates Women and the Movies\". In tandem with the theme, AMPAS gathered 67 female Oscar winners of every category for a photo that was later shown at the start of the telecast. Actress and singer Liza Minnelli performed \"Ladies' Day\", a song written by Fred Ebb and John Kander specifically for the broadcast. Oscar-winning documentarian Lynne Littman assembled a montage highlighting women in film.\nSeveral other people participated in the production of the ceremony. Bill Conti served as conductor and musical supervisor for the ceremony. Choreographer Debbie Allen supervised the Best Song nominee performances and the \"Ladies' Night\" musical number. Voice actress Randy Thomas served as announcer of the telecast becoming the first woman to do so.\nBox office performance of nominees\n{| class=\"wikitable sortable\" style=\"width:250px; font-size:90%; float:right; margin-left:10px\"\n|+North American box office gross for Best Picture nominees\n|-\n! Film\n! Pre-nomination(Before Feb. 17)\n! Post-nomination(Feb. 17-Mar. 29)\n! Post-awards(After Mar. 29)\n! Total\n|-\n| A Few Good Men\n| $120 million\n| $14.3 million\n| $7.0 million\n| $141.3 million\n|-\n| The Crying Game\n| $26.6 million\n| $11.2 million\n| $4.6 million\n| $62.3 million\n|-\n| Howards End\n| $24.4 million\n| $942,668\n| $36,767\n| $25.3 million\n|-\n| Scent of a Woman\n| $34.1 million\n| $18.5 million\n| $10.5 million\n| $63.1 million\n|-\n| Unforgiven\n| $75.3 million\n| $7.6 million\n| $18.3 million\n| $102 million\n|}\nAt the time of the nominations announcement on February 17, the combined gross of the five Best Picture nominees at the US box office was $252 million, with an average of $50.4 million per film. A Few Good Men was the highest earner among the Best Picture nominees with $120 million in domestic box office receipts. The film was followed by Unforgiven ($75.2 million), Scent of a Woman ($34.1 million), The Crying Game ($14 million), and finally Howards End ($8.7 million).\nOf the top 50 grossing movies of the year, 38 nominations went to 13 films on the list. Only A Few Good Men (6th), Unforgiven (17th), Malcolm X (30th) and Scent of a Woman (38th) were nominated for directing, acting, screenwriting, or Best Picture. The other top 50 box office hits that earned nominations were Aladdin (1st), Batman Returns (3rd), Basic Instinct (8th), The Bodyguard (9th), Under Siege (12th), ''Bram Stoker's Dracula (14th), The Last of the Mohicans (16th), Death Becomes Her (22nd), and Alien3 (26th).\nCritical reviews and ratings\nThe show received a negative reception from most media publications. Associated Press television critic Frazier Moore lamented that Crystal \"seemed incredibly listless\". He also questioned the purpose of the \"Year of the Woman\" theme writing, \"The Oscar show itself seemed at odds with its own feminist theme.\" Robert Bianco from the Pittsburgh Post-Gazette'' derided Allen's musical production numbers, comparing them to the disastrous opening number at the 61st ceremony held in 1989. Columnist Matt Roush of USA Today complained, \"Crystal, in a by-now-familiar performance, has, in four years, taken a plum assignment and, by repetition, reduced it to shtick.\" He also wrote that, \"The song medley is getting old hat,\" and the \"smug references to his flop Mr. Saturday Night were out of an improv amateur night.\"\nThe telecast also received unfavorable reaction from various public feminist figures. In an interview with Los Angeles Daily News author and activist Betty Friedan condemned the \"Year of the Woman\" theme commenting, \"It had no basis in reality. On behalf of women directors, cinematographer, and producers, I resent the travesty of calling that a tribute.\" Likewise, President of the National Organization for Women's Los Angeles chapter Tammy Bruce chastised ceremony's feminist tribute as \"one of the most hypocritical, patronizing things I saw in my whole life.\" In response, Gil Cates responded towards the criticism of the theme stating, \"The theme developed and raised consciousness in a way that I think is positive, not only for the individual in general but for individual women specifically.\" He also quoted an ancient Chinese proverb later made famous by former U.S. First Lady Eleanor Roosevelt saying, \"It is better to light one candle than to curse the darkness.\"\nDespite the adverse reception, the ABC broadcast drew in an average of 45.7 million people over its length, which was a 3% increase from the previous year's ceremony. The show also drew higher Nielsen ratings compared to the previous ceremony with 31.2% of households watching over a 51 share. It also drew a higher 18–49 demo rating with a 20.1 rating among viewers in that demographic.\nSee also\n* 13th Golden Raspberry Awards\n* 35th Grammy Awards\n* 45th Primetime Emmy Awards\n* 46th British Academy Film Awards\n* 47th Tony Awards\n* 50th Golden Globe Awards\n* List of submissions to the 65th Academy Awards for Best Foreign Language Film\nNotes\n:A: The Academy revoked the Best Foreign Language Film nomination of Uruguay's A Place in the World after an investigation that determined the film as an Argentine production and therefore violated the Academy's rules which require that there be \"substantial filmmaking input from the country that submits the film\".\n:B: Hepburn died on January 20, 1993, shortly after AMPAS announced the honor. Her son Sean accepted the award at the ceremony on her behalf.\nReferences\nBibliography\n*\n*\nExternal links\n;Official websites\n* [http://www.oscar.com/ Academy Awards Official website]\n* [http://www.oscars.org/ The Academy of Motion Picture Arts and Sciences Official website]\n* [https://www.youtube.com/oscars Oscar's Channel]  at YouTube (run by the Academy of Motion Picture Arts and Sciences)\n;Analysis\n* [http://www.filmsite.org/aa92.html 1992 Academy Awards Winners and History]  Filmsite\n* [https://www.imdb.com/event/ev0000003/1993 Academy Awards, USA: 1993]  Internet Movie Database\n;Other resources\n*"
    }
  ]
}