{
  "content": [
    {
      "type": "text",
      "text": "# 68th Network Warfare Squadron\n\n|branch=\n|type=\n|role=Network warfare\n|size=\n|command_structure=Air Combat Command\n|current_commander=\n|garrison=Joint Base Lackland-San Antonio, Texas\n|nickname=\n|motto=\n|colors=Purple\n|march=\n|mascot=Purple Dragon\n|battles=Global War on Terrorism\n|anniversaries=\n|decorations=Air Force Outstanding Unit Award with Combat \"V\" DeviceAir Force Outstanding Unit Award\n|identification_symbol=\n|identification_symbol_label=68th Network Warfare Squadron emblem\n|identification_symbol_2=\n|identification_symbol_2_label=\n}}\nThe 68th Network Warfare Squadron is an active United States Air Force unit. It was previously designated the 68th Information Operations Squadron.  Until 2011, the squadron was stationed Brooks City-Base.  Due to the 2005 Base Realignment and Closure Commission all Air Force units left Brooks prior to September 2011.  The 68th moved across San Antonio, Texas to Joint Base San Antonio-Lackland in June 2011.\nMission\nThe squadron emulates the role of a hostile intelligence service by collecting, analyzing, and processing Department of Defense telecommunications, including telephone, computer-to-computer, facsimile, radio, and wireless transmissions. It applies analytical processes and determines critical information potentially compromised and exploited by hostile threats. Its peacetime support focuses on identifying adverse operations security trends and practices. Its contingency and exercise support focuses on force protection. It supervises electronic system security assessment operations, including analysis of monitored friendly telecommunications. It performs analysis and reporting functions at theater level and briefs commanders at all levels of potential intelligence vulnerabilities.\nHistory\nWorld War II\nThe first predecessor of the squadron was activated at Drew Field, Florida in November 1942 as the 958th Signal Radio Intelligence Company, Aviation.  In January 1943, it moved to the Aviation Signal Training Center at Camp Pinedale, California.  Its original cadre were Nisei Japanese Americans who had trained on Heigo (military) Japanese at Camp Savage, Minnesota.  In 1944, the unit transferred from the Signal Corps to the Air Corps, becoming the 8th Radio Squadron, Mobile.\nThe squadron sailed to Guam aboard the  in October1944. On Guam, it became part of a joint radio analysis group and was located in a secure Navy compound called the Joint Communications Activity.  In addition to the squadron's intercept operations, squadron personnel deployed with direction finding teams to locate enemy transmitters.  Teams were located on Pelau, Saipan, and Iwo Jima to be closer to low power Japanese transmitters.  Starting in the spring of 1945, ten of the 8th's voice intercept operators participated in airborne reconnaissance missions aboard Consolidated B-24 Liberators.  Although the squadron remained active, most personnel were withdrawn after V-J Day.  It returned to the United States in November 1945, initially serving in the Washington, DC area.\nCold War\nAfter the United States Air Force became a separate service, the squadron moved to Brooks Air Force Base, Texas as part of the United States Air Force Security Service.  It served in the San Antonio, Texas area until inactivating in 1955.  The squadron was disbanded in 1983.\nThe second predecessor of the squadron was organized at Brooks in November 1977 as the 6906th Security Squadron.  In 1993, the two squadrons were consolidated as the 68th Intelligence Squadron.\nLineage\n; 8th Radio Squadron\n* Constituted as the 958th Signal Radio Intelligence Company, Aviation on 9 October 1942\n: Activated on 1 November 1942\n: Redesignated 8th Radio Squadron, Mobile (J) on 19 Feb 1944\n: Redesignated 8th Radio Squadron, Mobile on 14 November 1946\n: Inactivated on 8 May 1955\n* Disbanded on 15 June 1983\n* Reconstituted and consolidated with the 6906th Security Squadron on 1 October 1993\n; 68th Network Warfare Squadron\n* Designated as the 6906th Security Squadron and activated on 1 November 1977\n: Redesignated 6906th Electronic Security Squadron on 1 August 1979\n* Consolidated with the 8th Radio Squadron on 1 October 1993\n: Redesignated 68th Intelligence Squadron on 1 October 1993\n: Redesignated 68th Information Operations Squadron on 1 August 2000\n* Redesignated 68th Network Warfare Squadron on 5 July 2008\nStations\n* Drew Field, Florida, 1 November 1942\n* Camp Pinedale, California, 24 January 1943 – c. 10 October 1944\n* Guam, Mariana Islands, 17 October 1944 – 6 November 1945\n* Washington DC, 6 November 1945\n* Vint Hill Farms Station, Warrenton, Virginia, 5 March 1946\n* Brooks Air Force Base, Texas, 23 February 1949\n* Kelly Air Force Base, Texas, 1 August 1953\n* Brooks Air Force Base, Texas 22 March – 8 May 1955\n* Brooks Air Force Base (later Brooks City-Base), Texas, 1 Nov 1977\n* Lackland Air Force Base (later Joint Base San Antonio-Lackland), 1 March 2011 – present\nAssignments\n* Third Air Force, 1 November 1942\n* Fourth Air Force, 24 January 1943\n* Seventh Air Force, 20 November 1944\n* United States Army Forces, Middle Pacific (attached to United States Army Strategic Air Forces), 25 July 1945\n* Twentieth Air Force, 18 September 1945\n* Army Security Agency, 6 November 1945\n* United States Air Force Security Service, 1 February 1949\n* 6960th Headquarters Support Group, 1 September 1951\n* United States Air Force Security Service, 6 July 1953 – 8 May 1955\n* Air Force Communications Security Center, 1 November 1977\n* Electronic Security Command, 1 February 1980\n* 6960th Electronic Security Wing (later Continental Electronic Security Division), 1 July 1980\n* 695th Electronic Security Wing, 3 October 1988\n* Continental Electronic Security Division, 1 January 1991\n* 693d Intelligence Wing, 1 October 1991\n* 67th Intelligence Group (later 67 Information Operations Group, 67 Network Warfare Group), 1 October 1993\n* 26th Network Operations Group (later 26 Cyberspace Operations Group), 18 Aug 2009 – present\nSee also\n* List of cyber warfare forces\nReferences\nNotes\n; Explanatory notes\n; Citations"
    }
  ]
}