{
  "content": [
    {
      "type": "text",
      "text": "# 6th Antiaircraft Artillery Division of Air Force (People's Republic of China)\n\nThe 107th Anti-Aircraft Artillery Division of Air Defense Force () was an anti-air unit of the People's Liberation Army Air Force. The division was activated in Nanjing, Jiangsu province on September 1, 1955.\nThe division was composed of the:\n*507th Anti-Aircraft Artillery Regiment\n*522nd Anti-Aircraft Artillery Regiment\n*321st Anti-Aircraft Radar Regiment\nOn July 1, 1956, the division was transferred under the 1st Air Defense Force Corps' control.\nIn May 1957, the 522nd AAA Regiment was transferred to the 106th Anti-Aircraft Artillery Division's control, the 507th AAA Regiment was transferred to the 101st Anti-Aircraft Artillery Division's control, and the 321st Radar Regiment detached from the division to directly subordinated to the Air Defense Force of Nanjing Military Region.\nThe division's headquarters was moved to Shenyang, Liaoning and was transferred to the People's Liberation Army Air Force in June 1957.\nOn July 1, 1957, the 501st (Anti-air Artillery) AAA Regiment in Laguta, 505rd AAA Regiment in Xiaofengman, and the 509th AAA Regiment in Shenyang joined the division. In September 1957, following the merge of the Air Force and the Air Defense Force, the division redesignated as the 107th Anti-Aircraft Artillery Division of Air Force ().\nOn July 19, 1958, the 402nd Searchlight Regiment was added to the division.\nIn March 1960, the 4th Independent Anti-Aircraft Artillery Battalion was activated.\nOn March 1, 1964, the division was redesignated as the 6th Anti-Aircraft Artillery Division of Air Force(). The 503rd, 521st, and 527th regiments were redesignated as the 16th, 2nd, and 18th Anti-Aircraft Artillery Regiments, respectively. The 402nd Searchlight Regiment was redesignated as the 5th Searchlight Regiment.\nBy then the division was composed of:\n*2nd Anti-Aircraft Artillery Regiment\n*16th Anti-Aircraft Artillery Regiment\n*18th Anti-Aircraft Artillery Regiment\n*5th Searchlight Regiment\n*4th Independent Anti-Aircraft Artillery Battalion\nIn December 1964, the division exchanged its 2nd AAA Regiment with the 3rd AAA Regiment from the 1st Antiaircraft Artillery Division of Air Force.\nIn July 1969, the 17th Anti-Aircraft Artillery Regiment was activated. The 4th Independent AAA Battalion merged into the 17th AAA Regiment as its 3rd battalion.\nIn April 1975, the 5th Searchlight Regiment was disbanded.\nOn February 23, 1976, the 17th Anti-Aircraft Artillery Regiment detached from the division and reorganized as the 19th Surface-to-Air Missile Regiment. The 36th AAA Regiment joined the division and was redesignated as the 17th Anti-Aircraft Artillery Regiment.\nIn September 1985, the division combined with the 18th Surface-to-Air Missile Regiment and reorganized into the 6th Composite Air Defense Brigade of Air Force().\nThe brigade was disbanded in December 1993.\nReferences\n*沈空高炮第6师, http://www.miss81.com/new_view.aspx?id=21"
    }
  ]
}