{
  "content": [
    {
      "type": "text",
      "text": "# 6th century in Ireland\n\nEvents from the 6th century in Ireland.\n500s\n;506\n* 23 March - Death of Bishop Mac Cairthinn of Clogher.\n;507\n* Death of Lugaid mac Lóegairi, High King of Ireland.\n* 3 September - Death of St. Mac Nisi, Bishop of Connor (according to some sources, see 509 below).\n;509\n* 3 September - Death of St. Mac Nisi, Bishop of Connor (according to some sources; see 507 above).\n510s\n;512\n* 29 June - A solar eclipse is recorded.\n* 2 November - Death of Bishop Erc of Slane (according to some sources; see 513 below).\n;513\n* 2 November - Death of Bishop Erc of Slane (according to some sources; see 512 above).\n;515\n* Birth of Abbot Cainnech of Aghaboe at Glengiven near Dungiven in Ulster (according to some sources; see 516 below).\n;516\n* Battle of Druim Derge in Leinster; the Laigin finally lose the Irish Midlands to the Uí Néill.\n* Birth of Bishop Ciarán of Clonmacnoise (\"Ciarán the Younger\"), one of the Twelve Apostles of Ireland.\n* Birth of Abbot Cainnech of Aghaboe at Glengiven near Dungiven in Ulster (according to some sources; see 515 above).\n;517&ndash;518\n* 6 July - Death of St. Moninne (Darercae) at the convent she established at Killeavy (year varies according to sources).\n520s\n;520\n* Monastery founded in Ballyleague by St. Faithleach of Clontuskert (brother of Brendan).\n* Clonard Abbey in modern County Meath founded by St. Finnian of Clonard.\n*3 May - Death of Conleth, Bishop of Kildare (in 516 according to some sources).\n*(approximate year) - Clane Friary founded by Ailbe of Emly\n;521\n*7 December - Birth of Columba (Colm Cille or Columcille) in Gartan, missionary monk (died 597).\n*7 December - Death of St. Búite of Monasterboice.\n;522\n* Death of Eochaid mac Óengusa, an Eoganachta king of Munster. His son Crimthann Srem mac Echado succeeds him.\n;523\n* St. Ninnidh made the island of Inishmacsaint (island of plain Sorrell) in Lough Erne his headquarters around 523.\n;523&ndash;526\n* 1 February - Death of St. Brigit of Kildare (year varies according to sources) (born c.451).\n;527\n* Death of Illan mac Dúnlainge, King of Leinster.\n;527&ndash;528\n* 12 September or 30 December - Death of Bishop Ailbe of Emly (year varies according to sources; also given as 534 or 542).\n530s\n;530\n*Brendan completes building of monastic cells at Ardfert\n*Monastic settlements are established on Lambay Island and at Clonmore, County Carlow.\n*Birth of Dallán Forgaill, Ollamh Érenn, on Magh Slécht.\n*Birth of Saint Moluag in Dál nAraidi.\n* Death of Saint Cainnear of Bantry\n*Approximate date - Death of St. Enda of Aran.\n;531 (or 537)\n;\n*Maine mac Cearbhall, 1st King of Uí Maine, died 531 or 537.\n;534\n* 12 September or 30 December - Death of Bishop Ailbe of Emly (year varies according to sources; also given as 527, 528 or 542).\n;535\n* Possible mega-eruption of Rabual caldera volcano between }}.\n* Extreme weather events\n* 20 August - Death of St. Mochta of Louth (disciple of St. Patrick) (in 537 according to some sources).\n;536\n* Extreme weather events causes Late Antique Little Ice Age\n* Irish Annals record famine in Ireland.\n;537\n* Late Antique Little Ice Age\n* A plague strikes Britain and Ireland.\n;538\n* Late Antique Little Ice Age\n* Irish Annals records famine in Ireland.\n* Death of missionary Manchan of Mohill.\n;539\n* Late Antique Little Ice Age\n* Irish Annals records famine in Ireland.\n540s\n;540\n* Birth of Columbanus at Nobber in the Kingdom of Meath.\n* Approximate date - The Paschal controversy begins in Ireland.\n;542\n* 12 September or 30 December - Death of Bishop Ailbe of Emly (year varies according to sources; also given as 527, 528 or 534).\n;545\n* Monastery founded at Clonmacnoise by St. Ciarán.\n;546\n* Columba founds Derry.\n* Approximate date - Death of Abbot Ciarán of Clonmacnoise (of yellow fever) (according to some sources - see 556 below).\n;549\n*Roman Catholic Diocese of Ossory, which still exists, founded.\n*Death of St. Finnian of Clonard, who founded Clonard Abbey.\n550s\n;550\n* Birth of Bishop Máedóc of Ferns (St. Áedan or Mogue) on Magh Slécht.\n;552\n* Death of St. Finnian of Clonard, founder of Clonard Abbey.\n;556\n* Death of Abbot Ciarán of Clonmacnoise (of yellow fever) (according to some sources - see 546 above).\n;557\n* Death of the probably legendary Colmán Már mac Diarmato, a king of Uisnech in Mide of the Clann Cholmáin.\n560s\n;563\n* Columba founds a monastery on Iona off the coast of Scotland.\n* Brendan founds a monastery at Clonfert.\n570s\n;570\n* Death of Laisrén mac Nad Froích (St. Molaise).\n;573\n* Death of Abbot Brendan of Birr, one of the Twelve Apostles of Ireland.\n;575\n* Convention of Druim Ceat, at which agreement is reached between the Uí Néill and the king of Dál Riata maintaining the peace and the balance of power. The poets are said to have been saved from banishment by the intervention of Columba.\n* Bishop Muiredach of Killala meets with Columba in Ballysadare.\n;576\n* Death of Colmán Már mac Coirpre, King of Leinster.\n;577\n* Death of Brendan.\n* Death of Coirpre Cromm mac Crimthainn, King of Munster from the Glendamnach sept of the Eoganachta. He is succeeded by Fergus Scandal mac Crimthainn.\n580s\n;584\n* The foundation of the University of Tuaim Drecain (Tomregan) by the Synod of Drumceat on Magh Slécht.\n;585\n*Suibne mac Colmáin becomes King of Uisnech in Mide of the Clann Cholmáin. He is the son of King Colmán Már mac Diarmato (died 557) and rules Uisnech until his death in 598.\n;588\n*Áed Dub mac Suibni (died c. 588) was an Irish king of the Cruthin of Dál nAraidi (in modern Ulster). He may have been king of the Ulaid.\n590s\n;590\n* Columbanus and twelve companions set sail for France.\n;593\n* Death of Áed Dibchine mac Senaig  King of Leinster from the Uí Máil branch of the Laigin, the first king of this branch to hold the overlordship of Leinster.\n;595\n*Death of Saint Berach of Termonbarry\n;597\n* 9 June - Death of Columba, missionary monk, on Iona (born 521).\n;598\n* Monastery established in Ferns, County Wexford, dedicated to Bishop Máedóc of Ferns (St. Áedan or Mogue).\n* Suibne mac Colmáin, King of Uisnech in Mide of the Clann Cholmáin, is killed by his uncle Áed Sláine.\n;599&ndash;600\n* Death of St. Cainnech. He was buried at Aghaboe Abbey, which he had founded. His feast day is commemorated on 11 October in the Roman Catholic Church ([http://www.catholic.org/saints/saint.php?saint_id=171 Catholic Online]) and on the 1 August or 14 August in the Eastern Orthodox Church.\n600s\n;600\n*Death of Uatu mac Áedo a king of Connacht from the Uí Briúin branch of the Connachta.\nReferences"
    }
  ]
}