{
  "content": [
    {
      "type": "text",
      "text": "# 6th Screen Actors Guild Awards\n\n| location = Shrine AuditoriumLos Angeles, California\n| country = United States\n| presenter = Screen Actors Guild\n| reward =\n| year = 1995\n| year2 =\n| holder =\n| host =\n| preshow_host =\n| acts =\n| network = TNT\n| runtime =\n| ratings =\n| producer =\n| director =\n| most_awards =\n| most_nominations =\n| website =\n| image2 =\n| image2size =\n| alt2 =\n| caption2 =\n| previous = 5th\n| main = Screen Actors Guild Awards\n| next = 7th\n}}\nThe 6th Screen Actors Guild Awards, honoring the best achievements in film and television performances for the year 1999, took place on March 12, 2000. The ceremony was held at the Shrine Exposition Center in Los Angeles, California, and was televised live by TNT.\nThe nominees were announced on February 1, 2000 by Lolita Davidovich and Blair Underwood.\nWinners and nominees\nWinners are listed first and highlighted in boldface.\n, Outstanding Performance by a Male Actor in a Leading Role winner]]\n, Outstanding Performance by a Female Actor in a Leading Role winner]]\n, Outstanding Performance by a Male Actor in a Supporting Role winner]]\n, Outstanding Performance by a Female Actor in a Supporting Role winner]]\n, Outstanding Performance by a Male Actor in a Miniseries or Television Movie winner]]\n, Outstanding Performance by a Female Actor in a Miniseries or Television Movie winner]]\n, Outstanding Performance by a Male Actor in a Drama Series winner]]\n, Outstanding Performance by a Female Actor in a Drama Series winner]]\n, Outstanding Performance by a Male Actor in a Comedy Series winner]]\n, Outstanding Performance by a Female Actor in a Comedy Series winner]]\nScreen Actors Guild Life Achievement Award\n* Sidney Poitier\nFilm\n{| class=wikitable style=\"width=\"100%\"\n|-\n! style=\"background:#FAEB86;\" width=\"50%\"| Outstanding Performance by a Male Actor in a Leading Role\n! style=\"background:#FAEB86;\" width=\"50%\"| Outstanding Performance by a Female Actor in a Leading Role\n|-\n| valign=\"top\" |\n*'Kevin Spacey – American Beauty as Lester Burnham'\n** Jim Carrey – Man on the Moon as Andy Kaufman\n** Russell Crowe – The Insider as Jeffrey Wigand\n** Philip Seymour Hoffman – Flawless as Rusty\n** Denzel Washington – The Hurricane as Rubin \"Hurricane\" Carter\n| valign=\"top\" |\n*'Annette Bening – American Beauty as Carolyn Burnham'\n** Janet McTeer – Tumbleweeds as Mary Jo Walker\n** Julianne Moore – The End of the Affair as Sarah Miles\n** Meryl Streep – Music of the Heart as Roberta Guaspari\n** Hilary Swank – ''Boys Don't Cry as Brandon Teena\n|-\n! style=\"background:#FAEB86;\"| Outstanding Performance by a Male Actor in a Supporting Role\n! style=\"background:#FAEB86;\"| Outstanding Performance by a Female Actor in a Supporting Role\n|-\n| valign=\"top\" |\n*'Michael Caine – The Cider House Rules as Dr. Wilbur Larch'\n** Chris Cooper – American Beauty as Colonel Frank Fitts\n** Tom Cruise – Magnolia as Frank T.J. Mackey\n** Michael Clarke Duncan – The Green Mile as John Coffey\n** Haley Joel Osment – The Sixth Sense as Cole Sear\n| valign=\"top\" |\n*'Angelina Jolie – Girl, Interrupted as Lisa Rowe'\n** Cameron Diaz – Being John Malkovich as Lotte Schwartz\n** Catherine Keener – Being John Malkovich as Maxine Lund\n** Julianne Moore – Magnolia as Linda Partridge\n** Chloë Sevigny – Boys Don't Cry as Lana Tisdel\n|-\n! colspan=\"2\" style=\"background:#FAEB86;\"| Outstanding Performance by a Cast in a Motion Picture\n|-\n| colspan=\"2\" style=\"vertical-align:top;\"|\n* 'American Beauty – Annette Bening, Wes Bentley, Thora Birch, Chris Cooper, Peter Gallagher, Allison Janney, Kevin Spacey, and Mena Suvari'\n** Being John Malkovich – Orson Bean, John Cusack, Cameron Diaz, Catherine Keener, John Malkovich, Mary Kay Place, and Charlie Sheen\n** The Cider House Rules – Jane Alexander, Erykah Badu, Kathy Baker, Michael Caine, Delroy Lindo, Tobey Maguire, Kate Nelligan, Paul Rudd, and Charlize Theron\n** The Green Mile – Patricia Clarkson, James Cromwell, Jeffrey DeMunn, Michael Clarke Duncan, Graham Greene, Tom Hanks, Bonnie Hunt, Doug Hutchison, Michael Jeter, David Morse, Barry Pepper, Sam Rockwell, and Harry Dean Stanton\n** Magnolia – Jeremy Blackman, Tom Cruise, Melinda Dillon, April Grace, Luis Guzmán, Philip Baker Hall, Philip Seymour Hoffman, Ricky Jay, William H. Macy, Alfred Molina, Julianne Moore, John C. Reilly, Jason Robards, and Melora Walters\n|}\nTelevision\n{| class=wikitable style=\"width=\"100%\"\n|-\n! style=\"background:#FAEB86;\" width=\"50%\"| Outstanding Performance by a Male Actor in a Miniseries or Television Movie\n! style=\"background:#FAEB86;\" width=\"50%\"| Outstanding Performance by a Female Actor in a Miniseries or Television Movie\n|-\n| valign=\"top\" |\n* 'Jack Lemmon – Tuesdays with Morrie as Morrie Schwartz'\n** Hank Azaria – Tuesdays with Morrie as Mitch Albom\n** Peter Fonda – The Passion of Ayn Rand as Frank\n** George C. Scott – Inherit the Wind as Matthew Harrison Brady\n** Patrick Stewart – A Christmas Carol as Ebenezer Scrooge\n| valign=\"top\" |\n* 'Halle Berry – Introducing Dorothy Dandridge as Dorothy Dandridge'\n** Kathy Bates – Annie as Miss Agatha Hannigan\n** Judy Davis – A Cooler Climate as Paula\n** Sally Field – A Cooler Climate as Iris\n** Helen Mirren – The Passion of Ayn Rand as Ayn Rand\n|-\n! style=\"background:#FAEB86;\"| Outstanding Performance by a Male Actor in a Drama Series\n! style=\"background:#FAEB86;\"| Outstanding Performance by a Female Actor in a Drama Series\n|-\n| valign=\"top\" |\n* 'James Gandolfini – The Sopranos as Tony Soprano'\n** David Duchovny – The X-Files as Fox Mulder\n** Dennis Franz – NYPD Blue as Andy Sipowicz\n** Rick Schroder – NYPD Blue as Danny Sorenson\n** Martin Sheen – The West Wing as Josiah Bartlet\n| valign=\"top\" |\n* 'Edie Falco – The Sopranos as Carmela Soprano'\n** Gillian Anderson – The X-Files as Dana Scully\n** Lorraine Bracco – The Sopranos as Jennifer Melfi\n** Nancy Marchand – The Sopranos as Livia Soprano\n** Annie Potts – Any Day Now'' as Mary Elizabeth \"M.E.\" O'Brien Sims\n|-\n! style=\"background:#FAEB86;\"| Outstanding Performance by a Male Actor in a Comedy Series\n! style=\"background:#FAEB86;\"| Outstanding Performance by a Female Actor in a Comedy Series\n|-\n| valign=\"top\" |\n* 'Michael J. Fox – Spin City as Mike Flaherty'\n** Kelsey Grammer – Frasier as Frasier Crane\n** Peter MacNicol – Ally McBeal as John Cage\n** David Hyde Pierce – Frasier as Niles Crane\n** Ray Romano – Everybody Loves Raymond as Ray Barone\n| valign=\"top\" |\n* 'Lisa Kudrow – Friends as Phoebe Buffay'\n** Calista Flockhart – Ally McBeal as Ally McBeal\n** Lucy Liu – Ally McBeal as Ling Woo\n** Sarah Jessica Parker – Sex and the City as Carrie Bradshaw\n** Tracey Ullman – Tracey Takes On... as Various Characters\n|-\n! colspan=\"2\" style=\"background:#FAEB86;\"| Outstanding Performance by an Ensemble in a Drama Series\n|-\n| colspan=\"2\" style=\"vertical-align:top;\"|\n* 'The Sopranos – Lorraine Bracco, Dominic Chianese, Jamie-Lynn Sigler, Edie Falco, James Gandolfini, Robert Iler, Michael Imperioli, Nancy Marchand, Vincent Pastore, Tony Sirico, and Steve Van Zandt'\n**ER – Anthony Edwards, Laura Innes, Alex Kingston, Eriq La Salle, Julianna Margulies, Paul McCrane, Michael Michele, Erik Palladino, Gloria Reuben, Goran Vinsjic, and Noah Wyle\n** Law & Order – Benjamin Bratt, Angie Harmon, Steven Hill, Carey Lowell, Jesse L. Martin, Jerry Orbach, and Sam Waterston\n** NYPD Blue – Bill Brochtrup, Gordon Clapp, Kim Delaney, Dennis Franz, James McDaniel, Rick Schroder, Andrea Thompson, and Nicholas Turturro\n**The Practice – Michael Badalucco, Lara Flynn Boyle, Lisa Gay Hamilton, Steve Harris, Camryn Manheim, Dylan McDermott, Marla Sokoloff, and Kelli Williams\n|-\n! colspan=\"2\" style=\"background:#FAEB86;\"| Outstanding Performance by an Ensemble in a Comedy Series\n|-\n| colspan=\"2\" style=\"vertical-align:top;\"|\n* Frasier – Peri Gilpin, Kelsey Grammer, Jane Leeves, John Mahoney, and David Hyde Pierce\n**Ally McBeal – Gil Bellows, Lisa Nicole Carson, Portia de Rossi, Calista Flockhart, Greg Germann, Jane Krakowski, Lucy Liu, Peter MacNicol, Vonda Shepard, and Courtney Thorne-Smith\n** Everybody Loves Raymond – Peter Boyle, Brad Garrett, Patricia Heaton, Doris Roberts, Ray Romano, and Madylin Sweeten\n** Friends – Jennifer Aniston, Courteney Cox, Lisa Kudrow, Matt LeBlanc, Matthew Perry, and David Schwimmer\n** Sports Night – Josh Charles, Robert Guillaume, Felicity Huffman, Peter Krause, Sabrina Lloyd, and Joshua Malina\n|}\nReferences\nExternal links\n* [http://www.sagawards.org/awards/nominees-and-recipients/6th-annual-screen-actors-guild-awards The 6th Annual Screen Actors Guild Awards]"
    }
  ]
}