{
  "content": [
    {
      "type": "text",
      "text": "# 738th Expeditionary Airlift Squadron\n\n|branch=\n|type=\n|role=Airlift\n|size=\n|command_structure=Air Combat Command\n|current_commander=\n|garrison=\n|nickname=\n|motto=Fear Tac Air (≥2002)\n|colors=\n|march=\n|mascot=\n|battles=European Theater of OperationsOperation Iraqi Freedom\n|notable_commanders=\n|anniversaries=\n|decorations=Distinguished Unit CitationAir Force Outstanding Unit Award with Combat \"V\" Device\n|battle_honours=\n|identification_symbol=\n|identification_symbol_label=738th Expeditionary Airlift Squadron emblem (Approved, 12 June 2002)\n}}\nThe 738th Expeditionary Airlift Squadron is a provisional United States Air Force unit.  It is assigned to Air Combat Command (ACC) to activate or inactivate as needed. Reactivated after 2002, it operates Lockheed C-130 Hercules transport aircraft.  Its current status and duty location is undetermined.\nThe squadron was first activated as the 738th Bombardment Squadron in June 1943.  After training in the United States with the Consolidated B-24 Liberator, the squadron deployed to the Mediterranean Theater of Operations, bombing Germany. It earned two Distinguished Unit Citations for its combat operations.  Following V-E Day, the squadron returned to the United States for conversion as a very heavy bomber unit, but was inactivated instead.\nThe squadron was activated in the Air Force Reserve in 1947, but does not appear to have been fully staffed or equipped before inactivating in 1949.  It was redesignated the 738th Troop Carrier Squadron and again activated in the reserve in 1952, but was inactivated the following year and its personnel and equipment transferred to another unit.  It was converted to provisional status in 2002 and assigned to Air Mobility Command.  It was reassigned to ACC in 2003.\nHistory\nWorld War II\nThe squadron was first organized as the 738th Bombardment Squadron at Alamogordo Army Air Field, New Mexico on 1 June 1943 as one of the four squadrons of the 454th Bombardment Group.  It trained with Consolidated B-24 Liberator bombers.  After completing training, it left for the Mediterranean Theater of Operations on 8 December 1943.\nThe squadron arrived in Italy, settling in at its combat station, San Giovanni Airfield, by the end of January 1944. Its primary focus was on long range bombing missions against industrial targets such as enemy oil refineries and munitions and aircraft factories.  It struck transportation targets including harbors and airfields in Italy, France, Germany, Austria, Czechoslovakia, Hungary, Yugoslavia, Greece and Romania  The squadron received a Distinguished Unit Citation (DUC) for a raid on an airfield at Bad Vöslau, Austria on 12 April 1944. The squadron earned a second DUC during an attack on a steel plant at Linz, Austria, as the 454th Group led its wing through determined opposition.\nThe squadron also flew air support and air interdiction missions against marshalling yards, troop concentrations and rail lines for Operation Strangle, the effort to choke off enemy supply lines in Italy.  The squadron participated in the drive to Rome; Operation Dragoon, the invasion of southern France; and Operation Grapeshot, the Spring 1945 offensive in Northern Italy.\nThe squadron left Italy in July 1945 and reformed at Sioux Falls Army Air Field, South Dakota the following month.  It was redesignated as a very heavy bombardment squadron in anticipation of training and redeployment to the Pacific, but with the Japanese surrender, it was inactivated in October.\nAir Force Reserve\nThe squadron was reactivated in August 1947 at McChord Field, Washington as a reserve unit.  It trained under the supervision of Air Defense Command's 406th AAF Base Unit (later 2345th Air Force Reserve Training Center).  The squadron was nominally a heavy bomber unit, but it is not clear whether it had any combat aircraft assigned.  In 1948 Continental Air Command (ConAC) assumed responsibility for managing reserve and Air National Guard units from ADC.\nPresident Harry S. Truman's reduced 1949 defense budget required reductions in the number of units in the Air Force, At the same time, the May 1949 Air Force Reserve program called for a new type of unit, the Corollary unit, which was a reserve unit integrated with an active duty unit.  The plan was viewed as the best method to train reservists by mixing them with an existing regular unit to perform duties alongside the regular unit.   As a result, the 454th Group and its 736th Squadron moved to Spokane Air Force Base, Washington to become corollary units of the 92d Bombardment Wing, while the 738th was inactivated and its personnel were absorbed by units of the 302d Troop Carrier Wing at McChord.\nThe reserve mobilization for the Korean War had left the reserve without aircraft, and the reserves did not receive them again until July 1952.   In preparing for the receipt of aircraft, in June 1952, ConAC activated the 454th Troop Carrier Wing at Portland International Airport, Oregon to replace the 922d Reserve Training Wing, the non-flying headquarters for reserve units there.  The squadron was redesignated the 738th Troop Carrier Squadron and activated with the 454th Wing.  It began training with Curtiss C-46 Commando transports.  However, on 1 January 1953, the 403d Troop Carrier Wing, a reserve unit that had served with Far East Air Forces in Japan and Korea, was relieved from active duty and replaced the 454th Wing at Portland.  As a result, the 738th inactivated and transferred it personnel and equipment to the 65th Troop Carrier Squadron, which was activated in its place.\nExpeditionary Airlift\nOn 12 June 2002 the squadron was converted to provisional status and redesignated 738th Expeditionary Airlift Squadron. It was originally assigned to Air Mobility Command to activate or inactivate as needed, but in 2003, it was transferred to Air Combat Command.  Activated as a Lockheed C-130 Hercules tactical intra-theater airlift squadron (nine months prior the 2013 invasion of Iraq) and consisted of multiple rotational detachments from active-duty, Air National Guard and Air Force Reserve airlift squadrons.\nBeginning in October 2004, the squadron was based at Ali Al Salem Air Base, assigned to 386th Air Expeditionary Wing.\nLineage\n* Constituted as the 738th Bombardment Squadron (Heavy) on 14 May 1943\n: Activated on 1 June 1943\n: Redesignated 738th Bombardment Squadron, Heavy c. 1944\n: Redesignated 738th Bombardment Squadron, Very Heavy on 5 August 1945\n: Inactivated on 17 October 1945\n* Activated in the reserve on 16 August 1947\n: Inactivated on 27 June 1949\n* Redesignated 738th Troop Carrier Squadron, Medium on 26 May 1952\n: Activated in the reserve on 13 June 1952\n: Inactivated on 1 January 1953\n* Redesignated: 738th Expeditionary Airlift Squadron and converted to provisional status on 12 June 2002\nAssignments\n* 454th Bombardment Group, 1 June 1943 – 17 October 1945\n* 454th Bombardment Group, 16 August 1947 – 27 June 1949\n* 454th Troop Carrier Group, 13 June 1952 – 1 January 1953\n* Air Mobility Command to activate or inactivate as needed, 12 June 2002\n* Air Combat Command to activate or inactivate as needed, 19 March 2003\nStations\n* Alamogordo Army Air Field, New Mexico, 1 June 1943\n* Davis-Monthan Field, Arizona,  1 July 1943\n* McCook Army Air Field, Nebraska, 30 July 1943\n* Charleston Army Air Field, South Carolina, 3 October–8 December 1943\n* San Giovanni Airfield, Italy 21 January 1944 – July 1945\n* Sioux Falls Army Air Field, South Dakota, 1 August 1945\n* Pyote Army Air Field, Texas, 17 August – 17 October 1945\n* McChord Field (later McChord Air Force Base), Washington, 16 August 1947 – 27 June 1949\n* Portland International Airport, Oregon, 13 June 1952 – 1 January 1953\n* Ali Al Salem Air Base, Kuwait, Oct 2004\nAircraft\n* Consolidated B-24 Liberator, 1943-1945\n* Curtiss C-46 Commando, 1952-1953\n}}\n{| class=\"wikitable\"\n|- style=\"background:#efefef;\"\n! Campaign Streamer\n! Campaign\n! Dates\n! Notes\n|-\n|200px||Air Offensive, Europe||16 January 1944 – 5 June 1944||738th Bombardment Squadron\n|-\n|200px||Air Combat, EAME Theater||16 January 1944 – 11 May 1945||738th Bombardment Squadron\n|-\n|200px||Naples-Foggia||16 January 1944 – 21 January 1944||738th Bombardment Squadron\n|-\n|200px||Rome-Arno||22 January 1944 – 9 September 1944||738th Bombardment Squadron\n|-\n|200px||Central Europe||22 March 1944 – 21 May 1945||738th Bombardment Squadron\n|-\n|200px||Normandy||6 June 1944 – 24 July 1944||738th Bombardment Squadron\n|-\n|200px||Northern France||25 July 1944 – 14 September 1944||738th Bombardment Squadron\n|-\n|200px||Southern France||15 August 1944 – 14 September 1944||738th Bombardment Squadron\n|-\n|200px||North Apennines||10 September 1944 – 4 April 1945||738th Bombardment Squadron\n|-\n|200px||Rhineland||15 September 1944 – 21 March 1945||738th Bombardment Squadron\n|-\n|200px||Po Valley||3 April 1945 – 8 May 1945||738th Bombardment Squadron\n|-\n|||Transition of Iraq ||2 May 2003 -28 June 2004||738th Expeditionary Airlift Squadron\n|-\n|||National Resolution||16 December 2005 – 9 January 2007||738th Expeditionary Airlift Squadron\n|-\n|||Iraqi Surge||10 January 2007 – 31 December 2008||738th Expeditionary Airlift Squadron\n|-\n|200px||Global War on Terror Expeditionary Medal|||| 738th Expeditionary Airlift Squadron\n|}\nReferences\nNotes\n; Explanatory notes\n; Citations\nBibliography\n*\n*\n*\n*\n*"
    }
  ]
}