{
  "content": [
    {
      "type": "text",
      "text": "# 75th Writers Guild of America Awards\n\nThe 75th Writers Guild of America Awards were held on March 5, 2023, to honor the best writing in film, television and radio of 2022. The nominees for television and radio were announced on January 11, 2023, while the nominees for the film categories were announced on January 25, 2023.\nThe ceremony was hosted by American actress and comedian Janelle James.\nWinners and nominees\nFilm\n{| class=\"wikitable\"\n|-\n| style=\"vertical-align:top;\" | |Best Original Screenplay}}\n* 'Everything Everywhere All at Once – Daniel Kwan and Daniel Scheinert' †\n** The Fabelmans – Steven Spielberg and Tony Kushner\n** The Menu – Seth Reiss and Will Tracy\n** Nope – Jordan Peele\n** Tár – Todd Field\n|-\n| style=\"vertical-align:top;\" | |Best Adapted Screenplay}}\n* 'Women Talking – Sarah Polley; Based on the novel by Miriam Toews' †\n** Black Panther: Wakanda Forever – Ryan Coogler and Joe Robert Cole; Story by Ryan Coogler; Based on the Marvel Comics\n** Glass Onion: A Knives Out Mystery – Rian Johnson; Based on the character Benoit Blanc, from the film Knives Out by Johnson\n** She Said – Rebecca Lenkiewicz; Based on The New York Times article by Jodi Kantor, Megan Twohey and Rebecca Corbett and the book by Jodi Kantor and Megan Twohey\n** Top Gun: Maverick – Ehren Kruger, Eric Warren Singer and Christopher McQuarrie; Story by Peter Craig and Justin Marks; Based on characters created by Jim Cash and Jack Epps Jr.\n|-\n| style=\"vertical-align:top;\" | |Best Documentary Screenplay}}\n* 'Moonage Daydream – Brett Morgen'\n** 2nd Chance – Ramin Bahrani\n** Downfall: The Case Against Boeing – Mark Bailey and Keven McAlester\n** Last Flight Home – Ondi Timoner\n** ¡Viva Maestro! – Theodore Braun\n|-\n|}\nTelevision\n{| class=\"wikitable\"\n|-\n| style=\"vertical-align:top;\" | |Drama Series}}\n* 'Severance (Apple TV+) – Chris Black, Andrew Colville, Kari Drake, Dan Erickson, Mark Friedman, Helen Leigh, Anna Moench, Amanda Overton'\n** Andor (Disney+) – Dan Gilroy, Tony Gilroy, Stephen Schiff, Beau Willimon\n** Better Call Saul (AMC) – Ann Cherkis, Vince Gilligan, Peter Gould, Ariel Levine, Thomas Schnauz, Gordon Smith, Alison Tatlock\n** The Crown (Netflix) – Peter Morgan\n** Yellowjackets (Showtime) – Cameron Brent Johnson, Katherine Kearns, Jonathan Lisco, Ashley Lyle, Bart Nickerson, Liz Phang, Ameni Rozsa, Sarah L. Thompson, Chantelle M. Wells\n|-\n| style=\"vertical-align:top;\" | |Comedy Series}}\n* 'The Bear'' (FX) – Karen Joseph Adcock, Joanna Calo, Rene Gube, Sofya Levitsky-Weitz, Alex O'Keefe, Catherine Schetina, Christopher Storer'\n** Abbott Elementary (ABC) – Quinta Brunson, Ava Coleman, Riley Dufurrena, Justin Halpern, Joya McCrory, Morgan Murphy, Brittani Nichols, Kate Peterman, Brian Rubenstein, Patrick Schumacker, Justin Tan, Jordan Temple, Garrett Werner\n** Barry (HBO) – Emma Barrie, Alec Berg, Duffy Boudreau, Bill Hader, Emily Heller, Nicky Hirschhorn, Jason Kim, Liz Sarnoff\n** Hacks (HBO Max) – Lucia Aniello, Jessica Chaffin, Paul W. Downs, Ariel Karlin, Andrew Law, Joe Mande, Aisha Muharrar, Pat Regan, Samantha Riley, Jen Statsky\n** Only Murders in the Building (Hulu) – Matteo Borghese, Rachel Burger, Kirker Butler, Valentina Garza, Madeleine George, Joshua Allen Griffith, John Hoffman, Noah Levine, Stephen Markley, Kristin Newman, Ben Philippe, Ben Smith, Rob Turbovsky\n|-\n| style=\"vertical-align:top;\" | |New Series}}\n* 'Severance (Apple TV+) – Chris Black, Andrew Colville, Kari Drake, Dan Erickson, Mark Friedman, Helen Leigh, Anna Moench, Amanda Overton'\n** Abbott Elementary (ABC) – Quinta Brunson, Ava Coleman, Riley Dufurrena, Justin Halpern, Joya McCrory, Morgan Murphy, Brittani Nichols, Kate Peterman, Brian Rubenstein, Patrick Schumacker, Justin Tan, Jordan Temple, Garrett Werner\n** Andor (Disney+) – Dan Gilroy, Tony Gilroy, Stephen Schiff, Beau Willimon\n** Bad Sisters (Apple TV+) – Brett Baer, Dave Finkel, Sharon Horgan\n** The Bear'' (FX) – Karen Joseph Adcock, Joanna Calo, Rene Gube, Sofya Levitsky-Weitz, Alex O'Keefe, Catherine Schetina, Christopher Storer\n|-\n| style=\"vertical-align:top;\" | |Limited Series}}\n* 'The White Lotus (HBO) – Mike White'\n** The Dropout (Hulu) – Hilary Bettis, Liz Hannah, Liz Heldens, Dan LeFranc, Sofya Levitsky-Weitz, Matt Lutsky, Elizabeth Meriwether, Wei-Ning Yu\n** Fleishman Is in Trouble (Hulu) – Taffy Brodesser-Akner, Cindy Chupack, Allison P. Davis, Mike Goldbach, Boo Killebrew\n** Pam & Tommy (Hulu) – Brooke Baker, Matthew Bass, Theodore Bressman, D.V. DeVincentis, Sarah Gubbins, Robert Siegel\n** The Staircase (HBO Max) – Aisha Bhoori, Antonio Campos, Maggie Cohn, Aja Gabel, Emily Kaczmarek, Craig Shilowich, Sebastian Silva\n|-\n| style=\"vertical-align:top;\" ||TV & New Media Motion Pictures}}\n* 'Honor Society (Paramount+) – David A. Goodman'\n** Heart of the Matter (Hallmark Channel) – Karen Struck\n** Ray Donovan: The Movie (Showtime) – David Hollander & Liev Schreiber\n** Torn Hearts (Epix) – Rachel Koller Croft\n** Weird: The Al Yankovic Story (The Roku Channel) – Al Yankovic & Eric Appel\n|-\n| style=\"vertical-align:top;\" | |Animation}}\n* '\"Rectify\" – Undone (Prime Video) – Elijah Aron & Patrick Metcalf'\n** \"Girls Just Shauna Have Fun\" – The Simpsons (Fox) – Jeff Westbrook\n** \"The Pain Garden\" – Tuca & Bertie (Adult Swim) – Lisa Hanawalt\n** \"Pixelated and Afraid\" – The Simpsons (Fox) – John Frink\n** \"The Sound of Bleeding Gums\" – The Simpsons (Fox) – Loni Steele Sosthand\n** \"To Bob, or Not to Bob\" – ''Bob's Burgers (Fox) – Lizzie Molyneux-Logelin & Wendy Molyneux\n|-\n| style=\"vertical-align:top;\" | |Episodic Drama}}\n* '\"Plan and Execution\" – Better Call Saul (AMC) – Thomas Schnauz'\n** \"A Hard Way to Go\" – Ozark (Netflix) – Chris Mundy\n** \"The End of Everything\" – The Good Fight (CBS) – Robert King & Michelle King\n** \"The Prick\" – Bad Sisters (Apple TV+) – Sharon Horgan and Dave Finkel & Brett Baer\n** \"Rock and Hard Place\" – Better Call Saul (AMC) – Gordon Smith\n** \"The We We Are\" – Severance (Apple TV+) – Dan Erickson\n|-\n| style=\"vertical-align:top;\" | |Episodic Comedy}}\n* '\"The One, the Only\" – Hacks (HBO Max) – Lucia Aniello & Paul W. Downs & Jen Statsky'\n** \"The Beginning\" – Grace and Frankie (Netflix) – Marta Kauffman & Howard J. Morris\n** \"Braciole\" – The Bear (FX) – Joanna Calo & Christopher Storer\n** \"Foie Gras\" – Julia (HBO Max) – Daniel Goldfarb & Chris Keyser\n** \"Private School\" – What We Do in the Shadows (FX) – Ayo Edebiri & Shana Gohd\n** \"Wide Net\" – Reservation Dogs (FX) – Tazbah Rose Chavez\n|-\n| style=\"vertical-align:top;\" | |Comedy/Variety – Talk Series}}\n* 'Last Week Tonight with John Oliver (HBO) – Senior Writers: Daniel O'Brien, Owen Parsons, Charlie Redd, Joanna Rothkopf, Seena Vali; Writers: Johnathan Appel, Ali Barthwell, Tim Carvell, Liz Hynes, Ryan Ken, Mark Kramer, Sofia Manfredi, John Oliver, Taylor Kay Phillips, Chrissy Shackelford'\n** Full Frontal with Samantha Bee (TBS) – Head Writers: Kristen Bartlett, Mike Drucker; Supervising Writers: Joe Grossman, Sahar Rizvi, Alison Zeidman; Writers: Samantha Bee, Pat Cassels, Sean Alexander Crespo, Miles Kahn, Michael Rhoa, Chris Thompson, Holly Walker\n** Hell of A Week with Charlamagne tha God (Comedy Central) – Writers: Cynia Barnwell, Josh Lieb, Charles McBee, Dan McCoy, Lenard McKelvey, Andre D. Thompson\n** Jimmy Kimmel Live! (ABC) – Head Writers: Molly McNearney, Danny Ricker; Writers: Jamie Abrahams, Rory Albanese, Tony Barbieri, Jonathan Bines, Joelle Boucai, Bryan Cook, Blaire Erskine, Devin Field, Gary Greenberg, Josh Halloway, Eric Immerman, Jesse Joyce, Jimmy Kimmel, Greg Martin, Jesse McLaren, Keaton Patti, Louis Virtel, Troy Walker\n** Late Night with Seth Meyers (NBC) – Head Writer: Alex Baze; Supervising Writers: Seth Reiss, Mike Scollins; Closer Look Supervising Writer: Sal Gentile; Writers: Jermaine Affonso, Karen Chee, Bryan Donaldson, Matt Goldich, Dina Gusovsky, Jenny Hagel, Allison Hord, Mike Karnell, John Lutz, Seth Meyers, Ian Morgan, Amber Ruffin, Mike Shoemaker, Ben Warheit, Jeff Wright\n** The Problem with Jon Stewart (Apple TV+) – Head Writer: Kristen Acimovic; Writers: Henrik Blix, Rob Christensen, Jay Jurden, Alexa Loftus, Tocarra Mallard, Maria Randazzo, Robby Slowik, Jon Stewart, Kasaun Wilson\n** Stephen Colbert Presents Tooning Out the News (Comedy Central) – Head Writers: Mike Leech, Zach Smilovitz; Supervising Writers: Addison Anderson, Bob Powers; Writers: Sarah Caldwell, Stephen Colbert, R.J. Fried, Julie Greiner, Ron Metellus, Libby Schreiner, Hannah Wright\n|-\n| style=\"vertical-align:top;\" | |Comedy/Variety – Specials}}\n* 'Jerrod Carmichael: Rothaniel (HBO) – Written by Jerrod Carmichael'\n** The National Memorial Day Concert 2022 (PBS) – Written by Kirk Ellis and Jon Macks; Special Material Written by Rita Brent\n** The Problem with Jon Stewart: Election Wrap-Up Special (Apple TV+) – Head Writer: Kristen Acimovic; Writers: Henrik Blix, Rob Christensen, Jay Jurden, Alexa Loftus, Tocarra Mallard, Robby Slowik, Maria Randazzo, Jon Stewart and Kasaun Wilson\n** Stand Out: An LGBTQ+ Celebration'' (Netflix) – Head Writers: Matt Roberts and Beth Sherman; Writers: Rita Brent, Page Hurwitz and Carey O'Donnell; Special Material Written by Guy Branum, Chris Sartinsky and Louis Virtel\n|-\n| style=\"vertical-align:top;\" | |Comedy/Variety – Sketch Series}}\n* 'Inside Amy Schumer (Paramount+) – Writers: Georgie Aldaco, Rosebud Baker, Jeremy Beiler, Cazzie David, Tova Diker, Derek Gaines, Jon Glaser, Jaye McBride, Tim Meadows, Christine Nangle, Daniel Powell, Tami Sagher, Yamaneika Saunders, Amy Schumer, Sascha Seinfeld, Joe Strazzullo, Sydnee Washington and Ron Weiner'\n** PAUSE with Sam Jay (HBO) – Writers: Emmy Blotnick, Ryan Donahue, Megan Gailey, Sam Jay, Joyelle Johnson, Langston Kerman, Jak Knight (), Teresa Lo, Lucy Ortiz and Lorena Russi\n** Saturday Night Live (NBC) – Head Writers: Michael Che, Alison Gates, Colin Jost, Streeter Seidell and Kent Sublette; Senior Writer: Bryan Tucker; Writers James Anderson, Rosebud Baker, Dan Bulla, Mike DiCenzo, Billy Domineau, James Downey, Alex English, Jimmy Fowlie, Martin Herlihy, John Higgins, Steve Higgins, Vannessa Jackson, Erik Kenward, Tesha Kondrat, Ben Marshall, Lorne Michaels, Jake Nordwind, Clare O'Kane, Ceara O'Sullivan, Simon Rich, Ben Silva, John Solomon, Will Stephen, Nicole Sun, Auguste White and Celeste Yim; Weekend Update Head Writer: Pete Schultz; Weekend Update Writers: Megan Callahan-Shah, Dennis McNicholas, Josh Patten, KC Shornima and Mark Steinbach\n|-\n| style=\"vertical-align:top;\" | |Quiz and Audience Participation}}\n* 'Baking It (Peacock) – Writers: Neil Casey, Chad Carter, Jessica McKenna and Zach Reino'\n** Capital One College Bowl (NBC) – Head Writer: Harry Friedman; Writers: Jason Antoniewicz, Alan Bailey, Eli Bauman, Patricia A. Cotter, Riham El-Ounsi, Joyce Ikemi, Joey Ortega and Chris Sturgeon\n** Jeopardy! (ABC) – Head Writers: Michelle Loud and Billy Wisse; Writers: Michael Davies, John Duarte, Mark Gaberman, Debbie Griffin, Robert McClenaghan and Jim Rhine\n** Weakest Link (NBC) – Head Writer: Ann Slichter; Writers: Chip Dornell, Joyce Ikemi, Stuart Krasnow, Jon Macks, Meggie McFadden, Ryan O'Dowd, Veronica Penn-Turner, Scott Saltzburg, Aaron Solomon, Doug Shaffer and Grant Taylor\n|-\n| style=\"vertical-align:top;\" | |Daytime Drama}}\n*'Days of Our Lives (NBC) – Head Writer: Ron Carlivati; Writers: Lorraine Broderick, Jazmen Darnell Brown, Joanna Cohen, Carolyn Culliton, Richard Culliton, Cheryl Davis, Kirk Doering, Christopher Dunn, Jamey Giddens, David Kreizman, Ryan Quan, Dave Ryan, Katherine D. Schock\n|-\n| style=\"vertical-align:top;\" | |Short Form New Media}}\n* Three Busy Debras (Adult Swim) – Written by Sandy Honig, Mitra Jouhari, Sarah Sherman, Alyssa Stonoha, Diana Tay and Evan Waite'\n** Breakwater (Snapchat) – Written by Zach Craley\n** Carpool Karaoke: The Series (Apple TV+) – Head Writer: David Young; Writer: Casey Stewart\n|-\n|}\nChildren's\n{| class=\"wikitable\"\n|-\n| style=\"vertical-align:top;\" | |Children's Episodic, Long Form and Specials}}\n* '\"Prison by Palace\" – Life by Ella (Apple TV+) – Hernan Berangan'\n** \"A Perilous Journey\" – The Mysterious Benedict Society (Disney+) – Phil Hay & Matt Manfredi\n** \"Thursday\" – Life by Ella (Apple TV+) – Vincent Brown\n** \"Pilot\" – Amber Brown (Apple TV+) – Bonnie Hunt\n** \"Test Subject Thirteen\" – Circuit Breakers (Apple TV+) – Melody Fox\n|-\n|}\nDocumentary\n{| class=\"wikitable\"\n|-\n| style=\"vertical-align:top;\" | |Documentary Script – Current Events}}\n* '\"Lies, Politics and Democracy\" – Frontline (PBS) – Michael Kirk & Mike Wiser'\n** \"Episode Two: Resilience\" – Hiding in Plain Sight: Youth Mental Illness (PBS) – David Blistein\n** \"Inside the Alleged Sexual Assault Cover Up in Charlotte Schools\" – Vice News Tonight (Vice.com) – Arlissa Norman, Carter Sherman, Gilad Thaler\n|-\n| style=\"vertical-align:top;\" | |Documentary Script – Other than Current Events}}\n* '\"Episode Two: An American (1775 - 1790)\" – Benjamin Franklin (PBS) – Dayton Duncan'\n** \"Episode One: The Golden Door (Beginnings - 1938)\" – The U.S. and the Holocaust (PBS) – Geoffrey C. Ward\n** Lucy and Desi (Prime Video) – Mark Monroe\n** \"Ocean Invaders\" – Nova (PBS) – Jeff Boedeker\n** \"Pelosi's Power\" – Frontline (PBS) – Michael Kirk & Mike Wiser\n** \"Plague at the Golden Gate\" – American Experience (PBS) – Susan Kim\n|-\n|}\nNews\n{| class=\"wikitable\"\n|-\n| style=\"vertical-align:top;\" | |News Script – Regularly Scheduled, Bulletin, or Breaking Report}}\n* '\"The Water Crisis in Jackson, Mississippi\" – CBS Evening News with Norah O'Donnell (CBS News) – James Hutton and Rob Rivielle'\n** \"Massacre in Buffalo\" – CBS Weekend News (CBS News) – J. Craig Wilson & Claudine Cleophat\n** \"Shooting at Robb Elementary\" – World News Tonight with David Muir (ABC News) – David Muir, Dave Bloch, and Karen Mooney\n** \"Special Edition: From the Ukraine Border\" – World News Tonight with David Muir (ABC News) – David Muir, Dave Bloch, and Karen Mooney\n|-\n| style=\"vertical-align:top;\" | |News Script – Analysis, Feature, or Commentary}}\n* '\"Targeting Americans\" – 60 Minutes (CBS News) – Scott Pelley and Oriana Zill de Granados'\n** \"Battle for Ukraine\" – 20/20 (ABC News) – David Muir, Karen Mooney, and Dave Bloch\n** \"City of Lions\" – 60 Minutes (CBS News) – Scott Pelley, Nicole Young, and Kristin Steve\n** \"The Green Jacket – Golf's Ultimate Prize\" – CBS Saturday Morning (CBS News) – Daniel Elias & Dana Jacobson\n** \"Harvest of War\" – 60 Minutes (CBS News) – Scott Pelley, Nicole Young, and Kristin Steve\n** \"The Longest Running Oil Spill\" – 60 Minutes (CBS News) – Jon Wertheim and Oriana Zill de Granados\n|-\n| style=\"vertical-align:top;\" | |Digital News}}\n* '''\"How Oregon's Prison System Retaliated Against Its Most Effective Jailhouse Lawyer\" (HuffPost.com) – Jessica Schulberg'''\n** \"America's Only LGBTQ Historic District Is Falling Apart\" (Vice.com) – Leo Rocha; Vice.com\n** \"I Spent 72 Depraved Hours Searching for the Gnarliest Dive Bar in Las Vegas\" (Vice.com) – Drew Schwartz\n** \"The Most Unexpected Consequence of the Texas Abortion Ban\" (Slate.com) – Christina Cauterucci\n** \"The Pivot to Web3 Is Going to Get People Hurt\" (Vice.com) – Maxwell Strachan\n** \"What's So Scary About a Transgender Child?\" (Vox.com) – Emily St. James\n|-\n|}\nRadio\n{| class=\"wikitable\"\n|-\n| style=\"vertical-align:top;\" | |Radio/Audio Documentary}}\n* '\"The War in Jennifer Weiss\" – Crime Show (Gimlet Media) – Emma Courtland'\n** \"Dr. GIFT\" – One Year: 1995 (Slate) – Christina Cauterucci\n** \"Like a Lion With No Teeth\" – Crime Show (Gimlet Media) – Emma Courtland & Cat Schuknecht\n** \"Making Sense: How Sound Becomes Hearing\" – Unexplainable (Vox Media Podcast Network) – Noam Hassenfeld\n** \"The Most Famous Poet No One Remembers\" – Decoder Ring (Slate) – Dan Kois\n** \"No Peace\" – Slow Burn: The L.A. Riots (Slate) – Joel Anderson\n** \"The Ultimate Field Trip\" – One Year: 1986 (Slate) – Evan Chung\n|-\n| style=\"vertical-align:top;\" | |Radio/Audio News Script – Regularly Scheduled, Bulletin, or Breaking Report}}\n* \"Hail and Farewell: Saluting 5 Who Made a Difference\" (CBS Radio) – Gail Lee\n** \"CBS World News Roundup\" (CBS Radio) – Paul Farry and Steve Kathan\n** \"Newsline – 11am 9/9/22\" (1010 WINS Radio) – Philip Pilato\n** \"Remembering the Transistor Kid\" (CBS Radio) – Thomas Sabella\n** \"World News This Week – Week of September 9, 2022\" (ABC News Radio) – Joy Piazza\n** \"World News This Year 2021\" (ABC News Radio) – Robert Hawley\n|-\n| style=\"vertical-align:top;\" | |Radio/Audio News Script – Analysis, Feature, or Commentary}}\n* '\"What I Wish I Knew Before I Started IVF\" – The Waves (Slate) – Cheyna Roth'\n** \"2021 Law and Justice Year End Reports\" (ABC News Radio) – Robert Hawley\n** \"Was the Women's March Successful?\" – The Waves (Slate) – Christina Cauterucci\n** \"WCBS Author Talks Summer Reads\" (WCBS Radio) – Lisa Tschernkowitsch\n** \"You Will Be Found: The Impact of Dear Evan Hansen\" – \"Somalia Suffering from Starvation\", Perspective (ABC Audio) – D. J. Moran\n|-\n|}\nPromotional writing\n{| class=\"wikitable\"\n|-\n| style=\"vertical-align:top;\" | |On-Air Promotion}}\n* \"CBS Celebrates Juneteenth\" (CBS News) – Justin DiLauro\n** \"Amazon Bessemer Campaign: This Time I'm Voting YES; Union Difference; Union YES\" (Facebook) – Desireena Almoradie, Angad Bhalla, Adrianna Hernandez-Stewart\n|-\n|}\nReferences\n5. † indicates the winners of the Academy Awards for Best Original Screenplay and Best Adapted Screenplay.\nExternal links\n*"
    }
  ]
}