{
  "content": [
    {
      "type": "text",
      "text": "# 76th Writers Guild of America Awards\n\nThe 76th Writers Guild of America Awards was held on April 14, 2024, to honor the best writing in film, television and radio of 2023. The nominees were announced on February 21, 2024.\nWinners and nominees\nFilm\n{| class=\"wikitable\"\n|-\n| style=\"vertical-align:top;\" | |Best Original Screenplay}}\n* 'The Holdovers – David Hemingson'\n** Air – Alex Convery\n** Barbie – Greta Gerwig & Noah Baumbach\n** May December – Samy Burch; story by Samy Burch & Alex Mechanik\n** Past Lives – Celine Song\n|-\n| style=\"vertical-align:top;\" | |Best Adapted Screenplay}}\n* 'American Fiction – Cord Jefferson; based on the novel Erasure by Percival Everett' †\n** ''Are You There God? It's Me, Margaret. – Kelly Fremon Craig; based on the book by Judy Blume\n** Killers of the Flower Moon – Eric Roth and Martin Scorsese; based on the book by David Grann\n** Nyad – Julia Cox; based on the book Find a Way by Diana Nyad\n** Oppenheimer – Christopher Nolan; based on the book American Prometheus by Kai Bird and Martin J. Sherwin\n|-\n| style=\"vertical-align:top;\" | |Best Documentary Screenplay}}\n* 'The Pigeon Tunnel – Errol Morris'\n** Bella! – Jeff L. Lieberman\n** It Ain't Over – Sean Mullin\n** Stamped from the Beginning – David Teague; based on the book Stamped from the Beginning by Ibram X. Kendi\n** What the Hell Happened to Blood, Sweat & Tears? – John Scheinfeld\n|-\n|}\nTelevision\n{| class=\"wikitable\"\n|-\n| style=\"vertical-align:top;\" | |Drama Series}}\n* 'Succession (HBO) – Will Arbery, Jesse Armstrong, Miriam Battye, Jon Brown, Jamie Carragher, Ted Cohen, Nate Elston, Francesca Gardiner, Callie Hersheway, Lucy Prebble, Georgia Pritchett, Tony Roche, Susan Soon He Stanton, Will Tracy'\n** The Crown (Netflix) – Daniel Marc Janes, Peter Morgan, Meriel Sheibani-Clare, Jonathan Wilson\n** The Curse (Showtime) – Carmen Christopher, Nathan Fielder, Alex Huggins, Carrie Kemper, Benny Safdie\n** The Diplomat (Netflix) – Eli Attie, Debora Cahn, Mia Chung, Anna Hagen, Amanda Johnson-Zetterstrom, Peter Noah\n** The Last of Us (HBO) – Neil Druckmann, Craig Mazin\n|-\n| style=\"vertical-align:top;\" | |Comedy Series}}\n* 'The Bear (FX) – Karen Joseph Adcock, Joanna Calo, Kelly Galuska, Rene Gube, Sofya Levitsky-Weitz, Stacy Osei-Kuffour, Alex Russell, Catherine Schetina, Christopher Storer'\n** Abbott Elementary (ABC) – Quinta Brunson, Ava Coleman, Riley Dufurrena, Justin Halpern, Joya McCrory, Morgan Murphy, Brittani Nichols, Kate Peterman, Brian Rubenstein, Patrick Schumacker, Justin Tan, Jordan Temple, Garrett Werner\n** Barry (HBO) –  Emma Barrie, Alec Berg, Duffy Boudreau, Bill Hader, Emily Heller, Nicky Hirschhorn, Jason Kim, Liz Sarnoff\n** Jury Duty (Amazon Freevee) – Tanner Bean, Lee Eisenberg, Marcos Gonzalez, Cody Heller, Mekki Leeper, Katrina Mathewson, Kerry O’Neill, Ese Shaw, Gene Stupnitsky, Andrew Weinberg, Evan Williams;\n** Only Murders in the Building (Hulu) – Matteo Borghese, Madeleine George, Sas E. Goldberg, Joshua Allen Griffith, John Hoffman, Elaine Ko, Noah Levine, Tess Morris, J.J. Philbin, Ben Philippe, Jake Schnesel, Ben Smith, Siena Streiber, Pete Swanson, Rob Turbovsky;\n|-\n| style=\"vertical-align:top;\" | |New Series}}\n* 'The Last of Us (HBO) – Neil Druckmann, Halley Gross, Craig Mazin, Bo Shim'\n** The Diplomat (Netflix) – Eli Attie, Debora Cahn, Mia Chung, Anna Hagen, Amanda Johnson-Zetterstrom, Peter Noah\n** Jury Duty (Amazon Freevee) – Tanner Bean, Lee Eisenberg, Marcos Gonzalez, Cody Heller, Mekki Leeper, Katrina Mathewson, Kerry O’Neill, Ese Shaw, Gene Stupnitsky, Andrew Weinberg, Evan Williams;\n** Poker Face (Peacock) – Christine Boylan, Wyatt Cain, Chris Downey, CS Fischer, Rian Johnson, Alice Ju, Joe Lawson, Natasha Lyonne, Charlie Peppers, Lilla Zuckerman, Nora Zuckerman\n** Shrinking (Apple TV+) – Wally Baram, Rachna Fruchbom, Brian Gallivan, Neil Goldman, Brett Goldstein, Bill Lawrence, Annie Mebane, Bill Posley, Jason Segel, Sofia Selig\n|-\n| style=\"vertical-align:top;\" | |Limited Series}}\n* 'Beef (Netflix) – Joanna Calo, Bathsheba Doran, Jean Kyoung Frazier, Niko Gutierrez-Kovner, Lee Sung Jin, Alice Ju, Carrie Kemper, Mike Makowsky, Marie Hanhnhon Nguyen, Kevin Rosen, Alex Russell'\n** A Murder at the End of the World (FX) – Zal Batmanglij, Cherie Dimaline, Brit Marling, Melanie Marnich, Rebecca Roanhorse\n** Daisy Jones & The Six (Prime Video) – Susan Coyne, Jihan Crowther, Harris Danow, Charmaine DeGraté, Will Graham, Nora Kirkpatrick, Jenny Klein, Liz Koe, Judalina Neira, Scott Neustadter, Stacy Traub, Michael H. Weber\n** Fargo (FX) – Thomas Bezucha, Bob DeLaurentis, Noah Hawley, April Shih\n** Lessons in Chemistry (Apple TV+) – Victoria Bata, Lee Eisenberg, Hannah Fidell, Emily Jane Fox, Susannah Grant, Rosa Handelman, Elissa Karasik, Boo Killebrew, Mfoniso Udofia, Teagan Wall\n|-\n| style=\"vertical-align:top;\" | |TV & New Media Motion Pictures}}\n* 'Quiz Lady (Hulu) – Jen D'Angelo'\n** Finestkind (Paramount+) – Brian Helgeland\n** Mr. Monk's Last Case: A Monk Movie (Peacock) – Andy Breckman\n** No One Will Save You (Hulu) – Brian Duffield\n** Totally Killer'' (Prime Video) – Screenplay by David Matalon & Sasha Perl-Raver and Jen D'Angelo, Story by David Matalon & Sasha Perl-Raver\n|-\n| style=\"vertical-align:top;\" | |Animation}}\n* '\"Carl Carlson Rides Again\"  – The Simpsons (Fox) –  Loni Steele Sosthand'\n** \"A Mid-Childhood Night’s Dream\"  – The Simpsons (Fox) – Carolyn Omine\n** \"Homer's Adventures Through the Windshield Glass\" – The Simpsons (Fox) – Tim Long\n** \"I Know What You Did Next Xmas\" – Futurama (Hulu) – Ariel Ladensohn\n** \"Thirst Trap: A Corporate Love Story\" – The Simpsons (Fox) – Rob LaZebnik\n|-\n| style=\"vertical-align:top;\" | |Episodic Drama}}\n* '\"Living+\" – Succession (HBO) – Georgia Pritchett & Will Arbery'\n** \"Crown Jewels\"  – Queen Charlotte: A Bridgerton Story (Netflix) – Shonda Rhimes\n** \"Kill List\" – Succession (HBO) – Jon Brown & Ted Cohen\n** \"The Last Generation\" – Star Trek: Picard (Paramount+) – Terry Matalas\n** \"Our Black Shining Prince\" – Godfather of Harlem (MGM+) – Chris Brancato & Michael Panes\n** \"Sleep, Dearie Sleep\" – The Crown (Netflix) – Peter Morgan\n|-\n| style=\"vertical-align:top;\" | |Episodic Comedy}}\n* '\"Escape from Shit Mountain\" – Poker Face (Peacock) – Nora Zuckerman & Lilla Zuckerman'\n** \"Fishes\" – The Bear (FX) – Joanna Calo & Christopher Storer\n** \"Forks\" – The Bear (FX) – Alex Russell\n** \"House Made of Bongs\" – Reservation Dogs (FX) – Tommy Pico and Sterlin Harjo\n** \"Ice\" – The Great (Hulu) – Tony McNamara\n** \"Pride Parade\" – What We Do in the Shadows (FX) - Jake Bender & Zach Dunn\n|-\n| style=\"vertical-align:top;\" | |Comedy/Variety – Talk Series}}\n* 'Last Week Tonight with John Oliver'' (HBO) – Senior Writers: Daniel O'Brien, Owen Parsons, Charlie Redd, Joanna Rothkopf, Seena Vali; Writers: Johnathan Appel, Ali Barthwell, Tim Carvell, Liz Hynes, Ryan Ken, Mark Kramer, Sofia Manfredi, John Oliver, Taylor Kay Phillips, Chrissy Shackelford'\n** The Daily Show (Comedy Central) – Head Writer: Dan Amira; Senior Writers: Daniel Radosh, Lauren Sarver Means; Writers: David Angelo, Nicole Conlan, Devin Delliquanti, Anthony DeVito, Zach DiLanzo, Jennifer Flanz, Jason Gilbert, Dina Hashem, Scott Hercman, Josh Johnson, David Kibuuka, Matt Koff, Lenny Marcus, Joseph Opio, Randall Otis, Zhubin Parang, Kat Radley, Lanee Sanders, Scott Sherman, Ashton Womack, Sophie Zucker\n** Jimmy Kimmel Live! (ABC) – Sketches: Rory Albanese; Writers: Jamie Abrahams, Tony Barbieri, Jonathan Bines, Joelle Boucai, Bryan Cook, Blaire Erskine, Devin Field, Gary Greenberg, Josh Halloway, Eric Immerman, Jesse Joyce, Jimmy Kimmel, Greg Martin, Jesse McLaren, Molly McNearney, Keaton Patti, Danny Ricker, Troy Walker, Louis Virtel\n** Late Night with Seth Meyers (NBC) – Head Writer: Alex Baze; Supervising Writers: Seth Reiss, Mike Scollins; Closer Look Supervising Writer: Sal Gentile; Writers: Jermaine Affonso, Karen Chee, Bryan Donaldson, Matt Goldich, Dina Gusovsky, Jenny Hagel, Allison Hord, Mike Karnell, John Lutz, Seth Meyers, Ian Morgan, Amber Ruffin, Mike Shoemaker, Ben Warheit, Jeff Wright\n** The Late Show with Stephen Colbert (CBS) – Head Writers: Ariel Dumas, Jay Katsir; Writers: Delmonte Bent, Michael Brumm, Aaron Cohen, Stephen T. Colbert, Paul Dinello, Glenn Eichler, Gabe Gronli, Barry Julien, Michael Cruz Kayne, Eliana Kwartler, Matt Lapin, Caroline Lazar, Pratima Mani, Carlos Felipe Torres Medina, Opus Moreschi, Carley Moseley, Asher Perlman, Michael Pielocik, Tom Purcell, Kate Sidley, Brian Stack, John Thibodeaux, Steve Waltien\n** The Problem with Jon Stewart (Apple TV+) – Head Writer: Kristen Acimovic; Writers: Henrik Blix, Rob Christensen, Jay Jurden, Alexa Loftus, Tocarra Mallard, Maria Randazzo, Robby Slowik, Jon Stewart, Kasaun Wilson\n|-\n| style=\"vertical-align:top;\" | |Comedy/Variety – Sketch Series}}\n* 'I Think You Should Leave with Tim Robinson (Netflix) – Writers: Tim Robinson, Zach Kanin, John Solomon, Gary Richardson, Reggie Henke, Brendan Jennings, Patti Harrison'\n** History of the World, Part II (Hulu) – Writers: Ike Barinholtz, Emmy Blotnick, Guy Branum, Owen Burke, Adam Countee, Lance Crouther, Ana Fabrega, Fran Gillespie, Janelle James, Jennifer Kim, Nick Kroll, Sergio Serna, David Stassen, Wanda Sykes\n** How To with John Wilson (HBO) – Writers: John Wilson, Michael Koman, Allie Viti\n** Saturday Night Live (NBC) – Head Writers: Kent Sublette, Alison Gates, Streeter Seidell; Writers: Rosebud Baker, Dan Bulla, Megan Callahan-Shah, Michael Che, Mike DiCenzo, Alex English, Jimmy Fowlie, Martin Herlihy, John Higgins, Steve Higgins, Vannessa Jackson, Colin Jost, Erik Kenward, Steve Koren, Ben Marshall, Dennis McNicholas, Lorne Michaels, Jake Nordwind, Ceara O’Sullivan, Josh Patten, Gary Richardson, Pete Schultz, KC Shornima, Ben Silva, Will Stephen, Bryan Tucker, Asha Ward, Auguste White, Celeste Yim\n|-\n| style=\"vertical-align:top;\" | |Comedy/Variety – Specials}}\n* 'Sarah Silverman: Someone You Love (HBO) – Sarah Silverman'\n** Adam Sandler: The Kennedy Center Mark Twain Prize for American Humor (CNN) – by Jon Macks, Rita Brent, Jeff Stilson, Meggie McFadden\n** Carol Burnett: 90 Years of Laughter + Love (NBC) – Jon Macks, Carol Leifer\n** Marc Maron: From Bleak to Dark (HBO) – Marc Maron\n|-\n| style=\"vertical-align:top;\" | |Quiz and Audience Participation}}\n* 'The Chase (ABC) – Head Writer: David Levinson Wilk; Writers: Erik Agard, Kyle Beakley, Micki Boden, Megan Broussard, Jonathan Daly, Brian Greene, Robert King, Jason Lundell, Sierra Mannie, Amy Ozols, Bobby Patton, Ellen Teitel, Ari Yolkut'\n** Baking It (Peacock) – Writers: Chad Carter, Neil Casey, Jessica McKenna, Zach Reino, Nicolle Yaron\n** Jeopardy! (ABC) – Writers: Marcus Brown, Michael Davies, John Duarte, Mark Gaberman, Debbie Griffin, Michele Loud, Robert McClenaghan, Jim Rhine, Billy Wisse\n** Weakest Link (NBC) – Head Writer: Ann Slichter; Writers: Chip Dornell, Ryan Hopak, Walter Kelly, Stuart Krasnow, Jon Macks, Meggie McFadden, Rylee Newton, Ryan O’Dowd, Scott Saltzburg, Doug Shaffer, Aaron Solomon, Grant Taylor, Mia Taylor\n|-\n| style=\"vertical-align:top;\" | |Daytime Drama}}\n* 'Days of Our Lives (Peacock) – Head Writer: Ron Carlivati; Creative Consultant: Ryan Quan; Writers: Sonja Alar, Jazmen Darnell Brown, Joanna Cohen, Carolyn Culliton, Richard Culliton, Cheryl Davis, Kirk Doering, Christopher Dunn, Jamey Giddens, David Kreizman, Henry Newman, Dave Ryan, Katherine D. Schock'\n** General Hospital'' – Head Writers Dan O'Connor, Chris Van Etten; Writers Ashley Cook, Emily Culliton, Suzanne Flynn, Charlotte Gibson, Lucky Gold, Kate Hall, Elizabeth Korte, Shannon Peace, Stacey Pulwer, Dave Rupel, Lisa Seidman, Scott Sickles\n|-\n| style=\"vertical-align:top;\" | |Short Form New Media}}\n* 'Carpool Karaoke: The Series (Apple TV+) – Casey Stewart, David Young'\n** Command Z (commandzseries.com) – Kurt Andersen, Larry Doyle, Emily Flake, Akilah Hughes, Jiehae Park, Chloe Radcliffe, Nell Scovell, Roy Wood Jr.\n|}\nChildren\n{| class=\"wikitable\"\n|-\n| style=\"vertical-align:top;\" | |Children's Episodic, Long Form and Specials}}\n* '\"Romance Dawn\" – One Piece (Netflix) – Matt Owens & Steven Maeda; Netflix'\n** \"The Ballad of the Last Men\" – Sweet Tooth (Netflix) – Jim Mickle & Bo Yeon Kim & Erika Lippoldt\n** \"I Accidentally Vaporize My Pre-Algebra Teacher\" – Percy Jackson and the Olympians (Disney+) – Rick Riordan & Jonathan E. Steinberg; Disney+\n** \"Say Cheese and Die!\" – Goosebumps (Disney+) – Rob Letterman & Nicholas Stoller\n** \"What Guy Are You\" – American Born Chinese (Disney+) – Kelvin Yu & Charles Yu; Disney+\n|}\nDocumentary\n{| class=\"wikitable\"\n|-\n| style=\"vertical-align:top;\" | |Documentary Script}}\n* \"The Busing Battleground\" – American Experience (PBS) – Sharon Grimberg\n* \"Clarence and Ginni Thomas: Politics, Power and the Supreme Court\" – Frontline (PBS) – Michael Kirk & Mike Wiser\n* \"Episode One: Blood Memory\" – The American Buffalo (PBS) – Dayton Duncan\n|}\nNews\n{| class=\"wikitable\"\n|-\n| style=\"vertical-align:top;\" | |News Script – Regularly Scheduled, Bulletin, or Breaking Report}}\n* '\"Surprise Attack!\" – CBS Weekend News (CBS News) – J. Craig Wilson, Ambrose Raferty'\n** \"Black History Month – Hall Of Fame Hero\" – CBS News New York (WCBS-TV) – Joe McLaughlin\n** \"Deadly Tornadoes Unleash Terror Across the Central U.S.\" – CBS Evening News with Norah O’Donnell (CBS News) – James Hutton, Rob Rivielle\n|-\n| style=\"vertical-align:top;\" | |News Script – Analysis, Feature, or Commentary}}\n* '\"Healing and Hope\" – 60 Minutes (CBS News) – Scott Pelley, Nicole Young, Kristin Steve'\n** \"Convoy of Life\" – 60 Minutes (CBS News) – Scott Pelley, Kristin Steve, Nicole Young\n** \"Hide and Seek\" – 60 Minutes (CBS News) – Sharyn Alfonsi, Oriana Zill de Granados\n** \"Put To The Test\" – CBS Sunday Morning (CBS News) – Richard Buddenhagen, Lesley Stahl\n** \"Targeting Seniors\" – 60 Minutes (CBS News) – Sharyn Alfonsi, Emily Gordon, Oriana Zill de Granados\n|-\n| style=\"vertical-align:top;\" | |Digital News}}\n* \"The Persuaders: A 5-Part Investigation into the Union-Busting Industry,\" (HuffPost) – Dave Jamieson\n** \"How Paris Kicked Out the Cars,\" (Slate) – Henry Grabar\n** \"The Rise of 'Gas Station Heroin,'\" (Vice News) – Manisha Krishnan\n** \"Want to Stare Into the Republican Soul in 2023?,\" (Slate) – Alexander Sammon\n** \"The Woman on the Line,\" (Slate) – Written by Aymann Ismail and Mary Harris\n|}\nRadio\n{| class=\"wikitable\"\n|-\n| style=\"vertical-align:top;\" | |Radio/Audio Documentary}}\n* '\"The Call\" – This American Life (Slate) – Mary Harris'\n** \"America's Blackest Child\" – Slow Burn: Becoming Justice Thomas (Slate) – Joel Anderson\n** \"The Black Box: Even AI's creators don’t understand it\" – Unexplainable (Vox) – Noam Hassenfeld\n** \"Emmery\" – Party Crews: The Untold Story (Vice) – Janice Llamoca\n** \"Expecting: Pregnancy Souvenirs\" – Unexplainable (Vox) – Byrd Pinkerton\n|-\n| style=\"vertical-align:top;\" | |Radio/Audio News Script – Regularly Scheduled, Bulletin, or Breaking Report}}\n* \"World News This Week – Week of March 17, 2023,\" (ABC News Radio) – Joy Piazza\n** \"The Ballad of Tucker Carlson\" – What Next (Slate) – Paige Osburn and Mary Harris\n** \"World News Roundup Late Edition – October 9, 2023,\" (CBS News) – Spencer Raine\n|-\n| style=\"vertical-align:top;\" | |Radio/Audio News Script – Analysis, Feature, or Commentary}}\n* '\"The Diagnosis Was Fatal. She Couldn’t Get an Abortion\" – What Next (Slate) – Madeline Ducharme and Mary Harris'\n** \"Lacrosse – Spirit of the Land\" (ABC News Radio) – Robert Hawley\n** \"Stephen King Is Just as Confused About Blue Checks as You Are\" – What Next: TBD (Slate) – Lizzie O’Leary and Evan Campbell\n|}\nPromotional Writing\n{| class=\"wikitable\"\n|-\n| style=\"vertical-align:top;\" | |On-Air Promotion}}\n* \"WCBS AM Promos,\" (WCBS Newsradio 880) – Bill Tynan\n** \"Cross Walk, Cyber Bullying, VR Meditation\" – KCAL News (CBS News) – Adam Thiele\n** \"Strange New Promos,\" (CBS / Paramount+) – Molly Neylan\n|}\nReferences\n3. † indicates the winners of the Academy Awards for Best Original Screenplay and Best Adapted Screenplay.\nExternal links\n*"
    }
  ]
}