{
  "content": [
    {
      "type": "text",
      "text": "# 77th British Academy Film Awards\n\n| site              =\n| host              = David Tennant\n| best_film         = Oppenheimer\n| best_british      = The Zone of Interest\n| best_actor        = Cillian Murphy\n| best_actor_film   = Oppenheimer\n| best_actress      = Emma Stone\n| best_actress_film = Poor Things\n| most_wins         = Oppenheimer (7)\n| most_nominations  = Oppenheimer (13)\n| last              = 76th\n| next              = 78th\n}}\nThe 77th British Academy Film Awards, more commonly known as the BAFTAs, were held on 18 February 2024, honouring the best national and foreign films of 2023, at the Royal Festival Hall within London's Southbank Centre. Presented by the British Academy of Film and Television Arts, accolades were handed out for the best feature-length film and documentaries of any nationality that were screened at British cinemas in 2023.}}\nThe ceremony was hosted by David Tennant for the first time; \"I am delighted to have been asked to host the EE BAFTA Film Awards and help celebrate the very best of this year's films and the many brilliant people who bring them to life,\" said Tennant.}} The broadcast streamed live on BBC One and iPlayer in the UK from 19:00–21:00 GMT, and on BritBox International in Canada, Denmark, Finland, Norway, South Africa, Sweden and the US.\nThe BAFTA longlists were unveiled on 5 January 2024. The nominations were announced via livestream by former Rising Star Award nominees Naomi Ackie and Kingsley Ben-Adir, from the arts charity's HQ at 195 Piccadilly, London, on 18 January 2024; the livestream was also available to watch on BAFTA's Twitter and YouTube pages.}} The Rising Star nominees, which is the only category voted for by the British public, were unveiled on 10 January 2024. The winners were announced on 18 February 2024.}}\nWinners and nominees\nBAFTA Fellowship winner]]\n, Best Film co-winner and Best Director winner]]\n, Best Actor winner]]\n, Best Actress winner]]\n, Best Supporting Actor winner]]\n, Best Supporting Actress winner]]\n, Best Animated Film co-winner]]\n, Best Documentary co-winner]]\n, Best Film Not in the English Language and Outstanding British Film co-winner]]\n, Best Original Score winner]]\n, Rising Star Award winner]]\nThe BAFTA long lists were announced on 5 January 2024. The nominees were announced on 18 January 2024. The winners were announced on 18 February 2024.\nBAFTA Fellowship\n* Samantha Morton\nOutstanding British Contribution to Cinema\n* June Givanni\nAwards\nWinners are listed first and also highlighted in boldface.\n{| class=\"wikitable\"\n|-\n| valign=\"top\" width=\"50%\"| |Best Film}}\n* 'Oppenheimer – Christopher Nolan, Charles Roven and Emma Thomas'\n** Anatomy of a Fall – Marie-Ange Luciani and David Thion\n** The Holdovers – Mark Johnson\n** Killers of the Flower Moon – Dan Friedkin, Daniel Lupi, Martin Scorsese and Bradley Thomas\n** Poor Things – Ed Guiney, Yorgos Lanthimos, Andrew Lowe and Emma Stone\n| valign=\"top\" width=\"50%\"| |Best Director}}\n* 'Christopher Nolan – Oppenheimer'\n** Bradley Cooper – Maestro\n** Jonathan Glazer – The Zone of Interest\n** Andrew Haigh – All of Us Strangers\n** Alexander Payne – The Holdovers\n** Justine Triet – Anatomy of a Fall\n|-\n| valign=\"top\" width=\"50%\"| |Best Actor in a Leading Role}}\n* 'Cillian Murphy – Oppenheimer as J. Robert Oppenheimer'\n** Bradley Cooper – Maestro as Leonard Bernstein\n** Colman Domingo – Rustin as Bayard Rustin\n** Paul Giamatti – The Holdovers as Paul Hunham\n** Barry Keoghan – Saltburn as Oliver Quick\n** Teo Yoo – Past Lives as Hae Sung\n| valign=\"top\" width=\"50%\"| |Best Actress in a Leading Role}}\n* 'Emma Stone – Poor Things as Bella Baxter'\n** Fantasia Barrino – The Color Purple as Celie Harris-Johnson\n** Sandra Hüller – Anatomy of a Fall as Sandra Voyter\n** Carey Mulligan – Maestro as Felicia Montealegre\n** Vivian Oparah – Rye Lane as Yas\n** Margot Robbie – Barbie as Barbie\n|-\n| valign=\"top\" width=\"50%\"| |Best Actor in a Supporting Role}}\n* 'Robert Downey Jr. – Oppenheimer as Lewis Strauss'\n** Robert De Niro – Killers of the Flower Moon as William King Hale\n** Jacob Elordi – Saltburn as Felix Catton\n** Ryan Gosling – Barbie as Ken\n** Paul Mescal – All of Us Strangers as Harry\n** Dominic Sessa – The Holdovers as Angus Tully\n| valign=\"top\" width=\"50%\"| |Best Actress in a Supporting Role}}\n* '''Da'Vine Joy Randolph – The Holdovers as Mary Lamb'\n** Emily Blunt – Oppenheimer as Kitty Oppenheimer\n** Danielle Brooks – The Color Purple as Sofia\n** Claire Foy – All of Us Strangers as Mum\n** Sandra Hüller – The Zone of Interest as Hedwig Höss\n** Rosamund Pike – Saltburn as Lady Elspeth Catton\n|-\n| valign=\"top\" width=\"50%\"| |Best Original Screenplay}}\n* 'Anatomy of a Fall – Justine Triet and Arthur Harari'\n** Barbie – Greta Gerwig and Noah Baumbach\n** The Holdovers – David Hemingson\n** Maestro – Bradley Cooper and Josh Singer\n** Past Lives – Celine Song\n| valign=\"top\" width=\"50%\"| |Best Adapted Screenplay}}\n* 'American Fiction – Cord Jefferson'\n** All of Us Strangers – Andrew Haigh\n** Oppenheimer – Christopher Nolan\n** Poor Things – Tony McNamara\n** The Zone of Interest – Jonathan Glazer\n|-\n| valign=\"top\" width=\"50%\"| |Best Animated Film}}\n* 'The Boy and the Heron – Hayao Miyazaki and Toshio Suzuki'\n** Chicken Run: Dawn of the Nugget – Sam Fell, Leyla Hobart and Steve Pegram\n** Elemental – Peter Sohn and Denise Ream\n** Spider-Man: Across the Spider-Verse – Joaquim Dos Santos, Kemp Powers, Justin K. Thompson, Avi Arad, Phil Lord, Christopher Miller, Amy Pascal and Christina Steinberg\n| valign=\"top\" width=\"50%\"| |Best Documentary}}\n* '20 Days in Mariupol – Mstyslav Chernov, Raney Aronson-Rath and Michelle Mizner'\n** American Symphony – Matthew Heineman, Lauren Domino and Joedan Okun\n** Beyond Utopia – Madeleine Gavin, Rachel Cohen, Jana Edelbaum and Sue Mi Terry\n** Still: A Michael J. Fox Movie – Davis Guggenheim, Jonathan King and Annetta Marion\n** Wham! – Chris Smith, John Battsek and Simon Halfon\n|-\n| valign=\"top\" width=\"50%\"| |Best Film Not in the English Language}}\n* 'The Zone of Interest – Jonathan Glazer and James Wilson'\n** 20 Days in Mariupol – Mstyslav Chernov, Raney Aronson-Rath and Michelle Mizner\n** Anatomy of a Fall – Justine Triet, Marie-Ange Luciani and David Thion\n** Past Lives – Celine Song, David Hinojosa, Pamela Koffler and Christine Vachon\n** Society of the Snow – J. A. Bayona, Belén Atienza and Sandra Hermida\n| valign=\"top\" width=\"50%\"| |Best Casting}}\n* 'The Holdovers – Susan Shopmaker'\n** All of Us Strangers – Kahleen Crawford\n** Anatomy of a Fall – Cynthia Arra\n** How to Have Sex – Isabella Odoffin\n** Killers of the Flower Moon – Ellen Lewis and Rene Haynes\n|-\n| valign=\"top\" width=\"50%\"| |Best Cinematography}}\n* 'Oppenheimer – Hoyte van Hoytema'\n** Killers of the Flower Moon – Rodrigo Prieto\n** Maestro – Matthew Libatique\n** Poor Things – Robbie Ryan\n** The Zone of Interest – Łukasz Żal\n| valign=\"top\" width=\"50%\"| |Best Costume Design}}\n* 'Poor Things – Holly Waddington'\n** Barbie – Jacqueline Durran\n** Killers of the Flower Moon – Jacqueline West\n** Napoleon – Dave Crossman and Janty Yates\n** Oppenheimer – Ellen Mirojnick\n|-\n| valign=\"top\" width=\"50%\"| |Best Editing}}\n* 'Oppenheimer – Jennifer Lame'\n** Anatomy of a Fall – Laurent Sénéchal\n** Killers of the Flower Moon – Thelma Schoonmaker\n** Poor Things – Yorgos Mavropsaridis\n** The Zone of Interest – Paul Watts\n| valign=\"top\" width=\"50%\"| |Best Make Up & Hair}}\n* 'Poor Things – Nadia Stacey, Mark Coulier and Josh Weston'\n** Killers of the Flower Moon – Kay Georgiou and Thomas Nellen\n** Maestro – Siân Grigg, Kay Georgiou, Kazu Hiro and Lori McCoy-Bell\n** Napoleon – Jana Carboni, Francesco Pegoretti, Satinder Chumber and Julia Vernon\n** Oppenheimer – Luisa Abel, Jaime Leigh McIntosh, Jason Hamer and Ahou Mofid\n|-\n| valign=\"top\" width=\"50%\"| |Best Original Score}}\n* 'Oppenheimer – Ludwig Göransson'\n** Killers of the Flower Moon – Robbie Robertson\n** Poor Things – Jerskin Fendrix\n** Saltburn – Anthony Willis\n** Spider-Man: Across the Spider-Verse – Daniel Pemberton\n| valign=\"top\" width=\"50%\"| |Best Production Design}}\n* 'Poor Things – Shona Heath, James Price and Zsuzsa Mihalek'\n** Barbie – Sarah Greenwood and Katie Spencer\n** Killers of the Flower Moon – Jack Fisk and Adam Willis\n** Oppenheimer – Ruth De Jong and Claire Kaufman\n** The Zone of Interest – Chris Oddy, Joanna Maria Kuś and Katarzyna Sikora\n|-\n| valign=\"top\" width=\"50%\"| |Best Sound}}\n* 'The Zone of Interest – Johnnie Burn and Tarn Willers'\n** Ferrari – Angelo Bonanni, Tony Lamberti, Andy Nelson, Lee Orloff and Bernard Weiser\n** Maestro – Richard King, Steve Morrow, Tom Ozanich, Jason Ruder and Dean Zupancic\n** Mission: Impossible – Dead Reckoning Part One – Chris Burdon, James H. Mather, Chris Munro and Mark Taylor\n** Oppenheimer'' – Willie Burton, Richard King, Kevin O'Connell and Gary A. Rizzo\n| valign=\"top\" width=\"50%\"| |Best Special Visual Effects}}\n* 'Poor Things – Tim Barter, Simon Hughes, Dean Koonjul and Jane Paton'\n** The Creator – Jonathan Bullock, Charmaine Chan, Ian Comley and Jay Cooper\n** Guardians of the Galaxy Vol. 3 – Theo Bialek, Stephane Ceretti, Alexis Wajsbrot and Guy Williams\n** Mission: Impossible – Dead Reckoning Part One – Neil Corbould, Simone Coco, Jeff Sutherland and Alex Wuttke\n** Napoleon – Henry Badgett, Neil Corbould, Charley Henley and Luc-Ewen Martin-Fenouillet\n|-\n| valign=\"top\" width=\"50%\"| |Outstanding British Film}}\n* 'The Zone of Interest – Jonathan Glazer and James Wilson'\n** All of Us Strangers – Andrew Haigh, Graham Broadbent, Pete Czernin and Sarah Harvey\n** How to Have Sex – Molly Manning Walker, Emily Leo, Ivana MacKinnon and Konstantinos Kontovrakis\n** Napoleon – Ridley Scott, Mark Huffam, Kevin J. Walsh and David Scarpa\n** The Old Oak – Ken Loach, Rebecca O'Brien and Paul Laverty\n** Poor Things – Yorgos Lanthimos, Ed Guiney, Andrew Lowe, Emma Stone and Tony McNamara\n** Rye Lane – Raine Allen-Miller, Yvonne Isimeme Ibazebo, Damian Jones, Nathan Bryon and Tom Melia\n** Saltburn – Emerald Fennell, Josey McNamara and Margot Robbie\n** Scrapper – Charlotte Regan and Theo Barrowclough\n** Wonka – Paul King, Alexandra Derbyshire, David Heyman and Simon Farnaby\n| valign=\"top\" width=\"50%\"| |Outstanding Debut by a British Writer, Director or Producer}}\n* 'Earth Mama'' – Savanah Leaf (Writer, Director, Producer), Shirley O'Connor (Producer) and Medb Riordan (Producer)'\n** Blue Bag Life – Lisa Selby (Director), Rebecca Lloyd-Evans (Director) and Alex Fry (Director)\n** Bobi Wine: The People's President – Christopher Sharp (Director) [also directed by Moses Bwayo]\n** How to Have Sex – Molly Manning Walker (Writer, Director)\n** Is There Anybody Out There? – Ella Glendining (Director)\n|-\n| valign=\"top\" width=\"50%\"| |Best British Short Animation}}\n* 'Crab Day – Ross Stringer, Bartosz Stanislawek and Aleksandra Sykulak'\n** Visible Mending – Samantha Moore and Tilley Bancroft\n** Wild Summon – Karni Arieli, Saul Freed and Jay Woolley\n| valign=\"top\" width=\"50%\"| |Best British Short Film}}\n* 'Jellyfish and Lobster – Yasmin Afifi and Elizabeth Rufai'\n** Festival of Slaps – Abdou Cissé, Cheri Darbon and George Telfer\n** Gorka – Joe Weiland and Alex Jefferson\n** Such a Lovely Day – Simon Woods, Polly Stokes, Emma Norton and Kate Phibbs\n** Yellow'' – Elham Ehsas, Dina Mousawi, Azeem Bhati and Yiannis Manolopoulos\n|-\n| colspan=\"2\" valign=\"top\" width=\"50%\"| |BAFTA Rising Star Award}}\n* Mia McKenna-Bruce\n** Phoebe Dynevor\n** Ayo Edebiri\n** Jacob Elordi\n** Sophie Wilde\n|}\nCeremony information\nThe broadcast was streamed live on BBC One and iPlayer in the United Kingdom, and on BritBox International in Canada, Denmark, Finland, Norway, South Africa, Sweden and the United States; due to the significant time difference, Australia-based BritBox subscribers were able to watch the awards on-demand. The red carpet was hosted by Clara Amfo and Alex Zane, live on BAFTA's social channels Facebook, X and YouTube, while Zainab Jiwa was live from the red carpet exclusively on BAFTA's TikTok channel from 15:00–16:00 GMT.\nThe trio of Barbie, Killers of the Flower Moon, and Oppenheimer led the longlists, tying with fifteen nods each; this haul of fifteen longlist mentions equalled the record held by the previous year's All Quiet on the Western Front. Poor Things and Maestro followed with fourteen and twelve, respectively. Ultimately, Oppenheimer received the most nominations with thirteen, followed by Poor Things with eleven. The fantasy comedy Barbie underperformed, only receiving five nominations, and without nods for Best Film and Best Director (Greta Gerwig). Another notable omission was Lily Gladstone for Best Actress in a Leading Role for her portrayal of Mollie Burkhart in Killers of the Flower Moon; the \"snub\" irked many fans, who took to social media to express their confusion and frustration. Additionally, the cultural phenomenon of \"Barbenheimer\" received a total of eighteen nominations: five for Barbie and thirteen for Oppenheimer; the two films competed against each other in three categories.\nEnglish singer and songwriter Sophie Ellis-Bextor performed her 2001 chart-topper \"Murder on the Dancefloor\", most recently known as the concluding viral song from the five-time BAFTA-nominated film Saltburn. Additionally, British actress and television presenter Hannah Waddingham delivered an exclusive music performance of the Cyndi Lauper song \"Time After Time\" during the \"In Memoriam\" segment.\nBAFTA president Prince William attended the ceremony, but, unlike last year, his wife, Catherine, did not, as she was recovering from abdominal surgery; he met the category winners and BAFTA Rising Star Award nominees following the awards ceremony.\nAdditionally, the BAFTA Awards did not stream the final four categories live this year; they instead were broadcast as-live on the BBC with a two-hour delay along with the rest of the awards. The three-hour ceremony was edited down by an hour to make for a 120-minute runtime. Last year, the show ran with its usual two-hour delay, but the final four categories were broadcast live. BAFTA Awards director Emma Baehr said of the change: \"We've tried lots of different things. Last year we went live... We're not going to be doing that this year. We tried it. It was good at the time, but it didn't add any more than what we needed.\"\nWhile producer Emma Thomas was accepting the award for Best Film on behalf of Oppenheimer, social media personality Lizwani gatecrashed her speech. The cast and crew of Oppenheimer were seated on the right-hand side of the venue and after presenter Michael J. Fox announced the winner, Thomas, Christopher Nolan, Charles Roven and Cillian Murphy walked together onto the stage to collect the award. As Thomas was handed the award from Fox, Lizwani nonchalantly entered from the opposite side of the venue and ran onstage. Few audience members and viewers noticed him as he silently stood between Murphy and Roven while Thomas gave her acceptance speech. He was soon apprehended by security officials after he walked offstage with the film's team. A BAFTA spokesperson published a statement following the ceremony: \"A social media prankster was removed by security last night after joining the winners of the final award on stage — we are taking this very seriously, and don't wish to grant him any publicity by commenting further.\"\nIn Memoriam\nThe In Memoriam montage was played to the song \"Time After Time\", performed by Hannah Waddingham.\n* Jane Birkin\n* Glynis Johns\n* Shirley Anne Field\n* Derek Malcolm\n* Anna Scher\n* Lee Sun-kyun\n* Julian Sands\n* Richard Roundtree\n* Bo Goldman\n* William Friedkin\n* Sir Horace Ové\n* Terence Davies\n* David Leland\n* Jess Search\n* Leslie Hardcastle\n* Tina Turner\n* Robbie Robertson\n* Ryuichi Sakamoto\n* Norman Jewison\n* Chaim Topol\n* Glenda Jackson\n* Tom Wilkinson\n* Carl Weathers\n* Norman Reynolds\n* Paul Hitchcock\n* Charles Knode\n* Ryan O'Neal\n* Tom Priestley\n* Joss Ackland\n* Harry Belafonte\n* Piper Laurie\n* Alan Arkin\n* Michael Gambon\nSee also\n* 13th AACTA International Awards\n* 96th Academy Awards\n* 51st Annie Awards\n* 12th Canadian Screen Awards\n* 49th César Awards\n* 29th Critics' Choice Awards\n* 76th Directors Guild of America Awards\n* 81st Golden Globe Awards\n* 44th Golden Raspberry Awards\n* 38th Goya Awards\n* 39th Independent Spirit Awards\n* 29th Lumière Awards\n* 13th Magritte Awards\n* 11th Platino Awards\n* 35th Producers Guild of America Awards\n* 28th Satellite Awards\n* 51st Saturn Awards\n* 30th Screen Actors Guild Awards\n* 76th Writers Guild of America Awards\nReferences\nNotes\nCitations\nExternal links\n*"
    }
  ]
}