{
  "content": [
    {
      "type": "text",
      "text": "# 7th Cavalry (wargame)\n\n7th Cavalry is a board wargame published by Attack Wargaming Association (AWA) in 1976 that simulates the Battle of Little Big Horn. Published on the centenary of the battle, the game had two other rival games about the same battle introduced at the same games fair, and as a result, none of the games sold well. In addition, critics found this game's rules too simple, and not well written.\nDescription\n7th Cavalry is a 2-player wargame in which one player controls the forces of George Custer, and the other player controls the forces under Sitting Bull and Crazy Horse. The gameplay has been described as \"simple\". Nine other historical battles and a number of \"what if?\" scenarios are also included.\nPublication history\nThe Battle of Little Big Horn had already been simulated by the board game The Battle of the Little Big Horn published by Waddingtons in 1962. But 1976 marked the centennial of the battle, and three small game publishers brought new games about the battle to the Origins II Game Fair: ''Custer's Last Stand by Battleline; Little Big Horn: Custer's Last Stand, designed by Gary Gygax and published by TSR; and 7th Cavalry'', a game designed by Dave Casciano and published by his company AWA.\nAWA's game did not sell well; neither did the other two competing games introduced at Origins. As Gary Gygax, designer of one of the competing games, recalled, \"Of course, all three companies suffered sales-wise, as interested gamers were divided.\"\nReception\nIn Issue 28 of Moves (August/September 1976), game designer Richard Berg compared the three competing games released at the 1976 Origins Game Fair, and called 7th Cavalry \"the worst of the lot [...] their counters are flimsy and juvenile, and the rules are not much better.\" Berg concluded \"The aim here is simplicity, and the result is simplistic.\"\nIn his 1977 book The Comprehensive Guide to Board Wargaming, Nick Palmer thought the game had a \"good map, but [the games is] very simple.\" Palmer suggested instead, ''Custer's Last Stand by Battleline.\nIn The Guide to Simulations/Games for Education and Training'', Martin Campion commented that \"The game looks interesting, but the rules are rather sketchy.\" Campion liked one of the \"what if?\" scenarios that changed the number of Custer's opponents \"so Custer will once more be tempted to charge against great odds. This is particularly suggestive, but the instructions for making it work are incomplete.\"\nReviews\n*Games & Puzzles #68\nReferences"
    }
  ]
}