{
  "content": [
    {
      "type": "text",
      "text": "# 80th Infantry (Reserve) Division (United Kingdom)\n\n|country=\n|branch=\n|type=Infantry\n|role=Training and deception\n}}\nThe 80th Infantry (Reserve) Division was an infantry division of the British Army formed at the beginning of 1943, during the Second World War. For the twenty months that the division existed, it was a training formation. It was made responsible for providing final tactical and field training to soldiers who had already passed their initial training. After five additional weeks of training, the soldiers would be posted to fighting formations overseas. Notably, the division was used as a source of reinforcements for the 21 Army Group, which was fighting in Normandy. After all available troops left the United Kingdom for France, the division was disbanded.\nA phantom 80th Infantry Division was formed in the division's place to aid the Operation Fortitude deception effort that supported the invasion of France. This division was part of the notional British Fourth Army, which was portrayed as part of the threatened Allied landing at the Pas de Calais. The overall deception plan was successful, and affected the German response to the Allied invasion. The phantom division was \"disbanded\" towards the end of the war.\nDivisional history\nTraining formation\nDuring the Second World War, the divisions of the British Army were divided between \"Higher Establishment\" and \"Lower Establishment\" formations. The former were intended for deployment overseas and combat, whereas the latter were strictly for home defence in a static role. During the winter of 1942–43, three \"Lower Establishment\" divisions were renamed \"Reserve Divisions\".}} On 1 January 1943, these three were supplemented by the raising of a new reserve division, the 80th Infantry placed under the command of General officer commanding Major-General Lionel Howard Cox. The four reserve divisions were used as training units. Soldiers who had completed their corps training were assigned to these divisions.}} The soldiers were given five weeks of additional training at the section, platoon and company level, before undertaking a final three-day exercise. Troops would then be ready to be sent overseas to join other formations. Training was handled in this manner to relieve the \"Higher Establishment\" divisions from being milked for replacements for other units and to allow them to intensively train without the interruption of having to handle new recruits.}}\nDuring its existence, the 80th Division was assigned to Western Command. The division was spread out across Western Command's area of responsibility}} with at least one battalion based in Bowerham Barracks, Lancaster, Lancashire and another based around Shropshire. The Imperial War Museum comments that the division insignia of a troopship was derived from \"one of the prime functions of the Division [that being] to find drafts for overseas postings\". The design included \"two long and prominent bow waves from the ship\", which resulted in the troops giving it the nickname the \"torpedoed troopship\". The insignia was only worn by the permanent members of the division.\nOn 30 June 1944, the four training divisions had a combined total of 22,355 men. Of this number, only 1,100 were immediately available as replacements for the 21 Army Group.}} The remaining 21,255 men were considered ineligible at that time for service abroad, for medical reasons, or for not being fully fit or fully trained, or for other reasons. Over the following six months, up to 75 per cent of these men would be deployed to reinforce 21 Army Group following the completion of their training and certification of fitness. Stephen Hart comments that, by September, the 21st Army Group \"had bled Home Forces dry of draftable riflemen\" after the losses suffered during the Normandy Campaign, leaving the army in Britain, with the exception of the 52nd (Lowland) Infantry Division, with just \"young lads, old men, and the unfit\". On 1 September 1944, the division was disbanded. Cox took command of the 38th Infantry (Reserve) Division, which took over the role of the 80th Division.\nDeception formation\nThe creation of the fictitious division arose from an actual reorganization of British forces. During 1944, the British Army was facing a manpower crisis as it did not have enough men to replace the losses to front line infantry. While efforts were made to address this (such as transferring men from the Royal Artillery and Royal Air Force to be retrained as infantry), the War Office began disbanding divisions to downsize the army so as to transfer men to other units to help keep those as close to full strength as possible. The War Office decided to disband several \"lower establishment\" divisions, which included the 80th Infantry (Reserve) Division.\nThe Fortitude deception staff seized upon this opportunity to retain the division as a phantom unit. A cover story was established to explain the change in the division's status. It was claimed that with the war nearing an end, several Territorial Army divisions would revert to their peacetime recruiting role and release their equipment and resources to other units. For the 80th, this was the 38th Division. With the transfer of equipment, the 80th was notionally raised to the \"higher establishment\", readied for war, and joined the phantom VII Corps that was part of the notional British Fourth Army. The phantom 80th, retaining the insignia of the real division, was supposedly based in Canterbury and composed of the 50th, 208th and 211th brigades.\nThe notional Fourth Army was part of Operation Bodyguard, the codename for the deception plan designed to protect Operation Overlord. Initially, the Fourth Army was part of Fortitude North. This plan aimed to make the Germans believe that the notional 250,000-strong Fourth Army, based in Scotland, would assault Norway. The deception plan aimed to keep the German garrison of nearly half a million men stationed in Norway to resist such an attack. Following the invasion of Normandy, the Fourth Army was \"transferred\" south to reinforce the First United States Army Group (FUSAG), another fictitious formation. Fortitude South aimed to convince the Germans that FUSAG had 500,000 men in more than fifty divisions and would launch the main Allied invasion in the Pas de Calais, 45 days after the Normandy landings. The goal of the operation was to persuade the Germans not to move the 18 divisions of the 15th Army to Normandy. VII Corps was notionally transferred south, as part of Fourth Army, to join FUSAG. Following this move, the newly created fictitious 80th Infantry Division was assigned to the imaginary Corps. To aid in the deception, signallers from the 61st Infantry Division maintained wireless traffic, to give the Germans the impression of an actual 80th Division. In addition, Juan Pujol García, the British double agent known as Garbo who played a vital role in Fortitude, reported to the Germans that the 80th Division was undertaking assault training.}}\nFortitude South has been credited with ensuring the German 15th Army was not deployed against the Allied invasion force too soon and ensuring the success of Operation Overlord. Gerhard Weinberg stated that the Germans \"readily accepted the existence and location\" of FUSAG, believed the threat to the Pas de Calais was real and \"it was only at the end of July\" that they realized a second assault was not coming; \"by that time, it was too late to move reinforcements\". However, Mary Barbier wrote \"it is time to consider that the importance of the deception has been overrated\". She argues that 15th Army was largely immobile and not combat-ready,}} that despite the deception numerous German divisions – including the 1st SS Panzer Division, which was held in reserve behind the 15th Army – from across Europe were transferred to Normandy to repel the invasion, and that the Germans had realized as early as May that a real threat to Normandy existed. Barbier further commented that while the Germans believed the deception due to \"preconceived ideas about the importance of the Pas De Calais\", the Allied staff had overestimated the effectiveness of the deception after the 15th Army's inaction because they held a \"preconceived notion of what FORTITUDE would accomplish\". Following the Battle of Normandy, the phantom 80th Division was \"transferred\" around the east coast of England, moving back and forth between VII Corps and the equally bogus II Corps. The division was eventually \"disbanded\" in April 1945.\nOrder of battle\n{| class=\"toccolours collapsible collapsed\" style=\"width:100%; background:transparent;\"\n!colspan= | 80th Infantry (Reserve) Division\n|-\n|colspan=\"2\" |\n45th Infantry Brigade\n* 10th Battalion, Cameronians (Scottish Rifles)\n* 10th Battalion, Black Watch (Royal Highland Regiment) (until 21 July 1944)\n* 11th Battalion, Argyll and Sutherland Highlanders (until 20 July 1944)\n* 4th Battalion, East Lancashire Regiment (from 23 July 1944 until the division disbanded and the brigade was transferred)\n* 5th Battalion, Royal Inniskilling Fusiliers (from 22 July 1944 until the division disbanded and the brigade was transferred)\n* 5th Battalion, Border Regiment (from 25 July 1944 until the division disbanded and the brigade was transferred)\n211th Infantry Brigade\n* 13th Battalion, Queen's Royal Regiment (West Surrey) (until 20 July 1944)\n* 2/6th Battalion, Lancashire Fusiliers (until 25 October 1943)\n* 7th Battalion, Queen's Own Royal West Kent Regiment (until 20 April 1944)\n* 8th Battalion, Devonshire Regiment (from 3 November 1943 until 23 July 1944)\n* 12th Battalion, Royal Fusiliers (from 17 September 1943 until 21 July 1944)\n* 5th Battalion, King's Shropshire Light Infantry (from 20 July 1944 until the division disbanded and the brigade was transferred)\n* 8th Battalion, Worcestershire Regiment (from 25 July 1944 until the division disbanded and the brigade was transferred)\n* 8th Battalion, Royal Warwickshire Regiment (from 22 July 1944 until the division disbanded and the brigade was transferred)\n* 9th (Caernarvonshire and Anglesey) Battalion, Royal Welch Fusiliers (from 23 July 1944 until the division disbanded and the brigade was transferred)\nDivisional Troops\n* 80th Infantry (Reserve) divisional artillery, Royal Artillery\n** 195th Field Regiment\n** 199th Field Regiment\n** 94th Anti-Tank Regiment\n* 502nd (London) Field Company, Royal Engineers\n* 80th (Holding and Training) Reconnaissance Regiment, Royal Armoured Corps (formed from 48th, 76th and 77th Independent Reconnaissance Squadrons)\n* 5th Battalion, Cheshire Regiment (Machine Gun Battalion)\n|}\nSee also\n* List of British divisions in World War II\nNotes\nFootnotes\nCitations\nReferences\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\nExternal links\n*  Portrait of Major-General Cox, June 1943.\n*  Photographs of Major-General Cox during his army service, including ones taken during early 1944 in Winchcombe when he was general officer commanding the division."
    }
  ]
}