{
  "content": [
    {
      "type": "text",
      "text": "# 82nd Expeditionary Rescue Squadron\n\n– present\n|country=United States\n|branch=\n|type=\n|role=Search and Rescue\n|size=\n|command_structure=United States Air Forces in Europe – Air Forces Africa\n*Third Air Force\n**406th Air Expeditionary Wing\n***449th Air Expeditionary Group\n|garrison=Camp Lemonnier, Djibouti\n|nickname=Guardian Angel squadron\n|motto=\n|battles=Global War on Terrorism\n|decorations=\n|identification_symbol=\n|identification_symbol_label=Patch worn by a squadron member in 2022\n}}\nThe 82nd Expeditionary Rescue Squadron (82 ERQS) is a provisional unit of the United States Air Force (USAF), assigned to the 449th Air Expeditionary Group. It has been stationed at Camp Lemonnier, Djibouti since at least 2007. The squadron is made up of pararescue personnel, mainly to conducting search and rescue, serving as US Air Forces Africa's personnel recovery liaison to United States Africa Command's Warfighter Recovery Network. Having previously used Lockheed HC-130 aircraft of another air force unit, the 81st Expeditionary Rescue Squadron,  the squadron was training jumps from United States Marine Corps Lockheed Martin KC-130J aircraft. The squadron does not operate any aircraft. As a deployed unit, the squadron's personnel come from other units of the United States Air Force, such as the 31st Rescue Squadron, members of which made up the 82nd ERQS in 2010.\nLineage\n* Constituted as the 82nd Air Rescue Squadron on 12 August 1952\n: Activated on 1 September 1952\n: Inactivated on 21 September 1953\n: Redesignated 82nd Expeditionary Rescue Squadron and converted to provisional status on 14 April 2003\n: Activated at some point between 14 April 2003 and 2 September 2007\nAssignments\n* 12th Air Rescue Group, 1 September 1952 – 21 September 1953 (attached to Twelfth Air Force, 30 October 1952 – 21 September 1953)\n* Air Combat Command, to activate or inactivate at any time, 14 April 2003\n* United States Air Forces in Europe, to activate or inactivate at any time, 1 October 2008\n* 449th Air Expeditionary Group,  – present\nStations\n* Palm Beach International Airport, Florida, 1 September 1952 – 20 October 1952\n* Bordeaux, France, 30 October 1952 – 21 September 1953\n* Camp Lemonnier, Djibouti  – present\nReferences"
    }
  ]
}