{
  "content": [
    {
      "type": "text",
      "text": "# 84th Academy Awards\n\nHollywood, Los Angeles, California, U.S.\n| host             = Billy Crystal\n| preshow          = Jess CagleNina GarcíaTim GunnRobin RobertsLouise Roe\n| producer         = Brian GrazerDon Mischer\n| director         = Don Mischer\n| best_picture     = The Artist\n| most_wins        = The Artist and Hugo (5)\n| most_nominations = Hugo (11)\n| network          = ABC\n| duration         = 3 hours, 13 minutes\n| ratings          = 39.46&nbsp;million23.91% (Nielsen ratings)\n| last             = 83rd\n| next             = 85th\n}}\nThe 84th Academy Awards ceremony, presented by the Academy of Motion Picture Arts and Sciences (AMPAS), honored the best films of 2011 in the United States and took place on February 26, 2012, at the Hollywood and Highland Center Theatre in Hollywood, Los Angeles, beginning at 5:30&nbsp;p.m. PST / 8:30&nbsp;p.m. EST. During the ceremony, the Academy of Motion Picture Arts and Sciences presented Academy Awards (commonly referred to as Oscars) in 24 categories. The ceremony was televised in the United States by ABC, and produced by Brian Grazer and Don Mischer, with Mischer also serving as director. Actor Billy Crystal hosted the show for the ninth time. He first presided over the 62nd ceremony held in 1990 and had last hosted the 76th ceremony held in 2004.\nOn June 14, 2011, academy president Tom Sherak announced at a press conference that, in an attempt to further revitalize interest surrounding the awards, the 2012 ceremony would feature between five and ten Best Picture nominees depending on voting results, as opposed to a set number of nominees. In related events, the academy held its third annual Governors Awards ceremony at the Grand Ballroom of the Hollywood and Highland Center on November 12, 2011. On February 11, 2012, in a ceremony at the Beverly Wilshire Hotel in Beverly Hills, California, the Academy Awards for Technical Achievement were presented by host Milla Jovovich.\nThe Artist won five awards, including Best Picture. Other winners included Hugo with five awards, The Iron Lady with two awards, and Beginners, The Descendants, The Fantastic Flying Books of Mr. Morris Lessmore, The Girl with the Dragon Tattoo, The Help, Midnight in Paris, The Muppets, Rango, Saving Face, A Separation, The Shore, and Undefeated with one. The telecast garnered more than 39 million viewers in the United States.\nWinners and nominees\nThe nominees for the 84th Academy Awards were announced on January 24, 2012, at 5:38&nbsp;a.m. PST (13:38 UTC) at the Samuel Goldwyn Theater in Beverly Hills, California, by Tom Sherak, president of the academy, and the actress Jennifer Lawrence. Hugo led all nominees with eleven nominations; The Artist came in second with ten.\nThe winners were announced during the awards ceremony on February 26, 2012. The Artist was the second silent feature to win Best Picture. The 1927 film Wings was the first such film to achieve this distinction at the inaugural awards ceremony in 1929. Moreover, it was also the first black-and-white feature to win Best Picture since 1993's ''Schindler's List. Best Actor winner Jean Dujardin became the first French actor to win an Academy Award. With her latest win for Best Actress, Meryl Streep became the fifth performer to win at least three acting Oscars.\nAwards\n, Best Director winner]]\n, Best Actor winner]]\n, Best Actress winner]]\n, Best Supporting Actor winner]]\n, Best Supporting Actress winner]]\n, Best Original Screenplay winner]]\n, Best Adapted Screenplay co-winner]]\n, Best Animated Feature Film winner]]\n, Best Foreign Language Film winner]]\nWinners are listed first, highlighted in boldface, and indicated with a double dagger ().\n{| class=wikitable role=\"presentation\"\n|-\n| valign=\"top\" width=\"50%\" |\n* 'The Artist&nbsp;– Thomas Langmann, producer'\n** The Descendants&nbsp;– Jim Burke, Jim Taylor, and Alexander Payne, producers\n** Extremely Loud & Incredibly Close&nbsp;– Scott Rudin, producer\n** The Help&nbsp;– Brunson Green, Chris Columbus, and Michael Barnathan, producers\n** Hugo&nbsp;– Graham King and Martin Scorsese, producers\n** Midnight in Paris&nbsp;– Letty Aronson and Stephen Tenenbaum, producers\n** Moneyball&nbsp;– Michael De Luca, Rachael Horovitz, and Brad Pitt, producers\n** The Tree of Life&nbsp;– Dede Gardner, Sarah Green, Grant Hill, and Bill Pohlad, producers\n** War Horse&nbsp;– Steven Spielberg and Kathleen Kennedy, producers\n| valign=\"top\" width=\"50%\" |\n* 'Michel Hazanavicius&nbsp;– The Artist'\n** Alexander Payne&nbsp;– The Descendants\n** Martin Scorsese&nbsp;– Hugo\n** Woody Allen&nbsp;– Midnight in Paris\n** Terrence Malick&nbsp;– The Tree of Life\n|-\n| valign=\"top\" |\n* 'Jean Dujardin&nbsp;– The Artist as George Valentin'\n** Demián Bichir&nbsp;– A Better Life as Carlos Galindo\n** George Clooney&nbsp;– The Descendants as Matthew \"Matt\" King\n** Gary Oldman&nbsp;– Tinker Tailor Soldier Spy as George Smiley\n** Brad Pitt&nbsp;– Moneyball as Billy Beane\n| valign=\"top\" |\n* 'Meryl Streep&nbsp;– The Iron Lady as Margaret Thatcher'\n** Glenn Close&nbsp;– Albert Nobbs as Albert Nobbs\n** Viola Davis&nbsp;– The Help as Aibileen Clark\n** Rooney Mara&nbsp;– The Girl with the Dragon Tattoo as Lisbeth Salander\n** Michelle Williams&nbsp;– My Week with Marilyn as Marilyn Monroe\n|-\n| valign=\"top\" |\n* 'Christopher Plummer&nbsp;– Beginners as Hal Fields'\n** Kenneth Branagh&nbsp;– My Week with Marilyn as Laurence Olivier\n** Jonah Hill&nbsp;– Moneyball as Peter Brand\n** Nick Nolte&nbsp;– Warrior as Paddy Conlon\n** Max von Sydow&nbsp;– Extremely Loud & Incredibly Close as The Renter\n| valign=\"top\" |\n* 'Octavia Spencer&nbsp;– The Help as Minny Jackson'\n** Bérénice Bejo&nbsp;– The Artist as Peppy Miller\n** Jessica Chastain&nbsp;– The Help as Celia Foote\n** Melissa McCarthy&nbsp;– Bridesmaids as Megan Price\n** Janet McTeer&nbsp;– Albert Nobbs as Hubert Page\n|-\n| valign=\"top\" |\n* 'Midnight in Paris&nbsp;– Woody Allen'\n** The Artist&nbsp;– Michel Hazanavicius\n** Bridesmaids&nbsp;– Kristen Wiig and Annie Mumolo\n** Margin Call&nbsp;– J. C. Chandor\n** A Separation&nbsp;– Asghar Farhadi\n| valign=\"top\" |\n* 'The Descendants&nbsp;– Alexander Payne, Nat Faxon, and Jim Rash; '\n** Hugo&nbsp;– John Logan;\n** The Ides of March&nbsp;– George Clooney, Grant Heslov, and Beau Willimon;\n** Moneyball&nbsp;– Screenplay by Steven Zaillian and Aaron Sorkin; Story by Stan Chervin;\n** Tinker Tailor Soldier Spy''&nbsp;– Bridget O'Connor (posthumous nomination) and Peter Straughan;\n|-\n| valign=\"top\" |\n* 'Rango&nbsp;– Directed by Gore Verbinski'\n** A Cat in Paris&nbsp;– Directed by Alain Gagnol and Jean-Loup Felicioli\n** Chico and Rita&nbsp;– Directed by Fernando Trueba and Javier Mariscal\n** Kung Fu Panda 2&nbsp;– Directed by Jennifer Yuh Nelson\n** Puss in Boots&nbsp;– Directed by Chris Miller\n| valign=\"top\" |\n* 'A Separation (Iran) in Persian&nbsp;– Directed by Asghar Farhadi'\n** Bullhead (Belgium) in Dutch and French&nbsp;– Directed by Michaël R. Roskam\n** Footnote (Israel) in Hebrew&nbsp;– Directed by Joseph Cedar\n** In Darkness (Poland) in Polish&nbsp;– Directed by Agnieszka Holland\n** Monsieur Lazhar (Canada) in French&nbsp;– Directed by Philippe Falardeau\n|-\n| valign=\"top\" |\n* 'Undefeated&nbsp;– T. J. Martin, Daniel Lindsay, and Rich Middlemas'\n** Hell and Back Again&nbsp;– Danfung Dennis and Mike Lerner\n** If a Tree Falls: A Story of the Earth Liberation Front&nbsp;– Marshall Curry and Sam Cullman\n** Paradise Lost 3: Purgatory&nbsp;– Joe Berlinger and Bruce Sinofsky\n** Pina&nbsp;– Wim Wenders and Gian-Piero Ringel\n| valign=\"top\" |\n* 'Saving Face&nbsp;– Sharmeen Obaid-Chinoy and Daniel Junge'\n** The Barber of Birmingham: Foot Soldier of the Civil Rights Movement&nbsp;– Robin Fryday and Gail Dolgin (posthumous nomination)\n** God Is the Bigger Elvis&nbsp;– Rebecca Cammisa and Julie Anderson\n** Incident in New Baghdad&nbsp;– James Spione\n** The Tsunami and the Cherry Blossom&nbsp;– Lucy Walker and Kira Carstensen\n|-\n| valign=\"top\" |\n* 'The Shore&nbsp;– Terry George and Oorlagh George'\n** Pentecost&nbsp;– Peter McDonald and Eimear O'Kane\n** Raju&nbsp;– Max Zähle and Stefan Gieren\n** Time Freak&nbsp;– Andrew Bowler and Gigi Causey\n** Tuba Atlantic&nbsp;– Hallvar Witzø (nomination revoked)\n| valign=\"top\" |\n* 'The Fantastic Flying Books of Mr. Morris Lessmore&nbsp;– William Joyce and Brandon Oldenburg'\n** La Luna&nbsp;– Enrico Casarosa\n** A Morning Stroll&nbsp;– Grant Orchard and Sue Goffe\n** Sunday (Dimanche)&nbsp;– Patrick Doyon\n** Wild Life&nbsp;– Amanda Forbis and Wendy Tilby\n|-\n| valign=\"top\" |\n* 'The Artist&nbsp;– Ludovic Bource'\n** The Adventures of Tintin&nbsp;– John Williams\n** Hugo&nbsp;– Howard Shore\n** Tinker Tailor Soldier Spy&nbsp;– Alberto Iglesias\n** War Horse&nbsp;– John Williams\n| valign=\"top\" |\n* \"'Man or Muppet\" from The Muppets&nbsp;– Music and Lyrics by Bret McKenzie'\n** \"Real in Rio\" from Rio&nbsp;– Music by Sérgio Mendes and Carlinhos Brown; Lyrics by Siedah Garrett\n|-\n| valign=\"top\" |\n* 'Hugo&nbsp;– Philip Stockton and Eugene Gearty'\n** Drive&nbsp;– Lon Bender and Victor Ray Ennis\n** The Girl with the Dragon Tattoo&nbsp;– Ren Klyce\n** Transformers: Dark of the Moon&nbsp;– Ethan Van der Ryn and Erik Aadahl\n** War Horse&nbsp;– Gary Rydstrom and Richard Hymns\n| valign=\"top\" |\n* 'Hugo&nbsp;– Tom Fleischman and John Midgley'\n** The Girl with the Dragon Tattoo&nbsp;– Ren Klyce, Michael Semanick, David Parker, and Bo Persson\n** Moneyball&nbsp;– Deb Adair, Ron Bochar, David Giammarco, and Ed Novick\n** Transformers: Dark of the Moon&nbsp;– Greg P. Russell, Gary Summers, Jeffrey J. Haboush, and Peter J. Devlin\n** War Horse&nbsp;– Gary Rydstrom, Tom Johnson, Andy Nelson, and Stuart Wilson\n|-\n| valign=\"top\" |\n* 'Hugo&nbsp;– Art Direction: Dante Ferretti; Set Decoration: Francesca Lo Schiavo'\n** The Artist&nbsp;– Art Direction: Laurence Bennett; Set Decoration: Robert Gould\n** Harry Potter and the Deathly Hallows – Part 2&nbsp;– Art Direction: Stuart Craig; Set Decoration: Stephenie McMillan\n** Midnight in Paris&nbsp;– Art Direction: Anne Seibel; Set Decoration: Hélène Dubreuil\n** War Horse&nbsp;– Art Direction: Rick Carter; Set Decoration: Lee Sandales\n| valign=\"top\" |\n* 'Hugo&nbsp;– Robert Richardson'\n** The Artist&nbsp;– Guillaume Schiffman\n** The Girl with the Dragon Tattoo&nbsp;– Jeff Cronenweth\n** The Tree of Life&nbsp;– Emmanuel Lubezki\n** War Horse&nbsp;– Janusz Kamiński\n|-\n| valign=\"top\" |\n* 'The Iron Lady&nbsp;– Mark Coulier and J. Roy Helland'\n** Albert Nobbs&nbsp;– Martial Corneville, Lynn Johnson, and Matthew W. Mungle\n** Harry Potter and the Deathly Hallows – Part 2&nbsp;– Nick Dudman, Amanda Knight, and Lisa Tomblin\n| valign=\"top\" |\n* 'The Artist&nbsp;– Mark Bridges'\n** Anonymous&nbsp;– Lisy Christl\n** Hugo&nbsp;– Sandy Powell\n** Jane Eyre&nbsp;– Michael O'Connor\n** W.E.&nbsp;– Arianne Phillips\n|-\n| valign=\"top\" |\n* 'The Girl with the Dragon Tattoo&nbsp;– Angus Wall and Kirk Baxter'\n** The Artist&nbsp;– Anne-Sophie Bion and Michel Hazanavicius\n** The Descendants&nbsp;– Kevin Tent\n** Hugo&nbsp;– Thelma Schoonmaker\n** Moneyball&nbsp;– Christopher Tellefsen\n| valign=\"top\" |\n* 'Hugo&nbsp;– Rob Legato, Joss Williams, Ben Grossmann, and Alex Henning'\n** Harry Potter and the Deathly Hallows – Part 2&nbsp;– Tim Burke, David Vickery, Greg Butler, and John Richardson\n** Real Steel&nbsp;– Erik Nash, John Rosengrant, Dan Taylor, and Swen Gillberg\n** Rise of the Planet of the Apes&nbsp;– Joe Letteri, Dan Lemmon, R. Christopher White, and Daniel Barrett\n** Transformers: Dark of the Moon&nbsp;– Scott Farrar, Scott Benza, Matthew E. Butler, and John Frazier\n|}\nGovernors Awards\nThe academy held its 3rd Annual Governors Awards ceremony on November 12, 2011, during which the following awards were presented:\nHonorary Awards\n* To James Earl Jones for his legacy of consistent excellence and uncommon versatility.\n* To Dick Smith for his unparalleled mastery of texture, shade, form and illusion.\nJean Hersholt Humanitarian Award\n* Oprah Winfrey\nFilms with multiple nominations and awards\nThe following 18 films received multiple nominations:\n{| class=\"wikitable\" style=\"text-align: center;\"\n|-\n! scope=\"col\" width=\"55\" | Nominations\n! scope=\"col\" align=\"center\" | Film\n|-\n| style=\"text-align: center;\" | 11\n| Hugo\n|-\n| style=\"text-align: center;\" | 10\n| The Artist\n|-\n| rowspan=2 style=\"text-align:center\" | 6\n| Moneyball\n|-\n| War Horse\n|-\n| rowspan=2 style=\"text-align:center\" | 5\n| The Descendants\n|-\n| The Girl with the Dragon Tattoo\n|-\n|rowspan=2 style=\"text-align:center\" | 4\n| The Help\n|-\n| Midnight in Paris\n|-\n|rowspan=5 style=\"text-align:center\" | 3\n| Albert Nobbs\n|-\n| Harry Potter and the Deathly Hallows – Part 2\n|-\n| Tinker Tailor Soldier Spy\n|-\n| Transformers: Dark of the Moon\n|-\n| The Tree of Life\n|-\n|rowspan=5 style=\"text-align:center\" | 2\n| Bridesmaids\n|-\n| Extremely Loud & Incredibly Close\n|-\n| The Iron Lady\n|-\n| My Week with Marilyn\n|-\n| A Separation\n|}\nThe following three films received multiple awards:\n{| class=\"wikitable\" style=\"text-align: center;\"\n|-\n! scope=\"col\" width=\"55\" | Awards\n! scope=\"col\" align=\"center\" | Film\n|-\n| rowspan=2 style=\"text-align:center\" | 5\n| The Artist\n|-\n| Hugo\n|-\n| style=\"text-align: center;\" | 2\n| The Iron Lady\n|}\nPresenters and performers\nThe following individuals, listed in order of appearance, presented awards or performed musical numbers.\nPresenters\n{| class=\"wikitable sortable\"\n|-\n! Name(s) !! Role\n|-\n|  || Announcer for the 84th annual Academy Awards\n|-\n|  || Presenter of the opening montage\n|-\n|  || Presenter of the awards for Best Cinematography and Best Art Direction\n|-\n| Jennifer Lopez || Presenters of the awards for Best Costume Design and Best Makeup\n|-\n|  || Presenter of the award for Best Foreign Language Film\n|-\n|  || Presenter of the award for Best Supporting Actress\n|-\n| Tina Fey || Presenters of the awards for Best Film Editing, Best Sound Editing, and Best Sound Mixing\n|-\n| Miss Piggy || Introducers of the performance by Cirque du Soleil\n|-\n| Gwyneth Paltrow || Presenters of the award for Best Documentary Feature\n|-\n|  || Presenter of the award for Best Animated Feature Film\n|-\n| Emma Stone || Presenters of the award for Best Visual Effects\n|-\n|  || Presenter of the award for Best Supporting Actor\n|-\n|  (AMPAS President) || Special presentation congratulating host Billy Crystal and producers Brian Grazer and Don Mischer\n|-\n| Owen Wilson || Presenters of the award for Best Original Score\n|-\n| Zach Galifianakis || Presenters of the award for Best Original Song\n|-\n|  || Presenter of the awards for Best Adapted Screenplay and Best Original Screenplay\n|-\n|  || Presenter of the segment of the Academy Awards for Technical Achievement and the Gordon E. Sawyer Award\n|-\n| Ellie KemperMelissa McCarthyWendi McLendon-CoveyMaya RudolphKristen Wiig || Presenters of the awards for Best Live Action Short Film, Best Documentary Short Subject, and Best Animated Short Film\n|-\n|  || Presenter of the award for Best Director\n|-\n|  || Presenter of the segment of the Honorary Academy Awards and the Jean Hersholt Humanitarian Award\n|-\n|  || Presenter of the In Memoriam tribute\n|-\n|  || Presenter of the award for Best Actor\n|-\n|  || Presenter of the award for Best Actress\n|-\n|  || Presenter of the Best Picture segment and the award for Best Picture\n|}\nPerformers\n{| class=\"wikitable sortable\"\n|-\n! Name(s) !! Role !! Performed\n|-\n| Ann Marie CalhounSheila E.Junkie XLGiorgio MoroderA. R. RahmanEsperanza SpaldingMartin TillmanPharrell WilliamsStephane WrembelHans Zimmer || Musical arrangers || Orchestral\n|-\n|  || Performer || Opening number:The Artist (to the tune of \"I Won't Dance\"),War Horse (to the tune of \"Theme from Mister Ed\"),Extremely Loud and Incredibly Close (to the tune of \"Thanks for the Memory\"),Moneyball (to the tune of \"The Show\"),Hugo (to the tune of \"That's Amore\"),The Tree of Life (to the tune of \"Alfie\"),The Descendants (to the tune of \"Hawaiian War Chant\"),Midnight in Paris (to the tune of \"The Last Time I Saw Paris\"), andThe Help (to the tune of \"The Birth of the Blues\")\n|-\n|  || Performers || Special performance in a tribute to movie memories\n|-\n| Southern California Children's Chorus || Performers || \"What a Wonderful World\" during the annual In Memoriam tribute\n|}\nCeremony information\nhosted the 84th Academy Awards|alt=Photo of Billy Crystal.]]\nBecause of the declining viewership of recent Academy Awards ceremonies, the academy sought ideas to revamp the show while renewing interest with the nominated films. In light of the previous year's telecast, whose performance by co-hosts James Franco and Anne Hathaway yielded critically negative reviews and a 9% decline in viewership, many within the Motion Picture Academy proposed new ways to give the awards a more populist appeal. After a two-year experiment with ten Best Pictures nominees, AMPAS president Tom Sherak announced that the number of final nominees can now range from five to ten as opposed a fixed number. The nomination voting process would be the same as before, through preferential balloting, but now only films that receive a minimum of 5% of total number-one votes are eligible for Best Picture nominations. Academy then-executive director Bruce Davis explained, \"A Best Picture nomination should be an indication of extraordinary merit. If there are only eight pictures that truly earn that honor in a given year, we shouldn't feel an obligation to round out the number.\" Changes in the Best Animated Feature also were announced. In response to the growing number of animated features released per year, the academy stated in a press release that four to five films would now be nominated per year contingent on how many animated feature films were released in that year.\nOriginally, the academy selected director Brett Ratner as co-producer of the ceremony with Don Mischer in August 2011. Actor and comedian Eddie Murphy was hired by Ratner to preside over hosting duties. However, after commenting to radio host Howard Stern during an interview promoting the film Tower Heist that \"rehearsal is for fags\" and disparaging remarks about actress Olivia Munn, Ratner resigned from his co-producing duties on November 8. Murphy subsequently stepped down as host the following day. Immediately, the academy selected film producer Brian Grazer to replace Ratner as co-producer. Actor and veteran Oscar emcee Billy Crystal was recruited by Grazer to take over hosting duties.\nMultiple others participated in the production of the ceremony. Musicians Hans Zimmer and Pharrell Williams composed new music exclusive to the Oscars ceremony, which was later released as an album via the iTunes Store. Oscar-winning production designer John Myhre designed a new stage for the ceremony. Director Bennett Miller filmed several vignettes featuring actors discussing movie memories and the business of filmmaking. Cirque du Soleil, who was concurrently renting the Hollywood and Highland Center for their show Iris, performed a dance number at the ceremony inspired by their aforementioned show. Unlike most Oscar ceremonies, however, Grazer and Mischer announced that neither of the two songs nominated for Best Original Song would be performed live.\nBox office performance of nominated films\nFor the first time since 2008, only one of the nominees for Best Picture had grossed over $100&nbsp;million before the nominations were announced (compared with three from the previous year). The combined gross of the nine Best Picture nominees when the Oscars were announced was $518&nbsp;million with an average gross of $57.7&nbsp;million per film.\nNone of the nine Best Picture nominees was among the top ten releases in box office during the nominations. When the nominations were announced on January 24, 2012, The Help was the highest-grossing film among the Best Picture nominees with $169.6&nbsp;million in domestic box office receipts. Among the remaining eight nominees, Moneyball was the second-highest-grossing film with $75.5&nbsp;million; this was followed by War Horse ($72.3&nbsp;million), Midnight in Paris ($56.4&nbsp;million), Hugo ($55.9&nbsp;million), The Descendants ($51.3&nbsp;million), The Tree of Life ($13.3&nbsp;million), The Artist ($12.1&nbsp;million) and Extremely Loud & Incredibly Close ($10.7&nbsp;million).\nOf the top 50 grossing movies of the year, 36 nominations went to 15 films on the list. Only The Help (13th), Bridesmaids (14th), Kung Fu Panda 2 (15th), Puss in Boots (16th), Rango (22nd), The Girl with the Dragon Tattoo (28th), Moneyball (43rd), and War Horse (46th) were nominated for Best Picture, Best Animated Feature or any of the directing, acting or screenwriting awards. The other top 50 box office hits that earned nominations were Harry Potter and the Deathly Hallows – Part 2 (1st), Transformers: Dark of the Moon (2nd), Rise of the Planet of the Apes (11th), Rio (18th), The Muppets (34th), Real Steel (35th), and The Adventures of Tintin (47th).\nCritical reviews\nThe show received a mixed reception from media publications. Some media outlets were more critical of the show. Television critic Lori Rackl of the Chicago Sun-Times criticized Crystal's performance saying that the emcee \"left his A game at home Sunday. Crystal's mediocre monologue was consistent with a mediocre 84th installment of Hollywood's biggest awards ceremony. Columnist Tim Goodman of The Hollywood Reporter quipped that \"Somewhere, against all odds, James Franco is buying drinks for everybody.\" He went on to say that the previous year's critically panned telecast was eclipsed by Crystal's dull antics and that the show itself was \"poorly paced as any in recent memory.\" Alessandra Stanley of The New York Times lamented, \"The whole night looked like an AARP pep rally.\" She also noted that, \"For a town that prides itself on tinsel and titillation, the night was pretty tame.\"\nOther media outlets received the broadcast more positively. Ken Tucker of Entertainment Weekly commented that despite the ceremony running over three hours and honoring films that had earned modest box office numbers, \"it was a jolly good show.\" He also praised the cast and several sketches and segments from the show. Film critic Roger Ebert lauded Crystal's performance saying \"As probably the most popular Oscar emcee, he astonished the audience by topping himself.\" Of the show itself, Ebert added that it was \"an unqualified improvement\" over the previous year's ceremony. Associated Press critic Frazier Moore pointed out that Crystal's performance \"was nothing new or unexpected in his act\", but he extolled him for stewarding \"a sleek and entertaining Oscarcast.\"\nRatings and reception\nThe American telecast on ABC drew in an average of 39.46 million people over its length, which was a 4% increase from the previous year's ceremony. An estimated 76.56 million total viewers watched all or part of the awards. The show also earned higher Nielsen ratings compared to the previous ceremony with 23.91% of households watching over a 37.64 share. However the program scored a sightly lower 18-49 demo rating with an 11.67 rating over a 32.68 share among viewers in that demographic, essentially flat with last year's numbers. Many media outlets pointed out that the 54th Grammy Awards held two weeks earlier drew a larger audience with an average 39.92 million people watching.\nIn July 2012, the ceremony presentation received eight nominations at the 64th Primetime Emmys. Two months later, the ceremony won one of those nominations for Outstanding Sound Mixing for a Variety Series or Special (Paul Sandweiss, Tommy Vicari, Pablo Munguia, Kristian Pedregon, Bob La Masney, Brian Riordan, Thomas Pesa, Michael Parker, Josh Morton, Patrick Baltzell, Larry Reed, and John Perez).\nIn Memoriam\nThe annual In Memoriam tribute, was presented by host Billy Crystal. Singer Esperanza Spalding performed the Louis Armstrong song \"What a Wonderful World\" alongside the Southern California Children's Chorus during the tribute.\n* Jane Russell – Actress\n* Annie Girardot – Actress\n* John Calley – Executive, producer\n* Polly Platt – Production designer, producer\n* Ken Russell – Director, actor, writer\n* Donald Peterman – Cinematographer\n* Farley Granger – Actor\n* Whitney Houston – Actress, singer\n* Bingham Ray – Executive\n* Takuo Miyagishima – Design engineer\n* Bert Schneider – Producer\n* Michael Cacoyannis – Director, writer, producer\n* David Z. Goodman – Writer\n* James Rodnunsky – Engineer\n* Peter E. Berger – Film editor\n* Jack J. Hayes – Composer, arranger\n* Peter Falk – Actor\n* Cliff Robertson – Actor\n* Laura Ziskin – Producer, humanitarian\n* Sidney Lumet – Director, producer, screenwriter\n* Sue Mengers – Talent agent\n* Steve Jobs – Executive\n* George Kuchar – Experimental filmmaker\n* Hal Kanter – Writer, director\n* Theadora Van Runkle – Costume designer\n* Tim Hetherington – Documentarian\n* Gene Cantamessa – Sound\n* Gary Winick – Director, producer\n* Bill Varney – Sound mixer\n* Jackie Cooper – Actor, director\n* Gilbert Cates – Director, producer\n* Richard Leacock – Documentarian\n* James M. Roberts – Academy executive director\n* Marion Dougherty – Casting director\n* Norman Corwin – Writer, producer\n* Paul John Haggar – Post production executive\n* Joseph Farrell – Marketing research\n* Ben Gazzara – Actor, director\n* Elizabeth Taylor – Actress\nSee also\n* 18th Screen Actors Guild Awards\n* 32nd Golden Raspberry Awards\n* 32nd Brit Awards\n* 54th Grammy Awards\n* 64th Primetime Emmy Awards\n* 65th British Academy Film Awards\n* 36th Laurence Olivier Awards\n* 66th Tony Awards\n* 69th Golden Globe Awards\n* List of submissions to the 84th Academy Awards for Best Foreign Language Film\nNotes\n*aKodak ended its naming rights deal prior to the ceremony, and was temporarily renamed \"Hollywood and Highland Center\" for the ceremony. The theater was later named Dolby Theatre on May 1, 2012.\n*b:If the color sequences in ''Schindler's List are taken into consideration, The Artist'' becomes the first completely black-and-white film to win Best Picture since 1960's The Apartment.\n*c:In July 2012, the academy revoked the Best Live Action Short Film nomination for Tuba Atlantic after the organization learned that the film was broadcast on television in 2010.\nReferences\nExternal links\n;Official websites\n* [http://www.oscar.com/ Academy Awards Official website]\n* [http://www.oscars.org/ The Academy of Motion Picture Arts and Sciences Official website]\n* [https://www.youtube.com/oscars Oscar's Channel]  at YouTube (run by the Academy of Motion Picture Arts and Sciences)\n;News resources\n* [https://www.bbc.co.uk/news/entertainment-arts-16627499 Oscars 2012]  BBC News\n* [https://www.empireonline.com/oscars2012/ Oscars Hub 2012]  Empire\n* [https://www.theguardian.com/film/oscars-2012 Oscars 2012] The Guardian\n;Analysis\n* [http://www.filmsite.org/aa2011.html 2011 Academy Awards Winners and History]  Filmsite\n* [https://www.imdb.com/event/ev0000003/2012 Academy Awards, USA: 2012]  Internet Movie Database\n;Other resources\n*"
    }
  ]
}