{
  "content": [
    {
      "type": "text",
      "text": "# 8th Canadian Film Awards\n\nThe 8th Canadian Film Awards were held on August 6, 1956 to honour achievements in Canadian film. The ceremony was hosted by actor Maurice Evans.\nThis year, the event was held in Stratford for three reasons. The Stratford Festival was celebrating its third year, Tyrone Guthrie's Oedipus Rex, the filmed version of the Stratford Festival's production, was the only feature-length film made in Canada in 1956, and Stratford was planning the new international Stratford Film Festival. This was also the year that television awards were introduced.\nWinners\n*Film of the Year: Not awarded\n*Theatrical Feature Length: Not awarded\n*Theatrical Short: Gold — National Film Board of Canada, Tom Daly producer, Colin Low director\n::Honorable Mention: The Shepherd — Julian Biggs producer and director\n::Special Mention: Jolifou Inn — National Film Board of Canada, Tom Daly producer, Colin Low director\n*TV Information: Saskatchewan Traveller — National Film Board of Canada, Grant McLean producer, Don Haldane director\n::Honorable Mention: Monkey on the Back — National Film Board of Canada, Grant McLean producer, Julian Biggs director\n::Honorable Mention: 'L'Alpinisme — National Film Board of Canada, Guy Glover producer, Rollo Gamble director\n*Non-Theatrical Open: The Colour of Life — National Film Board of Canada, J.V. Durden producer and director\n::Honorable Mention: Les Aboiteaux' (The Dikes) — National Film Board of Canada, Roger Blais producer and director\n::Special Mention: Face of Saskatchewan — Crawley Films, F.R. Crawley and J. Stanley Moore producers\n*Non-Theatrical, Government Sponsored: First Aid for Aircrew — National Film Board of Canada, David Bairstow producer, Walford Hewitson director\n::Honorable Mention: Huff and Puff — National Film Board of Canada, Frank Spiller producer, Graham Crabtree director\n::Special Mention: Identity — Nova Scotia Film Bureau, Margaret Perry director\n::Special Mention: Harvest in the Valley — National Film Board of Canada, Larry Gosnell producer and director\n*Non-Theatrical, Non-Government Sponsored: Not awarded\n::Honorable Mention: Miracle of the Bees — Carey Studios\n::Honorable Mention: Sibling Relations and Personality — Crawley Films, Stanley Jackson producer and director\n::Special Mention: The Revolution Is Now — Crawley Films, Peter Cock producer and director\n::Special Mention: Jamboree — Chetwynd Films, Arthur Chetwynd producer\n*Amateur: Calgary Stampede — Jack W. Ruddell director\n::Honorable Mention: Fox Hunting in Canada — Walter Lynch director\n::Honorable Mention: Mexico - Land of Contrast — Norman Cowan and George Herman directors\n::Special Mention: Experiment in Animation — Donna Martinez\nReferences"
    }
  ]
}