{
  "content": [
    {
      "type": "text",
      "text": "# 8th Armoured Brigade (United Kingdom)\n\n|allegiance=\n|branch=\n|type=Armoured\n|role=\n|size=Brigade\n|command_structure=\n|equipment= CrusaderGrantSherman\n|notable_commanders=Brigadier \"Rosey\" LloydBrigadier E. C. N. CustanceBrigadier \"Roscoe\" HarveyBrigadier J. M. Anstice\n|ceremonial_chief=\n|colonel_of_the_regiment=\n|identification_symbol= Red Fox mask on a yellow background\n|identification_symbol_2=Logo\n|nickname= Red Fox\n|patron=\n|motto=\n|colors=\n|march=\n|mascot=\n|battles=North African CampaignOperation OverlordOperation Market GardenOperation BlackcockOperation Plunder\n|anniversaries=\n|decorations=\n|battle_honours=\n}}\nThe 8th Armoured Brigade was an armoured brigade of the British Army formed in August 1941, during the Second World War and active until 1956. The brigade was formed by the renaming of 6th Cavalry Brigade, when the 1st Cavalry Division based in Palestine (of which it was part) converted from a motorised formation (having been horse-mounted until January 1940) to an armoured unit, becoming 10th Armoured Division.\ns moving forward, Western Desert, 26 November 1941.]]\nNorth Africa\nOperation Supercharge\non the eve of battle.]]\nIn February 1942, the 8th Armoured Brigade moved to the Khatatba region of the Western Desert. After a period of training, the brigade first went into action at the end of August 1942 at Bir Ridge at the Battle of Alam el Halfa. The Second Battle of El Alamein lasted from 23 October to 5 November 1942 and was a watershed in the Western Desert Campaign. the Allied victory at El Alamein ended Axis hopes of occupying Egypt, controlling access to the Suez Canal and gaining access to Middle Eastern oil fields. The defeat at El Alamein marked the end of Axis expansion in Africa. Following the First Battle of El Alamein, which had stalled the Axis advance, Lieutenant-General Bernard Montgomery took command of the British Eighth Army from Claude Auchinleck in August 1942.\nFor the first night of the offensive, Montgomery planned that four infantry divisions from Lieutenant-General Oliver Leese's XXX Corps would advance on a  front, to an objective codenamed the Oxalic Line, over-running the forward Axis defences. The Royal Engineers would clear and mark two lanes through the minefields, through which the armoured divisions from Lieutenant-General Herbert Lumsden's X Corps would pass to gain the Skinflint Report Line, where they would check and report their progress, and the Pierson Bound, where they would rally and temporarily consolidate their position in the Axis defences until the infantry battle had been won. Commanded by Brigadier Edward C. N. Custance, the 8th Armoured Brigade was equipped with   and  when it took part in Operation Supercharge, better known as the Battle of El Alamein.\nOrder of Battle, October 1942\n* 3rd Royal Tank Regiment\n* Sherwood Rangers Yeomanry\n* Staffordshire Yeomanry\n* 1st Battalion, Buffs (Royal East Kent Regiment)\n* 1st Regiment, Royal Horse Artillery\n* 97th (Kent Yeomanry) Field Regiment, Royal Artillery\nThe Sherwood Rangers Yeomanry found a gap in the Axis defences and an attack was made that broke through and started the rout of the Afrika Korps. The brigade was then ordered to find the southern flank of the Axis defences. Driving across country it moved into the desert reaching the coast road at Galal and the German retreat was cut in two. Here, the brigade destroyed  a large number of enemy guns and transport without loss and took 1,000 prisoners.\nEarly in November, the brigade reached the defences of Mersa Matruh and was ordered to halt; the rest of Eighth Army moved past. The 10th Armoured Division was ordered back to Egypt taking, 1st Royal Horse Artillery (1st R. H. A.) with them, leaving the 8th Armoured Brigade to become an independent brigade. At the end of November, the brigade came under the command of the 7th Armoured Division, the famous Desert Rats and was involved in the battles around El Agheila. This battle opened the road past Marble Arch to Nofaliya, which was entered without opposition.\nOn 15 January, the attack on the Buerat–Bungem line was launched. Then followed battles against a series of rear-guard positions at Wadi Zem Zem, where anti-tank guns and tanks were dug in on the reverse slope, Sedada and Tarhuna, where the hilly nature of the country assisted Axis delaying tactics. Tarhuna was the first civilian-occupied town to be captured by the brigade and it was surrendered by the Burgomaster to the Staffordshire Yeomanry. On 23 January, the 3rd Royal Tank Regiment entered Tripoli in the wake of the 11th Hussars. On 24 January, a composite force consisting of the Sherwood Rangers Yeomanry, 1st Buffs, 5th Regiment, Royal Horse Artillery and 7th Medium Regiment RA advanced to the Zavia area, south-west of Tripoli. The brigade was then rested before starting the campaign in Tunisia.\nTunisia and the Mareth Line\nThe brigade took advantage of new equipment and it became normal for the brigade to allocate infantry companies to armoured regiments, forming Armoured Regimental groups. At the start of operations at the Mareth Line, the brigade was formed as follows:\n{| class=\"wikitable\"\n|-\n!3rd Royal Tank Regiment\n!Nottinghamshire Yeomanry\n!Staffordshire Yeomanry\n|-\n| 25 Sherman tanks\n| 23 Sherman tanks\n| 28 Sherman tanks\n|-\n| 4 Grant tanks\n| 4 Grant tanks\n| 3 Grant tanks\n|-\n| 22 Crusader tanks\n| 19 Crusader tanks\n| 19 Crusader tanks\n|-\n| 8 Armoured cars\n| 6 Armoured cars\n| 7 Armoured cars\n|-\n|B Coy, 1st Buffs\n|A Coy, 1st Buffs\n|C Coy, 1st Buffs\n|}\nOn 14 March 1943, the brigade passed from the command of XXX Corps to the New Zealand Corps, joining the 2nd New Zealand Division, the Free French, General Philippe Leclerc de Hauteclocque's forces from Chad (L Force) and the 1st Free French Brigade.\nFollowing the failure of the frontal attack on the Mareth Line during the Tunisia Campaign by XXX Corps, an attempt was made by the New Zealand Corps to outflank the Axis positions in Operation Supercharge II. Initially unsuccessful, the 1st Armoured Division was despatched to reinforce this \"Left-Hook\". On 26 March, the brigade was launched towards El Hamma and penetrated deep into the Switch Line. Having gained all their objectives, the brigade drove through the gap and the Axis forces, pressed by a fresh frontal attack and in danger of being encircled, withdrew some  north-westwards to defensive positions around Wadi Akarit.\nAt the Battle of Wadi Akarit, which occurred from  the brigade first came up against the Tiger I (Panzerkampfwagen VI Tiger I). The brigade, still supporting 2nd New Zealand Division, was next involved in the battles at Enfidaville and Takrouna. Following the capitulation of the Axis forces in North Africa on 13 May, the brigade slowly made its way back to the Nile delta and then was transferred to Britain, arriving on 9 December 1943. After an extended leave, the brigade reassembled in the New Year and was informed of its role in the forthcoming invasion of Normandy.\nThe high level of experience gained by the brigade in North Africa contrasted with many of the other armoured units earmarked for the invasion; some of whom had not seen action since the fall of France in 1940. In an attempt to equalise the level of experience across the brigades, an exchange of units took place in February 1944, the 3rd Royal Tank Regiment was exchanged with the 29th Armoured Brigade, part of the inexperienced 11th Armoured Division, for the 24th Lancers and the Staffordshire Yeomanry was exchanged with the 27th Armoured Brigade for the 4th/7th Royal Dragoon Guards. Shortly thereafter, Brigadier Bernard Cracroft assumed command of the brigade, which now comprised:\nOrder of Battle D-Day\n* 4th/7th Royal Dragoon Guards (4/7 DG)\n* 24th Lancers (24L)\n* Sherwood Rangers Yeomanry (SRY)\n* 147th (Essex Yeomanry) Regiment, Royal Horse Artillery\n* 12th Battalion, King's Royal Rifle Corps\n* 168th (City of London) Light Field Ambulance\n* 552nd Company Royal Army Service Corps\n* 8th Armoured Brigade Workshops R.E.M.E.\n* 265th Forward Delivery Squadron.\nWhile the staffs were involved in the planning of the invasion, the men took part in intensive training exercises.\nOperation Overlord (D-Day)\nGold Beach\nGold Beach was the Allied codename for the centre invasion beach during the Allied invasion of Normandy on 6 June 1944. It lay between Omaha Beach and Juno Beach, was 8&nbsp;km wide and divided into four sectors. From west to east they were How, Item, Jig, and King.\nThe landing area was defended by elements of Generalleutnant Wilhelm Richter's 716th Static Infantry Division and the 1st Battalion of the 916th Infantry Regiment, which had been detached from Generalleutnant Dietrich Kraiss's 352nd Infantry Division.\nGold Beach was allocated to the British Second Army's XXX Corps. The actual assault was to be made by 50th (Northumbrian) Infantry Division, which had been reinforced with 56th Independent Infantry Brigade and supported by the 8th Armoured Brigade. The division's primary objective was to seize the town of Bayeux, the Caen-Bayeux road, and the port of Arromanches; the secondary objectives being to make contact with the Americans landing at Omaha Beach to the West and the Canadians landing at Juno Beach to the East.\nThe 231st Infantry Brigade, followed by the 56th Infantry Brigade, landed in the west, with DD tanks from the Nottinghamshire Yeomanry (Sherwood Rangers) in support. The assault battalions were the 1st Battalion, Hampshire Regiment on Jig Green (west side) and the 1st Battalion, Dorset Regiment on Jig Green (east side).\nThe 69th Infantry Brigade, followed by 151st Infantry Brigade, landed in the east with DD tanks from the 4th/7th Royal Dragoon Guards in support. The assault battalions were the 5th Battalion, East Yorkshire Regiment on King Red and the 6th Battalion, Green Howards on King Green.\nThe Landings\nVC Firefly of 24th Lancers near Saint-Léger, 11 June 1944]]\nH-Hour for the Gold beach landing was set for 0725 hours. For the first time in history, tanks were to lead an assault from the sea on all sectors of the beaches. The secret of the \"Duplex Drive\" had been well kept, for the German appreciation was that they would have no tanks thrown against them during the first five hours. Unfortunately, the sea conditions in the 50th Division sector were adjudged too rough and the tanks were not launched 2 miles out as planned, but a couple of hundred yards from the shore. In spite of this, the 4/7 DG lost 5 and the SRY 8 in the breakers. Throughout the day both Regiments had all three squadrons continually committed, supporting in turn 231st Infantry Brigade, 151st Infantry Brigade and 69th Infantry Brigades. Night fell with all objectives obtained, all tanks committed and no reserves on shore.\nOperation Perch\nFollowing the failure of the British 3rd Infantry Division to capture Caen on 6–7 June, the new plan envisioned I Corps and XXX Corps striking south to encircle the city and for the landing of the 1st Airborne Division, codenamed Operation Wild Oats. I Corps would form the eastern pincer, XXX Corps the western and the paratroopers would land between the two to complete the encirclement of the city and to prevent any German withdrawal from Caen. The 51st (Highland) Infantry Division from I Corps was to push south out of the Orne bridgehead to capture the town of Cagny six miles southeast of Caen. 50th (Northumbrian) Infantry Division and 8th Armoured Brigade were ordered to strike south from their lodgement created on 6 June to capture the town of Bayeux (another D-Day objective which had not been captured) and then capture the town of Tilly-sur-Seulles. Once Tilly-sur-Seulles had been captured, the 7th Armoured Division would pass through the 50th (Northumbrian) and push south to capture the town of Villers-Bocage before turning east to capture the town of Évrecy.\nDuring the remainder of the month, the brigade was deployed in support of 49th and 50th Divisions. Fighting was almost continuous in the area from Rauray, Vendes, Tessel Wood and Fontenay, Lingèvres, Cristot and Le Parc du Bois Londes.\nCasualties were heavy and 124 tanks were put out of action in 25 days. The brigade claimed 86 tanks and Self Propelled Guns destroyed, knocked out or captured during the same period. One of the casualties during the early fighting in Normandy was the English war poet, Captain Keith C. Douglas, killed by mortar fire on 9 June.\nRace for the Seine and beyond\nOrder of Battle 1944–1945\n* 4th/7th Dragoon Guards (4/7 DG)\n* 13th/18th Hussars (13/18 H)\n* Sherwood Rangers Yeomanry (SRY)\n* 147th (Essex Yeomanry) Regiment, Royal Horse Artillery\n* 12th (Queen's Westminsters) Battalion, King's Royal Rifle Corps (K.R.R.C.)\nThe 13th/18th Hussars had now joined the brigade from the disbanded 27th Armoured Brigade, replacing the disbanded 24th Lancers. Brigadier Erroll Prior-Palmer, the former commander of the disbanded 27th Armoured Brigade, assumed command of 8th Armoured Brigade.\nThe orders for the next battle were being given out. The brigade, less 13th/18th Hussars, was to support the 43rd (Wessex) Division. The 13th/18th Hussars were to support the 50th (Northumbrian) Division, whose objective was the ridge known as Butte du Mont a Vent, ground which dominated that over which the rest of the brigade were to fight. The 13/18 H and 50th Division captured Amaye-sur-Seulles, while the SRY, with the 7th Battalion, Hampshire Regiment mounted on their tanks, captured Jurques. La Bigne and Loisonniers were also both secured and, in fighting around Le Plessis Grimault, the brigade captured a Tiger II.\nUnder the command of 50th Northumbrian, the 4/7 DG were involved in very heavy fighting in the capture of St Pierre La Vieille. The drive south to Conde sur Noireau or Operation Black-water followed. The continuous fighting in support, alternately, of two divisions had its effect; casualties had been heavy. The 5th Royal Inniskilling Dragoon Guards and the 86th (East Anglian) (Hertfordshire Yeomanry) Field Regiment, Royal Artillery who, like the Essex Yeomanry, had Sexton self-propelled 25-pounders, were placed under command.\nOn 17 August, again under 43rd Division, the Sherwood Rangers were involved in the crossing of the River Noireau. By the evening of the 17th, the infantry had joined them in the St Honorine area, well beyond the river, and a great battle which had lasted for nineteen days and had caused many casualties, came to an end.\nCrossing the Seine\nThe 4th/7th Royal Dragoon Guards carried out an operation to clear the forest of Laigle and then pressed on to the Seine at Vernon. For three whole days the remainder of the brigade remained static. The river-crossing operation that followed was mounted from a point 120 miles west of the river. The 43rd Division completed the approach march in 36 hours, crossing the 200-yard wide river from the centre of Vernon within 2 hours of their arrival. The assault, led by the tanks of the 4/7 DG on rafts, was launched at 1900hrs on 25 August under an intense artillery barrage and smoke screen. Other tanks drove down all streets leading to the West bank at zero hour, opening fire at point blank range across the river.\nCasualties in men and equipment were considerable, but within 72 hours the bridgehead was over 4 miles deep and the Royal Engineers had constructed a 680-foot folding bridge over which the remaining tanks of the 4/7 DG were able to cross.\nNow the brigade was again to be given an independent role. Instructions from General Horrocks were to cross the river immediately, to fork right and open up the route to the Somme for the Guards Armoured Division.\nThe SRY, 12th K.R.R.C and 13/18 H were moved across on the afternoon of 28 August, at the same time the 4/7 DG reverted to Brigade command. At dawn on the 29th, the brigade advanced. The axis lay along the valley of the tributary river Epte towards Dangu and Gisors, the road dominated by high ground on both sides. The SRY made a left flanking attack through the Bois de Baquet to come in behind the enemy at St Remy, the 13/18 H reached Dangu by nightfall. The next morning the 4/7 DG took the lead and entered Gisors unopposed.\nOn 31 August, the brigade joined up with 11th Armoured Division on the Somme at Amiens and next morning the brigade crossed on a narrow bridge to the west of Amiens and continued the advance on the left of the 11th Armoured Division. By evening, the 13/18 H were through Doullens, where a rearguard action had been fought at the crossing of the river Authie. The 4/7 DG had experienced some fighting at Vignacourt and Canapples on the left but, by evening, they too were up to the Authie.\nXXX Corps continued its advance, with Guards Armoured Division to the right and 11th Armoured Division to the left. A column composed of 8th Armoured Brigade, with 50th Reconnaissance Regiment and the 9th Durham Light Infantry under command, provided left flank protection. Two squadrons of the 4/7 DG and two companies of the 12th K.R.R.C reached the centre of Lille, the fourth biggest town in France, without further enemy opposition.\nBeyond Brussel and Antwerp\nWhile Brussels and Antwerp had been liberated by the Guards Armoured Division and 11th Armoured Division, German troops were reported moving east in northern Belgium. The 8th Armoured Brigade, with elements of 50th Northumbrian Division, were deployed to form a flank guard screen between Lille and Ghent.\nOn 7 September, orders were received for the brigade to march with all speed to the Albert Canal at Beringen, where they were to support the Guards Armoured Division in an attempt to turn the left flank of German 719th Division, who were holding the north bank. The Sherwood Rangers were placed under the command of 50th Northumbrian Division to assault across the Canal further west at Gheel. By midday on 8 September, the leading elements of the 4/7 DG and 12th K.R.R.C were over the canal. The brigade was now stood down for the first period of rest since D-Day.\nMarket Garden\nOperation Market Garden (17–25 September 1944) was intended to secure a series of bridges over the main rivers of the German-occupied Netherlands to allow rapid advance by armoured units through large-scale use of airborne forces.\nThe operation was initially successful, with the capture of the Waal bridge at Nijmegen on 20 September. But it was a failure overall, since the planned Allied advance across the Rhine at Arnhem had to be abandoned. The British 1st Airborne Division did not secure the bridge at Arnhem and, although they managed to hold out near the bridge far longer than planned, the British XXX Corps failed to relieve them. In fairness XXX Corps were delayed as bridges assigned to 101st and 82nd Airborne Divisions were not taken on schedule.\nAfter four days of rest, the brigade moved off after the Guards Armoured Division, who were to link up with the Airborne forces that had dropped at Eindhoven, Grave, Nijmegen and Arnhem in operation \"Market Garden\". A night march brought the 4/7 DG to Nijmegen, where the bridges over the Waal had been captured the previous day by the 82nd Airborne Division supported by the Guards Armoured Division.\nOn the evening of 23 September, B Sqn of the 4/7 DG, carrying troops from the 5th Duke of Cornwall's Light Infantry on their tanks, formed a column and having broken the ring round the Nijmegen bridge moved at speed round the west of Elst for the north edge of \"The Island\" opposite Arnhem. The plan succeeded and, shortly after dark, the leading Troop made contact with the Polish paratroops, who were on the south bank of the Neder Rijn, and the much needed stores and ammunition were handed over in DUKWs.\nThe 13/18 H was involved in operations against the village of Elst with the 4th Wiltshire Regiment, and also in the clearing of ground to the West with 130th Infantry Brigade. To the southeast of Nijmegen, the SRY made history, in company with the US 82nd Airborne Division, by capturing the village of Beek and establishing itself as the first British troops to enter Germany.\nThe brigade now became responsible for the \"Western Approaches\"; the 12th K.R.R.C. and 43rd Reconnaissance Regiment were deployed in defence along an extended front, which was subject to frequent raids.\nOctober was spent on the defensive, which included blunting the German counterattack against the Nijmegen salient. On 18 October, the formation handed over the responsibilities for the \"Western Approaches\" to the US 101st Airborne Division and took over a similar responsibility on the \"Western Approaches\" to Nijmegen. Throughout the period, one regiment supported the 43rd Division to the southeast of Nijmegen overlooking the Reichswald Forest, one regiment remained with the US 101st Airborne Division and the third rested west of the town.\nThe line held by 8th Armoured Brigade stretched approximately 15 miles along the Maas and the Waal. The troops consisted of the 12th K.R.R.C., 43rd Reconnaissance Regiment, a Sqn of the RAF Regiment and members of the Dutch Resistance.\nAt the conclusion of the battle, the brigade now became Corps mobile reserve.\nInto Germany\nOperation Clipper\nOperation Clipper was the code name for an assault on the Siegfried line. It was conducted by the British XXX Corps (which included the U.S. 84th Infantry Division) to reduce the Geilenkirchen salient between 18 and 22 November 1944. The operation was carried out by two divisions, the 43rd (Wessex) Division, and the 83rd Infantry Division (United States) (Railsplitters) supported by the brigade. Extensive use was made of specialised tanks, Sherman Crab 'Flails' of the Lothians and Border Horse to clear minefields, Churchill Tank 'Crocodiles' to attack pillboxes and Grant Canal Defence Light tanks to assist night operations. Heavy rain hampered operations in particular armoured mobility. Despite all original objectives not being taken, the purpose of the attack was achieved, allowing US forces room to manoeuvre as part of Operation Queen.\nOperation Blackcock\nOperation Blackcock was the code name for the clearing of the Roer Triangle formed by the towns of Roermond, Sittard and Heinsberg. It was conducted by the British Second Army between 14 and 26 January 1945. The objective was to drive the German 15th Army back across the Rivers Rur and Wurm and move the frontline further into Germany. The operation was carried out under command of Lieutenant General Neil Ritchie's XII Corps, by three divisions, the 7th Armoured Division, the 52nd (Lowland) Infantry Division and the 43rd (Wessex) Infantry Division. The operation, named after the Scottish black male grouse, is relatively unknown despite the sometimes fierce battles that were fought for each and every village and hamlet within the \"Roer Triangle\".\nThe brigade was now under the command of XII Corps. The next operation, known as \"Blackcock\", was to begin as soon as the ground, by now completely snow-covered, would carry tanks. Its object was to destroy all German troops east of the Koer between Roermond, Geilenkirchen and Sittard. The SRY was to support the 52nd (Lowland) Division in a frontal attack, while the rest of the brigade, with the 155th Infantry Brigade under command, was to operate independently under 7th Armoured Division. The plan was to follow close on the heels of the 7th Armoured Division, break-out at the northern end of the line and then to turn sharp right, coming down behind all the German positions confronting the 52nd (Lowland) Division.\nmen of the 1st Battalion, Glasgow Highlanders ride on white-washed Sherman tanks of the 8th Armoured Brigade in Hongen, 19–20 January 1945.]]\nThe 4/7 DG fought their way forward throughout the night of the 18 and crossed the brook with success, by morning they were on the outskirts of Konigsbosch. Further efforts were made to cross throughout the day but they had to be abandoned due to enemy resistance. The operations of the 4/7 DG with the 4th Battalion, King's Own Scottish Borderers in the rear of the German line had great effect and the frontal attack by 52nd (Lowland) Division met with little resistance. On the evening of 19 January the SRY made contact with the 4/7 DG.\nThe remainder of the brigade was withdrawn and came under command of the 52nd (Lowland) Division, and the 13/18 H were pushed through to exploit the success of the other two regiments.\nReichswald Forest\nThe Reichswald Forest lies in Germany, to the east of Nijmegen and between the Rivers Rhine and Maas. The area is wooded and liable to flooding. In 1945, the winter had been wet and the German defenders had allowed the rivers to flood, thus negating the Allied advantages in armour and manpower. They had also had some weeks to prepare their defences and towns had been turned into fortresses.\nThe brigade reverted to the command of XXX Corps and moved north via Turnhout. Within a week, the concentration of troops was complete and at 0530 hours on the morning of 8 February the greatest bombardment in history was opened up. Every type and size of weapon took part in a bombardment, which lasted five hours. The brigade's tanks fired an average of 300 rounds per gun. Progress was made on all fronts for the first six miles. but 53rd (Welsh) Division failed to capture Cleves and the important Marterborn feature. The 43rd Division, with the 8th Armoured Brigade in support, was brought up and, after a fight, Cleve was in British hands. The 4/7 DG and the 214th Infantry Brigade fought through Marterborn to the ground overlooking the Cleve – Goch Railway.\nThe German reaction was to blow the dykes along the Rhine and masses of water swept across the flat valley, subsidiary dykes burst and the link with Nijmegen, the road through Kranenburg, was flooded to a depth of 3 feet.\nTo the east of the Cleve, during four days and four nights, the brigade supported each Infantry Brigade of the 43rd Division in turn in a continuous assault on the position. On the fifth day, the German resistance broke and the 4/7 DG with 214th Infantry Brigade took over 1,000 prisoners.\nThe brigade, together with the 53rd (Welsh) division, began operations on 24 February to drive southeast astride the river Niers and to capture Weeze. Under difficult going, a halt was called until the 51st (Highland) Division and British 3rd Division came up level. Two days later, a further assault upon the Weeze defences was launched, supported by flame-throwing tanks. By dark, the town was surrounded on three sides and during the night patrols entered the outskirts.\nThe brigade, less 13/18 H, and with 1st Battalion, Oxfordshire and Buckinghamshire Light Infantry under command advanced through Weeze by early afternoon and entered Kevelaer early next morning and the 4/7 DG with 1st Oxfordshire and Buckinghamshire Light Infantry pushed on to Geldern. On the outskirts of Geldern, the 4/7 DG and B Coy, 12th King's Royal Rifle Corps encountered tank fire on the outskirts of Geldern and then discovered that their opponents were the leading elements of the Ninth United States Army. This constituted the first link-up between the British and American forces.\nThe following day the brigade was informed they were required for Operation \"Plunder\", the crossing of the Rhine.\nOperation Plunder\nCommencing on the night of 23 March 1945, Operation Plunder was the crossing of the Rhine river at Rees, Wesel, and south of the Lippe Canal by the British Second Army, under Lieutenant-General Sir Miles Dempsey (Operation Turnscrew, Operation Widgeon, and Operation Torchlight), and the US Ninth Army, (Operation Flashpoint), under Lieutenant General William Simpson. XVIII US Airborne Corps, consisting of British 6th Airborne Division and US 17th Airborne Division, conducted Operation Varsity. All of these formations were part of the 21st Army Group under Field Marshal Sir Bernard Montgomery. This was part of a coordinated set of Rhine crossings.\nThe 8th Armoured Brigade now had four Armoured Regiments, as the Staffordshire Yeomanry returned under Brigade command after they had converted to Duplex Drive tanks under the 79th Armoured Division. The brigade was to support 51st (Highland) Division in the Rhine crossing.\nOn 23 March, at 2100 hours, the leading elements of 51st (Highland) Division crossed the Rhine in assault craft just north of Rees. They were followed by the DD tanks of C Sqn, Staffordshire Yeomanry. The remainder of the regiment crossed at first light and were up with the infantry before any enemy counter-attack could be launched. On the evening of 24 March, the 4/7 DG began to cross, followed in the next two days by the 13/18 H and the SRY. On 27 March, Brigade HQ, 12th K.R.R.C. and the Essex Yeomanry made the crossing. For seven days the brigade then supported 51st (Highland) Division, 43rd Division and the 9th Canadian Infantry Brigade, who were involved in fighting within the bridgehead. On 28 March, Ijsselburg was captured and the road from Anhoh to Gendringen was in allied hands.\nOn 30 March, the brigade moved forward with 4th Somerset Light Infantry in Kangaroo personnel carriers under command. By evening, the outskirts of Varsseveld were reached and 12th K.R.R.C. were in Silvolde.\nThe next objective was to seize a crossing of the Twente Canal at Lochem. At dawn on 31 March, a battle took place at Ruurlo, but the advance continued to Lochem and the brigade covered 25 miles during the day. The next objective was to capture crossings south of Delden. The 12th K.R.R.C. advanced towards Delden, and the next day linked up with the forward troops of 4th Canadian Armoured Division advancing from their bridge-head over the Twente Canal. The advance continued with the objective being Bremen, still over 100 miles distant. The brigade was next deployed to support 214th Infantry Brigade with 13/18 H and 129th Infantry Brigade with 4/7 DG. The SRY was placed in reserve with 130th Infantry Brigade.\nOn 11 April, 130 Infantry Brigade and the SRY took the lead and two days later were on the outskirts of Kloppenburg, where fighting continued into the night before the town fell. The last main road from Bremen to the Netherlands had been severed. On the same day the 8th Armoured Brigade, with 4/7 DG, 12th K.R.R.C. and Essex Yeomanry, was placed under command of British 3rd Infantry Division, which was some 75 miles away to the east. The SRY and 13/18 H were left with 43rd (Wessex) Division.\n3rd Division were engaged with the enemy in the numerous villages south of Bremen and on 15 April a series of attacks began. After several days of fighting, 3rd Division had captured all the ground south of the flooded area. It was now decided to cross the Weser upstream at Verden, where a bridge had been secured, and to attack Bremen from the east. The 52nd (Lowland) Division were to attack with their left on the river, while 43rd Division were to be on their right supported by 8th Armoured Brigade, less 4/7 DG who were to remain with 3rd Division.\nOn 4 May, Brigade HQ was at the village of Rhadereistedt, when the following message was received from the Commander XXX Corps: ‘’Germans surrendered unconditionally at 1820 hours. Hostilities on all Second Army front will cease at 0800 hours tomorrow 5 May 45. NO repeat NO advance beyond present front line without orders from me.’’\nOccupation of Hannover\nThe 8th Armoured Brigade was to proceed south and take over Hannover from the United States Army. Brigade HQ moved to the city on 17 May, the Regiments on 19 May, and the Brigade took over the responsibility for Hannover Stadtkreis and Landkreis on 22 May, from the US 84th Infantry Division.\nHannover which had housed 475,000 inhabitants was now 75% destroyed and still held 300,000 Germans. All rail lines were severed and canals were filled with bridge wreckage, all important roads were cratered. A critical food situation was not simplified by the lack of officials, all prominent Nazis having decamped.\nWhen some order had been restored, it was found that the Brigade was responsible for 45,000 displaced persons of 22 nationalities in 361 camps. All were in rags and hungry, sanitation was a thing of the past and most of their huts were suffering from bomb damage. In addition, there were 2,000 Polish former prisoners of war, whose condition was hardly better than the displaced persons, and 22,000 German prisoners of war.\nTo replace losses and changes, the 107 Heavy Anti-Aircraft Regiment R.A., 113 Light Anti-Aircraft Regiment R.A, 5th Reconnaissance Regiment and 4th (Durham) Survey Regiment R.A. came under command of the Brigade. The Staffordshire Yeomanry returned to the Brigade and the Sherwood Rangers Yeomanry also rejoined the formation at Hannover. The 13th/18th Hussars had left to join 5th Infantry Division in a permanent post-war role of Divisional Cavalry.\nSoon the news was received that the Brigade was to disband and that the Yeomanry Regiments were to pass into a state of \"suspended animation\". At the end of January, the 12th Battalion, The King's Royal Rifle Corps disbanded and during February all ranks of the Sherwood Rangers Yeomanry and the Staffordshire Yeomanry were posted away or discharged. The Headquarters disbanded on 20 March 1946.\nAfter the reformation of the Territorial Army in 1947, it joined the 49th Armoured Division as 8th (Yorkshire) Armoured Brigade. The brigade left the 49th Division in 1956, and later disbanded.\nOrder of battle, Second World War\nThe brigade was composed as follows during the war:\n* Sherwood Rangers Yeomanry (until 30 August 1945)\n* Staffordshire Yeomanry (until 13 February 1944)\n* Royal Scots Greys (until 30 June 1942)\n* 3rd Royal Tank Regiment (from 12 July 1942 until 6 February 1944)\n* 24th Lancers (from 8 February 1944 until 29 July 1944)\n* 4th/7th Royal Dragoon Guards (from 27 February 1944)\n* 13th/18th Royal Hussars (from 29 July 1944)\n* 1st Battalion, Buffs (Royal East Kent Regiment) (from 14 March 1942 until 17 June 1943)\n* 7th Battalion, Rifle Brigade (Prince Consort's Own) (from 1 July 1943 until 3 November 1943)\n* 12th (Queen's Westminsters) Battalion, King's Royal Rifle Corps (from 11 March 1944)\n* 8th Armoured Brigade Postal Unit, Royal Engineers\nCommanders\nThe following officers commanded the\nBrigade during the war:\n* Brigadier L.S. Lloyd (until 2 October 1941)\n* Colonel R.C. Cooney (acting, from 2 to 21 October 1941)\n* Brigadier E.C.N. Cunstance (from 21 October 1941 until 24 January 1943)\n* Brigadier C.B.C. Harvey (from 24 January 1943 until 4 October 1943)\n* Brigadier O.L. Prior Palmer (from 4 October 1943 until 12 November 1943)\n* Colonel R.C. Joy (acting, from 12 November 1943 until 10 January 1944)\n* Brigadier J.H. Anstice (from 10 January 1944 until 18 March 1944)\n* Brigadier H.F.S. Cracroft (from 18 March 1944 until 3 July 1944)\n* Colonel A.D.R. Wingfield (acting, from 3 to 18 July 1944)\n* Lieutenant Colonel R.G. Byron (acting, from 18 to 29 July 1944)\n* Brigadier G.E. Prior Palmer (from 29 July 1944)\nOrder of battle, 1947\n* Yorkshire Hussars, York\n* Queen's Own Yorkshire Dragoons, Doncaster\n* East Riding of Yorkshire Yeomanry, Hull\n* 45th (Leeds Rifles) Royal Tank Regiment\nMajor Formations 8th Armoured Brigade served under\nNorth Africa\n* Eighth Army\n* X Corps\n* XXX Corps\n* New Zealand Corps\n* 10th Armoured Division\n* 7th Armoured Division\n* 2nd New Zealand Division\nNorth West Europe\n* Second Army\n* XXX Corps\n* XII Corps\n* 50th (Northumbrian) Infantry Division\n* 49th (West Riding) Infantry Division\n* 43rd (Wessex) Infantry Division\n* 52nd (Lowland) Infantry Division\n* 3rd Infantry Division\nSee also\n* British Armoured formations of World War II\n* List of British brigades of the Second World War\nNotes\nReferences\n*\n*\n|first1=Major L. F. |last1=Ellis |first2=Captain G. R. G. |last2=Allen R.N. |first3=Lieutenant-Colonel A. E. |last3=Warhurst |first4=Air Chief-Marshal Sir J. |last4=Robb |editor-last=Butler |editor-first=J. R. M. |editor-link=James Ramsay Montagu Butler |series=History of the Second World War United Kingdom Military Series |title=Victory in the West: The Battle of Normandy |volume=I |publisher=HMSO |location=London |edition=Naval & Military Press |year=2004 |orig-year=1962 |isbn=1-84574-058-0 |oclc=276814706 |name-list-style=amp}}\n*\n*\n*\n*\n*\nExternal links\n* http://www.warlinks.com/armour/8th_armoured/chapter_1.html\n* https://web.archive.org/web/20080621202423/http://warchronicle.com/staffsyeo/historiantales_wwii/northafricareg.htm\n* https://web.archive.org/web/20080423181344/http://warchronicle.com/units/British/contents.htm\n*"
    }
  ]
}