{
  "content": [
    {
      "type": "text",
      "text": "# 8th Academy Awards\n\nThe 8th Academy Awards to honour films released during 1935 were held on March 5, 1936, at the Biltmore Hotel in Los Angeles, California and hosted by AMPAS president Frank Capra. This was the first year in which the awards were called \"Oscars\".\nThe Academy voters, who felt guilty about not awarding Bette Davis a Best Actress award the previous year, assigned her one for Dangerous, which was viewed as a lesser picture. Davis, who showed up to the posh formal ceremony in an informal checkered dress, felt it was a consolation prize that should have been awarded to Katharine Hepburn.\nDespite receiving eight nominations, the most of the year, Mutiny on the Bounty became the last film to date to win Best Picture and nothing else (following The Broadway Melody and Grand Hotel), and the only film to receive three nominations for Best Actor.\nThis was the second and last year that write-in votes were permitted; ''A Midsummer Night's Dream'' became the only film to win a write-in Oscar, for Best Cinematography. Miriam Hopkins' Best Actress nomination for Becky Sharp was the first acting nomination for a color film.\nThe short-lived category of Best Dance Direction was introduced this year; it lasted just three years before the Directors Guild of America successfully lobbied for its elimination.\nWinners and nominees\nAwards\nNominees were announced on February 7, 1936. Winners are listed first and highlighted in boldface.\n{| class=wikitable\n|-\n| valign=\"top\" width=\"50%\" |\n*Mutiny on the Bounty – Frank Lloyd and Irving Thalberg for Metro-Goldwyn-Mayer\n** Alice Adams – Pandro S. Berman for RKO Pictures\n** Broadway Melody of 1936 – John W. Considine Jr. for Metro-Goldwyn-Mayer\n** Captain Blood – Hal B. Wallis, Harry Joe Brown, and Gordon Hollingshead for Warner Bros. and Cosmopolitan\n** David Copperfield – David O. Selznick for Metro-Goldwyn-Mayer\n** The Informer – Cliff Reid for RKO Pictures\n** The Lives of a Bengal Lancer – Louis D. Lighton for Paramount\n** ''A Midsummer Night's Dream – Henry Blanke for Warner Bros.\n** Les Misérables – Darryl F. Zanuck for 20th Century and United Artists\n** Naughty Marietta – Hunt Stromberg for Metro-Goldwyn-Mayer\n** Ruggles of Red Gap – Arthur Hornblow Jr. for Paramount\n** Top Hat – Pandro S. Berman for RKO Pictures\n| valign=\"top\" width=\"50%\" |\n*'John Ford&nbsp;– The Informer'\n** Michael Curtiz&nbsp;– Captain Blood (write-in, not official nomination)\n** Henry Hathaway&nbsp;– The Lives of a Bengal Lancer\n** Frank Lloyd&nbsp;– Mutiny on the Bounty\n|-\n| valign=\"top\" width=\"50%\" |\n*'Victor McLaglen&nbsp;– The Informer as \"Gypo\" Nolan'\n** Clark Gable&nbsp;– Mutiny on the Bounty as Fletcher Christian\n** Charles Laughton&nbsp;– Mutiny on the Bounty as Captain Bligh\n** Paul Muni&nbsp;– Black Fury as Joe Radek (write-in, not official nomination)\n** Franchot Tone&nbsp;– Mutiny on the Bounty as Byam\n| valign=\"top\" width=\"50%\" |\n*'Bette Davis&nbsp;– Dangerous as Joyce Heath'\n** Elisabeth Bergner&nbsp;– Escape Me Never as Gemma Jones\n** Claudette Colbert&nbsp;– Private Worlds as Dr. Jane Everest\n** Katharine Hepburn&nbsp;– Alice Adams as Alice Adams\n** Miriam Hopkins&nbsp;– Becky Sharp as Becky Sharp\n** Merle Oberon&nbsp;– The Dark Angel as Kitty Vane\n|-\n| valign=\"top\" width=\"50%\" |\n*'The Scoundrel&nbsp;– Ben Hecht and Charles MacArthur'\n** Broadway Melody of 1936&nbsp;– Moss Hart\n** G Men&nbsp;– Gregory Rogers (pseudonym of Darryl F. Zanuck) (write-in, not official nomination)\n** The Gay Deception&nbsp;– Don Hartman and Stephen Morehouse Avery\n| valign=\"top\" width=\"50%\" |\n*'The Informer&nbsp;– Dudley Nichols (refused), based on the novel by Liam O'Flaherty'\n**Captain Blood &nbsp;– Casey Robinson, based on the novel by Rafael Sabatini (write-in, not official nomination)\n** The Lives of a Bengal Lancer&nbsp;– Achmed Abdullah, John L. Balderston, Waldemar Young, Grover Jones and William Slavens McNutt, based on the autobiography of Francis Yeats-Brown\n** Mutiny on the Bounty&nbsp;– Jules Furthman, Talbot Jennings and Carey Wilson, based on the novel by Charles Nordhoff and James Norman Hall\n|-\n| valign=\"top\" width=\"50%\" |\n*'How to Sleep&nbsp;– Jack Chertok and MGM'\n** Oh, My Nerves&nbsp;– Jules White and Columbia\n** Tit for Tat&nbsp;– Hal Roach and MGM\n| valign=\"top\" width=\"50%\" |\n*'Wings Over Everest&nbsp;– Gaumont British and Skibo Productions'\n** Audioscopiks&nbsp;– Pete Smith and MGM\n** Camera Thrills&nbsp;– Universal\n|-\n| valign=\"top\" width=\"50%\" |\n*'Three Orphan Kittens&nbsp;– Walt Disney Productions and United Artists'\n** The Calico Dragon&nbsp;– Harman-Ising and MGM\n** Who Killed Cock Robin?&nbsp;– Walt Disney Productions and United Artists\n| valign=\"top\" width=\"50%\" |\n*'The Informer&nbsp;– RKO Radio Studio Music Department'\n** Captain Blood&nbsp;– Warner Bros.-First National Studio Music Department (write-in, not official nomination)\n** Mutiny on the Bounty&nbsp;– MGM Studio Music Department\n** Peter Ibbetson&nbsp;– Paramount Studio Music Department\n|-\n| valign=\"top\" width=\"50%\" |\n*'\"Lullaby of Broadway\" from Gold Diggers of 1935&nbsp;– Music by Harry Warren; Lyrics by Al Dubin'\n** \"Cheek to Cheek\" from Top Hat&nbsp;– Music and Lyrics by Irving Berlin\n** \"Lovely to Look At\" from Roberta&nbsp;– Music by Jerome Kern; Lyrics by Dorothy Fields and Jimmy McHugh\n| valign=\"top\" width=\"50%\" |\n*'Naughty Marietta&nbsp;– Douglas Shearer'\n** $1,000 a Minute&nbsp;– Republic Studio Sound Department\n** Bride of Frankenstein&nbsp;– Gilbert Kurland\n** Captain Blood&nbsp;– Nathan Levinson\n** The Dark Angel&nbsp;– Thomas T. Moulton\n** I Dream Too Much&nbsp;– Carl Dreher\n** The Lives of a Bengal Lancer&nbsp;– Franklin Hansen\n** Love Me Forever&nbsp;– John P. Livadary\n** Thanks a Million&nbsp;– E. H. Hansen\n|-\n| valign=\"top\" width=\"50%\" |\n*'The Dark Angel&nbsp;– Richard Day'\n** The Lives of a Bengal Lancer&nbsp;– Hans Dreier and Roland Anderson\n** Top Hat&nbsp;– Carroll Clark and Van Nest Polglase\n| valign=\"top\" width=\"50%\" |\n*'''A Midsummer Night's Dream&nbsp;– Hal Mohr' (write-in, not official nomination)\n** Barbary Coast&nbsp;– Ray June\n** The Crusades&nbsp;– Victor Milner\n** Les Misérables&nbsp;– Gregg Toland\n|-\n| valign=\"top\" width=\"50%\" |\n*'A Midsummer Night's Dream&nbsp;– Ralph Dawson'\n** David Copperfield&nbsp;– Robert J. Kern\n** The Informer&nbsp;– George Hively\n** The Lives of a Bengal Lancer&nbsp;– Ellsworth Hoagland\n** Les Misérables&nbsp;– Barbara McLean\n** Mutiny on the Bounty&nbsp;– Margaret Booth\n| valign=\"top\" width=\"50%\" |\n*'Broadway Melody of 1936 and Folies Bergère de Paris&nbsp;– Dave Gould'\n** ''All the King's Horses and The Big Broadcast of 1936&nbsp;– LeRoy Prinz\n** Broadway Hostess and Go into Your Dance&nbsp;– Bobby Connolly\n** Gold Diggers of 1935&nbsp;– Busby Berkeley\n** King of Burlesque&nbsp;– Sammy Lee\n** She&nbsp;– Benjamin Zemach\n** Top Hat&nbsp;– Hermes Pan\n|-\n| colspan=\"2\" valign=\"top\" width=\"50%\" |\n*'The Lives of a Bengal Lancer&nbsp;– Clem Beauchamp and Paul Wing'\n** David Copperfield&nbsp;– Joseph M. Newman\n** Les Misérables&nbsp;– Eric Stacey\n** A Midsummer Night's Dream&nbsp;– Sherry Shourds (write-in, not official nomination)\n|}\nSpecial Award\n* To David Wark Griffith, for his distinguished creative achievements as director and producer and his invaluable initiative and lasting contributions to the progress of the motion picture arts.\nMultiple nominations and awards\n{| class=\"wikitable plainrowheaders\" style=\"text-align: center; margin-right:1em;\"\n|+ Films with multiple nominations\n|-\n! scope=\"col\" style=\"width:55px;\"| Nominations\n! scope=\"col\" style=\"text-align:center;\"| Film\n|-\n|8\n|Mutiny on the Bounty\n|-\n|7\n|The Lives of a Bengal Lancer\n|-\n|6\n|The Informer\n|-\n|5\n|Captain Blood\n|-\n| scope=\"row\" rowspan=\"3\" style=\"text-align:center\"| 4\n|Les Misérables\n|-\n|A Midsummer Night's Dream\n|-\n|Top Hat\n|-\n| scope=\"row\" rowspan=\"3\" style=\"text-align:center\"| 3\n|Broadway Melody of 1936\n|-\n|David Copperfield\n|-\n|The Dark Angel\n|-\n| scope=\"row\" rowspan=\"3\" style=\"text-align:center\"| 2\n|Alice Adams\n|-\n|Naughty Marietta\n|-\n|Gold Diggers of 1935\n|}\n{| class=\"wikitable plainrowheaders\" style=\"text-align: center; margin-right:1em;\"\n|+ Films with multiple wins\n|-\n! scope=\"col\" style=\"width:55px;\"| Wins\n! scope=\"col\" style=\"text-align:center;\"| Film\n|-\n|4\n|The Informer\n|-\n|2\n|A Midsummer Night's Dream\n|}\nTrivia\nA fictitious version of the 8th Academy Awards was a major scene in the 1937 film A Star Is Born'', in which the character of Esther Blodgett (stage name Vicki Lester), played by Janet Gaynor, wins the Academy Award for Best Actress, only to have her inebriated husband, fallen movie star Norman Maine, played by Fredric March, crash the party and make a scene. Both Gaynor and March were real-life recipients of Academy Awards, for Best Actress and Actor respectively, and were nominated for their roles in said movie.\nThe film shows a ceremony similar to the real one of the day, much smaller and more private than the televised event that occurs today.\nSee also\n* 1935 in film\nReferences"
    }
  ]
}