{
  "content": [
    {
      "type": "text",
      "text": "# 8th King's Royal Irish Hussars\n\n(1693–1800) (1801–1958)\n|branch=\n|type= Cavalry of the Line/Royal Armoured Corps\n|role= Light cavalry\n|size= 550 men\n|command_structure=\n|current_commander=\n|garrison=London\n|garrison_label=Regimental Headquarters\n|ceremonial_chief= HRH Prince Philip\n|ceremonial_chief_label=Colonel-in-Chief\n|colonel_of_the_regiment=\n|nickname= The Crossbelts\n|identification_symbol=\n|identification_symbol_label=\n|identification_symbol_2=\n|identification_symbol_2_label=\n|motto=Pristinae virtutis memores\n|march=Quick: The Galloping 8th HussarSlow: The Scottish Archers\n|anniversaries=Balaklava DaySt Patrick's Day\n}}\nThe '''8th King's Royal Irish Hussars''' was a cavalry regiment in the British Army, first raised in 1693. It saw service for three centuries including the First and Second World Wars. The regiment survived the immediate post-war reduction in forces, and went on to distinguish itself in the battles of the Korean War, but was recommended for amalgamation in the 1957 Defence White Paper prepared by Duncan Sandys. The regiment was amalgamated with the 4th Queen's Own Hussars, to form the Queen's Royal Irish Hussars in 1958.\nHistory\n, 1750)]]\nFormation and War of Spanish Succession\nThe regiment was first raised by Henry Conyngham as '''Henry Conyngham's Regiment of Dragoons''' in Derry in 1693, and ranked as the 8th Dragoons. They soldiered at home as part of the Irish Establishment  but were deployed to Spain in 1704 to take part in the War of the Spanish Succession.\nThe regiment took part in a skirmish near Tanarite at which Henry Conyngham was killed: Robert Killigrew took over but was also killed at the Battle of Almansa in April 1707. Under their new colonel, John Pepper, the 8th Dragoons routed a Spanish cavalry regiment at the Battle of Almenar in July 1710, and, according to tradition, took possession of the enemy regiment's crossbelts. This earned the regiment the nickname \"Crossbelt Dragoons\", borne for many years. The regiment was captured in its entirety at the Battle of Brihuega in December 1710.\nDisbandment and reformation (1713–1796)\nThe regiment returned home and was disbanded in 1714. It was re-raised again in 1715 and deployed to Scotland as part of the response to the Jacobite rising of 1715 and again for the Jacobite rising of 1745. The regiment then moved back to Ireland, where, in 1751, they were formally titled as the 8th Regiment of Dragoons and numbered for the first time as the 8th Dragoons. In 1775 they received their first title, \"The 8th King's Royal Irish Light Dragoons\". The regiment was renamed in 1777 for King George III as the '''8th (The King's Royal Irish) Regiment of (Light) Dragoons. The regiment was deployed to the Low Countries in 1794 for service in the Flanders Campaign and took part in a skirmish at Bousbecque where they captured the French guns. After being directed by King George III to wear buff accoutrements as an honour, the regiment returned to England in November 1795.\nSouth Africa, India and peace (1796–1854)\nThe regiment deployed to South Africa to control the Boers in 1796, then transferred to North Africa and went on to India in 1802 to put down the activities of Daulat Scindia and Yashwantrao Holkar. It fought at the Battle of Laswari in November 1803; Scindia was defeated and Holkar submitted after 3,000 of his men died at Farakhabad in 1805; a peace treaty was signed in January 1806. The regiment then stormed two fortresses belonging to the rebellious Pindaris in September 1812. In 1814, the regiment then took on the Gurkhas, who were seeking to extend the boundaries of Nepal; Colonel Rollo Gillespie was killed in an action at Kalunga: his horse, Black Bob, became a regimental mascot. In 1818, the colonel of the regiment, Sir Banastre Tarleton, received orders that the regiment was to convert to a hussar regiment, retitled the 8th (The King's Royal Irish) Regiment of (Light) Dragoons (Hussars)' The regiment returned to England in 1819. The regiment escorted Queen Victoria and Prince Albert on their first visit to Dublin in 1849.\nCrimean War\n]]\nDuring the Crimean War, the regiment formed part of the Light Brigade. The regiment set sail from Plymouth in early March 1854. Five ships were needed to transport them to the Black Sea. The Echunga, Mary Anne and the Shooting Star left first, followed by the Medora and the Wilson Kennedy'' on 1 May. The next battle was near the River Alma in September 1854 and the 8th Hussars were awarded the battle honour for a convincing defeat of the enemy. On 28 September, following a report that Russian troops were out in front of Balaklava town, the troop of the 8th, which made up Lord Raglan's escort under Captain Chetwode, was thrown out in skirmishing order. The Horse Artillery then came up and opened fire, causing the Russians to abandon all their wagons and flee from the scene. Some 70 wagons and carts were captured, some only containing small arms ammunition, which was destroyed. The rest of the wagons contained black bread. The troops were allowed to pillage the wagons that did not contain anything of value to the Commissariat. As a result, within a few minutes, the ground was strewn with various pieces of clothing – Hussar uniforms, fur cloaks, and wigs. The carriages were said to belong to the suite of Prince Menshikov. After this engagement until 25 October, the regiment furnished patrols and outpost duties, being billeted close to vineyards and barns containing water, corn, hay and fuel.\nIn October, Balaklava and the Charge of the Light Brigade took place. It was started when 25,000 Russians tried to capture Balaklava, the British Army's only port, defended by the 93rd Highlanders, some Turks, and the Cavalry Division. Lieutenant Colonel Sherwell led the King's Royal Irish Hussars, forbidding two soldiers to carry their swords in the charge because they had \"Disgraced the regiment by smoking in the presence of the enemy\". The charge through the crossfire into the mouths of the Russian guns is vividly described by Lieutenant the Hon S Calthorpe, an 8th Hussar ADC.\nThe pace of our Cavalry increased every moment, until they went thundering along the valley, making the ground tremble beneath them. On they went headlong to death, disregarding aught but the object of their attack. At length they arrived at the guns, their numbers sadly thinned, but the few that remained made fearful havoc amongst the enemy's artillery.\n]]\nAs part of the second wave of the brigade's attack, the 8th were in line with the 4th Light Dragoons and, advancing in support at a steady pace, came under fire. Wounded men and horses from the leading squadrons kept dashing out, making the lines unsteady. With the pace increasing, the 4th were not checked by their officers and the lines separated. In spite of the fall of men and horses, the regiment passed the remains of the battery in the valley. The 8th pushed through the line of Russian gunners to the remnants of the first line in retreat, unaware that a Russian brigade of light cavalry was at hand. A regiment of Russian lancers was advancing from behind, as the 8th Hussars went through the infantry crossfire and lost half their men. The remnants of the brigade formed up, totalling about 70 men. They decided to attack the Russian lancers, eventually overthrowing them. The ground was now opened up for the brigade to retire, the 8th now pursued their course to their original position, followed by all the other horsemen of the other regiments and, as their horses became blown or wounded, they tailed. The Russians were now recovering in confidence and they pursued the dismounted men. The officers of the 8th called off the men, freeing up the ground for artillery fire, which gave many the chance to escape. Overall, two officers and 19 other ranks were killed and two officers and 18 other ranks were wounded. One officer and seven other ranks were taken prisoner-of-war.\nThe Battle of Inkerman was won by the infantry in November as the harsh winter of 1854–55 set in, killing 9,000 men. However, the loss of these men did not stop the 8th Hussars from overcoming the Russians at Kertch. In September 1855, Sevastopol fell after nearly a year, and a peace treaty was signed in March 1856.\nOf the 293 other ranks who had set out for the Crimea with the regiment, two were promoted to officer rank, 42 were invalided, 68 died of wounds or disease, 26 were killed in action or died immediately afterward. One private deserted to the Russians and 154 returned with the regiment to England, including 65 who had been to the Danube. Of the 230 troop horses that had set out for the Crimea with the regiment, only 30 were brought home, including 13 that had been to the Danube.\nIndian Rebellion of 1857\nwho was killed by a soldier of the 8th Hussars]]\nThe 8th spent a year in England but were called to India to help suppress the Indian rebellion of 1857 and were ready for war in February 1858. The most celebrated action of the war came three months later at Gwalior when a squadron of the 8th, under Captain Heneage fought a large Indian force under Rani Lakshmibai trying to leave the area. The 8th Hussars charged into the enemy, killing swathes of Indian soldiers, taking two guns and continuing the charge right through the Phul Bagh encampment. Rani Lakshmibai, the Queen of Jhansi state, dressed as a cavalry leader, was badly wounded. She did not want the British to capture her body, so she told a hermit to burn her body. General Sir Hugh Rose awarded the squadron four Victoria Crosses under Clause 13 of the Victoria Cross warrant. This meant that one officer, one NCO, and two for the corporals and troopers, all to be elected by their comrades. Captain C W Heneage, Sergeant J Ward, Farrier G Hollis and Private J Pearson were chosen to be recipients. The citation was published in the London Gazette of 28 January 1859, and read:\nThe remaining year of the Mutiny consisted of the pursuit of the rebel forces. On 5 September 1858, a squadron of \"D\" Troop, 8th Hussars, caught the mutineers at Beejapore, inflicting heavy losses. Of the 850 enemy troops, no less than 450 bodies were counted dead on the field. On 8 September 1858, at Beejapore, when both the officers attached to the troop were disabled, Troop Sergeant-Major James Champion, although severely wounded himself at the start of the action, continued to do his duty and wounded several of the enemy. For this action, he too was awarded the Victoria Cross. From then on, until 21 May 1859, when the Headquarters Troop reached Nusserabad, all troops had been in search of the rebels. In its time in India, the 8th had gone through two hot-weather campaigns, H.Q. Troop had shifted camp 300 times and marched over 3000 miles with some of the other Troops marching close to 4000 miles. Reaching Meerut in February 1861, there was an epidemic of cholera in which the regiment lost two officers and thirty-one men. The title of the regiment was simplified in 1861 to the '''8th (The King's Royal Irish) Hussars'''.\nIreland\nThe 8th Hussars were based at the Curragh in County Kildare, Ireland, between 1869 and 1875. In 1994, a man watching racehorses being trained on the Curragh glimpsed a small piece of metal being thrown up with mud by a horse galloping by; this turned out to be a Victoria Cross (minus its bar). It was presumed to have been one of the four awarded to the 8th Hussars as at the time, and until 1881, soldiers were required to wear all their medals while on duty, and it was thought likely to have belonged to either George Hollis or John Pearson as the other two medals were accounted for; Pearson's collection of medals, including his VC, were subsequently sold at auction in 2004.\nThe future Field Marshal Sir John French, who prided himself on his Irish ancestry despite his family having lived in England since the eighteenth century, was commissioned as a lieutenant in the 8th King's Royal Irish Hussars in February 1874, but there is no evidence that he ever served with them. He transferred to the 19th Hussars in March 1874 possibly as he was better able to afford the £500–£600 per annum required by his new regiment. His biographer Richard Holmes wrote that the 8th King's Royal Irish Hussars at this time had a reputation as an expensive regiment for junior officers, who sometimes drank claret for breakfast.\nAfghanistan and Second Boer War (1863–1914)\nThe regiment returned to India in 1879 and then moved on to Afghanistan to bolster Lord Roberts' army, which was engaged in the Second Anglo-Afghan War; the regiment returned home in 1889.\nIn October 1899, war broke out between the United Kingdom and the Boer republics in South Africa. The regiment sailed to South Africa on the SS Norseman in February 1900, arriving in Cape Town early the next month. Along with the 7th Dragoon Guards and the 14th Hussars they formed the 4th Cavalry Brigade under Brigadier General Dickson. On 1 May 1900, the Boers made a stand in a strong position at Houtnek, where the forces of Ian Hamilton faced stiff competition. In a telegram of 2 May Lord Roberts said: \"Hamilton speaks in high terms of the services of the 8th Hussars under Colonel Clowes and a made-up regiment of Lancers, which came into Broadwood's brigade and assisted in making the Boers evacuate their position\". The 8th then marched from Machadodorp to Heidelberg with the 14th Hussars and M Battery, under the command of Colonel Mahon. On 13 October, Mahon \"became heavily engaged near Geluk with a body of 1100 men with four guns.\" Mahon succeeded in holding his position until forces under John French came to his assistance when the Boers were driven back in a south-easterly direction, having sustained some losses. The 8th lost 2 officers, Lieutenants P A T Jones and F H Wylam and 7 men, with 2 officers and 8 men wounded. Eight officers and 8 non-commissioned officers were mentioned in Lord Roberts' final despatches of 2 April and 4 September 1901. In the first three months of 1901, the 8th was in the column of Colonel Charles Edmond Knox, at one point sweeping to the Swazi border.\nDuring the later phases of the war, the Eastern Transvaal to the borders of Zululand were the principal scenes of the regiment's operations. One officer and 1 non-commissioned officer were mentioned by Lord Kitchener during the war, and in the final despatch, the names of 4 officers, 2 non-commissioned officers, and 1 private were added. Colonel Le Gallais of the 8th Hussars had done splendid service as a leader of Mounted Infantry, and he fell on 6 November 1900 after he had inflicted a defeat on De Wet at Bothaville. Colonel Mahon, also an old 8th Hussar, was celebrated for his conduct of the Mafeking Relief column.\nAfter returning to England, the 8th had over six years without hostilities before returning to India in August 1914 arriving at Ambala as part of the 3rd (Ambala) Cavalry Brigade. They remained in India for three months until they were recalled due to the outbreak of the First World War. They arrived in Marseille on 10 November 1914 where they joined the 1st Indian Cavalry Division.\nFirst World War\nThe 8th Hussars entered the trenches on the Western Front for the first time on 9 December 1914, not having arrived in time to take any part in the Retreat from Mons. The first action that the 8th encountered was in December 1914 at the Battle of Givenchy. The majority of their time was spent sending large parties forward to dig trenches and this continued for the whole of the war. In May 1915, they took part in the Second battle of Ypres where the Germans first used chlorine gas. In September 1915 the 8th Hussars transferred to the 2nd Indian Cavalry Division.\ncaptured at Villiers Faucon]]\nThe majority of the casualties occurred from the unsanitary conditions of the trenches, the cavalry being held almost exclusively in reserve, waiting for \"the gap\" constantly warned off, but never used. In July 1916, the King's Royal Irish Hussars fought at Bazentin, then Flers-Courcelette the following month, both battles being in the Somme area. They returned to the Somme area in March 1917 to clear the small pockets of machine guns left by the retreating Germans. They took part in what would be the Regiment's last mounted charge at Villers-Faucon when B and D Squadrons, supported by a howitzer battery and two armoured cars, attacked a heavily defended German position. B Squadron charged, then attacked on foot (the armoured cars were quickly put out of action) and drew the enemy's fire. D Squadron charged and captured the village with few casualties. The Squadron Commander, Major Van der Byl, was awarded the Distinguished Service Order for the action. Two Maxim machine guns were captured in this action and have been used as guardroom adornments by the 8th Hussars and successor regiments since 1918. During the German spring offensive of 1918, \"C\" Squadron under Captain Adlercron, defended the village of Hervilly until being forced to retreat, only to recapture it later that day at the loss of 66 casualties.\nIn March 1918, they were transferred to the 9th Cavalry Brigade, 1st Cavalry Division. On 11 March, they came on the British War Establishment i.e. D squadron was absorbed into the others. The Germans began to collapse soon after the allies began their final offensive in August, the 8th fighting at St Quentin, Beaurevoir and Cambrai and the Pursuit to Mons. On 11 November 1918, whilst camped at Maffles, the regiment heard that the Armistice had been signed. The 8th Hussars had 105 soldiers killed and countless wounded throughout the four years of the war. The regiment commissioned a memorial to the fallen, which has been on display, where possible, since its unveiling and has been updated with the names of those who fell in the Second World War and the Korean War and is now on display with the successor regiment, the Queen's Royal Hussars.\nInter-war\nThe 8th Hussars returned to England in 1919, and embarked almost immediately for India where they spent less than a year. They were soon ordered to Mesopotamia in order to deal with various native insurrections at Medali, which they put down, moving from there to Egypt. The regiment retitled as the '''8th King's Royal Irish Hussars''' in 1921. In 1923, the Regiment moved back to York and completed a three-year tour as part of the occupation forces in Germany from 1926 to 1929. They then returned to Aldershot, and received their first motorised transport for the machine-gun squadron. In 1934, the 8th moved to Abbassia in Egypt. Their particular brand of soldiering was at an end after 242 years; the King's Royal Irish Hussars had their horses replaced with 15 Cwt Ford V8 pick-up trucks mounted with Vickers–Berthier machine guns. The last mounted parade was held at Coombe Hill in the desert near Cairo on 11 November 1935 where the three sabre squadrons and the mounted band \"trotted past, wheeled and galloped\" for the GOC, Army of the Nile. In 1936, the regiment helped quell civil unrest in Palestine and then returned to Egypt as part of the Matruh Mobile Force.\nSecond World War\nThe Desert War\nof the 8th King's Royal Irish Hussars in North Africa, August 1941.]]\nIn 1938, the regiment was transferred to the Light Cavalry Brigade of the Mobile Division, (The Matruh Mobile Force) which later became the 7th Armoured Division, nicknamed The Desert Rats. Light tanks were issued in January 1939 as the regiment transferred to the Royal Armoured Corps. These were cast-offs from the 7th Hussars and the band was converted to an Anti-Tank Troop in 15 Cwt trucks (Portees). Transfer from Cavalry of the Line to the Royal Armoured Corps came in May 1939 as the regiment prepared for war after the Italian invasion of Albania. For the first time, black berets were worn as working dress instead of the traditional cavalry \"side-hat\". In August 1939, the regiment was sent into the desert to prepare positions at the Mersa Matruh Line. As part of the preparations, petrol dumps were created by burying supplies in the sand with a piece of wood indicating the burial site and marking the position on maps.\nThe regiment was part of the offensive against the Italian Army in North Africa in June 1940, nine months after the outbreak of the Second World War. Sidi Omar was captured immediately and Fort Capuzzo three days later, followed by Fort Maddalena. On 22 October, supporting the 2nd Battalion, Queen's Own Cameron Highlanders an attack was made against Maktila. Other actions took place as part of the campaign against Italian forces including the battle at Sidi Barrani where 14,000 prisoners were captured and the action at Bardia. On 5 January 1941, the regiment captured and occupied El Adem airfield and by 8 January 1942 were part of the forces surrounding Tobruk. In February 1941, they were involved in the decisive Battle of Beda Fomm, which led to the capture of most of the Italian forces in North Africa at the time. In March 1941, the 8th Hussars saw brief service in Greece before returning to North Africa as part of the 1st Armoured Division. The regiment then returned to refit at Mena, Cairo in time for St Patrick's Day.\n.]]\nIn November 1941, the 8th Hussars, in Stuart tanks, were part of the 4th Armoured Brigade for Operation Crusader. During the three-day Battle of Sidi Rezegh Airfield, the regiment had formed a box leaguer for the night-time lull in fighting with the rest of the brigade on 22 November (as neither side had night vision aids, battle normally ceased at dusk). The leaguer was discovered by the 15th Panzer Division during the night and in the ensuing engagement left the Irish Hussars with just four Stuart tanks fit for battle; 35 having been captured or destroyed. The regiment was issued 32 new Stuarts at Cairo and, under the command of Major Sandbach the regiment returned to the battle. On 1 December, to assist ANZAC forces, the regiment charged \"cavalry style\" again at Sidi Rezegh and although the action was successful, Major Sandbach was killed. Command then fell to Major Phillips. After a re-fit and influx of recruits at Beni Yusef, the 8th Hussars were temporarily converted to armoured cars but before seeing action in them were issued with new tanks. A & B Squadrons with the Grant and C Squadron in Stuarts, all under the command of Lt Col Gerald \"Smash\" Kilkelly. Once again part of the 4th Armoured Brigade with which it served during the Gazala battles of May and June 1942, suffering heavy losses at the Battle of Knightsbridge in which Major Hackett was severely burnt and Colonel Kilkelly captured, and also battles at Bardia and Bir Hacheim. The 8th fought hard as a composite unit with the 4th City of London Yeomanry (casualties having reduced the size of both regiments) before having to withdraw with the rest of the British Eighth Army to El Alamein. In June, the remnants of the regiment under command of Lieutenant Colonel \"Cuthie\" Goulbourn detached one squadron to their future partners, the 4th Queen's Own Hussars, to form a temporary regiment called the 4th/8th Hussars. The brigade, including the 8th and the 4th/8th faced the massive enemy onslaught at Alam Halfa, defeating the enemy. They helped breach the minefields at the Second Battle of El Alamein and then joined the pursuit for three weeks. The regiment then enjoyed a short tour in Cyprus before returning to England.\nNormandy and beyond\nOn its return from North Africa, the regiment was re-equipped with Cromwell tanks and retrained at West Tofts Camp near Thetford in Norfolk. In November 1943, the regiment became the Armoured Reconnaissance regiment of the 7th Armoured Division. On 9 June 1944, they were aboard a convoy leaving Bumper Quay in Gosport at 11am, bound for the Normandy beaches. Having been delayed several days by bad weather, they landed at Le Hamel on Gold Beach and leaguered up at Sommervieu near Bayeux. Going into action almost immediately they began taking casualties at Granville Crossroads, Livry in the fighting around Villers-Bocage. From 11 to 30 June, the 8th were involved in the advance through the Bocage with the 22nd Armoured Brigade. They were involved in action against the 2nd Panzer Division, with the 8th leading their division out of the bridgehead. On 30 June, they handed over their positions to tanks from the US 2nd Armored Division and withdrew for a rest and a refit of the tanks. They also fought heavily around Briquessard and took a full part in Operation Goodwood and a number of other smaller engagements. The 8th pushed German forces further and further back, taking part in the actions to close the Falaise pocket suffering more casualties of men and tanks. Reinforced by a squadron from the Northamptonshire Yeomanry, they pushed back through France, the break-out into the low countries, crossing the border into Belgium on 11 September 1944 and into the Netherlands on 23 September, taking up positions at Sint Oedenrode and finally to the Rhine, fighting hard on the way at St Pol, the Nederrijn and the Maas. After wintering in the Maas and spending some time employed as infantry in support of the Rifle Brigade during the latter half of 1944, the regiment painted its vehicles white (including the recently acquired Sherman Firefly versions with their effective 17 pdr guns and the Chaffee recce tanks) and prepared to support the counterattack against the German offensive in the Ardennes. In the event, this did not occur and the Irish Hussars continued their advance across the Netherlands dealing with resistance when they came across it. Colonel Gouldburn moved on at this juncture and was replaced by Lt Col Desmond Fitzpatrick of the Royal Dragoons with Major Wingate Charlton DSC (formerly with \"Glubb\" Pasha in the Arab Legion) as second in command. In April 1945, the 8th crossed Weser River liberating the POW camp at Fallingbostel[http://www.fallingbostelmilitarymuseum.de/stalag/stalag.htm Fallingbostel Military Museum] before ending the war close to Hamburg. The regiment then went to Berlin on 7 July 1945 to take part in the Victory celebrations – the 2nd senior British Army regiment on parade. The regiment stayed in Itzehoe, Germany, for a year, before moving to the Dutch border to help with internal security and occupation duties.\nKorean War\nIn 1948, the 8th returned to Leicestershire, transferring to Tidworth Camp as part of the Strategic Reserve in 1950 but when the Korean War broke out they were sent out as part of the 29th Independent Brigade under the command of Lt Col William Lowther OBE (Bart). Having trained flat-out to become familiar with Centurion MkIII tanks they sailed from Southampton to Korea on the HMT Empire Fowey on 11 October 1950, docking in Pusan on 14 November. Having reached the front, north of Pyongyang, all squadrons found themselves in full retreat, regrouping on the Han River. Early in 1951, Recce Troop saw action on the Han River in an area known as \"Compo Valley\" and had twenty three soldiers killed or missing. During this action, a Cromwell tank was captured by the Chinese and had to be knocked out several days later by fire from the Hussars own Centurions. Captain Donald Lewis Astley-Cooper, who was in command of Recce Troop, then put together a scratch force known as \"Cooper Force\" of Cromwell tanks borrowed from 7 RTR, which assisted the hard-pressed Royal Ulster Rifles, who had been under attack by superior forces since 2 January.\nAstley-Cooper was last seen dismounting his brewed up Cromwell and running away with his loader. His subsequent fate is unknown. In February, the United Nations Forces took the offensive, helping the Glosters capture Hill 327. By April 1951, patrols were probing north of the Imjin River seemingly uncontested until a massive enemy assault started the Battle of the Imjin River on 22 April 1951. During the lull, it had been decided to rotate the 8th back to the United Kingdom. A & B Squadrons along with RHQ had already reached Kure in Japan when the Chinese Spring Offensive had broken out and were immediately ordered back to Korea. C Squadron, commanded initially by the one-eyed veteran Captain Peter Ormrod and then by Major Henry Huth (flown in from Japan) was left to undertake the taskings given to the Hussars alone. The troops of tanks commanded by Capt Ormrod, Capt Murray, Lt Boyall, Lt John Hurst and Lt Radford engaged the attacking Chinese over several days to try to prevent the loss of the important high features defended by the Glosters, the Northumberland Fusiliers and the Royal Ulster Rifles. The 8th were forced to make several sorties into overrun positions to rescue infantrymen cut off by the advancing Chinese infantry. The fighting was fierce:\nRichard Napier, (a tank commander in the battle) in his book From Horses to Chieftains recalls:\n\"After about three hours of continuous firing, my machine gun barrels needed changing; my recoil system was so hot that it wouldn't run back and my loader/operator Ken Hall, had fainted with the continual hard work and fumes.\"\nNapier relates how, unable to use his weapons, he withdrew, allowing infantrymen to hitch a ride on his tank. The Chinese had infiltrated behind them and were swarming around them, shooting at the infantrymen on the tank. The crew resorted to lobbing grenades out of the hatches at the mass of Chinese infantry.\nOn one occasion, the Centurion tanks of the 8th were swamped by Chinese soldiers who were attempting to prise open the hatches to throw grenades inside. The response of the Irish Hussars was to turn the turrets of their tanks towards each other, and \"hose\" the enemy off with their Besa machine guns. On their return to the British Lines, it was said that these tanks \"ran red with the blood of dead Chinese.\" Human detritus was also caught up in the tracks as the tanks had run over a number of Chinese and (unfortunately) some British dead. With the final withdrawal of C Squadron, the battle was over, the last shots being fired by Major Huth. C Squadron them split into two components, one under Major Huth supporting the Northumberland Fusiliers with one troop detached to the Glosters, the other under Capt Strachan in support of the Royal Ulster Rifles. They held their positions for two days in anticipation of further Chinese attacks, which did not come, before withdrawing to Seoul.\nMajor Henry Huth received the DSO for his part in the Imjin battles and Captain Peter Ormrod won the Military Cross.\n\"It was at the Battle of the Imjin River in April 1951 that the Centurions of the 8th Hussars won lasting fame when their tanks covered the withdrawal of the 29th Brigade in heroic fashion in the face of the overwhelming Chinese Spring Offensive\".\nAmalgamation\nBetween 1952 and 1958 the 8th King's Royal Irish Hussars soldiered in Lüneburg enjoying an extended period of peace. In the 1957 Defence White Paper, the 8th Hussars were slated for reduction. In 1958, the Regiment was amalgamated with the 4th Queen's Own Hussars to form the Queen's Royal Irish Hussars.\nRegimental museum\nThe regimental collection is moving to a new facility in Warwick known as \"Trinity Mews\": it is due to open in 2018.\nBattle honours\nThe 8th Hussars received a number of battle honours throughout its existence. As per tradition only 40 of these honours were emblazoned on the Regimental Guidon. The battle honour of Hindoostan was awarded in 1825 for services throughout the period of 1802–1822 including the Second Maratha War and Third Maratha War.\n*Early wars: Leswaree, Hindoostan, Alma, Balaklava, Inkerman, Sevastopol, Afghanistan 1879–80, South Africa 1900–02\n*First World War: Givenchy 1914, Somme 1916; 1918, Cambrai 1917; 1918, Bapaume 1918, Rosieres 1918, Amiens 1918, Albert 1918, Beaurevoir, Pursuit to Mons, France and Flanders 1914–1918\n*Second World War: Villers Bocage, Mont Pincon, Dives Crossing, Nederrijn, Best, Lower Maas, Roer, Rhine, North-West Europe 1944–45, Egyptian Frontier 1940, Sidi Barrani, Buq Buq, Sidi Rezegh 1941, Relief of Tobruk 1941, Gazala, Bir el Igela, Mersa Matruh, Alam el Halfa, El Alamein, North Africa 1940–42,\n*Korean War: Seoul, Hill 327, Imjin, Kowang-San, Korea 1950–51\nNotable personalities\n* Field Marshal Sir John French, 1st Earl of Ypres\n* General Sir Robert \"Rollo\" Gillespie 1766–1814\n* General Sir John Hackett (British Army officer)\n* Lieutenant General James Brudenell, 7th Earl of Cardigan\n* Lieutenant the Hon. John Charles Henry Fitzgibbon (only son of the 3rd Earl of Clare). Killed in action at Balaklava\n* Captain Bill Bellamy MC author of ''Troop Leader: A Tank Commander's Story\nRegimental colonels\nColonels of the Regiment were:\n*1693–1706: Maj-Gen. Henry Conyngham\n*1706–1707: Maj-Gen. Robert Killigrew\n*1707–1714: Maj-Gen. John Pepper\n*disbanded 1714''\n;John Pepper's Regiment of Dragoons - (reformed 1715)\n*1715–1716: Maj-Gen. John Pepper (reappointed)\n*disbanded 1716\n;Phineas Bowles's Regiment of Dragoons - (reformed 1719)\n*1719–1722: Maj-Gen. Phineas Bowles (senior)\n*1722–1725: Brig-Gen. Richard Munden\n*1725–1731: F.M. Sir Robert Rich, 4th Bt\n*1731–1733: Maj-Gen. Charles Cathcart, 8th Baron Cathcart\n*1733–1736: Brig-Gen. Sir Adolphus Oughton, Bt\n*1737–1740: Lt-Gen. Clement Neville\n*1740–1755: Lt-Gen. Richard St George\n;8th Regiment of Dragoons - (1751)\n*1755–1758: Gen. John Waldegrave, 3rd Earl Waldegrave\n*1758–1760: Gen. Sir Joseph Yorke, 1st Baron Dover, KB\n*1760–1787: Gen. John Severne\n;8th (The King's Royal Irish) Regiment of (Light) Dragoons - (1777)\n*1787–1789: Gen. Charles Grey, 1st Earl Grey, KB\n*1789–1797: Gen. Francis Lascelles\n*1797–1788: Gen. Charles Grey, 1st Earl Grey, KB (reappointed)\n*1799–1804: Gen. Sir Robert Laurie, Bt\n*1804–1818: Gen. Sir John Floyd, Bt\n*1818–1833: Gen. Sir Banastre Tarleton, Bt., GCB\n;8th (The King's Royal Irish) Regiment of (Light) Dragoons (Hussars) - (1822)\n*1833–1839: Gen. Sir William Keir Grant, KCB, GCH\n*1839–1840: Lt-Gen. Sir Joseph Straton, CB, KCH\n*1840–1843: Lt-Gen. Philip Philpot\n*1843–1855: Gen. Sir John Brown, KCH\n*1855–1865: F.M. George Charles Bingham, 3rd Earl of Lucan, GCB\n;8th (The King's Royal Irish) Hussars - (1861)\n*1865–1868: Gen. John Lawrenson\n*1868–1875: Gen. John Charles Hope Gibsone\n*1875–1880: Lt-Gen. Rudolph de Salis, CB\n*1880–1886: Gen. William Charles Forrest, CB\n*1886–1886: Lt-Gen. Sir James Robertson Steadman Sayer, KCB\n*1886–1895: Lt-Gen. Sir Charles Craufurd Fraser, Bt., VC, KCB\n*1895–1910: Maj-Gen. William Mussenden\n*1910–1930: Gen. Sir Bryan Thomas Mahon, KCB, KCVO, DSO\n;8th King's Royal Irish Hussars - (1921)\n*1930–1948: Brig. John van der Byl, DSO\n*1948–1958: Col. (Air Marshal) Sir John Eustace Arthur Baldwin, KBE, CB, DSO\nSee also\n*British cavalry during the First World War\nReferences\nBibliography\n*\n*\n*\n*\nExternal links\n* [https://web.archive.org/web/20080521020040/http://www.qrh.org.uk/ Regimental Association] (as the regiment is now part of the Queen's Royal Hussars, the Association is also merged)\n*"
    }
  ]
}