{
  "content": [
    {
      "type": "text",
      "text": "# 900th Expeditionary Air Refueling Squadron\n\n|allegiance=\n|branch=\n|type=\n|role=Air refueling\n|size=\n|command_structure=\n|current_commander=\n|garrison=\n|nickname=\n|motto=Capable – Dependable\n|colors=\n|march=\n|mascot=\n|battles=European Theater of Operations\n|notable_commanders=\n|anniversaries=\n|decorations=\n|battle_honours=\n|identification_symbol=\n|identification_symbol_label=900th Expeditionary Air Refueling Squadron emblem\n|identification_symbol_2=\n|identification_symbol_2_label=600th Bombardment Squadron emblem\n|identification_symbol_3=Triangle W\n|identification_symbol_3_label=World War II group tail marking\n|identification_symbol_4=N8\n|identification_symbol_4_label=World War II squadron fuselage code\n}}\nThe 900th Expeditionary Air Refueling Squadron is a provisional United States Air Force unit. It was last known to be assigned to the 398th Air Expeditionary Group at Incirlik Air Base, Turkey.\nThe squadron was first activated during World War II as the 600th Bombardment Squadron.  The squadron saw combat in the European Theater of Operations with Eighth Air Force and returned to the United States, where it was inactivated in the fall of 1945.\nThe squadron was activated again under Strategic Air Command in 1962 as the 900th Air Refueling Squadron.  It maintained aircraft on alert at Sheppard Air Force Base, Texas and deployed aircraft and crews to support Operation Arc Light and Operation Young Tiger in Southeast Asia.  It was inactivated in 1966.\nIn 1985, the two squadrons were consolidated, but remained inactive until activated as the 900th Expeditionary Air Refueling Squadron.\nHistory\nWorld War II\n, Germany]]\nThe 600th Bombardment Squadron was activated at Ephrata Army Air Base, Washington in early 1943 as one of the four original squadrons of the 398th Bombardment Group. The squadron trained under II Bomber Command with Boeing B-17 Flying Fortresses. The squadron's training was interrupted in July 1943, when it became a Replacement Training Unit. Replacement training units were oversized units which trained aircrews prior to their deployment to combat theaters. In November, replacement training ended and the squadron resumed its preparation for overseas deployment.\nThe 600th deployed to England in April 1944 aboard the . Its parent group was the last B-17 group to be assigned to VIII Bomber Command. The squadron flew its first combat mission the following month.  Until V-E Day the squadron participated in the air offensive against Nazi Germany, bombing such targets as factories in Berlin, marshalling yards in Saarbrücken, shipping facilities in Kiel, oil refineries in Merseburg and aircraft factories in Münster.\nIn June 1944, prior to Operation Overlord, the Normandy invasion, the squadron temporarily suspended its strategic bombing to attack coastal defenses and enemy troop concentrations on the Cherbourg peninsula. Eighth Air Force took advantage of the diversion from strategic bombing to allow newly arrived units like the 600th to fly attacks against nearby targets to gain combat experience.  The first target assigned was a V-1 flying bomb launch site near Sottevast, but the unit's inexperience and overcast conditions in the target area caused it to return to its home station without bombing.\nThe squadron also struck gun positions near Eindhoven to support Operation Market Garden, the airborne attacks in the Netherlands, in September and attacked power stations, railroads and bridges during the Battle of the Bulge from December until January 1945.  It attacked airfields in March 1945 during Operation Varsity, the airborne assault across the Rhine River.\nThe squadron flew its last combat mission on 25 April 1945 when it attacked the airfield at Plzeň, Czechoslovakia.  After the German surrender it transported liberated prisoners of war from Germany to France. It left Europe in May and returned to the United States aboard the , arriving at the New York Port of Embarkation on 29 June. Squadron members were given thirty days leave, and a cadre assembled at Drew Field, Florida, where the squadron was inactivated in August 1945.\nCold War\nThe 900th Air Refueling Squadron was established under Strategic Air Command (SAC) on 9 April 1962 and organized on 1 October at Sheppard Air Force Base, Texas, where it was assigned to the 4245th Strategic Wing and equipped with Boeing KC-135 Stratotankers. The 4345th wing was established by SAC in a program to disperse its Boeing B-52 Stratofortress bombers over a larger number of bases, thus making it more difficult for the Soviet Union to knock out the entire fleet with a surprise first strike. The squadron provided air refueling primarily to the B-52s of the 4245th wing.   Half of the squadron's aircraft were maintained on fifteen-minute alert, fully fueled and ready for combat. The 4245th (and later the 494th) continued to maintain an alert commitment until shortly before inactivation in 1966.\nIn February 1963, The 494th Bombardment Wing assumed the aircraft, personnel and equipment of the discontinued 4245th wing. The 4245th was a Major Command controlled (MAJCON) wing, which could not carry a permanent history or lineage, and SAC wanted to replace it with a permanent unit.   The 900th was assigned to the newly activated 494th wing. In 1966 the squadron deployed aircraft and aircrews to the Pacific to support Operation Arc Light and Operation Young Tiger.\nIn April 1966 the 494th wing was discontinued as SAC began to retire its older B-52s and withdraw its forces from areas far from the borders of the United States.  As a result, the 900th left Sheppard for Pease Air Force Base, New Hampshire, where it was reassigned by SAC to the 509th Bombardment Wing, which had disposed of its Boeing B-47 Stratojets and was converting to B-52s. The 900th was inactivated on 25 June 1966 and its mission, personnel and equipment were reassigned to the 34th Air Refueling Squadron, which moved on paper to Pease from Offutt Air Force Base, Nebraska.\nIn September 1985, the 600th Bombardment Squadron and the 900th Air Refueling Squadron were consolidated into a single unit, but remained inactive.\nProvisional unit\nThe consolidated unit was converted to a provisional squadron as the 900th Expeditionary Air Refueling Squadron and assigned to the United States Air Forces in Europe as a KC-135R refueling organization.  It was manned by deployed members of various Air National Guard units, including the Kansas Air National Guard 190th Air Refueling Wing, at Incirlik Air Base, Turkey in 2001.  The squadron supported aircraft operations during Operation Northern Watch.\nThe unit was reactivated approximately in 2003 and assigned to the 398th Air Expeditionary Group, again at Incirlik, supporting Operation Iraqi Freedom.   The 900th was inactivated approximately 2008.\nLineage\n600th Bombardment Squadron\n* Constituted as the 600th Bombardment Squadron (Heavy) on 15 February 1943\n: Activated on 1 March 1943\n: Redesignated 600th Bombardment Squadron, Heavy 1944\n* Inactivated on 1 September 1945\n* Consolidated on 19 September 1985 with the 900th Air Refueling Squadron as the 900th Air Refueling Squadron\n900th Expeditionary Air Refueling Squadron\n* Constituted as the 900th Air Refueling Squadron, Heavy on 19 April 1962 and activated (not organized)\n: Organized on 1 October 1962\n* Discontinued and inactivated on 25 June 1966\n* Consolidated on 19 September 1985 with the 600th Bombardment Squadron (remained inactive)\n: Converted to provisional status and redesignated 900th Expeditionary Air Refueling Squadron on 5 February 2001\n: Activated c. 2001\n: Inactivated c. 2001\n: Activated c. April 2003\n: Inactivated c. 2008\nAssignments\n* 398th Bombardment Group: 1 March 1943 – 1 September 1945\n* 4245th Strategic Wing: 1 October 1962\n* 494th Bombardment Wing: 1 February 1963\n* 509th Bombardment Wing: 2 April 1966 – 25 June 1966\n* 398th Air Expeditionary Group: 2001\n* 398th Air Expeditionary Group: 2003–2008\nStations\n* Ephrata Army Air Base, Washington, 1 March 1943\n* Bishop Army Air Field, California, 5 April 1943\n* Geiger Field, Washington, 29 April 1943\n* Rapid City Army Air Base, South Dakota, 10 June 1943 – 4 April 1944\n* RAF Nuthampstead (AAF-131), England, 22 April 1944 – 26 May 1945\n* Drew Field, Florida, 3 July 1945 – 1 September 1945\n* Sheppard Air Force Base, Texas, 1 October 1962\n* Pease Air Force Base, New Hampshire, 2 April 1966 – 25 June 1966\n* Incirlik Air Base, Turkey, 2001\n* Incirlik Air Base, Turkey, 2003–2008\nAircraft\n* Boeing B-17 Flying Fortress, 1943–1945\n* Boeing KC-135 Stratotanker, 1962–1966, 2001, 2003–2008\nCampaigns\n{| class=\"wikitable\"\n|- style=\"background:#efefef;\"\n! Campaign Streamer\n! Campaign\n! Dates\n! Notes\n|-\n| ||American Theater||1 March 1943 – 4 April 1944||600th Bombardment Squadron\n|-\n|||Air Offensive, Europe||22 April 1944 – 5 June 1944||600th Bombardment Squadron\n|-\n|||Normandy||6 June 1944 – 24 July 1944||600th Bombardment Squadron\n|-\n|||Northern France||25 July 1944 – 14 September 1944||600th Bombardment Squadron\n|-\n|||Rhineland||15 September 1944 – 21 March 1945||600th Bombardment Squadron\n|-\n|||Ardennes-Alsace||16 December 1944 – 25 January 1945||600th Bombardment Squadron\n|-\n|||Central Europe||22 April 1944 – 21 May 1945||600th Bombardment Squadron\n|-\n|||Air Combat, EAME Theater||22 April 1944 – 11 May 1945||600th Bombardment Squadron\n|}\nSee also\n* List of United States Air Force air refueling squadrons\n* B-17 Flying Fortress units of the United States Army Air Forces\nReferences\nNotes\n; Explanatory notes\n; Citations\nBibliography\n*\n*\n*\n*\n*\n*\n*\n*\n*\nFurther reading\n*\nExternal links"
    }
  ]
}