{
  "content": [
    {
      "type": "text",
      "text": "# 90th Anniversary of the Estonian Republic\n\n| dates=  to\n| genre= National\n| attendance=\n| budget= 135 million krones(estimated 2007)\n| patron=\n| website= http://www.eesti90.ee\n}}\nThe 90th Anniversary of Estonian Republic (or more commonly used Estonia 90) is an official government program for the celebration of the Republic of Estonia's 90th anniversary. It is currently the largest and longest Estonian Independence Day celebration event which is entirely funded by the Government of Estonia. The celebrations started on 28 November 2007 and finished on 28 November 2008 with the opening of the Estonian War of Independence Victory Column on the Freedom Square of Tallinn.\nHistorical background\nEstonia as a unified political entity first emerged after the Russian February Revolution of 1917. With the collapse of the Russian Empire in World War I, Russia's provisional government granted national autonomy to a unified Estonia in April. The Governorate of Estonia in the north (corresponding to the historic Danish Estonia) was united with the northern part of the Governorate of Livonia. Elections for a provisional parliament,  Maapäev, were organized. On 5 November 1917, two days before the October Revolution in Saint Petersburg, Estonian Bolshevik leader Jaan Anvelt violently usurped power from the legally constituted Maapäev in a coup d'état, forcing the Maapäev underground.\nAfter the collapse of the peace talks between Soviet Russia and the German Empire in February 1918, mainland Estonia was occupied by the Germans, with Bolshevik forces retreating to Russia. Between the Russian Red Army's retreat and the arrival of advancing German troops, the Salvation Committee of the Estonian National Council Maapäev issued the Estonian Declaration of Independence. in Pärnu on 24 February 1918. After the withdrawal of German troops in November 1918, the Estonian provisional government retook office. A military invasion by Red Army followed a few days later, however, marking the beginning of the Estonian War of Independence (1918–1920). The Estonian army cleared the Red Army from Estonia by February 1919.\nOn 5–7 April 1919, the Estonian Constituent Assembly was elected. On 2 February 1920, the Treaty of Tartu was signed by the Republic of Estonia and Russian SFSR. The terms of the treaty stated that Russia renounced in perpetuity all rights to the territory of Estonia. The first Constitution of Estonia was adopted on 15 June 1920. The Republic of Estonia obtained international recognition and became a member of the League of Nations in 1921.\nTimetable\nThe timeline as quoted from the eesti90.ee celebration site:\n* December 2007 –  Month of Estonian People\n*:\"December – the first month of the anniversary year of the Republic of Estonia – is dedicated to the Estonian people, as the people are the first institution mentioned in our Constitution\".\n* January 2008 –  Month of the War of Independence\n*:\"In January, several important battles have been held for gaining independence in Estonia. In January, weapons were laid down in the Estonian War of Independence as well. Thus, January is dedicated to the War of Independence\".\n* February 2008 –  Month of the President of the Republic\n*:\"On 24 February, Independence Day is celebrated in the Republic of Estonia. This is the day that the Independence Manifesto was declared in Tallinn 90 years ago. On 23 February, this took place in Pärnu, which is why this time, the national celebration of Independence Day takes place on two days and in two towns\".\n* March 2008 –  Month of the Chancellor of Justice and the National Audit Office\n*:\"March is dedicated to the Chancellor of Justice and the National Audit Office. These constitutional institutions are responsible for good legislation and fiscal control in our country. The National Audit Office inspects the economic activities of state authorities and companies and the exploitation of public property; the Chancellor of Justice sees that legislation of general application would be in compliance with the Constitution and other laws\".\n* April 2008 – Riigikogu Month\n*:\"On 23 April, Estonian Parliament, the Riigikogu, celebrates its birthday. According to the Constitution, the people are the highest authority in Estonia, but the legislative power belongs to the Riigikogu elected by the people\".\n* May 2008 –  Month of the Courts\n*:\"May is the month of the Court. For the month dedicated to the Estonian courts, it is only appropriate to recall the Constitution, which says: justice shall be administered only by the Courts; the Courts shall be independent in their work and shall administer justice in accordance with the Constitution and laws\".\n* June 2008 –  Month of the Bank of Estonia\n*:\"June is dedicated to the Bank of Estonia. The Bank of Estonia manages currency circulation and is responsible for the stability of the currency of the state. June is also dedicated to the central bank because in June 1992, one of the most important episodes in the restoration of independence in Estonia took place – currency reform, in the course of which we re-adopted our own currency\".\n* July 2008 –  Local Governments Month\n*:\"The experience in deciding upon local matters is what gives rise to big things. That is why July is dedicated to local governments. Midsummer is the time to discover beautiful places in the fatherland. When visiting various local governments and anniversary events organized by them, let us remember: local governments decide upon and organize all issues of local life according to laws, and what is most important – do so independently\".\n* August 2008 –  Month of Exile, Resistance and Restoration of Independence\n*:\"August is dedicated to the topics of: exile, resistance and restoration of independence. Without this era, which caused many people to suffer, our country would definitely be much different today. Let us remember our compatriots, and at the same time feel glad for the restoration of independence\".\n* September 2008 –  School Month\n*:\"The history of the Estonian school has been a decisive factor in the self-consciousness of our people and the development of our state. From school, we get stories to remember, find friends to appreciate, and education to support our path in life and view of the world. September is the month of the school – dedicated to the seekers and providers of education at all schools\".\n* October 2008 –  Month of Nationalities in Estonia\n*:\"In Estonia, there are 121 different ethnic nationalities, and October – the month of the Estonian nationalities – is dedicated to them. Our first Constitution provided national minorities with a chance to establish cultural autonomy, which made us innovative in Europe. The slogan \"A country built together\" has also been inspired by operating together here in Mary's Land\".\n* November 2008 –  Month of the Government of the Republic\n*:\"In November, most of the state authorities of Estonia were established, which were needed for the normal functioning of the state in the future and for supporting the work of the government. This is why it is appropriate to take a look into the future in the month dedicated to the Government of the Republic\".\nSee also\n* 90th anniversary of the Latvian Republic\n* 100th Anniversary of Estonian Republic\nReferences"
    }
  ]
}