{
  "content": [
    {
      "type": "text",
      "text": "# 922nd Expeditionary Reconnaissance Squadron\n\n|branch=\n|type=\n|role=Reconnaissance\n|size=\n|command_structure=Air Combat Command\n|current_commander=\n|garrison=\n|ceremonial_chief=\n|colonel_of_the_regiment=\n|nickname=\n|patron=\n|motto=United for Peace\n|colors=\n|march=\n|mascot=\n|battles=\n|anniversaries=\n|decorations=Air Force Outstanding Unit Award\n|identification_symbol=\n|identification_symbol_label=922d Expeditionary Reconnaissance Squadron emblem\n|identification_symbol_2=\n|identification_symbol_2_label=Patch with 922d Air Refueling Squadron emblem\n}}\nThe 922d Expeditionary Reconnaissance Squadron is a provisional United States Air Force unit, assigned to Air Combat Command to activate or inactivate as needed. It was last assigned to the 474th Air Expeditionary Group at San Isidro Air Base, Dominican Republic in 2010.\nThe squadron was first activated during World War II as the 22d Air Corps Ferrying Squadron at Morrison Field, Florida in 1942.  In October 1943 the squadron and its parent group were disbanded and replaced as the Air Transport Command unit at Morrison by Station 11, Caribbean Wing, Air Transport Command.\nThe squadron was reconstituted in 1954 as the 22d Air Transport Squadron, Medium, a Douglas C-54 Skymaster unit, at Charleston Air Force Base, South Carolina. The squadron was inactivated in 1958.\nThe 922d Air Refueling Squadron operated Boeing KC-135 Stratotankers at Wright-Patterson Air Force Base, Ohio from 1959 to 1975, when its parent, the 17th Bombardment Wing moved to Beale Air Force Base, California.\nThe 922d was reactivated three years later as the 922d Strategic Squadron to control deployed Strategic Air Command (SAC) tanker and reconnaissance aircraft operating in the Mediterranean.  In September 1985, the 922d and 22d squadrons were consolidated into a single squadron.  When SAC inactivated in 1992, the squadron became a reconnaissance unit, operating Boeing RC-135s from RAF Mildenhall until 1994.\nThe 922d was converted to provisional status as the 922d Expeditionary Reconnaissance Squadron and assigned to Air Combat Command to activate or inactivate as needed.  In 2010 it was activated as part Operation Unified Response. the military response to the earthquake in Haiti.\nHistory\nAirlift operations\nThe squadron was first activated during World War II as the 22d Air Corps Ferrying Squadron at Morrison Field, Florida in 1942.  The squadron ferried aircraft between Florida and points in western Africa.  From 1943, the unit then focused on the air transportation mission as the 22d Transport Squadron.  Although the squadron was stationed at Morrison, its personnel were also used to man other stations of the Caribbean Wing.  After a little more than a year of trying to use traditional Table of Organization units like the 22d, Air Transport Command (ATC) found them too inflexible for its operations.  It, therefore, decided to replace its groups and squadrons and assign personnel directly to each of its stations, based on the needs of the station. Accordingly, in October 1943 the squadron and its parent group were disbanded as ATC combined its units at Morrison into Station 11, Caribbean Wing, Air Transport Command.\nThe squadron was reactivated in March 1954 at Charleston Air Force Base, South Carolina as the 22d Air Transport Squadron with the responsibility of transporting personnel, materiel, mail and other strategic cargo for the Army, Navy and civilian agencies. The squadron was assigned to the 1608th Air Transport Group, which had been activated two months earlier.  However, shortages of personnel and equipment delayed the group from reaching operational status upon activation. The squadron operated Douglas C-54 Skymaster aircraft until inactivating in March 1958.\nAir refueling operations\nThe 922d Air Refueling Squadron was activated on 1 September 1959 by Strategic Air Command (SAC) at Wright-Patterson Air Force Base, Ohio where it was assigned to the 4043d Strategic Wing and equipped with Boeing KC-135 Stratotankers.  The 4043d wing was established by SAC in a program to disperse its Boeing B-52 Stratofortress bombers over a larger number of bases, thus making it more difficult for the Soviet Union to knock out the entire fleet with a surprise first strike. SAC bases with large concentrations of bombers made attractive targets.  SAC's response was to break up its wings and scatter their aircraft over a larger number of bases.\nThe squadron provided air refueling support to the Boeing B-52 Stratofortress strategic bombers of its parent wing and other USAF units as directed.   Starting in 1960, one third of the squadron's aircraft were maintained on fifteen-minute alert, fully fueled and ready for combat to reduce vulnerability to a Soviet missile strike.  This was increased to half the squadron's aircraft in 1962.\nIn February 1963 The 17th Bombardment Wing assumed the aircraft, personnel and equipment of the discontinued 4043d wing. The 4043d was a Major Command controlled (MAJCON) wing, which could not carry a permanent history or lineage, and SAC wanted to replace it with a permanent unit.   The 922d was assigned to the newly activated 17th wing.\nThe squadron deployed aircraft and aircrews to the Western Pacific support combat operations of deployed SAC units and tactical aircraft over Indochina during the Vietnam War from 1965 to 1975.   In June 1975, its aircraft were taken off alert and the squadron phased down, and its aircraft were transferred elsewhere by 7 July. The squadron inactivated in September as SAC ended its operations at Wright-Patterson.\nControl of deployed forces\nThree years later the squadron was reactivated as the 922d Strategic Squadron at Hellenikon Air Base, near Athens, Greece.  It was assigned to the 306th Strategic Wing, which controlled SAC European operations from its station at Ramstein Air Base, Germany.  The squadron provided air refueling and reconnaissance support using aircraft and crews deployed from SAC bases in the United States. It supported USAFE and North Atlantic Treaty Organization exercises. After a period of heightened tensions and anti-American activity in Greece, the Greek government notified the United States that American bases in mainland Greece would be closed by 1990. With the closure of Hellenikon, the squadron moved to Souda Bay Naval Air Station on the Island of Crete. Two years later, in anticipation of the inactivation of SAC, the squadron moved to RAF Mildenhall. and managed deployed Boeing RC-135s from RAF Mildenhall as the 922d Reconnaissance Squadron until 1994.\nIn 2007, the squadron was assigned to Air Combat Command as a provisional unit to activate or inactivate as needed. In 2010, it was activated in the Dominican Republic for Operation Unified Response, responding to the earthquakes in Haiti on the western half of Hispaniola.\nLineage\n22d Air Transport Squadron\n* Constituted on 6 April 1942 as the 22d Air Corps Ferrying Squadron\n: Activated on 21 July 1942\n: Redesignated 22d Transport Squadron on 29 March 1943\n: Disbanded on 13 October 1943\n* Reconstituted on 27 November 1953 and redesignated 22d Air Transport Squadron, Medium\n: Activated on 8 March 1954\n: Inactivated on 18 March 1958\n: Consolidated with the 922d Strategic Squadron on 19 September 1985 as the 922d Strategic Squadron\n922d Expeditionary Reconnaissance Squadron\n* Constituted as the 922d Air Refueling Squadron, Heavy on 18 August 1959\n: Activated on 1 December 1959\n: Inactivated on 30 September 1975\n* Redesignated 922d Strategic Squadron on 13 June 1978\n: Activated on 1 July 1978\n: Consolidated with the 22d Air Transport Squadron on 19 September 1985\n: Redesignated 922d Reconnaissance Squadron on 31 March 1992\n: Inactivated on 30 June 1994.\n* Converted to provisional status and redesignated 922d Expeditionary Reconnaissance Flight on 5 October 2007\n* Redesignated 922d Expeditionary Reconnaissance Squadron\n: Activated for Operation Unified Response on 2 February 2010\n: Inactivated on 20 June 2010\nAssignments\n* 15th Ferrying Group (later 15th Transport Group): 21 July 1942 – 13 October 1943\n* 1608th Air Transport Group: 8 March 1954 – 18 March 1958\n* 4043d Strategic Wing: 1 December 1959\n* 17th Bombardment Wing: 1 February 1963 – 30 September 1975\n* 306th Strategic Wing: 1 July 1978\n* 55th Operations Group: 31 March 1992\n* 55th Wing: 1 June 1992\n* 55th Operations Group: 1 July 1992 –  30 June 1994\n* Air Combat Command to activate or inactivate as needed after 5 October 2007\n:: 474th Air Expeditionary Group: 2 February 2010 – 20 June 2010\nStations\n* Morrison Field, Florida, 3 April 1942 – 13 October 1943\n* Charleston Air Force Base, South Carolina, 8 March 1954 – 18 March 1958\n*  Wright-Patterson Air Force Base, Ohio, 1 December 1959 – 30 September 1975\n* Hellenikon Air Base, Greece, 1 July 1978\n* Souda Bay Naval Air Station, Greece, 15 April 1990\n* RAF Mildenhall, England, 31 March 1992 – 30 June 1994\n* San Isidro Air Base, Dominican Republic, 2 February 2010 – 20 June 2010\nAircraft\n* Douglas C-54 Skymaster, 1954–1958\n* Boeing KC-135 Stratotanker, 1959–1975, 1978–1992\n* Boeing RC-135, 1992–1994\nAwards and campaigns\n* Saunders Perpetual Trophy, SAC Combat Competition for best combined score in refueling and navigation: 1965\n{| class=\"wikitable\"\n|- style=\"background:#efefef;\"\n! Campaign Streamer\n! Campaign\n! Dates\n! Notes\n|-\n|\n|American Theater without inscription\n|3 April 1942 – 13 October 1943\n|22d Ferrying Squadron (later 22d Transport Squadron)\n|}\nSee also\n* Air Transport Command\n* List of United States Air Force air refueling squadrons\nReferences\nNotes\n; Explanatory notes\n; Citations\nBibliography\n*\n*\n*\n*\n*\nFurther reading\n*\n*\n* [http://www.usafpatches.com/pubs/AFP900-2Vol1Bk2.pdf AF Pamphlet 900–2, Unit Decorations, Awards and Campaign Participation Credits, Vol I, Book 2]  Department of the Air Force, Washington, DC, 15 Jun 1971 (Air Service, Air Corps, Army Air Forces and United States Air Force unit awards and campaign participation)\n* [http://www.usafpatches.com/pubs/AFP900-2Vol2.pdf AF Pamphlet 900–2, Unit Decorations, Awards and Campaign Participation Credits, Vol II]  Department of the Air Force, Washington, DC, 30 Sep 1976 (update of pamphlet for awards in late 1960s and early 1970s.)"
    }
  ]
}