{
  "content": [
    {
      "type": "text",
      "text": "# 93rd Brigade (United Kingdom)\n\n| branch = New Army\n| type = Infantry\n| role =\n| size = Brigade\n| command_structure =31st Division\n| garrison =\n| garrison_label =\n| nickname =\n| patron =\n| motto =\n| colors =\n| march =\n| mascot =\n| equipment =\n| battles =Battle of the SommeBattle of ArrasGerman spring offensiveHundred Days Offensive\n| anniversaries =\n| decorations =\n| battle_honours =\n}}\nThe 93rd Brigade was an infantry formation of  the British Army during World War I. It was raised as part of  'Kitchener's Army' and was assigned to the 31st Division. After the original formation was converted into a reserve brigade, the number was transferred to a brigade of  'Pals battalions' from Northern England. The brigade was sent to  Egypt at the end of 1915 but was recalled to France shortly afterwards and then served on the Western Front for the rest of the war. The brigade was shattered on the First day on the Somme, but later saw action at Arras, in the German spring offensive of 1918, and the final Hundred Days Offensive.\nOriginal 93rd Brigade\n's recruitment poster for Kitchener's Army.]]\nOn 6 August 1914, less than 48 hours after Britain's declaration of war, Parliament sanctioned an increase of 500,000 men for the Regular British Army. The newly appointed Secretary of State for War, Earl Kitchener of Khartoum, issued his famous call to arms: 'Your King and Country Need You', urging the first 100,000 volunteers to come forward. This group of six divisions with supporting arms became known as Kitchener's First New Army, or 'K1'. The K2 and K3 battalions, brigades and divisions followed soon afterwards. So far, the battalions had all been formed at the depots of their parent regiments, but recruits had also been flooding in to the Special Reserve (SR) battalions (the former Militia). These were deployed at their war stations in coastal defence where they were training and equipping reservists to provide reinforcement drafts to the Regular Army fighting overseas. The SR battalions were soon well above their establishment strength and on 8 October 1914 the War Office (WO) ordered each SR battalion to use the surplus to form a service battalion of the 4th New Army ('K4'). In November K4 battalions were organised into 18 brigades numbered  from 89 to 106 and formed into the 30th–35th Divisions.\nInitially, the K4 units remained in the coast defences alongside their parent SR battalions. On 5 November 1914 four K4 battalions in the Thames and Medway Garrison were ordered to be formed into 93rd Brigade in 31st Division:\n* 9th (Service) Battalion, Queen's (Royal West Surrey Regiment), formed at Gravesend\n* 9th (Service) Battalion, Queens Own (Royal West Kent Regiment), formed at Chatham\n* 14th (Service) Battalion, Middlesex Regiment, formed at Chatham\n* 15th (Service) Battalion, Middlesex Regiment, formed at Gillingham\nOn 1 December Brigadier-General W.H.H. Walters was appointed to command the brigade. The units began training for active service, but the lack of uniforms, weapons, equipment and instructors that had been experienced by the K1–K3 units was even greater for those of K4, and by April 1915 their training was still at an elementary stage. On 10 April 1915 the War Office decided to convert the K4 battalions into reserve units, to provide drafts for the K1–K3 battalions in the same way that the SR was doing for the Regular battalions. The K4 divisions were broken up and the brigades were renumbered: 93rd Brigade became 5th Reserve Brigade.\nNew 93rd Brigade\nMeanwhile, the K5 units had been forming since late 1914. These were largely raised by local initiative rather than at regimental depots, and were known as 'Pals battalions'. The first six K5 divisions (37–42) and their constituent brigades were given the numbers of the disbanded K4 formations on 27 April 1915. Thus 114th Brigade of 38th Division became the new 93rd Brigade in 31st Division:\n* 15th (Service) Battalion, West Yorkshire Regiment (1st Leeds) – raised by the Lord Mayor and City of Leeds 8 September 1914\n* 16th (Service) Battalion, West Yorkshire Regiment (1st Bradford) – raised by the Lord Mayor and City of Bradford 13 September 1914\n* 18th (Service) Battalion, West Yorkshire Regiment (2nd Bradford) – raised by the Lord Mayor and City of Bradford 22 January 1915\n* 18th (Service) Battalion, Durham Light Infantry (1st County) – raised at Durham by Colonel Rowland Burdon, 10 September 1914\nAt first the men lived at home and training was carried out at their home towns, hampered by an almost total lack of instructors and equipment. The 'Durham Pals' (18th DLI) were unusual in that the Earl of Durham placed Cockpen Hall at the battalion's disposal for training. On 16 November this battalion was ordered to send two companies to Hartlepool to assist in coast defence. They were manning trenches a month later when German warships carried out a Raid on Scarborough, Hartlepool and Whitby, and suffered casualties of 6 killed and 10 wounded – the first Kitchener battalion to come under enemy fire.\nThe division concentrated at South Camp, Ripon, in May 1915, soon after it was renumbered. In September it moved to Fovant where it carried out final intensive battle training on Salisbury Plain. On 29 November 1915 the division received warning orders to join the British Expeditionary Force in France, and advance parties set out for the embarkation ports of Folkestone and Southampton. At the last minute, the destination was changed to Egypt, the advance parties were recalled, and on 7 December the troops embarked at Devonport.\nThe division reached Port Said between 24 December and 23 January 1916 and went into the Suez Canal defences at Qantara. On 26 February orders arrived to reverse the process and on 1 March the division began re-embarking at Port Said. It unloaded at Marseille between 6 and 16 March and then concentrated in the Somme area as part of the BEF. It remained on the Western Front for the rest of the war.\nSoon after its arrival in France 93rd Brigade was joined by its support troops:\n* 93rd Trench Mortar Battery (TMB) – formed as 93/1 and 93/2 TMBs on 12 April, and combined into a single battery by 12 June\n* 93rd Brigade Machine Gun (MG) Company – formed at Grantham, disembarked at Le Havre on 17 May and joined on 20 May\nFirst day of the Somme\n31st Division was part of the concentration of troops in the Somme sector for that summer's 'Big Push' the Battle of the Somme. Despite all the preparation and high hopes, the First day on the Somme (1 July) was a disaster for 31st Division. Its task was to take the village of Serre and form a defensive flank for the rest of Fourth Army. 93rd Brigade was to attack up a re-entrant with 15th West Yorks leading, while 16th West Yorks and D Company of 18th DLI attacked Pendant Copse on the right. The troops left their trenches at 07.20 when the nearby Hawthorn Ridge mine was exploded, 10 minutes before Zero. Thus alerted, the enemy put down a heavy artillery barrage on the British line and their machine gun. teams came out of their dugouts. When the leading waves set off at 07.30, they were almost annihilated by German fire: 15th West Yorks lost nearly all their officers. The survivors of 15th West Yorks were pinned down in No man's land, while 16th West Yorks suffered heavily as they advanced from the support line, even before they crossed the front line. Nevertheless, some of the DLI got into Pendant Copse. 18th West Yorks in support was unable to make any headway across the fire-swept No man's land, and the rest of 18th DLI in reserve was kept back. About 09.00 the enemy opposite 93rd Bde appeared to be concentrating for a counter-attack on the chaotic British jumping-off trenches, and disregarding divisional orders Brig-Gen Ingles brought back the artillery barrage to disperse them. Most of the divisional pioneer battalion, the 12th King's Own Yorkshire Light Infantry (Leeds Miners), was brought up to support 93rd Bde. By noon the sector was quiet apart from occasional shelling and sniping at the men pinned down in No man's land; those Germans in front of 93rd Bde came out to clear the 15th West Yorks from their barbed wire. Although a fresh attack was ordered for the afternoon, the divisional commander and commanders of 93rd and 94th Bdes concluded that neither brigade was fit for any further offensive operation. 93rd Brigades's losses had been 598 killed, 1197 wounded and 28 missing, the 15th West Yorks alone losing 528. The men in No man's land slipped back after dark. Next day, as stretcher-bearers worked to remove casualties from No man's land, 18th DLI held the front line. The shattered division was then pulled out and sent north to a quiet sector for rest and refit.\nAncre\nThe Somme Offensive was still going on at the end of October when 31st Division returned to the sector for the Battle of the Ancre, which was to be the last big operation of the year. The division made another attempt to capture Serre on 13 November, but 93rd Bde was still not fit for active operations. Apart from its MG company, which supported the attack, its role was restricted to standing by to release a smokescreen, but  in the event the wind was unfavourable for this.\nIn late February 1917 the Germans began a withdrawal to the Hindenburg Line (Operation Alberich). They disappeared from the Ancre Front on 24 February and 31st Division was ordered to send out strong patrols next day to regain touch with them. On 26 February the division made the biggest advance in the sector, but next day 93rd Bde was checked at Rossignol Wood. When 16th West Yorks attacked the wood it was held up, those troops who reached the wood being shot down by enfilade machine gun fire. However, a two-man patrol from 18th DLI passed through Gommecourt Park (scene of bitter fighting on 1 July 1916) and found Gommecourt village entirely unoccupied; 93rd Bde handed this over to the neighbouring division. The division completed the capture of Rossignol Wood on 3–4 March.\n]]\nOppy Wood\nOn 8 April 1917, the division left the Ancre and moved to the Arras sector for the Arras Offensive. After a period of training and trench-holding, it moved into assembly trenches opposite Oppy during the night of 2/3 May, under shellfire. The British creeping barrage started at 03.45 and the 92nd and 93rd Brigades set off, in the dark and mist, into severe machine gun fire from Oppy Wood. 15th, 18th and 16th West Yorks (right to left) made good progress at first, some companies reaching their final objective. However, 92nd Bde on their left met with disaster and strong counter-attacks from this flank drove the three battalions back. The enemy even captured Gavrelle Windmill within the British lines, but were driven out by a skilful counter-attack by a company of 18th DLI. The Arras offensive petered out during May, but 18th DLI made a night attack from Gavrelle on 17/18 May. Advancing up the Douai road, the battalion failed to capture the enemy's frontline trench. (The Capture of Oppy Wood was not completed until 28 June, when 94th Bde took part in the operation.)\n31st Division was not committed to the Third Ypres Offensive, which culminated in the dreadful Battle of Passchendaele, possibly because it was not considered to have recovered from its ordeal on the Somme a year before.\nReorganisation\nBy the end of 1917 the BEF was suffering a severe manpower crisis. On 7 December the 1st Leeds Pals amalgamated with the 17th West Yorkshires (2nd Leeds) (a former 'Bantam battalion') from 35th Division. Then in February 1918 all brigades were reorganised on a three-battalion basis, with the surplus men being drafted to bring other units up to strength. 31st Division underwent a major reorganisation, which resulted in the two Bradford Pals battalions being disbanded. 15th/17th West Yorks received a draft of 3 officers and 132 other ranks from the 16th Bn, the remainder going to  No 3 Entrenching Bn, while 18th Bn was split among nine West York battalions and No 3 Entrenching Bn. They were replaced in 93rd Bde by the 1st Barnsley Pals from the disbanded 94th Bde (including a draft of 15 officers and 300 other ranks from the disbanded Sheffield City Battalion). The brigade MG companies were also concentrated into a divisional MG battalion. 93rd Brigade had the following organisation for the remainder of the war:\n* 15th/17th West Yorkshires (Leeds)\n* 13th York & Lancaster Regiment (1st Barnsley)\n* 18th Durham Light Infantry (1st County)\n* 93rd TMB\nSpring offensive\nWhen the German spring offensive opened on 21 March 1918, 31st Division was in First Army Reserve and was immediately sent to Third Army. On the night of 22/23 March it reinforced VI Corps and 93rd Bde went up to Boiry-Saint-Martin, south of Arras, where it carried out a partial relief of 34th Division. 34th Division had been forced back to the rear of its Battle Zone, but there was little activity on 23 March. Only two minor attacks were made on the extreme left in the morning and afternoon, and both were repulsed by 13th York & Lancasters (Y&L). Heavier fighting had been going on further south round Mory, and during the night of 23/24 March 93rd Bde sideslipped about  in that direction, taking up position in a 'switch' line north of the River Sensée. Here it was strongly attacked from about 07.00 to 12.00, though the Germans were enfiladed by the Guards Division to the north and were unable to make any progress. Another fierce attack came in. at 15.00, but this also broke down, although the rest of 31st Division further south was broken up into groups trying to form a defensive flank. Pressure continued in the south during 25 March, but an attack on 93rd Bde about 13.00 was broken up by artillery and no Germans got near the line. However, the German breakthrough to the south forced VI Corps to wheel 31st Division back to a new switch line that night. At daybreak on 26 March it was discovered that a  gap had opened up between 31st and Guards Divisions: 13th Y&L and 18th DLI of 93rd Bde, which should have occupied the space, had been ordered to fall back by a staff officer disorientated by the effects of a near-miss by a shell. The two missing battalions had gone back a further  to the Purple Line, and Moyenneville was left undefended. The Guards extended its right to cover part of the gap, and 15th/17th West Yorkshires held the left of 31st Division while the two battalions were recalled. Preceded by a reconnaissance party the two battalions tried to advance into the gap in daylight. However, the Germans had pushed into Moyenneville and occupied the ridge behind, their machine guns enfilading the 15th/17th West Yorks and forcing the 13th Y&L and 18th DLI to halt and dig in  short of the village. Instead of withdrawing, Lt-Col S.C. Taylor of 15th/17th West Yorks organised a counter-attack with his reserve, part moving north of Moyenneville and part against the ridge. The attack was entirely successful: the Germans were forced off the ridge and out of the village, and while retiring they were taken in flank by the party that had worked round to the north; numerous prisoners were  captured. Sergeant Albert Mountain of 15th/17th West Yorks was awarded the Victoria Cross for his services on this occasion. However, the Germans attacked the village again at 12.30 in greater strength and with artillery support. 15th/17th West Yorks fell back to the village edge. The battalion together with 13th Y&L was ordered to launch a counter-attack at 20.30, but Taylor requested a delay so that the exhausted West Yorks could rest. Fresh orders were given for 13th Y&L and 18th DLI to advance under cover of darkness and dig in as close to the village as possible. These orders arrived so late that dawn was breaking as the two battalions approached the village, and they fell back to their position of the previous morning. Meanwhile 15th/17th West Yorks reinforced by a company of 2nd Irish Guards clung on round the west of Moyenneville. From 11.00 on 27 March the Germans 'dribbled' infantry forward to maintain a continuous attack against 31st Division. Fighting with grenade and bayonet went on for over 5 hours until 92nd Bde withdrew in the evening mist. 93rd Brigade conformed, and though both were under fire for the first the retirement was made in good order through 4th Guards Bde. The 15th/17th West Yorks came out of action with a strength of just 4 officers and 40 men; the other two battalions went into the line alongside 4th Gds Bde, which was now well-entrenched. Three final attacks by the Germans next day (28 March) were repelled from these trenches with heavy casualties. Although fighting continued, the main weight of the German offensive had switched to the Arras sector, and 31st Division could be relieved during the nights of 30/31 March and 31 March/1 April. Brigadier-Gen Ingles had been evacuated sick on 27 March, and after a few days Lt-Col Taylor of 15th/17th West Yorks was promoted to succeed him in command of 93rd Bde.\n31st Division was then sent north to the quiet sector behind First Army where it went into reserve. It received large numbers of reinforcements, but these were mainly CategoryA4: under the age of 19 who would not previously have been eligible for active service. However, the rest was brief: the second phase of the he German offensive (the Battles of the Lys) was about to open against First Army. The bombardment opened on 7 April, and on 11 April the division was called forward in ex-London buses to form a defensive line near Estaires through which retreating British and Portuguese troops could withdraw. 93rd Brigade was ordered forward from its position at Outtersteene to support 40th Division, but patrols brought back word that the enemy had penetrated 40th Division's thin line and were at La Becque. 93rd Brigade's orders were cancelled, and it was instead ordered to counter-attack La Becque. Although the brigade was supported by one and a half companies of 31st MG Bn there was virtually no artillery available, so it was decided to dispense with any artillery preparation and deliver a surprise attack. Delivered at dusk (19.00) this was entirely successful, not only recapturing La Becque but regaining 40th Division's line and re-establishing touch with the remainder of 40th Division on one flank and 74th Bde on the other. 92nd Brigade, which had been forming a defensive flank, then swung back and relieved the remnant of 40th Division. 93rd Brigade then completed the line at 01.30 next morning by bringing up its reserve (15th/17th West Yorks) to cover the junction with 74th Bde. Next day the adjacent formations were able to pivot back on the two firmly established brigades of 31st Division, while  the Germans threw in all their reserves to try to take Hazebrouck. However, between 07.00 and 08.00, the Germans penetrated between 92nd and 93rd Bdes and inflicted heavy casualties with enfilade fire. About 12.00, after suffering considerable casualties, the brigades began a slow withdrawal from one hedge to the next. As they fell back towards Merris a  gap opened up on their left flank. Luckily, 33rd Division was able to fill the gap, mainly with machine gunners, pioneers, engineers and cyclists. Next day (13 April) a mixed force covered Hazebrouck, with 93rd Bde in reserve at Méteren, apart from a composite battalion of  'details' (support troops such as transport) reinforcing 92nd Bde. Although weak, these troops covered the detrainment at Hazebrouck of 1st Australian Division, who took over the line and drove back the enemy attacks on 14 April.\nBy now 31st was one of the weakest divisions in the BEF. On 16 April 92nd and 93rd Bdes were temporarily amalgamated as '92nd Composite Bde' under the command of Brig-Gen O. de L. Williams of 92nd Bde:\n* 92nd Composite Bn: 10th and 11th East Yorkshire Regiment\n* 93rd Composite Bn: 15th/17th West Yorks and 18th DLI\n* 94th Composite Bn: 11th East Lancashire Regiment and 13th Y&L\nHowever, the brigades and battalions resumed their separate identities on 18 April, before going back into the line alongside the Australians. 31st Division was scheduled to be reduced to a cadre and its units broken up to provide reinforcements to others, but in the end this was not done and it remained in reserve. Over the following weeks it received reinforcements (though many were under 19), and it began to take its turn holding the line, in front of the Forêt de Nieppe, facing La Becque farm.\nLa Becque\nIn May and June the brigades took turns out of the line training for offensive operations. 31st and 5th Divisions took part in Operation Borderland, a limited attack on La Becque and other fortified farms in front of the Forest of Nieppe on 28 June, in what was described as 'a model operation' for artillery cooperation. The forest screened the assembly of troops and material, and the artillery fired practice barrages each morning to mislead the enemy. 13th York & Lancasters used the cover of the forest to seize Ankle Farm on the night of 26/27 June. Then on 28 June they and 18th DLI held the line while 15th/17th attacked on a frontage of one company. There was no preliminary bombardment, and the creeping barrage started at the same time as the infantry at 06.00, then moved forward at a rate of  every four minutes while the Australians fired a smoke barrage and raided the enemy. The creeping barrage was so good and the infantry followed it so closely that they were among the Germans before they could open fire. The German positions were taken with only light casualties and quickly consolidated, and there were no organised counter-attacks.\nIndividual units continued to make small advances through aggressive patrolling and seizing strongpoints (so-called 'peaceful penetration') and this accelerated when the Allies launched a coordinated offensive on 8 August. The division captured Vieux-Berquin on 13 August 1918 and pushed forward until running into serious opposition south of Ploegsteert on 21 August, where fighting continued into September.\nHundred Days Offensive\nSecond Army carried out a formal attack on the morning of 28 September (the Fifth Battle of Ypres) and 31st Division was ordered to watch for opportunities and take advantage of enemy weakening. At 11.00 92nd Bde with 18th DLI from 93rd Bde were ordered to make an attack at 15.00. Although there was no surprise and considerable enemy shelling of the back areas, the operation went well. The rest of 93rd Bde was then ordered to cross the Douve stream accompanied by artillery and engineers. With the onset of darkness and the congestion. of the roads, the advanced guard only reached the starting point at 21.00, and the main body at 10.30. As it came over Hill63 the brigade came under heavy and accurate shellfire and had to open out. After a halt of about an hour, it resumed its advance and met no opposition for . It then met Germans rearguards at Ash Crater and its advance was slowed by machine gun fire, but after a little resistance in some pillboxes the enemy withdrew methodically. In the darkness the leading battalion found itself advancing with German units about  away on both flanks, marching in the same direction. The brigade was halted on the Warneton–Comines road at about 05.00 on 29 September. Its other battalion with 92nd Bde pushed on through Ploegsteert Wood. In the afternoon 31st Division was ordered to move up to the line of the River Lys, but 93rd Bde was judged to be too tired after its night march and the advance was carried out next day, almost unopposed. By the end of 2 October the division was along the Lys and preparing to bridge the river.\nPatrols from 92nd Bde slipped across the Lys on a raft during the night of 14/15 October and established posts on the far bank. The division crossed behind them and continued the advance from 16 October, facing no opposition until the morning of 19 October, when 92nd and 93rd Bdes met slight resistance at Toufflers. By the end of the day 93rd Bde was on the Tournai–Mouscron railway, with scouts well out in front, and in touch with Fifth Army to the south. After some confusion, 93rd Bde set up a combined post with 176th Bde of Fifth Army at Pecq on 21 October, then on 22 October the brigade advanced towards the River Schelde while the rest of 31st Division was squeezed out between the two converging armies.\nThe division was back in the advance from 27 October, with 92nd and then 94th (Yeomanry) Bdes leading. It made an attack at Tieghem on 31 October 1918 in which 94th (Y) Bde was so successful that the other brigades in reserve were not required. By now the enemy were back behind the Shelde and 31st Division was withdrawn into reserve.\nThe division returned to the line on the night of 6/7 November. On 8 November Second Army issued orders for forcing a passage of the Schelde on 11 November. However, the Germans began to pull out on 8 November and by dawn British patrols had established posts across the river. Once the engineers had bridged the river, the pursuit began, with 92nd Bde leading for 31st Division. When the Armistice with Germany came into force on 11 November, scouts reported that there were no enemy in front.\nDisbandment\nThe division began to pull back on 13 November, and by the end of the month was established in camps south of St-Omer and engaged in road repair. Demobilisation (chiefly of coal miners) began on 11 December and proceeded at a steadily increasing rate during early 1919. By April the battalions had been reduced to cadres.The division ceased to exist on 20 May and the cadres left for England on 22 May.\nDuring the war the division's casualties amounted to 30,091 killed, wounded, and missing, of which the battalions of 93rd Bde had suffered the following fatal casualties (other ranks only):\n* 15th West Yorks: 582 (to February 1918)\n* 15th/17th West Yorks: 345 (from February 1918)\n* 16th West Yorks: 452\n* 18th West Yorks: 376\n* 13th Y&L: 475 (including service with 94th Bde)\n* 18th DLI: 525\n93rd Brigade was not reformed in World War II.\nCommanders\nThe following commanded 93rd Bde:\n* Brigadier-General W.H.H. Waters, appointed to original 93rd Bde 28 November 1914\n* Brig-Gen E.H. Molesworth, appointed to 114th Bde 17 December 1914\n* Brig-Gen H.B. Kirk, from 8 October 1915, sick 4 May 1916, died 12 May 1916\n* Lt-Col H. Bowes, acting from 5 May 1916\n* Brig-Gen J.D. Ingles, from 17 May 1916, sick 27 March 1918\n* Lt-Col C.H. Gurney, acting 27 March 1918\n* Lt-Col R.D. Temple, acting from 27 March 1918\n* Brig-Gen S.C. Taylor, from 5 April 1918, wounded 1 October 1918, died 11 October 1918\n* Lt-Col A.V. Nutt, acting 1 October 1918\n* Lt-Col A.W. Rickman, acting from 1 October 1918\n* Brig-Gen G.B.F. Smyth, from 4 October 1918 to Armistice\nInsignia\nThe first pattern of formation sign worn by 31st Division is shown above. In 1917 it adopted a new sign incorporating the Red Rose of Lancaster and the White Rose of York with green stems on a black background. In 93rd Bde, composed primarily of West Yorkshire battalions, the white rose overlapped the red. The division also employed a system of 'battle patches' to identify brigades and units. In 1917 the sign for 93rd Bde was a diagonally bisected square, red to the left above white, worn by all ranks on the back, just below the collar. The infantry of 93rd Bdes wore red bars at the top of both sleeves to indicate the seniority of their battalion: one bar for 15th West Yorks, two for 16th and three for 18th; the 18th DLI wore a single red bar on a horizontal rectangle of regimental green. 93rd MG Company wore a blue diagonal cross; no recorded information has been found on the symbol worn by 93rd TMB.\nNotes\nReferences\n* Maj A.F. Becke,History of the Great War: Order of Battle of Divisions, Part 3a: New Army Divisions (9–26), London: HM Stationery Office, 1938/Uckfield: Naval & Military Press, 2007, ISBN 1-847347-41-X.\n* Maj A.F. Becke,History of the Great War: Order of Battle of Divisions, Part 3b: New Army Divisions (30–41) and 63rd (R.N.) Division, London: HM Stationery Office, 1939/Uckfield: Naval & Military Press, 2007, ISBN 1-847347-41-X.\n* David Bilton, Hull Pals, 10th, 11th 12th and 13th Battalions East Yorkshire Regiment – A History of 92 Infantry Brigade, 31st Division, Barnsley: Pen & Sword, 2014, ISBN 978-1-78346-185-1.\n* Jon Cooksey, Barnsley Pals: The 13th and 14th Battalions York and Lancaster Regiment, 6th Edn, Barnsley: Pen & Sword, 2016, ISBN 978-1-47389-198-2.\n* Brig-Gen Sir James E. Edmonds, History of the Great War: Military Operations, France and Belgium, 1916, Vol I, London: Macmillan,1932/Woking: Shearer, 1986, ISBN 0-946998-02-7/Uckfield: Naval & Military Press, 2021, ISBN 978-1-78331-615-1.\n* Brig-Gen Sir James E. Edmonds, History of the Great War: Military Operations, France and Belgium 1917, Vol II, Messines and Third Ypres (Passchendaele), London: HM Stationery Office, 1948/Uckfield: Imperial War Museum and Naval and Military Press, 2009, ISBN 978-1-845747-23-7.\n* Brig-Gen Sir James E. Edmonds, History of the Great War: Military Operations, France and Belgium 1918, Vol I, The German March Offensive and its Preliminaries, London: Macmillan, 1935/Imperial War Museum and Battery Press, 1995, ISBN 0-89839-219-5/Uckfield: Naval & Military Press, 2009, ISBN 978-1-84574-725-1.\n* Brig-Gen Sir James E. Edmonds, History of the Great War: Military Operations, France and Belgium 1918, Vol II, March–April: Continuation of the German Offensives, London: Macmillan, 1937/Imperial War Museum and Battery Press, 1995, ISBN 1-87042394-1/Uckfield: Naval & Military Press, 2009, ISBN 978-1-84574-726-8.\n* Brig-Gen Sir James E. Edmonds, History of the Great War: Military Operations, France and Belgium 1918, Vol III, May–July: The German Diversion Offensives and the First Allied Counter-Offensive, London: Macmillan, 1939/Imperial War Museum and Battery Press, 1994, ISBN 0-89839-211-X/Uckfield: Naval & Military Press, 2009, ISBN 978-1-84574-727-5.\n* Brig-Gen Sir James E. Edmonds & Lt-Col R. Maxwell-Hyslop, History of the Great War: Military Operations, France and Belgium 1918, Vol V, 26th September–11th November, The Advance to Victory, London: HM Stationery Office, 1947/Imperial War Museum and Battery Press, 1993, ISBN 1-870423-06-2/Uckfield: Naval & Military Press, 2021, ISBN 978-1-78331-624-3.\n* Clive Elderton & Gary Gibbs, World War One British Army Corps and Divisional Signs, Wokingham: Military History Society, 2018.\n* Capt Cyril Falls, History of the Great War: Military Operations, France and Belgium 1917, Vol I, The German Retreat to the Hindenburg Line and the Battle of Arras, London: Macmillan, 1940/London: Imperial War Museum & Battery Press/Uckfield: Naval and Military Press, 2009, ISBN 978-1-84574-722-0.\n* Gen Sir Martin Farndale, History of the Royal Regiment of Artillery: Western Front 1914–18, Woolwich: Royal Artillery Institution, 1986, ISBN 1-870114-00-0.\n* Mike Hibberd, Infantry Divisions, Identification Schemes 1917, Wokingham: Military History Society, 2016.\n* Jack Horsfall & Nigel Cave, Battleground Europe: Somme: Serre, London: Leo Cooper, 1996, ISBN 0-85052-508-X.\n* Brig E.A. James, British Regiments 1914–18, London: Samson Books, 1978, ISBN 0-906304-03-2/Uckfield: Naval & Military Press, 2001, ISBN 978-1-84342-197-9.\n* Lt-Col H.F. Joslen, Orders of Battle, United Kingdom and Colonial Formations and Units in the Second World War, 1939–1945, London: HM Stationery Office, 1960/London: London Stamp Exchange, 1990, ISBN 0-948130-03-2/Uckfield: Naval & Military Press, 2003, ISBN 1-843424-74-6.\n* Peter Liddle (ed), Passchendaele in Perspective: The Third Battle of Ypres, London: Leo Cooper, 1997, ISBN 0-85052-552-7.\n* Martin Middlebrook, The First Day on the Somme, 1 July 1916, London: Allen Lane 1971/Fontana, 1975, ISBN 0-00-633626-4.\n* Capt Wilfred Miles, History of the Great War: Military Operations, France and Belgium 1916, Vol II, 2nd July 1916 to the End of the Battles of the Somme, London: Macmillan, 1938/Imperial War Museum & Battery Press, 1992, ISBN 0-89839-169-5/Uckfield: Naval & Military Press, 2005, ISBN 978-1-84574-721-3.\n* Instructions Issued by The War Office During August 1914, London: HM Stationery Office, 1916.\n* Instructions Issued by The War Office During April 1915, London: HM Stationery Office.\n* Instructions Issued by The War Office During September 1915, London: HM Stationery Office.\nExternal sources\n* [http://www.longlongtrail.co.uk Chris Baker, The Long, Long Trail]"
    }
  ]
}