{
  "content": [
    {
      "type": "text",
      "text": "# 99 Songs of Revolution: Vol. 1\n\n| recorded   =\n| venue      =\n| studio     =\n| genre      = Ska punk\n| length     = 32:56\n| label      = Victory, Pentimento\n| producer   =\n| prev_title = Somewhere in the Between\n| prev_year  = 2007\n| next_title = The Hands That Thieve\n| next_year  = 2013\n}}\n|rev2=Alternative Press\n|rev2score=\n|rev3 = Punknews.org\n|rev3score =\n}}\n99 Songs of Revolution: Vol. 1 is the fourth studio album by the American ska punk band Streetlight Manifesto, released March 16, 2010. It was proposed to be the first part of a multi-album cover songs project by several associated acts including Bandits of the Acoustic Revolution, although no other parts have been released as of 2025.\nBackground\n99 Songs of Revolution was originally thought to be only a Bandits of the Acoustic Revolution release, as stated in the liner notes for their debut 2001 EP, A Call to Arms. Not much was known about the project until September 2008, when the project was officially and publicly announced. It was revealed that 99 Songs of Revolution would feature 99 cover songs spread out over eight full-length albums from four different artists. The plan was for each of the four bands, Bandits of the Acoustic Revolution, Streetlight Manifesto and two currently unknown \"Streetlight Manifesto related\" artists, to release two albums in the series.\nComposition\nVolume one features two songs written by Paul Simon, \"Me and Julio Down by the Schoolyard\" and \"Red Rubber Ball\".  \"Red Rubber Ball\" was originally released by The Cyrkle in 1966.\nThe album art contains a visual element for each track. For example, the Newsweek stand is a reference to a lyric in \"Me and Julio Down by the Schoolyard\" and the gravestone marked \"Willie\" is a reference to the antagonist in \"The Troubadour\".\nRelease\nThe project saw many tentative release dates in 2008 and 2009. Toward the end of 2009, Streetlight Manifesto announced that the first CD had been completed as was awaiting release from the record label. The band also hinted at the possibility of self-releasing the album on vinyl through the Pentimento Music Company \"long before\" their label could release it on CD. Also in late 2009, Streetlight Manifesto began previewing their songs from 99 Songs of Revolution on their website and during live performances. On February 8, 2010, 99 Songs of Revolution: Vol. 1 was announced for release the following month. On February 17, 2010, the album's track listing was posted online. It was released on March 16, 2010, through Victory Records. \"Me and Julio Down by the Schoolyard\" was released as a single a week prior to the first volume's release.\nBetween June and August 2010, the band went on a headlining US tour with support from the Wonder Years, Dan Potthast of MU330 and Crime in Stereo. Following this, they performed at the Reading and Leeds Festivals in the UK.\nTrack listing\n| extra3 = Radiohead\n| length3 = 3:00\n| title4 = Skyscraper\n| writer4 = Brett W. Gurewitz\n| extra4 = Bad Religion\n| length4 = 2:40\n| title5 = Punk Rock Girl\n| writer5 =\n| extra5 = The Dead Milkmen\n| length5 = 2:17\n| title6 = Linoleum\n| writer6 = Michael John Burkett\n| extra6 = NOFX\n| length6 = 2:44\n| title7 = Me and Julio Down by the Schoolyard\n| writer7 = Paul Simon\n| extra7 = Paul Simon\n| length7 = 2:27\n| title8 = They Provide the Paint for the Picture-Perfect Masterpiece That You Will Paint on the Insides of Your Eyelids\n| writer8 = Tomas Kalnoky\n| extra8 = Bandits of the Acoustic Revolution\n| length8 = 3:33\n| title9 = Red Rubber Ball\n| writer9 =\n| extra9 = Paul Simon, based on The Cyrkle's version\n| length9 = 2:49\n| title10 = The Troubadour\n| writer10 =\n| extra10 = Louis Jordan\n| length10 = 3:33\n| title11 = Such Great Heights\n| writer11 =\n| extra11 = The Postal Service\n| length11 = 3:30\n|total_length = 32:56\n}}\nPersonnel\nStreetlight Manifesto\n* Mike Brown&nbsp;– alto saxophone, baritone saxophone, backing vocals\n* Jim Conti&nbsp;– alto saxophone, tenor saxophone, backing vocals, clarinet\n* Tomas Kalnoky&nbsp;– vocals, guitar, ukulele, recording engineer, mixing engineer\n* Pete McCullough&nbsp;– bass guitar, backing vocals\n* Mike Soprano&nbsp;– trombone, backing vocals\n* Matt Stewart&nbsp;– trumpet, backing vocals\n* Chris Thatcher&nbsp;– drums\nAdditional Musicians and Production\n* Achilles Kalnoky&nbsp;– violin\n* Doug Holzapfel&nbsp;– organ\n* Dave Fowler&nbsp;– organ\n* Demian Arriaga&nbsp;– auxiliary percussion\n* Dan Potthast&nbsp;– gang vocals\n* Lance Reynolds&nbsp;– gang vocals\n* Jason Kanter&nbsp;– mixing engineer\n* Alan Douches&nbsp;– mastering engineer\nChart performance\n{|class=\"wikitable sortable\"\n!Chart (2010)\n!Peakposition\n|-\n| US Billboard 200\n| align=\"center\"| 140\n|-\n| US Billboard Heatseekers Albums\n| align=\"center\"| 4\n|-\n| US Billboard Independent Albums\n| align=\"center\"| 16\n|-\n| US Billboard Rock Albums\n| align=\"center\"| 44\n|-\n|}\nReferences\nExternal links\n*[https://www.youtube.com/playlist?list=PL8_OaZ9dAao4M32REoaQ8AiZkhma9aViS 99 Songs of Revolution: Vol. 1] at YouTube (streamed copy where licensed)\n* [http://www.streetlightmanifesto.com Official Streetlight Manifesto website]"
    }
  ]
}