{
  "content": [
    {
      "type": "text",
      "text": "# 9th century in architecture\n\nBuildings and structures\nBuildings\n]]\n* about 800 &ndash; Borobudur temple in Java completed.\n* 802\n** Haeinsa of Korea, is constructed.\n** Palace of Charlemagne in Aachen, Carolingian Empire completed (begun about 790). The Palatine Chapel still stands.\n** At Oviedo in the Kingdom of Asturias\n*** Cámara Santa constructed.\n*** First reconstruction of Oviedo Cathedral begun by Tioda.\n* 815 &ndash; Second Temple of Somnath built in the Pratihara Empire, India.\n* 816 &ndash; Reims Cathedral begun.\n* 810s &ndash; Chapel of San Zeno in Santa Prassede, Rome decorated.\n* 818 &ndash; Old Cologne Cathedral built.\n* 820s\n** Imperial Abbey of Corvey on the Weser founded.\n** Fontanella Abbey reconstructed.\n* 827 &ndash; Mosque of Amr ibn al-As in Fustat, Egypt reaches its final form.\n* c. 830&ndash;842 &ndash; Construction of basilica church of San Julián de los Prados in Oviedo, Kingdom of Asturias, designed by Tioda.\n* 836\n** Samarra founded in Mesopotamia as the capital of the Abbasid Caliphate.\n** Great Mosque of Kairouan founded in Aghlabid Tunisia.\n* 838 &ndash; Jawsaq Khakani Palace built in Samarra.\n* 840s &ndash; Santa María del Naranco Hall, San Miguel de Lillo constructed.\n* 840 &ndash; The main pagoda of the Three Pagodas in Dali, Yunnan, China is built.\n* c. 842 &ndash; San Miguel de Lillo in Oviedo, Kingdom of Asturias is built.\n* 847 &ndash; St. Peter's Basilica and Basilica of Saint Paul Outside the Walls in Rome partly rebuilt.\nin Oviedo, Spain]]\n* 848\n** First enlargement of the Great Mosque of Cordoba, in the Emirate of Cordoba finished (begun in 832).\n** Santa María del Naranco built in Oviedo as part of a palace complex of Ramiro I King of Asturias\n* c. 850 &ndash; Prambanan Temple built in Java.\n* 851 &ndash; Great Mosque of Sousse built in Aghlabid Tunisia.\n* 852\n** Great Mosque of Samarra and Malwiya Minaret completed (begun in 848).\n** Hildesheim Cathedral begun.\n* c. 854 &ndash; Balkuwara Palace of Caliph Al-Mutawakkil built in Samarra.\n* 855 &ndash; Construction of the second Würzburg Cathedral (building no longer existing).\n* 858 &ndash; Invading Vikings set fire to the earliest church on the site of Chartres Cathedral, necessitating its reconstruction.\n* 859 &ndash; Halberstadt Cathedral constructed.\n* 861 &ndash; Abu Dolaf Mosque built in Samarra (begun in 859).\n* 862 &ndash; Reims Cathedral constructed.\n* 864 &ndash; Cathedral of Santa Maria Assunta on Torcello partly rebuilt.\n* 869 &ndash; City walls of Dijon, Le Mans and Tours reconstructed.\n* c. 870 &ndash; Church of St. Apostles Peter and Paul in Serbia is reconstructed.\n* 873 &ndash; Imperial Abbey of Corvey begun; church westwork completed c. 885.\n* 875 &ndash; Great Mosque of Kairouan in Aghlabid Tunisia reaches its current aspect.\n* c. 875 &ndash; The Great Basilica of Pliska, capital of the First Bulgarian Empire is finished.\n* 879\n** Mosque of Ibn Tulun, Fustat, Tulunid Egypt finished (begun in 876; consecrated 884).\n** Preah Ko, first temple built in the Khmer Empire capital of Hariharalaya.\nin Iran built in 880.]]\n* 880\n** The oldest Islamic contraction in Iran, the Tarikhaneh Temple (mosque) in Damghan, is built.\n** Nea Ekklesia church in Constantinople consecrated.\n* 881 &ndash; Bakong, first temple mountain built in Hariharalaya.\n* c. 883&ndash;902 &ndash; Shankaragaurishvara Temple in Kashmir built.\n* 885 &ndash; Chausath Yogini temple is built in Khajuraho, Chandela kingdom.\n* After 887 &ndash; St Mark's Campanile in Venice begun as a watch tower.\n* 893 &ndash; Lolei temple in Hariharalaya built.\n* 897 &ndash; Reconstruction of Nantes Cathedral begun.\n* 9th century\n** Basilica of Sant'Ambrogio in Milan &ndash; the right bell-tower; known as \"dei Monaci\" (\"bell tower of the monks\"), is constructed.\n** Derawar Fort in Bahawalpur, Punjab built.\n** Banyunibo Buddhist temple in Java is constructed.\n** Church of Holy Trinity, Split () in Split, Croatia.\n** Church of the Holy Cross, Nin () in Nin, Croatia.\n** Fortified Church of the Saintes Maries de la Mer in Provence.\n* Late 9th century &ndash; La Foncalada fountain in Oviedo, Asturias constructed.\nDeaths\n* 814 &ndash; Odo of Metz, Carolingian architect (born 742)\nSee also\n*8th century in architecture\n*10th century in architecture\n*Timeline of architecture\nReferences"
    }
  ]
}