{
  "content": [
    {
      "type": "text",
      "text": "# 9th century in England\n\nEvents from the 9th century in England.\nEvents\n* 801\n**Northumbrian invasion of Mercia fails.\n* 802\n** Ecgberht becomes King of Wessex following the death of Beorhtric.\n* 803\n**Council of Clofeshoh abolishes the Archbishopric of Lichfield.\n* 805\n** 12 May – death of Æthelhard, Archbishop of Canterbury.\n** 3 August – enthronement of Wulfred as Archbishop of Canterbury.\n* 806\n** Eardwulf of Northumbria is deposed and apparently succeeded by Ælfwald II. In 808 Eardwulf perhaps returns to the throne for an uncertain period.\n* 815\n** Ecgberht of Wessex harries Cornwall.\n* 816\n** Saxons invade the mountains of Eryri and the kingdom of Rhufoniog.\n* 818\n** King Coenwulf of Mercia devastates Dyfed.\n* 821\n** Wulfred, Archbishop of Canterbury, submits to Coenwulf of Mercia in a dispute over Church lands.\n** King Coenwulf of Mercia dies at Basingwerk near Holywell, Flintshire, probably while preparing a campaign against the Welsh. Succession is disputed.\n* 822\n** Mercian army under Ceolwulf destroys the fortress of Degannwy and takes control of Powys.\n** 17 September – Ceolwulf I of Mercia is consecrated as successor to his brother King Coenwulf by Archbishop Wulfred of Canterbury.\n* 823\n** After 26 May – Ceolwulf I of Mercia is overthrown as king by Beornwulf, whose pedigree is not known.\n* 825\n** September – Battle of Ellendun (on the North Wessex Downs): Ecgberht, King of Wessex, defeats the Mercians under Beornwulf, and subdues Essex, Sussex, and Kent, ending the Mercian Supremacy.\n** A fight of Welsh/Britons and Devon-men at Gafulford in the south-west.\n* 825&ndash;827\n** Æthelwulf, son of Ecgberht of Wessex, drives Baldred from his Kingdom of Kent, which Æthelwulf then rules as sub-king to his father.\n* 826\n** After 27 March – Beornwulf of Mercia is killed in battle while attempting to suppress a rebellion by the East Angles and is succeeded by Ludeca.\n* 827\n** Wiglaf becomes King of Mercia for the first time following the killing of Ludeca on a campaign against the East Angles.\n* 829\n** Ecgberht of Wessex temporarily conquers Mercia, driving Wiglaf from his throne there, and receives the submission of the Northumbrian king at Dore.\n* 830\n** Wiglaf of Mercia resumes his throne.\n** Nennius completes his Historia Brittonum.\n* 832\n** 24 March – death of Wulfred, Archbishop of Canterbury.\n** 9 June – consecration of Feologild as Archbishop of Canterbury.\n** 30 August – death of Feologild.\n* 833\n** 27 August – consecration of Ceolnoth as Archbishop of Canterbury.\n* 835\n** Vikings raid Sheppey.\n* 838\n** Battle of Hingston Down: Ecgberht of Wessex defeats combined Danish Viking and Cornish armies.\n* 839\n** King Wiglaf of Mercia dies and is succeeded, probably in 840, by Beorhtwulf.\n** Ecgberht, King of Wessex, dies and is succeeded by his son Æthelwulf.\n* 841\n** Vikings raid the south and east coasts, including the Kingdom of Lindsey.\n* 842\n** Vikings raid London, Rochester, and Southampton.\n* 844\n** Approximate date of Battle of Cetyll in which Beorhtwulf of Mercia defeats Merfyn Frych, King of Gwynedd.\n* 849\n**Alfred, son of Æthelwulf of Wessex and Queen Osburh, is born at Wantage.\n* 851\n** Kentish ships defeat Vikings off Sandwich in the first recorded naval battle in English history.\n** Vikings over-winter in England for the first time, on the Isle of Thanet.\n* 852\n** Swithun becomes Bishop of Winchester.\n** Probable death of King Beorhtwulf of Mercia.\n* 853\n** King Æthelwulf sends his son Alfred to the papal court in Rome.\n* 855\n** King Æthelwulf, accompanied by Alfred, sets off on a pilgrimage to Rome and appoints his second son Æthelbald as King of Wessex and his next eldest son Æthelberht as ruler of the Kingdom of Kent in his absence.\n* 856\n** 1 October – King Æthelwulf marries as his second wife the teenage Judith of Flanders at Verberie and she is crowned queen of Wessex. He returns to Wessex but Æthelbald retains rule of part of the kingdom.\n* 858\n** 13 January – Æthelbald succeeds his father Æthelwulf as King of Wessex and marries his father's widow.\n* 860\n** 20 December – Æthelbald dies and is succeeded by his brother, sub-king Æthelberht of Kent, who becomes sole ruler of Wessex.\n* 865\n** Autumn\n*** Æthelberht dies and Æthelred becomes King of Wessex.\n*** The Great Heathen Army (micel here) of Viking invaders lands in East Anglia.\n* 866\n** November – Vikings led by Ivar the Boneless capture York.\n* 867\n** 21 March – Vikings defeat Northumbrians, killing their kings Osberht and Ælla, in battle at York and install a puppet ruler, Ecgberht.\n* 869\n** Vikings led by Ivar the Boneless, 'make peace' with the Mercians (by  accepting Danegeld). Ivar leaves Nottingham on horseback, and returns to York.\n** Autumn – The Great Heathen Army, led by Ivar the Boneless and Ubba, invades the Kingdom of East Anglia and plunders Peterborough. The Vikings take up winter quarters at Thetford.\n** 20 November –  Vikings conquer East Anglia, killing King Edmund the Martyr.\n* 870\n** Vikings capture Reading.\n** 4 February – death of Ceolnoth, Archbishop of Canterbury. He is succeeded by Æthelred.\n* 871\n** The English retreat onto the Berkshire Downs. The Great Heathen Army, led by the Danish Viking kings Halfdan Ragnarsson and Bagsecg, march out after the Saxons. Six pitched battles are fought between the Vikings and Wessex. Of two of them the place and date are not recorded, the others are given here:\n** 4 January – Battle of Reading: A West Saxon force, under the command of King Æthelred I and his brother Alfred, is defeated by the Vikings at Reading. Among the many dead on both sides is Æthelwulf of Berkshire. The Saxon troops are forced to retreat, allowing the Vikings to continue their advance into Wessex.\n** 8 January – Battle of Ashdown: The West Saxons, led by Æthelred I and Alfred, gather on the Berkshire Downs. The Vikings under the command of Halfdan and Bagsecg occupy the high ground, but are successfully attacked by Alfred's men. During the battle Alfred breaches the shield wall formation.\n** 22 January – Battle of Basing: The West Saxon army, under the command of Æthelred I, is defeated at Basing; the Vikings, led by Halfdan, are victorious; Æthelred is forced to flee and regroup, leaving behind precious winter supplies.\n** 22 March – Battle of Meretum: The West Saxons, led by Æthelred I and Alfred, are defeated by the Vikings under Halfdan, perhaps near Wilton, Wiltshire. Among the many dead is Heahmund, bishop of Salisbury.\n** 23 April – King Æthelred of Wessex dies and is succeeded by his brother Alfred the Great. Æthelred is buried at Wimborne Minster; while Alfred is making the funeral preparations, his army is again defeated.\n** May – Battle of Wilton: Alfred the Great is defeated by the Vikings at Wilton (along the southern side of the River Wylye), and is forced to makes peace with them, probably paying them Danegeld, and establishes his capital at Winchester.\n** Autumn – Vikings withdraw from Reading and sail down the River Thames to raid the Mercian port of Lundenwic (modern-day London) and overwinter here. Viking armies go on to colonize areas of north, central and eastern England, later becoming known as the Danelaw.\n* 872\n** Autumn – The Great Heathen Army returns to Northumbria, to put down a rebellion at York. King Ecgberht I of Northumbria and his archbishop, Wulfhere of York, are expelled by the Northumbrians and flee to Mercia.\n** The Vikings, led by Halfdan Ragnarsson and Guthrum, establish a winter quarter at Torksey in the Kingdom of Lindsey (modern-day Lincolnshire). King Burgred of Mercia pays tribute of Danegeld.\n* 873\n** Spring – Vikings return to Northumbria.\n** Autumn – Vikings return to Mercia, taking up winter quarters at Repton; Repton Abbey is abandoned.\n* 874\n** Ceolwulf II becomes ruler of Mercia after Vikings have sacked Tamworth, driven Burgred of Mercia into exile and taken control of the north and east of the kingdom.\n* 875\n** Monks leave Lindisfarne, which is being invaded by Vikings, with the body of Saint Cuthbert, and settle at Chester-le-Street.\n** Donyarth, last recorded King of Cornwall, drowns in what is thought to be the River Fowey.\n** Vikings led by Guthrum invade Alfred's territory, taking Wareham but are forced out following a siege by Alfred.\n* 876\n** Vikings capture southern Northumbria, and found the Kingdom of York, perhaps under Halfdan Ragnarsson.\n** Vikings capture Exeter but their supply fleet is destroyed in a storm off Swanage and they are driven out by Alfred and settle in the Five Boroughs.\n* 877\n** Approximate date – Saxons invaders kill Rhodri the Great, Prince of Gwynedd, and his son (or brother) Gwriad.\n* 878\n** January – Battle of Chippenham; Vikings capture Chippenham, and take control of much of Wessex, forcing Alfred to take refuge in the Somerset Levels.\n** Early – Battle of Cynwit: Men of Wessex led by Odda, Ealdorman of Devon, prevent an attempted siege by Vikings under Ubba on the south coast of the Bristol Channel and capture their raven banner.\n** Easter – Alfred constructs a fort at Athelney, and holds out against the Vikings.\n** c.4–6 May – Alfred assembles troops at 'Egbert's Stone' on the edge of Salisbury Plain.\n** c.11 May – Battle of Edington in Wiltshire: Alfred defeats the Vikings and besieges them at Chippenham. They capitulate and, by the Treaty of Wedmore, Guthrum is baptised as Æthelstan at Aller, Somerset, and retreats in the first instance to Cirencester in south west Mercia.\n** Princes of southern Wales acknowledge Alfred as their overlord.\n* 879\n** Guthrum relocates to East Anglia where he will rule under his baptismal name of Æthelstan.\n* 886\n** Alfred restores London to Mercia.\n** Alfred signs a treaty with Guthrum, granting the territory between the Thames and the Tees to the Vikings; later known as the Danelaw.\n** Tradition of the Ripon hornblower begins, continuing for at least a thousand years.\n* 888\n** 30 June – death of Æthelred, Archbishop of Canterbury. He is succeeded by Plegmund.\n** Probable date – Shaftesbury Abbey is founded as a convent by Alfred who installs his daughter Æthelgifu as first abbess.\n* 890\n** The Welsh ruler Anarawd ap Rhodri, King of Gwynedd, makes the first ceremonial visit to an English court, that of Alfred.\n** Approximate date – Alfred begins to commission and undertake a series of translations into Old English, beginning with his own version of Pope Gregory I's Pastoral Care.\n* 892\n** Danish Vikings invade again, under the leadership of Hastein.\n** Anglo-Saxon Chronicle first compiled.\n* 893\n** Spring\n*** Edward, the son of King Alfred the Great, defeats invading Danish Vikings at Farnham, and forces them to take refuge on Thorney Island by London. At the same time, Vikings from East Anglia sail around the Cornish coast and besiege Exeter.\n*** A Danish Viking army under Hastein moves to a burh at Benfleet (Essex); this camp is captured by the Saxons while the army is out raiding and Hastein is forced to retreat to Shoebury.\n** Summer – Battle of Buttington: A combined Welsh and Mercian army under Æthelred, Lord of the Mercians besieges a Viking camp at Buttington just over the Welsh border. The Vikings escape with heavy losses and take their families to safety in East Anglia.\n** Autumn – Danish Vikings under Hastein take the city of Chester, after a rapid march from East Anglia. Alfred the Great destroys their food supplies, forcing them to move into Wales.\n** Asser of Sherborne writes The Life of King Alfred (Vita Ælfredi regis Angul Saxonum).\n* 894\n** Viking forces reach the Thames estuary.\n* 895 (or 893?)\n** Alfred blockades the Viking fleet at the River Lea; Vikings retreat to Bridgnorth.\n* 896\n** Viking army leaves Wessex.\n* 899\n** 26 October – King Alfred of Wessex dies; succeeded by his son, Edward the Elder.\nReferences"
    }
  ]
}