{
  "content": [
    {
      "type": "text",
      "text": "# 9th Queen's Royal Lancers\n\n(1715–1717) (1717–1800) (1801–1960)\n|branch=\n|type= Cavalry of the Line/Royal Armoured Corps\n|role= Main Battle Tank\n|size= 550\n|nickname= The Delhi Spearmen\n|current_commander=\n|notable_commanders=\nField Marshal Richard Molesworth, 3rd Viscount Molesworth\nLieutenant-General Sir John Cope\nGeneral Philip Honywood\nGeneral James St Clair-Erskine, 2nd Earl of Rosslyn\nGeneral Sir James Hope Grant\nGeneral Sir David Campbell\n|garrison=Derby\n|garrison_label=Regimental Headquarters\n|ceremonial_chief=\n|ceremonial_chief_label=Colonel-in-Chief\n|identification_symbol=\n|identification_symbol_label=\n|identification_symbol_2=\n|identification_symbol_2_label=\n|motto= We do not retreat\n|march=Quick: ''The Soldier's Chorus'' from Gounod's FaustSlow: Men of Harlech\n|anniversaries=\n}}\nThe '''9th Queen's Royal Lancers was a cavalry regiment of the British Army, first raised in 1715. It saw service for three centuries, including the First and Second World Wars. The regiment survived the immediate post-war reduction in forces, but was amalgamated with the 12th Royal Lancers to form the 9th/12th Royal Lancers in 1960.\nHistory\nEarly history\n, 1750)]]\nThe regiment was formed by Major-General Owen Wynne as Owen Wynne's Regiment of Dragoons''' in Bedford in 1715 as part of the response to the Jacobite rising. The regiment's first action was to attack the Jacobite forces in Wigan in late 1715. In 1717, the regiment embarked for Ballinrobe, in Ireland, and was placed on the Irish establishment. The regiment was ranked as the 9th Dragoons in 1719, re-titled as the 9th Regiment of Dragoons in 1751 and converted into Light Dragoons, becoming the 9th Regiment of (Light) Dragoons in 1783. The regiment fought at the Battle of Kilcullen, inflicting severe losses on the rebels, on 24 May 1798 and at the Battle of Carlow on 25 May 1798, when they successfully ambushed the rebels, during the Irish Rebellion. The regiment also saw action at the Battle of Vinegar Hill on 21 June 1798.\nThe regiment took part in Sir Samuel Auchmuty's disastrous expedition to the River Plate in October 1806, including the occupation of Montevideo in February 1807 during the Anglo-Spanish War. It then took part in the equally unsuccessfully Walcheren Campaign in autumn 1809: a total of 152 men from the regiment died of fever during that campaign. The regiment then embarked for Portugal and fought at the Battle of Arroyo dos Molinos, capturing General De Brune of the French Army, in October 1811 during the Peninsular War. It was also part of the covering force for the Siege of Badajoz in March 1812. In April 1813, the regiment returned to England. They were re-designated as a lancer formation in 1816 and became the '''9th (or Queen's Royal) Lancers in honour of Queen Adelaide in 1830.\nThe regiment was posted to India in 1842. It saw action at the Battle of Punniar in December 1843 during the Gwalior campaign. It also fought at the Battle of Sobraon in February 1846 during the First Anglo-Sikh War and undertook a successful charge at the Battle of Gujrat in February 1849 during the Second Anglo-Sikh War. The regiment then fought at the siege and capture of Delhi and the relief of Lucknow in summer 1857, as well as the capture of Lucknow in spring 1858 during the Indian Rebellion: the regiment, which was described by the rebels as \"the Delhi Spearmen\", was awarded twelve Victoria Crosses. It was described by an ally as:\n\"The beau ideal of all that British Cavalry ought to be in Oriental countries\".\nThe regiment was renamed the 9th (The Queen's Royal) Lancers''' in 1861.\nSecond Anglo-Afghan War\n. The troops would march in the early morning to avoid the full heat of the sun, halting a few minutes every hour. In this way, the column managed to cover up to 20 miles a day.]]\nThe regiment was posted to Afghanistan in 1878 and marched through the Khyber Pass in March 1879 as part of the cavalry brigade led by General Hugh Henry Gough. Following the murder of the British ambassador and his guards at Kabul in September 1879, the regiment saw action at the Battle of Charasiab in October 1879 during the Second Anglo-Afghan War. The commanding officer of the regiment, Lieutenant-Colonel Robert Cleland, was killed while leading a charge at the Battle of Killa Kazi in December 1879. Major-General Frederick Roberts described the ensuing events:\n\"The charge was led by Lieutenant-Colonel Cleland and Captain Neville, the former of whom fell dangerously wounded: but the ground, terraced for irrigation purposes and intersected by nullahs, so impeded our cavalry that the charge, heroic as it was, made little or no impression upon the overwhelming numbers of the enemy. The effort, however, was worthy and that it failed in its object was no fault of our gallant soldiers.\"\nA squadron from the regiment took part in the Second Battle of Charasiab in April 1880 and the regiment, as a whole, undertook the long march, under the command of Lieutenant Colonel Henry Bushman, leading to the relief of Kandahar and defeat of Ayub Khan in September 1880.\nSecond Boer War\nDuring the Second Boer War, the regiment took part in the Battle of Belmont and the Battle of Modder River in November 1899, as well as the Battle of Magersfontein in December 1899, Relief of Kimberley in February 1900 and the subsequent Battle of Paardeberg which resulted in Piet Cronjé's surrender.\nAfter the war, the regiment returned to Sialkot in the Punjab. In the Delhi Durbar of January 1903, the Duke of Connaught specially selected an escort from the 9th Lancers. This was popular with the regiment, but not with all Indian spectators; the regiment had been forbidden to take part as punishment for refusing to disclose the murderers of an Indian cook named Atu, who was beaten to death for his failure to \"provide them with some woman\". Before he died, the man had stated that his assailants were men of the 9th Lancers. It was suggested in the press that the assailants may actually have been unsuccessful applicants for the post of cook. The Viceroy, Lord Curzon, had insisted on a collective penalty being imposed on the 9th Lancers, partially to discourage drunken assaults by British soldiers on Indian camp-followers and partially from a sense of personal outrage at efforts made by officers to conceal the facts of this particular case. The regiment was later reported to have been transferred from Sialkot to Rawalpindi, also in Punjab.\nFirst World War\n)]]\nin 1918]]\nThe regiment landed in France as part of the 2nd Cavalry Brigade in the 1st Cavalry Division in August 1914 for service on the Western Front. Captain Francis Grenfell was awarded the Victoria Cross for his actions in saving the guns of 119th Battery, Royal Field Artillery on 24 August 1914 (he was later killed in action on 24 May 1915, as was his twin brother, Riversdale, a yeomanry officer who attached to 9th Lancers). The regiment then participated in the final \"lance on lance\" action involving British cavalry of the First World War; on 7 September 1914 at Montcel à Frétoy in which Lieutenant Colonel David Campbell led a charge of two troops of B Squadron and overthrew a squadron of the Prussian Dragoons of the Guard.\ns of Canterbury Cathedral to the officers and men of the 9th (Queen's Royal) Lancers who died during the First World War]]\nInter-war\ns of the 9th Lancers on manoeuvres at Tidworth, Wiltshire, 1938]]\nThe regiment was renamed the '''9th Queen's Royal Lancers''' in 1921. It was deployed to Ireland and lost nine of its men in the Scramogue ambush of March 1921 during the Irish War of Independence. In addition to the lack of conflicts, their relative inactivity was also due to the military high command struggling to decide what role cavalry regiments could perform in modern warfare. Lances ceased to be carried by the six lancer regiments in the British Army for active service in 1928, though the impressive if archaic weapon was retained for ceremonial parades and guard duties. In the case of the 9th Lancers, lances were formally withdrawn in 1932, four years before they lost their horses. In the spring of 1938, the Mobile Division, later to become the 1st Armoured Division, was formed: the 2nd Armoured Brigade, which included the 9th Lancers, was assigned to it.\nSecond World War\nThe Lancers landed in France to cover the retreating French, Belgian and British armies on 20 May 1940 and took part in the Battle of France. Withdrawn to England, the regiment landed in North Africa in September 1941 and undertook a leading part in the First Battle of El Alamein in July 1942. According to General Sir Richard McCreery:\n\"The 9th Lancers took part in many decisive battles, none more so perhaps than the long withdrawal from Knightsbridge, south of Gazala, to El Alamein. Many think that Egypt was saved when the Eighth Army defeated Rommel's last big attack in the Western Desert at the end of August 1942. Actually, Egypt was saved earlier during those first few critical days of July when Rommel drove his tanks and self-propelled guns and trucks forward along the Ruweisat Ridge in close formations, to be stopped by the 25-pounders and the remnants of the 2nd Armoured Brigade with their \"thin-skinned\" Crusader tanks. In this critical action the 9th Lancers took the principal part. Throughout that long withdrawal from Knightsbridge, when the fluctuating Battle of Gazala had finally swung against the Eighth Army, past Sollum and Matruh to the Ruweisat Ridge, only seventy miles from Alexandria, the 2nd Armoured Brigade with the 9th Lancers always there but often reduced to only a handful of tanks, fought on skilfully and with gallant endurance and determination. Egypt was then saved indeed and with the arrival of the 9th Australian Division from Syria about the 6th of July, the tide of the whole war was turned.\"\nMcCreery went on:\n\"Right well did the intensive training of the 9th Lancers with the Sherman bear fruit in the great battle which followed. As the world knows, the breakthrough at El Alamein did not come quickly. Rommel had had two months to build up defenses and minefields in depth. However, in the ten days \"dog-fight\" tank crews with their new 75-mm guns were knocking out far more enemy tanks than our infantry appreciated at the time.\"\nThe regiment's marksmanship was renowned; their best shot was Corporal Nicholls of B Squadron, who was once personally congratulated by General Bernard Montgomery for knocking out nine enemy tanks in one day. The regiment landed in Italy in mid-1944, where it saw action at San Savino in the battle for the Gothic Line in September 1944 on the Italian Front. The regiment formed the spearhead of the British Eighth Army in the breakthrough to the River Po in the spring of 1945. By the end of War, 143 members of the regiment had lost their lives.\nPost-war\nThe regiment moved to Glencorse Barracks, Edinburgh in December 1947 before deploying to Detmold, Germany in 1949. Queen Elizabeth The Queen Mother became Colonel-in-Chief of the regiment in June 1953. It then moved to Bhurtpore Barracks at Tidworth Camp in May 1960. The regiment was amalgamated with the 12th Royal Lancers to form the 9th/12th Royal Lancers in September 1960.\nRegimental museum\nThe Derby Museum and Art Gallery incorporates the Soldier's Story Gallery, based on the collection, inter alia, of the 9th Queen's Royal Lancers.\nBattle honours\nThe regiment's battle honours were as follows:\n*Early wars: Peninsula, Punniar, Sobraon, Chillianwallah, Goojerat, Punjaub, Delhi 1857, Lucknow, Charasiah, Kabul 1879, Kandahar 1880, Afghanistan 1878–80, Modder River, Relief of Kimberley, Paardeberg, South Africa 1899-1902\n*The Great War: Mons, Le Cateau, Retreat from Mons, Marne 1914, Aisne 1914, La Bassée 1914, Messines 1914, Armentières 1914, Ypres 1914 '15, Gravenstafel, St. Julien, Frezenberg, Bellewaarde, Somme 1916 '18, Pozières, Flers-Courcelette, Arras 1917, Scarpe 1917, Cambrai 1917 '18, St. Quentin, Rosières, Avre, Amiens, Albert 1918, Hindenburg Line, Pursuit to Mons, France and Flanders 1914-18\n*The Second World War: Somme 1940, Withdrawal to Seine, North-West Europe 1940, Saunnu, Gazala, Bir el Aslagh, Sidi Rezegh 1942, Defence of Alamein Line, Ruweisat, Ruweisat Ridge, El Alamein, Tebaga Gap, El Hamma, El Kourzia, Tunis, Creteville Pass, North Africa 1942–43, Coriano, Capture of Forli, Lamone Crossing, Pideura, Defence of Lamone Bridgehead, Argenta Gap, Italy 1944-45\nVictoria Crosses\n*Patrick Donohoe, Private – Indian Mutiny, 28 September 1857\n*John Freeman, Private – Indian Mutiny, 10 October 1857\n*William Goat, Lance Corporal – Indian Mutiny, 6 March 1858\n*Thomas Hancock, Private – Indian Mutiny, 19 June 1857\n*Henry Hartigan, Pensioned Sergeant – Indian Mutiny, 8 June 1857, 10 October 1857\n*Alfred Stowell Jones, Lieutenant – Indian Mutiny, 8 June 1857\n*Robert Kells, Lance Corporal – Indian Mutiny, 28 September 1857\n*Robert Newell, Private – Indian Mutiny, 19 March 1858\n*John Purcell, Private – Indian Mutiny, 19 June 1857\n*James Reynolds Roberts, Private – Indian Mutiny, 28 September 1857\n*David Rushe, Troop Sergeant Major – Indian Mutiny, 19 March 1858\n*David Spence, Troop Sergeant Major – Indian Mutiny, 17 January 1858\n*Francis Octavius Grenfell – Captain, First World War, August 1914\nColonel-in-Chief\n1953–1960: Queen Elizabeth The Queen Mother\nColonels\nThe colonels of the regiment were as follows:\n1715 9th Regiment of Dragoons\n* 1715 Owen Wynne, Wynne's Regiment of Dragoons\n1717 in the Irish establishment\n* 1719 James Crofts, Crofts' Dragoons\n* 1732 Richard, Viscount Molesworth, Lord Molesworth's Dragoons\n* 1737 John Cope, Cope's Dragoons\n* 1742 John Brown, Brown's Dragoons\n* 1743 Henry de Grangues, de Grangues's Dragoons\n* 1749 George Reade, Reade's Dragoons\nOn 1 July 1751, a royal warrant provided that, in future, regiments would not be known by their colonels' names, but by their \"number or rank\"; however, in this case, that order seems to have been \"honoured in the breach\".\n* 1756 James Jorden, Jorden's Dragoons\n* 1756 Philip Honywood, Honywood's or Honeywood's Dragoons\n* 1759 Henry Whitley, Whitley's Dragoons\n* 1771 James Johnston, Johnston's Dragoons\n* 1773 Flower Mocher, Mocher's Dragoons\n1783 9th Regiment of Light Dragoons\nLightened armour. From 1794 in the British establishment (from the Irish establishment)\n* 1801–1837: Gen. James, Earl of Rosslyn, GCB\n1830 9th Queen's Royal Lancers\nNamed in honour of Queen Adelaide\n*1837–1839: Lt-Gen. Samuel Need\n*1839–1865: Gen. Sir James Wallace Sleigh, KCB\n*1865–1875: Gen. Sir James Hope Grant, GCB\n*1875–1891: Gen. Sir Archibald Little, GCB\n*1891–1900: Lt-Gen. Sir William Drysdale, KCB\n*1900–1930: Maj-Gen. Sir Henry Augustus Bushman, KCB\n*1930–1936: Gen. Sir David Graham Muschet Campbell, GCB\n*1936–1940: Brig-Gen. Desmond John Edward Beale-Brown, DSO\n*1940–1950: Maj-Gen. Charles Wake Norman, CBE\n*1950–1960: Brig. Sir Christopher Henry Maxwell Peto, Bt., DSO, DL\n*''1960: Regiment amalgamated with the 12th Royal Lancers to form 9th/12th Royal Lancers (Prince of Wales's)''\nReferences\nSources\n*\n*\n*\n*\n*\n*\n*\nExternal links\n*[http://theroyallancers.org/9th-lancers/ History of the Regiment]"
    }
  ]
}