{
  "content": [
    {
      "type": "text",
      "text": "# ...An Education in Rebellion\n\n| length     = 34:08\n| label      = Columbia, Portrait\n| producer   =\n| prev_title = The Union Underground\n| prev_year  = 1997\n| next_title = Live... One Nation Underground\n| next_year  = 2002\n| misc       = ]]\n| single1date = August 28, 2000\n| single2     = Killing the Fly\n| single2date = 2001\n| single3     = Revolution Man\n| single3date = 2001\n}}\n}}\n...An Education in Rebellion is the only studio album by American nu metal band The Union Underground. Released on July 18, 2000, through Columbia, the album sold nearly 400,000 copies and featured the singles \"Turn Me On 'Mr. Deadman', \"Revolution Man\", and \"Killing the Fly\". This would be the group's only major label effort and last studio album before disbanding.\nOverview\nAfter selling more than 5,000 copies of their self-recorded, self-produced 1997 EP, The Union Underground gained the attention of Columbia A&R executive John Weakland. They performed for three Columbia representatives before being signed to Columbia's Portrait imprint by John Kalodner, who commented, \"I'd bet my bottom dollar this band will be around 10 years from now.\" Its summer 2000 release, An Education in Rebellion, resided on the American music charts for four months.\nThe album's lead single, \"Turn Me On 'Mr. Deadman', proved key in its success and held on the Mainstream Rock Tracks chart for six months. The song jabs at the rock star image and found its title from a myth surrounding the Beatles song \"Revolution 9\". It would go on to become The Union Underground's best known song and received both significant radio play and MTV rotation thanks to its music video. Because of the single, An Education in Rebellion also made AN's Hottest Sales Nationwide chart. It was later featured on the 2001 compilations Corrosion and KROQ New Music. \"Killing the Fly\" peaked at number 13 on the Mainstream Rock Tracks while the final single, \"Revolution Man\", reached number 26 and became an Active Rock top 30 hit. A live performance of \"South Texas Deathride\" was included on Ozzfest 2001: The Second Millennium.\nSix tracks from the band's self-released EP – \"Bitter\", \"Natural High\", \"The Friend Song\", \"Drivel\", \"Until You Crack\", and \"Trip With Jesus\" (originally titled \"Supersonic\") – were included on An Education in Rebellion. A large amount of demo material had been recorded prior to their major label debut, which allowed the band to choose the \"cream of the crop\" for its inclusion. Lyrically, the album features various autobiographical themes including household drug use, particularly in tracks like \"Trip with Jesus\". In an interview, The Union Underground described the meaning behind their major label release:\n:\"An Education in Rebellion is kind of a personal thing with us. You know when we were 14 – 15 years old, we just decided that this is what we're going to do with our lives regardless what anyone around us says or wants us to do. We just stayed completely focused on that and that's really what that's about. It's not about fuck your parents and fuck your teachers and tell them all to fuck off.\"\nArtwork\nThe cover artwork depicts a young New York model named Anna Belise, whom the band found in a magazine model search. According to John Moyer, the model participated in a three-hour photo shoot in \"freezing cold\" New York weather. He elaborated that the short-sleeved Belise had blue in her complexion not because of makeup but simply due to the severe weather conditions. In addition, the writing on the chalkboard, seen on the album's back cover, was created by Belise and not later added to the photo.\nTouring\nIn promoting ...An Education in Rebellion, The Union Underground began headlining the Road Rage tour, with opening acts Linkin Park and Systematic, prior to the album's release. They headlined club dates in fall 2000 and joined Marilyn Manson in late October. According to the band, Manson heard \"Turn Me On 'Mr. Deadman in a strip club and subsequently hand picked The Union Underground as his tour mates. The next year, they performed on the SnoCore Tour, Ozzfest 2001 in both the United States and Europe, and various festivals in Germany, London, and Paris. To correspond with the excitement of their live show, the band incorporated a large video screen depicting footage pieced together by the band members themselves to play in sync with the song rhythms.\nCritical reception\n| rev2      =\n| rev2Score =\n}}\nAllMusic's Tim Sheridan gave the album 3 out of 5 stars and commented, \"While their sonic punch is undeniable, blending guitar skronk with Bryan Scott's snarled vocals, the rebellious posing of songs like 'Revolution Man' comes off as a calculated marketing ploy rather than true agitation. Rather than start a revolution, this is music that will likely lead to skateboarding and headbanging.\"\nSteve Lampiris of Spectrum Culture praises the band's self-awareness: \"The band—vocalist/guitarist Bryan Scott, guitarist Patrick Kennison, bassist John Moyer and drummer Josh Memelo— alternate between poking fun at rockstar life and junkie culture (and sometimes both simultaneously) throughout the proceedings. Scott dryly mocks the allure of the former: 'Dilate, dilate, what's my drug of choice?/ It's okay when they pay, they say I got the voice/ Look at this, the motherfucker is a millionaire/ Realize it's a mask that you wear' and 'Never forget your lies/ Hypocrisize, five million might change your mind.' He sneers at the latter and romanticizes drug abuse in rock just as much: 'It's such a shame that it is this way/ I'm a junkie, god is gay/ Hate to bleed but it heals my pain' and 'Say that you never wanna get high, man/ There's nothing better, give it a try, man'. And ultimately, that's what An Education in Rebellion is: a 34-minute (satirical) 'fuck you' to everything and everybody\".\nTrack listing\nAll lyrics written by Bryan Scott. All music written by Bryan Scott except where noted.\n]]\n| music4          = Scott, Kennison\n| length4         = 2:38\n| title5          = Until You Crack\n| length5         = 3:28\n| title6          = Killing the Fly\n| length6         = 3:44\n| title7          = Natural High\n| music7          = Scott, Kennison\n| length7         = 3:26\n| title8          = Revolution Man\n| music8          = Scott, Kennison\n| length8         = 3:40\n| title9          = Trip With Jesus\n| length9         = 3:26\n| title10         = Bitter\n| length10        = 3:53\n| title11         = The Friend Song\n| length11        = 2:24\n}}\nCharts\nAlbum\n{|class=\"wikitable sortable\"\n! Year\n! Chart\n! Peakposition\n|-\n|rowspan=\"2\"|2000\n| Top Heatseekers\n|align=\"center\"| 2\n|-\n| The Billboard 200\n|align=\"center\"| 130\n|}\nSingles\n{| class=\"wikitable\"\n!align=\"center\" valign=\"top\" width=\"20\"|Year\n!align=\"left\" valign=\"top\"|Song\n!align=\"center\" valign=\"top\" width=\"90\"|Mainstream Rock Tracks\n!align=\"center\" valign=\"top\" width=\"90\"|R&R Active Rock Airplay\n|-\n|align=\"center\"|2000\n|align=\"left\" valign=\"top\"|\"Turn Me On 'Mr. Deadman'\n|align=\"center\" valign=\"top\"|11\n|align=\"center\" valign=\"top\"|-\n|-\n|rowspan=\"2\" align=\"center\"|2001\n|align=\"left\" valign=\"top\"|\"Killing the Fly\"\n|align=\"center\" valign=\"top\"|13\n|align=\"center\" valign=\"top\"|-\n|-\n|align=\"left\" valign=\"top\"|\"Revolution Man\"\n|align=\"center\" valign=\"top\"|26\n|align=\"center\" valign=\"top\"|Top 30\n|}\nPersonnel\n;The Union Underground\n* Bryan Scott – vocals, rhythm guitar, production, engineering\n* Patrick Kennison – lead guitar, co-production, engineering\n* Josh Memelo – drums\n* John Moyer – bass\n;Production\n* Brendan O'Brien – mixing\n* Don Gilmore – producer\n* Ulrich Wild – producer\n* George Marino – mastering\n* James Jeda for JJM – management\n* Sean Evans – art direction\n* Dean Karr – photography\n* Marina Chavez – band photo\n* Dana Martinelli – hair and makeup for cover\nReferences"
    }
  ]
}