{
  "content": [
    {
      "type": "text",
      "text": "# (No Parking in My) Love Zone\n\n| label         = Sedona Recording Company SDO-7511\n| writer        =\n| composer      = G. St. Clair\n| lyricist      =\n| producer      = Tim O'Brien\n| chronology    =\n| prev_title    =\n| prev_year     =\n| prev_version  =\n| next_title    =\n| next_year     =\n| next_version  =\n| tracks        =\n| misc          =\n}}\n\"(No Parking in My) Love Zone\" was a 1988 single for Rena Scott. It was a hit for her on the Billboard Hot Black Singles chart that year.\nBackground\n\"(No Parking in My) Love Zone\" was written by Gary St. Clair and appears on her Love Zone album.\nIn the ''Artists Breaking Through-Fall '88, New Music Programming Guide by Radio & Records, the song was referred to as one of the seductive delivered strong rhythmic tracks of the album.\nAirplay\nIt was reported by Radio & Records'' in the magazine's 28 October issue that \"(No Parking in My) Love Zone\" was added to the playlists of KRNB, WEDR, WPAL, WQFX, WJYL, and WVOI. It was reported by The Gavin Report for the week of 4 November that Scott's single had been added to the playlist of WJIZ in Albany, GA and WGOK in Mobile, AL. For the week of 18 November, Radio & Records reported significant action for the record with additions to WHUR, WJTT, WCKX and medium rotation at WEDR, U102, KPRW, and WVOI. For the week of 25 November, Black Radio Exclusive recorded the song's addition to the playlists of stations, WHUR in Washington DC, WJTT in Chattanooga, TN, WCHB in Inkster MI, and WCKX in Columbus, OH.\nBy 2 December, with the record still seeing significant action, Radio & Records recorded medium rotation at WEDR, WJTT, U102, WCKX, and KPRW.\nCharts\nThe single debuted at no. 100 in the Billboard Hot Black Singles chart for the week of 26 November 1988. At week three in the chart, for the week of 10 December, the single reached its peak position of 93.\nReferences\nExternal links\n* Discogs - [https://www.discogs.com/master/809588-Rena-Scott-No-Parking-In-My-Love-Zone Rena Scott – (No Parking In My) Love Zone]\n* Rena Scott - Topic channel, - [https://www.youtube.com/watch?v=TyiuhYvqbJ8 (No Parking in My) Love Zone (audio)]"
    }
  ]
}