{
  "content": [
    {
      "type": "text",
      "text": "# A. Edward Newton\n\nAlfred Edward Newton (1864–1940) was an American industrialist better known as an author and avid book collector. He is best known for his book Amenities of Book Collecting (1918) which sold over 25,000 copies. At the time of his death, it was estimated that he had approximately 10,000 books in his collection, focusing on English and American literary works, the major part of which were auctioned by Parke-Bernet Galleries, New York in April, May, and October 1941. Highlights of the sale included the autograph manuscripts of Thomas Hardy's novel Far From the Madding Crowd and Charles Lamb's essay Dream Children. However, the fall in rare book prices steadily through the Great Depression meant that many sold lots brought only a fraction of prices they would have realized at the time of the Jerome Kern sale in 1929. The three volume Newton sale catalogue remains a useful reference for literature collectors.\nNewton was a resident of Daylesford, Pennsylvania and resided in the home called Oak Knoll. Newton's bookplate referred to his home Oak Knoll and depicted an image of the London Temple Bar. The publisher Oak Knoll Books is named after Oak Knoll.\nSelected writings\n]]\n* [https://archive.org/details/amenitiesbookco00newtgoog  The Amenities of Book-Collecting and Kindred Affections] (1918)\n* [https://archive.org/details/amagnificentfar00newtgoog A Magnificent Farce: and Other Diversions of a Book-collector] (1921)\n* [https://books.google.com/books?id=XBkYAAAAMAAJ&q=this+book+collecting+game Book-Collecting Game] (1928)\nReferences\nExternal links\n*\n*\n*\n*\n*\n*\n* [http://www.newberry.org/collections/FindingAids/newton/Newton.html A. Edward Newton Letters] at Newberry Library\n*[https://web.archive.org/web/20150919161517/http://digital.library.du.edu/findingaids/view?docId=ead%2Fm040.xml%3Bquery%3D%3Bbrand%3Ddefault Guide to the A. Edward Newton Papers at the University of Denver] Retrieved September 25, 2014.\n* [https://www.loc.gov/rr/rarebook/coll/newton.html Edward Newton Collection.] Material from the library of A. Edward Newton, (94 titles). From the [https://www.loc.gov/rr/rarebook/ Rare Book and Special Collections Division at the Library of Congress]\n* [http://libwww.freelibrary.org/ead/view.cfm?name=newton A. Edward Newton Collection] finding aid from the Free Library of Philadelphia\n* [https://www.loc.gov/rr/rarebook/coll/newton.html A. Edward Newton Collection] From the Rare Book and Special Collections Division at the Library of Congress\n* [http://hdl.library.upenn.edu/1017/d/ead/upenn_rbml_PUSpMsColl1288 A. Edward Newton draft and proofs of Bibliography and Pseudo-Bibliography, 1936] From the [https://www.library.upenn.edu/kislak University of Pennsylvania: Kislak Center for Special Collections, Rare Books and Manuscripts]"
    }
  ]
}