{
  "content": [
    {
      "type": "text",
      "text": "# A. T. Stewart (pilot boat)\n\n{|\n|Ship name=A. T. Stewart\n|Ship namesake=Alexander Turney Stewart, Dry goods businessman\n|Ship christened= October 11, 1865\n|Ship builder = Edward F. Williams\n|Ship original cost=\n|Ship laid down=\n|Ship launched=October 11, 1865\n|Ship out of service=November 30, 1869\n|Ship renamed=\n|Ship struck=\n|Ship reinstated=\n|Ship honors=\n|Ship fate=Sank\n}}\n|Ship beam=\n|Ship draft=\n|Ship depth=\n|Ship sail plan=\n|Ship propulsion=Sail\n|Ship complement=\n|Ship armament=\n|Ship notes=\n}}\n|}\nThe A. T. Stewart was a 19th-century Sandy Hook pilot boat built in 1865 at the Edward F. Williams shipyard to replace the pilot boat George Steers, which was lost in 1865. She was built for the New Jersey and New York Sandy Hook Pilots Association. The Stewart was in a collision with the steamship Scotia and sank in 1869. She was replaced by the James Gordon Bennett in 1870.\nConstruction and service\nThe pilot-boat A. T. Stewart No. 6, was launched from the shipyard of Edward F. Williams, at Greenpoint, Brooklyn, on October 11, 1865. She was the twelfth vessel of her class built by Williams in the last ten years. There was a large party in attendance. She was built for pilots of the New Jersey and Sandy Hook Pilots' Association. She was built to replace the George Steers, No. 6, which was lost in February 1865. At the launch and naming ceremony, Ellen M. Clark, daughter of Jonah N. Clark, did the christening by breaking a bottle of champagne over the bow. The name of the boat was nominated by the friends of Alexander Turney Stewart, the dry goods millionaire businessman. The ship master was Captain Daniel C. Chapman.\nThe A. T. Stewart, was registered as a pilot Schooner with the Record of American and Foreign Shipping, from 1871 to 1874. Her owners were the Pilots' Association; built-in 1865 at Greenpoint, New York; and her hailing port was the Port of New York. Her dimensions were 80&nbsp;ft. in length; 21&nbsp;ft. breadth of beam; 7.10&nbsp;ft. depth of hold; and 90-tons Tonnage.\nOn May 22, 1866, the pilot boat A. T. Stewart, was in a collision with the Delaware schooner Transit, twenty miles east of Cape May Lightship. The Stewart was towed into port and reported damages in the sum of $5,000. On April 9, 1869, a collision case for the A. T. Stewart was brought before the United States District Court. The case was Chapman vs. the Schooner Transit. The court ruled that both boats were equally responsible for the collision and should share the cost for damages. The court also made the decision to remove the wreck of the A. T. Stewart, from the channel outside Sandy Hook.\nEnd of service\nOn November 30, 1869, the A. T. Stewart sank when she came in collision with the steamship Scotia off Sandy Hook, New Jersey. The pilots and crew were saved and brought to port. When the A. T. Stewart was lost in 1869, the James Gordon Bennett, No. 6 was built in 1870 to replace her.\nSee also\n*List of Northeastern U. S. Pilot Boats\nReferences"
    }
  ]
}