{
  "content": [
    {
      "type": "text",
      "text": "# A. W. F. Edwards\n\n| image       =         Anthony William Fairbank Edwards FRS.jpg\n| caption     = Edwards at the Royal Society admissions day in 2015\n| birth_date  =\n| birth_place = London, England\n| death_date  =\n| death_place =\n| fields      = Statistics, genetics\n| workplaces  =\n| education   = University of Cambridge\n| doctoral_students = Elizabeth A. Thompson\n| known_for   = Mathematical genetics\n| website     =\n| father      = Harold C. Edwards\n| relatives = John H. Edwards (brother)\n| academic_advisors = Ronald Fisher\n}}Anthony William Fairbank Edwards, FRS (born 4 October 1935) is a British statistician, geneticist and evolutionary biologist. Edwards is regarded as one of Britain's most distinguished geneticists, and as one of the most influential mathematical geneticists in the history. He is the son of the surgeon Harold C. Edwards, and brother of medical geneticist John H. Edwards. Edwards has sometimes been called \"Fisher's Edwards\" to distinguish him from his brother, because he was mentored by Ronald Fisher. In 1963 and 1964, Edwards, along with Luigi Luca Cavalli-Sforza, introduced novel methods for computing evolutionary trees from genetical data.\nEducation and career\n6-set Edwards–Venn diagram\nEdwards was educated at Uppingham School and Trinity Hall, Cambridge, where he read the natural sciences tripos (specialising in genetics) and graduated with a BA in 1957 and a PhD in 1961. While at Cambridge, Edwards was mentored by the geneticist and polymath Ronald Fisher. He has since maintained a high regard for Fisher's scientific contributions and has written extensively on them. To mark the Fisher centenary in 1990, Edwards proposed a commemorative Sir Ronald Fisher window be installed in the Dining Hall of Gonville & Caius College. When the window was removed in 2020, he vigorously opposed the move.\nAfter one postdoctoral research year at Cambridge, he was invited by Luigi Luca Cavalli-Sforza to the University of Pavia, where, in 1961–1964, they initiated the statistical approach to the construction of evolutionary trees from genetical data, using the first modern computers. A year at Stanford University was followed by three years as a senior lecturer in Statistics at the University of Aberdeen, supervised by D. J. Finney, and then two years as a Bye-Fellow in Science at Gonville and Caius College, during which he wrote his book Likelihood (1972). The remainder of his career was spent at Cambridge, ultimately as Professor of Biometry, during which he has published widely, including books on Venn diagrams, mathematical genetics, and Pascal's triangle. Edwards is currently a Life Fellow of Gonville and Caius.\nResearch\nEdwards has strongly advocated Fisher's concept of likelihood as the proper basis for statistical and scientific inference. He has also written extensively on the history of genetics and statistics, including an analysis of whether Gregor Mendel's results were \"too good\" to be unmanipulated, and also on purely mathematical subjects, such as Venn diagrams.\nIn a 2003 paper, Edwards criticised Richard Lewontin's argument in a 1972 paper that race is an invalid taxonomic construct, terming it Lewontin's fallacy.\nPersonal life\nHe was awarded the Telesio-Galilei Academy Award in 2011 for Biology. His elder brother John H. Edwards (1928–2007) was also a geneticist and also an FRS; their father, Harold C. Edwards, was a surgeon.\nEdwards is involved in gliding, particularly within the Cambridge University Gliding Club and has written on the subject in Sailplane and Gliding magazine as \"The Armchair Pilot\".\nAwards and honours\nEdwards was elected a Fellow of the Royal Society (FRS) in 2015.\nWorks\nBooks\n*Edwards, A.&nbsp;W.&nbsp;F. 1972. Likelihood. Cambridge University Press, Cambridge (expanded edition, 1992, Johns Hopkins University Press, Baltimore).\n*Edwards, A.&nbsp;W.&nbsp;F. 1977. Foundations of Mathematical Genetics. Cambridge University Press, Cambridge (2nd ed., 2000).\n*Edwards, A.&nbsp;W.&nbsp;F. 1987. ''Pascal's Arithmetical Triangle: The Story of a Mathematical Idea. Charles Griffin, London (paperback edition, 2002, Johns Hopkins University Press, Baltimore).\n*David, H.&nbsp;A.; Edwards, A.&nbsp;W.&nbsp;F. 2001. Annotated Readings in the History of Statistics. Springer, New York.\n*\n*Keynes, M.; Edwards, A.&nbsp;W.&nbsp;F.; Peel, R. eds. 2004. A Century of Mendelism in Human Genetics. CRC Press, Boca Raton, Florida.\n*Franklin, A.; Edwards, A.&nbsp;W.&nbsp;F.; Fairbanks, D.&nbsp;J.; Hartl, D.&nbsp;L.; Seidenfeld, T. 2008. Ending the Mendel-Fisher Controversy. University of Pittsburgh Press, Pittsburgh.\nAnthology\n*\n(Contains: selected papers, including all the papers below; short commentaries by expert biologists, historians, and philosophers; interview with Edwards; appendices; a full list of publications up to 2016.)\nPapers\n*Cavalli-Sforza, L.&nbsp; L.; Edwards, A.&nbsp; W.&nbsp; F.  1964. Analysis of human evolution. Genetics Today 3:923–933.\n*Edwards, A.&nbsp; W.&nbsp;F.; Cavalli-Sforza, L.&nbsp; L. 1964. Reconstruction of evolutionary trees. pp.&nbsp;67–76 in Phenetic and Phylogenetic Classification, ed. Heywood, V.&nbsp; H. and McNeill, J. Systematics Association pub. no. 6, London.\n*Cavalli-Sforza, L.&nbsp; L.; Edwards, A.&nbsp; W.&nbsp; F. 1967. Phylogenetic analysis: models and estimation procedures. American Journal of Human Genetics 19:233–257.\n*Edwards, A.&nbsp; W.&nbsp; F. 1969. Statistical methods in scientific inference. Nature 222:1233–1237.\n*Edwards, A.&nbsp; W.&nbsp; F. 1974. The history of likelihood. International Statistical Review'' 42:9–15.\n*Edwards, A.&nbsp; W.&nbsp; F. 1986. Are Mendel's results really too close? Biological Reviews 61:295–312.\n*Edwards, A.&nbsp; W.&nbsp; F. 1996. The origin and early development of the method of minimum evolution for the reconstruction of phylogenetic trees. Systematic Biology 45:79–91.\n*Edwards, A.&nbsp; W.&nbsp; F. 2000. The Genetical Theory of Natural Selection. Genetics 154:1419–1426.\n*Edwards, A.&nbsp; W.&nbsp; F. 2003. Human Genetic Diversity: Lewontin's Fallacy. BioEssays 25:798–801.\nReferences"
    }
  ]
}