{
  "content": [
    {
      "type": "text",
      "text": "# A Culture of Conspiracy\n\nA Culture of Conspiracy: Apocalyptic Visions in Contemporary America is a 2003 non-fiction book written by Michael Barkun, professor emeritus of political science at the Maxwell School of Citizenship and Public Affairs.\nOverview\nAlong with the Internet playing a key role in introducing individuals to beliefs once consigned to the outermost fringe of American political and religious life, Barkun points to the convergence of two phenomena that influence contemporary American conspiracism:\n* The rise of \"improvisational millennialism\" — a belief in an imminent destruction of the world and the creation of a new world as a result of the triumph of good over evil, which is independent from any single religious or secular tradition (e.g., Christian dispensational premillennialism, etc.) and indiscriminately syncretizes ideas from different traditions (e.g., Western esotericism, Eastern religions, New Age movement, fringe science, radical politics, etc.).\n* The popularity of \"stigmatized knowledge\" — claims to the truth that the claimants regard as verified (e.g., climate change denial, location hypotheses of Atlantis, astrology, alchemy, folk medicine, alien abduction, extraterrestrial hypothesis for UFOs, suppressed cancer cures, etc.), despite the marginalization of those claims by the authoritative institutions that conventionally distinguish between knowledge and error (e.g., academia, scientific community, etc.).\nReviews\nPublishers Weekly gave the book a positive review by stating \"Scholarly but fluently written and free of excessive jargon, Barkun's exploration of the conspiratorial worldview combines sociological depth with a deadpan appreciation of pop culture and raises serious questions about the replacement of democracy by conspiracy as the dominant paradigm of political action in the public mind.\"\nIn a February 2004 review, writer and political blogger Daniel Pipes wrote:\nReferences\nFurther reading\n*Boyer, Paul S. [https://web.archive.org/web/20130310080017/http://www.religion-online.org/showarticle.asp?title=3075 The Strange World of Conspiracy Theories]. The Christian Century (27 July 2004). Retrieved on 2011-07-12\n*Pratt, Ray. [http://mtprof.msun.edu/Spr2005/pratrev.html Review]. The Montana Professor (Spring 2005). Retrieved on 2011-07-12\n*\n*\n*\nExternal links\n*C-SPAN Video Library: [http://www.c-spanvideo.org/program/180937-2]"
    }
  ]
}