{
  "content": [
    {
      "type": "text",
      "text": "# A Great Wall: Six Presidents and China\n\nA Great Wall: Six Presidents and China: An Investigative History (1999) is a history of international relations written by journalist Patrick Tyler.  The book details high level relations between the United States and China from the Nixon administration to the Clinton Administration.  Primarily focused on the actions and motives of members of the president's cabinet and their counterparts in China, the book illustrates the large role personal politics and bureaucratic infighting had on the direction of China policy in the United States.  Well received in the popular press, the book garnered mixed reviews in scholarly journals.  However, the book won both the Lionel Gelber Prize and the New York Public Library's Helen Bernstein Book Award in 2000.\nOverview\nA Great Wall begins with a 1996 briefing to President Clinton regarding a burgeoning crisis between the People's Republic of China and the Republic of China, or Taiwan.  Chinese intermediate-range ballistic missile testing was scheduled during the run-up to Taiwanese elections in March of that year.  While not seen as a prelude to invasion, it was clear that the possibility for accidental escalation and war was real.  This threat sets what Robert Kaplan in the New York Review of Books referred to as the somewhat \"alarmist\" tone for the book.  Tyler asserts that war with China was historically very likely at certain flashpoints and remains likely due to the \"insoluble problem of Taiwan\".\nHaving established the significance of both the threat of war and the relationship between the United States and China, Tyler returns to the history of American relations with China, including covert conflicts and plans for war.  During the Kennedy and Johnson administrations, China was viewed as a necessary check on Soviet expansion.  Tyler asserts that Nixon's visit to China and the subsequent warming of relations were partially the result of Henry Kissinger's desire to push then Secretary of State William P. Rogers out of the sphere of influence on China policy.  Tyler covers the personal infighting in great detail but notes that the outcome was generally positive for both countries.\nTyler is more critical of the Carter and Reagan administrations, noting specifically that the ambiguity which Kissinger and Nixon allowed to foment regarding Taiwan was beneficial to both nations, allowing China and the United States to \"disagree while insisting that they didn't\".  However, Tyler reserves a great deal of criticism for the Clinton administration, whose largely humanitarian policies he feels were unsupported by the facts on the ground.  Tyler ends the book where he began, with a \"clear [assertion]\" that Taiwan is paramount in Sino-American relations.\nReception\nThe book was largely well received in the popular press, with the New York Review of Books praising it as \"compelling\" and a \"powerful statement in defense of pragmatism\".  Likewise, Foreign Affairs recommended the book, noting its \"vivid detail\".  The journal Parameters gave a mixed review, praising the detail of the book but lamenting its limited scope. Mark P. Lagon, in the journal Perspectives on Political Science, savaged the book, calling it gossip-filled and a \"slim\" contribution to scholarship.  Despite these mixed reviews, A Great Wall won both the Lionel Gelber Prize and the New York Public Library's Helen Bernstein Book Award in 2000.\nNotes\nExternal links\n*[https://www.c-span.org/video/?152171-1/great-wall-six-presidents-china Booknotes interview with Tyler on A Great Wall, October 31, 1999.]"
    }
  ]
}