{
  "content": [
    {
      "type": "text",
      "text": "# A Happening of Monumental Proportions\n\n| music          = Alec Puro\n| cinematography = Alison Kelly\n| editing        = Suzanne Spangler\n| studio         = Albyn MediaDepth of Field\n| distributor    = Great Point Media\n| released       =\n| runtime        =\n| country        = United States\n| language       = English\n| budget         =\n| gross          =\n}}\nA Happening of Monumental Proportions (known as A Very Bad Day in some countries) is a 2017 American comedy-drama film directed by Judy Greer in her directorial debut and produced by Chris and Paul Weitz. It stars Allison Janney and Common. The film was released on September 21, 2018 by Great Point Media.\nPlot\nDaniel, an account manager (Common) is having a bad day. Gearing up for Career Day at his daughter's elementary school, the new boss fires him when his affair with his married assistant (Jennifer Garner) is revealed.\nLonely Darius, Daniel's boss's (Bradley Whitford) son, finds himself instantly entranced by Patricia, Daniel's daughter (Storm Reid), and seeks advice from their school's shop (John Cho) and music teachers (Anders Holm) on how to win her heart.\nMeanwhile, the principal and vice-principal (Allison Janney and Rob Riggle) spend the day trying to hide the school's dead gardener from the faculty and staff, as well as the students and their parents.\nThe day culminates with the Career Day activity. Both Daniel and his former boss turn up. They begin to have an altercation they decide to take outside.\nAt the same time Mr. McRow, and then Darius, wander up on the roof to ponder life. They share feelings about Darius' loneliness and Christian's failure in music. But they connect while watching the fight between Daniel and Mr. Schneedy. As they are about to go down, Christian falls off the roof and onto the manure pile below, uninjured.\nIn the end, Darius tells his father he's tired of moving, Patricia's dad meets the husband of his former lover, getting closure, and the coroner finally takes away the dead gardener.\nCast\n* Allison Janney as Principal Nichols\n* Katie Holmes as Paramedic #1\n* Jennifer Garner as Nadine, Daniel’s assistant and Bob’s wife\n* Bradley Whitford as Arthur Schneedy, Daniel’s boss\n* John Cho as Mr. Ramirez, a teacher\n* Common as Daniel Crawford, Patricia’s father\n* Anders Holm as Christian McRow\n* Storm Reid as Patricia Crawford, Daniel’s daughter\n* Rob Riggle as Vice Principal Ned Pendlehorn\n* Nat Faxon as Paramedic #2\n* Kumail Nanjiani as HR Rep Perry\n* Keanu Reeves as Bob\n* Jessica Mikayla Adams as Jamie\nReception\nOn review aggregator Rotten Tomatoes, the film has an approval rating of 29% based on 24 reviews, with an average rating of 3.87/10. Metacritic reports a score of 35/100 based on 9 critics, indicating \"generally unfavorable\" reviews.\nReferences\nExternal links\n*\n*"
    }
  ]
}