{
  "content": [
    {
      "type": "text",
      "text": "# A Hologram for the King\n\n| country      = United States\n| language     = English\n| series         =\n| subject        =\n| genre        =\n| publisher    = McSweeney's\n| release_date = June 2012\n| english_release_date =\n| media_type   = Print (hardback & paperback)\n| pages        = 312 pp (first edition, hardcover)\n| isbn =   193636574X\n| isbn_note = (first edition, hardcover)\n| dewey=\n| congress=\n| oclc=\n| followed_by    =\n}}\nA Hologram for the King is a 2012 American novel written by Dave Eggers. In October 2012, the novel was announced as a finalist for the National Book Award.\nIt was adapted as a film of the same name, released in 2016 and starring Tom Hanks and Sarita Choudhury.\nPlot\nThe novel tells the story of a washed-up, desperate American salesman, Alan Clay, who travels to Saudi Arabia to secure the IT contract from the royal government for the King Abdullah Economic City, a massive new complex being built in the middle of the desert.\nStyle\nMichiko Kakutani describes the novel as having a \"Hemingwayesque voice\" with some of the main characters' adventures taking on a \"Kafkaesque flavor\". The novel also makes intentional analogies to Waiting for Godot.\nReception\nThe New York Times review of the novel by Michiko Kakutani, was generally positive, noting \"he has achieved something that is more modest and equally satisfying: the writing of a comic but deeply affecting tale about one man’s travails that also provides a bright, digital snapshot of our times.\" San Francisco Chronicle reviewer Carmela Ciuraru described the novel as \"an extraordinary work of timely and provocative themes, including the decline of American manufacturing, the sufferings of the middle class and the collapse of the global economy.\"\nAwards\n* National Book Award (Fiction) finalist (2012)\n* Publishers Weekly Best Books of 2012 list\n* The New York Times 100 Notable Books of 2012 List (Fiction & Poetry)\n* The New York Times 10 Best Books of 2012 list, Fiction\n* California Book Award (Fiction) finalist (2013)\n* International Dublin Literary Award longlist (2014)\nFilm adaptation\nA film adaptation by the same name was released in 2016. German filmmaker Tom Tykwer wrote and directed the film, starring Tom Hanks, Tom Skerritt and Sarita Choudhury. Playtone and X-Filme Creative Pool produced it.\nReferences"
    }
  ]
}