{
  "content": [
    {
      "type": "text",
      "text": "# A Juvenile Product of the Working Class\n\n| producer   = Fat Mike, Ryan Greene\n| prev_title = More Scared: The House of Faith Years\n| prev_year  = 1996\n| next_title = Five Lessons Learned\n| next_year  = 1998\n}}\n|rev3 = Punknews.org\n|rev3score =\n}}\nA Juvenile Product of the Working Class is an album by American punk rock band Swingin' Utters. It was released on September 10, 1996, as the band's first album on Fat Wreck Chords. The album's name was taken from a line in Elton John's song \"Saturday Night's Alright For Fighting\". The cover art is by Frank Kozik.\nThe band promoted the album by touring with the Descendents for their Everything Sucks tour.\nOn ''Give 'Em the Boot\nThe song \"Fifteenth and T\" appears on the compilation album Give 'Em the Boot (1997).\nRelease and Re-release\nA Juvenile Product of the Working Class was released in 1996. One notable feature of the release was both the CD tray and cassette shell were pink. It was re-released on limited edition opaque yellow vinyl, in 2008. Only 550 copies were printed, and sold out shortly after going on sale.\nCritical reception\nThe Washington Post'' wrote that \"the Utters' songs may be inconsistent, but their playing is reliably nimble.\" The Florida Times-Union thought that \"with 'Next in Line', the Utters are trying to change punk by adapting influences and defining their own sound.\" The Philadelphia Inquirer determined that the album \"overflows with articulate rage and relentless hooks.\" The Bradenton Herald noted that it \"ranges from melodic punk to garage pop to rock and roll.\"\nAllMusic wrote that the Utters \"manage to put out some of the catchiest working class anthems for the '90s.\"\nTrack listing\nAll songs by Darius Koski unless otherwise noted.\n# \"Windspitting Punk\" (Koski, Goddard, Johnny Bonnel, Max Huber)&nbsp;– 2:14\n# \"No Time to Play\"&nbsp;– 2:13\n# \"Nowhere Fast\"&nbsp;– 1:54\n# \"Keep Running\"&nbsp;– 2:14\n# \"Sustain\"&nbsp;– 1:37\n# \"(Of) One in All\"&nbsp;– 1:40\n# \"Derailer\" (Bonnel, Kevin Wickersham)&nbsp;– 1:56\n# \"The Next in Line\" (Huber)&nbsp;– 3:40\n# \"Sign It Away\"&nbsp;– 1:50\n# \"Time Tells Time\" (Koski, Huber)&nbsp;– 2:52\n# \"Almost Brave\"&nbsp;– 1:28\n# \"Fifteenth and T\" (Huber)&nbsp;– 2:13\n# \"London Drunk\"&nbsp;– 2:03\n# \"The Black Pint\" (Bonnel)&nbsp;– 2:27\n# \"Bigot's Barrel\" (Bonnel, Wickersham)&nbsp;– 2:31\n# \"A Step to Go\"&nbsp;– 2:21\nCredits\n*Johnny Bonnel – vocals\n*Max Huber – guitar\n*Greg McEntee – drums\n*Kevin Wickersham – bass\n*Darius Koski – guitar, accordion, vocals\nReferences\nExternal links\n* [http://www.fatwreck.com/record/detail/545 Fat Wreck page on the album]"
    }
  ]
}