{
  "content": [
    {
      "type": "text",
      "text": "# A New Leash on Life: The K9s for Warriors Story\n\nA New Leash on Life: The K9s for Warriors Story is a 2018 documentary film written and directed by Nick Nanton.\nThe film premiered in New York City on June 12, 2018 and a number of public screenings were subsequently held through the United States. A New Leash on Life: The K9 for Warriors Story was presented at the Suncoast Regional Emmy awards where it won Emmys for Direction, Editing, Photography and Documentary.\nSynopsis\nWhen Shari Duval's son, Brett Simon, returned from serving in Iraq, he struggled with PTSD. Shari was desperately searching for a solution when she stumbled upon a news story about a veteran with a service dog. Inspired by the improvement the veteran had made after adopting the animal, she decided to start a dog service agency for veterans. The idea gave Brett new hope, and together they founded K9s for Warriors, which pairs rescue dogs from animal shelters with veterans.\nThe film focuses on the stories of three veterans apart from Brett Simon.\nShilo Schluterman served as an aircraft mechanic and in maintenance and operations with the U.S. Air Force Air National Guard between 1999 and 2014. She was paired with her dog, Javelin, after medication was ineffective in treating anxiety and panic attacks caused by PTSD.\nAdam LeGrand struggled with nightmares and traumatic memories after serving as a combat medic in the U.S. Air Force. They were so bad, he even considered ending his own life. After being paired with his dog, Molly, he was able to become a functioning member of society again and reduce his daily medications from 20 down to one.\nLouis Belluomini served as a U.S. Army Captain for nine years. He was diagnosed with PTSD and a traumatic brain injury. While suffering a flashback, he lost control of his car and drove off the road. When Belluomini was partnered with his dog, Star, it was a great relief to his family.\nSince its founding, K9s for Warriors has saved the lives of more than 400 veterans and 800 dogs.\nProduction\nSchluterman was initially hesitant to appear in the production, but finally agreed because she “wanted to help other veterans by sharing her story.\"\nBelluomini agreed to appear in the film after he was approached by the public relations director of DNA Films.\nFundraising\nBelluomini hosted a screening of A New Leash on Life: The K9s for Warriors Story at the University of Findlay, where he hoped to raise $15,000 for the K9s for Warriors.\nBelloumini, LeGrand, and Schluterman appeared a screening and panel discussion at Syracuse University hosted by the Student Veterans Organization which aimed to raise $20,000 for K9s for Warriors.\nBelluomini hosted several other screenings of the film to raise funds for K9s for Warriors, including at Putnam County District Library in Ottawa.\nBelloumini, LeGrand, and Schluterman were featured in a Fox and Friends segment on Fox News with Nick Nanton and Sheri Duval where they talked about the film and their experiences with K9s for Warriors.\nAwards\nA New Leash on Life: The K9s for Warriors Story was presented at the Suncoast Regional Emmy awards in 2018 where it won Emmys for Direction, Editing, Photography and Documentary. &nbsp;\nReferences\nExternal links\n*\n* [https://www.amazon.com/A-New-Leash-On-Life/dp/B07JQ5S6S7 A New Leash on Life: The K9s for Warriors Story] at Amazon Prime\n* [https://video.foxnews.com/v/5797063266001/#sp=show-clips Veterans get new leash on life with K9s for Warriors] (Fox and Friends segment)"
    }
  ]
}