{
  "content": [
    {
      "type": "text",
      "text": "# A Warning (book)\n\nA Warning is a 2019 book about the Trump administration, anonymously authored by someone described as \"a senior Trump administration official\", revealed in late 2020 to be Department of Homeland Security official Miles Taylor.\nIt is a follow-up to an anonymous op-ed published by The New York Times in September 2018. The article, \"I Am Part of the Resistance Inside the Trump Administration\", described President Donald Trump's decision-making as uninformed and irresponsible, and said that many current members of the administration deliberately undermine his suggestions and orders for the good of the country.\nPublication and response\nExpanding on the op-ed, the book was released on November 19, 2019, by Twelve, an imprint of the Hachette Book Group. The author received no advance payment and will donate some royalties to nonprofits. The author is represented by Javelin, a firm that has represented authors of other major Trump exposés (A Higher Loyalty, Team of Vipers).\nA couple of weeks before the official release of the 259-page book, several media outlets obtained pre-release book excerpts. The Washington Post reported discussions of potential mass resignation, a “midnight self-massacre”, to warn the public of the gravity of the chaotic situation inside the White House. The Rachel Maddow Show covered concerns over the president's eroding decision-making capabilities, \"a toxic combination of amorality and indifference\", and discussions of removal of the president using the 25th Amendment. Other media covered the excerpt on the president's mental acuity, volatility, and that he \"stumbles, slurs, gets confused, is easily irritated, and has trouble synthesizing information\".\nThe Trump White House responded to the book excerpts, calling the book a \"work of fiction” and the author a \"coward\". Vice President Mike Pence insisted he never heard any talk about using the 25th Amendment to remove Trump from office. The Justice Department wrote a letter to the author warning that he or she might be violating one or more nondisclosure agreements by writing the book. The publisher defended the author, denied the need for a pre-publication review, challenged the government's apparent attempt to out the author's identity (as with other inner-circle whistleblowers), and said the department was just trying to intimidate them.\nAuthorship\nThe Associated Press theorized that public curiosity over the author's identity might resemble the public riddle that occurred after the release of Primary Colors, a roman à clef on the Bill Clinton 1992 presidential campaign.\nIn November 2019, the presumed author said they would reveal their identity at some point: “Trump has not heard the last of me. There is more to come... Trump will hear from me, in my own name, before the [November] 2020 election.”\nOn February 18, 2020, then-President Donald Trump claimed that he knew the identity of the author but refused to release the author's identity to the public.\nOn October 28, 2020, Miles Taylor announced that he is the author of the book.\nReviews\nRon Elving of NPR gave the book a positive review, praising its \"sustained presence of surprisingly high-minded, intellectual discussion\".\nCarlos Lozada of The Washington Post panned the book, criticizing its lack of revelations and accusing it of creating more \"noise\".\nIn her review for The New York Times Book Review, Jennifer Szalai gave the book a negative review, asking, \"How can a book that has been denuded of anything too specific do anything more than pale against a formal whistle-blower complaint?\"\nReferences\n}}\nExternal links\n*"
    }
  ]
}