{
  "content": [
    {
      "type": "text",
      "text": "# Aaron Ward (representative)\n\nAaron Ward (July 5, 1790 &ndash; March 2, 1867) was an American lawyer and politician from New York. He served five terms over three separate stints in the U.S. House of Representatives during the early-to-mid-19th century.\nLife\nHe was born in Sing Sing, Westchester County, New York, the son of Moses Ward. He completed preparatory studies in Mount Pleasant Academy, and then studied law.\nWar of 1812\nAt the beginning of the War of 1812 he was commissioned a lieutenant in the 29th Regiment of Infantry, and in 1814 commissioned a captain.\nEarly career\nAfterwards he continued to serve in the State Militia, and in 1830 he was promoted to major general. After the war, he resumed his legal studies in Oxford, New York, was admitted to the bar, and commenced practice in Sing Sing.\nHe was District Attorney of Westchester County from 1819 to 1822. On January 19, 1820, he married Mary L. Watson (1797–1853, daughter of Elkanah Watson).\nCongress\nWard was elected as an Adams man to the 19th and 20th; as a Jacksonian to the 22nd, 23rd and 24th; and as a Democrat to the 27th United States Congress, holding office from March 4, 1825, to March 3, 1829; from March 4, 1831, to March 3, 1837; and from March 4, 1841, to March 3, 1843.\nLater activities\nHe was a delegate to the New York State Constitutional Convention of 1846. In 1855, Ward ran on the Hard ticket for Secretary of State of New York, but was defeated by Joel T. Headley.\nWard was the first President of Dale Cemetery in Ossining and a trustee of Mount Pleasant Academy.\nDeath\nHe died in Georgetown, Washington, D.C., and was buried at Dale Cemetery.\nFamily\nWard's daughter Virginia Gadsby Ward was married to George Adlington Brandreth, and they were the parents of four daughters. Their grandchildren included photographer Yvette Borup Andrews.\nWard's daughter Josephine A. Ward (d. 1906) was the second wife of Senator John Renshaw Thomson (1800–1862), and in 1878 became the second wife of Maryland Governor Thomas Swann.\nCongressman Elijah Ward was his cousin.\nNotes\nReferences\n*[https://books.google.com/books?id=E3sFAAAAQAAJ&pg=PA71 The New York Civil List] compiled by Franklin Benjamin Hough (pages 59, 71ff, 384; Weed, Parsons and Co., 1858)\n*[https://books.google.com/books?id=HZ9HAAAAYAAJ&pg=PA70 Maj. Gen. Aaron Ward, of New York] a political biography in The United States Magazine and Democratic Review (Vol. 28; January 1851, pages 70ff)\n*[https://timesmachine.nytimes.com/timesmachine/1906/03/03/101768309.pdf Death notice] of his daughter Josephine, in NYT on March 3, 1906"
    }
  ]
}