{
  "content": [
    {
      "type": "text",
      "text": "# Aaron Schwartz (Canadian actor)__disambig_1\n\n| birth_place = Theodore, Canada\n| education   = Swarthmore College (BA)Columbia University (MFA)York University (LLB)\n| occupation  = Actor, director, photographer, copyright lawyer\n| years_active = 1977–19901995–present\n| known_for   = Suspect, The Outside Chance of Maximilian Glick, Murder by Night, White Light (films)\n| television  = Check It Out! (series)\n| website     =\n}}\nAaron Schwartz (born 1948/1949) is a Canadian actor, director, photographer and copyright lawyer.\nLife and career\nSchwartz was born in 1949 in Theodore, Saskatchewan, and grew up in Winnipeg, Manitoba. He graduated from Swarthmore College in 1970; in 1972 he received an MFA degree in Theater from Columbia University. He earned a law degree from Osgoode Hall Law School at York University, Toronto, in 1993, and was admitted to the Ontario Bar in 1995.\nSchwartz spent his early career in theatre. In 1987, he produced and directed ''Bat Masterson's Last Regular Job'', by Bill Ballantyne, at the Toronto Free Theatre. He had previously directed the world premiere of Ballantyne's first play, The Al Cornell Story, at the Theatre Passe Muraille Back Space in Toronto. Schwartz was nominated as best director for a Dora Mavor Moore Award for his production of Come Back to the Five and Dime, Jimmy Dean, Jimmy Dean, at the Factory Theatre in Toronto.\nSchwartz is known for playing a leading role as grocery cashier Leslie Rappaport in the television situation comedy, Check It Out! (1985–1988). He was also featured in two episodes of Street Legal (in 1990) and in the episode of Alfred Hitchcock Presents entitled \"Killer Takes All\" (1988) with Van Johnson and Rory Calhoun.\nIn film, he is known for playing Henry Glick, the father of the title character in The Outside Chance of Maximilian Glick (1988), which won the Best Canadian Feature Film award at the Toronto International Film Festival. His other film roles include the Czech Officer in Eleni (1985) starring John Malkovich and the Forensic Pathologist in Suspect (1987) starring Cher and Liam Neeson, both films directed by Academy Award-winning director Peter Yates.  Other film credits include the Neurologist in Murder by Night (1989), Dr. Spears in Age-Old Friends (1989) and Aaron Stern in White Light (1991).\nIn January 2011, Schwartz wrote in an essay about protecting your photographs online:\nIf the thief&nbsp;... tried to sell [the infringed work] and couldn't&nbsp;– then the artist might want to take a hard look at how much damage has really been done. Probably got some free advertising....\nI recommend not putting anything extremely valuable where someone can steal it. And don't worry too much about what happens to the work that you do display on the Internet, because a \"thief\" might well be doing you as much good as harm.\nSchwartz, in addition to his law and acting careers, is an accomplished photographer.  Founder of the photography blog aamora.com, a self-proclaimed \"Playland\" for photographers, artists and writers around the world, he has developed a reputation for his photographs on JPG and his own online gallery.\nReferences\nExternal links\n*\n*  on Wayback Machine"
    }
  ]
}