{
  "content": [
    {
      "type": "text",
      "text": "# Abaco Independence Movement\n\nThe Abaco Independence Movement (AIM) was a Bahamian political party formed shortly after the Bahamas became independent in August 1973. Its stated aim was self-determination for the Abaco islands within a federal Bahamas. In October&nbsp;1973, AIM published a newsletter to launch its campaign for 'self-determination through legal and peaceful political action'.\nHistory\nAIM proposed that all Crown land on Abaco should be placed in a land trust. Each citizen would receive a one-acre home lot from the trust and a share of revenue from land sales and leases. The land trust would enter into a joint venture to develop a 60&nbsp;sq mile free trade zone. When AIM was formed by Chuck Hall and Bert Williams, they contacted an American financier named Michael Oliver, who through his libertarian Phoenix Foundation agreed to support AIM financially. The Phoenix Foundation had previously sought to establish a libertarian enclave in the South Pacific, the Republic of Minerva. AIM's first convention, held on February&nbsp;23, 1974, was addressed by John Hospers, the Libertarian Party's 1972 US presidential candidate. Hospers was later refused entry to the Bahamas. British MP Colin Campbell Mitchell also visited Abaco to offer support.\nAround May 1974, reports emerged of a group called 20th Century Revolutionaries whose appeared intent on overthrowing Abaco's central government. AIM denounced the group.\nIn February&nbsp;1975, an article appeared in Esquire magazine claiming that plans for an insurrection in Abaco were underway. Mitchell WerBell, an American arms-dealer and mercenary, claimed that Abaco would declare unilateral independence. It was claimed that WerBell was managing and financing AIM and had been recruiting mercenaries to go to Abaco. Although no arrests or charges relating to an insurrection were made, AIM's involvement with WerBell (which included visits to his Georgia estate) greatly discredited AIM. In March&nbsp;1975, AIM changed its name.\nThe new Abaco Home Rule Movement denied any military objectives and published a draft constitution for a proposed Abaco Commonwealth, based on libertarian principles. The results of the 1977 general election, in which the Progressive Liberal Party won 30 seats of 38 seats in Parliament including Abaco-Coopers Town, was a major disappointment for AHRM and effectively marked the end of the movement. The AIM newspaper, The Abaco Independent ceased publication in 1977.\nFlag\nThe AIM flag showed a lighthouse (presumably the lighthouse at Hopetown) amidst a sunburst.\nReferences\nFurther reading\n*Dodge, Steve. Abaco: The History of an Out Island and Its Cays. Decatur: White Sound Press, 1983."
    }
  ]
}