{
  "content": [
    {
      "type": "text",
      "text": "# ABC North Queensland\n\n| airdate          = 26 November 1936\n| frequency        = 630 kHz AM\n| area             = North Queensland\n| owner            = Australian Broadcasting Corporation\n| format           = Talk\n| website          = [https://www.abc.net.au/northqld/ www.abc.net.au/northqld/]\n| city             = Townsville, Queensland\n| branding         = ABC North Queensland\n| repeater         =\n| webcast          = [https://www.abc.net.au/res/streaming/audio-live/shout-mp3/local_northqld.pls Live stream]\n| language         = English\n| former_callsigns = 4QN, 630 4QN, 630 ABC North Queensland\n| affiliations     = ABC Local Radio\n}}\nABC North Queensland is an ABC Local Radio station based in Townsville broadcasting to North Queensland. This includes the towns of Bowen, Charters Towers, Ingham and Ayr.\nThe station began broadcasting as 4QN in 1936.  It was originally a relay station covering the whole of North Queensland with limited local news bulletins.  Local program content increased in the 1960s and the station was also the home of regional ABC Television in Townsville, Cairns and Mount Isa.\nBy the 1980s local program content was broadcast for most of the day, as well as a separate regional breakfast program.  4QN was also the headquarters of the regional network.\nJohn Nutting launched the Saturday Night Country show in 1994 from 4QN which is now broadcast nationally.  The Townsville studios were also home to the first Aboriginal and Islander broadcasting in Australia.\nLocal Programs\nWeekdays\n*Breakfast with Michael Clarke – 6:30 AM to 9:00 AM\n*Mornings with Jonathan O'Neill – 9:00 AM to 11:00 AM\nAdditionally, the station is the originating location of the Early Morning Country program between 5:00am – 6:00am weekdays hosted by Michael Clarke. It is heard on the ABC Local Radio regional network through Queensland and also on the ABC Country digital radio station.\nSaturday\n*Saturday Breakfast with Ray Dickson – 6:00 AM to 7:45 AM\n*Northern Grandstand with Grant Bell – 8:30 AM to 10:00 AM\nWhen local programs are not broadcast the station relays national and statewide programming from ABC Radio Brisbane.\nSee also\n* List of radio stations in Australia\nReferences"
    }
  ]
}