{
  "content": [
    {
      "type": "text",
      "text": "# Abel Kingué__disambig_1\n\n| death_place =\n| nationality = Cameroonian\n| other_names =\n| known_for   =\n| occupation  =\n}}\nAbel Kingué (1924 – 16 April 1964) was a political leader in the struggle for the independence of Cameroon from France.\nEarly years\nAbel Kegne (his birth name) was born at Fokoué, near Bamendou in the MENOUA department of West Province, Cameroon in 1924.}} He came from a Bamiléké background. He left home early and went to Dschang to live with Mathieu Yamdjeu, a friend of his father.  He became a ball boy at the tennis club, and was noticed there and enrolled in school. He studied at Dschang, Bafang, Nkongsamba and then at the Nursing School in Ayos.\nUPC militant in Cameroon\nIn 1947 Abel Kingué was working in a large store in Douala, where he met Robert Ekwalla.\nBoth became militants in the Union des Syndicats Confédérés du Cameroun (USCC). In April 1950 he left the store and joined the staff of the Union of the Peoples of Cameroon (UPC) at its first congress in Dschang.\nIn 1951 at Nkongsamba he publicly denounced the political machinations of prince Ndoumbe Douala Manga Bell.\nHe demonstrated that he had great skills as an orator, strong ideological convictions and a great capacity for work and organisation.\nHe was re-elected vice-president of the UPC in September 1952 at its second congress in Eséka.\nHe was also editor of the UPC organ the Voice of Cameroon.\nAbel Kingué was one of the founders of the Democratic Youth of Cameroon (Jeunesse Démocratique du Cameroun – JDC).\nIn December 1953 he represented the JDC at the United Nations.\nOn his return, during his tour to report on his trip, he was attacked at Mbouroukou near Melong, severely wounded and left for dead.\nHe recovered, and in April 1954 ran as a candidate for the Territorial Assembly of Cameroon (Assemblée Territoriale du Cameroun – ATCAM). Despite his great popularity, the colonial administration declared that he was defeated.\nIn April and May 1955 the UPC held a series of angry meetings, circulated pamphlets and organised strikes.\nOn 18 April 1955 Kingué's home, as well as those of the UPC leaders Ruben Um Nyobé and Jacques Ngom, was ransacked and burned.\nOn 25 May 1955 the police opened fire on demonstrators in Loum, Douala, Yaoundé, Ngambé and other places.\nThe following night the police sacked and burned the UPC headquarters in Douala's New Bell quarter.\nThere were perhaps 5,000 victims of the violence at the end of May.\nOn 13 July 1955 the French government dissolved the UPC by decree.\nMost of the UPC leaders moved to Kumba in the British-administered Southern Cameroons to avoid being jailed by the colonial power.\nExile and death\nOn 28 January 1956 the UPC presented its position in a declaration to the international press signed by Félix-Roland Moumié (President), Ruben Um Nyobé (Secretary General) and the two vice-presidents, Ernest Ouandié and Abel Kingué. They called for reunification of French- and British-administered areas as an independent state.\nAbel Kingué chaired a major meeting of the JDC on 8/9 November 1956 in Kumba.\nHe was attacked and left for dead by French commandos who were trying to kill the leaders of the UPC.\nIn July 1957, under pressure from the French, the British authorities in Southern Cameroon deported the leaders of the UPC to Khartoum, Sudan.\nThey moved in turn to Cairo, Egypt, to Conakry, Guinea and finally to Accra, Ghana.\nSuffering from high blood pressure, Kingué led a quiet life while in exile.\nOn 6 September 1962 the UPC leadership in exile met in Accra at Ndeh Ntumazah's house, and decided to exclude the \"criminal clique of Woungly\" from the administrative secretariat.\nAt ten that evening, when the attendees were about to leave, a bomb exploded without causing any injury.\nThe Ghana authorities were not amused and threw the entire UPC leadership in jail.\nIn October they freed Massaga, Tchaptchet and Ntumazah, but kept Abel Kingué in prison.\nOn 13 September 1962 the UPC organised its first Assemblée populaire sous maquis in Mungo, where the Revolutionary Committee was named.\nThe committee was presided over by Ernest Ouandié.\nOther members were Abel Kingué, Michel Ndoh, Ndongo Diyé, Osendé Afana, Nicanor Njiawe and Woungly-Massaga.\nA two-headed leadership was theoretically in place, with Abel Kingué leading the exiles from Ghana and Ernest Ouandié in the maquis.\nThe organisation functioned poorly due to communication problems and also to the Sino-Soviet split.\nThe next year it split, with Abel Kingué and Osendé Afana allied with Ntumazah and opposed to the other leaders.\nAbel Kingué remained imprisoned in Accra until July 1963.  After being released, his medical condition steadily deteriorated, with complications that included behavioural disorders.\nWhile on a mission to Algiers his condition suddenly worsened. Ahmed Ben Bella, President of Algeria, arranged for him to be flown to Cairo for treatment, where he died on 16 April 1964.\nHe was the only UPC leader who did not die a violent death.\nReferences\nNotes\nCitations\nSources\n*\n*\n*  |url=http://www.camer.be/index1.php?art=9740&rub=6:1 |title=Cameroon: Remember Kingue Abel, 16 April 1964 – 16 APRIL 2010 |language=French |work=Camer.be |date=16 April 2010 |access-date=2 August 2012 |archive-url=https://web.archive.org/web/20100418064938/http://www.camer.be/index1.php?art=9740&rub=6:1 |archive-date=18 April 2010 |url-status=dead }}\n*\n*\n*\n*"
    }
  ]
}