{
  "content": [
    {
      "type": "text",
      "text": "# Abhai Singh of Marwar\n\n| death_place  = Ajmer\n| burial_date  =\n| burial_place =\n| occupation   =\n| signature    =\n| religion     = Hinduism\n}}\nAbhai Singh Rathore (7 November 1702 – 18 June 1749) was an 18th-century Indian Raja of the Kingdom of Marwar (Jodhpur). He was also involved in the Khejarli massacre in September 1730, in which 363 Bishnois were killed, trying to peacefully protect a grove of Khejri trees.\nCoronation\nAs a result of a conspiracy between Abhai Singh and his brother, Bakht Singh, their father, Ajit Singh, was killed and Abhai Singh became the Maharaja of the Kingdom of Marwar. He was crowned in 1724, and ruled until 1749.\nMarch against Sarbuland Khan\nPrelude\nWhen an open challenge was made in court, only Abhai Singh took the Bida. On his way to Ahmedabad, Abhai first met the Jaipur prince at Pushkar. Abhai Singh took the route to Sirohi; at the Sirohi border, Thakur Maan Singh of Chandana resisted his forces and died fighting. Later his forces looted Rovada and Posaliya (today near Sumerpur-Pali), where the king of Sirohi, fearing destruction by the large Marwar army, presented his daughter Jas Kanwar in marriage to Abhai Singh. Ram Singh was a scion born of this wedlock.\nBattle of Ahmedabad and role of Kesari Singh Akherajot\nSarbuland Khan's plans of defense are minutely detailed. At each gate, he posted two thousand men and five guns manned by Europeans, and retained a personal guard of European musketeers. The cannonade was sustained for three days on both sides, during which the son of Sarbuland was killed. At length, Abhai Singh's brother Bakht Singh led a siege against the defenders.\nAmong the Marwar forces was a Rajpurohit Sevad Akherajot warrior named Kesari Singh of Khedapa (who was also Rajguru of Abhai Singh). Kesari Singh —along with his brothers, Surajmal Singh Tinwari and Jai Singh Jatiyawas,(all being sons of 'Paatshah' Akheraj Singh of Tinwari) and his sons, Pratap Singh and Anop Singh—participated in the battle.\nKesari Singh ji, having pre-decided to perform saka (a last stand before defeat), was in the foremost row and went into the war with swords in both hands and no shield. Ferociously, he slew enemies with both hands like a lion and was completely covered with blood. The bard Karnidaan Ji, who was present at the battle, likened Kesari Singh ji to the powerful Hindu deity Lord Hanuman as he was completely drenched with blood, just like Lord Hanuman is with vermilion, and describes the sight to be completely awe-inspiring and one of a kind, as Kesari Singh ji seemed to be unstoppable and the worst nightmare for Mughal opposition. However, although he steered the battle towards victory by killing chief enemy commanders, he was immortalised- being one of the rarest and bravest warriors whose body fought even after getting beheaded.\nDuring the bloody siege, both the princely brothers had their share of swordplay, and each slew more than one leader of the noted Amra, who had so often defended Ajmer slew five chiefs of the grades of two and three thousand horse.\nOne hundred and twenty of Abhai Singh's chieftains and five hundred horses were slain, with seven hundred wounded. The next morning, Sarbuland surrendered with all his effects. He was escorted towards Agra, with his wounded Mughals dying at every stage. Thus, in the enlightened half of moon on the victorious tenth VS 1787 (AD 1731)—the day on which Ramachandra captured Lanka—the war against Sarbuland was concluded.\nSource:\nAftermath\nAbhai Singh of Marwar now ruled over 17,000 towns of Gujarat, 9,000 of Marwar, and 1,000 elsewhere. The princes of Idar, Bhuj, Parkar, Sind and Sirohi, the Chalukya Ran of Fatehpur, Jhunjunu, Nagor, Dungarpur, Banswara, Lunawara, and Halwad owed allegiance to Abhai Singh of Marwar.\nThe Champawats bore the brunt and lost Karan of Pali, Kishan Singh of Sandri, Gordhan of Jalor, and Kalyan. The Kumpawats also lost several clan leaders, such as Narsingh, Surtaan Singh, and Padma, son of Durjan. The Jodha tribe lost three leaders: Hayatmall, Ghuman, and Jogidas. The Mertias lost Bhum Singh, Kushal Singh, and Gulab, son of Hathi. The Jadon, Sonigira, Dhondal, and Khichi chieftains also lost many men; even bards and purohits were among the slain.\nBattle of Gangwana\nPrelude\nAbhai Singh sent troops to take over Bikaner from the newly crowned Maharaja Zorawar Singh. Marwar troops reached the gate of Chintamani Fort (now known as Junagadh Fort) during the sacred holiday of Holi. After getting the news that Marwar troops were standing outside his fort, Zorawar Singh sent letters appealing for assistance to Bakht Singh (brother of Abhai Singh, and lord of Nagaur), Raja Jai Singh of Amber, and the Kanot warrior Jagram Singh Rajpurohit (his military advisor from Desalsar village, near Nokha). Bakht Singh responded by writing, \"Since Bikaner was also a Rathore state, thus a collateral branch who would serve Marwar in times of peril.\"\nBakht Singh schemed with Vidyadhar, a minister with Jai Singh of Amber, which resulted in Amber marching against Marwar. After receiving this news, Abhai Singh recalled his troops from Bikaner to prepare for a battle against the troops of Amber and allied Mughal powers. At the time, the Marwar forces had gained a superior position over the defending Bikaner.\nDuring the withdrawal, Maharaja Zorawar Singh was attacked by a soldier but defended by warrior Jagram Singh. Jagram Singh served as principal general of the battle. During the fighting, he was wounded and his intestines came out, but he tightly packed his abdomen with a cloth and fought until all the Marwar troops withdrew from Bikaner. He reached Nagaur and died on the shoulder of the Maharaja, at the age of 21. For the general's loyalty to him, the Maharaja built a cenotaph of him in Chintamani Fort, and gifted a 4,000 bigga of land (named 'Rasisar', adjoining Deshnok) to his son Lunkaran Singh Rajpurohit.\nBattle\nAt the Battle of Gangwana, it was left to Bakht Singh to save Rathore grace, and he did so with only 1,000 Rathores against an army of 100,000 Mughals and Rajputs. Relations were later restored.\nSuccession\nAbhai Singh was succeeded by his son, Ram Singh, who was soon thereafter deposed by his uncle, Bhakt Singh.\nReferences"
    }
  ]
}