{
  "content": [
    {
      "type": "text",
      "text": "# Ablabius (historian)\n\nAblabius (floruit 3rd-5th-century CE) is thought to be either a historian, a geographer or ethnographer,.}} who had written about the Goths, and whose work is cited by the influential 6th century historian of the Goths, Jordanes. Since Jordanes himself states that he based his own work on recollections of reading a work on Gothic history, now lost, composed by Cassiodorus, Ablabius has traditionally been thought of as a source also for the latter work, though this view has met with considerable scepticism.\nDate\nSeveral different dates, all based on inferences both from what Jordanes writes, and the nature of the material he provides from this source, have been suggested for Ablabius's lifetime. Hypotheses have placed him as early as the 3rd century or in the age of Constantine (272–337), or concurrent with Theodosius the Calligrapher (401–450) or with either of two Visigothic kings, Euric (420–484) or his successor Alaricus (458/466–507).\nAblabius's origins – whether he was a Goth, a Greek or a Roman, are unknown.\nTextual Fragments\nIn his Getica (550-551 CE)  Jordanes cites him on three occasions.\nFragment 1 at Getica 4.28\n* 'So this part of the Goths is said to have crossed the river and migrated to the country of Oium with Filemer, and they acquired the land they desired. They came immediately to the nation of the Spali, joined in battle with them, gained a victory, and from there, like conquerors, hastened to the furthest part of Scythia, which is close to the Pontic Sea. Thus it is generally celebrated in their ancestral songs (in priscis eorum carminibus), in a manner that is almost historical. Ablabius, the distinguished surveyor of the Gothic race, also attests to this in his most trustworthy history..\" }}\nFragment 2 at Getica 14.82\n* 'Now Ablabius the historian relates that in Scythia, where we have said that they were dwelling above an arm of the Pontic Sea, part of them who held the eastern region and whose king was Ostrogotha, were called Ostrogoths, that is, eastern Goths, either from his name or from the place. But the rest were called Visigoths, that is, the Goths of the western country.'\" }}\nFragment 3 at Getica 23.117\n* 'But though famous for his conquest of so many races, he gave himself no rest until he had slain some in battle and then reduced to his sway the remainder of the tribe of the Heruli, whose chief was Alaric. Now the aforesaid race, as the historian Ablabius tells us, dwelt near Lake Maeotis in swampy places which the Greeks call helē.; hence they were named Heruli. They were a people swift of foot, and on that account were the more swollen with pride',\" }}\nThis fragment is close to a similar passage in Dexippus.\nEvaluations\nThe evidence from Jordanes suggests that he was not quoted for historical details concerning the Goths: the three fragments indicate the writer's interest in ethnographic details, such as the origins and names of barbarian tribes, and Goths, in the region of Scythia.\nIt has been suggested that the work of Ablabius was the first written history of the Goths, and that this formed the basis of a more detailed account written by Cassiodorus. It is likely that Jordanes used the work of Ablabius directly, but an intermediate source can not be ruled out either. According to Jordanes the work of Ablabius relied on folk songs and legends.\nNotes\nCitations\nSources\n*\n*\n*\n*\n*\n*"
    }
  ]
}