{
  "content": [
    {
      "type": "text",
      "text": "# Abu Isa al-Warraq\n\n| known            = Writer\n| era              = Abbasid era\n}}\nAbu Isa al-Warraq, full name Abū ʿĪsā Muḥammad ibn Hārūn al-Warrāq (, died 861–2 AD/247 AH), was a 9th-century Arab scholar. He is cited as a critic of Christianity but also of Islam. He was a mentor and friend of scholar Ibn al-Rawandi in whose work The Book of the Emerald he appears.\nBiography\nThere are conflicting accounts of al-Warraq's life and even of his core beliefs. His birthplace and birth year are unknown. Al-Masudi writes that he died in 247 AH (861–2 AD) in a quarter of Baghdad called Ramla. Al-Shahrastani quotes him as still writing in 271 AH (884–5 AD). Ibn al-Jawzi writes that he was imprisoned in Baghdad in 298 AH (910–1 AD), which seems exceedingly late. Various writers from long after his death refer to him as a Shia, a Mu'tazili, or even as a convert to Manichaeanism, with no consensus as to his ultimate religious views. Al-Shahrastani, a late source, condemns him as a majus. No medieval source describes him as an atheist. In his own surviving writings, al-Warraq describes Christians as having acquired false ideas from \"the accursed atheists.\"\nCritique of Christianity\nFew Arab scholars of the period directly engaged with Christianity, partially due to a lack of access to Christian scriptures in Arabic, and partially due to a belief that Christian documents were defective and unfruitful to study. Al-Warraq wrote Radd ʿalā al-thalāth firaq min al-Naṣārā (\"The Refutation of three Christian sects\"), one of the most detailed attacks on Christianity of the period, where he shows unusual familiarity with Christian theology and history. He criticizes the conflicting notions of the incarnation of Jesus as contradictory, that he was both human and divine. He cites how Christian denominations themselves have struggled and disagreed with each other on the meaning of the incarnation and the Trinity.\nAlleged dualist views\nAl-Qadi Abd al-Jabbar and Ibn al-Rawandi claimed that al-Warraq wrote a book under a (perhaps Manichaean) pseudonym which endorsed dualism. In this book, which no longer survives, al-Warraq allegedly condemned religious commandments as originating a false demiurge. Al-Rawandi quotes al-Warraq as saying, \"He who orders his slave to do things that he knows him to be incapable of doing, then punishes him, is a fool.\"\nDebate with al-Rawandi\nIn The Book of the Emerald, which also survives only in extracts, al-Rawandi imagined a debate with al-Warraq. In the depicted debate, al-Warraq challenged the notion that more than one prophet could exist. He argued that a prophet is unnecessary to establish that which human reason could itself demonstrate, and that we should not heed the claims of self-appointed prophets, if what is claimed is found to be contrary to good sense and reason. Al-Warraq admired the intellect not for its capacity to submit to a god, but rather for its inquisitiveness towards the wonders of science. He explained that people developed the science of astronomy by gazing at the sky, and that no prophet was necessary to show them how to gaze; he also said that no prophets were needed to show them how to make flutes, either, or how to play them.\nAl-Rawandi also depicts al-Warraq as doubting claims portraying Muhammad as a prophet:\nWithin the context of al-Rawandi's work, this depiction of a debate serves the function of demonstrating the existence of a class of people called Brāhima, who argued that divine laws could never be abrogated.\nScholarship\nIn the 1999 book Freethinkers of Medieval Islam, Sarah Stroumsa depicted al-Warraq as a \"freethinker\" rather than a Manichaean. Probably based on this book, a modern critic of Islam, Ibn Warraq, derived his pseudonym from al-Warraq. Syed Nomanul Haq objected that Stroumsa's \"freethought\" is an anachronistic category, and that in order to apply it to medieval thinkers, she had to warp it to include acceptance of divine prophecy.\nReferences"
    }
  ]
}