{
  "content": [
    {
      "type": "text",
      "text": "# Acacia hockingsii\n\nAcacia hockingsii, also known as '''Hocking's wattle', is a shrub belonging to the genus Acacia and the subgenus Phyllodineae that is native to parts of north eastern Australia.\nDescription\nThe glabrous and viscid shrub typically grows to a height of up to  and has a rounded habit and reddish-coloured young shoots. It has phyllodes rather than true leaves. The ascending to erect phyllodes have a narrowly linear shape and are shallowly curved to shallowly sigmoid. The green phyllodes have a length of  and a width of  and are narrowed towards the base with an obvious midrib and obscure. When it blooms it produces simple inflorescences that occur singly in the axils with spherical flower-heads containing 30 golden-coloured flowers. The seed pods that form after flowering have narrowly oblong to linear shape and are convex over the seeds. The firmly chartaceous pods have a length of up to  and a width of . The seeds inside are arranged longitudinally and have an oblong-elliptic to ovate shape with a length of  with the funicle folded below the oblique aril.\nTaxonomy\nIt belongs to the Acacia johnsonii group along with Acacia eremophiloides, Acacia gnidium and Acacia ixodes but can be distinguished by its longer phyllodes. Another member of the group, Acacia islana is also only found in the Isla Gorge and but with much shorter phyllodes. It also resembles Acacia sabulosa.\nDistribution\nThe shrub has a limited distribution on the Isla Gorge National Park area of the Central region of Queensland where it is found on sandstone plateaus growing in skeletal sandy soils among Eucalyptus woodland communities. Its range extends through the central highlands from around Taroom. Originally the species was thought to exist in only three populations within the Isla Gorge National Park but other plants have been found south of Isla Gorge beyond the border of the Wondekai Nature Reserve with more plants located in the Palmgrove National Park.\nSee also\n* List of Acacia'' species\nReferences"
    }
  ]
}