{
  "content": [
    {
      "type": "text",
      "text": "# Academy Juvenile Award\n\nThe Academy Juvenile Award, also known informally as the Juvenile Oscar, was a Special Honorary Academy Award bestowed at the discretion of the Board of Governors of the Academy of Motion Picture Arts and Sciences (AMPAS) to specifically recognize juvenile performers under the age of eighteen for their \"outstanding contribution[s] to screen entertainment\".\nThe honor was first awarded by the academy at the 7th Academy Awards to 6-year-old Shirley Temple for her work in motion pictures of 1934.  The Award continued to be presented intermittently over the next 26 years to a total of 12 child actors and actresses, with the last Juvenile Oscar presented at the 33rd Academy Awards to 14-year-old Hayley Mills who received the child-size statuette for her performance in the 1960 film Pollyanna.\nThe trophy itself was a miniature Academy Award statuette standing an estimated seven inches tall (depending upon variations to its base over time), approximately half the height of the standard 13.5 inch tall Oscar trophy.\nHonorary Academy Awards\nIn addition to its competitive Academy Awards of Merit, the Academy of Motion Picture Arts and Sciences (AMPAS) also presents \"Special\" or \"Honorary\" Academy Awards.  These awards are given (typically, annually) by the Board of Governors of AMPAS to celebrate motion picture achievements that are not covered by other existing Academy Awards categories.  This included the awards that had been presented to juvenile actors from 1934 to 1960 (known only informally as the \"Juvenile Academy Awards\").\nBeginning with the 1st Academy Awards  celebrating film achievements of 1927 and 1928  these awards were formally referred to as \"Special Awards\".  The first of these Special Awards was presented to Charles Chaplin (for The Circus) and to Warner Bros. (for The Jazz Singer).  Beginning with the 23rd Academy Awards  celebrating film achievements of 1950  these Special Awards were formally renamed by the academy as \"Honorary Awards\".  These Honorary Awards continue to be presented today, although the \"Juvenile Academy Award\" proper has itself been discontinued.\nHistory of the Academy Juvenile Award\nThe Academy Awards, first presented on May 16, 1929, did not initially present a Special Award for juvenile actors.  The very first child actor to be nominated for an Oscar was 9-year-old Jackie Cooper, who was nominated as Best Actor in 1931 for his work in the film Skippy.  Cooper, however, lost that year to Lionel Barrymore.  Recognizing that children could be placed at a disadvantage in the hearts and minds of Academy voters when nominated alongside their adult counterparts in the competitive Best Actor and Best Actress categories  and with no categories for Best Supporting Actor or Supporting Actress having yet been created  the academy saw the need to establish an Honorary \"Special Award\" specifically to recognize juveniles under the age of eighteen for their work in film.\nOn February 27, 1935, the 7th Annual Academy Awards, honoring achievements in film for the year 1934, became the first Oscar ceremony at which the Special Juvenile Award was presented.  Playfully dubbed the \"Oscarette\" by Bob Hope in 1945, the statuette itself was a miniaturized Oscar, depicting an Art Deco image of a knight holding a crusader's sword and standing on a reel of film.  Standing approximately one-half the size of its full-sized counterpart, this rare child-sized trophy remained the prototype for the statuette throughout the history of the Award, with only relatively small modifications to its base over time.\nAfter first being presented in 1935, the Special Juvenile Award continued to be presented intermittently to a total of 12 young actors and actresses over the next 26 years.  However, there were several juvenile actors who were instead nominated in the competitive Best Supporting Actor/Actress categories during this time.  These included, most notably: 14-year-old Bonita Granville as Best Supporting Actress of 1936 for These Three; 11-year-old Brandon deWilde as Best Supporting Actor of 1953 for Shane; 17-year-old Sal Mineo as Best Supporting Actor of 1955 for Rebel Without a Cause; and 11-year-old Patty McCormack as Best Supporting Actress of 1956 for The Bad Seed.  All of these nominees, however, lost to their adult counterparts in their respective categories.\nHeld on April 17, 1961, the 33rd Annual Academy Awards, honoring achievements in film for the year 1960, was the last Oscar ceremony at which the Honorary Juvenile Award was presented.\nHonorees of the Academy Juvenile Award\n1930s\nwith James Dunn in Bright Eyes (1934)]]\nwith canine co-star Terry in The Wizard of Oz (1939)]]\nThe 7th Annual Academy Awards recognized Shirley Temple with the academy's first Juvenile Award to honor \"her outstanding contribution to screen entertainment during the year 1934.\"  Beginning her film career at the age of three, in 1934 Temple had attained child stardom in such films as Stand Up and Cheer!, Little Miss Marker, Baby Take a Bow and Bright Eyes.  Six years old on the night she accepted her honorary statuette, Temple is the youngest recipient ever to be honored by the academy.\nThe 11th Annual Academy Awards recognized both Deanna Durbin and Mickey Rooney with the Juvenile Award honoring \"their significant contribution in bringing to the screen the spirit and personification of youth\".  By 1938, 16-year-old Durbin was a rising star as the singing ingenue in such films as Mad About Music and That Certain Age, while Rooney had risen to fame in the Andy Hardy comedies and received critical acclaim for his dramatic turn in Boys Town.  Eighteen years old on the night he accepted the accolade, Rooney was the oldest recipient ever to be honored with the academy's Juvenile Award.\nThe 12th Annual Academy Awards recognized Judy Garland with the Juvenile Award honoring \"her outstanding performance as a screen juvenile during the past year\".  In 1939, 16-year-old Garland had become one of Hollywood's brightest young stars, appearing that year in the MGM musicals Babes in Arms and The Wizard of Oz.  Although she was nominated for an Academy Award as Best Actress of 1954, and again as Best Supporting Actress of 1961, the Juvenile Award was the only honor Garland received from the academy.\n1940s\nwith Judy Garland in Meet Me in St. Louis (1944)]]\nwith Jane Wyman and Gregory Peck in The Yearling (1946)]]\nThe 17th Annual Academy Awards recognized Margaret O'Brien with the Juvenile Award honoring her as \"outstanding child actress of 1944\".  That year, 7-year-old O'Brien had become one of the most popular child actresses of her day, starring in the films The Canterville Ghost, Music for Millions, and Meet Me In St. Louis alongside former Juvenile Award Honoree Judy Garland.  Hosting the Annual ceremony that year was Bob Hope who dubbed the Juvenile Award the \"Oscarette\" upon presenting O'Brien with her miniature Oscar.\nThe 18th Annual Academy Awards recognized Peggy Ann Garner with the Juvenile Award honoring her as \"outstanding child actress of 1945\".  Beginning her prolific film career at the age of six, in 1945, 13-year-old Garner appeared in Nob Hill and Junior Miss, as well as receiving critical acclaim for her dramatic role as Francie Nolan, a girl living in the Brooklyn slums with her devoted mother and alcoholic father in the 20th Century Fox drama, A Tree Grows in Brooklyn.\nThe 19th Annual Academy Awards recognized Claude Jarman Jr. with the Juvenile Award honoring him as \"outstanding child actor of 1946\".  Twelve&nbsp;years old in 1946, Jarman was honored with the Juvenile Oscar for his screen debut as Jody in the MGM family drama, The Yearling, which was presented to him by former recipient Shirley Temple. Although the academy did not officially begin to present the Juvenile Award for a child's work in a specific film until two years later, The Yearling was Jarman's first and only film released in 1946.\nThe 21st Annual Academy Awards recognized Ivan Jandl with the Juvenile Award honoring him for \"the outstanding juvenile performance of 1948, as 'Karel Malik' in \"The Search\".  Born in Czechoslovakia, and beginning his relatively brief film career in 1948 at the age of eleven, Jandl was the first foreign child actor to be honored with the Juvenile Oscar.  Unable to travel to the United States to attend the ceremony, Jandl's statuette was instead presented to him in his native Prague.\nThe 22nd Annual Academy Awards recognized Bobby Driscoll with the Juvenile Award honoring him as \"the outstanding juvenile actor of 1949\".  That year, 12-year-old Driscoll had starred in the Disney tear-jerker So Dear to My Heart, as well as garnering critical acclaim for his dramatic performance in the RKO melodrama The Window. Demonstrating the prestige the Honorary Juvenile Award held for Hollywood child stars of the time, on the night of the ceremony, Driscoll nervously accepted his miniature statuette saying, \"I don't ever think I've been so thrilled in my life.\"\n1950s1960\nThe 27th Annual Academy Awards recognized both Jon Whiteley and Vincent Winter with the Juvenile Award honoring their \"outstanding juvenile performance(s) in The Little Kidnappers\".  Perhaps best known to audiences in their native Scotland, in 1953, Whiteley, age 8, and Winter, age 6, played Harry and Davy respectively, two boys living with their grandfather in Nova Scotia who, forbidden by their grandfather to have a dog, \"kidnap\" an unattended baby and care for the child as their own in the British produced family drama.\nThe 33rd Annual Academy Awards recognized Hayley Mills with what would be the last Juvenile Award, honoring her performance in Pollyanna as \"the most outstanding juvenile performance during 1960\".  Making her acting debut at the age of twelve alongside her father John Mills in the 1959 crime thriller Tiger Bay, in 1960, 13-year-old Mills made her Disney debut as the titular Pollyanna which also earned her a BAFTA Award nomination that same year as \"Best British Actress\".\nList of honorees\n{| class=\"wikitable sortable\" style=\"text-align: center\"\n! colspan=5 align=center style=\"background:#EEDD82\"| Honorees of the Academy Juvenile Award19341960\n|-\n|-style=\"height: 3.2em;\"\n! style=\"background-color:#F5F5DC; width:100px;\" | Year\n! style=\"background-color:#F5F5DC; width:100px;\" | Ceremony\n! style=\"background-color:#F5F5DC; width:150px;\" | Name\n! style=\"background-color:#F5F5DC; width:150px;\" | Age\n! style=\"background-color:#F5F5DC; width:800px;\" | Honor\n|-\n|-style=\"background-color:#EEDD82; height:3.2em;\"\n| 1934\n|  data-sort-value=\"07\" | 7th\n|\n|\n| align=\"left\"style=\"padding-left: 2em;\"| To Shirley Temple, in grateful recognition of her outstanding contribution to screen entertainment during the year 1934.\n|-\n|-style=\"background-color:#F5F5DC\"\n| rowspan=\"2\" | 1938\n| rowspan=\"2\" | 11th\n|\n|\n| rowspan=\"2\" align=\"left\"style=\"padding-left: 2em;\"| To Deanna Durbin and Mickey Rooney for their significant contribution in bringing to the screen the spirit and personification of youth, and as juvenile players setting a high standard of ability and achievement.\n|-style=\"background-color:#F5F5DC\"\n|\n| style=\"white-space:nowrap;\"|\n|-\n|-style=\"background-color:#EEDD82; height:3.2em;\"\n| 1939\n|  data-sort-value=\"12\" | 12th\n|\n|\n| align=\"left\"style=\"padding-left: 2em;\"| To Judy Garland for her outstanding performance as a screen juvenile during the past year.\n|-\n|-style=\"background-color:#F5F5DC; height:3.2em;\"\n| 1944\n|  data-sort-value=\"17\" | 17th\n|\n|\n| align=\"left\"style=\"padding-left: 2em;\"| To Margaret O'Brien, outstanding child actress of 1944.\n|-\n|-style=\"background-color:#EEDD82; height:3.2em;\"\n| 1945\n|  data-sort-value=\"18\" | 18th\n| style=\"white-space:nowrap;\"|\n|\n| align=\"left\"style=\"padding-left: 2em;\"| To Peggy Ann Garner, outstanding child actress of 1945.\n|-\n|-style=\"background-color:#F5F5DC; height:3.2em;\"\n| 1946\n|  data-sort-value=\"19\" | 19th\n|\n|\n| align=\"left\"style=\"padding-left: 2em;\"| To Claude Jarman, Jr., outstanding child actor of 1946.\n|-\n|-style=\"background-color:#EEDD82; height:3.2em;\"\n| 1948\n|  data-sort-value=\"21\" | 21st\n|\n|\n| align=\"left\"style=\"padding-left: 2em;\"| To Ivan Jandl, for the outstanding juvenile performance of 1948, as \"Karel Malik\" in The Search.\n|-\n|-style=\"background-color:#F5F5DC; height:3.2em;\"\n| 1949\n|  data-sort-value=\"22\" | 22nd\n|\n|\n| align=\"left\"style=\"padding-left: 2em;\"| To Bobby Driscoll, as the outstanding juvenile actor of 1949.\n|-\n|-style=\"background-color:#EEDD82; height:3.2em;\"\n| rowspan=\"2\" | 1954\n| rowspan=\"2\" data-sort-value=\"27\" | 27th\n|\n|\n| align=\"left\"style=\"padding-left: 2em;\"| To Jon Whiteley for his outstanding juvenile performance in The Little Kidnappers.\n|-style=\"background-color:#EEDD82; height:3.2em;\"\n|\n|\n| align=\"left\"style=\"padding-left: 2em;\"| To Vincent Winter for his outstanding juvenile performance in The Little Kidnappers.\n|-\n|-style=\"background-color:#F5F5DC; height:3.2em;\"\n| 1960\n|  data-sort-value=\"33\" | 33rd\n|\n|\n| align=\"left\"style=\"padding-left: 2em;\"| To Hayley Mills for Pollyanna, the most outstanding juvenile performance during 1960.\n|-\n|- class=\"sortbottom\"\n! style=\"background-color:#EEDD82 |  10                Years\n! style=\"background-color:#EEDD82 |  10                Ceremonies\n! style=\"background-color:#EEDD82 |  12                Honorees\n! style=\"background-color:#EEDD82 |  13                Average Age\n! style=\"background-color:#EEDD82 |  Column Totals\n|-\n|}\n; Notes\nPost-juvenile era\nIn 1962, 16-year-old Patty Duke starred in The Miracle Worker and in 1963, was nominated for and won the Academy Award for Best Supporting Actress for her work in the film, becoming the youngest actress at the time to win an Academy Award of merit and, for the first time, demonstrating that a juvenile could win in a competitive category. From this point onward, child actors were recognized in competitive categories alongside their adult counterparts, or not at all.\n, a total of three minors (including Duke) have won Oscars, all in the Best Supporting Actress category. The other two are Tatum O'Neal, who was 10, for Paper Moon (1973), and Anna Paquin, who was 11, for The Piano (1993). , O'Neal remains the youngest person to win a competitive Academy Award.\nLost, stolen and found\nLost Garland award\nJudy Garland had reportedly lost her award over the years, and in June 1958 contacted the academy to obtain a replacement at her own expense.  The academy obliged, but asked Garland to sign its well-known right of first refusal agreement covering the duplicate Oscar as well as her original, should it ever turn up.  The agreement, put into implementation by the academy in 1950, states that Oscar recipients or their heirs who want to sell their statuettes must first offer the academy the opportunity to buy the Oscar back for the sum of $10. (An amount which was subsequently dropped to $1 in the 1980s.)\nAfter her death in 1969, many of Garland's personal effects came into the possession of her former husband, Sidney Luft who attempted to sell a miniature Oscar statuette at a Christie's auction in 1993.  Upon learning of the impending auction, the academy quickly filed a legal injunction to halt the sale of the Award and, after some research, determined that the statuette in question was Garland's 1958 replacement Oscar, using photographs that showed the original 1940 statuette's unique base differed from the one being put up for auction.  The courts ruled in the academy's favor in 1995 and ordered Luft to return the 1958 statuette to the academy; prompting Luft to instead turn the award over to daughter Lorna Luft who had expressed a desire to keep it in the family.\nIn 2000, a second statuette was put up for auction, which the academy determined this time to be Garland's long-lost \"original\" 1940 Oscar.  After once again tracing the auction back to Sidney Luft, the academy again took legal action to halt the sale claiming the 1940 statuette fell under the terms of the agreement Garland had signed in 1958.  The academy again won its lawsuit in 2002 and Luft was ordered to turn the 1940 statuette over to the academy.  In February 2010, Garland's original 1940 Juvenile Oscar was put on display to the public at an exhibit held by the academy in New York City called \"Meet The Oscars\".  , its 1958 replacement is believed to still be in the possession of Garland's heirs.\nStolen O'Brien award\nThroughout her childhood, Margaret O'Brien's awards were displayed in a special room.  One day in 1954, the family's maid asked to take O'Brien's Juvenile Oscar and two other awards home with her to polish, as she had done in the past.  After three days, the maid failed to return to work, prompting O'Brien's mother to discharge her, requesting that the awards be returned.  Shortly thereafter, O'Brien's mother, who had been sick with a heart condition, suffered a relapse and died. In mourning, 17-year-old O'Brien forgot about the maid and the Oscar until several months later when she tried to contact her, only to find that the maid had moved and had left no forwarding address.\nSeveral years later, upon learning that the original had been stolen, the academy promptly supplied O'Brien with a replacement Oscar, but O'Brien still held onto hope that she might one day recover her original Award.  In the years that followed, O'Brien attended memorabilia shows and searched antique shops, hoping she might find the original statuette, until one day in 1995 when Bruce Davis, then executive director of the Academy, was alerted that a miniature statuette bearing O'Brien's name had surfaced in a catalogue for an upcoming memorabilia auction.  Davis contacted a mutual friend of his and O'Brien's, who in turn phoned O'Brien to tell her the long-lost Oscar had been found.\nMemorabilia collectors Steve Neimand and Mark Nash were attending a flea market in 1995 when Neimand spotted a small Oscar with Margaret O'Brien's name inscribed upon it.  The two men decided to split the $500 asking price hoping to resell it at a profit and lent it to a photographer to shoot for an upcoming auction catalogue.  This led to Bruce Davis' discovery that the statuette had resurfaced and, upon learning of the award's history, Nash and Neimand agreed to return the Oscar to O'Brien.  On February 7, 1995, almost fifty years after she had first received it, the academy held a special ceremony in Beverly Hills to return the stolen award to O'Brien. Upon being reunited with her Juvenile Oscar, Margaret O'Brien told the attending journalists:\nStolen Mills award\nHayley Mills was in California filming a television series in the late 1980s. When she returned home to London, her Oscar was gone. As Mills was the last person to win a miniature Oscar, she was told the mold had been broken and a new one could not be made. In 2022, Academy president David Rubin surprised Mills with a full sized replacement Oscar statuette.\nSee also\n* Academy Award (Oscar)\n* Academy of Motion Picture Arts and Sciences (AMPAS)\n* Child actor\n* Honorary Academy Award\n* List of oldest and youngest Academy Award winners and nominees\n* Young Artist Award\nReferences\nExternal links\n* [https://www.oscars.org/oscars/awards-databases-0 Official Awards Databases] at the Academy of Motion Picture Arts and Sciences"
    }
  ]
}