{
  "content": [
    {
      "type": "text",
      "text": "# Academy of Medical Educators, United Kingdom\n\n| location = Cardiff University School of Medicine, Neuadd Meirionnydd, Heath Park, Cardiff CF14 4YS\n| leader_title = President\n| leader_name = Nick Cooper\n| mission =\n| motto =\n| homepage =\n}}\nThe Academy of Medical Educators (AoME) is a multi-professional body which is the standard setting body for clinical teachers in the United Kingdom. It was formed in 2006 and has developed recognised frameworks for educators.\nActivities\nThe academy has stated aims which relate to the advancement of medical education for the public benefit. This includes developing a transparent career structure for specialist medical educators.\nThe academy funds some research, including gathering evidence in support of their policies.\nHistory\nThe academy was established in October 2006. It became the first professional organisation for medical educators which was designed to offer career support to members through a registerable qualification and professional accreditation. By January 2008, the academy had internal governance structures in place.\nThe academy published the first professional standards for medical educators in 2009. The standards were revised in 2012 and then again in 2015.\nThe General Medical Council (GMC) have adopted the AoME's \"Framework for Supervisors\" (2010), as the framework for the criteria which all trainers in recognised roles will be expected to provide evidence of their ongoing professional development against.\nMembership\nMembers are entitled to use the post nominals MAcadMEd and fellows may use FAcadMEd.\nFull membership can also be gained where individuals have gained certain educational qualifications from an institution that is accredited by AoME.\nSome medical colleges have an arrangement where they are corporate partners with the academy.\nList of presidents\n* 2007–2011 Professor John Bligh\n* 2011–2014 Sean Hilton\n* 2014–2017 Derek Gallen\n* 2017- Jacky Hayden\n* 2023- Nick Cooper\nGovernance\nOn 12 October 2006, the academy became a Company Limited by Guarantee with Companies' House (Company number 5965178). It registered as a charity with the Charity Commission for England and Wales on 2 April 2009.\nThe academy is governed by a Council of Trustees, who are also the Directors of the company. There are 18 members of Council (16 of whom are elected by the members of the academy) including Honorary Officers whose have roles in providing strategic advice.\nReferences\nExternal links\n*"
    }
  ]
}