{
  "content": [
    {
      "type": "text",
      "text": "# Academy Awards__disambig_1\n\n| pending_awards =\n| pending_date =\n| next_awards = 98th Academy Awards\n| next_date =\n| image = Oscars logo.svg\n| image_size = 270\n| image2 =\n| alt =\n| caption = The Oscars logo\n| caption2 =\n| awarded_for = Excellence in the film industry\n| presenter = Academy of Motion Picture Arts and Sciences\n| country = United States\n| firstawarded =\n| network =\n| website =\n}}\nThe Academy Awards, commonly known as the Oscars, are awards for artistic and technical merit in film. They are presented annually by the Academy of Motion Picture Arts and Sciences (AMPAS) in the United States in recognition of excellence in cinematic achievements, as assessed by the Academy's voting membership. The Oscars are widely considered to be the most prestigious awards in the film industry.\nThe major award categories, known as the Academy Awards of Merit, are presented during a live televised Hollywood ceremony in February or March. It is the oldest worldwide entertainment awards ceremony. The 1st Academy Awards were held in 1929. The second ceremony, in 1930, was the first to be broadcast by radio, and the 1953 ceremony was the first to be televised. It is the oldest of the four major annual American entertainment awards. Its counterparts — the Emmy Awards for television, the Tony Awards for theater, and the Grammy Awards for music — are modeled after the Academy Awards.\nThe Oscar statuette depicts a knight, rendered in the Art Deco style.\nHistory\nThe first Academy Awards presentation was held on May 16, 1929, at a private dinner function at the Hollywood Roosevelt Hotel, with an audience of about 270 people.\nThe post-awards party was held at the Mayfair Hotel. The cost of guest tickets for that night's ceremony was  (). Fifteen statuettes were awarded, honoring artists, directors, and other participants in the film-making industry of the time, for their works during the 1927–28 period. The ceremony ran for 15minutes.\nFor this first ceremony, winners were announced to the media three months earlier. For the second ceremony in 1930, and the rest of the first decade, the results were given to newspapers for publication at 11:00pm on the night of the awards. In 1940, the Los Angeles Times announced the winners before the ceremony began. As a result, in 1941 the Academy started using a sealed envelope to reveal the names of the winners.\nThe term \"Oscar\" is a registered trademark of the AMPAS.\nMilestones\nThe first Best Actor awarded was Emil Jannings, for his performances in The Last Command and The Way of All Flesh. As he had to return to Europe before the ceremony, the Academy agreed to give him the prize early, making him the first Academy Award recipient. For the first Awards, winners were recognized for multiple films during the qualifying period; Jannings received the award for two films in which he starred, and Janet Gaynor won the first Best Actress award for performances in three films. Beginning with the second ceremony, performers received separate nominations for individual films; no performer has received multiple nominations in the same category since the 3rd Academy Awards.\nFor the first five ceremonies, the eligibility period ran from August 1 to July 31. The 6th Academy Awards' eligibility ran from August 1, 1932, to December 31, 1933, and as of the 7th Academy Awards, subsequent eligibility periods have matched the calendar year (with the exception of the 93rd Academy Awards, which, due to the COVID-19 pandemic, extended the eligibility period to February 28, 2021).\nBest Foreign Language Film, now known as Best International Feature Film, was introduced at the 20th Academy Awards as a special award, and became a competitive category at the 29th Academy Awards.\nThe 74th Academy Awards, held in 2002, presented the first Academy Award for Best Animated Feature, won by Shrek.\nSince 1973, all Academy Awards ceremonies, except for 2021, have ended with the Academy Award for Best Picture. Traditionally, the previous year's winners for Best Actor and Best Supporting Actor present the awards for Best Actress and Best Supporting Actress, respectively, and vice versa. In 2009, this model was replaced by each acting award being introduced by five previous winners, each of whom introduces one of the nominated performances, referred to as the \"Fab 5\" presenters format. The Fab 5 model returned in 2024 after a 15-year hiatus.\nOn February 9, 2020, Parasite became the first foreign-language film to win Best Picture at the 92nd Academy Awards.\nThe 93rd Academy Awards ceremony, honoring the best films of 2020 and early 2021, was held on April 25, 2021, after it was postponed from its original February 28, 2021, schedule due to the impact of the COVID-19 pandemic on cinema. As with the two previous ceremonies, there was no host. The ceremony was broadcast on ABC. It took place at the Dolby Theatre in Los Angeles, California for the 19th consecutive year, with satellite locations at Union Station also in Los Angeles. Because of the virus impact on films and TV industries, Academy president David Rubin and CEO Dawn Hudson announced that for the 2021 Oscar Ceremony, streaming films with a previously planned theatrical release were eligible. The theatrical requirement was reinstated starting with the 95th Academy Awards.\nOscar statuette\nOverview\nThe Oscar statuette, officially the Academy Award of Merit, is given to winners of each year's awards. Made of gold-plated bronze on a black metal base, it is  tall, weighs  and depicts a knight rendered in Art Deco style holding a sword standing on a reel of film with five spokes. The five spokes represent the original branches of the Academy: Actors, Writers, Directors, Producers, and Technicians.\n]]\nSculptor George Stanley, who also did the Muse Fountain at the Hollywood Bowl, sculpted Cedric Gibbons' design. The statuettes presented at the initial ceremonies were gold-plated solid bronze. Within a few years, the bronze was abandoned in favor of Britannia metal, a pewter-like alloy that is then plated in copper, nickel silver, and finally, 24-karat gold. Due to a metal shortage during World War II, Oscars were made of painted plaster for three years. Following the war, the Academy invited recipients to redeem the plaster figures for gold-plated metal ones.\nThe only addition to the Oscar since it was created is a minor streamlining of the base. The original Oscar mold was cast in 1928 at the C.W. Shumway & Sons Foundry in Batavia, Illinois, which also contributed to casting the molds for the Vince Lombardi Trophy and Emmy Award statuettes. During the 1970s, the Oscar statues were cast in Crystal Lake, Illinois. From 1983 to 2015, approximately 50 Oscars in a tin alloy with gold plating were made each year in Chicago by Illinois manufacturer R.S. Owens & Company. It would take between three and four weeks to manufacture 50 statuettes.\nIn 2016, the Academy returned to bronze as the core metal of the statuettes, handing manufacturing duties to Walden, New York-based Polich Tallix Fine Art Foundry, now owned and operated by UAP Urban Art Projects. While based on a digital scan of an original 1929 Oscar, the statuettes retain their modern-era dimensions and black pedestal. Cast in liquid bronze from 3D-printed ceramic molds and polished, they are then electroplated in 24-karat gold by Brooklyn, New York-based Epner Technology. The time required to produce 50 such statuettes is roughly three months. R.S. Owens is expected to continue producing other awards for the Academy, and service existing Oscars that need replating.\nNaming\nThe origin of the nickname of the trophy has been disputed, as multiple people have taken credit for naming the trophy \"Oscar\".\nMargaret Herrick, librarian and president of the Academy, may have said she named it after her supposed uncle Oscar in 1931.He reminds me of my Uncle Oscar,' she was reported to have said, while in the hearing of a 'nearby newspaper columnist' who picked up the anecdote and ran with it the next day\". Variety and The Hollywood Reporter state with certainty that she made a claim to the Oscar nickname.}} The only corroboration was a 1938 clipping from the Los Angeles Examiner, in which Herrick told a story of her and her husband joking with each other using the phrase, \"How's your uncle Oscar\".\nBette Davis, in her 1962 autobiography, claimed she named it in 1936 after her first husband, Harmon Oscar Nelson, of whom the statue's rear end reminded her. But the term had been in use at least two years before. In a 1974 biography written by Whitney Stine with commentary from Davis, Davis wrote, \"I relinquish once and for all any claim that I was the one—so, Academy of Motion Picture Arts and Sciences, the honor is all yours.\"\nColumnist Sidney Skolsky wrote in his 1970 memoir that he came up with the term in 1934 under pressure for a deadline, mocking Vaudeville comedians who asked \"Will you have a cigar, Oscar?\" The Academy credits Skolsky with \"the first confirmed newspaper reference\" to Oscar in his column on March 16, 1934, which was written about that year's 6th Academy Awards. But in the newspaper clipping that Skolsky referred to, he wrote that \"these statues are called 'Oscars, meaning that the name was already in use.\nIn 2021, Brazilian researcher Waldemar Dalenogare Neto contradicted Skolsky's claim to have used the term first, finding the probable first public mention of the name \"Oscar\" in journalist Relman Morin's \"Cinematters\" column in the Los Angeles Evening Record on December 5, 1933. Since the awards didn't take place that year, he said: \"What's happened to the annual Academy banquet? As a rule, the banquet and the awarding of \"Oscar\", the bronze statuette given for best performances, is all over long before this.\"\nBruce Davis, a former executive director of the Academy, credited Eleanore Lilleberg, a secretary at the Academy when the award was first introduced, for the nickname. She had overseen the pre-ceremony handling of the awards. Davis credits Lilleberg because he found in an autobiography of Einar Lilleberg, Eleanore's brother, that Einar had referenced a Norwegian army veteran named Oscar whom the two knew in Chicago, whom Einar described as having always \"stood straight and tall\". He asserts credit \"should almost certainly belong to\" Lilleberg.\nEngraving\nTo prevent information identifying the Oscar winners from leaking ahead of the ceremony, Oscar statuettes presented at the ceremony have blank baseplates. Until 2010, winners returned their statuettes to the Academy and had to wait several weeks to have their names inscribed on their respective Oscars. Since 2010, winners have had the option of having engraved nameplates applied to their statuettes at an inscription-processing station at the Governor's Ball, a party held immediately after the Oscar ceremony. The R.S. Owens company has engraved nameplates made before the ceremony, bearing the name of every potential winner. The nameplates for the non-winning nominees are later recycled.\nOwnership of Oscar statuettes\nBefore 1950, Oscar statuettes were, and remain, the property of the recipient. Since then the statuettes have been legally encumbered by the requirement that the statuette be first offered for sale back to the Academy for . If a winner refuses to agree to this stipulation, then the Academy keeps the statuette. Academy Awards predating this agreement have been sold in public auctions and private deals for six-figure sums.\nIn 1989, Michael Todd's grandson tried to sell Todd's Best Picture Oscar for his 1956 production of Around the World in 80 Days to a movie prop collector. The Academy earned enforcement of its statuette contract by gaining a permanent injunction against the sale.\nIn 1992, Harold Russell consigned his 1946 Oscar for Best Supporting Actor for The Best Years of Our Lives to auction to raise money for his wife's medical expenses. Though his decision caused controversy, the first Oscar ever to be sold passed to a private collector on August 6, 1992, for . Russell defended his action, saying, \"I don't know why anybody would be critical. My wife's health is much more important than sentimental reasons. The movie will be here, even if Oscar isn't\".\nIn December 2011, Orson Welles' 1941 Oscar for Citizen Kane (Academy Award for Best Original Screenplay) was put up for auction, after his heirs won a 2004 court decision contending that Welles did not sign any agreement to return the statue to the Academy. On December 20, 2011, it sold in an online auction for .\nSome buyers have subsequently returned the statuettes to the Academy, which keeps them in its treasury.\nOther awards presented by the Academy\nIn addition to the Academy Award of Merit (Oscar award), there are nine honorary (non-competitive) awards presented by the Academy from time to time (except for the Academy Honorary Award, the Technical Achievement Award, and the Student Academy Awards, which are presented annually):\n* Governors Awards:\n** The Academy Honorary Award (annual) (which may or may not be in the form of an Oscar statuette);\n** The Irving G. Thalberg Memorial Award (since 1938) (in the form of a bust of Thalberg);\n** The Jean Hersholt Humanitarian Award (since 1957) (in the form of an Oscar statuette);\n* The Academy Scientific and Technical Awards:\n** Academy Award of Merit (non-competitive) (in the form of an Oscar statuette);\n** Scientific and Engineering Award (in the form of a bronze tablet);\n** Technical Achievement Award (annual) (in the form of a certificate);\n** The John A. Bonner Medal of Commendation (since 1978) (in the form of a medal);\n** The Gordon E. Sawyer Award (since 1982); and\n* The Academy Student Academy Awards (annual).\nThe Academy also awards Nicholl Fellowships in Screenwriting.\nNomination\nFrom 2004 to 2020, the Academy Award nomination results were announced to the public in mid-January. Prior to that, the results were announced in early February. In 2021, the nominees were announced in March. In 2022, the nominees were announced in early February for the first time since 2003.\nVoters\nThe Academy of Motion Picture Arts and Sciences (AMPAS), a professional honorary organization, is composed of 9,905 voting members .\nAcademy membership is divided into different branches, with each representing a different discipline in film production. , actors constitute the largest bloc, numbering 1,258 (12.7% of the voting body). Votes have been certified by the auditing firm PricewaterhouseCoopers, and its predecessor Price Waterhouse, since the 7th Academy Awards in 1935. In May 2011, the Academy sent a letter advising its then-6,000 or so voting members that an online system for Oscar voting would be implemented in 2013, replacing mailed paper ballots.\nAll AMPAS members must be invited to join by the Board of Governors, on behalf of Academy Branch Executive Committees. Membership eligibility may be achieved by a competitive nomination, or an existing member may submit a name, based on other significant contributions to the field of motion pictures.\nNew membership proposals are considered annually. The Academy does not publicly disclose its membership, although as recently as 2007 press releases have announced the names of those who have been invited to join.\nIn 2012, the results of a study conducted by the Los Angeles Times were published describing the demographic breakdown of approximately 88% of AMPAS' voting membership. Of the 5,100+ active voters confirmed, 94% were Caucasian, 77% were male, and 54% were found to be over the age of 60. Thirty-three percent of voting members are former nominees (14%) and winners (19%). In 2016, the Academy launched an initiative to expand its membership and increase diversity. In 2024, voting membership stood at 9,905.\nIn 2025, a newly announced procedure required Academy members to view all nominated films within a category to be eligible to cast a vote in the final round of that category. The verification process will be done through the Academy's members-only streaming platform and submitting a form for films viewed at in-person events such as at festivals, screenings or private events.\nRules\nAccording to Rules 2 and 3 of the official Academy Awards Rules, a film must open in the previous calendar year, from midnight at the start of January 1 to midnight at the end of December 31, in Los Angeles County, California, and play for seven consecutive days, to qualify, except for the Best International Feature Film, Best Documentary Feature, and awards in short film categories. The film must be shown at least three times on each day of its qualifying run, with at least one of the daily showings starting between 6pm and 10pm local time.\nFor example, the 2009 Best Picture winner, The Hurt Locker, was originally first released in 2008, but did not qualify for the 2008 awards, as it did not play its Oscar-qualifying run in Los Angeles until mid-2009, thus qualifying for the 2009 awards. Foreign films must include English subtitles. Each country can submit only one film for consideration in the International Feature Film category per year.\nRule 2 states that a film must be feature-length, defined as a minimum of 40minutes, except for short-subject awards. It must exist either on a 35 mm or 70 mm film print, or in 24frame/s or 48frame/s progressive scan digital cinema format, with a minimum projector resolution of 2,048 by 1,080 pixels. Since the 90th Academy Awards, presented in 2018, multi-part and limited series have been ineligible for the Best Documentary Feature award. This followed the win of O.J.: Made in America, an eight-hour presentation that was screened in a limited release before being broadcast in five parts on ABC and ESPN, in that category in 2017. The Academy's announcement of the new rule made no direct mention of that film.\nThe Best International Feature Film award does not require a U.S. release. It requires the film to be submitted as its country's official selection.\nThe Best Documentary Feature award requires either week-long releases in both Los Angeles County and any of the five boroughs of New York City during the previous calendar year,}} or a qualifying award at a competitive film festival from the Documentary Feature Qualifying Festival list, regardless of any public exhibition or distribution, or submission in the International Feature Film category as its country's official selection. The qualifying theatrical runs must meet the same requirements as those for non-documentary films regarding numbers and times of screenings. A film must have been reviewed by a critic from The New York Times, Time Out New York, the Los Angeles Times, or LA Weekly.\nProducers must submit an Official Screen Credits online form before the deadline. If it is not submitted by the defined deadline, the film will be ineligible for Academy Awards in any year. The form includes the production credits for all related categories.\nAwards in short film categories (Best Documentary Short Subject, Best Animated Short Film, and Best Live Action Short Film) have different eligibility rules from most other competitive awards. First, the qualifying period for release does not coincide with a calendar year, instead covering one year starting on October 1, and ending on September 30 of the calendar year before the ceremony. Second, there are multiple methods of qualification. The main method is a week-long theatrical release in either New York City or Los Angeles County during the eligibility period. Films can also qualify by winning specified awards at one of several competitive film festivals designated by the Academy, also without regard to prior public distribution.\nA film that is selected as a gold, silver, or bronze medal winner in an appropriate category of the immediately previous Student Academy Awards is also eligible (Documentary category for that award, and Animation, Narrative, Alternative, or International for the other awards). The requirements for the qualifying theatrical run are also different from those for other awards. Only one screening per day is required. For the Documentary award, the screening must start between noon and 10pm local time. For other awards, no specific start time is required, but the film must appear in regular theater listings with dates and screening times.\nIn late December, ballots and lists of eligible films are sent to the membership. For most categories, members from each of the branches vote to determine the nominees only in their respective categories, i.e. only directors vote for directors, writers for writers, actors for actors, etc. In the special case of Best Picture, all voting members are eligible to select the nominees. A number of branches are only eligible to vote in Best Picture during nomination voting; this includes a producers' branch, as Best Picture is awarded to a film's producer(s), and other branches which have no corresponding award. In all major categories, a variant of the single transferable vote is used, with each member casting a ballot with up to five nominees (ten for Best Picture) ranked preferentially. In certain categories, including International Feature Film, Documentary and Animated Feature, nominees are selected by special screening committees made up of members from all branches.\nIn most categories, the winner is selected from among the nominees by plurality voting of all members. Since 2009, the Best Picture winner has been chosen by instant-runoff voting. Since 2013, re-weighted range voting has been used to select the nominees for the Best Visual Effects.\nFilm companies will spend as much as several million dollars on marketing to awards voters for a film in the running for Best Picture, in attempts to improve chances of receiving Oscars and other film awards conferred in Oscar season. The Academy enforces rules to limit overt campaigning by its members to try to eliminate excesses and prevent the process from becoming undignified. It has an awards czar on staff who advises members on allowed practices and levies penalties on offenders. For example, a producer of the 2009 Best Picture nominee The Hurt Locker was disqualified as a producer in the category when he contacted associates urging them to vote for his film and not another that was seen as the front-runner. The Hurt Locker eventually won.\nAcademy Screening Room\nThe Academy Screening Room or Academy Digital Screening Room is a secure streaming platform which allows voting members of the Academy to view all eligible films in one place. It was introduced in 2019, for the 2020 Oscars. DVD screeners and Academy in-person screenings were still provided. For films to be included on the platform, the North American distributor must pay , including a watermarking fee, and a digital copy of the film to be prepared for streaming by the Academy. The platform can be accessed via Apple TV and Roku players. The watermarking process involved several video security firms, creating a forensic watermark and restricting the ability to take screenshots or screen recordings.\nIn 2021, for the 2022 Oscars, the Academy banned all physical screeners and in-person screenings, restricting official membership viewing to the Academy Screening Room. Films eligible in the Documentary and International categories were made available in different sections of the platform. Distributors can also pay an extra fee to add video featurettes to promote their films on the platform. The in-person screenings were cancelled because of the COVID-19 pandemic. Eligible films do not have to be added to the platform, but the Academy advertises them to voting members when they are.\nAwards ceremonies\nTelecast\n, Hollywood Pantages Theatre, 1959]]\n, Dolby Theatre, 2009]]\n, Dolby Theatre, 2023]]\nThe major awards are presented at a live televised ceremony, commonly in late February or early March following the relevant calendar year, and six weeks after the announcement of the nominees. It is the culmination of the film awards season, which usually begins during November or December of the previous year. This is an elaborate extravaganza, with the invited guests walking up the red carpet in the creations of the most prominent fashion designers of the day. Black tie dress is the most common outfit for men. Fashion may dictate not wearing a bow tie, and musical performers are sometimes not required to adhere to this. The artists who recorded the nominees for Best Original Song quite often perform those songs live at the awards ceremony, and the fact that they are performing is often used to promote the television broadcast.\nThe Academy Awards is the world's longest-running awards show televised live from the United States to all time zones in North America and worldwide, and gathers billions of viewers elsewhere throughout the world. The Oscars were first televised in 1953 by NBC, which continued to broadcast the event until 1960, when ABC took over, televising the festivities, including the first color broadcast of the event in 1966, to 1970. NBC regained the rights for five years  then ABC resumed broadcast duties in 1976 and its current contract with the Academy runs through 2028.\nThe Academy has produced condensed versions of the ceremony for broadcast in international markets, especially those outside of the Americas, in more desirable local timeslots. The ceremony was broadcast live internationally for the first time via satellite since 1970, but only two South American countries, Chile and Brazil, purchased the rights to air the broadcast. By that time, the television rights to the Academy Awards had been sold in 50 countries. In 1980, the rights were sold to 60 countries, and by 1984, the television rights to the Academy Awards were licensed in 76 countries.\nIn 2004, the ceremonies were moved up from late March/early April to late February, to help disrupt and shorten the intense lobbying and ad campaigns associated with Oscar season in the film industry. Another reason was because of the growing television ratings success coinciding with the NCAA division I men's basketball tournament, which would cut into the Academy Awards audience. In 1976 and 1977, ABC's regained Oscars were moved from Tuesday to Monday and went directly opposite the national championship game on NBC. The earlier date is also to the advantage of ABC, as it now usually occurs during the highly profitable and important February sweeps period.\nSome years, the ceremony is moved into the first Sunday of March to avoid a clash with the Winter Olympic Games. Another reason for the move to late February and early March is to avoid the awards ceremony occurring so close to the religious holidays of Passover and Easter, which for decades had been a grievance from members and the general public. Advertising is somewhat restricted, as traditionally no film studios or competitors of official Academy Award sponsors may advertise during the telecast. As of 2020, the production of the Academy Awards telecast held the distinction of winning one the highest number of Emmys in history, with 54 wins and 280 nominations overall.\nAfter many years of being held on Mondays at 6:00p.m. Pacific/9:00pm Eastern, since the 1999 ceremony, it was moved to Sundays at 5:30pm PT/8:30pm ET. The reasons given for the move were that more viewers would tune in on Sundays, that Los Angeles rush-hour traffic jams could be avoided, and an earlier start time would allow viewers on the East Coast to go to bed earlier. For many years the film industry opposed a Sunday broadcast because it would cut into the weekend box office.\nIn 2010, the Academy contemplated moving the ceremony even further back into January, citing television viewers' fatigue with the film industry's long awards season. However, such an accelerated schedule would dramatically decrease the voting period for its members, to the point where some voters would only have time to view the contending films streamed on their computers, as opposed to traditionally receiving the films and ballots in the mail. Additionally, a January ceremony on Sunday would clash with National Football League (NFL) playoff games. In 2018, the Academy announced that the ceremony would be moved from late February to mid-February beginning with the 92nd Academy Awards in 2020. In 2024, the ceremony was moved to an even earlier start time of 4:00pm PT/7:00p.m. ET, the apparent impetus being the ability for ABC to air a half-hour of primetime programming as a lead-out program at 7:30p.m. PT/10:30p.m. ET.\nOriginally scheduled for April 8, 1968, the 40th Academy Awards ceremony was postponed for two days, because of the assassination of Dr. Martin Luther King, Jr. On March 30, 1981, the 53rd Academy Awards was postponed for one day, after the attempted assassination of President Ronald Reagan and others in Washington, D.C.\nIn 1993, an In Memoriam segment was introduced, honoring those who had made a significant contribution to cinema who had died in the preceding 12 months, a selection compiled by a small committee of Academy members. This segment has drawn criticism over the years for the omission of some names. Criticism was also levied for many years regarding another aspect, with the segment having a \"popularity contest\" feel as the audience varied their applause to those who had died by the subject's cultural impact. The applause has since been muted during the telecast, and the audience is discouraged from clapping during the segment and giving silent reflection instead. This segment was later followed by a commercial break.\nIn terms of broadcast length, the ceremony generally averages three and a half hours. The first Oscars, in 1929, lasted 15minutes. At the other end of the spectrum, the 2002 ceremony lasted four hours and twenty-three minutes. In 2010, the organizers of the Academy Awards announced winners' acceptance speeches must not run past 45seconds. This, according to organizer Bill Mechanic, was to ensure the elimination of what he termed \"the single most hated thing on the show\"—overly long and embarrassing displays of emotion. In 2016, in a further effort to streamline speeches, winners' dedications were displayed on an on-screen ticker.\nDuring the 2018 ceremony, host Jimmy Kimmel acknowledged how long the ceremony had become, by announcing that he would give a brand-new jet ski to whoever gave the shortest speech of the night, a reward won by Mark Bridges when accepting his Best Costume Design award for Phantom Thread. The Wall Street Journal analyzed the average minutes spent across the 2014–2018 telecasts as follows: 14 on song performances; 25 on the hosts' speeches; 38 on prerecorded clips; and 78 on the awards themselves, broken into 24 on the introduction and announcement, 24 on winners walking to the stage, and 30 on their acceptance speeches.\nAlthough still dominant in ratings, the viewership of the Academy Awards has steadily dropped. The 88th Academy Awards were the lowest-rated in the past eight years (although with increases in male and 18–49 viewership), while the show itself also faced mixed reception. Following the show, Variety reported that ABC was, in negotiating an extension to its contract to broadcast the Oscars, seeking to have more creative control over the broadcast itself. Currently and nominally, AMPAS is responsible for most aspects of the telecast, including the choice of production staff and hosting, although ABC is allowed to have some input on their decisions. In August 2016, AMPAS extended its contract with ABC to 2028: the contract neither contains any notable changes nor gives ABC any further creative control over the telecast.\nTV ratings\nHistorically, the telecast's viewership is higher when box-office hits are favored to win the Best Picture award. More than 57.25million viewers tuned to the telecast for the 70th Academy Awards in 1998, the year of Titanic, which generated a box office haul during its initial 1997–98 run of  in the US, a box-office record that would remain unsurpassed for years. The 76th Academy Awards ceremony, in which The Lord of the Rings: The Return of the King (pre-telecast box office earnings of ) received 11 Awards, including Best Picture, drew 43.56million viewers. The most-watched ceremony based on Nielsen ratings to date, was the 42nd Academy Awards (Best Picture Midnight Cowboy), which drew a 43.4% household rating on April 7, 1970. Hoping to reinvigorate the pre-show and ratings, the 2023 Oscars organizers hired members of the Met Gala creative team.\nBy contrast, ceremonies honoring films that have not performed well at the box office tend to show weaker ratings, despite how much critical acclaim those films have received. The 78th Academy Awards, which awarded a low-budget independent film (Crash with a pre-Oscar gross of ) generated an audience of 38.64million with a household rating of 22.91%. In 2008, the 80th Academy Awards telecast was watched by 31.76million viewers on average with an 18.66% household rating, the lowest-rated and least-watched ceremony at the time, in spite of celebrating 80 years of the Academy Awards. The Best Picture winner of that particular ceremony was another independent film (this time, the Coen brothers's No Country for Old Men).\nWhereas the 92nd Academy Awards drew an average of 23.6million viewers, the 93rd Academy Awards drew an even lower viewership of 10.4million, the lowest viewership recorded by Nielsen since it started recording audience totals in 1974. The 94th and 95th editions drew 16.6 and 18.7million viewers, respectively, still below the audience of the 92nd edition.\nArchive\nThe Academy Film Archive holds copies of every Academy Awards ceremony since the 1949 Oscars, as well as material on many prior ceremonies, along with ancillary material related to more recent shows. Copies are held in a variety of film, video and digital formats.\nVenues\nIn 1929, the first Academy Awards were presented at a banquet dinner at the Hollywood Roosevelt Hotel. From 1930 to 1943, the ceremony alternated between two venues: the Ambassador Hotel on Wilshire Boulevard and the Biltmore Hotel in downtown Los Angeles.\nGrauman's Chinese Theatre in Hollywood then hosted the awards from 1944 to 1946, followed by the Shrine Auditorium in Los Angeles from 1947 to 1948. The 21st Academy Awards in 1949 were held at the Academy Award Theatre at what had been the Academy's headquarters on Melrose Avenue in Hollywood.\nFrom 1950 to 1960, the awards were presented at Hollywood's Pantages Theatre. With the advent of television, the awards from 1953 to 1957 took place simultaneously in Hollywood and New York, first at the NBC International Theatre (1953) and then at the NBC Century Theatre, after which the ceremony took place solely in Los Angeles. In 1961, the Oscars moved to the Santa Monica Civic Auditorium in Santa Monica, California. In 1969, the Academy moved the ceremonies back to Downtown Los Angeles, to the Dorothy Chandler Pavilion at the Los Angeles County Music Center. In the late 1990s and early 2000s, the ceremony returned to the Shrine Auditorium.\nIn 2002, Hollywood's Dolby Theatre, previously known as the Kodak Theatre, became the presentation's current venue.\nCategories\nCurrent categories\n{| class=\"wikitable sortable\"\n|+ List of current Awards of Merit categories\n! Year introduced\n! Category\n|-\n| rowspan=\"7\" | 1927/28\n| Best Picture\n|-\n| Best Director\n|-\n| Best Actor\n|-\n| Best Actress\n|-\n| Best Cinematography\n|-\n| Best Production Design\n|-\n| Best Adapted Screenplay\n|-\n| 1929/30\n| Best Sound\n|-\n| rowspan=\"2\" | 1931/32\n| Best Animated Short Film\n|-\n| Best Live Action Short Film\n|-\n| rowspan=\"3\" | 1934\n| Best Film Editing\n|-\n| Best Original Score\n|-\n| Best Original Song\n|-\n| rowspan=\"2\" | 1936\n| Best Supporting Actor\n|-\n| Best Supporting Actress\n|-\n| 1939\n| Best Visual Effects\n|-\n| 1940\n| Best Original Screenplay\n|-\n| 1941\n| Best Documentary Short Film\n|-\n| 1943\n| Best Documentary Feature Film\n|-\n| 1947\n| Best International Feature Film\n|-\n| 1948\n| Best Costume Design\n|-\n| 1981\n| Best Makeup and Hairstyling\n|-\n| 2001\n| Best Animated Feature Film\n|}\nIn the first year of the awards, the Best Directing award was split into two categories, Drama and Comedy. At times, the Best Original Score award has also been split into separate categories, Drama and Comedy/Musical. From the 1930s to the 1960s, the Art Direction (now Production Design), Cinematography, and Costume Design awards were split into two categories (black-and-white films and color films). Prior to 2012, the Production Design award was called Art Direction, while the Makeup and Hairstyling award was called Makeup. Prior to 2020, the International Feature Film award was called Foreign Language Film.\nIn August 2018, the Academy announced that several categories would not be televised live, but recorded during commercial breaks and aired later in the ceremony.\nFollowing dissent from Academy members, they announced that they would air all 24 categories live. This followed several proposals, among them, the introduction of a Popular Film category, that the Academy had announced but did not implement.\nUpcoming categories\n{| class=\"wikitable sortable\"\n|+ List of upcoming Awards of Merit categories\n! Planned introduction\n! Category\n|-\n| 2026\n| Best Casting\n|-\n|2028\n| Best Stunt Design\n|}\nIn February 2024, the Academy announced it would introduce an award for Achievement in Casting from the 98th ceremony in 2026, having rejected the category in 1999. In April 2025, it announced that Best Stunt Design would be introduced from the 100th ceremony in 2028, having rejected the proposal for a Best Stunt Coordination award every year from 1991 to 2012.\nDiscontinued categories\n{| class=\"wikitable sortable\"\n|+ List of discontinued Awards of Merit categories\n! Introduced\n! Discontinued\n! Category\n|-\n| rowspan=\"6\" | 1927/28\n| rowspan=\"5\" | 1927/28\n| Best Director, Comedy Picture\n|-\n| Best Director, Dramatic Picture\n|-\n| Best Engineering Effects\n|-\n| Best Title Writing\n|-\n| Best Unique and Artistic Production\n|-\n| 1956\n| Best Original Story\n|-\n| rowspan=\"2\" | 1931/32\n| rowspan=\"2\" | 1935\n| Best Short Subject – Comedy\n|-\n| Best Short Subject – Novelty\n|-\n| 1932/33\n| rowspan=\"3\" | 1937\n| Best Assistant Director\n|-\n| 1935\n| Best Dance Direction\n|-\n| rowspan=\"3\" | 1936\n| Best Short Subject – Color\n|-\n| rowspan=\"2\" | 1956\n| Best Short Subject – 1 Reel\n|-\n| Best Short Subject – 2 Reel\n|-\n| 1963\n| 2019\n| Best Sound Editing\n|-\n| 1995\n| 1998\n| Best Original Musical or Comedy Score\n|}\nProposed categories\nThe Board of Governors meets each year and considers new award categories, including:\n* Best Popular Film: proposed in 2018 for presentation at the 2019 ceremony; postponed and yet to be implemented\n* Best Title Design: rejected in 1999\nSpecial categories\nThe Special Academy Awards are voted on by special committees, rather than by the Academy membership as a whole. They are not always presented on an annual basis.\nCurrent special categories\n* Academy Honorary Award: since 1929\n* Academy Scientific and Technical Award (three different awards): since 1931\n* Gordon E. Sawyer Award: since 1981\n* Jean Hersholt Humanitarian Award: since 1957\n* Irving G. Thalberg Memorial Award: since 1938\nDiscontinued special categories\n* Academy Juvenile Award: 1934 to 1960\n* Academy Special Achievement Award: from 1972 to 1995, and again for 2017\nCriticism and controversies\nAccusations of commercialism\nDue to the positive exposure and prestige of the Academy Awards, many studios spend around 25 million dollars and hire publicists specifically to promote their films during what is typically called the \"Oscar season\". This has generated accusations of the Academy Awards being influenced more by marketing and lobbying than by quality. William Friedkin, an Academy Award-winning film director and former producer of the ceremony, expressed this sentiment at a conference in New York in 2009, describing it as \"the greatest promotion scheme that any industry ever devised for itself\".\nTim Dirks, editor of AMC's Filmsite, has written of the Academy Awards:\n}}\nA recent technique that has been claimed to be used during the Oscar season is the whisper campaign. These campaigns are intended to spread negative perceptions of other films nominated and are believed to be perpetrated by those who were involved in creating the film. Examples of whisper campaigns include the allegations against Zero Dark Thirty suggesting that it justifies torture and the claim that Lincoln distorts history. This technique was widely used by former producer Harvey Weinstein and his company Miramax, with the campaign strategy gaining further attention after Miramax's Shakespeare in Love defeated  rival film Saving Private Ryan for Best Picture.\nAccusations of bias\nTypical criticism of the Academy Awards for Best Picture is that among the winners and nominees there is an over-representation of romantic historical epics, biographical dramas, romantic dramedies and family melodramas, most of which are released in the U.S. in the last three months of the calendar year. The Oscars have been infamously known for selecting specific genres of films to be awarded. The term \"Oscar bait\" was coined to describe such films. This has led, at times, to more specific criticisms that the Academy is disconnected from the audience, e.g., by favoring \"Oscar bait\" over audience favorites or favoring historical melodramas over critically acclaimed films that depict current life issues.\nDespite the success of The Dark Knight and WALL-E, these films did not receive a Best Picture nomination at the 81st Academy Awards. These decisions received substantial criticism and were described as \"snubs\" by many publications. The backlash to the decision was such that, for the 82nd Academy Awards in 2010, the Academy increased the limit for Best Picture nominees from five to ten.\nLack of diversity\nThe Academy Awards have long received criticism over their lack of diversity among the nominees. This criticism is based on the statistics from every Academy Awards since 1929, which show that only 6.4% of Academy Award nominees have been non-white and since 1991, 11.2% of nominees have been non-white, with the rate of winners being even more polarizing. For a variety of reasons, including marketability and historical bans on interracial couples, a number of high-profile Oscars have been given to yellowface portrayals, as well as performances of Asian characters rewritten for white characters. It took until 2023 for an Asian woman to win an Academy Award for Best Actress, when Michelle Yeoh received the award for her performance in Everything Everywhere All at Once. The 88th awards ceremony became the target of a boycott, popularized on social media with the hashtag #OscarsSoWhite, based on activists' perception that its all-white acting nominee list reflected bias. In response, the Academy initiated \"historic\" changes in membership by 2020. Some media critics claim the Academy's efforts to address its purported racial, gender and national biases are merely distractions. By contrast, the Golden Globe Awards already have multiple winners of Asian descent in leading actress categories. Some question whether the Academy's definition of \"merit\" is just or empowering for non-Americans.\nThe Academy's Representation and Inclusion Standards have been criticized for excluding Jews as a distinct underrepresented class.\nMiscategorization of actors\nThe Academy has no rules for how to categorize whether a performance is leading or supporting, and it is up to the discretion of the studios whether a given performance is submitted for either Best Actor/Actress or Best Supporting Actor/Actress. This has led to situations where a film has two or more co-leads, and one of these is submitted in a supporting category to avoid the two leads competing against each other, and to increase the film's chances of winning. This practice has been derisively called \"category fraud\".\nFor example, Rooney Mara was nominated for Best Supporting Actress for Carol (2015), despite her having a comparable amount of screentime to Cate Blanchett, who was nominated for Best Actress. Another example is Once Upon a Time in Hollywood (2019), where Brad Pitt was nominated for and won Best Supporting Actor, even though he played an equally important role to Best Actor nominee Leonardo DiCaprio. In both these cases, critics argued that the studios behind the films had placed someone who was actually a leading actor or actress into the supporting categories to avoid them competing against their co-lead.\nSymbolism or sentimentalization\nActing prizes in certain years have been criticized for not recognizing superior performances so much as being awarded for personal popularity, to make up for a \"snub\" for a work that proved in time to be more popular or renowned than the one awarded (a 'make-up Oscar'), or as a \"career honor\" to recognize a distinguished nominee's entire body of work (a \"legacy Oscar\").\nRecognition of streaming media film\nFollowing the 91st Academy Awards in February 2019 in which the Netflix-broadcast film Roma had been nominated for ten awards including the Best Picture category, Steven Spielberg and other members of the Academy discussed changing the requirements through the Board of Governors for films as to exclude those from Netflix and other media streaming services. Spielberg had been concerned that Netflix as a film production and distribution studio could spend much more than for typical Oscar-winning films and have much wider and earlier distribution than for other Best Picture-nominated films, while still being able to meet the minimal theatrical-run status to qualify for an Oscar.\nThe United States Department of Justice, having heard of this potential rule change, wrote a letter to the Academy in March 2019, cautioning them that placing additional restrictions on films that originate from streaming media services without proper justification could raise anti-trust concerns against the Academy. Following its April 2019 board meeting, the Academy Board of Governors agreed to retain the current rules that allow for streaming media films to be eligible for Oscars as long as they have had limited theatrical runs.\n2022 Chris Rock and Will Smith slapping incident\nDuring the 94th Academy Awards on March 27, 2022, Chris Rock joked about Jada Pinkett Smith's shaved head with a G.I. Jane reference. Will Smith walked onstage and slapped Rock across the face, then returned to his seat and told Rock, twice, to \"Keep my wife's name out [of] your fucking mouth!\" While later accepting the Best Actor award for King Richard, Smith apologized to the Academy and the other nominees, but not to Rock. Rock decided not to press charges against Smith.\nOn April 8, 2022, the Academy made an announcement via a letter sent by president David Rubin and CEO Dawn Hudson informing the public that Will Smith had received a ten-year ban from attending the Oscars as a result of the incident.\nRefusals of the award\nSome winners critical of the Academy Awards have boycotted the ceremonies and refused to accept their Oscars. The first to do so was screenwriter Dudley Nichols (Best Writing in 1935 for The Informer). Nichols boycotted the 8th Academy Awards ceremony because of conflicts between the Academy and the Writers' Guild. Nichols eventually accepted the 1935 award three years later, at the 1938 ceremony. Nichols was nominated for three further Academy Awards during his career.\nGeorge C. Scott became the second person to refuse his award (Best Actor in 1970 for Patton) at the 43rd Academy Awards ceremony. Scott described it as a \"meat parade\", saying, \"I don't want any part of it\".\nThe third person to refuse the award was Marlon Brando, who refused his award (Best Actor for 1972's The Godfather), citing the film industry's discrimination against and mistreatment of Native Americans. At the 45th Academy Awards ceremony, Brando asked actress and civil rights activist Sacheen Littlefeather to read a 15-page speech in his place, detailing his criticisms, for which there was booing and cheering by the audience. In 2022, Littlefeather was accused by her sisters of misrepresenting her ancestry as Native American.\nDisqualifications\nSeven films have had nominations revoked before the official award ceremony:\n* The Circus (1928) – The film was voluntarily removed by the Academy from competitive categories, to award Charlie Chaplin a special award.\n* Hondo (1953) – Removed from the Best Story ballot after letters from the producer and nominee questioned its inclusion in the category.\n* High Society (1955) – Withdrawn from screenwriting ballot after being mistaken for the 1956 film of the same title.\n* The Godfather (1972) – Initially nominated for eleven awards, its nomination for Best Original Score was revoked after it was discovered that its main theme was very similar to music that the score's composer had written for an earlier film. None of its other nominations were revoked, and it received three Oscars, including Best Picture.\n* A Place in the World (1992) – Removed from the Best Foreign Language Film ballot after it was discovered that the country which submitted the film exercised insufficient artistic control.\n* Alone Yet Not Alone (2014) – The film's title song, \"Alone Yet Not Alone\", was removed from the Best Original Song ballot after Bruce Broughton was found to have improperly contacted other members of the Academy's musical branch; this was the first time that a film was removed from a ballot for ethical reasons.\n* 13 Hours: The Secret Soldiers of Benghazi (2017) – Sound mixer Greg P. Russell's nomination was rescinded one day before the Awards when it was discovered he had improperly contacted voters by telephone. In this case, the nominations for the other three nominated sound mixers, Gary Summers, Jeffrey J. Haboush and Mac Ruth, were allowed to stand.\nOne film was disqualified after winning the award, and had the winner return the Oscar:\n* Young Americans (1969) – Initially won the award for Best Documentary Feature, but was later revoked after it was revealed that it had opened theatrically prior to the eligibility period.\nOne film had its nomination revoked after the award ceremony when it had not won the Oscar:\n* Tuba Atlantic (2011) – Its nomination for Best Live Action Short Film was revoked when it was discovered that the film had aired on television in 2010, before its theatrical release.\nRemarks about animated films as children's genre\nAt the 94th Academy Awards in 2022, the award for the Best Animated Feature was presented by three actresses who portrayed Disney princess characters in live-action remakes of their respective animated films: Lily James (Cinderella), Naomi Scott (Aladdin), and Halle Bailey (The Little Mermaid. While introducing the category, Bailey stated that animated films are \"formative experiences as kids who watch them,\" as James put it, \"So many kids watch these movies over and over.\" Bailey finished her sentence \"over and over and over and over and over.\" Scott added: \"I see some parents who know exactly what we're talking about.\" The remarks were heavily criticized by animation enthusiasts and those working in the industry as infantilizing the medium and perpetuating the stigma that animated works are strictly for children, especially since the industry was credited with sustaining the flow of Hollywood content and revenue during the height of the COVID-19 pandemic. Phil Lord, co-producer of one of the nominated films, The Mitchells vs. the Machines, tweeted that it was \"super cool to position animation as something that kids watch and adults have to endure.\" The film's official social media accounts responded to the joke with an image reading: \"Animation is cinema.\" A week later, Lord and his producing partner Christopher Miller wrote a guest column in Variety criticizing the Academy for the joke and how Hollywood has treated animation, writing that \"no one set out to diminish animated films, but it's high time we set out to elevate them.\" They also suggested to the Academy that the category should be presented by a filmmaker who respects the art of animation as cinema.\nAdding to the controversy was that the award for Best Animated Short Film (the nominees for which were mostly made up of shorts not aimed at children) was one of the eight categories that were not presented during the live broadcast. The winner for the Best Animated Short award was The Windshield Wiper, a multilingual Spanish-American film which is adult animated, while another nominee in three categories: Best Animated Feature, Best Documentary Feature Film, and Best International Feature Film, was Flee, a PG-13 rated animated documentary about an Afghan refugee. Alberto Mielgo, director of The Windshield Wiper, later gave an acceptance speech for the Oscar: \"Animation is an art that includes every single art that you can imagine. Animation for adults is a fact. It's happening. Let's call it cinema. I'm very honored because this is just the beginning of what we can do with animation.\" Some speculations suggested that the speech played a role in the decision not to broadcast the award.\nAnother factor is that numerous animated films have been made for mature audiences or with ranges of PG-13 or more, with a few of them—The Triplets of Belleville, Persepolis, Chico and Rita, The Wind Rises, Anomalisa, My Life as a Courgette, The Breadwinner, Loving Vincent, Isle of Dogs, I Lost My Body, Flee, and Memoir of a Snail—having been nominated in this category, with The Boy and the Heron being the first adult animated film (in this case, PG-13-rated) to win in the 96th Academy Awards.\nThese comments came as #NewDeal4Animation, a movement of animation workers demanding equal pay, treatment and recognition alongside their contemporaries working in live-action, was picking up momentum during negotiations for a new contract between The Animation Guild, IATSE Local 839/SAG-AFTRA and the Alliance of Motion Picture and Television Producers, and the presentation is being used to rally the movement.\nDuring the 96th Academy Awards in 2024, host Jimmy Kimmel said: \"Please raise your hand if you let your kid fill out this part of the ballot.\" These remarks would again prompt backlash, with Christopher Miller, producer of that year's nominated Spider-Man: Across the Spider-Verse, tweeting out that the joke was \"tired and lazy\". The PG-13-rated The Boy and the Heron would subsequently win the award.\nAssociated events\nThe following events are closely associated with the annual Academy Awards:\n* Governors Awards, which includes the presentation of the Academy Honorary Award, the Jean Hersholt Humanitarian Award, and the Irving G. Thalberg Memorial Award\n* The 25th Independent Spirit Awards (2010), usually held in Santa Monica, California the Saturday before the Oscars, marked the first time it was moved to a Friday and a change of venue to L.A. Live\n* The annual \"Night Before\", traditionally held at the Beverly Hills Hotel, begun in 2002 and generally known as the party of the season, benefits the Motion Picture & Television Fund, which operates a retirement home for SAG actors in the San Fernando Valley\n* Elton John AIDS Foundation Academy Award Party airs the awards live at the nearby Pacific Design Center\n* The Governors Ball is the Academy's official after-party, including dinner (until 2011), and is adjacent to the awards-presentation venue\n* The Vanity Fair after-party, historically at the former Morton's restaurant, has been at the Sunset Tower since 2009\nPresenter and performer gifts\nIt has become a tradition to give out gift bags to the presenters and performers at the Oscars. In recent years, these gifts have been extended to award nominees and winners. The value of each of these gift bags can reach into the tens of thousands of dollars. In 2014, the value was reported to be as high as . The value has risen to the point where the U.S. Internal Revenue Service issued a statement regarding the gifts and their taxable status.\nOscar gift bags have included vacation packages to Hawaii and Mexico and Japan, a private dinner party for the recipient and friends at a restaurant, videophones, a four-night stay at a hotel, watches, bracelets, spa treatments, bottles of vodka, maple salad dressing, weight-loss gummie candy and up to  worth of cosmetic treatments and rejuvenation procedures such as lip fillers and chemical peels from New York City facial plastic surgeon Konstantin Vasyukevich. Some of the gifts have even had a \"risque\" element to them; in 2014, the adult products retailer Adam & Eve had a \"Secret Room Gifting Suite\". Celebrities visiting the gifting suite included Judith Hoag, Carolyn Hennesy, Kate Linder, Chris Mulkey, Jim O'Heir and John Salley.\nTelevision ratings and advertisement prices\nFrom 2006 onwards, results are Live+SD; all previous years are live viewing.\n{| class=\"wikitable sortable plainrowheaders\" style=\"margin:auto; margin:auto\"\n|-\n! Year\n! Viewers,millions\n! Ad price,USD, millions\n! Adjusted price,USD, millions\n! Network\n|-\n| 2025\n| 19.69\n| 1.7-2.3\n| Not available\n| rowspan=\"50\"| ABC\n|-\n| 2024\n| 19.49\n| 1.7-2.2\n| Not available\n|-\n| 2023\n| 18.7\n| 2.1\n| Not available\n|-\n| 2022\n| 16.6\n| 1.71\n| Not available\n|-\n| 2021\n| 10.4\n| 2\n| Not available\n|-\n| 2020\n| 23.6\n| 2.2\n| Not available\n|-\n| 2019\n| 29.6\n| 2–3\n| Not available\n|-\n| 2018\n| 26.5\n| 2–2.6\n| Not available\n|-\n| 2017\n| 32.9\n| 2.1\n| Not available\n|-\n| 2016\n| 34.4\n| 2\n| Not available\n|-\n| 2015\n| 37.260\n| 1.95\n|\n|-\n| 2014\n| 43.740\n| 1.8 – 1.9\n|  –\n|-\n| 2013\n| 40.376\n| 1.65 – 1.8\n|  –\n|-\n| 2012\n| 39.460\n| 1.610\n|\n|-\n| 2011\n| 37.919\n| 1.3684\n|\n|-\n| 2010\n| 41.699\n| 1.1267\n|\n|-\n| 2009\n| 36.310\n| 1.3\n|\n|-\n| 2008\n| 32.006\n| 1.82\n|\n|-\n| 2007\n| 40.172\n| 1.6658\n|\n|-\n| 2006\n| 38.939\n| 1.6468\n|\n|-\n| 2005\n| 42.139\n| 1.503\n|\n|-\n| 2004\n| 43.531\n| 1.5031\n|\n|-\n| 2003\n| 33.043\n| 1.3458\n|\n|-\n| 2002\n| 41.782\n| 1.29\n|\n|-\n| 2001\n| 42.944\n| 1.45\n|\n|-\n| 2000\n| 46.333\n| 1.305\n|\n|-\n| 1999\n| 45.615\n| 1\n|\n|-\n| 1998\n| |57.249\n| 0.95\n|\n|-\n| 1997\n| 40.075\n| 0.85\n|\n|-\n| 1996\n| 44.867\n| 0.795\n|\n|-\n| 1995\n| 48.279\n| 0.7\n|\n|-\n| 1994\n| 45.083\n| 0.6435\n|\n|-\n| 1993\n| 45.735\n| 0.6078\n|\n|-\n| 1992\n| 44.406\n| Not available\n| Not available\n|-\n| 1991\n| 42.727\n| Not available\n| Not available\n|-\n| 1990\n| 40.375\n| 0.45\n|\n|-\n| 1989\n| 42.619\n| 0.375\n|\n|-\n| 1988\n| 42.227\n| 0.36\n|\n|-\n| 1987\n| 37.190\n| 0.335\n|\n|-\n| 1986\n| 37.757\n| 0.32\n|\n|-\n| 1985\n| 38.855\n| 0.315\n|\n|-\n| 1984\n| 42.051\n| 0.275\n|\n|-\n| 1983\n| 53.235\n| 0.245\n|\n|-\n| 1982\n| 46.245\n| Not available\n| Not available\n|-\n| 1981\n| 39.919\n| Not available\n| Not available\n|-\n| 1980\n| 48.978\n| Not available\n| Not available\n|-\n| 1979\n| 46.301\n| Not available\n| Not available\n|-\n| 1978\n| 48.501\n| Not available\n| Not available\n|-\n| 1977\n| 39.719\n| Not available\n| Not available\n|-\n| 1976\n| 46.751\n| Not available\n| Not available\n|-\n| 1975\n| 48.127\n| Not available\n| Not available\n| rowspan=\"2\"| NBC\n|-\n| 1974\n| 44.712\n| Not available\n| Not available\n|}\nRecords\nMilestones\n{| class=\"wikitable\"\n!Superlative\n!Record-holder\n!Record set\n!Year\n!Notes\n|-\n! colspan=\"5\" |People\n|-\n|Most awards for a person\n| rowspan=\"2\" |Walt Disney\n|26 awards\n| rowspan=\"2\" |1969\n|Awards resulted from 59 nominations.\n|-\n| rowspan=\"2\" |Most awards for a person in a single year\n| rowspan=\"2\" |4 awards\n|Awards resulted in 4 different types of films.\n|-\n|Sean Baker\n|2025\n|Awards resulted from a single film.\n|-\n|Most awards for a person in a single category\n| rowspan=\"4\" |Walt Disney\n|12 awards\n|1969\n|Awards resulted from 39 nominations in one category: Best Animated Short Film.\n|-\n|Most consecutive awards for a person in a single category\n|8 awards\n|1940\n|First win was Flowers and Trees in 5th Academy Awards; continued to win for the next seven years until stopped at Lend a Paw in 14th Academy Awards.\n|-\n|Most nominations for a person\n|59 nominations\n|1969\n|Nominations resulted in 26 wins.\n|-\n|Most nominations for a person in a single year\n|6 nominations\n|1954\n|Nominations resulted in 4 wins in a single year.\n|-\n| rowspan=\"2\" |Most nominations for a person without a win\n|Greg P. Russell\n| rowspan=\"2\" |16 nominations\n|2014\n|With the exception of 13 Hours: The Secret Soldiers of Benghazi as his 17th nomination, Russell had recently disqualified for the category when it was discovered that he had contacted voters for the award by telephone in order to win, which was in violation of campaigning regulations.\n|-\n|Diane Warren\n|2025\n|Received the Academy Honorary Award in 2023.\n|-\n|Most nominations for a person in a single category\n|John Williams\n|48 nominations\n|2024\n|Nominations resulted in 5 wins in one category: Best Original Score.\n|-\n| rowspan=\"2\" |Most nominations for a person in a single category without a win\n|Greg P. Russell\n| rowspan=\"2\" |16 nominations\n|2014\n|Nominations resulted none in one category: Best Sound.\n|-\n|Diane Warren\n|2025\n|Except an Honorary Award in 2024, nominations resulted none in one category: Best Original Song.\n|-\n! colspan=\"5\" |Film\n|-\n| rowspan=\"3\" |Most awards for a film\n|Ben-Hur\n| rowspan=\"4\" |11 awards\n|1960\n|Awards resulted from 12 nominations; only loss was Best Adapted Screenplay.\n|-\n|Titanic\n|1998\n|Awards resulted from 14 nominations.\n|-\n| rowspan=\"2\" |The Lord of the Rings: The Return of the King\n| rowspan=\"3\" |2004\n|Awards resulted from every nomination it received.\n|-\n|Highest clean sweep\n|Beating Gigi and The Last Emperor with 9 wins from 9 nominations.\n|-\n|Most awards for a film franchise\n|The Lord of the Rings\n|17 awards\n|Consisting The Fellowship of the Ring (2001), The Two Towers (2002), and The Return of the King (2003).\n|-\n| rowspan=\"2\" |Most awards for a film franchise in a single category\n|Silly Symphony\n| rowspan=\"2\" |7 awards\n|1940\n|Considered as a short film series, awards resulted from 9 nominations in one category: Best Animated Short Film.\n|-\n|Tom and Jerry\n|1953\n|Considered as a short film series, awards resulted from 13 nominations in one category: Best Animated Short Film.\n|-\n| rowspan=\"3\" |Most nominations for a film\n|All About Eve\n| rowspan=\"3\" |14 nominations\n|1951\n|Nominations resulted in 6 wins.\n|-\n|Titanic\n|1998\n|Nominations resulted in 11 wins.\n|-\n|La La Land\n|2017\n|Nominations resulted in 6 wins.\n|-\n| rowspan=\"2\" |Most nominations for a film without a win\n|The Turning Point\n| rowspan=\"2\" |11 nominations\n|1978\n|\n|-\n|The Color Purple\n|1986\n|It also holds the record for most Oscar nominations without one for Best Director.\n|-\n| rowspan=\"2\" |Most nominations for a film franchise\n|Middle-Earth\n| rowspan=\"2\" |37 nominations\n|2015\n|Nominations resulted in 17 wins overall.\n|-\n|Star Wars\n|2020\n|Nominations resulted in 10 wins overall.\n|-\n|Most nominations for a film franchise without a win\n|The Color Purple\n|12 nominations\n|2024\n|Both 1985 and 2023 film versions of the novel did not win a single award.\n|-\n|Most nominations for a film franchise in a single category\n|Looney Tunes/Merrie Melodies\n|16 nominations\n|1964\n|Considered as a short film series, nominations resulted in 6 wins in one category: Best Animated Short Film.\n|-\n|Most nominations for a film franchise in a single category without a win\n|Marvel Cinematic Universe\n|14 nominations\n|2024\n|Nominations resulted none in one category: Best Visual Effects.\n|-\n! colspan=\"5\" |Age\n|-\n| rowspan=\"2\" |Oldest winners\n|James Ivory\n| rowspan=\"2\" |89 years old\n|2018\n| rowspan=\"2\" |, they remained the oldest winners in any competitive category.\n|-\n|Ann Roth\n|2021\n|-\n|Oldest nominee\n|John Williams\n|91 years old\n|2024\n|, he remained the oldest nominee in any competitive category.\n|-\n|Youngest winner\n|Tatum O'Neal\n|10 years old\n|1974\n|, she remained the youngest winner in any competitive category.\n|-\n|Youngest nominee\n|Justin Henry\n|8 years old\n|1980\n|, he remained the youngest nominee in any competitive category.\n|}\nHighest by films\nThe following nominees received at least 10 nominations:\n{| class=\"wikitable\" style=\"text-align: center;\"\n|-\n! scope=\"col\" width=\"58\"| Nominations\n! scope=\"col\" align=\"center\"| Title\n|-\n| rowspan=\"3\" style=\"text-align:center\"| 14\n| All About Eve\n|-\n| Titanic\n|-\n| La La Land\n|-\n| rowspan=\"12\" style=\"text-align:center\"| 13\n| Gone with the Wind\n|-\n| From Here to Eternity\n|-\n| Mary Poppins\n|-\n| ''Who's Afraid of Virginia Woolf?\n|-\n| Forrest Gump\n|-\n| Shakespeare in Love\n|-\n| The Lord of the Rings: The Fellowship of the Ring\n|-\n| Chicago\n|-\n| The Curious Case of Benjamin Button\n|-\n| The Shape of Water\n|-\n| Oppenheimer\n|-\n| Emilia Pérez\n|-\n| rowspan=\"18\" style=\"text-align:center\"| 12\n| Ben-Hur\n|-\n| Mrs. Miniver\n|-\n| The Song of Bernadette\n|-\n| Johnny Belinda\n|-\n| A Streetcar Named Desire\n|-\n| On the Waterfront\n|-\n| My Fair Lady\n|-\n| Becket\n|-\n| Oliver!\n|-\n| Reds\n|-\n| Dances With Wolves\n|-\n| Schindler's List\n|-\n| The English Patient\n|-\n| Gladiator\n|-\n| The King's Speech\n|-\n| Lincoln\n|-\n| The Revenant\n|-\n| The Power of the Dog\n|-\n| rowspan=\"25\" style=\"text-align:center\"| 11\n| Mr. Smith Goes to Washington\n|-\n| Rebecca\n|-\n| Sergeant York\n|-\n| The Pride of the Yankees\n|-\n| Sunset Boulevard\n|-\n| West Side Story\n|-\n| Judgment at Nuremberg\n|-\n| The Godfather Part II\n|-\n| Chinatown\n|-\n| The Turning Point\n|-\n| Out of Africa\n|-\n| The Color Purple\n|-\n| Julia\n|-\n| Gandhi\n|-\n| Terms of Endearment\n|-\n| Amadeus\n|-\n| A Passage to India\n|-\n| Saving Private Ryan\n|-\n| The Lord of the Rings: The Return of the King\n|-\n| The Aviator\n|-\n| Hugo\n|-\n| Life of Pi\n|-\n| Joker\n|-\n| Everything Everywhere All at Once\n|-\n| Poor Things\n|-\n| rowspan=\"47\" style=\"text-align:center\"| 10\n| The Life of Emile Zola\n|-\n| How Green Was My Valley\n|-\n| Going My Way\n|-\n| Wilson\n|-\n| Roman Holiday\n|-\n| Giant\n|-\n| Sayonara\n|-\n| The Apartment\n|-\n| Lawrence of Arabia\n|-\n| Tom Jones\n|-\n| The Sound of Music\n|-\n| Doctor Zhivago\n|-\n| Bonnie and Clyde\n|-\n| Guess Who's Coming to Dinner\n|-\n| Anne of the Thousand Days\n|-\n| Patton\n|-\n| Airport\n|-\n| The Godfather\n|-\n| Cabaret\n|-\n| The Sting\n|-\n| The Exorcist\n|-\n| Rocky\n|-\n| Network\n|-\n| Star Wars\n|-\n| On Golden Pond\n|-\n| Tootsie\n|-\n| Bugsy\n|-\n| Braveheart\n|-\n| Crouching Tiger, Hidden Dragon\n|-\n| Gangs of New York\n|-\n| Master and Commander: The Far Side of the World\n|-\n| Slumdog Millionaire\n|-\n| True Grit\n|-\n| The Artist\n|-\n| American Hustle\n|-\n| Gravity\n|-\n| Mad Max: Fury Road\n|-\n| The Favourite\n|-\n| Roma\n|-\n| The Irishman\n|-\n| 1917\n|-\n| Once Upon a Time in Hollywood\n|-\n| Mank\n|-\n| Dune\n|-\n| Killers of the Flower Moon\n|-\n| The Brutalist\n|-\n| Wicked\n|}\nThe following winners received at least 5 awards (including non-competitive):\n{| class=\"wikitable\" style=\"text-align: center;\"\n|-\n! scope=\"col\" width=\"56\"| Awards\n! scope=\"col\" align=\"center\"| Title\n|-\n| rowspan=\"3\" style=\"text-align:center\"| 11\n| Ben-Hur\n|-\n| Titanic\n|-\n| The Lord of the Rings: The Return of the King\n|-\n| style=\"text-align:center\"| 10\n| West Side Story\n|-\n| rowspan=\"3\" style=\"text-align:center\"| 9\n| Gigi\n|-\n| The Last Emperor\n|-\n| The English Patient\n|-\n| rowspan=\"8\" style=\"text-align:center\"| 8\n| Gone with the Wind\n|-\n| From Here to Eternity\n|-\n| On the Waterfront\n|-\n| My Fair Lady\n|-\n| Cabaret\n|-\n| Gandhi\n|-\n| Amadeus\n|-\n| Slumdog Millionaire\n|-\n| rowspan=\"14\" style=\"text-align:center\"| 7\n| Going My Way\n|-\n| The Best Years of Our Lives\n|-\n| The Bridge on the River Kwai\n|-\n| Lawrence of Arabia\n|-\n| Patton\n|-\n| The Sting\n|-\n| Star Wars\n|-\n| Out of Africa\n|-\n| Dances With Wolves\n|-\n| Schindler's List\n|-\n| Shakespeare in Love\n|-\n| Gravity\n|-\n| Everything Everywhere All at Once\n|-\n| Oppenheimer\n|-\n| rowspan=\"14\" style=\"text-align:center\"| 6\n|-\n| Mrs. Miniver\n|-\n| All About Eve\n|-\n| An American in Paris\n|-\n| A Place in the Sun\n|-\n| A Man for All Seasons\n|-\n| Oliver!\n|-\n| The Godfather Part II\n|-\n| Forrest Gump\n|-\n| Chicago\n|-\n| The Hurt Locker\n|-\n| Mad Max: Fury Road\n|-\n| La La Land\n|-\n| Dune\n|-\n| rowspan=\"27\" style=\"text-align:center\"| 5\n| It Happened One Night\n|-\n| How Green Was My Valley\n|-\n| Wilson\n|-\n| The Bad and the Beautiful\n|-\n| Around the World in 80 Days\n|-\n| The King and I\n|-\n| The Apartment\n|-\n| Mary Poppins\n|-\n| The Sound of Music\n|-\n| Doctor Zhivago\n|-\n| Who's Afraid of Virginia Woolf?\n|-\n| In the Heat of the Night\n|-\n| The French Connection\n|-\n| One Flew Over the Cuckoo's Nest\n|-\n| The Deer Hunter\n|-\n| Kramer vs. Kramer\n|-\n| Raiders of the Lost Ark\n|-\n| Terms of Endearment\n|-\n| The Silence of the Lambs\n|-\n| Braveheart\n|-\n| Saving Private Ryan\n|-\n| American Beauty\n|-\n| Gladiator\n|-\n| The Aviator\n|-\n| Hugo\n|-\n| The Artist\n|-\n| Anora\n|}\nHighest by franchises or remakes\nThe following film franchises or remakes received at least six nominations:\n{| class=\"wikitable\" style=\"text-align: center;\"\n|-\n! scope=\"col\" width=\"56\"| Nominations\n! scope=\"col\" align=\"center\"| Title\n! scope=\"col\" align=\"center\"| No. of films\n|-\n| style=\"text-align:center\" rowspan=\"2\"| 37\n| Star Wars\n| 11\n|-\n| Middle-earth (consists of The Lord of the Rings and The Hobbit)\n| 6\n|-\n| 29\n| Batman\n| 7\n|-\n| 28\n| The Godfather\n| 3\n|-\n| 27\n| Marvel Cinematic Universe\n| 15\n|-\n| 26\n| What Price Hollywood? / A Star Is Born\n| 5\n|-\n| 20\n| The Wizard of Oz\n| 4\n|-\n| 19\n| James Bond\n| 11\n|-\n| rowspan=\"2\" | 18\n| Going My Way / The Bells of St. Mary's\n| 2\n|-\n| West Side Story\n| 2\n|-\n| 17\n| Mary Poppins\n| 2\n|-\n| style=\"text-align:center\" rowspan=\"4\"| 16\n| Looney Tunes\n| 16\n|-\n| Star Trek\n| 7\n|-\n| Dune\n| 3\n|-\n| Here Comes Mr. Jordan / Heaven Can Wait\n| 2\n|-\n| 15\n| Mutiny on the Bounty\n| 2\n|-\n| style=\"text-align:center\" rowspan=\"3\"| 14\n| Wizarding World\n| 9\n|-\n| Indiana Jones\n| 4\n|-\n| Little Women\n| 4\n|-\n| style=\"text-align:center\" rowspan=\"8\"| 13\n| Tom and Jerry\n| 13\n|-\n| Hamlet\n| 3\n|-\n| All Quiet on the Western Front\n| 2\n|-\n| Avatar\n| 2\n|-\n| Funny Girl / Funny Lady\n| 2\n|-\n| Gladiator\n| 2\n|-\n| The Hustler / The Color of Money\n| 2\n|-\n| Chicago\n| 1\n|-\n| style=\"text-align:center\" rowspan=\"7\"| 12\n| Alien\n| 5\n|-\n| Rocky\n| 3\n|-\n| The Color Purple\n| 2\n|-\n| Les Misérables\n| 2\n|-\n| True Grit\n| 2\n|-\n| Ben-Hur\n| 1\n|-\n| Mrs. Miniver\n| 1\n|-\n| style=\"text-align:center\" rowspan=\"7\"| 11\n| Life of Jesus Christ\n| 5\n|-\n| Toy Story\n| 4\n|-\n| Pirates of the Caribbean\n| 3\n|-\n| The Sting\n| 2\n|-\n| Chinatown\n| 1\n|-\n| Oliver Twist\n| 1\n|-\n| Rebecca\n| 1\n|-\n| style=\"text-align:center\" rowspan=\"7\"| 10\n| Donald Duck\n| 10\n|-\n| Mickey Mouse\n| 10\n|-\n| Top Gun\n| 2\n|-\n| Crouching Tiger, Hidden Dragon\n| 1\n|-\n| The Exorcist\n| 1\n|-\n| Guess Who's Coming to Dinner\n| 1\n|-\n| Mad Max\n| 1\n|-\n| style=\"text-align:center\" rowspan=\"5\"| 9\n| Romeo and Juliet\n| 3\n|-\n| Elizabeth\n| 2\n|-\n| Life of Moses\n| 2\n|-\n| Dr. Dolittle\n| 1\n|-\n| The King and I\n| 1\n|-\n| style=\"text-align:center\" rowspan=\"10\"| 8\n| Wallace & Gromit\n| 8\n|-\n| Spider-Man\n| 5\n|-\n| King Kong\n| 3\n|-\n| Babe\n| 2\n|-\n| Beauty and the Beast\n| 2\n|-\n| The Philadelphia Story / High Society\n| 2\n|-\n| Around the World in 80 Days\n| 1\n|-\n| The French Connection\n| 1\n|-\n| The Last Picture Show\n| 1\n|-\n| Wuthering Heights\n| 1\n|-\n| style=\"text-align:center\" rowspan=\"12\"| 7\n| Transformers\n| 3\n|-\n| Aladdin\n| 2\n|-\n| Blade Runner\n| 2\n|-\n| Henry V\n| 2\n|-\n| Hercule Poirot\n| 2\n|-\n| The Phantom of the Opera\n| 2\n|-\n| All the King's Men\n| 1\n|-\n| The Fugitive\n| 1\n|-\n| The Great Ziegfeld\n| 1\n|-\n| Hannibal Lecter\n| 1\n|-\n| Sense and Sensibility\n| 1\n|-\n| Stagecoach\n| 1\n|-\n| style=\"text-align:center\" rowspan=\"10\"| 6\n| Planet of the Apes\n| 5\n|-\n| Shrek\n| 4\n|-\n| The Jungle Book\n| 3\n|-\n| Robin Hood\n| 3\n|-\n| The Broadway Melody\n| 2\n|-\n| Dr. Jekyll and Mr. Hyde\n| 2\n|-\n| Scent of a Woman\n| 2\n|-\n| The More the Merrier\n| 1\n|-\n| Terminator\n| 1\n|}\nThe following film franchises or remakes received at least three awards (including non-competitive):\n{| class=\"wikitable\" style=\"text-align: center;\"\n|-\n! scope=\"col\" width=\"55\"| Awards\n! scope=\"col\" align=\"center\"| Title\n! scope=\"col\" align=\"center\"| No. of films\n|-\n| style=\"text-align:center\"| 17\n| The Lord of the Rings\n| 3\n|-\n| style=\"text-align:center\" rowspan=\"2\"| 11\n| West Side Story\n| 2\n|-\n| Ben-Hur\n| 1\n|-\n| style=\"text-align:center\"| 10\n| Star Wars\n| 3\n|-\n| style=\"text-align:center\"| 9\n| The Godfather\n| 2\n|-\n| style=\"text-align:center\" rowspan=\"2\"| 8\n| Dune\n| 2\n|-\n| Going My Way / The Bells of St. Mary's\n| 2\n|-\n| style=\"text-align:center\" rowspan=\"4\"| 7\n| Looney Tunes\n| 7\n|-\n| Tom and Jerry\n| 7\n|-\n| Indiana Jones\n| 3\n|-\n| The Sting\n| 1\n|-\n| style=\"text-align:center\" rowspan=\"6\"| 6\n| James Bond\n| 5\n|-\n| All Quiet on the Western Front\n| 2\n|-\n| Chicago\n| 1\n|-\n| Mad Max\n| 1\n|-\n| Mrs. Miniver\n| 1\n|-\n| Oliver Twist\n| 1\n|-\n| rowspan=\"7\" style=\"text-align:center\"| 5\n| Batman\n| 3\n|-\n| Around the World in 80 Days\n| 1\n|-\n| The French Connection\n| 1\n|-\n| Gladiator\n| 1\n|-\n| Hannibal Lecter\n| 1\n|-\n| The King and I\n| 1\n|-\n| Mary Poppins\n| 1\n|-\n| rowspan=\"10\" style=\"text-align:center\"| 4\n| A Star Is Born\n| 3\n|-\n| Toy Story\n| 3\n|-\n| Avatar\n| 2\n|-\n| King Kong\n| 2\n|-\n| Marvel Cinematic Universe\n| 2\n|-\n| The Wizard of Oz\n| 2\n|-\n| Crouching Tiger, Hidden Dragon\n| 1\n|-\n| Hamlet\n| 1\n|-\n| The Matrix\n| 1\n|-\n| Terminator\n| 1\n|-\n| rowspan=14 style=\"text-align:center\"| 3\n| Little Women\n| 3\n|-\n| Wallace & Gromit\n| 3\n|-\n| Alien\n| 2\n|-\n| Here Comes Mr. Jordan / Heaven Can Wait\n| 2\n|-\n| The Hustler / The Color of Money\n| 2\n|-\n| Pinocchio\n| 2\n|-\n| All the King's Men\n| 1\n|-\n| Dracula\n| 1\n|-\n| The Great Ziegfeld\n| 1\n|-\n| Jurassic Park\n| 1\n|-\n| Les Misérables\n| 1\n|-\n| Miracle on 34th Street\n| 1\n|-\n| Robin Hood\n| 1\n|-\n| Rocky''\n| 1\n|}\nHighest by people\nThe following nominees received at least 5 nominations:\n{| class=\"wikitable\" style=\"text-align: center;\"\n|-\n! scope=\"col\" width=\"55\"| Nominations\n! scope=\"col\" align=\"center\"| Title\n! scope=\"col\" align=\"center\"| Role\n|-\n| style=\"text-align:center\"| 59\n| Walt Disney\n| Producer, animator, and voice actor\n|-\n| style=\"text-align:center\"| 54\n| John Williams\n| Composer\n|-\n| style=\"text-align:center\"| 45\n| Alfred Newman\n| Composer\n|-\n| style=\"text-align:center\"| 39\n| Cedric Gibbons\n| Production designer\n|-\n| style=\"text-align:center\"| 35\n| Edith Head\n| Costume designer\n|-\n| style=\"text-align:center\"| 32\n| Edwin B. Willis\n| Production designer\n|-\n| style=\"text-align:center\"| 29\n| Lyle R. Wheeler\n| Art director\n|-\n| style=\"text-align:center\"| 26\n| Sammy Cahn\n| Songwriter\n|-\n| rowspan=\"2\" style=\"text-align:center\"| 25\n| Andy Nelson\n| Sound engineer\n|-\n| Max Steiner\n| Composer\n|-\n| style=\"text-align:center\"| 24\n| Woody Allen\n| Filmmaker\n|-\n| rowspan=\"3\" style=\"text-align:center\"| 23\n| Hans Dreier\n| Art director\n|-\n| Hal Pereira\n| Art director and production designer\n|-\n| Steven Spielberg\n| Filmmaker\n|-\n| rowspan=\"4\" style=\"text-align:center\"| 22\n| Samuel M. Comer\n| Art director\n|-\n| Randy Newman\n| Composer and songwriter\n|-\n| Dimitri Tiomkin\n| Composer\n|-\n| Victor Young\n| Composer\n|-\n| rowspan=\"3\" style=\"text-align:center\"| 21\n| Kevin O'Connell\n| Sound mixer\n|-\n| Meryl Streep\n| Actress\n|-\n| Billy Wilder\n| Filmmaker\n|-\n| style=\"text-align:center\"| 20\n| Gary Rydstrom\n| Sound designer and film director\n|-\n| style=\"text-align:center\"| 19\n| Alan Menken\n| Composer and songwriter\n|-\n| style=\"text-align:center\"| 18\n| Henry Mancini\n| Composer and songwriter\n|-\n| rowspan=\"2\" style=\"text-align:center\"| 17\n| Gordon Hollingshead\n| Producer\n|-\n| Fred Quimby\n| Animator\n|-\n| rowspan=\"6\" style=\"text-align:center\"| 16\n| Roger Deakins\n| Cinematographer\n|-\n| Charles LeMaire\n| Costume designer\n|-\n| Greg P. Russell\n| Sound engineer\n|-\n| Martin Scorsese\n| Filmmaker\n|-\n| Irene Sharaff\n| Costume designer and art director\n|-\n| Diane Warren\n| Songwriter\n|-\n| rowspan=\"6\" style=\"text-align:center\"| 15\n| Warren Beatty\n| Actor and filmmaker\n|-\n| Christopher Boyes\n| Sound engineer\n|-\n| Thomas Newman\n| Composer\n|-\n| Alex North\n| Composer\n|-\n| Sandy Powell\n| Costume designer\n|-\n| William Wyler\n| Filmmaker\n|-\n| rowspan=\"3\" style=\"text-align:center\"| 14\n| Ethan and Joel Coen\n| Filmmakers\n|-\n| Francis Ford Coppola\n| Filmmaker\n|-\n| Jean Louis\n| Costume designer\n|-\n| rowspan=\"2\" style=\"text-align:center\"| 13\n| Richard Day\n| Art director\n|-\n| Stanley Kubrick\n| Filmmaker\n|-\n| rowspan=\"7\" style=\"text-align:center\"| 12\n| Colleen Atwood\n| Costume designer\n|-\n| Bradley Cooper\n| Actor, filmmaker, and producer\n|-\n| Federico Fellini\n| Filmmaker\n|-\n| Katharine Hepburn\n| Actress\n|-\n| Dorothy Jeakins\n| Costume designer\n|-\n| Jack Nicholson\n| Actor\n|-\n| Hans Zimmer\n| Composer\n|-\n| rowspan=\"10\" style=\"text-align:center\"| 11\n| Paul Thomas Anderson\n| Filmmaker\n|-\n| Rick Baker\n| Special make-up effects artist\n|-\n| Alfonso Cuarón\n| Filmmaker\n|-\n| Alexandre Desplat\n| Composer\n|-\n| Clint Eastwood\n| Actor and filmmaker\n|-\n| Doug Hemphill\n| Sound engineer\n|-\n| David Lean\n| Filmmaker\n|-\n| Joe Letteri\n| Visual effects artist\n|-\n| Laurence Olivier\n| Actor and filmmaker\n|-\n| George Stevens\n| Filmmaker\n|-\n| rowspan=\"7\" style=\"text-align:center\"| 10\n| Anna Behlmer\n| Sound mixer\n|-\n| Bette Davis\n| Actress\n|-\n| Dante Ferretti\n| Art director, production designer and costume designer\n|-\n| Walter Plunkett\n| Costume designer\n|-\n| Helen Rose\n| Costume designer\n|-\n| Bill Thomas\n| Costume designer\n|-\n| Denzel Washington\n| Actor and filmmaker\n|-\n| rowspan=\"16\" style=\"text-align:center\"| 9\n| Ingmar Bergman\n| Filmmaker\n|-\n| Milena Canonero\n| Costume designer\n|-\n| Robert De Niro\n| Actor and producer\n|-\n| Pete Docter\n| Filmmaker, animator and voice actor\n|-\n| Jacqueline Durran\n| Costume designer\n|-\n| Nancy Haigh\n| Set decorator\n|-\n| Alejandro González Iñárritu\n| Filmmaker\n|-\n| Peter Jackson\n| Filmmaker\n|-\n| Richard King\n| Sound engineer\n|-\n| Stanley Kramer\n| Filmmaker\n|-\n| Catherine Martin\n| Costume designer, production designer and producer\n|-\n| Scott Millan\n| Sound mixer\n|-\n| Scott Rudin\n| Producer\n|-\n| Thelma Schoonmaker\n| Film editor\n|-\n| Stephen Schwartz\n| Composer and songwriter\n|-\n| Sherman Brothers\n| Composers and songwriters\n|-\n| rowspan=\"18\" style=\"text-align:center\"| 8\n| Wes Anderson\n| Filmmaker\n|-\n| Cate Blanchett\n| Actress\n|-\n| Kenneth Branagh\n| Actor and filmmaker\n|-\n| Marlon Brando\n| Actor\n|-\n| James L. Brooks\n| Filmmaker\n|-\n| George Clooney\n| Actor and filmmaker\n|-\n| Glenn Close\n| Actress\n|-\n| Judi Dench\n| Actress\n|-\n| Dede Gardner\n| Producer\n|-\n| Michael Kahn\n| Film editor\n|-\n| Kathleen Kennedy\n| Producer\n|-\n| Jack Lemmon\n| Actor\n|-\n| Francesca Lo Schiavo\n| Set decorator\n|-\n| Emmanuel Lubezki\n| Cinematographer\n|-\n| Frances McDormand\n| Actress and producer\n|-\n| Christopher Nolan\n| Filmmaker\n|-\n| Peter O'Toole\n| Actor\n|-\n| Ken Ralston\n| Visual effects supervisor\n|-\n| rowspan=\"17\" style=\"text-align:center\"| 7\n| Howard Ashman\n| Lyricist\n|-\n| Ingrid Bergman\n| Actress\n|-\n| Nathan Crowley\n| Art director and production designer\n|-\n| Dennis Gassner\n| Production designer\n|-\n| Jeff Bridges\n| Actor\n|-\n| Richard Burton\n| Actor\n|-\n| James Cameron\n| Filmmaker\n|-\n| Leonardo DiCaprio\n| Actor and producer\n|-\n| Eric Fellner\n| Producer\n|-\n| Jane Fonda\n| Actress\n|-\n| Jeremy Kleiner\n| Producer\n|-\n| Martin McDonagh\n| Filmmaker\n|-\n| Brad Pitt\n| Actor and producer\n|-\n| Sydney Pollack\n| Filmmaker\n|-\n| Mary Wills\n| Costume designer\n|-\n| Kate Winslet\n| Actress\n|-\n| Albert Wolsky\n| Costume designer\n|-\n| rowspan=\"17\" style=\"text-align:center\"| 6\n| Amy Adams\n| Actress\n|-\n| Tim Bevan\n| Producer\n|-\n| John Bright\n| Costume designer\n|-\n| Alexandra Byrne\n| Costume designer\n|-\n| Ellen Burstyn\n| Actress\n|-\n| Daniel Day-Lewis\n| Actor\n|-\n| Guillermo del Toro\n| Filmmaker\n|-\n| Margaret Furse\n| Costume designer\n|-\n| Tom Hanks\n| Actor\n|-\n| Yorgos Lanthimos\n| Filmmaker\n|-\n| Ennio Morricone\n| Composer\n|-\n| Patricia Norris\n| Costume designer\n|-\n| Nick Park\n| Animator\n|-\n| Maggie Smith\n| Actress\n|-\n| Andrew Stanton\n| Animator and filmmaker\n|-\n| Gile Steele\n| Costume designer\n|-\n| Richard Taylor\n| Costume designer, special make-up effects artist and visual effects artist\n|-\n| rowspan=\"27\" style=\"text-align:center\"| 5\n| Annette Bening\n| Actress\n|-\n| Brad Bird\n| Animator and filmmaker\n|-\n| Matt Damon\n| Actor, filmmaker and producer\n|-\n| Danilo Donati\n| Costume designer and production designer\n|-\n| Todd Field\n| Filmmaker\n|-\n| Jodie Foster\n| Actress\n|-\n| Morgan Freeman\n| Actor\n|-\n| Alfred Hitchcock\n| Filmmaker\n|-\n| Elton John\n| Songwriter\n|-\n| Nicole Kidman\n| Actress\n|-\n| James Mangold\n| Filmmaker\n|-\n| Frank Marshall\n| Producer\n|-\n| Julianne Moore\n| Actress\n|-\n| Vittorio Nino Novarese\n| Costume designer\n|-\n| Gregory Peck\n| Actor\n|-\n| Sean Penn\n| Actor\n|-\n| Roman Polanski\n| Filmmaker\n|-\n| Renié\n| Costume designer\n|-\n| Ann Roth\n| Costume designer\n|-\n| David O. Russell\n| Filmmaker\n|-\n| Susan Sarandon\n| Actress\n|-\n| Howard Shoup\n| Costume designer\n|-\n| Emma Stone\n| Actress and producer\n|-\n| Barbra Streisand\n| Actress, songwriter and producer\n|-\n| Piero Tosi\n| Costume designer\n|-\n| Jacqueline West\n| Costume designer\n|-\n| Michelle Williams\n| Actress\n|}\nThe following winners received at least 3 awards (including non-competitive):\n{| class=\"wikitable\" style=\"text-align: center;\"\n|-\n! scope=\"col\" width=\"55\"| Awards\n! scope=\"col\" align=\"center\"| Title\n! scope=\"col\" align=\"center\"| Role\n|-\n| style=\"text-align:center\"| 26\n| Walt Disney\n| Producer, animator, and voice actor\n|-\n| style=\"text-align:center\"| 14\n| Douglas Shearer\n| Sound engineer, visual effect supervisor\n|-\n| style=\"text-align:center\"| 11\n| Cedric Gibbons\n| Production designer\n|-\n| style=\"text-align:center\"| 10\n| Farciot Edouart\n| Special effects artist and innovator\n|-\n| rowspan=\"2\" style=\"text-align:center\"| 9\n| Dennis Muren\n| Special effects artist and supervisor\n|-\n| Alfred Newman\n| Composer\n|-\n| rowspan=\"3\" style=\"text-align:center\"| 8\n| Edith Head\n| Costume designer\n|-\n| Alan Menken\n| Composer and songwriter\n|-\n| Edwin B. Willis\n| Production designer\n|-\n| rowspan=\"5\" style=\"text-align:center\"| 7\n| Rick Baker\n| Special make-up effects artist\n|-\n| Richard Day\n| Art director\n|-\n| Fred Quimby\n| Animator\n|-\n| Gary Rydstrom\n| Sound designer, editor, and mixer\n|-\n| Billy Wilder\n| Director, producer, and writer\n|-\n| rowspan=\"2\" style=\"text-align:center\"| 6\n| John Ford\n| Director and producer\n|-\n| Gordon Hollingshead\n| Producer\n|-\n| rowspan=\"15\" style=\"text-align:center\"| 5\n| John Barry\n| Composer and songwriter\n|-\n| Francis Ford Coppola\n| Director, producer, and writer\n|-\n| Clint Eastwood\n| Actor, director, and producer\n|-\n| Johnny Green\n| Composer, music supervisor, and producer\n|-\n| Alejandro González Iñárritu\n| Director, producer, and writer\n|-\n| Fred Hynes\n| Sound engineer\n|-\n| Gordon Jennings\n| Special effects supervisor\n|-\n| Richard King\n| Sound designer and editor\n|-\n| Joe Letteri\n| Visual effects artist\n|-\n| Thomas T. Moulton\n| Sound engineer\n|-\n| Ken Ralston\n| Visual effects supervisor\n|-\n| Irene Sharaff\n| Costume designer\n|-\n| Richard Taylor\n| Costume designer, special makeup artist, and visual effects supervisor\n|-\n| Lyle R. Wheeler\n| Art director\n|-\n| John Williams\n| Composer\n|-\n| rowspan=\"26\" style=\"text-align:center\"| 4\n| Woody Allen\n| Filmmaker\n|-\n| Colleen Atwood\n| Costume designer\n|-\n| Sean Baker\n| Filmmaker\n|-\n| Mark Berger\n| Sound engineer\n|-\n| John Box\n| Production designer and art director\n|-\n| Christopher Boyes\n| Sound engineer\n|-\n| Ben Burtt\n| Sound designer, editor, and mixer\n|-\n| Sammy Cahn\n| Songwriter\n|-\n| Milena Canonero\n| Costume designer\n|-\n| Ethan and Joel Coen\n| Filmmakers\n|-\n| Samuel M. Comer\n| Art director\n|-\n| Alfonso Cuarón\n| Filmmaker\n|-\n| Katharine Hepburn\n| Actress\n|-\n| Paul Lambert\n| Visual effects supervisor\n|-\n| Henry Mancini\n| Composer and songwriter\n|-\n| Catherine Martin\n| Costume designer and production designer\n|-\n| Frances McDormand\n| Actress and producer\n|-\n| Johnny Mercer\n| Songwriter\n|-\n| Scott Millan\n| Sound mixer\n|-\n| Laurence Olivier\n| Actor and filmmaker\n|-\n| Nick Park\n| Animator\n|-\n| André Previn\n| Composer and music supervisor\n|-\n| Dimitri Tiomkin\n| Composer\n|-\n| Jimmy Van Heusen\n| Songwriter\n|-\n| Robert Wise\n| Director and producer\n|-\n| William Wyler\n| Director and producer\n|-\n| rowspan=\"44\" style=\"text-align:center\"| 3\n| James Acheson\n| Costume designer\n|-\n| Cecil Beaton\n| Costume designer and production designer\n|-\n| Jenny Beavan\n| Costume designer\n|-\n| Alan and Marilyn Bergman\n| Songwriters\n|-\n| Ingrid Bergman\n| Actress\n|-\n| Bong Joon Ho\n| Filmmaker\n|-\n| Stephen Bosustow\n| Producer\n|-\n| Walter Brennan\n| Actor\n|-\n| James L. Brooks\n| Filmmaker\n|-\n| James Cameron\n| Filmmaker\n|-\n| Saul Chaplin\n| Composer and music supervisor\n|-\n| Daniels\n| Directors, producers, and writers\n|-\n| Daniel Day-Lewis\n| Actor\n|-\n| Adolph Deutsch\n| Composer and music supervisor\n|-\n| Pete Docter\n| Director, writer, animator, and voice actor\n|-\n| Ken Darby\n| Composer and music supervisor\n|-\n| Ralph Dawson\n| Film editor\n|-\n| Guillermo del Toro\n| Director, producer, and writer\n|-\n| Hans Dreier\n| Art director\n|-\n| Roger Edens\n| Composer and music supervisor\n|-\n| John Hubley\n| Director and animator\n|-\n| Marvin Hamlisch\n| Composer and songwriter\n|-\n| Doug Hemphill\n| Sound engineer\n|-\n| Peter Jackson\n| Filmmaker\n|-\n| Maurice Jarre\n| Composer\n|-\n| Dorothy Jeakins\n| Costume designer\n|-\n| Michael Kahn\n| Film editor\n|-\n| Michel Legrand\n| Composer and songwriter\n|-\n| Charles LeMaire\n| Costume designer\n|-\n| Emmanuel Lubezki\n| Cinematographer\n|-\n| Daniel Mandell\n| Film editor\n|-\n| Jack Nicholson\n| Actor\n|-\n| Orry-Kelly\n| Costume designer\n|-\n| Anthony Powell\n| Costume designer\n|-\n| Sandy Powell\n| Costume designer\n|-\n| Thelma Schoonmaker\n| Film editor\n|-\n| Stephen Schwartz\n| Songwriter\n|-\n| Steven Spielberg\n| Filmmaker\n|-\n| Max Steiner\n| Composer\n|-\n| Meryl Streep\n| Actress\n|-\n| Fran Walsh\n| Producer, writer and songwriter\n|-\n| Ned Washington\n| Songwriter\n|-\n| Paul Francis Webster\n| Songwriter\n|-\n| Richard Williams\n| Director and animator\n|}\nSee also\n* List of film awards\n* List of Academy Award-nominated films\n* List of actors with Academy Award nominations\n* List of superlative Academy Award winners and nominees\nFootnotes\nReferences\nFurther reading\n*\n*\n*\n**  German-language book review of the book.\n*\n*\n*\n*\nExternal links\n*\n*"
    }
  ]
}