{
  "content": [
    {
      "type": "text",
      "text": "# Accusations of racial bias in Grammy Awards\n\nAllegations of racism in the Grammy Awards, as expressed in award selections, have frequently been the target of criticism going back to its inception in 1957. These accusations have been highlighted by several controversial voting results, and the controversial voting process itself. Many of these allegations have yet to be proven directly. However, they have caused numerous speculations.\nBackground\nThe Grammy Award, as presented by the Recording Academy, is an award that recognizes achievement within all facets of the music industry. It covers all major genres and recognizes performances of albums and songs, songwriting, and new artists. Criticism of the Grammys has covered various aspects, with accusations of racial bias by media outlets and fans having been brought up for decades.\nControversy\nSince the inception of the Grammys in 1957, only 12 black artists have won the Album of the Year Award:\n*Stevie Wonder (Innervisions in 1974, ''Fulfillingness' First Finale in 1975, Songs in the Key of Life in 1977)\n*Michael Jackson (Thriller in 1984)\n*Lionel Richie (Can't Slow Down in 1985)\n*Quincy Jones (Back on the Block in 1991)\n*Natalie Cole (Unforgettable... with Love in 1992)\n*Whitney Houston (The Bodyguard: Original Soundtrack Album in 1994)\n*Lauryn Hill (The Miseducation of Lauryn Hill in 1999)\n*Outkast (Speakerboxxx/The Love Below in 2004)\n*Ray Charles (Genius Loves Company in 2005)\n*Herbie Hancock (River: The Joni Letters in 2008)\n*Jon Batiste (We Are in 2022)\n*Beyoncé (Cowboy Carter in 2025).\nFrom 2012 to 2020, statistics showed that black artists received only 26.7% of nominations for the awards show while they represented over 38% of all artists on the US Billboard'' Hot 100 chart.\nThere have been several best album wins that have been questioned including Beyoncé's self-titled album's loss in 2015 to Beck's Morning Phase for Album of the Year, Lemonade's 2017 loss to Adele's 25, and Renaissance's 2023 loss to Harry Styles's ''Harry's House''. Other cited examples include Michael Jackson's Off the Wall and Prince's 1999 failing to be nominated; Frank Ocean's Channel Orange losing to Mumford & Sons' Babel; Kendrick Lamar's Good Kid, M.A.A.D City losing Album of the Year to Daft Punk's Random Access Memories, and Best Rap Album to Macklemore & Ryan Lewis' The Heist in 2014, To Pimp a Butterfly's defeat to Taylor Swift's 1989 in 2016, and Damn's loss to Bruno Mars' 24K Magic in 2018; SZA's SOS losing to Taylor Swift's Midnights in 2024.\naccused the Grammys of deliberately putting black artists in \"urban\" categories such as hip-hop and R&B. When Igor was nominated for Best Rap Album at the 62nd Awards, he called it a \"backhanded compliment\".]]\nOthers have argued that non-white artists mostly win in smaller \"racialized\" categories. Beyoncé has most of her 32 awards within genre-specific categories, such as rap and R&B, categories that people of color primarily dominate. Ann Powers, an accredited writer for the National Public Radio, accused the 2017 Grammy Awards of systematic racism due to Chance the Rapper and Beyoncé being the only black artists who won televised awards. According to Powers, there is a general notion that music made with \"real\" instrumentation is superior to synth or sampled music, or that \"stand-still\" performances are outstanding to performances that incorporate dance.\nThe Grammys has also been criticized in the past for failing to nominate famous artists of color, such as The Weeknd. The Academy's failure to nominate the Weeknd's work came as a major surprise considering the widespread success of his 2020 album After Hours and its single, \"Blinding Lights\". The track set numerous records, including spending 40 weeks within the top ten in the U.S., four of which the song was at number one, and spending 28 weeks in the top five. After it received no nominations from the Recording Academy, the Weeknd wrote \"The Grammys remain corrupt. You owe me, my fans and the industry transparency\".\nVoting process\nThe voting process for the Grammy Awards has seen much criticism over the years. The voting committees are made up of hundreds of musical experts, including musicians, producers, engineers, and songwriters. Members of the Recording Academy will submit their picks for nomination, which will then be screened by 350 individuals to ensure that the nominee is placed in the correct category and eligible for a potential award. Members are then asked to vote in up to 10 genre categories and three general categories. The votes are sent to independent accounting firm Deloitte to be tallied, and a comprehensive list is sent back to the Recording Academy to be voted upon for a final time. These ballots are again counted by Deloitte and the winners are sealed until the night of the awards.\nControversy has been raised over the fact that members vote for works in categories outside of their expertise, and this occurs because they are required to vote on a certain number of categories to maintain membership. Rob Kenner, a Grammy screener, described an \"unwritten rule\" among committee members to be cautious nominating an album by an already well-known artist if they did not want that album to eventually win an award. Kenner claims that voting members are more likely to select an album based on its popularity and name recognition, even if they have never heard the music before.\nAnother controversial aspect of the voting process focuses on the lack of transparency regarding the composition of voting committees. The nominations for a wide variety of categories are shaped by many committees, but little is known about who are on these committees, how they are formed, or who puts them together. Looking on the official Grammy website provides no further clarity, thus obscuring the process further.\nReferences"
    }
  ]
}