{
  "content": [
    {
      "type": "text",
      "text": "# Acehnese invasion of Johor\n\n* Fall and the destruction of Batu Sawar\n| combatant1        =  Sultanate of Aceh\n| combatant2        =  Johor Sultanate Dutch East India Company\n| commander1        =  Iskandar Muda\n| commander2        =  Alauddin Riayat Shah III  Abdullah Ma'ayat Shah\n| strength1         = First invasion:20,000–40,000 men60–70 shipsSecond invasion:30,000–40,000 men300 ships\n| strength2         = First invasion:Unknown Johorese garrison31 Dutch menSecond invasion:Unknown\n| casualties1       = Unknown\n| casualties2       = Heavy Johorese casualties22 Dutch captured\n| partof            = Dutch-Acehnese conflicts & Malay-Acehnese conflicts\n}}\nThe Acehnese launched their invasion of Johor between 1613 and 1615 to subjugate and vassalise the Johor Sultanate, as part of the Acehenese expansion in the Malay peninsula under Iskandar Muda reign.\nBackground\nAceh has been a long-term enemy of the johorese, and the actual conflicts start when the Acehnese began expanding their empire by invading and capturing several Sumatran ports like Pidie and Pasai, whom the Portuguese infiltrated, the Johorese saw the Acehnese as a danger to their rule while the Acehnese saw the Johorese as traitors for siding with the Portuguese in Malacca, in 1564 Alauddin Riayat Shah II of Johor was captured by the Acehnese and later executed, in 1568 the Johorese assisted the Portuguese against Acehnese siege of Malacca. Because of the frequent alliances between Johor and the Portuguese this gave enough justification for the Acehnese to invade Johor who sought to wipe out the Portuguese presence in the Malay peninsula.\nFirst invasion\nOn 4 May 1613, the Acehnese, with a large army between 20,000 and 40,000 and an armada consisting of 60 to 70 ships invaded Johor, they overran the Johor River and attacked coastal settlements such as Johor Lama, Batu Sawar, and also the Town of Singapore, the Acehnese found out some of the Dutch in Johor, they demanded the Dutch to be neutral during the conflict with the promise that no harm would be done to them, the Dutch serving the Johor sultan, retorted because they signed a treaty to protect Johor from any attack, but unsure of how to deal with them since they were allies of the Dutch East India Company or VOC company, the resident members of the VOC encouraged the Dutch to resist, 6 members of the company alongside 25 men fought with the Johor but were outnumbered, Batu Sawar fell on 6 June, the Acehnese captured the sultan's younger brother Abdullah Ma'ayat Shah alongside 22 Dutch men.\nThe fate of the Johorese sultan Alauddin Riayat Shah III is disputed with some saying he was captured by the Acehnese and executed while others stated he escaped to the Lingga Island where he died in 1615. The captured Dutchmen were taken to Aceh as prisoners of war, where they apologised to Sultan, saying that they were bound by their treaty of 1606 with Johor to defend the sultan who was a friend of the Dutch, Iskandar was troubled by the fact that the Dutch had come to the defence of his Malay enemy, yet he forgave them and allowed the\ncaptives to stay in their lodge on bail of the company's goods.\nHis younger brother, Abdullah Ma'ayat Shah known as \"Raja Bongsu\" was married to Iskandar Muda's sister and sent back to Johor to rule it as a Vassal of Aceh, because of his anti-Portuguese stance, he was a better candidate, returning with 2,000 Achenese to rebuild Batu Sawar.\nSecond invasion\nIn 1614, Johor once again made a truce with the Portuguese, this political setback was a challenge to the Acehnese power equilibrium gained over Malacca, Malacca's ability to force Abdullah shows Aceh's ineffective authority over Johor, and this time the Acehnese Armada of 300 and 30000 to 40000 men invaded Johor in September 1615 and for the second time destroyed Batu Sawar, Abdullah escaped and have taken refuge in Bintan Island,\nAftermath\nIn 1615, the Acehnese armada attempted to attack Portuguese Malacca, but encountered a Portuguese fleet that engaged them at the Battle of Formoso River. In the battle, one of the Portuguese galleons blew up when its gunpowder magazine caught fire causing confusion in Portuguese ranks and the Acehnese captured between 50 and 60 Portuguese prisoners. Having suffered thousands of casualties in the battle, the Acehnese called off the attack on Malacca and fled to Aceh.\nDespite Achenese destruction of the Johorese capital, they failed to capture its sultan, Abdullah, Iskandar Muda was preparing a third expedition to capture the sultan with an armada of 200 Proa, 1623 they succeeded in capturing Lingga island and destroying his residence and capturing many of his subjects, Abdullah later escaped to Tambelan Archipelago where he died there.\nSee also\n* Acehnese conquest of Perak\n* Acehnese invasion of Kedah\nNotes\n*  According to Denys Lombard, he identifies this battle's location in Bintan, which contradicts the location of Steven van der Hagen letter at Batu pahat, according to Nuruddin ar-Raniri the author of Bustan as-Salatin, the Acehnese defeated the Portuguese, captured a high ranking prisoner, killed or captured many of them and seized several of their ships.\nReferences"
    }
  ]
}