{
  "content": [
    {
      "type": "text",
      "text": "# ACG (subculture)\n\nACG (\"Animation, Comics, and Games\") is a term used to describe some subcultures of China and East Asia. Because there is a strong economic and cultural interlinkage that exists between anime, manga, and games in Japanese and East Asian culture at large, the term ACG is an exonym used to describe this phenomenon across the different subcultures. The term refers in particular to Japanese anime, manga, and video games. The most commonly used endonym translates to \"two-dimensional space\" (); Chinese:  二次元, Pinyin: Èrcìyuán).\nEtymology\nIn 1995, a Taiwanese fan of animation and comics using the name \"AIplus\" established a board at National Sun Yat-sen University's BBS; the board was named the \"ACG_Review Board\", referring to animation, comics, and games. It is considered the first appearance of the term \"ACG\". Popularizing by Taiwanese anime and comics critique group Shuffle Alliance, the arrangement of the three letters was stabilized, and the term became popular in Mainland China, Hong Kong, Macau and Taiwan.\nAfter light novels, which are often adapted into anime, comics, and video games, became more popular, the term \"ACGN\" was coined. However, the term ACG is still used in the majority of situations and is generally thought to include light novels even without \"N\".\nIn other regions\nJapanese do not use the term ACG, though a similar concept is \"MAG\", meaning \"Manga, Anime, and Games\". Japanese speakers usually use  to refer to a series of anime and manga culture (containing light novels and garage kits). The  refers to the related subculture, while  refers to related industries.\nIn India, \"AVGC\" is used instead, meaning \"Animation, Visual Effects, Gaming, and Comics\".\nThough the term is common in Sinophone-speaking areas and East Asia, it is not prevalent in the Anglosphere.\nSee also\n* Anime and manga fandom\n* Cosplay\n* Doujin\n* Glossary of anime and manga\n* Otaku\nReferences"
    }
  ]
}