{
  "content": [
    {
      "type": "text",
      "text": "# Achaemenid dynasty__disambig_2\n\n]]|Great King|King of Media|King of Anshan}}King of BabylonPharaoh of Egypt\n| cadet branches =\n}}\nThe Achaemenid dynasty ( ; }} ; }} ; ) was a royal house that ruled the Achaemenid Empire, which eventually stretched from Egypt and the Balkans in the west to Central Asia and the Indus Valley in the east.\nOrigins\nThe history of the Achaemenid dynasty is mainly known through Greek historians, such as Herodotus, Thucydides, and Xenophon. Additional sources include the Hebrew Bible, other Jewish religious texts, and native Iranian sources. According to Herodotus, the Achaemenids were a clan of the Pasargadae tribe:These were the leading tribes, on which all the other Persians were dependent, namely the Pasargadae, Maraphians, and Maspioi. Of these, the Pasargadae are the most noble and include the family of Achaemenids, the Kings of Persia, who are descendants of Perseus.Darius the Great, in an effort to establish his legitimacy, later traced his genealogy to Achaemenes, Persian . His son was given as Teispes, and from him came in turn Ariaramnes, Arsames, and Hystaspes. However, there is no historical evidence for any of these.\nDynasty\nThe Persian Empire was a hereditary monarchy, though the spirit of eldest son succession was often violated through palace intrigues. The historical kings as given in Greek sources are:\n{| class=\"wikitable\" align=\"center\"\n|+Achaemenid rulers\n|Cyrus I\n|late 7th century BC\n|King of the city of Anshan in Persia\n|-\n|Cambyses I\n|early 6th century–559 BC\n|Vassal of Astyages, king of the Medes (r. 584-550), and married to his daughter Mandane.\n|-\n|Cyrus II\n|559–530 BC\n|Conquered the Mede empire c. 550, thus founding the Persian Empire; conquered Lydia in 547, which already controlled several Hellenic cities on the Anatolian coast; soon extended his control to include them; conquered the Neo-Babylonian Empire in 539, freeing the Hebrews enslaved by the Babylonians.\n|-\n|Cambyses II\n|530–522 BC\n|Focused his efforts on conquering Egypt, Libya, and Ethiopia.\n|-\n|Bardiya (or Smerdis or Tanyoxarces)\n|522 BC\n|There is some confusion about this person. He was either Cambyses II's brother or an imposter - a Mede priest (Magus) pretending to be the brother.[1] The brother and the Magus were called by other names in various ancient sources.  According to Herod. (iii.61 ff.) both brother and Magus were named Smerdis; according to Ctesias of Cnidos (Persika, xii, translated by Lloyd Llewellyn-Jones and James Robson, Ctesias’ History of Persia: Tales of the Orient, London: Routledge, 2010, 177 ff.) the brother was Tanyoxarces, the Magus, Sphandadates; according to the  Behiston Inscription (Persian text, cited above), the brother was Smerdis, the Magus, Gaumâta; in the Elamite text of the inscription, the Brother was Bardiya, the Magus, Orospastes. ().\n|-\n|Darius I (\"the Great\")\n|522–486 BC\n|Cousin and brother-in-law of Cambyses II; succeeded to the throne as the result of a coup that ousted Bardiya; continued the expansion of the Persian Empire into western Anatolia and Thrace; made war on the Scythians; invaded mainland Greece in 490 to punish Athens for helping the Ionian city-states revolt in 499. This effort ended with the Athenian victory at the battle of Marathon.\n|-\n|Xerxes I\n|486–465 BC\n|Quelled a revolt in Egypt, then invaded Greece in 480 to finish what his father had started; ravaged Athens after the populace had abandoned the city, but lost sea and land battles at Salamis, Plataea, and Mycale and was forced to withdraw from both the Greek mainland and Anatolian Greece. He probably signed a peace treaty with Athens in 469 after the Battle of Eurymedon (Peace of Callias).\n|-\n|Artaxerxes I\n|465–424 BC\n|Came to the throne after a series of palace murders; defeated an Athenian force in 454 that was aiding an Egyptian revolt (which began in 460); granted asylum to Themistocles; signed a second peace with Athens in 449 after losing a naval battle to Cimon’s fleet off Cyprus.\n|-\n|Xerxes II\n|424 BC\n|First in line for the throne; murdered after 45 days by Sogdianus.\n|-\n|Sogdianus (Secydianus)\n|424–423 BC\n|Bastard son of Artaxerxes I; murdered Xerxes II; murdered in turn by his half brother Ochus seven months later.\n|-\n|Darius II (\"Ochus\")\n|423–404 BC\n|Entered into an alliance with Sparta after Athens’ losses during the Sicily campaign in 412.\n|-\n|Artaxerxes II\n|404–358 BC\n|Was the target of Cyrus the Younger’s “anabasis” – his ill-fated march “up country” to usurp the throne from his brother; supported Athens in the Corinthian War (supplying Conan with a fleet of ships), then switched sides to support Sparta; was eventually able to dictate terms to both sides, imposing the “King’s Peace” in 387, which permanently ceded all the Anatolia cities to Persia. Had to put down repeated revolts in Egypt, during which he hired out-of-work Athenian strategoi. Endured a series of satrap revolts in the later years of his reign.\n|-\n|Artaxerxes III (\"Ochus\")\n|358–338 BC\n|Also came to the throne as a result of a series of palace murders; revolt of Artabazus in Phrygia; additional revolts in Egypt, Phoenicia and Cyprus; gave modest help to the Greeks’ attempt to rein in Philip II’s increasing power in Macedon (siege of Perinthus in 340).\n|-\n|Artaxerxes IV (\"Arses\")\n|338–336 BC\n|Placed on the throne as an adolescent by Bagoas, advisor to the King, after Bagoas had poisoned Artaxerxes III; poisoned by Bagoas when he threatened to punish him for his crimes.\n|-\n|Darius III\n|336–330 BC\n|Placed on the throne by Bagoas; poisoned Bagoas when he learned of a plot to kill him. Spent most of his reign fighting Alexander III of Macedon; captured and killed by the Bactrian satrap Bessos after Alexander's conquest was complete.\n|-\n|Artaxerxes V (\"Bessus\")\n|330–329 BC\n|Satrap of Bactria; assumed title of \"King\" after death of Darius III; tried to resist Alexander, but was betrayed by his generals and killed by Darius' brother, Oxathres.\n|}\nSee also\n* Achaemenid Empire\n* Argead dynasty\n* Teispids\n* Kingdom of Cappadocia\n* Pishdadian dynasty\nReferences\nSources\n* Briant, Pierre, From Cyrus to Alexander: A History of the Persian Empire (2002). Translated by Peter T. Daniels. Winona Lake, Indiana: Eisenbrauns. ISBN 1-57506-031-0.\n*"
    }
  ]
}