{
  "content": [
    {
      "type": "text",
      "text": "# Achomawi traditional narratives\n\nAchomawi traditional narratives include myths, legends, tales, and oral histories preserved by the Achomawi people of the Pit River basin of Northeastern California.\nAchomawi oral literature reflects the group's position at the junction of cultural influences from central California, the Great Basin, the Plateau, and the Northwest Coast regions of aboriginal North America.\nSee also\n* Traditional narratives (Native California)\nAchomawi narratives\n* Angulo, Jaime de, and Lucy S. Freeland. 1931. \"Two Achumawi Tales\". Journal of American Folklore 44:125-136. (Collected from Mary Martin.)\n* Curtis, Edward S. 1907-1930. The North American Indian. 20 vols. Plimpton Press, Norwood, Massachusetts. (Creation myth collected from Henry Wool, vol. 13, pp. 206-210.)\n* Dixon, Roland B. 1905. \"The Mythology of the Shasta-Achomawi\". American Anthropologist 7:607-612. (Comparative notes.)\n* Dixon, Roland B. 1908. \"Achomawi and Atsugewi Tales\". Journal of American Folklore 21:159-177. (Twelve myths collected in 1900 and 1903.)\n* Dixon, Roland B. 1909. \"Achomawi Myths\". Journal of American Folklore 22:283-287. (Five myths collected by Jeremiah Curtin.)\n* Gifford, Edward Winslow, and Gwendoline Harris Block. 1930. California Indian Nights. Arthur H. Clark, Glendale, California. (Four previously published narratives, pp. 84-85, 134, 158, 285)\n* Judson, Katharine Berry. 1912. Myths and Legends of California and the Old Southwest. A. C. McClurg, Chicago. (A version of the creation myth, p. 16)\n* Kroeber, A. L. 1925. Handbook of the Indians of California. Bureau of American Ethnology Bulletin No. 78. Washington, D.C. (Comparative comments on myths, p. 315)\n* Margolin, Malcolm. 1993. The Way We Lived: California Indian Stories, Songs, and Reminiscences. First edition 1981. Heyday Books, Berkeley, California. (One myth from Curtin, pp. 118-119.)\n* Olmsted, David L. 1977. \"Loon, Coyote, and Fox (Ajumawi)\". In Northern Californian Texts, edited by Victor Golla and Shirley Silver, pp. 66-70. International Journal of American Linguistics Native American Texts Series No. 2(2). University of Chicago Press.\n* Powers, Stephen. 1877. Tribes of California. Contributions to North American Ethnology, vol. 3. Government Printing Office, Washington, D.C. Reprinted with an introduction by Robert F. Heizer in 1976, University of California Press, Berkeley. (Two narratives, pp. 272-273)\nExternal links\n* [http://www.sacred-texts.com/nam/ca/aat/index.htm \"Achomawi and Atsugewi Tales\"] by Roland B. Dixon (1908)\n* [http://www.sacred-texts.com/nam/ca/aat/index.htm \"Achomawi Myths\"] by Roland B. Dixon (1909)\n* [http://www.sacred-texts.com/nam/ca/mlcal.txt Myths and Legends of California and the Old Southwest] by Katharine Berry Judson (1912)\n* [https://web.archive.org/web/20070311015818/http://curtis.library.northwestern.edu/viewPage.cgi?volume=13&page=206 The North American Indian] by Edward S. Curtis (1924)"
    }
  ]
}