{
  "content": [
    {
      "type": "text",
      "text": "# Acquisition of Time Warner by AT&T\n\n* 85.4 billion, equivalent to $&nbsp;billion in  (cost alone)\n* 108.7 billion, equivalent to $&nbsp;billion in  (assumed debt included)\n| initiated = October 22, 2016\n| completed = June 14, 2018\n| resulting_entity = Time Warner would be renamed to WarnerMedia\n| status = Closed\n| logo3 =\n| logo3_caption = Logo after the acquisition\n}}\nAT&T Inc. (then the world's largest telecom company)  declared its intent on October 22, 2016, to acquire Time Warner Inc. (the media conglomerate owner of Warner Bros., Turner Broadcasting, and Home Box Office), for $85.4 billion. The landmark deal was subjected to regulatory scrutiny and led the Department of Justice to sue AT&T on November 20, 2017, in an antitrust lawsuit to block the acquisition. AT&T and the Justice Department went through a six-week court battle from March to June 2018 that concluded in the U.S. District Courts ruling in AT&T's favor on June 12, 2018. After the acquisition closed, Time Warner was taken private, renamed to WarnerMedia LLC, and integrated as an AT&T-owned subsidiary.\nThe Justice Department appealed to the D.C. Circuit Court of Appeals, but after the courts upheld the acquisition, the DOJ ended its efforts to reverse the merger. In October 2018, AT&T announced plans to develop a streaming service using WarnerMedia's content library and later launched HBO Max on May 27, 2020. After nearly three years of running WarnerMedia, AT&T announced on May 17, 2021, that it would spin-off its media division through a Reverse Morris Trust transaction to merge it with Discovery Inc. The M&A deal faced little opposition, and the Discovery/WarnerMedia merger closed on April 8, 2022, leading to Warner Bros. Discovery's establishment.\nBackground history\nCorporate affairs of AT&T\n(located in Dallas, Texas) ]]\nIn July 1877, Alexander Graham Bell (inventor of the telephone) and members of the Bell Patent Association founded the Bell Telephone Company as the world's first telecommunications company. On March 5, 1885, Bell Telephone established the American Telephone and Telegraph Company (AT&T Corporation) and merged with it in 1889. AT&T became the parent company of the Bell System, a network of regional telecom companies, and under Theodore Newton Vail's leadership, adopted the slogan \"One Policy, One System, Universal Service.\" For nearly a century, AT&T dominated virtually all industries of America's telephone sector in a regulated monopoly, earning it the nickname of \"Ma Bell\". On November 20, 1974, the Justice Department sued AT&T on accounts of antitrust violations in the case of United States V. AT&T (1984).\nAT&T spent several years fighting the lawsuit, but in 1982, it settled with the DOJ to breakup the Bell System into seven regional \"Baby Bell\" companies, a change that went into effect on January 1, 1984. After the breakup, AT&T spent the next twenty years venturing into growing telecom sectors. In 1992, it acquired 1/3 of McCaw Cellular Communications and purchased the remaining shares in 1994 for $11.5 billion, folding it into AT&T Wireless. AT&T also acquired Tele-Communications and MediaOne, and consolidated them into AT&T Broadband. By 2000, AT&T was the largest American cable operator and broadband supporter, but despite this, AT&T unveiled plans to restructure into smaller companies by 2002. SBC Communications, the smallest of the baby bells, emerged in 1984 and went on to acquire several baby bell companies following deregulated telecom regulations after the passage of the 1996 Telecommunications Act. In 2005, SBC acquired its former parent, AT&T Corp, and renamed itself to AT&T Inc., while retaining its previous history. With the BellSouth acquisition in 2006, AT&T reconstituted much of its former Bell System., headquarters of WarnerMedia/Time Warner from 2004 to 2019. ]]\nCorporate affairs of Time Warner\nTime Warner was established from the Time Inc./Warner Communications merger from 1989 to 1990. Warner Communications, led by Steven Ross, began as Kinney National Service in the 1960s and transitioned towards entertainment after buying out Warner Bros.-Seven Arts. Time Inc., co-founded by Henry Luce and Briton Hadden, launched several magazine lines, including Time, Fortune, Life, and People, and became the largest magazine publisher. In the 1990s, Time Warner formed the Time Warner Entertainment limited partnership with companies like Toshiba and US West (a Baby Bell). Time Warner also acquired the Atlanta-based Turner Broadcasting System and gained a multitude of cable networks like CNN and TBS, along with the New Line Cinema film studio. By 1998, US West's 25% stake in Time Warner was transferred to MediaOne and later AT&T, marking the first relations between the companies. In 2000, the Virginia-based America Online (AOL) agreed to acquire Time Warner in a deal valued at over $150 billion. The merger was the largest of its time and happened at the height of the Dot-com bubble.\nThe AOL/Time Warner merger, finalized on January 11, 2001, aimed to create a diversified conglomerate combining traditional and digital media, but the anticipated synergies between the two companies never materialized, and the merger became one of the most infamous in history. AOL Time Warner's share price also saw a steady decline in 2001, peaking at $71 and dropping to record lows of $8.70 per share. In 2003, the company made corporate history when it announced to shareholders in its annual report, that it experienced an annual loss of $98.7 billion during 2002, the largest ever experienced by a company. Corporate clashes and ongoing losses led numerous executives like Gerald Levin, Steve Case, and Ted Turner to resign. AOL Time Warner renamed itself to Time Warner in October 2003 and the company led efforts to restore shareholder faith. Long-time subsidiaries like Warner Music Group, AOL Time Warner Book Group, and Time Warner Cable were either sold or spun off to bring down the company's debt load. On December 9, 2009, Time Warner spun off AOL as a standalone company, bringing an end to the merger.\nMerger developments\nLeadup to the acquisition\nAfter splitting off the Time Warner Cable division, Time Warner was no longer the world's largest media conglomerate. In 2014, the company also spun off Time Inc., to focus solely on content creation. 21st Century Fox attempted to acquire Time Warner but later withdrew its bid following little support. Both the Walt Disney Company and Apple held talks with Time Warner CEO Jeff Bewkes about a possible Time Warner acquisition but were similarly unsuccessful. Randall Stephenson, who became AT&T's Chairman and CEO in 2007, led the company's move into entertainment. AT&T partnered with The Chernin Group to create the Otter Media joint venture, and it also acquired DirecTV in 2015 for $49 billion, becoming then largest pay-TV provider in the world. Eventually, AT&T became interested in buying a legacy media firm and held talks with Shari Redstone about acquiring CBS Corporation but later rescinded these efforts.\nBy October 20, 2016, senior executives of AT&T and Time Warner were reported to be in talks for a potential merger. Former Fox Executive, Peter Chernin stated, \"There’s a lot that’s attractive about Time Warner.\" After several days of media speculation, AT&T officially announced on October 22, 2016, that it had reached a deal to acquire Time Warner for $85.4 billion and take on its debts of $21.3 billion, totaling the offer to $108.7 billion. AT&T said it would issue existing Time Warner shareholders $107.50 per share, with half paid in cash and the other half in AT&T stock. Jeff Bewkes said, “This is a natural fit between two companies with great legacies of innovation that have shaped the modern media and communications landscape.\" Analyst Michael Nathanson referred to Time Warner as \"the last scaled content play that’s acquirable,\" noting that other media giants like Disney were either too large to purchase or family-controlled, such as 21st Century Fox and Viacom. Once finalized, the Time Warner acquisition would mark AT&T's biggest purchase since acquiring BellSouth in 2006, and analysts estimated it could leave the telecom giant with nearly 200 billion in debt.\nBloomberg News reported on October 24, 2016, that merger talks between AT&T and Time Warner actually began in August 2016 during a dinner at Martha's Vineyard. Peter Chernin convinced Randall Stephenson of the immense value of Time Warner's content library, with Stephenson saying “Chernin was the one who first got me to appreciate the library that this company own. That’s when I got it in my mind that these two companies could work together.” Several days later, Bewkes and Stephenson met at the Time Warner Center and came in agreement over shifting media trends and within weeks, AT&T and Time Warner were involved in merger discussions. Code names were used to maintain secrecy: “Lily” for AT&T and “Rabbit” for Time Warner and only a small circle of executives and bankers knew of the merger. The goals were to combine AT&T's distribution network (DirecTV, broadband internet, mobile data) with Time Warner's content (Warner Bros, HBO, Turner). Some at Time Warner were surprised at how quickly AT&T was moving after already acquiring DirecTV purchase.\nReactions and Antitrust challenges\nThe AT&T/Time Warner merger received immediate regulatory and political backlash. During the 2016 Presidential Election, Donald Trump criticized the merger, stating, \"AT&T is buying Time Warner, a deal that we will not approve in my administration because it is too much concentration of power in the hands of too few.” Hillary Clinton never issued a response, though her campaign voiced concern about the acquisition. Congressional Senators were also critical of the deal. Senators Mike Lee and Amy Klobuchar, members of the Senate Judiciary Subcommittee on Antitrust, released a joint statement saying, \"An acquisition of Time Warner by AT&T would potentially raise significant antitrust issues, which the subcommittee would carefully examine.\" Peter Navarro, then Trump's economic advisor, also issued a statement opposing the deal. Bernie Sanders urged the Justice Department to block the Time Warner-AT&T merger, stating “This proposed merger is just the latest effort to shrink our media landscape.\" During meetings with CNBC and The Wall Street Journal held between October 24 and October 25, 2016, Randall Stephenson downplayed concerns of withholding Time Warner's content from competitors and Jeff Bewkes said the merger would help increase competition.\nWall Street responded to the AT&T/Time Warner merger with skepticism, and many compared it to the Comcast/NBCUniversal merger. Steve Case, the former AOL CEO, reflected on the AOL-Time Warner merger and cautioned AT&T to avoid repeating mistakes that hindered business synergies. Variety predicted the merger would unleash a new wave of megamergers. Senator Blumenthal said AT&T's Time Warner acquisition was vastly different from the Comcast-NBC deal due to involving wireless and national platforms. On October 27, 2024, the Senate Subcommittee on Antitrust invited Stephenson and Bewkes to the U.S. Capitol for a December 2016 hearing on the merger. By November 4, 2016, AT&T and Time Warner submitted regulatory filing to receive DOJ clearance. After Trump defeated Clinton and won the Presidential Election on November 9, 2016, renewed concern emerged over whether Trump would follow through on his plans to block the merger. Telecom analyst Doug Barke said, \"Trump was quite clear in his distaste for the merger and no doubt the odds of its successful completion are lower this morning than yesterday.” Stephenson and Bewkes appeared at the December 7, 2016, Senate hearing to explain their merger rationale. Prominent figures present included Mark Cuban and Gene Kimmelman. Michael Reagan, the adopted son of President Ronald Reagan, defended Trump's worries about the merger. Days before Trump's inauguration, Stephenson and several AT&T executives met with Trump, though the merger was not discussed. On January 17, 2017, Stephenson told WSJ’s Matt Murray that job creation and tax reform were discussed with Trump. On February 15, 2017, Time Warner shareholders approved AT&T's takeover, with the acquisition set to close in late 2017.\nAjit Pai, then FCC Chairman, passed the reviewing decision of the AT&T/Time Warner merger to the Justice Department on February 28, 2017. The European Commission approved AT&T's acquisition on March 16, 2017. John Stankey, a longtime AT&T executive, was named Time Warner's next CEO on July 14, 2017. In an interview with The Hollywood Reporter on August 9, 2017, Stankey stated that AT&T would respect Time Warner's Hollywood-driven culture. Mexican regulators approved the acquisition on August 22, 2017, while Brazilian regulators, despite concerns over media concentration, approved it on October 24, 2017. Randall Stephenson and Makan Delrahim, then Assistant Attorney General for the DOJ's antitrust division, met on November 8, 2017, to discuss potential sales of DirecTV or Turner Broadcasting to clear regulatory hurdles. However, the Justice Department unexpectedly sued AT&T on November 20, 2017, to block the acquisition. President Trump, in his first response to the acquisition since taking office, said “Personally, I’ve always felt that was a deal that’s not good for the country.\" United States V AT&T, marked the second legal battle between AT&T and the DOJ since the Bell System breakup, following AT&T's failed bid for T-Mobile in 2011. Many on Wall Street were surprised by the lawsuit as the DOJ previously approved the Comcast/NBCUniversal merger. AT&T described the lawsuit as a \"radical and inexplicable departure from decades of antitrust precedent,\" while the DOJ said the acquisition would \"greatly harm American consumers.\" As conspiracies arose over the lawsuit secretly being about CNN's coverage of the Trump Administration, Stephenson said he was unsure but reiterated that AT&T would not sell.\nOverseeing WarnerMedia\nCourt trial and Restructuring efforts\nThe Consumer Federation of America called for blocking AT&T's acquisition of Time Warner, describing it as one of the most damaging vertical mergers in recent history. Settlement talks between AT&T and the Justice Department failed by December 19, 2017, and a court trial was scheduled to begin in March 2018. If the DOJ were to win, AT&T would either end efforts to acquire Time Warner, divest ownership of DirecTV, or acquire Time Warner without Turner Broadcasting or CNN. Time Warner and AT&T extended the merger deadline to June 21, 2018. The court trial began on March 19, 2018, and was supervised by District Judge Richard J. Leon. (the same judge who approved the Comcast/NBCUniversal deal) The court trial was often called the antitrust case of the century, as it was the most significant regulatory review into entertainment since the 1948 Paramount decree. The DOJ said the trial “will chart the course for the future of video-content delivery in the United States.”  Previously, the Justice Department claimed that a merged AT&T and Time Warner would result in less competition and higher prices for consumers. AT&T and Time Warner argued that merging would help them better compete with Big Tech giants like Google, Facebook, and Apple. Representing the DOJ was Craig Conrath, while Daniel Petrocelli represented AT&T and Time Warner jointly. Petrocelli informed Judge Leon that Bewkes and Stephenson would testify soon.\nJeff Bewkes testified on April 18, 2019, and assured that AT&T would not withhold Time Warner content from competitors. Stephenson testified on April 19, 2018, and said acquiring Time Warner presented AT&T with a rare opportunity. On June 12, 2018, Judge Leon ruled AT&T could proceed with purchasing Time Warner and that the merger did not harm consumers. Makan Delrahim said outside the courtroom that the DOJ would review Judge Leon's decision \"and see the impact on other mergers.\" The DOJ said, \"we will closely review the Court's opinion and consider next steps in light of our commitment to preserving competition for the benefit of American consumers.\"  The acquisition closed on June 14, 2018, with Time Warner going private and becoming an LLC. Its ticker symbol (TWX) was delisted from the stock market, and its Board of Directors was disbanded. AT&T renamed Time Warner to WarnerMedia on June 15, 2018, and the company's financial statements were reported under AT&T's SEC filings. Jeff Bewkes resigned as WarnerMedia CEO and John Stankey assumed the role. Variety interviewed Stankey on June 18, 2018, and he acknowledged that purchasing WarnerMedia left AT&T with a debt load of over 180 billion but said it was manageable. Stankey also said he would familiarize himself with WarnerMedia 24,000 employees, saying \" I need to pull some of the mystery out of the equation.\" When asked about changes to WarnerMedia, Stankey said AT&T would not immediately restructure the company but did say there would be integration between AT&T's data-mining expertise and WarnerMedia's content creation abilities.    skyscraper (pictured in September 2019)]]On July 12, 2018, the DOJ appealed to the D.C. Circuit Court of Appeals to contest Judge Leon's ruling. AT&T said it would hold off on restructuring WarnerMedia until the court's decision. Few changes were made to WarnerMedia aside from a few executive turnovers. On August 7, 2018, AT&T bought out Otter Media from The Chernin Group and integrated it into WarnerMedia. AT&T's advertising division was reorganized into Xandr on September 25, 2018, with its CEO, Brian Lesser, retaining his role. On October 10, 2018, AT&T announced plans for WarnerMedia to create a streaming service using HBO's branding to compete with Netflix. By February 20, 2019, the Circuit Courts upheld Judge Leon's decision, and the Justice Department ended efforts to undo the merger. Having cleared all legal hurdles, AT&T would soon begin restructuring WarnerMedia. Upon this news, Turner's David Levy and HBO's Richard Plepler resigned from WarnerMedia on February 28, 2019. On March 4, 2019, AT&T dissolved Turner Broadcasting as a standalone company and established several WarnerMedia divisions. These divisions included WarnerMedia Entertainment (led by Bob Greenblatt), overseeing Home Box Office, TBS, TNT, TruTV, and the upcoming streaming service; WarnerMedia News & Sports (led by Jeff Zucker), overseeing AT&T SportsNet, CNN Worldwide, Turner Sports, and Bleacher Report; WarnerMedia Sales & International (led by Gerhard Zeiler) handling WarnerMedia International and WarnerMedia's advertising and distribution; along with Warner Bros. Global Kids, Young Adults, & Classics (subdivision of Warner Bros. Entertainment), managing Cartoon Network Inc., Otter Media, and TCM.\nThis restructuring was a part of a larger effort to eliminate corporate barriers between WarnerMedia's subsidiaries and bring the company under one structure. On March 13, 2019, Ted Turner issued a statement entrusting Stephenson and Stankey to handle Turner Broadcasting's former assets. AT&T sold WarnerMedia's 9.5 stake in Hulu to the Walt Disney Company (majority owner after purchasing 21st Century Fox) on April 15, 2019, in a $1.43 billion deal. On April 24, 2019, WarnerMedia announced a $2.2 billion sale-leaseback of the 30 Hudson Yards to help bring down AT&T's debt. The leaseback was finalized by June 2019, while WarnerMedia was transferring from the Time Warner Center. On Many 31, 2019, Otter Media was transferred to WarnerMedia Entertainment and was given oversight to preside over WarnerMedia's upcoming streaming service. John Stankey was interviewed by CNBC on June 7, 2019, nearly a year after becoming WarnerMedia CEO and he denied rumors of culture clashes between AT&T and WarnerMedia, mentioned plans to integrate DirecTV Now (this never happened) into the upcoming streaming business, and to realign WarnerMedia for the future of media consumption. The streaming business was unveiled as HBO Max on July 9, 2019, and slated for a spring 2020 release.\n]]\nExecutive reshufflings and HBO Max\nOn September 3, 2019, John Stankey was appointed President and Chief Operating Officer (COO) of AT&T, while retaining his previous WarnerMedia role. This fueled speculation over whether Stankey was next in line to succeed Randall Stephenson as AT&T CEO. Elliot Management, an activist investment firm, purchased a $3.2 billion stake in AT&T and sent a letter to its board of directors on September 9, 2019. In the letter, Elliot criticized the direction AT&T moved in with its purchases of Time Warner and DirecTV and stated it led to enormous debt levels and eroded share price value. Elliot wrote “AT&T has yet to articulate a clear strategic rationale for why it needs to own Time Warner\" and also suggested selling DirecTV. Stankey's leadership of WarnerMedia was questioned and Elliot claimed that he was Stephenson's heir apparent as AT&T CEO. It was also stated that there was no \"clear vision\" for HBO Max. On September 17, 2019, Randall Stephenson denied rumors of Stankey being AT&T's next CEO, saying \"the board has not informed me I'm retiring yet.\" He also defended AT&T's media acquisitions and said they would provide AT&T with long term benefit. Stankey too defended these purchases, saying \"the collection of assets we have accumulated were pointed out to be something that could create significant value.\" President Trump praised Elliot's stake in AT&T and suggested it would improve CNN. In an interview with Variety on September 24, 2019, Stankey defended Stephenson's diversification strategy and called critics of it \"categorically wrong\".\nStankey also said successors were not being examined to replace him as WarnerMedia, but he did acknowledge that pressure from Elliot may change things. WarnerMedia execs like Jeff Zucker and Bob Greenblatt were seen as potential contenders. When asked to comment on AT&T's CEO succession plan, Stankey declined and said those decisions were up to the board of directors. On September 25, 2019, The Wall Street Journal interviewed Stankey, and he reiterated that he would remain WarnerMedia CEO, saying, \"I'm not looking to find my successor right at the moment.\" He also denied rumors of a DirecTV Sale. By October 28, 2019, AT&T and Elliot Management reached a three-year resolution. Stephenson pledged to remain AT&T's Chairman and CEO until 2020 and said the company would \"evaluate multiple options and partnerships for DirecTV.\" HBO Max was unveiled to AT&T investors at the Warner Bros. Burbank lot on October 29, 2019, and scheduled for a May 2020 release, with pricing at $14.00 a month and over 10,000 hours of content available. Stephenson described HBO Max as being unlike Netflix or Disney+, but something in its own league. AT&T said it would invest $2 billion a year into HBO Max and projected it to have 75-90 million subscribers by 2025, having then reached a level of profitability.\nBy December 2019, it was acknowledged that successors were being examined to replace John Stankey as WarnerMedia CEO. During AT&T's annual report in January 2020, the telecom giant said it paid down over $20 billion in debt during 2019. In February 2020, WarnerMedia announced the WarnerMax film label to provide original films for HBO Max. On March 11, 2020, Xandr CEO, Brian Lesser, resigned from WarnerMedia upon learning he would not become WarnerMedia CEO. On April 24, 2020, John Stankey was named the next CEO of AT&T, and Hulu Co-founder, Jason Kilar, was appointed the next WarnerMedia CEO. On April 30, 2020, Xandr was folded into WarnerMedia Sales & International. The COVID-19 pandemic impacted WarnerMedia greatly during 2020, as much of Warner Bros' 2020 film slate was either delayed or set for an HBO Max premiere. HBO Max was released on May 4, 2020. WarnerMedia underwent another round of restructuring through CEO Jason Kilar. WarnerMedia Entertainment and Warner Bros. Entertainment were consolidated under WarnerMedia Studios & Networks. HBO Max was brought under WarnerMedia Direct while WarnerMedia International was separated from WarnerMedia Sales & Distribution. By Fall 2020, most Time Warner era executives were no longer with WarnerMedia. Jason Kilar and WarnerMedia faced criticism from the entertainment industry for the Project Popcorn initiative that released Warner Bros' entire 2021 film slate simultaneously on HBO Max and in theaters.\n{| class=\"wikitable sortable mw-collapsible\"\n!WarnerMedia Studios & Networks\n!WarnerMedia International\n!WarnerMedia News & Sports\n!WarnerMedia Sales & Distribution\n!WarnerMedia Direct\n|-\n|\n* Warner Bros. Entertainment\n* Home Box Office\n* TNets (TBS, TNT, TruTV)\n* The CW (50%)\n|\n* WarnerMedia EMEA\n* WarnerMedia Latin America\n* WarnerMedia Asia-Pacific\n|\n* CNN Worldwide\n* Turner Sports\n* Bleacher Report\n* AT&T SportsNet\n|\n* Otter Media\n* Advertising, Distribution, and content licensing\n* Xandr\n|\n* HBO Max\n|}\nDivestment and Spinoff\nFounding of Warner Bros. Discovery\n|317x317px]]\nOn May 16, 2021, Bloomberg News reported that AT&T was considering an offer to divest equity interest in their media subsidiary WarnerMedia (the former Time Warner, which AT&T  acquired in 2018 for just over $85 billion in an attempt to become a vertically integrated media conglomerate), and have it merge with Discovery, Inc. to form a new publicly traded company. AT&T and Discovery officially confirmed the agreement the next day; the merger would be structured as a Reverse Morris Trust, with AT&T shareholders holding a 71% interest in the new company's stock and appointing seven board members, and Discovery shareholders holding a 29% interest and appointing six board members. AT&T would receive US$43&nbsp;billion in cash and debt from the divestment. The merger was expected to be completed in mid-2022. The new company would be led by Discovery's current CEO, David Zaslav; WarnerMedia's CEO Jason Kilar's position in the new company was uncertain. Zaslav stated that the two companies would spend a combined US$20&nbsp;billion annually on content (outpacing even Netflix). The company will aim to expand their streaming services, which includes WarnerMedia's HBO Max, to reach 400 million global subscribers. It was stated that the company would aim to achieve $3&nbsp;billion in cost savings via synergies within two years. On June 1, 2021, it was announced that the merged company would be known as Warner Bros. Discovery, and an interim wordmark was unveiled with the tagline \"The stuff that dreams are made of\"—a quote from the 1941 Warner Bros. film The Maltese Falcon, itself paraphrasing Shakespeare's The Tempest. Zaslav explained that the company aimed to be the \"most innovative, exciting and fun place to tell stories in the world\", and would combine Warner Bros.' \"fabled hundred-year legacy of creative, authentic storytelling and taking bold risks to bring the most amazing stories to life\" with Discovery's \"integrity, innovation and inspiration.\"\nIn an SEC Filing on November 18, 2021, Discovery revealed that talks with AT&T had fallen through, in April 2021, due to disagreements over the ownership of the new company between AT&T and Discovery shareholders, and the amount of debt transferred to Discovery when they merged with WarnerMedia, before talks resumed on May 17, 2021. In November 2021, during an earnings call, Discovery Streaming CEO JB Perrette discussed possible options for its Discovery+ streaming service post-merger, including bundling the service with HBO Max and eventually merging them under a single platform with a mixture of both companies' technologies. He also noted that WBD may prioritize launching Discovery+ and HBO Max as a unified platform in markets where Discovery+ has yet to launch, such as another parts of the Asia-Pacific. On March 14, 2022, Discovery CFO Gunnar Wiedenfels—who would assume the same position post-merger—confirmed that such a transition was a long-term goal. On December 22, 2021, the transaction was approved by the European Commission. On January 5, 2022, The Wall Street Journal reported that WarnerMedia and Paramount Global (at the time named ViacomCBS) were exploring a possible sale of either a majority stake or all of The CW, and that Nexstar Media Group was considered a leading bidder. The reports also indicated that WarnerMedia and ViacomCBS could include a contractual commitment that would require any new owner to buy new programming from those companies, allowing them to reap some continual revenue through the network. The CW's then-president-and-CEO Mark Pedowitz confirmed talks of a potential sale in a memo to CW staffers, but added that \"It's too early to speculate what might happen.\"\nOn January 26, 2022, AT&T CEO John Stankey stated that the merger was expected to close sometime during the second quarter of 2022. On February 1, 2022, it was reported that AT&T had finalized the structure of the merger: WarnerMedia would be spun off pro rata to AT&T's shareholders, and then merge into Discovery Inc. to form the new company. The transaction was approved by the Brazilian antitrust regulator Cade on February 7, followed by the United States Department of Justice on February 9. On March 11, 2022, the merger was approved by Discovery's shareholders. Due to the structure of the merger, it did not require separate approval from AT&T shareholders. In an SEC filing on March 25, 2022, AT&T stated that two-way trading of WBD stock with that of AT&T would begin on April 4, 2022, and that a special dividend would be issued the next day to give AT&T shareholders a 0.24 share in WBD for each share of AT&T common stock they hold. The merger was officially completed on April 8, 2022, with trading beginning on the Nasdaq on April 11.\nPost spinoff activities\nAT&T fully left the media industry in 2025 after selling its majority stake in DirecTV.\nWorks cited\nReferences"
    }
  ]
}