{
  "content": [
    {
      "type": "text",
      "text": "# Acree v. Republic of Iraq\n\nAcree v. Republic of Iraq, 370 F.3d 41 (D.C. Cir. 2004), was a case before the United States Court of Appeals for the District of Columbia. U.S. military personnel who had been tortured by Iraq during the 1991 Gulf War sued for damages, arguing that the Foreign Sovereign Immunities Act (FSIA) made state sponsors of terror liable. Iraq never contested the lawsuit, but the U.S. federal government intervened. The Court of Appeals ultimately decided against the plaintiffs, saying that the FSIA did not create new causes of action against foreign states. The U.S. Supreme Court declined to hear the plaintiffs' appeal.\nBackground\n.]]\nThe plaintiffs in this case were 17 U.S. military personnel (some former, some currently serving at the time of the lawsuit) who had been tortured while they had been held as POWs during the 1991 Iraq war, who were joined in the lawsuit by 37 family members. The torture included \"starvation, []mock executions, []mock castrations, chemical injections and severe beatings,\" and included inflicting, \"mental anguish by falsely reporting that they had killed Americans, including a pilot's wingman, other American POWs, and the President of the United States.\"\nDistrict court case\nComplaint and default\nThey filed a lawsuit in the U.S. District Court for the District of Columbia in April 2002 against the Republic of Iraq, the Iraqi Intelligence Service, and Saddam Hussein for compensatory and punitive damages. The causes of action listed in the complain included common law torts, and while normally, the FSIA granted foreign states immunity from lawsuits in U.S. courts, there had been a \"terrorism exception\" (28 U.S.C. § 1605(a)(7)) passed in 1996, which took away sovereign immunity from state sponsors of terror. Iraq had been designated a state sponsor of terror in 1990 after it had invaded Kuwait, so the complaint argued that it was liable.\nThe Republic of Iraq was served notice through a Polish embassy in Baghdad, but never made any response to the suit, and a default was entered against them in September 2002. The District Court agreed with the plaintiffs on their interpretation of the FSIA, and awarded them a default judgment that totaled $959 million.\nIntervention by the U.S. government\nAcree v. Snow\ngave a speech on board the aircraft carrier USS Abraham Lincoln (known as the \"Mission Accomplished speech\"), which marked the end of the 2003 invasion of Iraq, and the beginning of the occupation of Iraq and reconstruction efforts.]]\nHaving won a judgment, the plaintiffs tried to secure the monetary judgment by attaching funds in seized Iraqi bank accounts. However, in April 2003, Congress had enacted the Emergency Wartime Supplemental Appropriations Act (EWSAA), which contained a provision that allowed the president to \"make inapplicable with respect to Iraq . . . any other provision of law that applies to countries that have supported terrorism.\" President George W. Bush did so on May 7, and he stated publicly that he believed this applied to (among other things) the terrorism exception to the FSIA. This resulted in a separate lawsuit titled Acree v. Snow, where the U.S. opposed the plaintiff's attempt to attach the funds. Acree v. Snow depended on a different law, the Terrorism Risk Insurance Act of 2002 (\"TRIA\"), and the District Court ruled that the May 7 declaration made the TRIA inapplicable, and plaintiffs could not use it.\nMotions by the U.S. government\nIn July 2003, two weeks after the judgment was issued in Acree v. Republic of Iraq, the U.S. government filed motions to intervene in the case and vacate the judgment. The invasion of Iraq had just finished, thus beginning the occupation of Iraq, and the government asserted an interest in \"ensur[ing] the successful establishment of a democratic government in Iraq,\" as well as protecting the assets it had seized from the now-defeated Hussein regime.\nThe U.S.'s argument for vacating, moreover, was that the May 7 presidential declaration removed the court's subject matter jurisdiction. Just as the TRIA no longer applied to Iraq, it argued, neither did the FSIA's terrorism exception apply.\nThe court rejected both of these motions, first on the grounds of timeliness—there was no question the government had been aware of the case for months, and it had even been two months since the president's May 7 declaration—and second on the grounds that the U.S. had no cognizable interest that had been impaired, as required for an intervention motion. The assets, it said, were not relevant to the lawsuit, nor had it been shown how the judgment would have any impact on the establishment of a democratic government. The U.S. appealed.\nThe decision of the Court of Appeals\nIn an opinion by judge Harry T. Edwards, the Court of Appeals sided with the U.S. government, but it did so based on its own reasoning. First, regarding the timeliness of the motion to intervene, it said that \"the District Court failed to consider adequately the unique circumstances of this case.\" On one hand, the \"weighty interests\" of foreign policy were enough to justify the government's delay, and on the other, the plaintiffs had not shown that they were prejudiced in any way by the government's intervention.\nSecond, on the question of subject matter jurisdiction, the Court of Appeals disagreed with the government. Calling it \"an exceedingly close question,\" it said the EWSAA was aimed at making it easier to assist a new Iraqi government, not changing the course of lawsuits in the U.S. In reaching this conclusion, the court relied on an examination of the legislative history and context of the FSIA and the EWSAA.\nIn spite of this, they overturned the District Court and vacated the judgment, on the grounds that the plaintiffs had never had a proper cause of action to begin with (an argument the government had never made). Just a few months earlier, in Cicippio-Puleo v. Islamic Republic of Iran (2004), the same court had ruled that \"neither § 1605(a) (7) nor the Flatow Amendment, nor the two considered together, supplies a cause of action against foreign states,\" and the court simply applied that rule to Acree.\nUnlike in Cicippio, however, the court did not remand the case to give plaintiffs a chance to fix their cause-of-action problem. Instead, the case was simply dismissed. This seems to have been motivated by the policy arguments the U.S. had raised in its motion to intervene. The court wrote,\nConcurrence\nJudge John Roberts (later Chief Justice of the United States) wrote a concurring opinion that agreed with the courts' decision, but supported the government's argument against subject matter jurisdiction, rather than the majority's reasoning about causes of action. Taking a more textualist approach than the rest of the court, he wrote,\nAftermath\nThe plaintiffs tried to appeal the decision to the U.S. Supreme Court, but their petition for certiorari was denied.\nReferences"
    }
  ]
}