{
  "content": [
    {
      "type": "text",
      "text": "# Action for the Republic (Argentina)\n\nEconomic liberalism\n| headquarters     = Buenos Aires\n| international    =\n| website          = http://www.ar-partido.com.ar/\n| country          = Argentina\n| president        = Mirta Graciela Morales\n| leader2_title    = Founder\n| leader2_name     = Domingo Cavallo\n| position         = Centre-right\n| regional         = Encounter for Corrientes\n| seats1_title     = Chamber of Deputies\n| seats1           =\n| seats2_title     = Senate\n| seats2           =\n| seats3_title     = Buenos Aires Legislature\n| seats3           =\n}}\nAction for the Republic () is a conservative liberal political party in Buenos Aires, Argentina.\nHistory\nFounded in 1997 by Domingo Cavallo, Harvard University graduate liberal economist and defender of neoliberal ideologies, it became the third party in the 1999 elections. When Cavallo joined the De la Rúa´s government in 2001, many of the members of the party became part of the Ministry of the Economy.\nDomingo Cavallo resolved to channel his political wishes of 1997 as a candidate for deputy for the Capital. It closed an agreement with Gustavo Béliz to form an opposition and anti-Menemist front that will aim to change the agenda of state priorities with a view to 1999: they will raise the flag of justice, security and the fight against corruption. Beliz dubbed it an \"anti-mafia front.\"\nElective positions were established, and Cavallo topped the list of candidates for deputies accompanied by Guillermo Francos, María Eugenia Estenssoro and Franco Caviglia. New Leadership, on the other hand, held the candidacies for Buenos Aires legislators with Beliz as the first candidate, seconded by the former Minister of Labor Enrique Rodríguez.\nAfter the 2001 collapse of the economy, the party lost funding and most of its members joined other parties, such as Recreate for Growth or the Justicialist Party, or formed their own small local parties.\nNowadays it's part of the Encounter for Corrientes provincial coalition. Corrientes is also the only district where the party has legal status.\nReferences"
    }
  ]
}