{
  "content": [
    {
      "type": "text",
      "text": "# Acting President of Poland\n\ntwice served as acting President of Poland.]]\nThe acting president of the Republic of Poland (, or p.o. prezydenta RP) is a temporary post provided for by the Polish Constitution.\nThe constitution states that the president is the head of state. If the president dies in office, resigns, is removed from office or unable to execute their powers and duties, a predetermined person will assume the powers and duties as acting president.\nIn the incapacity scenario, the acting president is just a temporary deputy. In the case of a vacancy, however, they become the head of state until the next election, albeit without the title of president, and retaining their previous office. In either case, all the powers of the president devolve to the acting president, with the exception of the right to dissolve the Parliament.\nThe first person in line to become acting president is the Marshal of the Sejm. Should they be unable to serve, the next is the Marshal of the Senate. This order of precedence has been in effect since the creation of the Office of President, with the exception of the period 1935–1939, when the order was reversed.\nTo date four people have served as acting president: Maciej Rataj who did so twice, Bronisław Komorowski, Bogdan Borusewicz, and Grzegorz Schetyna. Rataj, Komorowski, and Schetyna were Marshals of the Sejm, and Borusewicz the Speaker of the Senate. Rataj's first term was between the assassination of President Gabriel Narutowicz and the election of Stanisław Wojciechowski, December 16–22, 1922, the second between the resignation of Wojciechowski and the election of Ignacy Mościcki, May 15–June 4, 1926. Both times he appointed a new cabinet. Komorowski became acting president on April 10, 2010, following the death of President Lech Kaczyński in a plane crash. On July 8, 2010, Poland had three different acting presidents. Komorowski (having won the new presidential elections) resigned as Speaker of the Sejm in the morning, and Borusewicz, who served as the Marshal of the Senate took over as acting president for several hours, until Schetyna was confirmed as the new Speaker of the Sejm and the new acting president.\nDuring the period of communist rule, two Sejm Marshals served very briefly as Presidents pro tempore of the State National Council:\n* Franciszek Trąbalski (February 4, 1947 - Sejm Marshal pro tempore due to seniority)\n* Władysław Kowalski (February 4–5, 1947 - elected Sejm Marshal)\nConstitutional provisions on acting Presidency\nArticle 131, Chapter 5:\n: 1. If the President of the Republic is temporarily unable to discharge the duties of his office, he shall communicate this fact to the Marshal of the Sejm, who shall temporarily assume the duties of the President of the Republic. If the President of the Republic is not in a position to inform the Marshal of the Sejm of his incapacity to discharge the duties of the office, then the Constitutional Tribunal shall, on request of the Marshal of the Sejm, determine whether or not there exists an impediment to the exercise of the office by the President of the Republic. If the Constitutional Tribunal so finds, it shall require the Marshal of the Sejm to temporarily perform the duties of the President of the Republic.\n: 2. The Marshal of the Sejm shall, until the time of election of a new President of the Republic, temporarily discharge the duties of the President of the Republic in the following instances:\n::- the death of the President of the Republic\n::- the President's resignation from office;\n::- judicial declaration of the invalidity of the election to the Presidency or other reasons for not assuming office following the election\n::- a declaration by the National Assembly of the President's permanent incapacity to exercise his duties due to the state of his health; such declaration shall require a resolution adopted by a majority vote of at least two-thirds of the statutory number of members of the National Assembly\n::- dismissal of the President of the Republic from office by a judgment of the Tribunal of State.\n: 3. If the Marshal of the Sejm is unable to discharge the duties of the President of the Republic, such duties shall be discharged by the Marshal of the Senate.\n: 4. A person discharging the duties of the President of the Republic shall not shorten the term of office of the Sejm.[http://www.sejm.gov.pl/prawo/konst/angielski/kon1.htm The Constitution of the Republic of Poland]\nSee also\n* List of heads of state of Poland\nReferences"
    }
  ]
}