{
  "content": [
    {
      "type": "text",
      "text": "# Acts of Parliament of the United Kingdom relating to the European Communities and the European Union\n\nThis is a list of current, amended, spent and repealed acts of the Parliament of the United Kingdom relating to its former membership and current relationship to the European Communities and the European Union from 1972 onwards.\nSome of the acts (particularly the European Communities Act 1972 and the European Union (Withdrawal) Act 2018) represent some of the most important constitutional legislation formerly or currently on the statute book.\nAct of United Kingdom accession and membership to the European Communities / European Union\n{|class=\"wikitable sortable\"\n|-\n! Act !! Chapter (c.) !! Royal assent !! Current status\n|-\n| European Communities Act 1972 || [https://www.legislation.gov.uk/ukpga/1972/68/enacted 68] || 17 October 1972 || Repealed\n|}\nThis act legislated for the accession of the United Kingdom to the European Communities which later became the European Union and also gave legal effect to  European Union Law (then Community law) which came into effect on 1 January 1973, the day the UK officially joined.\nAlthough the act was repealed by the European Union (Withdrawal) Act 2018 upon the UK's withdrawal from the EU on 31 January 2020, most of its provisions remained in effect via Section 1A of the Withdrawal Act until the end of the Brexit transition period on 31 December 2020.\nAmending acts\n{|class=\"wikitable sortable\"\n|-\n! Act !! Chapter (c.) !! Royal assent !! Current status !! class=\"unsortable\" | Notes\n|-\n| European Communities (Amendment) Act 1986 || [http://www.legislation.gov.uk/ukpga/1986/58/enacted 58] || 17 November 1986 || Repealed || This act incorporated the Single European Act into the 1972 act.\n|-\n| European Communities (Amendment) Act 1993 || [http://www.legislation.gov.uk/ukpga/1993/32/enacted 36]|| 20 July 1993 || Repealed || This act incorporated the Maastricht Treaty into the 1972 act which created the European Union.\n|-\n| European Communities (Amendment) Act 1998 || [http://www.legislation.gov.uk/ukpga/1998/21 21] || 11 June 1998 || Repealed || This act incorporated the Amsterdam Treaty into the 1972 act.\n|-\n| European Communities (Amendment) Act 2002 || [http://www.legislation.gov.uk/ukpga/2002/3 3] || 26 February 2002 || Repealed || This act incorporated the Nice Treaty into the 1972 act.\n|-\n| European Union (Amendment) Act 2008 || [http://www.legislation.gov.uk/ukpga/2008/7 7] || 19 June 2008 || Repealed || This act incorporated the Treaty of Lisbon into the 1972 act.\n|-\n| European Union (Approvals) Act 2017 || [http://www.legislation.gov.uk/ukpga/2017/35 7] || 7 December 2017 || Repealed || This act incorporated draft Council of the European Union decisions regarding participation in the European Union Agency for Fundamental Rights by Albania and Serbia and the agreement between the European Union and the Government of Canada regarding the application of their competition laws.\n|}\nFinance acts\n{|class=\"wikitable sortable\"\n|-\n! Act !! Chapter (c.) !! Royal Assent !! Current status\n|-\n| European Communities (Finance) Act 2001 || 22 || 4 December 2001 || Repealed\n|-\n| European Communities (Finance) Act 2008 || 1 || 19 February 2008 || Repealed\n|-\n| European Union (Finance) Act 2015 || 32 || 21 July 2015 || Repealed\n|}\nThese acts also amend the 1972 act.\nAct related to the 1975 United Kingdom European Communities membership referendum\n{|class=\"wikitable sortable\"\n|-\n! Act !! Chapter (c.) !! Royal assent !! Current status\n|-\n| Referendum Act 1975 || 33 || 8 May 1975 || Repealed\n|}\nThis act legislated for the holding of the United Kingdom European Communities membership referendum which was held on Thursday 5 June 1975.\nAct related to the European Economic Area\n{|class=\"wikitable sortable\"\n|-\n! Act !! Chapter (c.) !! Royal assent !! Current status\n|-\n| European Economic Area Act 1993 || 10 || 5 November 1993 || Amended\n|}\nThis act incorporated the agreement which created the European Economic Area which came into effect on 1 January 1994 and amended the European Communities Act 1972 to add the agreement to the act.\nActs related to the European Assembly / Parliament\n{|class=\"wikitable sortable\"\n|-\n! Act !! Chapter (c.) !! Royal assent !! Current status\n|-\n| European Assembly Elections Act 1978 || 10 || 5 May 1978 || Repealed\n|-\n| European Assembly (Pay and Pensions) Act 1979 || 50 || 26 July 1979 || Repealed\n|-\n| European Parliamentary Elections Act 1993 || 41 || 5 November 1993 || Repealed\n|-\n| European Parliamentary Elections Act 1999 || 1 || 14 January 1999 || Repealed\n|-\n| European Parliamentary Elections Act 2002 || 24 || 24 July 2002 || Repealed\n|-\n| European Parliament (Representation) Act 2003 || 7 || 8 May 2003 || Repealed\n|}\nThese acts legislated for the holding of European Parliament elections within the United Kingdom.\nEuropean Union Act and amenedments\n{|class=\"wikitable sortable\"\n|-\n! Act !! Chapter (c.) !! Royal assent !! Current status\n|-\n| European Union Act 2011 || [http://www.legislation.gov.uk/ukpga/2011/12/enActed  11] || 19 July 2011 || Repealed\n|}\nThis act amended the 2002 act and legislated for the requirement of a UK-wide referendum for any approval of any proposed transfers of power to the EU.\nActs related to the European Union Act 2011\n{|class=\"wikitable sortable\"\n|-\n! Act !! Chapter (c.) !! Royal assent !! Current status\n|-\n| European Union (Approval of Treaty Amendment Decision) Act 2012 || 15 || 31 October 2012 || Repealed\n|-\n| European Union (Approvals) Act 2015 || 37 || 17 December 2015 || Repealed\n|}\nThis act approves under the European Union Act 2011 the creation of the European Stability Mechanism for Eurozone states and approves for Macedonia to become an observer in the work of the European Union Agency for Fundamental Rights.\nAccession acts\n{|class=\"wikitable sortable\"\n|-\n! Act !! Chapter (c.) !! Royal assent !! Current status\n|-\n|European Communities (Greek Accession) Act 1979 || 50 || 20 December 1979 || Repealed\n|-\n|European Communities (Spanish and Portuguese Accession) Act 1985 || 75 || 19 December 1985 || Repealed\n|-\n|European Union (Accessions) Act 1994 || 38 || 3 November 1994 || Repealed\n|-\n|European Union (Accessions) Act 2003 || 35 || 13 November 2003 || Repealed\n|-\n|European Union (Accessions) Act 2006 || 2 || 16 February 2006 || Repealed\n|-\n|European Union (Croatian Accession and Irish Protocol) Act 2013 || 5 || 31 January 2013 || Repealed\n|}\nThese acts legislated for subsequent enlargements of the European Communities/European Union and also amended the European Communities Act 1972 to add the treaties to the act.\nActs related to and incidental to the withdrawal of the United Kingdom from the European Union\n{|class=\"wikitable sortable\"\n|-\n! Act !! Chapter (c.) !! Royal assent !! Current status !! class=\"unsortable\" | Notes\n|-\n| European Union Referendum Act 2015 || 36 || 17 December 2015 || Spent || This act required the holding of the United Kingdom European Union membership referendum no later than 31 December 2017, which was duly held on Thursday 23 June 2016.\n|-\n| European Union (Notification of Withdrawal) Act 2017 || [http://www.legislation.gov.uk/ukpga/2017/9/enacted 9] || 16 March 2017 || Spent || This act (now spent) authorised the Prime Minister of the United Kingdom to notify the European Union of the United Kingdom's intention to withdraw by invoking Article 50 of the Lisbon Treaty, in pursuance of and subsequent to the case of R (Miller) v Secretary of State for Exiting the European Union.[https://www.bailii.org/uk/cases/UKSC/2017/5.html ]\n|-\n| European Union (Withdrawal) Act 2018 || [http://www.legislation.gov.uk/ukpga/2018/16/enacted 16] || 26 June 2018 || Amended || This act legislates to enable the implementation of the country's exit from the European Union (Brexit) and automatically repealed the European Communities Act 1972 on \"exit day\" – defined in the legislation as 29 March 2019 (at 11.00 p.m.) which was later revised by secondary legislation first to 31 October 2019 and then finally 31 January 2020.\n|-\n|European Union (Withdrawal) Act 2019\n|[https://www.legislation.gov.uk/ukpga/2019/16/enacted 16]\n|8 April 2019\n|Repealed\n|Nicknamed the Cooper-Letwin Act, this act started as a Private Member's Bill. It forced the government to ask Parliament to agree to an extension of the UK's membership of the EU. This happened and Parliament overwhelmingly voted in favour. A second extension of the UK's membership, to 31 October 2019, was agreed the day after, but extension negotiations had been ongoing since before the vote.\n|-\n|European Union (Withdrawal) (No. 2) Act 2019\n|[https://www.legislation.gov.uk/ukpga/2019/26/enacted 26]\n|9 September 2019\n|Repealed\n|Nicknamed the Benn Act, this act was also a Private Member's Bill. The process to get the bill to a vote saw 21 Conservative MPs kicked out of their party. The bill set out conditions, in order to avoid a no-deal Brexit. Its conditions led to a rare Saturday sitting of the House of Commons, during which the government tried to get its revised withdrawal agreement passed by MPs. Ultimately, the government was not successful, thanks to an amendment by Oliver Letwin, and was forced, by the act, to ask the EU for a third extension of its membership. This extension ultimately saw the UK leave the EU on 31 January 2020.\n|-\n| European Union (Withdrawal Agreement) Act 2020 || [http://www.legislation.gov.uk/ukpga/2020/1/enActed 1] || 23 January 2020 || Amended || This act confirms the 31 January 2020 withdrawal date and also ratifies the revised version of the Brexit withdrawal agreement. The act also saves the effect of the European Communities Act 1972 after the withdrawal date and legally binds changes to EU law until the end of the implementation period (to 31 December 2020).\n|-\n| European Union (Future Relationship) Act 2020 || [https://www.legislation.gov.uk/ukpga/2020/29/contents/enacted 29] || 31 December 2020 || Current || This act incorporates the EU–UK Trade and Cooperation Agreement which sets out the new relationship between the UK and the European Union and was agreed on 24 December 2020 into the domestic law of the United Kingdom.\n|}\nSee also\n* Act of Parliament (United Kingdom)\n* Law of the European Union\n* European Court of Justice\n* European Atomic Energy Community (Euratom)\nReferences"
    }
  ]
}