{
  "content": [
    {
      "type": "text",
      "text": "# Adai rebellion\n\n| combatant2        =  Kazakhs of Aday\n| commander1        = Pavel Kutaisov\n| commander2        =\n| strength1         = Initial: 40 soldiersEventual: 800\n| strength2         = Initial: 5,000Eventual: 10,000\n| casualties1       =\n| casualties2       =\n}}\nThe Adai Uprising (), or Mangyshlak Rebellion, was a revolt that took place on the Mangyshlak Peninsula (at Mangistau, on the eastern coast of the Caspian Sea in the territory of present-day Kazakhstan) by local Kazakh tribe against the introduction of several administrative reforms on the peninsula by the Russian government under the general title of Temporary Regulation.\nTribes on the peninsula\nThe Kazakh tribes that inhabited the Mangyshlak (Mangystau) Peninsula, as well as the adjacent Buzachi Peninsula and the Ustyurt Plateau, the southern part of which was partially inhabited by Turkmen tribes, were formally subjects of the Russian Empire. The districts were governed by sultan-rulers, which were appointed by the Russian administration. However, the power of Russia was purely nominal and was not established directly in the place. Government demands were generally implemented at the discretion of the residents themselves. At the same time, up until 1870, Khivans freely traveled across the steppes of those regions, collecting zakat (tribute) from residents.\nLocal sultans and Russian officials were unable to penetrate deep into the steppes to protect the inhabitants, and military patrols, having reached the Emba River at most, returned without results.\nThe exact number of the population, in particular the Adaevtsy, was unknown. They paid taxes according to the number of 10 thousand kibitkas, but according to official data there were twice as many of them, and based on information collected from the Adaevites themselves, there were presumably more than 30 thousand kibitkas. The Adaevites were divided into two sections, ruled by their honorary biys: the upper section, the ordinary ensign bay-Muhammad Mayaev, and the lower section, the ordinary ensign Kafar Kalbin.\nBackground\nBack in early 1869, in connection with the introduction of the Provisional Regulations, an uprising arose in the Junior Zhuz. The Kazakhs of the Ural and Turgai regions rebelled. The rebellion covered a significant area from the Emba River to the north and south. Russian merchants and local feudal lords were attacked in particular. Between March and June, 41 raids were carried out on the estates of biys, sultans, and local elders. Orenburg province's trade with Bukhara, Turkestan, and the steppe was also interrupted. By autumn the uprising was suppressed.Taking into account the experience of events in the steppes of the Turgai and Ural regions, before the introduction of the Temporary Regulations in Mangyshlak, the Orenburg Governor-General strengthened the Uilskoye, Uralskoye and Embenskoye fortifications, and also erected a new one in the lower reaches of the Emba in the Mashe tract. In addition, a Special Committee was created under the chairmanship of Adjutant General N. A. Kryzhanovsky. The duties of the district chiefs who were part of that committee were to maintain order in the summer camps of the Adaevites and to keep the military garrisons in combat readiness.At the end of 1869, military governor N. A. Verevkin summoned Adaev's remote commanders, ensigns Baimukhamed Mayaev and K. Kolbin, to Uralsk. Having explained the basics of the new situation, Verevkin instructed them to begin collecting a kibitka tax from the Adaevites for 3 rubles 50 kopecks from 1870. Lieutenant Colonel N. M. Rukin was appointed head of the Mangyshlak police department, and Verevkin instructed him to collect the same amount of tax from the Adaevites for 1869. Meanwhile, on February 2, 1870, the Mangyshlak office was transferred from the Orenburg Governorate General to the Caucasus Viceroyalty.\nRebellion\nUnrest in Mangyshlak\nThe positional views of the remote chiefs Mayaev and Kalbin differed. The first was more loyal to the Russian government, and upon arrival from Uralsk, he immediately began to introduce a new situation in the Upper Distance, which he controlled, convincing the Adaevites of the beneficial consequences of the innovation. The second one, in his Lower Distance, declared, that the new regulation does not yet apply to the Adaevites, which misled them\nExpedition of Rukin's detachment\nCommander Rukin gathered 40 people in the Alexander Fort to suppress unrest in the steppe with a short sortie, when he went on a sortie, the detachment realized that it was surrounded by a huge force of 5,000 people, the Russians maneuvered for about a day and gained time, but Rukin decided to negotiate. The Kazakhs cajoled him with words about his excellent attitude towards the prisoners and asked him to lay down his arms, the whole squad understood that this was stupid because such attempts at negotiation once ended with the death of an entire corps in 1717 however, Rukin was adamant when the Cossacks came out of hiding a whole crowd piled on them and killed almost everyone, taking 3 people prisoner. Rukin himself decided to shoot himself out of grief.\nIn Alexandrovskiy Fort\nUpon arrival at the Alexander fort of Nuker Mayaev with a note from Rukin, a team (20-foot Cossacks, a sergeant, a policeman, and a paramedic) with a gun and a second ammunition set for the detachment was immediately sent to help the latter. The conductor was Mayaev's son. The team arrived at the place of the last overnight stay of Rukin's detachment on March 25 at five o'clock in the evening (that is, several hours after the death of the detachment). Near that place, the team met a Kazakh carrying the body of the murdered Mayaev, who informed the team about the death of the detachment\nOn March 26, the team returned to the Alexandrovsky fort with the news of the death of the bailiff and his detachment, and from Murzabaev, who arrived later at the fort, they learned the details of what happened. On the same day, the commandant of the fort, Major E. N. Zelenin, declared a state of siege and ordered the fort to be prepared for defense. All, with rare exceptions, the workers and Kazakhs who roamed near the fort, upon receiving the news, fled to the steppe on the first night and for the most part, joined the rebels\nOn March 27, Zelenin sent reports on a major uprising in Mangyshlak to Gurevsky town and Astrakhan on fishing boats.\nAttack on settlements\nThe settlers of the Nikolaevskaya stanitsa (5 versts from the fort), warned by the commandant about the danger, partly moved to the fort, and partly, putting their property on ships, sailed from the shore and spent the night there. On April 2 (before Palm Saturday), most of the settlers landed early in the morning and began to heat their baths. At about 9 a.m., up to 6,000 rebels  suddenly attacked the village and began to kill or capture settlers who fled in panicThe Cossacks, who saw this from the walls of the fort, asked the commandant for permission to sortie. Major Zelenin hesitated for a while. It was permissible to launch no more than a hundred on a sortie, which, most likely, could be surrounded by thousands of enemy masses and cut off from the escape routes to the fort, which would remain without a significant part of its defenders. Because of this, Zelenin forbade the Cossacks to make a sortie.\nThere was a packet boat in the bay at the exit to the sea, guarded by six Cossacks, who, at the first appearance of the rebels in the village, opened fire on them with long-range rifles. About 30 Adaev's men rushed onto another packet and rushed at the Cossacks. The latter managed to jump into a boat and go to the fort.In three days, the Adaevites completely looted and destroyed the village of Nikolaevskaya and other coastal settlements, as well as burned and destroyed all the Tyub-Karagan lighthouses on the Caspian Sea\nSiege of Alexandrovskiy Fort\nThe fort's garrison, under the command of its commandant, Major E. N. Zelenin, consisted of 150 infantry Cossacks with 14 guns. They were also joined by workers, hospital servants, clerks, orderlies, merchants, and anyone who could handle a weapon even a little. In addition, the Cossacks of the garrison were given soldiers' rifles so that in case of an attack they could use bayonets in hand-to-hand combat.On April 5, the rebels besieged the Alexander Fort. Biy Isa Tlunbayev, denying his involvement in the uprising and assuring that Rukin and the Cossacks who were with him were in his captivity, through a parliamentarian offered Zelenin to expel all the Adayevites from the fort, after which he would release the prisoners. At the same time, Tlunbayev asked that Zelenin himself come out to meet him, otherwise, he assured that \"The entire Adaev clan rose up to defend its law\" and its small garrison would not be able to resist him. Zelenin, already knowing about the fate of Rukin's detachment, refused, suggesting at the same time to try to take the fortification by force\nOn April 6, the rebels launched a massive assault. Despite the limited amount of ammunition, the garrison opened heavy fire. The rebels hastily retreated. In the evening of the same day, they attempted to occupy a commanding height near the fort, dominating the surrounding area and the fort itself, but were driven back by a group of Cossacks who had managed to occupy it.\nTwo expeditions of Kutaisov and Bagration-mukhtarsky\nIn early April, the first reinforcements arrived to help the fort. They were separated but generally had no more than 140 people. The team under the command of Kutaisov went to meet another detachment on the way, and came across a detachment of 800 Kazakhs, who attacked them but were defeated.\nThe next day, Kutaisova's column met reinforcements.\nHowever, the main rebel forces again besieged the Alexander Fort, the Russians had to fight their way there.\nAttacks on 21 April\nKutaisov's detachment of 57 horsemen (the rest remained to cover the rear) tried to break through to the Alexander fortification, the rebels saw this detachment and gave priority to its destruction, Cossacks were surrounded by 5,000 Kazakhs\nThe detachment quickly fired volleys and went into hand-to-hand combat, the first ranks of the Adais rested against the covering allies and suffered heavy losses, but did not run and continued to attack. Finally, government troops broke through the encirclement, but the pursuit stopped only when a small reinforcement moved from the fort, depicting the sounds of an entire army, the rebels fell for it and retreated,\nthe detachment lost 9 killed and 14 wounded.\nThe losses of the Kazakhs were very large, the whole area was littered with corpses.\nTwo Saranchev expeditions\nOn June 7, more government forces arrived, commanded by\nHe was moving towards Lake Massha, where the veterans of the uprising who took part in the extermination of Rukin's detachment were located. Upon learning of the attack, they began to flee in a hurry, but they were overtaken several times and inflicted heavy losses.\nSuch actions ended with the subjugation of part of the rebels and the release of 5 prisoners.\nIn early July, the second expedition took place, unexpected raids on the settlements of the Adai forced them to flee half-naked to the islands, where they were locked up, a few days later most of them surrendered, returning the looted property.\nCape Chagrai\nOn July 25, a very small column clashed with 800 rebels who were armed with rifles and wearing bulletproof armor. The detachment defended itself in hand-to-hand combat for a whole day, until it was rescued by an expedition passing nearby.\nThe March of Baykov and the suppression of the uprising\nThis detachment acted as a secondary one back in June, where detachment acted as a secondary one back in June, where it conducted a march along the Chegan River for 500 versts, defeating the Adaevites 4 times, but its main activity became after the rescue of comrades at Cape Chagray.\nBaykov's actions only completed the suppression of the uprising, the attitude towards the rebels became very loyal, and Baykov was ordered to avoid using weapons, despite this, he destroyed the entire population of points in his path, killing men and mocking women, robbing their cattle at the same time.\nSo on September 10, he attacked several villages, killed 20 men, and raped all the women.\nFor such actions, Baykov and his team were stripped of their ranks and sent into exile.\nAftermath\nThe uprising was brutally suppressed, despite this, the government made some concessions and allowed the Adai people to roam over a larger territory.\nBy order of the Russian government, the uprising should be regarded as a military campaign.\nNotes\nReferences\nBibliography\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*"
    }
  ]
}