{
  "content": [
    {
      "type": "text",
      "text": "# Adams National Historical Park\n\n| locmapin = Massachusetts#USA\n| locmap_relief =\n| built = 1681\n| architect =\n| architecture = Georgian, Federal\n| added = October 15, 1966\n| area =  (NRHP listing)  ( federal)\n| designated_nrhp_type = December 9, 1946\n| increase = November 26, 1952\n| designated_nrhp_type2 = November 2, 1998\n| visitation_num = 12,848\n| visitation_year = 2022\n| website = [https://www.nps.gov/adam/ Adams National Historical Park]\n| refnum = 66000051\n| visitation_ref =\n}}\nAdams National Historical Park, formerly Adams National Historic Site, in Quincy, Massachusetts, preserves the homes of United States presidents John Adams and John Quincy Adams, U.S. envoy to Great Britain, Charles Francis Adams, and of writers and historians Henry Adams and Brooks Adams.\nThe national historical park's eleven buildings tell the story of five generations of the Adams family (from 1720 to 1927) including presidents, first ladies, envoys, historians, writers, and family members who supported and contributed to their success. In addition to Peacefield, home to four generations of the Adams family, the park's main historic features include the John Adams Birthplace (October 30, 1735), the nearby John Quincy Adams Birthplace (July 11, 1767), and the Stone Library (built in 1870 to house the books of John Quincy Adams and believed to be the first presidential library), containing more than 14,000 historic volumes in 12 languages.\nThere is an off-site Visitors Center less than a mile (1.6km) away. Regularly scheduled tours of the houses are offered in season (April 19 to November 10) by guided tour only. Access to United First Parish Church, also called the Church of the Presidents, where the Adamses worshipped and are buried, is provided by the congregation, for which they ask a small donation. The Church of the Presidents is across the town square from the Visitors Center and provides tours on a regular basis.\nJohn Adams Birthplace\nThis house is a National Historic Landmark, the birthplace of John Adams. In 1720 it was purchased by Deacon John Adams, Sr., the father of the future second president. The younger Adams lived here until 1764, when he married Abigail Smith. It is a few feet from the John Quincy Adams Birthplace home, where John and Abigail Adams lived\nJohn Quincy Adams Birthplace\n]]\nThe house where John and Abigail Adams and their family lived during the time he was working on the Declaration of Independence and the Revolutionary War is also the 1767 birthplace of their son, John Quincy Adams. The younger Adams grew up in the home, and he and his family lived in it for a time later in life.\nThe Old House at Peacefield\n]]\nThe Old House was originally constructed in 1731 for Leonard Vassall, a sugar plantation owner, and was used as his summer house. The house stood empty for some time before it, along with , was purchased by Adams on September 23, 1787, for 600 pounds. The Adams family renamed it Peacefield, moved in the next year, and various generations occupied it until 1927, when Brooks Adams, the last occupant, died. That year, it was sold to the Adams Memorial Society.\nThe National Park Service acquired it in 1947, and it has been a National Historic Site ever since.\nStone Library\nThe Stone Library, completed in 1870, stands next to Peacefield and houses personal papers and over 14,000 books that belonged to John Adams, John Quincy Adams, Charles Francis Adams, Henry Adams, and Brooks Adams. In his will, John Quincy Adams requested that the library be built out of stone so that it would be fireproof.\nThe Library holds John Adams' copy of George Washington's Farewell Address as well as the Mendi Bible, a Bible presented to John Quincy Adams in 1841 by the freed Mendi captives who had mutinied on the schooner La Amistad and whom Adams had successfully defended before the United States Supreme Court.\nHenry Adams wrote his nine-volume The History of the United States of America 1801–1817 in the library.\nOn the evening of November 11, 1996, one or more thieves used a chainsaw to gain access to and rob the building. The break-in triggered the site’s alarm system; however, the perpetrators fled before police arrived.\nFour priceless books were stolen: a 1772 English Bible which belonged to Louisa Catherine Adams (John Quincy Adams's English-born wife), a 1611 King James Bible, an 18th-century copy of Marcus Elieser Bloch's Ichthyology (which contained hand-painted illustrations), and the 1838 Mendi Bible (which was presented to John Quincy Adams by the group of 53 Mendi tribes people whom Adams defended for at the Supreme Court). With the help of the FBI, the books were returned to Adams National Historical Park undamaged.  Kevin P. Gildea, 42, was indicted on two counts of theft and one count each of concealing objects of cultural heritage and concealing government property.\nUnited First Parish Church\n, the Adams' church and location of their burial crypt.]]\nThe church where both presidents and first ladies are entombed in the Adams Crypt is in close walking distance to the park visitor center but is not and has never been run by the National Park Service. It is owned by the active congregation of Unitarian Universalists. In the past ten years, the congregation has used almost $2 million of its own resources to preserve the building. Church volunteers regularly give tours of the crypt, and the church is a popular second destination among park visitors.\nAdministrative history\n*February 13, 1927 — Brooks Adams, the last owner of the house, dies.\n*December 9, 1946 — The Old House at Peacefield was designated the Adams Mansion National Historic Site\n*1948- Wilhelmina Harris, Brooks Adams's former secretary, is hired to work at the park.\n*1950  — Wilhelmina Harris is promoted to become the park's first superintendent\n*November 26, 1952 — The site was renamed Adams National Historic Site and an adjoining parcel of land was added.\n*December 19, 1960 — the birthplaces of both presidents were designated National Historic Landmarks.\n*October 15, 1966 — The entire historic site was listed on the National Register of Historic Places (as are all historic areas administered by the National Park Service).\n*December 30, 1970 — The privately owned United First Parish Church was also designated a National Historic Landmark.\n*November 2, 1998 — The historic site was redesignated Adams National Historical Park.\nSee also\n*National Register of Historic Places listings in Quincy, Massachusetts\n*Presidential memorials in the United States\nReferences\nFurther reading\n*\n* See Publications and Books on Wilhelmina Harris page. Harris was the National Park Service Superintendent for the Adams Historical Park for 37 years, and worked ten years as social secretary to Brooks Adams until his death.\nExternal links\n* Official NPS website: [https://www.nps.gov/adam/ Adams National Historical Park]\n*[https://irma.nps.gov/DataStore/DownloadFile/463276 Cultural Landscape report for the Adams Birthplaces, Adams National Historical Park, 2014]\n*[http://www.c-span.org/video/?121951-1/life-portrait-john-adams \"Life Portrait of John Adams\"], from C-SPAN's American Presidents: Life Portraits, broadcast from Adams National Historical Park, March 22, 1999\n*[http://www.c-spanvideo.org/program/165131-1 \"Writings of Henry Adams\", broadcast from Adams National Historical Park] from C-SPAN's American Writers"
    }
  ]
}