{
  "content": [
    {
      "type": "text",
      "text": "# Adam Zwar\n\n| birth_place = Cairns, Queensland, Australia\n| death_date =\n| death_place =\n| body_discovered =\n| death_cause =\n| pseudonym = Adam Zwarr\n| medium = Film, television\n| active = 1990s–present\n| genre =\n| subject =\n| spouse = Amanda Brotchie (2003–present)\n| domestic_partner =\n| children =\n| parents =\n| notable_work = Alex Burchill on LowdownAdam Douglas on WilfredThe Wedding PartyRats and Cats\n}}\nAdam Zwar (born 13 January 1972) is an Australian actor, voice artist, and writer. He is best known for co-creating the Australian comedy series Squinters, Lowdown, Wilfred and creating the critically acclaimed Channel 10 comedy Mr. Black as well as the popular factual series Agony Aunts, Agony Uncles, The Agony of Life, The Agony of Modern Manners and Agony. Zwar also presented and produced seminal cricket documentaries Underarm: The Ball That Changed Cricket and Bodyline: The Ultimate Test which took a forensic look at the infamous 1932–1933 Ashes series between Australia and England.\nEarly life\nZwar was born on 13 January 1972 in Cairns, Queensland where he was subsequently raised.  His parents bought the family home from actor Leo McKern. Zwar is the son of author Desmond Zwar, who wrote the best-selling book The Loneliest Man in the World about Rudolf Hess. Zwar's mother, Delphine, was a long-time writer for the House and Garden magazine.\nFrom the age of twelve Zwar attended Smithfield High School and then Brisbane Grammar School, where he was captain of the cross-country team in his senior year. After high school he completed a journalism degree at the University of Southern Queensland in Toowoomba. He subsequently began studying acting as well. He undertook a journalism cadetship at The Cairns Post and subsequently moved to Melbourne to work for the Sunday Herald Sun.\nAfter some time working at the Sunday Herald Sun, Zwar decided to pursue his interest in the film industry. In 1997 he left his full-time journalism job to do two jobs - as a freelance journalist and freelance actor. He performed in theatre and numerous television commercials and had guest roles in Neighbours, Blue Heelers and Sea Change. Each year Zwar would save a portion of his income (usually around $A4000) and use it to produce a short film.\nCareer\nAfter guest appearances in several Australian television shows in the late 1990s, Adam co-wrote, produced and co-starred in the short film Wilfred in 2002 and then went on to co-create and co-star in the television series, Wilfred, screened on SBS in 2007. Later that year, he won the AFI Award for Best Performance in a Television Comedy. After a second season on Wilfred, Adam collaborated with Amanda Brotchie, to create the popular comedy, Lowdown, which went on to win Best Television Comedy Screenplay at the Australian Writers Guild Awards (AWGIES) in 2010 and 2012. Lowdown would also win Best Television Comedy at the 2013 AACTA Awards.\nMore recently, he has created the successful Agony series for ABC1, featuring some of Australia's funniest and brightest comedians and social commentators. In 2012, Agony Uncles premiered, followed by Agony Aunts, The Agony of Life, The Agony of Christmas and then in 2014 The Agony of Modern Manners and The Agony of the Mind. In 2015, the series returned with Agony. Agony Aunts won Best Light Entertainment Television Series at the 2013 AACTA Awards. In 2017, Adam co-created the series, Squinters with Trent O'Donnell and in 2018, created Mr. Black for Channel 10.  He has also written six episodes of Austin for the ABC. in 2021, Adam released his memoir - Twelve Summers (2021)\nAdam also co-wrote and co-starred in the movie Rats and Cats, which premiered to sell-out audiences and critical acclaim at the 2006 Melbourne International Film Festival and went on to screen at the SXSW Film Festival in 2009. From 2006 to 2010, he was head writer on the AFI Awards screened on the Nine Network, working alongside hosts Geoffrey Rush and Stephen Curry. Zwar's other acting credits include playing Martin Gero in Series 1 of 2 of the Network Ten crime drama Rush, as well as the SBS series Carla Cametti PD, the ABC television movie ''Valentine's Day, the crime drama Underbelly'' for Channel Nine. In 2016, Zwar joined the main cast of Foxtel's drama Top of the Lake and in 2023, played a leading role in the crime series, Scrublands for STAN.\nZwar's other screen-acting credits include both seasons of the Network Ten sketch comedy series The Wedge, Blue Heelers, Stingers, CrashBurn, SeaChange, BackBerner, Foxtel's drama Tangle and MDA. His stage-acting credits include Kissing for Australia, for which he received a Green Room Award nomination, and Cyrano de Bergerac for the Melbourne Theatre Company.\nHe has also written the plays Kissing for Australia, Primrose Hill, The Inner Sanctum, and The Fall and Fall of Jeremy Hawthorn\nZwar is one of Australia's leading voice-over artists lending his voice to Ford, Australia Post, ISelect, the Herald Sun, Honda, HBA, Boag's, RACV, Bundaberg Rum, AHM and Blackmores.\nPersonal life\nZwar is married to Amanda Brotchie, the AFI award-winning filmmaker.\nWriting credits\n{| class=\"wikitable plainrowheaders sortable\"\n|-\n! scope=\"col\" | Year\n! scope=\"col\" | Title\n! scope=\"col\" | Type\n! scope=\"col\" | Other notes\n|-\n! scope=\"row\" | 1994\n| The Fall and Fall of Jeremy Hawthorn\n| Play\n|\n|-\n! scope=\"row\" | 2002\n| Wilfred\n| Film\n| Short, co-written with Jason Gann\n|-\n! scope=\"row\" | 2005\n| The Inner Sanctum\n| Play\n|\n|-\n! scope=\"row\" | 2006–2007\n| Rats and Cats\n| Film\n| Co-written with Jason Gann\n|-\n! scope=\"row\" | 2008\n| Kissing for Australia\n| Play\n|\n|-\n! scope=\"row\" | 2008\n| Primrose Hill\n| Play\n|\n|-\n! scope=\"row\" | 2010–2012\n| Lowdown\n| TV series\n| Co-creator with Amanda Brotchie; executive producer; writer - 15 episodes\n|-\n! scope=\"row\" | 2007–2010, 2011–2014\n| Wilfred\n| TV series\n| Co-creator with Jason Gann and Tony Rogers; writer - 16 episodes\n|-\n! scope=\"row\" | 2012–2015\n| Total Agony\n| TV series documentary\n| Host; director; executive producer; writer - 34 episodes\n|-\n! scope=\"row\" | 2017\n| No Activity\n| TV series\n| Co-writer with Trent O'Donnell and Patrick Brammall - episode \"The Crow\"\n|-\n! scope=\"row\" | 2019\n| Mr. Black\n| TV series\n| Creator; executive producer; writer - 8 episodes\n|-\n! scope=\"row\" | 2018–2019\n| Squinters\n| TV series\n| Co-creator with Trent O'Donnell; executive producer; head writer - 12 episodes\n|-\n! scope=\"row\" | 2022\n| Darby and Joan\n| TV series\n| writer - 1 episode\n|-\n! scope=\"row\" | 2024-2025\n| Austin\n| TV series\n| writer - 7 episodes\n|}\nActing credits\nTelevision\n{| class=\"wikitable plainrowheaders sortable\"\n|-\n! scope=\"col\" | Year\n! scope=\"col\" | Title\n! scope=\"col\" | Role\n! scope=\"col\" | Other notes\n|-\n! scope=\"row\" | 1998\n| Neighbours\n| Mark Billings\n| 2 episodes\n|-\n! scope=\"row\" | 1999–2000\n| SeaChange\n| Const. George Velos\n| 4 episodes\n|-\n! scope=\"row\" | 1999–2001\n| Stingers\n| Reuben/Grubby Kane\n| 2 episodes\n|-\n! scope=\"row\" | 1998–2002\n| Blue Heelers\n| Mike Schneider/Arnie Violet\n| 2 episodes\n|-\n! scope=\"row\" | 2003\n| CrashBurn\n| Tat\n| Episode \"One Hundred Years of Solitude\"\n|-\n! scope=\"row\" | 2002–2005\n| MDA\n| Peter Munro\n| 5 episodes\n|-\n! scope=\"row\" | 2006–2007\n| The Wedge\n| Various characters\n| 48 episodes\n|-\n! scope=\"row\" | 2008\n| Underbelly\n| Gregg Hildebrandt\n| Episode \"Team Purana\"\n|-\n! scope=\"row\" | 2008\n| Bogan Pride\n| Mr. Laffer\n| 2 episodes\n|-\n! scope=\"row\" | 2009\n| Carla Cametti PD\n| Hank\n| Episode \"In Sickness and in Health\"\n|-\n! scope=\"row\" | 2008–2009\n| Rush\n| Martin Gero\n| 2 episodes\n|-\n! scope=\"row\" | 2007–2010\n| Wilfred\n| Adam Douglas/Detective Delaney\n| 16 episodes\n|-\n! scope=\"row\" | 2010\n| Tangle\n| Huey Moss\n| 2 episodes\n|-\n! scope=\"row\" | 2011\n| The Match Committee\n| Adam Harrington\n| 3 episodes\n|-\n! scope=\"row\" | 2011\n| Some Say Love\n| Various characters\n| Episode \"Pilot\"\n|-\n! scope=\"row\" | 2012\n| ''Howzat! Kerry Packer's War\n| Peter McFarline\n| 2 episodes\n|-\n! scope=\"row\" | 2012\n| Rake\n| Bob Oakley\n| Episode \"R vs Alford\"\n|-\n! scope=\"row\" | 2010–2012\n| Lowdown\n| Alex Burchill\n| 16 episodes\n|-\n! scope=\"row\" | 2014\n| Party Tricks\n| Trevor Bailey\n| 6 episodes\n|-\n! scope=\"row\" | 2015\n| The Beautiful Lie\n| Comedy Host\n| Episode \"#1.2\"\n|-\n! scope=\"row\" | 2016\n| The Doctor Blake Mysteries\n| Herbert Jones\n| Episode \"The Open Road\"\n|-\n! scope=\"row\" | 2016\n| The Legend of Gavin Tanner\n| Marshall\n| Episode \"The Legend of Gavin and the New Best Mate\"\n|-\n! scope=\"row\" | 2017\n| Top of the Lake\n| Carson\n| 4 episodes\n|-\n! scope=\"row\" | 2018\n| Sando''\n| Tony's Commercial (voice only)\n| Episode \"Family Business\"\n|-\n! scope=\"row\" | 2019\n| Mr. Black\n| Jim (Mr. Black's Doctor)\n| Episode \"#1.7\"\n|-\n! scope=\"row\" | 2018–2019\n| Squinters\n| Radio Announcer/Traffic Reporter\n| 12 episodes\n|-\n! scope=\"row\" | 2023\n| Scrublands\n| Robbie Haus-Jones\n| 4 episodes\n|-\n! scope=\"row\" | 2024\n| Darby and Joan\n| Laurie Sallaway\n| 1 episode\n|}\nFilm\n{| class=\"wikitable plainrowheaders sortable\"\n|-\n! scope=\"col\" | Year\n! scope=\"col\" | Title\n! scope=\"col\" | Role\n! scope=\"col\" | Director\n! scope=\"col\" | Other notes\n|-\n! scope=\"row\" | 2000\n| Narcosys\n| Orbit\n| Mark Bakaitis\n|\n|-\n! scope=\"row\" | 2002\n| Wilfred\n| Adam Douglas\n| Tony Rogers\n| Short film\n|-\n! scope=\"row\" | 2007\n| Rats and Cats\n| Ben Baxter\n| Tony Rogers\n|\n|-\n! scope=\"row\" | 2007\n| Little Deaths\n| Daniel/Toxicman\n| Toby Angwin, Chris Benz (director), Melanie Brunt\n|\n|-\n! scope=\"row\" | 2008\n| ''Valentine's Day\n| Beak\n| Peter Duncan\n| TV movie\n|-\n! scope=\"row\" | 2010\n| The Wedding Party\n| Tommy\n| Amanda Jane\n|\n|-\n! scope=\"row\" | 2016\n| Emo the Musical\n| Principal Stephens\n| Neil Triffett\n|\n|-\n! scope=\"row\" | 2021\n| Fraud Festival\n| Radio Announcer (voice only)\n| Sam Petersen\n| TV movie\n|}\nAwards and nominations\n*AACTA: Won with Amanda Brotchie and Nicole Minchin Best Television Comedy for Lowdown (2012).\n*AACTA: Won with Amanda Brotchie and Nicole Minchin Best Light Entertainment for Agony Aunts (2012).\n*AWGIE (Australian Writers Guild) Award: Won with Amanda Brotchie and Trudy Hellier Best Comedy – Situation or Narrative for Lowdown (2012) Episode 3 – \"One Fine Gay\"\n*Australian Film Institute Awards (Television): Won with Jason Gann Best Screenplay in Television Wilfred (2007)\n*AWGIE (Australian Writers Guild) Award: Won with Amanda Brotchie Best Comedy – Situation or Narrative for Lowdown'' (2010) Episode 7 – \"Who's Your Baddy?\"\n*AWGIE (Australian Writers Guild) Award: Nominated for Best Comedy – Situation or Narrative for Wilfred (2007) Episode 6 – \"Dog Eat Dog\" Wilfred (2007)\n*Australian Film Institute Awards (Television): Won Best Actor in a Television Comedy Wilfred (2007)\n* The Green Room Awards (Theatre): Nominated for Best Actor – Kissing for Australia[http://www.greenroom.org.au/2002/2002winners The greenroom.org.au web site]\n*Accolade Competition: Award for Excellence in Comedy – Lowdown\n*Accolade Competition: Award for Excellence for Leading Actor – Lowdown\nWorks\n* Twelve Summers (2021)\nReferences\nExternal links\n*\n*"
    }
  ]
}