{
  "content": [
    {
      "type": "text",
      "text": "# Additional Articles of the Constitution of the Republic of China\n\n| jurisdiction         = Free area of the Republic of China\n| date_created         =\n| date_presented       =\n| date_ratified        =\n| date_effective       =\n| system               = Unitary semi-presidential republic\n| branches             = Five (Executive, Legislative, Judicial, Examination, Control)\n| head_of_state        = President\n| chambers             = Unicameral(Legislative Yuan)\n| executive            = Executive Yuanled by the Premier\n| courts               = Judicial Yuan\n| federalism           = Unitary\n| electoral_college    = No\n| number_entrenchments =\n| date_legislature     =\n| date_first_executive = May 20, 1996 (President)\n| date_first_court     =\n| date_repealed        =\n| number_amendments    = 7\n| date_last_amended    = June 10, 2005\n| location_of_document =\n| commissioned         = National Assembly\n| writer               =\n| signers              = 457 of the 583 remaining delegates, in Taipei(most delegates elected in 1947, with some elected in 1969 and 1986)\n| media_type           =\n| supersedes           = Temporary Provisions against the Communist Rebellion and most articles of the original Constitution of the Republic of China\n}}\n|s=\n|bpmf=ㄓㄨㄥ ㄏㄨㄚˊ ㄇㄧㄣˊ ㄍㄨㄛˊ ㄒㄧㄢˋ ㄈㄚˋ ㄗㄥ ㄒㄧㄡ ㄊㄧㄠˊ ㄨㄣˊ |w=Chung¹-hua² Min²-kuo² Hsien⁴-fa³ Tseng¹-hsiu¹ T'iao²-wen²\n|p=Zhōnghuá Mínguó Xiànfǎ Zēngxiū Tiáowén|tp=Jhonghuá Mínguó Siànfǎ Zengsiou Tiáowún|mps=Jūnghuá Mínguó Shiànfǎ Tzēngshiōu Tiáuwén|gr=Jonghwa Min'gwo Shiannfaa Tzengshiou Tyauwen\n|poj=Tiong-hôa Bîn-kok Hiàn-hoat Cheng-siu Tiâu-bûn|tl=Tiong-hûa Bîn-kok Hiàn-huat Tsing-siu Tiâu-bûn|h=Chûng-fà Mìn-koet Hien-fap Chen-siû Thiàu-vùn}}\nThe Additional Articles of the Constitution of the Republic of China are the revisions and amendments to the original constitution of the Republic of China to \"meet the requisites of the nation prior to national unification\", taking into account the democratic reforms and current political status of Taiwan. The Additional Articles are usually attached after the original constitution as a separate document. It also has its own preamble and article ordering different from the original constitution.\nThe Additional Articles has been part of the fundamental law of the present government of the Republic of China on Taiwan since 1991, and were last amended in 2005. The Additional Articles will sunset in the event the Republic of China regains control of the Mainland Area.\nMain provisions\nThe current Additional Articles of the Constitution entail 12 articles:\n; Article 1: Referendum on amendment to the Constitution and alteration of the national territory.\n; Article 2: President and the vice president.\n; Article 3: Premier and the Executive Yuan.\n; Article 4: Legislative Yuan.\n; Article 5: Judicial Yuan.\n; Article 6: Examination Yuan.\n; Article 7: Control Yuan.\n; Article 8: Remuneration and pay of the members of the Legislative Yuan.\n; Article 9: Local governments.\n; Article 10: Fundamental national policy.\n; Article 11: Cross-Strait relations (rights and obligations between people of the free area and mainland China).\n; Article 12: Procedure for amending the Constitution.\nFree area\nThe territory controlled by the Government of the Republic of China changed significantly after the Chinese Civil War, and the Republic of China could not hold elections in territories it did not control. Thus, the Additional Articles of the Constitution defines the Free Area (; Pha̍k-fa-sṳ: ) to be the territory and the people under the government's effective jurisdiction. Whilst all residents of China are nominally citizens of the Republic, only the citizens who have the household registration in Taiwan may exercise the full civil and political rights, including right of abode and suffrage.\nDirect presidential election\nThe Additional Articles requires direct election of the President by the citizens of the free area. The first direct presidential election was held in 1996. Under the original constitution, the President was elected indirectly by the National Assembly.\nGovernment reform and reorganization\nThe Additional Articles of the Constitution reformed the government of the Republic of China from a parliamentary system to a de facto semi-presidential system. The National Assembly is de facto abolished, and its functions are exercised directly by the citizens of the Free area. The five-power governmental structure is retained, though it functions closer to the traditional Western trias politica in practice.\nConstitutional referendum\nA 2005 amendment regarding on referendum stated that a constitutional amendment or an alteration of the national territory has to be ratified by more than half (50%) of voters of the Free Area in a referendum after passed in the Legislative Yuan with a three-quarters majority. Before that, constitutional amendments and national territory alterations were ratified by the National Assembly.\nComparison of the governmental structure\nMost of the amendments brought by the Additional Articles focuses on the mechanism of separation of powers among central governmental organs. The Additional Articles changed the form of government from parliamentary system to semi-presidential system, enhance the implementation of direct democracy and direct election, reduce the chambers of parliament, and simplify the hierarchy of local governments.\n{|class=wikitable\n!Governmental structure!!Additional Articles (2005)!!Original Constitution (1947)\n|-\n|Form of government||Semi-presidential republic||Parliamentary republic\n|-\n|Head of state||The president is elected directly by the citizens of the free area (Taiwan) to a four-year term, and may be re-elected once.\n|The president is elected indirectly by the National Assembly to a six-year term, and may be re-elected once.\n|-\n|Head of government||The premier is appointed by the president. The Legislative Yuan may vote on a motion of no confidence.\n|The premier is nominated and appointed by the president, with the consent of the Legislative Yuan.\n|-\n|Parliament||valign=top|Unicameralism: Legislative Yuan\n* Members of the Legislative Yuan are elected directly by the citizens of the free area (Taiwan) to a four-year term.\n|valign=top|Tricameralism: National Assembly, Legislative Yuan and Control Yuan\n* Delegates of the National Assembly are elected directly by the citizens to a six-year term.\n* Members of the Legislative Yuan are elected directly by the citizens to a three-year term.\n* Members of the Control Yuan are elected indirectly by provincial legislators to a six-year term.\n|-\n|Judiciary||The justices are nominated and appointed by the president with the consent of the Legislative Yuan to an eight-year term.\n|The justices are nominated and appointed by the president with the consent of the Control Yuan to a nine-year term.\n|-\n|Local government||The provinces are streamlined: counties and cities under provinces are subordinated directly to the central government.\n|A two-level system is in place: the provincial-level and the county-level.\n|}\nHistory of amendments\nThe Additional Articles of the Constitution have been amended seven times since the 1990s.\n{|class=wikitable\n!Amendment!!colspan=2|Process!!Note\n|-\n|rowspan=2 align=center|1st||Apr 22, 1991||Ratified by 1st National Assembly\n|Delegates elected in 1947, 1969, and 1986. In the 583 delegates, 470 attended, 457 agreed.\n|-\n|May 1, 1991||Promulgated by 8th President Lee Teng-hui||Additional Articles established\n|-\n|rowspan=2 align=center|2nd||May 27, 1992||Ratified by 2nd National Assembly\n|Delegates elected in 1986 and 1991. In the 403 delegates, 285 attended, 277 agreed.\n|-\n|May 28, 1992||Promulgated by 8th President Lee Teng-hui||\n|-\n|rowspan=2 align=center|3rd||Jul 28, 1994||Ratified by 2nd National Assembly\n|Delegates elected in 1991. In the 321 delegates, 220 attended, 215 agreed.\n|-\n|Aug 1, 1994||Promulgated by 8th President Lee Teng-hui||\n|-\n|rowspan=2 align=center|4th||Jul 18, 1997||Ratified by 3rd National Assembly\n|Delegates elected in 1996. In the 333 delegates, 269 attended, 261 agreed.\n|-\n|Jul 21, 1997||Promulgated by 9th President Lee Teng-hui||\n|-\n|rowspan=3 align=center|5th||Sep 3, 1999||Ratified by 3rd National Assembly\n|Delegates elected in 1996. In the 315 delegates, 214 attended, 211 agreed.\n|-\n|Sep 15, 1999||Promulgated by 9th President Lee Teng-hui||\n|-\n|Mar 24, 2000||Voided by Justices of the Judicial Yuan||Constitutional Interpretation No. 499\n|-\n|rowspan=2 align=center|6th||Apr 24, 2000||Ratified by 3rd National Assembly\n|Delegates elected in 1996. In the 314 delegates, 287 attended, 285 agreed.\n|-\n|Apr 25, 2000||Promulgated by 9th President Lee Teng-hui||\n|-\n|rowspan=3 align=center|7th(in effect)||Aug 23, 2004||Proposed by 5th Legislative Yuan\n|Members elected in 2001. In the 225 members, 198 attended, 198 agreed.\n|-\n|Jun 7, 2005||Ratified by the National Assembly\n|Delegates elected in 2005. In the 300 delegates, 298 attended, 249 agreed.\n|-\n|Jun 10, 2005||Promulgated by 11th President Chen Shui-bian||Currently in force\n|-\n|rowspan=2 align=center|——(failed)||Mar 25, 2022||Proposed by 10th Legislative Yuan\n|Members elected in 2020. In the 113 members, 109 attended, 109 agreed.\n|-\n|Nov 26, 2022||Ratification failed in national referendum||Out of 19,239,392 eligible voters, only 5,647,102 agreed. See 2022 Taiwanese constitutional referendum\n|}\nSee also\n* Constitution of the Republic of China\n* Temporary Provisions against the Communist Rebellion\n* Politics of the Republic of China\n* History of Taiwan since 1945\nReferences\nExternal links\n* [http://english.president.gov.tw/Page/95 Additional Articles of the Constitution] by the Office of the President, Republic of China (Taiwan)\n* [https://web.archive.org/web/20060712040715/http://www.gio.gov.tw/info/news/additional.htm English translation of the Additional Articles of the Constitution (2005 reform)]\n* [http://www.taiwandocuments.org/constitution07.htm English translation of the Constitution] by the Taiwan Documents Project.\n* [https://web.archive.org/web/20110718134843/http://www.twcenter.org.tw/e02/20011224.htm Constitution day and constitutional government]"
    }
  ]
}