{
  "content": [
    {
      "type": "text",
      "text": "# Addis Housewares\n\nAddis Housewares (also known as Addis or Addis Brush Company) is a British supplier and manufacturer of domestic and commercial products. Originally founded in 1780, the company was owned by the Addis family, to whom the first modern toothbrush is credited.\nThe now international independently owned company, based in Bridgend in the United Kingdom, has a 240-year history of designing, manufacturing and supplying housewares. The Addis brand has manufacturing facilities in the United Kingdom, Germany, and the Far East. Its products are sold in many large British homeware stores.\nThe company is a subsidiary of EMSA, a German consumer goods company.\nHistory\nAddis Housewares was originally created in 1780 by William Addis I (1734-1808), a stationer and rag merchant, who produced the first modern toothbrush and went on to export high-quality English brushes. William Addis II (1787-1873) grew the family business (Addis and Sons) and by 1840 had 60 staff working for the company. William Addis III took over in the 1860s, further expanding the business with the use of machinery. William III had seven sons who went into the business -  three of which (William Addis IV, Robert Addis I, and Charles Addis) became partners in the firm. In 1893 the partnership was dissolved with Robert Addis I (1850-1918) separating to form his own brushmaking business. Following the death of William IV, in 1900, Robert I purchased his brother's business with the agreement of William IV's widow, merging the two entities to form one Addis company. Following the death of Robert Addis I in 1918, his son, Robert Addis II, took over the business.\nIn 1920 the Addis family moved to Hertford, taking over a factory on Ware Road, which they retained until 1996. By 1940, the company had invested in modernised technology and moved into plastic moulding manufacturing, including the development of the first bristle-style artificial Christmas trees. By the end of World War II, Addis had launched Wisdom Toothbrushes and entity that became Britain's leading toothbrush manufacturer, and expanded their brush range into Addis Housewares which included the production of items such as bowls, buckets, and washing-up brushes. Due to the brand's popularity and rising demand, they purchased an additional manufacturing premises in Swansea in the 1960s.\nOn the anniversary of its bicentenary, the company celebrated by publishing a 55-page historical biography. The book however was not shared for public retail.\nIn 1996 Wisdom Toothbrushes was sold to a management buy-out team composed of its pre-existing chief executive, Brian McMullen (with the controlling 51% stake), Mike Rudge (manufacturing director), Janice Collins (marketing director), Julian Edge-Partington (financial director) and 3i (a venture capital group). Earlier in the same year, Addis Housewares also experienced a management buy-out, led by Chris Papadopoulos, worth £20 million.\nIn 1999 Addis Housewares was taken over by Emsa, the German housewares company, for an undisclosed sum. The purchase was backed by CINVen, the same venture capital fund that backed the 1996 management buy-out.\nDirectors\n* Richard John Tucker (Company Secretary and Director)\n* Mark Simon Godfrey\n* Martyn Lee Smith\n* Miles William Simmons\n* David Rand\n* Lewis Bowen Major\nReferences\nExternal links\n* [https://www.addis.co.uk/ Official Website]"
    }
  ]
}