{
  "content": [
    {
      "type": "text",
      "text": "# Adiante-Galician Revolutionary Youth\n\n| dissolved      =\n| headquarters   = Vigo, Galicia\n| mother_party   = Galician People's Front\n| international  =\n| affiliation1_title =\n| affiliation1   =\n| ideology       = Galician independenceMarxism-leninismAntifascismFeminismInternationalism\n| regional1_type =\n| regional1_name =\n| regional2_type =\n| regional2_name =\n| student        = Galician Student League\n}}\nAdiante - Galician Revolutionary Youth (Adiante-Mocidade Revolucionaria Galega, in Galician language) was a youth organization in Galicia (Spain) with a Galician independentist and communist ideology. According to themselves Adiante was \"an autonomous youth assembliary organization, that embraced the diversity of the Galician youth problems from the perspective of national and social liberation, with the strategic horizon the construction of an independent, socialist and feminist Galician Republic.\"\nHistory\nAdiante starts to set in open assemblies meetings that took place on the eve of July 25, 2003, date on which is celebrated annually on \"National Day of Galicia\" (Día Nacional de Galicia). After a series of time converging in several movements (as combating LOU, Prestige, against the war in Iraq...), young people who had the project in mind Adiante called for October 9, 2004 the Constituent Assembly, which took place in Santiago de Compostela.\nSince then, Adiante participated in many social causes: feminism (mobilized annually on 8 March and 25 November), solidarity with other nations (Cuba, Palestine, Venezuela, Euskal Herria, etc.) and, most recently, participating in the European elections in 2009 in the candidacy Iniciativa Internacionalista (II-SP), along with other galician nationalist organizations.\nOn November 11, 2013, in a statement posted on its website and related virtual media of the nationalist left, announced its self-dissolution. Some members of Adiante would later found Xeira, as the new youth of the FPG. Other militants of Adiante chose not to join Xeira and in late 2014 formed a new youth group with independents and exmilitants of the Assembleia da Mocidade Independentista, with the name Terra.\nReferences\nExternal links\n*"
    }
  ]
}