{
  "content": [
    {
      "type": "text",
      "text": "# Adon (king)\n\nAdon (Aramaic: 𐡀𐡃𐡍) was a Philistine king in the late-7th century BC. Though it is uncertain which Philistine city-state he governed, he was probably its last king, and seemed to essentially be a vassal of the Twenty-sixth Dynasty of Egypt.\nIn the waning years of the  Neo-Assyrian Empire, revolts against the Chaldeans' authority became increasingly common, albeit rarely successful. During a Babylonian revolt in 609 BC which would ultimately mark the destruction of Neo-Assyria, Necho II crossed the Levant to aid the Assyrians in putting the rebellion down. Josiah of Judah attempted to halt Necho's path at Megiddo, but he was killed, and his initial successor, Jehoahaz, was deposed by a defeated Necho as he returned to Egypt just four months later. Now the only substantial power in the area, Egypt quickly endeavored to fill the power-vacuum left by Neo-Assyria's disintegration - becoming overlords to most of the Levantine kingdoms in the area. Egyptian imperialism, however, proved short lived: by 604 BC, the Babylonians under Nebuchadnezzar II had taken most of Neo-Assyria's former territory, and began pushing into the Levant.\nPhilistia was traditionally a pentapolis, a group of five independent city states, which also controlled a number of villages, usually but not always in their general vicinity. These cities were Isdud, Ascalon, Ekron, Gath, and Gaza, though Gath disappeared from history after its apparent \"capture\" by Sargon II in 711 BC. King Adon is attested to by the Adon Papyrus, a letter he sent to the pharaoh warning of the Babylonian's advance and petitioning him to send troops to aid the city-state in resisting the Babylonian armies. The letter was written in Aramaic, somewhat unusual for the time, however, the name of Adon's city is not preserved as the entirety of the letter has not survived. Adon mentions sighting the Babylonians' encampment at \"Aphek\", however, there were several cities by that name at the time, and their locations are not all known with certainty. Generally, scholars consider two main candidates for Adon's kingdom: Ashkelon, or Ekron.\nRegardless of which city Adon ruled, resistance was ultimately futile: Philistia as a whole was definitively destroyed by Nebuchadnezzar's invasion by the end of 604 BC. The Philistines as a distinct people subsequently disappeared. Adon's fate is unknown.\nReferences"
    }
  ]
}