{
  "content": [
    {
      "type": "text",
      "text": "# ADR (treaty)\n\nADR, formally the Agreement of 30 September 1957 concerning the International Carriage of Dangerous Goods by Road is a 1957 United Nations treaty that governs transnational transport of hazardous materials. \"ADR\" is derived from the French name for the treaty: Accord relatif au transport international des marchandises Dangereuses par Route). Until 31 December 2020, the treaty was fully named European Agreement concerning the International Carriage of Dangerous Goods by Road. However, as the word \"European\" might have given the impression that the treaty was only open for accession to European states, an amendment was decided in the end of 2019.\nConcluded in Geneva on 30 September 1957 under the aegis of the United Nations Economic Commission for Europe, it entered into force on 29 January 1968. The agreement was modified (article 14, paragraph 3) in New York City on 21 August 1975, though these changes only took effect on 19 April 1985. A new amended ADR 2011 entered into force on 1 January 2011. Annexes A and B have been regularly amended and updated since the entry into force of ADR. Consequently, to the amendments for entry into force on 1 January 2015 (until June 2017), a revised consolidated version has been published as document ECE/TRANS/242, Vol. I and II.  Every two years the regulations are updated with the latest version applicable being the ADR 2023.\nAs of 2025, 55 states are party to ADR.\nContents\nThe agreement itself is brief and simple, and its most important article is article 2. This article states that with the exception of certain exceptionally dangerous materials, hazardous materials may in general be transported internationally in wheeled vehicles, provided that two sets of conditions be met:\n# Annex A regulates the merchandise involved, notably their packaging and labels.\n# Annex B regulates the construction, equipment, and use of vehicles for the transport of hazardous materials.\nThe appendices consist of nine chapters, with the following contents\n# General provisions: terminology, general requirements\n# Classification: classification of dangerous goods (CDG)\n# Dangerous Goods List sorted by UN number, with references to specific requirements set in chapters 3 to 9; special provisions and exemptions related to dangerous goods packed in limited quantities\n# Packaging and tank provisions\n# Consignment procedures, labeling, and marking of containers and vehicles.\n# Construction and testing of packagings, intermediate bulk containers (IBCs), large packagings, and tanks\n# Conditions of carriage, loading, unloading, and handling\n# Vehicle crews, equipment, operation, and documentation\n# Construction and approval of vehicles\nHazard classes\nThe classes of dangerous goods according to ADR are the following:\n*Class 1 Explosive substances and articles\n*Class 2 Gases, including compressed, liquified, and dissolved under pressure gases and vapors\n** Flammable gases (e.g. butane, propane, acetylene)\n** Non-flammable and non-toxic, likely to cause asphyxiation (e.g. nitrogen, CO2) or oxidisers (e.g. oxygen)\n** Toxic (e.g. chlorine, phosgene)\n*Class 3 Flammable liquids\n*Class 4.1 Flammable solids, self-reactive substances, and solid desensitized explosives\n*Class 4.2 Substances liable to spontaneous combustion\n*Class 4.3 Substances which, in contact with water, emit flammable gases\n*Class 5.1 Oxidizing substances\n*Class 5.2 Organic peroxides\n*Class 6.1 Toxic substances\n*Class 6.2 Infectious substances\n*Class 7 Radioactive material\n*Class 8 Corrosive substances\n*Class 9 Miscellaneous dangerous substances and articles\nEach entry in the different classes has been assigned a 4 digit UN number. It is not usually possible to deduce the hazard class of a substance from its UN number: they have to be looked up in a table. An exception to this are Class 1 substances whose UN number will always begin with a 0. See List of UN numbers.\nTunnel classifications\napproach road shows Class E. London, United Kingdom]]\nThe ADR Secretariat has defined a classification system for major tunnels in Europe. \"The categorization [is] based on the assumption that in tunnels there are three major dangers [that] may cause numerous victims or serious damage to the tunnel structure.\" It is the responsibility of each national authority to categorize its tunnels accordingly. The classes ranges from A (least restrictive), to E (most restrictive). , in the United Kingdom for example, the least restrictive was the tunnel carrying the A299 to the Port of Ramsgate, while the most restrictive were several tunnels in East London, including the Limehouse Link tunnel, the Rotherhithe Tunnel, the Blackwall Tunnel and the East India Dock Link Tunnel.\nADR pictograms\nADR pictograms for chemical hazards are based on GHS Transport pictograms and Non-GHS transport pictograms\nImage:ADR 1.svg|1 - Explosives\nImage:ADR 2.1.svg|2.1 - Flammable gases\nImage:ADR 2.2.svg|2.2 - Non-toxic and non-flammable gases\nImage:ADR 2.3.svg|2.3 - Poison gases\nImage:ADR 3.svg|3 - Flammable liquids\nImage:ADR 4.1.svg|4.1 - Flammable solids\nImage:ADR 4.2.svg|4.2 - Spontaneously combustibles\nImage:ADR 4.3.svg|4.3 - Dangerous when wet\nImage:ADR 5.1.svg|5.1 - Oxidizers\nImage:ADR 5.2.svg|5.2 - Organic peroxides\nImage:UN transport pictogram - 6.svg|6.1 - Poison\nImage:ADR 6.2.svg|6.2 - Infectious substances\nImage:ADR 7B.svg|7 - Radioactive\nImage:UN transport pictogram - 8.svg|8 - Corrosive\nImage:ADR 9.svg|9 - Miscellaneous dangerous substances\nImage:ADR 9A.svg|9A - Lithium Ion Batteries\nSee also\n*Dangerous goods\n*European hazard symbols\n*Hazchem – a system used in the United Kingdom, Australia, and New Zealand for marking dangerous goods\n*ATEX directive – two EU directives governing permitted equipment in explosive environments\nReferences\nNotes\nADR 2023 https://unece.org/info/Transport/Dangerous-Goods/pub/373077\nSources\n*[https://unece.org/transport/standards/transport/dangerous-goods/adr-2023-agreement-concerning-international-carriage] on the United Nations Economic Commission for Europe website\nExternal links\n*[https://unece.org/transport/standards/transport/dangerous-goods/adr-2023-agreement-concerning-international-carriage]\n*[https://unece.org/rev-21-2019 UN Model regulations (\"Orange book\") 2019]\n*[http://www.hse.gov.uk/cdg/manual/classification.htm How to assign a UN Number and proper shipping name]\n*[https://adrbook.com/en ADR Book - Dangerous Goods by Road]"
    }
  ]
}