{
  "content": [
    {
      "type": "text",
      "text": "# Adventure Time: Hey Ice King! Why'd You Steal Our Garbage?!!__disambig_1\n\n| released     = Nintendo DS, Nintendo 3DSNintendo eShop\n| genre        = Action-adventure\n| modes        = Single-player\n}}\n'Adventure Time: Hey Ice King! Why'd You Steal Our Garbage?!!' is a 2012 action-adventure game developed by WayForward Technologies and published by D3 Publisher for the Nintendo DS and Nintendo 3DS. It is based on the animated television series Adventure Time.\nThe game was released in North America for retail release on November 20, 2012, and digitally via Nintendo eShop on December 13, 2012. The 3DS version was later released in Europe and Australia on February 13, 2014, as a Nintendo eShop exclusive. The game was delisted from digital storefronts in December 2016 due to licensing issues.\nGameplay\nThe gameplay is shown to top-down when Finn and Jake are exploring The Land of Ooo, but when the player goes into a dungeon, the gameplay switches into a 2D side-scroller, much like Zelda II: The Adventure of Link. The game contains a second quest once beaten. It has many items that help the player on the adventure, many of which are iconic items from the show such as the Tiger Claw and Royal Tart. Some items are food items that replenish some of your health. Combining food can either replenish more health, (like hamburger and ketchup) or harm your health (like hamburger and maple syrup). There are four mainlands players can explore: the Grasslands, Candy Kingdom, Ice Kingdom, and Red Rock Pass. Jake learns more of his stretchy abilities as players progress into the game. They include a wavy punch, ear shield, transforming into a bridge, dinghy, parasol, and many more.\nPlot\nThe Ice King is busily constructing a Garbage Princess out of the odds and ends left lying around by heroes Finn and Jake. It is up to Finn and Jake to set things straight.\nDevelopment\nThe game was initially announced on March 23, 2012, by both WayForward and the series' creator Pendleton Ward, who worked with the developer as a creative consultant for the game. Jake Kaufman composed the music for the game, which was completely original except for the title theme.\nCollector's Edition\nOn July 12, 2012, it was revealed that the game would have a collector's edition for both DS and 3DS. It includes a steel-case cover of the Enchiridion (The hero's handbook), a poster of Ooo, a book called Book of Beasts, and a stylus designed after Finn's sword.\nReception\nThe game received mixed reviews from critics. It holds a 67% score on Metacritic, with some criticism of its relatively short story length. IGN's Lucas M. Thomas, an avid Adventure Time fan, gave the game an 8.5 \"great\" rating, commenting that \"this is an amazing adventure and I have almost no complaints to level against it.\" GamingUnion.net's Spencer Pressly scored it as a 7/10, arguing that \"this is what most Adventure Time fans could want in a game,\" but due to the short story length it \"should've been a downloadable title.\" Jonathan Holmes, writing for Destructoid, praised the game's visuals and sound design saying that \"They stay true to the feel of the source material,\" but criticized the game for being easy.\nReferences\nExternal links\n*[https://web.archive.org/web/20121112064115/http://www.d3p.us/ProductDetails.asp?ProductID=171 D3 Publisher's official game page]"
    }
  ]
}