{
  "content": [
    {
      "type": "text",
      "text": "# Afraad Rebellion\n\nSomalia\n*  WSLF\n*  Ethiopia (until 1980)\n}}\n| commander1        = Mohamed AliMohamed Hashi Lihle\n| commander2        =  Siad Barre Mohammad Ali Samatar Mohammed Hashi Gani Abdullahi Mahmoud Hassan Mengistu Haile Mariam\n| campaignbox       =\n| casualties2       = 29 killed\n| casualties1       = unknown\n}}\nThe Afraad Rebellion was an armed insurgency that took place between 1978 and 1982 in the Hawd region of what is now Somaliland and Eastern Ethiopia, waged against both the Western Somali Liberation Front (WSLF) and the Somali National Army. It was led by Mohamed Farah Dalmar Yusuf, a former army officer who organized the rebellion in response to escalating atrocities committed by WSLF fighters and Somali government troops in the region, including massacres, rapes, extrajudicial killings, and widespread looting.\nThe name \"Afraad\" (literally \"the Fourth\") referred to the movement's military structure, which referred to it being the Fourth Brigade. After years of resistance, Mohamed Farah Dalmar Yusuf and his entire movement formally joined the Somali National Movement at its founding, with the Afraad Fighters forming the core of its military wing. This marked a key turning point in the organized armed resistance against the regime of Siad Barre.\nThe Afraad Rebellion is widely considered to be the catalyst for the broader Somaliland War of Independence, laying the groundwork for the SNM's later successes in mobilizing mass resistance across the Somaliland. It remains a defining chapter in Somaliland's Liberation Struggle, remembered for its grassroots origins, disciplined leadership, and fierce opposition to state-led violence in the Haud.\nBackground\nPrelude\nUpon the disastrous conclusion of the Ogaden War, a huge influx of Ethiopian refugees (mostly ethnic Somalis and some Oromo) fled across the border to Somalia. However, the northern region (where Isaaqs live) experienced the majority of the physical and human destruction due to its geographical proximity to the fighting.\nThis has caused great deal of burden on both the local Isaaqs and state apparatus, especially coming off a costly war with Ethiopia, Somali studies scholar I. M. Lewis noted that \"the stark fact remained that the economy of the country simply did not possess the resources to absorb so many uprooted people.\"\nThe presence of such a large number of refugees, especially when Somalia's total population at the time was 4.1&nbsp;million (UN estimates) meant that virtually one out of every four people in Somalia was a refugee. The Barre regime exploited the presence of such a large number of refugees as means of seeking foreign aid, as well as a vehicle to displacing those deemed hostile to the state, notably the Isaaqs, Human Rights Watch noted that: \"Northerners [Isaaqs] were dismissed from and not allowed to work in government offices dealing with refugee affairs, so that they would not discover the truth about the government's policies. Instead refugees, registered with UNHCR were given jobs in the offices dealing with refugee matters.\" As the state became increasingly reliant on international aid, aid resources allocated for the refugees caused further resentment from the local Isaaq residents, especially as they felt no effort was made on the government's part to compensate them for bearing the burden of the war. Furthermore, Barre heavily favoured the Ogaden refugees, who belonged to the same clan (Darod) as him. Due to these ties, the Ogaden refugees enjoyed preferential access to \"social services, business licenses and even government posts.\"\nAs expressed animosity and discontent in the north grew, Barre armed the Ogaden refugees, and in doing so created an irregular army operating inside Isaaq territories. The regime's use of armed refugees against local Isaaq populations in the north is also referenced in an Africa Watch report: \"[M]any Ogadeni refugees were recruited into the WSLF. The WSLF was ostensibly being trained to fight Ethiopia to regain the Ogaden [Western Somalia], but, in fact, terrorized the Isaak [Isaaq] civilian population living in the border region, which came to fear them more than the Ethiopian army. Killings, rape and looting became common.\"Barre was essentially ensuring the loyalty of the Ogaden refugees through continued preferential treatment and protection at the expense of the local Isaaq who were not only bypassed for economic, social and political advancement but also forcefully suppressed by both the Somali Armed Forces and the Ogaden refugee militias.\nThe settlement of Ogaden refugees in Isaaq territory, and the arming of these groups (which effectively created a foreign army in the north), further antagonised local Isaaq population. The armed Ogaden refugees, together with members of the Marehan and Dhulbahanta soldiers (whom were provoked and encouraged by the Barre regime) started a campaign of terror against the local Isaaqs as they raped women, murdered unarmed civilians, and prevented families from conducting proper burials. Barre ignored Isaaq complaints throughout the 1980s, this along with Barre's repression of criticism or discussions of the widespread atrocities in the north had the effect of turning the long-standing Isaaq disaffection into open opposition.\nFormation\ncommander Mohamed Farah Dalmar Yusuf \"Mohamed Ali\"]]\nOne of the militias formed by the Ogaden refugees was the WSLF, officially created to fight Ethiopia and \"reclaim ethnic Somali territory\" in Ethiopia but it was used primarily against local Isaaq civilians and nomads. A Human Rights Watch's Africa Watch report states \"The WSLF was ostensibly being trained to fight Ethiopia to regain the Ogaden, but, in fact, terrorized the Isaak civilian population living in the border region, which came to fear them more than the Ethiopian army. Killing, rape and looting became common.\"\nAs for the looting, the Ogaden refugees from Ethiopia ransacked homes that were vacated by Isaaq civilians out of clan hatred. The Isaaqs entrepreneurial disposition was also a factor of the large-scale looting, which the Ogadenis saw as 'undeserved':\nIn northern Somalia, the Isaaq clans confronted a massive influx of Ogadeni refugees from eastern Ethiopia whom Siyad encouraged to loot property, attack people, and destabilize cities. An instrument of oppression, the Ogadenis and the regular Somali army were viewed as alien forces sent to oppress the Isaaq. Clan animosity intersected with class hatred as rural Ogadeni clansmen harassed Isaaq entrepreneurs with a visceral hatred, convinced that their wealth and urban commodities were undeserved. The Isaaq tell hilarious, but pathetic stories about Ogadenis who stole modern household appliances from homes in Hargeisa, Borama and Burao, then retreated with their \"trophies\" to use them in the remote pasture lands devoid of electricity.\nAs the WSLF, supported by the Barre regime, continued to attack and commit atrocities against the Isaaq, a delegation was sent to meet President Barre in 1979 to request making a stop to WSLF abuses. In spite of promises made to the Isaaq elders the violence against civilians and nomads by WSLF continued.\nThe continued abuse of WSLF and the government's indifference to the suffering of Isaaq civilians and nomads prompted many Isaaq army officers to desert the army with a view to creating their own armed movement to fight Ethiopia, one that would also intimidate the WSLF and discourage further violence against Isaaq civilians. Their new movement, supported and financed by Isaaqs, was named Afraad (the fourth unit) and became operational in 1979. The Isaaq movement of Afraad immediately came into conflict with the Ogaden clan's faction of WSLF in the form of a number of bloody encounters between the two groups. Afraad's objective was to push the WSLF out of their strongholds (Isaaq territory) whereas the WSLF responded by retaliating further against Isaaq civilians living in the border region.\nThe situation was further exacerbated by the appointment of Mohamed Hashi Gani, a cousin of President Siad Barre and fellow Marehan Darod, as the military commander of the northern regions with headquarters in Hargeisa in 1980. Gani's rule was especially harsh against Isaaq, he removed them from all key economic positions, seized their properties and placed the northern regions under emergency laws. He also ordered the transfer of Afraad away from the border region, giving the WSLF complete control of the border region, thus leaving Isaaq nomads in the area without any protection against WSLF violence.\nBeginning of hostilities\nThe Afraad Movement immediately started clashing with the WSLF, where fighting occurred around the Haud. Afraad's objective was to push the WSLF out of their strongholds (Isaaq territory) whereas the WSLF responded by retaliating further against Isaaq civilians living in the border region.\nIn 1979, An Isaaq officer attacked and captured 14 WSLF fighters in a place called Gobyar, where they were harassing local residents, they were taken to Gebiley, and all subsequently executed. In 1980, the leader of the Afraad Movement, Mohamed Ali, was captured and arrested in Mogadishu, where he was charged with treason for leading the rebellious. He was rescued by his close friend Mohamed Hashi Lihle, who would later on become one of the most important Somali National Movement leaders until his death in 1984 at the Burco-Duuray offensive. Further fighting occurred in 1979-1980, until the arrival of one of Barre's most trusted Generals, General Mohamed Hashi Gani, who attempted to deprive the Afraad of weapons and transfer them south of the country. This led to a longer Guerrilla struggle against the Somali Army itself, where Afraad militias regularly ambushed and attacked Somali and WSLF troops and convoy vehicles.\nOne such even occurred in December 1981, when a group of Afraad fighters intercepted and ambushed a military truck at a place called Dhaberooble, where they killed 19, including 6 WSLF fighters.\nThe guerrilla campaign would intensify in 1981-82, where fierce fighting occurred. In October 1982, a large battle occurred around Gaashaamo, when Afraad fighters ambushed and defeated a small contingent of WSLF fighters, and in 25th of October 1982, another successful ambush on the Somali National Army occurred in Wajaale, where 10 soldiers were killed and several others wounded. In 1981, groups of Afraad fighters would move further into the Hawd and establish military presence for the Somali National Movement. The Afraad Movement would formally join the newly created Somali National Movement, serving as its primary military wing. It would contribute to several military operations jointly conducted by the Derg and the Somali National Movement, which would effectively end the WSLF as a threat by 1983, when an SNM offensive succeeded in cutting them off from their rear bases in Somaliland.\nAftermath\nThe collapse of the WSLF by 1984 effectively ended the oppression of Isaaq civilians in the Haud plateau, ended the four year long Afraad insurgency. The Afraad would serve as the catalyst for the Somaliland War of Independence, where they formed the main nucleus military force of the movement.\nSee also\n*Somali National Movement\n*Somaliland War of Independence\n*Afraad Movement\n*Mohamed Farah Dalmar Yusuf\n* Ogaden War\nReferences"
    }
  ]
}