{
  "content": [
    {
      "type": "text",
      "text": "# African Union Department of Agriculture\n\n}}\nThe Department of Agriculture, Rural Development, Blue Economy, and Sustainable Environment (ARBE) is a department of the African Union (AU) dedicated to promoting sustainable agricultural development, rural economy growth, and environmental sustainability across Africa.\nMandate\nThe department's mandate includes:\n* Promoting the implementation of Agenda 2063 Continental Frameworks such as the Comprehensive Africa Agriculture Development Programme (CAADP).\n* Supporting agricultural and rural development.\n* Developing policies and strategies to ensure food security and nutrition.\n* Assisting member states in achieving sustainable growth through sound environmental and natural resources management.\n* Promoting rural community initiatives and technology transfer.\n* Coordinating efforts to eradicate poverty.\n* Combating desertification and drought, including initiatives like the Great Green Wall for the Sahara and Sahel Initiative (GGWSSI).\n* Supporting Multilateral Environment Agreements (MEAs), Land Policy Initiative (LPI), Global Framework for Climate Services (GFCS), and Disaster Risk Reduction (DRR).\n* Implementing projects like the Partnership for Aflatoxin Control in Africa (PACA), African Fertilizer Financing Mechanism (AFFM), and the African Seed and Biotechnology Program (ASBP).\n* Promoting disaster mitigation policies and strategies.\n* Harmonizing policies among the Regional Economic Communities (RECs).\n* Conducting research on climate change, water and sanitation, and land management.\nStructure\nCommissioner\nJosefa Leonel Correia Sacko, (elected January 2017).\nDirector\nGodfrey Bahiigwa (Uganda)\nDivisions\n* Agriculture and Food Security Division\n* Rural Development Division\n* Sustainable Environment Division\n* Blue Economy Division\nTechnical Offices\n* AU Inter-African Phytosanitary Council (IAPSC)\n* AU–Inter-African Bureau for Animal Resources (AU–IBAR)\n* Pan African Veterinary Vaccine Centre (PANVAC)\n* Pan African Tsetse and Trypanosomiasis Eradication Campaign (PATTEC)\n* Semi-Arid Food Grain Research and Development (SAFGRAD)\nSee also\n* African Union\n* Agenda 2063\nReferences\nExternal links"
    }
  ]
}