{
  "content": [
    {
      "type": "text",
      "text": "# Afterfall: Reconquest\n\n|composer=\n| genre     = Third-person shooter, action, adventure\n| modes     = Single-player\n| platforms = Microsoft Windows\n}}\nAfterfall: Reconquest (previously titled as Afterfall: Pearl of the Wastelands) is an episodic story-driven third-person shooter video game with action and adventure elements, developed by Intoxicate Studios and published by Nicolas Entertainment Group for Microsoft Windows. It is the sequel to the video game Afterfall: Insanity. The game was to consist of 9 episodes. The first episode was released on February 19, 2015.\nGameplay\nThe game like its predecessor is a third-person shooter. However unlike the survival horror gameplay of the first game it is a story-driven shooter with a semi-open world. The art style of the game is comic book-style black-and-white with items of interests highlighted in red. The aiming style of the game is a centered one. The player faces both human and non-human enemies in the game with mutants being the most common enemies and he has two types of weapons at his disposal. One are the conventional types of weapons with limited ammunition, for example a 10-mm handgun, and the other are energy-based weapons which recharge over time. The player can also zoom in with the weapons. The Reaper said player is in control of has access to three separate \"powers\" at any given time. The life drain power drains life energy from the mutants the player slaughtered and converts it to his own, a hand-mounted shotgun and the holographic shield that protects from damage but drains the energy ammunition whenever it takes damage. The player can also lure enemies to narrow alleyways where gunfire can sometimes ricochet. The mutants which are the most common enemies attack using their claws while the human enemies use weapons. The player is given quests by characters in the game that encourage exploration of the maps of the game which are usually linked through tunnels.\nSynopsis\nThe game takes place 63 years after the events of the previous game in a post-apocalyptic world. Those that found shelter in \"sanctuary cities\" in mountains survived the nuclear holocaust. After some years, the resources in these cities began to run out and the survivors were forced to venture in the outside world to find places suitable for life. The game features three powerful factions which are the Hartor, Irivdali and Red Eye.\nFactions\nHartor\nHartor family members are direct descendants of pre-war scientists. The family is controlled by baron slavers who are in turn controlled by the High Council. The Hartor family is the most powerful technocratic family. It is an authoritarian group which maintains complete control over its populace. The family maintains complete monopoly over clean water and medicines in areas controlled by it. They have developed a certain bond with mutants using them to conquer other areas. Their technology is based on bioengineering and mutation.\nIrivdali\nThe Irivdali family are pure-blood technocrats. They are technologically the most advanced and their technology is based on computer and industrial technology. Their expansions are often on lands with high manpower and resources. They are often employed by other families to reverse-engineer old technology. The family is ruled by the \"Father\". The current Father of the family suffers from an incurable sickness which causes him to follow the path of genetics. This sows seeds of distrust among his family since this is against family traditions.\nRed Eye\nThe Red Eyes are a group of well-organised mutants that attacks and destroys settlements. Nothing of them is known by the human families. Unlike other mutants, they are intelligent and their raids are well-organised.\nCharacters\nThe game was to follow the story of 3 characters through 9 episodes. They are Reaper, Hope Iriv and Rattogar.\nReaper\nReaper is the only surviving member of the Corvin family which was annihilated when he was a child. He doesn't remember how he or his friends survived. During his youth, he witnessed many atrocities committed on the humans by the mutants which causes him to deeply hate the mutants. He and his fellow survivors join up with an informal group of inhabitants of a settlement known as the Reapers. He embarks on a quest to discover mutant dwellings and new unknown areas and sharing all the new information with his group through a radio.\nHope Iriv\nShe is the daughter of the leader of the Irivdali family. She is extremely intelligent and has a flair for invention, turning most of the ridiculous ideas into a reality. This caught her father's attention. She is the only female in the family who ever gained access to their technical knowledge. She once came into conflict with her elder brother whom she suspects of attempting to seize power. When her father started suffering from an unknown disease, she ventured into the wasteland to search for the mythical Pearls of the Wasteland which she believes might cure her father.\nRottgar\nRottgar is the son of the leader of the Irivdali family and was brought up far from his family. He spent his youth being trained by the Etoh Corps which are the special forces of the Irivdali. He remains faithful to the tradition and policy of the family. When he returns, he is shocked to see that his father has started embracing mutation due to his incurable disease which is against the family rules. Seeing that his father is a coward, this forces Rottgar to embark upon a journey into the wasteland.\nDevelopment and release\nOn October 19, 2012, the developer Nicolas Entertainment Group revealed that a sequel of the game would be developed through the creation of a Facebook page \"Pearl of the Wasteland\". The game was titled Afterfall: Pearl of the Wasteland. The title of the game was later changed to Afterfall: Reconquest due to a change in the format of the game. Due to the changing of the title, the name of the Facebook page was also changed. Concept art, new information and pictures about the game were posted on the website. The game was announced to be episodic and consisting of nine episodes each focusing on different overlapping scenarios.\nOn July 21, 2014, Intoxicate Studios revealed that an early access version of the game would be released on Steam Early Access on July 24, 2014. A teaser trailer and screenshots of the game were also released. The early access version of Episode 1 was released on July 24, 2014, and contained a small part of the entirety of the full episode. In November 2014, update 1.4 for the early access version was released that added improvements to the game along with a journal for quest logs. Also update 1.5 was announced. In December 2014, update 1.5 was released which added a new art style of the game.\nOn January 20, 2015, the developers revealed that the first episode would be released in the last week of February and that an accurate release date would be revealed later on. On February 9, they revealed the release date of the first episode as February 19. The episode was released on Steam on the announced date.\nThe developer declared itself bankrupt in an application to a court in Katowice on June 8, 2015, as a result of legal dispute with Epic Games, the creators of Unreal Engine 3. Epic Games had filed a lawsuit in October 2012 over overdue royalties for using their game engine. A month later, the developers were ordered by the court to cease production and distribution of a video game as well as hand out all the data carriers with the game engine. After the developers failed to comply, Epic Games contacted Valve which blocked the video games made by it from being sold on Steam by May 2015.\nReferences"
    }
  ]
}