{
  "content": [
    {
      "type": "text",
      "text": "# Aga Khan Award for Architecture__disambig_1\n\n| website =\n}}\nThe Aga Khan Award for Architecture (AKAA) is an architectural prize established by Aga Khan IV in 1977. It aims to identify and reward architectural concepts that successfully address the needs and aspirations of Muslim societies in the fields of contemporary design, social housing, community development and improvement, restoration, reuse and area conservation, as well as landscape design and improvement of the environment.\nThe award is associated with the Aga Khan Trust for Culture (AKTC), an agency of the Aga Khan Development Network (AKDN).\nPrize\nThe Aga Khan Award for Architecture is presented in three-year cycles and has a monetary prize totalling US$1 million that is shared by multiple winning projects. It recognizes projects, teams, and stakeholders in addition to buildings and people.\nChairman's Award\nThe ''Chairman's Award'' is given in honour of accomplishments that fall outside the mandate of the Master Jury. It recognises lifetime achievements of individuals and has been presented four times: in 1980 to Egyptian architect and urban planner Hassan Fathy, in 1986 to Iraqi architect and educator Rifat Chadirji, in 2001 to Sri Lankan architect Geoffrey Bawa, and in 2010 to historian of Islamic art and architecture Oleg Grabar.\nHistory\nThe Aga Khan Award for Architecture was established by the Aga Khan IV (Prince Karim al-Husseini) in 1977. At the time, very few architectural prizes of international scope existed. It has been noted that the award emerged from \"the Aga Khan's sadness at the state of architecture in the Islamic world of the 1970s\", and his conviction of the importance that the built environment holds in shaping a society's quality of life.\nTwenty years earlier, upon inheriting the seat of Imamat of the Shia Ismaili Muslims, the Aga Khan had become responsible for the wellbeing of the Ismaili community, which mostly live in the developing countries of Asia, Africa and the Middle East. He was concerned at the absence of design thinking that could respond to specific challenges in those parts of the world.\nA relentless push for development had led to cheap copies of foreign architectural designs that held no connection or respect for the places where they were being built. The Aga Khan also worried about the rapid disappearance of centuries of distinctive architectural tradition that embodied a continuity of Islamic values, resulting in an absence of \"architecture that could speak to and about the Muslim world\".\nThese problems were most acutely felt during the planning of the Aga Khan University and teaching hospital in Karachi. Questions raised in this process – including the need for a contemporary visual language for the Islamic built environment, as well as for architects trained in modern technologies and sensitive to the diversity, values, and dignity of Muslim culture – would inform the creation of the Award.\nReviving creativity\nBy the 1970s, the decline of the built environment of Muslim societies and loss of cultural identity had become apparent to others as well. From the outset, the Aga Khan recruited several people to help define the award. Among the first were Oleg Grabar a professor at the Harvard Department of Fine Arts, William Porter then Dean of the MIT School of Architecture and Planning, architectural historian Renata Holod, and Pakistani architect Hasan Udhin Khan. They were joined by others, including Nader Ardalan, Hugh Casson, Charles Correa, and Hassan Fathy.\nMembers of the team travelled widely – from Morocco to Indonesia. They debated the cultural role of architecture, the parameters of the award and how to structure its processes. The award was shaped by consultations held with chambers of architects and ministries of urbanism and culture. The first Aga Khan Award for Architecture Seminar was held during April 1978 in Aiglemont, Gouvieux, France. Subsequent seminars have been held in Istanbul, Jakarta, Fez, Amman, Beijing, Dakar, Sana'a, Cairo, Granada and elsewhere.\nIn seeking to define what \"Islamic architecture\" meant, it became apparent that no singular definition was to be found. Instead, the seminars brought to light the diversity of what constituted Islamic architecture. This was recognized as a strength and a dormant source of creativity that the Award would seek to revive.\nKnowledge from architecture\nUnlike conventional prizes that applaud the accomplishments of individual architects, the Aga Khan Award selects projects that improve the quality of life and recognizes all those who have a role in realizing them. This includes clients, builders, artisans, and decision makers. Architecture is viewed as a collaborative endeavour in which architects play a role.\nIn the four decades since its establishment, the Award has documented more than 9,000 projects and actively contributed to the architectural discourse. It has promoted the view that architecture is deeply connected with society and can respond to issues that are of local, national and even international relevance.\nThe Award has brought together practitioners from different geographies and fields like philosophy, social sciences, and the arts, who have served as jurors, steering committee members, technical reviewers, or attended seminars.\nAward process\nThe Aga Khan Award runs in three-year cycles and is governed by a steering committee chaired by the Aga Khan. A new committee is constituted each cycle to establish the eligibility criteria for projects, provide thematic direction concerning current concerns, and to develop plans for the long-term future of the award. The committee is also responsible for seminars and field visits, the award ceremony, publications and exhibitions. At the commencement of each cycle, the steering committee is convened to select a master jury that is diverse in its perspectives and has in past cycles included sociologists, philosophers, artists as well as architects.\nIn each cycle, submissions are received from a global network of approximately 500 nominators – women and men who live in Muslim societies and whose identities are kept anonymous throughout the award process. Independent nominations are also accepted per the award's published guidelines and procedures. Several hundred submissions are typically received in each cycle, and the master jury narrows the field to a short-list.\nProfessional, technical reviewers visit the short-listed projects to understand the living impact of each one on people and the surrounding area. They prepare exhaustive documentation, providing fact-based analysis for the master jury's consideration.\nOver the decades, many notable figures have served on the award's steering committees and master juries, including Homi K. Bhabha, Frank Gehry, Zaha Hadid, Glenn Lowry, Fumihiko Maki, Jacques Herzog, Ricardo Legoretta and Farshid Moussavi. The award is administered from Geneva as part of the Aga Khan Trust for Culture, and Farrokh Derakhshani has served as Director of the Award since 1982.\nPromotion\nThe Aga Khan Foundation funded the television series Architects on the Frontline which was about entries to the competition. The media watchdog Ofcom criticised BBC World News for breaking United Kingdom broadcasting rules with the series, which praised the competition; viewers were not informed that it was sponsored content.\nAward cycles\nPrizes totalling up to US$1m are presented every three years to projects selected by the Master Jury. Since 1977, documentation has been compiled on over 7500 building projects located throughout the world, of which over 100 projects have received awards.\nFirst (1978–1980)\nThe 1980 award ceremony took place at the Shalimar Gardens in Lahore, Pakistan. During this cycle, the Chairman's Award was given to Hassan Fathy in recognition of his lifelong commitment to architecture in the Muslim world. Prominent architect Muzharul Islam was a member of the Master Jury of the first Aga Khan Award for Architecture.\nAward recipients:\n*[https://www.akdn.org/architecture/project/kampung-improvement-programme Kampung Improvement Programme], Jakarta, Indonesia\n*Pondok Pesantren Pabelan, Central Java, Indonesia\n*[https://www.akdn.org/architecture/project/ertegün-house Ertegün House], Bodrum, Turkey\n*Library and conference center of the Turkish Historical Society, Ankara, Turkey\n*Mughal Sheraton Hotel, Agra, India\n*[https://www.akdn.org/architecture/project/conservation-sidi-bou-saïd Conservation of Sidi Bou Saïd], Tunis, Tunisia\n* Restoration of the Rüstem Pasha Caravanserai, Edirne, Turkey\n*National Museum, Doha, Qatar\n*Ali Qapu, Chehel Sutun, and Hasht Behesht Restoration, Isfahan, Iran\n*Halawa House, Agamy, Egypt, by Abdel-Wahed El-Wakil\n*Medical Centre, Mopti, Mali\n*Courtyard Houses, Agadir, Morocco\n*Water Towers, Kuwait City, Kuwait\n*Intercontinental Hotel and Conference Centre, Mecca, Saudi Arabia, by Rolf Gutbrod and Frei Otto\n*Agricultural Training Centre, Nianing, Senegal\nFile:TerrasseSiBouSaid.JPG|Conservation of Sidi Bou Saïd, Tunis\nFile:Agra Sheraton Pool.JPG|Mughal Sheraton Hotel, Agra\nSecond (1981–1983)\nThe 1983 award ceremony took place at the Topkapı Palace in Istanbul.\nAward recipients:\n*Great Mosque of Niono, Mali\n*Šerefudin's White Mosque, Visoko, Bosnia and Herzegovina\n*Ramses Wissa Wassef Arts Centre, Giza, Egypt\n*Nail Çakirhan Residence, Akyaka Village, Muğla, Turkey\n*Hafsia Quarter I, Tunis, Tunisia\n*Tanjong Jara Beach Hotel and Rantau Abang Visitors' Centre, Kuala Terengganu, Malaysia\n*Résidence Andalous, Sousse, Tunisia\n*Hajj Terminal, King Abdulaziz International Airport, Jeddah, Saudi Arabia, by Fazlur Khan\n*Tomb of Shah Rukn-i-'Alam, Multan, Pakistan\n*Darb Qirmiz Quarter, Cairo, Egypt\n*Restoration of Azem Palace, Damascus, Syria\nFile:NailCakirhanHouse AkyakaMuglaTurkey 1983AghaKhanArchitectureAward.jpg|Nail Çakirhan Residence, Akyaka Village, Turkey\nFile:DamascusAzemPalaceLargeCrtyd.jpg|Azem Palace, Damascus, Syria\nFile:Hajj Terminal 01 Jeddah.jpg|Hajj Terminal, Jeddah, Saudi Arabia\nFile:Tomb of Shah Rukn-e-Alam 2014-07-31.jpg|Mausoleum of Shah Rukn-i-Alam in Multan, Pakistan\nThird (1984–1986)\nThe 1986 award ceremony took place at El Badi Palace in Marrakesh, Morocco. The brief prepared by the Steering Committee for this award cycle focused on the preservation and continuation of cultural heritage, community building and social housing, and excellence in contemporary architectural expression.\nSix winners were chosen from among 213 entries. The conservation of Mostar Old Town and restoration of Al-Aqsa Mosque were examples of cultural heritage, the first theme, while the Yama Mosque and Bhong Mosque were noted for their innovation in translating traditional techniques and materials to meet contemporary requirements. The Social Security Complex and Dar Lamane Housing address the issues of community and social housing while remaining sensitive to local culture. The Chairman's Award for Lifetime Achievements was given to Iraqi architect Rifat Chadirji.\nAward recipients:\n*Social Security Complex, Istanbul, Turkey\n*Dar Lamane Housing, Casablanca, Morocco\n*Conservation of Mostar Old Town, Bosnia and Herzegovina\n*Restoration of Al-Aqsa Mosque, Noble Sanctuary, Jerusalem\n*Yaama Mosque, Yaama, Tahoua, Niger\n*Bhong Mosque, Bhong, Rahim Yar Khan District, Pakistan\nFile:Mostar Old Town Panorama.jpg|Mostar Old Town\nFile:Jerusalem Al-Aqsa Mosque BW 2010-09-21 06-38-12.JPG|Restoration of Al-Aqsa Mosque, Jerusalem\nFile:BHONG MOSQUE.jpg|Bhong Mosque, Punjab, Pakistan\nFourth (1987–1989)\nThe 1989 award ceremony took place at the Citadel of Salah Ed-Din in Cairo.\nThe fourth cycle of the award considered 241 project nominations. Of these, 32 were short-listed for technical review and the Master Jury selected 11 winners. Two themes were noted as areas of focus in this cycle: Revival of past vernacular traditions, and projects that reflect the efforts of individual patrons and of non-governmental organisations in improving society.\nProjects such as the Great Omari Mosque and the Rehabilitation of Asilah seek to reconstruct and preserve heritage buildings for continued use, demonstrating the significance of these spaces within their communities. Meanwhile, the Grameen Bank Housing Programme and Sidi el-Aloui Primary School apply architectural solutions to address current socioeconomic issues.\nAward recipients:\n*Great Omari Mosque (Sidon, Lebanon)\n*Rehabilitation of Asilah (Asilah, Morocco)\n*Grameen Bank Housing Programme (various locations in Bangladesh)\n*Citra Niaga Urban Development (Samarinda, East Kalimantan, Indonesia)\n*Gürel Family Summer Residence (Çanakkale, Turkey)\n*Hayy Assafarat Landscaping and al-Kindi Plaza (Riyadh, Saudi Arabia)\n*Sidi el-Aloui Primary School (Tunis, Tunisia)\n*Corniche Mosque (Jeddah, Saudi Arabia), by Abdel-Wahed El-Wakil\n*Ministry of Foreign Affairs (Riyadh, Saudi Arabia)\n*National Assembly Building (Sher-e-Bangla Nagar, Dhaka, Bangladesh), by Louis Kahn\n*Institut du Monde Arabe (Paris, France), by Jean Nouvel and Architecture-Studio\nFile:Assilah Waterfront2.jpg|Asilah Waterfront\nFile:Jatiyo Sangshad Bhaban (Roehl).jpg|National Assembly of Bangladesh, Dhaka\nFile:Sangshad inside.jpg|National Assembly Building, Dhaka\nFifth (1990–1992)\nThe 1992 award ceremony took place at the Registan Square in Samarkand, Uzbekistan.\nUzbek government also released a postal stamp to commemorate the award ceremony & restoration of Registan Square in Partnership with Aga Khan Trust for Culture.\nAward recipients:\n*Kairouan Conservation Programme (Kairouan, Tunisia)\n*Palace Parks Programme (Istanbul, Turkey)\n*Cultural Park for Children (Cairo, Egypt)\n*East Wahdat Upgrading Programme (Amman, Jordan)\n*Kampung Kali Code (Yogyakarta, Indonesia)\n*Stone Building System (Daraa Governorate, Syria)\n*Demir Holiday Village (Bodrum, Turkey)\n*Pan African Institute for Development (Ouagadougou, Burkina Faso), by Association pour le Développement d'une Architecture et d'un Urbanisme Africains (A.D.A.U.A. – Association for the Development of African Architecture and Urban Planning)\n*Entrepreneurship Development Institute of India (Ahmedabad, India), by Bimal Hasmukh Patel\nFile:EDI Panorama Ahmedabad.JPG|Entrepreneurship Development Institute of India\nFile:TUNISIE KAIROUAN 01.jpg|Kairouan\nSixth (1993–1995)\nThe 1995 award ceremony took place at the Kraton Surakarta in Surakarta, Indonesia.\nAward recipients:\n*Restoration of Bukhara Old City, Uzbekistan\n*Conservation of Old San'a', Yemen\n*Hafsia Quarter II, Tunis, Tunisia\n*Khuda-ki-Basti Incremental Development Scheme, Hyderabad, Pakistan\n*Aranya Community Housing [https://www.architectmagazine.com/project-gallery/aranya-low-cost-housing_o], Indore, India, by B.V. Doshi\n*Great Mosque and Redevelopment of the Old City Centre Riyadh, Saudi Arabia\n*Menara Mesiniaga, Kuala Lumpur, Malaysia\n*Kaédi Regional Hospital, Kaedi, Mauritania, by ADAUA.\n*Mosque of the Grand National Assembly, Ankara, Turkey\n*Alliance Franco-Sénégalaise, Kaolack, Senegal\n*Re-Forestation Programme of the Middle East Technical University, Ankara, Turkey\n*Landscaping Integration of the Soekarno-Hatta Airport, Cengkareng, Indonesia\nFile:KaediRegionalHospital2.JPG|Kaédi Regional Hospital\nFile:2012 Bukhara 7515821196.jpg|Bukhara Old City\nFile:San'a03 flickr.jpg|San'a'\nFile:Menara Mesiniaga aerial view.jpg|Menara Mesiniaga\nSeventh (1996–1998)\nThe 1998 award ceremony took place at the Alhambra in Granada, Spain. The Master Jury selected seven winning projects of the 424 presented. During this cycle, special emphasis was placed on projects that responded creatively to the emerging forces of globalization. Issues such as demographic pressure, environmental degradation, and the crisis of the nation-state, and the changes in lifestyle, cultural values, and relationships among social groups and between governments and people at large they prompted, were considered.\nOf the winning projects, the rehabilitation of the Old City of Hebron and Slum Networking of Indore City sought to reclaim community space in environments strained by social, physical, and environmental degradation. The Lepers Hospital created a sustainable and dignified shelter for a marginalized segment of society. The remaining projects were recognized for their contribution in evolving an architectural vocabulary in response to contemporary social and environmental challenges.\nAward recipients:\n*Rehabilitation of the Old City of Hebron\n*Slum Networking of Indore, India by Himanshu Parikh\n*Lepers Hospital, Chopda Taluka, Lasur, India by Per Christian Brynildsen and Jan Olav Jensen\n*Salinger Residence, Bangi, Selangor, Malaysia\n*Tuwaiq Palace, Riyadh, Saudi Arabia\n*Alhamra Arts Council, Lahore, Pakistan, by Nayyar Ali Dada\n*Vidhan Bhavan, Bhopal, India by Charles Correa\nFile:Alhamra Art Centre.JPG|Alhamra Arts Council, Lahore\nFile:Hébron.JPG|Hebron\nEighth (1999–2001)\nThe 2001 Award Presentation Ceremony took place at the Citadel of Aleppo in Syria. During this cycle, the Chairman's Award was given to Geoffrey Bawa to honour and celebrate his lifetime achievements in and contribution to the field of architecture.\nAward recipients:\n*New Life for Old Structures (various locations, Iran)\n*Aït Iktel (Abadou, Morocco)\n*Kahere Eila Poultry Farming School (Koliagbe, Guinea)\n*Nubian Museum (Aswan, Egypt)\n*SOS Children's Village (Aqaba, Jordan), by Ja'afar Tuqan\n*Olbia Social Centre of Akdeniz University (Antalya, Turkey), by Cengiz Bektaş\n*Bagh-e-Ferdowsi (Tehran, Iran)\n*Datai Hotel (Langkawi, Malaysia)\nFile:GD-EG-Musée Nubien001.JPG|Nubian Museum, Aswan\nFile:Aswan Nubian Museum entrance.jpg|Nubian Museum, Aswan\nNinth (2002–2004)\nThe 2004 award ceremony took place at the Humayun's Tomb in New Delhi, India.\nDuring the ninth cycle, 378 projects were nominated. Of these, 23 were site-reviewed, and the Master Jury selected seven award recipients. Notable among the recipients are the Sandbag Shelter Prototypes, developed by Nader Khalili to enable victims of natural disasters and war to build their own shelter using earth-filled sandbags and barbed wire. The resulting structures – made up of arches, domes and vaulted spaces built using superadobe techniques – provide earthquake resistance, shelter from hurricanes and flood resistance, while being aesthetically pleasing.\nOther winning projects include a primary school in Gando, Burkina Faso, that combines high-caliber architectural design with local materials, techniques and community participation. The Bibliotheca Alexandria in Egypt and the Petronas Towers in Malaysia are examples of high-profile landmark buildings.\nAward recipients:\n*Bibliotheca Alexandrina, Alexandria, Egypt, by Norwegian architectural office Snøhetta\n*Primary School, Gando, Burkina Faso, by Diébédo Francis Kéré\n*Sandbag Shelter Prototypes (various locations), developed by Nader Khalili\n*Restoration of Al-Abbas Mosque (Asnaf, Yemen)\n*Old City of Jerusalem Revitalisation Programme, Jerusalem\n*B2 House, Ayvacik, Turkey, by Han Tümertekin\n*Petronas Towers, Kuala Lumpur, Malaysia, by César Pelli\nFile:Petronas Panorama II.jpg|Petronas Towers, Kuala Lumpur\nFile:Flickr - DVIDSHUB - New eco-dome signals changes for local village (Image 10 of 10).jpg|Eco-Dome sandbag shelter under construction in Djibouti\nFile:Alexandrina Front view.jpg|Bibliotheca Alexandrina\nFile:Gando-School-Burkina-Faso.JPG|Primary School in Gando\nFile:Old city of Jerusalem.jpg|Old city of Jerusalem\nFile:View on Petronas Towers.JPG|Petronas Towers within Kuala Lumpur cityscape\nTenth (2005–2007)\nThe 2007 Award Presentation Ceremony was held at the Petronas Towers in Kuala Lumpur, Malaysia.\nThis cycle marked the 30th anniversary of the award. A total of 343 projects were presented for consideration, and 27 were reviewed on site by international experts.\nThe award recipients were:\n*Samir Kassir Square, Beirut, Lebanon\n*Rehabilitation of the City of Shibam, Yemen\n*Central Market, Koudougou, Burkina Faso\n*University of Technology Petronas, Bandar Seri Iskandar, Malaysia, by Foster + Partners\n*Restoration of the Amiriya Madrasa, Rada, Yemen\n*Moulmein Rise Residential Tower, Singapore, by WOHA Architects\n*Royal Netherlands Embassy, Addis Ababa, Ethiopia, by Dick Van Gameren, Bjarne Mastenbroek\n*Rehabilitation of the Walled City, Nicosia, Cyprus\n*METI School in Rudrapur, Dinajpur, Bangladesh, by Anna Heringer\nFile:Shibam Wadi Hadhramaut Yemen.jpg|Shibam\nFile:Utphishot.JPG|University of Technology Petronas\nFile:Jennifer Bryson in Yemen.jpg|Amiriya Madrasa\nFile:Embaixada da Holanda na Etiópia 1.jpg|Royal Netherlands Embassy, Addis Ababa\nFile:Nicosia Buyuk Han 02.jpg|Büyük Han, Nicosia\nEleventh (2008–2010)\nThe 2010 Award Presentation Ceremony was held at the Museum of Islamic Art, Doha, Qatar. A total of 401 projects were nominated of which 19 were shortlisted.\nThe Chairman's Award went to Oleg Grabar.\nThe award recipients were:\n* Wadi Hanifa Wetlands Project, Riyadh, Saudi Arabia\n*Revitalisation of nineteenth and early twentieth-century architectural heritage of Tunis, Tunisia\n*Research Centre and Museum, Madinat Al-Zahra, Cordoba, Spain, by Nieto Sobejano Arquitectos\n*Ipekyol Textile Factory, Edirne, Turkey\n*Bridge School, Xiashi, Fujian, China\nFile:Wadi Hanifa from King Fahd Rd.jpg|Wadi Hanifa\nFile:അൽ എൽബ് അണക്കെട്ട്.JPG|Al Elb Dam, Wadi Hanifa\nFile:Cathedral of St. Vincent de Paul.jpg|Cathedral of St. Vincent de Paul, Tunis, 1897\nFile:Theatre Municipal de Tunis.jpg|Municipal Theatre, Tunis, by Jean Emile Resplandy, 1902\nFile:Centro de interpretación de Madinat Al-Zahra (Córdoba, Spain).jpg|Madinat Al-Zahra, Spain\nFile:Centro de interpretación de Madinat Al-Zahra (Córdoba, España).jpg|Madinat Al-Zahra, Spain\nTwelfth (2011–2013)\nThe 2013 Award ceremony was held at the Castle of São Jorge in Lisbon, Portugal in September 2013.\nThe winning projects are:\n* Emergency Salam Centre for Cardiac Surgery, Khartoum, Sudan, by Italian practice Studio Tamassociati, completed in 2010\n*Revitalisation of Birzeit Historic Centre, Birzeit, Palestine\n*Hassan II Bridge (Rabat-Salé Infrastructure Project, Rabat and Salé, Morocco\n*Rehabilitation of Tabriz Bazaar, Tabriz, Iran\n* Islamic Cemetery, Altach, Austria, by Austrian architect Bernardo Bader, inaugurated in 2012\nFile:Carpet Bazaar of Tabriz.JPG|Tabriz Bazaar\nFile:Muslimischer Friedhof, Robert-Koch-Straße 18 a, Altach 04.JPG|Islamic Cemetery, Altach\nThirteenth (2014–2016)\nThe 2016 Award ceremony for the six winners was held in Al-Ain, UAE on 6 November 2016:\n* Bait Ur Rouf Mosque in Uttara, Dhaka, Bangladesh by Marina Tabassum\n* Friendship Centre in Gaibandha, Bangladesh by Kashef Mahboob Chowdhury / URBANA\n* Hutong Children's Library and Art Centre in Beijing China, by ZAO/standardarchitecture and Zhang Ke\n* Superkilen in Copenhagen, Denmark by Bjarke Ingels Group, Topotek 1, and Superflex\n* Tabiat Pedestrian Bridge in Tehran, Iran by Diba Tensile Architecture / Leila Araghian and Alireza Behzadi\n* Issam Fares Institute in Beirut, Lebanon by Zaha Hadid Architects\nFile:Superkilen hill-top view.jpg|Superkilen, Copenhagen\nFile:Friendship Centre Gaibandha, December 2016 04.jpg|Friendship Centre\nFile:Bait Ur Rouf mosque corridor.jpg|Baitur Rauf Jame Mosque\nFile:TabiatPedestrianBridge.jpg|Tabiat Bridge, Tehran\nFourteenth (2017–2019)\nThe 2019 Award ceremony was held on 13 September 2019 in Kazan, Tatarstan, Russia:\n* Revitalization of Muharraq in Muharraq, Bahrain\n* Arcadia Education Project in South Kanarchor, Bangladesh\n* The Palestinian Museum in Birzeit, West Bank\n* Public Spaces Development Programme in Kazan, Republic of Tatarstan, Russia\n* Alioune Diop University Teaching and Research Unit in Bambey, Senegal, by IDOM\n* Wasit Wetland Centre in Sharjah, United Arab Emirates\nFile:Arcadia inteza3.jpg|Arcadia Education Centre, South Kanarchor, Bangladesh\nFile:Wasit Wetland Centre.jpg|Wasit Wetland Centre, Sharjah, UAE\nFifteenth (2020–2022)\nThe 2022 Award ceremony was held on 31 October 2022 in Muscat, Oman:\n* Urban River Spaces in Jhenaidah, Bangladesh\n* Community Spaces in Rohingya Refugee Response in Cox’s Bazar, Bangladesh\n* Banyuwangi International Airport, Blimbingsari in East Java, Indonesia\n* Argo Contemporary Art Museum and Cultural Centre in Tehran, Iran\n* Renovation of Niemeyer Guest House in Tripoli, Lebanon\n* Kamanar Secondary School in Thionck Essyl, Senegal\nSixteenth (2023–2025)\nThe award ceremony was held in Bishkek, Kyrgyzstan on 15 September 2025. The winners were announced on 2 September 2025:\n* Khudi Bari, in various locations in Bangladesh, by Marina Tabassum Architects\n* West Wusutu Village Community Centre, in Hohhot, China, by Inner Mongolian Grand Architecture Design Co. Ltd / Zhang Pengju\n* Revitalisation of Historic Esna in Egypt, by Takween Integrated Community Development\n* Majara Residence and Community Redevelopment, in Hormuz Island, Iran by ZAV Architects\n* Jahad Metro Plaza, in Tehran, Iran by KA Architecture Studio\n* Vision Pakistan, in Islamabad, Pakistan, by DB Studios\n* Wonder Cabinet, in Bethlehem, Palestine by AAU Anastas\nSee also\n*Aga Khan Historic Cities Support Programme, another architectural initiative of the Aga Khan Trust for Culture.\n*Islamic architecture\n*List of architecture prizes\nReferences\nSources\n*\n*\n*\n*\n* [http://www.saudiaramcoworld.com/issue/198906/better.by.design.htm Gerry Loughran, Better by design, 1989, Saudi Aramco World]\nFurther reading\n*\n*\n*\nExternal links\n*"
    }
  ]
}