{
  "content": [
    {
      "type": "text",
      "text": "# Agat World War II Amtrac\n\noff Ga'an Point, near Agat, Guam\n| added     = December 13, 2011\n| area      = less than one acre\n| mpsub     =\n| refnum    = 11000880\n}}\nThe Agat World War II Amtrac is an underwater relic of World War II, located off Ga'an Point in Agat Bay on the west side of the island of Guam.  It is the remains of an LVT 4, an amphibious tracked landing vehicle.  It is located about  off Agat Invasion Beach in  of water, and was described as being in good condition when it was discovered and surveyed in 1985.  These vehicles were used during the 1944 Battle of Guam, in which American forces recaptured the island from occupying Japanese forces.  This particular vehicle does not appear to exhibit significant war damage. This is the most intact of the three Amtracks remaining on Guam from the 850 that participated in the battle. It was re-surveyed by maritime archaeological field schools conducted from 2009 to 2012.\nIt is administratively part of the Agat Unit of War in the Pacific National Historical Park. The Amtrac is the occasional topic of National Park Service ranger presentations. The submerged wreck was listed on the National Register of Historic Places in 2011.\nDive site\n| average_visibility  =\n| entry_type          = Boat/shore\n| bottom_composition  = Sand, coral\n| water               = Salt\n| nearby_sites        =\n}}\nThe site is well known to local recreational divers, who referred to the location as Amtrak. Located in a sandy bottom at about , it surrounded by large corals heads amid surge channels. The reef supports many types of coral reef fish, such as tangs and clownfish, as well as many smaller creatures. There are also free swimming pelagic fish. A nearby sewage outfall may be problematic depending on the direction of the current.\nDive boats will typically anchor directly at the Amtrak, allowing divers to explore the large sand pits surrounded by coral formations. Shore divers typically enter at the empty northern corner of the new Agat Cemetery, giving the dive a second name of Agat Cemetery. Divers are cautioned to be respectful of the fact that they are in an actively used cemetery. After walking out along the pipeline and swimming out to a drop down spot, divers follow the sandy channel on a due west compass heading to the Amtrak. The return route can vary to view sea anemone beds along the coral pillars or ascend to the top of the reef flat at about  to spot cleaning stations. This location is the focus of periodic International Coastal Cleanup dives, as trash from  the nearby Salinas River is swept into the channels.\nSee also\n* National Register of Historic Places listings in Guam\n* Underwater diving on Guam\nReferences"
    }
  ]
}