{
  "content": [
    {
      "type": "text",
      "text": "# Age of Empires: The Rise of Rome\n\n| genre = Real-time strategy\n| modes = Single-player, multiplayer\n}}\nAge of Empires: The Rise of Rome is a 1998 expansion pack for the 1997 real-time strategy video game Age of Empires, developed by Ensemble Studios for Windows and published by Microsoft.\nThe expansion adds four new playable civilizations, including the Romans, as well as new units, map types and minor improvements to the game. Development of The Rise of Rome was prompted by delays to the creation of a sequel, Age of Empires II: The Age of Kings, leading to Ensemble Studios creating an expansion to maintain sales of the original game.\nUpon release, The Rise of Rome was commercially successful and received positive reviews from critics, with praise directed to the expansion's inclusion of features and gameplay mechanics beyond the expected addition of new maps. Reviewers later expressed that the expansion set the standard for the sequel to Age of Empires II, The Conquerors, released in 2000.\nGameplay\n.]]\nThe Rise of Rome is an expansion to Age of Empires, a real-time strategy title in which players build and develop a civilization and conquer competing empires. The core gameplay of Age of Empires involves gathering resources to construct buildings, recruiting units, and develop technologies to progress through Ages that unlocks stronger units, new abilities, and more efficient resource gathering. The Rise of Rome introduces four new playable civilizations: Rome, Carthage, Palmyra, and Macedonia. Five new units are introduced, including slingers, camel riders, scythe chariots, armored elephants, and fire galleys. New technologies also introduce new game abilities. These include Martyrdom, allowing players to sacrifice a priest to convert enemy units, and Logistics, allowing units recruited from the barracks to count only as half a unit under the population limit, providing the player with the ability to recruit more units. New map types and sizes are also introduced for custom games, including mountainous highlands, large islands, and peninsulas. Rise of Rome adds minor gameplay changes, including the ability for players to queue the production of units, and select a group of units of the same type by double-clicking the cursor. The population limit for recruiting units is also adjustable to up to 200 in multiplayer games.\nThe Rise of Rome introduces four new campaigns to Age of Empires over nineteen scenarios, focusing on the history of ancient Rome, charting the period between Rome's history as a city-state to the start of the Roman Empire. The four campaigns imitate historical events including the birth or Rome and the Pyrrhic War, the career of Julius Caesar and his military campaigns, the War of Actium and creation of the Roman Empire, and battles against enemies such as Spartacus and Hannibal the Great.\nDevelopment and release\nThe Rise of Rome was created by the Age of Empires development team at Ensemble Studios, with design led by Sandy Petersen, a scenario designer from the original game. The expansion was conceived to provide the studio with additional time to complete the development of the game's sequel, Age of Empires II: The Age of Kings, delayed from its originally planned release in 1998. According to designer Bruce Shelley, the development team opted to delay the release of the sequel and developed The Rise of Rome in the interim to maintain commercial interest in the original title. Studio co-founder Tony Goodman stated that the proposed expansion was pitched to Microsoft and accepted on the basis of the original title's commercial success. Shelley stated the expansion's focus on Rome was chosen to bridge the early ancient setting of the original game and the medieval setting of its planned successor. A goal of the expansion was to implement \"small but significant\" adjustments based on player feedback to improve the balance of the game and reduce the gameplay emphasis on rushing to the next age.\nThe Rise of Rome was published by Microsoft for release in the United States on 29 October 1998, and in the United Kingdom and Europe on 6 November 1998. To promote the game, Microsoft held an online tournament of the game on MSN Gaming Zone over November to December 1998, with the winner receiving a cash prize and trip to Rome at the final held in Seattle. A demo containing three missions was also made available to promote the game. In 2001, The Rise of Rome was packaged with the original game as the ''Age of Empires: Collector's Edition''. Shelley remarked that the expansion's strength demonstrated how an expansion release could \"extend the life of a game and keep the experience fresh\", and used to inform the design of Age of Empires II: The Conquerors. Goodman stated that the success of Rise of Rome convinced Microsoft to pursue expansion packs for other products.\nReturn of Rome\nOn 16 May 2023, Return of Rome, an expansion pack for the high-definition remake Age of Empires II: Definitive Edition, was developed by Forgotten Empires and Tantalus Media and published by Xbox Game Studios. The ancient-themed expansion integrates the four civilizations from Rise of Rome, the twelve from the original game, and a new civilization, the Lạc Việt, and features three campaigns based on the Sumerians, the Macedonians and the Romans.\nReception\nSales\nThe Rise of Rome was a commercial success. Global sales estimates have varied between 800,000 and 1.2 million units by the early 2000s. The expansion entered second place behind Microsoft Combat Flight Simulator on ELSPA monthly sales charts for computer games in the UK in January 1999. Shelley considered that Rise of Rome to be a commercial success, with Goodman remarking that the expansion was \"the most profitable game that Microsoft had ever published\".\nReviews\n| GPPCG = B+\n| CGW =\n| GamePro = 3.5/5\n| GSpot = 7.4\n| Hyper = 82%\n| PCPP = 90%\n| PCZone = 83%\n| rev1 = GameWeek\n| rev1Score = A−\n}}\nThe Rise of Rome received positive reviews from critics, with reviewers generally considering the expansion's additions to the game worthwhile. Many critics also commended the game for adding quality of life improvements that made gameplay easier to handle. It was declared the 1998 'Add-On of the Year' by Computer Games Online and Computer Games Strategy Plus, and nominated as a runner-up for the 'Best Mission Pack' of 1999 by PC PowerPlay.\nThe additions to the core gameplay were praised. Ken Brown of Computer Gaming World wrote that the new civilizations and units generally added \"interesting counters\" to those in the original game, although he found the Romans to be weaker than expected. Jason Rich of Game Week similarly stated that the expansion expanded the overall strategy of the original and provided players with \"added control and more capabilities\". Elliott Chin of GameSpot, meanwhile, observed that whilst the units and technologies \"have their uses\" and responded to balance problems, they were \"highly specialized or expensive to research\" and \"impotent\" outside of that context. Joel Strauch felt that the new technologies added a \"whole new layer to gameplay\".\nThe missions were also generally praised, although their difficulty was noted. March Stepnik of PC PowerPlay commended the \"formidable challenge\" of the missions, the inclusion of historical figures, and the balance of offensive and defensive missions. Ultimate PC noted the campaigns had a high difficulty level and were \"far harder\" than those in the original game. Elliott Chin of GameSpot found the campaigns to have \"interesting premises\", but considered them to be \"unusually short\", lacking end cutscenes and featuring objectives with \"tedious\" difficulty.\nRetrospective reception\nThe Rise of Rome received retrospective praise by critics during the release of its successor's expansion pack Age of Empires II: The Conquerors. March Stepnik of PC Powerplay felt the expansion was \"exemplary\", highlighting the \"well-conceived\" new missions and \"significant\" gameplay enhancements. Stepnik considered The Rise of Rome to be an expansion that went \"above the call of duty\" to enhance the original game. Cindy Vanous of Computer Games described it as an \"excellent follow-up\" that improved the gameplay mechanics and added new content. Chris Lombardi of Computer Gaming World also considered The Rise of Rome to be a \"massive improvement over its predecessor\". Describing the expansion as a \"complete overhaul\" of the original game, Laurence Scotford of PC Zone stated that The Rise of Rome \"set the pace for expansion disks to come\". A retrospective review by Kotaku writer Ash Parrish focused upon the difficulty of the expansion's missions, citing their difficulty in successfully completing the mission Metaurus.\nAcademic reception\nRise of Rome has received commentary from historians for its depiction of Roman history. In an analysis of the campaign depicting Julius Caesar's revenge on the Cilician pirates, Maria Wyke noted that the game's representation did not take an \"ethical or moral dimension\" to Caesar's capture and revenge, but instead used the game's strategy mechanics to reinforce the player's \"sense of their own power to shape events\" of Roman history, reinforced through flavor text that imitates \"masculinity, Roman history and Julius Caesar's youthful escapade\". In an overview of how Rise of Rome portrays historical events, historian Alexander Flegler critiqued the anachronism of the game's ages as inconsistent with their depiction of historical events, such as scenarios depicting the Battle of Actium and the Year of the Four Emperors beginning in the \"Stone Age\", while suggesting the ages were abstract representations of gameplay progress rather than depictions of \"actual historical epochs\".\nReferences\nExternal links\n*"
    }
  ]
}