{
  "content": [
    {
      "type": "text",
      "text": "# Agriculture in Arizona\n\nin the world, and the biggest date plantation as well. In 2016, the state produced about  of pecans and earned about $55 million in revenue.]]\nAgriculture in Arizona is a notable sector in the state's economy, contributing more than $23.3 billion in 2018. Arizona's diverse climate allows it to export all sorts of commodities such as nuts, wheat, cotton, eggs, meat, and dairy to the United States and 70 other countries. In 2018, the state produced  of red meat and ranked 3rd in producing vegetables in the United States, occupying  of land for farms and ranches combined.\nDue to Arizona's four deserts and very low rainfall, the agricultural sector acquires its water from the state's rivers and streams that include the Colorado, Verde, Salt, Gila, San Pedro, Santa Cruz and Little Colorado Rivers.\nHistory\nHistory Pre 1850\nArizona contains the most extended continually farmed land in the United States. Research done on soil and pollen east of the Grand canyon in the Comanche and Nankoweap sites suggest that early Archaic people lived and farmed on these sites for at least a thousands years. Remnants of crops indicate that corn and cotton may have been grown on the sites. The first proven farms in what is now Arizona, were patches of maize planted by foragers in the floodplains of the Gila River. This area supported many civilizations like the Hohokam and Mogollon. These cultures planted maize, squash, cotton, and beans. In the 1600s, the Spanish had brought cattle to the New World that later in the century amounted in the hundreds of thousands, eventually making their way to Arizona over time.\nHistory since 1850\nA large portion of cattle were moved through Arizona en route to California in the 1850s. Permanent herds were not present until the Civil War.\nDuring the Civil War era in Arizona, Native American Pima and Maricopa tribes would grow crops such as wheat, corn, beans, melons, and pumpkins by the millions of pounds due to newly acquired technology. When the Union and Confederate armies made their way to Arizona, relations with the tribes were mostly business related, with the tribes selling their crops (mostly wheat) to the armies. When the Union took control of Arizona, flour mills and granaries were built and used wheat bought from the tribes. After the war, settlers saw the potential Arizona had to sustain agriculture and began to move in. As for the tribes, though they had profited from the sales of their crops, the new industry had negatively affected them as settlers would move a little too close to their reservations and use their resources.\nNatives had already mastered the art of farming, but in the late 19th century, white settlers struggled to adapt their farming practices to the arid climate. In more recent times, the University of Arizona Agricultural Experiment Station provided settlers with ways to adapt and increase crop yield. This helped turn the University of Arizona into the center of Agriculture for the American Southwest.\nIrrigation and water rights shaped the development of the industry in the 20th century. Notably, Arizona v. California (1962) resulted in the US Supreme Court ruling that Arizonian farmers could draw water from Colorado River tributaries without federal regulation. This caused a boom in agricultural output. However, concerns about sustainability remain.\nNotable crops\n]]\nLeafy greens\nContributing $2 billion to Arizona's economy in 2015, the state ranks second in the production of leafy greens such as lettuce and spinach. In 2007, producers created the Arizona Leafy greens program assuring that greens produced with the program are produced with food safety in mind by using strict protocols. The program has since set a higher standard and good model for food safety that allowed other commodities and states to follow. Yuma is known as the  \"Winter Lettuce Capital of the World\" due to the county's very high production of lettuce during the winter season having 90% sunshine year-round, rich soil, and the Colorado river. Leafy greens are also produced in Maricopa county.\nGrapes\nWith Arizona not receiving much rainfall, grapes can still be grown in  as they don't require much water. Most if not all grapes are then used to produce wine, as  of it was produced in 2015, with the market valued at $25 million. Grape vineyards can be found in Cochise, Santa Cruz, and Yavapai counties.\n|alt=Pecan trees in Fort McDowell Yavapai Nation, Maricopa County]]\nPecans\nPecans are a staple in Arizona's agricultural industry, having the biggest pecan grove in the globe spanning some . Pecans are grown on , with  of them on the way in the next few years. In 2016,  of pecans were produced and made $55 million in revenue. Pecan trees can be found in Cochise, Gila, Graham, Greenlee, Maricopa, Mohave, Pima, Pinal, and Yavapai counties.\nCotton\nA great history of cotton exists in Arizona, but its greatest development came later on with Egyptian cotton (Gossypium barbadense), later called Pima cotton, that is stronger than short-staple cotton and still as soft. Every year, the cotton industry earns the state $400–500 million and creates 3,000 new jobs. Cotton is such a valuable and diverse plant that even its seed, stalk, and lint have uses, earning its place as one of Arizona's \"5 C's.\" Cotton is grown in Cochise, Graham, Greenlee, La Paz, Maricopa, Mohave, Pima, Pinal and Yuma counties.\nWheat\nFor more than 100 years, wheat has been a large commodity in Arizona. Grown by the Pima and Maricopa tribes during the Civil war, Native Americans would sell wheat to soldiers who later constructed granaries for it, resulting in its bigger industry today. Wheat produces  and earns the state $200–350 million annually. Wheat is grown in Cochise, Graham, La Paz, Maricopa, Pima, Pinal and Yuma counties.\ns of fruits]]\nDates\nArizona ranks second in the production of dates (Phoenix dactylifera), and the biggest date plantation in the globe is found in the state. Dates can be harvested in the months of September and October. Dates have a unique history in the state, as they are originally from the Middle East and North Africa, but were brought to North America by Spanish conquistadors and eventually made their way to Arizona.\nOther commodities\nEggs\nArizona's commercial egg industry began in Nell Hickman's home not too long ago in 1944, and has since grown to sell 360 million dozens of eggs in the state annually. Egg facilities today use automated machinery to reduce human interaction and hasten the process of packaging, allowing eggs to go from farm to plate in less than a day.\nDairy\nIn 1922, Shamrock Farms was opened, making agriculture a notable sector in the states economy. In 1960, the  was founded to provide a sustainable supply of dairy products and fresh milk for consumers at the best quality. With the help of modern technology, the UDA's Tempe facility runs 24/7, allowing  of milk to be processed daily. The state has more than 205,000 cows for dairy, produces  of milk annually, and takes 2 days to get milk from the farm to a store. The dairy industry operates in Cochise, Gila, Greenlee, La Paz, Maricopa, Navajo, Pinal, Yavapai and Yuma counties.\nLivestock\nOut of 20,005 ranches and farms in Arizona, cattle is raised on more than 30% of them. In 2015, Arizona's cattle industry allowed ranchers to produce 1.4 billion beef meals and feed 8 million people, and in 2018, the state was able to produce  of red meat. The economic impact contributed by the sale of beef is worth around $521 million. Arizona's cattle industry operates year-round and can be found in every county all over the state.\nPast and Modern practices\nPre-colonization Agricultural Practices\nPrehistoric indigenous cultures planted crops along the floodplains of the Gila River. Among these, the Hohokam settlement of Snaketown was the first to use canals to irrigate. These canals diverted water from the Gila River a few miles upstream from Snaketown and brought it to the crops outside the settlement. The advent of pottery enabled these cultures to store food for longer periods of time, increasing agricultural efficiency.\nModern Agricultural Practices\nArizona is blessed with many rivers, streams, and tributaries so irrigation is still a major practice today. Water rights are divided among different municipalities. Great care is taken to ensure that water is not wasted. This coordination is facilitated by the . The majority of large scale growers today practice conservation agriculture, which includes reduced tillage, intensive tillage, cover cropping, manure application, and commercial fertilizer application.\nResource use\nBecause of its large deserts, population growth, and ongoing drought, concerns over energy and water use in Arizona increase every year. In response, heads from all over the private sector and government have taken action to sustain the state's water supply. This isn't the first time Arizona has had issues with water, as seen in the Arizona v. California Supreme Court case in 1952 that disputed water use from the Colorado River's lower basin. The use of energy and water go hand in hand as a large portion of the state's available energy is used for irrigation with Arizona being a desert state.\n, one of the main water supplies]]\nWater use\nDue to the arid climate, 70% of Arizona's water consumption is used for agriculture with some crops in using about , but with the help of today's technology, farmers are able to use only what they need and water that isn't used goes back into rivers or storage. As an example on just how much water is needed, an average head of cabbage uses around .\n{| class=\"wikitable\"\n|+Total water use for 13 crops\n!crop\n!Acre feet (m3) high\n!Acre feet (m3) low\n|-\n|Broccoli\n|\n|\n|-\n|Cabbage\n|\n|\n|-\n|Cantaloupes\n|\n|\n|-\n|Cauliflower\n|\n|\n|-\n|Chiles Peppers\n|\n|\n|-\n|Dry Onions\n|\n|\n|-\n|Head Lettuce\n|\n|\n|-\n|Honeydews\n|\n|\n|-\n|Leaf Lettuce\n|\n|\n|-\n|Potato\n|\n|\n|-\n|Romaine\n|\n|\n|-\n|Spinach\n|\n|\n|-\n|Watermelons\n|\n|\n|-\n|Total\n|\n|\n|}\nEnergy use\nThe energy required to grow crops in Arizona can reach a maximum range of about . To put into perspective, this amount of energy is the same as  of gasoline. Taking cabbage as an example again, to grow  of it requires about  of diesel fuel to operate farm machinery.\n{| class=\"wikitable\"\n|+\n!Crop\n!Acres (ha)\n!Diesel gallons (L)\n|-\n|Broccoli\n|\n|\n|-\n|Cabbage\n|\n|\n|-\n|Cantaloupes\n|\n|\n|-\n|Cauliflower\n|\n|\n|-\n|Chile Peppers\n|\n|\n|-\n|Dry Onions\n|\n|\n|-\n|Head Lettuce\n|\n|\n|-\n|Honeydews\n|\n|\n|-\n|Leaf Lettuce\n|\n|\n|-\n|Potato\n|\n|\n|-\n|Romaine\n|\n|\n|-\n|Spinach\n|\n|\n|-\n|Watermelons\n|\n|\n|}\nReferences"
    }
  ]
}