{
  "content": [
    {
      "type": "text",
      "text": "# Agriculture in Poland__disambig_1\n\n'''Poland's agricultural sector''' is vital for European and Global market because it produces a variety of agricultural, horticultural and animal origin products. The surface area of agricultural land in Poland is 15.4 million ha, which constitutes 50% of the total area of the country.\nAgriculture in Poland has always been an important part of the country's economy. Out of the  of agricultural land (about 60 percent of Poland's total area),  were used for crop cultivation,  for orchards, and about  for meadows and pastures in 1989. In most areas, the soil and climatic conditions supported a mixed type of farming.\nProduction\nPoland produced in 2018:\n*  of sugar beet (6th largest producer in the world), which serves to produce sugar and ethanol;\n*  of wheat (17th largest producer in the world);\n*  of potato (9th largest producer in the world);\n*  of triticale (largest producer in the world);\n*  of apple (3rd largest producer in the world, behind China and USA);\n*  of maize/corn;\n*  of barley (14th largest producer in the world);\n*  of rapeseed (8th largest producer in the world);\n*  of rye (2nd largest producer in the world, just behind Germany);\n*  of oats (5th largest producer in the world);\n*  of cabbage;\n*  of tomatoes;\n*  of carrot;\n*  of onion;\n*  of cucumber;\n*  of cauliflower and broccoli;\n*  of strawberry (7th largest producer in the world);\n*  of mushroom and truffle;\n*  of pepper;\n*  of currant (2nd largest producer in the world);\n*  of lupin;\n*  of plum;\n*  of raspberry (4th largest producer in the world);\n*  of cherry (11th largest producer in the world);\nIn addition to smaller productions of other agricultural products.\nTypes of farming\nIn 1989 Poland was the second-largest producer of rye and potatoes in the world. The latter were used as vegetables, as fodder for pigs, and in the production of industrial starch and alcohol. The country occupied sixth place in the world in sugar-beet, milk, and pig production. The quantity and quality of agricultural land ensured self-sufficiency and made considerable quantities of various agricultural products and processed foodstuffs available for export.\nIn 1990 grain production dominated Polish agriculture: the highest yields came from:\n* wheat\n* rye\n* barley\n* oats\nOther major crops included potatoes, sugar beet, fodder crops, flax, hops, tobacco, and fruits. Cultivation of corn (maize) expanded during the 1980s but remained limited. The northern and east-central regions of the country mainly offered poorer sandy soils suitable for rye and potatoes.\nThe richer soils of the central and southern parts of the country, excluding those at higher elevations, made those regions the centers of wheat, sugar beet, hops, and tobacco production. The more accessible land at higher elevations was used to cultivate oats or was left as meadow and pastureland. In 1989 almost half of Poland's arable land was used for the cultivation of the four major grains, another 13 percent grew potatoes, All regions of Poland raised dairy cows, beef cattle, pigs and poultry, and cultivated fruit, usually as an integral part of mixed farming.\nImport/Export proportions\nIn 1990 Poland exported 26 percent of the bacon it produced, as well as 63 percent of the ham, 16 percent of the tinned meat, 10 percent of the poultry, 17 percent of the sugar, and 67 percent of the frozen fruits and vegetables.\nOrganization under state planning\nBeginning with de-collectivization in 1956, Poland was the only member of Comecon where the private sector predominated in agriculture. The state maintained indirect control, however, through the state agencies that distributed needed input materials and purchased agricultural produce. Compulsory delivery quotas were maintained for farms until the beginning of the 1970s. The state also retained significant influence on the process of cultivation, restrictions on the size of farms, and limitations on the buying and selling of land. Until the beginning of the 1980s, the allocation system for fertilizers, machines, building materials, fuels, and other inputs discriminated severely against private farmers. As a result of these policies, private farms remained inefficiently small and labor-intensive.\nPrivate and state farms\nIn 1987 about 2.7 million private farms were in operation. About 57 percent of these were smaller than . Of the remaining farms, 25 percent were between  and 11 percent were between . Only 7 percent of private farms were larger than . Whereas the majority of the private farms were below optimum size, the majority of state farms were excessively large. Only 12 percent of the latter farms were below , and 60 percent were larger than .\nIn 1989 the private sector cultivated 76.2 percent of arable land and provided 79 percent of gross agricultural production. State farms, the main institutional form in state ownership, cultivated 18.8 percent of the total arable land and produced 17.0 percent of gross output. Cooperative farms, the dominant form of state agricultural organization in other East European economies, were not important in Poland. In 1989 they cultivated only 3.8 percent of arable land and contributed 3.9 percent of gross production.\nIn the 1980s, grain yields and meat output per hectare/per acre were higher in the socialist sector than in the private sector. An important factor in this difference was the more intensive use of fertilizers in state farms. On the other hand, the milk yield per cow was higher in the private sector. From the standpoint of overall performance, the private sector was less material and capital-intensive, and gross production per hectare/acre and the value of product per unit of cost were higher in that sector. Besides being more efficient, private farms were also more flexible in adjusting production to obtain a higher product value.\nPostcommunist restructuring\nBecause of the predominance of private farms in communist Poland, privatization of agriculture was not a major necessity during the reform period, as it was in the other postcommunist countries. Excessively large state farms were to be split into more efficient units and sold; some state farms would be converted into modern agrobusinesses operating as limited stock companies; and a certain number were to be retained as state experimental farms. In all cases, however, rapid modernization and improvement in agrotechnology were urgent requirements.\nThe streamlining of agriculture faced serious obstacles in the early 1990s, notably because of the existing agrarian structure. Private farm size had to increase to provide farmers a satisfactory level of income and investment. Drastic reduction in the agricultural labor force was also needed. Because unemployment outside agriculture rose in 1991 and 1992, however, only gradual reductions were possible. A satisfactory social safety net and retraining programs for displaced agricultural workers were prerequisites for further reductions in labor. Experts estimated that unemployment on former state farms would reach 70 to 80 percent, meaning about 400,000 lost jobs, once the farms were privatized and streamlined.\nConsiderable investment is needed to provide adequate agricultural infrastructure, including road improvement, telecommunications, water supply, housing, and amenities. Especially important is establishment of a well-developed, competitive network of suppliers of materials and equipment necessary for modern agricultural production. Equally necessary are commercial firms to purchase agricultural products and provide transportation and storage facilities. In particular, expansion and modernization of the food-processing industry are necessary to strengthen and stabilize demand for agricultural products. The first postcommunist governments prepared agricultural modernization programs, and some financial help was obtained from the World Bank and Western governments for this purpose. Modernization was expected to require several decades, however.\nBy 1992 nearly all the 3,000 remaining state farms had substantial unpaid bank loans and other liabilities. For this reason, and because the government had not devised usable privatization plans at that point, the Farm Ownership Agency of the State Treasury was authorized to take over all the state farms in 1992. The agency was authorized to lease state farm lands to either Polish or foreign renters, as a temporary measure to ensure continued productivity.\nPolish agriculture and EU\nPoland as part of the European Union is subject to the CAP. Poland is one of the countries with the most subsidy-efficient farms and least reliant on them for investment.\nClimate change\nPests\nBy pest\nFusarium\nThe Luxembourg Microbial Culture Collection's European Fusarium Database has information on Fusarium spp. found in the country by sample date, species, chemotype, and host (and previous crop if known).\nMycobacterium bovis\nKrajewska-Wędzina et al., 2020 developed an assay to diagnose an M. bovis outbreak in alpacas in the country.\n|\n}}\nThey also were first to show that alpacas counterattack M. bovis earlier than most hosts, even though the response is not always ultimately successful and M. bovis may still be fatal. This is believed to generalise to all camelids.\nBy host\nWheat\nRusts\nEpidemics are a normal occurrence, along with the rest of Europe. From 1925 to October '65 losses were 14% across the whole country, or  per annum.\nBlack/Stem\nRusts cannot overwinter in the country due to the climate. In the epidemics of the 1960s the source of overwintering inoculum was believed to be in the plains of the lower Danube, carried on the wind through Poland and Ukraine as the year went on, and into Scandinavia.\nWheat brown/Brown\nSource of the wheat leaf rust/wheat brown rust '58, '59, '61 epidemics unknown.\nYellow/Stripe/Yellow stripe\nThe '61 epidemic was part of a larger European epidemic, and was due to favorable weather inducing localised buildup and transmission, not long distance transmission.\nBy year\n*1932: Severe black rust epidemic originating from the south and southeast. Some regions suffered 5%, and some local areas as high as 100%.\n*1958: Mild epidemic of brown rust. Losses between 30-50% for some regions, but only 2% for Poland overall.\n*1959: Mild epidemic of brown rust. Losses between 30-50% for some regions.\n*1961: Mild epidemic of brown rust. Generalized European epidemic of Yellow Rust, including this country.\nInspection\nOn 28 February 2022 the Chief Inspector (GIORiN) ordered the  (PIORiN) to indefinitely suspend some inspections. Until further notice the GIORiN ordered no inspections or phytosanitary certificates be required at the Poland–Ukraine border for foods which are:\n*Small in quantity\n*For personal consumption\n*Plant-based\nAdditionally the GIORiN ordered that any problems with this policy be resolved as quickly as possible and requested the European Commission implement the same policy at all parts of the EU border with Ukraine.\nSee also\n*Collectivization in Poland\nReferences\n*[http://countrystudies.us/poland/ Country studies]"
    }
  ]
}