{
  "content": [
    {
      "type": "text",
      "text": "# Ahalia Health Heritage and Knowledge Village\n\n}}\nThe Ahalia Health Heritage and Knowledge Village, managed by the Ahalia International Foundation, is one of the largest edu-health campus in Kerala, India.  It is headquartered in the city of Palakkad. The organization, which started as an eye hospital in 2005, now has more than 11 regional eye care branches all over the state.\nThe Ahalia  Health Heritage and Knowledge Village is an integrated campus in Kerala consisting of Ahalia foundation eye Hospital, Ahalia diabetes hospital, Ahalia ayurveda medical college and hospital, Ahalia women & children’s hospital, and several educational establishments such as Ahalia school of management, Ahalia school of engineering and technology, Ahalia school of pharmacy, Ahalia school of optometry, Ahalia school of paramedical sciences and Ahalia public school. The Indian Institute of Technology (IIT) has also located at Ahalia Campus in Palakkad.\nHistory\nAhalia Hospital, the flagship project of Ahalia medical group has started its first establishment in 1984 as a small GP clinic in the Emirates of Abu Dhabi. Later the group has since expanded to include two multi-specialty hospitals, 20 satellite medical centers, and 35 pharmacies in the peripheral areas of the UAE. In addition, The group operates a line of Ophthalmology centers and Optical shops sprouting under the brand name of Ahalia ophthalmology medical centers in UAE. Also, it varied to other services include Exchange houses, which were the four-time winner of the Jimmy George Memorial Volleyball Tournament in UAE.\nAfter its establishment in the UAE, Ahalia Group launched Ahalia Eye Foundation Hospital, the first institution in Kerala, in 2005.\nDr. V.S Gopal is the founder and chairman of the Ahalia International Foundation, and his wife Sriya Gopal, is a social activist who became the voice of the poor and marginalized at the hospital. They have also helped poor patients with free treatment, surgery, and orphanage marriages.\nAhalia Foundation Eye Hospital\nAhalia Foundation Eye Hospital, the flagship project of Ahalia Health, Heritage & Knowledge Village, established in 2005 in Palakkad, now has more than 22 branches all over the state. It is one of the few hospitals in Kerala accredited by JCI (Joint Commission International) for providing patient care to international standards. With this accreditation, Ahalia won the title of the first JCI Hospital in Kerala in 2010.\nAhalia Diabetes Hospital\nAhalia Diabetes Hospital is the first diabetes hospital in Palakkad, established by Dr. V S Gopal to cater to the unprivileged rural population of Kerala. It had founded in 2010.\nAhalia Ayurveda Medical College Hospital\nAhalia Ayurveda Medical College Hospital has founded in memory of the Late Vazhoor Sreenivasan Vaidyar in 2006.\nEducational Institutions of Ahalia Group\nAhalia Ayurveda Medical College of Ahalia group has founded in memory of the Late Vazhoor Sreenivasan Vaidyar in 2010. The college, inaugurated by the former Kerala Health University Vice-Chancellor K. Mohandas, is the first NABH Accredited Ayurveda Hospital in India. In addition, the Central Zone Arts Festival of the Kerala University of Health and Science (KUHAS) was held at Ahalia Ayurveda Medical College in 2012.\nAlso, The group owns several other institutions such as Ahalia School of Management etc. The Indian Institute of Technology (IIT) has also located at Ahalia Campus in Palakkad.\nThe Ahalia School of Pharmacy has the accreditation of AICTE and the Pharmacy Council of India (PCI).\nAhalia School of Paramedical Sciences is the only approved professional college in Palakkad to conduct a B.Sc. in Medical Laboratory Technology (B.Sc. MLT) program affiliated with the Kerala University of Health Science.\nAhalia School of Management is an ISO9001:2015 certified institution, approved by AICTE, affiliated with Calicut university. It was inaugurated by The Union Minister of State for Human Resources Shashi Tharoor in 2013.\nThe Ahalia Heritage Village\nThe Ahalia Heritage Village, founded in 2008, surrounded by the grandeur of the landscape, is a traditional tourist spot in India. It has located at the foot of the magnificent Western Ghats with panoramic mountains, breathtaking valleys, and an endless field of green and scientifically planted herbal gardens in Palakkad.\nAhalia Heritage Village serves classical art forms, sculpture, and architecture and has a spectacular collection of antique musical instruments, traditional households, and agricultural equipment. It is a building that houses several unique things such as Koothambalam, Musical instrument museum, Granite Sculpture Park, Rock Guard, etc. The Governor and others have visited here.\nAtharva Vedha Bhaishajya Yajnam\nPalakkad Atharva Vedha Bhaishajya Yajnam is the first historical yagam in Kerala. The event, which had held in April 2021 at Ahalia Campus, lasted for five days.\nAhalia Sculpture Camp\nThe Granite Sculpture Camp held at Ahalia campus lasted for twenty days. Seventeen sculptors, including three women, participated in the camp, which was held on womanhood. in prior, the Terracotta Camp held in Ahilya in 2014 was also renowned.\nIn addition, there are several festivals every year, such as mural painting, musical programs, classical dance, and instrumental programs held at ahalia campus. The Kerala governor and others have come there to be part of their programs.\nAhalia Children's Village\nAhalia Children’s Village, One of the Philanthropic activities of Ahalia Group, is a non-profit charitable organization established in 2006, provides shelter and education for many underprivileged children. It has registered under the social Social Justice Department, Government of Kerala, dated 30 December 2017.\nAhalia F.M\nAhalia FM 90.4, launched in 2013, is the first community radio station of Palakkad that caters to children, women, youth, farmers, workers, small business people, entrepreneurs, etc.&nbsp; It Airs on Educational development, Social and Cultural needs of the community in and around the campus in Palakkad, Kerala.\nAhalia Publications\nAhalia Publications LLP is a publication house started by the Ahalia Group that focuses on three specific areas such Health, Education, and Heritage. And, the creative output of the Ahalia group reaches people through Ahalia publications.\nSaga of Kalpathy\nThe Saga of Kalpathy: The Story of Palghat Iyers has the first book published under Ahalia Publications LLP. The book, which tells the story of the Iyer community in Kalpathy, was written by journalist MK Das sketched by E.P Unny.\nReferences"
    }
  ]
}