{
  "content": [
    {
      "type": "text",
      "text": "# Ahmadiyya in the Republic of Ireland\n\nAhmadiyya is a community in Ireland under the spiritual leadership of the caliph in London. The Community was formally registered in the country in 1992, during the era of the Fourth Caliphate. Today there are two Ahmadiyya mosques in the country, one of which is purpose-built, representing up to 500 Ahmadis in the country.\nHistory\nEarly development\nAmong the earliest known visits by an Ahmadis to Ireland, was by Mirza Tahir Ahmad, who was at that time a student at the School of Oriental and African Studies, in London. He toured Dublin in the late 1950s. Ahmad was later to become the fourth caliph of the Ahmadiyya movement. Although Ahmadis are known to have existed in Ireland during the 1960s, Ahmadi Muslim began to immigrate in larger numbers into the country in the early 1970s. During this period, in Galway, the medical sector, among other industries, played a significant role in attracting Muslim immigrants, both students and professionals, from abroad and from all over Ireland. Among the immigrants were Ahmadis Muslims, who were employed in the medical sector.\nIn the 1980s, an entrepreneur, Muhammad Hanif, held congregational prayers in his home, which became the Ahmadiyya Community's first makeshift mosque in Ireland. The house was later donated to the Community, to be used as a mosque.\nHowever, the rise of the Ahmadiyya religious activity in Ireland has largely been a consequence of the religious activity in the United Kingdom, through immigration and otherwise. Among the notable converts was Ibrahim Noonan. Though a native of Waterford, in the South-East of Ireland, he became an Ahmadi whilst residing in London, after reading Murder in the Name of Allah, a book authored by the fourth caliph. He currently serves as an Imam in Galway city. The Ahmadiyya Muslim Community was formally registered in the country in 1992. The current National President of Ahamdiyya Muslim Association of Ireland is Dr.Muhammad Anwar Malik.\nJourneys by caliphs\nThe fourth Caliph Mirza Tahir Ahmad visited the country in 1989, in the year of the Community's centenary. Although this was not his first visit to the country, having visited Dublin in the 1950s as student in England, this was his first visit as a caliph.\nIn 2010 the current and fifth caliph of the Ahmadiyya Community, Mirza Masroor Ahmad, visited Galway to lay the foundation stone for a mosque. The mosque was inaugurated by the caliph, four years later, in 2014, during his second visit to the country. The Galway Mosque, also known as \"Maryam Mosque\" after Mary, mother of Jesus, was built at a cost of €1.5 million, and can accommodate up to 300 worshippers.\nVandalism\nIn July 2019, an Ahmadiyya mosque located in Galway was vandalized. The mosque in question was the Maryam Mosque. The mosque was thought to be targeting by Sunni and Shia Muslims. Bishop Brendan Kelly of Galway, Kilmacduagh and Kilfenora spoke out against the vandalism, saying “I wholeheartedly condemn the actions of the perpetrators.\" Charlie Flanagan, the Irish Minister for Justice and Equality, also spoke out against the attack, saying he was “greatly disturbed” by the news of the attack.\nDemographics\n}}\nAn estimated 300 to 500 Ahmadis live in Ireland, the majority of which are of South Asian origin. About 40% of the Ahmadis in Ireland reside in Galway. There are an estimated 60 members who are under asylum in the country, a third of which are under asylum in Galway. Besides, Galway and Dublin, the Community has members in Cork, Limerick, and a number of smaller towns and cities across Ireland.\nThere are two Ahmadiyya mosques in Ireland, one in Galway in the western coast, and in Lucan near the eastern coast in County Dublin. The Galway Mosque is purpose built.\nSee also\n*Islam in Ireland\nReferences"
    }
  ]
}