{
  "content": [
    {
      "type": "text",
      "text": "# Ahmed Ali Baskandi Award\n\n| holder_label   = Most recent recipient\n| holder         = Toren Chandra Boro (2024)\n| website        = [https://culturalaffairs.assam.gov.in/ Official website]\n}}\nAhmed Ali Baskandi Award is a prestigious state-level honor conferred by the Department of Cultural Affairs, Government of Assam. It is awarded to individuals who have made significant contributions to the promotion of language, literature, culture, and communal harmony in Assam. The award was first instituted in 2015 and is presented every three years.\nHistory\nThe Ahmed Ali Baskandi Award was established in memory of Ahmed Ali Baskandi, an Islamic scholar and Sufi philosopher. He served as the first Sheikh al-Hadith of Darul Uloom Banskandi, a prominent center for learning and peace in Northeast India. His contributions to fostering communal harmony and promoting cultural integration in Assam are widely acclaimed.\nComponents of the Award\nThe award includes a citation, traditional attire (angavastra), a ceremonial gift (xorai), and a cash prize of ₹1 lakh. It recognizes individuals whose efforts have strengthened peace, harmony, and societal welfare.\nObjectives\nThe primary aim of the Ahmed Ali Baskandi Award is to promote communal harmony and preserve Assam's cultural heritage. Instituted in the name of Ahmed Ali Baskandi, a revered religious preacher, the award reflects his ideals of humanity, equality, and fostering unity among diverse communities. It continues to inspire efforts toward peace, development, and societal well-being in the state.\nAwardees\nOver the years, the Ahmed Ali Baskandi Award has been presented to the following individuals:\n{| class=\"wikitable\"\n|-\n! Year !! Name !! Introduction !! Ref\n|-\n| 2015 || Taybur Rahman Barbhuyan || A veteran teacher and philanthropist, honored for his contributions to education and communal harmony. ||\n|-\n| 2021 || Syed Sadullah || A social worker from Dibrugarh, recognized for promoting peace and harmony among different communities in Assam. ||\n|-\n| 2024 || Toren Chandra Boro || A noted writer and former president of the Bodo Sahitya Sabha, recognized for his work in promoting language, literature, culture, and fostering communal harmony. ||\n|}\nReferences"
    }
  ]
}