{
  "content": [
    {
      "type": "text",
      "text": "# Air pollution in Peshawar\n\nPeshawar, the capital of Khyber Pakhtunkhwa in Pakistan, is facing a major air pollution problem. The city, once known for its fresh air and colorful flowers, is now burdened by pollution. Rapid urbanization and population growth have led to increased vehicular and industrial activity, worsening air quality.  The city's air quality has been ranked as hazardous, with an air quality index (AQI) of 4441. This level is 500 times more dangerous than the guidelines issued by the World Health Organization (WHO).\nAir quality\nThe 2022 World Air Quality Report by IQAir reveals that Peshawar, the second most polluted city in Pakistan, holds the fifth position worldwide in terms of pollution. The city has an average PM2.5 concentration of 101.4 μg/m3. Air pollution levels in Peshawar are 12 to 16 times higher than the World Health Organization (WHO) quality guidelines.\nHealth impact\nThe highest level of air pollution in Peshawar is having a significant impact on the health of its residents. Peshawar's population is at high risk of lung damage from smog, which can trigger dormant tuberculosis. City dwellers are losing 2 to 3 years of their lives due to air pollution. A University of Chicago study found that Pakistanis could add 3.9 years to their life expectancy by meeting WHO air quality standards, while citizens of Peshawar could add up to 5.2 years.\nMajor pollutants\nThe major sources of pollution in Peshawar are transport, industry, domestic solid fuel use, municipal waste burning and dust. The city has no effective air quality monitoring network run by the regulator.\nEfforts to combat pollution\nThe Peshawar Clean Air Alliance (PCAA), an organization committed to advocating for cleaner air, has joined forces with the Bank of Khyber, the Environmental Protection Agency (EPA), and the Provincial Environment Department. Their collaboration aims to set up a network for monitoring air quality in Khyber Pakhtunkhwa.\nSee also\n* Air pollution in Lahore\n* Air pollution in Karachi\n* Air pollution in Islamabad\nReferences"
    }
  ]
}