{
  "content": [
    {
      "type": "text",
      "text": "# Air battle over Merklín__disambig_1\n\n|combatant2=\n|commander1=  Jaroslav Šrámek\n|commander2=  Lt. Warren G. Brown\n|strength1= 2 MiG-15\n|strength2= 2 F-84 Thunderjet\n|casualties1= None\n|casualties2= 1 F-84 shot downPilot survived\n}}\nThe Air battle over Merklín was an air-to-air engagement between Czechoslovak and USAFE air units over the Czech village of Merklín, in the Bohemian Forest, on 10 March 1953. During the action Czech pilot Jaroslav Šrámek, flying a MiG-15 (from 5th Fighter Regiment, 2nd Squadron, Plzeň-Líně air base), shot down one of a pair of U.S. Republic F-84 Thunderjets (from 53rd Fighter Bomber Squadron, 36th Fighter-Bomber Wing). The American pilot, lieutenant Warren G.Brown ejected from the aircraft, which crash-landed in West German territory, approximately 35 kilometres (22&nbsp;mi) from the border, and survived.\nPrelude\nAfter the end of the Second World War, the United States created military bases in West Germany, and their military planes often flew over the territory of Czechoslovakia.  Some had intelligence tasks over Czechoslovak territory.  There were frequent clashes between the planes of both sides in the airspace over the border region.\nAir-to-air action\nIt was reported in the London Times that the attack on the U.S. aircraft was  from the border near the town of Falkenstein, Bavaria. Šrámek placed the action instead over Merklín, well inside Czechoslovakia. After outmanoeuvring its opponent, the MiG-15 fired two burst of cannon fire, one a warning shot and the other aimed at disabling the F-84. The US aircraft crashed near Regensburg, Bavaria, and the burnt out wreckage of the F-84 was recovered by American soldiers. The attack followed reports of other Czechoslovak aircraft over Bavarian territory. Brown, the pilot of the F-84, reported they were on a routine patrol along the border when they spotted two aircraft appear from the East, he was fired upon and bailed out after losing control.\nPopular culture\nThe incident was an inspiration for the 1973 Czechoslovak film High Blue Wall which depicts a fictionalised version of the incident.\nReferences\nSources\n* [http://www.radio.cz/en/section/curraffrs/czech-fighter-pilot-recalls-cold-war-dogfight \"Czech fighter pilot recalls Cold War dogfight\"] by Collin O'Connor. Radio Prague, 4 October 2004\n* [https://web.archive.org/web/20150913040144/http://www.afterburner.cz/clanky/sramek.htm Souboj nad Železnou oponou (Duel Above The Iron Curtain)], 2000 article by Tomáš Soušek\n* [https://books.google.com/books?id=IUIEAAAAMBAJ&pg=PA29 23 March 1953 article from Life Magazine], pages 29 – 31, (via Google Books)"
    }
  ]
}