{
  "content": [
    {
      "type": "text",
      "text": "# Airville, Queensland\n\n| pop                 = 308\n| pop_year            =\n| pop_footnotes       =\n| established         =\n| postcode            = 4807\n| area                = 43.9\n| timezone            = AEST\n| utc                 = +10:00\n| dist1               = 11.8\n| dir1                = SW\n| location1           = Ayr\n| dist2               = 90.1\n| dir2                = SE\n| location2           = Townsville\n| dist3               = 1247\n| dir3                = NNW\n| location3           = Brisbane\n| dist4               =\n| dir4                =\n| location4           =\n| lga                 = Shire of Burdekin\n| stategov            = Burdekin\n| fedgov              = Dawson\n| near-n              = Brandon\n| near-ne             = Brandon\n| near-e              = McDesme\n| near-se             = Home Hill\n| near-s              = Osborne\n| near-sw             = Mount Kelly\n| near-w              = Mount Kelly\n| near-nw             = Barratta\n}}\nAirville is a rural locality in the Shire of Burdekin, Queensland, Australia. In the , Airville had a population of 308 people.\nGeography\nAirville is bounded on the south-east by the Burdekin River. It is flat low-lying land (about 10 metres above sea level) used predominantly for sugarcane plantations. There is a network of cane tramways to deliver the harvested sugar to the local sugar mills.\nMaida Vale is a neighbourhood in the north-east of the locality ().\nLabatt Lagoon is a waterhole ().\nHistory\nAirdale Provisional School opened in the south-west of the locality on 2 September 1890, becoming Airdale State School on 1 January 1909. In 1926, it was renamed Airville State School.\nMaidavale State School opened in the north-east of the locality on 27 April 1910.\nDemographics\nIn the , Airville had a population of 338 people.\nIn the , Airville had a population of 308 people.\nEducation\nAirville State School is a government primary (Prep-6) school for boys and girls at Old Clare Road (). In 2016, the school had an enrolment of 23 students who come from the local rural community with 3 teachers (2 full-time equivalent) and 5 non-teaching staff (3 full-time equivalent). In 2018, the school had an enrolment of 9 students with 2 teachers (1 full-time equivalent) and 4 non-teaching staff (3 full-time equivalent).\nMaidavale State School is a government primary (Prep-6) school for boys and girls at Maidavale Road (). In 2016, the school had an enrolment of 10 students with 2 teachers (1 full-time equivalent) and 5 non-teaching staff (2 full-time equivalent). In 2018, the school had an enrolment of 6 students with 2 teachers (1 full-time equivalent) and 4 non-teaching staff (2 full-time equivalent).\nThere is no secondary school in Airville. The nearest government secondary schools are Ayr State High School in Ayr to the north-east and Home Hill State High School in neighbouring Home Hill to the south-east.\nReferences\nExternal links"
    }
  ]
}