{
  "content": [
    {
      "type": "text",
      "text": "# Aishwarya Rajinikanth\n\n| birth_place        = Madras (now Chennai), Tamil Nadu, India\n| death_date         =\n| death_place        =\n| occupation         =\n| years_active       = 2003–present\n| spouse             =\n| children           = 2\n| father             = Rajinikanth\n| mother             = Latha Rajinikanth\n| relatives          = Rajinikanth family\n| family             = Soundarya Rajinikanth (sister)\n}}\nAishwarya Rajinikanth (born 1 January 1982) is an Indian film director and playback singer who works in Tamil cinema. She is the elder daughter of actor Rajinikanth and playback singer Latha Rajinikanth. She made her feature film directorial debut with 3 (2012).\nAishwarya Rajinikanth (center), David Womark (left), [[Avy Kaufman (right) at IFFI 2012]]\nEarly life\nAishwarya was born to actor Rajinikanth and singer Latha Rangachari. She has a younger sister, Soundarya, who works in the Tamil film industry as well.\nCareer\nAishwarya began her career in the Tamil film industry as a playback singer in the unreleased film Ramanaa, directed by Parthy Bhaskar. The song was composed by Deva in November 2000. Her first song to be released was \"Natpe Natpe\" from D. Imman's soundtrack for Whistle (2003), which she sang alongside the composer and actor Silambarasan.\nIn August 2011, she announced that she would direct her husband, Dhanush, and Shruti Haasan in her first feature film titled 3. The film was highly anticipated prior to its release, after the song \"Why This Kolaveri Di\" from its soundtrack went viral and became an internet phenomenon. The song was composed by her cousin Anirudh Ravichander. She appeared alongside the lead cast and composer in the making of the video. In July 2015, Aishwarya announced she will soon launch a YouTube channel under the banner of \"Ten Entertainment\" to exclusively promote original content and short films by aspiring filmmakers.\nShe was a judge on STAR Vijay's dance competition Jodi Number One in its third season alongside actors Sangeetha and Jeeva. She became a playback singer with the film Whistle alongside Silambarasan, which was then followed by the song \"Un Mela Aasadhan\" in the film Aayirathil Oruvan, for which she also worked as an assistant director.\nIn August 2016, Aishwarya was selected as India's goodwill ambassador for the UN Women organization.\nDance criticism\nIn March 2017, Aishwarya performed Bharatanatyam, a style of Indian classical dance, at the UN headquarters on International Women's Day. Her performance was criticized on social media by professional Bharatanatyam dancers, with popular Indian dancer Anita Ratnam writing on Aishwarya's Facebook that \"This is what Bharatanatyam becomes... A caricature and a farce!\".\nPersonal life\nOn 18 November 2004, Aishwarya married actor Dhanush, with whom she has two sons, born in 2006 and 2010. The couple announced their separation through their respective social media handles on 17 January 2022. In April 2024, they filed for divorce, which was finalised that November. In December 2016, Aishwarya Rajinikanth released her own memoir Standing on An Apple Box: The Story of A Girl Among the Stars.\nFilmography\nAs film director\n{| class=\"wikitable sortable\"\n|-\n! Year\n! Title\n! Notes\n! class=\"unsortable\" | Ref..\n|-\n| 2012 || 3|| ||\n|-\n| 2015 || Vai Raja Vai|| ||\n|-\n| 2017 || Cinema Veeran|| Documentary ||\n|-\n| 2024 || Lal Salaam|| ||\n|}\nOther roles\n{| class=\"wikitable sortable\"\n|-\n! Year\n! Title\n! Role\n! class=\"unsortable\" | Ref..\n|-\n| 2003 || Whistle ||Co-singer for \"Natpae Natpae\" with Silambarasan, D. Imman, Uma Mahesh, Roopa Venkat ||\n|-\n| 2010 || Aayirathil Oruvan || Co-Singer for \"Un Mela Aasadhan\" with Dhanush, Andrea Jeremiah;Also dubbing artist for actress Reema Sen ||\n|-\n|}\nReferences\nExternal links\n*"
    }
  ]
}