{
  "content": [
    {
      "type": "text",
      "text": "# Aishwarya Dutta\n\nAishwarya Dutta is an Indian actress who has predominantly appeared in Tamil language films. After initially appearing in music videos and minor acting roles, she made a breakthrough as an actress with her role in  the Tamil movie Tamizhuku En Ondrai Azhuthavum (2015). In 2018, she featured in the Tamil reality television show Bigg Boss Tamil 2 and emerged as the runner up.\nCareer\nAishwarya Dutta began her career as a dancer with the Nrithyangan Sisters troupe, appearing in several stage performances and reality shows. She then got into modelling, and notably appeared in commercials and a music video with playback singer Harshad Saxena for Sony Music Videos. As an actress, Dutta first appeared in the bilingual murder mystery film, Picnic, about a group of students who go to Vizag for an excursion with their professor. Shot in Bengali and Hindi, the film became noticed for the intimate scenes between the lead actresses.\nDutta made her debut in the Tamil film industry with Ramprakash Rayappa's Tamizhuku En Ondrai Azhuthavum (2015), which opened to positive reviews and box office collections. In the film, Aishwarya portrayed a middle-class college student who falls for an intelligent youngster, played by Nakul. She was later listed by the Times of India as one of the best debutants of 2015, alongside the likes of Amyra Dastur and Keerthy Suresh. Soon after the release of the film, she stated that the Tamil film industry was her \"favourite\" and that the scripts being offered to her in Tamil were \"solid\", and raised her confidence level considerably. She then featured in a supporting role as Kajal Aggarwal's sister in Suseenthiran's action thriller, Paayum Puli (2015), and described that the opportunity to work in a high-profile project was \"rewarding\". During the period, she also worked on a film titled Aruthapathi with Vidharth as her co-star, and Sattam opposite Samuthirakani, but the projects were later shelved.\nShe next appeared as a journalist in Arivazhagan's mystery film Aarathu Sinam (2016), featuring alongside Arulnithi and Aishwarya Rajesh. The film won positive reviews from critics, though received an average response commercially. In her next role, she portrayed a \"free-spirited girl\" and paired opposite Kavin in S. R. Prabhakaran's action drama Sathriyan, which starred Vikram Prabhu and Manjima Mohan. In 2018, her only release was the action drama Marainthirunthu Paarkum Marmam Enna, which she had shot for in 2015. During the making of the film, she fell out with the producers who subsequently decided to reduce the scope of her character.\nIn 2018, she featured in the Tamil reality television show Bigg Boss Tamil 2, and finished as the season's runner-up. Recently, she showcased her talent and versatility by competing in Top Cooku Dupe Cooku, further solidifying her popularity in the entertainment industry.\nFilmography\n*All films are in Tamil, unless otherwise noted.\n{| class=\"wikitable\"\n| style=\"background:#FFFFCC;\"|\n| Denotes films that have not yet been released\n|}\nFilms\n{| class=\"wikitable\"\n|-  style=\"background:#cccccf; text-align:center;\"\n! Year !!Film !! Role !! Notes\n|-\n| 2014 || Chalo Picnic Manayen || || Bilingual film in Bengali (as Picnic) and Hindi\n|-\n| rowspan=\"3\" | 2015 || Tamizhuku En Ondrai Azhuthavum || Harini ||\n|-\n|Paayum Puli|| Dhivya ||\n|-\n|Achaaram|| Nandhini|| Guest appearance\n|-\n| 2016 || Aarathu Sinam || Varsha ||\n|-\n| 2017 || Sathriyan || Chandran's girlfriend  ||\n|-\n| 2018 || Marainthirunthu Paarkum Marmam Enna || Bharathi ||\n|-\n| rowspan=\"2\" |2022||Coffee with Kadhal || Neetu ||\n|-\n|Jasper||Seema ||\n|-\n| rowspan=\"3\" |2023||Irumban ||Mahima||\n|-\n|Kannitheevu || Aishwarya ||\n|-\n|Farhana || Sofia ||\n|-\n| rowspan=\"3\" |2024 || Hit List || Aishwarya ||\n|-\n|Kozhipannai Chelladurai || Chitra ||\n|-\n|Hitler || Dancer || Special appearance\n|-\n| 2025 || Madraskaaran || Kalyani  ||\n|}\nTelevision\n{| class=\"wikitable sortable\"\n|-\n! Year !! Shows !! Role !! Channel !! Notes\n|-\n| 2018 || Bigg Boss Tamil Season 2 || Contestant || rowspan=\"5\" | Vijay TV|| 1st Runner Up\n|-\n| 2019 || Bigg Boss Tamil Season 3|| rowspan=\"3\" |Guest ||\n|-\n| rowspan=\"2\" |2020 || Murattu Singles  ||\n|-\n| Bigg Boss Tamil Season 4||Through Virtual Meet\n|-\n| rowspan=\"2\" | 2021 || BB Jodigal Season 1 || Contestant || Reality Dance Show; Finalist\n|-\n|Chat Box With Ashiq\n| rowspan=\"2\" |Guest\n|Sun Music\n|Talk Show\n|-\n|2022\n|Stylish Tamilachi: Pongal Special Show\n|Star Vijay\n|Pongal Special Show\n|-\n|2022\n|Oo Solriya Oo Oohm Solriya\n|Participant\n|Star Vijay\n|Game Show\n|-\n|2022\n|Anda Ka Kasam\n|Participant\n|Star Vijay\n|Game Show\n|-\n|2023\n|Cooku with Comali (season 4)\n|Guest\n|Star Vijay\n|Special appearance\n|-\n|2024\n|Top Cooku Dupe Cooku (season 1)\n|Contestant\n|Sun TV\n|Eliminated episode 16\n|-\n|}\nWeb series\n{| class=\"wikitable\"\n!Year\n!Title\n!Role\n!Platform\n!Notes\n|-\n|2019\n|Madras Meter Show\n|Guest\n|ZEE5\n|Episode 4\n|-\n| 2024\n| Sshhh\n|Tarangani\n| aha\n| Anthology series; segment Kamathupaal\n|}\nMusic Album\n{| class=\"wikitable sortable\"\n|+\n!Year\n!Album name\n!Language\n!Co-artist\n!Singers\n|-\n|2021\n|Beatta Yaethi\n|Tamil\n|\n|Rakshita Suresh\n|}\nReferences\nExternal links\n*"
    }
  ]
}