{
  "content": [
    {
      "type": "text",
      "text": "# Aishwary Pratap Singh Tomar\n\n| birth_place = Khargone, Madhya Pradesh, India\n| coach = Suma Shirur\n| sport = Shooting\n| event = 50 m rifle 3 positions10 m air rifle\n| pb = 597  (2025)591 AGR (2023)\n| medaltemplates =\n}}\n}}\nAishwary Pratap Singh Tomar (born 3 February 2001) is an Indian sport shooter. Tomar represented India in the 50 m rifle 3 positions event at the 2020 Tokyo Olympics and 2024 Paris Olympics.\nEarly life\nTomar was born on 3 February 2001 in Ratanpur village, Khargone district, Madhya Pradesh, into a family of farmers, as the youngest of three children. He often went hunting with his father Veer Bahadur, a landlord, and learned about sport shooting from his cousin Navdeep Singh Rathore. Tomar started to receive training in 2015 at the Madhya Pradesh Shooting Academy in Bhopal.\nCareer\nTomar won the bronze medal at the 2019 Asian Airgun Championships in the junior 10 metre air rifle event. At the 2019 ISSF Junior World Cup in Suhl, Tomar set the junior world record in the 50 metre rifle three positions with a score of 459.3 and won the gold medal.\nTomar won the bronze medal in 50 metre rifle three positions at the 2019 Asian Shooting Championships in Doha, scoring 449.1 in the final. He thus secured India's second 2020 Summer Olympics quota place in the event and 13th overall in shooting. He bagged bronze in the team event of the same discipline, along with Chain Singh and Parul Kumar.\nTomar bagged gold at the 2021 ISSF World Cup event in New Delhi with a score of 462.5 in men's 50 metre rifle three positions. He scored 155 points in kneeling and 310.5 in prone before the standing elimination round, and earned qualification for the 2020 Summer Olympics.\nTomar clinched gold in 50m Rifle three positions men's event with a new junior world record at the 2021 ISSF Junior World Championships held in Lima, Peru.\nAwards\n* 2019: Eklavya Award by the Government of Madhya Pradesh (on National Sports Day)\n* 2023: Arjuna Award\nReferences\nExternal links\n*\n*\n*"
    }
  ]
}