{
  "content": [
    {
      "type": "text",
      "text": "# Aja Naomi King\n\n| birth_place        = Los Angeles, California, U.S.\n| education          = University of California, Santa Barbara (BFA)Yale University (MFA)\n| occupation         = Actress\n| years_active       = 2008–present\n| spouse             = Dan King\n| children           = 1\n| awards             = Full list\n}}\nAja Naomi King (; born January 11, 1985) is an American actress. King began her career in guest-starring roles on television, and starred in the short-lived CW medical comedy-drama series Emily Owens, M.D. (2012–2013). She also has starred in the films Four (2012) and Reversion (2015). After her breakthrough as Michaela Pratt in the ABC legal drama series How to Get Away with Murder (20142020), she received praise for portraying Cherry Turner in the historical film The Birth of a Nation (2016).\nAlongside leading roles in the biographical drama A Girl from Mogadishu (2019) and the romantic comedy Boxing Day (2021), King also had supporting roles in the comedy dramas The Upside (2017) and ''Sylvie's Love (2020), and the historical drama The 24th'' (2020). For Apple TV+'s Lessons in Chemistry (2023), she was nominated for the Primetime Emmy Award for Outstanding Supporting Actress in a Limited or Anthology Series or Movie.\nEarly life\nKing was born in Los Angeles and grew up in Walnut, California. She received a Bachelor of Fine Arts in Acting from the University of California, Santa Barbara, and a Master of Fine Arts from Yale University's School of Drama in 2010. At Yale University, King performed in a number of productions, including ''A Midsummer Night's Dream, Little Shop of Horrors, and Angels in America: A Gay Fantasia on National Themes. After graduating from Yale, she worked as a waitress in New York City for three years while auditioning for acting roles.\nCareer\n2010–2013: Early work\nKing appeared in several short films in the early period of her career. She made her television debut in 2010, as a guest star in the CBS police procedural Blue Bloods, and later appeared on Person of Interest, The Blacklist and Deadbeat. She made her feature film debut in the 2011 independent film Damsels in Distress'', as a minor character. Her big break came in 2012, when she was cast as new surgical intern Cassandra Kopelson and the series' primary antagonist, on the CW medical comedy-drama series Emily Owens, M.D. The series was canceled after a single season in 2013.  She later starred in the Amazon Studios comedy pilot The Onion Presents: The News.\nIn 2013, King co-starred in two independent films. She played Abigayle, the daughter of Wendell Pierce's character, in the independent drama Four, released on September 13, 2013. Along with her castmates, she won a Los Angeles Film Festival Award for Best Performance by Cast for her role in this movie. She also appeared alongside Laverne Cox and Britne Oldford in the film 36 Saints. In 2014, she had supporting role in the romantic comedy The Rewrite, starring Hugh Grant and Marisa Tomei. The film was shot in 2013 but was released theatrically in the United States in 2015.\n2014–present: Breakthrough and prominence\nIn early 2014, King had a recurring role as Ali Henslee in the ABC medical drama series Black Box, starring Kelly Reilly. The series was canceled after a single season. In February 2014, she was cast as one of the main characters in the ABC legal thriller How to Get Away with Murder, produced by Shonda Rhimes. The series stars Viola Davis as a law professor Annalise Keating. King plays the role of Michaela Pratt, one of the five lead students, alongside Alfred Enoch, Jack Falahee, Matt McGorry, and Karla Souza. The series premiered on September 25, 2014, with generally positive reviews from critics, and 14 million viewers. King received her first NAACP Image Award nomination for her performance in series.\nIn 2015, King had her first the leading role in the science-fiction thriller Reversion. The film had limited theatrical release on October 9, 2015. Also in 2015, she was cast as the female lead in the historical drama film The Birth of a Nation, based on the story of the 1831 slave rebellion led by Nat Turner. The film also stars Nate Parker, Aunjanue Ellis, Gabrielle Union, and Armie Hammer. She played Nat Turner's wife, Cherry. The film premiered in competition at the 2016 Sundance Film Festival on January 25, 2016, and received positive reviews from critics. King's performance was also well received. Variety placed her in their list of one of the \"Biggest Breakthrough Performances\" at Sundance, writing that \"King transforms herself from contemporary glamour girl to 19th-century slave in Nate Parker's festival smash. A harrowing scene late in the film opposite Parker as Nat Turner reveals a depth and range King has never been asked to deliver in her small screen work, and a potential new star is born.\" King had also been shortlisted as a possible contender for the Academy Award for Best Supporting Actress but did not receive a nomination. She received an NAACP Image Award for Outstanding Supporting Actress in a Motion Picture nomination for her role. She received the \"Rising Star Award\" at the 10th annual Essence Black Women In Hollywood event in February 2017.\nIn 2017, King appeared opposite Kevin Hart, Bryan Cranston, and Nicole Kidman in The Upside, a remake of the 2011 French film The Intouchables. Later that year, she was cast in the leading role of Somali activist Ifrah Ahmed in the biopic A Girl from Mogadishu. In 2020, she appeared in the drama film ''Sylvie's Love, opposite Tessa Thompson and Nnamdi Asomugha. King later played a female leading role in the historical drama film The 24th about Houston riot of 1917 directed by Kevin Willmott. King will next star in Michael Maren A Little White Lie in 2023. She also starred opposite Nnamdi Asomugha in his feature directorial debut, The Knife.\nIn 2021, she appeared opposite Aml Ameen in his directorial debut Boxing Day. In 2023, King co-starred opposite Brie Larson in the Apple TV+ miniseries, Lessons in Chemistry''.\nModeling\nKing was the face of skincare line Olay's fall 2015 advertising campaign. She became a spokesperson for L'Oreal Paris in 2017 and has since appeared in numerous campaigns for the brand. In 2022, she appeared in an advertising campaign for jewellery brand Chopard.\nDuring her career, King has graced the covers of numerous magazines, including Vanity Fair, Elle, Marie Claire, Nylon, Glamour, Essence, Entertainment Weekly and Shape.\nPersonal life\nIn March 2021, she announced that she was pregnant after previously experiencing two miscarriages. On June 6, 2021, she announced that she had given birth to a son, Kian, with husband Dan King.\nFilmography\nFilm\n{| class=\"wikitable sortable\"\n|-\n! scope=\"col\" | Year\n! scope=\"col\" | Title\n! scope=\"col\" | Role\n! scope=\"col\" class=\"unsortable\" | Notes\n|-\n|2010\n|A Basketball Jones\n| Sara Walker\n| Short film\n|-\n| 2011\n| Damsels in Distress\n| Positive Polly\n|\n|-\n| 2012\n| Four\n| Abigayle\n|\n|-\n|2013\n| 36 Saints\n| Joan\n|\n|-\n| 2014\n| The Rewrite\n| Rosa Tejeda\n|\n|-\n| 2015\n| Reversion\n| Sophie Clé\n|\n|-\n| 2016\n| The Birth of a Nation\n| Cherry Turner\n|\n|-\n| 2017\n| The Upside\n| Latrice\n|\n|-\n| 2019\n| A Girl from Mogadishu\n| Ifrah Ahmed\n|\n|-\n|Rowspan=2| 2020\n| ''Sylvie's Love\n| Mona\n|\n|-\n| The 24th\n| Marie\n|\n|-\n| 2021\n| Boxing Day\n| Lisa Dixon\n|\n|-\n| 2022\n| A Little White Lie\n| Blythe Brown\n|\n|-\n| 2025\n|The Knife\n| Alex\n|\n|}\nTelevision\n{| class=\"wikitable sortable\"\n|-\n! scope=\"col\"| Year\n! scope=\"col\"| Title\n! scope=\"col\"| Role\n! scope=\"col\" class=\"unsortable\"| Notes\n|-\n| 2010\n| Blue Bloods\n| Denise\n| Episode: \"Samaritan\"\n|-\n| 2012\n| Person of Interest\n| Lisa\n| Episode: \"Wolf and Cub\"\n|-\n| 2012–2013\n| Emily Owens, M.D.\n| Cassandra Kopelson\n| Main cast; 13 episodes\n|-\n| 2013\n| Onion News Empire\n| Jillian\n| Television pilot\n|-\n| 2013\n| The Blacklist\n| Elysa Ruben\n| Episode: \"Frederick Barnes (No. 47)\"\n|-\n| rowspan=\"2\"| 2014\n| Deadbeat''\n| N'Cole\n| Episode: \"Out-Of-Body Issues\"\n|-\n| Black Box\n| Ali Henslee\n| Recurring cast; 8 episodes\n|-\n| 2014–2020\n| How to Get Away with Murder\n| Michaela Pratt\n| Main cast; 90 episodes\n|-\n| 2015\n| BoJack Horseman\n| BoJack's Date (voice)\n| Episode: \"Yesterdayland\"\n|-\n| 2018\n| Scandal\n| Michaela Pratt\n| Episode: \"Allow Me to Reintroduce Myself\"\n|-\n| 2019\n| A Black Lady Sketch Show\n| Recluse\n| Episode: \"Your Boss Knows You Don't Have Eyebrows\"\n|-\n| 2021\n| Blackout\n| Wren Foster (voice)\n| Main cast; 9 episodes\n|-\n| 2023\n| Lessons in Chemistry\n| Harriet Slone\n| Main cast; 8 episodes\n|-\n| 2025\n| Grosse Pointe Garden Society\n| Catherine\n| Main cast\n|}\nAwards and nominations\n{| class=\"wikitable sortable\"\n|-\n! Year\n! Award\n! Category\n! Work\n! Result\n|-\n| 2013\n| Los Angeles Film Festival\n| Los Angeles Film Festival Award for Best Performance by an Ensemble\n| Four\n|\n|-\n| 2015\n|rowspan=\"2\"| NAACP Image Awards\n| NAACP Image Award for Outstanding Supporting Actress in a Drama Series\n| How to Get Away with Murder\n|\n|-\n|rowspan=\"2\"| 2017\n| NAACP Image Award for Outstanding Supporting Actress in a Motion Picture\n|rowspan=\"2\"| The Birth of a Nation\n|\n|-\n| Black Reel Awards\n| Black Reel Award for Outstanding Breakthrough Performance, Female\n|\n|-\n| rowspan=2 | 2024\n| Critics' Choice Television Awards\n| Critics' Choice Television Award for Best Supporting Actress in a Movie/Miniseries\n| rowspan=2 | Lessons in Chemistry\n|\n|-\n| Primetime Emmy Award\n| Outstanding Supporting Actress in a Limited or Anthology Series or Movie\n|\n|}\nReferences\nExternal links\n*\n*"
    }
  ]
}