{
  "content": [
    {
      "type": "text",
      "text": "# Akata Warrior\n\n| isbn              = 9780670785612\n| oclc              = 973806811\n| congress          = PZ7.O4157 Ah 2017\n| preceded_by       = Akata Witch\n| followed_by       = Akata Woman\n| set_in            = Aba, Nigeria\n| isbn_note         = (hardcover 1st ed.)\n| dewey             = 813.6\n| audio_read_by     = Yetide Badaki\n| illustrator       = Designed by Jim Hoover\n| media_type        = Print, ebook, audiobook, kindle, audible\n}}\nAkata Warrior (retitled Sunny and the Mystery of Osisi ''in Nigeria and the UK) is a 2017 young adult fantasy novel by Nigerian American writer Nnedi Okorafor. It is a sequel to Akata Witch (2011) and the second book in her The Nsibidi Scripts series; it's followed by Akata Woman (2022). It won the inaugural Lodestar Award in 2018 as well as the 2018 Locus Award for Best Young'' Adult Novel.\nPlots\n* Set a year after the events of the first book, it follows Sunny Nwazue, an American-born Nigerian albino girl living in Aba who becomes a member of the secret Leopard society.\n* Sunny Nwazue has recurring vision of a burning city and while picking up tainted pepper, she is given a comb by Mami Wata.\n* She disobeys the Leopard rules, and with assistance of Chichi, uses a juju to scare the members of the cult that haunts Chukwu in the university and is sent to the Obi Library basement to face a djinn whom she defeats and reunites with her friends and parents. Then, her father threatens to disown her.\n* Her spirit face Anyanwu is separated from her after an attack from Ekwensu, who emerges again. Sunny and her friends Orlu, Chichi, and Sasha visit Bola, where she tells Sunny to go to Lagos to meet Udide, who will weave a flying grasscutter to take them to Osisi.\n* Through the help of Chukwu, they head to Lagos under the disguise of a road trip and meet Udide who weaves a flying grasscutter in exchange for Sunny's story.\n* After a series of events, Chukwu sees the grasscutter and they escape before the council car comes to pick them.\n* In Osisi, they defeat Ekwensu to avert an apocalypse and return home to face the council officials, who forgives them. The novel ends with Sunny, Chichi, and Sasha attending the Zuma Rock Festival.\n* Characters\n*Sunny Nwazue: A 13-year-old albino girl who is a member of the leopard society, she is determined and scared at some point when Anyanwu left her.\n*Orlu: Sunny's best friend who is capable of undoing juju and knows how to make the grasscutter obey his command. Orlu has feelings for sunny.\n*Chichi: Sunny's friend who is at times mischievous and her powers are always unclear to Sunny. She is good at convincing people.\n*Sasha: Sunny's friend who is in love with Chichi. His powers are also unclear to Sunny. He opposes police officer's taking bribes.\n*Chukwu: Sunny's brother who is protective of her, thinks she is a child witch, and goes into a trust knot with the council when he accidentally sees the grasscutter.\n*Bola: a Mami Wata priestess who tells Sunny to meet Udide and go to Osisi.\n*Udide: A spider who lives in a cave in Lagos. she knows every story and weaves the flying Grasscutter.\n*Ekwensu: An evil masquerade who is about to bring a deadly apocalypse to the world and is sent into the wilderness when Sunny unmasked it.\n*Sugar Cream: Sunny's mentor who is very strict and sends her to face the djinn when Sunny breaks the rules.\n*Adebayo: Chukwu's friend who forces Chukwu to join a cult and is attacked by Sunny and Chichi. He is uncomfortable in Sunny's presence.\nReception\nThe book received several positive reception with most critics praising Okorafor's characters and writings.\nA review by the Locus Magazine called it an epic sequel. Brittle Paper praised the novel and also its cover.\nAwards and recognitions\nHonors\n* New York Times Notable Book of 2017\n* Barnes & Noble Best Young Adult Book of 2017\n* 2017 Booklist Editors Choice\nAwards\n*2018 Lodestar Award for best Young Adult Book\n* 2018 Locus Award for Best Young Adult Novel\nSequel\nThe sequel to Akata Warrior is Akata Woman, which was released on January 18, 2022.\nReferences\nFile:Maize farm 🚜.jpg|Farm food refers to food products that are grown, raised, or produced on a farm. It includes both plant-based and animal-based products and is often considered the first stage in the food supply chain before it is processed, packaged, or sold."
    }
  ]
}