{
  "content": [
    {
      "type": "text",
      "text": "# Aktam ancient settlement\n\n}}\nAktam ancient settlement dates back to the X–XII centuries and was located in Almaty region, Balkhash district, on the Bank of the dry arm of Ortabakanas, on the territory of the saryesik-Atyrau desert, 120&nbsp;km North of the village of Bakanas.\nHistory\nThe primary descriptions of the existence of the ruins of ancient cities on the southern shore of lake Balkhash date back to the end of the 19th century. In 1884, the Notes of the West Siberian Department of the Russian geographical society published an article by Colonel V. A. Fischer, dedicated to navigation on the Ili river. In this article, the author writes about the ruins of villages and the remains of irrigation structures that could be observed along the dried-up Bakanas. In the 1960s, under the leadership of K. A. Akishev, [https://cyberleninka.ru/article/n/baypakov-karl-moldahmetovich-vydayuschiysya-uchenyy-i-organizator-nauki-kazahstana K. M. Baypakov] and L. B. Yerzakovich, archaeological research was conducted on the site. The settlement of Aktam dates back to the 10th–12th centuries. The cities of the southern Balkhash region were relatively short-lived. The fragments of pottery can be dated to their origin in the 10th century, life ceased in them at the beginning of the 13th century. The city of Actam was part of a chain of fortified settlements on the route of the medieval caravan routes. From Talkhiz, the Northern road followed the Talgar river to a crossing on the Ili river, which was located near the Kapchagai reservoir. After it, the path led to Shengeldy, one of the routes then followed to the lower reaches Or along the Ortasu channel (Ili River), where the remains of the cities of Karamergen, Aktam and Agashayak are located to the shore of Balkhash, and then along the Uzun-Aral Peninsula, which almost connects the southern and Northern shores of the lake, leaving a Strait a little more than 8&nbsp;km wide. then the caravans waded through the Strait and went to the mouth of the Tokrau river and then along its banks went to the foothills of Ulutau.\nDescription\nThe ruins of the city are a raised rectangular area surrounded by a wall. The settlement is oriented to the cardinal angles, its long South-Western and North-Eastern walls are 180 m, and the short South-Eastern and North-Western walls are 170 m. All four corners are reinforced by strongly protruding round towers with a diameter of 10–12 m, retaining a height of 2.5–3 m. the Long walls had 4 towers, 35 m from each other, short - two towers, flanking the entrances to the city. The hill of the fortress has dimensions of 180×170 meters, in the corners, between the round towers, there are gates with a height of 2 m.\nThe entrances are arranged in the form of L-shaped corridors. The enemy could always be hit by dozens of arrows fired at him from the right side, from which he was not covered by a shield. The inner surface of the settlement is a flat area, sometimes zatakyrnuyu and overgrown with saxaul. On the West side of Aktam, five miles away, archaeologists discovered the bed of the main channel, derived from the dry bed of Artabanus with a length of 20&nbsp;km. Ware discovered during the excavation are presented mugs, pitchers, large Hamami, bowls, bowls, artisans-potters made in their workshops. All dishes are made on a Potter's wheel, this is one of the most important signs characteristic of the developed Middle Ages. The surface of the vessels is decorated with inset wavy lines, stamp impressions in the form of ring-shaped and triangular indentations. There are glazed ceramics of the 11th – beginning of the 13th century.\nLocation\nAlmaty region, Balkhash district, on the Bank of the dry arm of Ortabakanas, on the territory of the saryesik-Atyrau desert, 120&nbsp;km North of the village of Bakanas.\nPreservation\nThe monument is under state protection, but it is not included in the State list of historical and cultural monuments of local significance in Almaty region, 2010. There is no physical protection of the monument in place.\nSources\n* [https://cyberleninka.ru/article/n/baypakov-karl-moldahmetovich-vydayuschiysya-uchenyy-i-organizator-nauki-kazahstana Baypakov K. M., Yerzakovich L. B. Ancient cities of Kazakhstan. Alma-ATA, 1971.]\n* [http://nblib.library.kz/elib/library.kz/Jurnal/Общественный_06_2015/K.M.Baypakov%2006-15.pdf Baypakov K., Voyakin D. Kazakhstan section of the silk road. Almaty. 2012.]\nReferences"
    }
  ]
}