{
  "content": [
    {
      "type": "text",
      "text": "# Al-Khawarizmi Institute of Computer Science\n\n| native_name_lang =\n| image = Al-Khawarizmi_Institute_of_Computer_Science_(KICS).gif\n| image_upright =\n| image_alt =\n| caption =\n| latin_name =\n| other_name =\n| former_name =\n| motto =\n| motto_lang =\n| mottoeng =\n| top_free_label =\n| top_free =\n| type = Semi-government\n| established = August, 2002\n| closed =\n| founder =\n| parent = University of Engineering and Technology, Lahore\n| affiliation =\n| religious_affiliation =\n| academic_affiliation = Higher Education Commission of Pakistan, Huawei, CISCO, Mentor Graphics, IEEE, University of Engineering and Technology, Lahore, Ignite National Technology Fund\n| endowment =\n| budget =\n| officer_in_charge =\n| chairman = Vice Chancellor, UET, Lahore\n| chairperson =\n| chancellor =\n| president =\n| vice-president =\n| superintendent =\n| provost =\n| vice_chancellor =\n| rector =\n| principal =\n| dean =\n| director = Dr. Waqar Mahmood\n| head_label =\n| head =\n| academic_staff = 200\n| administrative_staff =\n| students =\n| undergrad =\n| postgrad =\n| doctoral =\n| other =\n| address =\n| city = Lahore\n| state =\n| province = Punjab\n| country = Pakistan\n| postcode =\n| coordinates =\n| campus =\n| language =\n| free_label =\n| free =\n| free_label2 =\n| free2 =\n| colors =\n| athletics =\n| sports =\n| athletics_nickname =\n| sporting_affiliations =\n| mascot =\n| sports_free_label =\n| sports_free =\n| sports_free_label2 =\n| sports_free2 =\n| website =\n| logo =\n| logo_size =\n| logo_alt =\n| footnotes =\n}}\nAl-Khawarizmi Institute of Computer Science , () was established in August 2002 at University of Engineering and Technology, Lahore to promote research and development in various fields of Computer Science and Information Technology. It was built to conduct applied research in collaboration with various academic and industrial institutes to promote technology and development at national and international level. It has gathered many competent and highly accomplished researchers from various institutes of Pakistan\nThe name of institute is chosen to commemorate and pay tribute to one of the most honorable and prominent Muslim mathematician, thinker, and scholar Muḥammad ibn Mūsā al-Khwārizmī who was born in Persia and lived from 780 AD to 850 AD. Al-Khwārizmī's contribution in the field of mathematics, astronomy and geography drastically changed the paradigm of science and mathematics. He was the first one to introduce Algebra and is known as Father of Algebra. In fact, even the word \"algorithm\" is formed by tampering his name \"Al-Khawarizmi\". His mathematical concepts form the basis of the digital computer models introduced by Alan Turing and John Von Neumann.\nAl-Khawarizmi Institute of Computer Science has over 200 staff members, including many with doctorates, post-graduates and graduates from the fields of computer science and engineering, information technology, embedded systems, bioinformatics, electrical and telecommunication engineering, etc. It is working on various national level research projects under the collaboration of governmental organizations like Ignite National Technology Fund, Higher Education Commission (HEC), Pakistan Science Foundation, Govt. of the Punjab, WAPDA, SNGPL and Rescue 1122. It is also playing its part in regional research development by having a strong collaboration with Asia-Pacific Telecommunity, JICA and Huawei. Besides these, Al-Khawarizmi Institute is also doing joint research projects with international organizations like Mentor Graphics, Microsoft, Global Development Network, Descon, CISCO, Amazon, Nokia and World Bank. It also has many projects under direct supervision of renowned international researchers.\nHistory\nAl-Khawarizmi Institute of Computer Science (KICS) was established in 2002 as an institute to promote applied research in the general domain of discrete and digital systems. Dr. Noor M. Sheikh became its Director whereas Vice Chancellor, UET Lt. Gen. (R) Muhammad Akram Khan as Chairman Board of Governors. Five research groups were established under the umbrella of KICS namely Software Engineering Group, Multilingual Group, The Multimedia Group, Digital Control Systems Group and Computer Communications Group. These groups focused on the applied research in the areas of system design and quality assurance, standardization of integrated development environments, development of algorithms and softwares for multimedia market, digital control systems, and computer telephony integration respectively.\nIn 2006, the research focus of KICS shifted from discrete and digital systems to information technology and computer science. It also established affiliation with Huawei and successfully founded Huawei Lab. An additional research group was added namely High Performance Computing Laboratory. In 2011, KICS also started focusing on technology and incubation centers. Huawei Lab was changed to the Huawei UET Telecom and IT Center and the Center for Language Engineering (CLE) was also created. Initial incubation centers were Hybrid Systems and Resonotech.\nWith the passage of time, more and more research labs were introduced and added in the infrastructure of KICS. It also started focus on applied research in energy optimization and innovation area as well as other modern technologies like android, artificial intelligence, bioinformatics, computer vision and machine learning, data sciences, alternate energy research, IoT, embedded systems, radio frequency, next generation wireless technologies as well as industrial automation and control. Now in 2018, KICS houses more than 20 research labs in different domains of information technology, computer science and engineering. It also has four technology centers. Besides this, it regularly arranges various technical workshops, training, courses and conferences, both at national and international level. It was in 2007 when KICS started focusing on open source technologies and successfully organized its first international conference named as ICOSST (International Conference on Open Source Systems and Technologies). Till now, it has arranged its 10th ICOSST.\nReferences"
    }
  ]
}