{
  "content": [
    {
      "type": "text",
      "text": "# Alan Warde\n\nAlan Warde, FBA, FAcSS (born 18 August 1949) is a British sociologist and academic. He has been Professor of Sociology at the University of Manchester since 1999.\nEducation and career\nBorn in 1949, Warde was educated at Downing College, Cambridge, graduating with a BA in 1971. He then completed an MA at Durham University and carried out doctoral studies at the University of Leeds; his PhD was awarded in 1976 for his thesis \"Ideology, strategy and intra-party division in the British Labour Party, 1956-74\".\nWarde was appointed to a lectureship at Lancaster University in 1978 and was promoted to a readership there in 1994, before becoming a full professor in 1996. In 1999, he was appointed Professor of Sociology at the University of Manchester.\nHonours and awards\nIn 2018, Warde was elected a Fellow of the British Academy, the United Kingdom's national academy for the humanities and social sciences. In 2011, he had also been elected a Fellow of the Academy of Social Sciences.\nPublications\n* Consensus and Beyond: The Development of Labour Party Strategy since the Second World War (Manchester University Press, 1982).\n* (Co-authored with Nicholas Abercrombie) Social Change in Contemporary Britain (Polity, 1992).\n* (Co-authored with Nicholas Abercrombie) Stratification and Social Inequality: Studies in British Society (Framework, 1994).\n* (Co-authored with Nicholas Abercrombie) Family, Household and the Life-Course: Studies in British Society (Framework, 1994).\n* (Co-authored with Mike Savage) Urban Sociology, Capitalism and Modernity (Palgrave, 1993; 2nd ed. with Kevin Ward, 2002).\n* (Co-authored with Stephen Edgell and Kevin Hetherington) Consumption Matters: The Production and Experience of Consumption (Wiley, 1996).\n* Consumption, Food and Taste: Culinary Antimonies and Commodity Culture (Sage, 1997).\n* (Co-authored with Lydia Martens) Eating Out: Social Differentiation, Consumption and Pleasure (Cambridge University Press, 2000).\n* (Edited with Nicholas Abercrombie, Rosemary Deem, Sue Penna, Keith Soothill, Andrew Sayer, John Urry and Sylvia Walby) Contemporary British Society: A New Introduction to Sociology (Polity, 2000).\n* (Edited with Jukka Gronow) Ordinary Consumption (Routledge, 2001).\n* (Edited with Nicholas Abercrombie) The Contemporary British Society Reader (Polity, 2001).\n* (Edited with Stan Metcalfe) Market Relations and the Competitive Process (Manchester University Press, 2002).\n* (Edited with Mark Harvey and Andrew Mcmeekin) Qualities of Food (Manchester University Press, 2004).\n* (Co-authored with Unni Kjaernes and Mark Harvey) Trust in Food: An Institutional and Comparative Analysis (Palgrave Macmillan, 2007).\n* (Co-authored with Tony Bennett, Mike Savage, Elizabeth Silva, Modesto Gayo-Cal and David Wright) Culture, Class, Distinction (Routledge, 2009).\n* The Practice of Eating (Polity, 2016).\n* Consumption: A Sociological Analysis (Palgrave Macmillan, 2017).\nReferences"
    }
  ]
}