{
  "content": [
    {
      "type": "text",
      "text": "# Alan Milward\n\n|birth_date = 19 January 1935\n|birth_place = Stoke-on-Trent, Staffordshire, England\n|death_date =\n|occupation = Historian and academic\n|alma_mater = University College LondonLondon School of Economics\n|doctoral_advisor = William Norton Medlicott\n|workplaces = School of Oriental and African StudiesUniversity of EdinburghUniversity of East AngliaStanford UniversityUniversity of Manchester Institute of Science and TechnologyEuropean University InstituteLondon School of Economics\n|discipline = History\n|sub_discipline =\n|spouse = Frances Lynch\n|doctoral_students = Catherine Schenk\n}}\nAlan Steele Milward  (19 January 1935 – 28 September 2010) was a British economic historian specialising in Western Europe and the United Kingdom in the 20th century.\nOne of the most influential historians of the second half of the twentieth century, Milward's work was well known in Britain, across Europe and beyond. He derived that reputation not from the writing of popular histories or media appearances but from his abilities as a linguist, economic historian, archival researcher, historical narrator and political scientist. He made an essential contribution to the understanding of modern European history and integration: the elements that went to shape contemporary Europe.\nAlthough he is usually seen as an economic historian, Milward also worked in many other fields, including economic theory and policy, political history, and contemporary economic and political studies. He was a very rigorous modern political economist.\nEarly life\nMilward was born and raised in Stoke-on-Trent, where his father was an employee of the Post Office, and attended a grammar school there.\nHe studied medieval and modern history at University College London from 1953 to 1956, gaining a First Class BA degree and then achieved his PhD at the London School of Economics in 1960, with a thesis written under supervision of William Norton Medlicott on the armaments industry in the German economy during the Second World War.\nCareer\nHis first academic placement was the teaching of Indian Archaeology at the School of Oriental and African Studies. In 1960, he was given the position of  assistant lecturer and subsequently lecturer in Economic History at Edinburgh University. In 1965, he advanced to become lecturer and later senior lecturer at the School of Social Studies, University of East Anglia. He then moved to the United States to become an associate professor of economics at Stanford University, returning after three years to become Professor of European Studies at the University of Manchester Institute of Science and Technology between 1971 and 1983. He was then a professor at the European University Institute in Florence for two terms, between 1983 and 1986 and between 1996 and 2002.\nFrom 1986 to 1996, he was Professor of Economic History at the London School of Economics. In 1993, he was given the position of official historian at the Cabinet Office, and he produced the first volume of the Government Official History of the United Kingdom and the European Community, The Rise and Fall of a National Strategy 1945–1963, published in 2002.\nHe was elected a fellow of the British Academy in 1987 and fellow of the Royal Norwegian Society of Sciences and Letters in 1994.\nHe gained a reputation for his ability to articulate and sustain his theses, which differed considerably from the received wisdom, and to refute arguments against his position. His interpretations caused widespread debate and discussion. An example was his minimalist contention that the Marshall Plan had been less crucial than often supposed in stimulating postwar European reconstruction or persuading former antagonists to work together.\nIn his book The European Rescue of the Nation State (1992), he also challenged the eurosceptic doctrine that the European Union would involve an integration of nation-states that would undermine sovereignty and lead to a federalist superstate. He influenced many historians and political scientists, not least Andrew Moravcsik's Choice for Europe.\nHe had a gift for languages, becoming fluent in Norwegian, German, Italian and French.\nAs well as several monographs, Milward wrote reviews of a vast number of books which bore some relation to his fields of expertise, collected in Alan S. Milward and Contemporary European History: Collected Academic Reviews, eds. F. Guirao and F. Lynch (Routledge, 2015).\n]]\nHe died on 28 September 2010 after a three year illness and was buried on the eastern side of Highgate Cemetery.\nHis life's work was reviewed in depth in Alan S. Milward and a Century of European Change, eds. F. Guirao, F. Lynch, & S. M. R. Perez (Routledge, 2012). [https://www.routledge.com/Alan-S-Milward-and-a-Century-of-European-Change/Guirao-Lynch-Ramirez-Perez/p/book/9780415878531]\nPersonal life\nHis second marriage was to Frances MB Lynch, a historian of the economies of France and Europe.\nWorks\n* The German Economy at War (1965)\n* The New Order and the French Economy (1970)\n* The Economic Effects of the Two World Wars on Britain (booklet) (1971; revised and republished 1984)\n* The Fascist Economy in Norway (1972)\n* War, Economy and Society, 1939–1945 (1977, republished 1987; originally published as Krieg, Wirtschaft und Gesellschaft, Munich, 1976)\n* The Reconstruction of Western Europe, 1945–51 (1984; republished 1987)\n* The European Rescue of the Nation-State (1992)\n* The Frontier of National Sovereignty: History and Theory, 1945–92 with Ruggero Ranieri and Frances M.B. Lynch (1994)\n* ''Britain's Place in the World: A Historical Enquiry into Import Controls 1945–60 (Routledge Explorations in Economic History) with George Brennan (1996)\n* Politics and Economics in the History of the European Union (The Graz Schumpeter Lectures) (2005, reprinted 2012)\n* The Rise and Fall of a National Strategy: The UK and The European Community: Volume 1 (2002, republished 2012)\n* The Economic Development of Continental Europe 1780–1870 with S. Berrick Saul (1973; republished 2012)\n* The Development of the Economies of Continental Europe 1850–1914 with S. Berrick Saul (1977; republished 2012)\nReferences\n* Kristine Bruland, [https://www.thebritishacademy.ac.uk/sites/default/files/15%20Milward%201808.pdf ‘Alan Steele Milward (1935–2010)’], Proceeds of the British Academy, Volume 130, Biographical Memoirs of Fellows of the British Academy, XIII'', pp.&nbsp;353–362, Oxford, Oxford University Press, 2004.\nExternal links\n*\n*"
    }
  ]
}