{
  "content": [
    {
      "type": "text",
      "text": "# Alan Keyes 2000 presidential campaign\n\n}}\n| fec_date     =\n| slogan       = Keyes to the White House\n| themesong    =\n| chant        =\n| website      = [https://web.archive.org/web/20000823200816/http://keyes2000.org/ Keyes 2000](archived – Aug. 23, 2000)\n}}\nThe 2000 presidential campaign of Alan Keyes, former Assistant Secretary of State for International Organization Affairs from Maryland began when he formed an exploratory committee, simply called Keyes 2000, on June 17, 1999, with a formal announcement on September 21, 1999 in Bedford, New Hampshire. He ran in the 2000 presidential primaries, opposing Texas governor George W. Bush and Arizona Senator John McCain for his party's nomination. Keyes campaigned as a more ideologically consistent candidate than John McCain, taking right-wing positions on issues, including abortion, gun control, and government spending.\nHistory\nBackground\nIn 1996 Alan Keyes sought the Republican nomination, but his opponents, pundits and many in the Republican party saw him as a divisive and fringe figure in the party due to him spending most of his time in the debates to ask his opponents what their views on abortion were. His campaign was also hurt by the belief that he was a stalking horse as he entered the race after Buchanan had secured victories in New Hampshire and Louisiana. Keyes would end up only receiving 3.08% of the vote and one delegate. In 1998 Keyes expressed interest in running for president again in 2000, but was largely ignored as Elizabeth Dole, John McCain, George W. Bush, Steve Forbes and other more prominent Republicans announced their campaigns and since he wasn't considered a serious candidate after many embarrassments in 1996.\nRise\nKeyes was originally considered unimportant when he announced his campaign in September due to his numerous failed campaigns in the past, but as candidates started to drop out Keyes's poll numbers started to increase, most importantly in Iowa, due to his constant campaigning in Iowa and the fact that John McCain chose to skip the Iowa caucus and focus on the New Hampshire primary instead. On January 7, 2000 Keyes participated in the Republican debate in Columbia, South Carolina where according to some outlets won or came ahead of McCain. On January 24, the Alaska and Iowa caucuses were held with Alan Keyes coming narrowly in third by only .03% to Bush and McCain in Alaska and third place in front of McCain in Iowa, exceeding what he was expected to receive. After his strong showings in both Alaska and Iowa news outlets began stating that the momentum he gained, his seamless unending rhetoric and his growing campaign contributions will carry him through New Hampshire.\nDecline\nAfter performing well in the Iowa Caucus and in the debates and drawing crowds that rivaled Bush's in size many pundits began to believe that Keyes could achieve the Republican nomination if he had a strong showing in New Hampshire. However, it floundered, due to Senator John McCain's strong campaigning in New Hampshire and his infamous mosh pit moment in Iowa on February 1, Keyes came in fourth and received zero delegates. For the rest of the primaries Keyes would only come close to or defeat McCain five times and would always come in a distant second to Bush after McCain dropped out.\nResults\nOn July 25, 2000 Alan Keyes ended his campaign during the National Convention after he received 985,819 votes and 22 delegates. After the roll call vote his delegate number fell to six, ironically defeating John McCain, the man who doomed his campaign, by five delegates.\nPopular vote result:\n* George W. Bush - 12,034,676 (62.00%)\n* John McCain - 6,061,332 (31.23%)\n* Alan Keyes - 985,819 (5.08%)\n* Steve Forbes - 171,860 (0.89%)\n* Unpledged delegates - 61,246 (0.32%)\n* Gary Bauer - 60,709 (0.31%)\n* Orrin Hatch - 15,958 (0.08%)\n{| class=\"wikitable\" style=\"font-size:95%;\"\n! colspan=\"3\" | Republican National Convention presidential vote, 2000\n|-\n! style=\"width: 17em\" |Candidate\n! style=\"width: 5em\" |Votes\n! style=\"width: 7em\" |Percentage\n|-\n| George W. Bush\n| align=\"right\" | 2,058\n| align=\"right\" | 99.61%\n|-\n| Alan Keyes\n| align=\"right\" | 6\n| align=\"right\" | 0.29%\n|-\n| John McCain\n| align=\"right\" | 1\n| align=\"right\" | 0.05%\n|-style=\"background:#EEEEEE;\"\n| align=\"right\" | Abstentions\n| align=\"right\" | 1\n| align=\"right\" | 0.05%\n|-style=\"background:#EEEEEE;\"\n| align=\"right\" | Totals\n| align=\"right\" | 2,066\n| align=\"right\" | 100.00%\n|}\nAftermath\nChris Jones, Keyes’ national field director, said during the New York primary that “The message is why he’s running,” he says, adding that wins in the primaries may not be in the cards, but, “there are other races to be won — school boards, for example. [Those races] need to be won by people who have heard Alan Keyes speak.” Louis P. Wein a Constitution party candidate for New York's Senate in 2000 that was endorsed by Keyes came in second to last with 0.05%, only defeating the Socialist Workers Party`s candidate by 0.01%. Alan Keyes would later run for Senator of Illinois in 2004 losing to future president Barack Obama and in 2008 he ran for the Republican and Constitution parties nomination and eventually became the America's Independent Party nominee, where he received 47,941 votes.\nEndorsements\nDue to his rather small role in the early part of the Republican Primaries, Keyes only managed to receive one endorsement from Representative Tom Coburn from Oklahoma\nPolitical positions\nAn important factor in Keyes political beliefs has been his staunch belief that the United States needs to be religious and stop its moral decay in order for it to improve its domestic affairs.\nOn abortion, Keyes stated that \"If the Declaration of Independence states our creed, there can be no right to abortion, since it means denying the most fundamental right of all, to human offspring in the womb\" and that \"Medical procedures resulting in the death of an unborn child, except as a collateral and unintended consequence of efforts to save the mother's physical life, are therefore impermissible.\"\nOn the issue of taxes, Keyes was firmly against the \"income tax stating that it is a failed twentieth-century socialist experiment\" and \"that it makes us vassals of the government\", he believed that the income tax should be replaced by a 23% national sales tax saying that \"the present tax system which allows you to escape taxation if your wealthy enough to hire accountants and lawyers is what disapportly hits the poor and working class people of this country.\"\nKeyes was firmly against welfare believing that \"family-destroying welfare system and sex-education courses encourage promiscuity” and that \"these programs actually hasten the moral breakdown.\"\nKeyes has been consistent on the issue of prayer in school and has believed that \"the doctrine of \"separation of church and state\" is a misinterpretation of the Constitution. The First Amendment prohibition of established religion aims at forbidding all government sponsored coercion of religious conscience. It does not forbid all religious influence upon politics or society.\"\nReferences"
    }
  ]
}