{
  "content": [
    {
      "type": "text",
      "text": "# Albanian traditional tattooing\n\n; .}}\nTattooing among Albanians is a long-standing tradition that has been practiced since Illyrian times, kept alive in the mountainous areas of the western Balkans. Traditional tattooing has also been practiced by Catholics in Bosnia and Herzegovina and Dalmatia (Sicanje), and by women of some Vlach communities (in the western Balkans).\nHistory\nBased on the writings of ancient authors such as Herodotus (5th century BC), Cicero and Strabo (1st century BC), whose statements are also confirmed by archaeological findings, ethnographic studies have concluded that the practice of tattooing among the peoples of the Balkan peninsula was known since ancient times. This practice was found among the Illyrian and Thracian tribes, who used tattooing to distinguish tribal origins.\nfunerary stele from Apulia.]]\nLong bronze needles with wooden handles found in Glasinac and Donja Dolina  are considered to have been tools for practicing tattoos. Early figurative representations of this ancient Balkan tradition are found in Apulia, southeast Italy, in the material culture of the Daunians, who were of western Balkan provenance. The custom of tattooing among Daunians can be detected in Daunian stelae and in matt-painted ollae. It can also be conceivably identified on the wall of a late 4th-century tomb chamber from Arpi, in which a painting shows tattoos on the arms of the 'priestess' riding a quadriga. Daunian material culture shows that among them forearms were the most common tattooed parts of the body.\nIn the Graeco-Roman world tattooing was conceived as a barbaric custom that was used exclusively for punitive or ownership purposes, but the ancient Balkan peoples' perception of tattooing was different, as it was a deep and long-standing cultural embodiment distinguishing them from other cultures. The writings of ancient authors show that in the Balkans tattooing was in the purview of the elites. Iconographic and literary sources reveal in particular that it was especially practiced by the female members of society.\nThe tattooing practice is most often found in preliterate tribal communities, with women playing the chief role in this custom, both performing the ritual of applying tattoos and wear them. Among other things the tattoos may have been a symbol of sexual maturity, ancestry and tribal affiliations, as well as religious beliefs. In the western Balkans, isolated from outside influences, the practice of tattooing continued until the early 20th century in Albania and Bosnia, regions that in antiquity were part of the area of Illyria.\nDocumentation\n19th century\nAlbanian traditional tattooing with Sun (Dielli) and Fire (Zjarri) symbols, originally hand-drawn by J. C. Murray-Aynsley [Harriet Georgiana Maria Murray-Ainsley] (1827-1898), were published in 1891 in the journal Ars Quatuor Coronatorum (volume IV), in a study about the swastika.\n20th century\nEdith Durham's research\nIn the first half of the 20th century, British anthropologist Edith Durham visited northern Albania and other areas of the western Balkans, in particular collecting and studying cultural and folklore material of the Albanian tribal society.\nDurham found that in Bosnia tattooing was a practice restricted to the Catholic Slavic population, while the Orthodox Slavic population abhorred this practice, considering it \"Latin\". On the other hand, Durham found that in northern Albania it was widespread among Albanians regardless of their Catholic or Muslim faith.\nDurham reported that girls were tattooed on March 19, which falls in the days of the Albanian spring celebrations.\nPatterns\n; ; .\n}}\nThe most common patterns of Albanian traditional tattoos are suns (also stars), moons (also crescents), and crosses. Many of them also appear on Albanian traditional art (graves, jewellery, embroidery, and house carvings). They represent celestial, light, fire and hearth worship, expressing the favor of the light within the dualistic struggle between light and darkness in Albanian mythology.\nEdith Durham, who extensively studied Balkan traditional tattooing with fieldwork research, was able to thoroughly explain the patterns of traditional tattoos only after asking to Albanians of Thethi–Shala for a description of all the little lines (or twigs) that accompanied a semicircle incised on an old gravestone. They answered that those twigs were \"the light coming from the Moon, of course\". For Albanians, the twigs or little lines were the traditional way to represent light, emanated from the Sun (Dielli) and from the Moon (Hana), which was often represented as a crescent. So, the patterns of Catholic tattoos in Bosnia, which until then were known as \"circles, semicircles, and lines or twigs\", eventually were clearly explained as compounds of rayed (emanating light) suns, moons, and crosses, from an expression of Nature-worship and hearth-worship. Furthermore, the crosses (including swastikas) have been explained by scholars as symbols of the deified Fire (Zjarri), and in particular of the fire god Enji, who evidently was the most prominent god of the Albanian pantheon in Roman times by interpreting Jupiter, when week-day names were formed in the Albanian language as thursday () was dedicated to him.\nGeographic distribution\nEdith Durham provided information about tattooing in northern Albania, but 20th century ethnographic research found that traditional tattooing was widespread throughout Albanian inhabited territories.\nSee also\n* Albanian folklore\n* Albanian paganism\n* Culture of Albania\nReferences\nBibliography\n*\n*\n*\n*\n*\n*\n*\n*"
    }
  ]
}