{
  "content": [
    {
      "type": "text",
      "text": "# Albanian war dances\n\nAlbanian war dances ( or ) are war dances performed by the Albanian people. They have been historically performed before Albanians' departure for the battle front, but in recent times they have been traditionally performed during particular events and feasts. The war dances differ in both form and content according to the Albanian ethnographic area.\nWar dance in circle around fire\n), drawing from the book ''Childe Harold's Pilgrimage'' written by Lord Byron  in the early 19th century.]]\nEarly descriptions of the Albanian war dance in circle around fire was provided in the early 19th century by western travellers who visited southern Albania. The dance is practiced for several hours with very short intervals, acquiring new vigour from the words of the accompanying song that starts with a battle cry invoking war drums, and which is of a piece with the movement and usually changed only once or twice during the whole performance.\nThe ritual purifying fire (Zjarri) is traditionally used by Albanians, in particular singing and dancing around it, to gain protection and energizing from its supernatural power.\nSword dance\nThe Albanian sword dance type has been commonly performed in the northern Albanian highlands. From there this type of dance spread in the lowlands of the Lezha area and the Mati valley by the mountain shepherds. In its primordial form it is danced silently with free-flowing, only following the rhythmic movements of the body that are improvised by the dancer(s) (hence without instrumental music or vocals). Sword dances are also those performed in certain areas of northwestern Kosovo, which are accompanied by instrumental music and referred to as \"contest to win the maid\". Also the Albanians of Italy – the Arbëreshë – perform the sword dance, albeit in a different way. Into the late 1400s Albanian sword dances were imitaded by Italian tarantellas.\nThe Albanian folk tale \"Skanderbeg and Ballaban\" narrates about the Albanian sword dance, which is sung and danced by Skanderbeg's soldiers before battle.\nSword dance of Rugova\nThe Rugova war dance ( or Loja Luftarake e Rugovës) is a traditional Albanian sword dance named after the Rugova region in Kosovo.\nRugova dance is a relic of the war dances, the remnants of pantomimic dances performed in the re-enactment or preparation of battles.\nThe dance is performed by two male dancers who fight a mock battle for the hand of a girl (a \"maiden's dance\").\nIt was made internationally famous by the Kosovo Albanian Rugova clans (hailing from Kelmend in Albania). The dance is also found in mountainous Montenegro, where a tribe of shepherds settled in the 18th century. Based on the war dance of the Rugova clans, Slavko Kvasnevski created in 1971 the Rugova choreography, which was part of Yugoslav folk dancing ensemble. In 1982, it was noted that \"in the last time the Rugova dance has gained wide popularity\".\nSee also\n*Albanian tribes\nReferences\nBibliography\n*\n*\n*\n*\n*"
    }
  ]
}