{
  "content": [
    {
      "type": "text",
      "text": "# Albanian invasion of Epirus (1411–1412)\n\ntemplate -->\n| map_type          =\n| map_relief        =\n| map_size          =\n| map_marksize      =\n| map_caption       =\n| map_label         =\n| territory         =\n| result            = Albanian victory\n| status            =\n| combatants_header =\n| combatant1        =  Despotate of ArtaPrincipality of Gjirokastër\n| combatant2        =  Despotate of Epirus\n**  Tocco family\n| combatant3        =\n| commander1        =  Muriq Bua ShpataGjon Zenebishi\n| commander2        =  Carlo I Tocco Leonardo II Tocco Symeon Strategopoulos (WIA)\n| commander3        =\n| units1            =\n| units2            =\n| units3            =\n| strength1         =  Unknown\n| strength2         =  Unknown\n| strength3         =\n| casualties1       =\n| casualties2       =\n| casualties3       =\n| notes             =\n| campaignbox       =\n}}\nThe Albanian invasion of Epirus (1411–1412) was a military campaign led by Albanian chieftains Gjon Zenebishi, Lord of Gjirokastër, and Muriq Bua Shpata, Despot of Arta, against the Despotate of Epirus.\nBackground\nIn April 1399, Esau de' Buondelmonti, the Despot of Epirus, launched an invasion of the Principality of Gjirokastër. His forces were defeated in battle by Albanian troops led by Gjon Zenebishi, leading to his capture. De' Buondelmonti was held for ransom and remained in captivity until his release in June 1400, for 10,000 ducats.\nOn 6 February 1411, following the death of Esau de' Buondelmonti, his widow attempted to assume control of the Despotate of Epirus. Upon learning of her intentions to marry a Serbian noble, the people rejected her claim. On 26 February, the citizens of Ioannina revolted, exiled her, and invited Carlo I Tocco to become their new ruler. Tocco arrived in Ioannina on 1 April 1411, and assumed control of the city.\nInvasion\nUpon hearing of Carlo I Tocco's rise to power, Muriq Bua Shpata and Gjon Zenebishi, feeling threatened, formed an alliance despite their rivalry; this pact was solidified by the marriage of Muriq's daughter to Gjon's son. From his camp at Pratokai, north of Ioannina, Carlo launched raids against Gjon Zenebishi’s territories, including Lachanokastron, and also invaded the Despotate of Arta.\nIn response, the two Albanian rulers united their armies and engaged Carlo's forces in battle during the spring or summer of 1412. Carlo dispatched his brother, Leonardo II, to estimate the size of the Albanian army, discovering that they were outnumbered nearly four to one. The Epirote army, led by Carlo I Tocco, Leonardo II, and Symeon Strategopoulos, advanced to the plain of Kranea, south of Mesopotamon, where they were surrounded and nearly annihilated. Symeon was wounded but escaped, while Carlo and Leonardo retreated to Ioannina. After this decisive victory, the Albanian forces marched to Ioannina and laid siege to the city but ultimately failed to capture it.\nAftermath\nAfter the war, a scandal involving Gjon Zenebishi’s son and Muriq Bua Shpata’s son-in-law led to a feud that collapsed their alliance. Carlo I Tocco capitalized on this rift, securing peace with Zenebishi, the region’s most powerful ruler.\nIn 1414, Muriq died, and soon after, the Ottoman Empire invaded Zenebishi’s lands, forcing him into exile on Corfu, where he remained until his death in 1418.\nReferences"
    }
  ]
}