{
  "content": [
    {
      "type": "text",
      "text": "# Albert King (basketball)\n\n| birth_place = Brooklyn, New York, U.S.\n| height_ft = 6\n| height_in = 6\n| weight_lb = 190\n| high_school =\n| college = Maryland (1977–1981)\n| draft_year = 1981\n| draft_round = 1\n| draft_pick = 10\n| draft_team = New Jersey Nets\n| career_start = 1981\n| career_end = 1991\n| career_position = Small forward / shooting guard\n| career_number = 55, 17, 15\n| years1 = –\n| team1 = New Jersey Nets\n| years2 =\n| team2 = Philadelphia 76ers\n| years3 =\n| team3 = San Antonio Spurs\n| years4 = 1989\n| team4 = Olimpia Milano\n| years5 = 1990\n| team5 = Hapoel Holon\n| years6 = 1990–1991\n| team6 = Albany Patroons\n| years7 =\n| team7 = Washington Bullets\n| highlights =\n* LBA champion (1989)\n* CBA Newcomer of the Year (1991)\n* Consensus second-team All-American (1980)\n* Second-team All-American – UPI (1981)\n* Third-team All-American – NABC (1981)\n* ACC Player of the Year (1980)\n* First-team All-ACC (1980)\n* Second-team All-ACC (1981)\n* ACC tournament MVP (1980)\n* Mr. Basketball USA (1977)\n* 2× First-team Parade All-American (1976, 1977)\n* McDonald's All-American (1977)\n* Fourth-team Parade All-American (1975)\n| stats_league = NBA\n| stat1label = Points\n| stat1value = 6,470 (12.1 ppg)\n| stat2label = Rebounds\n| stat2value = 2,262 (4.2 rpg)\n| stat3label = Assists\n| stat3value = 1,171 (2.2 apg)\n}}\nAlbert King (born December 17, 1959) is an American former professional basketball player. The younger brother of former NBA scoring champion and  Hall of Famer Bernard King, Albert played at Fort Hamilton High School in Brooklyn and is regarded as one of the nation's greatest high school players of all time. He was rated the top prep player in the nation over Magic Johnson and Gene Banks during his senior year. A  guard-forward from the University of Maryland, King was selected by the New Jersey Nets in the first round (10th overall) of the 1981 NBA draft. King played in nine NBA seasons for four teams.\nEarly life\nKing attended Fort Hamilton High School in Brooklyn, New York. He was named to the inaugural McDonald's All-American team, which played in the 1977 Capital Classic.\nCollege career\nIn the 1979–80 college season, King was named the ACC Men's Basketball Player of the Year. He appeared on the cover of Sports Illustrated twice during the 1980 season. One of the highlights of his ACC career was a thundering dunk over Duke center Mike Gminski during a Maryland home game at Cole Field House. Duke was the first-seeded team in the nation at the time, and King went on to lead the Terrapins in scoring that night and helped defeat the Blue Devils 101–82. His no. 55 jersey was honored by the Maryland basketball program. In 2002, King was named to the ACC 50th Anniversary men's basketball team as one of the fifty greatest players in Atlantic Coast Conference history.\nProfessional career\nKing played in nine NBA seasons for four teams. He played for the New Jersey Nets, Philadelphia 76ers, San Antonio Spurs and Washington Bullets. King's best years as a professional came during his playing days with the Nets from 1981 to 1987. During the 1982–83 season, he appeared in 79 games and averaged 17.0 points per game and 3.7 assists per game. In his NBA career, he played in 534 games and scored a total of 6,470 points.\nAt the end of the 1988–89 season, he was signed by Olimpia Milano of the Italian Basketball League to replace Billy Martin. In Milan he played the last two games of the regular season and the following 12 of the postseason. Alongside some very experienced players such as Bob McAdoo, Mike D'Antoni and Dino Meneghin, he gave an essential contribution for winning the title in a very contested last game of the finals, scoring a season-high 22 points.\nDuring the second half of the 1989–90 season, King played for Hapoel Holon of the Israeli Basketball League. In just 11 games he scored an average of 22.8 points per game including a 23-point game against Israeli powerhouse Maccabi Tel Aviv. The team finished the season in the seventh place and King left.\nKing spent the 1990–1991 season playing in the Continental Basketball Association with the Albany Patroons, coached by George Karl, where he was named the CBA Newcomer of the Year.\nHe returned to the NBA again in September 1991, when he signed with the Washington Bullets. He was waived by the Bullets in November after appearing in 6 games where he averaged 5.2 points per game.\nPersonal life\nHe is the younger brother of former NBA scoring champion, Bernard King. They grew up in the Fort Greene neighborhood of Brooklyn. Two of his older brothers also played college basketball, Thomas for West Virginia Wesleyan and Ronald for Miami Dade Junior College.\nHe is also one of the central personalities in Rick Telander's acclaimed book Heaven is a Playground.\nIn the 1990s, he hosted ''Nets Slammin' Planet'' with Evan Roberts, Brandon Scoop B Robinson and Chris Carrino.\nFollowing his basketball career, King opened several Wendy's restaurants.\nReferences\nExternal links\n* [https://www.basketball-reference.com/players/k/kingal01.html Albert King NBA stats] at Basketball-Reference\n}}"
    }
  ]
}