{
  "content": [
    {
      "type": "text",
      "text": "# Albert Edward McPhillips\n\n| birth_place=Ohio City, York County, Canada West\n| death_date=\n| death_place=Victoria, British Columbia, Canada\n| spouse= Sophia Emily Davie\n| children= 3, including Albert DeBurgo\n| relations=\n| residence=Cloonmore House,  Rockland Avenue, Victoria, British Columbia\n| office           = Member of the Legislative Assembly of British Columbia\n| predecessor      =Thomas Wilson Paterson\n| successor        =William Wasbrough Foster\n| term_start       = 1907\n| term_end         =1913\n| constituency=The Islands\n| predecessor2      =\n| successor2        =\n| term_start2       = 1898\n| term_end2         =1903\n| constituency2=Victoria City\n| alongside2=Richard HallHenry Dallas HelmckenJohn Herbert Turner\n| office3=Attorney General of British Columbia\n| predecessor3      =David McEwen Eberts\n| successor3        =Charles Wilson\n| term_start3       =June 4, 1903\n| term_end3         =November 5, 1903\n| alma_mater =St. Boniface CollegeManitoba College\n| profession=\n| footnotes=\n| website=\n|}}\nAlbert Edward McPhillips (21 March 1861 – 24 January 1938) was a Canadian politician and a barrister.\nEarly years\nHe was the son of George McPhillips (born County Monaghan, 1805–1878) and Margaret Lavin (born County Armagh), both of whom were Irish and he was the youngest of six boys. His father and three brothers were land surveyors.  His brother, George McPhillips Jr. (1848–1913) is commemorated by McPhillips Street in Winnipeg.\nMilitary service\nMcPhillips held a second class certificate from Toronto School of Infantry. He was a lieutenant in the 90th Battalion, Royal Winnipeg Rifles, during the North-West Rebellion in 1885. He fought at the Battle of Fish Creek and Battle of Batoche and received a medal bar and clasp. He retired in 1890 with the rank of captain.\nLaw and political career\nMcPhillips was called to the Bar in Manitoba, in Trinity Term in 1882, and to the Bar of British Columbia in 1891. He was a member of Legislative assembly for British Columbia, serving Victoria City from 1898 to 1903, and The Islands from 1907 to 1912.  He was Attorney General of British Columbia, resigning on 5 November 1903. McPhillips sat on the British Columbia Court of Appeal as a judge from 1913, serving up until his death in 1938.\nPersonal life\nIn 1896, he married Sophia Emily Davie, daughter of the late Hon. A.E.B. Davie Q.C. and had 3 children. His youngest son Albert McPhillips was also a barrister and politician.\nArms\n}}\nReferences"
    }
  ]
}