{
  "content": [
    {
      "type": "text",
      "text": "# Albrey Battle\n\n| birth_place   = Grand Rapids, Michigan, U.S.\n| height_ft     = 6\n| height_in     = 4\n| weight_lbs    = 204\n| high_school   = Poway (Poway, California)\n| college       = Arizona State\n| undraftedyear = 1999\n| pastteams     =\n* Tennessee Titans ()*\n* San Jose SaberCats (–)\n* San Francisco Demons (2001)\n* Arizona Rattlers ()\n| aflstatlabel1 = Tackles\n| aflstatvalue1 = 47.5\n| aflstatlabel2 = Sacks\n| aflstatvalue2 = 7.5\n| aflstatlabel3 = Pass deflections\n| aflstatvalue3 = 7\n| aflstatlabel4 = Receptions\n| aflstatvalue4 = 5\n| aflstatlabel5 = Receiving TDs\n| aflstatvalue5 = 2\n| afl           = 2239\n| highlights    =\n* 2× ArenaBowl champion (XVI, XVIII)\n}}\nAlbrey Battle (born October 21, 1976) is an American former professional football defensive lineman who played eight seasons in the Arena Football League (AFL) with the San Jose SaberCats and Arizona Rattlers. He played college football at Arizona State University. He was also a member of the Tennessee Titans and San Francisco Demons.\nEarly life\nBattle played high school football at Poway High School in Poway, California. He earned all-CIF honors as an offensive lineman his senior year as the Titans finished with an 11–2 record and the Palomar League championship.\nCollege career\nBattle started 27 of 41 career games for the Arizona State Sun Devils. In his Arizona State career, 32 of his 105 total tackles were for a loss.\nProfessional career\nBattle signed with the Tennessee Titans after going undrafted in the 1999 NFL draft. He was released before the start of the season.\nTable played for the San Jose SaberCats of the Arena Football League (AFL) from 2000 to 2006, winning ArenaBowl XVI and XVIII.\nBattle spent the 2001 season with the San Francisco Demons of the XFL.\nBattle played his last season with the Arizona Rattlers of the AFL in 2007.\nPersonal\nNBA All-Star Sidney Moncrief is Battle's uncle.\nReferences\nExternal links\n* [http://www.justsportsstats.com/footballstatsindex.php?player_id=battlalb001&recsort=4 Stats Crew profile]"
    }
  ]
}