{
  "content": [
    {
      "type": "text",
      "text": "# Alderley, Queensland\n\n| pop                 = 6748\n| pop_year            =\n| pop_footnotes       =\n| established         = 1878\n| postcode            = 4051\n| area                = 2.5\n| timezone            = AEST\n| utc                 = +10:00\n| dist1               = 7.2\n| dir1                = N\n| location1           = Brisbane CBD\n| lga                 = City of Brisbane(Enoggera Ward and Marchant Ward)\n| stategov            = Stafford\n| stategov2           = Ferny Grove\n| fedgov              = Brisbane\n| near-n              = Stafford\n| near-ne             = Stafford\n| near-e              = Grange\n| near-se             = Newmarket\n| near-s              = Ashgrove\n| near-sw             = Ashgrove\n| near-w              = Enoggera\n| near-nw             = Enoggera\n}}\nAlderley is a northern suburb in the City of Brisbane, Queensland, Australia. In the , Alderley had a population of 6,748 people.\nGeography\nAlderley is  north-west of the Brisbane CBD. It is surrounded by Newmarket in the south, Ashgrove and Enoggera in the west, Grange and Stafford in the east and Kedron and Everton Park in the north. At the , it had a population of 5,068.\nHistory\n, 2015]]\nThe area is the traditional lands of the Turrbal clan of the Mianjin Australian Aboriginal people, who lived there long before British settlement. Corroborees were held at Sedgeley Park estate.\nThe name Alderley derives from Alderley Edge in Cheshire, England. Alderley is an older suburb, having had a post office since 1878 and a railway station since 1899.\nOn 19 April 1890, auctioneers G. T. Bell offered 296 residential lots (mostly 16 perches) in Alderley Park Estate on Hall Street, Alderley Street and Wakefield Street with South Pine Road to the west. The estate was diagonally opposite the Alderley Arms Hotel. At the time of sale, the Ferny Grove railway line had not yet been built however the proposed railway route line is marked on the land sale advertisement. Hall Street now terminates at the Alderley railway station instead of continuing through to South Pine Road as it was in 1890. At the auction, only 51 of the 296 lots were sold for an average price of  for a total of .\nOn 14 March 1914, auctioneers Isles, Love & Co offered 86 residential lots (mostly 16 perches) in the Green Hills Estate bounded by Lloyd Street to the north, Cole Street to the east and both sides of Elfreda Street.\nOn 29 October 1921, auctioneers Blocksidge & Ferguson offered 232 residential allotments of 18 and 22 perches in the Smyth's Hill Estate bounded by Longsight Street to the north, Raymont Road to the south, Longsight Street to the west and Mornington Street to the east. (Mornington Street does not exist in this far south due to the subsequent development of Alderley Grove Park.)\nOn 17 June 1922, auctioneers Cameron Bros offered 53 residential sites of mostly 16 perches in Hall Street, Alderley Avenue and Wakefield Streets.\nOn 2 October 1937, auctioneers Isles, Love & Co offered 26 residential sites ranging from 24 to 31 perches in Section 2 of the Manwaring Estate on Goskar Avenue and Banks Road.\nGrange Heights Methodist Church opened on Saturday 23 February 1946 at 26 Progress Road (). It became Grange Heights Uniting Church. It closed between 1975 and 1990. The building still exists and is used as a childcare centre.\nTrams operated by the Brisbane City Council ran to the suburb between 1949 and 1968.\nDemographics\nIn the , Alderley recorded a population of 5,679 people, 51.1% female and 48.9% male. The median age of the Alderley population was 33 years, 4 years below the national median of 37.  78.5% of people living in Alderley were born in Australia, compared to the national average of 69.8%; the next most common countries of birth were England 3.1%, New Zealand 2.7%, India 1.1%, Nepal 0.9%, South Africa 0.6%.  88.4% of people spoke only English at home; the next most popular languages were 1% Nepali, 0.8% Italian, 0.7% Spanish, 0.6% Korean, 0.5% Cantonese.\nIn the , Alderley had a population of 6,117 people.\nIn the , Alderley had a population of 6,748 people.\nHeritage listings\n, 1932]]\nAlderley has a number of heritage-listed sites, including:\n* 16 Quarry Road: Strathearn\n* 39 David Street: Farrington House\n* 117 Mina Parade: Newmarket Brickworks Chimney\nEducation\nThere are no schools in Alderley. The nearest government primary schools are Enoggera State School in neighbouring Enoggerra to the west, Wilston State School in neighbouring Grange to the east, Newmarket State School in neighbouring Newmarket to the south-east, and Oakleigh State School in neighbouring Ashgrove to the south-west. The nearest government secondary schools are Everton Park State High School in Everton Park to the north and Kelvin Grove State College in Kelvin Grove to the south-east.\nAmenities\nAlderley has several warehouses, a police station and a community-based shopping complex that includes a supermarket. There are also a number of parks in the suburb:\n* Alderley Grove Park ()\n* Banks Street Reserve ()\n* Bermingham Street Park ()\n* Greenhills Park ()\n* Grinstead Park ()\n* Quarry Park ()\n* Sedgley Park ()\n* Shand Street Park ()\n* Willmington Park ()\nReferences\nSources\n* http://www.brisbanecity.com.au/alderley\n* http://queenslandplaces.com.au/alderley\n*Savills - \"Brisbane's Rich History\"\nExternal links\n*\n*\n*\n*[http://hdl.handle.net/10462/deriv/63386 Alderley Theatre] This image is held by the State Library of Queensland image number 20340"
    }
  ]
}