{
  "content": [
    {
      "type": "text",
      "text": "# Aldy-Bel culture\n\n), and main contemporary polities }}||Map of the Sakas.png|none}}\n|mapalt      =\n|altnames    =\n|horizon     =\n|region      = South Siberia\n|period      =\n|dates       = 7th to 6th centuries BCE.\n|typesite    =\n|majorsites  =\n|extra       =\n| precededby  = Arzhan culture\n| followedby  = Sagly-Bazhy culture, Pazyryk culture, Tagar culture}}\nThe Aldy-Bel culture ( ''Aldy-Bel'skaya'' kul'tura) was part of Uyuk culture ( Uyukskaya kul'tura), and is an Iron Age culture of Scytho-Siberian horse nomads in the area of Tuva in southern Siberia, dated to the 8th to 6th centuries BCE.\nMonuments of the Aldy-Bel culture were identified by A.D. Grach and I.U. Sambu and published in 1971. The culture is named after the site of the Aldy-Bel I kurgan. More than 30 kurgan burial complexes are identified within the Aldy-Bel culture.\nThe culture was contiguous with the nomadic Pazyryk culture in the area of Altai Mountains in South Siberia.\nThe monuments of the Aldy-Bel culture are synchronous and in many respects similar with those of the Mayemir culture in the Altai region and the Tasmola culture of Central Kazakhstan. The geographical spread covers the right bank of the Yenisei south of the Uyuk ridge, the Khemchik River, deep into the Sayan Canyon and the Western Sayan. Typologically, the monuments are adjacent to similar kurgan burials in different areas of Tuva.\nD.G. Savinov theorizes that, at the end of the 8th or beginning of the 7th century BCE, the Aldy-Bel people were part of the Arzhan tribal union that formed the Aldy-Bel culture and was headed by a ruling dynasty. The Arzhan royal kurgan is located in the area south of the Uyok ridge and is connected by passages with the main area of the Aldy-Bel culture. The proximity of the Aldy-Bel tribes probably accounted for close ethnic connections of the Arzhan people with the Aldy-Bel people. After the fall of the Arzhan tribal alliance, the Aldy-Bel people retained their independence for a long time, at least throughout 8th and 6th centuries BC, but because of peculiarities of their social organization, there did not arise an elite ruling layer similar to the Arzhan dynasty among them.\nKurgan burials\n| image2   = Arzan-2 main burial (male and female).jpg\n| caption2 =Arzhan-2 main burial (male and female)\n| footer=\n}}\nThe Aldy-Bel culture is known through its kurgans. They are rounded or oval mounds of boulders or rock fragments with larger stones at the base, 8 to 12 m across and 1 m height on average, grouped in pairs or occasionally three, located next to each other along a north–south axis. Typically there are several burials in a kurgan, up to seven or more: a central burial in a box of massive stone slabs, with other graves of younger people and children in smaller stone or wooden boxes on the sides except for eastern side. The graves are covered with stone slabs.\nThe kurgans contain mixed types of graves, with logs, stone boxes and dugouts. Burials are mostly solitary. The buried are laid in a crouched position, predominantly on the left side. The main burial is orientated with its head to the west, the others may somewhat deviate depending on their location in the kurgan. A typical feature is the deposition of horse harnesses at the side of the central burial pit, but in contrast with the Arzhan-period monuments there are as a rule no accompanying horse burials.\nSo-called \"moustached kurgans\" with stone curves, most typical for Early Nomads of Kazakhstan, are also known in Tuva. Stone structures with spherical tops on the ends of the \"moustaches\" in Kazakhstan are analogous to Aldy-Bel surface structures in Tuva. Some undisturbed kurgans contain in situ well preserved fencing and deer stones, with an excellent accompanying complex of artifacts similar to other monuments in the Altai, also linking the Aldy-Bel monuments with the Tasmolin culture in central Kazakhstan.\nArt\nAldy-Bel art depicts images of animals in tiptoe position and compositions of entwined figures in a form of \"mysterious picture\". Aldy-Bel art complex is numerous and varied, most typical for the early Scythian time, reflecting very stable cultural tradition. Among such artistic traits are hoof-type markings that ascend to early Scythian time and are found in nomadic cultures in Middle Asia, central Kazakhstan, and Aldy-Bel culture.\nFile:Arzhaan-2 gold bracelet.jpg|Arzhan-2 gold bracelet, Tuva National Museum. Arzhan 2 kurgan (7th-6th centuries BC), is associated with the Aldy-Bel culture.\nFile:Arzhan deer.jpg|\"Animal style\" deer, (7-6th century BC) Tuva.\nFile:6. Pectorale burial mound Arzhan (VIII. - VII. B. C.) Tuva.JPG|Pectoral plate, from burial mound Arzhan (7-6th century BC) Tuva.\nFile:8. Akinak (dagger) bural mound Arzhan (VIII.-VII. B.C.) Tuva.JPG|Akinak (dagger) burial mound Arzhan (7-6th century BC) Tuva.\nFile:Золото Скифов.jpg|Arzhan-2 gold boars, Tuva National Museum.\nGenetics\n| image2   = Aldy Bel ancestry.png\n| caption2 = Aldy-Bel ancestry.\n| footer=\n}}\nIn 2019, a genetic study of remains from the Aldy-Bel culture was published in Human Genetics. The authors determined the paternal haplogroups of 11 Aldy Bel males. 9 out of 11 samples (82%) were found to be carriers of the West Eurasian haplogroup R1a, while 2 samples (18%) belonged to the East Eurasian haplogroups Q-L54 and N-M231.\nThe authors also analyzed the maternal haplogroups of 26 Siberian Scythian remains from Arzhan. 50% of the remains carried an East Eurasian haplogroup including C, D, F and G, while 50% carried West Eurasian haplogroups H, U, or T. In contrast to the paternal lineages, the maternal lineages were extremely diverse. The most common lineages were variants of haplogroup C4.\nSignificant genetic differences were found between the Eastern Scythians and the Western Scythians of the Pontic steppe. The two groups appear to have been of completely different paternal origins, with almost no paternal gene flow between them. On the other hand, there is strong evidence of shared maternal DNA between Scythian cultures, indicating maternal geneflow from East Eurasia to West Eurasia.\nAn admixture analysis suggested that Aldy Bel Scythians derived the major ancestry from Western Steppe Herders at a proportion of 53%, the remainder from Khövsgöl LBA herders (41%) and BMAC (6%).\nPopulation\nThe Aldy-Bel population was studied craniologically, odontologically, and genetically, enabling researchers to trace population and its changes in time. In terms of physical anthropology, the population of the Aldy-Bel culture, which lived in the mountainous regions of the Altai and Sayan Mountains (central Tuva) was closely related to the early Scythians of the Northern Altai region.\nRelated cultures\nIn addition to kinship with the neighboring Mayemir and Tasmolin cultures, many Aldy-Bel structural and artistic similarities extend further to the west, to the Tagisken and Uygarak complexes of Central-Asia.\nIn the opinion of D.G. Savinov, the broad region from central Kazakhstan to the Yenisei was affected by migrations not detected in archaeological evidence, mainly from west to east. Some portion of that population, most visible in the Tasmolin culture, merged with the emerging Aldy-Bel culture.\nReferences\nLiterature\n* Savinov D.G., [http://kronk.spb.ru/library/savinov-dg-2002a.htm Ранние кочевники Верхнего Енисея. Археологические культуры и культурогенез.] (Early nomads of Upper Yenisei. Archaeological culture and cultural genesis), St. Petersburg, St. Petersburg State University, 2002,  (in Russian)\n* Chikisheva T.A., Dynamics of anthropological differentiation in population of southern Western Siberia in Neolithic – Early Iron Age, Professorial dissertation, Novosibirsk, 2010, section Conclusions http://www.dissercat.com/content/dinamika-antropologicheskoi-differentsiatsii-naseleniya-yuga-zapadnoi-sibiri-v-epokhi-neolit (In Russian)"
    }
  ]
}