{
  "content": [
    {
      "type": "text",
      "text": "# Aleutian tradition__disambig_1\n\nThe Aleutian Tradition is an archaeological culture which began around 2500 BC and ended in AD 1800. Aleutian artifacts are made out of chipped stone, unlike the ground slate tools used by archaeological cultures on the mainland of Alaska. The Aleutian people lived in semi-subterranean winter houses made from driftwood, whale bone, and peat.  They used kayaks, atlatls and harpoons to kill sea mammals for sustenance. Around AD 1150, Aleutian houses increased considerably in size, food was stored in special chambers inside the house, and weaponry was becoming more common around these sites. The sustenance pattern changed from relying on sea mammals to eating mostly salmon. Long-distance trade also started increasing community with other local groups.\nLinguistics\nThere are many hypotheses surrounding the linguistics of the Aleutian peoples. The Aleutian language has been considered by Joseph Greenberg to be a component of the Amerind family linguistic group. He proposed that the Amerind language group arrived in the Americas before 9000 BC with the NaDene group diverging around 7000 BC and the Aleut and Eskimo languages diverging around 2000 BC.\nAnother argument is that NaDene, Eskimo, and Aleut linguistic features are more similar to those of the Chukchi in Siberia than to Amerind linguistic features. This hypothesis suggests that the NaDene, Eskimo, Aleut, and Chukchi peoples descended from a single population, placing the timing of human arrival in North America at 30,000 to 43,000 years ago. It is possible that the Chukchi were isolated from the other linguistic populations due to the rising sea levels and the Na Dene and Aleut-Eskimo diverged due to differing adaptations in result of coastal and inland occupation. This points to Aleut and Eskimo people being a part of the same language stock yet displaying differences in speech patterns similar to the differences between Russian and English.\nSettlement, society, lifestyle\nArchaeological evidence shows that the Aleut peoples once supported some of the largest hunter-gatherer sedentary settlements on earth. Aleut populations consisted of a highly varied hunter-gatherer economy that was based upon the resources of the land and water. Subsistence included a wide range of sea mammals including seal and walrus, along with the hunting of caribou and muskox and the gathering of wild vegetables.\nWithin the Aleutian Islands, villages grew slowly for about 2000 years after 2500 BC, with numerous large settlements emerging during the first millennium. It is not clear why there was such a growth but there is an apparent connection to this and the increase of marine life in the Pacific waters during the neoglacial cooling period.\nBy 1100 AD the western Alaskan Peninsula and the adjacent islands had eight to ten massive settlements and many smaller that supported as many as 7,000 to 12,000 people.\nSettlements consisted of up to 250 semi-subterranean winter houses as well as summer residences and storage areas. Winter houses were constructed to be eighteen inches into the ground in order to aid in the protection of blowing wind and rain along with the maintenance of a constant temperature. The frames of these houses were made of either driftwood or whalebone and covered in a layer of sod or peat. The entrance was on the roof of the structure with a hole and ladder leading into the interior. The houses ranged in size (some up to fifty meters long) and housed 30-60 members of an extended family. There were other smaller areas that were used as seasonal or special task sites that were used for shorter periods of time in comparison to the more sedentary housing.\nLarge settlements were located next to rivers and streams that provided subsistence such and salmon and other marine organisms. Long-distance trade and travel was apparent which linked Aleutian communities located hundreds of miles away. Societies became hierarchical with the presence of nobles (warriors or skilled hunters), a middle class, and slaves (prisoners or orphans).\nThere were many beneficial attributes of living in large settlements. These attributes included protection against attack from other settlements, an increase in food storage and sharing in times of need, and overall social and economic support.\nHunting in the marine environment consisted of the use of kayak style boats that were made of animal skins sewn around a flexible wooden frame. Harpoons and darts along with compound fishhooks, atlatls, stone sinkers, digging and prying picks, and ropes were also used.\nYear round available animals for subsistence included sea lions, sea otters, harbor seals, cod, halibut, and marine invertebrates. Migratory animals hunted included humpback and baleen whales, fur seals, salmon, and birds. On the Islands themselves there was almost a total dependence upon the marine environment considering that the animal population consisted only of birds, lemmings, and fox.\nFood storage was moved from outside to inside houses during this tradition with the food storage areas being smaller chambers that led to a large central area through the use of passageways. Food storage was critical in order to keep starvation at bay; such storage consisted of dried roots and berries, fish, and whales.\nThe use of fire for cooking and warmth is apparent due to the presence and common occurrence of large and small oil lamps along with charred griddle stones (which aided in heating and cooking food) on archaeological sites. Mammal oil was the fuel of choice due to the lack of a constant supply of wood on the Aleutian Islands. The Islands were treeless with the exemption of the farthest eastern end.\nClimate\nClimate was a major defining factor within the Aleutian tradition. On the Aleutian Islands themselves people were subject to volcanic eruptions (there are at least 26 volcanoes present across the island chain), tremors, tsunamis, fog, and wind that caused constraints regarding settlement, travel, and hunting.\nConsidering that climatic factors were completely governed by the sea; the Islands temperatures ranged from about ten degrees (Celsius) during the summer months and around zero (Celsius) degrees during winter. Winds ranged from 25 to 35 kilometres per hour with 100 to 120 centimetres of rain per year. Fog was present, especially in July and August. Hypothermia and poor visibility are a result from this climate type.\nHigh marine productivity was evident due to nutrient upwelling. This can be considered a factor that worked towards such high population settlements. It is also important to remember that climatic conditions and natural events were not universal throughout the Island chain and if a disaster occurred it did not affect the entire population within this Tradition.\nArchaeological sites\nThe warm and volcanically dry conditions within the Aleutian Caves provided exceptional preservation conditions of archaeological remains. Considering that dry areas prevent decay from water and destructive microorganisms are unable to flourish, “skin, hair, and nails can remain intact without any artificial mummification.\" As such, the dead were naturally preserved. People could have also contributed to preservation by periodically drying the bodies by wiping and suspension over a fire, and in some cases the internal organs were removed and the body cavity was filled with dry grass.\nAnangula site\nThe earliest known occupation of the Aleutian Islands appears to be reflected on the Anangula site. This site contained a strong prominence of chipped stone artifacts. It reflected a core and flake tradition with bifacial projectile points, knives, and adze points.\nThere are three hypothesis's regarding this site. The first supports the belief that the site represents an ancestral occupation dating back to 6000 BC. The second hypothesis supports the belief that the present Aleut culture is a blend of Eskimo influences from the Alaska Peninsula and the older Anagula tradition. The third states that the older Anagula tradition died out and was replaced around 2500 BC. The first and second imply an 8000-year racial and cultural continuum.\nWestern Fox Islands, Rat Islands, and Umnak Island\nWithin these areas there is evidence of a long occupation period that lasted from 2000 BC to 1000 BC. There is a presence of semi-subterranean dwellings that were lined with stone slabs and whalebones that also contained fire pits. Some stone paving was also apparent. Chipped stone projectile points used for hunting sea mammals were also present.\nWithin the Nikoiski Bay Area that is located on the southwest side of Umnak Island there were established base and satellite camps along with collecting stations. Resource sites were used simultaneously it is obvious knowledge of location and methods and procedures to obtain resources were transmitted throughout generations. This site was occupied for a period of 4000 years.\nWithin the Chaluka area that is also located on Umnak Island bone artifacts such as fishhook shanks, spears, and two-piece sockets of whalebone were excavated and dated to about 946 BC. Between 1000 and 1500 AD slate implements came into use in Chaluka. The basic lifeway remained similar with the same bone harpoon heads, spear points, chisels, awls, and ornaments used.\nSheep Creek located northeast of the Nikoiski Bay Area contained successive bands of charcoal stained soil that dated to about 1342 BC. Lithic and bone materials were also present.\nAmong the Rat Islands people hunted large numbers of sea otters and harbor seals, some migratory whales and fur seals, fish, ducks, geese, sea birds, sea urchins, and limpets. One house excavated on these islands was five by six meters and dated to about 1500 AD. A storage bench was found inside with a depressed sleeping area surrounding a central fire pit.\nNear Islands\nThe cave located on the Near Islands was first discovered in 1998 by the Western Aleutians Archaeological and Paleobiological Project team and permission was sought and given by The Aleut Corporation to begin excavation and documentation. The cave itself is a result of natural fissures in volcanic rock going 48 meters into the hillside and measuring about five meters wide. The entire cave was mapped using a two-meter grid with bird, mammal, and fish bones collected and tagged. Human burials were photographed and drawn and either left in or returned to their original areas.\nHuman remains that were found represented three individuals that consisted of an elderly person, juvenile to young adult, and a very young child. The elderly individual had very worn teeth, suffered from arthritis, and the skull, mandible, pelvis, and most bones of legs and arms were absent. There are three explanations for these missing bones the first that states that this area could have been a secondary burial site. The second states that animal disturbance could be the reasoning for the missing bones and the third speaks of human disturbance. The young adult was aged to be under 19 years of age, the teeth did not have much wear and the young child was aged to be between three and four years old. There were also other human remains found that were not associated with either three of the burials. It is apparent that the front of the cave was used continuously for a resting area when traveling and hunting and the rear is a burial site.\nThe only cultural artifact associated with the burials found was a small piece of red ochre. All the other artifacts were associated with the sleeping and sitting areas of the cave. These artifacts included a net sinker that is a fishing tool commonly found on Aleutian sites, a barbed harpoon point, and four spoons made of cormorant breastbone. Other artifacts that were associated with post Russian contact and military debris were also found and collected.\nSoil samples that were collected and tested showed the presence of roundworm and tapeworm eggs. These parasites are usually transmitted to humans through sea lion flesh.\nAlong with parasitic remains there was 127 bones identified as non-human. Most of the bones found were Arctic foxes (73) and 36 were sea lions and harbor seals. There were 1,061 bird remains found that consisted of 16 species. There were 58 fish remains found with 79% of this number being Pacific cod.\nNotes and references\nSources\n*Bahn & Renfrew, Colin & Paul. 2012 Archaeology: Theories, Methods, and Practice, 6th ed. Thames & Hudson Ltd, London\n*Fagan, Brian M.  2005  Ancient North America.  Thames and Hudson, London.\n*Lippold, K. Lois. Mammalian Remains from Aleutian Archaeological Sites: A Preliminary Report. Arctic Anthropology, Vol. 9, No. 2 (1972), pp.&nbsp;113–115\n*McCartney & Veltre, Allen & Douglas. Aleutian Island Prehistory: Living in Insular Extremes. World Archaeology, Vol. 30, No. 3, Arctic Archaeology (Feb., 1999), pp.&nbsp;503–515.\n*Reedy-Maschner, L. Katerine. 2010 Aleut Identities: Tradition and Modernity in an Indigenous Fishery. McGill-Queen's University Press 2010.\n*Yesner & Aigner, David & Jean. Comparative Biomass Estimates and Prehistoric Cultural Ecology of the Southwest Umnak Region, Aleutian Islands. Arctic Anthropology, Vol. 13, No. 2 (1976), pp.&nbsp;91–112\n*West, Dixie et al. A Burial Cave in Western Aleutian Islands, Alaska. Arctic Anthropology Vol. 40, No. 1, pp.&nbsp;70–86, 2003\n*Wynn, Graeme. 2007 Canada and Arctic North America: An Environmental History. ABC-CLIO, Inc."
    }
  ]
}