{
  "content": [
    {
      "type": "text",
      "text": "# Alfred Edward Turner\n\n| birth_place      =\n| death_date       =\n| allegiance       = United Kingdom\n| branch           = British Army\n| rank             = Major-General\n| unit             = Royal Artillery\n| serviceyears     =\n| commands         = Inspector General of Auxiliary Forces (1900–1904)\n| known_for        = Administrative posts in Ireland; service with the Royal Artillery; interest in spiritualism\n| battles          = Nile Expedition\n| awards           = Order of the Bath (KCB, CB Military and Civil divisions)\n| alma_mater       = Westminster School, Addiscombe Military Seminary\n| spouse           = 1. (Emma) Blanche Hopkinson (m. 1865; d. 1899)2. Juliette Elizabeth Marie Whiting (m. 1902)\n| children         = Two sons, one daughter\n| laterwork        = Chairman of the Alliance Franco-Britannique, director of the North Borneo Chartered Company, author of military history books and memoirs.\n}}\nMajor-General Sir Alfred Edward Turner,  (3 March 1842 – 20 November 1918) was a British Army officer of the late nineteenth century, who served in administrative posts in Ireland.\nEarly life\nTurner was born on 3 March 1842, the eldest son of Richard E. Turner and his wife Frances (née Johnstone). Richard Turner was a barrister and a bencher of the Inner Temple. Alfred attended Westminster School and then the Addiscombe Military Seminary, entering the Royal Artillery in 1860.\nStaff service\nIn 1882, Turner was appointed an aide de camp and military private secretary to Earl Spencer, the Viceroy of Ireland; he held the post until 1884, when he was given the position of deputy assistant adjutant-general in the Nile Expedition, for which he was mentioned in despatches. In 1885, he returned to a staff appointment in Dublin, as the assistant military secretary to Prince Edward of Saxe-Weimar-Eisenach, the Commander-in-Chief in Ireland, and the following year was appointed the private secretary to the Viceroy. From 1886 to 1892 he served as a Commissioner of Police in various Irish counties, and was created a Companion of the Order of the Bath (CB) in the civil division.\nFrom 1895 to 1898, Turner was the assistant adjutant-general for the Royal Artillery, for which he was created a Companion of the Order of the Bath (CB) in the military division. From March 1900 to 1904 he was the Inspector General of Auxiliary Forces. At the time, the term \"Auxiliary Forces\" was used by the British Army to collectively cover Yeomanry, Militia and Volunteers. That is to say the various part-time units maintained to act in support of the Regular Army (UK). He was appointed a Knight Commander of the Order of the Bath (KCB) in the 1902 Coronation Honours list published on 26 June 1902, and invested as such by King Edward VII at Buckingham Palace on 24 October 1902. In September 1902 he attended the maneuvers of the 14th German Army Corps at Donau, Oeshingen, attached to the Staff of the 29th Infantry division.\nSpiritualism\nTurner was interested in psychical research and identified as a spiritualist. He was a member of the International Club for Psychical Research.\nHe attended séances with the materialization medium Cecil Husk. He became convinced that Husk could materialize spirits and defended the medium in various newspaper articles. During one of the séances he stated that he had witnessed the materialization of W. T. Stead. Turner also claimed to have experienced apports and spirits in his own home.\nLater life\nIn retirement, he was the chairman of the Alliance Franco-Britannique, a director of the North Borneo Chartered Company and the Manchester North Borneo Rubber Company, and chairman of North Borneo State Rubber. He wrote two books of military history, on Napoleon's invasion of Russia (The Retreat from Moscow and Passage of the Beresina) and on the Franco-Prussian War (From Weissenburg to Sedan), and a volume of memoirs, ''Sixty Years of a Soldier's Life (1912). In January 1911 he was made a colonel commandant of the Royal Artillery.\nFamily\nTurner married first, in 1865, (Emma) Blanche Hopkinson. His first wife died in 1899, and on 23 August 1902 he remarried at Battersea to Juliette Elizabeth Marie Whiting, only daughter of Henry Whiting.\nHe died on 20 December 1918, survived by two sons and a daughter.\nPublications\n*The Retreat from Moscow and Passage of the Beresina (1898)\n*From Weissenburg to Sedan (1899)\n*[https://archive.org/details/sixtyyearsofsold00turn Sixty Years of a Soldier's Life''] (London: Methuen, 1912)\nReferences\nFurther reading\n* \"TURNER, Maj.-Gen. Sir Alfred Edward\", in"
    }
  ]
}