{
  "content": [
    {
      "type": "text",
      "text": "# Algy Ward\n\n| birth_place     = Croydon, London, England\n| death_date      =\n| death_place     = Royal Tunbridge Wells, Kent, England\n| genre           =\n| occupation      =\n| instrument      =\n| years_active    = 1976–2023\n| label           =\n| past_member_of  =\n| website         =\n}}\nAlasdair Mackie \"Algy\" Ward (11 July 1959 – 17 May 2023) was an English punk rock and heavy metal bass guitarist and singer. He began his career in 1977, as a bassist for the Australian proto punk garage band the Saints. Afterwards, he joined The Damned, before founding Tank in 1980. Tank were part of the new wave of British heavy metal movement.\nCareer with The Saints\nAlasdair Mackie Ward first rose to fame by joining the Australian punk rock band the Saints, replacing their former bassist Kym Bradshaw, who went on to play with The Lurkers, and after that, King, a collective formed with Captain Sensible, Henry Badowski, members of Wreckless Eric's band and members of Johnny Moped's band. Prior to Algy Ward's entry into the band, The Saints had already released the early punk rock single, \"(I'm) Stranded\", to some acclaim, but were struggling for further recognition, since image wise, they did not comply with what late '70s punk bands were expected to look like at the time.\nWard's first appearance with The Saints was in 1977 on their third single, \"This Perfect Day.\" Many commentators and reviewers have lauded this single in the 21st century. Critic Jon Savage commented that the song was, \"the most ferocious single to ever grace the UK Top 40.\"  Steve Taylor said \"This Perfect Day\" was, \"the band's masterpiece. A short statement of resistance&nbsp;– delivered over a chugging beat and inventively deployed guitar.\" The Guardian considered the song \"quite the most startling, wound-up noise recorded under the punk banner to that point. Bailey spat out the opening lines, atop the band's adrenalised clatter.\" Mojo called it, \"an ultimate expression of teenage nihilism.\"\nWard played on The Saints' second album Eternally Yours, recorded in Wessex Sound Studios, as well as the group's third album Prehistoric Sounds. Both were released in 1978, during which time the band began to experiment with a jazzier R&B sound. The Saints' vocalist Chris Bailey later said of Eternally Yours, \"For me, it's our first proper release because ''(I'm) Stranded was just a load of demos. Although we still had the same energy as the first album, the added horn section seemed to confuse people and the record sort of disappeared.\"\nEternally Yours is featured in the book 1001 Albums You Must Hear Before You Die.\nShortly after the release of Prehistoric Sounds,'' The Saints temporarily disbanded. When the band reformed without Kuepper and utilising a more focused post-punk sound, Ward was replaced by bassist Janine Hall, who had already gained experience playing in early punk rock band Young Charlatans with Rowland S. Howard.\nAlgy Ward's Lemmy-styled bass playing is to the forefront and prominent in the mix, and audibly in its formative, incipient stage on Prehistoric Sounds : the reception to the album, on the whole though, was as mixed as the diversity of styles showcased on the record. Clinton Walker said Prehistoric Sounds was, \"an extraordinary record - one of the period's best bar none - a brooding, melancholic collision of electrically charged rock balladry and swooping, brassy arrangements. Broadly misunderstood, it meant nothing to no-one.\"\nAllMusic's Andy Kellman described Prehistoric Sounds as \"the textbook by which to make a great rock record where horns play as much of a role as guitar\". In October 2010, the album was listed in the top&nbsp;50 in the book, 100 Best Australian Albums with their debut, ''(I'm) Stranded'', at No.&nbsp;20.\nCareer with The Damned\nAfter the Saints disintegrated, Ward joined English punk rock band the Damned, playing on the band's comeback album Machine Gun Etiquette (1979), which was released on proto punk and pub rock record label, Chiswick Records, who had also released Motörhead's early records. Joe Strummer, Lemmy and Paul Simonon also appear on the album. The reissue of the album includes the band's take on The Sweet's \"Ballroom Blitz\". The album also features sometime Pink Floyd lyricist Anthony Moore on synthesiser. Philip Lloyd-Smee ( known for his design work for Syd Barrett as well as for the lettering and Gothic calligraphic work on Joe Petagno's early Motörhead logo ) contributed to the sleeve and logo design work on Machine Gun Etiquette.\nDuring his time with The Damned, Ward also played bass on cover versions including Motörhead's \"Over the Top\" (released later under the collective moniker Motordamned), the MC5's \"Looking at You\" and live, the band played the Sex Pistols' \"Pretty Vacant\" and The Stooges' \"I Feel Alright\".  He toured with the band worldwide, including America in 1979 where they played at Whisky A Go Go, Hollywood, and the Waldorf in San Francisco, significantly influencing the American Hardcore scene. Ward appeared on the live performance on The Old Grey Whistle Test in England featuring \"Smash It Up\", before he was fired from the group due to animosity between him and drummer Rat Scabies. He was replaced by former Eddie and the Hot Rods and UFO (band) bassist Paul Gray.\nSpeaking of Algy Ward's contribution to the album in an interview with Louder than War online punk rock fanzine, Captain Sensible said \"Algy was immense on Machine Gun (Etiquette). The sound was largely based on the thundering bass lines that he delivered, it was a beautiful noise.  And then Paul (Gray) came along and was a very fluent and flowing kind of bass player.\"\nCareer with Tank\nDuring his career with the Damned, and influenced and inspired by Lemmy Kilmister and his band Motörhead, Ward began to express interest in the burgeoning new wave of British heavy metal movement, which was kicked off by bands like Witchfynde and Saxon. Ward planned to create a new band, which he called Tank inspired and influenced by Motörhead. He hired Peter and Mark Brabbs to play with him, and in 1980 Tank was officially formed.\nIn 1982, they released their debut album Filth Hounds of Hades recorded and produced by Motörhead Guitarist Fast Eddie Clarke, considered by some to be a landmark album in the NWOBHM movement. Fast Eddie Clarke produced the Tank album before going on to produce Motorhead's Iron Fist (album). Initial copies of the album came with a free 7\", featuring The Snake, a cover of a song originally written by Larry Wallis and Mick Farren's proto-punk psychedelic band, The Pink Fairies. Tank were asked by Motörhead to join them as support band on the Iron Fist tour in 1982.\nShortly before Tank's third record This Means War was released, Mick Tucker became the second guitarist, and shortly after the release, the Brabbs brothers left. They were replaced by Cliff Evans on guitar, Graeme Crallan on drums, and later Michael Bettel on drums.  After their fifth album (which was self-titled) was released in 1987, growing disputes over musical direction and lack of commercial success grew more frequent, which led the band to split in 1989.\nResurrection and second split-up\nIn 1997, Tank reformed with Ward on vocals and bass, Bruce Bisland on drums, and Tucker and Evans on guitars. They recorded and released one more album as the original Tank, entitled Still At War in 2002. However, the reunion was short-lived, as legal disputes and recording issues for their supposed seventh studio album Sturmpanzer caused the band to split up once again in 2006.\nDual Tanks\nIn 2008, a new Tank was announced, fronted by Tucker and Evans. This Tank has recorded and released four new albums: War Machine in 2010, War Nation in 2012, Valley of Tears in 2015, and Re-Ignition in 2019. This version of the band went on tour throughout 2016. In response to the new Tank, Ward created another Tank, in which he was the sole musician. Ward began to work on a new Tank album, which became Breath of the Pit, in 2013. Shortly after this, he teamed up with friend Paul  Evo from Warfare to record a six-track EP entitled Damned unto Death, released under the name of Evo/Algy. That same year, after years of rumours, Ward confirmed that he was in the studio working on another Tank album, Sturmpanzer, which was released in November 2018.\nDeath\nWard died on 17 May 2023, at the age of 63 at a hospital in Tunbridge Wells, Kent, England, apparently after suffering from serious health issues for some time. The news was confirmed by Tank guitarist Mick Tucker on his Facebook page.\nReferences\nExternal links\n*\n*"
    }
  ]
}