{
  "content": [
    {
      "type": "text",
      "text": "# Alice Ross-King\n\n| birth_name    = Alys Ross King\n| nickname      =\n| birth_date    =\n| birth_place   = Ballarat, Victoria, Australia\n| death_date    =\n| death_place   = Cronulla, New South Wales, Australia\n| placeofburial = Fawkner Crematorium and Memorial Park\n| allegiance    = Australia\n| branch        = Australian Army\n| serviceyears  = 1914–19191941–1947\n| rank          = Major\n| unit          = Australian Army Nursing ServiceAustralian Army Medical Women's Service\n| commands      =\n| battles       = First World WarSecond World War\n| awards        = Associate Royal Red CrossMilitary MedalMentioned in DespatchesFlorence Nightingale MedalVictorian Honour Roll of Women\n| spouse        =\n| relations     =\n| laterwork     =\n}}\nAlys Appleford,  ( Ross King; 5 August 1887 – 17 August 1968), known as Alice Ross-King, was an Australian civilian and military nurse who took part in both World Wars. She has been described as Australia's most decorated woman. During the First World War she served in hospitals in Egypt and France and was one of only seven Australian nurses to be awarded the Military Medal for gallantry. In the Second World War she held a senior post within the Australian Army Medical Women's Service. In 1949 she was awarded the Florence Nightingale Medal, the highest award made by the International Committee of the Red Cross.\nEarly life\nRoss-King was born in Ballarat, Victoria. Her parents, Archibald Ross King and Henrietta King (née Ward), named her Alys Ross King. The family moved to Perth but her father and two brothers drowned in an accident and Henrietta King moved, with Alys, to Melbourne.\nNursing training was undertaken at The Alfred Hospital in Melbourne and, by 1914, Ross-King was a qualified theatre sister.\nFirst World War\nShortly after the outbreak of the First World War, Ross-King enlisted in the Australian Imperial Force as a member of the Australian Army Nursing Service (AANS). It was at this time that she changed her surname from Ross King to the hyphenated Ross-King, to distinguish her from another AANS nurse called Alice King, as well as simplify the spelling of her forename to the more common spelling of Alice.\nIn November 1914, Sister Ross-King was posted overseas to serve with 1st Australian General Hospital (1st AGH) in Egypt. 1st AGH was based at Heliopolis, near Cairo, and after service there, Ross-King was posted to an outstation at Suez established as a clearing station for casualties from the Gallipoli Campaign. Towards the end of 1915 Ross-King returned to Australia as a nurse to wounded troops returning home.\nReturning to 1st AGH, Ross-King was part of the unit when 1st AGH moved to France in April 1916. 1st AGH was settled at Rouen and Ross-King nursed there throughout 1916, including the Somme Campaign, and into 1917. In June 1917 she was posted to 10th Stationary Hospital at St Omer but after only a few weeks she was posted again, this time to 2nd Casualty Clearing Station (2nd CCS) near Trois Arbres. Arriving at 2nd CCS on 17 July, Ross-King had only been at the hospital for five days when it was bombed on the night of 22 July 1917. Four men were killed in the bombing and 15 others injured. Ross-King, who was just finishing a shift, returned to the wards and continued to care for the patients in the ward despite the fact that the canvas tents had collapsed on top of her and the casualties. Her actions during the raid and the immediate aftermath resulted in Ross-King being awarded the Military Medal (MM), one of only seven AANS nurses to receive the MM during the war. Of the other six Military Medal awards, three were awarded to her colleagues at 2nd CCS for conduct during the same raid; these were Sisters Dorothy Cawood and Clare Deacon, and Staff Nurse Mary Derrer. All four awards were published in the London Gazette on 25 September 1917, and presentation of the medals was made by General Sir William Birdwood, General Officer Commanding I ANZAC Corps.\nRoss-King returned to 1st AGH in November 1917 and remained with the hospital until the end of the war. In May 1918 Ross-King was made an Associate of the Royal Red Cross, and had also been mentioned in despatches. 1st AGH moved to England in January 1919 and embarked to return to Australia the same month. Ross-King was discharged from the AANS in September 1919.\nPersonal life\nDuring the war Ross-King met and became engaged to Harry Moffitt, an officer in the 53rd Battalion, but he was killed during the Battle of Fromelles in July 1916. During the voyage to Australia in 1919, Ross-King met Dr Sydney Appleford and they married in August 1919, settling in Lang Lang, Victoria, where they raised their four children.\nSecond World War\nBetween the wars, Alice Appleford become involved in the training of Voluntary Aid Detachment (VAD) personnel in Victoria. With the outbreak of the Second World War, she enlisted into the VAD and when, in 1942, the Australian Army Medical Women's Service (AAMWS) was formed Appleford was commissioned with the rank of major and appointed senior assistant controller for Victoria responsible for all AAMWS in the state of Victoria.\nAppleford continued to serve in the AAMWS until 1951. During her service Appleford was nominated for the Florence Nightingale Medal and was one of two Australian nurses to receive the medal in 1949. The citation for the medal concluded: }}\nLater life\nSydney Appleford died in 1958 and Alice Appleford spent her final years in Cronulla before her death on 17 August 1968.\nRecognition\nSince 1970 the ex-AAWMS Association has presented an annual proficiency award, the Alice Appleford Memorial Award, to a non-commissioned member of the Royal Australian Army Nursing Corps.\nIn 2008 author Peter Rees told the story of Ross-King's First World War experiences in his book The Other ANZACs (republished as Anzac Girls), which was turned into the TV series ANZAC Girls in 2014. The role of Ross-King was played by Georgia Flood.\nIn 2008, Appleford was added to the Victorian Honour Roll of Women.\nReferences\nNotes\nSources\n*\n*  }}\n*\nExternal links\n*"
    }
  ]
}