{
  "content": [
    {
      "type": "text",
      "text": "# Alice Waring Holmes\n\n|birth_place = Oberlin, Ohio\n|death_date  =\n|death_place = Winston-Salem, North Carolina\n|other_names =\n|known_for   =\n|occupation  =\n|alma_mater  = Howard University Dental College\n|spouse      = J. Welford Holmes\n|children    = 1\n}}\nAlice Mariah Waring Holmes (June 11, 1872 – August 27, 1939) was an American educator, suffragette, and dentist, thought to be the first female Black dentist in Washington D.C.\nEarly life and education\nAlice Mariah Waring was born on June 11, 1872, in Oberlin, Ohio, to William Waring and Amanda Fitz-Allen Hill Waring. She was one of four children with siblings James, Lavinia and Robert. She attended the Colored High School in Washington, D.C., and normal school.\nShe attended Howard University Dental College from 1897 through 1900 and received her D.D.S. in 1900.\nCareer\nHolmes taught elementary school in the Washington, D.C., school system before and during the time she was attending medical school. She had a medical office at 518 T Street NW, described as \"the nicest office in her section of the city\" by late 1900. She advertised herself as a \"surgeon dentist\" and stated that children's work was her specialty. She was elected to be the treasurer of the National Association of Colored Dentists in 1901.\nShe moved to Pittsburgh, Pennsylvania, got married, and established herself as a suffragette, attending the National Women's Suffrage Conference in 1913 in her role as president of the Lucy Stone Women's Suffrage League. She was a member of many local clubs including the Aurora Reading Circle and the Negro Women's Republican League where she acted as chairman. She and Mrs. Israel Lee were chosen as alternates to the national convention at Pennsylvania's Women's Suffrage Convention. In 1923, she was appointed to be an assistant in the Tax Revision office of Allegheny County.\nPersonal life\nHolmes purchased a lot in the Barry Farm area of Southeastern Washington, D.C., in 1903. She married J. Welford Holmes, a Pittsburgh lawyer who belonged to many fraternal organizations including Prince Hall Freemasonry and the Knights of Pythias of North America, South America, Europe, Asia, Africa and Australia. They had one son, J. Welford Holmes Jr. who was born in 1908. J. Welford Holmes Sr. died in 1922.\nDeath\nHolmes died on August 27, 1939, in Winston-Salem, North Carolina.\nReferences"
    }
  ]
}