{
  "content": [
    {
      "type": "text",
      "text": "# Alice Marriott (historian)\n\n| birth_place       = Wilmette, Illinois\n| death_date        =\n| death_place       = Oklahoma City, Oklahoma\n| death_cause       =\n| resting_place     =\n| resting_place_coordinates =\n| other_names       =\n| nationality       = American\n| education         =\n| alma_mater        =Oklahoma City University (B.A.)University of Oklahoma (B.A.)\n| occupation        =Historian; anthropologist\n| awards            =\n| spouse            =\n| partner           =\n| children          =\n| signature         =\n| signature_alt     =\n}}\nAlice Lee Marriott (8 January 1910 – 18 March 1992), was an American historian and anthropologist of the American Southwest and Native Americans. She is a member of the Oklahoma Historians Hall of Fame.\nEarly life\nMarriott was born in Wilmette, Illinois, on 8 January 1910.\nShe was awarded a B.A. degree in English and French by Oklahoma City University in 1930 and a B.A. in anthropology by the University of Oklahoma five years later. Marriott was the first woman to earn an anthropology degree from the University of Oklahoma.\nCareer\nMarriottspent the summers of 1935 and 1936 conducting fieldwork among the Modoc Indians in southern Oregon and the Kiowa in southwestern Oklahoma. Marriott was a field representative with the U.S. Department of Interior Indian Arts and Craft Board from 1938 to 1942. Next, she worked for the American Red Cross in the Southwest until 1945.\nShe became a consultant to the Oklahoma Indian Council in 1961 and was appointed associate professor of anthropology at the University of Oklahoma from 1964 to 1966. Two years later, Marriott became artist-in-residence at Central State University in Edmond, Oklahoma.\nPublications\nIn 1945, she began writing The Ten Grandmothers with her frequent collaborator, archaeologist Carol K. Rachlin, for the University of Oklahoma Press. Eight more solo books on Native American and Southwestern topics followed in 1953. Marriott published a biography, Sequoyah: Leader of the Cherokees, in 1956 and Black Stone Knife in 1956. In 1968 she published with Carol K. Rachlin American Indian Mythology, and in 1971 she also published, with Rachlin, the book Peyote, through the now-absorbed-by-Harper & Row publishing house Thomas Y. Crowell Co. The authors advertised the book as \"A compelling study of the sacramental use of the Native American hallucinogen.\" As a freelancer, she continued to write, producing three more books with Rachlin by 1975.\nAwards and honors\nShe was awarded the University of Oklahoma Achievement Award in 1952 and won the Oklahoma City University Achievement Award in 1968. She was posthumously inducted into the Oklahoma Historians Hall of Fame in 2004.\nPersonal life\nShe died in Oklahoma City on March 18, 1992.\nReferences\n*"
    }
  ]
}