{
  "content": [
    {
      "type": "text",
      "text": "# Alice Davis Hitchcock Award\n\nThe Alice Davis Hitchcock Book Award, established in 1949, by the Society of Architectural Historians, annually recognizes \"the most distinguished work of scholarship in the history of architecture published by a North American scholar.\" The oldest of the six different publication awards given annually by the Society, it is named after the mother of architectural historian Henry-Russell Hitchcock.\nThe Alice Davis Hitchcock Medallion, established in 1959, is awarded to the author of a literary work that provides an \"outstanding contribution to the study of architectural history\". The recipient(s) must be British, or the book must deal with an element of the architectural history of Britain or the Commonwealth. The medallion is a Wedgwood portrait of James ‘Athenian’ Stuart.\nHistory\nSource: [http://www.sah.org/conferences-and-programs/award-programs/publication-awards/hitchcock-book-award-recipients Society of Architectural Historians]\n*1949 - Harold Wethey. Colonial Architecture and Sculpture in Peru. Cambridge: Harvard University Press, 1949.\n*1950 - Rexford Newcomb. Architecture of the Old Northwest Territory. Chicago: University of Chicago Press, 1950.\n*1951 - Anthony Garvan. Architecture and Town Planning in Colonial Connecticut. New Haven: Yale University Press, 1951.\n*1952 - Antoinette Downing & Vincent Scully. The Architectural Heritage of Newport. Cambridge: Harvard University Press, 1952.\n*1953 - Thomas Howarth. Charles Rennie Macintosh and the Modern Movement. London: Routledge and Kegan Paul, Ltd., 1952.\n*1954 - Henry-Russell Hitchcock. Early Victorian Architecture in Britain. New Haven: Yale University Press, 1954.\n*1955 - Talbot Hamlin. Benjamin H. Latrobe. New York: Oxford University Press, 1955.\n*1956 - Carroll L. V. Meeks. The Railroad Station: An Architectural History. New Haven: Yale University Press, 1956.\n*1957 - Frederick D. Nichols. The Early Architecture of Georgia. Chapel Hill: University of North Carolina Press, 1957.\n*1958 - Marcus Whiffen. The Public Buildings of Williamsburg. Colonial Williamsburg, 1958.\n*1959 - Kenneth John Conant. Carolingian and Romanesque Architecture, 800 to 1200. Harmondsworth: Penguin Books, 1959.\n*1960 - David Coffin. ''The Villa D'Este at Tivoli. Princeton: Princeton University Press, 1960.\n*1961 - James S. Ackerman. The Architecture of Michelangelo. London: Zwemmer, 1961.\n*1962 - George Kubler. Art and Architecture of Ancient America. New York: Penguin Books, 1962.\n*1963 - Robert Branner. La Cathedrale de Bourges. Paris: Tardy, 1962.\n*1964 - Alan Gowans. Images of American Living, Four Centuries of Architecture and Furniture as Cultural Expression. Philadelphia: J.B. Lippincott Company, 1964.\n*1965 - John McAndrew. The Open-Air Churches of Sixteenth Century Mexico. Cambridge: Harvard University Press, 1965.\n*1966 - Richard Krautheimer. Early Christian and Byzantine Architecture. Baltimore: Penguin Books, 1965.\n*1967 - Richard Pommer. Eighteenth-Century Architecture in Piedmont. New York: New York University Press, 1967.\n*1968 - Barbara Miller Lane. Architecture and Politics in Germany, 1918-1945. Cambridge: Harvard University Press, 1968.\n*1969 - Phyllis Williams Lehmann. Samothrace, Volume III: The Hieron. Princeton: Princeton University Press, 1969.\n*1970 - Franklin Toker. The Church of Notre Dame in Montreal. Montreal: McGill University Press, 1970.\n*1971 - (no award given)\n*1972 - H. Allen Brooks. The Prairie School. Toronto: University of Toronto Press, 1972.\n*1972 - Thomas F. Matthews. The Early Churches of Constantinople: Architecture and Liturgy. University Park: Pennsylvania State University Press, 1971.\n*1973 - Marvin Trachtenberg. The Campanile of Florence Cathedral, \"Giotto's Tower\". New York: New York University Press, 1971.\n*1974 - Laura Wood Roper. FLO, A Biography of Frederick Law Olmsted. Baltimore: Johns Hopkins University Press, 1973.\n*1975 - Rudolf Wittkower. Gothic vs. Classic, Architectural Projects in Seventeenth-Century Italy. New York: G. Braziller, 1974.\n*1976 - (no award given)\n*1977 - Mary Louise Christovich; Sally Kitredge Evans; Betsy Swanson; Roulhac Toledano. The Esplanade Ridge (Vol. V in New Orleans Architecture series). Pelican Publishing, 1977.\n*1978 - Myra Nan Rosenfeld and The Architectural History Foundation. Sebastiano Serlio on Domestic Architecture. New York: Architectural History Foundation, 1978.\n*1979 - Abbott Lowell Cummings. The Framed Houses of Massachusetts Bay, 1625-1725. Cambridge: Harvard University Press, 1979.\n*1979 - Norma Evenson. Paris: A Century of Change, 1878-1978. New Haven: Yale University Press, 1979.\n*1980 - Richard Krautheimer. Rome: Profile of a City, 312-1308. Princeton: Princeton University Press, 1980.\n*1981 - Franklin Hamilton Hazelhurst. Gardens of Illusion: The Genius of Andre LeNostre. Nashville: Vanderbilt University Press, 1980.\n*1982 - Robert Grant Irving. Indian Summer: Lutyens, Baker and Imperial Delhi. New Haven: Yale University Press, 1982.\n*1983 - Alberto Pérez-Gómez. Architecture and the Crisis of Modern Science. Cambridge: MIT Press, 1983.\n*1984 - Paul Venable Turner. Campus: An American Planning Tradition. Cambridge: MIT Press, 1984.\n*1985 - David Brownlee. The Law Courts: The Architecture of George Edmund Street. Cambridge: MIT Press, 1984.\n*1986 - William L MacDonald. The Architecture of the Roman Empire: An Urban Appraisal. New Haven: Yale University Press, 1986.\n*1987 - Dell Upton. Holy Things and Profane: Anglican Parish Churches in Colonial Virginia. Cambridge: MIT Press, 1987.\n*1988 - David Van Zanten. Designing Paris: The Architecture of Duban, Labrouste, Duc and Vaudoyer. Cambridge: MIT Press, 1987.\n*1989 - David Friedman. Florentine New Towns: Urban Design in the Late Middle Ages. Cambridge: MIT Press, 1989.\n*1990 - Anthony Vidler. Claude-Nicolas Ledoux, Architecture and Social Reform at the End of the Ancien Regime. Cambridge: MIT Press, 1990.\n*1991 - Hilary Ballon. The Paris of Henri IV. New York: Architectural History Foundation, 1991.\n*1991 - Patricia Waddy. Seventeenth-Century Roman Palaces. Cambridge: MIT Press, 1990.\n*1992 - Richard Etlin. Modernism in Italian Architecture, 1890-1940. Cambridge: MIT Press, 1991.\n*1994 - Fikret Yegul. Baths and Bathing in Classical Antiquity. New York: Architectural History Foundation, 1992.\n*1995 - Michael J. Lewis. The Politics of the German Gothic Revival: August Reichensperger. Cambridge: MIT Press, 1993.\n*1996 - William L. MacDonald and John Pinto. Hadrian's Villa and Its Legacy. New Haven: Yale University Press, 1995.\n*1997 - Harry Francis Mallgrave. Gottfried Semper Architect of the Nineteenth Century. New Haven: Yale University Press, 1996.\n*1998 - Joseph Rykwert. The Dancing Column: On Order in Architecture. Cambridge: MIT Press, 1996.\n*1999 - Marvin Trachtenberg. Dominion of the Eye: Urbanism, Art & Power in Early Modern Florence. New York: Cambridge University Press, 1997.\n*2000 - Alina Payne. The Architectural Treatise in the Renaissance. New York: Cambridge University Press, 1999.\n*2001 - Eve Blau. The Architecture of Red Vienna, 1919-1934. Cambridge: MIT Press, 1999.\n*2002 - Sibel Bozdogan. Modernism and Nation-Building: Turkish Architectural Culture in the Early Republic. Seattle: University of Washington Press, 2001.\n*2002 - Isabelle Hyman. Marcel Breuer, Architect. New York: Henry N. Abrams, Inc., 2001.\n*2003 - Joseph Siry, The Chicago Auditorium Building. Adler and Sullivan's Architecture and the City. Chicago: University of Chicago Press, 2002.\n*2004 - Katherine M. Solomonson, The Chicago Tribune Tower Competition. New York: Cambridge University Press, 2001.\n*2005 - Jordan Sand, House and Home in Modern Japan: Architecture, Domestic Space, and Bourgeois Culture, 1880-1930. Harvard University Asia Center Publications, 2003.\n*2006 - Christine Macy & Sarah Bonnemaison, Architecture and Nature - Creating the American Landscape. Routledge, 2003.\n*2007 - John Archer, Architecture and Suburbia: From English Villa to American Dream House, 1690–2000. University of Minnesota Press, 2005.\n*2008 - Michael W. Fazio and Patrick A. Snadon, The Domestic Architecture of Benjamin Henry Latrobe. Johns Hopkins University Press, 2006.\n*2009 - Abigail A. Van Slyck, A Manufactured Wilderness: Summer Camps and the Shaping of American Youth, 1890-1960. University of Minnesota Press, 2006; and, Honorable Mention to Steven Nelson. Cameroon to Paris: Mousgoum Architecture In and Out of Africa. University of Chicago Press, 2007.\n*2010 - Cammy Brothers, Michelangelo, Drawing, and the Invention of Architecture. Yale University Press, 2008.\n*2011 - Eeva-Liisa Pelkonen, Alvar Aalto: Architecture, Modernity, and Geopolitics. Yale University Press, 2009.\n*2012 - Michelangelo Sabatino, Pride in Modesty: Modernist Architecture and the Vernacular Tradition in Italy. University of Toronto Press, 2010.\n*2013 - Jean-Louis Cohen, Architecture in Uniform: Designing and Building for the Second World War, Canadian Centre for Architecture / Éditions Hazan, 2011.\n*2014 - John Harwood, The Interface: IBM and the Transformation of Corporate Design, 1945–1976, University of Minnesota Press, 2011\n*2015 - Christopher Curtis Mead, Making Modern Paris: Victor Baltard’s Central Markets and the Urban Practice, University Park: Pennsylvania State University Press, 2012 and\n*2015 - Richard Harris, Building a Market: The Rise of the Home Improvement Industry, 1914-1960, Chicago: University of Chicago Press, 2012\n*2016 - Amy F. Ogata, Designing the Creative Child: Playthings and Places in Midcentury America. University of Minnesota Press, 2013\n*2017 - Meredith Cohen, The Sainte-Chapelle and the Construction of Sacral Monarchy: Royal Architecture in Thirteenth-Century Paris. Cambridge University Press, 2015\n*2018 - Mrinalini Rajagopalan, Building Histories: The Archival and Affective Lives of Five Monuments in Modern Delhi. University of Minnesota Press, 2016 / Kathryn E. O’Rourke, Modern Architecture in Mexico City: History, Representation, and the Shaping of a Capital. The University of Chicago Press, 2016\n*2019 - Madhuri Desai, Banaras Reconstructed: Architecture and Sacred Space in a Hindu Holy City. University of Pittsburgh Press, 2016\n*2020 - Peter H. Christensen, Germany and the Ottoman Railways: Art, Empire and Infrastructure. Yale University Press, 2017\n*2021 - Nancy Steinhardt, Chinese Architecture: A History. Princeton University Press, 2019\n*2022 - Ünver Rüstem, Ottoman Baroque: The Architectural Refashioning of Eighteenth-Century Istanbul. Princeton University Press, 2019\n*2023 - Andrew Demshuk, Three Cities After Hitler: Redemptive Reconstruction Across Cold War Borders. University of Pittsburgh Press, 2021\n*2024 - Subhashini Kaligotla, Shiva's Waterfront Temples: Architects and Their Audiences in Medieval India.'' Yale University Press, 2022\nSee also\n*Society of Architectural Historians\n*Henry-Russell Hitchcock\n*List of architecture awards\n*List of history awards\n*Prizes named after people\nReferences\nExternal links\n*[https://web.archive.org/web/20051108033707/http://www.sah.org/index.php?module=ContentExpress&file=index&func=display&ceid=24&meid=30 Nomination page]\nFootnotes\n#  [http://www.sah.org/publications-and-research/publication-awards Description of award]"
    }
  ]
}