{
  "content": [
    {
      "type": "text",
      "text": "# Alikovo, Alikovsky District, Chuvash Republic\n\n|subdivision_type1=\n|subdivision_name1=Alikovsky District\n|population_total=2,653\n|population_as_of=2010\n|population_footnotes=\n|coordinates =\n|pushpin_map=Russia Chuvashia#Russia\n|timezone=EET|utc_offset=+4\n|timezone_DST=EEST|utc_offset_DST=+4\n}}\nAlikovo (; , Elĕk) is a rural locality (a selo) and the administrative center of Alikovsky District of the Chuvash Republic, Russia, located  south of Cheboksary, on the Cheboksary—Krasnye Chetai and Cheboksary—Yadrin auto routes. Population:  The majority of the population is Chuvash.\nGeography\nThe Abashyrma River flows near Alikovo. The closest village is Siner.\nHistory\nIt was first mentioned in 1486.\nClimate\nThe climate is moderately continental, with long cold winters and warm summers. Average January temperature is ; average July temperature is . The absolute recorded low was  and the record high was . Annual precipitation is up to .\nEconomy\nIndustry in Alikovo is represented by a construction plant, branches of banks and insurance companies, telecommunication offices, and building companies.\nInfrastructure\nThe facilities include a cultural center, a theatre, a library, a health clinic, and stores. There is also a postal office, a stadium, a restaurant and cafés, and several gas stations. A market is open on Thursdays. There is a park and a public garden named after Andriyan Nikolayev.\nEducation\nEducational facilities include a middle school and a music school.\nCulture\nCultural facilities include a museum, a people's theater, a people's ensemble, a veteran's orchestra, a school's brass band, and a chorus. International Chuvash music festival \"Virjal shevlisem\" (lit. ''Viryal's pancakes'') is held each May.\nA newspaper is published in Alikovo.\nReligion\n*Church of the Assumption of the Virgin (Alikovo)\nFurther reading\n*L. A. Yefimov, \"Alikovsky District\" (\"Элӗк Енӗ\"), Alikovo, 1994.\n*\"Аликовская энциклопедия\" (Alikovsky District's Encyclopedia), authors: Yefimov L.A., Yefimov E.L., Ananyev A.A., Terentyev G.K., Cheboksary, 2009, .\nReferences"
    }
  ]
}