{
  "content": [
    {
      "type": "text",
      "text": "# Alison Stewart (As the World Turns)\n\n* Jessica Dunphy (2002–2005)\n* Marnie Schulenburg (2007–2010)\n* (and child actors)\n| years            =\n* 1994–2005\n* 2007–2010\n| first            =\n| last             =\n| creator          = Juliet Law Packer and Richard Backus\n| introducer       =\n* Laurence Caso (1994)\n* Christopher Goutman (2002, 2007)\n* Lynn Marie Latham and Josh Griffith (2007)\n| spinoffs         = L.A. Diaries\n| crossover        = The Young and the Restless\n| classification   = Final; regular\n| image1           = Alisonstewart.jpg\n| imagealt1        =\n| caption1         = Marnie Schulenburg as Alison Stewart\n| alias            =\n* Alison McDermott\n* Alison Snyder\n| occupation       = Former Nurse's aid at Memorial Hospital  Former Waitress  Former Former Pornographic actress  Former Waitress at Al's Diner  Former Waitress at Metro  Former Assistant to Aaron Snyder at Burt's Garage\n| parents          =\n* Larry McDermott\n* Emily Stewart\n| adoptiveparents  = Susan Stewart\n| siblings         =\n* Daniel Hughes\n* Jennifer Ryan\n* Lyon Hunter\n| spouse           = Aaron Snyder (2003, 2008)\n| grandparents     =\n* L.J. McDermott\n* Agnes McDermott\n* Dan Stewart\n* Susan Stewart\n| aunts/uncles     =\n* Betsy Stewart\n* Annie Stewart Ward\n* Dee Stewart\n| cousins          =\n* Danielle Andropolous\n* Gregory Ward\n* Lowell Ward\n* Maria Ward\n* Nancy Ward\n}}\nAlison Stewart is a fictional character from As the World Turns, an American soap opera on the CBS network. Created by head writers Juliet Law Packer and Richard Backus, and introduced by executive producer Laurence Caso, the character was portrayed by several child actors, including Sarah Hyland. In 2002, the role was rapidly aged when Jessica Dunphy was cast in the role; she remained in the role until her exit in 2005. In 2007, the character briefly crossed over to The Young and the Restless with actress Marnie Schulenburg in the role, who would continue her portrayal on As the World Turns until the series finale in 2010.\nFor her portrayal of Alison, Schulenburg earned a Daytime Emmy Award nomination in the category of Outstanding Younger Actress in a Drama Series in 2010.\nCasting\n, who would later become recognized as Haley Dunphy on Modern Family, was one of the child actors to portray the role of Alison.]]\nUpon the character's introduction in 1994, the role was portrayed by several child actors, including Kristi Richuitti and Sarah Hyland. In April 2002, Jessica Dunphy joined the cast in the role. In July 2005, it was announced that she would exit the role; she last appeared on July 20 of the same year. In 2006, Marnie Schulenburg was cast in the role; she made her debut when the character made a crossover appearance on The Young and the Restless on February 22, 2007, and later debuted on As the World Turns the following month. Schulenburg remained with the soap until its final episode on September 17, 2010, becoming the longest-tenured actor in the role.\nStorylines\nBackstory\nAlison was introduced on July 11, 1994, Susan Stewart and her much younger husband, fellow doctor Larry McDermott. Susan carried the baby, which was created with Larry's sperm and an egg donated by Susan's daughter, Emily Stewart.\n2002–2005\nIn 2002, Alison (Dunphy) immediately made her presence known as a bad-girl blonde like her \"sister,\" Emily: mischievous, witty, and willing to use her beauty to manipulate or just for fun. Even so, the character's vulnerability was clearly visible, caused by abandonment issues stemming from her absent father and her experiences growing up as the daughter of an alcoholic (Susan).\nHer first-love relationship with Aaron Snyder was a teenage love triangle story, with Alison scheming to break up Aaron's relationship with Lucy Montgomery while pretending to be Lucy's best friend. Aaron and Alison developed a real friendship, which led to love. Alison got involved with Chris Hughes, who was older (in his 20s) and a doctor. The Hughes and Stewart family had a volatile past, with storylines involving Bob and Susan's affair, Tom and Emily's affair (and child), and Kim's marriage to Dan, whom Susan had seduced away from her decades ago. Kim Hughes, in particular, found it nearly impossible to accept Alison into the Hughes family. This situation was eased somewhat by Bob's mother, town matriarch Nancy Hughes, who formed an unlikely friendship with Alison.\nAfter a somewhat painful transition from teenager to adult, including a miscarriage and finding out the truth about her parentage, Alison's rocky relationship with Susan and Emily changed to a tight bond of support as the three of them poked fun at their reputation as \"those Stewart women\".\nIn addition to her romances, Alison got involved in adventure and mystery storylines, often with a touch of comedy. She also became involved in trying to catch a hospital serial killer, who turned out to be Susan's new husband, Rick Decker. In 2005, Alison exited Oakdale to be with Aaron in Seattle.\n2007–2010\nIn early 2007, when Emily was having sex with a man she met, they watched a porn tape, and Emily was horrified when she discovered that the girl in the movie was Alison (Schulenburg). Emily went to Dusty Donovan for help and the two tracked Ali down in Las Vegas, where she had made several porn movies and was addicted to crystal meth. They took her back to Oakdale, and Emily promised that she would not tell their mother, but Ali had to kick off in return. Ali pretend she was okay with it, but kept meeting her dealer in secret. When she had no money left, Ali offered herself to her dealer in return for more drugs. Emily and Dusty found her and took her back to their house, where Ali finally began to realize she had to get clean. With Emily and Dusty's help, she began to get better and got a job at ''Al's Diner''. However, Ali was soon found by Lance, the man who made her a porn star, and he forced Ali to go back to work. Ali refused and told him to leave her alone. When he visited her in her room, he attacked her and Ali fought back, wounding him with a razor blade. Dusty came to the rescue in time and kicked Lance out of the room. He helped Ali get cleaned up and then the two slept together that night.\nThe next morning, they decided to not tell anyone, since, Dusty was about to be romantically involved with Emily. Shortly after, when Ali had gotten better, she was surprised when her ex-boyfriend Aaron Snyder returned to Oakdale. It was revealed that back in Seattle, Aaron  barely had any time for her, and at one point, Ali thought he cheated on her, so she cheated on him to get back at him. It was all proven false in the end and Ali left Seattle because she felt ashamed of what she did to him. Aaron told her he did not care about that and came back to Oakdale to be with Ali again. After some more struggle, Ali gave and they gave their relationship another shot. It once again did not last very long, when Ali and Dusty discovered that their night had been filmed, and now, someone threatened to post the video on the web. Aaron found out and broke up with Alison. When Emily discovered, she was upset that she left town. Both Ali and Dusty felt guilty about Emily's hurt, but there was nothing they could do.\nTo keep herself busy, Ali got back to her old job, and volunteered at Memorial Hospital. She worked for a while at the hospital, and bumped into ex-fiancé Chris Hughes, who had just returned to town and got his job as a doctor back. The two were glad to see each other and decided to get a drink. There, they ran into Emily, who had also just returned. Emily had forgiven both Dusty and Ali, and she turned out to be involved again with Chris, whom she met during her time away. Ali was happy hat her sister had finally found a man who genuinely liked her and told Chris not to break her heart. Around this time, Chris' nephew Casey Hughes was released from 9 months in prison and returned troubled to Oakdale. He and Ali struck up an immediate friendship and she also welcomed his old cellmate Matt O'Connor into her life. She and Matt soon felt attracted to each other and started dating. Ali came clean to him and told him her past as a porn start and drug addict, but he was okay with it and said everybody makes mistakes sometimes. After a while, Ali, Matt, Casey and his mother Margo were locked in Casey's house by the criminal Gray Gerard, who wanted to take revenge on Margo for shooting his uncle nearly a decade earlier. It turned out Gray Gerard was Gerard Nevins, the nephew of Elroy Nevins, who raped Margo in the nineties. The four escaped safely and Gray was shot and killed. It was also revealed that Matt was a part of this plan and he was taken to jail. A month later, he wrote a letter for Ali where he apologized to her and told her he genuinely had fallen for her, and hoped she could forgive him one day.\nAfter all this, Ali and Chris spent more time together, much to Aaron and Dusty's dismay, who both did not like Chris. Aaron decided to leave it alone, but Dusty would not give up and tried to sabotage Emily and Chris' happiness several times. He eventually revealed to Chris that Emily had been a prostitute a year before, and Chris was disgusted with Emily and broke up with her. He and Ali grew closer and eventually started to go on a date together. After this, Ali realized she was still in love with him, so she also came clean to him and showed him the DVD of her porn movie. She feared Chris would dump her, but he told her the reason he broke up with Emily was because she lied about it, but Ali did not. The two continued their dates and Ali got an offer to get into the nursing program. She wanted to use the money from the deceased Dusty (presumed dead at the time) to pay for nursing school, but Emily refused to unfreeze the money, because Ali was now dating Chris. Emily eventually gave in and Ali got into nursing school. When she failed her tests, Chris convinced the head of the program, Brenda, to give Ali another shot, one that she passed.\nWhen Ali and Chris planned to make love that night, Ali froze and skipped Chris' room. The next time, the same thing happened and Chris became frustrated. He told Brenda to let Ali fall and Ali was kicked out of the programme. When she discovered Chris was behind this, she pressed charges against him for sexual harassment, but she lost the case when Chris lied in court. After this, she did not want to have anything to do with him, but the two could not stay away from each other. When Ali got another chance for the Programme, she and Chris grew closer again and he helped her pass her test. At the same time, Ali had also bonded with Aaron again. When Ali got ill, she was admitted to the hospital, where Aaron refused to let Chris get anywhere near Ali, believing he was the cause of Ali's condition. Shortly after, more victims fell ill, including Chris. He eventually discovered they were being poisoned and he found the cure to nurse everybody back to health. Ali was grateful towards Chris, who put his own life on the line to save her, but she continued to spend more time with Aaron. Chris asked Ali if she really wanted to be with Aaron instead of him, or if she was just choosing Aaron because he was safe and did not break her heart, as Chris did.\nChris got his answer when Ali and Aaron appeared to be engaged out of nowhere. Aaron had set up Chris to come to the Lakeview, where the engagement party took place, so Chris would witness Aaron speeching to his soon wife-to-be. Chris was deeply hurt and Ali could not bare to see him like that, but refused to break off the engagement. When a patient at Memorial was forced to live in an elderly home, she could not take her dog Voldemort \"Morty\" with her, and Chis and Ali became his new boss. Ali and Chris now saw each other at least twice a day, to take care of Morty, but also secretly because they could not stay away from each other. On the day before the wedding, Chris decided it was now or never and declared his love for Ali. They had sex that night, but Ali broke his heart when she told him she was not going to break off the engagement. On their wedding day, Chris showed up with the plan to object, but Dani Andropolous took him away before he could do anything. On the question from the priest if anyone had a reason to object, Ali expected and hoped for Chris to do this, but he was gone, and she was married to Aaron.\nIn order to keep her focused on Aaron instead of Chris, she wanted to start a family with him right away, However, a doctor's appointment revealed that she could not become pregnant anymore due to a disease she had when a porn star. She began to push Aaron away and talked to Chris about her problems instead. When Aaron witnessed one of their conversations, after which Ali left upset, he confronted Chris. He told Aaron that he and Ali had sex the night before the wedding. Aaron went to confront Ali about this, who admitted it was true. Aaron was disappointed by her, but was still willing to give their marriage another chance. At the same time, Ali had made up her mind and realized she was no longer in love with Aaron and they filed for divorce. Ali wanted to clear her head for a while and thought about what to do now. When she found that Chris was about to leave for Africa, she wished him good luck. Only one hour later, Ali realized she loved Chris and went back to beg him to stay. However, she was too late and Chris had already left for Africa.\nAli was heartbroken and slowly started to put her life together again. She began to hang out more with Casey Hughes, Luke Snyder and Noah Mayer and helped Luke with his Campaign to run for President of his university. Luke's concurrent was his old crush Kevin Davis. Casey becomes Luke's campaign manager and proves that he is not above using underhanded tactics in order to win, including using Alison as a spy for the other side. When Alison's deception is discovered, she is kidnapped by masked men on Halloween, taken to a dorm room and forced to strip as they videotape her. Casey comes to her rescue, attacking Mark, the man they believe to be the main perpetrator. As a result, Casey is arrested, although he avoids charges and is released after having spent the night in prison. However, he soon finds out he is suspended from school for the assault. On the final election day, Casey stuffs the ballot box so that Luke wins. Noah has a crisis of conscious and tells the dean what Luke and Casey did, and they are both expelled from college as a result.\nCasey is afraid of telling his parents and puts it off for a while. Alison shows up at his house to help him search for jobs. Casey admits that he has no idea what to do with his life, and Ali tries to help him figure it out. She tells him to picture himself doing something that excites him, then make his move. Casey tries to kiss her. Alison pulls away and says she values their friendship and does not want to take it any further.\nOn Thanksgiving, Casey persuades Alison to help him break the news of his expulsion to his parents. Alison does help explain the situation to Margo and Tom, who are more disappointed than angry. Alison then enjoys a happy Thanksgiving dinner with the Hughes despite the circumstances.\nLater Tom puts his foot down and tells Casey to either get a job or move out. Casey gets a job as a janitor at the hospital where Alison works. Alison is given the assignment of looking after a college student who overdosed on drugs, and is horrified to realize that it is Mark, the man who kidnapped and sexually harassed her. Mark has a psychotic episode and escapes to the hospital roof, planning to jump. Alison and Casey are tempted to let him jump, but Casey manages to save him. Alison is moved by his efforts and the two grow closer as a result of the incident.\nAlison receives a text message from Lucy Montgomery, who is back in Oakdale in search of a bone marrow transplant for her brother Johnny. Alison agrees to test possible donors secretly, knowing she could get arrested for doing it unauthorized. She reserves a room at the Lakeview for Lucy and Johnny under her name. She arrives at the Hughes' house to get a sample from Casey, where he tells her of his plans for a New Year's Eve date with his ex-girlfriend Maddie. Alison, clearly jealous, claims that she has a date for New Year's Eve as well, with a man she works with.\nLater, while Lucy and Johnny are out for a walk, Alison enters the Lakeview room to research anonymous donors on Lucy's laptop. Casey sees her and follows her upstairs, wanting to know the truth about her plans for New Year's Eve. He does not believe Alison when she says she got the hotel room for her and her date. Finally, out of frustration, she says she got the room in the hopes that Casey would want to spend the night with her. When Casey does not believe her, she kisses him to convince him it is true. They end up on the bed with Casey naked and Alison in her underwear, but she pulls away and gets out of bed before they can have sex. She says she does not want to sleep with him while lying to him. Casey expresses disappointment that she is keeping secrets from him. Alison promises to tell him the truth when the time is right, and they part amicably.\nMaddie, who had to stop at her brother Henry's hotel room to get her cell phone, hears Casey and Alison together in the room. She later meets Casey downstairs and, crying, tells him she knows he is sleeping with Alison.\nDays later, Casey approaches Maddie at Al's Diner and apologizes for hurting her, then tries to convince her that nothing happened between him and Alison. Maddie is angry and irrational and refuses to hear it, convinced that Casey has a thing for Alison. Later Casey meets Alison at the park and tells her that he and Maddie are not right for each other because he is not good enough for her. He also expresses a desire to start a relationship with Ali. Alison is afraid of having a relationship with Casey and insists that he gets back together with Maddie. She approaches Maddie outside Al's Diner and tells her she and Casey are just friends. Maddie is not convinced and walks away.\nAlison then tells Casey that what happened on New Year's Eve meant nothing. Casey is clearly hurt by this but lets it go.\nLater Alison and Casey scheme to get their broken-up friends, Luke and Noah, back together. Alison approaches Luke and claims that she is unsure whether Casey likes her as more than a friend, then asks him to speak to Casey for her and find out. Casey approaches Noah with the same issue, and they lure the couple to the hospital's roof and lock them out. While they are waiting for Luke and Noah to reconcile, Casey reveals some acquired maturity, claiming that he is seeking a substantial relationship rather than a brief fling. Alison responds skeptically but is intrigued by this change of attitude and shows more willingness to take a chance with him.\nAlison and Casey dated briefly, breaking up when Emily's computer technician, Hunter, who had an obvious crush on Ali, drove a wedge between them.  After his mother died in a nursing home and Ali had broken up with Casey, they ended up in his bedroom and almost had sex but stopped just before.  They then found out Emily's eggs were stolen and implanted in Hunter's mother and Larry was his father, making them brother and sister.\nAlison started up a relationship with Casey Hughes and helped Mick Dante with his medical serum to help reverse the aging process, which could help her sister, Emily conceive a child with Paul. Alison became engaged with Casey, and seems unnervingly drawn to Mick, who seems a little unstable, but infatuated and fixated on her, while Alison is on edge about her upcoming wedding and has bizarre dreams of being in a wedding dress in a church bell tower with Mick.\nOn February 5, 2010, Alison, unable to stay away from Mick, goes to the church bell tower, where they had sex. Afterward, Alison felt extremely guilty, while Mick became extremely clingy, telling Alison they are meant for each other and they should leave Oakdale together. When Alison told him that she still intended to marry Casey, Mick grabbed her, saying that she had never experienced this kind of intimacy with anyone else. Alison ran out of the church and was unable to let Casey touch her. A while later, Casey noticed that Alison's engagement ring was missing; she lied and said that she had left it in the bathroom. She returned to the church to retrieve the ring but instead found a note from Mick which said that there was a reason she had left it there.\nShe decided to go on with the weeding anyway. But on her wedding day, Mick Dante kidnapped everyone in the church and demanded that Allison come clean to Casey about what happened between them. Allison confesses and Casey calls the wedding off. Mick tries to escape with Allison but is hit by a car as they are running across the street. Mick is hospitalized in critical condition but recovers briefly. He then tells Allison that he still wants her to leave with her whole on the rooftop. Casey, who followed them there, overhears the conversation and threatens to push Dante off the roof but stops just before he does it. Dante is then captured and sent to prison after he was caught trying to escape from the hospital. Allison asks Casey if he will ever be able to be friends with her and trust her again and he says he does not know.\nMeanwhile, Chris returns from Africa about becoming ill and getting well. Katie sees this as an opportunity to set Ali and Chris up again. They end up going on a date but Katie accidentally backs into Chris when she sees him and Alison about to kiss. While on medication and beer from his injury from the hit, Alison hears Chris admit his love and admiration for Katie, which he mistakes her to be in his drunken and doped up state. She confesses to Katie to quit trying to set her up with Chris because his interests is elsewhere and not with her.\nCasey sees Chris and Ali getting closer and starts a fling with Vienna Hyatt. She is merely using him to get pregnant and trick Henry Coleman to marry her once she sees that he is in love with Barbara Ryan. After they almost get caught by Henry in Vienna's room, Casey finds a bag full of pregnancy tests and suspect that she is pregnant with his child. When he keeps asking her if she is pregnant and not getting a straight answer he decides to investigate himself. After he ca not find the doctor's name in the hospital records, he asks Alison to help him with his situation. She accepts but it is clear she is pained at the fact that Vienna may be pregnant with his child. After much research they discover that Vienna is indeed pregnant but the baby cannot be Casey's because from her medical records, she was already with child when Casey had sex with her. Casey thanks Alison for her help and they start to get closer again. They find out that Vienna never was pregnant and that her medical records were falsified by Katie to help her in her plan to trap Henry. Will and Gwen returns to try to search a missing Barbara and during a barbecue Casey and Will discuss parenthood and marriage, while Gwen and Allison discuss the same thing in a separate room. They both realize that they are still in love with each other and want to try it again. Casey proposes to Allison again and she accepts. She wants to run away to get married in Las Vegas but Casey wants to give her the wedding she deserves. Nancy dies before they have a chance to announce their engagement. But when Chris is in the hospital cause of his heart condition, Kim notices Ali wearing Nancy's wedding ring and their engagement is made public. They agree to marry and move to Carbondale with Gwen and Will, where Casey will practice law.\nExternal links\n* [http://www.soapcentral.com/atwt/whoswho/alison.php Alison Stewart] at [http://www.soapcentral.com  soapcentral.com]\n* [http://members.tripod.com/robynbug/alison.html Children of Oakdale: Alison McDermott Stewart]\n* [https://web.archive.org/web/20090420003750/http://www.soaps.com/astheworldturns/cast/519/Alison_Stewart ATWT character - Alison Stewart] at [http://www.soaps.com  soaps.com]\nReferences"
    }
  ]
}