{
  "content": [
    {
      "type": "text",
      "text": "# All Nepal National Independent Students' Union (Revolutionary)\n\nANNISU(R) mural in Bhaktapur, announcing its 17th National ConferenceThe All Nepal National Independent Students Union (Revolutionary) is the student wing of the CPN (Maoist Centre), a political party in Nepal. It is also referred as ANNISU(R). The current president of the ANNISU (R) is Vijay Prakash Sharma Sapkota. While a faction led by pesident Sapkota joined the merger to form Nepali Communist Party, a significant faction led by general secretary Roshan Thapa Magar joined Progressive National Campaign, Nepal led by Janardan Sharma.\nViolence\nMCC compact entered Nepal during the premiership of Bhattarai while a committee was formed during second premiership of Dahal to rectify MCC. During premiership of Bhattarai, Barsaman Pun was the finance minister while Krishna Bahadur Mahara was the finance minister during premiership of Dahal. Maoist leaders Matrika Prasad Yadav, Bina Magar, Shakti Bahadur Basnet, Giriraj Mani Pokharel and Ram Bahadur Thapa were part of Second Oli cabinet which took MCC to parliament. At the time, they had given approval to table MCC.\nParty president Prachanda publicly maintained that the Millennium Challenge Corporation's (MCC) Nepal Compact could not be ratified without amending certain clauses. It was found that he was in favor of ratification as it was. MCC later released the letter dated September 29, 2021, in which Prachanda and Prime Minister of Nepal Sher Bahadur Deuba assured MCC that the compact would be ratified within four to five months. Major national newspapers criticized Prachanda's move, saying it would deteriorate Nepal's diplomatic strength and virtue.\nThey reported that it was dual nature of the party to both stay in government and protest at the same time for personal profit and vote swing. This move was highly criticized by people and medias.\nThe party chairman had given approval to table MCC while several fellow politicians stood in opposition to the chairman's decision. They called for protests even on streets. Many police were attacked. Trees were broken, the blocks of footpath were removed to attack police as shown in picture. The branches of trees were broken. The Maoist cadets destroyed a boutique while the owner was saving police. Government had to pay for the loss. Leader of opposition and chairman of Communist Party of Nepal (Unified Marxist–Leninist), KP Sharma Oli of condemned the decision of Maoists to stay in government while destroying public property at the same time. The home minister of Nepal, Bal Krishna Khand's and prime minister asked the protesters to stay calm and not destroy public properties casing loss to the government and economy.\nSee also\n* Nepali Communist Party\n* Progressive National Campaign, Nepal\nReferences"
    }
  ]
}