{
  "content": [
    {
      "type": "text",
      "text": "# All in the Family: Absolutism, Revolution, and Democracy in the Middle Eastern Monarchies\n\nAll in the Family:  Absolutism, Revolution, and Democracy in the Middle Eastern Monarchies is a book by Michael Herb published in 1999. The book's central thesis is that Arab monarchies continue to be stable because numerous members of the royal family are given important positions in the government bureaucracy.\nResilience of Arab Monarchies\nAccording to Herb, in 1900 most countries of the world were controlled by monarchs, but by 1999 there existed only a few outside the eight monarchies of the Arab world. Herb argues that  these Arab monarchies have persevered not because of oil money rentierism or the lack of the a middle class, but because of their \"dynastic monarchy structure\".\n\"Dynastic Monarchy Theory\"\nAccording to Herb, in 1938 the ruling Al-Sabah family of Kuwait created a new form of government for the Persian Gulf. In that year, the Al-Sabah threw the merchants out of the Kuwaiti bureaucracy and replaced them with members of the royal family. The other Persian Gulf monarchies followed suit. In these types of regimes, which Herb calls \"dynastic monarchies,\" the monarch typically installs members of the royal family as Prime Minister, Minister of the Interior, Minister of Foreign Affairs, and Minister of Defense. These and other positions in the bureaucracy are used by the monarch as consolation-prize bargaining-chips to dole out to dissatisfied member of the royal family as a means of building consensus. As a result, these dynastic monarchies are much more stable than monarchies in which the monarch excludes the rest of the royal family from power.\nRejection of Rentier State as Main Cause\nThe \"rentier state theory\" says that states in which the government controls vast wealth and do not need to control taxes are more than likely autocratic. Some scholars have cited the rentier state theory and oil wealth as the main reasons for the perseverance of the Arab monarchies. However, oil-wealthy rentier monarchies in Iran, Iraq, and Libya all fell to revolutions, while oil-poor, non-rentier monarchies such as Jordan and Morocco continue to survive.\nRejection of Lack of Bourgeoisie as Main Cause\nSamuel Huntington, among others, believes that as an autocracy's educated bourgeoisie rises, its monarch will fall. According to this theory, Arab monarchies with well-educated populations are due to fall. However, the monarchies of Jordan, Kuwait, and Qatar have very educated citizen populations and yet have been extremely resilient over the past fifty years. Further, the Arab monarchies that experienced revolutions had very small—if any—educated middle class. This is true of Egypt in 1952, Iraq in 1958, Libya in 1969, and Afghanistan in 1973.\nImplications for U.S. Foreign Policy\nHerb, an American author, suggests that the U.S. government pressure the monarchies to liberalize as a means of increasing American moral authority and soft power internationally. The traditional argument against exerting such pressure is that liberalization is liable to bring an unfriendly regime to power through revolution. Herb argues that none of the Arab dynastic monarchies have ever fallen to revolution, and that they are so stable that little risk of revolution exists.\nCase Studies\nThe book focuses on the monarchies of Bahrain, Jordan, Kuwait, Morocco, Oman, Qatar, Saudi Arabia, and the United Arab Emirates. For models of monarchies that have fallen to revolution, the book uses 1952 Egypt, 1958 Iraq, 1969 Libya, 1973 Afghanistan, and 1979 Iran.\nExternal links\n*All in the Family at Google Books [https://books.google.com/books?id=GFdEMIkSfwEC&q=all+in+the+family+herb]\nReferences"
    }
  ]
}