{
  "content": [
    {
      "type": "text",
      "text": "# Allan Warnke\n\n| birth_place     = Edmonton, Alberta, Canada\n| death_date      =\n| death_place     = Richmond, British Columbia, Canada\n| residence       =\n| assembly        = British Columbia Legislative\n| constituency_AM = Richmond-Steveston\n| term_start      = October 17, 1991\n| term_end        = May 28, 1996\n| predecessor     = Riding established\n| successor       = Geoff Plant\n| party           = British Columbia Liberal Party (1991-1996)Independent (1996-2001)\n| otherparty      = Liberal Party of Canada (ca. 1988)Canadian Action Party (ca. 2000-2004)\n| profession      =\n| occupation      =\n| spouse          =\n| children        =\n}}\nAllan Warnke (October 27, 1946 – June 27, 2021) was a Canadian political scientist, professor and politician. He was a former Liberal member of the Legislative Assembly (MLA) of British Columbia, representing the Richmond-Steveston electoral district from 1991 to 1996.\nBiography\nBefore his election to the BC legislature, he ran as a BC Liberal Party candidate in the 1983 provincial election in the dual-member Vancouver-Point Grey riding, and as a candidate of the Liberal Party of Canada in the 1988 federal election in the riding of North Island—Powell River. He then contested the 1991 provincial election as a BC Liberal candidate, and defeated former MLA Harold Steves of the New Democratic Party to become member of the legislative assembly for Richmond-Steveston. He served as the official opposition critic for aboriginal affairs in the 35th Parliament. He contested the 1993 BC Liberal leadership election and finished in sixth place.\nFor the 1996 provincial election, he was passed over for the Liberal nomination in favour of Geoff Plant. Warnke contested the election as an independent candidate, finishing in fifth place. He was an unsuccessful candidate in a 1999 provincial by-election in the riding of Delta South. He then ran again for his old seat in the 2001 provincial election, this time finishing in sixth place. He also ran as a candidate of the Canadian Action Party in the 2000 federal election in the riding of Delta—South Richmond, then in 2004 in the riding of Richmond, but was unsuccessful in both attempts.\nWarnke was a professor of political science at Vancouver Island University and its predecessor Malaspina University-College, as well as being the department chair. He died suddenly in June 2021 from heart disease and medical complications due to obesity and hypertension. He was predeceased by his wife of forty-one years Geraldine (née Byers).\nElectoral record\nProvincial\nFederal\nReferences"
    }
  ]
}