{
  "content": [
    {
      "type": "text",
      "text": "# Allegory in Renaissance literature__disambig_1\n\nAllegory is used extensively in Renaissance literature. Developing from the use of allegory in the Middle Ages, Renaissance literature exhibits an increased emphasis on courtly love, sometimes abandoning intelligibility for deliberately unintelligible allegories.\nThe early modern theory of allegory is discussed in Sir John Harington's Apology for Poetry (included in his translation of Ariosto's Orlando furioso, 1591).\nContinuous/intermittent\nRenaissance allegories could be continuous and systematic, or intermittent and occasional. Perhaps the most famous example of a thorough and continuous allegorical work from the Renaissance is the six books of Edmund Spenser's The Faerie Queene. In book 4, for example, Agape has three sons: Priamond (from one), Diamond (from two), and Telamond (from téleios, perfect, but emended by Jortin to 'Triamond' in his 1734 edition). The three sons correspond to the three worlds, born of love. Cambell's battle with the three sons is an allegory of \"man's battle with the three worlds to find his place in the universe, to establish harmony in God's creation, and ultimately to achieve salvation\". Furthermore, since any triad may be an analogue of another, the three brothers could also be an allegory of the three worlds of man's soul: the vegetative, the sensitive, and the angelic\". Spenser's (multi-layered) allegory is similarly worked out through all six books.\nTorquato Tasso also wrote continuous allegory, as opposed to the intermittent allegory of an Ariosto, for example.\nThree-world theory\nBy the 16th century, allegory was firmly linked to what is known as the Elizabethan world picture, taken from Ptolemy and Pseudo-Dionysius the Areopagite. This theory postulates the existence of three worlds:\n* the sublunary world we live in, subject to change.\n* the celestial world, the world of the planets and stars, unchanging.\n* the supercelestial world, where angels and the Godhead are.\nPico della Mirandola discusses the interrelations between these three worlds in the introduction to his Heptaplus: 'For euen as the...three worlds being girt and buckled with the bands of concord doe by reciprocall libertie, interchange their natures; the like do they also by their appellations. And this is the principle from whence springeth & groweth the discipline of allegoricall sense' (translated by Pierre de la Primaudaye in The French Academie, London, 1618, p.&nbsp;671).\nFurther examples\n*Kenneth Borris has argued that Philip Sidney and John Milton were also major allegorists.\nSee also\n* Courtly literature\n* Dream vision\n* Roman de la Rose\nNotes"
    }
  ]
}