{
  "content": [
    {
      "type": "text",
      "text": "# Alliance for Democracy (Malawi)\n\n| founded = 1993\n| founder = Chakufwa Chihana\n| headquarters =\n| chairman =\n| leader1_title = President\n| leader1_name = Enock Chihana\n| leader2_title =\n| leader2_name =\n| leader3_title =\n| leader3_name =\n| leader4_title =\n| leader4_name =\n| student_wing =\n| youth_wing =\n| ideology = Social democracy\n| position = Centre-left\n| blank1_title =\n| international =\n| colors = Blue\n| symbol = Victory sign hand\n| seats1_title = National Assembly\n| seats1 = }}\n| website =\n| country = Malawi\n}}\nThe Alliance for Democracy (AFORD) is a political party in Malawi that marked its history as laying the foundation for multi-party rule in Malawi. It began as an underground political movement during the Kamuzu Banda era and later evolved to a political party during the multi-party era under the leadership of trade union activist, Chakufwa Chihana. AFORD has a stronghold in the northern region. The president is Godfrey Shawa.\nHistory\nAFORD began as an underground political movement under Banda's dictatorship under the leadership of trade unionist and political activist Chakufwa Chihana. He led an underground political movement that aimed at democratic multi-party rule. He was the first person to openly challenge the system. Therefore, he is known as the 'father of Malawian democracy' for his role in ushering in multi-party rule in Malawi. Many would argue that AFORD was officially registered and active \"...21.07.93.\"\nThe AFORD or Alliance for Democracy is now a political party whose mission under the leadership of Chihana was to reconstruct the economy, attract investors, and improve Malawi's infrastructure.\nThe AFORD was opposed to furthering the reign of the autocratic leader Banda and sought rather to promote the idea of true democracy.\nUnder Chakufwa Chihana's influence, the AFORD political party began initially as a pressure group because political parties were illegal for some time under the dictatorial reign of Hastings Banda.\nThough Malawi is located in the southeastern portion of Africa, a majority of the AFORD's power is concentrated in the northernmost regions of Malawi. AFORD's support is concentrated in the northernmost parts of Malawi for many reasons, including the fact that trade union leader Chakufwa Chihana was born in the Mhuju village.\nThe combination of the MCP attacking the national credibility of AFORD by branding Chihana as a regional advocator and the momentary restriction of Chihana to Rumphi also contributed to why AFORD ‘s political strength lay almost singularly in northern Malawi\nOne of the problems AFORD encountered in an attempt to expand its 33 constituencies in 1993 was its inability to collect enough signatures for its parliamentary candidates nor did there seem to be any “...suitable and credible candidates to run its platform outside the northern region...”.\nMultiparty general elections began in 1993. After the legislative elections concluded in the years 1993-1994, multiparty elections likely occurred in Malawi during the month of May in the year 1994 after Muluzi's United Democratic Front prevailed against Banda's Malawi Congress Party. Chihana was able to secure roughly 18.9 percent of the vote for multi-party elections and roughly 36 seats, arguably the entire northern region, for the parliamentary elections.\nAFORD has not won any of the presidential elections that took place after the 1993 referendum.\nThe AFORD party suffered a unilateral split when Chakufwa Chihana loss faith in Malawi's government after accusing it of corruption during his vice presidency in 2003-2004. Gowa Nyasula took up the role as AFORD's president in the 2004 race for the election which led to him shouldering the bulk of the funding for the party. Gowa Nyasula resigned his role as president of the AFORD which led to Godfrey Shawa being appointed by the party's politburo in 2013\nUltimately Mweinfumbo decided after the year 2014 to accept the request to contest Enoch Chihana for the role of party president in the elective national convention on December 17, 2018 in order to run in 2019 general elections as AFORD's candidate\nIn September 2024 the party's convention made a major change when women were elected to a fair proportion of the major positions. The Deputy President for administration was Catherine Makunganya and Linda Limbe became the Secretary General.\nInternal politics\nAFORD as a political party began to decline due to internal politics within the party.  AFORD's influence slowly became increasingly isolated to the Northern Region and in 2006 it has just two MPs.\nIn 2016, some Malawians formed a pressure group called revamp aford movement. The group was headed by Owen Mumba.\nThe group approached Frank Mwenifumbo the then legislator of Karonga central constituency. The chairman of revamp aford Owen Mumba led the delegation. A deal was made to have Mwenifumbo noon? aford. Other politicians approached were Loveness Gondwe, Chihaula Shaba, Reverend Maurice Munthali, Yeremia Chihana, Reverend Malani mtonga and Richard Msowoya.\nMwenifumbo joined the party and showed interest to contest as president at an aford party convention. This was not received well by the president of Aford, Enoch Chihana. The party structures supported honourable Mwenifumbo. Revamp aford sided with Mwenifumbo and went across the country mobilising  delegates to vote for him. This led to a foiled convention at Don Bosco parish in Lilongwe. Then the issues went to court where Justice Charles Mkandawire ruled that there should be another convention. Mwenifumbo left Aford and joined the UTM.\nResults of Elections 1994 - Present\nOf the 3,775,256 registered voters in Malawi, 562,862 votes were in favor of the AFORD party's candidate, Chakufwa Chihana (TRIPOD). AFORD managed to rank 3rd with 18.89 percent of the votes in the 1994 presidential election.\nOf the 5,071,822 registered voters in Malawi, 2,106,790 votes were in favor of the AFORD party's candidate, Gwanda Chakuamba (TRIPOD). Gwanda Chakuamba represented the alliance between AFORD and the MCP political parties during the 1999 general elections (commonwealth). AFORD managed to rank 2nd with 45.17 percent of the votes, losing to Muluzi who won 52.38 percent of the votes in the 1999 presidential election\n.\nThe AFORD party did not have any representation in the 2004 presidential election considering Chihana was led to pull out of the alliance established in 1997 between AFORD and the MCP in the year 2002. However, Chihana was permitted to be second vice-president of the Republic, while his colleagues were given ministerial positions ultimately leading to a split within the party in 2003. Some AFORD members branched off to begin the Movement for Genuine Democracy . During the general election of 2004, Chihana signed a coalition agreement on behalf of the AFORD party with the UDF political party of Malawi  The number of seats won by the AFORD political party in Parliament also decreased substantially over time with 36 seats won in 1994, 29 seats won in 1999, and 6 seats won in 2004.\nOf the 5,871,819 registered voters in Malawi, 20,150 votes were in favor of the AFORD party's candidate, Dindi Gowa Nyasula. AFORD managed to rank last losing to the DPP's candidate, Bingu wa Mutharika, in the 2009 presidential election by acquiring .45 percent of the votes in 2009. With the death of Chihana in 2006 and the results of the 2009 election, Joyce Banda is the 2009 vice president.\nIn the year of 2014 Malawi's first tripartite elections were held making it the first time Malawians were able to vote for their local governments, members of parliament and president in a single election (commonwealth). The AFORD's political support is divided between Enoch Chihana, the son of  AFORD's founder Chakufwa Chihana, and Frank Mwenefumbo. Of the 7 470 806 registered voters in Malawi, the DPP's presidential candidate Bingu wa Mathrika won with little to no opposition from the AFORD party.  Secretary-General Gridezer Jeffrey argued that AFORD has lacked political representation in the 2014 election and possibly the upcoming 2019 election because AFORD can be described as an outdated party whose political support is concentrated in the small northern population of Malawi.\nThe AFORD political party has garnered more support in the years following the 2014 elections in the north specifically with Mwenifumbo as the head of the political party. Mwenifumbo's decision to join AFORD as opposed to the ruling party, DPP, was because “...he wanted to suffer together with Malawians...” led to a vow in 2017 to continue defending the welfare of Malawians in relation to the constitution\n.\nAt the last general elections, 20 May 2004, the party won 6 out of 194 seats.\nPresidents\n*Godfrey Shawa 2012–present\n*Dindi Gowa Nyasulu x - 2012 (retired)\n*Chakufwa Chihana 1992-\nNotable AFORD members\n*Chakufwa Chihana\n*Enoch Chihana\n*Bazuka Mhango\n* Geoffrey Mhango\nElectoral history\nPresidential elections\n{| class=\"wikitable\" style=\"text-align:center\"\n!Election\n!Party candidate\n!Votes\n!%\n!Position\n!Result\n|-\n|1994\n|Chakufwa Chihana\n|562,862\n|18.89%\n| 3rd\n| style=\"background-color:#fec6c6\" |Defeated\n|-\n|1999\n| colspan=\"4\" style=\"background-color:#eeeeee\" |Endorsed candidacy of Gwanda Chakuamba (MCP)\n| style=\"background-color:#fec6c6\" |Defeated\n|-\n|2004\n| colspan=\"4\" style=\"background-color:#eeeeee\" |Did not contest election\n| style=\"background-color:#dddddd\" |N/A\n|-\n|2009\n|Dindi Gowa Nyasulu\n|20,150\n|0.45%\n| 7th\n| style=\"background-color:#fec6c6\" |Defeated\n|-\n|2025\n| colspan=\"4\" style=\"background-color:#eeeeee\" |Endorsed candidacy of Peter Mutharika (DPP)\n| style=\"background-color:#9eff9e\" |Elected\n|-\n|}\nNational Assembly elections\n{| class=\"wikitable\" style=\"text-align:center\"\n!Election\n!Party Leader\n!Votes\n!%\n!Seats\n!+/–\n!Position\n|-\n|1994\n| rowspan=\"2\" |Chakufwa Chihana\n|563,417\n|19.05%\n|\n| 36\n| 3rd\n|-\n|1999\n|474,215\n|10.56%\n|\n| 7\n| 3rd\n|-\n|2004\n| rowspan=\"2\" |Dindi Gowa Nyasulu\n|114,017\n|3.61%\n|\n| 23\n| 5th\n|-\n|2009\n|38,427\n|0.88%\n|\n| 5\n| 6th\n|-\n|2014\n|Godfrey Shawa\n|31,907\n|0.62%\n|\n|\n| 6th\n|-\n|2019\n| rowspan=\"2\" |Enoch Chihana\n|24,212\n|0.49%\n|\n|\n| 6th\n|-\n|2025\n|TBA\n|TBA\n|\n| 2\n| 5th\n|}\nReferences"
    }
  ]
}