{
  "content": [
    {
      "type": "text",
      "text": "# Allied intervention in the Russian Civil War__disambig_1\n\n()\n| place             = Former Russian Empire\n| result            = Bolshevik victory\n| combatant1        = Allied Powers: White movement\n|  Czechoslovak Legion (1918–1919)\n|  (1918–1920)\n}}\n*  (1918–1919)\n*  (1918–1919)\n*\n*\n|  (1918–1920)\n|  (1918–1920)\n|\n|\n|\n|\n|\n|\n| (1918–1921)\n}}\n| combatant2        = Bolsheviks:\n|  (1920–1922)\n|  (1918–1920)\n|  (1922–1925)\n}}\n| commander1        =  Alexander Kolchak}}\n|  Mikhail Diterikhs\n|  Grigory Semyonov\n|  Nikolai Yudenich\n|  Evgeny Miller\n|  Anton Denikin\n|  Pyotr Wrangel\n|  Radola Gajda\n|  Stanislav Čeček\n|  Sergej Vojcechovský}}\n|  Jan Syrový\n|  Kikuzo Otani\n|  Yui Mitsue\n|  Woodrow Wilson}}\n|  William S. Graves}}\n|  George E. Stewart}}\n|  Robert L. Eichelberger}}\n|  Wilds P. Richardson}}\n|  Joseph D. Leitch}}\n|  Edmund Ironside\n|  Frederick Poole\n|  Lionel Dunsterville\n|  William Thomson\n|  Wilfrid Malleson\n|  Walter Cowan\n|  James H. Elmsley\n|  Henri Bertholot\n|  Philippe d'Anselme\n|  Cosma Manera\n|  Konstantinos Nider}}\n|  Ernest Broșteanu\n}}\n| commander2        =  Vladimir Lenin\n|  Leon Trotsky\n|  Jukums Vācietis\n|  Sergey Kamenev\n|  Pavel Dybenko\n|  Nikolai Krylenko\n|  Vladimir Antonov-Ovseenko}}\n|  Mikhail Tukhachevsky\n|  Mikhail Frunze\n|  Vasily Blyukher\n|  Alexander Samoylo\n|  Joseph Stalin\n|  Kliment Voroshilov\n|  Fedor Raskolnikov\n|  Dmitry Zhloba\n|  Semyon Budyonny\n|  Hayk Bzhishkyan\n|  Mikhail Muravyov\n|  Dmitry Nadyozhny\n|  Dmitri Parsky\n|  Alexander Krasnoshchyokov}}\n}}\n| strength1         =  50,000–70,000 troops\n|  15,600 troops\n|  30,000 troops\n|  12,950 troops\n|  11,300 troops\n|  70,000 troops\n|  59,150 troops\n|  4,700+ troops\n|  2,500 troops\n|  2,000 troops\n|  150 troops\n}}\n| strength2         = Unknown\n| casualties1       = : 4,112 killed\n| : 938+ killed\n| : 424 killed\n| :179 killed173 missing46 dead from wounds or non-combat related causes657 wounded\n}}\n| casualties2       = Unknown1 landing craft captured by Romanians\n| notes             =\n| campaignbox       =\n}}\nThe Allied intervention in the Russian Civil War consisted of a series of multi-national military expeditions that began in 1918. The initial impetus behind the interventions was to secure munitions and supply depots from falling into the German Empire's hands, particularly after the Bolsheviks signed the Treaty of Brest-Litovsk, and to rescue the Allied forces that had become trapped within Russia after the 1917 October Revolution. After the Armistice of 11 November 1918, the Allied plan changed to helping the  White forces in the Russian Civil War. After the Whites collapsed, the Allies withdrew their forces from Russia by 1925.\nAllied troops landed in Arkhangelsk (the North Russia intervention of 1918–1919) and in Vladivostok (as part of the Siberian intervention of 1918–1922). The British also intervened in the Baltic theatre (1918–1919) and in the Caucasus (1917–1919). French-led Allied forces participated in the Southern Russia intervention (1918–1919).\nAllied efforts were hampered by divided objectives, and war-weariness following World War I. These factors, together with the evacuation of the Czechoslovak Legion in September 1920, led the western Allied powers to end the North Russia and Siberian interventions in 1920, though the Japanese intervention in Siberia continued until 1922 and the Empire of Japan continued to  of Sakhalin until 1925.\nBackground\nRevolution\nIn early 1917 the Russian Empire found itself wracked by political strife – public support for World War I and Tsar Nicholas II had started to dwindle, leaving the country on the brink of revolution. The February Revolution of March 1917 affected the course of the war; under intense political and personal pressure, the Tsar abdicated () and a Russian Provisional Government formed, led initially by Georgy Lvov (March to July 1917) and later by Alexander Kerensky (July to November 1917). The Provisional Government pledged to continue fighting the Germans on the Eastern Front.\nThe Allied powers had been shipping supplies to Russia since the beginning of the war in 1914 through the ports of Arkhangelsk, Murmansk (established in 1915), and Vladivostok. In April 1917 the United States entered the war on the Allied side. U.S. President Woodrow Wilson dropped his reservations about joining the war with the despotic tsar as an ally, and the United States began providing economic and technical support to Kerensky's government.\nThe war became increasingly unpopular with the Russian populace. Political and social unrest grew, with the Marxist anti-war Bolshevik Party, under Vladimir Lenin, increasing its support. Large numbers of common soldiers either mutinied or deserted from the Imperial Russian Army. The Kerensky offensive started on , but a German and Austro-Hungarian counterattack defeated the Russian forces. This led to the collapse of the Eastern Front. The demoralised Russian Army stood on the verge of mutiny and most soldiers had deserted the front lines. Kerensky replaced Aleksei Brusilov with Lavr Kornilov as Commander-in-Chief of the Army (19 July 1917).\nKornilov attempted to set up a military dictatorship by staging a coup (). He had the support of the British military attaché in Petrograd, Brigadier-General Alfred Knox, and Kerensky accused Knox of producing pro-Kornilov propaganda. Kerensky also claimed that Lord Milner, a member of the British War Cabinet, wrote him a letter expressing support for Kornilov. A British armoured-car squadron commanded by Oliver Locker-Lampson, and dressed in Russian uniforms participated in the failed coup. The October Revolution of  led to the overthrow of Kerensky's provisional government and to the Bolsheviks assuming power.\nAccording to William Henry Chamberlin, \"A few weeks after the Bolshevik Revolution, on December 23, 1917, an Anglo-French convention had been concluded in Paris, regulating the future operations of British and French forces on Russian territory. This convention defined as a British 'zone of influence' the Cossack regions, the territory of the Caucasus, Armenia, Georgia and Kurdistan, while the French zone was to consist of Bessarabia, Ukraine and Crimea. There was a certain economic background for this convention; British investment predominated in the Caucasian oil-fields, while the French were more interested in the coal and iron mines of Ukraina.\"\nRussia exits the war\nIn early 1918, forces of the Central Powers invaded Russia, occupying extensive territory, and threatening to capture Moscow and to impose pliant regimes. Lenin wanted to negotiate with Germany, but failed to get approval from his council until late February. In a desperate attempt to end the war, as promised in their slogan 'Peace, Bread, Land', the Russian Soviet Federative Socialist Republic signed the Treaty of Brest-Litovsk (3 March 1918), ending the bloodshed. The Allied Powers felt betrayed and turned against the new regime, aiding its \"White\" enemies and landing troops to prevent Russian supplies from reaching Germany. According to historian Spencer Tucker, the Allies believed the Bolsheviks wouldn't provide an orderly enough regime to stand up to German domination. \"With Brest-Litovsk, the spectre of German domination in Eastern Europe threatened to become reality, and the Allies now began to think seriously about military intervention.\"\nThe perception of betrayal removed whatever reservations the Allied Powers had about overthrowing the Bolsheviks. According to William Henry Chamberlin, even before Brest-Litovsk, \"Downing Street contemplated a protectorate over the Caucasus and the Quai d'Orsay over Crimea, Bessarabia and Ukraine\" and began negotiating deals for funding White generals to bring them into being. R. H. Bruce Lockhart and another British agent and a French official in Moscow tried to organize a coup that would overthrow the Bolshevik regime. They were dealing with double agents and were exposed and arrested. French and British support for the Whites was also motivated by a desire to protect the assets they had acquired through extensive investment in Tsarist Russia.\nCzechoslovak Legions\nThe Czechoslovak Legion was at times in control of most of the Trans-Siberian Railway and all major cities in Siberia. Austro-Hungarian prisoners were of a number of various nationalities; some Czechoslovak prisoners-of-war (POWs) deserted to the Russian Army. Czechoslovaks had long desired to create their own independent state, and the Russians aided in establishing special Czechoslovak units (the Czechoslovak Legions) to fight the Central Powers.\nThe signing of the Treaty of Brest-Litovsk ensured that POWs would be repatriated. In 1917, the Bolsheviks stated that if the Czechoslovak Legions remained neutral and agreed to leave Russia, they would be granted safe passage through Siberia en route to France via Vladivostok to fight with the Allied forces on the Western Front. The Czechoslovak Legions travelled via the Trans-Siberian Railway to Vladivostok. However, fighting between the Legions and the Bolsheviks erupted in May 1918.\nAllied concerns\n, 1919]]\nThe Allied Powers became concerned at the collapse of the Eastern Front and the loss of their Tsarist ally to communism, and there was also the question of the large quantities of supplies and equipment in Russian ports, which the Allied Powers feared might be seized by the Germans. Also worrisome to the Allied Powers was the April 1918 landing of a division of German troops in Finland, increasing speculation they might attempt to capture the Murmansk-Petrograd railway, and subsequently the strategic port of Murmansk and possibly Arkhangelsk. Other concerns regarded the potential destruction of the Czechoslovak Legions and the threat of Bolshevism, the nature of which worried many Allied governments. Meanwhile, Allied materiel in transit quickly accumulated in the warehouses in Arkhangelsk and Murmansk. Estonia had established a national army and, with the support of the British Royal Navy and Finnish volunteers, were defending against the 7th Red Army's attack.\nFaced with these events, the British and French governments decided upon an Allied military intervention in Russia. The first British landing in Russia came at the request of a local (Bolshevik) Soviet council. Fearing a German attack on the town, the Murmansk Soviet requested that the Allies landed troops for protection. British troops arrived on 4 March 1918, the day after the signing of the Treaty of Brest-Litovsk between Germany and the Bolshevik government.}} In the summer of 1918, Leon Trotsky, the head of the Red Army, welcomed the arrival of British, American, and French troops in Murmansk.\n, August 1918]]\nSeverely short of troops to spare, the British and French requested that President Wilson provide American soldiers for the campaign. In July 1918, against the advice of the United States Department of War, Wilson agreed to the limited participation of 5,000 United States Army troops in the campaign. This force, which became known as the \"American North Russia Expeditionary Force\" (a.k.a. the Polar Bear Expedition) were sent to Arkhangelsk while another 8,000 soldiers, organised as the American Expeditionary Force Siberia, were shipped to Vladivostok from the Philippines and from Camp Fremont in California.\nThat same month, the Canadian government agreed to the British government's request to command and provide most of the soldiers for a combined British Empire force, which also included Australian and Indian troops. Some of this force was the Canadian Siberian Expeditionary Force; another part was the North Russia Intervention. A Royal Navy squadron was sent to the Baltic under Rear-Admiral Edwyn Alexander-Sinclair. This force consisted of modern s and s. In December 1918, Sinclair sailed into Estonian and Latvian ports, sending in troops and supplies, and promising to attack the Bolsheviks \"as far as my guns can reach\". In January 1919, he was succeeded in command by Rear-Admiral Walter Cowan.\nThe Japanese had already landed marines in Vladivostok in January 1918. Responding to the allied build-up, they would increase their commitment in Siberia to 70,000 troops under their own command. They desired the establishment of a buffer state in Siberia, and the Imperial Japanese Army General Staff viewed the situation in Russia as an opportunity for settling Japan's \"northern problem\". The Japanese government was also intensely hostile to communism.\nThe Italians created the special \"Corpo di Spedizione\" with Alpini troops sent from Italy and ex-POWs of Italian ethnicity from the former Austro-Hungarian army who were recruited to the Italian Legione Redenta. They were initially based in the Italian Concession in Tientsin and numbered about 2,500.\nHowever, while Soviet propaganda often portrayed Allied intervention as an alliance dedicated to crushing a nascent, worldwide communist revolution in the cradle, in reality the Allies were not particularly interested in intervention. While there were some loud voices in favour, such as Winston Churchill, these were very much in the minority. The main concern for the Allies was to defeat the German Empire on the Western Front. While the Bolsheviks' repudiation of Russia's national debt and seizure of foreign-owned industries did cause tension, the main concern for the Allies was the Bolshevik's desire to get Russia out of the First World War. The Allies disliked the Whites, who were seen as nothing more than a small group of conservative nationalists who showed no signs of planning reform. Government ministers were also influenced by anti-White public opinion, which was being mobilised by trade unions. The low casualties suffered by the Allies is indicative of the low level of their combat involvement. However, the Soviets were able to exploit the Allied intervention for propaganda purposes. }}\nChurchill, the loudest voice in favour of action, was a vehement anti-socialist and saw Bolshevism as socialism's worst form. As a result, he attempted to gain Allied support for intervention on ideological grounds. Most of the British press were ideologically hostile to the Bolshevik regime, and supported the intervention. Many newspapers actively encouraged Allied intervention during the war.\nForeign forces throughout Russia\nin European Russia, 1919]]\nNumbers of foreign soldiers who were present in the indicated regions of Russia:\n* 1,500 French and British troops originally landed in Arkhangelsk\n* 14,378 British troops in North Russia\n* 1,800 British troops in Siberia\n* 50,000 Romanian troops belonging to the 6th Romanian Corps under General Ioan Istrate, in Bessarabia.\n* 23,351 Greeks, who withdrew after three months (part of I Army Corps under Maj. Gen. Konstantinos Nider, comprising 2nd and 13th Infantry Divisions, in the Crimea, and around Odessa and Kherson)\n* 15,000 French also in the Southern Russia intervention\n* 40,000 British troops in the Caucasus region by January 1919\n* 13,000 Americans (in the Arkhangelsk and Vladivostok regions)\n* 11,500 Estonians in northwestern Russia\n* 2,500 Italians in the Arkhangelsk region and Siberia\n* 1,300 Italians in the Murmansk region.\n* 150 Australians (mostly in the Arkhangelsk regions)\n* 950 British troops in Trans-Caspia\n* 70,000+ Japanese soldiers in the Eastern region\n* 4,192 Canadians in Siberia, 600 Canadians in Arkhangelsk\n* 2,300 Chinese troops in Vladivostok\nCampaigns\nNorth Russia\nThe first instance of British involvement in the war was the landing in Murmansk in early March 1918. 170 British troops arrived on 4 March 1918, the day after the signing of the Treaty of Brest-Litovsk. }} On 2 May, British troops took part in their first military engagement. A party of White Finns had captured the Russian town of Pechenga, and British marines fought alongside Red Guards to capture the area by 10 May with several casualties. In this first engagement, British troops had fought against a White force in support of the Red Army. In the following months, British forces in the area were largely engaged in small battles and skirmishes with White Finns. }} However, Soviet–Allied relations were passing from distrust to open hostility. A Bolshevik force was sent to take control of the town up the Murmansk-Petrograd railway, but in a series of skirmishes the Allied forces repelled the attack. This was the first real fighting between the troops of the Allies and the Reds. A trainload of Bolshevik troops was also found at Kandalaksha heading north, but the British managed to convince them to stop, before Serb reinforcements arrived and took over the train.\ntank in Arkhangelsk]]\nIn September, a force of 1,200 Italians arrived as well as small Canadian and French battalions. By early Autumn, British forces were also 6,000 strong. On 2 August 1918, anti-Bolshevik forces, led by Tsarist Captain Georgi Chaplin, staged a coup against the local Soviet government at Arkhangelsk. General Poole had coordinated the coup with Chaplin. Allied warships sailed into the port from the White Sea. There was some resistance at first, but 1,500 French and British troops soon occupied the city. The Northern Region Government was established by Chaplin and popular revolutionary Nikolai Tchaikovsky.\nOn the Murmansk front, the British 6th Royal Marine Light Infantry Battalion was ordered to seize the village of Koikori on 28 August as part of a wide offensive into East Karelia. The attack on the village was disorganized and resulted in three marines killed and 18 wounded. An attack on Ussuna was also repulsed. The next morning, faced with the prospect of another attack on the village, one Marine company refused to obey orders and withdrew themselves to a nearby friendly village. As a result, 93 men were sentenced to death and others received substantial sentences of hard labour. In December 1919, the government, under pressure from several MPs, revoked the sentence of death and considerably reduced the sentences of all the convicted men.\nOn 4 September 1918 the promised American forces arrived. Three battalions of troops, supported by engineers and under the command of Colonel George Stewart, landed in Arkhangelsk. This force numbered 4,500 troops. A British River Force of 11 monitors (HMS M33, HMS Fox and others), minesweepers, and Russian gunboats was formed to use the navigable waters at the juncture of the rivers Vaga and Northern Dvina. Some 30 Bolshevik gunboats, mines, and armed motor launches took their toll on the Allied forces.\nThe 2/10th Royal Scots cleared the triangle between the Dvina and Vaga and took a number of villages and prisoners. By late September, US Marines and 2/10th Royal Scots had reached Nijne-Toimski, which proved too strong for the lightly equipped Allied force. On 27 October, Allied forces were ambushed at Kulika near Topsa, losing at least 27 men killed and dozens wounded, a figure that could have been higher if it had not been for a detachment of Poles who bravely covered the retreat as others panicked. The allied troops were mainly inactive in the winter of 1918, building blockhouses with only winter patrols sent out. On the first occasion that White Russian troops were sent into the line of combat during the North Russian campaign, on 11 December 1918, the White Russian troops mutinied. The ringleaders were ordered to be shot by General Ironside.\nWithin four months the Allied Powers' gains had shrunk by  along the Northern Dvina and Lake Onega area as Bolshevik attacks became more sustained. The Bolsheviks launched their largest offensive yet on Armistice Day 1918 along the Northern Divina front, and there was heavy fighting at the Battle of Tulgas (Toulgas). When the news came through of the Armistice with Germany, many of the British troops in Arkhangelsk eagerly anticipated a quick withdrawal from North Russia, but their hopes were soon dashed.\nin Murmansk]]\nOn 27 January 1919, word was received at Arkhangelsk that the Bolsheviks had fired poison gas shells at British positions on the Arkhangelsk-Vologda railway. The use of poison gas by the Bolsheviks was soon announced in the British press. The Bolsheviks would use poison gas shells against the British on at least two occasions in North Russia, although its effectiveness was limited.\nIn the Murmansk sector, the British decided that the only way to achieve success in ejecting the Bolsheviks from power was by raising a large White Russian Army. However, recruitment and conscription attempts failed to provide a sizable enough force. It was therefore decided in February 1919 to move south to capture more populated areas from which recruits could be conscripted. This would be the first significant action on the Murmansk front between the Allies and the Bolsheviks. Met with stiff opposition, the town of Segeja was captured and half the Red Army garrison was killed, wounded or taken prisoner. During the February offensive, the British forces pushed the Red Army beyond Soroko and as far south as Olimpi. Despite an attempted Bolshevik counter-attack, by 20 February 3,000 square miles of territory had been taken.\nThe furthest advance south on the northern front in early 1919 was an Allied Mission in Shenkursk on the Vaga River and Nizhnyaya Toyma on the Northern Dvina. The strategically important city of Shenkursk was described by British commander Ironside as 'the most important city in North Russia' after Arkhangelsk, and he was determined to hold the line. However, British and Allied troops were expelled from Shenkursk after an intense battle on 19–20 January 1919. Over the following days, RAF aircraft flew several bombing and reconnaissance missions to support the withdrawal from Shenkursk. The battle of Shenkursk was a key turning point in the campaign, and the Allied loss put them very much on the back foot for the next few months along the railway and Dvina fronts.\nOn the railway front south of Arkhangelsk, the Allied forces were gradually advancing. On 23 March, British and American troops attacked the village of Bolshie Ozerki, but the first wave of attackers were pushed back. The next day, 500 Bolsheviks attacked Shred Mekhrenga but were eventually repelled, with over 100 Red troops being killed despite the British suffering no fatal casualties. Another Bolshevik attack was launched on Seltskoe, but that attack also failed. In total, the Bolsheviks lost 500 men in one day in the two attacks.\nMany of the British and foreign troops often refused to fight, and Bolshevik attacks were launched with the belief that some British troops may even defect to their side once their commanders had been killed. The numerous White mutinies demoralised Allied soldiers and affected morale. The Allied forces were affected by their own mutinies, with the British Yorkshire Regiment and Royal Marines rebelling at points as well as American and Canadian forces.\nA major offensive was launched in May in the Murmansk sector. During the advance on Medvyeja-Gora on 15 May, the stubborn Bolshevik defence was only ended with a bayonet charge. British and Bolshevik armoured trains then traded blows as the British attempted to seize control of more of the local railway. The town was finally seized on 21 May, as Italians and French troops pushed forward with the British. The May offensive never quite carried the Allies as far as the largest town in the region, Petrozavodsk.\nIn April, public recruiting began at home in Britain for the newly created 'North Russian Relief Force', a voluntary force which had the claimed sole purpose of defending the existing British positions in Russia. By the end of 3 April 500 men had enlisted, and they were then sent to North Russia. Public opinion regarding the formation of the force was mixed, with some newspapers being more supportive than others. The relief force eventually arrived in North Russia in late May–June.\nbefore their departure for the front, Arkhangelsk 1919.]]\nOn 25 April a White Russian battalion mutinied, and, after 300 men went over to the Bolsheviks, they turned and attacked the Allied troops at Tulgas. In May and June, the units of the original British force which had arrived in arkhangelsk in August and September 1918 finally received orders for home. In early June the French troops were withdrawn and the Royal Marines detachment was also sent home, followed by all Canadian troops after it was requested that they be repatriated. All remaining American troops also left for home. The Serbian troops (perhaps Maynard's best infantry fighters) became unreliable as others withdrew around them. By 3 July, the Italian company was on the verge of mutiny as its men were seriously disaffected with their continued presence in Russia so long after the Armistice. In mid July, the two companies of American railway troops were also withdrawn. The French and American troops stationed in the north were similarly reluctant to fight, and French troops in arkhangelsk refused to take part in any action that was not merely defensive. Despite being told when volunteering that they were only to be used for defensive purposes, plans were made in June to use the men of the North Russian Relief Force in a new offensive aimed at capturing the key city of Kotlas and linking up with Kolchak's White forces in Siberia. The villages of Topsa and Troitsa were attacked in anticipation of this action, with 150 Bolsheviks being killed and 450 being captured. However, with Kolchak's forces being pushed back rapidly, the Kotlas offensive was cancelled.\nIn early July 1919, another White unit under British command mutinied and killed its British officers, with 100 men then deserting to the Bolsheviks. Another White mutiny was foiled later in the month by Australian troops. On 20 July, 3,000 White troops in the key city of Onega mutinied and handed over the city to the Bolsheviks. The loss of the city was a significant blow to the Allied forces as it was the only overland route available for the transfer of supplies and men between the Murmansk and Arkhangel theatres. This event led to the British losing all remaining trust for the Whites and contributed to the desire to withdraw. Attempts were soon made to retake the city, but in a failed attack in late July the British had to force detachments of White forces to land at gunpoint in the city, since they were adamant that they would not take part in any fighting. On one Allied ship, 5 Bolshevik prisoners captured in battle even managed to temporarily subdue the 200 White Russians on board and take control of the ship with little resistance. Despite the Allied setbacks, a battalion of marines, the 6th Royal Marine Light Infantry, was sent to assist the British at the end of July.\nThe final two months on the Dvina front, August and September 1919, would see some of the fiercest fighting between British and Red Army troops of the Civil War. In August, a major offensive was launched along the Dvina to try and strike a blow at Bolshevik morale and to increase the morale of the White forces before a withdrawal. As part of this, an attack was made on the village of Gorodok. During the attack, 750 Bolshevik prisoners were taken, and one battery was found to have been manned by German troops. The village of Seltso was also attacked, but a strong Bolshevik defence halted any British progress. However, the villages of Kochamika, Jinta, Lipovets and Zaniskaya were captured with little resistance. In total the offensive led to the deaths of around 700 Reds and was considered a success.\nA final offensive on the Murmansk front was launched by the Allied forces in September, aimed at destroying the Bolshevik forces to leave the White forces in a good position after the planned withdrawal. Serbian forces supported the British as they attempted to push on to the Bolshevik villages of Koikori and Ussuna and attack Konchozero. However, the defences at Koikori and Ussuna were much stronger than expected, and the attacks failed. The Serbs and White Russian forces attacked again on 11 and 14 September, but these attacks also failed. However, the British did manage to reach the Nurmis river by 18 September, with 9,000 troops, including 6,000 White Russians, participating in this final offensive.\nOn 22 September, with the Allied withdrawal already ongoing, a British detachment from the Royal Scots was sent by river to Kandalaksha on four fishing boats to stop sabotage operations carried out by Finnish Bolsheviks against the railway there. The British party was ambushed even before landing and suffered heavy casualties, with 13 men killed and 4 wounded. Consequently, the unopposed Bolsheviks destroyed a number of bridges, delaying the evacuation for a time. One of the fatalities, a private from Ormesby, Yorkshire, who succumbed to his injuries on 26 September, was the last British servicemen to die in action in Northern Russia.\nBy this point, British troops had started withdrawing to Arkhangelsk in order to prepare themselves for the evacuation of North Russia. On the morning of 27 September 1919, the last Allied troops departed from Arkhangelsk, and on 12 October, Murmansk was abandoned.\n* British Empire\n** Royal Navy: a flotilla of over 20 ships including the seaplane carriers;  and\n** British Army: 236th Infantry Brigade, 6th Battalion Royal Marine Light Infantry (RMLI), 548th (Dundee) Army Troops Company, Royal Engineers, 2/10th (Cyclist) Battalion, Royal Scots Royal Scots, 52nd Battalion, Manchester Regiment, and elements of the Royal Dublin Fusiliers.\n** Slavo-British Allied Legion (SBAL): a British-trained and led contingent composed mostly of expatriate Russian anti-Bolshevik, Finnish and Estonian volunteers (including Dyer's Battalion).\n** Canadian Field Artillery (67th and 68th Batteries of the 16th Brigade, Canadian Field Artillery)\n** Royal Air Force: contingent comprising Airco DH.4 bombers, Fairey Campania and Sopwith Baby seaplanes along with a single Sopwith Camel fighter.\n* United States\n** North Russia Expeditionary Force (also known as the Polar Bear Expedition): approximately 8,000 personnel from the US Army, including the: 310th Engineers, 339th Infantry, 337th Field Hospital, and 337th Ambulance Company. Also the 167th and 168th Railroad Companies, which were sent to Murmansk to operate the Murmansk to Petrograd line.\n** US Navy: the cruiser  during August and September 1918 (including 53 personnel attached to British naval units)\n* France: 2,000 French Army personnel, mainly from the Armée coloniale (e.g. the 21st Colonial Battalion) and engineers.\n* Other countries: 1,000 Serbian and Polish infantry attached to White Russian forces in the north (as distinct to those in Siberia forces, which included the Czechoslovak Legion); 1,200 Italians, a small number of volunteers from other countries.\nBaltics and Northwestern Russia\nin the west in 1918–1919]]\nAlthough the Estonian Army had attained control over its country, the opposing 7th and Estonian Red Armies were still active. The Estonian High Command decided to invade across the border into Russia in support of the White Russian Northern Corps. They went on offensive at Narva, catching the Soviets by surprise and destroying their 6th Division. Estonian and White attacks were supported along the Gulf of Finland's coast by the Royal Navy and the Estonian Navy and marines. On the night of 4 December, the cruiser  struck a German-laid mine while on patrol duties north of Liepāja, and sank with the loss of 11 of her crew. At this time, the new Estonian government was weak and desperate. The Estonian Prime Minister asked Britain to send military forces to defend his capital, and even requested that his state be declared a British protectorate. The British would not meet these pleas.\nBritish cruisers and destroyers soon sailed up the coast close to the Estonian–Russian border and laid down a devastating barrage on the advancing Bolsheviks' supply lines. On 26 December, British warships captured the Bolshevik destroyers  and , which at the time were shelling the port of Tallinn. Both units were presented to the Estonian Provisional Government and, as Lennuk and Vambola, formed the nucleus of the Estonian Navy.\nThe Estonian Pskov offensive commenced simultaneously on 13 May 1919. Its Petseri Battle Group destroyed the Estonian Red Army, captured the town on 25 May, and cleared the territory between Estonia and the Velikaya River. A few days later, the Northern Corps forces arrived in Pskov. On 19 June 1919, the Estonian Commander-in-Chief Johan Laidoner rescinded his command over the White Russians, and they were renamed the Northwestern Army. Shortly afterward, General Nikolai N. Yudenich took command of the troops.\nWith the front approaching, the garrison of the Krasnaya Gorka fort mutinied. To support the mutiny, a flotilla of British Coastal Motor Boats under the command of Lieutenant Augustus Agar raided Kronstadt Harbour, sinking the cruiser Oleg and the depot ship Pamiat Azova on 17 June 1919. In a second attack in August, the Bolshevik battleships Petropavlovsk and Andrei Pervozvanny were damaged, at the cost of three CMBs. The attackers also managed to sink the important Russian submarine depot ship. Despite the actions, the mutiny was eventually suppressed by the  guns of the Bolshevik battleships.\nThe next offensive of the Northwestern Army was planned on 10 July 1919, but the armaments and supplies expected from the Allies did not arrive. Nor did the Estonians desire to proceed with the fruitless war since with the initial peace approach of April 1919 the Russian Bolshevik government already guaranteed the recognition of the independent Estonian state. So when British Gen. Gough requested on 8 August Estonians for the military assistance to Yudenich, Estonians in return asked both Yudenich and the Allies to recognise their state first. Gough's deputy, Brigadier Gen. Frank Marsh required Yudenich to immediately issue a statute that would establish the Government of the North-West Russian Region encompassing Petrograd, Pskov and Novgorod Governorates that would officially guarantee de jure recognition of Estonia. On 16 August Times made the deal public that angered the Foreign Office and the War Cabinet, and caused a decline in further military aid to Yudenich.\nHowever, the Northwestern Army launched operation White Sword, the last major effort to capture Petrograd on 9 October, with arms provided by Britain and France, and the operational support by the Estonian Army, Estonian Navy, and the Royal Navy. Securing Petrograd for the White forces was one of the main goals of the campaign for the British. The Estonian and British forces made a joint land and naval attack against Krasnaya Gorka, while the Estonian 2nd Division attempted to throw the 10th Red Division across the Velikaya, and the 3rd Division attacked toward Pytalovo and Ostrov. The Northwestern Army approached to within  of Petrograd, but the Red Army repulsed them back to the Narva River. Distrustful of the White Russians, the Estonian High Command disarmed and interned the remains of the Northwestern Army that retreated behind the state border. With the failure to capture Petrograd, the British had failed to achieve one of their main goals.\nSignificant unrest took place among British sailors in the Baltic. This included small-scale mutinies amongst the crews of , the latter due in part to the behaviour of Admiral Cowanand other ships stationed in Björkö Sound. The causes were a general war-weariness (many of the crews had fought in World War I), poor food and accommodation, a lack of leave, and the effects of Bolshevik propaganda. }}\nIn total, the British lost 128 men in the Baltic campaign, with at least 27 also being wounded and 9 being captured. Britain committed around 90 ships to the campaign, and of this number 17 ships were lost and around 70 were damaged.\nSouthern Russia and Ukraine\nOn 18 December 1918, a month after the armistice, the French landed in Odessa and Sevastopol. In Odessa, a 7-hour battle ensued between the French and the forces of the Ukrainian People's Republic before they gained full control of the city. The landings began the intervention in southern Russia (later Ukraine) which was to aid and supply General Denikin's White Army forces, the Volunteer Army, fighting the Bolsheviks there. The campaign involved mainly French, Greek and Polish troops. The morale of the French troops and the sailors of their fleet in the Black Sea was always low, and most wanted to be demobilised and sent home. The morale of the Greek and Polish interventionist forces was no better. A local warlord, Otaman Nykyfor Hryhoriv, aligned himself with the Bolsheviks on 18 February 1919 and advanced his army against the foreign invaders. With his army of 10–12,000 men, he first attacked allied-held Kherson on 2 March which was occupied by just 150 French, 700 Greek and a few hundred volunteers of questionable reliability. After heavy fighting, the city was taken on 9 March. The French lost 4 killed and 22 wounded, while the Greeks had some 250 casualties. Local Greek residents were also killed in the aftermath. After the conquest of Kherson, Hryhoriv turned his forces against Nikolaev, where there were even less allied troops present. There were still 12,000 well equipped German troops in the city, but they had no intention to participate in the fighting.\nThe local French commander was allowed to negotiate a truce with Hryhoriv, and on 14–16 March all allied and German troops were evacuated by sea without any fighting, leaving considerable quantities of war material behind.\nBy April 1919, the troops were withdrawn from Odessa after further threats from Nykyfor Hryhoriv's Army, before the defeat of the White Army's march against Moscow. A major mutiny amongst French sailors on the Black Sea had in part necessitated the withdrawal. Some British sailors dispatched to the Black Sea had also mutinied. The last Allied troops left Crimea on 29 April 1919.\nGeneral Wrangel reorganized his army in the Crimea; however, with the deteriorating situation, he and his soldiers fled Russia aboard Allied ships on 14 November 1920.\nBessarabia\nAfter the Bolshevik forces of the Rumcherod attacked the region of Bessarabia, the Romanian government of Ion I. C. Brătianu decided to intervene, and on , the 11th Infantry Division under General Ernest Broșteanu entered Chișinău. The Bolshevik troops retreated to Tighina, and after a battle retreated further beyond the Dniester. The battle of Tighina was one of the two significant engagements of the 1918 Bessarabian Campaign. It lasted for five days, between 20 and 25 January, and ended in a Romanian victory, albeit with significant Romanian casualties (141 dead). Romanian troops captured 800 guns.\nThe second important battle was fought at Vâlcov, between 27 January and 3 February. The actions of Bolshevik warships (including three Donetsk-class gunboats), managed to delay the Romanians for several days, but the ships had to retreat on 3 February due to no longer being able to adjust and correct their aiming, after Romanian artillery destroyed the shore-based Bolshevik artillery observation posts. Later that day, Romanian troops occupied Vâlcov. The Romanians captured the Russud-class landing craft K-2 as well as several more barges armed with a total of eight 152 mm Obuchov guns.\nSiberia\n]]\nThe joint Allied intervention began in August 1918. Britain sent a 1,800-strong unit to Siberia commanded by Labour Party MP and trade union leader Lieutenant Colonel John Ward, which was the first Allied force to land in Vladivostok on 3 August. The Japanese entered through Vladivostok and points along the China–Russia border with more than 70,000 troops eventually being deployed. The Japanese were joined by American, Canadian, French, and Italian troops. Elements of the Czechoslovak Legion which had reached Vladivostok greeted the Allied forces. The Americans deployed the 27th Infantry and 31st Infantry regiments out of the Philippines, plus elements of the 12th, 13th and 62nd Infantry Regiments out of Camp Fremont. Chinese troops were also sent to Vladivostok by the Beiyang government partly to protect Chinese merchants there.\nThe Japanese were expected to send only around 7,000 troops for the expedition, but by the end of their involvement in Siberia had deployed 70,000. The deployment of such a large force for a rescue operation made the Allied Powers wary of Japanese intentions. On 5 September, the Japanese linked up with the vanguard of the Czech Legion, a few days later the British, Italian and French contingents joined the Czechs in an effort to re-establish the Eastern Front beyond the Urals; as a result the European Allied Powers trekked westward. The Canadians largely remained in Vladivostok for the duration. The Japanese, with their own objectives in mind, refused to proceed west of Lake Baikal. The Americans, suspicious of Japanese intentions, also stayed behind to keep an eye on them. By November, the Japanese occupied all ports and major towns in the Russian Maritime Provinces and Siberia east of the city of Chita.\nThe Allied Powers lent their support to White Russian elements from the summer of 1918. There were tensions between the two anti-Bolshevik factions, the White Russian government led by Admiral Alexander Kolchak and the Cossacks led by Grigory Semyonov and Ivan Kalmykov, which also hampered efforts. The Allied forces originally took over from some front-line White forces and helped hold the line against the Bolsheviks in the far-east. The British unit helped defend the line at Kraevesk. Outnumbered and outgunned, the small Allied forces were forced to withdraw. Two British armoured trains with two 12-pounder naval guns and two machine guns each were sent from Vladivostok as reinforcements. Operating under a Japanese commander, the small British unit and other Allied forces played a small but important part in the battle of Dukhovskaya on 23–24 August 1918. Five Bolshevik armed trains were attacked, supported by the British forces' own two armoured trains, and there were 600 Japanese casualties. This limited but decisive action eliminated organised Bolshevik resistance on the Ussuri front.\nBy the end of October, the British force had finished its journey West from Vladivostok all the way to the front lines at Omsk. The unit stayed in the city for the next six months over the cold Siberian winter. It may have played a role in the coup in the city in November 1918 which brought Admiral Kolchack to power as 'Supreme Leader' of Russia. The force went forward with the advancing Czechs and Russians and continued to provide artillery support along the railway from Omsk to Ufa in October and November. The British would later form an important part of the 'Kama River Flotilla', a boat unit that assisted the Whites by attacking the Bolshevik forces along the course of the river. They bombarded Red troop concentrations, protected bridges and provided direct fire support and attacked Bolshevik boats on the river. In one action, the flotilla sank the Bolshevik flagship on the river and destroyed one other boat. They were later driven back by the Bolshevik advance on Perm.\nThe small British force was withdrawn in the summer of 1919. All remaining Allied forces were evacuated in 1920, apart from the Japanese who stayed until 1922.\nCaucasus\n, 1917.]]\nIn 1917, Dunsterforce, an Allied military mission of under 1,000 Australian, British, and Canadian troops (drawn from the Mesopotamian and Western Fronts), accompanied by armoured cars, deployed from Hamadan some  across Qajar Persia. It was named after its commander General Lionel Dunsterville. Its mission was to gather information, train and command local forces, and prevent the spread of German propaganda.\nLater on, Dunsterville was told to take and protect the city of Baku and its oil fields. During the early stages of the Russian Civil War the Caucasus region was governed by three de facto independent states, the Menshevik-dominated Democratic Republic of Georgia, the Republic of Armenia and the Azerbaijan Democratic Republic, and the main White Russian forces had no real control. The British feared that Baku could be captured by the Ottoman Empire, since their forces in the area were advancing, and if they gained control of the fleet in the port they could transport troops to the city of Krasnovodsk directly across the Caspian Sea from Baku. This action would open Central Asia to the Turks and give them access to British-controlled India through Afghanistan.\nto mark the Allied evacuation, 1920.]]\nThe British landed in Baku on 17 August 1918. The British force was at this time 1,200 men strong. Dunsterforce was initially delayed by 3,000 Russian Bolshevik troops at Enzeli but then proceeded by ship to Baku on the Caspian Sea. This was the primary target for the advancing Ottoman forces and Dunsterforce endured a short, brutal siege in September 1918. The British held out for the first two weeks of September, inflicting heavy casualties on the enemy. A final Turkish attack on 14 September lasted until sunset, and, facing an overwhelmingly larger force, the British were forced to withdraw. The troops escaped from the port on three waiting ships on the same day. In total, the battle for Baku had resulted in around 200 British casualties, including 95 dead.\nHowever, having been defeated in World War I, the Ottoman Empire had to withdraw its forces from the borders of Azerbaijan in the middle of November 1918. Headed by General William Thomson, a British force of 1,600 troops arrived in Baku on 17 November, and martial law was implemented on the capital of Azerbaijan Democratic Republic until \"the civil power would be strong enough to release the forces from the responsibility to maintain the public order\". There were also British occupations of the Georgian cities of Tiflis and Batum in Georgia, along with the full length of the Baku-Batum railway, since the British wanted to protect this strategic line which connected the Black Sea and the Caspian Sea. By January 1919, the British presence was 40,000 strong, the largest of all British intervention contingents in Russia. Again, these British occupations of territory in the Caucasus were in part motivated by a desire to 'protect India's flank' and secure the local oilfields, but they were also motivated by a desire to support the three new independent states and supervise the German and Ottoman withdrawal. The British forces served only a defensive purpose and were withdrawn in the summer of 1919, as regular troops were needed elsewhere and others were long overdue for demobilisation after the Armistice that ended the First World War. The last British forces left Baku on 24 August.\nTranscaspian campaign\nWith the British fearing that German and Ottoman forces may penetrate into Russian Central Asia, possibly via a crossing of the Caspian sea to the key port of Krasnovodsk, the Transcaspian area became an area of interest. Allied military action began on 11 August 1918, when General Malleson intervened in support of the Ashkhabad Executive Committee, who had ousted the Tashkent Soviet Bolsheviks from the western end of the Trans-Caspian Railway in July 1918 and had taken control of Krasnovodsk. Malleson had been authorised to intervene with Empire and British troops, in what would be referred to as the Malleson mission. He sent the machine gun section of the 19th Punjabi Rifles to Baýramaly located on the Trans-Caspian railway. On 28 August, the Bolsheviks attacked Kushkh on the Afghan border but were repulsed, with 3 officers and 24 rank and file being killed or wounded. 2 British liaison officers were shot from behind as they advanced, presumably treacherously. There was further action at Kaka on 28 August as well as 11 and 18 September. The British forces were reinforced on 25 September by two squadrons of the 28th Light Cavalry. At this point, Malleson, against the wishes of the Indian government, decided to push further into Transcaspia and attack the Bolsheviks. Fighting alongside Transcaspian troops, they subsequently fought at Arman Sagad (between 9 and 11 October) and Dushak (14 October). At Dushak, the British force suffered 54+ killed and 150+ wounded while inflicting 1,000 casualties on the Bolsheviks. British attacks continued to inflict heavy losses on Bolshevik forces.\nBy 1 November, the British force had re-occupied Merv and on instructions of the British government, halted their advance and took up defensive positions at Bairam Ali. The Transcaspian forces continued to attack the Bolsheviks to the north. After the Transcaspian forces were routed at Uch Aji, their commander Colonel Knollys sent the 28th Cavalry to their support at Annenkovo. In January 1919, one company of the 19th Punjabi Rifles was sent to reinforce the position at Annenkovo, where a second battle took place on 16 January that resulted in 48 casualties. During February, the British continued to inflict heavy losses on Bolshevik forces. The British Government had decided on 21 January to withdraw the force, and the last troops left for Persia on 5 April.\nAftermath\nAccording to John Bradley, the Allied intervention, which treated White generals as \"servile satellites\" with little independence, gave the White generals' a reputation as \"undignified puppets\". This caused the White movement to be discredited while the Bolsheviks appeared more independent and patriotic, driving former Imperial military leaders into joining the Bolsheviks instead. The Allied intervention helped to bolster the Bolsheviks, as they also successfully used this to attack the Whites and paint themselves in a positive light.\nAllied withdrawal\nThe Allied Powers withdrew in 1920. The Japanese military stayed in the Maritime Provinces of the Russian Far East until 1922 and in northern Sakhalin until 1925, following the signing of the Soviet–Japanese Basic Convention in Beijing, in which Japan agreed to withdraw its troops from Russia. In return, the Soviet Union agreed to honor the provisions of the Treaty of Portsmouth.\nAssessment by historians\nIn 1957, former Communist Party USA member, Frederick L. Schuman, wrote that the consequences of the expedition \"were to poison East-West relations forever after, to contribute significantly to the origins of World War II and the later 'Cold War,' and to fix patterns of suspicion and hatred on both sides which even today threaten worse catastrophes in time to come.\" For Soviet leaders, the operation was proof that Western powers were keen to destroy the Soviet government if they had the opportunity to do so. Modern historian Robert Maddox summarised, \"The immediate effect of the intervention was to prolong a bloody civil war, thereby costing thousands of additional lives and wreaking enormous destruction on an already battered society.\"\nHistorian John M. Thompson argued that while the intervention failed to stop the Bolshevik revolution in Russia, it prevented its spread to central Europe. He wrote:\nHowever, it did succeed in so thoroughly engaging the forces of revolutionary expansionism that the countries of war-torn eastern and central Europe, potentially most susceptible to the Bolshevik contagion, were able to recover enough social and economic balance to withstand Bolshevism. The interventionist attempt left an ugly legacy of fear and suspicion to future relations between Russia and the other great powers, and it strengthened the hand of those among the Bolshevik leadership who were striving to impose monolithic unity and unquestioning obedience on the Russian people.\nLegacy\nAccording to Sheldon M. Stern, Stalinist propaganda later portrayed the Allied intervention as a U.S. military invasion of Russia while denying or minimizing the American famine relief effort that saved millions of Russian lives during 1921–1923.\nWinston Churchill, who had been the most prominent supporter of a campaign to remove the Bolsheviks from power, long lamented the Allies' failure to crush the Soviet state in its infancy. This was especially the case during the breakdown of western-Soviet relations in the aftermath of World War II and the start of the Cold War. In 1949, Churchill stated to the British Parliament:\n}}\nIn a further speech at the National Press Club, Washington D.C., in June 1954, Churchill lamented:\n}}\nSee also\n* Arthur Sullivan (Australian soldier)\n* Australian contribution to the Allied Intervention in Russia 1918–1919\n* British campaign in the Baltic (1918–1919)\n* Central Powers intervention in the Russian Civil War\n* Canadian Siberian Expeditionary Force\n* Italian Legione Redenta\n* Japanese intervention in Siberia\n* American Expeditionary Force, North Russia\n* Kronstadt rebellion\nReferences\nBibliography\n*\n*\n*\n*\n*\n*\n*\nFurther reading\n* Carley, Michael Jabara. \"Allied Intervention and the Russian Civil War, 1917–1922,\" International History Review 11#4 (1989), pp.&nbsp;689–700 [https://www.jstor.org/stable/40106089 in JSTOR]. Historiography.\n*\n* Flake, Lincoln. \"'Nonsense From the Beginning'Allied Intervention in Russia's Civil War at 100: Historical Perspectives from Combatant Countries.\" Journal of Slavic Military Studies 32.4 (2019): 549–552. [https://www.tandfonline.com/doi/pdf/10.1080/13518046.2019.1690189 online]\n*\n*\n* Fuller, Howard.  \"Great Britain and Russia's Civil War: 'The Necessity for a Definite and Coherent Policy'.\" Journal of Slavic Military Studies 32.4 (2019): 553–559.\n*\n*\n*\n*\n*\n* Kurilla, Ivan. \"Allied Intervention From Russia's Perspective: Modern-Day Interpretations.\" Journal of Slavic Military Studies 32.4 (2019): 570–573.\n* Long, John W. \"American Intervention in Russia: The North Russian Expedition, 1918–19.\" Diplomatic History 6.1 (1982): 45–68.\n*\n*\n*\n*\n* Richard, Carl J. \"'The Shadow of a Plan': The Rationale Behind Wilson's 1918 Siberian Intervention.\" Historian 49.1 (1986): 64–84. Historiography\n*\n*\n* Thompson, John M. \"Allied and American Intervention in Russia,  1918–1921,\" in ''Rewriting Russian History: Soviet Interpretations of Russia's Past, ed. Cyril E. Black (New York, 1962), pp.&nbsp;319–380. [https://archive.org/details/rewritingrussian0000blac online], how Soviet view changed over time.\n* Trani, Eugene P. \"Woodrow Wilson and the decision to intervene in Russia: a reconsideration.\" Journal of Modern History 48.3 (1976): 440–461. [https://www.jstor.org/stable/1878747 in JSTOR]\n* Unterberger, Betty Miller. \"Woodrow Wilson and the Bolsheviks: The \"Acid Test\" of Soviet–American Relations.\" Diplomatic History'' 11.2 (1987): 71–90.\n*\nExternal links\nde:Russischer Bürgerkrieg#Intervention der Entente-Mächte"
    }
  ]
}