{
  "content": [
    {
      "type": "text",
      "text": "# Alliance of National Forces (Czech Republic)\n\n| abbreviation     = ANS\n| leader           =\n| founder          = Ludvík Adámek\n| founded          =\n| dissolved        =\n| headquarters     = Chudenická 1059/30102 00 Prague\n| ideology         = Social conservatismNationalismEuroscepticismRussophiliaAnti-immigrationAnti-Islam\n| position         = Far-right\n| colours          =  White Red|border=darkgray}} Blue\n| website          = [https://aliancenarodnichsil.cz/ aliancenarodnichsil.cz]\n| country          = the Czech Republic\n}}\nThe Alliance of National Forces (; ANS) was a Czech political party. It was established in 2011 under the name Citizens 2011 and its first chair was Ludvík Adámek. The party ran in the 2013 legislative election only in Prague. On June 2, 2018, Vladimíra Vítová was registered as chair, and on July 2, 2018, the party was renamed the Alliance of National Forces.\nPosition\nAccording to its website, the Alliance of National Forces supported the Czech Republic's withdrawal from NATO and the European Union, the \"traditional family\", the nationalization of strategic sectors of the national economy and natural resources (water and minerals), and the abolition of church restitution. The party opposed \"migration planned by the European Union\", \"modern slavery of multinational companies and debt collections\", the repeal of the Beneš decrees, and \"efforts to liquidate the Czech state\".\nThe first website of the Alliance of National Forces featured Karel Janko, Chairman of the Czech National Socialist Party, Zbyněk Štěpán, Chairman of National Prosperity, and Vladimíra Vítová, Chairwoman of the Czech Peace Forum. The website also listed 13 advisers and consultants, including 3 former Czech Social Democratic Party ministers (Jaroslav Bašta, Ivan David and Eduard Zeman).\nElectoral history\n2019 European Parliament election\nThe party participated in the 2019 European Parliament election, with Jiří Černohorský as the lead candidate. The party received 1,971 votes (0.08%) and did not win any seats.\n2020 Czech Senate election\nThe party participated in the 2020 Senate election, but did not have any senators elected. After the election, the party lodged a complaint with the Supreme Administrative Court to invalidate the election due to unequal access to the media. The Supreme State Court rejected the complaint, stating that \"balance and equal treatment in these contexts cannot be understood mechanically as absolute equality of candidates, but from the point of view of so-called graduated equality\".\n2021 Czech Chamber of Deputies election\nThe party participated in the 2021 Czech parliamentary election, with Vladimíra Vítová as the lead candidate. The party received 5,167 votes (0.10%) and did not win any seats.\n2023 Czech presidential election\nThe party endorsed Freedom and Direct Democracy candidate Jaroslav Bašta in the 2023 Czech presidential election, who came fifth with 248,375 votes (4.45%).\n2024 European Parliament election\nThe party participated in the 2024 European Parliament election as a part of the Alliance for the Independence of the Czech Republic coalition, with Hynek Blaško as the lead candidate. Others running for ANS on this list included former member of the Chamber of Deputies Miroslav Sládek and other members of his Rally for the Republic – Republican Party of Czechoslovakia.\nElection results\nChamber of Deputies\n{| class=wikitable style=text-align:right\n|-\n! Election\n! Leader\n! Votes\n! %\n! Seats\n! +/–\n! Government\n|-\n! 2013\n| align=left rowspan=2 |Ludvík Adámek\n| 455\n| 0.01 (#22)\n| }}\n|\n|\n|-\n! 2017\n| 359\n| 0.00 (#29)\n| }}\n|  0\n|\n|-\n! 2021\n| align=left rowspan=1 |Vladimíra Vítová\n| 5,166\n| 0.09 (#18)\n| }}\n|  0\n|\n|}\nEuropean Parliament\n{| class=\"wikitable\" style=text-align:center;\"\n! Election\n! List leader\n! Votes\n! %\n! Seats\n! +/−\n! EP Group\n|-\n! 2014\n| Petra Benešová\n| 1,299\n| 0.08 (#30)\n| }}\n| New\n| rowspan=3 |−\n|-\n! 2019\n| Jiří Černohorský\n| 1,971\n| 0.08 (#32)\n| }}\n|  0\n|-\n! 2024\n| Hynek Blaško\n| 14,910\n| 0.50 (#12)\n| }}\n|  0\n|-\n|}\nReferences\nExternal links\n* [http://aliancenarodnichsil.cz/ Aliance národních sil]"
    }
  ]
}