{
  "content": [
    {
      "type": "text",
      "text": "# Almeric Paget, 1st Baron Queenborough\n\n|image       = Almeric Hugh Paget.jpg\n|alt         =\n|caption     =\n|constituency_MP = Cambridge\n|parliament  =\n|majority    = 587\n|term_start  = January 1910\n|term_end    = 1917\n|predecessor = Stanley Buckmaster\n|successor   = Sir Eric Geddes\n|prior_term  =\n|birth_name=Almeric Hugh Paget\n|birth_date         =\n|birth_place        = London, England\n|death_date         =\n|death_place        = Hatfield, Hertfordshire, England\n|restingplace       =\n|restingplacecoordinates =\n|birthname          =\n|citizenship        =\n|nationality        =\n|party              = Conservative Party\n|otherparty         =\n|spouse             =\n*\n}}\n|partner            =\n|relations          =\n|children           = 5, including Olive and Dorothy\n|residence          =\n|alma_mater         =\n}}\nAlmeric Hugh Paget, 1st Baron Queenborough (14 March 1861 – 22 September 1949) was a British industrialist and Conservative Party politician. He was a founder of the Military Massage Service and the Cambridgeshire Battalion of The Suffolk Regiment and treasurer of the League of Nations Union.\nEarly life\nBorn in London on 14 March 1861, Paget was the sixth and youngest son of Lord Alfred Paget (the fifth son of Henry Paget, 1st Marquess of Anglesey) and Cecilia Wyndham. His grandfather had commanded the British cavalry at the Battle of Waterloo in 1815. Educated at Harrow, he was later made an honorary Fellow of Corpus Christi College, Cambridge.\nCareer\nPaget briefly worked for the Midland Railway before emigrating to the United States in 1881. He established a cattle ranch at Le Mars, Iowa, where he became acquainted with Theodore Roosevelt. Later he relocated to St. Paul, Minnesota, where he was a real estate agent. Paget finally moved to New York City, where his brother Arthur introduced him to society. He lived in what is now Lubin House, Syracuse University's alumni centre.\nHe joined Henry Melville Whitney in establishing the Dominion Coal Company Ltd. in 1893 and the Dominion Iron and Steel Company Ltd. in 1901 at Sydney, Nova Scotia.\nElection to Parliament\nIn 1901 the Pagets moved to England, ostensibly due to the poor health of Paget's wife, Pauline. The family initially settled in Brandon Park House, Suffolk, and Paget was appointed High Sheriff of Suffolk in 1909.\nPaget was a highly successful yachtsman, winning the first prize in the open handicap race from Cannes to Monte Carlo in 1902, and winning the Tsar's prize at Cowes Week in 1909. Following his return to England from the US, he was appointed rear-commodore of the Royal Thames Yacht Club (1905-1910); he subsequently served as vice-commodore (1911-1923; 1932-1935; 1946-1949) and commodore (1924-1931; 1936-1945). The Belvidere Cup was named by Paget in 1913, in honour of a boat owned by his father which had competed for the cup the first time it was contested in 1845.\nIn 1906, Paget contested the Cambridge constituency, losing with 3,924 votes to 4,232 for Stanley Buckmaster. Paget was named president of the Eastern Provincial Division of the National Union of Conservative and Unionist Associations in 1909. In January 1910 he narrowly won the seat with 4,667 votes to 4,080 for Buckmaster, holding the seat until his resignation in 1917.\nFirst World War\nUniform of the Almeric Paget Military Massage Corps, 1916\nIn August 1914 Paget founded the Almeric Paget Massage Corps (renamed the Almeric Paget Military Massage Corps in December 1916, and the Military Massage Service in 1919). Initially 50&nbsp;masseuses were recruited, rapidly rising to over 100. The corps established clinics in every hospital in the United Kingdom, with central direction from Paget's London townhouse at 39 Berkeley Square. After the war, clinics were continued in the poorer parts of London, with treatment provided for all who applied.\nIn November 1914, Paget founded the Massage and Electrical Outpatient Clinic, in premises at 55&nbsp;Portland Place, London, loaned by Lady Alexander Paget. For the duration of the First World War the clinic treated an average of 200&nbsp;wounded officers and soldiers per day. In addition to the Massage Corps, following the outbreak of war Paget sponsored the formation of a Cambridgeshire Battalion formed of volunteers. Comprising approximately 1,350&nbsp;volunteers, it became the 11th Battalion of The Suffolk Regiment, popularly known as the Cambs Suffolks. The Battalion was initially posted within the UK, transferring to France in 1916; 970 members died during World War I including 190 on 1 July 1916, first day on the Somme.\nEnnoblement and later career\nPaget resigned his parliamentary seat in July 1917. On 18 January 1918 he was raised to the peerage as Baron Queenborough, of Queenborough in the County of Kent.\nIn 1920, he was appointed treasurer of the League of Nations Union, an office he held for sixteen years. He resigned in 1936 in protest at the League's recognition and admission of the Soviet Union. Lord Queenborough was created Knight Grand Cross of the Order of the British Empire (GBE) in 1926.\nLord Queenborough served as president of the Ferrocarril Chihuahua al Pacifico (Chihuahua and Pacific Railroad), chairman of Caxton Electrical Developments, chairman of Siemens Brothers & Co., and chairman of the Queenborough Port Development Company.  He was also governor of Guy's Hospital, Southwark; president of Miller General Hospital, Greenwich; president of Preston Hall Hospital, Maidstone; member of the Council of the Zoological Society of London; a Knight of Justice of the Order of St. John of Jerusalem (K.J.St.J.); and president of the Royal Society of St George.\nDuring the 1930s, Paget was a keen supporter of Francisco Franco and Adolf Hitler, extolling the Führer as late as 1939. He was also a fanatical anti-Bolshevik campaigner, and in a 1935 article described a perceived plot between the Freemasons and the Communists to take over Europe. Despite these sympathies, he was appointed President of the National Union of Conservative and Unionist Associations in 1928–29 and 1940–41.\nPersonal life\nOn 12 November 1895, he married Henry Melville Whitney's niece, the American heiress Pauline Payne Whitney. The marriage was solemnised at St. Thomas's Church in New York City, and among those attending was President Grover Cleveland. The Pagets were the parents of two daughters:\n*Olive Cecilia (b. 1899 – d. 9 September 1974, married three times and later the owner of Leeds Castle). Her third husband, Sir Adrian Baillie, Bt., was Member of Parliament for Tonbridge from 1937 to 1945.\n*Dorothy Wyndham (b. 1905 – d. 9 February 1960, never married)\nIn the middle of World War I, Pauline died at Esher, Surrey, after a three weeks' illness on 22 November 1916. She was buried at Hertingfordbury, Hertfordshire.\nOn 19 July 1921, in New York City, he married conspiracy theorist and anti-Mormon agitator Edith Starr Miller, daughter of a wealthy American couple, William Starr Miller and Edith Caroline (Warren) Miller. Granddaughter of George H. Warren, one of the founders of the Metropolitan Opera, Edith Miller had written Common Sense in the Kitchen and Occult Theocrasy. After marriage Paget and Edith moved to Camfield Place, near Hatfield, Hertfordshire. They had three daughters:\n*Audrey Elizabeth (b. 4 May 1922 – d. 1991, aviator), mother-in-law of Max Wyndham, 7th Baron Leconfield, 2nd Baron Egremont\n*Enid Louise (b. 14 July 1923)\n*Cicilie Carol (b. 18 April 1928)\nThe Pagets later separated, and Edith sued in New York City for legal separation on 8 January 1932, citing cruelty. She died in Paris a year later, on 16 January 1933.  He died at Hatfield on 22 September 1949, aged 88. With no male heir, his title became extinct.\nFootnotes\nExternal links\n*"
    }
  ]
}