{
  "content": [
    {
      "type": "text",
      "text": "# Alone (The Walking Dead)\n\n|writer       = Curtis Gwinn\n|director     = Ernest Dickerson\n|music        = \"Blackbird Song\" by Lee DeWyze\n|photographer   = Michael E. Satrazemis\n|editor         = Kelley Dixon\n|guests       =\n*Jeff Kober as Joe\n*Keith Brooks as Dan\n*J. D. Evermore as Harley\n*Marcus Hester as Len\n*Davi Jay as Tony\n*Eric Mendenhall as Billy\n|prev         = Still\n|next         = The Grove\n| season_article = The Walking Dead season 4\n| episode_list = List of The Walking Dead episodes\n}}\n\"Alone\" is the thirteenth episode of the fourth season of the post-apocalyptic horror television series The Walking Dead, which aired on AMC on March 9, 2014. The episode was written by Curtis Gwinn and directed by Ernest Dickerson.\nBob Stookey's past is explored, and the reason for his recently changed optimistic outlook is revealed. This episode marks the beginning of the relationship between Bob and Sasha, as well as the mysterious kidnapping of Beth Greene after having long spent time bonding with fellow survivor, Daryl Dixon. Maggie Greene's efforts to find husband Glenn (Steven Yeun) and Sasha's reluctance to travel further to Terminus are also explored, which causes the group to split up, before they find one another and subsequently vow not to be alone again.\nThe episode title refers to Bob Stookey, having been the lone survivor of two previous groups, and Daryl Dixon, being on his own after Beth is mysteriously abducted.\nPlot\nA flashback shows Bob wandering on his own. One day he is approached by Daryl and Glenn. After asking Bob the three questions to be able to join the prison, Daryl lets Bob come with them.\nIn the present, Bob, Sasha, and Maggie are staying together after the prison attack, Maggie insisting they look for Glenn. Bob is almost bitten in a walker attack, but the wound only rips at his bandages. Sasha, who has come to appreciate Bob, is relieved. As they travel, they discover a sign near train tracks directing them to sanctuary at Terminus. Bob recalls a radio broadcast he had heard on a supply run about Terminus and suggests they go there; Maggie agrees, believing Glenn may have made it there too. Sasha, believing they should look for other signs of Glenn's survival, concedes to the others. When they set up camp that night, Maggie decides to go off on her own, leaving a note to the others she feels it is too dangerous for them to join her. The two set off to follow her. They find another sign for Terminus, along with a blood-written note from Maggie to Glenn telling him to go to Terminus, and know they are on the right track. Sometime later, they arrive at a small rail town, but there is no sign of Maggie. Sasha suggests they could make this a permanent camp but Bob refuses, wanting to continue to Terminus. After kissing Sasha, he leaves on his own. Sasha, while watching him depart, spots Maggie's body amid a pile of walker corpses. In her surprise, she knocks out a window, luring walkers nearby. Maggie, who had only used the walker corpses to mask herself while sleeping, wakes up and helps Sasha kill the walkers. They agree to catch up to Bob and continue to Terminus. Later, Glenn also sees one of the signs for Terminus.\nElsewhere, Daryl teaches Beth how to track and use his crossbow. When a walker surprises them, they turn to flee but Beth gets her foot caught in an animal trap, and Daryl is forced to carry her. They come to a large house that overlooks a graveyard. Daryl secures them inside and they discover it is a surprisingly well-kept funeral home; the rooms are clean, there is a supply of food, and various dead walkers are dressed in formal wear as if for a funeral. Daryl believes someone has been keeping the place but cannot find that person. They take some of the provisions, and Beth leaves a note thanking their provider. As they wait out the night, Daryl hears a dog barking at the door, but when he goes to see, the dog runs away. Some time later, the dog barks again, but when Daryl answers the door, a group of walkers flood the house. He holds back the horde giving Beth time to escape out a back window before he follows. He exits the house just in time to see a car driving off with a white cross on its rear window. Seeing Beth's bag nearby, he realizes she has been abducted and tries to chase down the car to no avail. After a while walking, Daryl collapses to then find himself surrounded by several armed men, the same group that previously invaded the house in which Rick, Carl, and Michonne were staying. Their leader Joe (Jeff Kober) gets everybody to lower their weapons, and asks Daryl to join their group.\nProduction\n\"Alone\" was written by supervising producer Curtis Gwinn; it is his second writing credit for the series. The episode was directed by regular Walking Dead director Ernest Dickerson.\nThis episode focuses entirely on the characters of Bob Stookey (Lawrence Gilliard Jr.), Sasha (Sonequa Martin-Green), Maggie Greene (Lauren Cohan), Daryl Dixon (Norman Reedus) and Beth Greene (Emily Kinney); Glenn Rhee (Steven Yeun) has a brief appearance.  Andrew Lincoln (Rick Grimes), Danai Gurira (Michonne), Chandler Riggs (Carl Grimes), and Melissa McBride (Carol Peletier) are all credited but do not appear. Chad L. Coleman (Tyreese) is also absent but is credited as \"also starring\". Jeff Kober reprises his guest starring role as Joe from the episode \"Claimed\".\nThe song featured at the beginning and the end of the episode is \"Blackbird Song\" by Lee DeWyze. The song was also featured on the season soundtrack The Walking Dead (AMC Original Soundtrack), Vol. 2. The song debuted on Billboard's \"Pop Digital Songs\" chart at number twenty-nine.\nReception\nViewership\nUpon airing, the episode was watched by 12.65 million American viewers, and received an 18–49 rating of 6.3. This marks a rise in viewers from the previous episode, but a slight decrease in adults 18–49; the previous episode received an 18–49 rating of 6.4.\nCritical reception\nThe episode received very positive reviews. Critics praised the writing, Beth's disappearance, the re-introduction of Joe and the marauders and Bob Stookey's character development. Phil Dyess-Nugent of The A.V. Club gave the episode an A− rating, saying \"In what future historians will refer to as 'the post-Governor era of The Walking Dead, the show has stepped in to fill the gap left by the conclusion of Breaking Bad. This is now AMC's very slow-moving, contemplative, character-based genre show that may go a long time between outbreaks of bloody mayhem, outbreaks that serve as beats in the action but that scarcely threaten to overshadow the quieter moments.\" Roth Cornet of IGN gave the episode a score of 7.8 out of 10.\nReferences\nExternal links\n*[https://www.amc.com/twdu/the-walking-dead/season-4/episode-13 \"Alone\"] at AMC\n*"
    }
  ]
}