{
  "content": [
    {
      "type": "text",
      "text": "# Alternate Warriors\n\nAlternate Warriors is an alternate history anthology edited by Mike Resnick, published in the United States by Tor Books. The anthology contains 29 short stories, including Resnick's own \"Mwalimu in the Squared Circle\". The other stories are by different authors, and present scenarios where famous peacemakers are instead warriors in a way that did not occur in real life. The anthology was released on September 1, 1993.\nStories\n{| class=\"wikitable\"\n!Title !! Author !! Scenario\n|-\n|\"Mwalimu in the Squared Circle\" || Mike Resnick || In 1979, in order to end the Uganda-Tanzania War, Julius Nyrere accepts Idi Amin's challenge to a boxing match. However, being outweighed by 200 pounds, Nyrere struggles to stay alive in the boxing ring.\n|-\n|\"Jane's Fighting Ships\" || Esther Friesner || In 1798, Napoleon invades and conquers Britain. In 1811, Jane Austen meets Davy Crockett and they find out that they have much in common, including a distaste for l'empereur's ambitions.\n|-\n|\"Taking Action\" || Lawrence Schimel || In 1955, after he sees into the future and has visions of the 1992 Rodney King beating, Martin Luther King Jr. is pushed away from the path of non-violence, leading to the civil rights movement following a more violent route. This eventually leads to a duel between King and Alabama governor George Wallace.\n|-\n|\"Because Thou Lovest the Burning-Ground\" || Michael P. Kube-McDowell || In 1890, after failing several university exams, Mohandas Gandhi meets a Thuggee cultist along the road and becomes his disciple. After that, Gandhi's new education and the violent movement he starts years later following the Jallianwala Bagh massacre in 1919. The [https://external-preview.redd.it/5GtwpOXLBFnT9K-Lh7j76x76OqjMI670j4RmUou8B1I.jpg?auto=webp&s=d8285068e788cc50005d36011a1cb60c56b11d94 front cover of the anthology] depicts a muscular Gandhi angrily holding a rocket launcher, referencing the story.\n|-\n|\"Ballad of the Spanish Civil Guard\" || Kathe Koja ||\n|-\n|\"The Vatican Outfit\" || Laura Resnick || In 1978, Mafiosi warns Pope John Paul I of his imminent assassination and after several more assassination attempts, the Pope adopts a new management style to run the church.\n|-\n|\"Tut’s Wife\" || Maureen F. McHugh || Following the death of Pharaoh Tutankhamun in 1325 BC, his now widowed wife/half-sister Ankhesenamun soughs a new husband to protect her and to help spread the faith of Aten in Egypt.\n|-\n|\"Extreme Feminism\" || Nicholas A. DiChario || In 1865, Susan B. Anthony buys a gun and after demonstration gone awry and despite her desires, she finds herself becoming an outlaw. This leads to the struggle for Women's suffrage in the United States to go down a more violent turn.\n|-\n|\"The Battle of All Mothers\" || Jack Nimersheim ||\n|-\n|\"Jihad\" || Mercedes Lackey || In 1918 after Daraa, T.E. Lawrence experiences a revelation, converts to Islam and preaches a holy war. Lawrence and the Arabs then capture Damascus without British help.\n|-\n|\"Sam Clemens and the Notable Mare\" || Mel. White || Sam Clemens heads east from Nevada in 1864 and gets captured by Quantrill's Raiders. Clemens' Indian horse does his part to rout the guerilla band when Union soldiers arrive.\n|-\n|\"...But the Sword!\" || Anthony R. Lewis || In 1202, Francis of Assisi becomes a Crusader rather than a priest, but quits in disgust after witnessing Constantinople being sacked. Prior to that, Francis was drafted by the Pope to lead a new militant order and lead the crusade that recaptured Jerusalem in 1221, which would cause his later canonization.\n|-\n|\"Fugato\" || Barry N. Malzberg || During World War II in 1942, Leonard Bernstein is drafted into the US Army and is classified as a 1A. In 1944, while he is trapped inside an Ardennes farmhouse, Bernstein contemplates the path that led him there.\n|-\n|\"The Firebringers\" || David Gerrold || Various Hollywood stars were in reality the types of men they played in the movies. For example, Colonel Gregory Peck flies a bomber carrying a nuclear device to Berlin, though he has second thoughts and argues with Ronald Reagan, Humphrey Bogart and others.\n|-\n|\"Albert Schweitzer and the Treasures of Atlantis\" || George Alec Effinger ||\n|-\n|\"Queen of Asia\" || Judith Tarr || In 332 BC, after being dismayed by her son Darius III's show of cowardice in fighting Alexander the Great, his mother Sisygambis has him killed and becomes a regent for her grandson Drypetis. With Persia under her direction, Sisygambis has them attack Alexander the Great from behind at Tyre, and she comes up with a novel fate for her new prisoner.\n|-\n|\"Zealot\" || Bill Fawcett || Moses leads the Israelites into guerrilla warfare with the Pharaoh in Egypt and after three years of fighting, they occupy pharaoh's Gizan palace. However, they soon find themselves being besieged by an overwhelming force.\n|-\n|\"The Cold Warrior\" || Jack C. Haldeman II ||\n|-\n|\"For Love of God\" || Michelle Sagara || In 1170, Thomas Becket does not return after fleeing England a dispute between him and King Henry II. Armies representing England and France meet on a French battlefield, and Becket remembers the history of his relationship with Henry.\n|-\n|\"Al Einstein — Nazi Smasher!\" || Lea Hernandez || Instead of becoming a scientist, Albert Einstein becomes a professional musician and later a spy. Years later on a mission to Peenemünde, Einstein meets temptress Eva Braun and the evil dictator Adolf Schicklgruber.\n|-\n|\"Mind over Matter\" || Jack Nimersheim ||\n|-\n|\"One by One\" || Beth Meacham || In 1813, Tecumseh and his Confederacy turns the tide against the United States at the Battle of the Thames by preventing himself from getting killed. This results in the Northwest Territories only becoming a US state decades later. Even over a century after the battle, conflicts between whites and reds in \"Indiana\" constantly simmers with acts of terrorism and retaliation.\n|-\n|\"The Mark of the Angel\" || Tappan Wright King || After being wounded while on a mission from Rome to Paris in 1943, amnesiac Angelo Roncalli (the future Pope John XXIII) joins the French Resistance. In 1961, he is reminded of his days in the Resistance.\n|-\n|\"Standing Firm\" || Barbara Delaplace || In 1938, Neville Chamberlain make up his mind to stand up to Adolf Hitler at Munich, including a conversation with appeasement proponent Winston Churchill.\n|-\n|\"A Sense of Loyalty, a Sense of Betrayal\" || Brian Thomsen || In 1918, after Sidney Reilly is caught attempting to overthrow Vladimir Lenin and Leon Trotsky, was offered a deal.\n|-\n|\"Unmerited Favor\" || Brad Linaweaver || In 30 AD, Jesus Christ preaches for a more militant line. He then hands out weapons to his new followers and takes them out into the desert to confront Satan. Several are angered, however, that they are not attacking the Romans.\n|-\n|\"Death of a Dream\" || Jack C. Haldeman II || In 1963, J. Edgar Hoover decided to smear Martin Luther King Jr. just before he gives his famous \"I Have a Dream\" speech, leading to the civil rights movement falling apart. A decade later, King prepares to assassinate law and order President Richard J. Daley and weeps over the race war that has consumed the United States.\n|-\n|\"Monsieur Verne and the Martian Invasion\" || Josepha Sherman || In a steampunk version of the 19th century, inventor Jules Verne discovers and battles Martians.\n|-\n|\"The Arrival of Truth\" || Kristine Kathryn Rusch || In the 1850s, Sojourner Truth marches through the Southern States and tells the slaves to take what is theirs, causing a slave revolt.\n|-\n|}\nReviews\n*Review by Mark R. Kelly (1993) in Locus, #394 November 1993\n*Review by Leigh Grossman (1994) in Horror #1, January 1994\nSee also\n* List of works by Mike Resnick\nReferences\nExternal links\n*[https://web.archive.org/web/20080904221818/http://www.iblist.com/book41092.htm Internet Book List entry]"
    }
  ]
}