{
  "content": [
    {
      "type": "text",
      "text": "# Alternate picking\n\nAlternate picking is a guitar playing technique that employs alternating downward and upward strokes in a continuous fashion. If the technique is performed at high speed on a single string or course voicing the same note, it may be referred to as \"tremolo picking\" or \"double picking\".\nAlternate picking involves a continuous down-up or up-down motion of the picking hand, even when not picking a note (except when the gap lasts longer than one full up-down motion). In this manner, an up-beat (such as an even-numbered eighth note or, at faster tempos, sixteenth note) will always be played with an upward picking stroke, while the down-beats are always played with downward picking strokes. This allows for fluid incorporation of legato-based notes such as hammer-ons and/or pull-offs in the middle of picked phrases.\nThe technique has many advantages and some disadvantages, largely depending on the licks the guitarist is attempting to play. For example, during fast passages, alternate picking is necessary in keeping the picking arm from tiring out. At very high tempos, alternate picking is essentially required, since techniques like downpicking are made not feasible.\nMost scalar runs are most easily played using alternate picking. Similarly, the complex, syncopated rhythm guitar patterns found in death metal require a good alternate picking technique to play fast and accurately.\nOn the other hand, large arpeggios (especially those spanning more than one octave) are very difficult to play using pure alternate picking and almost impossible to play at great speeds, which is why many guitarists choose to employ sweep picking to play these arpeggios (e.g. Glenn Tipton, K. K. Downing, Frank Gambale & Mario Parga). Similarly, some kinds of licks are easier when played using such specialized techniques as legato, economy picking (a hybrid of alternate and sweep picking) or tapping.\nDespite some of the well-known disadvantages of the technique, some guitarists (such as Al Di Meola, Steve Morse) emphasize the near-exclusive use of alternate picking, even in situations where another technique would be easier, claiming that pure alternate picking leads to a more consistent sound and allows for greater control of tone.\nAlternate picking can be heard in almost all styles of picked guitar music, from jazz and bluegrass, to heavy metal.\nVictor Wooten uses his thumb for alternate picking, as displayed on his DVD Super Bass Solo Technique.\nSee also\n*Guitar picking\n*Downpicking\nReferences\nFurther reading\n*\nExternal links\n*[http://live4guitar.com/article/alternate-picking-explained Alternate Picking Explained]\n*[http://www.howtoplaybass.co.uk/alternate_picking.html Alternate Picking for Bass Players]"
    }
  ]
}