{
  "content": [
    {
      "type": "text",
      "text": "# Amaroo, Queensland\n\n| pop                 = 17\n| pop_year            =\n| pop_footnotes       =\n| established         =\n| postcode            = 4829\n| area                = 9325.5\n| timezone            = AEST\n| utc                 = +10:00\n| dist1               = 83.1\n| dir1                = W\n| location1           = Boulia\n| dist2               = 360\n| dir2                = N\n| location2           = Bedourie\n| dist3               = 371\n| dir3                = S\n| location3           = Mount Isa\n| dist4               = 446\n| dir4                = W\n| location4           = Winton\n| dist5               = 1805\n| dir5                = NW\n| location5           = Brisbane\n| lga                 = Shire of Boulia\n| lga2                = Shire of Diamantina\n| stategov            = Gregory\n| fedgov              = Kennedy\n| fedgov2             = Maranoa\n| near-n              = Georgina\n| near-ne             = Wills\n| near-e              = Wills\n| near-se             = Bedourie\n| near-s              = Bedourie\n| near-sw             = Sturt\n| near-w              = Toko\n| near-nw             = Georgina\n}}\nAmaroo is an outback locality split between the Shire of Boulia and the Shire of Diamantina, both in Central Western Queensland, Australia. In the , Amaroo had a population of 17 people.\nGeography\nAmaraoo is a large but largely uninhabited locality in the Channel Country. Rivers like the Georgina River, Burke River, Hamilton River and Sylvester Creek flow through the locality, all of them part of the Lake Eyre basin. These rivers only flow intermittently and, even when they flow, the water usually evaporates before it reaches Lake Eyre. The land is relatively flat so there is no clear single course for these rivers but rather they flow along a series of channels in the same direction (that is, a braided river).\nThe waterholes that result from the flooding of these rivers sustain both native fauna and support cattle grazing which is the principal land use.\nThe Boulia Bedourie Road passes through the locality from the north-east (Wills) to the south (Bedourie). The Donohue Highway passes through the locality from the west (Toko) to the north-east (Wills)\nThe Tropic of Capricorn passes from east to west through the locality.\nThe entire locality is within the Marian Downs cattle station, which being  also extends into some neighbouring localities. As at 2017, the property is the largest of 14 cattle stations owned by the North Australian Pastoral Company (NAPCO). The homestead is located at  approx  west of the Boulia Bedourie Road.\nHistory\nThe locality takes its name from Lake Amaroo, which in turn derives its name from the Kogai word \"Amu\" meaning water.\nNAPCO purchased Marion Downs in 1934.\nDemographics\nIn the , Amaroo had a population of 22 people.\nIn the , Amaroo had a population of 17 people.\nEducation\nThere are no schools in Amaroo. The nearest government primary school is Boulia State School in Boulia to the north-east., but students from most parts of Amaroo would be too distant to attend this school. Also, there are no nearby secondary schools. The alternatives are distance education and boarding school.\nReferences\nExternal links"
    }
  ]
}