{
  "content": [
    {
      "type": "text",
      "text": "# Amelia Edwards\n\n|birth_place = London, United Kingdom\n|death_date =\n|death_place = Weston-super-Mare, United Kingdom\n|resting_place = St Mary's Church, Henbury\n|nationality =\n|other_names =\n|occupation =\n|years_active =\n|known_for =\n|notable_works =\n|education =\n}}\nAmelia Ann Blanford Edwards (7 June 1831 – 15 April 1892), also known as Amelia B. Edwards, was an English novelist, journalist, traveller and Egyptologist. Her literary successes included the ghost story The Phantom Coach (1864), the novels ''Barbara's History (1864) and Lord Brackenbury (1880), and the travelogue of Egypt A Thousand Miles up the Nile (1877). She also edited a poetry anthology published in 1878.\nIn 1882, she co-founded the Egypt Exploration Fund. She gained the nickname \"Godmother of Egyptology\" for her contribution.\nEarly life\n, University College, London]].]]\nBorn on 7 June 1831 in Islington, London, to an Irish mother and a father who had been a British Army officer before becoming a banker, Edwards was educated at home by her mother and showed early promise as a writer. She published her first poem at the age of seven and her first story at the age of twelve. Thereafter came a variety of poetry, stories and articles in several periodicals, including Chambers's Journal, Household Words and All the Year Round. She also wrote for the Saturday Review and the Morning Post''.\nIn addition, Edwards became an artist. She would illustrate some of her own writings and also paint scenes from other books she had read. She was talented enough at the age of 12 to catch the eye of George Cruikshank, who went so far as to offer to teach her, but this talent of hers was not supported by Edwards's parents, who saw art as a lesser profession and the artist's way of life as scandalous. Their negative decision haunted Edwards through her early life. She would wonder frequently whether art would not have been her true calling.\nThirdly, Edwards took up composing and performing music for some years, until she suffered a bout of typhus in 1849 that was followed by a frequently sore throat. This made it hard for her to sing, causing her to lose interest in music and even regret the time she had spent on opera. Other interests she pursued included pistol shooting, riding and mathematics.\nFiction\nEarly in the 1850s, Edwards began to focus more exclusively on being a writer. Her first full-length novel was ''My Brother's Wife (1855). Her early novels were well received, but it was Barbara's History (1864), a novel involving bigamy, that established her reputation. She spent much time and effort on the settings and backgrounds of her books, estimating that it took her about two years to complete the research and writing of each. This paid off when her last novel, Lord Brackenbury (1880), went into several editions.\nEdwards wrote several ghost stories, including \"The Phantom Coach\" (1864), which frequently appears in anthologies. The background and characters in many of her writings are influenced by personal experiences. For example, Barbara's History'' (1864) uses Suffolk as the background, which she had visited for a few enjoyable summer holidays as a child.\nPersonal life\nIn January 1851, Amelia Edwards became engaged to a Mr Bacon (first name unknown), possibly out of consideration for her ageing parents, who may have been worried for their daughter's future economic security. There are no signs that point to a love relationship; on the contrary, Edwards does not seem to have felt any particular sympathies for her fiancé. In December 1851, she broke off the engagement.\nAmelia Edwards formed emotional attachments almost exclusively with women. From the early 1860s onwards, she lived with Ellen Drew Braysher (1804–1892, see below), a widow 27 years her senior who had lost her husband and daughter not long after Edwards' parents had died and was to become her companion until both women died in early 1892. Another significant person in Edwards' life was Ellen Byrne, the wife of a pastor and school inspector, with whom Edwards apparently entered a love relationship during the second half of the 1860s. The relationship ended when the husband, John Rice Byrne, was assigned a different school district and the couple moved away, which left Edwards deeply distraught.\nEdwards' papers, archived at Somerville College, contain no reference to the intimate quality of this relationship, but a letter from writer and early homosexual activist John Addington Symonds to sexologist Havelock Ellis reveals that Edwards had mentioned it to Symonds after the two had become friends around 1864. According to Symonds, John Rice Byrne was aware of the nature of his wife's feelings for Edwards and condoned the relationship. Ellis anonymized this information and used it in his publication Studies in the Psychology of Sex Vol. 2 as an example of what he termed \"sexual inversion\".\nEdwards further maintained important, close friendships with painter Marianne North (1830–1890), her travelling companion Lucy Renshaw (1833–1919) and her closest confidante during her later years, Kate Bradbury (later Griffith), who also became executrix of Edwards' will.\nDolomites\nEdwards first heard about the Dolomites in 1853, through sketches brought back to England from Italy. On 27 June 1872, she embarked on a trip through the mountains with her friend Lucy Renshaw. That day they left Monte Generoso for Venice, one of the three known ways to enter the Dolomites, but not before parting from Renshaw's maid and courtier, who disapproved of such a journey.\nInstead the two women hired mountain guides from the region. On 1 July 1872, after a three-day stay in Venice, Edwards and Renshaw left for Longarone, Cortina d'Ampezzo, Pieve di Cadore, Auronzo di Cadore, Val Buona, Caprile, Agordo, Primiero, Predazzo, Fassa Valley, Passo Fedaia, Sasso Bianco, Forno di Zoldo, Zoppè di Cadore and Caprile, and ended their journey in Bolzano.\nAt the time of Edwards's visit, the Dolomites were described as terra incognita and even educated persons had never heard of them. This journey was described in her book A Midsummer Ramble in the Dolomites (1873), later entitled Untrodden Peaks and Infrequent Valleys. During the expedition, Edwards also sought works of Titian, finding a Madonna and Child in Serravalle (Vittorio Veneto) and two other paintings at a village church in Cadore.\nAfter her descent from the mountains, Edwards described civilized life as a \"dead-level World of Commonplace\". In the summer of 1873, dissatisfied by the end of their journey, Edwards and Renshawe took to a walking tour of France. However, this was interrupted by torrential rains, a factor that influenced them in looking towards Egypt.\nEgypt\n(illustration from A Thousand Miles up the Nile)]]\nEdwards, again accompanied by Lucy Renshaw, toured Egypt in the winter of 1873–1874, experiencing a fascination with the land and its cultures, ancient and modern. Journeying southwards from Cairo in a hired dahabiyeh (manned houseboat), the two women visited Philae and ultimately reached Abu Simbel, where they remained for six weeks. Another party member was the English painter Andrew McCallum, who discovered a sanctuary that came to bear his name for some time afterwards. Their boat joined a flotilla with another female English traveller, Marianne Brocklehurst, also travelling with a female companion. Brocklehurst and Edwards remained friends and Brocklehurst later supported her Egypt Exploration Fund.\nEdwards wrote a successful, self-illustrated description of her Nile voyage entitled A Thousand Miles up the Nile (1877). Her travels in Egypt made her aware of increasing threats to ancient monuments from tourism and modern development. She set out to hinder these through public awareness and scientific endeavour, becoming an advocate for research and preservation of them. In 1882, she co-founded the Egypt Exploration Fund with Reginald Stuart Poole, Curator of the Department of Coins and Medals at the British Museum. Edwards became joint Honorary Secretary of the Fund until her death.\n(from A Thousand Miles up the Nile)]]\nTo advance the Fund's work, Edwards largely abandoned other writing in favour of Egyptology. She contributed to the 9th edition of the Encyclopædia Britannica, to the American supplement of that and to the Standard Dictionary. In addition, Edwards took on an strenuous lecture tour in the United States in 1889–1890. The lectures later appeared as Pharaohs, Fellahs and Explorers.\nDeath and legacy\nAfter catching influenza, Edwards died on 15 April 1892 at Weston-super-Mare, having lived at Westbury-on-Trym, near Bristol, since 1864. She was buried in the churchyard of St Mary the Virgin, Henbury, Bristol, where her grave is marked by an obelisk with a stone ankh at the foot. Alongside are the graves of her life partner of 30 years, Ellen Drew Braysher (9 April 1804 – 9 January 1892), with whom she had lived in Westbury-on-Trym and of Ellen's daughter, Sarah Harriet Braysher (1832–1864). In September 2016, Historic England designated the grave Grade II listed, as a landmark in English LGBT history.\nEdwards bequeathed her collection of Egyptian antiquities and her library to University College London, with a sum of £2,500 to found an Edwards Chair of Egyptology which had a huge influence on developing egyptology as a discipline. Her dedication to this science earned her the nickname of \"the Godmother of Egyptology\". Edwards also supported Somerville College Library, having left many books, papers and watercolours to Somerville College, Oxford, along with a small collection of Greek and Roman pots.\nIn popular culture\n*In 2012, Edwards was portrayed as a non-singing character in Stephen Medcalf's production of Aida at London's Royal Albert Hall. The opera opens with a Victorian \"dig\" among Egyptian tombs and the action unfolds as Edwards imagines the plot taking place based on her exploration of the site. The libretto was based on a scenario by the Egyptologist Auguste Mariette, a contemporary of Edwards.\n*The Egyptologist and novelist Elizabeth Peters (Barbara Mertz) named her character Amelia Peabody after Amelia Edwards.\n*In 2014, a new music ensemble, Alarm Will Sound, staged a music-theatre piece, I Was Here I Was I, based on Amelia Edwards's A Thousand Miles Up the Nile, at the Temple of Dendur in the Metropolitan Museum of Arts' Sackler Wing. It was written and directed by Nigel Maister to music by Kate Soper.\n*A one-woman show based on Edwards's life, Hers Was the Earth, by Kim Hicks, was performed at the Petrie Museum during the 2011 International Women's Day observances.\n*Edwards' short story \"Was It an Illusion?\" (1881), about a Schools Inspector who has an unsettling encounter on his visit to the north of England, features in Audible's 2017 Ghostly Tales anthology, narrated by Simon Callow.\nBibliography\nHistory and archaeology\n*A Summary of English History: from the Roman Conquest to the present time, 1856\n*Outlines of English history: from the Roman conquest to the present time: with observations on the progress of art, science and civilization and questions adapted to each paragraph: for the use of schools, c. 1857\n*The History of France; from the Conquest of Gaul by the Romans to the Peace of 1856, 1858\n*The Story of Cervantes, etc., 1862\n*A Thousand Miles Up the Nile London: George Routledge and Sons Ltd, 1877 (1st edition) and 1888 (2nd edition, )\n*Pharaohs, Fellahs and Explorers. New York: Harper & Brothers, 1891\nFiction\nNovels\n*''My Brother's Wife. A Life–History, 1855\n*The Ladder of Life. A Heart history, 1857\n*The Young Marquis, or, A Story from a Reign, c. 1857\n*The Eleventh of March. (From a pocket-book of forty years ago), 1863\n*No Hero: An Autobiography, 1863\n*Barbara's History, 1864\n*Hand and Glove. A Novel, 1865\n*Half a Million of Money, c. 1868\n*Debenham's Vow, 1870\n*In the Days of My Youth, 1873\n*Lord Brackenbury, 1880\nShort fiction\n*Miss Carew (collection), 1865\n*Monsieur Maurice and Other Stories'', 1873\n**\"Monsieur Maurice\"\n**\"An Engineer's Story\"\n**\"The Cabaret of the Break of Day\"\n**\"The Story of Ernst Christian Schoeffer\"\n**\"The New Pass\"\n**\"A Service of Danger\"\n**\"A Night on the Borders of the Black Forest\"\n**\"The Story of Salome\"\n**\"In the Confessional\"\n**\"The Tragedy in the Palazzo Bardell\"\n**\"The Four Fifteen Express\"\n**\"Sister Johanna's Story\"\n**\"All Saints' Eve\"\n*The Phantom Coach, by Amelia B. Edwards, adapted by I. M. Richardson, illustrated by Hal Ashmead, c. 1982\nPoetry\n*Ballads. London: Tinsley, 1865\n*A Poetry-book of Elder Poets, consisting of songs & sonnets, odes & lyrics, selected and arranged, with notes, from the works of the elder English poets, dating from the beginning of the fourteenth century to the middle of the eighteenth century. 1878\nTranslations\n*Manual of Egyptian Archaeology and Guide to the Study of Antiquities in Egypt: for the use of students and travellers by Sir G. Maspero, translated by Amelia B. Edwards\nTravel\n*Sights and Stories: Being Some Account of a Holiday Tour Through the North of Belgium, 1862\n*A Thousand Miles up the Nile, 1877\n*Untrodden Peaks and Unfrequented Valleys: A Midsummer Ramble in the Dolomites. London: Longman's, Green and Co., 1873\nSource: [http://explore.bl.uk/primo_library/libweb/action/search.do?srt=date2&srtChange=true&vid=BLVU1&mode=Basic&ct=suggestedSearch&vl(2084770705UI1)=all_items&tab=local_tab&fn=search&indx=1&dscnt=0&vl(freeText0)=Edwards%2C%20Amelia%20Ann%20Blanford%2C%201831-1892.&vl(2084770704UI0)=creator&scp.scps=scope%3A(BLCONTENT)&dstmp=1591301531141 Catalogue of the British Library]\nSee also\n*Mary Brodrick\nBiographies\n*Carl Graves, (2025). Amelia B. Edwards: The ´Queen of Egyptology.´ London: The Egypt Exploration Society.\n*Deborah Manley, (2015). Oxford Dictionary of National Biography entry.\n*\n*\n*\n*\nReferences\nExternal links\n*\n*\n*\n*\n*\n*\n*\n*"
    }
  ]
}