{
  "content": [
    {
      "type": "text",
      "text": "# American Tradition Partnership\n\nAmerican Tradition Partnership (ATP), formerly known as Western Tradition Partnership, is a conservative 501(c)4 advocacy group in the United States targeting what it describes as \"environmental extremism.\" ATP has also initiated litigation targeting campaign finance regulations. It maintains a PO Box in Washington, D.C., and has no physical office.\nThe organization's mission statement is a dedication \"to fighting environmental extremism and promoting responsible development and management of land, water, and natural resources in the Rocky Mountain West and across the United States.\" ATP promotes what it describes as voluntary, free-market solutions to environmental problems as the means to protect both the economy and the environment. It works to achieve its organizational goals through lobbying, public education, and grassroots mobilization.\nThe group was first registered as Western Tradition Partnership as a 501(c)(4) in 2008. In 2010, the group spun off a 501(c)(3) nonprofit, the Western Tradition Institute, which also did business as the American Tradition Institute. In 2013, the American Tradition Institute changed its name to the Energy & Environment Legal Institute, to reflect its focus on the area of strategic litigation.\nIn 2012 the group was scrutinized in a PBS Frontline documentary, Big Sky, Big Money, which showed that the group was not registered with Montana as a political committee, and illuminated several charges against its activities. After that, the group maintained low visibility until the 2014 election cycle in the state.\nIssues\nSome prominent issues in which ATP has become involved include:\nNational monuments\nIn 2010, WTP filed a Freedom of Information Act request seeking documents related to President Barack Obama's potential use of the Antiquities Act to establish as many as fourteen new national monuments, one of which may include the Vermillion Basin in Colorado, which has significant natural gas and other mineral resources. Colorado representatives Republican Doug Lamborn and Mike Coffman, have concurrently introduced legislation to prevent any additional national monuments from being established in their state.\nEmissions trading\nATP has opposed legislation creating an emissions trading system in the United States, referring to such proposals as a \"cap and tax.\" An online petition sponsored by ATP supported the \"Climategate\" misconduct theory, repeated the claim that the Oregon Petition was signed by 31,000 scientists, rejected global warming evidence, and expressed fears that such a system would lead to higher energy prices, higher government spending, lost jobs, and other economic costs.\nUtility alternative energy regulation\nATP opposed Colorado House Bill 1001 which would require public utilities to use alternative energy sources. The group says the proposed law would create job losses and higher utility bills. \"The renewable energy standard forces utility companies to buy more expensive utilities, so then they have to cut back on hiring and lay people off,\" according to ATP executive director Ferguson. American Tradition said the standards were being implemented for the benefit of \"connected, higher-priced ‘green’ speculators.\" ATP initially planned to overturn the law via ballot initiative but soon turned away from that effort. The group says it will lobby to have the law changed in 2011.\nLitigation\nMontana Commissioner of Political Practices\nIn 2010, the Montana Commission of Political Practices ruled that ATP had broken state campaign laws by failing to register as a political committee or properly report its donors and spending. The commission investigation's revealed that the group had solicited unlimited contributions to support pro-mining, pro-logging and pro-development candidates in Montana and avoided disclosing the contributions.\nThe opinion issued by Commissioner Dennis Unsworth in October 2010 followed the investigation of a 2008 complaint by a Great Falls attorney, which accused ATP of not properly disclosing financial information related to its fliers that criticized a state senator. The opinion examined connections between ATP, a small group of political action committees, candidates for public office, and discrepancies in the campaign finance disclosures.\nIn response, ATF filed suit challenging the ruling. The lawsuit alleged a violation of ATP's federal constitutional right to free speech and a state constitutional right to privacy. The suit demanded that all complaints against ATP be dismissed. Montana Commissioner of Political Practices Dennis Unsworth (who issued the contested ruling), the state attorney general, and prosecutors in Cascade and Lewis and Clark counties were named as defendants in the action.\nATP criticized Unsworth for exceeding his authority by including names of organizations and individuals in his ruling without presenting any evidence of wrongdoing on their part. \"Indeed, the commissioner's opinion itself finds no evidence of coordination,\" ATP wrote. \"Yet, the opinion drags the names of ATP's counsel, the Republican Party, numerous political candidates, persons associated with different organizations, and lawful businesses into the mix and alleges that there is.\"\nJohn Sinrud, a former Bozeman lawmaker who worked with ATP in 2008, accused Unsworth of using a double standard, saying ATP's behavior was legal and that several union and conservation groups heavily involved in Montana politics used similar tactics. \"Commissioner Unsworth is selectively going after organizations that do not meet his political muster,\" he said. \"He should just stick to the facts and that's not what he's doing. He's violated his oath of office of being nonpartisan.\"\nWestern Tradition Partnership, Inc. v. Attorney General of Montana\nIn October 2010, District Judge Jeffrey Sherlock ruled that the Montana Corrupt Practices Act of 1912, which prohibited independent expenditures to influence political campaigns by corporations, is unconstitutional. ATP had challenged the law after the United States Supreme Court's Citizens United ruling. WTP was joined in its suit by Champion Painting and the Montana Shooting Sports Association. Ruling Judge Sherlock said he agreed with U.S. District Judge Paul Magnuson, who overturned a similar ban in Minnesota. Magnuson wrote that Citizens United \"is unequivocal: The government may not prohibit independent and indirect corporate expenditures on political speech.\"\nIn Western Tradition Partnership, Inc. v. Attorney General of Montana, 2011 MT 328, the Montana Supreme Court ruled 5–2 that the broad protections given to corporations in Citizens United v. Federal Election Commission do not apply to Montana’s campaign finance laws. On June 25, the US Supreme Court summarily reversed the Montana Supreme Court ruling.\nLongmont\nIn 2009, ATP sued the city of Longmont, Colorado, seeking to prevent enforcement of the Longmont Fair Campaign Practices Act (LFCPA). An injunction suspending enforcement of the regulations was granted in October 2009, after District Judge Walker Miller held that ATP and its co-plaintiffs would likely prevail. The LFCPA was revised in 2009 after a 2008 special election where a city council member received a $5,000 contribution from the Longmont Association of Realtors. The 2009 changes mandated that contributors' identities, contribution amounts, and other information must be disclosed in campaign advertisements.\nThe suit was settled out of court in December 2009 with the town paying the plaintiffs $68,500. As part of the settlement, the city agreed to propose changing the contested portions of the LFCPA, which were subsequently repealed by the city council.\nMichael Mann lawsuit\nIn 2011 ATI filed a follow-on lawsuit to the Attorney General of Virginia's demand to obtain a wide range of records relating to the work of climate scientist Michael E. Mann. The Attorney General's demand was denied by the Virginia Supreme Court, and the ATI's suit was also unsuccessful. But it led to the formation of the Climate Science Legal Defense Fund, an organization that represents climate scientists who are targets of what it regards as \"politically motivated attacks.\"\nIn July 2012, The Guardian reported that ATI had made Freedom of Information Act requests for the release of scientists' communications with journalists – the first time the media had been drawn into FOIA requests concerning climate science. The news organizations included the New York Times, the Associated Press, Frontline, and the Guardian.\nFunding\nIn Western Tradition Partnership, Inc. v. Attorney General of Montana, the Montana Supreme Court concluded that the organization's primary purpose is to allow donors to make unlimited contributions in complete secrecy, though the Office of Political Practices admitted they had no evidence to back up that claim. During the case, Western Tradition Partnership refused to provide information to the court as to its organizations, funding, activities or intent, citing its 501(c)4 status under federal tax law. The court concluded that the group represents \"a threat to the political marketplace\" and it has operated in complete disregard of the laws of Montana. That ruling was overturned by the U.S. Supreme Court.\nDonald \"Donny\" Ferguson, the former executive director of ATP and manager of their Washington, D.C. office, resigned on 3 January 2013, as it continued to suffer adverse rulings in Montana courts over alleged campaign finance violations. Ferguson then became the congressional staffer and then U.S. Senate campaign spokesperson for TX Representative Steve Stockman.\nStolen documents\nIn 2011, documents allegedly found in a stolen car and then discovered in a Colorado meth house revealed the inner workings of WTP/ATP, including possible illegal coordination with Republican candidates. The organization contacted the FBI after Colorado Democrats \"trafficked [the materials] across state lines to Democrat state appointees\" in Montana. The Montana Commission on Political Practices maintains access to the documents as \"public and reviewable upon request.\"\nSee also\n*Dark Money (film)\nReferences\nExternal links\n* [https://web.archive.org/web/20120529131246/http://www.americantradition.org/ ATP homepage]\n* [http://www.sourcewatch.org/index.php/Energy_%26_Environment_Legal_Institute Energy & Environment Legal Institute] at SourceWatch\n* [https://web.archive.org/web/20150212051701/http://nccsweb.urban.org/communityplatform/nccs/organization/profile/id/262289809/popup/1 Organizational Profile] – National Center for Charitable Statistics (Urban Institute)\n* [https://www.pbs.org/wgbh/frontline/documentary/big-sky-big-money/? Big Sky-Big Money]. Frontline, Public Broadcasting System"
    }
  ]
}