{
  "content": [
    {
      "type": "text",
      "text": "# American Women's War Relief Fund__disambig_1\n\n'''American Women's War Relief Fund''' was an expatriate organization in the United Kingdom started by American women to fund and aid World War I support efforts. The group was made up of wealthy socialites, politicians' wives and humanitarians. Many famous and well-connected women were involved, including Lou Hoover, Consuelo Vanderbilt and Lady Randolph Churchill. Leila Paget  served as president and  Ava Lowle Willing was the fund's vice-president. The group, started almost immediately after the declaration of war, funded a fleet of ambulances, two hospitals, one field hospital and several employment opportunities for unemployed women in Britain.\nHistory\nAmerican Women's War Relief Fund was founded on August 5, 1914. Members of the organization were women from the United States who were married to Englishmen and who wanted to help in the effort to support soldiers fighting in World War I. The president of the group was Leila Paget and Ava Lowle Willing served as vice-president. Many of the members of the group had husbands who were commanding troops during the war. Paget told journalist Hayden Church that she had thought up the idea for the Relief Fund merely three days after the start of the war. Winnaretta Singer and the Countess of Starfford were major donors of money to the fund. Paget also raised money in both America and England for wounded soldiers of several different countries fighting in the war. In 1917, there was an official request to have all American-led efforts to support the war in Europe be turned over to the American Red Cross for coordination purposes. In January 1918, the Relief Fund hospitals were fully turned over to be run by the Red Cross.\nThe fund originally was going to sponsor an ambulance ship, but were persuaded to purchase 6 motor ambulances with a seventh added later by Grace Nichols and bearing the words, \"From Friends in Boston\". The ambulances had room enough for four stretchers and two medics.\nHospitals\nIn August 1914, the American Women's War Relief Fund received the donation from Paris Eugene Singer of his Oldway House in Paignton to be used as a military hospital. Lady Randolph Churchill was involved in persuading Singer to donate the house to use as a hospital. The building, known as the American Women's War Hospital, was initially equipped with 200 beds, an operating theatre, radiographic studio, pathology lab and also with anesthetizing and sterilization rooms. Later, an additional 20 beds were added, and an \"Isolation Hut\" for quarantines was built which could accommodate around 30 people. The American Red Cross helped staff the hospital, providing two units. The hospital began treating wounded soldiers as soon as September 1914. On November of that year, Queen Mary brought three hundred articles of clothes for the hospital and visited the wards. Anita Strawbridge solicited donations such as socks and underwear from the United States. By 1916, the American Women's War Hospital had treated 3,203 soldiers, according to the New York Herald. By March 1919, when the hospital closed, it had served over 7,000 soldiers.\nThe relief fund also provided partial funding for a field hospital in Belgium run by the wife of an officer, Mrs. O'Gorman. Another hospital, known as the American Women's Hospital, was located at Lancaster Gate and had been opened in 1917 by Walter Hines Page and Willa Alice Wilson Page. The Lancaster hospital had 41 beds and was mainly staffed with American nurses. It was inspected by King George and the Queen in 1917. It closed in 1919.\nEconomic relief\nIn addition to setting up the hospital, the fund also created workrooms to teach young women new skills as part of the Economic Relief Committee of the American Women's War Relief Fund. The committee was headed by Consuelo Vanderbilt, who had been recruited by Lou Hoover in 1915. This committee provided funds to pay the women's wages and articles of clothing, such as socks, were sent to the hospital or \"given to soldiers and sailors in special need.\" A workroom was set up in a factory building near St. Pancras between August 1914 and August 1915. A knitting factory in Islington was opened in September 1914, followed by other workrooms in October at Woolwich and one at Greenwich. The Woolwich factory was given to a charity to run in 1915. The women employed at the workrooms were not given quotas, but instead did what they were able to do. The working women were also given free tea and low cost meals in the evening.\nNotable members\n* Lady Randolph Churchill, chair of the hospital committee.\n* Mary Ethel Harcourt (Mrs. Lewis Harcourt)\n* Lou Hoover.\n* Ruth Bryan Owen, secretary.\n* Leila Paget, president.\n* Consuelo Vanderbilt (the Duchess of Marlborough), chair of the Economic Relief Committee.\n* Ava Lowle Willing,  vice-president.\n* Willa Alice Wilson Page.\nReferences\nCitations\nSources\n*\n*\n*\n*\nExternal links\n* [https://www.bbc.co.uk/programmes/p01sf5n7 Paignton, Devon: The Singer Palace Becomes a Hospital] (2014 BBC video)"
    }
  ]
}