{
  "content": [
    {
      "type": "text",
      "text": "# American Cinema Editors Awards 1965\n\nThe 15th American Cinema Editors Eddie Awards, which were presented on Sunday, March 14, 1965, at the Coconut Grove, honored the best editors in films and television. This was the first-ever award ceremony that introduced the concept of the \"Eddie Awards\", complete with the unveiling of the \"Eddie\" statuette. The four categories that were introduced were Outstanding Picture of the Year, Best Foreign or Documentary Film, Best Performance by an Actor in a Film Debut, and Best Performance by an Actress in a Film Debut. There were a total of six awards, upped from three in the previous year. The award ceremony was hosted by character actor Pat Buttram.\nFor the first time in the history of the award ceremony, the award was broadcast live on television, airing on the Los Angeles affiliate station KABC-TV. The broadcast was produced and directed by Lamont Johnson with music by bandleader Freddie Martin. After the presentations, singer and actress Barbara McNair hosted the floor show. Former president Harry S. Truman also won the awards' first ever \"Most Outstanding Television Personality\" award. David M. Noyes, producer of the show and Truman's former advisor, accepted the award on his behalf.\nNominees\nAmbassador Hotel Cocoanut Grove interior in 1965\nReferences:\n{| class=wikitable style=\"width=100%\"\n|-\n! style=\"width=50%\"| Best Edited Feature Film\n! style=\"width=50%\"| Outstanding Picture of the Year\n|-\n| valign=\"top\" |\n* 'Mary Poppins – Cotton Warburton'\n** Becket – Anne V. Coates\n** My Fair Lady – William H. Ziegler\n** The Unsinkable Molly Brown – Fredric Steinkamp\n** What a Way to Go! – Marjorie Fowler\n| valign=\"top\" |\n* My Fair Lady\n** Mary Poppins\n** Becket\n** Topkapi\n** The Unsinkable Molly Brown\n|-\n! style=\"width=50%\"| Best Edited Television Program\n! style=\"width=50%\"| Best Edited Foreign or Documentary Film\n|-\n| valign=\"top\" |\n* 'Rawhide: \"No Dogs or Drovers\" – Gene Fowler Jr.'\n** Bewitched: \"I, Darrin, Take This Witch, Samantha\" – Michael Luciano and Gerard Wilson\n** The Man from U.N.C.L.E.: \"The Deadly Games Affair\" – Joseph Dervin\n** ''Slattery's People: \"Do the Ignorant Sleep in Pure White Beds?\" – Daniel A. Nathan\n** Wagon Train: \"Little Girl Lost\" – Gene Palmer\n| valign=\"top\" |\n* Topkapi\n** Rhino!\n** The Organizer\n** Marriage Italian Style\n** Zorba the Greek\n|-\n! style=\"width=50%\"| Best Performance by an Actor in a Film Debut\n! style=\"width=50%\"| Best Performance by an Actress in a Film Debut\n|-\n| valign=\"top\" |\n* 'David Tomlinson – Mary Poppins'\n** Stanley Holloway – My Fair Lady\n** Harve Presnell – The Unsinkable Molly Brown\n** Donnelly Rhodes – The Alfred Hitchcock Hour: \"Ten Minutes from Now\"\n** John Leyton – Guns at Batasi\n| valign=\"top\" |\n* 'Julie Andrews – Mary Poppins'\n** Daniela Bianchi – Dr. Kildare: \"Rome Will Never Leave You\"\n** Kim Darby – Mr. Novak: \"To Lodge and Dislodge\"\n** Mary Ann Mobley – Get Yourself a College Girl\n** Tippy Walker – The World of Henry Orient''\n|}\nReferences\nExternal links\n*[https://www.imdb.com/event/ev0000017/1965 ACE Award 1965] at the Internet Movie Database"
    }
  ]
}