{
  "content": [
    {
      "type": "text",
      "text": "# American War Mothers\n\nneighborhood of Washington, D.C.]]\nThe American War Mothers was founded by Alice M. French on 29 September 1917 and given a Congressional charter on February 24, 1925. It is a perpetual patriotic, 501(c) 4 non-profit, non-political, non-sectarian, non-partisan organization whose members are mothers of children who have served or are serving in the Armed Services during a time of conflict. American War Mothers put together hospital care packages for veterans and they have a national campaign that honors Americans who lost their lives in WWI by planting Memory Trees. The American War Mothers flag was first flown over the U.S. Capitol, below the American flag, on 11 November 1926. The original woolen flag was replaced in 1970 with its present flag, which is kept in the safe at the U.S. Capitol.\nDuring WWI, they flew a flag with a blue star in the middle to honor their family member serving and in the event of a death, they sewed a yellow star above the blue star. These women later became the American Gold Star Mothers which branched off from the American War Mothers in 1929.\nThe first National Convention of War Mothers was held on 15 August 1918 in Indianapolis by the Governor of Indiana. By 11 November 1918, a large majority of the states were organized into chapters.\nNational President: LaVerna Capes\nNotable members\n* Jeanette Lawrence\n* Agnes Thomas Morris, president of War Mothers of America, 1918-1920\n* Alice M. French., founder and first president\n* Lucy Bramlette Patterson\n* Nelda Bleckler, National President 2011.\n* Elizabeth Martin, President of the Wisconsin Chapter\nChapters\nThere are various chapters of the American War Mothers across the United States, including the Indiana Chapter which was founded in May 1918 with 71 members. The Charlotte chapter was organized in August 1920, and the North Carolina in December 1920. The Milwaukee County chapters records date back to 1918.\nSome states have a number of local chapters which are named after their counties, like the Fayette County Chapter, and other chapters are named after an individual, like the Alice M. French chapter.\nThe Southern Nevada chapters were disbanded in the 1995.\nThe Charlotte chapter had a Guest House at Oteen, North Carolina for relatives of soldiers to have room and board while the soldier was in recovery at the Oteen V.A. Hospital.\nMemorials\nIn 1924, the Kentucky Chapter of the American War Mothers planted an oak tree on the University of Kentucky campus. The tree is marked with a tablet next to it which reads \"This memorial tree planted by the Kentucky Chapter of the American War Mothers – 1924\". Mrs. Maude South McCarthy was the chair of the Fayette County Chapter who was present as the tree was planted.\nThe American War Mothers planted the City of Las Vegas Rose Garden in memory of the war dead, and its Henderson Chapter created the Memorial Wall in Henderson.\nIn October 1930, the American War Mothers placed a stone memorial on the Mizzou campus which honored 117 MU students who were killed during the war. It was placed in a new spot and rededicated during the memorial service on Veteran's Day in 2011.\nSee also\n*Blue Star Mothers Club\n*American Gold Star Mothers\nReferences\nExternal links\n*[http://catalog.hathitrust.org/Record/007411878  To Incorporate the American War Mothers : hearings before the United States House Committee on the Judiciary, and Senate Committee on the Judiciary, Sixty-Eighth Congress, first session, on May 6, 1924.]\n*[http://www.pantagraph.com/news/local/military/fountain-a-reminder-of-american-war-mothers-work/article_24d87084-2d6f-11e3-9d28-0019bb2963f4.html Fountain a reminder of American War Mothers' work - Pantagraph] (Bloomington, Illinois newspaper)"
    }
  ]
}