{
  "content": [
    {
      "type": "text",
      "text": "# American history wars\n\nThe American history wars refers to ongoing academic and popular debates surrounding the character and culture of the United States. The term has been used by journalists and academics to describe debates over the teaching of Critical race theory and other issues relating to the Historiography of the United States.\nBackground\nThe term \"history wars\" has been used in academia and the media to encompass debates over how American history should be taught and interpreted in classrooms and society. While the etymology of the term is unclear, the term is frequently used by historians and journalists.\nTopics\nRace\nThe topic of America's history relating to race is a prominent element of the American history wars. Central to these debates is the teaching of critical race theory (CRT) and The 1619 Project, which assert that systemic racism is deeply embedded in the fabric of American history. Proponents argue that these frameworks are essential for understanding the pervasive impact of racism, while critics contend that they present a divisive and negative portrayal of the nation's past. Legislative efforts in various states to ban CRT and similar educational content have sparked significant controversy, with opponents claiming these measures aim to sanitize history and promote a narrow, patriotic narrative. Historians and educators have pushed back, arguing that such bans threaten academic freedom and the integrity of historical scholarship, replacing nuanced analysis with state-mandated perspectives.\nEnola Gay exhibition controversy\nThe Enola Gay aircraft's exhibit in the Smithsonian Museum has been a topic of debate in the American history wars. The exhibit was criticized by conservative politicians and veteran groups for being overly sympathetic to Japanese victims, and being overly critical to the American military. It was also criticized by historians who felt that it was dehumanizing to the victims and overly technical. This controversy has been used by educators to teach the American history wars, as it involves highly differing perspectives on how to teach a subject. It was also the subject of historian Edward Linenthal's book on the subject, History Wars: The Enola Gay and Other Battles for the American Past.\nFurther reading\n* Edward Linenthal's History Wars: The Enola Gay and Other Battles for the American Past\nSee also\n* Australian history wars\n* Canadian history wars\n* Historiography of the United States\n* The 1619 Project\nReferences"
    }
  ]
}