{
  "content": [
    {
      "type": "text",
      "text": "# American Women's Himalayan Expedition\n\nThe '''American Women's Himalayan Expedition' was a 1978 expedition to Annapurna which placed the first two women, and first Americans, on its summit. The expedition was led by Arlene Blum and consisted of thirteen women, and six sherpas. On October 15, the first summit team, composed of Vera Komarkova, Irene Beardsley (formerly Miller), Mingma Tshering Sherpa and Chewang Ringjin Sherpa summitted Annapurna via the Dutch Route. The second summit team, Alison Chadwick-Onyszkiewicz and Vera Watson, died during the climb.\nPlanning\nThe all woman nature of the expedition was designed by Blum and Alison Chadwick-Onyszkiewicz during a 1972 expedition on Noshaq. Blum, who having previously been rejected from high altitude expeditions as a woman stated “Few American women ever get a chance to climb that high, to lead, or even to participate in a major expedition. No American woman [had] ever climbed to 8000 meters, and only seven women from any country [had] ever climbed that high. We [hoped] this climb [would] give a number of women sufficient experience so that they can be invited on mixed expeditions, or organize their own.\"\nLed by Blum, they underwent psychological tests and individual training programs. The counter culture of the 1970s led teams to rebel against the military inspired siege style mountaineering. As the first female team, many of the women were especially determined to forge their own leadership methods and styles independent of the male lead expeditions before them.\nFunding\nThe team spent a year raising the money needed for the climb, mostly by selling T-shirts with the slogan, A Woman’s Place is on Top''. They also received sponsorship from the American Alpine Club and support from the National Geographic Society, Johnson & Johnson and o.b. tampons.\nExpedition\nAt the time, Annapurna had been climbed by eight people, via three different routes. Annapurna has since emerged as one of the most dangerous mountains in the Himalayas with a 32% fatality to summit ratio. It is extremely avalanche prone, which was not fully appreciated at the time.\nThey approached the mountain siege style, leaving Pokhara with more than  of supplies, a team of porters, 13 women and 6 Sherpas. Blum had wanted to employ female low-altitude porters and train them to be climbers, but ran into difficulties with the Sherpas' union and the women hired were not strong load carriers.\nThey arrived at base camp on August 26, and pushed up a rib towards the north to camp 2. From there the route choice was between most recent ascent of the mountain The Dutch Rib which was direct and technical and a new variation of the Spanish Route which appeared easier. They settled on the Dutch Rib after watching several avalanches on the Spanish Route.\nThey waited until the mountain was opened at a prayer-flag raising ceremony, and began upwards towards camp 3 on September 12. On September 19 Komarkova and Chewang were forced to retreat to base camp due to multiple avalanches.\nOn the 27th Chadwick-Onyszkiewicz, Liz Klobusicky-Mailänder, Chewang, and Lakpa established camp 3, and another near avalanche miss cleared the rib making it more passable. The same day an avalanche made it 3 km down to camp one, with the wind from it flattening tents.\nThey had reached camp four by October 8, and planned to set up a final camp before the summit.\nSummit attempts\nInitially Blum wanted the first summit team to consist of three women, no Sherpas, with Sherpas ascending on the second team. However, Komarkova pushed to have Sherpas Mingma and Chewang join them. Ultimately the first summit team consisted of Komarkova, Irene Beardsley, Mingma Tsering Sherpa and Chewang Ringjin Sherpa after Piro Kramer, an eye surgeon, retreated after getting a frostbitten right index finger. The team reached the top on October 15.\nChadwick-Onyszkiewicz and Vera Watson were keen to make a second summit attempt with a large team; however, many expedition members were sick, had frostbite, or were exhausted from recent summit attempts. They could not convince Annie Whitehouse to join them, as she thought that their decision-making skills were compromised. They decided to continue anyway, with Wangyel accompanying them to camp 5, with the aim of climbing the then unclimbed 8,051-meter central peak.\nHowever, Wangyel descended after falling sick, leaving them without a siege-style support structure. They failed to make a scheduled radio call, and their bodies were found by Lhakpa Norbu and Mingma below camp four, three days later.\nHistorical significance\nInitial reports from The New York Times called the climb an inspiration to women, noting that women's mountaineering in America had 'come of age', and it was symbolic and relevant to second wave feminism. Blum's book on the expedition, ''Annapurna: A Woman's Place'', was cited by Kitty Calhoun as an inspiration to later mountaineers.\nAt the time, the expedition received some criticism by men, including David Roberts, for having Sherpas forge a path to the summit on an all women's expedition and for perceived poor decision making leading to the deaths of Chadwick-Onyszkiewicz and Watson. This was denounced by Blum as hypocritical, since there were no objections to Sherpa forged paths on recent all-male expeditions and that (at the time) there had been one death for every summit on Annapurna.\nSee also\n* Scottish Women's Himalayan Expedition, 1955 expedition to the Jugal Himal, recognized as the first all-women's expedition to the Himalayas\nReferences"
    }
  ]
}