{
  "content": [
    {
      "type": "text",
      "text": "# American Society for the Defense of Tradition, Family and Property\n\n| location = Spring Grove, Pennsylvania, U.S.\n| key_people =\n| area_served = United States\n| revenue = $8,530,115 (FY 2012)\n| num_volunteers = 75\n| num_employees = 100\n| website =\n}}\nThe American Society for the Defense of Tradition, Family and Property, also known as The American TFP, and legally incorporated as The Foundation for a Christian Civilization, Inc. is a Traditionalist Catholic American advocacy group. It is an autonomous organization which forms part of the larger social conservative, anticommunist and monarchist international Tradition, Family, Property (TFP) movement founded by Brazilian intellectual, politician, and activist Plinio Corrêa de Oliveira.\nHistory\nFounded in 1973, it is one of many \"Tradition, Family and Property\" groups (TFPs) and like-minded organizations worldwide, all of which are inspired by the work of the Brazilian intellectual, politician, and activist Plinio Corrêa de Oliveira. The first American group was incorporated in 1975 and established its first hermitage in 1977 in Yonkers, New York. The Yonkers location was subsequently closed and the hermits established their permanent hermitage on 70 acres in Spring Grove, Pennsylvania.\nThe Foundation for a Christian Civilization (\"Foundation\") was incorporated in 1973, drawing on earlier ties between Brazilians, who traveled to the US to develop a North American affiliate. The American TFP developed early connections with leaders of the religious and political right, including Paul Weyrich of The Heritage Foundation and the Free Congress Foundation and Morton Blackwell of the College Republican National Committee and the Reagan administration.  In 1984, President Ronald Reagan expressed the hope for the movement’s “continued growth and prosperity.” “With your help and the help of all patriotic Americans,” said the President, “I know our nation can surmount all the challenges which lie ahead.” Founded to help fundraising for a Catholic counterrevolution against left-wing ideologies and communism, it subsequently became a civil cultural organization that aims to uphold and promote what they consider to be the values of Christian civilization. The Foundation later merged in June 1992 with American TFP to form a single corporation identified as The Foundation for a Christian Civilization.\nOrganization\nThe organization solicits funds as a non-profit charity, not as a diocesan organization. Its annual public reports to the Internal Revenue Service indicate that between 2002 and 2014 it disbursed $1,800,000 to support the St. Louis de Montfort Academy and $1,500,000 to support related organizations in North and South America, most significantly Canada Needs Our Lady, Associação dos Fundadores and the Tradición y Acción organizations of Colombia and Peru.\nActivities\nTFP has continued its ties with the political right as a participating sponsor of the Conservative Political Action Conference, and by signing statements issued by the Heartland Institute that opposed housing finance reform legislation, and discussions of climate change in comprehensive energy legislation and in the State Department funding authorization.\nTFP Student Action is the university campus outreach of the TFP. Its activities include distributing fliers and other literature on the streets of universities, sponsoring speakers on campuses, hosting student conferences, and organizing protests and petitions, especially against abortion and LGBT student groups at Catholic universities. Its most recent campaign is against the 96 Catholic colleges and universities that allow LGBT student groups. In April 2009, volunteers of TFP Student Action traveled to the major cities of New Hampshire and Maine to distribute literature against same-sex marriage.\nThe American TFP provides the staff to run Saint Louis de Montfort Academy, a boys' boarding school in Herndon, Pennsylvania, that provides students with a traditional Catholic education. It also operates Call to Chivalry summer camps, which express Oliveira's view of nobility, chivalry, and the benefits of the feudal past.\nThe Return to Order campaign is an offshoot of the US Foundation for a Christian Civilisation. In 2019, it organized a petition against the Good Omens miniseries as mocking God's wisdom and making Satanism appear normal, light, and acceptable, but they targeted the petition at Netflix rather than Amazon Prime Video which distributes the series. In 2021, they staged a protest at the 59th New York Film Festival due to the festival showing the Paul Verhoeven film Benedetta, which they deemed blasphemous for its portrayal of lesbianism within the confines of a convent.\nCriticism\nThe American TFP has been cited in several articles by the Southern Poverty Law Center (SPLC) for their anti-LGBT views. According to the SPLC the TFP is a \"virulently anti-LGBT\".\nJesuit priest James Martin, referring to the American TFP and to the organization Church Militant commented that “These online extremist hate groups are now more powerful than local churches”.\nSee also\n*America Needs Fatima\n*Alliance Defending Freedom\n*Catholic League\n*Christian Institute\n*Family Research Council\nReferences\nExternal links\n*\n* [http://www.americaneedsfatima.org/ America Needs Fatima]\n* [http://www.tfpstudentaction.org/ TFP Student Action]\n* [http://www.montfortacademy.edu/ St. Louis de Montfort Academy]\n* [https://www.charitynavigator.org/ein/237325778 \"American Society for the Defense of Tradition, Family and Property\", Charity Navigator]"
    }
  ]
}