{
  "content": [
    {
      "type": "text",
      "text": "# Ames Monument__disambig_1\n\nNW of Sherman\n| nearest_city = Laramie, Wyoming\n| coordinates =\n| area =\n| built = 1880-1882\n| architect = H. H. Richardson\n| architecture =\n| added = July 24, 1972\n| designated_nrhp_type = October 31, 2016\n| visitation_num =\n| visitation_year =\n| refnum = 72001296\n| mpsub =\n| governing_body =\n}}\nThe Ames Monument is a large pyramid in Albany County, Wyoming, designed by Henry Hobson Richardson and dedicated to brothers Oakes Ames and Oliver Ames Jr., Union Pacific Railroad financiers. It marked the highest point on the first transcontinental railroad, at .\nRichardson designed the monument midway into his career. His work was largely unknown to the public until around 1870, when he helped design Trinity Church and the Buffalo State Asylum for the Insane.\nThe town of Sherman rose up around it, but then Union Pacific moved its tracks to the south, leaving Sherman to become a ghost town.\nOliver served as president of the Union Pacific Railroad from 1866 to 1871, while Oakes, a U.S. representative from Massachusetts, asserted near-total control of its construction.  In 1873, investigators implicated Oakes in fraud associated with financing of the railroad. Congress subsequently censured Oakes, who resigned in 1873 and died soon thereafter.\nRichardsonian design\nThe Ames Monument is located about  east of Laramie, Wyoming, on a wind-blown, treeless summit south of Interstate 80 at the Vedauwoo exit. The monument is a four-sided, random ashlar pyramid,  square at the base and  high, constructed of light-colored native granite. The pyramid features an interior passage, now sealed, alongside the perimeter of the structure's base.\nAmerican architect H. H. Richardson designed the pyramid, which includes two  bas-relief portraits of the Ames brothers by sculptor Augustus Saint-Gaudens on the east and west sides of the pyramid's top. Saint-Gaudens chiseled the bas-reliefs from Quincy, Massachusetts, granite. The north side, which at one time faced the railroad tracks, displays  letters grouted in the granite noting: \"In Memory of Oakes Ames and Oliver Ames\". The monument is one of a half-dozen or more projects that Richardson did for the Ames family.\nThe pyramid is one of only two examples of Richardson's work west of the Mississippi River, the other being the Isaac H. Lionberger House in St. Louis less than  from the river. Richardson's structure employed rough-hewn granite boulders in its construction. The monument's stones at the base are  and weigh thousands of pounds each. The pyramid narrows from the base to become progressively smaller towards the top at a ratio of four inches to the foot (1:3).\nHistory\nThe reasoning for the building of the monument was H.H Richard's desire to honor Oliver and Oakes Ames for building and completing the railroads: specifically, the Union Pacific Railroad, part of the country's first transcontinental railroad, which included a route through the mountains of Laramie and northern Utah.\nThe audacity of building a transcontinental railroad in the 1860s was \"today's equivalent of the mission to Mars: Big, expensive and impossible,\" wrote University of Wyoming historian Phil Roberts. President Abraham Lincoln reportedly told Oakes Ames that if he could get the transcontinental railroad built, he would be \"the most remembered man of the century.\" Lincoln personally recruited Oakes after progress by and financial support for Credit Mobilier of America, the construction company charged with building the railroad, ground to a halt. The Ames brothers succeeded where others failed and completed the transcontinental railway. However, in 1873 charges of financial fraud were leveled at Oakes, tarnishing his reputation and that of the Union Pacific Railroad Company's .\nPublic outcry towards Oakes and other \"Kings of Frauds\" associated with scandal threatened the Ames family reputation and that of the Ames Company, founded in 1774 to make steel-edged shovels. The Ames Company later sold axes and shovels to miners during the California Gold Rush. The company supplied the government with shovels during the Civil War, for excavating the Panama Canal, for mining Pennsylvania coal fields, and for digging the New York City Subway.\nIn 1875, the Union Pacific Railroad board of directors voted to erect the grand Ames Monument, in part to burnish the company's tarnished reputation. Union Pacific stockholders subsequently authorized the construction at a meeting in Boston on March 10, 1875.\nThe Norcross Brothers of Worcester, Massachusetts, built the monument, employing some 85 workers who lived on site, \"where reportedly no liquor or gambling was allowed.\" Workers cut the stone for the pyramid from a granite outcropping common in the area. They then used oxen teams to skid the stone a half-mile to the work site. Some of the rough-faced granite blocks weigh several tons.\nWorkers constructed the pyramid about 300 yards south of the tracks on a small knoll. When completed in 1882, the Ames Monument stood  south of, and  above, the highest elevation of the original tracks of Union Pacific transcontinental railroad at . President Rutherford B. Hayes underscored the importance of the transcontinental railroad and thereby the Ames brothers by attending the monument's dedication ceremony.\nHowever, when completed in 1882, the Ames Monument was visited by many persons who were allowed to momentarily leave their trains in order to view the monolithic curiosity. It was said that when the construction of the monument was almost completed, some people had the opportunity of being lifted to the top of the monument by a special rig and from their breezy perch could view the surrounding area for a hundred miles in all directions.\nWhen it was finished in the year 1882 the ending cost of the structure was $64,000. Around 12 miles away from the monument they had finished the railroad tracks in the year 1865.\nIn 1885, after finding that the Union Pacific had accidentally built the monument not on one of the plots granted to it by the government, but on one of the alternating plots available for purchase or claim by Homesteaders, local resident William Murphy purchased the land that contained the monument, intending to cover the pyramid with advertising. The Union Pacific Railroad Company contested the purchase, and eventually obtained a special deed to the property in 1889, both frustrating Murphy and bankrupting him through legal proceedings.\nSherman\nThe small town of Sherman arose at the site north of the tracks where trains stopped to change engines on their transcontinental journey. The stop provided a roundhouse with five stalls and a turntable, two section houses, and a windmill with water tank. Trains were inspected at Sherman before beginning the long descent from the Sherman Pass summit, either east towards Cheyenne or west across the  high Dale Creek Bridge to the Laramie Valley. The town's death knell came in 1918. The railroad company closed its station house and relocated the tracks about three miles (5&nbsp;km) south. Residents soon abandoned Sherman, leaving behind a small cemetery that is still present today.\nThe monument today\nUnion Pacific donated the railroad monument to the state of Wyoming in 1983. The structure is listed on the National Register of Historic Places, and is maintained as a Wyoming state historic site. Time and possible vandalism have destroyed some of the features of the bas-relief portraits of the Ames brothers on the monument. The Ames Monument is open year-round, weather permitting.\nWork took place in 2010 and 2011 to restore the monument.  On October 31, 2016, the site received National Historic Landmark status.  The designation was made in recognition of the unique collaboration between Richardson and Saint-Gaudens, two of the era's leading creative figures.\nSee also\n*Wyoming Historical Landmarks\nNotes\nReferences\n* Dell Upton, Architecture in the United States, Oxford University Press, 1998, pages 96–97. .\n* [http://hdl.loc.gov/loc.pnp/hhh.wy0049 Historic American Buildings Survey (Library of Congress)]\nExternal links\n*[https://wyoparks.wyo.gov/index.php/places-to-go/ames-monument Ames Monument], Wyoming Division of State Parks and Historic Sites\n*[https://wyoshpo.wyo.gov/index.php/programs/national-register/wyoming-listings/view-full-list/355-ames-monument Wyoming State Historic Preservation Office article]\n*[http://siris-artinventories.si.edu/ipac20/ipac.jsp?&profile=all&source=~!siartinventories&uri=full=3100001~!317088~!0#focus Save Outdoor Sculpture Survey for the Ames Monument]\n*[http://hdl.loc.gov/loc.pnp/hhh.wy0049 Ames Monument, Interstate 80, Laramie, Albany, WY] at the Historic American Buildings Survey (HABS)"
    }
  ]
}