{
  "content": [
    {
      "type": "text",
      "text": "# Amos (ancient city)\n\nHisarburnu\n|native_name   =\n|map           =\n|image         = Amos theatre.jpg\n|caption       = The theatre of Amos, with the gulf of Marmaris in the background.\n|location      = Turunç, Muğla Province, Turkey.\n|region        = Caria\n|type          = Deme-centre with acropolis, necropolis and scanty remains of a temple and a theatre.\n|area_m2       =\n|area_km2      =\n|cultures      = Greek/Carian\n|material      = Local stone in Ashlar, Polygonal, and Isodomic techniques.\n|epochs        = Classical - Hellenistic\n|built         = Earliest findings dated to Classical times.\n|builder       = Probably Doric Rhodians.\n|abandoned     = Probably in the Roman era.\n|public_access = Yes\n|condition     = Maintained for visitation with paths leading to the main sights.\n|coordinates   =\n}}\nAmos (Ancient Greek: Ἄμος, possibly from ἄμμος \"sandy\") was a settlement (dēmē) of ancient Caria, located near the modern town of Turunç, Turkey.\nHistory\nAmos was located in the Rhodian Peraia in Caria on the Mediterranean coast. It was probably connected with Lindos which is supported by epigraphic finds from that city. Its connection to the poleis of Rhodes is further attested by the use of the Doric dialect in the inscriptions found at the settlement.\nAmos was in the 5th century incorporated in the Delian league together with the other Rhodian areas, and is noted in the Athenian tributes lists as belonging to the community of the kherronēsioi (\"the people of the peninsula\"). The Loryma peninsula is the most probable candidate for this peninsula; the other members of this community are unknown. At some point during this period, Amos and the other two members of the kherronēsioi formed an economic union (συντέλεια, synteleia) in order to pay their tributes. The members of this synteleia must have incorporated the majority of the Loryma peninsula.\nIt is known from a set of three inscriptions (SEG [http://epigraphy.packhum.org/inscriptions/main?url=oi%3Fikey%3D283028%26bookid%3D663%26region%3D8%26subregion%3D28 14.683]; [http://epigraphy.packhum.org/inscriptions/main?url=oi%3Fikey%3D283029%26bookid%3D663%26region%3D8%26subregion%3D28 14.684]; [http://epigraphy.packhum.org/inscriptions/main?url=oi%3Fikey%3D283030%26bookid%3D663%26region%3D8%26subregion%3D28 14.685]) that Amos in ca. 200 B.C.E. had a board of hieromnamones, \"sacred rememberers\" that were responsible for keeping and remembering legal agreements and other juridical proceedings.\nThe inhabitants of the Rhodian Peraia, and thus Amos as well, were full Rhodian citizens. It seems however as the amiens, being of Lindian descent, held no citizenship at Lindos. The inscriptions mentioned above indicate that the city (ha polis, that is, Rhodes) had the right to evict tenants and charge fines, showing that the polis had strong interests in the area.\nRemains\nThe remnants of ancient Amos is centered on the elongated hill of Asarcık at Hisarburnu (\"fortress point\"), just above the gulf of Marmaris. The city wall is made of coursed polygonal masonry dated to the Hellenistic period, and is fairly well preserved on the north slope where walls and towers still stand 3–4 metres high. The wall on the south reach has almost disappeared due to erosion. Five towers are preserved, all of which are solid except for one.  There is one gate in the northern wall, which is probably the main city gate.  On the basis of the type of masonry used, the construction of the original wall has been dated to the 4th century B.C.E.\nOf the intra muros remains, the theatre is the most apparent. Of the three known Greek theatres of the Rhodian Peraia, the Amos theatre is the only one with preserved remnants of the skēnē and the orchestra. The approximate number of possible spectators is estimated to around 1300. G. E. Bean found in 1948 a fragmentary altar to Dionysos in the area of the orchestra.\nOn the top of the hill, just west of the theatre, several fragments of an Hellenistic circular or semi-circular statue base is to be seen.\nFurther to the west, close to the ramparts, are the foundations of a small temple in antis with a pronaos, 6.8 m wide and 13.8 m long. Inscriptions with a temple inventory found in the vicinity show that the temple was probably dedicated to Apollo Samnaios (\"Apollo-of-the-hill\"), a deity only known from this location.\nThe necropolis is located just outside the city proper, north of the city walls. Several rock-cut tombs are visible in the terrain, together with some inscriptions and fragments of monumental architecture.\nReferences"
    }
  ]
}