{
  "content": [
    {
      "type": "text",
      "text": "# Amrit Tewari\n\n| birth_place        = Chandigarh, India\n| death_date         =\n| death_place        = Chandigarh, India\n| restingplace       =\n| restingplacecoordinates =\n| othername          = Amrit Kaur Tewari\n| occupation         = Pediatric Dentist\n| yearsactive        =\n| known for          = DentistryDental academics\n| spouse             = V. N. Tewari\n| domesticpartner    =\n| children           = Manish Tewari and daughter\n| parents            = Sardar Tirath Singh\n| website            =\n| awards             = Padma ShriPierre Fauchard Academy Certificate of Merit\n}}\nAmrit Kaur Tewari (September 5, 1938 – January 13, 2018) was an Indian dental physician and a former Dean of the Post Graduate Institute of Medical Education and Research (PGIMER), Chandigarh. She also served as Head, Oral Health Sciences Centre, PGI.  She was the daughter of Sardar Tirath Singh Gurum who was the minister in the Erstwhile PEPSU .\nShe was the first person to be selected as the Life member of the Indian Society of Pedodontics and Preventive Dentistry (ISPPD) and is a Fellow of the Indian Dental Association and the National Academy of Medical Sciences. She was also former member of the Chandigarh Municipal Corporation.\nAfter her superannuation from PGIMER, she was made the Professor Emeritus of the Institute. She had written several medical articles in peer reviewed journals and had published a book, Fluorides and Dental Caries : A Compendium The Government of India awarded her the fourth highest civilian honour of the Padma Shri in 1992. Tewari, a recipient of the Certificate of Merit of the Pierre Fauchard Academy, was married to V. N. Tewari, an author and professor of Punjabi at Punjab University and has a son, Manish Tewari, an Indian politician and a former Minister of Information and Broadcasting. V. N. Tewari was the victim of Punjab insurgency, when he was shot dead by militants in 1984.\nFamily\nAmrit Kaur Tewari's father Sardar Tirath Singh was a minister in the erstwhile PEPSU. Her brother Barjinder Shingh was chairman of the Central Board of Direct Taxes while her sister Surinder Kaur retired as an IRS officer. Her husband VN Tewari was a professor at the Punjab University. Her son was the former Union Minister Manish Tewari, and daughter Puneet Tewari, is settled in the US.\nDeath\nAmrit Kaur Tewari died on January 15, 2018, due to prolonged illness.\nSee also\n* Manish Tewari\nReferences"
    }
  ]
}