{
  "content": [
    {
      "type": "text",
      "text": "# Amy Warren\n\nAmelia (Amy) Elizabeth Mary Warren (1840 – March 1932), was an Irish marine biologist and conchologist who published the first annotated list and catalogues of land, freshwater, and marine molluscs in County Mayo and County Sligo. She is considered to be one of the most important donors to the National Museum of Ireland Natural History's Irish and British shell collection, contributing over 400 specimens together with her brother Robert Warren.\nPersonal life\nBorn in 1840 at Castlewarren near Carrigaline, County Cork, Ireland, to Robert Warren and Matilda Hopper, Warren spent much of her life in Moy View, Ballina, County Mayo. In the 1911 census, she was recorded living with her brother Robert and sister Matilda in Monkstown, Cork. Warren died in March 1931 in County Cork, with a belated obituary appearing in the Journal of Conchology in 1938.\nScientific contributions\nWarren's primary area of focus was the study of Mollusca, and she published several papers in the late 19th century that included distributional lists, particularly of rare species found in Killala Bay and Bundoran.\nHer first publication, \"The land and freshwater Mollusca of Mayo and Sligo,\" appeared in The Zoologist in 1879. This paper presented her annotated list of land and freshwater molluscs from Counties Mayo and Sligo, which was the first published catalogue of molluscs specific to the region. She further contributed to the field with her catalogue of marine mollusks from Killala Bay, titled \"Contributions towards a list of the marine Mollusca of Killala Bay, Ireland,\" published in the Journal of Conchology in 1892. Additionally, she published seven notes in the Irish Naturalist over the following four years, primarily describing rare and interesting species, including some from Killala Bay.\nHer research and collections played a vital role in the development of the Irish and British shell collection at the National Museum of Ireland Natural History, where she donated over 400 specimens alongside her brother Robert Warren, some of are on display at the Ulster Museum in Belfast. These specimens also provide evidence of collaboration and shared collections between Amy Warren and Edward Waller, an Irish zoologist, as indicated by labels referencing exchanges of shells between them. Their collaborative efforts in the field of conchology suggest that Waller acted as a mentor as well as colleague to Warren.\nWarren's passion for natural history was shared by her older brother, Robert Warren, who was a naturalist. Robert co-authored the book \"Birds of Ireland\" with Richard J. Ussher, published in 1900, and authored several scientific articles on birds.\nDue to her contributions to the field, the sea snail species Odostomia wareni was named by Christoffer Schanderin her honour in 1994.\nReferences"
    }
  ]
}