{
  "content": [
    {
      "type": "text",
      "text": "# Analysis of European colonialism and colonization\n\ns'' in the Belgian Congo studying medicine]]\nWestern European colonialism and colonization was the Western European policy or practice of acquiring full or partial political control over other societies and territories, founding a colony, occupying it with settlers, and exploiting it economically. For example, colonial policies, such as the type of rule implemented, the nature of investments,  and identity of the colonizers, are cited as impacting postcolonial states. Examination of the state-building process, economic development, and cultural norms and mores shows the direct and indirect consequences of colonialism on the postcolonial states. It has been estimated that Britain and France traced almost 50% of the entire length of today's international boundaries as a result of British and French imperialism.\nHistory of colonization and decolonization\nThe era of European colonialism can be defined by two big waves of colonialism: the first wave began in the 15th century, during the Age of Discovery of some European powers vastly extending their reach around the globe by establishing colonies in the Americas, and Asia. The second wave began during the 19th century, centering around Africa, in what is called the Scramble for Africa. The dismantling of European empires following World War II saw the process of decolonization begin in earnest. In 1941, President Franklin D. Roosevelt and British Prime Minister Winston Churchill jointly released the Atlantic Charter, which broadly outlined the goals of the U.S. and British governments. One of the main clauses of the charter acknowledged the right of all people to choose their own government. The document became the foundation for the United Nations and all of its components were integrated into the UN Charter, giving the organization a mandate to pursue global decolonization.\nVarieties of colonialism\nHistorians generally distinguish two main varieties established by European colonials: the first is settler colonialism, where farms and towns were established by arrivals from Europe. Second, exploitation colonialism, purely extractive and exploitative colonies whose primary function was to develop economic exports. These frequently overlapped or existed on a spectrum.\nSettler colonialism\nin 1750]]\nSettler colonialism is a form of colonization where foreign citizens move into a region and create permanent or temporary  settlements called colonies. The creation of settler colonies often resulted in the forced migration of indigenous peoples to less desirable territories. This practice is exemplified in the colonies established in what became the United States, New Zealand, Namibia, South Africa, Canada, Brazil, Uruguay, Chile, Argentina, Israel and Australia. Native populations frequently suffered population collapse due to contact with new diseases.\nThe resettlement of indigenous peoples frequently occurs along demographic lines, but the central stimulus for resettlement is access to desirable territory. Regions free of tropical disease with easy access to trade routes were favorable. When Europeans settled in these desirable territories, natives were forced out and regional power was seized by the colonialists. This type of colonial behavior led to the disruption of local customary practices and the transformation of socioeconomic systems. Ugandan academic Mahmood Mamdani cites \"the destruction of communal autonomy, and the defeat and dispersal of tribal populations\" as one primary factor in colonial oppression. As agricultural expansion continued through the territories, native populations were further displaced to clear fertile farmland.\nDaron Acemoglu, James A. Robinson,  and Simon Johnson  theorize that Europeans were more likely to form settler colonies in areas where they would not face high mortality rates due to disease and other exogenous factors. Many settler colonies sought to establish European-like institutions and practices that granted certain personal freedoms and allowed settlers to become wealthy by engaging in trade. Thus, jury trials, freedom from arbitrary arrest, and electoral representation were implemented to allow settlers rights similar to those enjoyed in Europe, though these rights generally did not apply to the indigenous people.\nExploitation colonialism\nExploitation colonialism is a form of colonization where foreign armies conquer a country in order to control and capitalize on its natural resources and indigenous population. Acemoglu, Johnson, and Robinson argue, \"institutions [established by colonials] did not introduce much protection for private property, nor did they provide checks and balances against government expropriation. In fact, the main purpose of the extractive state was to transfer as much of the resources of the colony to the colonizer, with the minimum amount of investment possible.\" Since these colonies were created with the intent to extract resources, colonial powers had no incentives to invest in institutions or infrastructure that did not support their immediate goals. Thus, Europeans established authoritarian regimes in these colonies, which had no limits on state power.\nThe policies and practices carried out by King Leopold II of Belgium as the absolute ruler of the Congo Free State in the Congo Basin are an extreme example of exploitation colonialism. E. D. Morel detailed the atrocities in multiple articles and books. Morel believed the Leopoldian system that eliminated traditional, commercial markets in favor of pure exploitation was the root cause of the injustice in the Congo. Under the \"veil of philanthropic motive\", King Leopold received the consent of multiple international governments (including the United States, Great Britain, and France) to assume trusteeship of the vast region in order to support the elimination of the slave trade. Leopold positioned himself as proprietor of an area totaling nearly one million square miles, which was home to nearly 20 million Africans.\nAfter establishing dominance in the Congo Basin, Leopold extracted large quantities of ivory, rubber, and other natural resources. It has been estimated that Leopold made 1.1 billion in 2005 dollars by employing a variety of exploitative tactics. Soldiers demanded unrealistic quantities of rubber be collected by African villagers, and when these goals were not met, the soldiers held women hostage, beat or killed the men, and burned crops. These and other forced labor practices caused the birth rate to decline as famine and disease spread. All of this was done at very little monetary cost. M. Crawford Young observed, \"[the concessionary companies] brought little capital – a mere 8000 pounds ... [to the Congo basin] – and instituted a reign of terror sufficient to provoke an embarrassing public-protest campaign in Britain and the United States at a time when the threshold of toleration for colonial brutality was high.\"\nThe system of government implemented in the Congo by Leopold and later Belgium was authoritarian and oppressive. Multiple scholars view the roots of authoritarianism under Mobutu as the result of colonial practices.\nIndirect and direct rule of the colonial political system\nSystems of colonial rule can be broken into the binary classifications of direct and indirect rule. During the era of colonization, Europeans were faced with the monumental task of administering the vast colonial territories around the globe. The initial solution to this problem was direct rule, which involves the establishment of a centralized European authority within a territory run by colonial officials. In a system of direct rule, the native population is excluded from all but the lowest level of the colonial government. Mamdani defines direct rule as centralized despotism: a system where natives were not considered citizens. By contrast, indirect rule integrates pre-established local elites and native institutions into the administration of the colonial government. Indirect rule maintains good pre-colonial institutions and fosters development within the local culture. Mamdani classifies indirect rule as “decentralized despotism,” where day-to-day operations were handled by local chiefs, but the true authority rested with the colonial powers.\nIndirect rule\n. The princely states are in yellow.]]\nIn certain cases, as in India, the colonial power directed all decisions related to foreign policy and defense, while the indigenous population controlled most aspects of internal administration. This led to autonomous indigenous communities that were under the rule of local tribal chiefs or kings. These chiefs were either drawn from the existing social hierarchy or were newly minted by the colonial authority. In areas under indirect rule, traditional authorities acted as intermediaries for the “despotic” colonial rule, while the colonial government acted as an advisor and only interfered in extreme circumstances. Often, with the support of the colonial authority, natives gained more power under indirect colonial rule than they had in the pre-colonial period. Mamdani points out that indirect rule was the dominant form of colonialism and therefore most who were colonized bore colonial rule that was delivered by their fellow natives.\nThe purpose of indirect rule was to allow natives to govern their own affairs through “customary law.” In practice though, the native authority decided on and enforced its own unwritten rules with the support of the colonial government. Rather than following the rule of law, local chiefs enjoyed judicial, legislative, executive, and administrative power in addition to legal arbitrariness.\nDirect rule\n, Benin (known as French Dahomey during this period)]]\nIn systems of direct rule, European colonial officials oversaw all aspects of governance, while natives were placed in an entirely subordinate role. Unlike indirect rule, the colonial government did not convey orders through local elites, but rather oversaw administration directly. European laws and customs were imported to supplant traditional power structures. Joost van Vollenhoven, Governor-General of French West Africa, 1917–1918, described the role of the traditional chiefs in by saying, “his functions were reduced to that of a mouthpiece for orders emanating from the outside...[The chiefs] have no power of their own of any kind. There are not two authorities in the cercle, the French authority and the native authority; there is only one.” The chiefs were therefore ineffective and not highly regarded by the indigenous population. There were even instances where people under direct colonial rule secretly elected a real chief in order to retain traditional rights and customs.\nDirect rule deliberately removed traditional power structures in order to implement uniformity across a region. The desire for regional homogeneity was the driving force behind the French colonial doctrine of Assimilation. The French style of colonialism stemmed from the idea that the French Republic was a symbol of universal equality. As part of a civilizing mission, the European principles of equality were translated into legislation abroad. For the French colonies, this meant the enforcement of the French penal code, the right to send a representative to parliament, and imposition of tariff laws as a form of economic assimilation. Requiring natives to assimilate in these and other ways, created an ubiquitous, European-style identity that made no attempt to protect native identities. Indigenous people living in colonized societies were obliged to obey European laws and customs or be deemed “uncivilized” and denied access to any European rights.\nComparative outcomes between indirect and direct rule\nBoth direct and indirect rule have persistent, long term effects on the success of former colonies. Lakshmi Iyer, of Harvard Business School, conducted research to determine the impact type of rule can have on a region, looking at postcolonial India, where both systems were present under British rule. Iyer's findings suggests that regions which had previously been ruled indirectly were generally better-governed and more capable of establishing effective institutions than areas under direct British rule. In the modern postcolonial period, areas formerly ruled directly by the British perform worse economically and have significantly less access to various public goods, such as health care, public infrastructure, and education.\nIn his book Citizen and Subject: Contemporary Africa and the Legacy of Colonialism, Mamdani claims the two types of rule were each sides of the same coin. He explains that colonialists did not exclusively use one system of rule over another. Instead, European powers divided regions along urban-rural lines and instituted separate systems of government in each area. Mamdani refers to the formal division of rural and urban natives by colonizers as the “bifurcated state.” Urban areas were ruled directly by the colonizers under an imported system of European law, which did not recognize the validity of native institutions. In contrast, rural populations were ruled indirectly by customary and traditional law and were therefore subordinate to the “civilized” urban citizenry. Rural inhabitants were viewed as “uncivilized” subjects and were deemed unfit to receive the benefits of citizenship. The rural subjects, Mamdani observed, had only a “modicum of civil rights,” and were entirely excluded from all political rights.\nMamdani argues that current issues in postcolonial states are the result of colonial government partition, rather than simply poor governance as others have claimed. Current systems — in Africa and elsewhere — are riddled with an institutional legacy that reinforces a divided society. Using the examples of South Africa and Uganda, Mamdani observed that, rather than doing away with the bifurcated model of rule, postcolonial regimes have reproduced it. Although he uses only two specific examples, Mamdani maintains that these countries are simply paradigms representing the broad institutional legacy colonialism left on the world. He argues that modern states have only accomplished \"deracialization\" and not democratization following their independence from colonial rule. Instead of pursuing efforts to link their fractured society, centralized control of the government stayed in urban areas and reform focused on “reorganizing the bifurcated power forged under colonialism.” Native authorities that operated under indirect rule have not been brought into the mainstream reformation process; instead, development has been “enforced” on the rural peasantry. In order to achieve autonomy, successful democratization, and good governance, states must overcome their fundamental schisms: urban versus rural, customary versus modern, and participation versus representation.\nColonial actions and their impacts\nEuropean colonizers engaged in various actions around the world that had both short term and long term consequences for the colonized. Numerous scholars have attempted to analyze and categorize colonial activities by determining if they have positive or negative outcomes. Stanley Engerman and Kenneth Sokoloff categorized activities, which were driven by regional factor endowments, by determining whether they were associated with high or low levels of economic development. Acemoglu, Johnson, and Robinson attempted to understand what institutional changes caused previously rich countries to become poor after colonization. Melissa Dell documented the persistent, damaging effects of colonial labor exploitation under the mit'a mining system in Peru; showing significant differences in height and road access between previous mit'a and non-mit'a communities. Miriam Bruhn and Francisco A. Gallego employed a simple tripartite classification: good, bad, and ugly. Regardless of the system of classification, the fact remains, colonial actions produced varied outcomes which continue to be relevant.\nIn trying to assess the legacy of colonization, some researchers have focused on the type of political and economic institutions that existed before the arrival of Europeans. Heldring and Robinson conclude that while colonization in Africa had overall negative consequences for political and economic development in areas that had previous centralized institutions or that hosted white settlements, it possibly had a positive impact in areas that were virtually stateless, like South Sudan or Somalia. In a complementary analysis, Gerner Hariri observed that areas outside Europe which had State-like institutions before 1500 tend to have less open political systems today. According to the scholar, this is due to the fact that during the colonization, European liberal institutions were not easily implemented. Beyond the military and political advantages, it is possible to explain the domination of European countries over non-European areas by the fact that capitalism did not emerge as the dominant economic institution elsewhere. As Ugo Pipitone argues, prosperous economic institutions that sustain growth and innovation did not prevail in areas like China, the Arab world, or Mesoamerica because of the excessive control of these proto-States on private matters.\nAnother angle that can be considered when assessing colonial impacts is examining the institutions that formed across Africa after the withdrawal of European colonizers. In many cases, colonial rule led to the development of weak and flawed institutions in postcolonial Africa.\nLevitsky and Murillo further examine the importance of institutions with their research on the factors that contribute to institutional strength. They define rule enforcement and institutional stability (durability) as the main factors contributing to the success of an institution. In Africa, formal institutions had low stability and weak enforcement, leading to the emergence of dysfunctional institutions. A major source of the low institutional stability in African countries was the colonial partitioning of African borders, leading to political violence and ethnic conflict. Additionally, weak enforcement in Africa often stems from the creation of “window-dressing” institutions, where superficial democratic policies are implemented to feign democracy. However, these policies are rarely enforced.\nDouglass North provides the argument that institutional change is incremental and is a result of “path-dependency”,  which means that seemingly insignificant historical events can have major impacts on the formation of eventual institutions. These arguments follow William Brian Arthur's theories on path-dependency where he states that market lock-in to a subpar technology is determined by “small-event history”. Thus, the colonial history in Africa becomes relevant as the decisions of European colonizers have impacted contemporary African economic and political structures. As a result, African institutions were impacted as well. Collectively, these theories from Levitsky and Murillo, North, and Arthur work to explain how colonialism led to the development and persistence of suboptimal African institutions.\nReorganization of borders\nDefining borders\nThroughout the era of European colonization, those in power routinely partitioned land masses and created borders that are still in place today. It has been estimated that Britain and France traced almost 40% of the entire length of today's international boundaries. Sometimes boundaries were naturally occurring, like rivers or mountains, but other times these borders were artificially created and agreed upon by colonial powers. The Berlin Conference of 1884 systemized European colonization in Africa and is frequently acknowledged as the genesis of the Scramble for Africa. The Conference implemented the Principle of Effective Occupation in Africa which allowed European states with even the most tenuous connection to an African region to claim dominion over its land, resources, and people. In effect, it allowed for the arbitrary construction of sovereign borders in a territory where they had never previously existed.\nJeffrey Herbst has written extensively on the impact of state organization in Africa. He notes, because the borders were artificially created, they generally do not conform to “typical demographic, ethnographic, and topographic boundaries.” Instead, they were manufactured by colonialists to advance their political goals. This led to large scale issues, like the division of ethnic groups; and small scale issues, such as families’ homes being separated from their farms.\nWilliam F. S. Miles of Northeastern University, argues that this perfunctory division of the entire continent created expansive ungoverned borderlands. These borderlands persist today and are havens for crimes like human trafficking and arms smuggling.\nModern preservation of the colonially defined borders\nHerbst notes a modern paradox regarding the colonial borders in Africa: while they are arbitrary there is a consensus among African leaders that they must be maintained. Organization of African Unity in 1963 cemented colonial boundaries permanently by proclaiming that any changes made were illegitimate. This, in effect, avoided readdressing the basic injustice of colonial partition, while also reducing the likelihood of inter-state warfare as territorial boundaries were considered immutable by the international community.\nModern national boundaries are thus remarkably invariable, though the stability of the nation states has not followed in suit. Some African states are plagued by internal issues such as inability to effectively collect taxes and weak national identities. Lacking any external threats to their sovereignty, these countries have failed to consolidate power, leading to weak or failed states.\nThough the colonial boundaries sometimes caused internal strife and hardship, some present day leaders benefit from the desirable borders their former colonial overlords drew. For example, Nigeria's inheritance of an outlet to the sea — and the trading opportunities a port affords — gives the nation a distinct economic advantage over its neighbor, Niger. Effectively, the early carving of colonial space turned naturally occurring factor endowments into state controlled assets.\nDiffering colonial investments\nWhen European colonials entered a region, they invariably brought new resources and capital management. Different investment strategies were employed, which included focuses on health, infrastructure, or education. All colonial investments have had persistent effects on postcolonial societies, but certain types of spending have proven to be more beneficial than others. French economist Élise Huillery conducted research to determine specifically what types of public spending were associated with high levels of current development. Her findings were twofold. First, Huillery observes that the nature of colonial investments can directly influence current levels of performance. Increased spending in education led to higher school attendance; additional doctors and medical facilities decreased preventable illnesses in children; and a colonial focus on infrastructure translated into more modernized infrastructure today. Adding to this, Huillery also learned that early colonial investments instituted a pattern of continued spending that directly influenced the quality and quantity of public goods available today.\nLand, property rights, and labor\nLand and property rights\nAccording to Mahmood Mamdani, prior to colonization, indigenous societies did not necessarily consider land private property. Alternatively, land was a communal resource that everyone could utilize. Once natives began interacting with colonial settlers, a long history of land abuse followed. Extreme examples of this include Trail of Tears, a series of forced relocations of Native Americans following the Indian Removal Act of 1830, and the apartheid system in South Africa. Australian anthropologist Patrick Wolfe points out that in these instances, natives were not only driven off land, but the land was then transferred to private ownership. He believes that the “frenzy for native land” was due to economic immigrants that belonged to the ranks of Europe's landless.\nMaking seemingly contradictory argument, Acemoglu, Johnson, and Robinson view strong property rights and ownership as an essential component of institutions that produce higher per capita income. They expand on this by saying property rights give individuals the incentive to invest, rather than stockpile, their assets. While this may appear to further encourage colonialists to exert their rights through exploitative behaviors, instead it offers protection to native populations and respects their customary ownership laws. Looking broadly at the European colonial experience, Acemoglu, Johnson, and Robinson explain that exploitation of natives transpired when stable property rights intentionally did not exist. These rights were never implemented in order to facilitate the predatory extraction of resources from indigenous populations. Bringing the colonial experience to the present that, they maintain that broad property rights set the stage for the effective institutions that are fundamental to strong democratic societies. An example of Acemoglu, Robinson and Johnson hypothesis is in the work of La Porta, et al. In a study of the legal systems in various countries, La Porta, et al. found that in those places that were colonized by the United Kingdom and kept its common-law system, the protection of property right is stronger compared to the countries that kept the French civil law.\nIn the case of India, Abhijit Banerjee and Lakshmi Iyer found divergent legacies of the British land tenure system in India. The areas where the property rights over the land were given to landlords registered lower productivity and agricultural investments in post-Colonial years compared to areas where land tenure was dominated by cultivators. The former areas also have lower levels of investment in health and education.\nEnglish philosopher John Locke´s theory of property supported settler colonialism, saying that the land belonged to those that made productive use of it.\nLabor exploitation\nProminent Guyanese scholar and political activist Walter Rodney wrote at length about the economic exploitation of Africa by the colonial powers. In particular, he saw laborers as an especially abused group. While a capitalist system almost always employs some form of wage labor, the dynamic between laborers and colonial powers left the way open for extreme misconduct. According to Rodney, African workers were more exploited than Europeans because the colonial system produced a complete monopoly on political power and left the working class small and incapable of collective action. Combined with deep-seated racism, native workers were presented with impossible circumstances. The racism and superiority felt by the colonizers enabled them to justify the systematic underpayment of Africans even when they were working alongside European workers. Colonialists further defended their disparate incomes by claiming a higher cost of living. Rodney challenged this pretext and asserted the European quality of life and cost of living were only possible because of the exploitation of the colonies and African living standards were intentionally depressed in order to maximize revenue. In its wake, Rodney argues colonialism left Africa vastly underdeveloped and without a path forward.\nSocietal consequences of colonialism\nEthnic identity\nThe colonial changes to ethnic identity have been explored from the political, sociological, and psychological perspectives. In his book The Wretched of the Earth, French Afro-Caribbean psychiatrist and revolutionary Frantz Fanon claims the colonized must \"ask themselves the question constantly: 'who am I?'\" Fanon uses this question to express his frustrations with fundamentally dehumanizing character of colonialism. Colonialism in all forms, was rarely an act of simple political control. Fanon argues the very act of colonial domination has the power to warp the personal and ethnic identities of natives because it operates under the assumption of perceived superiority. Natives are thus entirely divorced from their ethnic identities, which has been replaced by a desire to emulate their oppressors.\nEthnic manipulation manifested itself beyond the personal and internal spheres. Scott Straus from the University of Wisconsin describes the ethnic identities that partially contributed to the Rwandan genocide. In April 1994, following the assassination of Rwanda's President Juvénal Habyarimana, Hutus of Rwanda turned on their Tutsi neighbors and slaughtered between 500,000 and 800,000 people in just 100 days. While politically this situation was incredibly complex, the influence ethnicity had on the violence cannot be ignored. Before the German colonization of Rwanda, the identities of Hutu and Tutsi were not fixed. Germany ruled Rwanda through the Tutsi dominated monarchy and the Belgians continued this following their takeover. Belgian rule reinforced the difference between Tutsi and Hutu. Tutsis were deemed superior and were propped up as a ruling minority supported by the Belgians, while the Hutu were systematically repressed. The country's power later dramatically shifted following the so-called Hutu Revolution, during which Rwanda gained independence from their colonizers and formed a new Hutu-dominated government. Deep-seated ethnic tensions did not leave with the Belgians. Instead, the new government reinforced the cleavage.\nReligious changes\nReligion was one of the key parts of colony societies that were changed and manipulated. Ghana was one of the key countries that this impacted by British colonial rule. Jedwarb, Meier zu Selhausen, and Moradi (2022) were huge believers that the introduction of Christianity was one of the main reasons that Ghana still struggles to balance two societies in the modern day. \"By 1932 the number of missions had expanded to 1,882 with 340,000 followers.\" At the time this was 9% of the population now in 2020 reportedly \"The Christian share has since grown to 80%.\" Christianity unsettled the traditional African religious beliefs as well as the entire economic and political stability. This occurred not just specifically in Ghana but also in all over colony countries. Congo, one of the worst affected countries, had rules inflicted upon them like banning the practice of non-European religions. Oliver (1952) and Cleall (2009) argued that missionaries, used to teach the native people, were introduced \"with little to no information on local circumstances, crossing political boundaries and whose objective was to save souls no matter the cost.” This caused significant damage both short term but especially long term with countries unable to cope with managing the different religions which consequently caused civil wars and infighting.\nCivil society\nJoel Migdal of the University of Washington believes weak postcolonial states have issues rooted in civil society. Rather than seeing the state as a singular dominant entity, Migdal describes “weblike societies” composed of social organizations. These organizations are a melange of ethnic, cultural, local, and familial groups and they form the basis of our society. The state is simply one actor in a much larger framework. Strong states are able to effectively navigate the intricate societal framework and exert social control over people's behavior. Weak states, on the other hand, are lost amongst the fractionalized authority of a complex society.\nMigdal expands his theory of state-society relations by examining Sierra Leone. At the time of Migdal's publication (1988), the country's leader, President Joseph Saidu Momoh, was widely viewed as weak and ineffective. Just three years later, the country erupted into civil war, which continued for nearly 11 years. The basis for this tumultuous time, in Migdal's estimation, was the fragmented social control implemented by British colonizers. Using the typical British system of indirect rule, colonizers empowered local chiefs to mediate British rule in the region, and in turn, the chiefs exercised social control. After achieving independence from Great Britain, the chiefs remained deeply entrenched and did not allow for the necessary consolidation of power needed to build a strong state. Migdal remarked, “Even with all the resources at their disposal, even with the ability to eliminate any single strongman, state leaders found themselves severely limited.” It is necessary for the state and society to form a mutually beneficial symbiotic relationship in order for each to thrive. The peculiar nature of postcolonial politics makes this increasingly difficult.\nLinguistic discrimination\nIn settler colonies, indigenous languages were often lost either as indigenous populations were decimated by war and disease, or as aboriginal tribes mixed with colonists. On the other hand, in exploitation colonies such as India, colonial languages were usually only taught to a small local elite. The linguistic differences between the local elite and other locals exacerbated class stratification, and also increased inequality in access to education, industry and civic society in postcolonial states.\nSport\nVarious traditional games that were played in different countries were overtaken by Western sports during the colonial era. This effect was notable in British colonies, as the British invented many of what later became the world's most popular sports during the colonial era, and propagated these sports in part because they allowed for the perpetuation of class and racial divides beneficial to them, and due to the belief that they would help spread Britain's cilivising values. Towards the end of the colonial era, colonizers' sports often played a significant role in the colonies' independence movements, as sport became an avenue for the colonized peoples to work together and prove their equality. After the colonial era, Western sports often became an important part of nation-building and international relations for former colonies; for example, cricket played a significant role in bringing Indian people together and allowed India to do \"cricket diplomacy\" with Pakistan, a country which it has had significant tensions with. Western sport has also played a role in fighting racism, as when South Africa was banned from most international sports during the apartheid era.\nEcological impacts of colonialism\nEuropean colonialism spread contagious diseases between Europeans and subjugated peoples.\nCountering disease\n, May 1946.]]\nThe Spanish Crown organised a mission (the Balmis expedition) to transport the smallpox vaccine and establish mass vaccination programs in colonies in 1803. By 1832, the federal government of the United States established a smallpox vaccination program for Native Americans. Under the direction of Mountstuart Elphinstone a program was launched to increase smallpox vaccination in India.\nFrom the beginning of the 20th century onwards, the elimination or control of disease in tropical countries became a necessity for all colonial powers. The sleeping sickness epidemic in Africa was arrested due to mobile teams systematically screening millions of people at risk. The biggest population increases in human history occurred during the 20th century due to the decreasing mortality rate in many countries due to medical advances.\nColonial policies contributing to indigenous deaths from disease\n, Canada, 1901. This school was part of the Canadian Indian residential school system.]]\nJohn S. Milloy published evidence indicating that Canadian authorities had intentionally concealed information on the spread of disease in his book A National Crime: The Canadian Government and the Residential School System, 1879 to 1986 (1999). According to Milloy, the Government of Canada was aware of the origins of many diseases but maintained a secretive policy. Medical professionals had knowledge of this policy, and further, knew it was causing a higher death rate among indigenous people, yet the policy continued.\nEvidence suggests, government policy was not to treat natives infected with tuberculosis or smallpox, and native children infected with smallpox and tuberculosis were deliberately sent back to their homes and into native villages by residential school administrators. Within the residential schools, there was no segregation of sick students from healthy students, and students infected with deadly illnesses were frequently admitted to the schools, where infections spread among the healthy students and resulted in deaths; death rates were at least 24% and as high as 69%.\nTuberculosis was the leading cause of death in Europe and North America in the 19th century, accounting for about 40% of working-class deaths in cities, and by 1918 one in six deaths in France were still caused by tuberculosis. European governments, and medical professionals in Canada, were well aware that tuberculosis and smallpox were highly contagious, and that deaths could be prevented by taking measures to quarantine patients and inhibit the spread of the disease. They failed to do this, however, and imposed laws that in fact ensured that these deadly diseases spread quickly among the indigenous population. Despite the high death rate among students from contagious disease, in 1920 the Canadian government made attendance at residential schools mandatory for native children, threatening non-compliant parents with fines and imprisonment. John S. Milloy argued that these policies regarding disease were not conventional genocide, but rather policies of neglect aimed at assimilating natives.\nSome historians, such as Roland Chrisjohn, director of Native Studies at St. Thomas University, have argued that some European colonists, having discovered that indigenous populations were not immune to certain diseases, deliberately spread diseases to gain military advantages and subjugate local peoples. In his book The Circle Game: Shadows and Substance in the Indian Residential School Experience in Canada, Chrisjohn argues that the Canadian government followed a deliberate policy amounting to genocide against native populations. During the siege of British-held Fort Pitt in Pontiac's War, the fort's commander, Simeon Ecuyer and his subordinate William Trent distributed blankets infected with smallpox to a Lenape delegation outside the fort. During the conflict, Colonel Henry Bouquet discussed plans to deliberately infect hostile Native American tribes with his superior, General Sir Jeffery Amherst, who wrote back approvingly of Bouquet's suggestion. Historians have been divided on the effectiveness of this particular incident in causing a smallpox outbreak among Native Americans in the region, though it has been recognized as one of the first instances of biological warfare. During the 1837 Great Plains smallpox epidemic, some scholars argued that the U.S. Army intentionally spread smallpox to Native American tribes, with scholar Ann F. Ramenofsky stating that \"in the nineteenth century, the U.S. Army sent contaminated blankets to Native Americans, especially Plains groups, to control the Indian problem.\"\nHistoric criticism of European Colonialism\nBartolomé de Las Casas (1484–1566) was the first Protector of the Indians appointed by the Spanish Crown. During his time in the Spanish West Indies, he witnessed many of the atrocities committed by Spanish colonists against the natives. After this experience, he reformed his view on colonialism and determined the Spanish people would suffer divine punishment if the gross mistreatment in the Indies continued. De Las Casas detailed his opinion in his book The Destruction of the Indies: A Brief Account (1552).\nDuring the sixteenth century, Spanish priest and philosopher Francisco Suarez (1548–1617) expressed his objections to colonialism in his work De Bello et de Indis (On War and the Indies). In this text and others, Suarez supported natural law and conveyed his beliefs that all humans had rights to life and liberty. Along these lines, he argued for the limitation of the imperial powers of Charles V, Holy Roman Emperor by underscoring the natural rights of indigenous people. Accordingly, native inhabitants of the colonial Spanish West Indies deserved independence and each island should be considered a sovereign state with all the legal powers of Spain.\nFrench writer Denis Diderot was openly critical of ethnocentrism and European colonialism in Tahiti. In a series of philosophical dialogues entitled Supplément au voyage de Bougainville (1772), Diderot imagines several conversations between Tahitians and Europeans. The two speakers discuss their cultural differences, which acts as a critique of European culture.\nModern theories of colonialism\nThe effects of European colonialism have consistently drawn academic attention in the decades since decolonization. New theories continue to emerge. The field of colonial and postcolonial studies has been implemented as a major in multiple universities around the globe.\nDependency theory\nDependency theory is an economic theory which postulated that advanced and industrialized \"metropolitan\" or \"core\" nations have been able to develop because of the existence of less-developed \"satellite\" or \"periphery\" states. Satellite nations are anchored to, and subordinate to, metropolitan countries because of the international division of labor. Satellite countries are thus dependent on metropolitan states and incapable of charting their own economic path.\nThe theory was introduced in the 1950s by Raul Prebisch, Director of the United Nations Economic Commission for Latin America after observing that economic growth in wealthy countries did not translate into economic growth in poor countries. Dependency theorists believe this is due to the import-export relationship between rich and poor countries. Walter Rodney, in his book How Europe Underdeveloped Africa, used this framework when observing the relationship between European trading companies and African peasants living in postcolonial states. Through the labor of peasants, African countries are able to gather large quantities of raw materials. Rather than being able to export these materials directly to Europe, states must work with a number of trading companies, who collaborated to keep purchase prices low. The trading companies then sold the materials to European manufactures at inflated prices. Finally the manufactured goods were returned to Africa, but with prices so high, that laborers were unable to afford them. This led to a situation where the individuals who labored extensively to gather raw materials were unable to benefit from the finished goods.\nNeocolonialism\nNeocolonialism is the continued economic and cultural control of countries that have been decolonized. The first documented use of the term was by Former President of Ghana Kwame Nkrumah in the 1963 preamble of the Organization of African States. Nkrumah expanded the concept of neocolonialism in the book Neo-Colonialism, the Last Stage of Imperialism (1965). In Nkrumah's estimation, traditional forms of colonialism have ended, but many African states are still subject to external political and economic control by Europeans. Neocolonialism is related to dependency theory in that they both acknowledge the financial exploitation of poor counties by the rich, but neocolonialism also includes aspects of cultural imperialism. Rejection of cultural neocolonialism formed the basis of négritude philosophy, which sought to eliminate colonial and racist attitudes by affirming the values of \"the black world\" and embracing \"blackness\".\nDebate about the possible benefits of Western Imperialism\n, picture taken 1940]]\nBenign colonialism\nBenign colonialism is a theory of colonialism in which benefits allegedly outweigh the negatives for indigenous populations whose lands, resources, rights and freedoms come under the control of a colonising nation-state. The historical source for the concept of benign colonialism resides with John Stuart Mill (1806–1873), who served as chief examiner of the British East India Company - dealing with British interests in India - in the 1820s and 1830s. Mill's most well-known essays on benign colonialism appear in \"Essays on some Unsettled Questions of Political Economy.\"\nMill's view contrasted with Burkean orientalists. Mill promoted the training of a corps of bureaucrats indigenous to India who could adopt the modern liberal perspective and values of 19th-century Britain. Mill predicted this group's eventual governance of India would be based on British values and perspectives.\nAdvocates of the concept of benign colonialism cite improved standards in health and education, in employment opportunities, in liberal markets, in the development of natural resources and in introduced governance. The first wave of benign colonialism lasted from c. 1790–1960, according to Mill's concept. The second wave included neocolonial policies exemplified in Hong Kong, where unfettered expansion of the market created a new form of benign colonialism. Political interference and military intervention in independent nation-states, such as Iraq, is also discussed under the rubric of benign colonialism in which a foreign power preempts national governance to protect a higher concept of freedom. The term is also used in the 21st century to refer to US, French and Chinese market activities in African countries with massive quantities of underdeveloped nonrenewable natural resources.\nThese views have support from some academics. Economic historian Niall Ferguson (born 1964) argues that empires can be a good thing provided that they are \"liberal empires\". He cites the British Empire as being the only example of a \"liberal empire\" and argues that it maintained the rule of law, benign government, free trade and, with the abolition of slavery, free labor. Historian Rudolf von Albertini agrees that, on balance, colonialism can be good. He argues that colonialism was a mechanism for modernisation in the colonies and imposed a peace by putting an end to tribal warfare.\nHistorians L. H. Gann and Peter Duignan have also argued that Africa probably benefited from colonialism on balance. Although it had its faults, colonialism was probably \"one of the most efficacious engines for cultural diffusion in world history\". The economic historian David Kenneth Fieldhouse has taken a kind of middle position, arguing that the effects of colonialism were actually limited and their main weakness was not in deliberate underdevelopment but in what it failed to do. Niall Ferguson agrees with his last point, arguing that colonialism's main weaknesses were sins of omission. Marxist historian Bill Warren has argued that whilst colonialism may be bad because it relies on force, he views it as being the genesis of Third World development.\nHowever, history records few cases where two or more peoples have met and mingled without generating some sort of friction. The clearest cases of \"benign\" colonialism occur where the target exploited land is minimally populated (as with Iceland in the 9th century) or completely terra nullius (such as the Falkland Islands).\nGenerative Empires\nAccording to the Marxist and Hispanicist intellectual, Gustavo Bueno, a common error in the Historiography of Imperialism would have been the tendency of historians to see all Western Colonial Empires as an homogeneous phenomena based on purely economical exploitation (mostly on Historical materialist approaches based in Leninist conception of Imperialism) or on cultural, ethnic and religious supremacy (mostly on supporters of Decoloniality's approaches) that only led to Generalization, and then to Reductionism due to such bad Apriorism. According to Bueno, Western Empires, like all Empires on Human history, were multifacetic and sometimes those could be actually beneficial to the subjugated peoples for multiple reasons (sometimes based on moral principles on \"imperial ideology\", like the practise of Consociationalism to secure a Common good, although also can be only due to purely pragmatic and amoral needs of Political stability), although he still recognise the existence of Empires that perjudicated the locals to benefit themselves (usually being intentionally caused, but also can be accidentally). In such way, and based in Dialectical materialism (as also the classical definition of Empire in Medieval philosophy instead of Lenin's one), he defines two generalities, instead of a singular generality, to categorize the Western Colonialism (and Imperialism in general) in the movement of History, based also in the distinction that Ginés de Sepúlveda proposed in his time between \"Imperios heriles\" and \"Imperios civiles\", which would be these:\n* , Legal code of the Spanish Empire to seizure the Human rights (Derecho Indiano) of the subjugated Indigenous peoples and Mestizo people, guaranting their social integration to the Western civilisation instead of their exclusion or on inferior conditions to the Europpeans.]]Generative Empires: Empires that actually were \"Generator of Civilisations\" for having social structures that, without avoiding unavoidable operations of colonialist exploitation, determine the social, economic, cultural and political development of colonized societies, making possible their transformation into fully-fledged political societies. In these category he classificate the Spanish Empire (considered the epitome of this beneficial type of Imperialism in Modern era due to the organic developing of the Hispanidad and Laws of the Indies that has been beneficial to Indigenous peoples to match the development of the Old World), Portuguese Empire, Macedonian empire, Roman Empire, Persian empires (specially Achemenid Persia with Cyrus the Great as the epitome of this type of Imperialism on Classical Age), Soviet Union, United States, etc.\n* Depredative Empires: Empires that actually \"Depredate Civilisations\" for having social structures that tend to keep colonized societies coordinated in relations of exploitation in the use of their economic or social resources such that they prevent the political development of these societies, keeping them in a state of underdevelopment and, in the worst case, destroying them as such. In these category he classificate the British Empire (considered the epitome of these type of Imperialism in Modern era, due to intentionally aspiring to destroy \"uncivilised societies\" like the Redskin on North America, or to prevent the full development of colonizated so as not to lose economic supremacy, like the British East India Company), Dutch Empire, Nazi Germany, Achemenid Persia (specifically with Darius the Great), etc.\nDespite of this classification, Bueno also argues that some Western Empires can alternate between being Generative to then be Depredative, and viceversa, caused due to a \"Natural Dialect\" of the primacy of the Material necessities (like Geopolitical economy) instead of the Ideological basis (like Ethics). Using for example the American Imperialism or Soviet Imperialism during Cold War, in which, according to him, sometimes those De facto Empires beneficiated dominated societies by both promoting national liberation movements, alike guaranting human rights and democracy (so being Generative Empire), but still maintaining predatory practices to secure Domination (so being Depredative Empire). He argues that only rare cases has maintained a consistency of being mostly Generative (like Spanish Empire) or mostly Depredative (like British Empire), which he considers is related to the Modernization theory in which the Western Colonial Empires that were more based on Mercantilism, Secularism, Modern state, Enlightened absolutism (during Classical imperialism), Legal positivism and Capitalist economies, or post-capitalist in the case of Soviet Union (during New Imperialism and Current Neocolonialism) has a tendency to be Depredative, while the Empires based on Medieval Corporatism, Confessionalism, Composite state, Traditional Monarchy, Iusnaturalism and Feudal economies has a tendency to be Generative (but at the cost to be less effective on their economics and being behind in rationalization of their institutions, and so, against the \"Dialectical logic of history\"). This also would explain why Protestant Societies through their work ethic were more progressivist than Catholic societies (and so why their Colonial Empires were host of Industrial Revolution and dominated the First globalization, which also caused the Historiographical error to see all Empires according to the \"Anglo-Dutch depredative standard\" while mocking the Iberian generative but retrograde model through the Black legend) and also explaining the Decline of Spain caused by its isolation from the Political modernization, and brought to Spanish Americans as a non-intended but necessary accidental colonial legacy.\nThis last conclusion of Iberian Imperialism being generative \"at the cost to be retrograde\" has been criticised by Traditionalist Hispanicist that blamed Bueno of being biased by Marxist Historical determinism and Hegelian historicism that is \"modernist fundamentalism\" (considering it a legacy of the Whig history and Positivist-Rationalist historiography), considering instead that the Decline of Spain (and Catholic Christendoom) in the late Ancien régime was due to the application of such Modernization theories instead of their resistance from Catholic Empires, causing alienation to the commoners (from both the Metropoli and the Oversea Domains) due to attack their Local Institutions and Forms of Life (like the Fueros on Spaniards, and Usos y costumbres in Spanish Americans) to empower the Bourgeoisie class by allying themselves with the oligarchic Landowners (not the Commoners) in a Centralisated and Homogenizated modern state, after Bourbon Reforms and Cortes of Cádiz reforms (both based in Enlightenment philosophy), that resulted in an Empire that was less effective to supply or even to understand the economical necessities of Heterogeneous peoples with Heterogeneous necessities, so causing the Spanish American wars of independence (and also Carlist Wars) as a Reactionary series of popular protests that were usurped by Spanish Liberals and Creole nationalist to consolidate a Bourgeoisie democracy without any actual Economical Progress, and also sharing Bourgeioisie the power with Feudal Landowners until Dictatorship of Primo de Rivera on Spain, while in Spanish America never consolidating the Bourgeioisie due to still existing a \"Criollo Oligarchy\" inherited from such alliances with Feudal Landowners (not caused by a Retrograde colonial legacy, but as a Modernist development that wasn't possible to exist, in the way they are consolidated on Modern Republics of Latin America, on the Pre-Revolution corporative social structures of the Traditional Monarchy that were defended by Royalists in the spirit of Laws of the Indies' protection to the serfs, a similar goal to the populist Vendean counter-revolutionaries against the French Revolution). Similar criticism, although without supporting the Royalist American or Carlist Spaniard reactionary causes, has been done by Left-wing Hispanicists who considers the Spanish American Wars of Independence as flawed Civil Wars that have been very romantized by Anti-Colonialist and Liberal historiography, but not being actually authentic National and Progressive Revolutions to stablish authentic Capitalism and Constitutionalism (being an \"accident of history\" that coincided with the Age of Revolution, giving them an aesthetical appearance of progressivist, when in reality were actually Criollo elitist political projects, while the Spanish Empire tried to adecuate the colonizated peoples to the Political modernization through the Cadiz Constitution).\nSee also\nReferences\nFurther reading\n* Albertini, Rudolf von. European Colonial Rule, 1880–1940: The Impact of the West on India, Southeast Asia, and Africa (1982) 581pp\n* Betts, Raymond F. The False Dawn: European Imperialism in the Nineteenth Century (1975)\n* Betts, Raymond F. Uncertain Dimensions: Western Overseas Empires in the Twentieth Century (1985)\n* Black, Jeremy.  European International Relations, 1648–1815 (2002) [https://www.amazon.com/European-International-Relations-1648–1815-ebook/dp/B00F3ZIYVE/  excerpt and text search]\n* Burbank, Jane, and Frederick Cooper. Empires in World History: Power and the Politics of Difference (2011), Very wide-ranging coverage from Rome to the 1980s; 511pp\n* Cotterell, Arthur. Western Power in Asia: Its Slow Rise and Swift Fall, 1415–1999 (2009) popular history; [https://www.amazon.com/Western-Power-Asia-Slow-Swift/dp/0470824891/  excerpt]\n* Dodge, Ernest S. Islands and Empires: Western Impact on the Pacific and East Asia (1976)\n* Furber, Holden. Rival Empires of Trade in the Orient, 1600–1800 (1976)\n* Furber, Holden, and Boyd C Shafer. Rival Empires of Trade in the Orient, 1600–1800 (1976)\n* Hodge, Carl Cavanagh, ed. Encyclopedia of the Age of Imperialism, 1800–1914 (2 vol. 2007), Focus on European leaders\n* Langer, William. An Encyclopedia of World History (5th ed. 1973), very detailed outline; 6th edition ed. by Peter Stearns (2001) has more detail on Third World\n* McAlister, Lyle N. Spain and Portugal in the New World, 1492–1700 (1984)\n* Ness, Immanuel and Zak Cope, eds. The Palgrave Encyclopedia of Imperialism and Anti-Imperialism (2 vol 2015), 1456pp\n* Osterhammel, Jürgen: Colonialism: A Theoretical Overview, Princeton, NJ: M. Wiener, 1997.\n* Page, Melvin E. ed. Colonialism: An International Social, Cultural, and Political Encyclopedia (3 vol. 2003); vol. 3 consists of primary documents; vol. 2 pages 647–831 has a detailed chronology\n* Porter, Andrew. European Imperialism, 1860–1914 (1996), Brief survey focuses on historiography\n* Roberts, Stephen H. History of French Colonial Policy (1870–1925) (2 vol 1929) [https://archive.org/details/in.ernet.dli.2015.84402 vol 1 online] also [https://archive.org/details/in.ernet.dli.2015.89866 vol 2 online]; comprehensive scholarly history\n* Savelle, Max. Empires to Nations: Expansion in America, 1713–1824 (1975)\n* Smith, Tony. The Pattern of Imperialism: The United States, Great Britain and the Late-Industrializing World Since 1815 (1981)\n* Townsend, Mary Evelyn. European colonial expansion since 1871 (1941).\n* Wilson, Henry. The Imperial Experience in Sub-Saharan Africa since 1870 (1977)"
    }
  ]
}