{
  "content": [
    {
      "type": "text",
      "text": "# Anand Tiwari\n\n| birth_place = Bombay, Maharashtra, India\n| spouse     =\n| occupation =\n| yearsactive = 2008–present\n}}\nAnand Tiwari (born 29 May 1983) is an Indian actor, producer, writer, lyricist and director known for his work in Hindi films. He has appeared in films like Kites (2010), Udaan (2010), Aisha (2010), and Go Goa Gone (2013). As a stage actor, he is best known for Rage Productions' One on One (2010).\nTiwari is the co-founder of the production company Still and Still Media Collective under which he has produced his feature-length directorial debut Love per Square Foot (2018) and his hit series Bandish Bandits. For the latter, he was nominated for a Filmfare OTT Awards for Best Original Story.\nEarly and personal life\nTiwari grew up in a family of doctors, in Matunga, Mumbai. He started acting in small roles in Marathi theatre in the local Ganpati and Navratri festivals. He frequented Shivaji Mandir in Dadar to watch plays, and also started attending summer acting workshops at his school. Subsequently, he completed his bachelor's in mass media, with a major in advertising, from the University of Mumbai in 2004.\nin 2025]]\nTiwari married actress Angira Dhar in an intimate wedding ceremony on 30 April 2021.\nCareer\nActing career\nTiwari started his career in 2008 by acting in television commercials for brands like Citibank, Jet Airways, Tanishq, Tata ACE and DISH TV. He then transitioned into theatre in Mumbai, working in plays like Dreams of Taleem directed by Sunil Shanbag and Rage Theatre's One On One (2010).\nTiwari made his acting debut in Bollywood by playing small roles in several films including Slumdog Millionaire (2008), The President Is Coming (2009), Udaan (2010) and Kites (2010). He then appeared in supporting roles in the ensemble romantic comedy-drama Aisha (2010) directed by Rajshree Ojha and Go Goa Gone (2013), a zombie action comedy film directed by Raj and D.K. He has also appeared in the Hollywood film Fair Game (2010), which starred Naomi Watts and was an official entry at the Cannes Film Festival.\nDirecting career\nTiwari worked as assistant director for Anurag Basu's film Barfi! (2012) He has also worked as assistant co-ordinator and director  with Cogito TV and Cyclops Films and Video.\nTiwari made his directorial debut with the 2018 film Love Per Square Foot. Produced by Ronnie Screwvala, under his newly established banner RSVP Movies; the film stars Vicky Kaushal and Angira Dhar in the lead roles. Tiwari who wrote the script in 2010, along with Sumeet Vyas, was originally set to make into a dark film but later decided to turn it into a romantic comedy. Originally scheduled for a theatrical release, Anand Tiwari eventually sent the film's final cut to the executives of Netflix India, who approved to release the film online. Thus it became the first Indian film to be released directly on a streaming platform. The film was screened at the Beijing International Film Festival, held in China in April 2019.\nIn 2020, Tiwari created, produced and directed the web series Bandish Bandits along with Amritpal Singh Bindra. The series feature debutants Ritwik Bhowmik as Radhe Rathod, a Hindustani Classical musician and Shreya Chaudhary as Tamanna Sharma, a pop singer, who hail from different worlds of music. Exploring the debate of music being a discipline versus a means of liberation. Bandish Bandits released on 4 August 2020, through Amazon Prime Video. It received positive response from critics and audiences, praising the performances of the cast, writing and direction, songs and background score. It was listed by critics as one of the best Indian television shows of 2020. The series was nominated for seven Filmfare OTT Awards including Best Original Story for Tiwari.\nTiwari is also filming for his second collaboration with Kaushal on Bad Newz featuring Tripti Dimri which he will also produce.\nFilmography\nAs actor\n{| class=\"wikitable sortable\"\n!Year\n!Film\n!Role\n!Notes\n|-\n| rowspan=\"3\" | 2008\n| R(evolution) || Feroz\n|\n|-\n| Mumbai Meri Jaan || Drug Addict Boy\n|\n|-\n| Slumdog Millionaire || Newsreader\n|\n|-\n| 2009\n| The President Is Coming || Kapil Dev Dholakia\n|\n|-\n| rowspan=\"5\" | 2010\n| Udaan || Mishter Apu\n|\n|-\n| Fair Game || Hafiz\n|\n|-\n| Kites || Robin\n|\n|-\n| Aisha || Saurabh Lamba\n|\n|-\n| The Film Emotional Atyachar || Hiten Sardesai\n|\n|-\n| 2011\n| ''Jo Dooba So Paar: It's Love in Bihar! || Kishu\n|\n|-\n| 2012\n| Go Goa Gone || Bunny\n|\n|-\n| 2013\n| What the Fish|| Neerav\n|\n|-\n| rowspan=\"3\" | 2014\n| Dishkiyaoon || Rocky\n|\n|-\n| Finding Fanny || Father Francis\n| English film\n|-\n| Charlie Kay Chakkar Mein || Dips\n|\n|-\n| 2015\n| Detective Byomkesh Bakshy! || Ajit Banerjee\n|\n|-\n| 2020\n| Chhapaak || Bajaj Husband\n|\n|-\n| 2021\n| Nail Polish || Amit Kumar\n|ZEE5 Originals film\n|-\n| 2024\n| Ae Watan Mere Watan || Firdaus Engineer\n|\n|}\nAs director\n{| class=\"wikitable sortable\"\n!Year\n!Film\n!Notes\n|-\n| 2012\n| Neighbours || Short film\n|-\n| 2013\n| Haircut || Short film\n|-\n| 2018\n| Love per Square Foot || Netflix film\n|-\n| 2022\n| Maja Ma || Amazon Prime Video film\n|-\n| 2024\n| Bad Newz ||\n|-\n|}\nTelevision\n{| class=\"wikitable sortable\"\n|-\n! Year\n! Film\n! Actor\n! Director\n! Producer\n! Writer\n! Notes\n|-\n| rowspan=\"2\"|2015\n| Bang Baaja Baarat\n|\n|\n|\n|\n| Web series\n|-\n| Sumit Sambhal Lega\n|\n|\n|\n|\n|Sitcom television series\n|-\n| 2016\n| Sex Chat with Pappu & Papa\n|\n|\n|\n|\n| Web series\n|-\n| 2018\n| Gabru: Hip Hop Ke Shehzaade\n|\n|\n|\n|\n|\n|-\n| 2020\n| Bandish Bandits''\n|\n|\n|\n|\n| Web series\n|}\nReferences\nExternal links\n*\n*"
    }
  ]
}