{
  "content": [
    {
      "type": "text",
      "text": "# Anchorena Presidential Estate\n\n| image            = Estanciaanchorena.jpg\n| inauguration_date = 1911\n}}\nThe Aarón de Anchorena National Park is a park and rest residence of the President of Uruguay. It is located in the Colonia Department, in southwestern Uruguay, 208 kilometers from Montevideo. It was donated by the Argentine farmer Aarón de Anchorena to the Uruguayan state.\nAnchorena Park is the result of the legacy of the Argentine aristocrat Aarón de Anchorena who gave about 1,369 hectares of his stay from the Barra del Río San Juan to the Uruguayan state, with the specific purpose of being dedicated to a park for conservation, tourism and educational \"for the welfare and comfort of the population\" and for rest residence for Uruguayan presidents.\nHistory\nThe origin of the park dates back to 1907 when Anchorena, in the company of his friend Jorge Newbery, flew over the Río de la Plata in a hot air balloon called \"El Pampero\", the first to fly. Anchorena was amazed and wanted to buy land in the north of the department, but since they were not available for sale, his mother bought him 11,000 hectares in the area of the mouth of the San Juan River, which Anchorena had seen from the globe. Anchorena entrusted the park design to the German landscaper Hermann Bötrich. Anchorena's first house remains intact: it is made of material with a zinc roof, the typical Creole country house with row windows, reaching the floor, under the eaves that run its entire length.\nAnchorena's will bequeathed the park to the Uruguayan State, with the conditions that his body was buried at the site and that it be a public park. He died in 1965 and conserved 4,700 hectares, of which 1,370 became state-administered. In his legacy he demanded that the ranch function as a park for educational purposes and environmental preservation.\nIn 1927 the \"Anchorena Tower\", which measures 75 meters, was inaugurated, in tribute to the explorer Sebastián Cabot. At its base, Anchorena ordered the construction of a tomb where his remains lie, as he stated in his will.\nAmong more than 200 tree and shrub species -from all corners of the planet- they stand out for the remarkable development of their specimens, various species of oak, cork, araucaria, bald cypress, Japanese maples and more than 60 species of eucalyptus, which they are part of one of the most important collections in the country. In addition, native and exotic species coexist in the park. Among the first, birds stand out, represented by more than 75 species. Among the exotic species, the Chital, originally from India, that Anchorena introduced in our country in the 1920s is especially attractive. The Axis, considered the most beautiful of the cervids in the world, abounds in the Park.\nResidence\nThe former residence of Aarón de Anchorena located on his farm in Barra del Río San Juan is currently a resting residence for Uruguayan presidents. The mansion, built in 1911, combines the Norman and Tudor styles.\nThe first president to use the residence was Jorge Pacheco Areco. Since then, Uruguayan presidents have met there with different leaders, such as George Bush, Felipe González, Cristina Fernández de Kirchner, Mauricio Macri, Anne, Princess Royal, and Alberto Fernández.\nFile:Lulatabaré26022007.jpg|Tabaré Vázquez with Brazilian President Luiz Inácio Lula da Silva, February 2007\nFile:Bushes vazquezs.jpg|President Tabaré Vázquez and First Lady María Auxiliadora Delgado with the President of the United States George Bush and First Lady Laura Bush at the main entrance, March 2007\nFile:Cristina Fernandez con Jose Mujica.jpg|President José Mujica with Argentine President Cristina Fernández de Kircher in the gardens of the residence, June 2010.\nFile:Visita de Macri a Tabaré Vázquez 02.jpg|Tabaré Vázquez with Argentine President Mauricio Macri, January 2016\nAirport\nReferences"
    }
  ]
}