{
  "content": [
    {
      "type": "text",
      "text": "# Ancient Mesopotamian units of measurement__disambig_1\n\nAncient Mesopotamian units of measurement originated in the loosely organized city-states of Early Dynastic Sumer.  Each city, kingdom and trade guild had its own standards until the formation of the Akkadian Empire when Sargon of Akkad issued a common standard.  This standard was improved by Naram-Sin, but fell into disuse after the Akkadian Empire dissolved.  The standard of Naram-Sin was readopted in the Ur III period by the Nanše Hymn which reduced a plethora of multiple standards to a few agreed-upon common groupings.  Successors to Sumerian civilization including the Babylonians, Assyrians, and Persians continued to use these groupings.  Akkado-Sumerian metrology has been reconstructed by applying statistical methods to compare Sumerian architecture, architectural plans, and issued official standards such as Statue B of Gudea and the bronze cubit of Nippur.\nArchaic system\ncarved diorite]]\nThe systems that would later become the classical standard for Mesopotamia were developed in parallel with writing in Sumer during Late Uruk Period (c. 3500–3000).  Studies of protocuneiform indicate twelve separate counting systems used in Uruk IV-III.  Seven of these were also used in the contemporary Proto-Elamite writing system. The bisexagesimal systems went out of use after the Early Dynastic I/II period.\n* Sexagesimal System S used to count slaves, animals, fish, wooden objects, stone objects, containers.\n* Sexagesimal System S' used to count dead animals, certain types of beer\n* Bisexagesimal System B used to count cereal, bread, fish, milk products\n* Bisexagesimal System B* used to count rations\n* GAN2 System G used to count field measurement\n* ŠE system Š used to count barley by volume\n* ŠE system Š' used to count malt by volume\n* ŠE system Š\" used to count wheat by volume\n* ŠE System Š* used to count barley groats\n* EN System E used to count weight\n* U4 System U used to count calendrics\n* DUGb System Db used to count milk by volume\n* DUGc System Db used to count beer by volume\nIn Early Dynastic Sumer (–2300 BCE) metrology and mathematics were indistinguishable and treated as a single scribal discipline.  The idea of an abstract number did not yet exist, thus all quantities were written as metrological symbols and never as numerals followed by a unit symbol.  For example there was a symbol for one-sheep and another for one-day but no symbol for one.  About 600 of these metrological symbols exist, for this reason archaic Sumerian metrology is complex and not fully understood.  In general however, length, volume, and mass are derived from a theoretical standard cube, called 'gur (also spelled kor in some literature)', filled with barley, wheat, water, or oil.  However, because of the different specific gravities of these substances combined with dual numerical bases (sexagesimal or decimal), multiple sizes of the gur-cube were used without consensus.  The different gur-cubes are related by proportion, based on the water gur-cube, according to four basic coefficients and their cubic roots.  These coefficients are given as:\n*Komma =   correction when planning rations with a 360-day year\n*Leimma =   conversion from decimal to a sexagesimal number system\n*Diesis =\n*Euboic =\nOne official government standard of measurement of the archaic system was the Cubit of Nippur (2650 BCE).  It is a Euboic Mana + 1 Diesis (432 grams).  This standard is the main reference used by archaeologists to reconstruct the system.\nClassical system\nA major improvement came in 2150 BCE during the Akkadian Empire under the reign of Naram-Sin when the competing systems were unified by a single official standard, the royal gur-cube.  His reform is considered the first standardized system of measure in Mesopotamia.  The royal gur-cube (Cuneiform: LU2.GAL.GUR, ; Akkadian: šarru kurru) was a theoretical cuboid of water approximately 6&nbsp;m × 6&nbsp;m × 0.5&nbsp;m from which all other units could be derived.  The Neo-Sumerians continued use of the royal gur-cube as indicated by the Letter of Nanse issued in 2000 BCE by Gudea.  Use of the same standard continued through the Neo-Babylonian Empire, Neo-Assyrian Empire, and Achaemenid Empire.\nLength\nUnits of length are prefixed by the logogram DU () a convention of the archaic period counting system from which it was evolved.  Basic length was used in architecture and field division.\n{| class=\"wikitable\"\n!colspan=\"7\"| Basic Length\n|-\n!Unit ||Ratio ||Sumerian ||Akkadian ||Cuneiform\n|-\n| grain || ||še ||uţţatu ||\n|-\n| finger ||   ||šu-si ||ubānu||\n|-\n| foot ||  ||šu-du3-a ||šīzu ||\n|-\n| cubit || 1 ||kuš3 ||ammatu ||\n|-\n| step ||2 ||ĝiri3 ||šēpu ||\n|-\n| reed ||6 ||gi ||qanû ||\n|-\n| rod ||12 ||nindan ||nindanu ||\n|-\n| cord ||120 ||eše2 ||aslu ||\n|}\nThe step is equal to the length of a pendulum which completes half of its period in 1 second: 993.7 millimetres.\nDistance units were geodectic as distinguished from non-geodectic basic length units.  Sumerian geodesy divided latitude into seven zones between equator and pole.\n{| class=\"wikitable\"\n!colspan=\"7\"| Distance\n|-\n!Unit ||Ratio ||Sumerian ||Akkadian ||Cuneiform\n|-\n| rod || ||nidan ||nindanu ||\n|-\n| cord || ||eše2 ||aslu ||\n|-\n| cable ||1 ||uš ||uš ||\n|-\n| league ||30 ||da-na ||bêru ||\n|}\nThe cable is approximately equal to 357.8 metres or 360 steps.\nArea\nThe GAN2 system G counting system evolved into area measurements.  A special unit measuring brick quantity by area was called the brick-garden (Cuneiform: SIG.SAR ; Sumerian: šeg12-sar; Akkadian: libittu-mūšaru) which held 720 bricks.\n{| class=\"wikitable\"\n!colspan=\"7\"| Basic Area\n|-\n!Unit ||Ratio ||Dimensions ||Sumerian ||Akkadian ||Cuneiform\n|-\n| shekel || ||1&nbsp;kuš3 × 1&nbsp;kuš3 ||gin2 ||šiqlu ||\n|-\n| garden ||1 ||12&nbsp;kuš3 × 12&nbsp;kuš3 ||sar ||mūšaru ||\n|-\n| quarter-field ||25 ||60&nbsp;kuš3 × 60&nbsp;kuš3 ||uzalak ||? ||\n|-\n| half-field ||50 ||120&nbsp;kuš3 × 60&nbsp;kuš3 ||upu ||ubû ||\n|-\n| field ||100 ||120&nbsp;kuš3 × 120&nbsp;kuš3 ||iku ||ikû ||\n|-\n| estate ||1800 || ||bur ||būru ||\n|\n|}\nThe garden is equal to approximately 36 square metres.\nCapacity or volume\nCapacity was measured by either the ŠE system Š for dry capacity or the ŠE system Š* for wet capacity.\n{| class=\"wikitable\"\n!colspan=\"7\"| Basic Volume\n|-\n!Unit ||Ratio ||Sumerian ||Akkadian ||Cuneiform\n|-\n| shekel || ||gin2 ||šiqlu ||\n|-\n| bowl ||1 ||sila3 ||qû ||\n|-\n| vessel ||10 ||ban2 ||sutū ||\n|-\n| bushel ||60 ||ba-ri2-ga (barig) ||parsiktu ||\n|-\n| gur-cube ||300 ||gur ||kurru ||\n|}\nA sila was about 1 liter.\nMass or weight\nMass was measured by the EN system E\nValues below are an average of weight artifacts from Ur and Nippur.  The ± value represents 1 standard deviation.  All values have been rounded to second digit of the standard deviation.\n{| class=\"wikitable\"\n!colspan=\"7\"| Basic Mass\n|-\n!Unit ||Ratio ||Mean Value ||Sumerian ||Akkadian ||Cuneiform\n|-\n| grain || ||46.6±1.9&nbsp;mg ||še || uţţatu ||\n|-\n| shekel ||1 ||8.40±0.34&nbsp;g ||gin2 ||šiqlu ||\n|-\n| mina ||60 ||504±20&nbsp;g ||ma-na ||manû||\n|-\n| talent ||3,600 ||30.2±1.2&nbsp;kg ||gun2 ||biltu or kakaru ||\n|}\nTime\nIn the Archaic System time notation was written in the U4 System U.  Multiple lunisolar calendars existed; however the civil calendar from the holy city of Nippur (Ur III period) was adopted by Babylon as their civil calendar.  The calendar of Nippur dates to 3500 BCE and was itself based on older astronomical knowledge of an uncertain origin.  The main astronomical cycles used to construct the calendar were the month, year, and day.\n{| class=\"wikitable\"\n!colspan=\"7\"| Basic Time\n|-\n!Unit ||Ratio ||Sumerian ||Akkadian ||Cuneiform\n|-\n| gesh || ||mu-eš || geš ||\n|-\n| watch || ||da-na ||bêru ||\n|-\n| day ||1 ||ud ||immu||\n|-\n| month ||30 ||itud ||arhu ||\n|-\n| year ||360 ||mu ||šattu ||\n|}\nRelationship to other metrologies\nThe Classical Mesopotamian system formed the basis for Elamite, Hebrew, Urartian, Hurrian, Hittite, Ugaritic, Phoenician, Babylonian, Assyrian, Persian, Arabic, and Islamic metrologies.  The Classical Mesopotamian System also has a proportional relationship, by virtue of standardized commerce, to Bronze Age Harappan and Egyptian metrologies.\nSee also\n* Assyrian lion weights\n* Babylonian mathematics\n*Historical weights and measures\n*Weights and measures\nReferences\nCitations\nBibliography\n*\n*\n*\n*\n*\nFurther reading\n*\n*\n*\n*\nExternal links\n*An online calculator [http://it.stlawu.edu/~dmelvill/mesomath/calculator/lengthh.html]\n*\n*\n*"
    }
  ]
}