{
  "content": [
    {
      "type": "text",
      "text": "# Ancient woodland__disambig_1\n\nisland in Scotland]]\nIn the United Kingdom, ancient woodland is that which has existed continuously since 1600 in England, Wales and Northern Ireland (or 1750 in Scotland). The practice of planting woodland was uncommon before those dates, so a wood present in 1600 is likely to have developed naturally.\nIn most ancient woods, the trees and shrubs have been felled periodically as part of the management cycle. Providing that the area has remained as woodland, the stand is still considered ancient. Since it may have been cut over many times in the past, ancient woodland does not necessarily contain trees that are particularly old.\nFor many animal and plant species, ancient woodland sites provide the sole habitat. Furthermore, for many others, the conditions prevailing on these sites are much more suitable than those on other sites. Ancient woodland in the UK, like rainforest in the tropics, serves as a refuge for rare and endangered species. Consequently, ancient woodlands are frequently described as an irreplaceable resource, or 'critical natural capital'. The analogous term used in the United States, Canada and Australia (for woodlands that do contain very old trees) is \"old-growth forest\".\nAncient woodland is formally defined on maps by Natural England and equivalent bodies. Mapping of ancient woodland has been undertaken in different ways and at different times, resulting in a variable quality and availability of data across regions, although there are some efforts to standardise and update it.\nProtection\nA variety of indirect legal protections exist for many ancient woodlands, but it is not automatically the case that any given ancient woodland is protected. Some examples of ancient woodland are nationally or locally designated, for example as Sites of Special Scientific Interest. Others lack such designations.\nSpecial consideration is also required for Ancient woodlands when they are affected by planning applications. The National Planning Policy Framework, published in 2012, is the British government's policy document relating to planning decisions affecting ancient woodlands. The irreplaceable nature of ancient woodlands is elucidated in paragraph 118 of the NPPF, which states: ‘Planning permission should be refused for development resulting in the loss or deterioration of irreplaceable habitats, including ancient woodland and the loss of aged or veteran trees found outside ancient woodland, unless the need for, and benefits of, the development in that location clearly outweigh the loss.’\nCharacteristics\n(Ficaria verna)]]\ntrees in Wistman's Wood in Dartmoor, Devon]]\nThe concept of ancient woodland, characterised by high plant diversity and managed through traditional practices, was developed by the ecologist Oliver Rackham in his 1980 book Ancient Woodland, its History, Vegetation and Uses in England, which he wrote following his earlier research on Hayley Wood in Cambridgeshire.\nClose-up of the yellow archangel flowers\nThe definition of ancient woodland includes two sub-types: Ancient semi-natural woodland (ASNW) and Planted ancient woodland site (PAWS).\nAncient semi-natural woodland (ASNW) is composed of native tree species that have not obviously been planted. Many of these woods also exhibit features characteristic of ancient woodland, including the presence of wildlife and structures of archaeological interest.\nPlanted Ancient Woodland Sites (PAWS) are defined as ancient woodland sites where the native species have been partially or wholly replaced with non-native species, usually but not exclusively conifers. These woodlands typically exhibit a plantation structure characterised by even-aged crops of one or two species that have been planted for commercial purposes. Many of these ancient woodlands were transformed into conifer plantations as a result of felling operations conducted during wartime. While PAWS sites may not possess the same high ecological value as ASNWs, they often contain remnants of semi-natural species in areas where shading has been less intense. This allows for the gradual restoration of more semi-natural structures through gradual thinning is often possible.\nSince the ecological and historical value of ancient woodland was recognized, the restoration of PAWS  has been a priority for many woodland owners, as well as governmental and non-governmental agencies. Various grant schemes have also supported this endeavor. Some restored PAWS sites are now practically indistinguishable from ASNW sites. Although there is no formal method for reclassifying restored PAWS as ASNW, some woodland managers now use the acronym RPAWS (Restored Planted Ancient Woodland) for restored sites.\nSpecies which are particularly characteristic of ancient woodland sites are called ancient woodland indicator species, such as bluebells, ramsons, wood anemone, yellow archangel and primrose for example, representing a type of ecological indicator. Anemonoides nemorosa, the wood anemone The term is more frequently applied to desiccation-sensitive plant species, and particularly lichens and bryophytes, than to animals. This is due to the slower rate at which they colonise planted woodlands, which makes them more reliable indicators of ancient woodland sites. Sequences of pollen analysis can also serve as indicators of forest continuity.\nLists of ancient woodland indicator species among vascular plants were developed by the Nature Conservancy Council (now Natural England) for each region of England, with each list containing the hundred most reliable indicators for that region. The methodology entailed the study of plants from known woodland sites, with an analysis of their occurrence patterns to determine which species were most indicative of sites from before 1600. In England this resulted in the first national Ancient Woodland Inventory, produced in the 1980s.\nAlthough ancient woodland indicator species have been recorded in post-1600 woodlands and also in non-woodland sites such as hedgerows, it is uncommon for a site that is not ancient woodland to host a double-figure indicator species total. More recent methodologies also supplement these field observations and ecological measurements with historical data from maps and local records, which were not fully assessed in the original Nature Conservancy Council surveys.\nWattle under construction\nHistory\nAncient woods were valuable properties for their landowners, serving as a source of wood fuel, timber (estovers and loppage) and forage for pigs (pannage). In southern England, hazel was particularly important for coppicing, whereby the branches were used for wattle and daub in buildings, for example. Such old coppice stumps are easily recognised for their current overgrown state, given the waning prevalence of the practice. In such overgrown coppice stools, large boles emerge from a common stump. The term 'forest' originally encompassed more than simply woodland. It also referred to areas such as parkland, open heathland, upland fells, and any other territory situated between or outside of manorial freehold. These forests were the exclusive hunting preserve of the monarch or granted to nobility.\nThe ancient woods that were situated within forests were frequently designated as Royal Parks. These were afforded special protection against poachers and other interlopers, and subject to tolls and fines where trackways passed through them or when firewood was permitted to be collected or other licenses granted. The forest law was rigorously enforced by a hierarchy of foresters, parkers and woodwards. In English land law, it was illegal to assart any part of a royal forest. This constituted the gravest form of trespass that could be committed in a forest, being considered more egregious than mere waste. While waste involved the felling of trees, which could be replanted, assarting entailed the complete uprooting of trees within the woodland of the afforested area.\nBoundary marking\nAncient woods were well-defined, often being surrounded by a bank and ditch, which allowed them to be more easily recognised. The bank may also support a living fence of hawthorn or blackthorn to prevent livestock or deer from entering the area. Since they are attracted by young shoots on coppice stools as a food source, they must be excluded if the coppice is to regenerate. Such indicators can still be observed in many ancient woodlands, and large forests are often subdivided into woods and coppices with banks and ditches as was the case in the past. The hedges at the margins are often overgrown and may have spread laterally due to the neglect of many years.\nMany ancient woods are listed in the Domesday Book of 1086, as well as in the earlier Anglo-Saxon Chronicle. This is indicative of their significant value to early communities as a source of fuel and, moreover, as a source of food for farm animals. The boundaries are frequently described in terms of features such as large trees, streams or tracks, and even standing stones for example.\nAncient woodland inventories\nAncient woodland sites over  in size are recorded in Ancient Woodland Inventories, compiled in the 1980s and 1990s by the Nature Conservancy Council in England, Wales, and Scotland; and maintained by its successor organisations in those countries. There was no inventory in Northern Ireland until the Woodland Trust completed one in 2006.\nDestruction\nBritain's ancient woodland cover has diminished considerably over time. Since the 1930s almost half of the ancient broadleaved woodland in England and Wales have been planted with conifers or cleared for agricultural use. The remaining ancient semi-natural woodlands in Britain cover a mere , representing less than 20% of the total wooded area. More than eight out of ten ancient woodland sites in England and Wales are less than  in area. Only 617 exceed , which is a relatively small number. Forty-six of these sites exceed .\nManagement\ntree. Epping Forest, Essex, England]]\nA recently coppiced alder stool. [[Hampshire, England]]\nMost ancient woodland in the UK has been managed in some way by humans for hundreds (in some cases probably thousands) of years. Two traditional techniques are coppicing (the practice of harvesting wood by cutting trees back to ground level) and pollarding (harvesting wood at approximately human head height to prevent new shoots being eaten by grazing species such as deer). Both techniques encourage new growth while allowing the sustainable production of timber and other woodland products. During the 20th century, the use of such traditional management techniques declined, concomitant with an increase in large-scale mechanized forestry. Consequently, coppicing is now seldom practiced, and overgrown coppice stools are a common feature in many ancient woods, with their numerous trunks of similar size. These shifts in management practices have resulted in alternations to ancient woodland habitats and a loss of ancient woodland to forestry.\nExamples\n*Bedgebury Forest, Kent\n*Bernwood Forest, Buckinghamshire and Oxfordshire\n*Bradfield Woods, Suffolk\n*Bradley Woods, Wiltshire\n*Burnham Beeches, Bucks\n*Cannock Chase, Staffordshire\n*Cherry Tree Wood, London\n*Claybury Woods, London\n*Coldfall Wood, London\n*Dolmelynllyn Estate, Gwynedd\n*Dyscarr Woods, Nottinghamshire.\n*Edford Woods and Meadows, Somerset\n*Epping Forest, Essex\n*Forest of Dean West Gloucestershire\n*Foxley Wood, Norfolk\n*Grass Wood, Wharfedale, Yorkshire\n*Hatfield Forest, Essex\n*Hazleborough Wood, Northamptonshire, part of Whittlewood Forest\n*Highgate Wood, London\n*Hollington Wood, Buckinghamshire\n*Holt Heath, Dorset\n*King's Wood, Heath and Reach, Bedfordshire\n*Lower Woods, Gloucestershire\n*New Forest, Hampshire\n*Parkhurst Forest, Isle of Wight\n*Puzzlewood, in the Forest of Dean\n*Queen's Wood, London\n*Ryton Woods, Warwickshire\n*Salcey Forest, Northamptonshire\n*Savernake Forest, Wiltshire\n*Sherwood Forest, Nottinghamshire\n*Snakes Wood, Suffolk\n*Titnore Wood, West Sussex\n*Vincients Wood, Wiltshire\n*Wentwood, Monmouthshire\n*Whinfell Forest, Cumbria\n*Whittlewood Forest, Northamptonshire\n*Windsor Great Park, Berkshire\n*Wistman's Wood, Devon\n*Wormshill, Kent: Barrows Wood, Trundle Wood and High Wood\n*Wyre Forest, bordering Shropshire and Worcestershire\n*Yardley Chase, Northamptonshire\nSee also\nReferences\nExternal links\n*[https://www.webarchive.org.uk/wayback/archive/20111105235524/http://www.ancient-tree-hunt.org.uk/ancienttrees/managing/guides Ancient Tree Guides by the Woodland Trust] (archived 5 November 2011)"
    }
  ]
}