{
  "content": [
    {
      "type": "text",
      "text": "# Ancient constitution of England\n\n.]]\nThe ancient constitution of England was a 17th-century political theory about the common law, and the antiquity of the House of Commons of England, used at the time in particular to oppose the royal prerogative. It was developed initially by Sir Edward Coke, in his law reports; and has been analysed in modern times by J. G. A. Pocock in The Ancient Constitution and the Feudal Law (1st edition 1957; reissued \"with a retrospect\" 1987). Coke's apprenticed amanuensis for Star Chamber reports was Roger Williams. According to Bancroft-prize-winner Mary Sarah Bilder, this is not to be conflated with her own connected, yet distinct, notion of the \"transatlantic constitution.\"\nLegal antiquarianism\nThe self-conscious antiquarian study of the law gathered momentum from the 15th century. It supported the theories of the ancient constitution. In his Institutes of the Lawes of England Coke challenged the accepted view of the Norman Conquest by asserting it amounted to trial by battle, with William the Conqueror agreeing to maintain the Anglo-Saxon laws. The first part of the Institutes, also known as Coke on Littleton (1628) and the principal focus of \"ancient constitution\" scholarship, surveyed land tenure pasts as (what was described as) “immemorial” commentaries on the fifteenth-century jurisprudence of Thomas de Littleton. Coke traced feudum simplex enclosure practices to the persistence of Norman rites during the execution of Anglo-Saxon laws, particularly tributary “homage” as well as “knight-service\" enlistment.\nPolitical role\nIn the reign of Charles I of England, reasoning based on the \"ancient constitution\" became available as a resistance theory for those who saw the monarch as high-handed. In its theoretical aspects, this type of reasoning is now seen as loaded with politics or ideology, rather than being the antiquarian study its proponents claimed for it. Coke's style of argument was inherently conservative, based as it was on defending a legal continuity claimed to be rooted in English governance from before 1066; but it is now argued that a radical variant was developed in the English Civil War period, by Nathaniel Bacon and William Prynne in particular.\nDuring the Exclusion Crisis of the late 1670s and early 1680s, the theory of the ancient constitution was upheld by Whig writers such as William Petyt, Algernon Sidney and James Tyrrell. The Royalist writer Robert Brady criticised them in his Introduction to the Old English History (1694) and in the first volume of his History of England (1695). Following the studies of feudal history made by Henry Spelman and William Dugdale, Brady argued that William I at the Norman Conquest had completely changed English law and had introduced feudal tenures. Whereas Petyt maintained that a class of freeholders had survived from Anglo-Saxon times despite the Norman Conquest, Brady argued that during the Middle Ages the population was entirely feudal, with no freeholders.\nDuring the 1730s the ancient constitution again became the subject of debate. The Tory politician Lord Bolingbroke sought to use the traditional Whig belief in the ancient constitution to criticise the Whig government of Robert Walpole. In his Remarks on the History of England (1730–31) and A Dissertation upon Parties (1733–34) Bolingbroke asserted that the freedoms bestowed on Englishmen by the ancient constitution were undermined by Walpole's corrupt government. The Glorious Revolution of 1688 had sought to restore the ancient constitution but (Bolingbroke argued) it had been betrayed by Walpole. Bolingbroke insisted that annual parliaments, the exclusion of placemen from parliament and a militia would save the ancient constitution from Walpole's corruption.\nWalpole's supporters in the press countered Bolingbroke by claiming that the ancient constitution was a fiction: Englishmen owed their freedom to the Revolution of 1688 and to the modern Whigs. In order to undermine Bolingbroke's criticisms, they used Brady's work to maintain that Englishmen in the Middle Ages had not been free. The Whig writer Lord Hervey, in his Ancient and Modern Liberty Stated and Compared (1734), argued that until the Revolution of 1688 there was no liberty in England.\nReceiving criticism from various sources, one of which included The Freeholders Grand Inquest touching our souveraigne Lord the King and his Parliament published by an anonymous sources in 1647 that forcefully refuted its relevant arguments, the antiquity of House of Commons was gradually out of fashion. In his 1762 work History of England, David Hume drew upon Spelman, Dugdale and Brady and explained no one doubted early parliaments were composed of the king and his great barons, which reflected that modern idea of progress was replacing the doctrine of an ancient constitution.\nIn his Reflections on the Revolution in France (1790), the Whig MP Edmund Burke argued that the Revolution of 1688 was \"made to preserve our antient indisputable laws and liberties ... We wished at the period of the Revolution, and do now wish, to derive all we possess as an inheritance from our forefathers\". Burke was unusual in reverting to the ancient constitution because by the time he was writing it was usually employed by the reformist intelligentsia. Pocock argues that the doctrine of the ancient constitution may have helped Burke \"create his intense historical awareness of the common-law tradition as 'the stationary policy of this kingdom'—as a factor shaping English political thought and behaviour\".\nSee also\n* Leges Edwardi Confessoris\n* Rights of Englishmen\n* Fundamental Laws of England\n* History of the constitution of the United Kingdom\nNotes\nFurther reading\n*"
    }
  ]
}