{
  "content": [
    {
      "type": "text",
      "text": "# Ancient Dreams in a Modern Land\n\n| recorded     = 2020–2021\n| studio       =\n* Marina's home (West Hollywood, California)\n* The Pineapple Box (Los Angeles)\n* Barefoot Studios (Los Angeles)\n* WAX LTD (Los Angeles)\n* Snap Studios (London)\n| genre        =\n* Pop\n* electropop\n* dance-pop\n| length       = 36:07\n| label        =\n* Atlantic\n* Neon Gold\n* Crush\n| producer     =\n* Jennifer Decilveo\n* Marina Diamandis\n* James Flannigan\n| prev_title   = Love + Fear (Acoustic)\n| prev_year    = 2019\n| next_title   = Princess of Power\n| next_year    = 2025\n| misc         =\n}}\nAncient Dreams in a Modern Land is the fifth studio album by Welsh singer-songwriter Marina Diamandis, and her second under the mononym Marina. The album was released on 11 June 2021 through Atlantic and Neon Gold Records. She began writing music for the record in August 2019, five months after the release of her fourth studio album, Love + Fear (2019). The album was produced by Diamandis, Jennifer Decilveo and James Flannigan; the latter collaborated on her previous album. Ancient Dreams in a Modern Land is a pop, electropop, and dance-pop record that explores themes such as  feminism, global warming, misogyny, heartbreak, and racism.\nAncient Dreams in a Modern Land received generally positive reviews from music critics, many of whom compared it to her previous works. The album was preceded by four singles: \"Man's World\", \"Purge the Poison\", the title track, and \"Venus Fly Trap\", all of which accompanying a music video. It peaked at number 17 on the UK Albums Chart, while it debuted at 92 on the US Billboard 200. A deluxe edition of the album was released on 7 January 2022, which contained three new tracks and two demos of songs that appeared on the standard edition. It was preceded by the promotional single \"Happy Loner\". Marina confirmed at a concert on 23 May 2022 that Ancient Dreams in a Modern Land would be her final album under her 14-year long contract with Atlantic Records.\nBackground and production\nFollowing the release of her fourth studio album Love + Fear in 2019, Marina embarked on a multi-leg tour and released an acoustic companion extended play (EP), Love + Fear (Acoustic). She also began writing music for a fifth studio album in July 2019, and confirmed her plans via an Instagram post, in January 2020. The news was followed up by the release of the soundtrack single \"About Love\" in February, which was featured on the soundtrack to the American romantic comedy film To All the Boys: P.S. I Still Love You (2020). For the album, Marina worked with various female collaborators as she announced through her social media in 2019, looking for recommendations from her fans and friends. Some of the collaborators included director Alexandra Gavillet, photographer Coughs and producer Jennifer Decilveo.\nWriting sessions took place at Marina's home in West Hollywood, which Decilveo refer to her as \"the real deal and, in this strange pop market, it's refreshing to have somebody with lyrics that are going against the grain.\" She stated in a Q&A she made in April 2020 that she had written 70% of the record. In June 2021, she confirmed to The New York Times that she and her boyfriend Jack Patterson ended their five and a half years relationship during the pandemic. Unlike its predecessor, Ancient Dreams In a Modern Land was written solely by Marina and she co-produced five tracks. The tracks \"Man's World\" and \"Pandora's Box\" were written between late 2019 and early 2020, while the rest of the album was conceived during the COVID-19 pandemic.\nMusic and lyrics\nAncient Dreams In a Modern Land has been described as a pop, electropop, and dance-pop record. During songwriting sessions for the record, Marina was motivated by the mistreatment of women and LGBT individuals throughout history, and gathered further inspiration from the Salem witch trials. Other songs had a more personal inspiration, some of them focusing on her breakup. The album deals with themes of feminism, global warming, misogyny, heartbreak, and racism. The lyrics to the songs are wordy, and present more \"vim and attitude\" than the songs on Love + Fear. About this shift, Marina said that \"there was a certain portion of my fan base that didn't connect as much because [Love + Fear] was a much slicker, shinier record\" and their opinions impacted her decision to do a \"wild, raw record\" as its successor. Nick Levine from NME wrote that Ancient Dreams In a Modern Land \"might also be her most personal record.\"\nSongs\nThe album opens with its title track, a pop rock, disco, and electropop song with a glam rock style beat. It is backed by drums and a \"cinematic guitar riff\". Danielle Chelosky, a writer for Stereogum, compared it to Britney Spears' 2008 single \"Womanizer\". According to Tristan Kinnett from Mxdwn, the song's lyrics find Marina envisioning \"the possibility of leaving her Earthly form behind her\". She sings the refrain (\"I am not my body, not my mind or my brain / Not my thoughts or feelings, I am not my DNA\") in a high-pitched vibrato. \"Venus Fly Trap\" is a funk-influenced pop song. The chorus consists of Marina asking: \"Why be a wallflower when you can be a Venus fly trap?\" Other lyrics in the song are \"unexpectedly\" personal, particularly \"I know that money ain't important, and it don't mean you're the best / But I earned it all myself, and I'm a millionairess\", according to Levine.\nThe following track and lead single, \"Man's World\", was described as a dreamy and melodic alternative pop anthem. Backed by a piano performance from Marina, she criticises the behaviour of men towards women and minorities. Some lyrics reference former actress Marilyn Monroe or controversial subject matters, such as Hassanal Bolkiah, the current Sultan of Brunei. Marina criticises Bolkiah and name-drops the Beverly Hills Hotel, which he owns, where she references \"a sheik who killed thousands of gay men\" and concludes \"I guess that's why he bought the campest hotel in LA then\". Derrick Rossignol from Uproxx said that the song's chorus (\"Mother Nature's dying, nobody's keeping score / I don't want to live in a man's world anymore\") confirms that \"Marina put her money where her mouth is\", in regards to her decision to work with female musicians on her fifth album.\n\"Purge the Poison\", a guitar-driven pop and electropop anthem, was called \"an Earth Day anthem of sorts\" by Billboards Gab Ginsberg, due to its lyrics that speak of climate change. Marina wrote the song from the point-of-view of Mother Nature, and addresses societal expectations regarding capitalism and patriarchy. As Mother Nature, she opens the song, addressing events such as United States wars, and the consequences of the COVID-19 pandemic: \"Virus come, fires burn / Until human beings learn / From every disaster / You are not my master.\" Other lyrics in the song reference memorable popular culture events, such as Britney Spears shaving her head in 2007, and Harvey Weinstein's role in the Me Too movement. \"Highly Emotional People\" is the album's first ballad, which was compared to Sarah McLachlan's music. In it she sings about struggles for men of sharing feelings, a topic that could be part of her former relationship. \"New America\" includes an arrangement of frantic pizzicato strings, ominous choirs and a faint poltergeist special effects in the background. A song written in response to the murder of George Floyd, the track shares a similar theme with \"Purge the Poison\", criticizing various injustices underneath American history.\nThe following track \"Pandora's Box\" is a baroque pop ballad that contains cello and strings arrangement. The representation of Pandora in the track was lauded as it \"transcends the misogyny of the original myth into a symbol of power and independence in Marina's hands.\" \"I Love You but I Love Me More\" departs from the piano-led ballads with a guitar-addled rock ballad that includes a contagious chorus. Her favourite song from the record, it serves as a reminder that self-love is important after a breakup. The ninth and tenth tracks of the records are both piano ballads. \"Flowers\" was described as \"the twinkly breakup song about hanging onto someone for longer than they deserved.\" The album closes with \"Goodbye\", which serves as a theatrical ending where Marina says farewell to the \"girl that I've been\" and her former lover. She said when she was writing the song she \"was crying so hard she couldn't record the demo properly.\"\nSeveral critics made comparisons between the songs on Ancient Dreams in a Modern Land and Marina's older albums. Entertainment Weekly called \"Purge the Poison\" a \"callback\" to The Family Jewels (2010). Levine summarized the message in \"Venus Fly Trap\" as a \"tongue-in-cheek self empowerment banger\" that makes reference to her second studio album, Electra Heart (2012). Vogues Keaton Bell said the lyrics to \"Man's World\" were similar to those of \"Savages\" from her third album, Froot (2015). Furthermore, Dimitra Gurduiala from Atwood Magazine said \"Savages\" is a masterpiece of a song that Love + Fear lacked, but that \"Purge the Poison\" suggested a return to this type of era for Marina.\nRelease and promotion\nOn 14 April 2021, Marina confirmed Ancient Dreams in a Modern Land as the name of the album and revealed its complete track listing. It was made available for pre-order the same day, with an expected release date for 11 June 2021. It was released for digital download and streaming, and physically as a CD and three unique, collectible cassette tapes. She also previewed \"New America\" two weeks ahead of the album's release, sharing a snippet of its audio via her social media accounts. A deluxe version of the album was released on 7 January 2022. It failed to chart on the UK Official Albums Chart Top 100 but re-entered the Official Album Downloads Chart Top 100 at number 26 on 14 January 2022.\nSingles\nAncient Dreams in a Modern Land was preceded by the release of three singles. The lead single, \"Man's World\", premiered on 18 November 2020, two months after Marina teased a different previously unreleased song titled \"Happy Loner\". She originally intended to release \"Man's World\" in April 2020, to coincide with her performance at the Coachella Valley Music and Arts Festival, but the cancellation of the festival due to the COVID-19 pandemic prevented it. Commercially, it reached the lower rankings of the Official Charts Company's downloads and sales charts, and a top 40 chart in New Zealand. The accompanying music video was directed by Alexandra Gavillet and inspired by the neoclassical works of English painter John William Godward. Remixes of the song by Muna and Empress Of featuring Pabllo Vittar were released in January and February 2021, respectively.\n\"Purge the Poison\" was released as the album's second single on 14 April 2021, alongside the album announcement. She had previously teased the song in a May 2020 social media post, where she previewed an early demo and some of its lyrics. Its music video debuted during the same day, featuring Marina in an array of glittery and colorful outfits. To promote the single, Marina established a website titled AllMyFriendsAreWitches.com, where fans could receive news updates regarding the parent album. An alternate version of the song, featuring a new verse from Pussy Riot's Nadezhda Tolokonnikova, was released on 5 May.\nMarina teased a snippet of the album's title track on her Twitter account on 11 May 2021, before announcing that it would become the album's third single. It was released on 19 May, coinciding with news that Marina will take part in a livestreaming concert, Ancient Dreams: Live from the Desert, scheduled to be broadcast on 12–13 June 2021.\nPromotional singles\nA remix of \"I Love You but I Love Me More\" featuring Beach Bunny was released digitally on 20 October 2021. Similarly, \"Highly Emotional People\" was released on 5 November 2021, also in remixed version, by Le Sac. \"Happy Loner\", originally an unreleased song, was released by Diamandis on 3 December 2021 as a promotional single to promote the deluxe version.\nTour\nIn early 2020, Marina announced a provisional tour she unofficially referred to as Inbetweenie Tour, that would be developed in the transition period from one project to another, however, the tour was canceled after COVID-19 lockdowns began. To promote the album, she embarked on her sixth worldwide tour titled Ancient Dreams in a Modern Land Tour on 2 February 2022. A three-leg tour, it visited the United States, South America and Europe. It ended on 25 May 2022 at the Olympia Theatre in Dublin. The 18 February date for Toronto was subsequently cancelled due to the pandemic.\nCritical reception\n| MC = 77/100\n| rev1 = The Arts Desk\n| rev1score =\n| rev2 = Clash\n| rev2score = 8/10\n| rev3 = Dork\n| rev3score =\n| rev4 = Gigwise\n| rev4score =\n| rev5 = The Line of Best Fit\n| rev5score = 8/10\n| rev6 = MusicOMH\n| rev6score =\n| rev7 = NME\n| rev7score =\n| rev8 = The Observer\n| rev8score =\n| rev9 = Pitchfork\n| rev9score = 6.6/10\n| rev10 = Under the Radar\n| rev10score =\n}}\nAncient Dreams in a Modern Land received positive reviews from music critics. At Metacritic, which assigns a normalised rating out of 100 to reviews from mainstream publications, the album received a weighted average score of 77 based on 9 reviews, indicating \"generally favourable reviews\". The Arts Desks Thomas H. Green considered Ancient Dreams in a Modern Land to be Marina's best album, partly because of her newfound \"mouth[iness]\". He called it an \"outrageously enjoyable album\" and was satisfied that her recent move to Los Angeles did not result in a musical direction that he referred to as \"California smooth\". Jessica Fynn of Clash felt the album reflected Marina's desire to \"reclaim her sense of self\", in addition to her \"natural instinct for songwriting and her lion-like resilience\"; she also likened songs \"Venus Fly Trap\", \"Man's World\", and \"I Love You but I Love Me More\" for recalling her \"wildly defiant and wonderfully juvenile\" Electra Heart era. Vicky Greer, a contributor to Gigwise, praised Marina's authenticity, writing that her lyrics \"slap you in the face while you dance along\"; she noted an increased usage of political messages in the album, but ultimately considered it empowering and a contender for year's best albums.\nRed Dziri from The Line of Best Fit felt Ancient Dreams in a Modern Land consisted of two mini albums, with the first half being \"socio-politically charged\" and the second consisting of \"more tender intimate narrative[s]\". He also enjoyed her \"sense of hard-earned confidence\" and sharper \"trademark theatrical glam\", following Love + Fear. According to Dorks Abigail Firth, Marina takes herself too seriously on the album, as opposed to her direction in The Family Jewels and Electra Heart. However, she enjoyed the album's ballads (\"Highly Emotional People\" and \"Flowers\") and the references to Marina's song catalogue.\nTrack listing\nAll tracks are written solely by Marina Diamandis.\n| extra_column = Producer(s)\n| total_length = 36:07\n| title1 = Ancient Dreams in a Modern Land\n| writer1 =\n| extra1 =\n| length1 = 3:26\n| title2 = Venus Fly Trap\n| writer2 =\n| extra2 =\n| length2 = 2:38\n| title3 = Man's World\n| writer3 =\n| extra3 =\n| length3 = 3:28\n| title4 = Purge the Poison\n| writer4 =\n| extra4 =\n| length4 = 3:16\n| title5 = Highly Emotional People\n| writer5 =\n| extra5 = Flannigan\n| length5 = 3:34\n| title6 = New America\n| writer6 =\n| extra6 =\n| length6 = 3:52\n| title7 = Pandora's Box\n| writer7 =\n| extra7 =\n| length7 = 3:32\n| title8 = I Love You but I Love Me More\n| writer8 =\n| extra8 = Decilveo\n| length8 = 3:43\n| title9 = Flowers\n| writer9 =\n| extra9 = Flannigan\n| length9 = 3:54\n| title10 = Goodbye\n| writer10 =\n| extra10 = Flannigan\n| length10 = 4:42\n}}\n| extra_column = Producer(s)\n| total_length = 52:43\n| title11 = Happy Loner\n| writer11 =\n| extra11 =\n| length11 = 3:13\n| title12 = Pink Convertible\n| writer12 =\n| extra12 = Decilveo\n| length12 = 3:41\n| title13 = Free Woman\n| writer13 =\n| extra13 =\n| length13 = 3:39\n| title14 = Venus Fly Trap\n| note14 = demo version\n| writer14 =\n| extra14 = Diamandis\n| length14 = 2:36\n| title15 = Ancient Dreams in a Modern Land\n| note15 = demo version\n| writer15 =\n| extra15 = Diamandis\n| length15 = 3:24\n}}\nPersonnel\nCredits were adapted from the liner notes.\n* Marina Diamandis – vocals, piano (track 3), production (tracks 1-3, 6, 7)\nAdditional musicians\n* James Flannigan – instruments, programming (tracks 1, 5-7, 9, 10)\n* Jennifer Decilveo – drum programming, keyboards, synthesisers (tracks 4, 8)\n* Alex Reeves – drums (tracks 1, 2)\n* Sam Kauffman – drums (track 3, 4, 8)\n* Louie Diller – drums (track 5)\n* Jack Garratt – guitars, bass (track 2)\n* David Levita – guitar (track 3, 4, 8)\n* Patrick Kelly – bass (track 3, 4, 8)\n* Matt Harris – bass (track 9)\n* Paul Frith – brass (track 6)\n* Jonathan Dreyfuss – strings (track 6, 7, 10)\nProduction\n* James Flannigan – production\n* Jennifer Decilveo – production, engineering (track 3, 4, 8), additional vocal production\n* Bella Corich – production assistant (tracks 11, 13)\n* Marco Pasquariello – drum engineering (tracks 1, 2)\n* Cian Riordan – engineering (track 3)\n* Andrew Lappin – engineering (tracks 4, 8)\n* Justin Long – drum engineering (track 5)\n* Jacob Johnston – assistant engineer (track 3)\n* Nick Brumme – assistant engineer (track 3)\n* Matt Harris – vocal editing (track 3, 4, 9)\n* John O'Mahony – mixing (tracks 1, 2, 4-10)\n* Dan Gretch – mixing (track 3)\n* Greg Calbi – mastering (tracks 1, 2, 4-10)\n* Emily Lazar – mastering (track 3)\nCharts\n{| class=\"wikitable sortable plainrowheaders\" style=\"text-align:center\"\n|+ Chart performance for Ancient Dreams in a Modern Land\n! scope=\"col\"| Chart (2021-2022)\n! scope=\"col\"| Peakposition\n|-\n! scope=\"row\"| Australian Albums (ARIA)\n| 38\n|-\n|-\n|-\n|-\n! scope=\"row\"| Finnish Albums (Suomen virallinen lista)\n| 33\n|-\n|-\n|-\n|-\n! scope=\"row\"| Lithuanian Albums (AGATA)\n| 51\n|-\n! scope=\"row\"| New Zealand Albums (RMNZ)\n| 40\n|-\n|-\n|-\n|-\n! scope=\"row\"| UK Download Albums (OCC)\n| 26\n|-\n! scope=\"row\"| UK Vinyl Albums (OCC)\n| 4\n|-\n! scope=\"row\"| US Billboard 200\n| 92\n|}\nRelease history\n{| class=\"wikitable plainrowheaders\"\n|+ Release dates and formats for Ancient Dreams in a Modern Land\n! scope=\"col\"| Region\n! scope=\"col\"| Date\n! scope=\"col\"| Format(s)\n! scope=\"col\"| Edition\n! scope=\"col\"| Labels\n! scope=\"col\"|\n|-\n! scope=\"row\" rowspan=\"3\"| Various\n| 11 June 2021\n|\n| Standard\n| rowspan=\"3\"|\n| style=\"text-align:center;\"|\n|-\n| 7 January 2022\n|\n| Deluxe\n| style=\"text-align:center;\"|\n|-\n| 25 February 2022\n| LP\n| Standard\n| style=\"text-align:center;\"|\n|}\nNotes\nReferences"
    }
  ]
}