{
  "content": [
    {
      "type": "text",
      "text": "# Ancient Greek accent\n\nThe Ancient Greek accent was a melodic or pitch accent.\nIn Ancient Greek, one of the final three syllables of each word carries an accent. Each syllable contains a vowel with one or two vocalic morae, and one mora in a word is accented; the accented mora is pronounced at a higher pitch than other morae.\nThe accent cannot come more than three syllables from the end of the word. If the last syllable of a word has a long vowel, or is closed by two consonants, the accent usually cannot come on the antepenultimate syllable; but within those restrictions it is free.\nIn nouns the accent is largely unpredictable. Mostly the accent either comes as close to the beginning of the word as the rules allow, for example,   'war' (such words are said to have recessive accent), or it is placed on the last mora of the word, as in   'river' (such words are called oxytone). But in a few  words, such as   'maiden', the accent comes between these two extremes.\nIn verbs the accent is generally predictable and has a grammatical rather than a lexical function, that is, it differentiates different parts of the verb rather than distinguishing one verb from another. Finite parts of the verb usually have recessive accent, but in some tenses participles, infinitives, and imperatives are non-recessive.\nIn the classical period (5th–4th century BC) word accents were not indicated in writing, but from the 2nd century BC onwards various diacritic marks were invented, including an acute, circumflex, and grave accent, which indicated a high pitch, a falling pitch, and a low or semi-low pitch respectively. The written accents were used only sporadically at first, and did not come into common use until after 600 AD.\nThe fragments of ancient Greek music that survive, especially the two hymns inscribed on a stone in Delphi in the 2nd century BC, appear to follow the accents of the words very closely, and can be used to provide evidence for how the accent was pronounced.\nSometime between the 2nd and 4th centuries AD the distinction between acute, grave, and circumflex disappeared and all three accents came to be pronounced as a stress accent, generally heard on the same syllable as the pitch accent in ancient Greek.\nTypes of accent\nThe ancient Greek grammarians indicated the word-accent with three diacritic signs: the acute (ά), the circumflex (ᾶ), and the grave (ὰ). The acute was the most commonly used of these; it could be found on any of the last three syllables of a word.  Some examples are:\n*  'man, person'\n*  'citizen'\n*  'good'\nThe circumflex, which represented a falling tone, is found only on long vowels and diphthongs, and only on the last two syllables of the word:\n*  'body'\n*  'earth'\nWhen a circumflex appears on the final syllable of a polysyllabic word, it usually represents a contracted vowel:\n*  'I do' (contracted form of  )\nThe grave is found, as an alternative to an acute, only on the last syllable of a word.\nWhen a word such as   'good' with final accent is followed by a pause (that is, whenever it comes at the end of a clause, sentence, or line of verse), or by an enclitic word such as the weak form of   'is' (see below), the accent is written as an acute:\n*  '[a] good man'\n*  '[he] is [a] good man'\nHowever, when the word does not come before a pause or an enclitic, the acute accent is replaced by a grave:\n*  'a good person'\nIt is generally assumed that when a word was written with a grave it indicates that there was no rise in pitch, or only a small one.\nTerminology\nIn all there are five different possibilities for placing an accent. The terms used by the ancient Greek grammarians were:\n*Oxytone (): acute on the final syllable (e.g.  'father')\n*Paroxytone (): acute on the penultimate (e.g.  'mother')\n*Proparoxytone (): acute on the antepenultimate (e.g.  'person')\n*Perispomenon (): circumflex on the final (e.g.  'I see')\n*Properispomenon (): circumflex on the penultimate (e.g.  'body')\nThe word barytone () refers to any word which has no accent (either acute or circumflex) on the final syllable, that is the 2nd, 3rd and 5th possibilities above.\nPlacing the accent marks\nIn Greek, if an accent mark is written on a diphthong or vowel written with a digraph such as , it is always written above the second vowel of the diphthong, not the first, for example:\n*  'for the sailors'\n*  'one'\nWhen a word such as a proper name starts with a capital vowel letter, the accent and breathing are usually written before the letter. If a name starts with a diphthong, the accent is written above the second letter. But in   'Hades', where the diphthong is the equivalent of an alpha with iota subscript (i.e. ), it is written in front:\n*  'Hera'\n*  'Ajax'\n*  'Hades'\nWhen combined with a rough or smooth breathing, the circumflex goes on top of the breathing, while the acute or grave is written to the right of the breathing, as in the above examples. When an accent is combined with a diaeresis mark, as in  , the accent is written on top.\nTonal minimal pairs\nWhether the accent on a particular syllable is an acute or circumflex is largely predictable, but there are a few examples where a change from an acute on a long vowel to a circumflex indicates a different meaning, for example\n*  'he might free' –   'to free'\n*  'at home' –   'houses'\n*  'man' (poetic) –   'light'\nThere are also examples where the meaning changes if the accent moves to a different syllable:\n*  'I remain' –   'I will remain'\n*  'I persuade' –   'persuasion'\n*  'make!' (middle imperative) –   'he might make' –   'to make'\n*  'ten thousand' –   'countless'\n*  'law' –   'place of pasturage'\n*  'Athenaeus' (proper name) –   'Athenian'\nThere is also a distinction between unaccented (or grave-accented) and fully accented forms in words such as:\n*  'someone' –   'who?'\n*  'somewhere' / 'I suppose' –   'where?'\n*  'or' / 'than' –   'in truth' / 'I was' / 'he said'\n*  'but' –   'others (neuter)'\n*  'it is' –   'there is' / 'it exists' / 'it is possible'\nHistory of the accent in Greek writing\nThe three marks used to indicate accent in ancient Greek, the acute (´), circumflex (῀), and grave (`) are said to have been invented by the scholar Aristophanes of Byzantium, who was head of the famous library of Alexandria in Egypt in the early 2nd century BC. The first papyri with accent marks date from this time also. In the papyri, at first the accents were used only sporadically, specifically for helping readers to pronounce Greek poetry correctly, and the grave accent could be used on any non-accented syllable. Such accents were useful, since Greek at that time was written without gaps between the words. For example, in one papyrus, the word   'to brass' is written with grave accents on the first two syllables, in case any reader should mistakenly read the first part of the word as   'to a mountain'.\nIn subsequent centuries many other grammarians wrote about Greek accentuation. The most famous of these, Aelius Herodianus or Herodian, who lived and taught in Rome in the 2nd century AD, wrote a long treatise in twenty books, 19 of which were devoted to accentuation. Although Herodian's book does not survive in full, an epitome (abridgement) was made of it around AD 400 which still survives. Another important authority was Apollonius Dyscolus, the father of Herodian.\nThe names of these diacritics in English, and the term \"accent\", are based on Latin loan-translations of the Greek terms. Latin ' corresponds to Greek   \"song sung to instrumental music, pitch variation in voice\" (the word from which English prosody comes), ' to   \"sharp\" or \"high-pitched\", ' to   \"heavy\" or \"low-pitched\", and ' to   \"pulled around\" or \"bent\". The Greek terms for the diacritics are nominalized feminine adjectives that originally modified the feminine noun  and agreed with it in gender.\nDiacritic signs were not used in the classical period (5th–4th century BC). They were gradually introduced from the 2nd century BC onwards, but did not become commonly used in manuscripts until after 600 AD.\nOrigin of the accent\nThe ancient Greek accent, at least in nouns, appears to have been inherited to a large extent from the original parent language from which Greek and many other European and Indian languages derive, Proto-Indo-European. This can be seen by comparing the accent of Greek words with the accent of words in the Vedic hymns (the most ancient form of the Sanskrit language of India). Very often these are the same, for example:\n*Vedic , Ancient Greek  'foot' (nominative)\n*Vedic , Ancient Greek  'foot' (accusative)\n*Vedic , Ancient Greek  'of a foot' (genitive)\n*Vedic , Ancient Greek  'for a foot' (dative)\nThere are also other accentual correspondences between Greek and Vedic, for example:\n*Vedic , Ancient Greek   'yoke'\n*Vedic , Ancient Greek   'horse'\n*Vedic , Ancient Greek   'a hundred'\n*Vedic , Ancient Greek   'new'\n*Vedic , Ancient Greek   'father'\nOne difference between Greek and Vedic, however, is that in Greek words the accent is always found in one of the last three syllables, whereas in Vedic (and presumably in Proto-Indo-European) it could come anywhere in the word.\nThe distinction in Greek between circumflex and acute accent appears to be a Greek development, and does not go back to Proto-Indo-European.\nPronunciation of the accent\nGeneral evidence\nIt is generally agreed that the ancient Greek accent was primarily one of pitch or melody rather than of stress. Thus in a word like   'man', the first syllable was pronounced on a higher pitch than the others, but not necessarily any louder. As long ago as the 19th&nbsp;century it was surmised that in a word with recessive accent the pitch may have fallen not suddenly but gradually in a sequence high–middle–low, with the final element always short.\nThe evidence for this comes from various sources. The first is the statements of Greek grammarians, who consistently describe the accent in musical terms, using words such as   'high-pitched' and   'low-pitched'.\nAccording to Dionysius of Halicarnassus (1st century BC), the melody of speech is confined to an interval 'of about a 5th'. This statement has been interpreted in different ways, but it is usually supposed that he meant not that it was always a fifth, but that this was the maximum normal difference between high and low syllables. It is thought probable that occasionally, especially at the end of a sentence, the interval was much smaller. Dionysius also describes how a circumflex accent combines high and low pitch on the same syllable, whereas with an acute accent the high and low pitches are in separate syllables.\nAnother indication that the accent was melodic or tonal is that in the classical period the accents of the words seem to have played no part at all in poetic metres, unlike in languages such as English which have stress-accents. It was not until the 4th century AD that poems began to be written in which the accent played a role (see below).\nEvidence from music\nAn important indication of the melodic nature of the Greek accent comes from the surviving pieces of Greek music, especially the two Delphic hymns (2nd century BC), the Seikilos epitaph (1st century AD), and the hymns of Mesomedes (2nd century AD). An example is the prayer to Calliope and Apollo written by Mesomedes, court musician to the Emperor Hadrian:\n, leader of the delightful Muses, and you, wise initiator into the mysteries, Leto's son, Delian Healer, favour me with your presence.\" (For a recording, see External links below.)]]\n(Further examples of ancient Greek music can be found in the articles Delphic Hymns and Mesomedes.)\nAs can be seen, the accented syllable of a word generally has the highest note within that word, although sometimes the syllables preceding or following the accent are also high.\nWhen the accent is a circumflex, the music often shows a fall from a higher note to a lower one within the syllable itself, exactly as described by Dionysius of Halicarnassus; examples are the words   'of the Muses' and   'favourable' in the prayer illustrated above. However, sometimes there is no fall within the accented syllable, but the circumflex is set to a single note, as in   'delightful' or   'of Leto' above.\nIf the accent is a grave, there is often no rise in pitch, or else only a small one, as in   above.\nIn this practice of closely imitating the tones of word accents in the melodies of songs, Ancient Greek resembles many living Asian and African languages that have tonal accents. For this reason, the American scholars A.M. Devine and Laurence Stephens have argued that the rises and falls found in Greek music probably give a reasonably good indication of what happened when the words were spoken.\nIt seems, however, that the music did not always follow the accent exactly. Dionysius of Halicarnassus gives an example from the music written by Euripides for his play Orestes. In the lines which in our modern editions are written as  () 'Quietly, quietly! Place the tread of your shoe lightly, don't make a noise!', Dionysius reports that in the first three words and the last there was no raised pitch, while in both   'of the shoe' and   'place' there was a low note followed by two high ones, despite the accent on the first syllable of  .\nHowever, although the fragments of earlier music sometimes show a mismatch, the Delphic hymns in particular appear to show a very close relationship between the music and the word accents, with all but three of the 180 analysable words matching.\nSome more details of the way in which accents were set to music are given below. Note that in the musical examples the pitch is conventional, dating back to a publication by Friedrich Bellermann in 1840. In performance the pitch would have been at least a minor third lower.\nAcute accent\nWhen the signs for the notes in Greek music are transcribed into modern musical notation, it can be seen that an acute accent is generally followed by a fall, sometimes extending over two syllables. Usually the fall is only a slight one, as in }}  'daughters', }}  'Olympus' or }}  'she gave birth to' below. Sometimes, however, the music has a sharp drop, as in }}  'you may sing' or }}  'windless':\nOn average, the rise before the accent is less than the fall afterwards. There is sometimes a jump up from a lower note, as in the word }}  'mingling' from the second hymn; more often there is a gradual rise, as in   'of Castalia', }}  'Cynthian', or }}  'spreads upwards':\nIn some cases, however, before the accent instead of a rise there is a 'plateau' of one or two notes the same height as the accent itself, as in }}  'of Parnassus', }}  'he visits', }}  'of the Romans', or }}  'ageless' from the Delphic hymns:\nAnticipation of the high tone of an accent in this way is found in other pitch-accent languages, such as some varieties of Japanese, Turkish, or Serbian, where for example the word papríka (pepper) can be pronounced pápríka. It would not be surprising therefore to find that it was a feature of Greek speech also. Devine and Stephens, however, argue that the norm in Greek words was for unaccented syllables to be low-pitched, citing Dionysius's statement that \"there is only one high tone per word\".\nWhen an acute accent occurs on a long vowel or diphthong, it is generally assumed that the high pitch was on the second mora of the vowel, that is to say, that there was a rising pitch within the syllable. The Greek music sometimes shows exactly this, as with the word }}  'it burns' in the 1st Delphic hymn, or }}  'shine!' in the Seikilos epitaph, or }}  'the Moon' in the Hymn to the Sun, in which the syllable with the acute is set to a melism of two or three notes rising gradually.\nMore frequently, however, on an accented long vowel in the music there is no rise in pitch, and the syllable is set to a level note, as in the words }}  'Hephaestus' from the 1st Delphic hymn or   'those' or }}  'of the Romans' from the 2nd&nbsp;hymn:\nBecause this is so common, it is possible that at least sometimes the pitch did not rise on a long vowel with an acute accent but remained level. Another consideration is that although the ancient grammarians regularly describe the circumflex accent as 'two-toned' (}}) or 'compound' (}}) or 'double' (}}), they usually do not make similar remarks about the acute. There are apparently some, however, who mention a 'reversed circumflex', presumably referring to this rising accent.\nTonal assimilation\nDevine and Stephens note that occasionally at the end of a word, the pitch rises again, as though leading up to or anticipating the accent in the following word. They refer to this as a \"secondary rise\". Examples are   'you have a tripod' or   'sing the Pythian' in the 2nd Delphic hymn. According to Devine and Stephens, it \"probably reflects a genuine process of pitch assimilation in fluent speech\".\nIn the great majority of cases in the music, the pitch falls on the syllable immediately following an acute accent. However, there are some exceptions. One situation where this can happen is when two words are joined in a plateau or near-plateau, as in the phrases   'so that Phoebus' (1st Hymn) and   'in the city of Cecrops' in the 2nd Delphic Hymn:\nTonal assimilation or tone sandhi between neighbouring tones is commonly found in tonal languages. Devine and Stephens, citing a similar phenomenon in the music of the Nigerian language Hausa, comment: \"This is not a mismatch but reflects a feature of phrase intonation in fluent speech.\"\nCircumflex accent\nA circumflex was written only over a long vowel or diphthong. In the music, the circumflex is usually set to a melisma of two notes, the first higher than the second. Thus in the first Delphic Hymn the word   'Phoebus' is set to the same musical notes as   'daughters' earlier in the same line, except that the first two notes fall within one syllable instead of across two syllables. Just as with the acute accent, a circumflex can be preceded either by a note on the same level, as in   'with songs', or by a rise, as in   'oracular':\nThe circumflex therefore appears to have been pronounced in the same way as an acute, except that the fall usually took place within one syllable. This is clear from the description of Dionysius of Halicarnassus (see above), who tells us that a circumflex accent was a blend of high and low pitch in a single syllable, and it is reflected in the word   'high-low' (or 'acute-grave'), which is one of the names given to the circumflex in ancient times. Another description was   'two-toned'.\nAnother piece of evidence for the pronunciation of the circumflex accent is the fact that when two vowels are contracted into one, if the first one has an acute, the result is a circumflex: e.g.    'I see' is contracted to   with a circumflex, combining the high and low pitches of the previous vowels.\nIn the majority of examples in the Delphic hymns, the circumflex is set to a melisma of two notes. However, in Mesomedes' hymns, especially the hymn to Nemesis, it is more common for the circumflex to be set to a single note. Devine and Stephens see in this the gradual loss over time of the distinction between acute and circumflex.\nOne place where a circumflex can be a single note is in phrases where a noun is joined with a genitive or an adjective. Examples are   (1st Delphic Hymn) 'thighs of bulls',   'Leto's son' (Mesomedes' Prayer to Calliope and Apollo),   'the whole world' (Mesomedes' Hymn to the Sun). In these phrases, the accent of the second word is higher than or on the same level as that of the first word, and just as with phrases such as   mentioned above, the lack of fall in pitch appears to represent some sort of assimilation or tone sandhi between the two accents:\nWhen a circumflex occurs immediately before a comma, it also regularly has a single note in the music, as in   'delightful' in the Mesomedes' Invocation to Calliope illustrated above. Other examples are   'famous',   'with arrows' in 2nd Delphic hymn,   'you live' in the Seikilos epitaph, and  ,   and   in Mesomedes' Hymn to Nemesis.\nAnother place where a circumflex sometimes has a level note in the music is when it occurs in a penultimate syllable of a word, with the fall only coming in the following syllable. Examples are  ,   (1st Delphic hymn),  ,  , and   (2nd Delphic hymn), and  ,   (Hymn to Nemesis).\nGrave accent\nThe third accentual mark used in ancient Greek was the grave accent, which is only found on the last syllable of words e.g.   'a good man'. Scholars are divided about how this was pronounced; whether it meant that the word was completely accentless or whether it meant a sort of intermediate accent is unclear. In some early documents making use of written accents, a grave accent could often be added to any syllable with low pitch, not just the end of the word, e.g. .\nSome scholars, such as the Russian linguist Nikolai Trubetzkoy, have suggested that because there is usually no fall after a grave accent, the rise in pitch which was heard at the end of a clause was phonologically not a true accent, but merely a default phrasal tone, such as is heard in languages like Luganda. Other scholars, however, such as Devine and Stephens, argue that on the contrary the grave accent at the end of a word was a true accent, but that in certain contexts its pitch was suppressed.\nIn the music, a word with a grave frequently has no accent at all, and is set to a single level note, as in these examples from the 2nd Delphic hymn,   'whom blessed Leto bore' and   'then, leaving the Cynthian island', in which the words   'Leto' and   'having left' have no raised syllables:\nHowever, occasionally the syllable with the grave can be slightly higher than the rest of the word. This usually occurs when the word with a grave forms part of a phrase in which the music is in any case rising to an accented word, as in   'and you, wise initiator into the mysteries' in the Mesomedes prayer illustrated above, or in   'and the pipe, sounding clearly, weaves a song with shimmering melodies' in the 1st Delphic hymn:\nIn the Delphic hymns, a grave accent is almost never followed by a note lower than itself. However, in the later music, there are several examples where a grave is followed by a fall in pitch, as in the phrase below, karopà merópōn stréphetai túkha 'the harsh fate of mortals turns' (Hymn to Nemesis), where the word   'harsh, grey-eyed' has a fully developed accent:\nWhen an oxytone word such as   'good' comes before a comma or full stop, the accent is written as an acute. Several examples in the music illustrate this rise in pitch before a comma, for example   'wise Calliope' illustrated above, or in the first line of the Hymn to Nemesis (Némesi pteróessa bíou rhopá 'Nemesis, winged tilter of the scales of life'):\nThere are almost no examples in the music of an oxytone word at the end of a sentence except the following, where the same phrase is repeated at the end of a stanza. Here the pitch drops and the accent appears to be retracted to the penultimate syllable:\nThis, however, contradicts the description of the ancient grammarians, according to whom a grave became an acute (implying that there was a rise in pitch) at the end of a sentence just as it does before a comma.\nGeneral intonation\nDevine and Stephens also note that it is also possible to get some indication of the intonation of Ancient Greek from the Delphic hymns: For example, in most languages there is a tendency for the pitch to gradually become lower as the clause proceeds. This tendency, known as downtrend or downdrift, seems to have been characteristic of Greek too. For example, in the second line of the 1st&nbsp;Delphic Hymn, there is a gradual descent from a high pitch to a low one, followed by a jump up by an octave for the start of the next sentence. The words () mean: 'Come, so that you may hymn with songs your brother Phoebus, the Golden-Haired':\n, showing how the accents gradually descend in pitch in the course of the sentence. The words read: 'Come, so that you may hymn with songs your brother Phoebus, the Golden-Haired.']]\nHowever, not all sentences follow this rule, but some have an upwards trend, as in the clause below from the first Delphic hymn, which when restored reads &hairsp;  &hairsp;  &hairsp; [ &hairsp;  &hairsp; ] &hairsp;  }} &hairsp;  &hairsp; 'how you seized the prophetic tripod which the great snake was guarding'. Here the whole sentence rises up to the emphatic word }}  'large serpent':\nIn English before a comma, the voice tends to remain raised, to indicate that the sentence is not finished, and this appears to be true of Greek also. Immediately before a comma, a circumflex accent does not fall but is regularly set to a level note, as in the first line of the Seikilos epitaph, which reads hòson zêis phaínou, mēdèn hólōs sù lupoû 'As long as you live, shine! Do not grieve at all':\n]]\nA higher pitch is also used for proper names and for emphatic words, especially in situations where a non-basic word-order indicates emphasis or focus. An example occurs in the second half of the Seikilos epitaph, where the last two lines read pròs olígon ésti tò zên, tò télos ho khrónos apaiteî 'It is for a short time only that life exists; as for the end, Time demands it'. In the second sentence, where the order is object–subject–verb, the word }}  'time' has the highest pitch, as if emphasised:\nAnother circumstance in which no downtrend is evident is when a non-lexical word is involved, such as }}  'so that' or }}  'this'. In the music the accent in the word following non-lexical words is usually on the same pitch as the non-lexical accent, not lower than it. Thus there is no downtrend in phrases such as }}  'this crag' or }}  'so that Phoebus', where in each case the second word is more important than the first:\nPhrases containing a genitive, such as }}  'Leto's son' quoted above, or }}  'thighs of bulls' in the illustration below from the 1st&nbsp;Delphic hymn, also have no downdrift, but in both of these the second word is slightly higher than the first:\nStrophe and antistrophe\nOne problem which has been discussed concerning the relationship between music and word accent is what may have happened in choral music which was written in pairs of corresponding stanzas known as strophe and antistrophe. Rhythmically these always correspond exactly but the word accents in the antistrophe generally do not match those in the strophe. Since none of the surviving music includes both a strophe and antistrophe, it is not clear whether the same music was written for both stanzas, ignoring the word accents in one or the other, or whether the music was similar but varied slightly to account for the accents. The following lines from Mesomedes' Hymn to the Sun, which are very similar but with slight variations in the first five notes, show how this might have been possible:\nChange to modern Greek\nIn modern Greek the accent is for the most part in the same syllable of the words as it was in ancient Greek, but is one of stress rather than pitch, so that an accented syllable, such as the first syllable in the word , can be pronounced sometimes on a high pitch, and sometimes on a low pitch. It is believed that this change took place around 2nd–4th century AD, at around the same time that the distinction between long and short vowels was also lost. One of the first writers to compose poetry based on a stress accent was the 4th-century Gregory of Nazianzus, who wrote two hymns in which syllable quantities play no part in the metre, but almost every line is accented on the penultimate syllable.\nIn modern Greek there is no difference in pronunciation between the former acute, grave, and circumflex accents, and in the modern \"monotonic\" spelling introduced in Greek schools in 1982 only one accent is used, the acute, while monosyllables are left unaccented.\nRules for the placement of the accent\nLaw of limitation\nThe accent may not come more than three syllables from the end of a word.\nIf an accent comes on the antepenultimate syllable, it is always an acute, for example:\n:{|\n|-\n| }} ||  || 'sea'\n|-\n| }} ||  || 'they did'\n|-\n| }} &emsp; ||  &emsp; || 'person'\n|-\n| }} ||  || 'people'\n|-\n| }} ||  || 'I want'\n|}\nException:\n:{|\n|-\n| }} &emsp; ||  &emsp; || 'of what sort of'\n|}\nin which the second part is an enclitic word.\nWith a few exceptions, the accent can come on the antepenult only if the last syllable of the word is 'light'. The last syllable counts as light if it ends in a short vowel, or if it ends in a short vowel followed by no more than one consonant, or if the word ends in &hairsp; }}  &hairsp; or &hairsp; }} , &hairsp; as in the above examples. But for words like the following, which have a heavy final syllable, the accent moves forward to the penultimate:\n:{|\n|-\n| }} ||  || 'of a man'\n|-\n| }} ||  || 'for men'\n|-\n| }} &emsp; ||  &emsp; || 'I wanted'\n|}\nThe ending   always counts as long, and in the optative mood, the endings   or   also count as long and cause the accent to move forward in the same way:\n:{|\n|-\n| }} ||  || 'he will do'\n|-\n| }} &emsp; ||  &emsp; || 'he would do' (future optative)\n|}\nThe accent also cannot come on the antepenultimate syllable when the word ends in &hairsp; }}  &hairsp; or &hairsp; }} , hence the difference in pairs of words such as the following:\n:{|\n|-\n| }} &emsp; ||  &emsp; || 'fond of words', &emsp; but\n|-\n| }} &emsp; ||  &emsp; || 'fond of flatterers'\n|}\nCertain words ending in &hairsp; }}  &hairsp; or &hairsp; }}  are exceptions, when the accent may remain on the antepenult even when the last vowel is long; some examples:\n:{|\n|-\n| }} &emsp; ||  &emsp; || 'of a city'\n|-\n| }} &emsp; ||  &emsp; || 'of cities' (genitive)\n|}\n:{|\n|-\n| }} &emsp; ||  &emsp; || 'golden-horned'\n|-\n|  }} &emsp; ||  &emsp; || 'rhinoceros'\n|}\n:{|\n|-\n| }} &emsp; ||  &emsp; || 'propitious'\n|-\n| }} &emsp; ||  &emsp; || 'Menelaus'\n|}\n() Law\nIf the accent comes on the penultimate syllable, it must be a circumflex if the last two vowels of the word are long–short. This applies even to words ending in   or  :\n*  'body'\n*  'slave'\n*  'herald'\n*  'storm'\nThis rule is known as the  () Law, since in the accusative case the word   'saviour' becomes  .\nIn most cases, a final   or   counts as a short vowel:\n*  'sailors'\n*  'to do'\n*  'slaves'\nOtherwise the accent is an acute:\n*  'sailor'\n*  'he orders'\n*  'for slaves (dative)'\nException 1: Certain compounds made from an ordinary word and an enclitic suffix have an acute even though they have long vowel–short vowel:\n*  'these',   'this (fem.)' (but   'of these')\n*  'that (as a result)',   'nor'\n*  'if only'\n*  'no one' (but as a name in the Odyssey,  )\nException 2: In locative expressions and verbs in the optative mood a final   or   counts as a long vowel:\n*  'at home' (cf.   'houses')\n*  'he might do' (aorist optative, =  ) (cf.   'to do')\nLaw of Persistence\nThe third principle of Greek accentuation is that, after taking into account the Law of Limitation and the  () Law, the accent in nouns, adjectives, and pronouns remains as far as possible on the same syllable (counting from the beginning of the word) in all the cases, numbers, and genders. For example:\n*  'yoke', pl.   'yokes'\n*  'soldier',   'soldiers'\n* , pl.   'fathers'\n* , pl.   'bodies'\nBut an extra syllable or a long ending causes accent shift:\n* , pl.   'names'\n* , fem.   'just'\n* , gen.pl.   'of bodies'\nExceptions to the Law of Persistence\nThere are a number of exceptions to the Law of Persistence.\nException 1: The following words have the accent on a different syllable in the plural:\n* , pl.   'men'\n* , pl.   (poetic  ) 'daughters'\n* , pl.   'mothers'\nThe accusative singular and plural has the same accent as the nominative plural given above.\nThe name   'Demeter' changes its accent to accusative  , genitive  , dative  .\nException 2: Certain vocatives (mainly of the 3rd declension) have recessive accent:\n* ,   'o Socrates'\n* ,   'o father'\nException 3: All 1st declension nouns, and all 3rd declension neuter nouns ending in  , have a genitive plural ending in  . This also applies to 1st declension adjectives, but only if the feminine genitive plural is different from the masculine:\n*  'soldier', gen.pl.   'of soldiers'\n*  'the wall', gen.pl.   'of the walls'\nException 4: Some 3rd declension nouns, including all monosyllables, place the accent on the ending in the genitive and dative singular, dual, and plural. (This also applies to the adjective   'all' but only in the singular.) Further details are given below.\n*  'foot', acc.sg.  , gen.sg.  , dat.sg.\nException 5: Some adjectives, but not all, move the accent to the antepenultimate when neuter:\n*  'better', neuter\n*But:   'graceful', neuter\nException 6: The following adjective has an accent on the second syllable in the forms containing  :\n* , pl.   'big'\nOxytone words\nOxytone words, that is, words with an acute on the final syllable, have their own rules.\nChange to a grave\nNormally in a sentence, whenever an oxytone word is followed by a non-enclitic word, the acute is changed to a grave; but before a pause (such as a comma, colon, full stop, or verse end), it remains an acute:\n*  'a good man'\n(Not all editors follow the rule about verse end.)\nThe acute also remains before an enclitic word such as   'is':\n*  'he's a good man'\nIn the words   'who?' and   'what? why?', however, the accent always remains acute, even if another word follows:\n*  'who is that?'\n*  'what are you doing?'\nChange to a circumflex\nWhen a noun or adjective is used in different cases, a final acute often changes to a circumflex. In the 1st and 2nd declension, oxytone words change the accent to a circumflex in the genitive and dative. This also applies to the dual and plural, and to the definite article:\n*  'the god', acc.sg.   – gen. sg.   'of the god', dat.sg.   'to the god'\nHowever, oxytone words in the 'Attic' declension keep their acute in the genitive and dative:\n*  'in the temple'\n3rd declension nouns like   'king' change the acute to a circumflex in the vocative and dative singular and nominative plural:\n* , voc.sg.  , dat.sg.  , nom.pl.   or\nAdjectives of the type   'true' change the acute to a circumflex in all the cases which have a long vowel ending:\n* , acc.sg.  , gen.sg.  , dat.sg.  , nom./acc.pl.  , gen.pl.\nAdjectives of the type   'pleasant' change the acute to a circumflex in the dative singular and nominative and accusative plural:\n* , dat.sg.  , nom./acc.pl.\nAccentless words\nThe following words have no accent, only a breathing:\n*the forms of the article beginning with a vowel ( )\n*the prepositions   'in',   'to, into',   'from'\n*the conjunction   'if'\n*the conjunction   'as, that' (also a preposition 'to')\n*the negative adverb   'not'.\nHowever, some of these words can have an accent when they are used in emphatic position.   are written  when the meaning is 'who, which'; and   is written  if it ends a sentence.\nThe definite article\nThe definite article in the nominative singular and plural masculine and feminine just has a rough breathing, and no accent:\n*  'the god'\n*  'the gods'\nOtherwise the nominative and accusative have an acute accent, which in the context of a sentence, is written as a grave:\n*  'the god' (accusative)\n*  'the weapons'\nThe genitive and dative (singular, plural and dual), however, are accented with a circumflex:\n*  'of the house' (genitive)\n*  'for the god' (dative)\n*  'for the gods' (dative plural)\n*  'of/to the two goddesses' (genitive or dative dual)\n1st and 2nd declension oxytones, such as  , are accented the same way as the article, with a circumflex in the genitive and dative.\nNouns\n1st declension\nTypes\nThose ending in short   are all recessive:\n*  'sea',   'Muse (goddess of music)',   'queen',   'bridge',   'truth',   'dagger',   'tongue, language'\nOf those which end in long   or  , some have penultimate accent:\n*  'house',   'country',   'victory',   'battle',   'day',   'chance',   'necessity',   'craft',   'peace'\nOthers are oxytone:\n*  'market',   'army',   'honour',   'empire; beginning',   'letter',   'head',   'soul',   'council'\nA very few have a contracted ending with a circumflex on the last syllable:\n*  'earth, land',   'Athena',   'mina (coin)'\nMasculine 1st declension nouns usually have penultimate accent:\n*  'soldier',   'citizen',   'young man',   'sailor',   'Persian',   'master',   'Alcibiades',   'Miltiades'\nA few, especially agent nouns, are oxytone:\n*  'poet',   'judge',   'learner, disciple',   'athlete',   'piper'\nThere are also some with a contracted final syllable:\n*  'Hermes',   'the North Wind'\nAccent movement\nIn proparoxytone words like  , with a short final vowel, the accent moves to the penultimate in the accusative plural, and in the genitive and dative singular, dual, and plural, when the final vowel becomes long:\n*  'sea', gen.   'of the sea'\nIn words with penultimate accent, the accent is persistent, that is, as far as possible it stays on the same syllable when the noun changes case. But if the last two vowels are long–short, it changes to a circumflex:\n*  'soldier', nom.pl.   'the soldiers'\nIn oxytone words, the accent changes to a circumflex in the genitive and dative (also in the plural and dual), just as in the definite article:\n*  'of the army',   'for the army'\nAll 1st declension nouns have a circumflex on the final syllable in the genitive plural:\n*  'of soldiers',   'of days'\nThe vocative of 1st declension nouns usually has the accent on the same syllable as the nominative. But the word   'master' has a vocative accented on the first syllable:\n*  'young man!',   'o poet'\n*  'master!'\n2nd declension\nTypes\nThe majority of 2nd declension nouns have recessive accent, but there are a few oxytones, and a very few with an accent in between (neither recessive nor oxytone) or contracted:\n*  'man',   'horse',   'war',   'island',   'slave',   'wοrd',   'death',   'life',   'sun',   'time',   'manner',   'law, custom',   'noise',   'circle'\n*  'god',   'river',   'road',   'brother',   'number',   'general',   'eye',   'heaven',   'son',   'wheel'\n*  'maiden',   'youth',   'hedgehog; sea-urchin'\n*  'mind' (contracted from ),   'voyage'\nWords of the 'Attic' declension ending in   can also be either recessive or oxytone:\n*  'Menelaus',   'Minos'\n*  'temple',   'people'\nNeuter words are mostly recessive, but not all:\n*  'gift',   'tree',   'weapons',   'camp',   'boat',   'work',   'child',   'animal'\n*  'sign',   'oracle',   'school'\n*  'yoke',   'egg',   'fleet',   'temple' (the last two are derived from adjectives)\nWords ending in   often have penultimate accent, especially diminutive words:\n*  'book',   'place',   'baby',   'plain'\nBut some   words are recessive, especially those with a short antepenultimate:\n*  'cloak',   'stade' (600 feet), 'race-course',   'lad'\nAccent movement\nAs with the first declension, the accent on 2nd declension oxytone nouns such as   'god' changes to a circumflex in the genitive and dative (singular, dual, and plural):\n*  'of the god',   'to the gods'\nBut those in the Attic declension retain their acute:\n*  'of the people'\nUnlike in the first declension, barytone words do not have a circumflex in the genitive plural:\n*  'of the horses'\n3rd declension\nTypes\n3rd declension masculine and feminine nouns can be recessive or oxytone:\n*  'mother',   'daughter',   'guard',   'city',   'old man',   'lion',   'god',   'trireme (warship)',   'witness',   'seer',   'arrangement',   'Greeks',   'Plato',   'Solon',\n*  'father',   'man',   'woman',   'king',   'cavalryman',   'storm, winter',   'hope',   'Greece',   'fish',   'fatherland',   'contest',   'harbour',   'snow',   'tunic',   'tooth',   'shield',   'dolphin',   'Amazon',   'Odysseus',   'Salamis',   'Marathon'\nCertain names resulting from a contraction are perispomenon:\n* ,  ,  ,  ,\nMasculine and feminine monosyllables similarly can be recessive (with a circumflex) or oxytone (with an acute):\n*  'boy',   'ship',   'ox',   'old woman',   'pig',   'sheep'\n*  'hand',   'foot',   'night',   'Zeus',   'earth',   'month',   'Pan',   'goose',   'goat'\n3rd declension neuter nouns are all recessive, and monosyllables have a circumflex (this includes letters of the alphabet):\n*  'name',   'body',   'mouth',   'wall',   'mountain',   'year',   'blood',   'water',   'race, kind',   'money',   'business, affair',   'spirit, breath',   'end'\n*  'fire',   'light',   'heart' (poetic)\n* ,  ,   'omega'\nAccent movement\nThe accent in the nominative plural and in the accusative singular and plural is usually on the same syllable as the nominative singular, unless this would break the three-syllable rule. Thus:\n* , pl.   'storms'\n* , pl.   'women'\n* , pl.   'fathers'\n* , pl.   'ships'\n* , pl.   'bodies'\nBut, in accordance with the 3-syllable rule:\n* , nominative pl.   'names', gen. pl.\nThe following are exceptions and have the accent on a different syllable in the nominative and accusative plural or the accusative singular:\n* , pl.   'men'\n* , pl.   (poetic  ) 'daughters'\n* , pl.   'mothers'\nBut the following is recessive:\n* , acc.   'Demeter'\nWords ending in   are all oxytone, but only in the nominative singular. In all other cases the accent is on the   or  :\n*  'king', nom.pl.   or\nAccent shift in genitive and dative\nIn 3rd declension monosyllables the accent usually shifts to the final syllable in the genitive and dative. The genitive dual and plural have a circumflex:\n*singular:   'foot'dual: nom./acc.  , gen./dat.   '(pair of) feet'plural:   'feet'\n*singular:   'night'plural:\nThe following are irregular in formation, but the accent moves in the same way:\n* } 'ship'plural:\n*  'Zeus'\nThe numbers for 'one', 'two', and 'three' also follow this pattern (see below).\n'woman' and   'dog' despite not being monosyllables, follow the same pattern:\n*  'woman'pl.\n*  'dog'pl.\nThere are some irregularities. The nouns   'boy' and   'Trojans' follow this pattern except in the genitive dual and plural:\n*singular   'boy'\nThe adjective   'all' has a mobile accent only in the singular:\n*singular\n:plural  .\nMonosyllabic participles, such as   'being', and the interrogative pronoun   'who? what?' have a fixed accent.\n*singular\n:plural  .\nThe words   'father',   'mother',   'daughter', have the following accentuation:\n*  'father'pl.\n'stomach' is similar:\n*  'stomach'pl.  }\nThe word   'man' has the following pattern, with accent shift in the genitive singular and plural:\n*  'man'pl.\n3rd declension neuter words ending in   have a circumflex in the genitive plural, but are otherwise recessive:\n*  'wall', gen.pl.   'of walls'\nConcerning the genitive plural of the word   'trireme', there was uncertainty. 'Some people pronounce it barytone, others perispomenon,' wrote one grammarian.\nNouns such as   'city' and   'town' with genitive singular   'city' keep their accent on the first syllable in the genitive singular and plural, despite the long vowel ending:\n*  'city'pl.\n3rd declension neuter nouns ending in   have a circumflex in the genitive plural, but are otherwise recessive:\n*  'wall'pl.\nVocative\nUsually in 3rd declension nouns the accent becomes recessive in the vocative:\n*  'father!',   'madam!',   'o Socrates',  ,  ,\nHowever, the following have a circumflex on the final syllable:\n*  'o Zeus',   'o king'\nAdjectives\nTypes\nAdjectives frequently have oxytone accentuation, but there are also barytone ones, and some with a contracted final syllable. Oxytone examples are:\n*  'good',   'bad',   'beautiful',   'fearsome',   'Greek',   'wise',   'strong',   'long',   'shameful',   'high',   'small',   'faithful',   'difficult'\n*  'left-hand',   'right-hand'\n*  'pleasant',   'sharp, high-pitched',   'heavy, low-pitched',   'fast',   'slow',   'deep',   'sweet'. (The feminine of all of these has  .)\n*  'much', plural   'many'\n*  'true',   'lucky',   'unfortunate',   'weak, sick',   'safe'\nRecessive:\n*  'friendly',   'enemy',   'just',   'rich',   'worthy',   'Spartan',   'easy'\n*  'foolish',   'unjust',   'new, young',   'alone',   'useful',   'made of stone',   'wooden'\n*  'other',   'each'\n*  'your',   'our'\n*  'propitious'\n*  'kindly',   'bad-smelling',   'happy'. (For other compound adjectives, see below.)\n*  'all', plural\nParoxytone:\n*  'little',   'opposite',   'near'\n*  'great, big', fem.  , plural\nProperispomenon:\n*  'Athenian',   'brave'\n*  'ready',   'deserted'\n*  'such',   'so great'\nPerispomenon:\n*  'golden',   'bronze'\nComparative and superlative adjectives all have recessive accent:\n*  'wiser',   'very wise'\n*  'greater',   'very great'\nAdjectives ending in   have a circumflex in most of the endings, since these are contracted:\n*  'true', masculine plural\n'foolish' is oxytone in the New Testament:\n*  'and five of them were foolish' (Matthew 25.2)\nPersonal names derived from adjectives are usually recessive, even if the adjective is not:\n*  'Athenaeus', from   'Athenian'\n* , from   'grey-eyed'\nAccent movement\nUnlike in modern Greek, which has fixed accent in adjectives, an antepenultimate accent moves forward when the last vowel is long:\n*  'friendly (masc.)',   'friendly (fem.)', fem.pl.\nThe genitive plural of feminine adjectives is accented  , but only in those adjectives where the masculine and feminine forms of the genitive plural are different:\n*  'all', gen.pl.   'of all (masc.)',   'of all (fem.)'\nBut:\n*  'just', gen.pl.   (both genders)\nIn a barytone adjective, in the neuter, when the last vowel becomes short, the accent usually recedes:\n*  'better', neuter\nHowever, when the final   was formerly * , the accent does not recede (this includes neuter participles):\n*  'graceful', neuter\n*  'having done', neuter\nThe adjective   'great' shifts its accent to the penultimate in forms of the word that contain lambda ( ):\n*  'great', plural\nThe masculine   'all' and neuter   have their accent on the ending in genitive and dative, but only in the singular:\n*  'all', gen.sg.  , dat.sg.   (but gen.pl.  , dat.pl.  )\nThe participle   'being', genitive  , has fixed accent.\nElided vowels\nWhen the last vowel of an oxytone adjective is elided, an acute (not a circumflex) appears on the penultimate syllable instead:\n*  'he was doing dreadful things' (for )\n*  'many good things' (for )\nThis rule also applies to verbs and nouns:\n*  'take (the cup), o stranger' (for )\nBut it does not apply to minor words such as prepositions or   'but':\n* 'the fox knows many things, but the hedgehog one big thing' (Archilochus)\nThe retracted accent was always an acute. The story was told of an actor who, in a performance of Euripides' play Orestes, instead of pronouncing   'I see a calm sea', accidentally said   'I see a weasel', provoking laughter in the audience and mockery the following year in Aristophanes' Frogs.\nCompound nouns and adjectives\nOrdinary compounds, that is, those which are not of the type 'object+verb', usually have recessive accent:\n*  'hippopotamus' ('horse of the river')\n*  'Timothy' ('honouring God')\n*  'ally' ('fighting alongside')\n*  'philosopher' ('loving wisdom')\n*  'mule' ('half-donkey')\nBut there are some which are oxytone:\n*  'high priest'\n*  'actor, hypocrite'\nCompounds of the type 'object–verb', if the penultimate syllable is long or heavy, are usually oxytone:\n*  'general' ('army-leader')\n*  'farmer' ('land-worker')\n*  'bread-maker'\nBut 1st declension nouns tend to be recessive even when the penultimate is long:\n*  'book-seller'\n*  'informer' (lit. 'fig-revealer')\nCompounds of the type 'object+verb' when the penultimate syllable is short are usually paroxytone:\n*  'cowherd'\n*  'spear-bearer'\n*  'discus-thrower'\n*  'look-out man' (lit. 'day-watcher')\nBut the following, formed from   'I hold', are recessive:\n*  'who holds the aegis'\n*  'holder of an allotment (of land)'\nAdverbs\nAdverbs formed from barytone adjectives are accented on the penultimate, as are those formed from adjectives ending in  ; but those formed from other oxytone adjectives are perispomenon:\n*  'brave',   'bravely'\n*  'just',   'justly'\n* , 'pleasant',   'with pleasure'\n* , 'beautiful',   'beautifully'\n* , 'true',   'truly'\nAdverbs ending in   have penultimate accent:\n*  'often'\nNumbers\nThe first three numbers have mobile accent in the genitive and dative:\n*  'one (m.)', acc.  , gen.   'of one', dat.   'to or for one'\n*  'one (f.)', acc.  , gen.  , dat.\n*  'two', gen/dat.\n*  'three', gen.  , dat.\nDespite the circumflex in  , the negative   'no one (m.)' has an acute. It also has mobile accent in the genitive and dative:\n*  'no one (m.)', acc.  , gen.   'of no one', dat.   'to no one'\nThe remaining numbers to twelve are:\n*  'four',   'five',   'six',   'seven',   'eight',   'nine',   'ten',   'eleven'   'twelve'\nAlso commonly found are:\n*  'twenty',   'thirty',   'a hundred',   'a thousand'.\nOrdinals all have recessive accent, except those ending in  :\n*  'first',   'second',   'third' etc., but   'twentieth'\nPronouns\nThe personal pronouns are the following:\n*  'I',   'you (sg.)',   'him(self)'\n*  'we two',   'you two'\n*  'we',   'you (pl.)',   'they'\nThe genitive and dative of all these personal pronouns has a circumflex, except for the datives  ,  , and  :\n*  'of me',   'for you (pl.)',   'to him(self)'\n*  'for me',   'for you', and   'for them(selves)'\nThe oblique cases of  ,   'you (sg.)',  , and   can also be used enclitically when they are unemphatic (see below under Enclitics), in which case they are written without accents. When enclitic,  ,  , and   are shortened to  ,  , and  :\n*  'it is possible for you'\n*  'tell me'\n*  'for this apparently was their custom' (Xenophon)\nThe accented form is usually used after a preposition:\n*  'Cyrus sent me to you'\n*  (sometimes  ) 'to me'\nThe pronouns   'he himself',   'himself (reflexive)', and   'who, which' change the accent to a circumflex in the genitive and dative:\n*  'him',   'of him, his',   'to him',   'to them', etc.\nPronouns compounded with   'this' and   are accented as if the second part was an enclitic word. Thus the accent of   does not change to a circumflex even though the vowels are long–short:\n*  'these',   'of which things'\nThe demonstratives   'this' and   'that' are both accented on the penultimate syllable. But   'this man here' is oxytone.\nWhen   means 'who?' is it always accented, even when not before a pause. When it means 'someone' or 'a certain', it is enclitic (see below under Enclitics):\n*  'to someone'\n*  'to whom?'\nThe accent on   is fixed and does not move to the ending in the genitive or dative.\nPrepositions\n'in',   'to, into', and   'from, out of' have no accent, only a breathing.\n*  'in him'\nMost other prepositions have an acute on the final when quoted in isolation (e.g.   'from', but in the context of a sentence this becomes a grave. When elided this accent does not retract and it is presumed that they were usually pronounced accentlessly:\n*  'to him'\n*  'from him'\nWhen a preposition follows its noun, it is accented on the first syllable (except for   'around' and   'instead of'):\n*  'about what?'\nThe following prepositions were always accented on the first syllable in every context:\n*  'without',   'until, as far as'\nInterrogative words\nInterrogative words are almost all accented recessively. In accordance with the principle that in a monosyllable the equivalent of a recessive accent is a circumflex, a circumflex is used on a long-vowel monosyllable:\n*  'when?',   'where from?',   'A... or B?',   'what kind of?',   'how much?',   'how many?'\n* ,   'is it the case that...?'\n*  'where?',   'where to?',   'which way?'\nTwo exceptions, with paroxytone accent, are the following:\n*  'how big?', 'how old?',   'how often?'\nThe words   and   always keep their acute accent even when followed by another word. Unlike other monosyllables, they do not move the accent to the ending in the genitive or dative:\n*  'who? which?',   'what?', 'why?',   'which people?',   'of what? whose?',   'to whom?',   'about what?'\nSome of these words, when accentless or accented on the final, have an indefinite meaning:\n*  'someone',   'some people',   'once upon a time', etc.\nWhen used in indirect questions, interrogative words are usually prefixed by   or  . The accentuation differs. The following are accented on the second syllable:\n*  'when',   'from where',   'how great',   'which of the two'\nBut the following are accented on the first:\n*  'where',   'to where',   'who'\nEnclitics\nTypes of enclitic\nEnclitics are words which have no accent themselves, but place an accent on the word they follow. Examples in Greek are the following:\n(a) The connective   'also', 'and':\n*  'both Greeks and foreigners'\n(b) The emphatic particles:\n*  'at any rate',   'just, although',   'in fact',\n*(Mostly in Homer:)   'it may be',   'now',   'then',   'in truth':\nThe pronouns   'I' and   'to me' can combine with   to make a single word accented on the first syllable:\n*  'I at any rate',   'for me at any rate'\n(c) Indefinite adverbs:\n*  'once',   'somehow',   'I suppose, somewhere',   (Homeric for ),   'from somewhere',   'in some way',   'yet'\n(d) Indefinite pronouns:\n*  'someone', 'a certain',   'something',   'certain people'\nBut   can also sometimes begin a sentence, in which case it is non-enclitic and has an accent on the final.\n(e) The present tense (except for the 2nd person singular) of   'I am' and   'I say':\n*  'I am'\n*  'as he himself says'\nThese verbs can also have non-enclitic forms which are used, for example, to begin a sentence or after an elision. The verb   'is' has an emphatic form  . Judging from parallel forms in Sanskrit it is possible that originally when non-enclitic the other persons also were accented on the first syllable: * , *  etc.; but the usual convention, among most modern editors as well as the ancient Greek grammarians, is to write   and   even at the beginning of a sentence.\nWhen negative,   is customarily written with its strong form, but   is enclitic:\n*  'he is not'\n*  'he says ... not'\nThe strong form   is also written after   'if',   'since',   'but',   'this', according to Herodian.\n(f) Certain personal pronouns in oblique cases when non-emphatic:\n*  'me',  ,  ,\n*  'you (sg)',  ,\n*  'him(self)',  ,  ,\n*  'him' (poetic)\n*  'them(selves)',  ,\nIn classical writers,   'him' and   'them' tend to be used in indirect speech referring to the speaker:\n* 'he ordered the slave-boy to run and ask the man to wait for him' (Plato)\nSome of these pronouns also have non-enclitic forms which are accented. The non-enclitic form of   'me', 'of me', 'to me' is  . The accented forms are used at the beginning of a sentence and (usually) after prepositions:\n*  'I'm calling you'\n*  'in you'\nEnclitic rules\nWhen an enclitic follows a proparoxytone or a properispomenon word, the main word has two accents:\n*  'certain Greeks'\n*  'he's a slave'\nWhen it follows an oxytone word or an accentless word, there is an acute on the final syllable:\n*  'tell me'\n*  'if anyone'\nWhen it follows perispomenon or paroxytone word, there is no additional accent, and a monosyllabic enclitic remains accentless:\n*  'I see you'\n*  'tell me'\nA two-syllable enclitic has no accent after a perispomenon:\n*  'of some good thing'\n*  'of some archers'\nBut a two-syllabled enclitic has one after a paroxytone word (otherwise the accent would come more than three syllables from the end of the combined word). After a paroxytone   has a circumflex:\n*  'certain others'\n*  'of some weapons'\nA word ending in   or   behaves as if it was paroxytone and does not take an additional accent:\n*  'he is a herald'\nA two-syllable enclitic is also accented after an elision:\n*  'there are many'\nWhen two or three enclitics come in a row, according to Apollonius and Herodian, each passes its accent to the preceding word (although some modern editors have queried this):\n*  'or perhaps fear is holding you back'\nIt appears that with certain long-vowelled enclitics, such as  , Herodian recommended that they should be left unaccented when another enclitic followed. However, most modern editors ignore this second rule, and print   'if anyone anywhere' rather than  .\nVerbs\nIn verbs, the accent is grammatical rather than lexical; that is to say, it distinguishes different parts of the verb rather than one verb from another. In the indicative mood it is usually recessive, but in other parts of the verb it is often non-recessive.\nExcept for the nominative singular of certain participles (e.g., masculine  , neuter   'after taking'), a few imperatives (such as   'say'), and the irregular present tenses (  'I say' and   'I am'), no parts of the verb are oxytone.\nIndicative\nIn the indicative of most verbs, other than contracting verbs, the accent is recessive, meaning it moves as far back towards the beginning of the word as allowed by the length of the last vowel. Thus, verbs of three or more syllables often have an acute accent on the penult or antepenult, depending on whether the last vowel is long or short (with final   counted as short):\n*  'I give'\n*  'I take'\n*  'he orders'\n*  'he ordered'\n*  'I want'\nMonosyllabic verbs, such as   'he went' (poetic) and   'you are', because they are recessive, have a circumflex. An exception is   or   'you say'.\nA few 3rd person plurals have a contracted ending (the other persons are recessive):\n*  'they send off'\n*  'they stand (transitive)'\n*  'they have died'\n*  'they are standing (intransitive)'\nWhen a verb is preceded by an augment, the accent goes no further back than the augment itself:\n*  'it was possible'\n*  'they entered'\nContracting verbs\nContracting verbs are underlyingly recessive, that is, the accent is in the same place it had been before the vowels contracted. When an acute and a non-accented vowel merge, the result is a circumflex. In practice therefore, several parts of contracting verbs are non-recessive:\n*  'I do' (earlier )\n*  'I was doing' (earlier )\n*  'they do' (earlier )\nContracting futures such as   'I will announce' and   'I will say' are accented like  .\nImperative\nThe accent is recessive in the imperative of most verbs:\n*  'say!'\n*  'crucify!'\n*  'remember!'\n*  'eat!'\n*  'give (pl.)!'\n*  'go away (sg.)!'\n*  'go across (sg.)!'\n*  'say!'\nIn compounded monosyllabic verbs, however, the imperative is paroxytone:\n*  'give back!'\n*  'place round!'\nThe strong aorist imperative active (2nd person singular only) of the following five verbs (provided they are not prefixed) is oxytone:\n*  'say',   'come',   'find',   'see',   'take!' (the last two in Attic only)\nHowever, if plural or prefixed, these imperatives are recessive:\n*  'say (pl.)!',  , etc.\n*  'come in!'\nThe strong aorist imperative middle of all verbs (2nd person singular only) is perispomenon:\n*  'choose!'\n*  'become!'\nBut the following is usually printed with an acute:\n*  'behold!'\nAs with the active imperative, the plurals always have a recessive accent:\n*  'see!'\nSubjunctive\nThe subjunctive of regular thematic verbs in the present tense or the weak or strong aorist tense is recessive, except for the aorist passive:\n*  'he may say'\n*  'they may say'\n*  'he may free'\n*  'he may take'\nIt is also recessive in the verb   'I go' and verbs ending in  :\n*  'he may go away'\n*  'he may point out'\nBut in the aorist passive, in the compounded aorist active of   'I go', and in all tenses of other athematic verbs, it is non-recessive:\n*  'I may be freed'\n*  'I may appear'\n*  'he may go across'\n*  'they may give',\n*  'I may stand'\n*  'I may hand over'\n*  'it may be possible'\nOptative\nThe optative similarly is recessive in regular verbs in the same tenses. The optative endings   and   count as long vowels for the purpose of accentuation:\n*  'he might free'\n*  'he might take'\nBut in the aorist passive, in the compounded aorist active of   'I go', and in all tenses of athematic verbs (other than   'I go' and verbs ending in  ), it is non-recessive:\n*  'they might be freed'\n*  'they might appear'\n*  'they might go across'\n*  'they might give'\n*  'they might stand'\n*  'they might hand over'\nBut   'he might go away' is accented recessively like a regular verb.\nInfinitive\nThe present and future infinitive of regular thematic verbs is recessive:\n*  'to say'\n*  'to be going to free'\n*  'to want'\n*  'to be going to be'\nBut all other infinitives are non-recessive, for example the weak aorist active:\n*  'to prevent'\n*  'to punish'\nStrong aorist active and middle:\n*  'to take'\n*  'to become'\n*  'to arrive'\nWeak and strong aorist passive:\n*  'to be freed'\n*  'to appear'\nThe aorist active of   'I go' when compounded:\n*  'to go across'\nThe present and aorist infinitives of all athematic verbs:\n*  'to give'\n*  'to go'\n*  'to be possible'\n*  'to betray'\nBut the Homeric   'to be' and   'to give' are recessive.\nThe perfect active, middle, and passive:\n*  'to have freed'\n*  'to have been freed'\nParticiples\nThe present, future and weak aorist participles of regular thematic verbs are recessive:\n*  'saying'\n*  'wanting'\n*  'going to free'\n*  'having heard'\nBut all other participles are non-recessive. These include the strong aorist active:\n* , masc. pl.  , fem. sg.   'after taking'\nThe weak and strong aorist passive:\n* , masc. pl.  , fem.sg.   'after being freed'\n* , masc. pl.  , fem.sg.   'after appearing'\nThe compounded aorist active of   'I go':\n* ,  , fem.sg.   'after going across'\nThe present and aorist participles of athematic verbs:\n*  'giving', masc.pl.  , fem.sg.\n* , masc.pl.  , fem.sg.   'going'\n* , masc.pl.  , fem.sg.   'after handing over'\n*  (neuter) 'it being possible'\nThe perfect active, middle, and passive:\n* , masc. pl.  , fem.sg.   'having freed'\n*  'having been freed'\n'I am' and 'I say'\nTwo athematic verbs,   'I am' and   'I say', are exceptional in that in the present indicative they are usually enclitic. When this happens they put an accent on the word before them and lose their own accent:\n*  'I am responsible'\n*  'he says ... not'\nBut both verbs can also begin a sentence, or follow a comma, or an elision, in which case they are not enclitic. In this case the accent is usually on the final syllable (e.g.  ,  ). When it follows an elision,   is also accented on the final:\n*  'what (ever) is it?'\nHowever, the 3rd person singular   also has a strong form,  , which is used 'when the word expresses existence or possibility (i.e. when it is translatable with expressions such as 'exists', 'there is', or 'it is possible').' This form is used among other places in the phrase   'it is not' and at the beginning of sentences, such as:\n*  'The sea exists; and who shall quench it?'\nThe 2nd person singular   'you are' and   'you say' are not enclitic.\nThe future of the verb 'to be' has its accent on the verb itself even when prefixed:\n*  'he will be away'\nVerbal adjectives\nThe verbal adjectives ending in   and   are always paroxytone:\n*  'he needs to be punished'\n*  'it is necessary to punish wrong-doers'\nThe adjective ending in   is usually oxytone, especially when it refers to something which is capable of happening:\n*  'famous (able to be heard about)'\n*  'capable of being taken apart'\n*  'made, adopted'\nAccent shift laws\nComparison with Sanskrit as well as the statements of grammarians shows that the accent in some Greek words has shifted from its position in Proto-Indo-European.\nWheeler's law\nWheeler's law, suggested in 1885 by Benjamin Ide Wheeler, refers to a process whereby words with a dactylic ending  (counting endings such as -on, -os, -oi as short), if they were oxytone in Proto-Indo-European, became paroxytone in Greek. It is also known as the \"law of dactylic retraction\".\nThis law is used to explain the paroxytone accent in words such as the following:\n*Adjectives such as   'multicoloured',   'opposite',   'near'\n*Names such as   'Aeschylus'\n*Perfect passive and middle participles such as   'having received'\n*Paroxytone compound words with active meaning such as   'man-slaying',   'cowherd'\n*Dative plurals such as   'fathers',   'men'\nSimilar words and endings in Sanskrit are regularly accented on the final syllable, and active compounds which do not have a dactylic rhythm often have final accent, e.g.   'soul-escorting'.\nThere are numerous exceptions to Wheeler's law, especially words ending in   or   (for example,   'fleet'), which are always oxytone. There are also participles such as   or feminine   'given', which have penultimate accent despite not being dactylic. These exceptions are usually explained as being due to analogical processes.\nBartoli's law\nBartoli's law (pronunciation /'bartoli/), proposed in 1930 by Matteo Bartoli, aims to explain how some oxytone words ending in the rhythm  (short–long) have become paroxytone. Another name is the \"law of iambic retraction\". Examples are:\n*  'daughter', presumed to have come from an earlier   (compare Vedic )\n*  'master', presumed to have come from an earlier\nThe existence of such a law has been called into question, however, and it is argued that most or all of the words proposed as examples have other explanations.\nVendryes's law\nVendryes's law (pronunciation /vɑ̃dʁi'jɛs/), proposed in 1945 by Joseph Vendryes, describes how words of the rhythm , which had penultimate accent in other dialects, came to be pronounced proparoxytone in Attic (that is, the dialect of Athens). This change appears to have taken place about 400 BC, and was known to the Greek grammarians who wrote on accentuation. One ancient commentator on Aristophanes wrote:   ('trophy') should be read as properispomenon in Aristophanes and Thucydides, but as proparoxytone   in later poets.\nThe law affected words like the following:\n* ,   'companion',   'ready',   'like',   'deserted',   'firm', which came from an earlier\n*  'I at any rate',   'to me at any rate', which came from an earlier\nThe accent shift described by Vendryes's law seems to have affected mainly adjectives. Verbs such as   'I went away' and participles such as   'having taken' were unaffected.\nDialect variations\nThe ancient grammarians were aware that there were sometimes differences between their own accentuation and that of other dialects, for example that of the Homeric poems, which they could presumably learn from the traditional sung recitation.\nAttic\nSome peculiarities of Attic, the dialect of Athens, have been noted above under Vendryes's Law.\nAeolic\nThe Aeolic pronunciation, exemplified in the dialect of the 7th-century BC poets Sappho and Alcaeus from the island of Lesbos, differed in that every major word (but not prepositions or conjunctions) was pronounced recessively, thus:\n* ,  ,  ,  ,  ,  ,  ,   for\nBut   'Alcaeus' was apparently pronounced   in Lesbian.\nThe Boeotian dialect, although from the same dialect group as Lesbian, did not have this recessive accentuation, and appears not to have differed accentually from common (koine) Greek.\nThe grammarians give no details of the Thessalian dialect (another variety of Aeolic) but it has been suggested that the dropping of certain vowels in words on inscriptions indicates that it had a stress accent at the beginning of each word.\nDoric\nThe Doric dialect also had certain peculiarities. One was that (some) properispomenon words were pronounced paroxytone. The examples given are 3rd declension nominative plural:\n*  'boys',  ,   'goats' (for  ,  ,  )\nOn the other hand, it is reported that the 1st and 2nd declension accusative plural in Doric had a short vowel (-ăs, -ŏs), leading to accentuations such as:\n*  'honours',   'all' (for  ,  )\nAnother characteristic of Doric was that the endings   and perhaps  , and in verbs 3rd pl.   and   (derived from an earlier *-ont and *-ant) counted as long, leading to a paroxytone accent in:\n*  'philosophers',   'called',   'they gave',   'they said'\nDoric speakers also apparently pronounced a circumflex on certain genitive plurals, which were paroxytone in other dialects:\n*  'of boys',   'of Trojans',   'of all',   'of others'\nIn Doric the future was also accented non-recessively in all verbs:\n*  'I will say',   'I will do'\nSee also\n* Pitch-accent language\n* Syllable\n* Delphic Hymns\n* Mesomedes\nReferences\nNotes\nBibliography\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*  |reference = Probert, Philomen (2018). [https://classicalstudies.org/annual-meeting/147/abstract/accenting-sequences-enclitics-ancient-greek-rediscovering-ancient-rule \"Accenting Sequences of Enclitics in Ancient Greek: Rediscovering an Ancient Rule\"]. Abstract of paper to be read at Society for Classical Studies Annual Meeting.}}\n*\n*\n*\nExternal links\n* [https://www.oeaw.ac.at/kal/agm/ Prayer to Calliope and Apollo]. Sung to the lyre by Stefan Hagel."
    }
  ]
}