{
  "content": [
    {
      "type": "text",
      "text": "# Ancient History (play)\n\nAncient History is a two-act play written by American playwright David Ives.\nProduction\nAncient History premiered Off-Broadway in May 1989 in a production by Primary Stages, with direction by Jason McConnell Buzas and the cast of Beth McDonald and Christopher Wells.\nA revised edition was presented Off-Broadway by Primary Stages in June 1996, with direction by John Rando and a cast of Vivienne Benesch and Michael Rupert. New York Magazine describes Ancient History as “a genuine achievement [as] Ives spins a dance that is Strindberg with yuks … the dialogue is crunchy and saucy [as] these lovers are buffeted about circularly, hilariously, and scarily.”\nPlot\nThe play opens with the ominous ringing of an off-stage telephone. As the lights come up Ruth and Jack, a couple in their mid-thirties, are dancing in their apartment. The telephone rings again, the couple stops, the music backs up a few measures and they begin to dance. Ruth and Jack dance on and converse about what a good time they are having; after a few lines the telephone rings, the music backs up a few measures and the conversation also goes back a few lines and this time changes direction. A few lines go by and the phone rings again, and the conversation once more rewinds and restarts, yet again changing focus. This pattern of rewinding and restarting the conversation in a different vein continues throughout the play whenever the unseen telephone rings. This convention is similar to the bell ringing in Ives's previous work Sure Thing (one of six plays in the collection All in the Timing). As the play progresses the audience learns that the couple is in a tenuous state in their relationship and the happiness seen as the play opens is not the prevalent mood. Ruth is Jewish; Jack is a former Catholic. Ruth believes in hard work and success; Jack is lazy and has no goals. Ruth desperately wants to be married; Jack hates the idea of marriage. With each ring of the phone, the love affair dissolves into a more intense argument about religion, the future or marriage; however, this does not prevent a build-up of hope with each ring that perhaps the couple may work out their differences and come to an agreement. At one point Ruth and Jack even switch positions: Jack argues for marriage, Ruth argues against it, and it is this final argument that leads to the dissolution of their relationship. After a slew of “fuck you’s” from Jack and “leave’s” from Ruth, the two realize they can no longer be together, but they also do not know how to function without one another. The play ends with a final phone ring and the couple beginning to dance as they did in the start of the play.\nReferences"
    }
  ]
}