{
  "content": [
    {
      "type": "text",
      "text": "# Ancient Mihintale Hospital Complex\n\nThe Ancient Mihintale Hospital Complex (Sinhala: පැරණි රෝහල) is an archaeological site in Sri Lanka. Built by King Sena II from 853-887 A.D, it is considered one of the oldest hospital ruins in the world and the oldest existing hospital ruins in Sri Lanka.\nBackground\nThe earliest records of hospitals in Sri Lanka show that they were built by Pandukábhaya in the 4th Century BC at various places throughout his kingdom. These consisted of lying-in-homes or homes of delivery for expectant mothers, as well as general hospitals for the treatment and care of the sick.On the tenth day of the waxing moon in the month of Mändin (February–March) in the first (regnal) year of His Majesty Abhā Salamevan; I, Sata of Galupula, the Body-Guard, I, Sangi of Kelala, who both came by commission of Perarad Mihindu, and I, Kudasala Kasubdet who came by commission of the Senior Scribe and Chief Guardian Sena, all of us, the executive officers of the Department of the Body-Guard, who came here, granted these immunities sanctioned by the Supreme Council as commanded (in repect of Kelägama) to the effect that the Mañggiva, Piyagiva, Melatti officers of the royal household, the officials of the Two Secretariats, and of the Two Treasuries shall not enter Kelägama which belongs to the General Hospital, situated in the District of Käranã; also carts, oxen, and men shall not be appropriated (for free service) from this village. If there be anyone who violates these commands, may he be born a dog or a crow. Archaeological excavations show that the Ancient Mihintale hospital is a complex structure. The site has been noted by UNESCO as drawing a parallel with Medieval Christian churches in Europe in building a separate infirmary for aged and sick priests. According to archaeologist W.I Siriweera, the Mihintale hospital complex can be divided into four categories:\n# Monastic hospitals where in-house treatment was provided for ailing monks for short or long periods\n# Hospitals where in-house treatment was provided for laymen\n# Maternity homes\n# Hospitals where only outdoor treatment was provided\nMedical items such as mortar and pestles, vessels, instruments, and a medicinal trough were also found at the site. The medicinal trough (Sinhala: බෙහෙත් ඔරුව, Beheth Oruwa) is a sarcophagus-like stone object found in the inner court of the hospital complex. It has a length of 2.16m, a width of 0.76m, and a height of 0.59 m. It was used to treat patients by lying them inside and submerging them with medicinal oil and herbs.\nReferences"
    }
  ]
}