{
  "content": [
    {
      "type": "text",
      "text": "# Ancient Portugal\n\nThis article covers the history of ancient Portugal. It includes the period between Prehistoric Iberia and the County of Portugal established in the mid-ninth century.\nPre-Roman people\nNumerous Pre-Roman people of the Iberian Peninsula inhabited the territory now known as Portugal. Prior to Roman rule, Iberia was home to many Phoenician colonies, including Gades (Cádiz), Baria (Villaricos), Malaca, and Toscanos. Other inhabitants included  Iberian and Celtiberian tribes. While, the mythical city of Tartessos is considered the “cultural horizon” from the interacting “indigenous substratum in the area and several waves of Phoenician population” that created the Tartessian identity. Many Phoenician settlements in Spain were later influenced by Carthage (the “new Tyre”) in 814 BC, with cultural and traditional linkages to the colony.\nRoman rule (3rd century BC – 4th century AD)\nAncient Roman mosaic in Conimbriga.\nAfter Carthage’s defeat in the first Punic War (264–241 BC) the Carthaginians were expelled from their coastal colonies and instead focused on expanding their territory in south-eastern Spain which resulted in the founding of Carthago Nova in 228–227 BC. Their increased influence along the Mediterranean coast threatened Massalia and Rome which led to the creation and signing of the Ebro treaty.\nHowever, after the siege of Saguntum led by Hannibal in 219 BC and the breaking of the Ebro treaty in 218 BC, Rome declared war against Carthage. Within 200 years, almost the entire peninsula had been annexed to the Roman Republic, starting with the Romanization of Hispania and ending with an eventual Roman victory that resulted in an allied Iberia under one authority.\nThe Roman conquest of what is now part of modern-day Portugal mainly took place in the south and east of the peninsula, where the Romans’ goal was to assist and win Spanish tribes to their side, while driving the Carthaginians out of Spain. Among those tribes, the Romans found friendly natives, the Conii.The period after Carthaginian defeat was followed by the First Celtiberian War in 179 BC and the Lusitanian War in 155 BC. Rome suffered a severe setback from the guerrilla war tactics employed by Viriathus, a Lusitanian general. Under the his leadership of Viriathus, the Lusitanians and other native Iberian tribes were brought together. With “the entire western Iberia under his command” they held off the Romans for eight years. Rome sent numerous legions and its best generals to Lusitania to quell the rebellion, but to no avail&nbsp;— the Lusitanians kept conquering territory. In 140 BC the Roman governor of Ulterior, Quintus Servilius Caepio decided to change their strategy He bribed Viriathus' ambassadors and friends, Audax, Ditalcus and Minurus, to kill him. With Viriathus’ assassination in 139 BC, the resistance was soon over.\nRome installed a colonial regime. During this period, Lusitania grew in prosperity and many of modern-day Portugal's cities and towns were founded.  The complete Romanization of the Iberian Peninsula Portugal took two centuries and was marked by the end of the Cantabrian Wars (29–19 BC) that were started during the rule of the Roman emperor Augustus. The Romanization was stronger in the south, most likely due to the administrative dependencies of the Roman city Pax Julia, currently known as Beja. The city was named Pax Julia in honor of Julius Caesar and to celebrate peace in Lusitania. In 27 BC, Lusitania gained the status of Roman province. Augustus renamed it Pax Augusta, but the previous name prevailed. Later, a northern province of Lusitania was formed, known as Gallaecia, with its capital in Bracara Augusta, today's Braga.\nNumerous Roman sites are scattered around present-day Portugal where large urban remains, such as Conimbriga and Mirobriga, can be found. Several works of engineering, including baths, temples, bridges, roads, circuses, theatres and layman's homes are preserved throughout the country. Sarcophagi, ceramics, and coins, some of which were coined in Portuguese land, are numerous. Past historians who reported on the final years of Roman rule and on the arrival of the Germanic tribes include Paulus Orosius (c. 375-418) and the bishop of Aquae Flaviae Hydatius (c. 400–469).\nGermanic kingdoms (5th–7th centuries)\nGermanic kingdoms in Iberia (red and green), 560.\nIn the early 5th century, Germanic tribes invaded the peninsula, namely the Suevi, the Vandals (Silingi and Hasdingi) and their allies, the Sarmatians and the Alans. In 456–7, another wave of Germanic invaders, the Visigoths, invaded western Spain and the region of Galicia. Only the kingdom of the Suevi (Quadi and Marcomanni) endured, whereas the Visigoths were successful in \"eliminating the southern Vandals and scattering the Alans.\" The Visigoths eventually conquered the Suevi kingdom and its capital city Bracara in 584–585.\nThe Germanic tribe of the Buri also accompanied the Suevi in their invasion of the Iberian Peninsula and colonization of Gallaecia (modern northern Portugal and Galicia). The Buri settled in the region between the rivers Cávado and Homem, in the area known thereafter as Terras de Boiro or Terras de Bouro (Lands of the Buri).\nOther minor influences from this period include 5th century vestiges of the Alan settlements, which were found in Alenquer, Coimbra and even Lisbon.\nSee also\n*National Museum of Archaeology (Portugal)\n*Suebic kingdoms\n*Visigothic kingdoms\nReferences"
    }
  ]
}