{
  "content": [
    {
      "type": "text",
      "text": "# Ancient aesthetics\n\nAncient aesthetics refers to the perception of beauty and form in the ancient world and the importance it was given in many ancient cultures.  and Aristotle, School of Athens. Raffaello Sanzio.]]\nAesthetics Definition and History\nAesthetics is defined as the perception of art, design or beauty. Aesthetics is derived from the Greek word \"aisthetikos\"  defined as a perception of the senses. In aesthetics, there is a process of individual analysis, perception and imagination. Perception is defined as an individual's neurophysiological process of awareness and interpreting external stimuli. Therefore, aesthetics is highly subjective and differs by individual.\nAesthetics can also be used as a synonym to define taste or style encapsulating artistic expression and activities such as rhetoric, tone, harmony, painting, composition art and music. Aesthetics also encapsulates the look, feel, or sound of natural forms. Aesthetics also encompasses the science of how an individual or a society perceives, feels, senses or knows an external stimuli.\nAs a philosophy, aesthetics was developed in 18th century Germany by Emmanuel Kant. However, Greek and Roman philosophers such as Aristotle and Plato engaged in the rhetorical debate of aesthetic perception and properties as a separate branch of philosophy in defining the parameters of art and beauty. Ancient aesthetics shows the origin of aesthetic debate and influences modern aesthetic definitions.\nAncient civilization\nAncient is defined as an early historical period that is identified by the oldest known civilizations. Ancient history is the study of life and events during this period.\nCivilizations that fall under classification of ancient are: Ancient Greece (800 B.C. and 500 B.C.), the Incas (1438 A.D – 1532 A.D.), the Aztecs (1345 A.D – 1521 A.D), the Romans (550 B.C. – 465 B.C.), the Persians (550 B.C. – 465 B.C.), Chinese civilization (1600 B.C.E. – 1046 B.C.E.), Mayan civilization (2600 B.C. – 900 A.D.), Ancient Egypt (3100 B.C.E. – 2686 B.C.E.), Indus Valley civilization (3300 B.C. – 1900 B.C.) and Mesopotamia (3500 B.C. – 500 B.C.)\nAncient Greek aesthetics\nAncient or archaic Greece is the time period between 800 B.C. and 500 B.C.\nBeauty\nBeauty in ancient Greece (800 – 300 B.C.E.) was referred to as κάλλος. The history of ancient Greek aesthetics spans centuries. Philosophical theories of beauty through this era are proportion, functionality and form.\nGreeks Gods\nInfluence of beauty was derived from the gods. who took a divine human form and inspired their perception of beauty. Temples were created to worship gods, contained their lifelike images.\nForm\nAncient Greeks focused on the aesthetic form of the ideal human body. captured through the art. Sculptures were initially inspired by the monumental art of the Ancient Egyptians. Sculptures were considered at their peak of aesthetics when the human form was captured in a unique way and emphasized a divine or godlike quality. Proportion, poise and perfection of the human form were the artistic and aesthetic ideals. Stone and bronze monuments are iconic of this civilization.\nAncient Egyptian aesthetics\nBeauty\nAncient Egyptians regarded physical beauty of the utmost importance and performed rituals to enhance their appearance. Recovered artifacts support ancient Egyptian beauty ideals including makeup, copper and silver handheld mirrors, and combs. Makeup was created using siltstones palettes to grind minerals such as green malachite or kohl. Human hair was used to create extensions and wigs. Jewelry enhanced beauty such as a string of beads and carnelian pendants in the shape of poppy heads.\nThe afterlife and tombs\nThe Ancient Egyptians believed in an afterlife. Tombs were created for the dead and decorated with the highest form of their aesthetic principles. Mummy masks and coffins emphasized painted eyes lined with dramatic black outlines.\nReferences"
    }
  ]
}