{
  "content": [
    {
      "type": "text",
      "text": "# Ancient harbour of Samos\n\nThe ancient harbour of Samos was located at the town of Samos (modern Pythagoreio) on the island of Samos. It consisted of a large mole, which was identified in the fifth century BC ancient Greek historian Herodotus as one of three greatest feats of engineering in the Greek world. Large parts of the ancient mole seem to survive, partially incorporated into the modern mole, but these remains are very difficult to date.\nHistory\nThe island of Samos became one of the major naval powers in the Aegean in the sixth century BC, culminating in the reign of the tyrant Polycrates. In the fifth century, Herodotus reports a mole surrounded the harbour, with a length of more than two stades out to sea (over 400 metres), and reached a depth of twenty orguia (c. 20 metres).\nThe island's political power declined in the fifth century BC. However, the harbour continued to be a major naval base and an important economic hub, especially under Ptolemaic rule during the Hellenistic period and in the Roman imperial period. It was seriously damaged by an earthquake in AD 262. The modern mole of Pythagoreio was built in the 19th century.\nDescription\nPythagoreio has a large natural harbour, but it is very open to the south, so the fierce northerly winds pose a threat to shipping in port. The ancient mole extended due east from the western edge of the harbour, in order to shelter the harbour from these winds.\nThe remains of a stone structure are submerged to the south of the modern mole of the harbour, running parallel to it and partially incorporated into it. Archaeological research has revealed a mole that is  long. At its eastern end, the mole upper surface of the structure is  below the surface and it continues down below the modern sea bed to a depth of at least  below sea level. A number of loose architectural components have been recovered, including two ashlar blocks and a column drum.\nThe structure was repeatedly damaged by storms and earthquakes in antiquity and repaired by piling new stones on top of the old ones, making it very difficult to date. Pottery remains recovered in the foundations of the mole mostly date to the Roman imperial period, with the earliest material dating to c. 300 BC. The excavator, Angeliki Simossi thus dated the surviving structure to the early Hellenistic period, making it later and larger than that described by Herodotus. She suggested that the structure known to Herodotus might be underneath the surviving remains, perhaps in the northern section which is covered by the modern harbour mole. Subsequent excavations suggested that some of this structure might be part of the 19th century construction work, but it overlies a Byzantine sea wall, which itself overlies an ancient rubble mole. Further traces of an ancient rubble mole have been found on the east side of the modern mole, but very little could be discerned about it.\nExcavations\nIn 1988, the modern breakwater of Pythagoreio collapsed and signs of the ancient mole were discovered in the course of repair work. An underwater excavation was undertaken from 8 September-14 October 1988 by a team of eleven divers from the Ephorate of Underwater Antiquities under the direction of Angeliki Simossi. Further excavations were undertaken by Simossi from 1992-1996 and substantial additional pottery remains were recovered during harbour works in 2009.\nReferences\nBibliography\n*\n*\n*\n*\n*"
    }
  ]
}