{
  "content": [
    {
      "type": "text",
      "text": "# Ancient Diocese of Sisteron__disambig_1\n\nConcathédrale Notre-Dame-et-Saint-Thyrse, Sisteron]]\nThe former French diocese of Sisteron existed until the French Revolution. Its see was at Sisteron in southern France and at Forcalquier, in the modern department of Alpes-de-Haute-Provence.  Sisteron was the only diocese in France which had two cathedrals.  Each cathedral had a Chapter, and the two Chapters voted together when an election was held to elect a new bishop of Sisteron.  The diocese of Sisteron was part of the ecclesiastical province of Narbonensis Secunda, whose Metropolitan was the Archbishop of Aix-en-Provence.\nHistory\nIn 374, the town of Sisteron belonged to the Province of Gallia Narbonensis Secunda, and held the rank of sixth place.\nIn 890, the bishops of Provence assembled in the Council of Valence, under the leadership of the archbishops of Lyon, Arles, Embrun, and Vienne. The bishops took note of the fact that Archbishop Bernoin of Vienne had been to Rome to complain to the pope of the increasing disorder of the kingdom since the death of Charlemagne. They singled out the invasions of the Northmen and of the Saracens, who had caused the depopulation of the entire area. On 7 July 1057, Pope Victor II wrote a letter of privileges for Archbishop Winimann (Viminien) of Embrun. In the bull, the Pope took note of the invasion, occupation, and devastation of the city of Embrun by the Saracens. Embrun had also been a place of refuge for undisciplined people fleeing from other localities. Sisteron is a distance of some 52 miles from Embrun, and on the main route of invasion from Aix and Marseille. The whole of Provence, in fact, suffered from similar difficulties in the eighth and ninth centuries. This may account, at least in part, for the absence of names of any bishops of Sisteron in the 8th century, and the dubious nature of those in the 9th.\nIn 1400 and 1401 the Dominican friar, Vincent Ferrer of Valencia, preached in Sisteron.\nIn the second half of the fifteenth century Sisteron was particularly subject to pestilence. There were outbreaks in 1451, 1458, 1467, 1474, 1479, and 1482. The population was reduced by two-thirds. It returned in 1503, and the people fled. Even the Cathedral Chapter left, taking up residence at Aubignosc until 1508. In 1675 the city of Sisteron had a population estimated at some 3,000 persons, and the diocese had ninety-two parishes. In 1764, the guess as to the population had been revised to 4,000 persons but the diocese contained only eighty parishes.\nIn 1789, before the Revolution the Cathedral Chapter of Sisteron consisted of a Provost, twelve Canons, and  twelve beneficiaries (two of whom were curés). But, in the fifteenth century, only two of them were resident in Sisteron; the rest were functionaries of the Roman Curia in Avignon. In 1764 there were three dignities (dignités) and seven Canons. They were all abolished by the Civil Constitution of the Clergy in 1790 and by the confiscation of church property.  The Canons of Sisteron were officially notified of their suppression on 6 December 1790 by the municipal authorities.  The Chapter of the co-cathedral of Forcalquier were similarly notified.  Bishop de Bovet was also notified, but he replied that he could not comply since he had no bishop or other competent authority into whose hands he could commit his charge.\nOn 20 March 1791 the electors of the 'département' of Basses-Alpes, into which Sisteron had been swept,  met at Digne to choose a new bishop.  On the third ballot they elected Jean-Baptiste-Romé de Villeneuve, the sixty-four year old curé of Valensole as their Constitutional Bishop. On 2 June he was consecrated in the Cathedral of Nîmes by Constitutional Bishop Charles-Benoît  Roux.  By 1795 most of the people had abandoned the Constitutional Church and returned to their old allegiances.  Villeneuve died on 23 December 1798 without having reconciled with Rome.\nAfter the Concordat of 1801 negotiated by First Consul Bonaparte and Pope Pius VII, the diocese of Sisteron was suppressed by papal authority (not the false authority of a civil government), and its territory was assigned to the diocese of Digne.G-Catholic,  [http://www.gcatholic.org/dioceses/diocese/sist0.htm Diocese of Sisteron, France]\nBishops\nto 1000\n* [Chrysaphius (ca. 449–452)]\n* Johannes I (500–516 ?)\n* Valerius (517)\n* Avolus (ca. 541–554)\n* Genesius (573)\n* Pologronius (584–585)\n* Secundinus (I.) (614)\n* Johannes (II.) (812–860)\n: Viventius (ninth century)\n: Magnibert (ninth century)\n: Amantius (ninth century)\n: Secundinus II. (ninth century)\n: Virmagnus (ninth century)\n* Bonus (867)\n* Vincentius (end of ninth century)\n:? Eustorgus (tenth century)\n* Arnulphus (c. 925 ?)\n* Johannes (III.) (mid-tenth century)\n* Ours (967)\n:? Rudolf (I.) (981)\n1000 to 1400\n* Frodo (999–1015?)\n* Durandus (1015 ?–1020 ?)\n* Pierre (I.) (1023–1043)\n* Géraud ? (1031 ?–1045 ?)\n* Pierre (II.) (1043)\n* Gérard (I.) Chevrier (1060–1080 ?)\n* Carolus (1082)\n:...\n* ? Nitard (end of eleventh century)\n:...\n* Bertrand (I.) (1102 ? – 1105 ?)\n:...\n* Gerardus (II.) (1110–1124)\n* Raimbaud, O.S.B. (1125 ?–1145)\n* Pierre de Sabran (1145–1171)\n* Bertrand (II.), O.Cart. (1172–1174)\n* Bermond d'Anduse (1174–1214)\n: Sede vacante (1214–1216)\n* Rodolphe (II.), O.Cist. (1216–1241)\n* Henri de Suze (1244–1250)\n* Humbert Fallavel, O.P. (1250–1256)\n* Alain de Lusarches (1257–1277)\n* Pierre Giraud (1277–1291)\n* Pierre d'Alamanon, O.P. (1292–1304)\n* Jacques Gantelmi (1306–1310)\n* Raimond d'Oppède (1310–1328)\n* Rostan (I.) (1328–1348)\n* Pierre Artaudi, O.P. (1349–1360)\n* Gérard (III.) (1362–1369)\n* Ranulphe de Gorze (1370–1382) (Urbanite)\n* Artaud de Mélan (1382–1404)(Clementine)\n* Antoine de Viale (1383–1386) (Urbanite)\nfrom 1400\n* Nicolas Sacosta, O.Min. (1404–1414)\n* Robert du Four (1414–1437)\n* Mitre Gastinel (1437–1440)\n: [Raimond Talon (1437)]\n: Gaucher de Forcalquier (1440–1442)\n* Charles de Borna (1442–1456)\n* Jacques Radulphi (1456–1463)\n* André de Plaisance (1463–1477)\n* Jean Esquenart (1477–1492)\n* Thibaud de la Tour d'Auvergne (1493–1499)\n* Laurent Bureau (1499–1504)\n* Pierre Filholi (1504–1506)\n* François de Dinteville (1506–1514)\n* Claude de Louvain (1514–1520)\n* Michel de Savoie (1520–1522)\n* Claude d'Aussonville, O.S.B. (1523–1531)\n* Antoine de Narbonne, O.S.B. (1531–1541)\n* Albin de Rochechouard (1542–1543)\n* Émeric de Rochechouard (1543–1580)\n* Antoine de Couppes, O.S.B. (1582–1606)\n* Toussaint de Glandevès (1606–1648)\n* Antoine d'Arbaud (1648–1666)\n* Michel Poncet (1667–1675)\n* Jacques Potier (1677–1681)\n* Louis de Thomassin (1682–1718)\n* Pierre-François Lafitau (1720–1764)\n* Louis-Jérôme de Suffren (1764–1789)\n* François de Bovet (1789–1801)\nSee also\n* Catholic Church in France\n* List of Catholic dioceses in France\nReferences\nBibliography\nReference works\n* pp.&nbsp;631–632. (Use with caution; obsolete)\n*  (Use with caution; obsolete)\n*\n*  (in Latin) pp.&nbsp;454.\n* (in Latin) p.&nbsp;239.\n* p.&nbsp;310.\n* pp.&nbsp;318.\n* pp.&nbsp;359.\n* p.&nbsp;382.\nStudies\n*\n*\n*\n*\n* second edition (in French)\n*\n*\n*\n*"
    }
  ]
}