{
  "content": [
    {
      "type": "text",
      "text": "# Anda Monument\n\n| website       =\n| extra_label   =\n| extra         =\n}}\nThe Anda Monument, often erroneously referred to as the Anda Circle after the roundabout where it is currently located, is an obelisk monument situated on the boundary of Intramuros and Port Area in central Manila, Philippines. It was erected in honor of Simón de Anda y Salazar, Governor-General of the Philippines from 1770 to 1776. The Anda Circle, the roundabout, is an interchange system at the junction of Bonifacio Drive, Mel Lopez Boulevard, Andres Soriano Avenue (formerly Calle Aduana), and Roberto Oca Street.\nHistory\nThe Anda Monument, located in Manila, was erected through the collective efforts and funding of the Filipino people to honor the memory of Don Simón de Anda y Salazar, who served as Governor-General of the Philippines from 1770 to 1776.\nSimón de Anda is remembered for his leadership during the British occupation of Manila (1762–1764), when he organized a government-in-exile in Pampanga and led the Spanish-Filipino resistance against the British. His efforts symbolized Filipino loyalty to Spanish sovereignty at the time, but later came to represent resistance to foreign occupation in broader nationalist memory.\nThe monument not only commemorates a Spanish official, but also reflects the early stirrings of Filipino civic pride, as it was one of the first public monuments in the Philippines funded by popular subscription.\nThe original monument was erected in 1871 near the Pasig River under the order of Governor General Carlos Maria de la Torre as a form of public gratitude to Simón de Anda for his initiative in the resistance against the British occupation of Manila, which began in 1762. It was heavily damaged during World War II when the Japanese occupied Manila.\n, c. 1899]]\nAfter the war, the monument was moved to its present location at the rotunda and was retransformed into a monument circle. President Carlos P. Garcia recounted Anda's heroism and defense of Filipinos against Spanish abuses in his turnover speech on June 8, 1957.\nThe Anda Monument had previously shown signs of vandalism.\nOn October 7, 2020, the newly rehabilitated Anda Circle was unveiled. The monument was repainted with the same color as the original. Multi-colored lights and a fountain were also installed. The fountain was installed in a  diameter pool, and the 222 RGB LED lamps light up the water in various colors.\nPlanned relocation\nIn September 2014, the Department of Public Works and Highways (DPWH) announced its plan to dismantle the Anda Monument and convert the roundabout into a regular intersection to ease traffic congestion along Bonifacio Drive, the main thoroughfare for trucks going to and from the Port of Manila. The highways department also recommended relocating the monument to protect it from damage from possible accidents. The plan was accepted by the National Historical Commission, and the department coordinated to transfer the monument back to its original location in Plaza Maestranza within Intramuros near the Pasig River. However, the moving of the monument did not push through.\nIn February 2016, the DPWH said that the plan was cancelled, citing opposition from heritage conservationists led by the National Commission for Culture and the Arts and Senator Pia Cayetano to such plans.\nGallery\nWTMP Noel Gonong A-23.JPG|The Anda Circle with the monument as its centerpiece\nSimon de Anda Monument with Philbanking Building.jpg|The monument in 2014 prior to its 2020 renovation. The monument was heavily vandalized.\nPort Area, Manila South Harbor First Gate 24.jpg|The monument with the fountain\nPort Area, Manila South Harbor First Gate 25.jpg|Marker\nReferences"
    }
  ]
}