{
  "content": [
    {
      "type": "text",
      "text": "# Andhra King Taluka\n\n| music          = Vivek–Mervin\n| cinematography = Siddhartha Nuni\n| editing        = A. Sreekar Prasad\n| studio         = Mythri Movie Makers\n| distributor    =\n| released       =\n| country        = India\n| language       = Telugu\n| budget         = ₹60–70 crore\n| gross          =\n}}\nAndhra King Taluka is an upcoming Indian Telugu-language romantic drama film written and directed by Mahesh Babu Pachigolla and produced by Naveen Yerneni and Ravi Shankar Yalamanchili under Mythri Movie Makers in association with T-Series. The film stars Ram Pothineni, Upendra Rao, Bhagyashri Borse, Rao Ramesh, Murali Sharma and Rahul Ramakrishna.\nThe music was composed by the musical duo Vivek–Mervin, their debut in Telugu cinema, with cinematography and editing handled by stalwarts Siddhartha Nuni and A. Sreekar Prasad, respectively.\nAndhra King Taluka is scheduled to be released on 27 November 2025.\nPremise\nA heartfelt tribute to fan culture, the story follows Sagar (Ram Pothineni), an ardent fan whose life, relationships, and identity revolve around his admiration for his cinematic idol, 'Andhra King' Surya Kumar (Upendra).\nCast\nProduction\nDevelopment\nThe film was initially referred to as RAPO22. Directed by Mahesh Babu Pachigolla, who made blockbuster with Miss Shetty Mr Polishetty (2023), the film is planned as a large-scale Village drama.\nOn 12 October 2024, Ram Pothineni announced his next film, tentatively titled RAPO22 with director Mahesh Babu Pachigolla who made Miss Shetty Mr Polishetty (2023).\nOn 20 November 2024, Mythri Movie Makers officially announced Bhagyashri Borse as the female lead, marking her second Telugu film after Mr. Bachchan (2024). On 12 May 2025, The makers of the film revealed the first-look of Upendra, marking his return to Telugu cinema after Ghani. On 25 November 2024, music composer duo Vivek–Mervin were announced to be on board, marking their debut in Telugu cinema.\nFilming\nThe film was officially launched with a muhurtham on 21 November 2024 in Hyderabad. The launch event was attended by Gopichand Malineni, Hanu Raghavapudi, Venky Kudumula and other notable guests. Gopichand Malineni switched on the camera, Hanu Raghavapudi gave the first clap, and Venky Kudumula directed the inaugural shot, which featured Ram Pothineni alongside lead actress Bhagyashri Borse in a traditional muhurat scene.\nThe official Principal photography of the film was commenced from 6 december2024 in Hyderabad On the same day, the first look of the film featuring Ram Pothineni was also released. The next schedule of the film wrapped up after a 34-day non-stop shoot in Rajahmundry, during which Andhra Pradesh Cinematography Minister Kandula Durgesh visited the set.\nThe final schedule of the film commenced in Hyderabad, and was expected to continue for ten days. Following this, the team planned to shoot key daytime sequences, including the film's climax, over the next 20 days. Upon completion of this schedule, the principal photography was set to be wrapped up. On 1 November 2025, the Principal photography wrapped up.\nMusic\nThe soundtrack album and background score were composed by Vivek–Mervin, The music rights were acquired by T-Series (company). On 18 July 2025, the first single \"Nuvvunte Chaley\" was released, the song lyrics was written by Ram Pothineni, marking his debut as lyricist and sung by Anirudh. The second single “Puppy Shame” is released on 8 September 2025, with the lyrics by Bhaskarabhatla and vocals by Ram Pothineni. On 31 October 2025, the third single \"Chinni Gundelo\" is released, with the lyrics Krishna Kanth and vocals by Mervin Solomon and Satya Yamini.\n}}\n| extra_column = Singer(s)\n| total_length =\n| title1 = Nuvvunte Chaley\n| lyrics1 = Ram Pothineni\n| extra1 = Anirudh\n| length1 = 4:00\n| title2 = Puppy Shame\n| lyrics2 = Bhaskarabhatla\n| extra2 = Ram Pothineni\n| length2 = 3:26\n| title3 = Chinni Gundelo\n| lyrics3 = Krishna Kanth\n| extra3 = Mervin Solomon, Satya Yamini\n| length3 = 3:40\n}}\nMarketing\nThe film's official title was announced as Andhra King Taluka on 15 May 2025, coinciding with Ram Pothineni's birthday. To mark the occasion, the Title Glimpse were released. The teaser of the film was released on 12 October 2025.\nRelease\nTheatrical\nAndhra King Taluka is scheduled to released on 27 November 2025. Earlier it was scheduled to release on 28 November 2025 but it was pre-poned one day before the actual date.\nHome media\nThe digital streaming rights to the film were acquired by Netflix.\nReferences\nExternal links\n*"
    }
  ]
}