{
  "content": [
    {
      "type": "text",
      "text": "# André Richardson King\n\n}}\nAndré Richardson King is an African American designer and architect. After completing his education at the School of the Art Institute of Chicago, he worked at Skidmore, Owings & Merrill before beginning his own firm. King was part of a group of African American designers who had successful careers throughout major Chicago firms after taking advantage of the G.I. Bill to attend local design and art schools.\nEarly life and education\nA Chicago native, King was born in 1931. After completing his military service is the United States Air Force, King took advantage of the G.I. bill to attend local design and art schools. After receiving a diploma in architecture from Chicago Technical College, King continued on the University of Chicago and the School of the Art Institute of Chicago where he graduated with a Bachelor of Arts in education in 1959.\nCareer\nAfter graduation King joined the architecture firm Skidmore Owing & Merrill where he designed graphics, signage and informational systems. Primarily focusing on environmental design and architectural graphics, his work for clients including Harris Trust Bank and O'Hare airport made him a pioneer in this newly developing field. In addition to designing symbols for Harris Trust Bank and O'Hare airport, King also provided design services for the federal highway system Triangle Plaza off I-90, and Northwest Point Business Park in Elk Grove Village where his gateway signs still stands today.\nAfter nearly three decades with SOM where he rose to the level of Associate Partner, King left and began his own firm ARK Andre´ Richardson King Designers. In addition to his own firm, King is a longtime member of the Society of Experiential Graphic Design and a member of the American Institute of Architects.\nKing is currently an Honorary Consul of Barbados and has served as an honorary consul since 1974.\nRecognition\nKing was featured in the 2018 exhibition African American Designers in Chicago: Art, Commerce and the Politics of Race which took place at the Chicago Cultural Center.\nReferences"
    }
  ]
}