{
  "content": [
    {
      "type": "text",
      "text": "# Andronikos Doukas (co-emperor)\n\n| regent       = Nikephoros Diogenes(1070–1071)Michael VII Doukas(1071–1078)Konstantios Doukas(1071–1078)Constantine Doukas(1074–1078)\n| predecessor  =\n| successor    =\n| dynasty      = Doukas\n| father       = Constantine X\n| mother       = Eudokia Makrembolitissa\n| birth_date   =\n| death_date   =  or after 1081\n}}\nAndronikos Doukas (,  –  or after 1081), Latinized as Andronicus Ducas, was the third son of Byzantine emperor Constantine X Doukas (r. 1059–1067) and younger brother of Byzantine emperor Michael VII Doukas (r. 1071–1078). Unlike his other brothers, he was not named junior co-emperor by his father, and was raised to the dignity only by Romanos IV Diogenes (r. 1068–1071). He is otherwise relatively insignificant, and was not involved in the affairs of state to any degree.\nBiography\nAndronikos Doukas was born , the third son of Constantine X Doukas and Eudokia Makrembolitissa. He studied under Michael Psellos, and several works survive that were compiled by the prominent scholars of the day to aid him in his studies: one treatise on geometry by Psellos and two philosophical essays by John Italos. Psellos also compiled a laudatory monody on Andronikos after the latter's death.\nUnlike his other two surviving brothers (the elder, the future Michael VII Doukas, and the younger Konstantios Doukas, who was a porphyrogennetos), he was not raised by his father to the position of co-emperor. Thus, and unlike them, he did not participate in the short regency of Eudokia that followed his father's death in 1067. It was only Romanos IV, who married Eudokia and thus succeeded Constantine X, who raised him to co-emperor, perhaps at Eudokia's request. This was also done for political reasons: the multitude of co-emperors, which soon included the two sons of Eudokia by Romanos, weakened the position of Constantine X's children in favour of Romanos himself. Furthermore, during his absence from Constantinople on campaign in the East soon after his accession, Romanos took Andronikos with him as a virtual hostage.\nDuring the reign of his elder brother Michael VII, Andronikos continued as co-emperor, and was even possibly raised above Konstantios in precedence. Despite his apparent lack of ability and purely decorative function as co-emperor, Andronikos is included in some later lists of Byzantine emperors, coming between Romanos and Michael VII. It is unknown when he died; D. Polemis surmised that it was after 1081, but Thomas Conley argues that he died in early 1077, since he is not mentioned during Nikephoros Botaneiates's attack on Constantinople in the same year.\nAccording to Psellos's monody, Andronikos was married and his widow died soon after him. He had no descendants.\nReferences\nBibliography\n*\n*\n* }}\n*}}\n*"
    }
  ]
}