{
  "content": [
    {
      "type": "text",
      "text": "# Andrew Edward McKeever\n\n|birth_place=Listowel, Ontario, Canada\n|death_place=Toronto, Ontario, Canada\n|nickname=Hawkeye\n|allegiance=CanadaUnited Kingdom\n|branch=Royal Flying CorpsRoyal Air ForceCanadian Air Force\n|serviceyears=1914&ndash;1919\n|rank=Lieutenant Colonel\n|unit=\n|commands=No. 1 Squadron, C.A.F.\n|battles=World War I\n|awards=Distinguished Service OrderMilitary Cross & BarDistinguished Flying CrossCroix de Guerre (France)\n|relations=\n|laterwork=\n}}\nAndrew Edward McKeever DSO, MC & Bar, DFC (21 August 1894 &ndash; 25 December 1919) was a Canadian World War I two-seater flying ace who, in conjunction with his gunners, was credited with 31 victories. He was the highest scoring pilot on Bristol F.2 Fighter.\nEarly life\nMcKeever was born in Listowel, Ontario, Canada, to Bella Henderson and William McKeever, a grocer and butcher. After attending Toronto's Central Technical School, McKeever worked as a teller until 1916.\nMilitary service\nMcKeever joined the Queen's Own Rifles of Canada, a militia unit, as a private. He remained with them until November, 1916, when he was accepted into the Royal Flying Corps.  He sailed for England for training on 25 November 1916. He was commissioned a probationary lieutenant on 5 December.\nFollowing training, he was assigned on 28 May 1917 to No. 11 Squadron, which was flying obsolete F.E.2s. They re-equipped shortly thereafter with Bristol F.2A fighters, sometimes referred to as the Brisfit. Among McKeever's tasks were photographic reconnaissance, with his observer wielding a hand-held camera and taking the photos. Although the Brisfit could do this job well, it was as fast as the Fokkers that opposed it, as well as maneuverable enough to be flown like a single-seater.\nMcKeever began his career as an ace by destroying a D.V on 26 June 1917 and sending down another out of control. On 7 July, he and Powell knocked down three more, with one destroyed and two falling uncontrollably out of the battle. McKeever would repeat this feat of triple victories on three more occasions, on 5 August, 23 September, and 31 October 1917.\nOn 3 October, when his score reached 20, Lieutenant McKeever was awarded a Bar to the Military Cross he had gained a month prior.\nOn 30 November 1917, while flying Brisfit A7288, he ended his career by attacking two German two-seaters protected by a flight of seven Albatros D.Vs. The D.Vs paid dearly for their protective role, as McKeever and Powell destroyed four of them, one of which burned. When Powell's gun failed, McKeever feigned being shot down and dived out the battle. He leveled off at only 25 feet altitude and, hidden from enemy planes by a shield of fog, hightailed for home. The remaining Germans broke off contact. This epic battle earned the Distinguished Service Order for Captain McKeever.\nMcKeever would score all 31 of his victories while flying the two-seater fighter, becoming one of the RFC/RAF's leading two-seater fighter pilot ace. All but two of those triumphs were over German Albatros D.V fighters. Seven different gunners/observers shared his victories. One of these, Lieutenant Leslie Powell, became an ace in his own right, with 19 successes, 18 of which were in tandem with McKeever.\nMckeever and his gunners's 31-claim tally consisted of 18 destroyed and 13 'out of control'.\nOn 25 January 1918, both pilot and observer were withdrawn from combat and shipped home. Major McKeever joined fellow aces William Bishop and Raymond Collishaw in establishing the Canadian Air Force. McKeever organized No 1 Squadron of the new air force, and served as its commanding officer. The war ended before the new squadron could take its Sopwith Dolphins to battle. Canada's government then dissolved the fledgling air force.\nWith war's end, McKeever accepted a job managing an airfield at Mineola, New York. Before he could start work, he was involved in an auto accident in his home town of Listowel. He broke his leg, complications set in, and he died of cerebral thrombosis on Christmas Day, 1919.\nText of citations\nMilitary Cross\n\"2nd Lt Andrew Edward McKeever, R.F.C., Spec. Res.\nFor conspicuous gallantry and devotion to duty, particularly when on offensive patrol. He attacked eight enemy aircraft single-handed at close range, and by his splendid dash and determination destroyed one and drove five down completely out of control. He had previously shown exceptional fearlessness in attacking the enemy when in superior numbers, and in the space of three weeks he destroyed eight hostile machines, setting a very fine example to his squadron.\"\nBar to Military Cross\n\"Lt. Andrew Edward McKeever, M.C., R.F.C., Spec. Res.\nFor conspicuous gallantry and devotion to duty in aerial combats. He has recently destroyed five enemy aeroplanes and driven down six out of control. On one occasion he encountered five enemy scouts, and drove down two out of control. Later, while leading a patrol, he engaged nine enemy scouts. He destroyed two, drove down one out of control, and dispersed the remainder. His dash and determination have been a fine example to his squadron.\"\nDistinguished Service Order\n\"2nd Lt. (T./Capt.) Andrew Edward McKeever, M.C., R.F.C., Spec. Res.\nFor conspicuous gallantry and devotion to duty. While on patrol by himself over the enemy's lines in very bad weather he encountered two enemy two-seater machines and seven scouts. By skilful maneuvering he engaged one and destroyed it. As he turned to get back to the lines five of the enemy dived on his tail and his observer engaged and destroyed two of them. After an indecisive combat with two others, he attacked and destroyed one of the enemy which had overshot him. He continued the fight with the remainder until he was within twenty feet of the ground, when the enemy machines climbed and left him. He has recently destroyed ten enemy machines and has shown great courage and initiative.\"\nReferences\nFurther reading\n*\nExternal links\n*\n*\n*\n*[http://www.amazon.com/gp/reader/091129502X/qid=1220084265/ref=sib_books_pg?ie=UTF8&keywords=Andrew%20McKeever&p=S00N&checkSum=A%252B0Cb%252Bb9GQiXCtkvonjMDm5taH%252FXnjio1NTuaM6keDg%253D Scale Aircraft Drawings: World War I]  (Accessed 30 August 2008) (log in required)"
    }
  ]
}