{
  "content": [
    {
      "type": "text",
      "text": "# Andrew Gray (19th-century divine)\n\n-->\n| baptised         =\n| birth_place      =\n| death_date       = 10 March 1861\n| death_place      =\n| buried           =\n| resting_place_coordinates =\n| nationality      =\n| religion         =\n| residence        =\n| parents          =\n| spouse           =\n| children         =\n| occupation       =\n| profession       =\n| education        =\n| alma_mater       =\n| motto            =\n| signature        =\n| signature_alt    =\n| coat_of_arms     =\n| coat_of_arms_alt =\n| feast_day        =\n| venerated        =\n| saint_title      =\n| beatified_date   =\n| beatified_place  =\n| beatified_by     =\n| canonized_date   =\n| canonized_place  =\n| canonized_by     =\n| attributes       =\n| patronage        =\n| shrine           =\n| suppressed_date  =\n| module           =\n| module2          =\n| other            =\n}}\nAndrew Gray (2 November 1805 – 10 March 1861), was a Scottish presbyterian divine.\nLife\nGray was born in Aberdeen on 2 November 1805, the son of William Gray.\nHe went first to a school kept by Gilbert, father of Forbes Falconer, and afterwards to Marischal College, where he graduated MA in 1824, and passed through the theological course (1824–8). He was licensed to preach by the Aberdeen presbytery 25 June 1829, and was ordained as minister of a chapel-of-ease at Woodside, near Aberdeen, on 1 Sept. 1831. Gray was from the first an orthodox evangelical, a vigorous supporter of reform in the Church of Scotland, and a pronounced enemy to all that savoured of Romish doctrine. He publicly defended the Anti-Patronage Society as early as 1825, and agitated for the Chapels Act, by which ministers of chapels-of-ease became members of presbyteries. In 1834 he was admitted under this act a member of the Aberdeen presbytery. On 14 July 1836, he was appointed minister of the West Church (one of three parishes contained within St John's in the city centre), Perth, where he remained until 1843. Gray was a very energetic leader in the controversies which resulted in the Disruption of 1843 and the foundation of the Free Church. A pamphlet by him, 'The present Conflict between Civil and Ecclesiastical Courts examined,’ Edinburgh, 1839, had a wide circulation and had great influence on the schism. On his secession from the Church of Scotland nearly all his congregation followed him to create the West Free Church Perth. His new church was opened 28 Oct. 1843.\nIn 1845, he drew up at the request of the Free Church leaders 'A Catechism of the Principles of the Free Church' (1845 and 1848), which involved him in a controversy with the Duke of Argyll. In December 1841, Gray was commissioned to visit Switzerland to express the sympathy of the Free Church with the suspended ministers of the Canton de Vaud; he extended his tour to Constantinople. In 1855, he was appointed Convener of the Glasgow Evangelisation Committee, and he was always active in home missions and in spreading education. Failing health made another long continental tour necessary in 1859. He died in Perth 10 March 1861.\nFamily\nOn 23 July 1834 he married Barbara Cooper (d.1894), daughter of Alexander Cooper.\nPublications\nRobert Smith Candlish collected nineteen of Gray's sermons, with memoir and portrait, under the title 'Gospel Contrasts and Parallels,’ Edinburgh, 1862.\n*Letter to the Rev. Henry Angus (Aberdeen, 1832)\n*The Chapel Question considered in a Letter to the Rev. George Cook, D.D. (Edinburgh, 1834)\n*The Objection to the Chapel Enactment of last Assembly (1835)\n*The Present Conflict between the Civil and Ecclesiastical Courts Examined (Edinburgh, 1839, many editions)\n*Substance of a Speech upon Patronage (Perth, 1841)\n*The Duty and the Liberty of Christian Church (Edinburgh, 1843)\n*Persecution — the Lairds, the Lawyers, and the Moderate Clergy against the Free Chxirch of Scotland (Perth, 1843)\n*Catechism on the Principles and Constitution of the Free Church (Edinburgh, 1845)\n*Our Sins, our Dangers, our Duties: an Address to the General Assembly of the Free Church (Edinburgh, 1848)\n*Letter to the Duke of Argyle (Edinburgh, 1848)\n*The Mary Worship of Rome (Dundee, 1861)\n*Gospel Contrasts and Parallels (Edinburgh, 1861)\n*Sermons, with a Memoir (1862)\n*Lecture XII. (on Establishments)\n*Sermon XXV. (Free Church Pulpit, i.\nReferences\nCitations\nSources\n*1861)|display=Gray, Andrew (1805–1861)|volume=23|no-icon=1}}\n*\n*\n*\n*\nExternal links\n*"
    }
  ]
}