{
  "content": [
    {
      "type": "text",
      "text": "# Andy Stewart (basketball)\n\n| birth_place =\n| nationality = Australian\n| coach_start = 2000\n| coach_end =\n| cyears1 = 2000–2013\n| cteam1 = Lakeside Lightning\n| cyears2 = 2009–2014\n| cteam2 = Perth Wildcats (assistant)\n| cyears3 = 2015–2020\n| cteam3 = Perth Lynx\n| cyears4 = 2026–\n| cteam4 = Cockburn Cougars (assistant)\n| highlights =\n* 2× NBL champion (2010, 2014)\n* 4× SBL champion (2005, 2006, 2009, 2013)\n* 2× WNBL Coach of the Year (2016, 2018)\n* 5× SBL Coach of the Year (2007, 2009–2011, 2013)\n}}\nAndy Stewart (born 23 May 1961) is an Australian basketball coach.\nEarly life\nGrowing up with his father in the Air Force, Stewart played multiple sports in a number of different locations. He first started playing basketball in Malaysia.\nIn the mid 1990s, Stewart began working as a coach with the Lakeside Lightning and Athletes in Action Australia.\nCoaching career\nLakeside Lightning\nIn 2000, Stewart became the inaugural head coach of the Lakeside Lightning in the State Basketball League (SBL), guiding them to a grand final berth in their first season. In 2005, he guided the Lightning to their first SBL title, later guiding them to three more championships in 2006, 2009 and 2013. He also earned recognition as the league's Coach of the Year five times between 2007 and 2013. He coached over 400 games for the Lightning. He was subsequently named the Assistant Coach of the 25 Year MSBL All-Star Team.\nPerth Wildcats\nBetween 2009 and 2014, Stewart served as an assistant coach for the Perth Wildcats under Rob Beveridge and Trevor Gleeson, helping the Wildcats win NBL championships in 2009–10 and 2013–14. In October 2013, he served as head coach of the Wildcats for one game in the absence of Gleeson.\nPerth Lynx\nIn April 2015, Stewart was appointed head coach of the Perth Lynx for the 2015–16 WNBL season. In his first season, he guided the Lynx to the grand final series and subsequently earned WNBL Coach of the Year honours.\nOn 23 April 2016, Stewart re-signed with the Lynx on a two-year deal. The Lynx returned to the finals in 2016–17 with a 15–9 record. In 2017–18, the Lynx had a 14-game win streak and finished atop the WNBL ladder. Stewart was subsequently named WNBL Coach of the Year for the second time.\nOn 5 July 2018, Stewart signed a two-year extension with the Lynx. He parted ways with the Lynx following the 2019–20 season.\nCockburn Cougars\nIn September 2025, after 12 years away from the SBL/NBL1 West, Stewart was appointed associate head coach of the Cockburn Cougars men's team for the 2026 NBL1 West season.\nOff the court\nStewart has served on both the Basketball WA Board and the SBL Commission. He also served as Lakeside Recreation Centre Manager, earning the 2003 WA Male Administrator of the Year at the Basketball Australia Junior Awards Presentations.\nIn August 2021, Stewart was inducted into the Basketball WA Hall of Fame.\nCoaching record\nWNBL\n|-\n| align=\"left\" | Perth\n| align=\"left\" |2015–16\n| 24\n| 16\n| 8\n|\n| align=\"center\" |2nd of 9\n|3\n|1\n|2\n|\n| align=\"center\" |Lost Grand Final\n|-\n| align=\"left\" | Perth\n| align=\"left\" |2016–17\n| 24\n| 15\n| 9\n|\n| align=\"center\" |3rd of 8\n|3\n|1\n|2\n|\n| align=\"center\" |Lost Semi Finals\n|-\n| align=\"left\" | Perth\n| align=\"left\" |2017–18\n| 21\n| 15\n| 6\n|\n| align=\"center\" |1st of 8\n|2\n|0\n|2\n|\n| align=\"center\" |Lost Semi Finals\n|-\n| align=\"left\" | Perth\n| align=\"left\" |2018–19\n| 21\n| 13\n| 8\n|\n| align=\"center\" |4th of 8\n|2\n|0\n|2\n|\n| align=\"center\" |Lost Semi Finals\n|-\n| align=\"left\" | Perth\n| align=\"left\" |2019–20\n| 21\n| 8\n| 13\n|\n| align=\"center\" |5th of 8\n|–\n|–\n|–\n|–\n| align=\"center\" |\n|-class=\"sortbottom\"\n| align=\"left\" |Career\n| ||111||67||44|||| ||10||2||8||\nReferences\nExternal links\n*"
    }
  ]
}