{
  "content": [
    {
      "type": "text",
      "text": "# Andy Woodward\n\n| birth_place    = Stockport, Cheshire, England\n| death_date     =\n| position       = Defender\n| years1         = 1992–1995 | clubs1 = Crewe Alexandra              |caps1 = 20   |goals1 = 0\n| years2         = 1995–2000 | clubs2 = Bury                                    |caps2 = 115  |goals2 = 1\n| years3         = 2000–2001 | clubs3 = Sheffield United            |caps3 = 3    |goals3 = 0\n| years4         = 2000–2001 | clubs4 = → Scunthorpe United (loan) |caps4 = 12   |goals4 = 0\n| years5         = 2001–2002 | clubs5 = Halifax Town                  |caps5 = 30   |goals5 = 1\n| years6         = 2002–2003 | clubs6 = Northwich Victoria        |caps6 = 8    |goals6 = 0\n| totalcaps      = 188 | totalgoals = 2\n}}\nAndrew Woodward (born 23 September 1973) is an English former professional footballer who played in the English Football League for Crewe Alexandra, Bury, Sheffield United, Scunthorpe United (two loan spells) and Halifax Town. Later a serving police officer, dismissed for gross misconduct in November 2016, he shortly after revealed he had been a victim of child sexual abuse, writing a book about his experiences.\nFootball career\nWoodward signed his first professional contract with Crewe in July 1992, and made his first team debut on 17 April 1993, coming on as a substitute in a Third Division match at Walsall; he made eight further substitute appearances that season including in the play-off final against York City at Wembley  on 5 May 1993. He made his first of 11 starts for Crewe on 17 August 1993, playing in a League Cup tie against Wrexham at Gresty Road. He made 14 appearances for Crewe during their promotion-winning 1993–94 campaign, but then made only two further substitute appearances for the Railwaymen.\nHe joined Bury on 13 March 1995 and played for the Lancashire club 135 times in five years. He scored his first league goal on 26 December 1998 against his former club, Crewe, in a 3–1 defeat at Gresty Road. He was then signed by Sheffield United in March 2000. He played only four games for the Blades, and had two loan spells at Scunthorpe, before joining Halifax Town in the summer of 2001. He scored his second league goal, for Halifax in a 2–2 draw against Carlisle United, on 29 March 2002. When Halifax went into administration in the summer of 2002, Woodward was sacked, and subsequently joined Northwich Victoria.\nPolice career\nAndrew Woodward joined the Lancashire police force after retiring from football, eventually leaving the force in November 2016. He was dismissed for gross misconduct following an inappropriate relationship with a family member of a victim.\nVictim of sexual abuse\nLater in November 2016, it was reported that Woodward had been a victim of repeated child sexual abuse by Barry Bennell (later convicted for sexual abuse) while a trainee at Crewe Alexandra in the 1980s. Woodward later claimed \"People should know I suffered more than one abuser\".\nIn Manchester on 5 December 2016, Woodward was one of five abuse victims at the launch of an organisation, the Offside Trust, to support player victims of abuse and their families. Initially a director of the Trust, Woodward resigned on 27 January 2017.\nIn October 2017, Woodward criticised Football Association chairman Greg Clarke for 'humiliating' remarks Clarke made to a Digital, Culture, Media and Sport Committee hearing, while the Professional Footballers' Association's chief executive Gordon Taylor said the PFA might sue Clarke over suggestions Taylor had not supported Woodward with further counselling.\nIn December 2017, two men from Crewe were jailed for 'trolling' Woodward on social media.\nIn June 2019, shortly before publication of Andy Woodward's autobiography Position of Trust, The Guardian reported that Barry Bennell's cousin, Ronald Bennell, had been jailed in 1971 for the rape and murder of Woodward's aunt, Lynda Stewart, and that Barry Bennell had married Woodward's older sister, also named Lynda, in 1991. The Guardian's coverage also said Woodward unsuccessfully sued Crewe for damages in 2004. Woodward's book was shortlisted for the 2019 William Hill Sports Book of the Year. Woodward's story was dramatised in the 2022 television film Floodlights, in which he is portrayed by Gerard Kearns and his younger self by Max Fletcher.\nReferences"
    }
  ]
}