{
  "content": [
    {
      "type": "text",
      "text": "# Andy Ward (rugby union)\n\n| birth_place      = Whangārei, New Zealand\n| height           =\n| weight           =\n| position         = flanker\n| amatyears1       = ?-1991\n| amatyears2       = 1991-1994\n| amatyears3       = 1994-2005\n| amatyears4       = 2005-2008\n| amatteam1        = Ōhaupō\n| amatteam2        = Hautapu RFC\n| amatteam3        = Ballynahinch RFC\n| amatteam4        = Belfast Harlequins\n| amatapps1        =\n| amatpoints1      =\n| ru_amateurupdate =\n| years1           = 1997-2005\n| clubs1           = Ulster\n| apps1            = 119\n| points1          = 95\n| ru_clubupdate    =\n| repyears1        = 1998-2001\n| repteam1         = Ireland\n| repcaps1         = 28\n| reppoints1       = 15\n| ru_ntupdate      =\n| school           = Melville High School\n}}\nAndy Ward (born 8 September 1970) is a New Zealand-born former rugby union player, who played flanker professionally for Ulster and internationally for Ireland.\nBorn in Whangārei, Ward attended Melville High School, where he first played rugby. He represented Ōhaupō at under-19 and senior level, and played for Hautapu for three years. He was selected for Waikato at 'B' level in 1991, and 'A' level in 1993. before joining Irish club Ballynahinch RFC in 1994. He so enjoyed his initial six-month stint that he returned the following season, as was made club captain. The club was promoted to senior status in his first season as captain, and later to the All-Ireland League.\nAfter the required three years' residence, Ward became eligible to play for Ulster, and made his debut for the province in 1997. The residence rule for provincial rugby was removed not long after. He was named Player of the Year and Personality of the Year at the 1998 Ulster Rugby Awards. He was part of the side that won the 1998–99 Heineken Cup. He was named captain in 2001 by coach Alan Solomons. He lifted the Celtic Cup in 2004, and was named Supporters' Club Player of the Year in the 2004 Ulster Rugby Awards. He made his 100th appearance against Leinster in 2004.\nWard made his debut for Ireland in 1998, scoring a try against Wales. He won 28 caps, including playing in the 1999 World Cup, and tours to South Africa, Australia, and Argentina, the USA and Canada. He also played for the Barbarians against South Africa in 1999.\nWard announced his professional retirement at the end of the 2004-05 season, having made 119 appearances for Ulster. The following season, he joined Belfast Harlequins as director of rugby, acting as player-coach until 2008.\nIn 2011, Ward became the strength and conditioning coach of the Antrim Gaelic Football team  He later ran a fitness studio in Dunadry, County Antrim, Northern Ireland. His son Zac is an Ireland Sevens international, who won the Men's Sevens Players' Player of the Year in the 2024 Rugby Players Ireland Awards, and joined Ulster in 2024. Another son, Bryn, is an Ireland under-20 international who joined the Ulster academy in 2024.\nReferences\nLinks\n*\n* [http://www.belfastharlequinsclub.com Belfast Harlequins]\n* [https://web.archive.org/web/20180805075313/http://hinchrfc.com/ Ballynahinch RFC]"
    }
  ]
}