{
  "content": [
    {
      "type": "text",
      "text": "# Anglican Diocese of North Queensland__disambig_1\n\n}}\n| province          = Queensland\n| metropolitan      = Archbishop of Brisbane\n| archdeaconries    =\n| deaneries         =\n| subdivisions      =\n| headquarters      =\n| coordinates       =\n| area_km2          =\n| area_sqmi         =\n| area_footnotes    =\n| population        =\n| population_as_of  =\n| parishes          =\n| churches          =\n| congregations     =\n| schools           =\n| members           =\n| denomination      = Anglican\n| rite              = }}\n| established       =\n| dissolved         =\n| cathedral         = St James' Cathedral, Townsville\n| patron            =\n| patron_title      =\n| priests           =\n| language          = English\n| calendar          =\n| music             =\n| parent_church     = Anglican Church of Australia\n| bishop            = }}\n| bishop_title      =\n| dean              = }}\n| archdeacons       =\n| emeritus_bishops  =\n| map               =\n| map_size          =\n| map_alt           =\n| map_caption       =\n| website           = [https://www.anglicannq.org/ Diocese of North Queensland]\n| footnotes         =\n}}\nThe Diocese of North Queensland is a diocese of the Anglican Church of Australia, founded in 1879. It is situated in the northern part of the state of Queensland, Australia. As part of the Province of Queensland, it covers the Torres Strait Islands in the north, the entire Cape York Peninsula and the cities of Mount Isa,  Cairns, Townsville and Mackay. The diocesan cathedral is St James' Cathedral, Townsville. The Bishop of North Queensland is Keith Ronald Joseph, who was consecrated and installed on 31 March 2019.\nStructure\nThere are 54 parishes in the diocese, supported by 120 licensed clergy as of February 2015. The diocese owns and operates St Mark's College, a residential college for men and women at James Cook University, Townsville.\nThe diocese extends its pastoral care through the following ministries:\n* Anglicare North Queensland\n* The Good Shepherd Nursing Home, Townsville (co-trustee)\n* The Good Shepherd Lodge (Aged Persons Home), Mackay\nThe Diocese of North Queensland supports of Wontulp-bi-Buya College in Cairns which specialises in indigenous adult education including theological studies. This college is an ecumenical venture and is the Queensland partner of Nungalinya College, Darwin.\nThe Bishop of North Queensland is Keith Ronald Joseph, who was consecrated and installed on 31 March 2019.\nEarly history of the diocese\nPrior to the establishment of the Diocese of North Queensland, the Anglican Diocese of Sydney had responsibility for all areas of Australia outside a diocese.\nThe Anglican Church commenced its ministry in the region in 1870 with the arrival in Townsville of James Adams, newly graduated from Moore Theological College in Sydney. As there were no church building in Townsville, services were conducted in the Townsville Court House until Adams could arrange for a church to be constructed.\nThe Diocese of North Queensland was established in 1879 from that part of the Diocese of Sydney lying north of 22°S latitude in the State of Queensland. In 1900 the Diocese of Carpentaria was formed from part of the northern area of the diocese, but in 1996 this action was reversed.\nBishops\nAssistant bishops\nAssistant bishops serving the Aboriginal people\n* Arthur Malcolm (bishop 1985–2000)\n* Jim Leftwich (bishop 2001–2010)\nAssistant bishops serving the Torres Strait Islander people\n* Ted Mosby (bishop 1997–2000)\n* Saibo Mabo (bishop 2002–2015)\nOther assistant bishops\n*Grosvenor Miles, who had been assistant bishop of Madagascar from 1938 to 1960, was assistant bishop of North Queensland from 1962 to his death in 1978. His ashes are interred under the High Altar of St James' Cathedral, Townsville.\n* George Tung Yep: on 12 October 1985, John Grindrod, Archbishop of Brisbane consecrated George Tung Yep (hitherto archdeacon) and Arthur Malcolm (Arthur Alistair Malcolm ; hitherto a canon) assistant bishops of the diocese. Tung Yep was ordained on 10 February 1955, and was appointed regional bishop in 1988.\n*Ian Stuart served as an Assistant Bishop of North Queensland from his 1992 consecration until 1998, during which time he was also, in a vacancy in the diocesan See, Bishop Administrator.\nReferences\nExternal links\n* [http://www.anglicannq.org/ Diocese of North Queensland website]\n* [https://web.archive.org/web/20080610031659/http://stjamescathedral.wordpress.com/ St James' Cathedral website]"
    }
  ]
}