{
  "content": [
    {
      "type": "text",
      "text": "# Anglo-Ethiopian Treaty of 1897\n\nThe Anglo-Ethiopian Treaty of 1897 (sometimes called the Rodd Treaty) was an agreement signed between the British and Ethiopian Empire, negotiated between diplomat Sir Rennell Rodd and Emperor Menelik II of Ethiopia. The treaty primarily focused on border issues between the two empires in Somali inhabited regions that they had expanded into over the previous decade. Signed in May 1897, the agreement saw the British cede large tracts of Somali territory to Ethiopia, without the consent or knowledge of Somalis that were legally under their protection.\nEthiopia's legal claim to much of the Ogaden going into the 20th century rested on the treaty, which was rejected by the Somali Republic when it gained independence in 1960.\nBackground\nDuring the 1880s, the armies of Emperor Menelik II of Ethiopia began pushing into the Somali inhabited Ogaden region. This coincided with British, Italian and French colonial advances into the Somali inhabited lands of the Horn of Africa. The large scale importation of European arms to Menelik completely upset the balance of power between the Somalis and the Ethiopian Empire, as the colonial powers blocked Somalis from receiving firearms under the Brussels Act of 1890, which Ethiopia was a signatory to. In response to the threat of Menelik's expansions, many clans in what became the protectorate of British Somaliland accepted British protection. The agreements dictated the protection of Somali rights and the maintenance of independence. In exchange for commercial privileges for British merchants in Ethiopia and the neutrality of Menelik II in the Mahdist War, the British signed a major agreement ceding large parts of Somali lands to Ethiopia, despite being a legal breach of the legal obligation made by the protectorate.\nThe treaty consisted of several articles, including:\n* Article I: allowed subjects from Ethiopia and British Somaliland to have full liberties in regards to commerce with each other.\n* Article II: defined the geographical boundaries between Ethiopia and British Somaliland.\n* Article III: specified keeping open the caravan route between Harar and the colonial port of Zeila.\n* Article IV: Ethiopia granted Great Britain favoured rights in respect to import duties and taxes.\n* Article V: allowed Ethiopian import of military equipment through British Somaliland.\n* Article VI: dealt with problems concerning Sudanese Mahdists.\nThis treaty was one of several concerning the borders of Ethiopia which were negotiated and signed in the ten years that followed the Ethiopian victory at the Battle of Adwa.\nThe boundary defined in this treaty was not demarcated until 1932, in response to Ras Tafari Makonnen's desire, which he expressed during his visit to Europe in 1924, to demarcate all of the boundaries of Ethiopia. E.H.M. Clifford explains that \"negotiations to this end proceeded slowly but on the whole surely, and at the end of 1930 reached the stage of definite preparations; but the Boundary Commission did not actually meet until 8 January 1932, at Berbera.\" Clifford afterwards participated in the subsequent demarcation, which extended from the Italian-British boundary demarcated in 1929–1930 at , west to the trijunction point where the boundaries of French Somaliland met Ethiopia and British Somaliland. Clifford describes the terrain and work of demarcation, with a map, in a paper he presented to the Geographical Society in 1935, although he omitted any mention of the most significant event of this project—the Italo-Ethiopian Walwal Incident.\nContents\nEnglish version of the treaty:\nHer Majesty Victoria, by the grace of God, Queen of Great Britain and Ireland, Empress of India, and His Majesty Menelek II, by the grace of God, King of Kings of Ethiopia, being desirous of strengthening and rendering more effective and profitable the ancient friendship which has existed between their respective kingdoms;\nHer Majesty Queen Victoria having appointed as her Special Envoy and Representative to His Majesty the Emperor Menelek II, James Rennell Rodd, Esq., Companion of the Most Distinguished Order of St. Michael and St. George, whose full powers have been found in due and proper form, and His Majesty the Emperor Menelek, negotiating in his own name as King of Kings of Ethiopia, they have agreed upon and do conclude the following Articles, which shall be binding on themselves, their heirs and successors:\nArticle I.\nThe subjects of or persons protected by each of the Contracting Parties shall have full liberty to come and go and engage in commerce in the territories of the other, enjoying the protection of the Government within whose jurisdiction they are; but it is forbidden for armed bands from either side to cross the frontier of the other on any pretext whatever without previous authorization from the competent authorities.\nArticle II.\nThe frontiers of the British Protectorate on the Somali Coast recognized by the Emperor Menelek shall be determined subsequently by exchange of notes between James Rennell Rodd, Esq., as Representative of Her Majesty the Queen, and Ras Maconen, as Representative of His Majesty the Emperor Menelek, at Harrar. These notes shall be annexed to the present Treaty, of which they will form an integral part, so soon as they have received the approval of the High Contracting Parties, pending which the status quo shall be maintained.\nArticle III.\nThe caravan route between Zeyla and Harrar by way of Gildessa shall remain open throughout its whole extent to the commerce of both nations.\nArticle IV.\nHis Majesty the Emperor of Ethiopia, on the one hand, accords to Great Britain and her Colonies in respect of import duties and local taxation, every advantage which he may accord to the subjects of other nations.\nOn the other hand, all material destined exclusively for the service of the Ethiopian State shall, on application from His Majesty the Emperor, be allowed to pass through the port of Zeyla into Ethiopia free of duty.\nArticle V.\nThe transit of fire-arms and ammunition destined for His Majesty the Emperor of Ethiopia through the territories depending on the Government of Her Britannic Majesty is authorized, subject to the conditions prescribed by the General Act of the Brussels Conference, signed the 2nd July, 1890.\nArticle VI.\nHis Majesty the Emperor Menelek II, King of Kings of Ethiopia, engages himself towards the Government of Her Britannic Majesty to do all in his power to prevent the passage through his dominions of arms and ammunition to the Mahdists, whom he declares to be the enemies of his Empire.\nThe present Treaty shall come into force as soon as its ratification by Her Britannic Majesty shall have been notified to the Emperor of Ethiopia, but it is understood that the prescriptions of Article VI shall be put into force from the date of its signature.\nIn faith of which His Majesty Menelek II, King of Kings of Ethiopia, in his own name, and James Rennell Rodd, Esq., on behalf of Her Majesty Victoria, Queen of Great Britain and Ireland, Empress of India, have signed the present Treaty, in duplicate, written in the English and Amharic languages identically, both texts being considered as official, and have thereto affixed their seals.\nDone at Adis Abbaba, the 14th day of May, 1897.\n(Signed) James Rennell Rodd.\n(Seal of His Majesty the Emperor Menelek II.)\nLegality\nEthiopia's claim on the Ogaden rested on the Anglo-Ethiopian Treaty of 1897. International law professor W. Michael Reisman observes:As a matter of law and fact, the 1897 treaty was void because it presumed an authority which the Somalis had never accorded to Great Britain. The Somalis gave no authority to the British to transfer Somali territory to another state. Ironically the British had committed themselves to protect Somali territory and this was the manifest reason for the Protectorate. In attempting to transfer the land to Ethiopia, the British were acting without competence, exceeding their jurisdiction and concluding an agreement without the participation of the central party.Reisman further notes that even had the treaty originally been valid, it would have been invalidated by Ethiopia's failure to commit to key legal obligations.\nImpact\nDespite the British transfer of large expanses of land belonging to the Somalis, the existence of the treaty was concealed from them and none had participated in the treaty. Largely due to the minimal presence and activity of Ethiopian forces in the region, Somalis remained largely unaware of the change in status. The Somali Republic denounced the treaty from the moment it was established in July 1960.\nNotes\nSources\n* Excerpts from the \"British Embassy, Addis Ababa\" by Richard Pankhurst\nBibliography\n*"
    }
  ]
}