{
  "content": [
    {
      "type": "text",
      "text": "# Anglo-Japanese Treaty of Commerce and Navigation\n\n|signatories=The Earl of Kimberley, John Wodehouse, Secretary of State for Foreign Affairs;\nViscount Aoki Shūzō, Minister for Foreign Affairs|image_alt=copy of the Anglo-Japanese Treaty of Commerce and Navigation|parties=British Empire; Empire of Japan\n|language=English\n}}\nThe  signed by Britain and Japan, on 16 July 1894, was a breakthrough agreement; it heralded the end of the unequal treaties and the system of extraterritoriality in Japan. The treaty came into force on 17 July 1899 and lasted until 26 July 1941, less than five months before attack on Pearl Harbor.\nWhen this treaty became effective, British subjects in Japan became subject to Japanese laws instead of British laws. The jurisdiction of the British Supreme Court for China and Japan, the British Court for Japan under it and consular courts in each treaty port ceased on that date, save for pending cases which were allowed to continue.  British subjects from that date became subject to the jurisdiction of Japanese courts.\nBackground\nIn February 1853 Russia discovered that a US fleet led by Commodore Matthew Perry was to leave Norfolk for Japan. Tsar Alexander II then organized an expedition and entrusted its command to Admiral Yevfimiy Putyatin. The Russian delegation arrived in Nagasaki on 12 August 1853, a month after the Americans, and began a series of negotiations that would lead to the signing of the Treaty of Shimoda with the Tokugawa Shogunate on 7 February 1855.\nThe American and Russian maneuvers however had not gone unnoticed. During a parliamentary question on 23 June 1854, Lord John Russell stated that the Governor of Hong Kong, Sir John Bowring, had been ordered to keep a close eye on Commodore Perry's activities in Japan. Commander of the East Indies and China Station James Stirling, however, did not consider such an initiative a priority at the time.\nThe outbreak of the Crimean War forced the British to review the project. Admiral Stirling was commissioned to capture or sink the Tsar's Pacific Fleet. The Admiralty made it a priority to prevent the Russians from using Japanese ports, but Stirling thought this was an excellent opportunity to make an agreement with the Land of the Rising Sun. When he arrived in the port of Nagasaki on 7 November 1854, he took the opportunity to enter into negotiations with the Japanese authorities. The negotiations mainly concerned war matters and regulated naval traffic in Japanese waters for the duration of the conflict, in effect almost closing the country again to foreign vessels.\nOn 14 October 1854, the Anglo-Japanese Friendship Treaty was signed, an agreement that did not, however, grant any obvious commercial advantages to the British.\nLord Elgin mission\n, 8th Earl of Elgin and 12th Earl of Kincardine]]\nThe 1854 Anglo-Japanese Treaty of Friendship received mixed opinions at home. The Foreign Office praised Admiral Stirling's work, and Grand Admiral James Graham himself paid tribute to him in Parliament, but the greatest criticism came from British citizens living in China, who hoped to intensify their business with the Japanese country. Subsequent British expeditions made it clear, however, that the agreements had granted considerable advantages to the Shogunate. The Japanese authorities wanted to control foreign trade and any transition had to take place under their supervision.\nIn August 1855 the Foreign Secretary Lord Clarendon entrusted Sir John Bowring, Governor of Hong Kong, with the task of claiming more significant commercial advantages for Britain in Japan. Still, the outbreak of the Second Opium War in China and the Sepoys' revolt in India forced Britain to concentrate its forces in these regions, delaying any possible action in the Rising Sun.\nThe war in China ended with the Treaty of Tianjin, signed for Britain by James Bruce, 8th Earl of Elgin, who was responsible for the burning down of the Summer Palace in Beijing. After signing the treaty with China, he was sent to Japan with a small fleet. His mission included the delivery of the steamship Emperor to the Shogun as a gift from Queen Victoria and the renegotiation of the previous treaty.\nYet subsequent negotiations highlighted the internal divisions within the Shogunate and the hostility of many Daimyo towards Westerners.\nThe new Anglo-Japanese Treaty of Amity and Commerce was signed in Edo on 26 August 1858. The concordat allowed foreign diplomats access to the interior of the country and enshrined the right of extraterritoriality. This stipulated that all British citizens who committed crimes against Japanese subjects or those of any other country were to be judged by consuls or other designated authorities under the laws of Great Britain.\nThe Internal Tension\nThe signing of the treaty was met with hostility from the Japanese people, who were opposed to the extension of foreign trade. The Japanese and British authorities found themselves unable to control their fellow citizens. Sailors, often drunkards and outsiders periodically harassed the natives while samurai aggression against westerners was increasing. The civilized population developed a real hatred for the foreigners and fervently wanted them removed.\nTherefore, being aware of the delicate situation in Japan and wanting to protect their own interests, the British tried to move cautiously. The new Consul General, Harry Parkes, endeavored to keep his country neutral in the growing rivalry between the Tokugawa Shogunate and the pro-imperial forces, which later exploded in the Boshin War.\nThe long negotiations\nThe Iwakura Mission\n. It was made 1872 in San Francisco. In the middle is sitting Iwakura Tomomi, the leader of the Japanese diplomats. From left to right, Kido Takayoshi, Yamaguchi Masuka, Iwakura Tomomi, Itō Hirobumi, Ōkubo Toshimichi.]]\nAfter the victory in the civil war, Emperor Mutsuhito began the complicated task of modernizing the country. In order to renegotiate the terms of previous treaties and better study western culture and technology, a great expedition around the globe was organized, led by Iwakura Tomomi.\nIn England, he held fruitful talks with Lord Granville, British Foreign Secretary, in November 1872, in which Japan was asked to modernize its laws before it could effectively renegotiate treaties and abrogate extraterritoriality. Modernizing Japanese institutions thus became a priority for the imperial government. Extraterritoriality had previously been imposed to protect British citizens, but by the time the Japanese had built a reliable system of laws that could also be observed by westerners, it would no longer have been necessary.\nThe modernization of Japan\nInternationally, all of the imperial government's efforts were concentrated on the abrogation of the so-called 'Unequal Treaties', which were in fact unilateral, non-reciprocal pacts that subscribed to an implicit subservience of the Japanese country to western nations.\nFor the British authorities, the extraterritoriality clause was necessary to protect British citizens in Japan from Japanese law, which was considered barbaric and excessively cruel. The fact that there were no clear rules and that the Daimyo had full legislative and judicial autonomy within their own fiefdom was a further obstacle.  Unknown to the British and other Westerners at the time, however, Japan had a long judicial history, beginning with the Seventeen-article constitution enacted on 6 May 604AD, and the legislative and judicial autonomy was a reflection of the confederate characteristic of the central government (Bakufu) in the Han system, in which Daimyo's were monarchs.\nNevertheless, it was therefore necessary for the imperial government to carry out substantial legislative, and judicial reform, in addition to the preparations for the new Meiji Constitution.\nIn 1871 a decree was issued abolishing the Han, the territories of the Daimyo, reorganizing them into prefectures, while in the same year the Mikado worked to reduce the death penalty and flogging. In May 1873, a new penal code was drafted that abolished torture, further reduced the use of capital punishment, and almost eliminated corporal punishment. However, these changes were not enough to ensure the abolition of extraterritoriality, which continued to be constantly discussed at the country's various embassies.\nThe popular opposition\nIn 1882, the Japanese public, also taking advantage of printing, began to mobilize to demand full judicial and tariff autonomy.&nbsp; On 15 June 1886, in order to satisfy the imperial authorities, an Anglo-German delegation presented a plan to introduce mixed courts in the country to supervise cases between two parties of different nationalities. Such an initiative had already been successfully tested in Egypt and it was assumed that it could represent a further step towards the abrogation of extraterritoriality. But when the text of this proposal appeared in Japanese newspapers, the population greeted it with open hostility, considering such a judicial reform humiliating and dangerous.\nThe dissent led the Japanese government to adopt a stricter attitude towards western diplomats and this inevitably stalled the negotiations at the very moment when a timid opening by the great powers was looming.\nIn February 1888, Ōkuma Shigenobu became foreign minister. He engaged in a series of separate negotiations with each of the Western powers in the belief that if he could persuade one of them to sign a new treaty, the others would be forced to follow suit. He decided to turn to a lesser power that was more willing to concede more advantages to Japan. The choice fell on Mexico, which had no residents in Japan and did not trade extensively with it. On 30 November 1888, the Treaty of Friendship, Commerce, and Navigation between the two powers was signed in Washington, the first to actually provide for a level playing field between the signatories, as Foreign Minister Matías Romero renounced extraterritoriality in exchange for the right of Mexican citizens to trade and reside in the Japanese hinterland. However, this success was quickly thwarted by the intervention of Great Britain and France, who used the most-favored-nation clause to extend these concessions to them as well.&nbsp;\nOne event that favorably influenced the attitude of the powers towards Japan was the Emperor's granting of a constitution, promulgated by him on 11 February 1889. This event was a key step in the westernization of Japanese institutions, which now also had a Prussian-inspired bicameral Diet. The latter, however, would have been extremely counterproductive for treaty revision negotiations. The representatives of the lower house, elected by the people and with little political experience, would undoubtedly have opposed concessions to the West and obstructed the government's work, while there were loud calls in the streets for a unilateral abrogation of the existing treaties.\nOkuma succeeded in October 1889 in making new agreements with the United States, Germany, and Russia, but the Japanese population regarded these new treaties as yet another surrender against Japan. On 18 October 1889, after a meeting, Okuma was the victim of a bomb attack in front of the Department of Foreign Affairs by a fanatic from the nationalist group ''Gen'yōsha''. This caused him to temporarily withdraw from political life, while Prime Minister Kuroda Kiyotaka resigned, effectively suspending all negotiations with the West.\nFollowing these events, the government was temporarily presided over by Sanjō Sanetomi and then handed over to Yamagata Aritomo. The new Minister of Foreign Affairs, Viscount Aoki Shūzō, was in charge of the delicate situation concerning the re-discussion of the treaties.\nAoki then attempted to propose a new treaty that could avoid the emergence of internal problems. However, just when it seemed that an agreement had been reached, on 11 May 1891 a fanatic attacked a young westerner in the town of Ōtsu, leaving him partially disfigured. The victim was none other than Nikolai Alexandrovich Romanov, the future Tsar Nicholas II, and such a scandal forced the incumbent government to resign due to the difficult internal situation in the country.\nThe new Treaty\n]]\nFollowing the Ōtsu incident, the government was headed by Matsukata Masayoshi, with Enomoto Takeaki as foreign minister. The new executive devoted itself to drafting a Civil Code and a Commercial Code, but once these were made public they were met with criticism.\nBoth bills were rejected and the government fell again. Under these conditions, it was Itō Hirobumi, the man behind the 1889 Constitution, who was appointed prime minister on 8 August 1892. He chose as Foreign Minister Mutsu Munemitsu, a diplomat who had gained extensive experience both as Minister of Agriculture in the Yamagata government and as Japan's Minister Plenipotentiary to the United States, a role that led him to be the signatory of the former Treaty of Friendship and Commerce with Mexico.\nMutsu was intent on resuming negotiations and was able to avail himself of the availability of Lord Rosebery, then still foreign minister, and the help of Aoki Shūzō, who despite previous failures had shown great ability.\nFaced with yet more opposition from the Diet, the Prime Minister decided to resort to strong-arm tactics and dissolved the assembly. Once the internal obstacles had been removed, Ito and Mustu were able to devote themselves to drafting a new diplomatic agreement with Britain.\nEffects of the First Sino-Japanese War\nAfter complicated negotiations, an agreement on all points was finally reached on 13 July 1894. Growing tensions in the neighbouring kingdom of Korea, however, threatened to undermine the signing of the new treaty. Two factions had long been opposed in the country, one pro-Chinese, more conservative and linked to the imperial government, and one pro-Japanese, who wanted to emulate the successes of the 'Meiji Revolution'. The latter started an insurrection, the suppression of which was entrusted to an expeditionary force sent by the Chinese Empire. Japan reacted by sending its own troops to the peninsula, which captured the Korean ruler and imposed a pro-Japanese government. Mutsu entrusted the delicate matter to Ōtori Keisuke, Minister Plenipotentiary in Korea, but he dismissed a British naval instructor in the service of the Koreans from his position. This action led to a dangerous stalemate, as on 14 July 1894 Britain refused to sign the treaty unless it was first given clarification on the Korean question and the treatment of its officer. Mutsu, cornered, wasted no time and in the following days intensified his efforts to avoid disaster.\nSigning of the Treaty\nOn 16 July 1894, however, contrary to all expectations, the Anglo-Japanese Treaty of Friendship, Commerce and Navigation was signed by the Secretary of State for Foreign Affairs, John Wodehouse, and Minister for Foreign Affairs, Viscount Aoki Shūzō in London.  The treaty was ratified by Meiji emperor in August 1894, ratifications exchanged in Tokyo on 25 August 1894 and came into force on 17 July 1899, five years after the signing as stipulated in ARTICLE XXI of the treaty. For the first time, Japan was recognised as a Great Power peer.\nTermination\nThe term was set at 12 years (to July 1911) with a requirement that Great Britain or Japan must notify the other party of the termination (ARTICLE XXI). This treaty was not terminated until 26 July 1941, one year after Great Britain and the Commonwealth nations notified the termination to Japan, ending up far outliving the newer Anglo-Japanese Alliance.  Within five months of its termination, the Empire of Japan declared war against the US and the Commonwealth.\nSee also\n* History of Japanese foreign relations\n* Japan–United Kingdom relations\n* List of Ambassadors of the United Kingdom to Japan\n* Extraterritoriality\nReferences\nFurther reading\n*\n*\n*\n*\n*"
    }
  ]
}