{
  "content": [
    {
      "type": "text",
      "text": "# Aniedi Ikpong King\n\nAniedi Ikpong King (born March 2, 1956) was a Nigerian politician, surveyor, and administrator. He served as a member of the House of Representatives, representing the Etinan Federal Constituency in Akwa Ibom State from 2007 to 2011.\nBackground and early life\nAniedi was born on March 2, 1956. He is from Etinan, Akwa Ibom State, Nigeria.\nPersonal life\nKing is married to Juliet King, and they have two children, a son and a daughter.\nEducation\nAniedi earned a Bachelor of Science in 1980, from the University of Ibadan. In 1983, He furthered his education at the University of Lagos, where he obtained additional qualifications. In 1997, he completed an MBA at the University of Benin.\nProfessional career\nKing began his professional career as a surveyor and held several positions, including Project Surveyor at Pryme-Ark Consultants Ltd, Hydro Surveyor at Ham Dredging Nigeria Ltd, and Surveyor at Geosource Nigeria Ltd.\nPolitical career\nHe transitioned into politics, serving as the Chairman of the Caretaker Committee for Etinan Local Government Area from 2002 to 2003. In 2003, he was appointed Head of Council, Etinan Local Government Area. In 2007, King was elected to the House of Representatives, where he represented the Etinan/Nsit Ibom/Nsit Ubium Federal Constituency. While in office, he served on various committees, including Aviation, Niger Delta, population, science and Technology, Works, Donor Agencies.\nAwards and recognitions\nKing's contributions to politics and grassroots development earned him numerous awards, including:\n* Best Credible Chairman of the Year Award by the PDP National Grass Root Forum (2003)\n* Excellence in Service Award by the Uyo Central Lion Club (2003)\n* Meritorious Award as a Visionary Leader by the Akwa Ibom Youth Movement\n* Obong Uwana Ibibio of Ifim Ibom, conferred by the Supreme Council of Ibibio Traditional Rulers (2005).\nDeath\nAniedi King died on January 23, 2013. His death was formally announced in the National House of Representatives on January 29, 2013, where a minute of silence was observed in his honor.\nReferences"
    }
  ]
}