{
  "content": [
    {
      "type": "text",
      "text": "# Anna Hudson (art historian)\n\n| birth_place      =\n| death_date       =\n| death_place      =\n| nationality      =\n| spouse           =\n| education        = BFA Concordia University, Montreal; MPhil, University of Glasgow; MA, PhD University of Toronto\n| awards\t   =\n| known_for        = art historian, curator, writer and educator\n}}\nAnna Victoria Hudson  (born 1963) is an art historian, curator, writer and educator specializing in Canadian Art, Curatorial and Indigenous Studies who is the Director of the Graduate Program in Art History & Visual Culture at York University, Toronto.\nCareer\nHudson was born in London, Ontario and took art classes at the London Public Library on Saturday mornings where she was introduced to London's active art scene. She studied the History of Art at Concordia University, Montreal, graduating in 1985 with an Honours BFA with distinction; then took an MPhil, University of Glasgow (1986); and MA University of Toronto (1988). She worked at the University of Lethbridge teaching Art History (1996-1997) while completing her doctorate \"Art and Social Progress: The Toronto Community of Painters, 1933-1950\" at University of Toronto (1997).\nAs a curator, she has worked with other curators and writers to explore our changing responses to what constitutes past and present Canadian art. As a York Research Chair and Principal Investigator of the Social Sciences and Humanities Research Council (SSHRC) project, \"Mobilizing Inuit Cultural Heritage\" (2015-2020) which she led, Hudson has extended our knowledge of modern and contemporary circumpolar Indigenous artists.\nFrom 1997 to 2004, she worked in the Art Gallery of Ontario in the Canadian Art department creating exhibitions such as Woman as Goddess: Liberated Nudes by Robert Markle and Joyce Wieland (2003) which the Globe and Mail discussed as controversial and co-curated with Laakkuluk Williamson Bathory Inuit Art in Motion (2004).\nFrom 1993, she also maintained an active teaching program at various universities such as the Alberta College of Art and Design, Calgary and Concordia University, Montreal (1993); McGill University, Montreal (1994) and as an adjunct professor in the Graduate Programme in Art History, Faculty of Graduate Studies, York University, Toronto. In 2004, she joined the Department of Visual Arts at York University, Toronto, as an assistant professor in Canadian Art and Curatorial Studies. From 2009 to 2017, she was an associate professor in the Department and the Faculty of Graduate Studies at York University and in 2018 was made Director of the Graduate Program. In addition to teaching, she has supervised M.A. and Ph.D. theses in the area of Canadian art history as well as lecturing nationally on the subject, assisting and advising funding agencies, serving on panels for scholarly conferences and as a peer reviewer for galleries and other institutions and organizer of workshops as well as serving as a member of the Board of Trustees of various institutions such as the McMichael Canadian Art Collection (2013-2017), and of many committees in York University and elsewhere. Since 2014, she has served as Commissioning Editor for Online Art Books for the Art Canada Institute/Institut de l’art Canadien.\nWriting\nHudson wrote or contributed essays for the catalogues for exhibitions which she organized or co-organized such as ''A Collector's Vision: J. S. McLean and Modern Painting in Canada (Art Gallery of Ontario, 1999); Woman as Goddess: Liberated Nudes by Robert Markle and Joyce Wieland (Art Gallery of Ontario, 2004); The Nude in Modern Canadian Art, 1920-1950, co-curated with Michèle Grandbois for the Musée national des beaux-arts du Québec (2009) which the Winnipeg Free Press called fascinating; Fugitive Light: Clark McDougall’s Destination Places (2011), for the McIntosh Gallery, University of Western Ontario; and inVisibility: Indigenous in the City, which was part of INVISIBILITY: An Urban Aboriginal Education Connections Project for the John B. Aird Gallery, Toronto (2013) (co-curated with Dr. Susan Dion and Dr. Carla Rice). She was on the curatorial team for the exhibition and wrote for the catalogues of Painting Canada: Tom Thomson and the Group of Seven, for the Dulwich Picture Gallery, London, UK (2011); and Tunirrusiangit: Kenojuak Ashevak and Tim Pitsiulak (2018) (\"Tunirrusiangit\" means \"their gifts\" or \"what they have\" in Inuktitut) for the Art Gallery of Ontario, Toronto. In 2022, she co-edited and wrote for the book Qummut Qukiria!'' (\"Up like a bullet!\" in Inuktitut) with Dr. Heather Igloliorte and Jan-Erik Lundström, a book which celebrates art and culture within and beyond traditional Inuit and Sámi homelands in the Circumpolar Arctic. The 38 essays in this book illuminate their subject.\nShe also has written numerous articles, chapters in books and entries such as the chapter titled \"Quiet pursuits: Canadian Impressionsts and the 'new woman'\" in Canada and Impressionism: new horizons, 1880-1930 co-authored by Katerina Atanassova (2019) or the entries on Anne Savage and Marion Long in Uninvited: Canadian Women Artists in the Modern Moment (2021).\nHonours and awards\n* 2004 Ontario Association of Art Galleries 2004 Juried Awards of Merit for \"Wonder Woman and Goddesses: A Conversation about Art with Robert Markle and Joyce Wieland\" in Woman as Goddess: Liberated Nudes by Robert Markle and Joyce Wieland\n* 2006, 2010, 2011 Merit awards, York University\n* 2011 Canadian Museums Association Award for Excellence in Research – with co-curator Michèle Grandbois, The Nude in Canadian Art, 1920-1950\n* 2014 York University Research Leader\n* 2015-2020\tYork Research Chair, Inuit Cultural Mobilization\n* 2019 Fellow of the Royal Society of Canada\n* 2023 Winner, Melva J. Dwyer Award for Qummut Qukiria!\n*2023 Honourable Mention, Canadian Museums Association Award for Outstanding Achievement (Research) for Qummut Qukiria!\nReferences"
    }
  ]
}