{
  "content": [
    {
      "type": "text",
      "text": "# Anna Lindh Euro-Mediterranean Foundation for the Dialogue Between Cultures\n\n}}\n(Anna Lindh Foundation) and Maga Ettori (Regional Institute of Cinema and Audiovisual) in Marseille for the Anna Lindh Mediterranean Forum 2013]]\nThe Anna Lindh Euro-Mediterranean Foundation for the Dialogue Between Cultures is a network of civil society organisations dedicated to promoting intercultural dialogue in the Mediterranean region.\nIt was set up in 2005 by the governments of the Euro-Mediterranean Partnership (Euromed), a political agreement made in 1995 between the European Union and  Algeria, Morocco, Tunisia, Egypt, Jordan, Lebanon, Palestine, Israel, Syria and Turkey.\nIt is named in honour of Anna Lindh, the Swedish Foreign Minister who was murdered in 2003. The name was put forward by Egypt at a meeting 25 September 2003. The Foundation's headquarters are in Alexandria in Egypt.\nIn 2008, André Azoulay was elected president of the Foundation.\nFields of action\nThe Anna Lindh Foundation facilitates and supports the action of civil society of the Euro-Mediterranean Region in priority fields which affects the capacity for individuals and groups to share values and live together. The Foundation's programme is focused on activities in fields which are essential for human and social dialogue: Education and Youth; Culture and Arts; Peace and Co-existence; Values, Religion and Spirituality; Cities and Migration; Media.\nMandate\nThe purpose of the Anna Lindh Foundation (ALF) is to bring people together from across the Mediterranean to improve mutual respect between cultures and to support civil society working for a common future of the Region.\nSince its launch in 2005, the ALF has launched and supported action across fields impacting on mutual perceptions among people of different cultures and beliefs, as well as developing a region-wide Network of over 3000 civil society organisations.\nThrough its action and reflection, the ALF aims to contribute to the development of an Intercultural Strategy for the Euro-Mediterranean Region, providing recommendations to decision-makers and institutions and advocating for shared values.\nReferences\nExternal links\n*[http://www.annalindhfoundation.org/ Official website]"
    }
  ]
}