{
  "content": [
    {
      "type": "text",
      "text": "# Anna Seward bibliography\n\nThe known works of Anna Seward include the following:\nBiography\n* Memoirs of the Life of Dr. Darwin (1804)\nNovel\n* Louisa, A Poetical Novel in Four Epistles (1784)\nPoetry\n(Numbers in parentheses refer to Scott's collection. Page links to the text of individual poems are on Anna Seward's page)\nPoems uncollected before 1810;\n* Elegy Addressed to Cornet V-------, in the Autumn 1765.\n* Honora, an Elegy.\n* The Anniversary. Written June 1769. (I. 68)\n* Epistle to Miss Honora Sneyd.—Written, Sept. 1770.\n* Epistle to Miss Honora Sneyd, May 1772. Written in a Summer Evening, from the Grave of a Suicide.\n* To Mrs Coltman of Hull. October 1772.\n* Time Past. Written Jan. 1773.\n* Ode to William Boothby, Esq. Written in the Summer 1775.\n* To F.N.C. Mundy, Esq. on his Poem, the Fall of Needwood Forest.\n* Verses Written in Dr Darwin’s Botanic Garden, Near Lichfield, July, 1778.\n* Invocation of the Comic Muse. Prize Poem at Bath-Easton.\n* Amusements of Winter. Written in 1779.\n* Ode to the Sun. Published in May 1780.\n* Lichfield, an Elegy. Written May 1781. (I. 89)\n* Monody on the Death of David Garrick, Esq. Prize Poem at Bath-Easton.\n* Monody on Major Andre. 1781\n* Epistle to William Hayley, Esq.\n* Elegy on Captain Cook (1780) (first published poem)\n* To Time Past. Written Dec. 1772.\n* Monody on Major André (1781)\n* Verses to a Young Gentleman.\n* Address to the Sun. Written in a Chaise, Returning out of Sussex, Sept. 15, after a Six Weeks Residence at Mr Hayley’s Seat, in that County, 1782.\n* Prologue to the Circassian, Written in Autumn 1782.\n* To the Memory of Lady Miller. 1782\n* Verses to the Rev. William Mason, on his Silence Respecting Dr Johnson’s Unjust Criticisms upon Mr Gray’s Works, in the Lives of the Poets.—Written in 1782.\n* Epistle to Colonel St. George. Written April 1783.\n* Verses to the Celebrated Painter, Mr Wright, of Derby, Written in 1783.\n* On Seeing Mr Hayley’s Works Invidiously Criticized in the Public Prints of the Year 1783.\n* Verses to Mr. Hayley, Concerning Unpublished Remains of Ossian.\n* Written in Autumn, 1784, After a Visit to Colton, the Seat of William Gilbert, Esq. in Staffordshire.\n* Epitaphs. On Hannah Robinson, of Lichfield, Addressed to her Husband, the Rev R.G. Robinson.\n* Alpine Scenery. A Poem. Addressed to the Rev. Thomas Sedgwick Whalley, during his Residence on the Continent, in 1785.\n* Epistle to Nathaniel Lister, Esq. of Lichfield, on Having Read his Verses in Manuscript, Written December 1786.\n* To the Rev. John Granville.\n* Song. [From thy waves, stormy Lannow, I fly;]\n* On Eliza Jones, Wife of the Reverend John Jones.\n* Invocation to the Genius of Slumber. Written, Oct. 1787.\n* Ode on General Eliott’s Return from Gibraltar, in 1787.\n* Epistle to George Romney, Esq. on his Having Presented the Author’s Picture to her Father, May 1788.\n* Eyam. August 1788 (III. 1)\n* Remonstrance Addressed to William Cowper, Esq. in 1788, on the Sarcasms Levelled at National Gratitude in the Task.\n* To Mrs Smith, Daughter of Mr Saville, on her Singing in Public,—January 1789.\n* To Mr John Salt, of Lichfield, on Having Read Some of his Compositions on a Rainy Evening, in August, 1789.\n* On the Sudden Death of the Celebrated Mr Norris, of Oxford, Batchelor of Music.\n* Epistle to Mr Newton, the Derbyshire Minstrel, on Receiving his Description, in Verse, of an Autumnal Scene, Near Eyam, in that County, September 1791.\n* Verses Inviting Mrs C--- to Tea on a public Fast-day, during the American War.\n* Written After Having Visited Miss More, and her Sisters at Cowslip Green, Near Bristol, in August 1791.\n* A Favourite Cat’s Dying Soliloquy, Addressed to Mrs Patton of Lichfield.\n* Verses Written in the Blank Leaves of Mr Hayley’s Poems, Presented by A. Seward, to Wm. Grove, Esq. of Lichfield, 1793.\n* To Mrs Wingfield of Shrewsbury. October 1794.\n* To Miss Wingfield of Shrewsbury. October 1794.\n* To Miss Catherine Wingfield. October 1794.\n* Epistle to F.C.R. Mundy, Esq. Of Marketon, Derbyshire.—Written 1794.\n* To Miss Remmington, of Lichfield. January 1795.\n* To Miss Fern of Lichfield. April 1795.\n* Pastoral Ballad. [O! share my cottage, dearest maid!]\n* To Major Rooke of Mansfield, on the Publication of his Diurnal Register of the Winds for the Two Last Years. October, 1796.\n* Llangollen Vale, Inscribed to the Right Honourable Lady Eleanor Butler, and Miss Ponsonby.\n* Hoyle Lake, a Poem, Written on the Coast, and Addressed to its Proprietor, Sir John Stanley.\n* Verses on Wrexham, and the Inhabitants of its Environs.\n* Herva, at the Tomb of Argantyr. A Runic Dialogue.\n* To Miss Honora Smith of Lichfield. Written June 1800.\n* To the Young Married Lady who Humanely Purchases this Trifle. September 1800.\n* To the Young Unmarried Lady, who Purchases Me. September 1800.\n* To the Lady, Whether Single or Married, who Shall Charitably Purchase this Trifle. September 1800.\n* To the Lady who may Purchase this Envelope, and who May not be a Celebrated Beauty. September 1800.\n* To the Dowager Lady Blakiston, with a Letter-Case.\n* To Mrs Siddons.\n* A Marine View Moralized Addressed to Miss Anne Lloyd of Derby.\n* Consolation, Addressed to Mr Thos. H-------D, April 1801, with a Pocket-Book.\n* A Farewell to the Seat of Lady Eleanor Butler, and Miss Ponsonby, in Llangollen Vale, Denbighshire.\n* Addressed to the Rev. Thomas Sedgewick Whalley, on Leaving his Seat, Mendip Lodge, in Somersetshire, Oct. 10th, 1804.\n* To Mrs Skerett, Written, Nov. 1805.\n* To Miss Catherine Mallet.\n* Blindness, a Poem. Written at the Request of an Artist, who Lost his Sight by the Gutta Serena, in his Twenty-Eighth Year, and who was Therefore Obliged to Change his Profession for that of Music.\n*  Address to the Young Roscius.\n*  The Visions, An Elegy.  1764 (I. 1)\n*  Knowledge, A Poem in the Manner of Spencer.\n*  Portrait of Miss Levett.\n*  The Hay-Field, a Morning Scene.\n*  Inscription for an Urn in a Gentleman’s Garden, amid the Mountainous Parts of Scotland, where two Lovers had been killed by the fall of an impending Precipice.\n*  Evander to Emillia. Elegy.\n*  Evander to Emillia. Epistle.\n*  Elegy. Emillia Embroidering—and Jealous.\n*  Epistle. Evander to Emillia.\n*  Elegy. Emillia to Evander—in Renewed Jealousy.\n*  Epistle. Evander to Emillia.\n*  Elegy. Evander to Emillia.\n*  Epistle. Evander to Emillia.\n*  Elegy. Evander to Emillia.\n*  Epistle. Evander to Emillia.\n*  Elegy. Evander to Emillia.\n*  Epistle. Evander to Emillia.\n*  Elegy. Evander to Emillia.\n*  Elegy. Evander to Emillia.\n*  Evander to Emillia.\n*  Ode to Content.\n*  Elegy Written at the Sea-side, and Addressed to Miss Honora Sneyd.\n*  Monody on Mrs Richard Vyse, Addressed to her Husband, Since General Vyse.\n*  Receipt for a Sweet Jar.\n*  Invocation to the Shade of Petrarch, and to the Spirits of the Persian Poets, on their Compositions being Translated into English, by Sir William Jones.\n*  Ode to Brooke Boothby, Esq. Afterwards Sir Brooke Boothby.\n*  The Country Maid, a Pastoral Ballad.\n*  Song. [Florio, by all the Powers above,]\n*  Achilles, a Conzonet.\n*  Song. [The mute grey fields, and leafless bowers]\n*  Song. [My Stella sleeps, the sultry hour]\n*  Song. [On a mount a cottage stands]\n*  Ballad. [I wake and weep, when wintry winds]\n*  Song of the Fairies to the Sea-Nymphs.\n*  Song Adapted to the New Air in Pleyel’s Grand Concertante.\n*  Song. [In sylvan scenes, when Laura hails]\n*  Ballad. [Hast thou escaped the cannon’s ire,]\n*  Song. [The stormy ocean roving,]\n*  Address to Hope.\nOther;\n* Llangollen Vale, With Other Poems (1796)\n* Ode to Poetic Fancy\n* To Remembrance\n* A Meditation\n* Ode on Time\nAttributed;\n* The Backwardness of the Spring Accounted For 1772 (unsigned but attributed)\nSonnets\nSeward wrote many sonnets, including;\n* Original Sonnets on Various Subjects: And Odes Paraphrased from Horace (1799) (100 sonnets, 26 odes, Volume III of Scott edition, pp.&nbsp;122–222)\n** Sonnet 10. To Honora Sneyd. [Honora, shou’d that cruel time arrive] 1773\n** Sonnet 12. [Chill’d by unkind Honora's alter’d eye] 1773\n** Sonnet 14 [Ingratitude, how deadly is thy smart] 1773\n* Sonnet, Written on Rising Ground, Near Lichfield\n* Sonnet [Igratitude,--how deadly is thy smart,]\n* Sonnet, Written on Rising Ground, Near Lichfield\n* Sonnet, To a Young Lady in Affliction, Who Thought She Should Never More be Happy; Written on the Sea-Shore\n* Sonnet [Now, young-ey’d Spring, on gentle breezes borne,]\n* Sonnet. Invitation to a Friend.\n* Sonnet [If he whose bosom with no transport swells]\n* Sonnet, Laid in the drawer of the thatched shed by the brook at Plas Nwydd, the Villa of the Right Hon. Lady Eleanor Butler, and Miss Ponsonby, in Llangollen Vale. Written in Autumn 1799.\n* Sonnet to the Rev. Richard Polwhele, on his Poem upon the Influence of Local Attachment\n}}\nNotes\nReferences\nBibliography\n*\n* }}\n*\n*\n*\n** [https://archive.org/details/poeticalworksan02scotgoog Volume 1]\n** [https://archive.org/details/lettersannasewa03consgoog Volume 2]\n** [https://archive.org/details/lettersannasewa00consgoog Volume 3]\n** [https://archive.org/details/lettersannasewa09consgoog Volume 4]\n** [https://books.google.com/books?id=3BsSAJB0oPgC Volume 5]\n** [https://archive.org/details/lettersannasewa07consgoog Volume 6]\n* (1992–1993)\n*\n*\n** [https://archive.org/details/poeticalworksan02scotgoog Volume 1]\n** [https://books.google.com/books?id=ZEE1AAAAMAAJ Volume 2]\n** [https://archive.org/details/poeticalworksan01scotgoog Volume 3]\n*"
    }
  ]
}