{
  "content": [
    {
      "type": "text",
      "text": "# Annandale, Queensland\n\n| local_map           = yes\n| zoom                = 12\n| pop                 = 8376\n| pop_year            =\n| pop_footnotes       =\n| established         =\n| postcode            = 4814\n| area                = 6.8\n| timezone            = AEST\n| utc                 = +10:00\n| dist1               = 9.9\n| dir1                = SW\n| location1           = Townsville CBD\n| dist2               = 1333\n| dir2                = NNW\n| location2           = Brisbane\n| dist3               =\n| dir3                =\n| location3           =\n| dist4               =\n| dir4                =\n| location4           =\n| lga                 = City of Townsville\n| stategov            = Mundingburra\n| fedgov              = Dawson\n| near-n              = Mundingburra\n| near-ne             = Rosslea\n| near-e              = Idalia\n| near-se             = CludenWulguru\n| near-s              = Murray\n| near-sw             = Douglas\n| near-w              = Cranbrook\n| near-nw             = Aitkenvale\n}}\nAnnandale is a south-western suburb of Townsville in the City of Townsville, Queensland, Australia. In the , Annandale had a population of 8,376 people.\nGeography\nAnnandale is bounded to the north by the Ross River, to the east by Stuart Drive, and to the south and west by University Road. The Annandale Wetlands are in the north-east of the locality adjacent to the river ().\nThe Bruce Highway runs along the southern boundary, Douglas–Garbutt Road (University Road) runs along the western, and Townsville Connection Road along the north-eastern.\nHistory\nAnnandale was the largest planned housing development in Townsville. Construction started in the mid-1970s and was completed in early 2005. Annandale is one of Townsville's newest suburbs and is home to some of Townsville's wealthy, who live more toward the riverbank.\nBefore the 2006 Queensland state election, Annandale was part of the Electoral district of Burdekin, but just prior to the 2006 state election, the suburb became part of the Electoral district of Mundingburra.\nIn 2006 there were 1624 registered dogs in Annandale, seven out of every ten homes owned at least one dog, this is the highest density of dogs of Townsville suburbs.\nAnnandale Christian School opened on 22 January 1982.\nWilliam Ross State High School opened for enrolments on 30 August 1990 and commenced schooling on 29 January 1991.\nSouthern Cross Catholic School opened in 1998.\nAnnandale State School opened on 22 January 1998.\nThe Annandale campus of Townsville Grammar School opened  on 1 January 2002.\nLike many parts of Townsville, Annandale sustained damage when Cyclone Yasi hit on 3 February 2011.\nDemographics\nIn the , Annandale had a population of 8,574 people.\nIn the , Annandale had a population of 8,376 people.\nEducation\nAnnandale State School is a government primary (Prep–6) school for boys and girls at the corner of Oleander Street and Yolanda Drive (). In 2018, the school had an enrolment of 845 students with 63 teachers (55 full-time equivalent) and 59 non-teaching staff (35 full-time equivalent). It includes a special education program.\nTownsville Grammar School has a primary (Prep–6) campus at 1 Brazier Drive ().\nSouthern Cross Catholic College is a Catholic primary and secondary (Prep–12) school for boys and girls at Gartrell Drive (). In 2018, the school had an enrolment of 1,071 students with 78 teachers (74 full-time equivalent) and 50 non-teaching staff (35 full-time equivalent). In 2024, the school had an enrolment of 1,491 students.\nAnnandale Christian College is a private primary and secondary (Prep–12) school for boys and girls on Yolanda Drive (). In 2018, the school had an enrolment of 537 students with 48 teachers (41 full-time equivalent) and 25 non-teaching staff (18 full-time equivalent). In 2021, the school had an enrolment of 629 students with 50 teachers (41 full-time equivalent) and 32 non-teaching staff (24 full-time equivalent).\nWilliam Ross State High School is a government secondary (7–12) school for boys and girls at Mervyn Crossman Drive (). In 2018, the school had an enrolment of 773 students with 72 teachers (69 full-time equivalent) and 37 non-teaching staff (29 full-time equivalent). It includes a special education program.\nAmenities\nAmenities in Annandale include the Annandale Central shopping centre anchored by a Coles supermarket and Annandale Village shopping centre.\nThere are a number of parks, including The Palmetum (), Marabou Park, Weir Park, Macarthur Park and Windsor Park.\nThere are many sporting facilities at the Murray Sporting Complex including:\n*Townsville Stadium ()\n*TDRL Rugby League Fields\n*SeaFM Basketball Stadium ()\n*Australian Rules Fields\n*Soccer\n*Hockey\n*Velodrome\n*Cricket\n*Softball\nHeritage\nThe Major Richard I. Bong Bridge on Macarthur Avenue () is named after Richard (Dick) Bong, an American pilot who served in Townsville with 9th Fighter Squadron of the 49th Fighter Group during World War II. He was one of the most decorated American fighter pilots and the country's top flying ace in the war.\nReferences\nExternal links\n*"
    }
  ]
}