{
  "content": [
    {
      "type": "text",
      "text": "# Annette Beck-Sickinger\n\n| birth_place =\n| death_date =\n| death_place =\n| death_cause =\n| resting_place =\n| resting_place_coordinates =\n| other_names =\n| residence =\n| citizenship =\n| nationality = German\n| fields =\n| alma_mater = University of Tübingen\n| workplaces = University of Leipzig\n| known_for = GPCR research, peptide hormones, peptide and protein modification\n| partner =\n| children =\n| signature =\n| signature_alt =\n| website = |}}\n| footnotes =\n}}\nAnnette Gabriele Beck-Sickinger (born 28 October 1960) is a German chemist and biologist. She has been a full professor of Biochemistry and Bioorganic Chemistry at the University of Leipzig since 1999.\nCareer\nAnnette G. Beck-Sickinger studied chemistry (diploma in 1986) and biology (diploma in 1990) at the University of Tübingen (Germany) and received her Ph.D. under the supervision of Günther Jung (Organic Chemistry, University of Tübingen).\nSince October 1999, she is a full professor of Biochemistry and Bioorganic Chemistry at the University of Leipzig. In 2009, she spent a sabbatical at Vanderbilt University (Nashville, TN) as visiting professor.\nAnnette Beck-Sickinger was a member of the Board of the German Chemical Society (Gesellschaft Deutscher Chemiker, 2004–2012; Vice-president 2006–2008) and of the DFG panel \"Biochemistry\" (2004–2012). Since 2017, she is a member of the Board of the German Society for Biochemistry and Molecular Biology (gbm) and vice-president. She was a member of the German Council of Science and Humanities (Wissenschaftsrat) from 2012 to 2018, and has been awarded with many prizes including the Leonidas Zervas Award of the European Peptide Society, the gold medal of the Max-Bergmann-Kreis, the Leipzig Science Award (2016) and the Albrecht Kossel Price of the German Chemical Society (2018). She was honoured with the membership of the Saxonian Academy of Science in 2009 and in 2012 became an elected member of the German National Academy of Sciences Leopoldina. In 2017, she was awarded with the Saxonian Order of Merit.\nShe is a member of the German Chemical Society, the Saxonian Academy of Sciences and the German Academy of Sciences Leopoldina. She is known for her work on peptide signaling; she has coauthored reference works on combinatorial chemistry as applied to peptides and has participated in International Union of Pharmacology projects on standardization of nomenclature for G protein-coupled receptor peptide ligands.\nControversy\nIn March 2015, Beck-Sickinger was at the center of a controversy related to comments made during correspondence with an internship applicant in which she stated she would not accept any male students from India.\nThe university declined to publish e-mails between Prof. Dr. Annette Beck-Sickinger and the student from India. However, the rector of the university, Prof. Dr. Beate Schücking as well as the students council of the university had the opportunity to review all relevant e-mails. Two independent statements have been published claiming that the mail published by the Indian student was faked as it only contained parts of the email conversation and that the student was declined for formal reasons.\nGermany's ambassador to India wrote a letter condemning Beck-Sickinger and, stating: \"Your oversimplifying and discriminating generalisation is an offence to women and men ardently committed to furthering women's empowerment in India; and is an offence to millions of law-abiding, tolerant, open-minded and hard-working Indians. Let's be clear: India is not a country of rapists,\" he wrote. \"I would encourage you to learn more about the diverse, dynamic and fascinating country and the many welcoming and open-minded people of India so that you could correct a simplistic image, which – in my opinion – is particularly unsuitable for a professor and teacher.\"\nSelected bibliography\nBooks\n*\n*\n*\n*\n*\nJournal articles\n* Yang Z, Han S, Keller M, Kaiser A, Bender BJ, Bosse M, Burkert K, Kögler LM, Wifling D, Bernhardt G, Plank N, Littmann T, Schmidt P, Yi C, Li B, Ye S, Zhang, R, Xu B, Larhammar D, Stevens RC, Huster D, Meiler J, Zhao Q, Beck-Sickinger AG*, Buschauer A, Wu B*. Structural basis of ligand binding modes at the neuropeptide Y Y(1) receptor. Nature. 2018 Apr;556(7702):520-524.\n* Wanka L, Babilon S, Kaiser A, Mörl K, Beck-Sickinger AG. Different mode of arrestin-3 binding at the human Y(1) and Y(2) receptor. Cell Signal. 2018 Oct;50:58-71.\n* Kaiser A, Hempel C, Wanka L, Schubert M, Hamm HE, Beck-Sickinger AG. G Protein Preassembly Rescues Efficacy of W(6.48) Toggle Mutations in Neuropeptide Y(2) Receptor. Mol Pharmacol. 2018 Apr;93(4):387-401.\n* Lotze J, Wolf P, Reinhardt U, Seitz O, Mörl K, Beck-Sickinger AG. Time-Resolved Tracking of Separately Internalized Neuropeptide Y(2) Receptors by Two-Color Pulse-Chase. ACS Chem Biol. 2018 Mar 16;13(3):618-627.\n* Schubert M, Stichel J, Du Y, Tough IR, Sliwoski G, Meiler J, Cox HM, Weaver CD, Beck-Sickinger AG. Identification and Characterization of the First Selective Y(4) Receptor Positive Allosteric Modulator. J Med Chem. 2017 Sep 14;60(17):7605-7612.\n* Böhme D, Krieghoff J, Beck-Sickinger AG. Double Methotrexate-Modified Neuropeptide Y Analogues Express Increased Toxicity and Overcome Drug Resistance in Breast Cancer Cells. J Med Chem. 2016 Apr 14;59(7):3409-17.\n* Zernia S, Ott F, Bellmann-Sickert K, Frank R, Klenner M, Jahnke HG, Prager A, Abel B, Robitzki A, Beck-Sickinger AG. Peptide-Mediated Specific Immobilization of Catalytically Active Cytochrome P450 BM3 Variant. Bioconjug Chem. 2016 Apr 20;27(4):1090-7.\n* Pagel M, Hassert R, John T, Braun K, Wießler M, Abel B, Beck-Sickinger AG. Multifunctional Coating Improves Cell Adhesion on Titanium by using Cooperatively Acting Peptides. Angew Chem Int Ed Engl. 2016 Apr 4;55(15):4826-30.\n* Ahrens VM, Kostelnik KB, Rennert R, Böhme D, Kalkhof S, Kosel D, Weber L, von Bergen M, Beck-Sickinger AG. A cleavable cytolysin-neuropeptide Y bioconjugate enables specific drug delivery and demonstrates intracellular mode of action. J Control Release. 2015 Jul 10;209:170-8.\n* Kaiser A, Müller P, Zellmann T, Scheidt HA, Thomas L, Bosse M, Meier R, Meiler J, Huster D, Beck-Sickinger AG, Schmidt P. Unwinding of the C-Terminal Residues of Neuropeptide Y is critical for Y2 Receptor Binding and Activation. Angew Chem Int Ed Engl. 2015 Jun 15;54(25):7446-9.\n*\nReferences\nExternal links\n* [http://www.saw-leipzig.de/de/mitglieder/becka Profile: Annette Beck-Sickinger], University of Leipzig"
    }
  ]
}