{
  "content": [
    {
      "type": "text",
      "text": "# Anne Beauchamp, 15th Countess of Warwick\n\n| landscape     =\n| alt           =\n| birth_date    =\n| birth_place   = Cardiff, Glamorgan, Wales\n| death_date    =\n| death_place   = Ewelme, Oxfordshire, England\n| resting_place = Reading Abbey, Berkshire\n| resting_place_coordinates =\n| title         = 15th Countess of Warwick7th Baroness Burghersh\n| term          = 11 June 1446 – 3 June 1449\n| successor     = Richard Neville\n| father        = Henry Beauchamp, 1st Duke of Warwick\n| mother        = Cecily Neville\n}}\nAnne Beauchamp, 15th Countess of Warwick (14 February 1444 – 3 June 1449), was the only child and heiress of the English nobleman Henry Beauchamp, 1st Duke of Warwick. She died a child aged 5, after which the earldom of Warwick was inherited by her paternal aunt. The title then passed by marriage to Anne's maternal uncle, Richard Neville, the famous 'Kingmaker' of the later Wars of the Roses.\nLife\nAnne Beauchamp was born on 14 February 1444 at Cardiff in Wales. Her father was Henry Beauchamp, Duke of Warwick (1425–1446), the last male of the medieval Beauchamp family to hold the Warwick title. Anne's mother was Cecily Neville, sister to Richard Neville, who later played a key role in the Wars of the Roses.\nOn 11 June 1446, Anne's father died. The dukedom of Warwick, created in 1445, had been originally granted only to male heirs, and so became extinct upon Henry Beauchamp's death, but the earldom (created in 1088) allowed for female succession and was therefore inherited by his daughter. She also inherited from her father the barony of Burghersh, being the 7th person to hold that title since its creation in 1330. Upon the death of King Henry VI's uncle Humphrey, Duke of Gloucester, on 23 February 1447, Anne also succeeded to the lordship of the Channel Islands, which had been previously entailed on her father.\nThe infant Anne was one of the greatest heiresses of her day, alongside the infant Lady Margaret Beaufort, the daughter of the 1st Duke of Somerset who had died in 1444. Both girls became wards of Anne's maternal step-great-grandmother, Alice Chaucer (widow of Thomas Montagu, 4th Earl of Salisbury, and a lady-in-waiting to Queen Margaret of Anjou) and William de la Pole, shortly to be Duke of Suffolk, who intended Anne to marry his own heir, John de la Pole (1442–1492).\nAnne died on 3 June 1449, aged five, at Ewelme (the Chaucer home) in Oxfordshire. She was buried in Reading Abbey church. Reading may have been chosen as her burial site because her great grandmother, Constance of York, had been buried there.\nAnne's title Countess of Warwick was inherited by her paternal aunt, Lady Anne. The barony of Burghersh fell into abeyance between her aunts.\nAfter Anne's death, the Duke of Suffolk instead arranged a 'solemn betrothal' between his son and Lady Margaret, a marriage contract that by law could be, and on the initiative of the king was, dissolved while the bride was below the age of twelve; Margaret herself never subsequently recognized John as her first husband.Jones, Michael K. and Underwood, Malcolm G. [https://doi.org/10.1093/ref:odnb/1863 \"Beaufort, Margaret known as Lady Margaret Beaufort, countess of Richmond and Derby\"], Oxford Dictionary of National Biography, 23 September 2004. Accessed 3 February 2019. John went on to marry Elizabeth of York, sister to the later kings Edward IV and Richard III. Margaret married Edmund Tudor, 1st Earl of Richmond, and became the mother of King Henry VII.\nAncestry\n|5= 5. Isabel le Despenser, 5th Baroness Burghersh\n|6= 6. Richard Neville, 5th Earl of Salisbury\n|7= 7. Alice Montagu, 5th Countess of Salisbury\n|8= 8. Thomas de Beauchamp, 12th Earl of Warwick\n|9= 9. Margaret Ferrers\n|10= 10. Thomas le Despenser, Earl of Gloucester\n|11= 11. Constance of York\n|12= 12. Ralph Neville, 1st Earl of Westmorland\n|13= 13. Joan Beaufort\n|14= 14. Thomas Montagu, 4th Earl of Salisbury\n|15= 15. Eleanor Holland\n|16= 16. Thomas de Beauchamp, 11th Earl of Warwick\n|17= 17. Katherine Mortimer\n|18= 18. William Ferrers, 3rd Baron Ferrers of Groby\n|19= 19. Margaret Ufford\n|20= 20. Edward le Despencer, 1st Baron le Despencer\n|21= 21. Elizabeth de Burghersh, 3rd Baroness Burghersh\n|22= 22. Edmund of Langley, 1st Duke of York\n|23= 23. Isabella of Castile\n|24= 24. John Neville, 3rd Baron Neville de Raby\n|25= 25. Maud Percy\n|26= 26. John of Gaunt, Duke of Lancaster (brother of 22)\n|27= 27. Katherine Swynford\n|28= 28. John Montagu, 3rd Earl of Salisbury\n|29= 29. Maud Francis\n|30= 30. Thomas Holland, 2nd Earl of Kent\n|31= 31. Alice FitzAlan\n}}\nFootnotes\nReferences\n*  }}\n*\n*  |publisher=Blackwell Publishers |place=Oxford |isbn=978-0-631-16259-9 |authorlink=Michael Hicks (historian) }}\n*  |authorlink=Douglas Richardson |ref= }}\n*  }}"
    }
  ]
}