{
  "content": [
    {
      "type": "text",
      "text": "# Ansa, Queen of the Lombards\n\n-->\n| birth_place  = Brescia\n| death_date   = After 774\n| death_place  = Liège\n| burial_date  =\n| burial_place =\n| spouse       = Desiderius\n| spouse-type  = Spouse\n| consort      = yes\n| issue        = DesiderataAnselpergaAdelpergaLiutpergaAdelchis\n| father       = Verissimo (?)\n}}\nSan Salvatore, Brescia, internal\nAnsa (died after 774) was a noblewoman who became the Queen of the Lombards in 756 and reigned until their fall to the Franks in 774 AD. She, like other Medieval Queens at the time, played a significant role in the stability and preservation of the later Lombard Kingdom, particularly through her religious contributions, donations, and political relationships with neighboring Kingdoms. She reigned alongside her husband, King Desiderius, in Northern Italy. She lived her final years exiled to a monastery until her death.\nEarly life\nAnsa belonged to an aristocratic family from Brescia. Ansa and Desiderius inherited land from the late King Aistulf which she used to found the Monastery of St. Michele and St. Pietro (later San Salvatore) in 753, where they would eventually appoint their eldest daughter Anselperga to abbess which was likely a political move to gain more support and power. Simultaneously, her husband was appointed an officer in the royal court while serving as Duke of Tuscia, leading her to take the throne as Queen of the Lombards alongside Desiderius.\nQueenship\nReign\nAnsa and Desiderius came to power when Desiderius deposed the previous King Ratchis in 757. Much of her reign, alongside her husband, was spent attempting to restore and rebuild the Lombard kingdom from years of instability and protect it from both internal and external threats that had plagued the kingdom for decades prior. Paul the Deacon, a prominent historical writer and a Lombard himself, wrote Ansa’s epitaph praising her efforts, in which he said:\n“The fatherland was wounded by wars and now falling into ruin.\nAlong with her great spouse, she made firm and augmented, raising it up.\nShe gave birth for us to one who would hold the scepters of the realm”\nAnsa’s epitaph continues to praise her for political moves mainly involving her children, which he believed would ensure the longevity of the Lombards. Ansa was the most prominent figure in the Lombard court aside from Desiderius, and would take over leadership while he was away. Although Ansa’s and Desiderius' efforts in reviving the Lombard state were commendable, the surrounding Kingdoms (the Franks, the Papal State, and the Byzantines) rapidly shifted against the Lombards as they had been in poor graces with them for a long time, leading the multiple conflicts to be too much for Ansa and Desiderius to handle.\nCarolingian Intervention\nFollowing the dissolution of the marriage between Ansa’s daughter, Gerperga, and Charlamagne in 771, Desiderius marched on Rome against the Papal State. In response, Charlamagne and the Carolingians invaded and quickly deposed the Lombards, and Ansa was exiled to a monastery in Francia. Following the death of her husband it is possible she was allowed to return to Italy, and according to local tradition, she was buried in the monastery in San Salvatore following her death.\nLegacy\nChildren\nAnsa and Desiderius had several children, many of whom were appointed to political positions or married to important figures both in and outside of Lombard Italy.\n*Anselperga (or Anselberga), was appointed abbess of San Salvatore monastery by Ansa and Deciderius, who inherited the land from previous king Aistulf.\n*Adelperga (or Adelberga), married Arechis II of Benevento\n*Liutperga (also Liutpirc or Liutberga), married Tassilo III of Bavaria\n*Desiderata or Ermengarda, married Charlemagne in 768, divorced in 771\n*Adelchis (or Adalgis), patrician in Constantinople\nSan Salvatore Monastery\nThe monastery of San Salvatore is still partially preserved and now functions as a museum. The foundation of the monastery was part of a series of aristocratic constructions and donations at the time, which was most likely an effort to increase stability and insurance against an invasion by the Franks. The monastery is seen as an effort in preserving their dynasty and rule over the Lombard realm, and she continued to make several significant donations and gifts in order to help preserve it.\nReferences\nBibliography\n*\n*\n*\n*\n*"
    }
  ]
}