{
  "content": [
    {
      "type": "text",
      "text": "# Anthony Edwards (rower)\n\n| birth_place    = Ballarat, Victoria, Australia\n| show-medals    = yes\n| medaltemplates =\n}}\n}}\nAnthony John  Edwards (born 22 December 1972 in Ballarat, Victoria) is an Australian former lightweight rower. He is a five time Olympian, triple Olympic medallist, a world champion and a six-time Australian national champion. He represented Australia at the premier world regattas consistently over a twenty-year period from 1993 to 2012.\nClub and state rowing\nEdwards' senior rowing was done from the Ballarat City Rowing Club where he  moved to take up sculling  in 1990. He previously rowed at St. Patrick's College, Ballarat, earlier in the same year and stroked the Firsts crew to victory in the Ballarat Head of the Lake Regatta. That victory broke the 29-year drought for the school which had not won the premier event of Head of the Lake Regatta for that long. He joined Wendouree-Ballarat Club Rowing Club in 1999 moving to four-oared crews. Later in his career he relocated to Tasmania in 2006 where he rowed from the New Norfolk Rowing Club in Hobart.\nEdwards was first selected to represent Victoria at the Interstate Regatta within the Australian Rowing Championships in 1995 when he raced to a second place in the single scull contesting the President's Cup. From 1996 to 2004 and excepting 2001, Edwards represented Victoria in the men's lightweight four contesting the Penrith Cup at the Interstate Regatta within the Australian Rowing Championships. His Victorian 1996 lightweight four was victorious. After his relocation to Tasmania he was selected in the Tasmanian lightweight four in 2010. That crew won the Penrith Cup that year.\nEdwards contested national championship titles at the Australian Rowing Championships on numerous occasions. In 1991, 1992 and 1993 he won the Senior B sculling championship and 1995 and 1997 he won the National Champion Lightweight sculls for Ballarat City Rowing Club. In 2002 he won the national lightweight sculls championship in Wendouree-Ballarat colours. He won the lightweight coxless four title in an Australian selection composite crew in 2007.\nInternational representative rowing\nIn 1991 Edwards won his first National Championship in the scull winning Men's Senior B (U23) Sculling championship in Adelaide. In 1992 he teamed with Tim Wise, his Ballarat City teammate to win the Champion Senior Lightweight double sculls. He also won the Men's Lightweight Senior B scull championship. As a result of this performance Edwards earned his first national representative selection at the 1992 U23 Trans Tasman regatta where he raced a double scull with Jason Tutty winning comfortably all their races in the series. The following year he made his debut Australian senior representative appearance in a lightweight quad scull which finished seventh at the 1993 World Rowing Championships in Racize. At Indianapolis 1994 he again raced in the lightweight quad. That crew made the A final and finished fifth.\nFor the 1995 World Rowing Championships in Tampere, Edwards raced a lightweight double scull with veteran lightweight Bruce Hick to a bronze medal. They stayed together into the 1996 Olympic year, the first time lightweight events were introduced to the Olympic regatta. With their great technical proficiency Hick and Edwards were selected again in the double scull and were expected to medal. They won their heat and placed second in their semi to make the A final. The Swiss brothers Michael and Markus Gier were favourites and Hick and Edwards placed third, winning bronze in the final, being beaten out by 0.21 seconds by the Dutch crew for silver. This medal was won when he was competing for Ballarat City Rowing Club and was the first Olympic representation and medal awarded to a Ballarat City member in the club's 125-year history.\nIn 1997 Edwards remained in the Australian lightweight double scull now paired with Queensland's Gary Lynagh. They raced at two Rowing World Cups in Europe before contesting the 1997 World Rowing Championships in Aiguebelette, France where they finished fifth.\nIn 1998 the Australian selectors switched Edwards to sweep-oared representative crews and he raced at two World Rowing Cups in Europe and at the 1998 World Rowing Championships in the lightweight coxless four. They won the bronze medal at Cologne 1998. He remained in that combination with Darren Balmforth, Bob Richards and stroked by the Tasmanian lightweight champion Simon Burgess into 1999. They finished in fifth place at St Catharines 1999.\nThat same combination made their Olympic preparation through two World Rowing Cups in Europe in 2000 before contesting the 2000 Sydney Olympics with Richards at stroke and Burgess at bow. Edwards held his position in the two seat through their Olympic campaign which showcased two match races between the Australians and the French crew. They met in a semi-final where the Australians pipped the French by 3/100ths of a second. In the final the Australians led for much of the race. The French tried once to break through and failed, then a second time and failed and finally with a matter of metres to go broke through to win by less than half a second. Both races were superb and a highlight of the regatta.\nEdwards took a break in 2001 but was back in national selection contention in 2002 as a lightweight sculler. He was Australia's lightweight single sculls representative at the World Rowing Cup II in Lucerne and for the 2002 World Rowing Championships in Seville where he placed fifth. For Milan 2003 he was selected with Queensland's Haimish Karrasch to race the lightweight double scull. They finished in tenth place.\nFor the 2004 Athens Olympics Edwards made his way back into the Australian lightweight coxless four. Both Edwards and Simon Burgess were making their third Olympic appearances and still looking for their first Olympic gold medal. The Danish crew however were favourites and they got away in the 1st 500m. Burgess brought the Australian crew back into contention in the second and third 500 metres. However the Danes still had something in reserve in the rush home extending their lead to 1.4 seconds at the finish. Edwards and Burgess with newcomers Ben Cureton and Glen Loftus won an Olympic silver medal.\nEdwards came back into the lightweight coxless four in 2007 with Cureton, Todd Skipworth and Rod Chisholm from New South Wales. They raced at a 2007 World Rowing Cup and then at the 2007 World Rowing Championships in Munich to a seventh placing. Their lead-up to the 2008 Beijing Olympics included a third place at the World Rowing Cup III in Poznan and a seventh place at the WRC I. In Beijing the experienced lightweight foursome didn't figure in the medals in the tough Olympic conditions, they made the B final and finished in ninth place overall.\nAt the 2010 World Rowing Championships in Lake Karapiro, Edwards rowed in the Australian lightweight four with Skipworth, Blair Tunevitsch and Samuel Beltz to a silver medal. It was a thrilling race finish where five crews crossed the line within half a boat length. The Australian four with Edwards at the bow, finished 0.07 secs behind Great Britain and 0.01 secs ahead of China to claim his fourth world championship medal – a silver.\nIn 2011 that Australian lightweight four stayed together with Tunevitsch changed out for West Australian Ben Cureton. At the 2011 World Rowing Championships in Bled they staged a brilliant campaign. Second in their heat, they had to qualify for the final through a repechage and a semi-final. In the final they rowed through the field from a fifth position at the 500m mark, to be 2nd at both the 1000 and 1500 and overtook the Italians in final run to take the gold medal with a 1.2 second margin. Edwards in the bow seat won his first senior world championship title, nineteen years after first representing Australia in green and gold.\nTheir world champion status qualified the lightweight foursome for the 2012 London Olympics for which they prepared by racing at two World Rowing Cups in Europe. At the 2012 Olympic regatta they placed second in the heat, third in the semi-final and made the Olympic final, finishing in fourth place. Less than one and a quarter seconds separated the first to fourth crews. Cureton, Skipworth and Edwards all retired at that point. For Edwards it was the end of a twenty-year stellar representative career.\nPost-rowing\nEdwards currently is the Head of Rowing for The Friends' School in Hobart, Tasmania. He previously worked for the State Development Officer for Rowing Tasmania, and has extensive involvement in the selection of Tasmanian state crews. In 2010 he was inducted as a member of the Rowing Victoria Hall of Fame.\nRowing Palmares\nOlympics\n*1996 Atlanta Olympics LM2x bow – bronze\n*2000 Sydney Olympics LM4- two seat – silver\n*2004 Athens Olympics LM4- two seat – silver\n*2008 Beijing Olympics LM4- two seat – ninth\n*2012 London Olympics LM4- two seat – fourth\nWorld Championships\n*1992 Trans Tasman Under 23 Series Lwt single scull\n*1993 World Rowing Championships Lwt quad scull three seat – seventh\n*1994 World Rowing Championships Lwt quad scull three seat – fifth\n*1995 World Rowing Championships Lwt double scull bow – bronze\n*1997 World Rowing Championships Lwt double scull bow – fifth\n*1998 World Rowing Championships Lwt four three seat – bronze\n*1999 World Rowing Championships Lwt four two seat – silver\n*2002 World Rowing Championships Lwt single scull – fifth\n*2003 World Rowing Championships Lwt double scull – bow tenth\n*2007 World Rowing Championships Lwt four two seat – seventh\n*2010 World Rowing Championships Lwt four bow – silver\n*2011 World Rowing Championships Lwt four bow – gold\nNational Interstate Regatta\n*1995 Interstate men's sculling championship (VIC) – second\n*1996 Interstate men's lwt four championship (VIC) three seat – first\n*1997 Interstate men's lwt four championship (VIC) three seat – second\n*1998 Interstate men's lwt four championship (VIC) three seat – second\n*1999 Interstate men's lwt four championship (VIC) three seat – second\n*2000 Interstate men's lwt four championship (VIC) two seat – third\n*2002 Interstate men's lwt four championship (VIC) two seat – fourth\n*2003 Interstate men's lwt four championship (VIC) three seat – sixth\n*2004 Interstate men's lwt four championship (VIC) bow – second\n*2010 Interstate men's lwt four championship (TAS) two seat – first\nReferences\nExternal links\n*\n*[https://web.archive.org/web/20080723212300/http://www.olympics.com.au/Athletes/TheTeam/tabid/343/Athletes/TheTeam/tabid/344/Default.aspx?cId=13130&teamId=17 Australian Olympic Committee profile]\n*"
    }
  ]
}