{
  "content": [
    {
      "type": "text",
      "text": "# Anthony Kingston\n\nSir Anthony Kingston (ca. 1508 – 14 April 1556) was an English royal official, holder of various positions under several Tudor monarchs.\nFamily\nAnthony Kingston was the son of Sir William Kingston of Blackfriars, London by one of Sir William's first two wives, either Anne (née Berkeley), the widow of Sir John Guise (died 30 September 1501), or Elizabeth, whose surname is unknown. He had a sister, Bridget, who married Sir George Baynham (died 6 May 1546) of Clearwell, Gloucestershire, son and heir of Sir Christopher Baynham (died 6 October 1557).\nSir William Kingston married thirdly, Mary (née Scrope), widow of Edward Jerningham (died 6 January 1515), and daughter of Richard Scrope (died 1485): by her Sir William had no issue. This third marriage of his father's brought to Anthony Kingston four step-brothers, Sir Henry Jerningham (who married Frances, daughter of Sir George Baynham, and died in 1572), Ferdinand Jerningham, Edmund Jerningham (died 9 February 1546) and Edward Jerningham, and a step-sister, Elizabeth Jerningham.\nCareer\nKingston served at the head of a thousand Gloucestershire men under the Duke of Norfolk in the suppression of the Pilgrimage of Grace, 1536–7, and fought in the defeat (13 October 1536) of the rebels at Louth. He was knighted by Henry VIII on 18 October 1537. He held offices about the court, such as that of serjeant of the king's hawks, and received land formerly belonging to the suppressed monasteries in Gloucestershire, including a regrant of the site of Flaxley Abbey. He was appointed High Sheriff of Gloucestershire for 1533–34 and 1550–51.\nAfter the death of Sir William Courtenay of Powderham in 1535, Kingston married his widow, Mary, daughter of Sir John Gainsford, and left Gloucestershire to reside at Chudleigh, Devon, which, with Honiton, belonged to his wife's jointure. Kingston sat in the House of Commons for Gloucestershire in the parliaments of 1539, ?1542, 1545, 1547, 1552–3, and 1555.\nIn 1549 Kingston was granted the rank of provost marshal by King Edward VI and was involved in the suppression of the Prayer Book Rebellion in 1549. After the main rebellion had been defeated, John Russell, 1st Earl of Bedford ordered Kingston to take charge of pacification operations in the West Country. Kingston subsequently ordered the executions of numerous individuals suspected of involvement with the rebellion as part of the post-rebellion reprisals. These included figures such as mayor of Bodmin Nicholas Boyer, portreeve of St Ives John Payne and mayor of Gluvian William Mayow, the latter of which was hanged outside a tavern in St Columb. Several priests were hanged, including Richard Bennett (vicar of St Veep and St Neot) and Simon Morton (vicar of Poundstock and the curate of Pillaton). John Hooker contributed an account of the rebellion to the 2nd edition of Raphael Holinshed's Chronicles in which he gives the name of the eight clergymen who were executed. Others such as Robert Voyse, vicar of St Cleer, and the Vicar of St Keverne were attainted. After the reprisals, antiquary Richard Carew observed that in Cornwall Kingston \"hath left his name more memorable than commendable\".\nKingston was a member of Edward VI's council for the marches of Wales. When Lady Jane Grey succeeded Edward, she sent orders to Kingston and Sir John St. Loe to levy forces and march towards Buckinghamshire (16 July 1553), but her reign was over before they had time to obey.\nIn 1552, Kingston was cited before John Hooper, bishop of Gloucester, on a charge of adultery. At first Kingston refused to appear, and when at length he came, he beat and abused the bishop, who sternly rebuked him, fined him £500, and forced him to do penance. He afterwards owned that Hooper had converted him from his evil life, and took a touching farewell of the bishop (8 February 1555) before the latter's martyrdom at the stake.\nKingston was Knight marshal in the parliament of 1555 and a supporter in it of the Protestant religion. It is said that he took the keys of the house away from the sergeant, with, it seems, the approval of the majority. But on 10 December, the day after parliament was dissolved, he was sent to the Tower of London on a charge of conspiring to put Elizabeth on the throne. He remained there till the 23rd, when he submitted, asked pardon, and was discharged.\nThe next year, 1556, Kingston was concerned in a plot to rob the exchequer in order to provide funds for the conspiracy devised by Sir Henry Dudley with the object of making Elizabeth queen and marrying her to Edward Courtenay, 1st Earl of Devon. Six confederates were executed, but Kingston died, possibly by his own hand, on 14 April 1556 at Cirencester, or on his way from Devon to London to stand trial.\nMarriages and issue\nKingston married firstly, before October 1524, Dorothy Harpur, the daughter of Robert Harpur, and secondly, by 1537, Mary Gainsford, widow of Sir William Courtenay (d.1535) of Powderham, and daughter of Sir John Gainsford of Crowhurst, Surrey. He had no issue by either marriage, but by a mistress had two illegitimate sons, Anthony and Edmund, on whom by a deed of feoffment he settled part of his estates in 1547.\nReferences\nExternal links\n*\n*\n;Attribution\n*[http://www.tudorplace.com.ar/Bios/AnthonyKingston.htm Tudor Place.com]"
    }
  ]
}