{
  "content": [
    {
      "type": "text",
      "text": "# Anthony Warlow\n\n| birth_place      = Wollongong, New South Wales, Australia\n| origin           =\n| death_date       =\n| death_place      =\n| occupation       =  Singer, actor\n| known_for        = The Phantom of the OperaAnnieJekyll & Hyde\n| years_active     = 1980–present\n| website          =\n}}\nAnthony Warlow  (born 18 November 1961) is an Australian  musical theatre performer, noted for his character acting and considerable vocal range. He is a classically trained lyric baritone and made his debut with the Australian Opera in 1980.\nWarlow has performed on Broadway, the West End, Carnegie Hall and across Australia with all of the symphony orchestras. His studio recordings have spanned three decades and include solo albums, cast recordings and live performances in concert and with Opera Australia.\nHe has been honoured as an Australian National Treasure\nand his achievements have been acknowledged with his investiture as a Member of the Order of Australia (AM) for his services to the performing arts.\nPerformances\nMusical theatre\nWarlow's notable musical theatre roles include lead roles in The Phantom of the Opera (as The Phantom), The Secret Garden (as Archibald Craven), Annie (as Daddy Warbucks), Guys and Dolls (as Sky Masterson), My Fair Lady (as Henry Higgins), Jekyll & Hyde (original Gothic thriller cast recording and, for the 25th anniversary, as Dr Henry Jekyll / Edward Hyde), Man of La Mancha (as Don Quixote), A Little Night Music (as Frederik Egerman), Sweeney Todd: The Demon Barber of Fleet Street (as Sweeney Todd), as well as a significant supporting role in Les Misérables (as Enjolras). Circa 1988, he was internationally regarded as the best Enjolras and was honoured by being selected for the complete symphonic recording, along with leading Les Misérables performers from around the world along with fellow Australian actor Philip Quast as Javert. This was arguably his break-through role, as he was cast as the Phantom as the Australian tour of Les Misérables was ending. In 1998, he played Teen Angel in  Grease: The Arena Spectacular. He performed the role of Doctor Yuri Zhivago in the new musical adaptation of Boris Pasternak's novel Doctor Zhivago. In 2012, Warlow reprised his role as Daddy Warbucks in Annie at the Lyric Theatre, Star City, for a strictly limited season of 12 weeks.\nWarlow made his long-awaited debut on Broadway, New York, in the James Lapine-directed Annie in the role of Daddy Warbucks at the Palace Theatre. From June to September 2015, he played Charles Frohman/Captain Hook in Finding Neverland on Broadway. From December 2015 to May 2016, he returned to Australia playing the part of Tevye in Fiddler on the Roof.\nWarlow reprised the title roles in Jekyll & Hyde in October 2019 (His first time playing the roles on stage) in a 25th anniversary concert tour. The production first performed with the Melbourne Symphony Orchestra at the Arts Centre Melbourne and then in November in Sydney at the ICC Sydney Theatre with the Sydney International Orchestra.\nIn 2020, he was set to reprise his role of Archibald Craven in The Secret Garden in Australia. However, the production was cancelled due to the COVID-19 pandemic.\nOpera\nWarlow's opera roles with Opera Australia include major roles in Die Fledermaus (Gabriel Eisenstein), The Magic Flute (Papageno), ''A Midsummer Night's Dream (Puck) and The Tales of Hoffmann''.\nGilbert and Sullivan\nWarlow's Gilbert and Sullivan roles for Opera Australia include the featured comedic roles of Ko-Ko in The Mikado (2004–2009), Archibald Grosvenor in Patience (1996), Pirate King in The Pirates of Penzance (2006–2007–2010) and in the 2005 double-bill of Trial by Jury (as the Learned Judge) and H.M.S. Pinafore (as Captain Corcoran). Apart from The Mikado, these Gilbert and Sullivan productions are available on DVD. In 1987, Warlow also performed a one-man show originally written for John Reed, called A Song to Sing, O, about George Grossmith, the comedian who originated the principal comic roles for Gilbert and Sullivan from 1877 through the 1880s.\nOther performances\nWarlow performed \"Advance Australia Fair\" at the 1993 NSWRL Grand Final on 26 September 1993 and at the 2008 NRL Grand Final on 5 October 2008.\nThe Pirates of Penzance tour: 2006–2007\nBetween 2 August 2006 and 2 June 2007, Warlow appeared in the Opera Australia production of The Pirates of Penzance (a popular Gilbert and Sullivan comic opera), in which he played the role of the \"Pirate King\" – with performances during 2006 in Sydney, New South Wales (at the Sydney Opera House), in Canberra, Australian Capital Territory and in Brisbane, Queensland (at the Lyric Theatre, Queensland Performing Arts Centre), as well as enjoying full houses in Melbourne, Victoria in 2007.\nWarlow's Pirate King appeared in dress, voice and mannerism very similar to Captain Jack Sparrow from Pirates of the Caribbean. In a press interview in Brisbane, Warlow said that he had deliberately based his Pirate King on Johnny Depp's character from Pirates of the Caribbean so that people who may not know the opera but are aware of the Pirates of the Caribbean trilogy of movies could enjoy the opera more. This production of The Pirates of Penzance was shown on television by the Australian Broadcasting Corporation on 9 December 2006. A DVD of the production was subsequently released.\nThe Phantom of the Opera: 2007–2009\nWarlow first portrayed the Phantom in Andrew Lloyd Webber's The Phantom of the Opera in the original Australian production, circa 1990. It was announced in October 2006 that Phantom would re-open in Melbourne the following year and that Warlow had agreed to reprise his role as \"The Phantom\".\nPhantom reopened in Melbourne at the Princess Theatre, its original home, on 19 July 2007. Although he performed for the industry opening night, Warlow was struck down by a bout of influenza that had also claimed many of the other cast and crew, and as a result, he missed the first two and a half weeks of the show's Melbourne season. Understudy Simon Pryce performed in his place until he made his return on 9 August 2007.\nUnlike the original Australian Phantom, Warlow played the Phantom for the two-year tour of Australia and New Zealand. The Phantom of the Opera opened at Melbourne's Princess Theatre on 28 July 2007, then at Brisbane's Lyric Theatre in February 2008 followed by Sydney's Lyric Theatre in May 2008. After closing in Sydney on 14 September, the production moved to Auckland, New Zealand and following a holiday break, subsequently opened in Perth in February 2009. The last stop on the tour was Adelaide where Warlow donned the mask for the final time on 23 May 2009. Warlow appeared as a guest at the 25th anniversary production of The Phantom of the Opera at the Royal Albert Hall in London.\nPersonal life\nWarlow was found to be suffering from Non-Hodgkin's Lymphoma in 1992, during the early publicity for the arena production of Jesus Christ Superstar where he was to appear as Pontius Pilate. He had to put his career on hold for about a year while he dealt with the disease. He returned to the performance circuit in the second half of 1993 with a national concert tour for the launch of his Back in the Swing album.  He has since done promotional work for the Leukaemia Foundation of Australia.\nHis fourth solo album, Midnight Dreaming, reached the top ten of the Australian Aria Charts. Warlow also briefly appeared on the ARIA Singles Chart in 1998 with the double A-side single \"Beauty School Dropout/My Prayer\". Warlow was back on television, in a concert performance, on the night of 24 December 2006 (the concert was shown by the Australian Broadcasting Corporation).\nNotable theatre roles\n{| class=\"wikitable\"\n|+\n!Year(s)\n!Show\n!Role(s)\n!Production\n|-\n|1984\n|Fiddler on the Roof\n|Fyedka\n|Australian tour\n|-\n|1985–1986\n|Guys and Dolls\n|Sky Masterson\n|rowspan=\"3\" |Australian\n|-\n|1987\n|A Song To Sing, O\n|George Grossmith\n|-\n|1987–1989\n|rowspan=2|Les Misérables\n|rowspan=2|Enjolras\n|-\n|1989\n|Complete Symphonic Recording\n|-\n|1990–1991\n|The Phantom of the Opera\n|The Phantom of the Opera\n|Australian tour\n|-\n|1994\n|Jekyll & Hyde\n|Doctor Henry JekyllMr. Edward Hyde\n|Concept Album\n|-\n|1995\n|Patience\n|Archibald Grosvenor\n|Australian\n|-\n|1995–1996\n|The Secret Garden\n|Lord Archibald Craven\n|Australian tour\n|-\n|1996\n|My Fair Lady\n|Professor Henry Higgins\n|rowspan=2|Australian\n|-\n|1997\n|Die Fledermaus\n|Gabriel Von Eisenstein\n|-\n|1998\n|Grease\n|Teen Angel\n|rowspan=3|Australian tour\n|-\n|2000–2001\n|Annie\n| Oliver “Daddy” Warbucks\n|-\n|2002\n|Man of La Mancha\n|Don QuixoteMiguel de Cervantes\n|-\n|2004\n|Sunset Boulevard\n|Max von Mayerling\n|rowspan=\"3\" |Australian\n|-\n|rowspan=\"2\" |2005\n|Trial by Jury\n|Learned Judge\n|-\n|H.M.S. Pinafore\n|Captain Corcoran\n|-\n|2006–2007\n|The Pirates of Penzance\n|The Pirate King\n|rowspan=\"2\" |Australian tour\n|-\n|2007–2009\n|The Phantom of the Opera\n|The Phantom of the Opera\n|-\n|2009-2010\n|A Little Night Music\n|Fredrik Egerman\n|Australian\n|-\n|2011\n|Doctor Zhivago\n|Doctor Yurii Zhivago\n|rowspan=2|Australian tour\n|-\n|2011–2012\n|rowspan=\"2\" |Annie\n|rowspan=\"2\" |Oliver “Daddy” Warbucks\n|-\n|2012–2014\n|Broadway\n|-\n|rowspan=2|2015\n|Man of La Mancha\n|Don QuixoteMiguel de Cervantes\n|Washington D.C.\n|-\n|Finding Neverland\n|Charles FrohmanCaptain James Hook\n|Broadway\n|-\n|2015–2016\n|Fiddler on the Roof\n|Tevye the Dairyman\n|rowspan=\"4\" |Australian tour\n|-\n|2017–2018\n| The Wizard of Oz\n|Professor MarvelThe Wonderful Wizard of Oz\n|-\n|rowspan=\"2\" |2019\n|Sweeney Todd: The Demon Barber of Fleet Street\n|Sweeney Todd\n|-\n|Jekyll & Hyde\n|Doctor Henry JekyllMr. Edward Hyde\n|-\n|2022\n|Titanic the Musical\n|Captain Edward John Smith\n|Australian\n|-\n|2023–2024\n|Chicago\n|Billy Flynn\n|rowspan=2|Australian tour\n|-\n|2025\n|Annie\n| Oliver “Daddy” Warbucks\n|}\nRecordings\nStudio albums\n{| class=\"wikitable plainrowheaders\" style=\"text-align:center;\" border=\"1\"\n|+ List of studio albums, with selected details, chart positions and certifications\n! scope=\"col\" rowspan=\"2\" | Title\n! scope=\"col\" rowspan=\"2\" | Album details\n! scope=\"col\" colspan=\"1\" | Peak chartpositions\n! scope=\"col\" rowspan=\"2\" style=\"width:10m;\"| Certifications\n|-\n! scope=\"col\" style=\"width:3em; font-size:90%\"| AUS\n|-\n! scope=\"row\" | Centre Stage\n|\n* Released: November 1990\n* Label: Polydor (511 223–2)\n* Formats: CD, cassette, LP\n| 4\n|\n*ARIA: Gold\n|-\n! scope=\"row\" | On the Boards\n|\n* Released: April 1992\n* Label: Polydor (513 402–2)\n* Formats: CD, cassette\n| 5\n|\n*ARIA: Gold\n|-\n! scope=\"row\" | Back in the Swing\n|\n* Released: June 1993\n* Label: Polydor (519 563–2)\n* Formats: CD, cassette\n| 3\n|\n*ARIA: Gold\n|-\n! scope=\"row\" | Midnight Dreaming\n|\n* Released: September 1994\n* Label: Polydor (523 612–2)\n* Formats: CD, cassette\n| 10\n|\n|-\n! scope=\"row\" | Face the Music\n|\n* Released: October 2003\n* Label: Sony (5136192000)\n* Formats: CD\n| 18\n|\n|-\n! scope=\"row\" | Tenor and Baritone  (with David Hobson)\n|\n* Released: 2005\n* Label: Skylark Records\n* Formats: CD\n| —\n|\n|}\nLive albums\n{| class=\"wikitable plainrowheaders\" style=\"text-align:center;\" border=\"1\"\n|+ List of live albums, with selected details, chart positions and certifications\n! scope=\"col\" rowspan=\"2\" | Title\n! scope=\"col\" rowspan=\"2\" | Album details\n! scope=\"col\" colspan=\"1\" | Peak chart positions\n! scope=\"col\" rowspan=\"2\" style=\"width:10m;\"| Certifications\n|-\n! scope=\"col\" style=\"width:3em; font-size:90%\"| AUS\n|-\n! scope=\"row\" | Highlights from The Main Event  (with John Farnham and Olivia Newton-John)\n|\n* Released: November 1998\n* Label: Sony BMG (7432163883-2)\n* Formats: CD, cassette, DVD\n| 1\n|\n*ARIA: 5× Platinum\n|}\nCompilation albums\n{| class=\"wikitable plainrowheaders\" style=\"text-align:center;\" border=\"1\"\n|+ List of compilation albums, with selected details, chart positions and certifications\n! scope=\"col\" rowspan=\"2\" | Title\n! scope=\"col\" rowspan=\"2\" | Album details\n! scope=\"col\" colspan=\"1\" | Peak chartpositions\n! scope=\"col\" rowspan=\"2\" style=\"width:10m;\"| Certifications\n|-\n! scope=\"col\" style=\"width:3em; font-size:90%\"| AUS\n|-\n! scope=\"row\" | Best of Act One\n|\n* Released: July 1996\n* Label: Polydor (533 152–2)\n* Formats: CD, cassette, LP\n| 10\n|\n*ARIA: Gold\n|}\nCharted singles\n{| class=\"wikitable plainrowheaders\" style=\"text-align:center;\"\n|+List of charted singles, with selected chart positions\n! rowspan=\"2\" | Title\n! rowspan=\"2\" | Year\n! colspan=\"1\" | Chart positions\n|-\n! scope=\"col\" style=\"width:3em; font-size:90%\"| AUS\n|-\n! scope=\"row\"| \"Beauty School Drop Out\" / \"My Prayer\"\n| 1998\n| 31\n|-\n|}\nCast albums\n* Les Misérables – Complete Symphonic Recording (1988)\n* Jekyll & Hyde – The Complete Works Recording (1994)\n* The Secret Garden – Australian Cast Recording (1995)\n* Patience – The Australian Opera (1995)\n*The Phantom of the Opera at the Royal Albert Hall (2012)\n* Annie – Australian Cast Recording (2012)\n* Annie – New Broadway Cast Recording (2013)\nDVDs\n* Patience – Opera Australia production (1996)\n* Die Fledermaus – Opera Australia production (1997)\n* The Main Event – with John Farnham and Olivia Newton-John (1998)\n* H.M.S. Pinafore / Trial by Jury – Opera Australia production (2005)\n* The Pirates of Penzance – Opera Australia production (2006)\n* The Phantom of the Opera at the Royal Albert Hall (2012)\nAwards and nominations\n*Helen Hayes Award, Washington: Winner (2015): Outstanding Actor in a Musical (\"Don Quixote\" in  Man of La Mancha)\n*Drama Desk Award, New York: Nominee (2013): Outstanding Actor in a Musical \"Oliver \"Daddy\" Warbucks\" in Annie\n*Green Room Awards, Melbourne, Australia\n** Winner (1990): Male Actor in a Featured Role – Music Theatre (\"Enjolras\" in Les Misérables)\n** Winner (1991): Male Actor in a Leading Role – Music Theatre (\"Phantom\" in The Phantom of the Opera)\n** Nominee (2001): Male Actor in a Leading Role – Music Theatre (\"Oliver \"Daddy\" Warbucks\" in Annie)\n*Helpmann Awards, Australia\n** Nominee (2001): Best Male Actor in a Musical (\"Daddy Warbucks\" in Annie)\n** Nominee (2003): Best Male Actor in a Musical (\"Don Quixote\" in Man of La Mancha)\n** Nominee (2008): Best Male Actor in a Musical (\"Phantom\" in The Phantom of the Opera)\n** Nominee (2011): Best Male Actor in a Musical (\"Yuri Zhivago\" in Doctor Zhivago)\n** Nominee (2012): Best Male Actor in a Musical (\"Daddy Warbucks\" in Annie)\n** Nominee (2016): Best Male Actor in a Musical (\"Tevye\" in Fiddler on the Roof)\nMo Awards\nThe Australian Entertainment Mo Awards (commonly known informally as the Mo Awards), were annual Australian entertainment industry awards. They recognise achievements in live entertainment in Australia from 1975 to 2016. Anthony Warlow won eleven awards in that time.\n(wins only)\n|-\n|rowspan=\"2\"| 1990\n| Anthony Warlow\n| Musical Theatre Performer of the Year\n|\n|-\n| Anthony Warlow\n| Male Musical Theatre Performer of the Year\n|\n|-\n|rowspan=\"2\"| 1991\n| Anthony Warlow\n| Musical Theatre Performer of the Year\n|\n|-\n| Anthony Warlow\n| Male Musical Theatre Performer of the Year\n|\n|-\n| 1993\n| Anthony Warlow\n| Australian Performer of the Year\n|\n|-\n| 1995\n| Anthony Warlow\n| Male Musical Theatre Performer of the Year\n|\n|-\n|rowspan=\"2\"| 1998\n| Anthony Warlow\n| Arena Performer of the Year\n|\n|-\n| The Main Event (Anthony Warlow, John Farnham and Olivia Newton-John)\n| Australian Performer of the Year\n|\n|-\n| 2004\n| Anthony Warlow\n| Australian Performer of the Year\n|\n|-\n| 2007\n| Anthony Warlow\n| Classical / Opera Performer of the Year\n|\n|-\n| 2008\n| Anthony Warlow\n| Classical / Opera Performer of the Year\n|\n|-\nReferences\nExternal links\n*\n*\n* [https://www.theage.com.au/entertainment/music/warlow-manages-success-alone-20050419-ge001c.html \"Warlow manages success alone\"], The Age, 19 April 2009"
    }
  ]
}