{
  "content": [
    {
      "type": "text",
      "text": "# Antimonumenta (Guadalajara)\n\n| weight        =\n| visitors_num  =\n| visitors_year =\n| begin         =\n| complete      =\n| dedicated     =\n| open          =\n| restore       =\n| dismantled    =\n| dedicated_to  = Victims of violence against women in Mexico\n| map_name      =\n| map_text      =\n| mapframe      = yes\n| mapframe-zoom = 14\n| mapframe-caption = Location\n| map_width     =\n| map_relief    =\n| coordinates   =\n}}\nAn antimonumenta was installed in the Plaza de Armas, in Guadalajara, Jalisco, on 25 November 2020, the date commemorating the International Day for the Elimination of Violence against Women, during the annual march of women protesting against gender violence. The sculpture is symbolically named Antimonumenta and it was inspired by the anti-monument of the same name placed in Mexico City a year prior.\nDuring the same march, feminists also installed a red bench, which was placed in front of the Rotonda de los Jaliscienses Ilustres, and symbolically renamed Plaza de Armas to Plaza Imelda Virgen, a murdered woman. The erection of an antimonumenta symbolizes the demand for justice for women who suffer from violence in the country.\nHistory and installation\nin 2021. The Antimonumenta (below) is opposite to the State Government Palace of Jalisco]]\nThe Antimonumenta was installed on 25 November 2020 in the Plaza de Armas, in the historic center of Guadalajara, Jalisco. It was placed during the annual march of women protesting against gender violence on International Day for the Elimination of Violence against Women. It occurred amid the 2020 COVID-19 pandemic in Mexico in which 230 women were killed between January and September of that year and 39 of them were investigated as femicides. During the installation, Enrique Ibarra Pedroza, Secretary General of the State Government, tried to negotiate the site where the Antimonumenta would be placed but only received complaints that he should have attended to them when they requested meetings to talk to him.\nAlthough similar in shape, the antimonumentas installed across the country have different inscriptions. The installers also symbolically renamed Plaza de Armas to \"Plaza Imelda Virgen\". Imelda Josefina Virgen Rodríguez was an academic and the first woman to be killed after the approval of femicide as a crime in Jalisco. According to the prosecutors, in September 2012 her husband hired two others to rape and kill her. Her husband was charged with parricide and the others with first-degree murder; none were charged with femicide. In 2017 her husband received a sentence that was appealed and the trial had to be re-tried. By November 2020, the second trial was appealed and was awaiting a new trial.\nOn 8 March 2021, the date commemorating International Women's Day and during the annual march, multiple women performed a song titled \"Canción sin miedo\" next to the Antimonumenta.\nDescription and meaning\nThe Antimonumenta is painted in purple and pink and it is represented with the symbol of the feminist struggle, which is based on the symbol of Venus with a raised fist in the center. In feminism, the color purple represents \"loyalty, constancy towards a purpose [and] unwavering firmness towards a cause\". According to the installers, it represents the victims of femicide in the state of Jalisco and it is a method to demand that the authorities and society stop femicides.\nIt is a metal sculpture whose upper part has written in Spanish, in pink capital letters: \"Neither forgive nor forget\", while on the arm of the cross it is written \"No + femicides\". On the opposite side, the Antimonumenta reads \"Memory, truth and justice\", and in the central part \"Not one more\". It is  high and weighs .\nRed bench\n| restore       =\n| dismantled    =\n| dedicated_to  = Victims of violence against women in Mexico\n| map_name      =\n| map_text      =\n| mapframe      = yes\n| mapframe-zoom = 14\n| mapframe-caption = Location\n| map_width     =\n| map_relief    =\n| coordinates   =\n}}\nOn the same date, but in front of the Rotonda de los Jaliscienses Ilustres, located a few blocks away from Plaza de Armas, it was installed a red bench which was also symbolically named Antimonumenta, but referred to as \"Banca Roja\" to distinguish it from the other anti-monument.\nAs part of a global campaign, red benches are installed to denounce gender violence as they symbolize those who were and those who will come. In 2019, a bench was installed at the University of Guadalajara. The 25 November red bench was placed in front of the Rotonda de los Jaliscienses Ilustres. In the middle of it there is a plaque with a message that reads \"In memory of all the women murdered by those who claimed to love them or just because they were women.\"}}\nReception\nWriter Manuel Baeza said the Antimonumenta has two functions: to gratify women who were silenced by centuries and to incomodate the observants due to its colorful nature in a location surrounded by historical stone-colored buildings while remembering that violence against women, like the artwork, is out of place.\nIbarra Pedroza attempted to negotiate the removal of the monument with the state's branch of the National Institute of Anthropology and History (INAH), citing that it was against their guidelines since it was a historic area and it had to be respected. Architects cited the building of the Guadalajara Centro railway station as an example of previous omissions to those guidelines. The director of the state's INAH, Alicia García Vázquez, mentioned that it should \"remain in that space, because in the end it symbolically represents these disappeared or murdered women\" and that its permanence should be analyzed like any other monument.\nSee also\n*Feminist art\nNotes\nReferences\nFurther reading\n*\nExternal links\n*"
    }
  ]
}