{
  "content": [
    {
      "type": "text",
      "text": "# Anti-Discrimination Act 1991 (Queensland)\n\nThe Queensland Anti-Discrimination Act 1991 is an act of the Parliament of Queensland that provides protection against unfair discrimination, sexual harassment, and other objectionable conduct. The Act was passed by the Queensland Parliament on 3 December 1991, received assent on 9 December 1991, and commenced on 30 June 1992.\nScope of the Act\nThe Anti-Discrimination Act 1991 prohibits discrimination on the basis of the following attributes:\n* Sex\n* Relationship status\n* Pregnancy\n* Parental status\n* Breastfeeding\n* Age\n* Race\n* Impairment\n* Religious belief or religious activity\n* Political belief or activity\n* Trade union activity\n* Lawful sexual activity\n* Gender identity\n* Sexuality\n* Family responsibilities\n* Association with, or relation to, a person identified on the basis of any of the above attributes.\nAreas\nThe areas of activity where discrimination is unlawful are:\n* Work and work related (includes applying for work, voluntary work, employment, work under a contract, partnerships, employment agencies, work experience and work under a training program)\n* Education\n* Supplying goods or services\n* Accommodation (includes residential and commercial premises)\n* Administration of State laws or programs (includes State government departments and statutory authorities performing functions under an Act)\n* Club membership and affairs (does not include not-for-profit associations and clubs)\n* Superannuation\n* Insurance\n* Disposing of land (for example, selling, leasing)\n* Local government members (between local government members performing official functions, except on the basis of political belief or activity).\nAnti-Discrimination Commission Queensland\nThe implementation of the Act saw the establishment of the Anti-Discrimination Commission Queensland, an independent statutory body to resolve complaints of discrimination, sexual harassment, vilification, victimisation and other contraventions of the Anti-Discrimination Act, as well as to promote an understanding, acceptance, and public discussion of human rights in Queensland.\nLegacy\nIn 2016, the Anti-Discrimination Commission Queensland and State Library of Queensland marked the 25th anniversary of the establishment of the Act, by creating seven short videos exploring the impact of the Act on Queenslanders and feature interviews with activists, politicians, community advocates and social justice professionals.\nOn 1 July 2019, with the commencement of the Human Rights Act 2019 (Qld) the Commission was renamed as the Queensland Human Rights Commission.\nSee also\n* List of anti-discrimination acts\nReferences\nExternal links\n* [http://www.austlii.edu.au/au/legis/qld/consol_act/aa1991204/ Anti-Discrimination Act 1991]\n* [http://blogs.slq.qld.gov.au/jol/2016/11/17/25-years-of-the-anti-discrimination-act-1991-qld/ 25 years of the Anti-Discrimination Act 1991]\n* [https://onesearch.slq.qld.gov.au/permalink/61SLQ_INST/tqqf2h/alma99183359720102061 Reflecting on 25 Years of the Anti-Discrimination Act Digital Stories Collection], State Library of Queensland\n* [http://www.adcq.qld.gov.au/ Anti-Discrimination Commission Queensland]"
    }
  ]
}