{
  "content": [
    {
      "type": "text",
      "text": "# Antisemitic incidents during the Gaza War (2008–2009)\n\nAntisemitic incidents escalated worldwide in frequency and intensity during the 2008–2009 Gaza War, and were widely considered to be a wave of reprisal attacks in response to the conflict.\nThe number and severity of reported incidents was particularly high in France and the United Kingdom, countries with large Muslim and Jewish populations. The incidents, which included firebombings and arson of Jewish buildings, attacks on Jewish individuals, defacement of synagogues and vandalism, drew reactions from several governments and non-governmental organizations worldwide. Most perpetrators of these attacks have not been identified or prosecuted.\nScale\nAccording to figures released by the Global Forum Against Anti-Semitism, a body affiliated with the Jewish Agency, the number of antisemitic attacks around the world during Israel's three-week military operation against Hamas in Gaza was up more than 300% compared to the same period the preceding year, reaching a two-decade high. More than 250 incidents were reported during Israel's 22-day assault, compared to 80 during the same period the previous year. The bulk of the incidents were carried out in Western Europe and were led by local Muslims. The violent assaults included attacks against both synagogues and Jewish communities, as well as vandalism of privately owned Jewish property. The Community Security Trust confirmed that January 2009 was the worst month ever in Britain for antisemitic incidents, in the wake of Israel's action in Gaza.\nA spokesman for the Anti-Defamation League (ADL) stated that \"We have always seen a link between violence in the Middle East to antisemitism but we have never seen anything like what we are seeing now.... Not on this scale, not in this intensity.\" \"It has been the worst we've ever seen.\"\nIn Greece a sharp rise of reported antisemitic violent incidents was reported with 13 physical attacks on Jewish targets within a one-month timeframe, while the Mass Media and political establishment maintaining a heavily pro-Palestinian orientation and ignoring antisemitic attacks with \"Antisemitic references, drawing parallels with the Holocaust and the Nazis, cartoons with Nazi comparison, have been common place during this period\".\nTurkey's Jewish community stated that it has never seen anything like the antisemitism which emerged as a result of the public's fury over the situation in Gaza.\nThe head of Oslo's Jewish community spoke of an \"explosion of violence\" in anti-Jewish protests, the likes of which had never occurred in the past. Silvyo Ovadya, head of the Jewish community of Turkey, noted that \"every speech criticizing Israel has a tendency to turn into cries of 'Damn Jews.' I don't recall such an atmosphere previously.\" In the United Kingdom, the Jewish Chronicle called the outbreak the \"worst wave of hate for quarter of a century\". The BBC quoted an east London community activist who said that \"the level of anger is so great over Gaza – nothing I have ever seen before, much higher than over Afghanistan.\"\nThreats and intimidation\nMahmoud Zahar, a leading member of Hamas, made a statement reported by the international media as a threat to kill Jewish children worldwide. Zahar said that the Israelis \"have legitimised the murder of their own children by killing the children of Palestine... They have legitimised the killing of their people all over the world by killing our people.\" Basim Naim, the minister of health in the Hamas government in Gaza, later claimed that this statement had been misunderstood, and that Hamas has \"no quarrel with the Jewish people\". Douglas Davis of the Australia/Israel & Jewish Affairs Council commented on Naim's statement by quoting from Article 7 of the Hamas Charter: \"The Prophet, prayer and peace be upon him, said: 'The [end of days] will not come until Muslims fight the Jews and kill them; until the Jews hide behind rocks and trees, which will cry: O Muslim, there is a Jew hiding behind me, come and kill him!'\".\nJoods Actueel, a Belgian Jewish magazine, received a dozen death threats on its website, including a threat to carry out a suicide attack to \"avenge the suffering of the Palestinians\". In Turkey, Jews in Istanbul did not want to be identified as Jews and were afraid to walk down the street. In Indonesia, protestors shut down the country's only synagogue, threatening to drive out the country's Jews.\nAccording to the Federal Bureau of Investigation, on 30 Dec 2008, Mohammed T. Alkaramla sent a letter threatening to bomb the Ida Crown Jewish Academy in Chicago.    The letter threatened that explosives would be set off around the school unless the violence in Gaza stopped by 15 Jan 2009.    Alkaramla wrote, \"It [sic] very important to make quick action before we make our decisions to set bombs.\"\nOn 7 January 2009 the UK tabloid newspaper The Sun printed a false story claiming that participants in a discussion on Ummah.com, a British Muslim internet forum, had made a \"hate hit list\" of British Jews to be targeted by extremists over the 2008–2009 Israel–Gaza conflict. The story was widely covered in the press and prompted the police to advise prominent British Jews to review their security arrangements. It was subsequently revealed that Glen Jenvey, the source of the story in The Sun, had himself been posting to the forum under the pseudonym \"Abuislam\" and created the only evidence that pointed to anything other than a peaceful letter-writing campaign. The story has since been removed from The Sun's website following complaints to the UK's Press Complaints Commission. On 23 February 2009, Sir Alan Sugar, who was named as a terror target in Jenvey's story, instituted legal action against The Sun for publishing the article.\nIncidents\nThis section details incidents of physical attacks against Jewish persons and property, as well as discrimination and antisemitic statements by government officials. More minor incidents such as antisemitic harassment and hate speech in the context of anti-Israel demonstrations were reported in Argentina, Australia, Canada, and Turkey. Nazi imagery, offensive to most Jews, and slogans suggesting comparison between the Holocaust and Israel's current actions were used in anti-Israel rallies across Europe. The European Union's Fundamental Rights Agency states that \"drawing comparisons of contemporary Israeli policy to that of the Nazis\" is one of several possible manifestations of antisemitism with regard to Israel. Most protesters, however, rejected any accusation of antisemitism. Antisemitic statements also increased on blogs and internet forums.\nAfrica\nSouth Africa\nSouth African Deputy Foreign Minister Fatima Hajaig made allegedly antisemitic comments at a pro-Palestinian rally in Lenasia. She was quoted as saying \"They in fact control [America], no matter which government comes into power, whether Republican or Democratic, whether Barack Obama or George Bush... The control of America, just like the control of most Western countries, is in the hands of Jewish money and if Jewish money controls their country then you cannot expect anything else.\" A Democratic Alliance spokesperson, who called her comments \"bargain-basement conspiracy mongering\", said that the Deputy Minister must apologize for her comments or be dismissed from office. Hajaig later apologized for her comments, saying \"I conflated Zionist pressure with Jewish influence.\"\nAsia\nIndonesia\nIslamists marched to the gates of the country's only synagogue stating that \"If Israel refuses to stop its attacks and oppression of the Palestinian people, we don't need to defend (the synagogue's) presence here.\" Protestors threatened to drive out the Jews of Surabaya. The synagogue has been shuttered since.\nTurkey\nAnti-Jewish articles appeared in some Turkish newspapers, and openly anti-Semitic graffiti was common. A giant swastika was daubed opposite Istanbul's Israeli Consulate and Jewish symbols were trampled and burned. Although Prime Minister Recep Tayyip Erdoğan condemned anti-Semitism, Jews in Turkey believed that anti-Semitic incidents were encouraged by Erdoğan's reaction to the conflict. A sign reading \"Jews cannot enter, dogs can\" was put at the door of a civic group's office in Eskişehir and removed after a media outcry. Silvyo Ovadya, the head of Musevi Cemaati, Turkey's main Jewish group, said in late January 2009 that there were several hundred examples of recently published writing with anti-Semitic messages linked to the Gaza conflict. He urged the state to take legal action. As a result, the number of Turkish Jews immigrating to Israel increased. Eli Cohen, director-general of the Jewish Agency's Immigration and Absorption Department in Jerusalem said that about 250 Turkish Jews were expected to move to Israel in 2009, more than double the 112 who immigrated in 2008.\nYemen\nIn Yemen, home to a small Jewish population, Jews experienced verbal and physical harassment due to Israel's offensive, and the Yemeni government planned to relocate some Jews from the town of Raydah to a residential compound in Sanaa to protect them from \"revenge\" attacks. Some Jewish children were injured, one seriously, when Muslim students threw stones at them. Anti-Israel protesters also attacked several Jewish homes, smashing windows and pelting them with rocks, and injuring at least one Jewish resident. In February, in a covert operation by the Jewish Agency, a Jewish family from Raydah was extricated from Yemen and emigrated to Israel, after suffering from antisemitic attacks and repeated death threats. A grenade had been thrown into the courtyard of the family's home in Raydah.\nEurope\nBelgium\nA Molotov cocktail was thrown at the Beth Hillel Liberal synagogue in Brussels. Rocks and other objects were thrown at a Jewish school. A Jewish home was the subject of an attempted arson. Afterwards, hundreds of protesters tried to march towards the Jewish neighborhood but were held off by police.\nDenmark\nA 28-year-old Palestinian male opened fire on a three Israeli cosmetics salesmen and two customers in a shopping mall on 31 December 2008. The shooting, which followed a period of harassment against the cosmetic stand, resulted in two Israelis being hit by shots. The perpetrator explained that he was motivated by the Middle Eastern situation.  He was sentenced to 10 years' imprisonment.\nFrance\nSixty-six antisemitic incidents were reported during the conflict in France, home to Europe's largest Muslim and Jewish populations. Numerous synagogues were attacked with petrol bombs and damaged in various towns. In Toulouse a car was rammed into the gates of a synagogue and set on fire. Leila Shahid, the Palestinian envoy to the European Union, said the \"awful incident\" was a result of images from Gaza. In Saint-Denis a petrol bomb was thrown at a synagogue which set fire to an adjacent Jewish restaurant. Offensive graffiti was also daubed on synagogues throughout the country. In Paris a rabbi's car was torched, a Jewish student was attacked and stabbed four times by Arab youths and a 15-year-old Jewish girl was assaulted by a gang of 10 youths.\nGermany\nA Jewish community center in Rostock was daubed and later stoned. The Central Council of Jews in Germany reported a significant increase in the number of hate mails and death threats during the conflict.\nGreece\nAccording to the American Jewish Committee, synagogues in Volos and Corfu as well as the Jewish Cemetery in Athens were vandalized. They also expressed concern that the Greek media had displayed antisemitism in newspapers during the conflict.\nReports from the Central Board of Jewish Communities (KIS) and local Jewish media have reported that antisemitic incidents occurred in 9 different Greek cities. In Veria the local synagogue suffered an arson attack. In Athens the walls of the Jewish cemetery were sprayed with antisemitic graffiti \"Jews Israelites Murderers\". Also several anti-Jewish and anti-Israeli protests took place with one particularly striking antisemitic character that of the neo-Nazi political party Golden Dawn where slogans like \"Ax and Fire to the Jewish Dogs\" were exclaimed. In Volos leftist groups targeted the local Jewish Community with pro-Palestinian graffiti on the walls of the Synagogue. In Drama the monument commemorating the murder of the Jews of the Greek cities of Serres, Drama, Kavala, Orestiada, Didymoteicho, Xanthi, Komotini was severely vandalized and slogans like \"Greece – Palestine no Jew will remain\" were sprayed. Also, slogans were written on the walls of the Jewish cemetery. In Thessaloniki a seminar of the Jewish Museum of Thessaloniki was canceled after receiving threats which also addressed a meeting of the Study Group for Greek Jewry at University of Macedonia in Thessaloniki. The leftist parliamentary party of Coalition of the Radical Left (SyRizA) declined to attend the Greek National Day of Remembrance of Holocaust Heroes and Martyrs because of the attendance of the Israeli ambassador.,\nIn Ioannina the local cemetery was vandalized with several tombs broken despite warnings by the President of the local Jewish community which expected the violence. Later other graffiti like swastikas appeared on the doors of the cemetery. The Corfu synagogue was vandalized with graffiti like \"Shit on Israel\" \"Jews Nazis\" and \"Murderers\". Also the Shoah Memorial was vandalized with graffiti regarding Gaza. In Larisa both groups from the extreme-Right and the extreme-Left targeted the local community; Leftist and Palestinian demonstrators attempted to vandalize the Synagogue during a march, while later the same day groups linked to neo-Nazi groups vandalized the Shoah Monument and organized protests in front of the synagogue asking for the expulsion of Jews from Larisa. In Komotini the Shoah Memorial was sprayed with graffiti equating the Star of David with the swastika.\nThe national newspaper Avriani accused the American-Jews of starting WW3 while other national newspapers like A1 which is linked to the antisemitic parliamentary party of Popular Orthodox Rally (LAOS) hosted an extremely antisemitic opinion piece by the leader of LAOS Georgios Karatzaferis where Jews were attacked as \"Christ-Killers\" and \"smelling of blood\" \"They are the worst thing of the 20th century\". Other abusive titles included the national newspaper Eleftheri Ora with \"Auschwitz – The Gaza Strip, with the Jew as baker this time\" and national newspaper Apogevmatini with \"Holocaust\". Other media often used the terms \"Jews\" and \"Israeli\" interchangeably and routinely compared Israel to Hitler and Nazi Germany.\nEminent members of the Greek Orthodox Church spoke of \"zionist monsters with sharp claws\" like the Metropolite of Pireus Serafim, or of \"Jews punished for killing Christ\" and being \"God-Killers\" like the Metropolite of Thessaloniki Anthimos. The Metropolite of Kalavryta Ambrosios spoke of \"An ongoing genocide is being held in Gaza and nobody protests!\". Similar was the stance of extremist Christian media like the newspaper Orthodoxos Typos which linked Jews with Freemasonry.\nItaly\nItalian trade union Flaica-Cub issued a call to boycott Jewish-owned shops in Rome in protest at the Israeli offensive. Rome Mayor Gianni Alemanno said the idea had \"an undeniable antisemitic flavor\", further charging that the proposal echoed the race laws under fascism in the 1930s. The union denied accusations of antisemitism, and union President Giancarlo Desiderati said the union condemns \"any form of antisemitism\".\nNetherlands\nA Molotov cocktail was thrown at a Jewish-owned building in Amsterdam, following an attempted arson of a Jewish institution in Arnhem. A synagogue in Haaksbergen and a Jewish-owned building in Oss were targeted by stoning. At an anti-Israel demonstration in Utrecht, some demonstrators shouted \"Hamas, Hamas, Jews to the gas\", a reference to the Holocaust era gas chambers. Two men were convicted in the incident. Dutch MP Harry van Bommel participated in the demonstration, leading to a complaint to the Dutch Justice Ministry accusing the parliamentarian of incitement to hate, violence and discrimination against Jews. According to Ha'aretz, in an online video van Bommel's voice can be heard while protesters chanted. Van Bommel told Haaretz he did not hear the calls, and that he would have left had he heard them.\nNorway\nIn the 2009 Oslo riots, Muslim youth attacked the Israeli embassy and yelled anti-Jewish slogans in Arabic, including \"Death to the Jews\", \"Kill the Jews\" and \"Slaughter the Jews.\" In one incident, young Muslims beat a 73-year-old man who was carrying an Israeli flag, while shouting \"Bloody Jew – get him!\" They only stopped attacking him when they realized he was a non-Jewish Norwegian.\nIn his book The Anti-Jewish Riots in Oslo, Norwegian author and editor Eirik Eiglad wrote:\nSweden\nA Jewish burial chapel in Malmö was the target of an arson attack and Jewish center in Helsingborg was set alight twice in three days.\nUnited Kingdom\nThe number of antisemitic incidents during the conflict numbered approximately 225, according to the Community Security Trust. This represents eight times the number of incidents recorded in the same period last year. 11 incidents involved physical violence; 13 synagogues were daubed and 20 Jewish buildings other than synagogues were also daubed. More than half the total have been incidents of abuse, both verbal and by email or post. Brondesbury Park Synagogue in Willesden was damaged after an attempted firebombing and a gang of between 15 and 20 youths rampaged in Golders Green trying to force their way into Jewish restaurants and shops, specifically focusing their abuse on the London Jewish Family Centre; a Jewish motorist was also dragged from his car and assaulted. Anti-Semitic graffiti with slogans including 'Kill Jews', 'Jews are scumbags' and 'Jihad 4 Israel' were also sprayed in Jewish areas across London and Manchester. Police stepped up security in Jewish neighborhoods, and members of the Jewish community were reported to have fled the country because of safety fears. High-ranking Foreign Office diplomat Rowan Laxton was arrested after allegedly launching an antisemitic tirade in a gym, while watching television reports of the Israeli attack in Gaza (when the case went to appeal, it was decided by a judge and two magistrates that Laxton had not made the comment on which the prosecution relied). The Metropolitan Police reported four times as many anti-Jewish incidents following the conflict as Islamophobic events.\nNorth America\nUnited States\nA Molotov cocktail was thrown at the North Side temple in Chicago. The glass doors at Lincolnwood Jewish Congregation were shattered by a brick, and \"Free Palestine\" and \"Death to Israel\" were spray-painted on the building. At a Jewish preschool in Camarillo, California, swastikas and anti-Semitic messages written in black marker on its sidewalk and walls.\nSouth America\nArgentina\nThe war saw a rise in antisemitic incidents in Argentina as a result of the war. Antisemitic graffiti appeared on the walls of Jewish institutions, Jews wearing kippot were physically attacked on public buses, and Jewish cemeteries were defaced. In May 2009, a gang of youths attacked Argentine Jews who were celebrating Israel's 61st independence day in the vicinity of the Israeli embassy Buenos Aires. Three Jews and one policeman were injured in the scuffle. Five people were arrested over the incident.\nBolivia\nIn La Paz, vandals removed a Star of David from a monument from the Plaza Israel and started spray-painting \"plaza Palestina\" on Jewish murals.\nVenezuela\nThe Caracas synagogue of the Israelite Association of Venezuela, the city's oldest, was defaced. Jewish schools were closed for several days due to concern that they would attract anti-Israel demonstrations.\nOn 26 February, assailants threw an explosive at a Jewish community center in Caracas.\nReactions\nGovernments\n*Argentina: The Argentinian government condemned antisemitic incidents.\n*France: French President Nicolas Sarkozy urged leaders of the Jewish, Muslim and Catholic communities to condemn the incidents, and warned that there would be \"zero tolerance\" for antisemitic attacks. Interior Minister Michele Alliot-Marie met Muslim and Jewish officials to discuss the tensions and antisemitic slogans heard at anti-Israeli rallies. Prime Minister François Fillon said that French authorities would increase their checks on television, radio and the Internet to prevent any hate messages prompted by the conflict in Gaza from spreading.\n*Greece: Greek President Karolos Papoulias was reported to have said \"What are our friends, the Israelis, doing? Are they flying airplanes and killing in cold blood?\", but did not make any statements of the various antisemitic attacks despite informal appeals. The President of the Greek Parliament Dimitris Sioufas declined to answer an official letter of protest by the Central Board of Jewish communities on the antisemitic article by parliamentary party leader Georgios Karatzaferis. No member of the Government or any political party did condemn any antisemitic attack or reference.\n*Israel: Israel expressed its concern over the rise in antisemitic attacks and called on world leaders to condemn all forms of incitement and hatred and to hold to account those responsible. Foreign Minister Tzipi Livni said that whatever one's opinion of Israel's military operation, it should not be used to legitimize hate and antisemitic incitement.\n*Netherlands: Dutch premier Jan Peter Balkenende said that Dutch Muslim and Jewish groups need to work together to ease tensions following a series of apparent antisemitic attacks.\n*Poland: Polish Ambassador to Israel Agnieszka Magdziak-Miszewska said that any comparisons between Israel's operation in Gaza and the Holocaust committed by Nazi Germany were \"pure antisemitism which cannot be justified.\"\n*Spain: Spanish Foreign Minister Miguel Angel Moratinos warned that criticism of Israel should not take antisemitic undertones. He said \"Everyone is free to attend demonstrations\", but called for \"a lot of caution and prudence.\" \"Antisemitism must be avoided... The Israeli government should be criticised if it used disproportionate force, but without going too far in the sense that everything Jewish or Semitic would need to be unanimously criticised.\"\n*Turkey: Prime Minister Recep Tayyip Erdoğan condemned antisemitism, although Jews living there believed that the language he used during the conflict gave some a license to turn their outrage at Israel's action into racial hatred. In an open letter to Erdoğan a group of five U.S. Jewish organizations wrote that Turkish Jews felt threatened, adding: \"A connection is clearly perceived between the inflammatory denunciation of Israel by Turkish officials and the rise of antisemitism.\" However, Erdoğan's foreign policy adviser Ahmet Davutoglu told journalists during a briefing on Gaza that \"Since the 15th century Turkey has been a safe haven for all religious groups... there is not a single case of antisemitism in Turkey.\"\n*United Kingdom: A group of 40 British MPs issued a parliamentary motion condemning attacks on the Jewish community as a result of the war in Gaza. Member of Parliament Sadiq Khan condemned the incidents, writing \"I am sickened at the sight of a swastika daubed on a synagogue in Hertfordshire: outraged that there are children in British cities afraid to go to school in case they get attacked on the way.\" Liberal Democrat shadow home secretary Chris Huhne said: \"The Home Secretary and the police need to stamp on antisemitic crime quickly and firmly.\" Foreign Secretary David Miliband wrote that he was \"alarmed at the attempts of extremist voices in the UK to use the conflict to legitimise antisemitic sentiments.\" Foreign Office Minister Lord Malloch-Brown condemned the targeting of Jews around the world as a direct result of Israel's foreign policy. London Mayor Boris Johnson condemned those who had used the Gaza conflict as a platform for antisemitism.\n*Venezuela: In responding to the desecration of a Caracas synagogue, Foreign Minister Nicolas Maduro called on \"all the Venezuelan people, the entire Venezuelan community, to reject these actions, with the same moral force with which we reject the crimes committed against the Palestinian people.\" When the Jewish community met with Maduro, he declared: \"We, Bolivarians, will not allow for any demonstration against Jews or any other religious expression of our people in our territory; this runs counter to the principles of President Hugo Chávez and the most sacred principles of our people enshrined in the Constitution\". President Hugo Chávez condemned the attack, suggesting that his political foes were responsible for it. Jewish community leader Abraham Levy spoke at the world Jewish Congress in Jerusalem and accused Chávez and the government of sanctioning antisemitism.  Maduro responded by saying, \"All of the Muslim, Jewish and Christian communities know religious discrimination is not a problem that has or will have a place in our society\", Maduro said, complaining that every time a country criticizes Israel's government, it \"is automatically added to the list of anti-Semites.\"\nHuman rights groups\n*United States-based Human rights group Human Rights First condemned what it described as a \"wave of incidents of antisemitic violence in a number of European countries targeting Jews and Jewish property in apparent backlash to recent events in Gaza.\" The group stressed that \"international events should never a justification for violence targeting individuals or property on account of race, ethnicity, religion, or other similar factors\", and urged European governments to speak out against violence targeting Jewish and other communities and to hold the perpetrators accountable.\nMuslim groups\n*The Canadian Council on American-Islamic Relations (CAIR-CAN), while affirming the right to protest against Israel, categorically condemned anti-Semitic language used by a small number of protesters at rallies against the Israeli assault.\n*A Muslim umbrella organisation in France, the French Council of the Muslim Faith, condemned all violence and was \"determined to strengthen relations with the Jewish community in these difficult times\".\n*A group of more than twenty prominent British Muslims issued an open letter condemning antisemitic attacks. The letter, intended to be read in mosques across the UK, condemned attacks on \"innocent British citizens and the desecration of all places of worship.\" It said: \"The ongoing killing of Palestinian civilians by Israeli forces has angered us all. However, this does not, and cannot, justify attacks on our fellow citizens of Jewish faith and background here in Britain.\" The letter was sent to coincide with Friday prayers, to nearly a thousand British mosques.\nJewish groups\n*Abraham Foxman, American director of the Anti-Defamation League, said the Gaza War unleashed a \"pandemic of antisemitism\". \"This is the worst, the most intense, the most global that it's been in most of our memories, and the effort to get the good people to stand up is not easy.  All of a sudden, as if the floodgates had been opened, within days an open season had been declared on world Jewry\", Foxman said in an address.\n*The Simon Wiesenthal Center stated that the situation in Gaza \"spawned a worldwide spike in antisemitism\", and condemned threats, attacks on synagogues and verbal incitement. The group \"urged Muslim leaders throughout North America, the UK and beyond to condemn calls for violence against Jews around the world.\"\n*The head of Conseil Représentatif des Institutions juives de France, an umbrella group of French Jewish organizations, warned that \"the conflict should not spread to France\", and invited his Muslim counterpart, Mohamed Moussaoui of CFCM to \"overcome together\" the difficulties.\n*The president of the European Jewish Congress Moshe Kantor took a different position and claimed that the rise in antisemitic incidents was not related to the Gaza conflict, but to the 2008 financial crisis. In a recent survey of the Anti-Defamation League 31 percent of Europeans in Austria, France, Germany, Hungary, Poland, Spain and Britain blamed Jews for at least partly for the economic crisis.\nReferences\nExternal links\n*[https://web.archive.org/web/20100326152134/http://www.tau.ac.il/Anti-Semitism/asw2008/gen-analysis-08.pdf Antisemitism Worldwide 2008/9: General Analysis], The Stephen Roth Institute for the Study of Contemporary Antisemitism and Racism at Tel Aviv University\n*[https://web.archive.org/web/20090323065604/http://www.jcpa.org/JCPA/Templates/ShowPage.asp?DRIT=3&DBID=1&LNGID=1&TMID=111&FID=624&PID=0&IID=2895&TTL=The_Gaza_War_and_the_New_Outburst_of_Anti-Semitism The Gaza War and the New Outburst of Anti-Semitism], [http://www.jewishaffairs.org Institute for Global Jewish Affairs]\n*[http://www.timesonline.co.uk/tol/news/world/europe/article5459435.ece Gaza Conflict Fuels Anti-Semitic Attacks across Europe], The Times\n*[https://www.nytimes.com/2009/01/21/world/europe/21france.html Tensions in the Mideast Reverberate in France], The New York Times\n*[http://www.times-series.co.uk/news/4032111.Anti_Semitic_attacks_fuelled_by_Gaza_conflict/ Anti-Semitic attacks fuelled by Gaza conflict], The Times"
    }
  ]
}