{
  "content": [
    {
      "type": "text",
      "text": "# Anti-War Coalition\n\nThe Anti-War Coalition (AWC) is a coalition of South African anti-war activists. It could have links to the international Stop the War Coalition but has instead chosen to involve itself with local politics, in particular the Workers International Vanguard League. AWC helped organise protests against the 2003 Iraq war in Cape Town and Johannesburg.\nFormation\nThe AWC came about shortly after the formation of the international Stop the War Campaign and the involvement by the governing African National Congress (ANC), Communist Party of South Africa, Congress of South African Trade Unions, and South African Council of Churches. It claims to be a more radical alternative coalition of independent community and solidarity groups endorsed by around 300 organisations.\nActivities\nThe Anti-War Coalition is most widely known for its role in the protests that spanned from 20 to 24 of September, 2006. These protests took place in two parts at the Air Force Base in Ysterplaat, Cape Town. This was to oppose the International Weapons Fair.\nKey messages\nSlogans such as Stop the War, War is no Solution, and Stop United States Imperialism have been used at rallies.\nInternal conflicts, ANC and WIVL criticism\nAn attempt to bring together AWC and ANC at a meeting in February 2003 failed. ANC policy director Michael Sachs told the meeting that the ANC leaders were uncomfortable with the more vigorously anti-imperialist language of the AWC. The rift grew bigger when Sachs falsely claimed that the Stop the War Campaign, rather than the AWC, had organized the February 15th protests.  Because of this, the AWC refused to have ANC speakers on the stage of its Johannesburg anti-war rally.\nThe AWC has also been criticised for being too closely allied to the Workers International Vanguard League WIVL at the expense of broader issues that affect international peace and justice. In effect, AWC is WIVL, and the organisation continues to operate without consulting of its membership or affiliates.\nAllied groups\nWar is a Drag and Laugh not War\nTwo small, independent anti-militarist outfits that participated in the February 15th campaign and loosely associated with the AWC. Their aim was to introduce a more pacifist style to the revolutionary rhetoric of the AWC and power-mongering of the supposed Stop the War Campaign.\nSee also\n* Code Pink\n* List of anti-war organizations\n* List of peace activists\nReferences"
    }
  ]
}