{
  "content": [
    {
      "type": "text",
      "text": "# Antic Software__disambig_1\n\nAntic Software was a software company associated with Antic, a magazine for Atari 8-bit computers. Bound into issues of the magazine, the Antic Software catalog initially sold Atari 8-bit games, applications, and utilities from the recently defunct Atari Program Exchange. Original submissions were later added, as well as public domain collections, with all software provided on self-documented disk. When the Atari ST was released, it became a mixture of Atari 8-bit and Atari ST software and sold some major Atari ST titles such as CAD-3D. The magazine insert changed names several times, eventually being branded as The Catalog.\nAntic assistant editor Gigi Bisson wrote in the May 1986 issue that, \"[Antic Software] kept the magazine afloat during the lean year,\" referring to the period following Atari, Inc.'s financial collapse.\nHistory\nWhen the  Atari Program Exchange (APX) was shut down by Atari CEO James J. Morgan in 1984, Gary Yost convinced Antic magazine's publisher, James Capparell, to create Antic Software. Yost contacted many of the programmers from APX to re-publish their works with Antic. The APX software was rebranded in mid-1984 as APX Classics from Antic. In 1985 the magazine insert was called Antic Arcade (despite including more than games). By 1986 it was branded The Catalog with the emphasis on Atari ST applications.\nSoftware\nAtari 8-bit computers\n*Chop Suey (1985), fighting game\n*Colourspace, light synthesizer from Jeff Minter.\n*Dandy Dungeon, renamed version of Atari Program Exchange game Dandy.\n*HomeCard, filing system written by Preppie! programmer Russ Wetmore and Sparky Starks.\n*Mars Mission II,  sequel to Caverns of Mars. Another sequel, Phobos, was previously sold through the Atari Program Exchange, then later by Antic Software.\n*RAMbrandt,  image editor.\nAtari ST\n*CAD-3D, 3D modeling system and related add-ons. CAD-3D is a precursor to 3D Studio MAX.\n*Spectrum 512, Atari ST paint program allowing 512 colors per image instead of the standard 16.\nLegacy\nGary Yost went on to form The Yost Group which created and licensed products to Autodesk: Autodesk Animator, Autodesk Animator Pro, Autodesk 3D Studio, and Autodesk 3DS MAX. 3D Studio is a direct successor of CAD-3D.\nReferences"
    }
  ]
}