{
  "content": [
    {
      "type": "text",
      "text": "# Anti–Air War Memorial\n\n}}\n}}\nThe Anti–Air War Memorial is located in Woodford Green, London, England. It was commissioned and erected by the socialist suffragist Sylvia Pankhurst in 1935 as \"a protest against war in the air\". It is Britain's first anti-war memorial, and is recorded in the National Heritage List for England as a Grade II listed building.\nHistory\nPankhurst held strong pacifist and anti-war beliefs as a result of witnessing Zeppelin raids by the German Empire on London during World War I. In 1932, she expressed opposition to the Royal Air Force's use of aerial bombing during the Saya San Rebellion and Pink's War, and in 1935 was vocal against attacks by the Regia Aeronautica against Ethiopia. One of the inscriptions on the memorial dedicates it to \"those who in 1932 upheld the right to use bombing aeroplanes\", an ironic reference to the participants of the 1932 World Disarmament Conference, who voted to maintain the right to use aerial bombing in warfare. In the words of the sculptor, \"Those who had preserved bombing were politically and morally dead, and this was their gravestone\".\nThe memorial was unveiled on 20 October 1935 by R. P. Zaphiro, secretary of the Imperial Ethiopian Legation. Also present were socialist friends of Pankhurst's, such as James Ranger. On its first night in place, the memorial was vandalised and it was later stolen; a replacement was built by Benfield and unveiled on 4 July 1936. The second unveiling was attended by representatives of Germany, France, Hungary, Austria and Guyana (then known as British Guiana), as well as Ethiopia.\nIn 1979, the memorial was given a Grade II heritage listing in recognition of its special historic interest, under the name \"Anti-Abyssinian War Memorial\"; the record was corrected at the time of the restoration in 2014.\nIn the 1980s, the memorial became a focus for anti-nuclear activists and an annual Peace Picnic was held there. In 1985, for the memorial's 50th anniversary, local resident Sylvia Ayling organised a street march and re-enactment of the unveiling, this time by peace activist Maggie Freake.\nIn 1996 the stone bomb was stolen from the top of the memorial and later recovered by police in Epping Forest. It was repaired and returned to its plinth, with all costs covered by the Borough of Redbridge and Pankhurst's son, Richard.\nIn 2014, the memorial was refurbished again. The Sylvia Pankhurst Trust (active 2007–2019 and led by Susan Homewood) organised a re-dedication ceremony to coincide with World Disarmament Day. Susan Homewood introduced the event and read a message from Dr Richard Pankhurst, who had long expressed a wish for the monument to be restored again. Invited speakers were Bruce Kent, Pankhurst's biographer Katherine Connelly, local MP Iain Duncan Smith and former MP and campaigner Linda Perham. Redbridge Museum provided an exhibition about Sylvia Pankhurst's years in Woodford and amongst the guests was Sylvia Ayling.\nUnder the shadow of trees, the monument had become less noticeable to the public since its previous unveiling in the 1980s. By agreement with English Heritage and Dr Richard Pankhurst, the Sylvia Pankhurst Trust restored the monument's original name: the Anti Air War Memorial, and erected prominent signage.\nDescription\nThe memorial is in the form of a plinth topped by a pyramid, on which a stone bomb is mounted, as if it had fallen vertically onto the tip of the pyramid. It was designed by the sculptor Eric Benfield.\nThe memorial was built on land owned by Pankhurst opposite the home she shared with Silvio Corio, Red Cottage. In 1939 the cottage was demolished and four houses were built on the land; in 2009 a local developer demolished those houses and replaced them with apartment buildings. However, the memorial has remained intact throughout these redevelopments.\nReferences"
    }
  ]
}