{
  "content": [
    {
      "type": "text",
      "text": "# Antlia Dwarf__disambig_1\n\n| dec =\n| dist_ly = 1.32 ± 0.06 Mpc 1.33 ± 0.10 Mpc1.31 ± 0.03 Mpc1.29 ± 0.02 Mpc1.25 Mpc\n| z = 362 ± 0&nbsp;km/s\n| appmag_v = 15.67 ± 0.02\n| size_v = 2′.0 × 1′.5\n| constellation name = Antlia\n| names = Antlia Dwarf Galaxy, PGC 29194\n| group_cluster  = Antlia-Sextans Group\n| mass = 3\n}}\nThe Antlia Dwarf is a dwarf spheroidal/irregular galaxy. It lies about 1.3&nbsp;Mpc (4.3 million light-years) from Earth in the constellation Antlia. It is the fourth and faintest member of the nearby Antlia-Sextans Group of galaxies. The galaxy contains stars of all ages, contains significant amounts of gas, and has experienced recent star formation. The Antlia Dwarf is believed to be tidally interacting with the small barred spiral galaxy NGC 3109.\nDiscovery\nThe Antlia Dwarf was first cataloged in 1985 by H. Corwin, Gérard de Vaucouleurs, and A. de Vaucouleurs. Later in 1985 and 1987, it was noted as a possible nearby dwarf galaxy by two groups of astronomers. It was finally confirmed as a dwarf galaxy in 1997 by Alan Whiting, Mike Irwin and George Hau during a survey of the northern sky. They for the first time resolved it into stars and determined the distance to it—1.15&nbsp;Mpc (the modern distance estimate is slightly larger). The same year, Antonio Aparicio, Julianne Dalcanton, Carme Gallart and David Martinez-Delgado studied for the first time its stellar content and measured its mass, luminosity and metallicity.\nIn 1999, the Antlia Dwarf was identified by Sidney van den Bergh as the fourth member of the Antlia-Sextans Group—the group of galaxies closest to the Local Group.\nProperties\nThe Antlia Dwarf is classified alternatively as a dwarf elliptical galaxy of type dE3.5, or either as a dwarf spheroidal galaxy (dSph) or as a transitional galaxy from spheroidal to irregular types (dSph/Irr). The last classification is due to a substantial star formation in this galaxy in the last 0.1 billion years.\nAntlia Dwarf comprises two components: a core and an old halo. Its half-light radius is about 0.25&nbsp;kpc. The metallicity is very low, at about =−1.6 to −1.9 meaning that Antlia Dwarf contains 40–80 times less heavy elements than the Sun. The galaxy has a well-defined and easily observed red giant branch, which makes measuring its distance relatively easy. The total luminosity of Antlia Dwarf is approximately 1 million times that of the Sun (the visible absolute magnitude is MV=−10.3).\nThe stellar mass of Antlia Dwarf is estimated to be about 2–4 million solar masses, while its total mass (within the visible radius) is approximately 4 solar masses. The galaxy contains stars of all ages but is dominated by old stars with the age of more than 10 billion year. There seems to have been a major episode of star formation in the Antlia Dwarf around 100 million years ago. However, the young stars are confined to the central core of the galaxy.\nAntlia Dwarf is unusual among dwarf spheroidal galaxies in that it contains large amounts (as much as 7 ×105 solar masses) of neutral atomic hydrogen. However it does not have significant H II regions and does not actively form stars at the present moment.\nLocation and interactions\nThe Antlia Dwarf is located about  away, in the constellation Antlia. Its distance from the barycenter of the Local Group is about 1.7&nbsp;Mpc. At this distance, it is situated well outside the Local Group and is a member of a separate group of dwarf galaxies called Antlia-Sextans Group. The Antlia Dwarf is separated from the small spiral/irregular galaxy NGC 3109 by only 1.18 degrees on the sky, which corresponds to a physical separation of  to  depending on their radial separation.\nThe Antlia Dwarf and NGC 3109 may be actually physically bound if the distance between them is not very large. However their velocity relative to each other—43&nbsp;km/s makes it questionable whether they are in fact a bound system, especially if the distance between them is closer to the upper limit—180&nbsp;kpc. If they are gravitationally bound, their total mass may be as high as 78 billion solar masses.\nObservations have also demonstrated that NGC 3109 has a warp in its gaseous disk that is traveling at the same velocity as the gas in the Antlia Dwarf, indicating that the two galaxies had a close encounter about one billion years ago.\n}}\nExternal links\n*\n* [http://www.constellation-guide.com/antlia-dwarf-pgc-29194/ Antlia Dwarf at Constellation Guide]"
    }
  ]
}