{
  "content": [
    {
      "type": "text",
      "text": "# Antonino Salinas Regional Archaeological Museum\n\n| visitors    =\n| website     =\n}}\nThe Antonino Salinas Regional Archeological Museum () is a museum in Palermo, Italy. It possesses one of the richest collections of Punic and Ancient Greek art in Italy, as well as many items related to the history of Sicily. Formerly the property of the Oratory of Saint Philip Neri, the museum is named after Antonino Salinas, a famous archaeologist and numismatist from Palermo who had served as its director from 1873 until his death in 1914, upon which he left it his major private collection. It is part of the Olivella monumental complex, which includes the Church of Sant'Ignazio all'Olivella and the adjoining Oratory.\nHistory\nin the cloister]]\nThe construction of the Olivella complex was begun in the late sixteenth century by the architect Antonio Muttone for the Oratory of Saint Philip Neri and completed in the seventeenth century. Following the law on the suppression of religious orders of 1866 the building was confiscated and became home to the museum.\nDuring the Second World War the director of the museum, Jole Bovio Marconi, moved all the material held in the museum to the Abbey of San Martino delle Scale near Monreale. This saved the collection from destruction by the bombing during the Allied invasion of Sicily. In 1949, Bovio Marconi was made responsible for the redevelopment of the museum, as the building was heavily damaged the building was renovated by architect William De Angelis D'Ossat. From 18 July 2011, the museum has been closed for renovation. As of September 2015, only a small part of the museum is accessible free of charge. In May 2022, only the Museum's first floor is open to the public. It is uncertain when the full exhibition will be reopened.\nSections\n]]\n]]\nOn the ground floor, a section is dedicated to the artefacts found underwater, including materials that were part of the cargo of vessels, stone anchors, strains of lead, lamps, amphoras and inscriptions ranging from the culture of the Phoenicians to that of the Romans.\nThe Phoenician section displays two large anthropomorphic sarcophagi of the fifth century BC from the necropolis of Pizzo Cannita (near modern Misilmeri). There are also sculptures of gods and Phoenician votive stelae from Mozia and Lilybaeum.\nA reconstruction of the east pediment of the archaeological site of Selinunte is exhibited, displaying the Gorgon of Temple C, several metopes with mythological reliefs (Temples C and E) and sculptures of the archaic and classical period. In 1823, two British architects, Samuel Angell and William Harris, ventured to excavate at Selinunte in the course of their tour of Sicily, and came upon many fragments of sculptured metopes from the Archaic temple now known as \"Temple C\". Although local officials tried to stop them, they continued their work, and attempted to export their finds to England, destined for the British Museum. Now in the shadow of the activities of Lord Elgin, Angell and Harris's shipments were diverted to Palermo, where they remain to this day in the Archaeological Museum.\nArtifacts from Himera are on display, as well as objects and sculptures from Solunto, Megara Hyblaea, Tindari, Kamarina and Agrigento. Among the most important works of art are the great Ram bronze of the third century BC from Syracuse, a Roman copy of a sculpture by Lysippus depicting Heracles catching the Ceryneian Hind and a Roman copy of a marble statue by Praxiteles depicting a satyr.\nThe Roman period is documented by a collection of sculptures and mosaics found in villas from Piazza Vittoria in Palermo, where the center of the Roman city was previously located. Even prehistoric cultures present in the caves around the territory of Palermo are exhibited in the museum.\nCollections\nThe museum is composed in part by private collections purchased or donated to the museum over the centuries. It also includes the Palermo stone, a portion of a large ancient Egyptian stelae.\nUniversity Museum collection\nIt is the oldest collection of the museum which was acquired in 1814 when Giuseppe Emanuele Ventimiglia, Prince of Belmonte left his collection to the University of Palermo at his death. The university in turn sold it to the museum.\nAntonino Salinas collection\nLeft to the museum in 1914, this collection is the largest in size with 6, 641 pieces and led to the museum being renamed after Salinas. The collection consists of books, manuscripts, prints, photographs, personal items and about 6000 coins.\nPietro Bonci Casuccini collection\nThis is the Etruscan collection which consists of sarcophagi, gravestones, urns and Attic black and red-figure pottery. It is considered the most important Etruscan collection outside of Tuscany. The exhibits come from Chiusi as part of the excavations carried out in the estates of Count Pietro Bonci Casuccini.\nThe collection was put up for sale by the grandsons of the founder, Ottavio and Pietro. The sale of the collection was prevented by the Kingdom of Italy in 1863, by the intervention of Michele Amari who was Minister of Education at the time. The state acquired the collection and transferred it to the Regional Archeological Museum of Palermo.\nReturn of Parthenon fragment\nIn 2022, the Antonino Salinas Regional Archaeological Museum returned permanently to Athens a small fragment of the Parthenon. This fragment of the foot of the goddess Artemis had been sold to the University of Palermo by the widow of the British consul Robert Fagan. According to legal scholar Catharine Titi, there is no clear explanation of how Fagan obtained the fragment: although it is possible that the fragment may originally have gone \"astray\" from Elgin's collection, in reality how it \"came to be in Fagan’s possession is, frankly, anyone’s guess\".\nGallery\nImage:Museoarcheosalinas.JPG|The museum\nImage:MRSAS PA 14 09 2018 01.jpg|Inner courtyard\nImage:DSC00145 - Sala con colonne del Musero archeologico - Foto di Giovanni Dall'Orto.jpg|A room in the museum\nImage:Museosalinas2.JPG|A room in the museum\nImage:Sala santuari di Selinunte - Museo Salinas.jpg|A room in the museum\nImage:Sala con le Piccole Metope di Selinunte e altri elementi architettonici, Museo Salinas.jpg|Metopes of Temple Y in Selinunte\nImage:MRSAS PA 14 09 2018 30.jpg|Metopes of Temple C, E and F in Selinunte\nImage:Gronde leonine da Himera.JPG|Lion heads of Temple of Victory Himera\nImage:Sarcfen1.JPG|Phoenician sarcophagus from Pizzo Cannita, Misilmeri\nImage:DSC00432 - Statua cineraria etrusca - da Chiusi - 550-530 aC.jpg|Etruscan funerary statue from Chiusi\nImage:Arietedibronzo palermo.jpg|Bronze ram statue from Syracuse\nImage:DSC00215 - Satiro versante - Da Prassitele -370-60 aC- - Copia romana.jpg|Satyr from Torre del Greco\nImage:Priestess of isis.jpg|Priestess of Isis from Taormina, 2nd c. AD\nImage:DSC00355 - Orfeo (epoca romana) - Foto G. Dall'Orto.jpg|Roman mosaic from Palermo\nImage:Pholos MAR Palermo NI1904.jpg|Attic black-figure lekythos\nSee also\n* Palermo Fragment\n*Palermo Stone\n*List of largest art museums\nReferences\nExternal links\n*\n* [https://www2.regione.sicilia.it/beniculturali/dirbenicult/database/dipartimento_2/siti_list.asp?TargetPageNumber=1&action=Search&lang=&orderby=&dir=&PageSize=20&masterkey=&SearchField=Sito&SearchOption=Contains&SearchFor=salinas&PageSizeSelect=20 Listing in the directory of museums of the Region of Sicily]"
    }
  ]
}