{
  "content": [
    {
      "type": "text",
      "text": "# Anton Maria Schwartz\n\n|birth_place = Baden, Lower Austria, Austrian Empire\n|death_date =\n|death_place = Vienna, First Austrian Republic\n|titles = Priest\n|resting_place =\n|venerated_in = Roman Catholic Church\n|feast_day = 15 September\n|attributes = Cassock\n|patronage =\n|beatified_date = 21 June 1998\n|beatified_place = Saint Peter's Square, Vatican City\n|beatified_by = Pope John Paul II\n|canonized_date =\n|canonized_place =\n|canonized_by =\n|major_shrine =\n}}\nAnton Maria Schwartz (28 February 1852 – 15 September 1929), born Anton Schwartz, was an Austrian Roman Catholic priest and the founder of the Congregation of the Christian Workers of Saint Joseph Calasanz. He entered the novitiate of the Piarists but left due to fear of German suppression, so instead became a diocesan priest for the Archdiocese of Vienna. He championed the rights and the welfare of the workers and aimed his order at serving labourers.\nHe received beatification from Pope John Paul II on 21 June 1998.\nLife\nAnton Schwartz was born in Baden in 1852 as the fourth of fourteen children. He served in a choir as a child. Schwartz's father died during his adolescence when he was fifteen which resulted in hardship and struggling for Schwartz and his siblings.\nHe commenced his education in Baden in 1858 and later at a school of music in Heiligenkruetz. In 1865, he relocated to Vienna with his aunt and attended high school there though decided his true path in life was to the priesthood. At the age of seventeen he commenced his time of novitiate in the Piarists where he maintained a strong devotion to its founder. However he left not long after he entered due to the advice of his superiors who feared the institute would see suppression from the German Empire. He commenced his studies for the priesthood in 1871 and was ordained as such on 25 July 1875 from Cardinal Joseph Othmar Rauscher; he chose \"Maria\" as his middle name on 8 December 1873. His poorness saw him have to borrow a chalice and vestments for his first Mass.\nHis period of studies before ordination saw him suffer a serious lung infection that bought him to the point of near-death. Prior to his ordination he was told he should have had his portrait taken as a memorial picture for his impending funeral due to the graveness of his ailment. Despite all odds he managed to recover and continue with his education.\nHe worked as a vicar in Marchegg after his ordination and in 1879 was made the spiritual director at a Vienna hospital while in 1888 he founded a magazine for craftsmen and labourers.\nHe founded his order – the Calasanzian Congregation – on 24 November 1889 and determined that it would adhere to the rule of the Piarists despite modifications in several areas. The order would receive the papal approval of Pope Pius XII in 1939. His order focused on teaching social doctrine in schools as well as establishing trade schools and building homes for both workmen and apprentices.\nSchwartz died on 15 September 1929. Thousands attended his funeral despite the pouring rain.\nBeatification\nThe beatification process commenced in 1949 in an informative process that was opened in the Archdiocese of Vienna in a Mass that Cardinal Theodor Innitzer presided over. The process concluded in 1954 after witness testimonies and documentation were collated into boxes to be sent to the Congregation of Rites in Rome. Theologians also approved his writings on 21 October 1965 as being in line with the faith and not in contradiction of it.\nSchwartz became a Servant of God on 13 April 1978 once the formal introduction of the cause came under Pope Paul VI. The apostolic process was held in Vienna following this at which point both previous processes were granted validation on 10 December 1982 in Rome at the behest of the Congregation for the Causes of Saints.\nThe Positio was submitted to the C.C.S. in 1994 at which point theologians approved the contents of the dossier in a meeting of 16 December 1994. The C.C.S. later voted in favor of the cause on 21 March 1995. He was declared Venerable on 6 April 1995 after Pope John Paul II approved the fact that the late priest had lived a life of heroic virtue.\nThe miracle needed for beatification took place in 1972 in Vienna and was subject to a diocesan investigation. The C.C.S. validated the process on 10 June 1994 and sent it to a medical board and consulting theologians for their own assessment and approval. The pope later voiced his own approval and beatified Schwartz on 21 June 1998.\nReferences\nExternal links\n*[http://newsaints.faithweb.com/year/1929.htm#Schwartz Hagiography Circle]\n*[http://www.kalasantiner.at/ Calasanzian Congregation]"
    }
  ]
}