{
  "content": [
    {
      "type": "text",
      "text": "# Anwar Raslan\n\n| birth_place       = Taldou, Syria\n| death_date        =\n| death_place       =\n| allegiance        =\n| conviction        = Crime against humanity27 counts of Mord, 25 counts of dangerous bodily harm2 counts of especially serious rape, sexual coercion14 counts of deprivation of liberty for more than one week2 counts of hostage-taking3 counts of sexual abuse of prisoners\n| occupation        =\n| years_active      =\n| party             =\n| religion          =\n| nationality       =\n| penalty           = Life sentence\n| apprehended       =\n| imprisoned        = Germany\n| native_name       =\n| native_name_lang  = ar\n}}\nAnwar Raslan (; born 3 February 1963) is a Syrian former colonel who led a unit within Syria's General Intelligence Directorate. In January 2022, a German Higher Regional Court convicted him of crimes against humanity under universal jurisdiction. The specific charges against him were 4,000 counts of torture, 58 counts of murder, rape, and sexual coercion. His trial marked the first international war crimes case against a member of the Syrian government during the presidency of Bashar al-Assad.\nEarly life and career\nAnwar Raslan was born in 1963 in Taldou in the Homs governorate, Syria. After completing a degree in law, he served as a security service officer in Damascus. In 2006, Raslan was responsible for the detention of Syrian lawyer and human rights defender Anwar al-Bunni. In 2008, he became colonel, and head of the intelligence department of Branch 251 (internal branch), also known as branch al-Khatib, part of the General Intelligence Directorate. Raslan was tasked with the internal safety of Al-Khatib prison, located in Damascus. In July 2012, Raslan moved to branch 285 of the state security forces. Branch 285 mostly dealt with high value prisoners, such as political detainees.\nAccording to German journalist , who interviewed Anwar Raslan in Jordan, Raslan defected because he was ashamed of his employer.  He had intended to investigate a January 2012 attack in Damascus, but the government declined because the Syrian secret service had orchestrated the attack. Reuter noted that many Syrian exiles believe Raslan’s defection from the Assad regime, where he was a key figure, was motivated by opportunism rather than conviction.\nArrest and conviction\nRaslan defected from the Assad government and was smuggled with his family to Jordan in December 2012. He travelled to Germany in 2014 and was granted asylum there in the same year. He was arrested in February 2019 and charged in March 2020. The trial began in April 2020 in the city of Koblenz and was held until 13 January 2022. The European Center for Constitutional and Human Rights (ECCHR), the Syria Justice and Accountability Centre and the podcast 'Branch 251' have documented the trial. The prosecution is part of a larger trend in universal jurisdiction to investigate and hold accountable individuals who committed crimes during the Syrian civil war. On 2 December 2021, the German federal prosecutor's office called for the life sentence against Anwar Raslan, in the first trial in the world for abuses committed by the Bashar al-Assad government.\nOn 13 January 2022, Raslan was sentenced by the state court in Koblenz to imprisonment for life \"for a crime against humanity in the form of killing, torture, severe deprivation of liberty, rape and sexual coercion in unity of action with 27 counts of Mord ('severe' murder in the German penal code), 25 counts of dangerous bodily harm, two counts of especially serious rape, sexual coercion, 14 counts of deprivation of liberty for more than one week, two counts of hostage-taking and three counts of sexual abuse of prisoners.\"\nSee also\n* Human rights violations during the Syrian civil war\nNotes\nReferences"
    }
  ]
}