{
  "content": [
    {
      "type": "text",
      "text": "# Anwar Habib\n\n-->\n| birth_place       =\n| death_date        =\n| death_place       =\n| death_cause       =\n| resting_place     =\n| resting_place_coordinates =\n| home_town         =\n| other_names       =\n| siglum            =\n| pronounce         =\n| citizenship       = Pakistan\n| nationality       =\n| fields            = Electrical engineering\n| workplaces        =Pakistan Nuclear Regulatory AuthorityPakistan Atomic Energy CommissionSASSI University\n| patrons           =\n| education         =\n| alma_mater        =Dawood UniversityQuaid-e-Azam University\n| thesis_title      =\n| thesis_url        =\n| thesis_year       =\n| doctoral_advisor  =\n| academic_advisors =\n| doctoral_students =\n| notable_students  =\n| known_for         = Nuclear safety and Radiation protection\n| influences        =\n| influenced        =\n| awards            =  Hilal-i-Imtiaz (2018)\n| author_abbrev_bot =\n| author_abbrev_zoo =\n| spouse            =\n| partner           =\n| children          =\n| signature         =\n| signature_alt     =\n| website           =[https://pk.linkedin.com/in/anwar-habib-28345032 Linkedinn profile]\n| footnotes         =\n}}\nSyed Mohammad Anwar Habib (born Karachi, Pakistan, ) is a Pakistani electrical engineer who served as the Chairman of the Pakistan Nuclear Regulatory Authority (PNRA) from 2009 until 2017.\nBiography\nHabib was educated in Karachi where attended the Dawood University of Engineering and Technology (DUET) and graduated with Bachelor of Engineering (BE) in Electronic Engineering. He went to attend the Quaid-e-Azam University and graduated with Master of Science (MS) in physics, where he specialized in electromagnetism.\nHabib joined the Pakistan Atomic Energy Commission where he was part of the nuclear safety division, and went joined the Pakistan Nuclear Regulatory Authority in 2001. In 2009, he was appointed chairman of the Nuclear Regulatory Authority and has spoken internationally in health and radiation safety, and written multiple papers on nuclear regulation and safety.\nHe is currently as a professor and director of the nuclear power at the South Asian Strategic Stability Institute University (SASSI)—a Pakistan-based foreign policy think tank.\nAwards\n* Hilal-i-Imtiaz (2018)\nReferences"
    }
  ]
}