{
  "content": [
    {
      "type": "text",
      "text": "# Anwar Bannud\n\n| death_place         =\n| office2             = Chief of Staff of the Syrian Army\n| term_start2         = 2 January 1950\n| term_end2           = 23 April 1951\n| predecessor2        = Sami al-Hinnawi\n| successor2          = Fawzi Selu\n| rank                = Brigadier\n| allegiance          =  French Mandate of Syria (1921–1946) |  Syria (1946–1954) | }}\n| battles             = 1948 Arab–Israeli War\n| nationality         = Syrian\n| native_name         = أنور بنود\n| native_name_lang    = ar\n}}\nAnwar Bannud () (1908–1979) was a Syrian military officer who served as the chief-of-staff of the Syrian Army from 1950 to 1951.\nCareer\nEarly career\nBannud began his military career at the Military Academy in Damascus. After his graduation in 1925, he served as an officer in the Army of the Levant. His service was distinguished and he rose quickly in the ranks to become a Colonel, the only Syrian officer to achieve that rank under the French mandate. In 1944 Bannud was appointed director of the Homs Military Academy, where he encouraged students to mutiny against the French occupation forces.\nIndependence\nThe last French troops left Syria in 1946 and the country regained its independence, and Bannud joined the newly established Syrian Army. When the 1948 Arab–Israeli War began, Bannud joined the Arab Liberation Army (ALA) under Fawzi al-Qawuqji, and became a commanding officer in the war. The Syrian 1st armoured squadron, under Bannud's leadership, was defeated in the Samakh region, but he was able to hold on to the Bridge of the Daughters of Jacob and the settlements of Mishmar HaYarden and Mishmar HaGolan. When Qawuqji resigned from his post, Bannud replaced him as commander of the ALA on 26 October 1948.\nBannud blamed the civilian leadership in Damascus for the defeat in 1948 War, and supported the military coup of Chief-of-Staff Husni al-Zaim in March 1949 that overthrew President Shukri al-Quwatli. Bannud was appointed deputy chief-of-staff. However, he became disillusioned with al-Zaim's leadership and participated in a military coup against him on 14 August 1949. Four months later, Bannud, the commander of Aleppo garrison at the time, supported Adib Shishakli in a third successive coup in December 1949. As a reward for his loyalty, Shishakli, while preferring himself to stay behind the scenes as deputy chief-of-staff, appointed Bannud as chief-of-staff on 2 January 1950.\nNevertheless, his popularity in the army arose Shishkali's suspicion, and Bannud was dismissed on 23 April 1951, and exiled under the pretense of a military attaché post at the Syrian embassy in Ankara, Turkey. Bannud obliged, and he served at his post until the 1954 military coup that overthrew Shishakli's government.\nReferences\nBibliography\n*\n*\n*\n*\n*"
    }
  ]
}