{
  "content": [
    {
      "type": "text",
      "text": "# APA Award for Distinguished Scientific Contributions to Psychology\n\nThe APA Award for Distinguished Scientific Contributions to Psychology is an award of the American Psychological Association that \"honors psychologists who have made distinguished theoretical or empirical contributions to basic research in psychology.\"\nRecipients\nSource: [https://www.apa.org/about/awards/scientific-contributions.aspx?tab=3 APA]\n20th century\n*\t1956 Wolfgang Köhler, Carl R. Rogers, Kenneth W. Spence\n*\t1957 Carl I. Hovland, Curt P. Richter, Edward C. Tolman\n*\t1958 Frank A. Beach, Paul E. Meehl, B. F. Skinner\n*\t1959 Leon Festinger, Donald B. Lindsley, Neal E. Miller\n*\t1960 Harry F. Harlow, Charles E. Osgood, S. Smith Stevens\n*\t1961 James J. Gibson, Donald O. Hebb, Henry A. Murray\n*\t1962 Jerome S. Bruner, William K. Estes, Harry Helson\n*\t1963 Roger G. Barker, George A. Miller, Carl Pfaffmann\n*\t1964 Gordon W. Allport, Wendell R. Garner, J. P. Guilford\n*\t1965 Floyd Allport, Fritz Heider, Paul Thomas Young\n*\t1966 Nancy Bayley, Clarence H. Graham, Richard L. Solomon\n*\t1967 Solomon E. Asch, Ernest R. Hilgard, James Olds\n*\t1968 James E. Birren, Eleanor J. Gibson, Muzafer Sherif\n*\t1969 Jean Piaget, Stanley Schachter, Herbert A. Simon\n*\t1970 Donald T. Campbell, David Krech, R. Duncan Luce\n*\t1971 Roger William Brown, Harold H. Kelley, Roger Wolcott Sperry\n*\t1972 Edwin E. Ghiselli, Dorothea Jameson, Leo Hurvich, Patrick Suppes\n*\t1973 Lee J. Cronbach, Brenda Milner, Benton J. Underwood\n*\t1974 Angus Campbell, Lorrin A. Riggs, Richard F. Thompson\n*\t1975 Donald E. Broadbent, Robert R. Sears, David Shakow\n*\t1976 Beatrice C. Lacey,  John I. Lacey, Theodore Newcomb, Roger N. Shepard\n*\t1977 Richard C. Atkinson, Russell L. De Valois, Edward E. Jones\n*\t1978 Julian Hochberg, Philip Teitelbaum, Robert B. Zajonc\n*\t1979 John W. Atkinson, Gordon H. Bower, John Garcia\n*\t1980 Albert Bandura, Alvin M. Liberman, Michael I. Posner\n*\t1981 David M. Green, Irving L. Janis, James L. McGaugh\n*\t1982 Daniel Kahneman,  Amos Tversky, Walter Mischel, Mark R. Rosenzweig\n*\t1983 John W. Thibaut, Endel Tulving, Hans Wallach\n*\t1984 Noam Chomsky, John H. Flavell, Floyd Ratliff\n*\t1985 Clyde Coombs, Mortimer Mishkin, Allen Newell\n*\t1986 Robert P. Abelson, Gunnar Johansson, Robert A. Rescorla\n*\t1987 Morton Deutsch, Jerome Kagan, David C. McClelland, Saul Sternberg, Niko Tinbergen, Ledyard R. Tucker\n*\t1988 Irving T. Diamond, Frederic M. Lord, Eleanor E. Maccoby, William J. McGuire, Julian B. Rotter, George Sperling\n*\t1989 Mary D. Salter Ainsworth,  John Bowlby, J. Douglas Carroll, Richard S. Lazarus\n*\t1990 Frances K. Graham, John A. Swets, Anne Treisman\n*\t1991 Paul Ekman, Patricia S. Goldman-Rakic, Richard E. Nisbett\n*\t1992 Ursula Bellugi,  Edward S. Klima, Walter Kintsch, K. Warner Schaie\n*\t1993 Peter J. Lang, Paul Slovic, Larry R. Squire\n*\t1994 John R. Anderson, Jon Kaas, Neil Schneiderman\n*\t1995 Rochel Gelman, William A. Mason, Michael L. Rutter\n*\t1996 Robert W. Goy, James L. McClelland,  David E. Rumelhart, Shelley E. Taylor\n*\t1997 Ellen S. Berscheid, Edward Smith, Robert H. Wurtz\n*\t1998/1999 Elliot Aronson, William T. Greenough, Allan R. Wagner\n*\t2000 Richard J. Davidson, E. Tory Higgins, Elizabeth S. Spelke\n21st century\n*2001 Alan D. Baddeley, Irving I. Gottesman, Michael M. Merzenich\n*2002 John T. Cacioppo, David E. Meyer, William T. Newsome\n*2003 Lila R. Gleitman, Bruce S. McEwen, Claude M. Steele\n*2004 Sheldon Cohen, E. Mavis Hetherington, Richard M. Shiffrin\n*2005 Charles G. Gross, Douglas L. Medin, Robert S. Siegler\n*2006 Michael Davis, Marcia K. Johnson, Martin E. P. Seligman\n*2007 Marilynn B. Brewer, Jean M. Mandler, Paul Rozin\n*2008 Michael S. Gazzaniga, Janellen Huttenlocher, Hazel Rose Markus\n*2009 Susan E. Carey, Alice H. Eagly, Steven F. Maier\n*2010 Jonathan D. Cohen, Susan T. Fiske, Joseph E. LeDoux\n*2011 Barry J. Everitt,  Trevor W. Robbins, Carol S. Dweck, Daniel M. Wegner\n*2012 Edward F. Diener, Michael Meaney, Daniel L. Schacter\n*2013 Ian H. Gotlib, Robert M. Sapolsky, Linda B. Smith\n*2014 Richard N. Aslin, John A. Bargh, Carol A. Barnes\n*2015 Stanislas Dehaene, Edna B. Foa, Michael Tomasello\n*2016 Dedre Gentner, Terrie E. Moffitt and Avshalom Caspi, Terry E. Robinson and Kent C. Berridge\n*2017 Mahzarin R. Banaji and Anthony G. Greenwald, Gordon D. Logan, Robert J. Plomin\n*2018 Charles S. Carver, Michael F. Scheier, Janice K. Kiecolt-Glaser, Patricia K. Kuhl\n*2019 Linda M. Bartoshuk, Dante Cicchetti, David A. Kenny\n*2020 Stephen P. Hinshaw, Elissa L. Newport, Lynn Nadel and John O’Keefe\n*2021 Lisa Feldman Barrett, Megan R. Gunnar, Henry L. Roediger\n*2022 BJ Casey, Susan A. Gelman, Shinobu Kitayama\n*2023 Michael Fanselow, Vonnie McLoyd, Jennifer Richeson\n*2024 Jacquelynne Eccles, Lynn Hasher, Shinobu Kitayama, Henry Wellman, Rose Zacks\n*2025 Lisa Feldman Barrett, Randall W. Engle, Arie Kruglanski\nSee also\n* List of psychology awards\nReferences"
    }
  ]
}