{
  "content": [
    {
      "type": "text",
      "text": "# Aphelion (software)\n\n| discontinued           =\n| latest release version = 4.6.1\n| latest release date    =\n| latest preview version =\n| latest preview date    =\n| programming language   = C sharp, C++\n| operating system       = Windows 7 or later\n| platform               =\n| size                   = 242 MB (x86) / 972 MB (x64)\n| language               = English, French\n| language count         = 2\n| language footnote      =\n| genre                  = Image processing\n| license                = Proprietary commercial software\n| website                =\n| standard               =\n| AsOf                   =\n}}\nThe Aphelion Imaging Software Suite is a software suite that includes three base products -  Aphelion Lab, Aphelion Dev, and Aphelion  for addressing image processing and image analysis applications. The suite also includes a set of extension programs to implement specific vertical applications that benefit from imaging techniques.\nThe Aphelion software products can be used to prototype and deploy applications, or can be integrated, in whole or in part, into a user's system as processing and visualization libraries whose components are available as both DLLs or .Net components.\nHistory and evolution\nThe development of Aphelion started in 1995 as a joint project of a French company,  S.A., and an American company, Amerinex Applied Imaging, Inc. (AAI) Aphelion's image processing and analysis functions were made from operators available from the KBVision software developed and sold by Amerinex's predecessor, Amerinex Artificial Intelligence Inc. In the 1990s, the XLim software library was developed at the Center of Mathematical Morphology of Mines ParisTech, and both companies carried out its development tasks.\nThe first version of Aphelion was completed and released in April 1996. Successive versions were released before the first official stable release in December 1996 at the Photonics East conference in Boston and the Solutions Vision show in Paris in January 1997, where at the latter it competed with Stemmer Imaging's  imaging toolbox.\nIn 1998, version 2.3 of Aphelion for Windows 98 was released, and its user base was growing in both France and the United States. Version 3.0, totally rewritten to take advantage of Microsoft's then-recent ActiveX technology, was officially released in 2000. It also became available as a « Developer » version, for rapid prototyping of applications using its intuitive  and the macro recording capability, and a « Core » version, including the full library as a set of ActiveX components to be used by software developers, integrators and original equipment manufacturers ().\nAs AAI turned its focus to security, in 2001, ADCIS took the lead on developing Aphelion.  focused on millimeter wave scanners for concealed weapon detection at airports, and eventually merged with Millimetrics to become Millivision.\nIn 2004,  specified version 4.0 of Aphelion. The set of image processing/analysis functions was rewritten one more time to be compatible with the .NET technology and the emergence of 64 bit architecture s. In addition, the  was redesigned to address two usage types: a semi-automatic use where the user is guided through the different steps of functions, and a fully automatic use where the expert user can quickly invoke imaging functions. Its first release was presented at the  exhibition in Birmingham,  the same year. During the Vision Show in Paris in October 2008, the new Aphelion Lab product was launched for users that are not specialists in image processing. It is easier to use, and only includes fewer image processing functions. It was then included in the Aphelion Image Processing Suite, consisting of Aphelion Dev (replacing Aphelion Developer), Aphelion Lab, Aphelion  (replacing Aphelion Core), and a set of extensions.\nNowadays,  is still working on the suite, and updated versions with new extensions and functionalities continually become available from the websites of both companies. In 2015, support was added for very large images and scan microscope images (virtual slides compound into a very large JPEG 2000 image) for high throughput imaging, and new specific extensions were also added. In late 2015,  announced Aphelion's port for tablets and smartphones, for vertical applications.\nThe name \"Aphelion\" comes from the astronomical term of the same name, meaning the point on a planet rotating around the Sun where it lies farthest from it, applying the term in a metaphorical sense. Unix was the operating system used on scientific workstations in the 1990s, such as on the workstations manufactured by market leader Sun Microsystems, which Windows suite Aphelion was quite removed from.\nDescription\nSoftware house of Aphelion|image1 = |alt1 = ADCIS logo with 'a' white letter split over four red squares in four more or less sparsed pieces (with one of them slightly inclined).| caption1 = Logo.|width1 = 84|image2 = ADCISOfficeSCThumb.png|alt2 = Photo of the facade of the two-storey building housing the current premises of ADCIS.|caption2 = Premises.|width2 = 150}}\nAphelion is a software suite to be used for image processing and image analysis. It supports 2D and 3D, monochrome, color, and multi-band images. It is developed by , a French software house located in Saint-Contest, Calvados, Normandy.\nAphelion is widely used in the scientific/industry community to solve basic and complex imaging applications. First, the imaging application is quickly developed from the Graphical User Interface, involving a set of functions that can be automatically recorded into a macro command. The macro languages available in Aphelion (i.e. BasicScript, Python, and C#) help to process batch of images, and prompt the user if needed for specific parameters that are applied to the imaging functions. All Aphelion image processing functions are written in C++, and the Aphelion user interface is written in C#. C++ functions can be called from the C# language thanks the use of dedicated wrappers.\nThe main principle of image processing is to automatically process pixels of a digital image, then extract one or more objects of interest (i.e. cells in the field of biology, inclusions in the field of material science) and compute one or more measurements on those objects to quantify the image and generate a verdict (good image, image with defects, cancerous cells). In other words, starting from an image, pixels are processed by a set of successive functions or operators until only measurements are computed and used as the input of a 3rd party system or a classification software that will classify objects of interest that have been extracted during the imaging process.\nAn acquisition system such as a digital camera, a video camera, an optical or electron microscope, a medical scanner, or a smartphone can be used to capture images. The set of values or pixels can be processed as a 1D image (1D signal), a 2D image (array of pixel values corresponding to a monochrome or color image), or a 3D image displayed using volume rendering (array of voxels in the 3D space) or displaying surfaces by using 3D rendering. A 2D color image is made of 3 value pixels (typically Red, Green, and Blue information or another color space), and a 3D image is made of monochrome, color (indexed color are often used), multispectral, or hyperspectral data. When dealing with videos, an additional band is added corresponding to temporal information.\nThe Aphelion Software Suite includes three base products, and a set of optional extensions for specific applications:\n* Aphelion Lab: Entry-level package for non-experts in image processing. It helps to quickly segment an image in a semi-automatic or manual ways, and compute a set of measurements computed on objects of interest that have been extracted during the segmentation process. A set of wizards guides the user from image acquisition to report generation.\n* Aphelion Dev: Full imaging environment including over 450 functions to develop and deploy an application that involves image processing and analysis. It also includes a set of macro-command languages to automate any application to be invoked from the user interface. It also helps to run the imaging algorithm on more than one image that are stored on disk, available on the network, or captured by an acquisition device. Aphelion libraries for image processing and visualization are provided in Aphelion Dev as DLLs and .Net components.\n* Aphelion : A set of libraries to develop a stand-alone application with a custom interface based on the Aphelion libraries. This software development kit including display, processing and analysis functions that can be used by software developers and s. It is provided as DLLs and .Net components. The stand-alone application is typically developed in C# on one computer, and then deployed on multiple s and systems.\nA set of optional extensions can be added to the « Aphelion Dev » product, depending on the application. An evaluation version of Aphelion can be run on a  for 30 days. A permanent version of Aphelion is available based on a perpetual license. Upgrades are available through a maintenance agreement based on a yearly fee. Technical support is provided by the engineers who are developing the product.\nThe goal of image processing is usually to extract object(s) of interest in an image, and then to classify them based on some characteristics such as shape, density, position, etc. Using Aphelion, this goal is achieved by performing the following tasks:\n# Load an image from disk or acquire an image using an acquisition device.\n# Enhance the image removing noise or modifying its contrast.\n# Segment the image extracting objects of interest to be measured and analyzed. Typically, for simple applications, a threshold is performed to generate a binary image. Then, morphological operators are applied to clean the image and only keep objects of interest. Finally, a label value is given to each object based on its connectivity (4 or 8 connectivity when a square grid is used), and the background of the image is given value zero.\n# The set of objects can be manually edited by the user to remove artifacts, and alter their edges. Objects can then be measured in terms of shape, color, densitometry, and then classified using the measurements.\n# What has been developed above for one image can be applied to a batch of images thanks to the use of the macro-commands available in the Aphelion User Interface. It helps to generate more measurements and get a more robust algorithm working on multiple images.\n# Statistical analysis can be performed on the measurements and classifiers can be trained if the number of objects is large enough and if descriptors or measurements are available to classify objects into classes or categories.\nApplications\nThe Aphelion Imaging Software Suite is used by students, researchers, engineers, and software developers in many application domains involving image processing and computer vision, such as:\n* security (surveillance, object tracking)\n* remote sensing\n* quality control for the industry and inspection applications\n* materials science\n* life sciences (medicine and biology)\n* earth science (geology)\n* theory (image processing, machine learning and optimization)\nSecurity\nAphelion  has been used in the field of video surveillance involving multiple cameras. An application has been developed to monitor a subway in a capital city (corridors, platforms, etc.). Another application has been developed to count the number of people entering/exiting a room. Aphelion can also be used to monitor traffic on roads, and analyze trajectories of moving objects. In the fields of robotics and computer vision, the software can be used to detect static and moving objects such as vehicles, and moving targets. Aphelion has been used in portable devices to read car license plates.  also used the Aphelion  to perform 3D reconstructions of 2D shapes and estimate the weight and the volume of the 3D object.\nAphelionApplication8.jpg|alt=Photo of a license plate|Automatic number plate recognition.Road traffic safety\nAphelionApplication21.jpg|alt=Photo of video surveillance in a corridor subway|Person tracking in a subway using multiple cameras.Video surveillance\nAphelionApplication30.jpg|alt=Photo of fighter jet landing on an aircraft carrier|Airplane landing on a ship tracking.Object tracking\nAphelionApplication7.jpg|alt=Photo of cars detected with boxes in traffic|Car tracking.Object tracking\nRemote sensing\nAphelion is used to automatically detect roads, buildings, agricultural fields in satellite images. The software can also be used to analyze the surface of the Sun. Satellite images are usually multi band images, and contain information that the human eye cannot see. In addition, they are usually digitized on more than 8 bits. In remote sensing applications, hyperspectral images are commonly used (infrared and ultraviolet). They help to extract some specific contrast areas in known wavelengths.\nAphelionApplication4.jpg|alt=Airplane photo of Normandy rural area|Field identification and classification.Remote sensing\nAphelionApplication22.jpg|alt=Airplane photo of Paris|Road and building detection.Remote sensing\nQuality control and inspection\nIn the field of quality control for industry,  has developed a specific measurement software product to analyze printed circuit board in the field of electronics. Aphelion has also been used to analyze and read documents, as well as detecting defects on printed documents. In the field of cosmetics, Aphelion has been used to analyze the wear and tear of nail polish, and to perform quality control on facial cream. The software can also be used to compare images over time (before and after) and to objectively measure the efficacy of an anti-wrinkle cream. Other quality control applications have been developed by  such as the automatic classification of argentic grains on films.\nIn optics field,  was involved in two projects, one to develop an innovative technique to cut lenses for glasses and one to model rigid scleral contact lenses in the 3D space, and then mill them. These contact lenses are worn by patients who have severe injuries in the eye (explosion, piece of glass, etc.). This last project is a joint project between EyePrint Prosthetics and .\nAphelionApplication6.jpg|alt=Photo of nail with red nail polish|Nail polish tear and wear analysis.Cosmetics\nAphelionApplication14.jpg|alt=Macro photography of a cleanser|Quality control of a cleanser (facial cream).Cosmetics\nAphelionApplication31.jpg|alt=Photo of wrinkles observed using microscope|Wrinkles cream quality control.Cosmetics\nAphelionApplication23.jpg|alt=Photo of printed letters|Printed documentation quality control.Printing\nAphelionApplication16.jpg|alt=Photo of a lens being cut and with digital annotations|Lens cutting system.Optics\nAphelionApplication25.jpg|alt=Macro photography of printed circuit board|Printed circuit board inspection.Electronics\nAphelionApplication15.jpg|alt=Photo of argentic grains|Argentic grains monitoring.Photography\nMaterials science\nIn the field of metallurgy, Aphelion ActiveX components have been used to do metallography in conjunction with electron microscopes () and microprobe () to quantify and analyze inclusions in steel. Carbon dispersion in one step of font production has also been analyzed using image processing techniques.\nDuring the process of surface coating, and metallic element diffusion (chrome-alumine), a link has been established between the shape of elements analyzed on  images, and constraints generated by these particles (observed by X-ray diffraction). Based on ASTM standards, a set of specific tools has been implemented in the Aphelion software product to detect and then analyze grain boundaries. Work has been done in field of electron tomography to add image alignment and 3D reconstruction tools plug-in using  images.\n... a complete projection alignment and 3D reconstruction plug-in was developed and integrated to Aphelion.}}\nImage analysis also helps to study composite polymers strengthen by glass fiber, and to measure the impact of the size of micro threads used to link soft fibers in the perpendicular direction. The size of the threads can modify the matrix distribution used to combine this material. The study of the distribution of metallic elements in composite materials and alloys, such as AlSiC is usually performed by granulometry involving image processing and analysis. Porosity of macromolecular materials as xerogel is sometime studied using 3D and X-ray microtomography.\nThe Aphelion software product has been used in the field of chemical engineering to study water mixes coming from two different sources in a continuous stirred-tank reactor. First, a correlation has been established between the light intensity from a laser plane  described as grey level values, and concentrations going through that plane. The correlation was then used to quantify concentration evolutions using image processing.\nIn the field of industrial water treatment and sewage treatment, Aphelion helps to process XRay microtomograph images of sewage sludge. Each section is processed as a 2D image, a binary threshold is then applied to discriminate between air and the humid material, and finally a 3D reconstruction is performed to track the volume evolution of cracks during the drying process. This last process is important to treat sewage sludge to be landfilled, incinerated or applied on agricultural land. The automatic analysis helped to track the crack evolution depending on the origin of different sludges. The image processing involved a histogram equalization followed by an Otsu threshold. Aphelion has also been used in the field of XRay microtomography to perform statistical analysis of foams (number of bubble faces, bubble average size,&nbsp;etc.).\nAphelionApplication1.jpg|alt=Virtual 3D image of zircone spherical particles in alumine|Zirconium particles in aluminium.3D analysis\nAphelionApplication24.jpg|Chemical mapping .Materials science|alt=False-colour images of chemical components concentrations\nAphelionApplication5.jpg|alt=Close-up picture of concrete with blue elements visible|Granulometry.Materials science\nAphelionApplication36.jpg|alt=Microscopy image of grains of a material with boundaries displayed in yellow overlay|Grain Sizing.Materials science\nAphelionApplication35.jpg|alt=Microscopy image of a steel inclusion|Inclusion Analysis in steel.''Metallography\nLife sciences\nThe comprehensive set of Aphelion functions is used to analyze images coming from an optical microscope and a camera mounted on top of the microscope. The software also controls the automated stage mounted on the microscope in the X, Y and Z directions. Z is used to change focus. Measurements based on shape analysis (surface area, perimeter, volume, elongation, compactness, etc.) and texture analysis (e.g., homogeneity, average intensity, moments) are automatically computed by Aphelion and displayed in the user interface in a spreadsheet on which statistical analysis as surface ratios can be performed. Analysis reports can also be generated in the user interface and then saved in specific folders. Microscopes using reflected light can also be used for the analysis. For example, a specific software based on the Aphelion ActiveX components is capable to measure inhibitor agent effects on dentin cells resorption.\nIn the field of cytopathology,  developed a set of software products such as a specific software to analyze blood composition, count and classify red globules, and another software to automatically classify cancerous cells using a classification based on multiple neural networks. Images are first acquired by a video camera mounted on an automated optical microscope. They are then automatically processed by Aphelion, and cytoplasm and nuclei are segmented using a watershed algorithm. Aphelion has also been used to study tumor vascularization in low resolution images using a slide scanner (much cheaper than a scan microscope). conference of the French Microscopy Society () (SFμ)\n|date            = 4–8 July 2005\n|access-date     = 25 November 2015\n|url             = http://commonforall.adcis.net/pub/P_HERLIN_Quantification_de_vascularisation.pdf\n}}An image analysis macro-command, developed in the Aphelion (ADCIS) toolbox software, allows to appreciate objectively the mean and maximum grades of tumor vascularisation.}} The software that was developed helped the detection of immune-marked cells. Image analysis is also used in histology to study angiogenesis in 2D and 3D on microscopy images)\n| date                   = 2005\n| hdl                  = 2042/14096\n}}Softwares used to accomplish this work are: (a) APHELION v.3.2 for 2D image analysis, 3D reconstruction, and 2D and 3D measurements, [...]}} to measure effects of inhibitors and accelerants impact on blood vessels growth.\ndeveloped a chromosome classification assistant in the field of cytogenetics to automatically detect telomeres and pair chromosomes. Ploidics, a software product to quantify  ploidy based on optical density has been developed for a customer and released as an off-the-shelf product. Aphelion can also be used to analyze gel electrophoresis.\nIn the field of dermatology, Aphelion users developed a method to quantify wounded cells.\nAphelion and software products based on Aphelion have been widely used in the field of ophthalmology. The first product that was released was capable of detecting lesions in color fundus images of patients with age-related macular degeneration or to automatically determine a diabetic retinopathy grade. Other software products for ophthalmology pathologies have been developed such as  for measurement of 3D volume of pigment epithelium detachment,  to study confocal images of the cornea in the 2D and 3D spaces,  to quantify conjunctival hyperaemia at the ocular surface, and  to study dry eye syndrome looking at tears present on lid wiper epithelium.\nIn the field of pharmacology,  used the Aphelion  libraries to develop a specific software product to find new molecules inhibiting mitosis in epifluorescence microscopy images.\nA joint development has been developed in radiology application field by  and Robert Van't Hof to study osteoporosis images of the bone and quantify porosities. ADCIS also used tomography method () to perform 3D reconstruction from multiple points of view measuring background absorption (e.g., cone beam computed tomography).\nSome Aphelion research users used the software in the field of biology to automatically quantify ox maturation. They developed segmentation techniques applied on vertebra images including color space conversions (CIE L*a*b* and Hue, Saturation, and Intensity) to detect bones and cartilage edges. Image Processing can also be used to count cells. This technique was applied when looking at Petri dishes in microbiology.\nIn agriculture and botany, the Aphelion Software Product helps to study macroscopic scale properties of leaves. The algorithm includes a segmentation of leaves versus the background, and then compute a set of measurements and perform a statistical analysis and then classification. The ultimate goal of the application was to find a correlation between physiology parameters of fruit trees, and visual observation on leaves.\nIn the food industry, Aphelion can be used to measure the average grain size, or to compute the surface ratio of pulps in tomatoes.\nAphelionApplication3.jpg|alt=Color fundus picture|Color fundus images of the retina.Ophthalmology\nAphelionApplication38.jpg|alt=Confocal microscopy gray levels image of cornea nerves|Confocal image of the cornea nerves.Ophthalmology\nAphelionApplication12.jpg|alt=Microscope photo of blue stain cells and maroon immune-marqued cells|Immune-marqued cells detection.Oncology\nAphelionApplication34.jpg|alt=Cells inhibiting mitosis displayed using registered bands of epifluorescence microscopy and false-colors|Selection of molecules inhibiting mitosis.Pharmacology\nAphelionApplication44.jpg|alt=Black and white image of cutaneous cells healing in a Petri dish|Wound healing quantization.Dermatology\nAphelionApplication26.jpg|alt=Bone radiography with edge detection displayed in overlay|Osteoporosis analysis.Radiology\nAphelionApplication18.jpg|alt=Green microscope image of chromosomes|Chromosome classification.Cytogenetics\nAphelionApplication17.jpg|alt=Yellow image of sparsed grains|Seed Analysis.Metrology\nEarth science\nIn the field of geology, scientists based their research work on Aphelion to perform a statistical analysis to determine the relationship between the size and shape of rock debris present in moraines, and the value of the maximal slope that will not cause rockfalls. Morphological parameters computed by Aphelion are easier to compute and less expensive to generate than the usual ones.\nImages, coming from macro photographies of metamorphic rocks helped to study the distribution of garnet crystals in the Alps.\nIn geothermal engineering, Aphelion was used in project for the Soultz-sous-Forêts site in Alsace, France.  It was used to study the distribution of quartz grains in a drill (granulometry). Crack networks have also been studies using thermal, hydraulic, and mechanical techniques.\nTheory\nImage Processing and Analysis is a scientific discipline as well as statistics, and set theory are. Research people spend time to find new algorithms, new functions (adaptive contrast, new color space definition,&nbsp;etc.), or even newer techniques such as deep learning. There is a very tight connection between image processing and classification (machine learning), which is part of the artificial intelligence field.\nAphelion can be used to develop new image processing operators that are easily inserted into the graphical user interface. Once the operator is available in the , it can be tested, associated parameters can be altered, and it can even be called from a macro-command to be tested in an algorithm or a full batch of images.\nNew operators are added from time to time depending on customer requests, and new techniques that are developed in research labs. For example, works from Hanbury and Serra on color spaces where the hue is represented as an angle (Hue Saturation Value, Hue Saturation Lightness, Hue Saturation Brightness or Hue Saturation Intensity) are proposing a new color space,  derived from  (Hue, Saturation, Lightness). Gervais Gauthier, from , gave a talk where he showed the benefit of a vectorial representation of objects and chains in image processing.\nSubjects of work or research as program optimization, parallel computing with threads, distributed computing (clusters or grids of computers and video cards), GPGPU or new processor instruction sets usage, evolve according to the hardware progresses made regularly. The computer performances ever increase, changing the definition of reachable real-time computations. Aphelion performances are sometime used as reference to compare optimizations.\nSpecifications\nAll products of the Aphelion Imaging Software Suite can be run on  equipped with Windows (Vista, 7, 8, 8.1, or 10) 32 or 64 bits.\nAn online help and video tutorials are available to the user.\nSoftware extensions\nBelow is a list of Aphelion optional extensions:\n* 3D Image Processing and 3D Image Display: A set of extensions to display and process 3D images. The 3D display extension is based on the  software product.\n* 3D Skeletonization: Extension to compute the 3D skeleton.\n* Image Registration: Image registration extension to register images coming from different acquisition devices.\n* Classification Tools: Classification extension including a « Fuzzy Logic » (fuzzy logic classification),« Neural Networks » (classification based on artificial neural networks, and « Random Forest » (classification based on random forests, derived from the R software product)\n* Kriging: Specific extension to remove image noise using geostatistics techniques.\n* Camera interface drivers and microscope interface software\n* Virtual Image Capture and Virtual Image Stitcher: Two software products to capture mult-field images and stitch them into one single and very large image in the fields of optical and electron microscopy (image stitching).\n* Stereology Analyzer: Software to analyze a very large image using stereology. This extension is mainly used in the field of biology on images acquired by a scan microscope.\n* VisionTutor: Online image processing course including all the theory and application macro commands that are compatible with Aphelion.\nThe Aphelion user can add his/her own macro-commands in the user interface that have been automatically recorded to process a batch of images. He/she can also add plugins and libraries in the  that have been developed outside the Aphelion environment.\nSoftware versions\n{| class=\"wikitable\" align=\"center\" style=\"margin-left: auto; margin-right: auto;\"\n|+ Aphelion software release dates\n|- style=\"background-color:#525F79;color:#FFF;\"\n| width=\"50%\" | Software release\n| width=\"50%\" | Release date\n|-\n| Aphelion 1.0 || 1995\n|- style=\"background-color:#B7BCC6;\"\n| colspan=\"2\" |\n|-\n| Aphelion 2.0first official version || 1996\n|-\n| Aphelion 2.1 || 1996–1997\n|-\n| Aphelion 2.2 || 1997\n|-\n| Aphelion 2.3 || 1998–1999\n|- style=\"background-color:#B7BCC6;\"\n| colspan=\"2\" |\n|-\n| Aphelion 3.0 || 1999–2000\n|-\n| Aphelion 3.1 || December 2001\n|-\n| Aphelion 3.2a-f || 2001–2004\n|-\n| Aphelion 3.2g || March 2004\n|-\n| Aphelion 3.2h || November 2004\n|-\n| Aphelion 3.2i || March 2006\n|-\n| Aphelion 3.2j || October 2008 – 2012\n|- style=\"background-color:#B7BCC6;\"\n| colspan=\"2\" |\n|-\n| Aphelion 4.0.0 || July 2009\n|-\n| Aphelion 4.0.5 || December 2009\n|-\n| Aphelion 4.0.6 || May 2010\n|-\n| Aphelion 4.0.7 || August 2010\n|-\n| Aphelion 4.0.8 || October 2010\n|-\n| Aphelion 4.0.9 || February 2011\n|-\n| Aphelion 4.0.10 || April 2011\n|-\n| Aphelion 4.1.0 || October 2011\n|-\n| Aphelion 4.1.1 || April 2012\n|-\n| Aphelion 4.1.2 || November 2012\n|-\n| Aphelion 4.2.0 || February 2013\n|-\n| Aphelion 4.2.1 || January 2014\n|-\n| Aphelion 4.3.0 || October 2014\n|-\n| |Aphelion 4.3.1 || December 2014\n|-\n| Aphelion 4.3.2 || September 2015\n|-\n| Aphelion 4.4.0 || October 2017\n|-\n| Aphelion 4.5.0 || February 2021\n|-\n| Aphelion 4.6.0 || October 2022\n|-\n| Aphelion 4.6.1 || June 2023\n|}\nSee also\n]]\n*\n* CVIPtools\n* LabVIEW\n* R\n* SciPy\n}}\nNotes and references\nExternal links\n*\n*"
    }
  ]
}