{
  "content": [
    {
      "type": "text",
      "text": "# Apocalypse Culture__disambig_1\n\n| pages             = 272\n| isbn              = 0-941693-02-3\n| congress          = CB430 .A66 1987\n| dewey             = 001.1\n| oclc              = 15591230\n| followed_by       = Apocalypse Culture II\n| cover_artist      = Joe Coleman\n}}\nApocalypse Culture, or just Apocalypse, is an anthology of the fringe and transgressive edited by Adam Parfrey and first published by his publishing house Amok Press in 1987. Three years later, it was republished in an expanded and revised edition by Parfrey's second publishing house, Feral House. The book, named after Parfrey's fringe cultural scene, defines itself as \"an exhaustive tour through the nether regions of today's psychotic brainscape\"; it contains writings from, among others, anarchist Hakim Bey and journalist Thomas McEvilley, as well as avowed neo-Nazis, Satanists, pedophiles, necrophiles, and writing from Parfrey himself.\nThough controversial, the book was popular with its audience and sold well, reportedly having sold at least 100,000 copies by 2010. The expanded edition contains largely different content. It was a success for Parfrey, his earliest book to achieve this kind of success, and became a cult classic in some circles. The book was banned in Russia in 2006. It was followed by a sequel, Apocalypse Culture II, in 2000.\nBackground\nAdam Parfrey was an American writer, editor, and publisher known for his publication of outsider works. He was the creator of the publishing house Amok Press and its successor Feral House. Seattle Weekly described him in 2010 as \"one of the nation's most provocative publishers\". Many of the works he published were extremely controversial, and he had connections to some neo-Nazis and white supremacists.\nThe title of the anthology, \"apocalypse culture\", is what Parfrey dubbed his fringe cultural scene. \"Apocalypse culture\" has been described by Mark Harrison as \"a literary and cultural milieu for those fascinated with eschatology, or the study of last things\", including discussions of, among other topics, mind control, paraphilia, and fascism.\nPublication history\nIt was first published by Parfrey's publisher Amok Press in 1987. An expanded and revised edition was published in Port Townsend in 1990 by Feral House, a publisher he founded after the publication of the first edition.\nThe book was reported to have sold 100,000 copies by 2010, and was one of Parfrey's most successful books. It was Parfey's earliest book to achieve fame. A sequel, Apocalypse Culture II, was published by Feral House in 2000.\nIn 2006, it and its sequel were translated into Russian in 2006 and published combined as one volume by the Russian counterculture publisher Ultra.Kultura as . The book was afterwards banned in Russia as \"drug propaganda\" (a single entry in the sequel is about ketamine) and all copies were confiscated.\nContents\nThe book, an anthology volume, defines itself as \"an exhaustive tour through the nether regions of today’s psychotic brainscape\". The book begins with a blurb by J. G. Ballard, who calls the book a collection of the \"terminal documents of the twentieth century\". Following that is a quote from Werner Herzog: \"There is nothing more terrifying than stupidity\". It focuses on fringe and transgressive behavior, including socially and sexually. Parfrey notes in an introduction that \"The reader of Apocalypse Culture will soon begin to notice a preponderance of materials from individuals who have the audacity to consider themselves their own best authority, in repudiation or ignorance of the orthodoxy factories of Church, University, or State.\" The contents of the anthology are similar to Exit, a prior magazine created by Parfrey. The 1990 edition has much new content and also lacks much of the content of the 1987 edition. Both editions are illustrated and contain the short biographies on and the contact information of the writers included, when available.\nChapters include interviews with Peter Sotos, the creator of the serial killer and pro-pedophile zine Pure, and another interview with necrophiliac Karen Greenlee. Several entries are written by Parfrey himself, discussing, among other topics, self-castration and the modern aesthetic being terroristic in nature. There is a large amount of neo-Nazi material in the book. It includes flyers from neo-Nazi James Mason, later the author of Siege, a selection from Adolf Hitler, Savitri Devi's The Lightning and the Sun, and Holocaust denier Michael A. Hoffman II.\n1987 version\n{| class=\"wikitable\"\n|+ Chapter list\n|-\n! scope=\"col\" | Section\n! scope=\"col\" | Title\n! scope=\"col\" | Author\n! scope=\"col\" | Subjects/Details\n|-\n|\n|\"Prelude\"\n|Adam Parfrey\n|\n|-\n| rowspan=\"10\" | Apocalypse Theologies\n|\"Latter-Day Lycanthropy: Battling for the Feral Soul of Man\"\n|Adam Parfrey\n|Lycanthropy\n|-\n|\"The Unrepentant Necrophile: An Interview with Karen Greenlee\"\n|Jim Morton\n|Interview with the necrophiliac Karen Greenlee.\n|-\n|\"Infernal Texts\"\n|Various\n|Selections from the works of Mel Lyman, Louis Wolfson, Dan Burros, Edmund Burke, Savitri Devi's The Lightning and the Sun, Genesis P-Orridge\n|-\n|\"The Time of The End Is Now: Texts from The Process\"\n|Boyd Rice\n|Not in revised edition.\n|-\n|\"Opiates, Brainwashing, and Fasting: A Physiological Understanding of the Oracular Process\"\n|Tim O'Neill\n|Not in revised edition.\n|-\n|\"The Disciples of Flesh\"\n|Tim O'Neill\n|Not in revised edition.\n|-\n|\"The Last Defense of LSD\"\n|Joseph Lanz\n|Not in revised edition.\n|-\n|\"Psychois in Illumination: LSD's Internalized Imperium\"\n|\n|Not in revised edition.\n|-\n|\"A New Dawn Has Come...\"\n|Adolf Hitler\n|Not in revised edition.\n|-\n|\"Instructions for the Kali-Yuga\"\n|Hakim Bey\n|Kali\n|-\n| rowspan=\"8\" | Apocalypse Art\n|\"Schizophrenic Responses to a Mad World: Love, Lithium, and the Loot of Lima\"\n|James Anubis Van Cleve\n|Schizophrenia\n|-\n|\"A Metaphysics of Disaster: The Spurt of Blood As Revelation\"\n|Elinor Fuchs\n|Not in revised edition.\n|-\n|\"Art in the Dark\"\n|Thomas McEvilley\n|Hermann Nitsch\n|-\n|\"Body Play\"\n|Fakir Musafar\n|Body modification\n|-\n|\"Fakir Musafar Interview\"\n|Kristine Ambrosia and Joseph Lanza\n|\n|-\n|\"Interview with Peter Sotos of Pure\"\n|Paul Lemos\n|An interview with Peter Sotos, the creator of the pro-pedophile and serial killer zine Pure.\n|-\n|\"Aesthetic Terrorism\"\n|Adam Parfrey\n|\n|-\n|\"The Case Against Art\"\n|John Zerzan\n|\n|-\n| rowspan=\"8\" | Apocalypse Science\n|\"Every Science is a Mutilated Octopus\"\n|Charles Fort\n|Quotations collected by Joseph Lanz and Michael A. Hoffman II\n|-\n|\"From Orgasm to UFOs: Wilhelm Reich's Contact With Space\"\n|Adam Parfrey\n|Orgone\n|-\n|\"The Cosmic Pulse of Life\"\n|Trevor James Constable\n|Wilhelm Reich\n|-\n|\"Eugenics: The Orphaned Science\"\n|Adam Parfrey\n|Quotations from Numbers, Plato, Thomas Malthus, Count Arthur de Gobineau, Sir Francis Galton, Charles Darwin, Alfred Russel Wallace, Herbert Spencer, Dr. Alexander Graham Bell, Houston Stewart Chamberlain, Havelock Ellis, Madison Grant, Paul Popenoe & Roswell Hill Johnson, H.A. Schultz, Albert Edward Wiggam, Adolf Hitler, Justice Oliver Wendell Holmes, Bertrand Russell, Rudolf Frerks, Lothrop Stoddard, A.F. Tregold, Aldous Huxley, Paul R. Ehrlich, Edward O. Wilson, Arthur Jensen, and The New York Times\n|-\n|\"Nature as Slave: Satanic Technology and the West\"\n|Oswald Spengler, Jim Brandon\n|Selections from Brandon's The Rebirth of Pan and Spengler's Man and Technics and Twilight of the Evening Lands\n|-\n|\"Man A Machine\"\n|David Paul\n|\n|-\n|\"Beyond the Pleasure Principle: towards a body without organs\"\n|Gregory Whitehead\n|Not in revised edition.\n|-\n|\"Quantum Mechanics and Chaos Theory: Anarchist Meditations on N. Herbert's Quantum Reality: Beyond the New Physics\"\n|Hakim Bey\n|Not in revised edition.\n|-\n| rowspan=\"8\" |Apocalypse Politics\n|\"Vagaries of Negation: Data on the Decomposition of Society\"\n|John Zerzan\n|Not in revised edition.\n|-\n|\"Let's Do Justice for our Comrade P-38\"\n|Red Brigades\n|\n|-\n|\"The Theology of Nuclear War\"\n|Larry Kickham\n|Not in revised edition.\n|-\n|\"From the Mark of the Beast to the Black Messiah Phenomenon: The Chronicles of Ron J. Steele, Investigative Reporter & Prophetic Author\"\n|Adam Parfrey\n|Big Brother, false messiahs and Michael Jackson as a possible Black Messiah\n|-\n|\"The Christian Theory of Occult Conspiracy\"\n|Damian 1247 (Adjutor 9 = 2) (actually Tim O'Neill)\n|\n|-\n|\"Society for the Eradication of Television Fact Sheet\"\n|\n|\n|-\n|\"Alchemical Conspiracy and the Death of the West: An Introduction to James Shelby Downard's King-Kill/33°\n|Michael A. Hoffman II\n|Not in revised edition.\n|-\n|\"King-Kill/33': Masonic Symbolism in the Assassination of John F. Kennedy\"\n|James Shelby Downard\n|Not in revised edition.\n|}\n1990 edition\n{| class=\"wikitable\"\n|+ Chapter list\n|-\n! scope=\"col\" | Section\n! scope=\"col\" | Title\n! scope=\"col\" | Author\n! scope=\"col\" | Subjects/Details\n|-\n|\n|\"Preface to the Second Edition\"\n|Adam Parfrey\n|\n|-\n| rowspan=\"22\" | Apocalypse Theologies\n|\"Latter-Day Lycanthropy: Battling for the Feral Soul of Man\"\n|Adam Parfrey\n|Same as first edition\n|-\n|\"The Unrepentant Necrophile: An Interview with Karen Greenlee\"\n|Jim Morton\n|Same as first edition\n|-\n|\"Infernal Texts\"\n|Various\n|Modified from first edition. Selections from the works of Mel Lyman, Louis Wolfson, Dan Burros, Edmund Burke, Savitri Devi's The Lightning and the Sun, Boyd Rice, John Whiteside Parsons, Robert de Grimston, and P. T. Barnum\n|-\n|\"Frank Talk from a Psychopath\"\n|Adam Parfrey\n|Aspiring mass murderer\n|-\n|\"G.G. Allin: Portrait of the Enemy\"\n|Adam Parfrey\n|\n|-\n|\"Aesthetic Terrorism\"\n|Adam Parfrey\n|Same as first edition\n|-\n|\"Interview with Peter Sotos of Pure\"\n|Paul Lemos\n|Same as first edition\n|-\n|\"Schizophrenic Responses to a Mad World: Love, Lithium, and the Loot of Lima\"\n|James Anubis Van Cleve\n|Same as first edition\n|-\n|\"Art in the Dark\"\n|Thomas McEvilley\n|Same as first edition\n|-\n|\"Instructions for the Kali-Yuga\"\n|Hakim Bey\n|Same as first edition\n|-\n|\"Surgeons and Gluttons in the House of Flesh: Notes on the Hidden Unity between the Additive and Subtractive Festishes\"\n|Tim O'Neill\n|Body modification\n|-\n|\"Cut it Off: A Case for Self-Castration\"\n|Adam Parfrey\n|\n|-\n|\"Body Play\"\n|Fakir Musafar\n|Same as first edition\n|-\n|\"Fakir Musafar Interview\"\n|Kristine Ambrosia and Joseph Lanza\n|Same as first edition\n|-\n|\"The Case Against Art\"\n|John Zerzan\n|Same as first edition\n|-\n|\"Man A Machine\"\n|David Paul\n|Same as first edition\n|-\n|\"Let's Do Justice for our Comrade P-38\"\n|Red Brigades\n|Same as first edition\n|-\n|\"Long Live Death!\"\n|The Abraxas Foundation\n|Quotations from Heraclitus, Jonathan Swift, Charles IX, Owen, Chidiock Tichborne, Yukio Mishima, Fyodor Dostoevsky, Gabriele D'Annunzio, Sigmund Freud, Robert Jay Mathews, Rudolf von Sebottendorf, Vladimir Bukovsky, Richard Wagner, Jack London, the Richard Strauss opera Elektra, Ragnar Redbeard, Walt Whitman, and P. Luftig\n|-\n|\"The Muslim Program\"\n|Elijah Muhammad\n|from The Fall of America\n|-\n|\"Mel Lyman: God's Own Story\"\n|John Aes-Nihil\n|Mel Lyman\n|-\n|\"The Process: A Personal Reminiscence\"\n|R. N. Taylor\n|Process Church of the Final Judgement, Robert de Grimston\n|-\n|\"Sorcerer of Apocalypse: An Introduction to John Whiteside Parsons\"\n|Michael Staley\n|\n|-\n| rowspan=\"17\" | The Invisible War\n|\"The Invisible War\"\n|Anton LaVey\n|Weather control, Black noise, White noise, Microwave Radiation\n|-\n|\"The Cereal Box Conspiracy Against the Developing Mind\"\n|Michelle Handelman and Monte Cazazza\n|\n|-\n|\"Society for the Eradication of Television Fact Sheet\"\n|\n|Same as first edition\n|-\n|\"From the Mark of the Beast to the Black Messiah Phenomenon: The Chronicles of Ron J. Steele, Investigative Reporter & Prophetic Author\"\n|Adam Parfrey\n|Same as first edition\n|-\n|\"Satori & Pornography: Canonization through Degradation\"\n|Christian Shapiro\n|\n|-\n|\"Eugenics: The Orphaned Science\"\n|Adam Parfrey\n|Same as in first edition\n|-\n|\"How to Kill: Are Afrikan People Subjects of a Genocidal Plot?\"\n|Harry Allen\n|Interview with Jack White and Asiba Tupahache\n|-\n|\"Agriculture: Demon Engine of Civilization\"\n|John Zerzan\n|\n|-\n|\"Nature as Slave: Satanic Technology and the West\"\n|Oswald Spengler, Jim Brandon\n|Same as first edition\n|-\n|\"Every Science is a Mutilated Octopus\"\n|Charles Fort\n|Same as first edition\n|-\n|\"From Orgasm to UFOs: Wilhelm Reich's Contact With Space\"\n|Adam Parfrey\n|Same as first edition\n|-\n|\"The Cosmic Pulse of Life\"\n|Trevor James Constable\n|Same as first edition\n|-\n|\"Who Rules Over Earth?: The Archetype of the World Ruler and the Work of Universal Regeneration\"\n|Tim O'Neill\n|\n|-\n|\"The Christian Right, Zionism, and the Coming of the Penteholocaust\"\n|Gregory Krupey\n|Rev. Jerry Falwell, Rev. James Robison, Ronald Reagan, Hal Lindsey, Judgement Day, End times, the Al-Aqsa Mosque, Rabbi Moshe Levinger, the Temple Mount, Jesse Helms, the Jerusalem Temple Foundation\n|-\n|\"A History of Vengeance and Assassination in Secret Societies\"\n|Tim O'Neill\n|Freemasonry, Illuminati, Hassan-i-Sabah, the Knights Templar\n|-\n|\"The Call to Chaos: From Adam to Atom By Way of the Jornada del Muerto\"\n|James Shelby Downard\n|Alchemy, Adam Kadmon, Synergism\n|-\n|\"Meditations on the Atom and Time: An Attempt to Define the Imagery of War and Death in the Late Twentieth Century\"\n|Dennis Stillings\n|Nuclear War, the atomic bomb, Gnosticism, the apocatastsis\n|}\nReception and legacy\nThe book was well-received with its audience. A contemporary review from Melody Maker's John Wilde called it \"unputdownable\". Jay Kinney said that \"by unearthing direct communiques from some of the human race's most t unsettling thought-criminals, Parfrey helps broaden our grasp of what people are capable of thinking ... and doing.\" but that the book contained much \"out-and-out sociopathic material\". Writer Mark Dery was critical, calling the book an \"unsavory spectacle\", and said that reading the book was an experience \"where one is left with gelatinous, unsubstantial opinion and pitifully few facts\". Parfrey responded in turn, writing that the sheer negativity of the review pleased him.\nA retrospective note in The Daily Telegraph said it had become an \"instant underground cult classic\", for its \"compilation of some of the craziest beliefs and forms of behavior\". The writer noted these were more marginal in the past. Spencer Sunshine described it as \"infamous\" and as a \"cult classic\" in underground circles. Jeffrey Kaplan wrote that it had become \"an instant underground classic with its bizarre collection\". Seattle Weekly said that the book is what cemented Parfrey as \"the enfant terrible of the publishing world\". Its platforming of neo-Nazi authors has received criticism; Sunshine wrote that if \"one wished to read White Supremacist and neo-Nazi literature, Apocalypse Culture had a sampling on offer\".\nParfrey claimed in a 2010 interview that many people had told him the book had \"changed their lives\", in that \"the culture that was provided them in school and so on was expanded [in Apocalypse Culture] and torn apart.\"\nReferences\nWorks cited\n*\n*"
    }
  ]
}