{
  "content": [
    {
      "type": "text",
      "text": "# Appetizer (software)\n\n| latest_release_version = 1.4.6.494\n| latest release date    =\n| programming language   = C++, wxWidgets\n| operating system       = Microsoft Windows\n| size                   = 1 MB\n| genre                  = Dock bar, application launcher\n| license                = GNU GPL 3\n| website                =\n}}\nAppetizer is an open source dock for Windows 2000, XP, Vista and 7, which allows organizing the user's shortcuts and applications. It can be customized via skins and plugins and is available in 25 languages. Various other features are available including support for keyboard shortcuts, custom icons and tray icon support. Appetizer also features a function to automatically launch certain applications when it starts.\nAppetizer started as a PortableApps.com application. As such it is designed to be portable and can be installed on a USB drive or other portable device. If the standard PortableApps.com folder structure is detected on the drive, Appetizer will automatically import the user's shortcuts.\nReception\nAppetizer has been reviewed by several websites and magazines. It was chosen as \"freeware of the month\" by UpdateStar in 2009 and was in the \"top 10 of the best launchers\" on Clubic. Clubic appreciated its ease of use and the small size of its executable. DownloadSquad reviewed Appetizer and noted that thanks to its open source nature, \"it is easy for anyone to develop skins, plugins, or other features for the application\". Likewise, LifeHacker called it a \"free, polished, and highly customizable open source candidate\". Softonic noted that the application didn't \"really add many new functions to the Start menu\" but was \"a very eye-catching alternative menu\" and \"goes straight to the point\". PC World reviewed Appetizer and noted that it \"would likely be of most use when run alongside the also-free portable app suite\".\nAppetizer was also reviewed in 2009 on the French TV channel Game One during the Funky Web TV show.\nReferences\nExternal links\n*"
    }
  ]
}