{
  "content": [
    {
      "type": "text",
      "text": "# Aquaculture of coral\n\nCoral aquaculture, also known as coral farming or coral gardening, is the cultivation of corals for commercial purposes or coral reef restoration. Aquaculture is showing promise as a tool for restoring coral reefs, which are dying off around the world. The process protects young corals while they are most at risk of dying. Small corals are propagated in nurseries and then replanted on the reef.\nCoral is also farmed by scientists for research, by businesses for the live and ornamental coral trade, and by private reef aquarium hobbyists.\nCoral reef farming involves extracting a part of a coral colony or free-floating larvae from a reef, and growing them in a nursery until outplanting would be successful. It is commonly referred to as the \"gardening method\" and has been compared to silviculture as a management practice that mimics natural ecosystems.\nAdult corals can be transplanted onto a reef, usually in a damaged area. Coral is farmed for conservation reasons in the Philippines, Israel, Solomon Islands, Palau, Fiji, Marshall Islands, and Japan. Land-based coral farming occurs in public aquariums in North America and Europe.\nBenefits of healthy reefs\nhoused in the Ānuenue coral farm in Honolulu, Hawaii. The light is deep blue to simulate the light of the deep sea. This species can be found up to 130 meters deep.]]\nA healthy reef houses a large amount of biodiversity with varying species of corals. It requires herbivores, such as parrotfish and collector urchins, that graze on infesting algae. Most corals require oligotrophic water, that is, water that is clear and nutrient-poor. Corals derive nutrients from zooxanthellae symbionts, as well as from plankton and other free-floating particles. Zooxanthellae require a mixture of white and blue light to thrive within the coral, depending on the coral type. Some corals, like the orange cup coral, do not require light, and rely on the plankton or free-floating nutrients as sustenance.\nCoral reefs protect the coastline from erosion and storm damage. They are important foundation species that increase biodiversity in the area by providing nursery ground and habitat for nearly one-third of saltwater fish species. These include ten percent of all fish captured for human consumption, even though reefs only cover less than one percent of the ocean's surface.\nReefs in decline\nReefs are negatively affected by many factors, including severe weather events such as cyclones, temperature changes of 1–2 degrees from the average water temperature over a period of weeks, predation by crown of thorns starfish, and competition for their habitats with other foundation species such as algae. Algae can take over coral habitats when the water contains excess nutrients (nitrogen and phosphorus) or when fishing stocks are too low and herbivorous fish do not keep the algae at bay by eating it.\nCorals can minimally protect themselves from algae as well, by removing them with their polyps. When corals are in suboptimal conditions, they are less able to protect themselves from algal coverage, diseases, and other stressors. This diversion of energy from growth puts the coral's life at risk. Coral bleaching is the result of the loss of vital zooxanthellae; any of the stressors can cause bleaching. The corals expel their symbionts because they are trying to get rid of any foreign bodies that might be causing them stress. Corals can survive up to a week without the zooxanthellae, but it is difficult. Corals can recover from bleaching and uptake vital zooxanthellae again but this requires a change in environment and the lessening of stressors.\nNatural stressors to the coral reef are further aggravated by the human impact on coral reefs. Anthropogenic stressors such as runoff, coastal development, dynamite fishing, cyanide fishing, overexploitation of resources and marine pollution, put 58% percent of the world's reefs under threat as of 2009. An example is the exploitation of mushroom coral in Indonesia, where it is harvested to supply the jewelry and curio trades. Harvesting of living reef organisms, including coral, is increasing around the world. Coral is often overharvested to supply growing demand. Overharvesting weakens the ability of reefs to replenish after other harmful events.\nReef restoration\n]]\nCoral propagation can improve coral cover, biodiversity, and structural heterogeneity of a degraded reef. Success has been achieved with fire coral, Pocillopora verrucosa, and Acropora hemprichii. A restored reef hosts organisms associated with the reef, such as reef fishes.\nReefs are delicate and complex ecosystems. It is difficult to replicate what a damaged reef looked like before the damage occurred. Most coral farms that are utilized for the mitigation of damage are only able to propagate the fast-growing corals that are easy to grow. Slow-growing corals are expensive to propagate and are not a fast-growing foundation species, which is needed when damage occurs. Most coral reefs will take decades to return to their previous state. Nursery-grown coral promote reef resilience by making contributions to the larval pool. This could have a positive effect on new growth if the transplanting of the new coral is done just before a larval release season.\nOceanographer Baruch Rinkevich coined the term active restoration to describe coral reef farming, in contrast with what he described as passive restoration efforts focused on mitigation of stressors by means such as the designation of marine protected areas (MPAs). Coral reefs are often placed in MPAs in the hope that reducing human activity will allow the coral to recover.\nAquarium trade\nMany people enjoy creating their own coral display in a home aquarium. In response to this, businesses farm coral to supply them. Some companies farm in sunlit greenhouses instead of artificially lighted aquariums. The 1999 Hawaii Marine Ornamentals Conference concluded with a recommendation to \"give highest priority to projects involving the advancement of marine ornamental aquaculture and reef preservation.\" Conferees pressed the importance of encouraging hobbyists to supply only from coral reef farms to help deter over-harvesting. Conferees recommended initiatives to encourage consumer understanding that cultured ornamentals are a more sustainable and 'higher value' alternative to wild-caught live reef organisms.\nMethods\nFor conservation\nThe stages to farming for reef restoration are: collecting polyps or larvae; growing the specimens in tanks; further growth in sea nurseries and re-transplantation onto the reef.\nCollection\nCoral can reproduce asexually by budding or sexually by spawning.\nCollecting coral polyps from existing reef colonies or fragments can be done at any time. Branches, fragments, or tips of branches are common targets. This is the most widely practiced method.\nCollecting coral spawn is generally an annual activity, conducted immediately following a spawning event. Coral colonies on a reef usually spawn together in a synchronized event on a specific day. This allows for hundreds of thousands of coral embryos to be collected at one time. This method is known as spat stocking.\nAt the Great Barrier Reef Aquarium in Townsville, Australia, large colonies of Acropora formosa have collection devices placed above them during spawning. Small mature colonies are transplanted from the reef into a tank for spawning. They can then be reattached to the reef.\nUsing this method, the mother colonies are unaffected. This method has also been proved effective on Red Sea soft coral species, Alcyonarians: Clavularia hamra, Nephthea sp. and Litophyton arboreum.\nTank cultivation\nLinden describes an apparatus made of Petri dishes lined with preconditioned Mailer's paper disks on which the planula of Stylophora pistillata are grown. One-month-old survivors were transferred onto plastic pins in a mid-water coral nursery, where the trays were covered with fitted plastic nets to prevent predation and detachment. After four months, more than 89% of the corals had survived.\nOcean cultivation\nNext, the corals are transported into floating nurseries in the sea. The corals float in the water column attached to a submerged structure. Some authors recommend 6 metres of depth to ensure the corals get the right amount of sunlight. They are affixed to an artificial substrate. This is usually made from string, wire, mesh, monofilament line or epoxy. The colonies remain there from 8 to 24 months to reach a size for transplantation back to the reef.\nReturn to the reef\nWhen the corals are big enough to be transplanted into the reef, the transplantation stage involves securing the corals to plastic pegs or masonry anchors, or directly to the reef base with epoxy.\nFor commercial or exhibition supply\nFor commercial markets, the process is the same except that the ocean cultivation is extended until the colonies reach marketable size (about fist-sized) and the final step is replaced by extraction and packaging for sale.\nCoral Nurseries\nCoral nurseries are typically formed by taking pieces of coral and moving them to synthetically formed structures to form a coral reef basis. In this way, conservationists can manage which corals are in the reef depending on which can survive, and which are important to continue to propagate.\nThe National Oceanic and Atmospheric Administration (NOAA) produced a different coral nursery with engineering students, however, centered on saving whole colonies, which reports good results.\nMost coral nurseries are field-based or land-based, either situated in the water or on facilities on land. Pieces are usually taken from live corals through fragmentation to continue to grow as a new coral elsewhere. They are placed on structures such as trees and lines to space them out and stimulate growth.\nNurseries often produce better results and higher survival rates in the beginning stages of growth than loose corals. \"While in nurseries, fragments of two non-branching Pacific corals survived better than equivalent direct trans-plants, but this advantage dissipated when corals from the nursery were then placed on the reef alongside direct outplants.\"\nCase Studies\nLaughing Bird Caye, Belize\nLaughing Bird Caye in Belize is a basic example of coral nurseries in the field. Hurricanes and bleaching are big problems in the national park, so caretakers made it a priority. Corals were planted in areas with fewer stressors, and when big enough, were moved into the main reefs.\n82,879 corals have been out-planted to the park, with total coral cover increasing. However, funding remains an issue, and the work is time-consuming.\nGuadeloupe, France\nIn Guadeloupe, France, they produced a design centered on being able to moor ships due to the damage anchors could do to corals. \"After six years, 52% of local coral species had settled on the eco-moorings, even though the total surface of the 40 mooring blocks only covered 300 m² in the bay.\"\nOkinawa, Japan\nThe prefecture of Okinawa in Japan focused on seed production for their nurseries, along with the typical out-planting. These seeds were collected from other reefs through asexual reproduction. It was found that this way was not particularly cost-effective while still helping in said areas.\nDonor colonies have been used to expand the gene pool of the reefs in Okinawa when it comes to out-planting. Currently, while the efficacy of the projects is in doubt, there is a lot of public support.\nGreat Barrier Reef, Australia\nThe Great Barrier Reef (GBR) is most likely the most famous and largest coral reef, and it is facing many of the same problems. In the related coral nurseries, the results can be highly variable depending on the types of coral and the conditions, but overall show the same or higher growth rates than the natural coral reefs. \"The initial nursery phase of coral propagation appears a useful means to supplement coral material naturally available for site stewardship of high value GBR tourism sites via out-planting programs, assuming nursery maintenance costs remain low.\"\nEconomy\nCoral aquaculture offers alternative livelihoods to people living near the reefs. This is especially important for communities where fishing or harvesting marine organisms have become unsustainable, such as in Indonesia. It is possible to use coral resources in a way that is environmentally friendly. Many coral reefs are in impoverished locations. Coral reef aquaculture requires only basic, cheap materials, making it possible for communities with limited resources. Some new methods, such as seeding of concrete tetrapods containing coral larvae, make it possible to reduce costs and outplanting time compared to previous approaches.\nHistory\nOne of the first serious attempts at propagating coral ex situ occurred at Nouméa Aquarium in 1956. At the time, it was common for aquarium hobbyists in Germany to create home \"mini-reefs\". Commercial coral propagation began in America in the 1960s, and the hobby industry took off in the early 1980s. The trend was attributed to hobby magazines.\nIn 2009, the US government awarded $3.3 million for a project to cultivate 5,000 colonies of Acropora. Researchers claimed that transplanting 35 colonies per year would restore coral populations to 1970s levels in 10 years.\nResearch and development\nCoral aquaculture provides insights into coral life histories. Petersen showed that early sexual recruits grow larger when fed the nauplii of brine shrimp. This discovery could shorten the fragile post-settlement time in the hatchery.\nThe Mote Marine Laboratory keeps many broodstock colonies at its Tropical Research Laboratory. The laboratory website reports that its colonies are grown from fragments rescued from boat groundings and environmental disturbances. The corals in the broodstock reserve provide fragments for restoration research. Studies are done to determine optimal size, shape and season for restoration.\nMarket\nIndonesia and the Philippines supply ~85% of coral reef products. Indonesia requires 10% of coral production to be transplanted into the ocean. As of 2012, a majority of coral imports to the US were wild-caught, although an increasing proportion were cultured. From 1990 to 2010, imports increased by some 8% annually. Imports declined thereafter in the wake of the Great Recession and from increasing domestic production. Commercial trade in stony and reef-building corals is regulated by the Convention on International Trade in Endangered Species (CITES). In Indonesia, most production is located around airports to speed the shipping process.\nSee also\n* Artificial reef\n* Biorock\n* Coral reef protection\n* The Reef Ball Foundation\n* Wave of Change\nReferences\nExternal links\n*"
    }
  ]
}