{
  "content": [
    {
      "type": "text",
      "text": "# Aquaculture in China__disambig_1\n\ncoastline.\n|coastline =\n|EEZ area  =\n|continental shelf =\n|lake area  =  (incl reservoirs)\n|river area =\n|land area  =\n|employment = 7.9 million persons (2004)\n|fishing fleet =\n|landing sites =\n|consumption =  fish per capita (2003)\n|fisheries GDP =\n|export value  =\n|import value  =\n|Hide header       =\n|Header caption    =  (2004 unless otherwise stated)\n|wild marine          =\n|wild inland marine   =\n|wild distance marine =\n|wild inland          =\n|wild total           =\n|aquaculture inland   =\n|aquaculture marine   =\n|aquaculture total    =  (2005)\n|fish total           =  (2005)\n|wild aquatic plants  =\n|aquaculture aquatic plants =\n|aquatic plants total =\n|overall total =\n}}\nChina, with one-fifth of the world's population, accounts for two-thirds of the world's reported aquaculture production.\nAquaculture is the farming of fish and other aquatic life in enclosures, such as ponds, lakes and tanks, or cages in rivers and coastal waters. China's 2005 reported harvest was 32.4 million tonnes, more than 10 times that of the second-ranked nation, India, which reported 2.8 million tonnes.\nChina's 2005 reported catch of wild fish, caught in rivers, lakes, and the sea, was 17.1 million tonnes. This means that aquaculture accounts for nearly two-thirds of China's reported total output.\nThe principal aquaculture-producing regions are close to urban markets in the middle and lower Yangtze Valley and the Zhu Jiang Delta.\nEarly history\nAquaculture began about 3500 BC in China with the farming of the common carp. These carp were grown in ponds on silk farms, and were fed silkworm nymphs and faeces. Carp are native to China. They are good to eat, and they are easy to farm since they are prolific breeders, do not eat their young, and grow fast. The original idea that carp could be cultured most likely arose when they were washed into ponds and paddy fields during monsoons. This would lead naturally to the idea of stocking ponds.\nIn 475 BC, the Chinese politician Fan Li wrote the earliest known treatise on fish farming, Yang Yu Ching (Treatise on fish breeding). The original document is in the British Museum.\nwas the number one fish of aquaculture in antiquity, and today is still extensively cultured worldwide.]]\nDuring the Tang dynasty (618–907 AD), the farming of common carp was banned because the Chinese word for common carp (鯉) sounded like the emperor's family name, Li (李). Anything that sounded like the emperor's name could not be kept or killed. The ban had a productive outcome, because it resulted in the development of polyculture, growing multiple species in the same ponds. Different species feed on different foods and occupy different niches in the ponds. In this way, the Chinese were able to simultaneously breed four different species of carp, the mud carp, which are bottom feeders, silver carp and bighead carp, which are midwater feeders, and grass carp which are top feeders. Another development during the Tang dynasty was a fortunate genetic mutation of the domesticated carp, which led to the development of goldfish.\nFrom 1500 AD, methods of collecting carp fry from rivers and then rearing them in ponds were developed.\"\nRecent history\ns (Tegillarca granosa, 泥蚶) and Chinese razor clams (Sinonovacula constricta, 缢蛏) are the main species raised in the mudflats of the Anhai Bay, near Shuitou, Fujian.]]\nThe major carp species used traditionally in Chinese aquaculture are the black, grass, silver and bighead carp. In the 1950s, the Pearl River Fishery Research Institute of the Chinese Academy of Fishery Sciences (CAFS) made a technological breakthrough in the induced breeding of these carp, induced by injecting fish pituitary hormones.\nIn the past, fish culture in China has been a family business, with traditional techniques passed from generation to generation. However, in the late 1960s the Chinese government began a move to the modern induced breeding technologies, which has resulted in a rapid expansion of freshwater aquaculture in China.\nFrom 1978, China's economic policies moved from central planning towards a market economy, opening new markets for aquaculture products. The effect of this, together with further technological advances, has been to move Chinese aquaculture towards industrial scale levels of production. In the 1980s, many species other than carp, such as other species of fish, crustaceans, molluscs and seaweeds, were brought into production. Shrimp aquaculture significantly increased as a result of both state economic incentivizes (including tax breaks on imported fertilizer and equipment) as well as a global shrimp shortage following a 1987 virus that devastated shrimp farms in Taiwan.\nOverproduction of shrimp increased vulnerability of the shrimp aquaculture population to viruses, and in the Great Shrimp Disaster of 1993, the white spot virus wiped out almost all of China's black tiger shrimp aquaculture industry. By the early 2000s, shrimp aquaculture recovered thanks to a species switch to Pacific white shrimp.\nIn the late 1990s, CAFS scientists developed a new variant of the common carp called the Jian carp. This succulent fish grows rapidly and has a high feed conversion rate. Over 50% of the total aquaculture production of carp in China has now converted to Jian carp. By 2004, the induced breeding of carp had been so effective that the carp industry amounted to 46 percent of the total aquaculture output.\nFile:Porcelaine chinoise Guimet 261102.jpg|A common carp on a Ming porcelain pot, c. 1540 AD\nFile:Daye-pond-system-fishermen-0077.jpg|Fishing in a fish pond system at Daye Lake near Daye\nFile:Bohaiaqua mss 1979147 lrg.jpg|Coastal aquaculture installations by the Bohai Sea, 1979\nFile:Bohaiaqua l7 2000123 lrg.jpg|The same area in 2000\nStatistics\n, Zhejiang]]\nSince 2002, China has been the world largest exporter of fish and fish products. In 2005, exports, including aquatic plants, were valued at US$7.7 billion, with Japan, the United States and the Republic of Korea as the main markets. In 2005, China was sixth largest importer of fish and fish products in the world, with imports totalling US$4.0 billion.\nIn 2003, the global per capita consumption of fish was estimated at 16.5&nbsp;kg, with Chinese consumption, based on her reported returns, at 25.8&nbsp;kg.\nThe common carp is still the number one fish of aquaculture.  The annual tonnage of common carp, not to mention the other cyprinids, produced in China exceeds the weight of all other fish, such as trout and salmon, produced by aquaculture worldwide.\nSince the 1970s, the reform policies have resulted considerable development of China's aquaculture, both marine and inland. The total used for aquaculture went from 2.86 million hectares in 1979 to 5.68 million hectares in 1996. Over the same time span, production increased from 1.23 million tonnes to 15.31 million tonnes.\nIn 2005, worldwide aquaculture production including aquatic plants was worth US$78.4 billion. Of this, the Chinese production was worth US$39.8 billion. In the same year there were about 12 million fish farmers worldwide. Of these, China reported 4.5 million employed full-time in aquaculture.\n{| class=\"wikitable\" border=\"1\"\n| colspan=2 align=\"center\"| Top 10 species grown in China in 2005\n|-\n! Species\n! Tonnes\n|-\n| Japanese kelp\n| 4 314 000\n|-\n| Grass carp\n| 3 857 000\n|-\n| Pacific cupped oyster\n| 3 826 000\n|-\n| Silver carp\n| 3 525 000\n|-\n| [http://www.fao.org/fishery/culturedspecies/Ruditapes_philippinarum Japanese carpet shell]\n| 2 857 000\n|-\n| Common carp\n| 2 475 000\n|-\n| Wakame\n| 2 395 000\n|-\n| Bighead carp\n| 2 182 000\n|-\n| Crucian carp\n| 2 083 000\n|-\n| Yesso scallop\n| 1 036 000\n|}\n{| class=\"wikitable\" border=\"1\"\n! colspan=4| Production, area and yield:  2003\n|-\n!\n! Total production(tons)\n! Area used(ha)\n! Yield(kg/ha)\n|-\n| Overall total\n| align=\"right\"| 30,275,795\n| align=\"right\"| 7,103,648\n| align=\"right\"| 4,260\n|-\n| &nbsp;&nbsp;&nbsp;&nbsp;Marine culture\n| align=\"right\"| 12,533,061\n| align=\"right\"| 1,532,152\n| align=\"right\"| 8,180\n|-\n| &nbsp;&nbsp;&nbsp;&nbsp;Inland culture\n| align=\"right\"| 17,742,734\n| align=\"right\"| 5,571,496\n| align=\"right\"| 3,180\n|-\n| &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Pond\n| align=\"right\"| 12,515,093\n| align=\"right\"| 2,398,740\n| align=\"right\"| 5,220\n|-\n| &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Lake\n| align=\"right\"| 1,051,930\n| align=\"right\"| 936,262\n| align=\"right\"| 1,120\n|-\n| &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Reservoirs\n| align=\"right\"| 1,841,245\n| align=\"right\"| 1,660,027\n| align=\"right\"| 1,110\n|-\n| &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Rivers\n| align=\"right\"| 738,459\n| align=\"right\"| 382,170\n| align=\"right\"| 1,930\n|-\n| &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Rice paddies\n| align=\"right\"| 1,023,611\n| align=\"right\"| 1,558,042\n| align=\"right\"| 660\n|-\n| &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Other\n| align=\"right\"| 572,396\n| align=\"right\"| 194,297\n| align=\"right\"| 2,950\n|}\nInland aquaculture\nIn 1979, inland aquaculture occupied 237.8 million hectares and produced 813,000 tonnes. In 1996, they occupied 485.8 million hectares and produced 10.938 million tonnes. In that year, 17 provinces produced 100,000 tonnes from inland aquaculture.\nPond culture is the most common method of inland aquaculture (73.9% in 1996). These ponds  are mostly found around the Pearl River basin and along the Yangtze River. They cover seven provinces: Anhui, Guangdong, Hubei, Hunan, Jiangsu, Jiangxi and Shandong. The government has also supported developments in rural areas to get rid of poverty. The sector is significant from a nutrition point of view, because it brings seafood to areas inland away from the sea where consumption of seafood has traditionally been low. Even the arid Xinjiang produced 58,835  tons of fish in 2000, 85% of it from aquaculture.\nIn recent times, China has extended its skills in culturing pond system to open waters such as lakes, rivers, reservoirs and channels, by incorporating cages, nets and pens.\nFish farming in paddy fields is also developing. In 1996, paddy fish farming occupied 12.05 million hectares producing 376,800 tonnes. A further 16 million hectares of paddy fields are available for development.\nSpecies introduced from other parts of the world are also being farmed, such as rainbow trout, tilapia, paddle fish, toad catfish, silver salmon, river perch, roach and Collossoma brachypomum.\nBesides fish and crustaceans, turtles (primarily, the Chinese soft-shelled turtle Pelodiscus sinensis) have been extensively farmed as well since the 1980s and 1990s. Based on a 2002 survey of 684 turtle farms, researchers estimated that these farms had the total herd of more than 300 million animals; they sold over 128 million turtles each year, with the total weight of about 93,000 tons, worth around US$750 million. Since these data are based on less than half of all turtle farms registered with the appropriate regulating agencies (i.e., 684 out of 1,499), it was estimated that the overall herds and production amounts are at least twice as high.\nSince 1990s, research and experimentation have been conducted in China for remediation and utilization of alkali land via combined agriculture and aquaculture practices, with considerable success and experiences. Aquaculture technology of utilizing inland saline-alkali water for seafood production is becoming mature, covering wide-range of seafood species including shrimps, crabs, shellfish and fish such as sea bass and grouper.\nMarine aquaculture\noff High Island, Hong Kong]]\nUsing current culture technologies, much farmed cultivation of marine plants and animals can be applied within the 10 metre isobath in marine environments. There are about 1.33 million hectares of marine cultivable areas in China, including shallow seas, mudflats and bays. Before 1980, less than nine percent of these areas were cultivated, and species were mainly confined to kelp, laver (Porphyra) and mussels.\nBetween 1989 and 1996, areas of cultivated shallow sea were increased from 25,200 to 114,200 hectares, areas of mudflat from 266,800 to 533,100 hectares, and areas of bay from 131,300 to 174,800 hectares. The 1979 production was 415,900 tonnes on 117,000 hectares, and the 1996 production was 4.38 million tonnes on 822,000 hectares.\nSince the 1980s, the government has encouraged the introduction of different marine species, including the large shrimp or prawn Penaeus chinensis, as well as scallop, mussel, sea bream, abalone, grouper, tilapia and the mud mangrove crab Scylla serrata.\nIn 1989, production of farmed shrimp was 186,000 tonnes, and China was the largest producer in the world. In 1993 viral disease struck, and by 1996 production declined to 89,000 tonnes. This was attributed to inadequate management such as overfeeding and high stock densities.\nOver-reporting\nproduction establishment near Lüshun, Liaoning]]\nIn 2001, the fisheries scientists Reg Watson and Daniel Pauly expressed concerns in a letter to Nature that China was over-reporting its catch from wild fisheries in the 1990s. They said that made it appear that the global catch since 1988 was increasing annually by 300,000 tonnes, whereas it was really shrinking annually by 350,000 tonnes. Watson and Pauly suggested this may have been related to Chinese policies where state entities that monitored the economy were also tasked with increasing output. Also, until more recently, the promotion of Chinese officials was based on production increases from their own areas.\nChina disputed this claim. The official Xinhua News Agency quoted Yang Jian, director general of the Agriculture Ministry's Bureau of Fisheries, as saying that China's figures were \"basically correct\". However, the FAO accepted there were issues with the reliability of China's statistical returns, and for a period treated data from China, including the aquaculture data, apart from the rest of the world.\nSee also\n* Chinese Academy of Fishery Sciences\n* Fishing industry in China\nReferences\nFurther reading\n* Tapiador DD, Henderson HF, Delmendo MN and Tsutsui H (1979) [http://www.fao.org/docrep/005/AC862E/AC862E00.htm#TOCFIR/T168 Freshwater fisheries and aquaculture in China] FAO: Fisheries Technical Paper 168, Rome. .\n*  Weimin Miao W and Xinhua Yuan X (2007) [https://archive.today/20121216140806/http://www3.interscience.wiley.com/cgi-bin/summary/117355428/SUMMARY?CRETRY=1&SRETRY=0 \"The Carp Farming Industry in China - An Overview\"] In Leung P, Cheng-Sheng Lee C and O'Bryen PJ (Eds.) (2007) Species and System Selection for Sustainable Aquaculture Blackwell Publishing. .\n* Zhijie G, Yingliang X, Xiangguo Z, Yong W, Daobo A and Sugiyama S (2008) [ftp://ftp.fao.org/docrep/fao/010//i0111e/i0111e00.pdf Review of fishery information and data collection systems in China] FAO Fisheries Circular No. 1029, p.&nbsp;46. Rome. ."
    }
  ]
}