{
  "content": [
    {
      "type": "text",
      "text": "# Aquaculture of catfish\n\nCatfish are easy to farm in warm climates, leading to inexpensive and safe food at local grocers. Catfish raised in inland tanks or channels are considered safe for the environment, since their waste and disease should be contained and not spread to the wild.\nAsia\nIn Asia, many catfish species are important as food. Several airbreathing catfish (Claridae) and shark catfish (Pangasiidae) species are heavily cultured in Africa and Asia. Exports of one particular shark catfish species from Vietnam, Pangasius bocourti, has met with pressures from the U.S. catfish industry. In 2003, the United States Congress passed a law preventing the imported fish from being labeled as catfish. As a result, the Vietnamese exporters of this fish now label their products sold in the U.S. as \"basa fish\".\nUnited States\nIctalurids are cultivated in North America, especially in the Deep South, with Mississippi being the largest domestic catfish producer. Channel catfish (Ictalurus punctatus) supported a $450 million/yr aquaculture industry in 2003.\nThe US farm-raised catfish industry began in the early 1960s in Kansas, Oklahoma and Arkansas.  Channel catfish quickly became the major catfish grown, as it was hardy and easily spawned in earthen ponds.  By the late 1960s, the industry moved into the Mississippi Delta as farmers struggled with sagging profits in cotton, rice and soybeans, especially on those farm areas where soils had a very high clay content.\nThe Mississippi Delta became the industry home for the catfish industry, as they had the soils, climate and shallow aquifers to provide water for the earthen ponds that grow  of catfish annually.  Catfish are fed a grain-based diet that includes soybean meal.  Fish are fed daily through the summer, at rates of 1–6% of body weight with pelleted floating feed.  Catfish need about two pounds of feed to produce one pound of live weight.  Mississippi is home to  of catfish ponds, the largest of any state.  Other states important in growing catfish include Alabama, Arkansas and Louisiana.\nAquarium\nThere is a large and growing ornamental fish trade, with hundreds of species of catfish, such as Corydoras and armored suckermouth catfish (often called plecos), being a popular component of many aquaria. Other catfish commonly found in the aquarium trade are banjo catfish, talking catfish, and long-whiskered catfish.\nSee also\n* John Halver\n* List of harvested aquatic animals by weight\nNotes"
    }
  ]
}