{
  "content": [
    {
      "type": "text",
      "text": "# Aquaculture of tilapia\n\n| image3 = Tilapia countries time series.png\n| alt3 =\n| caption3 = Aquaculture production of tilapia by countryin million tonnes as reported by the FAO, 1950–2009\n}}\nTilapia has become the third most important fish in aquaculture after carp and salmon; worldwide production exceeded  in 2002 and increases annually. Because of their high protein content, large size, rapid growth (6 to 7 months to grow to harvest size), and palatability, a number of coptodonine and oreochromine cichlids—specifically, various species of Coptodon, Oreochromis, and Sarotherodon—are the focus of major aquaculture efforts.\nTilapia fisheries originated in Africa and the Levant. The accidental and deliberate introductions of tilapia into South and Southeast Asian freshwater lakes have inspired outdoor aquaculture projects in various countries with tropical climates, including Honduras, Papua New Guinea, the Philippines, and Indonesia. Tilapia farm projects in these countries have the highest potential to be \"green\" or environmentally friendly. In temperate zone localities, tilapia farmers typically need a costly energy source to maintain a tropical temperature range in their tanks. One relatively sustainable solution involves warming the tank water using waste heat from factories and power stations.\nTilapiines are among the easiest and most profitable fish to farm due to their omnivorous diet, mode of reproduction (the fry do not pass through a planktonic phase), tolerance of high stocking density, and rapid growth. In some regions the fish can be raised in rice fields at planting time and grow to edible size () when the rice is ready for harvest. Unlike salmon, which rely on high-protein feeds based on fish or meat, commercially important tilapiine species eat a vegetable or cereal-based diet.\nTilapia raised in inland tanks or channels are considered safe for the environment, since their waste and disease is contained and not spread to the wild. However, tilapiines have acquired notoriety as being among the most serious invasive species in many subtropical and tropical parts of the world. For example, blue tilapia (Oreochromis aureus) (itself commonly confused with another species often used in aquaculture, the Nile tilapia, O. niloticus), Mozambique tilapia (O. mossambicus), blackchin tilapia (Sarotherodon melanotheron), spotted tilapia (Pelmatolapia mariae), and redbelly tilapia (Coptodon zillii) have all become established in the southern United States, particularly in Florida and Texas.[http://nis.gsmfc.org/nis_alphabetic_list.php Non-Native Aquatic Species Summaries]\nCommercially grown tilapia are almost exclusively male. Being prolific breeders, female tilapia in the ponds or tanks will result in large populations of small fish. Whole tilapia can be processed into skinless, boneless (PBO) fillets: the yield is from 30% to 37%, depending on fillet size and final trim.\n__TOC__\nCommercial breeding of Nile tilapia\nAlthough farming of Tilapia has been going on for thousands of years, the breeding of Tilapia did not start until recently. The first breeding program started in 1988 in a collaboration between the international center for living aquatic resources (ICLARM or WorldFish) and Akvaforsk. The name of the project was GIFT, meaning genetically improved farmed tilapia. Four wild strains from Africa were crossed with four farmed strains from the Philippines. This strain is currently farmed in more than 87 countries in Asia, Africa and Latin America.\nThe GIFT strain is used in two selection programs, one of them being GenoMar, a subsidiary EW Group. In the past the absolute and only important trait when breeding tilapia was growth, being the only criteria for selection. Today more traits have been added into the selection criteria, like growth, fillet yield, robustness and specific disease resistance. Robustness is one of those traits that is becoming more important since it is the biggest problem with mortality on farms today. GenoMar has successfully had a growth increase of 7% per generation while fillet yield only improves with 0,3% per generation. The explanation for this is its low heritability together with the fact that the trait cannot be measured on live animals and therefore information of fillet yield is given from relatives instead.\nBreeding of Tilapia is done with the help of a pyramid scheme with multiplying generations. The goal with this is that a few high merit individuals can be passed down into billions of production fish at the farms. The generation interval today is down to only 6-9 months meaning that there can be more than one generation per year. Mass selection and pedigree-based selection are the most used methods today for genetic improvements of tilapias. The breeding program GenoMar has used marker-assisted selection since 2004 using microsatellites when doing parentage assignment has been done on Tilapia. Since 2019 genomic selection using single nucleotide polymorphic (SNP) has been used more widely.\nThe latest genome assembly is from 3 years ago, and can be seen from the name of the assembly that NMBU was also highly involved in the effort along with the University of Maryland. Nile tilapia have 22 pairs of chromosomes. 23 Linkage groups because of the sex chromosomes. About 1 billion base pairs in length, 3,010 contigs made 2,460 scaffolds which were placed at a chromosome level as the karyotype was already known. The reference genome also has the non-nuclear mitochondrial genome. With help from bioinformatics, the estimated number of genes is around 30 thousand. It can be browsed in ensembl or NCBI for example.\nThe essential technological foundation for genomic selection is not obtaining the pedigree but the genotypes of the animals. This is currently done by SNP chips, oligonucleotide arrays. They have to be specifically designed for a species and commonly that is done based after the whole genome sequence has been obtained. Only some parts of the WGS are of interest, namely those that exhibit variation. Dense markers are considered good enough to capture the gene content because they are in linkage disequilibrium with the genes that influence the phenotype, or as they are called QTL. There are three major SNP chips for Tilapia, which were announced in 2018, 2020 and then 2020 again. In RNA Seq, the RNA from cells of a tissue is extracted and they are sequenced in order to know what genes are being expressed and at what intensities. First, the extracted RNA is converted into cDNA and that cDNA library is sequenced using the same machines used in whole genome sequencing. The bioinformatics pipeline afterwards is different from WGS, though. Since the segments are shorter, alignment is not as difficult. Also, one is interested in the amount of transcription that is happening. In any case, RNA Seq provides valuable insight into the biology of a group of cells and the entire organism.\nIn the beginning, breeding programs focused mainly on growth traits. Nowadays, more traits are included in the breeding goal. The tendency is to have even more traits in the future. For example, disease resistance, reproductive traits, robustness, lower emissions, feed conversion ratio (sustainability traits). New technologies for high-throughput phenotyping, as in the concept of precision farming, mean that many novel traits might be included as well. There is already a tendency to have mergers and acquisitions, with a few companies buying smaller ones, just like it happened in the poultry industry. Also like the poultry industry, the exploitation of heterosis is a possibility that could be established in Tilapia breeding. This would mean more protection for the companies and attract more corporate enterprises. Because crossbreeding provides a biological lock mechanism. Gene editing is coming. Especially CRISPR-Cas9 can already be implemented and holds a lot of promise. We also expect for the production systems to become ever more intensive. This means fewer ponds, more cages and more RAS. Overall, the average fish density is going to increase.\nNutritional value\nTilapia from aquaculture contain especially high ratios of omega-6 to omega-3 fatty acids.\nAround the world\nApart from the very few species found in the Western Asia, such as the Middle Eastern mango tilapia, there are no tilapia cichlids native to Asia. However, species originally from Africa have been widely introduced and have become economically important as food fish in many countries. China, the Philippines, Taiwan, Indonesia, and Thailand are the leading suppliers, and these countries altogether produced about  of fish in 2001, constituting about 76% of the total aquaculture production of tilapia worldwide.\n{| class=\"wikitable sortable\"\n|-\n! colspan=3 |Production of farmed tilapia from the top 20 countries in 2017\n|-\n! Country\n! Tonnes\n! Notes\n|-\n| China\n| 1,188,480\n| In mainland China, tilapia is called () in Mandarin that is ultimately based on the Vietnamese word, cá rô phi.\n|-\n| Indonesia\n| 1,260,000\n| In Indonesia, tilapia are known as either mujair, referring to fish closer to the wild type coloration and conformation, or ikan nila, \"nila\" referring to the bright color of the common red hybrid. Tilapia were introduced to Indonesia in 1969 from Taiwan. Later, several species also introduced from Thailand (Nila Chitralada), Philippines (Nila GIFT) and Japan (Nila JICA). Tilapia has become popular with local fish farmers because they are easy to farm and grow fast. Major tilapia production areas are in West Java and North Sumatra. In 2006, Badan Pengkajian dan Penerapan Teknologi (Agency for the Assessment and Application of Technology) and Balai Besar Pengembangan Budidaya Air Tawar (Main Center for Freshwater Aquaculture Development – MCFAD), Indonesian government research, development and introduced a new species named \"genetically supermale Indonesian tilapia\" (GESIT). GESIT fish are genetically engineered to hatch eggs that will produce 98% - 100% male tilapia. Monosex culture (all male) is more productive and will benefit the farmers. Now, around 14 strains of ikan nila have been developed by contributions from research institutes including MCFAD.\n|-\n| Egypt\n| 967,301\n|\n|-\n| Brazil\n| 550,050\n|Tilapia production in Brazil increased 3 - 4 percent in 2022.\n|-\n| Philippines\n| 267,735\n| In the Philippines, several species of tilapia have been introduced into local waterways and are farmed for food. Tilapia fish pens are a common sight in almost all the major rivers and lakes in the country, including Laguna de Bay, Taal Lake, and Lake Buhi.\nLocally, tilapia are also known as \"pla-pla\". Tilapiine cichlids have many culinary uses, including fried, grilled, sinigang (a sour soup using tamarind, guava, calamansi or other natural ingredients as a base), paksiw (similar to sinigang, only it uses vinegar) and many more recipes.\nOn January 11, 2008, the Cagayan Bureau of Fisheries and Aquatic Resources (BFAR) stated that tilapia production grew and Cagayan Valley is now the Philippines' tilapia capital. Production grew 37.25 percent since 2003, with 14,000&nbsp;tonnes (MT) in 2007. The recent aquaculture congress found the growth of tilapia production was due to government interventions: provision of fast-growing species, accreditation of private hatcheries to ensure supply of quality fingerlings, establishment of demonstration farms, providing free fingerlings to newly constructed fishponds, and the dissemination of tilapia to Nueva Vizcaya (in Diadi town).\n|-\n| Vietnam\n| 235,311\n|-\n| Thailand\n| 203,696\n| The red hybrid is known in Thai language as  pla thapthim (), whereas the black and silver striped hybrid is known as pla nin (; lit. \"Nile fish\"). Both hybrids of tilapia O. niloticus are very popular in Thai cuisine.\nSome 300,000 farmers in Thailand raise species of tilapia. In March 2007, millions of caged tilapia in the Chao Phraya River died as a result of oxygen deprivation.\n|\n|-\n| Taiwan\n| 61,711\n| In Taiwan, tilapiine cichlids are also known as the \"South Pacific crucian carp\", and since their introduction, have spread across aquatic environments all over the island. Introduced in 1946, tilapiine cichlids made a considerable economic contribution, not only by providing the Taiwanese people with food, but also by allowing the island's fish farmers to break into key markets, such as Japan and the United States. Indeed, tilapiine cichlids have become an important farmed fish in Taiwan for both export and domestic consumption.\nThe Chinese name for the fish in Taiwan is wu-kuo (吳郭), and was created from the surnames of Wu Chen-hui (吳振輝) and Kuo Chi-chang (郭啟彰), who introduced the fish into Taiwan from Singapore. The Taiwan tilapia is a hybrid of Oreochromis mossambicus and O. niloticus niloticus.\n|-\n| Colombia\n| 63,450\n|\n|-\n| Myanmar\n| 33,755\n|\n|-\n| Malaysia\n| 32,526\n|\n|-\n| Ecuador\n| 23,050\n|\n|-\n| Uganda\n| 31,670\n|\n|-\n| Bangladesh\n| 24,823\n|\n|-\n| Costa Rica\n| 23,034\n|\n|-\n| Laos\n| 20,580\n|\n|-\n| Honduras\n| 16,455\n| In Spanish, tilapia are simply known as tilapia. Formal tilapia farming is relatively new to Honduras but the commercial export market is expanding rapidly. The first [https://archive.today/20130201231822/http://www.seafoodsource.com/newsarticledetail.aspx?id=4294999661 audit of a Honduran tilapia fishery] was conducted in 2010 and the facility was found to be compliant with international standards. Honduran aquafarmers are now exporting nearly 20 million pounds of the fish every year, leading tilapia to become viewed as a promising commodity for the developing nation. Joint efforts among community farm training centers, a nonprofit Honduran microfinance group, [https://web.archive.org/web/20140604162134/http://fehmisse.com/ FEHMISSE], and [https://web.archive.org/web/20120727101056/http://www.theodtc.com/ foreign investors] are assisting local entrepreneurs as they establish and maintain environmentally sound tilapia farms.\n|-\n| Nigeria\n| 11,989\n|\n|-\n| Zambia\n| 10,208\n|\n|-\n| United States\n| 9,979\n| The geographic range for tilapia culture is limited by their temperature-sensitivity. For optimal growth, the ideal water temperature range is , and growth is reduced greatly below . Death occurs below . Therefore, only the southernmost states are suitable for tilapia production. In the southern region, tilapia can be held in cages from five to 12 months per year, depending on location.  About 1.5 million tons of tilapia were consumed in the US in 2005, with 2.5 million tons projected by 2010.\n|-\n| Other countries\n| 79,335\n|\n|-\n| TOTAL PRODUCTION\n| 3,497,391\n|\n|}\nOther countries\nIndia\nThe FAO has not recorded any production of farmed tilapia by India. Rajiv Gandhi Centre for Aquaculture (RGCA), the R&D arm of Marine Products Export Development Authority, has established a facility in Vijayawada to produce mono-sex tilapia in two strains. This project involves the establishment of a satellite nucleus for the GIFT strain of tilapia in India, the design and conduct of a genetic improvement program for this strain, the development of dissemination strategies, and the enhancement of local capacity in the areas of selective breeding and genetics. The development and dissemination of a high yielding tilapia strain possessing desirable production characteristics is expected to bring about notable economic benefits for the country. Farming of Tilapia is not permitted in the country on commercial basis. The Rajiv Gandhi Center for Aquaculture (RGCA) has expressed interest in obtaining the Genetically Improved Farmed Tilapia (GIFT strain) for aquaculture development in the country. The GIFT tilapia strain, selectively bred in Malaysia and the Philippines, has achieved an improvement of more than 10 per cent per generation in growth rate and has been widely distributed to several Asian countries and to Latin America (Brazil). However, rather than passively importing the improved genetic stock, the Center is interested in running a formal breeding program (fully pedigreed population) similar to the one that has been carried out for the GIFT strain in Malaysia.\nThe aim is to produce fast-growing high yielding tilapia strains adapted to a wide range of local farming environments that can be grown at as low a cost as possible.\nThe project involves several steps. The first is the establishment of a new nucleus of the GIFT strain at the RGCA and the design of a formal breeding program to further improve its genetic performance within the local environment. This will involve enhancing the capacity of local personnel in selective breeding, genetic improvement, statistical analysis and hatchery management through specialized training courses.\nOnce a high performing tilapia strain (or strains) has been developed, the establishment of satellite hatcheries will increase the availability and decrease the costs of seed stock. These public and private hatcheries will act as multipliers for the superior genetics developed at RGCA and the sites for dissemination of quality broodstock to fish farmers.\nAlthough the ultimate target groups of this project are fish farmers and small householders, a wider range of beneficiaries is expected, including commercial producers, scientists and the end consumers. The RGCA will gain experience and knowledge on the development of genetic improvement programs for economically important traits and other aspects of modern quantitative genetics. This experience and the development of a standard selective breeding protocol will allow for genetic improvement programs for other aquaculture species that are commonly cultured in India. Hatchery managers, producers and farmers will also improve their capacity to implement on-farm selective breeding programs.\nIn the longer term the project is also expected to contribute to the development of a complete chain of production. This will require initial capital support for farmers, identification of alternative cheap plant-based feed, and diagnosis of diseases in hatcheries, as well as strategies for early growth management. Improvement in harvest technologies, including storage of product and transport facilities, is likely to improve as a consequence of this project.\nMalawi\nIn 2010 Malawi produced 2,997 tonnes of farmed tilapia. A few species of Oreochromis tilapia, popular known as 'chambo', are the most popular fish in Malawi. They are endemic to bodies of water in Malawi like Lake Malawi, Lake Malombe and the Shire River. Due to over fishing, the fish however is now on the threatened species list.  Malawi has fish farms that are dedicated to farming tilapia.\nFile:Rednilejf.JPG|National Tilapia Research and Development Program (NTRDP) – Red Nile Tilapia Aquaculture of tilapia  Nile tilapia Oreochromis niloticus\nFile:Rednile2jf.JPG|Red nile tilapia under the experiment (CLSU, Philippines.)\nFile:3rednilejf.JPG|Red nile tilapia for breeding\nFile:23rednilejf.JPG|The fingerlings in breeding tubes\nFile:44rednilejf.JPG|Water sprinklers for aeration of the fingerlings\nFile:Rednilejf22.JPG|Pond\nSee also\n* List of harvested aquatic animals by weight\n* Tilapia as exotic species\n* Tilapia (genus)\n*Hybrid tilapia\nNotes\nReferences\n* Lim C and Webster CD (eds.) (2006) [https://books.google.com/books?id=VzWuIvXHmY0C&q=%22Tilapia%3A+Biology%2C+Culture%2C+and+Nutrition%22 Tilapia: Biology, Culture, and Nutrition] Routledge. .\n* Parker R and Parker RO (2011) [https://books.google.com/books?id=hEaTGJS2c7kC&q=tilapia Aquaculture Science] Pages 123–128, Cengage Learning. .\n* Sayed, A.-F. M. (2006) [https://books.google.com/books?id=TrNMeuqdm5gC&q=%22Tilapia+Culture%22 Tilapia Culture] CABI. .\n* [https://web.archive.org/web/20060224225023/http://www.itis.usda.gov/servlet/SingleRpt/SingleRpt?search_topic=TSN&search_value=169809 Tilapia, ITIS Standard Report. (2004-05-11)]\n* [http://www.fao.org/3/a-y5728e.pdf Tilapias as alien aquatics in Asia and the Pacific: a review]  FAO report\n* [http://www.extension.iastate.edu/Publications/PM1352G.pdf Managing Iowa Fisheries: Tilapia Culture in Iowa]\n* [https://web.archive.org/web/20111003195638/http://www.gaianicaragua.org/Canonico%20et%20al%202005%20Aquatic%20Conservation.pdf The effects of introduced tilapias on native biodiversity]\n* [https://www.nytimes.com/2011/05/02/science/earth/02tilapia.html?_r=1Another Side of Tilapia, The Perfect Factory Fish]\n*Ram C Bhujel, (2000) A review of strategies for the management of Nile tilapia (Oreochromis niloticus) broodfish in seed production systems, especially hapa-based systems, Aquaculture, 181, Issues 1–2, pp. 37-59, ISSN 0044-8486, https://doi.org/10.1016/S0044-8486(99)00217-3.\n*K.A. Kabir, J.W. Schrama, J.A.J. Verreth, M.J. Phillips, M.C.J. Verdegem (2019) Effect of dietary protein to energy ratio on performance of nile tilapia and food web enhancement in semi-intensive pond aquaculture, Aquaculture, 499, pp. 235-242, ISSN 0044-8486, https://doi.org/10.1016/j.aquaculture.2018.09.038.\n*Ramji Kumar Bhandari, Masaru Nakamura, Tohru Kobayashi, Yoshitaka Nagahama (2006) Suppression of steroidogenic enzyme expression during androgen-induced sex reversal in Nile tilapia (Oreochromis niloticus), General and Comparative Endocrinology 145, Issue 1 pp. 20-24, ISSN 0016-6480, https://doi.org/10.1016/j.ygcen.2005.06.014.\n*World fish center, about us, referenced on (24.04.2022) from: https://www.worldfishcenter.org/about-us\n*Aquagen, Om Aquagen, references on (24.04.2022) from: https://aquagen.no/2017/03/01/ew-group-kjoper-genomar-genetics/\n*Benchmarks genetics, about, referenced on (24.04.2022) from:  https://bmkgenetics.com/products/spring-tilapia/\n*Regal springs, our history, referenced on (24.04.2022) from: https://regalsprings.com/our-story/\nExternal links\n* [http://ag.arizona.edu/azaqua/ata.html American Tilapia Association]\n*\n* [https://web.archive.org/web/20080416024052/http://www.actfr.jcu.edu.au/projects/JCUDEV_015467.html Tilapia project at Australian Centre for Tropical Freshwater Research], James Cook University\n* [https://web.archive.org/web/20080503091451/http://www.actfr.jcu.edu.au/Projects/Pestfish/Profile.htm Information on two tilapia pest species from the Australian Centre for Tropical Freshwater Research as PDF downloads]\n* [https://web.archive.org/web/20110218014215/http://www.fishfarmingbusiness.com/ Start Up & Success Tips For Tilapia Fish Farming Owners]\n* [https://web.archive.org/web/20131219005842/http://www.alphalapia.com/gallery Gallery of Earth Ponds and Cages Fish Farming]\n* [http://techref.massmind.org/techref/other/pond/tilapia/index.htm Tilapia Health, Diagnosis, and Treatment Advice]\n* [https://www.youtube.com/watch?v=9lEy2tW1Rzs&feature=watch_response_rev Aquaculture tilapia fish farm] YouTube.\n* http://www.thehindu.com/news/national/tamil-nadu/a-second-coming-for-tilapia-in-south-tamil-nadu/article9286888.ece\n* https://tilapia.pro/"
    }
  ]
}