{
  "content": [
    {
      "type": "text",
      "text": "# ARA King (P-21)\n\n{|\n|Ship name=King\n|Ship namesake= Juan King, Argentine naval officer in the Cisplatine War.\n|Ship ordered=\n|Ship builder= AFNE Rio Santiago, Argentina\n|Ship laid down=\n|Ship launched= 1943\n|Ship completed=\n|Ship acquired=\n|Ship commissioned=1946\n|Ship status=Active\n|Ship decommissioned=\n|Ship in service=\n|Ship out of service=\n|Ship struck=\n|Ship homeport=\n|Ship honours=\n|Ship fate=\n|Ship notes=\n}}\n|Ship displacement=1,030 tons\n|Ship length=\n|Ship beam=\n|Ship draft=\n|Ship propulsion=2-shaft, 2 × Werkspoor diesel engines, , 90 tons oil\n|Ship speed=\n|Ship range= at\n|Ship complement=130\n|Ship armament=*3 ×  L45 Bofors DP guns\n* 4 ×  Bofors AA guns\n|Ship armour=\n|Ship notes=\n}}\n|}\n'ARA King' is a World War II-era Argentine Navy warship, originally classified as minelayer and later as patrol ship. The vessel is named after Juan King, an Argentine naval officer that served in the Cisplatine War. It is the third Argentine naval ship with this name.\nDesign\nKing was as part of a program to build four minelayers during the Second World War. Two (Murature and King) were completed as patrol boats and the others (Piedrabuena and Azopardo) as antisubmarine frigates.\nHistory\nKing was launched in 1943 and commissioned in 1946.\nIn 1955, the ship took part of rising against Juan Domingo Perón's government known as Revolución Libertadora, when she acted as a floating battery defending the rebel naval base at Río Santiago.\nAfter the decommissioning of her sister  in 2014, King is the oldest still in service in the Argentine navy. She was overhauled from 2015 to 2018 and was still in service as of 2022.\nIn July 2023, the ship was involved in a collision with a floating bar on the Paraná River and a Naval Prefecture vessel. The damage was reported as minor.\nSee also\n* List of ships of the Argentine Navy\nReferences\nNotes\nBibliography\n*\nFurther reading\n*\n*\n* .\nExternal links\n* [http://www.histarmar.com.ar/Armada%20Argentina/ArmadaHoy/King.htm Patrol ship ARA “King” - Histarmar website (Historia y Arqueología Marítima – Patrullero ARA King)] (accessed 2015-12-24)\n* [https://web.archive.org/web/20131017132948/http://www.ara.mil.ar/pag.asp?idItem=288 Argentine Navy website - Patrulleros Clase \"MURATURE\"] (in Spanish - accessed 2013-10-31)"
    }
  ]
}