{
  "content": [
    {
      "type": "text",
      "text": "# Arakan League for Democracy__disambig_1\n\n}}}}\n| abbreviation = ALD\n| leader = Aye Tha Aung\n| founded = 27 September 19898 January 2017 (split from ANP)\n| split = Arakan National Party (2017)\n| dissolved =\n| headquarters = 373 Lower Pazundaung Road, Pazundaung Township, Yangon\n| membership =\n| membership_year =\n| ideology = Rakhine interests\n| national =\n| seats1_title = Seats in the Amyotha Hluttaw\n| seats1 = }}\n| seats2_title = Seats in the Pyithu Hluttaw\n| seats2 = }}\n| symbol =\n| flag =\n| colours =\n| colorcode =\n| country = Myanmar\n| website =\n| seats3 =\n| seats3_title = Seats in the Rakhine State Hluttaw\n}}\nThe Arakan League for Democracy (; abbreviated ALD) is a political party active in Rakhine State, Myanmar (Burma).\nHistory\nThe ALD was founded on 27 September 1989, in Yangon, and it was registered with the election commission on 2 October 1989. It contested 25 seats in the 1990 general elections, receiving the majority of the vote at the Rakhine State. Nationally it received 1.2% of the vote, winning 11 seats, making it the third-largest party. However, the ALD was banned by the military government on 6 March 1992.\nOn 6 April 2012, the ALD was allowed to be re-established as a political party by the Union Election Commission, as its application complied with the law and rules of the election commission. In November, members of the ALD claimed that they had been threatened by local authorities with the abolition of the party, due to an alleged recruitment membership fraud.\nOn 17 June 2013, The Rakhine Nationalities Development Party (RNDP) and the Arakan League for Democracy signed an agreement to merge under the name Arakan National Party (ANP). With the formation of the new party, the Arakan League for Democracy was officially dissolved on 6 March 2014.\nOn 8 January 2017, former leaders of the ALD announced that they were splitting from the ANP and were re-registering with the Union Election Commission for the 2020 elections, citing internal issues and RNDP dominance in the ANP as the reasons for the split. As of 5 October 2017, five members of parliament — four state Hluttaw members and one Amyotha Hluttaw member — have resigned from the Arakan National Party and joined the re-registered Arakan League for Democracy.\nReferences"
    }
  ]
}