{
  "content": [
    {
      "type": "text",
      "text": "# Arcadia Park (Warsaw)\n\n| created                  = 1970}}\nThe Arcadia Park is an urban park in Warsaw, Poland. It is located in the district of Mokotów between Puławska Street, Żywnego Street, Piaseczyńska Street, Idzikowskiego Street, and around the gardens of Królikarnia Palace. It was opened in 1970.\nHistory\nprint from 1879, depicting Królikarnia palace and Królikarnia Pond.]]\nIn 1680, within the current area of the park, nobleperson and politician Stanisław Herakliusz Lubomirski, built his palace residence, which he had called Arkadia (Arcadia). It was designed by architect Tylman van Gameren. Around the residence were built gardens. Neither structure survives to the present day. In 1720, the area was bought by Augustus III of Poland, monarch of the Polish–Lithuanian Commonwealth. He had bought it due to its natural water springs, which were planned to be used to feed the water features of the Royal Baths Park complex. In 1786, nearby the area, was built Królikarnia palace, owned by Carlo Alessandro Tomatis, husband of Caterina Gattai Tomatis.\nThe urban park was designed by Longin Majdecki, and created between 1968 and 1970. It was built next to Królikarnia palace.\nCharacteristics and design\npond, in 2021.]]\nThe urban park is located between Puławska Street, Żywnego Street, Piaseczyńska Street, Idzikowskiego Street, and around the gardens of Królikarnia palace. It is located in the city of Warsaw, Poland, in the district of Mokotów, within the City Information System areas of Ksawerów, Sielce, and Wierzbno.\nThe park is divided in half by the Warsaw Escarpment. The portion to the west located at its peak, is known as Upper Arcadia (Polish: Arkadia Górna), while the portion below it, located to the east, is known as Lower Arcadia (Polish: Arkadia Dolna).\nThere are three ponds in the eastern portion. To the north, is located Arcadia pond, a man-made clay pit pond. From it flows Piaseczno Ditch, which discharges into the ponds in the Royal Baths Park, and into basin of the Czerniaków Port, in the Vistula River.\nThere are two ponds in the southern portion, to the east of Królikarnia palace: Królikarnia Pond (Polish: Staw pod Królikarnią) to the west, and an unnamed pond to the east. Together, they are known as Królikarnia Ponds (Polish: Stawy pod Królikarnią).\nThe gardens of Królikarnia Palace are attached to the south-western boundary of the park. The palace houses the Xawery Dunikowski Sculpture Museum.\nThe park has protected area status as the Arcadia Nature and Landscape Complex.\nGallery\nFile:Staw pod Krolikarnia 2021.jpg|Królikarnia Pond in 2021.\nFile:Krolikarnia unnamed pond Warsaw 2021.jpg|Unnamed pond in Arcadia Park, in 2021.\nFile:Row Piaseczynski Krolikarnia 2021.jpg|Piaseczno Ditch in Arcadia Park, in 2021.\nFile:Park Arkadia source Warsaw 2021.jpg|The underground spring which feeds the ponds in Arcadia Park, in 2021.\nNotes\nReferences\nExternal links\n*"
    }
  ]
}