{
  "content": [
    {
      "type": "text",
      "text": "# Archaeological Site in Wanggung-ri\n\n| location = Wanggung-ri, Iksan, South Korea\n| built = Estimated 7th century\n| designation1 = WHS\n| designation1_date = 2015\n| designation1_criteria = Cultural: (ii), (iii)\n| designation1_number = 1477-007\n| designation1_partof = Baekje Historic Areas\n| designation2 = Historic Sites of South Korea\n| designation2_offname = Archaeological Site in Wanggung-ri, Iksan\n| designation2_date = 17 September 1998\n| designation2_number = 408\n| mapframe = yes\n| mapframe-zoom = 13\n}}\nThe Archaeological Site in Wanggung-ri () refers to the remains of a Baekje-era palace and temple in Wanggung-ri, Wanggung-myeon, Iksan, South Korea. In 2015, it was made a UNESCO World Heritage Site, as part of the item Baekje Historic Areas. On 17 September 1998, it was made a Historic Site of South Korea.\nHistory\nThere are conflicting records of when the palace was built. It was either built during the reign of King Mu (r. 600–641, Korean calendar) or during the reign of King Wideok (r. 554–598). However, archaeological digs seem to support the former claim. It was used as a detached palace by the Baekje royal family, in order to offset the weak position of its main capital Sabi. It was arranged to match the organization of various other palaces in the Sinosphere. For example, it had royal residences in the south and the garden in the north. Various proportions in the palace match a 2:1 ratio. For example, its walls measured  to the east,  to the west,  to the south, and  to the north. By the late Baekje period, the complex became used more as a temple and less as a palace. The temple continued to be used even after the fall of Baekje.\nThe potential sites of 36 buildings have been identified. A large site for what is potentially the king's residence has been identified in the center of the complex; it has described as similar to a building in the Sabi royal palace. That site measure  from east to west and  from north to south. The building's rear gardens have also been identified. It was designed to be a miniature environment of the local biome. It had oddly-shaped rocks, river gravel, a stream, and a pond. The gardens of Baekje have been theorized to have influenced the gardens of Japan. Three large toilets have been identified at the site; they were among the earliest ancient toilets to be discovered in South Korea. Researchers were able to confirm that they were toilets because of the high concentration of parasite eggs in the remains of human feces found in the toilets.\nRestoration work was conducted at the site from 1965 to 1966. The site has been excavated a number of times since 1976. Around two-thirds of its total area have been excavated; the remaining third is expected to be excavated in the future.\nOf the site's remains, one of the most intact is the , a National Treasure of South Korea.\nGallery\nFile:왕궁리.jpg|Further view of the site (2019)\nFile:왕궁리 오층석탑.jpg| (2012)\nReferences\nExternal links\n*\n* [http://www1.baekje-heritage.or.kr/html/en/historic/historic_010401.html Baekje World Heritage Center page] (in English)\n* [https://english.visitkorea.or.kr/svc/contents/contentsView.do?vcontsId=73417 VisitKorea.or.kr site] (in English)"
    }
  ]
}