{
  "content": [
    {
      "type": "text",
      "text": "# Archaeological Museum of Korçë\n\n|established   =\n|dissolved     =\n|location      = Korça County,\n|type          = Archaeological museum.\n|visitors      =\n|director      = Dorian Kallanxhi\n|curator       =\n|publictransit =\n|website       =\n}}\nNational Archaeological Museum of Korçë () is an archaeological museum based in Korçë, Albania. It contains around 1200 artifacts, mainly from the Prehistoric period. It was established in 1985.\nHistory\nThe museum was established in 1985, and was reorganised and expanded in 1990. The museum is based in two traditional Korça houses, located at 19 Rruga Mihal Grameno, dating from 1870. In 2009 restoration work took place on parts of the roof of the building. However, the building and some of the exhibits were damaged by the 2019 Albania earthquake. In July 2024, further restoration work started on the museum building, reinforcing the foundations, restoring masonry and wooden beams, and restoring the roof in its entirety. This work is estimated to take 6 months. The building is listed as a Cultural Monument of Albania for its architectural value.\nCollection\nThe museum holds a total of approximately 1200 exhibits across a number of galleries. The exhibits come from archaeological sites close to Korçe, such as Kamenica Tumulus. The museum has items representing Neolithic (6000-2100BC) settlements including Podgori, Maliq, and Dunavec. In addition, there are items from Bronze Age (2100-1100BC) settlements including Sovjan, Barç, and Rehovë. Items from the Iron Age (1100-500BC) are also included. Items on display include examples of pottery, jewellery, sculptures and burials from across the periods covered. Of particular interest is the skeleton of a pregnant Illyrian woman, found at the burial site at Kamenica Tumulus. The site contained around 400 burials.\nSee also\n*Museum of Archaeology in Tirana (Albania)\n*Durrës Archaeological Museum\n*Museum of Apollonia\nReferences"
    }
  ]
}