{
  "content": [
    {
      "type": "text",
      "text": "# Archaeology Awards\n\nThe Archaeology Awards is an annual awards ceremony celebrating achievements in the field of archaeology.\nSummary\nThe Archaeology Awards was founded by the British magazine Current Archaeology, with the first ceremony hosted by Francis Pryor, and attended by leading figures from the archaeology world, taking place in Cardiff, 2009.  The ceremony itself was incorporated into the Archaeology Festival held at Cardiff University, with speakers including television broadcaster and historian, Bettany Hughes, who lectured on Helen of Troy.  The awards were supported by English Heritage, and the Royal Archaeological Institute.\nThe first ever ceremony saw a generally positive reaction from the British archaeological community, including David Connelly of the British Archaeological Jobs Resource and Bryan Ward-Perkins of Oxford University. It was also reported in the press of many counties with nominated projects.  As one article noted, 'Conesby moat... was shortlisted for a prestigious award with Current Archaeology...  As part of their Archaeology Festival 2009 in Cardiff, the first-ever Current Archaeology Awards took place, with Conesby moat just one of five finalists in its category.'\nThe main prizes are awarded in the following five categories: The Jeffrey May Award (for best new article by a new writer for Current Archaeology or Current World Archaeology); Book of the Year; Research Project of the Year; Rescue Dig of the Year; and Archaeologist of the Year.\nThe Jeffrey May Award is named in honour of the late head of archaeology at the University of Nottingham and major contributor to Current Archaeology, 'who oversaw a decade's work at Dragonby in Lincolnshire'.  His obituary in The Times notes that 'He followed the principle that the aim of archaeology was not to solve problems for one’s own satisfaction or to impress colleagues, but to provide accurate information about the past for the enlightenment of all.'\nThe 2010 ceremony, brought in conjunction with the Portable Antiquities Scheme, was hosted by Current World Archaeology columnist Brian Fagan of the University of California, with support from the Ermine Street Guard.  2010 also saw the scope broadened to incorporate awards from other major archaeological organisations, representing work from amateur to academic and professional endeavours.  This included the Awards for the Presentation of Heritage Research, sponsored by English Heritage, Historic Scotland, Cadw, the Royal Archaeology Institute and government bodies from both Northern Ireland and the Republic of Ireland.  Nominees for the 'Rescue Dig of the Year' included two Museum of London Archaeology (MOLA) projects: 'This Wooden O: Discovering Shakespeare’s First Theatre' and 'Water-power in Medieval Greenwich'.  The category was won by 'The Staffordshire Hoard'.\nThe 'Staffordshire Hoard' team's win was featured in an article by the Art Fund.  On accepting the prize, Dr Kevin Leahy stated: 'This was very much a joint award, to be shared by the many people and organisations who had worked hard on the project.'  As reported by the Birmingham News Room, Birmingham City Council Cabinet Member for Leisure, Culture and Sport, Cllr Martin Mullaney, 'congratulated the Staffordshire Hoard team after it scooped a top archaeology award'.\nThe 2011 ceremony was held at the British Museum, on Saturday 26 February.  In January 2011, it was reported by the York Press that local team 'On-Site Archaeology' had been nominated in the 'Rescue Dig of the Year' category.  Other nominees in the category included the 'Lanton Quarry' site, excavated by Archaeological Research Services LTD.  Nominees in the Book of the Year category included European Influence on Celtic Art by Lloyd Laing and The Planning of Roman Roads and Walls in Northern England by John Poulter.  The year's winners were voted for by readers and announced at the ceremony, as part of Archaeology Live 2011.  The annual conference was attended by noted figures from the international archaeology community, including Lisa Westcott, editor of Current Archaeology, Nick Ashton, Curator of Palaeolithic and Mesolithic, British Museum, and Dr Keith Robinson of the Sedgeford Aerodrome Project.\nThe ceremony was preceded by the Awards of the Presentation of Heritage Research, celebrating 'ground-breaking and innovative research from all aspects of heritage', held in the Stevenson Lecture Theatre the previous day.\nThe 2012 ceremony was held at Senate House (University of London), on Friday 2 March. The 'Research Project of the Year' category included a project in the Orkney for the second year running: other nominees in this category included 'Massacre at Fin Cop', which went on to win the category. Nominees in the 'Book of the Year' category included Celtic from the West by Barry Cunliffe and John Koch, and The Story of Silbury Hill by Jim Leary and David Field. Tony Wilmott, Mike Heyworth, and Martin Carver were nominated for Archaeologist of the year, with Tony Wilmott the eventual winner.\nThe winners of each category were voted for by members of the public, and were announced at the awards ceremony held during the Current Archaeology Live! 2012 conference, which was attended by many notable figures within the field of archaeology.  These included Dr Matthew Symonds, editor of Current Archaeology, Tony Wilmott, Senior Archaeologist at English Heritage, and Dr Mike Heyworth from the Council for British Archaeology.\nThe 2013 awards, held on Friday 1 March at Senate House, saw a record number of votes cast by the general public, almost reaching 12,000. Time Team's Phil Harding took the award for Archaeologist of the Year, seeing off competition from fellow nominees Bob Bewley of the Heritage Lottery Fund, and Gustav Milne of the Thames Discovery Programme. The excavation that discovered Richard III won the title of Research Project of the Year, with the award being collected by the project's lead archaeologist Richard Buckley.\nThe 2014 ceremony was held on Friday 28 February, at Senate House in London. The nominees in the Archaeologist of the Year category were Gill Hey of Oxford Archaeology, Alex Bayliss of English Heritage, and Richard Buckley of ULAS, who went on to win the award.\nThe winners of the 2015 awards were announced as part of the Current Archaeology Live! conference on Friday 27 February 2015, and were presented by TV personality and archaeologist Julian Richards.\nSpecial Award\nA special one-off additional award was added in 2017 to celebrate the 50 anniversary of the magazine, with the public voting LiDAR, as exemplified by the New Forest National Park Authority, as 'Archaeological Innovation of the Last 50 Years'.\nHonours List\n{| class=\"wikitable\"\n|-\n! Year !! Archaeologist of the Year !! Book of the Year !! Research Project of the Year !! Rescue Project of the Year !! The Jeffrey May Award\n|-\n|2024\n|Nick Card\n|Luc Amkreutz and Sasja van der Vaart-Verschoof (editors), Doggerland: lost world under the North Sea\n|The Ness of Brodgar: marking 20 years of Neolithic discoveries\n|The Knowe of Swandro: excavating eroding archaeology in Orkney\n|\n|-\n|2023\n|David Jacques\n|A. Brend, N. Card, J. Downes, M. Edmonds, and J. Moore, Landscapes Revealed: geophysical survey in the Heart of Neolithic Orkney World Heritage Area, 2002-2011\n|Prehistoric pioneers: how female migrants changed the face of Bronze Age Orkney\n|Archaeology adrift? A curious tale of Lego lost at sea\n|\n|-\n|2022\n|Raksha Dave\n|Melanie Giles, Bog Bodies: face-to-face with the past\n|Bridge over troubled water: Roman finds from the Tees at Piercebridge and beyond\n|Building a Roman Villa: a Romano-Celtic temple-mausoleum and evidence of industry at Priors Hall, Corby\n|\n|-\n|2021\n|Paula Reimer\n|Rebecca Wragg Sykes, Kindred: Neanderthal life, love, death, and art\n|The problem of the Picts: searching for a lost people in northern Scotland\n|A unique glimpse into the Iron Age: excavating Clachtoll Broch\n|\n|-\n| 2020|| Alison Sheridan || Alexander Smith, Martyn Allen, Tom Brindle, Michael Fulford, Lisa Lodwick, and Anna Rohnbogner, Life and death in the countryside of Roman Britain|| Life beside the lake: opening a new window on the Mesolithic at Star Carr || Roman writing on the wall: recording inscriptions at a Hadrian's Wall quarry ||\n|-\n| 2019|| Richard Osgood || Andy Burnham (ed), The Old Stones: a field guide to the megalithic sites of Britain and Ireland|| Prehistoric pop culture: deciphering the DNA of the Bell Beaker Complex || A landscape revealed: exploring 6,000 years of Cambridgeshire’s past along the A14 ||\n|-\n| 2018|| Hella Eckardt || Mark White (ed), Lost Landscapes of Palaeolithic Britain|| Blick Mead: exploring the ‘first place’ in the Stonehenge landscape|| An Iron Age chariot burial: excavating a square-barrow cemetery at Pocklington ||\n|-\n| 2017|| Mark Knight|| Paul Bahn, Images of the Ice Age|| Rethinking Durrington Walls: a long-lost monument revealed|| The Must Farm inferno: exploring an intact Late Bronze Age settlement ||\n|-\n| 2016|| Roberta Gilchrist|| Marion Dowd, The Archaeology of Caves in Ireland|| Recapturing Berkeley Castle: one trench, 1,500 years of English History|| The Drumclay crannog-dwellers: revealing 1,000 years of lakeside living ||\n|-\n| 2015|| Michael Fulford|| Paul Bahn (ed), The History of Archaeology|| Maryport's Mystery Monuments: investigating gigantic timber structures from the Imperial twilight|| First Impressions: discovering the earliest footprints in Europe ||\n|-\n| 2014|| Richard Buckley|| Julian Bowsher, ''Shakespeare's London Theatreland|| Return to Star Carr: Discovering the true size of a Mesolithic settlement|| Sands of Time: Domestic rituals at the Links of Noltland||\n|-\n| 2013|| Phil Harding|| Rebecca Jones, Roman Camps in Britain|| Richard III: the search for the last Plantagenet king|| Folkestone: Roman villa or Iron Age oppidum||\n|-\n| 2012|| Tony Wilmott|| Joe Flatman, Becoming an archaeologist: a guide to professional pathways''|| Massacre at Fin Cop|| Sea of Troubles: Scotland's eroding heritage||\n|-\n| 2011|| Sam Moorhead|| Julian Bowsher and Pat Miller, The Rose and the Globe|| The Ness of Brodgar|| The Frome Hoard|| Lynda Howard\n|-\n| 2010|| Mike Parker Pearson|| Barry Cunliffe, Europe Between The Oceans|| Bluestonehenge|| The Staffordshire Hoard|| Adam Daubney\n|-\n| 2009|| David Breeze|| Roger White, Britannia Prima|| South Shields: Rebuilding a Roman Fort || The Chiseldon Cauldrons|| Sue Beasley\n|}\nSee also\n* List of archaeology awards\n* List of history awards\nReferences\nExternal links\n*[http://www.archaeologyawards.org Official site]"
    }
  ]
}