{
  "content": [
    {
      "type": "text",
      "text": "# Archaeological Museum of Pella\n\n| image_upright   = 1.25\n| caption         = An exterior view\n| map_type        =\n| map_relief      = y\n| map_size        = 270\n| map_caption     = Map location\n| coordinates     =\n| established     = 2009\n| location        = Pella 580 05, Pella, Central Macedonia, Greece\n| type            = Archaeological\n| visitors        =\n| director        =\n| website         = [http://www.pella-museum.gr www.pella-museum.gr]\n}}\nThe Archaeological Museum of Pella () is a museum in Pella in the Pella regional unit of Central Macedonia. The building was designed by architect Kostas Skroumpellos and is on the site of the ancient city of Pella. It was completed in 2009 with the support of the Greece's Third Community Support Framework.\nIt is situated near the archaeological site of the ancient Macedonian palace. The building has a rectangular atrium, as a reference to the central peristyle courtyard of ancient houses in Pella.\nThe information section provides texts, photographs, maps, drawings a model of the archaeological site and a short video about Pella. In the entrance there are two important exhibits: A head considered a portrait of Alexander the Great and a statuette with the characteristic attributes of the god Pan.\nThe daily life of Pella is the first thematic group of the exhibition. The most important exhibits are the mosaic floors from the Houses of Dionysus, and of the Abduction of Helen from the House of the Wall Plasters. The excavation finds provide much information about daily life in ancient Pella (restoration of furniture and models, cloths, etc.)\nThe second thematic group is about public life in Pella. The finds come from excavations in the Agora and are related to the city's administration (coins, inscriptions, sculpture), the production and commerce (vases for transporting wines terracotta figurines, equipment from pottery).\nThe third thematic group consists of mosaics from Pella's sanctuaries (the sanctuaries of Darron, the Mother of Gods and Aphrodite, the Thesmophorion), and other findings as inscriptions, vases, metal objects.\nThe fourth thematic group is the findings from the city's cemeteries. There are burials from the Bronze Age, the Iron Age, Geometric and Archaic periods (9th-6th BC centuries), the Classical era (5th-4th BC centuries), and the Hellenistic period (3rd, 2nd BC centuries). The findings give information about the language of the residents (Doric Greek language), the funeral customs etc.\nThe last grouping is the palace gallery and presents information about the architectural form of the palace, and the life and personality of Alexander the Great.\nGallery\nFile:Stag hunt mosaic, Pella.jpg|The Stag Hunt Mosaic(c. 300 BC)\nFile:Macedonian Museums-40-Arx Pellas-169.jpg|Small food bowls from a cupboard in an ancient house (late 4th-early 1st BC century)\nFile:Macedonian Museums-40-Arx Pellas-171.jpg|Cremation mid 5th century. Storage vessel used as an um. Female terracotta figurine\nFile:Macedonian Museums-40-Arx Pellas-172.jpg|Elements of decoration of wooden burial couches and coffers\nFile:Macedonian Museums-40-Arx Pellas-173.jpg|Mould of a Satyr and figure from the mould in the form of an incense burner\nFile:Macedonian Museums-40-Arx Pellas-174.jpg|Rhyton in the form of phallus (drinking and libation vessel)\nFile:Bronze helmet, Portable excavation finds connected with everyday life, the world of men, Archaeological Museum, Pella (6919128998).jpg|Bronze helmet\nFile:Macedonian Museums-40-Arx Pellas-175.jpg|Detail from a mosaic 'Griffin attacking deer'\nFile:Pella Museum -- Mosaic 01.jpg|'Hunting a lion' mosaic\nFile:Macedonian Museums-40-Arx Pellas-176.jpg|Detail from the mosaic\nFile:Macedonian Museums-40-Arx Pellas-177.jpg|Decoration of the dining room wall in a house known as the house of the plasterworks\nFile:Finds from the rock-cut chamber tomb, Archaeological Museum, Pella (7076059367).jpg|Exhibits\nFile:+ 2009 wurde das Archäologische Museum in Pella eröffnet. 08.jpg|Dionysos mosaic\nFile:+ 2009 wurde das Archäologische Museum in Pella eröffnet. 02.jpg|Marble head of Alexander the Great (325-300 BC). Chance find from the area of Giannitsa.\nFile:+ 2009 wurde das Archäologische Museum in Pella eröffnet. 13.jpg|Poseidon bronze statuette\nFile:+ 2009 wurde das Archäologische Museum in Pella eröffnet. 28.jpg|Exhibits\nFile:+ 2009 wurde das Archäologische Museum in Pella eröffnet. 35.jpg|Terracotta figurine of Aphrodite removing her sandal. Votive offerings from the Sanctuary of the Mother of Gods and Aphrodite (late 4th-early 1st BC century)\nFile:+ 2009 wurde das Archäologische Museum in Pella eröffnet. 18.jpg|Gold mask\nFile:+ 2009 wurde das Archäologische Museum in Pella eröffnet. 11.jpg|Gold jewellery\nFile:+ 2009 wurde das Archäologische Museum in Pella eröffnet. 43.jpg|Grave goods\nFile:+ 2009 wurde das Archäologische Museum in Pella eröffnet. 39.jpg|Pottery\nFile:+ 2009 wurde das Archäologische Museum in Pella eröffnet. 29.jpg|Pottery arbor\nFile:+ 2009 wurde das Archäologische Museum in Pella eröffnet. 42.jpg|Weapons\nSources\n*\nExternal links\n*[http://www.pella-museum.gr Official website]\n*[https://web.archive.org/web/20121120155345/http://odysseus.culture.gr/h/1/eh155.jsp?obj_id=3460 Hellenic Ministry of Culture and Tourism]\n*[https://web.archive.org/web/20130411021508/http://www.latsis-foundation.org/megazine/publish/ebook.php?book=69&preloader=1 Archaeological Museum of Pella - Ebook by Latsis Foundation]"
    }
  ]
}