{
  "content": [
    {
      "type": "text",
      "text": "# Archdiocese of Southwark__disambig_1\n\n}}\n-->\n| area_km2          = 3,000\n| area_sqmi         =\n| area_footnotes    =\n| population        = 4,610,910\n| population_as_of  = 2017\n| catholics         = 367,530\n| catholics_percent = 8\n| parishes          = 179\n| churches          =\n| congregations     =\n| schools           =\n| members           =\n| denomination      = Catholic\n| sui_iuris_church  = Latin Church\n| rite              = Roman Rite\n| established       = 29 September 1850\n| cathedral         = St George's Cathedral, Southwark\n| cocathedral       =\n| patron            = Our Lady of The Immaculate Conception\nAugustine of Canterbury\nThomas Becket\n| patron_title      = Patron Saints\n| priests           = 274\n| pope              =\n| bishop            = John Wilson\n| bishop_title      = Archbishop\n| coadjutor         =\n| suffragans        =\n| auxiliary_bishops =\n| apostolic_admin   =\n| vicar_general     =\n| episcopal_vicar   =\n| judicial_vicar    =\n| archdeacons       =\n| emeritus_bishops  =\n| map               = Province of Southwark.png\n| map_size          =\n| map_alt           =\n| map_caption       = Dioceses of the Province of Southwark. The Archdiocese of Southwark is the easternmost\n| website           =\n| footnotes         =\n}}\nSt George's Cathedral, Southwark\nThe Archdiocese of Southwark () is a Latin Church archdiocese of the Catholic Church in England. It is led by the Archbishop of Southwark. The archdiocese is part of the Metropolitan Province of Southwark, which covers the South of England. The Southwark archdiocese also makes up part of the Catholic Association Pilgrimage.\nIts cathedral church is St George's Cathedral, Southwark.\nHistory\nSouthwark was one of the dioceses established at the restoration of Catholic hierarchical structures in 1850 by Pope Pius IX. When first erected, the diocese included Berkshire, Hampshire, and the Channel Islands in addition to Surrey, Kent and Sussex. Previous to this time, these five counties formed part of the London District, a district governed by a vicar Apostolic, to whom also was committed episcopal jurisdiction over North America and the Bahama Islands. In 1850, London was divided between the two new Dioceses of Westminster (north of the Thames) and Southwark (south of the Thames). At that time, London was a comparatively small city, which had previously been under the jurisdiction of a single bishop.\nThe first bishop of the new diocese of Southwark was Thomas Grant, vice-rector of the English College, Rome. He was consecrated on 6 July 1851. Grant was instrumental in obtaining some Sisters of Mercy from Bermondsey to serve as nurses in the military hospitals during the Crimean War. Grant was succeeded by his vicar-general, James Danell. In 1882, Robert Coffin, an associate of John Henry Newman and Provincial Superior of the Redemptorists in England and Ireland, was appointed bishop.  Former military chaplain John Butt, who served as bishop from 1885 to 1897, founded St John's Seminary, Wonersh. Francis Bourne was appointed Bishop of Southwark in 1897 and named Archbishop of Westminster in 1903.\nThe area that formed the diocese at its origin (29 September 1850) changed on 19 May 1882 when Southwark lost territory with the formation of the Diocese of Portsmouth. The Diocese of Southwark lost further territory when the Diocese of Arundel and Brighton separated on 28 May 1965; at the same time, the Ecclesiastical Province of Southwark was erected by Pope Paul VI, raising the Diocese to archdiocesan status.\nOriginal cathedral\nThe Papists Act of 1778 brought a certain limited freedom to those of the faith. Priests no longer moved in fear of imprisonment. Roman Catholics could run their own schools and could once more acquire property. In protest against the act, Lord George Gordon, on 2 June 1780, gathered a large crowd in St George's Fields to march on Westminster. Refused a hearing, they became violent and so began a week of burning, plundering and killing in which many Roman Catholic chapels and houses were destroyed. There is a legend that the high altar of the cathedral stands on the spot where the march began.\nIn 1786, there was only one Roman Catholic chapel in the whole of south London, located at Bermondsey. It was then that Thomas Walsh, a Douai priest, for £20 a year hired a room in Bandyleg Walk (near where the Southwark fire station now stands). Within two years, the numbers attending the little chapel had increased so rapidly that a new building became necessary. In 1793, a large chapel dedicated to Saint George was opened in the London Road at a cost of £2,000. It was designed by James Taylor of Weybridge, Surrey. According to tradition, it was here that the first High Mass was celebrated in London outside the chapels of ambassadors since the time of King James II of England. The occasion was the Solemn Requiem sung for the repose of the soul of Louis XVI, who was executed on 21 January 1793.\nThomas Doyle came to St George's in 1820, when the congregation stood at around 7,000. He became the first chaplain in 1829, when the Roman Catholic Relief Act 1829 removed nearly all the legal disabilities which Catholics had suffered for 250 years. The arrival of Irish immigrants in the area necessitated the construction of a larger house of worship. By 1839, enough money had been collected to make a start, and the present site in St George's Fields (then an open space) was purchased for £3,200.\nAugustus Pugin, the noted architect of the Gothic Revival, was commissioned to design the church. The foundation stone was laid on 26 May 1841 in a private ceremony held in the early morning so as not to arouse public unrest. Due to cost constraints, the left tower was never built. The stained glass was by William Wailes of Newcastle. The church was solemnly opened by Bishop Nicholas Wiseman (later Cardinal Wiseman) on 4 July 1848. To mark the occasion, Pope Pius IX sent a golden chalice and paten as a gift. Pugin was the first person to be married in the church on 10 August 1848 to his third wife Jane.\nWhen Pope Pius restored the English Roman Catholic hierarchy, St George's was chosen as the cathedral church of the new Roman Catholic Diocese of Southwark, which was to cover the whole of southern England. For the next half-century, until the opening of Westminster Cathedral, St George's was the centre of Roman Catholic life in London. In response to the hostile reaction of many of the British people to what was popularly characterized as \"papal aggression\" Bishop Nicholas Wiseman wrote \"Appeal to the Reason and Good Feeling of the English people on the subject of the Catholic Hierarchy\", a pamphlet of some thirty pages addressed to the people themselves, rather than to the educated minority, who in the writer's view, had so grossly and inexcusably misled them. Wiseman followed this with a series of lectures given at St. George's.\nThomas Grant was made the first Roman Catholic Bishop of Southwark; Doyle became the provost and administrator and remained so until his death on 6 June 1879. He is buried in the crypt. The new cathedral was consecrated by Bishop Butt on 7 November 1894, and on that day every year, the feast of the dedication of the cathedral is celebrated throughout the diocese.\nMinistries\nThe Archdiocese of Southwark Spirituality Commission identifies resources in the archdiocese and works to increase awareness and accessibility of them.\n\"The Archdiocese of Southwark Universities Chaplaincy Team works in collaboration with universities and their multi-faith chaplaincies in South London, Surrey and Kent. There are Catholic Chaplains at Kings College – Guy's Campus, Goldsmiths, London South Bank, Roehampton and Kingston Universities and at the University of Kent at Canterbury.\" Most of the university chaplaincies work independently providing events for their Catholic community. Throughout the year, however, there are times when the Catholic Chaplaincy Team work together to either arrange or take part in events that are open to students and staff from across the different chaplaincies.\nEducation\nThe archdiocese is the foundation responsible for over 170 voluntary-aided and voluntary-controlled schools in the diocese and is the sponsor of two schools under the English academy program.\nBoundaries\nThe archdiocese covers the parts of London south of the Thames (boroughs of Bexley, Greenwich, Bromley, Croydon, Lewisham, Southwark, Lambeth, Wandsworth, Merton, Sutton, Kingston and the eastern half of Richmond) the county of Kent and the Medway Unitary Authority. The diocese is divided into three pastoral areas (south-west London, south-east London and Kent), each headed by an area bishop and 20 deaneries, each of which contains a number of parishes.\nBishops and archbishops\n* Thomas Grant (1851–1870)\n* James Danell (1871–1881)\n* Robert Coffin (1882–1885)\n* John Butt (1885–1897)\n* Francis Bourne (1897–1903), appointed Archbishop of Westminster (cardinal in 1911)\n* Peter Amigo (1904–1949); archbishop (personal title) in 1937\n* Cyril Cowderoy (1949–1976); see raised to archdiocese in 1965\n* Michael Bowen (1977–2003)\n* Kevin McDonald (2003–2009)\n* Peter Smith (2010–2019)\n* John Wilson (2019–present)\nCoadjutor bishop\n*Francis Bourne (1896–1897) – future cardinal\nAuxiliary bishops\n*John Butt (1884–1885)\n*William Brown (1924–1951)\n*Charles Henderson (1972–2001)\n*John Jukes (1980–1998)\n*Howard Tripp (1980–2004)\n*John Hine (2001–2016)\n*Paul Hendricks (2006–)\n*Patrick Lynch (2006–2020)\n*Paul Mason (2016–2018), appointed Bishop of Great Britain, Military\n*Philip Moger (2023–)\nOther priests of the diocese who became bishops\n*Michael Bowen (priest here, 1958–1965), appointed Coadjutor Bishop of Arundel and Brighton in 1970; later returned as archbishop\n*Joseph Butt, appointed auxiliary bishop of Westminster in 1911\n*John Cahill, appointed auxiliary bishop of Portsmouth in 1900\n*Alan Clark, appointed auxiliary bishop of Northampton in 1969\n*Maurice Couve de Murville (priest here, 1957–1965), appointed Archbishop of Birmingham in 1982\n*Arthur Doubleday, appointed Bishop of Brentwood in 1920\n*Michael Evans, appointed Bishop of East Anglia in 2003\n*Langton Fox, appointed auxiliary bishop of Menevia, Wales in 1965\n*William Heard, appointed dean of the Roman Rota in 1958 (cardinal in 1958, titular bishop in 1962)\n*Arthur Hinsley, appointed titular bishop in 1926; future Cardinal\n*William Keatinge, appointed Vicar Apostolic of Great Britain, Military in 1917\n*Richard Moth, appointed Bishop of Great Britain, Military in 2009\n*Peter Smith, appointed Bishop of East Anglia in 1995; later returned as archbishop\n*Bernard Wall, appointed Bishop of Brentwood in 1955\n*Francis Walmsley, appointed Bishop of Great Britain, Military in 1979\nSee also\n*Apostolic Nunciature to Great Britain\n*Roman Catholic Church\n* Catholic Church in England and Wales\n* List of Catholic churches in the United Kingdom\nReferences\nExternal links\n*[http://www.rcsouthwark.co.uk/ Roman Catholic Archdiocese of Southwark]\n*[http://www.rcsouthwark.co.uk/parlink.html Parishes of the diocese]\n*[http://www.southwark-rc-cathedral.org.uk/ St George's Roman Catholic Cathedral, Southwark]\n*[http://www.southwarkvocations.com/ Diocesan Vocations website]"
    }
  ]
}