{
  "content": [
    {
      "type": "text",
      "text": "# Arden Warner\n\n-->\n| birth_place       =\n| death_date        =\n| death_place       =\n| death_cause       =\n| resting_place     =\n| resting_place_coordinates =\n| other_names       =\n| siglum            =\n| pronounce         =\n| citizenship       = Barbados, US\n| nationality       =\n| fields            = Particle physics\n| workplaces        = Fermilab\n| patrons           =\n| education         = Wesley Hall Boys’ School and Combermere School\n| alma_mater        = City College of New York, within City University of New York, and Columbia University\n| thesis_title      =\n| thesis_url        =\n| thesis_year       =\n| doctoral_advisor  =\n| academic_advisors =\n| doctoral_students =\n| notable_students  =\n| known_for         = Invention of a novel oil-spill clearance technique\n| influences        =\n| influenced        =\n| awards            =\n| author_abbrev_bot =\n| author_abbrev_zoo =\n| spouse            =\n| partner           =\n| children          =\n| signature         =\n| signature_alt     =\n| website           =\n| footnotes         =\n}}\nArden Warner (born 1965 or 1964) is a Barbadian-American particle physicist and inventor, working at the Fermi National Accelerator Laboratory (Fermilab), notable for the creation of a novel environmentally positive, magnetism-based method for cleaning up oil spills, now being developed by Fermilab and a company led by Warner.\nEarly life and education\nArden Ayube Warner was born in Barbados, in Eagle Hall, a part of the capital, Bridgetown, in St Michael parish. He had a number of brothers and sisters. He attended school at Wesley Hall Boys’ School, King Street, and Combermere School, Waterford, Bridgetown. He was brought up by his mother, a shopkeeper, and after he completed school, they moved to the USA, where he secured a scholarship to City College of New York, within City University of New York, and later graduated with a degree in engineering and physics from Columbia University.\nHaving worked with some of the US's national laboratories, Warner interned at Brookhaven National Laboratory and the Stanford Linear Accelerator Center (SLAC), and won a fellowship to support his PhD studies.\nCareer\nParticle physics\nWarner secured employment in the Accelerator Division of the Fermi National Accelerator Laboratory (often known as Fermilab), Batavia, just outside Chicago, Illinois, where he had been working 26 years by early 2021.  He currently works on the Proton Improvement Plan II, one of Fermilab's major projects.\nWarner also works as a mentor for internees, and has been a member of the steering body at times since the early 1980s of Fermilab's inclusive Summer Internships in Science and Technology (SIST) program, the longest-running of the Department of Energy National Laboratory system's internship programs. As of 2021, he chairs this program.\nOil spill cleanup technology\nThe US Department of Energy sought input from the scientists of the national laboratories as it struggled to deal with the cleanup required after the Deepwater Horizon event. With his wife's encouragement, Warner devised and tested an approach involving magnetite and booms which, with Fermilab support, he patented. The technique has been described as especially environmentally friendly, as magnetite is naturally occurring, and can be largely captured and reused. It has been mentioned in a range of magazines, including Scientific American and Popular Science. Warner was a speaker at a TEDx conference in Naperville, near Chicago, in 2015.\nAs of 2019, the technology, which was elaborated as \"electromagnetic boom and MOP\", was being scaled up for commercial use by a company licensed by Fermilab and led by Warner.\nWarner's idea was an inspiration for Irish student scientist Fionn Ferreira in his invention of a method for cleaning microplastics from the oceans.\nSelected publications\n* Lead author for The design and implementation of the machine protection system for the Fermilab electron cooling facility, Warner et al., Fermilab, May 2009\n* Lead author for Machine Protection System Research and Development for the Fermilab PIP-II Proton Linac, Warner et al., Fermilab, October 2017\nRecognition\nWarner was one of 50 recipients of the Barbados Jubilee Honour in 2016.\nPersonal life\nWarner is married. He is a member of the board of a Barbadian youth development NGO, The Millennium Fund.\nReferences"
    }
  ]
}