{
  "content": [
    {
      "type": "text",
      "text": "# Ardencroft, Delaware\n\n| subdivision_type1  = State\n| subdivision_name1  =\n| subdivision_type2  = County\n| subdivision_name2  = New Castle\n| government_footnotes =\n| government_type    =\n| leader_title       =\n| leader_name        =\n| leader_title1      =\n| leader_name1       =\n| established_title  = Established\n| established_date   = 1950\n| area_footnotes     =\n| unit_pref          = Imperial\n| area_magnitude     =\n| area_total_km2     = 0.23\n| area_land_km2      = 0.23\n| area_water_km2     = 0.00\n| area_total_sq_mi   = 0.09\n| area_land_sq_mi    = 0.09\n| area_water_sq_mi   = 0.00\n| population_as_of   = 2020\n| population_footnotes =\n| population_total   = 226\n| population_density_km2 = 982.37\n| population_density_sq_mi = 2539.33\n| timezone           = Eastern (EST)\n| utc_offset         = -5\n| timezone_DST       = EDT\n| utc_offset_DST     = -4\n| elevation_footnotes =\n| elevation_ft       = 279\n| coordinates        =\n| postal_code_type   =\n| postal_code        =\n| area_code          = 302\n| blank_name         = FIPS code\n| blank_info         = 10-01530\n| blank1_name        = GNIS feature ID\n| blank1_info        = 217491\n| website            =\n| footnotes          =\n| pop_est_as_of      =\n| pop_est_footnotes  =\n| population_est     =\n}}\nArdencroft is a village in New Castle County, Delaware, United States. According to the 2020 census, the population of the village is 226.\nThe village was founded in 1950 as an outgrowth of Arden and Ardentown with a conceptual lifestyle based on Henry George's single tax movement and William Morris's arts and crafts principles.  The last of seventeen land trusts founded between 1894 and 1950, Ardencroft's tax structure is based on the single tax economic philosophy of Henry George. As a result, a person's house is not taxed, only the land it sits on, which is owned by a charitable trust and managed by three directors. Half the land is woods and open space. Footpaths criss-cross the village.  At its founding in 1950, Ardencroft formally encouraged minorities to settle there, seeking families that wanted to live in an integrated setting.  The nearby, former Arden School (now the Buzz Ware Village Center) also allowed integration around this time, prior to many of the changes enacted by the Civil Rights Movement.\nCivil rights and suffragist activist, prolific writer, pilot, librarian, lecturer, and educator Pauline A. Young (1900 to 1991) moved into Ardencroft around this time.  The outspoken Young was famous for having joined the NAACP in 1912 at the age of 12, lectured and worked conferences with W. E. B. Du Bois in the 1930s, and in 1965 marched with Martin Luther King Jr. in Alabama.\nGeography\nArdencroft is located at  (39.8042795, –75.4913090).\nAs reported by the United States Census Bureau, the village has a total area of , all  land.\nInfrastructure\nTransportation\nNo state highways pass directly through Ardencroft. Delaware Route 3 runs southwest–northeast to the west of Ardencroft as Marsh Road, heading south toward Wilmington and north toward Delaware Route 92 west of Claymont. Harvey Road runs northwest–southeast along the northeast border of Ardencroft and leads southeast to a partial interchange with Interstate 95, which  has access to southbound I-95 toward Wilmington and access from northbound I-95 coming from Wilmington, and to U.S. Route 13 Business southwest of Claymont. DART First State provides bus service to Ardencroft along Route 11, which heads south via DE 3 and Washington Street to the Wilmington station serving Amtrak and SEPTA Regional Rail's Wilmington/Newark Line.\nUtilities\nDelmarva Power, a subsidiary of Exelon, provides electricity and natural gas to Ardencroft. Suez Delaware, a subsidiary of Suez North America, provides water to Ardencroft. Sewer service in Ardencroft is provided by New Castle County. Trash and recycling collection in Ardencroft is provided by Waste Management.\nGovernment\nArdencroft, along with Arden and Ardentown, uses the town meeting form of government.  These are the only three municipalities in the Mid-Atlantic States that use this form of government.\nEducation\nArdencroft is in the Brandywine School District.\nZoned schools are as follows: Forwood Elementary School, Talley Middle School, and Mount Pleasant High School.\nThe private K–8 school Wilmington Montessori School is partially in Ardencroft.Compare to:\nPreviously Ardencroft was in the Mount Pleasant School District.\nDemographics\n}}\nAs of the census of 2000, there were 267 people, 112 households, and 74 families residing in the village.  The population density was .  There were 115 housing units at an average density of .  The racial makeup of the village was 80.52% white, 12.36% African American, 5.99% Asian, and 1.12% from two or more races. Hispanic or Latino of any race were 0.75% of the population.\nThere were 112 households, out of which 23.2% had children under the age of 18 living with them, 56.3% were married couples living together, 8.0% had a female householder with no husband present, and 33.9% were non-families. 28.6% of all households were made up of individuals, and 8.0% had someone living alone who was 65 years of age or older.  The average household size was 2.38 and the average family size was 2.91.\nIn the village, the population was spread out, with 19.1% under the age of 18, 5.2% from 18 to 24, 26.6% from 25 to 44, 36.0% from 45 to 64, and 13.1% who were 65 years of age or older.  The median age was 44 years. For every 100 females, there were 92.1 males.  For every 100 females age 18 and over, there were 96.4 males.\nThe median income for a household in the village was $56,875, and the median income for a family was $73,125. Males had a median income of $47,708 versus $29,688 for females. The per capita income for the village was $30,480.  About 2.9% of families and 4.3% of the population were below the poverty line, including 7.0% of those under the age of eighteen and 7.7% of those 65 or over.\nReferences\nExternal links\n* [https://ardencroft.delaware.gov/ Official website]"
    }
  ]
}