{
  "content": [
    {
      "type": "text",
      "text": "# Arena (software)\n\n| operating system = Microsoft Windows\n| genre = Simulation software\n| website = [https://www.rockwellautomation.com/en-us/products/software/arena-simulation.html]\n}}\nArena is a discrete event simulation and automation software developed by Systems Modeling and acquired by Rockwell Automation in 2000. It uses the SIMAN processor and simulation language. As of 2020, it is in version 16. It has been suggested that Arena may join other Rockwell software packages under the \"FactoryTalk\" brand.\nIn Arena, the user builds an experiment model by placing modules (boxes of different shapes) that represent processes or logic. Connector lines are used to join these modules together and to specify the flow of entities. While modules have specific actions relative to entities, flow, and timing, the precise representation of each module and entity relative to real-life objects is subject to the modeler. Statistical data, such as cycle time and WIP (work in process) levels, can be recorded and made output as reports.\nArena can be integrated with Microsoft technologies. It includes Visual Basic for Applications so models can be further automated if specific algorithms are needed. It also supports importing Microsoft Visio flowcharts, as well as reading from or sending output to Excel spreadsheets and Access databases. Hosting ActiveX controls is also supported.\nUptake\nArena is used by companies engaged in simulating business processes. Some of these firms include General Motors, UPS, IBM, Nike, Xerox, Lufthansa, Ford Motor Company, and others.  It has been noted that creating a simulation can require more time at the beginning of a project, but quicker installations and product optimizations can reduce overall project time.  Arena can simulate diverse operation types, including call centers, for optimizing the use of agents and phone lines, the size and routing of pancake stacks in a food processing facility, and the design of a gold mine.\nCommercial software editions\n* Professional Edition – The flagship product. Systems, regardless of complexity, can be represented and custom performance metrics may be measured and tracked.\n* Standard Edition – This mid-tier package has the versatility to solve simulation problems encountered in an array of industries and systems. This edition includes Basic Process, Advanced Transfer, and Advanced Process Arena templates.\n* OptQuest (Add-On) – OptQuest provides simulation-based optimization functionality within Arena.\nAcademic software editions\n* Academic Lab Package – Academic version of the commercially available Enterprise Suite.  This is 30-or more seat license is for academic, non-commercial usage.  Universities that adopt the Simulation with Arena textbook are eligible for valuable offers and benefits.\n* Research Edition – This is the same edition as the Academic Lab Package, with this version for individual academic researchers.  The same academic guidelines are specified for observance.\n* Student Edition – Free edition intended for students currently learning the software is included for download and/or included with many simulation textbooks.  This version is perpetual, but limited in model size.  This version is intended for academic, non-commercial usage.  Universities that are using the software are eligible to make copies of the software to distribute to students for installation on their personal machines.\nFurther reading\nTextbooks using Arena\n* W. David Kelton, Randall P. Sadowski, Nancy B. Zupick, Simulation with Arena, 6th edition. (McGraw-Hill Professional, 2014).\n* Altiok, Tayfur and Benjamin Melamed.Simulation Modeling and Analysis with ARENA. Elsevier, Inc., 2007.\n* Rossetti, Manuel D. Simulation Modeling with Arena. John Wiley & Sons, Inc., 2010.\nSIMAN\n* Pegden, C.D., Introduction to SIMAN, Winter Simulation Conference 1983. https://informs-sim.org/wsc83papers/1983_0004.pdf\n* Sturrock, D.T., Pegden, C.D., Introduction to SIMAN, Proceedings Winter Simulation Conference, 1990. https://informs-sim.org/wsc90papers/1990_0019.pdf\n* C. Dennis Pegden, Robert E. Shannon, Randall P. Sadowski, Introduction to Simulation Using Siman, McGraw-Hill 1995\nSee also\n* List of computer simulation software\n* List of discrete event simulation software\n* Computer simulation\nReferences"
    }
  ]
}