{
  "content": [
    {
      "type": "text",
      "text": "# Ares in popular culture\n\n}}\nAres, the ancient Greek god of war, has been a recurring figure in popular culture, appearing in literature, film, television, video games, and comic books. Traditionally depicted as a powerful yet often controversial deity associated with chaos and bloodshed, Ares has been reinterpreted in various ways across different media. In modern storytelling, he is frequently portrayed as a formidable antagonist, embodying the destructive and ruthless aspects of warfare. The character of Ares continues to be adapted and reinterpreted, reflecting changing perspectives on war, power, and mythology in popular culture.\nTV and film\n* Ares appears in Disney's Hercules and its TV spinoff, voiced by Jay Thomas.\n* Ares is a regular character in the television series Xena: Warrior Princess, Hercules: The Legendary Journeys, and Young Hercules. Portrayed by Kevin Tod Smith (credited as Kevin Smith), he is depicted as Hercules' constant antagonist and a conflicted god who is torn between his passionate desire for Xena and his inherent desire to foster war and people's evil nature. After the fall of the Olympian Gods, Ares is rendered mortal, but with Xena's help, regains his godhood along with his sister Aphrodite after having a bite of Odin's golden apple. Despite this, he becomes an adversary for Xena again and in modern day as well.\n*Ares was portrayed by Daniel Sharman in the 2011 film Immortals. In the film, he, along with Athena (Isabel Lucas), Poseidon (Kellan Lutz), Apollo (Corey Sevier), and Heracles (Steve Byers), are warned by Zeus (Luke Evans) not to interfere in mortal affairs as gods unless the Titans are released. However, Ares ends up defying Zeus and directly intervenes to save Theseus (Henry Cavill) from Hyperion's men, after which he and Athena provide Theseus and his companions with horses in order to reach Mount Tartarus, where the Titans have been imprisoned. However, Zeus arrives and, in a fit of rage, kills Ares for disobeying him. Zeus then tells Theseus and his allies to let Ares' death be a warning to both the gods and them that they will receive no more help from the gods and he must justify the faith Zeus has in him alone.\n* In the short-lived television series Valentine, Ares, portrayed by Greg Ellis, was a businessman who went by the name Ari. Initially,the villain of the series, he indirectly threatened Kate, refused to give Grace a divorce, and had an antagonistic relationship with Ray. However, he had a positive, albeit awkward, relationship with his son, Danny. As the series progressed, Ari's relationship with Grace improved and he was tasked with finding a weapon for his father. However, in a battle against Bastet for the weapon, Ari dies after being fatally wounded.\n* Ares was portrayed by Edgar Ramirez in the Wrath of the Titans, sequel to Clash of the Titans.\n* Ares, based on the DC Comics character of the same name, is the main antagonist in the 2009 animated film Wonder Woman, voiced by Alfred Molina.\n* Ares, based on the DC Comics character of the same name, is the main antagonist in the DC Extended Universe film Wonder Woman, portrayed by David Thewlis.\n* Naga Ray/Hebitsukai Silver in Uchu Sentai Kyuranger is based on Ares.\n* Ares is one of the main antagonists in the Netflix series Blood of Zeus.\n* Ares is one of the main antagonists in the first season of the Disney+ series Percy Jackson and the Olympians. He is portrayed by Adam Copeland.\nBooks and comics\n*The \"Ares Program\", a fictional NASA program of scientific missions to Mars, appeared in the 2011 novel The Martian by Andy Weir.\n*The Planet Comics strip Mars God of War features a character based on Ares under his Roman alter ego Mars. This character is a villain who takes over people's bodies in various attempts to cause war.\n* A bat named Ares, who is a skilled combatant, is a main character in the book series The Underland Chronicles by Suzanne Collins.\n*In John C. Wright's Chronicles of Chaos, Ares is a major character, an influential faction to be appeased when dealing with the children.\n*Ares is a character in both DC Comics and Marvel Comics.\n*Ares is a side character in the webcomic Lore Olympus, making his first appearance in episode 82.\n*Ares is a major antagonist in the webcomic Athena Complex.\n* Ares is the name given to the second spaceship to land on the planet Mars, in Patrick Moore's science fiction novel Mission to Mars.\n* In the Percy Jackson & the Olympians book series, Ares is a major antagonist in the first novel, The Lightning Thief, and a supporting character in the rest of the series. He later reappears as Mars in the spin-off series, Heroes of Olympus, and is revealed to be the father of one of the main characters, Frank Zhang. In the feature film Percy Jackson & the Olympians: The Lightning Thief, he is portrayed by Ray Winstone.\n* In Issue 2 of Godzilla: Rage Across Time, Ares was a god on Olympus alongside the other gods. When Godzilla invaded Mt. Olympus, Ares attempts to attack Godzilla, but is killed after being vaporized by his atomic breath.\nVideo games\n*Ares is one of the gods who appear in the Zeus: Master of Olympus and its expansion pack, Poseidon: Master of Atlantis.\n*Ares is an eligible character in Age of Mythology when advancing to the Classical Age. Doing so by choosing Ares as patron god provides enhancements for infantry units, the power of pestilence, which prevents enemy buildings from producing units for a period of time, and the mythical cyclops units.\n*Ares is the final boss in Spartan: Total Warrior.\n*Ares is a prominent character in Santa Monica Studios' God of War franchise.\n**Ares is the main antagonist and final boss in the 2005 video game God of War, voiced by Steve Blum. In the game, Ares runs amok and attacks the city of Athens while challenging the other gods and searching for Pandora's Box to maximize his power; the gods enlist the aid of the Spartan Kratos, former protégé of Ares, who Ares tricked into slaying his family in the past. Since Zeus forbids the gods from fighting each other, Kratos searches for Pandora's Box, which gives him the power to rival a god, and takes Ares' position as \"God of War\" after slaying him.\n**Ares reappears in the sequel God of War II during a flashback. His remains are then seen in God of War III as one of Kratos' battles takes place over Ares' ice tomb.\n**Ares appears in a flashback in God of War: Ghost of Sparta, where it is shown that he kidnapped Kratos' brother Deimos because a prophecy foretold the demise of Olympus was to come by a marked warrior. Zeus and Ares believed the warrior to be Deimos because of his unusual birthmark, but the prophecy actually referred to Kratos, as he marked himself with a tattoo in the shape of his brother's birthmark to honor him.\n**Ares appears in God of War: Ascension, a prequel to the series, where it is revealed that he entered into an alliance with the Furies to overthrow Zeus and became Kratos' mentor so that Kratos would help him conquer Olympus. Ares also had a son, Orkos, with the Fury Queen Alecto; after Orkos was unable to meet his standards, Ares disowned him and chose to mentor Kratos instead.\n**Ares appears in ''Ascension's'' multiplayer mode as one of the four gods that players can pledge their allegiance to.\n**Ares is featured in the tie-in comic series (2010–11) where he entered into a wager with five other Olympian gods. Each god chose a champion to seek for the Ambrosia of Asclepius, an elixir with magical healing properties, with Ares' champion being Kratos (unbeknownst to Kratos).\n*Ares is a playable character in the multiplayer online battle arena Smite. He is a melee tank and is nicknamed \"the God of War\".\n*Ares is the main representation of the video game \"God of War\"\n*Ares is a playable fighter in Injustice: Gods Among Us.\n*Ares (アレス Aresu, Aless in the Japanese version) is a character from Fire Emblem: Genealogy of the Holy War. He is the son of Eldigan and Grahnye and inheritor of the Demon Sword Mystletainn.\n*Ares (アレス, Ἄρης) is a playable character in ''Koei Tecmo's Warriors Orochi 4. In the Warriors Orochi'' series, Ares follows his father to Orochi's dimensional realm. He wields the Typhon Spears and is arrogant and prideful, highly confident of his own strength and looking down on humans for their perceived weaknesses.\n*Ares appears in the 2020 video game Hades. He offers boons to aid Zagreus, son of Hades.\n*Ares appears in the mobile game Fate/Grand Order as an ally against the Crypters and Zeus in the second part of the fifth Lostbelt, the Atlantic Lostbelt, where it is revealed that the original twelve Greek Gods, including Ares, were actually spacefaring ships destroyed by Sefar 12,000 years ago.\n*Ares appears in the shooter game Fortnite: Battle Royale, added during Chapter 5: Season 2. In the area Brawler's Battleground, the player can challenge Ares to a fight; defeating him awards the player with a Medallion that makes its holder stronger and an assault rifle. Ares later became a playable character, available if the player spent money on the subscription service Fortnite crew during April 2024.\n*The Ares is a playable robot in the computer game War Robots, released as Walking War Robots in 2014, as a member of the 'pantheon' set, which also includes the Hades and Nemesis robots.\n*Ares is one of four gods in Immortals Fenyx Rising that are cursed by Typhon prior to the start of the game. He is turned into a cowardly chicken and Fenyx, the main character, must reunite him with his pride and wrath to undo the curse.\n*Ares Toraernos is the main protagonist in the Brandish series. He is depicted as a silent, stoic swordsman and bounty hunter who is pursued by his archrival, the sorceress Dela Delon, for killing her master, the mage Balcan. The second installment of the Brandish series, subtitled The Planet Buster, implies that \"Ares Toraernos\" is either the same entity as the Greek god or a human incarnation of him.\nMusic\n*English pop band Bloc Party recorded a song \"Ares\" on their third album, Intimacy.\n*Japanese pop artist Gackt has a song named Ares on his second solo album, Mars.\nScience\n*Ares is the name of NASA's transport ship replacing the Space Shuttle, an extension of NASA's uses of Saturn for crewed rockets, Mercury for satellite programs, and the Apollo program, rather than as any reflection of the intrinsic nature of the war god.\nSports\n* Greece has various sports clubs called Aris () (Άρης=Ares), most famously Aris Thessaloniki (). The club also has an image of the god Ares as its emblem.\nSee also\nReferences"
    }
  ]
}