{
  "content": [
    {
      "type": "text",
      "text": "# Argentine War of Independence__disambig_1\n\n)\n| place             = Argentina, Chile, Uruguay, Paraguay, and Bolivia\n| result            = Argentine victory\n* Emancipation from Spanish colonial rule\n* Independence of most of the Spanish America\n| combatant1        = Patriots United Provinces of the Río de la Plata ChileRepubliqueta\n| combatant2        = Royalists Spanish Monarchy Kingdom of Portugal\n| commander1        = Manuel BelgranoJosé de San MartínMartín Miguel de Güemes Juan José CastelliJosé Gervasio ArtigasWilliam BrownCarlos María de Alvear\n| commander2        = Bernardo de VelascoJosé Manuel de GoyenecheJoaquín de la PezuelaPedro Antonio Olañeta Santiago de Liniers Vicente Nieto\n}}\nThe Argentine War of Independence () was a secessionist civil war (until 1816)  fought from 1810 to 1818 by Argentine patriotic forces under Manuel Belgrano, Juan José Castelli, Martin Miguel de Guemes and José de San Martín against royalist forces loyal to the Spanish crown. On July 9, 1816, an assembly met in San Miguel de Tucumán, declaring independence with provisions for a national constitution.\nBackground\nThe territory of modern Argentina was part of the Spanish Viceroyalty of the Río de la Plata, with its capital city in Buenos Aires, seat of government of the Spanish viceroy. Modern Uruguay, Paraguay and Bolivia were also part of the viceroyalty, and began their push for autonomy during the conflict, becoming independent states afterwards. The vast area of the territory and slow communications led most populated areas to remain isolated from each other. The wealthiest regions of the viceroyalty were in Upper Peru (modern-day Bolivia). Salta and Córdoba had closer ties with Upper Peru than with Buenos Aires. Similarly, Mendoza in the west had closer ties with the Captaincy General of Chile, although the Andes mountain range was a natural barrier. Buenos Aires and Montevideo, who had a local rivalry, located in the La Plata Basin, had naval communications allowing them to be more in contact with European ideas and economic advances than the inland populations living in provinces such as Tierra del Fuego and Chaco. Paraguay was isolated from all other regions.\nIn the political structure most authoritative positions were filled by people designated by the Spanish monarchy, most of them Spanish people from Europe, also known as peninsulares, without a strong commitment  for South American problems or interests. This created a growing rivalry between the Criollos, white people born in Latin America, and the peninsulares, Spanish people who arrived from Europe (the term \"Criollo\" is usually translated to English as \"Creole\", despite being unrelated to most other Creole peoples). Although they were all considered Spanish, and there were no legal distinctions between Criollos and Peninsulares, most Criollos thought that Peninsulares had undue influence in political matters. The ideas of the American and French Revolutions, and the Age of Enlightenment, promoted desires of social change among the criollos. The full prohibition imposed by Spain to trade with other nations was also seen as damaging to the viceroyalty's economy.\nThe population of Buenos Aires was highly militarized during the British invasions of the Río de la Plata, part of the Anglo-Spanish War. Buenos Aires was captured in 1806, and then liberated by Santiago de Liniers with forces from Montevideo. Fearing a counter-attack, all the population of Buenos Aires capable of bearing arms was arranged in military bodies, including slaves. A new British attack in 1807 captured Montevideo, but was defeated in Buenos Aires, and forced to leave the viceroyalty. The viceroy Rafael de Sobremonte was successfully deposed by the criollos during the conflict, and the Regiment of Patricians became a highly influential force in local politics, even after the end of the British threat.\nThe transfer of the Portuguese Court to Brazil generated military concern. It was feared that the British would launch a third attack, this time allied with Portugal. However, no military conflict took place, as when the Peninsular War started Britain and Portugal became allies of Spain against France. When the Spanish king Ferdinand VII was captured, his sister Carlota Joaquina sought to rule in the Americas as regent, but nothing came out of it because of the lack of support from both the Spanish Americans and the British. Javier de Elío created a Junta in Montevideo and Martín de Álzaga sought to make a similar move by organizing a mutiny in Buenos Aires, but the local military forces intervened and thwarted it. Spain appointed a new viceroy, Baltasar Hidalgo de Cisneros, and Liniers handed the government to him without resistance, despite the proposals of the military to reject him.\nThe Revolution\nforced the viceroy to resign. He was replaced by a government Junta, the Primera Junta.]]\nThe military conflict in Spain worsened by 1810. The city of Seville had been invaded by French armies, which were already dominating most of the Iberian Peninsula. The Junta of Seville was disestablished, and several members fled to Cádiz, the last portion of Spain still resisting. They established a Council of Regency, prelude to the Cortes of Cadiz, with political tendencies closer to Liberalism and Popular sovereignty than the former Junta of Seville. This began the May Revolution in Buenos Aires, as soon as the news was known. Several citizens thought that Cisneros, appointed by the disestablished Junta, did not have the right to rule anymore, and requested the convening of an open cabildo to discuss the fate of the local government. The military gave their support to the request, forcing Cisneros to accept. The discussion ruled the removal of viceroy Cisneros and his replacement with a government junta, but the cabildo attempted to keep Cisneros in power by appointing him president of such junta. Further demonstrations ensued, and the Junta was forced to resign immediately. It was replaced by a new one, the Primera Junta.\nBuenos Aires requested the other cities in the viceroyalty to acknowledge the new Junta and send deputies. The precise purpose of these deputies, join the Junta or create a congress, was unclear at the time and generated political disputes later. The Junta was initially resisted by all the main locations around Buenos Aires: Córdoba, Montevideo, Paraguay and the Upper Peru. Santiago de Liniers came out of his retirement in Córdoba and organized an army to capture Buenos Aires, Montevideo had naval supremacy over the city, and Vicente Nieto organized the actions at the Upper Peru. Nieto proposed to José Fernando de Abascal y Sousa, viceroy of the Viceroyalty of Peru at the North, to annex the Upper Peru to it. He thought that the revolution could be easily contained in Buenos Aires, before launching a definitive attack.\nBuenos Aires was declared a rogue city by the Council of Regency, which appointed Montevideo as capital of the viceroyalty of the Río de la Plata, and Francisco Javier de Elío the new viceroy. However, the May Revolution was not initially separatist. Patriots supported the legitimacy of the Juntas in the Americas, while royalists supported instead the Council of Regency; both acted on behalf of Ferdinand VII. All of them believed that, according to the retroversion of the sovereignty to the people, in the absence of the rightful king sovereignty returned to the people, which would be capable to appoint their own leaders. They did not agree on who was that people, and which territorial extension had the sovereignty. Royalists thought that it applied to the people on European Spain, who had the right to rule over all the Spanish empire. The leaders of the May Revolution thought that it applied to all the capitals of Spanish kingdoms. José Gervasio Artigas would lead later a third perspective: the retroversion applied to all regions, which should remain united under a confederative system. The three groups battled one another, but the disputes about the national organization of Argentina (either centralist or confederal) continued in Argentine Civil War, for many years after the end of the war of independence.\nArmed conflict\nThe Primera Junta sent military campaigns to the viceroyalty, in order to secure support to the new authorities and retain the authority held as the capital of the viceroyalty. The victories and defeats of the military conflict delimited the areas of influence of the new United Provinces of the Río de la Plata. With the non-aggression pact arranged with Paraguay early on, most of the initial conflict took place in the north, in Upper Peru, and in the east, in the Banda Oriental. In the second half of the decade, with the capture of Montevideo and the stalemate in Upper Peru, the conflict moved to the west, to Chile.\nInitial campaigns\nThe first two military campaigns ordered by the revolutionary Junta in Buenos Aires were launched against Cordoba, where former Viceroy Santiago de Liniers organized a counter-revolution, and the Intendency of Paraguay, which did not recognize the outcome of events at the May Revolution.\nHowever, the improvised army gathered by Liniers at Cordoba deserted him before battle, so the former Viceroy attempted to flee to the Upper Peru, expecting to join the royalist army sent from the Viceroyalty of Peru to suffocate the revolution at Buenos Aires. Colonel Francisco Ortiz de Ocampo, who led the patriot army, captured Liniers and the other leaders of the Cordoba counter-revolution on 6 August 1810, but, instead of executing them as he was instructed, he sent them back to Buenos Aires as prisoners. As a result, Ocampo was demoted and Juan José Castelli was appointed as the political head of the army. On 26 August, Castelli executed the Cordoba prisoners and led the Army of the North towards the Upper Peru:\n*First Upper Peru campaign (1810–1811)\nAfter securing the loyalty of the northwestern Provinces to the May Revolution through elections of representatives to the Junta in Buenos Aires, Castelli sent General Antonio González Balcarce into the Upper Peru, but he was defeated at the battle of Cotagaita. Castelli then sent him reinforcements, leading to the first patriotic victory at the battle of Suipacha, which gave Buenos Aires control over the Upper Peru. The royalist generals Vicente Nieto, Francisco de Paula Sanz and José de Córdoba y Rojas were captured and executed.\nCastelli then proposed to the Buenos Aires Junta to cross the Desaguadero River, taking the offensive into the Viceroyalty of Peru domains, but his proposal was rejected. His army and Goyeneche's stationed near the frontier, while negotiating. Goyeneche advanced and defeated Castelli at the Battle of Huaqui, whose forces dispersed and left the provinces. The resistance of patriot republiqueta guerrillas of Upper Peru, however, kept the royalists at bay, hampering any serious advance to the south:\n*Paraguay campaign (1810–1811)\nThe other militia sent by Buenos Aires was commanded by Manuel Belgrano and made its way up the Paraná River towards the Intendency of Paraguay. A first battle was fought at Campichuelo, where the patriots claimed victory. However, they were completely overwhelmed at the subsequent battles of Paraguarí and Tacuarí. Thus, this campaign ended in failure as well from a military point of view; however, some months later, inspired on the Argentine example, Paraguay broke its links with the Spanish crown by declaring itself an independent nation:\n*First Banda Oriental campaign (1811)\n]]\nRenewed offensives\nThe undesired outcomes of the Paraguay and Upper Peru campaigns led the Junta to be replaced by an executive Triumvirate in September 1811. This new government decided to promote a new campaign to the Upper Peru with a reorganized Army of the North and appointed José de San Martín, a veteran of the Napoleonic Wars who had recently arrived from Spain, as lieutenant colonel. San Martín was ordered to create the professional and disciplined cavalry unit known as Regiment of Mounted Grenadiers ():\n*Second Upper Peru campaign (1812–1813)\nGeneral Manuel Belgrano was appointed as the new commander of the Army of the North. Facing the overwhelming invasion of a royalist army led by General Pío de Tristán, Belgrano turned to scorched-earth tactics and ordered the evacuation of the people of Jujuy and Salta, and the burning of anything else left behind to prevent enemy forces from getting supplies or taking prisoners from those cities. This action is known as the Jujuy Exodus.\nTurning against the Triumvirate orders, however, Belgrano decided to fight the royalists at Tucumán, obtaining a great victory and then decisively defeating the royalist army at the Battle of Salta, in northwestern Argentina, forcing the bulk of the royalist army to surrender their weapons. Tristán (a former fellow student with Belgrano at Salamanca University) and his men were granted amnesty and released. Then again, the patriot army was defeated into the Upper Peru at the battles of Vilcapugio and Ayohuma and retreated to Jujuy:\n*Second Banda Oriental campaign (1812–1814)\nIn early 1812, the truce between Buenos Aires and Montevideo was over, and Manuel de Sarratea led an army to the Banda Oriental, but he was soon replaced by José Rondeau, who initiated a second siege of Montevideo. Although royalist Gaspar de Vigodet sought to break the siege, he was defeated at the Battle of Cerrito.\nThe Spanish navy then sought to evade the land blockade by raiding nearby populations on the west bank of the Uruguay river. On 31 January 1813, Spanish troops from Montevideo landed near the town of San Lorenzo, Santa Fe Province, but it was absolutely defeated by the Granaderos unit led by San Martín on February 3. The Battle of San Lorenzo ended further Spanish raids on the west bank of the Paraná river and the Triumvirate awarded San Martín the rank of general.\nThe Granaderos unit was instrumental in the Revolution of October 8, 1812 which deposed the government and installed a new Triumvirate, considered to be more committed to the cause of Independence. In fact, this second Triumvirate convened a national assembly which was meant to declare Independence. The Assembly, however, first decided replace the Triumvirate with a new unipersonal Executive office, the Supreme Director of the United Provinces of the Río de la Plata, and elected Gervasio Antonio de Posadas for that role.\nOne of the first actions of Posadas was to create a naval fleet from scratch, which was to be financed by Juan Larrea, and appointed William Brown as lieutenant colonel and chief commander of it, on March 1, 1814. Against all the odds, on 14 May 1814 the improvised patriot navy engaged the Spanish fleet and defeated it three days later. This action secured the port of Buenos Aires and allowed the fall of Montevideo, which could not stand the siege any more, on 20 June 1814.\nThe march towards Independence\nThe fall of Montevideo eliminated the royalist menace from the Banda Oriental and meant the actual end of the Spanish Viceroyalty of the Río de la Plata. Soon afterwards, William Brown was awarded the rank of admiral, and Carlos María de Alvear, who was put in charge of the siege of Montevideo just a few days before the surrender of the city, succeeded his uncle Gervasio Posadas as the Supreme Director of the United Provinces, on January 11, 1815. Alvear, however, was resisted by the troops, so he was quickly replaced, on April 21, by Ignacio Álvarez Thomas through a mutiny. Álvarez Thomas then appointed Alvear as general of the Northern Army, in replacement of José Rondeau, but the officiality did not recognize this and remained loyal to Rondeau:\n*Third Upper Peru campaign (1815)\n:In 1815, the Northern Army, unofficially commanded by José Rondeau, started another offensive campaign in the Upper Peru, without the formal authorization of Supreme Director Álvarez Thomas. Lacking official support, however, the army was faced with anarchy. Moreover, soon after it would lose as well the aid of the Provincial Army of Salta, commanded by Martín Miguel de Güemes. After the defeats of Venta y Media (October 21) and Sipe-Sipe (November 28), the northern territories of the Upper Peru were effectively lost to the United Provinces. However, the Spanish Army could not advance further south as they were successfully stopped at Salta by the Güemes guerrillas from then on.\nThe unsuccessful outcome of the third Upper Peru campaign would spread rumors in Europe that the May Revolution was over. Furthermore, King Ferdinand VII was restored to the Spanish throne on 1813, so an urgent decision was needed regarding the political status of the United Provinces.\nOn July 9, 1816, an assembly of representatives of the Provinces (including three Upper Peru departments but excluding representatives from Santa Fe, Entre Ríos, Corrientes and the Banda Oriental, united into the Federal League) met at the Congress of Tucumán and declared the Independence of the United Provinces in South America from the Spanish Crown, with provisions for a national Constitution.\nArmy of the Andes (1814–1818)\nSan Martín wrapped in the flag.]]\nIn 1814, General José de San Martín had taken command of the Army of the North to prepare a new invasion of the Upper Peru. However, he quickly resigned as he foresaw yet another defeat. Instead, he developed a new strategy to attack the Viceroyalty of Perú through the Captaincy of Chile, inspired on the writings of Sir Thomas Maitland, who was quoted as saying that the only way to defeat the Spanish at Quito and Lima was attacking Chile first.\nSan Martín asked to become the Governor of the Province of Cuyo, where he prepared the Chile campaign. Installed in the city of Mendoza, San Martín reorganized the Granaderos cavalry unit into the Army of the Andes, which he created out of patriots from both the United Provinces and exiles from Chile.\nIn early 1817, San Martín led the crossing of the Andes into Chile, obtaining a decisive victory at the battle of Chacabuco on February 17, 1817, and took Santiago de Chile, where he refused the offer of the governorship of Chile in favour of Bernardo O'Higgins (who became supreme director) because he did not wish to be diverted from his main objective, the capture of Lima. O'Higgins installed a new independent government. In December 1817, a popular referendum was set up to decide about the Independence of Chile.\nHowever, royalist resistance persisted in southern Chile, allied with the Mapuches. On April 4, Argentine Colonel Juan Gregorio de Las Heras had occupied Concepción, but the royalists retreated to Talcahuano. In early 1818, royalist reinforcements from the Viceroyalty of Peru arrived, commanded by general Mariano Osorio, and advanced towards the capital. San Martín then turned to scorched earth tactics and ordered the evacuation of Concepción, which he thought was impossible to defend. On 18 February 1818, the first anniversary of the battle of Chacabuco, Chile declared its independence from the Spanish Crown.\nOn March 18, 1818, Osorio led a surprise attack on the joint Argentine-Chilean army, which had to retreat to Santiago, with heavy losses. In fact, among the confusion, Supreme Director O'Higgins was thought to be killed, and panic seized the patriot camp. Crippled after his defeat at Cancha Rayada, O'Higgins delegated the command of the troops entirely to San Martín in a meeting on the plains of Maipú. Then, on April 5, 1818, San Martín inflicted a decisive defeat on Osorio in the Battle of Maipú, after which the depleted royalists retreated to Concepcion, never again to launch a major offensive against Santiago.\nThe Chile campaign is generally considered to be the conclusion of the Argentine War of Independence, as the further actions of the United Army into Peru were carried on under the authority of the Chilean government, not the United Provinces. However, defensive actions continued to be carried on in the northern frontier of the United Provinces until the 1825 Battle of Ayacucho, which ended the royalist threat from the Upper Peru.\nAnnual commemoration\nThe Día de la Revolución de Mayo (May Revolution Day) on May 25 is an annual holiday in Argentina to commemorate the First National Government (and the creation of the Primera Junta), one of the significant events in the history of Argentina.  These and other events of the week leading to this day are referred to as the Semana de Mayo (May Week).\nSee also\n* Spanish American wars of independence\n* Rise of the Argentine Republic\n* United Provinces of the Río de la Plata\n* Timeline of the Argentine War of Independence\n* Argentine Irredentism\nReferences\nBibliography\n*\n*"
    }
  ]
}