{
  "content": [
    {
      "type": "text",
      "text": "# Armageddon Empires__disambig_1\n\nArmageddon Empires is a 4x turn-based strategy video game for Microsoft Windows and Mac OS X.  It was released internationally for Microsoft Windows on July 16, 2007, and for Mac OS X on October 9, 2007.  The title is the first game released by independent game developer Cryptic Comet.\nPlot\nThe game is set in the year 2325 AD, 300 years after Earth is invaded by two alien races, the Xenopods and the Machine Empire.  Waging war against each other, the two invaders use nuclear weapons and genetically engineered plagues, which in turn results in the deaths of 99.9% of the population.  The war between the Xenopods and the Machine Empire has lasted for 10,000 years, but the two sides only fight on Earth for twenty years before leaving in 2045 to continue their fight in other star systems.\nThe resultant power vacuum causes conflict to break out between four factions: the remaining Xenopods and the Machine Empire, along with the Empire of Man, who are the remnants of human civilisation, and the Free Mutants, who were created by the Xenopods using human tissue.\nGameplay\nIn Armageddon Empires, players take on the role of one of four factions in a post-apocalyptic setting.  Each faction is at war with the others, seeking to dominate the meager resources of a fictitious wasteland.  The only way to achieve victory is to crush all others.\nThe game is designed to be a hybrid of traditional strategy board games along with some elements of collectible card games.  While the cards are not truly collectible, in the sense that the game is complete with a single purchase, it does feature deck design and deck optimization elements.  Cards are used to represent all assets in the game, including buildings, units, heroes, tactics, and weaponry.  The game board is a hex map representing the wasteland, upon which in-play cards are placed.\nAfter picking which deck to play and choosing basic game settings, players are taken to the wasteland map where they place their initial tiles and headquarters.  Since the game is single player, any other factions are controlled by computer opponents.  After this, the terrain is generated and gameplay begins.\nAt the start of each round, all factions roll for initiative.  The default number of dice which factions roll is uniform, but by expending resources, players can increase the number of dice rolled for that turn, increasing the odds that they win the roll.  Not only does the initiative control the order of turns, but it also controls how many action points the faction gets.  However, if players invest too many resources to win the roll, they may be limited in what they can actually do during their turn, having depleted their supplies.  The game requires players to prioritize their limited assets, since there are rarely enough to address all needs.\nEach round, players receive a certain number of the four different resource types: men, materials, energy, and technology, depending on what areas they control and the resource collection facilities stationed there. These resources, in addition to being used to buy initiative dice, are used to bring new cards into play, as well as other functions like the repair of damaged units.  During a player's turn, they may spend action points and resources on a variety of activities.  This includes drawing new cards, playing existing cards from the hand, moving units within armies, forming armies, and conducting research.\nWhen an army encounters an enemy force, battle typically ensues.  Battles involve a setup stage, where units are positioned in the front or back ranks.  After this is done, the two sides are revealed to each other and combat begins in earnest.  The two sides take alternating turns performing a single action each, which usually involves attacking an enemy unit.  Standard attacks involve the attacker rolling a number of dice based on their attack rating, the defender rolling a number of dice based on their defense rating, and comparing the results to determine any damage.  After all units have acted or otherwise been marked \"committed\", the round ends, giving players the chance to retreat or continue battle, with all remaining units returning to a ready state.\nThe ultimate objective is to capture or destroy the headquarters of all other factions.  If a faction loses its headquarters and is not able to reclaim it before the end of the round, that faction is eliminated.  If the human player controls the last remaining faction, they are dubbed the winner and awarded a score based on how well they played.\nDevelopment\nDuring an interview, Vic Davis, the developer behind Armageddon Empires, revealed that the idea for making a turn-based strategy game of his own first came to him in 2004.  After having played a number of such titles and noticing that the industry was moving in a different direction, towards real-time strategy games, he decided to go ahead and pursue game development.\nDavis was working on his first project, a Darklands-style role-playing video game/turn-based strategy hybrid, when he reached the conclusion that it \"wasn't going to work\" in January 2005.  Following this, he was inspired by several board games he was playing at the time, as well as the Call of Cthulhu Collectible Card Game.  This eventually led him to merge the two game types to create the core mechanics behind Armageddon Empires.\nThe game was developed in Adobe Director, chosen based on Davis' previous experience using the package to do animations.\nExpansions\nCults of the Wastelands\nOn October 31, 2007, a post on the Cryptic Comet blog mentioned that a free expansion pack for Armageddon Empires entitled Cults of the Wastelands was in development.  While originally planned to include 10 new cards, the official announcement on the game website expanded this number to 14 while providing a March 2008 release date.  The expansion adds cults to the game, which are independent factions with their own agendas.  When enabled, these cults make use of new mechanics in order to pursue their goals, behaving much more aggressively than the previously passive independent forces. It was released on March 20, 2008.\nTip of the Spear\nOn May 30, 2008, a post on the Cryptic Comet blog announced that development of a second free expansion pack for Armageddon Empires had begun. The expansion makes improvements to infantry units by giving them new abilities, adds new upgrades available only to infantry, and implements an optional feature that makes moving non-infantry armies around the map more costly. The planned release date for the expansion was July 17, 2008, which was the first anniversary of Armageddon Empires' release.\nOn July 8, 2008, Tip of the Spear was released in a beta form on the Cryptic Comet blog, and was quickly patched the day after.  The official release of the expansion was made on July 21, 2008.\nReception\n| PCGUK = 84%\n| rev1 = Games for Windows\n| rev1Score = 9/10\n| rev2 = GamingShogun\n| rev2Score = 8.5/10\n}}\nArmageddon Empires received positive reviews overall.  The game received positive marks for its deep strategy gameplay and return to genre roots. Negative criticisms focused on the bare-bones user interface. Pelit called Armageddon Empires \"A very entertaining turn-based post-apocalyptic strategy game with a lot of tools of war. A gem marred only by clunky UI.\" PC Format said it is \"A strategy triumph and a real must-play.\nGames for Windows magazine praised the game's blend of collectible card game and board game, while noting that the game lacks a multiplayer mode.\nSee also\n*Solium Infernum\nReferences\nExternal links\n*[http://www.crypticcomet.com/games/AE/armageddon_empires.html Official website for Armageddon Empires]\n*[http://www.crypticcomet.com/blog/ Cryptic Comet's design blog]"
    }
  ]
}