{
  "content": [
    {
      "type": "text",
      "text": "# Armand Swart\n\nArmand Swart was a South African engineer employed by Q Tech in Vereeniging, Gauteng. He was fatally shot on 17 April 2024 outside his workplace while in his vehicle and his killing was cited among high-profile cases exposing the nexus between organised crime and public-contract fraud in South Africa.\nSwart’s case is part of a pattern of assassinations investigated by the Madlanga Commission, which was appointed via the Government Gazette on 23 July 2025 to inquire into allegations of criminal syndicate infiltration of law-enforcement and justice institutions.\nThe  Political Killings Task Team (PKTT) was praised for making breakthrough in the arrest of perpetrators but was controversially disbanded on 31 December 2024 under the directive of Minister of Police Senzo Mchunu, a move criticised by KwaZulu-Natal Police Commissioner Nhlanhla Mkhwanazi as undermining high-risk investigations like Swart’s.\nBackground\nA whistle-blower report concerning procurement irregularities involving a major South African state-owned entity, Transnet, was lodged after a scandal of inflated tender prices. The report revealed that small engineering parts, purchased by Transnet from a contracted company, SK Group, were being resold at exorbitant markups. For instance, items bought from Q-Tech Engineering at R3.95 were sold to Transnet by SK Group for R150, marking an over 4,500% price inflation. Swart worked for Q Tech. His whistleblower report to Transnet and subsequently to the Department of Public Enterprises exposed the inflated pricing and corrupt tendering practices.From the information revealed at the Madlanga Commission, it appeared that Swart was not himself the official whistleblower - someone else within Q-Tech or Transnet anonymously reported the procurement irregularities and the masterminds mistakenly believed Swart was the author of the whistleblower report and targeted him to bury the fraudulent SK Group dealings.\nOn April 2024, Swart was tragically shot multiple times as he entered his workplace in Vereeniging. Investigations revealed that the murder was orchestrated by Katiso “KT” Molefe, a businessman with alleged ties to organized crime. His nephew, Lucky Molefe, a former Transnet employee, was implicated in the plot. Thapelo Molefe, a son of KT, benefited from KG Group. The hitmen had conducted surveillance on Swart's workplace, using vehicles linked to previous criminal activities. Police officer Michael Pule Tau and two other suspects, Tiego Mabusela, and Musa Kekana, were arrested shortly after the murder. Molefe allegedly hired the gunmen and was granted bail of R400 000 in October 2025.\nMolefe’s nephew, Lucky Molefe, remains wanted in connection with the murder and the SK Group tender.He was working as a buyer for Transnet at the time of Swart murder. Ballistics evidence linked the firearms used in Swart’s assassination to approximately 30 other cases, including five confirmed murders: DJ Sumbody, his two bodyguards Walter Mokoena and Sandile Myeza, Hector Buthelezi (DJ Vintos), and Don Tindleni. The accused are alleged members of the so-called \"Big Five Cartel (South Africa)\", reportedly involved in drug trafficking, extortion, cross-border vehicle hijacking, and tender fraud. Mabusela and Kekana have been linked to 11 counts of attempted murder, including an attempt on taxi boss Joe Sibanyoni. Witnesses testified about infiltration of the police service by criminal syndicates, making the investigation of Swart’s murder extremely dangerous to carry out, with witnesses praising Mkhwanazi's media address on 6 July 2025 that exposed interference in the police organisation, with politicians like Mchunu and deputy national commissioner Shadrack Sibiya allegedly serving as enablers of criminal interference.\nReferences"
    }
  ]
}