{
  "content": [
    {
      "type": "text",
      "text": "# Armenian Revolutionary Federation in Iran\n\nThe Armenian Revolutionary Federation (ARF) ( Hay Heghapokhagan Tashnagtsutiun; , in short form \"Dashnak\"), has a long history in Iran, dating back to the earliest days of the party, in the 1890s. The ARF played a significant role as one of the pioneers in the development of early modern Iranian politics, and had a great contribution to the Iranian Constitutional Revolution. Though the principal objectives of the ARF were to create an independent Armenian state comprising territory of the former Soviet Union and the Turkey, it has never asserted claims to the portion of historical Armenian land that remain under Iranian rule. It is the only Armenian party to exist in Iran.\nHistory\nThe activities of the Armenian Revolutionary Federation in Iran has its roots in the vibrant Armenian political life in northwestern Iran, in the historic Iranian region of Azerbaijan (also known as Iranian Azerbaijan). This area of native Armenian settlement, housed prior to the Armenian genocide as well as other events of the 20th century (e.g. Iran crisis of 1946, Iranian Revolution), a significant native Armenian population. Apart from the ARF, the Social Democrat Hunchakian Party was active there as well, and was often at odds with the (much larger) ARF.\nShortly after the foundation of the ARF in 1890, it already began to send representatives to recruit Armenian members living in Qajar Iran. As the Encyclopaedia Iranica states, among the earliest ARF leaders in Persia were; Yonan Dawtʿean, Ishkhan Yovsēpʿ Arłutʿean, Nikol Duman (Nikoghayos Ter-Hovhannisyan), Stepan Zorian (nom de guerre; Ṙostom), Sargis Mehrabyan (nom de guerre; Vartan), Farhat (Sargis Ōhan-ǰanean), Karō (Aristakēs Zōrean), Stepan Stepanian (Balajan), Zakʿkʿi (Bagrat Vardapet Tʿawakʿalean), Tsaghik (Satʿenik Matinean), Yovsēpʿ Mirzayean, Vrtʿanēs Pʿapʿazean, Yarutʿiwn Martirosean, Arsēn Mikʿayēlean, and Yovhannēs Khan Masehean.\nThe ARF drew most of its support from the Armenians from Tabriz, and in particular from the Lilava district. Its activities were mainly to provide a safe gateway for the transportation of weapons and fighters from the Caucasus to the Armenian provinces of the Ottoman Empire. They used the St. Thaddeus Monastery (located near Maku; ) and the Saint Stepanos Monastery on the Aras River as their bases of operations; both monasteries would play a significant role in the large scale smuggling of fighters, literature and weapons into Ottoman Armenia by the ARF. The ARF even had one arms factory in Tabriz at their disposal, which was founded in 1891. At the same time, the ARF used the Caspian cities of Anzali, Rasht, and Astara as important centers of party communications with the nearby city of Baku, the latter which was also regarded as an important ARF base in the region. The ARF had a long history of making publications; first, it published weekly Aravat in Tabriz (1909–12), as well as the monthly Garabar, which was later changed to Gharadag (1913–14), as well as the weekly Ayg (1914–20), the latter which eventually replaced Aravat as the main publication of the party. A weekly youth magazine was also produced by the younger members of the ARF, which was called the Aršaloys.\nAround the same time, the Armenian community in Tehran had grown rapidly in size and importance, and therefore the ARF founded another central committee there in 1911. After World War II, when the Soviets prolonged their occupation of Iran which resulted in the Crisis of 1946, as well as through the large scale emigration to Soviet Armenia, the ARF central committee in Tabriz was downgraded to a committee.\nARF guerilla groups crossed the Ottoman border from Iranian Azerbaijan to fight the Ottomans. The Iranian monarchy permitted such guerrilla operations as it was beneficial to them as well, as it weakened the Ottoman authority over the Kurdish tribes who lived in the Ottoman-Qajar border regions, and which occasionally created issues for the Iranian central authority. The Iranian government, which was weak at the time, acted only against ARF activities under pressure from the Russian or Ottoman governments. For example, according to the Encyclopaedia Iranica, after the Khanasor Expedition to the province of Van in 1897, many ARF fighters and guerillas were arrested and nine executed by the Iranian government. Party operations were temporarily slowed down by continued foreign pressure, and during the economic crisis of 1901 the attention of the Armenian community was therefore turned elsewhere. However, in the years of 1904–1906, the ARF grew again to its former strength. At that time, the Iranian Constitutional Revolution was in the making. As an example listed by the Encyclopaedia Iranica; \"as a result of clashes between Armenians and Tatars in the Caucasus in 1905-06 it was the ARF that prepared to defend the Persian Armenian population should the conflict spread across the border, which fortunately did not happen\".\nIranian Constitutional Revolution\nThe most important episode of the ARF in Iranian history happened during the Iranian Constitutional Revolution. Members of the ARF were individually involved with the constitutionalist faction since 1906. Further commitment of the ARF to the constitutional cause was fueled by the Ottoman incursions into Iranian Azerbaijan, and the overall pillaging of Armenian villages in the region. In 1907, during the Fourth General Congress, a voting was done by the ARF leaders to discuss the ARF's open and official involvement in the Constitutional Revolution. With 25 votes in favour and 1 in absentia, the ARF now was officially involved in the happening. In 1908 and early 1909, amidst the Iranian Constitutional Revolution, Armenian battalions and fighters formed crucial portions of the revolutionary forces led by Sattar Khan and Baqer Khan, and they played a pivotal role in the efforts of the constitutionalists to gain control of various parts of Iranian Azerbaijan. Fedayi Nikol Duman was involved in the defense of Tabriz leading the constitutional defense, until December 1911, when the Russian forces completely defeated them. In the ensuing period following the successful Russian capture of the city, many constitutionalists were executed and arrested, which therefore included some ARF members.\nYeprem Khan, a member of the Persian A.R.F. since 1896, played also an immense role in the revolutionary efforts, and is considered a national hero in Iran.\nIn 1921, ARF actions against the Sovietization of Russian Armenia were completely crushed. As a result, some 10,000 ARF party leaders, fighters, intellectuals (and their families) crossed the Iranian border to find shelter there. The direct result of their presence was that the ARF would ensure its predominance over the other Armenian parties active in Iran, and therefore over the complete Armenian community as a whole (which itself was centered around the Armenian Apostolic Church).\nPahlavi era up to including the 21st century\nThe ARF organ in Iran usually supported the Pahlavi regime (1925-1979), which in turn appreciated the party's anti-Soviet stance as well as stance of having no claims to Iranian territory. The only genuine opposition against the Pahlavi regime came when Reza Shah closed most of the minority schools (incl. therefore the Armenian ones). During the Anglo-Soviet invasion of Iran, and the ensuing Iran crisis of 1946, the Iranian Armenian community elected parliamentary representatives who were regarded as hostile to the ARF, while at the same time the occupying Soviets imprisoned and exiled some of the Iranian ARF leaders.\nDuring the Islamic Revolution (1979) the Armenian left-wing regained prominence in Iran. Even though the ARF was initially mistrusted by the new government (which viewed all leftists as a potential danger to its ideas), the Islamic Republic soon came to conclusion that the ARF was not a threat and was not working against the Islamic Republic. Though some ARF members were arrested and interrogated in this period, relations were eventually normalised. As the Encyclopaedia Iranica adds; \"today the ARF is one of the most important political parties among the Armenian diaspora, the only Armenian party permitted to exist (semiofficially) in Persia, and a leading force in the parliamentary opposition in the newly established Republic of Armenia\".\nReferences\nSources\n* E. Abrahamian, Iranbetween Two Revolutions, Princeton, N.J., 1982.\n*\n*\n* V. Demirǰean, “Ancʿkerə Darašambi S. Stepʿanos Naxavkayi Vankʿum 1905-1965 Tʿ. Tʿ.,” in V. Demirǰean, ed., Diwan Atrpatakani hayocʿ patmutʿean I, Tehran, 1345 Š./1966, pp.&nbsp;99–130. (in Armenian)\n*\n* A. Ter Minassian, La question arménienne, Paris, 1983. (in French)\n*\nFurther reading\n*"
    }
  ]
}