{
  "content": [
    {
      "type": "text",
      "text": "# Armenian Revolutionary Army\n\nThe Armenian Revolutionary Army (ARA) (in Armenian Հայ Յեղափոխական Բանակ (ՀՅԲ)—pronounced Hay Heghapokhagan Panag) was an Armenian militant organization that attacked at least seven times resulting in at least six fatalities and eight injuries. The group took responsibility for the gunning down of Turkish Embassy attache Dursun Aksoy in Brussels (1983), an attack on Turkish embassy in Lisbon (1983), and the attack on the Turkish Embassy in Ottawa (1985).\nArmenian Revolutionary Army is thought to be the continuation of the organization Justice Commandos of the Armenian Genocide (JCAG) under a different name. As JCAG stopped taking responsibility in communiques from 1983 on, it was the Armenian Revolutionary Army that carried on with the military activities.\nOperations\nA library in Lisbon, Portugal was bombed in 1970. This was the first attack claimed by the ARA. But as the next attack claimed by the same-named organization occurred only in 1983, many have questioned if this was actually related to the organization established in the 1980s as a continuation of JCAG or whether they were two different organizations happening to use the same name ARA.\nIn 1983, Armenian Revolutionary Army claimed responsibility for an attack on the Turkish Embassy attache Dursun Aksoy who was gunned down in Brussels.\nARA took responsibility for the 1983 Turkish embassy attack in Lisbon against the Turkish embassy in Lisbon on 27 July 1983. It resulted in the death of 7 people, including all 5 attackers known in Armenian sources as \"The Lisbon five\" (Setrak Ajamian, 19 years old; Ara Kuhrjulian, 20; Sarkis Abrahamian, 21; Simon Yahniyan, 21, and Vache Daghlian, 19).\nOn 12 March 1985, ARA claimed responsibility for the attack on the Turkish Embassy in Ottawa. Three ARA gunmen who attacked the Turkish embassy in Ottawa, Canada were Kevork Marachelian, 35, of LaSalle, Quebec, Rafi Panos Titizian, 27, of Scarborough, Ontario, and Ohannes Noubarian, 30, of Montreal. They surrendered to police.\nARA's last attack occurred in 1985.\nSee also\n* Armenian Secret Army for the Liberation of Armenia\n* Justice Commandos Against Armenian Genocide\nReferences"
    }
  ]
}