{
  "content": [
    {
      "type": "text",
      "text": "# Armenians in the Byzantine Empire\n\nArmenians were the most significant ethnic minority in the Byzantine Empire at various times. Historically, this was due to the fact that part of historical Armenia, west of the Euphrates, was part of the empire. After the division of Armenia between the Roman Empire and the Sasanian Empire in 387, part of Greater Armenia was annexed to the Empire. At this time and later, there were significant migrations of Armenians to Byzantine Anatolia, Constantinople and the European part of the Empire.\nThe Armenians occupied a prominent place in the ruling class of Byzantium, with a number of emperors believed to be coming from their ranks: Heraclius I (), Philippicus (), Artabasdos (), Leo the Armenian (), Basil I Macedonian () and the Macedonian dynasty which he founded, Romanos I Lekapenos () and John Tzimiskes (). According to the calculations of Alexander Kazhdan, Armenians made up 10–15% of the ruling aristocracy in the 11th–12th centuries; taking into account persons and families whose Armenian origin is not entirely certain, this proportion becomes much higher. Due to the fact that Armenia did not recognise the Fourth Council of Chalcedon (451), the relations between Byzantium and Armenia were influenced by the attempts of the official Byzantine Church to convert the Armenian Church to . Many Armenians played an important role in the Greco-Roman world and in Byzantium.\nArmenian population of Byzantium\nArmenian migrations to Byzantium\nThe presence of Armenians in the territory of the Roman Empire is known from the beginning of the first century. The geographer Strabo reports that \"Comana has a large population and is an important trading centre for merchants from Armenia\". In the 4th and 5th centuries, the Armenian population appeared in other regions and cities of the Empire. In 571, fleeing persecution in the Sasanian Empire, many Armenians, led by Vardan Mamikonian, found refuge in Byzantine Anatolia and in particular in the city of Pergamum, where they formed a large colony. In the middle of the 7th century, the Pavlicians fled to Byzantium and settled at the confluence of the Iris and Lycus rivers in the diocese of Pontus. Under Constantine V (), many Nakharars left their possessions in Armenia and fled to Byzantium. In 781, fleeing persecution in the Caliphate, 50,000 Armenians migrated to Byzantium. Empress Irene and her son Constantine VI () officially welcomed them in Constantinople and rewarded those who arrived with titles and lands according to their nobility.\nForced relocations of Armenians were also practised. They were probably not significant until the middle of the 6th century, although Procopius of Caesarea, reporting on the reasons for the discontent of a certain Arsacus, says that during the Gothic War, Armenia was \"... tormented by constant recruitment and military fasting, exhausted by extraordinary taxes, his father executed on the pretext of non-fulfilment of treaties and agreements, all his relatives enslaved and scattered throughout the Roman Empire\". During the reign of Tiberius II (), 10,000 Armenians from Arzanene were resettled in Cyprus. Sebeos reports the plans of his successor Maurice () to solve the problem with the Armenians, who were \"a stubborn and unruly people, living among us and muddying the waters\". To this end, the Byzantine emperor entered into correspondence with Shah Khosrow II (), proposing that he should simultaneously carry out the resettlement of the Armenians subject to him, while Maurice would resettle his own in Thrace. However, the result was somewhat different, as the Armenians began to flee to Persia. Thrace was later considered the most suitable place for Armenians to live: under Constantine V () Armenians and Syrian Monophysites were resettled there, under Leo IV () 150,000 Syrians were resettled there, among whom could be Armenians. After the victory of Basil I () in 872 over the Pavlikians, most of whom were probably Armenians, many of them were scattered throughout the empire. Under his son, Leo VI, the Armenian ruler Manuel of Tekis was \"brought to Constantinople\", most likely indicating that he was forcibly detained, and his four sons were given lands and offices. Manuel himself was given the title of protospatharius and the theme of Mesopotamia was founded on his former lands. Under John Tzimiskes (969–976) the Paulicians were moved from the eastern provinces to Thrace. Basil II () also moved many Armenians from his subject lands to the region of Philippopolis and Macedonia in order to organise defence against the Bulgarians. Asoghik reports in the early 11th century that \"... the latter intended to resettle some of the Armenians under his rule in Macedonia [in order to set them] against the Bulgars [and to give them the opportunity to participate in] the organisation of the country\".\nThrace was not the only place where Armenians settled: they are mentioned in the early 11th century among the peoples resettled by Nikephoros I () in Sparta to rebuild the ruined city; in 885 the commander Nikephoros Phokas the Elder resettled many Armenians, probably Pavlicians, in Calabria. After the conquest of Crete in 961, Armenians were also settled there. In 1021, the king of the Armenian Vaspurakan kingdom, Senekerim Artsruni, transferred his kingdom to Byzantium. He received Sebastia, Larissa and Avara for it and became patrician and stratigem of Cappadocia. With him, 400,000 people migrated from Vaspurakan to Cappadocia. This figure, first mentioned in the 18th century by the Armenian historian M. Chamchyan, is questioned by the contemporary Armenist Peter Charanis, as a contemporary source gives the number of settlers as 16,000, not counting women and children. From the middle of the 10th century, Armenians began to settle intensively in Cappadocia, Cilicia and northern Syria. Many Armenian refugees made their way to Byzantium to escape Seljuk raids. The defeat of Byzantium at Manzikert in 1071 and the conquest of territories in Asia Minor by the Crusaders at the end of the 11th century led to a diminished role for the Armenians, although their presence is recorded until the final fall of the empire. Armenian colonies in the last period of Byzantine history are known in the remaining cities of Anatolia under Byzantine rule and in the European provinces.\nThe mass resettlement of Armenians from Armenia to Byzantine lands had more global consequences than the growth of the community. In the second half of the 11th century, Armenians formed at least 6 states here: in 1071 the state of Filaret Varažnuni and the Principality of Melitene, in 1080 the Principality of Cilicia, in 1083 the Principality of Edessa, around the same time — the Principality of Kesun and the Principality of Pir. Of these, the Principality of Cilicia was recognised as an Armenian kingdom in 1198. Mekhitar Ayrivank wrote in the 13th century: \"At that time the Rubenians began to rule in Cilicia. God Himself did justice to us who were oppressed: the Greeks ceased our kingdom, but God gave its land to the Armenians, who now reign in it\".\nThe Armenian possessions in the Empire\nAfter the first partition of Armenia in 387, about a quarter of the Armenian Kingdom of the Arsacid was incorporated into Byzantium. This gave the empire a significant Armenian population. At the same time, they were one of the indigenous peoples of Cappadocia. With the support of Byzantium, which sought to strengthen its influence in the region, Christianity continued to spread in Armenia. In the Byzantine part of Armenia, Mashtots, the creator of the Armenian alphabet, was active in the 420s. After the end of the Iranian-Byzantine war in 591, the second division of Armenia took place, as a result of which the Byzantine border moved eastwards and covered the whole of central Armenia. Around 600 rebellions started in Armenia, then from 603 Armenia was involved in another war between Byzantium and Iran. Around 640, the Muslim conquest of Armenia began and soon this part of the empire was lost. In the 10th century, significant areas with Armenian populations were incorporated into the Byzantine Empire. Thus in 949 the region of Karin was annexed, in 966 the Armenian principality of the Bagratids in Taron, and a few years later Malazgirt, also with a predominantly Armenian population. A turning point in the further history of the Armenian people was the annexation of the kingdom of Ani in central Armenia by the Empire in 1045 and the occupation of the great city of Ani. For a time, the Byzantine Empire's possessions in Armenia reached as far as the western coast of Sevan. However, this situation did not last long. In 1064 this territory was conquered by the Seljuk Sultan Alp-Arslan. The following year, King Gagik of Vanand was forced to surrender his kingdom to Byzantium. By 1065, much of historical Armenia, with the exception of Ani, Syunik, Tashir and Khachen, was part of Byzantium.\nThe mass annexation of Armenian lands by Byzantium had far-reaching consequences. On the one hand, Byzantium was deprived of a buffer, and any invasion from the east now directly affected its territory, which meant the inevitable involvement of the empire in a conflict with the Seljuks. In addition, in an attempt to integrate the indigenous Armenian nobility into the new Byzantine reality, the Empire was forced to allocate lands in Lycandus, Cappadocia, Tsamandos, Harsianon, Cilicia and Mesopotamia to the displaced Armenian princes. Tens of thousands of Armenian peasants and artisans migrated with these princes, changing the ethnic and religious composition of these provinces. This in turn led to a fierce struggle with the Greek Orthodox population already present there.\nLegal status\nLesser Armenia became a Roman province under Vespasian (), first as part of Cappadocia, then separately. Not much information has survived about this province, but it could be not very different from the others. In the territories acquired after 387, the power of the Arsacids was abolished either immediately or under Theodosius II () and transferred to the comes of Armenia. At the same time, the hereditary rights of the Nakharars to the land and its transfer on the basis of the principle of majorat were respected. The territories in the bend of the Euphrates were only nominally subject to the Arsacids from 298; their rulers were directly subordinate to the emperor, and local military contingents were under their command. All parts of Armenia paid taxes to the treasury. During the reign of Justinian I (), changes were made to the administrative structure of Armenia, taxation was increased and women were given the right of inheritance. This last measure led to the fragmentation of the possessions of the Nakharars, which led to their discontent.\nThe Muslim conquest of Armenia in the 7th century did not change the general tendency to integrate the Armenian nobility into the administrative structures of the empire. In the areas conquered in the 10th and 11th centuries, themes were established, with command positions given not only to Armenians from the interior provinces, but also to local natives. In its activities, Byzantium relied not only on the Chalcedonian Armenians who were close in faith, but also on those who remained loyal to the Armenian Church.\nArmenian prosopography of Byzantium\nEmperors\n]]\nA rather extensive literature is devoted to attempts to establish the Armenian origin of various Byzantine emperors. According to the Armenian historian Leo, this \"flattered the national vanity of Armenians\". The first Byzantine emperor about whom there is a legend regarding his Armenian origin is Maurice (). A number of Armenian historians of the 10th–13th centuries provide information about his Armenian origin, from Oshakan, according to Asoghik. In the same locality, there is a column, according to local legend, erected in honor of the emperor's mother. The analysis of these legends was conducted by N. Adontz, who supported recognizing their authenticity. Nevertheless, the majority of modern researchers recognise the perspective of Evagrius Scholasticus, who asserts that Maurice \"by descent and name, originated from ancient Rome, and by his immediate ancestors, his homeland was the Cappadocian city of Aravin\". According to the authors of the Oxford Dictionary of Byzantium, this question remains unsolved.\nMore reliable information concerns Emperor Heraclius (). The historian of the 7th century, Theophylact Simocatta, in his History, states that the native city of this emperor was in Armenia. It is known that during the last Iranian-Byzantine war, the residence of Heraclius from 622 to 628 was in Armenia. In the History of Emperor Heraclius by the 7th-century Armenian historian Sebeos, Heraclius' kinship with the Arsacids is mentioned, although the degree of this kinship is not quite clear. Other versions of the origin of this emperor propose his African, Syrian, or Cappadocian non-Armenian origin, and each of these possibilities suggests a different interpretation of the deeds of this outstanding ruler. In the authoritative reference book Prosopography of the Later Roman Empire, the origin of Heraclius is identified simply as Cappadocian, which does not exclude Armenian ancestors.Martindale J. R. Heraclius 4 // Prosopography of the Later Roman Empire. [2001 reprint]. Cambr.: Cambridge University Press, 1992. Vol. III (b): A.D. 527–641. P. 586.  The usurper Misisius, who ruled in Sicily in 668–669, was Armenian. His name is a Greek transcription of the Armenian name Mzhezh. Very little is known about the brief reign of Philippicus () in the years following the turmoil that began after the first overthrow of Justinian II. Assertions about his Armenian origin are based on his birth name, Vardan. A source from the middle of the 8th century refers to his father, Nikephoros, as a native of Pergamum. However, as A. Stratos notes, there is no contradiction between the information about the origin of Philippicus' family from Pergamum and his Armenian roots, since in 571 many Armenians fled to Anatolia and founded a large colony in Pergamum. According to C. Toumanoff, Emperor Artavazd () belonged to the noble Mamikonian family. Regarding the origin of Emperor Leo V the Armenian (), the Continuer of Theophanes states: \"The fatherland of the said Leo was Armenia, but he was descended on the one hand from Assyrians, and on the other hand from Armenians, those who in a criminal and impious scheme shed the blood of their parents, were condemned to exile and, living as fugitives in poverty, raised this beast\". Such an unflattering characterization may be due to doctrinal differences between the author of the chronicle and the iconoclastic emperor.Продолжатель Феофана. Жизнеописания византийских царей / изд подготовил Любарский Я. Н. 2 изд. СПб.: «Алетейя», 2009. 400 p. (Византийская библиотека. Источники).  According to K. Toumanoff, this emperor belonged to the noble Armenian family of Gnuni, and this viewpoint is considered probable by W. Treadgold. There is also an opinion that he belonged to the Artsrunids. Empress Theodora had Armenian roots, along with her brothers, uncle, nephews, and other numerous relatives who exercised regency during the minority of her son, Michael III (). According to N. G. Adontz, she belonged to the Nakharar Mamikonian family.\n]]\nThe question of the origin of Emperor Basil I () has attracted the close attention of Byzantinists since the time of Ducange. In the opinion of this 17th-century French researcher, the genealogy presented by Patriarch Photios, tracing Basil’s paternal line to relatives of the Armenian tsars who moved to Byzantium under Emperor Leo Machella (), and his maternal line to Constantine the Great (), is entirely fictitious. In the 19th century, based on the study of Arabic sources, the theory of Basil I’s Slavic origin was developed. Thus, the total number of hypotheses reached three: noble Armenian, low-born Armenian, and Slavic. It is known that Basil's birthplace was near Adrianople, where both Slavs and Armenian Paulicians could have lived. The Vita Euthymii (the first half of the 10th century), discovered in the 19th century, speaks quite definitively about Basil’s Armenian origin. On the other hand, there are strong arguments against Photius’ account, also echoed by Genesius and Basil's grandson, Constantine VII (). A number of Greek texts are aware of Basil’s humble origins but do not mention his Armenian roots. Armenian sources are unanimously convinced of Basil's Armenian origin, and Asolik, for example, writes about his son: \"Leo VI, as the son of an Armenian, surpassed any Armenian tarovatostvo\", and Vardan that \"he was the son of an Armenian and very fond of Armenians\". Comparing all known at the beginning of the 20th century, the well-known Russian Byzantinist A. A. Vasiliev tends to the version about the Armenian ignorant origin of Basil I, considering the indications about his possible Slavic origin as a consequence of confusion because of the geographical location of the province of Macedonia inhabited mainly by Slavs. According to this opinion, it is widely believed that all the representatives of the Macedonian dynasty founded by him until Basil II () were of Armenian origin. This is now the prevailing theory. It was opposed by the Byzantinist G. A. Ostrogorsky.\nSome emperors in the 10th century include Romanos I Lekapenos () and John I Tzimiskes (). The Armenian origin of the Phokas family, to which Emperor Nicephorus II Phocas () belonged, is not reliably confirmed.\nAristocratic families\nAfter the partition of Armenia in 387, Byzantium acquired not only territory but also a significant portion of the Armenian aristocracy, that entered both military and civil service. A new influx of nobility occurred after the second partition of Armenia in 591 and the Muslim conquest of Armenia in the 7th century. According to N. G. Adontz, “all Armenians who played a certain role in Byzantine history almost entirely belonged to the class of Armenian nobility”. When considering the question of the affiliation of historical figures to specific noble families, the difficulty lies in the fact that Greek sources usually did not reflect this detail.\nNumerous Byzantine aristocratic families had Armenian origin, including the Lekapenos, Kourkouas, Gabras, Zautzes, and many others, whose representatives held high civil and military positions. Alexander Kazhdan conducted a study of aristocratic families of Armenian origin during the 11th–12th centuries. According to his classification, we can distinguish three categories of such families: those whose Armenian origin is indisputable, Armenian-Ivir families, and other families for which the origin is difficult to establish. According to A. P. Kazhdan’s estimate, made in the 1970s, the share of descendants from natives of Armenia during the period he studied was between 10 and 15 percent. As a result of further research, N. Garsoyan considered this estimate overestimated. Alongside the Armenian aristocracy of Byzantium, there is also the ‘Armenian-Ivirian,’ i.e., those whose representatives are referred to in Byzantine sources as Armenians and Ivirs. It is believed that these families, which Kazhdan attributed to the Tornikov and Pakurianov, and which N. G. Garsoyan also attributed to the Phokas, belonged to the Chalcedonian nobility of the theme of Iberia, whose ethnic origin could be diverse.\nFrom the 8th to the 10th century, the Armenian family of Mosile produced a number of significant military commanders. The Chronicle of the Theophanes Continuatus repeatedly mentions Constantine Maniakes, “the father of our logothete of the dromos, wise philosopher and absolutely incorruptible patrician Thomas”. The chronicler also notes that this Constantine was friendly with the future Emperor Basil I due to their shared Armenian origin. In the mid-9th century, the effective ruler of the Byzantine Empire was Bardas, a younger brother of Empress Theodora, the Armenian, possibly from the Mamikonian family. After the 9th century, information about Armenian aristocratic families becomes quite abundant. Among the Armenian families of the late Byzantine period, we can name the Taronites (10th–13th centuries) and their relatives, the Tornikios, who remained influential until the 14th century. A representative of the Tornikios family was the 11th-century usurper Leo Tornikios.\nFigures of culture and science\nThere is information about the Armenian philosopher-sophist Prohaeresius since the Roman era. In the Byzantine Empire, some representatives of science and culture also had Armenian origins. In the 7th century, having learned in his homeland “all the literature of our Armenian people”, the Armenian geographer Anania Shirakatsi, according to the French Byzantinist P. Lemerle, —the father of the exact sciences of Armenia— went to Byzantium to continue the education. At first, he intended to study with the mathematician Christosatur (it is impossible to say for certain whether he was Armenian), in the province of Armenia IV. His compatriots then advised him to go to Trabzon, where the scholar Tikhik, knowledgeable in sciences and fluent in Armenian, lived. For eight years, Anania studied with this Greek scholar, translating Greek texts to Armenian. After completing his studies, Anania returned to Armenia, where he began teaching, disheartened to find that Armenians “do not like learning and science”. Anania was not happy about this. Regarding this story, reported by Anania in his autobiography, various hypotheses have been put forward — either that the young Armenians studying in Trebizond were to be later chirotonized, or that Tikhik was taught by Greeks, whom Byzantium, as part of the Armenian policy of Emperor Heraclius I, wanted to involve in Armenian affairs.\nArmenians played an important role in the cultural and intellectual life of Constantinople. A native of Constantinople, to whom Armenian origin is commonly attributed, was John Grammaticus — Patriarch of Constantinople from 837 to 843 and a famous iconoclast. The names of his brother (Arshavir) and father (Bagratuni, in Greek sources—Pankratios) indicate a probable kinship with the Bagratuni and Kamsarakan dynasties. Among the Byzantine scientists of Armenian descent, the author of the famous monograph on Armenians in Byzantium, P. Charanis, names the patriarch of the 9th century, Photios, but in most modern sources, the origin of this prominent religious figure and encyclopaedist is not specified due to insufficient extant data. A well-known patron of the sciences in the 9th century was the major statesman Bardas. His friend and co-founder of the University of Constantinople was Leo the Mathematician, nephew of John the Grammarian. Some sources mention the Armenian ancestry of Joseph Genesius. Such a claim is based on the probable Armenian origin of his grandfather, Constantine Maniak, but the kinship between Joseph Genesius and Constantine Maniak is sometimes questioned. Apparently, the writer of the 11th century, Kekaumenos, author of the famous Advice and Stories, containing not only military but also domestic teachings, was also of Armenian descent. During the Palaeologan Renaissance, the mathematician of Armenian origin, Nicholas Artavazd, was active.\nArmenians in the Byzantine army\n(478-573) — a military commander and influential courtier of the Eastern Roman Empire]]\nIt is known that Armenians used to be merchants and representatives of other professions, their main occupation in Byzantium seems to have been military service. Thanks to the information from Procopius of Caesarea, the court historian of Emperor Justinian I, the role of Armenians in the wars that the emperor fought in Africa against the Vandals, in Italy against the Ostrogoths, and in the Middle East against the Sassanids is well documented. Besides Narses, a native of Persoarmenia who achieved considerable success in the war with the Goths and in conflicts with the Antes, Heruli, and Franks, about 15 commanders of Armenian origin in Justinian's army can be mentioned. The Byzantine garrison of Narses, located in Italy, consisted mainly of Armenians and was called numerus Armeniorum. According to the Armenian historian Sebeos, the Armenian element dominated the polyethnic army of Emperor Maurice: “He ordered to transport all of them across the sea and unite them in the countries of Thrace against the enemy\". At the same time, he also ordered the gathering of all the Armenian cavalry and the princes of the Nakharars, who were powerful in battle and skilled both in warfare and in throwing spears. He also commanded the recruitment of a strong army from Armenia, selecting the tallest and most skilled hunters to form slender regiments, arm them, and send them to Thrace against the enemies, appointing Mushegh Mamikonyan as their commander. This campaign beyond the Danube ended with the defeat of the Byzantines and the death of Mushegh. After that, two armies of 1,000 horsemen each were recruited in Armenia, of which one \"was frightened on the road and did not want to go to the place where their king demanded them\". According to the 19th-century historian K. P. Patkanov, starting from the reign of Maurice, Armenian commanders began to play an important role in the Greek army, reaching the highest command positions.\nDuring the reign of Heraclius I, the significant role of Armenians in the army was preserved, along with other Caucasian peoples—Lazs, Abasgois, and Iberians. Theophanes the Confessor, in connection with Heraclius I’s campaign against the Persians in 627/628, twice mentions the participation in this campaign of a detachment of Armenian cavalry under the command of the turmarch George. Under Heraclius, the Armenian Manuel served as prefect of Egypt. Some of the usurpers of the 7th century may have been Armenians — Vahan, proclaimed emperor before the battle of Yarmouk, and the Opsician comite Misisius, who was proclaimed emperor during the reign of Constantine II () for his \"plausibility and majesty\". An Armenian was also proclaimed emperor during the reign of Constantine II (). According to Michael the Syrian, his Armenian name was Mzhezh Gnuni, and his son John revolted against Constantine IV (). After the completion of the conquest of Armenia by the Arabs, the Armenian troops were spared from fighting against their co-religionists, because according to the terms of the treaty concluded in 652, the Armenian cavalry could not be transferred to the Syrian front. Around 750, Tachat Andzevatsi arrived in Byzantium and fought successfully in Constantine V's wars against the Bulgarians; he later became a commander in the fief of Bucellarian. Emperor Leo the Armenian's relative —General Gregory Pterot— had a successful military career during his uncle's lifetime and, after his assassination, attempted to join the revolt of Thomas the Slav. Michael the Amalekite served four emperors, from Michael I () to Theophilus (), in the ranks of protostrator, strategus of the Armeniacon, and domestikos of the schola. In 896, Nakharar Melias (), known in Byzantine sources as Melia and possibly the grandson of Ishkhan Varažnunik, entered Byzantine service. In 908, Mlekh was commissioned to rebuild the fortress of Likand and the garrisons in its vicinity, leading many Armenians to move to this region. In 916, a theme was organized here, whose army participated in another failed battle against the Bulgarians. Mlekh himself, \"thanks to the loyalty he showed to the Vasileus of the Romans and his many endless exploits against the Saracens\", was honored with the title of Master.\nIn the formation of the theme a military-administrative system, the Armeniac Theme was created as one of the first, but the dating of this event is a debated. In the 7th century, the epithet \"God-protected imperial\" (Ancient Greek: θεοφύλακτος βασιλικός) was applied to this theme, indicating its special “elite” status. From the end of the 9th century, the combat effectiveness and role of the old theme diminished, with their decline continuing until the 1030s. In the 10th century, a prominent military figure of the empire was the Armenian John Kourkouas, a representative of the Kourkouas family. Based on the assumption that the military contingent of Armeniacon consisted mainly of Armenians and that its size was between 18,000 and 23,000 people, we can estimate that the share of Armenians in the Byzantine army of the 9th–11th centuries was about 20%.\nHowever, sources testify that Armenians were not the most disciplined part of the Byzantine army during certain periods. In an anonymous military treatise, De velitatione bellica, attributed to Emperor Nikephorus II, it is especially noted that “Armenians are not good and are careless in fulfilling the position of guards”. They often deserted and did not always obey orders. During the Battle of Manzikert (1071), which ended in a disastrous defeat for the Byzantines, the Armenian contingent of the army deserted. The reasons for this low loyalty can be explained by the incessant pressure in the religious sector.\nPlace in the society\nReligion\n]]\nIn the early 4th century, Armenia became a Christian community, and since then, the church became a powerful organization; its role was particularly important in periods of loss of state autonomy. Armenia did not recognize the decisions of the Ecumenical Council of Chalcedon in 451, thereby breaking away from the church of the rest of Byzantium. Although the Armenian Church accepted the Christological formula of Cyril of Alexandria, the condemnation of the Council of Chalcedon made it monophysite, i.e., heretical from the perspective of Constantinople. In turn, the Armenian Church considered the supporters of the Council of Chalcedon as Nestorians, i.e., supporters of the heresiarch Nestorius, who was condemned by the Council of Ephesus (431). Since public service presupposed the adoption of the state religion, most of the known Armenians in the service of the empire were Chalcedonites.\nAttempts to restore ecclesiastical unity were made in the early 7th century, again in the 9th century by Patriarch Photius, and in the 12th century in relation to Cilician Armenia. For example, in the middle of the 9th century, on the eve of the recognition of the independence of the Bagratid Armenia by the Caliphate and Byzantium, the Empire, through Patriarch Photius, raised the dogmatic question, suggesting that Armenians accept Chalcedonism. The Council of Shirakavan, convened around 862 and headed by Catholicos Zacharias I of Armenia, rejected this proposal. Inter-confessional contradictions sometimes escalated to such an extent that in the middle of the 10th century, the Armenian Catholicos Ananias Mokatsi asked King Abas of Armenia to ban marriages with Chalcedonites.[https://www.pravenc.ru/text/114754.html Анания Мокаци]  // Православная энциклопедия. М., 2000. V. 2. P. 223.\nPersecution of non-Chalcedonites, including Armenians and Syriacs, intensified in the 11th century. In 1040, relations between Greeks and Syrians in Melitene escalated, prompting the patriarch of Constantinople to respond by condemning marriages between Orthodox and Monophysites. In 1063, Constantine X Doukas ordered all those who did not recognize the Council of Chalcedon to leave Melitene, and a few months later, the liturgical books of the Syrian and Armenian churches were burned. In 1060, Catholicos Khachik II and several bishops were summoned to Constantinople and forcibly detained until 1063. The dogmatic issue became acute again in the 12th century under Catholicos Nerses IV Shnorali. The Church Council convened in 1179 by Catholicos Gregory IV condemned the extremes of Monophysitism but rejected the doctrine of two wills and two influences, affirming the Armenian Church's interpretation of the one hypostasis of God the Word Incarnate. In the words of Vardan the Great, “They wished for the unity of the two peoples: Greeks and Armenians; but the enterprise failed, as can be seen in the detailed accounts of historians”.\nThe heretical Christian movement of the Paulicians, originating in the 6th or 7th century, spread throughout the regions of Byzantium populated by Armenians. Armenians were probably the majority among the followers of this doctrine, which's name has Armenian origin. The Paulicians were constantly persecuted; the state founded by them in Western Armenia was destroyed by Emperor Basil I in 872, and more than 100,000 sectarians were killed.\nRelationship with other ethnic groups\nTogether with the Jews and Italians, the Armenians were one of the three most economically wealthy groups in the Byzantine Empire. The author of Historical Dictionary of Byzantium, J. Rosser, notes that Armenians became the most adapted ethnic group in Byzantium, who, at the same time, preserved their original literature, religion, and art.\nSome historical sources testify to a certain distrust and even prejudice of the Byzantines towards Armenians. Many Byzantine writers considered it necessary to point out that some prominent persons of the empire were Armenians or of Armenian origin. The fact that the tension between Armenians and Greeks was not only caused by religious differences is evidenced by a 9th-century epigram attributed to the nun Kassia, which states that “the Armenian race is the most horrible”. In 967, according to the Byzantine historian Leo the Deacon, “a massacre took place between the inhabitants of Byzantium and the Armenians”. The example of hostility between the Greek and Armenian populations of the empire is well known in the Armenian colony near the city of Abydos. The discontent of the local Greeks was probably caused by the resettlement of Armenians from other regions after the conquest of Anazarbus from the Crusaders by John II Komnenos in 1138. When, after the sack of Constantinople in 1204, Henry I of Flanders crossed into Anatolia to continue his conquests for the Latin Empire, the Armenians of Abydos helped him take the city. Henry then entrusted them with the defense of the city, and the Armenians followed him after leaving Anatolia. Villardouin's chronicle reports that 20,000 Armenians migrated to Thrace, where they were overtaken by the vengeance of the Greeks. According to the historian J. Laurent (Les origines médiévales de la question arménienne, 1920), this example reflects the general attitude of Armenians towards the empire, as they were not Hellenized like other peoples of the empire but retained their cultural and religious identity. According to the same author, the Armenians betrayed Byzantium in the face of the Seljuks' invasion, thus contributing to their success.\nCultural interactions\n[[File:Orchomenos 30 C.jpg|left|thumb|The church at Skripu (874) contains Armenian elements both in architectural plan and ornamentationMakris E. Греция. [https://www.pravenc.ru/text/166461.html Часть II: Архитектура // Православная энциклопедия]. М., 2006. V. XII : Гомельская и Жлобинская епархия — Григорий Пакуриан. pp. 391—427. ]]\nThe influence of Byzantine culture on the formation of Armenian medieval culture was very significant. This was most notably manifested in literature, where Armenian literature was influenced both directly by Byzantine and Syriac literature, which, in turn, was largely shaped by it. Theological literature and scientific works from all spheres of medieval knowledge were translated from Greek. Through many generations of translators from the so-called Hellenizing School, Armenian readers gained access not only to works of classical philosophical thought but also to original Armenian creations. According to N. Y. Marr, in the 7th and 8th centuries, the educated Armenian society was fascinated by philosophy. The Neoplatonist David the Invincible wrote and lectured in Greek. Additionally, many borrowings from Greek were introduced into the Armenian language, which later entered the New Armenian language. Greek culture was primarily accessible to the clergy, but secular admirers of ancient culture in Armenia are also known, such as the 11th-century scholar Grigor Magistros. At the same time, it is acknowledged that Armenian culture had an impact on Byzantine culture. The well-known Armenologist R. M. Bartikyan notes a significant Armenian element in the Byzantine epic about Digenis Akritas, many of whose ancestors were of Armenian origin.\nmotif on the cover of the Gospel of Catholicos Constantine I of Cilicia. Rumkale (Cilician Armenia), 1254]]\nIn the field of silver production, the Byzantine influence on Armenian jewelry art was first brought to the attention of the 19th-century French Armenist A. Carrier. This idea was further developed in the works of G. Hovsepian, S. Der Nersessian, A. Kurdanyan, A. Khachatryan, and N. Stepanyan. Nevertheless, according to A. Y. Kakovkin, the majority of Armenian monuments of silverwork from the 11th to the 15th centuries, despite the presence of points of contact, exhibit a vivid originality and independence from Greek works. In addition to jewelry art, Byzantine elements (for example, the Deesis motif) entered other branches of fine arts in Armenia, particularly miniature painting. The Byzantine influence becomes most noticeable in the miniatures of Cilician Armenia during the late 12th to early 13th centuries.\nIn Armenian sculpture, the Byzantine influence is much less noticeable, as stone sculptures were not widespread in Byzantium, where brick buildings predominated. Der Nersessian believes that, conversely, one can find traces of Armenian sculpture's influence in Byzantium, especially in the monuments of Greece, Macedonia, and Thrace. The earliest examples are found in Boeotia, in the church of Gregory Nazianzus in Thebes from 872 and in the church of the Holy Virgin in Skripu from 874, where reliefs depict motifs of birds and animals enclosed in medallions, typical of Armenian sculptures. Nevertheless, Byzantine motifs, such as ‘imperial eagles,’ can be found in the sculptures of Zvartnots. The question of interrelations in the field of architecture is rather complicated. In the early 20th century, N. Y. Marr pointed out the influence of Byzantine Syria on Armenian architecture in the 5th and 6th centuries, using the example of the Yererouk basilica. Later, I. A. Orbeli stated that \"the first architectural monuments (almost the only heritage of the oldest Christian art of Armenia) have a purely Syrian character”.\nwith eagles from the Zvartnots Cathedral. Stylistically the closest to them are objects of Byzantine imperial art]]\nA. L. Yakobson has repeatedly addressed the question of architectural influence, using the Jererui and Tekora basilicas as examples to illustrate the common features they share with Syrian buildings, such as the presence of towers on either side of the entrance and galleries with porticoes along the northern and southern sides of the temples. This researcher also identifies elements of Syrian architecture in secular buildings, specifically the palaces in Dvina and Arucha. In contrast, S. H. Mnatsakanyan argues for the potential influence of Armenian cross-in-square temples, which he attributes to the Echmiadzin monastery, on the development of Middle Byzantine cross-in-square architecture. Byzantine features can also be observed in the Zvartnots temple, built in the early 640s during the Byzantine occupation of Armenia. However, as noted by American expert on Armenian architecture K. Maranzi, the specific characteristics of this similarity have not been thoroughly investigated. Several researchers have pointed out that the resettlement of Armenians to the western regions of Byzantium left a significant mark on the architecture of the area. As early as 1899, Auguste Choisy highlighted the influence of Armenian architecture in the Balkans, particularly in Serbia. The rose patterns found in Serbia, which are unique to the region, are sometimes attributed to connections with Armenian, Georgian, or Islamic architecture. Contacts with Armenian architecture can be observed in the designs of churches such as Hagia Sophia, the Holy Virgin in Skripu, and in the brickwork of Pliska. By the end of the 13th century, architectural traditions in the highland regions of Asia Minor underwent significant changes, likely influenced by Armenia or Georgia. The French art historian Gabriel Millet pointed out that Greek architecture exhibited more inspiration from Anatolian and Armenian designs than from Constantinopolitan architecture, highlighting important differences between the churches of Greece and Constantinople. Joseph Strzygowski argued that Byzantine architecture in the 11th century adopted several characteristic features of Armenian architecture, although his views remain controversial. K. Toumanoff further notes that Armenian architects achieved international recognition during this period. For example, one of the most renowned architects of his time, the Armenian architect Trdat, was responsible for the restoration of the dome of Hagia Sophia in Constantinople, which had been damaged by an earthquake. Later, he went on to construct the Ani Cathedral. Research conducted on the dome of Hagia Sophia revealed some unique structural solutions implemented by Trdat; however, there are no known examples of these techniques being applied in other Byzantine churches. Additionally, the Armenian buildings designed by Trdat did not exhibit significant features characteristic of Constantinopolitan architecture.\nReferences\nBibliography\nPrimary sources\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\nResearches\nIn English\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\nIn Russian\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\nIn French\n*\n*\n*\n*"
    }
  ]
}