{
  "content": [
    {
      "type": "text",
      "text": "# Armenian Christian tradition in the 20th century\n\nThe exploration of Armenian Christian tradition during the 20th century has spanned multiple disciplines, including architecture, archaeology, literature, and ethnology. Following the war, access to relics of Armenian civilization in Western Armenia was restricted and remained challenging until recently. In Eastern Armenia, the study of Christianity was hindered during the Soviet era.\nChristianization of Armenia\nThe Christianization of Armenia occurred in two phases. Initially, during the second and third centuries AD, Aramaic-speaking missionaries from Mesopotamia introduced Christianity to the southern Armenian provinces, influenced by the Syriac tradition of Edessa. This influence left a lasting impact on Armenian language, liturgy, and Church practices.\nThe second phase of Christianization was spearheaded by Gregory the Illuminator in the early fourth century. His evangelizing efforts, particularly in northern Armenia, were influenced by the Microasiatic Christian tradition. The Greek element gradually became predominant, shaping the ecclesiastical culture of the Armenian kingdom.\nJoseph Marquart contributed significantly to the understanding of the origins of the first Armenian bishoprics and the historical geography of the Armenian Church. The Life of St Gregory serves as a primary source regarding the conversion of the Armenian kingdom.\nDevelopment of an Armenian literary tradition\nDespite the use of Aramaic and Greek in Armenia for centuries, the limited knowledge of these languages necessitated the translation of religious texts into Armenian. The invention of the Armenian alphabet by Mashtots‛ around 405 facilitated the development of a national literary tradition, drawing initially from Syriac and Greek sources before producing original works.\nScholars have extensively studied Mashtot's life and the circumstances surrounding the invention of the Armenian alphabet. The relations between South Caucasian Churches in the fourth and fifth centuries, the primacy of Gregory the Illuminator's see, and similarities among the Armenian, Georgian, and Albanian alphabets support claims made by Mashtots's pupil and biographer Koriun.\nIndependence and development of the Armenian Church\nAt the Council held at the patriarchal see of Dvin in 553, the Armenian Church affirmed its rejection of the \"Definition\" of the Council of Chalcedon in 451, thereby establishing an independent ecclesiastical history. This detachment from Byzantine theological doctrines led to unique Christological inquiries and allowed for independent liturgical developments, fostering the incorporation of local customs within ecclesiastical discipline. Armenia's particularism was further emphasized in the late seventh century when direct political control by the caliphate isolated Armenia from the broader body of Christendom.\nAdvances in twentieth-century Armenian studies\nin Vienna, Austria.]]\nThe study of Armenian religious tradition in the twentieth century saw significant advancements, particularly in the cataloging, description, and editing of manuscripts. The Armenian Mekhitarist congregation in Venice and Vienna played a crucial role in this regard, with monks traveling extensively to compile two important collections of Armenian manuscripts. Their efforts brought ancient Armenian literature to the attention of European scholars. Noteworthy figures in this field include Galust Ter-Mkrtchyan, who edited various Armenian writers' works, and René Graffin, who pioneered the editing of Armenian texts in France.\nGraffin's contributions included the establishment of the Patrologia Orientalis series, which aimed to edit texts from languages of the Christian East, including Armenian. Through innovative techniques such as photography for manuscript copying and designing letters for various languages, Graffin facilitated the publication of previously unpublished manuscripts. Louis Mariès, entrusted with editing Armenian texts, made significant contributions to the study of Armenian Church history. His student, Charles Mercier, focused on Armenian patristic texts, particularly those related to exegesis and the fifth-century figure Eznik of Kolb.\nMercier collaborated with Mariès in preparing a collation of Eznik's manuscripts, publishing their work after Mariès' passing. This collaborative effort, along with the contributions of other scholars, furthered the understanding of Armenian religious literature and theology in the twentieth century.\nScholarly contributions to Armenian studies\nIn 1903, Jean-Baptiste Chabot established the Corpus Scriptorum Christianorum Orientalium (CSCO) collection in Paris, a venture independent from René Graffin's efforts. The disagreement between Graffin and Chabot centered on methodological approaches to editing ancient texts, with Graffin advocating for reconstructing texts close to the original through manuscript collation, while Chabot argued for selecting the best-preserved text. This debate remains ongoing among editors of ancient texts. Chabot directed the collection until his death, overseeing the inclusion of Armenian patristic texts, which played a significant role in the study of ancient Christian civilizations.\nArmenian studies also flourished in England, where Frederick Cornwallis Conybeare made notable contributions. Conybeare's research extended to the dualist sect of the Paulicians, which emerged in Western Armenia during the eighth and ninth centuries. The Paulicians and their offshoot, the Thondrakites, rejected established ecclesiastical and political institutions, facing persecution in Armenia and Byzantium. Their doctrines and potential influence on later movements like the Bogomils and Cathars have been subjects of scholarly inquiry.\n, Catholicos of All Armenians (from left: Varazdat Harutyunyan, architect Baghdasar Arzoumanian and Karekin I).]]\nThe systematic exploration of Armenian ecclesiastical and monastic architecture began in the early twentieth century. Khatchig Dadean initiated excavations at the ruined Cathedral of the Vigilant Powers near Etchmiadzin, followed by Toros Toramanian's extensive documentation and classification of Armenian architectural monuments.\nIn Vienna, Josef Strzygowski investigated the interaction between architectural traditions of various Christian cultures, including Syriac, Armenian,\nCoptic, Ethiopic, and Arabic. Strzygowski's collaboration with Toros Toramanian in Armenia resulted in publications such as \"Architecture of the Armenians and Europe,\" which sparked debates on Oriental influences in Byzantine and Western European architecture.\nDespite hindrances caused by World War I and subsequent political barriers, significant fieldwork continued in Soviet Armenia, led by scholars such as Varazdat Harutyunyan, Aleksandra Eremyan, and Armen Khachatryan, contributing to the understanding of Armenian architectural heritage.\nExploration of ancient Armenian mythology and language\nThe presence of an Urartian irrigation canal still in use in medieval Armenian Van highlights a remarkable continuity between Urartian and Armenian cultures. Moses of Khoren is among the few sources for Armenian pre-Christian myths, providing insight into the origins of the Armenians. The appearance of the Armenian language and its isolated position on the Armenian plateau continue to puzzle linguists and historians of the ancient Near East.\nIn St. Petersburg, Marr established three significant periodical series dedicated to Caucasian studies, including Xristianskij Vostok (The Christian Orient), which was later reinstated in Moscow after being suppressed under Soviet rule. Marr, a professor at Petersburg University, mentored Nikolaj Adontz, who hailed from a small village in the Zangezur district.\nFollowing the Russian conquest in 1916, Adontz participated in excavations at Muš, Karin (Erzurum), and the Urartian capital, Van, alongside Marr, Y. Orbeli, T‛oramanean, and K‛alant‛ar. Adontz investigated the survival of Urartian elements in Christian Armenian culture, a topic further explored by his disciple Cyril Toumanoff and other art historians examining possible Urartian influences on Armenian architectural techniques and forms.\nAdontz emerged as one of the most versatile and influential scholars in Armenian studies. In 1920, he left Soviet Russia and conducted research in London and Paris under challenging economic conditions. In 1930, he was appointed head of the Department of Armenian Studies at the Institut de philologie et d’histoire orientales et slaves in Brussels. However, following the German occupation and the subsequent closure of the university, Adontz passed away under desperate circumstances. His prominent pupil, Cyril Toumanoff, born in St. Petersburg, experienced early hardship, losing his mother to Bolsheviks and seeking refuge with his grandparents. Toumanoff eventually became a professor at Georgetown University in Washington, D.C., before retiring to Rome.\nUrartian influence on Armenian civilization\nUrartu played a significant role in shaping early Armenian civilization, although after its fall to the Medes in the sixth century BCE, the Iranian world\nby Argishti.]]\nexerted considerable influence on Armenian culture. Adontz and Toumanoff extensively studied the Iranian elements in Armenian and Georgian societies and their impact on Armenian historiography. Their work paved the way for subsequent scholars such as Nina Garsoïan and James Russell to explore the enduring Iranian influence on Armenian institutions and hagiography.\nThe Aramaic-speaking world, Armenia's southern neighbor, also influenced Armenian civilization until the suppression of Armenian and Syriac presence in eastern Anatolia in 1915. Scholars like Paul Peeters investigated early relations between Syriac Christianity and Armenia, shedding light on the genesis of Armenian hagiography.\nKarapet Ter-Mkrtchyan, another notable figure, made significant discoveries in Armenian manuscripts and published studies on Armenian doctrinal writers and the history of the Armenian Church. He uncovered Armenian translations of lost Greek texts and contributed to understanding Armenian doctrinal development.\nStudies have also examined the Armenian Church's relations with neighboring churches, including the Aluanian, Georgian, Byzantine, and Western Syriac Churches, as well as the Church of the East. Eruand Ter-Minaseanc dedicated his work to the Armenian-Syriac Church relations and the history of Armenian synods. His contributions enriched the understanding of Armenian theological developments despite challenges posed by the Soviet regime.\nAdvances in Armenian studies\nNerses Akinean, a distinguished Armenian philologist, extensively researched various aspects of Armenian Christianity. He investigated Timothy Aeluros' significance in Armenian Church doctrine and the seventh-century relations between the Armenian and Georgian churches. Akinean's efforts included collecting dispersed manuscripts and describing Armenian manuscript collections worldwide, despite enduring imprisonment and health challenges during his work in Armenia under Soviet rule.\nHamazasp Oskean, a disciple of Akinean at the Mekhitarist monastery in Vienna, dedicated several decades to studying Armenian monasteries and their traditions, producing a monumental series spanning ten volumes. Vahan Inglisian, another pupil of Akinean, focused on the Christological conceptions of key figures in stabilizing the Armenian Church's doctrine post-Arab conquest. He also provided refuge to displaced persons within his monastery during National Socialism.\nIn the second half of the 20th century scholars delved into the process of separation between the Armenian Church and the Church of the empire, as well as the subsequent division between the Armenian and Georgian Churches. Pӓłos (Anton) Ananean published significant studies on the Christianization of Armenia and the Armenian Church's relations with the Church of the empire. Jean-Pierre Mahé explored the Armenian Church's interactions with neighboring churches and its role in shaping national identity during the early Middle Ages.\nAdvances in Armenian liturgical studies\nThe study of liturgical texts saw significant advancements, with scholars like Vardan Hacuni, Karapet Amatuni, and Yovhannes Mécérian investigating various aspects of Armenian liturgy and ecclesiastical institutions. Charles Athanase Renoux contributed numerous studies to Armenian liturgy, while Carl Anton Baumstark introduced innovative methods for the comparative study of liturgies.\nDespite the challenges posed by Soviet rule, scholars like Paolo Cuneo and Jean-Michel Thierry risked personal safety to explore the Armenian heritage of Eastern Turkey. Their expeditions and scholarly descriptions of monuments added to our understanding of Armenian ecclesiastic and monastic architecture.\nPreservation and cataloging of Armenian manuscripts\nand his disciple Koryun by Ghukas Chubaryan (1962).]]\nNorayr Połarean and Levon Xatikyan played crucial roles in cataloging and preserving Armenian manuscripts. Połarean's detailed catalog of manuscripts at the St. James of Jerusalem convent enriched our knowledge of Armenian ecclesiastical culture, while Xatikyan's leadership at the Matenadaran ensured the preservation and study of thousands of Armenian manuscripts, making it the richest collection of its kind in the world. Artašes Matevosyan's work at the Matenadaran further contributed to reconstructing the history of medieval Armenian scriptoria. One of the peculiarities of Armenian manuscripts is the extensive colophons, the marginal notes made by the medieval copyists. These notes often represent unique sources for historical events, written directly by eye-witnesses. In company with his colleagues, L. Xatikyan published a long series of unedited sources and, notably, a collection of colophons of the Armenian manuscripts preserved in the Matenadaran. He elaborated theoretical principles for the editing of colophons. This and other collections of Armenian colophons represent a priceless resource. To give an example: recently, the Italian Institute of Geophysics  published a history of earthquakes in the Mediterranean area reconstructed on the basis of ancient witnesses, in which references to Armenian colophons appear frequently. This valuable data may enable us to foresee future seismic events. The study of the heritage of Christian Armenia thus also contributes to the reconstruction of the physical history of the Near East.\nThe extensive colophons found in Armenian manuscripts, often written by medieval copyists, serve as unique historical sources, providing firsthand accounts of historical events. Levon Xatikyan and his colleagues undertook the publication of many previously unpublished sources, including a collection of colophons from Armenian manuscripts housed in the Matenadaran. Xatikyan also developed theoretical principles for editing colophons, making them more accessible for scholarly study.\nThese collections of Armenian colophons are invaluable resources for researchers. For instance, the Italian Institute of Geophysics used references from Armenian colophons to reconstruct the history of earthquakes in the Mediterranean region. Such data not only enriches our understanding of historical events but also contributes to predicting future seismic activity. Thus, the study of Christian Armenian heritage plays a vital role in reconstructing the physical history of the Near East.\nFile:Stgregoryilluminator.jpg|14th-century Byzantine icon of St. Gregory\nFile:The_Right_Hand_of_St_Gregory_the_Illuminator.jpg|The Right Arm of Gregory in the museum of the Holy See of Cilicia in Antelias, Lebanon\nFile:2014_Erywań,_Katedra_św._Grzegorza_Oświeciciela_(05)_cropped.jpg|Saint Gregory the Illuminator Cathedral, Yerevan, completed in 2001, contains the remains of Gregory\nReferences"
    }
  ]
}