{
  "content": [
    {
      "type": "text",
      "text": "# Armor Wars\n\nArmor Wars (film)}}\n|artists        =\n|pencillers     =\n|inkers         = Bob Layton\n|letterers      = Janice Chiang\n|editors        = Mark Gruenwald\n|colorists      =\n|TPB            = Iron Man: Armor Wars\n|ISBN           = 0-7851-2506-X\n|cat            = Iron Man\n|sortkey        = Armor Wars\n|nonUS          =\n}}\n\"Armor Wars\" is a seven-issue Iron Man story arc written by David Michelinie and Bob Layton with art by Mark D. Bright, Barry Windsor-Smith, and Layton, and published by Marvel Comics. The arc first appeared in Iron Man #225–232.\nPublication history\nWhile \"Armor Wars\" is the popular name for the storyline, the name of the trade paperback collection, and the name used in-universe to refer to the corresponding fictional events (in Captain America #401, for example), the story was originally referred to as \"Stark Wars\" within the issues themselves. The name \"Armor Wars\" stems from the full-page advertisements in other Marvel titles reading: \"TIME FOR THE AVENGER TO START AVENGING. THE ARMOR WAR BEGINS IN IRON MAN #225.\" The storyline ran through Iron Man #225 (December 1987) to #231 (June 1988), plotted by David Michelinie and Bob Layton with art by Mark Bright and Layton, though much of the groundwork for the story occurred during Iron Man #219-224. Iron Man encounters the Spymaster, who steals the Stark technology. Iron Man also encounters Force, which sets up the plot of \"Armor Wars\" in the following issues.\nAn epilogue to the storyline was published in Iron Man #232 (July 1988), co-plotted by Michelinie and Barry Windsor-Smith with art by Windsor-Smith and Layton.\nIn What If...? Volume 2 no. 8, released in 1989, Marvel Comics directly refers to this storyline as \"Armor Wars\", rather than Stark Wars.\n\"Armor Wars II\" followed in issues Iron Man #258 (July 1990) to #266 (March 1991), with each issue's cover bearing an \"Armor Wars II\" header. The original \"Armor Wars\" did not have headers on the issues; \"Stark Wars\" appeared only in the interiors.\nPlot\nPart One: Stark Wars\nAfter Iron Man finishes a training session in order to impress a general, he returns to Stark Enterprises. Upon analyzing Force's armor, Tony discovers that the armor is based in part on his own designs which were stolen before his current Iron Man armor was developed. He compiles a list of several armored criminals: Beetle, Shockwave, Doctor Doom, Stilt-Man, the Crimson Dynamo, Controller, Mauler, Professor Power, Titanium Man, the Raiders, and others. Distraught about the damage his technology might inflict, Iron Man teams up with Scott Lang to find out who stole his designs. With information from Force, Tony uncovers that the Spymaster was the one who sold Tony's designs to his rival Justin Hammer. Iron Man goes after Stilt-Man, who is attempting to break into a high-rise office building, and renders the armor inoperable with a negator pack which destroys Stark circuitry. A short time later, Iron Man gets Mauler to surrender his battlesuit without a fight and then defeats the Controller and negates his armor. Unable to pursue legal means to reclaim his technology, Tony plans to take out every armored warrior who is suspected of having his designs.\nPart Two: Glitch\nIron Man intercepts and negates the Raiders, and later finds out one name is missing from Hammer's database due to a glitch in the upload. Tony and Jim Rhodes run a search of other armor-using individuals, which prompts Tony to identify the government-sponsored Stingray as the best candidate, as other known armored heroes and villains are either not advanced enough or would not use others' designs. Tony's actions draw the West Coast Avengers' attention, but he declines the Avengers' offer of assistance, saying that his problems are personal. Iron Man travels to the Hydro-Base, where he confronts Stingray and insists that he be allowed to test his armor for stolen circuitry. When Stingray refuses, Iron Man chases him throughout the ocean and incapacitates him. He then unsuccessfully attempts to negate Stingray's armor; Stingray's armor really was not based on Stark's designs. Due to this incident, Tony is informed that the government wants Iron Man to be shut down. Reluctantly, Tony announces that Iron Man's contract has been terminated.\nPart Three: The Last Mandroid\nIron Man ruthlessly attacks Beetle as he tries to steal exotic pieces of art. Beetle attempts to escape Iron Man's wrath, but is defeated and his armor negated. Iron Man returns to his base, where he has a talk with Hawkeye. Nick Fury of S.H.I.E.L.D. meets with Tony and demands that Iron Man be handed over to him for attacking Stingray. Tony gives Fury Iron Man's file, having prepared a fake identity for Iron Man as \"Randall Pierce\" in the event of such a scenario. Tony secretly intends to destroy S.H.I.E.L.D.'s Mandroid armors - which he also designed - to prevent their technology being replicated. He tells Fury that 'Pierce' has set up a hidden base in New York and suggests Fury dispatch the Mandroids to bring Iron Man in. Tony, as Iron Man, engages the Mandroids and disables all five, much to Fury's dismay. Tony fakes evidence to suggest that Iron Man knew about their plan because he planted a bug in their equipment. Later, Tony arranges to create a new shield for Captain America.\nNote: The \"Nick Fury vs S.H.I.E.L.D.\" mini-series hinted the \"Fury\" in this story was a Life Model Decoy, the real Fury claiming to have no idea of these events.\nPart Four: Who Guards the Guardsmen?\nThe Captain (an alias used by Steve Rogers at that time) thanks Tony for the new shield, but after having learned of Tony's crusade, he tries to dissuade him from continuing. Meanwhile, Rhodes, disguised as the villain Electro, lets himself get captured by the Guardsmen to infiltrate the Vault. Iron Man sneaks into the prison to neutralize the Guardsmen, but is followed by the Captain and engaged by several Guardsmen. Rhodes accidentally breaks out all the prisoners like Mister Hyde and Titania at the Vault after he tricks a Guardsman who ambushed him. While the Captain tries to save a Guardsman from dying, Iron Man temporarily paralyzes him, but the reproachful look Rogers gives him in turn gnaws at his conscience.\nPart Five: Red Snow\nThe West Coast Avengers arrives at Tony's home, where they try to make Tony stand down, which he refuses. In the Soviet Union, Crimson Dynamo and Gremlin (as the Titanium Man) meet with the KGB, who tell them of Iron Man's crusade and that he will soon come for them as well. Gremlin refuses to heed the warning and departs for his hidden base Bitterfrost, thereby unintentionally making himself a bait for Iron Man. Tony constructs a modified version of the Stealth armor to sneak into Russia undetected and go after Titanium Man. The KGB sends the Crimson Dynamo in to take out Iron Man and the Gremlin, distracting Iron Man and giving the Gremlin time to enter his Titanium Man armor. Iron Man defeats and negates the Crimson Dynamo, but is overwhelmed and grabbed by Titanium Man. Iron Man flies up to space to try to shake him off, but his boot jets ignite Titanium Man's armor, which combusts, apparently killing the Gremlin. Back at the West Coast Avengers Mansion, Iron Man is stripped of his Avengers membership.\nPart Six: The Day the Hero Died\nEdwin Cord, Tony's rival, demonstrates his Firepower armor, piloted by Jack Taggert, to his sponsors Senator Boynton and US Army General Maede regarding the US Government's plan to neutralize rogue superheroes, starting with Iron Man. After safeguarding his technology from later thefts by introducing a \"tapeworm\" virus into the worldwide computer network, Tony discovers that Firepower is the missing name from Hammer's list. Later, Maede asks Tony to help lay a trap utilizing Firepower against Iron Man, and Tony decides to spring it in order to eliminate this final security risk. But as he encounters Firepower, he finds himself heavily outgunned and barely escapes with the help of Rhodes. But when the military prepares to continue the attack, thereby putting Rhodes' life at risk, Tony sends out the empty Iron Man armor by remote control. Firepower launches a nuclear missile at Iron Man, seemingly killing him.\nPart Seven: Reborn Again\nWith Iron Man officially declared dead, Tony refuses to construct new armor, deciding to let his Iron Man identity rest. Elsewhere, Boynton and Maede try to make Cord hand over Firepower, but Cord blackmails them by threatening to leak their plans about using Firepower as a means of crowd control to the public, should they try any form of legal action against him. Firepower then disrupts Stark Enterprises' commercial operations and reveals to Tony that Cord wants revenge on both Tony and Iron Man for destroying Cord Conglomerate. Determined, Tony invents another version of the Iron Man armor to combat Firepower. Days later, Firepower attacks Stark Enterprises' San Francisco bureau, only to face off against the \"new\" Iron Man. After a lengthy battle, Iron Man defeats Firepower, and an attempted taunt by Taggert makes him reconsider continuing as Iron Man.\nEpilogue: Intimate Enemies\nTony battles the Iron Man armor in a nightmare and has to come to terms with the innocent victims his company created and his struggle with alcoholism.\nCollected editions\nThe storyline was collected in a trade paperback in 1990. The book was re-released in 2007, with a new cover (). The book collects issues #225-#231 as well as the epilogue to the story presented in issue #232.\nIron Man #215-224 was published in a trade paperback titled Iron Man: Armor Wars Prologue on March 17, 2010 (). A collection of Armor Wars II (#258-266) was released in May 2010 ().\nOther versions\nBreaking Into Comics the Marvel Way\nThe first issue of the two-part new-artist-introduction series Breaking Into Comics the Marvel Way offers a final epilogue to the story. In the immediate aftermath of the Armor Wars, Tony Stark makes a video recording of his last will and testament. In his will, Tony explains his desire to see humanity changed for the better by advanced technology, but also expresses his horror and sense of guilt for the past misuse of technology that he created. Unwilling to allow for the possibility that his inventions might continue to be abused after he dies, Tony reveals that his death will automatically trigger 'Project Icarus': a computer program that will seize control of every Iron Man suit Tony has ever created, as well as every machine on Earth containing any Stark-developed technology, and set them all on a collision course with the sun.\nIron Man and the Armor Wars\nA 4-issue mini-series titled Iron Man & The Armor Wars, a modernization of the Armor Wars concept for a new audience, debuted in August 2009, written by Joe Caramagna with art by Craig Rousseau. A hardcover collection of the story was published in February 2010 (ISN 978-0-7851-4448-9).\nSecret Wars (2015)\nA new Armor Wars mini-series appears as part of the 2015 \"Secret Wars\" storyline. The Battleworld domain associated with this mini-series is called Technopolis where its inhabitants are forced to wear Iron Man armors due to a disease and will have that area's Tony Stark and Arno Stark as rival manufacturers.\nUltimate Marvel\nA four-issue mini-series titled Ultimate Comics: Armor Wars began in September 2009. It is written by Warren Ellis. It takes place after \"Ultimatum\" where Iron Man tries to find his remaining armors and save his enterprise.\nWhat If?\nThere was an issue of \"What If\" titled \"What If Iron Man Lost the Armor Wars\" in which Scott Lang and his daughter Cassandra are captured and used as hostages by Hammer. When Tony Stark dons his Iron Man armor, Justin Hammer takes control of it and forces Stark to place a mind-control collar on himself. Hammer then makes Stark destroy his own enterprise and reveal his identity to the world. Just then, A.I.M. kidnaps Hammer, enabling Stark to go into hiding. A.I.M. then goes after every armor using Stark technology, killing two of the Raiders. Tony meets up with Controller, Mauler, Stilt-Man, Beetle, Titanium Man, Crimson Dynamo, and the surviving Raider to infiltrate the A.I.M. Omega Branch, where Tony takes control of the Firepower armor to defeat A.I.M. When he suggests to the armored villains to turn themselves in, they attack Stark, only to be stopped by Captain America, Wonder Man, and Hank Pym. Hawkeye tells Stark that they will have to take him into custody. Rather than attack the heroes, Stark surrenders himself, for he knows that if he did attack, Hammer would have won.\nIn other media\nTelevision\n* The \"Armor Wars\" serves as inspiration for a self-titled two-part episode of Iron Man (1994). In this version of events, the Ghost steals the armor designs from Stark Enterprises on Justin Hammer's behalf. After receiving and analyzing the remains of Crimson Dynamo's armor, Tony Stark suspects that other armored individuals might be using his armor designs and tasks his A.I. H.O.M.E.R. with identifying which ones. With this information, a paranoid Iron Man uses negator packs on the Controller, the Beetle, Stilt-Man, Blacklash, Blizzard, the Guardsmen, and War Machine. After attacking Stingray and discovering his armor was not based on his designs, Stark is attacked by the Hammer Industries automaton Firepower, though Stark eventually destroys it and deletes files on his armor designs from Hammer Industries' mainframe. Additionally, Hawkeye appears in Captain America's place at the Vault.\n* The \"Armor Wars\" serves as inspiration for the second season of Iron Man: Armored Adventures. After the Ghost steals Tony Stark's armor specs, he sells it to Justin Hammer and Obadiah Stane. Using the specs, Hammer becomes Titanium Man while Stane creates the Guardsmen - Force, Shockwave, and Firepower - and builds the Iron Monger mech. Additionally, Doctor Doom, Hawkeye, and Black Widow attempt to claim Stark's technology. Nonetheless, Stark fends off his enemies, deletes his stolen specs, and personally sees Stane ousted from Stark Industries.\nFilm\nThe \"Armor Wars\" serves as inspiration for films set in the Marvel Cinematic Universe (MCU).\n* In the film Iron Man 2, Tony Stark's alcoholism coupled with fears of his technology being duplicated prompts the U.S. government to attempt to appropriate his armor for their own use. Despite Stark's claims that his nearest rivals are decades away from perfecting the technology, Ivan Vanko constructs an arc reactor as a power source for his own armor. In addition, rival industrialist Justin Hammer seeks to build his own variations of Stark's armors, which Vanko remodels into remote-control weaponized automatons called \"Hammerdrones\".\n* An Armor Wars film was announced in September 2022. The film will see James Rhodes / War Machine (portrayed by Don Cheadle) being tasked with safeguarding Stark Industries from other rival companies and opportunistic parties seeking to obtain or appropriate Stark's legacy for nefarious means following his death in Avengers: Endgame.\nVideo games\n\"Armor Wars II\" serves as loose inspiration for The Invincible Iron Man.\nNotes\nReferences\nExternal links\n* [http://www.marvel.com/universe/Armor_Wars Armor Wars] at the Marvel Universe\n*"
    }
  ]
}