{
  "content": [
    {
      "type": "text",
      "text": "# Armoured regiment (United Kingdom)\n\nArmoured regiments are units provided by the Royal Armoured Corps of the British Army.\nHistory\nThe first armoured regiments - known at the time as \"tank battalions\" - were formed in the First World War, first in the Machine Gun Corps and later as the Tank Corps. Each battalion had three companies, each of three sections of four tanks, for a combat strength of thirty-six tanks; a further twelve were kept in reserve for training and replacement purposes. Twenty-six battalions were formed during the war, quickly reduced to four battalions after the end of hostilities.\nBy the late Second World War, there were four armoured regiments in each armoured division. One, the Division's Reconnaissance Regiment, was equipped with the Cromwell tank; the other three, which were in the Armoured Brigade, were equipped with the Sherman medium tank. An exception was the 7th Armoured Division's 22nd Armoured Brigade which had a mixture of Cromwells and Sherman Fireflys (Sherman fitted with 17pdr guns). Each regiment was formed of four squadrons, A, B, C and HQ. The lettered squadrons were made up of four troops of four tanks and a HQ troop. The HQ squadron was made up of command tanks and a reconnaissance troop of light tanks. In north-west Europe, during the battle of Normandy from June to August 1944, anti-aircraft tanks were part of the HQ squadron.\nThe 1998 Strategic Defence Review cut the number of armoured regiments to six, converting one of the existing regiments to the formation reconnaissance role and using the other to form the Joint Chemical, Biological, Radiation and Nuclear Regiment. As a part of this change, the six remaining regiments were expanded from a three-squadron structure with 38 tanks to a four-squadron one with 58. This structure is also known as the \"Type 58\" regiment. Under the 2003 Defence White Paper, this was reduced to five armoured regiments - the sixth converting to the formation reconnaissance role - with three armoured squadrons to be converted to \"light armoured\" squadrons, which would eventually be equipped with the Future Rapid Effect System.\nFollowing the 2003 defence review Delivering Security in a Changing World, five regular army regiments were equipped for the heavy armoured role: Of the five regiments, two were assigned to the 1st (UK) Armoured Division (The Queen's Royal Hussars and The Royal Scots Dragoon Guards) and three to the 3rd (UK) Mechanised Division (The Royal Dragoon Guards, 2nd Royal Tank Regiment and The King's Royal Hussars).\nType 58 armoured regiments;\n*The Royal Dragoon Guards - 58 Challenger 2s, 8 CVR(T) Scimitars.\n*The Queen's Royal Hussars - 58 Challenger 2s, 8 CVR(T) Scimitars.\nHeavy armoured regiments;\n*The Royal Scots Dragoon Guards (Carabiniers and Greys) - 44 Challenger 2s, 22 CVR(T) Scimitars.\n*The King's Royal Hussars - 44 Challenger 2s, 22 CVR(T) Scimitars.\n*2nd Royal Tank Regiment - 44 Challenger 2s, 22 CVR(T) Scimitars.\nTwo regiments of the Territorial Army, the Royal Wessex Yeomanry and the Royal Mercian and Lancastrian Yeomanry, provided replacement crews for the regular regiments. The 1st Royal Tank Regiment also operated a small number of Challenger 2 tanks for training and demonstration.\nStructure\nCurrently, they are battalion-sized formations equipped with Challenger 2 main battle tanks.\nThere are three Armoured Regiments, each equipped with 56 Challenger 2 tanks.\n;Armoured Regiments (Type 56)\n*Royal Tank Regiment (12th Armoured Brigade Combat Team)\n*King's Royal Hussars (12th Armoured Brigade Combat Team)\n*Queen's Royal Hussars (20th Armoured Brigade Combat Team)\nThe organisation of a Type 56 Armoured Regiment is:\n* 3 sabre squadrons, each with 18 Challenger 2 Main Battle Tank;\n* 1 command and reconnaissance squadron.\n* Headquarters Squadron\nBy April 2025, the King's Royal Hussars will lose their Challenger 2s, re-rolling to become an armoured cavalry reconnaissance regiment.\nThe Royal Wessex Yeomanry is an Army Reserve regiment that provides trained battlefield casualty replacements to the three main armoured regiments.\nReferences"
    }
  ]
}