{
  "content": [
    {
      "type": "text",
      "text": "# Art of This Century gallery\n\nThe Art of This Century gallery was opened by Peggy Guggenheim at 30 West 57th Street in Manhattan, New York City on October 20, 1942. The gallery occupied two commercial spaces on the seventh floor of a building that was part of the midtown arts district including the Museum of Modern Art, the Museum of Non-Objective Painting, Helena Rubinstein's New Art Center, and numerous commercial galleries. The gallery exhibited important modern art until it closed in 1947, when Guggenheim returned to Europe. The gallery was designed by architect, artist, and visionary Frederick Kiesler.\nThe gallery\nThe gallery showcased works by established European artists with an emphasis on Surrealism, and also exhibited the works of lesser known American artists, often for the first time. The space became both a meeting place and exhibition nexus for exiled European artists and young emerging Americans and as such was one of the major crucibles for the emergence of the New York School.\nThe European artists that were exhibited at the Art of This Century Gallery included Leonora Carrington, Jean Arp, Georges Braque, Victor Brauner, Giorgio de Chirico, Salvador Dalí, Max Ernst, Alberto Giacometti, Wassily Kandinsky, Fernand Léger, André Masson, Roberto Matta, Joan Miró, Pablo Picasso and Yves Tanguy.\nThe American artists shown at the gallery included William Baziotes, Alexander Calder, Joseph Cornell, David Hare, Hans Hofmann,  Gerome Kamrowski, Willem de Kooning, Robert Motherwell, Jackson Pollock, Richard Pousette-Dart, Ad Reinhardt, Mark Rothko, Charles Seliger, Clyfford Still, Janet Sobel and Robert De Niro Sr.\nGallery spaces\nArt of This Century was divided into four distinct spaces: the Abstract Gallery, the Surrealist Gallery, the Kinetic Gallery, and the Daylight Gallery.  The Abstract, Surrealist, the Kinetic Galleries showcased the permanent private collection which Peggy Guggenheim had amassed in Europe with the assistance of curator Herbert Read and artist Marcel Duchamp. The Daylight Gallery was a commercial gallery, used for the fifty-three temporary exhibitions featuring the work of one-hundred-and-three artists that took place from the winter of 1942 to the summer of 1947.\nThe Abstract Gallery was the entrance space featuring undulating walls of ultramarine canvas and a Thalo-blue-painted floor. All of the paintings were suspended within the room from either diamond-shaped or inverted-pyramid rope modules or from parallel or V-shaped straps. Some sculptures were also suspended midair within these modules. As in all the gallery spaces, Frederick Kiesler's Correalist furniture units also served as easels for paintings and pedestals for sculpture.\nOne of the most-recognized and reproduced exhibition spaces of the twentieth century, the Surrealist Gallery was Frederick Kiesler's design masterpiece. Within the long black-painted room, hanging curvilinear wall units displayed all the Surrealist works jutting out toward the viewer on adjustable arms. As originally presented, spotlights illuminated the paintings individually in a random electrically controlled sequence. At times the gallery was plunged into complete darkness accompanied by the ominous sound of an oncoming train.\nThe Kinetic Gallery was a darkened hall-like space often likened to a carnival funhouse. Viewers were invited to interact with the displays. A biomorphic spiral-shaped ship's wheel rotated the contents of Marcel Duchamp's \"Box in a Valise\" where the components were viewed through a peephole. Activated by an invisible electric light beam, a paternoster lift display (resembling a mechanical ferris wheel) rotated small works by Paul Klee in front of the viewer.\nThe Daylight Gallery, so-called because the two front rooms faced picture windows on 57th Street, was a normal rectilinear gallery with white walls. All of Guggenheim's temporary exhibitions took place here, including the New York debuts of William Baziotes, Robert De Niro (Sr.), David Hare, Robert Motherwell, Jackson Pollock, and Charles Seliger and important early exhibitions of Richard Pousette-Dart, Mark Rothko, and Clyfford Still. This space also contained Kiesler's mobile Painting Libraries, wheeled easel units with projecting glass rods which allowed viewer's to study works while seated on Correalist Instruments.\nAvant-garde during World War II\nAbstract Art was not new to the New York artists. The group called the American Abstract Artists (AAA) was established in 1937. Many of its members left New York in 1942 during World War II, to join the US Armed Forces. During the war years there were few male vanguard American artists remaining in New York. Generally the only artists or critics who did not participate in World War II were those exempt from military service or conscientious objectors. These male artists along with a few female artists captured the few galleries who were willing to show their work along with European modernists. This group of artists was called the Uptown Group.\nUptown Group prior to 1945\n*Adolph Gottlieb\n*David Hare\n*Robert Motherwell\n*Jackson Pollock\n*Richard Pousette-Dart\n*Ad Reinhardt\n*Theodoros Stamos\nBarnett Newman, a well-respected writer and critic who also organized exhibitions and wrote catalogs became only later a member of the Uptown Group. Jackson Pollock had his first solo show in 1943 at the Art of This Century Gallery, which provided him with a yearly stipend. He together with his wife the painter Lee Krasner, left New York City in 1945 and moved to the Springs, East Hampton, Long Island. Clyfford Still, a Californian who at the end of 1945 moved to New York, soon joined the Uptown Group and became associated with the prestigious uptown gallery: The Art of This Century.\nThomas B. Hess, managing director of Art News described the Uptown Group:\n:Newman, Gottlieb, Rothko and Still each thought (and thinks) himself the greatest painter in the world. That one might owe a debt to another becomes not a matter of simple ordinary fact, but a major issue of debate-like a trial for high treason. They made a tactical alliance, not a team, nor a group style, nor even a tendency. (Barnett Newman, Thomas B. Hess, New York: Walker, 1969)\nExhibition by 31 Women\nFrom January 5 to February 6, 1943, the gallery hosted the first of two exhibitions with exclusively women artists, one of the first times an exclusively female exhibition had happened. Exhibition by 31 Women was juried, an unusual practice outside of Europe at the time, by a group that included prominent surrealists André Breton, Marcel Duchamp, Max Ernst, and others, including Guggenheim herself. Georgia O'Keeffe declined to participate, noting in a letter that she did not want to show as a \"woman artist\".\nThe group of artists selected represented sixteen nationalities: Xenia Cage, Djuna Barnes, Leonora Carrington, Maria Elena Vieira da Silva, Eyre de Lanux, Leonor Fini, Elsa von Freytag-Loringhoven, Suzy Frelinghysen, Meraud Guinness, Anne Harvey, Valentine Hugo, Buffie Johnson, Frida Kahlo, Jacqueline Lamba (Breton), Gypsy Rose Lee, Aline Meyer Liebman, Hazel McKinley (Guggenheim, King-Farlow), Milena Pavlović-Barilli, Louise Nevelson, Meret Oppenheim, Barbara [Reis] Poe Levee, Irene Rice Pereira, Kay Sage, Sonja Sekula, Gretchen Schoeninger, Esphyr Slobodkina, Hedda Sterne, Muriel Streeter, Dorothea Tanning, Sophie Taeuber-Arp, Julia Thecla, and Pegeen Vail Guggenheim, Peggy's daughter.\nThough not a commercial success, the exhibition was positively reviewed, but not devoid of chauvinism: a reviewer from Time magazine refused to cover the show because, he claimed, there were no worthy women artists.\nThe second exhibition, \"The Women\", was on view June 12 – July 7, 1945, featuring thirty-three women artists, some of whom had also taken part in the previous show. New artists included Nell Blaine, Louise Bourgeois, Lee Krasner, Peter (Henrietta) Miller, Janet Sobel, Charmion von Wiegand, and Catherine Yarrow.\nThe exhibition's impact has been far-reaching: a new exhibition in 1997, Art of This Century: The Women; two perfumes named for the gallery and the exhibition, released by J. Crew; and a 2017 clothing collection by designer Jenny Packham that cited the concept as an inspiration.\nClosure\nGuggenheim closed the doors of The Art of This Century Gallery in May 1947. The representation of her artists was taken over by Betty Parsons, an artist and a prominent New York socialite.\nSee also\n* Abstract expressionism\n* Dada\n* Peggy Guggenheim Collection\n* Surrealism\n* ''The Witch's Cradle (1943), unfinished film by Maya Deren filmed at the Gallery with Marcel Duchamp\nReferences\nBooks\n* American Abstract Expressionism of the 1950s An Illustrated Survey\n* New York School Abstract Expressionists Artists Choice by Artists\n* Susan Davidson and Philip Rylands, eds. (2005). \"Peggy Guggenheim & Fredrick Kiesler: The Story of Art of This Century\" (exhibition catalogue), Venice: Peggy Guggenheim Collection |\n* Guggenheim, Peggy, André Breton, Jean Arp and Piet Mondrian. (1942). \"Art of This Century: Objects - Drawings - Photographs - Paintings - Sculpture - Collage 1910 to 1942\", New York: Art of This Century and Art Aid Corporation\n* Peggy Guggenheim, Out of This Century, Confessions of an Art Addict'', (Foreword by Gore Vidal, (Introduction by Alfred H. Barr Jr.), ANCHOR BOOKS, Doubleday & Company, Inc. Universe Books 1979,"
    }
  ]
}