{
  "content": [
    {
      "type": "text",
      "text": "# Art of the Kingdom of Benin\n\n]]\nBronze Head of Queen Idia\nBenin art is the art from the Kingdom of Benin or Edo Empire (1440–1897), a pre-colonial African state located in what is now known as the Southern region of Nigeria. Primarily made of cast bronze and carved ivory, Benin art was produced mainly for the court of the Oba of Benin – a divine ruler for whom the craftsmen produced a range of ceremonially significant objects. The full complexity of these works can be appreciated through the awareness and consideration of two complementary cultural perceptions of the art of Benin: the Western appreciation of them primarily as works of art, and their understanding in Benin as historical documents and as mnemonic devices to reconstruct history, or as ritual objects. This original significance is of great importance in Benin. In terms of specific imagery, leopards are identifying figures to represent the Oba of Benin as a competent and dominant force in their territory.\nImportance of art in Benin culture\nThe Kingdom of Benin is powerful, but Benin culture has not been given proper recognition by Western scholars. The story of how the Kingdom of Benin began as a culture and nation starts with its origin story: A motionless man was floating on water when he heard a voice from a spirit saying, \"Open your eyes\". As soon as the man opened his eyes he became one with the spirit. Soon after a whip and snail shell appear beside him, and the man then decided to whip the terrain he was on. A golden orb appeared, and this golden orb, which would later be known as the sun, brings happiness and warmth to the man. Again, the man struck his whip to the earth, and this caused forests and wildlife to appear before him. Yet again, the man struck the earth with his whip, and a village full of people appeared. He then became known as the Lord from the Sky. As a result, he ordered the village to build a mound of earth painted white that would serve as a remembrance of his power and creation. He then recognized a man as the priest, and he ordered that the priest must always wear white.The story of the origin of Benin was not transferred through literature or writings. In fact, Benin as a culture was based on oral tradition: all of the history and stories known today from Benin were passed along from person to person and from generation to generation. The so-called Benin Bronzes (they are actually made of brass) and other artworks are especially important to historians because they are a key part of the history of Benin. Also, the Benin brasses and works of art are some of the only examples historians have of the physical representations of the culture. At first, the city and culture of Benin started off as a kingdom that was based solely on chiefly tribute. Later on, Benin's culture and history were enriched and became more powerful because of the conquests they made through war. For example, a war that was detrimental to Benin was the Idah war (1515–1516). The Idah war was a religious war in which Benin won. This war helped to establish unity and power in the Benin Empire. The wars Benin participated in and the people Benin conquered made Benin into an imperial power. It was under Oba Ewuare (r. 1440–1473) that Benin became an empire by launching its military and conquering other lands. This also led to the formation of many trade routes and tribute-paying towns. Therefore, the first Europeans to arrive in Benin were very impressed with the wealth and advancements of the country. Overall, the Benin culture is an extremely important part of history because it is a culture not based on literature, and it is a culture that had great power before the 16th century.\nChronology\nGiven the stylistic differences, the art of Benin has been divided by some authors, including Egyptologist Boris de Rachewiltz in the following periods:\n{| class=\"nope\"\n|-\n! No.\n! Name\n! Duration\n|-\n| 1\n| the Archaic Period\n| from the origins-1360\n|-\n| 2\n| the Ancient Period\n| 1360–1500\n|-\n| 3\n| the Flowering Period\n| 1500–1575\n|-\n| 4\n| the Apogee Period\n| 1575–1648\n|-\n| 5\n| the \"Renaissance\"\n| 1648–1691\n|-\n| 6\n| the Decline Period\n| 1691–1819\n|}\nRoyal arts of Benin\nThe royal arts of the Benin Kingdom of southern region Nigeria affirm the centrality of the Oba, or divine king, portraying his divine nature. While recording the kingdom's significant historical events and the Oba's involvement with them, they also initiate the Oba's interactions with the supernatural and honor his deified ancestors, forging a continuity that is vital to the kingdom's well-being.\nThe materials used in Benin's royal arts—primarily brass, ivory, and coral—are endowed with sacred power. The innate value of these materials within Benin and the time and skill that is invested in working them reflect the earthly and otherworldly influence of the Oba and the great wealth of his kingdom. Benin's royal arts belong to a tradition that favors convention even as it promotes creativity and innovation, especially as a reflection of royal prerogative. Through time, rulers have used the arts to interpret the history of the kingdom and to orient themselves with the past in an effort to support their own initiatives and define their images for posterity.\nAlthough only popularly known to Western audiences after the Benin Expedition of 1897, Benin art has been in existence since at least the 13th century.\nAncestral altars\n, foreground, that of Oba Akenzua II's, 1936]]\nA newly installed Oba is responsible for creating an altar dedicated to his father, commissioning the appropriate objects to adorn it and activating it on a regular basis with sacrifices of food or animal blood. The Oba does the same for his mother if she attained the title of Iyoba, or queen mother. While bells and rattle staffs are placed on all ancestral altars, ivory tusks and commemorative brass heads are made specifically for royal altars. Associated with trade, ivory and brass are durable and valuable, and their colors—white like sacred kaolin clay and red like fire and coral beads—relate to royal power.\nBefore the British conquest, an Oba's courtyard was the focal point for rituals in his honor. British troops reported 18 altars dedicated to previous Obas when they took possession of the palace in 1897. Today, all of the royal altars stand together in a single courtyard.\nOne of the objects unique to Benin art is an Ikegobo or \"altar to the hand,\" which celebrates the accomplishments of exceptional individuals. The hand is associated with action and productivity, and is considered the source of wealth, status, and success for all those who depend on manual skill and physical strength. Altars of this kind are commissioned in terracotta, wood, or brass, depending on the status of the patron.\nArt related to rituals at court\nPrivate and public ceremonies mark many of the important moments in Benin's yearly calendar. In the past, an elaborate series of rites were performed throughout the year to secure otherworldly support for the kingdom's well-being and to celebrate decisive events in its history. For the sake of convenience, the current monarch, Oba Ewuare II, emphasizes the end-of-year festival called Igue, which is held during the winter holidays to allow the greatest number of people to attend. Igue includes a sequence of rituals that renew the Oba's supernatural powers and cleanse the kingdom's unruly spirits.\nBenin's other important ritual festivals include Ague, where the first budded yams are blessed in hopes of a successful harvest; Ugie Ivie, the Festival of Beads, in which the Oba's coral and red stone regalia is bathed in cow's blood to reinvest it with spiritual force; Ugie Erha Oba, which honors the Oba's father and all paternal ancestors; Oduduwa, a masquerade that likewise honors the Oba's paternal ancestors; and Ugie Oro, celebrating Oba Esigie's victory over the Idah Kingdom in the 16th century.\nFinely carved ivory double gongs are examples of art related to rituals at court. They are called “double” gongs because of second, smaller resonating cups at their front. Typically, the  central image is the Oba in coral regalia supported by the high priests Osa and Osuan, officials who tend the altars of the kingdom's two patron gods. These gongs are still carried today by the Oba during Emobo, the last of the empowering rites of the Igue festival. The Oba gently taps the ivory instrument, creating a rhythmic sound to calm and dismiss unruly spirits from the kingdom.\nLeopard imagery in the arts of Benin\nWithin the Kingdom of Benin, leopards were tamed and kept in chains for the pleasure of the Oba. Leopards became a counterpart of the Oba due to their influential characteristics of being terrifying and ferocious leaders of the animal kingdom. Along with its traits, the Oba adopted sayings such as how a leopard's spots can not wash away in the rain, relating to how human nature is essentially steadfast. Equipped with leopard accessories, the Oba boasted the strength of his authority. For instance, a surviving Benin plaque from the Museum of Fine Arts in Boston, shows the Oba holding the tail of a leopard in each hand to demonstrate his vigor and dominion to symbolize his standing as King.\nLeopard imagery is also frequently linked to the Oba's military might. Leopard accessories were an indication of status in the Kingdom of Benin as only the king and  prestigious generals and high-ranking officials were permitted to wear or display them. On the occasion that war chiefs were awarded leopard decorations, the Oba bestowed upon badges of honor in the form of leopard hip ornaments to serve both as protection for the wearer and a boost of morality over the fear of death. From other recovered bronze plaques, among the wears of the Oba and his people, soldiers were equipped with leopard-tooth necklaces, warrior bells, hip ornaments, and much more to both protect their bodies and as a display of warriors of the Oba.\nAn example of a 19th-century Benin ivory leopard carving is found in the British Museum. The object was shaped into a carved, stylized, ivory leopard with spots of inlaid copper. Each of the leopard's main body parts were forged from a different tusk. Often showed in pairs, a pair of carved leopards resided not only as a decoration but as an expression of superiority within the Oba's palace in Benin City.\nBrooklyn Museum 56.6.31a-b Box in the Form of a Leopards Head.jpg|Box in the form of a leopard's head; 19th century; 17.1 x 14&nbsp;cm (6 x 5 in.); Brooklyn Museum (New York City). This box was used to hold kola nuts presented to visitors in the royal court of Benin. Leopards are one of the most commonly portrayed animals in African art. Intelligent and courageous, they often serve as metaphors for powerful individuals or associations\nLeopard aquamanile, Nigeria, Benin Kingdom, 17th century AD, brass - Ethnological Museum, Berlin - DSC02208.JPG|Leopard aquamanile; 17th century; brass; Ethnological Museum of Berlin (Germany)\nFigure- Leopard MET DT9712.jpg|Figure of a leopard; 1550–1680; bronze; height: 39.4&nbsp;cm (15 in.); Metropolitan Museum of Art (New York City)\nThe Oba's regalia\nThe Oba's divine right to rule is reiterated in his regalia. His coral crowns, shirts, aprons, necklaces, and accessories refer to those that Oba Ewuare is said to have stolen from Olokun, the god of the waters and prosperity. Coral and red stones such as jasper and agate are also filled with supernatural energy, or ase, as are elephant ivory and brass, two other valuable materials that the Oba has historically controlled.\nDespite his divine status, the Oba can not rule alone. He must rely on others to fulfill his destiny, a dependence that is physically expressed when he walks or sits with his arms supported at the elbows and wrists by attendants. They help him bear the weight of his regalia, a constant reminder of the burden of kingship.\nBrass casting\nBrass casters (igun eronmwon) are the highest-ranking craft guild within the hierarchical structure of the Iwebo society, followed by blacksmiths (igun ematon) and ivory and wood carvers (igbesanwan).\nThe origins of brass casting in Benin are debated. One popular story credits Oba Oguola (enthroned c. 1280) with sending for a master brass caster from Ile Ife, the capital city of the Ancient Ife Kingdom to the northwest, and with later establishing a royal brass-casting guild. Others suggest brass casting developed independently in Benin and may have mutually benefited from exchange with Ile Ife. Casters in both regions used the lost wax method, in which a precisely detailed wax model is formed over a clay core. When the model is complete, clay is carefully applied over the wax. It is then heated, melting the wax, which exits from a narrow channel. Next, molten metal is poured into the mold. Once cool, the hardened clay is chipped away, leaving behind an image now cast in bronze.\nBenin Pferd und Reiter Museum Rietberg.jpg|Horse and rider; 16–17th century; Rietberg Museum (Zürich, Switzerland)\nBenin Porträt König Osemwende Museum Rietberg RAF 601.jpg|Portrait of the king Osemwende; circa 1810; Rietberg Museum\nPunitive Expedition\nThe decline of Benin art occurred at the end of the 19th century when the Benin Expedition of 1897 by the British caused impairment in the creation of the arts. On February 18, 1897, the British arrived in Benin City to punish a massacre. The possessions of the Oba and his court became spoils of war. The objects were rounded up with little regard for their associated meaning; no systematic record was kept of their grouping or placement. Many of these objects were sold in London to defray the cost of the expedition.\nIn April 2021 Germany agreed to return to present-day Nigeria the Benin bronzes that their troops had looted from the Kingdom of Benin. In late 2021 the Smithsonian Museum of African Art in Washington DC removed the Benin bronzes that they have from display and they say they have plans to repatriate them.\nContemporary issues surrounding the return of looted art\nAfter the British 1897 pillaged of Oba Ovonramwen’s compound in retaliation for the murder of British diplomats, most of pieces of Benin art were auctioned off in London. Today the Benin kingdom, located now in modern day Nigeria, is asking for its art objects back, which are spread across Western Countries such as Britain, Germany, and the United States. In 2007, western museums joined Nigeria in the \"Benin Dialogue Group\"  to open discussion about the retrieval of the art pieces.\nThe movement slowed until the recent wave of the Black Lives Matter movement following the murder of George Floyd and subsequent protests. Many countries, universities, and museums have returned or promised to return their pieces. With the returning of the stolen work, many worry about the fate of the art, as there is now a battle for possession with Nigeria among three different parties: the descendant of the last oba, the current governor, Godwin Nogheghase Obaseki, and the federal government and state of Nigeria. The current oba believes that the royal family has legal claims to the artwork. Critics say that giving the artwork to a single family might not fare well since the royal family no longer has power.\nMeanwhile, the governor has plans for a museum. Critics argue that once the current governor Godwin Nogheghase Obaseki leaves office in 2024 the museum plans will be abandoned. The state of Nigeria believes that it has the rightful claim to the artwork, but many fear that corruption and mismanagement in Nigerian governments, citing, for instance, the 1973 incident when the head of state at the time, General Yakubu Gowon, walked into the Nigerian National Museum in Lagos and took one of the Benin heads and gifted it to Queen Elizabeth; that piece remains today in the Royal Collection of Britain.\nReferences\nExternal links\n*[http://www.museum.upenn.edu/new/exhibits/galleries/benin.shtml Penn Museum – Benin Collection]\n*[https://libmma.contentdm.oclc.org/cdm/compoundobject/collection/p15324coll10/id/42448/rec/1 Art and oracle: African art and rituals of divination], an exhibition catalog from The Metropolitan Museum of Art (fully available online as PDF), which contains material on Benin art\n*[https://libmma.contentdm.oclc.org/cdm/compoundobject/collection/p15324coll10/id/101010/rec/4 Royal Art of Benin: The Perls Collection], an exhibition catalog from The Metropolitan Museum of Art (fully available online as PDF)\n*[https://libmma.contentdm.oclc.org/cdm/compoundobject/collection/p16028coll4/id/10013/rec/1 Antiquities from the city of Benin and from other parts of West Africa in the British Museum], a catalog from The British Museum (fully available online as PDF)\n*[https://libmma.contentdm.oclc.org/cdm/compoundobject/collection/p15324coll10/id/36698 Art of Oceania, Africa, and the Americas from the Museum of Primitive Art: an exhibition at the Metropolitan Museum of Art], an exhibition catalog from The Metropolitan Museum of Art Libraries (fully available online as PDF)\n*[https://www.loc.gov/folklife/guides/Benin.html Benin Collections in the Archive of Folk Culture], from the American Folklife Center\n*[https://www.nytimes.com/2020/01/23/arts/design/benin-bronzes.html \"This Art was Looted 123 Years Ago. Will It Ever Be Returned?\"] January 2020 article about the Benin Bronzes from the New York Times\n*[https://exchange.umma.umich.edu/advanced_search/query?type=3&title=&keywords=&min_rating=0&max_rating=5&style=+&collection_area=+&medium=&support=&classification=+&artist=&artist_nationality=Beninese&credit_line=&collection_identifier=&date_created=&location=+&author_lookup=&author_id=0 Work by Beninese artists at the University of Michigan Museum of Art]"
    }
  ]
}