{
  "content": [
    {
      "type": "text",
      "text": "# Art Basel Awards\n\nThe Art Basel Awards were launched in 2025 by Art Basel to honor excellence in the contemporary art world. Each year, 36 medals will be awarded to individuals and organizations “whose practices and contributions are shaping the future of art.”\nHonorees range from emerging to established figures, and encompass art ecosystem members beyond artists.\nSelection Process\nMedalists are selected based on four criteria: vision and innovation, skill and execution, engagement, and broader impact. An initial 36 medalists are selected by an international jury of experts and are honored ant the Art Basel flagship fair in June.\nOf those 36 medalists, 12 will be selected to be gold medalists, who will announced at Art Basel Miami Beach in December. Up to six of those gold medalists can be artists.\nCategories\nThe awards span the following nine categories, across a range of artists, curators, institutions and supporters:\n* Artists–Icon\n* Artists–Established\n* Artists–Emerging\n* Curators\n* Institutions\n* Cross-Disciplinary Creators\n* Patrons\n* Allies\n* Media and Storytellers\nPrizes\nPrizes vary by the category.\nFor the 2025 awards, the gold medalists in the emerging artist category each will receive an honorarium of $50,000. Those in the established artist category will receive $50,000 and a large-scale public commission for Art Basel’s flagship fair in June 2026. The Gold medalists in the icon category receive no honorarium but instead will have a donation of $50,000 to be made to an organization of the winner’s choice.\nCeremonies\nIn the first year, the initial 36 shortlist medalists were honored during the flagship Art Basel at Basel’s medieval town hall Rathaus Basel, followed by a reception for honorees and notable invitees at Kunstmuseum Basel. This was followed the following day by an Art Awards Summit, full of panels featuring the honorees.\nThere will be an additional ceremony for the 12 gold medalists in Art Basel Miami Beach.\nSponsors\nThe inaugural awards were done in partnership with Hugo Boss.\nReferences"
    }
  ]
}