{
  "content": [
    {
      "type": "text",
      "text": "# Arthur Hoskings\n\n|         death_place = Queens, New York City, USA\n|             batting = Right-handed\n|             bowling =\n|                role =\n|              family =\n|               club1 = Western Australia\n|               year1 = 1898/99\n|             columns = 1\n|             column1 = First-class\n|            matches1 = 2\n|               runs1 = 94\n|            bat avg1 = 31.33\n|           100s/50s1 = 0/1\n|          top score1 = 53\n|         deliveries1 = 144\n|            wickets1 = 1\n|           bowl avg1 = 77.00\n|            fivefor1 = 0\n|             tenfor1 = 0\n|       best bowling1 = 1/32\n|  catches/stumpings1 = 0/–\n|                date = 22 January\n|                year = 2011\n|              source = https://cricketarchive.com/Archive/Players/16/16206/16206.html CricketArchive\n}}\nArthur Alec Hoskings (1872&nbsp;– 16 February 1945) was an Australian-born cricketer.\nEarly life\nHoskings was born in Sydney, New South Wales, one of six children and the younger of two boys of Emily (née Barrett) and William Henry Hoskings. The first child of the family and his only brother was the architect Archer Hoskings. His early education was at Burwood Public School. In 1885 he commenced his senior education at Newington College aged 13 in Form One. At the time his family lived in Middleton Street, Stanmore, immediately behind the grounds of the college where he was a day boy.\nHoskings appears in the cricket pages of the school magazine, The Newingtonian and is reported to have played in a number of matches. He moved to Perth when his brother moved there from London to practice as an architect.\nCricket career\nHoskings was a right-handed batsman. He played one first-class match for Western Australia in April 1899, top-scoring in each innings with 26 and 53. He later settled in the US, and played a cricket match for New York City in 1912 against Ireland. The following year he played his second, and final, first-class match, this time for a combined Canada/USA team against his native Australia. In the 1912 season, playing for the New York Veterans Cricket Club, he scored more than 1000 runs and took more than 100 wickets.\nReferences\nExternal links\n*"
    }
  ]
}