{
  "content": [
    {
      "type": "text",
      "text": "# Arthur Edward Potts\n\nMajor General Arthur Edward Potts CBE, ED (24 October 1890 – September 1983) was a Canadian general officer, active in both World War I and World War II.\nEarly life\nBorn on 24 October 1890, Potts was educated at George Heriot's School in Edinburgh and subsequently studied at the University of Edinburgh (bachelor of science) and Cornell University (master's degree in agriculture). He worked as an instructor at Ames College in Iowa.\nWorld War I\nIn 1915, Potts left Ames College to enlist in the Second Universities Company at McGill University and was attached to the Princess Patricia's Canadian Light Infantry as a private. This unit was sent to France where Potts fought in the trenches and was wounded. In September 1916, he was promoted to lieutenant. At the end of 1917, Potts was sent to the education office, to give lectures to soldiers about agriculture. He soon rejoined his battalion. After being wounded on 7 September 1918, he was sent to England for convalescence. Potts was still recuperating from his wounds when the war ended.\nInterwar period\nAfter the war, Potts joined the University of Saskatchewan as head of the dairy department. Besides his normal work as \"Professor of Dairying\", he served in the Canadian militia and took over the university's officer training corps, reorganizing it and training personnel. Potts was promoted to the rank of colonel in 1934. In the same year, he became commander of the Saskatoon Non-Permanent Active Militia garrison and officer commanding of the 19th Infantry Brigade.\nWorld War II\nShortly after the outbreak of World War II, Potts received a request from then Major-General Andrew McNaughton to accept demotion and take over the Saskatoon Light Infantry. Potts accepted and took the unit to Europe in December 1939. In July 1940, he was promoted to brigadier and took over the command of the 2nd Canadian Infantry Brigade. He led the brigade in Operation Gauntlet, the commando raid at Spitsbergen\nIn May 1942, he became General Officer Commanding 6th Infantry Division with the rank of major-general. That appointment took him from the United Kingdom to the Pacific shores in British Columbia. In 1943 he was appointed commander of Military District 2 in Toronto. He stayed there till the end of the war.\nLater life\nPotts participated in 1943 in the filming of Commandos Strike at Dawn, as technical adviser\nAfter the war Potts joined the Department of Veterans Affairs. He moved to Kingston, Ontario in 1949, to become the Department's district administrator.\nPotts and his wife, the former Mary Ann Rattray Stewart, had six children including two sets of twins. He retired in 1955 and died in September 1983.\nPositions held\n{| class=\"wikitable\"\n|-\n! From\n! To\n! Unit\n! Role\n! Rank\n|-\n| 1916\n| 1918\n| 7th Canadian Infantry Brigade\n|\n| Lieutenant\n|-\n| 1934\n| 14-01-1936\n| Saskatoon Non-Permanent Active Militia garrison/19th infantry brigade (militia)\n| commander/officer commanding\n| Colonel\n|-\n| 15-01-1936\n| 29-11-1939\n| 19th Infantry Brigade (militia)\n| Commanding Officer\n| Colonel\n|-\n| 30-11-1939\n| 09-07-1940\n| 1st Saskatoon Light Infantry\n| Commanding Officer\n| Lieutenant-Colonel\n|-\n| 20-07-1940\n| 19-05-1942\n| 2nd Canadian Infantry Brigade\n| Officer Commanding\n| Brigadier\n|-\n| 15-11-1941\n| 22-12-1941\n| 1st Canadian Infantry Division\n| Acting General Officer Commanding\n| Brigadier\n|-\n| 20-05-1942\n| 11-10-1943\n| 6th Canadian Infantry Division\n| General Officer Commanding\n| Major-General\n|-\n| 12-10-1943\n| 31-08-1945\n| HQ Military District 2\n| District Officer Commanding\n| Major-General\n|}\nReferences\nExternal links\n* [https://web.archive.org/web/20121009201815/http://www.usask.ca/archives/history/Essays2006_COTC.pdf A Brief Account of the University of Saskatchewan Contingent, Canadian Officers Training Corps By D. F. Robertson]\n*[https://generals.dk/general/Potts/Arthur_Edward/Canada.html Generals of World War II]"
    }
  ]
}