{
  "content": [
    {
      "type": "text",
      "text": "# Arthur Dorward\n\n| death_place       = Melrose, Scotland\n| height            =\n| weight            =\n| amatyears1        = -\n| amatteam1         = Cambridge University R.U.F.C.\n| amatteam2         = Gala RFC\n| ru_amupdate       =\n| years1            =\n| clubs1            =\n| apps1             =\n| points1           =\n| ru_clubupdate     =\n| ru_currentclub    =\n| province1         = South of Scotland\n| provinceyears1    = -\n| provinceapps1     =\n| provincepoints1   =\n| ru_provinceupdate =\n| ru_position       = Scrum-half\n| repteam1          = Scotland\n| repteam2          = Barbarians\n| repcaps1          = 15\n| reppoints1        = 3\n| ru_ntupdate       =\n| repyears1         = 1950-57\n| other             =\n| occupation        =\n| school            = Sedbergh School\n| university        = University of Cambridge\n| relatives         = Tom Dorward, brotherAli Williams, 1st cousin (twice removed)\n}}\nArthur Fairgrieve Dorward (3 March 1925 &ndash; 4 August 2015) was a Scottish international rugby union player who played fifteen matches between 1950 &ndash; 1957.\nRugby Union career\nAmateur career\nDorward was born in 1925 in Galashiels. He was educated at St. Mary's School, Melrose, and Sedbergh School in Cumbria, where he was head boy. Dorward proceeded to St John's College, Cambridge, where he graduated with a degree in French and German.\nHe played rugby for Cambridge University R.U.F.C. for three seasons, winning three blues and captaining the team in his final year. He was also a member of the 1948 Oxford-Cambridge rugby union tour of Argentina.\nFollowing his graduation he returned to Galashiels, to work for the family textile business, and play for Gala RFC, for whom he had already made his debut aged 17.\nAll his club rugby was played with Gala, with whom he played for fifteen years, before retiring at the age of 32. He captained Gala for three seasons between 1954 and 1957. Leading the team to the 'unofficial' Scottish championship in 1957. He also won several Borders Sevens winners' medals at Gala, Hawick and Jed-Forest.\nProvincial career\nDorward also represented the South of Scotland in the Scottish Inter-District Championship. He played for the South against ,  and South Africa in tour matches. He was selected for the Barbarians several times and was a member of the 1957 Barbarians tour of Canada.\nInternational career\nDorward made his debut for  against  in the 1950 Five Nations Championship. Scotland won the match 8–5 at Murrayfield. His next match was against  at Murrayfield on their 1951–52 South Africa rugby union tour. Scotland lost 44–0; one of seventeen consecutive defeats between 1951 and 1955.\nIn the 1952 Five Nations Championship he played against ,  and . He became the first Gala player to captain Scotland for the match against England. England won the match 19–3 at Murrayfield. Dorward captained Scotland twice during the 1953 Five Nations Championship against France and Wales. He also played in the defeat to England at Twickenham.\nDorward played one match in the 1955 Five Nations Championship in the loss to France. The following year he played against Ireland and England in the 1956 Five Nations Championship; losing both matches. He played four matches in the 1957 Five Nations Championship, which included two victories. A win against the French in Paris and another against Wales at Murrayfield. His final two matches for Scotland ended in defeat. A loss to Ireland at Murrayfield and defeat to England at Twickenham.\nOne of the highlights of his career was scoring a drop goal against Wales at Murrayfield to win the match 9–6 in 1957. He scored from just short of the halfway line and ten metres in from touch; his only international points.\nFamous relatives\nArthurs brother Tom Dorward was also capped for Scotland.\nThe New Zealand lock, Ali Williams', maternal grandfather was his cousin.\nReferences"
    }
  ]
}