{
  "content": [
    {
      "type": "text",
      "text": "# Arthur C. Cope Award\n\nThe Arthur C. Cope Award is a prize awarded for achievement in the field of organic chemistry research. It is sponsored by the Arthur C. Cope Fund, and has been awarded annually since 1973 by the American Chemical Society. It consists of $25,000, a medallion, and $150,000 in funding for research in organic chemistry.\nRecipients include:\n*2025 - Timothy M. Swager\n*2024 - William L. Jorgensen\n*2023 - Scott Denmark\n*2022 – Véronique Gouverneur\n*2021 – John Hartwig\n*2020 – Dennis A. Dougherty\n*2019 – Dieter Seebach\n*2018 – Steven V. Ley\n*2017 – Carolyn R. Bertozzi\n*2016 – Eric N. Jacobsen\n*2015 – Paul A. Wender\n*2014 – Stuart Schreiber\n*2013 – Stephen L. Buchwald\n*2012 – Chi-Huey Wong\n*2011 – Nicholas Turro\n*2010 – Kendall N. Houk\n*2009 – Manfred T. Reetz\n*2008 – J. Fraser Stoddart\n*2007 – Jean Fréchet\n*2006 – Peter G. Schultz\n*2005 – K.C. Nicolaou\n*2004 – Barry M. Trost\n*2003 – Larry E. Overman\n*2002 – Robert H. Grubbs\n*2001 – George A. Olah\n*2000 – David A. Evans\n*1999 – Ralph F. Hirschmann\n*1998 – Samuel J. Danishefsky\n*1997 – Ryōji Noyori\n*1996 – Robert G. Bergman\n*1995 – George M. Whitesides\n*1994 – John D. Roberts\n*1993 – Peter B. Dervan\n*1992 – K. Barry Sharpless\n*1991 – Gerhard L. Closs\n*1990 – Koji Nakanishi\n*1989 – William S. Johnson, Norman Allinger\n*1988 – Kenneth B. Wiberg\n*1987 – Ronald Breslow\n*1986 – Duilio Arigoni\n*1984 – Albert J. Eschenmoser\n*1982 – Frank H. Westheimer\n*1980 – Gilbert J. Stork\n*1978 –\n*1976 – Elias J. Corey\n*1974 – Donald J. Cram\n*1973 – Roald Hoffmann and Robert B. Woodward\nArthur C. Cope Scholar Awards\nThe Arthur C. Cope Fund also sponsors an additional ten awards each year called the Arthur C. Cope Scholar Awards  to recognize and encourage excellence in organic chemistry. The Arthur C. Cope Scholar Awards were established in 1984 by the ACS Board of Directors, on recommendation of the ACS Division of Organic Chemistry, under the terms of the will of Arthur C. Cope.\nRecipients include:\n*2024 - Michelle R. Arkin, Philip E. Dawson, Dennis G. Hall, Ohyun Kwon, Tristan H. Lambert, Thomas Lectka, Mark D. Levin, Song Lin, Armido Studer, Uttam Krishan Tambar\n*2023 - Thorsten Bach, Suzanne A. Blum, Kevin Burgess, Tianning Diao, Steven P. Nolan, Jennifer Prescher, Javier Read de Alaniz, Hans Renata, Vincent M. Rotello, and Dean J. Tantillo\n*2022 - Richard G. Finke, Joseph M. Fox, Todd K. Hyster, Guy C. Lloyd-Jones, Marisa C. Kozlowski, Alison Narayan, David A. Nicewicz, Emma Parmee, Theresa M. Reineke, and Jennifer M. Schomaker\n*2021 - Igor V. Alabugin, Yimon Aye, Christopher Cramer, Ilan Marek, David A. Nagib, David Sarlah, Peter R. Schreiner, Michinori Suginome, Dirk Trauner, and Helma Wennemers\n*2020 - Li Deng, Todd L. Lowary, Ruben Martin, Kevin D. Moeller, Hosea M. Nelson, Timothy R. Newhouse, T. V. 'Babu' RajanBabu, John R. Reynolds, Corey Stephenson, and Daniel J. Weix\n*2019 - Varinder Aggarwal, Alison Butler, Eugene Chen, Cathleen Crudden, Matthew B. Francis, Jeremiah Johnson, Thomas Maimone, Robert McMahon, Masahiro Murakami, and Tehshik Yoon\n*2018 - Emily P. Balskus, Naoto Chatani, William 'Bill' F. Degrado, Frank Glorius, Robert R. Knowles, Dawei Ma, Heather D. Maynard, James P. Morken, G. K. Surya Prakash, and Keith Woerpel\n*2017 - Alejandro Briseno, Sherry R. Chemler, Guangbin Dong, P. Andrew Evans, M. G. Finn, Paul J. Hergenrother, Thomas R. Hoye, Kathlyn A. Parker, Mikiko Sodeoka, and Christopher D. Vanderwal\n*2016 - Takahiko Akiyama, Kristi S. Anseth, Geert-Jan Boons, Luis M. Campos, Seth M. Cohen, Matthew J. Gaunt, Marc M. Greenberg, Thomas Kodadek, Lawrence T. Scott, and David A. Spiegel\n*2015 - Michelle Chang, Debbie C. Crans, Antonio M. Echavarren, Ben L. Feringa, Miguel A. Garcia-Garibay, Neil K. Garg, Chuan He, Kenichiro Itami, Kenneth M. Nicholas, and Richmond Sarpong\n*2014 - Richard N. Armstrong, Olafs Daugulis, Abigail G. Doyle, Raymond L. Funk, Seth Herzon, Jeffrey N. Johnston, Gary E. Keck, Benjamin List, Hung-wen 'Ben' Liu, and Tomislav Rovis\n*2013 - William R. Dichtel, Makoto Fujita, Michael J. Krische, Donald S. Matteson, Bradley S. Moore, Thomas William Muir, Jack R. Norton, Sarah E. Reisman, Martin F. Semmelhack, and Shannon S. Stahl\n*2012 - Jeffrey Aubé, Squire J. Booker, Timothy F. Jamison, Anna K. Mapp, E. W. Meijer, David I. Schuster, Scott A. Snyder, Yi Tang, Michael R. Wasielewski, and Jin-Quan Yu\n*2011 - Zhenan Bao, Martin D. Burke, David Crich, Vy M. Dong, Craig J. Hawker, Seth R. Marder, Tobin J. Marks, Keiji Maruoka, Andrew J. Phillips, and Suzanne Walker\n*2010 - Helen E. Blackwell, Christopher Chang, John A. Gerlt, Arun K. Ghosh, Jeffrey Johnson, Robert A. Moss, Eiichi Nakamura, Matthew S. Sigman, Alice Ting, and Maria Christina White\n*2009 - Carlos F. Barbas III, Paul J. Chirik, Victor J. Hruby, William D. Jones, Chaitan Khosla, Mohammad Movassaghi, Nicos A. Petasis, John A. Porco, Jr., David H. Sherman, and Erik J. Sorensen\n*2008 - Jeffrey W. Bode, Cynthia J. Burrows, Dieter Enders, Tamio Hayashi, Linda C. Hsieh-Wilson, Colin P. Nuckolls, Melanie S. Sanford, Thomas S. Scanlan, Mukund P. Sibi, and Daniel A. Singleton\n*2007 - Gullermo C. Bazan, André B. Charette, Janis Louie, Leonard R. MacGillivray, David W. C. MacMillan, James A. Marshall, Kenneth J. Shea, David A. Tirrell, James M. Tour, and Yoshinori Yamamoto\n*2006 - Eric V. Anslyn, Robert K. Boeckman, Jr., Franklin A. Davis, Michael P. Doyle, Shu Kobayashi, Mark Lautens, Lanny S. Liebeskind, Brian M. Stoltz, F. Dean Toste, and Wilfred A. Van der Donk\n*2005 - Donna G. Blackmond, Weston T. Borden, Benjamin F. Cravatt, Huw M. L. Davies, Rustem F. Ismagilov, Brent L. Iverson, Paul Knochel, Frederick D. Lewis, Steven M. Weinreb, and James D. Wuest\n*2004 - Justin Du Bois, David R. Liu, Ronald T. Raines, Scott J. Miller, Yian Shi, John L. Wood, Louis S. Hegedus, Richard C. Larock, Gary H. Posner, and Kenneth S. Suslick\n*2003 - Jean A. Chmielewski, Andrew S. Kende, James L. Leighton, Milan Mrksich, William H. Pearson, Viresh H. Rawal, Peter H. Seeberger, Kietmar Seyferth, Richard B. Silverman, and James D. White\n*2002 - Alois Fürstner, Carl R. Johnson, Alan R. Katritzky, Madleine M. Joullié, James S. Panek, Matthew D. Shair, Masakatsu Shibasaki, Robert M. Williams, Karen L. Wooley, and Xumu Zhang\n*2001 - Michael T. Crimmins, Geoffrey W. Coates,  Jean M.J. Fréchet, Murray Goodman, Jeffery W. Kelly, John Montgomery, Matthew S. Platz, Nicole S. Sampson, Richard R. Schrock, and Victor A. Snieckus\n*2000 - John E. Bercaw, David E. Cane, Jonathan A. Ellman, Daniel Herschlag, Eric T. Kool, Albert Padwa, Ned A. Porter, Timothy M. Swager, David L. Van Vranken, and Jeffrey D. Winkler\n*1999 - Carolyn R. Bertozzi, M. Reza Ghadiri, Andrew D. Hamilton, Kim D. Janda, John A. Katzenellenbogen, Laura L. Kiessling, Peter T. Lansbury, Jr., Daniel H. Rich, Martin Saunders, and J. Fraser Stoddart\n*1998 - Gregory C. Fu, John F. Hartwig, Amir H. Hoveyda, Gary A. Molander, James S. Nowick, C. Dale Poulter, Scott D. Rychnovsky, Jay S. Siegel, Christopher T. Walsh, and Peter Wipf\n*1997 - Barry K. Carpenter, Erick M. Carreira, Jon C. Clardy, David B. Collum, Jack D. Dunitz, Philip E. Eaton, Samuel H. Gellman, Daniel S. Kemp, Bruce H. Lipshutz, and Steven C. Zimmerman\n*1996 - Bruce Ganem, John H. Griffen, Stephen Hanessian, Sidney M. Hecht, Barbara Imperiali, Daniel Kahne, T. Ross Kelly, Stephen F. Martin, Jeffrey S. Moore, and Ryoji Noyori\n*1995 - Steven G. Boxer, Rick L. Danheiser, Michael E. Jung, Thomas J. Katz, Nelson J. Leonard, Kurt M. Mislow, Alanna Schepartz, Barry B. Snider, Craig A. Townsend, and Robert Waymourth\n*1994 - Maurice S. Brookhart, Paul Dowd, Christopher S. Foote, Eric N. Jacobsen, Martin E. Newcomb, Iwao Ojima, William R. Roush, Gary B. Schuster, and Edward C. Taylor\n*1993 - Peter Beak, Peter Chen, Tohru Fukuyama, Alexander M. Klibanov, Robert L. Letsinger, Josef Michl, Andrew G. Myers, JoAnne Stubbe, Chi-Huey Wong, and Fred Wudl\n*1992 - Jerome A. Berson, Francois N. Diederich, Joseph Dinnocenzo, Dennis A. Dougherty, Donald Hilvert, Paul B. Hopkins, Keith U. Ingold, Richard A. Lerner, Philip D. Magnus, and A. Ian Scott\n*1991 - Stephen L. Buchwald, Frederick G. Bordwel, William G. Dauben, John T. Groves, Julius Rebek, Jr., Paul von Ragué Schleyer, and Jonathan L. Sessler, Amos B. Smith, III, K. Peter C. Vollhardt, and Howard E. Zimmerman\n*1990 - Edward M. Arnett, Paul A. Bartlett, Paul A. Grieco, Robert H. Grubbs, Clayton H. Heathcock, William L. Jorgensen, Peter G. Schultz, John K. Stille, Harry Wasserman, and Paul A. Wender\n*1989 - Norman L. Allinger, Scott E. Denmark, Mary Anne Fox, Jeremy R. Knowles, Jerrold Meinwald, Larry E. Overman, Andrew Streitwieser, Jr., Barry M. Trost, and George M. Whitesides\n*1988 - Dale L. Boger, Stephen J. Benkovic, Charles P. Casey, Dennis P. Curran, David A. Evans, John A. Gladysz, Kendall N. Houk, Yoshito Kishi, Jay K. Kochi, and W. Clark Still\n*1987 - Robert G. Bergman, Thomas C. Bruice, Emil T. Kaiser, Satoru Masamune, Albert I. Meyers, K. C. Nicolaou, Leo A. Paquette, and Nicholas J. Turro\n*1986 - Anthony G. M. Barrett, John I. Brauman, James P. Collman, Samuel J. Danishefsky, Peter B. Dervan, Paul G. Gassman, Henry Rapoport, Stuart L. Schreiber, K. Barry Sharpless, and Kenneth B. Wiberg\nSee also\n* List of chemistry awards\nReferences"
    }
  ]
}