{
  "content": [
    {
      "type": "text",
      "text": "# Artifact Creek\n\n| discharge1_location =\n| discharge1_min =\n| discharge1_avg =\n| discharge1_max =\n| source1 = Near Kitsu Peak\n| source1_location = Spectrum Range\n| source1_coordinates =\n| source1_elevation =\n| mouth = Stewbomb Creek\n| mouth_location =\n| mouth_coordinates =\n| mouth_elevation =\n| progression =\n| river_system =\n| basin_size =\n| tributaries_left   =\n| tributaries_right  =\n| custom_label = Topo map\n| custom_data = NTS\n| extra =\n}}\nArtifact Creek is a tributary of Stewbomb Creek and part of the Stikine River watershed in northwest part of the province of British Columbia, Canada. It flows generally southeast for roughly  to join Stewbomb Creek, which flows into the Little Iskut River. In turn the Little Iskut River flows to the Iskut River, the largest tributary of the Stikine River.\nArtifact Creek's watershed covers  and is entirely in Mount Edziza Provincial Park. The creek's mean annual discharge is estimated at .\nThe mouth of Artifact Creek is located about  southeast of Telegraph Creek, British Columbia, about  south of Dease Lake, British Columbia, and about  southeast of Juneau, Alaska. Artifact Creek's watershed's land cover is classified as 51.4% barren, 15.3% shrubland, 14.5% herbaceous, 10.3% conifer forest, 8.2% snow/glacier, and small amounts of other cover.\nArtifact Creek is in Mount Edziza Provincial Park, which lies within the traditional territory of the Tahltan First Nation, of the Tahltan people.\nThe name of Artifact Creek and nearby Artifact Ridge and Obsidian Ridge comes from the abundant piles of stone chips left from the knapping of obsidian tools and points by early Tahltan hunters.\nGeography\nArtifact Creek originates near Kitsu Peak, about  south of Mount Edziza. It flows east and southeast between Obsidian Ridge to the south and Artifact Ridge to the north. It collects various small unnamed tributary streams before  emptying into Stewbomb Creek about  upstream from Stewbomb's confluence with the Little Iskut River.\nGeology\nThe north side of Artifact Creek is bounded by a  sequence of lava flows belonging to the Armadillo Formation of the Mount Edziza volcanic complex. A single  ash flow deposit also belonging to the Armadillo Formation is exposed on the south side of Artifact Creek. Along the north side of Artifact Creek are two poorly exposed, low, northeasterly trending ridges of trachybasalt that may be intrusions linked to the Little Iskut conduit system.\nSee also\n*List of rivers of British Columbia\nReferences"
    }
  ]
}