{
  "content": [
    {
      "type": "text",
      "text": "# Artistic depictions of the Bangladesh Liberation War\n\nBangladesh's national monument, Jatiyo Smriti Soudho, located in Savar, [[Dhaka, is a tribute to the martyrs of the Liberation War.]]\nThere have been numerous works of art created as a result of the Bangladesh Liberation War. In 1971, a concert was organized by members of the British rock band, The Beatles, in support of Bangladesh. The songs recorded for and broadcast on Swadhin Bangla Betar Kendra are still considered to be the best of Bangladeshi protest songs.\nFour documentaries were made in Bangladesh during the War - Zahir Raihan's Stop Genocide and A State Is Born, Babul Chowdhry's Innocent Millions, and Alamgir Kabir's Liberation Fighters.   These four films are considered to be the first films made in Bangladesh, since earlier films were produced in Pakistan or India. Muktir Gaan (Song of Freedom), by Tareque and Kathrine Masud, is based on footage shot by Leer Levin during the war and is the most critically acclaimed Bangladeshi documentary. The directors followed the film with two sequels – Story of Freedom and Narir Katha. Their feature film on the same subject, Matir Moyna, won the FIPRESCII award at Cannes Film Festival.\nOne of the more well-known authors to write about the Liberation War is Shamsur Rahman. Arguably, the Bangladesh Liberation War is one of the most referenced subjects for Bangladeshi literature since 1971. Monuments made to commemorate the War are some of the highest esteemed monuments in Bangladesh. One such memorial is Bangladesh's national monument, Jatiyo Smriti Soudho, located in Savar, Dhaka.\nFilms\nBangladeshi\n* Stop Genocide – documentary by Zahir Raihan (1971)\n* Let There be Light by Zahir Raihan (1971)\n* Nine Months to Freedom: The Story of Bangladesh – documentary by S. Sukhdev (1972)\n* Ora Egaro Jon (The Magnificent Eleven) by Chashi Nazrul Islam (1972)\n* Arunodoyer Agnishakkhi (The Dawn Observer) by Subhash Dutta (1972)\n* Bagha Bangali (The Bengal Tiger) by Ananda (1972)\n* Raktakto Bangla (The Blood-stained Bengal) by Mamtaj Ali (1972)\n* Dhire Bohe Meghna (Quiet Flows the river Meghna) by Alamgir Kabir (1973)\n* Amar Jonmovumi (1973)\n* Sangram (The War) by Chashi Nazrul Islam (1974)\n* Abar Tora Manush Ho (Be Human Again) by Khan Ataur Rahman (1973)\n* Alor Michhil (1974)\n* Sangram (1974)\n* Megher Onek Rong (Clouds Have Many Colors) by Harun-Or-Rashid (1976)\n* Kalmilata  by Shahidul Haq Khan (1981)\n* Chitkar (1982)\n* Agami (Toward) by Morshedul Islam (1984)\n* Hooliya (Wanted) by Tanvir Mokammel (1984), based on Nirmalendu Goon's Hulia poem\n* Protyaborton (1986)\n* Suchona by Morshedul Islam (1988)\n* Charpotro (1988)\n* Bokhate (1989)\n* Duronto (1989)\n* Potaka (1989)\n* ''Kalo Chil '71 (1990)\n* Dushor Jatra (1992)\n* Ekattorer Jishu (Jesus '71)'' – feature film by Nasiruddin Yousuff, based on Shahriar Kabir's story (1993)\n* Desh Premik (1994)\n* Muktir Gaan (Song of Freedom, 1995), Muktir Kotha (A Tale of Freedom, 1999), and Narir Katha – three different Bengali-language documentaries by Tareque Masud and Catherine Masud\n* Aguner Poroshmoni feature film by Humayun Ahmed (1994)\n* Nodir Naam Modhumoti (The River Called Madhumoti) by Tanvir Mokammel (1995)\n* Ekhono Onek Raat (1997)\n* Hangor Nodi Grenade, On the basis of Selina Hossain's novel, Chashi Nazrul Islam (1997)\n* Gourob (1998)\n* Chana O Muktijuddo (1998)\n* Ekattorer Lash (1998)\n* Itihas Kanna by Shamim AKter, Biography of a war child (1999)\n* Shovoner Ekattor (2000)\n* Muktijoddo O Jibon (2000)\n* Shei Rater Kotha Bolte Eshechi (\"I Have Come to Speak of That Night\") – documentary by Kawsar Chowdhury (2001)\n* Ekjon Muktijodda (2001)\n* Ekattorer Michil by Kabori Sarwar (2001)\n* Ekattorer Rong Pencil by Manan Hira (2001)\n* Matir Moina (The Clay Bird) by Tareque Masud (2002), winner of the FIPRESCI Prize at the 2002 Cannes Film Festival\n* Shilalipi by Shamim Akhter (2002)\n* Hridoyghata (2002)\n* ''Spartacus '71\n* Shorot '71 by Morshedul Islam (2002)\n* Swadhinata (Freedom) by Yasmine Kabir (2003)\n* Ami Sadhinota Enechhi by Sagar Lohani (2003)\n* Amar Bandhu Rashed (My Friend Rashed) by Morshedul Islam (2004)\n* Shyamol Chhaya feature film by Humayun Ahmed (2004)\n* Joyjatra feature film by Tauquir Ahmed (2004)\n* Megher Pore Megh by Chashi Nazrul Islam (2004)\n* Dhrubotara (2006)\n* Khelagor by Morshedul Islam, (2006)\n* Asttitey Amar Desh, According to the Biography of Matiur Rahman directed by Khijir Hayat Khan (2007)\n* Tajuddin Ahmed: Nishongo Sarati (Tajuddin Ahmad: An Unsung Hero) by Tanvir Mokammel (2007)\n* Rabeya by Tanvir Mokammel, (2009)\n* Meherjaan by Rubaiyat Hossain (2011)\n* Guerrilla by Nasiruddin Yousuff (2011)\n* Khondo Golpo '71 (2011)\n* Amar Bondhu Rashed by Morshedul Islam (2011) based on a juvenile novel by Muhammed Zafar Iqbal\n* Pita - The Father by Masud Akando (2012)\n* Nekabborer Mohaproyan directed by Masud Pathik, based on a poetry by Nirmalendu Goon (2014)\n* Shongram (2014)\n* Bishkanta (The Poison Thorn) by Farjana Boby (2015)\n* Meghmollar by Zahidur Rahim Anjan (2015), adapted from a story by Akhtaruzzaman Ilias\n* Anil Bagchir Ekdin (Anil Bagchi’s Day'') by Morshedul Islam (2015), adapted from Humayun Ahmed's novel\n* Angels of Hell by Shameem Shahid (2015); Short film based on war children of Bangladesh Liberation War\n* Janmasathi (Born Together) by Shabnam Ferdousi (2017)\n* Bhuban Majhi by Fakhrul Arefeen Khan (2017)\n* Radio (2023), about 7 March speech of Bangabandhu Sheikh Mujibur Rahman.\nIndian\n* Ab Tumhare Hawale Watan Sathiyo (2004)\n* Dateline Bangladesh by Gita Mehta (2013)\n* Gunday (2014)\n* IB71 (2023)\n* Gadar 2 (2023)\nAmerican\n* The War Crimes File by David Bergman (Three men's role in Bangladesh war genocide) (2013)\nPakistani\n* Ghazi Shaheed (1998)\n* Khel Khel Mein (2021)\n* Huey Tum Ajnabi (2023)\n* Jo Bichar Gaye (TV series)\n*\n* Khaab Toot Jaatay Hain (TV series)\nPlays\n* Payer Awaj Pawa jay by Syed Shamsul Haque (1976)\n* Juddho Ebong Juddho by Syed Shamsul Haque (1986)\n* Joyjoyonti by Mamunur Rashid (1995)\n* Ekattorer Pala by Nasiruddin Yousuff Bacchu (1993)\n* Mukhosh\n* Kingsukh\n* Je Merute\n* Bibisab by Abdullah al Mamun (1994)\n* ''Kotha '71\n* Bolod by Muhammed Zafar Iqbal\nLiterature\n* Ami Birangana Bolchi (The Voices of War Heroines) – first-person narratives collected by Nilima Ibrahim (two volumes: 1994, 1995)\n* Ekatture Uttar Ronangaon ('71 Northern Front) – Factual War Accounts (in Bengali) by Muhammad Hamidullah Khan, Sector Commander 11, War of Independence – Bangladesh\n* Amar Bondhu Rashed (My Friend Rashed) – Juvenile novel by Muhammed Zafar Iqbal\n* Ghum Nei (Sleepless Nights) – memoir by Nasiruddin Yusuf\n* Ami Bijoy Dekhechi (I have witnessed the Victory) – memoir by M. R. Akhtar Mukul\n* A Tale of Millions – memoir by Major (R) Rafik Ul Islam\n* Ekattorer Dinguli (Days of 71) – memoir by Jahanara Imam (1986)\n* Maa(The Mother) – novel by Anisul Hoque (2003)\n* Jochhna o Janani'r Galpo (The Tale of Moonlight and the Motherland) – novel by Humayun Ahmed (2004)\n* Of Blood and Fire –\n* September on Jessore Road – poem by Allen Ginsberg\n* A Golden Age – novel by Tahmima Anam\n* Aguner Poroshmoni – novel by Humayun Ahmed\n* 1971 – novel by Humayun Ahmed\n* Of Martyrs and Marigolds – a novel written by a Stranded Pakistani woman, Aquila Ismail.\nMusic\n* The Concert for Bangladesh'', New York, 1971\n* \"Song for Bangladesh\" – song by Joan Baez\n* \"Bangla Desh\" – song by George Harrison\nSculpture and Architecture\n* Sucker'wfp21 war project created by artist Firoz Mahmud which first exhibited at [https://aichitriennale.jp/2010/en/artists/contemporary-arts/-firoz-mahmud.html Aichi Triennial] 2010 in Nagoya, Japan and other venues and cities including University Art Museum Tokyo and collaborating with Liberation War Museum and EMK Center in Dhaka.\n* Jatiyo Smriti Soudho (National Monument for Remembrance) in Savar, Dhaka\n* Swadhinata Stambha (Independence Monument) in Suhrawardy Udyan, Dhaka\n* Aparajeyo Bangla (Invincible Bengal) – sculpture in Dhaka University\n* Shabash Bangladesh (Bravo, Bangladesh) – sculpture in Rajshahi University\n* Shoparjito Shadhinota (Self Achieved Freedom) – sculpture in Dhaka University\n* Joy Bangla (Hail Bengal) – sculpture in Chittagong University\n* Juddho Joy – sculpture in Alekhar Char, Cumilla\n* Shadhinota Smriti Mural (Independence Memorial Mural) – mural in Chittagong University\n* Gonohotta 1971 – sculpture at Bharat-Bangladesh Maitri Udyan in South Tripura, India\nMuseums\n* Liberation War Museum, Dhaka\n* Shahid Smriti Sangrohoshala (Martyr Memorial Museum), Rajshahi\nDigital Archive\n* Muktijuddho e-Archive\nVideogames\n* Amar Ei Desh\n* Arunodoyer Agnishikha\n* Heroes of 71\n* Sector 71\nSee also\n* Artistic depictions of the Bengali Language Movement\n* List of artistic depictions of Sheikh Mujibur Rahman\nReferences"
    }
  ]
}