{
  "content": [
    {
      "type": "text",
      "text": "# Artillery in the Second Boer War\n\nThe Second Boer War saw attempted application of bombardment as an alternative to the use of ground forces. In most battles fought during the conflict this was proved not to be possible. There was competition from the other side's ability to undertake evasive measures. The opponent was able to use cover to protect himself and hide his position. Nonetheless, the tactic of the creeping barrage, used at the Relief of Ladysmith, has been described as \"revolutionary\".\nBattle of Magersfontein - 11 December 1899\nThe barrage involved twenty-four field guns, four howitzers, and a 4.7 inch naval gun, dubbed 'Joe Chamberlain', in honour of the British Colonial Secretary. \"Onlookers were told by the naval gunners that Old Joey would kill every man within 150 yards of where his shells struck.\" However, the bombardment that targeted the hill did not hit the Boers. The British had poor intelligence. The Boers were not hiding on the hill but in a line of trenches close by. It was to be another three months before the Boers finally evacuated, not because of bombardment, but because the British passed round them.\nBattle of Colenso - 15 December 1899\nHere too, the British lacked intelligence about enemy positions. Before the battle, the Boers were hidden and their numbers or positions could not be estimated.  In battle, smokeless fire meant that their positions were difficult to locate. Boer guns were also concealed behind emplacements, a practice that was new to late nineteenth century warfare.\nRelief of Ladysmith - 14–28 February 1900\nThe British had success when they ceased using artillery by itself and used it in conjunction with infantry. British General Buller linked the use of artillery and the movement of infantry into continuous interlocking assaults upon each hill south of Ladysmith. As soon as shelling had finished in a location the infantry moved. The front collapsed on the 27th when use was made of a creeping curtain of shell\nfire sent over the heads of advancing infantry destroying everything 100 yards ahead of them. It was this tactic of the creeping barrage that has been described by Pakenham as \"revolutionary\".\nNotes\nSources\nThomas Pakenham, Boer War, London: Abacus, 1992.\nSee also\n* Battle of Paardeberg\n* Second Boer War"
    }
  ]
}