{
  "content": [
    {
      "type": "text",
      "text": "# Arts and culture in Augusta, Georgia\n\nThe culture of Augusta, Georgia is influenced by the many different perspectives and histories of its community members, as well as its own history. The large military population of the area as well as the city's rural surroundings have affected the types of festivals and culture produced within the city. Another major influence on the culture of the city is the annual Masters golf tournament held in April of each year. The most prolific cultural medium produced by the city is its musicians, as evidenced by James Brown, Jessye Norman, and Wycliffe Gordon.  Though notably, the writer Frank Yerby and visual artist Jasper Johns were Augusta natives as well.\nLarge events and festivals\nAugusta is host to a variety of annual events. The largest event held in the city each year is the Masters golf tournament bringing in around 250,000 visitors. One of the majors of the PGA tour, the Masters is also a major cultural influence on the city. Most semi-professional sports teams in the city are named for puns related to the tournament (the Augusta GreenJackets and the now defunct Augusta Lynx). Many establishments in the city, especially in the area around the Augusta National Golf Club, are also named in a similar manner. Restaurants throughout Augusta use memorabilia from the tournament as decor. Spring break for schools within the Richmond County School System coincides with the tournament, similarly to the timing of school breaks in New Orleans and Mardi Gras.\nOther annual events include the cultural festival Arts in the Heart of Augusta, the hip hop concert Mayfest, and the arts festival Westobou. The Rock Fore! Dough Concert is a charity concert held each year to coincide with the Masters golf tournament. The CSRA Classic, a traditional style marching band competition, is also held each year in Augusta.\nEach year, Augusta also hosts the Augusta Futurity, the largest horse cutting show east of the Mississippi River. In 2009, the Futurity hosted its 30th annual event. Augusta hosts the Augusta Literary Festival on the first Saturday in March at the Augusta-Richmond County Library in downtown Augusta (823 Telfair Street).\nAlong with these annual events, downtown Augusta also hosts a monthly \"First Friday\" arts festival in the downtown Artist's Row district.\nAugusta hosts an annual LGBT (lesbian, gay, bisexual, transgender) pride parade called Augusta Pride. Augusta Pride attracted 4,000 people in 2010, its first year. The festival is rapidly growing and an estimated 7,000 people attended in 2011.\nTheater and dance\nThe metropolitan area supports a number of theatrical venues and both amateur and professional companies. The Imperial Theatre, where James Brown formerly practiced, and the Bell Auditorium are the largest dedicated theater venues in Augusta. The Miller Theater was formerly a movie theater and reopened in 2018 as the home of the Augusta Symphony and a theatrical space for music, comedy, dance and theatrical performances. The Le Chat Noir Theatre is a new addition to the theater scene in Augusta. The Greater Augusta Youth Theatre is a 501(c)(3) nonprofit youth theater company operated entirely by youth actors, directors, designers, artist and musicians of the Metro-Augusta area. All of these spaces are located in the downtown district.\nTwo theaters operate in the district of South Augusta. The Augusta Mini Theater recently opened its doors for both theatrical classes and performances. The Fort Gordon Dinner Theater is a long-running theater that is based on the military base of Fort Gordon. The Young Artists Repertory Theatre, Inc. is a 10-year-old youth theatre company based in adjoining Martinez.\nAugusta Ballet is a prominent presenting dance company based in Augusta. They present world-class performers mostly out of the Imperial Theatre. The Augusta Players are a theatrical troupe in the city.\nMusical venues and companies\nThe James Brown Arena is the largest venue in Augusta. It is used for a variety of events. Notably, the arena was named for Augusta-native musician James Brown just prior to his death in 2006.\nThe Augusta Symphony is a full concert orchestra that performs four major series each year. The Augusta Choral Society often performs with them, but also has its own concerts and series.\nArtists' Row\nArtists' Row is a small district located in downtown along Broad Street. This is an important landmark in downtown Augusta because it is one of the first revitalization efforts begun downtown. It is named for the art galleries located along the 700-1200 blocks. The business fronts stay open for First Friday, which began in 1995. Every first Friday of the month downtown galleries, dinners, and boutiques stay open until 10 pm.\nMuseums, historical sites, and other points of cultural interest\n*Academy of Richmond County\n*Augusta International Raceway\n*Augusta Museum of History\n*Artists' Row (Broad Street)\n*Confederate Powderworks\n*Ezekiel Harris House\n*Gertrude Herbert Institute of Art\n*Haunted Pillar\n*James Brown statue (Broad Street at the Augusta Common)\n*John S. Davidson Fine Arts Magnet School\n*Lucy Craft Laney Museum of Black History\n*Morris Museum of Art\n*Old Medical College\n*Sacred Heart Cultural Center\n*Springfield Baptist Church\n*Meadow Garden\nGreater Augusta Arts Council\nThe mission of the Greater Augusta Arts Council is to enrich the quality of life for citizens and visitors by advancing vibrant cultural arts. They serve as a resource for Augusta's arts community and help connect arts lovers to the events and programs they are passionate about. Founded in 1968 by the Greater Augusta Chamber of Commerce, the Junior Women's Club, and the Junior League of Augusta to serve as an umbrella organization for the arts in Augusta, they have taken an active role in supporting Augusta's cultural identity. They currently act as Augusta's public art agency, and also administer re-granting arts funds from the City of Augusta through the City Arts Grants Program.\nThey organize opportunities and events for both artists and art lovers, including the Arts in the Heart of Augusta Festival, a -day celebration of the varied arts and cultural diversity that make up Augusta. Other events and outreach programs they produce are: The Arts Weekly Radio Show & Podcast, Aspirations workshop series (including the Business of Being an Artist class produced in collaboration with the Gertrude Herbert Institute of Art, The City Gallery & the Gallery at Augusta and Company, and professional training sessions, the annual Wet Paint Party + Art Sale, and the annual Arts Awards dinner, the online Augusta Arts Calendar, the annual Arts Day Luncheon (formerly the Grassroots Legislative Luncheon), Public Art & Neighborhood Placemaking Projects, the City Arts Grants, and they offer daily support for all local artists and arts organizations.\nIn 2016, the Greater Augusta Arts Council partnered with Americans for the Arts to run the Arts & Economic Prosperity 5 (AEP5) study for Richmond & Columbia Counties. The insights it provides are useful for arts advocates, city leaders, arts educators and those who support the arts in any capacity to share the economic value and impact of the arts with our broader community. The Arts Council partnered with the City of Augusta, Columbia County, and the Georgia Council for the Arts in order to bring this study to the Central Savannah River Region and discover the impact of the arts to our local economy.\nSee also\n*Augusta, Georgia\n*History of Augusta, Georgia\n*List of public art in Augusta, Georgia\nReferences\n}}\nExternal links\n*[http://www.artsintheheart.com Arts in the Heart of Augusta Festival]\n*[https://web.archive.org/web/20080915131319/http://www.augustaarts.com/firstfriday.htm First Friday]\n*[http://www.westoboufestival.com Westobou Festival]\n*[http://www.augustaminitheatre.com Augusta Mini Theater]\n*[http://www.augustaplayers.org/ The Augusta Players]\n*[http://www.augustaballet.org/ Augusta Ballet]\n*[http://www.lcnaugusta.com Le Chat Noir Theatre]\n*[http://www.augustachoralsociety.org/ The Augusta Choral Society]\n*[http://www.metrospirit.com The Metro Spirit]"
    }
  ]
}