{
  "content": [
    {
      "type": "text",
      "text": "# Asbury Park Music Awards\n\nThe Asbury Park Music Awards was an annual award ceremony in Asbury Park, New Jersey, United States that recognized musicians for their work.\nAsbury Park's musical history includes a strong blues tradition and the Jersey Shore sound. Artists associated with the town include Bruce Springsteen, Southside Johnny and the Asbury Jukes, Bon Jovi, and many others. To recognize musicians and others associated with the local and regional music scene, Scott Stamper, founder of the  Wave Gathering Music Festival, and Pete Mantas founded the annual Asbury Park Music Awards (also called the Asbury Music Awards) in 1993. The awards were originally titled the Golden T-Bird Awards.\nScott Stamper announcing awards at the 2012 Asbury Music Awards ceremony\nThe first award ceremony was held in 1993 at the T-Bird Cafe, a small club that was owned by Stamper on Main Street in Asbury Park. The awards ceremony later moved to The Saint, and in 1995 the organizers renamed it the Asbury Park Music Awards. Attendance quickly exceeded The Saint's capacity and the ceremony began to rotate among larger venues, including The Fastlane and The Tradewinds. In later years, the ceremony was held at The Stone Pony.\nThe awards ceremony followed a format similar to the Grammy Awards, interspersing award presentations with live performances of original music and poetry.\nAward categories varied from year to year, but included: Top Young Band (Under 21), Top Male Adcoustic Act, Top Female Acoustic Act, Top Male Vocalist, Top Female Vocalist, Top Radio/Internet Station to Support Live Music, Top Avant Garde Act, Top Jam Band, Top Blues Band, Top Indie Rock Band, Top Heavy Rock Act, Top Punk/Ska Band, Top Groove Band, Poet Laureate, Top Multi Instrumentalist/Other Instruments, Top Live Performance, Top Americana, Top Rock Band, Top Pop Band, Top Local Release, Top Keyboard Player, Top Bassist, Top Drummer, Top Guitarist, Top Radio Personality to Support Live Music, Song of the Year, Top Journalist in Support of Live Music, Top News Publication in Support of Live Music, Top Music Website in Support of Live Original Music, Best Thing to Happen in [year], Top Local Club DJ, Beyond Asbury Top Record/EP/Single/Release, Living Legend 2010 James M. Macdonald Award, and Behind the Scenes Lifetime Achievement Award.\nExternal links\n* [http://www.asburymusicawards.com asburymusicawards.com]\nReferences"
    }
  ]
}