{
  "content": [
    {
      "type": "text",
      "text": "# Ashgrove, Queensland\n\n| local_map     = yes\n| zoom          = 12\n| pop           = 13450\n| pop_year      =\n| pop_footnotes =\n| area          = 5.9\n| established   =\n| postcode      = 4060\n| timezone      = AEST\n| utc           = +10:00\n| lga           = City of Brisbane (Enoggera Ward and The Gap Ward)\n| stategov      = Cooper\n| stategov2     = Ferny Grove\n| fedgov        = Brisbane\n| dist1         = 5.1\n| dir1          = NW\n| location1     = Brisbane CBD\n| near-nw       = Enoggera\n| near-n        = Enoggera\n| near-ne       = Alderley\n| near-w        = The Gap\n| near-e        = Newmarket\n| near-sw       = Bardon\n| near-s        = Bardon\n| near-se       = Red Hill\n}}\nAshgrove is a suburb in the City of Brisbane, Queensland, Australia. In the , Ashgrove had a population of 13,450 people.\nGeography\nAshgrove is located approximately  by road north-west of the Brisbane GPO. Ashgrove is known for its Ashgrovian houses built in the 1920s and 1930s, a type of Queenslander architecture characterised by an asymmetrical pyramid roof, multiple gables, verandahs and batten skirts.\nDorrington (originally named the suburb of Oakleigh until 1946) and St Johns Wood were suburbs in their own right until they were absorbed into Ashgrove in 1975. To this day these neighbourhood names are still in common use, as many residents still associate their residence locations with these former names.\nHistory\nAshgrove's native name is 'Kallindarbin' and was originally inhabited by the indigenous 'Turrbal' or 'Duke of York clan'. The main thoroughfare, Waterworks Road, was built on a Turrbal pathway that led to Mount Coot-tha, a place of the 'Honey-Bee Dreaming' and to the Enoggera Reservoir. The first sales of freehold land commenced in 1856, and ceased in 1875 when all available land was sold. Soon after sale of land stopped, the first school (the Ashgrove State School) and post office was established.\n' in St Johns Wood, 1880|alt=|left]]\nvilla in 1931 (built in 1876-7)|left]]\nThe area remained primarily a farming district until the end of the 19th century, when growth accelerated with the sale of land which housed one of the first homesteads in the area, the 'Granite House' in the area still known as St Johns Wood.\nAshgrove State School opened on 22 January 1877. A preschool centre was attached on 2 May 1944.\nIn July 1878, 25 lots of the Ithaca Creek Estate portion 664 were offered for sale, surveyed by E. MacDonnell. A plan shows the lots with one frontage to Waterworks Road and the other to Ithaca Creek. A classified advertisement states the estate is situated just beyond the residences of  Messrs. E. Hooker, W. Arundell, and Craig, adjoining on the city side the property of Mr C. J. Graham.\nTwo portions of the Holmesbrook Estate were advertised for sale by auction on 16 December 1878 by John Cameron. The estate was advertised as 160 half acre allotments bordered to the north by Enoggera Creek and to the south by the main Waterworks Road.\nCirca 1880, 11 subdivided allotments of \"Bristol Estate\" were auctioned by J. Barger & Co. A map advertising the auction shows that the Estate is on Main Waterworks Road.\nIn November 1888, 67 subdivided allotments of \"Lilley's Hill\" were auctioned by W. J. Hooker. A map advertising the auction shows that the site has frontages to: Main Waterworks Road, Clifton Street, Clifton Terrace, Windsor Road, Oval (Victoria Street) Road, Prospect Terrace, and Charles Street (now Speedy Street).\nIn April 1914, 95 residential sites named as Hawthorn Park, formerly known as Sir Samuel Griffiths Paddock were auctioned by Cameron Brothers. A map advertising the auction states that the estate is four minutes' walk from the Red Hill tram line. The land faces the main Waterworks Road and Woodland Street to the north.\nIn July 1917, the \"Greenwood Estate\", made up of 68 allotments surrounding Quandong Street, was advertised to be auctioned by Isles, Love & Co. A map advertising the auction states that the estate was three minutes' walk from the Newmarket tram terminus. The auction was delayed, and was held on 8 September 1917.\nIn January 1919, Archbishop of Brisbane James Duhig dedicated a chapel at Ashgrove in the house Beth-Eden. It was planned to build a church and school on the site later. On Sunday 24 April 1921 Duhig laid the foundation stone for the church. Onn Sunday 14 August 1921 Duhig officially opened and blessed St Finbarr's Catholic Church. In May 1924 Ashgrove separated from the Red Hill Catholic parish and become an independent parish.\nIn 1924, the tram line was extended from Red Hill, Queensland to Ashgrove, along Waterworks Road, connecting the suburb with the rest of Brisbane. The tram line closed on 5 August 1968.\nIn March 1924, the house Glen Lyon and  of surrounding land were purchased by Roman Catholic Archdiocese of Brisbane for a Catholic seminary. On Sunday 5 October 1924 Archbishop Duhig blessed the site, noting that Queensland had many candidates for the priesthood who had to be sent to New South Wales for their training, when it was the duty of every diocese to have its own seminary. In August 1924, land was advertised for sale in the Glenlyon Gardens Extension, (Fraser's Paddock) estate by T.M. Burke. A map advertising the sale shows the land bordered by Stewart Road to the north (now Frasers Road) and Mirrabooka Road to the east.\nIn 1925, the house Grantuly was purchased to establish a Catholic school and a convent. Archbishop Duhig invited the Sisters of Charity (then in Sydney) to establish the school and convent. St Finbarr's Catholic School opened on 1 June 1925. In 1927 a new primary school was built beside St Finbarr's Catholic Church and Grantuly then become a Catholic secondary school for girls. In 1941 it became known as Mt St Michael's College. The primary school passed into lay leadership in 1981 but the Sisters of Charity Education Council still operate the college.\nA map advertised the sale of 800 allotments at Royal Park Estate, now The Gap and St. John's Wood Extension Estate, Ashgrove by F. M. Anglim in August 1927.\nOakleigh State School opened on 29 January 1934.\nAshgrove Presbyterian Church opened on Saturday 7 March 1936 at 16 Oleander Avenue. In 1959 it was modified and renamed St David's Presbyterian Church. With the amalgamation of the Presbyterian Church into the Uniting Church of Australia, in 1977 St David's became part of the Ashgrove parish of the Uniting Church. Since at least 1996 it has been a private home. It was listed on the Brisbane Heritage Register on 30 October 2000.\nMarist College Ashgrove opened on 29 January 1940. It was established by the Marist Brothers under the leadership of headmaster Brother Ignatius O'Connor.\nOn 5 February 1950, Archbishop Duhig laid the foundation stone for Mater Dei Catholic primary school at 7 Lynwood Crescent. On 5 February 1951 the school opened with 50-55 students and two teachers, Sister Sebastian and Sister Patrick of the Sisters of Charity who travelled back and forward between their convent at Grantuly each day. On 5 August 1951 Duhig officially opened the school. On 19 March 1961 Duhig laid the foundation stone for the new convent at Mater Dei which was officially opened and blessed by him on 9 December 1962. With the declining number of Sisters and the increasing employment of lay teachers, in September 1974 the two remaining sisters in parish returned to live at the convent at Grantuly and the Mater Dei convent building was used to expand the school. In 1985 Sister Anne Crowley completed 33 years of service, handing over the leadership of the school to lay principal Greg Lang, ending the Sisters' involvement with the school.\nSt Paul's Anglican Church was opened on 15 June 1952 by Archbishop of Brisbane Reginald Halse. Its lychgate containing the church bell was dedicated to the memory of King George VI. It replaced an earlier wooden church.\nThe Anglican Church of the Good Shepherd was dedicated on 23 August 1959 by Archbishop Halse. It had two street frontages at 7 Firhill Street and 21 Baileys Road (). Following the construction of St Mark's Anglican Church at The Gap in 1978, declining support for the Church of the Good Shepherd led to its closure on 29 December 1985. It was sold to the Baptist Church and re-opened as the Ashgrove Baptist Church () on 3 September 1988.\nThe Ashgrove Library opened in 1967 with a major refurbishment in 2011.\nIn 2006, Ashgrove celebrated 'Ashgrove 150', an event organised by the Ashgrove Historical Society to commemorate 150 years of Ashgrove (1856–2006).\nDemographics\nIn the , Ashgrove had a population of 13,039 people.\nIn the , Ashgrove had a population of 13,450 people.\nHeritage listings\n, 2015]]\nAshgrove has many heritage-listed sites.\nAmenities\nThe suburb contains a variety of multicultural restaurants (Thai, Indian, Italian, Japanese, Chinese, Modern Australian), numerous cafes, various shopping amenities (including Coles, Aldi and Woolworths supermarkets).\nThe Brisbane City Council operates a public library at 87 Amarina Avenue ().\nSt Paul's Anglican Church is at 290 Waterworks Road (corner Jubilee Terrace, ).\nAshgrove West Uniting Church is at 491Waterworks Road (corner with Glory Street, ).\nPublic Hospitals:\n* Royal Brisbane and Women's Hospital – Located in Herston, approximately 5 km from Ashgrove.\n* The Prince Charles Hospital – Situated in Chermside, about 10 km from Ashgrove.\nPrivate Hospitals:\n* St Andrew's War Memorial Hospital – Located in Spring Hill, roughly 5 km from Ashgrove.\n* Brisbane Private Hospital – Also in Spring Hill, approximately 5 km from Ashgrove.\nTransport\nBus\nAshgrove is serviced by multiple council buses running along Stewart and Waterworks Roads into the central business district. Ashgrove is also a stop on the route of the cross-town Great Circle Line (598/599) which links the four major shopping malls of Brisbane.\nIt also hosts the northern terminus of the route 61 Maroon CityGlider which is one of two high profile, frequent, and long span \"CityGlider\" services strongly promoted by the Brisbane City Council. This service provides a cross town function linking Ashgrove with Paddington boutiques and cafes, Suncorp stadium, Caxton Street food and pub precinct, King George Square in the City Centre, Southbank Parklands and cultural district, 'The Gabba', Woolloongabba dining and antique district and Stones Corner cafe strip and outlet shopping.\nCycling\nAshgrove contains two major bicycle shared paths via Ithaca and Enoggera Creeks which provide a pleasant, mostly flat, off-road and backstreets commuter route to the Royal Brisbane hospital and onwards to the City Centre via the inner northern bikeway. Much of the route winds through pleasant treed parklands.\nEducation\nAshgrove State School is a government primary (Prep–6) school for boys and girls at 31 Glory Street (). In 2018, the school had an enrolment of 785 students with 57 teachers (49 full-time equivalent) and 21 non-teaching staff (14 full-time equivalent). It includes a special education program.\nOakleigh State School is a government primary (Prep–6) school for boys and girls at 47 Buxton Street (). In 2018, the school had an enrolment of 502 students with 40 teachers (29 full-time equivalent) and 25 non-teaching staff (13 full-time equivalent).\nSt Finbarr's Catholic Primary School is a Catholic primary (Prep–6) school for boys and girls at Betheden Terrace (). In 2018, the school had an enrolment of 190 students with 21 teachers (15 full-time equivalent) and 9 non-teaching staff (4 full-time equivalent).\nMater Dei Catholic Primary School is a Catholic primary (Prep–6) school for boys and girls at 7 Lynwood Crescent (). In 2018, the school had an enrolment of 247 students with 20 teachers (16 full-time equivalent) and 15 non-teaching staff (8 full-time equivalent).\nMt St Michael's College is a Catholic secondary (7–12) school for girls at 67 Elimatta Drive (). In 2018, the school had an enrolment of 851 students with 75 teachers (67 full-time equivalent) and 41 non-teaching staff (30 full-time equivalent).\nMarist College Ashgrove is a Catholic primary and secondary (5–12) school for boys at 142 Frasers Road (). In 2018, the school had an enrolment of 1,627 students with 136 teachers (128 full-time equivalent) and 102 non-teaching staff (92 full-time equivalent).\nNotable people from Ashgrove\n* Corey Brown (footballer) student at Marist College Ashgrove\n* Sir Julius Chan, former Prime Minister of Papua New Guinea boarding student at Marist College Ashgrove\n* John Connolly, former Wallabies coach student at Marist College Ashgrove\n* Des Connor, former rugby union player student at Marist College Ashgrove\n* John Eales, former captain of the Wallabies attended Marist College\n* Pietro Figlioli, Olympian – water polo student at Marist College Ashgrove\n* Macklin Freke, Brisbane Roar goalkeeper, grew up in Ashgrove.\n* Ben Griffin, soccer player student at Marist College Ashgrove\n* Deryck Guyler (English Actor) emigrated to Australia and retired in Ashgrove until his death in 1999\n* Matthew Hayden, Australian and Queensland cricketer student at Marist College Ashgrove\n* Daniel Heenan (rugby union) student at Marist College Ashgrove\n* Anthony Herbert (Former Australian Rugby Wallaby) attended the Marist School and still lives in Ashgrove\n* Daniel Herbert, former rugby union player student at Marist College Ashgrove\n* Nick Kruger, Queensland Bulls cricket player\n* Bill Ludwig OAM, Australian trade union official, is National President and Queensland state secretary of the Australian Workers' Union (AWU)\n* Andrew McGahan, novelist student at Marist College Ashgrove\n* Humphrey McQueen, Author and Historian student at Marist College Ashgrove\n* Ray Meagher, (actor) student at Marist College Ashgrove\n* Sean O'Brien, Australian professional windsurfer and Olympic Sailing Team coach student at Marist College Ashgrove\n* Kevin Rudd, Australia's former prime minister boarded at Marist College Ashgrove as a child\n* Harry Bryant, Internet personality and YouTuber, rose to fame after his iconic video 'Sweaty FART Prank on my SISTER?!' went viral\n* Andrew Stockdale from Wolfmother lived in Ashgrove as a child and attended Ashgrove State School\n* Lev Susany, Australian powerlifter and Commonwealth record holder student at Marist College Ashgrove\n* Meta Truscott, Australian diarist and Ashgrove historian\n* Keith Urban, country music singer (married to Nicole Kidman) attended Ashgrove State School (Primary)\nReferences\nExternal links\n* [http://queenslandplaces.com.au/ashgrove University of Queensland: Queensland Places: Ashgrove]\n*\n*\n*  — A description of Ashgrove in 1936.\n* [https://archive.today/20130412035235/http://www.stjohnswoodqueensland.weebly.com/ St Johns Wood Ashgrove website]\n* [https://metronorth.health.qld.gov.au/rbwh/ Royal Brisbane and Women's Hospital]\n* [https://aspiringsmiles.com.au/ Aspiring Smiles Dental]"
    }
  ]
}