{
  "content": [
    {
      "type": "text",
      "text": "# Ashur Ware\n\n| birth_place   = Sherborn, Massachusetts\n| death_date    =\n| death_place   = Portland, Maine\n| death_cause   =\n| resting_place =\n| resting_place_coordinates =\n| citizenship   =\n| nationality   =\n| party         =\n| otherparty    =\n| height        =\n| spouse        =\n| partner       =\n| relations     =\n| children      =\n| parents       =\n| mother        =\n| father        =\n| relatives     =\n| residence     =\n| education     = Harvard University (A.B.)read law\n| alma_mater    =\n| occupation    =\n| profession    =\n| known_for     =\n| salary        =\n| net_worth     =\n| cabinet       =\n| committees    =\n| portfolio     =\n| awards        =\n| signature     =\n| signature_alt =\n| website       =\n| footnotes     =\n}}\nAshur Ware (February 10, 1782 – September 10, 1873) was the 1st Secretary of State of Maine and a United States district judge of the United States District Court for the District of Maine.\nEducation and career\nBorn in Sherborn, Massachusetts, Ware received an Artium Baccalaureus degree from Harvard University in 1804 and read law to enter the bar in 1816. He was an editor of the Boston Yankee in Boston, Massachusetts from 1816 to 1817, and of the Eastern Argus in Portland, District of Maine, Massachusetts (State of Maine from March 15, 1820) from 1817 to 1820. He was in private practice in Portland from 1817 to 1820, and then served as the 1st Secretary of State of Maine from 1820 to 1822.\nFederal judicial service\nOn February 15, 1822, Ware was nominated by President James Monroe to a seat on the United States District Court for the District of Maine vacated by Judge Albion Parris. Ware was confirmed by the United States Senate on February 15, 1822, and received his commission the same day. Ware resigned on May 31, 1866, having served for over 44 years, one of the longest tenures of any United States federal judge.\nDeath\nWare died on September 10, 1873, in Portland.\nSee also\n*List of United States federal judges by longevity of service\nReferences\nSources\n*\n|years=1822–1866}}"
    }
  ]
}