{
  "content": [
    {
      "type": "text",
      "text": "# Ashutosh Tewari\n\n}}\nAshutosh K. Tewari (born in Kanpur, India) is the surgeon in chief at the Tisch Cancer Hospital. He is the chairman of urology at the Icahn School of Medicine at Mount Sinai Hospital in New York City. He is a board certified American urologist, oncologist, and principal investigator. Before moving to the Icahn School of Medicine in 2013, he was the founding director of both the Center for Prostate Cancer at Weill Cornell Medical College and the LeFrak Center for Robotic Surgery at NewYork–Presbyterian Hospital. Tewari was the Ronald P. Lynch endowed Chair of Urologic Oncology and the hospital's director of robotic prostatectomy, treating patients with prostate, urinary bladder and other urological cancers. He is the current president of the Society for Urologic Robotic Surgeons (SURS) and the Committee Chair of the Prostate Program. Tewari is a world-leading urological surgeon, and has performed over 10,000 robotically assisted procedures using the da Vinci Surgical System. Academically, he is recognized as a world-renowned expert on urologic oncology with over 250 peer reviewed published papers to his credit; he is on such lists as America's Top Doctors, New York Magazine's Best Doctors, and Who's Who in the World. In 2012, he was given the American Urological Association Gold Cystoscope Award for \"outstanding contributions to the field of urologic oncology, most notably the treatment of prostate cancer and the development of novel techniques to improve the outcomes of robotic prostatectomy.\"\nRobotic prostatectomy\nWith the introduction of the da Vinci Surgical System, the advent of robotic surgery using a laparoscopic approach has significantly changed the way prostate cancer surgery and prostatectomy procedures in general are performed as compared to the traditional 'open' methodology. Much of Tewari's research projects serve to promote robotic surgery as opposed to open procedures. For example, Tewari has shown that the operating field has become more visible to the surgeon, unobscured by the copious amounts of blood encountered in traditional surgery and is thus able to view the urological structures under three-dimensional, enlarged magnification. Patients reap even greater benefits. Due to the minimally invasive nature of the procedure, they experience minimized pain, minimized blood loss, less scarring and fewer complications. Post-surgery recovery is accelerated and patients experience quicker return to urinary continence and sexual function. Some of Tewari's current research is focused on comparing the benefits of robot-assisted surgery with traditional open prostatic surgery.\nCareer\nOn 15 October 2013, Tewari was named the chairman of urology at the Icahn School of Medicine at Mount Sinai Hospital in New York City. Previously he served as director of the Lefrak Institute of Robotic Surgery, director of prostate cancer, as well as the director of robotic prostatectomy and prostate cancer-urologic oncology outcomes at the Brady Urology Foundation of Weill Medical College. He is a tenured professor of urology at the Icahn School of Medicine at Mount Sinai. In addition, Tewari directs a fellowship program in Robotic Prostatectomy and Prostate Cancer Outcomes that has conducted research comparing robotic surgery outcomes versus those of laparoscopic and open surgeries. Tewari is an Attending physician at the Mount Sinai Hospital in New York City.\nMedical degree\nReceiving his medical degree from Ganesh Shankar Vidyarthi Memorial Medical College (GSVM) in Kanpur city of Uttar Pradesh, India, Tewari graduated with honors in 1984 with 17 gold academic medals to credit. He received his training in urology from Sanjay Gandhi Post Graduate Institute of Medical Sciences (SGPGIMS) in India under the mentorship of Professor Mahendra Bhandari and completed the McH and DNB program in 1991.\nTraining\nTewari has trained in the U.S. at UCSF, University of Florida and at HFHS under Dr. Mani Menon, where was part of the surgical team that performed the first robotic procedure at VUI. Tewari completed his urology residency at the Vattikuti Urology Institute (VUI) of the Henry Ford Hospital in Detroit, Michigan, in 2004. He received his urologic oncology research training at the University of California, San Francisco in 1994, the University of Florida in 1998, and VUI in 2004.\nResearch\nTewari's research interests revolve around the diagnosis and treatment of patients with urological cancers, with a focus on prostate cancer. His research ranges from the study of patient outcomes, robotic techniques, molecular markers for cancer aggressiveness, racial disparity in cancer biology, quality of life studies, strategies to improve nerve sparing and sexual function recovery, and anatomic studies to facilitate continence preservation to the development of next generation robotic techniques. He has received several federal and non-federal research funding grants for his research on prostate cancer, totaling several million dollars in grant capital. He is one of the few urologists in the world to receive an NIH R01 Grant. Additionally, he is among the first surgeons to use real time tissue imaging during surgery to minimize nerve damage in the patient and was the first surgeon in the world to use the catheter-less Prostate Surgery. The catheter-less surgery minimizes postoperative pain after prostatectomy.\nProfessional activities\nTewari serves as a reviewer for a number of prestigious professional journals, including the Journal of Urology, British Journal of Urology, Contemporary Urology, Medscape, Post Graduate Medicine, and Oncology Operational. He is the associate editor for BJU International. Tewari has served as a visiting professor and lecturer at dozens of venues both in the United States and abroad. Recently, Tewari spoke at the Annual International Prostate & Robotics Symposium in the United Arab Emirates and the Ohio State World Symposium of Robotic Surgery. He is also previously been on faculty of the International Robotic Urology Symposium.\nSociety memberships\nIn addition to directing serving as chairman of urology at the Icahn School of Medicine at Mount Sinai, Tewari is a member of several professional societies, including: American Association of Physicians of Indian Origin, American Urological Association, NYS Medical Advisory Board, International Society of Quality of Life Research, Society of Laparoendoscopic Surgeons, Society of Minimally Invasive Therapy, Society of Urologic Oncology (SUO), Indian Association of Urological Surgeons and Michigan Prostate Cancer Consortium.\nPhilanthropy\nCovid-19 Relief in India\nTewari responded to the COVID-19 crisis in India by rallying together with his team at the Department of Urology, his charitable organization Global Prostate Cancer Research Foundation, and the Mount Sinai Health System leadership, to donate over 450 pallets with over $4 million worth of oxygen concentrators, ventilators, BiPap machines and PPE equipment. The life-supporting devices were shipped to Mumbai and distributed to hospitals across India.\nThe initiative, called Project Heal India, was supported by actor Anupam Kher along with Baba Kalyani, the chairman and managing director of Bharat Forge, who assisted in coordinating the distribution of the essential supplies in India.\nMount Sinai Robert F. Smith Mobile Prostate Cancer Screening Unit Program\nThe Mount Sinai Robert F. Smith Mobile Prostate Cancer Screening Unit Program was launched to support prostate health in Black communities through mobile screening appointments and follow-up visits with urologists at Mount Sinai Hospital. The project, funded through a grant by philanthropist Robert F. Smith, is in response to the higher incidence and mortality of prostate cancer in Black men. Expected to launch in 2021, the program, headed by Tewari, will partner with local communities and raise prostate cancer awareness.\nAwards and honors\nIn December 2024, Tewari was awarded the Golden Robot Award for 2024. This prestigious award was bestowed by Merryl and James Tisch during a gala event at the Pierre Hotel. The award recognizes excellence in surgical innovations for cancer patients and marks a significant leap in medical innovation and patient care. Along with receiving the Golden Robot Award, Tewari announced the formation of the Golden Robot Society. This society inducted some of the top robotic surgeons from around the globe.\nIn May 2023, Tewari was named to Crain's New York Business Journal's 2023 Notable Health Care Leaders list. This recognition honors individuals in health care who are deemed to be influencing change through their executive responsibility, leadership abilities, medical expertise, achievements, philanthropic endeavors, and innovation.\nTewari was honored for his contributions during the pandemic in Crain's Notable in Health Care 2021. He also received the prestigious Gold Cystoscope Award in 2012 for his contributions to the field of urologic oncology.\nTewari is the recipient of the Albert Nelson Marquis Lifetime Achievement Award by Marquis Who's Who and certified as Most Compassionate Doctor by Vitals.com.\nReferences"
    }
  ]
}