{
  "content": [
    {
      "type": "text",
      "text": "# Askiya dynasty__disambig_1\n\nThe Askiya dynasty, also known as the Askia dynasty, ruled the Songhai Empire at the height of that state's power. It was founded in 1493 by Askia Mohammad I, a general of the Songhai Empire who usurped the Sonni dynasty. The Askiya ruled from Gao over the vast Songhai Empire until its defeat by a Moroccan invasion force in 1591. After the defeat, the dynasty moved south back to its homeland and created several smaller kingdoms in what is today Songhai in south-western Niger and further south in the Dendi.\nHistorical background\nAfter Sonni Ali's death in 1492, one of his sons, Sonni Baru, became ruler of the Songhay Empire. He was immediately challenged for the leadership by Muhammad (son of Abi Bakr) who had been one of Sonni Ali's military commanders. In 1493 Muhammad defeated Sonni Baru in battle and in so doing brought an end to the Sonni dynasty. Muhammad adopted the title of 'Askiya'. The origin of the word is not known. The Tarikh al-Sudan gives a 'folk etymology' and explains that the word derives from a Songhay expression meaning \"He shall not be it\" used by the sisters of Sunni Ali. The Tarikh al-fattash, in contrast, mentions that the title had been used previously. The early use of the title is supported by the discovery of tombstones (stellae) with the Askiya title dating from the 13th century in a cemetery in Gao.\nA patrilineal system of succession was used in which power passed to brothers before passing to the next generation. Some of the Askiya rulers had a large number of children creating great competition and sometimes fratricide. Margin notes in one manuscript of the Tarikh al-Sudan indicates that Askiya al-hajj Muhammad had 471 children while Askiya Dawud had 333. The Tarikh al-fattash states that Askiya Dawud had 'at least 61 children', of whom more than 30 died as infants.\nAt the time of the Moroccan invasion in 1591, the empire was ruled by Askia Ishaq II. After his defeat, Askiya Ishaq II was deposed by his brother, Askiya Muhammad Gao. The Moroccan military leader, Pasha Mahmud, set a trap for Askia Muhammad Gao and gave orders for him to be killed. Sulayman, another brother, then agreed to cooperate with the Moroccan army and was appointed as a puppet Askia in Timbuktu. Yet another brother, Nuh, became Askiya in Dendi, a region south of the modern town of Say in Niger. From Dendi Askiya Nuh organised a campaign of resistance against the Moroccan forces.\nSources\nThe 17th century Timbuktu chronicles, the Tarikh al-Sudan and the Tarikh al-Fattash, provide dates for the reigns of the Askiyas from the time of Askiya Muhammad usurping the leadership until the Moroccan conquest in 1591. The Tarikh al-Fattash ends in 1599 while the Tarikh al-Sudan provides information on the Askiyas in Timbuktu up to 1656. John Hunwick's partial translation of the Tarikh al-Sudan ends in 1613. Hunwick includes a genealogy of the Askiya dynasty up to this date. The later sections of the Tarikh al-Sudan are available in a translation into French made by  which was published in 1898-1900. Information on the dynasty after 1656 is provided by the Tadhkirat al-Nisyan. This is an anonymous biographical dictionary of the Moroccan rulers of Timbuktu written in around 1750. For the earlier entries the text is copied directly from the Tarikh al-Sudan. The Tadhkirat al-Nisyan also provides some information on the collaborating Askiya rulers based in Timbuktu. Elias Saad has published a genealogy of the Askiya dynasty.\nAfter the conquest of areas of West Africa at the end of the 19th century, the French government commissioned  to undertake a survey of the people in the occupied territories. In the Denki region the rulers of the small towns of Karimama, Madékali and Gaya claimed descent from the Askiya dynasty of Gao. These town are near the modern border between Niger and Benin. The published report provides a genealogy but does not indicated how the information was obtained nor whether it is likely to be reliable. At the time of Askiya Fodi Maÿroumfa (ruled 1798-1805) the Dendi kingdom split into three separate kingdoms with capitals in the above three towns.\nAskiya dynasty of the Songhai Empire\nThe names and dates of reigns listed below are those given in the translation of the Tarikh al-Sudan from Arabic into English by John Hunwick.\n*Askiya al-hajj Muhammad, son of Abi Bakr: 1493-1529\n*Askiya Musa, son of Askiya al-hajj Muhammad: 1529-1531\n*Askiya Muhammad Bonkana, son of Umar Komadiakha: 1531-1537\n*Askiya Isma'il, son of Askiya al-hajj Muhammad: 1537-1539\n*Askiya Ishaq I, son of Askiya al-hajj Muhammad: 1539-1549\n*Askiya Dawud, son of Askiya al-hajj Muhammad: 1549-1582 or -1583\n*[[Askia Al-Hajj|Askiya [Muhammad] Al-Hajj, son of Askiya Dawud]]: 1582-1586\n*Askiya Muhammed Bani, son of Askiya Dawud: 1586-1588\n*Askiya Ishaq II, son of Askiya Dawud: 1588-1591. Ishaq fled to Dendi after being defeated by the Moroccans, but was deposed.\nAskiya dynasty in Timbuktu\nThese are the Askiya rulers appointed by the Moroccans. The dates are from the Tadhkirat al-Nisyan. The spelling generally follows that used by Elias Saad.\n* Askiya Sulayman, son of Dawud: 1592-1604\n* Askiya Harun, son of Al-Hajj: 1604-1608\n* Askiya Bakr Kanbu, son of Yaqub: 1608-1619\n* Askiya Al-Hajj, son of Kisha: 1619-1621\n* Askiya Muhammad Bankanu, son of Muhammad al-Sadiq: 1621-1635\n* Askiya Ali Zalil, son of Kisha: 1635\n* Askiya Muhammad Bankanu, son of Muhammad al-Sadiq: 1635-1642\n* Askiya Al-Hajj, son of Muhammad Bankanu: 1642-1657\n* Askiya Dawud, son of Harun: 1657-1668\n* Askiya Muhammad al-Sadiq, son of Al-Hajj: 1668-1684\n* Askiya Muhammad, son of Al-Hajj: 1684-1702\n* Askiya Abd al-Rahman, son of Umar: 1705-1709\n* Askiya Bakr, son of Muhammad al-Sadiq: 1709-1718\n* Askiya Al-Mukhtar, son of Shams: 1718-1724\n* Askiya Al-Hajj, son of Bakr: 1730-1748\n* Askiya Mahmud, son of Ammar: 1748- ?\nAskiya dynasty of Dendi\nThe Tarikh al-Sudan includes a list of the Askia rulers of the Dendi after the Invasion. They were all descendants of Askiya Dawud who had ruled in Gao between 1549 and 1582. The list of Askiyas provides no dates but in a few cases the list specifies the length of their reigns. Most of the Askiyas based in Dendi are not mentioned elsewhere in the Tarikh al-Sudan, but for those that are, it is sometimes possible to date their reigns. There were usually succession struggles and some of the reigns were very short. In 1639 Pasha Mesaoud sacked the town of Lulami in Dendi where Askia Ismail was based. The location of Lulami is not known and the chronicle does not specify whether Lulami was a permanent capital. The Tadhkirat al-Nisyan makes no mention of Dendi or its rulers.\n* Askiya Muhammad Gao, son of Dawud: 1592\n* Askiya Nuh I, son of Dawud: c. 1592-1599\n* Askiya al-Mustafa, son of Dawud\n* Askiya Muhammad Sorko-ije, son of Dawud\n* Askiya Harun Dankataya, son of Dawud\n* Askiya al-Amin, son of Dawud: 1611-1618\n* Askiya Dawud II, son of Muhammad Bano: 1618-1639\n* Askiya Ismail, son of Muhammad Bano: c. 1639\n* Askiya Muhammad, son of Anasa: 1639\n* Askiya Dawud III, son of Muhammad Sorko-ije: 1639-\n* Askiya Muhammad Borgo, son of Harun Dankataya\n* Askiya Mar-Chindin, son of Fari-Mondzo Hammad\n* Askiya Nuh II, son of al-Mustafa\n* Askiya Muhammad Al-Borko, son of Dawud II\n* Askiya Al-Hajj, son of Dawud II\n* Askiya Ismail, son of Muhammad Sorko-ije\n* Askiya Dawud III, son of Muhammad Sorko-ije: in power in c. 1655 when the Tarikh al-Sudan was written\nThe report of the Tilho commission includes a list of rulers of Gao and then of Gaya in the region of Dendi. The early names do not match those in the lists above. The spelling below is as used in the report.\n* Askiya Maammarou, son of Kasseï: legendary ruler of the dynasty (based in Gao)\n* Askiya Daouda, son of Maammarou (based in Gao)\n* Askiya Karbachi Binta, son of Daouda (based in Gao)\n* Askiya Morobani, son of Daouda (based in Gao)\n* Askiya El Hadjj Hanga, son of Ismaïla, son of Morobani: -1761 (came from Gao to Dendi)\n* Askiya Samsou-Béri, son of El Hadjj Hanga: 1761-1779\n* Askiya Hargani, son of El Hadjj Hanga: 1779-1793\n* Askiya Samsou Keïna, son of Morobani: 1793-1798\n* Askiya Fodi Maÿroumfa, son of Samsou-Béri: 1798-1805\n* Askiya Tomo, son of Samsou-Béri: 1805-1823\n* Askiya Bassarou Missi Izé, son of Samsou-Béri: 1823-1842\n* Askiya Boumi a.k.a. Askia Kodama Komi, son of Samsou-Béri: 1842-1845\n* Askiya Koïzé Babba, son of Tomo: 1845-1864\n* Askiya Koïzé Babba Baki, son of Fodi Maÿroumfa: 1864-1865\n* Askiya Ouankoÿ, son of Tomo: 1865-1868\n* Askiya Biyo Birma, son of Tomo: 1868-1882\n* Askiya Doauda, son of Bassarou: 1882-1887\n* Askiya Malla, son of Tomo: 1887-1901\n* Askiya Igoumou, son of Bassarou: 1901-1905\nFrench conquest: 1901\nSee also\n*Songhai Empire\n*Dendi Kingdom\n*Sonni dynasty\n*Songhai people (subgroup)\nNotes\nReferences\n*. (Vol. 1 contains the Arabic text, Vol. 2 contains a translation into French). Internet Archive: [https://archive.org/details/tarikhalsudan00sadauoft Volume 1]; [https://archive.org/details/tarikhessoudanpa00sadauoft Volume 2]; Gallica: [http://gallica.bnf.fr/ark:/12148/bpt6k5460292j Volume 2].\n*. The anonymous 18th century Tadhkirat al-Nisyan is a biographical dictionary of the pashas of Timbuktu from the Moroccan conquest up to 1750. It also contains a list of the Timbuktu based Ashiyas on pages 289-297.\n*.\n*. Also available from [http://www.aluka.org/action/showMetadata?doi=10.5555/AL.CH.DOCUMENT.nuhmkati1&pgs= Aluka] but requires subscription.\n*.\n*.\n*."
    }
  ]
}