{
  "content": [
    {
      "type": "text",
      "text": "# Assault air warning squadrons\n\n|branch=  United States Marine Corps\n| type =\n| role = Air Defense / Early Warning\n| size = 181\n*14 Off / 163 Enl / 6 Corpsmen\n|command_structure=\n| garrison =\n| garrison_label =\n| current_commander =\n| ceremonial_chief =\n| notable_commanders =\n| identification_symbol_2 =\n| nickname =\n| patron =\n| motto =\n| colors =\n| march =\n| mascot =\n| battles = Battle of Saipan\n| anniversaries =\n| decorations =\n| battle_honors =\n}}\nAssault Air Warning Squadrons were United States Marine Corps aviation command and control units formed during World War II to provide early warning, aerial surveillance, and ground controlled interception during the early phases of amphibious landing.  These squadrons were supposed to be fielded lightweight radars and control center gear in order to operate for a limited duration at the beginning of any operation until larger air warning squadrons came ashore. Four of these squadrons were commissioned during the war with one, AWS(AT)-5, taking part in the Battle of Saipan. All four squadrons were decommissioned on 10 November 1944 because the Marine Corps was unable to field the required mobile radars.  The \"first in\" capability that the Assault Air Warning Squadrons were supposed to provide was transferred to the Early Warning Teams that were added to the tables of organization for the regular air warning squadrons.\nHistory\nAs the Guadalcanal Campaign was winding down, the Commandant of the Marine Corps convened a radar policy board on 11 February 1943.  Led by Colonel Walter L. J. Bayler, the board was tasked to make recommendations regarding the establishment of an adequate radar warning program, radar fire control, and radar fighter direction for Marine Corps units during amphibious operations.  Among the boards final recommendations was organizing an air warning program with multiple air warning groups each composed of four air warning squadrons (AWS) and one air warning squadron (air transportable) (AWS(AT)).  On 15 May 1943, the Commandant of the Marine Corps approved the boards recommendations which were titled Standing Operating Procedure for Radar Air and Surface Warning and Radar Fire Control in the Marine Corps.\nThe primary mission of the air transportable squadrons was to provide early warning of enemy air attack during the early phases of an amphibious assault.  Their secondary mission was to control friendly aircraft in those cases where control shipboard control was unavailable.  The air transportable squadrons were designed to be much smaller and more mobile than the bulky air warning squadrons which contained long range search radars, large control vans and an expansive utilities footprint. The initial concept envisioned them as very lightweight and capable of being transported via air. Another defining feature of these squadrons was the inclusion of a ground observer division consisting of two officers and forty-eight enlisted men.  The ground observer divisions were tasked to come ashore with the assault units and monitor the air defense nets of the United States Navy's radar picket ships to give advanced warning of enemy air raids.\nAWS(AT)-5 was the first air transportable squadron commissioned in the Marine Corps on 1 December 1943.  The equipment and personnel required for AWS(AT)-5 was still in flux as the squadron was standing up and beginning to train.  The largest technical problem affecting these new squadrons was that the Marine Corps was unable to procure a lightweight search radar capable of being transported via air.  Because of this it was decided to utilize the SCR-527, a larger, medium range radar already in the Marine Corps' inventory. With the addition of the SCR-527 the squadrons were no longer air transportable.  Because of the increase in size and inability to move via airplane the squadrons designators were changed in July/August 1944 to Assault Air Warning Squadrons.\nFollowing the Battle of Saipan and the recommendation of General Holland Smith the air warning program in the Marine Corps was reorganized.  It was determined that organizing the larger Air Warning Squadrons into an Assault Echelon and Main Body echelon was a more efficient means of quickly providing a complete air warning/fighter direction network during amphibious assaults. As a result of this reorganization the Marine Corps approved the decommissioning of the Assault Air Warning Squadrons on 1 November 1944.  Accordingly, all four squadrons wee decommissioned on 10 November 1944.\nSquadron histories\nAssault Air Warning Squadron 5\n*2nd Marine Division detachment\n** 3 officers and 60 Marines\n**\n*4th Marine Division detachment\n** 3 officers and 60 Marines\n**\n*V Amphibious Corps detachment\n** 6 officers and 36 Marines\n**\n}}\nAir Warning Squadron (Air Transportable) 5 was commissioned on 1 December 1943 at Marine Corps Air Station Cherry Point, North Carolina.  It was the first air-transportable air warning unit in the Marine Corps.  On 10 January 1944 the squadron was transported to St. Simons and Jekyll Islands in order to practice its amphibious assault capabilities.  It returned to MCAS Cherry point on 18 January and began preparing for movement to the West Coast.\nOn 29 March, AWS(AT)-5 boarded the  at Naval Air Station North Island  and sailed west.  The squadron arrived at Pearl Harbor, Hawaii on 4 March and made camp at Marine Corps Air Station Ewa. On 16 April it was transferred to the operational control of the V Amphibious Corps and a day later divided into three separate detachments to support future operations (See table to the right). The squadron departed Hawaii on 1 June 1944 on the way to its first amphibious assault.\nAWS(AT)-5's three echelons disembarked at Saipan between 17–19 June and participated in combat operations during the next month.  Two members of the squadron were killed in action during the battle. On 10 July, while still on Saipan, the squadron was re-designated as Assault Air Warning Squadron 5. On 28 July the squadron sailed back to Hawaii on board the , , and .  On the return trip to Hawaii squadron personnel were tasked with guarding Japanese prisoners of war. The squadron arrived back in Hawaii on 10 August and returned to MCAS Ewa to conduct maintenance on equipment and continue training.   Following the revision of the air warning program, AAWS-5 was decommissioned on 10 November 1944.  To date, no other Marine Corps squadron has carried the lineage and honors of AAWS-5 to include Marine Air Control Squadron 5 (MACS-5).\nCommanding Officer\n* Capt Donald D. O'Neill (1 December 1943 – 10 November 1944)\nUnit Awards\n{|class=wikitable\n! Streamer\n! Award\n! Year(s)\n! Additional Info\n|-\n||\n||Asiatic-Pacific Campaign Streamer with one Bronze Star\n||\n|| Saipan\n|-\n||\n||World War II Victory Streamer\n||1941–1945\n||Pacific War\n|-\n|}\n* The AWS(AT)-5 echelon that supported the 4th Marine Division during the Battle of Saipan received a Presidential Unit Citation.  This was not awarded to all personnel in the squadron.\nAssault Air Warning Squadron 10\nAir Warning Squadron (Air Transportable) 10 was commissioned on 1 January 1944 at Marine Corps Air Station Cherry Point, North Carolina on the authority of 3d Marine Aircraft Wing General Order #36-1943. The squadron departed MCAS Cherry Point on 1 March 1944 headed for the west coast.  It arrived at MCAD Miramar on 6 March. Upon arrival it received its full allotment of equipment from Marine Air Warning Group 2.  After that the squadron took part in numerous practice amphibious landings at Naval Base Coronado, CA and additional air defense problems while operating in Aliso Canyon, CA.  On 21 July 1944 the squadron provided a radar and control center exhibit for Admiral William D. Leahy  and President Franklin D. Roosevelt.  With the addition of the SCR-527 to the table of organization the squadron was no longer air transportable thus on 1 August 1944 it was re-designated as Air Assault Warning Squadron 10.  On 24 October the squadron was moved to Marine Corps Auxiliary Air Field Gillespie, CA to continue its training however on 2 November, orders were received from Headquarters Marine Corps stating the squadron was to be disbanded.  Air Assault Warning Squadron 10 was officially decommissioned on 10 November 1944 and its personnel were distributed amongst other available air warning squadrons.\nCommanding Officer\n*Capt Herbert C. Storey (1 February 1944 – 10 November 1944)\nAssault Air Warning Squadron 15\nAir Warning Squadron (Air Transportable) 15 was commissioned on 1 February 1944 at Marine Corps Air Station Cherry Point, North Carolina on the authority of 3d Marine Aircraft Wing General Order #1-1944.  The squadron departed MCAS Cherry Point on 27 March and arrived at Marine Corps Air Depot Miramar, California on 1 April.  In early June the squadron was moved to Marine Corps Air Station El Centro, CA in order to work with Marine Base Defense Aircraft Group 43.  While at MCAS El Centro the squadron conducted over eight hundred successful aircraft intercepts.  It returned to MCAS Miramar in October and was officially decommissioned on 10 November 1944.\nCommanding Officer\n*1stLt Craig W. Parris (1 February 1944 – 10 November 1944)\nAssault Air Warning Squadron 20\nAir Warning Squadron (Air Transportable) 20 was commissioned on 1 March 1944 at Marine Corps Air Station Cherry Point, North Carolina on the authority of 3d Marine Aircraft Wing General Order #36-1943. On 1 May 1944 the squadron departed MCAS Cherry Point and moved to Marine Corps Air Depot Miramar, California.  In June 1944 it moved north to Marine Corps Air Station Santa Barbara, CA to work with Marine Base Defense Aircraft Group 42.  Because the Marine Corps was unable to procure lightweight radar equipment the squadron fielded its first SCR-527 in August 1944.  On 30 October 1944 the squadron returned to MCAD Miramar.  MAAWS-20 was decommissioned on 10 November 1944 and its personnel were reassigned to other air warning squadrons.\nCommanding Officer\n*1stLt Lloyd B. Hatcher (1 March 1944 – 10 November 1944)\nSee also\n*Marine Corps Aviation\n*United States Navy Argus Units\n*List of United States Marine Corps aviation support units\nCitations\nReferences\n;Bibliography\n*\n*\n*\n;Web\n*"
    }
  ]
}