{
  "content": [
    {
      "type": "text",
      "text": "# Assault on the battleships Cabral and Lima Barros\n\n| place             = Tagy, left bank of the Paraguay River\n| result            = Brazilian victory\n| combatant1        =\n| combatant2        =\n| commander1        =  Ignacio Genes\n| commander2        =  Joaquim da Costa\n| strength1         = 1,10022 canoes\n| strength2         = 6 ironclads\n| casualties1       = 100–400 killed and wounded14 canoes\n| casualties2       = 86:16 killed55 wounded15 captured\n| campaignbox       =\n}}\nThe 'assault on the battleships Cabral and Lima Barros' was a naval action that took place at dawn on 2 March 1868, during the Paraguayan War, when Paraguayan canoes, yoked two by two, disguised with branches and with 50 soldiers each, approached the Brazilian ironclads Lima Barros and Cabral.\nThe attack\nOn the night of 2 March 1868, the Brazilian squadron, which had already achieved the Passage of Humaitá, was anchored on the Paraguay River, in front of the Tagy redoubt, near Humaitá. Its vanguard were the ironclads Cabral and Lima Barros; at the stern of these, the ironclads Silvado and the Herval; below, at the mouth of the D'Oro River, as a signal repeater, the Mariz e Barros; at Porto Elisário, Brasil, with the admiral-in-chief on board, and Colombo.\nTaking advantage of the darkness of the night and the aquatic plants and rafts that descended by the current, a squadron of canoes covered by branches and foliage and tied up two by two, each crewed by 50 Paraguayans armed with machetes, hatchets and boarding swords, went to board Cabral and Lima Barros. The Paraguayans were discovered when a patrol boat boarded one of the false aquatic plants and raised the alarm, forcing the Paraguayans to alter their plan of attack. Confused, they only managed to land 14 canoes on Lima Barros and 8 on Cabral, dumping men on their decks who took over the awnings of the warships. A hand-to-hand fight was fought; the ironclads' crews and soldiers locked themselves inside the casemates, resisting with gunfire.\nThe battle continued until dawn, when the battleships Brasil, Herval, Mariz e Barros and Silvado approached and fired at the Paraguayans, who gave up the attack, losing up to 400 men and 14 canoes. On the Brazilian side, there were 16 dead, including captain of sea and war Joaquim Rodrigues da Costa and first lieutenant João de Gomensoro Wandenkolk. Among the wounded, the commander of Lima Barros, captain of frigate Garcindo de Sá, captain lieutenants Foster Vidal and Alves Nogueira, first lieutenants Otaviano Vital de Oliveira, Souza Pinto and Castro Rocha, second lieutenant Rodrigo de Lamare and the midshipman Barros Gandra.\nGallery\nFile:BERNARDINO, rei dos práticos. Episódio da Guerra do Paraguay, passado a bordo do encouraçado — Lima Barros — na occasião da abordagem do dia 2 de Março.jpg|Maritime pilot Bernardino Gustavino killed in action during the assault\nFile:Glorioso combate dos encouraçados brasileiros attacados pelos paraguayos no dia 2 de março de 1866.jpg|The assault on 2 March 1868\nFile:Abordagem dos couraçados \"Lima Barros\" e \"Cabral\".jpg|The assault on Lima Barros (right)\nReferences\nCitations\nBibliography\n*\n*\n*"
    }
  ]
}