{
  "content": [
    {
      "type": "text",
      "text": "# Association football during World War II__disambig_1\n\nWhen World War II was declared in 1939, it had a negative effect on association football; competitions were suspended and players signed up to fight, resulting in the deaths of many players.\nLeague football\nAustria\nThe Republic of Austria had ceased to exist with the Anschluss in 1938 and the Austrian league had become a part of the German football league system, under the name of Gauliga Ostmark. League football resumed in a now independent Austria in 1945.\nEngland\nThe 1939–1940 season was the 65th season of competitive football in England. In September 1939, shortly after World War II was declared, most football competitions were abandoned as the country's attention turned to the war effort. Regional league competitions were set up instead as there was a 50-mile limit for travelling implemented by the government during this time. Appearances in these tournaments do not count in players' official records. A few leagues, such as the Northern League, did manage to complete a season, but more than half of the teams were unable to fulfil all their fixtures and resigned. Many footballers signed up to fight in the war and as a result many teams were depleted, and fielded guest players instead – Crystal Palace fielded 186 different players during the seven wartime seasons. The FA Cup was resumed for the 1945–46 season and The Football League for the 1946-47 season.\nGermany\nThe 1939–40 season started in August 1939, but with the outbreak of the Second World War shortly after, league football was suspended. It only resumed at the end of October, with a number of local city-championships having been played to bridge the gap. As the war progressed, top-division football became more regionalised. It also expanded into occupied territories, some of them annexed into Greater Germany, increasing the number of tier-one Gauligas considerably from the original 16 in 1933. The last German championship was played in 1944 and won by Dresdner SC, but the last official league game was played as late as 23 April 1945, being the FC Bayern Munich versus TSV 1860 Munich derby in the Gauliga Oberbayern, ending 3–2. The final years of league football saw the rise of military teams, like LSV Hamburg, who reached the 1944 German championship final, since most top-players were drafted into the German armed forces and played for these sides. Representative teams like the Rote Jäger also had a number of German internationals playing for them.\nWith the end of the war, ethnic German football clubs in the parts of Germany that were awarded to Poland and the Soviet Union disappeared. Clubs like VfB Königsberg and Vorwärts-Rasensport Gleiwitz, who had successfully competed in the German championship on many occasions disappeared for good. In Czechoslovakia, where the ethnic German minority in the Sudetenland was forced to leave the country, clubs experienced the same fate. A few, like BSK Neugablonz, were reformed by these refugees in West Germany.\nSome of the events of the war continued to affect German football. Within the first two weeks of the re-development of the Mercedes-Benz Arena in 2009, home of the VfB Stuttgart, 18 undetonated bombs left over from air raids on Stuttgart during the Second World War were found on the construction site. The stadium was originally built, like so many others in Germany, on rubble left over from the war.\nItaly\nThe Italian Serie A continued to operate during the war, up until 1943. A regional championship was played in 1944, before resumption of the league in a limited form in 1945.\nScotland\nThe Scottish Football League and Scottish Cup were suspended in 1939, with unofficial regional competitions replacing them. These were dominated by Rangers, who won the 1939–40 Scottish War Emergency League and all of the six Southern League tournaments played, plus four of six Southern League Cups, the one-off Scottish War Emergency Cup in 1940, one of five Summer Cups and the one-off Victory Cup in 1946.\nSwitzerland\nFootball was affected less in World War II than it was during World War I.\nInternational football\nEngland\nEngland played 29 unofficial wartime internationals between 11 November 1939 and 5 May 1945, 14 against Wales and 15 against Scotland.\nGermany\nWith the outbreak of the Second World War, Germany did not cease to play internationals but was limited to neutral, axis and puppet states. Its first war international was held on 24 September 1939, a loss to Hungary in Budapest. Altogether, the country played 35 international games during the war, its last on 22 November 1942, against Slovakia.\nScotland\nScotland played 19 unofficial wartime internationals between 2 December 1939 and 24 August 1946, 17 against England and one each against Wales and Northern Ireland.\nWales\nWales played seventeen wartime unofficial matches for which the players were not awarded caps, and a further six matches in aid of war charities.\nFootball for morale\nFootball was seen as a morale booster during the horrors of World War II, for both soldiers and civilians. Tom Finney captained Army football teams, and organised friendly matches in Austria and Egypt.\nEffects on footballers\nSoldiers\nSome players, such as Norman Corbett, have expressed the opinion that the War ruined their careers.\nMany German players, drafted into the Wehrmacht, saw their careers shortened or interrupted. Fritz Walter, captain of the 1954 World Cup-winning team of Germany who made his debut for the country during the war in 1940, missed many years of his career due to serving in the military from 1942 and spending time as a POW after the war. Fritz Walter served as a paratrooper and also spent time in a Soviet labour camp.\nMany German football clubs suffered heavy casualties from Hitler's war. An amateur club like SVO Germaringen saw ten of its eleven players that had won a local youth championship in 1940 not return from the battle fields. TSV 1860 Rosenheim had 170 of its club members drafted into military service, of those, 44 were killed in action and another 15 are missing. Those that did return found the clubs facilities completely destroyed by air raids on the town in October 1944 and April 1945. Rosenheim was on an important rail- and road intersection.\nThe Holocaust\nA number of Jewish footballers were murdered during the Holocaust, and the Jewish association football scene, once very prominent and influential in international football, was destroyed. The Hungarian Jewish international footballer József Braun was murdered in a Nazi labor camp in 1943, and the Hungarian football manager Árpád Weisz was murdered at Auschwitz in 1944. Henrik Nádler was murdered in Buchenwald concentration camp. Julius Hirsch, the first Jewish player to represent the Germany national team, was murdered at Auschwitz, being legally declared dead in May 1945. Hirsch had served for four years in the German Army in the First World War, had been decorated with the Iron Cross and was a German patriot, unable and unwilling to believe that his life could be at risk.\nHowever, some people also survived the concentration camps. Leo Goldstein survived the camps to become a FIFA international referee. Goldstein is also a member of the National Soccer Hall of Fame. Hungarian coach Alfréd Schaffer was interned at Dachau, and was liberated by the Allies. He died naturally in the nearby town of Prien am Chiemsee a few months later.\nCollaborationism\nSome footballers also collaborated with the Nazis. Alexandre Villaplane, who was captain of the French national side, worked actively with the Gestapo and eventually became a SS lieutenant. He was executed in December 1944. The Estonian international goalkeeper Evald Mikson was accused by the Simon Wiesenthal Center (in particular by Efraim Zuroff) of committing serious war crimes against Jews during the War, when he was working as Deputy Head of Police in Tallinn.\nDecorated footballers\nScottish footballer Willie Thornton won the Military Medal, while German goalkeeper Bert Trautmann won a total of five medals, including an Iron Cross. English player Harry Goslin, who with the entire Bolton Wanderers team had enlisted as one just before the war, had received the Military Cross before he died of wounds in Italy.\nFormer players killed in action\nSee also\n*Association football during World War I\n*The Death Match\nReferences"
    }
  ]
}