{
  "content": [
    {
      "type": "text",
      "text": "# Association of the Women of the Islamic Republic\n\nThe Association of the Women of the Islamic Republic (, Jam’iat-e Zanan-e Jomhouri-e Islami) is an Iranian reformist political party. It was the first officially registered party of the Islamic Republic of Iran.\nIts stated goal is introducing \"genuine Islamic culture\", supporting \"the rights of the oppressed\", and facing \"out superpowers' imperial culture, racism and zionism,\" along with enhancing women's \"scientific, intellectual and cultural capabilities\", women's rights, \"increased women's participation\". It has been described as \"promoting\" the Islamic Republic \"through sponsoring candidates for the Majlis and participated in international conferences\". The society is also known as the '''Women's Association of the Islamic Republic and the Society of the Women of the Islamic Republic of Iran'.\nThe secretary general of the society has been Zahra Mostafavi, a daughter of Ayatollah Khomeini, the founder of the Islamic Republic of Iran.  Nida'', is the official quarterly organ of the society.\nHistory and profile\nThe party was established 1987.\nIn December 1987 it established a committee to combat \"bad hejab\" (i.e. insufficiently modest covering of women's hair and heads), holding a rally of `Vanguards of Chastity` (''tali'eh-daran-e `efaf'') and setting up subcommittees to conduct research on \"Western cultural penetration\" and \"ways to counter Western cultural banality.\"\nThe party supported Mohammad Khatami in the 1997 and 2001 presidential elections. Akbar Hashemi Rafsanjani was supported by the party in the 2005 elections. Mir-Hossein Mousavi enjoyed the support of the party in the 2009 elections. The party’s main objective was to improve women’s rights in Iran and various international conferences for this aim were organized by the group.\nNotable members besides Zahra Mostafavi include Fatemeh Karroubi, wife of Mehdi Karroubi;  Marzie Hadidchi (Dabbagh), the \"only woman to be a commander in the Corps of the Revolutionary Guards\";  and Zahra Rahnavard, the former president of Alzahra University (and wife of Mir Hossein Mousavi).\nThe Iranian Data Portal describes its original \"main goal\" as improving \"women’s rights in connection with inheritance, family, employment, and divorce, and to defend the presence and activity of women in the public sphere\".\nMembers of Parliament\nIn the different elections to Iran's Parliamentary (Islamic Consultative Assembly) since 1984, the association has won as few as 0 seats (in 2008 and 2012) and as many as 4 (in 1996).\n{|class=\"wikitable\" style=\"text-align:center; font-size:100%; line-height:16px;\"\n|-\n!Years\n!Seats\n!+/–\n|-\n||1987–88\n||||\n|-\n||1988–92\n||||\n|-\n||1992–96\n|||| 2\n|-\n||1996–00\n|||| 3\n|-\n||2000–04\n|||| 1\n|-\n||2004–08\n|||| 2\n|-\n||2008–12\n|||| 1\n|-\n||2012–16\n||||\n|-\n||2016–\n|||| 2\n|}\nSee also\n*History of the Islamic Republic of Iran\n*Women in Iran\nReferences"
    }
  ]
}