{
  "content": [
    {
      "type": "text",
      "text": "# Association of Certified Engineering Technicians and Technologists of Prince Edward Island__disambig_1\n\n}}\nThe Association of Certified Engineering Technicians and Technologists of Prince Edward Island (ACETTPEI) is Prince Edward Island's independent certifying body for engineering/applied science technicians and technologists.\nACETTPEI confers the designations \"C.Tech.\", \"C.E.T.\" and \"A.Sc.T.\" which are symbols of achievement in engineering/applied science technology and are legally protected for use only by fully certified members.  The designations are recognized across Canada by many employers and other engineering professionals through the efforts of provincial associations that make up the Canadian Council of Technicians and Technologists (CCTT).  Though CCTT being a signatory, ACETTPEI recognizes international transferability through the Sydney Accord.\nACETTPEI was established in 1972.\nIn 2007 ACETTPEI, with the assistance of other Atlantic Canada Technology organizations and some federal government funds, held the Atlantic Canada Technology Roundtable.  This was a meeting of private, public, and educational sectors to examine the issues of technology skills shortages which may have hampered economic growth in the region and is expected to get worse due to baby boomer retirement.\nACETTPEI has registered the tradename Island Technology Professionals.\nSee also\n*Engineering technologist\n*Certified engineering technologist\n*Professional technologist\n*Engineering technologist\n*Sydney Accord\n*Island Technology Professionals\nReferences\nExternal links\n*[http://www.acettpei.ca ACETTPEI official page]\n*[http://www.cctt.ca Canadian Council of Technicians and Technologists (CCTT)]\n*[https://web.archive.org/web/20120218125503/http://www.acettpei.ca/images/Report-of-Atlantic-Canada-Technology-Roundtable-08-03-25.pdf The report on the Atlantic Canada Technology Roundtable 2007]"
    }
  ]
}