{
  "content": [
    {
      "type": "text",
      "text": "# Assyrian conquest of Egypt\n\nThe Assyrian conquest of Egypt covered a relatively short period of the Neo-Assyrian Empire from 673 to 663 BCE. The conquest of Egypt not only placed a land of great cultural prestige under Assyrian rule but also brought the Neo-Assyrian Empire to its greatest extent.\nContext\nTaharqa, pharaoh of the Twenty-fifth Dynasty of Egypt and qore of the Kingdom of Kush, began agitating peoples within the Neo-Assyrian Empire in an attempt to gain a foothold in the region. As a result, in 701 BCE, Hezekiah, the king of Judah, Lule, the king of Sidon, Sidka, the king of Ashkelon, and the king of Ekron formed an alliance with Egypt against Assyria. The Neo-Assyrian emperor Sennacherib (r. 705–681) attacked the rebels, conquering Ashkelon, Sidon and Ekron and defeating the Egyptians and driving them from the region. He marched toward Jerusalem, destroying 46 towns and villages (including the heavily defended city of Lachish) in his path. This is graphically described in Isaiah 10. Exactly what happened next is unclear: the Bible says an angel of the Lord killed 185,000 Assyrian soldiers at Jerusalem after Hezekiah prayed in the temple; Sennacherib's account says Judah paid him tribute and he left. There are various other theories as to why the Assyrians failed to take Jerusalem and withdrew to Assyria., including a threat from Taharqa's army, disease, divine intervention, Hezekiah's surrender, or Herodotus' mice theory.\nIn 681, Sennacherib was murdered by one or more of his sons, perhaps as retribution for his destruction of Babylon. According to 2 Kings 19:37, while praying to the god Nisroch, he was killed by two of his sons, Adramalech and Sharezer, and both of these sons subsequently fled to Urartu; this is repeated in Isaiah 37:38 and alluded to in 2 Chronicles 32:21.\nInvasion of Esarhaddon (673 BCE)\n, showing Kushites defeating Assyrians]]\nEsarhaddon (ruled 681–669), the son of Sennacherib, led several campaigns against the pharaoh-qore Taharqa of Egypt and Kush, which he recorded on several monuments. His first attack in 677, aimed at pacifying Arab tribes around the Dead Sea, led him as far as the Brook of Egypt.\nCampaign of 673 BCE\nof the 25th Dynasty Taharqa (ruled 690-664 BCE), who led the fight against the Assyrians. Louvre Museum reconstruction.]]\nEsarhaddon raided Egypt in 673. This invasion, which only a few Assyrian sources discuss, ended in what some scholars have assumed was possibly one of Assyria's worst defeats. Taharqa and his army defeated the Assyrians outright in 674, according to Babylonian records. The Egyptians had for years sponsored rebels and dissenters in Assyria and Esarhaddon had hoped to storm Egypt and take this rival out in one fell swoop. Because Esarhaddon had marched his army at great speed, the Assyrians were exhausted once they arrived outside the Egyptian-controlled city of Ashkelon, where Taharqa's forces defeated them. Following this defeat, Esarhaddon abandoned his plan to conquer Egypt for the moment and withdrew back to Nineveh.\nCampaign of 671\nTwo years later, Esarhaddon launched a full invasion. In the early months of 671, Esarhaddon again marched against Egypt. The army assembled for this second Egyptian campaign was considerably larger than the one Esarhaddon had used in 673. He marched much slower to avoid the problems that had plagued his previous attempt. On his way, he passed through Harran, one of the major cities in the western parts of his empire. Here, a prophecy was revealed to the king, which predicted that Esarhaddon's conquest of Egypt would be successful. According to a letter sent to Ashurbanipal after Esarhaddon's death, the prophecy was the following:\n(now in the Pergamon Museum) was created following the king's victory in Egypt and depicts Esarhaddon in a majestic pose with a war mace in his hand and a vassal king kneeling before him. Also present is Ushankhuru, the small son of the defeated pharaoh Taharqa, kneeling and with a rope around his neck.]]\n]]\n}}\nThree months after receiving this prophecy, Esarhaddon's forces were victorious in their first battle with the Egyptians. Despite the prophecy and initial success, Esarhaddon was not convinced of his safety. Just eleven days after he had defeated the Egyptians, he performed the \"substitute king\" ritual, an ancient Assyrian method intended to protect and shield the king from imminent danger announced by some sort of omen. Esarhaddon had performed the ritual earlier in his reign, but this time it left him unable to command his invasion of Egypt.\nIn 671, Esarhaddon took and sacked Memphis, where he captured numerous royal family members. Although the Pharaoh Taharqa had escaped to the south, Esarhaddon captured the Pharaoh's family, including his son and wife, and most of the royal court, which was sent back to Assyria as hostages.  Esarhaddon reorganized the political structure in the north, governors loyal to the Assyrian king were placed in charge of the conquered territories, and he established Necho I as king at Sais. Upon Esarhaddon's return to Assyria he erected a stele alongside the previous Egyptian and Assyrian stelae of Nahr el-Kalb, as well as the victory stele of Esarhaddon at Zincirli Höyük, showing Taharqa's young son Ushankhuru in bondage.\nThe Babylonian Chronicles retells how Egypt \"was sacked and its gods were abducted\". The conquest resulted in the relocation of a large number of Egyptians to the Assyrian heartland. In an excerpt from the text inscribed on his victory stele, Esarhaddon describes the conquest with the following words:\n}}\nUpon the Assyrian king's departure, however, Taharqa was intrigued by the affairs of Lower Egypt and fanned numerous revolts. In 669 BC, Taharqa reoccupied Memphis, as well as the Delta, and recommenced intrigues with the king of Tyre. The Assyrian governors and local puppet rulers Esarhaddon had appointed over Egypt were obliged to flee the restive native populace who yearned for independence now that the Kushites and Nubians had been ejected.\nA new campaign was launched by Esarhaddon in 669. However, he became ill on the way and died. His elder son Shamash-shum-ukin became king of Babylon, and his son Ashurbanipal became king of Assyria, with Ashurbanipal holding the senior position and Babylon subject to Nineveh.\nThe remains of three colossal statues of Taharqa were found at the palace entrance at Nineveh. These statues were probably brought back as war trophies by Esarhaddon, who also brought back royal hostages and numerous luxury objects from Egypt.\nInvasion of Ashurbanipal (667 BCE)\n. Sculpted in 645 – 635 BCE, under Ashurbanipal. British Museum.]]\nAshurbanipal, or \"Ashur-bani-apli\" (Ashurbanapli, Asnapper), succeeded his father Esarhaddon to the throne. He continued to campaign in and to dominate Egypt, when not distracted by having to deal with pressures from the Medes to the east, and Cimmerians and Scythians to the north of Assyria. He installed a native Egyptian Pharaoh, Psammetichus, as a vassal king in 664 BCE.\nHowever, after Gyges of Lydia's appeal for Assyrian help against the Cimmerians was rejected, Lydian mercenaries were sent to Psammetichus. By 656/655 BCE, this vassal king was able to declare outright independence from Assyria with impunity, particularly as Ashurbanipal's older brother, Shamash-shum-ukin of Babylon, became infused with Babylonian nationalism, and began a major civil war in that year. However, the new dynasty in Egypt wisely maintained friendly relations with Assyria.\nof Ashurbanipal).]]\nFirst campaign against Taharqa (667 BCE)\nAshurbanipal defeated Taharqa in 667 BCE, who afterwards fled to Thebes. Ashurbanipal marched the Assyrian army as far south as Thebes, and sacked numerous revolting cities:\n}}\nAs late as 665 BC, the vassal rulers of Sais, Mendes, and Pelusium were still making overtures to Taharqa in Kush.  The rebellion was stopped and Ashurbanipal appointed as his vassal ruler in Egypt Necho I, who had been king of the city Sais, and Necho's son Psamtik I, who had been educated at the Assyrian capital of Nineveh during Esarhaddon's reign. After his victory, Ashurbanipal left Egypt.\nTaharqa died in city of Thebes in 664 BCE. He was followed by his appointed successor Tantamani, a son of Shabaka, himself succeeded by a son of Taharqa, Atlanersa.\nFile:Kushite soldiers of Taharqa fighting the Assyrians.jpg|Armoured Kushite soldiers of Taharqa defending their city from the Assyrian assault\nFile:Exhibition I am Ashurbanipal king of the world, king of Assyria, British Museum (45973251301).jpg|Nubian prisoners escorted by Assyrian guards out of the Egyptian city.\nFile:Egyptian prisoners, Memphis relief.jpg|Nubian prisoners.They wear the typical one-feathered headgear of Taharqua's soldiers.\nSecond campaign against Tantamani (663 BCE)\nof the 25th Dynasty Tantamani, Louvre Museum reconstruction.]]\nEgypt was still seen as vulnerable and Tantamani invaded Egypt in hopes of restoring his family to the throne. This led to a renewed conflict with Ashurbanipal in 663 BCE.\nOnce the Assyrians had appointed Necho I as king and left Egypt, Tantamani marched down the Nile from Nubia and reoccupied all of Egypt including Memphis. Necho I, the Assyrians' representative, was killed in Tantamani's campaign.\nIn reaction, the Assyrians led by Ashurbanipal returned to Egypt in force. Together with Psamtik I's army, which comprised Carian mercenaries, they fought a pitched battle in north Memphis, close to the temple of Isis, between the Serapeum and Abusir. Tantamani was defeated and fled to Upper Egypt but just 40 days after the battle, Ashurbanipal's army arrived in Thebes. Tantamani had already left the city for Kipkipi, a location that remains uncertain but might be Kom Ombo, some  south of Thebes. The city itself was conquered \"smashed (as if by) a floodstorm\" and heavily plundered, in the Sack of Thebes. The event is not mentioned in Egyptian sources but is known from the Assyrian annals, which report that the inhabitants were deported. The Assyrians took a large booty of gold, silver, precious stones, clothes, horses, fantastic animals, as well as two obelisks covered in electrum weighing 2.500 talents (c. 75.5 tons, or 166,500 lb): However, archaeologically, there is no positive evidence of destruction, plunder and major changes in Thebes, with more signs of continuity than of disruption, all the officials remaining in their offices, and development of tombs continuing without interruption.\n]]\n. Translated earlier in John Pentland Mahaffy et al., eds., A History of Egypt, vol. 3 (London: Scribner, 1905), 307. Google Books partial-view: [https://books.google.com/books?id=04VUAAAAYAAJ&pg=PA307 p.307]; and E. A. Wallis Budge, A History of Ethiopia: Volume I, Nubia and Abyssinia'' (London: Taylor & Francis, 1928/2014), 38. }}\nThe sack of Thebes was a momentous event that reverberated throughout the Ancient Near East. It is mentioned in the Book of Nahum chapter 3:8-10:\nA prophecy in the Book of Isaiah refers to the sack as well:\nThe Assyrian reconquest effectively ended Nubian control over Egypt although Tantamani's authority was still recognised in Upper Egypt until his 8th Year in 656 BCE when Psamtik I's navy peacefully took control of Thebes and effectively unified all of Egypt. These events marked the start of the Twenty-sixth Dynasty of Egypt.\nEgyptian-themed artifacts in Assyria (not of Egyptian origin)\nVarious artifacts depicting Egyptian pharaohs, deities or persons have been found in Nimrud, and dated to the Neo-Assyrian period, 9th-7th centuries BCE.\nCarved ivory panel showing young Egyptian pharaohs flanking a lotus stem and flowers. From Nimrud, Iraq. Iraq Museum in Baghdad.jpg|Carved ivory panel showing young Egyptian pharaohs flanking a lotus stem and flowers. From Nimrud, Iraq. Iraq Museum, Baghdad.\nCarved ivory panel showing young Egyptian men flanking lotus stem and flowers. From Nimrud, Iraq. Iraq Museum.jpg|Carved ivory panel showing young Egyptian men flanking lotus stem and flowers. From Nimrud, Iraq. Iraq Museum.\nCarved ivory panel showing young bearded Egyptian men flanking lotus stem and flowers. From Nimrud, Iraq. Iraq Museum.jpg|Carved ivory panel showing young bearded Egyptian men flanking lotus stem and flowers. From Nimrud, Iraq. Iraq Museum.\nFile:Egypto-Assyrian cylinder seal.jpg|Egypto-Assyrian cylinder seal, combining the Assyrian cuneiform script with Egyptian deities.\nDecline of the Neo-Assyrian Empire\nin 635 BCE, illustration by Patrick Gray, 1900.]]\nThe new Egyptian Dynasty, having been installed by the Assyrians, remained on friendly terms with them. But the Neo-Assyrian empire began to disintegrate rapidly after a series of bitter civil wars broke out involving a number of claimants to the throne. While the Neo-Assyrian Empire was preoccupied with revolts and civil war over control of the throne, Psamtik I threw off his ties to the Assyrians circa 655 BCE, and formed alliances with King Gyges of Lydia, and recruited mercenaries from Caria and ancient Greece to resist Assyrian attacks.\nAssyria's vassal state of Babylonia took advantage of the upheavals in Assyria and rebelled under the previously unknown Nabopolassar, a member of the Chaldean tribe, in 625 BCE. What followed was a long war fought in the Babylonian heartland.\n, helped by the remnants of the army of former Assyria, but this too met with defeat.]]\nA general called Ashur-uballit II was declared king of Assyria, and with belated military support from the Egyptian pharaoh Necho II, who wished to contain the westward advance of the Neo-Babylonian Empire, held out at Harran until 609 BCE. Egyptian aid continued to the Assyrians, who desperately attempted to curb the increasing power of the Babylonians and Medes.\nIn 609 BCE, at the Battle of Megiddo, an Egyptian force defeated a Judean force under king Josiah and managed to reach the last remnants of the Assyrian army. In a final battle at Harran in 609 BCE, the Babylonians and Medes defeated the Assyrian-Egyptian alliance, after which Assyria ceased to exist as an independent state. In 605 BCE, another Egyptian force fought the Babylonians (Battle of Carchemish), helped by the remnants of the army of the former Assyria, but this too met with defeat.\nReferences\nSources\n*\n*\n*\n*\n*\n*\n*\n*\n*\n}}"
    }
  ]
}