{
  "content": [
    {
      "type": "text",
      "text": "# Astro Wars__disambig_1\n\nAstro Wars is an electronic table top game made in Great Britain in 1981 by Grandstand under licence from Epoch Co., who sold the game in Japan as Super Galaxian (スーパーギャラクシアン), and in the United States as Galaxy II. The game originally used a red logo on the housing; it was later switched to white.\nOverview\nAstro Wars was a shoot 'em up, with play involving four phases of dodging enemy missiles and firing back at the squadrons of alien command ships, warships and attacking fighters as well as a docking challenge for additional bonus points.\nHardware\nThe Astro Wars game runs on six volts DC and can be powered by four 'C' type batteries or alternatively via a low voltage mains adapter (not supplied with the game). As the display is based on VFD technology, it allows bright, multicoloured in-game elements to be rendered but at the cost of a relatively small screen size. The VFD display is manufactured with the pre-formed, immutable in-game objects effectively fixed in place onto a dark background. Each element can be individually lit or unlit during play, giving the illusion of animation and movement. In-game objects cannot touch or superimpose on one another. The screen was slightly magnified to improve gameplay. This electronic table-top game console requires the player to dodge missiles fired by alien ships, destroy the attackers, and launch and recover their space capsule. Four different skill levels are provided with automatic scoring and electronic sound effects.\nWhile the hardware is considered to be generally reliable, the NPN power transistor (D882) is known to fail frequently causing loss of power. Zener diode (S06) fails less frequently but is another component worth checking as failure of the diode has the same effect.\nThe VFD is vulnerable to damage during repair work as the unit features a glass nipple which can easily be fractured causing the loss of the vacuum necessary for the display to operate.\nMaintenance of the hardware is fairly straightforward - isopropyl alcohol can be used to safely clean button and switch contacts, and plastic safe cleaners can be used to clean the exterior.\nThe battery compartment used on the Astro Wars game was used on a variety of similar systems produced around the same time, including:\n* Astro Thunder     (by Epoch, Grandstand, Radio Shack)\n* Astro Thunder 7   (by Epoch, Grandstand, Radio Shack)\n* Firefox F-7       (by Grandstand)\n* Astro Command     (by Epoch, Radio Shack, Gama Tronic)\n* Space Defender    (by Epoch, LSI, FL)\n* Scramble SCRAMBLE   (by Grandstand)\nGameplay\nIn concept Astro Wars has similar themes to arcade games Galaxians or Gorf in as much as the player controls a ship (called earth ship) at the bottom of the screen and fires up at rows of ships. Players can select from four difficulty ratings and the controls are a simple digital joystick to move right or left and a fire button. Individual enemy ships can descend the screen to attack the player's ship. The player has to fight through a number of variations of the enemy.\nThe four skill levels are:\n* Level 1 - Alien fighters attack one at a time\n* Level 2 - Alien fighters attack one at a time but combat speed is faster\n* Level 3 - Alien fighters attack two at a time\n* Level 4 - Alien fighters attack two at a time but combat speed is faster\nThe game ends once either the player loses five ships or exceeds 9,999 points when a special electronic victory tune was played.\nReferences"
    }
  ]
}