{
  "content": [
    {
      "type": "text",
      "text": "# Atmos Rewards\n\n|type=Frequent-flyer program\n|owner=Alaska Air Group\n|name=Atmos Rewards\n|introduced=\n}}\nAtmos Rewards is the frequent-flyer program of Alaska and Hawaiian Airlines. Members accrue program points by flying Alaska, Hawaiian, or partner-operated flights, using co-branded credit cards, and booking vacation and hotel packages, among other methods. Atmos Rewards miles can be redeemed for award flights on Alaska, Hawaiian, and partner airlines and provide eligibility for elite status within Atmos Rewards.\nHistory\nIn June 1983, Alaska Airlines introduced its frequent-flyer program, Gold Coast Travel. In 1987, Alaska Airlines acquired Jet America Airlines, which offered a frequent-flyer program that awarded credit by flight segments (number of flights taken), compared to Gold Coast Travel, where members earned credit based on the mileage of flights taken. After acquisition by Alaska Airlines, participants of Jet America's frequent-flyer program were enrolled in Gold Coast Travel, and in September 1989, Gold Coast Travel was renamed Mileage Plan. Alaska Airlines also purchased regional commuter airline Horizon Air in 1986 and incorporated the carrier into Mileage Plan.\nIn 2016, Alaska Airlines acquired Virgin America, which offered a revenue-based accrual program, Elevate. On January 1, 2018, Elevate was discontinued, with all remaining accounts converted to Mileage Plan accounts.\nIn September 2024, Alaska Airlines’ acquisition of Hawaiian Airlines was finalized. Following the merger, Hawaiian’s loyalty program, HawaiianMiles and Alaska's Mileage Plan were merged into one program, Atmos Rewards in September 2025. This integration enabled combined status recognition, mile accrual, and award redemption across both carriers\nOneworld membership\nAlaska Airlines is a member of the Oneworld airline alliance. Passengers can book codeshare and interlining itineraries on all Oneworld airlines through Alaska Airlines. Atmos Rewards points may be redeemed for flights on Oneworld carriers, and Atmos Rewards elite status is reciprocally recognized by member airlines.\nIn February 2020, Alaska Airlines announced its intention to join the Oneworld alliance in the summer of 2021. This would add seven new airline partners, including Iberia, Malaysia Airlines, Qatar Airways, Royal Air Maroc, Royal Jordanian, S7 Airlines, and SriLankan Airlines. In October 2020, Alaska announced its Oneworld membership date had been moved to March 21, 2021.\nIn December 2020, Oneworld member Qatar Airways established a mileage partnership with Alaska prior to the commencement of nonstop service from Seattle to Doha.\nOn March 31, 2021, Alaska Airlines officially joined the Oneworld alliance. Alaska temporarily suspended its partnership with S7 Airlines on March 1, 2022, in response to the 2022 Russian invasion of Ukraine.\nIn September 2024, Alaska Airlines' purchase of Hawaiian Airlines was finalized and closed, with the latter retaining its independent branding. A combined loyalty program was announced as forthcoming, with Hawaiian Airlines also projected to join Oneworld in 2026, after merging into one operating certificate.\nAlaska Airlines flights, including Horizon Air flights, have been bookable as part of Oneworld Global Explorer fares since 2008.\nPartner airlines\nThrough Atmos Rewards, Alaska Airlines and Hawaiian Airlines have partnerships with 31 global airline partners that provide codeshare flights, elite status recognition, award flight redemption, and mileage accrual. Partner airlines include Oneworld, SkyTeam, and Star Alliance members, as well as unaffiliated airlines.\nThe airline partners of Atmos Rewards are:\n{|class=\"wikitable sortable sticky-header\"\n|-\n! Partner\n! Alliance\n! Commenced\n! Status recognition\n! Redeem points\n! Earn points\n|-\n| Aer Lingus\n|\n|align=center| 2018\n|\n|\n|\n|-\n| Air Tahiti Nui\n|\n|align=center| 2022\n|\n|\n|\n|-\n| Aleutian Airways\n|\n|align=center| 2024\n|\n|\n|\n|-\n| American Airlines\n|align=center| Oneworld\n|align=center| 1999\n|\n|\n|\n|-\n| Bahamasair\n|\n|align=center| 2023\n|\n|\n|\n|-\n| British Airways\n|align=center| Oneworld\n|align=center| 2001\n|\n|\n|\n|-\n| Cape Air\n|\n|align=center| 2021\n|\n|\n|\n|-\n| Cathay Pacific\n|align=center| Oneworld\n|align=center| 2003\n|\n|\n|\n|-\n| Condor\n|\n|align=center| 2013\n|\n|\n|\n|-\n| Contour Airlines\n|\n|align=center| 2024\n|\n|\n|\n|-\n| Fiji Airways\n|align=center| Oneworld\n|align=center| 2009\n|\n|\n|\n|-\n| Finnair\n|align=center| Oneworld\n|align=center| 2017\n|\n|\n|\n|-\n| Hainan Airlines\n|\n|align=center| 2015\n|\n|\n|\n|-\n| Iberia\n|align=center| Oneworld\n|align=center| 2021\n|\n|\n|\n|-\n| Icelandair\n|\n|align=center| 2015\n|\n|\n|\n|-\n| Japan Airlines\n|align=center| Oneworld\n|align=center| 2016\n|\n|\n|\n|-\n| Kenmore Air\n|\n|align=center| 2023\n|\n|\n|\n|-\n| Korean Air\n|align=center| SkyTeam\n|align=center| 2008\n|\n|\n|\n|-\n| Malaysia Airlines\n|align=center| Oneworld\n|align=center| 2021\n|\n|\n|\n|-\n| Mokulele Airlines\n|\n|align=center| 2023\n|\n|\n|\n|-\n| Oman Air\n|align=center| Oneworld\n|align=center| 2025\n|\n|\n|\n|-\n| Philippine Airlines\n|\n|align=center| 2025\n|\n|\n|\n|-\n| Porter Airlines\n|\n|align=center| 2023\n|\n|\n|\n|-\n| Qantas\n|align=center| Oneworld\n|align=center| 1984\n|\n|\n|\n|-\n| Qatar Airways\n|align=center| Oneworld\n|align=center| 2020\n|\n|\n|\n|-\n| Royal Air Maroc\n|align=center| Oneworld\n|align=center| 2021\n|\n|\n|\n|-\n| Royal Jordanian\n|align=center| Oneworld\n|align=center| 2021\n|\n|\n|\n|-\n| Singapore Airlines\n|align=center| Star Alliance\n|align=center| 2017\n|\n|\n|\n|-\n| Southern Airways Express\n|\n|align=center| 2023\n|\n|\n|\n|-\n| SriLankan Airlines\n|align=center| Oneworld\n|align=center| 2021\n|\n|\n|\n|-\n| Starlux Airlines\n|\n|align=center| 2023\n|\n|\n|\n|}\nFormer partners\nDelta had been a mileage partner from 2004 until 2017, when it established Seattle as a hub city. The partnership with Delta was preceded by a partnership with Northwest Airlines in 1995, prior to the merger of the two airlines. Alaska Airlines was also a former mileage partner with other SkyTeam members, including Aeromexico, from 2013 until 2017, and Air France and KLM, from 2007 until 2018.\nEmirates ceased to be a partner in 2021, shortly after Alaska joined the Oneworld alliance and became partners with regional rival Qatar Airways. The two airlines had a mileage agreement starting in 2012.\nAlaska and the Oneworld alliance suspended their partnership with S7 Airlines in response to the 2022 Russian invasion of Ukraine.\nClub 49\nMembers who are residents of the state of Alaska or military personnel permanently stationed in Alaska are eligible to participate in Alaska Airlines' Club 49 program.\nBenefits include:\n* Two complimentary checked bags on flights to or from Alaska, for participants and all passengers traveling on the same reservation\n* Two Travel Now annual discounts for 30% off refundable one-way Y-class economy fares to, from, or within Alaska on Alaska Airlines, when booked within four days of departure\n* Weekly fare sales via email for destinations within and outside Alaska\n* Constituent Fare rates of a 30% discount for flights within the state to Juneau, to access the state legislature and state agencies, distributed at the start of the legislative session in mid-January\n* The Freight For Less program, allowing participants to ship up to 100 pounds of freight within Alaska through Alaska Air Cargo for $49 plus tax.\nHuaka‘i\nIn late 2024, Hawaii residents will be eligible to join the Huaka'i program, providing benefits such as 10% off one inter-island booking per quarter, a free checked bag, and exclusive network-wide deals each month. Hawaiian Airlines World Elite Mastercard cardmembers will receive 20% off one inter-island flight per quarter, on top of the existing cardholder benefit of two free checked bags.\nRecognition\nAs of 2022, Mileage Plan was the recipient of the U.S. News & World Report Best Airline Reward Program for seven consecutive years since 2015, based on an airline's overall evaluation of six criteria: ease of earning a free round-trip flight, benefits, network coverage, flight volume, award flight availability and airline quality ratings.\nNotes\nReferences"
    }
  ]
}