{
  "content": [
    {
      "type": "text",
      "text": "# Attacks on religious sites during the Israeli invasion of Gaza\n\n]]\nThe Israeli invasion of Gaza, which began as a result of the Gaza war on 7 October 2023, has resulted in significant destruction and damage to numerous religious sites including mosques and churches.\nOn 19 October 2023, an Israeli airstrike hit the Church of Saint Porphyrius, where 500 people were sheltering. On 8 November 2023, Israel bombed and destroyed the Khalid bin al-Walid Mosque. By 13 November 2023, at least sixty mosques had been destroyed by Israeli bombs. In December 2023, an Israeli bombing destroyed the Great Mosque of Gaza. At least seven people were killed in an Israeli airstrike on a Rafah mosque full of displaced people on 23 February 2024. Five people were killed in a mosque in northern Gaza that was bombed without warning. The al-Riad mosque in Khan Younis was heavily damaged by an Israeli bombing on 9 March 2024. On 24 August 2024, Israeli forces attacked and destroyed a 96-year-old historic Bani Saleh Mosque in Khan Yunis, where they also insulted the Quran and then set it on fire.\nBy 10 March 2024, more than 1,000 mosques had been destroyed by Israeli attacks. In May 2024, an Israeli bombing on a mosque in Gaza City reportedly killed at least 10 people.\nBackground\nAccording to a Washington Institute for Near East Policy report, Hamas had spent years constructing  an elaborate tunnel system and made wide use of civilian facilities as a cover for its military activities. It turned schools, mosques, hospitals, and residential housing into weapons storage facilities,  headquarters and fighting positions.\nThe  invasion of Gaza, which began on October 7, 2023, was triggered by a violent attack by Hamas on Israeli communities on the outskirts of Gaza. The conflict caused widespread destruction in Gaza, with significant damage to religious sites.\nAccording to international humanitarian law, the deliberate targeting of religious buildings during conflict is considered a war crime, unless such sites are used for military purposes.\nThe Palestinian Central Bureau of Statistics recorded that there were 1,230 mosques in the Gaza Strip in 2021. According to the Gaza local authorities, 1,000 mosques have been destroyed in Israeli attacks on the Gaza Strip since October 7, 2023, with reconstruction costs estimated at $500 million. Other reports indicate that 378 mosques were targeted during the conflict, although this number has not been independently verified. By January 2024, the BBC had confirmed 72 incidents of mosques being damaged or destroyed between 7 October and 31 December 2023.\nReports also stated that three churches were damaged during the conflict. In January 2024, the BBC confirmed two incidents of churches being damaged or destroyed between 7 October and 31 December 2023.\nDamaged mosques\n* Khalid bin Alwaleed Mosque: This mosque located in Khan Yunis was allegedly targeted by the Israeli army, resulting in considerable damage.\n* Great Omari Mosque: One of the oldest mosques in historic Palestine, the Great Omari Mosque in Gaza City was hit by an Israeli airstrike.\n* Sayed al-Hashim Mosque: This mosque was damaged during an Israeli airstrike.\n*The Gaza's medieval Omari Mosque\n*The ancient Othman bin Qashqar Mosque\n*The Katib al-Wilaya Mosque\n*The Al-Bukhari Mosque\n*The Khalil Al-Rahman mosque\n*The Al-Ansar Mosque\n*Ahmed Yassin mosque at Al-Shati refugee camp, Gaza City was destroyed on 9 October 2023.\n*Al Amin Muhammad Mosque at Khan Yunis was destroyed on 20 October 2023.\n*Al-Gharbi mosque at Gaza City was destroyed on 9 October 2023.\n*The Saad bin Abi Waqqas Mosque\n*Jaffa Mosque in Deir al-Balah was destroyed in December 2023.\n*October 2024 Shuhada al-Aqsa mosque bombing in Deir al-Balah.\n*Zofor Domri Mosque in Shuja'iyya was bombed on three occasions and bulldozed.\n*Al-Hassan Mosque: Israeli airstrikes targeted the mosque in Tuffah, killing 16 Palestinians on 16 November 2023 during dawn prayers.\nDamaged churches\n*The Church of Saint Porphyrius: Located in Gaza City, considered one of the oldest churches in the world, was hit by an Israeli missile on October 19, 2023. As a result of the attack, 18 people were killed and many were injured.\n*The Holy Family Church: The only Catholic church in Gaza City. A mother and daughter were killed by an Israeli sniper while leaving the church on 16 December 2023. On 17 July 2025, the church was struck by Israeli tank fire.\n*The Byzantine Church of Jabalia\n* St. Hilarion Monastery\nImpact\nThe destruction of religious places has had a profound impact on the local community. As many of these sites served as shelters for displaced Palestinians, their destruction resulted in countless casualties. The loss of these cultural and religious landmarks has been described as a form of cultural genocide. The damage to these sites has also affected the religious and cultural practices of the local population, further exacerbating the humanitarian crisis in Gaza.\nHundreds of imams and religious scholars have also been killed as a result of the campaign in Gaza. The Palestinian Ministry of Awqaf and Religious Affairs has said that about 300 Islamic scholars, including Quran teachers, Islamic preachers and imams, have been killed in military strikes.\nSee also\n* Attacks on refugee camps in the Gaza war\n* Attacks on schools during the Israeli invasion of Gaza\n* Attacks on health facilities during the Gaza war\n* Destruction of cultural heritage during the Israeli invasion of the Gaza Strip\n* List of military engagements during the Gaza war\nReferences"
    }
  ]
}