{
  "content": [
    {
      "type": "text",
      "text": "# Attitude-toward-the-ad models\n\nAttitude-toward-the-ad models explore how a person's feelings about an advertisement, known as \"attitude toward the ad\" (Aad), shape their response to it. Aad is defined as a tendency to react favorably or unfavorably to a specific ad during a given viewing. Introduced as a key concept by Mitchell and Olsen (1981) and Shimp (1981), Aad became a central focus in advertising research, particularly for understanding its influence on brand attitude (Ab) and purchase intention (PI). Typically acting as a mediator in these relationships, Aad affects how consumers perceive a brand and their likelihood of buying it. Based on theoretical and empirical studies, four alternative models have been proposed to explain how Aad operates within advertising effectiveness.\nOverview\nThere are four possible specifications of the causal role of Aad. All of them are based on a general hierarchy-of-effects frame work. Cognitions act as antecedents of attitudes, and then behavior effects (e.g. purchase intention) are followed. For example, in all four alternatives, ad cognitions influence Aad, and brand cognitions have effects on Ab. Each of attitudes finally has linkage with purchase intention depending on the role of Aad.\nConstruction\nFive elements construct the four alternative causal relationships: ad cognitions (Cad), brand cognitions (Cb), attitude toward the ad (Aad), attitude toward the brand (Ab), and purchase intention (PI). The five elements are defined as follows:\n#Ad cognitions refer to \"recipients' perceptions of the ad.\"\n#Brand cognitions refer to \"recipients' perceptions of the brand being advertised.\"\n#Attitude toward the ad is \"recipients' affective reactions to the ad.\"\n#Attitude toward the brand is \"recipients' affective reactions toward the advertised brand or desirable attitude toward purchasing the brand.\"\n#Purchase intention is \"recipients' assessments of the likelihood that they will purchase the brand in the future.\"\nFour alternative specifications\nThe four alternative models of advertising attitude explain how antecedent variables related to advertising outcomes are mediated by attitude toward advertising. These models are named the affect transfer, dual mediation, reciprocal mediation, and independent influences hypotheses.\nModel 1. The affect transfer hypothesis (ATH).\nATH assumes the directly influence of Aad attitude on Ab (direct one-way causation). ATH has been received the most attention in the research among four models, and it has been supported empirically in that direct positive linear relationship between Aad and Ab was found.\nModel 2. The dual mediation hypothesis (DMH)\nDMH explains both of direct one-way causation and indirect one-way causation. Indirect one-way causation indicateds that Cb connects Aad affects to Ab. Direct one-way causation refers to the process postulated by ATH. DMH is in the line of the traditional communications theory treatment of message source proposed by Lutz and Swasy (1977). This means that consumers' affective response to an ad influences their propensity to accept the ad claims related to the brand. That is, the more favorable feeling toward the ad the consumers have, the more ad claims they remember. Therefore, the relationship between Aad and Cb can be assumed.\nModel 3. The reciprocal mediation hypothesis (RMH)\nRMH indicates that Aad and Ab affect each other (direct two-way causation). It is based on a balance theory introduced by Heider (1946) in that people try to sustain the cognitive balance. Heider explained that \"a balanced configuration exists if attitudes toward the parts of a causal unit are similar. For example, if a consumer is exposed to an ad advocating a particular brand, the consumer will try to maintain a balanced view of the ad and the: a) liking both the ad and the brand or b) disliking both. The strengths of the RMH explain differences depending on situations and consumers. For instance, if a new product is introduced, there will be a relatively stronger flow will be from Aad to Ab. This is because a consumer may first be exposed to the brand through ad. However, if a consumer has loyalty to the brand, prior Ab may affect Aad.\nModel 4. The independent influences hypothesis (IIH)\nIIH assumes that Aad and Ab have no relationship, rather both of them independently influence purchase intention (direct one-way causal influence on purchase intention). IIH is based on a modification of the distinction between brand concept and impersonal attitude proposed by Howard (1977). Brand concept refers to Ab, and impersonal attitude refers to attitude toward the conditions of purchase. In Howard's view, situational pressures such as availability and deals have an important role in purchase. The construction of Aad could be one of situational variables in the advertising exposure setting. This is supported by a study in which immediate surrounding commercials have an influence on people choice behavior without consideration of product merits.\nSee also\n* AIDA (marketing)\n* AISDALSLove\n* Advertising management\n* Advertising research\n* Brand awareness\n* Consumer behaviour\nReferences"
    }
  ]
}