{
  "content": [
    {
      "type": "text",
      "text": "# Aubrey Edwards\n\n|birth_place = Seattle, Washington\n|death_date  =\n|death_place =\n|spouse      =\n|children    =\n|relatives   =\n|alma_mater  = DigiPen Institute of Technology (BSCS)\n|names       = Aubrey EdwardsGearl Hebner\n|height      =\n|weight      =\n|billed      =\n|trainer     = Chris SamuelsSteve West\n|debut       = 2017\n|retired     =\n}}\nBrittany Aubert (born March 9, 1987), better known by the ring name Aubrey Edwards, is an American video game developer and professional wrestling referee signed to All Elite Wrestling (AEW). She is also the promotion's project coordinator and the co-host of AEW Unrestricted with Will Washington and previously withTony Schiavone.\nCareer\nVideo game industry\nAubert has a background in software engineering and computer science, having previously worked in the video game industry as a producer. Aubert was previously employed by 5th Cell, where she worked on the Scribblenauts video game series for more than six years. She started out as a tool programmer for the series' inaugural title and eventually became lead producer of the Wii U launch title Scribblenauts Unlimited.\nAubert is involved with the ongoing development of AEW Games.\nProfessional wrestling\nAubert joined independent promotion 3–2–1 BATTLE! as a referee, initially going under the ring name Gearl Hebner. She began working with other Washington-based promotions such as DEFY and Without a Cause, using the ring name Aubrey Edwards.\nIn 2018, Edwards made appearances in WWE, working as a referee for the Mae Young Classic and at WWE Evolution.\nIn August 2019, Edwards made history at AEW's All Out by becoming the first woman to referee a professional wrestling world championship match on pay-per-view. She signed with AEW on September 1, 2019, becoming the promotion's first full-time female referee.\nOther media\nAubert made her video game debut as a playable character in AEW Fight Forever.\nPersonal life\nAubert is bisexual. Before becoming a professional wrestling referee, Aubert practiced classical ballet for 21 years.\nReferences\n}}\nExternal links\n*\n*\n*\n* [https://www.youtube.com/watch?v=iUa4WAZp7U0&ab_channel=Forbes Meet Aubrey Edwards: From Video Game Maker To All Elite Wrestling Referee] on the official Forbes YouTube channel"
    }
  ]
}