{
  "content": [
    {
      "type": "text",
      "text": "# Audrey King\n\n| birth_place = Hong Kong\n| sport = Alpine Skiing\n| club = Ski Association of Hong Kong\n}}\nAudrey Alice King (; born 24 September 2002) is a Hong Kong alpine skier who represented Hong Kong at the 2022 Winter Olympics in Beijing. She is the grandniece of Tung Chee-hwa, the first Chief Executive of Hong Kong. King began skiing at a young age and gained attention for her participation in international competitions, including the Olympics and Winter Youth Olympic Games.\nEarly life\nAudrey Alice King was born on 24 September 2002 in Hong Kong. She began skiing at age three during family trips and started formal training at 15, often in Europe due to Hong Kong's lack of snow facilities. She joined the Hong Kong Ski Team in 2016, training under coaches in Alpine skiing disciplines like slalom and giant slalom. King deferred her admission to Harvard University to focus on her skiing career, particularly for Olympic preparation.\nCareer\nKing's early competitive experience included the 2020 Winter Youth Olympic Games in Lausanne, Switzerland, where she placed 32nd in the women's slalom. She qualified for the 2022 Winter Olympics by finishing third (147.03 points) and seventh in women's slalom events in Kolasin, Montenegro, in December 2021, meeting International Ski and Snowboard Federation (FIS) standards. Her FIS athlete code is 959004, and she remains listed as active as of 2025.\n2022 Winter Olympics\nAt the 2022 Winter Olympics in Beijing, King competed in the women's slalom on 9 February 2022 at the Yanqing National Alpine Skiing Centre. Upon arrival, she tested positive for COVID-19 twice, requiring quarantine, but was cleared after consecutive negative tests. She did not finish (DNF) the first run of the slalom due to a late imbalance, expressing disappointment but pride in representing Hong Kong, stating, \"I'm disappointed, but I gave it my all.\" Her participation marked her as one of Hong Kong's first female alpine skiers at the Winter Olympics.\nPersonal life\nKing is the grandniece of Tung Chee-hwa, Hong Kong's first Chief Executive (1997–2005), which garnered additional media attention during her Olympic campaign. She balances skiing with her academic pursuits, having enrolled at Harvard University after deferring for Olympic training. King's younger sister, Aerin King (金和霖), represented Hong Kong in alpine skiing at the 2024 Winter Youth Olympics  in Gangwon, South Korea.\nReferences\nExternal links\n* [https://www.fis-ski.com/DB/general/athlete-biography.html?sectorcode=AL&competitorid=229595 FIS – Audrey King]\n* [https://www.olympedia.org/athletes/138602 Olympedia – Audrey King]"
    }
  ]
}