{
  "content": [
    {
      "type": "text",
      "text": "# Australian feminist art timeline__disambig_1\n\nAustralian feminist art timeline lists exhibitions, artists, artworks and milestones that have contributed to discussion and development of feminist art in Australia. The timeline focuses on the impact of feminism on Australian contemporary art. It was initiated by Daine Singer for The View From Here: 19 Perspectives on Feminism, an exhibition and publishing project held at West Space as part of the 2010 Next Wave Festival.\n1960s\n1967 Exhibition: Vivienne Binns, Watters Gallery, Sydney. The exhibition of paintings and sculptures showing symbolic representations of genitalia was considered outrageous at the time.\n1967 Artwork: Vivienne Binns, Vag dens, synthetic polymer paint and enamel on composition board. Collection of the National Gallery of Australia, Canberra.\n1967 Performance: Yoko Ono and Juno Gemes, The Scream, Ono covered seated Gemes in bandages from ankle to crown while Ono performed a crescendo of screams. This performance was sabotaged by male owners of the club.  Jay Landesman Kingly Street Gallery and Perfumed Garden, London, UK.\n1967 Performance: Juno Gemes and Lawrence Bourke, The Carnivorous Nature of Love, performance with female store mannequin, belly filled with offal. The Model was disemboweled to a recitation of Spencerian Sonnet. Joan Littlewood's Stratford East Theatre, East London, UK. 24 Hours of Performance Art Event.\n1968 Performance: The Human Performance Art Group, The Body Eats a Peach Pact Theatre 10 Cunningham Street, Sydney, NSW; La Mama, Melbourne, VIC; Tribe, Brisbane, QLD. Multi Media Performance Group: Laurel Fox, Gillian Jones, Julia Salle, Juno Gemes, Michael Glasheen, Stephen Jones, Brian Thompson, Mick Glasheen, Jack Myers, Tom Barber, Ken Beatty, Jack Jacobson, Garry Shead, Peter Kingston, Andrish St Clare, Clem Gorman, James Ricketson, Albie Thoms, Ubu Films, Roger Fogg Foley-mixed media, performance choreographed, paint, furniture installation, geodesic wood structure, kinetic light installation, steel and wire sculpture, film, sound collage.\n1969 Research: Uluru Desert Research Room, Juno Gemes, Michael Glasheen, The Yellow House, Sydney, NSW. Preparation and research for six months in Central Australian Desert, consultation and filming with Pitdjandara, Loritcha, Arrenete Elders and families on stories embedded in Uluru. Women artist/participants in The Yellow House: Little Nell, Antionette Starowitz and Juno Gemes,\n1970s\n1970 Publication: Germaine Greer publishes The Female Eunuch\n1974–1977 Women's Art Movement groups founded in Melbourne, Sydney and Adelaide\n1974 Exhibition: ''A Room of One's Own: Three Women Artists Ewing Gallery, University of Melbourne, co-curated by Kiffy Rubbo, Lynne Cooke and Janine Burke. Artists: Lesley Dumbrell, Julie Irving, Ann Newmarch\n1974 Exhibition: Women Photographers, Pram Factory, Carlton, VIC, included work by Ponch Hawkes\n1974 Exhibition: Women in the Community'', Bondi Pavilion, Bondi, NSW, organised by the Sydney Women's Art Movement\n1975 International Women's Year\n1975 Research and Collective: Women's Art Register slide collection first established at George Paton Gallery, University of Melbourne. The founders were painters Erica McGilchrist and Lesley Dumbrell and directors of Ewing Gallery and George Paton Galleries, University of Melbourne Kiffy Rubbo and Meredith Rogers.\n1975 Lecture: American feminist writer Lucy R. Lippard conducts Australian lecture tour\n1975 Festival: First Festival of Women's Culture, Bondi Pavilion, Bondi, NSW\n1975 Exhibition: Art and the Creative Woman, Royal South Australian Society of Arts Gallery, Adelaide, SA, organised by the Royal South Australian Society of Arts (RSASA) with entries from fellows of the society and other women artists from across Australia.\n1975 Exhibition: Australian Women Artists: 1840–1940, Ewing and George Paton Gallery, University of Melbourne; Art Gallery of NSW; Newcastle Region Art Gallery; Art Gallery of South Australia, curated by Janine Burke.\n1975 Exhibition: Ethnic Handicrafts Exhibition, Australia Hotel and Uniting Church, Fitzroy, VIC, organised by social workers, exhibited over 500 handicrafts by migrant women living in Australia\n1975 Exhibition: Fantasy and Reality, Wentworth Building, Sydney University, Sydney, NSW, organised by the Sydney Women's Art Movement, included work by Jude Adams, Jenny Barber, Frances Budden, Marie McMahon, Mandy Martin and Toni Robertson\n1975 Exhibition: Five Women Artists, Queensland Art Gallery, Brisbane, Qld, exhibited work by Anne Alison-Greene, Bessie Gibson, Vida Lahey, Daphne Mayo and Margaret Olley\n1975 Exhibition: ''It's Great to be an Australian Woman'', Women's House, Brisbane, QLD, organised by the Women's Community Aid Association.\n1975 Exhibition: ''Queensland Women Artists' Mixed Media Show, Hogarth Galleries, Sydney, NSW, exhibited sculptures, painting and prints from 36 Australian artists including Jude Adams, Jenny Barber, Frances (Budden) Phoenix, Pamela Harris, Ann Newmarch and Toni Robertson\n1975 Exhibition: Six Australian Women Photographers, Australian Centre for Photography, Sydney, NSW; National Gallery of Victoria, Melbourne, VIC\n1975 Exhibition: Three Women Photographers, Ewing and George Paton Gallery, Melbourne, VIC, Micky Allan, Virginia Coventry and Sue Ford\n1975 Exhibition: Women in Art'', Western Australian Institute of Technology, Perth, WA, organised as part of International Women's Year\n1975 Artwork: Ann Newmarch Vietnam Madonna\n1975 Publication: ''Refractory Girl: a women's studies journal'' published a special issue on 'women in the visual arts'\n1975 Publication: ''Hecate: An Interdisciplinary Journal of Women's Liberation'' established, edited by Carole Ferrier (1975–present)\n1975 Research: Women's Studies Resource Centre established, Adelaide, South Australia\n1976 Collective: Women's Art Forum established in Melbourne as an offshoot of the Women's Art Register, a platform for community building and peer support through discussion evenings, artists talks and professional development sessions, to augment the Register's collection management work\n1976 Publication: Launch of Melbourne-based art journal LIP A Journal of Women in the Visual Arts (1975–1983)\n1976 Collective: Women's Art Movement established, Adelaide, South Australia\n1976 Education: Jude Adams taught the first Australian feminist art course, 'Women and Art: The Artist as She', at the Workers Educational Association and then at Alexander Mackie College of Advanced Education, Sydney, NSW\n1976 Education: Ann Stephen taught 'Women and Art', at Preston Institute of Technology, Preston, VIC\n1976 Collective: Dag Printing formed, screenprinting collective, Wendy Black, Angela Gee and Evelyn Vynhal\n1977 Research: The Women's Art Register Extension Project (WAREP) begins work on researching of national and historical exhibitions and women artists, to add to the growing archive of contemporary artists. Funding was received from the Victorian Government's School's Board, with work carried out by Anna Sande, Bonita Ely and later Erica McGilchrist.\n1977 Award: Helen Garner is awarded the National Book Council Award for her novel Monkey Grip&ndash;making her the first female author to win the award.\n1977 (August) Exhibition: ''The Women's Show'', Experimental Art Foundation, Adelaide. A month-long program of events organised by Women's Art Movement, Adelaide, with exhibitions at the Experimental Art Foundation (later AEAF) on August 4–27, and the Contemporary Art Society (later CACSA).  The program included a conference, and an open exhibition of over 350 works including video, photography, theatre, music, literature and film curated by the Women's Art Movement, SA, Julie Ewington and Helen James. Participating artists included Stephanie Radok, Loene Furler, Bonita Ely, Jude Adams, Margaret Dodd, Frances (Budden) Phoenix, Marie McMahon and many others.\n1978 Publication and exhibition: The Women's Art Register publishes Profile of Australian Women Sculptors 1860 - 1960, researched and written by Bonita Ely and Anna Sande for the Women's Art Register Extension Project. This publication is a substantial history of Australian women artists working in sculpture across one hundred years (1860 -1960), including biographies, exhibitions, collections, artist statements, lists of works and bibliographies on 41 artists. The publication was produced in conjunction with an educational slide kit which was exhibited at the 1978 Mildura Sculpture Triennial - at the Mildura Arts Centre - and dispersed to schools and libraries across Australia. Artists: Ruth Adams, Erica Baneth, Dora Barclay, May Barrie, Margaret Baskerville, Eva Benson, Esther Belliss, Lorraine Boreham, Theresa Chauncy, Ola Cohn, Theodora Cowan, Fairlie Cunningham, Marea Gassard, Ann Dobson, May Butler George, Pam Hallandal, Margel Hinder, Margo Holden, Diana Hunt, Aina Jaugietis, Inge King, Mildred Lovett, Eileen McGrath, Nancy Lyle, Marguerite Mahood, Heather Mason, Daphne Mayo, Dora Ohlfsen,  Ellen Payne, Ieva Pocius, Margaret Priest, Norma Redpath, Margaret Richardson, Kathleen Shillam, Margaret Sinclair, Wendy Solling, Eula Stagpoole, Margaret Thomas, Barbara Tribe, Tina Wentcher, Eleonore Lange.\n1978 Artwork: Ann Newmarch, Women hold up half the sky!\n1978–80 Performance: Lyndal Jones, The At Home Series, performances in the series held at La Mama Theatre, Melbourne, George Paton Gallery, University of Melbourne, RMIT, Melbourne, 110 Chambers Street, New York\n1979 Publication: Germaine Greer publishes The Obstacle Race: The Fortunes of Women Painters and Their Work\n1979 Collective: Anarchist Feminist Poster Collective formed by Sally O'Wheel and Megan Schlunke, Adelaide, VIC, other contributors included Karen Elliot, Marie Morrissey, Barbary O'Brien\n1979 Collective: Blatant Image formed, Sydney, NSW, photographic subgroup of the Sydney Women's Art Movement, included Sandy Edwards, Helen Grace, Victoria Middleton and Lynn Silvermann\n1979 Collective: Mathilda Graphics formed, Sydney, NSW, women's creative and commercial collective offering services in photography, illustration, typesetting, etc.\n1979 Collective: Women's Warehouse Screenprinting Collective formed, Sydney, NSW, contributors included Jan Fieldsend, Marla Guppy and Anne Sheridan (Beard)\n1979 Research: Registry of Women Artists founded, Canberra, ACT, members included Carol Ambrus and Cathy Walters\n1979 Exhibition: ''The D'Oyley Show'', Women's Domestic Needlework Group, Watters Gallery, Sydney\n1979 Research: The Women's Art Register Slide Collection moves to Richmond Library (previously known as Carringbush Library), facilitated by Bonita Ely, Anna Sande and Dianne Friend, and is merged with the Women's Art Register Extension Project (WAREP) historical archive\n1979–1980 Artwork: Lyn Finch, Cherie Bradshaw and Michael Calaghan Prostitution is the rental of the body, Marriage is the sale, screenprinted poster\n1980s\n1980 Artwork: Davida Allen painted her sexual fantasy pictures of actor Sam Neill. While the paintings followed in the tradition of the Burt Reynolds nude centrefold in Cosmopolitan in 1972, in 1980s Australia the artist raised eyebrows for depicting a man as a sex object.\n1980 Performance: Bonita Ely, Bread Line, Anzart, Christchurch, New Zealand\n1980 Performance: Bonita Ely, Murray River Punch, Ewing and George Paton Gallery, Melbourne University. Women at Work, a festival of women's performance art.\n1980 Performance: Jill Orr, Split- Fragile Relationships, Ewing and George Paton Gallery, Melbourne University. Women at Work, a festival of women's performance art.\n1980 Performance: ''Women at Work : a week of women's performance, June 1980. Ewing and George Paton Gallery, Melbourne University. Artists included Jill Orr and Bonita Ely.\n1982 Appointment: Betty Churcher appointed Dean of the School of Art and Design at Melbourne's Phillip Institute of Technology, she is the first female head of an Australian tertiary institution.\n1982 Project: Christine Westwood and Sue Hill, Women in Theatre Project – a year-long initiative at Belvoir Street Theatre to create opportunity for women directors, play writers, designers and visual artists and creatives in Australia. New plays were written and performed, the project was documented by Juno Gemes, Sandy Edwards, Maree Cunningham. Goodburra Projects was formed creating three documentaries including: Representing Aboriginal Women in Film and Theatre an interview with Justine Saunders interviewed by Juno Gemes produced by Goodburra Doco Collective.\n1982 Exhibition: Rosalie Gascoigne is the first female artist to represent Australia at the Venice Biennale\n1982 Festival: NSW Women and Arts Festival, October 1982, included more than 1,000 events throughout New South Wales and initiated a national research project about women in the arts. A Women's Arts Fellowship was awarded to an outstanding female artist/arts worker by the NSW Government for the next few years.\n1982 Artwork: Juno Gemes, We Wait No More, Portraits of Aboriginal resistance and leadership, Hogarth Gallery Sydney, Manuka Gallery, Canberra, APMIRA Artists for Land Rights exhibition, Paddington Town Hall, Sydney.\n1982 Artwork: After the Tent Embassy photographic exhibition at ACP. Catalogue text by Marcia Langton, published by Valadon Press. First exhibition underpinned by an Aboriginal narrative perspective of Australian History.\n1983 Publication: Janine Burke's Joy Hester published.\n1984 Artwork: Julie Rrap, Persona and Shadows (series), 1984, photographic collage\n1985 Publication: Art In A Cold Climate is published by the Women's Art Register. A six-month research project, undertaken by Merren Ricketson and Bernadette Burke, that investigated the representation of women artists (visual arts focus) across art school graduates, exhibitions in commercial galleries (Melbourne Metropolitan area), one-person exhibitions, media coverage in newspapers, staff at art institutions and common textbooks in use for art history courses in Australia. The research asked the question \"Does discrimination against women artists occur in the commercial gallery system, in public gallery exhibition and representation, in media attention and in employment opportunities?\" A five-page summary of findings was published, along with 13 pages of discussion and analysis by Bernadette Burke, Merren Ricketson and Erica McGilchrist. Summary reprinted in the Women's Art Register Bulletin No. 64, June 2019.\n1985 Project: Coordinated by Carolyn Lewens and five photographers from Lewen's TAFE women's photography course, ''Prahran Neighbourhood House women's photography project, 1985, photographic panels documenting the activities of women at the Neighbourhood House under certain themes including child-care, after school activities, home environments and portraits.\n1986 Publication: Australian Women Photographers 1840–1960'', Barbara Hall and Jenni Mather\n1986 Mural: The Women's Mural \"Bomboniere to Barbed Wire\" located on Smith Street, Fitzroy was painted by artists [https://www.meganevansartist.com/archive-car4 Megan Evans] and Eve Glenn, on the former site of the Fitzroy Gasworks. The mural is 50 metres long and 12 metres high and features a cacophony of local women's images celebrating the cultural diversity of the Northcote area. \"The artwork served as a reminder to many of what the area was about: community, creativity and women working together to create a great place to live.\" The mural was subsequently defaced, prompting a community campaign to document the history of the mural and responses to it. The mural was destroyed to make way for development as part of the Fitzroy Gasworks Development Plan.\n1987 Appointment: Betty Churcher appointed Director of the Art Gallery of Western Australia, she is the first female director of a state art gallery.\n1987 Exhibition: Feminist Narratives, George Paton Gallery, curated by Juliana Engberg. Artists: Pat Brassington, Debra Dawes, Leah MacKinnon, Andrea Paton, Ann Wulf.\n1988 Artwork: The First Supper by Susan Dorothea White.\n1988 Merren Ricketson and Helen Vivian co-found Artmoves Inc. (1988–2000), a not for profit association for the support and promotion of women's art and artists.\n1988 Exhibition: Judy Chicago's The Dinner Party exhibited at the Royal Exhibition Building, Melbourne, the final showing of The Dinner Party's nine year world tour.\n1988 Event: The Women's Dinner, held at the Royal Exhibition Building, Melbourne. Organised by the Women's Art Register, over 1200 women sat down to dinner to celebrate the exhibition of Judy Chicago's The Dinner Party. Chicago spoke at the event, and entertainment included Margaret Roadknight. The organisation of the dinner was led by Liz McAloon, with a committee of volunteers from the Women's Art Register.\n1988 Publication: Launch of The Women’s Art Register Bulletin, Volume 1, Number 1, April, 1988. Cover design by Isabel Davies. The Women's Art Register Bulletin has been published continuously since 1988. News, reviews, critique and discussion extend the work of the Women's Art Register and its collections. The journal is now available as a digital publication via the National Library of Australia's E-Deposit Scheme (NED) in all State Libraries across Australia.\n1989 Artwork: Something More by Tracey Moffatt.\n1990s\n1990 Appointment: Betty Churcher appointed director of the National Gallery of Australia (1990–1997), she is the first female director of the gallery.\n1991 Exhibition: Frames of Reference: Aspects of Feminism and Art, Artspace, Sydney, curated by Sally Couacaud. Artists: Kathy Temin, Susan Norrie, Vivienne Binns, Rebecca Cummins, Anne MacDonald. Featuring the artwork of Dolly Nampijinpa Daniels and several other collaborators.\n1991 Event: ''At least it's gone to a good home: Women collecting and producing art at the University of Sydney 1971–1991, Tin Sheds Gallery, University of Sydney (13 September-5 October).  Curators: Susan Best, Brownyn Hanna, Therese Kenyon and Joan Kerr. Part of Dissonance: Feminism and the Arts.\n1991 Manifesto: VNS Matrix (Virginia Barratt, Francesca da Rimini, Juliane Pierce, Josephine Starrs), Cyberfeminist Manifesto for the 21st Century'', Adelaide. The manifesto was distributed on street posters around Adelaide. VNS Matrix was an artist collective founded in Adelaide and active 1991–1997. VNS Matrix is pronounced 'Venus Matrix'.\n1991 Exhibition: The Aboriginal Women’s Exhibition, curated by Hetti Perkins, Art Gallery of NSW.\n1992 Exhibition: Feminisms: An Exhibition of 27 Women Artists, PICA, Perth, curated by Nikki Miller.\n1992 Event: Caroline Chisholm's likeness on the Australian 5 dollar note replaced by portrait of Queen Elizabeth II.\n1992 Publication: Sandy Kirby, ''Sight Lines, Women's Art and Feminist Perspectives in Australia, Craftsman House (1992).\n1992 Artmoves (Merren Ricketson and Helen Vivian) produces the ground breaking exhibition Completing the Picture: Women artists and the Heidelberg Era (1992), curated by Victoria Hammond and Juliette Peers, with accompanying 88 page catalogue, edited by Helen Vivian. Completing the Picture researched and uncovered previously unknown women artists of the Heidelberg School, and critiqued the representation of the work of women artists from that era. The exhibition toured to 9 Australian metropolitan and regional galleries in 1992/1993 including Ballarat Fine Art Gallery, Castlemaine Art Gallery, Benalla Art Gallery, and Heide Museum of Modern Art (VIC), S.H.Ervin Gallery (NSW), Carrick Hill Gallery (South Australia), where the exhibition was opened by Margaret Whitlam, Queen Victoria Museum and Art Gallery, Tasmanian Museum and Art Gallery (TAS), and Art Gallery of Western Australia, (WA). The exhibition featured the work of 19 women artists from 1876 to 1916, including: Cristina Asquith Baker, Alice Bale, Emma Minnie Boyd, Alice Chapman, Florence Fuller, Portia Geach, Ina Gregory, Grace Joel, Dora Meeson, Mary Meyer, Josephine Muntz Adams, Helen Peters, Jane Price, Iso Rae, Dora Serle, Clara Southern, Jane Sutherland, Violet Teague, May Vale.\n1994 Exhibition: The Women's Show, Sutton Gallery, Melbourne\n1994 Collective: WandA (Women and Arts) established in Brisbane by founding members Edwina Bartleme, Brona Keenan, Tracey Benson, Rosz Craig\n1994 Publication: Catriona Moore, Dissonance: Feminism and the Arts 1970-1990, Allen & Unwin (1994, Paperback).\n1995 Exhibition WWWO: Wollongong Worlds Women Online'', first national Australian online women's group exhibition, featuring the first or early digital works from 30 women including Francis Dyson and Mez Breeze. Curators Melinda Rackham,  Louise Manner, Ali Smith, Sandy Indlekofer-O'Sullivan.\n1995 Exhibition: March–April Women Hold Up Half the Sky, an exhibition to celebrate 150 years of women artists on International Women's Day, at the National Gallery of Australia in Canberra\n1995 Exhibition: ''National Women's Art Exhibition, simultaneous exhibitions in over 147 galleries, museums and libraries.\n1995 Exhibition: VNS Matrix: ALL NEW GEN, (VNS Matrix: Virginia Barratt, Francesca da Rimini, Juliane Pierce, Josephine Starrs), Australian Centre for Contemporary Art (ACCA), Melbourne. Part of the National Women's Art Exhibition.\n1995 Exhibition: ''In the Company of Women: 100 years of Australian women's art from the Cruthers Collection'', PICA, Perth, curated by Sarah Miller. Part of the National Women's Art Exhibition.\n1995 Exhibition: Bur-ran-gur ang (court out): Women and the law, Lawrence Wilson Art Gallery, Perth, curated by Annette Pedersen. Part of the National Women's Art Exhibition.\n1995 Exhibition: Out of the Void: Mad and Bad Women, Queensland Art Gallery, Brisbane, touring Queensland. Part of the National Women's Art Exhibition.\n1995 Exhibition: Girls Girls Girls, Annandale Galleries, Sydney, also Orange Regional Gallery. Women's show to mark the 20th Anniversary of the United Nations, Year of the Woman.\n1995 Exhibition: ''Beyond the Picket Fence: Australian women's art in the National Library of Australia'', Part of the National Women's Art Exhibition, National Library of Australia\n1995 Exhibition: Review: Works by Women from the Permanent Collection. 300 works by more than 80 artists, from the Australian collections at the Art Gallery of New South Wales, curated by Victoria Lynn.\n1996 Appointment: Lynne Cooke, first female artistic director of the Biennale of Sydney\n1996 Manifesto: VNS Matrix (Virginia Barratt, Francesca da Rimini, Juliane Pierce, Josephine Starrs) Bitch Mutant Manifesto, Adelaide.\n1996 Exhibition: Women Hold Up Half the Sky: the Orientation of Art in the Post-War Pacific, Monash University Gallery, Melbourne, curated by Roger Butler. Artists: Micky Allan, Vivienne Binns, Kate Daw, eX de Medici, Diena Georgetti, Joan Grounds, Helga Groves, Indulkana Community (SA), Emily Kame Kngwarreye, Narell Jubelin, Maningrida Arts (NT), Banduk Marika, Ann Newmarch, Margaret Preston, Thancoupie, Kelly Thompson, Utopia Batik (NT), Toni Warburton, Judy Watson, Robin White\n1996 Exhibition: Inside the Visible, Boston: ICA/ MIT: Kanaal Art Foundation, and Touring to Whitechapel, London, and PICA, Perth, Australia, curated by Catherine de Zegher (USA)\n1997 Exhibition: Ann Newmarch first living female artist to be given a Retrospective exhibition at the Art Gallery of South Australia The Personal is Political in 1997.\n1997 Exhibition: Difficult Territory: a postfeminist project, Artspace Sydney, curated by Kristen Elsby\n1999 Event: Guerrilla Girls brought to Melbourne by RedPlanet for screenprinting workshops and lectures.\n1999 Publication: Australian feminist art historians Joan Kerr & Jo Holder publish Past present : the national women's art anthology\n2000s\n2003 Publication: Germaine Greer publishes The Beautiful Boy.\n2004 Artwork: Mary Lou Pavlovic Liar! Public Art, Melbourne\n2004 Death of Gabrielle Pizzi, widely admired dealer in contemporary aboriginal art.\n2004 Death of Joan Kerr (1938–2004), Australian art historian\n2004 Exhibition: Genetics'' Women's Art Register members exhibition, Horti Hall, Melbourne.\n2006 Exhibition: Feminist Actions, Spacement, Melbourne, curated by Veronica Tello. Artists: Andrew Atchison, Pia de Bruyn, Sue Dodd, Sarah Lynch, Alex Martinis Roe, Ali Sanderson, Jessie Scott\n2007 Exhibition: Bird Girls, Margaret Lawrence Gallery, VCA, curated by Kate Daw and Vikki McInnes. Artists: Fiona Abicare, Jessie Angwin, Cate Consandine, Danielle Freakley, Kate Just, Simone Slee, Andrea Tu\n2007 Forum: Feminism Never Happened, Gertrude Contemporary Art Spaces, Melbourne. Panelists included: Julie Rrap, Alex Martinus Roe, Ann Marsh, Lily Hibberd, Felicity Coleman, Lyndall Walker, Emily Cormack\n2007-8 Exhibition: Julie Rrap: Body Double, MCA, Sydney, curated by Victoria Lynn\n2007-8 Exhibition: Girl Parade, ACP, Sydney, curated by Bec Dean. Artists: Anoush Abrar (Iran) & Aimée Hoving (Netherlands), Bianca Barling (SA), Anthea Behm (NSW), Brown Council (NSW), Kelli Connell (USA), Pilar Mata Duppont & Tarryn Gill (WA), Karina Grundy (SA), EJ Major (UK), Belinda Mason (NSW), Tatjana Plitt (VIC), Narinda Reeders (VIC), Tomoko Sawada (JAPAN) and Justene Williams (NSW).\n2008 Exhibition: Utopia: The Genius of Emily Kame Kngwarreye developed by the National Museum of Australia and shown at the National Museum of Art in Osaka, Japan.\n2008 Exhibition: Lauren Berkowitz/ Starlie Geikie, Neon Parc, Melbourne, curated by Rebecca Coates.\n2008 Exhibition: A Time Like This, VCA Margaret Lawrence Gallery, Melbourne. Curated by Samantha Comte, Jirra Lulla Harvey, Kate Rhodes and Meredith Turnbull. Artists: Louisa Bufardeci, Bindi Cole, Lorraine Connelly-Northey, Eliza Hutchison, Wietske Maas, Kate Smith, Salote Tawale, Annie Wu.\n2008 Exhibition: Emily Floyd, Temple of the Female Eunuch, Anna Schwartz Gallery, Melbourne.\n2008 Exhibition: Girls, Girls, Girls, Carlton Hotel, Melbourne, curated by Lyndal Walker and Nat Thomas.\n2008 Publication: Australian feminist academic Elizabeth Grosz publishes Chaos, Territory, Art: Deleuze and the Framing of the Earth.\n2008 Publication: Essay, On Rage, by Germaine Greer (academic, social commentator and collector of Aboriginal art).\n2008 Birth: Nicole Kidman names her child after arts patron Sunday Reed (1905–1981).\n2008 CoUNTess: Women Count in the Art World blog launched by Elvis Richardson.  Blog compiles and reviews gender equality in the Australian art world.\n2008 Collective: Despoina Media Coven (DMC) a feminist group based in Hobart founded by Nancy Mauro-Flude. Formed initially as a curatorial premise, a mail list for discussion and a hackspace aimed at removing the strict barriers between software users and developers to enable the 'uninitiated' artist into using free software; a largely male user base. It advocates home-brewed methods for collective gain (think of self-organized digital art literacy circles). Associates are not fixed but expand and contract in response to each project.\n2010s\n2010 Exhibition: A Different Temporality: Aspects of Australian Feminist Art Practice 1975–1985, Monash University Museum of Art, Melbourne. Curated by Kyla McFarlane\n2010 Exhibition: Feminism Never Happened, IMA, Brisbane. Artists: Del Kathryn Barton, Pat Brassington, Kirsty Bruce, Jacqueline Fraser, Anastasia Klose, Fiona Lowry, Fiona Pardington, Yvonne Todd, and Jemima Wyman\n2010 Exhibition: The View From Here: 19 Perspectives on Feminism, West Space, Melbourne, 14 May 2010 – 29 May 2010. Curated by Clare Rae and Victoria Bennett. Artists: Jessie Angwin, Kiera Brew Kurec, Brown Council, Madeleine Donovan, Mariam Haji, Hannah Raisin, Jessie Scott, Hayley Forward and Jessica Olivieri with the Parachutes for Ladies. Writers: Emilie Zoey Baker, Laura Castagnini, Tamsin Green, Anna Greer, Rachel Fuller, Jo Latham, Dunja Rmandic, Daine Singer, Nella Themelios.\n2010 Death of Eva Breuer, at the time one of the major dealers of secondary market Australian paintings. Breuer was one of the few dealers stocking works by notable, lesser known twentieth century female Australian artists: Bessie Davidson, Margaret Cilento, Janet Cumbrae Stewart, Margo Lewers, Jean Bellette, Dorrit Black, Lina Bryans, Nora Heysen, Mirka Mora, Florence Rodway, Jane Sutherland.\n2010 Event: The Feminist Salon Group, The Envelope Residency, The West Wing, West Space Project Site, Melbourne, 24 May 2010 – 29 May 2010. Coordinated by Caroline Phillips and Sarah Lynch. A week-long residency with artists and writers who engaged with a text by Luce Irigaray. The Activities included performance, film, visual art, sound, reading, discussion and a lecture by Dr. Louise Burchill. Participants: Sharon Billinge, Dr. Louise Burchill, Victoria Duckett, Catherine Evans, Janice Gobey, Kate Hodgetts, Kate Just, Anastasia Klose, Angie de Latour, Sarah Lynch, Valentina Palonen, Caroline Phillips, Hannah Raisin, Caroline Thew,  Inez de Vega and Jane Whitfid.\n2010 Exhibition: Holding Pattern, George Paton Gallery, Melbourne. Artist: Caroline Phillips.\n2010 Exhibition: Twined: Weaving and Abstraction, Cross Art Projects, Sydney. Artists: Robyn Djunginy and Karen Mills. Curated by Fiona McDonald.\n2011 Exhibition: Twining: Weaving and Abstraction, Dawes / Djunginy / Mills / MacDonald, 24hr Art, Northern Territory Centre for Contemporary Art, Darwin. Artists: Debra Dawes, Robyn Djunginy, Fiona MacDonald and Karen Mills. Co-Curators: Jo Holder and Fiona MacDonald with Karen Mills.\n2011 Exhibition: Kate Just, Venus Was Her Name, Kunsthalle Krems, Austria, 16/10/2011 – 04/03/2012. VENUS WAS HER NAME was a solo exhibition at the Kunsthalle in Krems, Austria from 2011 to 2012, which was later presented in 2013 at Daine Singer gallery in Melbourne.\n2012 Exhibition: No Added Sugar, Casula Powerhouse Arts Centre, NSW Artists: Asiya Sian Davidson, Crooked Rib Art, Fatima Killeen, Idil Abdullahi, Marwa Charmand, Mehwish Iqbal, Resala Alazzawi and Zeina Iaali, and creative writing by Eugenia Flynn.\n2012 Exhibition: Contemporary Australia: Women, Queensland Art Gallery: Gallery of Modern Art, Brisbane, 21 April – 22 July 2012. Artists: Amata painters: senior artists, Tjampawa Katie Kawiny; Wawiriya Burton; Ruby Tjangawa Williamson; Iluwanti Ken; Tjungkara Ken; Paniny Mick, Rebecca Baumann, Lauren Brincat, Brown Council, Kirsty Bruce, Bindi Cole, Agatha Gothe-Snape, Marie Hagerty, Fiona Hall, Natalya Hughes, Ruth Hutchinson, Deborah Kelly, Justine Khamara, Anastasia Klose, Gabriella Mangano and Silvana Mangano, Jennifer Mills, Kate Mitchell, Rose Nolan, Jess Olivieri and Hayley Forward with Parachutes for Ladies, Therese Ritchie, Sandra Selig, Noël Skrzypczak, Sally Smart, Soda_Jerk, Wakartu Cory Surprise, Hiromi Tango, Monika Tichacek, Jenny Watson, Judy Watson, Louise Weaver, Justene Williams, Gosia Wlodarczak and Judith Wright. Curated by Julie Ewington.\n2012 Event: Guerrilla Girls public lecture and workshop at the Victorian College of the Arts in Melbourne. Part of a wider discursive project about humour in feminist art curated by Laura Castagnini and Vikki McInnes through the NAVA Curatorial Mentorship Initiative.\n2012 Exhibition: Feminage – The logic of Feminist Collage, The Cross Art Projects, Sydney.\nArtists: Karla Dickens, Elizabeth Gower, Emily Hunt, Mehwish Iqbal, Deborah Kelly, Fiona MacDonald, Paula do Prado, Sangeeta Sandrasegar, Sally Smart, Tai Snaith, Nancy Spero, Jemima Wyman. Curator: Jo Holder with assistant curator Sofia Freeman\n2012 Exhibition: ''The Baker's Dozen, curated by Lorna Grear, UTS Gallery, The University of Technology, Sydney\n2012 Exhibition: SEXES, Performance Space, Carriageworks, Sydney. Artists:  Christian Thompson, Cigdem Aydemir, Eric Bridgeman, Jessica Olivieri and the Parachutes for Ladies, John Meade, Julie Rrap, LEVEL, Liam Benson, Luke Parker & Sangeeta Sandrasegar, Marley Dawson, Natalya Hughes, Paul Knight, Philip Brophy, The Kingpins, Tarryn Gill & Pilar Mata Dupont, Tracey Moffatt & Gary Hillberg, Trevor Fry. Curated by Bec Dean, Deborah Kelly and Jeff Khan. Exhibition accompanied by multi-disciplinary program of dance, performance, lectures, film and parties, and extensive catalogue.\n2012 Exhibition: Linde Ivimey: If Pain Persists, University of Queensland Art Museum, Brisbane.\n2012 Event: A Dinner Party: setting the table. Curated by Victoria Duckett and Caroline Phillips. A collaborative feminist residency at West Space, Melbourne including workshops, film programs, forums and exhibition of feminist art archive. Participants included Kate Just, Jon Dale, Danni Zuvela, Marcia Jane, Virginia Fraser, Kate MacNeill, Stephanie Alexander, Lyndal Walker, Victoria Bennett, Anne Marsh, Catherine Deveney, Laura Castagnini and Inez de Vega.\n2013 Event: The f Word – Regional Feminist Art Forum, La Trobe Visual Art Centre, Bendigo. Curated by Caroline Phillips. Panel including Juliette Peers, Filomena Coppola and Virginia Fraser, and workshop facilitated by Inez de Vega. Accompanied by extensive catalogue including The f Word forums, workshops and two exhibitions.\n2013 Exhibition: BACKFLIP: Feminism and Humour in Contemporary Art, Margaret Lawrence Gallery, Victorian College of the Arts, Melbourne. Artists: Catherine Bell, Melanie Bonajo, Brown Council, Catherine or Kate, Patty Chang, Guerrilla Girls, Hotham Street Ladies, Alice Lang, Louise Lawler, Adelle Mills, Tracey Moffatt, Nat & Ali, Frances (Budden) Phoenix, Pushpamala N, Hannah Raisin, Pipilotti Rist, Mika Rottenberg, Christian Thompson and Paul Yore. Curated by Laura Castagnini. Exhibition accompanied by extensive publication, a program of panel discussions and performances, and the on site VCA Video Lounge; an archive of funny feminist videos made by former students during their time at the VCA School of Art.\n2013 Exhibition: Ponch Hawkes, \"Our Mums and Us\" and \"These Women Have Just Run 26 Miles\" at Monash Gallery of Art, curated by Stephen Zagala\n2013 Research and Collective: Contemporary Art and Feminism (CAF)  launched, 30 October, Sydney College of the Arts. An independent platform for art, scholarship and activism, instigated by Catriona Moore, Jacqueline Millner, and Jo Holder.\n2013 Exhibition: Kate Just, Venus Was Her Name, Daine Singer gallery, Melbourne, 4 March – 20 April 2013.\n2013 Performance: Casey Jenkins, Casting Off My Womb, in exhibition Cunts... And Other Conversations, Darwin Visual Arts Association, 18 October – 9 November 2013,\n2013 Exhibition: JANIS I'', ALASKA Projects, Sydney. This exhibition marked the launch of Kelly Doley's JANIS, a project focusing on female art practice, promoting curatorial, writing and art projects. Exhibition included work by artists: Sarah Contos, Kelly Doley, Hannah Furmage, Zoe Robertson, Marian Tubbs and Justene Williams. Alongside the exhibition a publication featured the writing of Diana Smith and Amanda Rowell.\n2013 Panel: JANIS I: Feminism in Contemporary Art: If Not Why Not?, Artspace, Sydney, March 23, 2013. In 'If Not, Why Not?' an intergenerational selection of artists, curators and academics come together to talk about the misconceptions, meaning and relevance of feminism in contemporary art today. Speakers include Julie Rrap (artist), Catriona Moore (Academic ArtHistTh and author of Dissonance: Feminism and the Arts 1970–1990), Natalya Hughes (artist), Anna Davis (curator MCA), Jess Olivieri (Parachutes for Ladies). Chaired by Kelly Doley (Brown Council).\n2013 Exhibition: JANIS II,  The Commercial and MCLEMOI Gallery, Sydney. Co-curated by Kelly Doley and Amanda Rowell included a diverse range of painting, sculpture and performance from emerging and mid-career artists as well as two deceased artists. JANIS II artists included Bonita Bub, Jenny Christmann, Sarah Goffman, Gail Haistings and Sarah Rodigari. According to art critic Andrew Frost the exhibition produced a palpable wave through the Sydney art world.\n2014 Exhibition: Katherine Hattam, Consciousness Raising, Daine Singer Gallery, Melbourne. Catalogue with texts by Ellen Koshland, Victoria Hattam, Jenny Little, Hannah Piterman, Ann Snitow, Kate Reeves, Suzanne Spunner, Margaret Bowland and Hilary McPhee.\n2014 Conference: Curating Feminism A Contemporary Art and Feminism event co-hosted by Sydney College of the Arts, Art Gallery New South Wales and MCA. Exhibition, masterclasses, conference and Wikithon, Keynotes: Michael Birchall: Activism & Art: for the de-proletarianized petty bourgeoisie; Maura Reilly: Curatorial Activism: Towards an Ethics of Curating.\nCo-ordinating Curator: Jacqueline Millner\n2014 Event: Technopia Tours Feminist Art Bus. Presented by Kim Donaldson and Caroline Phillips. A collaborative event between Technopia Tours and The f Word, a workshop on wheels in Melbourne, Australia, celebrating IWD 2014. Speakers and performers included Laura Castagnini, Ebony Gulliver, Susan Hewitt, Kate Just, Dot Kett, Lyndal Jones, Vicki Kinai, Penelope Lee, Justine Makdessi, Elvis Richardson, Kate Robertson, Nat Thomas, Kalinda Vary and Inez de Vega. Accompanied by extensive catalogue including The f Word forums, workshops and two exhibitions.\n2014 Exhibition: The f Word, Sale. Gippsland Art Gallery, Sale. July 19 – September 7, 2014. Artists: Catherine Bell, Penny Byrne, Filomena Coppola, Kate Just, Jill Orr, Clare Rae and Elvis Richardson. Curated by Caroline Phillips. Accompanied by extensive catalogue including The f Word forums, workshops and two exhibitions.\n2014 Exhibition: Anne Ferran: Shadow Land, Lawernce Wilson Art Gallery, 8 February – 19 April 2014; Australian Centre for Photography 29 November 2014 – 15 February 2015. Curated by Felicity Johnston. Catalogue essays by Susan Best and Thierry de Duve.\n2014 Exhibition: The f Word, Ararat. Ararat Regional Art Gallery, Ararat. August 28 – October 12, 2014. Artists: Kate Beynon,\nKaren Buczynski-Lee, Destiny Deacon, Laurene Dietrich, Eliza-Jane Gilchrist, Janice Gobey, Georgia MacGuire, Robyn Massey, Caroline Phillips, Louise Saxton, Inez de Vega and Lyndal Walker. Curated by Caroline Phillips. Accompanied by extensive catalogue including The f Word forums, workshops and two exhibitions.\n2014 Exhibition: Topologies of Sexual Difference. In conjunction with the Luce Irigaray Circle Conference, Melbourne, Australia, Wednesday 10 to Friday 12 December 2014. George Paton Gallery, Melbourne. Hosted by The Victorian College of the Arts, University of Melbourne and The Communication, Politics and Culture Research Centre at RMIT. Co-ordinated by Dr.Louise Burchill and Caroline Phillips. Artists: Cherelyn Brearley, Janet Burchill, Virginia Fraser, Helen Johnson, Marina Kassianidou, Utako Shindo Kanai, Danni McCarthy, Joanne Makas, Alex Martinis Roe, Caroline Phillips, Kerrie Poliness, Elizabeth Presa, Julieanna Preston, Grace Pundyk, Tania Smith, Jacqueline Taylor, Terry Taylor, Alison Thomson.\n2014 Exhibition: Re-raising Consciousness, TCB Art Inc, Melbourne. Curated by Katherine Hattam and Fayen D'Evie.\n2014 Exhibition: Photography Meets Feminism: Australian women photographers 1970s–80s\nA Monash Gallery of Art travelling exhibition, also showing at the Newcastle Art Gallery, Bundoora Homestead Art Centre, Grafton Regional Gallery.\n2015 Event: Future Feminist Archive Symposium. Presented by Contemporary Art and Feminism & the Art Gallery of NSW Research Library Archives. This symposium brought together artists, archivists, filmmakers, curators and art historians to discuss ways to recover lost Feminist archives and to imagine the new. Keynote lecture by Julie Ewington and presentations by Soda_Jerk, Jess Olivieri, Judy Watson and Joyce Watson,  Margot Nash, Martha Ansara, Jeni Thornley, Natalie Krikowa and others.\n2015 Exhibition: Future Feminist Archive Exhibition, SCA Galleries, Sydney College of the Arts, Rozelle. Exhibition includes 'Daughter Mothers' (Judy Watson, Sue Pedley, Toni Warburton, Alison Clouston); 'Artist Archive' (Jane Polkinghorne and Anne Kay); Feminist Film Archives from the 1970s; and the Parramatta Female Factory Memory Precinct Project.\n2015 Performance: Being Dead (Don Quixote), MKA: Theatre of New Writing. Kerith Manderson-Galvin's production and performance re-worked the Cervantes classic from a queer, feminist showgirl perspective. January 2015.\n2015 Exhibition: Notes Towards a Future Feminist Archive, Affiliated Text, Sydney, curated by Bronia Iwanczak and Lynne Barwick. Artists: Ann Finnegan, Anna Gibbs, Anne Kay, Barbara Campbell, Bec Dean, Bianca Hester, Biljana Jancic, Bronwyn Platten, Carla Cescon, Caroline Phillips, Catherine Bell, Chantal Grech, Cherine Fahd, Christine Dean, Clare Milledge, Cleo Gardiner, Deborah Kelly, Debra Phillips, Deej Fabyc, Elizabeth Day, Elizabeth Pulie, Eugenia Raskopoulos, Fiona MacDonald, Gillian Lavery, Heidi Abraham, Helen Grace, India Zegan, Jacky Redgate, Jacqueline Drinkall, Jane Polkinghorne, Jenny Brown, Josephine Starrs, Josie Cavallaro, Julianne Pierce, Julie Rrap, Kathryn Ryan, Lena Obergfell, Lisa Andrew, Lisa Jones, Loma Bridge, Michele Elliot, Nell, Nicole Ellis, Nola Farman, Pam Brown, Philipa Veitch, Raquel Ormella, Sally Clarke, Sara Givins, Sue Callanan, Susan Charlton, Susan Joy Krieg, Suzan Woodruff, Tina Havelock Stevens, Vesna Trobec, Virginia Barratt and Zanny Begg.\n2015 Exhibition: Relatedness, Melbourne's Living Museum of the West, Maribyrnong. Artists: Cathy Johnstone and Caroline Phillips. April 4 to April 19, 2015.\n2015 Exhibition: ''Come In Lovers, We're Doing Witchcraft, Metanoia Theatre, Brunswick Mechanics Institute. Expen$$$ive Super Group comprising Kerith Manderson-Galvin, Emilia Athanasiadis and Casey Jenkins (a.k.a. Teen-Supreme Brynne, Fancy-Bitch Brynne and Shameless Brynne), production and performance of three music-free video clips exploring the performance of femininity. May 5 to May 8, 2015.\n2015 Festival: AS IF: 40 Years and Beyond -Celebrating the Women's Art Register'', Multi-venue curated festival of feminist visual art events across Melbourne, celebrating the 40th anniversary of the [http://www.womensartregister.org/ Women's Art Register].  Festival Producer, Sally Northfield.  11 August-7 November 2015.\nExhibitions Included:\nAS IF: Stuck up\", Richmond Library Gallery, 11 Aug – 30 Oct 2015, Curated by Miso (Stanislava Pinchuk).\nAS IF: small print, Mailbox Art Space 30 September- 31 October 2015, Curated by Danielle Hakim and Emily Castle.  Artists Violetta Del Conte Race, Kelly Doley, Agatha Gothe Snape, Katherine Hattam, Olivia Hittmann, Anastasia Klose, Ruth O'Leary, Jaime Powell with Cheralyn Lim and Elvis Richardson alongside a selection of artists held in the Women's Art Register collection.\nAS IF: When and now,  Queen Victoria Women's Centre, 30 September- 30 October, Curated by Gail Stiffe and Rosemary Mangiamele. Women's Art Register Members' exhibition.\nAS IF: Artmaking in Tandem: Embracing Distance,  City Library Gallery, 2 – 29 October. A collaboration between artistic women who are newly settled in Melbourne and artist Rosa Tato.\n''AS IF: Echoes from the Women's Art Register,  West Space, 1 October – 7 November, Curated projection program by Juliette Peers and Caroline Phillips, co-curated by Melbourne-based emerging artists Emily Castle, Danielle Hakim, Stephanie Leigh and Kalinda Vary.\nAS IF: Echoing Workshop – Slide Night at the Graham Cornish room, level 2, Union House, University of Melbourne. Tuesday, October 13, 6pm-8.30pm. Facilitators: Danica Chappell, Ross Coulter, Danielle Hakim, Clare Rae. Speakers/artist: Ross Coulter, Eleanor Butt, Anne Marsh, Elizabeth Gower, Danielle Hakim, Clare Rae and Jill Orr.\nAS IF: Echoing Workshop- Echoes from London, West Space, Saturday 7 November, 5-6pm performance by Holly Ingleton, curated and facilitated by Laura Castagnini.\nAS IF: Echoing Workshop – Art+Feminism Wikipedia Edit-a-thon, Saturday 31 October, from 11am at the State Library of Victoria facilitated by Juliette Peers and Caroline Phillips.\nAS IF: WAR Sliders'' City Library Gallery 2 – 29 October projection featuring one work from each of the 918 artists in the Women's Art Register Collection.\nAS IF: Public Art Walks, guided by artists to women's public art in the city of Melbourne, with Penelope Lee, Gina Kalabishis, Rosa Tato (led by Penelope Lee), and Maree Clarke.\n2015 Event: Forum and workshops: f generation: feminism, art, progressions. Mudfest/University of Melbourne Student Union Arts Festival, Melbourne. August 22, 2015. Coordinated by Veronica Caven Aldous, Juliette Peers and Caroline Phillips. Artists and Panellists: Veronica Caven Aldous, Allison Ballantyne, Sasha Chong, Lucy Curtis, Tonie Field, Elizabeth Gower, Juliette Peers and Trashbags.\n2015 Exhibition: f generation: feminism, art, progressions. George Paton Gallery, Melbourne. October 7–16, 2014. Curated by Veronica Caven Aldous, Juliette Peers and Caroline Phillips. Artists: Veronica Caven Aldous, Penny Algar, Micky Allan, Art/Mums Collective (Clare Rae, Clare Needham, Nina Ross, Tai Snaith, Jessie Scott, Hannah Tai, Claudia Phares), Lynne Barwick, Dianne Beevers, Anne Bennett, Kate Beynon, Julia Boros, Karen Buczynski-Lee, Sandy Caldow, Paulina Campos, Valerie Carew (CAN), Tracey-Mae Chambers (CAN), Liz Coates, Filomena Coppola, Cunt/Tampon/ary Art Collective (CAN), Laurene Dietrich, Kim Donaldson, Jaye Early, Katherine Edwards, Catherine Evans, Amanda Fewell, Tal Fitzpatrick, Juno Gemes and Aku Kadogo, Elizabeth Gertsakis, Janice Gobey, Hannah Goldstein, Siobhán Hannigan, Anna Helme, Simone Hine, Hotham Street Ladies, Elin Howe, Casey Jenkins, Rosa Jones (IRE), Kate Just, Deborah Kelly, Therese Kenyan, Jessica Kritzer, Katya Grokhovsky, KTH Stockholm (SWE), Irena Kuzminsky and Jan Nelson, Jennifer Lade, Stephanie Leigh, Danielle McCarthy, Joanne Makas, Carol Mark (CAN), Anne Marsh, Bon Mott, Lynn Mowson, nattysolo.com, Michelle Neal, Sally Northfield, Pam Patterson (CAN), Juliette Peers, Caroline Phillips, Jane Polkinghorne, Paula do Prado, Julieanna Preston (NZ), Rebekah Pryor, Grace Pundyk, Leena Raudvee (CAN), Jenna Reid (CAN), Maria Richardson, Kate Robertson, Meredith Rogers, Lynx Sainte-Marie (CAN), Jocelynne Scutt (UK), Tania Smith, Gail Stiffe, Nina Siska, Sunday School (Kelly Doley and Diana Smith), Tasha Smith (NZ), Jacqueline Taylor (UK), Alison Thomson, Siân Torrington (NZ), Jane Trengove and Susan Long, Maxienne Tritton-Young, Victorian Women's Trust, WIA Projects (CAN), Linda Wilkin, Women's Art Register, Su Yang (CHI), India Zegan, Ann Zomer and Lucy Parker.\n2015 Project: FavourEconomy: Volume 1, 2015–2016 commenced generating favours coinciding with the 2015–2016 financial year. FavourEconomy audio archive consists of recordings shared by women who work in the arts. FavourEconomy operates as a platform where women* can share their knowledge and experience as a favour. The word favour is used to promote a culture of collegial and supportive communication and information sharing – creating value of a different kind. FavourEconomy is led by Claire Field, Alex Pedley and Bronwyn Treacy.\n2016 Publication: The Countess Report 2016. The Countess Report is a benchmarking project and online resource on gender equality in the Australian contemporary art sector. Put together by Elvis Richardson, it compiles and analyses data on education, prizes, funding, art media, organisational makeup, and exhibitions of various kinds across a wide range of galleries including national and State, regional, commercial, ARIs (Artist Run Galleries), and CAOs (Contemporary Art Spaces). The Countess Report is based on publicly available data collected from websites, exhibition catalogues, magazines and media in the calendar year 2014.\n2016 Publication: FavourEconomy: Volume 1. 2015–2016 launched at Frontyard Projects Sydney on June 30, 2016. The inaugural volume of the project was published on the FavourEconomy website the following day July 1, 2016. FavourEconomy Volume 1. 2015–2016 was led by Claire Field, Alex Pedley & Bronwyn Treacy. FavourEconomy Volume 1. 2015 2016 contributors: Nicole Barakat, Heather Burness, Kate Brown, Julieanne Campbell, Cindy Yuen-Zhe Chen, Anzara Clark, Dagmar Cook, Selena de Carvalho, Linda Dement, Briony Downes, Julia Drouhin, Michele Elliot, Claire Field, Caren Florance, Michaela Gleave, Helen Jones, Danica Knezevic, Janis Lander, Birgitta Magnusson-Reid, Valda Marshall, Nancy Mauro-Flude, Gail May, Mish Meijers, Emily Millichip, Laimah Osman, Brigita Ozolins, Alex Pedley, Gaele Sobott, Pip Stafford, Lyndal Thorne, Pam Thorne, Bronwyn Treacy, Sarah Vandepeer, Tricky Walsh, Yvette Watt & Tian Zhang.\n2016 Project: FavourEconomy: Volume 2. 2016–2017 commenced generating favours coinciding with the 2016–2017 financial year.\n2016 Exhibition: Jenny Watson: Chronicles. Griffith University Art Museum, Brisbane. 14 July – 3 September 2016.\n2016 Exhibition: Simryn Gill: Sweet Chariot. Griffith University Art Museum, Brisbane. 16 September – 12 November 2016.\n2017 Exhibition: Hidden Agenda, Trocadero Art Space, 22 February – March 11, 2017. Curated by Casey Jenkins of Craft Cartel. An exploration of hidden and suppressed gender worlds, featuring 30+ female & gender-queer visual artists, activists & performers from 4 continents performing both live & by proxy.\n2017 Exhibition: Ladies Cocktail Night, October 7, 2017 FLASH exhibition to raise money for a women's community shelter being established in the South East suburbs of Sydney. Curated by Aisha Kovacs. Guest speakers and a performance by Pradeepti Sen. Artists exhibiting include: Serina Bajin, Kit, Naomi, Vashti, Krystal and more.\n2017 Exhibition: Angelica Mesiti: Relay League. Griffith University Art Museum, Brisbane. 30 November 2017 – 24 February 2018.\n2017 Publication: FavourEconomy: Volume 2. 2016–2017 launched at Airspace Projects Sydney, coinciding with an exhibition of both Volumes 1 & 2 as an immersive sound installation. FavourEconomy: Volume 2, 2016–2017 was led by Claire Field, Alex Pedley & Bronwyn Treacy. FavourEconomy Volume 2. 2016 - 2017 contributors: Eva Heiky Olga Abbinga, Elizabeth Barsham, Carolyn Cardinet, Michelle Cawthorn, Stella Chen, Charmaine Cole, Rebecca Conroy, Lottie Consalvo, Yvette Coppersmith, Penny Coss, Elisabeth Cummings, Amanda Davies, Paula do Prado, Julie Dowling, Hayley Megan French, Ann Fuata, Rebecca Gallo, Shanequa Gay, Jane Giblin, Janice Gobey, Katya Grokhovsky, Jo Holder, Alana Hunt, Wina Jie, Lea Kannar-Lichtenberger, Nicole Kelly, Anna Magdalena Laerkesen, Anita Larkin, Carla Liesch, Sue Manchoulas, Catriona Moore, Dahne Julian Molony, Laimah Osman, Caroline Phillips, Kate Power, Laura Purcell, Penny Ryan, Nuha Saad, Mia Salsjo, Esther Shohet, Sian Torrington, Cora-Allan Wickliffe, Linda Wilken, Ana Young & Tianli Zu.\n2017 Project: FavourEconomy: Volume 3. 2017–2018 commenced generating favours coinciding with the 2017–2018 financial year.\n2017 Exhibition: FavourEconomy:Stations exhibition at George Paton Gallery, curated by project co-founders Claire Field, Bronwyn Treacy and Alex Pedley. FavourEconomy:Stations presented the audio recordings from Volume 1 & 2 of the project (over 80 audio favours) played on random through multiple headsets placed on 24 chairs. Each chair (seat work) was conceived by a FavourEconomy contributor as a symbolic representation of themselves, their art practice, or simply a chair they would like the audience to sit on whilst listening to the FavourEconomy archive. Seat works by: Carolyn Cardinet, Stella Chen, Charmaine Cole, Elizabeth Barsham, Amanda Davies, Linda Dement, Julie Dowling, Claire Field, Janice Gobey, Katya Grokhovsky, Alana Hunt, Wina Jie, Lea Kannar-Lichtenberger, Sue Manchoulas, Nancy Mauro-Flude, Mish Meijers, Dahne Julian Molony, Alex Pedley, Caroline Phillips, Nuha Saad, Bronwyn Treacy, Cora-Allan Wickliffe, Linda Wilken, Ana Young and Tian Zhang. Coinciding with the FavourEconomy:Stations exhibition. Linda Dement and Nancy Mauro-Flude performed Awry Signals: A Eulogy for the Stellar [Girls] and Katya Grokhovsky live streamed her performance Practicing art while female from New York.\n2017  Event: Against the Odds; Women in Art Forum hosted by the Women's Art Register. A gathering of diverse and cross-generational local women artists to explore issues of place, community, gender and practice within contemporary art. Themes for discussion included the challenges of establishing a career as a woman artist, and changing Australian demographics and evolving cultural communities as drivers of art practice and experience. The program included panel discussions, question time and a feminist souk. Special guests included The Social Studio, Melbourne Artists for Asylum Seekers, Sisterworks, Triple F Collective, Kim Donaldson, Nat Thomas, CoUNTess, Kate Just, Dianne Beevers and Elizabeth Gertsakis.\n2017 Exhibition: Unfinished Business exhibition at Australian Centre for Contemporary Art (ACCA). A major commissioning survey exhibition of feminist artists from Australia, curated Annika Kristensen and Max Delaney, in collaboration with Paola Balla, Julie Ewington, Vikki McInnes and Elvis Richardson. Cross-generational practices were highlighted, with new commissions and historical projects presented by 81 artists across all spaces at ACCA. A program of artist talks, forums, film screenings, performances and education programs accompanied the exhibition.\n2017-2018 Exhibition: Songlines: Tracking the Seven Sisters, National Museum of Australia.\n2018 Exhibition: Seeing Red, curated by Madeleine Kelman Snow and Courtney Novak for The Lock-Up Newcastle NSW - including Tina Havelock-Stevens, Raquel Ormella, Maggie Hensel-Brown alongside Mumu Mike Williams, Dale Collier, Doug Heslop, Dean Cross and Mike Parr. SEEING RED interrogated power and politics addressing a range of issues fought through protest actions:  Indigenous rights, environmentalism, feminism, the early trade union movement, war, injustice and human rights.\n2018  Exhibition: Conspicuous Presence, curated by the Women's Art Register for Trocadero Artspace Guest Curator Program. Gallery 1 - an exhibition of five women artists of colour Sofi Basseghi, Georgia MacGuire, Ema Shin, Khi-Lee Thorpe, Su Yang. Gallery 2 - archival display from the Women's Art Register. Public program including artist talks and an Art+Feminism Wikipedia Edit-a-thon. Supported by Wikimedia Australia.\n2018 Exhibition: Davida Allen: In the Moment. Griffith University Art Museum, Brisbane. 3 May – 30 June 2018.\n2018 Exhibition: Dark rooms: Women directing the lens 1978-98. Griffith University Art Museum, Brisbane. 12 July – 25 August 2018.\n2018 Publication: Bri Lee publishes Eggshell Skull, which becomes a national bestseller.\n2018 Publication: Catriona Moore helps publish \"Feminist Perspectives on Art,\" (Millner, Jacqueline, and Catriona Moore. Feminist Perspectives on Art: Contemporary Outtakes. Routledge, 2018) recognized with selection and editorial matter along with individual chapters. Moore also worked on \"Future Feminist Archive,\" a year-long project across New South Wales in which she used archives to create exhibitions, workshops, performances and publishing outcomes to enhance the feminism movement in Australia.\n2018 Event: The Great Divide: feminist art practice across generations and geography presented by the Women's Art Register, in collaboration with (Re)Present (USA). An intergenerational conversation between the Women's Art Register and (Re)Present (USA), part of the National Gallery of Victoria's MEL/NYC exhibition and festival. Preceding the event, a collaborative poster zine was developed, designed by Lisa Mansfield. Selected drawings from a crowdsourced callout in Melbourne were merged with text from (Re)Present in NYC, a collaborative response to the question \"What does feminism mean to you?\" The posters were distributed in Melbourne and NYC.\n2018-2021 Exhibition: Promiscuous Provenance touring exhibition by Anna Glynn travelled to Shoalhaven Regional Gallery (NSW), Margaret Whitlam Gallery at the Whitlam Institute (NSW), Noosa Regional Gallery (QLD), The World Theatre (QLD), Basil Sellers Exhibition Space (NSW), Hahndorf Academy (SA), Swan Hill Regional Gallery (VIC), Jervis Bay Maritime Museum (NSW), Hawkesbury Regional Gallery (NSW). The exhibition interrogated the strangeness of the early colonial artists' first encounters with the Australian landscape and Glynn explored historical artworks including those of John Hunter, the Port Jackson Painter, and George Raper. She worked with painting, drawing, installation, 3D printing, sound and photomontage on chiffon.\n2019 Exhibition: Herland: In search of a female utopia, an exhibition curated by Freÿa Black and held at The Women's Library, Sydney from 8 March to 4 April.\n2019 Publication: 2019 Countess Report In 2016, the first Countess Report was released, with the financial support of The SHEILA Foundation. It revealed in detail what the Countess blogspot first started reporting in 2008 - that an imbalance of power existed in the Australian\nart world. Men held more positions at senior levels and male artists were significantly better represented across the sector, despite 75% of art school graduates being female. In 2019 the updated report chronicled key changes in the sector between 2014 and 2018. In a sentence: the representation of women has significantly improved in 2018.  Countess Report counted over 13,000 artists across 184 institutions. The category of non-binary artist was included for the first time, to create a benchmark for non-binary representation within the sector: - 71% of art school graduates are women. There was an increase in the representation of women artists of between 10 and 20% across artist run spaces, commercial galleries, contemporary art organisations, public galleries, major museums and university galleries. - State galleries and museums continue to significantly under-represent women in their collections and exhibitions. - In State galleries and museums the representation of women decreased from 36.9% to 33.9% from 2016 to today. - Non-binary artists were represented at 1-2% across the sector, with no non-binary artists recorded in curated state gallery exhibitions in 2018. - 52% of art prize winners were women, with the top ten prizes (in dollar value) being a 50/50 split.\n2019 Exhibition: New Woman, curated by Miranda Hine, showcasing 80+ women and non-binary artists from the past 100 years at the Museum of Brisbane, Brisbane.\n2019 Exhibition: Keg de Souza: Common Knowledge and Learning Curves. Griffith University Art Museum, Brisbane. 9 May – 13 July 2019.\n2019 Exhibition: Bonita Ely: Future Tense. Griffith University Art Museum, Brisbane. 12 October 2019 – 8 February 2020.\n2019 Exhibition: Re-Register: Australian Women Sculptors from the Women’s Art Register. Richmond Town Hall and Richmond Library, Melbourne. 1 November 2019 - 31 January 2020. An exhibition of works by Julia Boros, including archival materials from the Women's Art Register, in response to the 1978 research project, slide kit and exhibition Profile of Australian Women Sculptors 1860 - 1960.\n2020s\n2020 Publication: She persists: Perspectives on women in art & design, an anthology launched at the National Gallery of Victoria (edited by Annika Aitken, Isobel Crombie, Megan Patty, Maria Quirk, and Myles Russell-Cook)\n2020 Event: Art + Feminism Wikipedia edit-a-thons coordinated nationally for the first time, with campaigns in Adelaide, Alice Springs, Brisbane, Canberra, Hobart, Melbourne, Perth, and Sydney, in conjunction with International Women's Day, #KnowMyName, the Women's Art Register and Wikimedia Australia.\n2020 Exhibition: Herland II: Our Land, an exhibition curated by Freÿa Black and held at The Women's Library, Sydney, 8 March – 4 April\n2020 Event: #remakemistresses, an Instagram intervention by Melinda Rackham remaking contemporary Australian women artists in the COVID era; April 2020 onwards\n2020 Publication: It Comes In Waves, an intergenerational conversation series hosted by Katie Ryan, published by the Women's Art Register; participants include Meredith Rogers and Manisha Anjali, Alex Cuffe and Merren Ricketson, Georgia Banks and Juliette Peers, Lara Chamas and Natalie Thomas, Alice McIntosh and Bonita Ely\n2020-2022 Exhibition: Know My Name: Australian Women Artists 1900 to Now, National Gallery of Australia exhibition in two parts. Curated by Elspeth Pitt and Deborah Hart, Know My Name is \"the largest exhibition by solely women artists ever held in Australia\".\n2020 Exhibition: ''Elizabeth Newman: Is That a 'No'? Griffith University Art Museum, Brisbane. 8 September - 21 November 2020.\n2021 Publication: Anne Marsh Doing Feminism: Women's Art and Feminist Criticism in Australia'' (Melbourne University Press)\n2021 Project: The Women's Art Register launches This Is W.A.R!, an ongoing, interactive online map of sites of women's art practice\n2021 Exhibition: '''choose to challenge''', International Women's Day exhibition at Project Contemporary Artspace, Wollongong, New South Wales, March 3 - March 14\n2021 Exhibition: \" [https://www.bendigoregion.com.au/bendigo-art-gallery/exhibitions/soul-fury SoulFury] \" curated by Nur Shkembi, independent curator and scholar of contemporary Islamic art, in collaboration with Bendigo Art Gallery 7 August 2021 - 30 January 2022. Featuring the work of sixteen local and international contemporary female artists. Winner of the National Award for best temporary or touring exhibition AMAGA Awards 2022.\n2022 Exhibition: Deborah Kelly: CREATION, Griffith University Art Museum, Brisbane. 24 Feb-28 May 2022.\n2022 Exhibition: Female Drivers at Maitland Regional Art Gallery, curated by Madeleine Kelman Snow and including Mechelle Bounpraseuth, Michelle Brodie, and others, with the addition of seminal feminist works from the gallery collection by Fiona Foley, Fiona Hall, and Paula Rego.\n2022 Event and Publication: The ''Women's Art Register publishes Leaving Your Legacy, A Guide for Australian artists''. ISBN 978-0-6487792-1-6  A guide to empower women artists to create their own legacy. The project included a discussion event with presentations by Kate MacNeill, Frances Tapueluelu and Denise Keele-Bedford, a Forum of professional practice support across legal, financial, art market and conservation issues, and the publication of an artists' Workbook. A special edition of the Women's Art Register Bulletin, Vol 70 (July, 2022), expanded on the issues raised by the Forum, featuring case studies and discussion on the difficulties faced by Australian women artists in securing their legacy.\n2023 Exhibition: SHE of Mind and Body, Walker Street Gallery, Dandenong. Curated by Alojz Babic. Celebrating 20 years of International Women's Day exhibitions at the Walker Street Gallery, She of Mind and Body presented ten female textile artists: Danielle (Dans) Bain, Anna Farago, Neroli Henderson, Georgia MacGuire, Chaco Kato, Vonda Keji, Caroline Phillips, Nusra Latif Qureshi, Ema Shin, and Kate V M Sylvester. Catalogue essay by Juliette Peers.\n2023 Exhibition: Know My Name: Making it Modern, National Gallery of Australia, celebrating pioneering women artists who changed the course of modern art in Australia. Artists: Ethel Spowers, Eveline Syme, Margaret Preston, Grace Cossington Smith, Clarice Beckett, Olive Cotton.\n2023-2024 Exhibition: Know My Name: Australian Women Artists – begins a two-year tour of regional Australia, with over 60 works by 56 First Nations and Australian women artists. Know My Name is a National Gallery of Australia (NGA) initiative to increase representation of women artists. Opening at the Mornington Peninsula Regional Gallery, VIC, the exhibition continues on to Horsham Regional Art Gallery, VIC, Tweed Regional Gallery & Margaret Olley Art Centre, NSW, Perc Tucker Regional Gallery, QLD, and Rockhampton Museum of Art, QLD.\nArt historians, theorists and curators\n*Jude Adams\n*Caroline Ambrus\n*Carolyn Barnes\n*Susan Best\n*Jennifer Biddle\n*Freÿa Black\n*Barbara Bolt\n*Clothilde Bulleen\n*Janine Burke\n*Anita Callaway\n*Lynne Cooke\n*Felicity Colman\n*Julie Ewington\n*Marita Fraser\n*Virginia Fraser\n*Claire Field\n*Elizabeth Gertsakis\n*Angela Goddard\n*Janda Gooding\n*Germaine Greer\n*Elizabeth Grosz\n*Barbara Hall\n*Pat Hoffie\n*Jo Holder\n*Jeanette Hoorn\n*Jane Hylton\n*Caroline Jordan\n*Anne Kirker\n*Sandy Kirby (1948−2011)\n*Joan Kerr (1938–2004)\n*Helen McDonald\n*Kate MacNeill\n*Anne Marsh\n*Louise Mayhew\n*Margaret Mayhew\n*Nancy Mauro-Flude\n*Jacqueline Millner\n*Catriona Moore\n*Juliette Peers\n*Hetti Perkins\n*Caroline Phillips\n*Isobel Parker Philip\n*Melinda Rackham\n*Elvis Richardson\n*Ann Stephen\n*Nat Thomas\n*Helen Topliss\n*Anna Voigt\nSee also\n*Visual arts of Australia\n*Australian artist-run initiatives\n*Indigenous Australian art\n*List of Australian artists\n*Aotearoa New Zealand feminist art timeline\nReferences\nFurther reading\n*Annika Aitken, Dr Isobel Crombie, Megan Patty, Dr Maria Quirk and Myles Russell-Cook (eds), She Persists: Perspectives on Women in Art & Design (National Gallery of Victoria, Melbourne, 2020). ISBN 1925432769\n*Michelle Arrow and Angela Woollacott (eds), Everyday Revolutions: Remaking Gender, Sexuality and Culture in 1970s Australia, (Acton ACT, Australia, ANU Press, 2019) ISBN 9781760462963\n*Jenny Barber, ''Women's Movement South Australia, (Experimental Art Foundation: Adelaide, 1980)\n*Janine Burke, Field of Vision: A Decade of Change: Women's Art in the 1970s, (Viking: Victoria, 1990)\n*Barbara Caine, Australian Feminism: A Companion, (Oxford University Press: Melbourne, 1998) .\n*Jeanette Hoorn, Strange Women: Essays in Art and Gender, (Melbourne University Press: Melbourne, 1994)\n*Jane Kent (ed.), Setting the pace: the Women's Art Movement, 1980–1983'', (Women's Art Movement: Adelaide, 1984)\n*Joan Kerr(ed.), ''Heritage: The National Women's Art Book, 500 Works by 500 Australian Women Artists from Colonial times to 1955, (Craftsman House, Sydney 1995)\n*Joan Kerr & Jo Holder (eds) Past present: the national women's art anthology, (Craftsman House: Sydney, 1999)\n*Sandy Kirby, Sight lines: women's art and feminist perspectives in Australia, (Craftsman House, Sydney in association with Gordon and Breach, New York, 1992)\n*Catriona Moore, Indecent Exposures: Twenty Years of Feminist Photography in Australia,1970–1990 (Allen & Unwin: Sydney, 1993)\n*Anne Marsh Body and Self: Performance Art in Australia,1969–1992, (Oxford University Press: Australia, 1993)\n*Anne Marsh Difference: A Radical Approach to Women and Art'', (Women's Art Movement: Adelaide, 1985)\n*Catriona Moore (ed.), Dissonance: Feminism and the arts 1970–90, (Allen & Unwin: Sydney, 1994)\n*Helen Topliss, Modernism and feminism: Australian women artists, 1900–1940, (Craftsman House: Sydney, 1996)\n*Anna Voigt (ed.), New Visions, New Perspectives: Voice of Contemporary Australian Women Artists\nExternal links\n* [http://www.womensartregister.org/ Women's Art Register]\n* [http://www.womenaustralia.info/ The Australian Women's Register]\n* [http://countesses.blogspot.com.au/ Countess: women count in the artworld]"
    }
  ]
}