{
  "content": [
    {
      "type": "text",
      "text": "# Australia–New Zealand Maritime Treaty\n\n| location_signed     = Adelaide, South Australia, Australia\n| date_sealed         =\n| date_effective      = 25 January 2006\n| condition_effective =\n| date_expiration     =\n| signatories         =\n| parties             =\n*\n*\n| ratifiers           =\n| depositor           =  United Nations Secretariat\n| language            = English\n| languages           =\n| wikisource          =\n}}\nThe Australia–New Zealand Maritime Treaty is a 2004 treaty between Australia and New Zealand in which the two countries formally delimited the maritime boundary between the two countries.\nThe treaty was signed in Adelaide on 25 July 2004 by Minister for Foreign Affairs (Australia) Alexander Downer and Foreign Minister of New Zealand Phil Goff. It formalised the ocean borders that had been de facto recognised by both countries since the early 1980s, when the United Nations Convention on the Law of the Sea was created.\nThe treaty defines the boundaries between Australia and New Zealand's exclusive economic zones and continental shelf claims. Specifically, it defines two separate maritime boundaries, both of which are approximate median points between Australian and New Zealand territory. The two separate boundaries are not connected.\nThe first and more northern boundary separates the North Island and Three Kings Islands of New Zealand from Australia's Norfolk Island and Lord Howe Island. The northern boundary is composed of 27 individual straight-line segments defined by 28 separate coordinate points.\nThe second and more southern boundary defined by the treaty separates Australia's Macquarie Island from New Zealand's Auckland Island and Campbell Island. The southern boundary is composed of nine individual straight-line maritime segments defined by ten separate coordinate points.\nThe treaty came into effect on 25 January 2006 after it had been ratified by both countries. The full name of the treaty is Treaty between the Government of Australia and the Government of New Zealand establishing certain Exclusive Economic Zone and Continental Shelf Boundaries.\nNotes\nReferences\n* Charney, Jonathan I., David A. Colson, Robert W. Smith. (2005). International Maritime Boundaries, 5 vols. Hotei Publishing: Leiden. ; ; ; ; ; [https://www.worldcat.org/oclc/23254092  OCLC 23254092]\nExternal links\n*[https://www.un.org/Depts/los/doalos_publications/LOSBulletins/bulletinpdf/bulletin55e.pdf Full text of treaty (includes maps) (pp. 40–46)]\n*[http://www.linz.govt.nz/hydro/projects-programmes/continental-shelf/treaty/index.aspx New Zealand government information page on treaty]\n*[http://www.beehive.govt.nz/node/20427 New Zealand government press release on signing of treaty]"
    }
  ]
}