{
  "content": [
    {
      "type": "text",
      "text": "# Australian king parrot__disambig_1\n\n| genus = Alisterus\n| species = scapularis\n| authority = (Lichtenstein, MHC, 1816)\n| range_map = Alisterus scapularis range.png\n| range_map_caption = Australian king parrot range (red: all-year resident)\n| synonyms_ref =\n| synonyms =Psittacus cyanopygius Vieillot, 1818\nPsittacus scapulatus Kuhl, 1820\nPlatycercus coeruleus Lesson, 1829\nPlatycercus cyanopygus Finsch, 1868\n}}\nThe Australian king parrot (Alisterus scapularis) is a species of parrot endemic to eastern Australia ranging from Cooktown in Queensland to Port Campbell in Victoria. Found in humid and heavily forested upland regions of the eastern portion of the continent, including eucalyptus wooded areas in and directly adjacent to subtropical and temperate rainforest. They feed on fruits and seeds gathered from trees or on the ground.\nTaxonomy\nThe Australian king parrot was first described by the German naturalist Martin Lichtenstein in 1816 as Psittacus scapularis. The species belongs to the genus Alisterus, whose three members are also known as king parrots. The species are sometimes allied to the genus Aprosmictus.\nTwo subspecies are recognised, which are differentiated by size:\n*A. s. minor (Mathews, 1911)\n*A. s. scapularis (Lichtenstein, 1816)\nNaturally occurring hybrids with the red-winged parrot (Aprosmictus erythropterus) have been recorded from Bell in southeastern Queensland.\n\"Australian king parrot\" has been designated the official name by the International Ornithologists' Union (IOC).\nDescription\nAdults of both sexes are about 43&nbsp;cm (17&nbsp;in) in length, including the long, broad tail. The adult male has a red head, breast, and lower undersides, with a blue band on the back of the neck between the red above and green on the back, the wings are green and each has a pale green shoulder band, the tail is green, and the rump is blue. The male has a reddish-orange upper mandible with a black tip, a black lower mandible with an orange base, and yellow irises.  The plumage of the female is very different from the male having a green head and breast, a grey beak, and the pale shoulder band is small or absent. Juveniles of both sexes have brown irises and a yellowish beak, and otherwise resemble the female.\nThe two subspecies are A. s. minor, found at the northern limit of the species range and is similar in appearance to the nominate subspecies but smaller, typically about 5&nbsp;cm (2&nbsp;in) smaller in length.\nOn those rare individuals which have areas without melanin, feathers are orange to yellow. Such a bird can look startingly different from the more common scarlet and green variety.\nDistribution and habitat\nAustralian king parrots range from north and central Queensland to southern Victoria. They are frequently seen in small groups with various species of rosella. Further from their normal eastern upland habitat, they are also found in Canberra during winter, the outer western and northern suburbs of Sydney, and the Carnarvon Gorge in central Queensland.\nAviculture\nIn their native Australia, king parrots are occasionally bred in aviaries and kept as calm and relatively quiet household pets if hand-raised.\nAs pets, they have limited \"talking\" ability and normally prefer not to be handled, but they do bond readily to people and can be very devoted.\nThey tend to be selective in their choice of seeds that they eat, preferring black sunflower seeds and tend not to ingest small seeds found in pre-packaged retail bags.\nThey are relatively unknown outside Australia. Life expectancy in the wild is unknown, but some pets have been known to live up to 25 years.\nKing parrots are near the bottom of the pecking order. At a food source of seeds, the approximate order is as follows: cockatoo, rainbow lorikeet, magpie, corella, galah, king parrot, crimson rosella.\nGallery\nFile:King Parrot July09 06.jpg|Juvenile\nReferences\nFurther reading\n* Australian Parrots, by Forshaw, Joseph M., Illustrated by Cooper, William T., 2002, Third (revised) Edition, Alexander Editions,\n* Photographic Field Guide Birds of Australia (second edition); .\n* Field Guide to the Birds of Australia, 7th Edition, Simpson & Day.\nExternal links\n* [http://www.parrots.org/index.php/encyclopedia/profile/australian_king_parrot/ World Parrot Trust] Parrot Encyclopedia – Species Profile\n* [https://web.archive.org/web/20080608000517/http://www.kingparrot.net/ Australian King Parrot]\n* [https://web.archive.org/web/20141211033533/http://bie.ala.org.au/species/Australian+King-parrot Australian King Parrot - Atlas of Living Australia - species page]"
    }
  ]
}