{
  "content": [
    {
      "type": "text",
      "text": "# Australian rules football during the world wars__disambig_1\n\nAustralian rules football was heavily affected by both World War I and World War II. Hundreds of leading players served their country abroad, and many lost their lives. On the home front, competitions like the Victorian Football League (VFL) went ahead during these wars, but faced many restrictions.\nWorld War I\nThe Australian Training Units Team\nThe Third Australian Divisional Team\nIn March 1915, the VFL voted on whether or not to suspend the 1915 season, but voted in favour of playing by 13 votes to four. The season began on 24 April, the day before Australian troops landed at Gallipoli. Attendances were poor throughout the year.\nSt Kilda changed their club colours because their traditional red, white and black colours were the same as the German Empire. Their new colours of black, red and yellow were chosen as support to Australia's ally Belgium, where a group of St Kilda players were serving.\nThe 1916 season was heavily affected by the war. Only four clubs, Carlton, Collingwood, Fitzroy and Richmond, competed in the league. The other clubs withdrew from the competition, both out of Australian patriotism and as a result of player shortage. Despite finishing the home and away season in last place, Fitzroy won the Grand Final that year.\nBoth Geelong and South Melbourne returned to the league in 1917, while St Kilda and Essendon made their comeback in 1918. Melbourne spent the longest time out of the league, missing three seasons before rejoining the VFL in 1919.\nThe West Australian Football League (WAFL) continued to play throughout the war; however due to a lack of players and very poor on-field records North Fremantle and Midland Junction were forced to disband after the 1915 and 1917 seasons respectively. Neither was to return after the war, though attempts to revive Midland Junction were made in the 1920s.\nThe South Australian Football League (SAFL) suspended play in favour of a \"patriotic competition\" between 1916 and 1918.\n\"Pioneer Exhibition Game\" in London (1916)\nOn Saturday 28 October 1916, the former Olympic champion swimmer and the later Lord Mayor of Melbourne, Lieutenant Frank Beaurepaire, organized an Australian Rules football match between two teams of Australian servicemen in aid of the British and French Red Cross.\nThe match was promoted as a \"Pioneer Exhibition Game of Australian Football in London\". It was held at Queen's Club, West Kensington before an estimated crowd of 3,000, which included the (then) Prince of Wales (later King Edward VIII), and King Manuel II of Portugal.\nThe members of the competing teams, Australian Training Units and The Third Australian Divisional Team, were all highly skilled footballers, the majority of which had already played senior football in their respective states. A news film was taken at the match.\nOther matches\nPick up games of Australian Rules football were popular amongst the Australian soldiers in World War 1. Private Victor Laidlaw describes one such match between his 2nd Field Ambulance and the Light Horse in Cairo in January 1915:\n}}\nLieutenant Lionel Short gave a vivid and amusing account of another game played on a field pockmarked by shells. The game he wrote, was:\n}}\nDespite the difficulties of the game, Lieutenant Short ends with a poignant reminder of why these games were so important:\nTwo men wrote that they had organised soldiers from Port Melbourne to take on all challengers noting \"We hope to gain for the Port Melbourne Railway Union Football Club a name as renowned in France as the name is in Melbourne junior football circles\"\nWorld War II\nDomestic competitions\nCollingwood footballer and 1936 Stawell Gift winner, Flying Officer Ron McCann (left), and former Fitzroy captain, Leading Aircraftman Frank Curcio (right) listening to the 1944 VFL Grand Final while stationed in Dutch New Guinea.]]\nDisputes over whether football should be played in wartime came up again in World War II.\nThe VFL continued operation, but Geelong withdrew from the 1942 and 1943 VFL seasons when rail and road transport restrictions made it too difficult for supporters to attend games in Melbourne. Because the Melbourne Cricket Ground and the Lake Oval were taken over by the United States Air Force as bases, Melbourne and South Melbourne had to play their home games elsewhere, whilst the Junction Oval for two seasons and the Western Oval for 1942 were also commandeered.\nThe VFL's Brownlow Medal for the \"fairest and best\" player was not awarded for four seasons – 1942 to 1945.\nThe Western Australian National Football League restricted the competition to players under the age of 18 in 1942, and under 19 in 1943 and 1944; and the eight South Australian National Football League clubs temporarily merged into four combined clubs for a reduced competition between 1942 and 1944.\nIn 1940, both the SANFL and the VFL staged the first Australian football Lightning Carnivals as fundraising events. The carnivals featured every team in the league in a one-day knockout tournament, featuring shortened games. Several more of these carnivals were held by major and minor leagues as wartime fundraisers.\nLibya\nAustralian rules football also played a significant part in the Australian forces during the war, with the first Australian assault in Libya commencing with the signal of a football being kicked into no-man's land.\nPrisoners of war\nAustralian rules football was played by POWs throughout the Second World War, with competitions held in Singapore and Germany. The Changi Football League, played at Changi Prison, was held in 1942/43 and contested by teams called \"Melbourne\", \"Richmond\", \"Essendon\" and \"Carlton\". There was also a league set up at Stalag 383, near Nuremberg, contested by the \"Kangaroos\", \"Emus\", \"Kookaburras\" and \"Wallabies\".\nThe Changi Football League, run by Brownlow Medalist Wilfred Smallhorn, awarded its only \"Changi Brownlow\" medal for the best and fairest player to Peter Chitty, a former St Kilda footballer, which is on display at the Australian War Memorial. In 2024, it was reported in the Corryong Courier that the Australian Flag Society had discovered an Australian red ensign bearing the words \"Changi '41 '42\" and \"Chitty flag\", which may have flown over the game where Chitty won the Changi Brownlow. Also found were a leather football and whistle with the inscription \"Changi Football League\", along with a basketball bearing the words \"Changi Basketball League.\"\nVFL players who died in active service\nMany VFL players served in the armed services, and a number lost their lives, including Ron Barassi Sr., Bruce Sloss and Len Thomas.\nCommemorations\nSince 1995 a match between Collingwood and Essendon has taken place on Anzac Day at the Melbourne Cricket Ground as a tribute to those who died serving their country.\nOther games, including the Len Hall Game hosted by Fremantle at Subiaco Oval, and games in Wellington, New Zealand have also been held to commemorate past and present members of the armed forces.\nAll games held on the weekend closest to ANZAC Day have a small memorial ceremony, and the Last Post, a minutes silence, and, then, The Rouse played before the game.\nSee also\n* 1916 VFL season\n* 1916 Pioneer Exhibition Game\n* 1941 VFL season\nFootnotes\nReferences\n* [http://purl.slwa.wa.gov.au/slwa_b1874692_13.pdf?agree ''Pioneer Exhibition Game Australian Football: in aid of British and French Red Cross Societies: 3rd Australian Division v. Australian Training Units at Queen's Club, West Kensington, on Saturday, October 28th, 1916, at 3pm'', Wightman & Co., (London), 1919.]\n* Anon., \"Australian Football. Novel Match at Queen's Club\", The Times, Issue 41311, (Monday, 30 October 1916), p.&nbsp;11, column C.\n* Anon., \"News in Brief\", The Times, Issue 41309, (Friday, 27 October 1916), p.&nbsp;15, column B.\n* Atkinson, G. (1982) ''Everything you ever wanted to know about Australian rules football but couldn't be bothered asking'', The Five Mile Press: Melbourne. .\n* [http://nla.gov.au/nla.news-article154553906 Brosnan, G., \"Australian Football at Queen's Club, London; Exhibition Game by Anzacs Draws Large Crowd\", The (Melbourne) Winner, (Wednesday, 20 December 1916), p.7.]\n* Hogan P: The Tigers of Old, Richmond FC, (Melbourne), 1996.\n* Holmesby, R. & Main, J., This Football Century: \"The Greatest Game of All\", Wilkinson Books, (Melbourne), 1996.\n* Main, J. & Allen, D., Fallen – The Ultimate Heroes: Footballers Who Never Returned From War, Crown Content, (Melbourne), 2002.\n* Maplestone, M., Flying Higher: History of the Essendon Football Club 1872–1996, Essendon Football Club, (Melbourne), 1996.\n* [https://trove.nla.gov.au/newspaper/page/20729032 Minogue, D. & Millard, P.J., \"Famous A.I.F. Match in London\", The Sporting Globe, (Saturday, 21 August 1937), p.8.]\n* Ross, J. (ed), 100 Years of Australian Football 1897–1996: The Complete Story of the AFL, All the Big Stories, All the Great Pictures, All the Champions, Every AFL Season Reported, Viking, (Ringwood), 1996.\n* Shaw, I. (2006) The Bloodbath, Scribe, Melbourne. .\nExternal links\n* [http://www.abc.net.au/radionational/programs/sportsfactor/lest-we-forget---sport-and-war/3509520 Sport and War] ABC radio transcript (19 April 2002)\n*\n*\n* [http://boylesfootballphotos.net.au/tiki-read_article.php?articleId=22 1940 VFL Patriotic Cup – Melbourne] – BoylesFootballPhotos\n* [http://boylesfootballphotos.net.au/tiki-index.php?page=1942+Inter-Services+Competition 1942 Inter-Services Competition – Melbourne] – BoylesFootballPhotos\n* [http://boylesfootballphotos.net.au/tiki-index.php?page=1943+RAAF+Competition 1943 RAAF Competition – Melbourne] – BoylesFootballPhotos"
    }
  ]
}