{
  "content": [
    {
      "type": "text",
      "text": "# Australians missing in action in the Vietnam War__disambig_1\n\nAt the end of the Vietnam War, six Australians were among the 2,338 people then listed as missing in action. Four Australian Army soldiers and two Royal Australian Air Force (RAAF) were classified \"missing in action\" in four separate incidents with all six presumed to have been killed in action. Following the war, the remains of the servicemen were recovered and repatriated to Australia. As of 30 July 2009, no Australian servicemen remain missing in action from the Vietnam War.\nPersonnel listed as missing in action\n* Lance Corporal Richard Harold John (\"Tiny\") Parker (24) and Private Peter Raymond Gillson (20), were both regular army soldiers with A Company, 1st Battalion, Royal Australian Regiment attached to the US 173rd Airborne Brigade. On 8 November 1965, during fighting at Gang Toi as part of Operation Hump in Bien Hoa Province, both soldiers were observed by their comrades to be hit repeatedly by enemy machine-gun fire at close range. Despite attempts by other soldiers, their bodies could not be recovered, owing to heavy enemy fire which pinned down their company. The remains of Parker and Gillson were located in southern Vietnam in April 2007 and were repatriated to Australia in June that year.\n* Private David John Elkington Fisher (23), was a national serviceman serving with 3 Squadron, Special Air Service Regiment. On 27 September 1969, he was part of an SAS patrol which was contacted by several parties of Viet Cong in the Cam My district, about  northeast of the 1st Australian Task Force base at Nui Dat. During a \"hot extraction\" by an RAAF helicopter, Fisher fell about  into dense jungle from a rope attached to the helicopter. He was believed to have been killed and searches failed to recover his body. In August 2008, the Australian Defence Force reported that the possible location of Fisher's body had been identified. On 11 September 2008, the Australian Defence Force advised that the remains found as part of the investigation had been positively identified as Fisher and that preparations were underway to return the fallen soldier with full military honours. \"It is now known that Private Fisher died as a result of the fall and was hastily buried by enemy soldiers who discovered his body\", Defence Science and Personnel Minister Warren Snowdon stated.\n* Pilot Officer Robert Charles Carver (24) and Flying Officer Michael Patrick John Herbert (24), of No. 2 Squadron RAAF, were both career air force officers based at Phan Rang Air Base. On 3 November 1970, during a night bombing mission their Canberra bomber, serial no. A84-231, disappeared in the northern I Corps Tactical Zone region of South Vietnam after dropping its bombs near Da Nang. An extensive aerial search of the area failed to find any trace of the aircraft or crew and was called off after three days. On 21 April 2009, the Australian Defence Force reported they had located the wreckage of an RAAF Mk 20 Canberra bomber in thick jungle in an extremely rugged, remote and sparsely populated area of Quang Nam Province, Vietnam, near the Laotian border. The Australian Government announced on 30 July 2009 that the remains of the airmen were found in the wreckage of the crashed bomber and that they had been positively identified as belonging to Carver and Herbert. The two airmen were the last of the Australians listed as missing in action in Vietnam to be repatriated to Australia.\n* Lance Corporal John Francis Gillespie (24) was a helicopter medic with the 8th Field Ambulance. On 17 April 1971, Gillespie took part in a \"dustoff\" operation in the Long Hải Hills in Phuoc Tuy province to rescue a wounded South Vietnamese soldier. The RAAF UH-1H Iroquois helicopter (Serial No A2-767) from No. 9 Squadron RAAF he was a passenger in was hit by enemy ground fire and crashed. Gillespie was pinned under the burning wreckage and his body could not be recovered. Three other soldiers also died in the crash. In February 2004, remains believed to be those of Gillespie were located, and they were positively identified and repatriated to Australia on 22 December 2007.\nSee also\n*Military history of Australia during the Vietnam War\nReferences\nExternal links\n*[http://www.defence.gov.au/news/armynews/editions/1169/features/centre01.htm Australian Army Newspaper]\n*[http://www.thewest.com.au/default.aspx?MenuID=2&ContentID=97350 Fisher's remains found – The West]\n*[https://web.archive.org/web/20080828222542/http://austmia.com/TheSixCases.htm Operation Aussies Home]\n*[http://www.defence.gov.au/DefenceBlog/2009/0420_0426.htm Canberra bomber found – images]"
    }
  ]
}