{
  "content": [
    {
      "type": "text",
      "text": "# Australian War Memorial, London\n\nUnited Kingdom\n|nearest_town =\n|designer     =\n|inscription  =\n|established  =\n|unveiled     =\n|source       =\n}}\nThe Australian War Memorial in London is a memorial dedicated in 2003 to the 102,000 Australian dead of the First and Second World Wars. It is located on the southernmost corner of Hyde Park Corner, on the traffic island that also houses the Wellington Arch, the New Zealand War Memorial, the Machine Gun Corps Memorial and the Royal Artillery Memorial.\nDescription\nThe memorial comprises a semicircular curved wall of grey-green granite slabs from Western Australia (Verde Laguna granite from Jerramungup), cut in Australia before being shipped to London.  The granite stones are inscribed with the names of 23,844 towns in which the Australian soldiers were born, in Australia, the UK and elsewhere.  Parts of some town names are picked out in bolder type, creating the names of 47 battles in which Australia was involved in a larger font.   In summer months, water runs down over the names, intended to evoke \"memories of service, suffering and sacrifice\". The curved wall is set facing a downwards slope of grass, forming an amphitheatre.\nFour blocks bear the crest of Australia and the insignia of the three branches of the Australian armed services, and three other blocks bear dedicatory inscriptions: \"Whatever burden you are to carry we also will shoulder that burden (Robert Menzies, Prime Minister of Australia, 1941). //  Australia – United Kingdom //  1914 – 1918 // 1939 – 1945\".  Three seating blocks are placed in front of the wall.\nIt is under the care of the Commonwealth War Graves Commission.\nHistory\nThe proposal to create an Australian war memorial in London was announced in July 2000, during the centenary of the Australian Federation.  The memorial was designed for the Office of Australian War Graves at the Australian Department of Veterans' Affairs by [https://www.tzg.com.au Tonkin Zulaikha Greer Architects] and the artist Janet Laurence. It cost an estimated £3m, funded by the Australian Government.  It won the Australian Stone Architectural Award for Best International Project in 2006.\nThe work was commissioned at the beginning of 2003, and the memorial was unveiled on 11 November (Armistice Day) 2003, the 85th anniversary of the armistice to end the First World War, by Elizabeth II in her role as queen of Australia. In attendance was Prime Minister of the United Kingdom Tony Blair and the Australian Prime Minister John Howard. And also present were Simon Crean, Leader of the Opposition in Australia; Alexander Downer, Australian Foreign Minister; Danna Vale, Australian Minister for Veterans' Affairs; General Peter Cosgrove, Chief of the Australian Defence Force; the three principal chaplains for the Australian Army, Navy and Air Force; former UK Prime Minister Baroness Thatcher; and Geoff Hoon, UK Secretary of State for Defence.  Around 3,000 people were present at the ceremony, including 27 Australian veterans and it ended with a flypast of Jaguars from No. 54 Squadron RAF.\nA metal plaque from the memorial was stolen in May 2013, but recovered and replaced before 11 November 2013.\nSee also\n*List of Australian military memorials\n*New Zealand War Memorial, London, also at Hyde Park Corner\nFile:Australian War Memorial, London, detail 1.JPG|Detail of town names, forming in larger type the name of Gallipoli\nFile:Anzacday08-1-.JPG|Wreath laying in 2008\nFile:Australian_war_memorial,_London.JPG|\nCitations\nReferences\n* [http://www.awmlondon.gov.au/about-the-wall About the Wall], awmlondon.gov.au\n* [https://web.archive.org/web/20150312181607/http://anzacday.org.au/education/memorials/london.html Australian War Memorial, London], anzacday.org.au\n* [http://www.iwm.org.uk/memorials/item/memorial/52420 Australians WW1 And WW2], Imperial War Museum\n* [http://www.news.com.au/world/pplaque-stolen-from-an-australian-war-memorial-in-central-london-has-been-recovered-by-police/story-fndir2ev-1226719163083 Plaque stolen from an Australian War Memorial in central London has been recovered by police], news.com.au, 14 September 2013\n*\nExternal links\n*[http://www.awmlondon.gov.au/  Australian War Memorial website]"
    }
  ]
}