{
  "content": [
    {
      "type": "text",
      "text": "# Automotive hacking\n\nAutomotive hacking is the exploitation of vulnerabilities within the software, hardware, and communication systems of automobiles.\nOverview\nModern automobiles contain hundreds of on-board computers processing everything from vehicle controls to the infotainment system.  These computers, called Electronic control units (ECU), communicate with each other through multiple networks and communication protocols including the Controller Area Network (CAN) for vehicle component communication such as connections between engine and brake control; Local Interconnect Network (LIN) for cheaper vehicle component communication such as between door locks and interior lights; Media Oriented Systems Transport (MOST) for infotainment systems such as modern touchscreen and telematics connections; and  FlexRay for high-speed vehicle component communications such as active suspension and active cruise control data synchronization.\nAdditional consumer communication systems are also integrated into automobile architectures including Bluetooth for wireless device connections, 4G Internet hotspots, and vehicle Wi-Fi.\nThe integration of these various communications and software systems leaves automobiles vulnerable to attack. Security researchers have begun demonstrating the multitude of potential attack vectors in modern vehicles, and some real-world exploits have resulted in manufacturers issuing vehicle recalls and software updates to mobile applications.\nManufacturers, such as John Deere, have used computer systems and Digital Rights Management to prevent repairs by the vehicle owners, or by third parties, or the use of aftermarket parts.   Such limitations have prompted efforts to circumvent these systems, and increased interest in measures such as Motor Vehicle Owners' Right to Repair Act.\nResearch\nIn 2010, security researchers demonstrated how they could create physical effects and undermine system controls by hacking the ECU.  The researchers needed physical access to the ECU and were able to gain full control over any safety or automotive system including disabling the brakes and stopping the engine.\nIn a follow-up research paper published in 2011, researchers demonstrated that physical access is not even necessary.  The researchers showed that “remote exploitation is feasible via...mechanics tools, CD players, Bluetooth, cellular radio...and wireless communication channels allow long distance vehicle control, location tracking, in-cabin audio exfiltration and theft”.  This means that a hacker could gain access to a vehicle's vital control systems through almost anything that interfaces with the automobile's systems.\nRecent exploits\n2015 Fiat Chrysler UConnect Hack\nUConnect is Fiat Chrysler's Internet-connected feature which enables owners the ability to control the vehicle's infotainment/navigation system, sync media, and make phone calls.  It even integrates with the optional on-board WiFi.\nHowever, vulnerabilities in Fiat Chrysler's UConnect system, available on over 1.4 million cars, allows hackers to scan for cars with the system, connect and embed malicious code, and ultimately, commandeer vital vehicle controls like steering and brakes.\n2015 Tesla Model S Hack\nIn 2015 at the DEF CON hacking conference Marc Rogers and Kevin Mahaffey demonstrated  how a chain of exploits could be used to take complete control of the Model S. Marc Rogers and Kevin Mahaffey identified several remote and local vulnerabilities that could be used as entry points. They demonstrated that after exploitation the vehicle could be remotely controlled with an iPhone. Finally, they also demonstrated that it was possible to install a backdoor that allowed persistent access and control of the vehicle in a similar fashion to exploit techniques more usually associated with traditional computer systems. Marc Rogers and Kevin Mahaffey worked with Tesla, Inc. to resolve the issues before disclosure. It was announced before the presentation that the entire global fleet of Model S cars had been patched overnight, the first proactive mass Over The Air (OTA) security update of vulnerable vehicles.\nGeneral Motors OnStar RemoteLink App\nThe OnStar RemoteLink app allows users the ability to utilize OnStar capabilities from their Android or iOS smartphones.  The RemoteLink app can locate, lock and unlock, and even start your vehicle.\nThe flaw in General Motors’ OnStar RemoteLink app, while not as extreme as UConnect, allows hackers to impersonate the victim in the eyes of the RemoteLink app.  This means that the hackers can access all of the features of the RemoteLink app available to the victim including locating, locking and unlocking, and starting the engine.\nKeyless entry\nThe security researcher Samy Kamkar has demonstrated a device that intercepts signals from keyless-entry fobs and would allow an attacker to unlock doors and start a car's engine.\n\"USB\" entry\nKia back windows can be broken without setting off an alarm, and Hyundai are similar.\nSince 2021, on social media, videos show stealing of post-2010 Kia vehicles and post-2014 Hyundai vehicles, without engine immobilizers, with a USB 1.1 A plug cable, or pliers. Kia started installing immobilizers in 2022.\n2022 CAN injection: keyless car theft\nUsing a fake device sold on the dark web, thieves were able to steal vehicles by forcing the headlamps open and accessing the CAN bus, and then once on the bus, to simulate the signals to start the vehicle.  The exploit requires enough time and privacy for thieves to remove vehicle hardware, sometimes bumpers, in order to open the headlights.  Possibly the only way to prevent this kind of event by determined and knowledgeable thieves would be for car designers to encrypt traffic on the CAN bus.\n2024 Remotely control Kia cars through license plate\nOn June 11, 2024, a group of researchers led by Sam Curry discovered a vulnerability in Kia's web portal that allowed them to reassign control of the internet-connected features of any Kia vehicle manufactured after 2013. Although the vulnerability didn't permit the group to interact with the car's driving systems, they built a custom application to target this vulnerability that enabled them to scan any “connected” vehicle's license plate and track the car's location, unlock the car, honk its horn, or start its ignition—all on command. These kinds of vulnerabilities are not new and have occurred in cars built by other manufacturers such as Acura, Genesis, and others. While the web portal vulnerability for Kia was quickly patched, the same group of researchers found similar vulnerabilities in multiple other car manufacturers, including but not limited to Ferrari, BMW, Rolls Royce, Porsche, and Toyota.\nThe team exploited the Kia web portal vulnerability by leveraging API weaknesses in both the dealer and owner websites. They began by registering on the Kia Connect dealer website using a legitimate registration link sent to customers. By analyzing the back end API communication, they discovered that Kia's systems inadequately authenticated users in the dealer system. Using this knowledge, they manipulated HTTP requests, modifying headers and tokens to simulate authorized dealer credentials. With the dealer credentials and access token, they were able to find information related to a car's VIN by accessing the dealer API gateway endpoint, which is essentially an API for dealership functionality. The resulting HTTP response while using the token gave access to the vehicle owner's name, phone number, and email address.\nOnce gaining access to the personal information, the researchers escalated their access to the owner portal by replacing the email associated with a vehicle owner's account. This step added the attackers as secondary users without alerting the original owner, enabling control over the vehicle. They then sent commands such as unlocking doors, starting engines, or tracking vehicle locations by issuing properly formatted API calls. Due to the lack of notification systems, the researchers were able to do all of this without the owner of the vehicle ever knowing.\nSee also\n* Automotive security\nReferences"
    }
  ]
}