{
  "content": [
    {
      "type": "text",
      "text": "# Awards and decorations of the United States Department of the Army\n\nAwards and decorations of the United States Army are those military awards including decorations which are issued to members of the United States Army under the authority of the Secretary of the Army.  Together with military badges such awards provide an outward display of a service member's accomplishments.\nThe first recognized medals of the U.S. Army appeared during the American Civil War and were generally issued by local commanders on an unofficial basis.  The Medal of Honor was the first award to be established in regulations as a permanent Army decoration, complete with benefits.  The Medal of Honor is the only Civil War era award which has survived as a decoration into the modern age.\nFurthermore, the U.S. Army mandates that all unit awards will be worn separate from individual awards on the opposite side of a military uniform.  The Army is the only service to require this separation between unit and individual decorations.  All Army unit awards are worn enclosed in a gold frame.\nHistory\nThe Spanish–American War was the first widespread award of campaign medals, both for service in the actual conflict and for participation in subsequent garrison and occupation duty. After the Spanish–American War, however, medals in the U.S. Army fell into disuse and, apart from a few peacetime Medal of Honor decorations, two medals for service in Mexico, or on the border, during the period 1911–17, plus the Civil War Campaign Medal and the Indian Campaign Medal, both finally authorized in 1907, there were no further Army decorations created until the First World War.\nWorld War I saw the first widespread distribution of medals for combat, as the Medal of Honor returned awarded for bravery in battle against an enemy force. The Distinguished Service Cross was also created for those soldiers who had performed feats of bravery but not to the level required of the Medal of Honor. The only other medals of World War I were the World War I Victory Medal, accompanied by a confusing array of battle clasps to denote combat participation, and the very belated Army of Occupation of Germany Medal.\nIn the 1920s and 1930s, the U.S. Army issued very few decorations and it was often common for a service member to spend an entire career without receiving a single medal. As World War II loomed, however, an American Defense Service Medal was created for those on duty, and a Good Conduct Medal began to be issued to enlisted personnel. With the outbreak of the war, the Army began the largest expansion of medals since the Spanish–American War as well as the first wide scale issuance of inter-service awards and decorations. In addition, several World War II campaign medals were created for various theaters and a World War II Victory Medal was established at the end of the conflict as well as an occupation medal.\nIn the 1950s and 1960s, the Army expanded both its number of medals and ribbons, as well as having its service members eligible for several new inter-service campaign and service medals (such as the Armed Forces Expeditionary Medal and the National Defense Service Medal).\nIn the modern age, members of other military branches serving under an Army command are also eligible to receive Army decorations. All Army service members may receive inter-service awards and decorations, international decorations, and authorized foreign medals. The Department of the Army also awards a limited number of civilian awards.\nThe current active decorations of the United States Army as follows (the Medal of Honor, the highest military award, is not shown as it covers all of the military services):\nUnited States Army decorations\n{| class=\"wikitable\" style=\"margin:1em auto;\" align=\"center\"\n! width=\"20%\" style=\"background:#efefef;\" | Distinguished Service Cross\n! width=\"20%\" style=\"background:#efefef;\" | Distinguished Service Medal\n! width=\"20%\" style=\"background:#efefef;\" | Soldier's Medal\n! width=\"20%\" style=\"background:#efefef;\" | Army Commendation Medal\n! width=\"20%\" style=\"background:#efefef;\" | Army Achievement Medal\n|-\n|\n|\n|\n|\n|\n|-\n|\n|\n|\n|\n|\n|-\n|}\nGood Conduct Medals\n{|class=\"wikitable\" style=\"margin:1em auto;\" align=\"center\"\n! width=\"50%\" style=\"background:#efefef;\" |Army Good Conduct Medal\n! width=\"50%\" style=\"background:#efefef;\" |Army ReserveComponents Achievement Medal\n|-\n|\n|\n|-\n|\n|\n|}\nUnit Awards\n{|class=\"wikitable\" align=\"center\" width=\"100%\"\n! width=\"25%\" style=\"background:#efefef;\" |Presidential Unit Citation\n! width=\"25%\" style=\"background:#efefef;\" |Valorous Unit Award\n! width=\"25%\" style=\"background:#efefef;\" |Meritorious Unit Commendation\n! width=\"25%\" style=\"background:#efefef;\" |Army Superior Unit Award\n|-\n|\n|\n|\n|\n|-\n|}\nThe Joint Meritorious Unit Award is also a unit award for the US Army\nService Ribbons\n{|class=\"wikitable\" align=\"center\" width=\"100%\"\n! width=\"16.6%\" style=\"background:#efefef;\" |Army Sea Duty Ribbon\n! width=\"16.6%\" style=\"background:#efefef;\" |NCO Professional Development Ribbon\n! width=\"16.6%\" style=\"background:#efefef;\" |Army Service Ribbon\n! width=\"16.6%\" style=\"background:#efefef;\" |Army OverseasService Ribbon\n! width=\"16.6%\" style=\"background:#efefef;\" |Army Reserve ComponentsOverseas Training Ribbon\n! width=\"16.6%\" style=\"background:#efefef;\" |Army Recruiting Ribbon\n|-\n|\n|\n|\n|\n|\n|\n|-\n|}\nMarksmanship Competition Awards\n{|class=\"wikitable\" align=\"center\" width=\"100%\"\n! width=\"20%\" style=\"background:#efefef;\" |International Distinguished Shooter Badge\n! width=\"20%\" style=\"background:#efefef;\" |Army Distinguished Shooter Badges\n! width=\"20%\" style=\"background:#efefef;\" |President's Hundred Tab\n! width=\"20%\" style=\"background:#efefef;\" |Army Interservice Competition Badges\n|-\n|\n|\n|\n|\n|}\n{|class=\"wikitable\" style=\"margin:1em auto;\" align=\"center\" width=\"50%\"\n! width=\"20%\" style=\"background:#efefef;\" |Army Excellence-In-Competition Badges\n|-\n|\n|}\nOther awards\nIn order of precedence\n;Department of the Army Civilian Service Decorations\n*  Department of the Army Distinguished Civilian Service Award\n*  Secretary of the Army Award for Valor\n*  Superior Civilian Service Award\n*  Meritorious Civilian Service Award\n*  Department of the Army Civilian Service Commendation Medal\n*  Department of the Army Civilian Service Achievement Medal\n* Secretary of the Army's Award for Outstanding Achievement in Materiel Acquisition\n;Department of the Army Civilian Service Medals\n*  Civilian Award for Humanitarian Service\n*  Secretary of Defense Medal for the Global War on Terrorism\n*  Armed Forces Civilian Service Medal\n;Department of the Army Public Service Decorations\n*  Distinguished Public Service Medal\n*  Superior Public Service Medal\n*  Meritorious Public Service Medal\n*  Public Service Commendation Medal\n* Patriotic Public Service Lapel Button\n* Certificate of Appreciation for Patriotic Civilian Service\n;Awards of unique achievement\n* Brigadier General Jeremiah P. Holland Award – awarded to the most outstanding military police unit, company size or smaller, each fiscal year.\n* Secretary of the Army Awards for Program/Project Management\n* Zachary and Elizabeth Fisher Distinguished Civilian Humanitarian Award\n;Regimental association awards\n* The Order of Molly Pitcher – Air Defense Artillery\n* MG Horatio Gates Award – Adjutant General\n* The Order of Saint George, The Order of St. Joan D'Arc – Armor & Cavalry\n* The Order of Saint Michael – Aviation\n* The Order of Martin of Tours – Chaplain Corps\n* The Order of the Dragon – Chemical Corps\n* The Order of Thor – Cyber Corps\n* The  Order of De Fleury – Engineers\n* The Order of Saint Barbara – Field Artillery\n* The Order of Saint Maurice – Infantry\n* The Order of Military Medical Merit (O2M3)- Medical\n* Knowlton Award, The Order of the Spinx – Military Intelligence\n* The Order of the Marechaussee – Military Police\n* The Order of Samuel Sharpe – Ordnance Corps\n* MG Robert A. McClure Award – Psychological Operations\n* The Order of Saint Gabriel – Public Affairs\n* The Order of Saint Martin – Quartermaster Corps\n* The Order of Mercury – Signal Corps\n* The Order of Saint Philip Neri – Special Forces\n* The Order of Saint Christopher – Transportation Corps\n* The Order of Saint Dominic – Army Space Cadre\nSee also\n* Awards and decorations of the United States Armed Forces\n* List of military decorations\nReferences\n* [https://web.archive.org/web/20110322212501/http://www.dtic.mil/whs/directives/corres/pdf/134833vol3.pdf U.S. Department of Defense Awards Manual 1348.33, Vol. 3], dated 23 November 2010\n* [https://armypubs.army.mil/epubs/DR_pubs/DR_a/pdf/web/ARN18147_R600_8_22_admin2_FINAL.pdf U.S. Army Regulation 600-8-22, Military Awards], dated 5 March 2019"
    }
  ]
}