{
  "content": [
    {
      "type": "text",
      "text": "# Awards and decorations of the United States Department of the Air Force\n\nAwards and decorations of the United States Department of the Air Force are military decorations which are issued by the Department of the Air Force to airmen of the United States Air Force and guardians of the United States Space Force and members of other military branches serving under Air Force and Space Force commands.\nThe Department of the Air Force first began issuing awards and decorations in 1947. At that time, airmen were eligible to receive most U.S. Army decorations. In 1962, following the Cuban Missile Crisis, the Department of the Air Force began a concentrated effort to create its own distinctive awards, separate from the Army.\nAirmen and guardians are also eligible to receive approved foreign awards and approved international decorations.\nDepartment of the Air Force awards\nAir Force and Space Force decorations\n{| align=\"center\" border=\"1\"  cellpadding=\"1\"\n! width=\"16%\" style=\"background:#efefef;\" | Air Force Cross\n! width=\"16%\" style=\"background:#efefef;\" | Distinguished Service Medal\n! width=\"16%\" style=\"background:#efefef;\" | Airman's Medal\n! width=\"16%\" style=\"background:#efefef;\" | Aerial Achievement Medal\n! width=\"16%\" style=\"background:#efefef;\" | Air and Space Commendation Medal\n! width=\"16%\" style=\"background:#efefef;\" | Air and Space Achievement Medal\n|-\n|125px\n|125px\n|center\n|center\n|center\n|\n|-\n|center\n|center\n|center\n|center\n|center\n|\n|-\n|}\nAir Force and Space Force service medals\n{| align=\"center\" border=\"1\"  cellpadding=\"1\" width=\"48%\"\n! width=\"20%\" style=\"background:#efefef;\" | Combat Action Medal\n! width=\"20%\" style=\"background:#efefef;\" | Combat Readiness Medal\n! width=\"20%\" style=\"background:#efefef;\" | Remote Combat Effects Campaign Medal\n! width=\"20%\" style=\"background:#efefef;\" | Air and Space Campaign Medal\n! width=\"20%\" style=\"background:#efefef;\" | Nuclear Deterrence Operations Service Medal\n|-\n|\n|\n|\n|\n|\n|-\n|\n|\n|\n|\n|\n|-\n|}\nAir Force and Space Force Good Conduct Medals\n{| align=\"center\" border=\"1\"  cellpadding=\"1\"\n! style=\"background:#efefef;\" | Air Force Good Conduct Medal*\n! style=\"background:#efefef;\" | Space Force Good Conduct Medal**\n! style=\"background:#efefef;\" | Air Reserve ForcesMeritorious Service Medal*\n|-\n|\n|\n|\n|-\n|\n||\n|\n|-\n|}\nAir Force and Space Force unit awards\n{| align=\"center\" border=\"1\"  cellpadding=\"1\"\n! width=\"20%\" style=\"background:#efefef;\" | Presidential Unit Citation\n! width=\"20%\" style=\"background:#efefef;\" | Gallant Unit Citation\n! width=\"20%\" style=\"background:#efefef;\" | Meritorious Unit Award\n! width=\"20%\" style=\"background:#efefef;\" | Air and Space Outstanding Unit Award\n! width=\"20%\" style=\"background:#efefef;\" | Air and Space Organizational Excellence Award\n|-\n|\n|\n|\n|\n|\n|-\n|}\nAir Force and Space Force service ribbons\n{| align=\"center\" border=\"1\"  cellpadding=\"1\"\n! width=\"20%\" style=\"background:#efefef;\" | Outstanding Airman of the Year Ribbon*\n! width=\"20%\" style=\"background:#efefef;\" | Outstanding Guardian of the Year Ribbon**\n! width=\"20%\" style=\"background:#efefef;\" | Air and Space Recognition Ribbon\n! width=\"20%\" style=\"background:#efefef;\" | Air and Space Overseas Short Tour Service Ribbon\n! width=\"20%\" style=\"background:#efefef;\" | Air and Space Overseas Long Tour Service Ribbon\n|-\n|\n|\n|\n|\n|\n|}\n{| align=\"center\" border=\"1\"  cellpadding=\"1\"\n! width=\"25%\" style=\"background:#efefef;\" | Air and Space Expeditionary Service Ribbon with Gold Border\n! width=\"25%\" style=\"background:#efefef;\" | Air and Space Expeditionary Service Ribbon\n! width=\"25%\" style=\"background:#efefef;\" | Air and Space Longevity Service Award\n! width=\"25%\" style=\"background:#efefef;\" | Developmental Special Duty Ribbon\n|-\n|\n|\n|\n|\n|-\n! width=\"25%\" style=\"background:#efefef;\" | USAF NCO PME Graduate Ribbon\n! width=\"25%\" style=\"background:#efefef;\" | USAF Basic Military Training Honor Graduate Ribbon\n! width=\"25%\" style=\"background:#efefef;\" |Small Arms Expert Marksmanship Ribbon\n! width=\"25%\" style=\"background:#efefef;\" | Air and Space Training Ribbon\n|-\n|\n|\n|\n|\n|}\nAir Force and Space Force award badges\n{| align=\"center\" border=\"1\"  cellpadding=\"1\" width=\"30%\"\n! width=\"33%\" style=\"background:white;\" | U.S. Air Force Marksmanship Competition Awards/Badges\n! width=\"33%\" style=\"background:white;\" | President's Hundred Award/Tab\n! width=\"33%\" style=\"background:white;\" | U.S. Air Force Outstanding Airman Award/Badge\n|-\n|\n|\n|\n|}\nDepartment of the Air Force civilian decorations\n{| align=\"center\" border=\"1\"  cellpadding=\"1\"\n! width=\"14.3%\" style=\"background:#efefef;\" | Air Force Decoration for Exceptional Civilian Service\n! width=\"14.3%\" style=\"background:#efefef;\" | Air Force Outstanding Civilian Career Service Award\n! width=\"14.3%\" style=\"background:#efefef;\" | Air and Space Civilian Award for Valor\n! width=\"14.3%\" style=\"background:#efefef;\" | Air Force Meritorious Civilian Service Award\n! width=\"14.3%\" style=\"background:#efefef;\" | Air and Space Command Civilian Award for Valor\n! width=\"14.3%\" style=\"background:#efefef;\" | Air Force Exemplary Civilian Service Award\n! width=\"14.3%\" style=\"background:#efefef;\" | Air and Space Civilian Achievement Award\n|-\n|\n|\n|\n|\n|\n|\n|\n|-\n|\n|\n|\n|\n|\n|\n|\n|-\n|}\nMore information about civilian recognition can be found in 'DAFI 36-1004 Department of the Air Force Civilian Recognition Program (10 Dec 2023) and SPFGM 2024-36-01 United States Space Force (USSF) Civilian Recognition Program (4 Jan 2024).\n* Air Force Decoration for Exceptional Civilian Service. For exceptionally meritorious service of major significance to the Air Force in the performance of duties in a manner clearly exceptional to others. This award is the highest civilian recognition granted to an individual or group within the Air Force. Similar to the military Distinguished Service Medal. A gold-colored medal bearing the Air Force coat of arms with a wreath of laurel leaves. Ribbon is dark-blue silk with three dotted golden-orange lines in the center.\n* Air Force Outstanding Civilian Career Service Award. For outstanding career service meriting recognition at the time of retirement. Similar to the military Legion of Merit. Bronze medal bearing the Air Force coat of arms with a wreath of laurel leaves. Ribbon is white trimmed in maroon with three maroon stripes in the center.\n* Air Force Civilian Award for Valor'. For an act of heroism with voluntary risk of personal safety in the face of danger, either on or off the job. Similar to the Airman's Medal. Gold-colored medal design bearing the Air Force thunderbolt on an equilateral triangle surmounted by the Air Force eagle perched on a scroll inscribed \"Valor\" within an olive wreath. Ribbon is light blue with four yellow stripes, two dark blue stripes, and one red stripe in the center.\n* Air Force Meritorious Civilian Service Award. For outstanding service to the Air Force in the performance of duties in an exemplary manner. Similar to the military Meritorious Service Medal. Sterling silver medal and lapel emblem bearing the Air Force coat of arms with a wreath of laurel leaves. Lapel emblem with ruby indicates receipt of more than one Meritorious Civilian Service Award.\n* Air Force Command Civilian Award for Valor. For demonstrated unusual courage or competence in an emergency, either on or off duty, but beyond the call of duty that warrants special recognition but does not rise to the level of an Air Force Civilian Award for Valor. Similar to the military Meritorious Service Medal when awarded for heroism. Sterling silver medal of the same design as the Air Force Valor Award. Ribbon is light-blue silk with four yellow stripes and one red stripe in the center.\n* Air Force Exemplary Civilian Service Award. For clearly outstanding service supporting a command mission for at least one year for a single act that significantly contributed to command mission.   Similar to the military Commendation Medal.\n* Air Force Civilian Achievement Award: For clearly outstanding service for a single, specific act or accomplishment in support of the unit’s mission or goals. Similar to the military Achievement Medal.\nPublic service awards\n* Secretary of the Air Force Distinguished Public Service Award: For distinguished public service to the Air Force which translates into substantial contributions to the accomplishment of the Air Force mission. This is the highest public service award bestowed to private citizens by the Secretary of the Air Force.\n* Chief of Staff of the Air Force Award for Exceptional Public Service: For Sustained unselfish dedication, contributions, and exceptional support to the Air Force.\n* Air Force Exceptional Service Award: For exceptional service to the United States Air Force or for an act of heroism involving voluntary risk of life.\n* Air Force Scroll of Appreciation: For meritorious achievement or service that are completely voluntary and performed as a public service or patriotic in nature.\n* '''Air Force Commander's Award for Public Service''': For service or achievements which contribute significantly to the accomplishment of the mission of an Air Force activity, command, or staff agency.\nSpecial awards and trophies\nIn 2018, as part of the Air Force's initiative to reduced directive publications, the eight-page AFI 36-2805 was released, superseding 30 previous AFIs.  Guidance for special awards was moved to a website at https://access.afpc.af.mil/.\n* Cheney Award (an act of valor, extreme fortitude or self-sacrifice in a humanitarian interest, performed in connection with aircraft)\n* Mackay Trophy (most meritorious flight of the year)\n* Outstanding Airmen of the Year (sponsored by Air Force Association)\n* Lance P. Sijan USAF Leadership Award\n* Lt Gen Claire Lee Chennault Award (top fighter pilot)\n* USAF First Sergeant of the Year Award\n* General and Mrs. Jerome F. O'Malley Award (wing commander and spouse team)\n* Joan Orr Air Force Spouse of the Year Award\n* Koren Kolligian Jr. Trophy (safety)\n* General Thomas D. White Space Award, formerly USAF Space Trophy (outstanding contribution to progress in aerospace)\n* General Wilbur L. Creech Maintenance Excellence Award\n* Dr. James G. Roche Sustainment Excellence Award\n* General Robert T. Herres Award (outstanding AFSPC Wing with a space mission)\n* Lieutenant General Leo Marquez Award (maintenance excellence)\n* General Lew Allen, Jr. Trophy (officer and senior NCO in aircraft maintenance or munitions directly involved with setting up aircraft sorties with nuclear weapons)\n* General Curtis E. LeMay Award (large installation Force Support Squadron)\n* Major General Eugene L. Eubank Award (small installation Force Support Squadron)\n* John L. Hennessy Trophy Awards (excellence in food service operations)\n* Brigadier General Sarah P. Wells Award (Air Force Medical Service)\n* Aviator Valor Award (sponsored by American Legion Aviators' Post No. 743)\n* General John P. Jumper Awards for Excellence in Warfighting Integration\n* Information Dominance/Cyberspace Awards:\n** Lieutenant General Harold W. Grant Award (small communications unit)\n** Major General Harold M. McClelland Award (large communications unit)\n** General Edwin W. Rawlings Award (team of the year)\nNotes\n* * = Awarded only to Airmen\n* ** = Awarded only to Guardians\n*No asterisk indicates that the decoration is awarded to both services\nSee also\n* Awards and decorations of the United States military\n* Awards and decorations of the United States government\n* Awards and decorations of the US Air Force Auxiliary\nCitations\nExternal links\n* [http://static.e-publishing.af.mil/production/1/af_a1/publication/afi36-2903/afi36-2903.pdf AFI36-2903]  Dress and Personal Appearance of Air Force Personnel\n* [https://web.archive.org/web/20140112012631/http://static.e-publishing.af.mil/production/1/af_a1/publication/afi36-2805/afi36-2805.pdf AFI36-2805], Special Awards and Trophies\n* [https://web.archive.org/web/20140112014712/http://static.e-publishing.af.mil/production/1/af_a1/publication/afi36-2818/afi36-2818.pdf AFI36-2818], The USAF Maintenance Awards Program"
    }
  ]
}