{
  "content": [
    {
      "type": "text",
      "text": "# Aware Girls\n\n| footnotes =\n}}\nAware Girls is a non-governmental organization in Peshawar, Khyber Pakhtunkhwa, Pakistan. Established in 2002, it aims to address violence and discrimination against women and young girls in Pakistan. Their mission is to advocate for women's rights, education, and access to sexual and reproductive health resources. They state their objective as \"to strengthen the leadership capacity of young women enabling them to act as agents of social change and women empowerment in their communities.\"\nGulalai Ismail, a human rights activist based in Peshawar, served as the chairperson of Aware Girls. In 2018, the Pakistani government shut down Aware Girls after Gulalai became associated with the Pashtun Tahafuz Movement (PTM), a social movement advocating for Pashtun human rights.\nFormation\nAware Girls was formed in Peshawar in 2002 by sisters Gulalai Ismail and Saba Ismail, at the time aged 16 and 15 respectively.\nThey began by campaigning in the Khyber Pakhtunkhwa area against gender based violence such as honour killings and acid attacks and then by educating girls and women about their human rights, giving them negotiating skills to use within their families and empowering them to become leaders and educate others in their own local communities.\nSaba Ismail explained the catalyst for the organisation's formation was experiencing gender inequality while growing up in Swabi and an incident when a girl cousin who had wanted to study and become a pilot was, age 12, made to marry a man 15 years her senior and discontinue her education. Sana was already active in promoting women's right to education and healthcare while in college and Jahangir met the others at a seminar about violence against women and was a co-founder of an organisation called the Child Rights Advocates Forum.\nCampaigns\nIn addition to empowering young women at home and in their communities, Aware Girls also aims to educate young people against extremism with peaceful resistance to the Taliban by educating peers against radicalisation and to encourage more women into positions of political influence. This is done through their Youth Peace Network outreach work including workshops and seminars, creating local youth groups and using peer to peer education and support to reach at-risk young people in rural areas.\nMalala Yousafzai was an attendee of Aware Girls training in 2011 and in 2016 the Malala Fund, with financial sponsorship from the Bill and Melinda Gates Foundation set up the Gulmakai Network to support local organisations such as Aware Girls who campaign and work on the front line of education for girls and who aim to influence policy change, making Gulalai Ismail one of the Gulmakai Champions.\nAware Girls also runs a programme of HIV prevention amongst women in Pakistan which aims to educate women about sexual health, the transmission and treatment of HIV as well as reducing the stigma of living with a diagnosis. This programme is sponsored by the MTV Staying Alive initiative.\nAware Girls also conducts research, provides support and counselling and advocates for policy change for women in Pakistan affected by trauma as a result of terrorism and violence. Saba Ismail's research has revealed that women are disproportionately affected by the economic problems associated with terrorism and by the increase in domestic violence associated with family psychological problems. She said in 2015, \"Terrorism has destroyed houses, properties, businesses and livelihoods. Children are frightened and weep. Women have lost hope.\"\nAware Girls also runs a referral helpline for victims of domestic gender based violence. The Marastyal helpline connects women with providers of emotional support, legal advice and emergency medical treatment.\nAwards\nIn 2014 Aware Girls received the Global Rising Star award from the Star Foundation.\nOn November 24, 2016, Aware Girls was the recipient of the Fondation Chirac Peace Prize for its contribution to the prevention of conflict in Pakistan which was presented by the then French president Francois Hollande.\nIn her capacity as the chairperson of Aware Girls, Gulalai Ismail has won several awards including International Humanist of the Year Award, given by the International Humanist and Ethical Union at the World Humanist Congress, the Commonwealth Youth Award (2015), the 2013 Democracy Award from National Endowment for Democracy and was joint winner, with murdered journalist and activist Gauri Lankesh, of the Anna Politkovskaya Award, Reach All Women in WAR (RAW in WAR) award for campaigning against religious extremism.\nGulalai and Saba Ismail were also featured in Foreign Policy's 100 Leading Global Thinkers of 2013 for empowering girls in Pakistan.\nCriticism\nAware Girls is being criticised in Khyber Pakhtunkhwa for violating cultural norms and making people liberated from culture and religion which directly impact the society's sentiment. Gulalai's video went viral when she was explaining rural girls about how they feel awkward and discomfort for putting chail -shawl used widely in Swabi which is considered as symbol of modesty and resistance historically.\nSponsors and affiliations\nAware Girls has received funding from several organisations and among them lists the following as partners and/or donors:\n* MTV Staying Alive, HIV/AIDS education and prevention\n* The Global Fund for Children,  venture philanthropy group based in Washington which provides capital to grassroots organisations helping deprived children\n* Urgent Action Fund financial sponsor based in San Francisco\n* Peace Direct, a British charity working in conflict areas with grassroots organisations promoting peace\n* NCCR (NGOs Coalition on Child Rights), an organisation which implements the United Nations Convention on the Rights of the Child\nAware Girls is a member of numerous national and international organisations including:\n* All Pakistan Women's Association\n* Association for Women's Rights in Development\n* Friends of AASHA (Alliance Against Sexual Harassment)\n* Humanists International\n* International Association for Impact Assessment\n* Young Humanists International\n* Women's Global Network for Reproductive Rights\nSee also\n* Aurat Foundation\n* Blue Veins (Pakistan)\n* Fareeda Kokikhel Afridi\n* Women Media Center\nReferences\nExternal links\n*\n* [http://www.awaregirls.org/portfolio/marastyal-helpline/ Marastyal helpline]\n* [https://www.peacedirect.org/woman-battling-violent-extremism-hear-story-gulalai-ismail/ Gulalai Ismail's TedX talk on combatting extremism]"
    }
  ]
}