{
  "content": [
    {
      "type": "text",
      "text": "# Awards of the British Academy\n\nThe British Academy presents 18 awards and medals to recognise achievement in the humanities and social sciences.\nOverview\nThe British Academy currently awards 18 prizes and medals:\nGeneral awards:\n* British Academy Medal (for academic research that has \"transformed understanding\" of a field of the humanities or social sciences)\n* The President's Medal (for \"outstanding service\" to the humanities or social sciences)\n* Leverhulme Medal and Prize (for \"significant contribution to knowledge or understanding\" in a field of the humanities or social sciences)\nDiscipline-specific awards:\n* Brian Barry Prize in Political Science\n* Burkitt Medal for Biblical Studies\n* Derek Allen Prize (for numismatics, Celtic studies or musicology)\n* Edward Ullendorff Medal (for Semitic languages and Ethiopian studies)\n* Grahame Clark Medal (for prehistoric archaeology)\n* Kenyon Medal (for classical studies and archaeology)\n* Landscape Archaeology Medal\n* British Academy Book Prize for Global Cultural Understanding\n* Neil and Saras Smith Medal for Linguistics\n* Peter Townsend Prize (for the sociology of poverty, ageing or health)\n* Rose Mary Crawshay Prize (for English literature scholarship; women only)\n* Serena Medal (for Italian studies)\n* Sir Israel Gollancz Prize (for English literature scholarship)\n* Wiley Prize in Economics\n* Wiley Prize in Psychology\nPrizes and medals\nBrian Barry Prize in Political Science\nThe Brian Barry Prize in Political Science is awarded jointly by the British Academy, the Cambridge University Press, and the British Journal of Political Science. It was named in honour of Brian Barry and first awarded in 2014. It is awarded annually to an individual or group \"for excellence in political science, as displayed in an unpublished essay\". The prize is £2500 and the winning essay is published in the British Journal of Political Science.\nList of Recipients:\n* 2014: Helder De Schutter and Dr Lea Ypi, for 'Mandatory Citizenship for Immigrants'\n* 2015: Parashar Kulkarni, for 'Are There Cultural Prerequisites to Effective Property Rights?: Evidence from Inheritance Rights of Widows in Colonial India'\n* 2016: William Roberts Clark, Professor Matt Golder, and Professor Sona N. Golder, for 'An Exit, Voice, and Loyalty Model of Politics'\n* 2017: Jonathan White, for 'The Ethics of Political Alliance'\n* 2018: Zeynep Pamuk, of St John's College, Oxford, for 'Justifying Public Funding for Science.\n* 2019: Andre Santos Campos, for 'Representing the Future: The Interests of Future Persons in Representative Democracy'\n* 2020: Jonathan Havercroft, for 'Why is there no just riot theory?'\nBritish Academy Medal\nThe British Academy Medal was established in 2013. It is awarded annually \"for academic research that has transformed understanding in a field of the humanities and social sciences\".\nBurkitt Medal\nThe Burkitt Medal for Biblical Studies was established in 1923. It is awarded annually \"in recognition of special service to Biblical Studies\", with the area of study alternating between the Hebrew Bible and the New Testament.\nDerek Allen Prize\nThe Derek Allen Prize was founded in 1976 to honour Derek Allen, FBA, who was secretary (1969–73) and treasurer (1973–75) of the British Academy; it was established by his widow and sons to recognise outstanding scholarly achievement in Allen's principal interests: numismatics, Celtic studies and musicology. Although awarded annually, the prize rotates between the three disciplines. Recipients are awarded £400.\nEdward Ullendorff Medal\nThe Edward Ullendorff Medal was created in 2012 to honour Professor Edward Ullendorff, FBA, who had died the previously year; its establishment was supported by his widow. Award annually, the medal recognizes \"scholarly distinction and achievements in the field of Semitic Languages and Ethiopian Studies\".\nList of recipients:\n* 2012: Simon Hopkins, FBA, Hebrew University, Jerusalem.\n* 2013: Getatchew Haile, FBA, Hill Museum & Manuscript Library of Saint John's University, USA.\n* 2014: David Appleyard, School of African and Oriental Studies.\n* 2015: Siegbert Uhlig, University of Hamburg.\n* 2016: Sebastian Brock, FBA, University of Oxford.\n* 2017: Veronika Six, University of Hamburg.\n* 2018: John Huehnergard, The University of Texas at Austin\n* 2019: Michael Knibb, King's College London\n* 2020: Otto Jastrow, \"for his leading scholarship in the field of Arabic and Neo-Aramaic spoken dialects\"\n* 2021: Olga Kapeliuk\n* 2022: Werner Diem, Cologne University\n* 2023: Mauro Tosco, University of Turin\n* 2024: Sebastian Brock, University of Oxford\nGrahame Clark Medal\nThe Grahame Clark Medal endowed in 1992 by Sir Grahame Clark and first awarded in 1993. It is awarded every two years \"for academic achievement involving recent contributions to the study of prehistoric archaeology\".\nKenyon Medal\nThe Kenyon Medal was endowed by Sir Frederic Kenyon and awarded for the first time in 1957. It is awarded every two years \"in recognition of work in the fields of classical studies and archaeology\".\nLandscape Archaeology Medal\nThe Landscape Archaeology Medal is awarded every two years \"for distinguished achievements in landscape archaeology\". It was first awarded in 2007.\nList of Recipients:\n* 2007: Andrew Fleming\n* 2009: Tony Wilkinson\n* 2011: Conor Newman\n* 2013: Christopher Taylor\n* 2015: David Hall\n* 2017: Tom Williamson, \"for his significant contribution to the study of landscape history and archaeology\"\n* 2019: Dominic Powlesland\n* 2020: Keith Branigan, \"for his distinguished and varied career with many notable achievements in the study of Roman Britain and the prehistory of the Aegean\"\n* 2022: Charly French\n* 2023: Carenza Lewis\n* 2005: Sarah Semple\nLeverhulme Medal and Prize\nThe Leverhulme Medal and Prize was created 2002 and is sponsored by The Leverhulme Trust. It is awarded every three years \"for significant contribution to knowledge and understanding in a field within the humanities and social sciences\". It is worth £5000.\nBritish Academy Book Prize for Global Cultural Understanding\nThe British Academy Book Prize (formerly the Nayef Al-Rodhan Prize for Global Cultural Understanding) was established by Nayef Al-Rodhan in 2013. It is awarded annually for \"outstanding scholarly contributions to global cultural understanding\". It is worth £25,000.\nNeil and Saras Smith Medal for Linguistics\nThe Neil and Saras Smith Medal for Linguistics is awarded annually to an individual for \"lifetime achievement in the scholarly study of linguistics\". It was established by Neil Smith in 2013, and first awarded in 2014.\nList of Recipients:\n* 2014: Noam Chomsky FBA (MIT)\n* 2015: William Labov (University of Pennsylvania), \"for his significant contribution to linguistics and the language sciences\"\n* 2016: Sir John Lyons FBA (Trinity Hall, Cambridge), \"for his outstanding lifetime contribution to the field of linguistics\"\n* 2017: Bernard Comrie FBA (University of California, Santa Barbara), \"for his significant contributions to the study of language universals, linguistic typology and language history\"\n* 2018: Barbara Partee FBA (University of Massachusetts Amherst), for \"her leading contributions to the study of semantics, syntax and pragmatics\".\n* 2019: Deirdre Wilson FBA (University College London)\n* 2020: Paul Kiparsky FBA (Stanford University), for \"his research on phonology and historical linguistics\".\n* 2021: Marianne Mithun (University of California, Santa Barbara)\n* 2022: Sheila Blumstein (Brown University)\n* 2023: Eva Hajičová (Charles University, Prague)\n* 2024: Paula Fikkert (Radboud University Nijmegen), for \"her research into phonological change over time, both in language acquisition (first and second) and historical change\".\n* 2025: Nicholas Evans (linguist) (Australian National University), for \"for his long and distinguished career working on endangered languages, both documenting hitherto undescribed languages and exploring the consequences of such data for general linguistic theory\".\nPeter Townsend Prize\nThe Peter Townsend Prize was created in 2011 to honour the sociologist Professor Peter Townsend, FBA, who had died in 2009. The prize is awarded biennially to recognise \"outstanding work with policy relevance on a topic to which Townsend made a major contribution.\" Nominations are made for \"a published work with policy relevance and academic merit on poverty and inequality; ageing and the lives of older people; disability and inequalities in health.\" The prize is awarded with £2,000.\nList of recipients:\n* 2011: Julia Johnson, Sheena Rolph and Randall Smith for ''Residential Care Transformed: Revisiting 'The Last Refuge'\n* 2013: Tracy Shildrick, Professor Robert MacDonald, Colin Webster and Kayleigh Garthwaite for Poverty and Insecurity: Life in Low-Pay, No-Pay Britain\n* 2015: Andrew Sayer for Why We Can't Afford the Rich\n* 2017: Kayleigh Garthwaite for Hunger Pains: Life Inside Foodbank Britain\n* 2019: Steven King for Writing the Lives of the English Poor 1750s-1830s\n* 2021: John Stewart for Richard Titmuss: A Commitment to Welfare''\nPresident's Medal\nThe '''President's Medal is awarded annually by the British Academy to up to five individuals or organisations for \"outstanding service to the cause of the humanities and social sciences\". It was first award in 2010.\nRose Mary Crawshay Prize\nThe Rose Mary Crawshay Prize was created in 1888 as The Byron, Shelley, Keats In Memoriam Yearly Prize Fund by Rose Mary Crawshay (1828–1907). In 1914, the fund was transferred to the British Academy. The newly renamed Rose Mary Crawshay Prize was first awarded in 1916. It is awarded annually \"for a historical or critical work on any subject connected with English Literature by a woman of any nationality\" and is worth £500.\nSerena Medal\nThe Serena Medal' was established in 1920 and is awarded annually for \"eminent services towards the furtherance of the study of Italian history, philosophy or music, literature, art, or economics.\"\nList of recipients:\n* 1920 G. M. Trevelyan\n* 1921 Paget Toynbee\n* 1922 E. G. Gardner\n* 1923 Horatio Brown\n* 1924 Edward Hutton\n* 1925 No award\n* 1926 Edward Armstrong\n* 1927 Benedetto Croce\n* 1928 Giovanni Gentile\n* 1929 No award\n* 1930 Ettore Modigliani\n* 1931 Countess Martinego-Cesaresco\n* 1932 Cesare Foligno\n* 1933 Thomas Okey\n* 1934 Rennell Rodd, 1st Baron Rennell\n* 1935 Mario Praz\n* 1936 No award\n* 1937 Gaetano De Sanctis\n* 1938 Eugénie Sellers Strong\n* 1939 No award\n* 1940 Evelyn Jamison\n* 1941 G. F.-H. Berkeley\n* 1942 Gaetano Salvemini\n* 1943 Bernard Berenson\n* 1944–45 No award\n* 1946 Giovanni Poggi\n* 1947 No award\n* 1948 Sir George Hill\n* 1949 No award\n* 1950 Etienne Gilson\n* 1951 Giuseppe Lugli\n* 1952 No award\n* 1953 Carlo Dionisotti\n* 1954 Frederico Chabod\n* 1955 Kenneth Clark\n* 1956 Umberto Zanotti Bianco\n* 1957 Rudolf Wittkower\n* 1958 Paul Oskar Kristeller\n* 1959 Bruno Nardi\n* 1960 Denis Mack Smith\n* 1961 Sir John Pope-Hennessy\n* 1962 J. B. Ward-Perkins\n* 1963 Johannes Wilde\n* 1964 No award\n* 1965 Axel Boethius\n* 1966 Paola Zancani\n* 1967 Edgar Wind\n* 1968 Ludwig Heydenreich\n* 1969 Roberto Weiss\n* 1970 R. Longhi\n* 1971 R. Bianchi Bandinelli\n* 1972 J. Denis Mahon\n* 1973 E. R. Vincent\n* 1974 N. Rubinstein\n* 1975 Eugenio Garin\n* 1976 Cecil Grayson\n* 1977 Augusto Campana\n* 1978 Wolfgang Lotz\n* 1979 John Shearman\n* 1980 Massimo Pallottino\n* 1981 Giulio Einaudi\n* 1982 Paola Barocchi\n* 1983 Franco Venturi\n* 1984 J. H. Whitfield\n* 1985 Francis Haskell\n* 1986 Sir John Hale\n* 1987 Christopher Seton-Watson\n* 1988 Philip Jones\n* 1989 Sir Harold Acton\n* 1990 Daniel Waley\n* 1991 Brian Pullan, FBA\n* 1992 J. I. R. Montagu\n* 1993 George Holmes\n* 1994 Patrick Boyde, FBA\n* 1995 Hugh Honour\n* 1996 Giovanni Aquilecchia\n* 1997 Michael Mallett\n* 1998 J. A. Davis\n* 1999 Michael Talbot\n* 2000 Giulio Lepschy, FBA\n* 2001 Michael Hirst, FBA\n* 2002 John Woodhouse\n* 2003 Stuart Woolf\n* 2004 William Weaver\n* 2005 Ronald Lightbown\n* 2006 Paul Ginsborg\n* 2007 Conor Fahy\n* 2008 Philip Gossett\n* 2009 Giorgio Chittolinin\n* 2010 Anna Laura Lepschy\n* 2011 Patricia Fortini Brown\n* 2012 Richard Bellamy\n* 2013 Pier Vincenzo Mengaldo\n* 2014 Chris Wickham, FBA\n* 2015 Brian A'Hearn\n* 2016 Geoffrey Nowell-Smith\n* 2017 Martin McLaughlin\n* 2018 Roger Parker, FBA\n* 2019 John Foot\n* 2020 Jill Kraye\n* 2021 Lucrezia Reichlin, FBA\nSir Israel Gollancz Prize\nThe Sir Israel Gollancz Prize was created in 1924 as the Biennial Prize for English Literature. The name was changed to honour Israel Gollancz after his death in 1930. It is \"awarded biennially for work connected with Anglo-Saxon, Early English Language and Literature, English Philology, or the History of English Language\". It is worth £400.\nWiley Prize in Economics\nThe Wiley Prize in Economics was established in 2013 and is sponsored by the publisher Wiley; awarded annually, it recognises \"achievement in research by an outstanding early career economist.\" The recipient is awarded £5,000.\nList of recipients\n* 2013: Philipp Kircher, University of Edinburgh\n* 2014: Vasco Carvalho, University of Cambridge\n* 2015: Johannes Spinnewijn, London School of Economics and Political Science\n* 2016: James Fenske, University of Warwick\n* 2017: Matthew Elliott, University of Cambridge\n* 2018: Mirko Draca, University of Warwick\nWiley Prize in Psychology\nThe Wiley Prize in Psychology was established in 2009 and is made in partnership with the publisher Wiley; awarded annually, it recognises \"lifetime achievement by an outstanding international scholar and promising early-career work by a UK-based psychologist, within 5 years of receipt of their doctorate.\" The award is given out to the former in odd years and the latter in even years. The recipient is awarded £5,000.\nList of recipients\n* 2009: Martin Seligman, University of Pennsylvania, Philadelphia\n* 2010: Essi Viding, University College London\n* 2011: Michael Tomasello, Wolfgang Köhler Primate Research Center, Leipzig\n* 2012: Yulia Kovas, Goldsmiths, University of London\n* 2013: Anne Treisman, FBA FRS, Princeton University\n* 2014: Richard Cook, City University London\n* 2015: Peter Fonagy, FBA, University College London\n* 2016: Stephen Fleming, University College London\n* 2017: Stanislas Dehaene, FBA, INSERM-CEA Cognitive Neuroimaging Unit\n* 2018: Sarah Lloyd-Fox, Birkbeck, University of London; University of Cambridge\nSee also\n* List of general awards in the humanities\n* List of social sciences awards\nReferences"
    }
  ]
}