{
  "content": [
    {
      "type": "text",
      "text": "# Awards and decorations of the Texas Military\n\nis the highest decoration of the Texas Military]]\nAwards and decorations of the Texas Military are medals, ribbons, badges, tabs, trophies, plaques, certificates, memorials, monuments, holidays, and general honors that recognize service and achievement in the Texas Military Forces.\nRegulation\nThe Texas Military Department medal and ribbon awards are governed by the Texas Government Code (Chapter 437, Subchapter H) and Joint Force Texas Regulation (1-07). Because Texas Military Forces existence is authorized under Title 32 of the United States Code, wear and precedence of medals and ribbons on the service uniform and duty uniform is governed by the United States Department of the Army Pamphlet regulation 670-1.\nBecause Texas National Guard service members are also subject to Title 10 of the United States Code, they are also authorized to wear and eligible to earn awards, decorations, and badges of the United States National Guard and United States Armed Forces.\nTexas State Guard service members who previously earned awards, decorations, and badges of the United States National Guard and United States Armed Forces are authorized to wear them.\nOrder of precedence\nBecause Texas Military Forces existence is authorized under Title 32 of the United States Code, precedence of medals and ribbons on the service uniform and duty uniform is governed by the Department of Defense Instruction 1348.33 and United States Department of the Army Pamphlet regulation 670-1.\nLike the United States Armed Forces, Texas Military medals and ribbons are distinctly categorized by general service and achievement awards, and distinguished service and achievement decorations, which is reflected in the order of precedence.\nGeneral order of precedence:\n# United States Armed Forces personal decorations\n# United States Armed Forces unit awards\n# United States Non-Military (personal) Decorations, to include certain Military Society Decorations and Medals, as outlined in DOD Instr. 1348.33 section 11 (c)(2019), and as defined by 10USC§&nbsp;1123, Right to Wear Badges of Military Societies, but only those to wit: 'a society originally composed of men who served in an armed force of the United States during the Revolutionary War, the War of 1812, the Mexican War, the Civil War, the Spanish–American War, the Philippine–American War, or the Chinese Relief Expedition of 1900' (e.g., Society of the Cincinnati, Military Order of Foreign Wars, Veterans of Foreign Wars, Army and Navy Union, Sons of the American Revolution), as well as US Government Agency personal decorations(e.g., DOD civilian medals, Homeland Security, NASA, etc.) (DODI1348.33Sec11c).\n# United States civilian unit awards\n# United States Armed Forces campaign and service medals\n# United States Armed Forces service and training awards\n# United States Merchant Marine awards and non-military service awards\n# Foreign military personal decorations\n# Foreign military unit awards\n# International service awards\n# Foreign military service awards\n# United States Armed Forces marksmanship awards\n# United States organization awards, and badges of military societies not included in/defined by 10USC1123 and/or formed after that statute, predominantly in the 20th century and later (after 1907) (e.g., American Legion).\n# United States National Guard personal decorations\n# United States National Guard unit awards\n# United States National Guard campaign and service medals\n# United States National Guard service and training awards\n# Texas Military decorations\n# Texas Military unit awards\n# Texas Military campaign and service awards\n# Texas Military service and training awards\nDepartment level awards\nMedals and ribbons\nBecause Texas National Guard service members are also subject to Title 10 of the United States Code, they are also authorized to wear, and eligible to earn, medals and ribbons of the United States National Guard and United States Armed Forces. Texas State Guard service members who previously earned medals and ribbons of the United States National Guard and United States Armed Forces are authorized to wear them.\nThe following is a list of medals and ribbons from the Texas Military. They are distinctly categorized by distinguished service and achievement decorations, and general service and achievement awards, which is reflected by the order of precedence. It is generally stated that decorations are conferred and awards are issued.\n{| class=\"wikitable\"\n! colspan=\"2\" |Decorations\n|-\n|\n|Texas Medal of Honor\n|-\n|\n|Texas Medal of Valor\n|-\n|\n|Texas Purple Heart\n|-\n|\n|Texas Superior Service Medal\n|-\n|\n|Texas Distinguished Service Medal\n|-\n|\n|Texas Outstanding Service Medal\n|-\n|\n|Texas Medal of Merit\n|-\n|\n|Texas Adjutant General's Individual Award\n|-\n|\n|Texas State Guard Exemplary Service Medal\n|-\n|\n|Texas State Guard Meritorious Service Ribbon\n|-\n|\n|Texas State Guard Commendation Medal\n|-\n|\n|Texas State Guard Achievement Medal\n|-\n|\n|Texas State Guard Commanding General's Individual Award\n|-\n|\n|Texas State Guard Good Conduct Medal\n|-\n|\n|Texas State Guard Recruiting Ribbon\n|-\n| colspan=\"2\" |Decoration Appurtenances\n|-\n|\n|Gold Oak Leaf Device\n|-\n|\n|Silver Oak Leaf Device\n|-\n|\n|Enameled Star Device\n|-\n|\n|Bronze Oak Leaf Device\n|-\n|\n|Bronze Valor Device\n|-\n|\n|Silver Acorn Device\n|-\n|\n|Bronze Acorn Device\n|-\n| colspan=\"2\" |Campaign and Service Awards\n|-\n|\n|Texas Federal Service Medal\n|-\n|\n|Texas Afghanistan Campaign Medal\n|-\n|\n|Texas Iraqi Campaign Medal\n|-\n|\n|Texas Desert Shield/Desert Storm Campaign Medal\n|-\n|\n|Texas Humanitarian Service Ribbon\n|-\n|\n|Texas Homeland Defense Service Medal\n|-\n|\n|Texas Border Security and Support Service Ribbon\n|-\n|\n|Texas Combat Service Ribbon\n|-\n|\n|Texas Cavalry Service Medal\n|-\n|\n|Texas Cold War Medal\n|-\n|\n|Texas Faithful Service Medal\n|-\n|\n|Texas State Guard Service Medal\n|-\n| colspan=\"2\" |Service and Training Awards\n|-\n|\n|Texas State Guard Officer Professional Development Ribbon\n|-\n|\n|Texas State Guard NCO Professional Development Ribbon\n|-\n|\n|Texas State Guard Training Ribbon\n|-\n|\n|Texas State Guard Physical Fitness Ribbon\n|-\n| colspan=\"2\" |                                   Unit Awards\n|-\n|\n|Texas Governor's Unit Citation\n|-\n|\n|Texas Meritorious Unit Award\n|-\n|\n|Organizational Excellence Award\n|-\n| colspan=\"2\" |Award Appurtenances\n|-\n|\n|Silver Star Device\n|-\n|\n|Bronze Star Device\n|-\n|\n|Bronze Cactus Leaf Device\n|-\n|\n|Bronze Numerals\n|}\nBadges\nBecause Texas National Guard service members are also subject to Title 10 of the United States Code, they are also authorized to wear, and eligible to earn, Military badges of the United States. Texas State Guard service members who previously earned Military badges of the United States are authorized to wear them.\nThe following is a list of badges from the Texas Military:\nSpecial Skills Badges\n{| class=\"wikitable\"\n|\n|3rd Class Diver Badge\nTMD-TXSG MOS 1374-20\n|-\n|\n|Dive Medic Badge\nTMD-TXSG MOS 1374-DMTI\n|-\n|\n|2nd Class Diver Badge\nTMD-TXSG MOS 1374-30\n|-\n|\n|1st Class Diver Badge\nTMD-TXSG MOS 1374-40\n|-\n|\n|Master Diver Badge\nTMD-TXSG MOS 1374-50\n|-\n|\n|Dive Officer Badge\nTMD-TXSG MOS 1374-5V\n|-\n|\n|Crewman Boat Operator Badge\nTMD-TXSG MOS 21-B-20\n|-\n|\n|Coxswain Boat Operator Badge\nTMD-TXSG MOS 21-B-30\n|-\n|\n|Master Boat Operator Badge\nTMD-TXSG MOS 21-B-40\n|-\n|\n|Basic Military Emergency Management Specialist Badge\n|-\n|\n|Expert Medical Badge\n|-\n|\n|Engineer Officer Badge\n|-\n|\n|Engineer Specialist Badge\n|-\n|\n|Operation Deployment Badge Flash\n|}\nIdentification Badges\n{| class=\"wikitable\"\n|-\n|\n|Texas Military Forces Joint Staff Badge\n|The badge is an oval enameled metal device, 2 inches wide, 2-3/16 inches tall. The badge consists of cross sabers in gold with the inscription “TXMF” above the State of Texas Flag which is centered and “Joint Staff” below the Texas Flag surrounded by a silver wreath.\n|-\n|\n|Texas Army National Guard General Staff Badge\n|The badge is a circular enameled metal device, 1-7/8 inches in diameter. The badge consists of the Joint Force Headquarters distinctive unit insignia superimposed on a five-pointed gold-edged black star, one point up, on a background of green, gold-trimmed laurel leaves.\n|-\n|\n|Texas State Guard General's Staff Badge\n|\n|-\n|\n|Recruiter Badge\n|\n|}\nTabs\n{| class=\"wikitable\"\n|\n|Governor's Twenty Tab\n|-\n|\n|Honor Guard Tab\n|-\n|\n|MEMS Academy Tab\n|}\nCertificates\n*'''The Texas Adjutant General's Certificate of Commendation\n**Awarded for outstanding achievement or performance of duty when such action or duty is noteworthy. It may be presented to any service member of the Texas Military Forces, or to any employee (civilian or military) of the Texas Military Department. It may also be awarded to a unit/detachment of the Texas Military Forces for outstanding administrative or training achievement performance. The certificate will not be awarded for any acts or performance covered by another award, except that awards in conjunction with retirement may cover the entire period(s) of service in the Texas Military Forces or with the Texas Military Department, regardless of any other awards.\n*The Texas Adjutant General's Certificate of Appreciation\n**Awarded to any individual, organization, or entity (military or civilian), not a member or part of the Texas National Guard or Texas State Guard, for significant aid, assistance, or support to any part or all of the Texas Military Forces.\nHall of Honor\nThe Hall of Honor was established by the Texas Military Department in 1980 to \"recognize outstanding service and leadership\" of Texas Military Forces service members operating under state or federal command. As of 2018, it has 120 inductees.\nIt is hosted by the Texas Military Forces Museum at Camp Mabry. It is both an exhibit with a digital kiosk that showcases inductee biographies, and an eponymous conference center that may be rented for conventions or banquets. Inductees also receive a trophy, which has varied in type since 1980.\nHall of Fame\nThe Texas Ranger Hall of Fame was established in 1964 to recognize service members who \"significantly contributed to the development of the service or died heroically in the line of duty.\" As of 2019, it has 31 inductees — 24 of which served under the Texas Military Department. The Texas Rangers were a branch of the Texas Military Forces from 1835 to 1935, providing cavalry, special operations, and military police capabilities. Administrative control (ADCON) of the Texas Rangers was transferred from the Texas Military Department to the Texas Department of Public Safety (DPS) in 1935. Under DPS, the Texas Rangers perform duties similar to the Federal Bureau of Investigation (FBI) for Texas as a State Bureau of Investigation (SBI).\nTexas State Cemetery\nThe Texas State Cemetery was established by the Fifth Texas Legislature in 1854 as the burial site for General Edward Burleson in Austin. It is considered the \"Arlington of Texas.\" It was extensively expanded after the American Civil War for the burial of 2,000 officers and their wives. It has expanded over the ensuing years for the burial of \"prominent\" Texans. It is operated by the Texas State Preservation Board but remains predominately occupied by Texas military service members.\nFuneral Honors and Markers\nBy request of a descendant or estate executor, the Texas Military Department provides any service member of the Texas Military Forces a military funeral and grave marker modeled on the ceremony and style provided to service members of the United States Armed Forces. Exact details are outlined in Texas Government Code 437.215. It was established via Texas Senate Bill 1536 sponsored by Senator Leticia Van de Putte on 01 September 2013.\nHolidays\nTexas Military Heroes Week\nTexas Military Heroes Week is an annual memorial holiday from February 5-11th that encourages \"all Texans to recognize and honor those who have secured our freedom throughout the generations and those who are defending it still...During the first full week of February, we honor all who have sacrificed and served on behalf of the Lone Star State. No matter the battle, no matter the branch, no matter the job – they deserve our gratitude and reverence.\" It was established via Executive Proclamation by Commander-in-Chief Greg Abbott on , which replaces Texas Military Heroes Day (aka \"Chris Kyle Day\") established on .\nWomen Veterans Month\nWomen Veterans Month was established by Greg Abbott on March 1, 2023. It dedicates the month of March to \"celebrate the women who have served our nation and to rededicate ourselves to the timeless ideals for which they valiantly fought.\"\nSpecial Forces Day\nSpecial Forces Day is an annual memorial holiday on June 28 that \"honors the men and women who have served in the special operations forces..to be regularly observed by appropriate ceremonies.\" It was established on May 16, 2023, during the Eighty-eighth Texas Legislature in House Bill 2499 sponsored by Cecil Bell and Brandon Creighton.\nOther awards\n*Texas Meritorious Service Award – presented to civilians, organizations, or non-Texas service members for exceptional service and support to the Texas Military Forces.\n*President's Volunteer Service Award''' – Service (volunteered hours) in the Texas Military Forces are eligible for the President's Volunteer Service Award, a Bronze, Silver, Gold, and Lifetime necklet award.\nBranch level awards\nGonzales Cup\nThe Gonzales Cup is the top award of the Commander's Small Unit Excellence Challenge, an annual, two-day team and individual competition that tests core skills and physical endurance of Texas State Guard service members. It was established in 2013 and its namesake is the Battle of Gonzales.\n300 Club\nThe 300 Club is an unofficial award colloquially referred to by service members who achieve the maximum score of 300 points in the Army Physical Fitness Test. While it is universally recognized among the Texas Army National Guard, Texas Air National Guard, and Texas State Guard, there is no official list that documents its members. It is generally an esprit de corps tradition at the unit level.\nUnit level awards\nUnit level awards that may be worn on a service or duty uniform are authorized as a military tradition in United States Department of the Army Pamphlet regulation 670-1 at the discretion of the commanding officer.\nOfficer Candidate School (TXSG)\nHonor Graduate\nThe Honor Graduate award, officially the BG Thomas C. Hamilton Distinguished Honor Graduate and formerly the MG Raymond C. Peters Distinguished Honor Graduate, is the top award of the Texas State Guard Officer Candidate School (OCS). It is awarded to graduates of the Officer Candidate Course (OCC) based on their combined Leadership, Academic, Physical Fitness, and Peer Evaluation performance.\nThe award was established in 2003 by COL Mervyn J. Doherty when he established Officer Candidate School. Its first given namesake was the commanding general of the Texas State Guard, MG Raymond C. Peters, in 2009. It was renamed after BG Thomas C. Hamilton in 2014, who redesigned the school in 2010.\nCrucible MVP\nThe Crucible MVP award, officially the Final Field Training Exercise Most Valuable Player Award, is the second highest award of the Texas State Guard Officer Candidate School (OCS). It is awarded to candidates of the Officer Candidate Course (OCC) final field training exercise based on their combined Leadership, Academic, and Physical Fitness performance during the exercise.\nThe award was established in 2014 by CPT H. Lee Burton and its namesake is week 10 of United States Marine Corps Recruit Training, for which the exercise mirrors.\nOther awards\n* OCC Leadership Award\n* OCC Academic Award\n* OCC Physical Training Award\n* OCC Crucible Team Award\nCommand and General Staff College (TXSG)\nHonor Graduate\nThe Honor Graduate award, officially the COL Stephen B. Springer Academic Excellence Award is the top award of the Texas State Guard Command and General Staff College. It is awarded to graduates based on their academic performance.\nThe award was established in 2014 by COL Stephen B. Springer when he established the Commander and General Staff College. It was given his namesake in 2015.\nInactive and obsolete awards\nTexas Military Department Awards:\n* Adjutant’s General’s Staff Identification Badge was replaced by the Texas Military Forces Joint Staff Badge on 01 August 2009.\n*Texas National Guard:\n** Texas National Guard Medal of Merit\n** Texas National Guard Mexican War Service Medal\n** Texas National Guard Outstanding Service Medal\n** Texas National Guard Provost Marshal Section Ribbon\n** Texas National Guard State Guard Civil Defense Ribbon\n*Texas State Guard:\n**Special Operations Tab (for Quick Response Teams, 2009–2014)\n**Small Arms Marksmanship Ribbon\n**Marksmanship Qualification Badge\n**Occupational Badges:\n***(a) Command and Control (b) Law Enforcement/Security Forces (c) Enlisted Medical (d) Medical Corps (e) Medical Services/Biomedical Sciences (f) Nurse (g) Material Acquisition (h) Chaplain (all denominations) (i) Chaplain Services (j) Communications/Computer Systems (k) Information Management (l) Judge Advocate (m) Logistics (n) Personnel and Manpower Management (o) Operations Support (p) Public Affairs (q) Paralegal (r) Services (s) Supply\n**Spur Walk, also known as Operation Heavy METL, is a 24hr, 18-mile team competition that consists of land navigation, leadership reaction tasks, obstacle course, and mission skills. Service members who earn enough points are awarded silver spurs. It was established in 2008 and its namesake is the Order of the Spur, for which the competition mirrors. It was discontinued in 2019.\nSee also\n* Texas Military Forces\n*Texas Military Department\n*List of conflicts involving the Texas Military\n* Awards and decorations of the Texas government\n* Awards and decorations of the United States Armed Forces\nReferences"
    }
  ]
}