{
  "content": [
    {
      "type": "text",
      "text": "# Awesome New Republic\n\nAwesome New Republic is a two-piece indie band from Miami, Florida consisting of Michael John Hancock and Brian Robertson. Their debut album, ANR So Far, was released with critical acclaim from online magazines such as Stereogum, and received play on the BBC and KCRW.\nANR So Far was featured on Pitchfork Media and received 7.9/10.\nHistory\nAwesome New Republic was founded by Michael John Hancock and Brian Robertson at the Frost School of Music at the University of Miami in 2004. The duo had previously performed together in a 5-piece band called Empirical Mile with other University of Miami music school students. In 2005, \"MJ\" and \"B-Rob\" combined two previously hand made studio albums Courageous and Witness Now the Birth of An Awesome New Republic to create their debut release \"ANR So Far\".\nANR has shared bills with a variety of acts, including The New Deal, Girl Talk, Animal Collective, Mike Gordon and the Benevento Russo Duo.  Awesome New Republic played the 2008 Langerado Festival and was scheduled to play the 2009 festival before its subsequent cancellation.  They have twice played both the Pop Montreal and CMJ music festivals.\nIn 2008, they were featured as a center piece in an article in The New York Times about the budding Miami music scene which hailed them as \"one of the newest exponents of this growing tropical bohemia.\"\nAwesome New Republic uses Twitter actively. In August 2011 the group collaborated with acclaimed performance artist Jillian Mayer for their \"It's Around You\" music video\nBitTorrent Advertising Campaign\nThe release of \"Rational Geographic Volume 1\" coincided with a sponsorship campaign of isoHunt by Honor Roll Music.  This is first time a record label has actively advertised a band directly to BitTorrent users.\nDiscography\n;Studio albums\n*Courageous (2004), Self-Released\n*Witness Now the Birth of An Awesome New Republic (2004), Self-Released\n*ANR So Far (2005), Sutro\n*All Party Talks Vinyl (2005), Sutro\n*Rational Geographic, Vol. I (April 14, 2009), Honor Roll Music\n*Rational Geographic, Vol. II (July, 2009), Honor Roll Music\n*Hearts (October 27, 2009), Honor Roll Music\n*Stay Kids (2011), Something In Construction / 10K Islands\nReferences\nExternal links\n* [https://web.archive.org/web/20090216143859/http://anrmiami.com/ Official Website]\n* [http://www.honorrollmusic.com/ Honor Roll Music]"
    }
  ]
}