{
  "content": [
    {
      "type": "text",
      "text": "# Aylesbury and Buckingham Railway__disambig_1\n\nThe Aylesbury and Buckingham Railway (A&BR) was an English railway located in Buckinghamshire, England operating between Aylesbury and Verney Junction.\nHistory\n| type                  = Act\n| parliament            = Parliament of the United Kingdom\n| long_title            =\n| year                  = 1864\n| citation              = 27 & 28 Vict. c. ccxvii\n| introduced_commons    =\n| introduced_lords      =\n| territorial_extent    =\n| royal_assent          = 25 July 1864\n| commencement          =\n| expiry_date           =\n| repeal_date           =\n| amends                =\n| replaces              =\n| amendments            =\n| repealing_legislation =\n| related_legislation   =\n| status                =\n| legislation_history   =\n| theyworkforyou        =\n| millbankhansard       =\n| original_text         = https://www.legislation.gov.uk/ukla/Vict/27-28/217/pdfs/ukla_18640217_en.pdf\n| revised_text          =\n| use_new_UK-LEG        =\n| UK-LEG_title          =\n| collapsed             = yes\n}}\n| type                  = Act\n| parliament            = Parliament of the United Kingdom\n| long_title            = An Act to extend the Time for completing the Aylesbury and Buckingham Railway; to raise additional Capital; and for other Purposes.\n| year                  = 1865\n| citation              = 28 & 29 Vict. c. xciii\n| introduced_commons    =\n| introduced_lords      =\n| territorial_extent    =\n| royal_assent          = 19 June 1865\n| commencement          =\n| expiry_date           =\n| repeal_date           =\n| amends                =\n| replaces              =\n| amendments            =\n| repealing_legislation =\n| related_legislation   =\n| status                =\n| legislation_history   =\n| theyworkforyou        =\n| millbankhansard       =\n| original_text         = https://www.legislation.gov.uk/ukla/Vict/28-29/93/pdfs/ukla_18650093_en.pdf\n| revised_text          =\n| use_new_UK-LEG        =\n| UK-LEG_title          =\n| collapsed             = yes\n}}\n]]\nThe Aylesbury and Buckingham Railway Company was incorporated under the  23 & 24 Vict. c. cxcii on 6 August 1860, and the line opened on 23 September 1868 connecting  Aylesbury and Verney Junction and serving intermediate stations at Waddesdon Manor (renamed Waddesdon on 1 October 1920), Quainton Road, Grandborough (renamed Granborough Road on 6 October 1920), and Winslow Road. The A&BR was never extended to Buckingham.\nIn the late 1880s the Metropolitan Railway planned to extend its projected Aylesbury line northwards to , to make a junction with the East and West Junction Railway. Instead, under the Metropolitan Railway Act 1890 (53 & 54 Vict. c. cxxviii), the Aylesbury and Buckingham Railway Company was absorbed by the Metropolitan Railway on 1 July 1891 and it thus formed the northward progress of the Metropolitan Railway.\nThe section of line from Morton Pinkney to just north of Quainton Road railway station was built later as part of the London Extension of the Great Central Railway, joining the, by then, Metropolitan Railway tracks into London, and forming the Great Central Main Line which opened for passenger traffic on 15 March 1899.\nIn April 1906 the Metropolitan Railway section from Harrow-on-the-Hill station to Verney Junction was leased to a joint committee of the Metropolitan Railway and Great Central Main Line: it was worked on a five-yearly basis alternately by the joint lessees.\nPassenger services on the line were withdrawn between Quainton Road and Verney Junction from 6 July 1936, having last run on the 4th, and the intermediate stations of Granborough Road and Winslow Road closed. The last through service, a parcels train from Verney Junction, was on 6 April 1947. The line was officially closed on 8 September 1947 but was retained as a siding to a point near Winslow Road until at least 1963. On 14 September that year a railtour ran on this part of the line.\nCurrent and future developments\nIn December 2008 a section of track between Aylesbury and the newly opened Aylesbury Vale Parkway station was reinstated for regular passenger use. There are plans to continue the reinstatement north of Aylesbury Vale as part of new the East West Rail Consortium route around London. However the route would use only the section just to the north of Quainton Road, continuing via the Great Central route and the Calvert curve towards . There are no firm plans for stations between Aylesbury Vale and  nor a reinstated station at Verney Junction.\nSee also\n* Great Central Railway, The \"London Extension\"\n* Metropolitan Railway\n* Buckinghamshire Railway\nReferences\n*[http://www.davros.org/rail/culg/metropolitan.html Clive's UndergrounD Line Guides, Metropolitan line]"
    }
  ]
}