{
  "content": [
    {
      "type": "text",
      "text": "# B'nai Israel Traditional Synagogue\n\n| coordinates_footnotes =\n| heritage_designation  =\n| architect             =\n| architecture_type     = Synagogue\n| architecture_style    = Mid-Century modernism\n| founded_by            =\n| creator               =\n| funded_by             =\n| general_contractor    =\n| established           = 1913\n| groundbreaking        =\n| year_completed        = 1954\n| construction_cost     =\n| date_demolished       =\n| facade_direction      =\n| capacity              = 100 worshippers\n| length                =\n| width                 =\n| width_nave            =\n| interior_area         =\n| height_max            =\n| dome_quantity         =\n| dome_height_outer     =\n| dome_height_inner     =\n| dome_dia_outer        =\n| dome_dia_inner        =\n| minaret_quantity      =\n| minaret_height        =\n| spire_quantity        =\n| spire_height          =\n| site_area             =\n| temple_quantity       =\n| monument_quantity     =\n| shrine_quantity       =\n| inscriptions          =\n| materials             = Concrete block\n| elevation_m           =\n| elevation_footnotes   =\n| nrhp                  =\n| designated            =\n| added                 =\n| refnum                =\n| delisted1_date        =\n| website               =\n| module                =\n| footnotes             =\n}}\n'''B'nai Israel Traditional Synagogue''' is a Conservative synagogue located at 1907 Vance Ave, Alexandria, Louisiana, in the United States. It was founded in 1913 as an Orthodox synagogue by Jews from Poland and Russia, many of whom arrived in Alexandria and Central Louisiana as part of the Galveston Movement. In the 1950s the congregation became Conservative.\nHistory\nThe first shul was located at Fourth and Lee Streets.  Ten years after B'nai Israel's founding, the congregation had twenty members.  A full-time rabbi, Rabbi Jacob Aronson, led Shabbat services and a cheder, which met three times per week. The religious school soon thereafter met six days per week that \"provided instruction in Hebrew language, history, and the Bible.\" By 1940, the congregation had its own building and a small cemetery just north of the city.\nIn the 1950s a new concrete block building was constructed on Vance Avenue.  The rectangular structure was designed with Mid-Century modern architecture.\nThe congregation has been lay-led by congregants over the years. Dr. Bernard Kaplan (z\"l) led the congregation from 1962 until his death in 1995. Since 1998, Bernard Kaplan's son, Dr. Meyer Kaplan, has been the lay leader.\nThe synagogue holds regular Shabbat and holiday services.\nSee also\n*Congregation Gemiluth Chassodim\n*Alexandria, Louisiana\nReferences"
    }
  ]
}