{
  "content": [
    {
      "type": "text",
      "text": "# Babette Goes to War\n\n| country = France\n|gross = 4,657,610 admissions (France)\n| language = French\n}}\nBabette Goes to War () is a 1959 French CinemaScope film starring Brigitte Bardot. It was Bardot's first movie since becoming a star where she did not take off her clothes.\nPlot\nIn 1940, during the German invasion of France, a young woman called Babette flees on a boat to England. She is desperate to help the Free French, who end up parachuting her back into the country on a mission to thwart the German invasion of England.\nCast\n* Brigitte Bardot as Babette\n* Jacques Charrier as Lt. Gérard de Crécy-Lozère\n* Francis Blanche as Commander Obersturmführer aka \"Papa Schulz\"\n* Hannes Messemer as General Franz von Arenberg\n* Ronald Howard as Colonel Fitzpatrick\n* Yves Vincent as Cpt. Darcy\n* Pierre Bertin as Duke Edmond de Crécy-Lozère\n* Viviane Gosset as Duchess Hélène de Crécy-Lozère\n* Mona Goya as Madame Fernande\n* Noël Roquevertas Cpt. Gustave Brémont\n* Michael Cramer as Heinrich\n* Jean Carmetas Antoine\n* René Havard as Louis\n* Günter Meisner as the first Gestapo officer\n* Jacques Hilling as the French captain\n* Charles Bouillaud as Pierrot\n* Alain Bouvette as Emile\n* Max Elloy as Firmin\n* Robert Berri as Sgt. Hill\n* Jenny Orléans as a girl\n* Philippe Clair as Un résistant\nProduction\nBardot had meant to make a film in Hollywood called Paris by Night with Frank Sinatra and Roger Vadim but did not want to go to America. Producer Raoul Levy came up with another idea, a film about a young girl who becomes involved with the Resistance called Babette Goes to War. Levy assigned Vadim to work on the script with an American writer. Vadim's film The Night Heaven Fell was released and performed poorly, so Levy replaced Vadim as director with Christian Jacques.\nIn September 1958 it was announced Peter Viertel was working on the script. By October Christian Jacque was attached as director. David Niven was mentioned as a possible co star.\nThe film was the first in a three-picture deal Levy had with Columbia, two of which were to star Bardot. The studio would invest $2.5 million. (Columbia helped finance the hugely successful Bardot-Levy movie And God Created Woman.) Gerard Philippe was the original co star announced. This deal later expanded to cover three years.\nLevy said he came up with the idea of Bardot keeping on her clothes because it was unexpected. \"Everything there is to show has been shown,\" said the producer.\nFilming took place in February and March 1959. Bardot and Jacques Charrier had an affair during filming that led to Bardot falling pregnant and them getting married. Bardot was briefly ill during filming.\nReception\nThe film had its world premiere at the Moscow Film Festival. It was a big hit with admissions in France of 4,657,610. It was the fourth most popular film at the French box office in 1959, after The Cow and I, Sleeping Beauty and The Green Mare. (It was followed by Some Like It Hot, The Four Hundred Blows, The Magnificent Tramp, North by Northwest, Solomon and Sheba and Black Orpheus.\nReferences\nExternal links\n*\n*[https://www.tcm.com/tcmdb/title/67853/babette-goes-to-war Babette Goes to War] at TCMDB"
    }
  ]
}