{
  "content": [
    {
      "type": "text",
      "text": "# Bachelor of Software Engineering__disambig_1\n\nA Bachelor of Software Engineering is an undergraduate academic degree (bachelor's degree) awarded for completing a program of study in the field of software development for computers in information technology.\n\"Software Engineering is the systematic development and application of techniques which lead to the creation of correct and reliable computer software.\"\nTopics covered\nIn following years, a software engineering student will often have a much stronger focus on Software systems and data management. The inclusion of human factors in a software engineering degree has been heavily debated, arguing that products of software engineers often are too difficult to use by consumers.\nSample B.S. in Software Engineering Degree Information from the University of Virginia - Wise\nCore SWE Requirements:\n* Introduction to Software Engineering\n* Software Requirements & Modeling\n* Software Design & Construction\n* Software Testing, Verification, and Validation\n* Software Quality Assurance\n* Software Project Management\n* Software Configuration Management\nCS Requirements:\n* Fundamentals of Programming\n* Data Structures\n* Introduction to Algorithms\n* Operating Systems\n* Computer Architecture\n* Programming Languages\n* Human - Computer Interaction\n* Discrete Mathematics\n* Database Designing\nMath Requirements:\n* Probability & Statistics\n* Calculus I\n* Calculus II\n* Calculus III\n* Linear Algebra\n*Boolean Algebra\nGeneral skills acquired through a Bachelor's degree course in Software Engineering\nEmployers generally seek applicants with strong programming, systems analysis and business skills.\n\"A large difference exists between the software engineering skills taught at a typical\nuniversity or college and the skills that are desired of a software engineer by a typical\nsoftware development organization. At the heart of this difference seems to be the way\nsoftware engineering is typically introduced to students: general theory is presented in a\nseries of lectures and put into (limited) practice in an associated class project.\"\nGraduate prospects\nGraduate prospects are projected to be excellent with the amount of software engineers in the industry estimated to rise by roughly 38% from 2006 to 2016, with total real wage in the industry increasing by an estimated 38.2%. The U.S. Bureau of Labor Statistics Occupational Outlook Job Outlook for Software engineers and Developers 2019-29 predicts only a 22% growth. After the crash of the dot-com bubble (1999–2001) and the Great Recession (2008), many U.S. software professions were left without work or with lower wages. In addition, enrollment in computer-related degrees and other STEM degrees (STEM attrition) in the US has been dropping for years, especially for women, which, according to Beaubouef and Mason  could be attributed to a lack of general interest in science and mathematics and also out of an apparent fear that software will be subject to the same pressures as manufacturing and agriculture careers. The U.S. Bureau of Labor Statistics Occupational Outlook 2014-24 predicts a decline for Computer Programmers of -8 percent, then for 2016-26 predicts a decline of -7 percent, then a decline of -9 percent from 2019 to 2029, and finally predicts a decline of -10 percent from 2021 to 2031.\nInternational variations\nSouth Asia\nIn Pakistan and Nepal, Bachelor of Engineering in Software Engineering (BE Software) is an 8-semester course of study. This degree is provided by University of Engineering and Technology, Taxila,\nVirtual University of Pakistan,Superior university and many others and  Pokhara University Nepal.\nIn Bangladesh, this degree is named Bachelor of Science in Software Engineering (BS SE) which is also an 8-semester course of study.  University of Dhaka is the pioneer of Software Engineering education in Bangladesh offering Bachelor of Science in Software Engineering (BSSE) degree since 2009 with 6 months industry internship program.\nThe Bachelor of Software Engineering degree is awarded to those who successfully complete an eight-semester program.\nOceania\nIn Australia, the Bachelor of Software Engineering typically spans three to four years and is offered as a standalone honours degree or combined with related disciplines (such as information technology). [https://www.engineersaustralia.org.au/about-us/accreditation Engineers Australia] and the [https://www.acs.org.au/ Australian Computer Society] provide accreditation in Australia, under the Washington and Seoul Accords, ensuring they meet national and international engineering and ICT standards. Curriculum commonly covers software development lifecycles, system architecture, testing, maintenance, cloud computing, cybersecurity, and teamwork, often including capstone projects or industry placements.\nIn New Zealand, several institutions offer a Bachelor of Software Engineering with specialisations such as game programming, cloud computing, or artificial intelligence. These three‑year professional degrees integrate foundational software engineering topics, such as algorithm design, data structures, testing, and project management, with electives and studio-based practical learning.  Certification is provided by [https://itp.nz/certification IT Professionals New Zealand].\nReferences\nExternal links\n* [http://nces.ed.gov/collegenavigator/?s=all&p=14.0903 U.S. Department of Education's list of recognized institutions offering a degree program in Computer Software Engineering]\n* [http://www.collegegrad.com/careers/Computer-Software-Engineers.shtml Summary of Software Engineering and the roles of software engineers in the industry]\n* [https://www.saxion.edu/programmes/bachelor/software-engineering-information-and-communication-technology Bachelor of Science in Software Engineering - Information and Communication Technology]"
    }
  ]
}