{
  "content": [
    {
      "type": "text",
      "text": "# Backward Euler method\n\nIn numerical analysis and scientific computing, the backward Euler method (or implicit Euler method) is one of the most basic numerical methods for the solution of ordinary differential equations. It is similar to the (standard) Euler method, but differs in that it is an implicit method. The backward Euler method has error of order one in time.\nDescription\nConsider the ordinary differential equation\n\\frac{\\mathrm{d} y}{\\mathrm{d} t} = f(t,y)\nwith initial value  y(t_0) = y_0.  Here the function f and the initial data t_0 and y_0 are known; the function y depends on the real variable t and is unknown. A numerical method produces a sequence  y_0, y_1, y_2, \\ldots  such that  y_k  approximates  y(t_0+kh) , where  h  is called the step size.\nThe backward Euler method computes the approximations using\ny_{k+1} = y_k + h f(t_{k+1}, y_{k+1}).\nThis differs from the (forward) Euler method in that the forward method uses  f(t_k, y_k)  in place of f(t_{k+1}, y_{k+1}).\nThe backward Euler method is an implicit method: the new approximation  y_{k+1}  appears on both sides of the equation, and thus the method needs to solve an algebraic equation for the unknown  y_{k+1} . For non-stiff problems, this can be done with fixed-point iteration:\ny_{k+1}^{[0]} = y_k, \\quad y_{k+1}^{[i+1]} = y_k + h f(t_{k+1}, y_{k+1}^{[i]}).\nIf this sequence converges (within a given tolerance), then the method takes its limit as the new approximation\ny_{k+1} .\nAlternatively, one can use (some modification of) the Newton–Raphson method to solve the algebraic equation.\nDerivation\nIntegrating the differential equation  \\frac{\\mathrm{d} y}{\\mathrm{d} t} = f(t,y)  from  t_n  to  t_{n+1} = t_n + h  yields\ny(t_{n+1}) - y(t_n) = \\int_{t_n}^{t_{n+1}} f(t, y(t)) \\,\\mathrm{d}t.\nNow approximate the integral on the right by the right-hand rectangle method (with one rectangle):\ny(t_{n+1}) - y(t_n) \\approx h f(t_{n+1}, y(t_{n+1})).\nFinally, use that  y_n  is supposed to approximate  y(t_n)  and the formula for the backward Euler method follows.\nThe same reasoning leads to the (standard) Euler method if the left-hand rectangle rule is used instead of the right-hand one.\nAnalysis\nThe local truncation error (defined as the error made in one step) of the backward Euler Method is  O(h^2) , using the big O notation. The error at a specific time  t  is  O(h^2) . It means that this method  has order one. In general, a method with  O(h^{k+1})  LTE (local truncation error) is said to be of kth order.\nThe region of absolute stability for the backward Euler method is the complement in the complex plane of the disk with radius 1 centered at 1, depicted in the figure. This includes the whole left half of the complex plane, making it suitable for the solution of stiff equations. In fact, the backward Euler method is even L-stable.\nThe region for a discrete stable system by Backward Euler Method is a circle with radius 0.5 which is located at (0.5, 0) in the z-plane.\nExtensions and modifications\nThe backward Euler method is a variant of the (forward) Euler method. Other variants are the semi-implicit Euler method and the exponential Euler method.\nThe backward Euler method can be seen as a Runge–Kutta method with one stage, described by the Butcher tableau:\n\\begin{array}{c|c}\n1 & 1 \\\\\n\\hline\n& 1 \\\\\n\\end{array}\nThe method can also be seen as a linear multistep method with one step. It is the first method of the family of Adams–Moulton methods, and also of the family of backward differentiation formulas.\nSee also\n*Crank–Nicolson method\nNotes\nReferences\n* ."
    }
  ]
}