{
  "content": [
    {
      "type": "text",
      "text": "# Backwardism\n\nBackwardism is a derogatory comment intended to brand an ideology as stained by backwardness. While the term has been applied to literature, politics and religion, its precise definition remains unclear. Because of its various connotations and the evolution of its meaning in various times and places, it remains a notion to be played with carefully.\nUse\nLiterature: the abuse of analepsis\nIn literature, backwardism which is also known as antonymism is a reference to an abusive use of analepsis or \"going backwards\". While these flashbacks are an important leitmotif in many novels, they can contribute to a certain sense of confusion.\nPolitics: various meanings in America, Turkey, China and India\nJames Boyle criticized the \"backwardism of American socialism\" since 1912.\nBackwardism emerged in Chinese revolutionary ideology of Marxist Intellectuals to describe the return to peasant society.\nIn 1970, backwardism was applied by Turkish reformist İsmet İnönü against the Islamic conservatives who were trying to kill the spirit of Ataturk's secular reforms while others criticized the cult of the former leader saying that \"Kemalism leads more to backwardism than forwardism\".\nSince at least the 1980s, the concept has been applied to the caste system of India as well as a result of the work of the Mandal Commission established in India in 1979 by the Janata Party government under Prime Minister Morarji Desai with a mandate to \"identify the socially or educationally backward classes\" of India. The intended purpose of backwardism in India was \"attaining social justice through caste\", through based reservation in government jobs for example but it ultimately let to the \"clustering of backward castes\". It was propagated in Bihar especially through the political tactics of Karpuri Thakur. In Tamil Nadu, backwardism has emerged as an element of political theory describing the \"phenomenon of the rise of backward castes\". It has been used as political concept which is actually used as a \"strength card\"  by politicians like Jayalalitha, Karunanidhi, or Shibu Soren but it may not have a place in Indian politics in the future as \"backward castes\" remain unsatisfied with being at the fringes of the political system.\nReligion: Pope Francis's critique of traditionalism\nIn the field of religion, backwardism may be a translation from French of the derogatory term first used in 1868 by Baudelaire to describe as \"arriéristes\" those religious conservatives who criticized the artistic innovations of painter Eugene Delacroix.\nIn 2014, Catholic vaticanist Ken Briggs described the pontificate of \"revivalist\" Pope Francis as one that had \"rolled back the march of backwardism and paved the way for a Bernardinian renewal of the hierarchy in the minds of many reformists.\" On March 7, 2015, in commemoration of the 50th anniversary of the first vernacular Mass celebrated there by Pope Paul VI in 1965, Pope Francis made these comments his own saying that \"it is not possible to go backwards. And those who go backward are mistaken\". In the wake of the motu proprio Traditionis Custodes published in the summer of 2021, Pope Francis has pejoratively referred to the traditionalist movement resisting the cancellation of the Latin mass by referring to its supports as \"backwardists\". He used the Italian word \"indietristi\" in the sense that they are not living tradition in a way that is moving forwards but rather trying to go backwards in the past opposing it to the rule of organic development of doctrine as articulated by Vincent of Lerins in his Commonitorium. This \"contempt\" for traditionalists has been criticized by Jesuit priest James V. Schall quoting G.K. Chesterton saying that \"progress can only be made by looking backwards.\"\nReferences"
    }
  ]
}