{
  "content": [
    {
      "type": "text",
      "text": "# Background of the Russo-Georgian War__disambig_1\n\nDetailed map of the Caucasus region (1994), including locations of economically important energy and mineral resources: South Ossetia has reserves of [[lead and zinc, Abkhazia has coal, and Georgia has oil, gold, copper, manganese, and coal.]]\nThis article describes the background of the Russo-Georgian War.\nFormation of Georgia\nWestern Georgia was included in the Kingdom of Abkhazia in the ninth century. Kutaisi was adopted as the capital of the Abkhaz kingdom and the Georgian language soon became dominant in the kingdom. In the 10th century AD, Georgia for the first time emerged as an ethnic concept in the territories where the Georgian language was used to perform Christian rituals. The Abkhaz kingdom was expanding eastward and the royal intermarriage led to the merger of the Abkhaz kingdom and the Kingdom of Georgia into a single entity. The inclusion and subsequent adoption of the Emirate of Tbilisi as capital of Georgia in 1122 marked the culmination of the Georgian unification. After the Mongol invasions of the region, the Kingdom of Georgia eventually was split into several states. In the 19th century, the Russian Empire gradually took over the Georgian lands and incorporated them into Tiflis Governorate (eastern Georgia) and Kutaisi Governorate (western Georgia including Abkhazia). Russification of Georgians was unsuccessful and the Russians responded by renouncing the Georgian nationhood and broke down Georgian people into several sub-ethnic groups. In the aftermath of the Russian revolution, Georgia declared its independence on 26 May 1918. The Georgian constitution granted autonomy to Abkhazia. During the independence of Georgia in 1918–1921, Georgia did not manage to fully integrate Abkhazia. Although Georgia's independence was recognized by Russia in May 1920, the Russian Bolsheviks invaded independent Georgia in 1921.\nSoviet Georgia included three autonomous entities. These were Abkhazia, Adjara, and South Ossetia. Only case of religious distinctness was Ajaria due to its being populated by Ajar adherents of Islam. A shared language among other common traits of Ajars and Georgians largely averted the tensions between Tbilisi and Batumi. Although Orthodox Christianity is common among ethnically distinct South Ossetians and Abkhaz people, fierce conflicts arose between the central government in Tbilisi and these autonomous entities. Abkhazia and South Ossetia were given the hypothetical right to break away from the union republic by Joseph Stalin, and this \"time bomb\" was used against Georgia in 1991. Ethnic self-determination and state formation has never been among Adjara's aims.\nGeorgian-Ossetian conflict\nOssetian arrival in Transcaucasia\n, showing the territory of modern South Ossetia within Georgia and Imeria. Modern North Ossetia corresponds to \"Ossia\" (Ossetia) in the North Caucasus. Ossetia became part of the Mountain ASSR in 1921 and was renamed into North Ossetia only in 1924.]]\nThe Ossetians are an Indo-European ethnic group descended from the Alans, one of the Sarmatian tribes, and speaking the Ossetian language which is an Iranian language similar to the Pathan language spoken in Afghanistan. The Ossetians are indigenous to North Ossetia, located in the North Caucasus. Controversy surrounds the date of Ossetian arrival in Transcaucasia. According to one recent theory, they first migrated there during the 13th and 14th centuries AD after Mongol and Timur's invasions. According to another theory, Ossetian migration to central Georgia began in the 17th century with the permission of the Georgian authorities. Ossetians lived alongside the Georgians peacefully for centuries.\nWhen the Ossetians first came into contact with Tsarist Russia, geography and faith contributed to a pro-Russian stance of the Ossetian people. Many representatives of the Ossetian people served in the Russian army during both the tsarist and Soviet period; they boast to have generated proportionately more heroes of the Soviet Union than other constituent Soviet peoples.\n1918-1920 conflict and the Soviet period\nIn 1918, conflict began between the landless Ossetian peasants living in Shida Kartli, who were affected by Bolshevism and demanded ownership of the lands they worked, and the Menshevik government backed ethnic Georgian nobility, who were legal owners. Although the Ossetians were initially discontented with the economic stance of Tbilisi authorities, the tension shortly transformed into ethnic conflict. The first Ossetian rebellion began in February 1918, when three Georgian princes were killed and their land was seized by the Ossetians. The central government of Tiflis retaliated by sending the National Guard to the area. However, the Georgian unit retreated after they had engaged the Ossetians. Ossetian insurgents then proceeded to occupy the town of Tskhinvali and began assaulting ethnic Georgian natives. During uprisings in 1919 and 1920, the Ossetians were covertly supported by Soviet Russia, but even so, were defeated. By inciting ethnic unrest in Georgia, the Bolsheviks intended to subjugate Georgia easily. The claim of 5,000 Ossetian deaths in the conflict of 1920 is questioned as exaggerated.\nThe independent Democratic Republic of Georgia was invaded by the Red Army in 1921 and a Soviet government was installed. The Soviet Army was supported by the Ossetians. The Soviet invasion of Georgia made possible for Ossetians, who were peasants inhabiting the Georgian feudal lands, to secure the claimed territory. The government of Soviet Georgia created an autonomous administrative unit for Transcaucasian Ossetians in April 1922, called the South Ossetian Autonomous Oblast. The creation of this oblast took place under pressure from Kavbiuro (the Caucasian Bureau of the Central Committee of the Russian Communist Party). Historians such as Stephen F. Jones, Emil Souleimanov and Arsène Saparov believe that the Bolsheviks awarded this autonomy to the Ossetians in exchange for their help against the Democratic Republic of Georgia, since this area had never been a separate entity prior to the Russian invasion. The drawing of administrative boundaries of the South Ossetian AO was quite a complicated process. In addition to Ossetian-inhabited parts of Gori Uyezd and Dusheti Uyezd of Tiflis Governorate, parts of Racha Uyezd of Kutaisi Governorate (western Georgia) were also included within the South Ossetian AO. All these territories historically had been indigenous Georgian lands. Many Georgian villages were included within the South Ossetian AO despite numerous protests by the Georgian population. While the city of Tskhinvali did not have a majority Ossetian population, it was made the capital of the South Ossetian AO.\nHistorical Ossetia in the North Caucasus did not have its own political entity before 1924, when the North Ossetian Autonomous Oblast was created. South Ossetia requested to be united with North Ossetia in 1925; however, this request was denied. Ossetian mass migration to Tskhinvali took place during the Soviet era. The opening of Roki Tunnel in 1985 made the overland communication between North and South Ossetia possible.\nThere was no conflict between Georgians and Ossetians during the Soviet era. Within South Ossetia, Georgian and Ossetian villages were tangled. Around 65 thousand Ossetians lived in South Ossetia, while 100 thousand lived in Georgia proper. Ossetians living in Georgia proper had better commanding of the Georgian language than other ethnic minorities living in Georgia. South Ossetia had a Georgian ethnic minority of around 28,500 out of the total population of 98,500 in 1989.\nDissolution of the Soviet Union and the 1991-1992 war\nNationalism in Soviet Georgia gained momentum in 1989 with the weakening of the Soviet Union. The Kremlin endorsed South Ossetian nationalism as a counter against the Georgian independence movement. It was the KGB that stoked the ethnic tensions. In 1988, the South Ossetian activists had established South Ossetian Popular Front (Adamon Nykhas).\nOn 10 November 1989, the Georgian Supreme Soviet was asked by the South Ossetian regional council to upgrade the region to the status of an autonomous republic. The resolution of the South Ossetian authorities to create the South Ossetian ASSR escalated the conflict and this decree was canceled by the Georgian Supreme Soviet on 11 November 1989. The First Party Secretary of the oblast was removed from his position. Georgian civilian march on Tskhinvali was organized on 23 November 1989; however, it was stopped at the entrance of the city by Ossetians and Soviet troops and there were victims. The Georgian Supreme Soviet passed a law against regional parties in summer 1990 and South Ossetians responded by issuing a declaration of sovereignty as part of the Union of Soviet Socialist Republics on 20 September 1990. In October 1990, the Georgian parliamentary elections were won by \"Round Table\" block, headed by Zviad Gamsakhurdia. Georgian elections were ignored by South Ossetians. Instead, separate Ossetian elections were appointed in December 1990. On 11 December 1990, the Supreme Soviet of Georgia, responding to South Ossetia's attempt at secession, annulled the region's autonomy.\nWhen the Georgian parliament issued a decree proclaiming a state of emergency in the territory of the former South Ossetian AO on 12 December 1990 in response to the deadly clashes, both Georgian and Russian interior troops were sent to the region. The post of the mayor of Tskhinvali was given to Georgian police commander. National Guard of Georgia was legally established in early January 1991. A military conflict broke out between Georgia and South Ossetian separatists in January 1991. Mikhail Gorbachev, leader of the Soviet Union, canceled decisions of both South Ossetian and Georgian Supreme Soviets regarding the status of South Ossetia in January 1991. Although South Ossetia was a part of Georgia during the declaration of independence of Georgia in April 1991, it decided to secede on 21 December 1991. A referendum to join Russia was held in January 1992, in which no Georgian resident of South Ossetia voted.\nIn Spring 1992, the South Ossetian separatists were aided by the former Soviet military units now controlled by Russia. Russian military supported the South Ossetians possibly to secure the ground in the South Caucasus. The fighting was concentrated around Tskhinvali and on the road leading to North Ossetia. Many Georgian and Ossetian villages in the region were destroyed as a result of the armed hostilities. By June 1992, the possibility of a full-scale war between Russia and Georgia increased as bombing of Georgian capital Tbilisi in support of South Ossetian separatists was promised by Russian authorities. Georgia endorsed a ceasefire agreement on 24 June 1992 to prevent the escalation of the conflict with Russia. The agreement ended the hostilities. Estimates of deaths in this war are around 1,000 people. About 100,000 Ossetians left Georgia proper and South Ossetia. 23,000 Georgians left South Ossetia. However, South Ossetia's political status was not dealt with by the ceasefire agreement. A Joint Control Commission for Georgian–Ossetian Conflict Resolution and peacekeeping force of Russian, Georgian and Ossetian troops was established. The Conflict Zone was defined as an area within a 15-km radius from Tskhinvali where the JPKF was active. The North Ossetian peacekeeping unit included peacekeepers from South Ossetia. The arrangement, where Georgian side had to work with three rival sides, was disparaging for Georgia. South Ossetian Supreme Council passed a resolution on independence from Georgia and joining Russia on 19 November 1992.\nTskhinvali was abandoned by numerous Georgian residents. Some, mostly ethnically Georgian parts of the former South Ossetian Autonomous Oblast remained under the Georgian control. The Tskhinvali-based separatist authorities of the self-proclaimed Republic of South Ossetia were in control of one third of the territory of the former South Ossetian Autonomous Oblast before the 2008 war. The separatists controlled the districts of Tskhinvali, Java, Znauri and parts of Akhalgori Municipality, while the Georgians administered the rest of Akhalgori and the Georgian villages in the Tskhinvali district. According to one source, Georgians controlled one-third of South Ossetia since the 1991-1992 war.\nGeorgian-Abkhaz conflict\nAbkhazia during the Soviet era\nThe Abkhaz are an ethnic group linguistically related to the Circassian groups of the North Caucasus. Historically, the Abkhaz way of life and political culture were closely related to Georgia. After the Russian annexation of Abkhazia in the 19th century, Russian language became the second language of the Abkhaz people instead of Georgian and the further advances of the Russian language during the Soviet time contributed to the estrangement of the Abkhaz and Georgian peoples. After the Russian Revolution of 1917, Abkhazia shifted between Bolshevik and Menshevik control before finally being conquered by the Bolshevik-controlled Red Army in 1921. Abkhazia was designated as a treaty republic with autonomy within the Transcaucasian Socialist Federative Soviet Republic in 1922 by the Bolsheviks. However, in 1931, Abkhazia's status was changed to an autonomous republic of Georgia. After 1936, a pro-Georgian policy was enacted apparently at Joseph Stalin's whim. Georgians were awarded most political posts. Mass immigration of non-Abkhaz peoples ensued, diluting the Abkhaz community to a meager 18% of Abkhazia's overall population by 1939.\nAlthough the Abkhaz regarded the transfer of Abkhazia to Soviet Georgia in 1931 as immoral, the downgrade of the status of Abkhaz SSR was not an isolated case since SSR status was only given to large-sized groups per Soviet nationality policy. Russia viewed the preservation of SSR status of Abkhazia as likely threat to Russia itself mainly due to the status of the nations of the North Caucasus. Although the Abkhaz believe that Stalin downgraded the status of Abkhazia in 1931 due to his ethnicity, Abkhazia had been made a sovereign soviet republic in 1921 due to Stalin's role. Abkhaz began to blame all Georgians for the deeds of Stalin and Lavrentiy Beria because they were of Georgian origin.\nAbkhazia's comparative wealth enabled the Abkhaz people to extract considerable compromises from the Soviet governance. Although the Soviets repeatedly refused to grant Abkhazia separation from Georgia, they did give the Abkhaz enlarged autonomy and financial donations to improve their infrastructure. During the 1970s the Abkhaz gained increasing control of Abkhazia's administration, the control of ethnic Georgians likewise decreasing, and by the 1980s the Abkhaz filled 67% of the government's minister positions and 71% of the Oblast committee leader positions. Considering that the Abkhaz minority within Abkhazia had by 1989 fallen to just 17.9%, this would indicate that the Abkhaz held a disproportionate share of the high-level administration.\nGrowing prominence of the Abkhaz people angered Georgians living in Abkhazia who claimed they were being discriminated. This rift precipitated the so-called \"ethnic battles\" of the 1970s and 80s which, although fought between different ethnic groups, were largely economic in nature. The Abkhaz viewed the Georgians as would-be defectors from the Soviet Union, whereas the Georgians criticized the Abkhaz for supporting the Soviet Union. The other ethnic groups living in Abkhazia favored maintaining the status quo, and thereby the Soviet Union, and thus tacitly supported the Abkhaz factions.\nDissolution of the Soviet Union and the 1992-1993 war\nTensions grew in 1989 when the request to separate from Georgia and joining Russia was issued by the meeting of ethnic Abkhaz in the village of Lykhny. Gamsakhurdia's pro-Georgian movement responded with counter-demonstrations of its own and the region became fractured over ethnic ties which led to deadly clashes. On August 25, 1990, Abkhazia was declared as a union state of the USSR by the Abkhaz Supreme Soviet. Vladislav Ardzinba became the chairman of the Abkhaz Supreme Soviet in December 1990. Ardzinba's appointment was sanctioned by Georgia's leader Gamsakhurdia. According to former Russian Foreign Minister Andrei Kozyrev, when the Soviet Union began to disintegrate, the Soviet leadership decided to use the threat of the loss of Autonomous Soviet Socialist Republics against the seceding Union republics and deployed Ardzinba, who lived and worked in Moscow, to Abkhazia to facilitate Abkhazia's separation from Georgia.\nThe Abkhaz, like the South Ossetians, strongly favoured the continuation of the Soviet Union and distrusted the Georgian authorities; 99% of the Abkhaz voting in the referendum voted for sustaining the Soviet Union in March 1991. Ardzinba requested the deployment of the Russian airborne battalion in Sukhumi in response to Gamsakhurdia's anti-Soviet rhetoric in March 1991. After August 1991, Zviad Gamsakhurdia reached an agreement with the Abkhaz community on the new structure of the 65-seat legislative organ of Abkhazia, which gave the Abkhaz minority 28 mandates. More numerous Georgian community of Abkhazia was given only 26 seats. After September 1991 elections, the majority of 11 representatives of other ethnicities of Abkhazia joined the Abkhaz camp.\nThe overthrow of Gamsakhurdia and spilling of the Georgian Civil War into Abkhazia contributed to the escalation of tensions between Sukhumi and Tbilisi. In March 1992, Eduard Shevardnadze replaced deposed Gamsakhurdia as the leader of Georgia. Georgian parliamentarians in Abkhazia established their own organs in Abkhazia in May 1992. In June 1992, Abkhazia's leader Ardzinba proposed to form either a federation or confederation with Georgia. Abkhaz parliamentarians adopted 1925 Constitution in July 1992 and sought to revise the status of Abkhazia, which led to the crisis. However, 1925 Constitution contained outdated legal definitions such as Abkhazia being the Soviet state within the Transcaucasian Soviet Republic. Legally, two-third votes of the parliament was required for the declaration of independence. The actual supporters of the decision were less but still a majority. Abkhaz leadership apparently counted on Russia when they began to defy Georgian authorities before the war.\nRussia did not achieve its goals in Georgia through the means of the conflict in South Ossetia, which ended by July 1992. Ardzinba's group probably calculated that Georgia's reaction to Abkhazia's declaration of independence would be weak due to Russia already exercising sway on Georgia due the South Ossetian conflict. Ardzinba was probably emboldened by Russia when he declared in late July that Abkhazia was \"strong enough to fight Georgia\". The Abkhaz separatists had an incentive for the war to reduce the Georgian population of Abkhazia. Moscow transferred heavy weaponry of the Transcaucasian Military District to the Tbilisi government in July 1992, effectively arming it to wage the war. The loss of Abkhazia would mean the loss of significant part of the sea coast of Georgia.\nIn August 1992, war broke out when the National Guard of Georgia entered Abkhazia to free captive Georgian officials, and to reopen the railway line. Ardzinba allegedly knew in advance of the Georgian deployment, according to Georgian authorities. Reportedly, Abkhaz troops were the first to open fire. Georgian soldiers moved to Sukhumi and took government buildings and looted the city. Eduard Shevardnadze, Georgia's leader, did not need another war soon after South Ossetia, but was reluctant to condemn the national guard's commander, Tengiz Kitovani, who allegedly led the incursion into Sukhumi unauthorized. Abkhaz separatist government retreated to Gudauta where the Russian military base was located. Russian military did not impede the crossing of the Russia-Georgia border by the North Caucasian militants into Abkhazia. On 3 September 1992, Ardzinba met with Shevardnadze and Russian president Boris Yeltsin in Moscow. Ardzinba officially agreed to the deployment of Georgian forces in Abkhazia. However, the hostilities soon resumed. The capture of Gagra by Shamil Basayev in October 1992 enabled the Abkhaz to gain control of the border with Russia. Russian political establishment originally did not support the Abkhaz side, although this situation later changed. Some people in the Russian political circles despised Shevardnadze for his role in the Dissolution of the Soviet Union and therefore took the Abkhaz side. Russian military assisted the Abkhaz separatists. Russian military jets conducted aerial strikes against Georgians in Sukhumi. Large numbers of Georgian residents of Abkhazia did not participate in the armed hostilities.\nThe armed hostilities in Abkhazia lasted until Russia negotiated a ceasefire in July 1993 with the Sochi Agreement and Georgian weaponry was withdrawn from Abkhazia. Russian defence minister Pavel Grachev, friend of Tengiz Kitovani, played pivotal role in brokering the ceasefire. The ceasefire agreement was accepted by Shevardnadze in order to prevent a clash with Russia. Normal life resumed in Sukhumi as Georgian residents came back. The ceasefire was violated in September of that year as the Abkhaz began to storm Sukhumi and overran it on 27 September. Most Georgian officials in the parliament building were executed. The Russian military permitted the violation of July 1993 ceasefire since Georgia still had not become a member of the Commonwealth of Independent States (CIS). Numerous Georgians died during their flight from Abkhaz attack which succeeded in capturing the most part of Abkhazia by the end of September. Total casualties of the war were 20,000 dead. According to some estimates, the population of Abkhazia was probably reduced to less than 150,000 after an ethnic cleansing of Georgians, a decrease from 535,600 before the war. Georgian internally displaced persons from Abkhazia numbered 250,000.\nA declaration of independence was made by the People's Assembly of Abkhazia on 10 February 1994 in violation of the earlier agreement to hold a referendum. The Declaration on Measures for a Political Settlement of the Georgian-Abkhaz Conflict was adopted on 4 April 1994. Russian peacekeepers under the mandate of the CIS arrived in Abkhazia in May 1994. The United Nations Observer Mission in Georgia (UNOMIG) later sent its monitors.\nThe upper Kodori Gorge (in northeast Abkhazia) remained beyond the unrecognised Abkhaz separatist government's control after the war.\nRussia in the Caucasus\nRussian interests\nHistorically, empires have clashed over the geopolitically important region of the Caucasus, whose fortune lies in the fact that it can fulfill not only the role of bridge between neighboring regions and powers. Transcaucasia lies between the Russian region of the North Caucasus and the Middle East, constituting a \"buffer zone\" between Russia and the Middle East. It borders Turkey and Iran. The strategic importance of the region has made it a security concern for Russia. Significant economic reasons, including access to major petroleum reserves, further affects interest in Transcaucasia. Rule over Transcaucasia, according to Swedish academic Svante Cornell, would allow Russia to manage Western involvement in Central Asia, an area of geopolitical importance.\nThe crucial state of the Caucasus region is Georgia. Sway over Georgia means strategic sway over Eurasia. Russia saw the Black Sea coast and being adjacent to Turkey as invaluable strategic attributes of Georgia and regards the Turkish influence as a risk to its interests in the Caucasus. The coastline of Abkhazia and shady businesses in Abkhazia and South Ossetia also incentivised Russian security system to become involved in Georgia's affairs. Russia had more vested interests in Abkhazia than in South Ossetia, since the Russian military deployment on the Black Sea coast was seen as vital to Russian influence in the Black Sea. Before the early 2000s, South Ossetia was originally intended as a tool to retain a grip on Georgia. Russia also understood the significance of the influence of South Ossetia on the situation in North Ossetia and the stability in the entire North Caucasus.\nRussia leveraged the \"frozen conflict\" scheme by establishing purely pro-Russian areas that can be controlled by Russia without much resistance by means of ethnic cleansing and by managing to gain the status of the negotiator, and thereafter to actually prevent peaceful settlement to subdue Georgia. In early 90s, it was the GRU that was responsible for providing Abkhaz and South Ossetian military with weapons and instructions. According to Estonian source, GRU officer Anton Surikov (also known as Mansur Nachoev in the North Caucasus) is believed to be one of the organizers of the war in Abkhazia. Surikov also participated in the overthrowing of independent Georgia's first president Zviad Gamsakhurdia. Russian involvement in Georgia in the 90s was one of the first uses of hybrid warfare tactics whereas the Russian invading troops fought secretly in the conflict areas and after Russian victory, they became peacekeepers. Russia has been portraying the Georgian conflicts as ethnic ones. Russian propaganda focused on a \"genocide\" perpetrated by Georgia against \"small nations\" to influence international opinion against Georgia. The territorial dispute on Abkhazia and South Ossetia is actually the conflict between Russia and Georgia.\nRelations between Russia and Georgia (until 2004)\nSvante Cornell writes that Georgia \"suffered the largest amount of Russian interference in its domestic affairs\" since 1988. In April 1989, Soviet military assaulted Georgian demonstration demanding independence in Tbilisi and murdered several protesters. In November 1989, Georgian Supreme Soviet denounced the Soviet invasion of Georgia in violation of the bilateral treaty of 7 May 1920. Georgia declared its restoration of independence on 9 April 1991, thus becoming the first non-Baltic state of the Soviet Union to do so. Since independence in 1991, Georgia has always had troubled relations with Russia. Edward Thomas writes, \"The independence of Georgia challenged this ability to assert Russian hegemony in the Caucasus.\" The first pro-independence government of independent Georgia lasted for nine months before it was deposed. The Georgian Civil War began, in which Russia supported both Gamsakhurdia and his opposition.\nSince Russian military saw the new Georgian leader Eduard Shevardnadze, who came to Georgia in 1992, as responsible for the result of the Cold War, they were aiding his enemies. Shevardnadze's reputation in the United States and Germany helped to end an international isolation of Georgia and facilitated the rapid humanitarian aid from the United States. During the Georgian Civil War in late 1993, Russia hinted that in addition to admission of the Russian military bases, Georgia's accession to the Commonwealth of Independent States would be a solution to the issues of Tbilisi. This, combined with other factors, compelled Georgian leader Shevardnadze to agree to Russian demands and the Russian military intervention began, which led to the defeat of Zviadists in the war. Shevardnadze made a number of successes in rebuilding of Georgia since 1993 and it was Georgia that resisted the Russian attempts to dominate the post-Soviet space. Several assassinations of Shevardnadze were attempted allegedly by Russia. Georgian Security Minister Igor Giorgadze was suspected in organizing an unsuccessful assassination attempt on Shevardnadze in 1995. Giorgadze fled Georgia from Russian military aerodrome. Russia also sought to undermine Georgia after 1994 in order to subvert oil transportation routes from Azerbaijan. According to former Russian ambassador to Georgia Felix Stanevsky, Russian political circles helped Eduard Shevardnadze to win 2000 Georgian presidential election.\nVladimir Putin became president of the Russian Federation in 2000, which had a profound impact on Russo-Georgian relations. The conflict between Russia and Georgia began to escalate in December 2000, when Georgia became the first and sole member of the Commonwealth of Independent States (CIS) on which the Russian visa regime was enforced. Eduard Kokoity, an alleged member of the mob, became de facto president of South Ossetia in December 2001; he was endorsed by Russia since he would subvert the peaceful reunification of South Ossetia with Georgia. The Russian government began massive allocation of Russian passports to the residents of Abkhazia and South Ossetia in 2002 without Georgia's permission; this \"passportization\" policy laid the foundation for Russia's future claim to these territories. Vladimir Putin said at the Russian parliament in April 2005 that the Dissolution of the Soviet Union \"was the greatest geopolitical catastrophe of the century\".\nIn August 2002, Russia bombed the Georgian territory, which was criticized by the United States Department of State. In September 2002, Vladimir Putin claimed that Georgia was harboring the terrorists responsible for the September 11 attacks and threatened that Russia would use the right to self-defense and conduct the strikes against the terrorists on the Georgian territory. In 2003, President Putin began to consider the possibility of a military solution to the conflict with Georgia.\nUnresolved conflicts\nDispute surrounding the appearance of the Ossetian people in the South Caucasus has been one of the causes of conflict. Although Georgian historiography believes that Ossetian mass migration to the South Caucasus (Georgia) began in the 17th century, Ossetians claim to have been residing in the area since ancient times and that present-day South Ossetia is their indigenous area of settlement. Since it was created after the Russian invasion of 1921, South Ossetia was regarded as unnatural creation by Georgians during the Soviet era. No evidence exists to back up the Ossetian claims of being indigenous to the territory of South Ossetia. Some Ossetian historians accept that the massive influx of Ossetian ancestors to present-day South Ossetia happened after the 13th-century Mongol invasions, while one South Ossetian de facto foreign minister in the 1990s established that Ossetians massively appeared in the area in the 17th century at the earliest. Georgian politicians viewed the conflicts as not about the hostility between the ethnic groups, but about the preservation of Georgia's borders and struggle against separatists regardless of their ethnicity. Georgian society has never wanted to allow the secession of South Ossetia.\nIn 1996, Lyudvig Chibirov won the presidential elections in South Ossetia. Georgian and South Ossetian sides adopted a memorandum on \"Measures for providing security and confidence building\" in Moscow on 16 May 1996. This memorandum was seen as the beginning of the reconciliation between Georgian and South Ossetian authorities. Afterwards, several meetings were held between the President of Georgia, Eduard Shevardnadze, and the de facto President of South Ossetia, Lyudvig Chibirov. They met in Vladikavkaz in 1996, in Java in 1997, and in Borjomi in 1998, where the leaders discussed a political settlement. After 1999, the chances of peaceful resolution to the conflicts ostensibly decreased as Georgia-Russia relations began to deteriorate. There was a possibility of agreement on reunification of South Ossetia with Georgia between South Ossetian leader Lyudvig Chibirov and Georgian leader Eduard Shevardnadze in 2000. Signing of an agreement on granting of autonomy to South Ossetia within Georgia between South Ossetian and Georgian presidents was unacceptable for the Russian authorities and the Russian security services made sure that 2001 presidential elections in South Ossetia would be won by Eduard Kokoity. Kokoity set the task of unleashing a war against Georgia as the only way to achieve the independence of South Ossetia during his first meeting with his staff and the South Ossetian public.\nThere were no military clashes for twelve years (between 1992 and 2004) in South Ossetia as South Ossetians and Georgians were conducting business. In 1996, the market for trading for Georgians and South Ossetians was established in Ergneti. The goods were smuggled from Russia into Georgia through Ergneti. Such illegal activities as kidnapping, illegal drug trade and arms trafficking flourished, with some authorities and law enforcement officers both from South Ossetia and Georgia proper allegedly being involved in criminal enterprise until the end of 2003. Russian customs and peacekeepers also profited from illegal economic activities.\nRussian passportization\nOn 31 May 2002, the Law on Russian Federation Citizenship came into force. The new law eased obtaining of Russian passports for ex-Soviet citizens living outside of Russia. Many residents of Abkhazia and South Ossetia applied for citizenship voluntarily. According to Russian source, Aleksandr Voloshin could have been responsible for the wholesale distribution of the Russian passports. By 2008, most residents of South Ossetia had obtained Russian passports. The Russian passportization policy caused the population, living on the disputed Georgian territories, to become subjects of Russia and made it possible for Russia to intervene on the pretext of protection of Russian nationals. According to the Russian constitutional law, the legal status of Russian passport-holders in South Ossetia equals to that of Russian citizens residing in Russia. According to an EU report, this position is inconsistent with international law (which considers most allegedly-naturalised people as not Russian citizens). The Abkhaz and South Ossetians are extraterritorial citizens of Russia not residing in Russia and are not obliged to serve in the Russian military or pay taxes to the Russian government. They are considered as Georgian citizens by the Georgian government. Researcher Florian Mühlfried observed: \"Whereas the Georgians use territorial claims to substantiate citizenship, the Russian government exploits citizenship to justify territorial claims.\" In 2008, Georgian government recovered 50 Russian passports retrospectively issued for South Ossetians.\nAttempts at conflict resolution in 2004-2007\nand Georgian President Mikheil Saakashvili in Tbilisi, May 2005]]\nIn 2004, Mikheil Saakashvili came to power after Georgia's Rose Revolution, which ousted president Eduard Shevardnadze. In the years that followed, Saakashvili's government pushed a programme to reinforce state institutions, and created \"passably democratic institutions\" and instituted what was viewed as a pro-US foreign policy.\nRestoring South Ossetia and Abkhazia to Georgian control was an important task for Saakashvili. The restoration of Georgian sovereignty over Adjara and Saakashvili's plans of bringing back Abkhazia and South Ossetia into Georgian fold angered Russia. The Georgian government launched an initiative to curb smuggling from South Ossetia in 2004 after its success in restoring control in Adjara. Tensions were further escalated by South Ossetian authorities. Tensions caused by anti-smuggling campaign soon led to the hostilities. Intense fighting took place between Georgian forces and the South Ossetians between 8 and 19 August 2004. Georgian authorities claimed that Russian peacekeepers were on the side of South Ossetia and called for convening a peace conference on South Ossetia, to which Russia resisted.\nSeveral peace proposals, mainly envisaging South Ossetia within Georgia's borders, were made following the 2004 hostilities. Although the Georgian government wanted to achieve settlement through non-military means, it also observed that Russian support of Ossetian separatists undermined the peace process. At the Parliamentary Assembly of the Council of Europe in Strasbourg in January 2005, Georgian president Saakashvili proposed a peace settlement for South Ossetia within a unified Georgian state. The proposal was rejected by South Ossetian leader Eduard Kokoity.\nIn October 2005, the Parliament of Georgia adopted a unanimous resolution calling on the government to demand the withdrawal of the Russian peacekeepers if their behavior did not change. Prime Minister of Georgia Zurab Nogaideli unveiled a new peace plan on South Ossetia at the OSCE meeting in Vienna, which envisaged OSCE, EU and US participation in the mediation. The Georgian ambassador to the UN appealed to the United Nations Security Council to establish the UN peacekeeping operation in Abkhazia.\nIn mid-July 2006, the Georgian parliament requested the withdrawal of all Russian peacekeeping forces from Georgia. Russian Foreign Minister Sergey Lavrov said that Russia would protect its citizens and peacekeepers. South Ossetian leader Kokoity said that \"Russian peacekeepers were, are and will be in the zones of Georgian-Abkhaz and Georgian-Ossetian conflicts.\"\nIn late July 2006, Georgia sent security forces to the Kodori Valley region of Abkhazia, when a local militia leader rebelled against Georgian authorities. The presence of Georgian forces in the Kodori Gorge continued until the war in 2008. In August 2006, ataman of Don Cossacks Nikolay Kozitsyn promised Abkhaz leader Sergei Bagapsh to send up to 15 thousand military volunteers to help Abkhazia.\nIn September 2006, Georgian president Saakashvili declared at the 61st session of the United Nations General Assembly that separatist Georgian regions were annexed by Russia and proposed the deployment of international contingent in Abkhazia and South Ossetia.\nIn February 2007, Minister of Foreign Affairs of Georgia Gela Bezhuashvili said that Eastern European countries could replace the Russian peacekeepers, but the Russian withdrawal was \"not an easy task\". The European Union and Ukraine expressed readiness to deploy peacekeepers to Georgia and Poland would consider its involvement in an international peacekeeping operation.\nIn early 2007, Georgia established what Russia called a \"puppet government\" in South Ossetia, led by Dmitry Sanakoyev (former South Ossetian prime minister), calling it a provisional administration. According to observers' opinion, after Sanakoyev started to compete with Kokoity in South Ossetia, the latter began escalating tensions in the region to provoke the conflict in order draw Russia in. A peaceful opposition campaign against pro-Russian leader Kokoity, Kokoity Fandarast, began in early August 2007. Russian Foreign Minister Sergey Lavrov said in mid-August 2007 in North Ossetia that he wanted the unity of North and South Ossetians. Pro-Georgian government of South Ossetia organized free trips and vacations on Georgia's sea coast for the Ossetians. Pro-Russian separatist leader Kokoity prohibited vacations in Adjara. In October 2007, the Georgian government organized a concert of Boney M. in Tamarasheni in Georgian-controlled South Ossetia, less than a kilometer away from Tskhinvali.\nRusso-Georgian relations and incidents after 2004\nA car without license plates exploded near the police building in Gori, Georgia on 1 February 2005. Several suspects were arrested in July 2005, with one of the arrested admitting that the terrorist attack in Gori was organised by the Russian GRU and he was trained by Russian instructors in a military camp near Tskhinvali.\nIn February 2005, Russian defence minister Sergei Ivanov accused Georgia of aiding terrorism in Chechnya. During his visit to Georgia, Russian foreign minister Sergey Lavrov did not honor the Georgian soldiers killed for the territorial integrity of Georgia, which caused Georgia's displeasure.\nIn 2005, an agreement was reached between Russia and Georgia that the Russian military bases in Georgia would leave by 2008. After the last Russian non-peacekeeping military personnel left Georgia in November 2007, Russia decided to escalate hostility against Georgia.\nIn January 2006, explosions on the Russian pipeline dealt a blow to Russian gas supplies to Georgia and weather conditions damaged the electricity lines from Russia to Georgia, which caused a crisis in Georgia. Georgia criticized Russia for this blockade. In March 2006, the Russian Federal Service for Surveillance on Consumer Rights Protection and Human Wellbeing banned the import of the Georgian wines into Russia, which was seen as politically motivated by Georgia.\nIn May 2006, Deputy Prosecutor-General of Russia Vladimir Kolesnikov announced that Georgian terrorist suspect Igor Giorgadze would be given political asylum in Russia. In response, the Georgian Foreign Ministry protested to Russian ambassador Vladimir Chkhikvishvili. In September 2006, 29 supporters of Igor Giorgadze were arrested for the preparation of the Coup d'état in Georgia. The Georgian authorities accused the Russian intelligence agencies of financing Giorgadze's Georgian party. Giorgadze has himself stated that he could not enter Russia until President Putin's approval because Boris Yeltsin was on the side of pro-American Eduard Shevardnadze; he resided in Serbia and the Middle East until Putin's presidency.\nAfter Georgia deported four suspected Russian spies in 2006, Russia began a full-scale diplomatic and economic war against Georgia, accompanied by the persecution of ethnic Georgians living in Russia. Schools in Moscow had to report Georgian students to the authorities. Russian writer Boris Akunin believed that he was targeted by Russian tax authorities for his ethnic Georgian origins. Accounts Chamber of Russia found embezzlement of budget funds at Russian Academy of Arts headed by Georgian sculptor Zurab Tsereteli. Russian company Gazprom raised the price of natural gas for Georgia. According to Kommersant, the 2006 incident involving the exile of the GRU officers provoked a \"large-scale confrontation between the Russian Federation and Georgia, which led to war after two years.\"\nGeorgia reported that three Russian helicopters attacked the Georgian villages in the Kodori Gorge on 11 March 2007.\nIn June 2007, Lithuanian website Delfi suggested that a war between Russia and Georgia would break out after 2008 Russian presidential election because a new Russian president needed to strengthen his position. The war would most likely be waged by the separatist armies with Russian support and the goal would be undermining of the pro-western Georgian government. The editorial suggested that like the Soviet attack on Finland in 1939, Russians, Abkhazians or Ossetians would shoot at themselves, then the Russian side would announce the beginning of armed hostilities and Russian-backed separatist forces would launch an attack on the Georgian-controlled villages claimed by the separatists. The deployment of international peacekeeping forces to Abkhazia and South Ossetia was proposed as a way to avert the escalation of the conflict.\nGeorgian authorities said in early August 2007 that Russian warplanes entered Georgian airspace and dropped a bomb on the village of Tsitelubani; however, Russia denied the responsibility. Georgian president Mikheil Saakashvili explained why he did not order to shoot down the Russian warplanes: \"We are not in a state of war with Russia. We are not going to war with Russia.\" International investigators confirmed that Russian warplanes were responsible for the bombing, but the Russians instead accused Georgia of staging the incident. In late August 2007, Georgian officials reported to have possibly downed the Russian plane over the Kodori Gorge, but Russia denied that its planes were flying in the region. Anatoly Zaitsev, Chief of the General Staff of Abkhazia, confirmed that a plane had crashed in the Kodori Gorge and suggested that the plane could have been American spy plane. Later, he retracted his statement on the American origin of the plane, instead stating that the plane was not Russian.\nIn September 2007, a clash took place between Georgian and Abkhaz troops in the Tkvarcheli District. According to Georgia, the Abkhaz saboteurs were attempting to blow up the road under construction in the Georgian-controlled Kodori Gorge. Two Russian officers serving in the Abkhaz army were killed in this incident. One of the killed Russians had previously served in the Collective Peacekeeping Forces in Abkhazia. After the incident, Abkhaz president Bagapsh prematurely left the international investment forum in Sochi chaired by Vladimir Putin and returned to Sukhumi. Abkhaz de facto authorities demanded the release of the captured Abkhaz servicemen, otherwise Abkhazia would launch a special operation to reclaim the upper Kodori gorge. Permanent Representative of Russia to the United Nations Vitaly Churkin said that the Georgian forces had attacked the Abkhaz-controlled territory and killed two Russian instructors at the anti-terrorist training center. Georgian president Saakashvili mentioned the incident involving former Russian peacekeeper at a session of the United Nations General Assembly and demanded the replacement of the Russian peacekeepers with independent contingent. Abkhaz authorities decided to deploy its army to the border with Georgia and South Ossetian forces were put on elevated combat alert. South Ossetian interior minister Mikhail Mindzaev said that South Ossetia now possessed significant forces and means and could mobilize additional forces. He said, \"I will give the order to go to the end - right up to Tbilisi.\"\nIn October 2007, Russian peacekeepers advanced into the Georgian village of Ganmukhuri in Samegrelo-Zemo Svaneti from Abkhazia and captured Georgian policemen. A stand-off developed between the Georgian interior ministry commandos and Russian troops. Georgian president Saakashvili arrived in Ganmukhuri and declared Sergey Chaban, the Russian commander of peacekeepers in Abkhazia, as persona non grata. Russian peacekeepers shot a video of their actions, which was seized by Georgian Rustavi 2 TV and subsequently aired. According to Assistant Commander of the Collective Peacekeeping Forces in Abkhazia, Russian peacekeepers were searching for the pigs infected with African swine fever virus when the Georgian policemen suddenly attempted to attack the Russians. Russian media reported that Russia was on the verge of the war. Georgian foreign minister Gela Bezhuashvili stated that Georgia had not officially approved the CIS decision on appointing Chaban in early October. Russian military official said that Chaban would not leave Georgia yet. The next day, Georgia cited Russian ambassador to Georgia Vyacheslav Kovalenko for the incident. Members of the Georgian parliament met with the interior, defense and foreign ministers. After the meeting, a decision on the withdrawal of Russian peacekeepers was announced. According to a 2003 agreement between presidents of Russia and Georgia, Russian peacekeeping mandate could be terminated by the demand of a single party of the conflict. The Russian foreign ministry urged the Russian peacekeepers in Georgia \"to show restraint and keep calm\". Deputy Assistant Secretary of State for European and Eurasian Affairs Matthew Bryza said: \"This is an incident that sways all attempts to resolve the Abkhaz conflict in the wrong direction.\"\nIn January 2008, Vladimir Zhirinovsky, the leader of the Liberal Democratic Party of Russia, congratulated Saakashvili with re-election and sent condolences to the Georgian opposition. Saakashvili declared that his priority was establishing friendly relations with Russia.\nRussian involvement in South Ossetia\n|width = 30em}}\nRussia and South Ossetian authorities began to stockpile weaponry and armed troops in South Ossetia in May 2004. South Ossetian military officers began studying at the Vladikavkaz military academy in Russia. Russian officers began holding positions in the security and defense institutions of South Ossetia since 2005. The Federal budget of Russia began financing South Ossetian troops. South Ossetia began arming with offensive weaponry in violation of the Sochi agreement and acquired tanks, artillery, grenade launchers, Multiple rocket launchers, armoured vehicles and helicopters. Russian journalist Semyon Novoprudsky has suggested that the war in August 2008 would not have happened if Russia had forced the Kokoity regime to negotiate with Georgia's central government instead of arming it.\nIn 2005, Georgia accused Russia of the annexation of its internationally recognized territory. Researcher Cory Welt noted in 2005 that Russian role in South Ossetia and actions were subverting the peace settlement.\nA joint session of the governments of South Ossetia and North Ossetia–Alania was held in March 2006. Assistant of Mikhail Fradkov, Prime Minister of Russia, declared that the Russian leadership had made a decision to annex South Ossetia to Russia. Arizona Senator John McCain commented on his visit to Tskhinvali in August 2006 that \"the attitude there is best described by what you see by driving in [Tskhinvali]: a very large billboard with a picture of Vladimir Putin on it, which says 'Vladimir Putin Our President'.\"\nBy August 2008, South Ossetia's de facto government predominantly employed Russian citizens, who had occupied similar government posts in Russia, and Russian officers dominated South Ossetia's security organisations. According to the EU report, Russian control of governance in South Ossetia made South Ossetia's assertion of independence dubious. According to Reuters, Russia supplied two-thirds of South Ossetia's yearly budget before the war. The trend of Russian officials holding significant positions in the government of South Ossetia continued after the 2008 war.\nKomsomolskaya Pravda reported in September 2008 that many Russian military servicemen served in the Abkhaz army, among them Anatoly Zaitsev, and all commands were given in Russian. Former Prime Minister of South Ossetia Yury Morozov told Kommersant newspaper in December 2008 that President Eduard Kokoity was aware before the war that \"the post of prime minister, appointed by Moscow, exists for the transparency of financial flows.\"\nKosovo precedent\nRussian Foreign Minister Sergey Lavrov met with the de facto presidents of Abkhazia and South Ossetia on 15 February 2008 and said that Kosovo's independence would cause Russia to bolster Abkhazia and South Ossetia. Some in Russian political circles supported Abkhazia's and South Ossetia's independence even before 2008 Kosovo declaration of independence.\nIn March 2008 Time magazine predicted that \"By splitting the West and the wider international community, the U.S.-backed declaration of independence by Kosovo has given Russia an opening. Countries concerned with separatist problems of their own, from Spain or Cyprus to China, have been unable to follow the U.S. lead in recognizing Kosovo's breakaway from Serbia. And Russia has sought to exploit the gaps that have emerged as a result.\" They went on to say \"Russia [...] tacitly supported breakaway provinces [...] Moscow has also granted Russian citizenship to some 90% of the Abkhazian and South Ossetian populations, giving it grounds to intervene whenever Russia deems it expedient, on the basis of ensuring the security of its citizens.\"\nIn early March 2008, Abkhazia and South Ossetia submitted formal requests for their recognition to Russia's parliament shortly after the West's recognition of Kosovo which Russia had been resisting. Dmitry Rogozin, Russian ambassador to NATO, hinted that Georgia's aspiration to become a NATO member would cause Russia to support the independence of Abkhazia and South Ossetia. The Russian State Duma adopted a resolution on 21 March, in which it called on the President of Russia and the government to consider the recognition.\nIn mid-April, 2008, the Russian Foreign Ministry announced that Russian president Vladimir Putin had given instructions to the federal government whereby Russia would pursue economic and administrative relations with Abkhazia and South Ossetia as with the subjects of Russia. Georgia began proposing the placement of international peacekeepers in the separatist regions when Russia began to apply more force on Georgia after April 2008. The West launched new initiatives for peace settlement, with peace proposals being offered and discussions being organised by European Union, the Organization for Security and Cooperation in Europe (OSCE) and Germany. The separatists dismissed the German project for Abkhazia approved by Georgia. Russia and the separatists did not attend an EU-backed meeting regarding Abkhazia. They also dismissed an OSCE offer to renew talks regarding South Ossetia. Russia was seeking to prolong the conflicts in Georgia and hindered peace settlement in order to keep the conflict zones as tools of pressure on Georgia and to prevent Georgia's NATO membership.\nThe New York Times said in August 2008 \"the decision by the United States and Europe to recognize Kosovo may well have paved the way for Russia’s lightning-fast decision to send troops to back the separatists in South Ossetia.\" NYT also cited a meeting in Brussels in 2008 where Sergey Lavrov, the Russian foreign minister had told western diplomats, among them Condoleezza Rice, that Kosovo's recognition would serve as a precedent for South Ossetia and other separatists. According to the Austin, Texas based intelligence company Stratfor, the support for Kosovos's secession from Serbia by Europe and the United States contributed to Russia's decision to move into South Ossetia in August 2008. According to Stratfor, the cornerstone of European security since World War II was inviolability of state borders; however, this was transgressed in the case of Kosovo, thus setting a precedent for independence of Russia's regions. Russia's demands to keep Kosovo as autonomy within Serbia was disregarded.\nGeorgia's relations with the United States\nJohn Tefft addresses Georgian graduates of the SSOP in June 2007.]]\nLocal conflicts in Georgia (Georgian-Ossetian and Georgian-Abkhaz conflicts) and regional Russo-Georgian conflict are linked to geopolitical conflict between Russia and the United States.\nGeorgia maintained a tight relationship with the United States of America. In 2002, the USA started the Georgia Train and Equip Program to arm and train the Georgian military. In 2003, a US-Georgian bilateral security pact was signed that was seen as unacceptable in Russia. In 2005, a Georgia Sustainment and Stability Operations Program was launched to broaden capabilities of the Georgian armed forces to sustain its contribution in the Global War on Terrorism.\nAccording to American diplomats, South Ossetia was printing about 50% of counterfeit dollar banknotes circulated in the eastern US (as of August 2008). According to Russian journalist Yulia Latynina, the original Russian passport of South Ossetian president Eduard Kokoity bore the portrait of Abraham Lincoln used on the United States five-dollar bill.\nEnergy routes\nAlthough Georgia has no notable oil or gas reserves, its territory hosts part of the Baku–Tbilisi–Ceyhan pipeline supplying oil to Turkey. The pipeline transports  of oil per day. The pipeline transports around 1 percent of global oil supplies. The pipeline circumvents both Russia and Iran. Because it has decreased Western dependence on Middle East's oil, the pipeline has been a major factor in the United States' backing for Georgia.\nRussia, Iran and the Persian Gulf countries opposed the construction of the pipeline. The pipeline became operational on 10 May 2005. The pipeline was the first one built on the non-Russian territory of the former Soviet Union. However, the August 2008 conflict stimulated serious questions about Georgian route and its dependability. Upon its construction, it was considered as the triumph of the Energy policy of the United States and victory over Russia over the energy routes from the Caspian Sea. Georgians viewed the pipeline as a security guarantor. The pipeline contributed to the conflict between Georgia and Russia.\nGeorgia's NATO aspirations\nIn 1994, Georgia became a participant of the Partnership for Peace, a NATO program. Georgia stated before the NATO Summit in Prague in November 2002 that it intended to secure membership in NATO and pursued an Individual Partnership Action Plan (IPAP). However, to join NATO, Georgia was required to update its military to the organization's standards. To perform such reforms, it was suggested that Georgia had to increase its military spending to 2% of its GDP. After Georgia's Rose Revolution in 2003, the Tbilisi government intensified its efforts to integrate Georgia with the West, especially NATO and the European Union. One of President Saakashvili's primary aims for Georgia was to become a member state of NATO, which Russia opposed. This has been one of the major stumbling blocks in Georgia-Russia relations.\nIn 2005, President Mikheil Saakashvili said that Georgia would become NATO member by 2009. Georgia sought membership in NATO for reasons of both security and its own development as a state. Georgia believed that NATO membership would end the Russian hegemony in the Caucasus. The Abkhaz and South Ossetian conflicts would be resolved.\nAccording to the 2007 report of Stockholm International Peace Research Institute (SIPRI), Georgia had the highest average growth rate of military spending in the world. Military expenditures accounted for 6 per cent of GDP. Tbilisi stated that it was not aimed at the breakaway regions of Abkhazia and South Ossetia. According to the 2008 budget of Georgia, defence funding accounted for over 19% of all state expenditures, with a further significant increase approved in a parliament session on 15 July 2008. MP Givi Targamadze attributed this build-up to the country's desire to join NATO.\nGeorgia conducted a NATO membership referendum on 5 January 2008. It was a non-binding referendum on whether to join NATO and was held at the request of the Georgian President, together with an early presidential election and legislative election date referendum. This was announced on November 26, 2007, shortly before Mikheil Saakashvili resigned as President of Georgia for the early presidential elections. The referendum asked: \"do you want Georgia to become a member of the North Atlantic Treaty Organization, NATO?\" According to the official results of Georgia's Central Election Commission, 77% of voters were in favor. The head of Georgia's mission to NATO gave to NATO Secretary General Jaap de Hoop Scheffer on 14 February 2008 a formal request from President Mikheil Saakashvili to offer a Membership Action Plan (MAP) to Georgia.\nDuring the NATO summit in Bucharest in April 2008, American president George W. Bush campaigned for offering a Membership Action Plan (MAP) to Georgia and Ukraine. However, many European NATO countries by April 2008 did not wish to back the American initiative to grant MAP to Ukraine and Georgia. This unwillingness among European countries had been probably resulted from Russian lobbying. Germany and France said that offering a MAP to Ukraine and Georgia would be \"an unnecessary offence\" to Russia. Both Germany and France regarded Georgia and Ukraine as being in the Russian \"sphere of influence\". At the summit, the alliance did not offer a MAP to Georgia or Ukraine. The opponents of Ukraine and Georgia pointed out that internal conflicts existed there. However, NATO stated that Ukraine and Georgia would be admitted in the alliance and pledged to review the requests for MAP in December 2008. NATO Secretary General Jaap de Hoop Scheffer said that Georgia and Ukraine would become members in the future. Georgia welcomed the decision and said: \"The decision to accept that we are going forward to an adhesion to NATO was taken and we consider this is a historic success\".\nThe war in August 2008 was a blow to Georgia's NATO aspirations and countries in western Europe were more reluctant to accept Georgia.\nRussian woes about potential NATO expansion\nCold War memories have influenced Russia's concerns over NATO expansion and Russia still views NATO as a military alliance in the first place. NATO's unilateral intervention in the Kosovo War in the late 90s without Russia's approval contributed to the perception of the alliance in Russia as a political threat and emergence of Putin's regime. According to official Russian military doctrine, the presence of foreign forces near Russia's territory, including in the former Soviet space, constitutes a threat. According to Ariel Cohen, \"By keeping NATO out of the South Caucasus, Russia reserves the right to military intervention in the region without fear of a treaty-obligated allied response under Article 5 of the NATO Charter.\" Russia wanted to avoid the situation where other post-Soviet countries would be influenced by Georgia's accession to NATO and Russian regional interests would be damaged.\nat the 2008 Bucharest Summit]]\nIn 2006, the Russian Foreign Ministry stated that the \"possible accession of Georgia to an unreformed NATO would seriously affect Russian interests,\" and \"would have a negative impact on the fragile situation in the Caucasus\". Russian defense minister Sergei Ivanov announced that Russia would deploy two army divisions to the border with Georgia in the event of Georgia's NATO membership. As Moscow-based military analyst Pavel Felgenhauer contended, countries such as Poland, the Baltic states, and Georgia all sought to join NATO \"to have a guarantee against the Russians.\" As Felgenhauer noted, \"that makes NATO and Russia basically enemies. In a sense they are on a collision course. So a real partnership is hardly possible and any expansion of NATO is seen, in Russia, in Moscow, as a threat to our interests.\"\nRussian foreign minister Sergey Lavrov declared: \"Abkhazia and South Ossetia can't even think about Georgia joining NATO. It's impermissible to play with fire.\" Russian President Vladimir Putin was in Bucharest during the NATO summit in April 2008. At the conclusion of the summit on 4 April, Putin said that the alliance's intention to invite Georgia and Ukraine \"didn’t contribute to trust and predictability in our relations\". He also said that NATO's enlargement towards Russia \"would be taken in Russia as a direct threat to the security of our country\". Putin told US president Bush that Russia would respond to Georgian acquisition of MAP by creating a buffer area with NATO. Putin said that Russia might recognize Abkhazia and South Ossetia if the possibility of Georgia's NATO membership became real. Putin privately told Bush that in case of Ukraine's accession to NATO, Russia would annex eastern Ukraine (and likely Crimea) and Ukraine would \"cease to exist as a state\".\nIn June 2008, Russian President Dmitry Medvedev threatened Mikheil Saakashvili that the conflict between their two respective states would be escalated if Georgia were to become NATO's member.\nOn the tenth anniversary of the August 2008 war between Russia and Georgia, Alexander Kots (journalist) wrote for Komsomolskaya Pravda in 2018 that since South Ossetia was sandwiched between Russia and the expanding NATO, it would be \"the only buffer separating the bloc from our borders. Therefore, conditions are created here [...] also for possible war.\"\nRussian military preparations\nRussian president Vladimir Putin wanted Russia to become global superpower again, and challenged the unipolar post-Cold War order and the United States in his 2007 speech at the Munich Security Conference. Putin's Munich speech was the beginning of Russia's conflict with the West, which materialized into the Russo-Georgian war a year later.\nOn 14 July 2007, Russian president Vladimir Putin issued a decree discontinuing Russia's adherence to the Treaty on Conventional Armed Forces in Europe that puts a limit on the number of heavy weapons stationed in Europe. The decree would take effect in 150 days. The shelving of the agreement indicated that Russia would no longer allow monitoring or provide information on its armaments. In September 2007, high-ranking official of the Government of Ingushetia secretly told Russian journalist Elena Milashina that the deployment of the 58th Army to Ingushetia was actually destined for Georgia. In December 2007, Russia withdrew from the treaty and also stopped to exchange data on its military hardware and to allow monitoring missions. Russian military expert Pavel Felgenhauer stated in December 2008 that without Russia's withdrawal from the treaty in 2007, the invasion of Georgia in 2008 could not have been successful.\nPutin decided in 2007 to fund rearmament of Russia by £100 billion in the following years. Putin also ordered to \"strengthen the battle-readiness of the army and navy\". Russia's defence budget rose 22% in 2007. |width = 30em}}\nFollowing the April 2008 Bucharest summit, Russian hostility increased and Russia started to actively prepare for the invasion of Georgia. Chief of the General Staff of the Russian Armed Forces Yuri Baluyevsky said on 11 April 2008 that Russia would carry out \"steps of a different nature\" in addition to military action to block NATO membership of former Soviet republics. General Baluyevsky admitted in 2012 that after President Putin had decided to wage the war against Georgia prior to the May 2008 inauguration of Dmitry Medvedev as president of Russia, a military action was planned and explicit orders were issued in advance before August 2008. Russia aimed to stop Georgia's accession to NATO and also to bring about a \"regime change\".\nConcurrently with the Georgia/USA military exercise Immediate Response 2008 in July 2008, the Russian forces conducted their own exercise, Caucasus 2008, where they practiced rapid response to the terrorist incursions through the Russian southern border. It was reported that the Russian paratroopers would exercise near the Roki pass and Mamison passes. Both sides claimed that the exercises were unrelated to each other. Later, Dale Herspring, an expert on Russian military affairs at Kansas State University, described the Russian exercise as \"exactly what they executed in Georgia just a few weeks later [...] a complete dress rehearsal.\"\nReferences\n;Books\n* }}\n* }}\n* }}\n*\n*\n*\n*\n*\n* }}\n*\n*\n*\nExternal links\n* [https://web.archive.org/web/20080513041313/http://www.osce.org/georgia/13203.html OSCE Mission to Georgia]\n* [http://www.civil.ge/eng/article.php?id=8712 Timeline – 2004]\n* [http://www.tandfonline.com/doi/abs/10.1080/09668130903385390 The Thawing of a Frozen Conflict: The Internal Security Dilemma and the 2004 Prelude to the Russo-Georgian War]\n* [http://euromaidanpress.com/2014/08/08/major-hostile-actions-by-the-russian-federation-against-georgia-in-2004-2007/ Major Hostile Actions by the Russian Federation against Georgia in 2004-2007]\n*\n* [https://books.google.com/books?id=9_F-9YJE8vgC The Ghost of Freedom: A History of the Caucasus]\n* [https://books.google.com/books?id=riW0kKzat2sC The Making of the Georgian Nation]\n* [https://books.google.com/books?id=XMQTAwAAQBAJ The Making of Modern Georgia, 1918-2012: The First Georgian Republic and Its Successors]\n* [https://english.studium.uw.edu.pl/wp-content/uploads/2018/07/WEER-viii-2018_Revised_web.pdf Between Kosovan and Georgian Breakaway Regions’ Conflicts. Historical Analysis of the Differential Aspects of These Conflicts in the Post-Soviet Period], pp.&nbsp;51–94\n* [https://dergipark.org.tr/en/download/article-file/201853 The Role of Russia in Provoking Conflict between Georgians and Abkhazians]"
    }
  ]
}