{
  "content": [
    {
      "type": "text",
      "text": "# Bahrain–United Kingdom relations__disambig_1\n\nBahrain–United Kingdom relations are the bilateral relations between Bahrain and the United Kingdom. Bahrain has an embassy in London and the United Kingdom is one of only four European countries to maintain an embassy in Manama. Bahrain gained independence from the United Kingdom in 1971 and has since maintained strong diplomatic, military and trade relations.\nHistory\nEarly treaties\nAt the beginning of the nineteenth century, Britain, then the dominant power in the region, was attempting to end piracy in the Persian Gulf to secure maritime trading routes to its East India Company in the Indies. In 1805, the ruling House of Khalifa offered to support Britain against Persians in exchange for occasional help by British gunships. Their request was backed by the British Resident in Muscat, but the Government of India rejected it. In 1816, the British Political Resident,|group=\"n\"}} William Bruce signed an unofficial agreement with Al Khalifa in which Britain was to remain neutral in the war between Oman and Bahrain. Four years later, Bruce refused to guarantee a truce agreement between Bahrain and Oman.\nIn 1820, Britain signed the General Maritime Treaty with tribal chiefs of the Persian Gulf, including Al Khalifa (at their request). By signing this treaty, Britain recognised Al Khalifa as \"legitimate\" rulers of Bahrain. In 1822, Britain peacefully prevented an imminent war between Bahrain and Oman. Between 1820 and 1850, Al Khalifa repeatedly tried to persuade British authorities to provide full protection to Bahrain against external threats, but without avail. Britain wanted Bahrain to remain an independent state. The situation changed in 1859–60, when the Khalifa ruler appealed to the Persians and Ottomans to provide protection, and in 1861 blockaded Al-Hasa, a coastal oasis in Eastern Arabia. This prompted the British in 1861 to force the ruler to sign a Perpetual Truce of Peace and Friendship; under its terms the ruler of Bahrain was not to engage in \"prosecution of war, piracy and slavery at sea\" and Britain was to provide maritime protection. The treaty also recognised the Khalifa ruler as an \"independent ruler\".\nSix years later, in 1867–8, the British navy intervened after a Bahraini attack on Qatar. After two years, in 1869, they intervened again to end an internal struggle over power, and appointed Shaikh Isa ibn Ali Al Khalifa, then aged 21 as ruler of Bahrain. In subsequent years, the British exercised increasing control over Shaikh Isa's communications with foreign powers, especially the Ottomans, which had claims over Bahrain and Qatar. Between 1878 and 1880, the British failed to protect Bahrain against pirates operating from lands claimed by the Ottomans. They also prevented Shaikh Isa from defending Zubarah, a center of trade and pearl fishing sited midway between the Strait of Hormuz and the west arm of the Gulf, against a land attack, in order to avoid a confrontation with the Ottomans, who supported the Al-Abdulla (a branch of Al Khalifa which had been banished from Bahrain after a feud over power). The increasing Ottoman influence in the region threatened the status quo in Bahrain and prompted Colonel E.C. Ross, the British Resident, to sign a new treaty with Bahrain on 22 December 1880. The treaty prohibited the ruler of Bahrain from negotiating, signing treaties or accepting any form of diplomatic representation with foreign powers without British consent, with the exception of \"customary friendly correspondence .. of minor importance\". It did not refer to Bahrain's independence.|group=\"n\"}}\nFearing the increasing Ottoman activity and French influence in the region, Britain signed a new treaty with Bahrain in 1892 which further limited the foreign relations of the ruler by prohibiting disposal of territory to any foreign power other than Britain. It also prohibited the minor communications exempted by the 1880 treaty. The treaties of 1880 and 1892 effectively turned Bahrain into a British protectorate, giving the British control over defence and foreign relations. The ruler was also to accept British \"advice\" regarding internal matters. During this period, Bahrain was the center of British commercial operations in the region. Between 1829 and 1904, the Persian Gulf Residency appointed an Assistant post in Bahrain. It was occupied by natives until 1900 when a Britisher was assigned to the post to accommodate the increase in British trade and attract British companies. The British were mainly concerned with their commercial interests and paid little attention to Bahraini internal affairs. Britain is credited by historians for the stability and growth Bahrain experienced in the latter half of the 19th century.\nIncreasing British protection\nIn 1903, Lord Curzon, the Viceroy of India, visited Bahrain and highlighted the need to reform the customs – which were in a state of chaos – by appointing a British director. The British point of view was that appointing a British director was not only \"the best way to regularize customs\", but was also a way to strengthen British control over Bahrain without direct rule, which would have provoked the Persians and Ottomans. It could also help them curb the trade of arms and slaves.|group=\"n\"}} When Shaikh Isa resisted what he considered an interference, Curzon told him the British were persisting in their demands. Complaints about the customs had been made as early as 1885 and remained a popular topic for British officials until the implementation of the administrative reforms in the 1920s. Throughout this period, Shaikh Isa resisted British control over customs, in order to remain financially independent. In 1904, the post of British Assistant was elevated to British Political Agent.\nOn 29 September, followers of Ali ibn Ahmed Al Khalifa, a nephew of Shaikh Isa, attacked clerks working for a German trading firm. Ali himself attacked the German trader. On 14 November, his followers attacked and severely injured several Persians. The Political Agent asked Shaikh Isa to punish the aggressors and compensate the victims, but Shaikh Isa refused. After failing to get justice in Bahrain, the victimised parties referred their cases to the German consul in the Persian port city of Bushehr and the Persian Secretary for Foreign Affairs respectively.\nFearing that these incidents would allow foreign powers to \"gain an opening for assailing [the British] regime\", Major Percy Cox, the Acting Political Resident in the Persian Gulf visited Bahrain in a navy fleet on 30 November.|group=\"n\"}} Shaikh Isa agreed to punish those behind the attack on the German firm, but not those who attacked the Persians. After consultations with higher British authorities, Cox returned to Bahrain in a great show of force on 23 February 1905. He issued an ultimatum ending on 25 February. Cox demanded deporting Ali, compensating the Persians, prohibiting forced labour of foreigners, and adhering to advisories from the British Political Agent. He threatened to fire on the capital city of Manama if Shaikh Isa did not comply.\nShaikh Isa agreed to the demands on 26 February, after Cox had fired a few blank shots on the major port city of Manama.|group=\"n\"}} In secret, however, he allegedly forewarned Ali of his inevitable arrest. Finding that Ali was gone, Cox took the heir apparent, Shaikh Hamad, as hostage, imposed house arrest on Shaikh Isa and confiscated Ali's properties. He then arrested Jassim al-Mihza, the influential Sunni judge. Three days later, Cox was satisfied with the results as the population submitted to the British.|group=\"n\"}} Shaikh Hamad and al-Mihza were released and Shaikh Isa was freed from house arrest. Ali surrendered himself in July and was deported to British Bombay in September.\nIn January 1906, Cox extended the jurisdiction of the British Political Agent to Persians when he ruled that a Persian who was caught stealing from a British ship harboured in Bahrain fell under British jurisdiction. In April, the British further extended their jurisdiction to include Jews and native Christians after the former group complained of harassment over taxes by Shaikh Isa. According to one British official, all these judicial powers were \"not authorized by any law\".\nThe full implications of these actions were not realised at first. Because all \"foreigners\" were placed under the British jurisdiction, an often-conflicted dual authority was created, one led by the ruler, the other by the British Political Agency. During the time, there was an increasing number of foreigners due to the pearl boom which was coupled with stability. At the same time, the term \"foreigner\" lacked a precise definition; both Shaikh Isa and the British claimed non-Bahraini Arabs and native-born Baharnah as their subjects.|group=\"n\"}} Shaikh Isa's motivations were political as well as financial, as he charged 10% of all legal fees. Shaikh Isa's reaction to this change was to postpone any reform to the customs which he thought of as \"the darlings of British trade\".\nThe British attempted to use this atmosphere to their advantage; Captain F.B. Prideaux, the newly appointed Political Agent, had been developing plans for administrative reforms. Unlike other British officials, he did not suggest changes in the customs or internal authority of Al Khalifa. Instead, Prideaux proposed that reforms be focused on \"ending local tyranny\" in the form of forced labour, and judicial and financial corruption. His proposals were the basis of the Bahrain Order in Council, a document issued in 1913 that secured the legal status of Britain in Bahrain. At first, these plans were rejected by Cox, who thought they were premature. British officials thought that by 1908 Shaikh Isa would be forced to accept reforms in the customs due to the expiration of Banyan merchants contracts. However, in January 1908, the customs revenue increased when Shaikh Isa appointed local officials.\nBahrain Order in Council and World War I\nBefore late 1907, the British had not openly declared Bahrain a formal protectorate; instead they considered it under their protection. The Foreign Office refused to use \"strict terms\" to define the status of Bahrain. But in private correspondents between British officials, the term \"protectorate\" was often used since 1890s. In 1898, the British Political Resident stated that \"the status of Bahrein towards the British Government of India is identical with that of protected Native States of India\".|group=\"n\"}} On 14 November 1907, the Government of India requested issuing an Order in Council for Bahrain in light of the growing British jurisdiction over foreigners. Rising foreign interests and trade in the region, especially those of Germans, was another important motivation. In the request, the Government of India acknowledged that the treaty of 1880 had turned Bahrain into \"a sort of protectorate\".\nIn February 1908, the Foreign Office questioned whether administrative reforms could be carried out along with formally acknowledging the increased British jurisdiction over Bahrain, so that the latter might not provoke any hostile reactions from other foreign powers. In March, a committee headed by John Morley, the Secretary of State for India, was formed. It concluded in its final report that Bahrain was in fact a British \"visual Protectorate\" (but did not see fit to declare it so publicly) and that the Order in Council should be issued following written consent from Shaikh Isa over the new status of British jurisdiction over foreigners. The report was approved in February 1909 and in addition to its recommendations, the Government of India was tasked on May with preparing a draft for the Order in Council. Shaikh Isa's consent was secured in July, however for various reasons, the draft was only submitted in June 1911. Further negotiations with Shiakh Isa and the Ottomans delayed the approval of the Order in Council until 12 August 1913.\nThe Bahrain Order in Council (BOIC) was published in The London Gazette on 15 August. This prompted criticism from British authorities in the Persian Gulf who wanted to delay it due to fears of the Ottomans negative reaction. In addition, Shaikh Isa still resisted British jurisdiction over non-Bahrainis.|group=\"n\"}} It provided legal cover for British jurisdiction over foreigners. It also limited the powers of the ruler and gave the Political Agent far reaching jurisdiction, including over religious law courts. John Marlowe stated that this had equated Bahrain's status with a British colony and the British Political Resident's power with that of a Colonial Governor. Littlefield wrote that the BOIC had made Bahrain \"in all but name, a British colony\" and that it aroused anti-British feelings. Six law courts were to be formed: the Chief Court (Muslims), the District Court (foreigners), the Joint Court (Bahrainis vs foreigners), al-Majlis al-Urfi (only when disputing parties agreed to refer to it), Salifa Court (concerned with pearl-diving) and Kazi's Court, to which cases could be referred from other courts. The applicable law was to be the law of British India with some amendments. However, the BOIC was suspended due to negotiations with Ottomans and the outbreak of the First World War. It was only put into effect in February 1919, announcing the start of the administrative reforms.\nA few months before the war, Bahrain granted Britain exclusive oil concessions. During the war, most Bahrainis were not supportive of the Allies, though they were at war with the Ottomans. The British thought this was due to British lack of attention toward oppression of native Bahrainis and suspension of reforms.|group=\"n\"}} These anti-British feelings were another reason for delaying implementation of the Order in Council until after the war. On the other hand, Shaikh Isa and his family, especially his younger son, Shaikh Abdulla, were loyal to the British.|group=\"n\"}} Shaikh Isa was given the Companion (CIE) and Knight Commander (KCIE) of the Order of the Indian Empire in 1915 and 1919 respectively. Shaikh Abdulla too was given CIE in 1915.\nThe situation within Bahrain was calm, but the economic times were very hard; the customs income decreased by 80%, 5,000 died due to plague in Manama and in the capital Muharraq, and many others emigrated. Many were brought to the \"brink of famine\" due to India's ban on exporting rice and the subsequent increase in the price of staple commodities. Shaikh Isa responded in 1917 by borrowing from merchants, increasing the customs tax and dispossessing the Shia Muslims, who were now the only non-Sunni group which did not enjoy British protection. At the time, Britain responded to external threats from the Wahhabis, Ottomans and Persians by tightening its grip over Bahrain. Ottomans and Persians had longstanding claims over the island. Following the end of the war, Persian media launched a campaign calling for a stop to the oppressive policies against their co-religious Shia. By the end of the war, the Persian Gulf became \"a British lake\", as all enemies of Britain were defeated and its control was therefore left unchallenged. This marked a shift in the British policy in Bahrain toward more intervention in the island's internal affairs.\nThe main British naval base in the Persian Gulf region was moved to Bahrain in 1935 shortly after the start of large-scale oil production.\nIn 1970, Iran laid claim to Bahrain and the other Persian Gulf islands. The British Government then persuaded Iran to drop its claim to the island of Bahrain. However, in an agreement with the United Kingdom it agreed \"not to pursue\" its claims on Bahrain if its other claims were realised. In the same year, the United Nations reported that \"the Bahrainis were virtually unanimous in wanting a fully independent sovereign state.\nThe following plebiscite saw Bahrainis confirm their Arab identity and independence from Britain. Bahrain was to declare itself fully independent on 15 August 1971.\nDiaspora\n7,000 Britons work in Bahrain making it the largest European community of expatriates. There are also more than 2,000 Bahraini students studying in Britain.\nTrade\nTobias Ellwood and Bahraini Minister of Foreign Affairs Khalid bin Ahmed Al Khalifa sign the UK-Bahrain Assistance Program 2015 in London on 25 November 2015.]]\nIn 2012, bilateral trade between the countries was worth £884 million.\nIn mid-2021, British MPs called on the UK government to suspend all assistance and \"secretive\" multi-million pound funding programs to Bahrain amid the concerns of Britain being complicit in the human rights abuses taking place in Bahrain. In response to the brutal crackdown against prisoners in Bahrain's Jau prison in April, UK MPs tabled a motion urging the British government to \"suspend technical assistance\" to oversight bodies in Bahrain.\nAgreements\nIn 2006, Bahrain and the United Kingdom signed an agreement for the promotion of protection investments which was designed \"to create favourable conditions for greater investment by nationals and companies of one State in the territory of the other State.\"\nOn 13 June 2007, a co-operation agreement was signed between Bahrain Stock Exchange and the London Stock Exchange.\nOn 11 October 2012, a defence co-operation agreement was signed between Bahrain and the United Kingdom to promote intelligence sharing, education, scientific and technical co-operation and joint training of military forces.\nSee also\n* Foreign relations of United Kingdom\n* Foreign relations of Bahrain\nNotes and references\nFootnotes\nReferences\nBibliography\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\nExternal links\n* [http://bahrain.embassyhomepage.com/ Embassy of Bahrain in London]"
    }
  ]
}