{
  "content": [
    {
      "type": "text",
      "text": "# Baking Pot\n\n| map_dot_label  =\n| location       = San Ignacio, Belize,&nbsp;Cayo District,&nbsp;\n| region         = Cayo District\n| built          =\n| abandoned      =\n| epochs         = Preclassic to Postclassic occupation\n| cultures       = Maya\n| event          =\n| excavations    =\n| archaeologists = Oliver Ricketson, Bullard and Bullard, Belize Valley Archaeological Reconnaissance Project (current)\n| architectural_styles =\n| architectural_details =\n| notes          =\n| designation1            =\n| designation1_offname    =\n| designation1_type       =\n| designation1_criteria   =\n| designation1_date       =\n| delisted1_date          =\n| designation1_partof     =\n| designation1_number     =\n| designation1_free1name  =\n| designation1_free1value =\n| designation1_free2name  =\n| designation1_free2value =\n| designation1_free3name  =\n| designation1_free3value =\n| designation2            =\n| designation2_offname    =\n| designation2_type       =\n| designation2_criteria   =\n| designation2_date       =\n| delisted2_date          =\n| designation2_partof     =\n| designation2_number     =\n| designation2_free1name  =\n| designation2_free1value =\n| designation2_free2name  =\n| designation2_free2value =\n| designation2_free3name  =\n| designation2_free3value =\n}}\nBaking Pot is a Maya archaeological site located in the Belize River Valley on the southern bank of the river, northeast of modern-day town of San Ignacio in the Cayo District of Belize; it is  downstream from the Barton Ramie and Lower Dover archaeological sites. Baking Pot is associated with an extensive amount of research into Maya settlements, community-based archaeology, and of agricultural production; the site possesses lithic workshops, and possible evidence of cash-cropping cacao as well as a long occupation from the Preclassic through to the Postclassic period.\nThe site at Baking Pot is unique in that it had a large population during the Terminal Classic while other sites in the Belize River Valley were declining, and occupation continued into the Postclassic whereas major Classic Period sites in the southern lowlands were by then abandoned.  After the Classic period site cores in much of the Belize Valley were abandoned, but at Baking Pot “survey and excavation of house mounds and plazuela groups immediately outside the site core suggested that Postclassic occupation there is more substantial and prolonged than in the site core”. The abundance of Tayasal-associated Augustine Red ceramics at Baking Pot, along with the association of these ceramics with a different organizational and settlement pattern suggest that there was an intrusion of people from central Petén during this time. Researchers like Aimers favor a gradual abandonment of the site at a much later time period than other sites in the region.\nHistory\nAMS radiocarbon results on burials and a cache show the site was first occupied around 700 - 400 BC. In the late Preclassic, Baking Pot had a small population with little public architecture. In the Early Classic, the site experienced a construction boom. Two architectural groups were built, with Group A to the north and Group B (containing the largest structure at Baking Pot) to the south. This north-south orientation is similar to nearby Xunantunich. Earlier excavators like Ricketson, Gordon Willey, and Bullard and Bullard describe these groups as Group 1 and Group 2. These major complexes make up the center of Baking Pot and are connected by a roughly 250 meter long causeway (or sacbe). In the Late Classic, the population increased to approximately 2,500 people. Toward the end of the Terminal Classic period the local elite left and the palace complexes in the city center were abandoned. In the early Postclassic, people were still living on a portion of Group A  but rarely used the ceremonial center and there was very little new construction. Many of the people living at Baking Pot were farmers; being close to the Belize River the site has fertile soil in an alluvial valley and is primarily associated with agricultural production.\nExcavations\nThe site has an area of about nine square kilometers. In the 1920s, A.H. Anderson first conducted archaeological research at Baking Pot after some materials from the site were used in the construction of the western highway.  Later excavations by Oliver Ricketson (a single season in 1924 on behalf of the Carnegie Institution), Gordon Willey in the 1950s and William Bullard and Mary Bullard (a single season in 1962) completed major excavations in the 1960s. Wiley is best known for his excavations and settlement research at Barton Ramie and for his focus on Maya households during a time when most people were only focused on elite. Beginning in 1992 the Belize Valley Archeological Reconnaissance Project started working at Baking Pot, with its work continuing into the 21st century with BVAR researchers working under the direction of Dr. Jaime Awe, including Jim Conlon, Jim Aimers, Josalyn Ferguson, Jennifer Piehl, Carolyn Audet, Christophe Helmke, and Julie Hoggarth. Among the finds were 110 grooved stones of which half were intact enough to examine. Their function is unknown.\nA complex water management system exists at the site, including a series of aguadas and seasonal streams, along with the presence of drains in the palace complex, work to feed water from the foothills to the south down through the site and into the aduadas before dumping into the Belize River.  Baking Pot is named after large pots were found by archaeologists that were once used to boil chicle. At the Bedran group nearby, a house group that was excavated, burial grave goods were found including painted ceramic vessels with a primary standard sequence around the top dated to the Early Classic. These vessels were cacao drinking vessels and were thought to contain a placename—Four Water Place—although this is now reinterpreted as a royal title.  There are no carved monuments at Baking Pot, although several uncarved stelae and uncarved altars have been found.\nA causeway extends south and to the west of Group B and ends at a causeway terminus structure (Mound 190). Here hundreds of broken vessels were found in front of the stairway, possibly from a termination ritual. Mound 190 had deposits with finger bones, an altar, and intact mini ceramic vessels below it with tiny specks of jade. This mound also contains evidence of ritual activity and is believed to be used for ritual/ceremonial purposes. The discovery of finger bones is similar to the finger bowl caches associated with Caracol (and also found at Cahal Pech)  and may provide evidence of Caracol control or influence at Baking Pot at the time. Vessel 2 at Baking Pot describes its owner in a similar structure that is found at Caracol as well. Naranjo pottery has also been found here at Baking Pot, and evidence for a push to control the Belize River Valley after the fall of Tikal was described on a monument at Xunantunich.\nIn 2016 a 9 inch high ceremonial drinking vessel, the Komkom Vase, was discovered. It contains a long Mayan hieroglyphic inscription with a 9th century long count and describes a war between the King of Komkom, allied with the city of Naranjo, and the nearby city of Yaxha. The vase was found in 82 fragments, now assembled, which made up about 60% of the original. The entire vase would have had about 202 hieroglyphic blocks.\nReferences\nFurther reading\n* Audet, Carolyn. (2004). Excavations of structure 190, Baking Pot, Belize. In Carolyn Audet and Jaime Awe, Eds., The Belize Valley Archaeological Reconnaissance Project: Report on the 2003 Field Season, pp.&nbsp;35–55. Institute of Archaeology, National Institute of Culture and History, Belmopan, Belize.\n* C. Audet, \"The Political Organization of the Belize Valley: Evidence from Baking Pot, Belize\", Research Reports in Belizean Archaeology 2, pp. 357-364, 2005\n* Awe, Jaime J. \"Early Classic/Late Classic Maya\" Lecture sponsored by The Belize Valley Archaeological Reconnaissance Project. Galen University, 17 July 2011.\n* Bullard, W. R., & Bullard, M. R. (1965). Late classic finds at Baking Pot, British Honduras. Art and Archaeology Occasional Papers, No. 8. Toronto: University of Toronto Press.\n* Chase, Diane Z. (2004). Diverse Voices: Toward and Understanding of Belize Valley Archaeology. In James F. Garber, Ed., The Ancient Maya of the Belize Valley: Half a Century of Archaeological Research, pp.&nbsp;335–348. Gainesville: University Press of Florida.\n* Colas PR, Helmke CGB, Awe JJ, Powis TG., \"Epigraphic and ceramic analyses of two early classic Maya vessels from Baking Pot, Belize\", Mexicon, p. 33–39, 2002\n* Conlon, James F. and Allan F. Moore. (2003). Identifying Urban and Rural Settlement Components: An Examination of Classic Period Plazuela Group Function at the ancient Maya Site of Baking Pot, Belize, in Gyles Iannone and Samuel V. Connell, Eds., Perspectives on ancient Maya rural complexity, pp.&nbsp;59–70.  Los Angeles: Cotsen Institute of Archaeology, University of California, Los Angeles.\n* Hoggarth, Julie A.  (2009) Settlement and Community Organization in the Classic to Postclassic Transition: Research Methodology and Aims of the 2007 to 2010 Settlement Research at Baking Pot, Belize. In Julie A. Hoggarth and Jaime J. Awe, Eds., The Belize Valley Archaeological Reconnaissance Project: A Report of the 2008 Field Season, pp.&nbsp;1–25. Institute of Archaeology, National Institute of Culture and History, Belmopan, Belize.\n* [https://www.cambridge.org/core/services/aop-cambridge-core/content/view/5AD8A67D85A322C96BA097FC96776290/S0033822221000308a.pdf/building-high-precision-ams-14c-bayesian-models-for-the-formation-of-peri-abandonment-deposits-at-baking-pot-belize.pdf]Hoggarth, Julie A., Brendan J. Culleton, Jaime J. Awe, and Douglas J. Kennett, \"Questioning Postclassic Continuity at Baking Pot, Belize, Using Direct Ams 14C Dating of Human Burials\", Radiocarbon 56, no. 3, pp. 1057–75, July 2014 doi:10.2458/56.18100\n* Hoggarth, J.A. et al., \"Reconstructing the Formation of Peri-Abandonment Deposits at Baking Pot, Belize\", Ancient Mesoamerica, 31(1), pp. 139–149, 2020 doi:10.1017/S0956536119000312\n*[https://www.cambridge.org/core/services/aop-cambridge-core/content/view/5AD8A67D85A322C96BA097FC96776290/S0033822221000308a.pdf/building-high-precision-ams-14c-bayesian-models-for-the-formation-of-peri-abandonment-deposits-at-baking-pot-belize.pdf]Hoggarth, Julie A., et al., \"Building high-precision AMS 14C Bayesian models for the formation of peri-abandonment deposits at Baking Pot, Belize\", Radiocarbon 63.3, pp. 977-1002, 2021\n* Piehl, J.C. (1997). The Burial Complexes of Baking Pot: Preliminary Report on the 1996 Field Season. In Belize Valley Archaeological Reconnaissance Project: Progress Report of the 1996 Field Season, edited by Jaime J. Awe and J.M. Conlon. pp.&nbsp;59–70. Department of Anthropology. Trent University. Peterborough, Ontario.\n* Piehl, Jennifer C. (2004). Performing Identity at an Ancient Maya City: The Archaeology of Houses, Health and Social Differentiation at the Site of Baling Pot, Belize. Ph.D. Dissertation. Department of Anthropology, Tulane University, New Orleans.\n* Ricketson, O. G., \"Excavations at Baking Pot, British Honduras\", Contributions to American Anthropology and History, No. 1. Publication 403. Carnegie Institution of Washington, Washington, DC, 1929\n* [https://www.mdpi.com/2073-445X/12/2/483/pdf]Walden, John P., et al., \"Classic Maya Settlement Systems Reveal Differential Land Use Patterns in the Upper Belize River Valley\", Land 12.2. pp. 483, 2023\n* Weeks, John M., Hill, Jane A., & Carnegie Institution of Washington. (2006). The Carnegie Maya: The Carnegie Institution of Washington Maya research program, 1913-1957. Boulder: University Press of Colorado.\nExternal links\n* [https://web.archive.org/web/20111201224735/http://www.nichbelize.org/ia-general/welcome-to-the-institute-of-archaeology.html Belize Institute of Archaeology, National Institute of Culture and History]\n* [http://www.bvar.org/ Belize Valley Archaeological Reconnaissance Project]\n* [https://web.archive.org/web/20081205005044/http://www.famsi.org/reports/02090/section01.htm Foundation for the Advancement of Mesoamerican Studies, Inc.]"
    }
  ]
}