{
  "content": [
    {
      "type": "text",
      "text": "# Baking Bad\n\n| length       =\n| guests       =\n* Connie Britton as herself\n* Carl Lumbly as Loan Officer\n* Ana Ortiz as Cinnamon\n* Emily Osment as Girl in bed on TV\n* Eamon Pirruccello as Boy\n* Nick Toth as voice over for Hotel TV\n| prev         = The Book of Joe\n| next         = Brian the Closer\n| season_article = Family Guy season 13\n| episode_list = List of Family Guy episodes\n}}\n\"Baking Bad\" is the third episode of the thirteenth season of the animated sitcom Family Guy, and the 234th episode overall. It aired on Fox in the United States on October 19, 2014, and is written by Mark Hentemann and directed by Jerry Langford. In the episode, Peter opens a cookie shop with Lois while Stewie develops a drinking problem after Brian gives him cough medicine to help him sleep. The title is a play on the television series Breaking Bad, which aired from 2008 to 2013.\nPlot\nTom Tucker reports on the news about an earthquake that struck Haiti. After seeing the news, Lois organizes a blood drive, and bribes a reluctant Peter into giving blood with cookies that she had made using one of her grandmother's recipes. Peter enjoys the cookie so much he encourages her to open a cookie store together. Going to the bank to get a loan, her cookies win over the bank manager Cookie Monster, who gives the loan officer the approval to let Peter and Lois open a cookie shop, which they call \"Peter's Wife's Cookies\".\nAs business at the shop is slow, Peter asks Quagmire, Cleveland, and Joe how to increase sales. Taking Quagmire's advice that \"sex sells\", Peter employs bikini beauties Cookie, Sugar, Spice, Cinnamon, Brown Sugar, and Butter to work at the shop. Lois is upset until she finds that the idea has made a lot of money and reluctantly agrees to go along with it. When Peter takes the stunt to the extreme by turning the cookie shop into a strip club, an enraged Lois quits. An apologetic Peter arrives home and admits he was wrong. Lois gets out of the loan by turning the shop back over to the bank.\nMeanwhile, Stewie has trouble sleeping when Lois is not around to tell him a bedtime story and not even the Sandman can get him to sleep. To remedy this, Brian slips him some prescription-strength cough medicine so the alcohol will help him. However, Stewie becomes drunk from abusing the medicine and starts acting erratically, leading to a drunken Big Wheel accident where he injures another child. The next day, he arrives home to find Brian and his toys have arranged an intervention for his addiction. After successfully taking care of Stewie, Brian has to break up a masturbation intervention he held for Chris because all his friends are sitting in a circle.\nProduction\nThis is the final episode to be written by longtime executive producer and writer Mark Hentemann who left the series after completion of this episode to work on his own series Bordertown.\nIn a cutaway, Peter eats the hair of Connie Britton, who voices herself. Family Guy executive producer Steve Callaghan said \"Especially if you saw her in Friday Night Lights, her hair just looks so yummy, you want to take a bite of it.\"\nReception\nThe episode received an audience of 4.74 million, making it the fourth-most watched show on Fox that night, after The OT, The Simpsons and Brooklyn Nine-Nine.\nReferences\nExternal links\n*"
    }
  ]
}