{
  "content": [
    {
      "type": "text",
      "text": "# Ballistic Missile Early Warning System\n\nconstructed April 16, 1998 – February 1, 2001.}}\n| country       = United States\n| location      = BMEWS Central Computer and Display Facility\n| coordinates   =\n| fate          = Replaced in 2001 by SSPARS\n* in Colorado\n*Site I:  in Greenland\n*Site II: in Alaska (71st Det 2)\n*Site III:  in Yorkshire (71st Det 1)\n* on Trinidad (AN/FPS-43)}}\n*}} in New Jersey (9th Det 3) FPS-49 prototype and test/training}}\n| built         = 1958–1961 (complete FOC was 15 January 1964) and employed 485 large companies and 2415 smaller firms spread over 29 states ($474,831,000 contract in February 1960; )}}\n| footnotes     =\n}}\nThe RCA 474L Ballistic Missile Early Warning System (BMEWS, 474L System, Project 474L) was a United States Air Force Cold War early warning radar, computer, and communications system, for ballistic missile detection. The network of twelve radars, which was constructed beginning in 1958 and became operational in 1961, was built to detect a mass ballistic missile attack launched on northern approaches [for] 15 to 25 minutes' warning time also provided Project Space Track satellite data (e.g., about one-quarter of SPADATS observations).\nIt was replaced by the Solid State Phased Array Radar System in 2001.\nBackground\nThe Ballistic Missile Early Warning System (BMEWS) was a radar system built by the United States (with the cooperation of Canada and Denmark on whose territory some of the radars were sited) during the Cold War to give early warning of a Soviet intercontinental ballistic missile (ICBM) nuclear strike, to allow time for US bombers to get off the ground and land-based US ICBMs to be launched, to reduce the chances that a preemptive strike could destroy US strategic nuclear forces.\nThe shortest (great circle) route for a Soviet ICBM attack on North America is across the North Pole, so the BMEWS facilities were built in the Arctic at Clear Space Force Station in central Alaska, and Site J near Pituffik Space Base, North Star Bay, Greenland.  When it became clear in the 1950s that the Soviet Union was developing ICBMs, the US was already building an early-warning radar system in the Arctic, the DEW line, but it was designed to detect bombers and did not have the capability of tracking ICBMs.\nThe challenges of designing a system that could detect and track a massive strike of hundreds of ICBMs were formidable. The radar sites were located as far north in the Arctic as possible, to give maximum warning time of an attack. However, the time between when a Soviet missile would rise above the horizon and be detected and when it would reach its target in the US was only 10 to 25 minutes.\nEquipment\nBMEWS consisted of two types of radars and various computer and reporting systems to support them. The first type of radar consisted of very large, fixed rectangular partial-parabolic reflectors with two primary feed points. They produced two fan-shaped microwave beams that allowed them to detect targets across a very wide horizontal front at two narrow vertical angles. These were used to provide wide-front coverage of missiles rising into their radar horizon, and by tracking them at two points as they climbed, enough information to determine their rough trajectory.\nThe second type of radar was used for fine tracking of selected targets, and consisted of a very large steerable parabolic reflector under a large radome. These radars provided high-resolution angular and ranging information that was fed to a computer for rapid calculation of the probable impact points of the missile warheads. The systems were upgraded several times over their lifetime, replacing the mechanically scanned systems with phased array radar that could perform both roles at the same time.\nBMEWS equipment included:\n*General Electric AN/FPS-50 Radar Set, a UHF (440&nbsp;MHz) detector with transmitter having an organ-pipe scanner feed, fixed 1,500 ton parabolic-torus reflector, and receiver with Doppler filter bank to scan with two horizontally-sweeping fans for as many as ~12,000 observations per day for surveillance (determining range, position, and range rate) of space objects\n*RCA AN/FPS-49 Radar Set, a five-horn monopulse tracker (e.g., three at Site III) and FPS-49A variant (different radome) at Thule (vacuum tubes 10 feet tall in transmitter buildings are used to warm the site)\n*RCA AN/FPS-92 Radar Set, an upgraded FPS-49 featuring more elaborate receiver circuits and hydrostatic bearings at Clear\n*Sylvania AN/FSQ-53 Radar Monitoring Set, with console and Signal Data Converter Group (\"data take-off unit\")\n*Sylvania AN/FSQ-28 Missile Impact Predictor Set, with duplex IBM-7090 TX solid-state computers e.g., in Building 2 at Thule  and part of the AN/FPA-21 Radar Central Computer at Site III—Satellite Information Processor (SIP) software was later added at Site III for use on the backup IBM 7090.\n*RCA Communications Data Processor (CDP), as used in the Western Electric Air Force Communications Network (AF DATACOM) of AUTODIN\n*Western Electric BMEWS Rearward Communications System, a network to link the separate elements and one of six ADC comm systems: BMEWS Rearward Long-Lines System at CFS Resolution Island and CFS Saglek, (cf. Pole Vault system on the Pinetree Line, White Alice in Alaska, and to RAF Fylingdales, NARS)\n*BMEWS Central Computer and Display Facility (CC&DF) at Ent AFB (ZI portion of BMEWS), with RCA Display Information Processor (DIP)—DIPS displays were also at the Offutt AFB war room floor and balcony, as well as at the Pentagon\nTo predict when parts might break down, the contractor also installed RCA 501 computers with 32k high-speed memory, 5-76KC 556 bpi 3/4\" tape drives, and 200-track random-access LFE drums.  The initially replaced portions of BMEWS included the Ent CC&DF by the Burroughs 425L Missile Warning System at the Cheyenne Mountain Complex (FOC 1 July 1966.) The original Missile Impact Predictors were replaced (IOC on 31 August 1984), and BMEWS systems were entirely replaced by 2001 (e.g., radars were replaced with AN/FPS-120 SSPARS) after Satellite Early Warning Systems had been deployed (e.g., 1961 MIDAS, 1968 Project 949, and 1970 DSP satellites).\nClassification of radar systems\nUnder the Joint Electronics Type Designation System (JETDS), all U.S. military radar and tracking systems are assigned a unique identifying alphanumeric designation. The letters “AN” (for Army-Navy) are placed ahead of a three-letter code.\n*The first letter of the three-letter code denotes the type of platform hosting the electronic device, where A=Aircraft, F=Fixed (land-based), S=Ship-mounted, and T=Ground transportable.\n*The second letter indicates the type of equipment, where P=Radar (pulsed), Q=Sonar, and R=Radio.\n*The third letter indicates the function or purpose of the device, where G=Fire control, R=Receiving, S=Search, and T=Transmitting.\nThus, the AN/FPS-49 represents the 49th design of an Army-Navy “Fixed, Radar, Search” electronic device.\nEarly tests\nstation's detection arcs were a missile warning \"fence\" created by 4 radars' separate arcs: each AN/FPS-50 created 2 arcs (shown) centered at 3.5° and 7° elevation (exaggerated in illustration.)  Each arc was created by a smaller radar beam ~1° wide x 3.5° high at a \"horizontal sweep rate...fast enough that a missile or satellite cannot pass through...undetected\". Concerns in 1962 of \"ERBM's (Extended Range Ballistic Missiles)\" were that missile speeds after burnout would be higher than the initially-deployed Soviet ICBMs and prevent the sweeping \"Lower Fan\" and then the \"Upper Fan\" (with \"revisit time of 2 sec\") from detecting the missiles.\nA missile within the lower arc (~1.75-5.25° elevation) would be detected at a \"Lower Fan Q Point\" (black dot) and then by the upper fan (black dot with jagged outline), which allowed the impact area to be estimated from \"where the object crossed the two fans and the elapsed time interval between fan crossings\" (displays showed the uncertain impact point as an elliptical area.)   The free flight range of the missile outside the atmosphere (burnout to reentry) depends on the flight path angle and on the missile's parametric value of Q calculated from altitude and speed—additional ballistic range within the atmosphere to an estimated burst altitude was determined from computerized look-up tables in the Missile Impact Predictor.}}]]\nOn 2 June 1955, a General Electric AN/FPS-17 \"XW-1\" radar at Site IX in Turkey that had been expedited was completed by the US in proximity to the ballistic missile launch test site at Kapustin Yar in the Soviet Union for tracking Soviet rockets and to demonstrate the feasibility of advanced Doppler processing, high-power system components, and computerized tracking needed for .\nThe first missile tracked was on 15 June, and the radar's parabolic reflector was replaced in 1958, and its range was extended from 1000 to 2000 nautical miles after the 1957 Gaither Commission identified that because of expected Soviet ICBM development, there would be little likelihood of SAC's bombers surviving since there was no way to detect an incoming attack until the first warhead landed.\nBMEWS' General Operational Requirement 156 was issued on 7 November 1957 (BMEWS was designed to go with the active portion of the WIZARD system) and on 4 February 1958; the USAF informed Air Defense Command (ADC) that BMEWS was an \"all-out program\" and the \"system has been directed by the President, has the same national priority as the ballistic missile and satellite programs and is being placed on the Department of Defense master urgency list\". By July 1958 after NORAD manning began, ADC's 1954 blockhouse for the Ent AFB command center had inadequate floor space; and Ent's \"requirement for a ballistic missile defense system display facility...brought renewed action...for a new command post\" (the JCS approved the nuclear bunker on 11 February 1959).\nPlanning and development\nOn 14 January 1958, the US announced its decision to establish a Ballistic Missile Early Warning System with Thule to be operational in 1959—total Thule/Clear costs in a May 1958 estimate were ~$800 million (an October 13, 1958, plan for both estimated completion in September 1960.)  The Lincoln Laboratory's radar at Millstone Hill, Massachusetts, was built and provided data to a 1958 for trajectory estimates, e.g., Cape Canaveral missiles, and an adjunct high-power UHF test facility employed the Millstone transmitter to stress-test the components that were candidates for the operational BMEWS. (A twin of the Millstone Hill radar was dedicated at Saskatchewan's Prince Albert Radar Laboratory on June 6, 1959.) A prototype AN/FPS-43 BMEWS radar completed at Trinidad in 1958 went operational on 4 February 1959, the date of an Atlas II B firing from Cape Canaveral Launch Complex 11 (lunar reflection was tested January–June 1960). On June 30, 1958, NORAD emphasized that the BMEWS could not be considered as a self-contained entity separate from the Nike Zeus, or vice versa.\nOn 18 March 1959, the USAF told the BMEWS Project Office to proceed with an interim facility for the \"AICBM control center\" with an anti-ICBM C3 computer (e.g., for when the USAF Wizard and/or Army Nike Zeus ABMs became operational), and the basement of the 1954 ADC blockhouse was considered for the interim center.  A \"satellite prediction computer\" could be added to the planned missile warning center if Cheyenne Mountain's \"hardened COC slipped considerably beyond January 1962\" (tunneling began in June 1961.)   In early 1959 for use at Ent in September 1960, a BMEWS display facility with \"austere and economical construction with minimum equipment\" was planned in an \"annex to the current COC building\".  In late 1959, ARPA opened the 474L System Program Office, and BMEWS' \"12th Missile Warning Squadron at Thule...began operating in January 1960.\"  Following a Nike ABM intercept of a test missile, the planned Cheyenne Mountain mission was expanded in August 1960 to \"a hardened center from which CINCNORAD would supervise and direct operations against space attack as well as air attack\" (NORAD assumed \"operational control of all space assets with the formation of\" SPADATS in October 1960.)  The 1st Aerospace Surveillance and Control Squadron (1st Aero) was activated at Ent AFB on 14 February 1961; and Ent's Federal Building was completed .\nDeployment\n.}} The concrete foundation included a large refrigeration system to prevent the curing concrete's heat from melting the permafrost]]\nClear AFS construction began in August 1958 with 700 workers and was completed 1 July 1961, and Thule Site J construction began by 18 May 1960, with radar pedestals complete by 2 June. Thule testing began on 16 May 1960, IOC was completed on 30 September, and the initial operational radar transmission was in October 1960 (initially duplex vacuum tube IBM 709s occupied two floors).\nOn 5 October 1960, when Khrushchev was in New York, radar returns during moonrise at Thule\nproduced a false alarm. On 20 January 1961, CINCNORAD approved two-second FPS-50 frequency hoping to eliminate reception of echoes beyond artificial satellite orbits. On 24 November 1961, an AT&T operator failure at their Black Forest microwave station northeast of Colorado Springs caused a BMEWS communications outage to Ent and Offutta B-52 near Thule confirmed the site still remained.\nTraining for civilian technicians included a February 1961 RCA class in New Jersey for a Tracking Radar Automatic Monitoring class. The \"Clear Msl Early Warning Stn, Nenana, AK\" was assigned to Hanscom Field, Massachusetts, by the JCA on 1 April 1961. By 16 May 1961, Ent's \"War Room at NORAD\" had a glass map for plotting aircraft and had a \"map [that] lights up\" to show multiple impact ellipses and times \"before the huge missile[s] would burst\" (separate from Ent's BMEWS CC&DF building, the two-story blockhouse had a war room with, left of the main NORAD region display, a BMEWS display map and \"threat summary display\" with a count of incoming missiles.) The Trinidad Test Site transferred from Rome AFB to Patrick AFB on 1 July 1961 (closed as \"Trinidad Air Station\" on 1 October 1971) and the same month, the 1st Aero began using Ent's Space Detection and Tracking System (SPADATS) operation center in building P4's annex (Cheyenne Mtn's Space Defense Center became fully operational in 1967.) The BRCS undersea cable was cut \"presumably by fishing trawlers\" in September, October, and November 1961 (the BMEWS teletype and backup SSB substituted); and in December 1961, Capt. Joseph P. Kaufman was charged \"with giving [BMEWS] defense data to ... East German Communists.\"\nBMEWS surveillance wing\nThe 71st Surveillance Wing, Ballistic Missile Early Warning System, was activated on 6 December 1961, at Ent AFB (renamed 71st Missile Warning Wing on 1 January 1967, at McGuire AFB 21 July 1969 – 30 April 1971).  Syracuse's BMEWS Test Facility at GE's High-Power Radar Laboratory became the responsibility of Rome Air Development Center on 11 April 1962 (Syracuse's Eagle Hill Test Annex closed in 1970) and on 31 July 1962, NORAD recommended a tracking radar station at Cape Clear to close the BMEWS gap with Thule for low-angle missiles (versus those with the 15- to 65-degree angle for which BMEWS was designed.) By mid-1962, BMEWS \"quick fixes\" for ECCM had been installed at Fylingdales Moor, Thule and Cape Clear AK and by June 30, integration of BMEWS and SPADATS at Ent AFB was completed. During the Cuban Missile Crisis, the Moorestown AN/FPS-49 radar on 24 October was \"withdrawn from SPADATS and realigned to provide missile surveillance over Cuba.\" 1962 \"strikes and walkouts\" delayed Fylingdales' planned completion from March until September 1963 and on 7 November, the Pentagon BMEWS display subsytem installation was complete.  At the end of 1962, NORAD was \"concerned over BMEWS' virtual inability to detect objects beyond a range of 1500 nautical miles.\" The Moorestown FPS-49 completed a BMEWS \"signature analysis program\" on scale models by January 1963.\nAir Defense Command / Aerospace Defense Command\nand Control Data Corporation, at a cost of US $100M (3-faced phased array antenna and embedded CDC-Cyber computer) and later changed to an Upgraded Early Warning Radar by Boeing Integrated Defense Systems with 3 faces built August 1989-October 1992. }}]]\nOperations transferred from civilian contractors (RCA Government Services) to ADC on 5 January 1962 (renamed Aerospace Defense Command in 1968.)  Fylingdales became operational on 17 September 1963, and Site III transferred to RAF Fighter Command on 15 January 1964.\nRemaining BMEWS development responsibilities transferred to the \"Space Track SPO (496L)\" when the BMEWS SPO closed on 14 February 1964—e.g., the AN/FPS-92 with \"66-inch panels\" was added to Clear in 1966 (last of the five tracking radars), and in 1967, BMEWS modification testing was complete on 15 May, when the system cost totaled $1.259 billion, equivalent to $}} in .\nIn 1968, Ent's 9th Division HQ had a Spacetrack/BMEWS Maintenance Section.\nIn 1975, SECDEF told Congress that Clear would be closed when Cobra Dane and the Beale AFB PAVE PAWS became operational. By 1976, BMEWS included IBM 7094, CDC 6000, and Honeywell 800 computers.\nUSAF Space Command\nOn 1 October 1979, Thule and Clear transferred to Strategic Air Command when ADCOM was broken up then to Space Command in 1982. By 1981 Cheyenne Mountain had been averaging 6,700 messages per hour compiled via sensor inputs from BMEWS, the JSS, the 416N SLBM \"Detection and Warning System, COBRA DANE, and PARCS as well as SEWS and PAVE PAWS\" for transmission to the NCA.  To replace AN/FSQ-28 predictors, a late 1970s plan for processing returns from MIRVs installed in new Missile Impact Predictor computers was complete by September 1984.\nReplacement\nThe BMEWS was replaced by the Solid State Phased Array Radar System in 2001.\nSee also\n* Main Centre for Missile Attack Warning (Russia)\n* Solid State Phased Array Radar System\n*List of radars\n*List of military electronics of the United States\nNotes\nReferences\nExternal links\n* [https://www.youtube.com/watch?v=i-qYyIAeqXs US Air Force film]\n* [https://web.archive.org/web/20120505055809/http://www.ll.mit.edu/publications/journal/pdf/vol12_no2/12_2widgetswonders.pdf Both Trinidad test radars & 1957 FPS-50 reflector scale model]\n* [https://news.google.com/newspapers?nid=1499&dat=19610104&id=iuEpAAAAIBAJ&sjid=8yUEAAAAIBAJ&pg=4813,1400514 1961 Thule sketch, FPS-50 wave guides, & \"memory and logic unit\"]\n* [http://www.c-and-e-museum.org/Pinetreeline/misc/other/misc3i.html 1961 BMEWS Rearward communications \"billboard type\" antenna]\n* [https://www.gov.uk/government/uploads/system/uploads/attachment_data/file/249994/Sanctuary_mag__number_42_2013.pdf construction of a Fylingdale's radome]\n* [http://jsf1.homestead.com/MoorestownGolfBall.html \"Moorestown's Giant Golf Ball]\n* [http://www.real-whitby.co.uk/wp-content/gallery/raf-fylingdales-newsletter/scan.jpg Scan newsletter of Site III]\n* [http://www2.gwu.edu/~nsarchiv/nukevault/ebb304/film03.htm SAC DIP screen with impact ellipses (Reel 2, minute 4:40)]\n* [https://www.youtube.com/watch?v=WpWW6KzCu70 Eyes of the North]\n* [http://www.criticalpast.com/video/65675061914_Ballistic-Missile-Early-Warning-System_technicians-working_watching-oscilloscopes_turning-knobs Flyingdales Rearward Data Room]"
    }
  ]
}