{
  "content": [
    {
      "type": "text",
      "text": "# Ball culture__disambig_1\n\nThe Ballroom scene (also known as the Ballroom community, Ballroom culture, or just Ballroom) is an African-American and Latin underground LGBTQ+ subculture. The scene traces its origins to the drag balls of the mid-19th century United States, such as those hosted by William Dorsey Swann, a formerly enslaved Black man in Washington D.C.. By the early 20th century, integrated drag balls were popular in cities such as New York, Chicago, New Orleans, Baltimore, and Philadelphia.\nIn the mid-20th century, as a response to racism in integrated drag spaces, the balls evolved into house ballroom, where Black and Latino attendees could \"walk\" in a variety of categories for trophies and cash prizes. Most participants in ballroom belong to groups known as \"houses\", where chosen families of friends form relationships and communities separate from their families of origin, from which they may be estranged. The influence of ballroom culture can be seen in dance, language, music, and popular culture, and the community continues to be prominent today.\nHistory\nSince the beginning of colonial settlement in the United States, there have been individuals contradicting gendered expectations. However, it was not until the mid-19th century, as urbanization allowed for increased independence and anonymity, that cities provided a space for LGBTQ+ communities to form. In the 1880s, drag balls became a popular gathering space for people living different gendered lives. William Dorsey Swann, the first person known to describe himself as a drag queen, hosted secret balls in Washington, D.C.. Many of the attendees were Black men, as was Swann, who was formerly enslaved. Swann and other attendees were arrested in police raids numerous times, but the balls continued. By the 1890s, drag events were also being organized in New York City.}}\nBy 1930, racially integrated public drag balls in Chicago, New Orleans, Baltimore, Philadelphia, and other US cities were bringing hundreds of cross-dressing and gender-nonconforming individuals together and attracting large crowds. Use of family terms such as \"mother\" to denote rank among ball participants were recorded in the early 20th century, and phrases such as \"strike a pose\" and \"vogue\" can be traced back to the 1930s.\nAs the 20th century progressed, organizations advocating for transgender rights were established and community spaces for LGBTQ+ people grew in number, but many were white-dominated and exclusive. Though drag balls were often integrated, Black performers faced racism at balls, leading to a rise of Black balls in the 1960s. In 1972, Harlem drag queens Lottie and Crystal LaBeija founded the first house, the House of LaBeija, and drag balls evolved into house ballroom.\nIn the ballroom scene, Black and Latino drag performers could achieve glory, find surrogate families, and feel a sense of belonging. Miss Major, who came out as transgender in her teens in late 1950s Chicago and was part of African-American drag ball culture, describes the balls in a 1998 interview.\"[The balls] were phenomenal! It was like going to the Oscars show today. Everybody dressed up. Guys in tuxedos, queens in gowns that you would not believe—I mean, things that they would have been working on all year. There was a queen in the South Side who would do the South City Ball. There was one on the North Side who would do the Maypole Ball. There were different ones in different areas at different times. And the straight people who would come and watch, they were different than the ones who come today. They just appreciated what was going on. They would applaud the girls when they were getting out of one Cadillac after another. It was just that the money was there, and the timing was right, and the energy was there to do this thing with an intensity that people just don't seem to have today. It seems to have dissipated. Then it was always a wonder—whether you participated, whether you watched, whether you just wore a little cocktail dress and a small fur coat —it was just a nice time.\" —Miss Major\nBall culture was captured and shown to a mainstream audience in Jennie Livingston's documentary Paris is Burning (1991). In 2006, Wolfgang Busch released the documentary How Do I Look, a response to Paris is Burning, featuring Pepper LaBeija, Willi Ninja, Octavia St. Laurent, Jose Xtravaganza and Kevin Omni. Ball culture has since migrated to such countries as Canada, Japan and the United Kingdom.\nCities with prominent ball culture\nNew York City\nNew York City is the center of the world's drag ball culture. Cross dressing balls have existed in the city since the 1800s; the Hamilton Lodge Ball in 1869 is the first recorded drag ball in US history. In the 1920s, female impersonators competed in fashion shows in bars two or three times a year. Black queens would sometimes participate but rarely won prizes due to discrimination. In the 1970s, Black queens Crystal LaBeija and her friend, Lottie, began their own drag ball titled House of LaBeija, kickstarting the current ballroom scene in New York. Crystal and Lottie are credited with founding the first House in ballroom. In 1989, The House of Latex was created as a call to action in the ballroom community to bridge the gap between HIV and STI prevention and ballroom culture.\nWashington, DC\n, 2016 ]]\nWilliam Dorsey Swann organized a series of drag balls in the DC area during the 1880s and 1890s.\nThis account from the metropolitan Washington, D.C. area describes how ball culture and drag houses developed about 1960:\n}}\nThe dance styles which later characterized drag houses had not been developed; competitions between houses involved standard drag performances in which entertainers lip-synced or, rarely, sang. In contrast to the New York houses in Paris Is Burning, some of the Washington, D.C. house mothers were white. African-American drag queens were a prominent part of the community:\nThe Washington, D.C. ball community consists primarily of African-American and Latino participants, and has adopted many attributes seen in Paris Is Burning. Nineteen-sixties-style drag shows and competitions still exist, with their own audience. Ball patrons will find similar categories (such as \"banjee thug realness\" and \"vogue\") as audience members.\nThe Washington ballroom scene was created by Icon Founder Lowell Khanh (Lowell Thomas Hickman, (1987)) and Icon Eric Christian-Bazaar. The House of Khanh was the first House outside of New York that wasn't a part of a New York house. From the House of Khanh came the House of Milan.\nDuring the 1990s, more houses appeared in the area due to the efforts of Twain Miyake-Mugler (\"father\" of the House of Miyake Mugler, D.C. Chapter), Icon Harold Balenciaga (founder of the house of Balenciaga), Icons Shannon Garcon and Whitney Garcon (founders of the House of Garcon and charter members of The Legendary House of Miyake-Mugler). The city hosts a series of annual balls, in which contestants compete for trophies and cash prizes.\nBaltimore\nBaltimore has a well-established ball community.\nIn 1931, the newspaper Baltimore Afro-American covered a local drag ball. The article detailed the \"coming out of new debutantes into gay society\". By the 1930s, the drag ball culture was starting to emerge in the Black communities in major cities such as Baltimore, Chicago, and New York. The Afro reported that \"The coming out of new debutantes into homosexual society was the outstanding feature of Baltimore's eighth annual frolic of the pansies when the art club was host to the neuter gender at the Elks' Hall.\"\nPhiladelphia\nPhiladelphia has a well-established ball community. Philadelphia's first ball was the Onyx Ball which took place in August 1989.\nThe documentary How Do I Look partially focused on the ball community in Philadelphia.\nAtlanta\nAtlanta has one of the most prominent ball communities south of Washington, D.C. In 2018, Vogue Magazine published an article discussing Atlanta's underground ball scene.\nSeveral balls are held in Atlanta each year. Also several major houses established in other major cities have opened chapters in Atlanta.\nSt. Louis\nMost of St. Louis' ballroom scene is intertwined with the drag scene since the ballroom scene is not as major as the other metropolitan cities like Chicago, Atlanta, New York, etc. According to Mapping LGBTQ STL, the first ball in St. Louis was called 'Miss Fannie's Artists' Ball', which began in the mid-1950s and was organized by the Jolly Jesters Social Group, and the ball helped to raise funds for charitable institutions in the Black community. This was at a time when those participating were called 'female impersonators', whom we refer to today as drag performers. Currently, there is a distinct separation between both drag culture and performers and ball culture and performers, even though as stated previously, most artists and performers participate in both.\nThere is also a Kiki scene in St. Louis, smaller than both the drag and ballroom scene, but emerging. One of the organizers for the Kiki and mainstream balls is Maven Logik Lee and one of the commentators/MC is Meko Lee Burr. A major ballroom house in the scene is the House of Ebony, St. Louis chapter, founded by Spirit Ebony.\nSan Juan, Puerto Rico\nSan Juan, Puerto Rico also has a prominent ballroom community.\nLaboratoria Boricua de Vogue, or the House of Labori, is a major house in Puerto Rico that was established in 2021 and holds multiple balls each year. Puerto Ricans have influenced ball culture outside of the archipelago, with many New York houses having Puerto Rican presence and influence.\nHIV/AIDS epidemic\nThe ball community is heavily impacted by the HIV/AIDS epidemic, as transgender people of color and men who have sex with men (MSM) are the highest risk communities for contracting the virus in the US.  Since the 1980s, many notable members of the ball community died due to HIV/AIDS complications including Willi Ninja, Hector Xtravaganza, and Angie Xtravaganza. In the United States, MSM make up roughly 83% of all estimated HIV diagnoses in males. Young black men have been found to be especially at risk for contracting the virus. From 2006 to 2009, the percentage of black MSM aged 13–29 who were diagnosed with HIV increased by 48%. In 2022, new HIV diagnoses in MSM aged 13-24 decreased by 31%, although new HIV diagnoses amongst black MSM decreased by 16%. Many healthcare providers and medical service professionals have reached out to the community to perform research, teach sex education, offer free testing, and host balls to promote safe sex, such as the Latex Ball that is hosted by the Gay Men's Health Crisis (GMHC) in New York.\nResearchers with ProjectVOGUE also reached out to the ball community for assistance with vaccine trials and testing because minority participation is generally very low. The lack of participation stems from a historical distrust that African-Americans and Latinos have had of the government due to government-sponsored projects such as the Tuskegee syphilis experiment. ProjectVOGUE is led by researchers and professionals from the University of Rochester School of Medicine and Dentistry, Florida International University, the Fred Hutchinson Cancer Research Center, and the MOCHA (Men of Color Health Association) Center. They aimed to create a partnership with the Western New York ball community and held monthly meetings where safe sex methods were taught along with information about the HIV trial vaccine. Community members were initially incentivized to attend with $25 gift cards and transportation vouchers.\nThese joint meeting sessions also branched out to cover topics such as substance abuse, STI prevention, violence within the ball community, and more. ProjectVOGUE researchers utilized the House \"family\" structure by taking 15 \"mothers\", \"fathers\", founders, and more on a retreat to gauge the community's knowledge of HIV, while encouraging them to teach their \"children\" about HIV prevention. At the end of the study, participants had an increased knowledge about HIV, HIV vaccine research, and were more likely to participate in a study. The ballroom family structure amongst many Houses may also include HIV prevention activities internally, with house \"mothers\" helping educate their children on safe sex behaviors. However, HIV prevention workers have expressed concerns that additional measures are needed to ensure that such behaviors are applied in practice.\nMany other partnerships have formed across the country between the healthcare industry and the ball community to encourage HIV prevention. Although HIV/AIDS took, and continues to take, the lives of many ball participants, the community has grown tighter as a result of collective mourning and shared celebrations of life in the wake of grief. In the ballroom scene, the spread of HIV/AIDS has resulted in an increase of non-traditional thematic performances, as a means to express collective grief and solidarity while also fighting the stigmas associated with such diagnoses.\nHouses\nHouses function as alternative families, primarily consisting of Black and Latino LGBTQ+ individuals, and provide shelter for those who feel ostracized by conventional support systems. Houses are led by \"mothers\" and \"fathers\" who are experienced members of the ballroom scene, typically drag queens, gay men or transgender women, who provide guidance and support for their house \"children\". The children of a house are each other's \"siblings\".\nAll houses were founded in U.S. cities, mostly in the Northeast. These include New York City, Newark, Jersey City, Philadelphia, Pittsburgh, Baltimore, Washington, D.C., Atlanta as well as Chicago and Oakland, California. Houses that win trophies and gain recognition through years of participation (usually ten years) reach the rank of legendary. Houses with 20+ years of participation are deemed iconic. Typically, house members adopt the name of their house as their last name. Those currently not in a house carry the last name \"007\" (pronounced \"double-oh seven\").\nNotable houses\nNotable houses include:\n* The Royal House of LaBeija (founded by Crystal LaBeija, co-founder of ballroom culture; and chiefly run by Pepper LaBeija in the 1980s and 1990s)\n* The House of Aviance (founded by Mother Juan Aviance)\n* The International House of Chanel (founded by RR Chanel in 1974)\n* The House of Balenciaga (founded by Harold Balenciaga)\n* The House of Dupree (founded by Paris Dupree; currently closed).\n* The House of Ebony (founded by Larry Preylow Ebony and Richard Fears Ebony)\n* The House of Ferré (founded by Jasmin Alexander Ferré)\n* The House of Garçon (founded by Whitney and Shannon Garçon)\n* The House of Icon (founded by James Icon, Ashley Icon, and Sabrina Icon.\n* The House of Ladosha (founded by La Fem LaDosha and Cunty Crawford)\n* The House of Latex\n* The House of Lauren\n* The House of Labori (also known as Laboratoria Boricua de Vogue)\n* The House of Maison Margiela (founded by Vinny Margiela)\n* The House of Mizrahi (founded by Andre Mizrahi)\n* The Iconic International House Of Miyake-Mugler (founded by The Iconic Overall Founding Father David Miyake-Mugler, Raleigh and Julian Mugler)\n* The House of Ninja (founded by Willi Ninja)\n* The House of Pendavis\n* The House of Xclusive Lanvin (founded by Meechie, Keona, Kenny, and Kennidy Lanvin)\n-->\n* The House of Xtravaganza (founded by Hector Valle, and chiefly run by Hector Xtravaganza and Angie Xtravaganza in the 1980s)\n* The Royal House of Nina Oricci (founded by Gillette and Omari Mizrahi Oricci)\n* The House of West (founded by James, Afrika, Anthony, and Porkchop West)\n* The House of Du'Mure Versailles (founded by Aaliyah Du'Mure Versailles and Scott Alexander Du'Mure Versailles)\n* The House of Balmain (founded by Rodney Balmain)\n* The Gorgeous House of Gucci (founded by Gorgeous Jack Mizrahi Gucci, Kelly Mizrahi Gucci, Marlon Mizrahi Gucci and Trace Gucci)\n* The House of Amazon (founded by Leiomy Maldonado)\n* The Haus of Alpha Omega (AΩ) (founded Ceasar Williams)\nCompetition\nTo compete against each other, Houses walk a plethora of categories at a given ball. Participants dress according to the guidelines of the category in which they are competing. These guidelines are created by the promoters of a Ball and may/may not adhere to an overall theme for the Ball. Regardless, participants are expected to display appropriate adherence to the rules of a category. Balls range in scale from \"mini balls\" (typically characterized by a small selection of categories, few people walking, and a runtime of 1 to 2 hours) to mainstream events (characterized by the presence of most, if not all, categories in Ballroom, a significant number of participants for each category, and a runtime exceeding 4 hours with the largest of Balls capping at 8 hours).\nInfluences\nNew York's ballroom culture has had a highly significant cultural impact from the 1980s to the present day.\nFashion\nBall culture has influenced \"the über-puffed-up peacock sexuality\" of contemporary mainstream hip hop. A professor at New York University said about gay black culture that \"today's queer mania for ghetto fabulousness and bling masks its elemental but silent relationship to even more queer impulses toward fabulousness in the 1980s.\"\nMainstream entertainment\nIn September 2006, Beyoncé told a reporter from The Independent \"how inspired she's been by the whole drag-house circuit in the States, an unsung part of black American culture where working-class gay men channel ultra-glamour in mocked-up catwalk shows. 'I still have that in me', she says of the 'confidence and the fire you see on stage'\".\nDance\nThe most notable influence of ball culture on mainstream society is voguing, a dance style originating in Harlem ballrooms during the latter half of the 20th century. It appeared in the video for Malcolm McLaren's Deep in Vogue, released in 1989, and Madonna's \"Vogue\", released in 1990 (one year before the documentary Paris Is Burning). The dance group Vogue Evolution, from ''America's Best Dance Crew, has again sparked interest in voguing.\nVoguing started in Drag Balls held by the queer community of color. The competitions were divided up into Houses that then competed in different categories, including voguing. Named after Vogue magazine, voguing required dancers to mirror the poses held by models, with emphasis placed on arm and hand movements. Dancers would play out elaborate scenes such as applying makeup or taking phone calls while dancing down the catwalk. Dancer and choreographer Willi Ninja has been recognized as the \"Grandfather of Vogue\" and the dance, as well as Ninja himself, were covered in the documentary Paris is Burning.\nLanguage\nBallroom dialect became more widely used in gay slang, fashion industry jargon and mainstream colloquial language.\n* Reading: to read a person is to highlight and exaggerate all of the flaws of a person, from their ridiculous clothes, to their flawed makeup and anything else the reader can come up with. It is a battle of wit, in which the winner is one who gets the crowd to laugh the most.\n* Shade: shade is an art form that developed from reading''. Rather than aiming to insult, the speaker works with the medium of backhanded compliments. An example is to suggest that someone's beautiful dress makes people almost forget that she has five o'clock shadow.\n* Voguing: dance invented in 1970s Harlem and performed notably by Willi Ninja.\n* Mopping: shoplifting, usually clothes to walk in at a ball.\n* Noguing: a misrepresentation and/or misappropriation of the dance art form of \"voguing\".\nMusic\n| image             = Kevin Jz Prodigy Cunt in a Box.ogg\n| caption           = \"Cunt in a Box\" (2005) by ballroom MC Kevin Jz Prodigy\n| stylistic_origins =\n| cultural_origins  = 1990s to 2000s, New York\n| instruments       =\n}}\nA key element of balls is also the music, which is typically characterized by distinct uptempo beats that are overlaid with the \"raps\" of commentators or emcees. Lyrics are just as stylized as the beats and often praise queerness and femininity through typically vulgar language and usage of words like \"cunt\" and \"pussy\". Historically, the music featured at balls has been whatever is popular within the black LGBT community at the time, ranging from disco, to club music, to house, to rap and R&B. House music, the primary sound of the balls, is always upwards of 120 beats per minute and has African roots, which is reflected in the rhythm.\nToday, it is common for older house classics like \"Work This Pussy\" by Ellis D, \"Cunty\" by Kevin Aviance, and \"The Ha Dance\" by Masters at Work to be remixed into new hits by the current wave of DJs and producers. Ballroom Icon DJ's Vjuan Allure, Angel X, and MikeQ, were the first DJs considered to have developed the first remixes of ballroom sound. In order, Vjuan Allure was the first to remix \"The Ha Dance\" in 2000, followed by Angel X in 2002, and then MikeQ in 2005. Overall, ball culture has been a fertile ground for new forms of house music and other genres of electronic dance music through its DJs.\nAccording to PBS Sound Field interview with MikeQ, one of ball music's pioneers, ball music started as house music that was being played at ballroom parties. Over time, distinct features of ball music emerged, for instance the \"Ha\" crash, being placed on the every fourth of 4 beats and the minimal repetitive vocals, provided by ball commentators. The \"Ha\" crash cymbals often signify the time for ball dancers to strike a pose or hit the floor. Modern vogue music, along with house, incorporates elements of disco, funk, hip hop, contemporary R&B, Jersey club and other electronic music.\nThe culture has also influenced a wave of queer hip hop artists such as Zebra Katz, House of Ladosha, and Le1f.\nIn the media\nMost of the New York-based houses of the time appeared in the 1990 documentary film Paris Is Burning. In 1997, Emanuel Xavier published a seminal poetry manifesto titled Pier Queen. In 1999, his novel Christ Like featured the first fictional main character involved with the Houses. The 2016 film Kiki provided an updated portrait of the ball culture scene. In 2017, as part of a documentary series on New Zealand cultural identity, Vice Media produced an episode about New Zealand's ball culture, entitled \"FAFSWAG: Auckland's Underground Vogue Scene\".\nIn 2009, Logo TV aired the reality television series ''RuPaul's Drag Race'', a competition show where drag queens face off in a series of challenges heavily inspired by competitions commonly seen in ballroom culture. Created by prominent drag queen RuPaul Charles, competitors sew, act, sing, and lip sync for a chance to win $100,000, a one-year supply of Anastasia Beverly Hills cosmetics and the title of \"America's Next Drag Superstar\". The show has won a plethora of awards and spawned several spin-off series. The competition format, slang, and type of drag exhibited on the show is heavily influenced by ball culture.\nIn 2018, Viceland aired a docuseries, My House, following six people in the New York City ball culture.\nAdditionally, In the spring of 2018, the television series Pose premiered, set in New York and following participants in ball culture, as well as others in the 1980s Manhattan. The show was created by Steven Canals, Brad Falchuk, and Ryan Murphy. The show's third and final season aired on May 2nd, 2021.\nOn April 18, 2019, it was announced that the premiere of the feature film Port Authority, a New York love story between a black trans woman from the ballroom scene and a cisgender man from the Midwest would compete in the Un Certain Regard competition at the prestigious 2019 Cannes Film Festival. It was backed and produced by Martin Scorsese and RT Features. Leyna Bloom's debut in Port Authority was the first time in the festival's history that a trans woman of color was featured in a leading role. The film is credited with authentic casting and representation. Port Authority features scenes at balls, as well as during rehearsals and of queer youths' chosen family. Almost every actor that plays a role of significance in the ballroom scenes in the film, including competitors, judges, and house members, are active members of the ballroom scene today. Prior to being cast, Leyna Bloom became known internationally as a model and dancer, and she is active in the mainstream ballroom scene as New York City mother of the House of Miyake-Mugler. She is known in ball culture as the \"Polynesian Princess\", having made an international name for herself walking the category of face.\nIn 2020, the voguing reality competition web series Legendary premiered on the HBO Max streaming service. The series followed members of eight prominent houses as they navigate their way through nine balls (dancing, voguing, etc.), with a $100,000 prize awarded to the winner. The show was cancelled after three seasons in December 2022.\nIn 2022, the Canadian Broadcasting Corporation premiered the web series CBX: Canadian Ballroom Extravaganza, which challenged teams consisting of one ballroom performer and one emerging filmmaker to create short films highlighting performances in each of five ballroom categories.\nIn 2024, the Andrew Lloyd Webber musical Cats was reimagined off-Broadway at the Perelman Performing Arts Center as Cats: The Jellicle Ball, taking several pages from Ball culture. Junior LaBeija, the emcee featured in Paris is Burning, portrays Gus.\nSee also\n* Banjee\n* Drag show\n* Drag pageantry\n* Imperial Court System\nWorks:\n* Paris is Burning\n* Pose (TV series)\n* How Do I Look\n* Saturday Church\n* Legendary (TV series)\nGeneral:\n* LGBT culture in New York City\n* African-American LGBT community\n* Protect the Dolls\nReferences\nFurther reading\n* Jackson, Jonathan David  \"The Social World of Voguing\". Journal for the Anthropological Study of Human Movement. 12: 26-42.\n* [https://www.theatlantic.com/photo/2019/11/nyc-kiki-community/599830/ In the Kiki Ballroom Scene, Queer Kids of Color Can Be Themselves - The Atlantic]\nExternal links\n*Paris Is Burning at IMDb – feature-length documentary\n* Weems, M. (2008). A History of Festive Homosexuality: 1700–1969 CE. In The Fierce Tribe: Masculine Identity and Performance in the Circuit (pp.&nbsp;81–100). Logan, Utah: University Press of Colorado. doi:10.2307/j.ctt4cgq6k.14\n}}"
    }
  ]
}