{
  "content": [
    {
      "type": "text",
      "text": "# Balmoral, Queensland\n\n| pop                 = 4173\n| pop_year            =\n| pop_footnotes       =\n| established         =\n| local_map           = yes\n| zoom                = 13\n| postcode            = 4171\n| area                = 1.3\n| timezone            = AEST\n| utc                 = +10:00\n| dist1               = 8.4\n| dir1                = ENE\n| location1           = Brisbane CBD\n| dist2               =\n| dir2                =\n| location2           =\n| dist3               =\n| dir3                =\n| location3           =\n| dist4               =\n| dir4                =\n| location4           =\n| lga                 = City of Brisbane(Morningside Ward)\n| stategov            = Bulimba\n| fedgov              = Griffith\n| near-nw             = Bulimba\n| near-n              = Bulimba\n| near-ne             = Morningside\n| near-w              = Bulimba\n| near-e              = Morningside\n| near-sw             = Hawthorne\n| near-s              = Morningside\n| near-se             = Morningside\n}}\nBalmoral is a suburb in the City of Brisbane, Queensland, Australia. In the , Balmoral had a population of 4,173 people.\nGeography\nBalmoral is located  east of the Brisbane CBD.\nHistory\nThe name Balmoral is an anglicisation of Baile Mhoireil' which is Scottish Gaelic for 'beautiful residence' or 'majestic castle'.\nOn 25 June 1927, Panorama Heights estate containing 53 reserved sites was auctioned by Thornton and Pearce. The estate was located on Fifth Avenue, Balmoral.\nBalmoral State High School opened on 3 February 1958.\nOn 12 December 1915, Archbishop James Duhig laid the foundation stone for a Catholic school in Bulimba.  Saints Peter and Paul's Catholic School was operated by the Sisters of the Good Samaritan and opened to an estimated 200 students on 3 February 1916. On Sunday 6 February 1916 Duhig returned to bless and officially open the school. The school is now located within the boundaries of Balmoral.  In 1996 John Power was appointed the first lay principal.\nDemographics\nIn the , Balmoral had a population of 3,827 people, 51.8% female and 48.2% male. The median age of the Balmoral population was 35 years of age, 2 years below the Australian median. 74% of people living in Balmoral were born in Australia, compared to the national average of 69.8%; the next most common countries of birth were England 5.5%, New Zealand 4.2%, Ireland 1.1%, Scotland 0.8%, India 0.8%. 88.4% of people spoke only English at home; the next most popular languages were 0.9% Spanish, 0.7% Mandarin, 0.7% Greek, 0.5% Italian, 0.3% German.\nIn the , Balmoral had a population of 3,893 people.\nIn the , Balmoral had a population of 4,173 people.\nEducation\nSts Peter and Paul's School is a Catholic primary (Prep–6) school for boys and girls at 33 Alexandra Street (). In 2018, the school had an enrolment of 653 students with 41 teachers (36 full-time equivalent) and 30 non-teaching staff (20 full-time equivalent).\nBalmoral State High School is a government secondary (7–12) school for boys and girls on the corner of Thynne Road and Lytton Road (). In 2018, the school had an enrolment of 554 students with 56 teachers (53 full-time equivalent) and 26 non-teaching staff (22 full-time equivalent). It includes a special education program.\nThere are no government primary schools in Balmoral. The nearest government primary schools are Bulimba State School in neighbouring Bulimba to the north-west and Morningside State School in neighbouring Morningside to the south.\nAmenities\nThe Bulimba Memorial Bowls and Community Club is at 6 Quinn Street (). It offers competitive and social lawn bowls.\nNotable people\n* Laurel Edwards, presenter of 4KQ's Brisbane Breakfast Show and Channel 7's The Great South East.\nReferences\nExternal links\n*\n*"
    }
  ]
}