{
  "content": [
    {
      "type": "text",
      "text": "# Balrog Awards\n\nThe Balrog Awards were a set of awards given annually from 1979 to 1985 for the best works and achievements of speculative fiction in the previous year. The awards were named after the balrog, a fictional creature from J. R. R. Tolkien's Middle-earth legendarium. The awards were originally announced by editor Jonathan Bacon in Issue #15 of Fantasy Crossroads and presented at the Fool-Con II convention on April Fool's Day, 1979 at Johnson County Community College, Kansas. The awards were never taken seriously and are often referred to, tongue-in-cheek, as the \"coveted Balrog Awards\".\nAwards (by year)\n1979\n* Best Novel: Blind Voices, Tom Reamy\n* Best Short Fiction: \"Death from Exposure\", Pat Cadigan\n* Best Collection/Anthology: Born to Exile, Phyllis Eisenstein\n* Best Poet: Ray Bradbury\n* Best Artist: Tim Kirk\n* Best Amateur Publication: Shayol\n* Best Professional Publication: Age of Dreams, Alicia Austin\n* Best Amateur Achievement: Paul C. Allen (for Fantasy Newsletter and \"Of Swords & Sorcery\")\n* Best Professional Achievement: J. R. R. Tolkien and Donald M. Grant (tie)\n* Judges' Choice: Jonathan Bacon (for Fantasy Crossroads)\n* Judges' Choice: Andre Norton (for lifetime achievement)\n1980\n* Best Novel: Dragondrums, Anne McCaffrey\n* Best Short Fiction: \"The Last Defender of Camelot\", Roger Zelazny\n* Best Collection/Anthology: Night Shift, Stephen King\n* Best Poet: H. Warner Munn\n* Best Artist: Michael Whelan\n* Best Amateur Publication: Fantasy Newsletter\n* Best Professional Publication: Omni\n* Best Amateur Achievement: Paul Allen (for Fantasy Newsletter and \"Of Swords and Sorcery\")\n* Best Professional Achievement: Anne McCaffrey\n* SF Film Hall of Fame: 2001: A Space Odyssey and Star Wars (tie)\n* Fantasy Film Hall of Fame: Fantasia\n* Special Award: Ian Ballantine & Betty Ballantine\n1981\n* Best Novel: The Wounded Land, Stephen R. Donaldson\n* Best Short Fiction: \"The Web of the Magi\", Richard Cowper\n* Best Collection/Anthology: Unfinished Tales, J. R. R. Tolkien, edited by Christopher Tolkien\n* Best Poet: H. Warner Munn\n* Best Artist: Frank Frazetta\n* Best Amateur Publication: Fantasy Newsletter\n* Best Professional Publication: F&SF\n* Best Amateur Achievement: Paul C. Allen & Susan Allen (for Fantasy Newsletter)\n* Best Professional Achievement: George Lucas (for contributions, including the Star Wars saga)\n* SF Film Hall of Fame: The Empire Strikes Back\n* Fantasy Film Hall of Fame: The Wizard of Oz\n* Special Award: Jorge Luis Borges\n* Special Award: Fritz Leiber\n1982\n* Best Novel: Camber the Heretic, Katherine Kurtz\n* Best Short Fiction: \"A Thief in Korianth\", C. J. Cherryh\n* Best Collection/Anthology: Shadows of Sanctuary, Robert Lynn Asprin, ed.\n* Best Poet: Frederick Mayer\n* Best Artist: Real Musgrave\n* Best Amateur Publication: Eldritch Tales\n* Best Professional Publication: Omni\n* Best Amateur Achievement: Robert A. Collins (for saving Fantasy Newsletter)\n* Best Professional Achievement: George Lucas and Steven Spielberg (tie)\n* SF Film Hall of Fame: Forbidden Planet\n* Fantasy Film Hall of Fame: King Kong\n* Judges' Choice: Leo & Diane Dillon\n1983\n* Best Novel: The One Tree, Stephen R. Donaldson\n* Best Short Fiction: \"All of Us Are Dying\", George Clayton Johnson\n* Best Collection/Anthology: Storm Season, Robert Lynn Asprin, ed.\n* Best Poet: Frederick J. Mayer\n* Best Artist: Tim Hildebrandt\n* Best Amateur Publication: Shayol\n* Best Professional Publication: F&SF\n* Best Amateur Achievement: Allan Bechtold (for SF workshops)\n* Best Professional Achievement: Ben Bova (for writing and editing Omni and Analog)\n* SF Film Hall of Fame: The Day the Earth Stood Still\n* Fantasy Film Hall of Fame: The Dark Crystal\n* Special Award: Kirby McCauley\n1984\n* Best Novel: The Armageddon Rag, George R. R. Martin\n* Best Short Story: \"Wizard Goes A-Courtin'\", John Morressy\n* Best Collection/Anthology: Unicorn Variations, Roger Zelazny\n* Best Poet: Frederick J. Mayer\n* Best Artist: Real Musgrave\n* Best Amateur Publication: Fantasy Newsletter\n* Best Professional Publication: F&SF\n* Best Amateur Achievement: Stan Gardner (for saving the Balrogs)\n* Best Professional Achievement: Pendragon Gallery (for promoting fantasy artwork)\n* SF Film Hall of Fame: Blade Runner\n* Fantasy Film Hall of Fame: Bambi\n* Judges' Choice: Mercer Mayer (for educating children in fantasy art)\n1985\n* Best Novel: The Practice Effect, David Brin\n* Best Short Story: \"A Troll and Two Roses\", Patricia A. McKillip\n* Best Collection/Anthology: Daughter of Regals and Other Tales, Stephen R. Donaldson\n* Best Poet: Ardath Mayhar\n* Best Artist: Richard Pini & Wendy Pini\n* Best Amateur Publication: Eldritch Tales\n* Best Professional Publication: Masques, J. N. Williamson, ed.\n* Best Amateur Achievement: David B. Silva (for The Horror Show)\n* Best Professional Achievement: Hap Henriksen (for the National SF/Fantasy Hall of Fame)\n* SF Film Hall of Fame: Starman\n* SF Film Hall of Fame: E.T. The Extraterrestrial\n* Fantasy Film Hall of Fame: Raiders of the Lost Ark\n* Special Award: Lester del Rey\nSee also\n* Bram Stoker Award\n* Hugo Award\n* Nebula Award\n* World Fantasy Award\n* List of science fiction awards\nReferences"
    }
  ]
}