{
  "content": [
    {
      "type": "text",
      "text": "# Balswarup Choubey\n\n| birth_place             = Washim, Maharashtra, India\n| death_date              =\n| death_place             = Nagpur, Maharashtra, India\n| restingplace            =\n| restingplacecoordinates =\n| othername               =\n| occupation              = NephrologistMedical academic\n| yearsactive             =\n| known for               = Medical academics\n| spouse                  = Pramila\n| domesticpartner         =\n| children                = 3\n| website                 =\n| awards                  = Padma Shri\n}}\nBalswarup Chaubey was an Indian nephrologist and medical academic. A Fellow of the Royal College of Physicians of London, Chaubey was the retired dean of Government Medical College and Hospital (GMCH) Nagpur and had served as the secretary of the Maharashtra State Medical Teachers Association.\nBorn on 2 June 1934 at Washim in the western Indian state of Maharashtra to Kesar and Bal Mukund Chaubey, a police officer, Chaubey did his schooling at English High School, Nagpur and graduated in medicine from the Government Medical College, Nagpur. After specializing in Nephrology, he started his career at his alma mater as a lecturer and rose in ranks to become the Dean of the Department of Medicine of the college as well as Nagpur University in 1982, holding positions as a reader (1963–68), as an associate professor (1968–72), and as a professor and the head of the department (1972–82). He superannuated from the institution in 1992. The Government of India awarded him the fourth highest civilian honour of the Padma Shri, in 2009, for his contributions to Medicine.\nChaubey was married to Pramila and the couple had a son, Sameer Chaubey, who is a practicing nephrologist, and two daughters, Sarika and Swatee. He died on 20 November 2011 succumbing to the complications developed from a chest infection.\nSee also\n* Government Medical College, Nagpur\nReferences"
    }
  ]
}