{
  "content": [
    {
      "type": "text",
      "text": "# Balt dynasty\n\nThe Balt dynasty or Balth dynasty ( or Balthi, i.e., Balts) was the first ruling family of the Visigoths from 395 until 531. They led the Visigoths into the Western Roman Empire in its declining years.\nAccording to the historian Ablabius, as reported by the historian Jordanes, the Visigoths had been ruled by the Balti since ancient times. Jordanes, however, says that all the Goths were formerly ruled by the Amal dynasty. Relying on Cassiodorus, Jordanes says that the Balts were \"second\" after the Ostrogothic Amals. He claims that the family was named from long ago for its daring: \"Baltha, which [in Gothic] means bold\" (Baltha, qui est audax). Historian Herwig Wolfram theorizes that the name may derive from Pliny the Elder's island of Baltia (i.e., isle of the Balts), which he also calls Basilia (i.e., royal land).\nThe Visigoths as a nation were formed under the rule of Alaric I, the first named Balt, only in 395. He famously sacked Rome in 410. His descendants continued to rule down to 531, when on the death of Amalaric the line went extinct. In 507, the Visigoths were defeated by the Franks at the Battle of Vouillé and lost most of their kingdom. In 511, the Ostrogothic king Theoderic the Great intervened to depose the Balt king Gesalec. He ruled himself until his death in 526, when Amalaric succeeded him. Theoderic's intervention is often credited with saving the Visigothic kingdom, but it ended the Balt dynasty.\nThe private wealth (res privata) of the Balt kings, which had been a foundation of their legitimacy, was transformed into the royal treasury (thesaurus regalis) and became state property after 531. The dynastic principle was abandoned and kings were chosen by election until the fall of the Visigothic kingdom in 711.\nList of rulers\n*Alaric I (395–410)\n*Ataulf (410–415)\n*Wallia (415–419)\n*Theodoric I (419–451)\n*Thorismund (451–453)\n*Theodoric II (453–466)\n*Euric (466–484)\n*Alaric II (484–507)\n*Gesalec (507–511)\n*Amalaric (526–531)\nNotes\nFurther reading\n* Peter Heather: Cassiodorus and the Rise of the Amals. Genealogy and the Goths under Hun Domination, in: Journal of Roman Studies 79 (1989), S. 103–128.\n* Peter Heather: Goths and Romans, 332–489, Oxford 1991.\n* H. Kuhn/R. Wenskus: Amaler, in: Reallexikon der germanischen Altertumskunde, Bd. 1, S. 246–248.* Henry Bradley, The Goths: from the Earliest Times to the End of the Gothic Dominion in Spain. Second edition, 1883, New York: G.P. Putnam's Sons, chapter 1."
    }
  ]
}