{
  "content": [
    {
      "type": "text",
      "text": "# Bambleshwari Temple\n\n|coordinates_footnotes=\n|map_type             = India Chattisgarh\n|map_caption          = Location in Chhattisgarh\n|country              = India\n|state                = Chhattisgarh\n|district             = Rajnandgaon\n|locale               = Dongargarh\n|deity                = Bambleshwari (Durga)\n|tradition            =\n|festivals            = Navaratri, Ram Navami, Jyoti Kalash\n|architecture         = Nagara Style\n|established          =\n|website              =\n}}\nBambleshwari Temple is a Hindu temple, located at Dongargarh in Rajnandgaon district, Chhattisgarh, India. It is on a hilltop of 1600 feet. This temple is referred as Badi Bambleshwari. Another temple at ground level, the Chhotti Bambleshwari is situated about 1/2&nbsp;km from the main temple complex. These temples are revered by lakhs of people of Chhattisgarh who flock around  the shrine during the Navratris of Kavar (during Dusshera) and Chaitra (during Ram Navami).  There is tradition of lighting Jyoti Kalash during Navaratris here.\nLocation\nDongargarh is 107 kilometers from Raipur, via Bhilai, Durg and Rajnandgaon. Dongargarh does not exactly fall on the massive Mumbai highway, a diversion some 25&nbsp; km before, from the Calcutta-Calcutta-Mumbai National Highway (NH #6) leads the vehicle through lush green vegetation and mild forests on a narrow winding single road.\nDongargarh is 40&nbsp; km from district headquarters Rajnandgaon and is well connected with buses from Rajnandgaon. Dongargarh as well as trains. It is on the Mumbai - Howrah main line at a distance of 200&nbsp;km from Nagpur and 100&nbsp;km from Raipur. The nearest airport is at Raipur Airport.\nThe rope-way in the hill on which the temple is located, is another attraction to the tourists in the city. It is very popular with the tourists as it is the only rope-way that has been set up in Chhattisgarh state.\nLegend\nfrom Maa Bamleshwari Temple on a hilltop]]\nDongar means mountains in Chhattisgarhi language and Marathi Language while Garh means fort. The legend goes that around 2200 years ago, Raja Veersen, a local king, was childless and upon the suggestions of his royal priests performed puja to the gods. Within a year, the queen gave birth to a son whom they named Madansen. Raja Veersen considered this a blessing of Lord Shiva and Parvati and constructed a temple here..In the temple of Dongargarh, king Vikramaditya went to commit suicide but Devi Bamleshwari appeared and stopped him from doing it.\nFor reaching the top, there are total 1000 steps that lead to the temple.\nRopeway accident\nOn 29 February 2016 in a ropeway mishap, a woman was killed and three others were injured. On 18 February 2021, a labourer died in a similar accident. but both the accident happened in old ropeway.\nOnline facilities\n\"The temple provides the facility of Online Ropeway Ticket Booking and Online Jyoti Kalash Booking\n* [https://live.bamleshwari.org Live Darshan (Video streaming) of Both Temples]\n* [https://portal.bamleshwari.org Online Booking Portal for Ropeway Tickets and Jyotikalash]\nSee also\n* List of Hindu temples in India\nGallery\nfile:Idol- bimbleswari.JPG |idol of bambleshwari\nfile:Shrine bimbleswari.JPG |the garbhagruha\nfile:Pond-bimbleswari.JPG |view of the pond in front of temple\nfile:Poster bimbleswari.JPG  |poster of place and offerings in bambleshwari temple\nfile:Way to bimbleswari.JPG  |way to  bambleshwari temple\nfile:View bimbleswari.JPG |view of dongargarh from bambleshwari temple\nfile:Devi bimbleswari.JPG |devi bambleshwari\nfile:Pondview bimbleswari.JPG |view of dongargarh from bambleshwari temple\nfile:Ropway bimbleswari.JPG |ropway of dongargarh from bambleshwari temple\nfile:Passage bimbleswari.JPG  |passge from dongargarh to bambleshwari temple\nfile:Town bimbleswari.JPG  |town dongargarh\nReferences\nExternal links\n* [https://bamleshwari.org Official Website of Bamleshwari Temple]\n* [http://www.tourismofchhattisgarh.com/tours-to-chhattisgarh/tours-to-rajnandgaon.html Tours to Rajnandgaon]\n*[https://plus.google.com/118158249510485057488/about?hl=ml&gl=in google+ - bambleshwari temple]"
    }
  ]
}