{
  "content": [
    {
      "type": "text",
      "text": "# Bambang Wibawarta\n\nin |native_name= instead.-->\n| honorific_suffix    =\n| image               = University of Indonesia rector election 2024 165 (Bambang Wibawarta).jpg\n| image_size          =\n| image_upright       =\n| smallimage          =\n| smallimage_alt      =\n| alt                 =\n| caption             =\n| order               =\n| office              = Secretary General of the Ministry of Culture\n| status              =\n| term_start          = November 2024\n| 1blankname          = Minister\n| 1namedata           = Fadli Zon\n| predecessor         = office established\n| office1             = Member of the University of Indonesia Board of Trustees\n| term_start1         = 23 March 2024\n| 1blankname1         = Chairman\n| 1namedata1          = Yahya Cholil Staquf\n| office2             = Rector of the University of Indonesia(acting)\n| term_start2         = 2 October 2014\n| term_end2           = 4 December 2014\n| predecessor2        = Gumilar Rusliwa SomantriDjoko Santoso (acting)Muhammad Anis (acting)\n| successor2          = Muhammad Anis\n| office3             = Deputy Rector for Academic and Student Affairs of the University of Indonesia\n| term_start3         = 28 June 2013\n| term_end3           = 16 December 2019\n| predecessor3        = Muhammad Anis\n| successor3          = Rosari Saleh\n| office4             = Dean of the Faculty of Humanities of the University of Indonesia\n| term_start4         = 3 April 2008\n| term_end4           = 28 June 2013\n| predecessor4        = Ida Sundari Husein\n| successor4          = Adrianus Laurens Gerung Waworuntu\n| pronunciation       =\n| birth_date          =\n| birth_place         = Yogyakarta, Indonesia\n| death_date          =\n| death_place         =\n| death_cause         =\n| resting_place       =\n| resting_place_coordinates =\n| citizenship         =\n| nationality         =\n| party               =\n| otherparty          =\n| height              =\n| spouse              =\n| partner             =\n| relations           =\n| children            =\n| parents             =\n| mother              =\n| father              =\n| relatives           =\n| residence           =\n| education           = University of Indonesia (S.S., Dr., Prof.)Tohoku University (MA)\n| alma_mater          =\n| occupation          =\n| profession          =\n| known_for           =\n| salary              =\n| cabinet             =\n| committees          =\n| portfolio           =\n| awards              =\n| blank1              =\n| data1               =\n| blank2              =\n| data2               =\n| blank3              =\n| data3               =\n| blank4              =\n| data4               =\n| blank5              =\n| data5               =\n| signature           =\n| signature_alt       =\n| signature_size      =\n| website             =\n| nickname            =\n}}\nBambang Wibawarta (born 23 October 1966) is a professor of literature at the University of Indonesia. He is currently a member of the University of Indonesia (UI) board of trustees for the 2024-2029 period and the secretary general of the Ministry of Culture since 2024. He was previously an academic administrator at UI and served as the dean of the humanities faculty from 2008 to 2013 and deputy rector for academic and student affairs from 2013 to 2019.\nEarly life and education\nBambang was born in Yogyakarta on 23 October 1966. He graduated from elementary school and junior high school in 1977 and 1981. He completed his high school education in 1984 and studied Japanese literature at the University of Indonesia, where he graduated in May 1989.\nUpon completing his undergraduate studies, Bambang became a research student at the Tohoku University. He undertook master studies in literature at the same university, which he completed in March 1994. He later received a doctoral degree in Japanese area studies from the University of Indonesian on 28 October 1999 with a cum laude distinction. He then became a postdoctoral researcher at the International Christian University from October 2004 to 2006.\nAcademic career\nBambang began his academic career as a lecturer in Japanese literature at the University of Indonesia in 1989. He also lectured at the Japanese Area Studies in UI's graduate school since receiving his doctoral degree in 1999. After completing his postdoctoral research, Bambang was appointed as the executive director of UI's Center for Japanese Studies. He assumed this position until July 2008. According to Japan's ambassador to Indonesia Kanasugi Kenji, Bambang prioritized cordiality as a director and implemented an online system to foster friendly research environment for researchers and student alike.\nBambang assumed office as the dean of humanities faculty of the University of Indonesia on 3 April 2008 by UI rector Gumilar Rusliwa Somantri after passing a series of election a week earlier. On 31 July 2012, Gumilar issued a letter which sacked seven faculty deans, including Bambang, and appointed their first deputy as the acting dean. However, the decision was later rendered as invalid after a meeting between UI board of trustees and the education minister. The minister instructed Gumilar to revoke the letter.\nOn 16 January 2013, Bambang was appointed as a full professor in literature. His inaugural speech, titled ''The Pandora's Box of the National Cultural Policy,'' emphasized the importance of cultural strategies in various sectors such as politics, government, law, economy, education, and more. The speech also highlighted the need for cultural policies to build local wisdom and resist the negative impacts of globalization.\nOn 28 June 2013, Bambang was appointed as UI's first deputy rector, which was responsible for academic and student affairs. He replaced Muhammad Anis, the previous deputy rector who became the acting rector of the university. After Anis won the 2014 rector election, Bambang replaced him as the acting rector on 2 October 2014. Anis later re-appointed Bambang as the first deputy rector on 15 December 2014.\nIn the 2019 UI rector election, Bambang ran as one of the candidates. He managed to pass the selection process until there was seven candidates left. In the midst of the election process, Bambang was accused of being a Hizb ut-Tahrir member, which was banned by the Indonesian government. Bambang denied these allegations, pointing out his frequent invitations to speak at events organized by Nahdlatul Ulama (NU) and other reputable institutions as evidence of his credibility. He, however, failed to pass the selection process, with Ari Kuncoro from the economics and business faculty being elected as the new rector, replacing Muhammad Anis. Ari later replaced Bambang with Rosari Saleh from the mathematics and natural science faculty as first deputy rector on 16 December 2019.\nBambang was selected as a member of UI's board of trustees for a five-year term, representing the lecturers, on 23 March 2024. Bambang was later appointed to chair the board of trustees special committee on rector election, which was responsible for reporting and presenting election rules, refining these rules based on input, proposing the formation of a candidate screening committee (P3CR), determining shortlisted candidates, overseeing and evaluating the P3CR, and narrowing down the candidates from 20 to 7. The final round of the election, which was held on 23 September 2024, saw dean of the engineering faculty Heri Hermansyah being elected as UI's rector with 18 out of 23 votes.\nand UI rector Heri Hermansyah.]]\nAround October 2024, Bambang was appointed as the secretary general of the newly formed Ministry of Culture, headed by Minister Fadli Zon. Bambang officially assumed the office on 16 December 2024.\nPersonal life\nBambang is married to Yukie Ota, a Japanese citizen. The couple currently lives in Cilandak, South Jakarta.\nReferences"
    }
  ]
}