{
  "content": [
    {
      "type": "text",
      "text": "# Banana Culture\n\nBanana Culture Entertainment () or simply Banana Culture, was a South Korean entertainment company. It was a division of the Chinese company Banana Culture Music. On March 25, 2020, it was reported that Banana Culture would be closing.\nHistory\nThe company was founded in 1984 under the name Yedang Planning by Byun Dae-yun (real name Byun Doo-seop). On October 28, 1992, the company became a corporation under the name Yedang Sound. In May 2000, the company was renamed to Yedang Entertainment.\nIn March 2010, the company was renamed again to Yedang Company.\nIn March 2014, Yedang Company was acquired by Wellmade StarM and start using new name Wellmade Yedang .\nIn June 2014, girl group EXID signed with Yedang when their original label AB Entertainment was acquired by Wellmade Yedang. The head of the label and their producer, Shinsadong Tiger, also joined Wellmade Yedang. It was confirmed that Shinsadong Tiger would remain as the producer of EXID.\nIn December 2015, Wellmade Yedang officially separate and Yedang became an independent company.\nIn 2016, Yedang officially changed their name after signing a merger agreement with Banana Culture Music and announced that the brand of Yedang would returning to the family of former Yedang Company Chairman Byun Doo-seop.\nOn March 25, 2020, it was reported that Banana Culture would be closing, with employees and executives stepping down and the departure of EXID. However, the label CEO denied this statement, saying that the label still has many Chinese shares and they would continue to manage TREI and other female trainees. Despite this, their website was deleted after TREI's disbandment.\nArtists\nKorea\nSoloists\n* Shin Zisu\n*Lee Youjin\nActors/Actress\n* Lee Jung Hyun (2017–present)\n*Ha Seung Ri (2017–2020)\nFormer artists\nKorea\nFormer recording artists\n*Seo Taiji and Boys (1992–1996)\n*Deux (1993–1995)\n*Tim (2005–2006)\n*C-Clown (2012–2015)\n*EXID (2014–2020)\n*Sung Eun (2015–2020)\n*TREI (2019–2020)\nFormer actors/actresses\n*Lim Ju-hwan (2004–2011)\nNotes\nReferences"
    }
  ]
}