{
  "content": [
    {
      "type": "text",
      "text": "# Bandelier National Monument\n\n|display=inline, title}}\n| map = New Mexico#USA\n| relief = yes\n| created = February 11, 1916\n| governing_body = National Park Service\n| area_acre = 33677\n| area_ref =\n| visitation_num = 210,941\n| visitation_year = 2022\n| visitation_ref =\n| embedded =\n| added = October 15, 1966\n| increase = December 10, 2014\n| increase_refnum = 14001017\n| refnum = 66000042\n}}\n| website = [https://www.nps.gov/band/index.htm Bandelier National Monument]\n}}\nBandelier National Monument is a  United States National Monument near Los Alamos in Sandoval and Los Alamos counties, New Mexico.  The monument preserves the homes and territory of the Ancestral Puebloans of a later era in the Southwest. Most of the pueblo structures date to two eras, dating between AD 1150 and 1600.\nThe monument comprises  of the Pajarito Plateau, on the slopes of the Jemez volcanic field in the Jemez Mountains. Over 70% of the monument is wilderness, with over one mile of elevation change, from about  along the Rio Grande to over  at the peak of Cerro Grande on the rim of the Valles Caldera, providing for a wide range of life zones and wildlife habitats.  of road and more than  of hiking trails are built. The monument protects Ancestral Pueblo archeological sites, a diverse and scenic landscape, and the country's largest National Park Service Civilian Conservation Corps National Landmark District. Two-thirds of the park, , is designated as the Bandelier Wilderness Area. Motorized travel and permanent structures are forbidden in the Wilderness.\nBandelier was designated by President Woodrow Wilson as a national monument on February 11, 1916, and named for Adolph Bandelier, a Swiss-American anthropologist, who researched the cultures of the area and supported preservation of the sites.  The park infrastructure was developed in the 1930s by crews of the Civilian Conservation Corps and is a National Historic Landmark for its well-preserved architecture.  The National Park Service cooperates with surrounding Pueblos, other federal agencies, and state agencies to manage the park.\nGeography and geology\nIn October 1976, roughly 70% of the monument, , was included within the National Wilderness Preservation System. The park's elevations range from about  at the Rio Grande to over  at the summit of Cerro Grande. The Valles Caldera National Preserve adjoins the monument on the north and west, extending into the Jemez Mountains.\nMuch of the area was covered with volcanic ash (the Bandelier Tuff) from an eruption of the Valles Caldera volcano 1.14 million years ago. The tuff overlays shales and sandstones deposited during the Permian Period and limestone of Pennsylvanian age. The volcanic outflow varied in hardness; the Ancestral Puebloans broke up the firmer materials to use as bricks, while they carved out dwellings from the softer material.\nHistory\nHuman presence in the area has been dated to over 10,000 years  before present. Permanent settlements by ancestors of the Puebloan peoples have been dated to 1150 CE; these settlers had moved closer to the Rio Grande by 1550. The distribution of basalt and obsidian artifacts from the area, along with other traded goods, rock markings, and construction techniques, indicate that its inhabitants were part of a regional trade network that included what is now Mexico. Spanish colonial settlers arrived in the 18th century. The Pueblo Jose Montoya brought Adolph Bandelier to visit the area in 1880. Looking over the cliff dwellings, Bandelier said, \"It is the grandest thing I ever saw.\"\nBased on documentation and research by Bandelier,  support began for preserving the area and President Woodrow Wilson signed the declaration creating the monument in 1916. Supporting infrastructure, including a lodge, was built during the 1920s and 1930s. The structures at the monument built during the Great Depression by the Civilian Conservation Corps constitute the largest assembly of CCC-built structures in a national park area that has not been altered by new structures in the district. This group of 31 buildings illustrates the guiding principles of National Park Service Rustic architecture, being based on local materials and styles. It has been designated as a national landmark district.\nDuring World War II, the monument area was closed to the public for several years, since the lodge was being used to house personnel working on the Manhattan Project at Los Alamos to develop an atom bomb. In 2019, Senator Martin Heinrich (D-NM), announced  plans to introduce legislation to redesignate Bandelier National Monument as a national park and preserve.\nMonument description\nFrijoles Canyon contains a number of ancestral pueblo homes, kivas (ceremonial structures), rock paintings, and petroglyphs. Some of the dwellings were rock structures built on the canyon floor; others were cavates produced by voids in the volcanic tuff of the canyon wall and carved out further by humans. A , predominantly paved, \"Main Loop Trail\" from the visitor center affords access to these features. A trail extending beyond this loop leads to Alcove House (formerly called Ceremonial Cave, and still so identified on some maps), a shelter cave produced by erosion of the soft rock and containing a small, reconstructed kiva that hikers may enter via ladder.\nDetail of natural cavates and architectural carving into the soft tuff\nAncient pueblo sites\nOne site of archaeological interest in the canyon is Tyuonyi (Que-weh-nee) Pueblo and nearby building sites, such as Long House. Tyuonyi is a circular pueblo site that once stood one to three stories tall. Long House is adjacent to Tyounyi, built along and supported by the walls of the canyon. A reconstructed Talus House is also found along the Main Loop Trail.\nThese sites date from the Pueblo III Era (1150 to 1350) to the Pueblo IV Era (1350 to 1600). The age of the Tyuonyi construction has been fairly well established by the tree-ring method of dating, widely and successfully used by archeologists in the Southwest. Ceiling-beam fragments recovered from various rooms have been dated between 1383 and 1466. This general period seems to have been a time of much building in Frijoles Canyon; a score of tree-ring dates from the Rainbow House ruin, which is down the canyon a half-mile, also fall in the early and middle 15th century. Perhaps the last construction anywhere in Frijoles Canyon occurred close to 1500, with a peak of population reached near that time or shortly thereafter.\nThe century before Tyuonyi's construction is thought to have been characterized by intense change and migration in the Ancestral Puebloan culture. The period of highest population density in Frijoles Canyon corresponds to a period contemporaneous with a wide-scale migration of Ancestral Puebloans away from the Four Corners area, which was suffering a deep drought, environmental stress, and social unrest in the Pueblo III period. Scholars believe that some Ancestral Puebloan groups relocated into the Rio Grande valley, southeast of their former territories, founding Tyuonyi and nearby sites. The pueblo was abandoned by 1600. The inhabitants relocated to pueblos near the Rio Grande, such as Cochiti and San Ildefonso Pueblos, which have been occupied ever since.\nOther, more rustic trails enter the backcountry, which contains additional smaller archaeological sites, canyon/mesa country, and some transient waterfalls. Hikes to many of these areas are feasible and range in length from short (\nFile:Bandelier cliff.jpg|Main cliff on loop trail\nFile:Band paintedcave.jpg|Painted Cave, Ancestral Puebloan pictographs in the Bandelier backcountry\nFile:Band backcountry.jpg|Forested mesa tops are framed by the San Miguel Mountains in the Bandelier Wilderness\nFile:Basketmaking, P Velarde.jpg|Basketmaking by Pablita Velarde, . Bandelier museum collection\nFile:Bandelier National Monument in September 2011 - Visitor Center.JPG|Visitor Center\nFile:Bandelier Headquarters.jpg|Park headquarters\nFile:Tyuonyi-Pueblo,-Detail.jpg|Tyuonyi Pueblo, Detail\nFile:Tent-Rocks.jpg|Tent-Rocks\nFile:Cliff-Dwellings,-Detail.jpg|Cliff Dwellings detail, showing stone and wood use, Bandelier National Monument, NM\nFile:Cliff-Dwelling-Detail3.jpg|Cliff Dwelling detail, Bandelier National Monument, NM\nFile:Bandelier_cliff_dwellings_with_ladder.jpg|The face of a small cliff showing dwellings and a reconstructed ladder to access them\nFile:Pictograph at Bandelier National Monument NM 2023-10-17 17-08-47.jpg|Petrograph in Frijoles Canyon\nNational Park Service Rustic style\n| built =\n| architect = Lyle Bennett; Et al.\n| architecture = Pueblo Revival\n| designated_nrhp_type = May 28, 1987\n| added = May 28, 1987\n| refnum = 87001452\n}}\nBandelier has excellent examples of CCC-constructed National Park Service Rustic style of architecture, built during the Great Depression by work crews while the area was managed by the U.S. Forest Service.   The Bandelier CCC camp employed several thousand men from 1933 to 1941 as a New Deal works project, and built roads, trails, and park buildings and other amenities.  In 1943, camp provided temporary housing for scientists, technicians, and their families involved in the secret Manhattan Project at nearby Los Alamos.  Construction contractors were housed there in early 1944.\nThe park's service area was designed to resemble a traditional Pueblo village.   Most of the CCC-built buildings are set around a wooded plaza at the end of the main access road (also a CCC construction), and were designed to house the monument staff, provide accommodations and services for visitors, and included maintenance areas.  These historic structures include the Frey Lodge (park headquarters); the guest cabins (employee housing), the gift shop, and the park visitor center.  The CCC crews also built furniture for these facilities, and artists paid by the Federal Arts Project provided artwork.  The preserved elements of the CCC construction were designated a National Historic Landmark in 1987.\nSee also\n*List of national monuments of the United States\n*List of National Historic Landmarks in New Mexico\n*\n*National Register of Historic Places listings in Los Alamos County, New Mexico\n*National Register of Historic Places listings in Santa Fe County, New Mexico\nReferences\nFurther reading\n*\nExternal links\n* [https://www.nps.gov/band/index.htm Bandelier National Monument] at the National Park Service\n* [https://web.archive.org/web/20070704162523/http://www.nps.gov/history/museum/exhibits/band/imgal.html Bandelier National Monument Museum]\n* [https://web.archive.org/web/20030818080421/http://tps.cr.nps.gov/nhl/detail.cfm?ResourceId=2023&ResourceType=District Bandelier CCC Historic District]. National Historic Landmarks\n* [https://web.archive.org/web/20080516144113/http://www.friendsofbandelier.org/ Friends of Bandelier].\n* [https://web.archive.org/web/20070625090928/http://www.nps.gov/history/nr/travel/amsw/ Discover Our Shared Heritage – American Southwest]. National Register of Historic Places travel itinerary"
    }
  ]
}