{
  "content": [
    {
      "type": "text",
      "text": "# Banda Sinfónica da Guarda Nacional Republicana__disambig_1\n\n| label           =\n| associated_acts = Army Symphonic BandPortuguese Navy BandAir Force Music Band\n| website         =\n| current_members =\n| past_members    =\n| module          = Director of Music: Maestro Capitão João Afonso Cerqueira\n| module2         =\n| module3         =\n}}\nThe Banda Sinfónica da Guarda Nacional Republicana (Symphonic Band of the National Republican Guard) is a Portuguese military and uniformed symphonic band based in Lisbon. Currently, the band is dependent on the State Security and Honors Unit, having the ability to perform activities at the level of state as well as military, cultural and recreational ceremonies. It is currently led by Maestro Capitão João Afonso Cerqueira.\nHistory\nIn 1838, by decree of Dona Maria II of Portugal (the then Queen of Portugal), the Banda da Guarda Municipal was established, which later, with the implantation of the Republic, became known as the GNR Band. Its first major international tour was in 1892 when it competed in the International Military Band Contest in Badajoz. It also made a tour of Spain upon the establishment of the Republic nd in 1930, toured its former colonial possession of Brazil. It would return to Brazil in 1965 to represent Portugal in the IV Centenary of the Rio de Janeiro Foundation. It participates in the NATO-TAPTOE in the Netherlands in 1963. In 1996, it visited Basel, Switzerland to participate in the 5th International Festival of Police Bands. Also noteworthy are the traditional New Year's concerts attended by the President of Portugal. In 2005 the band was distinguished with the “Amália” award in the Classical Music category. In 2006, the Band was conferred by the President Jorge Sampaio, the title of Honorary Member of the Order of Infante D. Henrique.\nDirectors\nSince 1838, the Band has been directed by the following conductors:\n*Jerónimo Soller (1838–1878)\n*Jacques Murat (1878)\n*Manuel Augusto Gaspar (1878–1901)\n*António Gonçalves da Cunha Taborda (1901–1911)\n*Joaquim Fernandes Fão (1911–1935)\n*Lourenço Alves Ribeiro (1935–1959)\n*Manuel da Silva Dionísio (1960–1973)\n*Joaquim Alves de Amorim (1974–1982)\n*Idílio Martins Fernandes (1982–1989)\n*Vasco da Cruz Flamino (1989–2001)\n*Jacinto Coito Abrantes Montezo (2001–2008)\n*Maestro Tenente Coronel João Afonso Cerqueira (2008–present)\nReferences"
    }
  ]
}