{
  "content": [
    {
      "type": "text",
      "text": "# Baneswar Saikia\n\n| birth_place         = Dumdumia Village, Nagaon, Assam, India\n| alma_mater          = Dhing K.B. High School,  Cotton College,  Darrang College\n| death_date          =\n| death_place         =\n| occupation          = Politician,\nProfessor,\nSocial Worker,\nMarxist Economist,\nColumnist,\nWriter,\nLawyer\n| office              = Assam State Secretary of Revolutionary Communist Party of India\n| term_start          = 1968\n| term_end            = 1975\n| office1             = Member of Assam Legislative Assembly\n| term_start1         = 1978\n| term_end1           = 1983\n| constituency1       = Batadroba (Vidhan Sabha constituency)\n| office2             = Assam State Secretary of Revolutionary Communist Party of India\n| term_start2         = 1979\n| term_end2           = 1994\n| office3             = General Secretary of Revolutionary Communist Party of India\n| term_start3         = 1994\n| term_end3           = 2000\n| predecessor3        = Rasik Bhatt\n| successor3          = Bimalananda Mukherjee\n| office4             = General Secretary of Revolutionary Communist Party of India\n| term_start4         = 2003\n| term_end4           = 2006\n| predecessor4        = Bimalananda Mukherjee\n| successor4          = Biren Deka\n| party               = Revolutionary Communist Party of India\n| spouse              = Nirada (Deka) Saikia\n| children            = 3 daughters\n| website             =\n| footnotes           =\n| date                =\n| year                =\n| source              =\n| image               = Professor_Baneswar_Saikia.jpg\n| caption             = Baneswar Saikia in 2017\n| parents             = Late Tularam Saikia (Father)\nLate Sadari Saikia (Mother)\n}}\nBaneswar Saikia (born 8 October 1931, Nagaon) is an Indian communist politician. He belongs to Revolutionary Communist Party of India.\nCareer\nHe joined the party in 1947, when he was in the eighth standard. Baneswar Saikia is the son of Late Tularam Saikia and Late Sadari Saikia. He is a former lawyer, a former MLA, a retired professor of Anandaram Dhekial Phookan College of Nagaon, the founder and first Head of the Department of Economics of the same college, a politician, a Marxist economist, a writer and a social worker. He is also a former State Secretary of Assam State Committee and a former General Secretary of RCPI. Baneswar Saikia is able to read, speak and write in Assamese, English and Bengali.\nHe retired from ADP College in 1991. In May 2016, ADP College Retired Teachers' Forum was formed. Professor Saikia was elected as the adviser of the association.\nProfessor Saikia was a student activist and presently is one of the Central Committee members of the RCPI. During his school days, Saikia was influenced by Marxism. He started his political career as a students' political activist, as a member of the Assam Provincial Students' Federation (APSF). He was also involved in the RCPI-led uprisings in Assam that took place between 1948 and 1952.\nWorks\nBooks\n* Bharatar Biplabi Communist Party: Gathan aru Gatidhara (ভাৰতৰ বিপ্লৱী কমিউনিষ্ট পাৰ্টি: গঠন আৰু গতিধাৰা) (RCPI, Assam State Committee, Guwahati, 28 August 2003)\n* Arab Jagatat Biplovar Dhou (আৰৱ জগতত বিপ্লৱৰ ঢৌ)   (RCPI, Assam State Committee, Guwahati, 2015)\n*\n* Pratyoy Aaru Anvexon: Baneswar Xaikiar Nirbachita Rachana Xangrah (প্ৰত্যয় আৰু অন্বেষণ: বাণেশ্বৰ শইকীয়াৰ নিৰ্বাচিত ৰচনা সংগ্ৰহ)- A collection of selected writings of Baneswar Saikia, edited by Dr. Ranjit Sabhapandit (Assam Publishing Company, 2017)\nReferences"
    }
  ]
}