{
  "content": [
    {
      "type": "text",
      "text": "# Bangkok Marriott Marquis Queen's Park__disambig_1\n\n| pushpin_map        =Thailand Bangkok\n| closing_date       =\n| developer          =\n| architect          =\n| operator           =Marriott Hotels\n| owner              =\n| number_of_restaurants = 6\n| number_of_rooms    =1,251\n| floor_area         =\n| floors             =\n| parking            =\n| website            =[https://www.marriott.com/hotels/travel/bkkqp-bangkok-marriott-marquis-queens-park/ Official website]\n| footnotes          =\n}}\nThe '''Bangkok Marriott Marquis Queen's Park''', formerly known as The Imperial Queen's Park Hotel, Bangkok, is the largest hotel  in Bangkok with his 1,251 rooms. Located on Sukhumvit Road, the hotel stands near the Emporium (Bangkok) complex and the Benchasiri Park.\nIts large function rooms of 2,500 sq. m. can seat up to 2000 persons, and professional staff to accommodate any special theme, for conventions and banquets.\nThe hotel closed on October 2, 2014 for a 3-billion-baht renovation and reopened as the Bangkok Marriott Marquis Queen's Park.\nHistory\nThe New Imperial Hotel was established in 1972, the very first hotel with 170 rooms, providing guests through its Thai Hospitality.\nIn July 1978, The Imperial Impala Hotel, with its 197 guest rooms, was opened for service on Sukhumvit 24 Road.\nThe '''Imperial Queen's Park Hotel''' in Bangkok, which was one of the largest hotels in the city, was originally built and opened in 1992. It was part of the Imperial Hotel Group and known for its central location on Sukhumvit Road, as well as its proximity to the Benjasiri Park.It has since been rebranded as Bangkok Marriott Marquis Queen's Park after extensive renovations and re-opened under the Marriott brand.\nFor more than 30 years, the number of staff increased from 100 to almost 2,827.  To date they have a network of 11 hotels in Central Bangkok and prominent provinces.\nIn 1993, The New Imperial Hotel's official brand name The Imperial Family of Hotels had been transferred to The Imperial Hotels Group.\nRestaurants\n* Goji Kitchen + Bar\n* The Lobby Lounge\n* Pagoda Chinese Restaurant\n* Siam Tea Room\n* Akira Back\n* ABar Rooftop\nSee also\n* The Imperial Adamas Beach Resort, Phuket\n* The Imperial Boat House Beach Resort, Koh Samui\n* The imperial Resort & Sports Club, Chiang Mai\n* The imperial golden triangle resort, Chiang Rai\n* The Imperial Hua Hin Beach Resort\nPhoto gallery\nFile:สวนเบญจสิริ Benchasiri Park 2020.jpg|The hotel (tall buildings) as seen from the Benchasiri Park\nReferences"
    }
  ]
}