{
  "content": [
    {
      "type": "text",
      "text": "# Bangsamoro declarations of independence\n\n}}\n*\n*\n}}\n| location_of_document = Talipao, Sulu\n| writer               = Moro National Liberation Front\n| purpose              = Independence of the Bangsamoro Republik from the Philippines\n}}\nThe Bangsamoro are a majority-Muslim ethnic group occupying a range of territories across the southern portions of the Republic of the Philippines. On three occasions, a short-lived and unrecognized Bangsamoro state independent of the Philippines has been formally declared by the Moro National Liberation Front (MNLF). The first declaration was issued in 1974, amid the Moro conflict. Bangsamoro Land would be declared in 2012. In 2013, the United Federated States of Bangsamoro Republik was declared.\n1974\nNur Misuari, chairman of the Moro National Liberation Front issued the Proclamation of Bangsamoro Independence on April 28, 1974.\n2012\nOn January 15, 2012, the Moro National Liberation Front (MNLF) declared the Independence of Bangsamoro Land (Sulu, Mindanao, Palawan, Sabah) in Valencia Bukidnon.\n2013\nThe Bangsamoro Declaration of Independence was proclaimed on July 27, 2013 in Talipao, Sulu.  The Moro National Liberation Front (MNLF), under Nur Misuari, proclaimed the independence of the Bangsamoro Republik, officially known as the United Federated States of Bangsamoro Republik, claiming the islands of Mindanao, Basilan, Sulu, Tawi-Tawi and Palawan in the Philippines.\nThe Bangsamoro Republik also includes Sabah and Sarawak (in Malaysia's Borneo), confirmed Emmanuel Fontanila, Misuari's counsel.\nReactions\nNational governments\n* – The Philippine government refused to recognize the Bangsamoro Republik, reiterating that theirs is the only legitimate government in the Philippine archipelago. Presidential spokesperson Abigail Valte said that the elected officials in the claimed territory of Bangsamoro still exercise control over their constituents. “Perhaps it’s time to go to the elected representatives of the people there [to see] if they support this call of Misuari [saying they] have declared themselves an independent state from the [Philippine] government,” she added.\n* – The Malaysia government rejected the sovereignty of the Sultanate of Sulu (and subsequently the Bangsamoro Republik) over the territory.\nOthers\n*Autonomous Region in Muslim Mindanao regional governor Mujiv Hataman said that all town mayors and provincial governments in the autonomous region remain loyal to the Philippine constitution. He described the Bangsamoro independence declared by Misuari unconstitutional. “All the elected officials of the region do not recognize Misuari’s declaration and they remain supportive of the national government's peace process with the Moro Islamic Liberation Front,” Hataman said.\n*Davao City mayor Rodrigo Duterte supports the idea of a Bangsamoro Republik. “Wala akong problema (I don't have any problem with it). I can work under a Muslim leader,” Duterte said. “Ang gusto ko lang it is fair to everybody. Kasi, pag hindi fair, ako ang magrerebelde. (My only desire is that it would be fair to everybody; if not, I will be the one to rebel.),” Duterte added. Duterte said that he would support Misuari's \"legitimate\" bid for independence. At the height of the Zamboanga City crisis, however, the Davao mayor clarified his stance and said that Misuari and his group are free to raise their MNLF flag in the Davao City \"as long as it is not higher than the Philippine flag.\"\n* Sultanate of Sulu under Jamalul Kiram III - A Sultanate spokesman named Idjirani said that Sultan Jamalul Kiram III was not consulted on the declaration of the independence of Bangsamoro Republik.“That was his (Misuari) prerogative. But as far as Sabah is concerned, we are not in favor of that,” Idjirani said. The spokesman said that they had been hearing reports of Misuari's plan to declare independence and to bolster the strength of the Moro National Liberation Front (MNLF). “Sultan Kiram’s instruction to our men on the ground is not to entertain such reports and not take part in any undertaking not authorized by the sultanate and the council,” he said. He also added that the Sulu Sultanate won't support Nur Misuari when he declares war on the Philippine government, despite the mutual disapproval by the Sultanate and Misuari's group of the Framework Agreement on the Bangsamoro that triggered the declaration.\nPlanned future declarations\nIn February 2015, Nur Misuari held a meeting with MNLF leaders in Sulu to inform them on the progress of declaring a \"Bangsamoro Republik of Mindanao\". Misuari also ordered the consolidation of MNLF troops following reports that government forces are launching a \"secret all-out military operation” against armed groups not part of the peace process in Mindanao. In 2016, Misuari accepted a federal system bid by the Philippine government, but with a condition that the Muslim Filipinos will have their own state under the proposed system. Philippines President Rodrigo Duterte supports Misuari's condition, along with the House Speaker and the Senate President. In 2017, Misuari offered aid to Duterte in his fight against ISIS in the Battle of Marawi, which Duterte accepted.\nReferences"
    }
  ]
}