{
  "content": [
    {
      "type": "text",
      "text": "# Bangladesh Police Liberation War Museum\n\n| location = Rajarbagh Police Lines\n| coordinates =\n| website = http://www.police.gov.bd (Official website of Bangladesh Police)\n| collections = The materials used by the East Pakistan Rifles, etc during the Liberation War of Bangladesh such as:\n* Radio (used for communication)\n* পাগলা ঘন্টা(Pagla Ghonta-Alarm Siren)\n* Three knot three rifles\n* Mortar shell\n* Copy of radio announcement of first inspector general of police (IGP),Abdul Khaleque\n*The cap of Martyr Aftab Uddin Ahmed\n*Wireless set of helicopter used in the war\n*Telegram letter of independence announcement on behalf of Bangabandhu\n| founder = Bangladesh Government\n| owner = Bangladesh Police\n| type = War museum\n| architect = Mir Amin\n}}\nBangladesh Police Liberation War Museum is a museum that commemorates the contribution of Bangladesh Police to the Bangladesh Liberation War. It is located at Rajarbagh Police Lines on 1.5 bighas of (216,000 sq ft) land area and was established on 24 March 2013. It contains various materials and symbols which denote the sacrifice of police soldiers during the war. The museum's research unit identified a police officer killed in British Council premises during the Bangladesh Liberation war. Habibur Rahman is the founder and President of Bangladesh Police Liberation War Museum\nBackground history\nThe liberation war of Bangladesh took place in 1971. On 25 March 1971, the Pakistani military attacked Rajarbagh police lines. The Bangalee police, attacked unexpectedly, armed themselves with rifles and whatever else they could find. Most of the police were killed by the Pakistani army. After about 42 years of their martyrdom, the government took steps to hold their memory. The museum was inaugurated by the prime minister Sheikh Hasina, on the telecom building in Rajarbagh Police Lines on 24 March 2013.\nReferences\nSee more\n* Bangladesh Police\n* Bangladesh Liberation War\n* Liberation War Museum\nExternal links\n* [http://www.museum.police.gov.bd Official Website]\n* [https://m.facebook.com/bangladesh.police.liberation.musium/ Museum Facebook page]"
    }
  ]
}