{
  "content": [
    {
      "type": "text",
      "text": "# Banjaratma Heritage Rest Area\n\nThe Banjaratma Heritage Rest Area, or Rest Area KM 260B, is a rest area on the Trans-Java Toll Road within Brebes Regency, Central Java, Indonesia.\nIt is located on kilometer 260 within the Pejagan-Pemalang section of the toll road's length, in the Jakarta direction. It occupies the site of a former colonial sugar factory. The factory itself operated from 1913 to 1998, and was abandoned for around twenty years. It was revitalized by a consortium of government-owned companies following the opening of the toll road, and the rest area began operations in 2019.\nHistory\nSugar mill\nThe Banjaratma sugar mill, owned initially by Amsterdam-based sugar plantation company NV Cultuurmaatschappij, began construction in 1908 and operations in 1913. The factory doubles as a research station on sugarcane plantation and milling. In its operations, to secure a supply of sugarcane, the factory \"rented\" land from surrounding landholding peasants, who in turn often moved to work in urban areas while landless farmers from elsewhere cultivated the sugarcane.\nWhile most sugar mills in Java closed during the Japanese occupation of the Dutch East Indies, the Banjaratma mill continued to operate. During the Indonesian National Revolution, the factory was seized by local pro-independence militias from the Japanese occupiers. A number of Eurasian workers of the factory were rounded up and killed in the Bersiap era. After Indonesian independence and nationalization of Dutch firms, the sugar mill was owned by the government-operated agricultural companies. Reduced supply of sugarcane, coupled with increased operating costs and aging machinery caused the factory to shutdown in 1998, its final production being done in 1997. The building was abandoned, and a rumored haunting even became subject of a 2013 Trans 7 TV episode.\nRevitalization\nBy 2016, construction of the Trans-Java Toll Road had reached Brebes Regency, and the path of the toll road (specifically the Pejagan-Pemalang section) passed within the sugar mill's 25-hectare complex. There was initial local opposition to the construction, as at that time the building had been designated a Cultural Property of Indonesia. In order to preserve and utilize the old factory, a consortium of six Indonesian government-owned firms invested Rp 250 billion for the factory's revitalization and for the construction of a toll road rest area. It began operations on 17 March 2019.\nFacilities\nThe rest area contains standard facilities for Indonesian rest areas such as a mosque, a Pertamina gas station, parking spaces, and a food court. As one of the largest rest areas in Indonesia, the complex measures 10.4 hectares with the main building itself covering 1.6 hectares, and contains several tourist attractions such as a colonial-era steam locomotive which carried sugarcane and a mini-zoo. It is also host to a number of stalls selling products from local SMEs of Brebes, such as salted eggs. The main building's interior is relatively preserved, with the original ornamented brick walls sitting between modern stalls.\nReferences"
    }
  ]
}