{
  "content": [
    {
      "type": "text",
      "text": "# Banking in the Jacksonian Era__disambig_2\n\nThe Second Bank of the United States opened in January 1817, six years after the First Bank of the United States lost its charter.  The Second Bank of the United States was headquartered in Carpenter's Hall, Philadelphia, the same as the First Bank, and had branches throughout the nation.  The Second Bank was chartered by many of the same congressmen who in 1811 had refused to renew the charter of the original Bank of the United States.  The predominant reason that the Second Bank of the United States was chartered was that in the War of 1812, the U.S. experienced severe inflation and had difficulty in financing military operations.  Subsequently, the credit and borrowing status of the United States was at its lowest level since its founding.\nThe charter of the Second Bank of the United States (B.U.S.) was for 20 years and therefore up for renewal in 1836. Its role as the depository of the federal government's revenues made it a political target of banks chartered by the individual states who objected/envied the B.U.S.'s relationship with the central government.  Partisan politics came heavily into play in the debate over the renewal of the charter.  \"The classic statement by Arthur Schlesinger was that the partisan politics during the Jacksonian period was grounded in class conflict.  Viewed through the lens of party elite discourse, Schlesinger saw inter-party conflict as a clash between wealthy Whigs and working class Democrats.\"  (Grynaviski) President Andrew Jackson strongly opposed the renewal of its charter, and built his platform for the election of 1832 around doing away with the Second Bank of the United States.  Jackson's political target was Nicholas Biddle, financier, politician, and president of the Bank of the United States.\nApart from a general hostility to banking and the belief that specie (gold and/or silver) were the only true monies, Jackson's reasons for opposing the renewal of the charter revolved around his belief that bestowing power and responsibility upon a single bank was the cause of inflation and other perceived evils.\nDuring September 1833, President Jackson issued an executive order that ended the deposit of government funds into the Bank of the United States. After September 1833, these deposits were placed in the state chartered banks, commonly referred to as Jackson's \"pet banks\". While it is true that six out of the seven initial depositories were controlled by Jacksonian Democrats, the later depositories, such as the ones in North Carolina, South Carolina, and Michigan, were run by managers who opposed Jacksonian politics. It is probably a misnomer to label all the state chartered repositories “pet banks”.\nSee also\n* Bank War\n* Hard times token\n* History of central banking in the United States\n* Panic of 1837\n* Specie Circular\n* Censure of Andrew Jackson\nReferences\n* Grynaviski, Jeffery D. Rethinking Jackson's Bank War: Party Politics and American Monetary. University of Chicago. 25 Nov. 2006 (http://harrisschool.uchicago.edu/Academic/workshops/pol_econ_papers/Grynaviski.pdf).\n* Hammond, Bray. \"Jackson, Biddle, and the Bank of the United States.\" The Journal of Economic History 7 (1947): 1-23. 6 Dec. 2006.\n* Rockoff, Hugh T. \"Money, Prices and Banks in the Jacksonian Era.\" Chapter 33 in The Reinterpretation of American Economic History, eds. R.W. Fogel and Stanley Engerman. New York: Harper & Row, 1971.\n* Scheiber, Harry N. \"The Pet Banks in Jacksonian Politics and Finance, 1833-1841.\" Journal of Economic History 33 (1963): 196-214\n* Sylla, Richard, \"Review of Peter Temin The Jacksonian Economy\" Economic History Services, Aug 17, 2001 (http://eh.net/bookreviews/library/sylla.shtml)\n* Taylor, George R., and D C. Heath. \"Jackson Versus Biddle: the Struggle Over the Second Bank of the United States.\" (1949). 24 Nov. 2006 [https://www.questia.com/PM.qst?a=o&d=960190]\n* Temin, Peter.  The Jacksonian Economy. New York: W.W. Norton & Company, 1969.\n* Walton, Gary M. and Hugh Rockoff. History of the American Economy 10th edition. Thomson South-Western, 2005."
    }
  ]
}