{
  "content": [
    {
      "type": "text",
      "text": "# Banwarilal Purohit\n\n| status4             = Additional charge\n| term_start4         = 27 January 2017\n| term_end4           = 5 October 2017\n| president4          = Ram Nath Kovind\n| 1blankname4         = Chief Minister\n| 1namedata4          = Mukul Sangma\n| predecessor4        = V. Shanmuganathan\n| successor4          = Ganga Prasad\n| office5             = Member of Parliament, Lok Sabhafor Nagpur\n| term_start5         = 1984\n| term_end5           = 1991\n| predecessor5        = Jambuwantrao Dhote\n| successor5          = Datta Meghe\n| term_start6         = 1996\n| term_end6           = 1998\n| predecessor6        = Datta Meghe\n| successor6          = Vilas Muttemwar\n| birth_date          =\n| birth_place         = Nawalgarh, Rajputana Agency, British India (present-day Rajasthan, India)\n| party               = Bharatiya Janata Party\n| residence           = Raj Bhavan, Punjab\n| spouse              =\n| children            =\n| website             =\n| footnotes           =\n| date                =\n| year                = 2021\n| source              =\n| order1              = 16th\n}}\nBanwarilal Purohit (born 16 April 1940) is an Indian politician. He was the former Governor of Punjab, India and Administrator of Chandigarh from September 2021, Governor of Tamil Nadu from 2017 to 2021, and  Governor of Assam from 2016 to 2017. He is a member of the Bharatiya Janata Party. He was a Member of Parliament from the Nagpur (Lok Sabha constituency) three times, twice as an Indian National Congress member, once as a BJP member.\nPolitical career\nLater he joined Congress. After Indira Gandhi split the Congress and formed Congress (Indira), Purohit was elected as MLA from Nagpur East constituency in 1978, contesting as a member of Congress(I), and he was re-elected in 1980 from Nagpur South and became a Minister of State for Urban Development, Slum Improvement and Housing in 1982.\nIn 1984, he was elected to the 8th Lok Sabha as member of Congress. He was re-elected in 1989 on Congress ticket.\nLater he joined the Bharatiya Janata Party when it launched a movement to build Ram Temple in Ayodhya and contested Lok Sabha elections in 1991 as the BJP candidate. But he lost to Datta Meghe of Indian National Congress. In 1996, he was elected to 11th Lok Sabha as BJP's candidate.\nIn 1999, he quit the Bharatiya Janata Party to join the Indian National Congress after he developed serious differences with Pramod Mahajan. He contested the Lok Sabha elections from Ramtek in 1999 but lost.\nIn 2003, he launched his own party called Vidarbha Rajya Party and contested the Lok Sabha elections from Nagpur in 2004 but lost.\nLater on, he again joined the BJP.\nIn 2009, he again contested on BJP's ticket but lost the election to Vilas Muttemwar of Indian National Congress.\nGovernorship\nIn August 2016, Purohit was appointed Governor of Assam by replacing Padmanabha Acharya who had additional in-charge of Assam.\nOn 30 September 2017 he was appointed Governor of Tamil Nadu by President Ram Nath Kovind. It was the first time that the state has got a full time governor after K Rosaiah retired in August 2016.\nOn 27 August 2021 he was appointed the Governor of Punjab (additional charge) and Administrator of Chandigarh (additional charge).\nOn 9 September 2021, Purohit was appointed the 29th Governor of Punjab. Purohit resigned from the post on 3 February 2024 citing personal reasons. His resignation was accepted on 28 July 2024.\nOther career\nPurohit gained ownership of the Nagpur daily newspaper The Hitavada from Servants of India Society in 1979. The newspaper was launched by Gopal Krishna Gokhale in 1911 and Purohit is its current managing editor. He is also the chairman of Shri Ramdeobaba University RBU in Nagpur.\nEarly life\nHis father's name is Bhagwandas Purohit, he is married to Pushpa Devi Purohit, and he has three children. Two sons Rajendra Purohit and Rakesh Purohit, daughter Meena Purohit Joshi. He has six grandchildren and a great grandson. His eldest granddaughter, Archana Purohit Agrawal is a business coach, startup founder and author for the Book Agency Adda. He is also the chairman of Bhavans Bhagwandas Purohit Vidya Mandir Nagpur. He is the chairman of Bharatiya Vidya Bhavan schools founded by late Kanaiyalal Maneklal Munshi in 1938.\nReferences\n|-\n|-\n|-\n|-\n|-\n|-"
    }
  ]
}