{
  "content": [
    {
      "type": "text",
      "text": "# Banwarilal Bhalotia College\n\n| type           = Undergraduate & Postgraduate college\n| principal      = Amitava Basu\n| city           = Asansol\n| state          = West Bengal\n| country        = India\n| coordinates    =\n| pushpin_map    = India West Bengal#India\n| campus         = Urban\n| affiliations   = Kazi Nazrul University, Asansol; NAAC\n| website        = http://www.bbcollege.ac.in/\n| logo           = Banwarilal Bhalotia College logo.jpg\n| logo_size      = 150px\n| logo_alt       =\n| footnotes      =\n}}\nBanwarilal Bhalotia College, known by the abbreviation B. B. College, established in 1944, is a college in Asansol, Paschim Bardhaman district, West Bengal, India. It offers undergraduate courses in arts, commerce and sciences. It is affiliated with Kazi Nazrul University, Asansol.\nHistory\nAt the beginning of the 20th century, a need for a higher educational institute in the Asansol, an industrial metropolitan Centre, was felt. One higher educational institution was the necessity for the growth and development of this region. In 1944, Prof. Satyakali Mukherjee first submitted the proposal for opening a college in Asansol to the existing Chairman of Asansol Municipality, Mr. Jogendranath Roy and the then SDO, Mr. Woodford, I.C.S. Other eminent stalwarts of Society as well as the general people of different strata supported this noble endeavor by their generous donations for the establishment of a higher academic institution.\nMr. G.S. Atwal, a leading businessman and entrepreneur, initiated the move by constructing a field-building for this purpose and this college was named as Asansol College. This college was then affiliated with the University of Calcutta. Initially, this college was started with only 132 students and offered I.A. courses. Later, different education stalwarts of Asansol and corporate bodies, along with positive effort of the staff of Asansol Municipal Corporation and the Eastern Railway, collectively contributed towards the establishment of this college.\nIn 1959-60, a renowned businessman of the locality, Sri Banwarilal Bhalotia (also a freedom fighter and a social reformer) magnanimously donated a plot of land of 20 Bighas towards a permanent building for this college. Other eminent personalities, namely, Late Sri Shivdas Ghatak and Dr. B.C. Roy, the then Chief Minister of Bengal, also supported this endeavor. In 1960, this newly constructed college building was inaugurated by the then Vice-Chancellor of Burdwan University, Sri S.K. Guha, and the college was named as Banwarilal Bhalotia College (B. B. College in short). In 1960, the college's affiliation also changed from Calcutta University to the University of Burdwan. Currently, this college is affiliated with the Kazi Nazrul University.\nDepartments and courses\nThe college offers different undergraduate and postgraduate courses and aims at imparting education to the undergraduates of lower- and middle-class people of Asansol and its adjoining areas.\nScience\nScience faculty consists of the departments of Chemistry, Physics, Mathematics, Computer Science & Application, Botany, Zoology, Microbiology, Electronics, and Economics.\nArts and Commerce\nArts and Commerce faculty consists of departments of Bengali, English, Sanskrit, Hindi, Urdu, History, Geography, Political Science, Philosophy, Education, Finance & Accountancy, and Business Administration.\nFew honours courses, namely, Mathematics, Botany, Geography, Political science, and History are now open for Hindi medium students.\nAccreditation\nThe college was accredited \"A\" grade by NAAC. The college is also recognized by the University Grants Commission (UGC).\nNotable alumni\n* Agnimitra Paul - Fashion designer\nSee also\nReferences\nExternal links\n*[https://web.archive.org/web/20110625061026/http://www.bbcollege.org/ Banwarilal Bhalotia College]\n*[http://www.knu.ac.in/ Kazi Nazrul University]\n*[http://www.ugc.ac.in/ University Grants Commission]\n*[http://www.naac.gov.in/ National Assessment and Accreditation Council]"
    }
  ]
}