{
  "content": [
    {
      "type": "text",
      "text": "# Barahona, Dominican Republic\n\n|subdivision_type        = Country\n|subdivision_name        =\n|subdivision_type1       = Province\n|subdivision_name1       = Barahona\n|established_title       =\n|founder                 = Toussaint L'ouverture\n|established_date        = 1802\n|established_title2      = Municipality since\n|established_date2       = 1858\n|area_total_km2          = 163.02\n|area_footnotes          =\n|elevation_m             = 10\n|elevation_footnotes     =\n|population_total        = 138159\n|population_as_of        = 2012\n|total_type              = Total\n|population_density_km2  = auto\n|population_blank1_title = Demonym\n|population_blank1       = Barahonero(a)\n|population_footnotes    =\n|blank_name              = Municipal Districts\n|blank_info              = 3\n|blank1_name              = Climate\n|blank1_info              = Aw\n}}\nBarahona, also known as Santa Cruz de Barahona, is the main city of the Barahona Province, in the southwest of the Dominican Republic. It has one of the most active ports in the region, as well as many ecotourism attractions. The city is a centre of sugar production and industry. Barahona is also known for being the only place where the rare Larimar stone can be found.\nHistory\nBefore its discovery by Europeans, the area belonged to the Native Taino chiefdom of Jaragua, ruled by Bohechío.\nThe current name of the province and city is derived from the surname of the first Spaniards who came to the area, some of these Spaniards were also from the town of Baraona in Spain and named it in honor of their town of origin. The Spaniards spread throughout the territory and designated places with their names. Francisco de Barahona, Gabriel Barahona, Luis de Barahona and Juan de Barahona arrived on the first and second voyages of Christopher Columbus in the 1490s.\nAfter the nation's independence in 1844, Barahona was a military post of the Azua Province. In 1858, Barahona was elevated to the category of municipality. When the province was created in 1881, Barahona was made its head municipality. In 1907, the territorial denominations of cantons and maritime districts were abolished and replaced by the terms communes and provinces, respectively, while Barahona was promoted to this category the same year.\nThe revolutionary movement known as \"El Salvador\" was founded in Barahona by Cuban radicals with the purpose of mobilizing financial resources to support the independence movement in Cuba from Spain. Dominican president Ulises Heureaux provided money and weapons to Cuban patriots and from the shores of Barahona, weapons were brought to Cuba.\nBetween 1916 and 1924, the American presence in the province influenced the planting of cane and the construction of the hacienda. In 1927, the first aviation company of the Caribbean region was started in Barahona. The service was inaugurated between the cities of Barahona, Santa Cruz, San Juan, Puerto Rico, Santo Domingo and Port-au-Prince Haiti.\nClimate\nUnder the Köppen climate classification, Barahona has a tropical wet and dry climate. Temperatures tend to remain steady throughout the year, with mean temperatures ranging from a low of  in January to a high of  in July.\nIn terms of dry and wet seasons, Barahona has two distinctive wet seasons with a peak in precipitation from May to June followed by drought-like conditions in July and August (due to the Azores High being located in the central Atlantic, inhibiting the formation of clouds and rain) and another peak in precipitation from September to October. This precipitation pattern is due to the movement and the position of the Azores high throughout the year. The dry season mainly runs through December to April. Even in the drier months, precipitation can still occur with February receiving just under . Sunshine is abundant throughout the year, averaging over 3200 hours.\n}}\n|source 2 = NOAA\n|date = November 2011\n}}\nEconomy\nBarahona has a diversified economy that combines agriculture, mining and tourism, with an industrial port and a free zone dedicated to textile production. Among the most important companies in the area are: CEMEX Dominicana that exploits gypsum from a mine, Rica with dairy production, the \"Consorcio Azucarero Central\" with sugar production, EGE Haina with electricity production, Wilbes Dominicana with areas of free trade and \"Block Khoury\" which produces and exports construction materials.\nAgriculture and the production of cane, bananas, coffee, fruits, sorghum, yams, yautia and others. The main product in the municipality is a very good coffee (\"Barahona Type Coffee\"), grown in the mountains of Eastern Bahoruco. In livestock, the fattening of cattle and goats for meat, sale of leather and the growing milk production predominate, in mining the extraction of larimar, marble, plaster, alabaster, kaolin (for the production of bottles), mineral salt and construction materials, are among the main activities of Barahona.\nDowntown Barahona\nFile:Barahona_Dominican_Republic_Downtown_2.jpg\nFile:Barahona_Dominican_Republic_downtown_streets.jpg\nFile:Barahona Dominican Republic town streets.jpg\nFile:Barahona_Dominican_Republic_Town_3.jpg\nTransport\nThe city of Barahona has a sea port, which receives many ferries from different points in the Caribbean, and an airport, which has been reactivated with many flights a week to Punta Cana via Santo Domingo. Authorities provided the airport with a fuel station park, allowing facilities to the airliners that could operate in the airport in the future. The airport is the well known María Montez International Airport located about 10 minutes from the city center. The port is located about 5 minutes away from the city center.\nNotable natives and residents\n*Julio Lugo, shortstop for the Boston Red Sox\n*Ruddy Lugo, relief pitcher for the Oakland Athletics\n*Maria Montez, actress\n*David Thomatis, Italo-Australian agriculturalist\n*Ludo Vika, actress/comedian\n*Edinson Vólquez, pitcher for the Kansas City Royals\nReferences"
    }
  ]
}