{
  "content": [
    {
      "type": "text",
      "text": "# Barbara Ward, Baroness Jackson of Lodsworth\n\n| image              =  Barbara Ward.gif\n| image_size =\n| alt                =\n| caption            =\n| native_name        =\n| native_name_lang   =\n| pronunciation      =\n| birth_name         = Barbara Mary Ward\n| birth_date         =\n| birth_place        =  Heworth, York, England, UK\n| baptised           =\n| death_date         =\n| death_place        =  Lodsworth, Sussex, England, UK\n| death_cause        =\n| resting_place      =\n| resting_place_coordinates =\n| burial_place       =\n| burial_coordinates =\n| monuments          =\n| nationality        =\n| other_names        =\n| citizenship        =\n| education          = Sorbonne, ParisSomerville College, Oxford\n| alma_mater         =\n| occupation         = Economist, writer\n| years_active       =\n| era                =\n| employer           =\n| organization       =\n| agent              =\n| known_for          = Early proponent of sustainable development\n| notable_works      =\n| style              =\n| television         =\n| title              =\n| movement           =\n| opponents          =\n| boards             =\n| spouse             = Commander Robert Jackson\n| partner            =\n| children           =\n| parents            =\n| mother             =\n| father             =\n| relatives          =\n| family             =\n| callsign           =\n| awards             = Dame Commander of the Order of the British Empire (1974)Life peer (1976)Jawaharlal Nehru Award (1980)\n| website            =\n| module             =\n| footnotes          =\n}}\nBarbara Mary Ward, Baroness Jackson of Lodsworth,  (23 May 1914 – 31 May 1981) was a British economist and writer interested in the problems of developing countries. She urged Western governments to share their prosperity with the rest of the world and in the 1960s turned her attention to environmental questions as well. She was an early advocate of sustainable development before this term became familiar and was well known as a journalist, lecturer and broadcaster. Ward was adviser to policymakers in the UK, United States and elsewhere. She was the founder of the International Institute for Environment and Development (IIED).\nEducation and early career\nBarbara Ward was born in Heworth, York, on 23 May 1914. Her family soon moved to Felixstowe. Her father was a solicitor with Quaker tendencies, while her mother was a devout Catholic. She attended a convent school before studying in Paris, first at a lycée, then for some months at the Sorbonne before going on to Germany. Though she had once planned to study modern languages, her interest in public affairs led to a degree course in politics, philosophy, and economics at Somerville College, Oxford University, from which she graduated in 1935.\nShe did post-graduate work on Austrian politics and economics. After witnessing antisemitism there and in Nazi Germany she began to help Jewish refugees, and mobilise Roman Catholic support for any forthcoming UK war effort, although she had initially been \"sympathetic to Hitler\". With Christopher Dawson, the historian, as leader and Ward as secretary, the Sword of the Spirit was established as an organisation to bring together Catholics and Anglicans opposing Nazism. It became a Roman Catholic group whose policies were promoted by the Dublin Review, which Dawson edited, and for which Ward wrote regularly.\nDuring the Second World War, she worked for the Ministry of Information and travelled in Europe and the US. Partly on the strength of her 1938 book, The International Share-out, Geoffrey Crowther, editor of The Economist, offered her a job. She left the magazine in 1950 having risen to foreign editor, but continued to contribute articles throughout her life. As well as writings on economic and foreign policy, her broadcasts on Christian values in wartime were published as The Defence of the West by Sword of the Spirit. During this time she was also president of the Catholic Women's League and a popular panel member of the BBC programme The Brains Trust which answered listeners' questions. In 1946 she became a governor of the BBC and of the Old Vic theatre. After the war, Ward was a supporter of the Marshall Plan, of a strong Europe, and of a European free trade area.\nInternational influence, and marriage\nIn 1950, Barbara Ward married Australian Commander Robert Jackson, an administrator for the United Nations. Their son Robert was born in 1956, the same year that his father was knighted. Ward continued to use her own name professionally and was not widely known as Lady Jackson. Over the next few years they lived in West Africa and made various visits to India, and these experiences helped form Ward's views on the need for Western nations to contribute to the economic development of poorer countries. For the next two decades both husband and wife travelled a great deal, and eventually their marriage suffered from this. A legal separation was arranged in the early 1970s though Ward, as a Catholic, did not want divorce. In 1976 when she was given a life peerage she used her estranged husband's surname for her title as Baroness Jackson of Lodsworth.\nWard had been a frequent public speaker since leaving university, and by the 1960s her lectures attracted international respect; several lecture series, including some presented in Canada, Ghana and India, were published in book form. Ward spent increasing amounts of time in the US, much of her work there funded by the Carnegie Foundation. Ward published The Rich Nations and the Poor Nations which became a bestseller in 1962.\nIn 1957 Harvard University gave her an honorary LittD and until 1968 she was a Carnegie fellow there, living for part of each year in Cambridge, Massachusetts. She was elected a Foreign Honorary Member of the American Academy of Arts and Sciences in 1966. She got to know Adlai Stevenson and John F Kennedy and acted as adviser to various influential policy makers, including Robert McNamara at the World Bank and Lyndon B Johnson, who welcomed her thoughts on his Great Society projects despite her opposition to the Vietnam War.\nShe influenced James Wolfensohn's thinking on development questions. She had influence in the Vatican, helped set up a pontifical commission for justice and peace, and in 1971 was the first woman ever to address a synod of Roman Catholic bishops. One of her proposals was that richer countries should commit a certain proportion of their GNP in aid to the developing world, and she also spoke of the need for institutions to enable and manage both 'aid and trade'. This was a practical as well as an ethical concern: Ward believed such policies would encourage stability and peace. She is sometimes called a \"distributist\".[http://www.godspy.com/issues/The-Education-and-Catholic-Conversion-of-E-F-Schumacher-by-Joseph-Pearce.cfm Joseph Pearce, \"The Education of E F Schumacher\", Literary Converts]  (Ignatius Press 1999)\nOrigins of Sustainable Development\nBarbara Ward is remembered as one of the great intellectuals and internationalists of the 20th century. And among the first champions of sustainable development. Her work branched over many different disciplines and groups that embedded her name as a historical figure. Environmentalists know her for her book she wrote with René Dubos Titled \"Only One Earth\". For those Concerned about international development (addressing poverty and social justice), Barbara Ward was perhaps their best-known author in the early 1940s to her death in 1981. Her life's work was dedicated to articulate how to make sure a world works with a semi-balance of social and economic justice.\nSustainable development can be defined at its core as a combination of meeting people's needs with a recognition of the Earth's finite ecological capacity. Barbara's professorship at Columbia University in New York allowed her to work closely with the UN secretariat set up to organize the Stockholm Conference. The Stockholm Conference was a series of international management of environmental problems, many of which were to become central to the work of the United Nations Environmental Programme.\nEnvironmental concerns\nWard started to see a close connection between wealth distribution and conservation of planetary resources. \"… the careful husbandry of the Earth is sine qua non for the survival of the human species, and for the creation of decent ways of life for all the people of the world.\" She used the phrases \"inner limits\" and \"outer limits\" to refer to the inner limits of the human right to an adequate standard of living and the outer limits of what the Earth can sustain. In 1966, she published Spaceship Earth and is sometimes said to have coined the phrase. Ward is seen by some as a pioneer of sustainable development. She and René Dubos, co-authors of Only One Earth (), have been described as \"parents\" of a concept which \"did not know its own name at first\". Only One Earth: The Care and Maintenance of a Small Planet was written for the 1972 UN Stockholm conference on the Human Environment. The report was commissioned by Maurice Strong, secretary general of the United Nations Conference on the Human Environment.\nWard's work was rooted in her sense of morality and Christian values. She saw care of the environment and concern for the well-being of all humankind as a \"dual responsibility\", especially for anyone sharing her religious outlook. At the same time, she believed wealth distribution combined with conservation was essentially a rational policy: \"We are a ship's company on a small ship. Rational behaviour is the condition of survival.\" In 1971 she founded the International Institute for Environment and Development (IIED), acting as president from 1973 and chairman from 1980.\nLater life\nWard had recovered from cancer in the late 1940s thanks, she believed, to the spiritual support of Padre Pio. The illness recurred twenty years later but surgery did not cure her. She owned a villa in the Canary Islands. In 1973 she retired from Columbia University where she had been Schweitzer Professor of Economic Development for the previous five years and went to live in Lodsworth, Sussex. The next year she was made a Dame Commander of the Order of the British Empire, and on 18 October 1976 a life peer as Baroness Jackson of Lodsworth, of Lodsworth in the County of West Sussex; she and her husband both held noble titles in their own right. She wrote her last book, Progress for a Small Planet, despite her deteriorating health, discussing the \"planetary community\", dwindling resources used up too fast by wealthy countries, and the needs of poorer parts of the world. It was published in 1979, two years before her death on 31 May 1981, aged 67.\nLegacy\nIn 1980, she received the Jawaharlal Nehru Award.\nPope John Paul II sent a Cardinal to represent him at Ward's requiem service. At her own request, she was buried in the graveyard of the local Anglican parish church.\nHer brother, John Ward, was a noted civil engineer who, after his work on the M4 motorway in the 1960s, was appointed an Officer of the Order of the British Empire. Her great-niece, Marsha Shandur, is now a music presenter on radio.\nShe also lived in Kau Sai Wan, Sai Kung, Hong Kong, working as a fisherman anthropologist, advocate and liaison intermittently for 30 years since the 1950s. In the 1970s, she liaised with Hong Kong government, then as a British colony, to abolish Basalt Island Firing Range. She then managed to let the government lease out abandoned houses for fishermen, so they have land-based dwellings. After she died a bilingual memorial epitaph was erected in her honour.\nIn 2014, Barbara Ward was one of ten famous deceased persons to be honoured via a set of 10 Royal Mail postage stamps.\nAffiliations\n*1972: Stockholm Conference on Human Environment (Earth Summit I)\n*1974: Cocoyoc Declaration, UNEP/United Nations Conference on Trade and Development (UNCTAD) Symposium on Patterns of Resource Use, Environment and Development strategies\n*1976: Vancouver Habitat Conference on Human Settlements\nBarbara Ward Lectures\nThe International Institute for Environment and Development organises the 'Barbara Ward Lectures' in memory of Ward, who was the Institute's first director.\n* 2007 Mary Robinson, Former President of Ireland\n* 2008 Lindiwe Sisulu, Minister of Housing of the Republic of South Africa\n* 2010 Connie Hedegaard, European Commissioner for Climate Action\n* 2012 Christiana Figueres, executive secretary of the UN Framework Convention on Climate Change\n* 2014 Fatima Denton, Co-ordinator for the African Climate Policy Centre of the United Nations Economic Commission for Africa\n* 2016 Debra Roberts, leader of the Environmental Planning and Climate Protection Department of eThekwini Municipality, Durban, South Africa and Co-Chair of Working Group II of the Intergovernmental Panel on Climate Change\n*2018 Gro Harlem Brundtland, the first woman Prime Minister of Norway and former Director-General of the World Health Organization\nSelected works\n*The International Share-out (1938)\n*Turkey (1941)\n*Defence of the West (1942)\n*The West at Bay (1948)\n*Policy for the West (1951)\n*Faith and Freedom (1954)\n*Britain's interest in Atlantic union (1954)\n*Interplay of East and West (1957)\n*Five Ideas that Changed the World (1959)\n*[http://cht.hm/2kCAxwH India and the West] (1961), published in the journal International Affairs, volume 37 issue 4\n*The Rich Nations and the Poor Nations (1961)\n*The Plan under Pressure (1963)\n*Nationalism and Ideology (1966) – lecture series – Carleton University\n*Spaceship Earth (1966), . See also, Survival of Spaceship Earth in 1972; Ward co-wrote and appeared in this documentary film [https://www.imdb.com/title/tt0278756/fullcredits#writers Survival of Spaceship Earth (1972) - IMDb]\n*The Lopsided World (1968) – lecture series – Johns Hopkins University\n*Only One Earth (1972) – with René Dubos\n*A new creation? Reflections on the environmental issue (1973)\n*The Home of Man (1976)\n*Progress for a Small Planet (1979)\nReferences\nSources\n*\n*\n* [https://web.archive.org/web/20060928171246/http://www.vanderbilt.edu/AEA/CSWEP/Fall_1995.pdf KimMarie McColdrick & Sonia Banerji, \"Barbara Ward\" in American Economic Association newsletter; October 1995].\n*\nExternal links\n*\n* [https://findingaids.library.columbia.edu/ead/nnc-rb/ldpd_4078935 Finding aid to Barbara Ward papers at Columbia University. Rare Book & Manuscript Library.]\nFurther reading"
    }
  ]
}