{
  "content": [
    {
      "type": "text",
      "text": "# Barbara Engelking\n\n| birth_place      = Warsaw, Polish People's Republic\n| death_date       =\n| death_place      =\n| workplaces       = Polish Center for Holocaust Research\n| era              = 20th century\n| region           =\n| occupation       =\n| years_active     =\n| school_tradition =\n| main_interests   = Holocaust in Poland\n| notable_ideas    =\n| major_works      = Such a Beautiful Sunny Day: Jews Seeking Refuge in the Polish Countryside, 1942–1945The Warsaw Ghetto: A Guide to the Perished CityDalej jest noc (Night Without End) (editor)\n| alma_mater       = Polish Academy of Sciences University of Warsaw\n| awards           =\n| influences       =\n| influenced       =\n}}\nBarbara Engelking (born 22 April 1962) is a Polish psychologist and sociologist specializing in Holocaust studies. The founder and director of the Polish Center for Holocaust Research in Warsaw, she is the author or editor of several works on the Holocaust in Poland.\nEducation and career\nBorn in Warsaw, Engelking received an MA in psychology from the University of Warsaw in 1988 and a Ph.D. in sociology from the Polish Academy of Sciences, also in Warsaw, for a thesis on The Experience of the Holocaust and its Consequences in Autobiographical Accounts (1993).\nSince 1993, Engelking has been an assistant then associate professor at the Polish Center for Holocaust Research, part of the Institute of Philosophy and Sociology at the Polish Academy of Sciences. Since 2014, she has been chair of Poland's . From November 2015 until April 2016, she was the Ina Levine Invitational Scholar at the United States Holocaust Memorial Museum Mandel Center in Washington, D.C.\nWorks\nEngelking's book The Warsaw Ghetto: A Guide to the Perished City (2009), written with Jacek Leociak, provides detailed maps of the ghetto so that readers can locate the streets and former community structures. Michael Marrus described it as \"a stunning work, one of the most important books on the history of the Nazi Holocaust\".\nIn a review of Engelking's book Such a Beautiful Sunny Day: Jews Seeking Refuge in the Polish Countryside, 1942–1945 (2016), first published in Polish in 2012, Grzegorz Rossoliński-Liebe wrote that it challenged the German tendency to neglect non-German Holocaust perpetrators, as well as the Polish tendency to view Poles in German-occupied Poland entirely as victims. In 2013 historian Samuel Kassow described Engelking's work and that of three other scholars (Jan Grabowski, Alina Skibińska, and Dariusz Libionka) as a \"historical achievement of the first order\", undermining \"the self-serving myths about Polish-Jewish relations in World War II\".\nIn 2018 Engelking and Grabowski co-edited Dalej jest noc: losy Żydów w wybranych powiatach okupowanej Polski (Night without End: The Fate of Jews in German-Occupied Poland), a two-volume, 1,600-page study of nine counties in German-occupied Poland during the Holocaust.\nIn February 2021, a Warsaw court ruled that Grabowski and Engelking must apologize for their claims about Edward Malinowski (the sołtys of the Polish village of Malinowo) in Dalej jest noc; in August, the ruling was overturned by an appeals court.\nSelected works\n*(2001). Holocaust and Memory: The Experience of the Holocaust and its Consequences. London: Leicester University Press (edited by Gunnar S. Paulsson).\n*(2009) with Jacek Leociak. The Warsaw Ghetto: A Guide to the Perished City. New Haven: Yale University Press.\n*(2009) with Dariusz Libionka. Żydzi w powstanńczej Warszawie. Polish Center for Holocaust Research.\n*(2016). Such a Beautiful Sunny Day: Jews Seeking Refuge in the Polish Countryside, 1942–1945. Jerusalem: Yad Vashem.\n*(2018) with Jan Grabowski (eds.). Dalej jest noc. Losy Żydów w wybranych powiatach okupowanej Polski [Night Continues: the Fates of Jews in Selected Counties of Occupied Poland], 2 volumes. Warsaw: Centrum Badań nad Zagładą Żydów [Center for Research into the Extermination of the Jews].\nReferences"
    }
  ]
}