{
  "content": [
    {
      "type": "text",
      "text": "# Barcaldine, Queensland\n\n| pop                 = 1540\n| pop_year            =\n| pop_footnotes       =\n| established         = 1885\n| postcode            = 4725\n| area                = 745.7\n| timezone            = AEST\n| utc                 = +10:00\n| elevation           = 266.9\n| maxtemp             = 30.0\n| mintemp             = 16.2\n| rainfall            = 497.7\n| lga                 = Barcaldine Region\n| stategov            = Gregory\n| fedgov              = Maranoa\n| county              = Rodney\n| dist1               = 580\n| dir1                = W\n| location1           = Rockhampton\n| dist2               = 1072\n| dir2                = NW\n| location2           = Brisbane\n| dist3               =\n| dir3                =\n| location3           =\n| dist4               =\n| dir4                =\n| location4           =\n| near-n              = Aramac\n| near-ne             = Jericho\n| near-e              = Jericho\n| near-se             = Blackall\n| near-s              = Blackall\n| near-sw             = Ilfracombe\n| near-w              = Ilfracombe\n| near-nw             = Ilfracombe\n}}\nBarcaldine ( ) is a rural town and locality in the Barcaldine Region in Queensland, Australia.  This is the administrative centre of the Barcaldine Region. Barcaldine played a major role in the Australian labour movement. In the , Barcaldine had a population of 1,540.\nGeography\nBarcaldine is in Central West Queensland, approximately  by road west of the city of Rockhampton,  north of Charleville. The town is situated on Lagoon Creek, which flows into the Alice River approximately five kilometres south of the Barcaldine. Major industries are sheep and beef cattle rearing. The streets in Barcaldine are named after different types of trees.\nHistory\nBarcaldine lay on the traditional tribal lands of the Iningai. Iningai (also known as Yiningay, Muttaburra, Tateburra, Yinangay, Yinangi) is an Australian Aboriginal language spoken by the Iningai people. The Iningai language region includes the landscape within the local government boundaries of the Longreach Region and Barcaldine Region, particularly the towns of Longreach, Barcaldine, Muttaburra and Aramac as well as the properties of Bowen Downs and catchments of Cornish Creek and Alice River.\nThe first European to enter the area was Frederick Walker, the former commandant of the Native Police, who in 1861 led an expedition through what is now Barcaldine searching for the explorers Burke and Wills.\nThe town takes its name from a sheep station called Barcaldine Downs, which was established in 1863 by Donald Charles Cameron, whose family property in Ayrshire, Scotland, was named after Barcaldine, Argyll, Scotland. Cameron had been a sugar plantation owner and slaveholder in Berbice, British Guiana. The local Aboriginal people were not allowed onto Barcaldine Downs and blackbirded South Sea Islander labour was utilised in the 1860s and 1870s.\nThe first town lots were sold in 1885 and within a year several buildings were under construction. By the end of 1886 the town had been surveyed. The Central Western railway line to Barcaldine opened on 8 November 1886.\nBarcaldine Post Office opened on 13 November 1886.\nThe artesian water at Barcaldine is full of minerals. A bore had been constructed in 1887, but was unsuitable for the water needs of the steam locomotives and so the water was let run to waste. By 1891, a local doctor observed that water contained soda and potash which he believed would have health benefits. In 1907, a swimming pool using the artesian water was built by the Barcaldine Shire Council, along with baths and showers for therapeutic use. Although Barcaldine was being promoted as a spa town into the mid-1930s, interest in \"taking the waters\" declined after that period as medical opinion became increasingly doubtful of the benefits of mineral waters, favouring drugs and physiotherapy as better treatments.\nIn 1887 a Methodist church was erected in Ash Street, Barcaldine, the first church in the town. The church building had previously been used at a number of railway camps involved in the construction the Central Western railway line. As each new segment of the line was completed, the camp and the church building were relocated to the new railhead. Barcaldine was its final location. In 1893 a new wooden church was erected in Maple Street. The foundation stone for the current brick church was laid on 1 July 1961 by Reverend Joseph Tainton, President of the Queensland Methodist Conference, with the former wooden church beside it becoming the church hall. In 1977 following the amalgamation that created the Uniting Church in Australia, the Barcaldine Methodist Church became the Barcaldine Uniting Church.\nBarcaldine State School opened on 4 July 1887.In 1892, the local government area of Barcaldine Division was established, by separating it from the Kargoolnah Division which had its headquarters in Blackall. Since then, Barcaldine has been the headquarters of local government in the area, commencing with the Barcaldine Divisional Board, which became the Barcaldine Shire Council in 1903, and then the Barcaldine Regional Council in 2008. The initial local government meetings were held in a building in Oak Street, which burned down in 1896. A shire hall was then constructed in 1898 on the south-east corner of Ash and Beech Streets, which eventually became too small. In February 1912 a new larger shire hall was opened and that building (somewhat modified and extended) is still in use today and is heritage-listed.\nSt Joseph's Catholic Primary School was opened in 1896 by Sisters of Mercy, specifically Sister Mary Muredach McMullen (superior), Sister Mary Catherine Cleary, and Sister Mary Fayne, with the assistance of lay teacher Catherine Lobie. The original building had two storeys with the sisters living upstairs and the classrooms downstairs. In 1906 a new school building was erected to accommodate the school's 195 students. The current school building opened on 21 October 1962.In August 1909, a devastating fire destroyed buildings in Oak Street, including a general store (J. Dias), a saddlery (H. A. Hawthorne) and the Welcome Home Hotel (W. Kemp).\nThe Barcaldine War Memorial was unveiled by Queensland Governor, Matthew Nathan, on 21 May 1924.\nThe current Barcaldine Public Library opened in 2016.\nOn 26 May 2019, Barcaldine set a world record for a   line of 868 motorhomes, caravans, campervans and fifth wheelers outside the town, beating the previous record of 672 vehicles in Italy in 2003.\nOn 22 November 2019, the Queensland Government decided to amalgamate the localities in the Barcaldine Region, resulting in five expanded localities based on the larger towns: Alpha, Aramac, Barcaldine, Jericho and Muttaburra. Barcaldine was expanded to incorporate Barcaldine Downs, Evora, Grant (all except for the eastern corner), Home Creek, Ingberry (southern part), Moombria, Narbethong (all except for the north-eastern corner), Patrick, Saltern Creek, and Tara Station.\nLabour movement\nBarcaldine played a significant role in the Australian labour movement and the birth of the Australian Labor Party. In 1891, it was one of the focal points of the 1891 Australian shearers' strike, with the Eureka Flag flying over the strike camp. The landmark Tree of Knowledge, under which the strikers met, stood outside the railway station. In 2006, persons unknown poisoned the tree with the herbicide Roundup, which led to its demise.\nOne of the first May Day marches in the world took place during the strike on 1 May 1891 in Barcaldine. The Sydney Morning Herald reported that of the 1,340 men that took part, 618 were mounted on horses. Banners carried included those of the Australian Labor Federation, the Shearers' and Carriers' Unions, and one inscribed 'Young Australia'. The leaders wore blue sashes and the Eureka Flag was carried. The Labor Bulletin reported that cheers were given for \"the Union\", \"the Eight-hour day\", \"the Strike Committee\" and \"the boys in gaol\". It reported the march:On the 9 September 1892 the Manifesto of the Queensland Labour Party was read out under the well known Tree of Knowledge at Barcaldine following the Great Shearers' Strike. The State Library of Queensland now holds the manifesto, in 2008 the historic document was added to UNESCO's Memory of the World Australian Register and in 2009, the document was added to UNESCO's Memory of the World International Register.\nThe [https://www.australianworkersheritagecentre.com.au/ Australian Workers Heritage Centre] opened in Barcaldine in 1991 as a museum to pay tribute to Australian workers.\nHeritage listings\nBarcaldine has a number of heritage-listed sites, including:\n* Barcaldine Shire Hall, Ash Street\n* Barcaldine War Memorial Clock, Ash Street\n* Shearers' Strike Camp Site, Bank of Lagoon Creek\n* Barcaldine Masonic Temple, 39 Beech Street\n* St Peter's Anglican Church and Hall, 85 Elm Street\n* Tree of Knowledge, Oak Street\nDemographics\nIn the , the locality of Barcaldine had a population of 1,540.\nIn the , the locality of Barcaldine had a population of 1,422.\nIn the , the town of Barcaldine had a population of 1,316, while the locality had a population of 1,655.\nClimate\nBarcaldine experiences a hot semi-arid climate (Köppen: BSh), with a short wet season from December and March and a lengthy dry season from April and November, with cool nights. Average maxima vary from  in July to  in December. Average annual rainfall is low: , occurring within 40.2 rainfall days, and primarily from tropical cyclones or monsoonal depressions in summer. Rainfall is extremely erratic due to ENSO, with annual totals ranging from  in 1946 to  in 2010. The town is very sunny, averaging 172.7 clear days and only 61.1 cloudy days annually. Extreme temperatures have ranged from  on 20 June 1976 and 10 July 1974 to  on 30 November 2006.\n}}\nEducation\nBarcaldine Prep–12 State School is a government primary and secondary (Early Childhood to Year 12) school for boys and girls at Gidyea Street (). In 2017, the school had an enrolment of 284 students with 29 teachers (27 full-time equivalent) and 22 non-teaching staff (16 full-time equivalent).\nSt Joseph's Catholic Primary School is a Catholic primary (Prep–6) school for boys and girls at 23 Willow Street (). In 2017, the school had an enrolment of 26 students with 5 teachers (4 full-time equivalent) and 3 non-teaching staff (2 full-time equivalent).\nWanpa-rda Matilda Outback Education Centre is an Outdoor and Environmental Education Centre at the corner of Ash and Willow Streets ().\nMedia\nBarcaldine has only one commercial radio station, West FM (Resonate Radio), which transmits on 100.9 FM.\nThe Australian Broadcasting Corporation transmits ABC TV and its sister channels ABC Kids, ABC Family, ABC Entertains and ABC News through its relay station, ABBQ.\nThe Seven Network and its sister channels 7two, 7Mate and 7Flix transmit to Barcaldine through its regional area affiliate, ITQ.\nThe Nine Network and its sister channels 9Gem, 9Go! and 9Rush transmit to Barcaldine through its regional area affiliate, IMP.\nNetwork Ten and its sister channels 10 Bold Drama, 10 Peach Comedy and Nickelodeon transmit to Barcaldine through its regional area affiliate, CDT.\nThe Special Broadcasting Service and its sister channels SBS Viceland, SBS World Movies and SBS Food also transmit to Barcaldine.\nAmenities\nBarcaldine has a bowls, tennis clubs, a combined racecourse and showground near the golf course, a historical and folk museum, swimming pool and visitor information centre.\nBarcaldine Regional Council operates a library at 71 Ash Street, with a high-speed ISDN broadband Internet connection to Brisbane (via the National Broadband Network).\nThe Barcaldine branch of the Queensland Country Women's Association has its rooms at 5 Maple Street  (corner of Ash Street, ).\nBarcaldine Uniting Church is at 7-9 Maple Street ().\nAttractions\nThe attractions in Barcaldine include:\n* the Tree of Knowledge\n* the Australian Workers Heritage Centre\n* the Barcaldine and District Historical Museum\nCultural references\n''The Working Man's Paradise: an Australian Labour novel'', was written by William Lane under the pseudonym John Miller in 1892, inspired by the events of the 1891 Shearers' Strike in Barcaldine. This story shows a contrast between the 'haves' and the 'have nots' (slum dwellers and the wealthy citizens) and depicts the conflict between the squatters and pastoral workers. The preface of the book states, 'The scene is laid in Sydney because it is not thought desirable, for various reasons, to aggravate by a local plot the soreness existing in Queensland'.\nBarcaldine features in Hail Tomorrow: a play in four acts, written by Vance Palmer in 1947. The full-length play's conflict centres about the Queensland shearers' strike of 1891.\nSee also\n* Barcaldine Airport\n* List of tramways in Queensland\nReferences\nFurther reading\n*\nExternal links\n* [http://queenslandplaces.com.au/barcaldine-and-barcaldine-shire University of Queensland: Queensland Places: Barcaldine and Barcaldine Shire]\n*\n*\n* [https://web.archive.org/web/20080618163935/http://manuscriptsqld.slq.qld.gov.au/home/features/manifesto Manifesto of the Queensland Labour Party] - digitised and held by John Oxley Library, State Library of Queensland, Australia.\n* [https://gisservices.information.qld.gov.au/arcgis/rest/directories/historicalscans/cad_scans/cad-map-town-barcaldine-1984.jpg Town map of Barcaldine, 1984]\n* [https://onesearch.slq.qld.gov.au/permalink/61SLQ_INST/bumb4u/alma99269253402061 Barcaldine Photographs 1900-1946], State Library of Queensland\n* [https://onesearch.slq.qld.gov.au/permalink/61SLQ_INST/dls06p/alma996907984702061 Annual reports Barcaldine Hospitals Board], State Library of Queensland"
    }
  ]
}