{
  "content": [
    {
      "type": "text",
      "text": "# Baringa, Democratic Republic of the Congo\n\n|elevation_footnotes    =\n|elevation_m            = 371\n|elevation_ft           =\n|postal_code_type       =\n|postal_code            =\n|area_code              =\n|blank_name             =\n|blank_info             =\n|blank1_name            =\n|blank1_info            =\n|website                =\n|footnotes              =\n}}Baringa is a village in Tshuapa Province, Befale Territory in the Democratic Republic of the Congo.\nIt stands on the banks of the Maringa River at approximately 180&nbsp;km upriver from Basankusu. It can be said to be the twin of its neighbouring village, Boilinga, which is joined to it along the same road. The Protestant mission, including the hospital, primary school, and missionaries' houses are in Baringa. The Catholic mission of Baringa, together with teachers' and workers' houses, primary and secondary school buildings and boarding houses, and the Catholic church, can be said to be in Boilinga.\nThere is a group of dwellings between Boilinga and Baringa where the chief of Baringa lives. There is a radio transmitter there for communication with Kinshasa, and the transfer of money. The chief of Boilinga lives in a similar setting on the outward side, towards Bauta, of Boilinga.\nBaringa Hospital\nThe village has a hospital which was built in the early 20th century. In 2002, the International Committee of the Red Cross (ICRC) published research on the two million people, who were isolated without the possibility of access to health services. With this in mind, the Bishop of Basankusu, Joseph Mokobe Ndjoku, asked the Jesuit Refugee Service (JRS) to implement a health project in Baringa, to remedy the situation. The hospital at that time, which had always been supported by the Protestant mission, was in a state of disrepair because of the war and the absence of doctors. JRS repaired and upgraded the hospital and Médecins Sans Frontières were able to provide medicines. The project finished at the end of 2005 as more international attention was drawn to the situation, other NGOs began to take charge of Baringa and the wider area's nutrition and health needs.\nThe hospital was built during the colonial era as a fever hospital, dealing with high rates of malaria, but gradually became a general hospital. The lack of medical personnel, equipment and medicines severely compromise the effectiveness of the hospital.\nA leper colony was established 5&nbsp;km down-river, at Lifeta, and was served by the hospital. This has almost disappeared now because of the advances in treatment: new cases of leprosy are treated in people's homes now.\nInvestigation of the Congo Free State Crimes\nIn 1904, an investigation commission sent by Leopold II, King of the Belgians came to Baringa to gather evidence of crimes perpetrated by the Congo Free State administration against the local population. Among the witnesses appearing before the commission was Lontulu, a chief of the village of Bolima. While his appearance in front of the commission was unplanned, he came with 110 twigs which he showed to the commission. Upon handing over each twig to the commission, he cited one name representing a villager, man, woman, or child, who was killed by the troops of the Congo Free State.\nThanks to Lontulu's courage, the commission acknowledged the atrocities taking place in the Congo Free State, which eventually obliged the king to bequeath the Congo Free State to Belgium. Lontulu paid dearly for his witnessing. Shortly after the commission left Baringa, he was tortured and killed by soldiers of the Congo Free State.\nReferences\nExternal links\n*YouTube - Monsieur Hannaway - Basankusu: In the African rainforest village of Baringa (English subtitles)\n*YouTube - Monsieur Hannaway - Basankusu: Meeting Young People in Baringa"
    }
  ]
}