{
  "content": [
    {
      "type": "text",
      "text": "# Barking (electoral division)\n\nBarking was an electoral division for the purposes of elections to the Greater London Council. The constituency elected two councillors for a three-year term in 1964, 1967 and 1970.\nThe constituency was revised in 1973 and then elected one councillor for a four-year term in 1973, 1977 and 1981, with the final term extended for an extra year ahead of the abolition of the Greater London Council.\nHistory\nIt was planned to use the same boundaries as the Westminster Parliament constituencies for election of councillors to the Greater London Council (GLC), as had been the practice for elections to the predecessor London County Council, but those that existed in 1965 crossed the Greater London boundary. Until new constituencies could be settled, the 32 London boroughs were used as electoral areas which therefore created a constituency called Barking.\nThe new constituencies were settled following the Second Periodic Review of Westminster constituencies and the electoral division was replaced from 1973 by the single-member electoral divisions of Barking and Dagenham. The new Barking electoral division matched the boundaries of the Barking parliamentary constituency.\nFirst series\n|area              =\n|image             = |frame=yes|plain=yes|frame-align=center|frame-width=250|frame-height=245}}\n|caption           = Barking electoral division boundaries from 1965 to 1973\n}}\nThe Barking constituency was used for the Greater London Council elections in 1964, 1967 and 1970. Two councillors were elected at each election using first-past-the-post voting.\n1964 election\nThe first election was held on 9 April 1964, a year before the council came into its powers. The electorate was 118,568 and two Labour Party councillors were elected. With 40,578 people voting, the turnout was 34.2%. The councillors were elected for a three-year term.\n1967 election\nThe second election was held on 13 April 1967. The electorate was 114,589 and two Labour Party councillors were elected. With 28,539 people voting, the turnout was 24.9%. The councillors were elected for a three-year term.\n1970 election\nThe third election was held on 9 April 1970. The electorate was 121,477 and two Labour Party councillors were elected. With 31,395 people voting, the turnout was 25.8%. The councillors were elected for a three-year term.\nSecond series\n|towns             = Barking\n|year              = 1973\n|abolished         = 1986\n|members           = 1\n|next              =\n|previous          = Barking\n|population        =\n|electorate        =\n|area              =\n|image             = |frame=yes|plain=yes|frame-align=center|frame-width=250|frame-height=245}}\n|caption           = Barking electoral division boundaries from 1973 to 1986\n}}\nThe Barking constituency was used for the Greater London Council elections in 1973, 1977 and 1981. One councillor was elected at each election using first-past-the-post voting.\n1973 election\nThe fourth election to the GLC (and first using revised boundaries) was held on 12 April 1973. The electorate was 49,769 and one Labour Party councillor was elected. The turnout was 29.7%. The councillor was elected for a three-year term. This was extended for an extra year in 1976 when the electoral cycle was switched to four-yearly.\n1977 election\nThe fifth election to the GLC (and second using revised boundaries) was held on 5 May 1977. The electorate was 49,493 and one Labour Party councillor was elected. The turnout was 40.8%. The councillor was elected for a four-year term.\n1981 election\nThe sixth and final election to the GLC (and third using revised boundaries) was held on 7 May 1981. The electorate was 47,975 and one Labour Party councillor was elected. The turnout was 42.4%. The councillor was elected for a four-year term, extended by an extra year by the Local Government (Interim Provisions) Act 1984, ahead of the abolition of the council.\nReferences"
    }
  ]
}