{
  "content": [
    {
      "type": "text",
      "text": "# Barking Abbey\n\n| disestablished = 1539 (demolished by 1541)\n| mother =\n| dedication = Saint Mary and Saint Ethelburga\n| diocese =\n| churches =\n| founder = Saint Erkenwald. Founded for his sister Saint Ethelburga\n| abbot =\n| prior =\n| archbishop =\n| bishop =\n| archdeacon =\n| people = Katherine de la Pole\n| status =\n| functional_status =\n| heritage_designation =\n| designated_date =\n| architect =\n| groundbreaking =\n| completed_date =\n| construction_cost =\n| location = Barking, London, London, England\n| map_type = Greater London\n| coord =\n| oscoor =\n| remains =\n| public_access =\n| other_info =\n| embedded =\n| designation2 =     Scheduled Monument\n| designation2_offname = Barking Abbey\n| designation2_date = 6 February 1954\n| designation2_number =\n}}\n}}\nThe Abbey of St Mary and St Ethelburga, founded in the 7th-century and commonly known as Barking Abbey, is a former Roman Catholic, royal monastery located in Barking, in the London Borough of Barking and Dagenham. It has been described as having been \"one of the most important nunneries in the country\".\nOriginally established in the 7th century, from the late 10th century the abbey followed the Rule of St. Benedict. The abbey had a large endowment and sizeable income but suffered severely after 1377, when the River Thames flooded around  of the abbey's land, which was unable to be reclaimed. However, at the time of the dissolution, it was still the third-wealthiest women's monastery in England.\nThe abbey existed for almost 900 years, until its closure in 1539, as part of King Henry VIII's Dissolution of the Monasteries. It had many notable abbesses including several saints, former queens and the daughters of kings. The abbess of Barking held precedence over all other abbesses in England.\nThe ruined remains of Barking Abbey now form part of a public open space known as Abbey Green. It is recognisable for its partially restored Grade-II* Listed Curfew Tower, which features on the coat of arms of the London Borough of Barking and Dagenham.\nBarking Abbey is also notable because the adjacent St Margaret's Church, a grade I listed building dating back to the 13th century, was built within its grounds. The Abbey Ruins are used as a venue each May for outdoor classical concerts, as well as an annual pilgrimage by members of the Eastern Orthodox Church.\nHistory\nAnglo-Saxon founding\nBarking Abbey was founded c. 660–664 or 666 by Saint Earconwald (later Bishop of London) for his sister Saint Ethelburga. At the same time, he founded Chertsey Abbey for himself. Earconwald died at the abbey in 693, and his body was taken to St. Paul's Cathedral in London for burial. Bede recounts many miracles associated with the early abbey.\nBarking Abbey was initially dedicated to the Virgin Mary and later to both St. Mary and St. Ethelburga, who served as the abbey's first abbess. The original abbey was a double monastery that followed either the Rule of St. Columbanus or the Benedictine Rule, and it was built of wood, wattle and daub, and reused Roman tile. During Ethelburga's lifetime, the abbey's holdings were enlarged by the Hodilred Charter and possibly the Earconwald Charter.\nEthelburga was taught and succeeded as abbess by Saint Hildelith of Faremoutier, who retained the position until her death c. 712. At this time, the abbey was a centre of learning and its nuns were the dedicatees of Aldhelm's De Virginitate c. 700.\nThe abbey was burned by Vikings c. 871, and the nuns fled to their London estate, probably All Hallows Barking by the Tower. Goscelin, writing c. 1087, describes St. Ethelburga miraculously summoning a wolf, bear, and lion to defend the empty monastery, and relates another raid whereupon the abbess and nuns defiantly barricaded themselves inside the abbey, which the invaders then set alight.\nThe abbey was refounded as a female-only community in the early–mid 10th century, and Saint Wulfhilda (Wlfhildis) became abbess c. 963. Wulfhilda had grown up at Wilton Abbey, Wiltshire. King Edgar the Peaceful fell in love with Wulfhilda at Wilton, but she was committed to pursuing a religious life and spurned his advances, presents and offers of marriage. Eventually Edgar tried to entrap Wulfhilda; getting her aunt, Abbess Wenflaeda of Wherwell to fake an illness and summon Wulfhilda, with Edgar instead waiting when Wulfhilda arrived. On arriving, she \"found his fervour so alarming that she fled, leaving her sleeve in his hand, and escaping through the drains\".\nWulfhilda pursued her ambition and became a nun. King Edgar then created her Abbess of Barking and donated \"considerable estates\" to Barking Abbey. Wulfhilda herself donated 20 villages to the abbey and established another monastery at Horton in Kent.\nKing Edgar's eventual queen, Ælfthryth became jealous of Wulfhilda, and following her husband's death deposed her as Abbess of Barking. Wulfhilda was later restored by Edgar's and Ælfthryth's son, King Æthelred the Unready.\nAnother version of the story says that Queen Ælfthryth, as overseer of the abbey, deposed the abbess Wulfida after complaints made by the nuns; and that it was the Queen, not her son, who reinstated her twenty years later.\nSaint Dunstan, Archbishop of Canterbury changed Barking Abbey to follow the Rule of St. Benedict. According to medieval scholar Katie Ann-Marie Bugyis, Barking Abbey may have been \"especially devoted to Martha\", the sister of Mary of Bethany and Lazarus in the Gospels of Luke and John. In , Osbert of Clare wrote a letter to Adelzia, who was abbess at the time, requesting that the Barking Abbey nuns pray for him; Katie Ann-Marie Bugyis states that it demonstrates his \"confidence in the promptness and solicitude\" of their prayers.\nAfter the Norman Conquest\nAt the time of the Norman conquest of England, the abbess was Æfgiva. King William the Conqueror confirmed Æfgiva's control of the abbey with a royal charter issued in either November or December 1066. William granted her \"my peace and love, and all my rights within and without the burgh as fully as any abbess in that monastery of St.Mary had them in the time of King Edward\". At the time, King William was staying at Barking Abbey whilst he constructed the Tower of London. It was also at the abbey that King William received the submissions of the brothers Morcar, Earl of Northumbria, and Edwin, Earl of Mercia; Morcar and Edwin's sister, Queen Ealdgyth was the widow of the defeated King Harold II (Godwinson).\nDuring her tenure as abbess, Æfgiva expanded and rebuilt the abbey, tearing down the existing building and founding \"a church which rivalled the heights of the country.\" She also commissioned Goscelin of Saint-Bertin to write a series of hagiographies for Ethelburga, Hildelith, and Wulfhilda, which he completed c. 1087. The relics of the three saints were then translated into the new church and reburied under the abbey's choir.\nIn 1086, the abbey and its holdings were documented in the Domesday Book.\nQueen Maud/Matilda (c.1080–1 May 1118), wife of King Henry I, financed the construction of two stone bridges and a causeway over the branches of the River Lea in Stratford-by-Bow. As Barking Abbey was the closest to the bridges, the queen gave the abbey the responsibility for maintaining the bridges and donated lands as an endowment to finance those future repairs. After the foundation of Stratford Langthorne Abbey in 1135 (which was closer to the bridges), the Abbess of Barking transferred the responsibility to Stratford. This started a dispute between the two abbeys which was not settled until 1315. A settlement was reached when the Abbess of Barking paid the Abbot of Stratford Lanthorne £200 (); in return, the abbot agreed to maintain the bridges and causeway and to pay an annual rent of four marks () to the abbess.\nMary Becket, the sister of Saint Thomas Becket, Archbishop of Canterbury, was created abbess of Barking in 1173, as reparation for the murder of her brother.\nThe abbey has been described as \"perhaps the longest lived...institutional centre of literary culture for women in British history\". During the twelfth century, Clemence of Barking, a nun at the abbey and a rare female author in this period, wrote, among other works, an innovative life of St Catherine of Alexandria, a saint associated with female learning.\nIn the early thirteenth century, the east end of the abbey was expanded into a saints' chapel, where the relics of Ethelburga, Hildelith, and Wulfhilda were translated and given greater prominence. The church was rededicated by Abbess Mabel de Bosham (1215–1247).\nPrior to 1214, as a \"royal foundation\", the abbesses of Barking had been chosen by the King. However, following pressure from the Pope, King John allowed the nuns to conduct elections to choose their abbess. The crown would later, however, claim they had the right to select a nun to join the abbey each time a new monarch acceded to the throne. This privilege was used to nominate Alice de Belhus on the accession of King Edward II in 1307, Margaret Swinford (daughter of Katherine Swynford and later abbess) on the accession of King Richard II in 1377, Maud Kylet in 1404 (five years after the accession of King Henry IV), and Goda Hapton in 1430 (eight years after the accession of King Henry VI).\nThe abbey's status granted it several rights and responsibilities. The abbess had precedence over all the other abbesses in England. She was also one of four abbesses who, \"holding of the king by barony\" were required to perform military service. The abbess had to perform these duties during the reigns of both King Henry III and King Edward I.\nIn the Taxation Rolls of 1291, the abbey was recorded as having an income of £300 13s 1¼d ().\nElizabeth de Burgh Queen of Scots, captured by the English in 1306, was confined here from March 1313 to March 1314.\nElizabeth de Clare was briefly imprisoned in Barking Abbey in 1322, as part of a campaign to force her to surrender some of her Welsh estates to Hugh Despenser the younger. Whilst imprisoned some of her \"valuable possessions\" were extorted but they were later recovered.\nIn 1377 a larger portion of the abbey's lands near to the River Thames was flooded. The devastation was severe and the abbey's fortunes never completely recovered: The devastation of the land, and the high cost of repairing dykes led to the abbey's impoverishment.\nIn 1382 the abbey's lands were recorded as still \"inundated\" (flooded), and their yearly income had fallen to 400 marks (). In 1409, 32 years after the flood, the land had still not been reclaimed, despite the abbey having spent over £2,000 (equivalent to £&nbsp;million in ) in attempts to save it. Around 720 acres of land had been lost; 600 of which was in Dagenham Marsh. Various attempts were made to try to help the abbey. In 1380 the king released the abbey from certain charges. In 1384 they were given permission to \"impress\" (force) labourers to help improve the situation on Dagenham Marsh. The abbey was granted \"various liberties in Becontree hundred\" in 1392 and 1462, and exempted from payment of \"tenths\" for ten years from 1409. It seems the land was never reclaimed, as during the reign of King Henry VII (1485–1509) the flooded lands were \"exempted from the statute\", thus \"extending the jurisdiction of the Mayor of London as the conservator of the Thames\".\nIn 1381 Elizabeth Chaucer became a nun at the abbey. Elizabeth was the daughter of the poet Geoffrey Chaucer and Philippa De Roet. When Elizabeth joined the abbey John of Gaunt, a royal prince, paid £51 8s 2d () \"for expenses and gifts\" for the occasion. Geoffrey Chaucer was in the service of the king's court and John of Gaunt much of his life. Katherine Swynford, who eventually became the wife of John of Gaunt, was Philippa Chaucer's sister. Elizabeth Chaucer's brother, Thomas Chaucer, served in John of Gaunt's home at an early age and rose through the ranks to become very successful. Thomas's daughter would go on to become Duchess of Suffolk.\nIn 1404, Barking Abbey is recorded as having a librarian, one of just three insular abbeys to do so. Several fifteenth-century manuscripts used at Barking Abbey survive to the present, including a hymnal and Ordinale and Customary. The latter includes a calendar, instructions on how to perform certain rites, and commemorations of Barking's three saintly abbesses (Ethelburga, Hildelith, and Wulfhilda).\nDuring Katherine de la Pole's time as abbess, the young Edmund and Jasper Tudor were sent to be brought up in the abbess's custody by King Henry VI's council. The boys were Henry VI's half brothers: the children of Owen Tudor and Catherine of Valois; herself the widow of King Henry V and Henry VI's mother. The Tudors were raised and educated at Barking under the care of Abbess Katherine. An allowance of £52 12s () was paid for their maintenance. Edmund went on to father King Henry VII, who seized the throne at the Battle of Bosworth in 1485.\nThe abbey's water supply was ransomed by John Rigby of Cranbrook Manor in 1462. The water conduit to the abbey had broken and John Rigby had it repaired. He then decided that the abbey should pay an annual fee for its water supply. Katherine de la Pole was annoyed at this and instigated work to find an alternative and independent supply from their own spring.\nThe Valor Ecclesiasticus of 1535 records the abbey's gross income as £1,084 6s 2¼d (), which made it the third wealthiest nunnery in England; behind Sion Abbey and Shaftesbury Abbey.\nOne of the abbey's seals, which was used during the 13th century until its dissolution in 1539, elevates their patron saints as many conventual seals did at the time. The Virgin Mary holding the infant Christ, St. Paul, and St. Peter are depicted, as are its three abbess-saints, Æthelburh of Barking, Hildelith, and Wulfhilda of Barking.\nDissolution\nThe abbey was dissolved in 1539 as part of King Henry VIII's Dissolution of the Monasteries. It was formally surrendered by the abbess, and the 30 nuns, in the abbey's chapter-house on 14 November 1539. The abbess and nuns were all granted annual pensions 12 days later. The abbess' was 200 marks a year. Many of these pensions were still being paid during the reign of Queen Mary I.\nAfter the dissolution, the abbey was demolished and much of its wealth was sold off. At the time of the dissolution the abbey also controlled the manors of Barking, Abbes Hall, Bulphan, Caldecotes in Abbess Roding, Cokermouth in Dagenham, Down Hall, Great Warley, Hanley Hall, Hawkesbury in Fobbing, Highall in Tollesbury, Hockley, Ingatestone, Leaden Roding Mucking, Tollesbury, Wangey Hall, Westbury in Barking, Wigborough and Wood Barns; all in Essex. Demolition started in June 1540 and took around 18 months to complete, with only the abbey's north gate and Curfew Tower were left standing. Records from 1540 show £744 was raised from selling the abbey's lead; £122 13s from the sale of the abbey's eleven bells (12,912&nbsp;lb of \"bellmetal\"); and £182 2s 10d from the sale of \"goods, grain and cattle\". The abbey was also in possession of various jewels and valuables; including 3,586 ounces of silver.\nFollowing its demolition some of the abbey's building materials were reused: some of the lead was used to repair Greenwich Palace's roof, and some of the stone used to construct King Henry VIII's new Manor at Dartford.\nRemains (and present day)\nIn 1551 King Edward VI granted the abbey site and demesne land to Edward Clinton, 9th Baron Clinton (later 1st Earl of Lincoln). After that, the site was used as a quarry and a farm. The remains survived the Middle Ages, however, the North Gate was demolished around 1885. Today, only the Curfew Tower and the abbey's footprints and footings remain.\nThe abbey was excavated in 1910–11. The majority of the remains are buried: those remains visible were built in the 20th century to show the abbey's layout, although the original walls of the abbey church stand several feet high in portions. A modern ward of the present borough is named Abbey after the ruin. The ruins sit within a public open space known as Abbey Green.\nCurfew Tower\nof the Coat of arms of the London Borough of Barking and Dagenham]]\nThe Curfew Tower, also known as the Fire Bell Gate, was one of the abbey's three gateways and is the only part of the abbey not in ruins. The original tower was built in 1370, however the current tower was built around 1460. Above the gateway is \"The Chapel of the Holy Rood\", named for the 12th-century stone rood displayed within it.\nThe building has been repaired several times. In 1955/56 the chapel was redecorated and the windows repaired. In 2005/06 the tower was extensively repaired at the cost of £130,000. The staircase roof, and the covering of the main roof were replaced, and the tower's masonry was re-pointed, with the irreparably damaged stone replaced. Inside the chapel was again redecorated.\nThe tower is Grade-II* Listed, and is featured on the coat of arms of the London Borough of Barking and Dagenham.\nLondon Bridge stones\nIn 2007, two small stones from remains of the old medieval London Bridge were joined together in a sculpture in front of St Margaret's church facing the Barking Abbey ruins as part of several public artworks placed in Barking Town Centre by artist Joost Van Santen.\nBurials\n*Æthelburh of Barking\n*Hildelith\n*Torchtgyd\n*Wulfhilda of Barking\nList of abbesses\nAbbesses of Barking Abbey:\n* St. Ethelburga, , founder and first abbess of the Abbey\n* St. Hildelitha (Hildelith),\n* St. Wlfhildis (Wulfhilda), , created abbess by King Edgar the Peaceful, deposed by his wife Queen Elfrida who was jealous as the King was in love with her\n* Queen Alftrudis. (Queen Elfrida?)\n* St. Wlfhildis (Wulfhilda), again, died . Restored as abbess by King Æthelred the Unready\n* Ælfgiva,\n* Matilda of Scotland, wife of King Henry I\n* Agnes, appointed by King Henry I\n* Matilda of Boulogne, wife of King Stephen\n* Adeliza, sister of Payn FitzJohn, appointed by King Stephen\n* Mary, sister of Thomas Becket, appointed 1173, created abbess in reparation for the murder of her brother\n* Matilda of England, daughter of King Henry II, appointed , occurs 1198\n* Christiana de Valoniis, occurs 1202 and 1205\n* Sybil, elected 1215\n* Mabel de Boseham, 1215–1247, died in office\n* Maud, illegitimate daughter of King John, 1247–1252, died in office\n* Christiana de Boseham, 1252–1258, resigned\n* Maud de Leveland, elected 1258–1275, resigned\n* Alice de Merton, 1276–1291, died in office\n* Isabel de Basinges, 1291–1294, died in office\n* Maud de Grey, 1294–1295, died in office\n* Anne de Vere. 1295-1318, died in office\n* Eleanor de Weston, 1318–1329, died in office\n* Yolande de Sutton, 1329–1341, died in office\n* Maud Montagu, 1341–1352, died in office\n* Isabel Montagu, 1352–1358, died in office\n* Katharine de Sutton, 1358–1377, died in office\n* Maud Montagu, 1377–1393\n* Sybil de Felton (or Morley), daughter of Sir Thomas and Dame Joan de Felton, 1393–1419, died in office\n* Margaret Swynford, daughter of Katherine Swynford (wife of John of Gaunt, 1st Duke of Lancaster), 1419–1433, died in office\n* Katherine de la Pole, daughter of Michael de la Pole, 2nd Earl of Suffolk, 1433–1473, died in office\n* Elizabeth Lexham, 1473–1479, died in office\n* Elizabeth Shuldham, 1479–1499, died in office\n* Elizabeth Grene, 1499–1527, died in office\n* Dorothy Barley, sister of Henry Barley, 1527–1539, the last abbess\nGallery\nFile:Barking abbey ruins london.jpg|The ruins\nFile:Barking_Abbey.jpg|Another view of the ruins\nFile:Barking abbey ruins.jpg|The ruins with Abbey Retail Park and Canary Wharf in the background\nSee also\n* Barking Abbey School\nReferences\nExternal links\n* [http://www.tudorplace.com.ar/Objetos/Places/BarkingAbbey-1500.jpg Drawing of what Barking Abbey may have looked like]\n* [https://web.archive.org/web/20141126033641/http://www.lbbd.gov.uk/MuseumsAndHeritage/LocalHistoryResources/Pages/BarkingAbbey.aspx Barking and Dagenham London Borough Council]\n* [http://www.tudorplace.com.ar/Documents/barking_abbey.htm Tudor Place] – Barking Abbey\n* [http://www.british-history.ac.uk/report.aspx?compid=39832 Houses of Benedictine nuns: Abbey of Barking, A History of the County of Essex: Volume 2 (1907), pp. 115–122]"
    }
  ]
}