{
  "content": [
    {
      "type": "text",
      "text": "# Basalt, Queensland\n\n| pop                 = 215\n| pop_year            =\n| pop_footnotes       =\n| established         =\n| postcode            = 4820\n| area                = 14006.3\n| timezone            = AEST\n| utc                 = +10:00\n| dist1               = 95.6\n| dir1                = NW\n| location1           = Charters Towers\n| dist2               = 142\n| dir2                = WSW\n| location2           = Townsville\n| dist3               = 1404\n| dir3                = NNW\n| location3           = Brisbane\n| lga                 = Charters Towers Region\n| stategov            = Traeger\n| fedgov              = Kennedy\n| near-n              = GreenvaleValley of Lagoons\n| near-ne             = Paluma\n| near-e              = Dotswood\n| near-se             = BreddanSouthern CrossBlack Jack\n| near-s              = HomesteadCampaspe\n| near-sw             = Pentland\n| near-w              = Porcupine\n| near-nw             = Lyndhurst\n}}\nBasalt is a rural locality in the Charters Towers Region, Queensland, Australia. In the , Basalt had a population of 215 people.\nGeography\nIn the north and west lies the Clarke River.  The Burdekin River drains the south where a confluence of waterways meet.  Dalrymple National Park was established along the Burdekin in 1990. The Great Basalt Wall National Park is in the south-west of the locality in two sections.\nThe area has road access via the Gregory Developmental Road. The Hervey Range Developmental Road enters from the east to intersect the Gregory Highway.\nThe now-closed Greenvale railway line passed through the locality with Tulay railway station now abandoned ().\nApart from the protected areas, the land use is grazing on native vegetation.\nDemographics\nIn the , Basalt had a population of 229 people.\nIn the , Basalt had a population of 190 people.\nIn the , Basalt had a population of 215 people.\nHeritage listings\nThere are a number of heritage sites in Basalt, including:\n* Lolworth Creek Battery\n* Bluff Downs Station: Hann Family Grave\nEducation\nThere are no schools in Basalt. For students living in the south-east of locality, the nearest government primary schools are Richmond Hill State School in the suburb of Richmond Hill in Charters Towers to the south-east, Charters Towers Central State School in the Charters Towers CBD to the south-east, and Homestead State School in Homestead, also to the south-east. For students in the south-east of the locality, the nearest government secondary school is Charters Towers State High School in the Charters Towers CBD.\nFor students in the rest of the locality, there are no nearby schools. The options are distance education and boarding school.\nReferences"
    }
  ]
}