{
  "content": [
    {
      "type": "text",
      "text": "# Baseball Prospectus Internet Baseball Awards\n\nThe annual Greg Spira Memorial  Internet Baseball Awards (IBA) are based on fan voting. They were founded in 1991 by Greg Spira with the Most Valuable Player, Cy Young (now Pitcher of the Year), and Rookie of the Year awards, in each of the two leagues in Major League Baseball. In 1998, an award for Manager of the Year was added in each league.  Spira managed the awards until his death at the end of 2011. The awards were then named in his memory.\nWinners\nSince 1998, eight awards have been given each year. From 1991 to 1997, there were six awards each year.\n1991–1999\n:See footnote\n1991\n*Most Valuable Player, AL: Cal Ripken, Orioles\n*Most Valuable Player, NL: Barry Bonds, Pirates\n*Cy Young, AL: Roger Clemens, Red Sox\n*Cy Young, NL: Tom Glavine, Braves\n*Rookie of the Year, AL: Chuck Knoblauch, Twins\n*Rookie of the Year, NL: Jeff Bagwell, Astros\n1992\n*Most Valuable Player, AL: Frank Thomas\n*Most Valuable Player, NL: Barry Bonds\n*Cy Young, AL: Roger Clemens\n*Cy Young, NL: Greg Maddux\n*Rookie of the Year, AL: Pat Listach\n*Rookie of the Year, NL: Reggie Sanders\n1993\n*Most Valuable Player, AL: Frank Thomas\n*Most Valuable Player, NL: Barry Bonds\n*Cy Young, AL: Kevin Appier\n*Cy Young, NL: Greg Maddux\n*Rookie of the Year, AL: Tim Salmon\n*Rookie of the Year, NL: Mike Piazza\n1995\n*Most Valuable Player, AL: Albert Belle\n*Most Valuable Player, NL: Greg Maddux\n*Cy Young, AL: Randy Johnson\n*Cy Young, NL: Greg Maddux\n*Rookie of the Year, AL: Garret Anderson\n*Rookie of the Year, NL: Hideo Nomo\n1996\n*Most Valuable Player, AL: Alex Rodriguez\n*Most Valuable Player, NL: Mike Piazza\n*Cy Young, AL: Pat Hentgen\n*Cy Young, NL: Kevin Brown\n*Rookie of the Year, AL: Derek Jeter\n*Rookie of the Year, NL: Édgar Rentería\n1997\n*Most Valuable Player, AL: Ken Griffey\n*Most Valuable Player, NL: Mike Piazza\n*Cy Young, AL: Roger Clemens\n*Cy Young, NL: Pedro Martínez\n*Rookie of the Year, AL: Nomar Garciaparra\n*Rookie of the Year, NL: Scott Rolen\n1998\n*Most Valuable Player, AL: Nomar Garciaparra\n*Most Valuable Player, NL: Mark McGwire\n*Cy Young, AL: Roger Clemens\n*Cy Young, NL: Greg Maddux\n*Rookie of the Year, AL: Ben Grieve\n*Rookie of the Year, NL: Kerry Wood\n*Manager of the Year, AL: Joe Torre\n*Manager of the Year, NL: Larry Dierker\n1999\n*Most Valuable Player, AL: Pedro Martínez\n*Most Valuable Player, NL: Chipper Jones\n*Cy Young, AL: Pedro Martínez\n*Cy Young, NL: Randy Johnson\n*Rookie of the Year, AL: Carlos Beltrán\n*Rookie of the Year, NL: Scott Williamson\n*Manager of the Year, AL: Jimmy Williams\n*Manager of the Year, NL: Bobby Cox\nTeam of the Decade (1990–1999)\n;MVP\n*Barry Bonds, Pirates–Giants\n;Infield\n*Catcher: Mike Piazza, Dodgers–Marlins–Mets\n*First Base: Mark McGwire, Athletics–Cardinals\n*Second Base: Roberto Alomar, Padres–Blue Jays–Orioles–Indians\n*Shortstop: Barry Larkin, Reds\n*Third Base: Matt Williams, Giants–Indians–Diamondbacks\n;Outfield\n*Left Field: Barry Bonds, Pirates–Giants\n*Center Field: Ken Griffey Jr., Mariners\n*Right Field: Tony Gwynn, Padres\n*Designated Hitter (AL): Edgar Martínez, Mariners\n;Rotation (top 5 starting pitchers)\n*Pitcher of the Decade: Greg Maddux, Cubs–Braves\n*Roger Clemens, Red Sox–Blue Jays–Yankees\n*Randy Johnson, Expos–Mariners–Astros–Diamondbacks\n*Tom Glavine, Braves\n*Pedro Martínez, Dodgers–Expos–Red Sox\n;Bullpen (top 6 relief pitchers)\n*Reliever of the Decade: Dennis Eckersley, Athletics–Cardinals–Red Sox\n*Trevor Hoffman, Marlins–Padres\n*John Wetteland, Dodgers–Expos–Yankees–Rangers\n*John Franco, Mets\n*Jeff Montgomery, Royals\n*Randy Myers, Reds–Padres–Cubs–Orioles–Blue Jays\n2000–2009\n:See footnote\n2000\n*Most Valuable Player, AL: Jason Giambi\n*Most Valuable Player, NL: Barry Bonds\n*Cy Young, AL: Pedro Martínez\n*Cy Young, NL: Randy Johnson\n*Rookie of the Year, AL: Kazuhiro Sasaki\n*Rookie of the Year, NL: Rick Ankiel\n*Manager of the Year, AL: Jerry Manuel\n*Manager of the Year, NL: Dusty Baker\n2001\n*Most Valuable Player, AL: Jason Giambi, Athletics\n*Most Valuable Player, NL: Barry Bonds, Giants\n*Cy Young, AL: Freddy García, Mariners\n*Cy Young, NL: Randy Johnson, Diamondbacks\n*Rookie of the Year, AL: Ichiro Suzuki, Mariners\n*Rookie of the Year, NL: Albert Pujols, Cardinals\n*Manager of the Year, AL: Lou Piniella, Mariners\n*Manager of the Year, NL: Larry Bowa, Phillies\n2002\n*Most Valuable Player, AL: Alex Rodriguez\n*Most Valuable Player, NL: Barry Bonds\n*Cy Young, AL: Pedro Martínez\n*Cy Young, NL: Randy Johnson\n*Rookie of the Year, AL: Eric Hinske\n*Rookie of the Year, NL: Jason Jennings\n*Manager of the Year, AL: Mike Scioscia\n*Manager of the Year, NL: Jim Tracy\n2003\n*Most Valuable Player, AL: Alex Rodriguez, Rangers\n*Most Valuable Player, NL: Barry Bonds, Giants\n*Cy Young, AL: Roy Halladay, Blue Jays\n*Cy Young, NL: Mark Prior, Cubs\n*Rookie of the Year, AL: Ángel Berroa, Royals\n*Rookie of the Year, NL: Brandon Webb, Diamondbacks\n*Manager of the Year, AL: Tony Peña, Royals\n*Manager of the Year, NL: Jack McKeon, Marlins\n2004\n*Most Valuable Player, AL: Vladimir Guerrero\n*Most Valuable Player, NL: Barry Bonds\n*Cy Young, AL: Johan Santana\n*Cy Young, NL: Randy Johnson\n*Rookie of the Year, AL: Bobby Crosby\n*Rookie of the Year, NL: Jason Bay\n*Manager of the Year, AL: Buck Showalter\n*Manager of the Year, NL: Bobby Cox\n2005\n*Most Valuable Player, AL: Alex Rodriguez, Yankees\n*Most Valuable Player, NL: Albert Pujols, Cardinals\n*Cy Young, AL: Johan Santana, Twins\n*Cy Young, NL: Roger Clemens, Astros\n*Rookie of the Year, AL: Huston Street, Athletics\n*Rookie of the Year, NL: Ryan Howard, Phillies\n*Manager of the Year, AL: Ozzie Guillén, White Sox\n*Manager of the Year, NL: Bobby Cox, Braves\n2006\n*Most Valuable Player, AL: Derek Jeter\n*Most Valuable Player, NL: Albert Pujols\n*Cy Young, AL: Johan Santana\n*Cy Young, NL: Brandon Webb\n*Rookie of the Year, AL: Francisco Liriano\n*Rookie of the Year, NL: Hanley Ramírez\n*Manager of the Year, AL: Jim Leyland\n*Manager of the Year, NL: Joe Girardi\n2007\n:See footnote\n*Most Valuable Player, AL: Alex Rodriguez\n*Most Valuable Player, NL: Matt Holliday\n*Cy Young, AL: CC Sabathia\n*Cy Young, NL: Jake Peavy\n*Rookie of the Year, AL: Dustin Pedroia\n*Rookie of the Year, NL: Ryan Braun\n*Manager of the Year, AL: Eric Wedge\n*Manager of the Year, NL: Clint Hurdle\n2008\n*Most Valuable Player, AL: Dustin Pedroia\n*Most Valuable Player, NL: Albert Pujols\n*Cy Young, AL: Cliff Lee\n*Cy Young, NL: Tim Lincecum\n*Rookie of the Year, AL: Evan Longoria\n*Rookie of the Year, NL: Geovany Soto\n*Manager of the Year, AL: Joe Maddon\n*Manager of the Year, NL: Lou Piniella\n2009\n:See footnotes\n*Most Valuable Player, AL: Joe Mauer\n*Most Valuable Player, NL: Albert Pujols\n*Cy Young, AL: Zack Greinke\n*Cy Young, NL: Tim Lincecum\n*Rookie of the Year, AL: Rick Porcello\n*Rookie of the Year, NL: Tommy Hanson\n*Manager of the Year, AL: Mike Scioscia\n*Manager of the Year, NL: Jim Tracy\n2010–2019\n2010\n:See footnotes\n*Most Valuable Player, AL: Josh Hamilton, Rangers\n*Most Valuable Player, NL: Joey Votto, Reds\n*Cy Young, AL: Félix Hernández, Mariners\n*Cy Young, NL: Roy Halladay, Phillies\n*Rookie of the Year, AL: Neftalí Feliz, Rangers\n*Rookie of the Year, NL: Buster Posey, Giants\n*Manager of the Year, AL: Ron Washington, Rangers\n*Manager of the Year, NL: Bud Black, Padres\n2011\n:See footnotes\n*Most Valuable Player, AL: José Bautista, Blue Jays\n*Most Valuable Player, NL:: Matt Kemp, Dodgers\n*Cy Young, AL: Justin Verlander, Tigers\n*Cy Young, NL: Clayton Kershaw, Dodgers\n*Rookie of the Year, AL: Michael Pineda, Mariners\n*Rookie of the Year, NL: Craig Kimbrel, Braves\n*Manager of the Year, AL: Joe Maddon, Rays\n*Manager of the Year, NL: Kirk Gibson, Diamondbacks\n2012\n:See footnotes\n*Most Valuable Player, AL: Mike Trout, Angels\n*Most Valuable Player, NL:: Buster Posey, Giants\n*Cy Young, AL: Justin Verlander, Tigers\n*Cy Young, NL: R. A. Dickey, Mets\n*Rookie of the Year, AL: Mike Trout, Angels\n*Rookie of the Year, NL: Bryce Harper, Nationals\n*Manager of the Year, AL: Buck Showalter, Orioles\n*Manager of the Year, NL: Davey Johnson, Nationals\n2013\n*Most Valuable Player, AL: Mike Trout, Angels\n*Most Valuable Player, NL: Andrew McCutchen, Pirates\n*Cy Young, AL: Max Scherzer, Tigers\n*Cy Young, NL: Clayton Kershaw, Dodgers\n*Rookie of the Year, AL: Wil Myers, Rays\n*Rookie of the Year, NL: Jose Fernández, Marlins\n*Manager of the Year, AL: John Farrell, Red Sox\n*Manager of the Year, NL: Clint Hurdle, Pirates\n2014\n:See footnote\n*Most Valuable Player, AL: Mike Trout, Angels\n*Most Valuable Player, NL: Clayton Kershaw, Dodgers\n*Pitcher of the Year, AL: Corey Kluber, Indians\n*Pitcher of the Year, NL: Clayton Kershaw, Dodgers\n*Rookie of the Year, AL: José Abreu, White Sox\n*Rookie of the Year, NL: Jacob deGrom, Mets\n*Manager of the Year, AL: Buck Showalter, Orioles\n*Manager of the Year, NL: Clint Hurdle, Pirates\n2015\n:See footnote\n*Most Valuable Player, AL: Josh Donaldson, Blue Jays\n*Most Valuable Player, NL: Bryce Harper, Nationals\n*Pitcher of the Year, AL: Dallas Keuchel, Astros\n*Pitcher of the Year, NL: Jake Arrieta, Cubs\n*Rookie of the Year, AL: Carlos Correa, Astros\n*Rookie of the Year, NL: Kris Bryant, Cubs\n*Manager of the Year, AL: A. J. Hinch, Astros\n*Manager of the Year, NL: Joe Maddon, Cubs\n2016\n:See footnote\n*Most Valuable Player, AL: Mike Trout, Angels\n*Most Valuable Player, NL: Kris Bryant, Cubs\n*Pitcher of the Year, AL: Justin Verlander, Tigers\n*Pitcher of the Year, NL: Max Scherzer, Nationals\n*Rookie of the Year, AL: Michael Fulmer, Tigers\n*Rookie of the Year, NL: Corey Seager, Dodgers\n*Manager of the Year, AL: Terry Francona, Indians\n*Manager of the Year, NL: Joe Maddon, Cubs\n2017\n:Was not held\nSee also\n*Baseball awards#U.S. major leagues: Awards by organizations other than MLB\n*List of MLB awards\n*Esurance MLB Awards (including Major Leaguer, Hitter, Pitcher, Defensive Player, Rookie, Manager)\n*Triple Crown (baseball)\n*MLB All-Century Team (1999)\n*MLB All-Time Team (1997; Baseball Writers' Association of America)\nFootnotes\nExternal links\n*[http://www.baseballprospectus.com/iba/index.php?mode=history Internet Baseball Awards]"
    }
  ]
}