{
  "content": [
    {
      "type": "text",
      "text": "# Bashar Warda\n\n| ordination = 8 May 1993\n| ordained_by = Patriarch Raphael I Bidawid\n| consecration = 3 July 2010\n| consecrated_by = Patriarch Emmanuel III Delly\n| cardinal =\n| created_cardinal_by =\n| rank =\n| birth_name =\n| birth_date =\n| birth_place = Baghdad, Iraq\n| death_date =\n| death_place =\n| buried =\n| nationality =\n| religion = Catholic Church\n| residence =\n| parents =\n| occupation =\n| profession =\n| previous_post =\n| education =\n| alma_mater =\n| motto =\n| signature =\n| signature_alt =\n| coat_of_arms =\n| coat_of_arms_alt =\n| other =\n}}\nBashar Matti Warda (; born 15 June 1969) is an Iraqi Chaldean Catholic cleric and the current Archbishop of Erbil (in the Kurdistan Region of Iraq).\nBiography\nBashar Matti Warda was born on 15 June 1969, in Baghdad. Warda joined the Saint Peter's Chaldean seminary in Baghdad and was ordained a priest in 1993. In 1995, he joined the Redemptorist order of Flanders in Belgium, and then was sent to Ireland to resume his novitiate. After receiving his master's degree in Moral Theology from the Catholic University of Louvain in 1999, he returned to Iraq. After returning to Iraq, Warda served as an assistant professor at Babel College in Baghdad. He took his perpetual vows for the Redemptorist Order in 2001. The following year, Warda was appointed parish priest of Mar Elia Church in Baghdad, where he established a primary school.\nWarda was apostolic administrator of the Diocese of Zaku from July 2011 until its merger with the Diocese of Amadiyah in June 2013.\nIn 2009, the Synod of Bishops of the Chaldean Catholic Church elected him Archbishop of the Archeparchy of Erbil. After Pope Benedict XVI gave his consent to this election in 2010 he was consecrated on 3 July of the same year.;\nOn 17 May 2017, he was received by His Royal Highness Charles, Prince of Wales in Clarence House, London.\nArchbishop Warda is well known for his wide-ranging defense and support for the Christians and minorities in Iraq. His efforts to support the continuing Christian presence in Iraq were widely noticed through many media interviews and speeches in different universities and councils worldwide, including Georgetown University 2018, CNA in 2018, Catholic Herald in 2020, BBC HARDtalk in 2022, Catholic New York Newspaper in 2022, The Tablet in 2022, and Prospect Magazine in 2017.\nOn 3 December 2019, he gave a speech in the UN Security Council Meeting in New York Concerning the Situation in Iraq during the protests of the Iraqi youth in October that year.\nIn November 2023, shortly after the beginning of the Gaza war, Archbishop Warda expressed his concern that the conflict could upset regional stability and further affect Christian communities. \"People [in Iraq] are really afraid that the violence will spread beyond Gaza. Speaking on behalf of all the people – especially the minorities, who tend to suffer more than others, especially in conflict situations – please God, no more war. We are asking all the leaders and all those who have influence to calm the situation. God forbid that this war goes beyond what we have been seeing of late. The settling of old scores would endanger the social cohesion in the whole region. The situation in Syria is not settled, nor has it settled in Iraq.”\nIn December 2024, Archbishop Warda expressed that the current situation in Syria remains \"quite vague,\" with no clear understanding of what the future holds for the country and its inhabitants. He emphasized the hope for a new constitution that would promote an inclusive society for all Syrians, including religious minorities.\nEducational projects\nThe Patriarch has been a strong advocate of education for Christians and for Iraqi citizens in general. In an interview with pontifical charity Aid to the Church in Need he said that \"Christians in Iraq have been facing many challenges since ISIS and before. They look to the Church to guide them and help build their future through pastoral work and building structures: we now have six churches, a seminary, some catechist centres, four schools, a university, and a hospital. The young are our future. Our mission is to give the youth hope and purpose in their lives in their homeland, nourishing their faith and providing them with skills that help them overcome the challenges they face.\nAmong his projects are the ACN-funded Pope Francis scholarships at the Catholic University in Erbil.\"The CUE model encourages the whole family to stay and not to emigrate; their children will have an excellent education to obtain work and therefore a future in Iraq to support themselves and their parents”, he said.\nIn an online conference hosted by pontifical charity Aid to the Church in Need, in July 2024, the archbishop said that the Church hoped to break the isolationist mentality prevalent in the region, by extending foreign aid to other communities. \"We shared some of that help with the Muslims and the Yezidis in the camps. After the defeat of ISIS, we established the Pope Francis Scholarship Programme, and we asked ACN if we could include Yezidis and Muslims in desperate need. It is my belief that we evangelise by sharing this goodness with the people, by showing them the gospel of solidarity. We let them breathe Christ through the works of kindness that we share with them.”\nFoundations and establishments\nKhaymat A-Athra primary School in Baghdad (2005)\nIn response to the bombing of Mar Elia Chaldean Catholic Parish in southern Baghdad on 1 August 2004, he built a primary school for the neighborhood to give a chance to the local community to strengthen their roots in their homeland, to live in social cohesion and mutual respect for social diversity, which he believes is a core value of any educational center.\nSt. Adday and St. Mari Patriarchal Complex in Erbil (2008)\nFollowing the violence against Christians and churches in Baghdad in 2004–2006, which made it very difficult for attending seminarians of the St. Peter seminary in Baghdad to resume their formation programs. Thus, being appointed by the Chaldean patriarch as the rector of the seminary, he founded the St. Aday and St. Mari complex in Ankawa to allow the seminarians to resume their spiritual, theological, and pastoral formation without interruption.\nMar Qardakh International School (2011)\nArchbishop Warda introduced the international educational system in the Kurdistan Region of Iraq through founding Mar Qardakh School, which educates children from grades 1–12 in the English language, to grant them the International Baccalaureate (IB) which became recognized as a fully accredited IB-Program school in 2015.\nCatholic University in Erbil (2016)\nFollowing huge efforts with many stakeholders and officials, Archbishop Warda founded the Catholic University in Erbil, and was officially opened on 8 December 2015.\nAnkawa Humanitarian Committee - AHC (2020)\nIn early 2020, Archbishop Warda founded the Ankawa Humanitarian Committee (AHC), a Non-governmental organization that works on the fundamental challenges of humanitarian and development facing the long-suffering communities in Iraq; including economic poverty, education, women's empowerment, social cohesion, environmental awareness, and the promotion of full rights for all as equal citizens of Iraq. The AHC received support from USAID, with a notable project that included a budget of $2.5 million to enhance its capacity to deliver relief services for internally displaced persons in Iraq. Warda is also the head of Board of Directors of the NGO, where he closely monitor the implementation of the humanitarian and developmental projects in the different areas.\nMaryamana Hospital (2021)\nHe founded the Maryamana Hospital in 2021, which is a Catholic community based hospital that was established with the sole purpose to provide healthcare in a Catholic spirit of equality and interfaith, serving all, the poor, the vulnerable, and those without a voice. He is also the head of the Board of Trustees of the non-profit organization that aims to lead the improvement of healthcare throughout Kurdistan and Iraq.\nAdvocating for H.R. 390\nIn collective efforts toward recognizing the persecution of religious minorities, Archbishop Warda worked with the Knights of Columbus since 2015 to collect witnesses and evidence to declare attack of ISIS against Christians and Yazidis in Iraq and Syria as an act of genocide and crime against humanity. The resolution was put into law on Tuesday, 11 December 2018, as he presented at the white house during the signing of law [https://www.congress.gov/bill/115th-congress/house-bill/390 H.R. 390], the “Iraq and Syria Genocide Relief and Accountability Act of 2018,” that allowed direct assistance to communities in Iraq or Syria. This law was signed by the President of the United States of America, Donald J. Trump.\nControversies\nThe Chaldean Catholic Church deals with significant internal tensions, which reached a peak in July 2024, while five bishops, led by Archbishop Bashar Warda, boycotted the mandatory Chaldean Church Synod. They also withdrew from an August spiritual retreat and pulled their students from the Chaldean Seminary, which Louis Sako described as a \"serious breach\" of ecclesial unity. Cardinal Sako issued an ultimatum on August 28, 2024, demanding a public apology from the five bishops by September 5. The bishops refused, citing dissatisfaction with Sako's leadership style and unilateral decision-making. As a result, Sako threatened canonical sanctions, including excommunication.\nThe dynamics between Cardinal Sako and Archbishop Warda are marked by a deepening rift. Sako views Warda as politically ambitious, positioning himself as a successor to the Patriarchate. This perception has contributed to Sako's decision to delay his retirement despite previously announcing plans to step down at 75.\nCardinal Louis Sako accused Archbishop Bashar Warda for collaborating and conspiring with Rayan al-Kildani - leader of the controversial Babylon Movement - to undermine his authority, including encouraging his resignation following the Iraqi president's withdrawal of a decree recognizing Sako's status as head of the Chaldean Church.\nBashar Warda, Rayan al-Kildani and the Babylon Movement are entwined in a highly controversial relationship. The Babylon Movement, led by al-Kildani, is notorious for severe human rights abuses - looting homes, illegal land seizures, intimidation, extortion, harassment of women, persecution of religious minorities, and torture of detainees. A particularly disturbing video shows al-Kildani cutting off the ear of a handcuffed detainee, underscoring the brutality associated with his leadership. In spite of these atrocious acts, Warda remains a supporter of the Babylon Movement and is being described by Sako as its Godfather. Al-Kildani has been sanctioned by the U.S. for these actions, with restrictions on his access to international financial systems and penalties imposed on entities that engage with him, placing Warda and his close relationship with al-Kildani under a dark cloud of scrutiny.\nBashar Warda faces criticism for his silence on Rayan al-Kildani's actions and failure to support Patriarch Louis Sako's efforts against the Babylon Movement's encroachment on Christian assets. It has led to accusations that Warda prioritizes the benefits that he receives from al-Kildani's support over the protection of church interests, raising concerns about his commitment to the Christian community he represents.\nGallery\nFile:Bashar Warda 2015 (15811240534) cropped.jpg|Bishop Warda in 2015\nFile:Bishops Malvestiti and Warda.jpg|Bishop Maurizio Malvestiti (left) with Bishop Warda (right) during Pentecost all-night vigil in the cathedral of Lodi, 14 May 2016\nFile:BISHOP warda bechara in lodi 2016.jpg|Bishop Warda during Pentecost all-night vigil in the cathedral of Lodi, 14 May 2016\nFile:President Donald J. Trump Signs H.R. 390-Iraq and Syria Genocide Relief and Accountability Act (45565831264).jpg|Archbishop Bashar Warda's participation in the signing of the H.R. 390 in the White house in 2018 representing Iraqi Christians.\nReferences\nExternal links\n* [http://www.catholic-hierarchy.org/bishop/bwarda.html Archbishop Bashar Warda], Catholic Hierarchy"
    }
  ]
}