{
  "content": [
    {
      "type": "text",
      "text": "# Batman: Return of the Caped Crusaders\n\n| based_on =\n| producer =\n| starring =\n* Burt Ward\n* Julie Newmar\n}}\n| editing = Christopher D. Lozinski\n| music =\n| studio =\n| distributor = Warner Bros. Pictures\n| released = |2016|10|10|United States|ref2=}}\n| runtime = 78 minutes\n| country = United States\n| language = English\n| budget =\n| gross = $57,343\n}}\nBatman: Return of the Caped Crusaders is a 2016 American animated superhero film produced by Warner Bros. Animation and distributed by Warner Bros. Pictures. Based on the 1960s Batman TV series, the film stars the voices of Adam West, Burt Ward, and Julie Newmar reprising their roles of Batman, Robin, and Catwoman from the series. In the film, Batman and Robin set out to defeat the Joker, the Penguin, the Riddler, and Catwoman, who have teamed up. Matters are further complicated when Batman gradually becomes more hostile.\nOriginally intended to be released directly on home media, the film premiered at the New York Comic Con on October 6, 2016, and had a simultaneous release in theaters on October 10, a digital release on October 11, and a physical home media release on DVD and Blu-ray on November 1.\nA sequel entitled Batman vs. Two-Face was released on October 10, 2017, four months after Adam West's death.\nPlot\nAt Wayne Manor, Bruce Wayne and Dick Grayson watch their favorite show, Gotham Palace. During the programming, a band that was supposed to play on the show is revealed to be hidden and replaced by the Joker, the Penguin, the Riddler, and Catwoman. Bruce and Dick suit up as Batman and Robin and head to the Gotham City Police Department, where they receive a riddle from Commissioner Gordon and Chief O'Hara.\nThey discover that the villains are robbing the Acme Atomic Energy Laboratory of the Replication Ray, which can duplicate anything. After a brief fight, the criminals manage to escape Batman, but leave behind a clue that leads Batman and Robin to their lair in an abandoned TV dinner factory. While discussing what to do with the Replication Ray, Catwoman reveals her plan to make Batman join their side with a scratch from a substance called \"Batnip\". After Batman and Robin break in, they are defeated by the criminals and trapped on a frozen food tray heading towards a large oven. Catwoman uses her Batnip on Batman, but he is seemingly unaffected by it. The two escape the trap after the villains leave the factory.\nBack at Wayne Manor, Bruce starts showing signs of aggression after Harriet Cooper nearly discovers the Batcave. He blames Alfred Pennyworth for the incident and fires him, leaving the butler to wander on the streets homeless. After days of not finding Joker, Penguin, Riddler, and Catwoman, Batman deduces that the four are no longer on Earth and have hijacked a space station. He and Robin go into space with the help of their Bat-Rocket. At the space station, Joker, Penguin, and Riddler betray Catwoman, distrusting her due to her feelings for Batman. They try to throw her out into space, but she is rescued by Batman and Robin and aids them in defeating her former allies for revenge. Batman savagely beats the three men and recovers the Replication Ray, but Catwoman escapes in an escape pod in the process.\nAfter the mission, Dick expresses concern towards Bruce's increasingly hostile behavior. Bruce ejects Dick from the manor and takes a break from being Batman, resulting in a crime spree in Gotham City. A few weeks later, Batman returns to the Gotham City Police Department and blames the police for the increase in crime. He uses the Replication Ray on himself to replace most of the jobs, citizens, and political figures in Gotham with his replicas, planning to take over the world. Dick, realizing that the Batnip had a delayed effect on Batman, goes to Catwoman's lair as Robin to request her help in curing Batman. She agrees, as the effects of the Batnip were more severe than she had planned.\nThe two take the Catmobile to the Batcave, where Catwoman attempts to give Batman the antidote. Having anticipated this, Batman reveals that he took the Bat Anti-Antidote, nullifying Catwoman's antidote. Batman defeats the two in a fight and leaves them to die in the Atomic Pile, but they survive thanks to Robin's Bat Anti-Isotope Spray. Knowing they cannot take on an army of Batmen by themselves, Robin and Catwoman disguise themselves as prison inspectors and break most of Batman's rogues gallery from Gotham State Penitentiary by claiming to Warden Crichton that the ball and chains and pickaxes are not in good shape, replacing them with versions that carry the villains out of the prison. While a prison guard tells Crichton that Joker, Penguin, and Riddler did not escape, the three of them mysteriously turn into a pile of dust.\nThe two confront Batman and his army on the Gotham Palace set, but they still lose even with the help of the criminals. Before Batman is able to kill Robin and Catwoman, a disguised Alfred arrives and gives Batman a celebratory bottle of champagne laced with a strong enough antidote to counter the Bat Anti-Antidote. Batman returns to normal, and his clones turn to dust as the Replication Ray was not strong enough to make perfect clones. Batman and Robin then realize that Joker, Penguin, and Riddler tricked them by having them arrest copies of them while the real ones have been robbing the city blind, using Batman's behavior change as a distraction from their crime spree, knowing the Batnip would work as they spiked it with Joker's Laughing Gas formula to make it more potent. After catching them robbing the Gotham Art Museum, Batman, Robin, and Catwoman chase them to Penguin's blimp, where the villainous trio are defeated after getting knocked off the blimp and falling to a safe location to be arrested. Catwoman tries to escape with the stolen loot, but Batman stops her. Unwilling to be imprisoned, Catwoman allows herself to fall into a smokestack.\nBruce and Dick then throw Harriet a surprise birthday party, acting as if that is the secret they have been hiding from her. During the party, Bruce and Dick are called away by the Bat-Signal.\nCast\n* Adam West as Bruce Wayne / Batman\n* Burt Ward as Dick Grayson / Robin\n* Julie Newmar as Catwoman\n* Jeff Bergman as Joker, Announcer\n* William Salyers as Penguin\n* Wally Wingert as Riddler\n* Jim Ward as Commissioner James Gordon\n* Steven Weber as Alfred Pennyworth\n* Thomas Lennon as Chief O'Hara, Warden Crichton\n* Lynne Marie Stewart as Aunt Harriet Cooper\n* Sirena Irwin as Miranda Moore\nProduction\nWest and Ward announced at the Mad Monster Party one or two animated films based on the 1960s Batman TV series, starting with Batman: Return of the Caped Crusaders. West, Ward, and Newmar provided the voices of their characters for the series' 50th anniversary. West jokingly remarked that it took him \"about twenty seconds\" to get back into character.\nRelease\nWarner Home Video hosted the world premiere of Batman: Return of the Caped Crusaders during the 2016 New York Comic Con on October 6. The film was later released digitally on October 11, while the deluxe edition DVD and combo pack Blu-ray of the film was released on November 1. Fathom Events cinemas released the film in select theaters for one night only on October 10. It also received a limited release in Australia on October 8 and 9 the same year.\nThe film was released on DVD and Blu-ray in Australia on November 28.\nCritical reception\nOn review aggregator Rotten Tomatoes, the film has an approval rating of , based on  reviews, with an average rating of . The site's critics' consensus reads: \"Adam West's groovy interpretation of The Caped Crusader returns in a new medium, popping in the realm of animation with the irascible energy of an exclamation-accented onomatopoeia\".\nDave Robinson of outlet Crash Landed awarded the film 3 stars out of 5, citing its success in capturing the iconic '60s television show but failing to be of the cinematic quality expected of an animated feature film.\nScott Mendelson of Forbes gave the film a score of 7/10, writing: \"I wish the film dove a little deeper into its subtext... but what's there is enjoyable and entertaining\". Michelle Jaworski of The Daily Dot wrote that the film was \"not a continuation of the TV series that first brought Batman to our screens 50 years ago (nor the DC series, which occurs in the same universe), but it embodies the spirit that made the series so endearing over the years\". Renee Schonfeld of Common Sense Media gave the film 3/5 stars: \"The campy, dynamic, and oh-so-self-aware Batman of 1960s TV has returned to delight old fans and inspire new ones with Adam West and Burt Ward along for the fast-moving ride\".\nRevenue\nThe film debuted at No. 17 on the NPD VideoScan First Alert sales chart and No. 11 on the Blu-ray Disc sales chart in its first week. As of August 2025, it has earned over $1.7 million from domestic home video sales.\nSequel and spin-off\nBatman vs. Two-Face (2017)\nA sequel, titled Batman vs. Two-Face, was released in 2017 with William Shatner voicing Two-Face as the main antagonist. Burt Ward and Julie Newmar reprised their roles as Robin and Catwoman. On June 9, Adam West died from leukemia. According to Bleeding Cool, West and Shatner recorded their lines separately, with West finishing his lines by October 2016.\nPossible Wonder Woman spin-off\nAfter the success of Batman: Return of the Caped Crusaders, Warner Bros. stated that they considered to make an animated film based on Wonder Woman, with Lynda Carter reprising her role as Wonder Woman.\nReferences\nExternal links\n*\n*\n*\n* [http://www.worldsfinestonline.com/WF/dcam/batman66/capedcrusaders/ Batman: Return of the Caped Crusaders] at The World's Finest"
    }
  ]
}