{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Sphacteria (1825)\n\n| result            = Egyptian victory\n| combatant1        =  First Hellenic Republic\n| combatant2        =  Egypt Eyalet\n| commander1        = Anastasios TsamadosAnagnostarasAlexandros Mavrokordatos\n| commander2        = Ibrahim Pasha of Egypt\n| strength1         = 1,0008 ships\n| strength2         = 3,000~45 ships\n| casualties1       = 350 dead\n| casualties2       = Unknown\n}}\nThe Battle of Sphacteria took place during the Greek War of Independence on 8 May 1825 in Sphacteria between the Egyptian forces of Ibrahim Pasha and Greek forces led by Captain Anastasios Tsamados along with Alexandros Mavrokordatos.\nBattle\nCommanding both a powerful army and navy, Ibrahim initiated attacks on both Paliokastro and the island of Sphacteria. As a result, Mavrocordatos rushed to their defense while Captain Tsamados from Hydra held off Ibrahim's forces.\nIbrahim aimed to capture the strategic small island of Sfaktiria at the center of the bay. Fifteen hundred Egyptians landed on the island only to be met with resistance by Tsamados who led a small contingent of sailors and soldiers. Shot in the leg, Tsamados continued fighting until he was killed. During the battle Santorre di Santa Rosa was also killed.\nThe remaining Greek sailors with Mavrocordatos rushed back to their ship, the Aris, and sailed through a bombardment of thirty-four ships. For four hours it was bombarded and the casualties entailed two dead along with eight wounded. Finally, the Greek fleet and the Greek brig Aris escaped the destruction after hours of fighting and bombardment.\nAftermath\nDays after the battle, the Greeks surrendered Neokastro to Ibrahim.\nIn a desperate action, admiral Miaoulis decided to attack and burn the Egyptian fleet at Methoni. Finally, using fire ships, he succeeded to destroy 12 ships (including a corvette and a frigate), but it had no impact on Ibrahim, who now had the mainland base he wanted.\nReferences\nSources\n* Smith, William and Felton, Cornelius Conway. A History of Greece: From the Earliest Times to the Roman Conquest, with Supplementary Chapters on the History of Literature and Art. Hickling, Swan, and Brown, 1855.\n*Paparigopoulos, K, History of the Greek Nation (Greek edition), vol. 6, p. 163-164"
    }
  ]
}