{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Lenzen\n\nThe Battle of Lenzen was a land battle between a Saxon army of the Kingdom of Germany and the armies of the Slavic Redarii and Linonen peoples, that took place on 4 September 929 near the fortified Linonen stronghold of Lenzen in Brandenburg, Germany. The Saxon army, commanded by Saxon magnate Bernhard, destroyed a Slavic Redarii army. It marked the failure of Slavic attempts to resist German king Henry the Fowler's expansionism to the Elbe.\nThe Saxons had been laying siege to Lenzen, a Slavic fortress, since 30 August. On 3 September the Saxon mounted scouts alerted Bernhard to the presence of a Redarii army nearby. The next day, the Redarii formed up in an infantry phalanx opposite the Saxons, who did likewise.\nBernhard's cavalry feigned retreat to draw out the Redarii, who had no cavalry units of their own, but the wet terrain prevented effective maneuvering. The Saxons launched infantry assaults, with heavy casualties for both sides in the drawn-out combat that went on for the rest of the day. Ultimately, the Saxon cavalry under the command of Count Thietmar of Merseburg was able to outflank the Redarii formation and charge upon them, routing them. The Saxons gave pursuit to completely destroy their opponents, slaughtering the fleeing Redarii en masse. The garrison of Lenzen surrendered the next morning.\nThe German victory at Lenzen was total, resulting in the suppression of effective Slavic resistance to German rule along the Elbe for the rest of Henry's reign. Sources for the battle include the Deeds of the Saxons by Widukind of Corvey and Chronicon Thietmari by Thietmar of Merseburg.\nBackground\nIn the winter of 928, Henry I marched against the Slavic Hevelli tribes, intent on seizing their capital of Brandenburg, located along the Havel. The Hevelli were allied to the Bohemians, who in turn had permitted military access through their territory for the Magyars when they launched failed raids on the German duchies of Thuringia and Saxony in 924. The conquest of the Hevelli was part of a larger campaign against Bohemia on Henry's part. At the strategic level, Henry's eastern campaign was designed to construct a defensive system of fortresses in the east to defeat further raids on the German kingdom. The Hevelli were worn down in numerous small engagements, after which Henry besieged and captured Brandenburg by storm.\nHe then invaded the Dalaminzi Glomacze lands on the middle Elbe river, conquering the capital Gana after a siege, exterminating the garrison and distributing the women and the children as slaves to his soldiers. In 929, as Arnulf of Bavaria invaded Bohemia from the south, Henry invaded Bohemia from the north and marched on Prague. The appearance of the entire royal army of 15,000 men in May caused Duke Wenceslaus I to give up and resume the yearly payment of tribute to the king.\nTo reinforce their conquests, the Germans quickly built up an extensive system of fortifications between the Saale and the Elbe, including a fortress at Meissen, facing little resistance from the Sorbs. By comparison, when Henry I attempted to impose tribute upon the Veleti, the result was war. In late July or early August 929 the Redarii, a German tributary and a sub-group of the northern Veleti, rebelled and captured by storm the strategically important German fortress of Walsleben, massacring the garrison and the civilian population.\nThe Redarii success convinced other Slavic peoples between the Elbe and Oder rivers to rise up in revolt, threatening both the payment of tribute Henry had imposed on the Slavs and the fortifications by which the Germans dominated the region.\nPrelude\nResponding to the capture of Walsleben, Henry followed established practice by deciding to seize a fortification in enemy territory to shore up his own position. Henry had access to military intelligence about the number of fortifications (civitate) possessed by each Slav polity on the eastern German frontier. The Lenzen stronghold on eastern bank of the Elbe was a major operating base for the Slavs, facilitating their attacks to Saxony across the Elbe. Henry ordered the assembly of an expeditionary army of Saxons under the command of the Saxon magnate, Count Bernhard, who was also responsible for maintaining relations with the Redarii.\nCount Thietmar served as Bernhard's collega and commander of cavalry. They were joined by other counts and nobles, each with their own military households of trained cavalry and infantrymen. The majority of the Saxon army was made of the select levy, whose equipment and training were suited to fighting in an infantry phalanx.\nOnce mobilized, the Saxon army marched on Lenzen in late August and after arriving at the fortress on 30 August, followed the Roman tradition of Vegetius by establishing a fortified encampment and posting guards and a reconnaissance screen of cavalrymen. The Saxons were prepared for a long siege, with substantial supplies including tents.\nOn 3 September, Bernhard's scouts alerted him to the presence nearby of a major Slav force, who were planning to launch a night attack on the Saxons. After further reconnoitering of the Slav force to confirm the accuracy of the initial report, Bernhard raised the alertness of his camp that night to prepare for the expected Slavic attack.\nBattle\nOn 4 September the Redarii deployed in an infantry phalanx, facing the Saxon camp. Bernhard formed up his own phalanx, but did not attack immediately, instead attempting a feigned retreat with his cavalrymen to draw out the Redarii. However, the ground was too wet and the maneuver failed. Bernhard then launched infantry attacks on the Redarii phalanx, who successfully stood their ground. The Saxon cavalry were held in reserve under the command of Count Thietmar, protecting the army's flanks from a sortie by the Lenzen garrison or an unexpected Slav force. The fighting went on all day, with heavy losses for both sides.\nFinally, the Saxon cavalry were able to outflank and charge upon the Redarii, disrupting their formation. The Slavs panicked, broke ranks and fled. The deadliest phase of the battle ensued for the fleeing Redarii, with the Saxon cavalry cutting them down en masse in the fields or driving them into a nearby lake and causing them to drown.\nAftermath\nThe Slavic army was completely wiped out and the Saxons celebrated their victory later that day in the camp. The next morning, the Lenzen garrison surrendered the fortress. The Redarii's lack of cavalry was an important factor in their defeat, providing them with no effective flank protection or capacity to threaten in turn the flanks of the Saxon infantry phalanx. The Saxon levy infantry showed their combat effectiveness in a field battle, not only in sieges, by maintaining formation during the heavy fighting.\nThe German victory at Lenzen was total, with no serious Slavic resistance against German rule along the Elbe for the rest of Henry's reign. After the battle, the Lusatians and the Ukrani on the lower Oder were subdued and made tributaries in 932 and 934, respectively. The Ukrani, however, continued their attacks on the Northern March, until their defeat in 954 by Gero, Margrave of the Saxon Eastern March.\nWidukind and Thietmar of Merseburg both wrote of the battle, with Thietmar losing two great-grandfathers, both named Lothar (one the Count of Walbeck, the other the Count of Stade), in the battle.\nReferences\nNotes\nBibliography\n*Bachrach, B. S. (translator), Widukind of Corvey, Deeds of the Saxons, The Catholic University of America Press, Washington, DC, 2004\n*Bachrach, Bernard S., and Bachrach, David, Early Saxon Frontier Warfare, Journal of Medieval Military History, Volume 10, Boydell  Press, 2012\n*\n*\n*Bury, J. B. (editor), The Cambridge Medieval History: Volume III, Germany and the Western Empire, Cambridge University Press, 1922\n*Leyser, Karl. Medieval Germany and Its Neighbours 900–1250 (1st ed.), The Hambledon Press, London 1982\n*Warner, David A. (translator), Ottonian Germany:  The Chronicon of Thiemar of Merseburg, Manchester University Press, Manchester 2001"
    }
  ]
}