{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Ballaghmoon\n\n|map_type=Ireland County Kildare#Island of Ireland\n|result= Allied victory\n|combatant1= Kingdom of Meath Kingdom of Leinster Kingdom of Connacht Kingdom of Osraige\n|combatant2= Kingdom of Munster\n|commander1= Flann SinnaCerball mac MuirecáinCathal mac ConchobairCellach mac Cerbaill\n|commander2= Cormac mac Cuilennáin\n|strength1=\n1 billion\n|strength2=\nUnknown\n|casualties1=\nUnknown\n|casualties2=\nUnknown\n}}\nThe Battle of Ballaghmoon () took place on 13 September 908 at Ballaghmoon, near Castledermot in the south of modern County Kildare. It pitted the forces of Cormac mac Cuilennáin, king of Munster against an alliance comprising the forces of Flann Sinna, High King of Ireland, Cerball mac Muirecáin, king of Leinster, Cathal mac Conchobair, king of Connacht, and Cellach mac Cerbaill, king of Osraige. It ended in a decisive victory for the alliance led by Flann Sinna.\nThe Conflict arose after Cormac mac Cuilennáin assembled an army to campaign against his eastern neighbour, Leinster, whose king Cerball mac Muirecáin was Flann Sinna's son-in-law and staunch ally. After this hostile act Flann in an alliance with Cathal mac Conchobair, king of Connacht, led an army into Leinster in order to help his son-in-law. Despite the men of Munster being outnumbered and peace talks being held between both sides, Cormac refused to surrender, it ultimately proved to be his undoing, he and Cellach mac Cerbaill were killed during the course of the battle.\nBackground\nThe war started when Cormac mac Cuilennáin and an adviser Flaithbertach mac Inmainén assembled an army to campaign against their eastern neighbours, Leinster, whose king Cerball mac Muirecáin was Flann Sinna's son-in-law and staunch ally. The Fragmentary Annals of Ireland, a source compiled in the 11th century for Donnchad mac Gilla Pátraic, king of Osraige, and king of Leinster, contain a long account of these events, perhaps written within living memory.\nBefore the battle many men had deserted Cormac, because while riding through the camp Flaithbertach's horse stumbled and threw him to the ground. This, it is said, was taken to be a very bad omen. Many of the Munstermen were unwilling to fight, and news of this came to Cerball mac Muirecáin, who proposed a negotiated settlement. The Leinstermen would pay tribute, and give hostages, but the hostages would be given to Móenachm abbot of Diseart Díarmata (Castledermot, modern County Kildare), rather than to the Munstermen. Cormac, it is said, was willing to accept this settlement, but Flaithbertach—Byrne refers to him as \"Cormac's evil genius\"— was not and persuaded Cormac to fight, in spite of the king's conviction that he would be killed.\nBattle\nAlready with a distinct numerical disadvantage the Fragmentary Annals say that \"the men of Munster came to the battle weak and in disorder\" and they quickly broke and fled the field. Many were killed. Cormac was among them, after his neck was broken from falling off his horse while fleeing with his men, Flaithbertach his adviser was captured.\nCormac was beheaded and his head taken to Flann Sinna. The Fragmentary Annals say:\"That is indeed evil,\" said Flann to them, and it was not thanks that he gave them. \"It was an evil deed,\" he said, \"to cut off the holy bishop's head; I shall honour it, and not crush it.\" Flann took the head in his hands, and kissed it, and he carried the consecrated head and the true martyr around him three times.\nAftermath\nAfter the battle, Cormac was considered a saint, his death left Munster without its own king until about 914 when Flaithbertach mac Inmainén was chosen.\nThe contemporary poet Dallán mac Móre created the following poem which laments those killed, it has been preserved in Annals of the Four Masters:\nCormac of Feimhin, Fogartach,\nColman, Ceallach of the hard conflicts,\nthey perished with many thousands\nin the great battle of Bealach-Mughna.\nFlann of Teamhair, of the plain of Tailltin,\nCearbhall of Carman without fail,\nOn the seventh of the Calends of September,\ngained the battle of which hundreds were joyful.\nThe bishop, the souls' director,\nthe renowned, illustrious doctor,\nKing of Caiseal, King of Iarmumha;\nO God! alas for Cormac!\nCitations\nSources\n*\n*\n*"
    }
  ]
}