{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Kirkuk (2015)\n\nBattle of Kirkuk}}\n)\n| place             = Kirkuk, Kirkuk Governorate, Iraq\n| result            = * Kurdish victory\n* Kurds defend Kirkuk\n* Last major ISIL offensive on Kirkuk\n* Start of the Kirkuk counteroffensive by Kurdish forces\n| combatant1        =    Kurdistan Workers' Party   CJTF–OIR (air support)\n| combatant2        =  Islamic State of Iraq and the Levant   Islamist Insurgents\n| commander1        =  Masoud Barzani(President of Iraqi Kurdistan)  Maj. Gen. Hussein Mansour(Commander in Kirkuk)  Brig. Gen. Sherko Fatih Shwani   Brig. Rasoul Qadi\n| commander2        =  Abu Khalid Al Ansari\n| units1            = * Peshmerga\n**  1st Support Forces\n**  2nd Support Forces\n** 1st Brigade\n** 17th Brigade\n*  People's Defence Forces\n*  Counter-Terrorism Group\n*  Federal Police\n* Local gunmen\n* Local security forces\n| units2            =  Military of the Islamic State\n| strength1         =  4,000+\n| strength2         =  450-700   4 Inghimasi\n| casualties1       =  ~30 killed and 173 wounded\n| casualties2       =  ~108-253-400 killed and 140 wounded  +20 vehicles destroyed 4 Inghimasi killed\n| image_size        = 300px\n}}\nIn the Battle of Kirkuk (2015) the Islamic State of Iraq and the Levant (ISIL) launched its biggest and last offensive against Kirkuk, Iraq, which at the time was guarded by a coalition of Kurdish forces including Peshmerga soldiers and fighters of the Kurdistan Workers' Party (PKK).\nBackground\nIn the previous year, a series of ISIL offensives culminated in the Battle of Kirkuk (2014), which resulted in a Kurdish victory after Peshmerga forces entered and defended the city following the withdrawal of the Iraqi Army.\nThe Battle\n29 January\nOn the night of January 29, 2015, around 150 ISIL fighters attacked positions south and west of the city of Kirkuk, which were under the control of the Peshmerga. The ISIL offensive began under the cover of dense fog and heavy rain, and succeeded in overwhelming Peshmerga positions and seizing the towns of Mala Abdullah, Maryam Beg, Tel al-Ward and the Maktab Khalid crossing. Tel al-Ward was previously defended on three occasions during the Battle of Kirkuk (2014) and offered a strategic view over the city. Parts of the Khabbaz oil fields, which were being administered by North Oil Co, were also captured and 24 workers were taken hostage.\nCoalition aircraft were not able to provide close air support in Kirkuk due to the difficult weather conditions. However in Hawija, coalition air strikes managed to destroy a ISIL convoy of 20 vehicles, which was on route to Kirkuk.\n30 January\nOn 30 January, ISIL used a combination of truck bombs, rockets, Humvees and Tanks, which were left behind by the fleeing Iraqi army, in its attacks. A few villages were temporarily lost during the fighting, and at least 25 Peshmerga fighters died including Brig. Gen. Sherko Shwani, commander of the 1st Brigade and the highest ranking head of Peshmerga forces in Kirkuk, while 46 more were wounded. Shwani was killed after being trapped and shot by attackers, according to a Peshmerga commander. Around 16 other Peshmerga fighters were captured by ISIL, and later killed in a staged execution. The Kurdish forces themselves managed to kill around 30 ISIL fighers on that day.\nConcurrently, on Friday four 'insurgents' took control of the empty Kirkuk Palace (Qasr Kirkuk) Hotel, in downtown Kirkuk. A car bomb detonated outside the hotel before insurgents stormed the building. Local security forces and federal police managed to secure the building after the ensuing firefight. A number of informal local fighters also took up arms to defend the city. The bodies of these insurgents were then dragged through the streets of Kurdish neighborhoods in Kirkuk.\nGerman geographer and orientalist Prof. Günter Meyer stated on the same day that \"the Islamic State knows very well that it cannot succeed in capturing a predominantly Kurdish major city [Kirkuk].”\n31 January\nOn 31 January, Peshmerga soldiers, special forces of the elite Counter-Terrorism Group (CTG) and PKK fighters, with the support of coalition air strikes, staged a counter-assault to retake the villages they had lost. During the counterattack, Gen. Hussein Mansour, commander of the 2nd Support Forces, was killed by sniper fire, while leading a fight near Mala Abdullah village. The Peshmerga reported recovering 15 bodies of ISIL fighters left behind after the battle at Mala Abdullah village. On the same day the Khabbaz oil fields were recaptured by Peshmerga troops, and Brig. Rasoul Qadir announced that the hostages were freed. However ISIL fighters set fire to some of the oil wells before the area was cleared. In the operation to retake the oil fields alone, 40 ISIL fighters were reported killed.\nBy the conclusion of the counter-assault on 31 January, more than 400 ISIL fighters were reported killed, while the remainder retreated to the town of Hawija, which at the time remained an ISIL stronghold. According to a doctor at Kirkuk’s Azadi General Hospital, 220 ISIL bodies were received at the morgue.\nA officer within the CTG stated, “More than 700 foreign and local ISIS fighters took part in the attack, following the personal orders of [ISIS leader Abu Bakr] al-Baghdadi to capture Kirkuk.”\n1 February\nOn February 1, the PUK Asayish, stated that they raided a home in southern Kirkuk. The forces clashed with ISIS members killing five of them while two Asayish members were killed.\nAftermath\nAnalysts described the battle as a turning point for ISIS, as the group was unable to capture Kirkuk despite repeated offensives.\nFollowing ISIL's defeat, Peshmerga forces in the Kirkuk region started their first major counteroffensive.\nOn March 8, 2015, Peshmerga forces, backed by coalition air support, liberated all the villages surrounding Kirkuk city. 22 villages near the Daquq and Taza sub-districts were liberated, and the offensive also cleared the Kirkuk-Baghdad road, where ISIL previously held positions only 200 meters away from the main road. By August 2015, Peshmerga soldiers and PKK fighters liberated another 11 villages south of Daquq, cutting off the supply lines from Hawija to ISIL fighters.\nIn 2016, a raid by ISIL sleeper cells would culminate into the 3rd Battle of Kirkuk during the Iraqi War (2013-2017).\nReferences"
    }
  ]
}