{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Vavunathivu\n\n|casualties2=103 killed (LTTE claim) 160 killed (SLA claim)\n|notes=\n}}\nThe Battle of Vavunathivu took place during the Sri Lankan Civil War. It occurred on 7 March 1997 in which the LTTE militants attacked and overran the Sri Lanka Army military camp at Vavunathivu off Batticaloa.\nBackground\nThe Sri Lanka Army maintained a military camp at the Vavunathivu junction to protect the access road to the town of Batticaloa, located on the island of Puliyantivu were the old Batticaloa fort, the Kachcheri, and the Brigade Headquarters of the 3rd Brigade. In early 1997, the LTTE increased its presence around Batticaloa and in the Eastern Province. In January the Mavadivembu camp between Chenkaladi and Valaichenai was attacked and overrun. Few days prior the LTTE began detaining vehicles going to Paduvankarai and the Ministry of Defence instructed all military positions in the district to be on full alert.\nThe attack\nThe camp detachment at the time of the attack consisted of about 250 personnel drawn from the 6th battalion, Gajaba Regiment (commanding officer, Lieutenant Colonel Kamal Gunaratne) and the Sri Lanka National Guard with Captain Sudath Dabare serving as officer commanding. They lacked any heavy weapons or armor. A large force of around 500 LTTE militants attacked in the early hours of 7 March taking control of the western half of the Valaiyiravu bridge and all defensive bunkers approach path from Vavunathivu junction. The military camp was located 150m from the approach road and the soldiers withdrew before the bridge was blown up. The camp was under heavy shelling from 81mm mortars and a 85 mm field artillery gun which the LTTE had captured during the Battle of Pulukunawa. The LTTE used suicide cadres to attack the defense parameter of the camp in waves and managed to breach it by mid day and the LTTE militants entered the camp. The defending troops withdrew to secondary defense positions and continued fighting as some these positions and buildings in the camp fell. Captain Dabare, wounded in both eyes rallied the defense and launched a counter attack with the remaining troops. He was able to hold out until reinforcement under Major Saman Wedagama reaching the besieged camp by boat with the support of Mi-24 helicopter gunships the next day and the LTTE withdrew. Reinforcements from the brigade headquarters had been delayed as the LTTE shelled it with 81mm mortars on the Buffalo island and by a Black Tigers infiltration of the SLAF China Bay which left a Harbin Y-12 destroyed.\nAftermath\nMuch of the camp was destroyed by the LTTE who removed weapons and ammunition they found in it. The army claimed that it had sustained 73 killed (including 2 officers), 98 wounded and 2 missing; while 160 militants were killed. The LTTE claimed it had lost 103 carders. It was claimed that the LTTE had executed an officer and seventeen soldiers they had captured when the camp fell. Captain Sudath Dabare was awarded the Weera Wickrama Vibhushanaya in late March 1997.\nSee also\n* List of Sri Lankan Civil War battles\n* Vavunathivu\n* Batticaloa District\nReferences"
    }
  ]
}