{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Ronaldsway__disambig_1\n\n|strength2=?\n|strength1=?\n|casualties2=?\n|casualties1=537 dead\n}}\nThe Battle of Ronaldsway took place in 1275 at Ronaldsway in the southern part of the Isle of Man between a Scottish army and the Manx. The battle crushed the final attempt by the Manx to re-establish the Norse Sudreyar dynasty. As the battle resulted in the death of the last Norse King of Mann, Guðrøðr Magnússon, and the emigration to Norway of the remaining members of the Manx royal family, it also led to the firm establishment of Scottish rule on the Isle of Man.\nBackground\nAlthough the Isle of Man was formally ceded to Alexander III of Scotland in 1266, Scottish rule did not go unchallenged and in 1267 Alexander was forced to send an expedition against \"the rebels of Man\".\nBetween this expedition and the 1275 uprising all that is known is that Alexander III appointed bailiffs to the Isle of Man.\nManx rebellion\nIn response to the open uprising of the Manxmen under Guðrøðr, Alexander III dispatched a fleet to the island led by John de Vesci of Alnwick and many nobles. The Scots landed on St Michael's Isle on 7 October 1275 and sent a message to the rebels with terms of peace, \"offering them the peace of God and of the King of Scotland on condition of their laying aside their absurd presumption, and of giving themselves up to the King and his nobles.\"\nBattle\nGuðrøðr and the Manxmen having rejected the terms offered, battle was joined before sunrise the following day, 8 October. The Manxmen were routed and suffered heavy casualties. Guðrøðr was probably among the dead, ending the male line of the Manx Norse dynasty, although some theorise that he might have survived and fled to Wales.\nAftermath\nWith the death of Guðrøðr, the Isle of Man came under Scottish rule. This lasted at least until the death of Alexander III in 1285, as the island was listed among Alexander's heir Margaret, Maid of Norway's future possessions in 1284. The island did not, however, remain in Scottish hands beyond September 1290, when Edward I of England issued decrees to the Manxmen as their ruler. Thereafter England and Scotland struggled for control of the island until 1333, when Edward III of England renounced all English claims over the Isle of Man and recognised William Montacute, 1st Earl of Salisbury as King of Mann. Reasons of state, however, made the Isle of Man a shuttlecock to be passed over once more to Scotland with Edward Balliol, to whom Edward was giving his support in David's minority. After this, again the Scots had to be turned out, but this finally, when in 1343, ships being provided by the King, William de Montacute captured the island, and was crowned there.\nEnglish rule was reinstituted in 1399. The title of King of Mann changed to Lord of Mann in 1504, and from 1765 the title was purchased by the Crown of Great Britain.\n1936 archaeological excavations\nDuring the eastward expansion of Ronaldsway Aerodrome in 1936 a number of small rises near the airfield were dug into to provide soil for the levelling of the ground to the east. When workers began digging into one rise on the south side of the airfield they came upon numerous ancient graves. To the northeast of the main area of graves a large number of skeletons were found thrown together in a disorderly manner. Seeing as the ancient burial mound, dating back to at least the 8th or 9th centuries AD, had been a dominating strong point in the area, it was believed the collection of skeletons might be a mass grave of soldiers who fell at the Battle of Ronaldsway.\nIn fiction\nIn February 2015 a short comedy film written by James Franklin was made on location at nearby Derbyhaven, titled \"The Battle of Ronaldsway\"; it is based on the historical story. This production, partly funded by the IOM Arts Council in association with the Mannin Shorts script writing project, was due to be finished later in 2015.\nSee also\n*Battle of Largs\n*History of the Isle of Man\nFootnotes"
    }
  ]
}