{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Napue\n\nSwedish Empire\n| combatant2        =  Tsardom of Russia\n| commander1        = Carl Gustaf Armfeldt\n| commander2        = Mikhail Golitsyn\n| strength1         = 4,500 – 5,680Лапшов С.П. Триумф и трагедия: битва при Стуркюро, 19 февраля (2 марта) 1714 г. [Электронный ресурс] // История военного дела: исследования и источники. – 2014. – Специальный выпуск II. Лекции по военной истории XVI-XIX вв. — Ч. I. – C. 81-132  (15.09.2014) in battle\n14,000 total\n| strength2         = Another estimate:10,000; 12 cannons\n| casualties1       = 1,600 killed and 900 wounded or capturedor 5,133 killed and 535 captured or 3,100 casualties\n| casualties2       = 1,468–1,900\n}}\nThe Battle of Napue, the Battle of Isokyrö (Storkyro), or the Battle of Lappola, , }} was fought on  at the villages of Napue and Laurola, located in the Isokyrö parish of the Swedish Empire (modern-day Finland). The battle took place between the Swedish Empire and the Tsardom of Russia and was the final land battle of the Finnish campaign in the Great Northern War.\nThe Swedish detachment, consisting almost entirely of Finnish troops, was defeated by the numerically superior Russian forces. As a result, all of Finland fell under Russian military occupation for the remainder of the war—a seven-year period of hardship known in Finland as the Great Wrath.\nThe  was created in 1714, which was awarded to the Russian participants in the battle. Named after the nearby town of Vaasa (Vasa).\nPrelude\nBy 1703, Russian forces had reached the inner parts of the Gulf of Finland, and founded the city of Saint Petersburg. Since the Swedish main army was engaged in Poland and later in Russia, Sweden was hard pressed to defend its Baltic territories. After the Battle of Poltava, Russia seized all of Livonia, Estonia and Ingria, as well as the counties of Viborg and Nyslott and Kexholm.\nWhen Charles XII of Sweden refused to enter peace negotiations, Denmark and Russia drew up plans to threaten Stockholm. Two attack routes were considered: one through southern Sweden and the other through Finland and the Åland Islands. The southern attack was deemed more important, but the attack on Finland aimed to tie down as much of the remaining Swedish army as possible. However, the southern offensive was successfully fended off by Magnus Stenbock's victory at Helsingborg in 1710.\nThe Russian attack on Finland never developed as planned. With Peter the Great engaged in a war against Turkey, a shortage of soldiers forced him to postpone the conquest of Åbo (Turku). Initially, Russian actions in Finland consisted of raids and reconnaissance operations aimed at occupying southeastern Finland and devastating the region in order to deny Swedish forces a base of operations against Russian-controlled areas around Saint Petersburg.\nSignificant Russian military action in Finland began in 1713, after logistical problems caused the failure of an initial foray the previous year. By May, Peter the Great and his galley fleet were spotted off Helsingfors (Helsinki), and over the summer, Russian troops occupied all of southern Finland. The Swedish forces under General Georg Henrik Lybecker retreated inland. Before returning to Russia, Peter ordered Fyodor Apraksin, the commander of the Imperial Navy, to attack the Swedish army during the winter.\nIn August 1713, General Carl Gustaf Armfeldt was given command over the troops in Finland. He faced a hopeless task, as Lybecker had left him with a neglected, starving, and destitute army. Reconnaissance was impossible because the cavalry was too exhausted to fulfill its duties.\nRussian army arrival\nGolitsyn's army, consisting of 11,000 men, arrived in Ilmajoki in mid-February. Under pressure from the Swedish regime and driven by his military honor, Armfeldt decided to stage the battle to Isokyrö. Most of his officers opposed this decision, but Armfeldt remained assured by local reserves unwilling to surrender their homes and families to Russian terror. Only six of the nearest communes or villages had time enough to send reinforcements. Armfeldt had a total of 5,500 men, which he initially positioned on both sides of the river, in three brigades each consisting of four lines.\nOpening moves\nAfter learning that Golitsyn's main troops had a few kilometers earlier departed to the right and were approaching from the north, Armfeldt repositioned his forces. The brigades of Freidenfelt, Essen, Maidell and Yxkull were placed on the northern side of the river, while a small detachment with two guns occupied the hill of Napue. De La Barre's cavalry of 1,000 men, plus a group of 300 men under Ziesing, was ordered southwest of Napue to block Chekin's advance along the river.\nGolitsyn's main forces numbered 6,500 men, while Chekin's regiments comprised about 1,800 men. Before the battle, Golitsyn ordered three regiments of his northern troops, along with cossacks, to veer west in an attempt to encircle the Finnish main force. Similarly, Chekin detached one regiment to flank the Finnish troops from the south.\nBattle\nBeginning of the battle\nThe Finnish troops made the first move, initiating the battle with two guns on their left wing, prompting a response from the Russian artillery on their right. The Russians set fire to the nearest house of Turppala, while the Finnish artillery used all 64 of their remaining shells. After firing just one volley, the Finnish infantry launched a fierce charge against the Russians.\nThe battle at close quarters was carried out with swords, bayonets and spears, and soon there were so many killed and wounded men that it was difficult to get over them and carry on the attack. The Finnish troops, especially the brigades of Maidell and Yxkull near the house of Turppala, were very lucky and pushed the Russians back so that Armfeldt believed the battle could end in victory.\nChange of luck\nBut at this stage the over 2,000 Russians that were sent to veer the Finns from the west appeared at the back of the Finns, who had no reserves to call for help.\nIt was three o’clock in the afternoon. Only a half of Freidenfelt's and Essen's men were left, 1,300 Finns were fighting for their lives against 3,000 Russians.\nZiesing's small group in the south was beaten as well as Taube's group at Napue.\nIt is more than likely that General De La Barre's 1,000 men fled without taking real part in the battle. That is also the opinion of the local vicar Nils Aejmelaeus who was viewing the battle at a close distance—maybe on the so-called Rock of Kaam near the monument, on the other side of the road. As Aejmelaeus himself arrived to Vörå, De La Barre's cavalry was already there.\nNow there was a clear way for Tsekin's troops to attack at the rear of the rest of Finns.\nSoon almost all the Finns were surrounded, and Armfeldt commanded Maidell and Yxkull to withdraw, which in that state was more easily said than done. Almost all the commanders were killed. Essen fought with his sword up to his end having 32 wounds in his body. 82 per cent of his regiment was lost. The battlefield was filled with dead and wounded men. The rest were trying to flee to the rocky hill behind the present monument, and from there towards Laihia.\nVery few of the local reserves were lucky enough to survive. Armfeldt himself had to fight his way towards Laihia.\nAftermath\nAfter the battle\nThis bloody battle had lasted a little over two hours. Concrete signs of it were seen on the field for over two hundred years. At Napue, on an area of about four hectares there were 17 graves in the middle of the 18th century. And in the beginning of the 20th century there were still open piles of human bones.\nThe Finnish army lost over 3,000 men, with 2,645 killed. Only 512 were taken prisoner, but most perished either on the way to the Russian ships or in the terrible conditions of Saint Petersburg. The Russians reported losing about 1,478 men, though Russian scholar Aradir estimated the figure to have been over 2,000.\nThe battle had a devastating impact on the local population: Isokyrö lost 45 percent of its men, Laihia 60 percent, and Vähäkyrö 70 percent. The exact losses in Ylistaro are unknown but are estimated to be around 50 percent.\nGenocide\nIn the aftermath of the Swedish defeat, Finland fell under Russian military occupation, ushering in a period of widespread violence and hardship known as the Great Wrath (). Several scholars, including Kustaa H. J. Vilkuna, have characterized the events as a form of mass violence, with some drawing comparisons to genocide.\nFollowing the battle, Russian forces were given significant freedom of action, leading to widespread killings, torture, and the destruction of homes. Reports describe systematic looting and the abduction of young children, many of whom were taken to Russia as captives, with only a small fraction ever returning. Women were subjected to sexual violence, and entire communities were displaced. To escape the devastation, civilians sought refuge in remote cottages and tar-burning shelters, the remains of which can still be found in the forests of Isokyrö.\nNotes\nReferences\nBibliography\n*"
    }
  ]
}