{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Klock's Field\n\nAlbany County militiaTryon County militiaNew York LeviesMassachusetts LeviesOneida\n|combatant2=King's Royal Regiment of New YorkButler's RangersBrant's Volunteers8th Regiment of Foot34th Regiment of FootSeneca\n|commander1=Robert Van Rensselaer John BrownLewis Dubois\n|commander2=Sir John JohnsonJohn ButlerJoseph BrantSayenqueraghtaCornplanter\n|strength1=950\n|strength2=940\n|casualties1=40 killed (Stone Arabia)Unknown (Klock's Field)\n|casualties2=9 killed, 2 wounded, 37 missing\n}}\nThe '''Battle of Klock's Field''' was an engagement during the American Revolutionary War in the Mohawk Valley region of New York between British and Loyalist forces led by Lieutenant Colonel Sir John Johnson, and New York militia and levies led by Brigadier General Robert Van Rensselaer. The battle occurred on the north side of the Mohawk River in what is now St. Johnsville in Montgomery County. The result was inconclusive with neither side able to claim a clear victory.\nBackground\nIn August 1780, Major General Frederick Haldimand, Governor of the Province of Quebec authorized a large-scale raid against the Schoharie and Mohawk River valleys of New York. The expedition consisted of soldiers from the 8th Regiment of Foot, the 34th Regiment of Foot, Butler's Rangers, and the King's Royal Regiment of New York, also known as the Royal Yorkers. Also participating were Brant's Volunteers, Leake's Independent Company, a detachment of Hesse Hanau J채gers, and Seneca warriors led by Sayenqueraghta and Cornplanter. A coehorn mortar, a 3-pound \"grasshopper\" and ten Royal Artillery soldiers also accompanied the 940 man strong force.\nThe expedition, under the command of Lieutenant Colonel Sir John Johnson, departed Oswego on Lake Ontario on October 2. They proceeded by bateau and foot up the Oswego River to Lake Onondaga and the abandoned Onondaga village that had been destroyed by the Continental Army the previous year. Johnson's forces headed overland to the Susquehanna River which they reached on October 13. The expedition then followed the Susquehanna River and Charlotte Creek to the height of land west of the Schoharie Valley where they encamped on October 16.\nThe expedition entered the valley early the next morning. The inhabitants had been forewarned and most had fled to the protection of the valley's three forts. Johnson bypassed Upper Fort and proceeded to Middle Fort which he besieged. As his artillery had little effect, and as the garrison of Middle Fort refused to surrender, Johnson abandoned the siege after a few hours and continued north. Meanwhile, his forces plundered and burned; destroying houses, barns, granaries, churches and mills. After briefly attacking Lower Fort, Johnson's forces encamped on the west side of Schoharie Creek a few miles south of the Mohawk River. Due to the almost impassible road, Johnson ordered his artillery detachment to bury the coehorn in a swamp.\nThe following morning Johnson dispatched Joseph Brant with his Volunteers and a company of Butler's Rangers across the Schoharie to destroy houses and barns in the vicinity of Fort Hunter. When Johnson reached the Mohawk River he divided his forces sending three companies of the Royal Yorkers and half of the Seneca across the river. The two columns then proceeded west, burning any structures that had survived earlier raids, before encamping at the headlands known as the Noses.\nMeanwhile, several hundred militiamen from Albany County had assembled at Schenectady under the command of Brigadier General Robert Van Rensselaer. On October 18, they set off in pursuit of Johnson's forces. Enroute they were joined by militia from the Schoharie Valley bringing Van Rensselaer's numbers up to around 600.\nBattle of Stone Arabia\nOn the morning of October 19, Colonel John Brown, commanding a force of Massachusetts levies and New York militia sallied from Fort Paris in Stone Arabia with the intent of attacking the detachment of Johnson's forces on the north side of the Mohawk River. Two deserters from the Royal Yorkers had informed Brown that the detachment was isolated and smaller than the 360 men he had available. Johnson, however, had forded the Mohawk earlier that morning and was able to meet Brown with his main force.\nThe Battle of Stone Arabia was brief. After Brown's vanguard collided with a detachment of Brant's Volunteers, Brown ordered his men into a less than ideal defensive position in the woods behind a stone fence. They were subsequently attacked from the left by Brant's Volunteers and from the right by Butler's Rangers. Johnson personally led the detachments of 8th and 34th Regiments in a charge against Brown's center. Brown was shot dead while atop his horse and his men fell back in disarray. Roughly 40 were killed. Many of the survivors escaped to Fort Paris or the smaller Fort Keyser, while a few fled across the river. Johnson later reported that one private from the 8th Regiment and three Iroquois were killed, and that Brant had been slightly wounded.\nJohnson declined to attack Fort Paris or Fort Keyser, however, the houses, barns and the two churches of Stone Arabia were soon engulfed in flames. Papers found on the body of Colonel Brown included a letter from which Johnson learned that Van Rensselaer's column had been at Fort Hunter the day before. Johnson assembled his troops and continued marching west.\nKlock's Field\nWhen Van Rensselaer approached Fort Plain (formally known as Fort Rensselaer) on the morning of October 19, he was met by Colonel Louis Dubois and his New York Levies, Lieutenant Colonel Samuel Clyde with the Tryon County militia, and 50 Oneida warriors led by Akiatonhar처nkwen. Dubois had crossed the river earlier but had crossed back after encountering soldiers escaping after Brown's defeat. Despite protests from Lieutenant Colonel John Harper of the 2nd Regiment of New York Levies, Van Rensselaer did not immediately ford the river as the Albany militia were exhausted, having marched for 26 hours with only short breaks.\nDubois's forces were ordered back across the river but then waited several hours until the Albany militia crossed. Van Rensselaer divided his forces, now totalling 950 men, into three columns and set off in pursuit of Johnson.\nJohnson met Van Rensselaer's forces at a farm belonging to the Klock family to the east of St Johnsville. He anchored his left flank with the J채gers and Brant's Volunteers, and his right flank with Butler's Rangers. In the center he placed his Royal Yorkers, the regulars from the 8th and 34th, and the grasshopper.\nThe Albany militia formed Van Rensselaer's two left columns. They deployed against Johnson's center but opened fire before they were in effective range and would not advance. After several irregular volleys, they fell back when Johnson's center opened fire en masse. The right column, however, composed of the New York Levies, the Tryon militia and the Oneida, dislodged the J채gers and Brant's Volunteers from their positions, threatening Johnson's left. A counterattack by the Royal Yorkers and the 34th against the right column was driven back.\nThe onset of darkness combined with the thick smoke from musket fire and burning buildings caused considerable confusion. With the New York Levies under Colonel Dubois now threatening his rear, Johnson ordered a withdrawal. The grasshopper was spiked and abandoned. Johnson forded the Mohawk a few miles upstream and continued west, however, several of his rearguard were captured.\nVan Rensselaer attempted to rally the Albany militia but decided he needed to withdraw rather than try to pursue Johnson in the dark. The following morning his forces set off in pursuit and had reached Fort Herkimer opposite the mouth of West Canada Creek by mid-afternoon. Several hours later Van Rensselaer broke off the chase when it became obvious that Johnson's forces had escaped.\nAftermath\nOn October 20, Captain John McDonell and his company of Butler's Rangers, although they had become separated from the rest of Johnson's forces, ambushed a column of Tryon County militia reinforcements killing ten, capturing two and forcing the rest to retreat. A few days later a detachment from Fort Stanwix that was sent out to destroy the bateaux that Johnson had left at the south end of Lake Onondaga was captured virtually intact by Leake's Independent Company.\nJohnson's forces reached Oswego on October 26. In his dispatch to Governor Haldimand he reported that he had nine killed, two wounded, and 52 missing including Captain George Dane of the Rangers. Dane arrived at Oswego several days later with 17 men. Most of the remainder were determined to have been taken as prisoners of war.\nGovernor Clinton reported to the Continental Congress that 150,000 tons of grain and 200 dwellings had been destroyed, and that \"Schenectady may now be said to become the limits of our western Frontier.\"\nVan Rensselaer's delay in crossing the river and his decision to not immediately pursue Johnson led to a formal inquiry the following spring. The general was found to have acted appropriately, however, historical writers such as William Leete Stone and Nelson Greene were highly critical of the general's decisions. Green wrote that Van Rensselaer displayed \"cowardice of a general totally unfitted for military command.\" Van Rensellaer, however, was well aware that his Albany militia were exhausted, and that Johnson's forces were more experienced.\nReferences"
    }
  ]
}