{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Smolenice\n\nBrigadier Miklós Bercsényi General\n|commander2= General Johann von Ritschan Guido von Starhemberg Duke John Adolphus of Holstein-Plön Colonel Leopold Maltzan\n|strength1= 15,000 (5,000–6,000 participated in the battle)\n|strength2=2,331 infantry250 cavalry4 cannon\n|casualties1=300–400 dead\n|casualties2=700 captured, several hundred dead, 3 cannon\n}}\nThe Battle of Smolenice (  ) was a battle between the Kuruc (a group of Hungarian peasants and irregular warriors), and the forces of the Habsburg Empire, soldiers of the Holy Roman Empire and auxiliaries from Denmark. The battle occurred on 28 May 1704 at Smolenice in Upper Hungary (present day Slovakia), where the Kuruc army routed the Habsburg forces, capturing the Austrian commander. For a short time, the rebels threatened the safety of Vienna, marauding through a number of villages in Lower Austria, Marchfeld, and Moravia.\nPrelude\nIn April 1704, Miklós Bercsényi led an uprising among the Hungarian and Slovak peasants in Upper Hungary, promising freedom on behalf of Francis II Rákóczi. Bercsényi intended to defeat the army of the Austrian general Johann von Ritschan.\nGeneral von Ritschan left Moravia with the aim of reaching Pressburg (present-day Bratislava).\nOpposing forces\nThe Kuruc force had approximately 15,000 untrained fighters. Bercsényi commanded the light horsemen. He also commanded a small number of infantry, as well as a gathering of Slovak and Hungarian peasants who possessed only agricultural tools and obsolete rifles as weapons.\nRitschan opposed Bercsényi's army with Imperial forces from Austria, Bohemia, Moravia, Denmark, and Germany. Although significantly outnumbered by the Kuruc forces, Ritschan's forces were highly trained and well-equipped. The Imperial army consisted of 2,331 infantry, 250 cavalry and 4 cannon, and was composed of the following units:\n* 473 infantry under von Deutschmeister from Vienna\n* 129 infantry under John Adolphus, Duke of Schleswig-Holstein-Sonderburg-Plön\n* 625 infantry under Guido von Starhemberg\n* 468 infantry under Baron Georg Friedrich von Kriechbaum\n* 454 infantry under Jung-Daun\n* 182 Danish infantry under Colonel Leopold Maltzan\n* 150 Cuirassiers under Captain Giordani Visconti\n* 50 Cuirassiers under Graf Francis Taaffe\n* 50 Dragoons under Marquis Captain Joseph-Paul de Vaubonne\nThe battle\nThe Austrian army moved to Smolenice and camped there on 26 May to recuperate after crossing the Carpathian Mountains. Ritschan wanted to wait at Smolenice until reinforcements arrived from another Austrian-Royalist army under the command of János Wolfy.\nThe Imperial Army hesitates\nRitschan was not aware that the rebel Kuruc army was gathering in the forest; thus, he was unprepared for an attack. When the Kuruc attack occurred, Ritschan called a council and proposed an advance by Červený Kameň, but Ritschan's officers—Colonel Maltzan, Captain Visconti, and Deutschmeister—all rejected his plan because the region was firmly controlled by the Kurucs. The officers feared for the safety of Moravia and Vienna.\nThe Kurucs attack\nIn the first stage of the battle, Brigadier László Ocskay and the Slovak rebels attacked Starhemberg's Austrian force, stopping Starhemberg's advance. The cavalry followed under Sandor Károlyi. Ocskay's Hussars were on alert near Smolenice because many Slovaks remained in the forests and the Kuruc infantry was on its way to Smolenice.\nThe Austrians counterattack\nRitschan launched a counterattack by the skirmishers, and the Kuruc fusiliers retreated to the woods. Then, 2,000 Kuruc horsemen arrived, pushing back the Austrian cavalry. Starhemberg's forces were confused by the surprise attacks; his commanders called von Deutschmeister's regiment and the Danish infantry. In this clash, von Deutschmeister forced the Kuruc cavalry to retire after an hour and a half of fighting.\nKuruc victory\nDespite the success of the Austrian cavalry, the Kuruc surprise attacks had disrupted the Austrian army, which split in two. This allowed the Kuruc army to rout the Austrian, German, and Danish contingents one by one. Ritschan was wounded in the battle and tried to escape the encircling Kuruc forces by joining the Danish and Kierchbaum troops. Subsequently, the Danish contingent was caught.\nRitschan had made a tactical error. After the success of von Deutschmeister's regiment, he concentrated on the defense of his camp and skirmishers; however, his soldiers were exhausted from crossing the mountains between Trnava and Jablonica. After surprising and disrupting the Austrians, the Kurucs were able to surround and defeat them. Ritschan and a small force escaped and reached Jablonica, but Ritschan himself was eventually captured.\nAftermath\nCasualties and captives\nSeveral hundred soldiers in the Austrian army were killed and 700 were captured. The Hungarians lost 300–400 soldiers.\nFurther campaigns\nAfter their success in the Battle of Smolenice, Ocskay invaded Moravia and Károlyi took Lower Austria. Leopold I was forced to cancel his vacation in Laxenburg. On 9 June 1704, Leopold's birthday, Károlyi's cavalry set fire to German and Croatian villages near Vienna. (At that time a few Chakavian Croatians lived in Lower Austria). Károlyi's men also destroyed the Imperial Zoo near Vienna.\nOn 10 June Károlyi returned to Hungary with a significant haul of war spoils. Károlyi's and Forgách's armies tried to unite against Heister, but Heister defeated Forgách in the Battle of Koroncó. As a result, the victory near Smolenice became inconsequential and the Kurucs were defeated in Transdanubia. It was not until 1705, in the battle of Szentgotthárd, that the Kuruc general Bottyán the Blind regained the region.\nSources\n* [https://web.archive.org/web/20170320145547/http://www.ng.hu/Civilizacio/2004/05/Haromszaz_eve_tortent_a_szomolanyi_csata Háromszáz éve történt – a szomolányi csata (National Geographic)]\n* [http://mek.oszk.hu/09400/09477/html/0018/1564.html Bánlaky József: A szomolányi ütközet. 1704. május 28.-án]\nFurther reading\n* R. Várkonyi Ágnes. Megújulások kora. Magyar Könyvklub.  (2001)"
    }
  ]
}