{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Abu Klea__disambig_1\n\n| result            = British victory\n| combatant1        =\n*\n| combatant2        =  Mahdist State\n| commander1        =  Herbert Stewart\n| commander2        =  Muhammad Ahmad\n| strength1         = 1,400\n| strength2         = 14,000 (3,000 engaged in the battle)\n| casualties1       = 76 killed82 wounded\n| casualties2       = 1,100 killed, unknown wounded (British claim)\n| campaignbox       =\n}}\nThe Battle of Abu Klea, also known as the Battle of Abu Tulayh, took place between 16 and 18 January 1885, at Abu Klea, Sudan, between the British Desert Column and Mahdist forces encamped near Abu Klea. The Desert Column, a force of approximately 1,400 soldiers, started from Korti, Sudan on 30 December 1884; the Desert Column's mission, in a joint effort titled the \"Gordon Relief Expedition\", was to march across the Bayuda Desert to the aid of General Charles George Gordon at Khartoum, Sudan, who was besieged there by Mahdist forces.\nThe place is generally known in British military records as Abu Klea, which arose as a contemporary British spelling of its Arabic name, 'Abu Tͅuleiħ (أَبُو طُلَيْح). The British commander Sir Herbert Stewart was mortally wounded during the battle.\nBackground\nThe British forces consisted of 1,400 British of the Desert Column under Sir Herbert Stewart, against a Sudanese force of approximately 14,000 fighters. While the main British force (the River Column), led by General Sir Garnet Wolseley travelled by river from Korti to Khartoum, Stewart's column was to cut across country by column directly for Khartoum, since time was running short according to what little information was available from the garrison. The force was composed of four regiments of camel-mounted troops (Guards, Heavy, Light and Mounted Infantry), detachments of the various infantry regiments in Egypt and of the River Column, and a detachment of the 19th Hussars, mounted on horses. Four light field pieces and a small Naval Brigade manning a Gardner machine gun completed the force.\nUnits involved included:\n* 19th Hussars\n* Heavy Camel Detachment\n* Guards Camel Detachment\n* Mounted Infantry Detachment\n* Light Camel Detachment\n* 1st Battalion, Royal Sussex Regiment\n* Royal Marines Light Infantry\n* Royal Navy Brigade\nBattle\n, ca. 1884/85]]\nThe Desert Column arrived on the salient overlooking the wadi of Abu Klea not long before sunset, and Stewart decided not to attack that night. The British built a defensive position (or zariba), but were sniped at from the high ground around them by Mahdist rifle units – mainly soldiers from southern Sudan – all night. They took several casualties. At first light Stewart ordered them to form a square, which they achieved with perfect discipline, though still under fire from enemy snipers. The square moved slowly towards the wells along the side of the wadi, over very difficult, undulating, rocky ground. Suddenly the square was ambushed by a huge Mahdist force that had been concealing itself in the wadi. The British guns were on the leading face of the square, and the Naval Brigade, with their Gardner machine gun, at the rear left-hand corner, nearest the wadi. Several officers and men of HMS Alexandra were killed at the battle. As the British halted to repel the Mahdist force, a gap opened up towards the rear left corner of the square. This was caused when Captain Lord Charles Beresford RN, commanding the Naval Brigade, ordered the Gardner gun to be run out on the left flank of the infantry square to provide covering fire. Colonel Frederick Gustavus Burnaby then gave an impromptu order for the Heavy Camel Regiment to wheel out of the square in support of the Gardner gun. The gun had been tested and found very reliable in Britain, but had not been tested in a desert with loose sand getting into its mechanism. It fired seventy rounds and then jammed, and as the crew tried to clear it they were cut down in a rush by the dervishes. Out of the forty men in the Naval contingent, Lieutenants Alfred Piggott and Rudolph de Lisle were killed along with Chief Boatswain's Mate Bill (Billy) Rhodes and five other seamen and seven more were wounded. Beresford was 'scratched' on the left hand by a spear as he managed to duck under the gun. The weight of the rush pushed the sailors back into the face of the square. Several dervishes got inside the square, but found the interior full of camels and could not proceed. The troops in the rear ranks faced about and opened fire into the press of men and camels behind them, and were able to drive the dervishes out of the square and compel them to retreat from the field.\nThe battle was short, lasting barely fifteen minutes from start to finish. Casualties for the British were nine officers and 65 other ranks killed and over a hundred wounded. The Mahdists lost 1,100 dead during the fifteen minutes of fighting, made all the worse by only 3,000–5,000 of the dervish force being engaged. Among the dervish dead was Musa wad Helu, one of the Mahdist chiefs. British national hero Colonel F. G. Burnaby of the Royal Horse Guards was killed by a spear to the throat. The Times reported that he \"fell while reforming a broken British square\" (this being one of only two recorded cases of a British square 'breaking' in the 19th century).  Frank Rhodes (brother of Cecil) distinguished himself when several horses were shot under him during the engagement, earning him a Distinguished Service Order. Gunner Alfred Smith fought bravely to save his officer, Lieutenant Guthrie, and was awarded a Victoria Cross.\nAftermath\nThe Egyptian Campaign Memorial in [[Brighton, East Sussex, England.]]\nThe Desert Column set out from Abu Klea in the late afternoon of 18 January and marched through the night towards Metemmeh. It fought a battle on the afternoon of 19 January near Abu Kru, in the vicinity of Metemmeh, in which it repulsed another charge by the Mahdists. The column's leader, Major General Herbert Stewart, was wounded by Remington rifle fire that night and transferred command to an inexperienced leader, Brigadier General Charles Wilson, his intelligence officer (Stewart would die of his wound a month later). Wilson was slow to organize his forces, and in tarrying another day, it was he who was the cause of that advance detachment's delay.\nOn 20 January a flotilla of four steamers with a motley force of Sudanese and Egyptian troops sent downriver by Gordon reached the British camp. After some reconnaissance up and down the river, Wilson set off towards Khartoum with two of the steamers and a small force on 24 January. His orders from Wolseley were to make contact and confer with Gordon. They arrived after 11 o’clock on 28 January and were met with enemy fire from the riverbanks. Khartoum had fallen to the Mahdi on 26 January and Gordon had been killed.\nThe British then withdrew from the Sudan, leaving the Mahdi to rule Sudan for the next 13 years. The official public blame for this failure was left with Prime Minister Gladstone for delaying several months to authorise a rescue, to the considerable anger expressed in public of Queen Victoria.\nPoetic tributes\nThe battle was celebrated by the doggerel poet William McGonagall:\nYe sons of Mars, come join with me,\nAnd sing in praise of Sir Herbert Stewart’s little army,\nThat made ten thousand Arabs flee\nAt the charge of the bayonet at Abou Klea\nand so on for 19 stanzas.\nThe battle and one of its notable participants is mentioned in the song \"Colonel Burnaby\", which has as its chorus:\nWeep not my boys, for those who fell,\nThey did not flinch nor fear.\nThey stood their ground like Englishmen,\nand died at Abu Klea\nThe rhymes in these poems show varying attempts at pronouncing \"Klea\" from the English spelling, and the rhyme with \"fear\" shows British English arhotic pronunciation.\nMore celebrated and of higher literary quality , but taking substantial liberties for the exact events, is the mention of the battle in verse two of Sir Henry Newbolt's poem Vitai Lampada:\n…The sand of the desert is sodden red,\nRed with the wreck of a square that broke;\nThe Gatling's jammed and the colonel dead,\nAnd the regiment blind with dust and smoke.\nThe river of death has brimmed his banks,\nAnd England’s far, and Honour a name,\nBut the voice of the schoolboy rallies the ranks,\n\"Play up! play up! and play the game!”\n\"The wreck of a square\" is a severe exaggeration, and Newbolt conflated Abu Klea with other events such as the Battle of Tamai; most of the dead were Mahdists. Newbolt's reference to the Gatling is wrong, as the British force at Abu Klea had the American Gardner machine gun. The Royal Artillery unit which took part in the battle still exists today, re-numbered as 176 Battery, and has the honour title \"Abu Klea\", awarded in 1955 in recognition of the Victoria Cross won by Gunner Smith. The battle, together with that of Tamai, was also referenced in Rudyard Kiplings poem \"Fuzzy-Wuzzy\", voiced as a common soldiers begrudged tribute to the fighting prowess of the Beja people. The last lines read:\nSo 'ere's ~to~ you, Fuzzy-Wuzzy, at your 'ome in the Soudan;\nYou're a pore benighted 'eathen but a first-class fightin' man;\nAn' 'ere's ~to~ you, Fuzzy-Wuzzy, with your 'ayrick 'ead of 'air —\nYou big black boundin' beggar — for you broke a British square!\nSee also\n* The Triumph of the Sun (2005 novel) by Wilbur Smith\n* Khartoum (film)\n* The Four Feathers, a film from 2002, where the battle is portrayed very different from reality and as a disastrous defeat instead of a victory.\nReferences\n* Asher, Michael, \"Khartoum - The Ultimate Imperial Adventure\"  Penguin, 2004. Includes a vivid description of the battle from the perspective of both British and Mahdist forces.\n* Craig, Simon, \"Breaking the Square: Dervishes vs. Brits at the 1885 Battle of Abu Klea\", Military Heritage, volume 3, No. 3 (December 2001), 78–84. (Describes the failed British attempt to rescue major general Charles Gordon and friendly forces at Khartoum from the Dervishes led by the Mahdi.)\n* Churchill, Winston Spencer. The River War: An Account of the Reconquest of the Sudan, Middlesex: The Echo Library, 2007. 43–48.\n* White-Spunner\n* Snook, Col Mike, \"Beyond the Reach of Empire: Wolseley's Failed Campaign to Save Gordon and Khartoum.\" (London, 2013). .\nExternal links\n* [http://www.mcgonagall-online.org.uk/poems/pgklea.htm The Battle of Abu Klea] Full text of the poem, from McGonagall Online.\n* [https://web.archive.org/web/20110704231341/http://cghub.com/images/view/144169 Abu Clea] Painting by Karl Kopinski"
    }
  ]
}