{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Kallo__disambig_1\n\nDutch Republic\n| combatant2        =\n| commander1        =  William of Nassau-Siegen\n| commander2        =  Cardinal-Infante Ferdinand Andrea Cantelmo\n| strength1         = 22,000\n* 5,700–6,000 initially engaged\n| strength2         = 8,000–9,000\n| casualties1       = 2,500 killed2,370–3,000 captured28 cannons captured\n| casualties2       = 284 killed822 wounded\n| campaignbox       =\n}}\nThe Battle of Kallo was a major field battle fought from 20 to 21 June 1638 in and around the forts of Kallo and Verrebroek, located on the left bank of the Scheldt river, near Antwerp, during the second phase of the Eighty Years' War.\nFollowing the symbolic recovery of Breda during the 1637 campaign, the Dutch Republic agreed with the French Crown, with whom it had allied in 1635, to besiege a major city in the Spanish Netherlands during the 1638 campaign. The commander of the Dutch States Army, Frederick Henry of Orange, planned an approach over Antwerp from the two sides of the Scheldt. After marching the army, Frederick Henry transferred 50 barges to Count William of Nassau-Siegen and he was left entrusted to land in the Spanish-controlled Waasland region, west of Antwerp, to seize the forts of Kallo and Verrebroek, along with several other key fortifications, to invest Antwerp from the west. In the meantime, Frederick Henry would advance on the opposite bank to complete the blockade of the city while the armies of France invaded the Spanish Netherlands from the south to oblige the Spanish Army of Flanders to divide its forces.\nThe Dutch operation proceeded well at first since the force under Nassau-Siegen easily captured Kallo and Verrebroek. However, it was unable to gain further progress, so the count entrenched his troops and asked for reinforcements. The governor of the Spanish Netherlands and general, Cardinal-Infante Ferdinand, younger brother to Philip IV of Spain and victor of the Battle of Nördlingen, with an army consisting of tercios and other troops from several garrison duties, launched a counter-attack over the Dutch positions the night of 20–21 June. Advancing along three narrow fronts, the Spanish forces drove the States' soldiers from a series of outer works, but were unable to dislodge them from the two main forts. However, exhaustion and lack of supplies and reinforcements led Nassau-Siegen to order the re-embarkation during the next night. Ferdinand launched a second assault while the retreat was ongoing, and, as panic ensued among the Dutch ranks, the entire force was defeated. The Dutch commander escaped with a few hundred men, while many others drowned attempting to save themselves or were captured.\nAlong with the successful defense of Saint-Omer and Geldern that same year, the victory of Kallo proved that the Spanish tercios were still a formidable field force. Additionally, it was interpreted in terms of Catholic propaganda and became subject of paintings, poems and popular songs.\nBackground\nIn May 1635, France declared war on the Spanish Monarchy and invaded the Spanish Netherlands from the south in coordination with a Dutch army which descended from the north along the Meuse. The invasion ultimately collapsed because of its deficient logistics and the depleted allied armies had to retreat to the Republic. The Spanish forces, reinforced by an Imperial army under Ottavio Piccolomini, went on the offensive and took by surprise the Dutch fortress of Schenkenschans, strategically located at a tip of land where the Rhine once split into two separate branches, the Waal and the Nederrijn. While the States Army was able to recover it after an eleven-month siege, the losses and the economic burden that it sustained, coupled with political disagreements between the command of the Army and the States of Holland, meant that the Prince of Orange was unable to mount a campaign against the Spanish in 1636. This allowed the Cardinal-Infante Ferdinand to launch a punitive campaign into northern France which caused panic at Paris.\nBy 1637, the allies were ready again to go on the offensive. Unlike in 1635, they would operate separately in order to force the Spanish to divide their troops. Thanks to a subsidy of more than 1.1 million guilders paid by France, the States Army could align 24,000 soldiers for a campaign the main objective of which was the capture of the Spanish privateering base of Dunkirk. In face of a quick Spanish reaction, however, Frederick Henry looked for a more suitable goal and invested Breda on 21 July. In early 1637, the Spanish Army of Flanders had 55,000 men, but only 16,000 were available for field operations, the remaining 39,000 being assigned to garrison duties. Lacking of troops enough to relieve Breda while he waited for the return of the Imperial forces under Piccolomini from Germany, the Cardinal-Infante launched an offensive over the Dutch fortresses in the Meuse valley in August and quickly took Venlo and Roermond.\nWhile the Dutch continued to besiege Breda, the French armies invaded the provinces of Artois, Hainaut and Luxemburg, where they made rapid gains. Only the arrival of Piccolomini's army of 11,000 men at Mons on 2 August stopped the French progression. Ferdinand then decided to join forces with the Imperial commander to push the French back, and recovered most of the lost ground over September, though Breda surrendered to the Prince of Orange on 10 October. At Madrid, Philip IV and the Count-Duke of Olivares met the news with great disappointment, since the capture of Breda by Spinola in 1625 had been hailed as one of the Monarchy's greatest triumphs, and just two years before, in 1635, Diego Velázquez's painting The Surrender of Breda had been installed at the Hall of Realms in the Buen Retiro Palace. From the military perspective, however, Breda was of limited value, while the capture of Venlo and Roermond bolstered the Spanish control over the Meuse and ended the threat of a Dutch attack from Maastricht, which meant that, from then on, the Army of Flanders could concentrate their forces against the States Army on the defense of Antwerp and Flanders.\nIn late 1637, Philip IV and Olivares decided to increase to size of the Army of Flanders to over 80,000, for which they intended to send 4,700,000 ducats to Brussels. Added to them the Imperial army under Piccolomini, the king and his valido expected to align about 100,000 men in the Netherlands, 60,000 to face the French and 40,000 against the Dutch. The Spanish court, Ferdinand and his advisors, and the Imperial command differed on the strategy to follow. Olivares wished to break the Franco-Dutch alliance by reaching a truce with the States General, but not before having pressed the Republic into make a series of concessions, which required action both on land and sea. On March, however, he changed his opinion and argued for an offensive against Louis XIII, 'being that king the heart of all the disturbances of the world'. Therefore, the Spanish forces would take an offensive stance on the French front, while staying on defensive against the Dutch, though Olivares encouraged surprise attacks over Dutch fortresses and the bribing their commanders to induce them do defect. In the end, these plans were frustrated because Ferdinand did not receive the planned reinforcements and by the fact that the French and Dutch armies took the field earlier than expected.\nAt The Hague, Frederick Henry of Orange had to face pressure by the States of Holland, that wished to reduce the size of the army to reduce its cost. The prince was able to prevent this by reminding that the French war subsidies depended on the deployment of a sizeable army, and pointed out that it was necessary for the Republic to capture Antwerp in order to render the alliance beneficial and open the way to the peace with Spain. On 17 December 1637, the States General and the French ambassador Jean d'Estampes de Valençay reached an agreement on how to invade the Spanish Netherlands. Each side would deploy 18,000 to 20,000 infantry and 4,500 to 5,000 cavalry, while France would contribute to the Dutch war effort with 1.2 million guilders. The Republic agreed to attack a major city —Dunkirk, Antwerp or Hulst—, while France promised to besiege Thionville, Namur or Mons, or launching a diversionary operation to allow the States Army to fulfill its plans.\nDutch preparations and landing\n, canals and streambeds between Bergen op Zoom and Antwerp (1645).]]\nThe Prince of Orange departed The Hague on 25 May and, on 1 June, the same day that the French Army laid siege to Saint-Omer, in Artois, he took command of the field army of the Dutch States, which had been assembled at a camp in the village of Lithoijen, in Brabant. A 3,000-men detachment under Count Henry Casimir of Nassau-Dietz was sent to Nijmegen to guard the southern border of the Republic, while Frederick Henry led the bulk of the army to Dordrecht, where it embarked aboard a fleet of 30 warships that convoyed it with its artillery, horses and baggage to Bergen op Zoom. Frederick Henry had planned at first to besiege Hulst, but, pressed by a deputation of the States General, he finally agreed to move upon Antwerp. To fully invest the city and prevent it from being relieved from Hulst and Ghent, the prince dispatched a force of 7,000 infantry and 300 cavalry under Count William of Nassau-Siegen aboard 53 large boats and many smaller ones —taken in 1631 from the Spanish at the Battle of the Slaak— to land at the Waasland, west of Antwerp. They embarked at Dordrecht a day before that the main army did it, though both forces reunited briefly at Bergen op Zoom before the landing operation was undertaken.\nThe banks of the Scheldt were protected by a series of forts which made the Dutch operation difficult. A landing at the dike between the forts of Sint-Maria and Hooft van Vlaanderen was deemed too risky, since the approaching fleet would have been easily discovered. Instead, Frederick Henry instructed Count William to sail across the flooded country to the Doel island to land there and then to advance upon the dike of Kallo. Captain Hoemaker, governor of the fort of Liefkenshoek, at Doel, was to provide guides to ensure the quick arrival of the landing force at Kallo. Once there, the States troops had orders to seize the forts of Kallo and Verrebroek, which should be properly garrisoned, and to advance up to the Blokkersdijk and Burcht, which had to be seized too. Once the said positions had been taken, the dikes nearby were to be breached in order to flood the countryside and render any relief to Antwerp from the west impossible. If Blokkersdijk and Burch could not be taken, William should withdraw to the dike of Kallo and entrench his troops there. Meanwhile, Frederick Henry would advance on the other side of the Scheldt from Bergen op Zoom to Berchem ahead of the main army —four English infantry regiments, five French infantry regiments, the Solms and Beverweert regiments, 27 militia companies and all the cavalry–. There, once Antwerp had been invested from that flank, a pontoon bridge would be laid over the Scheldt to link with Count William's forces at Burcht.\nCount William departed Bergen op Zoom with his army on the night of 13 to 14 June and landed at Doel after a brief crossing. From there, they moved across the flooded lands towards the dike of Kallo with the water up to the waist or even the armpits, despite Captain Hoemaker having said that it would not cover above the knee. Four artillery pieces were moved on sleds. The dike was unguarded, but, as the presence of the States Army at Bergen op Zoom was known to Felipe da Silva, governor of Antwerp, he had replaced the ordinary guard of the forts of Kallo, the Pearl and Blokkersdijk by three companies of Walloon infantry from the garrison of the citadel of Antwerp, which were shortly after reinforced by the German Regiment of Brion. The Dutch troops, however, took the defenders by surprise. They first captured the Steenland redoubt, over the dike that linked the forts of Kallo and Verrebroek, which was garrisoned by 15 soldiers. Count William's force then took a lock halfway between the Steenland and the fort of Kallo. This time they met some opposition by 300 German soldiers and 300 militia, who were nevertheless driven off and left behind two cannons. Panic spread among the German and Walloon troops, and the Dutch quickly seized Kallo. Verrebroek was also occupied with little resistance. William ordered then an assault over the nearby fort of Saint-Marie, but it was repelled by the garrison.\nSpanish reaction\nOnce Feipe da Silva learned about the loss of the forts, he requested assistance from the garrisons of Hulst and Zelzate, and sent a message to the Cardinal-Infante at his court at Brussels. Ferdinand, who was then following the operations around Saint-Omer, immediately took the road to Antwerp and instructed Esteban de Gamarra, adjudant to the Maestre de Campo general, the Count of Fontaines, to collect troops from the garrisons along the Demer river and Herentals to be dispatched to Antwerp, and also to urge the Marquis of Lede, governor of Limburg, to cross the Meuse with a number of Spanish foot companies. Other forces which were guarding the Flemish facade between Ghent and Hulst were also called. In the meantime, Count William, having been rebuffed at Saint-Marie, remained passive and limited his action to ordering his men to strengthen the positions which they had seized. Frederick Henry, on the other hand, remained with the main army near Bergen op Zoom and sent two officers to inspect the positions of William's men. These were considered impregnable.\nOn 15 June, with Ferdinand already in Antwerp, William noticed that the Spanish were gathering forces at Beveren and ordered a demi-lune between the forts of Kallo and Sint-Marie to be abandoned, as well as some trenches which the States' troops had dug in front of the latter fort. That day a skirmish took place when the Count of Fontaines, who has assumed command of the troops at Beveren, lured William into an ambush. 1,200 Dutch infantry and some cavalry made a sortie from their entrenchments to drive away the Spanish troops from a breastwork that they were building over the dike linking Kallo and Melsele. When the State's soldiers had distanced themselves from the fortifications, 9 companies of Spanish cavalry fell upon them and inflicted a number of casualties before Colonel Balfour came in relief with 400 foot soldiers armed with carbines and 4 cavalry companies. Count Maurice Frederick, William's only son and a Captain of the States Army, was killed in action by a sword thrust.\nAfter the skirmish, both troops remained at their positions, exchanging artillery fire. On 18 June, William sent his younger half-brother Henry, lieutenant-colonel of the Noord-Hollands Regiment, to ask the Prince of Orange for food and gunpowder, since his men were starting to run out of both. The same day, Ferdinand had finally gathered a sizeable army, including an Imperial infantry regiment under the Baron of Adelshofen, recently arrived from Luxemburg, and held a council in which it was decided to launch a three-pronged attack next evening to dislodge the Dutch and retake Kallo and Verrebroek.\nBattle\nOrder of battle\nThe Spanish order of battle was determined in the council of 18 June. Count Fuenclara was to attack from the fort of Sint-Marie in command of the 15 companies of his Spanish tercio and troops taken from the garrisons of the Demer, Herentals, and Lier. His Spanish tercio had fought at the Battle of Nördlingen four years previously. The Marquis of Lede was instructed to attack from the dike of Melsele with the German foot regiment of Brion, the Italian tercio of Ottavio Guasco, the Imperial foot regiment of Adelshofen and six cavalry companies. Andrea Cantelmo, general of the artillery, would lead the third and main attack, over the fort of Verrebroek, along the dikes coming from Hulst and Vrasene. The units under his command were 10 companies of Spanish infantry arrived from Limburg −5 from the Tercio of the Marquis of Velada and 5 from that of the Count of Fuenclara–, the Italian tercio of the Duke of Avigliano, the Walloon tercios of Ribacourt and Catres, a foot regiment from Luxemburg and 10 cavalry companies. They numbered, in all, 8,000 to 9,000 men. The Cardinal-Infante instructed the three commanders to launch their attacks simultaneously in order to prevent the Dutch from sending reinforcements to one point or another, and, if the enemy fortifications proved too strong for the States Army to be dislodged, to fortify the points that they managed to take and keep harassing the enemy with artillery and bombs.\nThe States Army initially had 6,000 to 7,000 infantry and 300 cavalry, or 5,700 men according to other reports. The foot soldiers included 8 companies of Count William's own Lower German regiment, 14 companies of the Scottish regiments of Balfour, Sandilands and Hamond; 7 companies of the Lower German regiment of Count Henry Casimir of Nassau-Dietz, 7 from the Walloon and Lower German regiment of Count Henry of Nassau-Siegen, 7 from the Regiment of Prince John Maurice of Nassau-Siegen, elder brother of William and governor of New Holland, 7 companies under Colonel Erhard von Ehrenreuter, and 7 of the Dutch Regiment of the Lord of Brederode, 57 companies in all, though other sources give a total strength of 63 foot companies and also note the presence of elements of the Noord-Hollands Regiment. The 4 cavalry companies were those of captains Brouchoven, Pierre du Four, Lord of Le Metz (French), Wingen, and Raoul van Oss. The States' artillery train included 15 cannons: six demi-cannons, six 6-pdrs and three 3-pdrs. William expected the imminent arrival of reinforcements, since Frederick Henry informed him on 18 June that he had dispatched Count Henry of Nassau-Siegen with 27 additional infantry companies to join him. Nevertheless, bad weather and opposing tides prevented the reinforcements from arriving in time.\nThe action of Kallo\nThe Spanish offensive started on 20 June at midnight. On the left, Cantelmo deployed his Spanish infantry on the right, the Italians on the left and the Germans and Walloons on the center. They advanced along the dike of Hulst and overpowered the Dutch defenders despite their stubborn defense. During the fight, Cantelmo gave a fire signal to Maestre de Campo Ribacourt to attack along the dike of Vrasene to distract the Dutch troops, while the cavalry was deployed in the field between the two dikes. Two cannons fired upon the Dutch entrenchments from the dike of Hulst. The States' troops were driven out five breastworks but offered a strong resistance at a redoubt in front of the fort Verrebroek. There, they repelled several assaults and inflicted heavy casualties upon the German and Italian infantry. The Duke of Avigliano was wounded in a knee by the splinters of a grenade, while Cantelmo, who rode to the front to encourage his soldiers, was lightly injured. The States' troops counter-attacked and pushed back the Spanish battalions. Cantelmo ordered a breastwork to be quickly erected to stop the Dutch infantry, while he directed the fire of his cannons upon the Dutch cavalry, which had to take cover behind the dike of Kallo. Additionally, he ordered gabions to be laid over the shallow water next to the dike to install there a second battery to fire upon the Dutch from the flank, as well as on any enemy boat that could approach from there. Under heavy pressure, the States' infantry withdrew from the dike of Hulst, where Cantelmo immediately deployed a vanguard of 1,000 musketeers. By 10 a.m. the Dutch infantry still held the fort and two breastworks in front of it, but had been rebuffed from all the other outer defenses, including a nearby tower.\nOn the right wing, the Count of Fuenclara, in the presence of the Count of Fontaines, dispatched his Spanish and Walloon infantry, led by the sargento mayor Baltasar de Mercader, against the Dutch entrenchments and, by midday on 21 June, had succeeded in expelling the States' troops from its outer works. Count William's troops still held the fort of Kallo and a hornwork which they had built in front of it. On the center, meanwhile, the Marquis of Lede, having sent Maestre de Campo Guasco to make a reconnaissance, dispatched a detachment of musketeers across the marshes to flank the Dutch while he advanced with his German and Italian infantry along the dike of Melsele. Together, they dislodged the Dutch infantry which was firing from behind the first breastwork over the dike, located 400 paces from Fuenclara's position. However, the second breastwork on the dike could not be taken because of depth of its ditch and the lack of tools to pour earth inside it. After twelve hours of combat, the Spanish called off their assaults to bolster the entrenchments that they had taken.\nBoth sides had suffered high casualties during the fight. Fuenclara's ranks were so depleted that the Cardinal-Infante reinforced him with 200 infantry from the citadel of Antwerp and four companies of cavalry, two of harquebusiers and two of cuirassiers. Men were given a break for the rest of the journey, while the Cardinal-Infante Ferdinand ordered a second assault to be carried out the following night. In the meantime, as the bad weather prevented Frederick Henry from sending reinforcements from Bergen op Zoom and his troops were exhausted and in a hopeless situation, Count William ordered his men to prepare to re-embark. At midnight on the 21st, the Spanish forces advanced upon the remaining outer works and found them abandoned. At first, it was suspected that the Dutch troops had withdrawn into the forts of Kallo and Verrebroek. However, scouts sent to make a reconnaissance reported that both positions had been abandoned. Under the cover of the darkness, the States' troops had moved in silence towards Doel and were boarding their boats to cross the canal that separated them from the island, though the low tide and contrary winds prevented them from escaping. They were soon spotted, and the Cardinal-Infante would order Cantelmo, Lede, and Fuenclara, having taken control of the abandoned forts, to dispatch their battalions and squadrons forward to attack the retreating Dutch soldiers from three sides. As no units had been left at the rearguard to cover the retreat, panic spread among the States' troops, which broke their ranks aiming at boarding the boats. Count William had already snuck to Doel, and his subordinates were unable to restore the order. Hundreds of Dutch soldiers threw their weapons and surrendered, while a large number of those who attempted to escape by swimming across the canal drowned.\nThe Dutch attempt at investing in Antwerp ended in a disaster from the west. 400 to 500 States soldiers died during the combats of June 20th, and another 2,000 during their attempt to escape, many of whom either killed on the banks or drowned. By the end of the battle, the Spanish had taken 2,370 to 3,000 prisoners, including two colonels – Ehrenreuter and Sandilands–, two lieutenant-colonels and 24 infantry captains, over 50 flags, 3 cavalry banners, 19 to 26 cannons, two frigates, two pontoons and 81 boats. The prisoners were taken to Antwerp or, by river, to Mechelen and Lier. Just 1,500 men made their way to fort Liefkenshoek, mostly nude and with no weapons. Count William fell ill on his arrival from exhaustion and depression following the loss of his son, and spent several days in bed. The Spanish army lost 284 men dead and 822 wounded.\nAftermath\nNews about the Spanish victory arrived in Antwerp on 22 June early in the morning. Its inhabitants reacted with joy, and many of them walked to Kallo to see the scenario of the victory. They returned with relics from the battlefield, including orange garlands that were put as trophies in the city's churches. Eight days later, the captured Dutch ships were sailed to Antwerp and moored at the Scheldt dock and the English quay, where a crowd of citizens watched their arrival. Many of the vessels had been built at Antwerp before being taken by the Dutch in 1631 at the Slaak during a failed attempt by a Spanish amphibious force led by Count John of Nassau-Siegen, an elder catholic brother of William, to capture Willemstad by surprise. A Te Deum was held shortly after at the Cathedral of Our Lady at Antwerp to celebrate the victory. The Cardinal-Infante attended while a crowd of people waited outside.\n'']]\nThe defeat at Kallo reduced the size of the States' army under Frederick Henry to 119 foot and 54 horse companies, plus the 27 under Henry of Nassau-Siegen intended to relieve the forces which had landed at Waasland, which were at Lillo. To replace the losses, the Prince of Orange ordered 30 infantry companies from various garrisons to be gathered at Gorkum. In the south, the French Army had left the siege of Saint-Omer on 12 July, though it remained in the area and, during August and September, besieged and took the minor towns of Renty and Le Catelet. While the Dutch remained passive, the Spanish launched a surprise attack over the State's cavalry camp near Wouw on 27 July, but it was rebuffed. Since the campaign season was not over, Frederick Henry considered undertaking an operation against the Spanish in the province of Upper Guelders, namely over Gennep or Geldern, as a mean of threatening Venlo and Roermond. The States' Army departed Bergen op Zoom on 11 August and moved to 's-Hertogenbosch, where it arrived two days later. On 14 July the prince received into the city Marie de' Medici, the exiled queen mother of France. He did not accompany her on her visit to Amsterdam but remained at 's-Hertogenbosch to reorganize the army. On 14 August, the States' troops took the way to Grave. In the meantime, Count Henry Casimir advanced over Geldern from Rheinberg ahead 50 foot and 9 cavalry companies and invested in the town. Having crossed the Meuse at Grave on 17 August, Frederick Henry and his army joined the siege on the night of 21 to 22 August.\nThe Cardinal-Infante Ferdinand, informed about the Dutch move, left Brussels for Scherpenheuvel and ordered the bulk of the Spanish forces that faced the Dutch to assemble at Venlo. Cantelmo was left with 3,000 men to defend Antwerp and the Waasland, while Ferdinand crossed the Meuse on 23 August with 12,000 soldiers. Since Ferdinand intended to relieve Geldern but the States' Army outnumbered him, he requested assistance from the Imperial troops under Guillaume de Lamboy, which Piccolomini had left in March to occupy the rebellious Free Imperial City of Aachen. On 25 August, Lamboy joined the Spanish army with 6,000 to 7,000 men. On their approach, Frederick Henry ordered the siege to be abandoned. The troops under Count Henry Casimir were caught between the Spanish relief force and the garrison of the town. 6 cannons and several hundred States soldiers were captured. The Dutch army withdrew to Nijmegen and then camped around Batenburg, Megen and Ravenstein, while the Cardinal-Infante led his troops to the Land van Cuijk, opposite to them. By early October, after a month of inactivity, both armies took their winter quarters. Frederick Henry went to The Hague, and Ferdinand to Brussels. A final, minor operation took place when a force of three foot regiments and 19 cavalry companies with six cannon, under the Marquis of Lede, laid siege to Kerpen on 18 October. This town was a Brabantian exclave in the Electorate of Cologne which the Dutch had occupied a few years ago and from which they levied war contributions and obstructed the trade in the area between the Rhine and the Meuse. The 300-man States' garrison surrendered on 20 October.\nBy the end of November, the delegates commissioned to negotiate the rescue of the States' soldiers captured at Kallo and Verrebroek reached an agreement at Roosendaal. The Spanish released the prisoners after the payment of a ransom consisting of two-month salaries of the captured troops, plus the amount of their manutention. The Spanish tried unsuccessfully to convince the German and Scottish troops to enter their service, but in the end, few of the prisoners rejoined the Dutch Army since many of them had died during their imprisonment because of its poor conditions.\nReception\nThe success at Kallo was joyfully received by the Spanish court. The Cardinal-Infante wrote to his brother Philip IV that it was \"the greatest victory which your Majesty's arms have achieved since the war in the Low Countries began\". Ferdinand believed that his position was stronger enough after his victories near Antwerp at Geldern to negotiate a truce with the Dutch Republic to detach it from France, and instructed Joseph de Bergaigne, bishop of 's-Hertogenbosch, to make the first moves. Olivares was satisfied since a truce would favour the chance of reaching a separate peace with the Dutch, and that would damage France's position. Emanuele Tesauro a poet and historian in service of the Prince of Carignano –second in command of the Army of Flanders–, wrote that 'the enterprise of Kallo had a great merit. The memory of Doel deprived the Dutch from the principal instruments which had led their enterprises to success, which were their reputation and the confidence they had on their courage'. From the military point of view, the disaster of William of Nassau-Siegen's force showed that the Republic could not besiege Antwerp until it gained a firm footing in Flanders. This would lead Frederick Henry to unsuccessfully focus, over the 1639 and 1640 campaigns, on the capture of Hulst.\nThe States' Army defeat at Kallo was reported by Amsterdam newspapers like Broer Jansz's Tijdinghe uyt verscheyde and Jan van Hilten's Courante uyt Italien, Duytslandt, &c. At first, Jansz gave little information about the circumstances of the setback, but, as Van Hilten, he later provided a more detailed description of the State's Army attempt to escape across the mud. In a letter to Frederick Henry, the Lord of Sommelsdijk, colonel of infantry and governor of Nijmegen, considered the defeat to 'affect more to your glory than to the interest and security of the State'. The public opinion was already critical of the army's command, which had spent the early months of the year feasting and attending at theatre plays at The Hague. Hugo Grotius, in particular, juxtaposed the lavish overspending of Orange's court with the suffering of the local farmers, caused by widespread floods. Diplomat William Boreel, poet Constantijn Huygens, secretary to the Prince of Orange, and official Nicolaas van Reigersberg, Grotius' brother-in-law, criticized the holding of a mock tournament where Henry d'Authon, Baron de Pontesière, a French captain in Dutch service disguised as a coward Spanish captain named Dom Ferrand Matamorbe of Seville, won two valuable prizes, which led Friedrich zu Dohna, a young German officer in Dutch service, to predict defeat in several key battles against the Spanish. In the aftermath of the 1638 campaign and the years following, Dutch soldiers, poets, and historians linked the figure of Dom Ferrand with the defeat at Kallo.\nLegacy\nThe battle of Kallo had a great repercussion in the Spanish Netherlands. Popular pamphlets attributed to the Jesuit poet Adriaan Poirters and to the journalist and humorist Richard Verstegan, entitled Den Hollantschen Cael-af van Callo and Den ghe-failleerden Facit, which gave humorous accounts of the battle and mocked the Dutch, were distributed shortly after. The battle is central as well in the treatise De Hierarchia Mariana by the Spanish Augustinian friar Bartolomé de los Ríos y Alarcón, who worked as a priest at the Brussels court from 1624 to 1641 and dedicated his work to the Cardinal-Infante Ferdinand. De los Ríos, who argued about the superiority of Mary over all creatures, attributed the Spanish victory at Kallo to the Virgin. The treaty is accompanied by Neo-Latin poems by different authors; one of them, Caloa, by Franciscus van den Enden, describes the battle of Kallo. The representation of the battle in the plastic arts was also influenced by the religious lecture of the event by De los Ríos. An engraving by Cornelis Galle shows the Cardinal-Infante kneeling at the feet of Mary with the burning battlefield in distance. Apparently, the Dutch Protestant troops had committed acts of blasphemy after occupying Kallo by smashing images of the patron saints Peter and Paul, and by burning a statuette of the Holy Virgin. Shortly after the battle, De los Ríos founded a Brotherhood of the Slaves of Our Lady of Victory at Kallo and commissioned a polychrome statue of Our Lady of the Victory to adorn its chapel. Many illustrious figures became members of the brotherhood, including the Cardinal-Infante, Anthonius Triest, bishop of Ghent, and Gaspard Nemius, bishop of Antwerp.\nAt Madrid, Olivares commissioned Juan de Palafox y Mendoza, chaplain to the empress Maria Anna of Austria, to write a chronicle of the Spanish military successes of 1638, among them the battle of Kallo, the reliefs of Geldern and Saint-Omer, and the conquests of Breme and Vercelli, in Savoy, though the most celebrated victory in Spain was that of Hondarribia, in the northern Spain, over the French. The Count-Duke also entrusted Virgilio Malvezzi to write his own version of the year's successes, which was published under the title La libra and that was openly intended at glorifying the Spanish Monarchy. There, the Bolognese historian stated that 'the year thirty-eight was the most glorious of this Monarchy [under Philip IV] because it started as the most dangerous', and attributed the Spanish victories to the divine design.\nThe Italian general Andrea Cantelmo, who had played a key role in the Spanish triumph, commissioned the battle painter Pieter Snayers, already in service of the Spanish Crown, to paint a large canvas depicting the battle, which is shown from the perspective of the force under Cantelmo, with the Spanish troops attacking the fort of Verrebroek in the foreground, and the fleeing Dutch soldiers and the fort of Kallo in the background. The battle is referenced in a genre painting by Jacob Jordaens, As the Old Sing, So the Young Pipe, which shows a merry company making music together. The song that they are singing, as seen in a music sheet, is entitled Een nieuw liedeken van Calloo. It celebrates the victory of the Cardinal-Infante and was widely distributed on broadsheets after the battle. The Antwerp town council commissioned Peter Paul Rubens not to paint a canvas, but to design a triumphal chariot about the victory of Kallo that was displayed a few months later at the city's Ommegang. Rubens, who had already designed the decorations for the entrance of the Cardinal-Infante to the city in 1635, was paid in wine. The chariot was meant to resemble a ship with its mast having been replaced by an accumulation of trophies, and which hosts a series of allegorical figures whose meaning was described by Gaspar Gevartius in the book Pompa Introitus Ferdinandi (1641). The ship is a symbol of Felicitas, while the figures on board personify Providentia, Virtus and Fortuna, plus Antverpia (the city of Antwerp) and Audomarum (Saint-Omer). Two Victorias hold civic crowns symbolizing the victory of Kallo and the raising of the siege of Saint-Omer. The remaining figures are chained Dutch and French prisoners. The trophies include suits of armour, shields, weapons and flags, accompanied by scrolls inscribed with the quotes De Gallis Capta Fugata ('captured from the French who were put on flight') and Caesis Detracta Batavis ('taken from the Dutch that have been defeated').\nNotes\nReferences\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*"
    }
  ]
}