{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Żarnów__disambig_1\n\nSwedish Empire\n| combatant2        =  Polish–Lithuanian Commonwealth\n| commander1        =  Charles X Gustav  Arvid Wittenberg\n| commander2        =  John II Casimir   Stanisław Lanckoroński   Aleksander Koniecpolski\n| strength1         = 6,000 cavalry4,500 infantry400 dragoons40 artillery pieces\n| strength2         = 6,000 cavalry900–1,500 dragoons and reiters3,000–4,000 levée en masse 6 artillery pieces\n| casualties1       = Very few\n| casualties2       = 1,000 killed\n}}\nThe Battle of Żarnów was fought on September 16, 1655, between the forces of the Polish–Lithuanian Commonwealth, commanded by John II Casimir and the forces of the Swedish Empire, commanded by Charles X Gustav. The result ended with a Swedish victory.\nBackground\nThe Swedish army captured Warsaw in late July 1655, after the Polish capital had been abandoned by King John II Casimir. Soon afterwards, the Swedes began chasing the Polish troops, who retreated southwards. On September 9, near Inowłódz, a unit under Stefan Czarniecki attacked the Swedish rear guard of 500, commanded by George Forgell. The Poles managed to kill some 200 Swedes, but this did not halt the advance of the invaders.\nThe Swedish army continued its march southwards, capturing and burning the towns of Inowłódz, Drzewica and Odrzywół. On September 12, the siege of Opoczno began. The town, lacking modern fortifications, quickly capitulated, and was almost completely destroyed, with only 20 houses left intact. A similar fate awaited other local towns: in Drzewica, only 21 houses remained, and only 22 in Odrzywół. Local residents were shaken by the barbarity of the Swedish invaders, as the northwestern corner of Lesser Poland had not experienced such vast destruction since the 13th century Mongol invasion of Poland.\nIn early September 1655, Polish forces loyal to John II Casimir concentrated near Wolborz. Charles Gustav decided to confront them, leaving Warsaw on September 12. Polish units in Wolborz consisted mostly of men raised by the  nobility through a levée en masse from Mazovia and northern Lesser Poland who was no match for experienced Swedish mercenaries. Since morale among the Poles was low, John Casimir planned to withdraw towards Kraków. The nobility disagreed with this plan, demanding to fight the invaders near their homes.\nOn September 15, the Royal Crown army and levée en masse units, altogether numbering some 11,000, reached Żarnów, where Polish king decided to personally face Charles Gustav. The Swedish army was of similar strength, but with more infantry and 40 artillery pieces, versus six Polish cannons.\nBattle\nAfter an attack by Polish cavalry was fought off by the Swedes, Charles Gustav ordered the infantry forward, with support from the artillery. The Swedes advanced, capturing a hill, which had served as a Polish defensive position. The Poles tried to prevent this, but facing Swedish fire superiority, they had to withdraw. Soon afterwards, Swedish cavalry entered the fray, but the battle was ended by heavy rain, which saved the Polish army from complete destruction. Retreating Polish units were chased by the Swedes, who captured the best soldiers and forced them to serve in the Swedish army. The nobility abandoned the battlefield and returned to their homes.\nAftermath\nThe Swedish victory opened the road to the province of Lesser Poland. Altogether, the Poles lost some 1,000 men. Those units that evaded capture marched towards Włoszczowa and Kraków, commanded by Stefan Czarniecki and King John II Casimir. The King, broken and defeated, reached Kraków on September 19. At first, John Casimir planned to defend the ancient Polish capital at all costs, but changed his mind and left the city, leaving it under the command of Czarniecki. A few days later, the Polish monarch crossed the Polish-Silesian border.\nOne of the hills located in Żarnów is still called Szwedzka Góra (Swedish Mountain), as, according to a legend, King John II Casimir watched the 1655 battle from this hill. The town of Żarnów itself was burned to the ground by the Swedes to such an extent that 21 years after the battle, the population of Żarnów was only 120, while before the battle, it had reached 1,000. The northwestern corner of historic Lesser Poland, which had until then been prosperous, was turned into a desert, and with other towns in the region, such as Opoczno, Inowłódz, Drzewica and Odrzywół, Żarnów never fully recovered: \"It is not an exaggeration to claim that the cataclysm of the Swedish Deluge can be compared with the barbarity of the Nazis in the Second World War\", wrote local historian Krzysztof Nawrocki.\nSwedish units\n1. Fab. Berns Dragoon\n2. Drottningens Reiter\n3. Fältm. Wittenbergs Reiter\n4. Wirtz Infantry\n5. Fersen Infantry\n6. Fältm. Wittenbergs Reiter\n7. Liv Reiter\n8. Königsmarcks Reiter\n9. Västerbotten Regiment Infantry (Cappelen)\n10. Närke Infantry (Essen)\n11. Hälsinge Regiment Infantry (Carl Larsson Sparre)\n12. Königsmarcks Reiter\n13. Lantgr. Fr. av Hessen Reiter\n14. Upplands Reiter\n15. Hälsinge Regiment Infantry (Karl Spare)\n16. Småland Regiment Infantry (Irwing)\n17. Upplands Reiter\n18. Fab. Berns Dragoon\n19. Smålands Reiter\n20. Smålands Infantry (Irwing)\n21. Smålands Reiter\n22. Sinclers Reiter\n23. Ridderhielms Reiter\n24. Västmanland Regiment Infantry (Drakenberg)\n25. Böddeker Reiter\n26. Västgöta Infantry (Scheiding)\n27. Pretlach Reiter\n28. Gr. Pontus De la Gardie Reiter\n29. Yxkull Reiter\n30. Ångermanland Infantry\n31. Engels Reiter\n32. Taubes Reiter\nTotal:\n* 6,000 cavalry\n* 4,500 infantry\n* 400 dragoons\n* 40 artillery pieces\nPolish units\n* 6,000 cavalry (Wojsko komputowe)\n* 900–1,500 dragoons and reiters\n* 3,000-4,000 pospolite ruszenie (levée en masse) from the voivodeships of Łęczyca, Kuyavia, Sieradz and Masovia\n* 6 artillery pieces\nSources\n* [http://hs.xon.pl/portal_zarnow/informacje/zrodla/bitwa_pod_zarnowem.pdf Pod Żarnowem - w czasach szwedzkiego Potopu. Kolejna rocznica historycznej bitwy, by Krzysztof Nawrocki (pdf format)]\nExternal links\n* [http://eksploratorzy.com.pl/viewtopic.php?f=45&t=17427 Photos of the Swedish hill in Żarnów]"
    }
  ]
}