{
  "content": [
    {
      "type": "text",
      "text": "# Battle on the Irpin River\n\nfor 1325.}}\n| place             = Belgorod Kievsky on the Irpin River\n| coordinates       =\n| result            = Lithuanian victory\n| combatant1        =  Grand Duchy of Lithuania\n| combatant2        =  Principality of Kiev\n| commander1        = Gediminas\n| commander2        = Stanislav of KievOleg of PereyaslavlLeo II of GaliciaRoman of Bryansk\n| strength1         =\n| strength2         =\n| casualties1       =\n| casualties2       =\n}}\nThe Battle on the Irpin River was a semi-legendary battle between the armies of the Grand Duchy of Lithuania and Principality of Kiev. According to the story, Gediminas, the Grand Duke of Lithuania, conquered Volhynia before turning his attention to Kiev. He was opposed by Prince Stanislav of Kiev allied with the Principality of Pereyaslavl and Bryansk. Lithuanians achieved a great victory and extended their influence to Kiev. There are no contemporary sources attesting to the battle. It is known only from late and generally unreliable Lithuanian Chronicles. Therefore, historians disagree whether it was an actual battle in the early 1320s or a fictional story invented by later scribes. Lithuanians gained full control of the city only in 1362 after the Battle of Blue Waters against the Golden Horde.\nAccount in the Lithuanian Chronicles\nAs told by the Lithuanian Chronicles, having made peace with the Teutonic Order, Gediminas marched against Volhynia. The Lithuanian Army successfully attacked and captured Volodymyr. Prince Vladimir (most likely an incorrect name for Andrew of Galicia) was killed during the battle. His brother Leo II of Galicia fled to his brother-in-law in Bryansk. The Lithuanian Army spent the winter in Brest and, the second week after Easter, marched against the Principality of Kiev. The Lithuanians captured Ovruch and Zhytomyr. At Belgorod Kievsky on the small Irpin River about  south-west of Kiev, Gediminas was stopped by the joint army of Stanislav of Kiev, Oleg of Pereyaslavl, Roman of Bryansk, and Leo II of Galicia. The Lithuanians achieved a decisive victory. Oleg and Leo were slain on the battlefield. Stanislav escaped first to Bryansk and then to Ryazan. Gediminas then captured Belgorod Kievsky and besieged Kiev for a month. Left without its ruler, Kiev surrendered. The Lithuanians also captured Vyshhorod, Cherkasy, Kaniv, Putyvl, as well as Pereiaslav. Algimantas, Mindaugas' son from the Alšėniškiai family, was installed in Kiev as Gediminas' viceroy.\nAnalysis\nInformation about the Lithuanian conquest comes from generally confused and unreliable Lithuanian Chronicles (second and third (Bychowiec Chronicle) redaction) and Ukrainian (Hustyn Chronicle) produced many years after the events. No contemporary sources directly corroborate the story. In the 1880s, Ukrainian historian Volodymyr Antonovych was the first to critically evaluate the chronicles and dismiss the campaign and battle as fiction. However, after careful analysis, modern historians believe that Antonovich was too critical and that there is some truth to the story.\nPolitical situation\nThe Kingdom of Galicia–Volhynia attracted Gediminas' attention early on; he attacked Brest in 1315 and arranged a marriage between his son Liubartas and Euphemia, daughter of Andrew of Galicia. After the attack in 1315, the Principality allied with the Teutonic Order, a long-standing Lithuanian enemy. A link between this alliance and the Lithuanian attack was suggested by Bronisław Włodarski. Galicia–Volhynia was also a rich land and offered access further south to Kiev. Letters of Gediminas from 1323 would suggest that commercial rivalry was a contributing factor in the attack. There were no known attacks by the Teutonic Knights on Lithuania between July 1320 and March 1322, which could indicate the peace mentioned in the chronicle. There was an attack on Lithuania by the Golden Horde in 1325; historians Feliks Shabuldo and Romas Batūra interpreted it as a direct reprisal for the Lithuanian expansion. The Lithuanian takeover of Cherkasy, Kaniv, Putyvl probably refers to a campaign led by Vytautas in 1392.\nIt is known that brothers Andrew and Leo of Galicia–Volhynia died sometime between May 1321 and May 1323. However, their death did not bring Lithuanian control to Galicia–Volhynia. The brothers did not have a male heir and were succeeded by Bolesław Jerzy II of Mazovia, son of their sister Maria, and not by Liubartas. Bolesław Jerzy was poisoned in 1340 bringing about the prolonged Galicia–Volhynia Wars that split the territory between the Grand Duchy of Lithuania and Kingdom of Poland. Contemporary sources also do not indicate that the brothers were slain by the Lithuanians. Swiss chronicler John of Winterthur recorded that they were poisoned by their rebellious subjects. In a letter to Pope John XXII, Polish King Władysław I the Elbow-high lamented that the death of Andrew and Leo left Poland vulnerable to an attack from the Golden Horde, and made no mention of a Lithuanian aggression.\nPersonal names\nNames recorded in the Lithuanian Chronicle are often confused. The Lithuanian Chronicle mentions Prince Vladimir of Volodymyr. No such prince was known at the time of Gediminas' reign; the last Prince Vladimir III Ivan Vasilkovich died in 1289. However, it is a conceivable error – a scribe might have accidentally transferred the name of the city to Prince Andrew of Galicia. The case for a simple mistake is bolstered by the fact that his brother's name is correctly recorded as Leo II of Galicia. Further, contemporary sources attest that brothers Andrew and Leo of Galicia–Volhynia died sometime between May 1321 and May 1323. Roman of Bryansk was a 13th-century prince; Dmitry Romanovich was Prince of Bryansk at the time. It could also be explained as an error and confusion of the patronymic name with the first name of a more famous predecessor. There is no evidence to prove or disprove whether Leo and Dmitry Romanovich were brothers-in-law. Historians had suggested that the three names were borrowed from an earlier campaign: the Galician–Volhynian Chronicle recorded a 1274 battle between the Lithuanians and Vladimir of Volodymyr, Leo I of Galicia, and Roman of Chernihiv and Bryansk at Drahichyn. However, historian S. C. Rowell found no other textual similarities between the 1274 battle in the Codex and the 1320s campaign in the Lithuanian Chronicles.\nNothing can be said about Oleg of Pereyaslavl as nothing is known on princes of Pereyaslavl after its devastation in 1240 during the Mongol invasion of Rus'. Stanislav of Kiev is not found in any other sources and cannot be easily explained as an error. The Lithuanian Chronicles mention that he escaped to the Principality of Ryazan where he married a daughter of the local prince and succeeded to the throne. That contradicts known facts that Ivan Yaroslavich of Ryazan was succeeded by his son Ivan Ivanovich Korotopol in 1327. S. C. Rowell found a mention of Ioann Stanislavich who, Rowell extrapolated, could have been a prince of Vyazma and son of Stanislav of Kiev (Stanislav is not a common name among East Slavs). The genealogy of the Shilovskys (:ru:Шиловские), a boyar family from Ryazan, mentioned that they fled Kiev with Stanislav. If nothing else, this mention in the genealogy proves that the story of the Battle on the Irpin River well predates the chronicles.\nAlgimantas, son of Mindaugas from the Alšėniškiai family, is the only Lithuanian, other than Gediminas, mentioned by the Lithuanian Chronicle. A list of Olshanskis found in the Pskov-Caves Monastery mentions Algimantas (Olgimont) who was baptized as Michael. His son Ivan Olshansky was a prominent noble in the Grand Duchy and, in 1399, became viceroy in Kiev after Skirgaila's death. Historians struggled to reconcile Algimantas with Fiodor (Theodore) mentioned in 1331. At the time, newly consecrated archbishop Basil Kalika traveled from Volodymyr home to Novgorod. He was stopped by Prince Fiodor of Kiev, a Tatar basqaq (tax collector), and fifty warriors. In 1916, new evidence was published that Fiodor was a brother of Gediminas and historians reinterpreted that the 1331 incident shows that Fiodor was still paying a tribute to the Mongols. Lithuanians gained full control of the city only in 1362 after the Battle of Blue Waters against the Golden Horde.\nNotes\nReferences\nBibliography\n*\n*\n*\n*"
    }
  ]
}