{
  "content": [
    {
      "type": "text",
      "text": "# Battle of San Mateo (1814)\n\nBattle of San Mateo}}\n|map_type    =\n|map_relief  =\n|latitude    =\n|longitude   =\n|map_size    =\n|map_marksize =\n|map_caption =\n|map_label   =\n|territory   =\n|result      =Republican victory\n|status      =\n|combatants_header =\n|combatant1  = Second Republic of Venezuela New Granada\n|combatant2  = Spanish Empire\n|commander1  = Simón Bolívar   Vicente Campo Elías  Manuel Villapol  Antonio Ricaurte\n|commander2  =José Tomás BovesFrancisco Tomás Morales\n|units1      =\n|units2      =\n|strength1   = Crichfield: 1,500 infantry, 600 light cavalry.   Clodfelter: 2,000–2,500\n|strength2   =Crichfield: 2,000 infantry5,000 light cavalry Clodfelter: 8,000–12,000\n|casualties1 =Lecuna: 90 killed Clodfelter: ~1,200 killed or wounded Mosquera: 1,700 killed or wounded\n|casualties2 =Lecuna: 800–1,000 killed or wounded Clodfelter: ~2,000 killed or wounded, 1,000 prisoners\n|casualties3 =\n|notes       =\n|campaignbox =\n}}\nThe Battle of San Mateo was a series of battles in the Valleys of Aragua in what is now Venezuela, during the Venezuelan War of Independence between 28 February and 25 March 1814.\nPrelude\nIn early 1814, Royalist commander José Tomás Boves had gathered a large army, composed of Llanero's, Indigenous warriors and liberated slaves.\nOn 3 February, he began his advance through the valleys of Aragua, thus threatening Caracas and Valencia. He defeated Vicente Campo Elías at La Puerta in Guárico.\nBattle\nOn 28 February 1814, his first cavalry detachments arrived in the surroundings of the city of San Mateo and assaulted the trenches that defended the entrance to the valley, but the narrow terrain and the concentration of the Republican fire caused many casualties among the llaneros who were forced to retreat.\nThe next morning, Boves, who had also arrived at San Mateo, ordered the cavalry to go up to Puntas del Monte, a series of hills that were on the left wing of the defenders, from there the llaneros charged several times but again suffered many casualties by the well-entrenched defenders.\nThe futility of a cavalry charge against the Republican lines made Boves think of a plan that would allow him to obtain the Republican ammunition depot in the \"upper house\" of Bolívar's sugar mill to arm his men, most of whom only had spears.\nSelf-sacrifice of Ricaurte\nThe main house of the San Mateo estate, property of Simón Bolívar, was placed under the custody of Ricaurte and a small troop of fifty soldiers. During the Royalists' attack on 25 March, the army under the Royalists' Second Commander Francisco Tomás Morales took hold of most of the estate, including the main house, which was used as the principal ammunition depot.\nRealizing that the battle of San Mateo would be lost if the main house fell into the hands of the Royalists, Captain Antonio Ricaurte ordered his men to leave, and lit a barrel of gunpowder inside one of the ammunition storage facilities of the main house, thus killing himself and a large number of the Royalist troops which were readily occupying the precincts.\nDuring the momentary disorder which followed the explosion, Bolívar seized the opportunity and launched an attack to regain control of the main house and later the whole of the estate.[http://www.glrbv.org.ve/Proceres%20Masones/Antonio%20Ricaurte.htm Antonio Ricaurte]\nThe Battle of San Mateo ended with the victory of the Patriots' army. It was later estimated the Royalists lost more than ten times as many soldiers as the Patriots during the battle.[http://www.simon-bolivar.org/bolivar/bat_sn_mateo.html La Batalla de San Mateo]\nBolivar lost two of his most important commanders : Vicente Campo Elías and Manuel Villapol.\nReferences"
    }
  ]
}