{
  "content": [
    {
      "type": "text",
      "text": "# Battle of the Scarpe (1918)\n\n|result= Canadian Corps victory\n|combatant1= British Empire\n*  Canada\n|combatant2= German Empire\n|commander1= Julian Byng Arthur Currie\n|commander2=\n|strength1=\n|strength2=\n|casualties1= : 5,500 casualties\n|casualties2= Canadians captured 3,300 prisoners, 53 guns and 519 machine guns\n|campaignbox =\n}}\nThe Battle of the Scarpe was a World War I battle that took place during the Hundred Days Offensive between 26 and 30 August 1918.[http://www.collectionscanada.gc.ca/firstworldwar/025005-1500-e.html War Diaries – Canada and the First World War – Library and Archives Canada]\n26 August\nThe Canadian Corps advanced over 5 kilometres and captured the towns of Monchy-le-Preux and Wancourt.\nLieutenant Charles Smith Rutherford VC MC MM from the 5th Canadian Mounted Rifles of the 3rd Canadian Infantry Division performed actions that earned him the Victoria Cross. He captured a German party of 45, including two officers and three machine-guns, then captured another pillbox along with another 35 prisoners and their guns.\n27 August\nHeavy rains during the night resulted in slippery ground, difficulties in assembling troops and late starts for the assaults. Stiff resistance from the Germans and their heavily defended positions limited gains to around 3 kilometres.\n28 August\nThe 2nd and 3rd Canadian Infantry Divisions seized an important portion of the German Fresnes–Rouvroy defence system after three days of intense fighting. Total casualties were reported as 254 officers and 5,547 other ranks. They captured more than 3,300 prisoners, 53 guns and 519 machine guns.\nLieutenant-Colonel William Hew Clark-Kennedy, 24th Battalion, 2nd Canadian Infantry Division, earned a Victoria Cross by personally driving the advance despite being severely wounded, and suffering from intense pain and loss of blood.\nLieutenant-Colonel A. E. G. McKenzie, Commanding Officer of the 26th (New Brunswick) Battalion, was killed during action on 28 August. He was posthumously awarded a bar to his Distinguished Service Order.\n29 August\nBrutinel's Brigade, the first fully motorized brigade in the British Empire armies, advanced the front line by approximately one kilometre by seizing Bench Farm and Victoria Copse. The Canadian Corps Cyclist Battalion established posts right up to the Scarpe River.\n30 August\nSoldiers from the Canadian Corps cleared portions of the Fresnes–Rouvroy trench system, including Upton Wood. After holding all day under heavy fire, they drove off a German counterattack, capturing 50 prisoners and five machine guns in the process.\nSee also\n*Battle of the Scarpe (disambiguation)\nReferences"
    }
  ]
}