{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Launac\n\nThe Battle of Launac took place on 5 December 1362. It was the culmination of a long running feud between the French aristocratic families of D'Armagnac and Foix-Béarn. The chief protagonists were Jean, Comte d'Armagnac and Gaston Fébus of Foix. The result was a major victory for Gaston Fébus.\nThe armies\nD'Armagnac's army consisted of men from his territories, some powerful Gascon noble families, such as the D'Albrets, and mercenary free companies. Foix fielded a force of his vassals and a larger number of free company mercenaries, including German, Gascon and English troops. D'Armagnac's forces were mostly mounted men-at-arms, those of Foix also featured men-at-arms but significantly had more infantry, including a contingent of English longbowmen. D'Armagnac's army outnumbered that of Foix but actual numbers are unknown.\nThe battle\nDetails of the battle are somewhat lacking. The battle began in the morning and was over by midday. D'Armagnac launched a mounted charge on the Foix army. This was first held, then defeated by Foix's archers who were hidden in a copse to the rear of the enemy and emerged to launch volleys of arrows, killing many horses. The Armagnacs then fled.\nAftermath\nThe battle is particularly notable for the fact that Foix captured the majority of the Armagnac leaders, who were put to ransom. This brought Gaston Fébus vast wealth. The ransom of Jean d'Armagnac alone was 300,000 florins and surviving records show that the minimum ransom collected overall was 600,000 florins, an amount of gold weighing over 2 tonnes. Contemporary chroniclers estimated it higher still. It is believed that the nephew of D'Armagnac, the Lord of Albret, was ransomed for 100,000 florins, the Count of Comminges was ransomed for 50,000 florins, and the average knight, ransomed for 1,500 florins. The debt was mainly repaid by the sale of two strategic seigniories between Bigorre and Comminges.\nSo great was the triumph that Gaston Fébus decreed the anniversary of the battle should be celebrated annually across his territories. The chronicler Jean Froissart was a guest at the 28th anniversary celebration and recorded religious processions and solemn feasts.\nReferences"
    }
  ]
}