{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Refugio__disambig_1\n\n| map_label         = approximate location of the battle\n| date              = March 12–15, 1836\n| place             = near Refugio, Texas\n| result            = Mexican victory\n| combatant1        =  Mexico\n| combatant2        =  Republic of Texas\n| commander1        =  José de Urrea Juan José Holzinger\n| commander2        =  Amon B. King William Ward\n| strength1         = 1,500 men\n| strength2         = 148 men\n| casualties1       = No Data\n| casualties2       = •16 killed, 15 executed during the battle  •81 captured one week later, 55 of them executed at the Goliad Massacre and 26 spared execution\n}}\nThe Battle of Refugio was fought from March 12–15, 1836, near  Refugio, Texas.  Mexican General José Urrea and 1,500 Centralista soldiers fought against Amon B. King and his 28 American volunteers and Lieutenant Colonel William Ward and his approximately 120 Americans. The battle, a part of the Goliad Campaign of the Texas Revolution, resulted in a Mexican victory and splintered Texan resistance.\nBackground\nUnder President Antonio López de Santa Anna, the Mexican government began to shift away from a federalist model to a more centralized government. His increasingly dictatorial policies, including the revocation of the Constitution of 1824 in early 1835, incited federalists throughout the nation to revolt.  The Mexican army quickly put down revolts in the Mexican interior, including a brutal suppression of militias in Oaxaca and Zacatecas. Unrest continued in the Mexican state Coahuila y Tejas.  The area that bordered the United States, known as Texas, was populated primarily by English-speaking settlers, known as Texians.  In October, the Texians took up arms in what became known as the Texas Revolution. The following month, Texians declared themselves part of a state independent from Coahuila and created a provisional state government based on the principles of the Constitution of 1824.  By the end of the year, all Mexican troops had been expelled from Texas.\nDetermined to quash the rebellion, Santa Anna began assembling a large force to restore order; by the end of 1835, his army numbered 6,019 soldiers.   In late December, at his behest, the Mexican Congress passed the Tornel Decree, declaring that any foreigners fighting against Mexican troops \"will be deemed pirates and dealt with as such, being citizens of no nation presently at war with the Republic and fighting under no recognized flag\".  In the early nineteenth century, captured pirates were executed immediately. The resolution thus gave the Mexican Army permission to take no prisoners in the war against the Texians.  Santa Anna personally led the bulk of his troops inland to San Antonio de Béxar and ordered General José de Urrea to lead 550 troops [additional units would follow] along the Atascocita Road toward Goliad. Urrea's mission objectives were twofold, first, protect the Mexican Army's southern flank. Secondly, clear the Texas Gulf Coast and occupy the various ports. This operation would intercept and stop the ongoing flow of men and supplies, isolating the Texas rebellion. Although Urrea eventually achieved his objectives, delays and high casualties prevented the General and his men from giving General Santa Anna's main force important support. This operation and successful suppression of the rebellion along the Texas Gulf Coast have become known as the Goliad Campaign.\nPrelude\nColonel James Fannin and his  men had improved the fortifications at the old Presidio La Bahía and renamed it \"Fort Defiance.\" News of the fate of Texians under Frank W. Johnson at the Battle of San Patricio and James Grant at the Battle of Agua Dulce (both captured in earlier fights) created confusion rather than stirring the volunteers gathered at Goliad into action.\nOn March 7, Lewis Ayers brought Fannin news from Refugio, a town  south of Goliad.  The week before, the Victoriana Guardes, a group of Tejano (native Mexican residents) who supported centralism, had ransacked the town.  After destroying much property, the Guards, a militia under the command of Captain Carlos de la Garza, made camp just outside the town.  Several pro-independence Anglo families, including Ayers' wife and children, remained in the Refugio area, afraid that if they stayed they would be captured by the Mexican army, but that if they left they would be harmed by de la Garza's men.\nFannin agreed to send troops to evacuate the settlers as soon as oxen and carts were available to assist with the transport.  Three days later, the army's carts returned from Port Lavaca with supplies for the garrison.  As soon as they were unloaded, Fannin called for volunteers to go to Refugio.  On March 11, Captain Amon B. King led 28 men of his company and most of the carts to evacuate the settlers.  They arrived that evening and camped for the night at Mission Nuestra Senora del Refugio, where some of the Anglo families had taken refuge. The Mexican Catholic Church had abandoned the mission some years earlier. The mission was a semi ruin. No priests or other church officials were stationed at the old mission. Irish immigrant settlers from the Refugio area had recently repaired the main building's roof, doors, and windows. They repaired pews and other interior furnishings and furniture. Although these repairs were crude and very basic, they made it possible to hold services when a priest could be found.\nThe following morning, King led his troops to the ranch of Esteban Lopez, where the family of Lewis Ayers was staying.  King arrested six Tejanos he had heard were ransacking abandoned homes.  After he learned that other Tejanos were plundering homes about  south, King took half of his men on an unauthorized mission to pursue them.  They rode into an ambush staged by a group of de la Garza's men and Karankawa Indians.  The Texians extricated themselves from the fight and returned to the Lopez ranch.  All of the families gathered there were then escorted to the mission in Refugio.\nElements of Urrea's advance cavalry arrived in Refugio shortly after King and the families returned to the mission.  Mexican troops and de la Garza's Guards (approx. 100 total troops) surrounded the mission.  King sent a messenger to Fannin, asking for reinforcements.\nEarlier that day, Fannin had received notice that Mexican troops had taken the Alamo, killing all of the defenders.\nBattle\nFannin dispatched Lt. Colonel William Ward, a fellow Georgian, an organizer, and former commander of the Georgia Battalion. This unit and a company commanded by    Captain Peyton S. Wyatt, attached to the Georgia Battalion, would make up the balance of the relief column. The men departed in the early morning hours of the 13th of March. Fannin had decided to evacuate his position as soon as King and Ward returned. He ordered Ward to make all haste; avoid offensive contact with the Mexicans, gather the civilians, and return as soon as possible. To facilitate rapid movement, the Georgia Battalion carried only 36 rounds of ammunition per man as extended fighting was not expected.  The column arrived in the early afternoon of the same day after a forced march over muddy roads. Ward found the mission under attack by some Mexican Cavalry and local Mexican militia. These forces retired after the Georgia Battalion fired one or two volleys.\nAlthough successful in breaking up the siege on the 13th, the arrival of Ward at Refugio led to conflict over command with Captain King who insisted, as the first commander on the scene, he should be in charge of the combined force, even though Lt. Colonel Ward was his regimental executive officer and outranked him. Ward insisted, after a short rest, the Georgia Battalion, King's Company should gather up the civilians and evacuate the Refugio Mission, returning to Goliad. King refused and stated he was taking his men to attack a ranch believed to be providing support for Captain Carlos de la Garza and the Mexican militias forces. The tense confrontation resulted in a stand-off. King departed with his men and a few of the members of the Georgia Battalion (primarily from Wyatt's Company). The possibility of plunder and revenge was just too powerful for some. King and his men departed the mission in the early morning hours of the 14th. The failure of the King to accept the orders directly from Fannin would have great ramifications for Fannin's entire command. 8.\nAfter King departed, more of Urrea's troops continued arriving and slowly, again, fully invested in the mission. Sometime, late on the 13th or early morning hours of the 14th, a party of men under Captain Wyatt left the mission on patrol. They found a small group of Mexicans, probably militia, asleep and attacked, driving them away and killing 20-25 of the enemy.  Early on the morning of the 14th, after King had departed, the Georgians heard firing in the distance. Thinking King may need assistance, Ward ordered two companies of the Georgia Battalion to form ranks and slowly move forward. The formation of 50-60 men halted after only 100 to 200 yards. To their front, the Georgians found a large formation of regular Mexican Army and were forced to return to the mission. Soon after, a water party from the mission came under fire but was successful in bringing a large quantity of water back to the mission. As the Mexican Army maneuvered around the mission, Ward's men, under sporadic fire, attempted to further fortify the Refugio Mission complex. Ward assigned his 2nd company (Bullock's Company, (Captain U. J Bullock was absent. suffering from a case of measles, he had been left on the Texas coast and was never reunited with his company)), First Sergent Francis Marion Hunt of Macon Georgia commanding, to a low rock wall, part of an animal corral, to the east of the Mission building. This was necessary to cover the approach to the mission as the low wall blocked the view of the approaches to the mission. The rest of the Georgia Battalion manned windows and dug some loopholes in the church's walls. For the most part, due to their ammunition shortage, the men did not return the Mexican fire.\nBefore King advanced far, he found a far stronger Mexican military presence in the area and was forced to halt and find concealment in a wooded area approximately 2 miles from the mission. Before long, Mexican local militia under the command of Carlos de la Garza discovered the small Texian force and firing broke out. Sometime later, King's command heard gunfire in the direction of the mission. The Mexican militia force had been content to engage the Texian force at some distance and the fire had been ineffective. King and his force began to move in the direction of the mission using cover and partial concealment of the terrain trees.  But again, the company was forced to halt as units of the regular Mexican Army joined the attack. King's force, behind trees and rocks, made an effective defense for a time, causing severe losses to the enemy finally running out of ammunition. Mexican accounts state a wounded King and his men surrendered to Garza's militia. They were turned over to regular Mexican forces and executed near the Refugio mission on the 15th or early on 16 March 1836. King's men were left where they fell.\nBack at Refugio Mission on the morning of the 14th. Mexican Army units continued to arrive adding their musket fire to attack the mission. This fire was largely ineffective at first. The shooting continued for at least another hour as the Mexicans slowly maneuvered closer to the mission. Due to the shortage of ammunition, Ward ordered his command to hold their fire until the enemy came closer. Soon, a small cannon joined in but the thick stone walls of the mission could not be penetrated. When Mexican troops began to mass in the open 200 to 300 yards distant, the Georgians opened fire with their rifles with great effect and continued to take a toll as Urrea's troops advanced both on foot and mounted. The attack was well coordinated with multiple regimental and battalion-sized units attacking different points of the mission's perimeter. In some places, Mexican formations reached the low stone perimeter wall that surrounded the Mission. But none reached the church or crossed the far wall defended by Bullock's Company. The Georgia Battalion turned back 3, possibly 4, major attacks. At least 2 were focused at the low stone wall to the east of the mission. Samuel Hardaway, a 15-year-old native of Macon Georgia native, and L. T. Pease, also from Macon Georgia, were members of Bullock's Company and two of the few who survived the battle and the war. Both published narratives concerning their service. Pease states in his narrative he and the rest of Bullock's Company were stationed on the low stone wall east of the mission. Both he and Samuel Hardaway describe heavy fighting with the ranks of the enemy coming very near to the wall before melting away from the Georgian's fire. The ground was littered with many of the dead and dying. Witnesses report only three members of the Georgia Battalion were wounded. One soldier's wound appeared mortal. Another was shot in the leg and could not walk. Lastly, Colonel Ward had been struck by falling masonry dislodged by cannon fire. Estimates of Mexican casualties vary from 150 to 600 wounded and killed. General José de Urrea, the commander of this wing of the Mexican Army, reports seemed to change over the years following the war. His first reporting claimed around 200 killed and wounded. Those present on the Texas side also vary. From a low of 150 to as high as 600 are reported. Unit rosters of Urrea's force before March 12 and after March 17 show a decline of over 300 fits for duty on the 17th. Mexican casualty reports do not include losses for Mexican militia units who fought this day. These units were in skirmishes and or full-scale battles from the 12th to the 20th of March. Ward sent courier James Humphries and at least one other to Fannin for orders as the fighting slowed on the evening of the 14th. Late on the 14th, Edward Perry, a Texas prisoner of the Mexican Army, was sent by General Urrea with a surrender demand. He told Ward both his couriers and one sent by Fannin had been intercepted by Urrea. He also forwarded a letter from Fannin, captured from Fannin's messenger. This letter ordered Ward to fall back to Victoria, where Texas forces were to regroup.\nDuring that long day of the 14th, Mexican units continued to arrive. By evening Urrea had concentrated a force estimated to number 1200 soldiers, infantry and cavalry, 100-200 Mexican Mounted Militia, and several pieces of artillery were deployed. General Urrea made no secret of his numbers, hoping to force a surrender by intimidation. The Georgian had a front-row seat to the pageantry of the bands and deploying units. Despite the ever-increasing strength of his foe and aware the Georgia Battalion could expect no help, Ward sent Mr. Perry back to Urrea with his answer. \"The Georgians would not surrender.\"\nWith his supply of bullets and powder almost exhausted, Ward made plans to comply with Fannin's orders. That night or in the early morning hours of the 15th of March, in a driving rainstorm, the Georgia Battalion, carrying their rifles, a very few rounds of ammunition, and little else, quietly made their way through Mexican lines without notice of Mexican sentries. The wounded and at least one other healthy member of the unit, civilians, and approximately 25 Mexican prisoners (unharmed) would remain behind. Ward and the bulk of his men escaped toward Copano, then turned at Melon Creek and headed for Victoria.\nAt Refugio Mission, Mexican forces were not aware of their foe's escape until daylight when the former Mexican prisoners left the mission. The wounded and Anglo civilians braced for the arrival of the Mexican Army. While those remaining in the mission were searched and systematically robbed of any valuables, Mexican officers soon arrived on the scene and restored order. The wounded were protected (for a time) from ill-treatments by common soldiers and women and children were made safe. Later, some of the common soldiers returned and executed the wounded. It is not known if they were acting under orders. Some historians believe the good treatment of the former Mexican prisoners helped to assuage, at least in part, the Mexican Army's desire for retribution.   Juan José Holzinger, a German-Mexican officer, saw fit to save Lewis T. Ayers, Francis Dieterich, Benjamin Odlum, and eight men from local families. The families who feared injury or death by Mexican forces were allowed to return to their homes unharmed. Events proved the rescue attempts by King's company and the Georgia Battalion unnecessary.\nTo avoid Mexican cavalry, Ward and his men were forced to travel among the trees and heavy undergrowth along the creeks and many swamps. They waded in hip-deep water for hours each day. Rain was frequent and the nights cold in these days of late March. Soldiers were forced to rest and sleep in trees. The command continued for days eating frogs, snakes whatever they could find. They did find and shoot a cow and rested for a time but were forced to return to the swamps upon the approach of Mexican forces. Although unfamiliar with the terrain, they struggled toward Victoria where it was thought Fannin should be. Survivors reported hearing gunfire in the direction of Coleto Creek two days before they neared Victoria. Men began to struggle and became lost or simply did not wake up until the Battalion had moved on. Some of these men would prove to be the lucky ones but many of the lost were found by Mexican forces who rarely took prisoners. At Victoria, they found no time for rest; it was overrun with Urrea's troops. The group was forced to scatter after a short skirmish with Urrea's cavalry. Staying off the main roads, they moved toward Lavaca Bay, with ten of them eventually escaping. The remainder were surrounded and captured on March 22 by Urrea, two miles from Dimmit's Landing. Informed of Fannin's surrender, Ward and the men of the Georgia Battalion were promised surrender on the same terms given to Fannin's command at Coleto Creek. They were marched back to Victoria, where Holzinger again saved twenty-six men, by conscripting them as laborers for Urrea. Urrea had left Colonel Telesforo Alavez, in charge of Victoria. Señora Francita Alavez intervened with her husband as well, to make sure the captive laborers' lives would be saved.  The remainder were sent to Goliad by March 25, joining a wounded Fannin and the rest of the Goliad garrison. Two days later, the men were told they would march to the Texas coast and freedom, instead, they have marched a mile away from their former fortress and were shot under direct orders of General Santa Anna. Out of the 81 total soldiers under Ward's command that escaped Refugio 55, including Ward, were executed and 26 were saved by Señora Alavez and Colonel Alavez.\nOverview and outcome\nKing and, later Ward, failed their attempt to evacuate the Anglo civilians at Refugio. Their ultimate fate was virtually guaranteed by King's willful disobedience of his superior officer's orders (and  Fannin's clear instructions). Colonel Fannin's waiting for the return of a significant portion of his command also allowed General Urrea to overtake the rest of the Texas forces under his command on the road to Victoria at Coleto Creek. General Urrea could still have caught and defeated a united and stronger force if King and Ward had escaped Refugio and reunited with Fannin. A larger force would probably further increase Mexican's losses but likely would not have changed the outcome. Fannin had received orders from General Sam Houston while King and Ward were away that directed him to evacuate Goliad and retire to Victoria as soon as possible. A timely withdrawal and ultimately, reinforcement with substantial numbers of troops would allow Fannin to remain on the field as an effective fighting force.  Reluctant to leave before the various detachments returned, Fannin failed to leave Goliad ahead of Urrea's advance, leading to the Battle of Coleto. Fannin, in his short period of command, had demonstrated a slowness and lack of basic organizational skills necessary to move a large military force any distance. But the failure of this Texan force to move was not entirely his fault. The revolutionary government had failed to provide the transport and basic supplies necessary to transform a static garrison trained and equipped only for defense in place. Even if not delayed, Fannin's attempt to join with Houston was not a certainty.\nThe sacrifice of the Texas volunteers at Refugio and Coleto Creek did result in severe damage to General Urrea's command and greatly delayed his advance, preventing his force from supporting the main army at San Jacinto. Additionally, Lt. Colonel Ward's successful breakout and withdrawal from the Refugio Mission during the night of 14–15 March 1836 and the 7-day retreat across rivers and through numerous swamps and bayous should be recognized as a notable military achievement. Ward, his officers, and non-commissioned officers were able to preserve unit integrity for the most part. Poorly equipped and clothed, lacking adequate food, the men of the Georgia Battalion continued to act in concert as a military unit and fighting force for the Texas cause. General Urrea was forced to deploy hundreds of his men to find and destroy the Georgians. Ward and the Georgia Battalion were able to fight off and successfully break contact with at least two Mexican Cavalry units and continue their march towards Victoria. Colonel Ward complied with Fannin's orders to reach Victoria. A feat Fannin, with a much larger force and a shorter distance to travel, could not do. When Ward found Victoria in the hands of the enemy, he continued to reach a haven for his men and came within two miles of Dimmit's Landing before being overtaken and again surrounded by a force of regular Mexican Army troops. Surviving witnesses state the Georgia Battalion, using the very last of their ammunition, bayonets, and their rifles as clubs fought off one last attack. General Urrea only then offered surrender terms, the same terms that vaguely offered a chance of parole and repatriation to the United States accepted by Fannin a few days earlier. Ward felt his men could again reach the timber and swamps and continue their march and told his officers he was against surrender. But the Georgia Battalion was a volunteer unit and he let his officers and men decide. Hungry, tired, and suffering from exposure, the men voted to accept the Mexican General's terms.  Though Ward's leadership, the Georgia Battalion continued as an effective fighting force for one very valuable week against an enemy force that was 12 times their number. Seven more days for Houston and his Army.\nLegacy\nIn the public square across the street from the county courthouse in Refugio, the King Monument stands as an honor to Captain King and his men. In the early 1900s, the square was owned by the State of Texas and was named King's State Park. In the 1850s the Texas Governor and Legislature agreed, in exchange for the sacrifice of the young Georgians and to repay Georgia for weapons and military supplies provided to Texas, and to Georgia's request a monument be erected to honor the Georgia Battalion, the state would pay for a monument to be erected in Texas. For a time, Texas plead poverty. Then construction and Texas again delayed the promised monument. Georgia still waits, but, to this day, the state of Texas has not satisfied this debt of honor. However, the city of Albany, Texas constructed a fountain as a monument to Ward and the Georgia Battalion in 1976.\nSee also\n*List of Texas Revolution battles\nReferences\nBibliography\n* originally published 2004 by New York: Free Press\n*\n*\n*\n*\n*\n*"
    }
  ]
}