{
  "content": [
    {
      "type": "text",
      "text": "# BattleTech Trading Card Game\n\nThe BattleTech Trading Card Game is an out-of-print collectible card game (CCG) set in the BattleTech universe. The game was developed by Wizards of the Coast (WotC) for FASA and released in 1996. It went out of print after its last expansion, Crusade, in 1998.\nDescription\nThe BattleTech Trading Card Game was designed by Richard Garfield, the designer of Magic: The Gathering; both games use a similar style of gameplay and card distribution. It was produced from  November 1996 through 2001, and features BattleMechs, characters, and technology from the original BattleTech board game, with new artwork done by various artists.\nGameplay\nThe goal of the game is to make your opponent run out of cards from their stockpile (deck of cards). The one without any cards left loses the game. The most basic way of achieving this is to attack your enemy's stockpile with mechs and other units.\nEach player will need a deck with a maximum of 60 cards. Those decks can consist of any combination of cards the player desires, although when playing with official FASA rules, choosing cards for your deck will be limited, e.g. only cards from one faction/clan. The right assortment of cards can prove vital to victory and is mostly linked to certain tactics.\nTurn sequence\nThe turn sequence is divided into 6 phases, played in the following order.\n* Untap\n* Draw\n* Repair/reload\n* Deploy\n* Mission\n* End of turn\nDuring the deploy phase, you will use special command cards (Command Resource) to buy off the costs of units and other command cards like pilots, political personalities and structures. Once they are paid for, they are put into play (deploy) and can be used to attack your opponents or gain tactical advantages. While attacking certain targets during a mission, your units can be aided by mission cards (which may be played as an instant) that give them the edge in fighting your enemy and his or her units.\nCard types\n* Unit, including mechs, battlesuits and vehicles\n* Command, including resource, structures and pilots\n* Mission, aka instants\nSets\nThe game was released in November 1996 with a Limited base set (with black bordered cards), followed by Unlimited base set in February 1997 (with teal-blue border).\nAfter that, the game released several expansion sets:\n* Counterstrike (April 1997)\n* Mercenaries (August 1997)\n* Mechwarrior (August 1997)\n* Arsenal (March 1998)\n* Crusade (November 1998)\nIn July or August 1998, Wizards of the Coast released ''Commander's Edition'', a redesign of the base set and its third release following the limited and unlimited sets. The company's assistant brand manager Michael Brooks stated that ''Commander's Edition was the game the company \"ideally would have put out the first time around\". This was not a reprint, though, as it included cards from expansion sets and removed cards that were not useful or otherwise \"broken\". It was sold in 60-card starter decks and 15-card booster packs.\nReception\nSteve Faragher reviewed BattleTech for Arcane'' magazine, rating it a 7 out of 10 overall, and stated that \"Not one of Richard Garfield's best games, this is over-reliant on previous successes and not any better than the original BattleTech. It's still jolly clever, though, and good fun to play.\"\nIn Issue 1 of Backstab, Stéphane Bura liked some of the game mechanics, but ultimately found that the game's biggest fault was the \"poor quality of the composition and design of the cards\" compared to rival CCGs Netrunner and Mirage. Bura concluded by giving the game a below average rating of 6 out of 10.\nIn the October 1997 edition of Dragon (Issue 240), Rick Swan liked this collectible card game, calling it \"simple (much easier, in fact, than the Magic: The Gathering game, designed by the same guy) and addictive (which means you better start saving up for the boosters).\"\nThe Arsenal expansion, which introduced a new card type, vehicles, resulted in the need for extensive errata and has been credited with bringing the game to its end.\nReviews\n* #9 (Arsenal)\n*Backstab #11 (Commander's Edition)\nReferences\nFurther reading\n*\n*\n*\n*\n*\nExternal links\n*[http://sarna.net/bt-ccg.shtml An unofficial BattleTech TCG card database]\n*[http://sarna.s3.amazonaws.com/docs/rules/ccg/bt_players_guide.pdf BattleTech Rulebook], 1998\n*\n*[http://www.gamecabinet.com/reviews/BattletechCCG.html Review] at www.gamecabinet.com"
    }
  ]
}