{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Agnadello__disambig_1\n\n| strength1         = 30,000\n| strength2         = 8,000\n| casualties1       =\n| casualties2       = 4,000+\n}}\nThe Battle of Agnadello, also known as Vailà, was fought on 14 May 1509 between the army of King Louis XII of France and the Venetian rear-guard elements commanded by Bartolomeo d'Alviano. After a three hour struggle, and after Bartolomeo found himself abandoned by a part of his army, the Venetians were defeated with losses in excess of 4,000 men. Louis then occupied the rest of Lombardy.\nIt was one of the most significant engagements of the War of the League of Cambrai and a pivotal episode in the broader context of the Italian Wars, with Machiavelli describing it as Venice losing in a single day the territorial gains of eight centuries.\nBackground\nOn 15 April 1509, a French army under the command of Louis XII left Milan and invaded Venetian territory.  To oppose its advance, Venice had massed a mercenary army near Bergamo, jointly commanded by the Orsini cousins, Bartolomeo d'Alviano and Niccolò di Pitigliano. The Orsini had orders to avoid a direct confrontation with the advancing French, and spent the next several weeks engaged in light skirmishing.\nBy 9 May, however, Louis had crossed the Adda River at Cassano d'Adda. Alviano and Pitigliano, encamped around the town of Treviglio, disagreed on how to deal with Louis, since Alviano wanted to attack the French in defiance of his orders; they finally decided to move south towards the Po River in search of better positions.\nBattle\nOn 14 May, as the Venetian army moved south, Alviano's rearguard, commanded by Piero del Monte and Saccoccio da Spoleto, was attacked by a French detachment under Charles II d'Amboise, who had massed his troops around the village of Agnadello. Alviano, who was at Pandino, hurried back to position his forces, numbering around eight thousand, on a ridge overlooking some vineyards. Charles attempted to attack, first with cavalry and then with Swiss pikemen. However, the French army, forced to march up a hillside crossed with irrigation ditches, which were soon filled with mud from the pouring rain, were unable to breach the Venetian lines.\nPitigliano had been moving ahead of Alviano, and was several miles away when the French began their attack. In reply to Alviano's request for help, he sent a note suggesting that a pitched battle should be avoided, and continued his march south.\nMeanwhile, Louis, with the remainder of the French army, had reached Agnadello. The French, now number 30,000 men, surrounded Alviano on three sides and proceeded to destroy his forces over the next three hours. The Venetian cavalry charged the center of the French army to relieve the pressure on the infantry. Despite being initially successful, the Venetian cavalry was soon outnumbered and surrounded; when Alviano himself was wounded and captured, the formation collapsed and the Venetian forces were defeated. Of Alviano's command, more than four thousand were killed, including his commanders Spoleto and del Monte, and 30 pieces of artillery were captured.\nAftermath\nAlthough Pitigliano had avoided engaging the French directly, news of the battle reached him by that evening, and the majority of his forces had deserted by morning. Faced with the continued advance of the French army, he hurriedly retreated towards Treviso and Venice. Louis then proceeded to occupy the remainder of Lombardy.\nThe battle is mentioned in Machiavelli's The Prince, noting that in one day, the Venetians \"lost what it had taken them eight hundred years' exertion to conquer.\"\nThe economic historian, Niall Ferguson suggests that the collapse of the Venetian monte nuovo bonds from 102 percent of their face value to 40 percent was a direct consequence of the Venetians' defeat at Agnadello.\nReferences\nSources\n*\n*\n*\n*\n*\nExternal links\n* [http://www.boglewood.com/timeline/agnadello.html The Battle of Agnadello]"
    }
  ]
}