{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Surfaces__disambig_1\n\nRafael Nadal\n| p1 rank    = 2\n| player2    =  Roger Federer\n| p2 rank    = 1\n| p1 s1 = 7\n| p2 s1 = 5\n| p1 s2 = 4\n| p2 s2 = 6\n| p1 s3 = 712\n| p2 s3 = 610\n| image = BattleSurfacesMinibanner.jpg\n}}\nThe Battle of Surfaces''' was a men's tennis exhibition match that was held on May 2, 2007, between Roger Federer, the then top-ranked men's singles player, and Rafael Nadal, the then world No. 2 in men's singles. The match was played in the capital city of Nadal's home island, Palma de Mallorca, in front of a home crowd at Palma Arena. Prior to the match, Federer and Nadal had long undefeated streaks on their respective surfaces. Federer was undefeated for 48 matches on grass whilst Nadal was undefeated in 72 matches on clay.\nNadal won a competitive match 7–5, 4–6, 7–6(12–10). The event was almost cancelled the night before when the grass surface had to be replaced after being infested with worms.\nBackground\nThe concept came from the Argentine tennis fan Pablo del Campo who envisaged a hybrid tennis court combining clay and grass. He had previously tried to arrange a Battle of Surfaces match between Pete Sampras and Gustavo Kuerten. The match was played on a unique court with a clay surface on one side of the net and grass on the other. The court cost $1.63 million to create and took 19 days to prepare. At the time, Federer had won 48 straight matches on grass courts, going five straight years undefeated on grass, while Nadal had 72 straight wins on clay, going three straight years undefeated on clay. Rafael Nadal was also leading the head-to-head between the two players 7–3, with a 5–0 record on clay while Roger Federer had won their only meeting on grass.\nThe match was chosen to be played at the Palma Arena velodrome. Three days before the match, it was discovered that the grass that was being grown for the court had not grown well indoors and had a worm infestation that led to tennis balls getting stuck in the grass. The match was almost cancelled as a result. However, it was decided to use grass turf taken from a nearby golf green to replace it so the match could be played.\nThe match\nBefore the match, Federer said, We are both looking forward to this absolutely new event. The idea really appeals to me as we both dominate one of the surfaces. Rafa holds the record of 72 victories in series on clay and I have not been defeated on grass since 48 matches. It'll be fun to find out what it's like to play on a court with mixed surfaces! And it ought to be interesting to see who chooses the better tactic. People have been talking about this event for quite a while. Now it's coming up pretty soon already and I like the fact that the stadium - which is very nice, by the way - is located on Majorca, Rafa's home. He has been to Basel, after all, and now I've got the opportunity to play at his place for once.\nThe match was played over three sets and  the changeovers time limits were extended to 2 minutes to allow players to change their shoes for each surface. Nadal won the match  7-5 4-6 7-6 (12-10). After the match, Nadal said,\nIt has been a nice experience, although before the match I thought it would be a disaster because I felt it would be very difficult for me to adapt to the court.\nSee also\n*Bailey–Johnson 150-metre race\n*Battle of the Sexes (tennis)\nReferences\nExternal links\n*[http://www.rogerfederer.com/ Roger Federer, Official Website]\n*[http://www.rafaelnadal.com Rafael Nadal, Official Website]"
    }
  ]
}