{
  "content": [
    {
      "type": "text",
      "text": "# Battle of the Sesia (1524)\n\n|commander2= Charles de LannoyFernando d'Ávalos\n|strength1=\n|strength2=\n|casualties1=\n|casualties2=\n}}\nThe Battle of the Sesia or Battle of the Sesia River, took place near the Sesia River (Latin: Sesites or Sessite), situated in north-western Italy, Lombardy, on 30 April 1524, where the Imperial–Spanish forces commanded by Don Carlos de Lannoy and Fernando d'Avalos, Marquis of Pescara decisively defeated the French army under the Admiral Guillaume Gouffier, Lord of Bonnivet and the Comte de Saint-Pol, during the Italian War of 1521–1526.\nBackground\nBonnivet's offensive of 1523\nThe French army, under Bonnivet, advanced through the Piedmont to Novara, where it was joined by about 18,000 Swiss mercenaries, the best pike-armed infantry available. The French army now comprised some 36,000 infantry (many of whom would be detached from the main force in garrisons) and 2,200 men at arms, plus numerous gentlemen volunteers; there would also have been some light horse but the number of these is not known. Opposing Bonnivet was the Imperial army under Prospero Colonna, who had barely half as many men as the French: only 800 men at arms, 800 light horse and 15,000 infantry.\nColonna, an aging but skilled Condottiere, understood that the key to French success was the occupation of the city of Milan. His best chance of denying the French army its objective was to delay its advance as much as he could, without compromising his own army. Colonna held the line of the Ticino river for as long as he dared but was forced to fall back to Milan on 14 September 1523 when the French began to cross the river in force. Bonnivet paused for a few days to allow his army to rest and regroup. This delay was vital to the successful defence of Milan in two respects: first, the city was stocked with supplies for a siege and protective earthworks were dug; second, with barely two months of the campaigning season left, each day of delay reduced the chances of a siege being effective enough to force capitulation. Had Bonnivet found it possible to vigorously press on instead of resting, the city would have been caught unprepared and was likely to have fallen.\nAutumn and winter operations, 1523-4\nThe French laid siege to Milan until mid-November. Then, with no sign of it falling, Bonnivet withdrew his men a few miles to winter quarters at Abbiategrasso. This was to preserve his army from the extremes of disease and privation it was certain to suffer if it remained in its trenches during the winter. Over the next few months, the scales progressively tipped away from the French and towards the Imperials as Colonna's army was reinforced and they were not. In late December, Spanish troops from Naples, led by Lannoy, the Spanish viceroy of that kingdom, and the marquis of Pescara, arrived to bolster Colonna's forces. Any potential for rivalry and dissent over who should command the combined Imperial-Spanish army evaporated almost at once with the death of the ailing Colonna on 30 December, leaving Lannoy as undisputed general. Another reinforcement, this time of 6,000 Landsknechts arrived at the end of January. By now, Lannoy's main problem was not the French but finances: there was no money to pay the army. He warned his political master, Charles V (who was both king of Spain and Holy Roman Emperor), that the army might fall apart through mass desertion unless some funds could be provided; he even suggested negotiating a truce with the French; this would give time to alleviate the problem of pay.\nFortunately for Lannoy, the French were feeling the pressure too. In early February, after Lannoy was reinforced by yet another contingent, this one paid for by Venice, Bonnivet pulled back to a safer position behind the Ticino river. In April, Bonnivet was expecting his own reinforcement of Swiss infantry. However, their arrival actually had the opposite effect on his strength as, when the expected fresh troops arrived, they dropped a bombshell: these Swiss had come only to escort the survivors of the Swiss contingent already with the French army in returning home. At this point, Bonnivet threw in the towel: he decided to end the campaign and head back to France. The army began crossing the Sesia river on 29 April with the Swiss intending to head for home and the depleted French back to France. Bonnivet himself commanded the rearguard, covering the operation. Lannoy saw his chance to harry the retreating French and hastened forward his troops to cause as much damage as they could.\nBattle\n, painted by Jean Clouet. Bonnivet commanded a great number of French armies during the Italian War of 1521–1526.]]\n, in Sainte-Anne-d'Auray.]]\nThe finer details of the battle, in English at least, are scarce but enough is known of the significant events to recognise its importance. Most battles of the period were set piece affairs, fought with mutual consent, if not equal willingness. A weaker army also had the option to dig field fortifications to even up the odds. Indeed, it was virtually impossible to force an unwilling foe to contest a battle as it took an army so long to deploy from march to combat formations that the opposition could simply march away. The battle of the Sesia was one of the exceptions in that it was not a set piece battle. Some of the French (Bonnivet's rearguard) had to turn and fight to allow the rest to accomplish the slow business of crossing the river. Nor was the whole of the Imperial-Spanish army present, at least not until late in the day.\nFirst to arrive were light cavalry and arquebus-armed infantry. Some of the Spanish arquebusiers under Pescara arrived on foot and others \"hitched a lift\" on the back of light cavalry horses. Tuscan arquebusiers travelled on their own mounts and dismounted to fight, in the manner of Dragoons. The Tuscans were led by Giovanni de Medici, who had conceived this idea after the battle of Bicocca in 1522.\nDetails of the terrain as it was in 1524 are not known. However, the Ticino is a major river, fed by streams and tributaries which were obstacles in themselves and which minimised the areas of flat, good-going required by the French to optimise the performance of their best assets: their heavy cavalry and remaining Swiss infantry. Sixteenth century irrigation was feeble compared with its modern equivalent so there would be many areas of soft or boggy ground. This was significant as it would have little effect on the ability of the Imperial-Spanish arquebusiers in their loose formations to shoot, whilst also giving them time to escape from the closed ranks of the French shock troops.\nThroughout the day, the arquebusiers maintained a galling fire on the French, particularly demoralising as it came from the flank and rear. The few French missile troops were ineffective in reply. Swiss infantry launched a fearsome pike charge but the more nimble arquebusiers did not attempt to stand up to them; instead, they danced out of the way as the eventually reformed and resumed their fire when it was safe to do so. As the day wore on, the pikes of the Spanish-Imperial army eventually caught up with the arquebusiers. Bonnivet himself led a heavy cavalry charge but this, too, was a blow in the air; for his trouble, he was wounded by an arquebus shot. Finally the French army retreated to the Alps in disarray.\nConsequences\nIn early July 1524, Lannoy launched an invasion of Provence, commanded by Don Fernando d'Avalos and Charles de Bourbon, and crossed the Alps with nearly 11,000 men. The Imperial–Spanish forces captured and sacked most of the smaller towns of Provence, and finally Charles de Bourbon entered the provincial capital of Aix-en-Provence on 9 August, taking the title of Count of Provence.\nBy mid-August, Fernando d'Avalos and Charles de Bourbon had besieged Marseille, the only stronghold in Provence that remained in French hands. Their assaults on the city failed, and when the French army commanded by Francis I himself arrived at Avignon at the end of September, they were forced to retreat back to Italy.\nIn mid-October, King Francis I crossed the Alps and advanced on Milan at the head of an army numbering more than 40,000 men.\nSignificance\nThe Battle of the Sesia is a comparatively little-known encounter but historians who do comment upon it ascribe great significance to its place in the evolution of firearm tactics.\nIn the three decades of the Italian Wars that preceded Sesia, hand held firearms had become increasingly prominent in most armies, with only the French native troops clinging to the crossbow in large numbers. Arquebusiers had mainly been used as skirmishers (a role for which they were very well-adapted) but they had also been battle winners at the battle of Cerignola in 1503 and at the battle of Bicocca in 1522. On both of these occasions, however, it had been necessary for their own protection for the arquebusiers to fight from behind field entrenchments; these were not to shelter them from enemy fire so much as to protect them from the impetus of enemy shock troops. The battle of the Sesia, by contrast, featured no constructed defences: the arquebusiers operated in the open, albeit in terrain that was favourable to them.\nTen months after the battle of the Sesia came the much more widely-known battle of Pavia. This was a crushing victory, again for a combined Spanish-Imperial force, again over the French. Hall states that the action at the Sesia \"foreshadows the Spanish tactics at Pavia quite closely.\" In the narrow sense, this is clearly true: Pescara's troops certainly did end up fighting in a very similar way to how they had done so at the Sesia. However, if the statement  is read as implying \"the way in which the Spanish intended to fight,\" it is far from clear that Hall is correct, not least because of the lack of clarity around the events at Pavia. This lack of clarity is both literal (Pavia was fought in the early morning mist and fog) and documentary (the twenty surviving contemporary accounts of Pavia are wildly at variance with each other, where they are not directly contradictory, and some seem downright fictional). Even if Pavia was not planned as a battle in the same mould as Sesia, the Spanish arquebusiers present did indeed take the opportunities that presented themselves, just as they had done ten months before: their previous experience obviously stood them in good stead.\nThere is another facet of the doings of the arquebusiers at the Sesia that suggested the next step in the development of infantry warfare. Once their own pikemen had arrived, the arquebusiers withdrew behind them when threatened, then re-emerged to continue firing once the danger had passed. Although not yet grouped together in mixed weapon units, the close co-operation between pike and shot suggested this future convergence. The passive role of the Spanish-Imperial pikes at the Sesia and the ineffectiveness of the Swiss were harbingers of things to come. It marked a shift in the balance of infantry power away from the dominance of shock troops supplemented by firepower to  firepower supported by protecting pikes and, ultimately, towards the hegemony of fire on modern battlefields.\nSee also\nand V of the Holy Roman Empire. Agate-chalcedon cameo, Italian artwork, middle 16th-century.]]\n*List of battles of the Italian Wars\n*Italian campaign of 1524–1525\n*List of governors of the Duchy of Milan\n*Battle of Pavia\n*Italian Wars\nNotes\nReferences\n*\n*\n*\n*\n*\n*\n*\n*\n*"
    }
  ]
}