{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Duc Lap\n\n| combatant2  =  North Vietnam\n| commander1  =  Gen. Trương Quang Ân Gen. William R. PeersCol. Herbert J. McChrystal\n| commander2  =  Gen. Chu Huy Mân\n| units1   =  45th RegimentCIDG 5th Special Forces Group\n| units2   = 66th Regiment20th Sapper Battalion\n| casualties1 =  107 killed 7 killed\n| casualties2 = US/ARVN body count: 700+ killed\n}}\nThe Battle of Đức Lập took place during the Vietnam War when North Vietnamese forces attempted to overrun the Civilian Irregular Defense Group (CIDG) Duc Lap Camp between 24 and 27 August 1968.\nBackground\nIn late July 1968, in developing their plans for the Phase III Offensive, the North Vietnamese politburo and People's Army of Vietnam (PAVN) chief of staff, General Văn Tiến Dũng decided that while the main area of operations would be Tây Ninh Province, the Central Highlands would be a secondary area of operations. The PAVN 1st Division was tasked with seizing the Duc Lap Camp and then moving northeast to threaten Buôn Ma Thuột. The PAVN 24th Regiment would cut Highway 14 between Buôn Ma Thuột and Pleiku. The 95C and 101D Regiments would make diversionary attacks on Allied bases across Kon Tum Province.\nBattle\nOn the night of 23 August, the 66th Regiment and the 20th Sapper Battalion gathered near Duc Lap Camp in preparation for their attack on the base while the 320th Regiment established a blocking position on Highway 14 northeast of Duc Lap to intercept allied ground units. The ARVN forces at Duc Lap Camp were commanded by Captain Hoàng Kim Bảo, who coordinated the defense of the camp alongside U.S. Special Forces and CIDG personnel during the North Vietnamese assault.\nAfter midnight on 24 August, two squads from the 20th Sapper Battalion cut through the perimeter wire around the Duc Lap subsector headquarters, entered the compound, and threw satchel charges at buildings and fighting positions while infantry provided covering fire. One of the satchel charges hit the advisory team headquarters, wounding five U.S. advisers inside. When the advisers emerged from the headquarters, they were hit by heavy weapons fire which killed one adviser and forced the rest back into the building, they then radioed Dak Sek Camp for assistance but were informed that it was also under attack.\nAt Dak Sek Camp, the PAVN had penetrated the northern perimeter wire and occupied part of a hill inside the camp. An AC-47 Spooky gunship soon arrived overhead and began firing on PAVN mortar and machine-gun positions.\nAfter a meeting at ARVN 23rd Division headquarters in Buôn Ma Thuột, I Field Force, Vietnam commander General William R. Peers ordered the 4th Battalion, 503rd Infantry Regiment to be airlifted from Tuy Hòa Base Camp to Buôn Ma Thuột to join a newly created Task Force Spoiler to be commanded by Colonel Herbert J. McChrystal. Task Force Spoiler would include McChrystal's 2nd Brigade, 4th Infantry Division, the 1st Squadron, 10th Cavalry Regiment, two troops from the 7th Squadron, 17th Cavalry, and seven artillery batteries. 23rd Division commander, General Trương Quang Ân, ordered a battalion from the 47th Infantry Regiment to redeploy from Phú Yên Province to Buôn Ma Thuột and two battalions from the 45th Regiment to proceed towards Duc Lap and also received permission from the II Corps commander to fly several MIKE Force companies into Duc Lap.\nOn the morning of 24 August, U.S. helicopters landed a MIKE Force company outside the Duc Lap camp, and they proceeded to engage the PAVN forces on the north end of the camp suffering heavy losses. When helicopters landed on the camp airfield to evacuate casualties, PAVN machine guns on the hill shot down four UH-1s. Later that afternoon the ARVN 2nd Battalion, 45th Regiment was landed near the Duc Lap subsector headquarters with two UH-1s shot down. At dusk, two MIKE Force companies were landed 3&nbsp;km south of Duc Lap Camp.\nOn 25 August, the PAVN renewed their attack against the subsector headquarters, but the remaining 61 troops defenders held out until rescued later that day by the ARVN 2nd Battalion, 45th Regiment which then forced the PAVN to retreat from the village. Meanwhile, at Duc Lap Camp the PAVN had forced the defenders back into the southern end of the camp. Battery A, 4th Battalion, 42nd Artillery Regiment was airlifted into the landing zone 3&nbsp;km south of the camp and the two MIKE Force companies there then moved north and fought their way into Duc Lap Camp by 13:00. The MIKE Forces hit the PAVN flank as they were assaulting the southern end of the camp pushing them back to the northern hill. Following air and artillery strikes, the original two companies plus a third which had been flown in from Pleiku then assaulted the hill. Three U.S. advisers and a number of the CIDG troops were killed in the assault, but by 19:00 they had cleared the PAVN from the camp.\nOn 26 August, the ARVN 2nd Battalion, 45th Regiment, continued to pursue the PAVN north in the hills north of the town and by 27 August the battle was over.\nAftermath\nAllied casualties for the battle of Duc Lap were 114 killed (including seven U.S. advisers) and 238 wounded. I Field Force estimated that over 700 PAVN had been killed, most from air and artillery strikes.\nReferences"
    }
  ]
}