{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Ganghwa\n\n|combatant2      =  Joseon\n|commander1      =  John Rodgers   Winfield Schley\n|commander2      =  Eo Jae-yeon Eo Jae-sun\n|strength1       = 651 troops 6 howitzers  1 frigate  2 sloops-of-war  2 gunboats\n|strength2       = 300 troops 40 artillery pieces  6 forts  4 shore batteries\n|casualties1     = 3 killed  10 wounded  1 gunboat damaged\n|casualties2     = 243 killed  20 captured (later released)  40 artillery pieces captured  5 forts destroyed  1 fort damaged  4 shore batteries destroyed\n|notes=\n}}\nThe Battle of Ganghwa was fought during the 1871 United States expedition to Korea, a conflict between Joseon and the United States. In May of that year, five Asiatic Squadron warships set sail from Japan to ascertain what happened to the crew of the SS General Sherman as well as to establish a trade treaty with the Hermit Kingdom similar to the one Commodore Perry had pressured Japan into adopting in the early 1850s. When American forces arrived in Korea, the originally peaceful mission turned into a battle when guns from a Korean fort suddenly opened fire on the Americans. The battle to capture Ganghwa Island's forts was the largest engagement of the conflict.\nBackground\nThe United States Navy expedition involved over 1,400 personnel, 542 sailors, 109 marines and six 12-pounder howitzers made up the landing party. Frigate USS Colorado, the sloops USS Alaska and USS Benicia and the gunboats USS Monocacy, and USS Palos were assigned to the operation, all together mounting 85 guns under the command of Rear Admiral John Rodgers and Commander Winfield Scott Schley. Korean forces included the six Selee River Forts, of various sizes, and four shore batteries with over 300 men and dozens of artillery pieces. While negotiations were going on at Inchon, on June 1, 1871, two of the U.S. vessels, the Palos and USS Monocacy, were tasked to reconnoiter the waters of the Han River estuary. Parts of Ganghwa Island and several of its forts faced the estuary. Foreign vessels were forbidden entrance to the Han River because the river's course provided direct access to Joseon's capital city of Hanyang (modern Seoul), which could potentially be fired upon by any armed foreign vessels. It is possible that the U.S. naval vessels were unaware of this fact.  Joseon forces stationed on the island had orders to fire at foreign vessels that appeared to be readying to enter the Han, and so at the approach of the two American ships into controlled waters, the USS Palos was engaged by one of the forts; the Palos and USS Monocacy returned fire and silenced it (the Bombardment of the Selee River Forts). Rear Admiral Rodgers demanded an apology from the Joseon government and set a time limit of 10 days for receipt of the apology. None came, and so nine days later the U.S. expedition carried out Rogers' threat and assaulted Ganghwa Island.\nBattle\nThe battle began on June 10, when the American squadron arrived off Point Du Conde and began bombarding the fort there. The shore party was landed by boats which immediately launched an attack on Fort Du Conde which was taken without serious resistance. Next, the Americans proceeded north a short distance where they captured Fort Monocacy, skirmishing with bodies of Korean troops along the way. After the fall of Fort Monocacy, the Americans rested for the night and became the first western military forces to camp on Korean soil. On June 11, the main engagement occurred, the five warships began bombarding the four remaining forts while the shore party attacked from land. About 300 Koreans, armed with matchlock rifles, swords, and clubs held Fort McKee which was the heart of Korean defenses. The cannons of the USS Monocacy blasted the Korean citadel's walls, and the Americans then charged up the ramparts. The Koreans, running low on ammunition, began throwing rocks and slinging their swords, fatally injuring Lieutenant Hugh McKee, who was stabbed by a spear as he led the charge. One by one the Americans climbed over the fort's walls. Fierce close-quarters combat ensued but lasted only fifteen minutes until the fort was secure.\nIn the end, 243 Koreans were counted dead (350 according to Korean sources), twenty captured and a few wounded. Over forty cannons ranging from two to 24-pounders were also taken and within the next few days the forts were dismantled, with the exception of Fort Palos, on the other side of Ganghwa Straits. Corporal Charles Brown captured a large sujagi, and received the Medal of Honor for doing so. Under heavy fire, Carpenter Cyrus Hayden planted the American flag on top of the Korean fort, an act which earned him the medal as well. Private James Dougherty personally shot and killed the Korean commander General Eo Jae-yeon; he and six others were also awarded the Medal of Honor. Only three Americans were killed and ten were wounded. USS Monocacy was grounded on rocks off Fort McKee during the battle, but she was re-floated and sustained only slight damage.\nAlthough the battle was a military victory for the American forces, the Koreans refused to sign a trade treaty with the United States until 1882.\nIn popular culture\nThe opening episode of Mr. Sunshine features of the Battle of Ganghwa Island, one of the characters, Jang Seung-gu, fought in the battle as a teenager and witnessed his father killed in the fighting.\nGallery\nFile:Council of War USS Colorado June 1871.jpg|A posed photograph of a council of war of United States Navy officers off Korea aboard the Asiatic Squadron flagship USS Colorado in preparation for the June 1871 United States expedition to Korea.\nFile:Officers of the USS Colorado off Korea in June 1871.jpg|Officers of the USS Colorado, sitting at left front is Lt Hugh McKee.\nFile:Ganghwa 3-edit.jpg|American servicemen after capturing Fort Dŏkjin (Fort Monocacy) on June 10\nFile:Interior of Fort McKee., 06-1871 - NARA - 559259.tif|Korean casualties, after the attack on Fort Sondolmok (Fort McKee)\nFile:Sujagi.jpg|Sujagi flag, captured at Fort McKee in the attacks on the Salee River Forts, June 10 and 11,\nFile:A Corean official bearing the first despatches on board the Colorado., 06-1871 - NARA - 559257.tif|A \"Corean\" [sic] official bearing the first despatches on board the Colorado., 06/1871\nFile:Officers & crew of USS Monocacy 1871-06.JPEG|Officers and crew of the USS Monocacy\nSee also\n*Battle of Santiago de Cuba\n*List of Medal of Honor recipients\nReferences\nFurther reading\n* |title=The Savage Wars Of Peace: Small Wars And The Rise Of American Power |publisher=Basic Books |publication-place=New York |year=2002 |isbn=978-0-465-03866-4 |oclc=248251538 |url= |pages=56–59}}\n*\n* [ Partial preview] at Google Books.\n*"
    }
  ]
}