{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Iquique__disambig_2\n\nPeru\n| combatant2        =  Chile\n| commander1        =  Miguel Grau\n| commander2        =  Arturo Prat\n| strength1         = 2 ironclads\n| strength2         = 2 corvettes\n| casualties1       = 8 killed and wounded\n| casualties2       = 143 killed and wounded  57 captured  1 corvette sunk\n| campaignbox       =\n| map_type          = Chile#South America#America\n| map_relief        =\n| map_size          = 300px\n| map_marksize      =\n| map_caption       =\n| map_label         =\n}}\nThe Battle of Iquique was a naval engagement on 21 May 1879, during the War of the Pacific, where a Chilean corvette commanded by Arturo Prat Chacón faced a Peruvian ironclad under Miguel Grau. The battle occurred off the port of Iquique, Peru, and ended with the sinking of the Chilean wooden corvette  by the Peruvian ironclad  after four hours of combat, marking a victory for Peru.\nBackground\nIn 1879, the Bolivian government threatened to confiscate and sell the Antofagasta Nitrate & Railway Company, a mining enterprise with Chilean and British investors. In response, the Chilean government sent a small military force to seize control of the port of Antofagasta on February 14. This action prompted Bolivian President Hilarión Daza to declare war on Chile and forced Peru to honor a secret 1873 treaty with Bolivia. Despite Peru's attempts to negotiate and prevent conflict, Chile, aware of the pact, declared war on both Peru and Bolivia on April 5. Another Chilean force took control of the city of Calama after winning the Battle of Topater on March 23.\nBoth sides recognized that control of the sea was crucial for victory. Thus, Chile focused on destroying the Peruvian Navy in the first year of the war. Chilean naval commander Juan Williams Rebolledo planned to sail north with his fleet to engage the Peruvian Navy at Callao and achieve naval dominance. The main ships of the Chilean Navy headed toward the port of Callao, while two older wooden ships, the corvette Esmeralda and the schooner Covadonga, blockaded the Peruvian port of Iquique. However, two ironclad ships of the Peruvian Navy, the monitor Huáscar and the armored frigate , commanded by Rear Admiral Miguel Grau and Captain Juan Guillermo More, respectively, steamed south from Callao undetected. The Esmeralda, with Captain Arturo Prat, and the Covadonga, with Captain Carlos Condell, remained at Iquique.\nThe wooden corvette Esmeralda, constructed in 1854, was armed with twenty 32-pound cannons and two 12-pound cannons. It was later upgraded in 1868 with twelve 40-pound rifled cannons and four 40-pound Whitworth cannons. The Peruvian ironclad Huáscar, built in 1865, displaced 1,180 tons and was armed with two  cannons, two  cannons, one  cannon, and a Gatling machine gun. It had a maximum speed of .\nPrelude\n]]\n.]]\nOn the morning of May 21, 1879, at 6:30&nbsp;a.m., a dense marine fog obscured the harbor. As the fog cleared, Covadonga's lookout shouted, \"Smoke to the north!\" However, the crew couldn't identify the approaching ships. Moments later, they recognized them as the Peruvian squadron, Huáscar and Independencia. At 6:45&nbsp;a.m., a sailor noticed the ships' rigging through a telescope and informed Commander Condell. He based his identification on the shape of the platform on top of the foremast. Condell immediately ordered a warning shot to be fired to alert the anchored Esmeralda. It was confirmed that the ships were indeed Independencia and Huáscar.\nAt the same time, Peruvian admiral Grau rallied his crew:\n\"Crewmembers and Sailors of the Huáscar, Iquique is in sight, there are our afflicted fellow countrymen from Tarapacá, and also the enemy, still unpunished. It's time to punish them! I hope you will know how. Remember how our forces distinguished in Junin, the 2nd of May, Abtao, Ayachucho, and other battlefields, to win us our glorious and dignified independence, and our consecrated and brilliant laurels of freedom. No matter what the outcome, Peru will not fall. For our fatherland, Long Live Peru!\"\nMeanwhile, Carlos Condell de la Haza informed Commander Arturo Prat, who assessed the difference in forces and ordered to hoist the signal: \"reinforce the charge,\" \"come to the talks,\" and \"follow my waters\" (follow his course) and then inspired the crew with the following words:\nLads, the struggle will be against the odds, but cheer up, and have courage. Never has our flag been hauled down in the face of the enemy, and I hope, thus, this will not be the occasion to do so. For my part, as long as I live, this flag will fly in its place, and if I should die, my officers shall know how to fulfill their duties. Long Live Chile!\nThe crews of Esmeralda and Covadonga, led by Commander Condell, were instructed to strengthen their positions. A bugler sounded the call to stations, and the Chilean crew took their assigned posts.\nThe battle commenced as Huáscar fired its first shot, causing an explosion and a plume of water and foam on the two ships. On land, people awakened to the sound of Covadonga's gun and flocked to the beach to witness the vessels breaking the city's blockade.\nBattle\nAt 8:15&nbsp;a.m., the initial exchange of fire occurred between the ships, with Prat commanding Esmeralda to initiate movement, followed by Covadonga. Prat also ordered the transport vessel Lamar to retreat southward. At 8:25&nbsp;a.m., a second round of shots was fired, and Huáscar's projectile struck Esmeralda's starboard side, penetrating the ship and resulting in the death of Surgeon Videla, the beheading of his assistant, and the fatal injury of another sailor. In response, Condell altered his course and positioned Covadonga behind Lamar. Grau commanded Independencia to block the path of Covadonga and Lamar. Observing Condell's actions, Prat questioned Condell's intentions. Despite Prat's orders being ignored, Condell managed to keep Covadonga away from Independencia. Juan Guillermo More, in control of Independencia, pursued Covadonga while Huáscar dealt the final blow to Esmeralda. Prat swiftly positioned the ship near the coastline, approximately 200 meters (660 ft) away, forcing Huáscar to fire in a parabolic trajectory to avoid hitting the Peruvian village where onlookers had gathered to witness the battle. General Buendía, the commander of the Peruvian garrison in Iquique, positioned artillery on the beach and dispatched a messenger in a fast rowing boat to warn Huáscar that Esmeralda was loaded with torpedoes. Grau halted Huáscar approximately 600 meters (660 yards) away from Esmeralda and began firing the 300-pound cannons, but due to the Peruvian sailors' lack of experience in handling the monitor's Coles turret, they failed to hit their target for an hour and a half. The Chilean crew responded with their 30-pound cannons and gunfire, which proved ineffective against Huáscar's armored plating. Along the coast, the Peruvian Army garrison stationed in the town positioned cannons manned by gunners and bombardiers to attack the Chilean ship. A grenade reached Esmeralda, resulting in the deaths of three men. Prat commanded the warship to move, pushing the engine to its limits and causing one of the boilers to explode.\nAs a result, the ship's speed decreased to 2 knots (3.7 km/h; 2.3 mph) due to a defective engine caused by age and lack of maintenance. This maneuver allowed Grau to ascertain that Esmeralda did not contain the torpedoes it was believed to carry. Huáscar's shot directly hit the ship, beheading the bugler and causing severe injuries to the gun crews. The battle continued, with the crew of Huáscar facing difficulties in targeting the Chilean corvette as, from their perspective, their own countrymen and the Peruvian port lay behind Esmeralda. A missed cannon shot posed a significant risk of hitting the population or the Peruvian port's batteries. Realizing the futility of winning the battle through a cannon exchange and desiring to conclude the combat, Grau ordered Huáscar to ram Esmeralda. Prat attempted to evade the collision by maneuvering the ship forward and closing a port, managing to avoid further damage when the blow struck near the mizzen mast. Upon impact, Huáscar finally had the opportunity to fire its 10-inch (300-pound) cannons at close range, resulting in the deaths of approximately 40 to 50 sailors and marines. In a heroic gesture, Prat tried to board the enemy vessel. Allegedly shouting, \"Let's board, boys!\" he leaped onto the Peruvian ship, but only one fellow countryman followed him due to the deafening noise of the battle. Prat was then fatally shot while the companion who boarded with him, Petty Officer Juan de Dios Aldea, sustained injuries. Together with Prat and Aldea, soldier Arsenio Canave jumped on the deck of the Peruvian ship to find death.\nAs Esmeralda continued to sink, Grau wanted to give his opponents time to surrender. Lieutenant Luis Uribe Orrego, acting as the ship's captain at that point, called for an official meeting on Esmeralda and decided not to surrender to the Peruvian Navy. During this time, a sailor climbed the mizzen mast to secure the Chilean national flag, ensuring that the crew would remember Prat's words before the battle.\nGrau soon received information that the attempted truce had failed once again and decided to ram Esmeralda for a second time, charging at full speed towards its starboard side. Uribe attempted a maneuver similar to Prat's, angling the ship to avoid Huáscar's impact. However, this time, the collision caused a breach, allowing water to flood into the powder magazine and machinery compartments. With a shortage of crew members and limited ammunition on deck, Esmeralda could not mount an effective defense. Huáscar once again unleashed gunfire at close range, resulting in casualties among the crew, including engineers and firemen who had surfaced on deck, and destroying the officers' mess room, which also served as the ship's clinic. Emulating Prat's actions during the initial ramming, Sublieutenant Ignacio Serrano and eleven other men armed with machetes and rifles boarded Huáscar but were unsuccessful and fell victim to the Gatling guns and the monitor's crew. Serrano, the sole survivor, sustained multiple gunshot wounds to the groin. Grau quickly ordered his rescue and had Serrano taken to the infirmary in a state of shock, where he was placed alongside the mortally wounded Petty Officer Aldea. Twenty minutes later, Huáscar rammed Esmeralda for a third time, targeting the mizzen mast area, accompanied by two guns. The corvette tilted forward and began to sink. As Esmeralda descended, Midshipman Ernesto Riquelme fired the last cannon shot. The Chilean flag, still flying and affixed to the mizzen mast, was the final part of the warship to submerge. It was midday, precisely 12:10&nbsp;p.m., and Grau realized that many Chilean sailors and marines (reports indicate that 57 survived) were struggling to avoid being pulled down by the sinking ship, while their captain had perished hours earlier.\nGrau ordered the deployment of rescue boats to save the enemy survivors from drowning. Initially apprehensive, the Chilean sailors were surprised to find that the Peruvians on Huáscar's deck were actually attempting to rescue them rather than harm them, picking them up one by one. Meanwhile, in an action on the same day which is sometimes considered the separate Battle of Punta Gruesa, Independencia pursued Covadonga, which was heading south of the port of Iquique. Covadonga remained close to the bay's beach at Chiquinata, as Independencia had a deeper draft. However, Independencia ran aground on the rocks and shallow waters of Punta Gruesa. Commander Condell commanded an attack on Independencia, resulting in its sinking and the fleeing of its crew on lifeboats, with only 20 remaining on board. Justifying his actions by pointing out that the Peruvian flag still flew from the mast, Condell ordered the shooting of the survivors. The divergent attitudes between the Chilean commander Condell and the Peruvian commander Grau are often highlighted by Peruvian maritime historians. While Grau had ordered the rescue of the 57 Esmeralda survivors, he learned at 2:20&nbsp;p.m. that Independencia, located 9 miles (14 km) away, was being bombarded by Covadonga. Grau promptly joined the engagement and arrived at 3:10&nbsp;p.m., finding Independencia stranded in shallow water with 20 surviving crew members, including More, as the rest had landed on the shore in boats. The Peruvian armored ship continued its pursuit of Covadonga for three hours until Miguel Grau realized that the distance between them could not be closed before sunset. Consequently, he returned to aid Independencia. Assessing the frigate's complete loss, Grau ordered the ship to be set ablaze after evacuating the remaining crew members.\nAftermath\n]]\nAfter the battle, Rear Admiral Grau ordered the return of Prat's personal belongings, including his diary, uniform, and sword, to his widow. Along with these items, she received a letter from the Peruvian flag officer praising her late husband's valor and bravery during the engagement. News of the events in Iquique and Punta Gruesa reached Chile through an underwater telegraph cable in Valparaíso. On Saturday, May 24, the Chilean Navy General Staff and Naval High Command held a special meeting and sent reports of the battles to the War Department in Santiago. This led to a mass conscription draft being ordered in response. Many men enlisted in the Army and Navy in the following days, driven by a desire to honor the fallen and contribute to the country's victory in the conflict.\nThe Battle of Iquique resulted in a clear victory for Peru, lifting the blockade on Iquique and temporarily forcing Chilean forces to retreat. However, the loss of the Independencia, one of Peru's most powerful warships, in the subsequent Battle of Punta Gruesa proved to be a strategic setback, whereas Chile only lost one of its oldest wooden warships. Captain Prat's untimely death while on duty inspired thousands of Chilean youths to join the army and navy. Chilean historians consider this a crucial factor contributing to the eventual Chilean victory in the war. Over time, Prat's significance became deeply ingrained in the Chilean collective consciousness, to the extent that newspapers began using the term \"Pratiotism\" as a substitute for \"Patriotism.\" Since 1905, the date of the battle has been commemorated as Día de las Glorias Navales (\"Naval Glories Day\"), a national holiday in Chile celebrated throughout the country. The honor extended beyond Prat, as Rear Admiral Grau, known as the \"Gentleman of the Seas\" for his actions during the battle and his noble gesture toward Prat's widow and surviving crew members, became revered as a gallant naval hero in both Peru and Chile.\nSee also\n*Battle of Punta Gruesa\n*Battle of Angamos\n*Arturo Prat\nReferences\nBibliography\n# Farcau, Bruce W. (September 30, 2000). The Ten Cents War: Chile, Peru, and Bolivia in the War of the Pacific, 1879-1884,\n# Sondhaus, Lawrence (May 4, 2004). Navies in Modern World History,"
    }
  ]
}