{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Le Transloy__disambig_1\n\n| map_type    = France\n| map_size    = 200\n| map_caption =\n| map_label   = Le Transloy\n| result      = Indecisive\n| combatant1  = |||||}}\n| combatant2  =\n| commander1  =\n| commander2  =\n| strength1   =\n| strength2   =\n| casualties1 =\n| casualties2 = October: 78,500 (1st Army and 2nd Army total)\n| campaignbox =\n}}\nThe Battle of Le Transloy was the last big attack by the Fourth Army of the British Expeditionary Force (BEF) in the 1916 Battle of the Somme in France, during the First World War. The battle was fought in conjunction with attacks by the French Tenth and Sixth armies on the southern flank and the Reserve/5th Army on the northern flank, against Army Group Rupprecht of Bavaria () created on 28 August. General Ferdinand Foch, commander of  (GAN, Northern Army Group) and co-ordinator of the armies on the Somme, was unable to continue the sequential attacks of September because persistent rain, mist and fog grounded aircraft, turned the battlefield into a swamp and greatly increased the difficulty of transporting supplies to the front over the roads land devastated since 1 July.\nThe German armies on the Somme managed a recovery after the string of defeats in September, with fresh divisions to replace exhausted troops and more aircraft, artillery and ammunition diverted from Verdun or stripped from other parts of the Western Front. Command of the German Air Service () was centralised and the new  (German Air Force) was able to challenge Anglo-French air superiority with the reinforcements and new, superior, fighter aircraft. The German flyers further reduced the ability of the Anglo-French airmen to support the armies with artillery-observation and contact patrols in the rare periods of clear weather.\nThe German armies lost much less ground and had fewer casualties in October than in September but the proportion of casualties increased from  of the Anglo-French total. Rain, fog and mud were lesser problems for the Germans, who had to carry supplies forward over a much narrower beaten zone and were being forced back onto undamaged ground. German bombardments on the few roads between the original front line and the line in October increased the difficulties of the British and French armies; the size and ambition of Anglo-French attacks was reduced progressively to local operations. and the loss of forts Douaumont and Vaux.}}\nEvery soldier endured miserable conditions but the Germans knew that the onset of winter would end the battle, despite the many extra casualties caused by illness. The British and French outnumbered the Germans and could relieve divisions after shorter periods in the line. Severe criticism of General Sir Douglas Haig and General Henry Rawlinson during and since the war for persisting with attacks on October, was challenged in 2009 by William Philpott, who put the British share of the battle into the context of strategic subordination to French wishes, the concept of a general Allied offensive established by Joffre and the continuation of French attacks south of Le Transloy which had to be supported by British operations. In a 2017 publication, Jack Sheldon translated overlooked German material on the ordeal endured by the German armies.\nBackground\nStrategic developments\nIn September, Foch had managed to organise sequential attacks by the four Anglo-French armies on the Somme, which had captured more ground than any previous month and inflicted the worst monthly casualties on the Germans of the battle.}} During the Battle of Morval , the French Sixth Army (General Émile Fayolle) had crossed the Péronne–Bapaume road around Bouchavesnes, the Fourth Army (General Henry Rawlinson) had taken Morval, Lesbœufs and Gueudecourt in the centre and the Reserve Army (Lieutenant-General Hubert Gough), which became the Fifth Army on 30 October, had captured most of Thiepval Ridge on the left flank. On 29 September, General Sir Douglas Haig instructed the Fourth Army to plan operations to advance towards Bapaume, reaching Le Transloy on the right and Loupart Wood north of the Albert–Bapaume road on the left. The Reserve Army was to extend the attacks of the Fourth Army by making converging attacks on the Ancre valley after the Battle of Thiepval Ridge  by attacking northwards towards Loupart Wood, Irles and Miraumont on the south bank.\nOn 28 August, the Chief of the General Staff General Erich von Falkenhayn simplified the German command structure on the Western Front by establishing two army groups.  was dissolved and General Max von Gallwitz reverted to the command of the 2nd Army.  controlled the 6th, 1st and 2nd armies, from the Belgian coast to the boundary of , south of the Somme. The emergency in Russia caused by the Brusilov Offensive, the entry of Rumania into the war and French counter-attacks at Verdun put further strain on the German army. Falkenhayn had been sacked from  (OHL) on 29 August and replaced by Field Marshal Paul von Hindenburg and General Erich Ludendorff. This Third OHL ordered an end to attacks at Verdun and the despatch of troops to Rumania and the Somme front. Colonel Fritz von Loßberg, Chief of Staff of the 2nd Army, was also able to establish  (relief divisions)  behind the battlefield, ready to replace tired divisions.\nGerman counter-attacks became bigger and more frequent, making the Anglo-French advance slower and more costly. After the Anglo-French attacks in mid-September, a comprehensive relief of the front-line divisions had been possible. On 5 September, proposals for a shorter line to be built in France were ordered from the commanders of the western armies, who met Hindenburg and Ludendorff at Cambrai on 8 September; the new leadership announced that no reserves were available for offensive operations, except those planned for Rumania. Ludendorff condemned the policy of holding ground regardless of its tactical value and advocated holding front-line positions with the minimum of troops and to recapture lost positions by counter-attacks. On 21 September, after the battle of Flers–Courcelette  Hindenburg ordered that the Somme front was to have priority in the west for troops. During September, the Germans had sent another thirteen fresh divisions to the British sector and scraped up troops wherever they could be found. The German artillery had fired  of field artillery shells and  of heavy artillery ammunition, yet the début of the tank, the defeat at Thiepval  and the   suffered by the armies on the Somme in September, had been severe blows to German morale.\nTactical developments\nGerman artillery on the Somme slowly improved in its effect, when Gallwitz centralised counter-battery fire and used aircraft reinforcements for artillery observation, which increased the accuracy and efficiency of bombardments. The 2nd Army had been starved of reinforcements in mid-August, to replace exhausted divisions in the 1st Army and plans for a counter-stroke had been abandoned for lack of troops. Reinforcements for the Somme front in September began to reduce the German inferiority in guns and aircraft. Field artillery reduced its barrage frontage from  per battery and increased its accuracy by using one air artillery flight () per division. As the Germans had been pushed out of their original defences, Loßberg established new positions based on principles of depth, dispersal and camouflage, rather than continuous lines of trenches. Rigid defence of the front-line continued but with as few soldiers as possible, relying on the firepower of machine-guns firing from behind the front-line and from the flanks. The area behind the front-line was defended by support and reserve units, dispersed on reverse slopes, undulations and in any other cover that could be found, so that they could open machine-gun fire by surprise, from unseen positions and then counter-attack swiftly, before French and British infantry could consolidate captured ground.\nThe largest German counter-attacks of the Somme battle took place from 20 to 23 September, from the Somme north to St Pierre Vaast Wood and were destroyed by French artillery fire.  Rather than pack troops into the front-line, local, corps and army reserves were held back, in lines about  apart, able to make progressively stronger counter-attacks. Trenches were still dug but were no longer intended to be fought from, being used for shelter during quiet periods, for the movement of reinforcements and supplies and as rallying points and decoys. Before an attack, the garrison tried to move forwards into shell-holes, to avoid Allied artillery-fire and to surprise attacking infantry with machine-gun fire. Opposite the French, the Germans dug new defences on a reverse slope from the Tortille stream at Allaines to the west end of St Pierre Vaast Wood and from there to Morval. , the fourth German position,  was dug from Sailly Saillissel to Morval and Bapaume, along the Péronne–Bapaume road. French agents also reported new construction  to the east. Ludendorff created fifteen \"new\" divisions by combing-out troops at depots and by removing regiments from existing divisions; the new 212th, 213th and 214th divisions replaced worn out divisions opposite the French Tenth and Sixth armies.\nPrelude\nAnglo-French plan\nFayolle planned attacks to capture Sailly-Saillisel, a twin village to the north-west of St Pierre Vaast wood, followed by outflanking attacks to the north and south, avoiding a frontal attack. Fayolle expected to be ready to attack Sailly-Saillisel by  but if an attack towards Rocquigny could begin earlier, the Fourth Army was to attack to cover the French left flank. Sailly-Saillisel was along the Péronne–Bapaume road and Saillisel lay at right angles on the east side, along the Moislains–St Pierre Vaast road and overlooked a shallow valley to the north towards Le Transloy. The difficulties of movement in the rear, wet weather in October and the terrain channelled the attacks of the Sixth Army into a gap between St Pierre Vaast Wood and the Fourth Army boundary. At the end of September, the Sixth Army took over the Fourth Army front at Morval, which widened the attack front to about . The French XXXII Corps, which held the front from Rancourt to Frégicourt, was to attack the Saillisels and I Corps to the left would attack eastwards from Morval, to capture Bukovina and Jata-Jezov trenches in the German fourth position in front of the Péronne–Bapaume road, then capture the north end of the Saillisels and reach Rocquigny.\nThe British Fourth, Reserve and Third armies were to be ready by 12 October, the Fourth Army to attack towards Le Transloy, Beaulencourt, the ridge beyond the Thilloy–Warlencourt valley to Loupart Wood (about a mile east of Irles). Before the main attack, the Fourth Army was to advance north-eastwards, to capture a spur west of Le Transloy and Beaulencourt and north to the edge of the Thilloy–Warlencourt valley. Haig thought that if there was normal autumn weather, the objectives could be achieved but some restrictions on artillery ammunition consumption were imposed and more aircraft were requested from England. An attack on 1 October was to advance the left flank, capture Eaucourt and part of the Flers line (also known as the Le Sars line) up to Le Sars. The Reserve Army was to advance towards Puisieux, as the right flank met the attacks from the south bank at Miraumont, enveloping German troops in the upper Ancre valley. The Third Army was to provide a flank guard north of the Reserve Army, by occupying a spur south of Gommecourt. Operations were to begin by 12 October, after the Fourth Army had attacked towards Le Transloy and Beaulencourt and the French Sixth Army had attacked Sailly-Saillisel. The French Tenth Army south of the Somme was to attack on 10 October, north of Chaulnes.\nFourth Army\nThe attack was to be conducted by III Corps and the New Zealand Division of XV Corps on the right flank, which was to advance its left, pivoting from a point in the Gird trenches,  east of Eaucourt. On 29 September, a day of rain and bright spells, the 6th Division and the Guards Division in XIV Corps on the right flank, took unopposed, some trenches east of Lesbœufs at  A company of the 8th Battalion York and Lancaster Regiment of the 23rd Division captured Destrémont Farm and gained contact with the 2nd Canadian Division (II Corps) on the right flank of the Reserve Army later on; a battalion of the 47th (1/2nd London) Division began to bomb its way up Flers Trench during the evening. On 30 September, the day was dull but dry; the battalion pushed the Germans back beyond Flers Switch Trench and a New Zealand battalion kept pace along Flers Support Trench.\nGerman preparations\nThe Germans had built new defensive lines during the battle and the first two were called the  (Switch Trench I Position/Allaines Line), a double line of trenches and barbed-wire several miles further back, as a new second line of defence along the ridge north of the Ancre valley, from Essarts to Bucquoy, west of Achiet le Petit, Loupart Wood, south of Grévillers, west of Bapaume to Le Transloy and Sailly-Saillisel. On the reverse slope of that ridge, the  (Switch Trench II Position/Armin Line) ran from Ablainzevelle to west of Logeast Wood, west of Achiet le Grand, the western outskirts of Bapaume, to Rocquigny, Le Mesnil en Arrousaise to Vaux Wood.  branched from  at Achiet le Grand and ran clockwise around Bapaume, then south to Beugny, Ytres, Nurlu and Templeux la Fosse. The first two German reserve lines had various British titles (Loupart/Bapaume/le Transloy/Bihucourt lines) and the third line was known as the Beugny–Ytres Switch.\nFrom 25 September to the beginning of October, Rupprecht relieved the 6th Bavarian Division, 50th Reserve Division and the 52nd Reserve Division with the 7th Reserve Division, 6th Bavarian Reserve Division and 18th Reserve Division opposite the Fourth Army, part of thirteen fresh divisions installed opposite the British. From  the six divisions from Le Transloy to the Ancre river were relieved by seven fresh divisions, two of which were then relieved by the 6th Division, 2nd Bavarian Division, 19th Reserve Division, 28th Reserve Division, 24th Division, 40th Division, 4th Ersatz Division, 5th Ersatz Division and Marinekorps-Flandern from the Belgian coast. From  the seven divisions from Le Transloy to the Ancre were relieved, as was one of the fresh divisions, by the 38th Division, 222nd Division, Bavarian Ersatz Division, 4th Guard Division, 58th Division, 1st Guards Reserve Division, 23rd Reserve Division and the 24th Reserve Division; in mid-November, the Marine Brigade reinforced the Guard Reserve Corps near Warlencourt.\nBattle\nFourth Army\n1 October\nAt  on a fine day, a deliberate bombardment began along the Fourth Army front and continued steadily until zero hour at  In the Gird trenches on the right flank, captured during the preliminary operations, the Special Brigade RE fired oil cylinders from 36 Livens Projectors, a minute before the attack by the New Zealand Division on the left of XV Corps (Lieutenant-General John Du Cane). Thirty of the cylinders burst on target, enveloping the objective in flame and smoke. Despite the bombs, German machine-gunners inflicted many casualties on the depleted 2nd Canterbury and 2nd Otago battalions of the 2nd New Zealand Brigade. The 2nd Canterbury captured quickly the Gird trenches up to Goose Alley and the east end of Circus Trench, which was on a south-west line down to the Flers trenches. The 2nd Otago attacked from Goose Alley and passed beyond the objective and The Circus, an empty German strong point. The New Zealanders reorganised on the Le Barque road and with reinforcements consolidated a new line, in contact with the 47th Division (Brigadier-General W. H. Greenly then Major-General George Gorringe) near Abbey Road. The New Zealanders lost many of the  still left during the attack and took\nOn the right flank of the III Corps (Lieutenant-General William Pulteney) area on the left flank of the Fourth Army, the 47th (1/2nd London) Division attacked with three battalions of the 141st Brigade and two tanks. The 1/19th London Regiment (1/19th London) got to within  of the German line, was forced under cover by machine-gun fire and waited for the tanks. The tanks drove left along the Flers trenches firing into them and the infantry captured the trenches easily, despite the many earlier casualties. As the support waves consolidated Flers Support Trench, the leading infantry pressed on past Eaucourt L'Abbaye (Eaucourt) and met the New Zealanders at the Le Barque road. The 1/20th London attacked Eaucourt and crossed the Flers trenches after the two tanks has passed by, swept through Eaucourt and gained touch with the 1/19th London. The tanks pressed on but bogged west of Eaucourt; the 1/17th London on the left flank had already been stopped by uncut wire and German machine-gun fire. During a counter-attack by part of II Battalion, Bavarian Reserve Infantry Regiment 17, the tanks were set on fire and abandoned.\n{| class=\"wikitable\"  style=\"float:right; margin:0 0 1em 1em; text-align:center;\"\n|+Weather(1 October – 11 November 1916)\n|-\n! Date\n!Rain(mm)\n! °F\n|-\n| 1||0||63–41||finedull\n|-\n| 2||3||57–45||wetmist\n|-\n| 3||0.1||70–50||rainmist\n|-\n| 4||4||66–52||dullwet\n|-\n| 5||6||66–54||dullrain\n|-\n| 6||2||70–57||sunrain\n|-\n| 7||0.1||66–52||windrain\n|-\n| 8||0.1||64–54||rain\n|-\n| 9||0||64–50||fine\n|-\n| 10||0||68–46||finesun\n|-\n| 11||0.1||66–50||dull\n|-\n| 12||0||61–55||dull\n|-\n| 13||0||61–50||dull\n|-\n| 14||0||61–50||dull\n|-\n| 15||3||57–41||rainfine\n|-\n| 16||0.1||54–36||suncold\n|-\n| 17||3||55–43||fine\n|-\n| 18||4||57–48||rainfine\n|-\n| 19||4||57–37||rain\n|-\n| 20||0||48–28||finecold\n|-\n| 21||0||45–28||finecold\n|-\n| 22||0||– –||finecold\n|-\n| 23||3||55–43||dull\n|-\n| 24||3||54–45||dullrain\n|-\n| 25||2||52–45||rain\n|-\n| 26||1||55–39||rain\n|-\n| 27||1||55–43||raincold\n|-\n| 28||8||55–41||wetcold\n|-\n| 29||7||53–45||wet\n|-\n| 30||7||61–48||wetcold\n|-\n| 31||0||63–46|| —\n|-\n| 1||3||59–46|| —\n|-\n| 2||3||59–48|| —\n|-\n| 3||1||59–48|| —\n|-\n| 4||2||64–52||wetcloud\n|-\n| 5||0||59–48||clear\n|-\n| 6||0||57–45||cloud\n|-\n| 7||12||55–45|| —\n|-\n| 8||2||57–43|| —\n|-\n| 9||0||54–30||brightclear\n|-\n| 10||0||50–30|| —\n|-\n| 11||0.1||55–32||mistfrost\n|}\nThe 50th (Northumbrian) Division (Major-General Percival Wilkinson) attacked with the 151st Brigade. On the right the 1/6th Durham Light Infantry (1/6th DLI) was exposed by the repulse of the 1/17th London, had many casualties from German machine-gun fire and was only able to capture a short length of Flers Trench. The 1/9th DLI (Lieutenant-Colonel R. B. Bradford) came up from reserve and Bradford managed to organise another attack, capturing the rest of Flers Trench by  In the centre, a composite battalion of the 1/5th Border, 1/8th DLI and the 1/5th Northumberland Fusiliers attached from the 149th Brigade on the left, benefited from an excellent barrage to advance and capture the Flers trenches before the defenders could react.\nOn the left flank of III Corps, the 23rd Division (Major-General James Babington) attacked with the 70th Brigade. The 11th Sherwood Foresters (11th Foresters) and the 8th King's Own Yorkshire Light Infantry (8th KOYLI) assembled forward of their trenches, which were on a south-east line from Destrémont Farm. On the right, the 11th Foresters captured Flers Trench and most of Flers Support then linked with the 151st Brigade. On the left, the 8th KOYLI faced determined resistance and only later was able to bomb the Germans back up Flers Trench and link with the 2nd Canadian Division on the Reserve Army boundary. The 9th York and Lancs went forward to reinforce and tried to probe Le Sars but was repulsed by small-arms fire from the houses. Communication with the rear broke down and the divisional and corps headquarters were not reliably informed of events until early on 2 October. The 47th (1/2nd London) Division headquarters realised that the 1/17th London had been repulsed and sent forward the tired and understrength 1/23rd London (142nd Brigade), which repeated the attack at  and was repulsed with\n2–6 October\nDuring the night of  the Germans were forced out of Flers Support on the 50th Division front, where the 1/6th and 1/9th DLI formed a flank guard on the right next to the 47th Division and defeated several German counter-attacks, with hand grenades and Stokes mortar fire. It began to rain at  and continued for the next two days. The 1/18th London relieved the 1/17th London and at midday on 3 October, patrols reported that there were few Germans in the trenches opposite Eaucourt. The battalion advanced nearly unopposed north-west of the farm and gained touch with the 1/20th London on the right and the 68th Brigade of the 23rd Division, which had relieved the 50th Division brigade. Opposite Le Sars on the left, the 69th Brigade took over from the 70th Brigade and on 4 October, was repulsed in a pre-dawn attack up Flers Support to cross the Albert–Bapaume road. The next Fourth Army attack had been set for 5 October but the rains forced Rawlinson to postpone the attack until 7 October. The Sixth Army agreed to the postponement so that the attacks of both armies would simultaneous.\nThe 47th (1/2nd London) Division occupied the rest of Flers Support on 4 October and during the night of 5 October occupied the site of a mill to the north-west of Eaucourt; the 23rd Division attacked to capture Flers Support north of the Albert–Bapaume road at  on 4 October. A small party of the 10th Battalion Duke of Wellington's Regiment cut through the barbed wire by hand and got a footing in the trench but retired after running out of grenades and ammunition. Two days later, the 11th Northumberland Fusiliers captured the Tangle east of Le Sars but found the area untenable and retired. The weather improved on 4 October, with high winds and little rain but low cloud made air observation difficult. On the XIV Corps front, it as was difficult to identify German outposts in trenches and derelict gun pits in front of the fortifications of Le Transloy, as it was for the British positions opposite. A high volume of German artillery retaliation when the preliminary bombardment began on 6 October, was maintained but caused few casualties to British troops waiting for zero hour at\n7 October\nThe XIV Corps objective was a trench line from  away and on the right flank the 56th (1/1st London) Division (Major-General Charles Hull) attacked with two brigades. On the right, in the 168th Brigade area, the 1/14th Battalion London Scottish found it difficult to maintain contact with the French on the right, who advanced eastwards rather than north-east. The Scottish captured a southern group of gun pits and pushed on to the south end of Hazy Trench  beyond. The 1/4th London was stopped by machine-gun fire from the northern gun pits and tried to outflank them on the right. On the left, the 1/12th London advance was stopped short of Dewdrop Trench to the north-east of Lesbœufs, which had only been bombarded by Stokes mortars as it was too close to the British front line. In the 167th Brigade area, the 1/1st London was repulsed in front of Spectrum Trench except on the left flank where bombers joined with the 1/7th Middlesex, after it captured Rainbow Trench, the south end of Spectrum Trench against determined resistance. The 1/14th London Scottish and the 1/4th London defeated a counter-attack but after dark the battalions were forced back, as were the French on the right.\nIn the 20th (Light) Division (Major-General William Smith) area two battalions of the 60th Brigade captured Rainbow Trench, shot at German troops who ran away and pressed on  to Misty Trench to gain touch with the 1/7th Middlesex on the right and the 61st Brigade on the left, which had reached its objective east of Gueudecourt, after the 7th KOYLI and the 12th King's Liverpool encountered a line of Germans advancing from Rainbow Trench to surrender. The battalions occupied Rainbow Trench and kept going to  to the south-east corner of Cloudy Trench. The 12th (Eastern) Division (Major-General Arthur Scott) on the right of XV Corps had not moved forward, so a defensive flank was formed on the left and a new trench (Shine Trench) dug from Cloudy Trench to the Beaulencourt road. About  of Rainbow Trench south-east of the road was still held by the Germans, who counter-attacked from Beaulencourt at about  and were repulsed by small-arms fire.\nIn the XV Corps area, the objective was set  forward along the north-west end of Rainbow Trench and Bayonet Trench (the west end of which, beyond the Flers–Thilloy road, had just been discovered), up to the Gird trenches. Just before zero hour a German machine-gun barrage began on the front trenches of the 12th (Eastern) Division and began an artillery bombardment, particularly on Gueudecourt, which held back the 37th Brigade on the right flank. The 6th Buffs next to the 20th Division got into Rainbow Trench with too few survivors to consolidate and retired. The 6th Royal West Kent on the left was stopped by the machine-gun barrage as were the 9th and 8th Royal Fusiliers of the 36th Brigade on the left, the parties of the 8th Royal Fusiliers which got into Bayonet Trench being overwhelmed. In the 41st Division (Major-General Sydney Lawford) area on the left of XV Corps, the German machine-gun barrage stopped the 32nd and 26th Royal Fusiliers of the 124th Brigade half-way to Bayonet Trench. Parties reached the trench, where they were reinforced by the 21st KRRC and 10th Queen's but by nightfall, the brigade had been reduced to a battalion of survivors. On the left flank, the 122nd Brigade used all four battalions who were also shot down. A Livens Projector bombardment of burning oil on the Gird lines failed but bombers from the 11th West Kent advanced a short way up both trenches. On the left flank, the divisional and corps boundary, the brigade got forward and linked with the 47th Division on the right of III Corps.\nIn the III Corps area, the 47th (1/2nd London) Division  and 23rd Division objective required an advance of , half-way into Le Sars and then capture the rest of the village when the offensive began on the Butte de Warlencourt and the Gird trenches up to the Flers trenches. The 47th (1/2nd London) Division  attacked with the 140th Brigade to capture Snag Trench along the east slope of a dip towards Warlencourt, about  forward and halfway to the butte. The 1/8th London on the right was stopped by a huge volume of machine-gun fire, as were the 1/15th and 1/7th London who were to pass through the 1/8th London and could only establish outposts near the Le Barque road, in touch with the 41st Division. The 23rd Division attacked on the right with the 12th DLI of the 68th Brigade, supported by a tank which attacked the German garrison in the Tangle and then turned left up the sunken road from Eaucourt to Le Sars, until hit by a shell. The 12th DLI was checked by machine-gun fire down the road from the village but the 9th Green Howards of the 69th Brigade got into the south-west end. In the centre, the 13th DLI was to capture the rest of the village and attacked at\nThe battalion met the Green Howards at the village crossroads and after a determined resistance, the German defence collapsed. The 12th DLI had dug in along the sunken road beyond the Tangle and pushed posts forward on the right flank. The 13th DLI and Green Howards dug posts around the village and prepared to advance on the Butte de Warlencourt but no reinforcements were available. Twenty minutes after zero hour, the 11th Battalion West Yorkshire Regiment made a frontal attack on Flers Support Trench north of Le Sars but was stopped by artillery-fire and small-arms fire from the left flank. A second attempt succeeded, with bombers attacking along the trench from Le Sars, retreating Germans being shot down by the British infantry and the divisional artillery. The 10th Duke of Wellington's arrived later and by dark, the 69th Brigade had occupied the Flers trenches to a point  inside the Fourth Army boundary.\n8 October\nThe rain came back during the night and on 8 October the Fourth Army divisions removed casualties and consolidated positions. On the left flank the 23rd Division attacked again at  with the Reserve Army. Two companies of the 8th York and Lancs from the 70th Brigade, captured the Flers trenches up to the army boundary and occupied an abandoned post  north-west of Le Sars. The 47th (1/2nd London) Division  made a night attack on Snag Trench with the 1/21st and 1/22nd London, by crawling forward to rush the trench as the barrage lifted. The trench was entered on the left but the parties were forced out by fire from the right. The 1/22nd London set up posts on the Eaucourt–Warlencourt road and gained touch with the 23rd Division to the west. On the army boundary with the Sixth Army, the 56th Division moved back from Rainy Trench north-east of Lesbœufs and most of Spectrum Trench to the north, for a British preparatory bombardment and then attacked at  with the 169th Brigade on the right. The 1/5th London (London Rifle Brigade) captured Hazy Trench, despite losing contact with the French 18th Division on the right and machine-guns concealed in shell-holes stopped the 1/9th London and the 1/3rd London (167th Brigade) advance on Dewdrop and Spectrum trenches. After dark the battalions were withdrawn to the start line and German troops occupied Rainy trench unopposed.\nLate on 8 October, Rawlinson ordered another attack, once XV Corps had reached its objectives, anticipated to be by 12 October, when the Sixth Army expected to have captured Sailly-Saillisel to the south-east. The rain stopped early on 9 October and from  the weather was fine but the state of the ground made divisional reliefs slow and laborious. From  the XIV Corps replaced the 56th and 20th divisions with the 4th Division (Major-General William Lambton) and the 6th Division (Major-General Charles Ross). In XV Corps the 41st Division was replaced by the 30th Division (Major-General John Shea) and the 9th Division (Major-General William Furse) and 15th Division (Major-General Frederick McCracken) took over from the 47th (1/2nd London) and 23rd divisions in III Corps. The new division had little time to study the ground or dig assembly trenches and Furse was refused a 48-hour postponement. The Royal Flying Corps (RFC) attempted to get new photographs of the German defences but the light was too poor for much to be achieved.\n12 October\nZero hour was  and the 4th Division on the right of XIV Corps attacked with the 10th Brigade next to the French 18th Division (IX Corps). The 1st Battalion, Royal Warwick advanced  and dug Antelope Trench south of Hazy Trench, gained touch with the French and repulsed a counter-attack in the evening. The battalion advance was repulsed at Rainy and Dewdrop trenches north-east of Lesbœufs, along with the 1st Royal Irish Fusiliers further to the left. On the left of the division the 12th Brigade attacked Spectrum Trench after a Stokes mortar bombardment; parties of the 2nd Duke of Wellington got into the trench and linked with the 2nd Lancashire Fusiliers in the north end of the trench. An attempt by groups from both battalions to attack over the spur to Zenith Trench was repulsed. In the 6th Division area north of the Le Transloy road, the 2nd York and Lancaster, on the right of the 16th Brigade was also repulsed in front of Zenith Trench.\nIn the 71st Brigade area to the left, the 9th Suffolk in a salient formed by Misty and the east end of Cloudy Trench were not to advance and in the 18th Brigade on the left of the division, the 1st West Yorks attacked Mild Trench and the rest of Cloudy Trench by a frontal attack and a flank attack by bombers, which was repulsed. The 14th DLI on the left flank got into Rainbow Trench and bombed dugouts along the sunken Beaulencourt road, to link with the 1st West Yorks. On the left of the road the 14th DLI gained touch with the 88th Brigade detached from the 29th Division to the 12th (Eastern) Division on the right of XV Corps. The Royal Newfoundland Regiment on the right and the 1st Essex on the left, captured part of Hilt Trench and the extension of Rainbow Trench and then part of the 1st Essex pressed on to Grease Trench but were ordered back to the start line at  because the 35th Brigade on the left had not managed to get forward. The Newfoundlanders held on at Hilt Trench, bombed further up and took part of the 1st Essex objective. In the 35th Brigade attack, the 7th Suffolk and the 7th Norfolk tried to cut through barbed wire by hand opposite Bayonet Trench against massed small-arms fire, after which the survivors were pinned down until dark and then retreated.\nThe 30th Division attacked on the left of XV Corps with the 2nd Royal Scots Fusiliers and the 17th Manchester of the 90th Brigade. The Royal Scots managed only to advance  into machine-gun fire and then withdrew as some parties of the 17th Manchester got into Bayonet Trench before retiring. On the left of the division, the 89th Brigade attacked on the right with the 2nd Bedfordshire, which tried to bomb up the Gird trenches but were only able to take a small length of Bite Trench. On the left, the 7th King's Liverpool was stopped by enfilade fire from the north-west, the preliminary bombardment having failed to suppress the German machine-guns, which were dispersed over a wide area.\nIn the III Corps area the 9th (Scottish) Division on the right had to capture Snag Trench, then the Butte de Warlencourt and the Warlencourt line. The Tail ran back from Snag Trench to the butte and the Pimple at the west end of Snag Trench, with the help of enfilade fire from the 15th (Scottish) Division to the left. Little Wood and the butte were bombarded with smoke by 4 Special Company RE. In the 26th Brigade on the right, the 7th Seaforth Highlanders was caught by machine-gun fire as soon as it attacked and with the reinforcement of the 10th Argylls managed only to push on for  and dig in during the night. On the left flank the 1st South African Brigade attacked with the 2nd Regiment followed by the 4th Regiment, which were held up by long-range machine-gun fire and lost direction in the smoke drifting from the butte. Parties dug in half-way to Snag Trench and some stayed in no man's land until the following morning.\n14–17 October\nAfter the poor results of the attack on 12 October, Rawlinson concluded that the weather delays had enabled the defenders to recover and that a deliberate attack after methodical bombardment was necessary, before another attack on 18 October. On 13 October, he issued an operation order in which he stressed the necessity of improving routes to the front line and the preparation of good assembly trenches parallel to the German defences. A steady bombardment was to begin immediately and XIV Corps was warned to capture Zenith, Mild and the rest of Cloudy trenches, before the general attack. XV Corps was to capture the Gird lines south-east of the Eaucourt–Le Barque road and Snag Trench was to be captured by III Corps, all by night attacks supported by tanks, where practical. On 14 October, the XIV Corps attempted a surprise attack at  with the 2nd Seaforth of the 4th Division, which got into Rainy Trench and gun-pits south of Dewdrop Trench and were then forced out by a counter-attack. The 2nd Royal Dublin Fusiliers tried to capture gun-pits in front of Hazy Trench at the same time and were also repulsed.\nIn the 12th Brigade, the 1st King's Own tried to bomb down Spectrum Trench to Dewdrop Trench in the evenings of  October and in a pre-dawn attack on 15 October, the 2nd Sherwood Foresters in the 6th Division took the gun-pits in front of the British-held section of Cloudy Trench and took several prisoners. On the left of the division the 11th Essex overran Mild Trench and bombed up the Beaulencourt road before being forced back by a counter-attack. In the III Corps area, the 3rd South African Regiment attacked after dark on 14 October, captured the Pimple and  of Snag Trench. The rain gradually abated and 17 October began fair but clouded over and rain fell again during the night. The British bombardment had continued as planned but the German artillery reply was vigorous leading up to zero hour at  on 18 October.\n18–20 October\nOn most of the brigade fronts, assembly positions had been marked with white tape and compass bearings taken of the direction to the objectives but at zero hour, the British positions were flooded. The moon was obscured by low clouds, troops slipped and fell in the mud and weapons were clogged, leaving only hand grenades and bayonets with which to fight. On the right the 4th Division attacked with the 11th Brigade to take Frosty, Hazy, Rainy and Dewdrop trenches, while in the French sector the attack began at  Groups of the 1st Rifle Brigade reached the gun-pits before Hazy Trench and were forced back, the 1st East Lancs were forced under cover in front of Dewdrop Trench, by the fire of hidden machine-guns. The 1st King's Own of the 12th Brigade and the German defenders mutually attacked and counter-attacked around Spectrum Trench and then the King's Own bombed along Spectrum for  towards Dewdrop Trench. In the 6th Division, the 9th Norfolk attacked Mild and Cloudy trenches but was bombarded before zero hour and moved so slowly through mud that it lost the barrage. The battalion captured the north-west end of Mild Trench and then repulsed a counter-attack as dark fell. (After dark on 19 October, a platoon of the 1st Somerset Light Infantry found Frosty Trench unoccupied and defeated a counter-attack.)\nThe XV Corps made flank attacks because the centre faced a dip either side of the Flers–Thilloy road. The 12th (Eastern) Division on the right attacked Grease Trench with the 2nd Hampshire and 4th Worcester battalions and the south-east end of Bayonet Trench with the 9th Essex battalion from the 35th Brigade. The 2nd Hampshire and the 4th Worcester took Grease Trench with few losses but then had many casualties trying to press on. The Worcester blocked Hilt Trench on the left after the 9th Essex were not able to advance, except for one company which got into Bayonet Trench and was then bombed out by counter-attacks from the flanks. On the left of the 30th Division the 2nd Green Howards almost reached the west end of Bayonet Trench before being stopped by showers of hand-grenades. Parties bombed up part of Bite Trench but reinforcements were stopped from moving up by the mud. On the left the 18th King's and 2nd Wiltshire attacked the Gird lines and found uncut wire on the right and enfiladed from the left, most of the 2nd Wiltshire being killed.\nTwo tanks had been brought up to Flers in case the night attacks failed and during a lull at  one bogged in mud and the other drove to the end of Gird Trench and machine-gunned it for twenty minutes, killing many Germans who ran back to the north-east. The commander signalled the infantry to move up but the infantry were so disorganised and exhausted that none moved. The tank drove along Gird Trench to the Le Barque road and then returned. III Corps attacked Snag Trench again as smoke and lachrymatory bombs were fired from the 15th (Scottish) Division front to try to suppress German fire from the butte and from Warlencourt village. The 5th Cameron Highlanders, on the right of the 9th (Scottish) Division, took a trench from the Le Barque road to  from the Nose (the junction of Snag Trench and the Tail) and met some of the 2nd Wiltshire.\nA German counter-attack on the right got a footing in the trench, until another attack after dark drove them back and on the left two companies of the 1st South African Regiment overran Snag Trench, pressed on and were shot down by machine-gun fire from the butte, apart from a small group who got into Snag Trench next to the Cameron. At dawn the South Africans tried to bomb along Snag from the Pimple and at  attacked from both flanks. The South Africans managed to advance, leaving the Germans occupying only  of the trench around the Nose as night fell. The rain continued during 19 October; at dawn, German parties accompanied by a  detachment advanced along the Tail to attack eastwards along Snag Trench. The South Africans retreated towards the 8th Black Watch which had relieved the Cameron as a counter-attack on the right flank was repulsed. British artillery maintained the bombardment on the Nose and Tail areas but the South African Brigade was too exhausted to attack again and after dark the 27th Brigade took over all the 9th (Scottish) Division front, struggling through mud and water. The 6th King's Own Scottish Borderers (KOSB) was considered fit to attack at  on 20 October and in confused fighting, captured, lost and retook the Nose. By dark the 6th KOSB had control of Snag Trench and some Royal Scots had advanced along  of the Tail.\nGerman 1st and 2nd armies\n1–3 October\nIn the early autumn, many German divisions which had fought earlier on the Somme were brought back for a second period, in which their performance was considered inferior, despite replacements being of good quality, because of their lack of experienced NCOs and junior officers. The 6th Bavarian Reserve Division took over the defences of Eaucourt l'Abbaye (Eaucourt) on 26 September and suffered many casualties to artillery-fire. On 1 October, prisoners taken from Bavarian Reserve Infantry Regiment 21 (BRIR 21) of the division said that  (Livens Projectors) had caused much damage. BRIR 21 recorded the capture of the II and III battalion headquarters and that attempts to counter-attack failed. The II Battalion, BRIR 17 counter-attacked south-east down the Flers trenches past two bogged-down tanks but hope to recover Eaucourt were abandoned during the afternoon. The III Battalion, BRIR 17 re-assembled on the Eaucourt–Le Sars road on 2 October and was joined by III Battalion, BRIR 16 and parties of Infantry Regiment 362 of the 4th  Division garrisoned the village. and  in the northern flank of the 1st Army and more air units were transferred to the Somme, increasing the number to 46.}}\nOn the night of  BRIR 21 was relieved near Eaucourt by BRIR 16 but the fresh troops were unable to prevent the loss of Eaucourt. The infantry were ground down by the weather conditions and British attacks. The commander of I Battalion, BRIR 16 reported that battlefield conditions were extraordinary, with cold food and artillery-fire causing severe problems, particularly short shooting by German guns, the high number of casualties having depressed morale, made worse by the lack of opportunity to remove the bodies strewn around trenches and tracks. Poor hygiene caused many non-battle casualties, with  of the men having severe diarrhoea. The report was sent to the regiment commander who could only pass it on. By 3 October, the 4th  Division had relieved the 7th Division west of the Bapaume road and took over the Bavarian right up to Le Sars, by when BRIR 17 casualties had risen to\n7–8 October\nOn the night of  Infantry Regiment 68 (IR68) of the 16th Division and Reserve Infantry Regiment 76 (RIR 76) of the 17th Reserve Division relieved IR 163 at the Saillisels, both regiments having fought against the British on the Somme earlier in the battle. The troops of the 16th Division had spent several days digging part of  by day and night in the rain, after marching  from bivouacs in muddy fields, without means of getting dry, before receiving the order to move forward to the front line. On 10 October, another order came that the division would not be relieved for some time and must keep troops in reserve back in . The front line was hard to define and led IR 68 and RIR 76 to argue over the inter-regimental boundary; French attacks and artillery-fire had already made the southern approach to the village untenable. The troops were encouraged by the evidence of the greater effort in the air being made over the Somme, reporting that the \"aerial plague was less intense\" than during their first tour.\nThe 18th Reserve Division relieved the 52nd Reserve Division in late September and Reserve Infantry Regiment 84 on the left of the division lost 70 prisoners on 7 October. The British 20th Division took prisoners from Reserve Infantry Regiment 72 (7th Reserve Division) on the Gueudecourt–Beaulencourt road and Reserve Infantry Regiment 66 to the left. Reserve Infantry regiments 36 and 72 (7th Reserve Division) lost prisoners at Rainbow Trench. Snag Trench was held by III Battalion, BRIR 16 of the 6th Bavarian Reserve Division. From  the British took 528 prisoners from Infantry regiments 360, 361, 362 of the 4th  Division, the I Battalion, Infantry Regiment 360 having been attacked during a relief by III Battalion, Infantry Regiment 360. The 47th Division captured 84 prisoners of Reserve Infantry Regiment 31 (RIR 31) and 84 of the 18th Reserve Division. RIR 86 had moved left to close a gap made by the French, which moved RIR 31 opposite the British right flank. In the 16th Division area opposite the French, IR 68 and IR 28 made several counter-attacks against French troops who had reached the church in Sailly, greatly helped by the German artillery which inflicted many French losses before the fighting closed to hand-to-hand.\nThe new tactic of holding the front line with the minimum of men increased the burden on German artillery, which had to commence firing as soon as the French or British attacked but the extent of Allied artillery-fire forced the gunners to rely on flares from the front line instead of telephones. A field-gun regiment at the Nurlu–Péronne-Moislains–Templeux-la-Fosse crossroads covered the defences of St Pierre Vaast wood,  away, from open positions vulnerable to French shelling. The distance from the wood was too great for observed fire; when shooting from the map, shell dispersion made for a large beaten zone, impossible to correct and some shells fell short onto German positions, despite careful fire control and gun laying. Steel was being used instead of brass for shell cases, which caused stoppages but the artillery still managed to fire  per day.\n12 October\nThe 16th Division at the Saillisels repulsed several attacks in the morning and then received a bombardment of \"staggering intensity\", before the French attacked again. Infantry Regiment 68 lost another  but held on with IR 76 which was relieved that night. Liaison between the Bavarians and the 16th Division was poor and both regiments argued about responsibility for a gap between them. The companies of the 6th Bavarian Reserve Division on the Bapaume–Albert road opposite the British, were down to about 35 men each, all suffering from dysentery, exhaustion, hunger and exposure, to hold an area of . Reserve Infantry Regiment 31 recorded many losses at Zenith Trench. The 19th Reserve Division had relieved the 7th Reserve Division and on the right the 6th Division had moved up and taken over the left of the 6th Bavarian Reserve Division opposite the III Corps of the British Fourth Army. Reserve Infantry Regiment 92 of the 19th Reserve Division was opposite the left of the British 6th Division. About  were taken from Infantry Regiment 64 of the 6th Division during the loss of Hilt Trench, the left flank being rolled up. A counter-attack stopped the British advance but contact with Reserve Infantry Regiment 92 of the 19th Reserve Division on the left was lost.\nInfantry Regiment 24 of the 6th Division and parts of Bavarian Reserve Infantry regiments 16 and 21 of the 6th Bavarian Reserve Division were opposite the 30th Division. Snag Trench was held by Bavarian Reserve Infantry Regiment 20. After the fighting on 12 October, the 2nd Bavarian Division relieved the 18th Reserve Division, the 40th Division relieved the 6th Bavarian Reserve Division on the night of  and the 24th Division took over from the 4th  Division. On 12 October, men of the German 15th Division refused orders to move up to the front line.}} French attacks were made in the afternoons after artillery bombardments and on 14 October, IR 68 found that half its casualties had been caused by German artillery firing short. The dispute about regimental boundaries continued and on 15 October the French found the gap and got into Saillisel. Several determined counter-attacks were made to eject them but by 17 October the counter-attacks had failed. (The Bavarians blamed the Prussians of IR 68, which after the war took 58 pages of the regimental history to explain that the position had been compromised all along, that German artillery had bombarded them constantly, tactical communication had been lost and orders could not be related to the ground.)\n18–20 October\nThe rest of the Saillisels had been held and the German hold on St Pierre Vaast wood stopped the French from rolling up the German defences from north to south. The 4th Division took prisoners from Bavarian Infantry Regiment 15 of the 2nd Bavarian Division and the II Battalion, Bavarian Infantry Regiment 15 suffered 50 per cent casualties. Most of Reserve Infantry Regiment 92 was captured and Infantry Regiment 64 of the 6th Division lost  of the I Battalion. Infantry Regiment 181 of the 40th Division found that the mud reduced the effect of the British bombardment and the infantry were unable to make a quick advance. Prisoners were taken from I and II battalions, Infantry Regiment 104 at Snag Trench and the III Battalion conducted a counter-attack. On 19 October, the storm detachment of the 40th Division counter-attacked in two columns with flame-throwers, a machine-gun section and the best men of I Battalion, Infantry Regiment 104; the advance of the left column was halted by one of the flame-throwers exploding. Most of the survivors of Infantry Regiment 104 were relieved by III Battalion, Infantry Regiment 134. The trenches of Infantry Regiment 104 were smashed by artillery-fire and the troops were withdrawn, according to the new policy, of avoiding pointless casualties by abandoning outposts of no tactical value.\n24 October\nRupprecht wrote in his diary that the recapture of the north end of Sailly was needed to regain artillery observation but that this would have to wait for the arrival of the XV Corps (General Berthold von Deimling) with the 30th and 39th divisions. Below and the commander of the IX Reserve Corps, General Max von boehn, had agreed that the power of resistance of the Germans on the Somme was much reduced and that officer casualties meant that it could not be increased. The French First Offensive Battle of Verdun  temporarily stopped the flow of reinforcements to the Somme front but substantial artillery and air reinforcements were already on the Somme. The decline in the power of the Anglo-French artillery caused by poor weather and  attacks on artillery-observation machines, enabled the German infantry to mount a costly but successful defence, helped by the knowledge that the onset of winter would end the battle.\nAir operations\nBy October, the Germans had managed to assemble about  in  from Péronne to Hannescamps, 17  with about  aircraft,  flights () with about  three bomber-fighter squadrons () and two independent flights with about  to escort them, mainly of C-type, two-seater, armed biplanes and three fighter squadrons () with about  Jagdstaffel 2 () Hauptmann Oswald Boelcke) had been established at Bertincourt on 27 August and on 16 September, received new Albatros D.I and D.II fighters. The concentration of aircraft, particularly the superior fighters, enabled the Germans to challenge Anglo-French air superiority, at least for short periods.\n\"Barrage flights\" to stop aircraft crossing the German lines were abolished and airmen were ordered over the Anglo-French lines instead, to fight through to their objectives in large formations. Aircraft with more powerful engines, that could climb higher than British fighters had arrived in August and managed to photograph the battlefield. More balloon units arrived, which eventually had fifty balloons, half of those on the Western Front. All of the light motorised anti-aircraft guns in the army were sent to the Somme. Methodical observation of artillery-fire and the reforms introduced by Gallwitz made bombardments more efficient and German infantry began to regain confidence in the air arm. On 6 October, the Imperial German Flying Corps () was reformed as the  (German Air Force).\n1–11 October\nDuring September, the monthly wastage (losses from all causes) in RFC fighters and long-range reconnaissance aircraft was 75 per cent and the new faster, more manoeuvrable German fighters coming into service, threatened Anglo-French air superiority on the Somme. At  on 1 October, observers of 34 Squadron and 3 Squadron watched the attack by III Corps and the New Zealand Division of XV Corps on Eaucourt l'Abbaye and the defences either side, on a  front. The attack on Eaucourt failed but on the rest of the attack front the infantry followed a good barrage onto their objectives and were also able to send patrols into Le Sars. The commander of 34 Squadron, Major John Chamier reported that\nthe steady bombardment changed into a most magnificent barrage....the barrage appeared to be the most perfect wall of fire in which it was inconceivable that anything could live.... The 50th Division...were seen to spread out from the sapheads and forming up trenches and advance close up under the barrage, apparently some  away from it. They appeared to capture their objective very rapidly and with practically no losses while crossing the open.... To sum up: the most startling feature of the operations as viewed from the air was (1) the extraordinary volume of fire of our barrage and the straight line kept by it, (2) the apparent ease with which the attack succeeded where troops were enabled to go forward close under it. (3) The promiscuous character and comparative lack of volume of the enemy's counter-barrage.|John Chamier}}\nII Corps of the Reserve Army on the left of III Corps, had attacked at  but was repulsed by a huge amount of German artillery-fire and frequent counter-attacks. In three hours, RFC observers sent down 67 zone calls to the II Corps counter-battery group and 39 batteries were reported by observers in balloons.; each map square was divided into four sections  square. The observer used a call sign of the map square letter and then the zone letter, to signal to the artillery. All guns and howitzers up to  able to bear on the target, opened rapid fire using corrections of aim from the air observer.}} On 2 October, continuous rain began and eight German aircraft flew low over the British lines between Morval and Lesbœufs, where one was shot down by ground fire, while the British aircraft were on the ground. On 6 October, German aircraft had reconnoitred and several strafed troops of XV Corps. The Fourth Army attacked again on 7 October in dull and windy weather and the German airmen returned to the British artillery lines near Flers and Gueudecourt and directed German counter-battery fire onto the British guns.\nBritish fighter pilots from IV Brigade were sent to the scene but the Germans had gone by the time they arrived. RFC observers watched the British attack but the strong westerly wind made their aircraft appear to be stationary in the air, when the pilots turned into the wind to allow the observers to study the ground. German infantry fired on the aircraft, two crew were wounded and several aircraft had to be flown back to make emergency landings. Rawlinson complained at the quality of the reconnaissance reports, which with the lack of observation during the rain delays before the attack, led to the British bombardments and barrages being inaccurate, which contributed to the failure of the Fourth Army except east of Gueudecourt and at Le Sars. The German counter-barrage had been prompt and accurate, helped by the success of the reconnaissance flights before the attack.\nOn 9 October, German aircraft bombed the rear areas of III Corps at  and within minutes four pilots from 18 Squadron and 21 Squadron, were dispatched to raid illuminated aerodromes from which the bombers had come but none were seen; Cambrai station and villages around Bapaume were bombed instead. A train hit earlier by 13 Squadron, which had also bombed Bapaume and Quéant stations, was hit again. Next day the weather improved and every British offensive patrol was attacked; Sopwith 1½ Strutters from 70 Squadron fought seven German fighters over their airfield at Vélu; other British aircraft joined in but found it impossible to keep the German aircraft in their sights because of their manoeuvrability. The German aircraft eventually flew away after one aeroplane each was shot down; three more German aircraft were lost and a British aircraft was shot down into the British lines near Morval from which the crew escaped. Another aeroplane force-landed at Pozières and a 23 Squadron F.E.2b crashed into a shell-hole with a dead pilot. During the night, 18, 19 and 13 squadrons bombed Cambrai and Vitry stations and the aerodrome at Douai.\n12–21 October\nOn 12 October, the Fourth Army attack was repulsed except near Gueudecourt, partly because of a lack of air observation, which led to an inadequate preparatory bombardment. The weather remained bad until 16 October when three aircraft of 18 Squadron bombed Cambrai station, one of which was shot down as they returned. German aircraft also bombed the airfield of 9 Squadron, wounding two ground staff and destroying one aeroplane and damaged another. Seven BE 12s of 19 Squadron bombed Hermies station and the airfield in the morning, then Havrincourt and Ruyaulcourt in the afternoon, losing two aircraft. The reconnaissance and artillery-observation aircraft of IV and V brigades flew many sorties against much German fighter opposition. A 15 Squadron aircraft was attacked by five fighters near Hébuterne and shot down and another aircraft was attacked over Warlencourt and returned with a wounded observer. IV Brigade offensive patrols lost one aircraft and had one pilot wounded, shooting down three German aircraft; another was shot down by a V Brigade offensive patrol.\nThe better weather continued on 17 October and a supply dump was blown up at Bapaume station. A reconnaissance by Third Army aircraft at the north end of the Somme front, met twenty German fighters and two aircraft were shot down by each side. A British aircraft was driven down by German fighters and two German aircraft were forced down by 24 Squadron near Vélu; rain and sleet then stopped flying for two days. On 20 October, aircraft of 11 Squadron on photographic reconnaissance near Douai, were attacked by , which shot down two aircraft and damaged two more. Thirty-three German aircraft crossed the British front line and made many attacks on British aircraft; three German aircraft were shot down and seventeen claimed damaged. German night bombers attacked Querrieu, Corbie and Longueau, where an ammunition wagon was blown up; British aircraft attacked Vélu and Péronne. Quéant station was bombed by thirty aircraft and escorts and one bomber was shot down. After the bombers reached British lines, one of the escorting Nieuport 17s turned back but was forced down in a dogfight with a faster German aircraft. On other parts of the Somme front two German aircraft were shot down, three damaged and ten driven down.\n22 October–November\nOn 22 October there were many sorties by German flyers. Six aircraft attacked a 1½ Strutter of 45 Squadron and wounded the observer, who shot one down. Later in the day, three 45 Squadron aircraft were shot down and an F.E.2b shot down one aircraft and damaged another, before the observer was mortally wounded; four British aircraft were shot down beyond German lines. During 23 October, two Reserve Army artillery observation aeroplanes were shot down by . On 26 October, despite poor weather both sides flew many sorties; a fight between five Airco DH.2s of 24 Squadron and twenty Halberstadt D.IIs was indecisive but later in the day, eight aircraft led by Boelcke, shot down one British observation aircraft, forced down two more and a British fighter which intervened. One German fighter was then shot down when a formation of British fighters from 32 Squadron turned up. Boelcke was killed on 28 October, when he collided with a German aircraft during an attack on two British fighters, which returned safely.\nFor the rest of the battle of the Somme, both sides flew in rain, mist, sleet and westerly gales, often at dangerously low heights, to direct artillery and attack troops with guns and bombs. 3 November was a clear day and German aircraft shot down five British aircraft. On the night of 6 November German night bombers hit an ammunition train near Cerisy, which exploded next to a cage for German prisoners of war and devastated the area. Better weather came on 8 November and many German aircraft made ground attacks on British troops, a tactic which the  began to incorporate systematically into its defensive operations. The British attempted to divert German attention next day, with bombing raids on Arleux and Vraucourt. The raid on Vraucourt by twelve bombers and fourteen escorts became the biggest air fight of the war, when approximately thirty German aircraft attacked the formation as it crossed the front lines. Most of the bombs were dropped over the target but six British aircraft were shot down and three German aircraft were claimed. Three more British aircraft were shot down later in the day; one pilot was killed, one wounded and an observer were wounded in aircraft which returned.\nThe railway station at Vitry and German airfields at Buissy, Vélu and Villers were attacked after dark, while German night bombers attacked the airfield at Lavieville. The British attacked Valenciennes aerodrome next morning, where five parked aircraft, hangars and sheds were bombed. Next day, German air operations were less extensive; three aircraft were shot down and three damaged for the loss of one British aeroplane. Naval 8 drove down two German aircraft on 10 November and overnight 18 Squadron retaliated for the attack on their airfield at Lavieville by bombing Valenciennes, Vélu, transport on the Bapaume road, balloon sheds, a train near St. Léger and a second train which was set on fire; a German headquarters at Havrincourt Château and Douai aerodrome were also attacked. German bombers attacked Amiens station and returned on the night of  when one aircraft was forced down with engine-trouble and the crew captured.\nFlanking operations\nTenth Army\nThe Tenth Army attacked from  and  during the Battle of Le Transloy, after being reinforced by the XXI Corps (General Paul Maistre) and the II Colonial Corps (General Ernest Blondlat). On 10 October the army attacked on a  front in the centre of the army area towards Pressoir, Ablaincourt and Fresnes. The French captured the German second position around Ablaincourt and took about  but south of Estrées, the attack by the 51st Division on Chaulnes was contained in Bois 4 to the north-west. On 14 October, an attack by the 10th Colonial Division and two other divisions on the left flank, next to the Sixth Army boundary, captured the trenches opposite and took about  the French then paused to consolidate the ground around Ablaincourt, which had turned into a vast lake of mud and repulsed several German counter-attacks. The army began preparations for an attack later in October to capture the Butte de Fresnes and cut the Chaulnes–Péronne railway but the weather, the state of the ground, exhaustion of the infantry and the increased powers of resistance of the German 2nd Army slowed the French advance.\nThe Tenth Army had failed to advance on the northern flank against Barleux in the Sixth Army area, where the XXXIII Corps on both sides of the Somme, had attacked again in the south on 18 October, to counter German mining and improve the line from La Maisonnette north to Biaches. An attack to clear the approaches to the higher ground on which lay Villers-Carbonnel and Fresnes to the south-east was forestalled on 29 October, when the Germans bombarded La Maisonette for eight hours with high explosive, gas and lachrymatory shell and then the 206th Division attacked with Infantry Regiment 359. A battalion of the 97th Infantry Regiment was overrun and  taken, which left a gap in the French line for several days and the attack on Barleux had to be cancelled. On the right (southern) flank of the army, the 51st Division was unable to advance further in Bois 4 on 11 October. During the night a counter-attack by German storm-troops and a flame-thrower detachment destroyed a battalion of the 25th Regiment and a French attack on 21 October, began a period of local attacks and counter-attacks which lasted into November.\nSixth Army\nThe Sixth Army attacked on   Opposite the Sixth Army,  , reserve position) the fourth German defensive position built on the Somme, ran along a dip at the top of the shallow valley between the Saillisels and Le Transloy, in front of which the sunken road from Le Transloy to the Morval–Saillisel road, known as Baniska and Tours trenches, had also been fortified. On the right flank of the attack, the Saillisels were covered by the Prilip to the Portes de Fer and Négotin line just east of Rancourt, which met the west end of St Pierre Vaast wood at Reuss Trench and the Carlsbad, Terplitz and Berlin trenches about  further back. A strong point around Bois Tripot and Château Sailly-Saillisel covered the southern approaches to the villages. The villages were bombarded by super-heavy    ready for the attack on 7 October when the Fourth Army to the north attacked.\n7 October\nIn the centre, the I Corps (General Adolphe Guillaumat) captured the line from Prilip to Portes de Fer to Négotin in early October and on 7 October, the 40th Division captured Terplitz and Berlin trenches, formed a flank on the south-west fringe of St Pierre Vaast Wood and gained a small part of Reuss Trench (later lost). The 56th Division to the left managed to advance  up the slope west of the Saillisels, captured Carlsbad Trench and gained a footing in the Bois Tripot strongpoint beyond, which gave the French observation of the ground towards the Péronne–Bapaume road and the Saillisels. The attack was the most successful on the north side of the Somme but fell far short of Rocquigny and on the left flank I Corps, which had been in the line since August, was relieved by the IX Corps (General H. F. A. Pentel) ready for the next attack on 12 October. On the right flank, the attack of the XXXIII Corps (General A. Nudant) south of Bouchavesnes from  failed, due to an ineffective bombardment and offensive operations were suspended for the winter.\n12–18 October\nIn the second week of October, the XXXII Corps (General Henri Berthelot until 16 October then General M. E. Debeney) took over the right flank of I Corps and on 12 October, the corps got into Sailly-Saillisel but was forced out by German counter-attacks. On 15 October, the 66th Division exploited a crushing bombardment to capture the remainder of Bois Tripot, Château Saillisel; the 152nd Infantry Regiment and the 68th Battalion Chasseurs Alpins infiltrated between Prussian and Bavarian positions and spent the next six days fighting hand-to hand in the ruins. The 94th Infantry Regiment of the 66th Division held on against several German counter-attacks around the Péronne–Bapaume and Sailly-Saillisel to Moislains crossroads up to 29 October.}} On the right flank, the XXXII Corps Chasseurs gained a foothold in Reuss Trench but more attacks to capture the east side of Sailly-Saillisel were postponed because of bad weather until 5 November and took until 12 November to complete.\nThe 18th Division (IX Corps) attack on Bukovina Trench failed as did several later attacks and Fayolle sacked Pentel, despite the careful training he had given the corps before it entered the line. The 18th Division reported afterwards that ground observation posts had only a partial view over the trench, air observation was limited by frequent fog, rain and high winds. The French approach was up a  slope, full of shell-craters and mud dotted with hidden machine-gun nests, dominated by German artillery and observation aircraft. French light machine-guns jammed and the infantry struggled through knee-high mud. On 17 October an attack on Baniska Trench failed when the French barrage fell short onto the 32nd Infantry Regiment as it waited for zero hour in an advanced jumping-off trench. The German counter-bombardment caught the support waves in the French front line and the advanced troops were caught in crossfire from machine-gun nests set up in front of Baniska Trench. The troops furthest forward were forced under cover, short of the trench and those on the flanks were unable to advance, which left the 32nd Infantry Regiment in a salient and bombarded by their artillery again, losing  in the attack. Baniska Trench was eventually captured by the 152nd Division (General Andrieu) on 1 November, after Fayolle over-ruled Andrieu and insisted on an attack, which apparently surprised the Germans, who did think that one could occur in such abysmal conditions.\nReserve Army\nThe Reserve Army of the BEF (renamed Fifth Army on 29 October) continued its attacks from Courcelette near the Albert–Bapaume road, west to Thiepval on Bazentin Ridge. The Reserve Army attacked on  Many smaller attacks were also made between frequent rainstorms, which turned the ground and roads into rivers of mud and grounded aircraft. German forces at the east end of  (Regina Trench) and in the remaining parts of  (Schwaben Redoubt) to the north and Stuff Redoubt () north-east of Thiepval, fought a costly defensive battle but Stuff Redoubt was captured on 9 October and the last German position in  Redoubt fell on 14 October, exposing German positions in the Ancre valley to British ground observation.\nA retreat up the Ancre valley was contemplated by Ludendorff and Rupprecht but rejected, due to the lack of better defensive positions further back, in favour of counter-attacks desired by Below the 1st Army commander. Gallwitz noted in early October that so many of his units had been transferred north of the Somme and that he had only one fresh regiment left in reserve. The German counter-attacks were costly failures and by 21 October, the British had advanced  and taken all but the last German foothold in the eastern part of  (Regina Trench). From  British attacks were postponed due to rain and fog.\nAftermath\nAnalysis\nWilfrid Miles\nIn 1938, Wilfrid Miles, the British official historian, wrote that by 12 October, the Germans were used to afternoon attacks; British battalions were at half-strength with only  many being poorly trained recruits. Lacking air observation for reconnaissance and artillery-observation in the poor weather, the infantry had struggled to advance towards German defences. The German machine-guns had been moved back to concealed positions beyond the depth of the British barrages, to sweep the attack front from long range. Rawlinson decided that the German defences would have to be subjected to a methodical bombardment and that the infantry must prepare more routes of supply from the rear and dig assembly trenches parallel to their objectives; Cavan suggested beginning a creeping barrage just beyond objectives and firing lots of smoke shells to hamper German observation but none were available. By mid-October, air reconnaissance was impossible because of rain and mist and artillery-observation could not be conducted on any great scale.\nShell bursts were smothered, guns became too worn for accurate fire and sank into the mud; the supply of ammunition was slowed by the condition of the ground and German bombardments. After the results of the attack on 18 October were known, the scope of the offensive was reduced and then washed out by more rain until 3 November. Cavan objected to more attacks on Le Transloy, except from the south, XIV Corps having already suffered  Rawlinson and then Haig had agreed to stop the attack but changed their minds when the French insisted on an attack by the Sixth Army. XIV Corps was ordered to make a local attack to the east and north-east of Lesbœufs and the French told that only a general pressure would be exerted by rest of the Fourth Army. On 6 November, attacks were only to be made to stop the Germans from moving troops from the Western Front and to support the attacks of the Sixth Army.\nAndrew Simpson\nIn 1995, Simpson wrote that the inability of the British artillery adequately to respond to the changes of German tactics may have been caused by the supply difficulties in October, when the gunners lacked the ammunition to extend creeping barrages all the way to the far side of German defences. Guns were worn out, ammunition had three types of propellant with inconsistent characteristics, all the ammunition was damp and corrections for atmospheric conditions were insufficient to regain accuracy, without observation of targets or information on the fall of shot from artillery-observation aircraft. In 2001, Simpson described the process of forming plans by the Fourth Army headquarters to be one of consultation and negotiation with corps commanders, provided that decisions were compatible with the corps artillery plan, which was derived from the army plan. Corps then set boundaries and let divisional commanders have discretion within them. By October corps headquarters were aware of the importance of passing information from contact-patrol aircraft and other sources forward to divisions, the corps headquarters developing into information clearing-houses by the end of the battle.\nGary Sheffield\nIn 2003, Sheffield described the tactical conditions on the Fourth Army front in similar terms to that of Wilfrid Miles, the official historian and that attacks continued in mud, which slowed movement to a crawl and in which had taken ten hours to move an Australian brigadier to a dressing station. Charles Bean, the Australian official historian called the conditions \"the worst ever known to the First A. I. F.\". Sheffield wrote that Haig was in a coalition \"strait-jacket\" with the French as the senior partners, which other writers and historians had underestimated. Joffre had wanted another offensive towards Bertincourt, Bapaume and Achiet-le-Grand and the Sixth Army continued its attack, which Haig felt bound to support. Sheffield wrote that Philpott's view that Haig continued the offensive \"in the broader interests of the alliance\", was correct.\nIn 2011, Sheffield wrote that the new German defences built behind the third position in the onset of autumn required a series of bite and hold attacks, which were beyond the ability of the British to arrange in time to reach open country. In late September, Haig had ordered an ambitious three-army offensive operation toward Cambrai but despite showing increasing tactical skill and inflicting many losses on the Germans, the territorial gains were \"miserly\". Haig persisted because he believed that attrition was working, the British Expeditionary Force was improving and that he overestimated the capacity of the armies in a wet and muddy season. The pressure from Joffre to continue was also significant, Haig wrote sympathetically of Cavan's protest in November but that the French could not be left in the lurch. In late October Haig reminded Joffre that although subordinate to French strategy he retained discretion over the operational and tactical matters of where, when and how.\nRobin Prior and Trevor Wilson\nIn 2005, Prior and Wilson wrote that the weather in September had been unusually good with only two rainstorms but that mid-autumn on the Somme was usually much wetter and that the British would be attacking into a valley, which would require a  advance to get beyond. The Fourth Army managed to capture Eaucourt l'Abbaye in early October but German artillery-fire increased in volume, suggesting that a collapse was unlikely. When the weather broke, the next attack had to be postponed until 7 October, when six British and a French division attacked and mostly failed except at Le Sars, because the lack of air reconnaissance led to an inaccurate bombardment, German reverse-slope defences had disguised new defences and long-range machine-gun fire was not suppressed by the creeping barrage. On 12 October, the Fourth Army attacked with five divisions and had similar results, with some battalions managing to advance  but none gaining the first objective, due to the weather hampering air reconnaissance and artillery-observation and because German long-range machine-gun fire came from guns dispersed evenly around the battlefield to evade British artillery bombardments.\nAll of the divisions in the Fourth Army were short of infantry after the September battles and those in early October depleted the infantry further, even in divisions considered fresh. The comparative failure of the attacks to gain ground was ascribed to lack of surprise, poor observation, the German recovery and long-range machine-gun fire. Rawlinson wanted to delay attacks to assure good air support, different zero hours and the digging of jumping-off trenches to orientate the infantry in the featureless landscape and greater depth to creeping barrages, to hit the German machine-guns far to the rear. These tactical requirements were contradicted by the operational and strategic necessity of continuing the battle through the winter and the attack on 18 October went ahead despite the requirements not being met, except for zero hour being set for  which led to the attack taking place in darkness, because low cloud obscured the moon. Haig reduced the scope of attacks but the effort on 23 October was another costly failure.\nThe constant rain confined supply traffic to one road from Longueval to Flers, which was frequently bombarded by German artillery, which made the difficulties of supply much worse. Another attack was ordered for 5 November and Prior and Wilson described the representations made by Cavan, the XIV Corps commander, who wrote that he was willing to sacrifice men to support the Sixth Army on the right but that a failure would be no help and could lead to the men losing confidence in their commanders. A local attack on 3 November was another failure and Cavan insisted that Rawlinson witness the conditions at the front. Rawlinson agreed that attacks were futile, which Haig accepted until a meeting with Foch, where he was persuaded to continue to attack. Prior and Wilson wrote that the attack on 5 November was another failure but smaller costly attacks continued for the rest of the month, despite not improving the tactical situation of the Fourth Army.\nJ. P. Harris\nIn 2008, Harris wrote that in late September there had been legitimate grounds for thinking that the German defence of the Somme might collapse. German troops had lost morale, surrendered more willingly and suffered more casualties in September than in any other month. Air reconnaissance had revealed that the Germans were building three more defensive lines () but , in front of Le Transloy, was far less formidable than the three lines overrun since July. Harris also wrote of the rain and mud and that the Germans had relieved exhausted divisions during the respite, reinforced the artillery and moved machine-guns to the rear, where they were less vulnerable but could fire through barrages at the British infantry.\nThe Fourth Army attacks on 7, 12 and 18 October had captured little ground at great cost, against far less formidable defences than earlier in the battle. By the middle of the month, Haig and Rawlinson agreed that the army could not remain in its positions on such low ground through the winter but that the attacks of 23, 28 and 29 October were costly failures, in an even worse morass than earlier in the month. Fresh troops became exhausted just moving up to the front line and in most of the Fourth Army divisions battalion strengths had fallen from  to  knee deep in mud, eating cold food and soaking wet. Despite reports of the conditions and Cavan's objections, attacks in support of the Sixth Army continued. The British lost another  for no gain of ground and the French also had meagre results, which led Foch to accept that little more could be achieved on the Fourth and Sixth army fronts.\nWilliam Philpott\nIn a 2014 publication, Philpott wrote that the size and tempo of Anglo-French attacks of September could not be maintained in October and November; attacks became smaller and less ambitious. The British Expeditionary Force had become more proficient since July and the French continued to improve but the wet weather, high winds and shorter days made the delivery of supplies to the front line and the evacuation of wounded extraordinarily difficult. The attacks of the Sixth Army, south of the Fourth Army, were also postponed because of the weather; French aircraft were grounded and the flow of supplies interrupted. Attacks from  achieved little and the offensive south of Bouchavesnes towards Péronne was abandoned. The French continued to attack to the north-east to capture the Saillisels, next to the British attacks towards Bapaume.\nThe Fourth Army attacked a low ridge running north-west from Le Transloy to Ligny but achieved little success amidst a jumble of trenches, derelict artillery positions and strong points. New German trenches dug between the Flers and Gird lines formed tiers of defences to fight from, which became a wasteland due to the ceaseless bombardments. The Fourth Army slowly advanced into a dip overlooked from Le Transloy and Warlencourt and towards the Butte de Warlencourt, from which German observers could see all round. Deliberate attacks on 7, 12, 18 and 23 October and smaller local attacks were quickly forced to ground by German machine-gun fire on the XIV and XV corps fronts but III Corps captured Le Sars, before being held up around the defences of the Butte. The Sixth Army experienced its worst fighting of the battle to capture the Saillisels, attacking on a  in the same conditions as the Fourth Army, with the same results for the same reasons. On the right of the attack, the French had more success and closed up on the southern approach to the villages but after 7 October this advance also slowed. In the middle of the month the villages were entered but not entirely captured until 12 November.\nThe capture of the Saillisels and Le Sars were the only notable geographical successes in October and November. The German armies endured the same physical conditions but had a much narrower beaten zone between the front line and comparatively undamaged terrain. Mud reduced the effect of Allied artillery, many shells not exploding or being smothered, and mud clogged small arms being carried over no man's land. British divisions fighting on the Somme for the second time had gained experience but German divisions had been kept in action for longer, new divisions were committed before they were ready and both sides had difficulty in replacing losses. The German army created fifteen new divisions in the autumn from garrison troops, older conscript classes,  reservists, the last depot reserves and the 1917 conscript class. The French filled gaps with \"shirkers\", workers being disciplined and youths of the 1917 class. In the British Expeditionary Force, the first conscripts arrived and on 16 October, Private Harry Farr was shot by firing squad as an example, despite extenuating circumstances. Fayolle judged that the battle should end and that the armies should wait for spring but in November, protests from senior officers like Cavan and the inspection report of Major John Gort were set aside.\nHaig, Foch and Joffre insisted on continuing the offensive on the Somme, despite the appalling conditions, to support the battles at Verdun and on the Eastern Front, where the Russians were attacking in Galicia and Rumania was being overrun. On the Southern Front, the Italian army was on the offensive and an attack had begun in Macedonia on the Balkan Front. Philpott wrote that Allied fire power was still \"purgatory\" for the German infantry; Bavarian Reserve Infantry Regiment 16 fought on the Somme from 2 to 12 October and was eviscerated after suffering  The regiment had been \"dragged along in the darkness and night [and] spewed out in ruins\". The increased number of German divisions, aircraft, artillery and ammunition sent to the Somme front in September and October reduced the effectiveness Anglo-French attacks in October but from 20 October to 2 November, the French armies attacked at Verdun, exploiting the depletion of the 5th Army. The French advanced  recaptured Fort Douaumont on 24 October and Fort Vaux on 3 November. On the Somme, the French armies continued small attacks in November along with the British but from 14 to 16 November, the Germans counter-attacked at Bouchavesnes, re-taking part of the Saillisels and Reuss Trench.\nFoch showed that a well-organised battle could be fought in a manner which was \"not unduly costly\" but that the Allies had not accumulated enough resources to defeat decisively the Germans. In September, Foch had managed to get the four Entente armies on the Somme to make co-ordinated attacks, which brought the Germans close to collapse. In October, the autumn rains soaked the ground and slowed the tempo of attacks, which resembled the  (nibbling) of late July and August. Such smaller, un-coordinated attacks could depress German morale but not deplete manpower at the rate achieved in September. The systems of organisation and supply to maintain long offensives were not adequate to deliver the vast amounts of food, ammunition and equipment needed by million-man armies, even over the pre-war infrastructure of northern France.}} A reorganisation was begun, using light railways to link railheads to the armies but this change did not mature until 1917 and became part of a cycle of initiative and response by the belligerents, which continued the battlefield equilibrium.\nCasualties\n{| class=\"wikitable\" style=\"float:right; margin:0 0 1em 1em;\"\n|+British, French and German casualtiesSeptember–November 1916\n|-\n! Month\n! British\n! French\n! Sub-total\n! German\n! (% ofAlliedtotal)\n|-\n|September||align=\"right\"|101,313||align=\"right\"|76,147||align=\"right\"|177,460||align=\"right\"|140,000||align=\"right\"|78.9\n|-\n|October||align=\"right\"|57,722||align=\"right\"|37,626||align=\"right\"|95,348||align=\"right\"|78,500||align=\"right\"|82.3\n|-\n|November||align=\"right\"|39,784||align=\"right\"|20,129||align=\"right\"|59,913||align=\"right\"|45,000||align=\"right\"|75.0\n|}\nThe 21st Division suffered  from  and New Zealand Division casualties from  were  The 6th Division had  from  and during the month the 4th Division recorded just over  the 8th Division had about  from  and the 29th Division lost  from  The 30th Division had casualties of  from\nMud\nRain during the summer had turned soil to mud but the heavier autumn rains created a much longer-lasting variety, a mixture of soil and the chalky subsoil, which became \"liquid, yellow-grey mud\" which had extraordinary buoyancy and stuck to everything, covering men and jamming gun mechanisms and rifles. On roads, the mud stuck to wheels and caked the hooves of horses and mules. Men on foot were coated up to the knee and movement off the roads became impossible. Shell craters filled with a quicksand, which could drown soldiers and animals; a French writer called the Somme mud the worst on the Western Front. Engineers laboured all summer to keep roads open and to lay new ones, build corduroy roads of logs and railway sleepers and laid duckboard tracks as the front moved eastwards. The slow Anglo-French advance increased the distance that supplies had to be carried, from the intact road system in the rear to the front line on the far side of the beaten zone, which brought the transport system close to collapse whenever it rained. More vehicles on the roads accelerated their decrepitude and Bean wrote that many of the lorries broke down and were pushed aside.\nHaig wrote on 21 November that\n}}\nStretcher-bearers worked four to a stretcher, reinforced by pioneers, men from divisional supply trains and anyone else who could be spared, including prisoners. From Gueudecourt to the Longueval tramway, the carry was  in three stages. Illness increased in the British armies. Routine measures to prevent trench foot, by rubbing feet with whale oil and donning dry socks, reduced the number of cases compared to 1915, despite the increase in the size of the BEF. Combined frostbite and trench foot admissions to hospital in 1916 were  against  year previous. On the week ending 28 October, there were   next week and  the next two weeks. By 30 December,  had been admitted in the British Expeditionary Force in the year, about  as measured by ration strength.\nSubsequent operations\n23 October\nAfter the dismal result of the attack on 18 October, Foch, Haig, Rawlinson and Gough met and agreed to reduce the scope of attacks, weather permitting. The Fourth and Sixth armies were to attack on 23 October towards Le Transloy, ready to capture the village on 26 October, as the French advanced towards Rocquigny in stages. The full programme for the armies on the Somme was washed out, despite urging by Joffre for another general attack; Haig rejected the pressure from Joffre and denied that he was procrastinating. It was dry from  as XIV Corps prepared to attack to the far side of the spur in front of Le Transloy, where after a thirty-minute halt, the creeping barrage would move at  per minute, followed by the infantry, whose battalions had fallen lower than half-strength during the recent fighting. Dawn was so foggy that Cavan agreed a postponement with the French from  The 4th Division attacked with two battalions of the 11th Brigade, next to the French 152nd Division.\nThe 1st Hampshire and the French were quickly stopped by enfilade fire from Boritska/Baniska Trench opposite and from machine-guns hidden in shell-holes but when reinforced by the 1st Rifle Brigade, established posts north-west of the trench. To the left, the 2nd Royal Dublin Fusiliers joined with the left of the Hampshire, after capturing gun-pits and a strong point further on. The 1st Royal Warwick were to leap-frog through the Fusiliers but became mixed up and attempts to advance were defeated in hand-to-hand fighting and then flanking fire from both sides. The 12th Brigade on the left was defeated by machine-gun fire from Dewdrop Trench near the Lesbœufs–Le Transloy road, parties of the 2nd Essex who got into the trench being overwhelmed. The 1st King's Own captured the German part of Spectrum Trench to the north of Dewdrop Trench and then advanced further; help arrived from bombers of the 2nd Dukes but only Spectrum Trench could be held.\nThe 6th Division had been relieved by the 8th Division and the 23rd Brigade attacked with the 2nd Scottish Rifles and 2nd Middlesex, capturing Zenith Trench. The Rifles advanced another  and took Orion Trench but were bombarded out again late in the afternoon, as Middlesex attempts to bomb northwards failed. On the left the 25th Brigade attacked the north end of Zenith Trench with the 2nd Lincolnshire, which was stopped by small-arms fire, except for a few men who linked with the 2nd Middlesex. The 2nd Rifle Brigade further left was unable to capture a strong point where Zenith and Eclipse trenches met but managed to set up posts about  forward of the British front line. In the 24th Brigade area, the 2nd East Lancashire captured most of Mild Trench, took about fifty prisoners and defeated counter-attacks from the flanks.\n24 October – 3 November\nHaving relieved the 4th Division on the night of  the 1st Middlesex and 4th King's Liverpool of the 33rd Division (Major-General Reginald Pinney) attacked at  and captured Rainy and Dewdrop trenches but by  both had been bombed back out of Dewdrop Trench. Next day the 19th Brigade attacked on the right of the division with the 1st Cameron and the 5/6th Scottish Rifles, to take more of Boritska Trench but were repulsed by fire from machine-guns in shell holes. During the day, the 17th (Northern) Division (Major-General Philip Robertson) relieved the 8th Division. On 30 October the 1st Anzac Corps (Lieutenant-General William Birdwood) relieved the XV Corps between XIV and III corps.\nOn 1 November, the French attacked  from the south, heading towards the Saillisels but were forced back BIR 20, which took 208 prisoners. On the night of 31 October – 1 November, a regiment of the 39th Division prepared the jumping-off points for a counter-attack by IR 126 and IR 132 at  but the two attacking regiments were late and arrived exhausted. Air support was cancelled because of the weather and the French were ready when the attack began; German artillery fired short and French small arms fire repulsed the attack. French attacks continued for the next week and a small part of St Pierre Vaast wood was captured on 5 November, through gaps in the positions of IR126 and IR 172. On 9 November, the French and British attacked from Bouchavesnes to the Ancre and next day the 185th Division relieved the 39th Division, in which IR 126 had lost  including\nOn the Fourth Army front, the 19th Brigade of the 33rd Division attacked again with the 1st Cameronians and the 5/6th Scottish Rifles, who got into Boritska Trench but were repulsed. At  the 1/9th Highland Light Infantry (1/9th HLI) and the 2nd Worcester attacked Boritska Trench with the French but mud, exhaustion and machine-gun fire from Le Transloy forced them back out. Next day the 17th (Northern) Division tried a surprise attack at  with a party of the 7th Borders (51st Brigade) and captured the rest of Zenith Trench. A counter-attack was defeated and a trench block set up  along Eclipse Trench. On 3 November the 7th Lincolns of the 51st Brigade repulsed a counter-attack on Zenith Trench and cleared a German foothold, assisted by the 7th Green Howards that evening. An attack by the 1st Queen's of the 100th Brigade on Boritska Trench failed.\n4–15 November\nOn 4 November, a 98th Brigade attack on a ridge east of Dewdrop Trench failed and on 5 November, the 33rd Division attacked at  with the 2nd Worcester, who captured Boritska and Mirage trenches and joined with the 16th KRRC that had captured Hazy Trench. In the 19th Brigade area to the left, the 2nd Royal West Kent advanced along the Lesbœufs–Le Transloy road but was unable to hold on, after patrols of the 7th East Yorkshire and 7th Green Howards of the 50th Brigade on the left were repulsed. The 1st Anzac Corps attacked on the left at  with the 1st Australian Division in a downpour, against a salient north of Gueudecourt. In the 1st Brigade, the 3rd Battalion bombed forward but the repulse of the 1st Battalion during two frontal attacks and a bombing attack on Hilt Trench, forced a withdrawal on the 3rd Battalion. The 7th Brigade attacked with the 27th Battalion on the right flank, a composite battalion of the 25th Battalion and a company each from the 26th and 27th battalions in the centre and the 28th Battalion on the left, in which parties of the 27th Battalion entered Bayonet Trench and then retired at dusk. Troops of the composite battalion reached the Maze and held on but the 28th Battalion was repulsed twice and retired.\nOn 8 November, the 33rd Division was relieved by the 8th Division and after a lull with some dry days and on 14 November, the 2nd Australian Division made a joint attack with the 28th, 25th and 27th battalions of the 7th Brigade. The 28th Battalion was relieved by the 19th Battalion bought up from reserve. The 50th Division on the right of III Corps co-operated with the 1/5th and 1/7th Northumberland Fusiliers of the 149th Brigade, the combined attack beginning at  In the 2nd Australian Division area to the right of Blue Cut that ran from le Barque to Eaucourt l'Abbaye, the 25th and 26th battalions to the right of the 19th Battalion were stopped by machine-gun from the Maze and artillery-fire from the vicinity of Bapaume. The 19th Battalion and the 1/5th Northumberland Fusiliers captured  of Gird Trench but were unable to take Gird Support Trench further on. The trench was found to have flooded; the British and Australian troops retired to Gird Trench, where they were cut off. The 1/7th Northumberland to the left of the 1/5th Northumberland, may have captured Hook Sap but did not secure their part of Gird Trench; they were fired on from Butte Trench and disappeared.\nLater in the day, two counter-attacks were repulsed and half of the 20th (NSW) Battalion attacked the Maze at  but was stopped by machine-gun fire. At midnight, troops from the 1/4th and 1/5th Northumberland attacked on the opposite flank but were forced back. On 15 November, the remnants of the 1/5th and 19th (NSW) battalions that had met were isolated in part of Gird Trench with a Lewis gun at either end. Rifle ammunition was used to feed the Lewis guns that engaged frequent German attacks. German , supported by artillery around Bapaume, made a determined attack from both ends of Gird Trench and the British and Australians were relieved at dawn by the 28th Battalion and two companies of the 1/4th East Yorkshire. Opposite the French Sixth Army, Operation Hanover (), a plan to recapture the fringe of St Pierre Vaast wood on 15 November succeeded; attacks to recapture the Saillisels failed and the Germans occupied shell hole positions on the outskirts.\nCommemoration\nNewfoundland Memorial\nThe participation of the Newfoundland Regiment in the Battle of Le Transloy is commemorated with the Gueudecourt Newfoundland Memorial. The memorial marks the place where the Newfoundlanders returned to the Somme in early October, after many losses incurred four months earlier, during an attack at Beaumont Hamel, on the First day of the Somme. The rebuilt Newfoundland Battalion, part of the 88th Brigade, attacked on the right flank of XV Corps with the 1st Battalion Essex Regiment (1st Essex) and captured part of Hilt Trench, an extension of Rainbow Trench north-east of Gueudecourt. The 1st Essex pressed on and parties reached Grease Trench but then had to retire to the start line when the 35th Brigade attack on the left failed. The Newfoundlanders held on in Hilt Trench and also bombed up it to capture some of the Essex objective and established a trench block The memorial also marks the furthest point that the British advanced from the front line of 1 July, during the Somme offensive. The Rifle Brigade counted Le Transloy as one of their battle honours for the Somme.\nSee also\n* List of Canadian battles during World War I\nNotes\nFootnotes\nReferences\nBooks\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*  Translation of Meine Tätigkeit im Weltkriege 1914–1918 (Berlin, Mittler und Sohn 1939)\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\nTheses\n*\n*\nWebsites\n*  |title=Medals of the Regiments: The Rifle Brigade |year=2007 |publisher=North East Medals |url=http://www.northeastmedals.co.uk/british_regiment/rifle_brigade.htm |access-date=22 December 2012}}\nFurther reading\n*\n*\n*\n*\n*\n*\nExternal links\n*\n* [http://www.northeastmedals.co.uk/british_regiment/rifle_brigade.htm Rifle Brigade medals]"
    }
  ]
}