{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Tipton's Island\n\nIndiana Rangers\n|commander2=John Tipton\n|strength1=Unknown\n|strength2=30\n|casualties1=1 killed3 drowned in escapeSeveral wounded\n|casualties2=3 settlers killed2 settlers wounded\n}}\n]]\nThe '''Battle of Tipton's Island''' was an engagement between a Shawnee war party and Indiana militia under command of John Tipton in April 1813 on the White River near present-day Seymour, Indiana.\nIn April 1813, during the War of 1812, a Shawnee war party killed two white settlers eight miles from Fort Vallonia.  The war party continued towards the fort, killing another settler and wounding three more.  The Shawnee then put some distance between themselves and the fort, but were soon pursued by 30 Indiana militiamen under Major John Tipton known as \"Corydon's Yellow Jackets\".\nThe Shawnee crossed the flooded Driftwood River and, thinking they had lost their pursuers, set up camp on an island in the east fork of the White River, just northeast of modern-day Seymour.  One of Tipton's scouts located the trail, however, and the rangers cautiously approached the river.  Major Tipton ordered the rangers to maintain absolute silence, and tied one ranger to a tree when he kept talking.  The militia took positions along the bank of the river and opened fire.  The Shawnee were taken by surprise, but returned fire for about half an hour.  Few casualties were suffered due to the firing distance across the river and the shelter provided by the wooded island.  One Shawnee was killed and several were wounded, but a few drowned when they tried to swim across the flooded White River.\nThe militia could not pursue the Shawnee across the river, so they returned to Fort Vallonia.  There was a victory celebration, but as details of the skirmish emerged, it was determined to be a small engagement against a war party that managed to escape.  \"Tipton's Island\" became a term of ridicule.\nSee also\n*List of battles fought in Indiana\nNotes\n*"
    }
  ]
}