{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Bir Bilal\n\n| combatant2        =  Senussi\n| commander1        =  Major Melli Captain Telger\n| commander2        =  Saleh al-Atioush Fadil al-Muhashhish Koja Abdullah\n| strength1         = 400 riflemen + company of cavalry and armored vehiclesor5,000 men100 armored vehicle\n| strength2         = Unknown\n| casualties1       =  189 killed\n| casualties2       = Unknown\n| notes             =\n}}\nThe Battle of Bir Bilal (also called Battle of Brega) was a military engagement between the Senussi order and the Italians. The Senussi won a resounding victory against the Italians.\nExecution of Abu'lu'lu\nOn Ramadan 1341 Hijra (April 1923), the Italians captured Ajdabiya. The Italians, after the capture, attempted to subdue the Magherbi tribes or persuade them to join the Italians, given the fact that they represented a danger to the Italians and their bases. After the capture of Ajdabiya, they began preparations to capture an important sea base Brega for any inland campaign. The operation was entrusted to Major Melli, who was given command of the VII Eritrean battalion.\nThe VII Eritrean battalion consisted of 400 rifles, a company of cavalry, and a group of armored vehicles led by Captain Telger. Another source claims the Italians had a force of 5,000 men and 100 armored vehicles. It was determined for Major Melli's forces to march from Ajdabiya to Qurain and Brega, while Captain Telger made a wide detour to avoid the sandy areas passing through Al-Qatifya to Bir Bilal.\nAs the armored Italian vehicles were reaching Bir Bilal on June 10, they found themselves surrounded by a force of Libyans. Loads of bullets rained upon the Italian vehicles, destroying them completely killing captain Telger. The Senussi captured their weapons and other equipment. Learning of this, Major Melli hurried to the scene towards Bir Bilal. However, they were attacked by the Libyans near Abi Qarada, near the coast, and inflicted another defeat on the Italians.\nAftermath\nThe Italian defeat at Bir Bilal was considered one of the most serious defeats in eastern Libya. The Italians failed due to several factors: the bad weather of the territory, which prevented the Italians from using their air force; another factor was the rough sea, which prevented an Italian ship from covering the Italian force; and lastly, the underestimating of the Senussi numbers as they assumed that they possessed no more than 150 men.\nIn the month of July, the Italians conducted 57 air operations to bombard Libyan residences and their cattle. On August 25, a large force reached Bir Bilal and began collecting the Italian corpses to bury them; a total of 189 bodies were found, including Major Melli and other officers.\nOn September 3, the Italians successfully captured Bir Bilal from the Libyans after a four-hour battle.\nLiterature\n*Kalifa Tillisi, A Dictionary for Italian Colonial Battles on the Libyan Soil 1911–31, 1972.[https://archive.org/details/muajmmaark/page/n143/mode/1up]\n*Al Tahir Al Zawi, Omar- Al Mukhtar, the last episode of the national resistance in Libya. [https://archive.org/details/maktabah2000_gmail_20160912_0535/page/n85/mode/1up]\n*Wahbi Bori, Benghazi during the Italian colonial period, 2004.[https://books.google.com/books?id=vIYFAQAAIAAJ&q=%D8%AA%D9%84%D8%BA%D8%B1]\nSee also\n*Battle of Bir Tabraz\n*Battle of Al-Rahiba\n*Battle of Wadi Marsit\n*Battle of Safsaf\n* First Battle of Sidi Abu Arqub\nReferences"
    }
  ]
}