{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Glendale (Skye)\n\n1490; though more likely after 1513\n| place=Glendale, Skye\n| casus=\n| territory=\n| result=MacLeod victory\n| combatant1 = Clan MacDonald of Sleat Clan Ranald\n| commander1 = Donald MacDonaldAllan MacDonald of Moidart\n| strength1 =\n| casualties1 =High\n| combatant2 = Clan MacLeod Clan MacLeod of Lewis\n| commander2 = Alasdair MacLeodDonald MacLeod of Meidle\n| strength2 =\n| casualties2 =High\n| notes=\n}}\nThe Battle of Glendale was fought on the Inner Hebridean Isle of Skye when the MacDonalds of Sleat and the MacDonalds of Clanranald clashed with the MacLeods of Harris and Dunvegan and the MacLeods of Lewis. According to MacLeod tradition preserved in the early 19th century, the battle was fought in about the year 1490, though more recent scholarship suggests that the battle more likely took place sometime after 1513. MacLeod tradition records that the battle was the 'most tremendous battle' that the clan ever fought—although the clan was victorious, it never fully recovered from its severe losses. MacLeod tradition also relates how the MacDonalds originally had the upper hand during the conflict, but when Clan MacLeod's sacred Fairy Flag was unfurled the MacLeods gained heart and won the battle.\nConflict\nAccording to MacLeod tradition preserved in the Bannatyne manuscript, a force of MacDonalds led by Donald Gruamach MacDonald landed on Skye at Loch Eynort in about the year 1490. The MacDonalds proceeded to lay waste to the lands of Minginish, Bracadale, and Duirinish, and their forces got right up to the gates of Dunvegan Castle. The manuscript states that during this time, the chief of the MacLeods of Harris and Dunvegan, Alasdair Crotach, was on Harris, but that upon hearing the news of the MacDonald's encroachments, he proceeded with all haste to Skye. The manuscript states that he landed at Glendale, where he was joined by his kinsmen, the MacLeods of Lewis. The historian J. L. Roberts noted that they would have landed at the head of Loch Poolteil, where the Glendale valley reaches the sea. The manuscript relates that the combined MacLeod forces drew up on the brow of a hill, with a river in front of them which made it difficult for the MacDonalds to attack.\nis attributed to the MacLeod chief Sir Rory Mor MacLeod, though it is possibly that of his grandfather, chief Alasdair Crotach MacLeod, who was said to have been severely wounded in the battle.]]\nThe Bannatyne manuscript relates how the combined MacLeod forces waited ten days for reinforcements, until Donald Mor of Meidle arrived with a large force under his command. The battle then commenced; the MacDonalds, however, gained the upper hand as Donald Mor was killed and hundreds of the MacLeods were killed. The MacLeods were just at the point of giving way when the mother of Alasdair Crotach ordered the Fairy Flag to be unfurled. With the magical flag unfurled, the manuscript states that the battle was renewed with redoubled fury, with immense losses on both sides. At one point, a party of MacDonalds, led by Allan MacDonald of Moidart (chief of the MacDonalds of Clanranald), managed to cut off the MacLeod chief and the guardians of the Fairy Flag from the rest of their clan. However, just at that moment, Murdo MacCaskill slew Donald Gruamach MacDonald, raised his head upon a spear and ordered the MacLeod pipers to play the MacDonald lament. Disheartened by the ill-omened music and the loss of their leader, the MacDonalds broke and fled, disregarding attempts by the Clanranald chief to rally them.\nRoberts noted that while the manuscript states that Donald Gruamach was killed at the battle, he was certainly alive in 1530, and likely died several years later in 1534. Roberts stated that if the battle actually occurred in the year 1490, as the manuscript suggests, then it was many years before Donald Gruamach became chief of the MacDonalds of Sleat. Roberts considered it likely that several battles were confused in MacLeod tradition, and that the battle fought at Glendale was fought at a much later date than that which MacLeod tradition records. Roberts proposed that MacDonalds could have landed on the northwest coast of Skye, following Alasdair Crotach's seizure of Dunscaith Castle after the year 1513, and that the opposing forces could have met and done battle at Glendale. Roberts noted that Alasdair Crotach later received a lease to the lands of Trotternish, from the Crown. These lands had been held at various times by Torquil MacLeod of Lewis, and Ranald Ban MacDonald of Clanranald. Roberts stated that in 1528, Donald Gruamach joined forces with his half-brother, John MacLeod, eldest son of Torquil MacLeod of Lewis; together the half-brothers drove Alasdair Crotach MacLeod out of Trotternish.\nAftermath\ns: the Fairy Flag, Dunvegan Cup, and Sir Rory Mor's Horn.]]\nAccording to the Bannatyne manuscript, the battle was said by the old clan shenachies, that without descending from their perch, the ravens which stood on Creggan nan Fitheach (\"the Rocks of the Ravens\"), drank the blood, and ate the flesh, of the MacDonalds who lay in heaps around. Allan of Moidart was to have fought in single combat with the Murdo MacCaskill, and three of his brothers, and slew them all, before retreating with the rest of the MacDonalds to their galleys at Loch Enyort.\nThe manuscript states that the Battle of Glendale was \"the most tremendous battle in which the MacLeods were ever engaged\". The victory was theirs, but it was bought at a terrible price: the clan's chief, Alasdair Crotach, was severely wounded, many of the leading men of the clan were dead, as well as most of the men of the clan. The manuscript states that the clan never fully recovered from these losses. Among the dead was Paul Dubh, the standard bearer, who carried the Fairy Flag in the battle until he was killed.\nSee also\n*Fairy Flag, a MacLeod heirloom with supposed miraculous powers, present at the battle\nReferences\nExternal links\n*[https://archive.today/20121225062956/http://canmore.rcahms.org.uk/en/site/10578/details/skye+glendale/ Skye, Glendale], the RCAHMS-CANMORE webpage on the battle site"
    }
  ]
}