{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Majorca\n\n}}\nSpanish Republic  Generalitat of Catalonia\n| combatant2        =  Nationalist Spain\n| commander1        =  Cpt. Alberto Bayo Cpt. Manuel Uribarri\n| commander2        =  Arconovaldo Bonaccorsi Lt. Col. Luis García Ruiz\n| strength1         = 8,000 militia  1 battleship  1 light cruiser  2 destroyers  3 submarines  10 guns\n| strength2         = 3,500 regulars and militia  3 bombers  3 fighters\n| casualties1       =\n| casualties2       =\n| campaignbox       =\n}}\nThe Battle of Majorca, also known as the Majorca Landings, was an amphibious landing of Republican forces in 1936, early in the Spanish Civil War, aimed at driving the Nationalists from Majorca and reclaiming the island for the Republic. After some initial tactical success, the expedition, commanded by Captain Alberto Bayo, ended in failure when the Nationalists counterattacked with ground troops and massively superior air power and drove the Republicans into the sea. So confident were the Republicans in their prediction of victory they optimistically called the operation \"la reconquista de Mallorca\" - \"the reconquest of Majorca\".\nBackground\nPlans for a seaborne attack on the Balearic Islands seem to have surfaced independently in various Republican militia groups in the days following the joining of Ibiza, Formentera, and Majorca to Franco's Nationalist military rebellion. Already, on July 23, bomber squadrons struck Palma and Cabrera, and on August 1 a Republican expeditionary force from Menorca landed at Cabrera and resisted all efforts to dislodge it.\nHowever these actions, and in particular the Majorca landings, were never approved by the Madrid government and had from the very beginning an air of confusion, and improvisation. On August 2, Bayo assembled a column of Barcelona militia on Menorca; the next day, the Republican air force dropped bombs on Palma once more. By August 2 logistical preparations overseen from Barcelona by the Government of Catalonia and the Central Committee of Antifascist Militias of Catalonia (Comitè Central de Milicies Antifeixistes de Catalunya), were complete.\nThe Nationalist garrison of Formentera capitulated to Manuel Uribarri's Valencian militia on 7 August. On the 13th, 400 Catalan militia occupied Cabrera in an assault apparently unrelated to Bayo's expedition. Bayo tried to coordinate the two forces but the anarchist militias, distrustful of his Communist sympathies, refused to commit themselves to his operation.\nThe battle\nOn 16 August, with various units of the Spanish Republican Navy in support, Bayo landed his force of 8,000 militia at Punta Amer and Porto Cristo. Despite problems unloading and deploying their six 75&nbsp;mm and four 105&nbsp;mm guns, the Republicans managed to push  inland against the Nationalist garrison consisting of 1,200 regular infantry, 300 members of the Guardia Civil, and hundreds of Falangist volunteers.\nHowever, the Nationalists' fortunes improved dramatically on 27 August when supplies and air support arrived from nearby Italy. The Republican bomber forces ranging overhead were cut down and replaced by Italian aircraft. Consequently, the Republicans were unable to withstand the Nationalist counterattack on the ground and fell back in confusion, abandoning their guns and equipment. Their evacuation began on 5 September and the Republicans held the beaches until 12 September, when the last ship steamed off in retreat, leaving the island in Nationalist hands.\nThe Nationalist response was swift and, in contrast, remarkably successful. A week after the retreat from Majorca, Cabrera had once again fallen to the Nationalists. Ibiza was captured on 19 September by the Majorca garrison, and Formentera fell on the 20th.\nSee also\n* List of Spanish Republican military equipment of the Spanish Civil War\n* List of Spanish Nationalist military equipment of the Spanish Civil War\nReferences\n*"
    }
  ]
}