{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Myton__disambig_1\n\n| result            = Scottish victory\n| combatant1        =\n| combatant2        =\n| commander1        = Archbishop William MeltonNicholas Fleming, Mayor of York\n| commander2        =  Sir James Douglas Sir Thomas Randolph\n| strength1         = 10,000–20,000\n| strength2         = 10,000–15,000 (probably less than the English)\n| casualties1       = 1,000–5,000 killed\n| casualties2       = Unknown, but comparatively light\n}}\nThe Battle of Myton, nicknamed the Chapter of Myton or The White Battle because of the number of clergy involved, was a major engagement in the First Scottish War of Independence, fought in Yorkshire on 20 September 1319.\nBerwick Falls\nIn April 1318, Berwick-upon-Tweed, the last Scottish stronghold which was in the hands of the English, was captured by Sir James Douglas and Thomas Randolph, Earl of Moray, two of King Robert Bruce's most able commanders. Ever since his defeat at Bannockburn in 1314, Edward II had been preoccupied by an ongoing political struggle with his senior barons, headed by Thomas, Earl of Lancaster. Repeated Scottish raids deep into the north of England had effectively been ignored: but the loss of Berwick was something different. Once the most important port in Scotland, it had been in English hands since 1296; during which time its defences had been greatly strengthened. News of its capture had a sobering effect on Edward and his magnates. Aymer de Valence, Earl of Pembroke, managed to arrange a temporary reconciliation between the king and Lancaster. In a spirit of artificial harmony, they came north together with a sizeable army in the summer of 1319. Queen Isabella accompanied the king as far as York, where she took up residence.\nVigorous assaults were made on Berwick by land and sea, but Walter, the High Stewart of Scotland, ably assisted by John Crabb, a military engineer, conducted an effective defence, beating back all attacks. However, he could not be expected to hold out indefinitely. King Robert had no intention of risking a direct attack on the powerful English army which, in the words of John Barbour, 'might well turn to folly'. Instead, Douglas and Moray were ordered on yet another large-scale diversionary raid into Yorkshire, intended to draw off the besiegers. They came with a large force of mounted infantry, known as hobelars.\nThe Chapter of Myton\nThe Scots seemingly had news of the queen's whereabouts, and the rumour soon spread that one of the aims of their raid was to take her captive. As King Robert advanced towards York, she was hurriedly taken out of the city by water, finally gaining refuge further south in Nottingham. Yorkshire itself was virtually undefended and the raiders had an uninterrupted passage from place to place. William Melton, the Archbishop of York, set about mustering an army, which included a large number of men in holy orders. While the force was led by some men of standing, including John Hotham, Chancellor of England, and Nicholas Fleming, Mayor of York, it had very few men-at-arms or professional fighting men. From the gates of York, Melton's host marched out to face the battle-hardened schiltrons, some  east of Boroughbridge, where the rivers Swale and Ure meet at Myton. The outcome is described in the Brut or the Chronicles of England, the fullest contemporary source for the battle;\nMany men were pressed into service who were not trained soldiers, including those who were monks and choristers from the cathedral in York. As so many clerics were slain in the encounter, it also became known as the 'Chapter of Myton'. Barbour gives the English loss as 1,000 killed, including 300 priests, but the contemporary English Lanercost Chronicle says that 4,000 Englishmen were killed by the Scots, while another 1,000 were drowned in the River Swale. Nicholas Fleming was among those killed.\nThe King Departs\nThe Chapter of Myton had the effect that Bruce was looking for. At Berwick it caused a serious split in the army between those like the king and the southerners, who wished to continue the siege, and those like Lancaster and the northerners, who were anxious about their homes and property. Edward's army effectively split apart: Lancaster refused to remain and the siege had to be abandoned.\nThe campaign had been another fiasco, leaving England more divided than ever. It was widely rumoured that Lancaster was guilty of treason, as the raiders appeared to exempt his lands from destruction. Hugh Despenser, the king's new favourite, even alleged that it was Lancaster who had told the Scots of the queen's presence in York. To make matters worse, no sooner had the royal army disbanded than Douglas came back over the border and carried out a destructive raid into Cumberland and Westmorland. Edward had little choice but to ask Robert for a truce, which was granted shortly before Christmas.\nReferences\nSources\n* Anonimale Chronicle, ed. V. H. Galbraith, 1927.\n* Barbour, John, The Bruce, trans. A. A. Douglas, 1954.\n* Barrow, G. W. S., Robert Bruce and the Community of the Realm of Scotland, 1964.\n* Brut or the Chronicles of England, ed. F. W D., Brie, 1906\n* Conway-Davies, J., The Baronial Opposition to Edward II, 1918.\n*\n* Gray, Thomas, Scalicronica, trans. H. Maxwell, 1913.\n* Hailes, Lord (David Dalrymple), The Annals of Scotland, 1776.\n*\n* The Lanercost Chronicle, trans. H. Maxwell, 1913.\n* Prestwich, Michael, Armies and Warfare in the Middle Ages: The English Experience, Yale University Press, New Haven and London, 1996, (hbk.), (pbk.)\n* Scammel, J., Robert I and the North of England, in the English Historical Review, vol. 73 1958.\n* Scott, J., Berwick-upon-Tweed:A History of the Town and Guild, 1888.\n* Vita Edwardi Secundi, ed N. Denholm Young, 1957."
    }
  ]
}