{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Ladysmith__disambig_1\n\n| combatant2        =\n| commander1        =  George Stuart White\n| commander2        =  Petrus Jacobus Joubert Louis Botha Christiaan De Wet\n| strength1         = 12,500\n| strength2         = 21,00024 field guns4 heavy guns\n| casualties1       = 400 killed or wounded800 captured\n| casualties2       = 200\n| campaignbox       =\n| image_size        = 300px\n}}\nThe Battle of Ladysmith, also known as the '''Battle of Lombard's Kop''', was one of the early engagements of the Second Boer War. A large British force which had concentrated at the garrison town of Ladysmith launched a sortie on 30 October 1899, against Boer armies which were slowly surrounding the town. The result was a disaster for the British. The main body was driven back into the town, and an isolated detachment of 800 men was forced to surrender to Commandant De Wet. The Boers did not follow up their advantage by proceeding towards the strategically important port of Durban, and instead began a siege of Ladysmith, which was relieved after 118 days. John Norwood was awarded the Victoria Cross for his actions during the battle.\nBackground\nIn June 1899, when it appeared hostilities between Britain and the independent Boer republics were likely, the British government began sending troops to South Africa as a precaution. Most went to Natal, where the vital port of Durban appeared to be within comparatively easy striking distance for the Boer forces. The British government was unwilling to order a complete mobilization, but on the recommendation of the Commander in Chief of the British Army, General Wolseley, they agreed to send 10,000 troops which Wolseley believed could defend Natal if war broke out until reinforcements could arrive by sea.\nThe first contingent were some troops returning to Britain from India, under Major General Penn Symons. The War Office subsequently dispatched units from garrisons in the Mediterranean and elsewhere, eventually totaling 15,000. Lieutenant General Sir George White was appointed to command this enlarged force. White was 64 years old, and suffered from a leg injury incurred in a riding accident. Having served mainly in India, he had little previous experience in South Africa.\nBritish deployments\nNatal was divided roughly into northern and southern parts by the Tugela River. Northern Natal was surrounded on three sides by Boer territory. Although advised to deploy his force south of the Tugela, White rejected this advice for reasons of prestige. Other senior British officers considered that White was badly advised by over-eager officers such as Penn-Symons or White's Adjutant General, Colonel Ian Hamilton. White concentrated the bulk of his force at Ladysmith, about  north of the Tugela, while a brigade under Penn-Symons was posted even further north at Glencoe and Dundee. Penn Symons' position was particularly exposed to danger, being so far north that it was vulnerable to being surrounded, while not far enough north to block the passes through the Drakensberg mountains which the main Boer armies would have to cross to invade Natal.\nOutbreak of war\nContrary to the advice of several British officials such as Sir Alfred Milner, the High Commissioner for Southern Africa, the independent Boer governments were not over-awed by the despatch of British troops to Natal. Instead, they regarded it as evidence of Britain's determination to seize control of the Boer republics. The South African Republic or Transvaal government under President Paul Kruger considered launching an attack in September, but President Steyn of the Orange Free State dissuaded them for several weeks while he tried to act as intermediary. With the complete breakdown in negotiations, both independent republics declared war and attacked on 12 October.\nA total of 21,000 Boers advanced into Natal from all sides. The only regular uniformed units were the Staatsartillerie of both republics (and some units of policemen such as the South African Republic Police or ZARP). The rest were mainly farmers, dressed in their ordinary working clothes, with some townsmen and contingents of foreign volunteers known as Vrijwilligers.\nAll were mounted, and most were armed with Mauser Bolt-action rifles. The artillery had two dozen German manufactured Krupp field guns and four heavy French manufactured 155 mm Creusot Long Tom guns.\nOn 20 October, two Boer forces attacked Penn-Symons' detachment at Dundee but were driven back at the Battle of Talana Hill. The British suffered heavy casualties (including Penn-Symons, who was mortally wounded) and were cut off from Ladysmith by another Boer force which captured a railway station at Elandslaagte which lay between them. On 21 October, British troops under Colonel Ian Hamilton and White's cavalry commander, Colonel John French, recaptured the station in the Battle of Elandslaagte. White was unable to follow up this success by relieving Penn-Symons's force (now commanded by Brigadier General J.H. Yule) as he feared that  Boers from the Orange Free State were about to attack Ladysmith. This decision highlighted Ladysmith's exposed position.\nYule's force had to make an exhausting four-day march across the Biggarsberg hills before they could rejoin White in Ladysmith. On 24 October, White made a demonstration at Rietfontein against the Boers pressing forward down the railway line from Glencoe to Ladysmith, to distract them from attacking Yule. The British suffered 132 casualties, mainly from artillery fire.\nBattle of Ladysmith\nBritish plans\nRather than retreat south of the Tugela, White continued to mass supplies and reinforcements in Ladysmith. (He sent the wounded south to Pietermaritzburg but left the civilians and other non-combatants in the town.) As the British troops concentrated in Ladysmith now constituted a balanced \"field force\" of all arms, White also rejected the option of leaving an infantry garrison in Ladysmith while sending the bulk of the mounted troops and artillery south of the river. He gambled on being able to strike a knock-out blow against the Boer armies in a \"set-piece\" action. This was despite the disadvantages of the terrain, with Ladysmith being on low ground surrounded by hills rising to  above the town, which gave the Boers the advantage of height.\nFrom 26 to 29 October, White sent out tentative cavalry reconnaissances, which he recalled when it appeared that Boer horsemen might cut them off. On 29 October, Boers could be seen emplacing one of their heavy Creusot siege guns on Pepworth Hill, roughly  north-north east of the town. Before this gun could open fire, White had already made plans for attack the following dawn, based on incomplete reconnaissances and observations.\nThe main frontal attack was intended to capture Pepworth Hill. The column was led by Colonel Ian Hamilton and consisted of the 1st battalion, the Devonshire Regiment, 1st battalion, the Manchester Regiment, 2nd battalion, the Gordon Highlanders and 2nd battalion, the Rifle Brigade. This attack was to be supported by a column under Colonel Geoffrey Grimwood, consisting of the 1st and 2nd Battalions, the King's Royal Rifle Corps; 1st Battalion, the Leicestershire Regiment; 1st Battalion, the King's Liverpool Regiment; and the 2nd Battalion, the Royal Dublin Fusiliers, which would attack the supposed Boer left flank and capture Long Hill, about  east of Pepworth Hill. The bulk of the mounted troops under Colonel John French (the 5th Lancers, 5th Dragoon Guards, 18th Hussars less a squadron lost at Talana Hill, 19th Hussars, several companies of Mounted infantry, the Natal Carbineers and the Imperial Light Horse were stationed in reserve or to Grimwood's right. Six batteries (the 13th, 21st, 42nd, 53rd, 67th and 69th) of 15-pounder guns of the Royal Artillery were to support the attacks.\nWhite also sent a detachment consisting of the 1st Battalion, the Royal Irish Fusiliers and half of the 1st Battalion, the Gloucestershire Regiment, with Number 10 Mountain Battery (equipped with RML 2.5-inch Mountain Guns) to capture a pass known as Nicholson's Nek which lay about  to the northwest of Pepworth Hill. The force was commanded by Lieutenant-Colonel Frank Carleton of the Royal Irish Fusiliers. White intended that by seizing the pass, this detachment would prevent the Boer force from the Orange Free State reinforcing the Transvaal Boers on Pepworth Hill, and also prevent the defeated Boers retreating directly north.\nLombard's Kop\nGrimwood's brigade had deployed during the night around Lombard's Kop and Farquhar's Farm, and faced north towards Long Hill. As dawn broke, Grimwood found that half his brigade had straggled, and French's mounted troops had not reached their assigned position. Before this could be corrected, the British troops came under heavy rifle fire from their own right flank. The Boers in this sector were nominally commanded by the elderly Commandant Lucas Johannes Meyer, but were actually led by Louis Botha.\nAt the same time, the first shell from the Boers' \"Long Tom\" on Pepworth Hill landed in the town, causing consternation. The British field guns opened fire on Pepworth Hill and Long Hill, and temporarily silenced the Boer siege gun but Colonel Ian Hamilton's frontal attack on Pepworth Hill was called off as it became clear that Grimwood was in trouble, and Hamilton's attack would not be supported. Although the main body of South African Republic Boers under Commandant-General Piet Joubert were stationed behind Pepworth Hill, there were none on Long Hill, and fire on this hill was wasted. The British artillery itself came under accurate and effective fire from the Boers' field guns, which were fought as individual gun detachments, and were quickly moved between emplacements before British guns could find their range. The British guns were deployed as they had been drilled to do, in neat rows of six without using cover from artillery or even rifle fire. Their fire was not as effective as that of the Boer Staatsartillerie, and they incurred needless casualties.\nAfter four hours, White had received no messages from Carleton, although firing could be heard from the position he was supposed to have occupied. With no prospect of a successful attack, he ordered his troops to \"retire as opportunity offers\". As they began to fall back into the open plain between Lombard's Kop and Ladysmith, they came under heavy fire from Botha's riflemen and the Boer gun on Pepworth Hill. Some of Grimwood's units (mainly those which had already suffered heavy casualties at Talana Hill, and were short of officers and tired) panicked and the retreat became a rout. Two batteries of field guns covered the retreat by withdrawing in stages, each battery providing covering fire in turn while the other limbered up and fell back. The British were also very fortunate that a detachment of naval guns (four 12-pounder and two 4.7-inch guns, under Captain Percy Scott of ) arrived by train in Ladysmith and went almost straight into action. Their first few rounds immediately found the range to Pepworth Hill and suppressed the Boers' \"Long Tom\".\nThe British fell back into Ladysmith, with units temporarily demoralised. The day was subsequently termed \"Mournful Monday\". Nevertheless, the Boers did not immediately take advantage of their victory. It is said that when Joubert was urged to follow up the British infantry, he replied, \"When God stretches out a finger, do not take the whole hand\".\nNicholson's Nek\nWhite was not aware of the fate of Carleton's force until the next day, when Joubert sent a letter which also unilaterally granted an armistice to allow the dead to be buried. Carleton's force had been late setting out because the mules carrying his guns and reserve ammunition had not been properly controlled by inexperienced drivers and had been fractious. As dawn approached, Carleton feared that because of the late start, his force would be exposed at daybreak in the open plain between Pepworth Hill and the Nek. He therefore decided to occupy a hill known as Tchrengula just to the south of the Nek. As they climbed the hill, the mules bolted and startled British soldiers fired several shots, alerting the nearest Boers.\nCarleton's men began preparing sangars on what they thought was the summit of Tchrengula. In fact the mile-long summit was divided into two peaks, and in the dark, the British had occupied only the southern, lower summit. Vice Commandant Christiaan De Wet quickly grasped the situation, and led some men on horseback to gallop to the northern end of the hill, where they dismounted and climbed the hill to occupy the undefended northern summit. From there, the Boers pressed forward along the summit which was strewn with rocks which gave individual Boer riflemen ample cover. The British sangars were exposed and obvious targets to the Boers, and gave inadequate protection. Like the artillery, the British infantry relied on drill, firing volleys on the command of an officer. By the time the order had been given, the intended target was safe behind cover, while the British soldiers were exposed to fire.\nThe British infantry resisted for several hours, but the numbers of wounded and killed increased and ammunition ran out. Finally, as the main British force could be seen retreating into Ladysmith, Carleton gave the order to surrender. A British officer waved a white flag at the same time. Some of the British troops had seen no reason for the surrender and felt themselves humiliated by the order. Eight hundred soldiers were taken prisoner.\nAftermath\nSince the Boers launched no immediate assault, the British force reorganised and constructed defensive lines around the town, which would require a major effort to overcome. They recovered morale through some small-scale raids at night which sabotaged some of the Boer artillery. Thereafter the siege became a long drawn-out blockade, except for a single storming attempt. After several failures, a force under General Redvers Buller, who was later known as \"Sir Reverse\" and the \"Ferryman of the Tugela\", broke through the Boer forces defending the Tugela to effect the Relief of Ladysmith on 28 February 1900. Britain then went on to regain control of South Africa.\nReferences\nBibliography\n*Kruger, Rayne; Goodbye Dolly Gray, New English Library, 1964\n*\n*\nExternal links\n*[https://web.archive.org/web/20080511172308/http://www.pinetreeweb.com/conan-doyle-chapter-07.htm Conan Doyle, Arthur; The Great Boer War]\n*[https://web.archive.org/web/20060621111316/http://www.free-ebooks-uk.netfirms.com/great-boer-war/13-the-siege-of-ladysmith.html free ebooks uk]"
    }
  ]
}