{
  "content": [
    {
      "type": "text",
      "text": "# Battles for the Ardennes\n\nBattles for the Ardennes is a \"quadrigame\" — a board wargame that contains four different battles using one set of rules — originally published by Simulations Publications, Inc. (SPI) in 1978 that simulates Second World War battles in the Ardennes Forest region in 1940 and again in 1944.\nDescription\nIn 1975, SPI published Blue & Gray: Four American Civil War Battles, the first board wargame that included one set of rules to be used with four different battles. Having four battles in one box was seen as good value for the money; SPI published several more \"quadrigames\" over the next seven years, one being Battles for the Ardennes.\nIn May 1940, the German army had broken through the lightly guarded Ardennes sector to start the Battle of France. This area again became a major point of contention during the Battle of the Bulge in December 1944. Battles for the Ardennes is a boxed set that covers both of these time periods with four scenarios:\n1940\n* Sedan, 1940\n1944\n*St. Vith: The Sixth Panzer Army Attack\n* Clervaux: Breakout of the 5th Panzer Army\n* Celles: The Battle Before the Meuse\nEach of these scenarios uses a different 17\" x 22\" hex grid map, all scaled at  per hex.\nIn addition, a separate rulebook includes rules for two larger games that cover the entire May 1940 blitzkrieg campaign in the Ardennes, and the entire \"Battle of the Bulge\" campaign in December 1944–January 1945. For both of these campaign games, all four of the maps are joined together to form a 34\" x 44\" master map.\nIn the 1944–1945 campaign game, the German player secretly chooses one of four Victory Plans — Historical Plan, Small Solution, Operation Luxembourg, or Spoiling Attack — each of which has different victory conditions. The Allied player does not have any way to know which Victory Plan the German player has chosen (and therefore, how to prevent a German victory), and must infer which one it is by how the German attack unfolds.\nComponents\nThe game box contains:\n* Campaign rule book\n* Scenario rule book\n* 800 counters (400 counters for 1940 battles, and a different 400 for 1944 battles)\n* four 17\" x 22\" paper maps\n* Errata sheet (included in games sold after October 1979)\nThe original SPI publication was published in either a flat box with a clear plastic top, or a standard-sized bookcase box. TSR's 1983 reprint was published in a bookcase box.\nPublication history\nBattles for Ardennes was designed by Danny S. Parker, with cartography by Redmond Simonsen, and was published by SPI in 1978. The game immediately rose to #6 on SPI's list of their Top Ten Bestselling Games, rose as high as #2 for several months, and stayed on the Bestesller list for nearly a year.\nThe published rules contained some errors and ambiguities that led to unbalanced play. SPI subsequently published errata in Issue #20 of Fire & Movement to solve the issues, and included an errata sheet in the game starting in October 1979.\nIn the early 1980s, SPI ran into financial difficulties and was taken over by TSR in 1983. TSR immediately sought to get some return on the deal by both releasing SPI properties that had been close to publication such as Battle Over Britain and A Gleam of Bayonets: The Battle of Antietam, and by re-printing SPI titles that had been popular in the 1970s such as ''Wellington's Victory and Battles for the Ardennes. When reissuing Battles for Ardennes, TSR did not revise the 1978 rules in order to incorporate the 1979 errata sheet, but merely reprinted the original rulebooks and included a reprint of the original errata sheet.\nIn 1994, Decision Games acquired the rights to Battles for Ardennes, and published a new revised edition with streamlined rules.\nReception\nIn Issue 92 of Campaign'', Ty Bomba noted, \"The '44 campaign game is so well designed and developed it's simply a pleasure to play. Its excitement level is high throughout, despite its size it's perfectly manageable.\" Bomba concluded, \"I'll close by saying do get this game, all of you. It's a true state of the art masterpiece, which at one swoop has moved Danny Parker to the front ranks of the designer-dom.\"\nIn his 1980 book The Best of Board Wargaming, Nicholas Palmer noted that \"As usual, the 1944 games steal the limelight, with the excitement of the Bulge campaign fully reflected in the even balance of the Clerveaux and St. Vith games.\" Looking at the games individually:\n* Sedan, 1940: \"The 1940 campaign is rarely simulated, perhaps because most people think of it as a pushover, but the game here is quite entertaining.\" Palmer gave this game an average \"excitement\" grade of 60%.\n*Celles: Palmer called this \"the poor relation of the quad, and definitely not worth buying on its own.\" He gave it a very poor \"excitement\" grade of only 20%.\n*Clervaux: \"The most difficult of the three 1944 folios\" earned an above average \"excitement\" grade of 80%.\n*St. Vith: \"Another finely balanced game [...] but less complicated strategic choices that in Clervaux\" This one was given an average \"excitement\" grade of 75%.\nIn Issue 15 of Imagine, Peter O'Toole reviewed the 1983 TSR reprint, and had many positive things to say. He pointed out that \"Movement is dealt with very realistically.\" He also found the air rules detailed, noting that \"marching units suffer severely from strafing planes.\" Although he found all four scenarios and both campaign games to be \"contests of skill\", he found one or two of them to be unbalanced. He was impressed  by the quality of the game components, except for the new cover art, which he called \"terrible\", noting it had \"a jolly Christmas Tree worked into the title.\" He was also disappointed that TSR had not revised the old rules to incorporate the 1979 errata sheet. As O'Toole wrote, \"One would have hoped TSR would put these right. Instead of incorporating corrections into the rules, they have reproduced errata sheets! It takes about half an hour to put these in by hand. By marketing these games, TSR have provided a good service. If they had corrected them and kept the original artwork, they would have provided an excellent service.\" He concluded with a strong recommendation, saying \"Ardennes provides a stimulating package for die-hard tankers and beginners to the field.\"\nIn Issue 65 of Fire & Movement, Jeff Petraska commented, \"Game play is fairly simple and straight-forward, with nothing really innovative. However, it's entertaining and offers a lot of variety for the dollar.\"\nWriting a retrospective analysis for spigames.net, Paul Sheppard thought that the victory conditions perhaps placed too much emphasis on the capture of towns. He rated the game about average in terms of complexity when compared to other \"Battle of the Bulge\" wargames such as SPI's monster wargame Wacht am Rhein (1977), \"but when looked at in terms of playability it ranks very high indeed. The choice of scenarios, the variations in strategy, the colourful presentation, the differing unit types all contribute to make this [quadrigame] one of the best.\"\nIn Issue 21 of Simulacrum, Steve Newberg commented, \"It is worth noting that this game breaks from the normal Bulge game in that one of the quadrigames and one of the two campaign games deal not with the Bulge at all, but rather with the 1940 Blitzkrieg against France and the Low Countries. In many ways the game is worth getting simply for the period break comparison of the two battles, separated by most of the length of the way, over the same area. Danny Parker made his life’s work out of games on the battle of the Bulge. This one, in its campaign form, is a bit larger than most of the others, but I think it is the best of the lot.\nOther reviews\n* Moves #46\n* Strategy & Tactics #71\n* Fire & Movement #18 and #20\n*The Wargamer Vol.1 #33,  and Vol.2 #17\n*Campaign #95\n*The Grenadier #27\n*Zone of Control #4\n*Paper Wars #21\n*Simulations Canada Newsletter #13\n*Wargame News #42\n* Casus Belli #26 (June 1985)\nReferences"
    }
  ]
}