{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Panther Creek\n\n| place             = Daviess County, Kentucky\n| partof            = American Civil War\n| date              = September 20, 1862\n| result            = Union victory\n| combatant1        =  United States of America (Union)\n| combatant2        =  Confederate States of America (Confederacy)\n| commander1        = William F. Wood\nJohn W. Crooks\n| commander2        = Robert M. Martin\n| units1            = 4th Indiana Legion\n15th Kentucky Cavalry\n| units2            = 10th Kentucky Partisan Rangers\n| strength1         = 420\n| strength2         = 800\n| casualties1       = 3 killed\n35 wounded\n| casualties2       = 36 killed\n70 wounded\n| image             = Battle of Panther Creek.jpg\n| image_size        =\n| caption           = Picture of the historical marker located at the Battle of Panther Creek\n| alt               = Battle of Panther Creek Historical Marker (January 2025)\n}}\nThe Battle of Panther Creek (also known as '''Battle of Sutherland's Hill''') was fought on September 20, 1862, south of Owensboro, Kentucky. It was the only battle that took place in Daviess County, Kentucky during the American Civil War.\nOn July 18, 1862, a small Confederate force of about 35 men led by Colonel Adam Rankin Johnson launched a successful raid on the small town of Newburgh, Indiana. This raid would become a known as the Newburgh Raid, becoming the first town in a northern state captured during the American Civil War. Using this success Johnson would recruit more men in the western Kentucky area and launch several more attacks throughout the state of Kentucky, and even into Tennessee. These new men would become part of the newly formed 10th Kentucky Partisan Rangers.\nOn the other side of this famous raid, it caused much fear throughout Union leaders of the local area as well as the Indiana wartime Governor Oliver P. Morton. After the Confederate victory at Fort Sumter the previous year, Governor Morton called for the raising and arming of a local militia force for the defense of the state. Colonel John W. Crooks took command of the 4th Indiana Legion Regiment, also known as the Spencer County Legion, which would make up majority of the Union strength during the battle, numbering 350 men total. The rest of the force would be made up by the 15th Kentucky Cavalry . The 15th Kentucky Cavalry  organized by Colonel Gabriel Netter in the summer of 1862, would make up 60 men during the battle. Colonel Netter was born in France in 1836 to a large Jewish family, he would immigrate to America in 1855. Colonel Netter joined the Union Army at the start of the American Civil War in 1861. During the winter of 1861–1862, Netter excelled as a company commander in the 26th Kentucky Infantry. In his first taste of action, he pushed far ahead of the main Union body during an attack on a Confederate Calvary camp in Woodbury, Kentucky. He led a successful raid behind Confederate lines that resulted in the burning of the Whippoorwill Bridge, an important part of the rail link between Confederate controlled Bowling Green, Kentucky and Clarksville, Tennessee. In May 1862, charges were brought against Netter by his commanding officer Col. Stephen Burbridge, accused of behavior that was \"insubordinate\" and using \"mutinous language to a superior officer\", as well as \"disobedience of orders.\" Netter then traveled back home to Hartford, Kentucky to recruit his new regiment, the 15th Kentucky Cavalry. By August 29, Netter transferred his command from Hartford to Owensboro, and encamped on the fairgrounds west of town near the Ohio River, called Camp Miller.\nThe rest of the force would be made up of 10-12 Kentuckians who would join them in the battle.\nPrelude\nCapture of Owensboro\nOn September 19, the 10th Kentucky Partisan Rangers rode into Owensboro, Kentucky and captured the city and surrounded the Union camp at daybreak with ease. Men of companies E, F, and H, commanded by Captain S. B. Taylor, J. S. Champion, and Clay Merriwether, moved to the west of Owensboro and the camp. This detachment would attempt to capture Camp Miller should the Federals make a move towards the Confederates in town. The main body, divided into two columns, and captured Owensboro. Capturing Owensboro was not Lieutenant Colonel Martin's primary goal. (Col. Adam Johnson was not present with the Rangers at the time because he was off to Richmond, Virginia to secure papers for his men.) Owensboro held little strategic or symbolic value to Martin. They did however secure much needed powder and ammunition but Camp Miller held much more. The camp had muskets, a six-pound cannon, horses, food, and other valuable supplies.\nWhile the fog remained low, a man ran into the camp to alert Col. Netter that rebels had taken the town, hundreds of them. Netter immediately got his battalion of recruits up and ready for a fight. At about that same time an African-American boy made his way into the camp. The information this boy possessed would stave off absolute disaster for Netter. He had heard from some Confederates in town that they had divided their force. Part of the 10th Kentucky Partisan Rangers did not go into Owensboro, instead positioning themselves in a woods and cornfield on the west side of the camp. They expected the Federals to make an advance toward town, and having vacated the camp the detached group would then capture the undefended weapons and destroy the supplies they couldn't take. Upon hearing this information Col. Netter decided to attempt an infantry-style breakout on foot, or at least drive off one portion of the Rebels before turning his attention back to Owensboro.\nSkirmish at Owensboro\nColonel Netter would leave about 100 men to guard the camp and the gunners for the artillery piece under the command of Sergeant Major Freeman. Netter would take the rest of about 200 of his men to face the Confederates. As the men were forming into column to march out of camp an officer in gray and brown approached with a white flag. Col. Netter saw the man and he told him that the town was in their hands and they had a force of about 800 men ready to attack the camp. The offer was simple, surrender the camp and there would be no blood spilled. Netter asked the rider if he could address his men saying that Lieutenant Colonel Martin demanded his surrender and asking for his men to hear his answer. He declared, \"NEVER, till the last man of us laid low in the dust.\" Turning back to his men he asked, \"Boys, does my answer suit you?\" Netter's men responded by giving three rousing \"HURRAHS.\" The Confederate saluted, got back on his horse, and rode back toward town. Netter's men then resumed their march.\nOne of the mounted advance pickets discovered Rebel activity in the field just ahead of Netter and his men. He came riding back and reported this to Netter who told his men to double-quick until they came to the Confederate position and formed into a line of battle. At that moment, a gunshot pieced the air and the fight was on. As the fighting continued Confederate Corp. Jim Hall took up a position next to a tree. Looking across the field Hall saw Netter handsomely dressed in his uniform, as Netter was climbing over a fence a bullet passed through his chest and fell to the ground. With just enough strength left Netter turned his head and yelled to his men, \"Charge, bayon...!\" Colonel Netter lay dead on the field.\nThe skirmish would last for about 30 minutes, with the Confederates retreating. Union sources put the Confederate casualties at 25-30 while Confederates accounts claim only a few.\nAftermath of skirmish\nFollowing the retreat from the fight, the partisans moved south of Owensboro to regroup. They stopped about 8 miles south of Owensboro past Panther Creek and rested at Sutherland Farm. Chaos still ensued back at Camp Miller after Col. Netter's death. A man by the name Hugh Hales was picked to swim across the Ohio River and alert the 4th Indiana Legion of the Confederates. Hales met with Col. John W. Crooks and Crooks decided to assemble his men and cross over to Kentucky. By early afternoon about 500 men were being transported over the river by two steamers called Ben South and John T. McCombs, protected under the cover of Spencer County Artillery. Upon entering the camp Col. Crooks saw the lifeless corpse of Col. Netter, whom we had just helped several weeks earlier. Upon hearing news that the Confederates moved south of Owensboro, Crooks decided to come up with a battle plan.\nThat same night Colonel William F. Wood of the 1st Indiana Calvary arrived in town at about 11:00&nbsp;p.m. and took command of the Union forces. It just so happened that Col. Wood was in the Evansville area recruiting. As soon as Wood arrived he began \"infusing confidence and restoring order.\" Wood was no amateur when it came to fighting Confederates. Wood saw action in both Missouri and Arkansas. Once told the information that the Confederates had moved south of town, Col. Wood decided to take the fight to the Confederates early the next morning. Wood would take 60 men from the 15th Kentucky Calvary under the command of Major Towne, as well as 350 legionaries and a few locals commanded by Col. Crooks. He also decided to bring the 6-pound cannon, putting Sgt. J.C. Finch under its command. The remainder of the men would stay back at Camp Miller and protect it. The stage was now set for the battle that would take place in the morning.\nBattle\nCavalry Attack and Rout\nAt 2:00&nbsp;a.m. the next morning, September 20, the Union force marched out of Owensboro to find and fight the Confederates. At dawn the cavalry approached the Confederate position of Sutherland Hill, about a mile and half from Panther Creek. As soon as the cavalry crossed the bridge over Panther Creek they made an advance through the Confederates pickets pushing the Rebels back about three-quarters of a mile.  Then charged up Sutherland's Hill were a much larger force met them. The Confederates would form somewhat of a battle line quickly and fire upon the cavalry, driving them into panic and retreating back done the hill. As the rest of the force was marching to the battle, the cavalry came roaring back toward the infantry, making them jump to the ditches for cover on the side of the road. After the danger passed, Crooks rallied the men to form back into line.\nAttack on Sutherland Hill\nThey continued to march forward and closed the distance between them and the Confederates. Once in range Col. Wood ordered the cannon turned toward the enemy and placed his cigar on the vent of the gun, setting off the round of canister. Col. Crooks infantry continued to march forward and once within firing range the Rangers opened fire on the Legion. After two shots of canister, Woods order the gun to fire a solid ball for the third shot. Once ready the order was given to fire and the trunnion caps exploded, rendering the cannon useless for the rest of the battle. After the cannon was wheeled to the back, Col. Wood had to change the battle plan. It was best decided to close in with the infantry and push the enemy out of the ditch toward the hill. With the \"Clarksville Belle\" roaring loudly on top of Sutherland's Hill, the rebels were not about to give up. After ordering the Legion to ceasefire, Col. Wood ordered loudly, \"Battalion, Forward, March!\" As they marched forward Col. Crooks noticed a ditch by the Livermore Road just before the fence. He ordered his men into the ditch and ordered to fire a volley at the Confederates. Noticing a wavering Confederate line Col. Wood decided to charge up Sutherland's Hill. As Wood was ascending up the hill, a Confederate bullet knocked his sword out of his hand and he lost his balance, falling to the ground. Leaping back to his feet, Col. Wood grabbed a musket and bayonet from a wounded Legion man. The firing continued and once the Union had reached the top of the hill the Confederates were in full retreat. The Union had won the hour and half long battle.\nAftermath\nFollowing the battle, the Federals counted the dead and wounded. The Union suffered 3 dead and 35 wounded. The Confederates suffered 36 killed, 70 wounded, and 16 captured.\nThe Confederate force would retreat roughly 20 miles to the Green River near Ashbyburg, Kentucky.  Here they forded the river waiting for another Union attack that never came. The 10th Kentucky Partisan Rangers would later on become the 10th Kentucky Cavalry and be absorbed by General John Hunt Morgan and participate in more action throughout the war.\nMeanwhile, the 4th Indiana Legion would retire back to Indiana after the battle and wouldn't see anymore action throughout the war. On the other hand, some men from Netter's 15th Kentucky Cavalry would join Colonel Quintus Shanks and his 12th Kentucky Cavalry. These men would become known as \"Netter's Avengers\".\nOwensboro, Kentucky would still see its fair share of chaos after September, 1862. Recruitment of United States Colored Troops in town and the 100th, 109th, and 118th United States Colored Infantry as well as the 5th and 6th United States Colored Cavalry went on to service in the war. Owensboro would also see Captain Bill \"Bloody-Handed\" Davison burn the towns courthouse on January 4, 1865.\nSee also\n* List of battles fought in Kentucky\n* List of Kentucky Confederate Civil War units\n* List of Kentucky Union Civil War units.\nReferences\nFurther reading\n* Johnson, Adam Rankin, and William J. Davis. The Partisan Rangers of the Confederate States Army. Louisville, Ky.: G. G. Fetter Company, 1904.\n* Lindow, Derrick. We Shall Conquer or Die: Partisan Warfare in 1862 Western Kentucky. Savas Beatie, 2024.\n* Terrell, William Henry Harrison. Indiana in the War of the Rebellion. United States, Douglass & Conner, printers, 1869."
    }
  ]
}