{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Grynau\n\nThe Battle of Grynau in 1337 was the concluding battle in the Grynau war between the Old Swiss Confederacy and its Imperial city Zurich against a noble army under the leadership of Count Johann I (Habsburg-Laufenburg). The result was a Zurich victory.\nHistory\nThe place of the battle, the castle Grynau, secured one of the few crossings over the Linth between Lake Zurich and Walensee and was therefore a strategically important place. In 1311 the castle was placed under the control of The Count Of Habsburg-Laufenburg (1270-1314), but was also claimed by the Counts of Toggenburg.\nThe new mayor Rudolf Brun banished 22 noble councilors and their families from the city after his political reorganization. They found support in the surrounding nobility houses, which felt threatened by the rise of the city of Zurich.\nThe fugitives came under Count Johann I (Habsburg-Laufenburg) in Rapperswil, who also took the lead in this fight because of his own debts. He was indebted to both the city and some of the exiles. Under his protection, the exterminated constituted a counter-government of the \"outer Zurich\" in Rapperswil, and began to make excursions through the subject area of the city of Zurich. The aim was to overthrow the new government of Zurich. Count Johann was a mercenary during these years.\nAgainst the opponents of the new Rapperswiler city government was several times proceeded, as can be concluded from an above-average number of (probably politically motivated) executions and, for example, a ban on assembly.\nZurich, too, sought restraint with allies, and found it with Count Kraft III of Toggenburg, who endeavored to take a profitable position between the Old Swiss Confederacy and the Habsburgs and who was in conflict with Johann I because of Grynau. As early as 1327, Zurich had already concluded a Burgrecht with the Count, who was also the protector of the Zurich Grossmünster.\nThe abbot Konrad I was known to Brun, and he sympathized with the cause of the Zurichers and recognized their constitutional changes.\nReferences"
    }
  ]
}