{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Tukaraq\n\n}}\n| caption           = Tukaraq location in Somaliland\n| date              = 8 January 2018Second round of clashes: 15–24 May 2018\n| place             = Tukaraq, Somaliland\n| casus             =\n| territory         = Tukaraq captured by Somaliland National Army\n| result            = Somaliland victory\n| combatant1        =\n*\n| combatant2        =\n*\n| commander1        =\n| commander2        =\n| strength1         =\n| strength2         =\n| casualties1       = 3 captured as POW\n| casualties2       = 140 captured as POW\n| casualties3       = 200–300 in total\n2,700 families displaced\n| notes             =\n}}\nThe Battle of Tukaraq in 2018 saw the Somaliland National Army engage Puntland forces in Tukaraq, a town in the eastern Sool region, on the road between the regional capitals of Las Anod and Garowe. The ensuing heavy clashes resulted in Somaliland ousting the Puntland army from the town. The battle was significant as it was the first time both forces clashed directly.\nOverview\nThe town is situated 86km west of Garowe, the capital of Puntland, a federal member state in northern Somalia. Up until the battle the town was a customs point operated by Puntland. Somaliland had earlier captured Tukaraq from Khaatumo State forces in 2012, who subsequently fled to Ethiopia. Somaliland forces then later withdrew from the town, with Puntland assuming control. Puntland and Somaliland have previously clashed in the outskirts of Tukaraq in 2011.\nSomalia's president Mohamed Abdullahi Mohamed visited the Puntland region earlier, hoping to improve strained relations between the federal member states of Puntland and Galmudug and the federal government. He was also asked by traditional elders from the Tukaraq area to visit the contested area and unconfirmed reports suggested that he intended to visit the contested Sool region.\nBattle\nEarly in the morning on 8 January Somaliland forces launched an offensive to capture the town. Heavy clashes ensued between Somaliland and the defending Puntland forces, with its defensive positions being overran and the town captured.\nMay clashes\nA second and much deadlier round of clashes between both sides took place in mid-May in the holy month of Ramadan when Puntland launched a multi-front offensive in an attempt to recapture the town. After heavy shelling Somaliland repelled the offensive.\nAftermath\nSeveral rounds of clashes of varying levels of intensity have occurred since Somaliland's capture of the town.\nOn 3 June 2019, just before Eid ul Fitr, Somaliland and Puntland exchanged POWs captured as a result of the conflict, with Somaliland releasing 140 soldiers and Puntland releasing 3.\nResidents registered to vote in the upcoming Somaliland parliamentary elections scheduled to be held in May 2021. However, Somaliland lost its control over Tukaraq in 2023 over the pro-statehood mass demonstrations surrounding the Las Anod conflict.\nReactions\n* - Somali president Mohamed Abdullahi Mohamed and then Prime Minister Hassan Ali Khaire expressed their concern over the clashes and called for an immediate halt of the conflict.\n** - The Puntland administration released a press release, accusing Somaliland of provoking the clashes and of suppressing freedoms in the regional capital Las Anod.\n* - In a press release, Somaliland denied provoking the clashes, and announced that the country was negotiating to defuse the ongoing conflict in Tukaraq.\n* - UNSOM released a press conference where it expressed grave concern and called for the fighting to immediately halt and for both sides to start dialogue. A joint IGAD-UNSOM mission paid a visit to high ranking officials of both sides aimed at resolving the conflict, including Presidents Muse Bihi Abdi and Abdiweli Mohamed Ali Gaas.\nReferences"
    }
  ]
}