{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Sandfontein__disambig_1\n\n| place      = Sandfontein, German South West Africa\n| casus      =\n| territory  =\n| result     = German victory\n| coordinates       =\n| map_type    = Namibia#Africa\n| map_relief  =\n| map_size    = 300\n| map_marksize =\n| map_caption =\n| map_label   =\n| combatant2 =\n| combatant1 =\n*  German Southwest Africa\n| commander2  = R.C. Grant E.J. Welby\n| commander1  =  Joachim von Heydebreck\n| strength2   =237 officers and soldiers2 cavalry squadrons2 artillery pieces2 machine guns\n| strength1   =1,700 soldiers10 artillery pieces4 machine guns\n| casualties2 =16 killed51 wounded205 captured\n| casualties1 =14 killed46 wounded\n| campaignbox =\n}}\nThe Battle of Sandfontein was fought between the Union Defence Force of South Africa and the German Empire  on 26 September 1914 at Sandfontein, during the first stage of the South West Africa Campaign of World War I. It ended in a German victory.\nBackground\nThe outbreak of World War I led to the transfer of the British Imperial garrison from South Africa to France. Expecting the war to finish quickly, many South Africans also departed for Europe, aiming to take part in the combat. The Union Defence Force took the responsibility of independently protecting South Africa from a possible German offensive. In the meantime, prime minister Louis Botha found himself in the middle of a confrontation between pro-British loyalists supporting full involvement in the war and Afrikaner nationalists advocating neutrality.\nGerman colonial troops in South West Africa numbered 140 officers, 2,000 regulars, and 2,500 reservists organized into eight mounted companies, a single camel corp, four field batteries, and an air wing. 1,500 policemen and 200 Boer rebels could also be potentially mobilized. The majority of the German army consisted of non Askaris, as the Germans were resented by the African population due to their conduct during the Herero Wars. Despite their unpopularity, the German Schutztruppe was well organized and disciplined. The UDF had the ability to mobilize as many as 100,000 troops, yet it had a heterogeneous structure and lacked experienced staff officers.\nA large portion of the South African-German borderline consisted of a ragged open desert characterized by the absence of water.\nThe difficult terrain enabled the German army to create a defensive frontier along the line of Windhuk and Keetmanshoop, and troops were also stationed adjacent to the two regional railroads. Having a limited number of troops in his possession, the German commander, Joachim von Heydebreck, ordered his troops to assume defensive positions and observe predefined routes. The area of Sandfontein held high strategic importance due to the presence of the only high-quality water wells in a 75-kilometer radius, thus being a crucial supply point for any large scale operation. The South African military was well aware of the complicated geographic conditions, possessing a variety of prewar journals and reports concerning German southwest Africa's topology.\nOn 7 August 1914, the British government requested Botha to capture the German communication stations of Windhoek, Swakopmund and Lüderitzbucht. On 10 August, following intense negotiations, the Botha government reluctantly agreed to create a volunteer expeditionary force, only after the parliament's approval. Mobilization and troop maneuvers ensued even before the parliament's decision, as the government enforced censorship on the press to suppress the spread of rumors. On 21 August 1914, the expeditionary force took its final form. A column consisting of 1,200 soldiers and six artillery pieces known as Force C was to strike Lüderitzbucht. A column consisting of 1,800 soldiers and eight guns known as Force A would land at Port Nolloth, in support of Force C. Finally, the 1,000-man Force B would invade from the eastern direction, attacking Upington. The plans regarding the invasion were revealed during a 9 September parliament session, gaining approval. On 14 September 1914, South Africa officially entered the war; however, the situation was soon complicated by the outbreak of the Maritz Rebellion the following day. The revolt led to the resignation of several high-ranking commanders involved in the expeditionary force, who now rose in an open rebellion against their former colleagues and had to be hastily replaced.\nBattle\nOn 12 September 1914, Force A under Brigadier-General Tim Lukin arrived at the border post axis of Raman's Drift, Houms Drift, and Gudous. A week later, the 4th and 5th South Africa Mounted Riflemen regiments penetrated the border capturing Sandfontein. Force A proceeded to disperse, occupying Steinkopf and Raman's Drift, as German troops began concentrating on the eastern border. Sandfontein remained isolated and vulnerable to attack as the area was surrounded by hillocks and narrow sand ridges that could be used during an encirclement maneuver. The German command made full use of its superior intelligence, having previously detained a South African scout and holding the allegiance of the rebellious Force B commander Manie Maritz.\nSandfontein's garrison of 120 men was hurriedly reinforced by two squadrons of mounted riflemen, two machine guns, an ambulance, and two thirteen pounder artillery pieces on the early morning of 26 September. A force of 1,700 men, ten artillery batteries, and four machine guns gathered at Warmbad, encompassing Sandfontein on the dawn of 26 September. The German column immediately launched a simultaneous attack from Houms Drift and Warmbad, surprising the defenders.\nThe defenders began engaging the German cavalry that emerged from the northeast when another body of troops suddenly appeared from the southwestern direction. At approximately 8 o'clock, fighting intensified with the beginning of an artillery duel. Enjoying numerical superiority, the German troops struck the unprotected flank and rear of the South Africans, who had lost the capacity of breaking through the encirclement. A South African machine-gun section foiled an infantry rush from the northeast, which intended to capture the battlefield's tallest hillock. At the same time, a German machine gunner approached from the south, killing a large pack of horses and scattering the remains, later destroying an enemy machine-gun position. At 8.30, a second German battery made its appearance, suppressing the South African artillery and slaughtering the second pack of horses stationed nearby.\nAt 10.00, German infantry attempted a second charge from the eastern direction, retreating after suffering heavy casualties. At 11.00 transferred their artillery and machine guns to the southwest, concealing them in the stony outcrops. An hour later, the distance separating the two combatants numbered approximately 550 meters. Around the same time, UDF army commander Colonel R. C. Grant was wounded by machine-gun fire and was substituted by Captain E. J. Welby before again assuming command. Between 13.00 – 14.00, the main body of German troops ceased hostilities to have a meal while bombarding the exhausted South African troops, the majority of whom spent the previous night marching. By 17.00, German troops halved the distance separating them from the South African positions, employing high explosive shells. At around 18.00, the South African troops raised the white flag. German casualties amounted to 14 dead and 46 wounded, while the South Africans lost 16 men dead and 51 wounded.\nSee also\n*Kalahari Desert\n*Water supply\nReferences\nFurther reading\n*The Great War in Africa, 1914–1918 by Byron Farwell. Norton, 1989\n*Die Deutsche Schutztruppe 1889–1918 by Werner Haupt. Dorfler, 1988\n* Historicus Africanus, \"Der 1. Weltkrieg in Deutsch-Südwestafrika 1914/15\", Volume 1, 2. Edition, Windhoek/Namibia 2012,\n* Historicus Africanus, \"Der 1. Weltkrieg in Deutsch-Südwestafrika 1914/15\", Volume 2, \"Naulila\", Windhoek/Namibia 2012,\n* Historicus Africanus, \"Der 1. Weltkrieg in Deutsch-Südwestafrika 1914/15\", Volume 3, \"Kämpfe im Süden\", Windhoek/Namibia 2014,\n* Historicus Africanus, \"Der 1. Weltkrieg in Deutsch-Südwestafrika 1914/15\", Volume 4, \"Der Süden ist verloren\", Windhoek/Namibia 2016,\n* Historicus Africanus, \"Der 1. Weltkrieg in Deutsch-Südwestafrika 1914/15\", Volume 5, \"Aufgabe der Küste\", Windhoek/Namibia 2016,\n* Historicus Africanus, \"Der 1. Weltkrieg in Deutsch-Südwestafrika 1914/15\", Volume 6, \"Aufgabe der Zentralregionen\", Windhoek/Namibia 2017,\n* Historicus Africanus, \"Der 1. Weltkrieg in Deutsch-Südwestafrika 1914/15\", Volume 7, \"Der Ring schließt sich\", Windhoek/Namibia 2018,\n* Historicus Africanus, \"der 1. Weltkrieg in Deutsch-Südwestafrika 1914/15\", Volume 8, \"Das Ende bei Khorab\", Windhoek/Namibia 2018,\n* Warwick, Rodney C., Reconsideration of the battle of Sandfontein, Unpublished M.A. dissertation, University of Cape Town, 2003.\n* Warwick, Rodney C., The battle of Sandfontein, Scientia Militaria: South African Journal of Military Studies, Volume 34, No. 2, 2006."
    }
  ]
}