{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Sunchon (air)\n\n*\n** No. 77 Squadron RAAF\n| combatant2        =  China (officially);\n* &nbsp;(unofficially)\n** 176th Guards Fighter Aviation Regiment (unofficially)\n| commander1        =  Gordon Steege\n| commander2        =  Sergey Vishnyakov\n| strength1         = Up to 14 Gloster Meteors  (Soviet estimate: 16 Meteors)\n| strength2         = 20 MiG-15s  (RAAF estimate: 40–50 MiGs.)\n| casualties1       = Three aircraft destroyed – one pilot missing, presumed killed and two POW. (Soviet pilots claimed nine Meteors destroyed.)\n| casualties2       = None confirmed.(RAAF records claim one MiG destroyed and one probable/damaged.)\n| notes             =\n| campaignbox       =\n}}\nThe Battle of Sunchon was an air battle fought near the city of Sunchon, North Korea on 1 December 1951, during the Korean War. Up to 14 Gloster Meteor jets of the RAAF's No. 77 Squadron were attacked by at least 20 MiG-15s of the Soviet Union's 176th Guards Fighter Aviation Regiment (176 GIAP). The MiGs carried Chinese air force markings, as the USSR was not officially a combatant in the Korean War. Its experience in the battle led to No. 77 Squadron's being redeployed to ground attack duties.\nNo. 77 Squadron was engaged in an offensive sweep, at 19,000 feet (5,800 metres) when the action commenced, at about 0900 hours. During the ensuing 10 minute action, air combat ranged across North Korean air space, at altitudes of 20,000 to 33,000 feet (6,100 to 10,000 metres). Pilots on both sides were veterans of World War II, with several years experience flying fighters. However, the Meteor was a World War II-era design that was outclassed by the new MiG-15.\nSoviet pilots, according to the RAAF, destroyed three Meteors. A total of nine kill claims were made by Soviet pilots, including one by a future ace, Captain Sergei Kramarenko.\nOfficially, no aircraft from 176 GIAP were lost on this occasion, according to Soviet records. Lieutenant Stepa Kirichenko reportedly lost control of his MiG, but recovered at an altitude of about 500 metres and returned to base.|group=Note}} managed to eject and landed in North Korea where they became prisoners of war, while Pilot Officer E. D. (Don) Armit was reported missing in action, presumed killed.\nThis encounter, along with previous actions between the Meteors and MiGs, highlighted the inferiority of the Meteor in aerial combat against the newer Soviet aircraft and No. 77 Squadron was subsequently reassigned to ground attack. It was also the only engagement during the course of the war in which Australia and the Soviet Union directly clashed in battle.\nNotes\n;Footnotes\n;Citations\nReferences\n*\nExternal links\n*[https://web.archive.org/web/20090913201252/http://www.argo.net.au/andre/MeteorsENFIN.htm Soviet Pilots in Korea]\n*[http://www.adf-serials.com/2a77.shtml ADF Serials website]"
    }
  ]
}