{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Laing's Nek\n\n| casus             =\n| territory         =\n| result            = Boer victory\n| combatant1        =\n| combatant2        =\n| commander1        =  George Colley\n| commander2        =  Piet Joubert\n| strength1         = 1,216\n| strength2         = 2,000\n| casualties1       = 84 killed113 wounded2 captured\n| casualties2       = 14 killed27 wounded\n| map_type          = South Africa\n}}\nThe '''Battle of Laing's Nek''' was a major battle fought at Laing's Nek during the First Boer War on 28 January 1881.\nBackground\nFollowing the Boer declaration of independence for the Transvaal in 1880 the British suffered a series of disastrous defeats in attempting to regain the territory.\nOn 20 December 1880, Lieutenant-Colonel Philip Robert Anstruther and elements of his regiment, the 94th, marched from Lydenburg to Pretoria, the regiment’s band leading the column playing the popular song \"Kiss Me, Mother Darling\".\nAt Bronkhorstspruit the force was stopped by Boers, who courteously required the \"Red Soldiers\" to turn back. Anstruther equally courteously refused, at which point the column was devastated by rifle fire from the surrounding Boer ambush. Of the 259 in the column, 155 officers and men became casualties, as did some of the women accompanying the regiment.\nInstead of waiting for the reinforcements, the British High Commissioner for South East Africa, Major General Sir George Pomeroy Colley, assembled what troops he could and rushed forward, claiming to be moving to relieve the British garrisons in the Transvaal.\nColley gathered his force at Newcastle in Natal, dispatched an ultimatum to the Boers and, on its rejection, advanced towards the Transvaal border.\nThe first British camp on the march lay some 4 miles short of Laing’s Nek, a ridge in the foothills of the Drakensberg Mountains that blocked the road between Newcastle and Standerton in Natal and Transvaal respectively.\nThe battle\nThe British Natal Field Force, commanded by General Colley, numbered around 1,216 officers and men, including 5 companies of the 58th Regiment, 5 companies of the 3rd Battalion, the 60th Rifles, about 150 cavalrymen of the Mounted Squadron, a party of Royal Navy sailors with two 7-pound guns, and finally a unit of men from the Royal Artillery with four 9-pound guns.\nThe Boers, under the command of Commandant-General Joubert had about 2,000 men in the area, with at least 400 fortifying the heights around Laing's Nek. They had little difficulty in repulsing General Colley's inadequate force.\nOn the morning of 28 January, Colley tried to force a way through the pass. The battle began at around about half past nine with a heavy bombardment with the four 9-pounder guns and two 7-pound guns of the British Naval Brigade pounding the Boer positions on Table Hill.\nTen minutes later, the main British force, made up of the 58th Regiment, went forward and had difficulty advancing over the broken ground towards the summit. Further down the line, the Mounted Squadron made a charge against the Boer positions on nearby Brownlow's Kop. But, on reaching the summit, the British cavalry were fired upon by a line of entrenched Boers on the reverse slope, suffering many casualties, forcing them to withdraw.\nBy 10:30, with their threat to their flank removed, the Boers moved to attack the 58th Regiment still advancing on Table Hill where at 11:00, at reaching the top of the summit, the British were fired upon by concealed Boers in trenches just  away and suffered even more casualties, including both commanding officers, Major Hingeston and Colonel Deane being killed.\nWhile this was happening, a small party of Boers actually advanced from their positions on the lower slopes of nearby Majuba Hill and engaged the Naval Brigade near the British camp at Mount Prospect. Return rifle fire from the British kept the Boers back. By 11:10, two companies of the 3/60th Rifles had moved up Table Hill to cover the retreat of the 58th Regiment and by noon, the battle was over.\nAftermath\nThe British lost 84 killed, 113 wounded, and 2 captured during what was perceived as a fiasco. Most of the casualties were from the 58th Regiment, with 74 killed and 101 wounded, around 35% of their total strength. Among those killed in the battle were many of General Colley's staff including Major Poole and Lieutenants Dolphin, Elwes and Inman. The Boers reported their losses at 14 killed and 27 wounded. One month later, General Colley was killed at the Battle of Majuba Hill, which ended the war, after which Transvaal was recognised as an independent state.\nVictoria Crosses\nThe Victoria Cross is the highest and most prestigious award for gallantry in the face of the enemy that can be awarded to British and Commonwealth forces.\n*Laing’s Nek is memorable as the last occasion that a British regiment took its colours into action. The 58th were led up the hillside by Lieutenant Lancelot Baillie carrying the Regimental Colour and Lieutenant Alan Richard Hill carrying the Queen's Colour. Baillie was mortally wounded while Hill won the Victoria Cross bringing casualties down from the hillside. Hill passed the two colours to Sergeant Budstock for safe keeping; a necessary concession to the realities of late 19th century combat. Four officers in succession were shot down carrying the colours of the 58th.\n*During the charge of the mounted men, John Doogan, a private in the 1st King's Dragoon Guards, saw Major William Vesey Brownlow, an officer to whom he was servant, dismounted and in danger among the Boers because his horse had been shot. Private Doogan rode up, although he was himself severely wounded, dismounted and pressed the officer to take his horse, receiving another wound while doing so. He, too, was awarded the Victoria Cross.\nReferences\nFurther reading\n* Castle, Ian. Majuba 1881: The Hill of Destiny, Oxford, Osprey Publishing, 1996,\n*Laband, John. The Transvaal Rebellion. Routledge: London, United Kingdom, 2005.\n* Raugh, Harold E. The Victorians at War, 1815-1914: An Encyclopedia of British Military History, ABC Clio, 2004.\n* Spiers, Edward. The Victorian Soldier in Africa, Manchester University Press, 2004."
    }
  ]
}