{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Basra (2003)\n\nBattle of Basra}}\n)\n| place             = Basra, Iraq\n| result            = Coalition victory, Basra captured by British forces\n| combatant1        =  Coalition forces\n|\n|\n|\n| }}\n| combatant2        =  Iraq\n| commander1        =\n| commander2        =\n| strength1         =\n| strength2         =\n| casualties1       = 11 killed2 tanks damaged1 APC damaged2 Scimitars destroyed (friendly fire)(United Kingdom)\n| casualties2       = 395–515 killed14 tanks destroyed\n| campaignbox       =\n}}\nThe Battle of Basra lasted from 21 March to 6 April 2003 and was one of the first battles of the 2003 invasion of Iraq. The British 7 Armoured Brigade fought their way into Iraq's second-largest city, Basra, on 6 April coming under constant attack by the Iraqi Army 51st Division and Fedayeen Saddam, while elements of the British Parachute Regiment cleared the 'old quarter' of the city that was inaccessible to vehicles. Entering Basra had only been achieved after two weeks of conflict, which included the biggest tank battle of the war by British forces when the Royal Scots Dragoon Guards destroyed 14 abandoned Iraqi tanks on the 27 March.\nBackground\nBasra is a city of more than one million people, located in Southern Iraq. To military and economic planners, it represents a strategic objective because it sits near a port that provides access from inland Iraq to the Persian Gulf. The area around Basra itself produces much of Iraq's oil, which is processed at a local refinery. To the south-east is Rumaila oil field, which by itself contains billions of barrels worth of crude oil—14% of the world supply. To the north-east is the West Qurna Field, the second-largest oil field in the world.\nBritain captured Basra from the Ottoman Empire in 1914. In 1932, Iraq became nominally independent of Britain and British troops left a few years later. During the Second World War, the brief Anglo-Iraqi War broke out during 1941. British forces, unopposed, seized the city and surrounding area as a base for an advance towards Baghdad although the war came to an end before that occurred.\nThe city was a major target during the Iran–Iraq War of the 1980s and was bombed by the US during the 1991 Gulf War.\nBasra was the site of a 1991 uprising to overthrow Saddam Hussein after the US had driven the Iraqi Army from Kuwait. Residents became embittered when support promised by the US did not materialize. Basra then suffered from years of sanctions and bombing, as well as bad treatment from Hussein. An Iraqi living in exile said in 2001: \"Iraqis think Saddam is America's man. These people are not going to forget what has happened to them. In their eyes, it is genocide. And people do not forget genocide.\"\nThe population of Basra saw a dramatic increase in birth defects and childhood cancer during the 1990s; these illnesses and others were blamed on US depleted uranium munitions used in 1991. Sanctions compounded the problem by blocking access to medical equipment and increasing the price of supplies.\nThe United States bombed Basra routinely throughout the 1990s and leading up to the Iraq War.\n2003 Invasion of Iraq\nBasrans learned of the planned invasion in late 2002 began to prepare for an attack—forming militias and building fortifications.\nRegular bombings of Basra continued during this period.\nTargeting\nThe US declared Basra as one of its first targets of the war.\nSpokespeople for the US military told the media that Basra's Shi'ite population would welcome the invading forces and rise up against Saddam Hussein. This claim played a role in the public relations campaign conducted by the US and UK governments to win public support for the war.\nAmong Iraqi cities, Basra \"would be one that would fall quickly and would yield immediate photogenic results,\" said US military historian Raymond Callahan.\n\"Basra is a prime target. It would give a clear message to the regime—we have got your oil and commercial centre,\" said Colonel Christopher Langton of the International Institute of Strategic Studies.\nApproach\nUS and UK forces entered Iraq from Kuwait on 19 March (20 March UTC), approaching Basra on the road that had become notorious as the \"Highway of Death\" during the Gulf War. The invading army reportedly moved slowly down the highway, having created a traffic jam of military vehicles.\nThe first fighting of the declared invasion took place on the oilfields and coastline near Basra.\nSome fires had already been started at the oil fields. Three fires were visible from across the border in Kuwait.  US Defense Secretary Donald Rumsfeld blamed Hussein and said: \"It is a crime for that regime to be destroying the riches of the Iraqi people.\"\nThe immediate objective for the Coalition forces was to control Basra and the nearby Rumaila oil field. By the 22 March, US Marines had gained control of the oil field.\nAircraft dropped leaflets on Basra urging Iraqi soldiers to surrender; some did.\nOn the 23 March, two soldiers of the Royal Engineers, 33 Engineer Regiment (Sapper Luke Allsopp and Staff Sergeant Simon Cullingworth) were captured in an ambush by Fedayeen fighters on the outskirts of Basra; both were later murdered.\nOn the 24 March, Lance Corporal Barry Stephen from the 1st Battalion, Black Watch Regiment was killed when a rocket-propelled grenade exploded near his armoured vehicle in an action at Al-Zubayr, near Basra.\nOn the 25 March, a Challenger 2 tank was hit by 'friendly fire' from another British tank outside Basra, killing two British soldiers (Corporal Stephen John Allbutt and Trooper Jeffrey Clarke).\nOn the 27 March 12 Challenger 2 tanks of C squadron, Royal Scots Dragoon Guards, supporting 40 Commandos advance from al-Faw to Basra, engaged and destroyed 14 Iraqi T-55 tanks, members of 40 Commando also fought brief firefights with Fedayeen fighters and came under fire from Iranian border guards.\nSiege\nCoalition forces met with unexpected resistance in Basra and environs. After a few days of combat, most of the invading American troops moved northwards, leaving Basra under a multi-week siege led by the British—considered better suited because of their past experiences in Iraq and Northern Ireland. A few members of D Squadron, British SAS, were deployed to southern Iraq to support the coalition advance on Basra, the team infiltrated the city and brought in strikes on the Ba'athist loyalist leadership.\nHumanitarian crisis\nWater and electricity became scarce after most of Basra's electrical infrastructure was destroyed on 21 March. On the 24 March, the International Committee of the Red Cross announced that 60% of Basra's population had been cut off from clean water, and warned of a coming \"humanitarian crisis\". Al Jazeera reported on the 27 March that Anglo-American forces had blocked the city's supply of drinking water, and were preventing the Red Cross from restoring access.\nUS Deputy Secretary of Defense Paul Wolfowitz said on the 31 March:\nThere seems to be a water problem in Basra but it should be very clear it's not because of anything we did. There's been no bombing of Basra. It seems to be something the regime did. The Red Cross has been in there and we're told that 70 percent of the water supply has been restored. The Kuwaitis are laying a pipe up to the border with water and we're going to pipe it on up to the city.\nMany actions were undertaken and the Red cross and British Royal Engineers co-operated in ensuring supplies were maintained even if they were reduced for a period of time.\nA Center for Economic and Social Rights report claimed that the \"Anglo-American blockade deprived one million residents of access to safe drinking water for almost two weeks\". Meanwhile, UNICEF officials warned that \"there are 100,000 children in Basra at risk for severe fever and death because one water treatment plant stopped functioning.\"\nSpokespeople for the Coalition forces said that humanitarian aid shipments were nearby and available, but it was not yet possible to transport or distribute them to the city.\nBritish engineers attributed the shortages to plundering and long-term decay of infrastructure.\nAerial bombing\nThe invading forces (including the Royal Australian Air Force) used bombing and psychological warfare during the siege.\nOn the 5 April, US bombers targeted the residential al-Tuwaisi area of downtown Basra—reportedly attempting to kill Ali Hassan al-Majid (a.k.a. \"Chemical Ali\"). Al-Majid was not present, but 17 civilians were killed by one of two 500-pound laser-guided bombs dropped by US planes.\nCluster bombs\nCluster bombs pose a humanitarian concern because they can leave unexploded \"bomblets\" which, like landmines, pose an ongoing threat to civilians. The UK did not acknowledge any use of cluster bombs until 3 April, at which time it maintained that these bombs were not used near dense civilian populations. Colonel Chris Vernon stated: \"We are not using cluster munitions, for obvious collateral damage reasons, in and around Basra.\" On 7 April, UK Secretary of Defence Geoff Hoon said he was \"confident that the right balance [had] been struck\" between avoiding civilian casualties and protecting Coalition troops.\nOn the 28 May, Britain said it had used cluster bombs in Basra. According to Armed Forces Minister Adam Ingram: \"We said they would be targeted on specific military targets. There were troops, there was equipment in and around the built-up areas, therefore the bombs were used accordingly to take out the threat to our troops.\" Ingram acknowledged using more 2000 cluster bomb projectiles on Basra. These were mostly L20A1 artillery shells, fired from the ground—each containing 49 smaller explosives. About 102,900 individual grenades were therefore fired. According to the UK Ministry of Defense, 2% of these (around 2050) were \"duds\" that did not explode immediately.\nUK cluster bombs caused \"dozens\" of civilian casualties in Basra during the first few days of battle. Human Rights Watch reported:\nU.K. forces caused dozens of civilian casualties when they used ground-launched cluster munitions in and around Basra. A trio of neighborhoods in the southern part of the city  was particularly hard hit. At noon on March 23, a cluster strike hit Hay al-Muhandissin al-Kubra (the engineers' district) while `Abbas Kadhim, 13, was throwing out the garbage. He had acute injuries to his bowel and liver, and a fragment that could not be  removed lodged near his heart. On May 4, he was still in Basra's al Jumhuriyya  Hospital. Three hours later, submunitions blanketed the neighborhood of al-Mishraq al Jadid about two-and-a-half kilometers (one-and-a-half miles) northeast. Iyad Jassim Ibrahim, a 26-year-old carpenter, was sleeping in the front room of his home when shrapnel injuries caused him to lose consciousness. He later died in surgery. Ten  relatives who were sleeping elsewhere in the house suffered shrapnel injuries. Across  the street, the cluster strike injured three children.\nThe attack also left dud grenades scattered through Basra. Some of these injured children who picked them up. Others injured UK troops later tasked with cleanup.\nChildren were also injured by \"dud\" grenades fired by the Iraqi military.\nBritish Royal Engineers undertook an operation to search for and dispose of any stray grenades over a number of weeks. This proved effective.\nLandmines\nThe Iraqi military used antipersonnel and anti-vehicle landmines to obstruct the Coalition advance and to fortify urban positions. These mines caused civilian and military casualties.\nDepleted uranium\nUS and UK forces both used depleted uranium munitions in the course of the battle.\nBasra officials contested the use of these weapons, saying that depleted uranium used during the 1991 Gulf War was responsible for birth defects and cancer among the city's population. US munitions director Colonel James Naughton explicitly addressed concerns about the poisonous effects of these weapons, saying that Iraq had exaggerated these claims in order to avoid fighting against the weapon:\nThe Iraqis tell us terrible things happened to our people because you used it last time. Why do they want it to go away? They want it to go away because we kicked the crap out of them—OK?\n\"Friendly Fire\" incident\nOn the 28 March 2003, a US Fairchild Republic A-10 Thunderbolt mistakenly attacked and destroyed two British Scimitar reconnaissance vehicles in a \"friendly fire\" incident. One British soldier was killed and several were wounded. This incident provoked controversy in the British media and was later judged to be an \"unlawful killing.\"\nOther events\nOn the 24 March, there were reports of a major uprising against Ba'athist rule in the city but were suppressed by Republican Guard and Ba'ath Party militia; who were under the command of Ali Hassan al-Majid (a.k.a. \"Chemical Ali\").\nBritish paratroopers fought two companies of Iraqi infantry in the Rumaila oil fields, killing or wounding about two-hundred. The Paras called in close air support from RAF Harriers and US A10 \"tankbusters\" during the battle.\nInvasion of Basra\nOn 24 March 2003, 847 Naval Air Squadron provided transport and attack capabilities to ground forces while deployed to Camp Viking, Kuwait. The unit used Westland Gazelles and Westland Lynx AH.7's for reconnaissance and transport/offensive respectively. After 11 days the unit destroyed 43 targets around Southern Basra with no losses.\nUS military spokespeople announced that the British forces would conduct \"smash and grab\" raids against Hussein loyalists. Using tanks, the British began to gain control over buildings and shantytown areas on the outskirts of the city. On the 27 March, 3 Commando Brigades BRF (Brigade Reconnaissance Force) twice raided—with the support of heavy weapons, the Basra suburb of Abu al-Khasib; after D company, 40 Commando exploratory attacks established that the area had been well fortified. The raids intention was to harass the Iraqis and test their defences and their capabilities to reinforce the area.\nOn the 30 March, British forces south of Basra carried out Operation James, whose objective was to take the Abu al-Khasib suburb. This was not a major assault on the city, but it would put pressure on Iraqi forces in the area. Whilst A, B and D company, 40 Commando, and the MSG (Maneuver Support Group) assaulted the suburb, Scimitars from C squadron Queens Dragoon Guards covered their advance, firing on Iraqi fighters bunkers and buildings. The BRF captured the bridge across the waterway, which cuts off the suburb from the city and the surrounding villages east of it, after a firefight with 20–30 Iraqi soldiers who were either killed or retreated. The advance was supported by mortar, artillery and naval gun fire whilst the Iraqis mortared the British advance. Several marines were wounded while they faced sporadic resistance from Iraqi soldiers and militia, as they moved through the suburb. A squadron of Challenger II tanks, from the Scots Dragoon Guards, moved into the suburb to support the advance. They engaged and destroyed mobile or dug-in Iraqi T-55 and other armoured vehicles. One Challenger was damaged after being hit by several RPGs. By 31 March, the suburb had been secured.\nEventually, a column of 120 Iraqi tanks coalesced and directly engaged with the 7th Armoured Brigade. During the battle, 300 prisoners were taken. This event was described as the largest British tank battle since the Second World War. On March 26 the Republican Guard forces grew frustrated by their inability to draw the British into a fight inside of Basra, and Ali sent out a column of Soviet-built T-55 tanks to attack the British. The T-55s were outranged by the 120-millimeter guns of the British Challenger tanks of the Royal Scots Dragoon Guards, which resulted in the loss of 15 T-55s without a single loss to the British.\nBritish tanks and warrior-mounted infantry from the 7 Armoured Brigade entered the city center from the north on 6 April after repeated raids and shelling. British soldiers destroyed the Ba'ath Party headquarters and battled Iraqi soldiers and Fedayeen fighters mainly in fortified houses and pillboxes, but lost three killed (Privates Christopher Muzvuru and Kelan Turrington and Lance-Corporal Ian Malone) in the process. It soon became obvious that the Iraqi defences were falling apart as Iraqi forces abandoned their positions, the brigade fought more than 300 militia at the College of Literature for 3 hours, eventually securing it, breaking the back of the Fedayeen resistance in Basra\nAlso on 6 April, 42 Commando, supported by a squadron of Challenger IIs from the 2 Royal Tank Regiment, and a Royal Artillery Forward Observation Team from 16 Battery, with support from 8 Commando Battery, assaulted the city from the south. Taking the Iraqis by surprise, M company secured five bridges in the city whilst the Fedayeen fled into the city. 539 Assault Squadron RM and U.S. Navy SEALs attempted a waterborne approach to the city via the Shatt al-Arab waterway but were intercepted by Iranian patrol craft and withdrew to avoid engaging. As J company approached the presidential palace, a USMC Harrier dropped a 1,000-pound bomb on a compound that controlled access to the palace, forcing the Iraqi forces guarding the palace to flee. The company secured the palace, which was considered the symbol of Ba'athist party domination of the inhabitants for more than 20 years. U.S. Navy SEAL teams headed to \"Chemical Ali's\" house with SSE teams to find traces of chemical weapons.  In early April the British began a series of devastating yet limited raids against Iraqi positions using Warrior Armored Fighting Vehicles equipped with 30-mm cannons. British reconnaissance forces launched a highly successful probe into northern Basra on the morning of April 6 and decided to move into Basra in force. At 11:00am on April 6, British troops moved into the city. Despite heavy fighting, the British suffered only three soldiers killed, and by the evening of 7 April they were in complete control of the city of Basra.\nAbout nine days into the British occupation, Basra's library was burned down. 70% of its collection, however, had been moved into safer places under the leadership of its librarian Alia Muhammad Baker.\nOccupation\nOn 7 April, the Parachute regiment moved into the old town, meeting very little resistance.\nOn 20 April, Basra residents gathered for a Shia religious festival whose celebration had not been allowed under Ba'athist rule. It was the first time they celebrated it in more than 20 years.\nBy the 23 April 2003, oil was flowing through pipelines from the Basra area. In the following months, the US reported acts of sabotage against the oil production and transport operations in the area.\nThe Shias largely welcomed the occupation. However, even after the fall of Basra, British troops occasionally came under small arms fire, whilst Marine bases were attacked by RPGs or mortars at night.\nOn the 4 July 2003, Wael Abdul Latif was appointed as Basra's provisional governor.\nIn August, Basrans began mass demonstrations, which sometimes spilled over into riots. British soldiers in riot gear used rubber bullets against thousands of people filling the streets and throwing stones.\nIn September 2003, a Basran named Baha Mousa died in British custody. Later investigation found that some British soldiers had used the illegal \"five techniques\" against multiple detainees from the area.\nIn October 2003, the first Jaish al-Mahdi (JAM) units in Basra were established, which soon began low-level attacks against British troops and intimidated civilians working for the occupation forces.\nAftermath\nItself victimised by bombings, the Red Cross withdrew from Basra in October 2003—exacerbating ongoing health issues. On 2 September 2007, the 550 remaining British soldiers in Basra finally withdrew, doing so during the night in order to limit the risk of ambush.\nUnexploded ordnance\nThe battle left unexploded ordnance and weapons stockpiles throughout Basra and surrounding areas.\nHealth issues\nLater investigation has found that coalition bombers used heavy metals, such as lead and mercury. These metals poisoned babies who were born in Basra after 2003, in some cases causing serious birth defects. A 2012 study found that babies born in Basra during 2011 were 17 times more likely to suffer from birth defects than babies born in 1995. These defects most commonly involved damage to the central nervous system.\nChildhood leukemia rates have increased substantially. Cancer rates have also increased overall.\nThe epidemic of childhood sickness and cancer in southern Iraq has been attributed to coalition use of depleted uranium munitions in 2003 as well as 1991. The Basrah area reportedly contains the country's densest concentration of sites contaminated by these weapons. Doctors and environmental workers in Basrah had become aware of possible depleted uranium poisoning in the 1990s and begun remediation efforts; these were suspended when war broke out anew in 2003.\nEpidemiological studies have been scarce and uncertainty remains about the causes and solutions to the poor health of the Basra population. Doctors and government officials have identified this uncertainty itself as a source of anxiety, fear, and distrust.\nCleanup workers who later found depleted uranium rounds were asked to wear gloves and a mask, to place any rounds in water, seal the containers, and deliver them to a nearby UK military base. Contaminated scrap metal also represents a major source for possible exposure.\nThe UK Ministry of Defence later released information on 51 locations in Basrah Province where it used depleted uranium munitions.\nReferences\nCitations\nBibliography\n* Docherty, Bonnie, and Marc E. Garlasco. Off Target: The Conduct of the War and Civilian Casualties in Iraq. New York: Human Rights Watch, 2003.\n* Zwijnenburg, Wim. [http://www.ikvpaxchristi.nl/media/files/in-a-state-of-uncertainty.pdf In a State of Uncertainty]. IKV Pax Christi, January 2013.\nExternal links\nArticles\n* [https://web.archive.org/web/20110902152130/http://www.britains-smallwars.com/gulf2/Basra.html The Battle for Basra]\n* International Crisis Group (ICG), \"[https://web.archive.org/web/20130611235323/http://www.crisisgroup.org/en/regions/middle-east-north-africa/iraq-iran-gulf/iraq/067-where-is-iraq-heading-lessons-from-basra.aspx Where is Iraq Heading? Lessons from Basra]\", Middle East Report 67,  25 June 2007.\nPhotographs\n* [https://web.archive.org/web/20160305063803/http://rmp-sib.co.uk/Kyriakou-Iraq2003Album/slides/Basra%20Riot%20(5).html Civil unrest] in September 2003"
    }
  ]
}