{
  "content": [
    {
      "type": "text",
      "text": "# Battle Royale II: Requiem\n\n| director       =\n* Kenta Fukasaku\n}}\n| producer       =\n| screenplay     =\n| based_on       =\n| starring       =\n| music          = Masamichi Amano\n| cinematography = Junichi Fujisawa\n| editing        = Hirohide Abe\n| studio         = Fukasaku-gumi\n| distributor    = Toei\n| released       =\n| runtime        = 133 minutes (2003)\n* 155 minutes (Special Edition) (2005)\n| country        = Japan\n| language       = Japanese\n| budget         =\n| gross          =\n}}\nis a 2003 Japanese dystopian action film directed by Kinji Fukasaku and Kenta Fukasaku, who co-wrote the screenplay with Norio Kida. It is the sequel to the 2000 film Battle Royale, which in turn was based on the 1999 novel of the same name by Koushun Takami. Unlike the first film, Requiem is an original story. It is set three years after the events of the previous film and follows Shuya Nanahara, who has now become an international terrorist intending to bring down the Japanese totalitarian government. As a result, another class of ninth graders is kidnapped and sent to eliminate Nanahara within a limited time period of 72 hours.\nDirector Kinji Fukasaku, who helmed the first film, started production but died of prostate cancer on January 12, 2003, after shooting only one scene with Beat Takeshi. His son Kenta Fukasaku, who wrote the screenplay for both films, completed it in his directorial debut and dedicated it to his father.\nBattle Royale II: Requiem was theatrically released in Japan in July 2003, by Toei. In stark contrast to its predecessor, it drew negative reviews from critics and audiences and grossed $14.9 million against a budget of $9 million, less than half of what the previous film grossed with double the budget. In 2005, an extended version, entitled Revenge, which runs 20 minutes longer than the theatrical cut, was released on DVD after the incident. It included additional action, improved effects, slow motion shots, new score in several scenes, and an extended storyline.\nPlot\nThree years after escaping the Battle Royale program, Shuya Nanahara and previous winners of the death game form the Wild Seven, a guerrilla group who oppose the Japanese authoritarian government. The Wild Seven declare war “against all adults” by destroying the Tokyo Metropolitan Government Building, killing eight-thousand civilians in the attack. In response, the New Century Special Anti-Terrorism Act (or “BRII”) is initiated, forcing high school students to combat terrorism in an altered version of Battle Royale.\nShiori Kitano, daughter of the late BR instructor Kitano, volunteers for the new program to learn why her father idolised Noriko Nakagawa over her. She is transferred to Shikanotoride Middle School, joining Class 3-B, consisting of delinquents and troubled children, many who lost families in the terrorist attack. Amongst them is the hot-tempered Takuma Aoi, his best friend Nao Asakura, diabetic Haruka Kuze, and rugby team captain Shintaro Makimura.\nOn a staged field trip, the class are driven onto a military site and placed in a holding pen. Their teacher Riki Takeuchi enters, informing his students that they are to infiltrate the Wild Seven’s remote island base and kill Shuya within three days. As with past Battle Royales, the students wear explosive neck collars that will be detonated if they disobey orders. However, each student’s collar is linked to another, and will detonate if their counterpart dies. When Shintaro refuses to participate, he is executed, leading to the death of Kazumi Fukuda. The remaining forty students agree to participate.\nThe next day, the armed class storm the island, though a majority are killed by gunfire or booby traps. Led by Shiori, the class infiltrate the Wild Seven’s fort but are surrounded by the rebels, leading to a stand-off. Emotions soon run high, leading to several more deaths. Realising that the students are wearing bomb collars, Shuya orders Wild Seven technician Maki Souda to activate an EMP device, disabling  and removing the collars, sparing the remaining students. The students meet Shuya, who explains that he and Norika fled to Afghanistan, finding the populace living with hope, despite suffering twenty years of warfare. Riki, who lost his daughter in the Tokyo bombing, deploys soldiers to kill Shuya. The remaining students side with the Wild Seven, killing the soldiers.\nOn Christmas Day, Shuya televises a live message to the world calling for the young to oppose their rulers. In retaliation, the United States strikes the island with a missile. Takuma and Haruka are buried under rubble, where the latter dies from wounds. The Japanese Prime Minister informs Riki that the United States will launch an attack on the Wild Seven in twelve hours, ordering Riki to bomb the island himself. When Riki refuses, the Prime Minister assumes command and dismisses him.\nCome dawn, the Wild Seven prepare for battle, sending the students and non-combatants to safety through an escape passage, though Shiori stays behind. Takuma decides to return, joined by classmates Masami Shibaki and Osamu Kasai. In the lengthy battle, all members of the Wild Seven save Shuya are killed. Shuya, Takuma, and Shiori are met by Riki, sporting a bomb collar, who allows them to escape just as his collar explodes, timed with a pre-programmed bomb set up by the Wild Seven to destroy the fort.\nThe three escape the explosion and assault a swarm of soldiers. Shiori is mortally wounded in the battle, revealing her identity to Shuya, and asks about Noriko, understanding why Kitano favoured her, as she treated her father cruelly. Shuya and Takuma perform a final stand as the island is bombarded with missiles.\nThree months later, Shuya and Takuma arrive in Afghanistan and reunite with the surviving students, including Noriko. The group part ways, with Shuya concluding the future is bright as long as there is hope.\nCast\n* Tatsuya Fujiwara as Shuya Nanahara\n* Ai Maeda as Shiori Kitano\n* Shugo Oshinari as Takuma Aoi\n* Ayana Sakai as Nao Asakura\n* Haruka Suenaga as Haruka Kuze\n* Yuma Ishigaki as Mitsugu Sakai\n* Miyuki Kanbe as Kyoko Kakei\n* Nana Yanagisawa as Mayu Hasuda\n* Masaya Kikawada as Shintaro Makimura\n* Yōko Maki as Maki Souda\n* Yuki Ito as Ryo Kurosawa\n* Natsuki Kato as Saki Sakurai\n* Aki Maeda as Noriko Nakagawa\n* Riki Takeuchi as Riki Takeuchi\n* Sonny Chiba as Makio Mimura (Shinji's revolutionary uncle)\n* Ai Iwamura as Mai\n* Mika Kikuchi as Ayane Yagi\n* Beat Takeshi as Kitano\n* Yoshiko Mita as Takuma's Mother\n* Nanami Ohta as Hitoe Takeuchi\n* Takeru Shibaki as Shugo Urabe\n* Toshiyuki Toyonaga as Shota Hikasa\n* Masahiko Tsugawa as The Prime Minister\nProduction\nKenta Fukasaku said, \"We never set out to make Harry Potter.\" He explains that he wanted audience members to ponder \"big issues\" and to view the world from a point of view held by a terrorist. Fukasaku added that the film, against \"the new Matrix\" and Terminator III, needed to \"provide something that Hollywood can't.\" Fukasaku intended to provide an alternative to what Time magazine's Ilya Garger describes as \"the moral certainty of American culture\" as seen in U.S. films and foreign policy.\nKenta Fukasaku said that he viewed his task as finishing his deceased father's movie instead of as directing his first creation; the son credits the film as his father's. Kenta Fukasaku desired a lot of controversy and outrage for the sequel, adding that \"the more strongly people react, the better.\" The film was mainly shot on Hashima Island (\"Battleship Island\").\nReception\nRequiem received generally negative reviews from film critics. The film received a rating of 30% at Rotten Tomatoes based on 10 reviews, and an average rating of 5.4/10.  Many of the reviewers criticized the film for being inferior to the original, having a contrived, confusing plot line, its controversial, provocative sentiments, and generally bad acting.\nIlya Garger of Time said that while the film has more \"bullets, bombs and dramatic battlefield deaths\" than its predecessor had, the sequel does not have the \"who'll-die-next-and-how suspense.\" Garger described the characters in Battle Royale II as \"a simpler breed\" who join forces to defeat the adults. One of the few positive reviews was from Jamie Russell of BBC who stated that the film \"scrapes by on the strength of its startlingly subversive political commentary,\" wearing \"its anti-American sentiments on its sleeve.\" Despite criticizing it for being \"torturously overlong, resoundingly clunky and full of a bloated sense of its own importance,\" it concluded that \"its decision to cast its heroes as teenage Al Qaeda-style terrorists fighting against a fascistic adult America is staggeringly bold.\"\nMusic\nThe sequel's soundtrack has more original work by Masamichi Amano and fewer classical pieces. One of them, Farewell to the Piano, is played by Shiori Kitano herself during the film.\nThe song from the opening credits is \"Dies Irae\", taken from the ''Verdi's Requiem.\nThe end title song is by the Japanese punk band Stance Punks. The song \"Mayonaka Shounen Totsugeki Dan\" features on their first full-length, self-titled album.\nBooks\nThe book The Road to BRII () is a behind-the-scenes photo collection about the production of the movie. About ten tie-in books related to the movie have been released in Japan.\nRelated manga\nA manga series called Battle Royale II: Blitz Royale is partially related to Battle Royale II: Requiem. The school in Blitz Royale'' is Shikanotoride Junior High School, and the \"teacher\" pops pills like Riki Takeuchi. There are numerous plot differences between the film and manga.\nReferences\nNotes\nExternal links\n*\n*\n* [http://www.dvdcompare.net/comparisons/film.php?fid=4702 Comparison of DVD releases]"
    }
  ]
}