{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Eutaw Springs__disambig_1\n\n| result      = See Aftermath\n| combatant2  =\n*  Loyalists\n| combatant1  =\n| commander2  =  Alexander Stewart\n| commander1  =  Nathanael Greene\n| strength2   = 2,000\n| strength1   = 2,200\n| casualties2 = 85 killed297 wounded70 wounded prisoners430 captured (foragers captured before the battle)Total882\n| casualties1 = 119 killed382 wounded60 captured18 missingTotal579\n|campaignbox=\n}}\nThe Battle of Eutaw Springs on September 8, 1781, was the last major engagement of the Revolutionary War to be fought in the Carolinas. Both sides claimed a victory.\nBackground\nIn early 1781, Major General Nathanael Greene, commander of the Southern army in the Continental Army, began a campaign to end British control over the South Carolina backcountry. His first major objective was the capture of the British-controlled village of Ninety Six. On May 22, 1781, Greene laid siege to the fortified village. After nearly a month Greene became aware that reinforcements under Lord Rawdon were approaching from Charleston. Forces under Greene's command assaulted Ninety Six on June 18, but were repelled. To avoid facing the force commanded by Rawdon, Greene retreated toward Charlotte, North Carolina. Rawdon pursued Greene for several days but abandoned the pursuit because his men were exhausted by days of forced marching and he lacked sufficient supplies to continue. In spite of the fact that Ninety Six was the only remaining inland British outpost after the fall of Augusta, Georgia, Rawdon decided to burn and abandon it, and withdrew the garrison to Charleston.  In poor health, Rawdon sailed for England in late August, leaving Charleston under the command of Colonel Alexander Stewart.\nOn 16 July, Greene moved his army, exhausted by many days of marching and combat, to a campsite on the High Hills of Santee, allowing his main force to rest while awaiting reinforcements.  Marion and Sumter continued to harass the British in a \"war of posts\".  On August 23, his force moved towards Camden to cross the Wateree River, and then Howell's Ferry to cross the Congaree River.  By 4 Sept., they were camped at Fort Motte, then Stoudenmyer's Plantation on 5–6 Sept.\nBy 13 Aug., Colonel Stewart had led a force of 2,000–2,300 men from Orangeburg to Thompson's Plantation, south of the Congaree River.  He then fell back to Eutaw Springs on 27 Aug., about 2 miles east of present-day Eutawville, then in Charleston District (but both now in Orangeburg County).\nOrganization\nAt 4:00 am on 8 September 1781, Greene's army began marching from Burdell's Plantation in the direction of Eutaw Springs, which was  distant. In the van were Lieutenant Colonel Henry Lee's Legion plus 73 infantry and 72 cavalry of South Carolina State troops under Lieutenant Colonel John Henderson and Captain Wade Hampton, respectively. Next in the marching column came 40 cavalry and 200 infantry under Brigadier General Francis Marion, followed by 150 North Carolina militia under Colonel Francis marquis de Malmedy and 307 South Carolina militia led by Brigadier General Andrew Pickens. Continental Army troops formed the center and rear of Greene's column. These were led by three green North Carolina battalions under Brigadier General Jethro Sumner. Major John Armstrong led a mounted contingent while Lieutenant Colonel John Baptista Ashe and Major Reading Blount directed the foot soldiers. Ashe and Blount served with the 1st North Carolina Regiment, while Armstrong belonged to the 4th North Carolina Regiment.\nLieutenant Colonel Richard Campbell's two Virginia battalions under Major Smith Snead and Captain Thomas Edmonds were trailed by Colonel Otho Holland Williams' two Maryland battalions under Lieutenant Colonel John Eager Howard and Major Henry Hardman. Lieutenant Colonel William Washington's mounted men and Captain Robert Kirkwood's Delaware infantry companies formed the tail of the column. Greene's force had two 3-pound grasshopper guns under Captain-Lieutenant William Gaines and two 6-pound cannons directed by Captain William Brown. All told, Greene had 1,256 Continental infantry and 300 cavalry, the horsemen mostly divided between Lee and Washington. Lee's cavalry were led by Major Joseph Egleston and his infantry by Captain Rudolph. Greene's army numbered 2,400 men of whom 200 were left behind to guard the baggage train.\nStewart had between 1,800 and 2,000 troops on hand. His British regulars were the 3rd Foot, 63rd Foot, 64th Foot, and John Marjoribanks' 300-man flank battalion. The last-named unit was made up of the converged flank companies of the 3rd, 19th, and 30th Foot. The regulars were supported by two American loyalist contingents. These units were John Harris Cruger's regular battalion of DeLancey's Brigade and John Coffin's South Carolina Tories, which consisted of about 150 regular infantry and 50 militia cavalry. Stewart's artillery consisted of two 6-pound, one 4-pound, and one 3-pound cannons plus a swivel gun.\nBattle\nIn order to make up for a shortage of bread in his supplies, Stewart had been sending out foraging parties each morning to dig up yams, unarmed except for a small guard detail. At around 8 am on September 8, Captain John Coffin and a detachment of his South Carolina Loyalist cavalry were reconnoitring ahead of Stewart's main force when he encountered a mounted American scouting party under Major John Armstrong. Coffin pursued Armstrong, who led him into an ambush. Attacked by Henry Lee's 2nd Partisan Corps, Coffin escaped but left 4 or 5 of his men killed and 40 more captured. The Americans then came across Stewart's foragers and captured about 400 of them.\nGreene's force, with around 2,200 men, now approached Stewart's camp while Stewart, warned by Coffin, deployed his force. When the Americans realized they were approaching the British force, they formed three lines, with the militia in front with 2 3-pounders, followed by the Maryland, Virginia, and North Carolina Continentals with 2 6-pounders, with the Delaware Regiment and Washington in reserve. The Americans started the attack at 9 am with artillery and an advance by the militia.  This line consisted of, left to right, Hampton, Henderson, Pickens, de Malmedy, Polk, Marion, Lee's infantry and then Lee's Cavalry.  They were opposed by the British Line consisting of, left to right, Coffin, 64th, 63rd, New Jersey Volunteers, New York Volunteers, 84th, De Lancey's, 3rd, and Marjoribanks.  Hand-to-hand combat ensued when the Militia closed with the British Line.  Some militia panicked while some held firm, able to fire 17 times, before ordered back and replaced by the North Carolina Continentals in a 'passage of lines\".\nThe North Carolina Continentals halted the British advance but were forced back by a British bayonet charge, only to reform and halt the British a second time.  Greene then ordered the Maryland and Virginia Continentals forward in another passage of lines, forcing the British back towards their camp.  However, two areas of British resistance remained, one under Maj. Henry Sheridan at the Brick House, which included a swivel gun, and another under Maj. Marjoribanks on the northern flank.  Washington's cavalry tried to dislodge Marjoribanks, but Washington was unhorsed, wounded and taken prisoner, sitting out the remainder of the war.  Marjoribanks then retreated towards the Brick House.\nThe Brick House now became the focal point of the battle, and when an American artillery assault failed, the house gave the British a focal point to regroup, rally and reenter the battle. Maj. Marjoribanks then attacked the American flank in the clearing before the house before he was mortally wounded.  According to Stewart, the Americans \"gave way in all quarters, leaving behind them two brass six pounders and upwards of two hundred killed on the field of action, and sixty prisoners, amongst whom was Colonel Washington, and from every information, about eight hundred wounded...\"\nAccording to Otho Williams, some plundering of the British camp occurred, while an attack on the British left by Lee's cavalry failed.  At this point, Greene ordered a retreat with all of the wounded.  Greene's army was then able to march back to Burdell's Plantation in column formation, with a cavalry picket covering the orderly retreat.  According to Greene, \"Nothing but the brick house and their strong position at Eutaw's, hindered the remains of the British army from falling into our hands.\"\nCasualties\nThe British casualty return stated the loss as 85 killed, 351 wounded and 257 missing. However, Greene reported that he had captured 500 prisoners, including 70 wounded. When Stewart moved camp on September 9, he left 54 of his wounded behind with a surgeon to attend them. These men were included in Stewart's casualty report under the category \"wounded\" but the remaining 16 wounded captured by Greene would have been returned as \"missing\". The disparity between Stewart's report of 257 missing and Greene's figure of 500 prisoners may be due to Stewart regarding the capture of his foraging party as a separate engagement and not included in the British losses in his casualty return for the battle. Including the loss of the foraging party, and counting the 54 wounded men whom Stewart decided to leave behind on September 9 in the \"wounded prisoners\" category instead of as \"wounded\", this gives total British casualties of 85 killed, 297 wounded, 70 wounded prisoners and 430 other prisoners.\nThere were three successive versions of the American casualty return. The first, compiled soon after the battle, gave 251 killed, 367 wounded and 74 missing. The second, compiled somewhat later and published by the Continental Congress, reduced the losses to 138 killed, 375 wounded and 41 missing. The third and final revision, compiled on September 25, 1781, arrived at figures of 119 killed, 382 wounded and 78 missing. The British took 60 prisoners, including the wounded Colonel William Washington, and two artillery pieces.\nAftermath\nRain prevented a continuation of battle the next day.  Instead, Stewart buried his dead, destroyed supplies, including 1000 muskets, and retreated towards Moncks Corner, leaving behind 70 wounded.  Greene pursued Stewart as far as Martin's Tavern near Ferguson's Swamp.  At this point, 11 Sept., Stewart was within range of support from the British garrison in Charleston.\nStewart's letter to Cornwallis on 11 Sept. 1781 states,\nWith particular satisfaction I have the honour to inform your lordship, that on the 8th instant I was attacked by the rebel General Greene, with all the force he could collect in this province and North Carolina, and after an obstinate engagement, which lasted near two hours, I totally defeated him, and took two six pounders.\"\nGreene's letter to Washington on 17 Sept. 1781 states,\nBe far the most obstinate fight I ever saw. Victory was ours, and had it not been for one of those little incidents which frequently happen in the progress of war, we should have taken the whole British Army.\"\nThe claim of several historians that the British won the battle is challenged by Christine Swager in her book The Valiant Died: The Battle of Eutaw Springs September 8, 1781. The book argues that, first, at the end of the battle, the British held the majority, but not the entirety, of the field where the main battle took place. Greene held part of the field where the initial skirmish spilled out of the woods into the clearings. Swager also argues that Greene meant to re-engage the enemy on the following day, but was prevented from doing so because the excessively wet weather conditions negated much of his firepower.\nNeither army left the vicinity for at least a full day following the battle. When Greene withdrew, he left a strong picket to oppose a possible British advance, while Stewart withdrew the remnants of his force towards Charleston. His rear was apparently under constant fire at least until meeting with reinforcements near Moncks Corner.\nDespite winning a tactical victory, the British lost strategically. Their inability to stop Greene's continuing operations forced them to abandon most of their conquests in the South, leaving them in control of a small number of isolated enclaves at Wilmington, Charleston, and Savannah. The British attempt to pacify the South with Loyalist support had failed even before Cornwallis surrendered at Yorktown.\nLord Edward Fitzgerald, later to become famous as a United Irish rebel, served as a British officer at the battle and was badly wounded.\nThe Continental Congress awarded Greene a gold medal.\nThe State Song of South Carolina contains the line \"Point to Eutaw's Battle Bed\" in reference to this battle.\nThe Eutaw Springs Battleground Park was added to the National Register of Historic Places in 1970. The American Battlefield Trust and its partners have acquired and preserved more than  of the battlefield.\nSee also\n* American Revolutionary War § War in the South. Places ' Battle of Eutaw Springs ' in overall sequence and strategic context.\nReferences\nSources\n*\n*\n*\n*\n*\n*\n*\n*\n*\n* Swager, Christine R. The Valiant Died: The Battle of Eutaw Springs September 8, 1781.\n* [http://www.historyofwar.org/articles/battles_eutaw.html Battle of Eutaw Springs at HistoryOfWar.org]\n*\nFurther reading\n*\n* Oller, John. The Swamp Fox: How Francis Marion Saved the American Revolution. Boston: Da Capo Press, 2016. .\n* Currie, Mercer & Reid (Eds). Hector MacLean: The writings of a Loyalist-Era Military Settler in Nova Scotia. Gaspereau Press. 2015. (Soldier's journal of the Battle of Eutaw Springs)\n* Dunkerly, Robert M. and Irene B. Boland. ''Eutaw Springs: The Final Battle of the American Revolution's Southern Campaign'' (U of South Carolina Press, 2017), xviii, 147 pp."
    }
  ]
}