{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Morval__disambig_1\n\n| territory   =\n| result      = Anglo–French victory\n| combatant1  = ||||||}}\n| combatant2  =\n| commander1  =  Douglas Haig|Henry Rawlinson| Joseph Joffre|Ferdinand Foch|Émile Fayolle}}\n| commander2  =  Crown Prince Rupprecht of Bavaria|Fritz von Below}}\n| strength1   =\n| strength2   =4 divisions\n| casualties1 =5,000\n| casualties2 =135,000 in September\n| notes = Casualty statistics are incomplete and German losses at Morval are a portion of the September total.\n| campaignbox =\n}}\nThe Battle of Morval, 25–28 September 1916, was an attack during the Battle of the Somme by the British Fourth Army on the villages of Morval, Gueudecourt and Lesbœufs held by the German 1st Army, which had been the final objectives of the Battle of Flers–Courcelette (15–22 September). The main British attack was postponed to combine with attacks by the French Sixth Army on the village of Combles south of Morval.\nThe attack was to close up to the German defences between Moislains and Le Transloy, near the Péronne–Bapaume road (N 17). The combined attack from the Somme river northwards to Martinpuich on the Albert–Bapaume road, was also intended to deprive the German defenders further west near Thiepval of reinforcements, before an attack by the Reserve Army, due on 26 September. The postponement was extended from  because of rain, which affected operations more frequently during September.}}\nCombles, Morval, Lesbœufs and Gueudecourt were captured and many casualties inflicted on the Germans. The French made slower progress near the inter-army boundary, due to the obstruction of St Pierre Vaast Wood to the French attack north towards Sailly and Sailly-Saillisel. The inter-army boundary was moved north from  to allow the French more room to deploy their forces but the great quantity of German artillery-fire limited the French advance. The Fourth Army advance on 25 September was its deepest since 14 July and left the Germans in severe difficulties, particularly in a salient which developed to the north-east of Combles.\nTiredness and lack of reserves prevented the Fourth Army exploiting its success beyond patrolling and cavalry probes. The Reserve Army attack began on 26 September, at the Battle of Thiepval Ridge. Deteriorating weather and the shorter days greatly increased British and French transport difficulties; rain and fog grounded aircraft and impeded artillery observation. Mud reduced the blast effect of shells and immobilised infantry, which was an advantage to the defenders. A small number of tanks joined in the battle later in the afternoon, after having been held back because of the later start, reducing a number of German strong points, which had withstood earlier attacks.\nBackground\nStrategic developments\nAt the beginning of August, optimistic that the Brusilov Offensive would continue to absorb German and Austro-Hungarian reserves and that the Germans had abandoned their offensive at Verdun, Sir Douglas Haig advocated to the War Committee in London, that relentless pressure be kept on the German armies in France for as long as possible. Haig had hoped that the delay in producing tanks had been overcome and that enough would be ready to be used in September. Despite the small numbers of tanks available and the limited time for the training of crews by September 1916, Haig had committed them in the Battle of Flers–Courcelette, in view of the importance of the general Allied offensive being conducted on the Western Front in France, by Italy against the Austro-Hungarians and by Brusilov in Russia, which could not continue indefinitely. Haig had believed that the German defence of the Somme front was weakening and that by mid-September might collapse altogether.\nPrelude\nAnglo-French preparations\nAfter the attacks of 12 and 15 September, Foch and Haig kept the Germans off balance, by mounting smaller operations. The British 6th Division captured the Quadrilateral north of Combles on 18 September. on a sunken part of the Ginchy–Morval road.}} While the French Sixth and the Fourth Army prepared to resume larger attacks, the French Tenth Army to the south of the Somme captured Berny, Vermandovillers, Déniecourt and took several thousand prisoners. On the nights of 19 and 20 September, parties of the 56th (1/1st London) Division consolidated a line west and north-east of Combles, from Beef Trench to Middle Copse. The new trench was dug north-east to a tram line near the junction of the Ginchy–Morval road, which connected Middle Copse with the Quadrilateral further north, creating a line  long facing Bouleaux Wood. The division was ready to attack from Combles to Leuze Wood and Bouleaux Wood to envelop Bouleaux Wood and avoid a costly fight at close-quarters.\nCareful planning for the Anglo-French attack was necessary, due to the French Sixth Army advance diverging to the east and north-east. The attack northwards at Combles to keep touch with the British needed reinforcements, which were taken from the Tenth Army on the south bank. More artillery and aircraft were brought from Verdun and VII Corps was relieved; V, VI and XXXII corps entered the line (which had become  longer, since the advance of 12 September) between I and XXXIII corps, increasing the Sixth Army to five corps. The resumption of the general attack was planned for 21 September but poor weather forced a delay until 25 September. The preliminary bombardment began on 24 September but a thick autumn mist in the morning and hazy conditions all day, reduced the amount of counter-battery fire that could be delivered. Late on 25 September, after the Sixth Army had been held up by the fire power of the German forces north of St Quentin, Foch arranged a northward move of the inter-army boundary, so that the I and XXXII Corps could attack Sailly-Saillisel from the south, with V Corps as right flank guard. A conference at the British Fourth Army headquarters on 26 September, arranged the move of the inter-army boundary to run from Lesbœufs, north-east towards Rocquigny.\nAnglo-French plans\n{|class=\"wikitable\" align=right style=\"margin:0 0 1em 1em\"\n|+Weather15–28 September 1916\n|-\n! Date\n!Rainmm\n! °F\n|-\n| 15||0||59°–43°||coolhazy\n|-\n| 16||0||66°–41°||finesun\n|-\n| 17||2||63°–45°|| —\n|-\n| 18||13||63°–46°||rain\n|-\n| 19||3||55°–43°||wetwind\n|-\n| 20||1||61°–48°||rain\n|-\n| 21||0.1||59°–48°||dullrain\n|-\n| 22||0||64°–41°||mistsun\n|-\n| 23||0||66°–43°||fine\n|-\n| 24||0||72°–45°||mistsun\n|-\n| 25||0||73°–50°||fine\n|-\n| 26||0.1||75°–54°||fine\n|-\n| 27||0.1||72°–52°||dullrain\n|-\n| 28||1||73°–54°||finerain\n|}\nFoch intended to resume the French attack from Mont St Quentin, east of the Somme bend to Combles, at the boundary with the British Fourth Army. The Sixth Army was to advance , close to the German line running from Moislains to Le Transloy. In the south, VI and XXXIII corps would advance east and south-east, to establish a defensive flank along the Tortille stream, menacing Péronne from the north. V and VI corps would capture the south of Bois St Pierre Vaast (St Pierre Vaast Wood) and southern Saillisel, while I Corps and XXXII Corps advanced east to take Rancourt, the rest of Saillisel and the Wood, Frégicourt and Sailly-Saillisel. Distant objectives east of the Péronne–Bapaume road were selected, should the German defence collapse and the cavalry was made ready to prolong an advance.\nThe British plan was for an advance to the final objective set for the attacks of  during the Battle of Flers–Courcelette. The ground to be taken was on the east side of Bazentin ridge, which ran north-west from the Somme to a hollow facing north-east with Combles at the west end, the hollow running towards Rocquigny beyond the Péronne–Bapaume road. North of the hollow the ridge continued through Morval, Lesbœufs and Gueudecourt, then the Albert–Bapaume road, west of Le Sars to Thiepval. Spurs ran down the eastern slope, generally to the north-east in the direction of the Péronne–Bapaume road, before the ground rose again from St Pierre Vaast Wood to Sailly-Saillisel, Le Transloy, Beaulencourt and Thilloy.\nAn advance on the main front of the British attack of  was to be made in stages. The first step was an advance to the third of the objective lines set for 15 September and to the Gird Trenches () south of Gueudecourt, beginning at  The second objective was a line along the sunken road running from Combles to Gueudecourt, west of Morval and Lesbœufs, then over a spur south-east of Gueudecourt and through the centre of the village, beginning at  The final objective was on the east side of Morval, Lesbœufs and Gueudecourt, the advance to begin at  with the objectives to be reached by\nThe use of tanks was discussed at a conference on 19 September, where the difficulty in hiding them until the late zero hour, led to them remaining in reserve, ready to assist the attack on the villages at the final objective. The open ground on the approach to Gueudecourt was also considered to be too dangerous for tanks. Two brigades of the 1st Indian Cavalry Division were to move forward to Mametz, with all of the division to be ready to advance on Thilloy and Ligny Thilloy in the III Corps area once Lesbœufs and Gueudecourt were captured, if this was done before  Small cavalry detachments were also attached to XIV and XV corps to exploit local opportunities.\nThe British conformed to the French preference for afternoon attacks, which meant that the final bombardment took place in daylight, despite preferring dawn attacks, to avoid the attacking infantry waiting for too long in the front-line, vulnerable to German counter-bombardment. The XIV Corps commander Major-General the Earl of Cavan put all four divisions of the corps in line, to give them narrower fronts for easier deployment of the supporting infantry. The 56th (1/1st London) Division was to mask Bouleaux Wood and reach trenches to the north-east, cutting the tramlines which looped around the north end of the wood. The division was to gain touch with the 5th Division on the left, while trench mortar and machine-gun fire on the wood and on the north-eastern exits of Combles, kept the Germans under cover. The right flank brigade of the 5th Division was to advance from the second objective to Morval, with four  halts, gaining touch with the 56th (1/1st London) Division. The 6th Division to the north had already reached the third objective of the attack of 15 September, on a front of . The German defences on the flanks were too close for artillery and a Stokes mortar bombardment and machine-gun barrage were substituted, for zero hour.\nThe Guards Division (Major-General Geoffrey Feilding) anticipated \"strenuous\" German resistance. Feilding stressed that preparations for house-to-house fighting, maintaining direction, momentum were needed. The green line (first objective) was  west of Lesbœufs, the brown line was from the crossroads south of Lesbœufs, along the western edge of the village and the blue line (third objective) was east of the village from the Lesbœufs–Le Transloy road, northwards along the Lesbœufs–Gueudecourt road. Three tanks were attached to the divisional reserve, ready to move from Trônes Wood once the infantry attack started. The artillery was divided into two groups of three field artillery brigades for each brigade and the bombardment was to begin at  on 24 September. During the attack, half of the artillery was to fire standing barrages and the other half was to fire a creeping barrage, moving at  per minute until  beyond the green line, where it would become a standing barrage. Creeping barrages to the second and third objectives were to begin at  and\nGerman preparations\nOn 28 August, Chief of the General Staff, General Erich von Falkenhayn, simplified the German command structure on the Western Front by establishing two army groups.  controlled the 6th, 1st and 2nd armies, from Lille to the boundary of , south of the Somme battlefield.  was dissolved and General Max von Gallwitz reverted to the command of the 2nd Army. The cessation of German attacks at Verdun, ordered by the new supreme command of Chief of the General Staff, Field Marshal Paul von Hindenburg and the  General Erich Ludendorff, when they superseded Falkenhayn and the reinforcement of the Somme front, reduced the German inferiority in guns and aircraft on the Somme during September. Field artillery batteries were able to reduce their barrage frontage from  to . Accuracy was improved by using one air artillery flight per division with aircraft sent from the Verdun front. Colonel Fritz von Loßberg, Chief of Staff of the 2nd Army and then the 1at Army during the period of , was also able to establish  (relief divisions)  behind the battlefield, ready to replace front divisions. German counter-attacks became bigger and more frequent, making the Anglo-French advance slower and more costly. After the Anglo-French attacks in mid-September a \"wholesale relief\" of the front-line divisions had been possible.\nAs the Germans had been pushed out of their original defences, Loßberg had new positions dug based on the principles of depth, dispersal and camouflage, rather than continuous lines of trenches. Rigid defence of the front-line continued but with as few soldiers as possible, relying on the firepower of machine-guns firing from behind the front-line and from the flanks. The German artillery reduced its counter-battery fire and area bombardments before Anglo-French attacks and used the reinforcements from Verdun for destructive fire, observed from balloons and aircraft. The area behind the front-line was defended by support and reserve units dispersed on reverse slopes, in undulations and in any cover that could be found, so that they could open machine-gun fire by surprise, from unseen positions and then counter-attack swiftly, before the Anglo-French infantry could consolidate captured ground. Rather than pack troops into the front-line, the local, corps and army reserves were held back, in lines about  apart, able to make progressively stronger counter-attacks. The largest German counter-attacks of the Somme battle had taken place from  from the Somme north to St Pierre Vaast Wood but these had been \"destroyed\" by French artillery fire.\nTrenches were still dug but were no longer intended to be fought from, being used for shelter during quiet periods, for the movement of reinforcements and supplies, as rallying points and decoys. Before an attack, the garrison tried to move forwards into shell-holes, to avoid Anglo-French artillery-fire and surprise attacking infantry with machine-gun fire. Opposite the French, the Germans dug new defences on a reverse slope between the Tortille stream at Allaines, to the west end of St Pierre Vaast Wood and from there to Morval, connected to a new fourth position dug from Sailly Saillisel to Morval and Bapaume, along the Péronne–Bapaume road. French agents also reported new construction  to the east. Ludendorff had recently created fifteen \"new\" divisions by combing-out troops at depots and by removing regiments from existing divisions, from which the 212th, 213th and 214th divisions were brought in, to replace worn out divisions opposite the French Tenth and Sixth armies.\nBattle\nFrench Sixth Army\n25–26 September\nAt  on 25 September, the Sixth Army attacked with seven divisions. The XXXIII Corps attacked along both sides of the Somme and made very slow progress towards Feuillaucourt; further north VI Corps was stopped south-east of Bouchavesnes and V Corps was stopped short of the village. German artillery on Mont St Quentin swept the southern part of the Sixth Army front and at Inferno Trench, dug on a reverse-slope, strafing by German aircraft and fire from machine-guns hidden in shell-holes, stopped the French advance after . The 10th Division managed a costly advance close to the edge of St Pierre Vaast Wood on 26 and 27 September. The 42nd Division of XXXII Corps captured Rancourt, then occupied Frégicourt shortly after midnight on 26 September, before reaching the west end of St Pierre Vaast Wood, where its advance was stopped by massed machine-gun fire from German positions hidden in the edge of the wood.\nA combined attack by the 2nd Division and the British 56th (1/1st London) Division took Combles, before all of the German garrison escaped, after I Corps had been held up for most of the day by German machine-gun fire south-east of the village. French patrols got into Combles overnight and by dawn on 26 September, the south-east of the town had been occupied and  taken. German troops retreating east were \"routed\" in the direction of Haïe Wood by machine-gun fire. Much German equipment was captured, including  two million rounds of ammunition,  shells and many hand-grenades. I Corps then advanced a short distance east of the Frégicourt–Le Transloy road. A renewal of the attack towards the German defences between Haie Wood and St Pierre Vaast Wood was delayed until Mutton Trench on the left flank was attacked at  by the British. The French attack managed to advance on the flanks but was held up in the centre.\nFourth Army\n25 September\nXIV Corps attacked on the right with the 56th (1/1st London) Division next to the French Sixth Army, in co-operation with the French 2nd Division, with two battalions of the 168th Brigade while the other two on the right flank contained the Germans in Bouleaux Wood and the western defences of Combles. The brigade quickly advanced round the north of the wood, despite resistance in the embankment of the tramlines and then sent patrols towards Combles. Artillery observers reported small groups of German soldiers moving eastwards from the village. By midnight all three brigades had moved forward and at  British and French troops met; by dawn a patrol met French soldiers east of the town, the 56th (1/1st London) Division line being consolidated  east of Combles, with the Germans beyond in Mutton Trench. A further attack was planned with tank support then cancelled when the tanks failed to appear.\nNorth of the 56th (1/1st London) Division, the 95th Brigade of the 5th Division was delayed by enfilade machine-gun fire from the embankment north of the tram line and a strong point on the Ginchy–Morval road until bombed from the north. On the left the 15th Brigade followed the creeping barrage closely down into the valley, over-running and taking prisoner numerous Germans. The 95th Brigade resumed its advance up the far slope and rushed the German trench running south from Morval, as the 15th Brigade overran the trench further north, west of the village, taking many more prisoners. After another halt to reorganise, the village was occupied by the 15th Brigade at . The final objective from the  windmill, south to the 56th (1/1st London) Division area, was consolidated by nightfall. Several weak German counter-attacks were defeated and the 95th Brigade began working its way southward, towards the French at Frégicourt.\nThe 6th Division attacked from north of Morval, to the road through the middle of Lesbœufs, on the left of the 5th Division. The first objective was taken by a battalion of the 16th Brigade on the right and two battalions of the 18th Brigade on the left. The final objective east of the Morval–Lesbœufs road was captured by two battalions leapfrogging through on the right and one on the left, to clear the south end of Lesbœufs, where the Guards Division was met as it occupied the north end. The attack benefitted from good weather, which led to a good preliminary bombardment and an accurate creeping barrage,  being taken. The 5th and 6th divisions consolidated on spurs east and north-east of Morval. At  the adjoining brigades advanced another  east of Morval and also put posts on a line from Morval Mill north to Lesbœufs.\nThe Guards Division attacked with two brigades in line, which advanced in waves  apart. A German counter-barrage began on the Guards Division front, within a minute of the infantry advancing but the leading waves moved fast enough to avoid the bombardment. The foremost battalions of the 1st Guards Brigade found little opposition, apart from uncut wire, which was cut by the officers, while the men provided covering fire and fire from dug-outs along a sunken road on the extreme right flank. The first objective was rushed at  and captured by  The advance to the next objective took ten minutes, against \"slight\" opposition and the advance to the final objective was conducted against little resistance, the right-hand brigade digging-in on the east side of Lesbœufs by\nOn the left flank, the 3rd Guards Brigade reached the first objective on the right but was delayed on the left until  by Germans in a trench which had been missed by the artillery bombardment, before reaching the first objective. The neighbouring brigade of the 21st Division had been held up by uncut wire, so a defensive flank was formed; the rest of the brigade pressed on, arriving at the second objective at  and the final objective at  Touch was gained with the 6th Division north of Lesbœufs; a further advance in the evening was postponed due to the vulnerable northern flank, although the disarray seen among the German defenders further south, led local commanders to call for cavalry to exploit the \"rout\" they believed was occurring south of Gueudecourt, as British artillery inflicted many casualties on retreating parties of Germans.\nTo the north of XIV Corps, the 21st Division attacked on the right flank of XV Corps. Two battalions of the 64th Brigade on the right were held up by uncut wire at Gird Trench (), except for some troops who advanced on the extreme right, in company with the 3rd Guards Brigade. A reserve battalion moved forward to attack the second objective but got no further than the British front trench, due to German artillery fire. The 110th Brigade on the left of the 21st Division took Goat Trench and then machine-gun fire from the right held them up, before the leading battalions reached Gird Trench. Eventually a defensive flank was formed, facing south in part of the Ginchy–Gueudecourt road and a small number of troops got into Gird Trench and gained touch with the 55th (West Lancashire) Division, which had attacked with 165th Brigade and taken Gird Trench early in the afternoon, then gained a foothold in a sunken road between Gird Trench and Gueudecourt at , linking with the 21st Division on the right and the New Zealand Division on the left.\nThe 1st New Zealand Brigade was to form a defensive flank either side of Goose Alley, which ran from Flers Trench to the Gird Trenches, facing north-west towards Eaucourt l'Abbaye. The leading waves kept very close to the creeping barrage, advancing quickly against sparse German artillery fire and unusually feeble resistance from German infantry; a battalion headquarters was captured and a defensive flank was formed along Goose Alley to Gird Trench. Touch was gained with the 1st Division (III Corps) to the north in Flers Support Trench and later the 55th (West Lancashire) Division was met beyond Factory Corner to the south. In III Corps the 1st Division took  of Flers Trench and the attacking brigade of the 50th (Northumbrian) Division, remained in posts beyond no man's land, built the previous night. To the west the 68th Brigade of the 23rd Division attacked 26th Avenue with two tanks attached. One tank crossed the crest and attracted so much German artillery fire that the advance of the brigade was stopped. An attempt to bomb forward from west of Martinpuich Mill also failed.\n26 September\nIn XIV Corps the 56th (1/1st London) Division probed towards Combles, arriving within  by dawn, as other troops advanced into Bouleaux Wood, after seeing rockets fired at  The 167th Brigade linked with the 5th Division south of Morval and met French patrols near the light railway at  Troops moved forward and consolidated a new line about  east of Combles, linking with the French on the right. An attack on Mutton Trench by the 168th Brigade was called off, after five tanks due to operate in support were ditched. XV Corps captured Gird Trench () and Gueudecourt when a fresh battalion of the 21st Division and a tank advanced up Pilgrim's Way at  and bombed down Gird Trench to the Guards Division. Infantry and cavalry patrols entered Gueudecourt and the high ground to the north. German artillery fire revived during the morning, forcing the Guards Division to consolidate as quickly as possible. A cavalry squadron tried to get forward near Gueudecourt but found the front of advance too narrow to manoeuvre.\nInfantry probes beyond Lesbœufs, made little progress against a line of German machine-gun posts, on the higher ground west of Le Transloy. More cavalry advanced from Mametz and dismounted under fire at , to enter Gueudecourt from the south-west. The 110th Brigade (attached from the 37th Division) moved forward slowly and reached the village late in the afternoon. The 64th Brigade (21st Division) continued the advance with two battalions, to just short of the Gueudecourt–Le Transloy road, where a battalion from the 62nd Brigade passed through to the road and linked with the Guards Division at the junction with the Lesbœufs road. The 1st Division and the 50th (Northumbrian) Division of III Corps made a night attack on a new German trench at , the 1st Division was stopped by machine-gun fire and the 50th (Northumbrian) Division captured the west end, then bombed up Crescent Alley to Spence Trench.\n27 September\nXV Corps attacked with the 55th (West Lancashire) Division, which took Gird Trench and Goose Alley with a battalion of the 164th Brigade at  The 1st Infantry Brigade of the New Zealand Division linked with the 55th (West Lancashire) Division in Gird Support Trench on the Ligny road, having taken  then dug in on a reverse slope further forward, when it was found that Gird Support Trench was nearly obliterated. The New Zealand battalion in the centre advanced except on the left, where it was held up by uncut wire and the left battalion lost three companies to machine-gun fire beyond the road from Factory Corner to Eaucourt l'Abbaye. The fourth company established posts up Goose Alley, while the Germans managed to hold on to the junction of the Alley and Gird Trench (). In III Corps the 1st Division captured most of the rest of Flers Switch Trench and was relieved by the 47th (1/2nd London) Division that night. The 50th (Northumbrian) Division patrolled and established posts  from Flers Trench (). The 23rd Division on the northern flank, took part of 26th Avenue near Spence Trench and linked with the Canadians of the Reserve Army on the Albert–Bapaume road.\n28–30 September\nThe 56th (1/1st London) Division was relieved by the 20th (Light) Division and 6th Division as the Morval area was handed over to the French Sixth Army. A XV Corps attack by the New Zealand Division was cancelled, because the un-captured part of Gird Trench was found to overlook the objective at Goose Alley. The junction of both Gird trenches and Goose Alley were found to be in a dip, which had not been seen on aerial photographs or marked on maps. The Germans were on the north and west slopes and the New Zealanders had reached the south and part of the western edges, which gave a commanding view of the German positions, making another attack redundant. The 41st Division relieved the 55th (West Lancashire) Division, III Corps consolidated and the left of the 23rd Division advanced with the Canadians of the Reserve Army; an attempt on Destremont Farm failed against a vigorous German defence, using many machine-guns and bombs. The 6th Division and the Guards Division of XIV Corps, occupied empty German trenches  beyond Lesbœufs.\nAn attempt by a company to close a  gap north of the Lesbœufs–Le Transloy road, was stopped by more massed German machine-gun fire, before the Guards Division was relieved by the reserve brigade of the 56th (1/1st London) Division on the night of 30 September. In the III Corps area, on the northern flank of the Fourth Army, the 23rd Division attacked Destremont Farm at  then linked with the 3rd Canadian Division on the army boundary. The 141st Brigade from the 47th (1/2nd London) Division relieved the 1st Division on the night of  and pressed the Germans back beyond the Flers Switch Line at the second attempt. The New Zealand Division advanced  on the right, also in preparation for the attack on Eaucourt l'Abbaye intended for 1 October. A German army order was found by New Zealand troops in the Gird Trenches (), which gave away the positions of German reserves in the area.\nAir operations\nMonday 25 September, was bright and cloudless, with a ground haze but reports from observers in contact patrol aircraft were notably accurate, as the infantry advanced to their objectives on the Fourth Army front, from Morval to Gueudecourt and around Flers. Observers in reconnaissance aircraft located  artillery batteries;  engaged and  by zone calls. square. The observer used a call sign of the map square letter then the zone letter to signal to the artillery. All guns and howitzers up to  able to bear on the target, opened rapid fire using corrections of aim from the air observer as normal.}} At  observers watched the advance to the final objective and after twenty-one minutes, almost all of it was reported captured. A map compiled from air reports was later shown to be more accurate than infantry progress reports. The ground not taken near Morval fell in the evening, completing the capture of the ground on the main ridge, making Combles untenable, although British balloon observers were able to see that the French advance from the south had been delayed. There was extensive German air activity during the day but most aircraft flew above , which few British aircraft could reach.\nGerman air operations had little effect on the British corps aircraft, which made contact patrols and artillery observation flights.}} Four German aircraft were shot down and others damaged for no loss but the superior speed of the newer German aeroplanes, allowed them to break off at will. Lagnicourt aerodrome was attacked by two British squadrons, causing damage to hangars and parked aircraft and a German headquarters was bombed at Manancourt. On 26 September, at  an aircraft directed a bombardment on Gird Trench () then infantry bombed down the trench southwards; a tank advanced to the trench at  and drove along with the infantry. After  the defenders were forced back to within  of the Guards Division, when the aircraft called for artillery fire until the tank and infantry arrived. The aircraft observer stopped the artillery and the aircraft strafed the Germans in the trench, causing  to surrender, for a British loss of five casualties. The capture of Gird Trench opened the way into Gueudecourt and beyond by evening. Air reconnaissance around midday, established the position of British and French positions around Combles.\nGerman 1st Army\n25 September\nAnglo-French attacks had been expected on 23 September, rather than 25 September and the timing of the attack for the afternoon, also wrong-footed some of the defenders. The 51st Reserve Division and the 52nd Reserve Division of the XXVI Reserve Corps were quickly pushed back, part of the 236th Reserve Regiment being \"destroyed\" at the tram line north of Bouleaux Wood. Parts of the 235th Reserve Regiment west of Combles and the 234th Reserve Regiment in the village, were threatened with encirclement by the British from the north and the French in the south. A battalion of the 239th Reserve Regiment of the 52nd Reserve Division was cut off in Morval and part of the regiment was overwhelmed north of the village near Lesbœufs. The rest of Lesbœufs, held by the 240th Reserve Regiment from the same division fell easily. Parts of the 51st and 52nd Reserve divisions counter-attacked Morval but were only able to advance a short distance and cover the withdrawal of their artillery, eventually forming new a line along the Le Transloy road  east of Morval.\nThe 238th Reserve Regiment, on the right of the 52nd Reserve Division and the I Battalion of the neighbouring 6th Bavarian Regiment, on the left flank of the 6th Bavarian Division in the III Bavarian Corps area, were able to hold much of  (Gird Trench) and Gueudecourt, because some of the defending machine-guns had survived the British bombardment, having been withdrawn from the front-line and hidden in shell-holes. The 6th Bavarian Regiment further north, was pushed back from  into the village and southwards into the I Battalion area. North of Gueudecourt, two German battalions were conducting a relief when the British attack began and a battalion headquarters was captured along with engineer stores, in the confusion. The 50th Reserve Division, defending Eaucourt l'Abbaye and Le Sars, was able to hold the southern end of its part of  (Flers Trench), which had not been captured during the attacks of 15 September, against British attempts to bomb up it to the north-west, although forced back towards  further west near Martinpuich, south of the Bapaume–Albert road.\n26–28 September\nBouchavesnes, Combles and Gueudecourt were lost and rearguards withdrew from Combles to the  (Gird Trench), although some of the 234th and 235th Reserve regiments were cut off, many being killed making for Haie Wood. Troops of the 8th Division, brought from north of the Bapaume–Albert road, to counter-attack from Thilloy towards Gueudecourt, were engaged by sixty British field guns, causing the German infantry to \"flee\" in the direction of Le Transloy. The British aircraft-artillery-tank-infantry attack on  near Gueudecourt, led to many of the survivors of the 238th Reserve Regiment and a battalion of the 6th Bavarian Regiment being captured. The 50th Reserve Division was pushed further back towards Eaucourt l'Abbaye and Le Sars, as the 6th Bavarian Division took over the defence of the area; next day a Bavarian regiment was attacked, while being relieved by part of the 7th Reserve Division near  and managed to hold its ground despite many casualties on both sides.\nAftermath\nAnalysis\nThe battle was a considerable Anglo-French victory and as no tanks were used in the initial Fourth Army attack, a continuous creeping barrage was maintained. The objective of one German trench system, the original third line, which was less well-developed than the German defences on 15 September, was subjected to  greater weight of shellfire. Rainfall from  and the tempo of attacks, made it difficult for the Germans to improve their defences. Cavalry were even able to seize some tactical objectives and infantry kept well up to the creeping bombardment, limiting losses to  in the ten British divisions engaged. French attacks in the south beyond Combles, made little progress against massed German artillery fire and Fayolle concluded that an extensive artillery preparation would be needed, to resume the attack around\nMore German troops and artillery had arrived on the Somme front during September but their use in big counter-attacks south of the Somme from  had disappointing results, failing to regain the ground lost since 12 September, with the French armies proving just as capable of inflicting huge losses on attackers as the Germans. During September, only  of the men needed to replace German casualties could be found and men from the 1917 class, comb-outs from Germany, supply troops and  were sent to front-line units. Limiting divisions to fourteen-day periods in the line required a fresh division each day and the acute shortage of troops led to German divisional reliefs becoming piecemeal again, which reduced efficiency and showed how close to collapse the German armies on the Somme had come. Ludendorff called the fighting of  the biggest engagement of the battle.\nA fourth line of defence was dug from Le Transloy to Ligny-Thilloy, a fifth one closer to Bapaume and work begun on a sixth line further east. Reverse slopes were chosen for the defences, to evade artillery fire directed by ground observers, which made more demands on Anglo-French air observation crews, during a period of rain and poor visibility. More and better German aircraft became available, which were used to challenge Anglo-French air superiority and a substantial amount of the German artillery at Verdun was brought to the Somme front. Despite ammunition shortages and inferior quality ammunition being supplied (caused by substitute materials being used in ammunition manufacture), more destructive fire was used to try to disrupt Allied infantry before they crossed no man's land, rather than continue with wasteful, unobserved area bombardments. The Anglo-French had made important gains of ground and inflicted many casualties on the German armies but their advance in the Morval area had been contained, leading to more mutually costly fighting in the Battle of Le Transloy (1 October – 5 November) in colder and wetter autumnal weather.\nCasualties\nThe 1st Division suffered  from 20 September, the 5th Division  from  and the 6th Division reported  from  October. The 56th (1/1st London) Division had  in September and the 55th (West Lancashire) Division  from  The New Zealand Division suffered  from  October. On 2 October, Haig estimated that there had been  since 25 September in the Fourth and Reserve armies. The German 1st and 2nd armies suffered  in September, the most costly month of the battle. Post war commentary in the German Official History and by Crown Prince Rupprecht, dwelt on the loss of so many of the remaining peace-trained officers, non-commissioned officers and infantry, particularly by an increased willingness to surrender.\nVictoria Cross\n* Private Thomas Alfred Jones, 1st Battalion The Cheshire Regiment.\nNotes\nFootnotes\nReferences\nBooks\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\nTheses\n*\nFurther reading\n*  Translation of Meine Tätigkeit im Weltkriege 1914–1918 (Berlin, Verlag Ernst Siegfried Mittler und Sohn 1939)\nExternal links\n* [https://web.archive.org/web/20121020074200/http://www.cwgc.org/somme/content.asp?menuid=28&id=28&menuname=Morval&menu=main Morval, Commonwealth War Graves Commission]\n* [http://www.cwgc.org/somme/admin/files/Somme%20Map.pdf Campaign Map, Commonwealth War Graves Commission]"
    }
  ]
}