{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Losecoat Field__disambig_1\n\n| result            = Yorkist victory\n| combatant1        = House of York (Royal)\n| combatant2        = House of Lancaster (Rebel)\n| commander1        = Edward IV\n| commander2        = Baron Willoughby\n| strength1         = Unknown\n| strength2         = 30,000\n| casualties1       = Unknown\n| casualties2       = Unknown\n| campaignbox       =\n}}\nThe Battle of Losecoat Field (also known as the Battle of Empingham) was fought on 12 March 1470, during the Wars of the Roses. Spellings of \"Losecoat\" vary, with \"Losecote\" and \"Loose-coat\" also seen.\nThe battle secured the defeat of the poorly organised Welles Uprising against King Edward IV, but ultimately led to the defection of Richard Neville, 16th Earl of Warwick and the king's brother George, Duke of Clarence to the Lancastrian cause after they were forced to flee the country having been implicated in the rebellion.\nBackground\nAlmost a year earlier, in July 1469, an army loyal to the Yorkist king, King Edward IV was defeated at the Battle of Edgcote by Richard Neville, 16th Earl of Warwick, his disaffected former supporter; Edward himself was subsequently captured in Olney, Buckinghamshire. However, with the help and support of his brother Richard, Duke of Gloucester, he had by now regained power. Despite the nominal reconciliation of Warwick and the king, by March 1470 Warwick found himself in a similar position to that which he had been in before the battle of Edgcote. He was unable to exercise any control over, or influence, Edward's policies. Warwick wanted to place another of the king's brothers, George, Duke of Clarence, on the throne so that he could regain his influence. To do so, he called on former supporters of the defeated House of Lancaster.\nThe rebellion was initiated in 1470 by Sir Robert Welles, son of Richard Welles, 7th Baron Welles, a former Lancastrian, when his family fell foul of Edward. Sir Robert turned to Warwick for help. Warwick judged the time was ripe for another coup d'état, to kill Edward or remove him from the throne.\nWelles started gathering troops at his base in Lincolnshire, ready for a show of arms against the king. The unrest in Lincolnshire prompted the king to act, and he started gathering men for his army on 4 March. The news of the king's intention to march to Lincolnshire quickly spread panic among people there. Due to Welles' deliberate misinterpretation, rumours were quickly spread that the king was coming to try the previously pardoned rebels from Edgcote, and that he would \"hang and draw a great number\" of them.\nWith the encouragement of Warwick and Clarence, Welles set himself up as a \"great captain\" of the people of Lincolnshire. On 4 March summons were sent to all the surrounding estates requesting every able man to join him in resisting the king. On the 7th the king heard that the rebels were marching towards Stamford with an army of 100,000 men, having recruited many men from nearby counties, especially from Yorkshire.\nThe king later received letters from Clarence and Warwick stating they were marching North with all their men to support the king. The king then unsuspectingly issued commissions of array which included Warwick's name, authorising him to raise his own army of professional soldiers. Edward then received news that the rebels had changed course for Leicester, as had Warwick and Clarence, which revealed their intentions.\nWelles received a letter from the King telling him to disband his rebel army, or his father Lord Welles (previously taken prisoner by Edward) would be executed. Welles quickly turned back with his army to Stamford. Edward's confidence grew when Welles failed to rendezvous with Warwick and his experienced forces.\nBattle\nEdward's scouts informed him that the rebel army was some  from Stamford, arrayed for battle beside the Great North Road to the north of Tickencote Warren near Empingham in Rutland.\nEdward positioned his men in a battle line to the north of Welles' army, and then, in the space separating the two forces, had Lord Welles executed in sight of both armies.\nThis action set the rebels advancing with cries of á Warwick and á Clarence. A single barrage of cannonballs was fired and then Edward had his men charge towards the enemy. Before the leaders of this attack could even come to blows with the rebel front line the battle was over. The rebels broke and fled rather than face the king's highly trained men.\nBoth captains, Sir Robert Welles and his commander of foot Richard Warren were captured during the rout and were executed a week later on 19 March. Welles confessed his treason, and named Warwick and Clarence as the \"partners and chief provokers\" of the rebellion. Documents were also found proving the complicity of Warwick and Clarence, who were forced to flee the country.\nName\nAccording to popular etymology, the name of the battle is explained in this way; many of Welles' men were wearing jackets displaying Warwick's and Clarence's livery, and when the rout began, not wanting to be caught wearing such identification, many discarded their garments. The battle was thus called \"Lose-coat\". This story does not appear to have any historical basis, being first recorded in the 19th century. Contemporary accounts refer to the battle site as \"Hornfield\" (Horn was an adjacent parish), and do not use the name Losecoat or anything comparable.\nThe name is probably derived from an Old English phrase hlose-cot meaning \"pigsty cottage\". Forms of Losecote also appear as field names in other parishes in Rutland. A field at the site of the battle seems to have acquired that name, which later generated the imaginary \"lose coat\" etymology which was linked to the battle. An adjacent woodland is now called Bloody Oaks and Bloody Oaks Quarry is a 1.3-hectare biological Site of Special Scientific Interest, owned and managed by the Leicestershire and Rutland Wildlife Trust.\nReferences"
    }
  ]
}