{
  "content": [
    {
      "type": "text",
      "text": "# Battle at Chignecto\n\n| result            = British victory\n| combatant2        =  Great Britain British America\n| combatant1        = Mi'kmaq militia Acadian militia\n| commander2        = Charles LawrenceJohn GorhamCaptain John RousSilvanus Cobb Horatio Gates Captain William ClaphamColonel Peregrine LascellesJohn SalusburyHugh WarburtonJoseph GorhamJoshua WinslowJohn Brewse (wounded)  Captain William RicksonFrancis BarteloHenry Grace\n| commander1        = Jean-Louis Le LoutreLouis de La CorneLouis Le Neuf de la Valiere Joseph Broussard (Beausoliel)Chief Étienne BâtardFather Charles Germain\n| strength2         = 700 British regulars and New England Rangers\n| strength1         = 300 Mi'kmaq and Acadian militia\n| casualties2       = 20 killed; 3 killed, 12 missing\n| casualties1       = 7-8 Mi'kmaq\n| campaignbox       =\n}}\nThe Battle at Chignecto happened during Father Le Loutre's War when Charles Lawrence, in command of the  45th Regiment of Foot (Hugh Warburton's regiment) and the 47th Regiment (Peregrine Lascelles' regiment), John Gorham in command of the Rangers and Captain John Rous in command of the navy, fought against the French monarchists at Chignecto. This battle was the first attempt by the British to occupy the head of the Bay of Fundy since the disastrous Battle of Grand Pré three years earlier. They fought against a militia made up of Mi'kmaq and Acadians led by Jean-Louis Le Loutre and Joseph Broussard (Beausoliel). The battle happened at Isthmus of Chignecto, Nova Scotia on 3 September 1750.\nBackground\nDespite the British conquest of Acadia in 1710, Nova Scotia remained primarily occupied by Catholic Acadians and Mi'kmaq. By the time Cornwallis had arrived in Halifax, there was a long history of the Wabanaki Confederacy (which included the Mi'kmaq) launching raids on British colonial settlements along the New England/ Acadia border in Maine (See the Northeast Coast Campaigns 1688, 1703, 1723, 1724, 1745, 1746, 1747).\nTo prevent the establishment of British colonial settlements in the region, Mi'kmaq launched raids on present-day Shelburne (1715) and Canso (1720). A generation later, Father Le Loutre's War began when Edward Cornwallis arrived to establish Halifax with 13 transports on June 21, 1749.\nWithin 18 months of establishing Halifax, the British also took firm control of peninsula Nova Scotia by building fortifications in all the major Acadian communities: present-day Windsor (Fort Edward); Grand Pre (Fort Vieux Logis) and Chignecto (Fort Lawrence). (A British fort already existed at the other major Acadian centre of Annapolis Royal, Nova Scotia. Cobequid remained without a fort.) After the raid in Dartmouth in 1749, on October 2, 1749, Cornwallis created an extirpation proclamation to stop the raids. The Siege of Grand Pre was the first recorded conflict in the region after the raid on Dartmouth.\nBattle\nOn 23 April, Lawrence was unsuccessful in getting a base at Chignecto because Le Loutre led 70 Mi'kmaq and 30 Acadians in burning the village of Beaubassin, preventing Lawrence from using its supplies to establish a fort. (According to the historian Frank Patterson, the Acadians at Cobequid also burned their homes as they retreated from the British to Tatamagouche, Nova Scotia in 1754.) Lawrence retreated, but he returned in September 1750.\nOn September 3, 1750 Captain John Rous, Lawrence and Gorham led over 700 men (including the 40th, 45th and 47th Regiments) to Chignecto, where Mi'kmaq and Acadians opposed their landing.  They had thrown up a breastwork from behind which they opposed the landing. They killed twenty British, who in turn killed several Mi'kmaq. The Mi'kmaq and Acadians killed Captain Francis Bartelo in the Battle at Chignecto.  Le Loutre's militia eventually withdrew to Beausejour, burning the rest of the Acadians' crops and houses as they went.\nAftermath\nOn 15 October (N.S.) a group of Micmacs disguised as French officers called a member of the Nova Scotia Council Edward How to a conference. This trap, organized by Étienne Bâtard, gave him the opportunity to wound How seriously, and How died five or six days later, according to Captain La Vallière (probably Louis Leneuf de La Vallière), the only eye-witness. After the battle, the British built Fort Lawrence at Chignecto and the Mi'kmaq people and Acadians continued with numerous raids on Dartmouth and Halifax.\nGallery\nFile:Battle of Chignecto by Charles Morris (inset of A chart of the sea coasts of the peninsula of Nova Scotia, 1755).png|Battle of Chignecto by Charles Morris (inset of A chart of the sea coasts of the peninsula of Nova Scotia, 1755)\nFile:BeaubassinFortBeausejourBell.jpg|A bell retrieved by Le Loutre Beaubassin church during the battle\nFile:40thRegimentOfFootByDavid Morier.png|Grenadier, 40th Regiment of Foot by David Morier, 1751\nFile:MonumentatBattleatChignecto.jpg|Monument to a village that was burned during the Battle at Chignecto\nFile:LOUIS-FRANCOIS La CORNE.jpg|Louis de la Corne, Chevalier de la Corne, Commander at Beausejour\nFile:HoratioGatesByStuart crop.jpg|Horatio Gates (45th Regiment)\nFile:Lieutenant Joshua Winslow.jpg|Joshua Winslow - portrait while serving at Fort Lawrence (1755)\nFile:45thRegimentOfFootByDavid Morier.png|45th Regiment of Foot By David Morier, 1751\nPeregrine Lascelles, Whitby Museum, North Yorkshire.jpg|Peregrine Lascelles (47th Regiment)\nFile:Winckworth Tonge, Old Burying Ground, Halifax, Nova Scotia.jpg|Winckworth Tonge (45th Regiment)\nReferences\nEndnotes\nPrimary sources\n* [https://archive.org/details/historyoflifesuf00grac/page/10/mode/1up?q=cornwallis The history of the life and sufferings of Henry Grace, of Basingstoke in the county of Southampton. Being a narrative of the hardships he underwent during several years captivity among the savages in North America, ... Written by himself]\n* [https://babel.hathitrust.org/cgi/pt?id=aeu.ark:/13960/t4th9j13f&view=1up&seq=92 Letters concerning the Battle of Chignecto. 1750.]\n* [http://babel.hathitrust.org/cgi/pt?id=mdp.39015011441295;view=1up;seq=315 London Magazine, July 1750, p. 291]\n*[https://babel.hathitrust.org/cgi/pt?id=mdp.39015011441295&view=image&seq=411&q1=nova%20scotia London Magazine, August 1750, p. 371]\n* [https://babel.hathitrust.org/cgi/pt?id=mdp.39015011441295&view=image&seq=571&q1=halifax London Magazine. Nov. 1750, Vol. 19. p. 521]\n* [http://babel.hathitrust.org/cgi/pt?id=mdp.39015011436469;view=1up;seq=397 The London magazine, or, Gentleman's monthly intelligencer ... v.21 1752, p. 359]\n* [https://web.lib.unb.ca/winslow/fullimagerecord.cgi?level=3&id=1065&DOCURL=%2F%77%69%6E%73%6C%6F%77%2F%66%75%6C%6C%72%65%63%6F%72%64%2E%63%67%69%3F%69%64%3D%31%31%39%26%6C%65%76%65%6C%3D%32%26%42%41%43%4B%53%54%52%3D%6C%65%76%65%6C%3D%32%26%66%69%65%6C%64%73%3D%54%69%74%6C%65%2C%43%72%65%61%74%6F%72%5F%6E%61%6D%65%2C%53%75%62%6A%65%63%74%2C%53%6F%75%72%63%65%2C%45%54%43%5F%53%65%71%75%65%6E%63%65%26%43%72%65%61%74%6F%72%5F%6E%61%6D%65%3D%26%54%69%74%6C%65%3D%26%53%75%62%6A%65%63%74%3D%26%53%6F%75%72%63%65%3D%31%2D%26%4B%65%79%77%6F%72%64%3D%26%4C%41%4E%47%3D%26%62%6F%6F%6C%65%61%6E%3D%41%4E%44%26%6F%72%64%65%72%5F%62%79%3D%49%64%65%6E%74%69%66%69%65%72%26%61%6C%6C%3D%26%6C%69%6D%69%74%3D%35%26%62%61%63%6B%75%72%6C%3D The journal of Joshua Winslow, recording his participation in the events of the year 1750 memorable in the history of Nova Scotia]\nLiterature cited\n*\n*\n*\n* Landry, Peter. The Lion & The Lily. Vol. 1. Victoria: Trafford, 2007.\n*\n* Rompkey, Ronald, ed. Expeditions of Honour: The Journal of John Salusbury in Halifax, Nova Scotia, 1749-53. Newark: U of Delaware P, Newark, 1982."
    }
  ]
}