{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Budačka\n\nHabsburg monarchy\n* Kingdom of Croatia\n| combatant2        =  Ottoman Empire\n| commander1        =  Herbard VIII von Auersperg  Volk Engelbert Ivan Voljković\n| commander2        =  Ferhad Pasha Sokolović\n| strength1         = 1,000 men\n| strength2         = 4,000 or 12,000 men7 cannons\n| casualties1       = +250 killedMajority enslaved\n| casualties2       = Unknown\n| campaignbox       =\n}}\nThe Battle of Budačka  was a military engagement between the Ottomans and the Habsburgs in the Croatian borders. The Habsburg force was defeated by the Ottomans, and their commander, Herbard VIII von Auersperg was killed in the battle.\nBattle\nIn August 1575, the Bosnian beglerbeg, Ferhad Pasha, gathered a strong army and marched north toward the Korana River. The Ottomans had a force of 4,000 and 7 cannons or 12,000 men. The governor of Carniola, Herbard VIII von Auersperg, warned of the enemy’s advance and ordered the Croatian nobles and militia to concentrate quickly at Budački. Altogether, there may have been up to 1,000 infantry and cavalry. Meanwhile, Ferhad Pasha learned through spies that Turjaški had encamped at Budački, gathering a larger force.\nHearing gunshots, Herbart, his son, and four Croatian nobles, including Ivan Voljković, went to scout the enemy’s positions. With 60 horsemen, he himself rode toward the guard posts he had set the previous evening to find out why the shot had been fired. On the way he met a small band of unfamiliar Turks, who told him a larger Turkish force was following behind. This was Ferhad Pasha’s vanguard, meant to divert Christian attention from the main army.\nWith his small force, Herbard hurried to meet them, broke the Turkish vanguard, but then encountered the main Ottoman force, which had little difficulty defeating Herbard and his soldiers. Herbart fought bravely and managed to kill 2 Ottoman officers; however, an Ottoman servant managed to behead him and took his head to Ferhad Pasha. Only 4 out of 60 managed to escape alive, while the rest were killed and enslaved. Among the captured were Herbert's son, Volk Engelbert, and Ivan Voljković.\nShortly after Herbart fell under the Ottoman sword, the Christian army finally arrived on the battlefield. But lacking a proper commander, it was completely routed and scattered. About 200 fell in the fight; most of the rest were enslaved. Those who had been scattered returned after the Turks withdrew, buried the dead, and carried Herbart’s body to Podbrežje.\nAftermath\nThe triumphant Ottomans then plundered the lands as far as Carniola, stormed Metlika, and returned to Bosnia. Ferhad Pasha ordered Herbart’s head, wrapped in cloth. The head was displayed in Constantinople. For the return of both heads and of young Wolf Engelbert, the Ottomans demanded a high ransom, which, after long negotiations, they received. Numerous legends and songs, especially in Bosnia, recount that Ferhad Pasha used part of the ransom money to build a magnificent mosque in Banja Luka, which was named after him: the Ferhadija Mosque.\nHerbard’s body was transported to Ljubljana, where he was buried in the then Protestant Church of St. Elizabeth (the Hospital Church).\nReferences\nSources\n*Josip Gruden (1914), History of the Slovene Nation (In Slovanian).[https://www.google.ae/books/edition/Zgodovina_slovenskega_naroda/SGZn1TnfEKcC?hl=ar&gbpv=1&dq=Buda%C4%8Dki+Herbart+1575&pg=PA773&printsec=frontcover]\n*Franz Vaníček (1875), Special History of the Military Frontier, Drawn from Original Sources and Source Works, Vol. I (In German).[https://www.google.ae/books/edition/Specialgeschichte_der_Milit%C3%A4rgrenze/S88Uupg44n8C?hl=ar&gbpv=1&dq=Buda%C4%8Dki+Herbart+1575&pg=PA261&printsec=frontcover]\n*Darja Mihelič & Matjaž Bizjak (2011), Soldiers from the Slovene Lands Abroad in the Past (In Slovanian).[https://www.google.ae/books/edition/Vojaki_iz_slovenskega_prostora_na_tujih/xmvADwAAQBAJ?hl=ar&gbpv=1&dq=Buda%C4%8Dki+1000+1575&pg=PA184&printsec=frontcover]"
    }
  ]
}