{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Pakosław\n\nRussian Empire\n*  Congress Poland\n| result            = Russian victory and withdrawal\n| combatant2        =  German Empire\n| strength1         = Up to 1,000\n| strength2         = Unknown\n| commander1        = Antoni Reutt (WIA)\n| commander2        = Unknown\n| casualties1       = 42 killed, 60 wounded and 11 missing\n| casualties2       = Unknown\n| campaignbox       =\n}}\nThe Battle of Pakoslaw took place in the night of May 19–20, 1915, near the village of Pakoslaw, Congress Poland. It was the first battle of the so-called Pulawy Legion, a Polish military formation of World War I, which was part of the Imperial Russian Army. Soldiers of the Legion clashed with the German Empire armed forces, during Russian retreat of 1915 (see also Great Retreat).\nBackground\nThe Pulawy Legion, formed in January 1915, had by March 1915 some 1,000 soldiers and officers, and was attached to the Moscow Grenadiers. In early May of that year, the Gorlice-Tarnow Offensive of the Central Powers began, and on May 18, the Legion was sent to Krzyzanowice,  north of Ilza, near Russian-German frontline. Since mid-May German Landwehr units had been trying to create a gap in Russian line, but their attacks were repelled.\nThe Battle\nIn the night of May 19–20, 1915, the Pulawy Legion was ordered to march across the swamps near Pakoslaw, towards German positions. Polish soldiers had to abandon their personal belongings, including haversacks and mess kits, so as not to reveal their positions to the enemy. Smoking was also prohibited.\nBefore midnight, Poles found themselves in close vicinity to German trenches and began their attack. Suffering heavy losses, the Poles managed to cross German barbed wire and capture first line of enemy trenches, where hand-to-hand combat ensued. Some Polish platoons lost up to 75% of soldiers, and under the circumstances, they began to retreat. Commandant of the Legion, Antoni Reutt, was himself injured.\nAfter the battle, the Legion was sent to Russian rear for rest and training, after which it became an experienced unit. Meanwhile, Russian-German front in the area of Ilza stagnated for over a month, with soldiers dug in trenches.\nAftermath\nIn mid-June 1915, Russian headquarters decided to use the Legion to protect other units while they regrouped. On June 15, Colonel Jan Rzadkowski was ordered to man Russian trenches between Michalow and Pakoslaw. German officers quickly realized chaotic situation among Russian forces, and began artillery barrage, followed by infantry assault. The exchange of fire lasted for 18 hours, after which Polish-Russian forces counterattacked German right flank.\nIn late June 1915, Germans managed to break through Russian defences and the whole Russian front collapsed. The Pulawy Legion suffered heavy losses, and by September, it had only 100 soldiers. As a result, it was dissolved in mid-October, and the survivors joined the Brigade of Polish Riflemen.\nIn the 1920s, ashes of the soldiers of the Pulawy Legion were collected from the battlefield and buried in a mass grave near the folwark at Pakoslaw. Also, a monument of the Legion was unveiled in Pakoslaw.\nIn Culture\nThe Battle of Pakoslaw is commemorated on the Tomb of the Unknown Soldier, Warsaw, with the inscription \"PAKOSLAW 19–20 V 1915\".\nReferences\nSources\n* Mieczysław Wrzosek, Polski czyn zbrojny podczas pierwszej wojny światowej 1914–1918, Państwowe Wydawnictwo \"Wiedza Powszechna\", Warszawa 1990"
    }
  ]
}