{
  "content": [
    {
      "type": "text",
      "text": "# Battle of the Palm Grove\n\n}} Iraqi security forces\n| combatant2        =  Iraqi Insurgents\n| combatant3        =\n| commander1        =\n| commander2        =\n| commander3        =\n| strength1         = 200 Iraqi soldiers and policeAmerican helicopters and some ground troops\n| strength2         = Between 15 and 25 insurgents\n| strength3         =\n| casualties1       =  33 killed or wounded 2 wounded\n| casualties2       = Unknown\n| casualties3       =\n| notes             =\n}}\nThe Battle of the Palm Grove (10-13 September 2010) took place during the Iraq War when elements of the Second Advise and Assist Brigade (Stryker Brigade Combat Team), 25th ID of the US Army and 512th Military Police Company US Army supported 200 Iraqi Army and Iraqi Police in a search and sweep operation against 15-25 insurgents planting IEDs in Hudaidy, Diyala Province.\nDuring the fighting, Apache attack helicopters and Air Force F-16 fighters were called in. The fighter jets dropped two 500-lb. bombs, but to little effect. After three days of clashes, the insurgent force managed to withdraw without suffering any casualties, while up to 33 members of the Iraqi security forces were killed or wounded and two U.S. soldiers were injured.\nThe battle showed the continuing struggle of the Iraqi security forces with their abilities to take control of the security in the country, without the U.S. military. An Iraqi lieutenant later said \"If it wasn't for the American air support and artillery we would never have dreamed of entering that orchard\". It was also the last major battle of the war involving U.S. forces against insurgent elements.\nExternal links\n*[https://www.nytimes.com/2010/09/13/world/middleeast/13iraq.html NYTimes Post Combat Gunfire]\n*[https://www.nytimes.com/2010/09/14/world/middleeast/14military.html?_r=1&scp=8&sq=diyala&st=cse In Iraq, image of US Support]\n*[https://web.archive.org/web/20100921200505/http://www.mcclatchydc.com/2010/09/17/100778/iraqi-forces-struggling-as-us.html?story_link=email_msg Iraqi forces struggling, forcing U.S. troops to fight]\n*[http://atwar.blogs.nytimes.com/2010/09/17/special-ops/?scp=10&sq=diyala&st=cse NYTimes Blog Special ops in iraq]\n*[https://www.npr.org/templates/story/story.php?storyId=130323848 NPR Battle of Palm Grove raises doubts on Iraqi Army]"
    }
  ]
}