{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Panasówka__disambig_1\n\nPolish insurgents Hungarian volunteers\n| combatant2  =  Russian Empire\n| commander1  =  Marcin Borelowski Kajetan Karol Cieszkowski Edward Nyáry\n| commander2  =  Nikolai Sternberg\n| strength1   = 1,200\n| strength2   = 3,000\n| casualties1 = 35 dead and 100 wounded\n| casualties2 = 360 dead and wounded\n}}\nThe Battle of Panasówka, which took place on September 3, 1863, near the village of Panasówka (currently Biłgoraj County, Lublin Voivodeship), was one of the largest battles of the January Uprising. A unit of Polish insurgents of some 1,200 defeated here a Russian army detachment. The Poles were supported by some 40 Hungarian volunteers under Count Edward Nyáry, who himself was wounded and died.\nPolish insurgents were divided into two units. One was commanded by Colonel Marcin “Lelewel” Borelowski and consisted of some 700–800 irregulars. The second unit was led by Kajetan “Ćwiek” Cieszkowski and had some 400 irregulars. Facing them was a Russian unit under a Major named Sternberg, which had up to 3,000 soldiers, including dragoons, Cossacks and four cannons.\nBorelowski placed his soldiers on the Polak hill, and this location is now marked with a commemorative monument with tablets in Polish and Hungarian languages. After an artillery barrage, Russian infantry attacked Polish positions, but the Russians were stopped by Polish cavalry, and their attack collapsed. Sometime later, the Poles counterattacked, breaking through Russian lines, and destroying the cannons. One of the Polish infantry units was commanded by a Hungarian aristocrat, Major Edward Nyáry, who was hit by bullets in the leg, and then in the stomach. Heavily wounded, Nyáry died the next day in a military hospital.\nAfter the battle, Polish units split again into two groups. Borelowski and his men marched towards the village of Batorz, while Cieszkowski headed northwest.\nA mass grave of those who were killed in the battle is located near Panasówka, along the road to Zwierzyniec. Count Nyáry has a separate tomb. Poles lost some 35 dead, while Russian losses amounted to 300.\nReferences\nSources\n* Jan Buraczyński, Roztocze. Dzieje osadnictwa, Lublin 2008, s. 346–347, ."
    }
  ]
}