{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Bisober\n\nENDF\n| combatant2        =  Tigrayan Defense Force\n| strength1         = Unknown\n| strength2         = ~250\n| casualties1       = At least one truck destroyed\n| casualties2       = Unknown\n| casualties3       = 35 civilians killed in both villages9 civilians injured\n}}\nIn the Battle of Bisober, which occurred from November 14 to 17, 2020, at least 35 civilians were killed in clashes between the Tigray Defense Forces (TDF) and the Ethiopian National Defense Force (ENDF) in Bisober and Ullaga Kebele, Tigray, Ethiopia.\nBackground\nOn November 4, 2020, clashes broke out between Tigrayan rebels and Ethiopian government forces after long-standing simmering tensions between the two sides. In the early days of the war following the Ethiopian government offensive in the region, many cities were shelled and civilians were caught in the crossfire.\nBefore the war, Bisober was a small rural village of about 2,000 people, located in southern Tigray. It is located next to Ullaga Kebele, which has around 1,000. Between May and June 2020, Tigray Special Forces militants seized control of the town's elementary school, which was empty due to the COVID-19 pandemic. The rebels used the pretense of preventing the spread of COVID from migrants from Djibouti as the rationale for taking the school. At the time of the massacre, the village was controlled by around 250 TDF rebels.\nBattle\nBy the time Ethiopian troops entered Bisober on November 14, Tigrayan rebels had dug trenches in and around the elementary school and had heavy weapons placed throughout the town. Survivors of the battle said that TPLF militants in civilian clothing were engaging in clashes with Ethiopian troops from residential homes. Civilians fled the town, but were forced back into it by Ethiopian soldiers. Along the roads leading out of Bisober, injured civilians who couldn't flee lined the streets. Many civilians, including those of the neighboring towns of Buta, Meferta, and Yalo, were forced to leave their property behind.\nDuring the battle for the city, 31 civilians were killed. 27 of those were residents of Bisober, of which three were women. Nine men were also injured. Four civilians died in Ullaga Kebele. Survivors of the battle said that many of the victims died in the crossfire between the two sides, although some survivors recounted that Ethiopian soldiers rounded up fleeing civilians and shot the men of the group. Before shooting, the Ethiopian soldiers accused the men of aiding the TPLF. One victim, Tesfaye Abera, was found beheaded.\nIn the town, 104 houses were completely or partially destroyed during the battle. The health center in Ullaga also suffered damage. Some residents also had their farms looted. Ethiopian troops lost at least one truck during the battle.\nAftermath\nResidents were unable to return to Bisober and surrounding towns until November 19, when the Ethiopian military cleared the area. Several bodies were discovered after the battle, and some bodies were so decomposed they had to be buried in residents' backyards. The civilian administration in Bisober was replaced following November 14, and mayor Getachew Nega said that the TPLF's presence explained why Bisober had so much carnage. Reports of the massacres of civilians in Bisober were denied by the Ethiopian government.\nReferences"
    }
  ]
}