{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Seicheprey\n\n| combatant2 =\n| commander1  =  ?\n| commander2  =  Clarence Ransom Edwards\n* John Henry Parker\n}}\n| units1  =   Stormtrooper Battalion Tolle\n*   Stormtrooper Battalion Hellmuth\n*   Stormtrooper Battalion Seeböhm\n}}\n| units2  =  26th Infantry Division\n**  102nd Infantry Regiment\n}}\n| campaignbox =\n| casualties1      =  about 150 killedabout 450 wounded and captured\n| casualties2      =  81 killed424 wounded130 captured\n}}\nThe Battle of Seicheprey was a military engagement fought from 20 to 21 April 1918 as a part of the German spring offensive in north-eastern France during the First World War. Three German battalions of Sturmtruppen units commenced an attack on Allied positions in the village of Seicheprey, defended by American troops of the 26th Infantry Division, and after fierce fighting captured the village. Later that day Americans started a counterattack and the Germans withdrew. The clash is commemorated as the first significant war action of American expeditionary troops in Europe.\nPrelude\nAfter the United States entered the war in April 1917, US Army started to prepare the expeditionary forces to support military efforts of the Allies on the Western front. Few thousands of those troops, including American 26th Infantry Division (also known as \"Yankee Division\") formed in July 1917, arrived to France in fall 1917. 26th Infantry Division took an additional military training at the Neufchateau, Vosges during the fall and winter of 1917\nThey were then deployed in March 1918 to the Chemin des Dames area where the men had their first experience with defensive and offensive operations and also with poison gas. In April 1918 they were deployed in the Toul ahd Saint-Mihiel Sector, among the other American forces. Location around the village of Seicheprey was defended by the 102nd Infantry Regiment, composed mostly from the men from Connecticut and New England.\nDuring the ongoing German spring offensive an attack in Seicheprey area was planned. German command, informed about the presence of American units in the area, demanded to get more information about their streight, equipment or positions, so the three Sturmtruppen battalions, specially trained for surprise attacks and taking prisoners, named Tolle, Hellmuth and Seeböhm were deployed to complete this task.\nBattle\nOn 20 April at 4 a.m., German field artillery commenced a bombardment of the 102nd Infantry's positions near Seicheprey before German Sturmtruppen units of about 3,000 men moved against the village. The artillery box barrage, continuing 36 hours, isolated American units. The Germans, attacking from the north-western, north and north-eastern direction, overwhelmed a machine gun company and two infantry companies of the 102nd and temporarily breached the trenches and forced Americans to leave their posts in the early morning. Between 400 and 500 American soldiers were wounded or killed.\n26th Division then regrouped and started a counterattack, led by 102nd Regiment, during the night from 20 to 21 April. The Germans withdrew before the division could counterattack, as the main goal of the attack wasn't to gain land.\nAmerican loses included 81 killed, 424 wounded, and 130 captured, including about 6 officers. Germans lost over 600 men, including 150 killed of their own. On the American side Sergeant Stubby, dog serving as a mascot of the unit, was also wounded. Most of the fallen Americans were buried at the St. Mihiel American Cemetery, German fallen were buried at Bouillonville German Military Cemetery.\nAftermath\nHaving a minor strategical importance, the engagement caught the attention of both German and American media, claiming victory on both sides. Colonel John Henry Parker, one of the commanders of the 102nd Infantry Regiment, received for his actions by Seicheprey Distinguished Service Cross with three bronze oak leaves.\nSimilar raids later struck the American 101st Infantry at Flirey on 27 May, and the 103rd Infantry at Xivray-et-Marvoisin on 16 June, but were repulsed.\nMemory\nA stained glass depiction of the action of 20 April 1918 was made in the Hamden Memorial Town Hall in Hamden, Connecticut.\nSee also\n* German spring offensive\n* 26th Infantry Division (United States)\nCitations\nBibliography\n*\n*\nExternal links\n* [https://ctstatelibrary.org/Seicheprey Remembering Seicheprey and the Boys from Connecticut's 102nd Infantry - Connecticut State Library (video conference)]\n* [https://www.youtube.com/watch?v=ntl4W59Mm0U April 20, 1918: The Battle of Seicheprey - This Day In History - Connecticut National Guard (video)]"
    }
  ]
}