{
  "content": [
    {
      "type": "text",
      "text": "# Battle of the Muthul__disambig_1\n\n* Roman retreat\n|combatant1=Numidia\n|combatant2=Roman Republic\n|commander1=JugurthaBomilcar\n|commander2=Quintus Caecilius MetellusGaius MariusPublius Rutilius Rufus\n|strength1=20,000 men (light infantry, cavalry), 84 war elephants\n|strength2=35,000 infantry\n|casualties1=Low\n|casualties2=High\n|}}\nThe Battle of the Muthul was fought at the Muthul River in Numidia in 109 BC. The Numidians, led by their king Jugurtha, fought a Roman army commanded by the consul Quintus Caecilius Metellus Numidicus. The battle was fought during the Jugurthine War, a war between King Jugurtha of Numidia and the Roman Republic. The battle was indecisive - it took the Romans four more years to defeat Jugurtha. Jugurtha was eventually captured by Lucius Cornelius Sulla in 105 and executed during Marius' Triumphal parade a year later (104). The Roman historian Publius Rutilius Rufus distinguished himself during the battle, while Gaius Marius' military genius shone through for the first time, saving the day for the Romans.\nThe Muthul River ran through Adherbal's old kingdom in eastern Numidia. It has been identified as the Wäd Mellag,Tissot Géographie comparée 1. pp.&nbsp;67–68.   and in this case Metellus would have started his campaign in south-east Numidia, with the aim of strengthening his communication links. Other views (Mannert and Forbiger) identify the Muthul with the river Ubus, with Metellus starting his campaign in western Numidia, and later returning to Zama.\nBattle\nThe objective of Metellus' army was to reach the interior of Numidia. His army had to descend from the mountains and cross a desert plain eighteen miles wide to reach the Muthul River where he could refill his water reserves. Jugurtha had deployed part of his infantry and all of his war elephants along the river, under Bomilcar, while all of his cavalry and the best part of his infantry was hidden in a short and bushy ridge along the path the Roman army had to follow.\nDescending from the mountain pass, Metellus noticed the ambush, but his army needed to refill its water reserves, and thus had to cross the desert without cavalry coverage and within sight of the enemy. So he detached a small force under the command of Publius Rutilius Rufus to set up a camp beside the river. The main part of the Roman army moved diagonally towards the Numidian force on the ridge to dislodge them.\nJugurtha ordered his infantry to cut off the retreat of the Romans by occupying the mountain pass while the Numidian cavalry charged against the Romans, scattering them into small detachments. The Romans were kept in small groups, unable to perform any coordinated movement. Each group was fighting for its own survival, and the Numidian cavalry had control of the battlefield. Bomilcar engaged the troops of Rufus, thus preventing him from aiding Metellus' troops.\nAt this point Gaius Marius, an officer who had risen from the ranks, re-organized a few detachments, and led a column of 2,000 soldiers through the Numidians to free his commander Metellus. Marius then led the Roman column up the hill against the Numidian infantry, which retreated, leaving the Romans with control of the hill. From this position, Marius led his men against the rear of the Numidian cavalry, uniting the separated Roman detachments into a single army.\nAt the same time, Rufus had held the Numidian force on the river, and succeeded in killing or routing the Numidian elephants. In the evening, the two armies met and rejoined.\nDespite the retreat of the Numidians, the retreat was well-timed by the quick-thinking Jugurtha. As a result, Jugurtha's forces suffered light casualties compared with the battered Romans. Therefore, the result was somewhat indecisive.\nThe Romans primarily survived the battle thanks to the luck of the Roman scouts prior to the battle, and the inspirational leadership of Marius against the odds.\nAftermath\nJugurtha disbanded most of his troops and skilfully and successfully reverted to guerilla warfare. Hearing of the Battle of the Muthul and Metellus' subsequent manoeuvres against Numidian cities, Romans back home applauded Metellus' performance:\nMetellus and Marius drove two columns against the Numidian cities, but Metellus' defeat at Zama forced the Romans to return to Carthage.\nMarius returned to Rome, where he was elected consul with the support of the people and over the objections of the Senate. Since the Senate did not give him an army, he called for volunteers. He allowed citizen classes that were usually not used for military service, the capite censi (Romans without property), into the army. Marius thus reformed the Roman army, and went on to defeat and capture Jugurtha (106 BC).\nThe Senate disliked Marius (because he was a novus homo (\"new man\") and not part of the elite) and gave the title of Numidicus to Metellus, and recognized Marius' lieutenant Lucius Cornelius Sulla as the conqueror of Numidia. However, Marius retained the support of the people of Rome, and became consul six more times in the following years.\nNotes\nReferences\n* Sallust, Jugurthine War, 48&ndash;55.\n* Theodor Mommsen, History of Rome, book 4 \"The Revolution\"."
    }
  ]
}