{
  "content": [
    {
      "type": "text",
      "text": "# Battle of La Flèche\n\n| result      = Vendéan victory\n| combatant1  =  French Republic\n| combatant2  = Catholic and Royal Army Chouans\n| commander1  = Louis Chabot\n| commander2  = Henri de La RochejaqueleinPiron de La Varenne\n| strength1   = 1,500–2,000 men\n| strength2   = 15,000–20,000 men\n| casualties1 =\n| casualties2 =\n| campaignbox =\n}}\nThe Battle of La Flèche (8–11 December 1793) was a military engagement during the War in the Vendée, a significant episode of the French Revolution. It took place in La Flèche, Sarthe, France.\nBackground\nFollowing the failure of the Virée de Galerne at Granville, the Vendéan army sought to cross the Loire River to return to the Vendée. Repelled at the Siege of Angers, the disorganized Vendéans, pursued by 5,000 republican troops under François-Joseph Westermann, retreated toward La Flèche to regroup and resupply. The town was held by 1,500 republican soldiers led by Louis François Jean Chabot, and the bridge over the Loir River had been destroyed, leaving the Vendéans vulnerable to attack from Westermann’s forces.|Report by Blavette to the Château-du-Loir administration}}\nThe Battle\nHenri de La Rochejaquelein dispatched Piron de La Varenne with a detachment to delay Westermann’s republican cavalry. Leading 400 cavalry and 400 infantry mounted behind them, La Rochejaquelein scouted the Loir River, located a ford, and attacked Chabot’s forces from the rear. Caught off guard, Chabot’s troops fled. After repairing the bridge, La Rochejaquelein reinforced Piron, forcing the republicans to retreat. This victory secured the Vendéans two days to rest and regroup.\nOn 10 December, the Vendéans departed for Le Mans, leaving their sick at the hospital, where they were massacred by republican soldiers. Westermann’s vanguard captured La Flèche, killing stragglers. He reported 700 Vendéans “killed and massacred,” including 100 in the town and 600 in surrounding villages.\n|François-Joseph Westermann}}\nOn 11 December, General Jean-Baptiste Kléber entered La Flèche, finding 300 sick or wounded “brigands,” all of whom died from lack of care, according to him. However, H. Le Prestre de Châteaugiron claimed they were “all massacred that day and thrown into the street, where I saw them.”|Jean-Baptiste Kléber}}\nCasualties\nAmong the fallen was Vendéan leader Mathieu de Verteuil, killed when both legs were torn off by a cannonball.\nSee also\n* Virée de Galerne\n* Siege of Angers\n* Battle of Le Mans (1793)\n* Catholic and Royal Army\n* French Revolution\n* Chouannerie\nReferences\nBibliography\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*"
    }
  ]
}