{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Clausen\n\n| combatant2  =\n| commander1  = François de Franquetot de Coigny\n| commander2  = Friedrich Heinrich von Seckendorff\n| strength1   =\n| strength2   =\n| casualties1 = 200 killed or wounded\n| casualties2 = 140 killed or wounded\n| campaignbox =\n}}\nThe Battle of Clausen (or Klausen) was fought on 20 October 1735 near the town of Klausen (usually spelled in histories with 'C' instead of 'K'), which was then in the Electorate of Trier and part of the Holy Roman Empire, and is now in the German state of Rhineland-Palatinate.  French forces under the command of Marshal François de Franquetot de Coigny were defeated in an attempt to dislodge imperial troops under the command of Friedrich Heinrich von Seckendorff.  The battle was one of the last significant engagements between the combatants in the War of the Polish Succession.\nBackground\nThe 1734 campaign season in the Rhine valley theater of the War of the Polish Succession closed with France controlling the west bank of the Rhine River as far north as Mainz, and the forces of the Habsburgs in strong defensive positions on the east bank.  In November 1734 the belligerents had begun diplomatic overtures at peace, mediated by the neutral British and Dutch to bring an end to the conflict.  Despite these talks, hostilities resumed in 1735, principally in northern Italy, where Spain, allied to France, harboured further territorial ambitions.  In the Rhine valley, French troops under the command of Marshal Coigny moved from winter quarters to more aggressive stances along the Rhine during the spring and summer, but were unwilling to test the Habsburg defences, which were under the overall command of the ageing Prince Eugene of Savoy.\nThe Germans were reinforced in August 1735 by more than 10,000 Russian troops led by Peter Lascy, the first time Russian troops reached the Rhine.  Eugene was summoned to Vienna in September to participate in peace talks, leaving command of the German troops with the Duke of Württemberg.  Reichsgraf Friedrich Heinrich von Seckendorff, in command of the German right at Mainz, received permission from Württemberg to move against the French left in an attempt to push them back toward Trier and gain territory between the Meuse (Maas) and Moselle rivers.\nPrelude\nOn 20 September Seckendorff's chosen forces began crossing the Rhine, moving toward the Moselle.  He commanded a total of 41 battalions with an effective strength of about 35,000 men.  On the same day, Marshal Belle-Isle, commanding the French left, coincidentally left Kaiserslautern with a sizable detachment that was to be stationed at Trier to forage for provisions.  Arriving there on the 27th, Belle-Isle left it under the command of the Comte de Béthune.  Upon his return to French headquarters at Bad Dürkheim on the 29th, he learned of Seckendorff's movement.  He ordered 12 battalions from the reserve stationed there toward Trier, with an additional nine to follow from the main army at Oggersheim.  On 6 October the reserves reached Trier, with the nine arriving the next day.  These raised the French force at Trier to 29 battalions of infantry with 66 cavalry squadrons, although the force was hampered somewhat by a shortage of provisions.  Belle-Isle immediately began moving troops forward, adopting a defensive line along the Ruwer south of the Moselle.  He also sent a detachment under the Marquis de Mouchy northeast toward Lieser on reconnaissance, and on the 10th sent another 1,000 men under Lutteaux to reinforce Mouchy.\nMarshal Coigny]]\nSeckendorff reached Stromberg on the 5th, and was marching for Simmern the next day when an advance company of Hungarian cavalry encountered a detachment of French dragoons near Kirchberg.  The Germans sent more troops forward, and after a brief skirmish, captured most of the French force.  By the 8th the Germans had occupied Trarbach, which they intended as the site of a supply depot.  While waiting for supplies, Seckendorff investigated the French position at Liesern, interpreting it as French intent to dispute potential crossings of the Moselle at that point.  He ordered troops on his left to advance further west, reaching as far as Gräfendhron and threatening to cut off Mouchy's supply and communications, while the main body advanced toward Monzelfeld, southeast of Liesern.  Seckendorff then took a detachment on 15 October to determine if Klausen (west of Trarbach on the north side of the Moselle) was occupied by the French.  Finding it unoccupied, he left a company of 40 hussars at the abbey.  The next day a French detachment (25 companies of infantry and 800 cavalry) assaulted the abbey and chose to retreat when German reinforcements from Wittlich arrived.  Seckendorff then ordered Baron Stein's entire brigade, including 300 recently arrived Illyrian troops, to Klausen.  Delays in the forwarding of provisions from supply depots on the Rhine then forced Seckendorff to halt his advance.  However, his advance was sufficient to prompt Mouchy's retreat from Liesern, and Seckendorff was then able to establish a pontoon bridge there.\nOn 11 October Marshal Coigny decided that he should come to Belle-Isle's support.  Leaving his headquarters on the Rhine, he began moving larger parts of his army toward Kaiserslautern and Trier.  Advance units of this movement began reaching Trier on the 17th, and Belle-Isle decided to move forward.  On 19 October he crossed the Moselle just below Trier and camped on the north bank of the Moselle.  Seckendorff, whose army had begun crossing at Liesern on the 18th, was informed of this movement.  Although he had planned to establish a camp at Osann, this news prompted him to change his plans.  Late on 19 October, he issued orders that the infantry of Georg of Hessen, and his left wing's cavalry, should cross the Moselle at 4:00 am and march to Klausen.  These troops, crossing at Liesern and Bernkastel, were expected to arrive in Klausen around noon.\nBattle\nMarshal Coigny ordered his troops out early on 20 October.  The troops marched north to Hetzerath, where they turned east and marched through a narrow defile to reach the Salm between Esch and Rivenich, just west of Klausen.  Their approach was observed by Seckendorff, who had also risen early and rode west on reconnaissance.  As the French forces came out of the defile and into the river valley, Coigny directed his left, 36 companies of grenadiers under Phelippes upstream toward Esch.  It was followed by Belle-Isle's troops, 33 infantry battalions and 68 cavalry squadrons, then 17 infantry battalions and 40 cavalry squadrons from Coigny's Rhine army, which bore off to the right to take the heights above Rivenich.\nReichsgraf Friedrich Heinrich von Seckendorff\nSeckendorff had ordered some of his Hungarian cavalry to engage the French vanguard when he first spotted them.  This they did around 11:00 am, but were driven back.  As it became clear that the bulk of the French army was coming, he sent 10 companies of grenadiers to hold the bridge at Rivenich, also sending 20 cavalry squadrons from the right to support the left.  As these movements were taking place, the supporting infantry began to arrive on the heights above Klausen.\nAround 2:00 pm the French columns arrived on the heights above Esch and Rivenich.  Coigny ordered Brigadier Rieux, commanding the right, to secure the bridge at Rivenich, and ordered Phelippes, on his left, to secure Esch.  The outnumbered imperial forces holding the bridge at Rivenich gave way, and the French gained control of the bridge but did not immediately begin crossing in force.  Seckendorff ordered 5 companies of grenadiers to reinforce those already on his left.  The French troops moving toward Esch were slowed by difficult terrain.  Seckendorff deployed two cannon to the south of Esch, further complicating the French advance on that front.  With most of his forces arrived by 4:00 pm, Seckendorff decided to retake the bridge at Rivenich, while the two army centers engaged in an artillery battle across the Salm.\nFor the taking of the crossing, Seckendorff sent 6 more grenadier companies, 3 battalions of Danish infantry, 1 Pomeranian battalion, and some Hungarian cavalry down toward Rivenich.  Coigny, observing that his right would be outnumbered by this force, withdrew his troops from the bridge and abandoned Rivenich.  Seckendorff seized the momentum, and sent his force across the river to attack Coigny's flank, while also sending several companies of cavalry across the river near Esch to attack the French left.  The French infantry fired volleys of musket fire against the oncoming cavalry and then began to fall back toward the center.  It soon became dark, and the combatants disengaged.\nAftermath\nThe imperial infantry suffered 22 killed and 76 wounded, while its cavalry lost 23 men and 40 horses killed, with 17 each wounded, as well as 3 men and 7 horses missing.  The French lost 200 men killed or wounded.\nMarshal Coigny, after inspecting Seckendorff's position, decided that it was too strong to assault, and retreated the next day to Hetzerath.  Seckendorff sent Baron Diemar with the Hungarian and German cavalry to harry the French rear.  French discipline, however, was tight, and the imperials garnered only a few supply wagons and horses.  Coigny was prompted to retreat further by reports of a movement against his left flank near Föhren; this was only an imperial supply caravan bringing provisions to Seckendorff from Luxembourg.  A significant shortage of provisions forced Coigny to divide his troops on either side of the Moselle, a risky move with his enemy close by.  Seckendorff's manoeuvres did not capitalise on this, but Coigny had, except for a few pockets, completely withdrawn from the north side of the Moselle by 28 October.  On 31 October Coigny learned that a cease-fire had been negotiated as part of the ongoing peace talks; this news was delivered to Seckendorff on 12 November.\nSources\n* Marco Brösch, Tom Müller: Der Krieg an der Mittelmosel und im Hunsrück – 280 Jahre „Schlacht bei Klausen“. Katalog zur Wanderausstellung Hrsg.: Projektgruppe „Schlacht bei Klausen“, Klausen 2015.\n* Karl Zimmermann: Der Krieg an der Mittelmosel und im Hunsrück in den Jahren 1734/35 und die Schlacht bei Klausen. Heinrich Oberhoffer, Bernkastel-Cues 1933.\nReferences\n* [https://books.google.com/books?id=--sGAAAAYAAJ&dq=Seckendorf+Clausen+1735&pg=PA153 Feldzüge des Prinzen Eugen von Savoyen] (Field campaigns of Prince Eugene of Savoy)\n*[https://books.google.com/books?id=aAYoAAAAYAAJ&dq=Klausen+Seckendorff&pg=PA658 New International Encyclopedia, Volume 20]\n* [https://books.google.com/books?id=3pRBAAAAYAAJ&dq=Klausen+Coigny&pg=PA870 Geschichte des Entstehens: des Wachsthums und der Grösse der österreichischen Monarchie, Volume 5]"
    }
  ]
}