{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Bear Valley__disambig_1\n\n| combatant2  =  Yaqui\n| combatant3  =\n| commander1  =  Frederick H.L. Ryder\n| commander2  = unknown\n| commander3  =\n| units1      =\n| units2      =\n| units3      =\n| strength1   = ~30 light cavalry\n| strength2   = ~30 warriors\n| strength3   =\n| casualties1 = none\n| casualties2 = 1 killed9 captured\n| casualties3 =\n| notes       =\n| campaignbox =\n}}\nThe Battle of Bear Valley was a small engagement fought in 1918 between a band of Yaquis and a detachment of United States Army soldiers. On January 9, 1918, elements of the American 10th Cavalry Regiment of Buffalo Soldiers detected about thirty armed Yaquis in Bear Valley, west of  Nogales, Arizona, a large area that was commonly used as a passage across the international border with Mexico. A short firefight ensued, which resulted in the death of the Yaqui commander and the capture of nine others. Though the conflict was merely a skirmish, it was the last time the United States Army and Native Americans engaged in combat and thus has been seen as the final official battle of the American Indian Wars.\nBackground\nBy 1918 the Yaqui people had been at war with Mexico for several years, the former hoping to establish an independent state in Sonora, centered on the Río Yaqui and its confluence with the Gulf of California. Many Yaquis were driven north by the war and some crossed the Arizona border to work in Tucson's citrus groves. After receiving payment, the Yaquis would spend their money on weapons and ammunition and then return to Mexico to continue fighting. The fact that Yaquis were buying arms in Arizona and smuggling them across the border became so well known that the military governor of Sonora, General Plutarco Elías Calles, informally requested help from the United States government in dealing with the problem. Furthermore, Arizona ranchers began reporting in larger numbers their encounters with armed Yaquis on their ranch land or the finding of butchered livestock on the range. Since the United States Border Patrol did not yet exist, the task of protecting the border was that of the army, which operated out of Fort Huachuca. The Nogales, Arizona subdistrict commander, Colonel J.C. Friers, 35th Infantry, responded to the reports by issuing orders to increase patrolling in the area. American forces in the area included the 35th Infantry Regiment, stationed at Camp Stephen D. Little in Nogales, and the 10th Cavalry Buffalo Soldiers, who were spread out to protect the various towns near the international border. A squadron size force from the 10th Cavalry was encamped about a half mile from the 35th Infantry at Nogales and a second squadron split up to occupy Lochiel and Campini. Smaller posts were also established at Arivaca and Oro Blanco and, finally, a troop of about thirty men maintained a camp at Atascosa Canyon, a \"strategic natural crossing\" within Bear Valley.\nAccording to Colonel Harold B. Wharfield, who interviewed some of the participants in the Bear Valley fight and published his story in the book Tenth Cavalry and Border Fights, wrote that the camp was located in a dangerous  \"uninhabited region\" where \"unconfirmed mysterious disappearances\" often occurred and people were advised to travel in groups. The camp was built next to an old homestead and a high ridge to the east, which provided an excellent view of the surrounding flatlands. After the January 1918 New Year's Day celebration, Captain Frederick H.L. \"Blondy\" Ryder and his Troop E, 10th Cavalry, were ordered to occupy the Bear Valley camp for border patrol duty. A signalman was posted on top of the ridge who could communicate via hand signals with one of the sentries placed around the camp's perimeter. The rest of the soldiers patrolled the trails leading in and out of the valley, watching for people wandering through the desert.\nBattle\nOn January 8, a local cattleman and owner of the Ruby Mercantile, Philip C. Clarke, rode into camp and told Captain Ryder that his neighbor found the body of a cow in the mountains to the north and that a piece of its hide had been removed for making sandals. It was assumed that Yaquis killed the cow so Ryder strengthened the observation post on top of the ridge by sending up First Lieutenant William Scott and a detail of men equipped with field glasses to watch the trails from a distance.  According to Colonel Wharfield's book; \"About the middle of the afternoon Lieutenant Scott signaled attention. Upon acknowledgement from the camp sentry, he gave the message enemy in sight, and pointed toward a low ridge west of camp a quarter of a mile or more distant. The sentry hollered to First Sgt. Samuel H. Alexander, who was sitting under nearby mesquite with several other noncommissioned officers. The shout brought everyone to their feet. On the skyline of the ridge could be seen a long column of Indians [Yaquis] crossing to the other side. The horses had been under saddle with loose cinches all day tied up in the corral; so within a few minutes the troop was mounted.\" By the time the soldiers left camp the Yaquis were no longer in sight but Lieutenant Scott kept pointing so the troop kept moving due south, towards the border fence. When the Americans were finally in position, they dismounted in a \"shallow brushy draw,\" left a guard to watch the horses, and then continued advancing on foot in a skirmish line. Moving forward, the soldiers were nearing the top of a canyon side when Captain Ryder decided to return to the horses, using a different path. On the way down, the soldiers came across \"hastily abandoned packs\" which suggested that the Yaquis were very close and knew they were being pursued. Ryder then continued up the canyon, in a southeastern direction, when suddenly the Yaquis opened fire from concealed positions.\nThe Americans returned fire and a typical Indian war skirmish began. Wharfield wrote that \"the fighting developed into an old kind of Indian engagement with both sides using all the natural cover of boulders and brush to full advantage. The Yaquis kept falling back, dodging from boulder to boulder and firing rapidly. They offered only a fleeting target, seemingly just a disappearing shadow. The officer saw one of them running for another cover, then stumble and thereby expose himself. A corporal alongside the captain had a good chance for an open shot. At the report of the Springfield, a flash of fire enveloped the Indians body for an instant, but he kept on to the rock.\"\nCaptain Ryder wrote Colonel Wharfield the following for his book:\nThe Cavalry line maintained its forward movement, checked at times by the hostile fire, but constantly keeping contact with the Indians. Within thirty minutes or so the return shooting lessened. Then the troop concentrated heavy fire on a confined area containing a small group, which had developed into a rear guard for the others. The fire effect soon stopped most of the enemy action. Suddenly a Yaqui stood up waving his arms in surrender. Captain Ryder immediately blew long blasts on his whistle for the order to cease fire, and after some scattered shooting the fight was over. Then upon command the troopers moved forward cautiously and surrounded them. This was a bunch of ten Yaquis, who had slowed the Cavalry advance to enable most of their band to escape. It was a courageous stand by a brave group of Indians; and the Cavalrymen treated them with the respect due to fighting men. Especially astonishing was the discovery that one of the Yaquis was an eleven-year-old boy. The youngster had fought bravely alongside his elders, firing a rifle that was almost as long as he was tall. ...Though time has perhaps dimmed some details, the fact that this was my first experience under fire—and it was a hot one even though they were poor marksmen—most of the action was indelibly imprinted on my mind. After the Yaquis were captured we lined them up with their hands above their heads and searched them. One kept his hands around his middle. Fearing that he might have a knife to use on some trooper, I grabbed his hands and yanked them up. His stomach practically fell out. This was the man who had been hit by my corporals shot. He was wearing two belts of ammunition around his waist and more over each shoulder. The bullet had hit one of the cartridges in his belt, causing it to be exploded, making the flash of fire I saw. Then the bullet entered one side and came out the other, laying his stomach open. He was the chief of the group. We patched him up with first aid kits, mounted him on a horse, and took him to camp. He was a tough Indian, made hardly a groan and hung onto the saddle. If there were more hit we could not find them. Indians do not leave any wounded behind if they can possibly carry them along. One of my men spoke a mixture of Spanish, and secured the information from a prisoner that about twenty others got away. I immediately sent Lieutenant Scott, who had joined the fight, to take a strong detail and search the country for a few miles. However they did not find anything of the remainder of the band. It was dark when we returned to camp. I sent some soldiers to try and get an automobile or any transportation at the mining camps [Arivaca, Ruby, Oro Blanco] for the wounded Yaqui, but none could be located until morning. He was sent to the Army hospital at Nogales and died that day. We collected all the packs and arms of the Indians. There were a dozen or more rifles, some .30-30 Winchester carbines and German Mausers, lots of ammunition, powder and lead, and bullet molds. The next day when you [Colonel Wharfield] and Capt. Pink Armstrong with Troop H came in from the squadron camp to relieve us, we pulled out for Nogales. The Yaquis were mounted on some extra animals, and not being horse-Indians were a sorry sight when we arrived in town. Some were actually stuck to the saddles from bloody chafing and raw blisters they had stoically endured during the trip. Those Yaquis were just as good fighting men as any Apache....\nAftermath\nAbout a week after the engagement, Captain Ryder was ordered to proceed to Arivaca, where the Yaqui prisoners would be held until the army figured out what to do with them. According to Wharfield, the Yaquis proved to be reliable workers and adjusted well to life in the army. Even though they were prisoners, each one received three meals a day, a straw mattress for a bed and a G.I. blanket. Wharfield wrote that the Yaquis:\nKept the campsite immaculately clean. At the corral nearly any droppings were allowed to hit the ground. During the day the Indians would stand around watching the horses. Whenever a tail was lifted, out they rushed with their scoop shovels and caught it before the manure could contaminate the ground. It certainly helped in the decline of the fly population.\nIt was sometime during the stay at Arivaca when one of the Yaquis revealed that they had only opened fire because they thought the Buffalo Soldiers coming at them were Mexicans. All ten of the Yaquis, including the boy, volunteered to enlist in the Army but the government had other plans and the prisoners were later sent to Tucson for trial in federal court. Charged with \"wrongfully, unlawfully, and feloniously exporting to Mexico certain arms and ammunition, to wit: 300 rifle cartridges and about 9 rifles without first procuring an export license issued by the War Trade Board of the United States,\" the Yaquis pleaded guilty and were sentenced by Judge William Henry Sawtelle to a mere thirty days in jail, excluding the boy whose charges were dismissed. Colonel Wharfield wrote that \"the sentence was preferable to the Yaquis who otherwise would be deported to Mexico and face possible execution as rebels.\"\nSee also\n* Yaqui Wars\n* Bear Valley raid\n* United States involvement in the Mexican Revolution\nReferences"
    }
  ]
}