{
  "content": [
    {
      "type": "text",
      "text": "# Battlefish\n\n| image              = Battlefish logo.png\n| image_alt          =\n| caption            =\n| creator            =\n| country            = United States\n| language           = English\n| num_seasons        = 1\n| num_episodes       = 8\n| network            = Netflix\n| channel            =\n| released           =\n| executive_producer =\n| company            = Pilgrim Media Group\n| runtime            = 38–46 minutes\n| cinematography     = Kendall Whelpton\n}}\nBattlefish is an American reality television show that follows the pursuits of several fishing boats as they search the Pacific Ocean for albacore tuna. The eight-episode first season debuted on Netflix on the 21st of September, 2018. The show is produced by Pilgrim Media Group.\nThe series documents five fishing crews along the coasts of Washington and Oregon during the 2017 fishing season.\nEpisodes\n|ShortSummary=The albacore tuna fishing season kicks off with high hopes for some hefty hauls. Greenhorn Andre of the Judy S struggles.\n|LineColor=000\n}}\n|ShortSummary=Everyone wonders how the solar eclipse will affect conditions. The Intrepid makes its first foray of the season. Andre's attitude becomes a problem.\n|LineColor=000\n}}\n|ShortSummary=Malissa joins the Judy S as a deckhand to prove that she can \"do the job better than a guy can.\" Oppor-Tuna-Ty’s Aaron mourns the loss of his daughter.\n|LineColor=000\n}}\n|ShortSummary=There's only a month and a half left in the season. The Intrepid crew discovers a hole in the boat and the TNT deals with a broken freezer.\n|LineColor=000\n}}\n|ShortSummary=To add to an already difficult season, the Intrepid’s engine dies. Captain of the Ashley Nicole Justin returns home for the birth of his second son.\n|LineColor=000\n}}\n|ShortSummary=Captain Jake is unsure about the Intrepid's new deckhand. Meanwhile on the Judy S, Malissa sustains a painful injury but it doesn’t slow her down.\n|LineColor=000\n}}\n|ShortSummary=With red skies in the morning, sailors take warning. A storm is on the horizon but the fleet still has to take advantage of what remains of the season.\n|LineColor=000\n}}\n|ShortSummary=Hopes for one last big haul remain. The Oppor-Tuna-Ty’s Aaron speaks for everyone when he says this was his most challenging season yet.\n|LineColor=000\n}}\n}}\nReferences\nExternal links\n*\n*"
    }
  ]
}