{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Olustee__disambig_1\n\n| place             = Baker County, Florida\n| coordinates       =\n| map_type          =\n| map_relief        =\n| latitude          =\n| longitude         =\n| map_size          =\n| map_marksize      =\n| map_caption       =\n| map_label         =\n| territory         =\n| result            = Confederate victory\n| status            =\n| combatants_header =\n| combatant1        =  United States\n| combatant2        =  Confederate States\n| commander1        = Truman Seymour\n| commander2        = Joseph Finegan\n| units1            = District of Florida\n| units2            = District of East Florida\n| strength1         = 5,500\n| strength2         = 5,000\n| casualties1       = 1,861(203 killed&nbsp;1,152 wounded&nbsp;506 captured/missing)\n| casualties2       = 949(93 killed&nbsp;848 wounded&nbsp;8 captured/missing)\n| notes             =\n| campaignbox       =\n}}\nThe Battle of Olustee or Battle of Ocean Pond, was fought in Baker County, Florida, on February 20, 1864, during the American Civil War. It was the largest battle fought in Florida during the war.\nUnion General Truman Seymour had landed troops at Jacksonville and aimed chiefly to disrupt the Confederate food supply. Meeting little resistance, he proceeded towards the state capital, Tallahassee, against orders since he assumed that he would face only the small Florida militia. Confederates in Charleston sent reinforcements under General Alfred H. Colquitt, and the two armies collided near Ocean Pond in Olustee.\nThe Union forces were repulsed and retreated to Jacksonville. Some were garrisoned there to occupy territory. Other troops were transferred to other more active areas, where they were needed.\nBackground\nUnion General Truman Seymour's headquarters in [[Jacksonville, Florida]]\nFrom the start of the war, Florida primarily served as a supplier of essential provisions, particularly beef and salt, for the Confederacy. The importance of the supplies escalated significantly after the fall of Vicksburg, which severed the eastern part of the Confederacy from beef and supplies originating west of the Mississippi River. Additionally, Florida became a refuge for an increasing number of Confederate deserters and pro-Union Floridians, which seemingly made it a more vulnerable target for raids and assaults by Union forces.\nOn January 13, 1864, President Abraham Lincoln wrote to Major General Quincy A. Gillmore, the commander of the Union's Department of the South at Hilton Head, South Carolina, and asked Gillmore to take steps to \"reconstruct a loyal State government in Florida.\" By the following month, Gillmore had ordered an expedition into Florida to secure Union enclaves, sever Confederate supply routes, and recruit black soldiers. Brigadier General Truman Seymour, in command of the expedition, landed troops at Jacksonville in an area that had been seized by the Union in March 1862. Seymour's forces made several raids into northeastern and north-central Florida. During the raids, he met little resistance, seized several Confederate camps, captured small bands of troops and artillery pieces, and liberated slaves. However, Seymour was under orders from Gillmore not to advance deep into the state.\nSeymour's preparations at Hilton Head had concerned the Confederate command in the key port city of Charleston, South Carolina. General P. G. T. Beauregard, correctly guessed Seymour's objective was Florida and believed that the Union actions posed enough of a threat for him to detach reinforcements under Georgian Alfred H. Colquitt to bolster Florida's defenses and to stop Seymour. Colquitt arrived in time to reinforce Florida troops, under the command of Brigadier General Joseph Finegan. As Colquitt's troops began arriving, Seymour, without Gillmore's knowledge, began a new drive across northern Florida with the capture of Florida's capital, Tallahassee, as a possible objective.\nOpposing forces\nUnion\nFile:TSeymour.jpg|Brig. Gen.Truman Seymour, USA\nFile:JasMontgomery.jpg|Col.James Montgomery, USA\nFile:Guy V. Henry.jpg|Col.Guy Vernor Henry, USA\nFile:Samuel Sherer Elder.jpg|Capt.Samuel Sherer Elder, USA\nConfederate\nFile:FineganJoseph63.jpg|Brig. Gen.Joseph Finegan, CSA\nFile:ColquittCivilWar.jpg|Brig. Gen.Alfred H. Colquitt, CSA\nFile:GPHJR.jpg|Col.George Paul Harrison, Jr., CSA\nFile:JWPJAX.jpg|Capt.John William Pearson, CSA\nBattle\nFollowing the Florida, Atlantic and Gulf Central Railroad, Seymour led his 5,500 men in the direction of Lake City. At approximately 2:30 p.m. on February 20, the Union force approached General Finegan's 5,000 Confederates entrenched near Olustee Station. Finegan sent out an infantry brigade to meet Seymour's advance units and lure them into the Confederate entrenchments, but the plan went awry. The opposing forces met at Ocean Pond, and the battle began. Seymour made the mistake of assuming he was once again facing Florida militia units, which he had routed with ease, and committed his troops piecemeal into the battle. Both Finegan and Seymour reinforced their engaged units during the afternoon, and the battle took place in open pine woods. The Union forces attacked but were savagely repulsed by withering barrages of rifle and cannon fire. At about 4:00 p.m., the lieutenant colonel of the 5th Calvary Battalion, Benjamin B. Sample, led a spoiling assault on the Union lines, causing a great number of casualties on both sides. Sample, who was present at some of the bloodiest battles of the western theater, including both the Battle of Stones River and Battle of Chickamauga, was known for his personal courage and tactical brilliance, had attempted split the federal line like he had witnessed at Chickamauga  The assault was unsuccessful in breaking the Union line but managed to demoralize the already-weary Union soldiers.\nThe battle raged throughout the afternoon until, as Finegan committed the last of his reserves, the Union line broke and began to retreat. Finegan did not exploit the retreat and allowed most of the fleeing Union forces to reach Jacksonville. It is claimed in letters and memoirs from Confederate officers the reason that the Confederate troops could not exploit the retreat was because they were killing the surviving wounded and captured black troops. It was at this stage that Lieutenant Colonel Benjamin Sample, a pre-war southern abolitionist, seeing the slaughter of the black troops, broke out in tears and begged those around him to cease the killing, crying out, \"Good Lord, stay your hand! they're men, damn you, they're men!\" The Confederates made a final attempt to engage the rear element of Seymour's forces just before nightfall but were repulsed by elements of the 54th Massachusetts Volunteer Infantry Regiment and the 35th United States Colored Troops, both composed of Black soldiers.\nAftermath\n]]\nUnion casualties were 203 killed, 1,152 wounded, and 506 missing, a total of 1,861 men, about 34 percent. Confederate losses were lower: 93 killed, 848 wounded, and 8 missing, a total of 949 casualties in all but still about 19 percent. Union forces also lost six artillery pieces and 39 horses that were captured. The ratio of Union casualties to the number of troops involved made it the second-bloodiest battle of the War for the Union, with 265 casualties per 1,000 troops. Soldiers on both sides were veterans of the great battles in the eastern and the western theaters of the war, but many of them remarked in letters and diaries that they had never undergone such terrible fighting. The Confederate dead were buried at Oaklawn Cemetery in nearby Lake City.\nThe Union losses caused Northern authorities to question the necessity of further Union involvement in the militarily-insignificant state of Florida.\nOn the morning of February 22, as the Union forces were still retreating to Jacksonville, the 54th Massachusetts was ordered to countermarch back to Ten-Mile Station. The locomotive of a train carrying wounded Union soldiers had broken down, and the wounded were in danger of capture. When the 54th Massachusetts arrived, the men attached ropes to the engine and cars and manually pulled the train approximately three miles to Camp Finegan, where horses were secured to help pull the train. The train was then pulled by both men and horses to Jacksonville for a total distance of 10 miles (16&nbsp;km). It took 42 hours to pull the train that distance.\nIn the South, the battle was seen as a spirit-raising rout. One Georgia newspaper referred to Union forces as walking \"forty miles over the most barren land of the South, frightening the salamanders and the gophers, and getting a terrible thrashing.\" The Confederate Congress even passed a resolution that officially thanked the rebel soldiers.\nToday, the battlefield is commemorated by the Olustee Battlefield Historic State Park, part of the Florida State Park system. The park is located within the Osceola National Forest on U.S. Route 90. The battlefield is partially protected as state park and part of the national forest. Part of it is privately held land on the south side of U.S. Route 90. However as of 2022 there is still no monument to the Union dead of this battle.\nOn Presidents' Day weekend each February (see Citations), an annual historical reenactment is conducted on the site of the battle. Thousands of reenactors from across the United States and even from overseas have participated over the years.\nThe reenactment of the Battle of Olustee is co-sponsored by four organizations: the Olustee Battlefield Historic State Park Citizens Support Organization; the Florida Department of Environmental Protection – Recreation and Parks; the USDA Forest Service – Osceola National Forest; and The Blue-Grey Army, Inc.\nBattle lithograph\nThe lithograph at the top of the page was printed by the firm of Kurz and Allison in 1894. It depicts soldiers of the 8th U.S. Colored Troops advancing against Confederate entrenchments. While frequently used in the media about the Battle of Olustee, the image is inaccurate and reveals the artist's ignorance about the events. During the battle, Confederates operated well in advance of their prepared positions. Neither side fought from behind fortifications, as the fighting took place in a pine forest (see map: the top of the map is approximately due west), and there were few large cleared area. The dotted red line on the map indicates the location of the Confederate trenches.\nSee also\n*Florida in the American Civil War\n*Battle of Cedar Creek\n*Lake City-Columbia County Historical Museum\nReferences\nFurther reading\n*\n*\n*Nulty, William H. (1990). Confederate Florida: The Road to Olustee. University of Alabama Press. .\n*Schmidt, Lewis G. (1989). The Civil War in Florida: A Military History, Vol. II: The Battle of Olustee. Allentown, PA.\nExternal links\n*[http://battleofolustee.org/ Battle of Olustee] award-winning Web site\n*[http://battleofolustee.org/cso.htm Olustee Battlefield Historic State Park Citizens Support Organization]\n*[https://web.archive.org/web/20170310042509/http://www.civilwar.org/battlefields/olustee.html Olustee Battlefield Page: Battle maps, photos, history articles, and battlefield news (CWPT)]\n*[http://www.generalatomic.com/PerrysSaints/chapter13.html Perry's Saints at the Battle of Olustee]\n*[http://www.olusteefestival.com/ Olustee Battle Festival]\n*[http://www.nationalregisterofhistoricplaces.com/FL/Baker/state.html Baker County listings] at [http://www.nationalregisterofhistoricplaces.com National Register of Historic Places]\n*[https://web.archive.org/web/20070310164158/http://www.flheritage.com/facts/reports/places/Counties/Baker.cfm Baker County listings] at [http://www.flheritage.com Florida's Office of Cultural and Historical Programs]\n* [http://www.facebook.com/pages/Olustee-Battlefield-Historic-Site/179913208718449?ref=ts&fref=ts Facebook fan site for Battle of Olustee reenactment]"
    }
  ]
}