{
  "content": [
    {
      "type": "text",
      "text": "# Battle Magic\n\n| label      = Cacophonous\n| producer   = Mags\n| prev_title = Starfire Burning Upon the Ice-Veiled Throne of Ultima Thule\n| prev_year  = 1996\n| next_title = The Power Cosmic\n| next_year  = 1999\n}}\nBattle Magic is the third album by Bal-Sagoth, released in 1998 on Cacophonous Records, and is their last recording for that company before they signed to Nuclear Blast.\nThe cover artwork for the first release of the album features the fantasy character \"Caylen-Tor\", created by Bal-Sagoth vocalist/lyricist Byron Roberts. The character was originally introduced in the lyrics of the band's previous album Starfire Burning Upon the Ice-Veiled Throne of Ultima Thule and would later appear in \"The Chronicles of Caylen-Tor\" series of novels written by Roberts and published by American Sword and sorcery publishing house DMR Books.\nThe song \"When Rides the Scion of the Storms\" marks the debut of Byron Roberts' character Captain Caleb Blackthorne, a privateer of the Elizabethan era, who would later appear in a trilogy of short stories written by Roberts and published by DMR Books in the \"Swords of Steel\" anthology series and subsequent omnibus edition.\nThe song \"Thwarted by the Dark (Blade of the Vampyre Hunter) marks the debut of Byron Roberts' character Joachim Blokk, a 19th century adventurer who would later appear in a short story written by Roberts published in the Sword and sorcery anthology paperback \"Devil's Armory\", released by Barbwire Butterfly Books.\nThe band were awarded one full month to record, much of which was spent on the orchestral arrangements. The keyboards in \"Blood Slakes the Sand at the Circus Maximus\" alone took six full days to complete. The opening of \"Blood Slakes the Sand at the Circus Maximus\" is identical to the score for the film Spartacus, composed by Alex North.\nOn 16 September 2016, Battle Magic was reissued on CD by Cacophonous Records, featuring remastered audio, an expanded lyric booklet and new cover artwork.\nTrack listing\nAll songs composed by Byron Roberts and Jonny and Chris Maudling.\nPersonnel\n* Byron Roberts&nbsp;– vocals\n* Chris Maudling&nbsp;– guitars, bass\n* Jonny Maudling&nbsp;– drums, keyboards\nAdditional personnel\n* Mags&nbsp;– producer, engineering\n* Jeroen van Valkenburg&nbsp;– artwork (inner inlay)\n* J.C. Dhien&nbsp;– photography\n* Simon Lee&nbsp;– artwork (first release)\n* Martin Hanford&nbsp;– artwork (rerelease)\nReferences"
    }
  ]
}