{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Two Rivers__disambig_1\n\nThe Battle of Two Rivers was fought between the Picts and Northumbrians in the year 671. The exact battle site is unknown. It marked the end of the Pictish rebellion early in the reign of Ecgfrith, with a decisive victory for the Northumbrians. Attestation of the battle is limited to the account in Stephen of Ripon's Vita Sancti Wilfrithi.\nBackground\nDuring the 7th century, the Northumbrians gradually extended their territory to the north. The Annals of Tigernach record a siege of \"Etain\" in 638, which has been interpreted as Northumbria's conquest of Eidyn (Edinburgh) during the reign of Oswald, marking the annexation of Gododdin territories to the south of the River Forth.\nTo the north of the Forth, the Pictish nations consisted at this time of the Kingdom of Fortriu to the north of the Mounth, and a \"Southern Pictish Zone\" to the south, stretching as far as the Forth. Evidence from the 8th-century Anglo-Saxon historian Bede points to the Picts also being subjugated by the Northumbrians during Oswald's reign, and that this subjugation continued into the reign of his successor, Oswiu.\nEcgfrith succeeded Oswiu as king of Northumbria in 670. Ecgfrith's kingdom was said to have been 'weak' on his ascent to the throne. In 671, word reached Ecgfrith that the Picts, under the command of the Verturian king Drest mac Donuel, were preparing to rebel and overthrow the Northumbrian hegemony.\nAccount of the battle\n{| class=\"toccolours\" style=\"float: left; margin-left: 1em; margin-right: 2em; font-size: 85%; background:#dddddd9; color:black; width:40em; max-width: 40%;\" cellspacing=\"5\"\n| style=\"text-align: left;\" |\"He [Ecgfrith] slew an enormous number of the people, filling two rivers with corpses, so that, marvellous to relate, the slayers, passing over the rivers dry foot, pursued and slew a crowd of fugitives[.]\"\n|-\n| style=\"text-align: left;\" | — Stephen of Ripon's account of the battle from Vita Sancti Wilfrithi.\n|}\n}}\nThe record and description of the battle is limited entirely to Stephen of Ripon's account in his Vita Sancti Wilfrithi. According to this account, Ecgfrith became aware of the Picts plans to overthrow the Northumbrian suzerainty and he hastily assembled an invasion force of horsemen. He headed north, aided by his sub-king Beornhæth, who historian James Fraser suggests may have ruled the southern Pictish kingdom of Niuduera, identified as being located in present-day Fife.\nThe battle location is not recorded. A tentative suggestion of Moncreiffe Island, near Perth has been made. However, it is unclear what (if any) impact the subsequent revision of Fortriu's location to northern Scotland has on this suggestion.\nIn the account given in Vita Sancti Wilfrithi, Ecgfrith's cavalry was ambushed by a concealed and much larger Pictish army. Nevertheless, the Northumbrians prevailed, with Pictish casualties being of sufficient number to 'fill two rivers', allowing the Northumbrian cavalry to pursue Pictish survivors without getting their feet wet.\nAs a work of hagiography, Vita Sancti Wilfrithi is not an ideal historical source and it has been suggested that its partisan treatment of Northumbrian history inspired Bede's Historia Ecclesiastica. Various details of Stephen's account of the battle are likely to have been exaggerated, overstating the extent of Ecgfrith's victory.\nAftermath\nStephen records that, following the battle, the Picts were reduced to slavery and subject to the yoke of captivity for the next 14 years. The Irish annals of Ulster and Tigernach record of a 'Drost' being expelled from kingship in 671. It is generally presumed that this was the Pictish king, Drest, and that he was deposed and replaced by Bridei mac Bili as a direct result of the failure of the Pictish rebellion.\nBridei was later to defeat and kill Ecgfrith in the Battle of Dun Nechtain in 685.\nNotes\nReferences\n*\n| title = The Annals of Ulster\n| url = http://www.ucc.ie/celt/online/T100001A/\n| access-date = May 8, 2011\n| publisher = CELT: Corpus of Electronic Texts}}\n*\n| title = The Annals of Tigernach\n| url = http://www.ucc.ie/celt/online/G100002/\n| access-date = May 8, 2011\n| publisher = CELT: Corpus of Electronic Texts\n| isbn = 0-947992-98-7}}\n*\n*\n*\n*\n*\n*\n*"
    }
  ]
}