{
  "content": [
    {
      "type": "text",
      "text": "# Battle of South Shanxi__disambig_1\n\n| place             = Southern part of Shanxi province in the Republic of China\n| result            = Japanese victory\n| combatant1        =  National Revolutionary Army, China\n| combatant2        =  Japanese North China Area Army, Imperial Japanese Army, Japan\n| commander1        =  Wei Lihuang\n| commander2        =  Hayao Tada\n| strength1         = 180,000 troops in 8 armies\n| strength2         = 100,000 troops in 6 divisions, 3 brigades\n| casualties1       = According to commander-in-chief Wei Lihuang's report on 5th September 1941 : 25,066 killed or wounded and 21,611 missingAccording to the history of the Anti-Japanese War (based on reports from each unit in June and July) : 75,600 killed, wounded, or missingJapanese claim : 42,000 killed and 35,000 capturedAccording to Japanese interrogations of Chinese POWs : 12,672 prisoners\n| casualties2       = Chinese claim : 39,600 casualtiesJapanese claim : 673 killed and 2,292 wounded\n| notes             =\n}}\nThe Battle of South Shanxi , also known as the Battle of Jinnan () and Zhongtiao Mountains campaign () by the Chinese and as the Chungyuan Operation by the Japanese, was one of the 22 major engagements between the National Revolutionary Army and the Imperial Japanese Army during the Second Sino-Japanese War (1937&ndash;1945).\nContext\nThe disastrous losses of the first year of the war (1937-38) meant that the internationally-recognized Chinese government (controlled by the Kuomintang or KMT party) had been forced to abandon its capital and all the industrialized areas of the country. It fought on from a new base in the west, mainly the province of Sichuan and Guanzhong.\nThe Zhongtiao Mountains held symbolic importance as the largest area of territory north of the Yellow River still under full Chinese control.\nThey also had some strategic importance as defensive ground on the north bank of the Yellow River. Beyond the south bank lay the railway line connecting the KMT's western base with the Zhongyuan central plain, the 'breadbasket of China'.\nThe area of the battle was very roughly in the shape of a triangle, with the Yellow River as the base to the south. On the northwest side were Japanese armies that had advanced down the railway line from the north as far as its Yellow River terminus at Fenglingdu. Likewise, the frontline to the northeast side was the territory captured by the Beiping–Hankou Railway Operation.\nSince the loss of Fenglingdu in the spring of 1938, Chinese and Japanese forces had fought for the Zhongtiao Mountain thirteen times. In April 1940, the North China Front Army launched a massive offensive in South Shanxi to expand its occupied territories and succeeded in capturing Gaoping, Jincheng, Yangcheng, and other counties and cities. In early 1941, the Japanese army in North China made plans to eliminate the Kuomintang presence in the Zhongtiao Mountains. In March of the same year, they launched attacks against the NRA 27th corps in Lingchuan and the NRA 15th corps south of  Yicheng and east of Jiang County for a more favorable position before the Zhongtiao Mountains operation at a cost of 924 casualties.\nIn mid-April 1941, the Chinese army detected the Japanese army amassing a large force of 200,000 troops in 4 divisions and 3 independent brigades for an offensive at Zhongtiao Mountain. The Southern Shanxi army thus deployed its troops accordingly for guerilla warfare while planning a counterattack with the support from parts of the Second, Fifth, and Eighth Military Fronts. However, due to lack of coordination between the military fronts, the Fifth and Eighth Military Fronts did not support the First Military Front in a timely manner.\nAt the onset of the battle, KMT-CPC relations were at a low point following the still recent New Fourth Army incident in early 1941. As a result, the nearby 8th Route Army refused to assist the surrounded Nationalists. South Shanxi was later remembered in China as one of the worst defeats of the entire war.\nCampaign\nThe campaign is extensively discussed in the travel book Two Kinds of Time by the US journalist Graham Peck, based on eyewitness interviews with refugees. Peck reports that the NRA had built a line of fortifications overlooking the major roads through the mountains, which had withstood several earlier Japanese assaults. It was garrisoned by second-line warlord troops. He claims that the Chinese commanders had become complacement and were caught out when the Japanese adopted new, guerrilla-style tactics. They used peasant paths to infiltrate into the mountains and encircled the mountain range by moving along north bank of the Yellow River. Once they realized they were surrounded, the Chinese forces disintegrated before better-quality troops could be brought across the river.\nAftermath\nIn May and June, the Southern Shanxi army broke out from Zhongtiao Mountain through different routes. Most of the units moved their main force to Henan or Shaanxi for rest. The 27th corps, which had been ordered to support the troops besieged in Zhongtiao Mountain, returned to Lingchuan to continue its guerilla activities. The 43rd corps and 98th corps moved to the Taiyue Mountain. The 98th corps ended up cooperating with the friendly Eighth Route Army despite tensions between the Kuomintang and Communist authorities.\nThe battle of Zhongtiao Mountain resulted in tens of thousands of casualties for the Chinese army. Moreover, a large number of Chinese generals were killed or captured in the operation.\nGenerals killed in action :\n* Lieutenant General Tang Huaiyuan (唐淮源) : commander of the 3rd corps, posthumously promoted to full general.\n* Lieutenant General Cun Xingqi (寸性奇) : commander of the 12th division of the 3rd corps.\n* Major General Jin Shuzhi (金述之) : chief of ordnance of the 3rd corps.\n* Major General Wang Jun (王竣) : commander of the new 27th division of the 80th corps, posthumously promoted to lieutenant general.\n* Major General Chen Wenqi (陈文杞) : chief of staff of the new 27th division of the 80th corps.\n* Major General Liang Xixian (梁希贤) : deputy commander of the new 27th division of the 80th corps.\n* Major General Liu Kexin (刘克信) : chief of staff of the Hebei People’s Army.\n* Major General Wan Jinsheng (万金声) : senior staff officer of the 15th corps.\n* Major General Zhang Shihui (张世惠) : chief of the general staff of the 14th army group, captured and shot during the battle with more than 10 other officers for refusing to cooperate.\n* Major General Jin Chongyin (金崇印) : chief of staff of the 17th corps, captured during the battle and shot on 16 July 1941 for refusing to cooperate.\nGenerals captured during the battle :\n* Lieutenant General Gong Bingfan (公秉藩) : commander of the 34th division of the 5th army group.\n* Major General Liu Mingxia (刘明夏) : commander of the 94th division of the 14th corps.\n* Major General Zhao Kuige (赵奎阁) : deputy commander of the new 2nd division of the 17th corps.\n* Major General Tan Youfu (谭友佛) : chief of staff of the 3rd corps.\n* Major General Bi Meixuan (毕梅轩) : commander of the 6th guerilla column of the First Military Front.\n* Major General Liu Yinxuan (刘荫轩) : commander of the 1st guerilla detachment of Hebei Province.\n* Major General Li Jiesan (李杰三) : senior staff officer of the First Military Front’s headquarters.\nOn 31 July 1941, the General Staff of the North China Front Army launched an investigation on the 12,672 POWs captured in the battle of Southern Shanxi and recorded the interrogations of senior officers. This investigation allowed the Japanese army to better understand the internal problems and combat effectiveness of the National Revolutionary Army at the time.\nThe two corps in Taiyue Mountain would continue fighting behind the lines for a few months. On September 5, the Japanese army attacked the 70th division of the 43rd corps in Jiang County. By the 6th, the Japanese army had surrounded the division’s headquarters. Divisional commander Shi Zuoheng (石作衡) personally led more than 200 soldiers of the 209th regiment to break out when they encountered enemy reinforcements. Shi Zuoheng was killed by an artillery shell during the hand-to-hand fighting In the same month, the Japanese army launched a massive sweep against the 98th corps and Eighth Route Army in Taiyue which lasted for a month. The Eighth Route Army was able to avoid encirclement and suffered 374 killed, wounded, or missing during the operation. The 98th corps was surrounded by two Japanese divisions on September 29 and was annihilated. Corps commander Wu Shimin (武士敏) was badly wounded and captured while leading his men to break-out. On October 1, the corps commander died of his wounds.\nBy the end of the Qinhe mopping-up campaign, corps commander Wu Shimin, divisional chief of staff Wang Ruqin (王儒钦), and more than 1,180 officers and soldiers had been killed in action. Divisional commander Wang Kejing (王克敬), deputy divisional commander Xue Rulan (薛如蘭), and more than 2,000 officers and soldiers were captured. Guo Jingtang (郭景唐), the commander of the 169th division, led the remaining hundreds to break out and cross the Yellow River towards friendly lines.. The Japanese army claimed to have killed 2,862 soldiers and captured 4,311 from the 98th corps and Eighth Route Army, suffering 16 killed and 52 wounded in the process. In a few months, the Nationalists had lost its foothold in Southern Shanxi.\nOrder of battle\nSource:\nChinese\n1st War Area – Wei Lihuang\n* 5th Army Group – Zeng Wanzhong\n** 3rd Corps – Tang Huaiyuan\n*** 7th Division\n*** 12th Division\n** 80th Corps – Kong Lingxun\n*** 165th Division\n*** New 27th Division\n** 34th Division – Kung Pingfan\n* 14th Army Group – Liu Mao'en\n** 15th Corps – Wu Tinglin\n*** 64th Division\n*** 65th Division\n** 98th Corps – Wu Shimin\n*** 42nd Division\n*** 169th Division\n* 9th Corps – Pei Changhui\n** 47th Division\n** 54th Division\n** New 24th Division\n* 17th Corps – Gao Guizi\n** 84th Division\n** New 2nd Division\n* 43rd Corps§ – Zhao Shiling\n** 70th Division\n** Temporary 47th Division\n* 14th Corps – Chen Tie\n** 85th Division\n** 94th Division\n* 93rd Corps – Liu Kan\n** 10th Division\n** 166th Division\n** New 8th Division\n* 27th Corps – Fan Hanjie\n** 45th Division\n** 46th Division\n** 8th Reserve Division\n* '''Hebei People's Army – Qiao Mingli\n* Various guerilla units from the First and Hebei-Chahar Military Fronts\n§ 43rd Corps was formerly with 2nd War Area.\nJapanese\nNorth China Front Army – Major General Hayao Tada (Early May 1941)\n* 35th Division – Lt. Gen. Kumakichi Harada\n* 21st Division – Lt. Gen. Hisakazu Tanaka\n* 33rd Division – Lt. Gen. Shozo Sakurai\n* 4th Cavalry Brigade (partial) – ?\n* 1st Army''' – Lt.  Gen. Yoshio Shinozuka\n** 36th Division – Iseki Mitsuru\n** 37th Division – Adachi Hatazo\n** 41st Division – Shimizu Noritsune\n** 9th Independent Mixed Brigade – Major General Kenkichi Ikenoue\n** 16th Independent Mixed Brigade – Major General Heiji Wakamatsu\nReferences"
    }
  ]
}