{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Biberach (1796)\n\nFrance\n| combatant2  =  Habsburg Austria\n| commander1  =  Jean Moreau\n| commander2  =  Count Latour\n| strength1   = 35,000–39,000\n| strength2   = 15,000–26,000\n| casualties1 = 500 killed & wounded\n| casualties2 = 300 killed & wounded, 4,000 & 18 guns captured\n|map_type=Germany\n|map_relief=1\n|map_size=200\n}}\nThe Battle of Biberach was fought on 2 October 1796 between a French Republican army led by Jean Victor Marie Moreau and a Habsburg Austrian army led by Maximilian Anton Karl, Count Baillet de Latour. The French army paused in its retreat toward the Rhine River to maul the pursuing Austrians. The action occurred during the War of the First Coalition, part of the French Revolutionary Wars.\nTwo French armies invaded Germany in the summer and fall of 1796. They were opposed by two Austrian armies directed by Archduke Charles, Duke of Teschen. When the Archduke concentrated his forces against the northern French army, Moreau's southern French army failed to come to its aid because of a faulty strategy. After the northern army was driven back, Moreau's army was isolated and forced to retreat. At Biberach, Moreau turned on Count Latour's army to deal it a sharp blow. After the engagement, Latour followed the French at a more respectful distance.\nBiberach an der Riss is located  southwest of Ulm on the Riss River.\nBackground\nStrategy\nOn 20 May 1796, the Austrians notified the French that the existing armistice would end on 1 June, thus initiating the Rhine campaign of 1796. At this time, there were two Austrian armies defending the Rhine River. Archduke Charles, Duke of Teschen commanded 71,076 infantry and 20,702 cavalry on the lower Rhine while Dagobert Sigmund von Wurmser directed 82,776 soldiers on the upper Rhine. Facing Wurmser's Army of the Upper Rhine was the French Army of the Rhine and Moselle led by Jean Victor Marie Moreau. Archduke Charles's Army of the Lower Rhine was opposed by the French Army of Sambre and Meuse under Jean-Baptiste Jourdan. Lazare Carnot dictated a strategy that required the two French armies to operate on the extreme flanks of the Austrian armies. This faulty strategy would lead to the eventual failure of the French effort in Germany.\nEvents in Italy caused a major change in the campaign. The French Army of Italy under its new commander Napoleon Bonaparte won a series of victories and occupied Milan on 15 May 1796. This compelled the Austrian government to order Wurmser and 25,330 soldiers to transfer to the Italian theater. When Wurmser left Germany on 18 June, Archduke Charles was placed in overall command of both Austrian armies in Germany, totaling 151,334 troops. At this time, Moreau commanded 79,592 French soldiers and Jourdan led 77,792 French troops. Count Maximilian Baillet de Latour replaced Wurmser in command on the upper Rhine, while Wilhelm von Wartensleben assumed command over Austrian forces on the lower Rhine. Putting both armies in Germany under one supreme commander gave Austria a strategic advantage over the French, whose two armies were given separate and not necessarily cooperative orders.\nOperations\nUsing the French bridgehead at Düsseldorf to his advantage, Jourdan moved the bulk of his army south on the east bank of the Rhine as far as the Lahn River. Archduke Charles reacted by moving to the Lahn with superior forces. The French were defeated at the Battle of Wetzlar on 15 June 1796. Jourdan's forces subsequently withdrew partly to Düsseldorf and partly to the west bank of the Rhine. While the Austrians concentrated their forces against Jourdan's army, Moreau's army forced a crossing of the Rhine upstream near Kehl on 24 June. Leaving 25,351 infantry and 10,933 cavalry with Wartensleben, the Archduke raced south to confront Moreau's army. In the Battle of Ettlingen on 9 July, Moreau compelled Archduke Charles to abandon the Rhine River and retreat. The Archduke left 30,000 troops in the garrisons of Mainz, Mannheim, Philipsburg, Ehrenbreitstein, and Königstein.\nIn the north, Jourdan left 28,545 soldiers under François Séverin Marceau to blockade Mainz and Ehrenbreitstein. The remainder of the Army of Sambre and Meuse, a total of 46,197 men, advanced east in pursuit of Wartensleben's 36,284 Austrian soldiers. In the south, the Army of the Rhine and Moselle also marched east with its left wing led by Louis Desaix, its center commanded by Laurent de Gouvion Saint-Cyr, and its right wing under Pierre Marie Barthélemy Ferino. In the Battle of Neresheim on 11 August 1796, Archduke Charles lashed out at Moreau's army, but his troops were repulsed mostly by Saint-Cyr's forces. The Archduke then withdrew his army to the south bank of the Danube. In the north, Jourdan's army pushed Wartensleben's troops behind the Naab River.\nArchduke Charles left Count Latour with 30,288 Austrians, plus the Army of Condé (5,000–6,000), to oppose Moreau and moved north with 28,000 troops. He crossed to the north bank of the Danube at Ingolstadt on 17 August 1796 and marched to reinforce Wartensleben. Moreau's army crossed to the south bank of the Danube, but instead of following the Archduke, it drove straight east. Moreau's 59,000 men rather handily defeated Latour at the Battle of Friedberg on 24 August. However, that same day the Archduke defeated Jourdan's army at the Battle of Amberg. Jourdan was defeated again at the Battle of Würzburg on 3 September and his army was chased west to the Rhine. The Austrians relieved the sieges of both Mainz and Mannheim on 8 September.\nOn 19 September 1796, Moreau found his 64,000-man army isolated, and he began to retreat to the west. The Austrian forces that tried to surround him were Count Latour with 16,960 men, Michael von Fröhlich with 10,906 soldiers on the upper Iller River and the Tyrol, Friedrich Joseph, Count of Nauendorf with 5,815 troops marching to occupy Ulm, and Franz Petrasch with 5,564 men on the Rhine. Archduke Charles left 32,000 soldiers to watch the defeated Army of Sambre and Meuse and hurried south with 16,000 troops. In addition, 13,334 men from the Rhine garrisons were available. Nauendorf, after being reinforced to 9,500 men, headed west from Ulm to Tübingen, which took his force away from a junction with Latour. Nevertheless, Latour believed that he had the French on the run and acted very aggressively, hoping to drive them into Lake Constance.\nOn 30 September, Latour's vanguard under his brother Ludwig Anton, Count Baillet de Latour (referred to by Edward Cust and hereafter as Count Baillet) ran into Saint-Cyr's troops at Bad Schussenried and lost 300 prisoners. This setback came at the hands of Claude Lecourbe's French brigade. That night, Moreau, Desaix, and Saint-Cyr met to decide what to do next. Moreau determined to stun Latour's army with a hard blow in order to discourage pursuit. At this time, Desaix's wing was deployed from Uttenweiler to Alleshausen, north of the Federsee. Saint-Cyr's troops were arranged from Bad Buchau to Bad Schussenried, south of the Federsee. Ferino was far to the south at Ravensburg, more than one day's march distant.\nBattle\nThe terrain near Biberach is hilly and wooded with deep streambeds. Count Latour's army was deployed in a difficult position with the Riss River across its line of retreat. The Austrian right flank under Siegfried von Kospoth with 6 battalions and 10 squadrons ran from Stafflangen to the north. Count Baillet held the center at Steinhausen with 6 or 7 battalions and 12 squadrons. The Austrian left under Karl Mercandin with 7 or 8 battalions and 19 squadrons was supported by the Army of Condé (French Royalists) at Winterstettenstadt. Counting only those troops that were present at the battle, Moreau had 39,000 men against Latour's 26,000 troops, according to historian Ramsay Weston Phipps. Digby Smith estimated a strength of 35,000 men for the French and only 15,000 for the Austrians. Edward Cust credited the Austrians with 23,000 men, but did not give a strength for the French.\nFerino was ordered to march to turn the Austrian left flank, but his troops were too far away and did not come into action. Saint-Cyr with the Center and Reserve attacked the Austrian center at Steinhausen while Desaix attacked the Austrian right flank at Staffhausen. Saint-Cyr launched his assault at 7:30 am. Moreau allowed Saint-Cyr and Desaix a lot of latitude on how to conduct the battle. Saint-Cyr deployed 24 guns in support of his attack, led by Lecourbe's brigade. The Austrian cavalry counterattacked, but the French steadily drove Baillet's troops back to Grodt and Ingoldingen where they held out until 5:00 pm. Meanwhile, Saint-Cyr's division under Guillaume Philibert Duhesme advanced on the right. Desaix launched his assault after Saint-Cyr's initial success and pressed Kospoth's soldiers back to the Galgenburg (Gallows Hill) where they held fast.\nSaint-Cyr assigned Pierre Garnier de Laboissière's brigade the task of keeping the troops of Mercandin and Condé in check while he smashed the Austrian center. However, Laboissière kept sending panicky messages saying that he was about to be overwhelmed. Finally, Saint-Cyr turned aside from his main attack to deal with the Austrian left flank. It turned out that the impending defeat of Baillet's center caused Mercandin and Condé to begin to withdraw. Saint-Cyr launched his cavalry in pursuit, but the soldiers of Mercandin and Condé barely escaped across the Schweinhausen bridge, which spanned the Riss south of Biberach. Saint-Cyr returned to attack Grodt, sending his infantry to storm the heights. Latour realized he was beaten and sounded the retreat, after sending his artillery park to safety. As the Austrian soldiers fell back, they heard firing in the rear and dispersed into the woods. During the night, there were friendly fire incidents as Austrian units bumped into one another in the dark. The French pursuit stopped at nightfall.\nBalked at the Galgenburg, Desaix turned both flanks of the position. The firing in the rear was Desaix's troops fighting their way into Biberach. Kospoth's line ran from Birkenhard on the north to Mittelbiberach. Desaix broke through both flanks and threatened to envelop Kospoth in Biberach. Ordered to retreat, Kospoth's men had to cut their way out of the trap, but four battalions were forced to surrender. Latour reassembled his mauled forces at Ringschnait, but fearful of being attacked on 3 October, he retreated farther east to Erlenmoos. The Austrians lost 300 killed and wounded, plus 4,000 men, 18 guns, and 2 colors captured. French losses numbered 500 killed and wounded.\nAftermath\nMoreau paused for a day before continuing his retreat west along the Danube on 4 October. The army commander called another meeting with Desaix, Saint-Cyr, and his chief of staff Jean Reynier at Donaueschingen on 9 October. Moreau wanted to cross the Black Forest via the Kinzig valley but Desaix argued that Nauendorf and Petrasch probably blocked that pass. Saint-Cyr suggested the Höllental (Hell Valley) as an alternative though the army would have to pass through the Höllental in a single column. Since Saint-Cyr offered to have his troops lead the way, Moreau gave the plan his blessing. Saint-Cyr's troops marched from Neustadt an der Donau through the Black Forest to Freiburg im Breisgau on 12 October, brushing aside elements of Petrasch's over-extended division. Meanwhile, the army's wagon train passed through the Black Forest farther south, escorted by the brigades of Jean Victor Tharreau and Nicolas Augustin Paillard from Ferino's right wing.\nThe Army of the Rhine and Moselle reached a place of relative safety when it reestablished contact with France near Alt-Breisach. Archduke Charles' reinforcements joined Nauendorf, Petrasch, and Latour around 17 October. The Battle of Emmendingen on 19 October and the Battle of Schliengen on 24 October were subsequently fought.\nNotes\n;Footnotes\n;Citations\nReferences\n*\n*\n*\n*"
    }
  ]
}