{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Vyšehrad__disambig_1\n\n1 November 1420\n|place=Vyšehrad\n|result=Hussite victory\n|combatant2=Hussite coalition\n* Praguers\n* Orebites\n* Union of Žatec and Louny\n* Taborites\n|combatant1=Holy Roman Empire\n* German mercenaries\n* Bohemian Catholic nobility\n* Margraviate of Moravia\n* Duchies of Silesia\nKingdom of Hungary\n|commander2=Hynek Krušina of LichtenburgDiviš Bořek of MiletínekMikuláš of Hus\n|commander1=King SigismundJindřich of Kravaře and PlumlovJan Všembera of BoskoviceMikeš Divůček of Jemniště\n|strength2=10,000–15,000\n|strength1=Over 10,000\n|casualties2=30 killed\n|casualties1=500 killedUnknown number of wounded and captured\n}}\nThe Battle of Vyšehrad was a series of engagements at the start of the Hussite War between Hussite forces and Catholic crusaders sent by King Sigismund. The battle took place at the castle of Vyšehrad from 16 August 1419 to c. 1 November 1420.\nStart of the battle\nAfter the death of King Wenceslaus IV of Bohemia, Queen Sophia (with the help of Čeněk of Wartenberg) tried to gain control of Prague. Sophia and Čeněk recruited soldiers from Germany, who took up positions at Vyšehrad, Hradčany, and at the archbishop's palace and the cloister of St. Thomas in a part of Prague called New Town. The Hussite uprising was successful in other parts of Bohemia, and the towns of Klatovy, Písek, Louny, Žatec, and Plzeň came under Hussite control. On 25 October 1419, Hussites captured Vyšehrad as well.\nIn November 1419, fighting took place between Catholic fighters under Petr from Šternberk and Hussite peasants under the command of a priest, Ambrosius. These Hussites went from the area near Usti to Prague, surrounded Novy Knin, and attacked. After gaining reinforcements, Ambrosius's forces crossed the Vltava River. The Hussites won the battle but lost about 300 people.\nAfter taking Prague, the Hussites decided to assist citizens in Novy Knin. More fighting commenced as Hussite fighters captured the bridge to New Town on the Vltava River. Catholic soldiers who guarded the bridge were forced to withdraw to Hradcany, but many buildings in New Town were destroyed.\nOn 13 November 1419 Queen Sophia promised to protect the Hussites in all of Bohemia. Utraquists gave back Vyšehrad to the royal army.\nBattle under Nekmierz\nLater in November, formations of Taborites, several hundred strong, left Prague. In December 1419, one of these formations under the command of Jan Žižka was surprised by Catholic forces under the command of Bohuslav of Švamberk. A cavalry attack at Nekmierz (Nekmer) castle near Plzeň (Pilsen) by the Catholics was stopped by crossbow and gunfire from Hussite soldiers hiding behind wagons. Catholic infantry and cavalry were forced to withdraw. After the battle Žižka ordered a night march to Plzeň.\nIn the Spring of 1420, after capturing the town of Sezimovo Ústí (German: Aussig), Hussite forces went to a hill near the Lužnice river where they built a new town which they named Tábor after the biblical Mount Tabor (but the noun means also camp). This new town became the capital of the Taborites' collective. Citizens of Tábor chose four hetmen, or generals: Nicholas of Husí, Jan Žižka, Zbyněk of Buchovo, and Chval of Machovice.\nSimilar army camps were also built, notably one on the mountain of Oreb, where another group of radical Hussites established themselves, and became known as the Orebici (Orebites). Their civil leader was the priest Ambrosius, and their hetman was Hynek Krušina from Lichtenburk.\nBattle at Sudoměř\nThe Hussites lost Plzeň, in arrangement with the Catholics. Hussites, under command of Jan Žižka, were allowed to leave the town without difficulties. Catholics from Plzen sent information about Žižka's forces to Jindrich from hradce master of knights of St. John of Jerusalem and Bohuslav from Švamberk. After massing at Sudoměř, they decided to attack; they had more soldiers than Žižka, as well as reinforcements from Písek. In the opinion of writers of chronicles, the attackers would not have had to fight with the Hussites because the few rebels would be trampled to death beneath the horses' hooves.\nŽižka deployed his men on a small dam between two ponds, one of which was without water. The backs of the Hussites were protected by a swamp. The Catholic commanders divided their forces into two groups. The first group assaulted the Hussites from the front, and sustained heavy casualties. The second group of knights crossed the empty pond and attacked on foot. Soon the field of battle was covered by fog, and the Catholics withdrew, both sides having suffered heavy losses.\nIn May 1420 Čeněk von Wartenberg surrounded Hradčany and joined King Sigismund's side. Soldiers from Vyšehrad advanced on New Town. The Hussites begun a siege of Vyšehrad.\nIn June 1420 there was a successful advance from Vyšehrad. Soldiers from this castle secured supplies which were sent to Hradčany.\nSiege of Prague\nOn 12 June 1420, some formations of Sigismund's forces successfully entered Hradčany with supplies. They took horses from the castle.\nAt the time of the Prague siege, Sigismund's soldiers, who were placed in Hradčany and Vyšehrad, advanced on the Hussites' position in Prague. After a successful defence of Vítkov Hill and the crusaders' withdrawal, the Hussites begun artillery fire on Vyšehrad, but received heavier losses than Prague's defenders.\nAfter an unsuccessful assault on Vítkov Hill, the crusaders decided to attack the local Hussites' position. In August 1420, Hetman Jan Žižka left Prague with relief forces and headed to Písek, which was in danger from crusaders under the command of Oldřich from Rožmberk. 15 September 1420 saw the beginning of a second siege of Vysehrad. In the last days of October, the commandant of the castle accepted a capitulation arrangement. If he didn't receive any help from Sigismund's forces by 8 o'clock in the morning of 1 November 1420, he would surrender the castle. Meanwhile, another formation of Taborites, among them commander Jan Roháč z Dubé, captured the town of Lomnice.\nBattle of Vyšehrad\nSigismund planned a main attack using soldiers from Hradčany and Vyšehrad, and counting on reinforcements from Plzeň Union. The plan of battle was sent to Hradčany and Vyšehrad by courier, but the courier was captured by Hussites. The Hussites sent some soldiers under the command of Jan Žižka to stop the march of soldiers from Plzeň.\nHussite artillery fire successfully stopped the attack of the Hungarian and German cavalry. Then the Hussite forces made their attack. After the battle, the crusaders' formations withdrew. Four hundred knights were killed by the Hussites, who didn't take any prisoners of war. Among the dead were Petr Konopišťský of Šternberk, , , Vilém Zajíc of Valdek and Židlochovice, and .\n1 November saw the capitulation of soldiers from Vyšehrad. Žižka's forces captured Zlaté Korouny and Prachatice. December 1420 saw the death of Nicholas from Husí.\nAftermath\nIn January 1421, Taborite forces, under command of Jan Žižka and Chval from Machovice, captured the town of Stříbro and cloister in Krakikov. The commandant of Stříbro Castle, Bohuslav of Švamberk, surrendered; his soldiers were free to go. Because Sigismund didn't send a ransom for him, Bohuslav decided to join the Hussites. Eventually the Taborites chose him as their hetman.\nIn February, King Sigismund withdrew to Moravia and then to Hungary. June 1421 saw the capitulation of the soldiers in Hradčany.\nReferences\n* Piotr Marczak \"Hussite wars\" Warsaw Egros pages 55–60, page 66, pp.&nbsp;68–69\nExternal links\n* [http://bellum.cz/en/battles-of-vitkov-hill-and-vysehrad.html Bellum.cz – Battle of Vyšehrad 1 November 1420]"
    }
  ]
}