{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Tolhuis\n\n| result            = French victory\n| combatant1        =\n| combatant2        =\n| commander1        =  Louis XIV   Grand Condé   Count of Guiche\n| commander2        =  Paul Würtz\n| strength1         = 80,00012 guns\n| strength2         = 2,000\n| casualties1       = 300 killed or wounded\n| casualties2       = 1,500 killed, wounded or captured\n| map_type          = Netherlands\n| map_relief        = 1\n| map_size          = 300\n}}\nThe Battle of Tolhuis or Crossing of the Rhine took place on 12 June 1672 during the Franco-Dutch War. The battle was fought between the army of Dutch Republic and the army of the French king Louis XIV.\nBackground\nIn the run-up to the Franco-Dutch War, the regenten, who led the Dutch republic, were under the impression that in case of a war the French army would invade from the south and would first have to besiege Maastricht. This option was naturally discussed in the French army command, but King Louis XIV chose to invade the Republic on the eastern side and ordered his men to march through the Electorate of Cologne to the Dutch Rhine forts. Together with his allies, the bishops of Cologne and Münster Louis attacked. In total some 130,000 troops marched on the Republic, 20,000 of those were left to blockade Maastricht.\nMost of the 19,000 strong Dutch field army led by the William of Orange, was in Arnhem at the time. Here the possibility of what consequences it would have if the French crossed the Rhine was discussed. After the consultation, Major General Jean Barton de Montbas, a Frenchman in Dutch service, moved into his headquarters Schenkenschanz. However, after only a few days De Montbas left Schenkenschanz with his troops, leaving this stretch of the Rhine unguarded.\nMeanwhile, the 80,000 strong French army had reached the Rhine at Lobith. On the night of 10–11 June, the helpful farmer Peters pointed out a shallow path through the river to the French army commanders. When William III learned where the French army was located, he sent Field Marshal Paul Würtz to Lobith to slow the advance.\nBattle\n]]\nWürtz arrived at the river on 12 June; the French army had already lined up in battle order across the river. Würtz then positioned his three companies of cavalry at the river crossing. A few hundred metres away at Tolhuis castle, he placed a regiment of Frisian infantrymen and his guns.\nThe Dutch troops did not have time to entrench themselves and by now the French had set up a battery of 12 cannons that opened fire on the Dutch force. By then, the French army was nearly finished with their construction of a pontoon bridge. Condé, Louis's commander in chief, send the Count of Guiche with 2,000 cavalryman to cross the river. Initially, the French encountered difficulties due to the current of the river and a number of Frenchmen drowned in the Rhine. The cuirassiers who did reach the other bank of the river were attacked by Würtz's cavalry and forced back to the shallow riverbed. However, there they regrouped and a minor firefight ensued, during which the Dutch cavalry was forced to move back a little from the river bank by the enemy's cannon fire.\nThe French cavalry continued the crossing of the river uninterrupted, and now in larger and more closed units, thus breaking the power of the current and avoiding losses. The crossed troops formed into squadrons on the river bed, and, having a sufficient numerical superiority, attacked Würtz's cavalry, who fled after a short fight. In gold and silver armour, the Maison du Roi, the best horsemen of the French army, consisting of the highest nobles, crossed the river. Condé and other commanders made their way across in barges, and the French king also made his way to the bank, to inspire his soldiers with bravery by his presence.\nBy now, 6,000 French horsemen had arrived on the left bank of the Rhine and Condé, placing himself at their head, advanced to attack the Dutch infantry. Those foot soldiers were few in number, weak and poorly composed, and completely discouraged by the flight of their horsemen. They recognised that they had no way of resisting or escaping the enemy. When Condé himself, in a strongly commanding tone, told these troops to lay down their arms, they were ready to do so.\nBut a young French nobleman, Charles Paris d'Orléans, Duke of Longueville, drunk on wine, threw himself on the Dutch infantry, firing pistols at them and shouting that no man would be spared. The Dutch infantry quickly took up arms again and opened fire on the French. Longueville and several French noblemen were killed, and Condé himself, attacked by a Dutch officer, was wounded by a pistol shot.\nBut the resistance of the Dutch foot soldiers was quickly broken by the fierce attacks of the French cavalry and completely dispersed. The soldiers who were not killed are made prisoners and no one escaped. The loss on the Dutch side at the battle of Tolhuis is estimated at 1,500. The Louis XIV army lost 300 men.\nAftermath\nThe French crossing at Tolhuis had at a stroke rendered the Dutch defence line on the river IJssel untenable. This would leave the entire eastern part of the Dutch Republic open to the French army. Despite the facts that the odds had been heavily in favour of Louis, the French victory was seen by his courtiers back home as one of Louis XIV's greatest victories, and people at Versailles, which was still under construction, had Louis XIV portrayed in the War Room as a Roman horseman trampling down a group of Germanic soldiers. Louis was not satisfied however; the crossing should have been his moment of glory, but Condé had drawn all the attention by personally taking part in the battle and being wounded. Louis would resent him very much for this. After the battle, the Ijssel line was essentially outflanked, and the States of Holland had to come to the decision to completely abandon the Ijssel to shift its focus on defending Holland, Zeeland and Utrecht.\nCondé's injury meant that he would be out for the rest of the campaign. Turenne took over command. He had the French army split into two parts. One part advanced towards Nijmegen to take that city, while the other half would attempt to take Arnhem.\nNotes\nReferences\nGeneral references\n*\n*\n*\n*"
    }
  ]
}