{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Liebertwolkwitz\n\n1901)\n| partof            = the German campaign of the Sixth Coalition\n| date              = 14 October 1813\n| place             = Liebertwolkwitz, Wachau and Güldengossa area, south of Leipzig\n| coordinates       =\n| result            = Indecisive\n| combatant1        =\n| combatant2        =  France\n| commander1        =  Peter Wittgenstein Friedrich Kleist von Nollendorf\n| commander2        =  Joachim Murat Claude-Victor Perrin\n| strength1         = 60,000\n| strength2         = 49,000156 guns\n| casualties1       =\n| casualties2       =\n| map_type          = Europe\n| map_relief        = 1\n| map_size          = 300\n}}\n|  zoom = 5\n|   float = right\n|    nolabels = 1\n|     width = 304\n|     height = 180\n| title = War of the Sixth Coalition:German campaign\n| caption =\n| shapeD=n-circle\n| shape-colorD=navy\n| shape-outlineD=white\n| label-colorD = navy\n| label-sizeD = 12\n| label-posD = left\n| label-offset-xD = 0\n| label-offset-yD = 0\n| label1 =\n| mark-coord1 =\n| mark-title1 = Siege of Danzig (1813) from 16 January to 29 November 1813\n| label2 =\n| mark-coord2 =\n| mark-title2 = Battle of Möckern on 5 April 1813\n| label3 =\n| mark-coord3 =\n| mark-title3 = Battle of Lützen (1813) on 2 May 1813\n| label-color3 = maroon\n| shape-color3 = maroon\n| label4 =\n| mark-coord4 =\n| mark-title4 = Battle of Bautzen (1813) from 20 to 21 May 1813\n| label-color4 = maroon\n| shape-color4 = maroon\n| label5 =\n| mark-coord5 =\n| mark-title5 = Battle of Haynau on 26 May 1813\n| label6 =\n| mark-coord6 =\n| mark-title6 = Battle of Luckau on 4 June 1813\n| label7 =\n| mark-coord7 =\n| mark-title7 = Battle of Großbeeren on 23 August 1813\n| label8 =\n| mark-coord8 =\n| mark-title8 = Battle of the Katzbach on 26 August 1813\n| label9 =\n| mark-coord9 =\n| mark-title9 = Battle of Dresden from 26 to 27 August 1813\n| label-color9 = maroon\n| shape-color9 = maroon\n| label10 =\n| mark-coord10 =\n| mark-title10 = Battle of Kulm from 29 to 30 August 1813\n| label11 =\n| mark-coord11 =\n| mark-title11 = Battle of Dennewitz on 6 September 1813\n| label-color11 = black\n| shape-color11 = black\n| label12 =\n| mark-coord12 =\n| mark-title12 = Battle of the Göhrde on 16 September 1813\n| label13 =\n| mark-coord13 =\n| mark-title13 = Battle of Altenburg on 28 September 1813\n| label14 =\n| mark-coord14 =\n| mark-title14 = Combat of Roßlau on 29 September 1813\n| label15 =\n| mark-coord15 =\n| mark-title15 = Battle of Wartenburg on 3 October 1813\n| label16 = Leipzig\n| mark-coord16 =\n| mark-title16 = Battle of Leipzig from 16 to 19 October 1813\n| label-color16 = maroon\n| shape-color16 = maroon\n| label17 =\n| mark-coord17 =\n| mark-title17 = Battle of Hanau from 30 to 31 October 1813\n| label-color17 = maroon\n| shape-color17 = maroon\n| label18 =\n| mark-coord18 =\n| mark-title18 = Battle of Sehested from 10 December 1813\n| label19 =\n| mark-coord19 =\n| mark-title19 = Siege of Hamburg from 24 December 1813 to 12 May 1814\n}}\nThe Battle of Liebertwolkwitz (, also the battle of Güldengossat) took place on 14 October 1813 between French forces commanded by field marshal Joachim Murat and the Sixth Coalition's Allied Army commanded by Russian field marshal Peter Wittgenstein. It occurred around the village Liebertwolkwitz, a Saxony town south of Leipzig, two days before the start of the decisive battle of Leipzig. Clash is also referred as the biggest cavalry battle in military history with an approximate number of about 14,000 armed cavalrymen joining from both sides.\nPrelude\nThe Allied forces had already inflicted severe defeats on Napoleon's armies during the German autumn campaign of 1813, leaving the French commanders a little room for initiative. In the beginning of October, Napoleon unsuccessfully attempted to engage Blücher's Army of Silesia, which had been crossing the Elbe since the victory at the battle of Wartenburg on October 3. Blücher tactically diverted his forces towards Halle, thus giving the main Allied army under Karl Philipp, Prince of Schwarzenberg the opportunity to march northwest from the Saxon-Bohemian border area. Napoleon assigned about 50,000 men under marshal Joachim Murat, who were initially stationed between Leipzig and the Ore Mountains and were slowly retreating towards Leipzig as the main army advanced. Murat repeatedly requested Napoleon's support against Schwarzenberg, which Napoleon finally approved on October 13. He believed that Blücher was at a sufficient distance to give him enough time to defeat the main coalition armies and ordered his main forces to march south from Düben. Murat had now withdrawn his positions to a line a few kilometers south of Leipzig, in the area of Liebertwolkwitz village. The Allied vanguard was already directly opposite him on the night of the 14th October.\nSchwarzenberg ordered a reconnaissance by fight from his headquarters in Altenburg on the morning of October 14. The vanguard of the main army, still on the march, was to explore the French positions south of Leipzig and, if possible, push the enemy back further. Under the command of General Wittgenstein, 3,000 Russian cavalrymen were ordered to conduct the reconnaissance mission, while two infantry corps commanded by Eugene of Württemberg and Russian officer Andrei Gorchakov, the cavalry corps of Pahlen, and the corps of Johann von Klenau and Friedrich Kleist von Nollendorf, which also included Röder's reserve cavalry, were still subordinate to him.\nThe Allies faced the force of around 50,000 men. Corps of general Józef Poniatowski of about 6,000 men were stationed at Connewitz, Lößnig, Dölitz, and Markkleeberg. The 2nd Corps under command of marshal Claude-Victor Perrin were positioned at Wachau in a force of 15,000 men, and the 5th Corps with 12,700 men under Lauriston controlled Liebertwolkwitz. The reserve consisted of Augereau's 9th Corps with 10,000 men at Thonberg, a Imperial Guard division, a total of 4,000 cavalry from the divisions of Milhaud, Berkheim, and L'Héritier, also with about 2,000 riders of Polish cavalry.\nBattle\nThe battle began at 9:00 a.m. Murat initially took command from the \"Napoleon Linden Tree\" in the garden of the Wachau manor. The Allied advance began on the right flank with the attack of Klenau's corps on Großpösna, which was only lightly defended. The attacks against Liebertwolkwitz were conducted inadequately during the first few hours. It wasn't until around 11:00 a.m. that the French found their flank threatened when Maison's division was surrounded by the Austrians at Seifertshein, Holzhausen, and Kolmberg, east of Liebertwolkwitz. Between 11:30 a.m. and 12:30 p.m., Klenau managed to capture Liebertwolkwitz, but their position was recaptured by French due to Murat's counterattack at 2:00 p.m., finally being forced to abandon it after a brief threat from Russian cavalry in their rear, and held it from 6:00 p.m., while Klenau retreated to Großpösna.\nAt 10:00 a.m. Kleist attacked south of Güldengossa with several Prussian cavalry regiments. At the same time, Röder and his units advanced at Wachau, Güldengossa and Markkleeberg, since noon joined by the Eugen von Württemberg's corps, which took up positions between the Wachau and Güldengossa. However, this Allied strategic gain prevented numerous French units to entrench in the brick-built and defendable Auenhain sheep farm, on the edge of Güldengossa. A cannonade by the Allied artillery on the Wachtberg Hill near Güldengossa and by the French artillery on the Galgenberg Hill between Wachau and Liebertwolkwitz led to further mutual cavalry attacks, which exhausted both sides so much that at noon the fighting was temporarily halted. Around 1 p.m., Murat led an attack with about 5,000 infantry against the Allied center, with roughly the same number of cavalrymen. French action failed and Murat himself narrowly escaped captivity. Around 2:00 p.m., Prussian and Russian cavalry broke through on both flanks of the French center and pursued the French as far as the Wachau, where they were forced to yield to massive fire. Murat's counterattacks also failed due to the Prussian artillery on the Wachtberg. At that time, as many as 14,000 cavalrymen were present on the battlefield during these clashes. From 5:00 p.m. onward, the fighting in the area ceased.\nDespite great efforts, the Russian and Prussian units on the left flank led by Pahlen and Röder were unable to drive the Poles from their positions. However, Poniatowski's attempts to escape from Markkleeberg failed just as bloodily. Due to the strong resistance of the defenders, the Allies ordered many additional units from the south to enter the battlefield, until about 60,000 men were confronting Murat by late afternoon. Nevertheless, Schwarzenberg ordered the battle to be broken off.\nAftermath\nBy halting the attacks both sides returned to their previous positions by morning. The result can be considered a draw. Murat managed to achieve a tactical victory by delaying the Allied attacks and their advance on Leipzig until Napoleon was able to move the main army forces south of Leipzig on October 16, when the three-day battle of Leipzig started. The Allies also brought most of the main army forward in the following days and achieved a strategic victory by inflicting further losses on Napoleon's cavalry, already barely at the objective, which led to a significant weakening of the French side in the following fighting. The Allied losses, however, were not so severe. The positions of both sides remained unchanged and were again bitterly contested on October 16 in the same locations. Most of the key positions in the villages of Liebertwolkwitz and Wachau were not evacuated by the French until October 18.\nCitations\nBiography\n* * Riley, Jonathon. 1813: Empire at Bay: The Sixth Coalition & the Downfall of Napoleon. Grub Street Publishers, 2013.\nExternal links\n*"
    }
  ]
}