{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Pork Chop Hill__disambig_1\n\n| territory         =\n| result            = UN victory in April battleChinese victory in July battle\n| combatant1        =\n*\n*\n*\n*\n*  Thailand\n| combatant2        =\n| commander1        =  James Van Fleet Arthur G. Trudeau\n| commander2        =  Peng Dehuai Chung Kuo Chu\n| units1            =  7th Infantry Division 21st Infantry Regiment\n| units2            =  67th Division (in July battle)\n| strength1         = 19,000 men\n| strength2         = 20,000 men (UN estimate)6,800 (in July battle)\n| casualties1       = US:347 killed1,036 wounded9 captured\nChina estimate3,500 killed or wounded\n| casualties2       = UN estimate1,500 killed4,000 woundedChinese source:533 killed1,242 wounded (in July battle)\n| notes             =\n| map_type          = North Korea\n| campaignbox       =\n}}\nThe Battle of Pork Chop Hill, known as Battle of Seokhyeon-dong Northern Hill () in China, is a pair of related Korean War infantry battles that took place on April 16 and July 11, 1953 while the United Nations Command (UN) and the Chinese and North Koreans were negotiating the Korean Armistice Agreement.\nIn the United States, the battles were controversial because of the large number of soldiers killed for terrain with no strategic or tactical value, but according to US sources, which are disputed by Chinese sources, the Chinese lost many times the number of US number killed and wounded. The first battle was described in the eponymous history  Pork Chop Hill: The American Fighting Man in Action, Korea, Spring 1953, by S.L.A. Marshall, from which the film Pork Chop Hill was drawn. The UN won the first battle, but the Chinese won the second battle.\nThe UN forces, supported primarily by the United States, won the first battle when the Chinese broke contact and withdrew after two days of fighting. The second battle involved many more troops on both sides and was bitterly contested for five days, when the UN conceded the hill to the Chinese by withdrawing behind the main battle line.\nBackground\nThe  hill, which was so-named because its topographic shape vaguely resembled a pork chop, was first seized by the US 8th Cavalry Regiment in October 1951. It was taken again in May 1952 by I Company of the US 180th Infantry Regiment. The 1st Battalion of the 21st Thai Regiment attached to the US 2nd Infantry Division defended the position in November 1952. From 29 December 1952, it became part of the US 7th Infantry Division's defensive sector. Pork Chop Hill was among several exposed hill outposts along the UN Main line of resistance (MLR) that were defended by a single company or platoon positioned in sand-bagged bunkers connected with trenches.\nOpposing the 7th Infantry Division were two divisions of the Chinese People's Volunteer Army (PVA): the 141st Division of the 47th Army and the 67th Division of the 23rd Army. These were veteran, well-trained units experienced in night infantry assaults, patrolling, ambushes, and mountain warfare. Both armies (corps-sized units) were part of the 13th Field Army commanded by General Deng Hua, who was also deputy commander of PVA forces in Korea.\nThe opposing forces in this sector were roughly equal in size, the 7th Division (Major General Arthur Trudeau, commanding) totaling 11 infantry battalions (including attached battalions from Colombia and Ethiopia), a battalion of armor, and 6 battalions of artillery, while the PVA forces totalled 12 infantry, 10 artillery, and the equivalent of one tank battalion.\nBoth the UN and the PVA had used military operations to gain leverage or make political statements relevant to the armistice negotiations since early 1952. The first battle on Pork Chop Hill occurred near Operation Little Switch, the exchange of ill and injured prisoners-of-war scheduled for 20 April. The PVA command authorized the April attack to demonstrate that agreement in contentious negotiations did not equal unwillingness to continue fighting, if necessary.\nFirst battle (16–18 April)\nLoss of the outpost\nIn a surprise night attack on 23 March 1953, a battalion of the PVA 423rd Regiment, 141st Division seized Old Baldy (Hill 266) an outpost near Pork Chop Hill and quickly overwhelmed B Company of the 31st Infantry's Colombian Battalion, commanded by Lt. Colonel Alberto Ruiz Novoa, during its relief in the Fifth Battle for Old Baldy. The regimental commander, Colonel William B. Kern, had ordered C Company of the Colombian Battalion to relieve B Company despite the Colombian commander's protest. The attack caught both companies amidst the rotation. Two days of stiff resistance by the maimed and battered B and C Companies failed in retaking the hill due to the failure of the 31st Regiment Command to send reinforcements, causing the UN to order its abandonment. This preliminary fight exposed Pork Chop to three-sided attack, and, for the next three weeks, PVA patrols probed it nightly.\nOn the night of 16 April Company E, 31st Infantry (1st Lt. Thomas U. Harrold) manned Pork Chop Hill. Shortly before midnight, an artillery barrage foreshadowed a sudden infantry assault by a battalion of the PVA 201st Regiment; Pork Chop Hill was quickly overrun, although pockets of US soldiers defended isolated bunkers. Elsewhere in the sector, other positions were attacked, pressuring the entire 7th Division.\n31st Infantry counterattack\nCompany K (1st Lt. Joseph G. Clemons) and Company L (1st Lt. Forest G. Crittenden), 31st Infantry, in reserve behind the MLR, were ordered to counterattack and began their attack at 04:30 on 17 April. By dawn they reached the main trenches on top of the hill but suffered almost 50% casualties, and half of Company L's troops had not been able to leave the trenches of an adjacent outpost, Hill 200. Lt. Clemons, in tactical command of the assault, requested reinforcement. 2nd Battalion, 17th Infantry Regiment was already attached to the 31st Infantry and its Company G (1st Lt. Walter B. Russell Jr., who was Clemons's brother-in-law) was immediately sent forward, linking up with Company K at 08:30. All three companies were subjected to almost continuous shelling by PVA artillery as they cleared bunkers and dug in again.\nThrough a series of miscommunications between command echelons, Division headquarters ordered Russell's company to withdraw at 15:00 after they too had suffered heavy losses, and did not realize the extent of casualties among the other two companies. By the time the situation was clarified the companies of the 31st Infantry were down to a combined 25 survivors. Maj. Gen. Trudeau, by then on scene, authorized Col. Kern to send in a fresh company to relieve all elements on Hill 255 and placed him in tactical command with both the 1st and 2nd Battalions of the 17th Infantry attached and at his direction.\n17th Infantry counterattack\nKern sent forward Company F, 17th Infantry (Captain Monroe D. King), which started up the hill at 21:30 under heavy artillery fire but reached the trenches at 22:00, suffering 19 killed in the process. Kern at 23:00 then ordered Company E, 17th Infantry (1st Lt. Gorman C. Smith), to move up to reinforce Company F. Smith, to avoid the bulk of the artillery fire, moved around the right flank of the hill and up the side facing the PVA positions.\nCompany K, 31st Infantry had incurred 125 casualties, including 18 killed, of its original 135 men. After twenty hours of steady combat the remaining seven members started off the hill singly just after midnight of 17/18 April and withdrew without further losses. Several of Company L's survivors remained with the relief troops to familiarize them with the layout of the hill defenses.\nDuring the early morning of 18 April, the PVA 201st Regiment renewed its attack at 01:30 and again inflicted heavy losses on the defenders, nearly overrunning Company F in battalion strength. The timely counterattack by Company E, 17th Infantry caught the PVA by surprise on their flank and ended the organized assault. The 141st Division renewed attacks in company strength at 03:20 and 04:20 but did not gain further ground.\nAt dawn on 18 April, an additional US rifle company (Company A, 17th Infantry) climbed the hill to reinforce the 2nd Battalion companies. Together the three companies spent the bulk of the day clearing the trenches and bunkers of all hiding PVA and securing the hilltop. The 17th Infantry rescued the lone 31st Infantry Soldier during this counterattack, a 31st Infantry signalman named Jerry Olson. Jerry had been listed as missing in action 8 days earlier following the Battle at Old Baldy. Jerry was alone atop Pork Chop Hill for three days. On the fourth day of the battle, Private Norcut of the 17th Infantry found Jerry alive on Pork Chop Hill. Jerry was gone from his 31st unit for eight days. Jerry was one of the seven men from the 31st Infantry to leave Pork Chop Hill alive. He said the three and half days were a “lifetime of Hell.”\nUN artillery had fired over 77,000 rounds in support of the three outposts attacked, including nearly 40,000 on Pork Chop Hill alone on 18 April; the PVA expended a similar amount.\nTactics and losses\nBoth the PVA and US infantry assaulted the hill initially under cover of a moonless night. Each used a heavy preparatory artillery barrage to force the defenders to take cover in bunkers and to screen the approach of the attacking troops. PVA forces used rapid movement and infiltration tactics to close quickly on the trenches and surprise the defenders, while the US forces used grazing fire (small arms fire placed approximately 1–2 feet above the ground surface) to limit defensive small arms fire, then maneuvered systematically up the hillsides under shellfire. Neither side employed supporting fire from tanks or armored personnel carriers (APC) to protect attacking troops.\nOnce inside the trench line, troops of both forces were forced to eliminate bunkers individually, using hand grenades, explosive charges and occasionally flame throwers, resulting in heavy casualties to the attackers. For the UN forces, infiltration of cleared bunkers by bypassed PVA was a problem throughout the battle and hand-to-hand combat was a frequent occurrence.\nEvacuation of casualties was made hazardous by almost continuous artillery fires from both sides. The 7th Division made extensive use of tracked M-39 APCs to evacuate casualties and to protect troops involved in the resupply of water, rations, and ammunition, losing one during the battle. In addition the UN forces employed on-call, pre-registered defensive fires called flash fire to defend its outposts, in which artillery laid down an almost continuous box barrage in a horseshoe-shaped pattern around the outpost to cover all approaches from the PVA side of the main line of resistance.\nUS losses were 104 dead, including 63 in the 31st Infantry with only seven survivors, 31 in the 17th Infantry and 10 among engineers and artillery observers, and 373 wounded. PVA losses were unknown.\nA 1959 movie, Pork Chop Hill, based on S.L.A. Marshall's account of the battle, presented a semi-fictional account of the engagement, in which Lt. Clemons was portrayed by Gregory Peck and Lt. Russell by Rip Torn.\nSecond battle (6–11 July)\nRebuilding the defenses\nThe 7th Division rebuilt its defenses on Pork Chop Hill in May and June 1953, during a lull in major combat. Final agreements for an armistice were being hammered out and the UN continued its defensive posture all along the MLR, anticipating a ceasefire in place.\nNight surprise attack\nOn the night of 6 July, using tactics identical to those in the April assault, the PVA again attacked Pork Chop. The hill was now held by Company A, 17th Infantry, under the temporary command of 1st Lt. Alton Jr. McElfresh, its executive officer. Company B of the same regiment, in ready reserve behind the adjacent Hill 200, was immediately ordered to assist, but within an hour, Company A reported hand-to-hand combat in the trenches. A major battle was brewing and division headquarters ordered a third company to move up. The battle was fought in a persistent monsoon rain for the first three days, making both resupply and evacuation of casualties difficult. The battle is notable for its extensive use of APCs in both these missions.\nOn the second night, the PVA made a new push to take the hill, forcing the 7th Division to again reinforce. Parts of four companies defended Pork Chop under a storm of artillery fire from both sides. At dawn of 8 July, the rain temporarily ended and the initial defenders were withdrawn. A fresh battalion, the 2nd Battalion of the 17th, counter-attacked and re-took the hill, setting up a night defensive perimeter.\n7th Division counterattacks\nOn both 9 and 10 July, the two sides attacked and counter-attacked. A large part of both PVA divisions were committed to the battle, and ultimately five battalions of the 17th and 32nd Infantry Regiments were engaged, making nine counter-attacks over four days. On the morning of 11 July, the commander of US I Corps decided to abandon Pork Chop Hill to the PVA and the 7th Division withdrew under fire.\nResults and losses\nFour of the thirteen US company commanders were killed. Total US casualties were 243 killed, 916 wounded, and 9 captured. 163 of the dead were never recovered. Of the Republic of Korea Army KATUSA troops attached to the 7th, approximately 15 were killed and 120 wounded. PVA casualties were estimated at 1,500 dead and 4,000 wounded.\nAccording to 抗美援朝战争卫生工作总结 卫生勤务 (Summarization of Medical Works in the War to Aid Korea and Resist America), 6,800 soldiers of 67th division were involved in 1953 summer battles for five days, among them 533 were killed and 1,242 were wounded. Less than three weeks after the Battle of Pork Chop Hill, the Korean Armistice Agreement was signed by the UN, PVA and North Korean Korean People's Army, ending the hostilities.\nNotes\n;Citations\n;Bibliography\n*\n* Medical Department of General Logistics of Chinese People's Liberation Army (1989).抗美援朝战争卫生工作总结 卫生勤务. People's Military Medical Press.\n*\n*\n*\nExternal links\n* [http://www.thecajuns.com/waleblanc.htm A Survivor of the Korean War Battle of Pork Chop Hill]\n* [https://web.archive.org/web/20061109043603/http://www.historynet.com/magazines/military_history/3034286.html James Marino, \"Battle on Pork Chop Hill,\" Military History April 2003, on-line copy]"
    }
  ]
}