{
  "content": [
    {
      "type": "text",
      "text": "# Battle off Mukah\n\n| combatant1        =\n| combatant2        = Moro Pirates\n| commander1        =  John Brooke\n| commander2        = unknown\n| strength1         = 1 steamer1 gunboat\n| strength2         = 6 prahus\n| casualties1       = ~1 killed~2 wounded1 steamer damaged1 gunboat damaged\n| casualties2       = ~100 killed or wounded4 prahus sunk1 prahu damaged\n| notes             =\n| campaignbox       =\n}}\nThe Battle off Mukah was a naval engagement fought in May 1862 between boats of the Sarawak and pirates. After the kidnapping of Sarawakian citizens some time before, two small gunboats encountered the pirates off Mukah on the northern coast of Borneo. In an unusual action, the Rajah Muda, Captain John Brooke, then the heir apparent to be White Rajah of Sarawak, led his force in the defeat of six pirate ships and the rescue of captured civilians.\nBackground\n, ]]\nThe pirates who participated in the battle were Illanuns of the Moro pirates from the southern Philippines. They had raided several coastal settlements in 1862 and the years preceding so many men and women were being held prisoner or worked as galley slaves on board the pirates' prahus. A prahu was a type of large primitive sailing vessel with about a ten-foot beam and usually over forty feet long, which could also be propelled by oars.  Armed with three brass swivel guns each, they were roofed by a bamboo cover to protect the ammunition and provisions from rain and to provide a platform to fight from. Sulu pirates sheltered in bays along the coast during the trading season to prey on merchant shipping passing from places like Singapore, Penang, or China back to the Americas or Europe. In response to the affair, Captain Brooke headed down the coast from the town of Sarawak, in May 1862 to build a fort at Bintulu and release the captives at Mukah. He had with him his eighty-foot screw-steamer named Rainbow, under the command of Captain John Hewat, armed with two 9-pounder cannons, one 12-pounder and one 4-pounder, the latter two were meant to be offloaded for use at the fort. Also present was the gunboat Jolly Bachelor. and armed with two brass 6-pounder guns and two small swivels.\nWhile in transit the captain was informed that six prahus were anchored off the port of Mukah, and their crews were raiding the town. So when he arrived at Bintulu the labourers were put ashore to construct the fort and ten Sarawakian soldiers joined the Rainbows small crew to strengthen it before the coming battle. The Sulus themselves were heavily armed with muskets, pistols, swords, knives, spears so the men of the Sarawakian vessels placed mattresses and other improvised bulwarks on the upper decks to protect their legs from \"ugly hits\" according to Bishop Francis Thomas McDougall of Labuan, who was present during the battle on board the Rainbow. In all there were eight Europeans involved and a few dozen Sarawakian soldiers and sailors.\nBattle\nhad been battling with pirates from the southern Philippines since 1843. The Jolly Bachelor is on the left of this picture]]\nThe two ships began their journey down the coast again, shortly finding three of the prahus. The water was shallow and the Rainbow had the Jolly Bachelor in tow; her captain, the Rajah Muda, intended to release the smaller ship as soon as they were in a good firing position. Brooke confirmed with his Sarawakian crew the prahus were pirate.  As soon as the Sulus realised they were under attack they began killing the captives while fleeing to dangerous waters. Father McDougall later described the engagement: \"So we took to our stations, loaded our guns, and prepared for action. The leading boat had already gained on the other two and was going nearly as fast as the steamer herself. I never saw fellows pull so. We put on all steam, cast off the Jolly, and tried to get in between her and the point, but she beat us, and passed inside of us into shallow water, where we could not follow. Then she opened her fire upon us, which we returned with interest. She, like the others, had no heavy guns, but they all carried three long brass swivels, called lelahs, and plenty of rifles and muskets.\" The bishop went on to say that one of the captured pirates revealed to him that each of their swivels took seven men to lift and there were forty rifles and muskets aboard each boat, or more.\nCaptain Brooke's plan, after casting off the Jolly Bachelor, would be to ram the prahus while keeping them engaged so as to prevent the pirates from boarding and overwhelming the Sarawakians. McDougall wrote; \"Our plan of action was to silence the brass guns with our rifles, to shake them at their oars with grape and round shot, until we could run into them without their being strong enough to board us. The steamer was kept dodging about within range until the time came to run in; then we got into a good position to put on all steam and given them the stem, which was always admirably and coolly done by Captain Hewat whenever the order was given by the Rajah Mudah.\" After the first prahu got away the attention was turned to the second boat which was sailing for the shore and when the Rainbow was 200 yards away the Sulus opened fire with all of their guns. For the next few minutes Brooke chased the prahu at full speed before running right over it and sinking her. The Sarawakians called out to the survivors to hang onto the wreckage and wait for rescue, they then went after the third prahu but the Rainbow ran aground in less than two fathoms of water.\nThe guns were still operable so Brooke had his men return the pirates' fire. No hits were made but near hits forced the pirates to leave their wounded and abandon ship without fighting. Brooke then decided on rescuing the survivors though most of the Sulus took their weapons into the water and continued to fight. The captain also had his men refloat the steamer which was done somewhat easily. Few pirates were recovered according to McDougall and when they saved all that could be, the Rainbow and the Jolly Bachelor continued on slowly down the coast. During this time one of the pirates said that there were three more prahus nearby which were waiting for the three already engaged to rejoin them. After an hour the weather was very calm and a lookout at the masthead spotted the three enemy ships to the starboard, lining up to bear their bow guns on the approaching steamers. However, when the wind picked up again the pirates changed their tactics and hoisted sail to move their ships into broadside position. As the Sarawakians neared the pirates they opened up with their swivels but Brooke waited until his ships were 250 yards away before he gave his men the order to return the fire.\nMcDougall reported that the final three prahus did not attempt to escape like the first three had and they fought with determination even after all of the Sarawakian guns were brought to bear on them. One of the prahus was run over just as the second and split in two while the largest and final vessel was destroyed by gunfire and sank with a valuable cargo of gold and jewels. McDougall later said: \"The poor captives, who were all made fast below as we came up to engage them, were doubtless glad when our stem opened the sides of their ships, and thus let them out of prison. Few, comparatively, were drowned, being mostly all good swimmers. All those who were not lashed to the vessels, or killed by the Illanuns, escaped. Our decks were soon covered with those we picked up, men of every race and nation in the Archipelago, who had been captured by the pirates in their cruise, which had already lasted seven months.\" McDougall also confirmed the loss of at least one dead and two wounded while several of the pirates were killed or wounded, most having been hit by cannon and rifle fire. In all at least 100 Sulus became casualties while many others escaped to the shore and retreated into the jungle.\nAftermath\nOf the rescued most were from Singapore, including the women and children, though there were Chinese slaves and two British subjects as well. They described to the bishop the ways in which they had been tortured by the pirates. One way was that the Illanuns had them drink salt water only, mixing four parts of salt for every three parts of fresh water. They would also rub cayenne pepper into the eyes of their slaves whenever they became too tired to continue rowing. The prisoners could not escape because if they had a chance to jump over the side, the Sulus had a three barbed spear ready and if struck by one the victim could \"no longer swim nor run\" and would either drown or be retaken. McDougall helped the wounded after they started to come aboard and he described one Singapore Bugis woman as nearly starved to death. Father McDougall claimed he never missed one shot out of the eighty rounds he fired with his rifle. He also said that by the end of the battle, all of their ammunition for the 9-pounders was gone and there were only a few caps and cartridges remaining for the small arms.\nThe 12-pounder was also knocked out of action early in the engagement and apparently could not be repaired. The bishop said that had another prahu been found, they would have had a difficult time in repulsing or destroying it. When the fighting was over both of Brooke's ships were damaged in some way so he set a course for home and successfully delivered the captives to safety without further opposition from the Sulus.\nLiterature\n*\n*\n*\n*\n*\nReferences"
    }
  ]
}