{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Maqongqo\n\n| combatant2  = Dingane faction (Zulu Kingdom)\n| commander1  = Nongalaza KaNondela   Andries Pretorius\n| commander2  = Ndlela kaSompisi\n| strength1   = 5,000\n| strength2   = 5,000\n| casualties1 = Unknown\n| casualties2 = Unknown\n}}\nThe Battle of Maqongqo was fought on 29 January 1840 during the First Zulu Civil War.  Due to military defeats, the Zulu king Dingane had lost the respect of a significant portion of the Zulu people. His brother Mpande sought to separate his followers from Dingane and drew support from an alliance with Boer settlers led by Andries Pretorius.\nDingane agitated for Zulu unity, and Mpande attacked Dingane's compound resulting in the battle of 29 January 1840. Mpande and his supporters were victorious. Shortly thereafter Dingane was murdered and Mpande became king of the Zulus.\nBackground\nThe Boer settlers under Pretorius had inflicted a crushing defeat on Dingane in 1838 at the Battle of Blood River, allowing them to carve out territory and create the Natalia Republic. As a result, the king's authority had been severely weakened. His attempt to reassert his leadership by expanding his territory to the north led to another defeat at the hands of the Swazi in 1839.\nIn 1839, fearing that Dingane intended to kill him, to rid himself of a possible rival for the throne, Mpande had fled across the Thuleka river with 17,000 of his followers. Thus began the First Zulu Civil War. Mpande had made a deal with Boers that he would grant them substantial land and cattle in St. Lucia Bay if they helped to install him as king. The Boers had readily agreed to Mpande's proposal[1] as they yearned for a feasible sea-harbour that was not under control of the British, such as Port Natal; a yearning that was again manifested two years later by their ill fated attempt to seize Port Natal at the Battle of Congella.\nThe military phase of the war started on 14 January 1840 when Mpande's general Nongalaza KaNondela crossed into Zululand with a force of around 5,000 impi, advancing along the coast towards Dingane's encampment, with Mpande and the Boers, under Pretorius, advancing separately across the Ncome River. The Boers had a force of 308 armed men and another 500 servants in fifty wagons. Dingane attempted to negotiate, but Mpande and Nongalaza refused to listen. Dingane's envoy Dambusa was summarily executed when he arrived at the Boer camp. Dingane then withdrew into the Maguda mountain region. Dingane's general, Ndlela kaSompisi took up a position on a group of hillocks known as the Maqongqo Hills. Nongazala's army soon caught up with them, but Pretorius' force was still a hundred miles away.\nBattle\nRather than wait for the Boers, Nongalaza decided to attack immediately. Both armies were around 5,000 strong. Both adopted the traditional Zulu Chest and Horns formation. The battle was fiercely contested for a while, but Dingane's demoralised men began to desert to the enemy. It is said that Nongalaza deceived Dingane's men by creating the impression that the Boers had arrived and were about to take to the field. When it looked as though his army might desert en masse, Ndlela ordered the withdrawal of his remaining forces. Wounded survivors were massacred by the triumphant Nongalaza, as were the wives of Dingane.\nDingane was furious, and had Ndlela strangled to death on the spot. However, this did not stop most of Dingane's remaining men dispersing back to their homes, leaving him with no effective force.\nAftermath\nThe Boers arrived on 6 February, having taken the opportunity to grab as much cattle in booty as they could. They proclaimed Mpande king, and returned to Natalia with 36,000 head of cattle. Dingane escaped with a few followers into Swaziland, but was murdered shortly afterwards by a patrol of Swazis and Nyawos. On 14 February 1840 Pretorius issued a proclamation stating that a large stretch of land extending from St. Lucia Bay was now the border between the Zulu kingdom and the Republic of Natalia.\nReferences\nExternal links\n*[http://www.zulu.org.za/index.php?product+55329 Maqongqo Battlefield, North Zululand]"
    }
  ]
}