{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Mollwitz__disambig_1\n\n|result=Prussian victory\n|combatant1=\n|combatant2= Austria\n|commander1= Frederick II Count Schwerin\n|commander2= Wilhelm Reinhard von Neipperg\n|strength1=21,60058 guns\n|strength2=15,800–19,00019 guns\n|casualties1=4,850 dead, wounded or missing/prisoners\n|casualties2=4,550 dead, wounded or missing/prisoners\n|campaignbox=\n}}\n| zoom = 5\n| float = right\n| nolabels = 1\n| width = 304\n| height = 160\n| title = The major battles of Frederick the Great\n| caption =\n| shapeD = n-circle\n| shape-colorD = navy\n| shape-outlineD = white\n| label-colorD = navy\n| label-sizeD = 12\n| label-posD = left\n| label-offset-xD = 0\n| label-offset-yD = 0\n| label1 =\n| mark-coord1 =\n| mark-title1 = Battle of Mollwitz on 10 April 1741\n| mark-description1 = Małujowice\n| shape-color1 = black\n| label-color1 = black\n| label2 =\n| mark-coord2 =\n| mark-title2 = Battle of Chotusitz on 17 May 1742\n| mark-description2 = Chotusice\n| shape-color2 = olive\n| label-color2 = olive\n| label3 =\n| mark-coord3 =\n| mark-title3 = Battle of Hohenfriedberg on 4 June 1745\n| mark-description3 = Strzegom\n| shape-color3 = maroon\n| label-color3 = maroon\n| label4 =\n| mark-coord4 =\n| mark-title4 = Battle of Hennersdorf on 23 November 1745\n| mark-description4 = Henryków Lubański\n| shape-color4 = maroon\n| label-color4 = maroon\n| label5 =\n| mark-coord5 =\n| mark-title5 = Battle of Lobositz on 1 October 1756\n| mark-description5 = Lovosice\n| label6 =\n| mark-coord6 =\n| mark-title6 = Siege of Pirna from 10 September to 14 October 1756\n| mark-description6 = Pirna\n| label7 = Prague\n| mark-coord7 =\n| mark-title7 = Battle of Prague (1757) on 6 May 1757\n| mark-description7 = Prague\n| label8 =\n| mark-coord8 =\n| mark-title8 = Battle of Kolín on 18 June 1757\n| mark-description8 = Kolín\n| label9 =\n| mark-coord9 =\n| mark-title9 = Battle of Rossbach on 5 November 1757\n| mark-description9 = Braunsbedra\n| label10 =\n| mark-coord10 =\n| mark-title10 = Battle of Leuthen on 5 December 1757\n| mark-description10 = Lutynia, Środa Śląska County\n| label11 =\n| mark-coord11 =\n| mark-title11 = Siege of Breslau (1757) from 7 December 1757 to 20 December 1757\n| mark-description11 = Wrocław\n| label12 =\n| mark-coord12 =\n| mark-title12 = Siege of Olomouc from 4 May to 2 July 1758\n| mark-description12 = Olomouc\n| label13 =\n| mark-coord13 =\n| mark-title13 = Battle of Zorndorf on 25 August 1758\n| mark-description13 = Sarbinowo, Gmina Dębno\n| label14 =\n| mark-coord14 =\n| mark-title14 = Battle of Hochkirch on 14 October 1758\n| mark-description14 = Hochkirch\n| label15 =\n| mark-coord15 =\n| mark-title15 = Battle of Kunersdorf on 12 August 1759\n| mark-description15 = Kunowice\n| label16 = Dresden\n| mark-coord16 =\n| mark-title16 = Siege of Dresden from 13 to 22 July 1760\n| mark-description16 = Dresden\n| label-offset-x16 = 5\n| label-offset-y16 = 5\n| label17 =\n| mark-coord17 =\n| mark-title17 = Battle of Liegnitz (1760) on 15 August 1760\n| mark-description17 = Legnica\n| label18 =\n| mark-coord18 =\n| mark-title18 = Battle of Torgau on 3 November 1760\n| mark-description18 = Torgau\n| label19 =\n| mark-coord19 =\n| mark-title19 = Battle of Burkersdorf (1762) on 21 July 1762\n| mark-description19 = Burkatów\n| label20 =\n| mark-coord20 =\n| mark-title20 = Siege of Schweidnitz (1762) from 7 August to 9 October 1762\n| mark-description20 = Świdnica\n}}\nThe Battle of Mollwitz was fought by Prussia and Austria on 10 April 1741, during the First Silesian War (in the early stages of the War of the Austrian Succession). It was the first battle of the new Prussian King Frederick II, in which both sides made numerous military blunders. Frederick fled the battlefield, but the Prussian Army managed to attain victory. This battle cemented Frederick's authority over the newly conquered territory of Silesia and gave him valuable military experience.\nBackground\n, ca 1762]]\nThe War of the Austrian Succession was sparked by the death of Charles VI in 1740 and the succession of his daughter Maria Theresa. The Habsburg monarchy was originally subject to Salic law, which excluded women from inheriting it; the 1713 Pragmatic Sanction set this aside, allowing Maria Theresa to succeed her father.\nThat became a European issue because the Habsburg monarchy was the most powerful element in the Holy Roman Empire, a loose federation of mostly-German states. Its position was threatened by the growing size and power of Bavaria, Prussia, and Saxony, as well as Habsburg expansion into lands held by the Ottoman Empire. The Holy Roman Empire was headed by the Holy Roman Emperor, which was, in theory, an elected post though it had been held by a Habsburg since 1437. France, Prussia and Saxony now challenged Austrian dominance by nominating Charles of Bavaria as Emperor.\nIn December 1740, Frederick II seized the opportunity to invade Silesia and begin the First Silesian War. With a population of over one million, the Silesian mining, weaving and dyeing industries produced 10% of total Imperial income. Under Kurt Christoph Graf von Schwerin, the Prussians quickly over-ran most of the province and settled into winter quarters but failed to capture the southern fortresses of Glogau, Breslau, and Brieg. Maria Theresa sent an army of about 20,000 men led by Wilhelm Reinhard von Neipperg to take back the province and assert herself as a strong monarch.\nAustrian army's advance north\nNeipperg's army caught Frederick II completely off guard as he lingered in the province, and surged northwards past Frederick and his army to relieve the city of Neisse, which was being besieged by a small Prussian force and had not yet fallen. Both Neipperg and Frederick rushed northwards in parallel columns, in a race to reach the city first. In atrocious weather, Neipperg reached Neisse first and set up camp there. Frederick II and his entire army were now caught behind enemy lines with a large Austrian force lying between him and the rest of his kingdom and his supply and communication lines cut off. Both sides knew that battle was now inevitable.\nPrussian preparations\nCaptured Austrian soldiers told Frederick the exact position of Neipperg's forces at Mollwitz, and the morning fog and snow allowed Frederick's army to advance undetected to within 2000 paces of Neipperg's camp. Most commanders would then have given the order to charge the camp and rout the Austrian army, but since Frederick had never fought a campaign or a battle before, he instead decided to deploy his army in a battle line. There was very heavy snow on the ground which caused snow-blindness, and Frederick miscalculated the distance to the river on his right. He deployed several of his units behind a bend in the river where they could take no part in the battle, and several more units were deployed perpendicular to his two battle lines on the right flank. It is said that Schwerin commented early on that Frederick miscalculated the distance, but he was ignored.\nAustrian preparations\nNeipperg was unprepared for battle when he discovered Frederick's entire army was approaching. Not only were Austrian troops still in bivouac and cooking food, but they were scattered across three villages with their front facing away from the Prussian advance. Had the Prussians attacked at this time, they would have encountered only disorganized resistance. Because of the two hour delay caused by Frederick dressing his battle lines, the Austrian army had the opportunity to concentrate its forces and form a battle line by the time the forces engaged one another just before 2 pm.\nBattle\nAt the beginning of the battle, the Prussians had the larger army. They also had three times the field guns than the Austrians had; however, the Austrian cavalry outnumbered the Prussian cavalry two to one. The Prussian forces advanced toward the Austrians in two lines while the Prussian artillery began bombarding the Austrian line. Six regiments of Austrian cavalry on the extreme left flank of the Austrian line, numbering 4,500 to 5,000 men and horses, were goaded by the Prussian bombardment to charge the Prussian right flank without orders from Neipperg. The charge shattered the Prussian cavalry, who received the attack while at a full halt. Frederick was with the Prussian cavalry and was caught up in its rout. This left the Prussian flank open to attack, and the Austrian cavalry then turned on the unprotected infantry. Schwerin, the Prussian military commander under Frederick, now advised the king to leave the battlefield because it looked as though the Prussian army was about to be defeated; Frederick heeded this warning. Abandoning the field, he was nearly caught and almost shot. Frederick's absence allowed Schwerin, a veteran general, to take command of the troops himself..\" (\"I had made the decision to win the battle or not to survive the defeat\")}}\n]]\nAt this point of the battle, the scene was chaotic. Having scattered the Prussian cavalry, the Austrian cavalry continued its attack on the Prussian infantry. They charged the infantry repeatedly. The firing of Prussian soldiers from the second line who were trying to stop the Austrians was also killing Prussian soldiers in the first line. When asked whether the Prussians would retreat, Schwerin answered \"Over enemy bodies\". The Prussian infantry, which had been rigorously drilled and trained under Frederick William I, held firm and continued firing rapid volleys into the Austrian cavalry, causing it tremendous losses and killing its commander, General Römer.\nAfter the repulse of the Austrian cavalry, Schwerin reformed the infantry and ordered infantry units that were short on ammunition to strip the dead of theirs. He then ordered the right flank of the Prussian infantry to advance toward the Austrian infantry line, with the left flank receiving the order to advance a few minutes later. This resulted in an oblique order attack on the Austrian infantry line with the right flank of the Prussians overlapping the left flank of the Austrians. In addition, the Prussian infantry's use of the recently invented iron ramrod, allowed them to fire 4–5 shots a minute with their flintlock muskets, which was three times more rapid than any other European army at the time. This combination of discipline and firepower quickly overwhelmed the Austrian infantry, which consisted of a large number of raw recruits lacking the training of the Prussian infantry. Soon, the Austrian line collapsed from left to right, and the Austrian army was routed from the field.\nAftermath\n.]]\nIn the end, the Prussians won a close victory against a numerically inferior enemy due to the leadership of Field Marshal Schwerin and the superior training of the Prussian infantry. After the battle, the Austrian army was not pursued and remained intact. Neipperg retreated to Neisse, remaining in Silesia to await reinforcements. Frederick returned to his army the morning after the battle, restored his lines of communication, and subsequently brought the siege of Brieg to a successful conclusion.\nAfter the battle Frederick censured himself for his mistakes and learned from them, writing later that Mollwitz educated him and his army. The battle showed that Frederick could depend on the superior training of the Prussian infantry in a battle, which had proven itself able to withstand the charge of Austrian cavalry. Realizing that the cavalry would have to be reformed to be able to hold its own against the excellently-trained Austrian cavalry, he soon instituted a training program to discipline the Prussian cavalry in coordinated action and precision that would increase its effectiveness in both reconnaissance and battle. Mollwitz also illustrated the effectiveness of the oblique order, a tactic Frederick would use in most of his later major battles.\nIn spite of the fact that the battle had been a near disaster for Frederick and was not won through his direct command, the victory raised his prestige in Europe by demonstrating that Frederick was capable of challenging the Habsburgs and emerging victorious. The Prussian victory also made it clear to Maria Theresa that she would not be able to reassert her control of Silesia easily and that Prussia was a military power that would have to be more carefully reckoned with. The defeat of Maria Theresa's army at Mollwitz encouraged other rulers to deny the Pragmatic Sanction and to claim much of the Habsburg territories amongst themselves. Within a few months, France, Spain, Bavaria, Saxony,  Savoy and Prussia became allies in a loose coalition known as the  League of Nymphenburg, widening the conflict into a larger European affair that would become known as the War of the Austrian Succession.\nNotes\nReferences\nCitations\nWorks cited\n* |publisher=Routledge|isbn=978-0582059504}}\n*   .\n*\n* }}\n*\n*\n*\n* }}\n*\n*\n*\n*\n* |publisher=Routledge & Keegan Paul|year=2015|isbn=978-0-7100-9649-4}}\n*\n* |isbn=9781317887935}}\n* |isbn=9780691053585}}\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n* |publisher=Farrar, Straus and Giroux|isbn=9780374711610}}\nExternal links\n*\n*\n*"
    }
  ]
}