{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Anguilla\n\n|result      = British victory\n|combatant1  =\n|combatant2  =\n|commander1  =  Arthur Hodge\n|commander2  =  Le Touché\n|strength1   = 150 soldiers\n|strength2   = 2 frigates  3 privateers  2 ship's tenders  759 soldiers\n|casualties1 = 7 killed or wounded\n|casualties2 = 35 killed or drowned  65 wounded50 captured\n|campaignbox =\n}}\nThe Battle of Anguilla was a military engagement that took place on the British controlled Caribbean island of Anguilla on 1 June 1745 during the War of the Austrian Succession. A French force landed 760 men and marched inland but were repulsed with heavy losses by the British who then counter-attacked forcing the French to flee causing the loss of 100 casualties as well as fifty captured.\nBackground\nThe War of the Austrian Succession had brought the fighting over to the rest of the French and British colonial territories in India and the Caribbean. Convoys and holdings of each nation were a target or a threat.\nIn 1744, a 300-strong British colonial force consisting of militia, slaves and regulars accompanied by two privateers from Saint Kitts invaded the French half of neighbouring Saint Martin, holding it until the 1748 Treaty of Aix-la-Chapelle. In late May 1745 two French royal frigates of 36 and 30 guns respectively under Commodore La Touché, plus three privateers sailed from Martinique in retaliation to invade and capture Anguilla.\nThe British on Anguilla were aware of the threat and thus readied themselves with around 150 militia and regulars from the islands small garrison.\nAssault\nOn 21 May early in the morning, they were surprised by a fleet of French, consisting of two warships, one of 36 Guns, the other of 32, with three Privateers, and two Dutch vessels, used as tenders. At a place named by his namesake Katouche Bay, Le Touché landed 759 men on shore. The surprise landing was a great encouragement to the French, but a great discouragement to the British seeing as they were heavily outnumbered. The Governor Arthur Hodge, formed their defenders into three platoons, and posted them in a very narrow path behind well hidden breast-works by which the French were to pass. The first of which would contain twenty-two men of regulars, commanded by Captain Richardson. In effect the French were advancing into carefully placed ambush. These engaged the French, firing by platoons regularly, and with a good accuracy, they took a heavy toll on the attackers. Within a few minutes the advance guard broke rank and soon fled. Within fifteen minutes the other sections repeated the same fate holding their ground as the rest of the French advanced and they also retreated.\nThe British then launched a counterattack pursuing the retreating French as they headed back towards their boats in the bay. The retreat turned into a rout as the panicked French tried to get into their boats. The French ships opened up fire on the British who halted their pursuit and then rounded up the prisoners. Many of the French attackers drowned as they tried to get to their boats.\nThe small British force expected a fresh attack the next day but the French encountering heavy resistance decided not to push on and thus withdrew to Martinique.\nAftermath\nIn this action at least 100 French were killed, drowned or wounded while another 50 were taken prisoner. The British buried 35 dead, and were in search of the few remaining French soldiers some who hid in the bushes including a few who were wounded. Among the dead were the second captain of Commodore Le Touché, the first lieutenant of the second warship; Captain Rolough from a privateer; the Governor of Saint Barthélemy’s son, and several other officers.\nTouché set on shore a flag of truce to ask for prisoners back in exchange for articles such as food, wine and stores. Touché was wounded in his arm and thigh.\nThe British force had suffered seven casualties but had captured two French colours, many firearms, cartouch boxes, hand grenades and swivel guns. According to the governor, the spoils were given to the black population of the island as a reward for their assistance in the defence of the island.\nReferences\nBibliography\n*\n*\n*"
    }
  ]
}