{
  "content": [
    {
      "type": "text",
      "text": "# Battle of the Pelorus\n\n}}\n}}\nThe Battle of the Pelorus river was fought in the spring of 65 BC between a Roman Republican army under the command of the Roman general Gnaeus Pompeius Magnus (better known as Pompey the Great) and an Iberian army commanded by king Artoces of Iberia. The battle was fought near the Pelorus river in the centre of Iberia and ended in a stunning victory for the Roman army.\nPrelude\nAfter Pompey's defeat and subjugation of king Oroeses of the Albani, king Artoces king of the Iberians was concerned that his kingdom would be invaded next. He adopted a more subtle strategy and turned to diplomacy promising the Romans unconditional friendship. Pompey accepted the terms but he was alerted by his intelligence service that the Iberians were secretly planning an attack.\nIn the spring of 65 BC he marched his forces into Iberia and caught Artoces who was still preparing, off guard. Pompey's forces quickly captured a pass into Iberia by seizing the fortress of Harmozike. Artoces fled, but Pompey pursued him into the centre of Iberia and finally caught up with him near the Pelorus river.\nBattle\nArtoces main strength lay in his archers, but, using tactics reminiscent of the Athenians at the Battle of Marathon, Pompey disabled them by means of a rapid infantry charge, which brought his legionaries into close quarters before the enemy fire could take effect. At close quarters the Roman legionaries were at a distinct advantage (legionaries excelled at close quarter fighting) and the battle was soon over. Greek historian Plutarch called this battle a great battle and noted that Iberian casualties consisted of approximately 9,000 people, while more than 10,000 were taken captive by the Romans.\nAftermath\nArtoces managed to escape as the Roman pursuit party being hindered by the flooded Pelorus river. Eventually the king was forced to turn to diplomacy once more. He sent valuable objects made of gold to Pompey and asked for a truce. Pompey demanded Artoces' children as hostages and, when the king delayed making a decision, Pompey led his army further into Iberia and left Artoces with no choice. He submitted, gave up his children as hostages and signed a peace treaty with the Romans under which the Kingdom of Iberia was to be a friend and ally of the Roman Republic.  Pompey then marched north-west towards Colchis.\nReferences\nModern sources\n* John Leach, Pompey the Great, 1978.\nAncient sources\n* Plutarch, Life of Pompey, 35.\n* Appian, Bella Mithridatica 103, 117.\n* Eutropius 6.14 Artaces.\nBiography\n*"
    }
  ]
}