{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Plaman Mapu\n\n| result            = British victory\n| combatant1        =\n| combatant2        =\n| commander1        =  John Williams\n| commander2        =  Soemadji\n| strength1         = 35 paratroopers\n| strength2         = 350–400 regulars\n| casualties1       = 2 killed8 wounded\n| casualties2       = 50 killed35 wounded\n| campaignbox       =\n}}\nThe Battle of Plaman Mapu (27 April 1965) was one of the largest battles of the Indonesia-Malaysia Confrontation, a protracted undeclared war between Indonesia and a British-led Commonwealth of Nations over the creation of a new Malaysian state. The battle occurred as a result of an Indonesian effort to storm a British hilltop base at Plaman Mapu, on the border between the Malaysian state of Sarawak and Indonesia.\nIn the early hours of 27 April 1965, a crack battalion of Indonesian soldiers launched a surprise attack on 'B' Company, 2nd Battalion of the Parachute Regiment in their base at Plaman Mapu. The British garrison was outnumbered by at least five to one, but it managed to repel the Indonesian assault after an intense two hour firefight. Acting commanding officer Sergeant-Major John Williams received a Distinguished Conduct Medal for his role in the action. Relief units soon arrived by helicopter, but the battle had concluded by this point.\nThe battle was the last attempt by Indonesian forces to launch a major raid into Malaysian territory, and was a propaganda disaster for the Indonesian government. Dissent grew in military and political circles, particularly over the perceived foolishness of incumbent President Sukarno in continuing the conflict, and on 30 September elements of the army revolted against him. Despite the speedy defeat of the rebels, Sukarno's rivals, particularly in the army, blamed the uprising on him and the Communist Party of Indonesia (PKI). The conflict subsequently began to wind down, and a peace treaty ending the Confrontation was signed in August 1966. The increasingly unpopular Sukarno was forced to step down from office the next year.\nOrigins\nIn 1957, Malaya received its independence from Britain as part of their decolonisation process in that region. The British government, in their reorganisation of the region following their departure, sought to combine Malaya with Singapore and the states of Sarawak, North Borneo, and Brunei to form a new 'Malaysian Federation.' This would serve British interests in these regions, particularly military basing rights, which they hoped the Malaysians would protect. Indonesia, however, and in particular President Sukarno, was fiercely opposed to such a project. Sukarno, who was leaning ever closer towards the Communist bloc of China and Russia, despised the 'imperialist' British, and had planned to incorporate the latter three regions, all of which are located on the northern tip of Borneo, with the Indonesian-controlled territory of Kalimantan, which makes up the vast majority of that island. Sukarno determined to begin a military Confrontation with Malaysia, which through a series of raids and supported revolts might improve Indonesia's position in negotiating for the island.\nThe context of the Confrontation in the murky chapters of Indonesian politics is extremely layered. Sukarno's choice of pursuing this strategy would come at the expense of an important program aiming at the rehabilitation of the damaged economy, as it relied upon funding from Britain and America, who would not support the strengthening of another Communist power forming in Asia. However, the Indonesian populace and much of the government, who had recently fought their way from the hands of Dutch rule, would likely not support the economic program as it would seem as if Indonesia was sliding back into the embrace of the 'imperialist' powers of the West. The proposal was also beginning to lose support from the army, as they learned that demobilisation and lessening of funding that the program entailed would affect them adversely. Confrontation, on the other hand, might serve as a far more stabilising force, as it garnered support from both the Communists and the military, whose internecine political conflict weakened Sukarno's government. A campaign could keep the army busy while the Communists became accepted into mainstream Indonesian politics, which the Communist Party of Indonesia (PKI) found favourable. The nationalist-leaning army was content to fight the Malaysians to both remove British influence from the region as well as to establish Indonesian dominance in Southeast Asia. Some of the military high command thought that conflict could solidify a central role for the army in Indonesian politics, as well as increase their budget and return the country to martial law, which would greatly empower the military. Short of all-out war, the military was largely supportive of Confrontation.\nThe first blood was shed deep in Malaysian territory, with the Indonesian-staged Brunei Revolt on 8 December 1962. This operation, with the goal of seizing the oilfields as well as European hostages, was swiftly crushed by British forces that flew in from Singapore. The conflict proper, however, began in April of the following year, as 'volunteer' Indonesian forces made occasional raids across the Sarawak border. These raids were small, generally composed of groups smaller than platoon size, and their damage was minimised with relative ease by local security forces. The turning point came on 16 September, when the Malaysian Federation was formally created. In Indonesia, the response to the frustration of their plans to prevent the Federation's birth was serious and violent. A mob converged upon the British embassy in Jakarta, smashing windows and doors in protest. Sukarno authorised stronger raids by Indonesian regular forces, and even launched seaborne attacks into peninsular Malaysia. The raiding would continue for the duration of the conflict.\nOperation Claret\non a Claret patrol deep in the Borneo jungle]]\nThe British had numerous issues in dealing with the expanding crisis. A defensive battle had been proven unsound by the immense amount of time and resources expended pursuing a similar course during the twelve year Malayan Emergency that had ended only a few years before, as well as Dutch efforts to quell the Indonesian rebels during the Indonesian War of Independence, but launching an offensive into Indonesian territory to take the initiative would bring the conflict into an all-out war, and this was unacceptable to Cabinet policy-makers. At the same time, an effective solution had to be found that did not cede Malaysia to the Communists, a move that many feared would be the beginning of the 'domino effect' in Asia. The proposal selected as the most effective was presented to the Cabinet in January 1964 by Richard Austen Butler, who recommended that Britain continue fighting without declaring war, with the conflict contained in Borneo, a strategy designed to weary the Indonesians of battle until the necessity of economic reform overcame them and peace was made.\nThe actual implementation of this strategy was left to the commander on site, Major General Walter Walker, a veteran of the Burma Campaign of the Second World War who had learned the hard lessons of the Malayan Emergency. Walker realised that a defensive strategy would leave all British forces tied down defending their bases, and instead determined to take the initiative from the aggressive Indonesians. Walker ordered that one-third of a unit should be left defending its base, which would be one of many along the border, while the remainder patrolled the jungle, foraying into Indonesian territory and attempting to keep them tied down at their headquarters instead. Thus, the British would attempt to control the jungle through guerrilla warfare. In implementing this idea, Walker was presented with a considerable dilemma. His instructions, similar to most colonial commanders, ordered him to use 'minimum force' so as not to provoke Sukarno into escalating the conflict. However, Walker had to apply a certain level of destructive power to cow the aggressive and assertive Indonesians.\nThe combination of these tactical and political necessities shaped Walker's eventual stratagem, which culminated in what would be known as Operation Claret. This involved elite British light infantry roaming the jungle, attacking Indonesian bases and patrols at will and trying to give the appearance of being everywhere at once for psychological effect upon the enemy. Initially launched only over short distances, seaborne raids by Indonesian volunteers into peninsular Malaysia caused the range to be extended throughout 1964 and 1965. Walker continued the Claret raids to great effect until the end of his tenure, being replaced by Major General George Lea as commander of British forces in Borneo. Lea, however, had the ill fortune of being ordered to take command just as the conflict began to reach its climax in the spring of 1965. Sukarno, desperate for a decisive victory and apprehensive of the effect that the fruitless conflict was having upon his country, was beginning to order stronger attacks to win a decisive military victory and drive the British from the border lines.\nBattle\nPlaman Mapu was a tiny Malaysian village situated less than 2 km behind the western part of the border between Sarawak and Kalimantan. There the British had established a base for 'B' Company of the 2nd Battalion, the Parachute Regiment. Apart from the two 3-inch mortars stationed there, the place had little strategic value beyond serving a lookout point for the detection of Indonesian raiders crossing the border. By the low standards of the makeshift British jungle bases, it was fairly well defended, being equipped with aforementioned mortars, an interconnected trench network, and a command bunker, with supporting artillery weapons within range of the base to supply cover. The defenders of the base, by contrast, were wholly unprepared for combat. The undermanned 'B' Company had recently been supplied with a platoon of inexperienced troopers who had little experience with jungle warfare. Due to the intensity of recent fighting, the base commander, Lieutenant Colonel Ted Eberhardie, had only been able to spare a few of the new men for a training course in such combat at Singapore, but one of those was Sergeant Major John Williams, who would play a crucial role in the coming battle.\nTension had been building among the base's staff in recent days, and most suspected that an attack would come against one of the border stations in the near future. Ample evidence of the coming attack was discovered by British patrols, but signs of enemy troop movements were disregarded and newly cleared positions were mistaken for ambush sites. Thus the base was continually left with the bare minimum number of men as the majority that could be spared went out on patrol. As a result of these conditions, only 36 men were present in the base in the early morning hours of 27 April 1965 when it came under ferocious attack by 150 to 400 Indonesian troops, supported by artillery and rocket fire. Immediately, the Indonesians swarmed into one segment of the trenches and destroyed one of the two mortars.\nIndonesian artillery fire continued to rain down on the camp, wounding several men and sending the defenders into disarray. Sergeant-Major Williams rushed to the headquarters to order the artillery officer to bombard the taken positions before attempting to organise a counterattack himself. Whilst under heavy Indonesian fire, Williams gathered a section of defenders who had taken refuge in a slit trench and led them towards the captured outer positions. A shell landed among the group and wounded half of them, but Williams and the remainder engaged at least thirty Indonesian infantry who had been firing into the base from the trench in vicious hand-to-hand combat and managed to push them from it with minor casualties. Williams then looked to secure the perimeter, but seeing that the Indonesians were massing for a second attack, he sat down in a vacated machine gun nest and sprayed the new wave of attackers, who attempted to seize the command bunker, with fire. This was not without cost, and Williams was fortunate to have escaped with a single head wound, which nevertheless blinded him in one eye, though he did not notice this in the heat of battle. Williams then began to receive supporting rifle fire from other British troops in nearby trenches, as well bombardment from the single remaining mortar and some 105mm artillery emplacements from a nearby camp.\nAfter an hour and a half had gone (and twenty minutes had passed since the second attack) the Indonesians launched a third and final attack up the slope towards the base, which the British responded to with artillery and grenade fire. This defence was remarkably effective, and eventually the barrage of Indonesian rocket fire halted and the few remaining British soldiers rose from their hideouts and began to clear the perimeter. Soon afterwards, Gurkha soldiers and medical staff arrived at the base by helicopter, leaving the soldiers behind to secure the area and airlifting the wounded to a nearby hospital. By this point, however, Indonesian forces had withdrawn, effectively ending the battle.\nAftermath\nDespite the sheer intensity of the fighting and the number of Indonesian troops, final casualty numbers are placed at a surprisingly low 2 killed and 8 wounded on the British side. The British in turn inflicted at least 30 casualties upon the Indonesians, but an exact number cannot be determined.\nThe Battle of Plaman Mapu is, by most accounts, considered a turning point in the Confrontation. Never again was such a powerful and concentrated cross-border attack attempted by the Indonesian Army. Within months Indonesia was convulsed by revolution, and as peace was secured in the next 12 months as the conflict ground to a halt. This was in part due to the actions of Lea, who responded by establishing a no-man's land  inside the Kalimantan frontier, through a series of intensive Claret raids, to \"make absolutely clear to the Indonesians that their proper place was behind their own frontier.\"\nWilliams was consigned to a six-month hospital leave and numerous surgical operations due to the injuries sustained during the battle. His actions were recognised as one of the most excellent examples of leadership, bravery, and professionalism during the campaign, receiving the Distinguished Conduct Medal the year after.\nThe Fall of Sukarno and the End of Confrontation\n, whose role in the Confrontation led to his fall from power in 1967]]\nThe action at Plaman Mapu was also a key factor in turning the tide of political opinion against the increasingly beleaguered Sukarno. Defeat in what was intended to be a highly publicised victory helped to break the fracturing patience of the army generals on the right and unite them against what they now saw to be the destructive force of Sukarno and the Communist Party. Tensions between the army and the Communists, already high, peaked on 30 September, when elements of the army, likely Communist, kidnapped and murdered six high-ranking army generals whom they accused of planning a CIA-sponsored coup against the President. Army Reserve Commander Suharto at Sukarno's behest took control of the army and crushed the revolt, but the damage had been done. The army blamed the revolt on the Communists, and excited an anti-leftist fervour among the populace that contributed to the subsequent anti-Communist Purge, where high-ranking members were executed along with hundreds of thousands of suspected collaborators with millions imprisoned. This move almost eliminated the Communists from power and left Sukarno alone and isolated.\nWithout the support of the Communists, the increasingly unpopular and destructive Confrontation quickly came to an end. Secret talks between Malaysia and Indonesia were held throughout late 1965 and early 1966, and a peace treaty was signed in August of the latter year. Sukarno was toppled from power by the generals on accusations of collaborating with the rebels and replaced by Suharto as president on 12 March of the following year. The conflict had been an unqualified success for Britain and the West, as she had subdued a rising Communist power in Asia and prevented the 'domino effect' from taking off. And from a purely tactical standpoint, it had been a strong performance from British troops and commanders, as they had managed to confine a brewing disaster on a Vietnamese scale to a relatively small bush war that had a relatively small human cost and stabilised a potentially dangerous political situation of South East Asia.\nReferences\nSources\n*\n*\n*\n*\n*\n*\n*"
    }
  ]
}