{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Moiry Pass\n\nThe Battle of Moiry Pass was a military engagement between a Scots-Irish army commanded by Edward Bruce, brother of Robert Bruce, king of Scotland and a Hiberno-Norman force. It took place during the First War of Scottish Independence and more precisely the Irish Bruce Wars. Edward Bruce attacked a garrison of soldiers from the Lordship of Ireland, as part of his attempt to revive the High Kingship of Ireland. Bruce considered the battle a great success but his campaign would ultimately fail.\nBackground\nAfter the Norman invasion of Ireland in 1169, the Lordship of Ireland was created with the king of England as lord, represented locally by the Lord Lieutenant of Ireland. The country was divided between the Gaelic dynasties that survived the Norman invasion and the Hiberno-Norman Lordship of Ireland.\nEdward Bruce, Earl of Carrick, invaded Ireland on 26 May 1315, with the full support of his brother, Robert the Bruce. A number of MacDougalls and their allies had fled to Ireland and the Bruces saw it as another front in the ongoing war against Norman England. Edward's 6,000 troops landed unopposed near Larne He defeated an of his brother's father-in-law, Richard Óg de Burgh, 2nd Earl of Ulster, led by Thomas de Mandeville, before moving on to take the town of Carrickfergus.\nBattle\nIn late June, Edward proceeded from Carrickfergus along Magh Line (Six Mile Water), burning Rathmore, near Antrim town, which was a holding of the Savages. He then went south by way of the Moiry Pass. Here he was met by Mac Duilechain of Clanbrassil and Mac Artain of Iveagh, both of whom had submitted to him at Carrickfergus. Their attempted ambush ended in their defeat, and Bruce gained some supplies from the fleeing Anglo-Irish. According to the 14th-century account by John Barbour, the Scottish troops were led in the battle by Thomas Randolph, Earl of Moray, who had them fight on foot as was typical.\nDundalk\nMoving southwards, they burned Rathmore and destroyed De Verdon's fortress of Castleroache near Dundalk. Outside the town Bruce encountered an army led by John FitzThomas FitzGerald, 4th Lord of Offaly, his son-in-law Edmund Butler, Earl of Carrick and Maurice FitzGerald, 4th Baron Desmond. The Scottish push them back towards Dundalk and lay waste to the town and its inhabitants.\nAt Ardee they set fire to the church in which a number of people had taken refuge and all were burned to death.\nAlthough Bruce had a large army, he was losing large amounts of forces at every battle he was involved in. By 1318, Bruce had only 2,000 men left. At the Battle of Faughart, Bruce fought the lordship with all of his surviving men. Bruce was killed by John de Bermingham at the battle and Bruce was buried at a cemetery above Faughart.\nReferences"
    }
  ]
}