{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Mill\n\n}}\nNetherlands\n|combatant2 =  Germany\n|commander1 =  A. A. van Nijnatten\n|commander2 =  Gerhard Kauffmann Friedrich Weber\n|strength1 = 2,00020 field guns3 anti-tank guns47 casemates\n|strength2 = 30,00015 mortars2 field guns3 anti-tank guns1 armoured train1 troop train37 light bombers\n|casualties1 =30 killed50 wounded\n|casualties2 =500+ killed & wounded1 armoured train derailed1 troop train destroyed\n|casualties3 =9 civilians killedheavy damage inflicted upon the surrounding farms\n|campaignbox =\n}}\nThe Battle of Mill was a day long struggle in and around the Dutch village of Mill along the  Peel-Raam line on the first day of the invasion of the Netherlands in 1940. Although the Germans broke through, they suffered heavy casualties and were delayed in their advance by one day.\nBackground\nGerman forces favoured an attack on Mill in North Brabant for several reasons. The eastern approach was covered by thick forest, there was no swampland in front, and once inside there would be a number of roads and nearby railway that could be used to push westward.\nCovering the Peel-Raam Line in the area was an anti-tank ditch lined with barbed wire and 47 casemates. The line was manned by 2 battalions, equipped with four 57mm field guns. These were supported by an artillery battalion station west of Mill, armed with twelve antique 8 cm staal field guns. A company of engineers was also stationed in the area, responsible for barricading roads and prepping bridges for demolition. They were equipped with a special railway barricade referred to as \"asparagus\". During the battle smaller units would be ordered to reinforce the position at Mill. It was planned that they be backed up by the Dutch 3rd Army Corps, but this was not to be. Overall, the Dutch would utilise approximately 2,000 men.\nThe Germans planned to spearhead the assault with two trains carrying the 3rd battalion of the 481st regiment. They were to be shortly thereafter joined by the rest of the 256th Infantry Division. However, issues with transportation over the Maas river would mean that the whole division wouldn't reach Mill until noon. They would be without their heavy artillery.\nBattle\nThe German armoured train and troop train passed through the border unopposed and arrived in the town of Zeeland at 04:30. The Dutch forces, unaware of the invasion, had been completely surprised and didn't have time to open fire. The German troops disembarked at the Zeeland train station and radioed that they had successfully penetrated the Dutch lines. Disappointed that they hadn't made contact with the Dutch, the armoured train was sent back to the border. Now fully aware of the situation, Dutch engineers installed the asparagus barricade over the tracks and reinforced it with several mines.\nUnable to stop in time, the armoured train crashed into the obstruction, derailing and sending the first carriage into the ditch. The small unit on board quickly disembarked and captured two away-facing casemates. They were then pinned down by rifle and machine gun fire, and retreated to train. Unable to penetrate the armor plating with their machine guns and rifles, the Dutch called in artillery support. This forced the Germans to take cover in the ditch, unable to effectively return fire. At around 05:00, General Adrianus Antonius van Nijnatten, the commander of the 3rd Army Corps, telephoned the Dutch general headquarters to report that the Germans had seized a bridge at Gennep intact and that a train had broken through near Mill. He was authorised to dispatch the 2nd Hussars-Motorcyclist Regiment to reinforce the town.\nMeanwhile, a company of Germans that had been dropped off in Zeeland headed northeast to flank the Dutch casemates on the defense line. They ran into the artillery battalion which they did not know was present. This was a new unit which had arrived only shortly before. It was armed with the old 8 cm staal field gun, which had already been retired. It was equally surprised to see the Germans behind their position. The Dutch quickly turned their guns and opened fire, albeit only one gun at a time. The Germans sustained relatively heavy casualties and after about an hour decided to withdraw to nearby woods.\nAnother company sneaked through unoccupied trenches and launched an attack on the Dutch casemates at the road between Mill and Volkel. The Dutch sustained some casualties, but returned fire, forcing the Germans to withdraw to the troop train.\nGerman forces then advanced along the rail line towards Mill. Along the way they encountered 10 casemates, whose weapons were pointed southeast and were caught completely by surprise. The Germans promptly captured 9 of them. They flanked the tenth one and captured most of its crew, but one soldier refused to surrender and slammed the door shut. He then proceeded to fire wildly through the casemate's loopholes, forcing the Germans to back off.\nAt 07:30 the 2nd Hussars-Motorcyclist Regiment found the operational German troop train south of Mill. Armed with anti-tank guns and heavy machine guns, they quickly disabled the locomotive and boarded the train. Inside they found Dutch uniforms that had been used by commandos to take the border posts. The hussars set the train on fire as they departed.\nIn the north, the Germans launched an attack on a Dutch company stationed in a small forest. By 11:00, after several hours of fighting with grenades and flamethrowers, they cleared the area and moved up to the railway. At noon the rest of the German force arrived, engaging the Dutch defense line. The armored train detachment, still trapped in the ditch, prepared to breakout. Around 14:00, the Dutch Hussars appeared to reinforce the line. Some relieved the soldier who had single-handedly defended his casemate from the Germans, and then proceeded to recapture the three adjacent to him. A German recon squad appeared, but was forced to retreat under heavy fire from the hussars. Had they found the armored train soldiers and attempted to link up with them, the entire defensive line would have been compromised. Artillery support from the battalion west of Mill check the Germans' advance. Frustrated by this lack of progress, Lieutenant General Friedrich Weber ordered an all-out assault on the line. The Germans were forced to delay, though, because their heavy artillery had still not crossed the Maas river. Instead, Weber ordered a probing assault along the railway. Some Dutch casemates were destroyed by anti-tank guns, while in the village a German machine gun nest was neutralised by a field gun.\nBy 18:00, heavy German howitzers arrived, backed up by an infantry regiment. The Germans prepared to launch their assault. 37 Junkers Ju 88s attacked the northern portion of the defense line, but failed to kill any Dutch soldiers or destroy any casemates. The infantry then launched its attack, and heavy fighting ensued. By 22:00 the Germans had established a wide gap in the Peel-Raam line. As the Dutch retreated the Germans linked up with the armoured train unit, who they at first misidentified as Dutch soldiers. A rearguard covered the Dutch withdrawal to South Willem's Canal until 04:00 on 11 May, while heavier fighting continued in the north.\nAftermath\nOver the course of the fighting the Dutch suffered 30 killed and 50 wounded. In the village, 9 civilians were killed. While figures for the Germans are incomplete, it is estimated that they sustained over 500 casualties. The Dutch defense had allowed for the escape of larger forces further into Fortress Holland, and delayed the Germans progress by one day. But with the Peel-Raam Line breached, they could now advance into the country.\nSee also\n* List of Dutch military equipment of World War II\n* List of German military equipment of World War II\nCitations\nReferences\n*\nFurther reading\n*\nExternal links\n*[http://www.waroverholland.nl Waroverholland.nl]\n*[http://www.saak.nl/battlefield%20tour/2011%20Mill/mill%20en.html Saak.nl]\n*[http://www.mill1940.nl/ mill1940.nl]\n*[http://www.stichtingsporenvandeoorlog.nl/ stichtingsporenvandeoorlog.nl]"
    }
  ]
}