{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Bender (1992)\n\nBattle of Bender}}\nMoldovaSupported by: Romania\n| combatant2 =  Transnistria Russia\n| commander1 =  Mircea Snegur Pavel Creangă  Constantin Antoci\n| commander2 =  Igor Smirnov Alexander Lebed\n| strength1 =\n| strength2 =\n| casualties1 =\n| casualties2 = Per Moldova:3 tanks destroyed\n}}\nThe battle of Bender, also known as the battle of Tighina or the battle of Bendery (; ), was fought between 19 and 21 June 1992 between Moldova, backed by volunteers, military advisors and purchased weapons sourced from Romania; and the Pridnestrovian Moldavian Republic (PMR, commonly known as Transnistria), an unrecognized breakaway state that declared independence from Moldova and relied on direct military support from Russia. The battle occurred in Bender, also known as Tighina, a city with a strong ethnic Russian presence at the western bank of the Dniester River. This is different from the rest of currently Transnistrian-controlled lands, which are located at the eastern bank of it. Bendery is the Russian name of the city and Tighina is the Romanian one, with Bender being an old Ottoman name.\nBender was one of the points of greatest fighting during the whole Transnistria War together with Dubăsari, and the battle that occurred in the city was the bloodiest and largest single incident in the conflict. Transnistria throughout the war had help from Russian regular troops and from the 14th Guards Army, which provided the Armed Forces of Transnistria with weapons and ammunition, this being vital to the separatist victory in Bender. As a response to the presence of Russian troops in Moldovan territory, the President of Moldova Mircea Snegur requested retaliation against Russia from the United Nations (UN), receiving weak international support. Thus, on 21 July 1992, Moldova and Russia signed a ceasefire agreement that ended the Transnistria War. As a result of it, a so-called peacekeeping Russian military mission was installed in Transnistria and the latter started drifting apart from Moldovan institutions, becoming more independent from Moldova.\nIn Transnistria, the battle of Bender was referred to as the \"Stalingrad of today\" by Transnistrian media at the time and was often compared to the Eastern Front of World War II, in which Nazi Germany invaded the Soviet Union (USSR). Russia was and is seen today as a \"savior\", while the Moldovan and Romanian forces were and are seen as \"nationalists\" and \"fascists\". On the other hand, in Moldova, the battle of Bender is nowadays seen as a provocation by \"criminal\" and \"paramilitary\" separatists made in order to disrupt the peace negotiation process of the conflict.\nSee also\n* Transnistria conflict\nReferences"
    }
  ]
}