{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Carthage (238)\n\nApril 238\n| place             = Near Carthage\n| casus             =\n| territory         =\n| result            = Maximinus victory\n| combatant1        = Numidian forces loyal to Maximinus Thrax\n| combatant2        = Forces of Gordian Iand Gordian II\n| commander1        = Capelianus\n| commander2        = Gordian II\n| strength1         = One legionother veteran units\n| strength2         = Larger army ofuntrained militia\n| casualties1       =\n| casualties2       =\n}}\nThe Battle of Carthage was fought in 238 AD between a Roman army loyal to Emperor Maximinus Thrax and the forces of Emperors Gordian I and Gordian II.\nBackground\nGordian I and II were father and son, both supported by the Roman Senate and based in Africa Province. The battle was part of a rebellion against Emperor Maximinus Thrax started by landowners who felt they had been overly and unfairly taxed. These landowners assassinated the procurator in Thysdrus and called on Gordian I and his son Gordian II to be their emperors.\nCapelianus was the governor of Numidia who had a previous grudge against Gordian I according to Herodian. Herodian says this grudge was developed after a lawsuit involving the two. Soon after being elected emperor, Gordian I sent a replacement to Numidia to replace his old enemy Capelianus. This action would eventually lead to his untimely demise.\nGordian I and II were not only supported by the Roman Senate but also enjoyed popular support in Africa Province, where they were seen as champions of the people against the oppressive taxation policies of Emperor Maximinus Thrax. The rebellion against Maximinus Thrax was sparked by a deep-seated discontent among landowners who felt burdened by heavy taxes. This discontent culminated in the assassination of the procurator in Thysdrus and the subsequent proclamation of Gordian I and Gordian II as emperors by the rebellious landowners.\nCapelianus, the governor of Numidia, played a pivotal role in the conflict, as he had a longstanding grudge against Gordian I. According to Herodian, this grudge stemmed from a previous lawsuit between the two men. When Gordian I became emperor, he sought to replace Capelianus, which further fueled the governor's animosity. This antagonism between Capelianus and Gordian I eventually led to the governor's involvement in the events that culminated in the Battle of Carthage and the demise of Gordian I.\nBattle\nGordian I marched from Thysdrus to Carthage, where news of the rebellion was welcomed. Capelianus led the only legion in Africa, Legio III Augusta, in battle against the two emperors.\nThe two armies met near Carthage. Gordian II personally led his army, consisting of militiamen without military training: he was defeated and killed. Upon learning of his son's death, Gordian I committed suicide.\nLasting effects\nWith the death of the two Gordians the Roman senate elected two new emperors that were not popular with the public. The senate then decided to turn to the 13-year-old Gordian III to become the new Caesar.\nThe deaths of Gordian I and II in the Battle of Carthage had a profound impact on the political landscape of the Roman Empire. The Roman Senate, faced with the task of electing new emperors, chose two individuals who were not well-liked by the public. Their unpopular reigns further damaged an already hectic empire, leading to increased internal and external threats.\nDuring this turmoil, the Senate made the unprecedented decision to appoint Gordian III, a 13-year-old, as the new Caesar. This choice was likely influenced by a desire to restore a sense of order. However, Gordian III's youth and inexperience made him a puppet emperor, with real power often lying in the hands of advisors and military commanders. This period of uncertainty and political maneuvering set the stage for further conflicts and power struggles within the Roman Empire, contributing to its eventual decline.\nReferences"
    }
  ]
}