{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Havana (1870)\n\n| combatant2  =  France\n| commander1  =  Eduard von Knorr\n| commander2  =  Alexandre Franquet\n| strength1   = 1 gunboat\n| strength2   = 1 aviso\n| casualties1 = 2 killed  1 wounded  1 gunboat damaged\n| casualties2 = 3 wounded  1 aviso damaged\n| campaignbox =\n}}\nThe Battle of Havana on 9 November 1870 was an indecisive single ship action between the German gunboat  and the French aviso Bouvet off the coast of Havana, Cuba during the Franco-Prussian War. The battle was the only naval engagement of the war, and showed the inability of either navy to gain a decisive advantage over the other.\nDuring the war, most of the French fleet blockaded the German fleet in their harbours, although a few German ships managed to slip out and evade the French, proceeding to engage in commerce raiding against the French merchant marine or harass the French in other ways. The Meteor was one such ship who managed to elude the French blockade, sailing from Nassau to Havana. A French aviso, the Bouvet, noticed her and sailed outside the harbour of Havana. Havana was at the time ruled by Spain, a neutral country in the conflict, and the captain of the Bouvet issued a challenge, which the German captain accepted. The Meteor sailed out of the harbour on the ninth of November, and proceeded to engage the Bouvet. Despite both sides pouring fierce fire, neither side could inflict significant damage on the other ship, and after a German cannon shot temporarily disabled the engine of the Bouvet, the French were compelled to retire, safely withdrawing to neutral waters. Both captains were subsequently promoted for their bravery in the battle.\nBackground\n, by Alexander Kircher]]\nThe war started with France having an overwhelming naval superiority over the naval forces of the various German States, most of them landlocked. The nascent German Imperial Navy was not in position to challenge its French opponent, and mostly remained safely inside its harbours. Despite this, a few German warships managed to harass the French in certain situations, such as in the Baltic, where the German aviso  exchanged fire with a French corvette when her flotilla challenged a French squadron off Zealand. On 27 August 1870, , assigned to the defences of Neufahrwasser that protected Danzig, challenged a French squadron under Admiral Édouard Bouët-Willaumez, consisting of three ironclads and one aviso. Nymphe fired two broadsides at the French ironclad  before escaping behind the coastal fortifications at Neufahrwasser. The corvette  engaged in commerce raiding off Brest, capturing three French merchant ships. The French ironclad  chased her and Augusta had to escape to Vigo, where she found herself blockaded for the rest of the war.\nBy early September 1870, French armies were decisively defeated in Metz and at the Battle of Sedan, resulting in the capture of French Emperor Napoleon III, but not in an end to the war. A new government was formed in Paris that continued the war for another five months.\nAt 8 a.m. on 7 November 1870, Meteor, under Lieutenant Eduard von Knorr, arrived in the harbour of Havana after leaving Nassau some days before. Cuba was then a Spanish colony, with Spain being a neutral power during the Franco-Prussian war. An hour later the French aviso Bouvet, under Commander Alexandre Franquet arrived from Martinique, steaming in from the opposite direction.  The next day the French mail steamer SS Nouveau Monde left the harbour for Veracruz but was forced to return a few hours later due to fears that she would be captured by the Prussian gunboat. Franquet issued a formal challenge to von Knorr, who accepted it. Bouvet steamed out of the harbour to wait for Meteor to meet her.  Meteor had to wait twenty-four hours before she could meet the French vessel due to neutrality laws governing warfare at the time. She was under escort from the Spanish warships Hernán Cortés and Centinela, tasked with making certain the battle would take place  off Cuba, outside territorial water, and thus ensure that the battle would not violate Spanish neutrality.\nBattle\nAlthough the Bouvet could in theory outgun and outrun her opponent, her main gun was mounted on an obsolete mount that made it difficult to aim accurately. Furthermore, the boiler of the Bouvet had exposed and unprotected parts above deck, making her engine vulnerable to enemy fire. Franquet was keenly aware of this weak point in his ship, and had makeshift protection installed out of sandbags, coal bags and chains, positioned to shield the exposed parts of the engine from enemy fire. Meteor, on the other hand, was a slower but more maneuverable ship. The two ships were evenly matched during the engagement. At 14:30, the action started with the Bouvet firing the first shots from four thousand metres, starting an artillery duel that failed to score any significant hit on either side for two hours. Around 16:30, Bouvet increased her speed to ten or eleven knots and turned towards the Meteor, in an attempt to ram her.\nThe ships collided under a steep angle; although the hull of the Meteor managed to resist the ramming attempt, the shock of the impact collapsed her rigging, sending sails and debris on her deck and, most significantly, wrapping lines around her propeller. German sailors attempted to use the opportunity to try and board the Bouvet, but the French sailors repelled them with rifle fire and the Bouvet quickly retreated to a safer distance. As the Bouvet was preparing to ram the immobilised Meteor again, a German shell struck her exposed boiler, allowing her steam to leak on deck and rendering her dead in the water as well. The Bouvet then unfurled her sails and disengaged from the action, as the Germans attempted to free their propeller and give chase. As Bouvet reached Cuban territorial waters, the Spanish intervened to stop the battle, with the Spanish corvette Hernán Cortés firing a warning shot at the Meteor to signal to her that the engagement was over. Both the Bouvet and Meteor then sailed back to Havana.\nAftermath\nNeither ship was permanently disabled from the action, with both warships mostly suffering damage to their masts and rigging (Bouvet's boilers and machinery remaining intact and functioning) and very few killed and injured on either side. The engagement was not considered militarily significant in the war by commentators of the day. The Meteor remained blockaded in Havana until the end of the war, unable to fulfill her purpose there of preying on French merchant shipping in the Caribbean. Figures for the losses on both sides are conflicting slightly, with The New York Times giving 2 killed and 1 wounded on the German side, while French sources mention 3 Germans killed and 9 wounded. For the French, figures range from 3 wounded, 5 wounded or 10 killed or wounded. Both sides were satisfied with the outcome, Franquet being promoted to Captain (capitaine de vaisseau) on 17 December 1870, and Von Knorr, receiving the Iron Cross 2nd Class and a promotion to Korvettenkapitän in 1871. Under diplomatic pressure from France, the Spanish shipyard in Havana delayed completing the repairs to Meteor until the war ended on 10 May 1871. Three days later, the ship departed for Germany; she sailed up the eastern coast of the United States and Canada before crossing the Atlantic.\nThe Meteor reached Plymouth on 13 June and arrived in Kiel on the 25th. There, she was decommissioned on 20 July. From 18 September to 14 October, she was used as a stationary training ship for engine room personnel. On 6 May 1872, Meteor was recommissioned for survey work and was assigned to the Hydrographics Office of the Imperial Admiralty Meteor and her sister ship  surveyed the German coast, ending in Mecklenburg on 20 October. The Bouvet'' was wrecked on 17 September 1871 off Île-à-Vache, when a gust of wind sent her onto a reef. The crew managed to safely abandon ship. Despite the insistence of the French Third Republic that the war would continue, a series of further defeats, including Paris being captured, forced the French government to finally surrender. The German states united into the German Empire under the Prussian king Wilhelm I, finally uniting most of Germany (excluding Austria) as a nation state. The Treaty of Frankfurt of 10 May 1871 gave Germany most of Alsace and some parts of Lorraine, which became the Imperial territory of Alsace-Lorraine. French determination to regain Alsace-Lorraine and fear of another Franco-German war, along with British apprehension about the balance of power, became factors in the causes of World War I.\nReferences\nBibliography\n*\n*\n*\n*\n*\n*\n*\n*\n*"
    }
  ]
}