{
  "content": [
    {
      "type": "text",
      "text": "# Battle of the Colline Gate__disambig_1\n\ntemplate -->\n| result      = Sullan victory\n| combatant1  = Sullans\n| combatant2  =\n| commander1  = Lucius Cornelius SullaMarcus Licinius Crassus\n| commander2  = Pontius TelesinusMarcus Lamponius\n| strength1   =\n| strength2   =\n| casualties1 =\n| casualties3 =  dead\n}}\nThe Battle of the Colline Gate, fought on 1 November 82 BC, was the decisive battle of the civil war between Lucius Cornelius Sulla and the Marians, Samnites and Lucanians. Sulla won the battle at the northeastern end of Rome, near the Colline Gate, and secured control of Italy. Appian is the only source who provides details about the battle.\nThe next day Sulla ordered the slaughter of the Marian leaders and Samnite prisoners in the Villa Publica. On 3 November, he started the proscription of his enemies.\nPrelude\nIn spring of 83 BC Lucius Cornelius Sulla Felix had returned to Italy at the head of a battle-hardened veteran army fresh from his victory over king Mithridates of Pontus in the First Mithridatic War. During 83–82 BC he and his allies had defeated the government's forces in several major battles. With their allies on the brink of disaster the Samnites and the Lucanians, who feared they would be next, decided to join the fray. The Samnite leader Pontius Telesinus rallied an army of 70,000 men from his own people and their allies (among others the Lucanians) and marched to raise the siege of Praeneste and rescue consul Gaius Marius, who was considered the heart of the anti-Sullan cause.\nBreaking the siege of Praeneste turned out to be nigh impossible. Sulla and his veteran army had dug themselves in behind formidable earthworks around the city. Telesinus, a highly experienced soldier, swiftly changed objectives and took his army on a night march towards Rome.\nWhen Sulla found out the Samnites were moving on Rome he sent his cavalry ahead to hinder them while he himself force-marched his army to the capital. The Samnite army arrived first, at daybreak, causing a lot of consternation in the city. After the first shock wore off the Romans sent out a cavalry force to delay the attackers. Unfortunately for the Romans, the battle-hardened Samnites easily dispatched the cavalry attack, killing many of them. However, the delay did allow a cavalry detachment sent ahead by Sulla to catch their breath, organize, and begin harassing the enemy. The arrival of Sulla's cavalry proved to the Romans and Samnites alike that Sulla was on his way. Telesinus decided to wait for Sulla's arrival and deployed his army slightly away from the Colline Gate. Sulla's main army arrived at noon and set up camp near to the temple of Venus Erucina, outside the walls of Rome, not far from the Colline Gate.\n::Since Hannibal had made his camp within the third milestone [from Rome] the city had faced no greater danger than when Telesinus went from rank to rank of his army saying: 'Now the Romans face their last day.' Loudly he exhorted his army to defeat the Romans and destroy their city saying: 'These are the wolves who have been tearing at the liberty of Italy. They will never go away until we have cut down the wood that shelters them.'\n::::Velleius Patercullus, History, 2.27.\nBattle\nSulla's commanders were concerned by the state of his soldiers after their forced march. They pointed out that they were not up against the disorganized Marians, whom they had easily beat time and again, but against the Samnites and Lucanians − highly motivated, experienced, and warlike opponents. They urged Sulla to wait and let his soldiers recuperate over night. But Sulla only allowed his men a meal and a few hours rest. Then he organized his battle lines, and at four o'clock, with the sun already sinking, the battle began.\nAfter a lot of hard fighting, Sulla's left wing was driven backwards until they literally had their backs to the wall. The rearmost ranks tried to seek shelter inside the walls, but the soldiers manning the walls dropped the portcullis on them and forced them to fight on. Sulla rode over to his left wing and tried to recover the situation; he pleaded with his men, he threatened some, he even physically turned some round to face the enemy. The ranks he was trying to keep were shattered with heavy casualties. Eventually, Sulla and the bulk of the left ended up in their camp. That is when messengers arrived from Marcus Licinius Crassus who had taken command of the right wing while Sulla gave his full attention to the left. Crassus reported that his men had completely routed the enemy facing them. He wanted to know if he could have supplies now to break for supper. Sulla used Crassus' victory to boost the morale of his men and counter-attacked the Samnites.\nThe battle continued through the night. Pontius Telesinus, the Samnite commander, was killed and his camp was seized. Marcus Lamponius, the Lucanian commander, fled. Eventually, the entire enemy army broke and fled. The death toll was estimated at 50,000. There were 6,000–8,000 prisoners.\nAftermath\nMarcius and Carrinas were captured and brought in the next day. Sulla killed them. He sent his lieutenant, Lucretius, to show their heads before the walls of Praeneste (Palestrina), where Gaius Marius the Younger was besieged. Velleius Paterculus wrote that Sulla ordered the head of Telesinus to be carried around the walls of Praeneste fixed on top of a spear. He did not mention Marcius and Carrinas.\nThe people of Praeneste understood that the Marian army had been destroyed and that Sulla controlled Italy. They surrendered. Marius hid in a tunnel and committed suicide. His head was cut off and displayed in Rome. Some senators who had held command under Marius were killed by Sulla when he reached Praeneste and some were imprisoned. The inhabitants were divided into Romans, Samnites, and Praenestians. Then a herald told the Romans that they deserved to die but they were pardoned. The men of the other two groups were killed. Norba, a town which still resisted, was taken by treachery. The inhabitants strangled themselves with ropes or fell on each other's swords. Others set fire to the town.\nReferences\nFurther reading\n* Appian, The Civil Wars, Book 1, Penguin Classics; New Edition 1996;"
    }
  ]
}