{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Aylesbury__disambig_1\n\n| map_type          = Buckinghamshire\n| map_size          =\n| map_caption       = Buckinghamshire\n| map_label         = Holman's Bridge\n| result            = Parliamentarian victory\n| combatant1        = Royalists\n| combatant2        = Parliamentarians\n| commander1        = Prince Rupert\n| commander2        = Sir William Balfour\n| strength1         = 2,000\n| strength2         = 1,500\n| casualties1       = 500 killed\n| casualties2       = 90 killed\n}}\nThe Battle of Aylesbury was an engagement which took place on 1 November 1642, when Royalist forces, under the command of Prince Rupert, fought Aylesbury's Parliamentarian garrison at Holman's Bridge a few miles to the north of Aylesbury. The Parliamentarian forces were victorious, despite being heavily outnumbered.\nBackground\nPrince Rupert took possession of Aylesbury with a force of several thousand infantry and cavalry but subsequently received intelligence of the impending arrival of a brigade of Parliament's troops from Stony Stratford.\nBattle\nPrince Rupert marched out with most of his force to confront the enemy at a site a few miles north of the town. He arrived at a ford and encountered a unit of 1,500 Parliamentarian troops under Sir William Balfour on the opposite bank. Prince Rupert, supported by Sir Lewis Dyve in reserve, charged across the ford and engaged the Parliamentarians. Rupert was driven back across the stream and was forced to retreat towards the town of Thame. Some 500 of Rupert's men fell and over 90 of the Parliamentarian forces died.\nLegacy\nIn 1818, remains were discovered in a field at Holman's Bridge (near the old ford), outside Aylesbury, by labourers digging pits for gravel, which were believed to belong to the fatalities from the battle. Many appeared, from the way they were laid, to have been graves of officers. They were buried in a common grave in St Mary's churchyard in Hardwick.\nControversy\nThere have been mixed claims surrounding the scale and even the existence of the battle largely due to the alleged lack of archaeological evidence. It has also been claimed that its existence is a piece of parliamentary propaganda and that the bodies found in 1818 were far earlier, potentially being of the Saxon era. The only record of the battle was a Roundhead pamphlet entitled , the 'somewhat bombastic' account which is said to have a bias of a similar nature to other material they produced. Monitoring of a sewage scheme by archæologist Bob Zeepvat in 1995, found no trace of the burials at Holmans Bridge. Zeepvat concluded that the battle, if it actually happened, may have instead been a skirmish as opposed to a full-scale battle as previously thought. Furthermore, the journal of Prince Rupert's marches pinpoints him in Abingdon on the day of the battle.\nIn 2002, the site fell under scrutiny as it was the proposed location of a new housing development. Doubts of the existence of the battle was used as ammunition for the developers and the County Council to push forward the development. A spokesperson for Bucks County Museum at the time said: \"All newspapers and leaflets at the time backed one side or another so there probably would have been a tendency to exaggerate. Something on this scale would certainly have made contemporary histories of the war. Some accounts suggest the battle took place in 1642 while others say it was 1643. There may have been two or three different engagements.\"\nNotes\nCitations\nReferences\n*\n*\n*\n*\n*\n*\n*\n*\n*}}\n*}}\n*"
    }
  ]
}