{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Ebenezer Church\n\n|place=Chilton County, Alabama\n|coordinates=\n|result=Union victory\n|combatant1=  United States (Union)\n|combatant2=  CSA (Confederacy)\n|units1= Cavalry Corps, Military Division of the Mississippi\n|units2=Forrest's Cavalry Corps  Militia\n|commander1=James H. Wilson\n|commander2=Nathan Bedford Forrest\n|strength1= 9,000\n|strength2= 1,500&ndash;5,000\n|casualties1= 12 killed, 40 wounded\n|casualties2= Unknown killed and wounded. 300 captured, 3 artillery pieces captured\n}}\nNathan B. Forrest\nThe Battle of Ebenezer Church was fought in Stanton, Alabama near Plantersville, Alabama between Union Army cavalry under Brigadier General and Brevet Major General of volunteers James H. Wilson and Confederate States Army cavalry under Major General Nathan Bedford Forrest on April 1, 1865 during Wilson's Raid into Alabama in the final full month of the American Civil War.\nForrest had at least 1,500 and as many as 5,000 troops, but some were ill-trained Alabama State Troops. Wilson had at least 9,000 troopers of his original 13,480-man force available. Forrest had been unable to concentrate scattered Confederate forces to face Wilson's larger force, which was armed with 7-shot  Spencer repeating carbines. After a brief but initially heavy engagement, the Alabama State Troops' line broke and Wilson's men drove the Confederates back toward the defenses of Selma, Alabama. Selma had an arsenal and industry that Wilson attacked and destroyed after his men again defeated the Confederate troopers at the Battle of Selma the following day. After the battle at Ebenezer Church, the Union troops burned the railroad depot at Plantersville and a cotton warehouse.\nConfederate casualties were not reported but Wilson's force captured 300 of Forrest's men and 3 artillery pieces. Wilson's command had 12 killed and 40 wounded. Forrest received a slight saber wound, which he later said would have been fatal if the Union officer, Captain James D. Taylor, had been able to strike him with the point rather than the blade. Forrest killed Taylor, the last of 33 men he killed during the war, with a pistol shot. His personal heroics in the battle came at the expense of neglecting the defense of Selma.\n]]\nNotes\nAll Union soldiers killed in this battle were removed to Marietta National Cemetery after the war. Refer to the U.S. Burial Registers.\nReferences\n* Jones, James Pickett. ''Yankee Blitzkrieg: Wilson's Raid Through Alabama and Georgia. Athens, GA: University of Georgia Press, 1987. Reprinted as a Brown Thrasher Book. Originally published Athens, GA: University of Georgia Press, 1976. .\n* Herbert, Keith S. Battle of Ebenezer Church'' in [http://www.encyclopediaofalabama.org/article/h-3444 Encyclopedia of Alabama]. Retrieved July 26, 2015."
    }
  ]
}