{
  "content": [
    {
      "type": "text",
      "text": "# Battleground (2014)\n\n(excluding WWE Network views)\n|venue      = Tampa Bay Times Forum\n|city       = Tampa, Florida\n|wwenlast   = Money in the Bank\n|wwennext   = SummerSlam\n|event      = Battleground\n|lastevent2 = 2013\n|nextevent2 = 2015\n}}\nThe 2014 Battleground was a professional wrestling pay-per-view (PPV) and livestreaming event produced by WWE. It was the second annual Battleground and took place on July 20, 2014, at the Tampa Bay Times Forum in Tampa, Florida. This was the first Battleground event to livestream on the WWE Network, which launched in February. It was the last WWE pay-per-view event to incorporate the WWE scratch logo, as the following month, WWE rebranded and began using the logo that was originally used for the WWE Network.\nNine matches were contested at the event, including two on the Kickoff pre-show. The main event saw John Cena defeat Randy Orton, Kane, and Roman Reigns in a fatal four-way match to retain the WWE World Heavyweight Championship. The event received 99,000 buys (excluding WWE Network views), slightly down on the previous year's 114,000 buys.\nProduction\nBackground\nin Tampa, Florida.]]\nOn October 6, 2013, WWE held a new pay-per-view (PPV) event titled Battleground that replaced Over the Limit. The event was originally intended to be an annual October PPV for the promotion. The following year, a second Battleground was announced, but it was moved up to July. It was scheduled to be held on July 20, 2014, at the Tampa Bay Times Forum in Tampa, Florida. This second event in turn established Battleground as WWE's annual July PPV. In addition to PPV, this was the first Battleground to livestream on the WWE Network, which launched earlier in February.\nStorylines\nThe event comprised nine matches, including two on the Kickoff pre-show, that resulted from scripted storylines. Results were predetermined by WWE's writers, while storylines were produced on WWE's weekly television shows, Raw and SmackDown.\nAt Money in the Bank, John Cena won a ladder match for the vacant WWE World Heavyweight Championship to become a 15-time WWE World Heavyweight Champion. The next night on Raw, Triple H scheduled Cena to defend the title at Battleground in a fatal four-way match against Roman Reigns, Kane, and Randy Orton.\nOn the June 30 episode of Raw, AJ Lee returned to WWE (her last appearance was the Raw after WrestleMania XXX) and defeated Paige for the Divas Championship for a second time. On the July 11 episode of Smackdown, AJ was scheduled to defend the title against Paige at the event.\nOn the June 30 episode of Raw, it was revealed that WWE Intercontinental Champion Bad News Barrett suffered an injury on the June 27 episode of SmackDown when he was thrown into the barricade by Jack Swagger. Due to this, he was stripped of the championship. Michael Cole also announced that there would be a Battleground Battle Royal at Battleground for the vacant WWE Intercontinental Championship. On the same episode, Cesaro, The Great Khali, Kofi Kingston, and Damien Sandow were added to the battle royal. On the July 1 episode of Main Event,  Dolph Ziggler, Rob Van Dam, Ryback, Curtis Axel, and Big E were added to the match. On the July 4 episode of SmackDown, Alberto Del Rio and Bo Dallas were added to the match. On the July 7 episode of Raw, Fandango and Sheamus were added to the match. On the July 14 episode of Raw, Sin Cara, The Miz, Titus O'Neil, Xavier Woods, Zack Ryder, Heath Slater, R-Truth, Adam Rose, and Diego were added to the match. At Battleground, it was announced that Bad News Barrett was to award the Intercontinental Championship to the winner of the battle royal. On July 16, Sandow and Rose were pulled from the battle royal. On July 20, Sandow was reinstated into the battle royal and Fandango was pulled from the battle royal. Van Dam did not appear in the battle royal due to an injury.\nOn the June 30 episode of Raw, Chris Jericho returned to WWE only for The Wyatt Family (Bray Wyatt, Luke Harper, and Erick Rowan), thus setting up a match between Wyatt and Jericho at the event.\nFollowing Money in the Bank, WWE Tag Team Champions The Usos (Jey Uso and Jimmy Uso) continued their feud with Wyatt Family members Luke Harper and Erick Rowan. On the June 30 episode of Raw, The Wyatt Family (Harper, Rowan, and Bray Wyatt) defeated The Usos and Sheamus. On the July 7 episode of Raw, Harper and Rowan defeated The Usos. On the July 11 episode of SmackDown, The Usos were scheduled to defend the titles against The Wyatt Family in a two out of three falls match at the event.\nOn the June 2 episode of Raw, Seth Rollins turned on The Shield by attacking both Dean Ambrose and Roman Reigns, siding with The Authority in the process. In the ensuing weeks, Rollins and Ambrose attacked each other, and each interfered in the others matches. The feud intensified when Kane assisted Rollins in winning the Money in the Bank ladder match at the Money in the Bank pay-per-view on June 29. On July 12, it was announced that Rollins and Ambrose were scheduled to face each other at Battleground.\nOn the June 30 episode of Raw, Jack Swagger and Zeb Colter confronted Rusev and Lana about their anti-American views. Swagger and Colter issued a challenge to Rusev, which was accepted on the July 14 episode of Raw.\nAlso confirmed for the event was Cameron squaring off against Naomi, which took place on the Kickoff pre-show. After they lost to AJ Lee and Paige on the July 7 episode of Raw, Cameron and Naomi attacked each other, effectively breaking up The Funkadactyls and setting up a match for the event.\nOn July 20, a match between Adam Rose and Fandango was scheduled for the Kickoff pre-show.\nEvent\n{|class=wikitable style=\"font-size:90%; margin: 0.5em 0 0.5em 1em; float: right; clear: right;\"\n|+ Other on-screen personnel\n!|Role:\n!|Name:\n|-\n|rowspan=3|English commentators\n|Michael Cole\n|-\n|Jerry Lawler\n|-\n|John \"Bradshaw\" Layfield\n|-\n|rowspan=2|Spanish commentators\n|Carlos Cabrera\n|-\n|Marcelo Rodriguez\n|-\n|Backstage interviewer\n|Tom Phillips\n|-\n|rowspan=2|Ring announcers\n|Lilian Garcia\n|-\n|Justin Roberts\n|-\n|rowspan=8|Referees\n|Mike Chioda\n|-\n|Charles Robinson\n|-\n|John Cone\n|-\n|Jason Ayers\n|-\n|Darrick Moore\n|-\n|Matt Bennett\n|-\n|Ryan Tran\n|-\n|Rod Zapata\n|-\n|rowspan=4|Pre-show panel\n|Renee Young\n|-\n|Booker T\n|-\n|Christian\n|-\n|Alex Riley\n|}\nPre-show\nDuring the Battleground Kickoff pre-show, Adam Rose took on Fandango. Rose performed a Party Foul on Fandango to win the match.\nIn the second pre-show match, Cameron took on Naomi. In the end, Cameron rolled up Naomi to win the match.\nPreliminary matches\nThe actual pay-per-view opened with The Usos (Jey Uso and Jimmy Uso) defending the WWE Tag Team Championship against Luke Harper and Erick Rowan of The Wyatt Family in a two out of three falls match. Harper and Rowan won the first fall after Harper executed a Big Boot on Jey. The Usos won the second fall after Jey pinned Harper with a roll-up. The Usos won the third fall after performing a double Samoan Splash on Harper, meaning The Usos retained the titles.\nNext, AJ Lee defended the WWE Divas Championship against Paige. In the climax, AJ applied the black widow, which Paige countered and then performed a Paige Turner on AJ for a two count. Paige attempted the PTO, but AJ and Paige traded covers. AJ performed a Shining Wizard on Paige to retain the title.\nAfter that, Rusev faced Jack Swagger. The ending saw Swagger apply the Patriot Lock on Rusev outside the ring but Rusev escaped the hold by pulling Swagger into the ring post and Swagger was counted out. After the match, Rusev applied The Accolade on Swagger.\nNext, Dean Ambrose was scheduled to face Seth Rollins, but Ambrose was ejected from the arena by Triple H for fighting with Rollins backstage. Rollins subsequently had himself declared the winner by forfeit. Later, as Rollins was leaving the arena, he was attacked by Ambrose but managed to escape.\nIn the fourth match, Bray Wyatt faced Chris Jericho. During the match, Luke Harper and Erick Rowan were ejected from ringside after attempting to attack Jericho. The match ended when Jericho performed a Codebreaker on Wyatt to win the match.\nIn the penultimate match, the battle royal for the vacated WWE Intercontinental Championship was contested. In the end, Dolph Ziggler performed a Superkick on Sheamus to eliminate him but The Miz, who had been hiding outside the ring, eliminated Ziggler to win the title.\nMain event\nIn the main event, John Cena defended the WWE World Heavyweight Championship against Randy Orton, Roman Reigns, and Kane in a fatal four-way match. During the match, Cena applied the STF on Orton but Reigns broke the hold. Reigns performed a Spear on Cena but Kane broke the pinfall. Reigns performed a Spear on Orton through the barricade. Reigns performed a Spear on Kane but Cena broke up the pinfall. Cena performed an Attitude Adjustment on Reigns but Kane broke up the pinfall. Kane performed a Chokeslam on Cena and a Chokeslam on Reigns for a near-fall. Reigns performed a Spear on Kane but received an RKO from Orton. Cena performed an Attitude Adjustment on Orton onto Kane and pinned Kane to retain the title.\nAftermath\nThe Jack Swagger vs. Rusev match, promoted as \"United States vs. Russia\", was marked in controversy after Lana made comments prior to the match blaming the United States for \"recent current\" world events and praising Russian president Vladimir Putin to help build heat for Rusev. Some in the media viewed the promo as a veiled reference to the crash of Malaysia Airlines Flight 17 three days earlier. In response to the backlash, a representative of WWE said that the segment \"was in no way referring to the Malaysia Airlines tragedy\", adding that the Rusev-Lana storyline \"has been a part of WWE programming for more than three months. WWE apologizes to anyone who misunderstood last night's segment and was offended.\" In response to WWE's statement, Pro Wrestling Torch newsletter assistant editor James Caldwell viewed the comments as hollow, noting that reasonable viewers could conclude that Lana was referring to the plane crash. \"WWE tacking on a fake apology with an insult to people's intelligence makes WWE sound even worse. All-around, it's a messy statement that conveys a lack of understanding, sensitivity, and maturity from WWE to be a decent corporate citizen\", wrote Caldwell. Swagger did not appear on Raw the next night, but he had a rematch with Rusev on Main Event, which Swagger won by disqualification.\nOn the July 21 episode of Raw, Triple H named Brock Lesnar the number one contender for the WWE World Heavyweight Championship held by John Cena, and scheduled a title match between them at SummerSlam.\nThe 2014 Battleground would also be WWE's final PPV to incorporate the WWE scratch logo, as the following month, WWE rebranded and began using the logo that was originally used for the WWE Network.\nResults\n|note1 = pre\n|match1 = Adam Rose (with Layla and Summer Rae) defeated Fandango by pinfall\n|stip1 = Singles match\n|time1 = 01:20\n|note2 = pre\n|match2 = Cameron defeated Naomi by pinfall\n|stip2 = Singles match\n|time2 = 03:30\n|match3 = The Usos (Jey Uso and Jimmy Uso) (c) defeated The Wyatt Family (Erick Rowan and Luke Harper) 2–1\n|stip3 = Two out of three falls match for the WWE Tag Team Championship\n|time3 = 18:57\n|match4 = AJ Lee (c) defeated Paige by pinfall\n|stip4 = Singles match for the WWE Divas Championship\n|time4 = 07:13\n|match5 = Rusev (with Lana) defeated Jack Swagger (with Zeb Colter) by countout\n|stip5 = Singles match\n|time5 = 09:54\n|match6 = Seth Rollins defeated Dean Ambrose by forfeit\n|stip6 = Singles match\n|time6 =\n|match7 = Chris Jericho defeated Bray Wyatt by pinfall\n|stip7 = Singles match\n|time7 = 15:03\n|match8 = The Miz won by last eliminating Dolph Ziggler\n|stip8 = Battle Royal for the vacant WWE Intercontinental Championship\n|time8 = 14:05\n|match9 = John Cena (c) defeated Kane, Randy Orton, and Roman Reigns by pinfall\n|stip9 = Fatal four-way match for the WWE World Heavyweight Championship\n|time9 = 18:16\n}}\nReferences\nExternal links\n*[https://www.wwe.com/shows/wwebattleground Battleground Website]\nde:WWE#Pay-per-Views"
    }
  ]
}