{
  "content": [
    {
      "type": "text",
      "text": "# Battles for Murzuch\n\n| combatant2  =  Fezzan rebelsSupported by: Senussi Order\n| commander1  =  Pietro Badoglio Rodolfo Graziani Amedeo D'Aosta\n| commander2  =  Salem en Nebi Mohammed ben Hassel Seif en Nasser\n| strength1   = Number of men unknown, 700 camels, 286 armoured vehicles\n| strength2   = Unknown, Several hundred local fighters\n| casualties1 =\n| casualties2 =\n| notes       =\n| image_size  =\n| territory   = Murzuch, Brak, Sebha,  and Uau el Kebir annexed by Italian Libya\n}}\nThe Battles for Murzuch, or the Reconquest of Fezzan, was a series of operations in the region today known as Fezzan. Italian soldiers and local fighters fought for who would have control over the region and the city of Murzuch, and the Italians were eventually victorious.\nBackground\nHaving appointed general Emilio De Bono as Minister of the Colonies in January 1929, the two Libyan colonies (Tripolitania and Cyrenaica) were reunited under a single governor, Marshal Pietro Badoglio. He began his governance by launching a proclamation to the populations which remained among the rebel ranks to choose between submission to the Government or execution. At the same time, he based his action on the principle «to pacify the colonies it is essential first of all to occupy the entire country».\nClashes occurred in Umm Melah, in the far north of Fezzan, where a large rebel garrison was destroyed and, in May, towards Bir Sciueref, where another large group of rebels suffered the same fate. At the end of May 1929, the overall situation in Tripolitania now allowed the Governor to prepare operations for the establishment of control over Fezzan.\nCampaign preparations and first clashes\nAfter the spring 1929 operations in Ghibla, many rebel groups had taken refuge in Fezzan, headed in the western part by Salem en Nebi and Mohammed ben Hassel and in the eastern part by the Seif en Nasser brothers. Marshal Badoglio's plan was to advance into Fezzan with the following concept:\n\"Affrontare e liquidare successivamente, uno alla volta, sempre quando possibile, i vari nuclei in cui appariva frazionato l’avversario, e sempre in condizioni di avere il sopravvento anche nel caso sfavorevole che il nemico riuscisse ad opporci una massa unica.\"}} The English translation (courtesy of Google translate) roughly being: Subsequently facing and liquidating, one at a time, always when possible, the various nuclei into which the adversary appeared to be divided, and always in a position to have the upper hand even in the unfavorable case that the enemy managed to oppose us with a single mass\nThe logistical preparation was based on the assumption of the complete occupation of Fezzan: the main base was located at the entrance to Fezzan, in Hon (Wadi al Shatii District), the three subsidiary bases were in Gheriat, Bir esc-Sciueref and Derg (Jabal al Gharbi District). These bases were supposed to aid the units during their concentration and provide them, upon departure, with the necessary means for a month's autonomy. Road communications up to the bases were improved, so as to make them suitable for the transit of vehicles. The gathering in Sciueref took place secretly in November.\nOn 25 November General Graziani assumed command of the troops which were formed as follows:\n* Column of the Sciueref led by Amedeo D'Aosta made up of:\n** 1st Saharan group (two Saharan groups and a Saharan artillery section), under the orders of lieutenant Ferrari Orsi;\n** 2nd Saharan group (formation like the previous one), under the orders of lieutenant Amato.\nThe column was to be followed by a caravan of 700 camels, with portions of the various services, two months of food and 17 days of water for the 260 kilometers of desert to be overcome.\n* Eastern column led by colonel Cubeddu made up of a self-supported Eritrean battalion, an armored machine gun squadron and a maneuver group (286 trucks) to constitute the future Brak base;\n* Derg column led by lieutenant Colonel Moramarco made up of a Saharan group, a Meharist nucleus, a Saharan artillery section and adequate logistical elements.\nOn the command banner was the motto: «Usque ad finem» (in Latin: Until the End).\ntalking about the campaign.]]\n.]]\nThe Sciueref column arrived in Brak on 5 December after crossing 265 kilometers of desert without any incident: the inhabitants of Brak made an act of submission to general Amedeo. The Italians found and arranged the tomb of captain De Dominicis, who fell in Maharuga fifteen years earlier. In Brak the Italians left a military garrison entrusted to colonel Natale.\nBattle for Murzuch, Brak and Sebha\nAfter the occupations of Brak and Sebha, on 14 December, by colonel Cubeddu and of the oasis of  and Uau el Kebir by generals Graziani and Badoglio, respectively on 8 January 1930 and on 13 January 1930, further troops, led by Amedeo D'Aosta, after a light battle, successfully occupied Murzuch. The operations in Fezzan finally ended when Italian soldiers reached the Chad–Libya border on 20 February 1930, and raised colonial flags on centres like Tummo.\nReferences\nSources\n*\n*"
    }
  ]
}