{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Ulm__disambig_1\n\n| map_type          = Europe\n| map_relief        = 1\n| map_size          = 300\n| result            = French victory\n| territory         = France gains control over Bavaria\n| combatant1        = France\n| combatant2        = Austria\n| commander1        = Napoleon BonaparteMichel Ney\n| commander2        = Karl Mack von LeiberichJohann I Joseph\n| strength1         = 80,000\n| strength2         = 40,000\n| casualties1       = 1,500 killed, wounded or captured\n| casualties2       = 4,000 killed or wounded27,000 captured\n}}\n|  zoom = 5\n|   float = right\n|    nolabels = 1\n|     width = 304\n|     height = 160\n| title = War of the Third Coalition:Austria\n| caption =\n| shapeD=n-circle\n| shape-colorD=dark blue\n| shape-outlineD=white\n| label-colorD = dark blue\n| label-sizeD = 12\n| label-posD = left\n| label-offset-xD =\n| label-offset-yD =\n| label1 =\n| mark-coord1 =\n| mark-title1 = Donauwörth on 7 October 1805\n| label2 =\n| mark-coord2 =\n| mark-title2 = Battle of Wertingen on 8 October 1805\n| label3 =\n| mark-coord3 =\n| mark-title3 = Battle of Günzburg on 9 October 1805\n| label4 =\n| mark-coord4 =\n| mark-title4 = Battle of Haslach-Jungingen on 11 October 1805\n| label5 =\n| mark-coord5 =\n| mark-title5 = Battle of Memmingen on 14 October 1805\n| label6 =\n| mark-coord6 =\n| mark-title6 = Battle of Elchingen on 14 October 1805\n| label7 = Ulm\n| mark-coord7 =\n| mark-title7 = Battle of Ulm from 15 to 20 October 1805\n| label-color7 = black\n| shape-color7 = black\n| label8 =\n| mark-coord8 =\n| mark-title8 = Battle of Lambach on 31 October 1805\n| label9 =\n| mark-coord9 =\n| mark-title9 = Battle of Amstetten on 5 November 1805\n| label10 =\n| mark-coord10 =\n| mark-title10 = Battle of Mariazell on 8 November 1805\n| label11 =\n| mark-coord11 =\n| mark-title11 = Battle of Dürenstein on 11 November 1805\n| label12 =\n| mark-coord12 =\n| mark-title12 = Battle of Schöngrabern on 16 November 1805\n| label13 =\n| mark-coord13 =\n| mark-title13 = Battle of Wischau on 25 November 1805\n| label14 = Austerlitz\n| mark-coord14 =\n| mark-title14 = Battle of Austerlitz on 2 December 1805\n| label-color14 = dark red\n| shape-color14 = dark red\n}}\nThe Battle of Ulm on 16–19 October 1805 was a series of skirmishes, at the end of the Ulm Campaign, which allowed Napoleon I to trap an entire Austrian army under the command of Karl Freiherr Mack von Leiberich with minimal losses and to force its surrender near Ulm in the Electorate of Bavaria.\nBackground\nIn 1805, the United Kingdom, the Austrian Empire, Sweden, and the Russian Empire formed the Third Coalition to overthrow the French Empire. When Bavaria sided with Napoleon, the Austrians, 72,000 strong under Mack, prematurely invaded while the Russians were still marching through Poland.\nThe Austrians expected the main battles of the war to take place in northern Italy, not Germany, and intended only to protect the Alps from French forces.\nA popular but apocryphal legend has it that while the Austrians used the Gregorian calendar, the Russians were still using the Julian calendar. This meant that their dates did not correspond, and the Austrians were brought into conflict with the French before the Russians could come into line. This simple but improbable explanation for the Russian army being far behind the Austrian is dismissed by scholar Frederick Kagan as \"a bizarre myth\".\nNapoleon had 177,000 troops of the  at Boulogne, ready to invade England. They marched south on 27 August and by 24 September were ready to cross the Rhine from Mannheim to Strasbourg. After crossing the Rhine, the greater part of the French army made a gigantic right wheel so that its corps reached the Danube simultaneously, facing south. On 7 October, Mack learned that Napoleon planned to cross the Danube and march around his right flank so as to cut him off from the Russians who were marching via Vienna. He accordingly changed front, placing his left at Ulm and his right at Rain, but the French went on and crossed the Danube at Neuburg, Donauwörth, and Ingolstadt. Unable to stop the French avalanche, Michael von Kienmayer's Austrian corps abandoned its positions along the river and fled to Munich.\nOn 8 October, Franz Xaver von Auffenberg's division was cut to pieces by Joachim Murat's Cavalry Corps and Jean Lannes' V Corps at the Battle of Wertingen. The following day, Mack attempted to cross the Danube and move north. He was defeated in the Battle of Günzburg by Jean-Pierre Firmin Malher's division of Michel Ney's VI Corps which was still operating on the north bank. During the action, the French seized a bridgehead on the south bank. After first withdrawing to Ulm, Mack tried to break out to the north. His army was blocked by Pierre Dupont de l'Etang's VI Corps division and some cavalry in the Battle of Haslach-Jungingen on 11 October.\nBy the 11th, Napoleon's corps were spread out in a wide net to snare Mack's army. Nicolas Soult's IV Corps reached Landsberg am Lech and turned east to cut off Mack from Tyrol. Jean-Baptiste Bernadotte's I Corps and Louis Nicolas Davout's III Corps converged on Munich. Auguste Marmont's II Corps was at Augsburg. Murat, Ney, Lannes, and the Imperial Guard began closing in on Ulm. Mack ordered the corps of Franz von Werneck to march northeast, while Johann Sigismund Riesch covered its right flank at Elchingen. The Austrian commander sent Franz Jellacic's corps south toward Tyrol and held the remainder of his army at Ulm.\nBattle\n]]\nOn 14 October, Ney crushed Riesch's small corps at the Battle of Elchingen and chased its survivors back into Ulm. Murat detected Werneck's force and raced in pursuit with his cavalry. Over the next few days, Werneck's corps was overwhelmed in a series of actions at Langenau, Herbrechtingen, Nördlingen, and Neresheim. On 18 October, he surrendered the remainder of his troops. Only Archduke Ferdinand Karl Joseph of Austria-Este and a few other generals escaped to Bohemia with about 1,200 cavalry. Meanwhile, Soult secured the surrender of 4,600 Austrians at Memmingen and swung north to box in Mack from the south. Jellacic slipped past Soult and escaped to the south only to be hunted down and captured in the Capitulation of Dornbirn in mid-November by Pierre Augereau's late-arriving VII Corps. By 16 October, Napoleon had surrounded Mack's entire army at Ulm, and four days later Mack surrendered with 25,000 men, 18 generals, 65 guns, and 40 standards.\nSome 20,000 escaped, 10,000 were killed or wounded, and the rest made prisoner. About 500 French were killed and 1,000 wounded, a low number for such a decisive battle. In less than 15 days the  neutralized 60,000 Austrians and 30 generals. At the surrender (known as the Convention of Ulm), Mack offered his sword and presented himself to Napoleon as \"the unfortunate General Mack\". Mack was court-martialed and sentenced to two years' imprisonment.\nin Augsburg.]]\nAftermath\nThe Ulm Campaign is considered an example of a strategic victory, though Napoleon indeed had an overwhelming superior force. The campaign was won with no major battle. The Austrians fell into the same trap Napoleon had set at the Battle of Marengo, but unlike Marengo, the trap worked with success. Everything was made to confuse the enemy.\nIn his proclamation in the Bulletin de la Grande Armée of 21 October 1805 Napoleon said, \"Soldiers of the , I announced you a great battle. But thanks to the bad combinations of the enemy, I obtained the same success with no risk&nbsp;... In 15 days we have won a campaign.\"\nBy defeating the Austrian army, Napoleon secured his conquest of Vienna, which was to be taken one month later.\nLike the Battle of Austerlitz, the Ulm Campaign is still taught in military schools worldwide, and would continue to influence military leaders to present times, a notable example being that of the Schlieffen Plan developed by Germany to envelope what they assumed and expected would be French-led allied troops and win World War I. Indeed, Dupuy would say about the battle in his Harper Encyclopedia of Military History that it actually \"''was not a battle; it was a strategic victory so complete and so overwhelming that the issue was never seriously contested in tactical combat. Also, This campaign opened the most brilliant year of Napoleon's career. His army had been trained to perfection; his plans were faultless.''\"\non October 14, near the monastery of Elchingen]]\nNotes\nReferences\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\nExternal links\n*"
    }
  ]
}