{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Pulukunawa\n\n* Army: 16 killed, 8 wounded, 3 missing\n|casualties2= 26 killed\n|notes=\n}}\nThe Battle of Pulukunawa took place during the Sri Lankan Civil War. It occurred on 11 December 1996 in which the LTTE militants attacked and overran the Special Task Force detachment at Pulukunawa in Ampara.\nBackground\nThe Special Task Force (STF) which was an elite paramilitary unit of the Sri Lanka Police maintained a detachment at Pulukunawa, 19km from the town of Ampara on the Ampara Maya-Oya road. The camp consisted of about 140 personal mostly STF personal and police. It had a small detachment from the 4th Field Regiment of the Sri Lanka Artillery with a single 85 mm Type 56 field artillery gun which provided artillery support for the local area. Days before the attack the Directorate of Military Intelligence had issued warnings to units in the area that a major attack was imminent and the LTTE had completed its final reconnaissance.\nThe attack\nIn the early hours of 11 December 1996, the LTTE militants numbering over 500 which included female cadres began their attack on the STF detachment. The soon breached the perimeter and over ran the camp. They claimed to have held control of the camp for two and a half hours before withdrawing to jungle.\nAftermath\nIt was the first time the LTTE attached an STF detachment. The 28 STF and police personal were killed and 27 wounded, while the army suffered 16 killed, 8 wounded and 3 missing. A civilian cook was also killed. The LTTE claimed it lost 26 cadres in the attack. They were able to capture the 85 mm field gun and 165 85mm shells, a 81mm mortar and over 70,000 small arms ammunition. Reinforcements soon recaptured the camp and the Sri Lanka Army launch Operation Singing Fish to clear Unnichi jungles from where the LTTE came from. Captain L.W.W. Sirimanna, who was commanding the artillery unit was posthumously promoted to the rank of Major after he died defending his gun along with eight gunners. On 5 April 2009, troops from the 53 Division, 58 Division and Task Force-VIII recaptured the Puthukkudiyiruppu are from the LTTE and recovered a 85 mm field gun as well as a 152mm Type 66 howitzer.\nSee also\n* List of Sri Lankan Civil War battles\n* Ampara District\nReferences"
    }
  ]
}