{
  "content": [
    {
      "type": "text",
      "text": "# Battle of the Clearwater__disambig_1\n\n| map_type    = USA#Idaho\n| map_relief  = yes\n| map_size    = 270\n| map_marksize=\n| map_caption = Location in the United States##Location in Idaho\n| map_label   =\n| territory   =\n|result=United States victory;successful Nez Perce withdrawal\n|combatant1=United States Armyand civilian volunteers\n|combatant2=Nez PerceNative American tribe\n|commander1=Oliver Otis Howard\n|commander2=Chief JosephLooking GlassToohoolhoolzote\n|strength1=440 soldiers, about 160 civilian volunteers and Indian scouts\n|strength2=200 warriors\n|casualties1=15 dead, 25 wounded soldiers2 dead, 1 wounded civilians\n|casualties2=4 dead, 6 wounded\n|}}\nThe Battle of the Clearwater (July 11–12, 1877) was a battle in the Idaho Territory between the Nez Perce under Chief Joseph and the United States Army. Under General O. O. Howard, the army surprised a Nez Perce village;  the Nez Perce counter-attacked and inflicted significant casualties on the soldiers, but were forced to abandon the village.\nAfter the battle, part of the Nez Perce War. the Nez Perce retreated east and crossed the Bitterroot Mountains via Lolo Pass into Montana Territory, with General Howard in pursuit.\nBackground\nAfter the defeat of the U.S. Army by the Nez Perce at the Battle of White Bird Canyon on June&nbsp;17, General Oliver Otis Howard took personal command of the army. Howard dispatched a small force to capture the neutral Looking Glass, but Looking Glass and his followers escaped and joined Joseph.\nWith Howard in pursuit, but several days behind, Joseph, 600 Nez Perce and their more than 2,000 livestock brushed aside a small U.S. military force at the Battle of Cottonwood (July 3–5), and continued eastward for another . Along their route, they burned thirty ranches and farms, and the proprietors had fled to nearby Mount Idaho. The ranches and farms were on the Nez Perce Reservation and illegal in the view of the Nez Perce. They established a camp in the steep-walled valley of the South Fork of the Clearwater River, north of present-day Stites. There on July&nbsp;7, they were joined by Looking Glass and other Nez Perce bringing their total strength up to about 800, with 200 fighting men.\nOn July 8, a company of 75 civilian volunteers under Edward McConville, found the Nez Perce camp and reported its location to General Howard. The Nez Perce discovered the volunteers the next morning and attacked them, forcing them to take refuge on a hilltop and exchanging long-distance fire with them. Out of water and their horses stolen by the Indians, the volunteers dubbed their hilltop \"Fort Misery.\"  One Nez Perce was wounded. About noon on June 11 the volunteers withdrew from their hill to Mount Idaho without opposition.\nThe Nez Perce anticipated that Howard and his soldiers would arrive at their village from the northeast, the same direction as the volunteers came from, but instead the General approached them from the south following the east bank of the South Fork of the Clearwater downstream through rugged country. About noon on July 11, Howard spotted the village, spread along both banks of the Clearwater. Perhaps lulled into complacency by their previous successes, the Nez Perce were surprised at his sudden appearance.\nTo combat approximately 200 Nez Perce warriors, Howard had 440 soldiers plus civilian packers, scouts, messengers, and Indian scouts, amounting to a force that may have exceeded 600 men. Among the Indian scouts were some Nez Perce; many Nez Perce had not joined Joseph and remained friendly with the U.S.\nThe battle\n,the Nez Perce leader]]\nHoward opened the battle by firing howitzers and Gatling guns at the Nez Perce camp in the valley below from the ridge he occupied.  \"These only served to announce the presence of the troops to the unsuspecting Indians and 'to send horsemen...scampering over the hills in every direction...[while] herding their stock together, which was afterward driven by old Indians, squaws and children into the hills in the rear.\"\nThe old warrior Toohoolhoolzote and 24 Nez Perce, including Yellow Wolf, rode to the top of the ridge to contest the advance of Howard.  They built a stone fort and began firing at the soldiers, stalling Howard's cavalry.  Soon, they were nearly surrounded and they retreated back to the village.  Toohoolhoolzote's delaying action gave other Nez Perce time to set up defensive positions around three sides of a prairie on a tableland, about 1.5 miles wide and two miles long above the east side of the Clearwater River.\nAbout 100 Nez Perce opposed Howard as he advanced and took up positions on the prairie.  \"Although we outnumbered the Indians,\" said a correspondent, \"we fought to a great disadvantage.  The redskins were in a fortified canyon...while our men were obliged to approach them along an open and treeless prairie.\" After extensive fighting all afternoon, the day ended in a stalemate with Indians and soldiers in their fortified lines.  The soldiers spent the night hungry and thirsty.  The Nez Perce in the battle line were supplied by women from the village in their rear.\nOn the morning of July 12, Howard's entire force was facing the Nez Perce on the prairie.  He drove the Nez Perce away from a spring and was able to provide water and food to his men.  Howard prepared an attack on the Nez Perce left flank by Captain Marcus Miller and his battalion.   Unexpectedly, a pack train of 120 mules bearing supplies for Howard appeared on the battlefield.  Miller moved forward to protect the pack train and, taking advantage of his advanced position, he suddenly ordered a charge on the Nez Perce.  The Nez Perce retreated and soon were in full flight as Howard's men advanced all along his lines and into the village near the river.  The Nez Perce men crossed the Clearwater River with their women and children and as many of their possessions as they could gather.  Howard declined to continue the pursuit of the Indians beyond the river; the battle was over.\nAftermath\nThe day after the battle, General Howard pursued the Nez Perce about  northward to the village of Kamiah, where he saw the Nez Perce crossing the Clearwater River.  Howard rushed his forces forward, but was too late; one cavalryman was wounded. On July&nbsp;15, Howard received the surprising message that Joseph and his band wished to surrender, while Looking Glass, White Bird, and Toohoolhoolzote planned to continue eastward to November.  However, Joseph failed to appear the next day to surrender, but 35 Nez Perce, including 14 men, did which bolstered the Army's view that the Nez Perce were disintegrating as a fighting force.  Howard learned that the Nez Perce had moved their camp to Weippe Prairie, about  away from Howard's position and he set off in search of them.   The Nez Perce called Howard \"General-Day-After-Tomorrow\" because of his slow, careful movements.\nThe Nez Perce seem to have undergone a crisis in leadership in the last hours of the Clearwater battle and the days which followed.  Joseph was by no means the undisputed leader.  Five different bands and five leaders were represented among the Nez Perce, and each warrior reserved to himself his right to fight as he wished and when he wished.  Joseph (and presumably his brother Ollokot) apparently argued against leaving Idaho and their traditional lands. However, White Bird, Looking Glass, and Toohoolhoolzote prevailed and the Nez Perce decided to follow the rugged Lolo trail to Lolo Pass and Montana. Looking Glass had many friends in Montana and argued that once there the Nez Perce would be safe, not understanding perhaps that Idaho and Montana were states in the same nation.\nAn irony was that 72 years earlier the Nez Perce had greeted in friendship the half-starved Lewis and Clark Expedition on Weippe Prairie. Clark, it was reputed, had a son with a Nez Perce wife and that son, now an elderly man, was with Joseph.\nin 1805 and where Chief Joseph camped in 1877 before crossing the Lolo Pass.]]\nHearing that the Nez Perce were leaving Weippe Prairie, Howard sent out a strong force from Kamiah on July 17 to ascertain in which direction the Nez Perce were heading.  Major Edwin C. Mason and \"Colonel\" Edward McConville, a civilian volunteer, led the force of cavalry, civilian volunteers, and several Nez Perce scouts. Joseph's Nez Perce ambushed the scouts, killing 2 and wounding one, and Mason turned back, but after having learned that the Nez Perce were traveling the Lolo Trail.  The Nez Perce undertook one last raid in Idaho on July&nbsp;18, stealing several hundred horses at Kamiah.\nOn July 16, the main body of the Nez Perce departed Weippe Prairie on the arduous Lolo Trail through 120 miles (200&nbsp;km.) of uninhabited mountains. They were about 750 persons in all, two thousand horses, and hundreds of dogs in a column several miles long.  They reappeared on the Montana side of the Lolo Pass on July&nbsp;25, having accomplished the difficult passage with relative ease. Soon, they would again meet up with the U.S. army.  Howard, with 700 men, set off after the Nez Perce on the Lolo Trail on July 30.  He telegraphed ahead and soldiers awaited the Nez Perce just over the Montana border at Fort Fizzle. Colonel John Gibbon would intercept the Nez Percé at the Battle of the Big Hole.\nReferences\nSources\n*Dillon, Richard H. North American Indian Wars (1983)\n*Greene, Jerome A. Nez Perce Summer, 1877 (2000)"
    }
  ]
}