{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Ibarra (1812)\n\n|coordinates =\n|image=\n|image_size =\n|caption=\n|date=27 November and 1 December 1812\n|place= San Antonio de Ibarra and Ibarra, Ecuador\n|casus=\n|territory=Disappearance of the State of Quito\n|result= Spanish victory\n|combatant1= State of Quito\n|combatant2= Kingdom of Spain\n|combatant3=\n|commander1= Pedro de Montúfar\n|commander2= Juan de Sámano\n|commander3=\n|strength1=620–800 men\n|strength2=600 men380 reinforcements\n|strength3=\n|casualties1=180 killed, 250 woundedmany executed later\n|casualties2=100–200 killed or wounded\n|casualties3=\n|notes=\n}}\nThe First Battle of Ibarra occurred in the vicinity of the city of Ibarra, Ecuador, between 27 November and 1 December 1812. The event, which is part of the Spanish American Wars of Independence, pitted the troops of the State of Quito against those of the Spanish Empire. The battle was a decisive victory for the Spanish and resulted in the disappearance of the short-lived nation that had been born in the territory of the Royal Audiencia of Quito, after the Quito revolt of 10 August 1809, which had declared itself independent from Spain on 11 October 1811.\nPrelude\nThe city of Quito was in open rebellion against Spain, and had created the independent State of Quito on 15 February 1812.\nSpain reacted by appointing General Toribio Montes president of the Royal Audiencia of Quito and commander-in-chief of the army in the province. After an initial victory for the Patriot troops in the Battle of Chimbo (25 July), Montes' army advanced to Mocha where the Junta troops were defeated on 3 September. After that, the Spanish army advanced north, and after a weak but brave resistance at El Panecillo led by Carlos Montúfar, Montes finally entered Quito and took possession of the Presidency of the Audiencia on 8 November.\nThe Battle\nBefore his arrival, the insurgents had fled north. The Patriot army was reorganized, gathering in Ibarra about 1,200 men under the command of Colonel Calderón. There they learned that Spanish troops, under the command of Colonel Juan de Sámano, were in Atuntaqui. Sámano cunningly proposed an agreement to the patriots, but they later realized his deception and prepared to fight in the nearby town of San Antonio on 27 November 1812. Despite having been close to victory, certain tactical errors caused the patriots to retreat again to Ibarra, making a last stand against the Royalists on 1 December, on the shores of the Yahuarcocha lagoon.\nThat day, the last insurgent stronghold was defeated and the captured patriots, after a summary trial, were put to death, although some were able to escape to Esmeraldas with the idea of joining the patriots of Cauca.\nReferences\nLinks\n* Borrero, Manuel María (1962). La revolución quiteña, 1809–1812. Quito: Espejo.\n* Chacón Izurieta, Galo E. (2002). Las guerras de Quito, por su independencia: orígenes del estado ecuatoriano y su ejército. Quito: Centro de Estudios Históricos del Ejército. .\n* Salazar y Lozano, Agustín (1910). [https://books.google.com/books?id=9KHOS7637MQC&q=Ibarra Recuerdos de los sucesos principales de la revolución de Quito. Desde 1809 hasta el de 1814]. Quito: Imprenta y Encuadernación Nacionales. PP 67–76."
    }
  ]
}