{
  "content": [
    {
      "type": "text",
      "text": "# Battle and massacre at Shar al-Shatt\n\n| result            = Italian defensive victory\n| combatant1        =  Kingdom of Italy\n| combatant2        =  Ottoman Empire\n* Tripolitania\n| commander1        =  Pecori Giraldi Gustavo Fara\n| commander2        =  Neşet Bey Mohamed Fekini\n| units1            = 11th Bersaglieri82nd Torino84th Venezia\n| units2            =\n| strength1         = 8,500\n| strength2         = 8,000–10,000\n| casualties1       = 503 killed  158 wounded with several presumed dead by 1912.|group=nb}}\n| casualties2       = ~1,106 killed\n| notes             =\n| campaignbox       =\n}}\nThe battle and massacre at Shar al-Shatt ( Shār’ ash-Shaṭ; Sciara Sciat in Italian) occurred on 23 October 1911 in the village of Shar al-Shatt on the outskirts of Tripoli, Libya during the Italo-Turkish War. 503 Italians were killed in Shar al -Shatt, 290 of which in the following massacre of soldiers who had surrendered. The incident became known as the \"Massacre of Italians at Sciara Sciat.\" The Italians reacted by reconquering Shar al -Shatt and beginning to conduct harsh reprisals.\nDiversionary attacks\nOn October 23, 1911, Captain Carlo Maria Piazza made what is considered the first combat flight, carrying out a reconnaissance southwest of Tripoli, where he detected some activity in the enemy camp, but the report he made was not transmitted to the command, while a second flight, this time carried out by Captain Riccardo Moizo, did not detect anything interesting. In fact, they did not carry out a real aerial reconnaissance but limited themselves to tests of the in-flight efficiency of the engines of the same aircraft with a simple overflight of the oasis near Tripoli. That same morning, the Ottomans, supported by Arab militias, suddenly attacked the Italian defense perimeter in Tripoli. At that time, the defensive perimeter of the city (about 13 km long) was held by about 8,500 men and three artillery batteries: the 6th Infantry Regiment and the 40th Infantry Regiment to the west, the 82nd and 84th Infantry Regiments with a southern front in the center and the 11th Bersaglieri Regiment to the east. The first attack engaged the area west of Tripoli held by the 6th Infantry Regiment, which with the intervention of the battleship Sicilia easily repelled the assault. A second Ottoman attack again struck the western defences of Tripoli held by the 82nd Infantry Regiment, which was again easily repulsed while sporadic rifle fire was reported against the Italian infantry from the oasis behind them. Mopping-up operations were immediately organised, resulting in arrests and seizures of weapons.\nThe Assault on the Oasis of Shar al-Shatt, 23 October\nColonel Neşet's attacks on the Italian positions in the morning served only to mask the main attack that was directed against the less well-armed eastern positions held by the 11th Regiment of Bersaglieri commanded by Colonel Gustavo Fara and which, due to the conformation of the area, could not be adequately fortified. In fact, they were crossing Menscia, a densely populated district of the Tripoli oasis, and therefore could not be supported by artillery (due to the lack of a firing range) and had not been prepared for defense to avoid damaging the property of the inhabitants. The deployment of the bersaglieri saw the XXXIII battalion deployed without reserve between Fort Messri and Henni, the XXVII battalion between Henni and the sea with a company in reserve at Bu Sette, and the XV battalion in reserve east of Henni.\nThe main attack was directed against the Bersaglieri, striking early in the morning the 7th company of the XXXIII battalion, which was garrisoned at Fort Messri, quickly reinforced by the 9th company, the 3rd company of the XV battalion and infantry units, managing to repel the attackers at the cost of heavy losses. Again, the company was attacked from behind by civilians who were shooting from hidden in the oasis. The 8th company, deployed in Henni, was also heavily engaged, fighting until nightfall, reinforced by the 1st and 2nd company of the XV battalion and the 6th company of the XXVII battalion, which had first headed towards the mosque of Bu Mescia along the road to the cemetery of Rebab, and then towards Henni where the defense was led by Gustavo Fara.\nThe most critical situation occurred in the sector of the XXVII Battalion, positioned around Shar al-Shatt with the 4 Company east of Henni flanked on its left by the 5th Company, deployed as far as the sea. Also hit by violent attacks, the battalion could not count on any reserves or immediate reinforcements and soon found itself in serious difficulties, aggravated by the increasing number of attacks on its own ranks by the local population. The 4 Company was forced to withdraw towards the cemetery of Rebab, where it barricaded itself to defend itself until the surrender. The 5th company initially managed to hold out, but around 1 p.m. it too had to retreat, first to Amedia, then to Tripoli itself, constantly harassed by the attackers and under fire from the local population who were shooting from every house, also suffering heavy losses.\nThe situation only stabilized around 5 p.m., with the arrival of a battalion of the 82nd Infantry Regiment, and two battalions of sailors formed by the landing companies of the Sicilia, the Sardegna, the Re Umberto and the Carlo Alberto, supported by a 75 mm landing battery already deployed at Bu Meliana. Shar al-Shatt was only reoccupied at sunset by the infantrymen of the 82nd Infantry Regiment supported by the remains of the 4th and 5th Companies Bersaglieri (reduced to only 57 survivors in two platoons), after a house-to-house fight.\nThe Battle of Bu-Meliana, 26 October\nThree days after the Battle of Shar al-Shatt, on October 26, at 5 am, and with all available forces, the Ottomans attacked Tripoli again, engaging the entire southeastern sector. Despite limited breakthroughs to the west, the Italian line managed to hold, mainly thanks to artillery cover and counterattacks by reinforcements coming from the city (during these clashes, among others, the recipient of the Gold Medal of Military Valor, Riccardo Grazioli Lante della Rovere was killed). By 8 a.m. the Turkish action was over and the attacking forces were in flight. A simultaneous attack on the eastern front of the defense line had no better result.\nConsequences\nPrime Minister Giovanni Giolitti, after the battle of Shar al-Shatt, pushed to put the army in motion in search of a victory that would restore Italian prestige in Europe. However, General Caneva was sceptical about the success of this operation because he feared the desert, to which the Italian troops were not accustomed, and proposed instead to launch an effective propaganda that would separate the Arab and Turkish elements in the opposing camp.\nFrom a military point of view, the Ottoman counteroffensive shortened the perimeter to the east with the abandonment of some positions (Fort Hamidie, Henni and Fort Mesri). On the political level, however, it marked the end of the Italian illusion of being able to collaborate with the Arabs to drive out the Turks. Meanwhile, the Turks engaged the garrison of Tripoli with guerrilla actions, using snipers and firing isolated artillery shells with pieces that were moved immediately.\nDuring the month of November, seven infantry battalions, one Alpini, one grenadier and one 75 mm battery were transported from Italy, united in the 3rd Special Division(lieutenant général Felice De Chaurand). On November 26, the 11th Bersaglieri and the 93rd Infantry with two battalions of grenadiers completely reoccupied the oasis and recaptured all the positions left between October 27 and 28, protected on the left flank by the 23rd and 52nd Infantry Regiments against possible attacks from Ain Zara.\nMassacre\nThe Italian fleet appeared off Ottoman Tripoli on the evening of 28 September 1911; the city was quickly conquered by a force of 1,500 men.\nDespite the quick Italian conquest of the city of Tripoli and its surroundings from the Ottoman Empire by the first days of October, the interior of Ottoman Libya shortly thereafter broke out into revolt, with Italian authorities losing control over large areas of the region.\nBefore the arrival of the Italian forces, cells led by Ottoman officers (called \"Young Turks\", like Mustafa Kemal Atatürk) encouraged native Libyans to infiltrate Italian-owned industries and companies in Tripolitania, reconnoiter roads, and take a census of all males able to bear arms in Tripoli and Derna, in preparation for a jihad of the local Muslims.\nThe interior of Tripolitania rose in revolt from the first weeks and the Italian soldiers were quickly defeated by the local Muslims (supported by Turkish officers), as happened in Shar al-Shatt.\nThe IV Battalion of the 11th Bersaglieri Regiment of Colonel Gustavo Fara had been positioned at the small oasis village as part of the defenses of Tripoli. On 23 October, the force of about 500 Italian soldiers came under attack from the Turks and Arabs and was quickly overrun and decimated. Approximately 290 Bersaglieri, who survived the initial assault surrendered to the jihadists in the local cemetery, but all were tortured and killed.\n|sign=|source=}}\nArgentine journalist Enzo D'Armesano of the Buenos Aires newspaper \"La Prensa\" was present the next morning in Shar al-Shatt and reported the cruelty with a description that impressed the Argentinian people. He reported that many local civilians approached the Italians' lines from behind, initially showing friendship, only to fall upon them with knives. He wrote that the three survivors of the 4th Battalion accused the Arab civilians of the Shar al-Shatt oasis of \"tradimento\" (betrayal).\nAftermath\nOfficially, 21 Italian officers and 482 soldiers died at Shar al-Shatt, 290 of them massacred after surrender in the cemetery.\nIn 1932, Mussolini inaugurated a Monument to the Bersaglieri in Rome, with one of the sculpted panels memorializing those who died at Shar al-Shatt. The  monument was designed by architect Italo Mancini and was created by sculptor Publio Morbiducci.\nSee also\n*Italian Libya\n*List of massacres in Libya\n*Monument to the Bersagliere, Porta Pia\nCitations\nFootnotes\nWorks cited\n*\n*\n* }}\n*\n* }}\n*\n*\n*"
    }
  ]
}