{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Żabinka (July 1920)\n\n| combatant2        =\n| commander1        = Władysław Koczorowski\n| units1            = 63rd Toruń Infantry Regiment\n| units2            = 10th Rifle Division\n| campaignbox       =\n}}\nThe battle of Żabinka was fought between the Polish 63rd Infantry Regiment under Captain Władysław Koczorowski and units of the Soviet 10th Rifle Division on 30 July 1920 during Mikhail Tuchaczewski's July offensive of the Western Front during the Polish-Bolshevik War.\nPosition of troops before the battle\nIn the first days of July 1920, the Polish front on the Auta River was broken, and the troops of the Northeastern Front, Gen. Stanisław Sheptycki's forces were retreating under the pressure of Mikhail Tukhachevsky's offensive. The Supreme Command of the Polish Army ordered the troops of the Soviet Western Front to be stopped on the line of former German trenches from World War I. The operational situation, especially the fall of Vilnius and the bypass of Polish positions from the north, forced the further retreat of Polish troops. 1st Army of Gen. Gustaw Zygadłowicz retreated to the Niemen, and the 4th Army to Szczara, and the Polesie Group to the Ogiński Canal and Pinsk.\nThe defense of Polish troops on the Niemen and Szczara line also did not meet expectations. In the fight against the enemy, Polish troops suffered heavy losses and began to withdraw to the Bug line too early.\nAt the end of July, the Northeast Front was retreating to the line of the Bug and Narew Rivers. Gen. group Władysław Jung was pushed beyond the Narew River, and the group of Gen. Daniel Konarzewski stood between Prużana and Bereza Kartuska . A gap of several dozen kilometers was created between both groups subordinated to the 4th Army, into which the Soviet 2nd and 17th Rifle Divisions entered. On both sides of the Luniniec - Brest railway line, the Polesie Group of Gen. Władysław Sikorski. Retreat of Gen.'s troops Sikorski's decision was not forced by the enemy's actions, but by events on the northern sector of the front.\nOn July 27, the Polesie Group was tasked to withdraw to the Brest area and hold the bridge on the eastern bank of the Bug. The foreshore was to constitute the basis for future Polish offensive operations. General Władysław Sikorski delayed the retreat by one day, covering the left wing of the 3rd Army fighting in Galicia. 16th Infantry Division Gen. Stanisław Skrzyński marched from Kobryń to Żabinka. The 63rd Infantry Regiment retreated along the railway track to Żabinka. The track was patrolled by armored trains \"Poznańczyk\" and \"Danuta\". On July 30, the 3rd Battalion of the 63rd Infantry Regiment in the rear guard near Żabinka came into fire contact with units of the Soviet 10th Rifle Division. The battalion took up firing positions behind the railway embankment and engaged in combat. At that time, the 2nd battalion attacked the rear of the attacking Soviet troops, and a moment later the 3rd battalion also attacked from a defensive position. At the same time, a company of the 66th Infantry Regiment attacked from Bogusławice with the task of opening the regiment's retreat route from the direction of Ogrodnik.\nThe Battle\nOn July 27, the Polesie Group was tasked to withdraw to the Brest area and hold the bridge on the eastern bank of the Bug. The foreshore was to constitute the basis for future Polish offensive operations.  Gen. Władysław Sikorski delayed the retreat by one day, covering the left wing of the 3rd Army fighting in Galicia.  The 16th Infantry Division of General Stanisław Skrzyński marched from Kobryń to Żabinka. The 63rd Infantry Regiment retreated along the railway track to Żabinka . The track was patrolled by armored trains \"Poznańczyk\" and \"Danuta\" . On July 30, the 3rd Battalion of the 63rd Infantry Regiment in the rear guard near Żabinka came into fire contact with units of the Soviet 10th Rifle Division.  The battalion took up firing positions behind the railway embankment and engaged in combat. At that time, the 2nd battalion attacked the rear of the attacking Soviet troops, and a moment later the 3rd battalion also attacked from a defensive position. At the same time, a company of the 66th Infantry Regiment attacked from Bogusławice with the task of opening the regiment's retreat route from the direction of Ogrodnik.\nBalance of fights\nAt Żabinka, the battalions of the 63rd Infantry Regiment won a spectacular victory. Attacked from several sides, the units of the Soviet 10th Rifle Division suffered a severe defeat, losing prisoners and 12 machine guns. The camp of the 66th Infantry Regiment captured the previous day was also recaptured from the Soviet hands.\nCitations\nSources\n*\n*  }}\n*\n*\n*\n*\n*"
    }
  ]
}