{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Zahal\n\n| commander2        = Władysław WołłowiczWalerian FalenckiJan DonowajSamuel Smólski\n| strength1         = 3,000 Zaporozhian Cossacks and Crimean Tatars\n| strength2         = 1,550 Polish–Lithuanian hussars, cavalry and infantry\n| casualties1       = 1,600 killed and wounded\n| casualties2       = 216 killed and wounded\n}}\nThe Battle of Zahal (Belarusian: Бітва пад Захалам, Ukrainian: Битва під Загалом, Polish: Bitwa pod Zahalem; 17–18 June 1649) was fought between the Zaporozhian Host and Crimean Khanate against the Polish–Lithuanian Commonwealth as a part of the Khmelnytsky Uprising. Near the site of the present-day town of Zahal in Belarus, a forces of the Zaporozhian Cossacks and Crimean Tatars under the command of Colonel Illya Holota, who was killed in the battle, was defeated by the Polish–Lithuanian Commonwealth’s forces under the command of Hetman Władysław Wołłowicz, Walerian Falencki, Jan Donowaj and Samuel Smólski.\nThe Zaporozhian Cossack’s and Crimean Tatar’s forces was numbered around 3,000 men, the core of which was the Kaniv Regiment of the Zaporozhian Cossacks with the help of the Crimean Tatars and the rest were rebellious Ukrainian peasants. Commander of the Zaporozhian Cossacks and Crimean Tatars was a Colonel Illya Holota, who was killed in the battle against the Crown Army forces. The Polish–Lithuanian Commonwealth’s expedition against the Zaporozhian Host consisted of approximately 1,550 men and was commanded by Hetman Władysław Wołłowicz.\nThe Zaporozhian Cossacks and Crimean Tatars got through by the boats to Krasnosel on the Pripyat River and then moved hallway by land. In 17–18 June 1649, the Zaporozhian Cossacks and Crimean Tatars attacked the weaker Polish–Lithuanian Commonwealth’s forces, commanded Hetman Władysław Wołłowicz's absence by Walerian Falencki and Jan Donowaj. They dug in in the Polish–Lithuanian camp in Zahal and the Zaporozhian Cossacks and Crimean Tatars attacked them several times. The Poles and Lithuanians were unexpectedly helped by reinforcements sent from Rzeczyca by another commander of the Polish–Lithuanian Commonwealth expedition against the Zaporozhian Host, the Lithuanian guard Hrehore Mirski, numbered around 150 dragoons and 200 German mercenary infantry. Thanks to the relief attack on the rear of the Zaporozhian Cossacks and Crimean Tatars, the Polish–Lithuanian Commonwealth’s forces from the camp in Zahal were able to enter the field. As a result, the Zaporozhian Cossacks and Crimean Tatars were completely defeated, suffering casualties and losses of about 1,600 killed and wounded men. The Zaporozhian Cossack commander himself, Colonel Illya Holota, was killed in the battle. On the Polish–Lithuanian side, casualties and losses amounted of about 216 killed and wounded men. Among others, one of the commanders, Walerian Falencki, was injured in the battle.\nFrom another source, the outcome of the battle was decided by Captain Samuel Smólski, who, with the fourth Zaporozhian Cossack banners (a type of medium-armed cavalry with a misleading name), defeated the left wing of the Zaporozhian Cossacks. Lightly armed banners of the Crimean Tatars also distinguished themselves in the battle.\nReferences\n*Poleskie ostatki. W: Grzegorz Rąkowski: Czar Polesia. Pruszków: Oficyna Wydawnicza \"Rewasz\", 2005, p. 486, seria: Smak Kresów. .\n*Piotr Borawski: Tatarzy w dawnej Rzeczypospolitej. Warszawa: Ludowa Spółdzielnia Wydawnicza, 1986, p. 134. .\n*Tomasz Ciesielski: Od Batohu do Żwańca. Wojna na Ukrainie i w księstwach naddunajskich 1652–1653. Warszawa: „Inforteditions”, 2008. .\n*Henryk Wisner Janusz Radziwiłł 1612–1655, Wydawnictwo MADA, Warszawa 2000"
    }
  ]
}