{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Tykocin\n\nSweden22px Brandenburg-Prussia\n| combatant2        =  Polish–Lithuanian Commonwealth\n| commander1        =  Boguslaw Radziwill\n| commander2        =  Samuel Oskierko\n| strength1         = Unknown\n| strength2         = Unknown\n| casualties1       = Unknown\n| casualties2       = Unknown\n| campaignbox       =\n}}\nThe Battle of Tykocin took place on 13 July 1656 and was one of battle of the Swedish invasion of Poland. It resulted in a victory of Sweden and Brandenburg forces, commanded by Duke Boguslaw Radziwill, and ended siege of Tykocin.\nBackground\nOn 8 July 1656, Swedish King Charles X Gustav arrived at a military camp of his brother, Duke Adolph John. The camp was located near Nowy Dwor Mazowiecki, and the two leaders discussed news from Swedish-held town of Tykocin in Podlasie. The fortress, located along a strategic route from Warsaw to Lithuania and Swedish Livonia, was besieged by Polish - Lithuanian forces of Colonel Samuel Oskierko. Its loss meant that communication with Swedish-held Samogitia would be cut. Since Charles X Gustav had only 10,000 soldiers, he had to await for the Brandenburg-Prussian army of his ally, Frederick William. Meanwhile, he ordered Duke Boguslaw Radziwill to head to Tykocin and end the siege. Tykocin was besieged by the nobility from Mazovian counties of Łomża and Wizna, and Podlasie Voivodeship. These pospolite ruszenie units were supported by Lithuanian banners of Colonel Oskierko.\nBattle\nBoguslaw Radziwill, together with Swedish forces under Robert Douglas, Count of Skenninge, left Nowy Dwor on 10 July. After a quick march, he reached Tykocin on 13 July, completely surprising the Polish - Lithuanian forces. Radziwill immediately attacked Oskierko and his unit, while nobility from Mazovia and Podlasie, unable to fight experienced Swedish soldiers, fled from the battleground. Radziwill and Douglas chased them, killing a great number of Poles, and capturing eight banners, together with Polish wagons. On 14 July Radziwill entered Tykocin, staying there for three days. By 22 July his unit was back in Nowy Dwor Mazowiecki. The victory enabled Swedish army stationed in central Poland to communicate with forces in Lithuania and Livonia.\nReferences"
    }
  ]
}