{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Jezerc\n\n| combatant1        =  Kosovo Liberation Army\n| combatant2        =  FR Yugoslavia  Russian volunteers\n| commander1        = | Hajrush Kurtaj}}\n| commander2        =  Unknown\n| strength1         =  400 soldiers\n| strength2         =  Thousands (KLA claim)\n| casualties1       =  9 killed 2 wounded\n| casualties2       =  Dozens killed Unknown amount of Yugoslav forces injured\n}}\nThe Battle of Jezerc (; ) was a battle fought between the Kosovo Liberation Army (KLA) and the Yugoslav army on 28 September 1998 in the Operational Zone of Neredime near Kaçanik in the village of Jezerc, during the Kosovo War.\nBackground\nThe Nerodime Operational Zone consisted of 3 brigades and operated in the areas around Ferizaj.\nOn 16 June 1998 the KLA would make their first public entrance in the region in the village of Jezerc which would be the first village under the control of the KLA in Nerodime. On the same date the first battle of the Operational Zona of Nerodime would happen between the meeting of 2 rivers where the vice-commander of the Operational Zone, Imri Ilazi - \"Ferri\" was wounded. Two days later, the KLA set up six war positions in Jezerce, which marked the start of the Frontal war in Ferizaj. On 5 August 1998 many KLA soldiers led under commander Agim Bajrami would march to Jezerc and reinforce the village.\nBattle\nBetween 25 and 28 September 1998, during the Kosovo War, Yugoslav military forces launched an offensive against the KLA in the region of Nerodimë e Poshtme,  carried out by three Serbian units based in the villages of Shushicë, Burrnik, and Semajë, which encircled the village of Jezerc. The assault began with large artillery shelling originating from the three villages, as well as from strategic  positions including a nearby river confluence, Mt. Buq, the pine forests of Štimlje and Dulje, the Jezerc radio antenna, the Pleshinë Water Tower and Ferizaj barracks. In response, the Nerodime Operational Zone sent the Kaçanik Unit, a \"well trained\" unit backed up by engineers, which carried out multiple attacks from the KLA positions in Dramjak , Mollopolcë, and Budakova. Position 6 would take heavy artillery fire, leading to the KLA forces from Ferizaj and Kačanik \"beating\" a tactical retreat to the forest guard barracks below the village and afterwards to the Sharanik meadow. The climax ensued on the 28th of September when 400 lightly armed KLA fighters were pitted against thousands of Yugoslav soldiers. Despite this the KLA were able to resist the Yugoslav army, killing three captains in the Serbian secret police as well as dozens of other Yugoslav soldiers and police officers.\nAccording to the Serbian press some of the police officers killed included Nebojša Jeftić (30), Saša Simeunović (32) and Želko Jovićić and other dozens killed by the KLA defensive positions 1,2,3 and 6. Russian volunteers were also reported to have been wounded in this battle.\nUpon the Yugoslav forces retreating away from the village of Jezerc and its outskirts and being defeated, the KLA would start to move its soldiers in Jezerc elsewhere as a part of its war plans.\nIn culture\nThe date of the battle marks the day of \"Epopeja e Jezercit\" which is the day when the 9 \"martyrs\" of the KLA are honoured.\nSee also\n*Jezerc\n*Battle of Paštrik\n*Ambush near Suva Reka\nReferences"
    }
  ]
}