{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Paniowce\n\n, Ukraine\n| date              = 22 October 1633\n| partof            = Polish–Ottoman War (1633–1634)\n| result            = Polish–Lithuanian victory\n| combatant1        = 23px Polish–Lithuanian Commonwealth\n| combatant2        =  Ottoman Empire MoldaviaBudjak Horde\n| commander1        = 23px Stanisław Koniecpolski\n| commander2        =  Abhaz Pasha\n| strength1         = About 11,000\n| strength2         = About 24,000–55,000\n| casualties1       = Unknown\n| casualties2       = Heavy\n}}\nBattle of Paniowce (also known as the Battle of Kamieniec Podolski) was a battle fought on October 22, 1633, near  in Podolia between Polish-Lithuanian forces and the Turks, supported by Moldavian and Wallachian troops, and the Buda Tatars. It took place during the Polish–Ottoman War (1633–1634).\nThe battle\nOn October 22, Abaza Pasha attacked the Poles with all his strength. Before evening, during the battle. The Nogais and the Turkish cavalry unexpectedly rushed out through the valley of the Musza River on the Polish left wing and confused it badly, tore apart the camp with infantry guarding this flank, and broke into the rear of the troops. Koniecpolski immediately organized a counterattack and repulsed the attackers with a decisive action of the cavalry, infantry and artillery, inflicting significant losses on them. The entire battle ended in a Polish success. The enemy, repulsed on all sides, withdrew behind the Dniester.\nAftermath\nOn October 24, Turkish troops led by Ipshir Mustafa and Aga Suleiman attacked the town. At that time, the well was a typical \"palanka\" surrounded by a rampart, a moat and a palisade, with 8 defensive towers made of wood. It was defended by several hundred Cossacks and local peasants, armed with a large number of firearms, but little ammunition. The first assault ended in failure and brought The Turks suffered significant losses. Among the dead was Pasha Kiajajeri, the commander of the Janissary troop from Adrianople. The next attack was also unsuccessful. Only after three days of fighting, when the defenders ran out of ammunition, the Turks. Abaza immediately sent the banner captured in Studzienica to the Sultan as a proof of victory.\nReferences"
    }
  ]
}