{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Mount Tambu\n\n|result = Allied victory\n|combatant1 =\n|combatant2 =\n|commander1 =  Murray Moten\n|commander2 =  Fukuzo Kimura Sakai Sugiyama\n|units1=\n* 17th Brigade\n* 42nd Infantry Battalion\n* 1/162nd Infantry Regiment\n|units2=\n* II/66th Infantry Regiment\n* III/66th Infantry Regiment\n|strength1 = One brigade +\n|strength2 = Two understrength battalions\n|casualties1=\n|casualties2=\n}}\nThe Battle of Mount Tambu was a series of actions fought in the Salamaua area of the Territory of New Guinea between Allied and Japanese forces, which took place between 16 July and 18 August 1943, during World War II. The battle formed part of the wider Salamaua–Lae campaign and was fought in the final stages of the campaign, which had seen a combined Australian and US force advance from Wau towards Salamaua following the repulse of the Japanese attack on Wau in late January and early February 1943. After several frontal assaults on the position by Australian and US infantrymen were rebuffed by determined Japanese defenders, an indirect approach was sought and flanking moves were undertaken to cut off the Japanese supply route along the Komiatum Track. This succeeded in eventually forcing the Japanese off the position as they withdrew to avoid encirclement.\nBackground\nIn late January and early February 1943, Japanese efforts to secure a vital airfield at Wau were checked by a small Australian force, leading to the end of Japanese attempts to capture Port Moresby. This victory was followed up by the Australians as they pushed into the surrounding area. Following actions around Mubo and Lababia Ridge in late June and early July 1943, the Australian troops from Brigadier Murray Moten's 17th Brigade was ordered to push towards the Komiatum and Mount Tambu area—about  from Salamaua—as the Allies advanced towards Salamaua, with a view to tying down Japanese reserves there, to divert their attention away from Lae.\nBattle\nThe highest feature on the route between Mubo and Salamaua, Mount Tambu consisted of a series of steep razorback ridges that were covered in dense jungle. Throughout July and August, troops from the Second Australian Imperial Force 2/5th and 2/6th Infantry Battalions and the Militia 42nd Infantry Battalion, undertook a series of actions around Mount Tambu and Komiatum. The area was defended by around 700 Japanese troops, from two battalions of the 66th Infantry Regiment under the command of Lieutenant Colonel Fukuzo Kimura and Major Sakai Sugiyama; initially the position was defended by only Sugiyama's II Battalion but in mid-July, Kimura's III Battalion arrived to reinforce them. These actions were fought in conjunction with actions in the surrounding area, which also included attacks on Bobdubi, an amphibious landing by US troops at Nassau Bay and actions around Roosevelt Ridge.\n, an Australian stretcher bearer, evacuates an American soldier wounded during the fighting on Mount Tambu]]\nThe initial Allied assault was made by troops from the 2/5th on 16 July 1943 and the Australians secured part of the southern slopes of Mount Tambu. The Japanese began to counter-attack that night but were repulsed with heavy losses: the Australians suffered 39 casualties, including 14 killed, while the Japanese lost around 350 men in the eight attacks before dawn. Shortly after this, Kimura's battalion arrived to reinforce the Japanese positions as the Japanese high command determined the need to hold Tambu. On 24 July, the 2/5th launched a further attack across a steep ravine, which had to be crossed to reach the summit of the position. A small group reached the top but they were eventually forced off following fierce fighting. On the periphery, the 58th/59th and 2/7th Infantry Battalion were heavily engaged around the \"Old Vickers\" position, during the fighting around Bobdubi, while the 24th Infantry Battalion was engaged in \"security and diversionary roles\", trying to draw Japanese forces away from the main Australian forces.\nOn 28 July, the several companies—consisting of about 400 men—from the 1st Battalion, 162nd Infantry Regiment, which had landed at Nassau Bay earlier in the month, arrived and relieved some of the Australian forces in the forward positions around Mount Tambu. Australian mortar crews and stretcher bearers remained in the line supporting the US troops, while one company from the Australian 2/5th Infantry Battalion continued to maintain a base around the mountain. On 30 July, an uphill company-level attack was made by the American troops, which failed. For his efforts in rescuing 12 wounded US soldiers during the attack while under fire, an Australian stretcher bearer from the 2/5th Infantry Battalion, Corporal Leslie Allen, was awarded the US Silver Star; his actions were captured in a photograph by Gordon Short.\nThe Australian commander, Moten, looked for an indirect approach, focusing upon cutting the Japanese defenders' supply route along the Komiatum Track. This was completed on 16 August 1943, when the 2/6th Infantry Battalion secured the southern part of the Komiatum Ridge and then held it against determined Japanese counter-attacks, supported from its flanks by heavy machine gun fire from the 2/5th and small arms from the 42nd from Davidson Ridge. The Japanese defenders then withdrew from the position as they became threatened with encirclement.\nAftermath\nOperations in the area continued for the rest of August and into September as the Japanese fought to hold the Allied advance on their final defensive line in front of Salamaua. Nevertheless, the Francisco River was crossed in late August, and the main Japanese position around Charlie Hill was taken in the first week of September. The Allies also launched a seaborne landing near Lae and an airborne landing at Nadzab as part of an operation to secure Lae, which Allied planners considered more important than Salamaua. Pressure had been maintained on Salamaua in an effort to draw reinforcements away from Lae but as the Lae operation developed, the Japanese moved about 5,000 to 6,000 troops away from Salamaua by sea, abandoning the badly bomb damaged town. In early September, Major General Edward Milford's 5th Division headquarters took over from the 3rd Division and the Australians launched the final effort to secure Salamaua. Bad weather hampered their efforts but the airfield and vicinity were eventually secured on 11 September by Australian forces from the 15th and 29th Brigades, after a brief engagement with the Japanese rearguard. Australian losses in the campaign were 343 men killed and 1,083 wounded, and 8,100 Japanese casualties, 2,722 being killed.\nReferences\nCitations\nBibliography\n*\n*\n*\n*\n*\n*\n*\nExternal links\n* [http://www.diggerhistory.info/pages-battles/ww2/salamaua.htm The Battles For and Around Salamaua]\n* [https://web.archive.org/web/20080116014658/http://www.ww2australia.gov.au/pushingback/wausalamaua.html Pushing Back: Wau to Salamaua]"
    }
  ]
}