{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Fort Bull__disambig_1\n\n| map_type          =\n| latitude          =\n| longitude         =\n| map_size          =\n| map_marksize      =\n| map_caption       =\n| map_label         =\n| territory         =\n| result            = French victory\n| status            =\n| combatant1        =\n* Colony of CanadaHuronIroquois\n| combatant2        =\n| commander1        = Chaussegros de LéryCollière\n| commander2        = William Bull\n| units1            =\n| units2            =\n| strength1         = 84 Troupes de la Marine166 Canadian militia90 Iroquois 20 Huron\n| strength2         = 111 regulars\n| casualties1       = 1 dead2 wounded\n| casualties2       = 76 dead35 taken prisoner\n| notes             =\n| campaignbox       =\n}}\nThe Battle of Fort Bull was a French attack on the British-held Fort Bull on 27 March 1756, early in the French and Indian War. The fort was built to defend a portion of the waterway connecting Albany, New York to Lake Ontario via the Mohawk River.\nLt. Gaspard-Joseph Chaussegros de Léry led his command consisting of forces from the Troupes de la Marine, Canadien militia, and Indian allies on an attack against Fort Bull on 27 March 1756. Shielded by trees they sneaked up to within  of the fort. Léry ordered a charge at the fort with bayonets. They stuck their muskets into the narrow openings in the fort and shot the defenders. Léry repeatedly asked for their surrender. Finally, the gate was crashed in and the French and Indians swarmed in, killing everyone they saw. The French soldiers looted what they could and set the powder magazines on fire. The fort was burned to the ground.\nBackground\nThe establishment of Fort Oswego (modern Oswego, New York) in the 1720s on the south shores of Lake Ontario (called Lac de Frontenac by the French) represented the first British toehold in what until then had been a \"French lake\", and was regarded as a major threat by the French. The French had dominated the Great Lakes and with it the lucrative fur trade, and were determined to keep the Great Lakes for themselves. However, the 1720s-30s were a period of Anglo-French détente in Europe with both the duc d'Orleans, the Regent for the boy king Louis XV in France, and Prime Minister Sir Robert Walpole in Britain, being committed to a policy of peace. Though the French protested at the establishment of Fort Oswego, saying the Great Lakes were part of New France, neither Paris nor London wanted a war over a fort in far-away North America, and so the matter rested for the moment. Versailles and Whitehall both agreed to an understanding that the British would not build any more forts on the Great Lakes in exchange for which the French tolerated Fort Oswego. Fort Oswego was a remote frontier post located in the wildness, and in the words of the Canadian historian René Chartrand its \"Achilles heel\" was its supply lines. The period of Anglo-French détente and peace which both Walpole and the duc d'Orleans pursued gave way to a period of war in the middle 18th century. France and Britain went to war in the inconclusive War of the Austrian Succession which was followed by the Seven Years' War, which began in North America in 1754 when the Virginia militia under the command of George Washington made a very unsuccessful attempt to expel the French from the Ohio river valley.\nFollowing the failure of aggressive British campaign plans in 1755, a chain of forts along the Mohawk River riverway connecting the Hudson River to Lake Ontario were garrisoned during the winter of 1755–1756. The largest garrison was left at Fort Oswego, at the end of the chain, which depended on the others for its supplies. Two forts along the Oneida Carry were a key element of this supply chain. The Oneida Carry traversed an unnavigable section between what is now Rome, New York and Wood Creek that was between one and six miles long, depending on seasonal water levels. Wood Creek in its turn flowed into Oneida Lake, which flowed into the Oswego river that ran into Lake Ontario. On the other side of the Oneida Carrying Place was the Mohawk river, which flowed into the Hudson river, which in its turn flowed into the Atlantic Ocean. Fort Williams, on the Mohawk, was the larger of the two, while Fort Bull (modern Rome, New York), several miles north of Fort Williams on Wood Creek, was little more than a palisade surrounding storehouses. Fort Bull was garrisoned by a small number of men from Shirley's Regiment under William Bull, and held large quantities of military stores, including gunpowder and ammunition, destined for use in the 1756 campaign. Shirley's Regiment was a British Army regiment raised in New England with the majority of the soldiers coming from the colonies of New Hampshire, Massachusetts, Rhode Island Plantation, and Connecticut.\nThe assemblies of Pennsylvania and Virginia had only voted for enough money to defend their frontiers while the assemblies of the New England colonies had raised more men than what Shirley had requested after London had promised to pay off their debts if they would contribute to the war. Shirley took the surplus men into the 50th Regiment, known as Shirley's regiment. The majority of the Shirely's regiment, who arrived in the Oneida Carry on 2 September 1755 were described by the American historian Gilbert Hagerty as \"raw\" and \"untrained\". Following the Battle of Lake George in September 1755, an Anglo-Iroquois victory that saw the deaths of many of the warriors from the Iroquois Six Nations who had been fighting on the British side, the Six Nations had pulled out of the war and declared their neutrality. Shirley had ambitious plans for the 1756 campaign to take Fort Duquesne (modern Pittsburgh, Pennsylvania), Fort Rouillé (modern Toronto, Ontario), Fort Saint-Frédéric (modern Crown Point, New York), Fort Niagara (modern Youngstown, New York), and Fort Frontenac (modern Kingston, Ontario) with the campaign to culminate with taking Quebec City. Since the New England colonies had voted more money and raised more men than did either Pennsylvania and Virginia, Shirley was focused on his plans for a campaign on the Great Lakes rather in the Ohio river valley.\n, the Governor General of New France, sent an Oswegatchie, to work as a spy, and find out what was going on at the Oneida Carry.]]\nIn the fall of 1755, Onondaga Indian travelers passing through Montréal mentioned to the French that the British were building two warehouses at the Oneida Carrying Place. The Marquis de Vaudreuil, the Governor-General of New France, hired Ou8atory, an Oswegatchie of Oneida descent, to work as a spy, and find out what was going on at the Oneida Carrying Place. Ou8atory returned to report that the British had built two supply-houses at the Oneida Carry, where they were stockpiling weapons, ammunition, bateaux, and other supplies for a spring offensive.\nIn early 1756 French military leaders in Canada decided to send a raiding expedition to attack Oswego's supply line. As the waters melted south of Lake Ontario an average of two weeks before the waters north of Lake Ontario did, the French feared the British would be able to launch an offensive in the spring to seize the main French forts, namely Fort Niagara  and Fort Frontenac before the French forces in Montréal could come to their relief. Vaudreuil chose to launch a preventive strike to destroy the British warehouses in the Oneida Carrying Place in the winter, and selected Lieutenant Gaspard-Joseph Chaussegros de Léry of the  Troupes de la Marine to command the strike force. Vaudreuil admitted that a winter strike was dangerous, going on to write in a report to Paris \"...but the situation became urgent and I could not defer it without running the risk of being forestalled by the enemy at Niagara and at Fort Frontenac\".\nThe Troupes de la Marine were under the control of the Ministry of the Marine, which ran the Royal French Navy and all of the French colonies, dressed in distinctive white and blue uniform, and were recruited in France for an 8-year period of service. Though the men of the Troupes de la Marine were recruited in France, many of the officers were Canadiens. From the 1690s on, the sons of the seigneurs of New France had often been attached to the Troupes de la Marine as cadets starting in their teenage years before securing a commission in the Troupes de la Marine, meaning that many of officers of the Troupes de la Marine were familiar with frontier warfare and knew the Indian languages. Chartrand wrote the Canadian-born officers of the Troupes de la Marine'' had \"...devised an unwritten tactical doctrine that combined the best elements of European organization and discipline with the American Indians' extraordinary ability to travel great distances largely undetected and mount very fierce attacks\". In New France, all able-bodied men had to serve in the militia from the ages of 16 to 60 with every parish being organized into a company that practiced war games once every month. The French-Canadian militia wore no uniforms and received no pay, but received a gun, ammunition and other equipment from the French state when called up. As almost every Canadien man owned a gun, was a good shot having been using flintlocks from childhood onward and as many French-Canadians worked as voyageurs in the fur trade, they knew the frontier very well. Chartrand called the militia of New France \"fierce and outstanding bush fighters\".\nIn the late 17th century, large numbers of Iroquois were converted to Roman Catholicism by French Jesuits, and as a result, many Catholic Iroquois chose to settle at Kanesatake and Kahnawake outside of Montréal, where they were intended by the French to serve as a buffer to protect Montréal, the center of the French fur trade. Historians call the Catholic Iroquois living outside of Montréal the Canadian Iroquois while the Iroquois who remained in Kanienkeh (\"the Land of the Flint\", the Iroquois name for their historical homeland in what is now upstate New York) are known as the League Iroquois. Today, the descendants of the Canadian Iroquois are called the Seven Nations of Canada. The Canadian Iroquois considered the French to be their allies, not their superiors, with the Onontio (the Iroquois term for the governor-general of New France) who represented the \"Great Onontio\" (the King of France) merely an especially important ally whose ways were somewhat strange and had to be constantly humored in order to obtain the European goods that the Iroquois valued so much. As the French did not know the part of Kanienkeh where the Oneida Carrying Place was located very well, they needed the assistance of the Canadian Iroquois to guide them there. Vaudreuil considered destroying the warehouses at the Oneida Carrying Place so important that though he did not want a war with the League Iroquois, he ordered Léry to attack the League Iroquois if any of them objected to the French being in Kanienkeh. From the French viewpoint, it was better to keep the League Iroquois neutral rather than having them fight on the side of British, which was especially the case as the League Iroquois and Canadian Iroquois had a notable reluctance to fight one another.\nThe Canadian Iroquois chiefs and clan mothers were dubious about the French plans for a winter strike at the Oneida Carry, and Léry reported that one Mohawk chief, Missakin was only convinced on 25 February 1756 \"by the words that I [Léry] gave to him in the name of Monsieur de Vaudreuil...He joined me, along with his band\". On 29 February 1756, Léry's force of Troupes de la Marine, French-Canadian militiamen and Canadian Iroquois war bands left Montréal. As they marched, Léry picked up more volunteers from the Iroquois communities, by promising them that they would not be assaulting forts and they would only fight against the British, not the League Iroquois. On 9 March 1756, Léry learned from an Akwesasne war band that the British had built two forts at the Oneida Carrying Place, information that he chose not to share with the Canadian Iroquois accompanying his expedition.\nled a force to Oneida Carry, consisting of troupes de la Marine, Canadian militiamen, and 110 First Nations.]]\nOn March 12, a company of men left Fort de La Présentation and began an overland trek toward the Oneida Carry. Under the command of Lieutenant Gaspard-Joseph Chaussegros de Léry, a Canadian-born seigneur, the force consisted of 84 troupes de la Marine, 111 Canadian militiamen, and 110 natives, mostly Iroquois but also some Hurons. On 13 March 1756, an Oswegatchie traveler told the Canadian Iroquois about the British forts at the Oneida Carrying Place, which caused them to demand a halt. The Canadian historian D. Peter MacLeod called the arguments between the French and the Canadian Iroquois a cultural clash, writing\nFor French officers such as Léry, a military operation could still be a success if half their subordinates became casualties, providing that it had achieved a sufficiently important objective. This perspective was not necessarily shared by soldiers and militiamen for whom personal survival might take precedence over the achievement of abstract imperial goals. For Amerindians, on the other hand, no amount of prestige from a military operation was worth the loss of a single life. When Canadian Iroquois fighters went to war, they employed many of the strategies and tactics of the hunt. Successful hunters used stealth and cleverness to assure themselves of the maximum advantage and sought to kill an animal quietly and efficiently. Getting mauled by a bear, lost, shot by accident and harmed by any of the other dangers incidental to hunting would turn an otherwise successful hunt into a grim failure.\nAs the Canadian Iroquois population was much smaller than the French population, the purpose of war for them was to take prisoners without suffering losses in return, and as such assaulting a fort was out of the question for them. Furthermore, Léry as the product of the authoritarian French state expected his orders to be obeyed unconditionally while the Iroquois war chiefs were merely first among equals, who had to seek a consensus from their warriors before acting.\nThe Iroquois demanded that the planned attack on the forts be scrapped, and instead argued for raiding the British settlements along the Mohawk river valley. Léry stated that as an officer of the Troupes de la Marine he expected his orders to be obeyed without question, and upon seeing the Iroquois would not obey his orders and many were deserting, he told them there were no forts at the Oneida Carry, and that they would be \"delighted to find many Englishmen there; that the Onontio had sent me to fight them\". Many of the Indians were not impressed, and went home. After nearly two weeks of difficult winter travel, they arrived near the carry on March 24.\nBattle\n, mobilized the New York militia when reports of a French-Native force was incoming. However, he later sent the militia home when he received word that earlier reports were false.]]\nAll through the winter, the British garrisons at Fort Bull and Fort Williams had been on a half-rations following the freezing of the Mohawk river, and many men were suffering from scurvy. On 12 March, a messenger from Fort Williams told Sir William Johnson, the Superintendent of Northern Indian Affairs, that an Indian traveler had told them that a force of 300 French and Indians were heading towards the Oneida Carry, which caused Johnson to call up about 1,000 New York militiamen and start marching up the Mohawk river valley, only to send the New York militia home three days later when Johnson received word that it was a false rumor. Lieutenant Colonel James Mercer at Fort Oswego had been planning on abandoning the fort on 25 March to head back to Schenectady when 14 bateaux arrived in the middle of March, which persuaded him to stay on. However, despite the opening of the supply line along the Hudson and Mohawk to bring up supplies from Albany, the garrisons at both Fort Williams and Fort Bull were still weakened by their long winter of hunger. One consequence of their isolation and physical weakness was no patrolling had been done, and the British had no idea that an expeditionary force had left Montreal at the end of February heading for the Oneida Carry. The American historian Fred Anderson wrote that name Fort Bull was a misnomer as the fort was \"...was not so much a fort as a way station: a collection of storehouses and barracks, enclosed in a single palisade\".\nOn 26 March, the Franco-Indian expeditionary force had come within two kilometres of the Oneida Carrying Place. Very early on the morning of 27 March 1756, the Canadian Iroquois ambushed a British wagon train bringing supplies to Fort Bull, taking 9 wagons and capturing 10 men. As the French had not eaten for two days, the capture of the wagon train provided some much needed food. One of the British Army's teamsters, a freedman, was able to escape from the ambush and made off in his wagon to Fort Williams. As far as the Canadian Iroquois were concerned, the expedition was over as they had engaged the enemy, taken prisoners and supplies without suffering any losses, and the majority wanted to go home. The Iroquois regarded the Western style of war as \"irrational\" and saw no point in making a \"suicidal\" attack against Fort Bull that was likely to cause heavy losses. The Iroquois told Léry that \"if I absolutely wanted to die, I was the master of the French, but they were not going to follow me\". The Iroquois war chiefs also informed Léry \"the Master of Life has favored us, here is the food, here are the prisoners, let's return home\". Ultimately, following much negotiation, 30 Iroquois agreed to join the assault on Fort Bull together with 259 French soldiers and French-Canadian militiamen.\nLearning from the prisoners of Bull's minimal defenses, Léry decided to immediately attack on the morning of 27 March 1756. As he had no field pieces, the only possibility was to attempt storming the fort by surprise. On that day, Fort Bull was occupied by 25 soldiers of 50th (Shirley's) Regiment plus 34 carpenters, boatmen and carters together with three women. At about 11 am, the French and Indians began to approach Fort Bull silently when the Indians gave a war cry that alerted the British. Léry asked that the Iroquois refrain from their \"horrendous war cries\" that were meant to strike terror in the heart of the enemy in order to take the British by surprise, but at about 900 feet (275 m) away from Fort Bull, the Iroquois gave their customary war cries. Seeing the British were alerted, the French shouted \"Vive le roi!\" (\"Long Live the King!\") as they charged forward. The fort's defenders managed to get its gate closed just before the French force arrived. Léry wrote \"the fort's gate being stronger than I thought, it could only be collapsed by [striking it piece] by piece\". Of the Iroquois, Léry wrote only six stayed with him as the rest \"ran off into the woods in pursuit of six Englishmen\" who had not been able to get into the fort before the gate had been closed.\nThe attackers managed to fire through loopholes in the fort's walls to distract the garrison, which responded by throwing rocks and grenades over the walls. The French and the Indians fired through the loopholes, trapping much of the garrison within the buildings while the militiamen tried to chop their way in through the wooden walls with tomahawks and the troupes de la Marine used their axes to try to smash their way in through the main gate. The tomahawks proved ineffective at smashing through the gate, and Léry in his report mentioned smashing his way in with \"à coup de haches\" (\"by ax blows\"), suggesting that heavy axes were used. Speaking through an interpreter, Léry demanded that the fort surrender, but he reported that \"the fire of the enemy became livelier and more determined\". Léry wrote Bull's defense was conducted \"with all the possible bravery and intrepidity that I have always remarked of with English officers\". Collière, the Iroquois chief was killed by a bullet going through his head fired by Colonel Bull. After Bull refused several calls to surrender, the gate was smashed down at about noon by using a fallen tree trunk as a battering ram, and the attackers stormed into the fort. Ignoring the ineffective British musket fire, the French charged forward and used their bayonets and tomahawks to cut down any British soldier in their path as they raced throughout the fort. One of the Iroquois warriors avenged Collière's death by using his tomahawk to smash in Bull's head. The wife of Bull was killed by an Iroquois warrior who smashed in her face with his tomahawk, scalped her,  and accidentally caused a fire when he tossed her corpse into a fire, pulled her corpse out with a burning skirt that according to the French \"set fire to the house\".\nLéry wrote: \"I could not restrain the ardor of the soldiers and the Canadiens. They killed everyone they encountered. Some soldiers barricaded themselves in the barracks, which were broken open...Only a few soldiers and one woman [Ann Bowman] were fortune enough to hide themselves from the first fury of our soldiers and Canadiens...all the rest were slaughtered without daring to make the least resistance.\" Nearly all of the small garrison was killed and scalped, according to a report by Sir William Johnson, who inspected the carnage when he eventually arrived at the head of a relief column. Of the 62 people in Fort Bull, only 3 soldiers, one carpenter and Ann Bowman survived. Bowman refused to give her profession or explain what she was doing at Fort Bull when she was captured by the French, and it seems likely that she was a prostitute. Léry's men set fire to the works, which included 45,000 pounds of gunpowder. The resulting conflagration destroyed the wooden fort. Léry reported that he had destroyed all of the cannonballs, grenades, and shells plus clothing for 600 men, and 1,000 blankets while taking barrels full of biscuits, salt pork, butter, chocolate and alcohol back to New France. The French also destroyed 16 bateaux and several wagons and killed about 100 horses at Fort Bull. The French had lost one killed plus two wounded while the Iroquois had lost 2 dead and 2 wounded. The powder magazine exploded with unexpected force and one Iroquois was killed by the flying debris. One officer of the troupes de la Marine wrote that he found it \"astonishing that the English garrison with all its grenades and all its musket fire killed so few people\". Another French officer, de Charley, in a report wrote: We marched to Fort Bull, where the enemy had about 100 men. The Indians refused to march to it. The French soldiers cut down the palisade, broke down the gate with ax bows, in spite of the shooting and the grenades hurled [at them]. The usual lack of precautions by the Canadiens caused a fire at the powder magazine and burned all the supplies; the garrison was cut down except for three or four prisoners. We had three killed and seven wounded.\nChartrand wrote some of the inaccuracies in de Charley's report can be explained in that he was part of the expedition, but he did not see the battle first-hand as de Charley was a medical major who would be kept away from the battle in order to tend to the wounded.\nThe Canadian Iroquois praised Léry only for his good luck in taking Fort Bull with so little loss, and pointedly said nothing about any skill on his part: in Iroquois terms praising a commander only for his good luck in conducting operations was an insult as luck was a random quality outside of the control of any individual. On the same day, the African-American teamster who had escaped the ambush, came racing into Fort Williams on his wagon with news of what happened. The commander of Fort Williams, Mercer, sent out a patrol of one sergeant and 15 privates plus one American civilian volunteer named Robert Eastburn out to investigate. Eastburn was a blacksmith from Philadelphia who went out unarmed on the patrol, which Chartrand noted makes one wonder just what was the precise reason for attaching him to the patrol. Eastburn had just arrived in Fort Williams and for reasons that remain unclear seemed to have thought he would be safer with the patrol instead of staying in the fort. The patrol was ambushed in a clearing in the forest by 73 Canadian Iroquois who opened fire on them, returned one volley before breaking, which led to the Iroquois setting off in hot pursuit of the retreating British in search of prisoners. Afterwards, the Iroquois rejoined the French, and Eastburn, who had been taken prisoner, wrote: \"As soon as they got together, (having a Priest with them) they fell on their knees and returned thanks for their victory\". MacLeod noted that the difference between French and Iroquois warfare can be seen in that the Iroquois during their ambush spared the lives of the men they captured and took them back to be adopted by Iroquois families while the French killed almost everyone at Fort Bull. The Iroquois always needed prisoners to increase the size of the tribe as they were keenly aware of their numerical inferiority while the French regarded the prisoners they had taken as an annoyance whose lives were worth nothing.\nAs Eastburn was marched back, he recalled with horror that the Iroquois in front in him was carrying a stick with all the bloody scalps impaled through it swung over his shoulder while behind him he was constantly being poked with a sharp stick by the Iroquois walking behind him, causing his face to be uncomfortably close to the scalps still dripping with blood. Every so often, the Iroquois gave what Eastburn called terrifying \"dead shouts\" to thank the Master of Life for the scalps and prisoners they had taken, whose sound chilled him to the bone. Eastburn was taken back to Kanesetake, where he was forced with other prisoners to dance completely naked before the Iroquois, remembering that at the end of the dance \"...the Indians gave a shout, and opened the ring to let us run and then fell on us with their fists and knocked several down\". Afterwards, Eastburn was handed over to an Oswegatchie family, was adopted by them, and informed that he was now an Iroquois. Eastburn had no desire to be an Iroquois, escaped from Kanesetake, and in 1758 published a book in Philadelphia entitled A Faithful Narrative, of the many dangers and suffering, as well as the Wonderful Deliverance of Robert Eastburn, during his Late Captivity Among the Indians: Together with Some Remarks upon the country of Canada, and the religion and policy of the inhabitants: the whole intermixed with devout reflections.\nJohnson reported upon arriving at the ruins of Fort Bull that he \"found within the fort twenty-three soldiers, two women and one Battoe Man, some burned almost to ashes, others inhumanely butchered & all scalped...I imagine the whole number killed or missing is 62, thirty of which I found and buried\". Johnson also reported that several of the corpses were missing organs, such as their hearts, which he knowing the customs of the Iroquois, led him to argue that the missing organs had been eaten (the Iroquois believed that one could gain the bravery of a brave man by eating his heart). Johnson buried all of the bodies he found in the ruins of Fort Bull in a mass grave as he was unable to identify the corpses. The French accounts do not mention either the scalping or the cannibalism alleged by Johnson, and since that time French and Canadian historians vehemently denied these allegations. British propaganda later made much of the allegations that the men at Fort Bull had been scalped, but Chartrand wrote that there were only six Iroquois warriors present during the battle, two of whom were killed, so it is unlikely that the majority of the people killed at Fort Bull were scalped when they were alive. However, it is possible that after the battle that the Iroquois did scalp the corpses as a gesture of disrespect to the British. Chartrand further noted that when whites, especially Anglo-American whites, were defeated by Indian forces that the actions were always branded a \"massacre\" rather than a \"battle\", which provided \"an excuse of sorts\" for the defeat. In this regard, Chartrand denied there was a massacre at Fort Bull, writing that most of the defenders were killed when the powder magazine exploded after catching fire after an Iroquois warrior accidentally set it alight, and the claim of a \"massacre\" was simply a way of explaining away a defeat.\nLéry decided that Fort Williams was too strong to take with its garrison alerted. After destroying Fort Bull, the French headed north, arriving at Niaouré Harbor (modern Sackets Harbor, New York) on 3 April, when there were 9 bateaux full of supplies, which Léry had to send back to Montreal as he already had more than enough supplies with all of the barrels he captured at Fort Bull. On 10 April, Léry arrived in Montreal to write a report on the successful operation for the Governor-General.\nAftermath\nin August 1756.]]\nOne consequence of the destruction of Fort Bull was that the bateauxmen became markedly reluctant to cross the Oneida Carry as their fear of being ambushed by the French and the Indians overwhelmed their desire to make money by portaging supplies, which further cut off Fort Oswego. The destruction of Fort Bull marked the beginning of a whole series of French and Indian raids on the New York frontier, which made bateauxmen afraid of \"the Enemys Schulking parties\" as Mercer complained from Fort Oswego. The crews of the bateaux refused to cross the Oneida Carry unless the British Army provided them with guard as almost all whites had an obsessive fear of being captured by the Indians, whose practice of taking scalps was the cause of much dread. However, by paying a danger premium and by providing guards, boatmen could still be persuaded to cross the Onedia Carry and between 1 April-25 May 1756 two hundred whaleboat and five hundreds bateaux worth of supplies were hauled across the Onedia Carry to Fort Oswego.\nSir William Shirley in a report to the War Office in London on 7 May 1756 complained about how the League Iroquois were unwilling to support the British on the New York frontier, describing how the \"scalping parties of the French Indians, who have found a means to cut off a small fort and party of 25 men at one end of the Great [Oneida] Carrying Place\". A star-shaped wood stockade with four interior buildings was built in May–August 1756 as Fort Wood Creek. Fort Wood Creek was demolished by the British in August 1756 when reports of another French force was received. Léry was promoted to captain for his successful command. The loss of the supplies at Fort Bull effectively ruined any British plans for military campaigns against the French forts on Lake Ontario, and contributed to the French capture of Fort Oswego in August 1756. With the destruction of supplies at Fort Bull, the British plans for a spring offensive on Lake Ontario were foiled, and with the French enjoying mastery on the Great Lakes, Vaudreuil could focus on his plans to take Fort Oswego, the main British fort on Lake Ontario, whose existence had long been regarded as a threat by the French.\nAfter the destruction of Fort Bull and the fall of Fort Oswego, the westernmost frontier of the British Empire in North America was now Fort Herkimer and the German Flatts  settlement (modern Herkimer, New York) inhabited by settlers from the Palatine region of the Holy Roman Empire and other states on the Middle Rhineland in what is now modern Germany. As the largest contingent of the German settlers came from the Electorate of the Palatine, they were popularly called the Palatines, regardless if they came from the Palatine or not. To reinforce the threatened frontier, several British Army regiments were rushed up, much to the annoyance of the Palatine settlers who complained to the Oneida Indians that the presence of these troops was likely to bring fresh French attacks and hence fighting that might devastate their settlements. Unlike the frontier in Pennsylvania and in the Ohio river valley, where white settlers and the Indians had bloodstained relations, leading to hundreds of killings, relations between whites and Indians in Kanienkeh were friendly; between 1756 and 1774 only 5 whites were killed by the Indians while 6 Indians were killed by Anglo-American soldiers or settlers. The Palatine settlers sent messages to Vaudreuil via the Oneida, proclaiming their wish to be neutral in the Seven Years' War, saying that they cared neither for the British nor the French, and only wished to live in peace. An Oneida Indian passed on a message to Vaudreuil in Quebec City, saying: \"We inform you of a message given to us by a Nation that is neither English, nor French nor Indian and inhabitants the lands around us...That Nation has proposed to annex us to itself in order to afford each other mutual help and protection against the English\". Vaundreuil in reply stated \"I think I know that nation. There is reason to believe they are the Palatines\". Vaudreuil went on to say that neutrality was not an option for anyone in this war, and if the Palatine settlers wanted peace, they should submit to the King of France at once. On 12 November 1757, the principle Palatine settlement, German Flatts, was destroyed in a night attack by 200 Mississauga and Canadian Iroquois Indians plus 63 troupes de la Marine and New France militiamen, which marked the end of the Palatine effort at neutrality in the Seven Years' War.\nReferences\nBibliography\n*\n*\n* . First published in 1884; see the book's article, Montcalm and Wolfe, for other editions.\nFurther reading\n* .\n* ."
    }
  ]
}