{
  "content": [
    {
      "type": "text",
      "text": "# Battlesden House\n\n| start_date           =\n| completion_date      =\n| inauguration_date    =\n| renovation_date      =\n| demolition_date      =\n| destruction_date     =\n| height               =\n| diameter             =\n| antenna_spire        =\n| roof                 =\n| top_floor            =\n| other_dimensions     =\n| floor_count          =\n| floor_area           =\n| seating_type         =\n| seating_capacity     =\n| elevator_count       =\n| main_contractor      =\n| architect            =\n| architecture_firm    =\n| structural_engineer  =\n| services_engineer    =\n| civil_engineer       =\n| other_designers      =\n| quantity_surveyor    =\n| awards               =\n| ren_architect        =\n| ren_firm             =\n| ren_str_engineer     =\n| ren_serv_engineer    =\n| ren_civ_engineer     =\n| ren_oth_designers    =\n| ren_qty_surveyor     =\n| ren_awards           =\n| url                  =\n| references           =\n}}\nBattlesden House was a large manor house situated in parkland, Battlesden Park, close to the hamlet of Battlesden in Bedfordshire, England.\nA manor house was constructed in the late 16th century and was associated with the family of Lord Bathurst before he sold the estate to Sir Gregory Page in 1724. The estate was later inherited by Page's great-nephew Sir Gregory Page-Turner in 1775.\nThe original house was demolished in 1860 and a new house was built in 1864. This had 40 rooms and a large ballroom and cost £70,000 to build, while the surrounding parkland and lake were created by Sir Joseph Paxton. However, the owner, Sir Edward Page-Turner did not like the house, preferring to let it to a wealthy tenant before selling the estate to Francis Russell, 9th Duke of Bedford in 1885. The Duke, who already owned two country houses in the county, was interested in the land rather than the building, so he ordered the partial demolition of the house in 1886. Only the ground floor was retained, which was used as a nursing home during the First World War and a maternity home in the Second World War. This was demolished after the war leaving just the Garden House, which is today a private dwelling. Two identical lodges built in a style to match the house, one on the A5 Watling Street and the other on A4012 (now, in 2019, the B5704) near Milton Bryan provided access to the estate, and remain in existence although in private ownership.\nAccording to legend, the house was haunted by the ghost of a steward, who would recite the rhyme:\n:'Milk and water I sold ever,\n:Weight and measure I gave never\n:And I shan't rest, never, never.'\nReferences"
    }
  ]
}