{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Canhe Slope__disambig_1\n\nThe Battle of Canhe Slope, alternatively the Battle of Canhebei (), was a battle in the history of China in 395 where the Xianbei-led Later Yan dynasty, then ruling over northern and central China, had launched a punitive campaign against its former vassal, the Northern Wei dynasty, also of Xianbei extraction.\nLater Yan forces were led by its crown prince Murong Bao and enjoyed some initial successes, but after being frustrated by the containment strategy of the Northern Wei ruler Tuoba Gui (Emperor Daowu), withdrew.\nTuoba Gui then gave chase and crushed the Later Yan forces at Canhe Slope (Canhebei, 参合陂). He captured a large number of the Later Yan forces, but in fear that releasing them would allow a future Later Yan campaign against the Northern Wei, slaughtered them.\nThe battle reversed the power relations between the Later Yan and Northern Wei. After Later Yan's emperor Murong Chui (Emperor Wucheng) died in 396 and Murong Bao (Emperor Huimin) succeeded to the throne, the Northern Wei would launch a debilitating campaign of conquest against the Later Yan, and by 398 had captured most of the Later Yan's territory, reducing the Later Yan to a small regional state.\nPrior Later Yan–Northern Wei relations\nNorthern Wei's predecessor state Dai had previously been a vassal to Later Yan's predecessor state Former Yan, before both were destroyed by Former Qin—Former Yan's falling in 370 and Dai falling in 376—and the last prince of Dai, Tuoba Shiyiqian, had successively married two Former Yan princesses as his wives, in 344 and 362.\nAfter Former Qin suffered a major defeat against Jin forces at the Battle of Fei River in 383 in a failed bid to unite China, it began to disintegrate, and, among others, Later Yan, with Murong Chui, the uncle of Former Yan's last emperor Murong Wei, as emperor (Emperor Wucheng), took over Former Yan's old territory and people; and Northern Wei, with Tuoba Shiyiqian's grandson Tuoba Gui as prince, took over Dai's former territory and people.\nAfter the establishment of Later Yan and Northern Wei, the lord/vassal relationship resumed between Later Yan and Northern Wei.\nEarly in his reign, Tuoba Gui had often met opposition from powerful individuals within his own state, and had to rely on Later Yan's aid to quell the rebellions. For example, in 386, when Tuoba Gui faced a rebellion led by the Dugu chief Liu Xian () and Tuoba Shiyiqian's youngest son Tuoba Quduo (), he turned to Later Yan for help, and Later Yan forces, commanded by Murong Chui's son Murong Lin the Prince of Zhao, helped Tuoba Gui to put down the rebellion. A 387 joint operation between Northern Wei and Later Yan finally crushed Liu Xian's power.\nHowever, Tuoba Gui was having designs against Later Yan and, when he sent his cousin Tuoba Yi () the Duke of Jiuyuan to offer tributes to Murong Chui for him in 388, he asked Tuoba Yi to carefully examine the situation at the Later Yan court to observe any weaknesses.\nMurong Chui, displeased that Tuoba Gui did not personally come to pay tribute, interrogated Tuoba Yi, but allowed him to depart. Tuoba Yi reported to Tuoba Gui that, in his opinion, Murong Chui was old, his crown prince Murong Bao was weak, and that Murong Chui's brother Murong De the Prince of Fanyang was overly ambitious, which should cause internal problems for Later Yan upon Murong Chui's death. He opined that while Tuoba Gui should not attack Later Yan at that time, once Murong Chui died, there would be opportunity to do so. Despite his planning, however, he continued joint operations with Later Yan, and in 390 and 391, he and Murong Lin defeated the Helan (), Hetulin (), and Hexi () tribes together.\nHowever, later in 391, an incident would occur that would cause the states to break relations.  Tuoba Gui sent his brother Tuoba Gu () to offer tributes to Murong Chui. Murong Chui's sons and brothers had Tuoba Gu detained and ordered Tuoba Gui to offer good horses in exchange for Tuoba Gu's freedom. Tuoba Gui refused and further broke relations with Later Yan, entering into an alliance with Later Yan's rival for legitimate succession to Former Yan, Western Yan's emperor Murong Yong.\nTuoba Gu, meanwhile, was kept under detention by Later Yan, albeit treated as an honored guest otherwise. In 394, when Murong Chui led a campaign against Western Yan that eventually led to Western Yan's destruction, Tuoba Gui sent a relief force, commanded by his cousin Tuoba Qian () the Duke of Chenliu and the general Yu Yue (), but was unable to save Western Yan.\nLater Yan campaign prior to the Battle of Canhe Slope\nBy 395, Tuoba Gui was not only no longer submissive to Later Yan, but was openly pillaging other tribal vassals of Later Yan.\nMurong Chui, despite contrary counsel from his advisor Gao Hu (), decided to launch a punitive campaign against Northern Wei, putting Murong Bao in command of 80,000 soldiers, assisted by his other sons Murong Lin and Murong Nong the Prince of Liaoxi, to attack Northern Wei, and putting 18,000 other soldiers under the command of his brother Murong De and nephew Murong Shao () the Prince of Chenliu as a secondary army.\nTuoba Gui's advisor Zhang Gun () suggested to Tuoba Gui that he intentionally display weakness to draw Later Yan forces in. Tuoba Gui agreed, and he sent his troops and livestock far to the west away from his capital Shengle (盛樂, in modern Hohhot, Inner Mongolia), crossing the Yellow River into the Ordos Desert.\nMeanwhile, Later Yan forces advanced to Wuyuan (五原, in modern Baotou, Inner Mongolia), receiving the surrender of some 30,000 households who were Northern Wei vassals. Later Yan forces then built Fort Hei (), north of Wuyuan, and began to build boats to cross the Yellow River.\nTuoba Gui, at the same time, also sent his official Xu Qian () to Later Qin to seek aid. The Later Qin emperor Yao Xing launched a relief force commanded by the general Yang Fosong (). (Yang, however, did not arrive in time for further battles.)\nThe armies stalemated across the Yellow River, but Tuoba Gui managed to cut off communications between Later Yan forces and the Later Yan capital Zhongshan (中山, in modern Baoding, Hebei) by lying in wait for Later Yan messengers and capturing them. He then had the captured Later Yan messengers publicly announce that Murong Chui was dead, causing apprehension in Murong Bao's own army as to whether this was true.\nThe sorcerer Jin An (), serving Murong Bao, claimed to foresee disaster and suggested an immediate retreat. Murong Bao refused. Meanwhile, Murong Lin's subordinate Muyu Song (), believing that Murong Chui had died, plotted a coup to have Murong Lin made emperor. Muyu's plot was discovered, and he was put to death, but this brought suspicions between Murong Bao and Murong Lin. As the armies stalemated into winter, Murong Bao decided to withdraw, and he burned the boats that he had built and began the withdrawal on November 23, 395.[http://www.sinica.edu.tw/ftms-bin/kiwi1/luso.sh?lstype=2&dyna=%AAF%AE%CA&king=%A7%B5%AAZ%AB%D2&reign=%A4%D3%A4%B8&yy=20&ycanzi=&mm=10&dd=&dcanzi=%A8%AF%A5%BC 兩千年中西曆轉換] At that time, there were blocks of ice on the Yellow River, but it was not fully frozen, and therefore Murong Bao did not believe that Northern Wei forces could cross easily.\nHowever, on December 1,[http://www.sinica.edu.tw/ftms-bin/kiwi1/luso.sh?lstype=2&dyna=%AAF%AE%CA&king=%A7%B5%AAZ%AB%D2&reign=%A4%D3%A4%B8&yy=20&ycanzi=&mm=11&dd=&dcanzi=%A4v%A5f 兩千年中西曆轉換] there was a sudden storm, and the lower temperature caused the Yellow River to freeze. Tuoba Gui took 20,000 cavalry soldiers and gave chase.\nBattle\nWhen Later Yan forces reached Canhe Slope (in modern Liangcheng), the army became enveloped in darkness, probably due to the storm. The Buddhist monk Zhitanmeng () warned Murong Bao that Northern Wei forces must be approaching, but Murong Bao, believing that he was pulling away from Northern Wei forces, gave no heed. Only also at the urging of Murong De did Murong Bao send Murong Lin, with 30,000 soldiers, to branch out and serve as rear guard. Murong Lin, however, did not believe Zhitanmeng, and therefore had his soldiers hunt without paying heed to Northern Wei advances.\nTuoba Gui arrived west of Canhe Slope at dusk on December 7,[http://www.sinica.edu.tw/ftms-bin/kiwi1/luso.sh?lstype=2&dyna=%AAF%AE%CA&king=%A7%B5%AAZ%AB%D2&reign=%A4%D3%A4%B8&yy=20&ycanzi=&mm=11&dd=&dcanzi=%A4A%A8%BB 兩千年中西曆轉換] with Later Yan forces east of Canhe Slope and not realizing Northern Wei forces had arrived. Tuoba Gui kept his army in full silence and, in the night, set up positions on the hills around the Later Yan encampment. On December 8, at sunrise, Northern Wei forces launched their attack, surprising Later Yan forces.\nIn a panic, Later Yan soldiers died by the thousands by trampling each other or drowning by jumping into a nearby river. Their flight was also cut off by Tuoba Gui's cousin Tuoba Zun () the Duke of Lüeyang. 40,000 to 50,000 Later Yan soldiers, in a panic, surrendered. Only several thousand escaped, including Murong Bao and other key generals with him. Murong Shao was killed in the battle, and among Later Yan nobles who were captured were Murong Chui's son Murong Wonu (), the Prince of Luyang, and nephew Murong Daocheng (), the Prince of Guilin.\nTuoba Gui kept a number of talented Chinese officials of Later Yan whom he captured such as Jia Run (), Jia Run's cousin Jia Yi (), and Chao Chong () -- on his staff. He was initially intending to release the Later Yan captives to gain a good reputation among the Later Yan people. His general and brother-in-law Kepin Jian (), however, suggested that releasing the Later Yan soldiers would merely allow Later Yan to relaunch their attack later. Therefore, the captives were all buried, presumably while still alive.\nAftermath\nAt the urging of Murong Bao and Murong De, both of whom believed that Northern Wei would pose a future threat, Murong Chui personally commanded another campaign against Northern Wei in 396. He scored major victories against Northern Wei, killing Tuoba Qian.\nHowever, when his army arrived at Canhe Slope, he offered sacrifices to the deceased soldiers—and his own soldiers, many of whom had relatives who died, cried bitterly. He became ashamed and fell seriously ill. He thus returned to Zhongshan, and died soon thereafter. Murong Bao succeeded him (as Emperor Huimin).\nTuoba Gui almost immediately launched a major attack, and in 397, Murong Bao was forced to abandon Zhongshan and retreat back to the old Former Yan capital Longcheng (龍城, a.k.a. Liaodong, in modern Chaoyang, Liaoning), and he would be killed in an internal revolt in 398. Northern Wei took over most of Later Yan's territory, save for a small northern area still controlled by Later Yan and a small southern strip, where Murong De declared himself emperor and established Southern Yan.\nNotes and references"
    }
  ]
}