{
  "content": [
    {
      "type": "text",
      "text": "# Battle for Cebu City\n\n*\n|combatant2  =\n*\n|commander1  = Robert L. Eichelberger}} Ferdinand E. Zuellig James M. Cushing   Basilio J. Valdes\n|commander2  = Takeo Manjome   Rijome Kawahara\n|strength1   =14,900 U.S. troops8,500 Cebuano guerrillas\n|strength2   =14,500 &ndash; 15,000 Japanese troops\n|casualties1 =American troops410 killed 1,700 wounded 8,000 sick\n|casualties2 =Japanese troops9,000 Killed  Est. 2,000 committed suicide  Est. 2,000 captured\n|notes       =\n|campaignbox =\n}}\nThe Battle for Cebu City (Filipino: Labanan sa Lungsod ng Cebu; Cebuano: Gubat sa Dakbayan sa Sugbo; Japanese: セブシティーのための戦い) was a major engagement of World War II that occurred between March 26 and April 8, 1945, during the second Philippines Campaign. The battle resulted in an Allied victory over the occupying Japanese Army and the liberation of Cebu City.\nPrelude\nAfter launching their campaign to recapture the Philippines at Leyte in October 1944, the Allies followed up that victory by dispatching troops to Luzon in January 1945. A month later, General Douglas MacArthur, overall commander of Allied forces in the Pacific, began planning to take the rest of the Philippines. General Robert L. Eichelberger's Eighth Army was then tasked with conducting a series of amphibious landings in the southern Philippines on islands between Mindanao and Luzon, including Cebu. Prior to the war, Cebu had been the Philippines second-most important industrial center, and it offered the Allies a harbor for future operations.\nThe island was garrisoned by a force of between 14,500 and 15,000 Japanese troops. These were situated mainly in Cebu City and on the central east coast. Drawn from the 35th Army, the majority of these troops were support troops who had been supporting the evacuation of Luzon, and who were formed into combat units. The main Japanese combat units were the 102nd Infantry Division, which consisted of the 78th Infantry Brigade headquarters and the 173d Independent Infantry Battalion, and 1st Division, consisting of the 1st, 49th and 57th Infantry Regiments, which were down to battalion strength due to earlier fighting on Luzon. There were also several naval garrison units on the island, including the 33rd Special Base Force and the 36th Guard Unit.\nBattle\nFollowing a preliminary bombardment, the battle began on March 26, 1945, when the Allies launched Operation Victor II. Staging out of Leyte, where they had conducted rehearsal landings two days earlier, a large flotilla of cruisers and destroyers from the Seventh Fleet Task Force 74 escorted the Cebu Attack Group to the island. Under the leadership of Major General William H. Arnold, the forces assigned to the operation consisted of the Americal Division's 132nd and 182nd Infantry Regiments, totaling about 5,000 men, were landed on Cebu island at Talisay Beach,  southwest of Cebu City. The 182nd came ashore southwest of the city, while the 132nd landed at a wide gravel beach to the northeast opposite a palm grove. Meeting no Japanese opposition, the U.S. forces nevertheless suffered heavily from mines and booby traps as they crossed the beach. It was the first time in the Philippines campaign that U.S. troops had encountered such weapons.\nAs further waves landed, engineers and infantry began clearing lanes through the mine fields. The Americal Division slowly forced its way off the beach and moved inland against only small pockets of Japanese resistance that were carrying out delaying actions. The main body stopped for the night about  from Cebu City. Patrols were sent out and the following day, the Americal Division continued its advance towards Cebu City, tasked with securing the harbor and nearby airfield, Lahug Airfield, positioned  northeast of the city. On March 28, more significant fighting broke out as the Americans captured the airfield, as well as Mactan Island in Cebu Harbor. Although the city had been officially liberated, Japanese forces remained in many parts, including the port area, and occupied several strongly defended positions in the hills to the city's north, where they came under the command of Major-General Takeo Manjome, who had previously commanded the 78th Infantry Brigade. At this time, Japanese resistance grew more determined and heavy fighting followed.\nAround 8,500 local Cebuano guerrilla and irregular forces, commanded by Lieutenant Colonel James M. Cushing took part . Units fought on the outskirts of Cebu, capturing Pari-an on March 29 and liberating T. Padilla on April 7. As Allied morale heightened and Japanese forces withdrew to the ports, the U.S. naval commander, Ferdinand Ernest Zuellig, directed naval bombardments on the ports, prompting the Japanese to withdraw to Fort San Pedro. Many did not make it and were trapped within Piers One and Two.\nAlthough the final operations around the ports were successful and forced many Japanese to surrender, the Japanese headquarters unit in charge of the area made a final stand near the border of Mandaue City. Led by Major Rijome Kawahara, after further fighting these forces were defeated, and after that the Allies gained control of the remaining areas of the city as Kawahara's remaining troops withdrew. Kawahara was killed while trying to cross the makeshift bridge towards Mandaue City. Reportedly, he was killed by a sniper after being incapacitated by mortar and tank fire. Kawahara was posthumously promoted to the rank of colonel.  After the war, his body was returned to Japan where it was buried in Sapporo, the city of his birth.\nAftermath\nDuring the final stages of the battle, the mountainous parts of Cebu were also bombed and cleared. A series of battles were subsequently fought during this time, the most famous of which is the Battle of Gochan Hill, fought over three days from March 29. Battling against a heavily entrenched force, the fighting proved costly for the 182d Infantry Regiment, with one company losing over 50 men killed when the Japanese blew up an ammunition dump, before the U.S. forces finally took the hill, having destroyed at least 85 pillboxes.\nSupported by naval gunfire, the Americal Division attempted to break through the Japanese line through a frontal assault, but their attempts resulted in slow progress, so plans were made to outflank them. In early April two battalions from the Americal Division's third regiment, the 164th, were dispatched to Cebu as reinforcements. These were moved in great secrecy around the Japanese lines and on 13 April, the Americans put in a two-pronged divisional level attack, which although initially checked, eventually forced the Japanese commander, Manjome, to withdraw further north into the mountains. Meanwhile, on April 20 the 164th Infantry's third battalion landed on the island of Bohol, and in concert with Filipino troops and guerillas began clearance operations, before being moved to Negros on April 20; they were subsequently joined by the regiment's other two battalions on 25 April.\nOn Cebu, after a brief pause, the Allied forces began to follow up the retreating Japanese on April 20. Filipino troops and Cebuano guerillas continued harassment operations. The Americal Division ceased operations on June 20, when they withdrew to Cebu City to begin preparations for future operations. Meanwhile, the guerillas continued to keep pressure on the remaining Japanese. The entire Cebu campaign ended on July 2, after Camp 8 had fallen. The Americans subsequently developed a large logistics base on the island, Base 'S', which was intended to be used by three infantry divisions as a staging base for the proposed invasion of Japan.\nAround 5,550 Japanese were killed during the fighting, while the Americal Division lost 410 men killed and 1,700 wounded; a further 8,000 U.S. troops became sick during the battle. The Filipino forces under the Philippine Commonwealth Army and Philippine Constabulary lost about 3,600 killed and 6,200 wounded. About 8,500 Japanese were able to escape into Cebu's north, where they remained until the war ended in August.\nControversy\nA number of controversies surround this battle. The most famous is why General Sosaku Suzuki, commander of the IJA 35th Army which was responsible for the forces on Cebu, was not in command of the Japanese troops in the city and where he was during the height of the battle. One theory that has developed is that during the liberation of the city on March 27, Suzuki had already fled to the hills and mountains of Cebu City, hoping to make a last stand against the invading joint US and Philippine forces, resulting in the Battle of Gochan Hill. His orders for the defense of the city are believed to have been formulated earlier and the plan was made was given to Kawahara who, at that time, was the highest-ranking Japanese officer in the city, was entrusted with defending the city to the last man standing. As the mountainous parts of Cebu were being cleared by Allied forces, so too were the city outposts and barangays. When Suzuki transferred to the IJA garrison in the Cadulawan-Tubod area around Minglanilla, after fleeing from the destroyed mountain camps, on April 8, 1945, he received a message that Kawahara had been killed while defending the city, and that the whole city, its ports and the nearby barangays had been captured by the Allies.\nOn April 14, 1945, the Allies began an assault on the Japanese bases in the Cadulawan-Tubod area, as well the elimination of the defenses set up by the IJA in Pungtod, Calajo-an, and the Port of Tulay-Tungkop in what later became known as the \"Battle of Minglanilla\" and the \"Defense of Calajo-an\". Spearheaded by US troops from 'G' Company, 182nd Infantry Regiment and some local soldiers from the Cebuano guerrillas and irregular forces, the battle lasted for two days, clearing the IJA from Minglanilla.\nBy the time the battle was at its height on April 10, Suzuki fled south in an effort to avoid capture and rejoin the main part of his command on Mindanao, in the southern Philippines. On April 19, while sailing in a convoy of small ships, Suzuki was killed when the ship he was in was attacked by U.S. aircraft between Sumilon Island Sound and Santander Bay.\nSee also\n* Military History of the Philippines during World War II\n* Battle of Visayas\nReferences\n;Citations\n;Bibliography\n*\n*\n*, see chapter entitled \"World powers at play in the western Pacific : the coastal fortifications of Southern Cebu, Philippines.\"\n*\n*\n*\n*\n*\n*\nExternal links\n* [http://www.pacificwrecks.com/provinces/philippines_cebu.html Pacific Wrecks' website]\n* [http://abbot.us/DD629/docs/CebuMorningTimes19450505.pdf Morning Times for Cebu City on 5 May 1945]\n* [http://www.eugeneleeslover.com/The_Pacific.html GENE SLOVERS US NAVY PAGES]\n* [https://web.archive.org/web/20130308050257/http://cebueskrima.s5.com/worldwar2.html Excerpts of Tabunan:  The Untold Exploits of the Famed Cebu Guerillas of World War II by Col. Manuel F. Segura]"
    }
  ]
}