{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Woerden\n\n| result            = French victory\n| combatant1        =\n| combatant2        =\n| commander1        =  Luxembourg   Feuquières\n| commander2        =  William of Orange   Zuylestein   Willem Adriaan II van Horne   Waldeck\n| strength1         = 8,000\n| strength2         = 6,500–7,000\n| casualties1       = 2,500 killed or wounded\n| casualties2       = 700–800 killed or wounded\n| map_type          = Netherlands\n| map_relief        = 1\n| map_size          = 300\n}}\nThe Battle of Woerden, also known as the Battle of Kruipin, took place on the night of 11 October to 12 October 1672 during the Franco-Dutch War. The battle was fought a few hundred metres north of Woerden at Fort Kruipin between the Dutch Republic and France. The battle was fought for the possession of the town of Woerden.\nBackground\nWhen the French invaded the Netherlands in June 1672, many Dutch towns and fortresses fell swiftly to the large French army. The Dutch land forces had not directly confronted their opponent in the first months of the war, except during the small encounter at Tolhuis. However, when the French marched on Holland, the richest province in the Republic, they encountered the Dutch Waterline. This line of defense would prove insurmountable and a stalemate ensued.\nAt sea the all hopes of an Anglo-French naval invasion were dashed by the Dutch victory at the Battle of Solebay, and on 25 July, the Holy Roman Emperor entered into an alliance with the Dutch Republic. He pledged the Republic to send 36,000 troops to attack the lands of the German Bishops. This prompted Turenne to dispatch himself with a part of the French army in order to guard against an Imperial attack. Because Condé was not yet allowed to lead the army again after falling out with Louis after the Battle of Tolhuis, the Duke of Luxembourg took command of the French occupying army in the Dutch Republic.\nIn mid-September, the Dutch supreme command wanted to take action against the foreign occupiers. The only way to possibly recapture Woerden from the French was to attack when they least expected it, Johan Maurits headed from Muiden to make it look like he was going to recapture Naarden, because it was undermanned after the French troop reduction. And because Luxembourg feared an attack on Naarden, he let himself be lured away, which allowed the Dutch States Army to attack Woerden.\nBattle\nOn the night of 11 October, the Dutch army headed to Woerden to initiate their attack. Willem Adriaan approached the city from Goejanverwelleshuis. And from the east of Woerden, Zuylestein advanced, while William III launched the attack on Woerden.\nWhile that happened Luxembourg advanced from Naarden towards Woerden, but his advance was halted by Zuylestein's position, so he quickly ordered an attack, but was repulsed while doing so. However, Luxembourg was able to find a gap in the Dutch defences after investigating whether it was possible to do so, and was able to break through it, Luxembourg attacked Zuylestein's army in the rear in which heavy fighting occurred. And after the Dutch army lost ground, the conflict ended in French success with more than 2.600 losses from both sides.\nAftermath\nDuring the battle, Zuylestein was killed in action, along with another six hundred soldiers, while the French lost more than 2.000. The death of Zuylestein meant that his position as supreme commander was vacant, William III would later give this position to his cousin Waldeck. Afterwards, William III would move his army towards Maastricht and would besiege Chareloi after. And when the winter came, Luxembourg would then slaughter the towns of Zwammerdam and Bodegraven.\nAlthough the battle was a French victory, William III was satisfied with the outcome as it shattered the myth of the invincibility of the French army, or at least fractured it. As it showed that the French were also 'mere mortals'. And according to Olaf van Nimwegen, the battle had an 'important parallel' to the infamous Battle of Thermopylae, and the way the troops under Hornes attacked the advancing French did not only come as a surprise to Luxembourg, but to everyone in the Dutch Republic.\nReferences\nSources\n*\n* |website=Het verhaal van Woerden|title=Rampjaar en de Slag om Woerden|url=https://www.verhaalvanwoerden.nl/verhaal/rampjaar-en-de-slag-om-woerden/}}\n*\n* |website=Maand van de Geschiedenis|title=De slag om Woerden 1672|url=https://www.maandvandegeschiedenis.nl/page/25331/de-slag-om-woerden-1672}}\nFurther reading\n*\n*"
    }
  ]
}