{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Kehl (1796)\n\n|combatant2      =  Austria   Swabia\n|commander1      =  Jean Moreau   Jean Abbatucci\n|commander2      =  Archduke Charles   Maximilian Karl\n|strength1       = 10,065\n|strength2       = 7,000\n|casualties1     = 150 killed, wounded and missing\n|casualties2     = 700 killed, wounded and missing\n|map_type=Europe\n|map_relief=1\n|map_size=300\n}}\nDuring the Battle of Kehl (23–24 June 1796), a Republican French force under the direction of Jean Charles Abbatucci mounted an amphibious crossing of the Rhine River against a defending force of soldiers from the Swabian Circle. In this action of the War of the First Coalition, the French drove the Swabians from their positions in Kehl and subsequently controlled the bridgehead on both sides of the Rhine.\nAlthough separated politically and geographically, the fates of Kehl, a village on the eastern shore of the Rhine in Baden-Durlach, and those of the Alsatian city of Strasbourg, on the western shore, were united by the presence of bridges and a series of gates, fortifications and barrage dams that allowed passage across the river. In the 1790s, the Rhine was wild, unpredictable, and difficult to cross, in some places more than four or more times wider than it is in the twenty-first century, even under non-flood conditions. Its channels and tributaries wound through marsh and meadow and created islands of trees and vegetation that were alternately submerged by floods or exposed during the dry seasons.\nThe fortifications at Kehl and Strasbourg had been constructed by the fortress architect Sébastien le Préstre de Vauban in the seventeenth century. The crossings had been contested before: in 1678 during the French-Dutch war, in 1703 during the War of the Spanish Succession and in 1733 during the War of the Polish Succession. Critical to success of the French plan would be the army's ability  to cross the Rhine at will. Consequently, control of the crossings at Hüningen, near the Swiss city of Basel, and at Kehl, would give them ready access to most of southwestern Germany; from there, French armies could sweep north, south, or east, depending on their military goal.\nBackground\nThe  Rhine Campaign of 1795  (April 1795 to January 1796) opened when two Habsburg Austrian armies under the overall command of François Sébastien Charles Joseph de Croix, Count of Clerfayt defeated an attempt by two Republican French armies to cross the Rhine River and capture the Fortress of Mainz. At the start of the campaign the French Army of the Sambre and Meuse led by Jean-Baptiste Jourdan confronted Clerfayt's Army of the Lower Rhine in the north, while the French  Army of Rhine and Moselle under Pichegru lay opposite Dagobert Sigmund von Wurmser's army in the south. In August, Jourdan crossed and quickly seized Düsseldorf. The Army of the Sambre and Meuse advanced south to the Main River, completely isolating Mainz. Pichegru's army made a surprise capture of Mannheim so that both French armies held significant footholds on the east bank of the Rhine. The French fumbled away the promising start to their offensive. Pichegru bungled at least one opportunity to seize Clerfayt's supply base in the Battle of Handschuhsheim. With Pichegru unexpectedly inactive, Clerfayt massed against Jourdan, beat him at Höchst in October and forced most of the Army of the Sambre and Meuse to retreat to the west bank of the Rhine. About the same time, Wurmser sealed off the French bridgehead at Mannheim. With Jourdan temporarily out of the picture, the Austrians defeated the left wing of the Army of Rhine and Moselle at the Battle of Mainz and moved down the west bank. In November, Clerfayt gave Pichegru a drubbing at Pfeddersheim and successfully wrapped up the siege of Mannheim. In January 1796, Clerfayt concluded an armistice with the French, allowing the Austrians to retain large portions of the west bank. During the campaign Pichegru had entered into negotiations with French Royalists. It is debatable whether Pichegru's treason or bad generalship was the actual cause of the French failure. which lasted until 20 May 1796, when the Austrians announced that it would end on 31 May. This set the stage for continued action during the campaign months of May through October 1796.\nTerrain\nThe Rhine River flows west along the border between the German states and the Swiss Cantons. The  stretch between Rheinfall, by Schaffhausen and Basel, the High Rhine cuts through steep hillsides over a gravel bed; in such places as the former rapids at Laufenburg, it moved in torrents. A few miles north and east of Basel, the terrain flattens. The Rhine makes a wide, northerly turn, in what is called the Rhine knee, and enters the so-called Rhine ditch (Rheingraben), part of a rift valley bordered by the Black Forest on the east and Vosges Mountains on the west. In 1796, the plain on both sides of the river, some  wide, was dotted with villages and farms. At both far edges of the flood plain, especially on the eastern side, the old mountains created dark shadows on the horizon. Tributaries cut through the hilly terrain of the Black Forest, creating deep defiles in the mountains. The tributaries then wind in rivulets through the flood plain to the river.\nThe Rhine River itself looked different in the 1790s than it does in the twenty-first century; the passage from Basel to Iffezheim was \"corrected\" (straightened) between 1817 and 1875. Between 1927 and 1975, a canal was constructed to control the water level. In the 1790s, the river was wild and unpredictable, in some places four or more times wider than the twenty-first century incarnation of the river, even under regular conditions. Its channels wound through marsh and meadow, and created islands of trees and vegetation that were periodically submerged by floods. It was crossable at Kehl, by Strasbourg, and Hüningen, by Basel, where systems of viaducts and causeways made access reliable.\nPolitical complications\nThe German-speaking states on the east bank of the Rhine were part of the vast complex of territories in central Europe called the Holy Roman Empire. The considerable number of territories in the Empire included more than 1,000 entities.  Their size and influence varied, from the Kleinstaaterei'',  the little states that covered no more than a few square miles, or included several non-contiguous pieces, to the small and complex territories of the princely Hohenlohe family branches, to such sizable, well-defined territories as the Kingdoms of Bavaria and Prussia.  The governance of these many states varied: they included the autonomous free imperial cities, also of different sizes and influence, from the powerful Augsburg to the minuscule Weil der Stadt; ecclesiastical territories, also of varying sizes and influence, such as the wealthy Abbey of Reichenau and the powerful Archbishopric of Cologne; and dynastic states such as Württemberg. When viewed on a map, the Empire resembled a \"patchwork carpet\". Both the Habsburg domains and Hohenzollern Prussia also included territories outside the Empire. There were also territories completely surrounded by France that belonged to Württemberg, the Archbishopric of Trier, and Hesse-Darmstadt. Among the German-speaking states, the Holy Roman Empire's administrative and legal mechanisms provided a venue to resolve disputes between peasants and landlords, between jurisdictions, and within jurisdictions. Through the organization of imperial circles, also called Reichskreise, groups of states consolidated resources and promoted regional and organizational interests, including economic cooperation and military protection.\n(Habsburg), Offenburg and Rottweil (free cities), the territories belonging to the princely families of Fürstenberg  and Hohenzollern, the Duchy of Baden, the Duchy of Württemberg, and several dozen ecclesiastic polities.  Many of these territories were not contiguous: a village could belong predominantly to one polity, but have a farmstead, a house, or even one or two strips of land that belonged to another polity. The light cream-colored territories are so subdivided they cannot be named. ]]\nDisposition\nThe armies of the First Coalition included the contingents and the infantry and cavalry of the various states, amounted to about 125,000 troops (including the three autonomous corps), a sizable force by eighteenth century standards but a moderate force by the standards of the Revolutionary wars. Archduke Charles, Duke of Teschen and brother of the Holy Roman Emperor, served as commander-in-chief. In total, Charles’ troops stretched in a line from Switzerland to the North Sea. Habsburg troops comprised the bulk of the army but the thin white line of Habsburg infantry could not cover the territory from Basel to Frankfurt with sufficient depth to resist the pressure of the opposition.  Compared to French coverage, Charles had half the number of troops covering a 211-mile front, stretching from Renchen, near Basel to Bingen. Furthermore, he had concentrated the bulk of his force, commanded by Count Baillet Latour, between Karlsruhe and Darmstadt, where the confluence of the Rhine and the Main made an attack most likely, as it offered a gateway into eastern German states and ultimately to Vienna, with good bridges crossing a relatively well-defined river bank. To the north, Wilhelm von Wartensleben’s autonomous corps stretched in a thin line between Mainz and Giessen.\nIn spring 1796, drafts from the free imperial cities, and other imperial estates in the Swabian and Franconian Circles augmented the Habsburg force with perhaps 20,000 men at the most.  The militias, most of which were Swabian field hands and day laborers drafted for service in the spring of that year, were untrained and unseasoned. As he gathered his army in March and April, it was largely guess work where they should be placed.  In particular, Charles did not like to use the militias in any vital location.  Consequently, in May and early June, when the French started to mass troops by Mainz and it looked as if the bulk of the French army would cross there—they even engaged the imperial force at Altenkirchen (4 June) and Wetzler and Uckerath (15 June)—Charles felt few qualms placing the 7000-man Swabian militia at the crossing by Kehl.\nFrench plans\nAn assault into the German states was essential, as far as French commanders understood, not only in terms of war aims, but also in practical terms:  the French Directory believed that war should pay for itself, and did not budget for the feeding of its troops. The French citizen’s army, created by mass conscription of young men and systematically divested of old men who might have tempered the rash impulses of teenagers and young adults, had already made itself unwelcome throughout France. It was an army entirely dependent for support upon the countryside it occupied for provisions and wages. Until 1796, wages were paid in the worthless assignat (France's paper currency); after April 1796, although pay was made in metallic value, wages were still in arrears. Throughout that spring and early summer, the French army was in almost constant mutiny: in May 1796, in the border town of Zweibrücken, the 74th Demi-brigade revolted. In June, the 17th Demi-brigade was insubordinate (frequently) and in the 84th Demi-brigade, two companies rebelled.\nThe French faced a formidable obstacle in addition to the Rhine. The  Coalition's Army of the Lower Rhine counted 90,000 troops. The 20,000-man right wing under Duke Ferdinand Frederick Augustus of Württemberg stood on the east bank of the Rhine behind the Sieg River, observing the French bridgehead at Düsseldorf. The garrisons of Mainz Fortress and Ehrenbreitstein Fortress included 10,000 more. The remainder held the west bank behind the Nahe River. Dagobert Sigmund von Wurmser, who initially commanded the whole operation, led the 80,000-strong Army of the Upper Rhine. Its right wing occupied Kaiserslautern on the west bank while the left wing under Anton Sztáray, Michael von Fröhlich and Louis Joseph, Prince of Condé guarded the Rhine from Mannheim to Switzerland. The original Austrian strategy was to capture Trier and to use their position on the Rhine's west bank to strike at each of the French armies in turn. However, after news arrived in Vienna of Napoleon Bonaparte's successes in northern Italy, Wurmser was sent to Italy with 25,000 reinforcements; the Aulic Council gave Archduke Charles command over both Austrian armies and ordered him to hold his ground.\nOn the French side, the 80,000-man Army of Sambre-et-Meuse held the west bank of the Rhine down to the Nahe and then southwest to Sankt Wendel. On this army's left flank, Jean Baptiste Kléber had 22,000 troops entrenched at Düsseldorf.  The right wing of the Army of the Rhine and Moselle, under Jean Victor Moreau's command, was positioned east of the Rhine from Hüningen (on the border with the French provinces, Switzerland, and the German states) northward, with its center along the Queich River near Landau and its left wing extended west toward Saarbrücken. Pierre Marie Barthélemy Ferino commanded Moreau's right wing at Hüningen, Louis Desaix commanded the center and Laurent Gouvion Saint-Cyr directed the left wing and included two divisions commanded by Guillaume Philibert Duhesme, and Alexandre Camille Taponier. Ferino's wing included three infantry and cavalry divisions under François Antoine Louis Bourcier, and general of division Augustin Tuncq, and Henri François Delaborde. Desaix's command included three divisions led by Michel de Beaupuy, Antoine Guillaume Delmas and Charles Antoine Xaintrailles.\nThe French plan called for its two armies to press against the flanks of the Coalition's northern armies in the German states while simultaneously a third army approached Vienna through Italy. Specifically, Jean-Baptiste Jourdan's army would push south from Düsseldorf, hopefully drawing troops and attention toward themselves, which would allow Moreau’s army an easier crossing of the Rhine and Huningen and Kehl. If all went according to plan, Jourdan’s army could feint toward Mannheim, which would force Charles to reapportion his troops. Once Charles moved the mass of his army to the north, Moreau’s army, which early in the year had been stationed by Speyer, would move swiftly south to Strasbourg. From there, they could cross the river at Kehl, which was guarded by 7,000-man inexperienced and lightly trained militia—troops recruited that spring from the Swabian circle polities. In the south, by Basel, Ferino’s column was to move speedily across the river and advanced up the Rhine along the Swiss and German shoreline, toward Lake Constance and spread into the southern end of the Black Forest. Ideally, this would encircle and trap Charles and his army as the left wing of Moreau's army swung behind him, and as Jourdan's force cut off his flank with Wartensleben's autonomous corps.\nFeint and a dual-pronged attack\nEverything went according to the French plan, at least for the first six weeks. On 4 June 1796, 11,000 soldiers of the Army of the Sambre-et-Meuse, commanded by François Lefebvre, pushed back a 6,500-man Austrian force at Altenkirchen.  On 6 June, the French placed Ehrenbreitstein fortress under siege. At Wetzlar on the Lahn, Lefebvre ran into Charles' concentration of 36,000 Austrians on 15 June. Casualties were light on both sides, but Jourdan pulled back to Niewied while Kléber retreated toward Düsseldorf. Pál Kray, commanding 30,000 Austrian troops, rushed into battle with Kléber's 24,000 at Uckerath, east of Bonn on 19 June, prompting the French to continue withdrawal to the north, enticing Kray to follow him. The actions confirmed to Charles that Jourdan intended to cross at the mid-Rhine, and he quickly moved sufficient of his force into place to address this threat.\nResponding to the French feint, Charles committed most of his forces on the middle and northern Rhine, leaving only the Swabian militia  at the Kehl-Strasbourg crossing, and a minor force commanded by Karl Aloys zu Fürstenberg at Rastatt.  In addition, a small force of about 5,000 French royalists under the command of the Louis Joseph, Prince of Condé, supposedly covering the Rhine from Switzerland to Freiburg im Breisgau.  Once Charles committed his main army to the mid and northern Rhine, however, Moreau executed an about face, and a forced march with most his army and arrived at Strasburg before Charles realized the French had even left Speyer. To accomplish this march rapidly, Moreau left his artillery behind; infantry and cavalry move more swiftly. On 20 June, his troops assaulted the forward posts between Strasbourg and the river, overwhelming the pickets there; the militia withdrew to Kehl, leaving behind their cannons, which solved part of Moreau's artillery problem.\nEarly in the morning on 24 June, Moreau and 3,000 men embarked in small boats and landed on the islands in the river between Strasbourg and the fortress at Kehl. They dislodged the imperial pickets there who, as one commentator observed \"had not the time or address to destroy the bridges which communicate with the right bank of the Rhine; and the progress of the French remaining unimpeded, they crossed the river and suddenly attacked the redoubts of Kehl.\"  Once the French had controlled the fortifications of Strasbourg and the river islands, Moreau’s advance guard, as many as 10,000 French skirmishers, some from the 3rd and 16th Demi-brigades commanded by the 24-year-old General Abbatucci, swarmed across the Kehl bridge and fell upon the several hundred Swabian pickets guarding the crossing. Once the skirmishers had done their jobs, Charles Mathieu Isidore Decaen's and Joseph de Montrichard's infantry of 27,000 infantry and 3,000 cavalry followed and secured the bridge.  The Swabians were hopelessly outnumbered and could not be reinforced. Most of Charles' Army of the Rhine was stationed further north, by Mannheim, where the river was easier to cross, but too far to support the smaller force at Kehl.  The only troops within relative easy distance were the Prince Condé’s émigré army at Freiburg and Karl Aloys zu Fürstenberg's force in Rastatt, neither of which could  reach Kehl in time.\nA second attack, simultaneous with the crossing at Kehl, occurred at Hüningen near Basel. After crossing unopposed, Ferino advanced in a dual-prong east along the German shore of the Rhine with the 16th and 50th demi-brigades, the 68th and 50th and 68th line infantry, and six squadrons of cavalry that included the 3rd and 7th Hussars and the 10th Dragoons.\nWithin a day, Moreau had four divisions across the river at Kehl and another three at Hüningen. Unceremoniously thrust out of Kehl, the Swabian contingent reformed at Renchen on the 28th, where Count Sztáray and Prince von Lotheringen managed to pull the shattered force together and unite the disorganized Swabians with their own 2,000 troops. On 5 July, the two armies met again at Rastatt.  There, under command of Fürstenberg, the Swabians managed to hold the city until the 19,000 French troops turned both flanks and Fürstenberg opted for a strategic withdrawal. Ferino hurried eastward along the shore of the Rhine, to approach Charles' force from the rear and cut him off from Bavaria; Bourcier's division swung to the north, along the east side of the mountains, hoping to separate the Condé’s émigrés from the main force.  Either division presented a danger of flanking the entire Coalition force, either Bourcier's on the west side of the Black Forest, or Ferino's on the east side. The Condé marched north and joined with Fürstenberg and the Swabians at Rastatt.\nAftermath\nThe immediate personnel losses seemed minor: at Kehl, the French lost about 150 killed, missing or wounded.  The Swabian militia lost 700, plus 14 guns and 22 ammunition wagons. Immediately, the French set about securing their defensive position by establishing a pontoon bridge between Kehl and Strasbourg, which allowed Moreau to send his cavalry and captured artillery across the river.\nStrategic losses seemed far greater. The French army's ability to cross the Rhine at will gave them an advantage. Charles could not move much of his army away from Mannheim or Karlsruhe, where the French had also formed across the river; loss of the crossings at Hüningen, near the Swiss city of Basel, and the crossing at Kehl, near the Alsatian city of Strasbourg, guaranteed the French ready-access to most of southwestern Germany. From there, Moreau's troops could fan out over the flood plain around Kehl to prevent any approach from Rastadt or Offenburg.\nTo avoid Ferino's flanking maneuver, Charles executed an orderly withdrawal in four columns through the Black Forest, across the Upper Danube valley, and toward Bavaria, trying to maintain consistent contact with all flanks as each column withdrew through the Black Forest and the Upper Danube. By mid-July, the column to which the Swabians were attached encamped near Stuttgart. The third column, which included the Condé’s Corps, retreated through Waldsee  to Stockach, and, eventually Ravensburg. The fourth Austrian column, the smallest (three battalions and four squadrons) commanded by Ludwig Wolff de la Marselle, retreated the length of the Bodensee’s northern shore, via Überlingen, Meersburg, Buchhorn, and the Austrian city of Bregenz.\nThe subsequent territorial losses were significant. Moreau's attack forced Charles to withdraw far enough into Bavaria to align his northern flank in a roughly perpendicular line (north to south) with Wartensleben's autonomous corps. This array protected the Danube valley and denied the French access to Vienna. His own front would prevent Moreau from flanking Wartensleben from the south; similarly, Wartensleben's flank would prevent Jourdan from encircling his own force from the north.  Together, he and Wartensleben could resist the French onslaught.  However, in the course of this withdrawal, he abandoned most of the Swabian Circle to the French occupation.  At the end of July, eight thousand of Charles' men under command of Fröhlich executed a dawn attack on the Swabian camp at Biberach, disarmed the remaining three thousand Swabian troops, and impounded their weapons. The Swabian Circle successfully negotiated with the French for neutrality; during negotiations, there was considerable discussion over how the Swabians would hand over their weapons to the French, but it was moot: the weapons had already been taken by Fröhlich. As Charles withdrew further east, the neutral zone expanded, eventually encompassing most of southern German states and the Ernestine duchies.\nThe situation reversed when Charles and Wartensleben's forces reunited to defeat Jourdan's army at the battles of Amberg, Würzburg and 2nd Altenkirchen. On 18 September, an Austrian division under Feldmarschall-Leutnant Petrasch stormed the Rhine bridgehead at Kehl, but a French counterattack drove them out. Even though the French still held the crossing between Kehl and Strasbourg, Petrasch's Austrians controlled the territory leading to the crossing.  After battles at Emmendingen (19 October) and Schliengen (24 October), Moreau withdrew his troops south to Hüningen.  Once safe on French soil, the French refused to part with Kehl or Hüningen, leading to over 100 days of siege at both locations.\nOrders of battle\nFrench\nAdjutant General Abbatucci commanding:\n:Generals of Brigade Decaen, Montrichard\n:*3rd Demi-brigade (light) (2nd battalion)\n:*11th Demi-brigade (light) (1st battalion)\n:*31st, 56th and 89th Demi-brigade (line) (three battalions each)\nHabsburg/Coalition\nThe Swabian Circle Contingent:\n:*Infantry Regiments: Württemberg, Baden-Durlach, Fugger, Wolfegg (two battalions each)\n:*Hohenzollern Royal and Imperial (KürK) Cavalry (four squadrons)\n:*Württemberg Dragoons (four squadrons)\n:*two field artillery battalions\nNotes and citations\nNotes\nCitations\nAlphabetical listing of sources cited\n* Bertaud, Jean Paul,  R.R. Palmer (trans). The Army of the French Revolution: From Citizen-Soldiers to Instrument of Power. Princeton University Press, 1988. .\n* Blanning, Timothy. The French Revolutionary Wars. New York, Oxford University Press, 1996.\n* Clarke, Hewson, The History of the War from the Commencement of the French Revolution, London, T. Kinnersley, 1816.\n*Dodge, Theodore Ayrault, Warfare in the Age of Napoleon: The Revolutionary Wars Against the First Coalition in Northern Europe and the Italian Campaign, 1789–1797, USA, Leonaur, 2011.\n* Gates, David, The Napoleonic Wars 1803&ndash;1815,  New York, Random House, 2011.\n* Graham, Thomas, Baron Lynedoch. [https://books.google.com/books?id=01U2AAAAMAAJ&q=Graham,+history+of+campaign The History of the Campaign of 1796 in Germany and Italy.] London, 1797. .\n* Hansard, Thomas C (ed.). Hansard's Parliamentary Debates, House of Commons, 1803, Official Report. Vol. 1. London: HMSO, 1803, pp.&nbsp;249–252\n* Haythornthwaite, Philip. Austrian Army of the Napoleonic Wars (1): Infantry. Oxford, Osprey Publishing, 2012.\n* Knepper, Thomas P. The Rhine. Handbook for Environmental Chemistry Series, Part L. New York:  Springer, 2006, .\n* Nafziger, George. [https://web.archive.org/web/20150923202252/http://www.cgsc.edu/CARL/nafziger/796FAE.pdf French Troops Destined to Cross the Rhine, 24 June 1796]. US Army Combined Arms Center. Accessed 2 October 2014.\n*Philippart, John, [https://books.google.com/books?id=jHjSAAAAMAAJ&pg=PA279 Memoires etc. of General Moreau], London, A.J. Valpy, 1814.\n* Phipps, Ramsay Weston The Armies of the First French Republic: Volume II The Armées du Moselle, du Rhin, de Sambre-et-Meuse, de Rhin-et-Moselle. USA, Pickle Partners Publishing, 2011 [1923&ndash;1933].\n* Rickard, J. [http://www.historyofwar.org/articles/combat_uckerath.html Combat of Uckerath, 19 June 1796], [http://www.historyofwar.org History of War], Feb 2009 version, accessed 1 March 2015.\n* Rothenberg, Gunther E. \"The Habsburg Army in the Napoleonic Wars (1792–1815).\" Military Affairs, 37:1 (Feb 1973), 1–5.\n* Smith, Digby. The Napoleonic Wars Data Book. London, Greenhill, 1998.\n* Vann, James Allen. The Swabian Kreis: Institutional Growth in the Holy Roman Empire 1648–1715. Vol. LII, Studies Presented to International Commission for the History of Representative and Parliamentary Institutions. Bruxelles, 1975.\n*   Volk, Helmut. [https://web.archive.org/web/20110307145219/http://www.waldwissen.net/technik/land_raum/fva_rheinkorrektur/index_DE \"Landschaftsgeschichte und Natürlichkeit der Baumarten in der Rheinaue.\"] Waldschutzgebiete Baden-Württemberg, Band 10, pp.&nbsp;159–167.\n* Walker, Mack. German Home Towns: Community, State, and General Estate, 1648–1871. Ithaca, Cornell University Press, 1998.\n* Whaley, Joachim. Germany and the Holy Roman Empire: Volume I: Maximilian I to the Peace of Westphalia, 1493–1648.  Oxford, Oxford University Press, 2012.\n* Wilson, Peter Hamish. German Armies: War and German Politics 1648–1806.'' London, UCL Press, 1997. ."
    }
  ]
}