{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Ulug-Tag\n\n| strength1         = Unknown\n| strength2         = 200,000–300,000\n| casualties1       = Unknown\n| casualties2       = Very heavy; almost entire army\n}}\nBattle of Ulug-Tag — The battle of a small Kazakh detachment against superior Uzbek forces.\nBackground\nThe following year, Muhammad Shaybani launched another campaign into the Desht-i-Kipchak, once again choosing winter for his advance. He set up camp near Sygnak and sent his troops, led by Timur Sultan and Ubaydullah Sultan, toward Ulytau, where Sultan Kasym's headquarters were located at the time. Kasym did not engage in battle and retreated, which at first seemed like a withdrawal in the face of superior forces. Later, it became clear that this was a deliberate maneuver. Shaybani's commanders failed to recognize the ruse, settled in the abandoned camp, and became preoccupied with dividing the spoils.\nHistory\nKasym Khan sent a reconnaissance detachment led by one of his beks. Abdullah Balkhi refers to him as Moyynsyz Hasan, while Mirza Muhammad Haidar mistakenly names him \"Buyun Pir Hasan\". In Sheibaniada by I.N. Berezin, authored by Alla-Murad Annabay-ogly, this commander is mentioned as Buyunsyz-Hasan. According to this later source, it was his encampments, not those of Kassym Khan himself, that were raided by the Uzbeks.\nAt night, Moyynsyz-Hasan's detachment unexpectedly approached the Sheibanid camp. Panic broke out among the enemy ranks, as the Sheibanid sultans, not expecting an attack from the Kazakhs, had not even posted guards. As a result, their army became disorganized and was unable to mount an effective defense. This led to the complete defeat of the Uzbek forces and a decisive victory for the Kazakh detachment.\nThis event casts doubt on Abdullah Balkhi's claims about the \"vast\" size of the Uzbek army. According to his account, the Kazakhs managed to capture the weaponry of the entire Uzbek force. Several prominent commanders were killed in the battle, including Kanbar-mirza, the senior bek of Muhammad Sheibani Khan and the governor of Balkh. Kanbar-mirza was one of the most influential figures in Uzbek tribal aristocracy and was also connected by family ties to the Sheibanid dynasty: his daughter was married to Janibek Sultan, the uncle of Muhammad Sheibani.\nThe surviving warriors fled to Sheibani Khan's headquarters, bringing news of their disastrous defeat. Soon after, rumors spread that Kassym Khan's main forces were advancing, prompting Muhammad Sheibani to hastily retreat without waiting for further confirmation. Commenting on this, V.V. Vel'yaminov-Zernov remarked: \"Thus, even for Sheibani, at the peak of his power, Kasym Khan was a formidable opponent.\"\nIn reality, the information about Kassym Khan's approaching army was inaccurate. The Uzbeks were actually being pursued by the same detachment under Moyynsyz-Hasan. Demoralized and weakened, they were unable to put up significant resistance, and several more close associates of Muhammad Sheibani perished during the retreat. It was only by the end of winter that the remnants of the defeated Uzbek army managed to reach Mawarannahr.\nReferences"
    }
  ]
}