{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Ben Guerdane\n\n)\n|place = Ben Gardane, Medenine Governorate, Tunisia\n|result = Tunisian victory\n|combatant1 =  Islamic State in Libya  Ansar al-Sharia (Tunisia)\n|combatant2 =  Tunisia\n* Tunisian Army\n* Tunisian National Guard\n* Police Force and Customs Officials\n|commander1 =Various\n|commander2 = Habib Essid Beji Caid Essebsi Farhat Horchani(Minister of National Defense) General Ismaïl Fathali(Army Chief of Staff) Samir Naqi(Senior police official) Mohamed Maali(Head of counter-terrorism department) Colonel Abdel Atti Abdelkabir (Local anti-terror security chief)†\n|strength1 = ~100 fighters\n|strength2 = Unknown\n|casualties1 = 35–55 killed52 captured\n|casualties2 = 13 killed14 wounded\n|casualties3 = 7 civilians killed3 civilians wounded\n|notes=† Head of counter-terrorism division assassinated in home by militants.\n}}\nThe Battle of Ben Guerdane occurred on March 7, 2016, in the city of Ben Gardane in Tunisia on the border with Libya. Islamic State forces attempted to seize the city, but were repulsed by the Tunisian military. The clashes continued also on 8 and 9 March in the area.\nThe attack\nArmed groups of militants from the Islamic State in Libya and Ansar al-Sharia began the attack on the town by grouping around and seizing the local mosque. The mosque loudspeakers were used to broadcast a message and a signal for the attack on government facilities. The Tunisian National Guard, military barracks, and police posts were simultaneously ambushed, in an attempt to take over Ben Guerdane and establish an \"emirate\" within Tunisia. The fighting continued between the attackers and Tunisian military and police reinforcements, until clashes ended in mid-morning, and continued pursuit operations in the vicinity lasted the rest of the day.\nCasualties\nThe Ministry of Interior and the Ministry of National Defense put the death toll at 55 armed militants, 13 security forces members and seven civilians.\nReactions\n* : United Nations Security Council condemned “in the strongest terms” the terrorist attack. In a statement, the council considered that “any acts of terrorism are criminal and unjustifiable, regardless of their motivation, wherever, whenever and by whomsoever committed.” It also “underlined the need to bring perpetrators... of these reprehensible acts of terrorism to justice,” reaffirming “the need for all States to combat” this scourge by all means.\nSee also\n* 2014 Chaambi Mountains attack\n* 2015 Bardo National Museum attack\n* 2015 Sousse attacks\n* 2015 Tunis bombing\nExternal links\n*\nBibliography\n* Epopee of Ben Guerdane: Secrets and Mysteries of the Battle of March 2016, Editions Sotumedias, Tunis, 2020 .\nReferences"
    }
  ]
}