{
  "content": [
    {
      "type": "text",
      "text": "# Battle of the Worlds__disambig_1\n\nor  -->\n| director       = Anthony Dawson\n| producer       =\n| screenplay     = Vassily Petrov\n| story          = Vassily Petrov\n| based_on       =\n| starring       =\n| music          = Mario Migliardi\n| cinematography = Marcello Masciocchi\n| editing        = Mario Serandrei\n| studio         = Ultra Film - Sicilia Cinematografica\n| distributor    = Lux Film\n| released       =\n| runtime        = 84 minutes\n| country        = Italy\n| language       = English (the film's name)  Italian\n| budget         =\n| gross          =\n}}\nBattle of the Worlds () is a 1961 Italian science fiction film directed by Anthony Dawson. The film stars Claude Rains, Bill Carter, and Maya Brent.\nPlot\nDr. Fred Steele (Umberto Orsini) and Eve Barnett (Maya Brent) work together at an astronomical station on a bucolic island. Steele has just had his request for a transfer approved, and he and Eve look forward to leaving the island and getting married. However, their budding romance is quickly put on hold as the station's scientists learn they must deal with a rogue planet&mdash;\"The Outsider\"—that has entered the Solar System, and which is on a collision course with Earth. The brilliant but cantankerous Professor Benson (Claude Rains), living in an adjacent greenhouse with his dog Gideon, predicts that the Outsider will not strike the Earth but will simply make a close pass—a prediction that no other scientist will endorse.  Meanwhile, a military base on Mars encounters the stray planet on its approach to Earth, and Commander Robert Cole and his wife Cathy quickly travel to the island outpost from Mars to help with the effort.\nThe base scientists are elated when the Outsider passes the earth at a distance of 95,000 miles, just as Benson predicted. But Benson himself is stunned when the Outsider takes up an orbit round Earth. He concludes that the Outsider must be controlled by an alien intelligence, and he calls upon the world's scientific governing council to destroy it without delay.\nAgainst Benson's wishes, an expedition is launched to make a close study of the new planet. As the exploratory spacecraft approach, a number of disc-shaped alien spaceships emerge from beneath the planet's surface, destroying the Earth vessels.\nThe phantom planet begins spiraling inward toward the Earth, creating hurricanes and storms, and the beginning of the end appears to be near. Professor Benson discovers that the alien ships are computer-controlled, and he devises a way to seize control of them from the Outsider. Benson is given the opportunity to join an expedition to the Outsider, to learn something of its underground base. Meanwhile, a plan is hatched to launch an all-out attack against the planet, in the hope that a massive nuclear strike will break the planet apart.\nBenson's expedition discovers a race of humanoid creatures dead at the controls of their planet-spaceship, as the automated systems continue their work without purpose. But the expedition has overrun its allotted time, and the order is given to begin the attack. It is a race against time as the members of the expedition try to get back to the ship before the nuclear warheads strike. Cathy is mortally wounded in the attempt to flee the Outsider. Benson refuses to leave, insisting that life without scientific knowledge is not worth living. He sees a way to communicate with the Outsider and program it to leave, but it is too late. The warheads reach their target, and the Outsider is successfully destroyed.  As the exploratory ship returns to Earth, Commander Cole speaks Benson's epitaph: \"Poor Benson—if they'd opened up his chest, they would only find a formula where his heart should have been\". The screen fades out on Benson's little dog waiting for him by the window.\nCast\n* Claude Rains as Professor Benson\n* Bill Carter as Cmdr. Robert Cole\n* Umberto Orsini as Dr. Fred Steele\n* Maya Brent as Eve Barnett\n* Jacqueline Derval as Mrs. Collins\nRelease\nBattle of the Worlds was released in Italy in 1961 as Il pianeta degli uomini spenti.\nReception\nFrom retrospective reviews, Phil Hardy's book Science Fiction referred to the film as one of Margheriti's \"most humorous, inventive, stylish films, effortlessly transcending the crudities of the script, acting and special effects.\"\nWriting on Trailers from Hell, critic Glenn Erickson described the film as \"toy rockets, overripe dialogue and thunderous acting from Rains [...] leading to a finale in an ‘alien brain cave’ made of colored plastic tubes,\" adding that the film \"manages to squeak by, flimsy production short-cuts and all,\" and that \"this critical ‘triumph of the imagination’ indeed makes something entertaining out of very, very little.\" A review in TV Guide reported that \"this far-fetched space yarn is saved somewhat by Rains's performance\" and that \"impressive sets and sharp direction by Margheriti offset a docile cast, contrived dialog, and poor English dubbing.\"\nReferences\nCitations\nBibliography\n*\nExternal links\n*\n*"
    }
  ]
}