{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Zhongli\n\nThe Battle of Zhongli (Chinese: 鍾離之戰) took place in 507 AD in China, where forces of Northern Wei were defeated by the army of the Liang dynasty.\nZhongli is a military fortress on the banks of the Huai River. Since it is close to Jiankang and controls the strategic location of Huainan, it has been a strategic location that both sides have to fight for since the division of the Northern and Southern Dynasties. Many wars have occurred in history, especially in the Northern Dynasty's southern expeditions, most of which took Zhongli as the primary target. During the reign of Emperor Wu of Liang alone, at least three battles for Zhongli took place.\nHowever, due to the dangerous terrain of Zhongli and the fact that the northerners were not accustomed to water, the Southern Dynasty won most of the victories. In 505, Emperor Wu of Liang decided to launch a northern expedition and ordered Xiao Hong, the King of Linchuan, to serve as the general commander. The Northern Wei sent Yuan Ying, the King of Zhongshan, to lead the attack. Both armies claimed to have millions of men, and their strength was comparable. However, the cowardly and incompetent Xiao Hong actually fled the battlefield in front of everyone. The Liang army immediately fell into disarray and collapsed without a fight. The Northern Wei army advanced all the way and approached the city of Zhongli, which had only 3,000 defenders. In this critical moment, Emperor Wu of Liang sent Wei Rui and Cao Jingzong to lead an army of 200,000 to support. The Liang army took advantage of the surging Huai River and combined their naval superiority with fire attacks to defeat the Northern Wei army, which was not good at swimming, and captured and killed nearly 300,000 people. The historical novel \"奔流 (Honryū)\" written by Japanese writer Tanaka Yoshiki is based on this battle.\nBackground\nAt the beginning of Emperor Wu of Liang's reign, Northern Wei was in turmoil. Not only was the state plagued by political corruption, but the people, burdened by heavy taxes and corvée labor since the relocation of the capital, were also burdened by years of war against the Southern Dynasties. Civil unrest broke out across the country. Emperor Wu of Liang saw this as an opportune opportunity to launch a northern expedition and, with his younger brother, Xiao Hong, Prince of Linchuan, as commander-in-chief of the Northern Expeditionary Force, and Liu Tan as deputy commander, they led a large army to Luokou (the junction of the Luojiang and the Huai River, northeast of present-day Huainan, Anhui). Upon learning of this, the Northern Wei sent Yuan Ying, Prince of Zhongshan, recently crowned for his contributions in the invasion of Qi dynasty, to lead the army to meet the enemy. Both armies were said to number millions.\nThe initial fighting unfolded along the Yangtze River, stretching from Qing and Xu (present-day northern Jiangsu and southeastern Shandong) in the east to Henan in the west. However, the eastern part of the Yangtze River was the most intense. Localized battles saw both sides win and lose. For example, Wei Rui of Liang dynasty cleverly diverted the Fei River, causing the water level to rise, allowing him to capture Hefei with his navy. This battle earned Wei Rui widespread fame, and the Northern Wei soldiers feared him, calling him \"Wei the Tiger.\" On the Northern Wei side, General Yang Dayan inflicted a heavy defeat on the Liang army on the battlefield in Henan. He then joined forces with General Xing Luan at Suyu (present-day Suqian, Jiangsu), defeating and killing the Liang general Lan Huaigong. Soon after, the Northern Wei mobilized approximately 100,000 troops from six northern prefectures, further strengthening the Northern Wei military.\nOn the other hand, the main force of the Liang Dynasty, led by Xiao Hong, stopped advancing after capturing Liangcheng (now Shou County, Anhui Province) because of his cowardice. His subordinate Lu Sengzhen also tried his best to stop the army from advancing. Xiao Hong then began to think of retreating. A fierce debate broke out within the Liang army on whether to advance or not. When the Wei army heard about this, they also ridiculed Xiao and Lu as \"Xiao the Girly\" and \"Lu the Old\", in contrast to Wei Rui, who was known as \"Wei the Tiger\". Xiao Hong was subsequently frightened by a sudden storm and fled from the battlefield. This action caused the morale of the Liang army to collapse, resulting in nearly 50,000 casualties. This also forced Wei Rui's army, which was on its way to Luoyang, to retreat. The Southern Liang army, which was regarded by the Northern Wei as \"unprecedented in hundreds of years\", began to show signs of defeat.\nBattle\nThe Liang army, thrown into disarray by the desertion of its commander, seized the opportunity. Yuan Ying, the Prince of Zhongshan of the Northern Wei, seized the opportunity and marched southward, capturing over forty cities. In September, they captured Matou (present-day Mengcheng, Anhui) and transported all the city's food supplies north. In October, the army reached Zhongli (northeast of Fengyang County, Anhui Province), which was defended by Chang Yizhi, the governor of Northern Xuzhou. There, they joined forces with Yang Dayan's army, bringing their combined force to hundreds of thousands. Zhongli, by contrast, had only 3,000 defenders, creating a stark disparity in strength. Emperor Xuanwu of Northern Wei originally wanted to order Xing Yan's army to join the siege, but Xing Yan believed that Zhongli was surrounded by the Huai River, making it a natural barrier that was easy to defend but difficult to attack, and that the army should attack from elsewhere. Emperor Xuanwu rejected this proposal, and then asked General Xiao Baoyin of Zhendong to replace Xing Yan and attack Zhongli City together with Yuan Ying. In November, Emperor Wu of the Liang Dynasty ordered General Wei Jingzong of the Right Guard to lead an army of 200,000 to rescue Zhongli City and station them at Daorenzhou (in the middle of the Huai River, northeast of Fengyang County, Anhui Province) until all the troops were gathered and then advance together. Zhongli was located on the north side of the Huai River, making it difficult to attack. In the first month of 507, Yuan Ying of the Northern Wei Dynasty and General Yang Dayan of Pingdong built a long bridge across the river connecting the north and south banks of the Huai River on both sides of Shaoyangzhou (west of Daorenzhou) in the Huai River. Yuan Ying stationed his troops on the south bank, responsible for the siege; Yang Dayan commanded the north bank, providing support from a tower and responsible for transporting supplies. Xiao Baoyin ensured the accessibility and safety of the bridge itself. The Northern Wei army used carts to transport large amounts of earth to fill the ditches surrounding Zhongli. They also used rams to ram the city walls and continued their assaults using chariot warfare tactics. However, they were met with a fierce counterattack from the city's defenders. Chang Yizhi also promptly filled the damaged walls with earth. As a result, the Northern Wei army suffered over ten thousand casualties but was unable to gain the upper hand, and the battle gradually became a stalemate.\nIn February, Emperor Xuanwu of Wei deemed it inappropriate to fight further and ordered Yuan Ying to return. Yuan Ying requested more time, and Emperor Xuanwu dispatched Infantry Captain Fan Shao to Yuan Ying's camp to discuss the attack. Meanwhile, upon receiving the news, Wei Rui, the Yuzhou Governor stationed in Hefei, immediately dispatched his troops. They crossed the Yinling Lake southwest of Zhongli and joined Cao Jingzong, who was stationed on Daoren Island. Under Cao Jingzong's command, they reached the other side of Shaoyang Island at night. That night, under the guidance of Feng Daogen, the prefect of Liang, the entire army dug a trench, planted deer antlers, and built a fortification twenty li in front of Cao Jingzong's camp, bringing them to within a hundred paces (less than 200 meters) of the Wei camp. At dawn, Yuan Ying was shocked, and the morale of the Wei army was deeply shaken. At the same time, Cao Jingzong sent people to sneak across the Huai River to inform Zhong Li that reinforcements had arrived. When Chang Yizhi's subordinates received this news, their morale was greatly boosted. Yang Dayan led more than 10,000 cavalry to fight, and the attack was very fierce. Wei Rui formed a chariot formation, and Yang Dayan's cavalry surrounded it. Wei Rui fired 2,000 powerful crossbows at the same time, killing and wounding many Wei soldiers. Although Yang Dayan and Yuan Ying launched attacks on the main camp of the Liang army on Shaoyang Island, they were both repelled by Wei Rui's clever tactics. Yang Dayan was also injured by an arrow in his right arm. Yuan Ying led his troops to fight again, and fought several times a day, and attacked again at night, but was repelled every time.\nDuring the war, whenever the Liang army sent herders to the north bank of the Huai River to harvest and transport grain and fodder, they were plundered by troops stationed there by Yang Dayan's army. Cao Jingzong then dispatched over a thousand men to build a fortification on the north bank to confront the Wei army, assigning his general Zhao Cao to defend it. Hence, the fortress became known as Zhao Cao's Fortress. Zhao Cao's Fortress not only ensured the Liang army's access to grain and fodder, but also indirectly cut off the Wei army's supply routes. Cao Jingzong then recruited over a thousand brave men and set up camp a few miles south of Yang Dayan's camp, repelling the attacking Wei army.\nUpon receiving reports of the battle, Emperor Wu of Liang ordered Cao Jingzong to pre-install tall warships, bringing them to the same height as the Wei pontoon bridges. He then instructed Wei Rui and Cao  Jingzong to embark on warships and launch a fire attack on two bridges, attacking the north and south bridges of Shaoyang Island, respectively. In March of 507, the Huai River surged to a height of seven feet. Wei Rui led Feng Daogen, Pei Sui, Li Wenzhao and others, took the opportunity to launch an offensive against the Wei army with the navy, and attacked the Wei army on the island with fighting ships. Taking advantage of the strong wind, they set fire to the bridges and personally burned them with small boats loaded with fuel and fodder. Simultaneously, they dispatched death-defying soldiers to remove the railings and cut down the bridges. The flood was so rapid that the bridges and railings were destroyed in an instant. The Wei army was instantly defeated. Yuan Ying and Yang Dayan fled, leaving over 100,000 Wei soldiers dead, drowned, or killed. Seeing this, Chang Yizhi led his troops out of Zhongli castle, pursuing the retreating Wei army and capturing 50,000 alive. The Wei dead were scattered over a hundred miles along the Huai River, but Yuan Ying escaped with his life and made it to Liangcheng. Yang Dayan burned his camp and fled, and the Liang army pursued him, capturing another 50,000 Wei soldiers.\nAftermath\nThe Liang Dynasty won a great victory, and the Northern Wei army was almost completely annihilated, but Yuan Ying, Yang Dayan, and Xiao Baoyin all escaped death. After the three returned to the country, some officials suggested that they be sentenced to death, but Emperor Xuanwu pardoned the three and only stripped Yuan Ying and Xiao Baoyin of their titles and demoted them to civilians. Yang Dayan was exiled to Yingzhou as a soldier. However, Emperor Xuanwu soon restored the titles of the three to deal with domestic rebellion and military action against the Southern Dynasties.\nBattle of Zhongli was the biggest setback in all the military operations of the Northern Wei against the Southern Dynasties, and it also had the most far-reaching impact, causing great damage to the national strength of the Northern Wei. After that, civil unrest intensified and the political situation became even worse. The people who were oppressed by heavy labor service and taxes either fled to the mountains, or became dependent on powerful people, or became monks, resulting in an overcrowding of monks in the country. In addition to having a negative impact on national development, it also caused social unrest. During the reign of Emperor Xuanwu, four civil uprisings were led by monks. These increasingly worsening factors eventually led to the division of the country.\nThis battle was an unprecedented victory for the Southern Liang Dynasty and even for the entire history of the Southern Dynasties. It was \"the greatest victory ever achieved in the history of the war between the North and the South\", indicating that the balance of power between the Northern and Southern Dynasties had changed and that the Northern Wei Dynasty began to decline. However, although the Liang Dynasty maintained relative stability, Emperor Wu of Liang never gave up the idea of a northern expedition. He continued to use military force for years, weakening the country's strength and sowing the seeds for the Hou Jing's Rebellion in the future.\nReferences"
    }
  ]
}