{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Johnsonville__disambig_1\n\n|result=Confederate victory\n|combatant1=  United States (Union)\n|combatant2=  CSA (Confederacy)\n|commander1=Charles R. ThompsonEdward M. King\n|commander2=Nathan Bedford Forrest\n|units1 = Johnsonville garrison\n|units2 = Forrest's Cavalry Division\n|strength1=4,000  3 gunboats\n|strength2=\n|casualties1=150 captured\n|casualties2=2 killed  9 wounded\n|}}\nThe Battle of Johnsonville was fought November 4–5, 1864, in Benton and Humphreys counties, Tennessee, during the American Civil War. Confederate cavalry commander Major General Nathan Bedford Forrest culminated a 23-day raid through western Tennessee by attacking the Union supply base at Johnsonville. Forrest's attack destroyed a total of 28 Union boats and barges in the Tennessee River and millions of dollars of supplies, disrupting the logistical operations of Union Major General George H. Thomas in Nashville. As a result, Thomas's army was hampered in its plan to defeat Confederate Lieutenant General John Bell Hood's invasion of Tennessee, known as the Franklin–Nashville campaign. (Thomas eventually succeeded in repulsing Hood.)\nPart of the battlefield has been preserved in Johnsonville State Historic Park. Much of the original battleground was submerged by the creation of Kentucky Lake in 1944.\nBackground\nThe Union relied on the Tennessee River as a critical route to supply Federal forces in the state. Supplies were offloaded at Johnsonville and shipped by rail to Nashville. In the fall of 1864 the supplies were principally meant for the Army of the Cumberland, commanded by Thomas. Meanwhile, Hood's army was marching through northern Alabama on its way to an invasion of Tennessee. In late September 1864, Hood's army departed northwest from the vicinity of Atlanta, Georgia, hoping its destruction of Union supply lines would lure Major General William T. Sherman's Union army into battle. Sherman pursued Hood as far as Gaylesville, Alabama, but decided to return his army to Atlanta. He conducted a March to the Sea through Georgia, destroying supplies and infrastructure. Tennessee had been occupied by federal troops since 1862, and Sherman charged Thomas with its defense.\nLieutenant General Richard Taylor ordered Forrest on a wide-ranging cavalry raid through Western Tennessee to destroy the Union supply line to Nashville. Forrest's initial objective was Fort Heiman on the Tennessee River north of Johnsonville, possession of which would prevent Union transports from reaching Johnsonville, upriver. The first of Forrest's men began to ride on October 16, 1864. They were exhausted from a previous raid and Forrest gave them orders to disperse, obtain new mounts and supplies, and return to the raid. Forrest began moving north on October 24 and reached Fort Heiman on October 28, where he emplaced artillery. On October 29 and October 30, his artillery fire resulted in the capture of the steamers Mazeppa, Anna, and Venus, as well as the gunboat Undine. At this point, the Union stopped river supply traffic to Johnsonville.\nForrest repaired two of the boats, Undine and Venus, to use as a small flotilla to aid in his attack on Johnsonville. The boats and his cavalrymen departed on November 1, 1864. The infantry component, traveling overland, encountered difficult road conditions following recent rains. On November 2, Forrest's flotilla was challenged by two Union gunboats, Key West and Tawah. Venus was run aground and captured. The Federals dispatched six more gunboats from Paducah, Kentucky, and on November 3 they engaged in artillery duels with strong Confederate positions on either end of Reynoldsburg Island, near Johnsonville. The Federal fleet had difficulty attempting to subdue these positions and were occupied as Forrest prepared his force for the attack on Johnsonville.\nBattle\n.]]\nOn the evening of November 3, 1864, Forrest's artillerist, Capt. John Morton, positioned his guns across the river from the Federal supply base at Johnsonville. On the morning of November 4, Undine and the Confederate batteries were attacked by three Union gunboats from Johnsonville under U.S. Navy Lt. Edward M. King and by the six Paducah gunboats under Lt. Cmdr. LeRoy Fitch. Capt. Frank M. Gracey (a former steamboat captain serving as a Confederate cavalryman) abandoned Undine, setting her on fire. Her ammunition magazine exploded, ending Forrest's brief career as a naval commander. Despite this loss, the Confederate land artillery was completely effective in neutralizing the threat of the Federal fleets. Fitch was reluctant to take his Paducah gunboats through the narrow channel between Reynoldsburg Island and the western bank, so limited himself to long-range fire. King withered under the Confederate fire, which hit one of his vessels 19 times, and returned to Johnsonville. According to one historian of guerrilla warfare in the Cumberland River valley, possibly describing the 1st Regiment Heavy Artillery U.S. Colored Troops, \"Apparently the only sustained resistance came from one of the black regiments, armed with repeating rifles, whose officers claimed that their men prevented Forrest's raiders from crossing the river and destroying the entire facility.\"\nCapt. Morton's guns bombarded the Union supply depot, and the 28 steamboats and barges positioned at the wharf. All three of the Union gunboats—Key West, Tawah, and Elfin—were disabled or destroyed. The Union garrison commander ordered the supply vessels burned to prevent their capture by the Confederates. Forrest observed, \"By night the wharf for nearly one mile up and down the river presented one solid sheet of flame. ... Having completed the work designed for the expedition, I moved my command six miles during the night by the light of the enemy's burning property.\"\nAftermath\nForrest caused enormous damage at very low cost. He reported only two men killed and nine wounded. He described the Union losses as 4 gunboats, 14 transports, 20 barges, 26 pieces of artillery, and $6.7 million ($}} in ) worth of property, and 150 prisoners. One Union officer put the monetary loss at $2.2 million ($}} in ). An additional consequence of the raid was that the Union high command became increasingly nervous about Sherman's plan to move through Georgia instead of confronting Hood and Forrest directly. Forrest's command, delayed by heavy rains, proceeded to Perryville, Tennessee, and eventually reached Corinth, Mississippi, on November 10, 1864.\nDuring Forrest's earlier raiding in western Tennessee, on November 3, Confederate theater commander Gen. P.G.T. Beauregard had designated Forrest's cavalry for assignment to Hood's Army of Tennessee for the planned Franklin–Nashville Campaign. Hood elected to delay his advance from Tuscumbia, Alabama, north into Tennessee, until he could meet with Forrest, who arrived with his forces on November 16. The delay allowed Thomas time to prepare his defenses for the Battle of Nashville the following month, in which he repulsed the Confederate attempt to retake the city, a defeat that effectively ended the war in the Western Theater.\nLegacy\nThe Battle of Johnsonville is now the focus of two Tennessee state parks: Nathan Bedford Forrest State Park, which is situated on the Benton County side of the river, and Johnsonville State Historic Park, which is situated on the Humphreys County side. The Civil War Trust (a division of the American Battlefield Trust) and its partners have acquired and preserved  of the battlefield.\nMuch of the historic battlefield area is submerged beneath the southern portion of Kentucky Lake. This large, navigable, manmade reservoir was created by the 1944 completion by the Tennessee Valley Authority (TVA) of a dam on the Tennessee River for flood control. The lake area also provides recreation opportunities.\nSee also\n*\nNotes\nReferences\nCitations\nSources\n*\n*\n*\n*\n*  }}\n*\nExternal links\n* [https://web.archive.org/web/20070714043647/http://www.nps.gov/history/hps/ABPP/battles/tn032.htm National Park Service battle description]\n* [https://web.archive.org/web/20121108210932/http://www.nps.gov/hps/abpp/CWSII/TennesseeBattlefieldProfiles/Hartsville%20to%20Johnsonville.pdf CWSAC report update]"
    }
  ]
}