{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Courtrai (1918)\n\n| result      = Allied victory\n| combatant1  =  Belgium\n*  Newfoundland\n*\n| combatant2  =\n| commander1  =  King Albert I Jean Degoutte  Cyriaque Gillain Herbert Plumer\n| commander2  =  Erich Ludendorff Crown Prince Rupprecht Sixt von Armin Ferdinand von Quast\n| strength1   =\n| strength2   =\n| casualties1 = Not available\n| casualties2 = Not available12,000 soldiers captured550 artillery pieces captured.\n|campaignbox=\n}}\nThe Battle of Courtrai (also known as the Second Battle of Belgium () and the Battle of Roulers ()) was one of a series of offensives in northern France and southern Belgium that took place in late September and October 1918.\nBackground\nThe  (GAF) comprising twelve Belgian divisions, ten divisions of the British Second Army and six divisions of the French Sixth Army, under the command of King Albert I of Belgium, with the French General Jean Degoutte as Chief of Staff, defeated the German 4th Army in the Fifth Battle of Ypres  The breaking of the Hindenburg Line further south, led the Allies to follow a strategy of pursuing the Germans for as long as possible, before movement was stopped by the winter rains. Mud and a collapse of the supply-system, had stopped the advance in early October but by the middle of the month, the GAF was ready to resume the offensive.\nBattle\nThe offensive began at  on 14 October, with an attack by the GAF from the Lys river at Comines northwards to Diksmuide. The British creeping barrage advanced at a rate of  per minute, much faster and much further than the practice in 1917, in expectation that there would be little resistance from German infantry. By the evening the British forces had reached high ground which dominated Werviq, Menen and Wevelghem in the south; further north the British captured Moorslede and closed up to Gulleghem and Steenbeek. Belgian troops on the left reached Iseghem, French troops surrounded Roulers and more Belgian troops captured Cortemarck.\nRoulers fell the next day and by 16 October, the British held the north bank of the Lys up to Harelbeke and had crossed the river at several points. By 17 October, Thourout, Ostend, Lille and Douai had been recaptured; Bruges and Zeebrugge fell by 19 October and the Dutch border was reached the following day. The crossing of the Lys and the capture of Courtrai by the British Second Army on 19 October, led to a German retreat on the front of the Fifth Army further south, which encircled Lille on 18 October. The next day the British were in Roubaix and Tourcoing and by the evening of 22 October, the British had reached the Scheldt from Valenciennes to Avelghem.\nAftermath\nA new offensive would be launched by the GAF on 30 October, which would be ended by the Armistice signed on 11 November.\nBy the time the Armistice had been signed, the front was an average of  east of the old front line and ran from Terneuzen to Ghent, along the River Scheldt to Ath and from there to Saint-Ghislain, where it joined with the BEF positions on the Somme.\nSee also\n* Battle of Courtrai (disambiguation), for other battles with this name\n* Charge of Burkel, a skirmish between Belgian and German forces on 19 October 1918, notable as the last cavalry charge in Western Europe.\nFootnotes\nReferences\n*\n*\n|series=History of the Great War Based on Official Documents by Direction of the Historical Section of the Committee of Imperial Defence |title=Military Operations France and Belgium 1918: 26th September – 11th November The Advance to Victory |volume=V |last1=Edmonds |first1=J. E. |last2=Maxwell-Hyslop |first2=R. |author-link=James Edward Edmonds |year=1993 |orig-year=1947 |publisher=HMSO |location=London |edition=Imperial War Museum & Battery Press |isbn=0-89839-192-X}}\n*\n*\nExternal links\n* [http://www.historyofwar.org/articles/wars_hundred_days.html The Hundred Days, 18 July-11 November 1918]\n* [http://pagesperso-orange.fr/grande.guerre/sitocobre18.html Situation au Debut D'Octobre 1918 (in French)]\n* [https://web.archive.org/web/20150610205435/http://www.cwgc.org/victory1918/admin/files/Victory%201918%20Map.pdf CWGC Map, Victory offensive 1918]\n* [http://users.telenet.be/blindganger/eindoffensief.htm Eindoffensief (in Dutch), with a map of the advance day by day]"
    }
  ]
}