{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Orkynia\n\nThe Battle of Orkynia was fought in 319 BCE near Orkynia in Cappadocia. It was one of first battles of the wars between the successors to Alexander the Great, the so called Diadochi.  At Orkynia the armies of Antigonus Monophthalmus and Eumenes the Cardian met; the battle resulted in a stunning Antigonid victory.\nBackground\nAfter the death of Alexander the Great in 323 BCE, his generals immediately began squabbling over his huge empire. Soon it degenerated into open warfare, with each general attempting to claim a portion of Alexander's vast empire. One of the most talented successor generals (Diadochi) was Antigonus Monophthalmus, so called because of an eye he lost in a siege. During the early years of warfare between the Diadochi, he faced Eumenes, a capable general who had already defeated Craterus. After the First War of the Diadochi, the war against Perdiccas, ended in 321 BCE, the second partition of the Empire, the Partition of Triparadisus, took place. It stipulated that Antipater became  the new regent of the Empire and Antigonus strategos of Asia. Antipater charged Antigonus with hunting down and defeating the remnants of the Perdiccan faction. Antigonus took command of the Royal Army and after being reinforced with more reliable troops from Antipater's European army he moved against their enemies in Asia Minor. He first marched against Eumenes in Cappadocia but had to leave a substantial force to watch Alcetas who was in Pisidia in his rear. Therefore, Antigonos was only able to take 10,000 infantry (half of them Macedonians), 2,000 cavalry and thirty elephants against Eumenes, who had some 20,000 infantry and 5,000 horse.\nPrelude\nEumenes outnumbered Antigonus in infantry and cavalry, despite this Antigonus adopted a bold, attacking strategy. Eumenes was encamped on a plain well-suited for cavalry fighting near Orkynia when Antigonus suddenly arrived and camped on a hill overlooking the plain. Because of his position, Antigonus could give or refuse battle at will. Unbeknownst to Eumenes, Antigonus got in touch with his cavalry officer Apollonides, who was willing to change sides.\nBattle\nOne day Antigonus drew up his phalanx twice as long as usual, hereby tricked his opponent into thinking he had twice as much infantry as he in fact had, this was combined with the treachery of Apollonides' cavalry. In this way Eumenes' army was put to flight. Not content with this, Antigonus sent his cavalry to capture Eumenes' baggage. There were thus three elements in Antigonus's battle tactics, and the result was a brilliant victory, in which his smaller army slew about 8,000 of the enemy and most of the rest went over to him.\nAftermath\nEumenes escaped with a substantial body of troops, he captured and killed the traitor Apollonides, evaded the pursuit of Antigonus's forces, and doubled back to the battlefield, where he buried his dead. Eventually Antigonus caught up with Eumenes, who was forced to take refuge in a stronghold called Nora with his closest followers, some 600–700 in number. There Antigonus invested him closely, but the fortress was well stocked and virtually impregnable. Antigonus left the siege of Nora to a subordinate and marched with the bulk of his army to deal with the remaining Perdiccans: Alketas, Polemon, Dokimos and Attalos.\nReferences\nSources\n*\n*  | url-access = registration }}"
    }
  ]
}