{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Setina__disambig_1\n\nThe Battle of Setina () took place in the autumn of 1017 near the village of Setina in modern northern Greece between the armies of the Bulgarian Empire and Byzantine Empire. The result was Byzantine victory.\nPrelude\nIn 1014, after decades of war, the Byzantine Emperor Basil II scored a decisive victory over the Bulgarian Emperor Samuil in the battle of Kleidion. Samuil died of a heart attack on 6 October 1014 and the Byzantines took the opportunity to penetrate deep into Macedonia, the political heart of the Bulgarian Empire, and seized a number of important cities (Bitola, Prilep, Voden, Maglen). After the new Bulgarian Emperor Ivan Vladislav, who in 1015 assassinated Samuil's son and heir Gavril Radomir, had unsuccessfully tried to make an agreement with Basil II, he organized the defense of the country. The Bulgarians led by the Emperor, Krakra of Pernik and Ivats managed to return a number of towns and castles. The Byzantines were defeated in the battle of Bitola (September 1015) and at the siege of Pernik (summer of 1016).\nThe war in 1017\nIn 1017 Basil II invaded Bulgaria with a large army including Rus' mercenaries. His objective was the town of Kastoria which controlled the road between Thessaly and the coast of modern Albania. He sent parts of his army under the commanders Constantine Diogenes and David Arianites to loot Pelagonia. Basil II himself managed to capture several minor Bulgarian castles but all attempts to seize Kastoria remained futile.\nMeanwhile, the governor of Pernik and Sofia Krakra gathered troops to attack north-eastern Bulgaria which was under Byzantine control since 1001. He had orders by Ivan Vladislav to negotiate with the Pechenegs a joint campaign against the Byzantines. Upon hearing word of the negotiations, Basil II retreated from Kastoria. However, the Bulgarian counter-attack towards Moesia did not take place after the Pechenegs' refusal to back it. Basil II again invaded Bulgaria and took the small fortress of Setina located between Ostrovo and Bitola to the south of the river Cherna.\nThe Bulgarians under the command of Ivan Vladislav marched to the Byzantine camp. Basil II sent strong units under Diogenes to repulse the Bulgarians but the troops of the Byzantine commander were ambushed and cornered. To save Diogenes, the 60-year-old Byzantine Emperor moved on with the rest of his army. When the Bulgarians understood that they retreated chased by Diogenes. According to the Byzantine historian John Skylitzes the Bulgarians had many casualties and 200 were taken prisoners.\nAftermath\nThe battle of Setina had no effect on the outcome of the war. In January 1018 Basil II withdrew to his capital Constantinople. The Bulgarians attacked the Adriatic port of Dyrrhachium and after Ivan Vladislav's death under the walls of the city the resistance finally broke. In the same year the First Bulgarian Empire was annexed by the Byzantine Empire. In 1019 the Byzantines seized the last Bulgarian strongholds.\nSee also\n*Byzantine-Bulgarian Wars\n*Battle of Kleidion\nReferences"
    }
  ]
}