{
  "content": [
    {
      "type": "text",
      "text": "# Battle of the Bogside__disambig_1\n\n| causes = (see background)\n| status =\n| goals =\n| result =\n| methods = large-scale rioting\n| side1 = Derry Citizens' Defence AssociationResidents of the Bogside\n| side2 = Royal Ulster ConstabularyB-Specials\n| side3 =\n| leadfigures1 =\n| leadfigures2 = Anthony Peacocke\n| leadfigures3 =\n| howmany1 = Uncertain; thousands\n| howmany2 = 691\n| howmany3 =\n| casualties1 = At least 1,000 injured\n| casualties2 = At least 350 injured\n| casualties3 =\n| casualties_label =\n| notes =\n}}\nThe Battle of the Bogside was a large three-day riot that took place from 12 to 14 August 1969 in Derry, Northern Ireland. Thousands of Catholic/Irish nationalist residents of the Bogside district, organised under the Derry Citizens' Defence Association, clashed with the Royal Ulster Constabulary (RUC) and loyalists, and sealed off the neighbourhood to authorities. It sparked widespread violence elsewhere in Northern Ireland, led to the deployment of British troops, and is often seen as the beginning of the thirty-year conflict known as the Troubles.\nViolence broke out as the Protestant loyalist Apprentice Boys marched past the Catholic Bogside. The RUC drove back the Catholic crowd and pushed into the Bogside, followed by loyalists who attacked Catholic homes. Thousands of Bogside residents beat back the RUC with a hail of stones and petrol bombs. The besieged residents built barricades, set up first aid posts and petrol bomb workshops, and a radio transmitter broadcast messages calling for resistance. The RUC fired CS gas into the Bogside – the first time it had been used by UK police. Residents feared the Ulster Special Constabulary would be sent in and would massacre Catholic residents.\nThe Irish Army set up field hospitals near the border and the Irish government called for a United Nations peacekeeping force to be sent to Derry. On 14 August, the British Army were deployed and the RUC were withdrawn. The British Army made no attempt to enter the Bogside, which became a no-go area called Free Derry. This situation continued until October 1969 when military police were allowed in.\nBackground\nTensions had been building in Derry for over a year before the Battle of the Bogside. In part, this was due to long-standing grievances held by much of the city's population. The city had a majority Catholic and nationalist population. In 1961, for example, the population was 53,744, of which 36,049 was Catholic and 17,695 Protestant. However, because of gerrymandering after the partition of Ireland, it had been ruled by the Ulster Unionist Party since 1925.\nNationalist grievances\nUnionists maintained political control of Derry by two means. Firstly, electoral wards were gerrymandered so as to give unionists a majority of elected representatives in the city. The Londonderry County Borough, which covered the city, had been won by nationalists in 1921. It was recovered by unionists, however, following re-drawing of electoral boundaries by the unionist government in the Northern Ireland Parliament.\nSecondly, only owners or tenants of a dwelling and their spouses were allowed to vote in local elections. Nationalists argued that these practices were retained by unionists after their abolition in Great Britain in 1945 in order to reduce the anti-unionist vote. Figures show that, in Derry city, nationalists comprised 61.6% of parliamentary electors, but only 54.7% of local government electors. There was also widespread discrimination in employment.\nAs a result, although Catholics made up 60% of Derry's population in 1961, due to the division of electoral wards, unionists had a majority of 12 seats to 8 on the city council. When there arose the possibility of nationalists gaining one of the wards, the boundaries were redrawn to maintain unionist control. Control of the city council gave unionists control over the allocation of public housing, which they allocated in such a way as to keep the Catholic population in a limited number of wards. This policy had the additional effect of creating a housing shortage for Catholics.\nAnother grievance, highlighted by the Cameron Commission's investigation into the riots of 1968, was the issue of perceived regional bias: Northern Ireland government decisions favoured the mainly Ulster Protestant east of Northern Ireland rather than the mainly Catholic west. Examples of such controversial decisions affecting Derry were the decision to close the anti-submarine training school in 1965 which added 600 to an unemployment figure already approaching 20%, the decision to site Northern Ireland's new town at Craigavon, and the siting of Northern Ireland's second university in the mainly unionist town of Coleraine rather than Derry, which had four times the population and was Northern Ireland's second biggest city.\nActivism\nIn March 1968, a handful of activists founded the Derry Housing Action Committee (DHAC), with the intention of forcing the government of Northern Ireland to change its housing policies. The group's founders were mostly local members of the Northern Ireland Labour Party, such as Eamonn McCann, and members of the James Connolly Republican Club (the Northern manifestation of Sinn Féin, which had been banned in Northern Ireland). The DHAC took direct action, such as blocking roads and attending local council meetings uninvited, in order to force them to house Catholic families who had been on the council housing waiting list for a long time. By the middle of 1968, this group had linked up with the Northern Ireland Civil Rights Association (NICRA) and were agitating for a broader programme of reform within Northern Ireland.\nOn 5 October 1968, these activists organised a march through the centre of Derry. However, the demonstration was banned. When the marchers, including Members of Parliament Eddie McAteer and Ivan Cooper, defied this ban they were batoned by the Royal Ulster Constabulary (RUC). Gerry Fitt, the Republican Labour MP for West Belfast, brought three British Labour MPs to observe the march. Fitt took his place at the front of the march and was assaulted by RUC officers. TV pictures of Fitt, a Westminster MP, with bloody head and shirt were broadcast around the world. The actions of the police were televised and caused widespread anger across Ireland, particularly among northern nationalists. The following day, 4,000 people demonstrated in solidarity with the marchers in Guildhall Square in the centre of Derry. This march passed off peacefully, as did another demonstration attended by up to 15,000 people on 16 November. However, these incidents proved to be the start of an escalating pattern of civil unrest that culminated in the events of August 1969.\nJanuary to July 1969\nin the Bogside; the slogan \"You are now entering Free Derry\" was first painted in January 1969 by John Casey.]]\nIn January 1969, a march by the radical nationalist group People's Democracy was attacked by off-duty Ulster Special Constabulary (B-Specials) members and other Ulster loyalists during the Burntollet bridge incident, five miles outside Derry. The RUC refused to protect the marchers. When the marchers (many of whom were injured) arrived in Derry on 5 January, fighting broke out between their supporters and the police. That night, police officers broke into homes in the Catholic Bogside area and assaulted several residents. An inquiry led by Lord Cameron concluded that, \"a number of policemen were guilty of misconduct, which involved assault and battery, malicious damage to property...and the use of provocative sectarian and political slogans\". After this point, barricades were set up in the Bogside and vigilante patrols organised to keep the police out. It was at this point that the famous mural with the slogan \"You are now entering Free Derry\" was painted on the corner of Columbs Street by a local activist named John Casey.\nOn 19 April there were clashes between NICRA marchers, loyalists and the RUC in the Bogside area. Police officers entered the house of Samuel Devenny (42), a local Catholic who was not involved in the riot, and severely beat him with batons. His teenage daughters were also beaten in the attack. Devenny died of his injuries on 17 July and he is sometimes referred to as the first victim of the Troubles. Others consider John Patrick Scullion, who was killed 11 June 1966 by the Ulster Volunteer Force (UVF), to have been the first victim of the conflict.\nOn 12 July (\"The Twelfth\") there was further rioting in Derry, in nearby Dungiven, and in Belfast. The violence arose out of the yearly Orange Order marches commemorating the Battle of the Boyne. During the clashes in Dungiven, Catholic civilian Francis McCloskey (67) was beaten with batons by RUC officers and died of his injuries the following day. Following these riots, Irish republicans in Derry set up the Derry Citizens Defence Association (DCDA) with the intention of preparing for future disturbances. The members of the DCDA were initially Republican Club (and possibly IRA) activists, but they were joined by many other young Labour left-wing activists and local people. This group stated their aim as firstly to keep the peace, but if this failed, to organise the defence of the Bogside. To this end, they stockpiled materials for barricades and missiles, ahead of the Apprentice Boys of Derry march on 12 August, the Relief of Derry parade.\nApprentice Boys march\nThe annual Apprentice Boys parade on 12 August commemorates the relief of the Siege of Derry on 1 August O. S., a Protestant victory. The march was considered highly provocative by many Catholics. Derry activist Eamonn McCann wrote that the march \"was regarded as a calculated insult to the Derry Catholics\".\nAlthough the march did not pass through the Bogside, it passed near to it at the junction of Waterloo Place and William Street. It was here that the initial disturbance broke out. Initially, some loyalists had thrown pennies from the top of the walls at Catholics in the Bogside below, in return marbles were fired by slingshot. As the parade passed the perimeter of the Bogside, Catholics hurled stones and nails, resulting in an intense confrontation.\nThe battle\nThe RUC, who had suffered a barrage of missiles, then moved against the Catholic/nationalist rioters. Whilst the police fought with the rioters at William Street, officers at the Rossville Street barricade encouraged Protestants slingshotting stones across the barricade at the Catholics. The police then tried to alleviate the pressure they were under by dismantling the barricade and moving into the Bogside, on foot and in armoured vehicles. This created a gap through which Protestants also surged, smashing the windows of Catholic homes.\nNationalists lobbed stones and petrol bombs from the top of the high-rise Rossville Flats, halting the police advance, and injuring 43 of the 59 officers who made the initial incursion. When the advantage of this position was realised, the youths were kept supplied with stones and petrol bombs. Groups of loyalists and nationalists continued to throw stones and petrol bombs at each other.\nThe actions of the Bogside residents were co-ordinated to some extent. The DCDA set up a headquarters in the house of Paddy Doherty in Westland Street and tried to supervise the making of petrol bombs and the positioning of barricades. Petrol bomb workshops and first aid posts were set up. A radio transmitter, \"Radio Free Derry\", broadcast messages encouraging resistance and called on \"every able-bodied man in Ireland who believes in freedom\" to defend the Bogside. Many local people, however, joined in the rioting on their own initiative and impromptu leaders also emerged, such as McCann, Bernadette Devlin and others.\nThe RUC was not well prepared for the riot. Their riot shields were too small and did not protect their whole bodies. Furthermore, their uniforms were not flame resistant and some officers were badly burned by petrol bombs. Moreover, there was no system in place to relieve officers, with the result that the same policemen had to serve in the rioting for three days without rest. The overstretched police also resorted to throwing stones back at the Bogsiders, and were helped by loyalists.\nLate on 12 August, police began flooding the area with CS gas, which caused a range of respiratory injuries among local people. A total of 1,091 canisters, each containing 12.5g of CS; and fourteen canisters containing 50g of CS, were fired into the densely populated residential area.\nOn 13 August, Jack Lynch, Taoiseach (Prime Minister) of the Republic of Ireland, made a televised speech about the events in Derry, saying \"the Irish Government can no longer stand by and see innocent people injured and perhaps worse\". He said he had \"asked the British Government to see to it that police attacks on the people of Derry should cease immediately\", and called for a United Nations peacekeeping force to be sent to Derry. Lynch also announced that the Irish Army was being sent to the border to set up field hospitals for those civilians injured in the fighting. Some Bogsiders believed that Irish troops were about to be sent over the border to defend them.\nBy 14 August, the rioting in the Bogside had reached a critical point. Almost the entire Bogside community had been mobilised by this point, many galvanised by false rumours that St Eugene's Cathedral had been attacked by loyalists. The police were also beginning to use firearms. Two rioters were shot and wounded in Great James Street. The Ulster Special Constabulary (or B-Specials) were called up and sent to Derry. This was a quasi-military reserve police force, made up almost wholly of Protestants with no training in crowd control. Residents feared the B-Specials would be sent into the Bogside and would massacre Catholics. After two days of almost continuous rioting, during which police were drafted in from all over Northern Ireland, the police were exhausted and were snatching sleep in doorways whenever the opportunity allowed.\nOn the afternoon of the 14th, the Prime Minister of Northern Ireland, James Chichester-Clark, took the unprecedented step of requesting the British Prime Minister, Harold Wilson, to deploy British troops to Derry. At about 5pm a company of the 1st Battalion, Prince of Wales's Own Regiment of Yorkshire (who had been on standby at HMS Sea Eagle) arrived and took over from the police. They agreed not to breach the barricades or enter the Bogside. This marked the first direct military intervention by the British government in Ireland since partition. The British troops were at first welcomed by the Bogside residents as a neutral force compared to the RUC and the B-Specials. Only a handful of radicals in the Bogside, notably Devlin, opposed their deployment. However, this good relationship did not last long as the Troubles escalated.\nOver 1,000 people were injured in the rioting in Derry, but no one was killed. A total of 691 policemen were deployed in Derry during the riot, of whom only 255 were still in action at 12:30 on the 15th. Manpower then fluctuated for the rest of the afternoon: the numbers recorded are 318, 304, 374, 333, 285 and finally 327 at 5.30&nbsp;pm. While some of the fluctuation in numbers can be put down to exhaustion rather than injury, these figures indicate that the police suffered at least 350 serious injuries. How many Bogsiders were injured is unclear, as many injuries were never reported.\nRioting elsewhere\nOn 13 August, NICRA called for protests across Northern Ireland in support of the Bogside to draw police away from the fighting there. That night it issued a statement: A war of genocide is about to flare across the North. The CRA demands that all Irishmen recognise their common interdependence and calls upon the Government and people of the Twenty-six Counties to act now to prevent a great national disaster. We urgently request that the Government take immediate action to have a United Nations peace-keeping force sent to Derry.\nNationalists held protests at RUC stations in Belfast, Newry, Armagh, Dungannon, Coalisland and Dungiven. Some of these became violent. The worst violence was in Belfast, where nationalists clashed with both the police and with loyalists, who attacked Catholic districts. Scores of homes and businesses were burnt out, most of them owned by Catholics, and thousands of mostly Catholic families were driven from their homes. Some viewed this as an attempted pogrom against the Catholic minority. Seven people in Belfast were killed and hundreds wounded, five of them Catholic civilians shot by police. Another Catholic civilian was shot dead by B-Specials in Armagh. Both republican and loyalist paramilitaries were involved in the clashes.\nDocumentary\nThe documentary [https://www.cultureunplugged.com/documentary/watch-online/filmedia/play/3407/Battle-of-the-Bogside Battle of the Bogside], produced and directed by Vinny Cunningham and written by John Peto, won \"Best Documentary\" at the Irish Film and Television Awards in October 2004.\nSee also\n* Timeline of the Troubles\n* Exercise Armageddon\nReferences\nExternal links\n* [https://maps.google.com/maps?f=q&source=s_q&hl=en&geocode=&q=54%C2%B0+59%27+46.69%22+N+7%C2%B0+19%27+34.81%22+W&sll=37.0625,-95.677068&sspn=42.174768,88.857422&ie=UTF8&layer=c&cbll=54.995577,-7.327076&panoid=tqzGLQvNC5rqa8pji5bGjA&cbp=12,238.52,,0,-7.99&ll=54.99545,-7.326717&spn=0.001871,0.005423&z=18 Boy with Petrol Bomb and Gas Mask (mural)] Google street view\n* [http://cain.ulst.ac.uk/events/battlebogside/battleofbogside/bob69.htm Images from the booklet \"Battle of Bogside\"] published in (1969).\n* [http://www.irishtimes.com/newspaper/special/1999/statepapers/wilson.htm Wilson considered direct rule option as violence raged in North] The Irish Times. 3 January 2000\n* [http://cain.ulst.ac.uk/events/bsunday/chron.htm CAIN project chronology of events].\n* [https://www.youtube.com/watch?v=Gpg-pEpaSwU Battle of the Bogside Documentary (2004)]\n* [http://cain.ulst.ac.uk/events/crights/mccann93.htm Extracts from \"War and an Irish Town\" by Eamonn McCann]"
    }
  ]
}