{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Song-Jin\n\nZu DashouWu SanguiCao BianjiaoYang GuozhuWang TingchenBai Guang'enXia ChengdeZu Dale\n|strength1= 100,000+ (Hong Taiji) 20,000+ (Dorgon)\n|strength2= 60,000+ (Hong Chengchou in Songshan) 25,000+ (Zu Dashou in Jinzhou)\n|casualties1= Unknown\n|casualties2= Approx. 50,000-60,000\n}}\nThe Battle of Song-Jin () was fought in 1641 and 1642 at Songshan and Jinzhou, hence the name \"Song-Jin\". Hong Chengchou's 100,000 elite troops, sent to break the siege of Jinzhou, were crushed by the Eight banner armies of the Qing Dynasty at Songshan. Hong Chengchou and a small number of the remaining troops were besieged at Songshan and defeated a few months later. The Jinzhou garrison and the general Zu Dashou surrendered to the Qing army shortly after the defeat of Ming armies at Songshan.\nThe siege of Jinzhou\nSince the time of Yuan Chonghuan, the Ming dynasty had rarely changed its Liaodong defensive strategy. Ming leaders largely spent their energies building fortresses, relying on artillery and cannons as defensive measures rather than going on the offensive. For a time this defensive strategy frustrated the Qing army, but eventually Hong Taiji was able to develop a solution for the Qing by reforming their logistical operations, creating supply lines that allowed them to prosecute long-term siege warfare.\nZu Dashou was by then in charge of defense in Jinzhou. Zu had surrendered to Qing at the Battle of Dalinghe and offered to take Jinzhou. When he succeeded taking Jinzhou, he switched sides again and took control of Jinzhou. In the 6th year of Chongde (1641) Jirgalang ordered his troops to retake Jinzhou and lay siege to the city. Zu then sent a letter seeking reinforcements from Beijing. In the fourth lunar month, Hong Taiji decided to maintain the siege upon Jinzhou.\nHong Chengchou's reinforcements\nMarshal Hong Chengchou was ordered by the Chongzhen Emperor to rescue Zu Dashou and his army. Under his command, there were 8 area commander in chiefs (Zongbing) and more than 100,000 troops, which included Wu Sangui and Cao Bianjiao's troops.\nIn the tenth lunar month, Hong Chengchou left Shanhai Pass and summoned eight generals: Wu Sangui, Cao Bianjiao, Wang Tingchen, Bai Guang'en, Ma Ke, Yang Guozhu, Wang Pu, and Tang Tong. The Ming troops under their control, numbering up to 100,000 infantry heavily armed with matchlock muskets and 40,000 cavalry, were ordered to liberate Jinzhou. Meanwhile, Zu Dashou still maintained the defence of Jinzhou and used Songshan(松山), Xingshan(杏山), and Tashan(塔山) as defensive wings. On the Qing side, generals Kong Youde, Geng Zhongming and Shang Kexi were ordered to reinforce the troops laying siege to Jinzhou.\nHong Chengchou positioned his troops on Mt. Rufeng which stands between Songshan and Jinzhou. When the battle first started the Qing forces did badly. Hong Taiji therefore decided to remain on the defensive, conducting only small scale attacks on the Ming army's front line. When the enemy became exhausted, he would then release a full-scale attack to achieve victory. The impatient Chongzhen emperor ordered his marshal to be more aggressive, playing into Hong Taiji's plans.\nUpon seeing the enemy's advance, Hong Taiji ordered his troops to set an ambush along the enemy's retreat, while also seizing their logistic supply. His troops then slaughtered every single retreating enemy. Hong Chengchou decided to conduct a desperate attack. His subordinates disagreed with his plan; some argued that they should retreat to Ningyuan and resupply the troops. Wang Pu and some generals decided to retreat without orders upon hearing that Hong Taiji himself was leading the army, and were horribly slaughtered by Hong Taiji. Only 50,000 survived the battle.\nIn Hong Chengchou's camp, there were only 10,000 soldiers left, and they were forced to retreat into Songshan. Cao Bianjiao and Wang Tingchen managed to escape the encirclement and united with Hong Chengchou. The siege of Songshan thus began.\nThe siege of Songshan\nSongshan then suffered the same fate with Jinzhou, with no food supply nor reinforcement. Hong Chengchou tried to break the encirclement many times, yet always failed. Cao Bianjiao attempted to directly attack Hong Taiji's military camp and assassinate him but his plan failed, Hong Taiji personally tried to defend himself using his sword, and Cao was eventually forced to retreat after sustaining several wounds over his body due to being injured by Hong Taiji's guard officers. Hong Chengchou's other desperate subordinate, Xia Chengde, secretly communicated to Qing and promised to open the city gate. During this process, he would take his son, Xia Shu, as a hostage while negotiating his surrender.  On the 18th day of the second lunar month in the following year, Qing troops finally broke through and captured Hong Chengchou along with xunfu Qiu Minyang and some other generals. Qiu was then executed by Hong Taiji, along with Cao Bianjiao and Wang Tingchen, while Hong was taken alive to Shengjing.\nWith no hope left, Zu Dashou was forced to surrender on the 3rd day of the following month. The defense lines in Tashan and Xingshan were crushed in the 4th month, and the battle of Song-Jin ended.\nAftermath\nHong Taiji regarded Hong Chengchou as an excellent and brilliant general, and tried to persuade him to submit to the Qing. Hong Chengchou refused, but Fan Wencheng managed to persuade him to do so. Hong Chengchou was then assigned into the Yellow Banner and appointed the military governor of Nanjing during the reign of Shunzhi. He later managed to persuade numerous Southern Ming generals to surrender to the Qing government, and paved the way for the conquest of Southern China.\nHong Chengchou's surrender was a huge blow to the Ming dynasty after the execution of Yuan Chonghuan. Many historians consider the Battle of Song-Jin to be the decisive, climactic battle of the transition between the Ming and the Qing. There were no other competent generals left to protect the Ming empire. With the surrender of Wu Sangui, there was no obstacle left for the Qing to conquer the rest of China.\nSee also\n*Wu Sangui\n*Hong Chengchou\nReferences"
    }
  ]
}