{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Lutter__disambig_1\n\nDenmark–Norway\n| combatant2        =  Holy Roman Empire Catholic League\n| commander1        =  Christian IV Philip of Hesse-Kassel  Fuchs von Bimbach\n| commander2        =   Count of Tilly  Graf Anholt\n| strength1         = 16,000 infantry, 5,000 cavalry, 20 guns\n| strength2         = 17,000 infantry, 7,000 cavalry, 22 guns\n| casualties1       = 3,000 dead or wounded, 2,500 prisoners  4,000 dead or wounded, 3,000 prisoners\n| casualties2       = 700 dead or wounded  2,000 dead or wounded\n}}\nThe Battle of Lutter (German: Lutter am Barenberge) took place on 27 August 1626 during the Thirty Years' War, south of Salzgitter, in Lower Saxony. A combined Danish-German force led by Christian IV of Denmark was defeated by Johann Tserclaes, Count of Tilly, commanding an army of the Catholic League loyal to Emperor Ferdinand II.\nChristian's campaign plan for 1626 consisted of three parts; while he led the main army against Tilly, Ernst von Mansfeld would attack Wallenstein, supported by Christian of Brunswick. In the event, Mansfeld was defeated at the Battle of Dessau Bridge in April, while Christian of Brunswick's attack failed completely and he died of disease in June.\nOutmanoeuvred and hampered by torrential rain, Christian turned back to his base at Wolfenbüttel but decided to stand and fight at Lutter on 27 August. An unauthorised attack by his right wing led to a general advance which was repulsed with heavy loss and by late afternoon, Christian's troops were in full retreat. A series of charges by the Danish cavalry enabled him to escape but at the cost of at least 30% of his army, all the artillery and most of the baggage train. Many of his German allies abandoned him and although the war continued until the Treaty of Lübeck in June 1629, defeat at Lutter effectively ended Christian's hopes of expanding his German possessions.\nBackground\nAs ruler of the Duchy of Holstein, part of the Holy Roman Empire, Christian IV of Denmark was also a member of the Lower Saxon Circle or kreis. Although its members were overwhelmingly Protestant, both they and the Upper Saxon Circle remained neutral during the early stages of the Thirty Years' War, which began with the 1618 Bohemian Revolt. By 1625, they increasingly feared Emperor Ferdinand intended to reclaim former Catholic properties in North-West Germany now held by Protestants. This seemed confirmed when Halberstadt was occupied in early 1625 by forces of the Catholic League led by Tilly, while an Imperial army under Albrecht von Wallenstein attacked Magdeburg.\nIn May 1625, Christian was appointed commander of the Upper and Lower Circle forces; these numbered less than 7,000 ill-trained militia, most of whom were only fit for garrison duty, and recruiting professional troops required subsidies from England and the Dutch Republic. These were agreed in the December 1625 Treaty of The Hague but it was not until June 1626 that Christian was ready to move. His campaign plan consisted of three parts; while he led the main army down the Weser, Ernst von Mansfeld would attack Wallenstein, supported by forces under Christian of Brunswick. In the event, Mansfeld was defeated at Dessau Bridge in April, while Christian of Brunswick's attack failed completely and he died of disease in June. However, Wallenstein was then diverted to deal with the Peasants' War in Upper Austria, leaving Christian confident he outnumbered Tilly.\nBattle\nThe Danish-German army left Wolfenbüttel in late July 1626 seeking to bring Tilly to battle, unaware he had received over 4,000 reinforcements from Wallenstein and was thus far stronger than had been assumed. Torrential rain turned the roads into mud and caused supply shortages, while Tilly captured Protestant-held fortresses at Münden, Northeim and Göttingen. Since relieving these garrisons had been a primary objective for Christian, he decided to cut his losses and withdraw, but the poor roads impeded the movement of the baggage train and guns and slowed his retreat. For three successive days, the rearguard fought off attacks by Tilly's cavalry until on 27 August Christian decided to make a stand at Lutter am Barenberge, twenty miles from Wolfenbüttel.\nThe army was formed into three separate lines, Christian leading the centre, 20 year old Philipp von Hesse-Kassel the right, and the highly experienced Fuchs von Bimbach on the left. His position appeared extremely strong; although the Neile and Hummecke rivers immediately in front had largely dried out, woods on either side protected both flanks, while their artillery covered the only bridge. However, the troops were tired and hungry, as well as being slightly outnumbered following the withdrawal four days previously of Frederick Ulrich, Duke of Brunswick-Lüneburg, and his detachment of 2,000. In addition, Christian failed to clarify the command structure, a problem exacerbated when he left his position to deal with the baggage train, which had become stuck in the woods behind.\nAround midday, Tilly's artillery opened fire in order to distract his opponents while Count Anholt crossed the river and secured the bridge. By 14:00, they had established a bridgehead on the opposite bank and moved against the Danish left; Fuchs ordered a counter-attack which pushed Anholt back to the bridge before being checked. Assuming this was the signal for a general advance, Hesse led his cavalry across the river to attack Tilly's centre without waiting for orders. After conferring with Christian, who had by now returned to the front, Fuchs led his troops against Tilly's left, while the king assaulted the units holding the ground in front of the bridge.\nFuchs' infantry lost formation crossing the river, while Tilly ordered his artillery to hold their fire until they were only 100 metres away; the impact of this devastating volley shattered the attack and the Danes fell back to their original positions in total confusion. By 15:30, Tilly had regained the initiative; Fuchs tried to retrieve the position by leading another cavalry attack but was shot dead, while Hesse was also killed.}}       Shortly after 17:00, Tilly ordered his centre across the river, while at the same time troops from his left wing skirted the woods and attacked the rear. Under pressure from two directions and with many of their officers killed or wounded, the front echelon collapsed and only a series of desperate cavalry charges enabled the second and third ranks to escape.\nAfter having four horses shot from under him, Christian fled to Wolfenbüttel with what remained of his own cavalry, leaving 3,000 dead or wounded. Another 2,500 took refuge in the nearby Burg Lutter and surrendered next day; Tilly's losses totalled around 700 dead or wounded.}} He also captured the entire Danish artillery train and much of their baggage, including two wagons loaded with gold.\nAftermath\nUnable to hold Wolfenbüttel, Christian established winter quarters further north at Stade, but he was abandoned by the majority of his German allies, who had little interest in replacing Imperial domination for Danish. Although Tilly over-ran most of Bremen-Verden and laid siege to Bremen itself, the retreating Danes stripped the countryside of supplies and his troops were unable to deliver a decisive blow; many resorted to highway robbery to support themselves and quickly made themselves as unpopular as the Danes.\nDefeat at Lutter left Mansfeld stranded in the Tatra Mountains, his army mutinous, unpaid and starving, while his ally Gabriel Bethlen opened peace negotiations with Ferdinand. Mansfeld died in November 1626 and although Christian received enough English and Dutch subsidies to continue fighting, by October 1627 the Danes had been expelled from the Empire.\nNotes\nReferences\nSources\n*\n*\n*\n*\n*  (with several contributors)\n*\n*\n*\n*"
    }
  ]
}