{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Duimunisila\n\n** Kachari Kingdom\n| combatant2        =  Bengal Sultanate\n| commander1        =  Suhungmung Suklen Senglung\n| commander2        =  Turbak Taju Sangul\n| strength1         = Large700 ships\n| strength2         = 1,000 cavalryUnknown infantry36 elephantsmany guns and canons\n| casualties1       =\nUnknown\n| casualties2       = 2500 men28 ships\n| image             = Ahom warriors.JPG\n| image_size        =\n| caption           = Statue of Ahom warriors near Sivasagar town, Assam.\n}}\nThe Battle of Duimunsilla took place at Duimunisila, Assam in 1533, was an engagement which was the part of Turbak's invasion of Assam. The battle was fought between the forces of Bengal Sultanate led by Turbak, and Suhungmung of Ahom Kingdom. Despite the initial setbacks, the Ahom forces emerged victorious in this naval battle, inflicting many casualties on the Bengal Sultanate.\nBackground\nIn Turbak's invasion of Assam, after the initial setbacks in the at Singri, the Ahoms retreated to Sala, where they regrouped with reinforcements and appointed Senglung as the new commander-in-chief. Meanwhile, the Muslim forces advanced and set up camp at Kaliabar. Recognizing that the previous defeat was largely due to their weak naval capabilities, King Suhungmung ordered the preparation of a stronger navy. By June, the Ahoms had assembled 700 ships, and the Kachari army joined forces with them to strengthen their position.\nBattle\nIn October, the Muslims advanced to Ghiladhari, and by November, Suklenmung had recovered from his injuries and took command of the Ahom forces at Sala. The Muslim forces launched an attack, setting fire to houses outside the fort, but were caught off guard and routed in a surprise counterattack by the Ahoms. However, in subsequent confrontations, the Muslims deployed cavalry and artillery, creating confusion among the Ahom ranks. The elephants leading the Ahom forces failed to hold the enemy, leading to significant losses and the retreat of the Ahom army.\nmaintaining their cautious advance in the following months, the tide of the conflict shifted in March 1533, When they were attacked again, but this time they successfully defended the fort by pouring boiling water over the enemy. Despite this, the Muslims managed to gain some ground in subsequent encounters. By March 1533, however, the Ahoms turned the tide in their favor. In a naval battle at Duimunisila, they inflicted significant losses on the Muslim forces, The Muslim commanders, Taju and Sangal, were killed, The invading forces lost 2,500 men, 20 ships, and several large cannons, marking a turning point in the war in favor of the Ahoms.\nLegacy\nThe triumph at Duimunisila was a game-changer for the Ahoms. They reportedly started using firearms taken from the defeated Muhammadan forces, shifting away from bows and spears. Stories suggest that Muslim prisoners helped the Ahoms learn to forge cannons and make gunpowder. By the time Mir Jumla invaded Assam a century later, the Ahoms were skilled in making and using these weapons. Even the French traveler Tavernier wrote about their expertise.\nSee also\n* Turbak's invasion of Assam\nReferences\nCitations\nSources\n*\n*\n*\n*\n*"
    }
  ]
}