{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Lake Huleh (1771)\n\nOttoman Empire\n*Damascus Eyalet\n*Sidon Eyalet\n| combatant2        = Zaydani clan of Galilee\nEmirate of Jabal Amil\n| commander1        = Uthman Pasha al-Kurji\n| commander2        = Zahir al-Umar  Nasif al-Nassar Ali al-Zahir  Salibi al-Zahir\n| strength1         = 10,000–40,000 troops\n| strength2         = 3,000 cavalry\n| casualties1       = 9,700–9,500 killed\n| casualties2       = Unknown\n}}\nIn the Battle of Lake Huleh on 2 September 1771, the rebel forces of Zahir al-Umar and Nasif al-Nassar routed the army of Uthman Pasha al-Kurji, the Ottoman governor of Damascus, at Lake Huleh in the eastern Galilee. Most of Uthman Pasha's 10,000-40,000 strong army drowned in the Jordan River as they attempted to flee Zahir's forces commanded by his son Ali al-Zahir. According to historian William Harris, the battle has been \"mythologized in local historiography and poetry\". Nonetheless, no official account of the battle by the Ottomans was recorded.\nBackground\nStarting in the 1740s, the Ottoman-appointed Arab tax-farmer for most of Galilee, Zahir al-Umar, became virtually autonomous and in late 1768 he entered into an alliance with his erstwhile enemy, Sheikh Nasif al-Nassar, the virtual leader of the Shia Muslim clans of Jabal Amil (modern-day South Lebanon). By then Zahir was the de facto ruler over the Sidon Eyalet with the exception of Sidon itself.\nIn 1771 Zahir and Nasif joined forces with Ali Bey al-Kabir of Egypt who dispatched his lieutenants Ismail Bey and Abu al-Dhahab to conquer Ottoman Syria. The rebel alliance had the backing of the Russian Navy and captured both Sidon and Damascus in early June, driving out their governors, Darwish Pasha al-Kurji and Uthman Pasha al-Kurji, respectively, and the Druze army of Yusuf Shihab, Emir of Mount Lebanon. Shortly after, however, the Egyptian forces suddenly withdrew from Damascus on 18 June. This action surprised Zahir and Nasif who were left vulnerable to resurgent Ottoman forces in Sidon and they withdrew from that city on 20 June.\nUpon Uthman Pasha's return to Damascus on 26 June, he launched an expedition to reassert his authority over areas of Palestine that Zahir was left in control of in the aftermath of the Egyptian offensive. His forces relieved the Jarrar family from Zahir's siege of Sanur and recaptured Gaza and Ramla. Uthman Pasha was unable to recapture Jaffa. He returned to Damascus where plans were set in motion to subdue Zahir and Nasif. A plan was laid out whereby Uthman Pasha would launch an offensive against Zahir's forces in the eastern Galilee and would be supported by his sons Darwish Pasha of Sidon and Muhammad Pasha of Tripoli and more critically, Emir Yusuf Shihab.\nBattle\nUthman Pasha led his 10,000-strong army, commanded by himself and two viziers from Anatolia sent by the Sublime Porte, across the Jordan River from the east. Uthman Pasha's ostensible intent was not subduing Zahir, but leading the dawrah, which was the annual tour of miri (Hajj tax) collection from the villages of the region to fund the Hajj caravan. Zahir and some of his sons, having been notified of Uthman Pasha's large army and entry into Galilee, left their headquarters in Acre on 30 August and were soon joined by Nasif's large cavalry. The combined rebel force advanced toward Tiberias where Uthman Pasha had assembled his troops.\nAt dawn on 2 September, the rebels confronted Uthman Pasha's army in the vicinity of Lake Huleh. Emir Yusuf and his Druze forces had not yet arrived to back Uthman Pasha, leaving the latter's forces at a disadvantage. Ali al-Zahir launched an assault against Uthman Pasha's camp, while Zahir's other regiments, including Nasif's cavalry, blocked the area around the camp west of the Jordan River. As Uthman Pasha's army hastily retreated across the river, the overwhelming majority drowned. Uthman Pasha himself almost drowned, but was rescued by one of his soldiers. About 300-500 managed to survive and Uthman Pasha returned to Damascus with just three of his troops.\nAftermath\nFollowing their victory, Zahir and Nasif decisively defeated Emir Yusuf's troops at battle of Nabatieh on 20 October, and entered Sidon on 23 October after the withdrawal of Darwish Pasha and some 3,000 Druze forces commanded by Ali Jumblatt. On 22 October, Uthman Pasha, Darwish Pasha and Muhammad Pasha were all dismissed from their governorships. Uthman Pasha was succeeded by Muhammad Pasha al-Azm.\nReferences\nBibliography\n*\n*\n*"
    }
  ]
}