{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Virserum\n\n| combatant2        =  Rebels\n| commander1        =\n| commander2        =  Nils Dacke\n| strength1         = 5,000\n| strength2         = Unknown, but larger than the Swedish force\n| casualties1       = Heavy\n| casualties2       = 500 killed\n| campaignbox       =\n}}\nThe Battle of Virserum, also called the Battle of Lake Hjorten was the final engagement between the royal troops of Gustav Vasa and the insurgent leader Nils Dacke during the Dacke War. An estimated 20,000 people took part in the fighting.\nBackground\nReforms under Gustav Vasa\nAfter the Swedish War of Liberation against the Kalmar Union, Sweden had proclaimed itself as an independent state under Gustav Vasa. During the parliamentary meeting at Västerås in 1527, it was decided by Gustav Vasa that the state was to convert to Lutheranism, and in connection with this, he ordered the confiscation of the Church's silver. Gustav Vasa quickly came to like the advantages of the Protestant church, like how the King should be the head of a national church rather than the Pope, and that mass should be held in the national language, rather than in Latin.\nGustav's new reforms required high taxes, since he still needed to pay the Hanseatic League for their assistance in him gaining the throne. The population was put under high taxes, and trade restrictions were implemented. These reforms, made many peasants in Småland very doubtful and unsatisfied with Gustav Vasa's rule and the reformation, In Småland alone, 370kg of Silver was confiscated.\nBeginning of the Dacke War\nIn midsummer of 1542, Nils Dacke, a group of outlaws and former peasants, who rallied around him in the forest, attacked three royal advocates near Södra More, who had been sent to districts around Kalmar to collect taxes. During the next few weeks, more of Gustav's royal advocates and stewards were attacked and killed. A ceasefire agreement was later signed after the disastrous defeat at Kisa.\nBuildup\nAfter the ceasefire after the Battle of Kisa, Nils Dacke and his rebels were in control of Småland and Öland, with partial support from Västergötland and Östergötland. Around Christmas 1542, Nils Dacke was able to rely on the support of 90,000 peasants, the area he ruled over received the name \"Dackeland\". While Nils Dacke was creating his political program in Småland, Gustav Vasa was very active and was working against him. He used the truce to his advantage, and began mobilizing troops from Europe, continued creating propaganda against Dacke and isolated Dackeland both politically and economically.\nFurthermore, Gustav Vasa also attempted to mobilize troops from provinces like Dalarna, Gästriksland, and Finland.\nBattle\nWhen Gustav Vasa believed himself to be powerful enough to defeat Dacke, he broke the ceasefire agreement with Dacke in January and sent an army of 5,000 into Dackeland. The army was mostly composed of German mercenaries, but also included Danish support troops and Swedish national troops. When the Swedish army came to a wide isthmus by a large forest next to a lake, they were suddenly shot at by the rebels, which quickly evolved into a large firefight between hundreds of men, the smoke allowed the rebels to hide in the forest. In the confusion that followed, the Swedes started shooting each other.\nUnprepared for this, the Swedish commander, Lars Siggesson Sparre, ordered the cavalry into the forest in an attempt to force the rebels to come out. The rebels spotted the cavalry and were about to counterattack when Nils Dacke was suddenly wounded in both of his legs. The cavalry finally reached the rebels and brutal fighting broke out, the confusion caused the rebels to run out onto the ice where they were killed by musket shots and cannons.\nAftermath\nThe aftermath of the battle is hard on the rebels, they received a massive morale loss, with high losses. Their leader, Nils Dacke, was also wounded. It was no longer a possibility for a large army to be mobilized under his command.\nReferences\nNotes"
    }
  ]
}