{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Alegría de Pío\n\n| result            = Cuban military victory\n| combatant1        =  Cuban National Army\n| combatant2        =  26th of July Movement\n| commander1        = Unknown\n| commander2        = Fidel Castro\n| strength1         = Unknown\n| casualties1       = Unknown\n| strength2         = 82\n| casualties2       = 60–62\n}}\nThe Battle of Alegría de Pío was a battle in Cuba fought between the 26th of July Movement and the Cuban National Army. It was the first battle fought between the Cuban rebels and the Cuban military during the Cuban Revolution following the landing of 82 members of the movement, headed by Fidel Castro, on the southern coast of Cuba 3 days prior. In the aftermath of the battle, the rebels would be severely crippled, having suffered heavy casualties, and it would take many months for them to fully recover from the defeat.\nContext\nIn 1953, beginning their first attack against the Batista government, Fidel Castro gathered 160 fighters and planned a multi-pronged attack on two military installations. On July 26, 1953, the rebels attacked the Moncada Barracks in Santiago and the barracks in Bayamo, only to be defeated decisively by the far more numerous government soldiers. Numerous important revolutionaries, including the Castro brothers, were captured soon afterwards. Fidel was sentenced to 15 years in the prison Presidio Modelo, located on the Isla de la Juventud, while Raúl was sentenced to 13 years. However, in 1955, yielding to political considerations, the Batista government freed all political prisoners in Cuba, including the Moncada attackers, after which Fidel and Raul left for Mexico in exile.\nFrom Mexico, Fidel began to formulate a plan to return to Cuba to start a guerilla revolution on the island. After meeting the Argentine doctor Ernesto Guevara in Mexico City, Castro travelled to the United States, raising money from Cuban Americans and also from the toppled President of Cuba Carlos Prío Socarrás, who helped pay for the yacht Granma, which would be used to transfer the rebels to Cuba. After training members of the M-26 who had been sent to Mexico to assist in the coming landing, they set off from Tuxpan, Mexico in the night on November 25, 1956. To assist the landing, a rebellion organized by the 26th of July movement and planned by Haydée Santamaría, Celia Sánchez, and Frank País occurred in Santiago de Cuba. The rebellion happened on November 30 and was meant to take place in conjunction with the landing of the Granma, which was expected to land in Cuba five days after departing from Mexico. A reception party was assigned to wait for the rebels during the uprising at the lighthouse at Cabo Cruz, with trucks and 100 men. After this, the plan was that they would raid the towns of Niquero and Manzanillo together, after which they would escape into the Sierra Maestra to conduct guerilla warfare. However, due to choppy weather, the Granma had landed two days late on December 2, and as a result, the supporting uprising was left isolated and was quickly destroyed. As a result of this, the rebels had lost the element of surprise, and the military was put on high alert in the region.\nPrelude\nThe Granma had approached the Playa las Coloradas in the early morning of December 2, 1956. Trying to spot the Cabo Cruz lighthouse, the navigator fell overboard, after which he had to be rescued. With the night quickly departing, Fidel ordered for the ship to land at the nearest point of land. However, they had crashed into a sandbar, a mile short of the intended point of rendezvous, in a mangrove swamp. The reception party had departed from the lighthouse the night prior after waiting for two days. As the morning approached, they departed the boat and were forced to leave much of their food, ammunition and medicine behind, landing on shore in the mid-morning. During the landing, they had been spotted by the Cuban coast guard, after which news of the landing was relayed to the armed forces.\nAfter splitting into two groups upon reaching dry land, the rebels were forced to gradually abandon more equipment as they navigated the bush. During this period, Batista predicted correctly that the landing would occur, and his troops were ready. Consequentially, the landing party was harassed by planes firing sporadically into the forests, however they were unable to accurately pinpoint their location. After two days on December 4, the separate groups had found each other and trekked further inland in the direction of the Sierra Maestra with the help of a local peasant guide.\nAmbush at Alegría de Pío\nShortly after midnight on December 5, the rebel column had halted to rest for the night at a sugarcane field on a plantation the rebels would later find was owned by the sugar baron Julio Lobo, feasting on the sugarcane from the field to replenish their hunger caused by the lack of food, revealing their precense to enemy forces. The rebels, tired from the seasickness on the overcrowded Granma voyage and with blisters on their feet from marching, decided to rest for the night in an adjacent forest. As the rebels rested, their guide had abandoned them, telling nearby soldiers of the presence and location of the rebels. By this point, the rebels had abandoned nearly all of their medical supplies, rations, weapons and ammunition, making them extremely vulnerable. The rebels also did not properly post sentries around their makeshift camp as they rested, further increasing their vulnerability. In the morning, a Piper aircraft had scouted out their location, however the rebels did not take any notice to this. At 4:00 in the afternoon, they were ambushed by the Cuban military, after which chaos ensued for the rebels.\nAfter the shooting began, most of the rebels had fled in the direction of the sugar field as most of the firing was coming from the forest in which they slept. However, the cane field provided little cover, causing casualties to rapidly increase. Fidel tried to organize his men, however, in the chaos, the cohesion and order of his unit had been entirely destroyed, and he was only able to organize 8 of his men to follow him on his retreat. Meanwhile, the smaller contingent which was fighting in the forest, including Che Guevara, Camilo Cienfuegos, Juan Almeida and Ramiro Valdes, among others, fared slightly better. However, many, including Guevara, had been heavily wounded, and they too were scattered into different groups.\nAftermath\nIn the aftermath of the battle, many of the rebels in the battle broke off into groups of 3 to 4 in what turned from a retreat into a rout for the rebels. Many of these groups would end up being captured and executed in the following days. In addition, in both the Cuban and international media, it was widely reported that the rebels as a whole had been eliminated, with Fidel Castro having also been killed in the battle. It is disputed exactly how many of the rebels survived the attack, with some estimates going as low as a meager 12 survivors, however, most sources indicate around 20-22 had survived. However, in the following month, the guerillas trekked further east, and launched raids such as at La Plata and Arroyo del Infierno, which helped the guerillas gather supplies and regain lost morale.\nReferences"
    }
  ]
}