{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Sideling Hill\n\n| casus       =\n| territory   =\n| result      = Native American victory\n| combatant1  = Delaware Indians\n| combatant2  =\n| commander1  = Captain Jacobs?Shingas\n| commander2  = Alexander Culbertson\n| strength1   = 66 to about 100\n| strength2   = About 50 Pennsylvania militia\n| casualties1 = 3–17 killed, 21 wounded\n| casualties2 = 20 killed and 11–13 wounded\n| campaignbox =\n}}\nThe Battle of Sideling Hill (sometimes written Sidling Hill) was an engagement in April 1756, between Pennsylvania Colonial Militia and a band of Lenape warriors who had attacked Fort McCord and taken a number of colonial settlers captive. The warriors were taking their captives back to their base at Kittanning when they were ambushed by the militia, but with the help of reinforcements, the Lenape fought off the militia and escaped. The battle is significant because it was the first engagement involving Pennsylvania Militia after Braddock's defeat.\nBackground\nIn 1753 William McCord obtained a land grant from the Penn family, on the western frontier of what is now Franklin County. This land and the surrounding area had been a favorite hunting ground for the Lenape people for centuries, and they had built temporary shelters in the area for use on hunting trips. McCord reportedly told them they were no longer welcome, and that they should stop roaming the land near his home. The Lenape assured him they would not cause him or his neighbors any problems and ignored his warning. McCord proceeded to burn their lodgings. The Indians withdrew from the area, but the attack in 1756 may have been motivated by this conflict.\nFort McCord (often referred to in contemporary documents as \"McCord's Fort\") was built in early 1756 near the base of the Kittatinny Mountain, north of Parnell Knob in western Pennsylvania. The fort was the fortified home of William McCord, and probably consisted of a stockade surrounding the farm buildings and a two-story blockhouse with loopholes through which to fire at attackers.\nAttack on Fort McCord\nJean Lowry's account\nA first-hand account of the attack on the fort and of the subsequent battle was written by Jean Lowry, William McCord's younger sister. She reports that most of the men had left the stockade during the day to engage in farming, and only Lowry's husband stayed there as a guard. On 1 April 1756, a band of Delaware (Lenape) Indians under the command of either Captain Jacobs or Shingas, attacked the fort, killed Lowry's husband and set the blockhouse on fire, forcing the women and children inside to surrender. They captured 27 settlers (Lowry says there were 21 captives, indicating that some had been killed). The Lenape then forced the captives to travel through the mountains for three days before stopping to rest. At dawn on 4 or 5 April, a group of Pennsylvania Militia, including many of Lowry's \"friends and neighbors,\" attacked and were able to rescue the captives. According to Lowry, \"only one Indian was killed and another wounded, upon which they all fled.\" Within a few minutes, however, the Lenape returned, killed a number of the militia, and recaptured the survivors of the Fort McCord attack. One of the male prisoners, probably a soldier, was tortured to death. Lowry and the other prisoners were then taken on to Kittanning.\nBattle of Sideling Hill\nReport from the South Carolina Gazette\nOn 12 April 1756, the South Carolina Gazette published a letter describing the battle:\n:\"In our last we gave a short account of an engagement between some of our men and the Indians on our frontiers, since which we have the following account in a letter from Shippensburg, dated April 12. The morning after McCord's fort was taken, 31 of our people went in pursuit of the enemy, under the command of Capt. Culbertson, who was joined at Fort Littleton by Ensign Jemison, with 19 men, making in all 50 men. On Saturday evening they came in sight of the enemy's fire, and about break of day on Sunday morning they attacked the enemy at their fire, who immediately fled. Some of the captives then made their escape, and Mary McCord was shot by the fire of our men. Our people then came up and loosed the captives, and retired to the top of a hill, where the enemy returned and attacked them. Our men fought bravely for near 2 hours, but the enemy being reinforced by a fresh party, they surrounded our people and killed many, so that they found it necessary to break free and make their escape, in doing which we lost several men. The enemy then recovered some of their prisoners again, but 5 made their escape and got to Fort Littleton. By the best account we can get we killed 15 of the enemy, among which they are confident Capt. Jacobs is one. Capt. Culbertson was killed, with 18 others, and 13 wounded, one of which is since dead.\"\nEdward Shippen's account\nOn 24 April 1756, Edward Shippen III wrote to Governor Morris to report hearing an eyewitness account of the battle:\n:\"The following story...was told to me two days ago by Mr. Benjamin Blythe...who was also in the battle: He says that our men gave the first fire, but without any success, that then the Indians ran from their fireplace with their arms and ammunition, and in less than ten minutes our men found themselves Surrounded, which they did not discover before the Indians fired upon them, that notwithstanding our men were So exposed to the Enemy's fire, and dropping every now and then, they fought about two hours and a half by his watch, and then perceiving a reinforcement from Shingas's Party, they unanimously agreed to endeavor to break the enemy's Circle...in order to make their retreat, in which they luckily succeeded.  He says they killed but three of the Indians to the best of his knowledge, and that he doubts whether Captain Jacobs was one of them.\"\nReports from other sources\nOther sources report that, following the attack on Fort McCord, three companies of militia under the joint command of Captain Hance Hamilton (then commander at Fort Lyttleton), Captain William Chambers, and Captain Alexander Culbertson, had been sent in pursuit of the Lenape and their captives. Culbertson's company, reinforced by nineteen men from Fort Lyttleton, caught up with the Lenape three days after Fort McCord was attacked, and ambushed them at dawn, as described in Jean Lowry's account. In a two-hour engagement, both sides suffered heavy casualties, but the colonists were driven off by the arrival of reinforcements under the command of Shingas. Captain Culbertson was killed and most of his men were killed or wounded before they withdrew from the battlefield. Five captives, including two of William McCord's daughters, escaped and made their way to Fort Lyttleton. Another captive, Mary McCord, William McCord's sister-in-law, was accidentally shot and killed by the militia.\nAftermath\nIn a letter from Captain Hance Hamilton to Captain Potter, dated Fort Lyttleton, 4 April 1756, he says:\n:\"These come to inform you of the melancholy news of what occurred between the Indians, that have taken many captives from McCord's Fort and a party of men under the command of Captain Alexander Culbertson and nineteen of our men, the whole amounting to about fifty, with the captives, and a sore engagement, many of both parties killed and many wounded, the number unknown...Captain Culbertson and Doctor Jameson is thought to be killed.\"\nDoctor David Jameson, the surgeon at Fort Lyttleton, was seriously wounded and was left for dead on the battlefield, but he was able to return to the fort the next day. Hamilton gives a partial casualty list of eight soldiers killed and seven wounded. Chester Sipe reports that the Lenape suffered 17 killed and 21 wounded, \"according to the statement of one of their number who was captured.\" Sources state that 20 militia were killed and 12 or 13 wounded, although reports differ on this point.\nCaptain Jacobs was reported killed during the battle, however this was later proved untrue. He was killed during the Kittanning Expedition on 8 September 1756.\nWithin a week of the battle, Governor Robert Hunter Morris issued a formal Declaration of War against the Delawares and established a bounty for the scalps of Indians. On 15 April a law was passed regarding the organization and behavior of the Provincial Militia, including punishment for desertion or mutiny by soldiers.\nLocation\nThe precise location of the Battle of Sideling Hill, and hence the burial site of the militia lost in the battle, has not been determined. Three  possible locations have been proposed, based on contemporary documents:\n'Anderson's Grove:''' A 2003 report by the Susquehanna River Basin Commission proposed that the Battle of Sideling Hill took place near Maddensville (a neighborhood of Springfield Township, Huntingdon County, Pennsylvania), at the confluence of Little Aughwick Creek and Sideling Hill Creek at a place now known as Anderson's Grove.\nJuniata Crossing: A few days after the battle, Captain Joseph Shippen wrote to his father, Edward Shippen III, describing the location of the battle:\n:\"Capt. Culbertson & 30 men were defeated last Sunday (near the Bent of the Juniata where it runs across the New Penn's Road) by Jacob's Party of 36 after being joined by Shingas's Party of 30...We hear that 24 of our men are returned to McDowell's Mill and 8 to Fort Lyttleton, almost all of them very much wounded...Among those that are killed are Dr. Lieutenant Jamison & Captain Culbertson.\"\nNear Waterfall: The Indians may have been returning to Kittanning along the Raystown Path, an ancient Indian trail that runs from Clay Township through Bedford (formerly known as Ray's Town) to Logstown, northwest of Pittsburgh. The battle may have taken place in the gap in the mountains created by Sideling Hill Creek, between the present-day towns of New Grenada and Waterfall on Pennsylvania Route 913.\nMemorialization\nA stone monument with a Celtic cross, listing the names of the colonists killed and wounded as well as the civilian captives taken by the Indians, was erected in 1914 and can be found on Fort McCord Road in Chambersburg, Pennsylvania. A historical marker at the site of Fort McCord, erected in 1947, lists the names of 20 soldiers killed and 11 wounded at Sideling Hill.\nExternal links\n* [https://books.google.com/books?id=LvZb8kntVtkC&pg=PA104 The history and topography of Dauphin, Cumberland, Franklin, Bedford, Adams, and Perry counties (Pennsylvania)]\n* [https://www.youtube.com/watch?v=m1X9Qk3cwgw The Battles of Fort McCord and Sideling Hill] Brady Crytzer, YouTube Video, September 2023\n* \"Fort McCord and The Battle of Sideling Hill,\"  Pennsylvania Rambler, July 28, 2021\nSee also\n* French and Indian War\n* Fort Lyttleton\nNotes\nReferences"
    }
  ]
}