{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Bagdoura\n\n| place             = Sebou River, near Fez\n| result            = Berber victory\n| combatant1        = Umayyad Caliphate\n| combatant2        = Berber rebels\n| commander1        = Kulthum ibn IyadBalj ibn BishrTha'laba ibn SalamaHabib ibn Abi Ubayda\n| commander2        = Khalid ibn Hamid al-ZanatiSalim Abu Yusuf al-Azdi\n| strength1         = 30,000 Syrians40,000 Ifriqiyans\n| strength2         = 200,000 rebels\n| casualties1       = 18,000 Syrians20,000 Ifriqiyans\n| casualties2       = Unknown\n}}\nThe Battle of Bagdoura or Battle of Baqdura was a decisive confrontation in the Berber Revolt in late 741 CE. It was a follow-up to the Battle of the Nobles the previous year, and resulted in a major Berber victory over the Arabs by the Sebou River (near modern Fes). The battle would permanently break the hold of the Umayyad Caliphate over the far western Maghreb (Modern day Morocco), and the resulting retreat of elite Syrian forces into Spain would have implications for the stability of al-Andalus.\nBackground\nThe Berber revolt broke out in early 740 in western Morocco, in response to the oppressive, unfair (and, by Islamic law, illegal) tax collection and slave-tribute policies imposed on Muslim Berbers by Ubayd Allah ibn al-Habhab, governor in Kairouan, Ifriqiya and over all the Maghreb and al-Andalus. The Berber rebellion was inspired by Kharijite activists of the Sufrite sect, who held out the promise of a puritan Islamic order, without ethnic or tribal discrimination, a prospect appealing to the mistreated Berbers.\nThe revolt was begun under the leadership of the Matghara Berber chieftain (although alleged to be a humble water-carrier) Maysara al-Matghari. In a few months in 740, the Berbers successfully seized Tangiers and the whole of western Morocco, down to the Sous valley. But when the Ifriqiyan governor dispatched an Arab vanguard under Khalid ibn Abi Habiba against Tangiers, the Berbers deposed Maysara and placed the rebel army in the hands of a more experienced military commander, the Zenata chieftain Khalid ibn Hamid al-Zanati. Khalid ibn Hamid destroyed the Ifriqiyan army at the Battle of the Nobles in late 740.\nThe main Ifriqiyan army under Habib ibn Abi Obeida al-Fihri arrived too late to prevent the slaughter of the original army, and could do little more than hold the line around Tlemcen and appeal to Kairouan and Damascus for reinforcements.\nSyrian Expedition\nUpon hearing the news of the disaster that befell the Ifriqiyan nobles, the Umayyad Caliph Hisham is said to have famously exclaimed \"By God, I will most certainly rage against them with an Arab rage, and I will send against them an army whose beginning is where they are and whose end is where I am!\"\nHisham dismissed the Ifriqiyan governor Obeid Allah, and appointed Kulthum ibn Iyad al-Qasi as his replacement. Kulthum was to be accompanied by a fresh Arab army of 30,000 - 10,000 Umayyad clients and 20,000 tribal forces—raised from the regiments (junds) of the east. Specifically 6,000 men each were to be raised by four main Syrian junds of Jund Dimashq (Damascus), Jund Hims (Homs), Jund al-Urdunn (Jordan), and Jund Filastin (Palestine), 3,000 from Jund Qinnasrin, and an additional 3,000 were to be picked up from Egypt. Caliph Hisham designated Kulthum's nephew Balj ibn Bishr al-Qushayri as his lieutenant and successor should anything befall him. The Jordanian commander Thalaba ibn Salama al-Amili was designated second successor.\nThe 'Syrian' army (as it was called, despite its Egyptian contingent) set out in early 741 and arrived in Ifriqiya in July–August, 741. The vanguard Syrian cavalry under Balj ibn Bishr, which had moved ahead of the bulk of the forces, was the first to arrive in Kairouan. Their brief stay was not a happy one. The Syrians arrived in haughty spirits, playing up their role as rescuers of the hapless Ifriqiyans. They received a cool reception by the suspicious Ifriqiyan authorities in Kairouan - it is reported the city's gates were closed at Balj's approach, and that local officials were quite uncooperative in meeting the requests of the Syrian vanguard. Interpreting this as ingratitude, the frustrated Syrians imposed themselves on the city, requisitioning supplies and billeting troops, with little regard for local authorities or priorities.\nThe citizens of Kairouan immediately wrote to the Ifriqiyan military commander Habib ibn Abi Obeida (then with the remnant of the Ifriqiyan army, still in the outskirts of Tlemcen) complaining of the Syrian behavior, and he fired off a heated missive to Kulthum threatening to turn his arms against the Syrians if the abuses in Kairouan did not cease. Kulthum's diplomatic reply cooled things down a bit.\nMoving slower with the bulk of the forces, Kulthum ibn Iyad himself did not himself enter Kairouan, but merely dispatched a message assigning the government of the city to Abd al-Rahman ibn Oqba al-Ghaffari, the qadi of Ifriqiya. Then, collecting the Syrian vanguard, Kulthum hurried along to make up with the remaining Ifriqiyan forces of Habib ibn Abi Obeida holding ground in the vicinity of Tlemcen.\nThe rendezvous between the African and Syrian forces did not go smoothly. Ifriqiyans were still furious over the news of Syrian misbehavior in Kairouan, and the Syrians were still incensed by the ungrateful reception they had received. The heat was turned up when Balj ibn Bishr brought up Habib's threatening letter and requested that Kulthum immediately place the Ifriqiyan commander under arrest for treason. In his turn, Habib ibn Abi Obeida threatened to leave the field unless the insufferable Balj and the Syrian commanders apologized and treated the Ifriqiyans with more respect. The quarrel intensified and the armies nearly came to blows. By smooth diplomacy, Kulthum ibn Iyad managed to defuse the situation and hold the armies together, but the mutual resentments would play a role in what followed.\n(Ancient pre-Islamic tribal rivalries also played their part, as the Ifriqiyan Arabs were largely of south Arabian ('Kalbid' or 'Yemenite') tribal origin, while the Syrian junds were drawn from north Arabian ('Qaysid' or 'Syrian') tribes. Balj ibn Bishr, by all accounts something of a Qaysid chauvinist, played up the difference.)\nThe rendezvous made, Kulthum ibn Iyad led the simmering Arab army (30,000 Syrians and some 40,000 Ifriqiyans) westwards, and descended into the Sebou River valley of central Morocco, where the Berber rebel army had been assembled.\nThe Berber rebel army under the leadership of Khalid ibn Hamid al-Zanati (possibly jointly with a certain Salim Abu Yusuf al-Azdi ), some 200,000 strong, heavily outnumbered the Arabs. But the Berbers were poorly-equipped, some bearing nothing but stones and knives, with little or no armor, a number of them dressed in only a loin cloth. But they made up for this in knowledge of the terrain, familiarity with Arab arms, excellent morale (having just cut the cream of the Arab crop the previous year) and, not to be underestimated, a fanatical Sufrite-inspired religious fervor. The Berbers had their heads shaved in the Sufri Kharijite fashion and tied copies of Qur'anic scripture to the tips of their lances and spears.\nBattle\nThe Arab armies under Kulthum ibn Iyad met the Berber army of Khalid ibn Hamid al-Zanati at Bagdoura (or Baqdura), by the Sebou River in the vicinity of modern Fes.\nHaving fought with and against Berbers before, Habib ibn Abi Obeida and the other Ifriqiyan officers advised the governor Kulthum ibn Iyad against impetuousness. The army should not be tempted to open battle, but should instead entrench itself, and dispatch the cavalry out only to harry. Habib strongly urged Kulthum to fight only \"foot against foot, cavalry against cavalry\". But Balj ibn Bishr persuaded his uncle that the Berber rabble could be easily defeated, and they should set out against it at once.\nListening to his nephew, Kulthum ibn Iyad dismissed the Ifriqiyan advice, and the forces were arrayed. Balj was given command of the elite Syrian cavalry while Kulthum remained with the Syrian infantry. Habib ibn Abi Obeida and his Ifriqiyan troops were placed under Umayyad client officers.\nCertain his superb cavalry could easily handle the ragged Berber foot, Balj ibn Bishr was the first to set out. But the Berbers turned out to be excellent slingers and skirmishers. They ambushed and dehorsed a number of the Syrians (sometimes by the simple device of throwing a bag full of pebbles at the horses' heads). To prevent the Arab infantry from stepping up to give their dehorsed comrades support, the Berbers unleashed a stampede of wild mares (maddened by water bags and leather straps tied to their tails) straight across the Arab ranks, sowing much confusion. By these rudimentary means, the Arab forces were soon deprived of much of their cavalry, their principal advantage.\nRegathering the remnant of his cavalry, Balj furiously charged the Berber lines directly. But rather than hold ground, the Berber forces stepped aside to open up a corridor and let the Syrian cavalry through, then closed it again, separating the Arab cavalry away from the Arab foot.\nWhile the rearguard held a line to prevent the cavalry returning, the bulk of the Berber army, using its numbers to its advantage, fell upon the Arab infantry. The Ifriqiyan column was the first to be hit. Specially targeted, the chief Ifriqiyan commanders, including Habib ibn Abi Obeida, were quickly slain. Seeing their officers down and not particularly caring to remain with the Syrians, the Ifriqiyan ranks broke up and fell into retreat. Now alone, the Syrian infantry, Kulthum at their head, held ground for a while longer, but Berber numbers soon overwhelmed them.\nThe Arabs were routed. Of the original Arab troops, it is said a third were killed, a third captured and a third escaped. Another account estimates losses at 18,000 Syrians and some 20,000 Ifriqiyans. Among the dead were the governor Kulthum ibn Iyad al-Qasi and the Ifriqiyan commander Habib ibn Abi Obeida al-Fihri.\nAftermath\nThe remaining Ifriqiyan forces took flight in a scattered manner back towards Kairouan. The remaining Syrian troops (some 10,000), now under the leadership of Kulthum's nephew, the cavalry commander Balj ibn Bishr, scrambled up towards the coast, with the Berbers in pursuit. The Syrians barricaded themselves to Ceuta and requested passage across the water to Spain. The wary Andalusian ruler Abd al-Malik ibn Qatan al-Fihri refused at first, but eventually relented and allowed them to cross in early 742, an event that would have destabilizing repercussions in al-Andalus.\nKhalid ibn Hamid al-Zanati, who delivered the two great victories over the Arab armies, disappears from the chronicles soon after this battle. The Berbers' success encouraged wider rebellions throughout North Africa and Spain, and even greater Berber armies were assembled by two other commanders, Oqasha ibn Ayub al-Fezari and Abd al-Wahid ibn Yazid al-Hawwari, against Kairouan itself. But the rapid reaction of Egyptian governor Handhala ibn Safwan al-Kalbi prevented them from taking the city. The Berber armies in Ifriqiya were destroyed by Handhala in 742 in two massively bloody battles at El-Qarn and El-Asnam.\nNonetheless the Battle of Bagdoura proved decisive. It permanently broke the Arab hold on the Maghreb al-Aksa (Morocco). These regions devolved to local Berber rulers and would never be recovered by the eastern Caliphate. It was the first great territorial loss of the Islamic Caliphate, the first Muslim provinces to break away and chart an independent course.\nSee also\n*Berbers and Islam\n*Umayyad conquest of North Africa\nNotes\nReferences\nSources\n*Abd al-Wahid Dhannun Taha (1989) The Muslim conquest and settlement of North Africa and Spain, London, Routledge\n*\n*Dozy, R. (1861) ''Histoire de Musulmans d'Espagne. (transl. Spanish Islam: A history of the Muslims in Spain'', 1915)"
    }
  ]
}