{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Malatitze__disambig_1\n\n|result=See Aftermath\n|combatant1=25px Swedish Empire\n|combatant2=23px Tsardom of Russia\n|commander1=25px Charles XII25px Carl Gustaf Roos\n|commander2= Peter I Mikhail Golitsyn\n|strength1=6,000\n|strength2=13,000\n|casualties1= Swedish estimates:200–300 killed  500–750 woundedOther estimates:2,000 killed and wounded\n|casualties2= Russian estimates:375–600 killed  1,000–1,191 woundedOther estimates:2,700 killed and wounded\n|campaignbox=\n}}\nThe Battle of Molyatichi (), also known as the Battle of Dobroye, took place on August 31, 1708 at Molyatichi (present-day Belarus near the Russian border) during the Great Northern War. The Russian army of Peter the Great under the command of Mikhail Golitsyn launched a surprise attack on the isolated vanguard of Charles XII's Swedish Army, under the direct command of Carl Gustaf Roos, in order to destroy it. Their cavalry was unable to arrive in time to cut Roos' command off before Swedish reinforcements arrived, forcing the Russians to retreat.\nBattle\nThe Russian attack-force consisted of 9,000 infantry and 4,000 cavalry (including about 1,000 Cossacks and Kalmucks) under Mikhail Golitsyn and Gebhard von Pflug. The isolated command under Roos consisted of 4,000–5,000 men. The Russian objective was to cut off Roos' force and destroy it.\nThe fighting occurred in the swamp between the rivers Belaya Natopa and Chernaya Natopa. The Swedish force under Roos was surprised by the Russian attack in the morning fog and steadily withdrew towards the main Swedish army. The swampy landscape prevented the Russian cavalry to cut off the Swedish way of retreat. At least two Swedish regiments arrived as reinforcements during the course of the action, boosting their overall force to 6,000 men. The Russians were thus halted and put on the defensive. Since the attack of the main body of the Swedish army was not part of the Russian intentions at that moment, and to avoid a disastrous defeat, the Russians withdrew. Some Russian infantry got stuck in the swamps and were made easy targets to the pursuing Swedish forces.\nAftermath\nAfter initial success, having pushed the isolated Swedish force back, Roos received reinforcements which in turn forced the Russians to retreat, leaving the battlefield to the Swedes. According to some Russian sources, estimating the Swedish losses to 2,000 men, their objective had been fulfilled, since Golitsyn, \"having prevailed over Roos' smaller forces, knowingly avoided battle with larger ones.\" Peter I himself was delighted with the \"fire and decent action\" of Golitsyn's Russians. Other Russian sources, however, acknowledged only limited success, in large due to the slow march of their cavalry which had to traverse difficult marshlands. As a result, they had been unable to cut off and destroy Roos' isolated Swedish force, as was their objective.\nThe Swedes estimated their loss to 200–300 killed and 500–750 wounded, and the Russians their own to between 375 and 600 killed and between 1,000 and 1,191 wounded. Other sources mention 700 killed and 2,000 wounded Russians. The Swedes are said to have collected over 900 killed Russians on the battlefield.\nReferences"
    }
  ]
}