{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Gorni Dubnik__disambig_1\n\n1870s)\n| partof            = the Russo-Turkish War (1877–1878) and Siege of Plevna\n| date              = 24 October 1877\n| place             = Kaza of Plevne, Sanjak of Ruschuk, Danube Vilayet, Ottoman Empire(Gorni Dabnik, Pleven Province, Bulgaria)\n| result            = Russian victory\n| combatant1        =\n| combatant2        =\n| commander1        = Iosif GurkoMihail Aleksandroviç EbelingVasili LavrovYalmar Prokope\n| commander2        = Ahmed Hifzi Pasha\n| strength1         = 20 battalions\n18,000\nor up to 22,000\n56 guns\n| strength2         = 4,000–4,500\n4 guns\n| casualties1       = 829 killed,\n2,482 wounded\nor 3,500+\n| casualties2       = 1,500 killed & wounded2,289–2,300 prisoners|\n}}\nThe Battle of Gorni Dubnik took place during the Russo-Turkish War on 24 October 1877. In an effort to reduce the fortress of Pleven quicker, Russian forces began targeting garrisons along the Ottoman supply and communications route. A significant garrison had been reduced at the Battle of Lovcha in September. General Joseph Vladimirovich Gourko was called up from the Shipka Pass area to deal with more of the garrisons protecting Pleven.\nOn October 24 Gourko attacked the fortress of Gorni-Dubnik. The Russian attack met heavy resistance but two other Russian columns were able to easily push back the Ottoman lines. The Finnish Guard sharpshooter battalion participated on the battle and stormed the fortress walls. Gourko continued the attacks and the garrison commander Ahmed Hifzi Pasha surrendered. Within the month several more Ottoman garrisons were to fall including Orhanie. By October 24 the Russian army had surrounded Plevna which capitulated December 10.\nThe battle is commemorated in the Finnish Guard Regiment March. October 24 is the honorary day of the descendant of the Finnish Guards' Rifle Battalion, the Finnish Guard Jaeger Regiment.\nSee also\n* Battles of the Russo-Turkish War (1877–1878)\nReferences\nSources\n*\n* [http://www.russianwarrior.com/STMMain.htm?1877_militaryhist.htm&1 Sword of the Motherland Historical Foundation]\n* ''Compton's Home Library: Battles of the World'' CD-ROM\n*\nExternal links"
    }
  ]
}