{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Knocknaclashy__disambig_1\n\n}}\nThe battle of Knocknaclashy (also known as Knockbrack), took place in County Cork, Ireland in 1651. In it, an Irish Confederate force led by Viscount Muskerry was defeated by an English Parliamentarian force under Lord Broghill. It was the final pitched battle of the Irish Confederate Wars and one of the last of the Wars of the Three Kingdoms.\nCampaign\nMost of the province of Munster had fallen to Cromwell's forces in 1649-50. Oliver Cromwell had led an assault by the New Model Army from the south-east of Ireland, while Roger Boyle, Lord Broghill (later 1st Earl of Orrery) had inspired a mutiny among the English Royalist garrison in Cork, causing them to defect to the Parliamentarians. This had outflanked the defences of the Irish Royalist Alliance (Confederates and Royalists), causing them to retreat behind the river Shannon into Connacht and into western Munster. They still held the fortified cities of Limerick and Galway. Henry Ireton went on to besiege Limerick. The only organised Irish forces remaining in south Munster were those of Viscount Muskerry, who held out in the mountainous area of western Cork and County Kerry – which was his clan’s native territory.\nIn July 1651, Muskerry set out to try to relieve the besieged defenders of Limerick. He rallied his men by spreading a prophecy that the Irish would win a great battle over the English – such predictions were commonly believed in Irish culture at that time. Muskerry marched in the direction of Kanturk with 3,000 infantry and some cavalry, hoping to link up with bands of Irish guerrillas or \"tories\" on the road north. However, Ireton asked Broghill to intercept Muskerry. Broghill marched north from Blarney Castle near Cork and crossed the Blackwater at Banteer Bridge near Clonmeen. He received intelligence that some of Muskerry's horse had been at Dromagh Castle, west of Kanturk. Broghill’s Parliamentarian force intercepted the Irish at Knocknaclashy, between Dromagh and the Kanturk.\nBattle\nThe Parliamentarians were outnumbered but better trained and supplied than the Irish and had more cavalry, which was a big advantage in open country. The two sides exchanged a volley of musketry at close range and then closed hand to hand. The Irish cavalry were scattered in the first charge, leaving their infantry alone.\nHowever, the infantrymen, mostly armed with pikes, bravely charged their adversaries. Broghill’s men were outflanked on both sides by the Irish pikemen, but recovered the advantage by charging the flank of the Irish line. Broghill reported that his horsemen broke into the Irish pike squares at the \"angles\" (corners) by riding up, firing their pistols, reloading and repeating the process until there was a large enough gap in the formation for the English cavalry to break in with their swords. In this way, Broghill’s men turned the flank of the Irish line and put them to flight. Hundreds of Irish soldiers were ridden down by the Parliamentary cavalry in the subsequent pursuit.\nBroghill ordered the killing of all prisoners except \"men of good quality\" (i.e. of high social rank) who could be ransomed. He also related that his men found Catholic \"charms\" sown into the clothing of the Irish dead, which promised that the wearer would be invulnerable to weapons. The Parliamentarians recorded losses of only 26 dead and 130 wounded, although it is likely that many of the wounded would have also later perished from their injuries. The surviving Irish, including Muskerry, retreated in disorder to Ross Castle, where they surrendered in 1652.\nCitations\nReferences\n* – 1642 to 1660\n* – Canonteign to Cutts (for Clancarty)\n*\nGeneral references\n*\n*"
    }
  ]
}