{
  "content": [
    {
      "type": "text",
      "text": "# Battle of the borders (Algerian War)__disambig_1\n\n| image             = File:Ligne_Morice.jpg\n| strength1         = 5,000 menHeavy weaponrySeveral dozen aircraft\n| units1            =\n* 10e D.P\n* L. É. paratroops\n* 25e D.P\n* 8e RPIMa\n* 3e RPIMa\nFrench Air Force DragoonsArmored units\n| casualties2       = 2,400 dead300 POW3,300 captured weapons\n| casualties1       = 279 dead758 wounded\n| commander2        =  Saïd Mohammedi Ali Kafi Krim Belkacem Abdelhafid Boussouf Houari Boumediene\n| commander1        =  Raoul Salan Pierre Jeanpierre Marcel Bigeard Robert Lacoste Paul Vanuxem\n| strength2         = 5,000–10,000 men\n| combatant2        =  FLNSupport:\n| date              = 21 January 1958 – 28 May 1958\n| combatant1        =\n| result            = French victory\n| partof            = the Algerian war\n| caption           = The Morice line\n| place             = French Algerian-Tunisian border\n| conflict          = Battle of the Borders (Algerian war)\n| notes             =\n| units2            =\n* Outside army\n* Wilaya I\n* Wilaya II\n* Wilaya IIÍ\n}}\nThe battle of the borders, was a group of military operations initiated mainly on the Algeria-Tunisia border during the Algerian war, from 21 January to 28 May 1958, by the paratrooper units of the French army against the attacks, and bombardments of the Morice line by the combatants of the Armée de libération nationale (ALN), the military branch of the FLN, stationed in Tunisia.\nBackground\nIn the month of January 1958, the Algerian insurrection had been active for three years. Outside of the country, the FLN was helped by Egypt (then United Arab Republic), Morocco, and especially by Tunisia, which ever since its independence in 1956, served as a base for FLN militants.\nHabib Bourguiba allowed the FLN to use Tunis as a de facto capital/headquarters, and the ALN to install itself on the border. The ALN used several Tunisian cities and villages near the border as bases to train their units (katibas), and smuggle weapons to the inside of the country. These bases included Ghardimaou, Sakiet Sidi Youssef, El Kef, Tajerouine, Thala, Thélepte, Gafsa and Kasserine. After being trained, these katibas crossed the border to reinforce the wilayas of Kabylia (Wilaya III), Algérois (Wilaya IV), Constantinois (Wilaya II), and the Aurès (Wilaya I), bringing with them arms and ammunition. The Oranais (Wilaya V) was in the hands of the ALN in Morocco, while the Sahara (Wilaya VI) was at the time struggling to survive thanks to the harsh desert condition and poor logistics, and was mostly carried by guerilla Si El Haouès. Thus the Constantinois, Kabylia and the Aurès were, in 1958, the most important theatres of the war. The amount of weapons passing through the border was large.\nConfronted with a situation which became more and more delicate as days passed, the French Army searched for more and more complicated solutions to the increasing numbers of weapons deliveries from Tunisia ever since the country became independent in 1956. In the Autumn of 1957, more than 2,000 weapons were smuggled through the Tunisian border per month. The French government tried their best to exercise as much pressure as they could on the Tunisians in vain. The only possible solution became military. The main goal of the French army became the interception and destruction of all weapons which traversed the Morice line, which spanned 460 kilometers, from the Mediterranean Sea to the Sahara.\nConception\nIn January 1958 general Salan gave the order to destroy any katibas coming from Tunisia, before or after crossing the line. He assigned to general Paul Vanuxem, the commander of the East Constantinois zone, and the general in charge of the line, all the reserves at his disposal, which were the 1st Foreign Parachute Regiment of lieutenant-colonel Jeanpierre, the 9th Parachute Chasseur Regiment of colonel Buchoud, the 14th RCP of lieutenant-colonel Ollion, the 8th Marine Infantry Parachute Regiment  of Fourcade and the 3rd RPC of colonel Bigeard later replaced by Colonel Trinquier.\nThese five regiments patrolled on the main points of infiltration, in addition to the normal protection system of the line. Four regiments in front of it, six mechanized regiments in charge of the \"Spike strips\" and six regiments of the sector dealt with the land around the line. Three helicopter detachments were made available at Guelma, Tébessa and Bir el-Ater. On demand, light support aircraft detachments would be sent, armed with North American T-6 Texans, or heavy ones with naval Corsairs could be supplied from the airbases of Bône and Tébessa.\nThe battle\nThe main theater of operations were defined as the main areas where ALN troops would penetrate from, such as Ghardimaou, either side of the mountains around Medjerda, from Souk Ahras and Guelma. The forces disposed by the National Liberation Army (ALN) around La Calle, Souk Ahras and the Ouenza iron mine, from its base in the East, were three battalions each composed of three katibas of 250 to 300 men. In the first battle of Souk Ahras, from 1 February to 8 February 1958, these units faced the 5 paratrooper regiments, without counting the units positioned near the spike strips assuring the security of the Morice Line, spread over 700&nbsp;km, and doing their role of notifying HQ about any ALN penetration.\nOn 16 February 1958, the new plan finally brought its fruits. The paratroopers, helped by the 18th dragoon regiment caught two katibas which tried to cross the line. This success led to 200 hostile combatants, killed or imprisoned, and the recovery of a large amount of important arms. Between 25 and 26 February, to 4 March, two other katibas were caught the same way.\nIn the centre of the French dispositif, between Montesquieu and Morsott, where previously less pressure was exercised, the very vigilant 14th RCP and the 16th regiment of dragoons prevented any crossing, in particular during an offensive in the region by the ALN near Aïn Beïda which put 250 FLN combatants out of action. In El Ma el-Abiod Algerian combatants bypassed the line through the South. In February 1957 600 combatants and 300 recruits managed to cross the border. On February 28, previously placed in reserve and now redeployed to the south, the 3rd RPC caught several fellaghas. With the help of the 8e RPC and the 14e RCP, around one hundred combatants were put out of action. These attempts, far from the training camps in the north were no longer pursued by the ALN after further successful interceptions by the 3rd RPC and 4th REI in Jebel Onk on April 2, 1958.\nOnly the northern regions still remaining, a large amount of ALN forces united. As it has been doing since January 21, it kept harassing French positions on the border (which caused the majority of French casualties), while the FLN additionally reinforced its positions with the 4th faïlek which had 900 to 1,000 men. For the ALN high command, it was imperative to act quickly as both moral, and logistics of the inner wilayas left much to be desired.\nFrom 28 April to 3 May, more than a thousand combatants embarked on a new offensive to try to get two katibas to go reach wilayas I and II and a communication unit intended for wilaya I. This Second Battle of Souk Ahras took place in the Jebel of EI-Mouadjène, and included heated melee between Algerians and the 9th RCP of colonel Bouchoud. Only a third of the initial ALN combatants made it past the border, uniting with Wilaya III in the heart of Kabylia.\nAmbush of Guelma\nOn 28 or 29 May, French commander Pierre Jeanpierre was pursuing ALN guerillas with his paratrooper division. Unknown to him this was a trap set up by the FLN. While pursuing them, his helicopter was shot down by a missile launched by hidden Algerian troops. The death of this esteemed French commander was one of the main successes of the ALN during the battle of the borders, in a military campaign which was otherwise a defeat.\nAftermath\nAfter the battle the number of weapons smuggled through the border became lower and lower. By 1959 only 200 weapons were smuggled through the border per month, and by 1960 this number dropped to only 60.\nIn the following months, a similar situation developed on the Moroccan border. Thanks to this, the interior elements of the ALN found themselves isolated from the outside, and trapped inside the mountains of Algeria. A situation which was perfect for plan Challe.\nReferences"
    }
  ]
}