{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Lochmaben Fair__disambig_2\n\n|map_type    =\n|map_relief  =\n|latitude    =\n|longitude   =\n|map_size    =\n|map_marksize =\n|map_caption =\n|map_label   =\n|territory   =\n|result      =Scottish Royalist victory\n|status      =\n|combatants_header =\n|combatant1  =Scottish Rebels leading an English force\n|combatant2  =Scottish Locals\n|commander1  =James, 9th Earl of DouglasAlexander Stewart, Duke of Albany\n|commander2  =Robert Crichton Cuthbert MurrayJohn Johnstone\n|strength1   =500 English Horsemen\n|strength2   =Unknown\n|casualties1 =Unknown\n|casualties2 =Unknown\n|notes       =\n|campaignbox =\n}}\nThe Battle of Lochmaben Fair was an engagement in Lochmaben, Scotland, on 22 July 1484 between Scottish loyalists to James III of Scotland and the rebels Alexander Stewart, Duke of Albany and James Douglas, 9th Earl of Douglas, leading cavalry from England. Both exiles from Scotland, Albany and Douglas invaded with permission but not support of Richard III of England, hoping to encourage rebellion against James. Instead, they were met with armed resistance. The loyalists took the day. Douglas was captured and Albany forced to retreat.\nBackground\nThe unpopular Scottish king James III had been imprisoned in Edinburgh Castle following his arrest by his own nobles at Lauder Bridge in July 1482. Alexander Stewart, Duke of Albany, his younger brother, soon took control of the government, but his power was short-lived. Through bribery and the support of such powerful individuals as George Gordon, 2nd Earl of Huntly, James III regained his throne, and Albany was forced to flee, first in January 1483 to Dunbar and then on 9 April to England. Douglas, a rebel against Albany's father James II of Scotland, had resided in England since his lands had been forfeit to the crown in 1455. There, in the employ of Edward IV of England, he had become a Knight of the Garter.\nInvasion\nThe recently crowned English king Richard III initially planned to invade Scotland, but with other matters of state taking precedence instead only gave his permission for Albany and Douglas to launch an invasion on their own. The pair did so, bringing 500 horsemen to Lochmaben on 22 July 1484 during the annual fair. Though Albany and Douglas had hoped to incite the Scots to rebel against James, instead the townspeople took to arms against them, soon receiving assistance from the gentry in the area. The rebel cavalry routed, Albany retreated to France, while Douglas was captured.\nReferences\nFurther reading\nPrimary\n* The Auchinleck Chronicle, ed. Thomas Thomson, 1829.\n* Calendar of Documents Relating to Scotland, 1357–1509, ed. J. Bain, 1888.\n* Hall, Edward, Chronicle of England, 1809.\n* Hardyng, John, Chronicles, 1812.\n* Higden, Raphael, Polychronicon, 1527.\n* The Paston Letters, 1422–1509, ed. J. Gardiner, 1872–75.\nSecondary\n* Borland, R., Border Raids and Reivers, 1910.\n* Dunlop, A. I. The Life and Times of James Kennedy, 1950.\n* Fraser, W., The Douglas Book, 1885.\n* Gairdner, J., Richard the Third, 1898.\n* Ramsay, J. H. Lancaster and York, 1892.\n* Ridpath, J., The Border History of England and Scotland, 1810."
    }
  ]
}