{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Charah\n\n* Simko fled to Khoy with a few soldiers\n* Simko’s Mom and Niece were captured and taken to Urmia\n*150 Kurdish villages looted and destroyed\n| combatant1        =  Assyrian volunteers\n| combatant2        =  Shekak tribe\n| commander1        =  Agha Petros Malik Khoshaba Dawid Mar Shimun Malik Yaqo\n| commander2        =  Simko Shikak\n| casualties1       = 71 killed\n| casualties2       = 500 killed\n*1,500+ killed in Kuhnashahir\n| strength1         = Unknown\n| strength2         = Unknown\n| date              = 12–17 March 1918\n| campaignbox       =\n}}\nThe Battle of Charah (12–17 March 1918) or Charah Expedition took place between the Assyrian Volunteers led by Agha Petros and Malik Khsoshaba against Shekak tribesmen led by Simko Shikak in revenge for the assassination of Mar Benyamin Shimun. Simko Shikak, who was responsible for the murder of the Assyrian patriarch Mar Shimun was staying in the fortress. The fortress had never been conquered despite numerous attempts by the Iranian government.\nBackground\nIn March 1918, Mar Shimun and many of his 150 bodyguards were assassinated by Simko Shikak (Ismail Agha Shikak), a Kurdish agha, in the town of Kuhnashahir in Salmas (Persia) under a truce flag. Following the death of Mar Shimun, Assyrian forces under the command of Agha Petros launched an assault on Simko’s city of Kuhnashahir, bombing it with heavy artillery, resulting in the deaths of approximately 1,500 Kurds. Caught off guard, Simko escaped the city and fled to Charah, where the Battle of Charah would later unfold.\nBattle\nThe soldiers of Urmia did not get to the fortress of Charah by 12 March, as the military leaders told them in the letter to Surma D'Bait Mar Shimun. But in that month groups of guards were organized from the Salamas forces on those high mountains looking for the Assyrian Soldiers of Urmia waiting for them to attack Charah.\nOn 15 March Surma D'Bait Mar Shimun, her brother Dawid Mar Shimun, Palkounik Kondriatoff, and officer Valodia commanded saying on 16 March the remaining parts of Kuhnashahir must be attacked before the soldiers of Urmia near Charah so that the back of Assyrians would be empty from the enemy.\nAt two o'clock during midnight Malik Oshana of Tkhuma and Malik Shamisdin of Lower Tyari who had at their possession two machine guns surrounded the town of Kuhnashahir. Rab Khaila Dawid and Shlemon Malik Ismael placed a cannon on the hill of Mar Yokhanan. Rab Tremma (Commander of 200) Lazar Kaku d'Bet Samano of Upper Tyari among the army where placed in Qalasar village, between Khusrabad and Diliman, to safeguard the front from the Iranian army, so they could not go up and aid the Kurds in Kuhnashahir. Rab Tremma (Commander of 200) Daniel Malik Ismael and Rab Tremma (Commander of 200) Israel Pityo of Tkhuma with their troops were left in Khusruabad, to be sent who ever would need saving the most.\nIn the morning the battle started around the section of town that was not damaged. The Assyrians started firing cannons and would later stop because Assyrian attacks pushed inside. Soon after the whole town surrendered, the people killed from the Assyrians was about 71 while the Kurds lost about 500. Soon after Dawid Mar Shimun was informed by guards guarding mountain tops that the Assyrian forces of Urmia had arrived, soon after the forces of Urmia began to battle fiercely.\nThe reason for the Urmia forces delay was due to running into Kurds at villages on the way to Kuhnashir, Agha Petros was the leader of all the battle Agha Petros and his advisers Malik Ismail II and Malik Khoshaba.\nOn 16 March the forces of Urmia began their attacks on the Charah fortress, the Kurds fought fiercely and the Assyrians had not expected that many rebels to be fortified in the castle. The next day very early in the morning the Assyrians fired cannons from the army on the north side of Charah. Daniel Malik Ismail would guard the road towards Khana Barrri while Awwo son of Shmoel Khan with the left side of the Urmia and were placed near Khana Bari thus surrounding the fortress. Soon after Assyrians began to fire cannons, machine guns, Maxim guns and rifles towards the fortress and the trenches of the enemy. Soon after Daniel Malik Ismail was ordered to relinquish his position on Khana Barri and was ordered by Dawid Mar Shimun not to send reinforcements to guard the road. Soon after Assyrian forces entered the trenches of the Kurds.\nAftermath\nWhen Simko saw the Assyrians tearing apart his forces, he began to panic, abandoning his men and fleeing thru the road of Khana Barri.\nIt is said that the river in Charah was completely red from the dead Shikak fighters.\nThe Charah fortress was sacked and looted, where Assyrians also discovered the hidden papers suggesting the murder of Mar Shimun. The Assyrians, still seeking revenge, later massacred 500 Kurdish refugees in the city of Urmia.\nSee also\n* Urmia Clashes\n* Battle of Suldouze\n* Persian Campaign\n* Sayfo\n* Assyrian Rebellion\n* Assyrian Levies\n* Simko Shikak Revolt (1918-1922)\n* Simko Shikak Revolt (1926)\nReferences"
    }
  ]
}