{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Roncevaux Pass (824)\n\n| result      = Rebellious Basque / Banu Qasi victory\n| combatant1  = Franks (Carolingians) Basques (Gascons)\n| combatant2  = Basques (Navarrese)  Basques (Aragonese)  Banu Qasi\n| commander1  = Count Aeblus, Duke Aznar Sánchez\n| commander2  = Unknown Speculated: Enneko Aritza  Musa II Al-Qasawi\n| strength1   = Unknown\n| strength2   = Unknown (guerrilla party)\n| casualties1 = Expedition crushed  Commanders captured\n| casualties2 = Unknown\n}}\nDuring the Battle of Roncevaux Pass of 824 a combined Basque-Banu Qasi army defeated a Franks military expedition. The battle took place 46 years after the first Battle of Roncevaux Pass (778), a confrontation which had similar features: a Basque force engaging from the mountains, a northbound expedition led by the Franks, and the same geographical location along the Roncevaux Pass.\nThe battle resulted in the defeat of the Franks military expedition and the capture of its commanders Aeblus and Aznar Sánchez. The clash was to have further reaching consequences than those of the 778 engagement: that being the establishment of the independent Kingdom of Pamplona.\nBackground\nAfter Louis the Pious' half-hearted expedition to Pamplona circa 814, Basque tribal chieftain Enneko Aritza, who held strong family ties with the Banu Qasi led by his half-brother Musa, prevailed in the fortress circa 816 (or earlier) after news of Charlemagne's death (814) spread and a Frankish vassal, Belasko of Pamplona&mdash; Velasco, cited as Balashk al-Yalashki in Muslim sources&mdash;was defeated in the Battle of Pancorbo. In 816, the revolt in Pamplona extended north across the Pyrenees, and in 816 Louis the Pious deposed Seguin (Sihimin) Duke of Vasconia and count of Bordeaux, who had been created duke of Vasconia in 812, for failing to suppress or sympathising with the rebellion, triggering a widespread revolt.\nThe Basque lords on both sides of the Pyrenees rebelled, but were soon subdued in Dax by Louis (817). Lupus Centullo was then appointed duke (818), but was immediately deposed after he rebelled. Meanwhile, in Aragon (Jaca) the pro-Frankish count Aznar Galindez was overthrown by Enneko's allied count Garcia Malo (Garcia, 'the young' in old Basque) in 820. All Vasconia remained at this point in a shaky state of rebellion and the Frankish tenure on the Hispanic Marches was shifting out of control.\nThe battle\nIn 824 an expedition was mustered by the Carolingian king in the Vasconia region which remaining under Frankish overlordship (north of the Pyrenees). The military force was headed by the Duke of Vasconia Aznar Sanchez, who led Basque troops hailing from current Gascony, and count Aeblus (\"Aeblus et Asinarius comites cum copiis Wasconum ad Pampilonam missi\"), commanding a Frankish army. The military force headed south with a view to quashing the Basque rebellion centred in Pamplona. The expedition arrived in the Basque stronghold, but encountered no resistance, and with the expedition having accomplished their goals, made their way back north with goods looted from the town.\nAccording to Umayyad chroniclers, a joint force of composed of Navarrese Basques, Aragonese Basques and Banu Qasi warriors, hidden in the forests, awaited the Franks' army on the sinuous narrow passes of the region of Cize. The attacking Basques engaged the two columns in their terrain. The Franks were routed, and the two commanders of the expedition were captured.\nAftermath\nmountain passes]]\nWhile the Frankish count Aeblus was sent prisoner to Córdoba, Aznar Sánchez was released thanks to his kinship with the captors (\"Asinarius vero misericordia eorum, qui eum ceperant, quasi qui consanguineus eorum esset\") a fact that evidenced the good relations entertained at that moment by the joint Banu Qasi - Arista tandem with the Cordovan Umayyad, maybe after the accession to the throne of Abd ar-Rahman II in 822.\nEnneko Aritza emerged victorious after the battle and became the undisputed ruler of Pamplona. The new independent Basque kingdom brought about the definite detachment of the territories south of the Pyrenées from the Duchy of Vasconia suzerain to the Franks, as well as the loss of control over the Hispanic Marches for them and the start of an on-off alliance between the kings of Pamplona and the muwallad Banu Qasi.\nReferences\n*\n*"
    }
  ]
}