{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Kumsong\n\n(UNC)\n*\n*\n| combatant2        =\n| commander1        =  Mark W. Clark Maxwell D. Taylor Isaac D. White Chung Il-kwon\n| commander2        = Deng HuaYang Yong\n| units1            =  8th Army\n*  IX Corps\n**  Capital Division\n**  3rd Infantry Division\n**  2nd Infantry Division\n*  II Corps\n** 3rd Infantry Division\n** 5th Infantry Division\n** 6th Infantry Division\n** 7th Infantry Division\n** 8th Infantry Division\n** 11th Infantry Division\n| units2            = 9th Army\n* 24th Corps\n20th Army\n* 54th Corps\n* 60th Corps\n* 67th Corps\n* 68th Corps\n| strength1         = 187,000 combat troopsnumerous combat aircraft\n| strength2         = 240,000 combat troops1,360 artillery pieces\n| casualties1       = U.S.: 305 killedSouth Korea: 2,689 killed7,548 wounded4,136 missingChinese estimation:  47,661 casualties (2,286 Americans)2,766 captured (70 Americans)\n| casualties2       = China: 9,187 killed12,391 woundedSouth Korean estimation: 66,000 casualties262 captured\n| campaignbox       =\n}}\nThe Battle of Kumsong, also known as the Jincheng Campaign''' (), was one of the last battles of the Korean War. During the ceasefire negotiations seeking to end the Korean War, the United Nations Command (UNC) and Chinese and North Korean forces were unable to agree on the issue of prisoner repatriation. South Korean President Syngman Rhee, who refused to sign the armistice, released 27,000 North Korean prisoners who refused repatriation. This action caused an outrage among the Chinese and North Korean commands and threatened to derail the ongoing negotiations. As a result, the Chinese decided to launch an offensive aimed at the Kumsong salient. This would be the last large-scale Chinese offensive of the war, scoring a victory over the UNC forces.\nBackground\nThe Chinese People's Volunteer Army (PVA) and the Korean People's Army (KPA) objective was the bulge in the U.S. Eighth Army lines that began roughly about  northeast of Kumhwa, extended northeast to the hills south of Kumsong, leveled off to the east for about , then dipped to the southeast for some  to the village of Mundung-ni, northwest of Heartbreak Ridge. Since the terrain was very rough, ranging from hills 400 to 600 meters high in the west to somewhat over 1,000 meters at the eastern end of the bulge, the Republic of Korea Army (ROK) troops defending the sector had great difficulty in maintaining lateral lines of communication. Five ROK divisions manned positions in the bulge, with the ROK Capital Division of the U.S. IX Corps on the left flank, the 6th, 8th and 5th Infantry Divisions of the ROK II Corps in the center, and the ROK 20th Infantry Division of the U.S. X Corps on the right. The ROK 3rd Infantry Division was II Corps reserve. Facing the ROK forces were three PVA armies. During the early days of June they had brought in the 68th Army and placed it between the 60th and 67th Armies. In addition, the Chinese had strengthened the 60th Army by attaching to it the 33rd Division. Thus, the PVA had available for the attack on the bulge four new divisions that had been training on a similar type of terrain in the rear.\nBattle\nInitial assault (11–18 June)\nFor the first ten days of June the PVA/KPA had been deceptively quiet on the central front. Then, on the evening of 10 June, the artillery fire became intense and the PVA followed up with coordinated attacks ranging from a battalion to a regiment in strength on the sector held by the ROK 5th Division. Using elements of both the PVA 68th and 60th Armies, the PVA began to build up the pressure. Smashing through the outposts, the PVA seized Hills 973 and 882,  northwest of Heartbreak Ridge and part of the main line of resistance. ROK II Corps quickly released the 22nd Regiment of the ROK 3rd Division to the operational control of the ROK 5th Division to redress the PVA inroads on 11 June. Elements of the ROK 35th Regiment counterattacked to recapture Hill 973, but were only partially successful. PVA units swiftly moved to the offensive again and forced the ROK troops to pull back 1,000 meters south of Hill 973. Two battalions of the 22nd Regiment attempted to regain Hill 882 that same day and were able to approach the crest and dig in. Using the 22nd, 27th and 35th Regiments to launch counterattacks on 12 June, the ROK 5th Division was unable to drive the Chinese off the hills. Heavy artillery, mortar, and small arms fire, coupled with the PVA's willingness to reinforce his units and counterattack the ROK assault forces, prevented the UNC troops from recouping their terrain losses.\nThe Chinese broadened the pressure upon the ROK II Corps on 12 June by attacking elements of the ROK 8th Division on the left flank of the ROK 5th Division. In the Capitol Hill sector,  northwest of Hill 973, which was defended by the 21st Regiment, the PVA used two companies initially, reinforced later with three more, and penetrated first the outposts and then the main line positions of the regiment. Two battalions of the ROK 10th Regiment moved up to counterattack early on the morning of 13 June, but were unable to restore the original line. Another PVA attack by an estimated two companies during the afternoon forced the abandonment of a company outpost and further withdrawal by the ROK forces. The next morning the Chinese continued the offensive, employing several companies to sustain pressure against the 21st Regiment. Although the ROK units fought off these drives, disaster struck on the evening of 14 June. First a reinforced battalion enveloped the 3rd Battalion of the 21st, causing it to break up into small groups fighting independently to regain UNC lines. Two PVA companies then hit the main line positions of the 1st Battalion and forced it to pull back. A third attack by a reinforced battalion succeeded in enveloping the 2nd Battalion. Assembling behind the lines, the remnants of the 21st managed to establish a new main line of resistance that was to prove short-lived. On the right flank of the ROK 5th Division, the ROK 20th Division of U.S. X Corps, guarding the sector known as Christmas Hill,  southeast of Hill 882, had also been subjected to attack. On 10 June two companies from the PVA 33rd Division captured a company outpost on the approaches to Hill 1220, part of the Christmas Hill area. The ROK 61st Regiment counterattacked, rewon, and then relost the outpost. Further action to regain the position was suspended as the gravity of the situation on the ROK 5th Division front increased. When the PVA showed that they intended to retain possession of Hills 973 and 882, which were located on the main ridge leading to Hill 1220 from the west, the X Corps commander, Lieutenant general Isaac D. White, moved up the ROK 7th Infantry Division, the Corps' reserve, and placed it on the left flank of the ROK 20th Division. While the ROK 7th Division was advancing north, the 61st Regiment made several efforts to relieve some of the pressure on the ROK 5th Division. The Chinese reacted quickly and managed to blunt each attack.\nOn 14 June the PVA 33rd Division renewed the offensive against the ROK 5th and 20th Divisions and forced the former to fall back south of the Pukhan River. This withdrawal exposed the flank of the ROK 7th Division, which had just reached its defensive lines. The Chinese this time failed to reorganize their attacking force quickly enough. X Corps artillery and Fifth Air Force close air support were concentrated on the PVA units facing the ROK 5th Division, while the ROK 7th readjusted its front-line positions to tie in with the new ones established by the ROK 5th. On the other flank of the 5th, the ROK 8th Division also had to retreat over  to tie in its main line of resistance with its sister division on 15 June. The two remaining regiments of the ROK 3rd Division were ordered on 15 June to assume responsibility for the sector east of the 8th Division along the south bank of the Pukhan River, where they served to strengthen the left flank of the ROK 5th Division. As the ROK 3rd Division took over its defensive positions, the ROK 22nd Regiment reverted to the control of its parent unit. At the same time the ROK 5th Division was attached to X Corps, which became responsible for the ground east of the Pukhan. X Corps immediately made efforts to speed supplies and equipment forward to the ROK 5th Division and to replace its personnel losses. Since lateral roads were scarce, twelve H-19 helicopters were allocated to help out and they lifted a quarter of a million pounds of material forward to the front. On 16 June the ROK 11th Division shifted over from the ROK I Corps area to become ROK II Corps reserve.\nThe action tapered off during the next few days. In the ROK 8th Division territory west of the Pukhan on 16 June the PVA overran an outpost of the ROK l0th Regiment on Finger Ridge,  east of Capitol Hill, but the Chinese units broke contact and withdrew that evening. The ROK 21st Regiment repelled several company-sized attacks during the day. Later, aided by the 19th Regiment of the ROK 6th Division, the 21st Regiment mounted a counterattack and the PVA pulled back. Two PVA companies penetrated the main line positions of the ROK 16th Regiment, 8th Division, southeast of Finger Ridge, but did not attempt to follow up the breakthrough. By the evening of 16 June, PVA operations on the 8th Division front had become sporadic. During the next two days, the PVA launched several minor assaults on the ROK 20th and 8th Divisions, effecting slight penetrations. By 18 June the situation began to stabilize and the Eighth Army had an opportunity to survey the damage of the nine-day offensive.\nThe PVA had driven the ROK forces back an average of 3&nbsp;km along a 13&nbsp;km front and in the process had taken over a series of hill positions east of the Pukhan River. As a result of the Chinese drive, three ROK divisions had been redeployed in reinforcing and counterattacking roles. During the action the ROK units had taken a total of over 7,300 casualties, while PVA losses were estimated at over 6,600. In close support of the UNC defense, Air Force, Navy and Marine aircraft had flown 810 sorties in the nine-day period and the strategic air program had been delayed.\nInterregnum (26 June – 12 July)\nThe UNC had spent the quiet period reorganizing the battered ROK 5th Division and by 26 June the division was judged ready for action once again and control was returned to ROK II Corps. In the meantime the ROK 7th Division had taken over the ROK 20th Division's positions on the right flank of the ROK 5th Division. During the night of 26 June the PVA 179th Division of the 60th Army dispatched one regiment against elements of the ROK 5th Division east of the Pukhan River and a second regiment against units of the ROK 7th Division on the main ridge leading to Hill 1220. Heavy artillery and mortar fire accompanied the attacks and the PVA pressed on vigorously despite a staunch defense by both ROK divisions. As the ROK 5th stubbornly gave ground and retreated to the next terrain line, the ROK 7th also had to pull back to protect its left flank. The PVA pressed on and managed to penetrate the ROK 7th's positions on Hill 938 just northwest of Hill 1220. For several days the ROK 7th counterattacked to regain Hill 938, but the PVA refused to yield possession. The PVA held the hill with a small force and permitted the ROK troops to move in, then directed heavy artillery and mortar fire on the area and counterattacked in mass. After several experiences along this line and study of the growing list of ROK casualties, White shifted to a policy of containment on 3 July. Terrain to the rear was readied for defense and helicopters rushed up materials and ammunition to prepare the new fortifications for further attacks. The Chinese made two attempts on 4 July to move in closer to Hill 1220, but the ROK 7th Division fought off both of these assaults.\nThe intensification of PVA operations and the reports from intelligence sources that the PVA intended to launch a major offensive in the ROK II Corps-U.S. X Corps sectors, with the Hwach'on Reservoir as the objective, led White to redeploy his forces in an effort to buttress the right flank of the ROK II Corps. Beginning on 1 July he sent the U.S. 45th Infantry Division westward to relieve the ROK 20th Division and one regiment of the ROK 7th Division. The latter became responsible for a smaller segment of the front and was placed under ROK II Corps. On 10 July the ROK 20th Division relieved the U.S. 40th Infantry Division in the Heartbreak Ridge area and the 40th Division displaced west to strengthen the right flank of the 45th Division. X Corps was also reinforced by the movement of the U.S. 5th Regimental Combat Team from IX Corps on 1 July. While X Corps was shifting its forces the action on the Corps' front subsided to a level that did not interfere with the redeployment. To bolster the rear areas and the security of the prisoner of war camps, in late June the UNC commander General Mark W. Clark ordered the 24th Infantry Division to prepare for a temporary move from Japan to Korea. The 34th Regimental Combat Team arrived in Korea on 3 July; the 19th Infantry Regiment followed on 11 July; and the 21st Infantry Regiment unloaded at Pusan on 12 July.\nIn the first days of July the PVA/KPA carried out few attacks in strength, but the Eighth Army had no illusions about the future. Reports of troop movements, heavy traffic and stockpiling behind PVA/KPA lines alerted all commanders that they were preparing to strike again in force. PVA counter-reconnaissance screens made it difficult to ascertain how much strength the Chinese were massing, but the concentrations were greatest on the central front around Kumsong. The first offensive, however, came in the Cheorwon rather than in the Kumsong sector. On 6 July elements of the PVA 73rd Division attacked through the defensive positions of the PVA 69th Division and struck two ROK 2nd Infantry Division outposts on Arrowhead. For over 30 hours the defenders had to repel the Chinese forces, often at close range. The PVA drew back on 8 July to regroup, but that night they returned in the wake of 6,500 rounds of artillery and mortar fire, and won possession of the north slope of one of the ridges. A ROK counterattack on 9 July failed to oust them and action became intermittent. Early on 11 July, two ROK companies, in a fight lasting almost three hours, forced the PVA to pull back. During the battles for Arrowhead the ROK commander rotated his assault troops; in the 11 July encounter he used four battalions to exert maximum pressure and to provide a continuous flow of fresh troops. The six-day struggle for Arrowhead caused over 500 casualties for the ROK 2nd Division while the estimated Chinese losses were slightly over 750.\nA Chinese tank No. 215 T-34 from 4th Tank Regiment, 2nd Tank Division, allegedly destroyed four UNC tanks and damaged another M46 Patton tank during its fight from 6 to 8 July 1953. It also destroyed 26 bunkers, nine artillery pieces and a truck. That tank is now preserved in the Military Museum of the Chinese People's Revolution.\nRenewed assault (13–20 July)\nBy evening of 13 July the PVA had moved elements of five armies into attack and support positions along the central sector that encompassed the Kumsong salient. Facing them from west to east lay the ROK 9th and Capital Divisions of U.S. IX Corps and the ROK 6th, 8th, 3rd and 5th Divisions of ROK II Corps. The increase in the tempo of artillery and mortar fire on 13 July corroborated earlier intelligence reports from prisoners, deserters, agents and reconnaissance that the PVA were about to launch a major drive aimed primarily at ROK units on the central front. After darkness descended, the PVA forces moved forward en masse. A reinforced regiment from the 72nd Division of the 24th Army struck the ROK 9th Division's right flank while the 203rd Division of the 68th Army smashed into the ROK Capital Division guarding the left shoulder of the Kumsong bulge. ROK outposts were overrun as wave after wave of Chinese joined the assault. By midnight, PVA units had penetrated the main line of resistance up to 1,000 meters in some places. In the Sniper Ridge sector, long a bone of contention, ROK forces had to pull back to avoid being cut off. Throughout the night the pressure continued, with huge expenditures of artillery and mortar fire from both sides. In the ROK 6th Division area adjacent to the Capital Division, four battalions from the PVA 204th Division hit a company-sized outpost of the ROK 19th Regiment. By the morning of 14 July, they had penetrated the main line positions of the regiment and surrounded one friendly battalion. Elements of the 204th Division moved through the ROK 6th Division sector and then swung to the west and joined in the attack upon the Capital Division. To the east the PVA on 13 July sent four companies to surround an outpost in the ROK 8th Division lines and a battalion against a company outpost in the ROK 3rd Division area on the right shoulder of the Kumsong salient. They also attacked the ROK 5th and 7th Divisions to keep them occupied while the main assault was in progress. By the morning of 14 July the pattern of the PVA attack had developed as they increased the pressure on the ROK 3rd Division. Battalion and two-battalion attacks accompanied by heavy artillery and mortar support broke through the ROK 3rd Division's outpost system and drove into the main line positions. The 22nd and 23rd Regiments received assault after assault, but with the aid of the 18th Regiment in blocking positions managed to hold on. Then four PVA companies filtered in through the adjacent ROK 5th Division sector and swung in behind the 23d Regiment. When the indication of a double envelopment became apparent, the ROK 3rd Division began to pull back.\nAs the PVA pierced the ROK lines along the central front and cut off units from their parent organizations, the situation became confused. Soldiers from the 6th, 8th and Capital Divisions found themselves defending strongpoints together. Lateral and front-to-rear lines of communications were soon out of commission and radio and foot messengers became the chief means of sending and receiving instructions and information. Sister regiments were often out of contact and unaware of what the other was doing. Reports trickling in from the front were often delayed and usually incomplete as the ROK commanders displayed their customary unwillingness to forward unfavorable news that would cause them to lose face. Despite the lack of details, it was apparent after the first day of the assault that the PVA's use of major elements of six divisions had made serious inroads in the ROK Capital and 3rd Divisions' sectors. Since these guarded the shoulders of the salient, the ROK 6th and 8th Divisions were in danger of having their flanks exposed to a double envelopment. Eighth Army commander General Maxwell D. Taylor therefore, on 14 July ordered the ROK Capital, 6th, 8th, 3rd and 5th Divisions to fall back south of the Kumsong River line at the base of the bulge. This would straighten out the defensive line and shorten the front to be covered. In the process of complying with Taylor's instructions however, the ROK commanders lost contact with and control of some of their units, with the result that many of them did not stop at the Kumsong line. Instead they continued to retreat farther south replacing the bulge with a sag in the Eighth Army lines. The intensity and determination of the Chinese offensive impressed Generals Clark and Taylor to the point that they decided to fly reinforcements from Japan to Korea to bolster the front. The U.S. 187th Airborne Regimental Combat Team (187th RCT) was rushed to Korea and on 14 July Taylor attached the unit to the U.S. 2nd Infantry Division. The latter took over the U.S. 3rd Infantry Division's positions, and the 187th RCT relieved elements of the ROK 9th Division, permitting the ROK forces to narrow their front and to strengthen the left flank of the retreating Capital Division. In the meantime, the U.S. 3rd Infantry Division shifted over into blocking positions behind the Capital Division to stem the PVA advance. As the Capital's units fell back, they passed through the 3rd Infantry Division and were reorganized and rehabilitated in the rear. On 15 July the 3rd Infantry Division took over responsibility for the Capital Division's sector and assumed operational control of the division. In the ROK II Corps' area, Taylor released the ROK 11th Division to the Corps' commander, Lieutenant general Chung Il Kwon, who dispatched the division forward to relieve the ROK 3rd Division. The ROK 6th Division was also withdrawn from the line and, along with the ROK 3rd Division, was reorganized and reconstituted. Thus, on 15 July, the Eighth Army had the ROK 9th, the U.S. 3rd with the remnants of the Capital Division, the ROK 11th, 8th, and 5th Divisions on the front lines from west to east to check the PVA offensive.\nOn 16 July ROK II Corps received orders to counterattack and restore the Kumsong River line. The PVA offensive had slowed by this time and the Chinese were organizing the defense of the terrain they had taken and replacing the heavy casualties they had suffered in breaking through the ROK positions. The ROK 11th, 8th and 5th Divisions, attacking abreast, launched the counteroffensive the same day. Against variable PVA opposition they edged forward toward the Kumsong River east of Kumhwa. Between 16 and 19 July the three divisions, with the 6th, 3rd and 7th ROK Divisions in blocking positions in reserve, attained the high ground south of the river. On 19 July the ROK 6th Division passed through the 5th Division and assumed responsibility for its sector. Efforts to cross the river and take defensive positions on the north bank of the Kumsong met with increasing PVA resistance and were abandoned after 20 July.\nAftermath\nFor the last week of the war the ROK II Corps held the Kumsong River line against minor PVA pressure. Despite the gains of the counteroffensive, the Chinese had removed the Kumsong salient and straightened out their lines on the central front. Their penetration had been approximately  and the weight of their assault had cut off and disorganized many of the ROK units facing them. It had taken nine ROK and U.S. divisions in blocking and counterattacking roles to halt the Chinese advance and to regain some of the lost terrain. The Chinese loudly proclaimed military victory for its side. On the other hand, the price that the PVA had paid to sustain a major drive was extremely high; the Eighth Army estimated that over 28,000 casualties had been inflicted upon the PVA during their breakthrough and its aftermath. While ROK II Corps was carrying out its counteroffensive, the PVA/KPA exerted pressure upon several scattered points along the Eighth Army line in an effort to take long-contested hills and outposts prior to the signing of an armistice. The reasons behind this pressure were difficult to fathom, since all of the threatened points fell in the demilitarized zone and would have to be abandoned by the UNC forces anyway. As it turned out, the PVA/KPA had to surrender possession of their new gains shortly thereafter. The operations along the front during the last week of the Korean War subsided again to small-scale probes and patrols, as each side now anticipated that the Korean Armistice Agreement soon would be signed.\nClark later commented: \"There is no doubt in my mind that one of the principal reasons, if not the one reason, for the Communist offensive was to give the ROK's a 'bloody nose,' to show them and the world that 'PUK CHIN'— Go North [Syngman Rhee's insistence on continuing the war], was easier said than done.\nIn the media\nThe 2020 film The Sacrifice is set during the Battle of Kumsong and tells the story of a bridge that the Chinese People's Volunteer Army must defend in order to reinforce the frontline while the United States Air Force and artillery attempt to halt the crossing.\nNotes\nReferences\n*\n*\n*\n*The Chinese People's Liberation Army since 1949 by Benjamin Lai\nFurther reading\n*\n*\n*"
    }
  ]
}