{
  "content": [
    {
      "type": "text",
      "text": "# Battle of the Dnieper\n\n)\n| place             = Dnieper River, Soviet Union\n| territory         = Soviets reclaim left-bank Ukraine, including the city of Kiev and Donets basin\n| result            = Soviet victory\n| combatant1        =\n| combatant2        =\n| commander1        =  Georgy Zhukov Aleksandr Vasilevsky Nikolai Vatutin Ivan Konev Rodion Malinovsky Fyodor Tolbukhin Konstantin Rokossovsky}}\n| commander2        =  Erich von Manstein Ewald von Kleist Günther von Kluge\n| units1            =  1st Ukrainian Front 2nd Ukrainian Front 3rd Ukrainian Front 4th Ukrainian Front 1st Belorussian Front\n| units2            =  Army Group South\n* 1st Panzer Army\n* 4th Panzer Army\n* 8th Army\n* 6th Army(until 17 September 1943)\nArmy Group A\n* 6th Army (re-subordinated from 17 September 1943)\nArmy Group Center\n* 2nd Army\n| strength1         = 26 August:2,633,000 men (1,450,000 reinforcements)51,200 guns and mortars2,400 tanks and assault guns2,850 combat aircraft\n| strength2         =\nOn 1 November 1943:Army Group South:- 722,376 personnel;6th Army of Army Group A:- 182,236 personnel;2nd Army of Army Group Center:- 200,111 personnel;Total- 1,104,723 personnel. Army Group South armoured strength as of 10 November 1943:- 713 operational tanks;- 271 operational assault guns;- '''984 operational AFV's in total.In repairs:- 894 tanks;- 302 assault guns. Luftflotte 4 strength on 10 October 1943:- 793 operational aircraft (all types)- 1,149 aircraft in total (incl. in repairs)\nOn 1 November 1943''':- 85,564 personnel.\n| casualties1       = Krivosheev: 1,285,977 men\n:348,815 killed or missing\n:937,162 wounded or sick\nFrieser:\n1,687,164 men\n:417,323 killed or missing\n:1,269,841 wounded or sick\nForczyk:- 290,000 killed or missing- 1,000,000+ in total\n| casualties2       =  GermanyForczyk:- 102,000 killed or missing- 372,000+ in total RomaniaUnknown\n| campaignbox       =\n}}\nThe Battle of the Dnieper, known on the German side as the Defensive battles on the Dnieper (German: Abwehrschlachten am Dnepr), was a military campaign that took place in 1943 on the Eastern Front of World War II. Being one of the largest operations of the war, it involved almost four million troops at one point and stretched over a  front.\nOver four months, the eastern bank of the Dnieper was recovered from German forces by five of the Red Army's fronts, which conducted several assault river crossings to establish several lodgements on the western bank. Kiev was later liberated in the Second Battle of Kiev. 2,438 Red Army soldiers were awarded the title Hero of the Soviet Union for their involvement.\nStrategic situation\nFollowing the Battle of Kursk, the Wehrmachts Heer and supporting Luftwaffe forces in the southern Soviet Union were on the defensive in southern Ukraine. By mid-August, Adolf Hitler understood that the forthcoming Soviet offensive could not be contained on the open steppe and ordered construction of a series of fortifications along the line of the Dnieper river.\nOn the Soviet side, Joseph Stalin was determined to launch a major offensive in Ukraine. The main thrust of the offensive was in a southwesterly direction; the northern flank being largely stabilized, the southern flank rested on the Sea of Azov.\nPlanning\nSoviet planning\nThe operation began on 26 August 1943. Divisions started to move on a 1,400-kilometer front that stretched between Smolensk and the Sea of Azov. Overall, the operation would be executed by 36 Combined Arms, four Tank and five Air Armies. 2,650,000 personnel were brought into the ranks for this massive operation. The operation would use 51,000 guns and mortars, 2,400 tanks and 2,850 planes.\nThe Dnieper is the third largest river in Europe, behind only the Volga and the Danube. In its lower part, its width can easily reach three kilometres, and being dammed in several places made it even larger. Moreover, its western shore—the one still to be retaken—was much higher and steeper than the eastern, complicating the offensive even further. In addition, the opposite shore was transformed into a vast complex of defenses and fortifications held by the Wehrmacht.\nFaced with such a situation, the Soviet commanders had two options. The first would be to give themselves time to regroup their forces, find a weak point or two to exploit (not necessarily in the lower part of the Dnieper), stage a breakthrough and encircle the German defenders far in the rear, rendering the defence line unsupplied and next to useless (very much like the German Panzers bypassed the Maginot line in 1940). This option was supported by Marshal Georgy Zhukov and Deputy Chief of Staff Aleksei Antonov, who considered the substantial losses after the Battle of Kursk. The second option would be to stage a massive assault without waiting, and force the Dnieper on a broad front. This option left no additional time for the German defenders, but would lead to much larger casualties than would a successful deep operation breakthrough. This second option was backed by Stalin due to the concern that the German \"scorched earth\" policy might devastate this region if the Red Army did not advance fast enough.\nStavka (the Soviet high command) chose the second option. Instead of deep penetration and encirclement, the Soviet intended to make full use of partisan activities to intervene and disrupt Germany's supply route so that the Germans could not effectively send reinforcements or take away Soviet industrial facilities in the region. Stavka also paid high attention to the possible scorched earth activities of German forces with a view to preventing them by a rapid advance.\nThe assault was staged on a 300-kilometer front almost simultaneously. All available means of transport were to be used to transport the attackers to the opposite shore, including small fishing boats and improvised rafts of barrels and trees (like the one in the photograph). The preparation of the crossing equipment was further complicated by the German scorched earth strategy with the total destruction of all boats and raft building material in the area. The crucial issue would obviously be heavy equipment. Without it, the bridgeheads would not stand for long.\nSoviet organisation\n* Central Front (known as the Belorussian Front after 20 October 1943), commanded by Konstantin Rokossovsky and accounted for 579,600 soldiers (took no part in the Dnieper battle after 3 October)\n** 2nd Tank Army, led by Aleksei Rodin / Semyon Bogdanov (since September)\n** 9th Tank Corps, led by Hryhoriy Rudchenko (KIA), Boris Bakharov\n** 60th Army, led by Ivan Chernyakhovsky\n** 13th Army, led by Nikolay Pukhov\n** 65th Army, led by Pavel Batov\n** 61st Army, led by Pavel Belov\n** 48th Army, led by Prokofy Romanenko\n** 70th Army, led by Ivan Galanin / Vladimir Sharapov (September – October) / Aleksei Grechkin (since October)\n** 16th Air Army, led by Sergei Rudenko\n* Voronezh Front (known as the 1st Ukrainian Front after 20 October 1943), commanded by Nikolai Vatutin and accounted for 665,500 soldiers\n** 3rd Guards Tank Army, led by Pavel Rybalko\n** 1st Tank Army, led by Mikhail Katukov\n** 4th Guards Tank Corps, led by Pavel Poluboyarov\n** 1st Guard Cavalry Corps, led by Viktor Baranov\n** 5th Guards Army, led by Aleksei Zhadov\n** 4th Guards Army, led by Grigory Kulik / Aleksei Zygin (KIA) / Ivan Galanin\n** 6th Guards Army, led by Ivan Chistyakov\n** 38th Army, led by Nikandr Chibisov / Kirill Moskalenko (since October)\n** 47th Army, led by Pavel Korzun / Filipp Zhmachenko (September – October) / Vitaliy Polenov (since October)\n** 27th Army, led by Sergei Trofimenko\n** 52nd Army, led by Konstantin Koroteev\n** 2nd Air Army, led by Stepan Krasovsky\n* Steppe Front (known as the 2nd Ukrainian Front after 20 October 1943), commanded by Ivan Konev\n* Southwestern Front (known as the 3rd Ukrainian Front after 20 October 1943), commanded by Rodion Malinovsky\n* Southern Front (known as the 4th Ukrainian Front after 20 October 1943), commanded by Fyodor Tolbukhin\nGerman planning\nThe order to construct the Dnieper defence complex, known as \"Ostwall\" or \"Eastern Wall\", was issued on 11 August 1943 and immediately began to be executed.\nFortifications were erected along the length of the Dnieper. However, there was no hope of completing such an extensive defensive line in the short time available. Therefore, the completion of the \"Eastern Wall\" was not uniform in its density and depth of fortifications. Instead, they were concentrated in areas where a Soviet assault-crossing were most likely to be attempted, such as near Kremenchuk, Zaporizhia and Nikopol.\nAdditionally, on 7 September 1943, the SS forces and the Wehrmacht received orders to implement a scorched earth policy, by stripping the areas they had to abandon of anything that could be used by the Soviet war effort.\nGerman organisation\n* Luftflotte 2 (selected units) – Wolfram Freiherr von Richthofen\n* (in Ukraine) Army Group South – Erich von Manstein\n** 4th Panzer Army – Hermann Hoth\n** 1st Panzer Army – Eberhard von Mackensen\n** 8th Army – Otto Wohler\n** 6th Army – Karl-Adolf Hollidt (transferred to Army Group A control)\n** Luftflotte 4 – Wolfram Freiherr von Richthofen / Otto Deßloch (since September)\n* (in Crimea) Army Group A – Ewald von Kleist\n* Army Group Center – Günther von Kluge\n** 2nd Army – Walter Weiß (took no part in the Dnieper battle after 3 October)\nDescription of the strategic operation\nInitial attack\nDespite a great superiority in numbers, the offensive was by no means easy. German opposition was ferocious and the fighting raged for every town and city. The Wehrmacht made extensive use of rear guards, leaving some troops in each city and on each hill, slowing the Soviet offensive.\nProgress of the offensive\nsoldiers crossing the Dnieper on improvised rafts]]\nThree weeks after the start of the offensive, and despite heavy losses on the Soviet side, it became clear that the Germans could not hope to contain the Soviet offensive in the flat, open terrain of the steppes, where the Red Army's numerical strength would prevail. Manstein asked for as many as 12 new divisions in the hope of containing the Soviet offensive – but German reserves were perilously thin.\nOn 15 September 1943, Hitler ordered Army Group South to retreat to the Dnieper defence line. The battle for Poltava was especially bitter. The city was heavily fortified and its garrison well prepared. After a few inconclusive days that greatly slowed down the Soviet offensive, Marshal Konev decided to bypass the city and rush towards the Dnieper. After two days of violent urban warfare, the Poltava garrison was overcome. Towards the end of September 1943, Soviet forces reached the lower part of the Dnieper.\nDnieper airborne operation\nand other members of his military council on the eve of the Battle of the Dnieper, 1943]]\n(The following is, largely, a synopsis of an account by Glantz with support from an account by Staskov.)\nStavka detached the Central Front's 3rd Tank Army to the Voronezh Front to race the weakening Germans to the Dnieper, to save the wheat crop from the German scorched earth policy, and to achieve strategic or operational river bridgeheads before a German defence could stabilize there. The 3rd Tank Army, plunging headlong, reached the river on the night of 21–22 September and, on 23 September, Soviet infantry forces crossed by swimming and by using makeshift rafts to secure small, fragile bridgeheads, opposed only by 120 German Cherkassy flak academy NCO candidates and the hard-pressed 19th Panzer Division Reconnaissance Battalion.  Those forces were the only Germans within 60&nbsp;km of the Dnieper loop. Only a heavy German air attack and a lack of bridging equipment kept Soviet heavy weaponry from crossing and expanding the bridgehead.\nThe Soviets, sensing a critical juncture, ordered a hasty airborne corps assault to increase the size of the bridgehead before the Germans could counterattack. On 21 September, the Voronezh Front's 1st, 3rd and 5th Guards Airborne Brigades got the urgent call to secure, on 23 September, a bridgehead perimeter 15 to 20&nbsp;km wide and 30&nbsp;km deep on the Dnieper loop between Kaniv and Rzhishchev, while Front elements forced the river.\nThe arrival of personnel at the airfields was slow, necessitating, on 23 September, a one-day delay and omission of 1st Brigade from the plan; consequent mission changes caused near chaos in command channels. Mission change orders finally got down to company commanders, on the 24 September, just 15 minutes before their units, not yet provisioned with spades, anti-tank mines, or ponchos for the autumn night frosts, assembled on airfields.  Owing to the weather, not all assigned aircraft had arrived at airfields on time (if at all).  Further, most flight safety officers disallowed maximum loading of their aircraft. Given fewer aircraft (and lower than expected capacities), the master loading plan, ruined, was abandoned. Many radios and supplies got left behind. In the best case, it would take three lifts to deliver the two brigades. Units (still arriving by the overtaxed rail system), were loaded piecemeal onto returned aircraft, which were slow to refuel owing to the less-than-expected capacities of fuel trucks. Meanwhile, already-arrived troops changed planes, seeking earlier flights.  Urgency and the fuel shortage prevented aerial assembly aloft. Most aircraft, as soon as they were loaded and fueled, flew in single file, instead of line abreast, to the dropping points.  Assault waves became as intermingled as the units they carried.\nAs corps elements made their flights, troops (half of whom had never jumped, except from training towers) were briefed on drop zones, assembly areas and objectives only poorly understood by platoon commanders still studying new orders. Meanwhile, Soviet aerial photography, suspended for several days by bad weather, had missed the strong reinforcement of the area, early that afternoon. Non-combat cargo pilots ferrying 3rd Brigade through drizzle expected no resistance beyond river pickets but, instead, were met by anti-aircraft fire and flares from the 19th Panzer Division (only coincidentally transiting the drop zone, and just one of six divisions and other formations ordered, on the 21st, to fill the gap in front of the 3rd Tank Army). Lead aircraft, disgorging paratroopers over Dubari at 1930h, came under fire from elements of the 73rd Panzer Grenadier Regiment and division staff of 19th Panzer Division. Some paratroopers began returning fire and throwing grenades even before landing; trailing aircraft accelerated, climbed and evaded, dropping wide. Through the night, some pilots avoided flare-lit drop points entirely, and 13 aircraft returned to airfields without having dropped at all. Intending a 10 by 14&nbsp;km drop over largely undefended terrain, the Soviets instead achieved a 30 by 90&nbsp;km drop over the fastest mobile elements of two German corps.\nOn the ground, the Germans used white parachutes as beacons to hunt down and kill disorganized groups and to gather and destroy airdropped supplies. Supply bonfires, glowing embers, and multi-color starshells illuminated the battlefield. Captured documents gave the Germans enough knowledge of Soviet objectives to arrive at most of them before the disorganized paratroopers.\nBack at the Soviet airfields, the fuel shortage allowed only 298 of 500 planned sorties, leaving corps anti-tank guns and 2,017 paratroops undelivered. Of 4,575 men dropped (seventy percent of the planned number, and just 1,525 from 5th Brigade), some 2,300 eventually assembled into 43 ad hoc groups, with missions abandoned as hopeless, and spent most of their time seeking supplies not yet destroyed by the Germans. Others joined with the nine partisan groups operating in the area. About 230 made it over (or out of) the Dnieper to Front units (or were originally dropped there). Most of the rest were captured that first night or killed the next day (although, on that first night, the 3rd Co, 73rd Panzer Grenadier Regiment, suffered heavy losses while annihilating about 150 paratroopers near Grushevo, some 3&nbsp;km west of Dubari).\nThe Germans underestimated that 1,500 to 2,000 had dropped; they recorded 901 paratroops captured and killed in the first 24 hours. Thereafter, they largely ignored the Soviet paratroopers, to counterattack and truncate the Dnieper bridgeheads. The Germans deemed their anti-paratrooper operations completed by the 26th, although a modicum of opportunistic actions against garrisons, rail lines, and columns were conducted by remnants up to early November. For a lack of manpower to clear all areas, fighters in the area's forests would remain a minor threat.\nThe Germans called the operation a fundamentally sound idea ruined by the dilettantism of planners lacking expert knowledge (but praised individual paratroopers for their tenacity, bayonet skills, and deft use of broken ground in the sparsely wooded northern region). Stavka deemed this second (and, ultimately, last) corps drop a complete failure; lessons they knew they had already learned from their winter offensive corps drop at Viazma had not stuck. They would never trust themselves to try it again.\nSoviet 5th Guards Airborne Brigade commander Sidorchuk, withdrawing to the forests south, eventually amassed a brigade-size command, half paratroops, half partisans; he obtained air supply, and assisted the 2nd Ukrainian Front over the Dnieper near Cherkassy to finally link up with Front forces on 15 November. After 13 more days of combat, the airborne element was evacuated, ending a harrowing two months. More than sixty percent never returned.\nAssaulting the Dnieper\nThe first bridgehead on the Dnieper's western shore was established on 22 September 1943 at the confluence of the Dnieper and Pripyat rivers, in the northern part of the front. On 24 September, another bridgehead was created near Dniprodzerzhynsk, another on 25 September near Dnipropetrovsk and yet another on 28 September near Kremenchuk. By the end of the month, 23 bridgeheads were created on the western side, some of them 10 kilometers wide and 1–2 kilometres deep.\nThe crossing of the Dnieper was extremely difficult. Soldiers used every available floating device to cross the river, under heavy German fire and taking heavy losses. Once across, Soviet troops had to dig themselves into the clay ravines composing the Dnieper's western bank.\nSecuring the lodgements\nGerman troops soon launched heavy counterattacks on almost every bridgehead, hoping to annihilate them before heavy equipment could be transported across the river.\nFor instance, the Borodaevsk lodgement, mentioned by Marshal Konev in his memoirs, came under heavy armored attack and air assault. Bombers attacked both the lodgement and the reinforcements crossing the river. Konev complained at once about a lack of organization of Soviet air support, set up air patrols to prevent bombers from approaching the lodgements and ordered forward more artillery to counter tank attacks from the opposite shore. When Soviet aviation became more organized and hundreds of guns and Katyusha rocket launchers began firing, the situation started to improve and the bridgehead was eventually preserved.\nSuch battles were commonplace on every lodgement. Although all the lodgements were held, losses were terrible – at the beginning of October, most divisions were at only 25 to 50% of their nominal strength.\nLower Dnieper offensive\nBy mid-October, the forces accumulated on the lower Dnieper bridgeheads were strong enough to stage a first massive attack to definitely secure the river's western shore in the southern part of the front. Therefore, a vigorous attack was staged on the Kremenchuk-Dnipropetrovsk line. Simultaneously, a major diversion was conducted in the south to draw German forces away both from the Lower Dnieper and from Kiev.\nAt the end of the offensive, Soviet forces controlled a bridgehead 300 kilometers wide and up to 80 kilometers deep in some places. In the south, the Crimea was now cut off from the rest of the German forces. Any hope of stopping the Red Army on the Dnieper's east bank was lost.\nOutcomes\nThe Battle of the Dnieper was another defeat for the Wehrmacht that required it to restabilize the front further west. The Red Army, which Hitler hoped to contain at the Dnieper, forced the Wehrmachts defences. Kiev was recaptured and German troops lacked the forces to annihilate Soviet troops on the Lower Dnieper bridgeheads. The west bank was still in German hands for the most part, but both sides knew that it would not last for long.\nAdditionally, the Battle of the Dnieper demonstrated the strength of the Soviet partisan movement. The Rail War operation staged during September and October 1943 struck German logistics very hard, creating heavy supply issues.\nIncidentally, between 28 November and 1 December 1943 the Tehran Conference was held between Winston Churchill, Franklin D. Roosevelt, and Stalin. The Battle of the Dnieper, along with other major offensives staged in 1943, certainly gave Stalin a dominant position for negotiating with his Allies.\nThe Soviet success during this battle created the conditions for the follow-up Dnieper-Carpathian Offensive on the right-bank Ukraine, which was launched on 24 December 1943 from a bridgehead west of Kiev that was secured during this battle. The offensive brought the Red Army from the Dnieper all the way to Galicia (Poland), Carpathian Mountains and Romania, with Army Group South being split into two parts- north and south of Carpathians.\nSoviet operational phases\nFrom a Soviet operational point of view, the battle was broken down into a number of different phases and offensives.\nThe first phase of the battle :\n* Chernigov-Poltava Strategic Offensive 26 August 1943 – 30 September 1943 (Central, Voronezh and Steppe fronts)\n:Chernigov-Pripyat Offensive 26 August – 30 September 1943\n:Sumy–Priluky Offensive 26 August – 30 September 1943\n:Poltava-Kremenchug Offensive 26 August – 30 September 1943\n* Donbass Strategic Offensive 13 August – 22 September 1943 (Southwestern and Southern fronts)\n* Dnieper airborne assault 24 September – 24 November 1943\nThe second phase of the operation includes :\n* Lower Dnieper Offensive 26 September – 20 December 1943\n:Melitopol Offensive 26 September – 5 November 1943\n:Zaporizhia Offensive 10–14 October 1943\n:Kremenchug-Pyatikhatki Offensive 15 October – 3 November 1943\n:Dnepropetrovsk Offensive 23 October – 23 December 1943\n:Krivoi Rog Offensive 14–21 November 1943\n:Apostolovo Offensive 14 November – 23 December 1943\n:Nikopol Offensive 14 November – 31 December 1943\n:Aleksandriia-Znamenka Offensive 22 November – 9 December 1943\n:Krivoi Rog Offensive 10–19 December 1943\n* Kiev Strategic Offensive Operation (October) (1–24 October 1943)\n:Chernobyl-Radomysl Offensive Operation (1–4 October 1943)\n:Chernobyl-Gornostaipol Defensive Operation (3–8 October 1943)\n:Lyutezh Offensive Operation (11–24 October 1943)\n:Bukrin Offensive Operation (12–15 October 1943)\n:Bukrin Offensive Operation (21–24 October 1943)\n* Kiev Strategic Offensive 3–13 November 1943\n:Rauss' November 1943 counterattack\n* Kiev Strategic Defensive 13 November – 22 December 1943\nReferences\nCitations\nBibliography\n*\n* David M. Glantz, Jonathan M. House, When Titans Clashed: How the Red Army stopped Hitler, University Press of Kansas, 1995\n* Nikolai Shefov, Russian fights, Lib. Military History, Moscow, 2002\n* History of Great Patriotic War, 1941–1945. Moscow, 1963\n* John Erickson, Barbarossa: The Axis and the Allies, Edinburgh University Press, 1994\n* Harrison, Richard. (2018) ''The Battle of the Dnepr: The Red Army's Forcing of the East Wall, September–December 1943. Helion and Company.\n* Marshal Konev, Notes of a front commander, Science, Moscow, 1972.\n* Erich von Manstein, Lost Victories'', Moscow, 1957."
    }
  ]
}