{
  "content": [
    {
      "type": "text",
      "text": "# Battles of Glina (1991)\n\n}}\n| caption           = Location of Glina in Croatia\n| partof            = the Croatian War of Independence\n| place             = Glina, Croatia\n| date              = First battle: 26 June 1991Second battle: 26 July 1991\n| result            = SAO Krajina victory in both battles\n| combatant1        =  SAO KrajinaSupported by: Yugoslavia\n| combatant2        =\n| commander1        =  Dragan Vasiljković Bojan Drobnjak\n| commander2        =  Tomislav Rom Ivan Šantek\n|units1 = Yugoslav People's Army\n*  Yugoslav Ground Forces\nKrajina Territorial Defense Kninjas\n|units2 =  Croatian National Guard  Croatian Police\n| strength2         = 600–650 soldiers and police officers\n| strength1         = 28–29 soldiers & volunteers\n| casualties2       = Unknown\n| casualties1       = Unofficial estimate:2 killed and 1 wounded\n}}\nThe Battle for Glina was an armed conflict between a Knindža unit supported by the JNA against the joint forces of the Ministry of Internal Affairs of the Republic of Croatia and the Croatian Army. Two battles were fought in Glina and both ended in serbian victories as they managed to capture of the police station, which became part of SAO Krajina.\nBackground\nIn January 1991, the Ministry of Internal Affairs of the Republic of Srpska Krajina was founded, which sought to unite all police stations that were not under the control of the authorities in Zagreb.\nFor this reason, a message was sent to the police stations in Knin, Obrovac, Benkovac, Gračac, Donji Lapac, Titova Korenica, Dvor, Glina, Kostajnica and Vojnić that they have joined the Interior Ministry of SAO Krajina. As these were towns with a Serb ethnic majority population, the subordination to the authorities in Knin was mostly voluntary.\nCourse of the Battles\nFirst battle\nThe first clashes in Glina took place on June 26 of 1991. During these clashes, an infantry group of the Croatian National Guard (ZNG) arrived in town while the Yugoslav People's Army (JNA), held the entire region around Glina, according to the statements of Dragan Vasiljković which were also indirectly confirmed by Croatian sources. In short-lived skirmishes, one Croatian policeman was killed, Tomislav Rom, and another one was wounded, Ivan Šantek. The Croatian policemen were offered to leave the town and go towards Jukinac. After this retreat, the Serb forces marched towards the Glina police station and occupied it.\nSecond battle\nExactly a month after the first battle, on July 26 of 1991, a group of 21 Kninjas under the command of Dragan Vasiljković entered the city, and with them eight more volunteers. According to the statements of Vasiljković, they came to the reconnaissance and had no idea how many members of the Croatian forces were there, otherwise they would not have attacked the city if they had known that there were between 600 and 650. These volunteers managed to agree with the lieutenant of the JNA, Bojan Drobnjak, that provide them with tank support in the event of an attack on Croatian positions.\nThe attack on the Croatian positions began, but tank support was absent as Drobnjak and his tank were moved to a new position. However, he managed to fire 4 rockets at the positions of the Croatian forces. It probably had a psychological effect on the Croatian forces leaving their positions and going towards Jukinac, then Gornji and Donji Viduševac, and then completely leaving that territory.\nIn the short-lived battle, two Serbian volunteers were killed, and one member of the Knindža unit was wounded. Glina remained part of the SAO Krajina until August 6 of 1995 when it was captured during Operation Storm.\nReferences"
    }
  ]
}