{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Randeniwela\n\n| coordinates =\n| map_type    =\n| latitude    =\n| longitude   =\n| map_size    =\n| map_caption =\n| map_label   =\n| territory   =\n| result      = Sinhalese victory\n| status      =\n| combatant1  =  Kingdom of Kandy\n| combatant2  =  Portuguese Empire\n| combatant3  =\n| commander1  = King SenaratPrince Maha Astana\n| commander2  = Constantino de Sá de Noronha\n| commander3  =\n| strength1   = >35,000\n| strength2   = 1,500 Portuguese20,000 Lascarins\n| strength3   =\n| casualties1 = Unknown\n| casualties2 = Most died with 200 POWs\n| casualties3 =\n| notes       =\n}}\nThe Battle of Randeniwela was fought on 25 August 1630 in the Sinhalese–Portuguese War. It was fought between Portuguese Empire and King Senarth's youngest son Prince Maha Astana, who would later become Rajasinghe II against Portuguese forces commanded by then Governor Constantinu De Sá de Noronha. It was fought at Randeniwela near Wellawaya, a place close to the town of Badulla. The battle broke off when Constantino de Sá launched the invasion via Badulla. The Portuguese army suffered a complete rout subsequent to a mass defection by its Lascarin (local militia) contingent.\nBackground\nBattle\nAt Randeniwela the entire Lascarin contingent joined the Kandyan forces. This was followed by a rain of arrows and bullets, in the night, against which it was impossible for the Portuguese to erect any protection. Into the bargain the torrential rain that poured down drenched the Portuguese army for several hours rendering the gunpowder and matches of their arquebuses useless.\nDom Cosmo, one of the four Lascarin captains who eventually rebelled against the Portuguese, is said to have begun the native revolt by 'striking off the head of a Portuguese and holding it aloft on his lance'.\nFor this service, Dom Cosmo was awarded several Nindagams (tributary villages)  and the Katugaha Walauwa by King Senarath. His daughter married (Binna) from a prominent family in the area. Keppetipola Dissawa is believed to be a direct descendant of his.\nAftermath\nThe Portuguese suffered a devastating defeat in this battle.\nReferences\nExternal links\n*\n*\n*\n*\n* [https://web.archive.org/web/20061108015613/http://www.manthree.com/history/kandy_port.htm]\n*\n*\n* [http://www.divaina.com/2009/08/16/feature08.html From prof Mendis Rohanadheera]\n* [https://web.archive.org/web/20110722014604/http://www.lankadeepa.lk/Section/diyatha/20122009/12-1.html Gifts for War Heros]"
    }
  ]
}