{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Orgreave__disambig_1\n\n| place                    = Orgreave, South Yorkshire, England\n| coordinates              =\n| type                     = Civil disorder\n| filmed_by                =\n| fatalities               = 0\n| reported injuries        = 123\n| inquiries                = Independent Police Complaints Commission (June 2015)\n| arrests                  = 95\n| charges                  =\n| verdict                  = Acquitted\n| litigation               = Arthur Critchlow and 38 Others v Chief Constable of South Yorkshire Police (1990)\n| awards                   = £425,000\n| notes                    =\n}}\nThe Battle of Orgreave was a violent confrontation on 18 June 1984 between pickets and officers of the South Yorkshire Police (SYP) and other police forces, including the Metropolitan Police, at a British Steel Corporation (BSC) coking plant at Orgreave, in Rotherham, South Yorkshire, England. It was a pivotal event in the 1984–1985 UK miners' strike, and one of the most violent clashes in British industrial history.\nSeventy-one picketers were charged with riot and 24 with violent disorder. At the time, riot was punishable by life imprisonment. The trials collapsed when the evidence given by the police was deemed \"unreliable\". Gareth Peirce, who acted as solicitor for some of the pickets, said that the charge of riot had been used \"to make a public example of people, as a device to assist in breaking the strike\", while Michael Mansfield called it \"the worst example of a mass frame-up in this country this century\".\nIn June 1991, the SYP paid £425,000 in compensation to 39 miners for assault, wrongful arrest, unlawful detention and malicious prosecution. A new inquiry was set up in 2025 to investigate the event.\nBackground\nTransport of coal and coke\nThe Orgreave Coking Works, where coal was turned into coke for use in steel production, was regarded by National Union of Mineworkers (NUM) leader Arthur Scargill as crucial. Early in the strike, British Steel plants had been receiving \"dispensations\", picket-permitted movements of coal to prevent damage to their furnaces. However, it was found that more than the permitted amount of coal had been delivered, so action was taken.\nIn the early days of the 1984–85 strike, the NUM made a decision to picket the integrated steel complexes. Scargill invoked the notion of the old Triple Alliance whereby the unions in coal, steel and rail were bound to support one another, and asked steelworkers not to handle deliveries of coal. Bill Sirs of the Iron and Steel Trades Confederation (ISTC) rejected such calls on the grounds that industrial action by steelworkers at the integrated complexes could incapacitate the rolling mills and billet forges, and cause job losses. Sirs stated, in defiance of Scargill, that his members would continue to handle any fuel that presented itself.\nThere was also some opposition within the NUM to the picketing of the steel plants, as closures in the steel industry could reduce demand for coal and lead to job losses in the coal industry. Mick McGahey, the deputy leader of the NUM, was particularly concerned about the picketing of the Ravenscraig steelworks in Scotland, which he had campaigned to keep open, and negotiated agreements to maintain supplies of coal to the plant.\nPicketing was largely unsuccessful at the plants of Ravenscraig, Llanwern and Port Talbot, which were all close to deep-water ports and had a range of methods of receiving coal supplies. The plant at Scunthorpe was inland and thus more vulnerable to picketing. The cokeworks at Orgreave became a target of the NUM pickets in an attempt to deny supplies of coal and coke to Scunthorpe.\nAn agreement between the NUM and ISTC over deliveries of 15,700 tonnes of coal per week to Scunthorpe broke down after an explosion in the Queen Mary blast furnace at the plant on 21 May 1984. It took two hours to douse the flames and a further eight hours to stop the liquid iron bursting through the brickwork. This was considered a result of the poor quality of coal supplies. Attempts by the ISTC to persuade the NUM to deliver more coal did not bring immediate results, with the divisional official Roy Bishop writing on both the physical dangers to the workers by the Queen Mary and the possibility of irreversible damage to the furnace. As the NUM did not respond immediately, British Steel decided to act quickly to find alternative supplies. The company ordered a large consignment of coal from Poland to be delivered to Flixborough, Lincolnshire, and spoke to every haulage company it had ever used to arrange for non-unionised hauliers to transport the coal. In addition, an order was made for 5,000 tonnes of top-quality coke to be delivered from Orgreave to Scunthorpe.\nA sympathetic steelworker informed the Barnsley NUM of the plans on 22 May. Although there had been some picketing at Orgreave since the start of the strike, 23 May is generally considered the beginning of the major struggle between NUM pickets and the police to stop deliveries of coke from the plant. 18 June, which is often known as the Battle of Orgreave, is generally considered the end of this period.\nChanges in policing tactics\nMass picketing had proved successful at the Battle of Saltley Gate in Saltley, Birmingham, during the 1972 miners' strike. At Saltley Coke Works, 30,000 pickets and supporters led by Scargill had faced 800 police officers, and on 10 February 1972 Sir Derrick Capper, the chief constable of Birmingham City Police, ordered the coking plant to close its gates \"in the interests of public safety\". Closure of the Saltley works secured victory for the NUM and nine days later the Conservative government of Edward Heath agreed to meet the union's demands.\nOfficers at Orgreave.]]\nAs a direct result of Saltley, the Association of Chief Police Officers (ACPO) established the National Reporting Centre (NRC) which would be \"operationalised in times of industrial or political crisis [to provide] a coordinated national response to demands on policing\". The NRC assumed the power – \"endorsed by the Home Secretary\" – to deploy police officers from any force in the country to areas of \"high tension\" and \"across force boundaries without the knowledge or consent of local police authorities\". Speaking in October 1984, John Alderson, the former deputy chief constable of Dorset Police, criticised the NRC as a \"de facto national police\". In addition, events in the early 1980s, such as the national steel strike of 1980 and the riots in inner-city areas such as Brixton and Toxteth, had led police forces to train officers to deal with mass protests differently. For example, officers during the 1981 riots had been left using dustbin lids to protect themselves from missiles, whereas the police at Orgreave had all been equipped with riot shields.\nRiot at Maltby and death of Joe Green\nThe Battle of Orgreave came amidst events that caused tensions to escalate in the Yorkshire coalfield. In Maltby, roughly  from Orgreave, a large group of young mineworkers besieged the town's police station on Saturday, 9 June. There was a heavy police response that left the town cordoned off for several days and created local resentment.\nOn Friday, 15 June, an underground worker from Kellingley Colliery, Joe Green was killed while picketing. As Green was trying to dissuade lorries from delivering fuel to Ferrybridge \"A\" Power Station, he was fatally struck by a trailer.\nThis came after the death of David Jones in controversial circumstances at Ollerton on 15 March 1984, and also a similar incident in the 1972 strike in which picketer Freddie Matthews was killed by a lorry that mounted the pavement to cross a picket line. Speaking at a well-attended rally in nearby Wakefield on Sunday 17 June, Scargill made an impassioned plea to close Orgreave with mass picketing.\nEvents\nThe NUM deployed 5,000 pickets from across the UK, who planned to use sheer numbers (\"mass picketing\") to prevent access to Orgreave by strike-breaking lorries that collected coke for use at Scunthorpe. The South Yorkshire Police (SYP) were determined not to see a repeat of 1972's Battle of Saltley Gate – where 30,000 pickets had overwhelmed 800 police officers – and deployed around 6,000 officers from eighteen different forces at Orgreave, equipped with riot gear and supported by police dogs and 42 mounted police officers.\nRobert East et al, writing in the Journal of Law and Society in 1985, suggested that rather than maintaining order and upholding the law, \"the police intended that Orgreave would be a 'battle' where, as a result of their preparation and organisation, they would 'defeat' the pickets\". Michael Mansfield said: \"They wanted to teach the miners a lesson – a big lesson, such that they wouldn't come out in force again.\" Civil liberties pressure group Liberty has said: \"There was a riot. But it was a police riot.\"\nHaving corralled the pickets into a field overlooking the coke works, the SYP positioned officers equipped with long riot shields at the bottom of the field and mounted police and dogs to either side. A road along one side of the field allowed the mounted police to deploy rapidly, and a railway cutting at the top of the field made retreat by the pickets difficult and dangerous. When the pickets surged forward at the arrival of the first convoy of lorries, SYP Assistant Chief Constable Anthony Clement ordered a mounted charge against them. It was \"a serious overreaction\" and the miners responded by throwing stones and other missiles at the police lines. Clement ordered two further mounted advances, and the third advance was supported by \"short shield\" snatch squads who followed the mounted police, \"delivering baton beatings to the unarmed miners\". There followed a lull of several hours, during which many pickets left the scene. The coking plant had closed for the day and no more lorries were due to arrive. Those pickets that remained in the field were sunbathing or playing football and posed no threat to the police or the plant. By now \"massively outnumbering\" the pickets, the police advanced again and launched another mounted charge. Officers pursued the pickets out of the field and into Orgreave village, where Clement ordered a \"mounted police canter\" which Hunt describes as an \"out-of-control police force [charging] pickets and onlookers alike on terraced, British streets\".\nTrials\nOfficial reports state that during the confrontation 93 arrests were made, with 51 pickets and 72 policemen injured. 95 pickets were charged with riot, unlawful assembly and similar offences after the battle. A number of these men were put on trial in 1985, but the trials collapsed, all charges were dropped and a number of lawsuits were brought against the SYP for assault, unlawful arrest and malicious prosecution. The SYP later agreed to pay £425,000 compensation and £100,000 in legal costs to 39 pickets in an out of court settlement. However, no officer was disciplined for misconduct.\nWriting for The Guardian in 1985, Gareth Peirce said that the events at Orgreave \"revealed that in this country we now have a standing army available to be deployed against gatherings of civilians whose congregation is disliked by senior police officers. It is answerable to no one; it is trained in tactics which have been released to no one, but which include the deliberate maiming and injuring of innocent persons to disperse them, in complete violation of the law.\"\nCalls for official inquiry\nMansfield described the evidence given by the SYP as \"the biggest frame-up ever\". He said that the force had a culture of fabricating evidence which was not corrected by the time of the Hillsborough disaster. After the 2012 report of the Hillsborough Independent Panel, NUM leader Chris Kitchen called for the investigation into the force's practices to be widened to cover the Orgreave clashes. Also in 2012, the Orgreave Truth and Justice Campaign (OTJC) was formed to campaign for a public inquiry into the policing of the events of 18 June 1984, following the success of the Hillsborough Justice Campaign. In October 2012, a BBC One regional news and current affairs programme, Inside Out, broadcast a 30-minute film about the events at Orgreave. The programme reexamined the evidence that the SYP had deliberately attempted to co-ordinate arrest statements in order to charge the miners with riot.\nFollowing the programme, the SYP referred itself to the Independent Police Complaints Commission (IPCC).\nIn June 2015, the IPCC announced that it would not launch a formal investigation into the events at Orgreave because too much time had passed. A Labour MP, Helen Jones, responded in the House of Commons by expressing her \"deep concern\", saying that the decision \"calls into question whether the IPCC is fit for purpose\".\nLabour MS Mick Antoniw, who represented several Welsh miners charged with offences at Orgreave, said the miners were \"surrounded on all sides by police horses and police dogs and then savagely attacked by charge after charge of baton-wielding police officers on horseback. Despite public calls at that time for an investigation, no inquiry ever took place. The tragedy of this failure is that not only have those miners who were arrested been denied the justice and vindication that would come from such an inquiry it meant that an early opportunity to investigate the culture and operation of the South Yorkshire Police never took place.\"\nIn September 2016, Mike Freeman, a retired detective superintendent with Greater Manchester Police who had been a sergeant at Orgreave, told how the SYP pre-arranged a system whereby officers who made arrests would not – contrary to established police procedure – be responsible for their prisoners and write out statements detailing the arrest, but instead hand over prisoners at a reception point, return to the picket line, and at the end of the operation simply sign statements which had been pre-prepared by other officers not involved in the arrest. Freeman said that he had \"never encountered it before or since\" and \"I knew in my own mind that was wrong, and I can clearly remember saying to colleagues that I was with that day, 'I will not be making an arrest on that operation', and I didn't.\" Another officer said that he and colleagues at Orgreave had been instructed by a superior officer not to write anything in their pocketbooks, a practice controversially repeated by the SYP at Hillsborough in 1989. It was a disciplinary offence not to write in their pocketbooks, which were considered \"contemporaneous notes\" and \"very difficult to amend without it being obvious, and therefore persuasive, credible evidence in a courtroom\".\nIn October 2016, a former Merseyside Police officer who was present at Orgreave told BBC journalist Dan Johnson that at a briefing before the confrontation senior SYP officers were \"anticipating trouble and in some ways relishing it and looking forward to it\". He said that the police support units had been given \"a licence to do what we wanted\" and were ordered to charge \"a largely peaceful crowd\". Of the violence that followed, he said: \"I couldn't believe what I was seeing. I was just seeing police officers attack people. These were people on the ground and even if they weren't doing anything – just walking away – police officers had their batons and they were just hitting people.\" A number of police officers had removed the identification numbers on their uniforms, as illustrated in the iconic photographs taken on the day by Martin Jenkinson and Don McPhee.\nThe campaign for an inquiry gained more coverage following revelations about corruption in the SYP during the Hillsborough disaster. Following the 2016 inquest verdict into the 1989 Hillsborough disaster, previously censored documents suggesting links between the actions of senior SYP officers at both incidents were published. This led to renewed calls for a public inquiry to be held into the actions of the police at Orgreave.  Wakefield Metropolitan District Council became the first council in the UK to fly the flag of the OTJC in June 2016, whilst other councils in South Yorkshire and Derbyshire were considering the same action.\nIn October 2016, in an oral answer to a question in the House of Commons, a written ministerial statement to the House of Commons and Lords, and in a letter to the Orgreave Truth and Justice Campaign (OTJC), Home Secretary Amber Rudd announced there would be no statutory inquiry or independent review. In 2016, Alan Billings, the South Yorkshire Police and Crime Commissioner, admitted that the SYP had been \"dangerously close to being used as an instrument of state\".\nPrior to the election of the Starmer ministry in July 2024, the Labour Party pledge was to hold an inquiry into the policing.  In late June 2025, Northumbria police admitted to the administrative destruction of historic police files relating to the actions, in the month prior to that election. In July 2025 Yvette Cooper announced that a national inquiry will be held.\nFollowing the Home Secretary's announcement, entrepreneur Dale Vince called for the enquiry to be expanded to include the 1985 Battle of the Beanfield, at which he had been present, expressing the belief that both episodes were part of a plan by Margaret Thatcher to \"smash\" the miners and travellers, whom she considered to be \"enemies of the state\".\nMedia coverage\nFootage of the confrontation was filmed by a crew from the BBC. When this appeared on that evening's news bulletins, it was edited and broadcast out of chronological sequence, showing pickets throwing stones at the police and the police subsequently carrying out a mounted charge. This corresponded with the narrative given by the police that the decision to use horses was necessary to stop the stone throwing, and was only taken after the police had been subjected to a sustained barrage of missiles. Video taken by the police's own cameramen and footage recorded by filmmaker Yvette Vanson demonstrated that the reverse was true, and that the stone throwing had been a response to the unprovoked first mounted charge. In July 1991 the BBC said:\n}}\nTony Benn challenged this explanation, stating that he had spoken to BBC staff shortly after the broadcast who \"were up in arms as they could see quite clearly that the police charge[d] and then the miners throw stones [but they] were ordered to transpose the order in such a way as to give the opposite impression\". Benn said: \"They didn't make a mistake ... Whoever gave the orders actually destroyed the truth of what they reported.\"\nIndependent Television News (ITN) also filmed the events, and part of their news bulletin that evening showed a policeman standing over a prone picket and repeatedly striking him in the head with his baton. The picket was beaten unconscious and the policeman's baton broke in half. In the BBC's report, filmed from the same vantage point, the footage was cut just before the policeman began beating the picket. In 2014, a spokesman for the BBC claimed that the crew had \"failed to record some of the violence due to a camera error\".\nAt an internal BBC meeting held on 19 June 1984, Peter Woon, the editor of BBC News, said there was \"a general feeling in the newsroom\" that the previous day's coverage of Orgreave had displayed \"a marginal imbalance\", while Alan Protheroe, the assistant director general of the BBC, admitted that \"the BBC's early evening coverage of Orgreave might not have been wholly impartial\". In 2009, Nicholas Jones, a former BBC journalist, said: \"I got ensnared by the seeming inevitability of the Thatcherite storyline that the mineworkers had to be defeated in order to smash trade union militancy.\" Jones said that the media may have been guilty of \"a collective failure of judgment\", and if its \"near-unanimous narrative had not been so hostile to the NUM and had done more to challenge government then Thatcher may have been forced to reach a negotiated settlement during the initial phase of the dispute\". Geoffrey Goodman, a former industrial editor for the Daily Mirror, said that \"the dominant media account\" had been \"hostile\" to the strikers, \"with much of the UK's mainstream media willingly 'marshalled by Downing Street to provide the propaganda that helped defeat the miners.\nAnalysis\nPaul Routledge, a journalist and biographer of Arthur Scargill, suggested that the National Coal Board (NCB) had used the Orgreave dispute as a diversionary tactic to concentrate pickets in one location and relieve the pressure of policing working pits in Nottinghamshire. He writes that Kevin Hunt, the NCB director of industrial relations, had asked Scargill in advance if he would allow more tonnage to be allowed out of Orgreave, which led Scargill to believe that Orgreave was a pressure point that he should target. The picketing of working pits in Nottinghamshire lost momentum after Orgreave, partly because many pickets were given bail conditions after being arrested, and the number of strikers in Nottinghamshire decreased.\nIan MacGregor, Chairman of the NCB, wrote in his biography, \"It [Orgreave] became a cause célèbre for Scargill, a fight he had to win. We were quite encouraged that he thought it so important and did everything we could to help him continue to think so, but the truth was that it hardly mattered a jot to us – beyond the fact that it kept him out of Nottingham.\"\nDavid Hart, a right-wing political activist and adviser to MacGregor, the NCB, and Prime Minister Margaret Thatcher, claimed that Orgreave was \"a set-up by us\". He said in a 1993 interview, \"The coke was of no interest whatsoever. We didn't need it. It was a battleground of our choosing on grounds of our choosing. I don't think that Scargill believes that even today. The fact is that it was a set-up and it worked brilliantly.\" Following his comments, senior managers from the NCB denied these claims and threatened Hart with disassociation. John Alderson, in Principled Policing: Protecting the Public with Integrity (1998), wrote that if MacGregor and Hart's claims were true, the \"conspiracy to draw the miners into mass pickets and predictable violent conflict between the police and themselves\" constituted a \"deceit... tantamount to incitement\".\nJournalist Alastair Stewart has characterised it as \"a defining and ghastly moment\" that \"changed, forever, the conduct of industrial relations and how this country functions as an economy and as a democracy\". Most media reports at the time depicted it as \"an act of self-defence by police who had come under attack\". In 2015, the Independent Police Complaints Commission (IPCC) reported that there was \"evidence of excessive violence by police officers, a false narrative from police exaggerating violence by miners, perjury by officers giving evidence to prosecute the arrested men, and an apparent cover-up of that perjury by senior officers\".\nHistorian Tristram Hunt has described the confrontation as \"almost medieval in its choreography ... at various stages a siege, a battle, a chase, a rout and, finally, a brutal example of legalised state violence\".\nInside the NUM the failure of the mass picketing tactic led some in the regional union leadership, especially those influenced by the Eurocommunist wing of the Communist Party of Great Britain in Scotland and South Wales, to turn towards a \"cultural politics\" approach of building a mass movement in the country to support, through solidarity and practical help, the striking miners and to force a political concession from the government. The rejection of the \"militant labourism\" of Scargill this represented was and remains an area of controversy and dispute in the wider Labour Movement in Britain.\nIn culture\nIn 2001, conceptual artist Jeremy Deller originated and set in motion the idea of a re-enactment of the event as an arts project, commissioned by British arts organisation Artangel, with the recreations scripted and staged by historical re-enactment events company EventPlan Limited. The event took place on 17 June 2001 and was filmed by film director Mike Figgis for a Channel 4 documentary. The re-enactment featured 800 people including 280 local residents, a number of people (police and pickets) from the original encounter and 520 re-enactors from various groups such as The Sealed Knot, Legio II Augusta (Romans), The Vikings (reenactment), War of the Roses and English Civil War Society, but with authentic 1980s clothing and techniques. Only the railway crossing was omitted from the re-enactment, on safety grounds.\nThe Dire Straits song \"Iron Hand\" from the 1991 album On Every Street tells the story of the event.\nThe Manic Street Preachers song \"30-Year War\" from Rewind the Film mentions the event as an instance of class conflict.\nIn the video for his song \"Sirens\", Dizzee Rascal is chased by huntsmen through the fictional 'Orgreave Estate'.\nIrvine Welsh's Skagboys opens with a journal entry detailing the lead character Mark Renton's experience at The Battle of Orgreave.\nThe confrontations at Orgreave form a substantial part of David Peace's 2004 novel GB84.\nJonathan Trigell's 2022 novel Under Country contains a full chapter description of the events at Orgreave.\nOrgreave is subject of protest art prints by British artist Darren Coffield.\nThe Orgreave Truth and Justice Campaign has been involved in a number of fundraising and commemorative activities in 2014 and 2015, including live concerts and a fundraising double-CD compilation album, containing (in part) musical and spoken-word tracks relating to the events.\nSee also\n* Wapping dispute\n* BBC controversies\n* ''Miners' Strike: A Frontline Story''\nReferences\n;Notes\n;Bibliography\n*\n*\n*\n*\n*\n*\n*\n*\n*\nFurther reading\n*\nExternal links\n*\n*\n*\n*\n*\n* [https://historyproject.org.uk/interview/yvette-vanson The British Entertainment History Project | Yvette Vanson |] Interview Yvette Vanson Documentary Film Maker of Battle of Oregrave British Entertainment History Project\ncategory:History of the Metropolitan Police"
    }
  ]
}