{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Gunnislake New Bridge\n\n| combatant1  =  Royalists\n| combatant2  =  Parliamentarians\n| commander1  = Sir Richard Grenville  Thomas Southcott\n| commander2  = Earl of Essex  William Balfour\n| strength1   = ~ 2,000\n| strength2   = ~ 2,500\n| casualties1 = 200\n| casualties2 = 40\n|campaignbox  =\n}}\nThe Battle of Gunnislake New Bridge took place on 20 July 1644 on and around Gunnislake New Bridge, a bridge over the River Tamar between Cornwall and Devon, during the First English Civil War.\nBackground\nDuring the Civil War the county of Cornwall was entirely loyal to King Charles I and the Royalist cause. However, Devon was Parliamentarian, making the River Tamar the site of many battles. Each side understood that if they were to either invade the other county or defend against invasion, they had to have control of the Tamar's crossings. Gunnislake New Bridge was one of four bridges crossing the River Tamar.\nBattle\nThe Parliamentarian forces, headed by Robert Devereux, 3rd Earl of Essex, pushed into Cornwall over the bridge. They were met by Richard Grenville's forces, who were quartered at the garrisons of Cotehele House and Harewood House, Calstock. The battle was hard fought and lasted all day. The Royalists prevented the Parliamentarians from advancing further into Cornwall, at a cost of 200 casualties and many taken prisoner. The Parliamentarians lost about 40 men.\nAftermath\nAfter the battle both sides continued to defend their ends of the bridge. Lord Essex travelled north to Launceston, leaving half of his troops defending New Bridge. He then regrouped with his other forces based in the northern half of the Tamar Valley. On the 26th of July Essex crossed the Tamar at Horsebridge, penetrating the Royalist defences and continuing into the heart of Cornwall. This advance culminated in the Battle of Lostwithiel, a disastrous defeat for the Parliamentarians.\nSee also\n*Cornwall in the English Civil War\nReferences\nExternal links\n* [http://www.calstock.info/ Calstock Online Parish Clerk]\n* [http://www.calstockhistory.org.uk/ Calstock History]\n* [https://web.archive.org/web/20070930032614/http://crocat.cornwall.gov.uk/dserve/dserve.exe?dsqIni=Dserve.ini&dsqApp=Archive&dsqDb=Catalog&dsqCmd=Overview.tcl&dsqSearch=((text)='calstock') Cornwall Record Office Online Catalogue for Calstock]\n*Calstock Parish Church History, Rev Gordon Ruming"
    }
  ]
}