{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Tecroghan__disambig_1\n\n300 cavalry\n|strength2=1,400 infantry1,200 cavalry\n|casualties1=Low\n|casualties2=Low\n|}}\nThe Battle of Tecroghan also called of Ticroghan, was a minor battle of the Cromwellian conquest of Ireland that was fought on 19 June 1650 outside Tecroghan Fort in County Meath, Ireland. The fort was besieged by the Parliamentarians. A force of the Irish Royalist Alliance commanded by the Earl of Castlehaven attempted to relieve the siege. Although a part of the allied force broke through to the fort with some supplies, the siege continued and the garrison surrendered six days later.\nBackground\nIn the spring of 1650, the situation for the alliance of the Irish Confederacy and Royalists was dire. This alliance had formed after the Second Ormond Peace in January 1649 that had ended the Irish Confederate Wars. Since Oliver Cromwell's arrival in Ireland on 15 August 1649, the Parliamentarians had taken almost all of the major cities and garrisons in Leinster from the alliance. By May, one of the few remaining garrisons was Tecroghan fort, located on a bog island in County Meath, seven miles west of Trim. The surrounding terrain was fairly desolate, but the castle was only a few miles from the main Dublin-Athlone road, giving it considerable strategic importance to logistics and trade.\nThe castle's garrison was commanded by Sir Robert Talbot and Lady Fitzgerald. The castle was a modern bastioned earthwork equipped with cannons. Its location on a bog island made it difficult to approach and nearly impossible to attack by means of artillery.\nIn May 1650, Cromwell and his military commander in Ireland, Henry Ireton, decided that Tecroghan Castle should be taken and sent a large Parliamentarian force, in excess of 2,000 men commanded by Colonel John Reynolds, to besiege the castle. The plan was to simply blockade the castle from a safe distance and starve the garrison into submission.\nIn response, the leader of the Royalist alliance, the Duke of Ormond, instructed two of his military commanders, the Earl of Castlehaven and the Marquess of Clanricarde to relieve Tecroghan.\nBattle\nOn 18 June, Castlehaven's and Clanricarde's forces met at Tyrrellspass, 23 kilometers west of Tecroghan. Together they were about 3,000 men, 2,700 infantry and 300 cavalry. They saw that the castle on its bog island was surrounded by a large Parliamentarian force with many mounted troops.\nThe allied commanders discussed tactics and agreed that a frontal infantry assault on the siege lines surrounding the castle would be foolhardy because the Parliamentarian cavalry was substantially larger than their small mounted force. The best way to relieve the garrison, it was agreed, would be to march directly toward the castle as a unit and attempt to break through at a single point. Such an approach would render the Parliamentarian cavalry virtually useless as the path taken to the castle would be through terrain that would be largely soft, wet bogland. Clanricarde's health precluded him from walking, so Castlehaven volunteered to lead the infantry in the march and attack.\nOn 19 June, Castlehaven began his attack by marching toward the castle through the bog. Four miles from the castle, the English confronted the Confederates in a battle line. Castlehaven deployed his infantry and immediately attacked. The Confederate left wing commanded by Colonel Burke attacked the defensive line of the Parliamentarians, broke through, and continued their advance towards the castle.\nThe Confederate right wing also attacked but was turned back by the Parliamentarians. Discipline broke and the troops began to scatter. The disorder spread to the center of the formation where Castlehaven was positioned. The center began to retreat despite Castlehaven's attempt to stand and fight. Soon the center and the right wing were in full retreat. Burke on the left wing was so far advanced that he and many of his men could reach the castle. The fighting ended at that point. The battle had been brief with relatively few casualties. Although Burke had broken through with some provisions for the besieged, the Parliamentarian blockade stayed in place and the siege continued. Castlehaven and those of his troops that had retreated, fell back, regrouped, and later returned to Tyrrellspass and marched home.\nThe garrison in the castle, reinforced with what Burke's men were able to carry, did what they could in their own support and began sallying out daily to destroy the defensive works of the English. Such sorties continued for several days until 25 June when the garrison ran out of gunpowder.\nAftermath\nAlthough some authors have considered this a small victory for the Royalist alliance because they broke through to the castle with provisions, the overall plight of the garrison changed very little. At best, the outcome of this small battle must be considered as inconclusive, a stalemate status quo ante meaning \"the way things were before.\"\nThe castle remained short of rations and ammunition after the battle. The siege by the Parliamentarians continued unimpeded. Six days later on 25 June, Sir Robert Talbot and Lady Fitzgerald agreed to terms and surrendered the castle. The garrison was allowed to march out with their weapons as free men.\nCitations\nReferences\n* – 1642 to 1660\n* – 1643 to 1660\n*\n*}}\n*}}\nGeneral references\n*\nSee also\n*Irish battles"
    }
  ]
}