{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Heiloo\n\nThe Battle of Heiloo () was a battle during the Friso-Hollandic Wars and the culmination of Count Floris V's first military expedition to West Frisia in 1272. The battle is described in Melis Stoke's Rijmkroniek van Holland and the chronicle of Johannes de Beke. Although the battle was won by Floris' forces, his goal of conquering West Frisia had not been achieved, and the count retreated shortly after.\nBackground\nFloris' father, William II of Holland, count of Holland and King of the Romans, led his army into battle against the Frisians in 1255 and 1256. From the town of Alkmaar, he repeatedly sought to subjugate the people of West Frisia. Eventually, in January 1256 he fought his adversaries at the Battle of Hoogwoud. The king, who was supposed to be crowned Emperor of the Romans by the Pope, was killed by the Frisians, and, after they discovered his identity, was buried under a fireplace, where he was to remain until 1282, when his body was found by Floris V.\nBefore that time, however, the new count launched multiple attacks on the Frisian people, in order to annex the territory and recover his father's remains. The first came in 1272, after the idea suddenly came to him (the text literally says \"Then [suddenly] came in his mind).\nBattle\nIn early August 1272, Floris V gathered his army in Alkmaar, intent on finally defeating the Frisians. With him were many nobles, since the count had just turned 18 and needed assistance leading his troops. Among these nobles were Dirk van Teylingen, Simon van Teylingen, and Wouter de Vriese, the bailiff of Kenemerland. He went north, and spent almost two weeks repairing and extending a dam along the Rekere river, which his father had worked on during his expedition to West Frisia. The count strengthened it \"with straw and hay\" according to Melis Stoke. During this repair, the workers were protected by archers. Despite this, the Frisians frequently attacked, and eventually drove back the army of Holland. There were many casualties among the nobles: \"Werenbolt uter Haghe and Aelbert his son, Diderijc van Raporst and Gherijt his brother, Jacob van Wassenaer, Beernt uter Haghe, Gherijt van Hermalen and Wouter die Vriese bailiff of Kenemerlant\" all died during the skirmishes. This caused the 'Hollanders' to flee back to the village of Heiloo, where, on St. Philibert's Day (20 August) they made a stand against the Frisians. Melis Stoke claimed over 800 Frisians fell in the ensuing battle, against 500 deaths in the count's ranks. However, these numbers are unfounded.\nFollowing the battle, both sides retreated. Even though Floris V won the Battle of Heiloo, he was forced to retreat due to the high casualties.\nAftermath\nThe count went back to his residence in The Hague. Due to the unpopular new laws implemented in Kennemerland and the expeditionary force treating the farmers badly, the population rose up against the rulers during the Kennemer Opstand, which would occupy the count for a considerable time.\nIt was only 10 years later, in 1282, that Floris V mounted the a second expedition to West Frisia and managed to recover his father's remains.\nReferences"
    }
  ]
}