{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Hlobane__disambig_1\n\n| map_type    = South Africa KwaZulu-Natal#South Africa\n| map_size    = 200\n| map_caption =\n| map_label   = Hlobane\n| result      = Zulu victory\n| combatant1  =  British Empire\n| combatant2  = Zulu Kingdom\n| commander1  = Evelyn Wood\n| commander2  =\n| strength1   = 675\n| strength2   = }}\n| casualties1 = }}}}\n| casualties2 =\n| campaignbox =\n}}\nThe Battle of Hlobane (28 March 1879) took place at Hlobane, near the modern town of Vryheid in KwaZulu-Natal, South Africa during the Anglo-Zulu War.\nBackground\nThe British commander Frederic Thesiger (Lord Chelmsford) intended to invade Zululand with three columns and converge on the Zulu capital of Ulundi (Ondini). No. 1 Column (Colonel Charles Pearson) on the coast was to begin its advance at the Lower Drift of the Tugela River. No. 3 Column (Lord Chelmsford) in the centre was to cross Rorke's Drift and advance  to the capital. No. 4 Column (Colonel Evelyn Wood) had to advance the shortest distance, about . Wood was to move slowly to enable No. 1 Column to catch up. No. 4 Column consisted of eight infantry companies from the 13th and 90th Light Infantry regiments, with about  four 7-pounder mountain guns of the 11th Battery, 7th Brigade (11/7) RA, roughly 200 cavalry of the Frontier Light Horse (FLH), the civilian followers of Piet Uys and Wood's irregulars, 300 African infantry along with ox-wagon transport and impedimenta, about 2,000 infantry and 200 cavalry all told.\nPrelude\nNo. 4 Column was to occupy the attention of those Zulus dwelling on the flat-topped mountains rising out of the plains of north-west Zululand. The distance of these Zulus from the capital, Ulundi, gave them a degree of independence from Cetshwayo, enabling the chiefs to withhold their warriors for local defence, rather than contributing to the main Zulu Army. Chelmsford required these Zulus to be distracted so that they would not interfere with the operations of No.&nbsp;3 Column during its advance to Isandlwana and onto Ulundi. On 17 January 1879, Wood advanced his column north-eastwards and a  (a defensive wagon circle) was established at Tinta's Kraal,  south of a chain of flat-topped mountains on 20 January. These were Zunguin, Hlobane and Ityentika, connected by a  (Afrikaans for a mountain pass) and running for  in a north-easterly direction.\nWhile the camp was being fortified, scouts investigating the mountains were attacked from Zunguin by about  At dawn the next day an attack was mounted on Zunguin and the Zulus fled to Hlobane, where Wood observed about  drilling that afternoon. An attack on Hlobane had begun on 24 January but after Wood learnt of the British defeat at the Battle of Isandlwana, this was called off. After falling back to Tinta's Kraal, Wood decided to move his column north-westwards to Kambula hill, about  due west of Zunguin. Their arrival on 31 January was met with a message from Chelmsford informing Wood that all orders were cancelled, he was now on his own with no expectation of reinforcements and he must be prepared to face the whole Zulu Army.\nKambula\nFebruary 1879 passed quietly, save for mounted patrols sent out daily to raid the kraals of Zulus harassing No. 5 Column across the eastern Transvaal border. At Kambula, a hexagonal laager was formed with wagons locked together; a separate kraal for the cattle was constructed on the edge of the southern face of the ridge. Trenches and earth parapets surrounded both and a stone-built redoubt was built on a rise just north of the kraal. A palisade blocked the  between the kraal and redoubt and four 7-pounders were positioned between the redoubt and the laager to cover the northern approaches. Two more guns in the redoubt covered the north-east. Wood received much needed reinforcements in the form of Transvaal Rangers, mounted troops, a troop of German settlers and five companies of the 80th Regiment of Foot.\nWood had hoped to detach the Zulus in the area from their allegiance to Cetshwayo, particularly uHamu kaNzibe, Cetshwayo's half-brother, who had always been friendly towards the British and at odds with the Zulu king. On 13 March, uHamu entered the camp with about 700 followers, requesting escorts to bring the rest of his people out of hiding. They were in caves near the headwaters of the Black Umfolozi,  to the east and only  from Ulundi. It was risky to escort large numbers to safety over this area but Wood considered the advantages made it worthwhile. An escort of  mounted troops and about 200 of uHamu's warriors returned to Kambula with another  Shortly afterwards, Wood received a request from Chelmsford to create a distraction to draw off some of the Zulu strength, while he tried to intervene in the Battle of Eshowe. Knowing from spies that an Impi was preparing to leave Ulundi, unite with the Zulus at Holbane and attack Kambula, Wood decided to attack Hlobane.\nBattle\nHlobane consisted of two plateaux, the lower and smaller of which rose to a height of about  at the eastern end of the  long col (nek) connecting it to Zunguin to the south-west. At the eastern end of this lower plateau the ground rose very steeply for another  up a narrow, boulder-strewn way, forming a series of giant steps, known as Devil's Pass, to the higher plateau. On the top of this plateau were about  and approximately  Zulu. Wood's plan was for mounted troops led by Lieutenant-Colonel Redvers Buller to scale the eastern track to the higher plateau, supported by rocket artillery and friendly Zulu to lift the cattle. A similar force, under Major R. A. Russell, would occupy the lower plateau.\nAt dawn on 27 March the forces departed, hampered by a thunderstorm and Zulu sniping by the light of lightning flashes. Buller's mounted troops reached the summit by  the following day and African infantry began herding cattle westwards. As Russell's troops occupied the lower plateau, Wood encountered a group of the Border Horse who had become detached from Buller's advance up the higher plateau. Wood ordered them to advance towards the firing on the upper plateau but the men, mostly English settlers from Transvaal, refused. Wood rode on with his small party, intending to follow Buller's track up to the summit and was eventually followed by the Border Horse. Coming under fire from caves, as had Buller's men, Wood was again defied by the Border Horse when he ordered them to clear the way forward. Five of Wood's escorts charged the caves; Wood's staff officer, Captain R. Campbell, and his political agent, Lloyd, were killed. The group moved westwards to join Russell on the lower plateau.\nAt  while Wood was riding along the southern flank of Hlobane, he spotted five large columns of Zulu to the south-east. This was the main Impi, which he had not expected to arrive for another day and was closing on the British fast, only  away. The Impi were already dispersing and Wood could see that they would block Buller's retreat from the upper plateau and then trap Russell. Even if Wood withdrew both groups, they would have to make a rapid retreat to Kambula to get there before the Zulu. Wood hurriedly sent a message to Russell, ordering him to move up to the nek but with the advantage of high ground, Russell had already seen the Impi, an hour and a half before Wood and sent a warning to Buller.\nBuller realised his predicament; turning back was impossible, the only option was to make for the lower plateau and rendezvous with Russell's force. Russell had moved his troops off the lower plateau to Intyentika Nek to support Buller's troops as they descended. When Wood's orders arrived, Russell and his officers took it that Wood wished for them to take up positions on another nek,  westwards, by Zunguin. Leaving a small number of troops, Russell's force departed in that direction, leaving Buller alone at Hlobane.\nBuller's troops could only reach the lower plateau through Devil's Pass. The dangerous traverse was the cause of much confusion among his troopers with their unsettled horses, which led to casualties. This danger was heightened by the abaQulusi, who after they saw the approaching Zulu army, became more confident and daring in their attacks on the withdrawing troops; the British had to fight their way through the pass. Despite the danger, the British were able to get off the plateau and onto the plains, where Buller ordered them to make for Kambula. The force was broken and disorganised, many horses had been lost the men were required to ride pillion to make it to Kambula but they eventually arrived. The Zulu Impi reached the plain shortly after the British had departed and followed them for , skirmishing on all sides.\nAftermath\nAnalysis\nThe Battle of Hlobane was a Zulu victory; the Border Horse, trapped and unable to retreat to Kambula, was annihilated and the battalions of Zulu helping the British decamped. Wood was confident that the Zulu Impi would attack the defensive works at Kambula as he hoped and he expected victory. The following day, at the Battle of Kambula, the Zulu army was routed.\nCasualties\nFifteen officers and  soldiers were killed, eight were wounded and  soldiers were killed. The loss in horses gravely weakened the mobility of the survivors.  Unusually, Trooper Ernest Grandier of Weatherley's Border Horse was captured alive by the Zulu in the aftermath of the battle and taken to Ulundi.  He was released unharmed by Zulu king Cetshwayo and reached British lines near Kambula on 16 April.\nVictoria Cross\nColonel Buller received the Victoria Cross for his conspicuous gallantry and leadership, as did Lieutenant Henry Lysons and Private Edmund Fowler for charging the caves that morning. Major William Leet and Lieutenant Edward Browne were awarded the VC for going back to save the lives of wounded men at the descent of Devil's Pass.\nSee also\n* Military history of South Africa\nNotes\nFootnotes\nReferences\n*\n*\n*\n*\nFurther reading\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\nNovels\n*\n*\nExternal links\n* [https://web.archive.org/web/20050312110205/http://www.anglozuluwar.co.za/battle-of-hlobane.htm anglozuluwar.co.za]\n* [https://web.archive.org/web/20070930220939/http://www.historynet.com/historical_conflicts/3028456.html Anglo-Zulu War: Battle of Hlobane]\n* [https://web.archive.org/web/20071024153451/http://www.travellersimpressions.com/process/articlepage.php?storycode=rg0006 Travellers Impressions]\n* [http://www.rorkesdriftvc.com/hlobane.htm Horror at the Devil's Pass – The Battle of Hlobane, 28 March 1879]"
    }
  ]
}