{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Girolata\n\nSpanish Empire\n| combatant2        =  Ottoman Empire\n| commander1        =  Giannettino Doria Berenguer de Requesens\n| commander2        =  Dragut\n| strength1         = 21 galleys\n| strength2         = 11 galleys\n| casualties1       = Minor\n| casualties2       = 11 galleys captured, 1,200 prisoners, 1,200 galley slaves freed\n| campaignbox       =\n}}\nThe Battle of Girolata was a naval action fought between Genoese, Spanish, and Ottoman ships on 15 June 1540 in the Gulf of Girolata, on the west coast of the island of Corsica, amidst the war between Charles V of Spain and Suleiman the Magnificent. A Spanish squadron of 21 galleys led by the Genoese Gianettino Doria and the Spaniard Berenguer de Requesens surprised and defeated an Ottoman squadron of 11 galleys, anchored at Girolata, led by the Ottoman admiral Dragut.\nThe commander of the Ottoman Navy, Hayreddin Barbarossa, had committed Dragut to raid the Italian coast after his victories in the Adriatic Sea the year before. As the crews of the Ottoman warships were ashore, distributing the booty from recent raids, the Spanish-Genoese fleet easily overtook them, taking all 11 Ottoman galleys and making 1,200 prisoners, among them Dragut, who was carried to Genoa and put, together with his captains, to row in Andrea Doria's galleys.\nBackground\nIn 1538 the Ottoman fleet, led by Hayreddin Barbarossa, dealt important blows to the Spanish and Italian Holy League assembled by Pope Paul III by defeating its fleet at the Battle of Preveza, off the Epirote coast, and by taking Castelnuovo. As in 1540, Suleiman the Magnificent was preparing a land campaign in Hungary, the Ottoman navy was however short of means and it could not take the field. Barbarossa then detached to the Western Mediterranean waters the leader of his scout squadron, Turgut Reis, known as Dragut, with the task of raiding the Italian coast and disturbing Spanish shipping in a privateering mission. Dragut started his cruise by capturing five Venetian galleys off the island of Paxos, near Corfu. The Venetians could not retaliate, as they signed a peace treaty with the Sultan shortly afterwards.\n(1555). Galleria di Palazzo Bianco, Genoa.]]\nIn response to the Ottoman threat, Charles V's grand admiral Andrea Doria gathered a fleet of roughly 80 galleys at the harbour of Messina to clear the Ottoman privateers from the Western Mediterranean, and following the example of Pompey in his war against the Cilician pirates, he divided his ships into five squadrons which he assigned to patrol different regions. Andrea Doria himself sailed from Messina to Tunis in late April at the head of 55 galleys, expecting to surprise Dragut at his station off Djerba. However, Barbarossa's lieutenant had moved faster. The Genoese admiral had detached his relative Erasmo Doria to guard the Balearic Islands in command of 10 galleys, his nephew Gianettino Doria and Berenguer de Requesens to patrol off Corsica and Sardinia with 21 galleys, Fadrique de Toledo Osorio to defend the Gulf of Naples with 11, and the Count of Anguillara, helped by the Knights of Malta, to protect Sicily with 17.\nIt was Gianettino's and Requesens' squadron that found the trail of Dragut's galleys. The Ottoman squadron was first reportedly seen off Bonifacio and later, when Dragut attacked the island of Capraia, the cannonade was heard aboard the Genoese and Spanish galleys. Fishermen who had fled from the Ottomans warned Doria and Requesens that Dragut had sailed to Cape Corso and, later, that his squadron was anchored at the Gulf of Girolata.\nBattle\nThe Ottoman squadron had set anchor at the Gulf of Girolata to distribute the booty from the recent raid. Dragut had chosen the place because it was deserted and far from the common sailing routes. As such, he left no ship to guard the entrance of the gulf. On arriving in the waters nearby, Gianettino Doria sent his relative Giorgio Doria into the gulf with 6 galleys and a small rowing frigate in order to identify the anchored galleys. Accounts of the battle's course differ. According to Cesáreo Fernández Duro and Edmond Jurien de La Gravière, the Ottoman seamen and soldiers were ashore, sleeping under the trees or having a meal, when the arrival of the Spanish galleys took them by surprise. According to De La Gravière, 600 Ottomans fled to the surrounding mountains before the battle actually started and Dragut barely had time to embark and fire a single volley before the Genoese and Spanish boarded his flagship and his other galleys. At the first shots, many of his men, whether Turks, Moors, or European renegades, jumped overboard to escape inland.\nAlberto Guglielmotti gives a more detailed account of the battle. He states that Dragut had time to embark his crews on seeing the 7 vessels sent ahead by Doria, and that, leaving behind 2 galleys to guard the booty, he sailed to engage Giorgio Doria's force with his 9 remaining galleys. Expecting to fight with superior numbers, Dragut sailed into the ambush laid by Doria and Requesens, whose remaining 15 galleys appeared from the west taking advantage of the windward. Dragut then tried to escape by turning around his ships, but as the Spanish galleys came under his stern, he decided to try to break through them. Then, however, a single shot from Gianettino's galley bow gun inflicted serious damage to his flagship that she nearly sank. Losing hope about the prospect of escaping, most of the Ottoman seamen and soldiers jumped overboard to gain the beach and save themselves inland.\nAftermath\nThe Spanish fleet captured all 11 Ottoman galleys, two of which were the Venetian Moceniga and Bibiena, which the Ottomans had captured at the Battle of Preveza. They also took 1,200 Ottoman prisoners and freed 1,200 Christian galley slaves. Dragut was among the Ottoman prisoners. Furious at having been captured by a young man such as Gianettino Doria, he insulted his captor, who in turn beat him in revenge. Dragut was carried to Genoa and reduced to a galley slave. There, according to the 16th-century French historian Pierre de Bourdeille, seigneur de Brantôme, on finding Barbarossa's former lieutenant rowing in a galley, Jean Parisot de Valette, the future Grand-Master of the Knights Hospitaller, said to him: \"Señor Dragut, usanza de guerra!\" (\"Mr. Dragut, custom of war\"), to which Dragut replied: \"Y mudanza de fortuna\" (\"And change of fortune\"). At the beginning of 1541 Barbarossa ransomed his lieutenant in exchange for 3,500 ducats. Later, deemed a mistake, Doria granted Dragut his freedom in the hope of winning favour if one of his nephews fell into Ottoman hands.\nTaking advantage of Dragut's defeat, Andrea Doria sailed from Messina that summer leading 51 galleys and more than 30 galliots and fustas, aboard which there were 14 companies of Spanish infantry led by García de Toledo, Spanish Viceroy of Sicily. They attacked the Ottoman positions at Tunis, seizing the strongholds of Monastir, Sousse, Hammamet, and Kelibia, which they returned to the Hafsid King Muhammad V. Barbarossa's privateering campaign was further checked when, on 1 October, the Turkish privateers were defeated again by Spanish ships at the Battle of Alborán, in the waters east of the Strait of Gibraltar.\nReferences"
    }
  ]
}