{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Bydgoszcz\n\n| result            = Polish–Lithuanian victory\n| combatant1        =  Poland–Lithuania\n| combatant2        =  Prussia\n| commander1        =  Jan Henryk Dąbrowski\n| commander2        =   (DOW)  Col. Wittel Mjr. Wedelstadtand\n| strength1         = 4,000 men and 16 guns5,000 local insurgents\n| strength2         = Less than the Polish side\n| casualties1       = 25 dead and 30 wounded\n| casualties2       = 100 killed50 woundedAlmost 400 taken prisoner\n}}\ninsurrection]]\nBattle of Bydgoszcz took place on 2 October 1794 during the Kościuszko Uprising. It involved Polish–Lithuanian forces led by Jan Henryk Dąbrowski against Prussia led by . It ended with a Polish–Lithuanian victory.\nPrelude\nAfter the defeat in the Polish–Russian War of 1792, the Second Partition of Poland took place.\nMany Polish commanders were dissatisfied with the capitulation, such as Tadeusz Kościuszko and Prince Józef Poniatowski, criticizing the king's decision and many, including Kościuszko, resigned their commission shortly afterward.\nOn 12 March 1794, General Antoni Madaliński, the commander of 1st Greater Polish National Cavalry Brigade (1,500 men) decided to disobey the order to demobilize, advancing his troops from Ostrołęka to Kraków. This sparked an outbreak of riots against Russian forces throughout the country. The Russian garrison of Kraków was ordered to leave the city and confront Madalinski, which left Kraków undefended and foiled Kosciuszko's plan to seize their weapons.\nThis led to the announcement on 24 March 1794 by Tadeusz Kościuszko, a speech in the Kraków town square where he assumed the powers of the Commander in Chief of all of the Polish forces.\nAfter taking over Inowrocław, the insurgents headed towards Bydgoszcz but got defeated on the 14th of September.\nBattle\nAfter a march through the woods, Dąbrowski's corps reached Bydgoszcz on the 2nd of October. His army size originally consisted of 4,000 men and 16 guns, although merged with 5,000 local insurgents. Székely was afraid that the Poles, who had a decisive numerical advantage, could not only inflict a defeat on him, but also make it completely impossible to retreat.\nHe took a position near Przedmieście Gdańsk, entrusting defense of the left bank of Bydgoszcz to three townspeople's companies, weakly trained and not eager to fight the Poles. Székely and his corps tried to intimidate Dąbrowski by marching along the left bank fording and pretending to want to cross near Siersk, although this was unsuccessful. ]]\nEven after the failure, Székely showed great confidence at the beginning of the fight and nijr. Zabłocki, whom Dąbrowski sent to him, demanding the surrender of the city, he threatened to be shot. When Székely saw that the Poles were not worried about his march, he returned to the Gdańsk Bridge, wanting to help Prussian troops fighting on the right bank of the river.\nWhile trying to cross the bridge, he was mortally wounded in both legs and taken prisoner by the same mjr, Zabłocki. The city was then taken by Polish insurgents.\nAftermath\nThe Polish command provided Székely with careful care, but he died two days later.\nIn the fighting for Bydgoszcz, 100 Prussian soldiers were killed, 50 wounded, and almost 400 taken prisoner. Col. Wittell and mjr. Wedelstadtand died on the battlefield. When it comes to Prussian commanders, only Colonel Hinrichs succeeded in escape along with part of Székely's corps. Polish losses amounted to only 25 dead and 30 wounded.\nRight after Polish insurgents took over Bydgoszcz, Fordon and Solec Kujawski also fell to the Poles. Colonel Hinrichs took back Bydgoszcz the same year on the 25th of October.\nSee also\n* Tarnogród Confederation\n* War of the Bar Confederation (First Partition of Poland)\n* Partitions of Poland\nReferences\nBibliography\n*"
    }
  ]
}