{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Al-Rahiba__disambig_1\n\n| combatant2        =  Senussi\n| commander1        =  Major Passi\n| commander2        =  Omar al-Mukhtar\n| strength1         = 12 officers744 men\n| strength2         = 350 men\n| casualties1       =  6 officers killed340 men killed\n| casualties2       = Unknown\n| notes             =\n}}\nThe Battle of Al-Rahiba was a military engagement between the Senussi order led by Omar al-Mukhtar and the Italians. The Senussi won a resounding victory against the Italians.\nBattle\nAfter the battles the Senussis had in Jabal al Akhdar led by Omar al-Mukhtar in January 1927, the Senussis then went to Jabal al Ubaid territories, as it provided a place for gatherings and reorganizing their forces in these fertile lands. To attack the Italians there, the Senussis had a force of only 350 men, according to Italian reports. The Italians feared that this force might encourage the tribes subjugated by the Italians, which would put them in a dangerous situation. This is when the Italians decided to strike.\nAn Italian force of 12 officers and 744 men led by Major Passi marched starting at 9:00&nbsp;p.m. on March 27 towards Jardas al-ʽAbid , arriving at 6:00&nbsp;a.m. the next day. They went for the thick forests, where they met resistance from the Senussis. As the march continued, more attacks increased until they arrived at Al-Rahiba Depression, where they fought with the Senussis. The Italians succeeded in capturing some high positions; however, the Senussis counter-attacked in front while also surrounding them.\nThe Italian leader saw that they could no longer achieve their goal and ordered a retreat. The Senussis chased them and exploited the disunity happening among the Italians, along with their knowledge of the territory, which allowed them to circle the Italians and separate them, which killed many of the Italians. Due to underestimating the Senussi numbers, the Italians lost 6 officers and 340 lives.\nThis defeat shook the center and prestige of the Italians and prompted Governor Attilio Teruzzi to initiate several military and political measures in an attempt to strike the resistance movement.\nSee also\n*Battle of Gasr Bu Hadi\n*Battle of Safsaf\n*Battle of Wadi Marsit\n*Battle of Bir Tabraz\n*Battle of Bir Bilal\n* First Battle of Sidi Abu Arqub\nReferences"
    }
  ]
}