{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Contreras__disambig_1\n\n| combatant2        =\n| commander1        =  Winfield Scott\n| commander2        =  Gabriel Valencia Agustín Jerónimo de Iturbide y Huarte\n| strength1         = 10,738\n| strength2         = 4,500\n| casualties1       = ~300 casualties\n| casualties2       = ~700 killed  1,225 wounded  ~850 captured  22 artillery pieces lost 843 captured\n}}\nThe Battle of Contreras, also known as the Battle of Padierna, took place on 19–20 August 1847, in one of the final encounters of the Mexican–American War, as invading U.S. forces under Winfield Scott approached the Mexican capital. American forces surprised and then routed the Mexican forces of General Gabriel Valencia, who had disobeyed General Antonio López de Santa Anna's orders for his forces' placement. Although the battle was an overwhelming victory for U.S. forces, there are few depictions of it in contemporary popular prints. The armies re-engaged the next day in the Battle of Churubusco.\nBackground\nGeneral Gabriel Valencia's army of the north was part of the forces that fought at the Battle of Buena Vista in February 1847, in which Santa Anna retreated before giving a crushing blow to the forces of Zachary Taylor.  The Mexican forces were then divided in two, with one sent to Cerro Gordo and the other to San Luis Potosí. General Valencia was given the command of the forces in San Luis, replacing General Mora y Villamil.  In April 1847 Battle of Cerro Gordo, General Winfield Scott's victorious forces clearly threatened the capital, and Valencia's forces were ordered to Mexico City. Most of Valencia's men were from Central Mexico, so the march southward brought them to their home territory. News that Scott's forces were marching from Puebla toward the capital was said to cheer Valencia's forces, who expected to be victorious.  Valencia's troops marched rapidly south, from Texcoco northeast of the capital to Guadalupe Hidalgo, and   traversed Mexico City on the way to their position south of the city in San Angel. They arrived in San Angel on August 17. Valencia expected the U.S. forces to attack San Antonio and anticipated his troops would move behind them to help bring about the victory. On 18 August, he placed a battery of artillery, overseen by General Mejía.  Santa Anna did not concur with Valencia's positioning of his forces, and as Supreme Commander orders him to withdraw to Coyoacan and Churubusco. Valencia disobeyed Santa Anna's order and his disobedience \"formed afterward his indictment\" [in the defeat].  Santa Anna's plan for a coordinated defense of the capital fell apart when Valencia disobeyed his orders, essentially not recognizing Santa Anna as the commander of Mexican forces. Santa Anna and Valencia had a personal rivalry, one of many in the officer corps of the military and a product of years of coups and political rivalries.\nThe battle was the first one in the immediate environs of the capital, as part of General Winfield Scott's invasion of Mexico's heartland and drive to the capital.  Leaving Puebla on 7 August for his march on Mexico City, the U.S. army under Scott, reached Ayotla and Chalco on 11 August with the divisions of David E. Twiggs, William J. Worth, John A. Quitman, and Gideon Johnson Pillow. Scott moved on the south side of Lake Chalco on 15 August, advancing to San Agustín. Rather than moving northward that would have taken them to the choke point at El Peñon, which Mexican General Antonio López de Santa Anna had fortified, Scott chose a circuitous southerly route to attack Mexico City. Santa Anna understood Scott's flanking action, and sought to block alternative routes into the capital.  Santa Anna placed troops under his own command at the pueblo of San Antonio and commanded that the 7,000 men of General Gabriel Valencia's Army of the North, place itself at another strategic point at San Ángel, near Contreras by 17 August.\nBattle\nGeneral Valencia had not yet faced U.S. troops in battle, and did not consider the spot that Santa Anna had ordered him to at San Ángel to be a defensible position.  He disobeyed orders and moved his infantry and cannons to just south of Padierna. Valencia had not expected the U.S. forces to be able to cross the lava field at El Pedregal, considering it impassable terrain and a natural defense. Intending to flank San Antonio, Scott ordered Capt. Robert E. Lee to build a road across El Pedregal so he could enfilade San Antonio to the north of San Agustin. On the morning of 19 August, Lee's men met Mexican pickets, which Major William W. Loring's companies cleared at Padierna, only to come under fire from Valencia's 22 pieces of artillery west of El Pedregal and north of Contreras. When told of the American movement across El Pedregal, Valencia exclaimed, \"No! No! You're dreaming, man.\" The U.S. forces took heavy casualties and Valencia thought at this point he was winning the encounter.\nGideon Pillow then brought in his artillery, under the command of Capt. John B. Magruder, Lt. Franklin D. Callender, and Lt. Jesse L. Reno.   In the meantime Col. Truman B. Ransom's 9th Infantry and Lt. Col. Milledge L. Bonham's 12th moved forward on the American right to within 200 yards of Valencia's camp by nightfall.  Pillow also sent General Bennet Riley's brigade, supported by General George Cadwalader, to seize San Jerónimo just north of Valencia's camp, while Persifor Smith's brigade, supported by General Franklin Pierce, struck Valencia from the front.  Scott sent General James Shields brigade to Pillow who sent it after Cadwalader.\nSanta Anna was angered by Valencia's disobedience, but nonetheless sought to save his army. He moved with Brigadier General Francisco Pérez's 3,000 man brigade to San Ángel, just north of the fighting.  Night brought a cold rain and the end of fighting for the day. The American forces had positioned themselves to block Santa Anna's approach to Valencia's army. Santa Anna wanted to fall back in an orderly fashion and ordered Valencia to abandon his artillery and retreat with his men and their smaller weapons.  Valencia refused to obey the order.\nDuring the night, Lt. Zealous Bates Tower discovered a ravine running southwest from San Jerónimo to the rear of Valencia's camp, which Smith planned to use for a dawn attack the next morning.  Lee volunteered to cross the Pedregal during the night so Scott could coordinate a diversion using Twiggs.  Twiggs did so at 5 AM, just as Smith struck Valencia from the rear.  Valencia did not put sentries along in the ravines along the path the American forces took, perhaps because of worries of desertion. When the attack came, Mexican forces resisted fiercely, but within seventeen minutes, Valencia and his force fled to San Ángel. Two of the cannons the American forces captured had been lost by Captain John P. O'Brien in bloody fighting at the Battle of Buena Vista in February 1847. The U.S. forces captured 22 pieces of artillery and four generals. The contemporary newspaper dispatch by George Wilkins Kendall names the generals: Miguel Blanco de Estrada, Manuel García Pueblita, N. Mendoza, and former President of Mexico and brigadier general José Mariano Salas, called \"the notorious\" for organizing the Guerrillas of Vengeance against the Americans. \"Valencia's repeated refusal to follow orders had led to the dissolution of Mexico's most experienced and disciplined regiments and exposed the rest of the army to the same possibility.\"\nWith the rout of Valencia, Twiggs' army was in full pursuit as they retreated toward Mexico City. Santa Anna had to fall to his second line of defense at fortifications he has created at the Churubusco River.  He ordered Major  General Nicolás Bravo at San Antonio and Brigadier General Antonio Gaona at Mexicalzingo both to fall back to Churubusco, where soon the Battle of Churubusco would commence.\nScott commended Lee, who made three-night crossings across the Pedregal, stating it was \"the greatest feat of physical and moral courage performed by any individual\" during the campaign, and awarded Lee with a brevet rank of lieutenant colonel.\n843 Mexicans were taken prisoner. No figures are available for the killed and wounded at Contreras but Winfield Scott estimated the Mexican casualties on August 20, at Contreras and Churubusco, at 4,297 killed and wounded; in addition to 2,637 taken prisoner.\nSanta Anna issued his version of events of the battle on 23 August 1847, which appeared in English translation in the New Orleans Daily Picayune on 9 September. In it, he claimed that \"it would have been equal to a defeat to have kept the troops in the open field.\"\nMemorialization of the battle\nDespite the great victory at Contreras, there are few contemporaneous prints of the action. The most famous and easily accessible is by Carl Nebel. His image of the battle is one of twelve in all as illustrations for the 1851 publication The War between the United States and Mexico Illustrated, with journalist George Wilkins Kendall.  Nebel's depiction is of the second day of battle, and is a generally accurate rendering of the topography. According to Kendall's written text, the image's focus is on the assault of Smith, Riley and Cadwalader.\nOn 20 August 1847, General Scott made a speech from which the first sixteen words have become important to the Regiment of Mounted Riflemen. The regiment was bloodied and exhausted from the fierce fighting at Contreras, but even so, each man stood at attention as Scott approached. The General removed his hat, bowed low, and said: \"Brave Rifles! Veterans! You have been baptized in fire and blood and have come out steel!\" This accolade is emblazoned on the regimental coat of arms, and is the source of the regimental motto, \"Blood and Steel\" and nickname, \"Brave Rifles.\"\nPartial Mexican Order of Battle\nDivision of the North – General of division Gabriel Valencia\n* Engineers – Gen. José M. González de Mendoza\n* Padierna rancho – Capt. Solís – pickets of infantry and cavalry\n* 1st Line Infantry (Col? Nicolás Mendoza)\n** left – San Luis Potosí Battalion\n** right – Infantry Brigade – Lt. Col. Cabrera-Celaya, Guanajuato and Querétaro Auxiliaries and Activos\n** Artillery reserve – Gen. F. Mejía\n* second line – 10th and 12th Line, Fijo of Mexico and Tampico Guarda Costa Infantry\n* Anzaldo – Reserves – Gen. Salas – Sappers, Mixto de Santa Ana and Aguascalientes Infantry; 2nd, 3rd, and 8th Line Cavalry and Guanajuato Activos\n** right – 7th and San Luis Cavalry\n** bridge – Torrejon Cavalry Brigade, Fabriquita-Romero Brigade\nReferences\nFurther reading\n* Alcaraz, Ramón et al. The Other Side, Or Notes for the History of the War Between Mexico and the United States, translation of Apuntes Para la Historia de la Guerra entre Mexico y los Estados Unidos, translated by Albert C. Ramsey. New York: John Wiley 1850.\n* Frías, Heriberto. La batalla de Padierna\n* Nevin, David (editor). The Mexican War (1978)\n* Prieto, Guillermo. Apuntes históricos\nExternal links\n* [https://web.archive.org/web/20050307102300/http://www.dmwv.org/mexwar/documents/candc.htm Gen. Winfield Scott's official report of the battle]\n* [http://library.uta.edu/usmexicowar/ \"A Continent Divided: The U.S. - Mexico War\"], Center for Greater Southwestern Studies, the University of Texas at Arlington"
    }
  ]
}