{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Kousséri__disambig_1\n\nFranceKingdom of BaguirmiKanem–Bornu Empire (al-Kanemi loyalists)\n| commander1        = Rabih az-Zubayr\n| commander2        =  Major Lamy Émile Gentil Paul Joalland René ReibellSanda Kura\n| strength1         = 10,000 men(French sources)\n| strength2         = 700 French soldiers800 Baguirmians\n| casualties1       = 1,000–1,500 dead  3,000 wounded(Including civilians)\n| casualties2       = 28 dead  75 wounded\n}}\nThe battle of Kousséri was a major engagement fought between France and the forces of the warlord Rabih az-Zubayr in the Rabih War. The conflict originated in French plans to occupy the Chari-Baguirmi region in modern-day Chad. In 1899&ndash;1900, the French organized three armed columns, one proceeding north from Congo, one east from Niger and another south from Algeria. The objective was to link all French possessions in Western Africa, and this was achieved on April 21, 1900, on the right bank of the Chari in what is now Chad opposite Kousséri, in what today is northern Cameroon.\nPrelude\nIn 1899, Sudanese warlord Rabih az-Zubayr could field some 10,000 infantry and cavalry, all provided with rifles (except for 400 rifles, these were mostly obsolete), plus a great number of auxiliary troops equipped with lances or bows. His forces held fortified garrisons at Baggara and Karnak Logone.\nIn 1899, Rabih received in Dikoa the French representative Ferdinand de Béhagle. The talks between them degenerated, and Béhagle was arrested. On July 17, 1899, Lieutenant Bretonnet, whose force was then sent by France against Rabih, was killed with most of his men at Togbao at the edge of the Chari River, present-day Sarh. Rabih gained three cannons from this victory (which the French later retook at Kousséri) and ordered his son Fadlallah, whom he had left in Dikoa, to hang Béhagle.\nIn response, a French column proceeding from Gabon and led by Émile Gentil, supported by the steamboat Leon Blot, confronted Rabih at Kouno at the end of the year.  The French were pushed back, suffering losses, but regrouped and continued to the town of Kousséri. Here, they linked up with the Lamy column (proceeding from Algeria) and the former Voulet–Chanoine Mission, proceeding from Niger. This column was now commanded by Joalland-Meynier, after Voulet and Chanoine murdered the French officer sent to relieve them, when news reached the European press of the mission's brutality to local people. Lamy took command of the united forces.\nBattle\nThe final showdown between Rabih and the French took place on April 22, 1900. The French forces consisted of 700 troops, plus the 600 riflemen and 200 cavalry provided by the allied Baguirmians. Leaving Kousséri, the French in three columns attacked Rabih's camp, and in the ensuing battle, the French commander Major Amédée-François Lamy was killed. However, Rabih's forces were overwhelmed and, while attempting to flee across the Chari River, Rabih was shot in the head by a skirmisher from the Central Africa mission. Hearing there was a bonus for Rabih's corpse, the skirmisher returned to the field and brought back Rabih's head and right hand.\nThe casualties amounted to 28 dead and 75 wounded on the French side; 1,000 to 1,500 dead and more than 3,000 wounded on Rabah's side, including women and children accompanying the army.\nSignificance\nWith the defeat of Rabih's forces, the French ensured their control over most of Chad, which became part of the French colonial empire.  The march of the infamous Voulet–Chanoine Mission through modern Burkina Faso and Niger brought nominal protectorate status to these areas, and forces from Algeria showed that a cross-Saharan conquest and administration was possible.  Gentile's mission from Gabon, added to these, helped define the practical borders of French and British imperial control, and linked the three most stable French colonial possessions in Africa  (Senegal and the Upper Niger River Valley, Gabon and Congo-Brazzaville, and Algeria). In French colonial histories, the battle of Kousséri is usually seen as the ending point of the Scramble for Africa and the beginning of the \"pacification\" phase of French West and Equatorial Africa.\nGallery\nFile:Rabih az-Zubayr, decapitated head.jpg|Rabih's head, a battlefield trophy after the fighting.\nFile:Drapeau de Rabeh.jpg|Rabih's battle flags, captured by the French after the battle.\nFile:Canon Rabah 1b.jpg|One of Rabih's cannons captured by the French.\nReferences\n* Byron Farwell. The Encyclopedia of Nineteenth-century Land Warfare. W. W. Norton & Company (2001)  pp.&nbsp;466–467\n* Robin Hallett . Africa Since 1875: A Modern History. University of Michigan (1974)  p.&nbsp;444\n* Victor T. Le Vine, Roger P. Nye. Historical Dictionary of Cameroon. Scarecrow Press (1974)\n* James Stuart Olson, Robert Shadle, Ross Marlay, William Ratliff, Joseph M. Rowe. Historical Dictionary of European Imperialism. Greenwood Publishing (1991)  pp.&nbsp;123–124"
    }
  ]
}