{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Rozgony__disambig_1\n\n| map_type    = Slovakia#Europe without the extreme north\n| map_relief  = yes\n| map_size    =\n| map_marksize =\n| map_caption =\n| map_label   =\n| map_mark =\n| casus       =\n| territory   =\n|result=Victory of Charles I of Hungary,weakening of the magnates\n|combatant1= Aba family ruling northern part of Eastern HungaryMatthew Csák ruling Upper Hungary\n|combatant2=\n|commander1= Nicholas Aba † David Aba †Aba the Great †Demetrius Balassa †\n|commander2=King Charles Robert\n|strength1=\n|strength2=\n}}\nThe Battle of Rozgony or Battle of Rozhanovce was fought between King Charles Robert of Hungary and the family of Palatine Amade Aba on 15 June 1312, on the Rozgony (today Rozhanovce) field. Chronicon Pictum described it as the \"most cruel battle since the Mongol invasion of Europe\". Despite many casualties on the King's side, his decisive victory brought an end to the Aba family's rule over the eastern Kingdom of Hungary, weakened his major domestic opponent Máté Csák III, and ultimately secured power for Charles Robert of Hungary.\nBackground\nAfter the senior line of the Árpád dynasty died out in 1301, the succession to the throne of the Kingdom of Hungary became contested by several foreign monarchs and other runners-up. One of them was Charles Robert of Anjou, the Pope's champion. Over several years Charles drove his foreign opponents out of the country and installed himself on the Hungarian throne. At that time central power was weakened in Hungary, and the country was ruled by local warlords lording over smaller principalities and dukedoms. However, his rule remained nominal in many parts of the Kingdom because several powerful magnates, local dukes, and princes still did not recognize him as the supreme king. Initially, Charles's chief adversary was Máté Csák, who controlled several counties in western and northern parts of the Hungary. However, eventually he allied himself with the Aba family, which ruled the eastern Hungarian Kingdom.\nIn 1312, Charles besieged Sáros Castle, (now part of Slovakia - Šariš Castle) controlled by the Abas. After the Abas received additional reinforcement from Máté Csák (according to Chronicon Pictum almost Máté's entire force as well as 1,700 mercenary spearmen), Charles Robert of Anjou was forced to retreat to the loyal Szepes county (today the region of Spiš), whose Saxon inhabitants subsequently reinforced his own troops. The Abas benefited from the retreat. They decided to use the gathered opposition forces to attack the town of Kassa (today Košice) because of its strategic importance, and partially due to the fact that just few months before Charles had Amadeus Aba assassinated by Kassa's German colonists. Charles marched on Kassa and engaged his adversaries.\nBattle\n]]\nThe opposition forces abandoned the siege of Kassa and positioned their troops on a hill near the Tarca (Torysa River). Charles Robert of Hungary was forced to position his troops in flat agricultural land under that hill. Although the numbers are uncertain, the king's army consisted of his own men, an Italian unit of Knights Hospitaller, and a 1,000-men strong infantry unit of Zipser Saxons. Because of contradicting versions in contemporary chronicles, it is not clear to what extent the Aba family was helped by Máté Csák's forces.\nThe battle commenced when the rebels made a surprise attack during or just after the Mass in the king's camp. A bloody mêlée followed, causing heavy casualties among knights on both sides. At one point, even the king's battle standard was lost and Charles himself had to fight under the standard of the Knights Hospitaller. In the crucial moment of the battle, a reinforcement from Kassa came and saved the king's cause. The rebel army, after it lost its commanders in the battle, was routed.\nAftermath\nSome of the key leaders of the Aba (family) perished in the battle and part of their domain was divided between the King and his loyal followers. The loss of the key ally was also an important blow to Máté Csák. Although he managed to control much of his territories until his death in 1321, his power started to decline just after the battle and he could never again launch any major offensive against the king.\nThe immediate consequence was that Charles Robert of Hungary gained control over the northeastern part of the country. But the long-term consequences of the victory were even more important. The battle drastically reduced magnates' opposition against him. The King extended his power base and prestige. The position of Charles Robert as King of Hungary was now secured militarily and resistance against his rule came to its end. However, the Angevin rule over Hungary lasted only 74 years and the Abas continued to play an important role in Hungary even during the Angevin administration.\nReferences\nFurther reading\n* Chronicon pictum, Marci de Kalt, Chronica de gestis Hungarorum,\nExternal links\nOfficial Websites\n* [http://www.rozgony.com The Battle of Rozgony]"
    }
  ]
}