{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Ashbourne\n\n| place             = Ashbourne, County Meath\n| territory         =\n| result            = Volunteer victory\n| combatant1        = Irish Volunteers\n| combatant2        = Royal Irish Constabulary\n| commander1        =\n| commander2        = }}\n| strength1         = 35-45 Volunteers\n| strength2         = 74 RIC Officers\n| casualties1       =\n| casualties2       =\n| casualties3       =\n| notes             =\n}}\nThe Battle of Ashbourne took place, near Ashbourne, County Meath, during the Easter Rising in Ireland in 1916. The Rising, also known as the Easter Rebellion, was an armed insurrection in Ireland during Easter Week in April 1916. The Rising was launched by Irish republicans against British rule in Ireland with the aim of establishing an independent Irish Republic. It was the first armed conflict of the Irish revolutionary period. The Battle of Ashbourne would be the only significant conflict to occur outside Dublin.\nPrelude\nIn north County Dublin, about 60 Volunteers mobilised near Swords. They belonged to the 5th Battalion of the Dublin Brigade (also known as the Fingal Battalion), and were led by Thomas Ashe and his second in command, Richard Mulcahy. Unlike the rebels elsewhere, the Fingal Battalion successfully employed guerrilla tactics. They set up camp and Ashe split the battalion into four sections: three would undertake operations while the fourth was kept in reserve, guarding camp and foraging for food. The Volunteers moved against the Royal Irish Constabulary (RIC) barracks in Swords, Donabate and Garristown, forcing the RIC to surrender and seizing all the weapons. They also damaged railway lines and cut telegraph wires. The railway line at Blanchardstown was bombed to prevent a troop train from reaching Dublin. This derailed a cattle train, which had been sent ahead of the troop train.\nBattle\nOn Friday, about 35 Fingal Volunteers surrounded the Ashbourne RIC barracks and called on it to surrender, but the RIC responded with a volley of gunfire. A firefight followed, and the RIC surrendered after the Volunteers attacked the building with a homemade grenade. Before the surrender could be taken, up to sixty RIC men arrived in a convoy, sparking a five-hour gun battle, in which 14 RIC men were killed and 18 wounded. Two Volunteers were also killed and five wounded, and a civilian was fatally shot. The RIC surrendered and were disarmed. Ashe let them go after warning them not to fight against the Irish Republic again.\nAftermath\nAshe's men camped at Kilsalaghan near Dublin until they received orders to surrender on Saturday. The Fingal Battalion's tactics during the Rising foreshadowed those of the IRA during the War of Independence that followed.\nVolunteer contingents also mobilised nearby in counties Meath and Louth but proved unable to link up with the North Dublin unit until after it had surrendered. In County Louth, Volunteers shot dead an RIC man near the village of Castlebellingham on 24 April, in an incident in which 15 RIC men were also taken prisoner.\nCommemoration\nThen President of Ireland, Seán T. O'Kelly, unveiled a memorial at Rath Cross Roads, Ashbourne, on Easter Sunday, 26 April 1959 to commemorate the Battle of Ashbourne. The story was covered on the front page of the Irish Times the next day. The memorial, designed by Con O'Reilly and Peter Grant, commemorates the battle and John Crenigan and Thomas Rafferty who were killed. The monument has two images: on one side the figure is in the form of Christ, and on the other side is a rebel.\nOn Easter Monday 2016, Rath Cross was the location of one of a number of 1916 centenary commemoration events.  In September 2016, the monument was expanded with the addition of two side figures; one representing the Volunteers in uniform, the other a family.\nReferences\nSources\n*\n*"
    }
  ]
}