{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Orašje__disambig_1\n\n}}\n| caption           = Orašje on the map of Bosnia and Herzegovina\n| partof            = the Bosnian War\n| date              = 5 May&nbsp;– 10 June 1995\n| place             = Northern Bosnia and Herzegovina\n| result            = Croatian victory\n* No territorial changes\n* Herzeg-Bosnia retains Orašje\n| combatant1        =\n| combatant2        =\n| commander1        = Dragoslav ĐurkićMomir TalićRatko Mladić\n| commander2        = Đuro Matuzović\n| units1            = Army of Republika Srpska\n| units2            = Croatian Defence CouncilPolice of Herzeg-BosniaCroatian Army\n| strength1         = 8,000 soldiers\n| strength2         = 6,000 soldiers\n| casualties1       =\n| casualties2       =\n}}\nThe Battle of Orašje was fought during the Bosnian War, from 5 May to 10 June 1995, between the Bosnian Serb Army of Republika Srpska (Vojska Republike Srpske – VRS) and the Bosnian Croat Croatian Defence Council (Hrvatsko vijeće obrane – HVO) for control of the town of Orašje and its surrounding area on the south bank of the Sava River. The offensive codenamed Operation Flame-95 (Operacija Plamen-95) and referred to by Croatian sources as Operation Revenge (Operacija Osveta) was actually fought with varying intensity, with periods of combat interspersed by lulls lasting two to seven days. The heaviest fighting was reported on 15 May, when the VRS managed to break through a portion of the HVO defences near the village of Vidovice, but the breach was successfully contained and the lost ground was recovered by the HVO.\nThe HVO, supported by Croatian Army artillery deployed north of the river, managed to withstand the offensive and the front line remained unchanged from the commencement of the battle. This demonstrated the changed balance of power at this stage of the war. At the commencement of the war, the VRS had greater military capabilities than its opponents, particularly in terms of heavy weapons and organisation, but over three years from mid-1992 its capabilities had been matched by its adversaries.\nBackground\nAs the Yugoslav People's Army (Jugoslovenska narodna armija – JNA) withdrew from Croatia following the acceptance and start of implementation of the Vance plan, its 55,000 officers and soldiers born in Bosnia and Herzegovina were transferred to a new Bosnian Serb army, which was later renamed the Army of Republika Srpska (Vojska Republike Srpske – VRS).  This reorganisation followed the declaration of the Serbian Republic of Bosnia and Herzegovina on 9 January 1992, ahead of the referendum on the independence of Bosnia and Herzegovina that took place between 29 February and 1 March 1992. This declaration would later be cited by the Bosnian Serbs as a pretext for the Bosnian War. Bosnian Serbs began fortifying the capital, Sarajevo, and other areas on 1 March 1992. On the following day, the first fatalities of the war were recorded in Sarajevo and Doboj. In the final days of March, Bosnian Serb forces bombarded Bosanski Brod with artillery, resulting in a cross-border operation by the Croatian Army (Hrvatska vojska – HV) 108th Brigade. On 4 April 1992, JNA artillery began shelling Sarajevo. There were other examples of the JNA directly supported the VRS, such as during the capture of Zvornik in early April 1992, when the JNA provided artillery support from Serbia, firing across the Drina River. At the same time, the JNA attempted to defuse the situation and arrange negotiations elsewhere in the country.\nThe JNA and the VRS in Bosnia and Herzegovina faced the Army of the Republic of Bosnia and Herzegovina (Armija Republike Bosne i Hercegovine – ARBiH) and the Croatian Defence Council (Hrvatsko vijeće obrane – HVO), reporting to the Bosniak-dominated central government and the Bosnian Croat leadership respectively, as well as the HV, which occasionally supported HVO operations. In late April 1992, the VRS was able to deploy 200,000 troops, hundreds of tanks, armoured personnel carriers (APCs) and artillery pieces. The HVO and the Croatian Defence Forces (Hrvatske obrambene snage – HOS) could field approximately 25,000 soldiers and a handful of heavy weapons, while the ARBiH was largely unprepared with nearly 100,000 troops, small arms for less than a half of their number and virtually no heavy weapons. Arming of the various forces was hampered by a United Nations (UN) arms embargo introduced in September 1991. By mid-May 1992, when those JNA units which had not been transferred to the VRS withdrew from Bosnia and Herzegovina to the newly declared Federal Republic of Yugoslavia, the VRS controlled approximately 60 percent of Bosnia and Herzegovina. The extent of the control was extended to about 70 percent of the country by the end of the year.\nA significant portion of the territory controlled by the VRS was located in western Bosnia, including the Bosnian Serb capital of Banja Luka. This portion of Bosnian Serb-held territory was dependent on resupply from the Federal Republic of Yugoslavia using a single road spanning the Bosnian Sava Basin from west to east through Derventa and Brčko. The same road was also used to resupply the Republic of Serbian Krajina (RSK), the Croatian Serb-controlled areas of Croatia. After the capture of Derventa by the HVO and the HV in May 1992, the VRS launched Operation Corridor 92 and regained control of the resupply route in late June. By October, it had eliminated all HV or HVO-held pockets along the southern bank of the Sava and the border of Croatia, except a single bridgehead around the town of Orašje. Even though the fighting secured the route for the VRS, the corridor remained merely  wide at its narrowest point.\nPrelude\nThe balance of military power in the Bosnian War had started to shift against the VRS in early 1994, despite its advantages in heavy weapons. In early 1995, the ARBiH exerted increasing pressure on the VRS, especially in the area of Mount Vlašić. While the HV and the HVO advanced west of Livno (Operation Leap 1), the VRS launched its own offensive—Operation Joint Action 95 (). Operation Joint Action 95 was intended as a war-winning offensive,  and was launched south of the Derventa–Brčko corridor, but was also designed to widen the critical resupply route. Launched on 19 April, the VRS offensive faced determined resistance from the ARBiH and the HVO and had bogged down by the end of the month.\nIn early May, the HV launched a successful offensive, codenamed Operation Flash, against a RSK-held part of western Slavonia in Croatia. The move caused the VRS to reorient its attention to the Orašje pocket, the only territory outside its control between the Derventa–Brčko road and the Sava River. The shift of VRS focus to Orašje may have been the result of a desire to retaliate for the defeat suffered by the RSK in western Slavonia, or meant as a quick land-grab before a peace settlement was accepted.\nOrder of battle\nThe VRS earmarked Tactical Group 5 (TG-5) for the offensive, normally deployed against HVO positions in the Orašje pocket. TG-5, commanded by Colonel Dragoslav Đurkić, normally consisted of approximately 6,000 troops drawn from four infantry or light brigades, but for the offensive it received further 2,000 reinforcements. Those included elite assault units assigned to the 1st Krajina Corps, elements of the 1st Armoured Brigade and corps-level artillery. Furthermore, Colonel Generals Momir Talić and Ratko Mladić were present to directly supervise the operation.\nThe Orašje pocket was defended by the 6,000-strong HVO Orašje Corps, consisting of one guards brigade and three Home Guard regiments. Overall command of the corps was held by Staff Brigadier Đuro Matuzović. The defences  lacked depth, and did not exceed . To offset this, the HVO had prepared strong forward defences, including trenches and bunkers, built along the  front line. The HVO positions were supported by HV artillery and multiple rocket launchers deployed north of the Sava River, in Croatia.\n{| class=\"plainrowheaders wikitable collapsible\" style=\"cellspacing=2px; text-align:left; font-size:90%;\" width=800px\n|+Army of Republika Srpska order of battle\n|- style=\"font-size:100%; text-align:right;\"\n! style=\"width:100px;\" scope=\"col\" | Corps !! style=\"width:300px;\" scope=\"col\" | Unit !! style=\"width:400px;\" scope=\"col\" | Note\n|-\n| rowspan=4| 1st Krajina Corps (TG-5)|| 1st Čelinac Light Infantry Brigade || In Krepšić area\n|-\n| 11th Dubica Infantry Brigade || In Lončari area\n|-\n| 2nd Krajina Infantry Brigade || In Obudovac area\n|-\n| 2nd Posavina Infantry Brigade || In Bosanski Šamac area\n|-\n| rowspan=7| Reinforcements || 1st Military Police Battalion ||\n|-\n| 1st Armoured Brigade || One or two battalions\n|-\n| 43rd Prijedor Motorised Brigade || 4th Battalion only\n|-\n| 1st Bjeljina Light Infantry Brigade || Some elements of the brigade only\n|-\n| Drina Wolves || Special operations detachment\n|-\n| 1st Reconnaissance Sabotage Detachment ||\n|-\n| 1st Mixed Artillery Regiment || Organised in two to three artillery groups\n|}\n{| class=\"plainrowheaders wikitable collapsible\" style=\"cellspacing=2px; text-align:left; font-size:90%;\" width=800px\n|+Croatian Defence Council order of battle\n|- style=\"font-size:100%; text-align:right;\"\n! style=\"width:100px;\" scope=\"col\" | Corps !! style=\"width:300px;\" scope=\"col\" | Unit !! style=\"width:400px;\" scope=\"col\" | Note\n|-\n| rowspan=5| Orašje Corps || 4th Guards Brigade || Held in reserve\n|-\n| 202nd Home Guard Regiment || In Domaljevac–Grebnice area\n|-\n| 106th Home Guard Regiment || In Oštra Luka area\n|-\n| 201st Home Guard Regiment || In Vidovice–Vučilovac area\n|-\n| Special police detachment || 200-strong unit of the Ministry of the Interior\n|-\n| HV Osijek Corps || colspan=2| Croatian Army artillery, located north of the Sava River, inside Croatia\n|}\nTimeline\nOn 5 May, the 1st Krajina Corps launched its offensive aimed at capturing the Orašje pocket, codenamed Operation Flame-95 (Croatian: Operacija Plamen-95). It is also referred to by Croatian sources as Operation Revenge (). The offensive started off with a substantial artillery bombardment and ground assault, directed at Oštra Luka, at the centre of the front line. According to Croatian sources, the 5 May attack was not coordinated very well and it gave the HVO the chance to bolster its defences. While the fighting was in progress, the VRS artillery bombarded the town of Orašje itself. The attack was quickly defeated, and after this initial setback, the VRS paused for five days.\nThe offensive resumed on 10 May, when a number of VRS 9K52 Luna-M short-range artillery rockets, commonly known by their NATO designation of \"FROG–7\", were fired at HVO positions. The opposing forces blamed each other for the resumption of fighting—the VRS accused the HVO of bombarding the Derventa–Brčko road to interdict traffic, while the HVO accused the VRS of bombarding the town of Orašje first. During the morning of 10 May, UN observers counted more than 1,000 explosions in the area and described the fighting as \"intense\", but said that it had lost some momentum by the afternoon. The primary axes of the attacks, directed at the centre and the east of the pocket and aiming towards Orašje and the village of Vidovice failed to gain ground. The secondary effort on the left flank made some progress towards Grebnice before being beaten back by the HVO. During the fighting, rumours circulated that the Orašje area would be surrendered in exchange for territory lost to the HV in western Slavonia.\nThe VRS attacked at least seven more times over the next thirty days, with pauses of two to seven days between each attack. Some lasted for several days, and during each attack UN observers counted from 2,000 to 5,000 explosions. The most successful attack occurred on 14–15 May, when the VRS nearly reached Vidovice on the southern bank of the Sava River. On that occasion, a combined armour and infantry assault broke through three lines of trenches, with the assistance of strong artillery support including the bombardment of HVO positions with approximately 5,000 shells and two 9K52 Luna-M rockets. In the fierce combat to gain control of Vidovice, the VRS was pushed back by the 4th Guards Brigade and the 106th Home Guard Regiment to its start positions. According to Bosnian Serb sources, the HV fired six rockets from its positions in the Posavski Podgajci and Rajevo Selo areas against targets in Brčko, causing substantial damage but no casualties. Even though the fighting continued, including skirmishes between the VRS and the ARBiH in the area south of Orašje, its overall intensity had declined by 15 May. On 4–10 June, the HV and the HVO launched Operation Leap 2 against VRS-held positions west of Livno. Even though the operation was not directly linked to the Battle of Orašje, its planners thought that it might force the VRS to redeploy a portion of its forces in the Orašje area to shore up its positions near the Livanjsko field. By 10 June, the VRS had called off Operation Flame-95 and the Battle of Orašje effectively ended.\nAftermath\nThe VRS failure in the battle demonstrated its declining capabilities relative to its adversaries over the preceding three years. The failure was despite the offensive being conducted competently, and applying VRS military doctrine calling for the use of armoured and assault infantry supported by artillery. By 1995, the VRS was facing well-organised militaries employing a comparable number of artillery pieces and good defensive fortifications. In consequence, the VRS was no longer  capable of defeating its opposition by relying heavily on artillery superiority, and it was unwilling to commit its dwindling numbers of infantry to a decisive but risky attack. The battle resulted in no territorial changes, but both belligerents reported dozens of casualties, both military and civilian. Even though the battle was over, intermittent artillery exchanges continued in the area, and as early as 19 June, the VRS bombarded Orašje again.\nFootnotes\nReferences\n;Books\n* |url=https://books.google.com/books?id=it1IAQAAIAAJ|title=Balkan Battlegrounds: A Military History of the Yugoslav Conflict, 1990–1995|author=Central Intelligence Agency, Office of Russian and European Analysis|publisher=Central Intelligence Agency|location=Washington, D.C.|year=2002|isbn=978-0160664724}}\n*\n*\n;News reports\n*  |newspaper=The Independent |url=https://www.independent.co.uk/news/world/croatia-built-web-of-contacts-to-evade-weapons-embargo-1556500.html |title=Croatia built 'web of contacts' to evade weapons embargo |first=Christopher |last=Bellamy |date=10 October 1992 |archive-date=10 November 2012 |archive-url=https://web.archive.org/web/20121110025827/http://www.independent.co.uk/news/world/croatia-built-web-of-contacts-to-evade-weapons-embargo-1556500.html |url-status=live |df=dmy }}\n*  |newspaper=The New York Times |date=12 May 1992 |url=https://www.nytimes.com/1992/05/12/world/pessimism-is-overshadowing-hope-in-effort-to-end-yugoslav-fighting.html?src=pm |title=Pessimism Is Overshadowing Hope in Effort to End Yugoslav Fighting |first=John F. |last=Burns |author-link=John F. Burns |archive-date=19 December 2013 |archive-url=https://web.archive.org/web/20131219212305/http://www.nytimes.com/1992/05/12/world/pessimism-is-overshadowing-hope-in-effort-to-end-yugoslav-fighting.html?src=pm |url-status=live |df=dmy }}\n* |newspaper=The New York Times|date=11 May 1995|author-link=Roger Cohen|first=Roger|last=Cohen|url=https://www.nytimes.com/1995/05/11/world/heavy-battle-erupts-between-serbs-and-croats-in-bosnia.html|title=Heavy Battle Erupts Between Serbs and Croats in Bosnia}}\n* |newspaper=The Herald|date=15 May 1995|title=Fighting rages along Serb corridor Zagreb, Sunday|url=http://www.heraldscotland.com/sport/spl/aberdeen/fighting-rages-along-serb-corridor-zagreb-sunday-1.680516}}\n* |date=16 May 1995|url=https://apnews.com/1ba8cd85df56d06e5a6ea75ed994cc5c|publisher=Associated Press|first=George|last=Jahn|title=Sarajevo Erupts in Heaviest Fighting in More than a Year}}\n* |date=8 May 1995|first=John|last=Pomfret|author-link=John Pomfret (journalist)|title=Bosnian Serbs Shell Sarajevo Suburb, Launch Attacks on Catholic Churches; NATO Reprisal Airstrikes Not Being Considered, U.N. Officials Say|newspaper=The Washington Post |url=http://www.highbeam.com/doc/1P2-830722.html|archive-url=https://web.archive.org/web/20160309211822/https://www.highbeam.com/doc/1P2-830722.html|url-status=dead|archive-date=9 March 2016}}\n* |date=15 May 1995|first=John|last=Pomfret|title=Croatia Serb Sees Lesson in a Defeat; Krajina Radical: Moderates Undercut|newspaper=The Washington Post |url=http://www.highbeam.com/doc/1P2-832747.html|archive-url=https://web.archive.org/web/20140714123010/http://www.highbeam.com/doc/1P2-832747.html|url-status=dead|archive-date=14 July 2014}}\n* |date=19 June 1995|newspaper=The Columbian |url=http://www.highbeam.com/doc/1P2-23325016.html|archive-url=https://web.archive.org/web/20160309195642/https://www.highbeam.com/doc/1P2-23325016.html|url-status=dead|archive-date=9 March 2016|title=U.N. Role Shrinking in Bosnia|agency=Associated Press}}\n* |date=20 May 1995|url=https://www.latimes.com/archives/la-xpm-1995-05-20-mn-4010-story.html|title=Battle Rages Over Serb Supply Route: Balkans: Fight over key transport corridor could merge scattered conflicts into wider war|first=Tracy|last=Wilkinson|newspaper=Los Angeles Times}}\n;Other sources\n* |date=July 2012|title=Operacija \"Osveta\" i pobjeda HVO-a|trans-title=Operation Revenge and HVO's Victory|language=Croatian|first=Mario|last=Tomas|url=http://vojnapovijest.vecernji.hr/broj-16-vp/operacija-osveta-i-pobjeda-hvo-a-907871|publisher=Večernji list|journal=Vojna Povijest |pages=44–45|issn=1333-9192|issue=15}}"
    }
  ]
}