{
  "content": [
    {
      "type": "text",
      "text": "# Battle of the Baztan Valley\n\nFrance\n|combatant2= Spain French Émigrés\n|commander1= Jacques Muller Bon-Adrien Moncey\n|commander2= Ventura Caro Marquis Saint-Simon Col. Gabriel de Mendizábal Iraeta\n|strength1=3 divisions\n|strength2=Unknown\n|casualties1=Over 600\n|casualties2=Over 2,000, 300 cannons\n}}\nThe Battle of the Baztan Valley was fought between 23 July and 1 August 1794 during the War of the Pyrenees, between a French force from the Army of the Western Pyrenees commanded by Bon-Adrien Jeannot de Moncey and the Spanish forces led by Ventura Caro. The French army drove the Spanish from their defenses, then followed the valley northward down to the Atlantic coast. The Spanish forces holding the coastal defenses were compelled to surrender or flee.\nBackground\nSans Culotte Camp\nJacques Léonard Muller was appointed commander of the French Army of the Western Pyrenees on 5 October 1793. The year 1793 saw no major battles in the western Pyrenees, though a number of skirmishes occurred between French and Spanish forces. On 5 February 1794, José Urrutia y de las Casas attacked a fortified hilltop near Hendaye and was defeated in the Battle of Sans Culottes Camp. Out of 13,000 Spanish infantry, and their 700 supporting cavalry and artillery, Spanish casualties numbered 335. French losses were 235.\nJune operations\nOn 3 June, a 2,300-man French brigade led by Lavictoire stormed Casa Fuorte, a position at the Izpegi Pass (Col d'Ispeguy),  west of Saint-Jean-Pied-de-Port. The 1,000 defenders, including a battalion of the Spanish Zamora Infantry Regiment, three companies of the Aldudes Rifles, and the French Émigré Légion Royal, lost 94 killed and wounded, plus 307 captured. Other Spanish defenses on Izpegi Ridge and the Maya Pass were also overrun that day. On 23 June, Captain General Ventura Caro with 8,000 infantry and 500 cavalry and artillery unsuccessfully assailed Mont Calvaire near Bera (Vera). The Spanish lost 500 killed and wounded, plus 34 captured. The French defenders lost 30 killed and 200 wounded.\nBattle\nMonte Argintzo\nThe June fighting gave the French army a foothold in the Baztan Valley. Muller ordered the Spanish positions in the Baztan to be assaulted and assigned Moncey to carry out the operation. On 10 July, Antoine Digonet and 4,000 French troops attacked the Zamora Infantry and the Légion Royal on Monte Argintzo (Mont Arquinzu). The peak is located at ,  south of Elizondo in the Baztan. The outnumbered defenders lost 314 casualties including Marquis of Saint-Simon badly wounded. After the battle, the Republican French massacred 49 French Royalist prisoners.\nBaztan\nWar of the Pyrenees, Western Theater\nMoncey had his own and two other divisions under his supervision.\n* General of Division Bon-Adrien Jeannot de Moncey\n** 13 infantry battalions, 800 cavalry, 14 4-pdr cannons, 4 heavier cannons\n* General of Division Henri Delaborde\n** 9 infantry battalions\n* General of Division Jean Henri Guy Nicolas de Frégeville\n** 9 infantry battalions, 2 squadrons light cavalry\nBeginning on 23 July, Moncey's divisions attacked the Spanish entrenchments in the Baztan. The valley includes the towns of Elizondo, where the Baztan river turns from southwest to west and Doneztebe where the river turns north and becomes known as the Bidasoa. By between 27 and 30 July, the Spanish defenses were overcome and Moncey turned his divisions northward to follow the Bidasoa to the Atlantic coast. The number of French and Spanish killed and wounded is unknown, but the French captured 200 Spaniards and four artillery pieces. Emerging from the mountains on 1 August, Moncey fell upon the Spanish coastal defenses from the flank and rear with 12,000 men, capturing the San Marcial heights southeast of Irun and Hondarribia (Fuenterrabia). Trapped by the French maneuver, Vicente de los Reyes surrendered with 2,000 Spanish soldiers, 300 cannon, and five colors. The French suffered 600 casualties.\nResult\nMoncey's offensive completely unhinged the Spanish defensive position behind the Bidasoa River. The French went on to seize the port of Pasaia (Pasajes) on 2 August. A bigger prize fell on 3 August when San Sebastián surrendered to the French with 1,700 Spanish prisoners and 90 cannon. French losses were negligible. The town of Tolosa fell to Moncey soon afterward.\nFootnotes\nReferences\nPrinted materials\n* Beckett, Ian F. W. \"Moncey: An Honest Man\". Chandler, David (ed.). ''Napoleon's Marshals. New York: Macmillan, 1987.\n* Smith, Digby. The Napoleonic Wars Data Book.'' London: Greenhill, 1998."
    }
  ]
}