{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Les Sables-d'Olonne\n\n|result=British victory\n|combatant1=United Kingdom\n|combatant2=France\n|commander1=Robert Stopford\n|commander2=Pierre Jurien\n|strength1=3 ships of the line  1 frigate  1 sloop\n|strength2=3 frigates\n|casualties1=3 killed  31 wounded\n|casualties2=24 killed  51 wounded  3 frigates wrecked\n}}\nThe '''Battle of Les Sables-d'Olonne''' was a minor naval battle fought on 23 February 1809 off the town of Les Sables-d'Olonne on the Biscay Coast of France between a French Navy squadron of three frigates and a larger British squadron of ships of the line. The French squadron had sailed from the port of Lorient on 23 February in an effort to link up with a fleet from Brest under Jean-Baptiste Willaumez, but missed the rendezvous and was pursued by a British blockade squadron under Rear-Admiral Robert Stopford. The French commander, Commodore Pierre Roch Jurien, anchored his squadron under the batteries which protected the town of Les Sables-d'Olonne in the hope of dissuading an attack.\nIgnoring the batteries, Stopford ordered his squadron to attack at 09:00 on 24 February, HMS Defiance leading the line. Shortly after the main batteries of Stopford's ships of the line came into the battle, the French ships were overwhelmed one by one and shortly after noon all three had been driven ashore with heavy casualties. British histories recount that all three were destroyed, although French histories report that they were salvaged but found to be damaged beyond repair. The fleet under Willaumez was trapped in the anchorage at Basque Roads on 26 February and defeated at the Battle of Basque Roads in April with heavy losses.\nBackground\nIn 1809 the Royal Navy was dominant in the Atlantic, the French Atlantic fleet trapped by close blockade in the French Biscay ports by the British Channel Fleet. The largest French base was at Brest in Brittany, where the main body of the French fleet lay at anchor under the command of Contre-amiral Jean-Baptiste Willaumez, with smaller French detachments stationed at Lorient and Rochefort. The squadron at Lorient comprised three ships of the line and five frigates under Commodore Amable Troude, watched by its own blockade squadron of four ships of the line under Captain John Beresford.\nIn February the Brest fleet put to sea for an operation against the British forces in the Caribbean planning an attack against the French colonies in the Caribbean. In late 1808, the French learned that invasion was planned of Martinique and orders were sent to Willaumez to concentrate with the squadrons from Lorient and Rochefort and reinforce the island.   Willaumez was only able to escape the blockade when winter storms forced the British fleet to retreat into the Atlantic, his ships passing southwards through the Raz de Sein at dawn on 22 February with eight ships of the line and two frigates. A single ship of the line, HMS Revenge,  had remained on station off Brest, and sailed in pursuit.\nChase\nWillaumez's fleet discovered Beresford's ships off Lorient at 16:30 in the afternoon and Willaumez ordered his second-in-command, Contre-amiral Antoine Louis de Gourdon, to drive Beresford away. Gourdoun brought four ships around to chase the British squadron of HMS Theseus, HMS Triumph and HMS Valiant, with the remainder of the French fleet following more distantly. Beresford turned away to the northwest, and his objective achieved, Gourdan rejoined Willaumez and the fleet sailed inshore, anchoring near the island of Groix, with the route to Lorient clear.\nEarly on 23 February Willaumez sailed again, taking his fleet southwards towards the Pertuis d'Antioche near Rochefort after sending the schooner Magpye into Lorient with orders for Troude to follow him to the rendezvous. Troude found that the tide was too low to sail at once, and so sent a squadron of three frigates ahead, under the command of Commodore Pierre Roch Jurien. These frigates were the 40-gun Italienne, Calypso and Cybèle, which sailed together on the evening of 23 February southwards in the direction of Belle Île. Their departure had been observed by Beresford's force, which remained off Lorient to watch Troude but sent the 38-gun frigate HMS Amelia under Captain Frederick Paul Irby and 18-gun brig-sloop HMS Doterel under Commander Anthony Abdy in pursuit.\nAt dawn on 24 February, near the Île de Ré, Amelia closed on Cybèle, forcing the other French frigates to fall back in support and open fire, driving the pursuers back. As Irby dropped off, sails appeared to the south. This was a British squadron from the Rochefort blockade commanded by Rear-Admiral Robert Stopford with the ships of the line HMS Caesar, HMS Defiance and HMS Donegal. Stopford had been stationed off the Chassiron lighthouse when Willaumez had passed, and he had sent the frigate HMS Naiad under Captain Thomas Dundas north to notify the rest of the British Channel Fleet that was in pursuit. Naiad sighted Jurien's squadron and signaled Stopford, who set a course to cut Jurien off from Willaumez, leaving the frigates HMS Amethyst and HMS Emerald to watch the French fleet.\nBattle\nJurien recognised immediately that his force was severely outnumbered and steered for the coast in search of a safe anchorage. The best available was the town of Les Sables-d'Olonne, which had a small harbour protected by gun batteries. At 09:10 Amelia was in range to fire on Cybèles stern before the British frigate dropped back to join Stopford's rapidly advancing force. The French then anchored under the batteries of the town with \"springs\" on their anchor cables, a system of attaching the bow anchor that increased stability and allowed the ships to swing their broadsides to face an enemy while stationary.\nStopford was not intimidated and at 10:30 his squadron bore down on the French in a line of battle led by Defiance and followed by Caesar, Donegal and Amelia. At 11:00 Defiance, with the lightest draught of the ships of the line, was able to close to within  of the French squadron. The British ship opened fire and took fire in response from the frigates and batteries. At 11:20 Caesar and Donegal joined the attack, followed at 11:30 by Amelia. The concentrated fire of the large British ships was far too heavy for the French and at 11:50 Cybèle and Italienne cut their anchor cables and drifted away from the British and onto the shore. Neither crew was able to continue in the fight as burning wadding had drifted from Defiance and set them on fire. At about this time Caesar withdrew to deeper water to avoid grounding and Defiance veered anchor cable to turn its fire onto Calypso.\nWithin minutes Calypso had also veered its cable so that Italienne, now beached, could resume fire on the British squadron, but the frigate overcompensated and drifted stern-first onto the shore. The British ships continued their fire until the rapidly falling tide forced them to retire one by one, with Defiance being the last to retire at 12:15. The squadron then returned for one more pass, the final shots fired by Donegal, before Stopford ordered them to withdraw.\nAftermath\nThe British ships at Les Sables-d'Olonne were not seriously damaged, with minor damage to the rigging of Donegal and Caesar and damage to the rigging and masts of Defiance. Three British sailors were killed and 31 wounded. French losses were more severe, with 24 killed and 51 wounded. Although Stopford's dispatch on the action makes clear that attempts to repair the French ships began almost immediately, it is widely reported in British accounts that three ships were destroyed. The French were in fact able to salvage two of the frigates. Cybèle was wrecked beyond recovery, her hull so much holed by rocks that she was sinking. Calypso and Italienne were brought into port, but the battering they had taken was too severe for repairs to be effective and Calypso was broken up, while Italienne was sold to private merchant concerns as unfit for further military service. Cocault was court-martialed for the loss of Cybèle and honourably acquitted on 2 June 1809, the court finding his conduct \"worthy of the highest praise\".\nStopford had hoped that his attack on Jurien's squadron might draw Willaumez's fleet out of the anchorage in support, where they might be surprised and defeated by the British fleet. Willaumez however made no movement to prevent the destruction of the frigate squadron. Stopford returned to watch the French fleet from the anchorage at Basque Roads, where he was shortly after joined by the British fleet under Admiral Lord Gambier, and was present although not directly engaged in the Battle of Basque Roads in April at which the French fleet was defeated, losing five ships. Willaumez had been replaced in March by Zacharie Allemand, whose defensive positions were unable to prevent a major attack by fireships on 11 April followed by a bombardment by conventional warships. In the aftermath of the battle Gambier was accused of failing to effectively support the attack and faced a court-martial in July, although he was acquitted and returned to command.\nOrder of battle\n{| class=\"wikitable\" border=\"1\" style=\"width:100%;\"\n|- style=\"vertical-align:top;\"\n!colspan=\"11\" bgcolor=\"white\"|Commodore Juien's squadron\n|- valign=\"top\"|- style=\"vertical-align:top;\"\n! width=12%; align= center rowspan=2 |  Ship\n! width=10%; align= center rowspan=2 |  Rate\n! width=5%; align= center rowspan=2 |  Guns\n! width=5%; align= center rowspan=2 |  Navy\n! width=22%; align= center rowspan=2 |  Commander\n! width=15%; align= center colspan=3 | Casualties\n! width=30%; align= center rowspan=2 | Notes\n|- style=\"vertical-align:top;\"\n! width=5%; align= center  |  Killed\n! width=5%; align= center  |  Wounded\n! width=5%; align= center  |  Total\n|- style=\"vertical-align:top;\"\n| align= left  | Italienne\n| align= center  | Frigate\n| align= center  | 40\n| align= center  |\n| align= left  | Commodore Pierre Roch Jurien\n| align= center | 6\n| align= center | 17\n| align= center | 23\n| align= left  | Driven ashore and badly damaged. Salvaged but sold out of French service.\n|- style=\"vertical-align:top;\"\n| align= left  | Cybèle\n| align= center  | Frigate\n| align= center  | 40\n| align= center  |\n| align= left  | Captain Raymond Cocault\n| align= center | 8\n| align= center | 16\n| align= center | 24\n| align= left  | Driven ashore and badly damaged. Salvaged but damaged beyond repair and broken up.\n|- style=\"vertical-align:top;\"\n| align= left  | Calypso\n| align= center  | Frigate\n| align= center  | 40\n| align= center  |\n| align= left  | Captain Louis-Léon Jacob\n| align= center | 10\n| align= center | 18\n| align= center | 28\n| align= left  | Driven ashore and badly damaged. Salvaged but sold out of French service.\n|- style=\"vertical-align:top;\"\n!colspan=\"11\" bgcolor=\"white\"|Casualties: 24 killed, 51 wounded, 75 total\n|}\n{| class=\"wikitable\" border=\"1\" style=\"width:100%;\"\n|- style=\"vertical-align:top;\"\n!colspan=\"11\" bgcolor=\"white\"|Rear-Admiral Stopford's squadron\n|- valign=\"top\"|- style=\"vertical-align:top;\"\n! width=13%; align= center rowspan=2 |  Ship\n! width=10%; align= center rowspan=2 |  Rate\n! width=5%; align= center rowspan=2 |  Guns\n! width=5%; align= center rowspan=2 |  Navy\n! width=22%; align= center rowspan=2 |  Commander\n! width=15%; align= center colspan=3 | Casualties\n! width=30%; align= center rowspan=2 | Notes\n|- style=\"vertical-align:top;\"\n! width=5%; align= center  |  Killed\n! width=5%; align= center  |  Wounded\n! width=5%; align= center  |  Total\n|- valign=\"top\"\n|- valign=\"top\"\n| align= left | HMS Caesar\n| align= center | Third rate\n| align= center | 80\n| align= center  |\n| align= left | Rear-Admiral Robert StopfordCaptain Charles Richardson\n| align= center | 0\n| align= center | 0\n| align= center | 0\n| align= left | Rigging lightly damaged.\n|- style=\"vertical-align:top;\"\n| align= left | HMS Donegal\n| align= center | Third rate\n| align= center | 74\n| align= center  |\n| align= left | Captain Peter Heywood\n| align= center | 1\n| align= center | 6\n| align= center | 7\n| align= left | Rigging lightly damaged.\n|- style=\"vertical-align:top;\"\n| align= left | HMS Defiance\n| align= center | Third rate\n| align= center | 74\n| align= center  |\n| align= left | Captain Henry Hotham\n| align= center | 2\n| align= center | 25\n| align= center | 27\n| align= left | Rigging and masts damaged.\n|- style=\"vertical-align:top;\"\n| align= left | HMS Amelia\n| align= center | Fifth rate\n| align= center | 38\n| align= center  |\n| align= left | Captain Frederick Paul Irby\n| align= center | 0\n| align= center | 0\n| align= center | 0\n| align= left |\n|- style=\"vertical-align:top;\"\n| align= left | HMS Dotterel\n| align= center | Brig-sloop\n| align= center | 18\n| align= center  |\n| align= left | Commander Anthony Abdy\n| align= center | 0\n| align= center | 0\n| align= center | 0\n| align= left |\n|- style=\"vertical-align:top;\"\n!colspan=\"11\" bgcolor=\"white\"|Casualties: 3 killed, 31 wounded, 34 total\n|- style=\"vertical-align:top;\"\n|colspan=\"9\" align=\"left\"|Sources: James pp.&nbsp;98–100; Clowes p.&nbsp;254;\n|}\nReferences\nBibliography\n*\n*\n*\n*"
    }
  ]
}