{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Podol\n\n|combatant2=\n|commander1=  Julius von Bose\n|commander2=  Eduard Clam-Gallas\n|strength1= 1,300+\n|strength2= 4,000\n|casualties1= 32 killed81 wounded17 missing\n|casualties2= 111 killed432 wounded509 captured\n}}\nThe Battle of Podol was a minor engagement in the opening days of the Königgrätz campaign of the Austro-Prussian War in Bohemia on 26 and 27 June 1866. The battle took place in modern-day Svijany between troops of the Prussian First Army (Julius von Bose's 15th Brigade) and elements of Eduard Clam-Gallas' Austrian I Corps.\nBackground\nOn 24 June Prince Albert of Saxony had been placed in overall command of Austro-Saxon forces along the Iser river. Albert's troops joined up with Eduard Clam-Gallas' I Corps near Münchengrätz. On 26 June, Albert suggested that they occupy Turnau to the north to cover their flank. Clam-Gallas disagreed and nothing was done until the afternoon, when Albert received word of the Prussian occupation of Turnau at the same time as an order arrived from Ludwig von Benedek, the commander of the Austrian Army of the North, to hold Turnau and Münchengrätz at all costs. The Allies decided to recapture Turnau and seize the hills west of the Iser beyond Podol. The bridges at Turnau and Podol would permit the Prussians to turn the Allied northern flank.\nThe battle\nThe Prussian 8th Division's advance guard of five companies, commanded by Major Flotow, arrived at Podol in the evening of 26 June 1866 and seized the unoccupied village and the four bridges across the river, including a stone bridge.\nThe battle started around 8:30 pm when elements of Ferdinand Poschacher's brigade encountered Flotow's infantry. At 11 pm, the heavily outnumbered Flotow decided to fall back. Generalmajor Julius von Bose, the commander of the 8th Division's 15th Brigade, was nearby at Preper and heard the gunfire from Podol. He marched off with two of his battalions, some 1,300 men. Near Podol, Bose saw the retreating Prussians and was told of the strength of the Austrian attack. Due to the vital importance of the bridges, Bose decided to attack immediately and retake the village along with its bridges.\nAfter clearing the village, the Austrians continued their advance. An Austrian close order column was engaged by one of Bose's battalions and driven back by the superior firepower of the Prussian Dreyse needle gun. The 15th brigade advanced gradually through Podol, defeating several Austrian counterattacks along the way. With more Prussian forces arriving at the scene, Bose and Colonel Drygalski personally led an attack to retake the bridges. Drygalski was shot and killed by the Austrians and the Prussians faltered. Bose then picked up a rifle and led his men forward, capturing the bridges after heavy hand-to-hand combat.\nAnother Prussian battalion crossed the river upstream and moved to attack the Austrians engaged in the town but stumbled across Poschacher's two reserve battalions. Clam-Gallas had now arrived at the battlefield and ordered these reserves to attack, but they were beaten off by the Prussians. However, after repulsing three attacks, the Prussians had exhausted their ammunition and retired over the river. Having lost the town, Clam-Gallas admitted defeat and withdrew around 1 am.\nAftermath\nAustrian losses amounted to 1,052 men, including 509 prisoners. The Prussians had lost 130. The battle was a testament to the superiority of the Needle gun over the Austrian Lorenz rifle.\nHaving lost the bridges at Podol and Turnau, the Allies had no choice but to abandon the Iser line and retreat to Gitschin on 28 June. The Prussians would attack them that day at Münchengrätz.\nCitations\nBibliography\n*\n* Geoffrey Wawro, ''The Austro-Prussian War. Austria's war with Prussia and Italy in 1866'' (New York 2007), p.&nbsp;131-135."
    }
  ]
}