{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Mediaș__disambig_1\n\nOttoman Empire\n| combatant2        =  Kingdom of Hungary\n| commander1        =  Ali Bey Evrenosoğlu\n| commander2        = Unknown\n| strength1         = 20,000 cavalry\n| strength2         = 12,000 men\n| casualties1       = Unknown\n| casualties2       = Heavy, 15 counts captured\n}}\nThe Battle of Mediaș was a military engagement between the Ottoman raiders and the Hungarians in the region of Mediaș. The Ottomans were victorious.\nBackground\nIn the year 1437, the Hungarians launched a raid into Ottoman territory. In June, they crossed the Danube River with ships provided by Franko Talovac. They marched south in the valley of the Great Morava. At Stalać the Hungarians managed to defeat the Ottomans, who were protecting galleys in the Danube, and also destroyed the gunpowder found there. The Hungarians began indiscriminately burning and looting nearby villages. They then arrived at Kruševac, which they also burned. The victorious Hungarians returned home. Despite the impressive campaign, it did little damage to overall Ottoman military power.\nThe next year, the Ottomans responded to the raid by launching an invasion of Southeastern Hungary led by Sultan Murad II. The campaign lasted 45 days, and its exact results are unknown, but it was more likely a preparation for the conquest of Serbia.\nBattle\nAfter the end of Murad's campaign, he dispatched Ali Bey Evrenosoğlu to conduct further operations against the Hungarians. Ali Bey had a force of 20,000 Sipahi and Akinji. The Ottomans marched to Hungary through Brașov. During September and later, he began plundering Székely Land. The Ottomans encountered a force of 12,000 Hungarians near Mediaș. The Ottomans managed to defeat them and put them to the sword. Around 15 counts were seized alongside their banners, according to Ottoman chronicles.\nAftermath\nThe raid of Ali Bey has caused widespread destruction; several towns were blockaded and suburbs devastated. Organized resistance was sporadic. It also revealed the hard situations Wallachia and Serbia now faced. In the summer of 1439, the Sultan himself marched with his army for the conquest of Serbia.\nReferences\nSources\n*\n*"
    }
  ]
}