{
  "content": [
    {
      "type": "text",
      "text": "# Battleship (puzzle)\n\nExample of a solved Solitaire Battleships puzzle\nThe Battleship puzzle (sometimes called Bimaru, Yubotu, Solitaire Battleships or Battleship Solitaire) is a logic puzzle based on the Battleship guessing game. It and its variants have appeared in several puzzle contests, including the World Puzzle Championship, and puzzle magazines, such as Games magazine.\nSolitaire Battleship was invented in Argentina by Jaime Poniachik and was first featured in 1982 in the Argentine magazine . Battleship gained more widespread popularity after its international debut at the first World Puzzle Championship in New York City in 1992. Battleship appeared in Games magazine the following year and remains a regular feature of the magazine.  Variants of Battleship have emerged since the puzzle's inclusion in the first World Puzzle Championship.\nBattleship is played in a grid of squares that hides ships of different sizes.  Numbers alongside the grid indicate how many squares in a row or column are occupied by part of a ship.\nHistory\nThe solitaire version of Battleship was invented in Argentina in 1982 under the name Batalla Naval, with the first published puzzles appearing in 1982 in the Spanish magazine .  Battleship was created by the magazine's founder, Jaime Poniachik, along with its editors Eduardo Abel Gimenez, Jorge Varlotta, and Daniel Samoilovich.\nAfter 1982, no more Battleship puzzles were published until 1987, when they appeared in , a renamed version of .  The publishing company of  regularly publishes Battleship puzzles in its monthly magazine .\nBattleship made its international debut at the first World Puzzle Championship in New York in 1992 and met with success. The next World Puzzle Championship in 1993 featured a variant of Battleship that omitted some of the row and column numbers.  Battleship was first published in Games magazine in 1993, the year after the first World Puzzle Championship. Other variants later emerged, including Hexagonal Battleship, 3D Battleship, and Diagonal Battleship.\nRules\nIn Battleship, an armada of battleships is hidden in a square grid of 10×10 small squares. The armada includes one battleship four squares long, two cruisers three squares long, three destroyers two squares long, and four submarines one square in size. Each ship occupies a number of contiguous squares on the grid, arranged horizontally or vertically. The ships are placed so that no ship touches any other ship, not even diagonally.\nThe goal of the puzzle is to discover where the ships are located.  A grid may start with clues in the form of squares that have already been solved, showing a submarine, an end piece of a ship, a middle piece of a ship, or water.  Each row and column also has a number beside it, indicating the number of squares occupied by ship parts in that row or column, respectively.\nVariants of the standard form of solitaire battleship have included using larger or smaller grids (with comparable changes in the size of the hidden armada), as well as using a hexagonal grid.\nA version lets the solver shoot at 3 positions in one turn. The answer is returned sorted by size. For instance: (1,2) - (3,6) - (6,4) => 420 means that one of the three coordinates hit is a ship size 4, another a ship size 2. One coordinate returned a miss.\nStrategy\nThe basic solving strategy for a Battleship puzzle is to add segments to incomplete ships where appropriate, draw water in squares that are known not to contain a ship segment, and to complete ships in a row or column whose number is the same as the number of unsolved squares in that row or column, respectively.  More advanced strategies include looking for places where the largest ship that has not yet been located can fit into the grid, and looking for rows and columns that are almost complete and determining if there is only one way to complete them.\nIn computers\nBattleship is an NP-complete problem.\nIn 1997, former contributing editor to the Battleship column in Games magazine Moshe Rubin released Fathom It!, a popular Windows implementation of Battleship.\nSee also\n* Discrete tomography\n* Nonogram\nReferences\nFurther reading\n*\n*\nExternal links\n* [http://www.mountainvistasoft.com/omnibus.htm The Battleship Omnibus] - Extensive information on variants, competitions, and strategies."
    }
  ]
}