{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Rødenes\n\nSweden\n| combatant2           =  Denmark–Norway\n| commander1           =  Bror Cederström\n| commander2           =  Christian August Andreas Samuel Krebs\n}}\nThe Battle of Rødenes was a series of skirmishes that took place in late April and early May 1808 from Lund in Hemnes to Ørje as a result of the Swedish invasion of Norway during the Dano-Swedish War of 1808-1809.\nBackground\nOn 15 April 1808, a day after the Swedish 2nd Brigade had crossed the border into Norway, the Swedish 3rd Brigade crossed the Swedish-Norwegian border from Töcksmark and occupied the eastern side of Rødenessjøen and Øymarksjøen. From there, the Swedes had established outposts to the south and up to Hemnes. The Swedish commander, Colonel Bror Cederström, also ordered the creation of barricades, especially at Ørje, where he had his headquarters.\nThe skirmish at Lund\nAt the time of the Swedish 3rd Brigade's invasion, Prince Christian August's primary concern was the Swedish breakthrough after the battle of Lier and the Swedish advancements towards Kongsvinger. However, he was concerned that the Swedish 3rd brigade could move northward and cut off large numbers of Norwegian troops. On 20 April, he sent two companies under Captain Heyerdahl and Captain Zarbell against Hemnes to stop a possible Swedish advance.\nWhen the rumor that the Swedes were advancing reached the Norwegian companies, Captain Heyerdahl decided to pull his company back to Fetsund, while Captain Zarbell stationed his troops west of the farm Lund, east of Hemnes Church. From there he eventually moved towards the farm, where his troops clashed with a Swedish Jäger Corps. After the brief skirmish, the Swedes withdrew almost half a mile back to Opsal and Krok in Rødenes, where the most northern Swedish positions were located.\nWhen Colonel Cederström was told about the retreat, he ordered the company commander to advance again and confront the Norwegian company, which had stationed itself at Lund. This order was carried out and the Swedish forces tried repeatedly to drive Zabell's company out of Lund, but in vain. When they had lost a quarter of their troops, the Swedes chose to withdraw back to Opsal.\nFighting on 5 May\nAfter the victory at Trangen, Christian August felt that the Swedish pressure against Kongsvinger had calmed down. He sent more troops to face the Swedes' 3rd brigade at Rødenes. On 4 May, Major Andreas Samuel Krebs was sent over Aurskog against Hemnes to regroup with Captain Zarbell together with three companies from the Jäger Corps, four grenadier companies, some sharpshooters and a cavalry division from Akershusiske dragonregiment.\nThat same evening Captain Zarbell and his sharpshooters, together with Lieutenant Hegge and his 3. jegerkompani, were sent forward to the Swedish positions at Opsal. There Zarbell at once chose to attack the Swedish positions, but was not able to drive the 150 Swedish troops from the 1. Södermanlands bataljon from their positions. It was not until he got support from Major Krebs' main force that the Swedes were driven back to the Krok farm, further east, where they entrenched themselves. Major Krebs chose to continue to pursue the Swedes and began to advance towards their position. But it turned out that the Swedes had a relatively strong position since the Norwegians first had to cross the river Opsal, and then attack the Swedish position on the hill where the Krok farm lay.\nCaptain Butenschøn's company was the first Norwegian company who managed to get across the river and then went on to attack the Swedish right flank. But soon the rest of the jägers got across and started to threatened the Swedes from several positions The Swedes abandoned their position at Krok and retreat back to a new position at Jåvall, about a mile farther south. This position was also soon abandoned after several assaults from the Norwegians. The Swedes fell back to Åseby, only to be forced to retreat once again. It was only at Askerud, about a mile north of Ørje, that the Swedes managed to halt the Norwegian advance, and since the Norwegian troops were exhausted, Major Krebs chose not to carry out any new assaults on the Swedes' position.\nHowever, on the morning of 6 May, Krebs received an order from Prince Christian August to fall back. This was done in silence, and the Norwegians avoided being pursued.\nAttack on Ørje bridge\nThe same day that Major Krebs had been ordered to retreat, Major Fischer, who was in position at Mysen, was ordered to move against the Swedish positions near Ørje bridge. The next morning, on 7 May, Fischer began to advance with sharpshooters of the 4. jegerkompani and two companies from the Nordenfjelske Regiment against Ørje bridge.\nNear the bridge the Swedish outposts were quickly defeated, and the Norwegians moved up to the fortified bridgehead, which the Swedes had built on the west side of river, defended by 120 men of the Dalbataljonen. But since Fischer chose to stop the attack in order to prepare before storming the bridge, the Swedish commander, Captain Törnblad, managed to get across, and subsequently gave the order to set fire to the bridge. Thus it was impossible for the Norwegians to get across, and Fischer decided to pull his troops back.\nAftermath\nAlthough the Swedish forces still stood on Norwegian soil, the Norwegian troops had managed to stop their advance and to drive them back. This meant that the Swedish initiative to reach and capture Christiania by advancing through Smaalenenes Amt was greatly reduced, or gone.\nMany of the Norwegian soldiers, especially the jägers, who had fought in Rødenes, received awards. Lars Opsal received the most prestigious award; he was granted a sword with silver booklet for his boldness, courage and knowledge in the fighting.\nReferences\nBibliography\n*\n*\n*"
    }
  ]
}