{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Plattsburgh__disambig_1\n\n| result            = American victory\n* British offensive stopped by American forces.\n| combatant1        =\n| combatant2        =\n*\n**Lower Canada\n| commander1        =  Thomas Macdonough| Alexander Macomb}}\n| commander2        =  George Prévost| George Downie}}\n| strength2         = }}\n| strength1         = 6,354\n*Regulars: 3,454\n2,651 fit to fight\n803 invalids\n*Militia: 2,900\nVermont Militia: 2,200\nNew York Militia: 700\n1 corvette1 brig1 schooner1 sloop10 gunboats\n| casualties2       = 168 killed 220 wounded 317 captured234 deserted1 frigate captured 1 brig captured 2 sloops capturedTotal: 939\n| casualties1       = 104 killed 116 woundedTotal: 220\n| campaignbox       =\n}}\nThe Battle of Plattsburgh, also known as the Battle of Lake Champlain, ended the final British invasion of the northern states of the United States during the War of 1812. Two British forces, an army under Lieutenant General Sir George Prévost and a naval squadron under Captain George Downie converged on the lakeside town of Plattsburgh, New York. Plattsburgh was defended by New York and Vermont militia and detachments of regular troops of the United States Army, all under the command of Brigadier General Alexander Macomb, and ships commanded by Master Commandant Thomas Macdonough.\nDownie's squadron attacked shortly after dawn on 11 September 1814, but was defeated after a hard fight in which Downie was killed. Prévost then abandoned the attack by land against Macomb's defences and retreated to Canada, stating that even if Plattsburgh was captured, any British troops there could not be supplied without control of the lake.\nWhen the battle took place, American and British delegates were meeting at Ghent in the Kingdom of the Netherlands, attempting to negotiate a treaty acceptable to both sides to end the war. The American victory at Plattsburgh, and the successful defense at the Battle of Baltimore, which began the next day and halted British advances in the Mid-Atlantic states, denied the British negotiators leverage to demand any territorial claims against the United States on the basis of uti possidetis, i.e., retaining territory they held at the end of hostilities. The Treaty of Ghent, in which captured or occupied territories were restored on the basis of status quo ante bellum, i.e., the situation as it existed before the war, was signed three months after the battle. However, this battle may have done little to advance the objectives of either side.\nBackground\nBritish plans\nIn 1814, most of Britain's army was engaged in the Peninsular War in Spain. Then in April, Napoleon I abdicated the throne of France. This provided Britain the opportunity to send 16,000 veteran troops from the Peninsula and other garrisons to North America. Several experienced Major-Generals were also detached from the Duke of Wellington's army to command them.\nThe Secretary of State for War and the Colonies, the Earl of Bathurst, sent instructions to Lieutenant-General Sir George Prévost, the Commander-in-Chief in Canada and Governor General of the Canadas, authorizing him to launch offensives into American territory, but cautioning him against advancing too far and thereby risking being cut off. Bathurst suggested that Prévost should give first priority to attacking Sackett's Harbor on Lake Ontario, where the American fleet on the lake was based, and seize control of Lake Champlain as a secondary objective. Prévost lacked the means to transport the troops necessary for an attack on Sackett's Harbor and the supplies for them up the Saint Lawrence River. Furthermore, the American ships controlled Lake Ontario, making an attack impossible until the British launched the first-rate ship of the line HMS St. Lawrence on 15 October, too late in the year for major operations to be undertaken.\nPrévost therefore prepared to launch his major offensive to Lake Champlain, up the Richelieu River. (Since the Richelieu was the only waterway connecting Lake Champlain to the ocean, trade on the lake naturally went through Canada.) Prévost's choice of route on reaching the lake was influenced by the attitude of the American state of Vermont, on the eastern side of the lake. The state had shown itself to be less than wholeheartedly behind the war and its inhabitants readily traded with the British, supplying them with all the cattle consumed by the British army, and even military stores such as masts and spars for the British warships on Lake Champlain. To spare Vermont from becoming a seat of war, Prévost therefore determined to advance down the western, New York State, side of the lake. The main American position on this side was at Plattsburgh.\nPrévost organized the troops which were to carry out the invasion into a division commanded by Major General Sir Francis de Rottenburg, the Lieutenant Governor of Lower Canada. The division consisted of the 1st Brigade of veterans of the Peninsular War under Major General Frederick Philipse Robinson (the 3/27th, 39th, 76th and 88th Regiments of Foot); the 2nd Brigade of troops already serving in Canada under Major General Thomas Brisbane (the 2/8th, 13th, and 49th Regiments of Foot, the Regiment de Meuron, the Canadian Voltigeurs, and the Canadian Chasseurs); and the 3rd Brigade of troops from the Peninsula and various garrisons under Major General Manley Power (the 3rd, 5th, 1/27th, and 58th Regiments of Foot). Each brigade was supported by a battery of five 6-pounder guns and one 5.5-inch howitzer of the Royal Artillery. A squadron of the 19th Light Dragoons was attached to the force. There was also a small \"siege train\" of artillery, consisting of two 24-pounder brass field guns, an 8-inch brass howitzer, and three 24-pounder naval carronades mounted on field carriages, and a Congreve rocket detachment. The force numbered 11,000 in total. However, some units were detached and some sick men did not take part, so the actual number of troops present at Plattsburgh was just over 8,000.\nThere was some tension within the force between the brigade and regimental commanders who were veterans of the Peninsular War or of earlier fighting in Upper Canada, and Prévost and his staff. Prévost had not endeared himself by complaining about the standards of dress of the troops from the Peninsular Army, where the Duke of Wellington had emphasized musketry and efficiency above turnout. Furthermore, neither Prévost, nor de Rottenburg, nor Prévost's Adjutant General (Major General Edward Baynes) had the extensive experience of battle gained by their brigade commanders, and had already gained a reputation for caution and hesitancy. Prévost's Quartermaster General, Major General Thomas Sydney Beckwith, was a veteran of the early part of the Peninsular campaign and of operations in Chesapeake Bay in 1813, but even he was to be criticized, mainly for failures in the intelligence.\nAmerican defenses\nOn the American side of the frontier, Major General George Izard was the commander of the Northern Army, deployed along the Northeast frontier. In late August, Secretary of War John Armstrong ordered Izard to take the majority of his force, about 4,000 troops, to reinforce Sackett's Harbor. Izard's force departed on 23 August, leaving Brigadier General Alexander Macomb in command at Plattsburgh with only 1,500 American regulars. Most of these troops were recruits, invalids or detachments of odds and ends.\nMacomb ordered General Benjamin Mooers to call out the New York militia and appealed to the governor of Vermont for militia volunteers. 2,000 troops eventually reported to Plattsburgh under the command of Major General Samuel Strong. Macomb put these recent volunteers to work digging trenches and building fortifications.\nMacomb's main position was a ridge on the south bank of the Saranac River. Its fortifications had been laid out by Major Joseph Gilbert Totten, Izard's senior Engineer officer, and consisted of three redoubts and two blockhouses, linked by other fieldworks. The position was reckoned to be well enough supplied and fortified to withstand a siege for three weeks, even if the American ships on the lake were defeated and Plattsburgh was cut off. After Izard's division departed, Macomb continued to improve his defences. He even created an invalid battery on Crab Island, where his hospital was sited, that was to be manned by sick or wounded soldiers who were at least fit to fire the cannon. The townspeople of Plattsburgh had so little faith in Macomb's efforts to repulse the invasion that by September nearly all 3,000 inhabitants had fled the city. Plattsburgh was left occupied only by the American army.\nNaval background\nThe British had gained naval superiority on Lake Champlain on 1 June 1813, when two American sloops pursued British gunboats into the Richelieu River, and were forced to surrender when the wind dropped and they were trapped by British artillery on the banks of the river. They were taken into the British naval establishment at Ile aux Noix, under Commander Daniel Pring. Their crews, and those of several gunboats, were temporarily reinforced by seamen drafted from ships of war lying at Quebec under Commander Thomas Everard who, being senior to Pring, took temporary command. They embarked 946 troops under Lieutenant Colonel John Murray of the 100th Regiment of Foot, and raided several settlements on both the New York and Vermont shores of Lake Champlain during the summer and autumn of 1813. The losses they inflicted and the restriction they imposed on the movement of men and supplies to Plattsburgh contributed to the defeat of Major General Wade Hampton's advance against Montreal, which finally ended with the Battle of the Chateauguay.\nLieutenant Thomas Macdonough, commanding the American naval forces on the Lake, established a secure base at Otter Creek (Vermont), and constructed several gunboats. He had to compete with Commodore Isaac Chauncey, commanding on Lake Ontario, for seamen, shipwrights and supplies, and was not able to begin constructing larger fighting vessels until his second-in-command went to Washington to argue his case to the Secretary of the Navy, William Jones. Naval architect Noah Brown was sent to Otter Creek to superintend construction.\nIn April 1814, the Americans launched the corvette  of 26 guns and the schooner  of 14 guns (originally a part-completed steam vessel). Together with the existing sloop-rigged  of 7 guns, they gave the Americans naval superiority, and this allowed them to establish and supply a substantial base at Plattsburgh. Only a few days before the Battle of Plattsburgh, the Americans also completed the 20-gun brig .\nThe loss of their former supremacy on Lake Champlain prompted the British to construct the 36-gun frigate  at Ile aux Noix. Captain George Downie was appointed to command soon after the frigate was launched on 25 August, replacing Captain Peter Fisher, who in turn had superseded Pring. Like Macdonough, Downie had difficulty obtaining men and materials from the senior officer on Lake Ontario, Commodore James Lucas Yeo, and Macdonough had intercepted several spars which had been sold to the British by Vermonters; American Midshipman Joel Abbot led a cutting-out expedition which destroyed several of spars. Downie could promise to complete Confiance only on 15 September, and even then the frigate's crew would not have been exercised. Prévost was anxious to begin his campaign as early as possible, to avoid the bad weather of late autumn and winter, and continually pressed Downie to prepare Confiance for battle more quickly. However, at the time of the battle Confiance mounted only 16 12-pounder long guns and was crewed largely by untrained provincials.\nInvasion\nOn 31 August, Prévost began marching south. Macomb sent forward 450 regulars under Captain Sproul and Major John E. Wool, 110 riflemen under Major Daniel Appling, 700 New York militia under Major General Benjamin Mooers and two 6-pounder guns under Captain Leonard to fight a delaying action. At Chazy, New York, they first made contact with the British. Slowly falling back, the Americans set up road blocks, burned bridges and mislabelled streets to slow down the British. The British nevertheless advanced steadily, not even deploying out of column of march or returning fire, except by flank guards.\nWhen Prévost reached Plattsburgh on 6 September, the American rearguards retired across the Saranac, tearing up the planks from the bridges. Prévost did not immediately attack. On 7 September, he ordered Major General Robinson to cross the Saranac, but to Robinson's annoyance, Prévost had no intelligence on the American defences or even the local geography. Some tentative attacks across the bridges were repulsed by Wool's regulars.\nPrévost abandoned his efforts to cross the river for the time being and instead began constructing batteries. The Americans responded by using cannonballs heated red-hot to set fire to sixteen buildings in Plattsburgh which the British were using as cover, forcing the British to withdraw farther away. On 9 September, a night raid across the Saranac River by 50 Americans led by Captain George McGlassin destroyed a British Congreve rocket battery only  from Fort Brown, one of the three main American fortifications. McGlassin and his fellow raiders also killed one British officer and six British troops while wounding several others. Once all of the British artillery equipment was destroyed, they withdrew safely, having suffered no casualties.\nWhile skirmishing and exchanges of artillery fire continued, the British located a ford (Pike's Ford) across the Saranac  above Macomb's defences. Prévost planned that, once Downie's ships arrived, they would attack the American ships in Plattsburgh Bay. Simultaneously, Major General Brisbane would make a feint attack across the bridges over the Saranac while Major General Robinson's brigade (less two of its battalions but reinforced by the light infantry companies of several other battalions) would cross the ford to make the main attack against the American left flank, supported by Major General Power's brigade. Once the American ships had been defeated, Brisbane would make his feint attack into a real one.\nNaval battle\nPrelude\nMacdonough had sent some of his gunboats to harass Prévost's advance, but he knew that his fleet was outgunned, particularly in long guns. He therefore withdrew into Plattsburgh Bay, where the British would be forced to engage at close range, at which the American and British squadrons would be roughly even in numbers and weight of short-range carronades.  He used the time before Downie arrived to drill his sailors, and make preparations to fight at anchor. The ships were anchored in line from north to south in the order Eagle, Saratoga, Ticonderoga and Preble. They all had both bow and stern anchors, with \"springs\" attached to the anchor cables to allow the ships to be slewed through a wide arc. Macdonough also laid out extra kedge anchors from the quarters of his flagship Saratoga, which would allow him to spin the ship completely around. The ten American gunboats were anchored in the intervals between the larger vessels.\nAlthough the British sloops and gunboats under Commander Pring were already on the Lake and at anchor near Chazy, and had set up a battery on Isle La Motte, Vermont, it took two days to tow the frigate Confiance up the Sorel River from Ile aux Noix, against both wind and current. Downie finally joined the squadron on 9 September. Carpenters and riggers were still at work on the frigate, and the incomplete crew was augmented by a company of the 39th Foot. To Prévost's fury, Downie was unable to attack on 10 September because the wind was unfavourable. During the night the wind shifted to the northeast, making an attack feasible.\nThe British squadron sailed in the early hours of 11 September, and announced their presence to Prévost's army by \"scaling\" the guns i.e. firing them without shot to clear scale or rust from the barrels. Shortly after dawn, Downie reconnoitred the American dispositions from a rowing boat, before ordering the British squadron to attack. Addressing his crew, he told them that the British Army would storm Plattsburgh as soon as the ships engaged, \"and mind don't let us be behind\".\nBattle\nAt about 9&nbsp;am, the British squadron rounded Cumberland Head close-hauled in line abreast, with the large ships to the north initially in the order Chubb, Linnet, Confiance and Finch, and the gunboats to the south. It was a fine autumn day, but the wind was light and variable, and Downie was unable to manoeuvre Confiance to the place he intended, across the head of Macdonough's line. As Confiance suffered increasing damage from the American ships, he was forced to drop anchor between 300 and 500 yards from Macdonough's flagship, Saratoga. He then proceeded deliberately, securing everything before firing a broadside which killed or wounded one fifth of Saratogas crew. Macdonough was stunned but quickly recovered; and a few minutes later Downie was killed, crushed by a cannon flung from its carriage by a shot from Saratoga.\nElsewhere along the British line, the sloop Chubb was badly damaged and drifted into the American line, where her commander surrendered. The brig Linnet, commanded by Pring, reached the head of the American line and opened a raking fire against Eagle. At the tail of the line, the sloop Finch failed to reach station and anchor, and although hardly hit at all, Finch drifted aground on Crab Island, and surrendered under fire from the 6-pounder gun of the battery manned by the invalids from Macomb's hospital.\nHalf the British gunboats were also hotly engaged at this end of the line. Their fire forced the weakest American vessel, Preble to cut its anchors and drift out of the fight. Ticonderoga was able to fight them off, although it was engaged too heavily to support Macdonough's flagship. The rest of the British gunboats apparently held back from action, and their commander later deserted.\nAfter about an hour, Eagle had the springs to one of her anchor cables shot away, and was unable to bear to reply to Linnets raking fire. Eagles commander cut the remaining anchor cable and allowed the brig to drift down towards the tail of the line, before anchoring again astern of Saratoga and engaging Confiance, but allowing Linnet to rake Saratoga. Both flagships had fought each other to a standstill. After Downie and several of the other officers had been killed or injured, Confiances fire had become steadily less effective, but aboard Saratoga, almost all the starboard-side guns were dismounted or put out of action.\nMacdonough ordered the bow anchor cut, and hauled in the kedge anchors he had laid out earlier to spin Saratoga around. This allowed Saratoga to bring its undamaged port battery into action. Confiance was unable to return the fire. The frigate's surviving Lieutenant, James Robertson, tried to haul in on the springs to his only anchor to make a similar manoeuvre, but succeeded only in presenting the vulnerable stern to the American fire. Helpless, Confiance could only surrender. Macdonough hauled in further on his kedge anchors to bring his broadside to bear on Linnet. Pring sent a boat to Confiance, to find that Downie was dead and Confiance had struck its colours. Linnet also could only surrender, after being battered almost into sinking. The British gunboats withdrew, unmolested.\nThe surviving British officers boarded Saratoga to offer their swords (of surrender) to Macdonough. When he saw the officers, Macdonough replied, \"Gentlemen, return your swords to your scabbards, you are worthy of them\". Commander Pring and the other surviving British officers later testified that Macdonough showed every consideration to the British wounded and prisoners.\nMany of the British dead, not including the officers, were buried in an unmarked mass grave on nearby Crab Island, the site of the military hospital during the battle, where they remain today.\nThe False Nile\nBoth commanders would have seen the parallels of Macdonough's anchorage on Lake Champlain to that of the French under Vice Admiral Francois-Paul Brueys, opposing British Rear Admiral Sir Horatio Nelson, at the Battle of the Nile in Aboukir Bay on 1 August 1798. A study of Nelson's battles was part of the professional knowledge expected of naval commanders. But Macdonough did all that Brueys did not. He expected to take advantage of the prevailing winds on Lake Champlain that constrained Downie's axis of approach. \"Because nearly every circumstance that worked to Nelson's advantage proved disadvantageous to Downie, the Battle of Lake Champlain is sometimes called the False Nile by the English.\" The British naval historian William Laird Clowes regarded Macdonough's False Nile victory as \"a most notable feat, one which, on the whole, surpassed that of any other captain of either navy in this war.\"\nLand battle\nAlthough Prévost's attack was supposed to coincide with the naval engagement, it was slow to get under way. Orders to move were not issued until 10 a.m, when the battle on the lake had been under way for over an hour. The American and British batteries settled down to a duel in which the Americans gained a slight advantage, while Brisbane's feint attack at the bridges was easily repulsed.\nWhen a messenger arrived and notified Prévost that Downie's ship had been defeated on the lake he realized that without the navy to supply and support his further advance, any military advantage gained by storming Plattsburgh would have been worthless. Prévost considered he therefore had no option but to retreat, and called off the assault. Bugle calls ordering the retreat sounded out along the British lines.\nRobinson's brigade had been misdirected by some British staff officers and missed the ford which was their objective. Once they had retraced their steps, Robinson's brigade, led by eight companies of light infantry soon drove the defenders back, and the British had crossed the ford and were preparing to advance, when the orders arrived from Prévost to call off the attack. The light company of the British 76th Regiment of Foot had been skirmishing in advance of the main body. When the bugle calls to retire were heard it was too late and they were surrounded and cut off by overwhelming numbers of American militia. Captain John Purchas, commanding the company, was killed in the act of waving a flag of truce (his white waistcoat). Three officers and 31 other ranks of the 76th were made prisoner. The 76th also suffered one other man killed and three wounded.\nMajor General Brisbane protested the order to retreat but complied. The British began their retreat to Canada after dark. Although the British soldiers were ordered to destroy ammunition and stores they could not easily remove, large quantities of these were left intact. There had been little or no desertion from the British army during the advance and the skirmishing along the Saranac, but during the retreat at least 234 soldiers deserted. Very few of these desertions were from the Peninsular War veterans or the two Canadian units in Prévost's force; most were from the Regiment de Meuron, which was a mixed bag of several nationalities, the 2/8th Regiment, which was a second-rate unit decimated by sickness in the Walcheren Campaign, and the 1/27th Foot, which had been stationed in Malta and had seen action in the abortive Siege of Tarragona.\nThe British casualties during the land engagement from 6–11 September were 37 killed, 150 wounded and 57 missing. Macomb reported 37 killed, 62 wounded and 20 missing but these losses were for the regular U.S. Army troops only. Historian William James remarked that the \"general return of loss among the militia and volunteers, no where appears\". General Macomb wrote to his father that the American loss \"in the land battle\" was 115 killed and 130 wounded, a figure which suggests considerable casualties among the militia and volunteers.\nResults\n'''(obverse),Marshall Davies Lloyd Collection]]\nMacdonough's victory had stopped the British offensive in its tracks. Also, Prévost had achieved what the U.S. government had been unable to do for the entire war up to that point: to bring the state of Vermont into the war.\nThe British had used their victories at the Battle of Bladensburg and the Burning of Washington to counter any American demands during the peace negotiations up to this point, despite the Americans' successful defense at the Battle of Baltimore in the days after this battle, and which ended British activities in the Mid-Atlantic region. American negotiators used the repulse at Plattsburgh to demand exclusive rights to Lake Champlain and denied Britain's claim of exclusive rights to the Great Lakes. Thus, American actions at Plattsburgh and Baltimore denied the British any advantage they could use to make demands for territorial gains in the Treaty of Ghent, such as\na pro-British Indian barrier state in the Midwest and the \"New Ireland\" colony established in the District of Maine.\nThe failure at Plattsburgh, with other complaints about his conduct of active operations, resulted in Sir George Prévost being relieved of command in Canada. When he returned to Britain his version of events was accepted at first. As was customary after the loss of a ship or a defeat, Commander Pring and the surviving officers and men of the squadron faced a court martial, which was held aboard HMS Gladiator at Portsmouth, between 18 and 21 August 1815. The court commended Pring and honorably acquitted all of those charged. The dispatches of Sir James Yeo were published about the same time, and emphatically placed the blame for the defeat on Prévost for forcing the British squadron into action prematurely. Prévost in turn demanded a court martial to clear his name, but died in 1816 before it could be held.\nAlexander Macomb was promoted to Major General and became commanding general of the United States Army in 1828. Thomas Macdonough was promoted to Captain (and given the honorary rank of Commodore for his command of multiple ships in the battle) and is remembered as the \"Hero of Lake Champlain\". To honor the American commanders, Congress struck four Congressional Gold Medals, a record number for the time. These were awarded to Captain Thomas Macdonough, Captain Robert Henley, and Lieutenant Stephen Cassin of the U.S. Navy, and to Alexander Macomb (20 October 1814 3 Stat. 245–247). Macomb and his men were also formally given the thanks of Congress.\nSeven currently active regular battalions of the United States Army (4-1 FA, 1-2 Inf, 2-2 Inf, 1-5 Inf, 2-5 Inf, 1-6 Inf and 2-6 Inf) perpetuate the lineages of American units that were present at the battle (Brooks's Company, Corps of Artillery, and the 6th, 13th and 29th Infantry Regiments).\nOrder of battle\nLarge vessels listed from north to south in order of sailing, or in which initially anchored\n{| class=\"wikitable\"\n|-\n! style=\"background:#efefef; width:7em;\" | Navy\n! style=\"background:#efefef;\" | Name\n! style=\"background:#efefef;\" | Rig\n! style=\"background:#efefef;\" | Tonnage\n! style=\"background:#efefef;\" | Crew\n! style=\"background:#efefef;\" | Armament\n! style=\"background:#efefef;\" | Notes\n|-\n|\n| Eagle\n| Brig\n| align = \"right\"| 500&nbsp;tons &nbsp;\n| &nbsp; 150\n| 8 × 18-pounder long guns12 × 32-pounder carronades\n| Commanded by Robert Henley\n|-\n| align = \"center\"|do.\n| Saratoga\n| Corvette / Frigate\n| align = \"right\"| 734&nbsp;tons &nbsp;\n| &nbsp; 212\n| 8 × 24-pounder long guns6 × 42-pounder carronades12 × 32-pounder carronades\n| Flagship of Thomas MacdonoughClassed as a frigate in some accounts\n|-\n| align = \"center\"|do.\n| Ticonderoga\n| Schooner\n| align = \"right\"| 350&nbsp;tons &nbsp;\n| &nbsp; 112\n| 4 × 18-pounder long guns8 × 12-pounder long guns5 × 32-pounder carronades\n| Commanded by Lieutenant Stephen Cassin\n|-\n| align = \"center\"|do.\n| Preble\n| Sloop\n| align = \"right\"| 80&nbsp;tons &nbsp;\n| &nbsp; 30\n| 7 × 9-pounder long guns\n|\n|-\n| align = \"center\"|do.\n| Six gunboats\n| Galley\n| align = \"right\"| 70&nbsp;tons &nbsp;\n| &nbsp; average 40\n| 1 × 24-pounder long gun1 × 18-pounder carronade\n| Named Borer, Centipede, Nettle, ,  and Burrows\n|-\n| align = \"center\"|do.\n| Four gunboats\n| Galley\n| align = \"right\"| 40&nbsp;tons &nbsp;\n| &nbsp; average 26\n| 1 × 12-pounder long gun\n| Named Wilmer, Ludlow, Aylwin and Ballard\n|-\n| Total\n| 14 warships\n|\n| align = \"right\"|\n| &nbsp; 882\n| 779&nbsp;lb shot from long guns\n|\n|-\n| &nbsp;\n|\n|\n|\n|\n|\n|\n|-\n|\n| Chubb\n| Sloop\n| align = \"right\"| 112 tons &nbsp;\n| &nbsp; 50\n| 1 × 6-pounder long gun10 × 18-pounder carronades\n| captured\n|-\n| align = \"center\"|do.\n| Linnet\n| Brig\n| align = \"right\"| 350&nbsp;tons &nbsp;\n| &nbsp; 125\n| 16 × 18-pounder long guns\n| Commanded by Commander Daniel Pring; captured\n|-\n| align = \"center\"|do.\n| Confiance\n| Fifth-rate Frigate\n| align = \"right\"| 1200&nbsp;tons &nbsp;\n| &nbsp; 325\n| 16 × 12-pounder long gun\n| Flagship of Captain George Downie (killed); capturedFitted with a furnace for heating shot\n|-\n| align = \"center\"|do.\n| Finch\n| Sloop\n| align = \"right\"| 110&nbsp;tons &nbsp;\n| &nbsp; 50\n| 4 × 6-pounder long gun7 × 18-pounder carronades\n| captured\n|-\n| align = \"center\"|do.\n| Three gunboats\n| Galley\n| align = \"right\"| 70&nbsp;tons &nbsp;\n| &nbsp; Average 41\n| 1 × 24-pounder long gun1 × 32-pounder carronade\n|\n|-\n| align = \"center\"|do.\n| One gunboat\n| Galley\n| align = \"right\"| 70&nbsp;tons &nbsp;\n| &nbsp; 41\n| 1 × 18-pounder long gun1 × 32-pounder carronade\n|\n|-\n| align = \"center\"|do.\n| One gunboat\n| Galley\n| align = \"right\"| 70&nbsp;tons &nbsp;\n| &nbsp; 41\n| 1 × 18-pounder long gun1 × 18-pounder carronade\n|\n|-\n| align = \"center\"|do.\n| Three gunboats\n| Galley\n| align = \"right\"| 40&nbsp;tons &nbsp;\n| &nbsp; Average 26\n| 1 × 18-pounder long gun\n|\n|-\n| align = \"center\"|do.\n| Four gunboats\n| Galley\n| align = \"right\"| 40&nbsp;tons &nbsp;\n| &nbsp; Average 26\n| 1 × 32-pounder carronade\n|\n|-\n| Total\n| 16 warships\n|\n| align = \"right\"| 2,402&nbsp;tons &nbsp;\n| &nbsp; 937\n| 1,224&nbsp;lb shot from long guns922&nbsp;lb shot from carronades\n|\n|}\nMemorials\nThree US naval ships have been named for this battle; USS Lake Champlain (1917), a cargo ship during World War II. Later sold; , an aircraft carrier, and , a guided missile cruiser.\nSee also\n*Ile aux Noix\n*List of conflicts in the United States\n*War of 1812 Museum (Plattsburgh)\nFootnotes\nReferences\nBibliography\n*.\n*\n*\n*\n*\n*\n* [http://books.bloatedtoe.com/battle-of-plattsburgh-question-answer-book.html On-line version at books.bloatedtoe.com]\n*\n*\n*\n* National Historical Society Book Prize and American Military Institute Best Book Award.\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\nFurther reading\n*\n*\n*\n* Schroeder, John H. The Battle of Lake Champlain: A \"Brilliant and Extraordinary Victory.\" (Norman: University of Oklahoma Press, 2015). xiv, 164 pp.\nExternal links\n*[https://web.archive.org/web/20050308233215/http://www.galafilm.com/1812/e/events/platts.html An Overview of the Battle of Plattsburgh.]\n*[http://www.battleofplattsburgh.org Battle of Plattsburgh Association.]\n*[https://web.archive.org/web/20131105043020/http://www.historiclakes.org/biblio.html Bibliography and sources on the Battle of Plattsburgh compiled by James P. Millard.]\n*[https://web.archive.org/web/20081011042933/http://www.northnet.org/clintoncc/cccpage/battlep.htm#picture \"Defense of Plattsburgh\" painting by Lee Hunt, 1992 (Interactive).]\n*[https://maps.google.com/maps/ms?ie=UTF8&oe=UTF-8&hl=en&q=&msa=0&ll=44.680372,-73.375626&spn=0.320768,0.63858&z=11&om=1&msid=111484370351064103081.000001124b9c39a573028 Google maps, Battles of Lake Champlain and of Plattsburgh.]\n*[https://web.archive.org/web/20131030110754/http://historiclakes.org/Plattsburg/Plattsburg.html Millard, James, ''America's Historic Lakes'', links, documents, and sources.]\n*[https://web.archive.org/web/20131105043108/http://www.historiclakes.org/Plattsburg/Macomb1.htm Transcript of Alexander Macomb letter on defense of Fort Moreau.]\n*[https://web.archive.org/web/20131105043112/http://www.historiclakes.org/Plattsburg/Macomb2.htm Transcript of Alexander Macomb letter on British retreat from Plattsburg.]\n*"
    }
  ]
}