{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Ulcinj (1880)\n\n| map_type          =\n| map_relief        =\n| latitude          =\n| longitude         =\n| map_size          =\n| map_marksize      =\n| map_caption       =\n| map_label         =\n| territory         = Ulcinj would later be ceded to Montenegro\n| result            = Ottoman victory\n| status            =\n| combatants_header =\n| combatant1        = Supported by Great Powers\n| combatant2        = * Albanian irregulars\n* League of Prizren\n| combatant3        =\n| commander1        = Dervish Pasha\n| commander2        = Isuf SokoliMehmet Beci\n| commander3        =\n| units1            =\n| units2            =\n| units3            =\n| strength1         = 6,000 (1,300 participated directly)\n| strength2         = ~2,400\n| strength3         =\n| casualties1       =\n| casualties2       =\n| casualties3       =\n| notes             =\n| campaignbox       =\n}}\nThe Battle of Ulcinj took place between the Ottoman forces of Dervish Pasha and Albanian irregulars in the year of 1880 at the region of Kodre, close to Gornja Klezna. The area of Plav and Gusinje had been ceded to the Principality of Montenegro, according to the decisions of the Treaty of Berlin (1878), but the Albanians fought against the annexation. The Great Powers then persuaded the Ottomans to cede the area of Ulcinj, to Montenegro as compensation for Montenegro's losses in the Battles for Plav and Gusinje, but the Albanian population of Ulcinj resisted joining Montenegro. Eventually, the Great Powers commanded the Ottomans to take actions against the League of Prizren, ending the resistance and successfully handing over the town of Ulcinj to Montenegro.\nBackground\nThe Principality of Montenegro accepted the propositions made at the meeting of the Great Powers in Istanbul, in 1880, in order to exchange the regions of Hoti and Grude with Ulcinj. Officially, the Porte did not contest the decision but explained that the Albanians would resist. The Ottomans intended to delay the cession of Ulcinj to Montenegro, hoping to eventually avoid it, but the Great Powers were not ready to accept such delay and threatened to use force against the Ottomans.\nThe Ottomans supported the League of Prizren, as long as their interest corresponded with the interests of the League. According to some reports, the Ottomans actually armed Albanian irregulars with 3,000 rifles and 1,000 cases of ammunition in the coordinated actions of Shkodër's wali, Izet Pasha, the commander of Ottoman forces in Tuzi Osman Pasha and Odo Beg Sokolović who was appointed as commander of the forces of Prizren League.\nThe Albanians vehemently protested towards Ulcinj's annexation by Montenegr, calling it an injustice. The Great Powers did however nothing to take into consideration the demands of the Albanians. The Ottomans, expecting trouble, sent their forces in Ulcinj to clear it from resistance. The Albanians, under the leaders of Isuf Sokoli, Haxhi Mehmet Beci and Mehmet Gjyli responded with an armed uprising. The Ottomans were unable to get to the Albanians as they had surrounded the city. The Great Powers threatened with a naval demonstration if the Ottomans did not overrun the Albanians.\nThe Ottomans, frightened by the Great Powers, sent Riza Pasha with 3000 soldiers to Shkodër to crush the League of Prizren. Riza Pasha warned that anyone who stood in the way would suffer the consequences. Riza Pasha proceeded to declare a total isolation of the city of Shkodër, banning all merchandise in order to starve the Albanians of Ulcinj. 2000 Albanians, commanded by Muftar Aga Reci positioned themselves in Kraje, at the mountains of Mozhura, in order to make the transportation of Riza Pashas forces as difficult as possible. The Great Powers, hearing that Riza Pasha had failed to siege Ulcinj, sent their naval armadas outside the bay of Ulcinj, consisting of English, French, German, Russian, Italian and Austro-Hungarian along the coast of Dalmatia. This, however did not frighten the Albanians.\nPre-war and Resistance\nThe Battle of Ulcinj was a battle between the Ottoman forces of Dervish Pasha and Albanian guerilla fighters of the League of Prizren on November 22, 1880, for ultimate control of the city of Ulcinj.\nFollowing the Russo-Turkish War and the subsequent Treaty of Berlin, the Principality of Montenegro agreed to territorial exchanges with the Ottoman Empire. Since the formation of the League of Prizren, there was a growing sense of nationhood during the “Rilindja” period in the 19th century where many Albanians sought to create a unified state – within the Ottoman Empire. After the Treaty of Berlin, many Albanian lands were partitioned to neighboring powers, which fueled the league to pursue any measure necessary to bring Albanian-speaking lands together. Regarding our story here, the exchange in question that led to the Battle of Ulcinj was the transfer of the regions of Hoti and Gruda from Montenegro the Ottomans in exchange for Ulcinj. While the Porte officially did not oppose this decision, it asserted that the Albanians would offer a staunch resistance to this policy, as it would separate them from the Vilayet of Shkodër and isolate them in a land that was predominantly Slavic and orthodox Christian. The Ottomans initially sought to postpone the secession of Ulcinj to Montenegro, hoping to avoid it altogether. However, the Great Powers (consisting of Great Britain, France, Germany, Italy, and Austria-Hungary), unwilling to tolerate any delay, threatened the use of force against the Ottomans if they did not capitulate and agree to their end of the bargain.\nFearful of the consequences imposed by the Great Powers, the Ottomans dispatched Riza Pasha with 3,000 soldiers to Shkodra to crush the League of Prizren. Issuing warnings of severe consequences for anyone opposing him, Riza Pasha implemented a total siege, completely isolating Shkodër and the surrounding lands to choke the Albanians of Ulcinj into submission. Positioned in Kraje, at the mountains of Mozhura, 2,000 Albanians, commanded by Muftar Aga Reci, aimed to hinder the transportation, and disrupt the supply lines and wagon trains of Riza Pasha's forces and temporarily lifted the siege.\nIn response, the Great Powers granted Riza Pasha a three-day ultimatum to surrender the city to Montenegro. Despite the presence of 6,000 Ottoman soldiers in the city, their attempts to advance were effectively impeded. The Great Powers, upon learning that Riza Pasha had failed to besiege Ulcinj, deployed a naval armada led by Lord Admiral Frederick Beauchamp Seymour: 1st Baron of Allsterr and consisting of English, French, German, Russian, Italian, and Austro-Hungarian forces along the coast of Dalmatia and Montenegro to ensure the successful transfer of Ulcinj to Montenegro. Surprisingly, this united and formidable display of naval power did not intimidate the Albanians, and they continued with their resistance.\nIn response to the challenges encountered, Riza Pasha was relieved of his duties – and the Ottomans appointed Dervish Pasha, the former WALI of the Vilayet of Salonika, as the new WALI of Shkodër and tasked him to bring the Albanians to heel and deliver the city to Montenegro.\nOn November 1, 1880, Dervish Pasha, accompanied by 1,300 Ottoman infantry arriving by ship, attempted take Ulcinj by sea - however, he received staunch resistance posed by Albanian guerilla fighters stationed at Ulcinj's citadel, and was forced to take different measures.\nUpon his arrival, Dervish Pasha issued an ultimatum to the irregulars refusing to surrender Ulcinj. 800 citizens of Ulcinj, along with volunteers from Tuzi, Shkodër, Tetovo, Shkreli, Dibra, Kelmend, Prizren, and Gjakova, the ultimatum yielded no results. British and Hungarian consultants in Shkodër negotiated an agreement with Dervish Pasha, that will allow him to persuade the Albanians to surrender the city, proposing safe passage to leave the city and settle within the empire. After three days of unsuccessful bargaining, Dervish Pasha ordered his army to march into the city.\nOn November 22, 1880, Ottoman forces under the command of Dervish Pasha crossed the Buna River near the village of Klezna. They encountered a small unit of Albanian irregulars encamped near the Lake of Shas, initiating a skirmish where both sides exchanged gunfire. During the night, Albanian irregulars received reinforcements of 500 men and continued the battle until they were forced to retreat.\nThe decisive clash between the Albanians and Ottomans occurred at Kodra e Kuqe, outside the city of Ulcinj. Led by Isuf Sokoli, Haxhi Mehmet Beci, and Mehmet Gjyli, the Albanians prevailed against the first wave of Ottoman forces, however, the arrival of additional Turkish reinforcements eventually led to their retreat and inevitable defeat. The commander of Ulcinj's militia, Isuf Sokoli, was wounded, and later succumbed to his injuries on the same day, along with many other Albanians, who courageously sacrificed themselves against a world superpower.\nOn November 23, 1880, the Ottomans continued their march into the city, ultimately surrendering it to the Montenegrin army. A Montenegrin military unit of 200 Catholics from Bar was ordered to place the Montenegrin flag on the top of Ulcinj fortress. In the Spring of 1881 the Ottoman forces under Dervish Pasha undertook a military campaign and crushed the Prizren League without much resistance. The official handover marked the culmination of a 30-month-long negotiation process involving the European powers, concluding the battle.\nDespite Dervish Pasha's attempts to encourage the population of Ulcinj to emigrate to the Ottoman Empire, no one departed before the arrival of the Montenegrin army, given their prior experience as Montenegrin citizens from January 1878 to February 1879. The local population, in a strange brew of elation, confusion and anger, took to the streets to witness Montenegrin Army receive the command of the city. On the “day of liberation” the Montenegrin Voivode, Božo Petrović, received a welcome from the city leaders and assured them that there would be peace. Petrović demanded the organization of elections for the City Assembly and court, with the Voivode Simo Popović being selected as its first Mayor, thus beginning Ulcinj's new reality of being subjects to the Montenegrin crown.\nCasualties\nThe fight resulted in around 700 casualties, of which 300 Ottoman soldiers and 400 Albanian irregulars who were killed or wounded. There were minimal or no civilian casualties.\nAftermath\nThe relinquishment of Ulcinj to Montenegro intensified the resentment of the Albanian population towards Ottoman policies and eventually towards the Montenegrins, especially after the influx and implantation of Montenegrin nationals into the city and the displacement of many Albanians out of the region in the process. Ulcinj would remain under Montenegrin control until 1918, when the Kingdom of Montenegro would be absorbed into the Kingdom of Serbs, Croats, and Slovenes and subsequently the Kingdom of Yugoslavia. Ulcinj, would briefly unite with the Albanian protectorate (under the Italian Crown) and then German protectorate between 1941 and 1944 under the leadership of Cafo Beg Ulqini, and would then be returned to the newly formed Communist Yugoslavia as World War 2 ended.\nSee also\n*Battles for Plav and Gusinje\nReferences\nSources\n*\n*\n*\n*\nFurther reading\n*\n*"
    }
  ]
}