{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Hollingstedt\n\n| combatant2        =\n| commander1        =\n| commander2        = Rudolph Felix Bauer\n| strength1         = 500–1,000 men4 cannons\n| strength2         = 4,0008 cannons\n| casualties1       = 33\n| casualties2       = 300\n| campaignbox       =\n}}\nThe Battle of Hollingstedt was fought on 24 January 1713 between Sweden and Russia, in the German theatre of the Great Northern War. Whilst in Ottoman exile, Charles XII of Sweden commanded Magnus Stenbock to lead an army from Swedish Pomerania east, against Russia. Circumstances forced Stenbock to march west into neutral Holstein-Gottorp, pursued by a large coalition army. The Swedes took position west of the Treene river, only sparing the bridge at Hollingstedt (east of the river) where an outpost was established.\nA Russian force under Rudolph Felix Bauer was sent to dislodge them. The Swedes, under Diedrik Johan von Löwenstern and Christer Reinhold von Schlippenbach, quit the village after some fighting to defend the bridge. Several Russian attacks were repulsed until Bauer forded the frozen river elsewhere. The Swedes counter-attacked his bridgehead, forcing him back over the river. Consequently, Stenbock believed a general battle was imminent; he deployed his troops in exposed weather for three days before withdrawing closer to Tönning, which the Gottorpers permitted him to use. He was eventually pushed inside the fortress by the coalition and besieged until his surrender in May 1713.\nBackground\nAfter the Swedish defeat at Poltava in 1709, Denmark–Norway and Saxony reentered the Great Northern War on Russia's side. From his exile in the Ottoman Empire, king Charles XII planned to use Swedish Pomerania as a staging point for new offensives into the Polish–Lithuanian Commonwealth and Russia in conjunction with the Ottomans. Accordingly, a larger Swedish army under Magnus Stenbock was shipped over from Sweden proper to the Rügen island at Stralsund in September 1712. The city had been blockaded by the coalition for a year, following an invasion of the Swedish German dominions. However, Stenbock's supply transport was badly mauled by the Danes off Wittow, making his position near Stralsund unsustainable and a march into Poland infeasible.\nStenbock's campaign\n'', by Johann Heinrich Wedekind]]\nIn early November, Stenbock penetrated the coalition pocket at Damgarten with 16,000 men and marched west into neutral Mecklenburg-Schwerin to feed the army. He hoped to receive a second transport of supplies and troops either at the port town of Rostock, which was quickly captured, or Wismar. 22,000 Saxons and Russians shadowed Stenbock from Pomerania, with the intention of uniting forces with a Danish army of some 16,000 men further west of him. The Danes broke into Mecklenburg in December, but Stenbock defeated them at Gadebusch before an enemy conjunction was made possible. His army was too weak to follow up the victory and remained near Wismar, before marching further west into Schleswig-Holstein on 30 December.\nStenbock, deprived of another transport due to disease and unfavourable winds, departed the coast on 3 January and went into Danish-Holstein to live off the land. He marched through Segeberg–Pinneberg–Itzehoe, burning Altona along the way, into neutral Holstein-Gottorp near Heide and crossed the Eider river at Friedrichstadt on 17 January. Stenbock stopped at Husum since the army was deemed too weak to continue into Jutland; his north side was protected by the Arlau river, the south and east by the Treene (a tributary to the Eider) and the west by the Eiderstedt peninsula and Tönning – the Gottorpers permitted him to use the fortress as a last resort.}} Stenbock envisaged that a shortage of supplies, renewed Ottoman offensives, or the interference of foreign powers would eventually force the pursuing coalition away. All bridges were destroyed but one going over the Treene at Hollingstedt, where a few squadrons under colonel  formed an outpost.\nBattle\nin 1887]]\nLöwenstern's patrols informed Stenbock that coalition forces were crossing the Eider from the south, threatening to also cross the Treene at Hollingstedt. Stenbock sent 500 infantry from the Södermanland Regiment under colonel  and four cannons to reinforce Löwenstern. Löwenstern's cavalry included squadrons from either or both the  and the , whom were tasked with observing the Treene.}} He arrived on 23 January and, at Löwenstern's request, deployed 200 infantry at the graveyard in Hollingstedt, situated east of the river. At dawn the next day, alarm went out of an approaching Russian force; Löwenstern assembled his cavalry at the clergy house in front of Schlippenbach, who led the graveyard's defence supported by his cannons from the western bank.\nTsar Peter I sent Rudolph Felix Bauer with 4,000}} infantry and dragoons to dislodge the Swedes from the bridge, supported by eight cannons. He arrived at eight o'clock the next morning and forced Löwenstern to give way after some fighting. The pursuit of the Swedish cavalry stopped at the graveyard, where Schlippenbach put up a stiff resistance. Russian attempts to cut him off from the bridge were prevented as Schlippenbach conducted a fighting retreat, covered by a 50-man strong rearguard. The combat resumed at the bridge for half an hour, resulting in several attacks being repulsed. Thousands of Russians eventually managed to ford the frozen river and occupy a dam on Schlippenbach's left flank, forcing him to quit the bridge.\n]]\nLöwenstern and Schlippenbach, now reinforced with the other 300 infantry, counter-attacked to prevent Bauer from securing a bridgehead. The artillery was used to great effect against the dam, which he utilised as a breastwork. After an hour of fighting, in which the Swedish Cronstedt cannons}} silenced their Russian counterparts, Bauer withdrew over the river to Hollingstedt. The Swedes partially destroyed the bridge in the night, and severed it completely several days later to prevent it from falling into enemy hands. The Russian losses were probably considerable,}} with some sources putting them at 300 men. The Swedes allegedly witnessed them transporting four wagons with dead, apart from a captain and several others who were buried at Hollingstedt. The Swedes had one captain, one lieutenant and 10 privates killed, and one second lieutenant and 20 privates wounded.\nAftermath\nIt is disputed among the sources which side won the battle; in their respective works about the Tsar, Daniel Defoe indicates that the Swedes were successful, while Alexander Gordon suggests the opposite. The Russians captured Hollingstedt, which prevented the Swedes from using the village for reconnaissance, but failed to take the bridge.\n]]\nAs a result, Stenbock, who mistakenly believed that the coalition sought a general battle, formed up his army near Mildstedt; the troops endured in exposed weather for three days, until they were withdrawn into Eiderstedt on 26 January. It became increasingly apparent to Stenbock that a Swedish rescue fleet was of the essence. After having united forces, the coalition army counted 38,000}} privates and non-commissioned officers. The Swedish forward positions were assaulted on 12 February and pushed further back towards Tönning and its garrison of some 1,750 Gottorpers.\nOn 19 February, a Swedish breakout attempt over the Eider failed; as did a sortie against Friedrichstadt three days later. Desertions, disease and famine further escalated in April, as the Swedes were being enclosed also from the sea. Rather than facing a major coalition offensive over Eiderstedt on 27 April, Stenbock withdrew all his troops into Tönning. On 16 May, he capitulated and became a prisoner of war along with 10,500 privates, NCOs and officers, of whom almost 3,000 were sick. The bulk of the coalition forces returned to Swedish Pomerania, eventually capturing Stettin (Szczecin) and Stralsund in 1713 and 1715, respectively. The Gottorpers in Tönning held out until February 1714, when they finally surrendered to the besieging Danish army.\nSources\nNotes\nCitations\nBibliography\n*\n|first=Claes\n|last=Annerstedt\n|author-link=Claes Annerstedt\n|language=sv\n|year=1906\n|publisher=Norstedt\n|location=Stockholm\n|oclc=924849834\n}}\n*\n|first=Daniel\n|last=Defoe\n|author-link=Daniel Defoe\n|year=1723\n|publisher=W. Chetwood\n|location=London\n|oclc=187300321\n}}\n*\n|first=Alexander\n|last=Gordon\n|author-link=Alexander Gordon (general)\n|year=1755\n|publisher=F. Douglass and W. Murray\n|location=Aberdeen\n|oclc=181834574\n}}\n*\n|first=Steve\n|last=Kling\n|author-link=\n|year=2015\n|publisher=THGC Publishing\n|location=St. Louis\n|isbn=978-0-9964557-3-2\n}}\n*\n|first=Samuel\n|last=Loenbom\n|language=da\n|year=1790\n|publisher=Boghandler Mallings Forlag\n|location=Copenhagen\n|oclc=1227927385\n}}\n*\n|first=Arnold\n|last=Munthe\n|author-link=\n|language=sv\n|year=1927\n|publisher=Hæggströms boktryckeri och bokförlags AB\n|location=Stockholm\n|oclc=836609668\n}}\n*\n|first=Jöran\n|last=Nordberg\n|author-link=Jöran Nordberg\n|language=sv\n|year=1740\n|publisher=Pet. Momma\n|location=Stockholm\n|oclc=929239840\n}}\n*\n|first1=August\n|last1=Tuxen\n|first2=Carl\n|last2=With-Seidelin\n|author-link=\n|language=da\n|year=1910\n|publisher=Gyldendalske Boghandel, Nordisk Forlag\n|location=Copenhagen\n|oclc=929129626\n}}\n*"
    }
  ]
}