{
  "content": [
    {
      "type": "text",
      "text": "# Battle Chess 4000\n\n| genre         = Computer chess\n| modes         = Single-player, multiplayer\n}}\nBattle Chess 4000 is a 1992 chess video game developed and published by Interplay Productions for the MS-DOS. It is a sequel to Battle Chess II: Chinese Chess and the third game in the Battle Chess series.\nGameplay\nThe player is an anonymous chess grandmaster who has traveled through time to the year 4000 aboard a space station that orbits Earth and has a huge chessboard within. The standard chess pieces have been replaced by alien creatures.  The game has a rewind feature where the player can rewind or fast forward to any played turn. Elo rating is graded by completing 24 chess puzzles. The multiplayer supports head-to-head and modem play. The game features an opening library of 300,000 moves and SVGA graphics.\n| rev1 = PC Joker\n| rev1Score = 60%\n| rev2 = PC Player (DE)\n| rev2Score = 67%\n| rev3 =\n| rev3Score = 70%\n}}\nComputer Gaming World concluded: \"Battle Chess 4000 has transformed chess from a stuffy, intellectual exercise into a game that is fun to play. It combines great comedy, superb graphics, and a serious chess game without compromising anything along the way.\" PC Games called the game extremely funny but said the playing strength is not enough for serious chess players and recommended the game for beginners and advanced players. The tutorials were said to come nowhere close to the ones in Chessmaster 3000. PC Player said Chessmaster 3000 has more conservative graphics but is ahead of Battle Chess 4000 in terms of playing strength and game features.  said the battle animations are entertaining at first but grow old fast. Chessmaster 3000 was recommended for serious chess players, Battle Chess 4000 was suggested for casual players. PC Joker said that after you've seen all the fight combinations, you're left with a below average chess program.\nIn a comparison between 13 chess programs,  rated Battle Chess 4000 the fifth lowest. In a 1995 comparison between 11 chess programs, Computer Gaming World rated Battle Chess 4000 the sixth highest, noting that \"the humor by this point in the series feels a little forced\".\nReferences\nExternal links\n*\n*"
    }
  ]
}