{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Piqua__disambig_1\n\n|commander2  = Black Hoof\n|commander1  =  George Rogers Clark\n|strength2   = 450 Indians\n|strength1   = 970 militia\n|casualties2 = 5–6+ killed 3 wounded\n|casualties1 = ~45 killed  40 wounded\n|campaignbox =\n}}\nThe Battle of Piqua, also known as the Battle of Peckowee, Battle of Pekowi, Battle of Peckuwe and the Battle of Pickaway, was a military engagement fought on August 8, 1780, at the Indian village of Piqua along the Mad River in western Ohio Country between the Kentucky County militia under General George Rogers Clark and Shawnee Indians under Chief Black Hoof.  The Indians were driven off and the village and surrounding fields burned, but Clark suffered daunting casualties. Clark's expedition was in response to Bird's invasion of Kentucky earlier that summer by a combined force of Shawnee, Lenape and Miami warriors that killed and captured hundreds of white settlers.\nBackground\nNational Park Service map of the battle\nThe battle was part of a campaign in Ohio Country in the Western theater of the American Revolutionary War. Led by General George Rogers Clark, 970 soldiers crossed the Ohio River near present-day Cincinnati in early August 1780 and proceeded up the Little Miami and Mad Rivers. They reached the Shawnee village of Old Chillicothe (north of what is today Xenia, Ohio), which was known then as Chalawgatha to the Shawnee. Clark found it deserted and ordered it burned. He then proceeded a few miles north to the village of Piqua (not to be confused with the modern town of Piqua, Ohio on the Great Miami River) where the Shawnee had retreated. Clark arrived at the village August 8, 1780. The village surrounded a small stockade. Piqua was at that time the capital village of the Shawnee and contained at least 3000 persons.\nBattle\nAfter several hours of fighting, both sides suffered significant casualties.  The Shawnee were driven off when Clark used artillery to bombard the stockade from river cliffs above the village. Clark's men then spent two days burning as much as 500 acres of corn surrounding the village. Clark reported 27 casualties (14 killed and 13 wounded), but historians have corrected that number to almost three times that based on eyewitness accounts of survivors.  The Shawnee suffered an unknown number dead, but at least five are known killed.\nAftermath\nThis defeat so decimated the Shawnee that rather than rebuild the village, they moved to the Great Miami River where they settled just north of what is today the modern town of Piqua, Ohio and named their village Peckuwe (later anglicized to \"Piqua\"). The battle, the largest of the war west of the Allegheny Mountains, was one of only a handful of military engagements in Ohio Country during the American Revolutionary War. A memorial trail and state park, the George Rogers Clark Memorial () and Tecumseh State Park, was later built on the site of the battle by the Clark County Historical Society. An official ceremony was held on the 142nd anniversary to commemorate a monument to George Rogers Clark, an 18&nbsp;ft. marble statue, as well as the birthplace of Tecumseh. The park was enlarged in 1930 and, on the sesquicentennial celebration of the battle, an historical conference was held at nearby Wittenberg College on October 9, 1930.\nSee also\n* American Revolutionary War § Stalemate in the North. Places ' Battle of Piqua ' in overall sequence and strategic context.\nReferences"
    }
  ]
}