{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Rowlett's Station__disambig_1\n\n| place             = Hart County, Kentucky\n| casus             =\n| territory         =\n| result            = Inconclusive\n| combatant2        =  CSA (Confederacy)\n| combatant1        =  United States (Union)\n| commander2        = Benjamin Franklin Terry Thomas Carmichael Hindman\n| commander1        = Alexander McDowell McCookAugust WillichKarl Friedrich Heinrich von Trebra\n| units1            = 32nd Indiana Volunteer Infantry\n| units2            = Terry's Texas Rangers8th Texas Cavalry1st Arkansas Battalion\n| strength2         = 1,350\n| strength1         = 500\n| casualties2       = 91\n| casualties1       = 40\n| notes             =\n}}\nThe '''Battle of Rowlett's Station (also known as Battle of Woodsonville or Green River''') was a land battle in the American Civil War, fought at the railroad whistle-stop of Rowlett's in Hart County, Kentucky, on December 17, 1861. The outcome was inconclusive, although the Union Army continued to hold its objective, a railroad bridge across the Green River.\nBackground and opposing forces\nBrig. Gen. Don Carlos Buell assumed command of the Army of the Ohio in November 1861, and in an attempt to consolidate Union control over the surrounding area, organized a spate of troop movements into the field. Part of these movements included the march of the 2nd Division under Brig. Gen. Alexander McDowell McCook into Kentucky, with the goal of forcing the Confederates from the state. Meanwhile, the Confederate Western Department, under General Albert Sidney Johnston, set up a defensive line along the Green River near Munfordville, Kentucky.\nOn December 10, 1861, under directions from McCook, Brig. Gen. Richard W. Johnson ordered troops toward the Confederate lines near Munfordville to secure the Louisville and Nashville Railroad bridge spanning the Green River. In the meantime, Rebel divisions under Brig. Gen. Thomas C. Hindman, which included a Confederate force of Terry's Texas Rangers, Arkansas infantry, and Mississippi artillery, responded by blowing up the south pier of the railroad bridge and about  of track. Col. August Willich of the 32nd Indiana Infantry Regiment sent two companies across the river to protect workers repairing the bridge and to help build a temporary pontoon bridge. When the pontoon bridge was completed on December 15, Willich ordered two more companies south of the river to reinforce the troops already on duty and posted four companies on the river's north side. Civilian stonemasons arrived from Louisville, Kentucky, on December 16 to repair the railroad bridge.\nThe Union forces were mainly men from the 32nd Indiana Infantry Regiment, also known as Indiana's \"1st German\" regiment, which was composed mainly of German immigrants and descendants of  German settlers from the Midwest. Col. Willich had assumed command at the request of Indiana's governor, Oliver P. Morton. Willich was a disciplinarian who used Prussian bugle calls to direct his regiment on the parade ground and in battle.\nThe Confederates were primarily the 8th Texas Cavalry Regiment, which became known as Terry's Texas Rangers, formed by Col. Benjamin Franklin Terry. General Johnston had requested Terry to join the army he was raising, promising him an independent command. The 8th Texas voted to join the general in Kentucky.\nBattle\n.]]\nAround midday on December 17, 1861, while construction crews repaired the stone railroad bridge, a Union picket continued south of the bridge. Advancing into the woods, the Union forces discovered enemy skirmishers south of Woodsonville. The latter retreated until the Texas cavalry could join them, and then attacked the Union companies that crossed the river to aid their comrades.\nA detachment of Union companies from the 32nd Indiana (fewer than 500 men) under Lt. Col. Henry von Trebra fought 1,300 Confederate troops, including Terry's Texas Rangers, the Mississippi artillery, and the Arkansas infantry under Brig. Gen. Hindman. The outmanned 32nd Indiana companies fell into a defensive square formation; the Rangers responded by storming the Union lines. Battery A, 1st Ohio Light Artillery, and Battery A, Kentucky Light Artillery, provided support to the Union troops from positions on the north side of the river, while Swett's Company, Light Artillery (Warren Light Artillery) of Mississippi fired on Union reserves and skirmishers along the road toward Munfordville. The Rangers continued their charge and hand-to-hand fighting with the Union infantrymen until the Confederates were finally repelled.\nDuring the battle, Col. Terry of the Rangers was mortally wounded. On the Union side, Lt. Max Sachs of the 32nd Indiana and a platoon of his men found themselves isolated by the Rangers, but repeatedly defied demands to surrender and continued to fight until Sachs and three of his men were either killed or mortally wounded; seven more Union soldiers in the group were wounded as well.\nCol. Willich, who was away at division headquarters at the beginning of the battle, returned in time to order a withdrawal to a stronger position in the rear; Brig. Gen. Hindman, who was aware of the imminent approach of McCook's Union reinforcements, ordered the Confederates to withdraw from the field.\nAftermath\nBoth sides claimed victory, but the outcome was indecisive. Union forces remained in control of the field of engagement and continued to ensure the movement of Union men and supplies on the Louisville and Nashville Railroad. Casualties from both sides were scattered over a wide area, making recovery and the accounting of those lost, wounded, or missing a difficult task.\nIn the weeks following the battle, the 32nd Indiana gained nationwide recognition in the newspapers for its stand against Confederate forces at Rowlett's Station. The battle was one of the few times during the Civil War when the Union infantry successfully defended itself in the open against repeated Confederate cavalry assaults.\nCasualty reports varied and were initially overstated. General Buell reported Confederate casualties at 33 dead, including Col. Terry, and at least 50 wounded. General Hindman acknowledged Terry's death, but claimed few losses of his men and as many as 75 Union dead. Col. Willich initially reported casualties for the 32nd Indiana as one officer and 10 men killed, 22 wounded, and 5 missing; however, the regiment's final count was 46 (13 killed, 28 wounded, and 5 captured).\nThe 32nd Indiana Regiment's dead were originally buried near the battle site. In 1867 the state of Kentucky transferred the remains of 21 Union soldiers, 14 of them from the 32nd Indiana, and a limestone tablet known as the 32nd Indiana Monument bearing an inscription in German in the infantry soldiers' honor to Cave Hill National Cemetery at Louisville, Kentucky. In December 2008 the monument was removed from the national cemetery for conservation treatment due to its deteriorated condition. It was relocated indoors at the Frazier History Museum in Louisville in August 2010 as a long-term loan from the National Cemetery Administration. Although the stone monument has been moved from its original location, it is generally considered to be the oldest surviving American Civil War monument in the United States. A replacement monument to the 32nd Indiana was dedicated at Cave Hill National Cemetery on December 16, 2011.\nThe 8th Texas Cavalry Regiment changed its name to \"Terry's Texas Rangers\" in honor of the fallen colonel.\nThe Battle of Rowlett's Station was soon overshadowed by Union victories at Mill Springs, Kentucky, and Fort Henry and Fort Donelson, Tennessee.\nOrder of battle\n;Union Army\nBrig. Gen. Alexander McDowell McCook\nInfantry\n* 32nd Indiana Infantry Regiment\nArtillery\n* Battery A, Kentucky Light Artillery (Stone's Battery)\n* Battery A, 1st Ohio Light Artillery\n;Confederate Army\nBrig. Gen. Thomas Carmichael Hindman\nInfantry\n* 1st Arkansas Infantry Battalion\n* 2nd Arkansas Infantry Regiment\n* 6th Arkansas Infantry Regiment\nArtillery\n* Swett's Company, Light Artillery (Warren Light Artillery)\nCavalry\n* 6th Arkansas Cavalry Battalion\n* 8th Texas Cavalry Regiment\nSee also\n* German-Americans in the Civil War\n* List of battles fought in Kentucky\nNotes\nReferences\n*\n*\n*\n*\n*\n*\n*\n*\n*\nExternal links\n* [http://www.terrystexasrangers.org Papers at the Terry's Texas Rangers website]"
    }
  ]
}