{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Nihriya__disambig_1\n\nThe Battle of Niḫriya was the culminating point of the hostilities between the Hittites and the Assyrians for control over the remnants of the former empire of Mitanni in Upper Mesopotamia, in the second half of the 13th Century BC.\nWhen Hittite king Šuppiluliuma I (r. c. 1344–1322 BC) conquered Mitanni, he created two provinces (Aleppo and Carchemish), and distributed the large part of territories of this kingdom among his allies. The rest of what had been the empire of Mitanni retained its independence as a Hittite vassal state called Ḫanigalbat. During the reign of the Hittite king Muršili III (better known as Urḫi-Teššub), Ḫanigalbat was subjugated by the Assyrians, who now advanced to the East bank of the Euphrates. When Ḫattusili III (r. c. 1267–1237 BC) ousted his nephew Muršili III and seized the Hittite throne, he had to be content with the permanent loss of Ḫanigalbat to the Assyrians despite its former status as a Hittite vassal state. Nevertheless, the Assyrians encountered repeated opposition by their new vassals, the kings of Ḫanigalbat, who naturally looked upon the Hittites as their allies.\nThe Assyrian involvement in northwestern Mesopotamia continued under King Šulmānu-ašarēd I and precipitated a crisis with Ḫatti. The Hittites considered Assyrian involvement to be a clear attack on the frontiers of their empire and took to arms under King Tudḫaliya IV (r. c. 1237–1209 BC), Ḫattusili's son and successor. This led to a major battle which is known today as the Battle of Niḫriya, ostensibly fought between Tudḫaliya (named in KUB XXIII 99 and RS 34.165) and Šulmānu-ašarēd (named in KUB XXIII 99 and KBo XVIII 24). The Ugarit letter RS 34.265, giving details of the campaign and its outcome, was sent by Šulmānu-ašarēd to the Hittite vassal king of Ugarit.\nInformation relating to the conflict contained in the Hittite tablet KBo IV 14 has been interpreted by Nemirovsky to show that the battle must have occurred some ten years before the end of Šulmānu-ašarēd's reign (which he dates to 1264–1234 BC), and that this might necessitate picking the Egyptian \"Middle Chronology\" for the accession of Ramesses II, placing it in 1290 BC, rather than 1279 BC (as per the \"Low Chronology\"), to allow a more comfortable overlap with Tudḫaliya IV.\nNevertheless, a number of scholars have interpreted the Battle of Niḫriya as a conflict between Tudḫaliya IV and Šulmānu-ašarēd's son and successor Tukultī-Ninurta I, whose inscriptions boast of his attack on the Hittites, the Assyrian having crossed the Euphrates, resulting in his deportation of supposedly 28800 Hittite subjects to Assyria. These interpretations assume that the broken text of KBo XVIII 99 made reference to \"[Tukultī-Ninurta, son of] Šulmānu-ašarēd\" when intact.\nLocation\nThe long-standing idea that Niḫriya is to be equated with the region of Na’iri, along the Upper Tigris, has been shown to be erroneous by Jared Miller. In accordance with the information contained in the Mari and Dūr-Katlimmu letters, Niḫriya was located in the Upper Balikh region. More specifically, Miller suggested that Niḫriya should be sought within an area of some 50 km of Şanlıurfa (Edessa) or Ḫarran. Massimo Forlanini suggested placing Niḫriya at Lidar Höyük near the Euphrates, a little east of the crossing to Samosata. Miller considered this a little too far north and east, and too close to the Euphrates, while agreeing that Şanlıurfa should lie somewhere between Ḫarran and the Euphrates. An attractive candidate originally suggested by Miller, the important site of Kazane Höyük on the territory of modern Şanlıurfa, is deemed unsuitable by Gojko Barjamovic and Miller, who note that had evidence of significant Early and Middle Bronze Age occupation, but appears to have been abandoned in the Late Bronze Age. Alternative localizations for Niḫriya suggested by Barjamovic are the large mounds at Turna (formerly Karük) and Telgoran (Telgören, now Yollarbaşı) some 66 to 77 km east-northeast of Şanlıurfa.\nOutcome\nThe conflict between the two great powers took place in the neighborhood of Niḫriya, with the Assyrians gaining a decisive victory. The Assyrian victory shook the Hittite state to its foundations as its king Tudḫaliya IV faced several internal revolts against his reign. Tudhaliya IV would ultimately overcome all these challenges to his authority and retain the kingship of Hatti. Hostilities between Assyria and Ḫatti continued for some five years before a peace was negotiated and maintained.\nNotes\n*\n* .\n*\n*\n* .\n*\n*\n*\n*\n*  (Немировский А.А., \"Синхронизмы эпохи Хаттусилиса III и «короткая» хронология позднебронзового века.\", Вестник древней истории, (2003/2) 3-15).\n* , cited as reprinted in\nSee also\n*Short chronology timeline"
    }
  ]
}