{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Landriano\n\n|commander2= Antonio de Leyva\n|strength1=\n|strength2=\n|casualties1=\n|casualties2=\n}}\nThe Battle of Landriano took place on 21 June 1529, between the French army under Comte de Saint-Pol and the Imperial–Spanish army commanded by Don Antonio de Leyva, Duke of Terranova in the context of the War of the League of Cognac. The French army was destroyed and the battle's strategic result was that the struggle between Francis I of France and Charles V, Holy Roman Emperor for control of northern Italy was temporarily at an end.\nBackground\nIn 1528 the Genoese Admiral, Andrea Doria, after deserting in favour of Emperor Charles V, managed to break up the French siege of Naples; his efforts were helped by the plague, which decimated the French besiegers, among them General Odet of Foix, Viscount of Lautrec, who died on 15 August. After his death, the French army was commanded by Giovanni Ludovico of Saluzzo, who, under the circumstances ordered his troops to withdraw on 29 August, but eventually the Imperial–Spanish forces led by Philibert of Châlon, Prince of Orange, caught up with them and decimated them. Shortly after the whole French army in the south of Italy capitulated.\nBetween August 1528 and June 1529, intense diplomatic activities between King Francis I of France and Holy Roman Emperor Charles V resulted in the Treaty of Barcelona.\n.]]\nBattle\nOn 21 June 1529 King Francis I still had his troops stationed in Landriano, a region of Lombardy, near Pavia, scene of the decisive confrontation which resulted in a total French defeat in Italy.\nThe Comte de Saint-Pol's reserve French troops were intercepted and neutralised by the Spanish troops commanded by Don Antonio de Leyva, Duke of Terranova. The French army was destroyed, which ended Francis's hopes of regaining his hold on Italy. The French commander, Saint-Pol, was also captured, leaving the Duchy of Milan under the complete control of the Emperor.\nHostilities continued however, although without any French participation, with the Imperial–Spanish army led by Philibert of Châlon, Prince of Orange, against the Republic of Florence and installing Alessandro de' Medici as the ruler of Florence.\nAftermath\nWith France's defeat in Landriano and the Treaty of Barcelona, Francis I of France felt obliged to begin negotiations with the Emperor.\nOn 3 August, the King of France's mother, Louise of Savoy, and the Emperor's aunt, Margaret of Austria, signed the Treaty of Cambrai. Francis obtained the restitution of his sons, but on the condition that he had to abandon Italy, persuade the Venetians and the Duke of Ferrara to restore the occupied lands to the Emperor and Pope Clement VII, not to interfere in the affairs of Italy and Germany, and to cooperate in the fight against the Protestants, to provide compensation of 200,000 ducats and send 4 ships, 12 galleys and 4 galleons for when the Emperor planned to go to Italy for his coronation.\nThe Treaty made no reference to the Duchy of Burgundy, evening out with this silence the humiliating situation that was put to Francis in the Treaty of Madrid.\nSee also\n*Siege of Florence (1529–30)\n*List of governors of the Duchy of Milan\nNotes\nReferences\n*Cadenas y Vicent, Vicente. España en Italia. La Herencia Imperial de Carlos V en Italia: El Milanesado (1978) Madrid.\n*Hassall, Arthur. France Mediaeval and Modern a History [https://books.google.com/books?id=jf9eFqs-x_EC&dq=battle+of+landriano&pg=PA105] (2009) BiblioBazaar. LLC.\n*Konstam, Angus. Pavia 1525: The Climax of the Italian Wars. Oxford: Osprey Publishing (1996)\n*Taylor, Frederick Lewis. The Art of War in Italy (1494–1529). Greenwood Press (1973)\n*Guicciardini, Francesco. The History of Italy. Translated by Sydney Alexander. Princeton: Princeton University Press (1984)\n*Blockmans, Wim. Emperor Charles V (1500–1558). Translated by Isola van den Hoven-Vardon. New York: Oxford University Press (2002)"
    }
  ]
}