{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Dongshan Island__disambig_1\n\n| combatant2  =\n| commander1  =  Hu Lien\n| commander2  =  You Meiyao\n| strength1   = 5,000\n| strength2   = 14,000\n| casualties1 = 2,044\n| casualties2 = Minor\n}}\nThe Battle of Dongshan Island () took place between the Nationalists and the Communists over the control of the Eastern Mountain (Dongshan, 东山/東山) Island at the southern tip of Fujian, China. It resulted in the Communists taking the island from the nationalists.\nOrder of battle:\n*Defenders: nationalist order of battle:\n**The 17th Army\n*Attackers: communist order of battle:\n**The 91st Division of the 31st Army\n**The 94th Division of the 32nd Army\nAfter Zhangzhou-Xiamen Campaign, more than 5000 soldiers of the Nationalist 17th Army retreated to Eastern Mountain (Dongshan, 东山) Island off Fujian. Since the Nationalists were using the island as a stepping-stone to launch raids against the mainland, the 91st Division of the 31st Army and the 94th Division of the 32nd Army of the People's Liberation Army launched an assault to take the island on 11 May 1950 with the help of three artillery battalions.  After 10 hours of fighting, the Nationalists retreated from the island, having suffered some 2,044 fatalities.\nThe Communist victory was a result of lessons learned in previous battles with the Nationalist troops for control over coastal islands, including the Battle of Kuningtou, the Battle of Denbu Island, and the Battle of Nan'ao Island, each of which illustrated the necessity for massing absolute numerical and technical superiority.  As a result, the attackers outnumbered the defenders nearly three to one.\nWhile a strategic loss for the Nationalists, the abandonment of the Eastern Mountain (Dongshan, 东山/東山) Island did teach valuable lessons. Primarily it resulted in less overstretch and better handling of defence on islands closer to Taiwan proper. The Nationalists also learned from the mistakes used in their defence and battle, as shown three years later during the Dongshan Island Campaign, when they attacked and seized islands they'd previously abandoned.\nSee also\n* Outline of the Chinese Civil War\n* Outline of the military history of the People's Republic of China\n*National Revolutionary Army\n*History of the People's Liberation Army\n*Chinese Civil War\nReferences\n*Zhu, Zongzhen and Wang, Chaoguang, Liberation War History, 1st Edition, Social Scientific Literary Publishing House in Beijing, 2000,  (set)\n*Zhang, Ping, History of the Liberation War, 1st Edition, Chinese Youth Publishing House in Beijing, 1987,  (pbk.)\n*Jie, Lifu, Records of the Liberation War: The Decisive Battle of Two Kinds of Fates, 1st Edition, Hebei People's Publishing House in Shijiazhuang, 1990,  (set)\n*Literary and Historical Research Committee of the Anhui Committee of the Chinese People's Political Consultative Conference, Liberation War, 1st Edition, Anhui People's Publishing House in Hefei, 1987,\n*Li, Zuomin, Heroic Division and Iron Horse: Records of the Liberation War, 1st Edition, Chinese Communist Party History Publishing House in Beijing, 2004,\n*Wang, Xingsheng, and Zhang, Jingshan, Chinese Liberation War, 1st Edition, People's Liberation Army Literature and Art Publishing House in Beijing, 2001,  (set)\n*Huang, Youlan, ''History of the Chinese People's Liberation War, 1st Edition, Archives Publishing House in Beijing, 1992,\n*Liu Wusheng, From Yan'an to Beijing: A Collection of Military Records and Research Publications of Important Campaigns in the Liberation War, 1st Edition, Central Literary Publishing House in Beijing, 1993,\n*Tang, Yilu and Bi, Jianzhong, History of Chinese People's Liberation Army in Chinese Liberation War'', 1st Edition, Military Scientific Publishing House in Beijing, 1993 &ndash; 1997,  (Volum 1), 7800219615 (Volum 2), 7800219631 (Volum 3), 7801370937 (Volum 4), and 7801370953 (Volum 5)"
    }
  ]
}