{
  "content": [
    {
      "type": "text",
      "text": "# Battle of El Bodón__disambig_1\n\n| map_type             =\n| map_relief           =\n| map_size             =\n| map_caption          =\n| result               = French victory\n| territory            =\n| combatant1           =  French Empire\n| combatant2           =  United Kingdom\n*  Portugal\n}}\n| commander1           =  Louis-Pierre Montbrun\n| commander2           =  Arthur Wellesley\n*  Charles Colville\n*  Victor Alten\n}}\n| strength1            = 2,500\n| strength2            = 1,500\n| casualties1          = assumedly, up to 200\n| casualties2          = 141 to 149\n:27 killed\n:92 wounded\n:22 missing\n}}\n|  zoom = 5\n|   float = right\n|    nolabels = 1\n|     width = 304\n|     height = 160\n| title= Peninsular War: Third French invasion\n| shapeD=n-circle\n| shape-colorD=dark blue\n| shape-outlineD=white\n| label-colorD = dark blue\n| label-sizeD = 12\n| label-posD = left\n| label-offset-xD =\n| label-offset-yD =\n| label1 = Astorga\n| mark-coord1 =\n| mark-title1 = Siege of Astorga March April 1810\n| label2 = Ciudad Rodrigo\n| mark-coord2 =\n| mark-title2 = Siege of Ciudad Rodrigo April 1810\n| label-pos2 = right\n| label3 = Almeida\n| mark-coord3 =\n| mark-title3 = Siege of Almeida July 18103.1 Blockade of Almeida April 1811\n| label-pos3 = top\n| label-offset-y3 = 4\n| label4 = Bussaco\n| mark-coord4 =\n| mark-title4 = Battle of Bussaco September 1810\n| label-offset-x4 = 2\n| label-offset-y4 = -2\n| label5 = Lisbon\n| mark-coord5 =\n| mark-title5 = Torres Vedras protects Lisbon\n|       arc-coordA =\n|      arc-textA = Vedras\n| arc-text-sizeA = 12\n|     arc-angleA = 15\n|       arc-gapA = .2\n|    arc-radiusA = 3\n|       arc-coordB =\n|      arc-textB = Torres\n| arc-text-sizeB = 12\n|     arc-angleB = 15\n|       arc-gapB = .2\n|    arc-radiusB = 3\n| label6 =\n| mark-coord6 =\n| mark-title6 = Battle of Redinha March 1811\n| label7 = Sabugal\n| mark-coord7 =\n| mark-title7 = Battle of Sabugal April 1811\n| label-pos7 = bottom\n| label-offset-x7 = 10\n| label-offset-y7 = -6\n| label8 = Fuentes de Oñoro\n| mark-coord8 =\n| mark-title8 = Battle of Fuentes de Oñoro May 1811\n| label-offset-y8 = -5\n}}\nThe Battle of El Bodón was a rearguard action fought on 25 September 1811 by elements of the Anglo-Portuguese army against waves of French cavalry, supported by a division of infantry of the French army during the Peninsular War. The French, under the lead of Louis-Pierre Montbrun, were able to achieve a small tactical victory, forcing the Allies under the command of A. Wellesley to retreat from a strong position, but they were unable to build on their success due to problems related to insufficient supplies.\nPrelude\nSoon after the Battle of Fuentes de Oñoro, the French army withdrew from the northern frontier of Portugal, and the Duke of Wellington, with three divisions of the British Army and a corps of cavalry, blockaded Ciudad Rodrigo. In September 1811, Marshal Marmont assembled the army of the north, consisting of 60,000 infantry and 5,000 cavalry, in the neighbourhood of Salamanca, and moved on Ciudad Rodrigo, for the purpose of raising the blockade.\nEngagement\nOn the approach of the French force, the British outposts were withdrawn, and Ciudad Rodrigo was relieved. The headquarters of the Duke of Wellington were at that time established at Fuenteguinaldo, a village about  in the rear of Ciudad Rodrigo.  The 2nd battalion of the 5th Foot, guarding Wellington's headquarters, was ordered to march to the front and reinforce two brigades of Portuguese artillery and a squadron of cavalry positioned about  from Ciudad Rodrigo.\nAbout  to the east of that location was the village of El Bodón, which was occupied by the Third Division, under Sir Thomas Picton. The Light Division occupied the ground between the village of El Bodón and the river Águeda, on which its right rested. The fourth and only remaining division was in rear of Fuente Guinaldo, occupying different villages, and not brought into position.\nMajor Henry Ridge of the 2nd/5th Foot recalled:\n}}\nThere were two roads leading from Ciudad Rodrigo; one to Fuente Guinaldo, the most practicable for guns, was to the right of the 2nd/5th foot while the other passed through the position held by the 2nd/5th. It was some time before it became clear to the allies along which of the two roads the French would advance as the undulating ground masked the French movements. Major Ridge ordered the guns to be unlimbered and the mules harnessed, ready to move at a moment's warning and deployed the 2nd/5th along an elevated ridge, with its right protected by a deep defile.\nAs the French cavalry approached the allied position it became clear what their objective was, and the Portuguese guns opened fire against the French columns. At this moment the Duke of Wellington arrived, and after a few minutes of reconnoitring, told Major Ridge that he approved of the arrangements he had made, and would order up a brigade of cavalry in support. However, the Duke had hardly time to move to the rear before the allies were charged by a large body of cavalry, which for a moment succeeded in capturing the guns. By well-directed running fire from the 2nd/5th, followed by a charge of bayonets, the guns were retaken, and the French repulsed.\nMajor General Charles Colville arrived with allied reinforcements (the British 77th Foot, commanded by Lieutenant Colonel Broomhead, and 21st Portuguese regiment commanded by Colonel Bacellar), and took command for the allied force. This force, now of about 1,500 men, maintained the post for three hours, although frequently charged by French cavalry, and exposed to heavy fire from the guns of a division of infantry in reserve. The position was eventually abandoned when the French infantry moved forward, and the allies were forced to retire. As the ground over which the allies retreated was very favourable for cavalry, the allies were forced retired in squares of regiments, and were repeatedly charged, but the French were unable to break into them.\nDuring these operations, the French pushed forward a strong body of infantry, which succeeded in cutting off the light division, but by a judicious movement of Major General Craufurd, who crossed the Agueda, that division was saved, and managed a retreat in good order.\nAftermath\nThe Duke of Wellington took up a position in front of Guinaldo, with the three divisions named above, from which, not being tenable, he retired on the following day and posted himself strongly behind the Cob. The French only having supplies for ten days, were obliged to fall back, and then the Anglo-Portuguese army reoccupied nearly the same ground it did before this attack.\nThe following is a copy of the General Order issued by Wellington after the encounter:\nNotes\nReferences\n*\n*\n*\n;Attribution\n* }}\nFurther reading\n*\nExternal links\n*"
    }
  ]
}