{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Derna (2018–2019)\n\n– 12 February 2019()\n| place             = Derna, Libya\n| result            = Libyan National Army victory\n| territory         = Derna is captured by the Tobruk Government\n| coordinates       =\n| combatant1        =  House of Representatives SLM/A-MinnawiSupported by: (allegedly)\n| combatant2        =  Shura Council of Mujahideen in Derna(until May 11) Derna Protection Force (since May 11) Al-Qaeda\n*  Al-Mourabitoun\n----\n(limited involvement)\n| commander1        =  FM. Khalifa Haftar\n*  Col. Salem al-Rafadi\n*  Brig. Abdul Hamid Werrfali\n*  Mahmoud al-Werfalli\n*   Wanis Bukhamada\n*  Abdul Salam Al-Haassi\n*  Salah Al Ebeidi\n}}\n| commander2        =  Ateyah Al-Shaari but this could not be confirmed by the Libyan National Army.}}\n*  Omar Suroor\n*  Ibrahim al-Hals\n*  Hamad al-Maleki\n*  Abdulsalam al-Awami\n*  Abi Buzaid al-Shulwi\n*  Amin al-Kabayli (\"al-Abras\")\n*  al-Naji Idris\n*  Abu Sufian bin Qumu\n*  Muftah al-Ghweil}}\n*  Yehya Usta Omar\n*  Hesham Ashmawy\n*  Adnan Al-Shaari\n*  Mohammed Dango\n*  Mohammed Al-Mansouri\n}}\n| units1            =  Libyan National Army (Omar al-Mukhtar Operations Room)\n* Al-Saiqa\n* 36th Brigade\n* 210th Battalion\nEgyptian Army  Directorate-General for External Security\n| units2            = Abu Salim Battalion\n| strength1         = At least 4 battalions\n| strength2         = Unknown (Initially)50–60 (HOR estimate, 14 June 2018)46 (12 February 2019)\n| casualties1       = 20 killed35 wounded(31 May 2018)\n| casualties2       = 100 killed100 captured(LNA claim, 31 May 2018)\n| casualties3       = unknown\n| campaignbox       =\n| units3            = unknown\n| strength3         = unknown\n| notes             = 17 civilians killed, 30 woundedApproximately 19,270 civilians displaced\n}}\nThe Battle of Derna was a military campaign by the Libyan National Army to recapture the city of Derna from the Shura Council of Mujahideen in Derna, which lasted from 7 May 2018 until 12 February 2019. The majority of military operations concluded by 28 June 2018, with the Libyan National Army declaring control of the entire city on that day, despite continued clashes in the old city. During the early stages of the battle, the Shura Council was dissolved and replaced with the Derna Protection Force, which continued operations after the LNA declared victory in June 2018, before surrendering at the end of the battle.\nBackground\nOn 5 October 2014, the Islamic State of Iraq and the Levant (ISIL) took control of the city of Derna. An uprising in June 2015 by the Shura Council of Mujahideen in Derna, however, resulted in their expulsion from large parts of the city. Though clashes continued, ISIL had withdrawn by April 2016. In August 2016, the Libyan National Army began a siege of the city, which was tightened in 2017 following the Shura Council's execution of an air colonel whose plane was shot down near the town. While being ruled by the Shura Council, Derna served as center for al-Qaeda militants, most notably Hesham Ashmawy's Al-Mourabitoun network, which regularly launched attacks against Egypt from Libya.\nBattle\nOn 7 May 2018, Field Marshall Khalifa Haftar declared that the peace efforts in Derna had reached a dead end, announcing a \"Zero Hour\" for the \"liberation of Derna\". In a speech delivered at a military parade in Benghazi, Haftar declared that his army was targeting enemy hideouts. Subsequently, the LNA entered Derna and clashed in the Al-Fatayeh district, losing 7 fighters and several military vehicles. The military warned local residents of the need to observe security measures, and in particular, called on the civilian population not to approach the militants' positions in the city. The next day, Mansour Al-Hasadi, a member of the High Council of State, called for international protection of civilians in the city of Derna, pointing towards the large number of families who had to flee their homes in the district of Fatayeh in search of another safe place in the city. The same day, the LNA captured east of Derna, as well as some major high ground.\nOn 9 May, the High Council of State renewed its call to end the Battle of Derna, calling for the Presidential Council, the parliament and the United Nations Support Mission in Libya to intervene.\nOn 11 May, the Leader of the Shura Council, Ateyah Al-Shaari, dissolved the Shura Council of Mujihadeen in Derna and replaced it with the Derna Protection Force.\nOn 15 May, Human Rights Watch reported that civilians were endangered by the attack on Derna.\nOn 16 May, the Derna Protection Force claimed to repel LNA assaults on the Fatayeh and Dahr Homer fronts, south of the city, and claimed to have seized six military vehicles in addition to arms and ammunition.\nOn 18 May, the LNA was working on dismantling the external defense lines of the terrorists inside the city – putting heavy pressure on the militants, who did not have a choice but to leave their hideouts and become an easy target for the army.\nOn 22 May, The LNA announcer that Brigadier Abdul Hamid Werrfali, Commander of the 36th Brigade, had died in clashes southwest of Derna. The next day, Haftar announced that the LNA will intensify its offensive on the far eastern port city of Derna until it gained full control of the area.\nOn 24 May, Haftar announced that the LNA was \"near victory\". The same day, 2 LNA troops were killed by a car bombing, which was claimed by the Islamic State of Iraq and the Levant.\nOn 26 May, Egypt bombed DPF positions, joining the battle in support of the LNA.\nOn 28 May, the LNA seized two suburbs in south-western Derna.\nOn 29 May, the LNA took control of the western entrance to Derna. The same day, the Derna Protection Force withdrew from the Al-Fatayeh district to the east of the city.\nOn 30 May, a water desalination plant in Derna stopped working as a result of the war.\nOn 3 June, The LNA clashed in the Sahel Sahrqi neighborhood. The next day, the LNA captured the Shiha and Bab Tobruk districts.\nBy 5 June, the LNA was advancing with four battalions into Derna, with 2 from each side, and was bolstered by the Al-Saiqa brigade. At this time, the LNA had seized 75% of Derna.\nOn 9 June and 10 June, the LNA said it had advanced in the district of Sheiha after hitting it with multiple air strikes, to the edge of Al Maghar in central Derna. LNA spokesman Ahmed al-Mismari also stated that the combat zone was now \"less than just 10 km squared.\"\nOn 11 June, it was reported that several districts in Derna had been seized by the LNA, with only a few pockets of resistance remaining in the eastern part of the city. Many news outlets then reported that the battle was nearing its end. On 12 June, the LNA was attacked by 2 suicide bombers, the second of whom killed 2 fighters and wounded 3 others. On 13 June, The Libya Observer released a video of 2 unarmed men in civilian clothes being tortured and executed by the LNA.\nOn 14 June, Saleh Faraj, an officer patrolling areas under LNA control, stated that only \"50 or 60 remnant\" fighters of the DPF were still in Derna, and that they were now holed up in the central district of the city. He also stated that the DPF had planted explosives and deployed snipers. On 18 June, Abu Sufian bin Qumu, Osama bin Laden's former driver, was captured by the LNA. On 20 June, a suicide bomber killed 4 Libyan security force members, after heading towards them with a white flag. On 24 June, looting, robberies and assaults on properties by the LNA forced tens of families to flee from the Bab Tobruk and Sahel areas.\nOn 26 June, while the LNA was fighting for the \"last remaining meters\" of Derna, LNA spokesman Ahmed al-Mismari stated that most of the terrorist commanders had been killed or captured within the last few days. Although he was unable to confirm the death of Ateyah Al-Shaari, the leader of the Derna Protection Forces, he was able to confirm the \"neutralization\" of a different commander, Muftah al-Ghweil.\nOn 27 June, UNICEF sent a thousand hygiene kits to Derna, which should benefit about five thousand people, including children.\nOn 28 June, al-Qaeda's media organizer Abu Safana Ben Kama was detained by the LNA. Later on the same day, the LNA also managed to take control of the Al-Maghar district, capturing the entire city of Derna. By the end of the day, the LNA had declared victory.\nAfter the LNA declared victory, celebrations erupted in Derna. Some began chanting, while others while honked their car horns in celebration and flashed the victory sign as army forces were seen keeping order on the streets. Khalifa Haftar was quoted as saying \"After a bitter struggle and enormous sacrifices, today our date is renewed with victory while it marks the date of defeat for the terrorists\". Between 7 and 31 May, The Libyan National Army suffered 20 killed and 35 wounded, while the Shura council suffered 100 killed and 100 captured. Approximately 19,270 civilians were displaced.\nHowever, fighting in the old city continued for the following several months. In July and September, the Derna Protection Force clashed with the LNA. On 11 February 2019, the LNA declared the end of military operations in Derna, after they had retaken the entire city. On 12 February, the 46 remaining fighters of the Derna Protection Force (DPF) surrendered themselves to the LNA, marking the dissolution of the group.\nAftermath, it was revealed that the French DGSE Action Division, fought in the city alongside Haftar forces, with between 35 and 60 operators on the ground conducting raids and covering LNA troops with heavy mortars and counter sniper team. [https://www.middleeasteye.net/fr/actu-et-enquetes/libye-france-le-drian-haftar-dgse-revelations Révélations : comment Le Drian et la DGSE ont soutenu Haftar en Libye]\nReactions\nSupranational\n* : Spokeswoman Elizabeth Throssell from the United Nations High Commissioner for Refugees (UNHCR) said, \"We are deeply alarmed at the escalating risks to the population\", and added, \"There have been increasing allegations that civilians have been arbitrarily detained, while others have been prevented from leaving the city\".\nStates\n* : The Italian Embassy to Libya stated that it agreed with UNSMIL and called for de-escalation of the conflict, and that it was ready to provide humanitarian aid.\n* : The UAE Minister of State for Foreign Affairs, Anwar Gargash, praised the capture of Derna. He wrote on Twitter that \"The complete liberation of the city of Darna from terrorism is a positive step in the elimination of terrorism in brotherly Libya\".\nSee also\n* Derna campaign (2014–2016)\n* Battle of Benghazi (2014–2017)\n* Battle of Sirte (2016)\n* Battle of Marawi\nNotes\nReferences"
    }
  ]
}