{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Pydna (148 BC)\n\n| map_type    = Greece#Balkans#Europe without the extreme north\n| map_relief  = yes\n| map_size    =\n| map_marksize =\n| map_caption =\n| map_label   =\n| map_mark =\n| casus       =\n| territory   = Final Roman conquest of Macedon\n| result = Roman victory\n| combatant1 = Rome\n| combatant2 = Macedon\n| commander1 = Quintus Caecilius Metellus\n| commander2 = Andriscus (Phillip VI)\n| strength1 = 2 legions and allies ( men)Unknown number of cavalry\n| strength2 = Unknown but comparable\n| casualties1 = Light\n| casualties2 = Heavy\n}}\nThe Battle of Pydna was fought in 148 BC between Rome and the forces of the Macedonian leader Andriscus.  The Roman force was led by Quintus Caecilius Metellus, and was victorious. The battle played an important role in deciding the outcome of the Fourth Macedonian War, and saw the annihilation of the last military-political force of Macedon.\nThe war had begun when the pretender Andriscus defeated Rome's clients in Macedon and crowned himself king, defeating a Roman force sent to stop him and invading parts of Greece. The senate then sent Quintus Caecilius Metellus with another, larger army to stop the pretender; the Roman commander chose to undertake both a land and sea offensive, forcing Andriscus to take a defensive position near Pydna, where Metellus engaged and soundly defeated him.\nThe battle decided the outcome of the war; Andriscus was forced to flee Macedon, and was pursued and captured by the Romans before he could raise a strong army. Rome now took direct control of Macedon, making it a Roman province.\nBackground\nAndriscus, a fuller from Aeolis, claimed the Macedonian throne by claiming to be the son of Perseus of Macedon. Initially unsuccessful, he invaded Macedon with a Thracian army and met with unprecedented success, defeating Rome's Macedonian clients near the Strymon river, crowning himself King of Macedon and overrunning Thessaly, and annihilating a Roman legion sent to stop him, killing the commanding praetor, Publius Juventius Thalna, in the battle. However, he could not advance into Greece, being halted by forces of the Achaean League and remnant Roman units stationed there. He had also allied himself with Carthage, which was at war with Rome in the Third Punic War.\nAlarmed, the Roman senate sent a second army of two legions under Quintus Caecilius Metellus to Macedon. Metellus chose not to take the usual Epirote route used by previous Roman commanders into Macedon; he advanced along the Thessalian coast  with the assistance of the fleet of Attalus II Philadelphus of Pergamon; Andriscus, wary of letting Metellus overrunning the coastal districts, engaged him at Pydna.\nOpposing forces\nRoman\nThe Romans probably fought in their usual triplex acies formation, with hastati in the front, principes in a second rank and triarii in the rear, with velites as light skirmishing troops, and Roman and allied cavalry on the flanks. Metellus' army consisted of a full consular army of two legions and allies — around 20,000 men. Despite the difficulties associated with raising and equipping such a force, the Senate did not wish to take any chances after Thalna's crushing defeat.\nMacedonian\nThe details of the Macedonian army at the second encounter at Pydna are more scarce. It is known that Andriscus started his campaign with Thracian troops. These were usually light troops; the troops that composed the main body of his army are unknown; it is not known if they even fought in the traditional Macedonian phalanx or a looser formation. He also had a sizeable number of cavalry. The total strength of Andriscus' army is unknown, but it was significant enough for him to be confident about detaching a portion of it just before the battle.\nBattle\nThe first encounter between the two forces was a cavalry skirmish; Andriscus' cavalry had the upper hand. This gave him sufficient confidence to detach a portion of his forces for action elsewhere, either due to supply issues or to threaten the Roman rear.\nMetellus seized this opportunity to counterattack in full strength, engaging the Macedonian army. After a short fight, the Macedonians were decisively routed, and Andriscus and the survivors were forced to flee. It is possible that some of Andriscus' troops defected during the battle. If true, this defection was probably spurred by Telestes, the general appointed by Andriscus to command his cavalry. The Macedonian aristocratic cavalry joined Telestes, as the richer classes supported the Romans more than they did Andriscus, and this may have decided the battle.\nAftermath\nThe battle was a disaster for Andriscus, who had lost his main force and had to flee Macedon. Andriscus gathered a new, hastily levied army in Thrace, but was swiftly pursued by Metellus, who routed these new forces before they were fully prepared. He sought refuge with the Thracian chieftain Byzes, but was betrayed by him to Metellus, who had him arrested and then subdued a few more minor revolts in Macedon, ending the last embers of the war.\nMetellus now reorganized Macedonia as a province and was appointed as its first governor. After being called on to assist in a war in Greece - the Achaean War - he returned to Rome, where he celebrated a triumph in which Andriscus was paraded and later executed.\nSee also\n* Battle of Pydna\n* History of Macedonia (ancient kingdom)\nReferences\nReference bibliography\nPrimary sources\n*Cassius Dio, Roman History, [https://penelope.uchicago.edu/Thayer/E/Roman/Texts/Cassius_Dio/21*.html Book 21]\n*Livy, Ab Urbe Condita Libri, [http://mcadams.posc.mu.edu/txt/ah/Livy/Livy45.html Book XLV] and [https://www.livius.org/sources/content/livy/livy-periochae-46-50/ Periochae 46-50]\n*Diodorus Siculus, Bibliotheca Historica, [https://penelope.uchicago.edu/Thayer/E/Roman/Texts/Diodorus_Siculus/32*.html Book 32]\nSecondary sources\n*\n* Iain Spence, Historical Dictionaries of War, Revolution, and Civil Unrest. Scarecrow Press, 2002\n* Peter Green, Alexander to Actium: The Historical Evolution of the Hellenistic Age. A Centennial Book. Hellenistic culture and society (Volume 1). University of California Press, 1993. 447\n*\nAttribution\n*\nFurther reading\n*\n*"
    }
  ]
}