{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Niså__disambig_1\n\n|commander2  =Harald HardradaHaakon Ivarsson\n|strength1   =300 ships (sagas)less than Harald (Saxo)\n|strength2   =150 ships\n|casualties1 =70 ships cleared of menRemainder retreated\n|casualties2 =Unknown\n|notes       =\n|campaignbox =\n}}\nThe Battle of Niså (Slaget ved Niså) was a naval battle fought on 9 August 1062 between the forces of Norwegian king Harald Hardrada and king Sweyn II of Denmark. Harald had claimed the Danish throne since 1047, and had launched raids into Denmark ever since. With his invasion in 1062, he wanted to decisively defeat the Danes, and thus finally be able to conquer Denmark. The battle was won clearly by the Norwegians, but since many Danes managed to escape, including Sweyn, it proved indecisive in Harald's attempt to conquer Denmark.\nBackground\nWhen Harald became the sole king of Norway in 1047, he also claimed the Danish throne, despite that his predecessor and co-ruler Magnus the Good (king of Norway and Denmark) had appointed Sweyn Estridsen as his successor in Denmark. Since 1048, Harald launched raids into Denmark almost annually, attempting to force Sweyn out of the country. Although the raids were largely successful, Harald never managed to occupy Denmark. With the invasion in 1062, he sought to gain a decisive victory over Sweyn.\nThe battle\nAccording to the Icelandic saga writer Snorri Sturluson, the battle had been preassigned a time and place, but Sweyn did not appear as agreed. Harald thus sent home his non-professional ships and soldiers, the \"peasant army\" (bóndaherrinn), which had made up around half of his forces. When the ships were out of sight, Sweyn finally appeared and engaged Harald's fleet. With his own so-called drekinn ship in the middle, Harald tied his ships together in order to prevent gaps in the line. He placed earl Haakon Ivarsson and his forces from Trøndelag on the flanks. Sweyn used the same tactic, but unlike Harald had his own earl Finn Arnesson placed right next to himself, instead of on the flanks. The battle commenced in the evening, and lasted through the night.\nThe two sides were evenly matched for a long time into the battle, until Haakon disengaged his ships from the flanks and started attacking the weakened Danish ships on the flanks. Sweyn had no similar reserve force, and his fleet was defeated by dawn, with 70 ships left \"empty\" and the remainder retreating. While Finn Arnesson fought until he was captured, Sweyn jumped into the water and was rescued by his former ally Haakon (albeit unknowingly to Harald). Haakon was after the battle universally recognized, including by Harald, as the hero of the battle, but when his treachery in rescuing Sweyn was discovered he fell into disfavour (even though Haakon claimed Sweyn had been in disguise, and that he had not recognized it was him).\nAftermath\nAlthough Harald won the battle, the victory was not decisive since many Danish ships and men had managed to escape, including Sweyn. Denmark's economic and social fabric had been destroyed by the yearly raids, but the lengthy war had also taken its toll in Norway. After the Battle of Niså, Harald had trouble collecting taxes in the Uplands, and probably also in other areas. In 1064, Harald finally offered Sweyn unconditional peace without reparations or loss of land, and the two kings concluded peace.\nReferences\nBibliography\n*"
    }
  ]
}