{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Grocka__disambig_1\n\nHabsburg monarchy\n| combatant2        =  Ottoman Empire\n| commander1        = Marshal WallisWilhelm Reinhard von Neipperg\n| commander2        = Ivaz Mehmed Pasha\n| strength1         = 40,000–56,000\n| strength2         = 80,000–100,000\n| casualties1       = 5,600 (2,350 killed2,850 wounded400 missing)\n---- 7,000 killed\n---- 3,000 killed and 7,000 wounded.\n----\n10,000\n| casualties2       = 8,000 killed and wounded\n}}\nThe Battle of Grocka, also known as Battle of Krotzka, () was the decisive battle of the Austro-Turkish War (1737–1739). It was fought between the Habsburg Monarchy and the Ottoman Empire on 21–22 July 1739 in Grocka, near Belgrade in the Habsburg-held Kingdom of Serbia. The Ottomans were victorious, and proceeded with the Siege of Belgrade, that led to the conclusion of the Treaty of Belgrade on 18 September 1739.\nPrelude\nDuring the late stages of the Austro-Turkish War between 1737–1739, the Austrian emperor, Charles VI, appointed Marshal Wallis as the commander of the Austrian army. He commanded an army numbering 30,000 men in Belgrade. At Timișoara he collected another 10,000 men. With this force, Wallis attempted to retake Orșova from the Ottomans in mid-July. Meanwhile, the Ottomans, led by the Grand Vizier, were marching to meet the Austrians. Wallis was informed that the Ottoman army was encamped near Grocka. Wallis marched to retake the village from the Ottomans.\nBattle\nBefore reaching the village of Grocka, the Austrian approach route narrowed into a Gully that led to the plain leading to the riverside town. The road then turned southward, rising towards higher ground. Field Marshal Wallis, aware that speed was essential, pushed his cavalry forward to secure the area. The force consisted largely of cuirassiers and dragoons, with some hussars, led by Count Pálffy’s cuirassiers. At dawn they emerged from the gully and advanced into the open ground, where they unexpectedly encountered the main Ottoman army.\nThe Ottomans, who had taken strong positions on the surrounding hills and in the valley, immediately opened fire on the advancing Austrians. The bombardment inflicted heavy losses, leaving the field full of dead and wounded men. From dawn until mid-morning, the Austrian cavalry managed to hold their ground against repeated Ottoman attacks, relying on constant fire and support from units following behind. Around midday, Austrian infantry reinforcements arrived, who forced their way through the gully under heavy fire. Meanwhile, the Grand Vizier directed his troops to move onto the high ground, flanking the Austrian positions, and attacked them with musket fire from above.\nOn the opposite side of the gully, Field Marshal Hildburghausen led the Austrian infantry in assaults against the hills, while Austrian artillery was dragged into position to engage the Ottoman guns. The fighting continued throughout the day, with several Austrian units attempting to push through the defile under heavy Ottoman fire. By nightfall, the Grand Vizier withdrew his forces in good order, leaving the Austrians heavily shattered after a day of intense combat.\nThe Austrians suffered grievous losses during the battle. Wallis decided to retreat under the cover of night. The Ottomans chased the Austrians all the way up to Belgrade.\nAftermath\nBy the third year of the war, the Austrian campaign had ended in complete disaster. Belgrade, which was captured by Prince Eugene in 1717 and subsequently developed into a fortified Habsburg stronghold, surrendered to the Ottomans in 1739.\nReferences\nSources\n*\n*\n*\n*\n*\n*\n*\nExternal links\n* [http://www.kuk-wehrmacht.de/gefechte/17390722grocka.html KUK Wehrmacht Die Schlacht bei Grocka am 22.7.1739]"
    }
  ]
}