{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Sardarabad\n\n| result            = Armenian victory\n| territory         = *Treaty of Batum\n*Recognition of Armenia by the Ottoman Empire\n*Ottoman invasion of Eastern Armenia repelled\n| combatant1        = Armenian National Council\n* Armenian Army Corps\n| combatant2        =  Ottoman Empire\n| commander1        = Tovmas NazarbekianMovses SilikyanDaniel Bek-PirumyanPoghos Bek-PirumyanChristophor AraratovAram Manukian\n| commander2        = Enver PashaWehib PashaKazim Pasha}}Rüştü Bey}}Zihni Bey\n| strength1         = 9,000\n| strength2         = 30,000–33,000Including Kurdish cavalry 1,500–3,00040 cannons\n| casualties1       = Unknown\n| casualties2       = 5,500 dead alone from 22 to 26 May\n| campaignbox       =\n}}\nThe Battle of Sardarabad (; ) was a battle of the Caucasus campaign of World War I that took place near Sardarabad, Armenia, from 21 to 29 May 1918, between the regular Armenian military units and militia on one side and the Ottoman army that had invaded Eastern Armenia on the other. As Sardarabad is approximately  west of the capital of Yerevan, the battle not only halted the Ottoman advance into the rest of Armenia, but also prevented the complete destruction of the Armenian nation. The battle paved the way for the establishment of the First Republic of Armenia and the Treaty of Batum: recognition of Armenia by the Ottoman Empire.\nIn the words of Christopher J. Walker, had the Armenians lost this battle, \"it is perfectly possible that the word Armenia would have henceforth denoted only an antique geographical term\".\nBackground\nOttoman invasion of Eastern Armenia\nAfter the October Revolution of 1917 in Russia and the ceasefire signed between the Third Army of the Ottoman Empire and the Transcaucasian Commissariat in Erzincan, newly forming Armenian detachments came to replace Russian forces retreating from the Caucasian Front, particularly from the territory of Western Armenia. Taking advantage of the military-political situation of the time, the Ottoman government set its mind on regaining control of territories occupied by the Russian Army during World War I and invading Eastern Armenia and the South Caucasus afterwards. The German government, the Ottoman Empire's ally, objected to this attack and refused to help the Ottoman Army in the operation. The Ottoman Army intended to crush Armenia and seize Russian Transcaucasia and the oil wells of Baku.\nLaunching an assault in February 1918, the Third Army of the Ottoman Empire occupied Western Armenian settlements one after another. Following the failure of Trabzon peace talks in April, Third Army commander Mehmed Wehib Pasha moved his forces towards Transcaucasia. Taking advantage of the conciliatory policy of the leadership of the newly-proclaimed Transcaucasian Federative Republic, the Turkish military units captured the heavily fortified Castle of Kars on 25 April, thus creating a direct threat to Alexandrapol. Following the siege of Kars, the Ottoman Forces Command put forward new conditions to the Transcaucasian authorities, demanding the surrender of Akhalkalaki, Akhaltsikhe and Alexandrapol, as well as of Alexandropol–Julfa railway, which the Turkish troops could use to reach Tabriz and get their hands on all the Transcaucasian railroads before the end of the war against the British. Unwilling to wait for the end of negotiations with the Transcaucasian delegation in Batumi, the Turkish forces took Alexandropol with a quick offensive on 15 May, creating a threat of conquest for all of Eastern Armenia. At this point, only a small area of Armenian territory remained unconquered by the Turks, and into that small area, hundreds of thousands of Armenian refugees fled. It seemed like it was only a matter of time until that too would be overrun.\nIn order to break into Eastern Armenia, the Turkish Military Command regrouped its troops. A special detachment commanded by Yakub Shevki Pasha was formed in Kars from subdivisions of I Caucasian Army Corps (under the command of Major-General Kazim Karabekir Pasha) and the 2nd Caucasian Army Corps of the Third Army (under the command of Major-General Yakub Shevki Pasha). Within the newly-formed detachment, the 36th Division (under the command of Colonel Pirselimoğlu Hamdi Bey) and the 9th Division (under the command of Colonel Rüştü Paşa) of I Caucasian Army Corps, as well as the 11th Division (under the command of Colonel Cavit Erdel) and the 5th Division (under the command of Colonel Mürsel Pasha) of II Caucasian Army Corps were to operate against the Armenian forces. Besides the detachment in question, also participating in combat operations in the course of the invasion of Eastern Armenia was the 12th Division of the IV Army Corps of the Second Army, which supervised Surmali mountain passes on the eve of the Battle of Sardarapat and had a mission to invade Igdir Province.\nTo be able to resist the attack, commander-in-chief of the Armenian Armed Forces Tovmas Nazarbekian decided to safeguard the strategic roads to Yerevan and Tiflis.\nA part of the Armenian troops that had left Alexandropol, including some units of the 1st Division of the Armenian Corps, as well as several units within the Special Armenian Detachment, retreated towards the Ararat Plain. Here under the general command of Movses Silikyan, the Detachment of Yerevan of the Armenian Armed Forces was created with a task to thwart the Turkish attack on Yerevan.\nYerevan on the eve of the battle\nThe invasion of the Turkish army put the Armenian political leadership in both Tiflis and Yerevan in a difficult situation. On 19 May, after invading Surmali, Turkish General Halil Kut (the uncle of Enver Pasha) declared in Batumi that \"the Armenians have been defeated and must be obeyed.\" On the other hand, the Armenian delegation represented in the negotiations of Batumi (Alexander Khatisian, Hovhannes Kajaznuni) in a cable sent to Khachatur Karchikyan, the Armenian member in the Transcaucasian Commissariat, recommended \"against showing resistance to Turks.\"\nAmid a widespread panic in the Aleksandropolsky Uyezd, the Ararat Plain and Yerevan following the attack of the Turkish troops, the Yerevan city council at a session on 18 May approved mayor Tadevos Tosyan's proposal to hand over the city to the Turks with no resistance, evacuate the population and lead them to the mountains. But the decision to surrender Yerevan yielded no practical results, as the Executive Body of the Armenian National Council of Tbilisi – the Special Committee – headed by Yerevan National Council chairman Aram Manukian sharply opposed such a development and overthrew the decision (supreme power in Yerevan and the province of Yerevan was given to the Special Committee). By the order of Aram Manukian and with the help of as many as 1500 residents, Yerevan's defenses, especially the area near Yerablur, were fortified.\nOn 18 May, Aram Manukian accompanied by Yerevan's commandant Arshavir Shahkhatuni, visited Etchmiadzin to urge Catholicos George V to leave the town for security reasons. But he not only rejected the proposal, but also encouraged the military to resist the Ottoman advance. Later legend claimed that church bells pealed for six days calling on Armenians from all walks of life – peasants, poets, blacksmiths, and even the clergymen – to rally to form organized military units. Civilians, including children, aided in the effort as well, as \"Carts drawn by oxen, water buffalo, and cows jammed the roads bringing food, provisions, ammunition, and volunteers from the vicinity\" of Yerevan.\nIn the days that followed, Manukian played a vital role in stabilizing the situation in Yerevan and the adjacent areas and tipping the scale in the Armenians' favor. In the morning of 19 May, he ordered the Commander of the 1st Division, Major-General Movses Silikyan' to stop the retreat of Armenian forces and avert the Turkish attack on Yerevan at any cost. To this end, Manukian promised to carry out organizational work in a short period of time, collect manpower and ammunition. In the subsequent days, recruitment was organized on Astafyan Street, in the English Park, in front of the Teachers' Seminary and elsewhere for volunteers to join the army at the start of the Battle.\nBattle\n, commander of the Armenian forces.]]\nUnits involved on both sides\nTurkish side\nForming part of the 36th Turkish Division moving towards Alexandropol-Yerevan were the 106th, 107th and 108th Infantry Regiments, one rifle battalion, two artillery divisions. The Turkish army was further supported by a separate cavalry regiment and another one of 1,500 Kurdish fighters. The Turkish forces were a total of 7,500–10,000 soldiers and officers, including the Kurds. The Turks had 40 cannons at their disposal.\nArmenian side\nDuring the Battle of Sardarapat, the forces of the Armenian side formed part of the Yerevan detachment, whose other units took part in the Battle of Bash-Aparan against the 9th Turkish Division. Major-General Movses Silikyan was the Commander of the detachment, while Colonel Alexander Vekilyan served as the Chief of Staff based in the building of the Gevorgian Seminary of Etchmiadzin in Vagharshapat. The Commander-in-Chief of the forces fighting in the Battle of Sardarapat was the Deputy Commander of the Yerevan detachment, Colonel Daniel Bek-Pirumyan, while Alexander Chneour was the Chief of Staff. Included in these forces were the 2nd Division of the Armenian Corps and several squads of the Special Armenian Detachment. Forming part of the 2nd Division (under the command of Movses Silikyan) were the 5th (3rd battalion, under the command of Poghos Bek-Pirumyan) and 6th (12 companies, under the command of Lieutenant Colonel Abraham Dolukhanyan) regiments, the 2nd Cavalry Regiment with four cavalry battalions (Colonel Zalinyan), a partisan infantry regiment made up of eight battalions (Colonel Aleksei Perekrestov), a partisan cavalry regiment of three battalions (Colonel Korolkov), the Border Battalion (Lieutenant Colonel Silin), the Patrol Battalion of the 2nd Division. One battalion from the 4th Regiment, 1st Division was stationed in Davalu to defend the southern direction.\nIncluded in the Yerevan unit from the Special Armenian Detachment were the 1st (Colonel Yuzbashev) and 2nd (Colonel Chakhmakhchev) Infantry Regiments of Van from the 3rd Special Brigade, the 2nd Special Cavalry Regiment of Zeytun (four cavalry battalions, Colonel Salibekyan), the infantry regiments of Khnus and Karakilisa (Colonel Kazimirsi) which formed part of the military units of the 2nd Special Brigade, the Regiment of Erzincan (6 battalions, Karapet Hassan-Pashaian) of the 1st Special Brigade, as well as the 1st Special Cavalry Regiment (military starshina Pavel Zolotarev).\nFive infantry batteries under Colonel Christophor Araratyan's command were included in the Yerevan detachment, which also involved several squads composed of Western Armenian intellectuals, a Yezidi cavalry battalion (under the command of Usub Bek and Jangir Agha), as well as a great number of militia troops. The Armenian forces were composed of a total of 9,000–10,000 soldiers and officers, and amounted to 6,000–6,500 after some part of them were dispatched to the Bash-Aparan Front. The Armenians had 28 cannons at their disposal but only 16–20 were used in the course of combat operations.\nManoeuvres prior to the battle\nOn the eve of the occupation of Alexandropol, one of the tasks of the Armenian troops was the defense of railways and roads connecting Alexandropol to Yerevan and Tiflis. Following the fall of Alexandropol, those groups had to retire to Hamalu-Karakilisa and the Ararat Plain due to progressing Ottoman forces. On 19 May, the 26th Turkish Division took the Gharaghula (Getap) train depot near the Akhuryan River and started to advance towards Yerevan. Some subdivisions from the 2nd Special Brigade composed of the infantry regiments of Khnus and Karakilisa, as well as a part of the 1st Special Brigade (the Infantry regiment of Erzincan and other units) gradually withdrew from Ani and Aragats railway stations on the left bank of Akhuryan River towards Sardarapat from 16 to 19 May. During the retreat, even before clashing with the main Ottoman forces, they would come under fire from the vanguard Kurdish cavalry of the 36th Division. The retreat of those subdivisions via the Alexandropol-Yerevan route played an essential role for the Yerevan detachment in terms of buying time and regrouping forces. On 16–17 May, some of the squads of the Yerevan detachment based in Sardarapat were urgently sent to Araks and Karaburun stations to resist the Ottoman advancing towards the Ararat Plain, while some others were sent to Yerevan to get ready for the battle and receive enhancement by volunteers and armaments.\nUnder these circumstances, by the order of Armenian Corps commander Tovmas Nazarbekian and Chief of Staff of the Corps Evgeny Vyshinsky, the Armenian forces were regrouped and rearranged in order to stop Ottoman attacks in separate areas, particularly in Alexandropol-Sardarapat and Karakilisa. According to an instruction received from the General Staff on 19 May, Major-General Movses Silikyan decided to concentrate the troops he had at his disposal in Etchmiadzin and avert the Turks' attack on Yerevan through a counter-attack. On 20 May, the Armenian vanguard was forced to abandon Araks and Karaburun stations, retire from the foothills of Mastara, Talin and Ashnak, basing themselves in Sardarapat. In the evening of 20 May, the retreating troops of the 1st Special Brigade – the Erzinjan Regiment and half a battalion from the Khnus Regiment (under the command of Karapet Hassan-Pashaian) – moved deeper from Sardarapat to the village of Khznauz.\nAs a result of the Turkish invasion in Alexandropol-Yerevan direction, the groups defending Surmali were in danger of being cut off from the main forces of the Yerevan detachment and surrounded by the Ottomans. On 18 May, Ottoman forces attacked the Armenian unit in Koghb, which, by Silikyan's order, withdrew towards the Karakala bridge. On 19 May, the military units of the 4th Turkish Corps invaded Surmali from Bayazet, seeking to cross the Araks River and reach the rear of the Yerevan detachment. After showing some resistance in mountain passes and high grounds near Igdir, the Armenian units (1st and 2nd Regiments of Van) had to retreat to Igdir on 20 May, where they received an order from Yerevan to cross to the left bank of Araks across the bridge of Margara, burning down the aforementioned bridges afterwards. After capturing Surmali, the Ottoman forces were thus cut off from the Sardarapat theater. The Armenian volunteers arranged the defense of the bridges, thwarting any attempt by the Turks to cross the river and attack the Armenians from the rear.\nBy the order of Silikyan, some of the 3rd Special Brigade subdivisions (4th regiment of Van, under the command of Colonel Tigran Baghdasaryan) were stationed in those areas to defend the rear from the south and prevent the Ottomans from crossing the river.\nCourse of the battle\nArmenian counter-offensive\nOn 21 May, the 108th Turkish Infantry Regiment, including cavalry and infantry subdivisions, went on with their offensive from an area adjacent to Araks railway station. The Sardarapat detachment, conducting defensive artillery operations, started to retreat and withdrew to the Kurakanlu-Kyorpalu-Zeyva Hayi initial positions. The Turks came close to Kyorpalu (7&nbsp;km west of Etchmiadzin). Advancing along the railroad, on 21 May, the detachment of Zihni Bey overtook an Armenian unit composed of 600 infantry and 250 cavalry, and then took Sardarabad. (now in the territory of the city of Armavir) that evening and the village of the same name 2&nbsp;km south of the station, as well as the village of Gechrlu. Keeping up with their attack, the Turkish forces took the Verin Kolibeklu settlement (now in the territory of the village of Aknalich) and proceeded to Ghamishlu train depot (now in the territory of the village of Zartonk), 20&nbsp;km far from Yerevan.\nThe Turkish forces moving along the railroad sought to advance towards Zangibasar, which would put the Armenian troops south of the railroad, the locals and as many as 100,000 Western Armenian refugees at risk of being cut off from Yerevan and destroyed. But Captain Khoren Igitkhanyan's artillery battery stationed in the village of Artashar managed to pin the Ottomans to the spot.\nDespite the retreat, the defense of bridges on the left bank of the Araks River was significantly enhanced. At the same time, more Armenian units were sent to the battleground from Yerevan.\nCommander of the Yerevan detachment Movses Silikyan and his Chief of Staff, Colonel A. Vekilyan drew up a tactical plan designed to throw the counter-attacking Turkish forces out of Sardarapat. In the evening of 21 May, all the detachments of the Sardarapat Front were given relevant instructions for the next day with an order to coordinate military action. Included in the Armenian forces fighting in the Sardarapat Front were the 5th and 6th regiments, the Infantry Regiment of Karakilisa (Lieutenant-Colonel Areshyan) of the 2nd Special Brigade, the Partisan Infantry Regiment, the Yezidi Cavalry Battalion, the Western Armenian volunteer groups, four artillery batteries.\nOn the night of 21–22 May, an exchange of fire between the Armenian militia and the Yezidi Cavalry Unit commanded by Jahangir Agha and the Turkish troops near the village of Molla Bayazet prevented the Ottomans from attacking the Armenian forces from the rear. The shooting gave Dolukhanyan and Perekrestov the opportunity to array the troops for the battle, at the same time enabling Captains Sergo Atanesyan and Vladimir Sakkilari to marshal their artillery units.\nDeputy commander of the Yerevan detachment, commander of the forces of the Sardarapat Front Colonel Daniel Bek-Pirumyan came to lead the crucial counter-attack of the Armenian forces. In the early hours of 22 May, the Armenian side launched an offensive along the entire front-line of the villages of Kurakanlu-Kyorpalu-Zeyva Hayi-Ghurdughuli. The attack was carried out by the 5th and 6th Regiments in the center, which managed to destroy the vanguard Turkish troops with support from artillery and machine guns near the Ghamishlu depot. In particular, military batteries under the command of Kh. Igitkhanyan, V. Sakkilari, Nikolay Klich and S. Atanesyan, positioned on the hills close to the battleground, as well as machine gun subdivisions of other military units, managed to suppress the Ottoman artillery fire and inflict casualties on their infantry and cavalry ranks, which enabled the Armenian infantry and militia to launch a counter-offensive in full force. Perekrestov's volunteer regiment, the squads of Igdir, Zeytun and Khnus, 1st Special Cavalry Regiment struck the Ottomans from the sides and the rear. The Turkish forces attempted to resist, which at some points involved bayonet fighting, but were forced to flee after suffering major losses.\nThe Armenian units continued their advance and took back Gechrlu, Molla Bayazet, the village of Sardarapat and the station of the same name, as well as the field lying to the right of it. One battalion of the 5th Armenian Regiment attacked in the direction of Kosh-Talish and liberated the villages of Ujan and Kosh by the evening. The vanguard Turkish forces were entirely destroyed in the fighting, with more than 500 casualties registered on their side overall. The Armenians, meanwhile moved forward 15–20&nbsp;km.\nAfter suffering defeat on 22 May, the Turkish forces took advantage of the fact that the Armenians stopped pursuing them to avoid diverging from their initial objectives, and retreated towards Araks station, basing themselves on the hills nearby. In the days that followed, the 449 (Tulki-tapa) and 440 (Cimni Gir) high grounds north of the station had a great tactical significance for both sides.\nOn 23 May, no combat operations were carried along the main front of Sardarapat, with only one military unit from Igdir clashing with the enemy near Dzhafarabat. After winning the battle, the Igdir detachment joined the Sardarapat detachment under Daniel Bek-Pirumyan's command, while the subdivisions of the 2nd Special Regiment of Zeytun were entrusted with the defense of the bridges on Araks River. Repeated Turkish attempts to cross the river were met with fierce resistance by the 5th Armenian Regiment. On the other parts of the front, the two sides were chiefly engaged in exploration of enemy positions and arraying of troops for the battle. On 22 and 23 May, a group of clergy representatives led by Bishop Garegin Hovsepyan and Archbishop Zaven visited the front to encourage the soldiers. Ahead of the crucial battle of 22 May, Bishop Karekin met the soldiers of the 5th Regiment and addressed them.\nFirst days of the battle\nAfter the battles of 22 May, Major-General Movses Silikyan moved a part of detachments he had at his disposal – the 6th Regiment, the 2nd Cavalry Regiment, the Partisan Cavalry Regiment and other units – to the Bash-Aparan Front to block the advancement of the Turkish troops proceeding towards Yerevan. Movses Silikyan ordered elements of the 5th Armenian Regiment under Poghos Bek-Pirumyan, a reserve guerrilla unit, and a special cavalry regiment to check the advance of the Ottoman army. The Armenians' first victory in the Sardarapat Front was of crucial importance not only in terms of boosting combat readiness of the army and ensuring further victories, but also overcoming the panic among the Armenian population of the province of Yerevan and the Western Armenian refugees. On 24 May, Major-General Silikyan urged the nation to join the battle:Armenians, hurry up to free the homeland… There’s no time to lose. All the men under the age of 50 are obliged to take up arms: I demand that everyone come with their weapons and ammunition for the defense of the homeland … – Movses Silikyan (22 May 1918)Residents of Yerevan and the surrounding villages would send water and food, other essentials for those fighting in the battle.\nAfter the first defeat in the Sardarapat Front, the Turkish command staff, seeking to succeed and make progress, adopted the tactics of weakening the rear of the Armenian troops by means of riots in villages populated by Turkic-speaking peoples. Such unrest was observed in the Davalu-Ghamarlu region on 22 May, the first day of the counter-offensive. When the Armenian population of Davalu was transferred by train to Garamlu for security reasons that day, the 4th Regiment of Van overseeing the transfer was attacked by a mob of 5,000 from Turkish and Kurdish villages nearby. The five-hour confrontation was especially fierce in the vicinity of the villages of Avshar and Shirazlu which the Armenian troops ultimately captured. Later in the day, however, the Regiment came in the village of Yuva. The Armenian side suffered 37 casualties overall, while Turkish casualties exceeded 100.\nTill the end of the Battle of Sardarapat and the departure to Dilijan at the beginning of June, the 4th Regiment of Van overseeing Ghamarlu protected the rear of the Yerevan detachment from Sharur, as well as foiling the Turks' attempt to cross the Araks River.\nFurther fighting\nOn 24 May, the Turkish side launched an offensive but was thrown back sustaining heavy losses from Armenian artillery fire. The initial positions of both sides remained unchanged. In order to conceal defeats and major losses, the Turkish command staff made up a fake story about the sinking of Turkish echelon in the Akhuryan River and disseminated it through the press.\nBy the order of Major-General Movses Silikyan, a regrouping of the Armenian forces was carried out. As a result, the main Armenian strike forces – the companies of the 5th Rifle Regiment, as well as one cavalry company from the 1st Special Cavalry Regiment, the Patrol Department of the Yerevan detachment – were stationed in the direction of Sardarapat-Araks railway station. In the left wing, the Partisan Infantry Regiment, the remaining subdivisions of the 1st Special Cavalry Regiment, four cannons from the 2nd Battery were dispatched to the villages of Sardarapat and Molla Bayazet. The detachment of Igdir (1st and 2nd Regiments of Van) based themselves in the village of Kyarimarkh, while the 2nd Cavalry Regiment (Zeytun), the Regiment of Karakilisa, as well as several volunteer groups were sent to the Araks River. The right wing, meanwhile, was protected by forces designed for quick military manoeuvres, including the Regiment of Erzincan in Khznauz and half a company from the Squad of Khnus, as well as the Battalion of Maku in Kosh and one company from the Regiment of Karakilisa. Movses Silikyan had forced the Turks back 50 kilometres from Sardarabad by the evening of 24 May, and a few days later Drastamat Kanayan had driven them back towards Hamamlu, nowadays known as Spitak.\nThe Partisan Cavalry Squad under the command of Captain Pandukht (Mikayel Seryan) was stationed in the front-line positions of the right wing, while some subdivisions of the 5th Regiment of the Sardarapat military unit went to the villages of Upper Kulibeklu (near the village of Aknalich) and Turkish Zeyva.\nOn 25 May, the vanguard subdivisions of the 5th Regiment, supported by four artillery batteries and Captain Tachat Hovakimyan's machine gun squad, attacked the 440th and 449th hills, but met persistent resistance from the Turkish side and were forced to retreat to their initial positions. Another Armenian military column attacked along the railway towards the Araks station and stopped about 3&nbsp;km away, encountering persistent resistance from Turkish frontline units. A very strong grouping of enemy troops turned out to have been dispatched to Araks station, whereas the Armenian intelligence had reported that the main forces of the Turks were based at Karaburun station and in Nerkin Talin.\nIn the early hours of 26 May, the reserve companies of the 5th Regiment were brought forward from the rear. According to a roadmap drawn by Commander Movses Silikyan, the right, central and left columns were set to capture Araks and Karaburun stations with a simultaneous attack and throw the rival back to Alexandropol by attacking along the entire area from the slopes of Mount Aragats to the banks of Akhurian River.\nLater in the morning of that same day, the 1st Battalion of the 5th Regiment, by the arbitrary order of Stabs-kapitan Vardan Jaghinyan, launched an unsuccessful offensive on the Cimni Gir (440) high ground and was forced to retreat to its initial positions, suffering major losses, including Jaghinyan himself. No actions were taken on the other part of the front, with only Colonel A. Perekrestov's Partisan Machine Gun Regiment striking the Turkish troops near Araks station.\nAfter the unsuccessful assaults of 25–26 May, Silikyan came up with a new plan which sought to perform a quick manoeuvre of detachments in Khznauz and Kosh and support the frontal attack on Turkish-held hills with strikes from the rear. At the same time, the central and left wings of the main front were reinforced by the Igdir Regiment and the Patrol forces of the Partisan Regiment, brought forward from the rear.\nAt dawn of 27 May, the Khznauz detachment initiated manoeuvres and successfully bypassed the left wing of the Turkish vanguard forces. At the same time, the detachment of Kosh to the right of that of Khznauz was unable to overcome the resistance of Turks near the village of Nerkin Kalakut and had to stop, with Erzincan Regiment Commander K. Hassan-Pashaian sending two companies for help. At 9 a.m. on the same day, the Armenian artillery units in the main front of Sardarapat carried out powerful strikes on the rival's positions for half an hour, suppressing fire from artillery and machine gun subdivisions from the other part of the battleground. The central detachments then launched an offensive on the enemy positions, waiting for an attack from the rear for a decisive blow.\nTo encourage his soldiers, Colonel Daniel Bek-Pirumyan wore his military uniform inside out to reveal the red lining and led his army into battle. After bypassing the left wing of the Turkish troops at noon, the detachment of Khznauz turned sharply to the south, reaching the rear of the 440 and 449 hills. Following this brilliant tactical maneuver, the main forces of the central front of Sardarapat attacked and, with support from the Erzincan Regiment, managed to capture the high grounds nearby at 2:00&nbsp;pm.Our entrenched lines got up and with shouts of \"hurrah\" pursued them. A group of Turks was successfully surrounded, but the main part fled, running head over heels, because the detachment of Captain Hassan Pashaian with the Erzincan regiment, already operated in their rear. A few moments later the Turks started to flee abandoning everything including their munitions, supplies, their wounded and dead. The battle was won. Armenia was saved. – Alexander Chneour\nOn the same day Perekrestov's left column launched an assault along the railway and captured Araks station, as well as Mastara depot in the evening. Captain Pandukht's cavalry unit, meanwhile, started an offensive south of Nerkin Kalakut, overturned the resistance of Turkish forces with the help of companies from Kosh and Khznauz, then cut through the Turkish troops to the north-west of the battleground. On 27–28 May, Pandukht's squad weighed heavily upon smaller Turkish units, passed through Talin, Gyuzlu and Kirmizlu to rapidly penetrate into Sogyutlu, where Pandukht was joined by a local 1000-member squad. A cannon was seized from Turks, and a large number of troops were taken captive as a result.\nDuring the decisive battles on 27 May, the Turks were completely defeated, forced to retire to Karaburun Station-Mount Karaburun line in a panic. Exhausted after winning the battle, the Sardarapat detachment was ordered to stop and base themselves on the heights of Mastara depot. During that day, a 100-member Kurdish unit was thrown back while attempting to cross the Araks River near Margara.\nOn the night of 27–28 May, the Armenian forces moved forward and reached the Karaburun station-Mount Karmrasar line. Unable to resist the Armenian side's attacks after a brief engagement in Karaburun-Ashnak, the Turks began to withdraw towards the Aragats station-Kirmizlu-Verin Agdzhakala on 28 May, where they were once again thrown back to the north. As a result of that day's fighting, the Armenian side seized Karaburun and Aragats stations, as well as Nerkin Talin, Verin Talin and Mastara, while Armenian intelligence units reached Ani station and found out that there were no Turkish troops on their way to Ani and Aghin stations. The next day on 29 May, however, the Turkish forces were significantly reinforced, which enabled them to initiate a counter-offensive on Aragats station. Heavily pressed by the Turkish units and under threat of encirclement by them, the vanguard Armenian forces retreated and based themselves at the Karaburun station. In the right wing of the battleground, meanwhile, the Armenians fought heavy battles near the village of Shirvandzhug. It was on that same day that Major-General Movses Silikyan, the commander of the Yerevan detachment, addressed the people and the army for the second time urging them to continue the triumphant battles to take Alexandropol too.Armenians! The heroic activity of our brave troops is going on, and the Turkish forces are retreating. We must take Alexandropol back from the Turks who seized the city so treacherously. They require Akhalkalak, Alexandropol and Etchmiadzin along with the Holy See, most of the Yerevan province, Nakhijevan. Can we tolerate such an insult? Armenians, assemble hurriedly, kick the enemy out of our native bleeding soil. To arms, everybody. To Alexandropol. Ashkhatank No 5 (205), June 5 (23) 1918. – Movses SilikyanBut after the Armenian delegation accepted a three-day ( 26–29 May) Turkish ultimatum in Batumi, a ceasefire was signed that same day (29 May). By the order of General Tovmas Nazarbekian all the Armenian forces ceased attacks. This marked the end of the Battle of Sardarapat. The soldiers of the Sardarapat Front and the command staff were extremely dissatisfied with the news of the ceasefire and cessation of attacks. According to the commander of the Armenian artillery unit, Colonel Christophor Araratyan, although the Yerevan detachment was in a favorable situation when the ceasefire was being signed, they were forced to stop the assault because Yerevan would have been open to an enemy attack from the northeast. According to some analyses, the cessation of attacks in the Battle of Sardarapat was also influenced by the fact that the Armenian military warehouses were almost empty, as well as by the danger of Turkish troops launching another counter-attack after receiving fresh supplies.\nOnce the truce was established in Batumi, clashes continued in some sections of the Sardarapat Front but no significant changes were made. Following the signing of the Treaty of Batum on 14 June, all the Armenian units withdrew from their posts to the borderline prescribed by the agreement.\nIn the Battle of Sardarapat, Turkish casualties amounted to 3,500, while the Armenian side's losses were far lesser, although no accurate data is available.\nAftermath\nWith the Ottoman forces in a full rout, General Silikyan wished to press on his advantage with the hope of dislodging the Ottomans from Alexandropol and Kars. But, almost immediately, he was informed of the ongoing negotiations between the Ottoman leadership and the Armenian National Council in Tiflis and was told by Corps Commander Tovmas Nazarbekian to cease military operations in the region. Though members of the National Council were widely criticized for issuing this order at the time, this decision was carried out because the ammunition stores had been all but been depleted and Ottoman commanders had received fresh reinforcements.\nThe nine-day Battle of Sardarapat ended with Armenia's full victory, as a result of which the rival was thrown back 50–65&nbsp;km and the immediate threat to Yerevan was eliminated. The victory played an important role in the partial failure of the Turkish invasion of Eastern Armenia, as well as in securing a victorious counter-offensive in Bash-Aparan and the heroic resistance in Karakilisa. The Battle of Sardarapat saved the locals and Western Armenian refugees from imminent massacre. The victory secured at a great cost also contributed to the enhancement of the role of Yerevan-based political and social organizations, as well as of local authorities and leading figures. In fact, this triumph laid the foundation for the establishment of a newly independent Armenia.\nThe Ottoman defeats at Sardarabad, Bash Abaran, and Karakilisa staved off the annihilation of the Armenian nation, and the victories here were instrumental in allowing the Armenian National Council to declare the independence of the First Republic of Armenia on 30 May (retroactive to 28 May). Though the terms that Armenia agreed to in the Treaty of Batum (4 June 1918) were excessively harsh, the little republic was able to hold out until the Ottomans were forced to withdraw from the region with the end of World War I in late 1918.\nLegacy\nThe battle of Sardarabad holds a special place in Armenian historical memory and is often compared to the 451 A.D. battle of Avarayr. Leaders of the First Republic frequently invoked the name of the battle, exhorting their people to aspire to the example of those who had fought and participated in it. The battle was seldom mentioned or given little significance in Soviet historiography until after the death of Joseph Stalin. In the mid-1960s, a number of Soviet historians began to highlight its importance, as well as that of Bash Abaran and Karakilisa. The Soviet military historian Evgenii F. Ludshuvet, for example, emphasized that these battles, fought by the \"Armenian Dashnak forces\", helped slow down the Turkish advance on Baku and helped relieve some pressure against that city. Notable Soviet Armenian literary figures such as Hovhannes Shiraz and Paruyr Sevak, whose work \"Sardarapat\" was turned into a popular song, composed songs and wrote poems that lionized the Armenian fighters. Ivan Bagramyan, a Marshal of the Soviet Union and himself a participant of the battle, described its importance in the following manner:\n}}\nAfter the commemoration of the Armenian Genocide's fiftieth anniversary in 1965, Soviet authorities agreed to the construction of a monument and park dedicated to the Armenian victory near the site of the battle. Architect Rafayel Israyelian was commissioned to design the monument, which was completed in 1968.\nThe battles of Sardarabad, Bash Abaran and Karakilisa are collectively known as the \"Heroic battles of May\" in Armenian historiography (Մայիսյան հերոսամարտեր Mayisyan herosamarter).\nEach year, the President of Armenia visits the memorial on 28 May. During that day, many cultural and military events and parades take place.\nSee also\n* First Republic of Armenia\n* Sardarapat Memorial\nReferences\n;Notes\n;References\n}}\nFurther reading\n* Afanasyan, Serge. La victoire de Sardarabad: Arménie, mai 1918. Paris: L'Harmattan, 1985.\n* Allen, William E. D. and Paul Muratoff. Caucasian Battlefields. Cambridge: Cambridge University Press, 1953.\n* Aghayan, Tsatur P. Հոկտեմբերը և Հայ Ժողովրդի Ազատագրական Պայքարը (October and the Liberation Struggle of the Armenian People). Yerevan: Yerevan State University Press, 1982.\n* Kayaloff, Jacques. The Battle of Sardarabad. The Hague: Mouton, 1973.\n* Hovannisian, Richard G. Armenia on the Road to Independence, 1918. Berkeley: University of California Press, 1967.\n* Poidebard, Antoine. \"Rôle militaire des Arméniens sur le front du Caucase après la defection de l'armée russe (décembre 1917–novembre 1918)\". Revue des Études Arméniennes, I, pt. 2, 1920.\n*"
    }
  ]
}