{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Waynesboro, Virginia\n\n| place       = Augusta County, Virginia\n| result      = Union victory\n*Destruction of Early's Army of the Valley\n| combatant1  =  United States of America (Union)\n| combatant2  =  Confederate States of America\n| commander1  = Philip SheridanGeorge Armstrong Custer\n| commander2  = Jubal Early\n| strength1   = 2,500\n| strength2   = 1,600\n| casualties1 =9\n| casualties2 =1,500+\n| casualties3 =\n| campaignbox =\n}}\nThe Battle of Waynesboro was fought on March 2, 1865, at Waynesboro in Augusta County, Virginia, during the American Civil War. It was a complete victory for Brig. Gen. George Armstrong Custer and the final battle for Confederate Lt. Gen. Jubal Early, whose force was destroyed.\nBackground\nOn February 27, 1865, Major General Philip Sheridan rode with two cavalry divisions from Winchester up the Shenandoah Valley toward Staunton. He had orders to take his cavalry south to join Major General William T. Sherman's army in the Carolinas campaign. After crossing the North Fork of the Shenandoah River on February 28, Brigadier General George Armstrong Custer's division encountered some 300 Confederate cavalrymen under Brigadier General Thomas Rosser guarding the Middle River near the village of Mount Crawford. Rosser set a long covered bridge on fire, hoping to delay the Federals. Custer ordered two of his regiments to swim across the river and strike Rosser's flank, while additional regiments stormed the bridge. Custer successfully drove off Rosser's meager force, extinguished the fire, and rode on to Staunton, where they were joined by the bulk of Sheridan's force the next day. Desiring to eliminate Early's small force as a threat to his rear, Sheridan turned east instead of proceeding to Sherman.\nCuster's men set out towards Early's force at Waynesboro on March 2 with orders to \"proceed to Waynesborough, ascertain something definite in regard to the position, movements, and strength of the enemy, and, if possible, to destroy the railroad bridge over the South River at that point.\" Heavy rain and sleet, which had been falling for several days, turned the road into a quagmire and greatly impeded the speed of the march. At Fishersville, just six miles from Waynesboro, Custer's men drove off Confederate vedettes and continued their march. Upon arriving outside of Waynesboro, Custer found Early's army dug in behind a \"formidable line of earth-works.\"\nOpposing forces\nUnion\nSheridan was the overall Federal commander in the Valley, but did not arrive on the field until after the battle was concluded. Brigadier General George A. Custer, commanding the 3rd Cavalry Division, was the effective commander of Union forces on the field. Under his command were Colonel Alexander Cummings McWhorter Pennington, Jr. (commanding the First Brigade), Colonel William Wells (commanding the Second Brigade), Colonel Henry Capehart (commanding the Third Brigade), and at least one section of the Second US Horse Artillery under a Captain Woodruff. Custer's total strength is estimated at 2,500.\nConfederate\nLieutenant General Jubal A. Early commanded the remnants of the Army of the Valley, by this point reduced to a single division of infantry, three batteries of artillery, and a small unit of cavalry (the rest having been dispatched across the Valley). The infantry division, commanded by Brigadier General Gabriel C. Wharton, was composed of two small infantry brigades commanded by Colonel Augustus Forsberg and Colonel Thomas Smith. Forsberg's Brigade consisted of the 50th and 51st Virginia Infantry Regiments and the 30th Virginia Sharpshooters Battalion, while Smith's Brigade contained the 36th and 60th Virginia Infantry Regiments and the 45th Virginia Infantry Battalion. An independent infantry command, under Colonel William H. Harman, was composed of Virginia Militia reservists. Colonel William Nelson commanded the Confederate artillery, composed of Captain Thomas J. Kirkpatrick's Amherst Artillery, Captain John Milledge's Georgia Regular Battery, and Captain Charles G. Snead's Fluvanna Artillery. With Thomas Rosser's and Lunsford Lomax's cavalry dispatched elsewhere in the Valley, Early had \"not more than one effective company\" of cavalry at the time of the battle.\nEstimates on the size of the Confederate force varies considerably. Early later claimed he had \"not more than 1,000 muskets\" and \"six pieces of artillery\" at the time of the battle. Various Union forces claimed capture of between 1,500 and 1,800 men (more men than Early claimed to have in his entire army) and between 11 and 14 pieces of artillery. Compromising historians have placed Early's effective strength between 1,000 and 1,200 men and 6 to 14 pieces of artillery.\nBattle\n.]]\nEarly stationed his men atop a low ridge just west of Waynesboro. Earthworks shielded his entire front. On his extreme right, he positioned the three guns of Kirkpatrick's Amherst Artillery; on his right-center he placed one of his infantry brigades. In his center, he posted his small cavalry force and another infantry force (probably Harman's militia). To their left, Early posted Milledge's Georgia Regular Battery and Snead's Fluvanna Artillery. On his left, Early posted his other infantry brigade. However, he left his left flank exposed, supposing (incorrectly) that a dense woods would impede any Union thrust in that direction. Compounding this error was that the Confederate position allowed for only two avenues of retreat over the South River; a railroad bridge and a small footbridge provided the only crossing points over the rain-swollen river. Early later claimed that he planned to withdraw that night when darkness could conceal his retreat from enemy eyes; furthermore (Early claimed) a number of stores and artillery had yet to be moved to safety.\nAn artillery duel began shortly after Custer's men arrived on the town's outskirts at about 2:00 pm. Custer sent Colonel William Wells' Second Brigade forward to probe the enemy position, which was promptly discovered to be relatively strong. But shortly thereafter, Custer learned of the gap between the Confederate left flank and the South River. Recognizing that a flanking maneuver could spare him major casualties which would ensue from a head-on attack, Custer ordered Colonel Alexander Cummings McWhorter Pennington, Jr. to take three regiments (the 1st Connecticut Cavalry, 2nd Ohio Cavalry, and 3rd New Jersey Cavalry) from his First Brigade to assail the Confederate flank. After sending Lieutenant Colonel Edward W. Whitacker of his staff to personally direct the flanking maneuver, Custer ordered Wells to divert the enemy's attention away from Pennington's movement by launching a diversionary probe on the Confederate center. Colonel Henry Capehart's Third Brigade was held in reserve with the two regiments Pennington did not take on his flanking maneuver.\nAt 3:30 pm, the signal to attack was given. A section of Custer's horse artillery rolled into action and engaged the attention of the Confederates. Minutes later, Pennington's flanking force, led by the 2nd Ohio, dismounted and armed with Spencer carbines, rushed out of the woods and rolled up the startled Confederates' left flank. Just as the Confederates were reforming to face this new threat, Wells' and Capehart's brigades rushed the Confederate center. In a matter of minutes (one historian stated that the Confederates fired a single volley), Early's army was thrown into panic.\nJedediah Hotchkiss, Early's (and formerly \"Stonewall\" Jackson's) topographical engineer called the rout, \"one of the most terrible panics and stampedes I have ever seen.\" The Confederates' only routes of escape over the South River, the railroad bridge and the footbridge, quickly became jam-packed with fleeing men and ordnance; hundreds of Confederates were captured as they tried to flee across the river.\nConfederate Colonel William Harman was killed in action; surrounded by five Federal troopers, Harman refused their entreaties to surrender and was killed. Dr. Hunter McGuire of Early's staff was captured after he was dismounted while attempting to jump his horse over a rail fence; a Federal trooper was preparing to gun McGuire down when the doctor gave the Masonic sign of distress, which was recognized by a Union officer who intervened on McGuire's behalf and ordered the doctor not to be harmed, though he was taken prisoner.\nEarly himself, along with some of his staff, managed to escape. His entire army was captured or scattered across the countryside, never again to form an effective fighting force.\nAftermath\nCuster's men pursued the routed Confederates for a dozen miles before darkness brought an end to their pursuit. Union officers would claim the capture of between 1,000 and 1,800 men, 11 to 14 cannon, 150 to 200 wagons, and 16 stands of colors (including a recaptured Union flag). Despite Early's rebuking of the claims, evidence (including 15 Medal of Honor citations for capture of flags at Waynesboro) suggests that Union claims were very close to the truth. Regardless of the exact figures, all sources agree that Early lost all of his artillery, wagons, and ambulances, and his infantry was too shattered to form an effective fighting force for the rest of the war. Custer placed his own losses at a mere 9 men killed and wounded.\nSheridan crossed the Blue Ridge Mountains to Charlottesville and then raided south, destroying the James River Canal locks near Goochland Court House. He joined forces with the Army of the Potomac near Petersburg on March 26 for the opening of the Appomattox Campaign. Early never received another field assignment for the rest of the war.\nCaptain Christopher C. Bruton of the 22nd New York Cavalry later received the Medal of Honor for the capture of Early's headquarters flag during the battle.\nSecond Lieutenant Andrew Kuder of Company G, 8th New York Cavalry also received the Medal of Honor for extraordinary heroism and the capture of the flag.\nReferences\n* [https://web.archive.org/web/20121108222417/http://www.nps.gov/hps/abpp/CWSII/VirginiaBattlefieldProfiles/Walkerton%20to%20Waynesboro.pdf CWSAC Report Update]\n* [https://web.archive.org/web/20150304120617/http://www.nps.gov/abpp/battles/va123.htm National Park Service Battle Summary: Waynesboro, VA]\n* [https://web.archive.org/web/20121108222417/http://www.nps.gov/hps/abpp/CWSII/VirginiaBattlefieldProfiles/Walkerton%20to%20Waynesboro.pdf CWSAC Report Update]\n* US War Department, [http://ehistory.osu.edu/osu/sources/records/list.cfm The War of the Rebellion] : a Compilation of the Official Records of the Union and Confederate Armies, US Government Printing Office, 1880&ndash;1901.\n* Tyler, Lyon Gardiner. [https://books.google.com/books?id=jzoUAAAAYAAJ&pg=PA819&lpg=PA819 'Encyclopedia of Virginia Biography, under the editorial supervision of Lyon Gardiner Tyler'], Volume V. New York: Lewis Historical Publishing Company, 1915. . Retrieved September 16, 2012."
    }
  ]
}