{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Dartsedo\n\n|strength1= 2000\n|strength2= unknown\n|casualties1= unknown\n|casualties2= extremely heavy\n|notes=\n}}\nThe Battle of Dartsedo was fought on January 28, 1701, between the Qing and Tibetan armies over the control of the strategic border town of Dartsedo.\nThe town of Dartsedo was an important trade center between Tibet and China proper, and for centuries its importance lay on the tea-horse trade. Sino-Tibetan trade in Dartsedo continued to expand as the demand for Chinese products in Tibet grew. The Tibetan interest in Dartsedo led to a growing official presence in the town and taking advantage of the anarchy that created after the fall of the Ming dynasty, the Tibetans took control of the town and stationed a garrison and officials in it.\nAfter the Qing dynasty had consolidated its hold on China the Kangxi Emperor maned official displays of his sovereignty over Dartsedo but he allowed the Tibetans to maintain de facto control of the town. Tensions began to grow in 1698, when the Chinese General Yue Shenglong began a military buildup in the town of Muya, west of Dartsedo. General Yue had warned to the court the importance of Dartsedo giving the fact that it occupied an important position in the road between Chengdu and Lhasa he recommended its capture. The next year Changcejilie, the Tibetan official responsible for the area, countered Yue's move by sending thousand of soldiers to cover the route between Yazhou and Dartsedo.\nYue's aggressive stance had been opposed by the governor of Sichuan, Yu Yangzhi, and both officials were suspended by the Emperor after an inquiry that found them guilty of illicit enrichment. Yue successor, Tang Xishun, put Xierda in charge of military operations in Sichuan. Xierda petitioned the Emperor to put Changcejilie under arrest for the murder of a local chief, and he recommended the transfer of the garrison of Hualin to Dartsedo.\nThe Emperor agreed to Xierda's recommendations and in an edict addressed to the Tibetan regent, Desi Sangye Gyatso, he clearly claimed sovereignty over Dartsedo and demanded its surrender to the Qing forces as well as Changcejilie's delivery.\nThe Tibetans resisted the Qing garrison of Hualin and killed the soldiers who were paving a road and pulled down bridges to try to slow down their advance. The Emperor resolved to solve the problem with war and sent 2000 Manchu Bannermen from Jingzhou, in Hubei. The Manchus attacked Dartsedo on January 28, striking at the town from 3 different directions. Tibetan resistance was overpowered and the Qing force soon had control of the town. The defeat of the Tibetan garrison was followed by a slaughter of almost all of the Tibetan men in Dartsedo.\nLater in 1720 Tibet became ruled by the Qing after the Chinese expedition to Tibet of that year.\nReferences\nSources\n*"
    }
  ]
}