{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Akabar\n\nFrance Mali MSAGATIA\n| combatant2        =  Islamic State in the Greater Sahara Jama'at Nasr al-Islam wal Muslimin\n| strength1         = Unknown\n| strength2         = ~60\n| casualties1       =  None 1 killed, 2 wounded 3 killed, 5 wounded\n| casualties2       = 20-30 killed (per France and MSA)Several captured (per MSA)\n}}\nThe battle of Akabar took place on April 1, 2018, between French and Malian forces aided by Tuareg rebels against Jama'at Nasr al-Islam wal Muslimin and the Islamic State in the Greater Sahara.\nPrelude\nThe Menaka region of southeast Mali, near the borders of Niger and Burkina Faso, has been a hotbed of jihadist violence since 2016 and 2017 when the Islamic State in the Greater Sahara exercised control over it, along with Jama'at Nasr al-Islam wal Muslimin, a coalition of five al-Qaeda aligned jihadist groups that have rebelled against the Malian government since 2012. Just prior to the battle of Akabar, on March 28, 2018, joint Franco-Malian forces launched an operation to combat JNIM and ISGS, with the Franco-Malian forces aided by the local Tuareg militant groups Movement for the Salvation of Azawad and Imghad Tuareg Self-Defense Group and Allies, along with the Nigerien government.\nBattle\nA skirmish broke out near the village of Akabar on April 1, 2018, in an area under heavy ISGS influence. In response, French forces deployed a group of commandos and air support to combat the sixty ISGS militants on motorcycles. The clashes lasted until nightfall, at which point the French commandos, Malian soldiers, and MSA and GATIA fighters retreated from the area. The troops returned the following morning to conduct reconnaissance, by which point the jihadists had fled.\nAftermath\nThe French general staff stated on April 5 that there were no French losses, but that Malian soldiers were killed. The French government also estimated that thirty jihadists were \"neutralized\" in the battle. The MSA released a statement on April 1 affirming twenty \"bandits\" had been killed, and some were captured. The MSA statement also claimed that three MSA and GATIA fighters were killed, and five injured. The leader of the MSA, in an interview with RFI on April 23, claimed over a dozen Tuareg fighters had been killed, and 30 to 40 jihadists had been killed.\nBruno Guibert, the commander-in-chief of Operation Barkhane, stated the battle was fought jointly by JNIM and ISGS, adding that the attack was not jointly planned by either group and rather shared goals between the two groups in that singular instance.\nReferences"
    }
  ]
}