{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Piperdean__disambig_1\n\nThe Battle of Piperdean was an engagement in the Scottish Borders, fought on 10 September 1435 between the Kingdom of Scotland and the Kingdom of England.\nAn English force led by George de Dunbar, 11th Earl of March and Henry Percy, 2nd Earl of Northumberland attempted to take the forfeited Dunbar's Castle of Dunbar back from William Douglas, 2nd Earl of Angus, who as Warden of the Scottish Marches had invested the castle the previous summer. Percy and Dunbar came north with some 4,000 men.\nAngus did not want to undergo a siege, and decided to pre-empt the English by attacking them en route. An army of roughly the same force surprised the English, under Angus, Adam Hepburn of Hailes, Alexander Elphinstone of that ilk, and Alexander Ramsay of Dalhousie.\nAlthough an overwhelming Scots victory, there is some confusion as to casualties and prisoners taken. Ridpath states that the Scots lost 200 men including Elphinstone, with Brenan concurring about this 'trifling' amount,. The English suffered 1,500 fatalities, including 40 knights.\nNorthumberland retreated to Alnwick Castle, but it was not long before he returned to Scotland to relieve Roxburgh Castle, which was under siege by King James.\nSite of battle\nGeorge Ridpath (Border History - 1776) states\n\" The earl of Northumberland...advanced towards the Scottish marches but was met within his own territories at a place called Pepperden on Brammish not far from the mountain of Cheviot.\nThe Breamish is the name given to the upper reaches of the River Till which arises in Cheviots \"within the territory of the Earl of Northumberland\".\nThe site of the battle is probably in this area near Wooler rather than at Auld Cambus. There is no mention on the RCAHMS website of a battle site at Auld (or Old) Cambus, although the manuscripts of the Earl of Home state that it occurred near Dunglass.\nThe Department of Archaeology, Northumberland C.C. place the battle at Piperdean on the Pressen Burn near Wark (Grid Reference:NT8400635899). This also given as the site of the Battle of Piperdean in the Transactions of the Berwickshire Naturalists.\nReferences\n1 Transactions of Berwickshire Naturalists 1910 p 138\n2 \tFoard, G, 2008. Conflict in the pre-industrial landscape of England: a resource assessment. University of Leeds\npp21–2\n2 a\tRayner, M, 2004. English battlefields : an illustrated encyclopaedia. Stroud: Tempus\nSources\n*Brenan, Gerald-A History of the House of Percy-Freemantle, London 1902\n*Maxwell, Sir Herbert-A History of the House of Douglas-Freemantle, London 1902\n*Ridpath, George-The Border History of England and Scotland-Edinburgh, London, Berwick 1776\n*HMSOThe Manuscripts of the Duke of Athole, K.T., and of the Earl of Home, London 1891 [https://archive.org/stream/manuscriptsduke01frasgoog#page/n4/mode/2up]"
    }
  ]
}