{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Halidzor\n\n| result            = Armenian victory\n| territory         = The Ottomans lifted siege\n| combatants_header =\n| combatant1        = Armenians of Syunik\n| combatant2        =\n* Ottoman Empire\n* Armenian defectors\n| commander1        = David BekMkhitar SparapetTer Avetis\n| commander2        = Unknown\n| strength1         = 300\n| strength2         =\n* 70,000 (likely exaggerated)\n| casualties1       = Light (Armenian claim)\n| casualties2       = 13,000 (Armenian claim)\n| partof            = the Syunik rebellion\n}}\nThe Battle of Halidzor () took place in the spring of 1727 at Halidzor Fortress, in what is now the Syunik region of Armenia, near the modern-day city of Kapan, between the Armenian forces under the leadership of David Bek and the Ottoman army.\nBattle\nThe main account of the Battle of Halidzor comes from the mid-eighteenth-century Armenian work Patmutiun Ghapantsvots () by Ghukas Sebastatsi. The battle took place amidst a larger military campaign launched by the Ottoman Empire in the 1720s to secure control over the South Caucasus. The Ottomans encountered fierce resistance by local Armenian princes and lords in Syunik, especially near the town of Kapan, with David Bek, Mkhitar Sparapet and Ter Avetis at the head of small makeshift forces.\nIn the spring of 1727, pursued by the Ottomans, David Bek and his followers took refuge in the fortress at Halidzor. The Ottoman army put Halidzor under siege but came under incessant attacks launched by small Armenian units from the fortress. David Bek's comrades-in-arms, Mkhitar and Ter Avetis did their best to boost the morale of the men in the fortress, proclaiming, \"Take heart, do not be afraid, follow us, and if our end has arrived, let us die bravely, because for us it is better to die with courage outside the walls than to see before our eyes the death of our families and friends inside the walls.\"\nAfter seven days, the Ottomans abandoned their emplacements and retreated. According to Armenian sources the remnants of the army dispersed across the region, with confusion and panic raging among its ranks.\nWhile the author of Patmutiun Ghapantsvots exaggerates the size of the Ottoman army and the small size of the Armenian force, the difference between the two sides must have been significantly in favor of the Ottoman attackers. The victory at Halidzor greatly encouraged the Armenian rebels, who then expelled Ottoman forces from the area around Kapan and subsequently advanced south toward Meghri.\nCultural impact\nThe battle is depicted in the 1978 Soviet Armenian film about Davit Bek's rebellion, Star of Hope.\nSee also\n* Halidzor Fortress\n* David Bek\n* Syunik rebellion\n* David Bek (opera)\nReferences"
    }
  ]
}