{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Ong Thanh__disambig_1\n\n| result      = Viet Cong victory\n| combatant1  =\n| combatant2  =  Viet Cong\n| commander1  = Terry de la Mesa Allen Jr.\n| commander2  =  Võ Minh Triết  Nguyễn Văn Lém\n| units1      = 2nd Battalion, 28th Infantry Regiment\n| units2      = 271st Regiment, 9th DivisionC1 Company, Rear Service Group 83\n| strength1   = 142–155\n| strength2   = U.S. estimate: 600–1,400\n| casualties1 = 64 killed75 wounded2 missing\n| casualties2 = Unknown: 22 bodies seen, 2 bodies recovered\n| notes       =\n| campaignbox =\n}}\nThe Battle of Ong Thanh was fought at the stream of that name (Ông Thành) on the morning of 17 October 1967, in Chơn Thành District, at the time part of Bình Dương Province, South Vietnam, today in Bình Phước Province.\nDuring the first few months of 1967 the Viet Cong (VC) absorbed heavy losses as a result of large-scale search and destroy missions conducted by the United States Army. This prompted North Vietnamese leaders to review their war strategy in South Vietnam. In light of the setbacks which People's Army of Vietnam (PAVN) and VC forces had experienced in early 1967, PAVN General Trần Văn Trà suggested PAVN and VC forces could still be victorious if they inflicted as many casualties as possible on U.S. military units, hoping that the Americans would conclude that the war was too costly and withdraw from Vietnam. Thus, towards mid-1967 the VC 7th and 9th Divisions returned to the battlefield with the objective of inflicting casualties on U.S. military formations in III Corps. On 12 June the U.S. 1st Infantry Division launched Operation Billings to destroy elements of the VC 9th Division, which had built up strength north of Phước Vĩnh Base Camp in War Zone D. When the operation concluded on 26 June the 1st Infantry Division had lost 57 killed while the VC had lost 347 killed. In September, following a string of attacks on U.S. and South Vietnamese military installations by VC and PAVN troops, Major general John H. Hay decided to temporarily halt large-scale operations until the true intentions of PAVN/VC forces were known. During October the VC 271st Regiment moved into the Long Nguyen Secret Zone to rest and refit for their next major operation. At around the same time Hay launched Operation Shenandoah II to clear a section of Highway 13 which stretched from Chơn Thành to Lộc Ninh.\nStarting on 28 September, elements of the 1st Infantry Division were air-lifted into positions around Long Nguyen, but initially only a few contacts were made with the VC. On 16 October, the 2nd Battalion, 28th Infantry Regiment found a major VC bunker system south of their night defensive position near the Ong Thanh Stream, and a short fire fight broke out. To avoid a long battle, the commander of the 2nd Battalion decided to pull back and made preparations for a frontal assault on the next day. On the morning of 17 October two rifle companies of the 2nd Battalion returned to the bunker system, but they were ambushed by the VC 271st Regiment which had deployed in anticipation of the American attack.\nBackground\nIn the first half of 1967 United States military forces in Vietnam had inflicted major losses on the VC, both in terms of infrastructure and manpower, through large ground operations such as Cedar Falls, Junction City and Manhattan. For North Vietnamese military leaders like Generals Võ Nguyên Giáp and Nguyễn Chí Thanh the operations carried out by the Americans had been disastrous for their forces. The military situation in North Vietnam also prompted North Vietnamese leaders to question their war strategy. The United States expanded their Rolling Thunder bombing campaign, which enabled American airpower to destroy rather than just threaten Hanoi's limited industrial infrastructure. North Vietnamese leaders feared that if the Red River dikes were targeted by the Americans, Hanoi and the surrounding farmlands would be flooded. At the same time,the North Vietnamese government was afraid the VC might split in order to accommodate a resolution with the Saigon government because the U.S.-backed government in the South Vietnam was showing no sign of collapse.\nDespite these unfavorable developments, PAVN General Trần Văn Trà believed North Vietnam could still win the war if they pursued a strategy of attrition. The PAVN/VC would have to fight on for as long as possible until the United States recognized the war was unwinnable and disengage from the conflict in Vietnam. To achieve that objective at the tactical level, Tra believed PAVN and VC forces would have to destroy American military units and cause as many casualties as possible. Towards mid-1967 Thanh, who had the VC 7th and 9th Division at his disposal, began executing this plan. In June, U.S. military forces in III Corps detected the build-up of VC troops in northern Phước Vĩnh in War Zone D. To prevent a major enemy attack on Phước Vĩnh, Major general John H. Hay, commander of the 1st Infantry Division, launched Operation Billings with the objective of trapping three VC battalions in War Zone D. On 26 June Operation Billings concluded. The Americans had killed 347 VC and captured one, at a cost of 57 U.S. dead and 197 wounded.\nIn August the VC 165th Regiment of the 7th Division targeted the Tong Le Chon Special Forces Camp, located southeast of the 1st Infantry Division's area of operations. Just after midnight on 7 August, the 165th Regiment attacked and penetrated the camp, but withdrew after an ammunition bunker exploded. Several more assaults occurred, but on each occasion they were repelled by artillery fire and close air-support. By September the scale of VC and PAVN activities in III Corps had perplexed the U.S. commanders of Military Assistance Command, Vietnam. During this time Hay decided to put an end to his division's large-scale operations, which had proven to be unproductive, until the enemy's real intentions were known. He continued to commit his 2nd Brigade to pacification efforts in southern Bình Dương Province, while the 3rd Brigade provided protection for engineers clearing Highway 13.\nFollowing a number of small engagements with the U.S. 1st Infantry Division during the previous months, Colonel Võ Minh Triết, commander of the VC 271st Regiment, was ordered to move his troops into an area known as the Long Nguyen Secret Zone situated between National Highway 13 and the Michelin Rubber Plantation. It was located about  northwest of Saigon, in Bình Dương Province. Triết's regiment was supposed to receive troop replacements and food supplies to prepare for a major offensive against an unspecified target in War Zone D. The VC 9th Division had often used the months of September and October to rest and prepare for their winter-spring offensives, and 1967 was no different. For that reason Hay was determined to disrupt the VC's resting period by launching Operation Shenandoah II with the objective of clearing Highway 13 from Chon Thanh to Loc Ninh.\nShenandoah II\nOn 29 September Hay ordered Colonel George E. Newman—commander of the 1st Brigade—to move the 1st Battalion, 2nd Infantry Regiment and the 1/28th Infantry Regiment to the northern portion of Long Nguyen. The next day Colonel Frank E. Blazey, commander of the 3rd Brigade, was ordered to deploy the 2/2nd Infantry and the 2/28th Infantry to the southern half of the area. In the early stages of Shenandoah II U.S. forces only made a few contacts with the VC. On 2 October, an Army of the Republic of Vietnam (ARVN) unit operating east of Highway 13 near Chon Thanh made significant contact with a large VC formation and took heavy casualties. Enemy documents captured by the ARVN indicated they had clashed with a battalion-sized unit from the VC 272nd Regiment sent to attack Chơn Thành to cover the movement of the 271st Regiment into the Long Nguyen area. Early in October the 271st Regiment arrived in Long Nguyen but they could not obtain their much-needed food supplies. The earlier allied search-and-destroy operations had created significant food shortages for VC units in the region.\nTriet then moved his starving soldiers southward toward the Ong Thanh Stream to link up with Rear Service Group 83, but local VC units also lacked adequate food supplies of their own, so the 271st Regiment was forced to wait in the area for the arrival of rice and other essential supplies. Meanwhile, on 4 October 1/2nd Infantry made contact with a company-sized VC formation about  south-west of Chon Thanh, and claimed to have killed 12 enemy soldiers. To pursue the retreating VC formation, Lieutenant colonel Richard E. Cavazos, commander of the 1st Battalion, 18th Infantry Regiment, was instructed to conduct an air-assault into a clearing located about  west of 1/2nd Infantry to block enemy troops. 1/18th Infantry landed unopposed and immediately set up a standard field position with wire entanglements to protect the position. On 6 October the 1/18th Infantry position was subjected to a VC mortar bombardment. Even though the attack caused little damage, Cavazos believed it was part of the VC's final preparations for a major ground attack later that evening.\nAt around 18:00 rain began to fall and the VC started attacking the 1/18th Infantry's position from different directions. Cavazos' men were able to hold their ground with the support of artillery and mortar fire. By midnight the fight was over, and U.S. casualties were five killed and four wounded. Three weeks later, a captured VC soldier from the 2nd Battalion, 271st Regiment revealed that his unit lost 59 soldiers killed and 56 wounded in battle with Cavazos' battalion. On 8 October Hay pulled 1/2nd Infantry back to Phuoc Vinh to serve as the division's reaction force. Lieutenant colonel Terry D. Allen—commander of the 2/28th Infantry—was ordered to depart from Lai Khê with three of his rifle companies (A, B and D) and air-lifted into a site about  northwest of Chon Thanh village and  north-west of 1/18th Infantry. Company C was detached from Allen's 2/28th Infantry to protect the supporting 15th Field Artillery Regiment.\nTwo days later, 1/2nd Infantry was deployed into new blocking positions as VC units were believed to be moving toward the Michelin Rubber Plantation. On 11 October two companies of 1/18th Infantry went on a northward probe and were immediately attacked by the VC. While under heavy fire, Cavazos ordered the lead company to pull back behind a perimeter formed by the second company. As the lead company fell back, artillery and air support were called in to pummel the VC attacking formation. When the battle was over, 21 VC were found dead, while U.S. casualties for the day were one killed and four wounded. Shortly afterward 1/18th Infantry pulled back to Phuoc Vinh for rest and refitting. By mid-October Hay believed the VC 271st Regiment had suffered a major defeat and was ready to withdraw from the Long Nguyen Secret Zone, so he was ready to terminate Shenandoah II. Increased VC activity near the Ong Thanh Stream, where the 1st Brigade made most of its contacts, seemed to indicate otherwise.\nBattle\nOn the morning of 16 October, Allen led Companies B and D, 2/28th Infantry out from their temporary night defensive position () along the Ong Thanh Stream to patrol an area to the southeast, which was covered by thick jungle canopy. After marching for about , the battalion found a fortified VC bunker, so Allen ordered his men to pull back and directed airstrikes against VC positions. When the bombing runs were over, Allen's men entered the camp and a firefight broke out with VC snipers firing down from trees in the surrounding areas. Again, Allen ordered his men to pull back and form a perimeter to protect their wounded soldiers, as artillery strikes were called in against VC bunker positions. The 2nd Battalion re-entered the camp, and they discovered the bodies of 17 VC. Allen's men then moved through the western end of the camp, and another fire-fight broke out with an estimated 60 VC.\nLater that afternoon, Allen decided to break contact and return to base, to avoid fighting a battle that could last until the evening. In the meantime, however, he called in air-strikes to inflict further damage on the base camp of his primary target, the 271st Regiment. That evening, Brigadier general William Coleman and other senior officers of the 1st Infantry Division visited the 2/28th Infantry's camp, where they praised Allen's men for their efforts, and presented First lieutenant Clark Welch—commander of Company D—with a Silver Star for his actions earlier in the day. Allen then decided to launch a full-frontal attack against the 271st Regiment's base camp, to determine if the enemy unit was still there. However, due to the lack of sufficient manpower, Welch suggested that Allen should either call off the assault or get more soldiers on the ground for the operation. Allen dismissed Welch's suggestions, and responded by giving Captain James George—commander of Company A—the responsibility of leading the attack instead of Welch.\nMeanwhile, the 1,200-strong 271st Regiment was joined by 200 soldiers from the C1 Company of Rear Service Group 83, under the command of Captain Nguyễn Văn Lém, and they set up a three-sided ambush and waited for the arrival of a reported U.S. battalion. At around 08:00 on the morning of 17 October, 2/28th Infantry departed from their night defensive position with Company A in the lead followed by the Battalion Command Group, and the tail of the formation was covered by Company D. Company B stayed behind to protect the battalion's base, along with the mortar sections of Alpha and Delta Companies. In accordance with the 1st Brigade's policy, Allen personally led his unit out as part of the Battalion Command Group, although he preferred to supervise actions from a helicopter. For artillery support, Company A was authorized to call upon the 105mm and 155mm howitzers located at Fire Support Bases Caisson V, Caisson III-S and Lorraine III.\nAllen's men marched southward from the base, with the intention of entering the VC base camp from a slightly different direction to the west. Preceded by marching artillery fire, they stopped periodically to conduct cloverleaf patrols to their front, rear and both flanks. At 09:56 the lead element of Company A stumbled upon a northeast-southwest trail, which appeared to have been used within the last hour. The 1st Platoon leader then requested and received permission to make cloverleaf patrols to the east and west of the trail. Almost immediately, the 1st Platoon sighted a VC soldier while scouting west of the trail and another group of VC soon appeared. George then ordered the 1st Platoon to set up a hasty ambush across the trail, but by the time they were in position the VC had disappeared and everything was quiet. About 10–15 minutes later, the 1st Platoon leader reported that trees were moving, in addition to the sound of weapons clicking and the rattle of ammunition.\nIn response, George ordered the 1st Platoon to reinforce their ambush position. While that was happening Company A's right flank, which was covered by the 2nd Platoon, began to receive sporadic fire. The rest of the 1st Platoon was then pinned down when the VC, from within concealed bunker positions, fired on them using captured M60 machine-guns. The VC steadily increased their fire which came in the form of various small arms, .50 caliber and 12.7mm machine guns. Unable to communicate with the 1st and 2nd Platoons, George moved forward with the 3rd Platoon only to find his lead platoons held in their positions by enemy fire. A claymore mine then exploded in front of Company A's command element, killing the radio operator and severely wounding both George and his forward artillery observer. At around 10:40 gunfire had died down, but Company A was virtually destroyed during 30 minutes of fighting, with the company commander wounded and the leaders of 1st and 2nd Platoons both killed.\nTo break contact with the VC units which fired on Company A from the western flank, First sergeant Jose Valdez quickly organized an assembly area on the eastern side to round up the survivors. Shortly after the assembly area was established George, who was severely wounded from the Claymore explosion, turned his company over to Valdez. Allen then ordered Valdez to lead the survivors of Company A northward to join the rest of the battalion. The survivors, mostly from the 2nd and 3rd Platoons of Company A, were then ordered to withdraw through a perimeter formed by Company D. As the surviving elements of Company A pulled back, Company D began to receive sporadic fire from their southern flank, so Allen ordered his command group to remain in place near a prominent anthill with the 1st and 2nd Platoons of Company D. The 3rd Platoon, on the other hand, was instructed to move forward to assist the wounded men from Company A.\nAs VC fire increased in intensity, the soldiers of Company D picked up the distinctive sound of an M60 machine-gun firing from the southern flank. Allen assumed that Company A was approaching his perimeter, so he ordered them to cease-fire because he feared his rifle companies were firing on each other. However, the order was also passed down along the formation of Company D, which enabled the 271st Regiment to gain fire superiority. At around 11:35, Triet unleashed his 2nd Battalion which was placed in reserve during the battle, and they attacked Welch's Company D from three different directions. During that time Allen tried to request artillery support, but that had become impossible due to the close proximity between U.S. and VC soldiers. In a scene that had characterized the destruction of Company A earlier, both Allen and Welch were wounded in battle as VC snipers fired down from the trees. Nonetheless, just before midday, Allen instructed Company D to begin a northward march toward the battalion's base, and Company B to move forward to cover the withdrawal.\nThe withdrawal quickly descended into a scene of chaos, as U.S. soldiers scrambled to avoid heavy enemy fire. During the last moments of the battle, Allen was struck in the head by machine-gun fire which grazed his helmet, and was finally killed when another burst of machine-gun fire hit him. At around 12:20, Newman flew into Ong Thanh to assume command of the battalion, while Coleman took control of the 1st Brigade. Meanwhile, Company A had linked up with Company B, which had taken up positions about  to the south of the battalion's night defensive position with the task of assisting the wounded. At around 14:00 that afternoon, Company C, 2/28th Infantry was airlifted into Ong Thanh from FSB Caisson V, as Company B moved into the battle area to help evacuate the wounded. Coleman, who was coordinating the evacuation of U.S. casualties from a helicopter, decided to assemble the bodies of the dead in an area and protect it with artillery fire. By that stage, however, Triet's 271st Regiment had withdrawn from the battlefield, and medevac flights were only challenged by sporadic sniper fire.\nAt around midday, Triet had already ordered his troops to disengage from the battle without overrunning the remaining Americans caught in his ambush. His men were tired and hungry and he was behind schedule in his movement toward his next assignment. Moreover, he feared that American air power and artillery would begin to inflict heavy casualties on his unit.\nAftermath\nThe battle at Ong Thanh was a costly affair for the 2/28th Infantry. During two hours of fighting the battalion lost 64 men killed, including Allen and every member of the Battalion Command Group, as well as 75 wounded and two missing. For their efforts in the battle, 13 American soldiers were awarded the Silver Star, while Allen and Welch received the Distinguished Service Cross. Forward Observer Second lieutenant Harold B. Durham, who was attached to the battalion on the day from the 15th Field Artillery Regiment, was posthumously awarded the Medal of Honor for his heroic actions. The soldiers of Companies A and D, 2/28th Infantry were sent back to their Base Camp at Lai Khe to adjust to the losses they had suffered, and to be kept away from enemy activity.\nDespite the losses that had been inflicted on the 2nd Battalion by the VC, the U.S. military told the media that the fight at Ong Thanh had resulted in a major American victory. Hay initially portrayed Ong Thanh as an American victory and cited 101 enemy dead in the battle. However, American veterans who survived the ordeals of the battle were adamant they were ambushed and defeated by the VC 271st Regiment. The estimate of 101 enemy dead officially provided by the U.S. military was likely much inflated to emphasize the scale of the 'American victory'. For retired U.S. Army Brigadier general James E. Shelton, who was then a major and served as an Operations Officer with the 2/28th Infantry, the lack of reliable intelligence and overconfidence on the part of Allen as the battalion commander, were some of the factors that led to the disastrous outcome in the Ong Thanh battle. Furthermore, the soldiers under Allen's command lacked fighting experience, whereas the VC of the 9th Division were tough and experienced light infantry. The 271st Regiment, after their victory at Ong Thanh, withdrew back towards their base area near the Cambodian border.\nMeanwhile, the rest of the VC 9th Division was planning for a major attack on Loc Ninh, with the objective of capturing the district town and the Special Forces Camp. To accomplish their goals the VC deployed the 272nd and 273rd Regiments, reinforced with two battalions from the 165th Regiment and the PAVN 84th Artillery Regiment. During the days before the battle, U.S. military intelligence had noticed the build-up of VC units around Loc Ninh. Hay, in response, planned to insert four battalions of the 1st Infantry Division and position them around Loc Ninh, thereby trapping the VC inside the town. On the evening of 28 October, the 272nd Regiment marched into position from the northeast, and the 273rd Regiment from west. At 01:15 on 29 October, the 273rd Regiment began assaulting the Loc Ninh Special Forces Camp, but they were quickly repelled by U.S.-led Special Forces. At around 06:30 the remaining elements of Companies B and C, 2/28th Infantry Regiment, were airlifted onto the Loc Ninh airfield, to set up a firebase at the field's south-western end.\nSee also\n* Don Holleder, an All-American football player who died in the battle\nReferences\nExternal links\n*\n*\n*"
    }
  ]
}