{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Mâcon (1814)\n\n| map_type          = France\n| map_relief        = 1\n| map_size          = 300\n| result            = Austrian victory\n| territory         =\n| combatant1        =\n| combatant2        =  France\n| commander1        =  Prince Frederick of Hesse-Homburg Frederick Bianchi Prince Philipp of Hesse-Homburg\n| commander2        =  Pierre Augereau Louis Musnier\n| strength1         = 8,000–16,550\n| strength2         = 5,000–6,000\n| casualties1       = 881–900\n| casualties2       = 683–1,300, 2 guns\n}}\n|  zoom = 5\n|   float = right\n|    nolabels = 1\n|     width = 304\n|     height = 160\n| title = War of the Sixth Coalition:Campaign in north-east France\n| caption =\n| shapeD = n-circle\n| shape-colorD = navy\n| shape-outlineD = white\n| label-colorD = navy\n| label-sizeD = 12\n| label-posD = left\n| label-offset-xD =\n| label-offset-yD =\n| label1 = Bar-sur-Aube\n| mark-coord1 =\n| mark-title1 = First Battle of Bar-sur-Aube on 24 January 1814Second Battle of Bar-sur-Aubeon 27 February 1814\n| label-pos1 = right\n| label2 =\n| mark-coord2 =\n| mark-title2 = Battle of Brienne on 29 January 1814\n| label-pos2 = bottom\n| label-offset-y2 = -6\n| shape-color2 = maroon\n| label-color2 = maroon\n| label3 =\n| mark-coord3 =\n| mark-title3 = Battle of La Rothière on 1 February 1814\n| label-pos3 = right\n| shape-color3 = maroon\n| label-color3 = maroon\n| label4 =\n| mark-coord4 =\n| mark-title4 = Battle of Lesmont on 2 February 1814\n| label-pos4 = right\n| label5 =\n| mark-coord5 =\n| mark-title5 = Battle of Champaubert on 10 February 1814\n| label-pos5 = right\n| shape-color5 = maroon\n| label-color5 = maroon\n| label6 =\n| mark-coord6 =\n| mark-title6 = Battle of Montmirail on 11 February 1814\n| label-offset-y6 = 1\n| shape-color6 = maroon\n| label-color6 = maroon\n| label7 =\n| mark-coord7 =\n| mark-title7 = Battle of Château-Thierry (1814) on 12 February 1814\n| shape-color7 = maroon\n| label-color7 = maroon\n| label8 =\n| mark-coord8 =\n| mark-title8 = Battle of Vauchamps on 14 February 1814\n| label-pos8 = bottom\n| shape-color8 = maroon\n| label-color8 = maroon\n| label9 =\n| mark-coord9 =\n| mark-title9 = Battle of Mormant on 17 February 1814\n| label-offset-y9 = 1\n| shape-color9 = maroon\n| label-color9 = maroon\n| label10 =\n| mark-coord10 =\n| mark-title10 = Battle of Montereau on 18 February 1814\n| label-offset-y10 = 1\n| shape-color10 = maroon\n| label-color10 = maroon\n| label11 =\n| mark-coord11 =\n| mark-title11 = Battle of Gué-à-Tresmes on 28 February 1814\n| label-pos11 = top\n| label12 =\n| mark-coord12 =\n| mark-title12 = Battle of Saint-Julien (1814) on 1 March 1814\n| label-pos12 = right\n| label13 =\n| mark-coord13 =\n| mark-title13 = Battle of Laubressel on 3 March 1814\n| label-pos13 = bottom\n| label14 =\n| mark-coord14 =\n| mark-title14 = Battle of Craonne on 7 March 1814\n| label-pos14 = right\n| shape-color14 = maroon\n| label-color14 = maroon\n| label15 =\n| mark-coord15 =\n| mark-title15 = Battle of Laon from 9 to 10 March 1814\n| shape-color15 = maroon\n| label-color15 = maroon\n| label16 =\n| mark-coord16 =\n| mark-title16 = Battle of Mâcon (1814) on 11 March 1814\n| label-color16 = black\n| shape-color16 = black\n| label17 =\n| mark-coord17 =\n| mark-title17 = Battle of Reims (1814) from 12 to 13 March 1814\n| label-pos17 = right\n| shape-color17 = maroon\n| label-color17 = maroon\n| label18 =\n| mark-coord18 =\n| mark-title18 = Battle of Limonest on 20 March 1814\n| label19 =\n| mark-coord19 =\n| mark-title19 = Battle of Arcis-sur-Aube from 20 to 21 March 1814\n| shape-color19 = maroon\n| label-color19 = maroon\n| label20 =\n| mark-coord20 =\n| mark-title20 = Battle of Fère-Champenoise on 25 March 1814\n| label-pos20 = right\n| label21 =\n| mark-coord21 =\n| mark-title21 = Battle of Saint-Dizier on 26 March 1814\n| label-pos21 = right\n| shape-color21 = maroon\n| label-color21 = maroon\n| label22 = Paris\n| mark-coord22 =\n| mark-title22 = Battle of Paris (1814) from 30 to 31 March 1814\n}}\nThe Battle of Mâcon (11 March 1814) saw a Imperial French division under Louis François Félix Musnier attack an Austrian corps led by Frederick Bianchi. The French enjoyed initial success, but their numerical inferiority led to their defeat in this War of the Sixth Coalition engagement. This was followed by the Battle of Saint-Georges (18 March) in which the French were again forced to retreat by the Allied Army of the South commanded by General der Kavallerie Prince Frederick of Hesse-Homburg.\nThe presence of Marshal Pierre Augereau's French army at Lyon threatened the supply line of the main Coalition armies that were battling against French Emperor Napoleon east of Paris. To protect their communications, the Coalition allies committed a sizable army to capture Lyon and extinguish the threat. The immense Allied numerical superiority practically assured victory over the French in this campaign.\nMâcon is located  north of Lyon at the intersection of routes A15, A21, and N62.\nBackground\nStrategic situation\nEmperor Napoleon escaped to France with only 60,000–70,000 soldiers after his disastrous defeat at the Battle of Leipzig. He left behind almost 100,000 French troops manning German fortresses who would be unable to defend France. At the end of 1813, Napoleon spread his scanty forces in a thin cordon from the Netherlands to the upper Rhine River. On the extreme right flank were only 1,600 men at Lyon. Arrayed against France were the Army of Bohemia under Field Marshal Karl Philipp, Prince of Schwarzenberg on the upper Rhine and the Army of Silesia under Field Marshal Gebhard Leberecht von Blücher on the middle Rhine. Farther north, Lieutenant Generals Friedrich Wilhelm Freiherr von Bülow and Ferdinand von Wintzingerode were poised to invade the Netherlands. The Army of Bohemia detached 12,000 men under Feldmarschall-Leutnant (FML) Ferdinand, Graf Bubna von Littitz to occupy Switzerland.\nThe Army of Bohemia crossed the Rhine on 20 December 1813, the Army of Silesia crossed on 1 January 1814, and Wintzingerode's corps crossed on 6 January. At first, there was little opposition to the Allied advance. The Army of Bohemia counted 156,868 soldiers, the Army of Silesia numbered 77,100 men, Wintzingerode's corps controlled 36,000 troops, and Bülow had 30,000 men. On 30 December 1813, Bubna scored a coup when Geneva's French commander had a stroke; the place surrendered at once. Bubna's troops advanced to the outskirts of Lyon on 18 January 1814, but its French commander General of Division (GD) Louis François Félix Musnier managed to bluff the Austrian general into withdrawing the following day. Soon, Bubna was in retreat toward Geneva, giving up much of the territory he seized so easily.\nFrench offensive\nNapoleon assigned Marshal Augereau to lead the army that was forming at Lyon. After being steadily reinforced, Augereau's army numbered 17,000 soldiers against Bubna's 12,000 men. On 17 February 1814, Augereau launched a counteroffensive that had one French division moving north to recapture Mâcon, a second division marching northeast to Bourg-en-Bresse, and a third division under GD Jean Gabriel Marchand advancing against Chambéry. On 1 March, Marchand attacked Bubna's troops in the Battle of Saint-Julien near Geneva, but was repulsed. Nevertheless, Bubna pulled back behind the fortifications of Geneva.\nOn 1 January 1814, Schwarzenberg assigned Prince Frederick of Hesse-Homburg to command the Austrian 2nd Corps and FML Moritz Liechtenstein's 2nd Light Division. Out of an abundance of caution, Schwarzenberg wanted his southern flank secured against French interference. Accordingly, FML Alois Liechtenstein's division blockaded Besançon and FML Maximilian von Wimpffen's division blockaded Auxonne. Hesse-Homburg established his headquarters at Dijon. On 20 February, Schwarzenberg received a disturbing message from Hesse-Homburg about Augereau's counteroffensive. Sensitive about his supply line, Schwarzenberg ordered Bianchi to take his entire 1st Corps and force march to Dijon. This reduced the Army of Bohemia facing Napoleon to roughly 90,000 men.\nCoalition reaction\nMoving south, Bianchi's 1st Corps advance guard reached Chalon-sur-Saône on 4 March 1814. A 2nd Corps column under Wimpffen marched to Villers-Robert. A third column led by FML Prince Philipp of Hesse-Homburg arrived in Dole. Prince Philipp commanded the 6th German Confederation Corps which was composed of one Austrian division and one Hessian division under Lieutenant General Prince Emil of Hesse. Augereau hoped to defeat Alois Liechtenstein's division at Besançon. On 5 March, Wimpffen seized Poligny and there was a clash at Louhans. Augereau suddenly realized that his forces might be cut off from Lyon by an Austrian drive south from Chalon-sur-Saône. He ordered the French to retreat to Lyon and his forces reached there by 9 March. Meanwhile, Marchand's division faced Bubna's forces near Geneva.\nBattle\nCavalry clash\nThe Allied advance was slowed when Bianchi waited a few days in Chalon-sur-Saône for the other columns to come abreast of his position. Emboldened by the apparent lethargy of his opponents, Augereau decided to mount a counterattack. The French marshal received intelligence that only 1,500 Austrians occupied Mâcon, so he ordered Musnier to attack that place with his division. GD Martial Bardet was directed to demonstrate against Saint-Laurent-sur-Saône on the east bank. In fact, Augereau's information was out of date and Bianchi held Mâcon with a powerful force. Bianchi detached a division under FML Ignaz Count Hardegg to the east bank of the Saône, but the bulk of the 1st Corps was on the west bank facing Musnier.\nOn 11 March 1814, the 12th Hussar Regiment at the front of Musnier's division reached Saint-Georges-de-Reneins, driving away an Austrian patrol. Soon the French encountered 12 Coalition cavalry squadrons in march column led by Generalmajor (GM) Georg von Scheither. The 12th Hussars charged and drove back the Allied cavalry, capturing two artillery pieces and wounding Scheither. The Vincent Chevau-léger Regiment Nr. 4 and Westphalian Hussar Regiment rallied and counterattacked. The 12th Hussars were aided by French skirmishers who picked off so many Allied horsemen that they retreated about 11:00 am. Alerted by the fighting, Bianchi began deploying his forces south of Mâcon between Charnay-lès-Mâcon and Saint-Clément.\nInfantry action\n(see left column).]]\nMusnier found that he was facing a much stronger adversary than he had been informed. Nevertheless, he deployed his 6,000 men and pressed forward. Marching along the main road were the hussars and artillery, with the 20th Line Infantry Regiment on the right and the 67th Line on the left. Musnier sent General of Brigade (GB) Louis Ordonneau on a flanking move toward the Chaintré heights on the left with the 32nd Line and the 2nd Toulon National Guard. Musnier hoped that Bardet's effort on the east bank would divert his opponents, but the feint attack did not occur.\nIn the Austrian center, 16 guns were posted and 4 more guns were placed in Saint-Clément guarded by the Simbschen Infantry Regiment Nr. 43. FML Prince Friedrich Wied-Runkel deployed his two brigades at Cluny and Charollois. The brigades of GM Anton von Hirsch and GM Karl von Quallenberg defended Les Carteronnes. Charnay-lès-Mâcon was held by one battalion from the Hiller Infantry Regiment Nr. 2, two squadrons of the Würzburg Chevau-léger Regiment, and 3 guns. Vinzelles and Varennes-lès-Mâcon were defended by GM Eugen von Haugwitz's brigade. The Iarossy and Oklopsia Grenadier Battalions were held in reserve behind Saint-Clément. GM Ferdinand Kuttalek's cuirassier brigade was kept to the rear of Mâcon.\nAt 2:00 pm, Musnier drove the brigades of Haugwitz and Scheither out of Varennes. The 20th and 67th Line managed to capture Saint-Clément but were stopped from advancing any farther. On the French left flank, Ordonneau's brigade attacked Vinzelles and at first was repulsed by Quallenberg's brigade. However, Ordonneau's troops finally seized Vinzelles and advanced toward Charnay-lès-Mâcon at 4:00 pm. At this point, Bianchi ordered a general attack. On the French right flank, Musnier's men were running out of ammunition and 5 of their 9 artillery pieces were disabled. Musnier ordered his division to retreat, and the French got away in good order, followed by some Austrian cavalry.\nStrengths and losses\nGaston Bodart listed French losses as 1,300 men and 2 guns out of a total of 5,000 soldiers. Bodart gave Austrian casualties as 900 out of 8,000 men engaged. Digby Smith nearly echoed Bodart by stating the French took 6,000 men into battle and suffered 800 killed and wounded, plus 500 men and 2 guns captured. Smith gave Allied losses as 450 killed and wounded, plus 450 captured out of 8,000 troops engaged. George Nafziger listed the losses cited by various historians. Koch asserted that the French lost 93 killed, 230 wounded, and 360 men and 2 guns captured. Sporschil stated that the Austrians lost 85 dead and 796 wounded and captured. Nafziger listed the strength of Scheither's brigade as 3,235 men, Kuttalek's cuirassiers as 450 troopers, GM Friedrich von Fürstenwerther's grenadier brigade as 1,360 men, Wied-Runkel's division as 6,638 strong, and Bianchi's division as 4,867 men (but omitted Quallenberg's brigade). These strengths sum up to 16,550 soldiers. Note that the brigades of Scheither, Kuttalek, and Fürstenwerther belonged to FML Ignaz Freiherr von Lederer's division.\nAftermath\nPause\nOn 12 March 1814, Bianchi consolidated his position at Macon rather than launching an immediate pursuit. In this, he was probably supported by the Austrian army commander Prince Frederick of Hesse-Homburg. At a council of war on 13 March, Prince Frederick and his generals decided to move Wimpffen's column and Prince Philipp's column to the west bank of the Saône. Only Hardegg and a brigade led by GM Prince Ferdinand of Saxe-Coburg and Gotha were directed to operate on the east bank. The main advance would be via the west bank. Two battalions and an artillery battery were left to garrison Mâcon. Augereau ordered Musnier to establish a defensive position at Saint-Georges-de-Reneins. Because it was badly outnumbered by Wimpffen's and Hardegg's forces, Bardet's 4,000-man division abandoned Bourg-en-Bresse and fell back to Meximieux and Marlieux, northeast of Lyon. Augereau posted GB Claude Pannetier's division at Saint-Georges-de-Reneins with an outpost at Belleville-en-Beaujolais.\nBattle of Saint-Georges\nOn 17 March 1814, Prince Frederick of Hesse-Homburg's Army of the South began moving south in two columns. Wimpffen's left column advanced on the main road near the Saône while Bianchi's 1st Corps, the right column, moved through Cercié farther west. Prince Philipp's column formed the Reserve, formerly known as the 6th German Corps. Altogether, Prince Frederick commanded 47,000 infantry, 5,400 cavalry, and 112 guns, while Augereau could only muster 12,089 infantry, 1,725 cavalry, and 29 guns. By evening of 17 March, Wimpffen's advance guard was at Belleville-en-Beaujolais and Scheither's brigade was at Odenas.\nPrince Philipp, who was apparently in tactical command, ordered an attack on the French lines on the morning on 18 March. Pannetier's division held Saint-Georges near the Saône while Musnier's division was farther west. The French defended a line extending from Saint-Georges to Layè to Le Chambély. GM Wilhelm von Gall's Hessian brigade successfully stormed Saint-Georges but scattered in pursuit of its French defenders. The disordered Hessians were ridden down by the 4th Hussar Regiment and abandoned Saint-George. Wimpffen committed Haugwitz's brigade to recapture Saint-Georges, but it also was driven back and its commander badly wounded. Wimpffen's chief of staff, GM Markus von Csollich replaced Haugwitz and rallied the Austrian brigade.\nOn the French left flank, Ordonneau's brigade was pressed back to Marsangue and Layè, but then held firm. Not wanting to mount a frontal assault, Bianchi sent Wied-Runkel's division to outflank the French. Ordonneau was finally driven back, but he conducted an orderly retreat, helped by the 12th Hussar and 13th Cuirassier Regiments. Augereau finally ordered a general retreat toward Lyon. Lederer tried to turn it into a rout by ordering the Austrian advance guards and cavalry forward, but the pursuit was not pressed. At Saint-Georges the Austrians sustained losses of 23 officers and 1,386 rank and file, while the French reported 530 casualties. The next action was the Battle of Limonest on 20 March.\nNotes\nReferences\n*\n*\n*\n*\n*\nExternal links\n*"
    }
  ]
}