{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Bloody Gulch__disambig_1\n\n| combatant2        =\n| commander1        =  Maxwell D. Taylor Howard R. Johnson John H. Michaelis Robert F. Sink\n| commander2        =  Friedrich von der Heydte\n| strength1         = 3 parachute infantry regiments60 tanks (2nd Armored Division)\n| strength2         = 1 parachute infantry battalion1 Waffen SS motorized division 12 tanks\n| casualties1       = 32 killed73 wounded4 tanks destroyed\n| casualties2       = 43 killed89 wounded2 tanks destroyed\n}}\nThe Battle of Bloody Gulch took place around the Manoir de Donville or Hill 30 (U.S. Army designation), about  southwest of Carentan in Normandy, France, on June 13, 1944.\nIt involved elements of the German 17th SS Panzergrenadier Division and 6th Fallschirmjäger Regiment, and the American 501st, 502nd, and 506th Parachute Infantry Regiments (PIR) of the 101st Airborne Division, reinforced by elements of the 2nd Armored Division and the 29th Infantry Division.\nDuring the battle, the manor house of Manoir de Donville was the headquarters of the German forces. American soldiers nicknamed the road running past the manor \"Bloody Gulch\", after a place mentioned in the popular western movie Destry Rides Again.\nBattle\nWhen the 101st Airborne entered the town of Carentan on June 12, 1944, after heavy fighting on the two previous days, they met relatively light resistance. The bulk of the surviving German defenders (from the 6th Fallschirmjäger Regiment) had withdrawn to the southwest the previous night after a heavy Allied naval and artillery bombardment. Both sides realized the importance of the town: for the Americans, it was a link between Utah Beach and Omaha Beach and would provide a base for further attacks deeper into German-occupied France. For the Germans, recapturing Carentan would be the first step towards driving a wedge between the two American landing beaches, severely disrupting and possibly even repulsing the Allied invasion.\nThe remnants of the 6th Fallschirmjäger resupplied and were reinforced by assault guns and panzergrenadiers of the 17th SS Panzergrenadier Division on the night of June 12–13. The combined force counterattacked northeast towards Carentan at dawn on June 13, just as the 506th and 501st PIR were attacking southwest to enlarge the American defensive perimeter around the town. The 506th took the brunt of the attack, and by 10:30&nbsp;a.m., the outnumbered and outgunned paratroopers were pushed almost back to the outskirts of the town.\nUnder intense German fire, F Company of the 506th's left flank fell back to the next hedgerow under the company commander’s orders, which had not been cleared with battalion. This exposed D Company's right flank. That company also fell back, leaving E Company all alone. Cpt. Thomas P. Mulvey, the commanding officer of F Company, was relieved on the spot by the battalion commander.\nWhen a German tank attempted to penetrate the left flank, two E Company soldiers (according to Band of Brothers, they were Lt. Harry Welsh and Pvt. McGrath) destroyed it with a bazooka. Meanwhile, battalion headquarters stopped the retreat of D and F companies, pushing them forward  to cover the left flank. The 2nd Battalion of the 502nd PIR took up positions to the right of the 506th, but by 1&nbsp;p.m. they too had suffered many casualties, and the German attack was on the verge of breaking through their defenses.\nAt 4:30&nbsp;p.m., sixty tanks from Combat Command A of the 2nd Armored Division, accompanied by infantry of the 29th Division, counterattacked southwest from Carentan, inflicting severe casualties on the Germans and forcing them to withdraw with the loss of four tanks. The American victory led to the linkup of forces from Utah and Omaha Beaches, creating a secure lodgement area for further American operations.\nThe capture of Carentan was likely made possible by elements of the 507th Parachute Infantry Regiment that had been mis-dropped southeast of Carentan. During the Battle of Graignes, the 507th stopped the advance of the 17th SS Panzergrenadier Division, which may otherwise have reached Carentan before the 101st Airborne Division.\nIn popular culture\nBand of Brothers, an HBO miniseries, features the battle in its third episode, \"Carentan\", portraying the 506th PIR's part in the battle.\nThe battle is featured in the video game Call to Arms - Gates of Hell: Ostfront as a mission from the Airborne DLC.\nThe battle was also featured in the first two Brothers in Arms video games.\nThe original Company of Heroes game also featured this battle in the Normandy campaign.\nReferences\nFurther reading\n*\n*\nExternal links\n* [http://www.101airborneww2.com/bandofbrothers4.html \"The Battle of Bloody Gulch\" (near the bottom of the page) – www.101airborneww2.com]"
    }
  ]
}