{
  "content": [
    {
      "type": "text",
      "text": "# Battlelines\n\nBattlelines is a 2009 book by Tony Abbott. The book was published while Abbott was in opposition, four years before he was elected as Prime Minister of Australia in 2013.\nThe book is partly autobiographical and discusses Abbott's experiences in the Liberal Party of Australia and in the Howard government. The book was written during Abbott's time as a Shadow Minister following the 2007 defeat of the Howard government and prior to Abbott's 2009 Liberal Party leadership election as Leader of the Opposition in the Australian Parliament.\nBackground and synopsis\nWritten in the aftermath of the defeat of the Howard government, in which Abbott had served as a senior Cabinet Minister, the book is partly an autobiography, partly an insider critique and examination of the record of the Howard government and partly a manifesto on future directions for the Liberal Party, which had entered opposition after 11 years in office. It was published during the tenure of Malcolm Turnbull as leader of the opposition.\nIn the book, Abbott said that in certain aspects, the Australian Federation was \"dysfunctional\" and in need of repair. He recommended the establishment of local hospital and school boards to manage health and education; and discussed family law reform; multiculturalism, the monarchy in Australia, climate change; and international relations. The book received a favourable review from former Labor Party speech writer Bob Ellis, and The Australian newspaper described it as \"read almost universally as Abbott's intellectual application for the party's leadership after the Turnbull experiment\".\nIn a review of the book, professor of politics Robert Manne pointed out numerous self-contradictions, and summarized it as a \"hallelujah chorus in praise of his former leader\" John Howard and a \"hodgepodge of half-baked thoughts and determinedly unresolved contradictions\".\nReferences\nExternal links\n*[https://www.youtube.com/watch?v=OooHdU0wa-s Abbott discusses Battlines on ABC Radio]\n*[https://web.archive.org/web/20111112112800/http://www.abc.net.au/tv/bigideas/stories/2009/08/07/2649342.htm Abbott on ABC's Big Ideas in August 2009]"
    }
  ]
}