{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Koppam\n\n|place=Koppam\n|result = Chola victory\n|combatant1 = Western Chalukyas\n|combatant2 = Chola Empire\n|commander1 = Someshvara I\n| commander2 = Rajadhiraja CholaRajendra Chola II\n| strength1=Unknown\n| strength2 = Unknown\n|casualties1=Jayasimha, Pulakesin, Dasapanman, Nanni-Nulumban\n|casualties2=Rajadhiraja Chola\n}}\nThe Battle of Koppam was fought between the Medieval Chola kings Rajadhiraja Chola I and Rajendra Chola II with the Chalukya king Someshvara I in 1054, or in 1052 according to Sen. Though the Cholas were successful in the battle, the king and supreme commander, Rajadhiraja I lost his life in the battlefield and was succeeded to the throne by his younger brother, Rajendra Chola II.\nSources\nThe main historic sources of the battle are an inscription dated to 1054 and Rajendra Chola's Manimangalam record of 1055.\n}}\nBackground\nSince his accession to the throne, Rajadhiraja Chola desired to subjugate the Chalukyas who ruled over portions of Northern Karnataka and the southern part of present-day Maharashtra and incorporate their territories into the Chola Empire.  His first invasion of the Chalukya kingdom in 1047-48 had failed. In 1052, he led a second expedition into the Chalukya territories which met the Chalukya army and fought a battle at place mentioned as \"Koppam\".\nBattle\nIn 1052, Rajadhiraja led a huge army northward and plundered the province of Rattamandalam. His army was followed in the rear by forces under Rajadhiraja's brother and heir-apparent, Rajendra II. The Chalukya king Someshvara I prepared to meet his enemy and a pitched battle was fought at Koppam. The Chola troops were holding the upper hand when Chalukyan archers shot Rajadhiraja mortally wounding him. The Chola troops panicked and began to retreat when Rajendra II, commanding the reserve forces, personally took command of the army and rallying the Chola forces together, inflicted heavy losses on the Chalukya army forcing Someshvara I to flee. Chola sources record that the elephants, horses and camels of the Chalukyas, along with a huge booty and the queens of Someshvara I fell into the hands of the Cholas. Rajendra II, reportedly, crowned himself on the battlefield and erected a victory pillar at Kolhapur before returning to his country.\nIdentification of Koppam\nThe Manimangalam inscription state that Koppam was a city on \"the Great River\". Fleet has identified it with Khidrapur, 30 miles south-east of Kolhapur, thereby assuming the \"Great River\" to be the Krishna, while other historians have identified Koppam with a place near Maski.\nBibliography\n*"
    }
  ]
}