{
  "content": [
    {
      "type": "text",
      "text": "# Battle Creek massacre__disambig_1\n\n| date = March 5, 1849\n| fatalities = 4\n| injuries = several injuries from being struck by thrown stones\n| perpetrators = 35 Mormon militiamen, ordered to carry out the attack by Brigham Young\n| weapons = Guns, stones\n| numparts =\n| dfens =\n| motive = Retaliation for reported cattle theft\n| accused =\n| convicted =\n| verdict =\n| convictions =\n| charges =\n| litigation =\n| website =\n| module =\n}}\nPleasant Grove City Park Monument \"in commemoration of Utah's first Indian battle...\"\nThe Battle Creek massacre was a lynching of a Timpanogos group on March 5, 1849, by a group of 35 Mormon settlers at Battle Creek Canyon near modern Pleasant Grove, Utah. Four were killed. It was the first violent engagement between the settlers who had begun coming to the area two years before, and was in response to reported cattle theft by the group. The attacked group (led by Kone Roman Nose) was outnumbered, outgunned, and had little defense against the militia that crept in and surrounded their camp before dawn. The massacre had been ordered by Brigham Young, the Utah territory governor and president of the Church of Jesus Christ of Latter-day Saints (LDS Church). The formation of the Mormon settlement of Utah Valley soon followed the attack at Battle Creek. One of the young survivors from the group of 17 children, women, and men who had been attacked grew up to be Antonga Black Hawk, a Timpanogos leader in the Black Hawk War (1865–1872).\nBackground\nAround February 1849, Dimick B. Huntington spoke with Timpanogo leader Little Chief about some of the settlers' missing cattle. Little Chief said that Roman Nose and Blue Shirt were great thieves who had decided to live off of the settlers' cattle all winter. Little Chief said that the Mormons should kill these renegades, perhaps out of fear that his tribe would be blamed and killed for the missing cattle. On March 1 Captain John Scott took fifty militiamen into Utah Valley to investigate the theft of horses from Brigham Young's herd. They were under orders \"to take such measures as would put a final end to their [Indian] depredations in future.\" They camped in the snow the first night, near Little Cottonwood Canyon, where a rider brought word that the horses had not actually been stolen. Before morning they received orders from Salt Lake City \"stating that as the horses were not stolen ... we need not spend any more time in search of them but to proceed with the Indians for killing cattle as had been directed, so that the nature of our expedition was not in the least changed.\"\nOn March 2 the men continued southward to Willow Creek (later Draper, Utah) and unanimously agreed to kill a cow from a cattle herd they came upon. The company then continued on to the Jordan River (near the border of modern Salt Lake and Utah counties) where they camped. That day they learned again that the stolen horses had returned to Young's herd. It was the third time the company had received word that the Indians had not stolen Young's horses, but they were directed to continue the mission to deal with the stolen/killed cattle issue.\n\"The first battle between Indians and the Utah Pioneers occurred ... between the Deseret Militia and the Indians...\"\nOn March 3, Scott's men made their way down the Provo River and asked Little Chief and his camp about where the renegades were. Little Chief's tribe was understandably worried about the fifty armed men, and Little Chief agreed to show Scott where the renegades were. Little Chief's two sons guided Scott's men to the renegade's camp near Battle Creek Canyon.  They prepared for an ambush to be carried out at dawn.\nConfrontation\nThe company divided into four parties, surrounding the encampment. Before gunfire began, there was a verbal exchange with the Indians telling the Mormons to go away and the Mormons telling the Indians to surrender. Gunfire began from the militia, immediately killing the Timpanogo leader. The women and children fled to the stream, where they remained in the cold water during the fighting. The militiamen threw rocks into the brush to coax them out.\nPleasant Grove Kiwanis Park Monument erected at the site stating, \"...in memory of the first armed engagement between the Mormon Pioneers and the Native Americans that inhabited Utah Valley...\"\nThe militiamen started a fire to warn the women and children. One of the young women who was spared pleaded with Huntington to save her brother who was still in the fray. Huntington consented, and she brought her young teenaged brother out of the willows. The boy was initially defiant, but Huntington threatened that if the boy did not surrender their one gun, he would kill him. The boy retrieved the gun from his kinsmen and surrendered it. Shortly thereafter, the three remaining Timpanogo men fled. However, the militia pursued and killed all of the men.\nHearing the reports of gunfire, Little Chief and his men rode to the valley. Upon reaching the scene, he cursed the militiamen for the slaughter. Little Chief warned the settlers that the boy would later kill a white man for revenge.\nAftermath\nMost accounts say four Native American men were killed, but Oliver B. Huntington stated there were at least seven killed. The surviving women and children joined the militia in their journey back to Salt Lake City. Several settled in the area, but many eventually returned to their people.\nOn March 10, Brigham Young called for 30 families to leave for the Utah Valley and settle the area. The settlement near the site of the March 1849 attack was for years called Battle Creek, until sometime later when the Mormons living there agreed to change the name to Pleasant Grove.\nYears later, a mountain man named Joshua Terry, who had married a Native American woman, told writer and Pleasant Grove native Howard R. Driggs that the Ute boy that was captured grew up to become Ute war chief Antonga Black Hawk. Following the Black Hawk War, Black Hawk confided in Terry that he could never understand why the white men had shot down his people. It put bitterness in his heart; and though he lived for some time with the white people, his mind had been set on avenging the wrong.\nOld Elk and Stick-in-the-Head, leaders of local Timpanogos tribes, watched the settlers \"relentlessly shoot down\" the Utes. This contributed to their later mistrust of the settlers during the events preceding the Battle at Fort Utah.\nSee also\n*Act for the relief of Indian Slaves and Prisoners\n*Aiken Massacre\n*Circleville Massacre\n*Native American people and Mormonism\n*Nephi massacre\n*Provo River massacre\nReferences\nFurther reading\n* Diary of Oliver B. Huntington, 1847–1900, Vol. 2, L. Tom Perry Special Collections Library, Brigham Young University, Provo, Utah, pages 47–55 & 331–341\n* Dimick Baker Huntington, Statement on Battle Creek Fight, January 1, 1862, MS 4085, LDS Archives\n* LDS Journal History (May be read at LDS Church History Library)\n* History of Utah in Four Volumes, Orson F. Whitney, March 1892, page 423 (Held at Harold B. Lee Library, Brigham Young University, Provo, Utah)\n* Autobiography of Pioneer John Brown, 1820–1896, Arranged & Published by his son, John Zimmerman Brown, 1941, pages 103–105\n* Provo, Pioneer Mormon City, compiled by ... Writers Program ... for the state of Utah, copyright 1942 Provo City Commission, pages 36–44\n* [https://web.archive.org/web/20090713045011/http://plgrove.org/unique-to-pleasant-grove/pleasant-grove-history Pleasant Grove City's Account of the Battle Creek Attack] Click on \"Prelude to Settlement, The Battle Creek Battle\" for this account\n* [http://www.blackhawkproductions.com/fortutah.htm#Battle_Creek_Massacre_1849 Phillip B. Gottfredson's Account of the Battle Creek Attack]"
    }
  ]
}