{
  "content": [
    {
      "type": "text",
      "text": "# Battle of the Indus (1027)\n\nThe Battle of the Indus in 1027, \"Some writers say Mahmud set out on this expedition in the beginning of 418 H. (March 1027)\"}} was the final military campaign by Mahmud of Ghazni () targeting the Jats of the Salt Range in the lower Indus Valley. The punitive expedition action was undertaken to chastise the Jats, who had harassed and molested his army during its return journey from Somnath in 1026. The expedition was primarily naval, with Mahmud constructing 1,400 boats equipped with pointed warheads at Multan to engage the Jats, who countered with 4,000 small reed boats. The Jats were decisively defeated, with many killed in the first naval action ever fought by Mahmud. This campaign, which also addressed some rebels in the Punjab, marked the conclusion of Mahmud's military endeavors in India.\nBackground\nAfter Mahmud's Somnath expedition in India in the earlier year, the Ghaznavid army endured significant hardships during its retreat, initially traversing the arid Sind desert, followed by the Sindh-Sagar Doab. In the latter region, it faced persistent harassment and delays from the local Jat population, resulting in a protracted withdrawal.\nBattle\nIn early 1027&nbsp;AD, Mahmud launched his seventeenth and final expedition into India, targeting the Jats who had disrupted his earlier retreat. In March, he set out for Multan, building 1,400 boats. Each boat was equipped with an iron spike at the prow and additional spikes along the gunwales, manned by crews of 20 armed with bows, arrows, and naphtha grenades. The sultan advanced on the Indus river to attack the enemies. The Jats prepared for the conflict, relocating their families and possessions to a distant island in the river. The Jats countered with a fleet of 4,000 boats though some sources claim 8,000. The Sultan countered by blocking the river's upper course with his own flotilla and deploying two robust cavalry detachments, supported by elephants, to secure the riverbanks. A naval engagement followed. The three projected iron spikes on Mahmud's boats pierced and capsized the Jat vessels, leading to a decisive victory in which nearly all Jat fighters were killed or drowned. Some attempted to flee overland but were repelled by Turkoman forces stationed along the riverbanks, forcing them back into the water. Ghaznavids pursued the Jats to their island refuge, where they had stored their valuables, resulting in significant casualties and the capture of substantial spoils as well as the women and children as slaves. This was the last military campaign taken by Mahmud of Ghazni in India. The Sultan returned to Ghazni in the beginning of summer around June–July 1027.\nAftermath\nThis was the last military offence carried out by Mahmud of Ghazni. The remainder of Mahmud's reign was spend suppressing disruptions of the Seljuks, and campaigns which led annexation of western Persia.\nNotes\nReferences\nBibliography\n*\n*\n*\n*\n*\n*\n*\n*\n*"
    }
  ]
}