{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Patay__disambig_1\n\n| result            = French victory\n| combatant1        = France\n| combatant2        = England\n| commander1        = La HireJean de XaintraillesAntoine de Chabannes\n| commander2        = John FastolfJohn TalbotThomas, Baron ScalesThomas Rempston\n| strength1         = 180 knights1,300 men-at-arms\n| strength2         = 5,000\n| casualties1       = 3 killed and 100 wounded\n| casualties2       = Over 2,000 killed2,500–4,000 killed or captured\n| map_type          =\n| map_relief        =\n| map_size          =\n| map_marksize      =\n| map_caption       =\n| map_label         =\n}}\nThe Battle of Patay, fought on 18 June 1429 during the Hundred Years' War, was the culmination of the Loire Campaign between the French and English in north-central France. In this engagement, the horsemen of the French vanguard inflicted heavy casualties on an English army; most of them sustained by the longbowmen as the English cavalry fled. In addition, all but one of the senior English commanders were captured. A victory often credited to Joan of Arc, she was in fact not present for the battle as she had remained with the main body of the French army. The vanguard at Patay was led by La Hire and Jean Poton de Xaintrailles.\nThe battle was a disastrous blow to English aspirations in France. For the French, it cemented the turn of fortune which had begun at Orléans and concluded a highly successful campaign. The latter was followed by a march to Reims which saw the Dauphin Charles be crowned King of France. The Hundred Years' War, however, would continue until 1453.\nBackground\nAfter the English abandoned the Siege of Orléans on 8 May 1429, the survivors withdrew to garrisons along the Loire. A month later, having gathered men and supplies for the forthcoming campaign, the French army, under the command of the Duke of Alençon, set out to capture these positions and the bridges they controlled. On June 12 they stormed Jargeau , captured the bridge at Meung-sur-Loire, then marched on, without attacking the nearby castle, to besiege Beaugency on 15 June.\nAn English reinforcement army under Sir John Fastolf, which had set off from Paris following the defeat at Orléans, now joined forces with survivors of the besieging army under Lord Talbot and Lord Scales at Meung-sur-Loire. Talbot urged an immediate attack to relieve Beaugency, but was opposed by the more cautious Fastolf, who was reluctant to seek a pitched battle against the more numerous French. The garrison of Beaugency, unaware of the arrival of Fastolf's reinforcements and discouraged by the reinforcement of the French by a Breton contingent under Arthur de Richemont, surrendered on 18 June. Talbot then agreed to Fastolf's proposal to retreat towards Paris. Learning of this movement, the French set off in pursuit, and intercepted the English army near the village of Patay.\nBattle\nIn this battle, the English attempted to employ the same methods used in the victories at Crécy in 1346 and Agincourt in 1415, deploying an army composed predominantly of longbowmen behind a barrier of sharpened stakes driven into the ground to obstruct any attack by cavalry. Learning of the French approach, Talbot sent a force of archers to ambush them from a patch of woods along the road, then ordered them to redeploy, setting up 500 longbowmen in a hidden location which would block the main road.\nThough they moved quickly, these English archers were attacked by 180 knights of the French vanguard under La Hire and Xaintrailles before they could finish preparing their new position and were swiftly overwhelmed, leading to the exposure of the other English units, which were spread out along the road. Earlier, the longbowmen had inadvertently disclosed their position to French scouts when a lone stag wandered onto a nearby field and the archers raised a hunting cry, not knowing their enemies were already so close. Learning of this, the French vanguard had raced ahead, soon moving up within sight of them. With the threat of an ambush dealt with by the French knights, some were sent back to inform the men-at-arms of the English predicament. Opting to not wait for the reinforcements, La Hire, Xaintrailles, Kennedy and their knightly fellows deployed and charged forward, crashing into the English positions from the now exposed flanks. Meanwhile, having ridden over a ridge south of the English lines, the rest of the French vanguard, consisting of some 1,300 men-at-arms, soon appeared behind the enemy in battle order. At the sight of the French horsemen charging, Fastolf's unit attempted to join up with the mounted knights and men-at-arms who formed the English vanguard but the latter fled the battlefield, forcing Fastolf to follow suit. Outflanked and overrun, the rest of the battle was a prolonged heavy cavalry mopping-up operation against the fleeing English units, with little organized resistance.\nHistorian Juliet Barker suggests Patay was the most disastrous English defeat since the Battle of Baugé in 1421, and one with more significant consequences since they lost over 250 dead out of 3,000 men, while all of their senior commanders were captured apart from Fastolf, the only one who remained mounted. Grummitt estimates English casualties as 250 with many hundreds captured, the bulk of whom were archers, while the French lost only about one hundred men. Talbot, Scales and Sir Thomas Rempston were captured and, after his release in 1433, Talbot accused Fastolf of deserting his comrades in the face of the enemy. Fastolf hotly denied the charge and was eventually cleared by a special chapter of the Order of the Garter, although his reputation was severely damaged.\nConsequences\nThe virtual destruction of the English field army in central France and the loss of many of their principal veteran commanders (another, the Earl of Suffolk, had been captured in the fall of Jargeau, while the Earl of Salisbury had been killed at the siege of Orléans in November 1428), had devastating consequences for the English position in France, from which it would never recover. During the following weeks the French, facing negligible resistance, were able to swiftly regain swathes of territory to the south, east and north of Paris, and to march to Reims, where the Dauphin was crowned as King Charles VII of France on 17 July.\nReferences\nBibliography\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*"
    }
  ]
}