{
  "content": [
    {
      "type": "text",
      "text": "# Battleship Row__disambig_1\n\nBattleship Row was the grouping of seven U.S. battleships in port at Pearl Harbor, Hawaii, when the Japanese attacked on 7 December 1941. These ships bore the brunt of the Japanese assault.  They were moored next to Ford Island when the attack commenced. The ships were , , , , , , and . A repair ship (former coal ship), , was also present, moored next to Arizona.\nCreation\nWhen the United States Navy decided in 1919 to establish a major naval base in Pearl Harbor, the southeastern side of Ford Island was ceded from control of the Army Air Service at the behest of Secretary of War Newton D. Baker. Due to its location in the center of the harbor, where the water was deepest and the potential for maneuvering greater than along the shores, this coast of Ford Island became the de facto mooring location for the Pacific Fleet's battleships and took on the nickname \"Battleship Row\".\nAttack and aftermath\nis in the center of the picture, and Battleship Row is behind the island.]]\nArizona, California, Oklahoma, and West Virginia were sunk during the attack (albeit, California and West Virginia were refloated and rejoined the fleet in 1944). Arizona suffered the most serious damage and loss of life, an explosion in a forward magazine breaking the hull in two. Of the other four battleships, Nevada suffered damage sufficient to keep her non-operational until late 1942; Tennessee and Maryland, although damaged, returned to service in early 1942. Pennsylvania was in dry dock, making attack difficult, and, as a result, was relatively undamaged. Vestal was also damaged. Battleship Row was not visible from Hickam Field because of the thick black smoke. Following the attack, operations immediately commenced to refloat and repair the damaged ships. The first to be completed was Nevada on 19 April 1942.  By the end of the war, all except Arizona and Oklahoma had returned to service.  Each of the six surviving battleships saw service in the Pacific island hopping campaign. Nevada also served in the Atlantic and supported the invasion of Normandy. All six were decommissioned soon after the war was over. Nevada and Pennsylvania were expended in atomic bomb tests in the Pacific.  The rest were scrapped in the late 1950s. Oklahoma was eventually refloated but not repaired, and capsized and sank while being towed back to the mainland for scrapping.  Arizonas hull remains a memorial, one of the most popular tourist attractions on the island.\nwas in port at Pearl Harbor, but was not moored with the rest of the battleships, as she had since been converted to a target ship. However, she was still sunk within a few minutes of the battle.\nShips that were attacked\n* : (flagship of Battleship Division One) hit by two armor-piercing bombs, exploded; total loss. 1,177 dead.\n* :  hit by nine torpedoes, capsized; total loss. 429 dead. Refloated November 1943; capsized and lost while under tow to the mainland May 1947.\n* : hit by two torpedoes, capsized; total loss. 58 dead. Was commissioned as a target ship at the time of the attack and was docked on the west side of Ford Island, opposite Battleship Row.\n* : hit by two bombs, nine torpedoes, sunk; returned to service July 1944. 106 dead.\n* : hit by two bombs, two torpedoes, sunk; returned to service January 1944. 104 dead.\n* : hit by six bombs, one torpedo, beached at Hospital Point; after attack, moved across channel and later sunk at Waipio Peninusula; returned to service October 1942. 60 dead.\n* : hit by two bombs; returned to service February 1942. 5 dead.\n* : hit by two bombs; returned to service February 1942. 4 dead (including floatplane pilot shot down).\n*  (flagship of the U.S. Pacific Fleet): in drydock with Cassin and Downes, hit by one bomb, debris from USS Cassin; remained in service. 15 dead, 14 missing.\nSee also\n* USS Arizona Memorial\n*Pearl Harbor National Memorial\nReferences"
    }
  ]
}