{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Kircholm__disambig_1\n\n| place             = Kircholm, present-day Salaspils, Latvia\n| result            = Polish-Lithuanian victory\n| combatant1        =  Poland–Lithuania Duchy of Courland\n| combatant2        =  Sweden\n| commander1        =  Jan Karol Chodkiewicz Jan Piotr Sapieha\n| commander2        =  Charles IX\n| strength1         = 3,600:\n1,000 infantry2,600 cavalry5 cannons\n| strength2         = 10,868:\n2,500 cavalry 8,368 infantry 11 cannons\n| casualties1       = 100 killed200 wounded\n| casualties2       = 5,500–8,000 losses}}\n| campaignbox       =\n}}\nThe Battle of Kircholm (; Polish: Bitwa pod Kircholmem; Swedish: Slaget vid Kirkholm; ) was one of the major battles in the Polish–Swedish War of 1600–1611. The battle was decided in 20 minutes by a devastating charge of Polish-Lithuanian cavalry, including the Winged Hussars. The battle ended in a decisive victory of the Polish-Lithuanian forces, and is remembered as one of the greatest triumphs of Commonwealth cavalry.\nBackground\nOn 27 September 1605, the Commonwealth and Swedish forces met near the small town of Kircholm (now Salaspils in Latvia, some  south-east of Riga). The forces of Charles IX of Sweden were numerically superior and were composed of 10,868 men and 11 cannons. The Swedish army included two western commanders, Frederick of Lüneburg and Count Joachim Frederick of Mansfeld, with a few thousand German and Dutch mercenaries and even a few hundred Scots.\nThe Polish Crown declined to raise funds for defence and send troops, only making promises they never fulfilled. The army, led by the Great Hetman of Lithuania Jan Karol Chodkiewicz, was tired and starving; however, the soldiers admired their leader. He promised to pay army wages from his own fortune, resulting in an influx of recruits from Lithuania. The Polish–Lithuanian Commonwealth army under Chodkiewicz was composed of roughly 1,000 infantry and 2,600 cavalry, but only five cannons. However, the Polish-Lithuanian forces were well-rested, and their cavalry consisted mostly of superbly trained Winged Hussars, or heavy cavalry armed with lances. In contrast, the Swedish cavalry were less-well trained, armed with pistols and carbines, on poorer horses and tired after a long night's march of  over 10&nbsp;km in torrential rain. The Polish-Lithuanian forces had a small number of Lithuanian Tatar and Cossack mercenaries, used mostly for reconnaissance.\nDeployment\nThe Swedish forces seem to have been deployed in a checkerboard formation, made up of the infantry regiments formed into seven or eight well-spaced independent blocks, with intersecting fields of fire. The flanks were to be covered by the Swedish and German cavalry, and the cannons were placed in front of the cavalry.  Charles' force was formed into four lines on the crest of a ridge. The first line consisted of four infantry battalions, cavalry in the second line, six infantry battalions in the third line, and cavalry in the fourth line.  The infantry battalions formed in squares of 30 by 30, with pikemen in the center and shot on the edges, and gaps between the squares allowed passage of their cavalry.\nJan Karol Chodkiewicz deployed his forces in the traditional deep Polish battle formation—the so-called \"Old Polish Order\"—with the left wing significantly stronger and commanded by Tomasz Dąbrowa, while the right wing was composed of a smaller number of hussars under Jan Piotr Sapieha, and the center included Hetman Chodkiewicz's own company of 300 hussars led by Lt. Wincenty Woyna and a powerful formation of reiters sent by the Duke of Courland Friedrich Kettler. The Polish-Lithuanian infantry, mostly armed in Hungarian hajduk-style, drew up in the center. Some 280 hussars were left as a general reserve under Teodor Lacki.\nBattle\n'']]\nChodkiewicz tried for hours to lure the Swedes from their positions with his light cavalry sent out to skirmish between the two armies.  Chodkiewicz, having smaller forces (approximately a 1:3 disadvantage), used a feint to lure the Swedes off their high position, pretending to withdraw. The Swedes under Charles thought that the Polish-Lithuanian troops were retreating and therefore advanced to the bottom of the slope, using their second line of cavalry to cover their flanks while the first line of infantry closed up. This is what Chodkiewicz was waiting for. The Commonwealth forces now gave fire with Kettlers' Curonian harquebusiers while Wincenty Wojna's hussars charged at the Swedish lines, causing disorder in the infantry.\nThe main battle started with the Polish-Lithuanian cavalry charge on the Swedish right flank, with about 1,000 hussars shattering Mansfield's reiters and disordering the Swedish third infantry line in their retreat. At the same time, on the Swedish left, 650 hussars under Sapieha charged. After Charles sent in his reserve of 700 cavalry, Chodkiewicz sent in his reserves. The entire force of Swedish cavalry was finally put to rout, and in their flight, disordered many of their own infantry, leaving them vulnerable to the hussars' charge.\nWithin 30 minutes, the Swedish cavalry was in full retreat on both flanks exposing the infantry in the centre to the hussars and the firepower of Chodkiewicz's infantry. The Swedish defeat was utter and complete. The army of Charles IX had lost at least 5,000 killed and 500 captured, or up to 7,600–8,000 killed, captured, and dispersed. The Polish-Lithuanian losses numbered only about 100 dead and 200 wounded, although the hussars, in particular, lost a large part of their trained battle horses.\nAs in all crushing victories in this period, the larger part of the Swedish losses were suffered during the retreat, made more difficult by the dense forests and marshes on the route back to Riga, many drowning crossing the Dvina. The  Poles and Lithuanians spared few. Polish-Lithuanian casualties were light, in large part due to the speed of the victory. During the hussar's charges, it was the horses that took the greatest damage, the riders being largely protected by the body and heads of their horses.\nAftermath\nAfter the defeat, the Swedish king was forced to abandon the siege of Riga and withdraw by ship back across the Baltic Sea to Sweden, and to relinquish control of northern Latvia and Estonia. However, the Commonwealth proved unable to exploit the victory fully because there was no money for the troops, who had not been paid for months. Without pay, they could not buy food or fodder for their horses or replenish their military supplies, and so the campaign faltered. An additional factor was the large number of trained horses lost during the battle, which proved difficult to replace.\nA truce was eventually signed in 1611, but by 1617 war broke out again, and finally, in 1621, the new Swedish king, Gustavus Adolphus, landed near Riga and took the city with a brief siege, wiping away – in Swedish eyes – much of the shame suffered at Kircholm.\nCommemoration\nThe Battle of Kircholm is commemorated on the Tomb of the Unknown Soldier, Warsaw, with the inscription \"KIRCHOLM 27 IX 1605\".\nNotes\nReferences\nBibliography\n*\n*\n*\n*\n*\n*\nExternal links\n*[https://web.archive.org/web/20161112212930/https://www.msz.gov.pl/resource/21badcbf-0c18-4fb8-8b19-3d382469d25f%3AJCR Winged Hussars], Radoslaw Sikora, Bartosz Musialowicz, BUM Magazine, 2016."
    }
  ]
}