{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Torrington__disambig_1\n\nThe Battle of Torrington (16 February 1646) was a decisive battle of the south-western campaign of the First English Civil War and marked the end of Royalist resistance in the West Country. It took place in Torrington, Devon.\nPrelude\nAfter Lord Wentworth's defeat at Bovey Tracey, Sir Ralph Hopton was appointed Royalist commander in the west, with Wentworth commanding the horse and Sir Richard Grenville the foot.  Grenville refused to recognise Hopton's command and was arrested for insubordination and imprisoned on St Michael's Mount.\nHopton's army, numbering 3,000 horse and 2,000 foot, advanced into Devon and occupied Torrington, where defensive works were erected.\nBattle\nThe Parliamentarians approached from the east on the evening of 16 February 1646. In heavy rain and with night falling, the Parliamentarians ran into Royalist dragoons and fighting broke out to the east of Torrington. The Parliamentarian commander, Sir Thomas Fairfax, decided to wait until morning to reconnoitre the Royalists' defences. However, when he sent his dragoons forward to test the defences and they came under fire; Fairfax pushed more troops forward in support and a general fight developed.\nThe fighting at the barricades lasted two hours at push of pike. At last the Cornish infantry gave way and retreated into the town, where bitter fighting continued. A stray spark ignited the Royalist magazine in Torrington church, where eighty barrels of gunpowder were stored.  The explosion destroyed the church, killed all the prisoners held there and narrowly missed killing Fairfax.\nAftermath\nThe explosion effectively ended the battle with the remaining Royalist troops escaping.\nMemorial\nThe anniversary of the battle is remembered in February each year, with a torch-lit procession and re-enactment.\nIn fiction\nThe battle features strongly in the conclusion of Rosemary Sutcliff's historical fiction Simon.\nCitations\nReferences\n*|archive-date=4 March 2016|archive-url=https://web.archive.org/web/20160304104920/http://www.great-torrington.com/history/index.html|url-status=dead}}\n*"
    }
  ]
}