{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Selinus__disambig_1\n\nThe Battle of Selinus, which took place early in 409 BC, is the opening  battle of the so-called Second Sicilian War. The ten-day-long siege and battle was fought in Sicily between the Carthaginian forces under Hannibal Mago (a king of Carthage of the Magonid family, not the famous Hannibal of the Barcid family) and the Dorian Greeks of Selinus. The city of Selinus had defeated the Elymian city of Segesta in 415, an event that led to the Athenian invasion of Sicily in 415 and ended in the defeat of Athenian forces in 413. When Selinus again worsted Segesta in 411, Carthage, responding to the appeal of Segesta, had besieged and sacked Selinus after the Carthaginian offer of negotiations had been refused by the Greeks. This was the first step towards Hannibal's campaign to avenge the Carthaginian defeat at the first battle of Himera in 480. The city of Selinus was later rebuilt, but never regained her former status.\nBackground\nThe island of Sicily contained the Elymians, Sikans, and the Siculi living in respective communities before the Phoenicians had started their colonisation of Sicily after 800 BC. The Phoenicians had initially planted trading posts all over the coast of Sicily, but never penetrated far inland and ultimately withdrew without resistance to the western half of the island (concentrating in the cities of Motya, Panormus, and Soluntum) with the arrival of the Greek colonists after 750. The Ionian Greeks took the lead in colonising Sicily among Greeks when they planted Naxos in 735, and spread north and west along the island coast until the city of Himera was founded in around 648, bordering the Phoenician territory of Soluntum. The Dorian Greeks founded Syracuse in 734 and spread south then west along the coastline until Selinus was founded around 654, bordering the Phoenician territory of Motya. While the Ionian Greeks on the whole had friendly relations with the native Sicilians and the Phoenicians, the Dorian Greeks were comparably more aggressive, pushing inland at the expense of the natives to expand the Greek domain. Conflicts among the Greeks colonies and between the natives and Greeks erupted, but these were mostly localised affairs without any decisive results or intervention from non-Sicilian powers. The Phoenicians and Carthaginians traded with everyone in Sicily and on the whole all the island colonies prospered. This prosperity caused some of the Greek cities to start to expand their territories again, ultimately leading to the events known as the Sicilian Wars.\nCarthaginian hegemony\nThe Phoenicians in Sicily had not resisted the initial Greek expansion by force of arms, but this state of affairs changed when the Greeks began to encroach on their territory in Western Sicily. Phoenicians had aided the Elymians against the Dorian Greeks of Selinus in 580, when a Greek colonization attempt of the area around future Lilybaeum (which lies across the Phoenician colony of Motya) was defeated by their joint effort. Nothing is known of the role of Carthage in this episode, and it is possible that the Sicilian Phoenicians were not a part of the Punic hegemony at that time. The Carthaginian king Malchus is said to have \"conquered all Sicily\" and sent booty captured to Tyre sometime after this event. This probably implies that Carthage had incorporated the Phoenician colonies of Motya, Panormus, and Solus into the Punic hegemony led by Carthage, which had begun to resist Greek encroachment of the Western Mediterranean after 600 BC. The growth of Selinus and Himera during the period Malchus was active in Sicily indicates that Carthaginians were not in conflict with the Sicilian Greeks at that time. However, Carthage countered the expedition of Spartan Dorieus in 510 and the Greeks were defeated near Eryx, a clear indication that Carthage now held sway over the Phoenician interests in Sicily. A war followed this event, which eventually led to Carthage destroying the city of Heraclea Minoa. The year this event took place is not known, but Carthage did not intervene in Sicily again until 480 after Heraclea had been destroyed. Carthage granted the Sicilian Phoenicians local autonomy, keeping control of their foreign policy, extracting some sort of tribute in exchange for military aid. The Elymians, dominated by Segesta, were given allied status, protecting them from further hostility of Selinus, which had also allied herself with Carthage because of the threat presented by the rise of Akragas.\nGreek tyrants\nTwo Greeks from Gela, Cleander and Gelo, had been involved in the war that eventually destroyed Heraclea Minoa. An appeal for aid to avenge the death of Dorieus was ignored by mainland Greece, even by Leonidas of Sparta, the brother of Dorieus and who later would win immortal fame at a narrow pass called the Gates of Fire near Thermopylae in 480. While Carthage was engaged in Sardinia, the Greek colonies in Sicily had fallen under the rule of tyrants. Some of these tyrants, notably those ruling Gela, Akragas, and Rhegium, sought to expand their dominion at the expense of native Sicilians and other Greek cities during 505 -480 BC, with the Dorian city of Gela being the most successful. Tyrants like Cleander and Hippocrates successfully took over Sicel and Ionian Greek territory, and by 490, Zankle, Leontini, Catana, and Naxos had fallen under Gelan control. Syracuse had managed to survive the attempts of Hippocrates with help from Corinth, but Gelo, the successor of Hippocrates, captured Syracuse and made the city his capital. Akragas expanded her territory against the Sikans and Sicels, and under Theron, allied with Gelo to forestall any future conflicts between the neighboring powers. The Ionian Greeks, having lost Naxos and Catana to Gelan aggression, responded by creating an alliance between tyrants of Himera and Rhegion. Anaxilas, tyrant of Rhegion, who had managed to detach Zankle from the clutches of Syracuse by 485 BC, married the daughter of Terillus, tyrant of Himera. Both Himera and Rhegion also made treaties with Carthage. Terillus went further, becoming guest-friend of Hamicar Mago, \"king\" of Carthage.\nThus three powers were delicately balanced in Sicily by 483. Carthage kept the peace between Elymians and Selinus, while the Ionian Greeks in the north (led by Himera and Rhegion) faced the Dorians Greeks from the South, led by Syracuse and Akragas. This situation changed when Theron, with support from citizens of Himera, deposed Terillus and took over that city in 483 BC. Carthage intervened at the instigation of Anaxilus, and the Sicilian Greeks under the tyrants Gelo and Theron crushed the Punic expedition of 480 in the 1st battle of Himera. The Carthaginian domain in Western Sicily was untouched by this defeat. Carthage had refrained from intervening in Sicilian affairs for 70 years while expanding her hegemony in Africa, Sardinia and Spain.\nThis defeat of an external power brought prosperity, but not peace, for Sicilians, Greeks, and non-Greeks alike. The political landscape in Sicily during those years changed as some of the Greek tyrants were replaced by democracy and oligarchy, the influence of Syracuse shrank in Sicily and infighting between the Greek cities flared up. Athens had sent fleets to Sicily in 427, 425 and 424 to intervene in these conflicts, which ultimately caused Hermocrates of Syracuse to request all Sicilian Greek cities to remain at peace at the congress of Gela in 424. Peace between Greeks and the natives of Sicily was not part of this agreement. Ironically, the defeated Carthaginians and their allies, the Elymians seem to have enjoyed comparably more peaceful existence after the battle of Himera until 415.\nSelinus versus Segesta\nGreek Selinus and Elymian Segesta share a long history of trade and conflict. The cities were trading partners and had a close enough relationship to have passed laws allowing inter-marriage between citizens. There had been conflicts as well; The Phoenicians had aided the Elymians to beat back the Greek invasions of 580 and 510 BC of Lilybaeum and Eryx. It is unknown what role Segesta played in the war where Carthage destroyed Minoa. Segesta was neutral during the first battle of Himera (ironically Selinus had sided Carthage). The period following Himera was one of prosperity for both cities. Around 454 BC, a conflict involving Motya, Segesta, Selinus and Akragas took place, details are confusing except that Carthage was not involved, Selinus won a victory and the Elymians had appealed for aid from Athens without any known results. After a peace lasting almost 3 decades, Segestan power seem to have weakened and Selinus opened hostilities in 416 BC.\nAthenenian expedition\nThe Greeks of Selinus crossed the upper reaches of the River Mazaros and occupied some disputed lands on the border of Segestan domain and started to raid Segestan territory. Segesta requested the Greeks to stop, and when this was not heeded, they managed to recapture the lands, but the Greeks defeated them in a later battle. Segesta then requested Akragas and Syracuse to intervene in vain, in fact Syracuse joined Selinus and sent a fleet to blockade the Elymian coast. In desperation Segesta sent an embassy to Carthage, but the Carthaginians refused any aid. Segesta had allied with Athens in 426 BC when they had intervened in Sicily for the first time and an embassy was sent to Athens begging aid. The resultant Athenian invasion of Sicily during 415-413 BC was destroyed by a combined effort of Sicilian cities including Selinus and Syracuse. As an ally of Athens, the position of Segesta had become precarious.\nRenewed Selinute aggression\nAfter the Athenian defeat, Selinus sought to expand her domain again. Her geographic position meant an expansion had to be against either Motya to the West or Akragas to the east or against Segesta to the north. Conflict with Motya meant taking on Carthage, while Akragas was the wealthiest city in Sicily and a relatively stronger opponent compared to Segesta. Furthermore, Segesta was allied to an enemy power and conquering the Elymians would have given Selinus control of an area rivaling that of Syracuse in size and direct land access to the Tyrrhenian Sea&nbsp;– and direct trade route with the Etruscan and Massaliot markets.\nSelinus resumed hostilities in 410, again reoccupying the disputed lands across the River Mazaros. Segesta, fearing that any resistance would bring Syracuse into the fray against them, remained passive, but the Greeks continued to raid Segestan domain. Segesta now sent an embassy to Carthage begging for protection.\nCarthaginian response\nCarthage, during the 70 years following the battle of Himera, had expanded her domain in Africa, explored new trade routes on the Atlantic coasts of Africa and Europe and had pacified Sardinia under the leadership of the Magonid dynasty, but had not intervened in Sicilian affairs&nbsp;– and Sicilian Greeks had also refrained from provoking her. By changing trade patterns and consolidating markets Carthage had by 430 amassed a huge hoard of gold and silver. The Greeks were aware of the growing power of Carthage, which is why Syracuse had contemplated requesting her aid against the Athenian invasion, while the Athenians actually asked Carthage for aid during the invasion. Carthage had denied aid to both, and also declined to help Segesta in 416. The situation was different in 411, when the Segastans renewed their plea.\nReason for intervention\nFirstly, Segesta decided to submit to Carthage and become a dependent ally. This probably meant that Segesta would retain internal and commercial autonomy, but surrender control of foreign policy, pay for any Punic garrison housed in Elymian territory and perhaps pay tribute in return for Carthaginian protection. Secondly, one of the Suffets of Carthage was Hannibal Mago, a member of the Magonid dynasty&nbsp;– and no lover of Greeks. From the Carthaginian prospective, probably three factors stood out: A victory over Selinus would mean a strong power in Western Sicily capable of supporting Punic interests, the submission of Segesta would enlarge the Carthaginian domain, but at the same time any intervention risks a war with the mighty Syracuse. The Carthaginian Senate debated the matter at length, and the influence of Hannibal finally secured a verdict for accepting Segestan submission to the Punic hegemony and lending aid to Segesta. Hannibal was authorized to aid Segesta by any means necessary.\nShuttle diplomacy\nHannibal was not influenced by his personal feelings while tackling his task. He sent an embassy to Selinus proposing they keep the disputed lands in exchange for a ceasefire with Segesta. This move gave Carthage some time to mobilize troops, as they had no standing army, and had it succeeded, it would have enlarged the Carthaginian domain (Segesta was a dependency now), ensured Segestan security without war. The Carthaginian offer was debated in council, and Empidion, a citizen with ties to Carthage, strongly advocated acceptance of these terms to avoid a conflict with Carthage. The Greeks of Selinus chose to decline the Carthaginian offer.\nHannibal next sent Carthaginian and Segestan envoys to Syracuse, with a proposition that they mediate in the dispute between Selinus and Segesta&nbsp;– calculating that Selinus would refuse arbitration and then Syracuse would decline to become further involved. When a Selinite embassy told the Syracusans that they should mediate in the matter, Syracusans replied that they would neither break their alliance with Selinus nor break the peace with Carthage. Carthage thus had a free hand to deal with Selinus, without the fear of outright interference from Syracuse. Carthaginian diplomacy had managed to isolate Selinus for the time being.\nExpedition of 410\nCarthage maintained no standing army, so Hannibal initially sent an army made of 5,000 African soldiers and 800 Italian mercenaries (previously in service with the Athenian expedition) to Sicily, (Carthage also provided horses for the Italians), and stationed this force at Segesta. While the army of Selinus was plundering Segestan territory and had scattered into small groups because of carelessness, the reinforced army of Segesta sallied forth, caught the scattered Selinute soldiers by surprise, inflicted almost 1,000 casualties on the Greeks and captured all the booty collected by them. Segesta was secure from Greek raids for the moment, as the Greeks retreated back to Selinus after this clobbering. Syracuse received a request for aid from Selinus after this fiasco, which was voted but nothing was done at this time. Segesta meanwhile, probably fearful of Syracusan retaliation, appealed for further aid to Carthage.\nMain expedition\nHannibal, responding to the Segestan appeal, put together a larger force, said to have numbered 120,000 men, including 4,000 cavalry, recruited from Africa, Sardinia, Spain, and even Sicilian Greeks, and this army even contained many Carthaginian volunteers. Modern estimates place the army strength at 30,000-40,000 soldiers. The army started mustering in the summer of 410, and did not set forth until the spring of 409.\nCarthaginian cohorts\nThe Carthaginian army composed of mercenaries from various nations. The Libyans supplied both heavy and light infantry and formed the most disciplined units of the army. The heavy infantry fought in close formation, armed with long spears and round shields, wearing helmets and linen cuirasses. The light Libyan infantry carried javelins and a small shield, same as the Iberian light infantry. Iberian soldiers wore purple-bordered white tunics and leather headgear. Iberian heavy infantry fought in a dense phalanx, armed with heavy throwing spears, long body shields, and short thrusting swords. Campanian, Sardinian and Gallic infantry fought in their native gear, but often were equipped by Carthage.\nThe Libyans, Carthaginian citizens and the Libyo-Phoenicians provided disciplined, well trained cavalry equipped with thrusting spears and round shields. Numidia contributed superb light cavalry armed with bundles of javelins and riding without bridle or saddle. Iberians and Gauls also provided cavalry, which relied on the all out charge. Allied cities of the Punic hegemony contributed contingents for the army as well. Carthaginian officer corps held overall command of the army, although many units may have fought under their chieftains. Greeks hired from Sicily and Italy fought as hoplites.\nSelinus: location and defence\nSelinus was one of the richest cities in Sicily, settled by Dorian Greeks from Megara Hybla in 628. Although not in the same league with Syracuse and Akragas, its location and citizens were expected to offer a taught defence - which was the assumption made by the Syracusans when preparing their relief army.\nCity features\nThe city of Selinus sits on a hill (height approximately , it is gently sloped on three sides except on the seaward side to the south) between the rivers Selinus and Hypsas. The walled acropolis to the south of the hill contained the original city, which later extended towards the north, covering the whole hill. Somewhere North of the acropolis was the agora. Selinus contained two harbors located to the west and east of the hill on the mouths of the rivers. To the west and east of the city, beyond the rivers, are two hills on top of which some of the temples of the city are located. The exact location of the city wall cannot be traced, but it may have covered at least the acropolis and hill on which the city stood.\nDefenders\nLarge Sicilian cities like Syracuse and Akragas could field up to 10,000 to 20,000 citizens, while smaller ones like Himera and Messana mustered between 3,000 and 6,000 soldiers. Selinus probably had between 3,000 and 5,000 soldiers, and no mercenaries to augment their numbers.\nThe soldiers of Selinus were hoplites, and the city also had a considerable number of cavalry available for its defence. Little is known about the state of Selinute warships or their disposition at this time. Selinus had fought most of its war away from the city after 480, so it is understandable that the walls of Selinus were said to have fallen into ill repair. During the siege, all citizens, including women and old men, were mobilized, and most served as improvised missile troops. By pelting the attacking enemy with tiles, brick and other objects, these impromptu peltasts could take a heavy toll during urban fighting.\nCarthaginian expedition to Sicily\nUnder the escort of 60 triremes the soldiers, supplies, and siege equipment were ferried from Africa to Motya in Sicily by 1,500 transports in the spring of 409. Levies from the Sicilian Punic cities and Segesta joined the force at Motya. Hannibal allowed one day rest for his soldiers before setting out for Selinus, capturing the city of Mazara, an outpost of Selinus, on the way. This city served as the supply base for the Punic army during the campaign. The army carried their siege equipment with them to Selinus, while the Carthaginian fleet stayed at Motya. Selinus, however, was forewarned of Hannibal's approach, as some of their cavalry had scouted out the Carthaginian army on their arrival at Motya and issued prompt warnings. The Selinute citizens prepared their defenses, called all their citizens outside the city to within their walls, and collected provisions to stand a siege, while requests for help were sent to Gela and Syracuse.\nSetting up the siege\nThe Carthaginian army reached the city before any help arrived and camped on the western hill near the acropolis before commencing siege operations. Hannibal did not fully invest Selinus by building circumvallation walls, as the construction delay might have given Syracuse and other Sicilian Greek cities ample time to send a large army and foil the Carthaginian enterprise. Instead of starving the Greeks into submission, Hannibal chose to attack the city directly with the help of siege equipment. A repeat of the Carthaginian debacle at Himera was not on Hannibal's agenda. The Carthaginian army did not immediately attack Selinus; some time was taken to set up the siege works and assemble the siege engines.\nFirst assault\nLeaving a detachment on the eastern side of the city to foil any approaching Greek relief army, the Carthaginians probably attacked the northern side of the city with six wooden siege towers and battering rams supported by the Italian mercenaries on the first day. The rams were covered by iron plating to secure them against fire. Selinus had not experienced any siege in the recent past so had little knowledge about dealing with siege warfare. The siege towers, which were taller than the city walls, contained a large number of slingers and missile troops. These attacked the defenders on the walls, who were ultimately forced to flee from the hail of missiles. Then the battering rams were employed against the walls, which were eventually breached. However, the follow-up infantry attack, led by the Campanians, was ultimately repulsed after an all-day battle, part of the reason being that the rubble of the walls had not been cleared away and it impeded the movements of the Carthaginian detachment. While the men of Selinus fought off the Carthaginians, the women and old men carried supplies to the walls and effected repairs. At nightfall, the Carthaginians broke off the assault and retired to their camp.\nThe Selinites took this opportunity to again send messages to Akragas, Gela, and Syracuse and to repair the damage to their walls. Horsemen carried the messages, and could have reached Syracuse in two days; the Syracusans could have reached the city in five. Akragas and Gela opted to wait for the Syracusan response before acting on behalf of Selinus. Syracuse, then engaged against Leontini and Naxos, broke off hostilities to gather a relief army, but the speed of their preparations was dictated by the assumption that Selinus would hold out for a long time against the Carthaginians. This assumption was erroneous because the Carthaginians were superior at siege warfare. One scholar had commented that among the Greek states of the 5th century, Athens had a reputation for being the most formidable in siege warfare, but compared to the skill of Asian and African powers in this art, its reputation is like the reputation of a one-eyed man among the blind.\nFinal assault\nHannibal renewed his efforts the following day. Archers and slingers positioned on top of the six siege towers again cleared the walls of Greek defenders at different sections of the city wall. Six battering rams were again employed against the walls and ultimately several breaches were made for the Punic infantry to exploit. After the rubble was cleared away from the breaches, groups of soldiers assaulting in relays were unleashed on the town defenders through the gaps in the walls. Once the walls were breached, the Greeks abandoned their effort to defend them. They barricaded the narrow streets and fought a fierce hand-to-hand battle with the attackers. For nine days and nights a bitter street-by-street battle raged, the Iberian troops of the Punic army leading the assault against the Greeks. The Greeks fought back fiercely in the streets, while tiles and bricks were hurled on the Carthaginians by women on the rooftops. Despite heavy casualties, the weight of numbers slowly enabled the Carthaginians to advance through the city. On the ninth day, the Greek women ran out of missiles, which eased the conditions for the Carthaginians. The Greeks began to fall back and ultimately the last stand of the Greeks took place in the Agora. When all resistance finally ceased in Selinus, 6,000 Greeks were made prisoners, 3,000 soldiers had escaped to Akragas, while 16,000 Greeks had died in the battle and the subsequent massacre. The Carthaginians spared only those who had sought shelter in the temples in the city.\nAftermath\nThe Syracusan vanguard of 3,000 troops under Diocles had arrived at Akragas when Carthaginians finally captured Selinus. Unable to aid in the defense of that city, Diocles opened negotiations with Hannibal. The first Greek delegation was given harsh answers, but the second one led by Empediones, a pro Carthaginian Selinute, obtained permission to eventually rebuild the city and ransom prisoners. The Carthaginians razed the city to the ground, but spared the temples from any desecration, although the temple treasures were carried off. The mission entrusted to Hannibal had been totally fulfilled with the destruction of Selinus. Instead of returning to Carthage or negotiating a truce with the now hostile Greeks, Hannibal chose to march against Himera, the site of the crushing Carthaginian defeat in 480. Syracusans, alert to the situation, began preparations to aid Himera in earnest. It is not known if the city of Himera had played a part in the battle of Selinus.\nSelinus would later serve as the base for Hermocrates of Syracuse for his raiding on Punic territory in 407, who would rebuild the walls of Selinus. The peace of 405 would allow Greeks to resettle in Selinus, but as a city, Selinus would never rise to its former glory, and would never again be a threat to Segesta. It was finally destroyed during the First Punic War by Carthage, and its citizens were relocated to Lilybaeum.\nReferences\nSources\n*\n*\n*\n*\n*\n*\n*\nExternal links\n*[https://archive.org/details/bub_gb_agd-eLVNRMMC Diodorus Siculus translated by G. Booth (1814)] Complete book (scanned by Google)\n*"
    }
  ]
}