{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Castione\n\nThe Battle of Castione was fought on 6 July 1449 between the Golden Ambrosian Republic (Milan) and the Swiss canton of Uri.\nThe site of the battle is near that of the earlier Battle of Arbedo, both in the territory of the current-day municipality of Arbedo-Castione in the Swiss canton of Ticino.\nBackground\nThe cause of both battles was the contest for control of the nearby fortified city of Bellinzona, which at the time was at the point of overlap of the spheres of influence of the Old Swiss Confederacy and the Duchy of Milan. Control of Bellinzona was the strategic key to controlling the Gotthard Pass and the valleys of Ticino and Misox. Uri had won Bellinzona in 1419, but lost it again as a result of the Battle of Arbedo of 1422.\nIn 1439, Uri launched a renewed campaign to regain the valleys in the southern Alps, and in 1441 forced Milan to yield the Leventina (which had already come under Swiss control in 1430). The Milanese War of Succession that followed the death of Duke Filippo Maria Visconti in 1447 and the formation of the Golden Ambrosian Republic encouraged Uri to push towards Bellinzona once again.\nBattle\nIn early 1449, Uri occupied Leventina and the Riviera, reaching as far as Bellinzona. The Golden Ambrosian Republic charged condottiero  with leading the campaign against the Swiss to re-establish Milanese control over the Sottoceneri. On 9 July 1449, in a battle which lasted for most of the day, the Milanese defeated and put to flight the forces of Uri near the village of Castione, north of Bellinzona. The village was burned down, and Uri was forced to retreat to the Misox. Milan secured control over Bellinzona and the Riviera.\nAftermath\nA formal peace treaty was enacted in 1450, and in 1466, Milan agreed to grant the Leventina to Uri permanently. The defeat at Castione halted Swiss expansion south of the Alps for several decades, until the Confederate campaign of 1478, and the Swiss victory in the Battle of Giornico in 1487.\nIn Swiss historiography, the account of the Battle of Castione was corrupted because historian Theodor von Liebenau (1840&ndash;1914) confused it with the Battle of Castiglione Olona (1450), fought between the Ambrosian Republic and forces of Francesco I Sforza. Proper identification of the battle was left to historians of the 20th century.\nSee also\n*Battles of the Old Swiss Confederacy\nReferences"
    }
  ]
}