{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Grolle\n\nDutch troops fire a volley on the battlefield\nThe Battle of Grolle (Dutch: Slag om Grolle) is a regular historical reenactment of the siege of the fortified border town of Groenlo (formerly known as Grol or Grolle) in the Achterhoek in 1627 during the Dutch Revolt. It is held in and around Groenlo itself every two years. The event lasts for three days and features a historic battle reenactment and a historic fair, with reenactors from many European countries. During the event, the reenactors try to relive the conditions of 1627 as faithfully as possible, without electricity or heating, while eating traditional food.\nThe event was held for the first time in 2005, with around 350 reenactors, among which were pikemen, swordsmen, around 100 musketeers and working cannons. In October 2008 the event was held for a second time, this time featuring more than 600 reenactors from France, Germany, England, Scotland, the Czech Republic and the Netherlands. The 2008 event included cavalry, 21 working cannons and more than 250 musketeers. The 'Grols Kanon', left behind as a gift to the people of Grol by Frederik Hendrik in 1627, was also used. The Montferland folk music group 'Het Gezelschap' even composed the song \"Grol\" as a theme song for the 2008 event. In the streets of Groenlo itself a 17th-century atmosphere is recreated, with beggars, street rascals, lepers, musicians and artisans. More than 30,000 people came to visit the 2008 event, and it was thus decided by the organizers to hold it every two years. The 2014 event was delayed till 2015 so that the beer maker Grolsch could celebrate their 400th anniversary, as the brewery started in 1615 in Groenlo. The latest re-enactment was October 2024. The next re-enactment is scheduled for 2027 (skipping 2026) to coincide with the 400th anniversary of the siege.\nNotes\nExternal links\n*[http://www.slagomgrolle.nl www.slagomgrolle.nl] (en)(nl)(de)\n*[https://web.archive.org/web/20110724165742/http://www.streekgids.nl/nieuws/lokaal/6632/Grolle-weer-in-Staatse-handen--foto-s.shtml Impressions of the Slag om Grolle 2008 (Streekgids.nl)]\n*[https://web.archive.org/web/20110724171342/http://angel.tctubantia.nl/tctubantia/tc/img/Groenlo/Grolle.htm Impressions of the Slag om Grolle 2005]"
    }
  ]
}