{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Laguna Limpia\n\nThe Battle of Laguna Limpia, was part of the Argentine Civil Wars. It happened in the southwest of the Corrientes Province, Argentina on 4 February 1846, when the army under Entre Ríos Province governor Justo José de Urquiza, defeated and captured the commander of the vadvanced columns of Corrientes' army, Juan Madariaga.\nAntecedents\nSince 1839 Corrientes province had rebelled against the authority of the central government in Buenos Aires, Juan Manuel de Rosas.\nGovernor Joaquín Madariaga gave command of his provincial army to general José María Paz, who in 1841 had obtained an impressive victory at the Battle of Caaguazú in Corrientes. Paz organized his forces and when the governor of Entre Rios invaded, he set a trap in the extreme north of the Iberá Wetlands.\nMadariaga realized that to get the enemy to the trap, he had to get Urquiza to the other side of the province, leaving all of Corrientes in the enemy's hands, with thesubsequent suffering of the local population, so he decided to fight a guerrilla war instead.\nThe battle\nUrquiza moved swiftly through the territory and reached him at the swamp on 4 February forcing the battle.\nThe terrain was favorable to Madariaga's forces but he did not take enough advantage of his tactical situation, and the funnel created to single out the enemy became a narrow passage for his own forces in retreat at his loss.\nCorrientes had more than 160 dead, and many prisoners, including Madariaga, whose horse stumbled on a fallen tree trunk. Along with the general the enemy captured his mail, which enabled Urquiza to learn that general Paz was planning to march to the North.\nConsequences\nUrquiza marched North, looting the ranches along the way, and before confronting Paz, he wandered around the province looting a good portion of it.\nPaz's image and prestige was seriously damaged upon the effects of the lost campaign. Urquiza took advantage to propose an accord using Madariaga as a conduit, when he set him free.\nAfter the signature of the Treaty of Alcaraz and its rejection by Rosasthe situation would be resolved the following year at the Battle of Vences, which would signal the end of Corrientes Province's rebellion.\nBibliography\n*\n*"
    }
  ]
}