{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Malka Nidzhe\n\n*\n*\n}}\n|combatant2=\n|commander1= Victor Cordonnier Pavle Jurišić Šturm\n|commander2= Todor Mitov\n* Stefan Tasev\n}}\n|strength1=Unknown\n|strength2=\n|casualties1=Unknown\n|casualties2=\n|campaignbox=\n}}\nThe Battle of Malka Nidzhe (), also known as the  Battle of Gornichevo was the opening battle of the Monastir Offensive. It lasted for three days and ended in victory for the Entente forces.\nBackground\nIn August 1916, the fighting on the Balkans took a new turn with the involvement of Romania in the Great War. Concerned with this turn of events, the Bulgarian high command convinced its German equivalent that a demonstration of force was necessary on the Macedonian front to shorten the Central Powers front line and carry out a preemptive strike against the Entente forces in Salonika that were preparing an offensive of their own, hoping to assist Romania. So on 17 August, the Bulgarian First Army began the Chegan Offensive and took Lerin but, after ten days of fighting, failed to achieve its objectives. On 27 August, the operation was called off, and the army was ordered to dig in on the positions between Lake Petursko, Lake Ostrovo and along the ridge of the Malka Nidzhe mountain it had occupied.\nPrelude\nThe Bulgarian forces in the occupied areas constituted the right wing of the Bulgarian First Army. These were the 3rd Infantry Brigade of the 6th Bdin Infantry Division, reinforced with the 3rd Cavalry Brigade, the 8th Tundzha Infantry Division and the 1st Infantry Brigade of the 3rd Balkan Infantry Division. In total, around 36 infantry battalions, 30 artillery batteries, 74 machine guns and ten cavalry squadrons. However, the front line, which had to be protected, was 79 kilometres, meaning it was generally thinly held. The army, as a whole, was operating in a mountainous region and lacking sufficient mountain artillery. The ratio of the field to mountain guns was 9 to 1.5.\nThe Entente forces consisted of the Serbian Third Army under the command of General Pavle Jurišić Šturm with the Vardar, Danube and Drina infantry divisions in the first line and the Morava Division in the second line. The Serbians were to deliver the main attack in the direction of Malka Nidzhe and Gornichevo. Directly opposing them on the  front were the 1st (23rd and 30th infantry regiments) and 2nd (10th Infantry Regiment) infantry brigades of the Bulgarian 8th Tundzha Division—10 and a half infantry battalions supported by 15 artillery batteries in the first line and the divisional reserve of three battalions (12th Infantry Regiment) in the second line.\nOn the southwest side of Lake Ostrovo were the forces of General Victor Louis Cordonnier which consisted of the two French divisions (156th Infantry Division, :fr:57e division d'infanterie) and supported by a Russian infantry brigade. Their objective was the Malareka Range. Opposing them on a  front were: three battalions, three artillery batteries and six cavalry squadrons in the first line, supported by another three and a half battalions and five artillery batteries in the second line. In addition, on the eastern side of Lake Ostrovo, between the two main Allied forces, was the Serbian Cavalry Division of four mounted and 12 dismounted squadrons.\nFor both directions of the Allied advance, the Bulgarians could also count on the army reserve of four and a half battalions and a single mountain artillery battery in the third line.\nBattle\nEarly in the morning on 12 September 1916, in the Malka Nidzhe sector, the Allied artillery began a preparatory artillery barrage against the two Bulgarian infantry brigades that were situated there. It continued, with varying intensity and accuracy, for almost the entire day. The Serbian infantry used this to approach the Bulgarian barbed wire on the right flank and achieve limited gains in the center of the line because the Bulgarian artillery prevented them from advancing further at that moment. The Bulgarian counterattack was delayed and was launched in the evening. It temporarily restored the Bulgarian positions, but under the heavy Allied artillery fire, the casualties (c. 400 killed, wounded or missing) were heavy, and the position soon became untenable.\nSimultaneously with the Serbian attack against Gornichevo, the French and Russians began their advance and quickly overran the first Bulgarian line forcing the forces there to retreat to the main defensive line on the  Malareka Ridge.\nOn 13 September, the Allied artillery continued its barrage, and the Serbs used their time only to get closer to the Bulgarian positions. By the end of the day, the Bulgarian soldiers had retired to their main defensive line on the Malka Nidzhe.\nOn 14 September, the Allied artillery fire began causing severe damage to some Bulgarian artillery batteries, decreasing their ability to support the Bulgarian infantry. The Serbian infantry began its attack at about 10 AM and managed to enter an 800-meter part of the front line between the 23rd and 30th infantry regiments, which were not fortified or guarded in sufficient numbers. The Bulgarian companies that were sent to plug the gap failed to halt them and soon began retreating together with other forces that were in the area. Even the troops serving the local Bulgarian artillery batteries were swept by the retreat and had to retire, leaving their damaged guns to the Serbs. This compromised the defence of the entire front line. By the evening, the Bulgarians had retired along the entire line in the direction of Banitsa and grouped around the divisional reserve (12th Infantry Regiment).\nMeanwhile, to the southwest, the French and Russians had not achieved a decisive breakthrough and were temporarily contained by the Bulgarian artillery. The Serbian success, however, threatened the flank of the Bulgarian forces on Malareka Ridge, and they also decided to retire.\nAftermath\nDuring the three days of fighting, the 1st and 2nd Brigade of the 8th Tudzha Division suffered an average of 21% casualties and abandoned many of their artillery guns, which further weakened them despite that they managed to retreat to a new position around Lerin. Their defeat forced the western parts of the right wing of the Bulgarian First Army also to retire and thus opened the way for further Allied attacks that would develop in the three-month-long Monastir Offensive.\nNotes\n*The numbers of the strength of the Bulgarian forces indicate the effective strength of the 1st and 2nd Infantry Brigades of the 8th Division deployed on the Malka Nidzhe Ridge against the Serbs. The same is true about the casualty figures. The divisional reserve (12th Infantry Regiment), which was not involved in the fighting until after the retreat, is not included.\nReferences\n*[https://web.archive.org/web/20200507233511/http://forum.boinaslava.net/showpost.php?p=259968&postcount=204%7C%D0%9F%D0%B5%D1%82%D1%8A%D1%80 Дошкинов. Боятъ на Малка Нидже 12–14.09.1916.Артилерийски прегледъ, година 5, кн. 7 и 8, януарий 1932]\n*[https://books.google.com/books?id=F3ZJAAAAMAAJ&q=macedonian+campaign+villari  Luigi Villari.The Macedonian campaign. T.F. Unwin Ltd., 1922]"
    }
  ]
}