{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Nuwakot\n\n| map_type          =\n| map_relief        =\n| map_size          =\n| map_marksize      =\n| map_caption       =\n| map_label         =\n| territory         = Nuwakot captured by the Gorkhas\n| result            = Gorkhali victory\n| status            =\n| combatant1        = Gorkha Kingdom\n| combatant2        = Kingdom of Kantipur\n| combatant3        =\n| commander1        = Prithivi Narayan Shah  Kalu Pande  Mahodam Kirti Shah\n| commander2        = Jaya Prakash Malla  Jayant Rana  Shankha Mani Rana\n| commander3        =\n| units1            =\n| units2            =\n| units3            =\n| strength1         = More than 1,300 soldiers\n| strength2         = Unknown\n| strength3         =\n| casualties1       =\n| casualties2       =\n| casualties3       =\n| notes             =\n| campaignbox       =\n}}\nThe battle of Nuwakot also called siege of Nuwakot or invasion of Nuwakot was fought in Nuwakot in 1744. Nuwakot was controlled by the Kingdom of Kantipur and it was an important location as it had a trade route to Tibet. The Gorkha Kingdom previously attacked twice by Nara Bhupal Shah and his son Prithvi Narayan Shah respectively. To prepare for the war Prithvi Narayan Shah visited Varanasi to get war materials, ammunition, acquire weapons, train the soldiers, and Pilgrims. He improved his army personnel and included people from any caste including the blacksmiths, cobblers, sweepers, Damai, and anyone who was bodied and physically fit was able to join the crew.\nThe Gorkha Kingdom attacked Nuwakot on 26 September 1744 as astrologer Kulananda Dhakal said it was the auspicious day for launching the attack. The day before, Shah commanded Kaji Kalu Pande to be ready for a strike. The Gorkhas, got together with their weapons, and the king split the army into three groups. Gorkha won the battle on 1 October 1744.\nBackground\nNuwakot was controlled by the Kantipur (known today as Kathmandu) after king Ratna Malla annexed it. Nuwakot was an important location for Kantipur as it had a trade route to Tibet and it was the western gate to the Nepal Valley. Gorkha was a petty kingdom in the confederation of Chaubisi rajya (24 principalities), located in present-day western Nepal founded by the brother of Narahari Shah of Lamjung, Dravya Shah, in 1599. Later Ram Shah became the king of Gorkha and expanded the borders of the kingdom through marriage and wars. In 1739, Nara Bhupal Shah signed a peace treaty with Lamjung which made the east flank safe with plans to capture Nuwakot. After the treaty, Maheswor Pant and Kaji Jayant Rana Magar of Gorkha  were commanded to attack Nuwakot, however, they were defeated. Upon defeat, the blame was put on Jayant Rana Magar by Nara Bhupal. Jayant Rana Magar was stripped of his titles position and he went to Kantipur to seek shelter. Jaya Prakash Malla of Kantipur appointed him to defend attacks from Gorkha as former Kaji of Gorkha Jayanta Rana Magar had inside information on their strengths and weaknesses.\nLater Prithvi Narayan Shah ascended as the King of Gorkha after the death of his father. Upon being crowned, he started to prepare for a war against Nuwakot. Shah made Gorkha Bhardars Biraj Thapa Magar the commander. As he did not want to make the same mistake as Jayant Rana Magar, so the troops stayed camped at Khimchet. Nobles, and Bhardars who supported Maheswor Pant criticised that Biraj Thapa Magar was a coward for spending a long time to attack. They incited Prithvi Narayan Shah by telling him that he could capture Nuwakot by mounting an attack. So, he sent another force led by Pant who reached the Trishuli River and they climbed the steep slope but Kantipur soldiers had planned that to let the forces climb the hill so they could unexpectedly mount an attack against the Gorkhalis. When the soldiers climbed the hill, Mallas aggressively attacked them and defeated them. Shah realised he needed more military technology and manpower to capture Nuwakot.\nPreparations\n|left]]\nTo prepare for the war, Prithivi Narayan Shah visited Varanasi to get war materials, ammunition, acquire weapons, train the soldiers, and Pilgrims. Shah hired some people to drill and practice his soldiers and with the help of craftsman he availed himself to make gunpowder, arrows, shafts, Khundas (sword), and Khukuris. He increased the military personnel and gave them proper training to make them more efficient. The army included people from any caste including the blacksmiths, cobblers, sweepers, Damai, and anyone who was bodied and physically fit was able to join the crew.\nShah began to set up friendly relations with neighbouring kingdoms due to the danger to Gorkha if he attacked Kantipur. He also sent messengers to ask for assistance in his attempt to capture Nuwakot, Chaubisi Rajyas and others rejected to provide military aid but Kingdom of Lamjung established a friendship with Gorkha. Shah and king of Lamjung signed an agreement that stated that they would attack when Gorkha moves towards the east of Nuwakot. After winning over the Nepal Valley, Gorkhali king would provide Lamjung one lakh twenty thousand mohars. Shah undertook to receive war materials, increasing the manpower, and getting support from the people for the imminent war.\nBattle\n]]\nIn September 1744, Kulananda Dhakal, an astrologer was ordered by the king to find the auspicious hour to go to war with Nuwakot. Before going to war, Prithivi Narayan Shah, tasked trusted noble Bhardars and commanders to manage the state affairs. The same month, the Gorkha Kingdom with advisers, king, and 1,300 soldiers went to invade Nuwakot. Shah had desired to invade Nuwakot in the wet season because the opponent would not except any attack during the season. The Gurkha troops disguise themselves as farmers to make the impending battle a secret, and they get to the shores of the Trishuli River. Upon getting to Khimchet, the troops faked making a canal from the river to a field, and the opponent did not understand the motive of these farmers. The army led by Shah arrived from Borlang, Charange, Tambai, to Khimchet in the fourth day, and they waited at Khimchet for the auspicious day to attack. For the time being, king Prithivi Narayan Shah wrote a letter to commander Jayanta Rana Magar to join Gorkha, mentioning his ex-relations, however, he declined to join his side, adding \"I am yours, but I have already eaten the salt of Jaya Prakash. Now I would die for him\".\nPrithivi Narayan Shah assigned a Jaisi Brahmin, Kalu Adhikari, to perform a Tantric ritual which included burying a nail to opponent's soil believing that they could win the battle. Adhikari arrived at Nuwakot by pretending that he had left Gorkhas and came there to seek asylum, and he was granted a shelter. Later, he buried a nail at Mahamandal during the auspicious time, then Adhikari went back to Gorkha, who were impressed by this. The enemies became aware of an incoming attack, Jayanta Rana Magar, assigned his son Shankha Mani Rana Magar to defend Mahamandal and Nuwakot, and he went to Kantipur to get more soldiers. At the same time, Prithivi Narayan Shah was trying to find where to launch an attack, not to repeat the past mistake, by crossing Trishuli River Bridge. He found Shubha Ghat to attack from as it was easier to go up to the hill to reach Mahamandal and it couldn't bee seen by much people from Nuwakot. Jaluwa Manjhi, concurred with Gorkhas to ferry them across the river.\nKulananda Dhakal informed Shah that the 26th of September was the auspicious day for launching the attack. Day before, Shah commanded Kaji Kalu Pande to be ready for a strike, the Gorkhas, got together with their weapons, and the king split the army into three groups. The king told them to mount an attack from three directions. There was a chance that Nuwakot defenders would not be aware of an incoming attack if Gorkhas launched from the north and northeast since they believed that west and south were the suitable directions for an attack. Prithvi Narayan Shah planned to surprise them by attacking from an unanticipated way, he told the first group to go to Mahamandal through northeast route by using Gorkhu, the second group to attack Mahamandal from Dharampani, and the third group to assault Nuwakot directly from using Tindhare route.\n|200px]]\nKalu Pande, Chautaria Mahodam Kirti Shah, and Prithivi Narayan Shah led the first to third groups, respectively. Three groups met at Shubha Ghat, Jaluwa Manjhi, transported them across the Trishuli River, the force also included the brother of the king Dal Mardan Shah, royal preceptor, priest and astrologers, who were given weapons. Nuwakot was guarded by few soldiers but they were on the alert to fight back the Gorkhali forces and they were on defensive positions. They did not have much advanced war materials, only a few guns, and they had the traditional weapons like bow and arrows, Khundas, swords, and spears. This was because it was hard to obtain guns and ammo and thus they were used in small quantities. Indra Jātrā, one of the biggest festival, was being celebrated by the people of Kantipur and consequently, Jayant Rana, did not get any troops.\nOn 26 September 1744, the first group climbed up the hill to reach Mahamandal from the north, when soldiers of Nuwakot were sleeping. Kalu Pande launched an unexpected attack so they could not counter-attack, and capture or kill commander of Nuwakot Shankha Mani Rana Magar who commanded deepeners initially. When Gorkhali arrived at Mahamandal, they jumped at defenders and yelled battle cry \"Jai Kali\", \"Jai Gorakhnath\", and \"Jai Manakamana\". The defenders started to run away without fighting back as they were unprepared, seeing this, Shankha Mani Rana Magar, motivated them to attack but they did not listen. Remarkably, wounded\nSankha Mani Rana Magar charged the Gorkhali soldiers with a sword then they surrounded him, and he challenged Dal Mardan Shah. Shah chopped his head off and more soldiers fled to Belkot after witnessing their commander's death. Many defenders and some Gorkhali soldiers also died on the spot. Many praised Dal Mardan Shah as the victory was decided by the death of a commander. The second group led by Mahodam Kirti Shah became victorious as defenders ran away and some dying. Prithivi Narayan Shah's group received a message saying that Mahamandal was captured thus the king went to attack the fort, Nuwakot Gadhi. The fort defenders could not resist the attack by the Gorkhali in the darkness and rather than fighting they fled to Belkot as well since they already received the news about the death of their commander Sankha Mani Rana Magar. On 1 October 1744, Gorkhalis won the battle. Kalu Pande with Ashok Bari, and Mahodam Kirti Shah arrived at the fort, the king went inside of the fort then inside of the palace with advice of astrologers. He also gathered his soldiers and they went to Nuwakot Bhairavi to esteem the deity. Few days later, in the Battle of Belkot, Jayanta Rana Magar was captured, imprisoned, and was skinned alive with people from Nuwakot, and Gorkha spectating his death.\nSee also\n* Unification of Nepal\n* Battle of Kathmandu\n* Battle of Kirtipur\nReferences\nBibliography\n*\n*\n*\n*\n*\n*"
    }
  ]
}