{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Solway Moss__disambig_1\n\n|result=English victory\n|combatant1=  Kingdom of Scotland\n|combatant2=  Kingdom of England\n|commander1=Robert, Lord Maxwell,Sir Oliver Sinclair\n|commander2=Thomas, Lord Wharton,Sir William Musgrave,John Musgrave\n|strength1=15,000–18,000\n|strength2=3,000\n|casualties1= 20 killed; 1,200 prisoners;hundreds drowned\n|casualties2= 7 killed\n|campaignbox=\n|}}\nThe Battle of Solway Moss took place on Solway Moss near the River Esk on the English side of the Anglo-Scottish border in November 1542 between English and Scottish forces.\nThe Scottish King James V had refused to break from the Catholic Church, as urged by his uncle King Henry VIII, who then launched a major raid into south-west Scotland. The Scottish army that marched against them was poorly led and organised, and many Scots were either captured or drowned in the river. News of the defeat is believed to have hastened the early death of James V.\nBackground\nWhen Henry VIII of England broke from the Roman Catholic Church, he asked James V of Scotland, his nephew, to do the same. James ignored his uncle's request and further insulted him by refusing to meet with Henry at York. Furious after the defeat of his forces at Hadden Rig, Henry VIII sent troops led by Thomas Howard, 3rd Duke of Norfolk against Scotland. In retaliation for the massive English raid into Scotland, James assigned Robert, Lord Maxwell, the Scottish Warden of West March, the task of raising an army.\nJames wrote to Pope Paul III on 9 November 1542 about the English raid, and explained that he had defied Henry's attempts to convert him to the Protestant faith by waging war with his vast resources gained from the dissolution of the monasteries. The Earl of Angus wrote that Cardinal Beaton and the Earl of Moray had intended to follow the Scottish army into England at the East March and serve a papal interdict in English churches.\nAn order for the muster of Scottish forces at the Kirk of Morton (near Bogrie, in Scotland) before dawn on 22 November survives. Men from Dumfries, Peebles, Selkirk, and Hawick were summoned. The note mentions their routes; from Dumfries to Hoddom and Kirkconnel tower in Ecclefechan; from Peebles to Moffat; from Selkirk to Eskdalemuir.\nBattle\nOn 24 November 1542, an army of 15,000–18,000 Scots advanced into England. Lord Maxwell, though never officially designated commander of the force, declared he would lead the attack in person. A report of George Douglas of Pittendreich, who was not present, and some later chronicle accounts, say that in the absence of Maxwell, Oliver Sinclair, James V's favourite, declared himself to be James's chosen commander. According to this account of the battle, the other commanders refused to accept his command and the command structure disintegrated. The English commanders, Lord Wharton and Sir William Musgrave, made reports of the battle. Musgrave stated that Maxwell was still in charge and fought with the rest of the Scottish nobles, who were forced to dismount on the bank of the River Esk.\nThe Scots' advance into England was met near Solway Moss by Lord Wharton and his 3,000 men. The battle was uncoordinated and may be described as a rout. Sir Thomas Wharton described the battle as the overthrow of the Scots between the rivers Esk and Lyne. The Scots, after the first encounter of a cavalry chase at \"Akeshawsill\", now Oakshawhill, moved \"down\" towards Arthuret Howes. They found themselves penned in south of the Esk, on English territory between the river and the Moss (a peat bog), and after intense fighting surrendered themselves and their 10 field guns to the English cavalry. Wharton said the Scots were halted at the Sandy Ford by Arthuret mill dam. The Scots were 'beguiled by their own guiding', according to one Scottish writer. Several hundred of the Scots may have drowned in the marshes and river.\nJames, who was not present at the battle (he had remained at Lochmaben), withdrew to Falkland Palace, humiliated and ill with fever. The news that his wife had given birth to a daughter instead of a son further crushed his will to live, and he is reported to have stated that the House of Stewart \"came with a lass and will go with a lass\". He died at Falkland two weeks later at the age of thirty. According to George Douglas, in his delirium he lamented the capture of his banner and Oliver Sinclair at Solway Moss more than his other losses.\nAftermath\nGervase Phillips has estimated that only about seven Englishmen and 20 Scots were killed but 1,200 Scottish prisoners were taken, including Sinclair, the Earls of Cassilis, Glencairn, and Maxwell. Prisoners taken to England included Lord Gray and Stewart of Rosyth. A number of the Scottish earls, lords, and lairds were released; they sent hostages, called 'pledges', to England in their place. On 14 December 1542, Thomas Wharton's report of the battle was read to the Privy Council, and they ordered that Scottish prisoners entering London should wear a red St Andrew's cross. Among the captured guns were four falconets with the cast cipher of 'JRS' for 'Jacobus Rex Scotorum' and the Scottish royal arms with an imperial crown.\nEustace Chapuys reported that the Scottish prisoners attended Henry's court on Christmas Day wearing swords and dirks. They were able to talk to the French ambassador, and Henry gave them each a present of a gold chain. These hostages and prisoners were mostly well treated in England, as it was hoped that when they returned to Scotland after their ransoms had been paid, they would further the English cause. Some of the high-ranking prisoners taken at the battle were exchanged for their 'pledges' at Carlisle on 10 January 1543. Chapuys said the return of some prisoners was prevented at this time by the Scottish government, which claimed they were traitors for losing the battle, or suspected they were now being influenced by Henry. As their families were arrested, these prisoners could not provide their pledges and stayed on the border at Berwick-upon-Tweed.\nHowever, a modern historian Marcus Merriman sees the battle and hostage-taking more as the culmination of James V's war rather than the beginning of Henry VIII's War of Rough Wooing (also known as the Nine Years' War). He notes that the capture of so many Scottish nobles at the time of the birth and accession of Mary, Queen of Scots, did not affect Henry's policy or the Scottish lords' subsequent rejection of the Treaty of Greenwich in December 1543.\nSchedules of prisoners, keepers, and pledges\nThe chief Scottish prisoners were taken to Newcastle upon Tyne, and were listed with their English keepers at that time in a schedule prepared by Sir Thomas Wharton; below the keepers of their substitute 'pledges' or hostages are added from a list compiled later in 1543 amongst the papers of the Earl of Shrewsbury.\n* James Douglas of Drumlanrig; keeper, the Master Customar of Carlisle.\n* John Maxwell of Cohill; keeper, William Sandes; pledge, Archibald Maxwell, his brother, a child, in Yorkshire.\n* James Sinclair; keeper Alexander Musgrave; pledge, as for Oliver Sinclair.\n* John Charteris; keeper, William Porter\n* Robert Charteris; keeper, John Wharton\n* John Maxwell, brother of Lord Maxwell; pledge, his nephew Hugh Maxwell in Yorkshire.\n* Patrick Hepburn; keeper Lionel Carnaby\n* Walter Ker, laird of Graddon; keeper Thomas Denton; his pledge with Sir William Gascoigne, senior.\n* George Hume, laird of Ayton; keeper Thomas Warcup\n* Laird of Awncastell (John Maitland, laird of 'Awik Castle', Annan); keeper Simon Musgrave; pledge, his brother with Thomas Wentworth.\n* William, Earl of Menteith; keeper Lancelot Lancaster.\n* Robert Erskine, son of Lord Erskine; keeper Edward Aglionby.\n* Patrick, Lord Gray; keeper Walter Strickland; pledges with the Archbishop of York.\n* Laurence, Lord Oliphant: keeper Sir John Lowther; pledges with the Bishop of Durham.\n* Oliver Sinclair: keeper Sir John Lowther: pledge, son of the Laird of Cleisburn\n* Hugh, Lord Somerville; keeper Sir Thomas Curwen\n* Malcolm, Lord Fleming; keeper Sir William Musgrave. Deceased when the Talbot-Shrewsbury papers list was compiled.\n* Gilbert Kennedy, Earl of Cassilis; keeper Sir Thomas Wharton: pledge with Archbishop of Canterbury.\n* Lord Maxwell; keeper Sir Thomas Wharton; remained at Carlisle in person.\n* William Cuninghame, 4th Earl Glencairn, keeper Duke of Norfolk\nIn March 1544, as the War of Rough Wooing or Nine Years' War commenced in earnest, Henry VIII sent the Richmond Herald, Gilbert Dethick, to the Privy Council of Scotland at Stirling Castle to demand the return to England of a number of those high-ranking prisoners who had been allowed to go home on licence. These were: the Earls of Cassilis and Glencairn, Lords Somerville, Maxwell, Gray, Oliphant, and Fleming, with Oliver Sinclair, George Hume of Ayton, Robert Master of Erskine, William Seton, Patrick Hepburn, James Pringle, James Sinclair, Alexander Sinclair, John Maitland of Awencastle, Henry Maxwell brother of lord Maxwell, John Ross of Craigie, the laird of Moncrieff, John Leslie younger son of the earl of Rothes, and John Carmichael. If the council did not organise their return, Henry threatened revenge on their pledges in England, and penalties on future captives.\nCommemoration\nThe battlefield is registered by English Heritage, and currently under research to be inventoried and protected by Historic Scotland under the Scottish Historical Environment Policy of 2009.\nNotes\nFurther reading\n* Makinson, Albert. \"Solway Moss and the Death of James V\" History Today, 19:2 (February 1960), pp. 106–115.\n* Sinclair, George A. \"The Scots at Solway Moss.\" Scottish Historical Review 2.8 (1905), pp. 372–377. .\n* Bain, Joseph, [https://archive.org/details/cu31924091786032 Hamilton Papers, vol. 1 (London, 1898)], pp. lxxiii–lxxvi.\n* Cameron, Jamie, James V, The Personal Rule (East Linton: Tuckwell, 1998), pp. 314–322\n*\n* , ed. Thomas Thomson, Bannatyne Club (Edinburgh, 1833), 25.\n* Phillips, Gervase, The Anglo-Scots Wars, 1513–1550, (Boydell Press, 1999),\n* , 1542, vol. 17 (1900)\n* Way, Albert, Proceedings of the Society of Antiquaries Scotland, vol. 2 (1855–6), 238–42,\n* State Papers of Henry VIII, vol. 5 (part IV part 2), Record Commission (London, 1836)\nExternal links\n* [http://www.everything2.com/index.pl?node_id=1764167 Battle of Solway Moss] @ Everything2\n* [http://www.english-heritage.org.uk/caring/listing/battlefields/battle-of-solway-moss English Heritage, Solway Moss in the Battlefields Register, with link to map of designated area]\n* [http://www.english-heritage.org.uk/content/imported-docs/p-t/solway.pdf English Heritage battlefield report: Solway Moss (1995)]"
    }
  ]
}