{
  "content": [
    {
      "type": "text",
      "text": "# Battleground (2015)\n\n|buyrate    = 76,000 (excluding WWE Network views)\n|venue      = Scottrade Center\n|city       = St. Louis, Missouri\n|wwenlast   = The Beast in the East\n|wwennext   = NXT TakeOver: Brooklyn\n|event      = Battleground\n|lastevent2 = 2014\n|nextevent2 = 2016\n}}\nThe 2015 Battleground was a professional wrestling pay-per-view (PPV) and livestreaming event produced by WWE. It was third annual Battleground and took place on July 19, 2015, at the Scottrade Center in St. Louis, Missouri. This was the last Battleground event to be held before the reintroduction of the brand extension in July 2016.\nSeven matches were contested at the event, including one on the Kickoff pre-show. In the main event, the WWE World Heavyweight Championship match between defending champion Seth Rollins and Brock Lesnar ended in a disqualification when The Undertaker made his unexpected return (and his first appearance on pay-per-view in WWE since WrestleMania 31) and attacked Lesnar. This was initially reported as a \"no contest\", but the following night on Raw, Lilian Garcia announced Lesnar as the winner by disqualification, though Rollins remained champion as titles do not change hands by disqualification unless stipulated. The event received 76,000 buys (excluding WWE Network views), slightly down on the previous year's 99,000 buys.\nProduction\nBackground\nin St. Louis, Missouri.]]\nBattleground was an annual July professional wrestling event established by WWE in 2013, although the original event was held in October. The 2015 event was the third Battleground and was held on July 19 at the Scottrade Center in St. Louis, Missouri. The event aired on pay-per-view (PPV) worldwide and was livestreamed on the WWE Network. To further promote the WWE Network, the promotion advertised their 30-day free trial period for the Network, with the 2015 Battleground PPV included in that free trial for new subscribers.\nStorylines\nThe event comprised seven matches, including one of the Kickoff pre-show, that resulted from scripted storylines. Results were predetermined by WWE's writers, while storylines were produced on WWE's weekly television shows, Raw and SmackDown.\nAt Money in the Bank, Seth Rollins defeated Dean Ambrose in a ladder match to retain his WWE World Heavyweight Championship. On the June 15 episode of Raw, The Authority reinstated Brock Lesnar, who returned to WWE and invoked his rematch clause (after losing the championship to Rollins at WrestleMania 31) to face Rollins at Battleground for the championship. On the July 6 episode of Raw, Lesnar attacked Rollins' bodyguards J&J Security (Jamie Noble and Joey Mercury), breaking Noble's arm with a Kimura lock and executing a belly-to-belly suplex on Mercury onto a car's windshield. This infuriated Rollins, who said Lesnar had no respect for other people's belongings and that at Battleground, Rollins was going to burn \"Suplex City\" to the ground. During the contract signing on the July 13 episode of Raw, Lesnar thwarted Rollins and Kane's attempt to attack him, ending with Lesnar breaking Kane's ankle with the steel steps. After Lesnar had left, Rollins proceeded to stomp on Kane's injured ankle, while shouting at him.\nOn the May 21 episode of SmackDown, Bray Wyatt was defeated by Dean Ambrose, after Roman Reigns interfered in the match with a Superman punch on Wyatt. On the June 1 episode of Raw, Reigns defeated Wyatt to retain his spot in the Money in the Bank ladder match. At Money in the Bank, Wyatt knocked Reigns off the ladder right before Reigns could grab the Money in the Bank briefcase. During the event, Reigns was scheduled to face Wyatt at Battleground.\nAt Money in the Bank, Big Show defeated Intercontinental Champion Ryback by disqualification after The Miz attacked Big Show; therefore, Ryback still retained the title. On the June 15 episode of Raw, Miz defeated Big Show by count-out as Big Show was distracted confronting Ryback. On June 22, Ryback was scheduled to defend the title against Big Show and Miz in a triple threat match at the event. However, Ryback sustained an injury during his match on the July 13 episode of Raw and was declared unable to compete; the match was postponed.\nAt Money in the Bank, The Prime Time Players (Darren Young and Titus O'Neil) defeated The New Day (Big E and Xavier Woods) (with Kofi Kingston) to win the WWE Tag Team Championship. On the June 15 episode of Raw, The Prime Time Players and Neville defeated The New Day. On June 22, The Prime Time Players were scheduled to defend the titles against The New Day at the event.\nAt Elimination Chamber, NXT Champion Kevin Owens defeated United States Champion John Cena. At Money in the Bank, Cena defeated Owens in a rematch. On the June 15 episode of Raw, Owens challenged Cena to a match at Battleground for the United States Championship, which Cena accepted a week later.\nAt Money in the Bank, Sheamus won the eponymous ladder match for a WWE World Heavyweight Championship match contract. On the June 15 episode of Raw, Randy Orton, who also participated in the match, attacked Sheamus after his match against Dean Ambrose. Sheamus later attacked Orton during his match against Kane. On the July 6 episode of Raw, Orton returned and attacked Sheamus, after his match against Roman Reigns. On July 13, it was announced on WWE.com, Orton would face Sheamus at the event.\nAt Elimination Chamber, R-Truth eliminated King Barrett during the Elimination Chamber match for the Intercontinental Championship. On the Money in the Bank Kickoff pre-show, Truth defeated Barrett. In the following weeks, Truth mocked Barrett, wearing his royal crown and cape. On the July 6 episode of Raw, Barrett defeated Truth. The following week, Truth defeated Barrett. A third match was then scheduled for the Battleground Kickoff pre-show, with Barrett's King of the Ring crown on the line.\nEvent\n{|class=wikitable style=\"font-size:90%; margin: 0.5em 0 0.5em 1em; float: right; clear: right;\"\n|+ Other on-screen personnel\n!|Role:\n!|Name:\n|-\n|rowspan=3|English Commentators\n|Michael Cole\n|-\n|Jerry Lawler\n|-\n|John \"Bradshaw\" Layfield\n|-\n|rowspan=2|Spanish Commentators\n|Carlos Cabrera\n|-\n|Marcelo Rodriguez\n|-\n|Backstage interviewer\n|JoJo\n|-\n|Ring announcer\n|Lilian Garcia\n|-\n|rowspan=7|Referees\n|Mike Chioda\n|-\n|John Cone\n|-\n|Jason Ayers\n|-\n|Darrick Moore\n|-\n|Dan Engler\n|-\n|Ryan Tran\n|-\n|Rod Zapata\n|-\n|rowspan=4|Pre-show panel\n|Renee Young\n|-\n|Booker T\n|-\n|Byron Saxton\n|-\n|Corey Graves\n|}\nPre-show\nOn the Battleground Kickoff pre-show, King Barrett defended his King of the Ring crown in a match against R-Truth. Barrett pinned R-Truth after a Bull Hammer.\nPreliminary matches\nThe actual pay-per-view opened with Randy Orton facing Sheamus. Towards the end of the match, Sheamus executed a Brogue Kick on Orton, but could not capitalize. Sheamus countered Orton's attempted RKO into the Texas Cloverleaf but Orton broke the hold by reaching the ropes. When both men had regained their composure, Orton executed an RKO and scored a pinfall to win the match.\nIn the second match, The Prime Time Players (Darren Young and Titus O'Neil) defended the WWE Tag Team Championship against The New Day (Big E and Kofi Kingston). O'Neil executed a Clash of Titus on Big E and scored the pinfall, thus winning the match for his team.\nThe match between Bray Wyatt and Roman Reigns was a vicious back-and-forth with a lot of reversals and signature moves. In the end, a hooded person attacked Reigns with a Superkick, which then allowed Wyatt to execute Sister Abigail for the win. The hooded person was unveiled as Luke Harper, indicating a Wyatt Family reunion.\nNext followed an impromptu match between Charlotte (representing Team PCB), Brie Bella (representing Team Bella) and NXT Women's Champion Sasha Banks (representing Team BAD). Charlotte won the match by making Brie submit to the Figure Eight Leglock.\nIn the fifth match, John Cena defended the WWE United States Championship against Kevin Owens. Like their previous two encounters, this was another vicious back-and-forth. During the match, Owens kicked out of three Attitude Adjustments, including one from the top rope. Cena kicked out of two powerbombs, Owens executed an Attitude Adjustment and applied the STF on Cena, but Cena managed to break the hold. In the end, Owens submitted to the STF, giving Cena the win.\nIn place of the cancelled WWE Intercontinental Championship match, The Miz bragged about being the toughest person and Intercontinental Champion Ryback being scared of him. Big Show showed up moments later and knocked out Miz.\nMain event\nIn the main event, Seth Rollins defended the WWE World Heavyweight Championship against Brock Lesnar (accompanied by Paul Heyman). Lesnar executed twelve German suplexes and one belly-to-belly suplex while Rollins managed to have some offense. In the end, Lesnar executed an F-5, but before the referee could count the pinfall, the lights went out. When the lights came back on, The Undertaker emerged and attacked Lesnar with a low blow, a chokeslam and two tombstone piledrivers. Rollins was disqualified, but retained the title.\nAftermath\nThe next night on Raw, The Undertaker explained his actions for attacking Brock Lesnar was for revenge, not because of Lesnar ending his Undefeated WrestleMania Streak at WrestleMania XXX, but because of the constant taunting and mockery of him and Lesnar's greatest achievement by both Lesnar and his advocate, Paul Heyman. On the same night, the two engaged in a vicious brawl which prompted half of the WWE roster and many security guards to separate the two. It was later announced on the same episode of Raw the two would face off in the main event at SummerSlam. At SummerSlam, The Undertaker won in a controversial ending by submission, leading to a final battle between the two in a Hell in a Cell match at Hell in a Cell, which Lesnar won to end their rivalry once and for all.\nOn the following night's Raw, John Cena confronted Seth Rollins over his cowardly tactics to retain the WWE World Heavyweight Championship, going as far as calling him a joke. Cena then challenged Rollins for the WWE World Heavyweight Championship that night which Rollins refused. The following week, Cena once again challenged Rollins for the title, but this time, The Authority denied his request and instead had him defend the WWE United States Championship against Rollins that night, which Cena retained, but received a legitimate broken nose in the process. After recovering, Cena would accept Rollins' challenge on the August 11 episode of Tough Enough to a Winner Takes All match at SummerSlam. At the event, Cena lost the United States Championship to Rollins thanks to interference from SummerSlam host Jon Stewart.\nLuke Harper's interference in Bray Wyatt's favor during his match with Roman Reigns led to Wyatt partly reuniting The Wyatt Family. On the following night's Raw, Reigns defeated Harper by disqualification after Wyatt attacked him leading to Dean Ambrose, who was in Reigns corner during the match to get involved in Reigns ongoing feud with The Wyatt Family. Reigns and Ambrose would defeat Wyatt and Harper in a tag team match at SummerSlam. This long lengthy feud between them went until Hell in a Cell, where Reigns defeated Wyatt in a Hell in a Cell match.\nThe Prime Time Players' (Darren Young and Titus O'Neil) reign as Tag Team Champions would come to an end at SummerSlam where they lost the WWE Tag Team Championship to The New Day (Big E, Kofi Kingston, and Xavier Woods) in a fatal four-way tag team match.\nRandy Orton's feud with Sheamus continued after Battleground, leading to a rematch at SummerSlam, where Sheamus defeated Orton to temporarily end their feud.\nThe 2015 Battleground was the final Battleground held before WWE reintroduced the brand extension the following year, where they again split their main roster into two separate brands, Raw and SmackDown, where wrestlers were exclusively assigned to perform and the WWE World Heavyweight Championship had already been renamed to the WWE Championship. The 2017 event was held exclusively for SmackDown, as although the 2016 event was the first WWE PPV held following the start of the brand extension, brand-exclusive PPVs did not begin until after the 2016 SummerSlam.\nResults\n|match1 = King Barrett defeated R-Truth by pinfall\n|stip1  = Singles match for Barrett's King of the Ring crown\n|time1  = 9:15\n|note1  = pre\n|match2 = Randy Orton defeated Sheamus by pinfall\n|stip2  = Singles match\n|time2  = 16:54\n|match3 = The Prime Time Players (Darren Young and Titus O'Neil) (c) defeated The New Day (Big E and Kofi Kingston) (with Xavier Woods) by pinfall\n|stip3  = Tag team match for the WWE Tag Team Championship\n|time3  = 8:50\n|match4 = Bray Wyatt defeated Roman Reigns by pinfall\n|stip4  = Singles match\n|time4  = 22:42\n|match5 = Charlotte (with Becky Lynch and Paige) defeated Brie Bella (with Alicia Fox and Nikki Bella) and Sasha Banks (with Naomi and Tamina) by submission\n|stip5  = Triple threat match\n|time5  = 11:30\n|match6 = John Cena (c) defeated Kevin Owens by submission\n|stip6  = Singles match for the WWE United States Championship\n|time6  = 22:11\n|match7 = Brock Lesnar (with Paul Heyman) defeated Seth Rollins (c) by disqualification\n|stip7  = Singles match for the WWE World Heavyweight Championship\n|time7 = 9:00\n}}\nReferences\nExternal links\n*"
    }
  ]
}