{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Forum Gallorum__disambig_1\n\ntemplate -->\n| result      = Senatorial victory\n| combatant1  = Roman Senate|\ncombatant2    = Mark Antony's forces|\ncommander1    = Gaius PansaAulus HirtiusOctavian|\ncommander2    = Mark AntonyMarcus Junius Silanus|\nstrength1     = Pansa:\n* 1 veteran legion\n* 4 legions of recruits\n* Minimal cavalry\nHirtius:\n* 1 veteran legion|\nstrength2     = Antony:\n* 2 veteran legions\n* A large cavalry force|\ncasualties1   = Pansa: heavyHirtius: light|\ncasualties2   = About half the force|\n}}\nThe Battle of Forum Gallorum was fought on 14 April 43 BC between the forces of Mark Antony and legions loyal to the Roman Senate under the overall command of consul Gaius Pansa, aided by his fellow consul Aulus Hirtius. The untested Caesar Octavian (the future emperor Augustus) guarded the Senate's camp. The battle occurred on the Via Aemilia near a village in northern Italy, perhaps near modern-day Castelfranco Emilia.\nAntony was attempting to capture the province of Cisalpine Gaul from its appointed governor, Decimus Brutus. Brutus was besieged by Antony in Mutina (modern Modena), just south of the Padus (Po) River on the Via Aemilia. The Roman Senate sent all its available forces to confront Antony and relieve Brutus. Hirtius and Octavian arrived near Mutina with five veteran legions, where they waited for Pansa, who was marching north from Rome with a further four legions of recruits. Antony had four veteran legions in addition to the troops that were besieging Mutina. Aware that he would soon be outnumbered, Antony sought to defeat his opponents in detail before they could link up. After failing to provoke a battle with Hirtius, Antony marched two of his legions between the two Senatorial armies and laid an ambush on Pansa's approaching recruits. Unknown to Antony, Pansa had already been joined by one of Hirtius' veteran legions and Octavian's praetorian cohorts.\nAntony's forces caught Pansa's army by surprise on a narrow road surrounded by marshes. A bitter, bloody battle ensued, in which Antony's II and XXXV legions defeated Pansa's troops and forced them to retreat southwards. Pansa himself was severely wounded. Antony called off the pursuit of Pansa's broken army and began marching his jubilant troops back towards Mutina. Hirtius then arrived from the north with a single veteran legion, which crashed into Anthony's exhausted troops, taking two Roman eagles and 60 standards. Antony's victory was turned into a major defeat; he fell back with his cavalry to his camp outside Mutina.\nAfter receiving a report of the battle, Marcus Tullius Cicero, a fierce adversary of the Antonian faction, pronounced in the Senate the Fourteenth Philippic, exalting the success and praising the two consuls and young Caesar Octavian. Nevertheless, the battle was not decisive and the campaign continued. The two armies fought again seven days later (21 April) at the Battle of Mutina, which forced Antony to abandon the siege of the city and retreat westward. Hirtius was killed in the fighting at Mutina; Pansa was still recovering from his wound at Forum Gallorum but died on 23 April in unexplained circumstances.\nBackground\nAfter the assassination of Julius Caesar, Antony's relations with Caesar's adoptive heir Octavian and the rest of the Roman Senate broke down. At the start of the War of Mutina in late 44&nbsp;BC, he moved to invest the homonymous city in an attempt to force Decimus Junius Brutus Albinus, the governor of Cisalpine Gaul, to give it up to him in accordance with an illegal law he had passed the previously that year in June.\nAt the start of 43&nbsp;BC, the moderate Caesarians Aulus Hirtius and Gaius Vibius Pansa became consuls. Through the early months of the year, Antony's relations with the Senate broke down. Supported by a heterogeneous coalition including Cicero, Octavian, and large potions of the Senate, the consuls were dispatched to relieve Decimus Brutus' forces at Mutina and go to war against Antony. The consuls marched north, joined by Octavian and his private army, which had been legitimised by a grant of imperium pro praetore.\nBattle\nMark Antony's plan of attack\nIn early March 43 BC, Hirtius and Caesar Octavian advanced along the Via Aemilia and reached Bononia; Mark Antony chose to fall back again. For the moment, he sought to strengthen the encircling front around Mutina to contain Decimus Brutus. In fact, neither Hirtius nor Octavian were seeking an immediate battle; they had two of Caesar's legions that had abandoned Antony and three legions of recalled veterans gathered by Octavian in Campania, but for the moment they were waiting for the other consul Vibius Pansa, who left Rome on 19 March, to return along the Via Cassia with four legions of recruits that had been quickly mobilized in January 43 BC.\nWhen Mark Antony became aware of the approach and imminent concentration of his enemies, he set out to take the initiative and move on to the attack as soon as possible. At first, Antony tried to hasten the battle and gain a decisive victory against the forces of Hirtius and Octavian. After leaving a part of his troops behind to detain Decimus Brutus at Mutina, he brought up the bulk of his forces, consisting of four veteran legions and large contingents of cavalry, near his two opponents' camp, harassing them with continuous skirmishes. Hirtius and Octavian, however, did not leave their camp but continued to await Pansa's arrival.\nMark Antony then decided on a new plan: having learned of the arrival of scouts from Vibius Pansa's legions along the Via Aemilia from Bononia, Antony thought he could easily attack and destroy them with his veterans. He also counted on the arrival of three legions from the south, recruited by his capable lieutenant Publius Ventidius Bassus from among Caesar's veterans settled in Picenum. Antony decided to leave part of his forces under the command of his brother Lucius Antonius to hold Decimus Brutus in check, and engage Hirtius and Octavian with a feigned attack on their camp, while moving against Pansa's troops under cover of darkness with his best legions.\nBecause of the uneven and marshy terrain near Forum Gallorum through which the antagonists would have to pass, Mark Antony could not deploy his excellent cavalry forces, but decided to attack by sending Legiones II Gallica and XXXV into the marshes and deploying his praetorian cohorts and those of Marcus Junius Silanus along the main road (Via Aemilia) over the marshy ground. The legionaries were deployed in the shelter of the reeds of the marshes at the point where the main road was narrowest; cavalry units and light infantry moved forward along the Via Aemilia to harry Pansa's troops and draw them into the trap.\nCaesar Octavian and Aulus Hirtius had expected the legions of Vibius Pansa to arrive before attacking the forces of Mark Antony. When they learned of the approach of the other consul's four legions, they attacked the legate Servius Sulpicius Galba, one of Caesar's killers, with the Caesarian veterans of the Legio Martia led by the energetic Decimus Carfulenus and the personal praetorian cohorts of Caesar Octavian and Aulus Hirtius. Carfulenus and Galba moved in the darkness eastwards along the Via Aemilia and passed through Forum Gallorum; Pansa and Carfulenus made a junction in the night of 14 April 43 BC and started marching at dawn along the road with the pugnacious Legio Martia, five cohorts of recruits, and the praetorian cohorts of Caesar Octavian and Hirtius. In the marshes on either side, the first signs of the enemy were spotted, and presently Antony's praetorian cohorts appeared to block the main road.\nBattle in the marshes\nThe Legio Martia and Vibius Pansa's recruits suddenly stood threatened in front of and alongside Antony's legions. The experienced legionaries did not lose their cohesion, but accepted battle after sending back the cohorts of recruits that were deemed unsuitable for the fight by the Caesarian veterans of the Martia. While the praetorian cohorts of Antony and Caesar Octavian fought sharply along the main road, the Martia veterans split into two parts and, under the command of Pansa and Carfulenus, ran into the marshes to join the battle. Carfulenus led eight cohorts of the Legio Martia into the swampy soil to the right of Via Aemilia, while in the marshes on the left side of the road, the consul Pansa commanded the other two cohorts of the legion, reinforced by Aulus Hirtius' praetorian cohorts. Mark Antony's veterans of Legio XXXV attacked the eight cohorts of the Martia while the entire Legio II moved against the two cohorts under the command of Vibius Pansa to the left of Via Aemilia.\n]]\nThe fighting between the Caesarian veterans of both parties was dramatic and bloody; in his history, Appian describes the particular bitterness of the two parties to a fratricidal struggle. Mark Antony's Caesarians were angry at the defection of the legionaries of the Legio Martia, now allied with the Senate, while the latter legion wanted to take revenge for the decimations and other punishments inflicted on them at Brundisium. Both sides believed that they could obtain a decisive victory, as the veterans' military pride increased the fury of the fight.\nThe clash between the Caesarian veterans on the two sides took place in a dark silence: without battle-cries or exhortations, the legionaries fought hand-to-hand in a frontal collision between their massed ranks in the swamps and valleys. The legionaries' fratricidal carnage was interrupted only by short breaks used to tighten their formations. The veterans knew their job well; without the need for encouragement, they continued the struggle with tenacity and obstinacy. The mutual slaughter with drawn blades impressed Pansa's inexperienced recruits, who watched the deadly and silent action of the Caesarian legionaries on both sides.\nThis fierce battle between the veterans continued in the swamps, initially without decisive results. On the right wing, the eight cohorts of the Legio Martia under the command of Decimus Carfulenus managed slowly to gain ground, while Antony's Legio XXXV gradually retreated in good order. On the left wing, on the other hand, the other two cohorts of the Legio Martia and the praetorian cohorts of Hirtius, under Pansa's command, first offered a stiff resistance but then began gradually to fold before Antony's entire Legio II. The battle finally turned to the favour of Antony's forces: in the centre along the Via Aemilia, Antony and Silanus' praetorian cohorts prevailed in a brutal clash with Caesar Octavian's praetorian cohorts, which were completely destroyed.\nIn the marshes to the right of the highway, the legionaries of the Martia, who were isolated some 500 paces in advance, were threatened by Antony's Moorish cavalry; Decimus Carfulenus had fallen mortally wounded, and the veterans began to fall back while still repulsing the cavalry's assaults. Exhausted, the legionaries of Antony's Legio XXXV did not at first pursue the retreating enemy. In the marshes to the left of the Via Aemilia, the consul Vibius Pansa suffered a serious injury while fighting on the line; his wound from a javelin shook the two cohorts of the Legio Martia. While the injured consul was transferred to Bononia, the Antonian veterans of Legio II finally put the two cohorts to flight; they now began to fall back in disorder, sowing panic in the ranks of Pansa's raw recruits, whose two legions had been kept far back in reserve. At the sight of the apparent collapse of the veterans of the Legio Martia, the new recruits scattered, falling back to camp in disorder.\nMark Antony's legionaries hastened to pursue the enemy, inflicting heavy losses on the veterans and new conscripts as they fled back towards their camp. The survivors of the Legio Martia actually remained outside the camp and by their presence dissuaded the Antonian legionaries from attacking further. The remnants of the Senatorial legions were virtually trapped inside their camps, and the Antonian veterans would likely force them to surrender in the event of prolonged siege, but Mark Antony was concerned about losing time, fearing that the situation would deteriorate in Mutina in case Hirtius and Octavian's legions sought to break his siege there. Antony therefore felt that he could not stay on the battlefield and decided to return with his forces to the city. In the afternoon, Antony's two victorious legions began to return westward along Via Aemilia in the direction of Mutina. The soldiers were tired but euphoric after apparently achieving a brilliant success.\nSecond phase\nVibius Pansa, while leading his recruits into battle in the marshes of Forum Gallorum, where he was later seriously injured, had at the same time sent messengers to the other consul, Aulus Hirtius, to inform him of the unexpected battle with the Antonians and their difficult situation. Hirtius was about sixty stadia () from the battlefield. He decided at once to march to Pansa's aid with the Legio IV Macedonica, the other Caesarian legion that had defected at Brundisium. These fresh troops moved quickly and, in the late afternoon of 14 April 43 BC, came unexpectedly into contact with the legions of Mark Antony who, exhausted after the tough battle, marched in the direction of Mutina in poor order and heedless of danger in their front.\nThe IV Macedonica led by Aulus Hirtius, experienced and well-rested, came to the attack in tight formation against Antony's disorderly and tired troops. Despite attempts at resistance and instances of bravery, the Antonian legions could not withstand the assault, but suffered heavy losses and disintegrated under the attacks of Hirtius' Caesarian. The Antonian legions scattered into the marshes and nearby forests; two eagles and sixty other standards were captured by their enemies. Only with great difficulty could Mark Antony rally the remnant with the help of the cavalry, which managed to round up the soldiers during the night and bring them back to camp near Mutina. Aulus Hirtius, hindered by darkness and wary of being lured into a trap, chose not to pursue the defeated Antonian legions. Thus ended the long battle of Forum Gallorum. The marshes were covered with arms, trunks, horse remains, corpses of legionaries of the two sides perceived in the alternate fights.\n, 1st century BC, archaeological museum of Aquileia ]]\nCaesar Octavian's direct role on the day of the battle, 14 April 43 BC, had been minimal. The propraetor held his ground with the other three legions available in their camps, busying themselves with checking and repulsing the faint diversionary attacks led by Lucius Antonius on his brother's instructions. Despite taking a lesser role than the two consuls Hirtius and Pansa, he was acclaimed as imperator on the field by his troops.\nAftermath and assessment\nAlthough the Battle of Forum Gallorum ended without a decisive victory for either of the two parties, at the end of the day, Mark Antony's bold plan had been foiled and the two consuls' Senatorial forces had reversed the disastrous outcome of their initial clash, thanks to the decisive intervention of Caesar's legionaries now serving Caesar Octavian—the famous \"heavenly legions\" exalted by Cicero. The fighting, however, was extremely fierce and bloody.  In the first phase, according to Appian, more than half of Vibius Pansa's forces and Octavian's entire praetorian cohort were destroyed by the Antonian veterans; the latter were then decimated in turn, losing half of their forces before finding escape in fields around Mutina. The losses to Aulus Hirtius' legion in the second phase were, however, light.\nThe first news of the battle that reached Rome of the battle was uncertain, provoking doubts and consternation among the Republican Senators grouped around Cicero. The letter sent by Aulus Hirtius with the news of the triumphant victory and a personal account by Servius Sulpicius Galba, addressed to Cicero, raised morale and aroused euphoria among Antony's Senatorial enemies. After a few days, on 21 April 43 BC, Cicero pronounced in the Senate the triumphalist Fourteenth Philippic, in which he exalted the victory, called even for fifty days of public thanksgiving, and praised above all the two consuls Aulus Hirtius and Vibius Pansa, while somewhat minimizing the contribution by Caesar Octavian. During the session, Cicero also gave the news of Vibius Pansa's injury, but the latter's life did not seem to be in danger. On the morning of 23 April, however, the consul died in circumstances that have never fully been explained. His doctor Glyco was briefly arrested on suspicion of poisoning Pansa, and the rumour spread, later recorded by some ancient historians such as Suetonius and Tacitus, that Octavian had been directly responsible for the sudden death of the consul, whose wound had not seemed serious.\nOn 21 April 43 BC, while Cicero pronounced his last invective against Antony, the Battle of Mutina was bitterly joined. That engagement decided the outcome of the Mutina campaign through the victory of the coalition between the republicans and Octavian's Caesarians, the death of the other consul Hirtius, and the definitive retreat of Mark Antony with the consequent lifting of the siege of Decimus Brutus. The Senatorial victory was, however, to prove ephemeral, for soon Caesar Octavian, alone in command since the two consuls' providential but suspicious demise, would break off his alliance with the senatorial Ciceronian faction in an abrupt realignment of forces that resulted in the formation of the Triumvirate with Mark Antony and Marcus Aemilius Lepidus.\nNotes\nReferences\nAncient sources\n*  |url=https://www.livius.org/ap-ark/appian/appian_0.html |access-date=2020-03-26 |archive-date=2015-11-20 |archive-url=https://web.archive.org/web/20151120053128/http://www.livius.org/ap-ark/appian/appian_0.html |url-status=dead }}\n*  }}\n*  }}\n*  }}\n*  }}\n*  }}\nModern sources\n*\n*\n* Encyclopædia Britannica\n* Dictionary of the Roman Empire\n*\n* Osprey Essential Histories, ''Caesar's Civil War''\n*  (Italian translation)"
    }
  ]
}