{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Langshan Jiang\n\nThe Battle of Langshan Jiang, or the Battle of Langshan River (), was a riverine battle which occurred in 919 during the Five Dynasties and Ten Kingdoms period in China between the dynastic states of Wuyue and Yang Wu.\nBackground\nThe Battle of Langshan Jiang occurred as a culmination of smaller scale conflicts between Wu and Wuyue in previous years. Yang Xingmi (the warlord who would go on to found Wu) had been fighting Qian Liu (the warlord who would go on to found Wuyue) in skirmishes and minor campaigns since 895, and tensions between the two states only grew following Zhu Wen’s overthrow of the Tang Dynasty with his own Later Liang Dynasty, which Wu claimed was illegitimate while Wuyue pledged their allegiance. When In 919 the Later Liang emperor Zhu Zhen ordered Qian Liu to attack Wu, he decided to send his son Qian Chuanguan, who was then serving as his deputy military governor, to attack Wu from Changzhou with 500 ships. This was an extremely sizeable force and probably represented the largest assault the Wuyue had launched on Wu territory.\nForces\nThe two forces would appear equal, roughly 500 dragon ships on each side. The Wuyue were commanded by Qian Chuanguan and the Wu by Peng Yanzhang (彭彥章). The Wuyue had an ace, a double pump flamethrower. This flamethrower may have used gunpowder to ignite the petrol (Greek fire). Qian Yuanguan apparently had the flamethrower (or flamethrowers) decorated with silver so that if the enemy captured it they'd take the silver and leave the petrol and apparatus.\nBattle\nIn anticipation for the battle, Qian Chuanguan loaded his ships with ashes, sand, and beans.  When the fleets encountered each other, Qian Chuanguan maneuvered his fleet into an upwind position and then scattered ashes at the Wu fleet, making the Wu soldiers unable to see his ships, and then spread the decks of his own ships with sand while throwing beans at the Wu ships, causing the Wu ships' decks to be covered with beans and the Wu soldiers to thereafter slip and unable to act quickly.  He then set fire to the Wu ships, causing a general rout. When Peng's deputy Chen Fen (陳汾) did not come to Peng's aid, Peng committed suicide.\nThe Wuyue managed to destroy with their flamethrower 400 enemy ships then captured 7000 prisoners.\n|Wuyue account of the battle}}\nAnalysis\nThe source describes both sides as having \"dragon like ships\". These could simply be normal war boats with dragon heads carved on. However, these may also be dragon boats, canoes with dragon heads which are used for various sporting events in honour of the ancient Chinese philosopher Qu Yuan. If they were using these types of boat, then it could be that normal military equipment (i.e. warships) was in short supply, and considering the chaos of this time, that could be possible. This could be the reason why they started inventing the flamethrowers, since oil at this stage was quite abundant in the rocks around some parts of China. It is known from the Wujing Zongyao written in 1044 that the fire drug (proto-gunpowder) was being used to ignite oil from flamethrowers by that time. It could therefore be, that in the chaos, Qian Chuanguan may have started using what was then a type of medicine (or at the most, entertainment) as a slow match for his flamethrowers.\nAftermath\nQian Liu then ordered Qian Chuanguan to attack Chang Prefecture, where the Wu regent Xu Wen personally defended against the attack.  At that time, the weather was dry, and the Wu soldiers were able to set fires against the Wuyue army, causing Wuyue soldiers to panic.  The Wuyue generals He Feng (何逢) and Wu Jian (吳建) were killed, and Qian Chuanguan was forced to flee.  Xu took the opportunity to negotiate peace between the two states by returning the captives that he took, and it was said that for the next 20 years, there were no major confrontations between the two states.\nThe flamethrower would go on to be an effective but dangerous weapon for the Chinese. Gunpowder (probably already used in incendiary arrows and primitive grenades (see Early thermal weapons) would go on to be used in more effective and terrorizing ways in China and the world.\nSources\n* Joseph Needham. Science and Civilisation in China V7:5 the Gunpowder Epic\n*"
    }
  ]
}