{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Ławica\n\nThe Battle of Ławica was one of battles of the Greater Poland Uprising (1918–1919). It took place on January 6, 1919: Polish rebels defeated German forces, capturing the Poznań-Ławica Airport, together with rich war booty, estimated at 200 million ℳ. It is named after the now-suburb of Ławica.\nPolish rebels\n| combatant2        =\n| commander1        = Andrzej Kopa\n| territory         = Capture of Poznań-Ławica Airport\n| commander2        = Fischer\n| strength2         = 200–400 soldiers\n| strength1         = Unknown\n| casualties1       = 1 killed, multiple wounded\n| casualties2       = 2 killed, dozens wounded\n}}\nMonument to the Battle of Ławica in Poznań\nCapture of the Lawica Airport\nThe Greater Poland Uprising began on December 27, 1918, in Poznań, which at that time was called Posen, and was capitol of the Province of Posen, German Empire. Polish rebels quickly gained control of most of the city and its suburbs, but failed to capture the airport, located in the village of Ławica. The airport, called at that time Die Fliegerstation Posen-Lawitz, was home to Flieger Ersatz Abteilung Nr 4, a unit of the Imperial German Air Service. It was guarded by 200–400 soldiers, and Poles were well aware of the fact that a great number of military equipment, including planes and balloons, was kept there.\nIn early January 1919, rumour spread among local Poles that the Germans planned to bomb the rebellious city, using planes of the Flieger Ersatz Abteilung Nr 4. In the night of January 4/5, 1919, Polish military authorities decided to capture the Ławica airport, together with the equipment. Major Stanisław Taczak supported this move, and on January 5, a delegation of Poles headed to Ławica, urging Germans to surrender. All communication links between Ławica and Berlin had been broken, also supplies of electricity were cut off. The Germans agreed to capitulate, but with full honours. The Poles, on the other hand, demanded an unconditional surrender, so the negotiations ended.\nPolish attack, supported by cannons, began on January 6, at 6:30 in the morning. After a short barrage, in which airport tower was destroyed, Polish infantry entered the battle. To the relief of Poles, who wanted to capture the planes intact, German commandant Fischer surrendered after 20 minutes. Altogether, two Germans and one Pole died in the skirmish.\nFollowing the capitulation, Polish rebels managed to seize most of the German equipment, including over 300 planes, 20 machine guns and a number of balloons. The Germans had tried to take the planes to the nearest airfield, located at Frankfurt (Oder). Among the booty were several LVG C.V reconnaissance aircraft, ready to assemble and use. Polish Air Force checkerboards were painted over black German crosses, and captured planes flew over Poznan on January 7, cheered by its Polish residents. Soon afterwards, four squadrons were sent to Warsaw. First Polish commandant of the Ławica Airport was Sergeant Wiktor Pniewski.\nUnable to cope with this failure, the Germans decided to fight back. On January 6, German planes attacked rebel positions near Naklo, and on the next day, they bombed Ławica. In response, Polish officers decided to bomb the Frankfurt Airport.\nAlleged First Raid on Frankfurt (Oder) Airport\nAllegedly, on January 9 1919, first successful bombing raid in the history of Polish Air Force took place. According to the memoirs of Wiktor Pniewski, commander of the troops that captured the airport, it took Polish planes 30 minutes to get to Frankfurt. Taken by surprise, the Germans did not defend the airfield: the raid lasted one hour, during which six Polish planes dropped  of bombs. German residents of the city were horrified: Frankfurt was located far away from either World War I front, and had not seen any destruction during the conflict. Overall, 36 Polish bombs destroyed the hangar and one plane. All Polish machines returned safely to Poznań, and after this raid, German side ceased to use the vulnerable Frankfurt airport.\nHowever, modern historians doubt that the raid ever took place. All studies concerning the alleged raid are based on Pniewski's memoirs. The first notion about the raid appears only in 1975 in the works of Kazimierz Sławiński. The first mention appeared in a version of Pniewski's memoirs in 1931 which referred to a threatening retaliatory air raid to Frankfurt (Oder). Two planes took off but turned back.\nThere are no reports or commendations from the raid in Centralne Archiwum Wojskowe (Central Military Archives). Also the Frankfurt press issued at that time does not mention the air raid.\nOn January 17, 1919, Polish reconnaissance planes were sent  into German territory, and in mid-March, 1st Greater Poland Field Squadron was created. This unit was soon sent to the area of Lwow, to fight in the Polish–Ukrainian War, so 2nd Greater Poland Field Squadron was created to watch the skies over Greater Poland. This squadron was also sent to Eastern Galicia: in mid-June 1919, it was relocated to Stryj, taking part in the Polish–Soviet War.\nThe Battle of Ławica was commemorated on Tomb of the Unknown Soldier, Warsaw, with the inscription \"POZNAN – LAWICA 28 XII 1918 – 6 I 1919\".\nSources\n* Leszek Adamczewski, Slawomir Kmiecik: Zwyciezcy. Bohaterowie Powstania Wielkopolskiego 1918-1919 we wspomnieniach swoich bliskich. Poznan 2008, , s. 66-67\n* Radoslaw Nawrot: Pierwszy nalot Polaków. Warszawa: Agora.\n* Krzysztof Mroczkowski: Pierwsze orly w powietrzu. Warszawa: Rzeczpospolita"
    }
  ]
}