{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Aspromonte__disambig_1\n\ntemplate -->\n| map_type    =\n| map_relief  =\n| map_size    =\n| map_marksize =\n| map_caption =\n| map_label   =\n| territory   =\n| result      = Regular army victory\n| status      =\n| combatants_header =\n| combatant1  =  Royal Italian Army\n| combatant2  =  Garibaldi's volunteers\n| combatant3  =\n| commander1  =\n| commander2  =  Giuseppe Garibaldi\n| commander3  =\n| units1      =\n| units2      =\n| units3      =\n| strength1   = 3,000 regulars\n| strength2   = 2,000 volunteers\n| strength3   =\n| casualties1 = 5 dead, 23 injured\n| casualties2 = 7 dead, 20 injured\n| casualties3 =\n| notes       =\n| campaignbox =\n}}\nThe Battle of Aspromonte, also known as the Day of Aspromonte (), was a minor engagement that took place on 29 August 1862, and was an inconclusive episode of the Italian unification process. It is named after the nearby mountain of Aspromonte in southern Italy. Giuseppe Garibaldi's army of volunteers was attacked by the Royal Italian Army while marching from Sicily towards Rome, capital of the Papal States, which it intended to annex into the newly created Kingdom of Italy. In the fighting, which took place a few kilometers from Gambarie, Garibaldi was wounded and taken prisoner.\nBackground\nWhen Victor Emmanuel II became the King of Italy on 17 March 1861, the newly created Kingdom of Italy did not include Veneto and Rome. These \"unredeemed\" cities, as they would be called a few decades later, were a constant cause of friction in Italian politics. The dispute concerning Rome, specifically known as the \"Roman Question\", had arisen after the Italian Parliament had declared Rome capital of the kingdom on 27 March 1861. This conflicted with Pope Pius IX's intent to maintain his temporal control of the city.\nMembers of the government of the Kingdom of Italy had different perspectives on this issue, and the internal tensions that followed caused Prime Minister Bettino Ricasoli to resign in 1862. While his successor, Urbano Rattazzi, was known for his disrespectful attitude towards the Holy See, the Kingdom of Italy maintained a low profile on the Roman Question after Rattazzi's election.\nMeanwhile, General Giuseppe Garibaldi reached Sicily and began to form an army, with the intent of marching on Rome. The intransigent reaction of France (which was, at the time, the most influential ally of Italy) and the Pope caused the Italian government to intervene. On 3 August, Victor Emmanuel II officially condemned Garibaldi's \"guilty impatience\", and Rattazzi sent the Royal Army, at the orders of general Enrico Cialdini, to stop Garibaldi.\nThe battle\nGaribaldi was known and respected as a hero by most Italians, including most soldiers in the Royal Army and Navy. Several actions that occurred reveal that neither Garibaldi nor his opponents were willing to enter open combat, or cause too much damage to their opponent.\nAlthough Garibaldi's ships had likely been detected by the Royal Navy while they were crossing the Strait of Messina to reach land in Calabria, the Royal Army only attacked when Garibaldi's army had actually reached land, possibly to keep losses to a minimum. Garibaldi himself did not immediately counter-attack the Royal Army, instead trying to circumvent it by crossing the Aspromonte mountains.\nGaribaldi's army marched for three days; on 28 August 1862, the leading regiment, led by Garibaldi, camped near Gambarie, where the rest of his army was expected to arrive in a few days. On 29 August, before Garibaldi's army was reunited, Bersaglieri from the Royal Army reached Garibaldi's camp and attacked.\nGaribaldi ordered his army not to open fire \"on our brothers\", and some Bersaglieri changed sides during the battle, joining Garibaldi's volunteers. However, despite Garibaldi's order, one wing of his regiment mounted a counter-attack against the Bersaglieri. During the altercation, two bullets hit Garibaldi's hip and malleolus. A cease-fire was declared shortly thereafter, and Garibaldi surrendered.\nAftermath\nThe battle lasted for about ten minutes and resulted in around 15 casualties. Garibaldi, now wounded, was immediately assisted by surgeons and taken prisoner; he was later sent to the jail at Varignano, near Porto Venere. Garibaldi and his volunteers received amnesty on 5 October 1862; Garibaldi officially retired to Caprera, where he remained for two years.\nThe Day of Aspromonte caused both national and international criticism towards the Italian government, and caused the debate in Italy to become even harsher. Giuseppe Mazzini's party declared that, after the events of Aspromonte, any silent agreement between the Monarchy and the Republicans had been factually broken; supporters of the Monarchy maintained that the Republicans' support for such rash initiatives as Garibaldi's expedition proved that they were too irresponsible to lead the nation. Commentators accused the government of betraying the Italian revolution and being more supportive of the Pope than of Italy itself.\nIn 1863, Rattazzi was replaced by Marco Minghetti, who leveraged on the facts of Aspromonte to negotiate a treaty with France (the September Convention), in which Italy would protect the frontiers of the Papal States against attacks, and France would withdraw its troops from Rome within two years.\nDespite the September Convention, annexing Rome remained an implicit objective of Italy. Garibaldi tried to march on Rome again in 1867, but was stopped by French troops at the Battle of Mentana. Eventually, the Questione Romana was solved under Italian Prime Minister Giovanni Lanza, when Rome was finally captured in 1870.\nIn popular culture and literature\nA popular Italian nursery rhyme, Garibaldi fu ferito (\"Garibaldi was wounded\"), set to the melody of Bersaglieri's anthem, refers to the Battle of Aspromonte.\nThe battle is sometimes mentioned in political debate, when someone accuses the Italian government of betraying the expectations of the Italian people, or acting against national interests.\nIn Joseph Conrad's Nostromo (1904), the aged Italian exile, Giorgio, mourns \"the fatal day of Aspromonte, when the treachery of kings, emperors and ministers had been revealed to the world in the wounding and imprisonment of his hero.\" (ch 4).\nReferences"
    }
  ]
}