{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Cockpit Point__disambig_1\n\n|place=Prince William County, Virginia\n|result=Inconclusive\n|combatant1=\n|combatant2=\n|commander1= Robert H. Wyman\n|commander2=  Samuel G. French\n|strength1=2 gunboats\n|strength2=50 men  4 batteries\n|casualties1=\n|casualties2=\n}}\n.]]\nThe Battle of Cockpit Point, the Battle of Freestone Point, or the Battle of Shipping Point, took place on January 3, 1862, in Prince William County, Virginia, as part of the blockade of the Potomac River during the American Civil War.\nAfter victory at First Battle of Bull Run, the Confederate States Army (CSA) established a defensive line from Centreville along the Occoquan River to the Potomac River. The Confederates used the Potomac’s banks as gun positions to halt Union traffic on the river, protecting Manassas Junction to the west and Fredericksburg to the south and to close the Potomac River to shipping and isolate Washington., from the field batteries, Evansport, Shipping Point, Potomac River, 15 October]]\nIn October 1861, the Confederates constructed batteries at Evansport (now downtown Quantico, consisted of two batteries on the river bank, and another  inland), a CSA field battery located at the mouth of Chopawamsic Creek where it empties to the Potomac (now the Marine Corps Air Facility), Shipping Point (now Hospital Point on Quantico, number of guns unknown), Freestone Point (a CSA four-gun battery on the shore of the Potomac River, now within Leesylvania State Park), and Cockpit Point (near the current asphalt plant, consisted of six guns (one heavy gun) in four batteries, a powder magazine, and rear rifle pits, on top of a  high cliff known as Possum Nose). By mid-December, the Confederates had 37 heavy guns in position along the river.\nOn September 25, 1861, the Freestone Point batteries were shelled by the  (commanded by Lieutenant Edward P. McCrea) and , commanded by Lieutenant Charles S. Norton. On January 1, 1862, Cockpit Point was shelled by  (Lieutenant Oscar C. Badger commanding) and  (Lieutenant Eastman commanding), with neither side gaining an advantage, though Yankee was slightly damaged.\nUnion ships approached the point again on March 9. A landing party from Anacostia and Yankee destroyed abandoned Confederate batteries at Cockpit Point and Evansport, Virginia, and found CSS Page blown up. The Confederates, in keeping with their general tactic of withdrawal from the sea coast and coastal islands, had abandoned their works and retired closer to Richmond, after effectively sealing off the Potomac River for nearly five months.\nLegacy\nPrince William County is in the process of establishing the Cockpit Point Battlefield Heritage Park at Cockpit Point to open in 2017. The park will preserve 113 acres, including a 93 acre natural area with a pond. The park area has a 16 acre gun battery site along the Potomac River, including cannon emplacements.\nReferences\n*[https://web.archive.org/web/20060526100724/http://www.cr.nps.gov/hps/ABPP/battles/va100.htm National Park Service battle description]\n*[http://www.sonofthesouth.net/leefoundation/civil-war/1861/november/merrimac-story.htm ''Harper's Weekly of November 2, 1861] hosted on the Son of the South website.\n*[http://www.sonofthesouth.net/leefoundation/civil-war/1862/march/rebel-batteries-cockpit-point.htm Harper's Weekly of March 22, 1862] hosted on the Son of the South website.\n*[https://web.archive.org/web/20061129194634/http://www.geocities.com/naforts/va.html Virginia Forts] information from American Forts Network, compiled by Pete Payette.\n*[http://www.historycentral.com/NAVY/cwnavalhistory/March1862.html Naval History of the Civil War March 1862]\n*[https://books.google.com/books?id=wV7QOSrhH6MC&q=samuel+g+french&pg=PA140 Two Wars, an Autobiography of General Samuel G. French'']\n*[http://www.hmdb.org/marker.asp?marker=4820 Freestone Point Earthworks] Civil War Trails Historical Marker\nExternal links\n*[https://web.archive.org/web/20161006212654/http://www.pwcgov.org/government/dept/publicworks/hp/pages/cockpit-point-battlefield-heritage-park.aspx Cockpit Point Battlefield Heritage Park] at Prince William County, Virginia"
    }
  ]
}