{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Pig Point\n\nUnited States (Union)\n| combatant2  =  CSA (Confederacy)\n| commander1  = John Faunce\n| commander2  = Robert B. PegramJohn C. Owens\n| strength1   = Gunboat crew\n| strength2   = Shore battery garrison\n| casualties1 = 5 wounded\n| casualties2 = 0\n| result      = Confederate victory, inconclusiveUnion gunboat withdrew\n| campaignbox =\n}}\nThe Battle of Pig Point was an early naval battle of the American Civil War, after Lincoln had extended the Union blockade to include Virginia. On June 5, 1861, the Union gunboat USRC Harriet Lane under Captain John Faunce was ordered to attack Pig Point, but due to shallow water, the shots fell short, and the Union suffered five men wounded before withdrawing.\nBackground\nOn April 15, 1861, the day after the small U.S. Army garrison surrendered Fort Sumter in the harbor Charleston, South Carolina to Confederate forces, President Abraham Lincoln called for 75,000 volunteers to reclaim federal property and to suppress the incipient rebellion of the seven Deep South Slave states. Four Upper South States which also permitted slavery, including Virginia, refused to furnish troops for this purpose and began the process of secession from the Union. On April 17, 1861, a convention in Richmond, Virginia passed an ordinance providing for Virginia's secession from the Union and authorized the governor to call for volunteers to join the military forces of Virginia to defend the state against Federal military action. The Virginia Secession Convention made the act of secession subject to a vote of the people of the state on May 23, 1861, but the actions of the convention and Virginia political leaders, especially Governor John Letcher, effectively took Virginia out of the union. In view of developments to complete secession in Virginia, President Lincoln also did not wait for the vote of the people of Virginia on secession to take action that treated Virginia as part of the Confederacy. On April 27, 1861, he extended the blockade of the original Confederate States that he had declared on April 19, 1861 to include the ports of Virginia and North Carolina.\nOn May 27, 1861, Major General Benjamin Butler commanding Fort Monroe at the tip of the Virginia Peninsula between the James River and the York River sent forces  north to occupy Newport News, Virginia. By May 29, the Union Army established a camp and battery at Newport News Point that could cover the entrance to the James River ship canal and the mouth of the Nansemond River. Meanwhile, the Confederates established a battery at Pig Point across the Nansemond River from Newport News with guns captured from the Gosport Navy Yard in Norfolk County, Virginia, now part of Portsmouth, Virginia. After establishing the Union position at Newport News, Butler wished to move up the Nansemond River to capture Suffolk, Virginia. He had to dispose of the battery at Pig Point to accomplish this objective.\nBattle\nGeneral Butler ordered Captain John Faunce to take the Harriet Lane, one of the boats which had tried to reinforce and resupply Fort Sumter, and attack the Confederate battery at Pig Point on June 5, 1861 in order to ascertain its strength. Faunce attacked the battery but due to shallow water, he had to fire his 30 shots from too great a distance. Most fell short of the Confederate position. The Confederate defenders, including the Portsmouth Rifle Company returned fire and wounded five of the Union steamer's crew. From this brief engagement, Faunce determined that the battery was strong and considered his mission complete. He withdrew the Harriett Lane from the engagement in the face of the superior Confederate firepower.\nCaptain Robert Pegram commanding the Confederate battery reported that the Harriet Lane fired 33 shots and inflicted no casualties or damage. The Confederates returned fire with 23 shots. A later account stated that the Harriet Lane had disabled a 48-pound cannon at the battery. Five of the ''Harriet Lane's crew were wounded by the Confederate gunfire.\nOn the same date, June 5, 1861, the USS Quaker City captured the Confederate ship General Greene off the nearby Virginia Capes.\nAftermath\nThe Confederates maintained control of Pig Point and operation of the battery until they abandoned Norfolk and Portsmouth, Virginia at the start of the Peninsula Campaign on March 9, 1862. Union forces occupied Norfolk and Portsmouth on May 10 and 11.\nNotes\nReferences\n* [https://books.google.com/books?id=cJgSAQAAMAAJ The American annual cyclopedia and register of important events of the year 1861]. Volume 1. New York: D. Appleton & Co., 1870. . Retrieved May 3, 2011.\n* Barnes, James. [https://books.google.com/books?id=WMcLAAAAIAAJ The Photographic History of the Civil War in Ten Volumes: Volume 6: The Navies]. Miller, Francis Trevelyan, Robert S. Lanier, and James Verner Scaife, eds. New York: Review of Reviews Co., 1911. . Retrieved May 1, 2011.\n* Davis, William C. and James I. Robertson, Virginia Center for Civil War Studies . [https://books.google.com/books?id=dMVLApt9dgkC Virginia at war: 1861]. Lexington, KY: University of Kentucky Press, 2005. .\n* Fredriksen, John C. [https://books.google.com/books?id=BZ3nGcFySHUC Civil War Almanac]. New York: Facts on File, 2007. .\n* Hansen, Harry. The Civil War: A History. New York: Bonanza Books, 1961. .\n* Long, E. B. and Barbara Long. The Civil War Day by Day: An Almanac, 1861–1865. Garden City, NY: Doubleday, 1971. .\n* Lossing, Benson John and William Barritt. [https://books.google.com/books?id=gmvkkyCLMv8C Pictorial history of the civil war in the United States of America, Volume 1]. Philadelphia, George W. Childs, 1866. . Retrieved May 1, 2011.\n* Neeser, Robert Wilden. [https://books.google.com/books?id=BucbAQAAMAAJ Statistical and Chronological History of the United States Navy, 1775–1907], Volume 2. New York, The Macmillan Company, 1909. . Retrieved April 22, 2011.\n* Porter, John W. H. [https://books.google.com/books?id=9NVYAAAAMAAJ  A record of events in Norfolk County, Virginia: from April 19th, 1861, to May 10, 1862]. Portsmouth, VA: W. A. Fiske, 1892.  Retrieved March 16, 2011.\n* Salmon, John S. The Official Virginia Civil War Battlefield Guide''. Mechanicsburg, PA: Stackpole Books, 2001. .\n*"
    }
  ]
}