{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Nsanakong\n\nBritish Empire\n* British Nigeria\n| combatant2  =  German Empire\n* German Kamerun\n| combatant3  =\n| commander1  =   Lieutenant Colonel C. T. Mair\nCaptain Milne-Howe\n| commander2  =   Hauptmann Rausch Emil\n| commander3  =\n| units1      =\n| units2      =\n| units3      =\n| strength1   = ~200\n| strength2   = 800\n| strength3   =\n|casualties1= 8 British officers160 Nigerians (95 dead, 16 wounded, 49 captured)\n|casualties2= 113 (43 dead, 70 wounded)\n|campaignbox =\n}}\nThe Battle of Nsanakong or Battle of Nsanakang took place between defending British and attacking German forces during the Kamerun campaign of the First World War. The town of Nsanakong had been occupied by the British on 30 August 1914. On 6 September, German forces attacked, driving the British force over the border back into Nigeria.\nBackground\nForces from British Nigeria had attempted to move into German Kamerun from a number of points along the colony's northern border. Attempts to do this at the First Battle of Garua and Mora had failed. Further south, a British column from Ikom crossed the Cross River into Kamerun and occupied the station of Nsanakong, 5 kilometers from the Nigerian border on 30 August.\nBattle\nA week following the British occupation of Nsanakong, at two o'clock in the morning on 6 September 1914, German forces surrounded the village. The Germans, armed with machine guns, attacked. The British defenders successfully repulsed this initial attack but in the process exhausted their ammunition. Another German attack came at five o'clock in the morning, this time from higher ground. The British could not repulse this one due to their lack of ammunition and attempted to break out by conducting a bayonet charge. The result was disastrous for the British. They lost about 100 men which was equivalent to approximately half of their force during the battle, including eight of their eleven British officers. German losses were also heavy with 40 dead including the commanding officer, Captain Rausch Emil. After suffering heavy casualties, the remaining British units successfully retreated back into Nigeria.\nAftermath\nThe few British soldiers who did escape faced harsh conditions during their retreat back into Nigeria. German units pursued them over the frontier and occupied the British station at Okuri which they later abandoned. This failed invasion, along with the failures of other Allied columns along Kamerun's northwestern border with Nigeria, forced the British to go on the defensive. German forces gained confidence as a result of this victory and patrols began to make intrusions into British Nigeria as far west as Yola.\nNotes\nReferences\n*Buchan, John. A History of the Great War. Vol. I. Boston and New York: Houghton Mifflin, 1922\n*[https://web.archive.org/web/20120128175225/http://www.jaduland.de/kolonien/raub/raubzugk.html Der Raubzug Gegen Unsere Kolonien.] Der Täglichen Rundschau[Berlin] 1915: n. pag. Web..\n*Hilditch, A. N. Battle Sketches, 1914–1915. Oxford University Press, 1915.\n*O'Neill, Herbert C. The War in Africa and the Far East. London: London Longmans Green, 1918.\n*Reynolds, Francis J.,  Churchill, Allen L., and Miller, Francis T. Chapter 77 - The Cameroons. The Story of the Great War.  Vol. III (of VIII). 1916.\n*Strachan, Hew. The First World War. Vol. I: To Arms. Oxford: Oxford University Press, 2001."
    }
  ]
}