{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Arbedo__disambig_1\n\nDuchy of Milan\n| combatant2        =  Swiss Confederates\n**  Lucerne\n**  Uri\n**  Zug\n**  Unterwalden\n| commander1        =  [https://archive.org/details/quellenbuchzursc00oech/ link text] p. 142|group=nb}} CarmagnolaAngelo della Pergola\n| commander2        =  maintains that Lucerne had to impose a tax to ransom its prisoners, among whom was Ulrich Walker, Schultheiss and Hauptmann of Lucerne, who faced a trial after his release [https://www.e-periodica.ch/digbib/view?pid=gfr-001%3A1950%3A103#3/  link text] p. 101. The Landammann of Uri Johannes Rodt [https://www.e-periodica.ch/cntmng?pid=gfr-001%3A1881%3A36%3A%3A371 link text] p. 257, the Landammann and knight banneret of Zug Peter Kolin  and the Landammann and knight banneret of Unterwalden Bartholome Zinderist [https://books.google.com/books?id=AHo7AAAAcAAJ&q=kleiner+versuch+unterwalden link text] pp. 112–113 were all killed in the battle.|group=nb}} Ulrich Walker Johannes Rodt Peter Kolin Bartholome Zinderist\n| strength1         = 8,000-16,000  [https://diglib.uibk.ac.at/download/pdf/2748404?name=Ennetbirgische%20Politik%20und%20Feldz%C3%BCge%20der%20Innerschweizer%20bis%20zum%20siege%20von%20Giornic link text] p. 54|group=nb}}\n| strength2         = 8,000  [https://www.ow.ch/dl.php/de/5409b89275813/Text_und_Uebersetzung_Chronik_Weisses_Buch.PDF/ text link] pp. 69–71 together with the Chronik der Stadt Zürich 1420–1477  [https://www.e-helvetica.nb.admin.ch/view/nbdig-56867!urn%3Anbn%3Ach%3Anbdig-56867%3Anbdig-56867.pdf?q=&v=all&urn=nbdig-56867&start=0&rows=20&sort=score%20desc%2C%20ehs_urn_id%20asc/ link text] p. 189 and the Rötteler Chronik  [https://archive.org/details/baslerchroniken02basegoog/ link text] pp. 179–180 is that indeed on the day of battle the continingent of Zug arrived later on the battlefield while that of Schwyz was still behind and never arrived. The Rötteler Chronik does however describe the mobilisation of Uri, Lucerne, Unterwalden and Zug as \"very strong\".|group=nb}}\n| casualties1       = heavy ~900 killed  [https://www.e-codices.unifr.ch/de/stalu/COD-3655/49r/ link text] describes the Milanese killed in the battle as ...ob nunhundert... around 900|group=nb}}400 horses killed\n| casualties2       = heavy ~400 killed all baggage and 1,200 sumpters lost\n| coordinates       =\n}}\nThe Battle of Arbedo was fought on 30 June 1422 between the Duchy of Milan and the Swiss Confederation, and ended with a Milanese victory.\nIn 1419, the Swiss cantons of Uri and Unterwalden bought the fortified town of Bellinzona from the House of Sax but were unable to defend it adequately. When they rejected a Milanese proposal to purchase Bellinzona in 1422, a Milanese force under the command of the condottiero Francesco Bussone da Carmagnola attacked and defeated the Swiss garrison and occupied the town.  A Swiss attempt to recapture Bellinzona with the support of other cantons including Lucerne and Zug led to the battle at the village of Arbedo,   north of the town.\nThe Swiss were mainly equipped with halberds and were initially successful in repelling two Milanese cavalry charges.  Carmagnola then brought up his crossbowmen on the Swiss flanks and ordered his men-at-arms to dismount and fight on foot with their lances, which outreached the halberds.\nThe Milanese forced the Swiss back onto a nearby hill, but the appearance of a band of foragers, whom the Milanese mistakenly thought were reinforcements, saved the Swiss from total defeat.  When the Milanese force pulled back to reform, the Swiss withdrew from the battlefield, both sides having taken heavy casualties.\nIn a historiographical tradition of Zug, the bearer of the cantonal banner, Peter Kälin, was slain, and the banner was taken up by his son, who was slain in his turn. The banner was saved by one Hans Landwing, and was later lost against the French.\nThe victory secured Bellinzona and the Leventina for the Duchy. In addition, the Duchy regained the Val d'Ossola, thus the Swiss lost all their territorial gains. The defeat discouraged Swiss expansion towards Lake Maggiore for a long time. However, it was this defeat at Arbedo that led to the Swiss increasing the number of pikemen in their armies.\nDeutsche Geschichte5-230.jpg|Battle of Arbedo (1422) in the depiction of the Lucerne chronicle (1513)\nZug2.jpg|The shooting thaler of the 1867 federal Schützenfest depicts Hans Landwing saving the cantonal banner\nSee also\n*Battles of the Old Swiss Confederacy\nSources\n* White Book of Sarnen\n* Rötteler Chronik\n* Luzerner Bürgerbuch, 1191-1489\n* Chronik der Stadt Zürich, 1290-1477\n* Tigurinerchronik, 1573\n* Historia Fratris Andreae Billii, 1402-1432\n* Historiarum ab Inclinatione Romanorum, 1483 (Flavio Biondo 1392-1463)\nReferences\nFootnotes"
    }
  ]
}