{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Lanzerath Ridge__disambig_1\n\n| combatant2        =  United States\n| strength2         = Intelligence and Reconnaissance Platoon, 394th Regiment, 99th Infantry Division (18 men);  Forward Observation Team, Battery C, 371st Field Artillery (4 men)\n| strength1         = 1st SS Panzer Division 1st Battalion, 9th Fallschirmjäger Regiment, 3rd Fallschirmjäger Division (500 men);  27th Fusilier Regiment, 12th Volksgrenadier Division (50 men)\n| combatant1        =  Germany\n| commander2        = Walter LauerLyle Bouck\n| commander1        = Josef Dietrich I.G. von Hoffmann\n| result            = German victory\n| casualties2       = 1 killed  21 captured (14 of which were also wounded)22 casualties\n| casualties1       = 10–40 killed  63 wounded  13 missing96 casualties\n| campaignbox       =\n}}\nThe Battle of Lanzerath Ridge was fought on December 16, 1944, the first day of the Battle of the Bulge during World War II, near the village of Lanzerath, Belgium, along the key route for the German advance on the northern shoulder of the operation. The American force consisted of two squads totalling 18 men belonging to a reconnaissance platoon and four forward artillery observers, against a German battalion of about 500 paratroopers. During a day-long confrontation, the American defenders inflicted dozens of casualties on the Germans and delayed by almost 20 hours the advance of the entire 1st SS Panzer Division, the spearhead of the German 6th Panzer Army.\nThe Germans finally flanked the Americans at dusk, capturing them. Only one American, an artillery observer, was killed, while 14 others were wounded, while German casualties totaled 92. The Germans paused, believing the woods were filled with more Americans and tanks. Only when SS-Standartenführer Joachim Peiper and his tanks arrived at midnight, twelve hours behind schedule, did the Germans learn the nearby woods were empty.\nDue to lost communications with battalion and then regimental headquarters, and the unit's subsequent capture, its disposition and success at delaying the advance of the 6th Panzer Army that day was unknown to U.S. commanders. First Lieutenant Lyle Bouck considered the wounding of most of his men and the capture of his entire unit a failure. When the war ended five months later, the platoon's men, who were split between two prisoner-of-war camps, just wanted to get home. It was only after the war that Bouck learned that his platoon had prevented the lead German infantry elements from advancing and had delayed by about 20 hours their armored units' advance. On October 26, 1981, after considerable lobbying, a Congressional hearing, and letter writing by Bouck, every member of the unit was finally recognized for their valor that day, making the platoon the most decorated American unit of its size of World War II.\nBackground\nPrior to the Battle of the Bulge, the U.S. Army was engaged in a campaign to attack the Roer River dams before invading the rest of Germany. The green 99th Infantry Division was supporting the battle-weary 2nd Infantry Division in their attack on the German West Wall at Wahlerscheid. During two days of hard fighting, the U.S. Army had finally managed to slip through the heavily fortified lines and penetrate the German defenses. The Americans were expecting a counterattack in the area, but their intelligence completely failed to detect the Germans' movement of hundreds of armored vehicles and tens of thousands of infantry into the region. Much of the region was relatively quiet, lending the area the title of \"Ghost Front.\"\nDuring early December 1944, the American defensive line in the Ardennes had a gap south of Losheimergraben. General Leonard T. Gerow, in command of V Corps, recognized this area as a possible avenue of attack by the Germans. This area, which lay between V Corps and Troy H. Middleton's VIII Corps, was undefended and just patrolled by jeep. The patrols in the northern part of the area were conducted by the 99th Infantry Division's 394th Intelligence and Reconnaissance Platoon, whereas those in the south were conducted by the 18th Cavalry Squadron, 14th Cavalry Group, which was attached to the 106th Infantry Division.\nIn the border area between Germany and Belgium, there was only one road network that could support a military advance: it was through the area known as the Losheim Gap, a  long, narrow valley at the western foot of the Schnee Eifel. This was the key route through which the German Sixth and Fifth Panzer Armies planned to advance.\nOn December 11, General Walter M. Robertson, commander of the battle-hardened 2nd Infantry Division, was ordered to attack and seize the Roer River dams. In case he had to pull back, he chose Elsenborn Ridge as his defensive line. General Walter E. Lauer, commanding the 99th Infantry Division, was charged with building up the defenses around Elsenborn Ridge. Lauer knew his front was extremely long and very thinly manned; he gave instructions to his division to dig in and build cover for their foxholes.\nPrelude\nInexperienced American units\n, at 20 years old, ]]\nThe troops of the 99th Infantry Division, who lacked battle experience, were deployed to the Ardennes in November 1944, with the 394th Regiment relieving the 60th Regiment of the 9th Infantry Division. Among the units was the 394th I&R platoon, consisting of well-trained soldiers who had been selected because they were expert marksmen and in peak physical condition. Some of the men were college-educated and were former members of the U.S. Army's abruptly terminated ASTP program. This platoon was led by 20-year-old Lieutenant Lyle Bouck, one of the youngest officers in the Army, and the second youngest man in the unit. For the next few weeks his platoon  established and maintained regimental listening and observation posts, conducted patrols behind enemy lines, and gathered information. They lived in a brick building in Hünningen, taking advantage of a basement full of potatoes and a homemade stove to supplement their military C-rations.\nThe platoon consisted of two nine-man reconnaissance squads and a seven-man headquarters section, which was attached to the 394th Regiment's S2 section. As the platoon was not intended nor trained for combat, they were told to avoid direct engagement with the Germans. Nonetheless, they took part in several missions behind enemy lines, even as far as Losheim,  behind the front line, to capture enemy soldiers for intelligence. Bouck and several of his men were among the first soldiers in their regiment to be recognized with the Combat Infantry Badge. Most often their patrols consisted of creeping through snow-clogged defiles obscured by fog in an attempt to fix enemy positions.\nOn December 10, the reconnaissance platoon was ordered by Major Robert Kriz, commanding officer of the 394th Infantry Regiment, to a new position about  southeast of Hünningen, near Lanzerath, Belgium, a village of 23 homes and a church. The village lay at a critical road junction in the northern part of the Losheim Gap. The 25 men were charged by Kriz with plugging a  gap in the front line between the 106th Division to the south and the 99th Division to the north. The only reserve was the 394th Infantry Regiment's 3rd Battalion, which was at Bucholz Station. Behind them lay roads that could give the enemy rapid access to the Army's rear and allow them to easily flank the thinly deployed 99th Division.\nAmerican defensive preparations\nThe I&amp;R platoon took over positions on a ridge top immediately northwest of Lanzerath that were formerly occupied by part of the 2nd Infantry Division. They were ordered to improve their foxhole positions and maintain contact with Task Force X, made up of 55 troops manning four towed three-inch guns from the 2nd Platoon, Company A, 820th Tank Destroyer Battalion. The 820th was attached to the 14th Cavalry Group, 106th Infantry Division of VIII Corps. The I&amp;R platoon and the 820th TD were reinforced by the 22 men of the 820th's 2nd Recon Platoon, commanded by Lieutenant John Arculeer, who were mounted on an armored half-track and two jeeps. Members of the 2nd Platoon took up positions in two homes in the village of Lanzerath about  to the southeast. Together, the two units comprised the foremost units in their sector of the American forces facing the Siegfried Line.\nThe Americans attacked through the Siegfried Line at Walerscheid about  to the north, and a localized counterattack was expected. Lieutenant Bouck followed procedure and ordered his men to build fortifications with interlocking fields of fire. Taking advantage of the foxholes left by the previous unit, they dug them deeper so that two or three men could stand in them and fire from the concealed edges. They covered each hole with pine logs  to  thick. Their hilltop location was just inside the edge of a forest and overlooked a pasture bisected by a  high barbed wire fence parallel to their location. Their position covered about  along a shallow ridge line, about  in enfilade  position above the road and  northwest of the village. Their foxholes were situated in a shallow curve along the ridge line in a northeast direction, almost to a fork in the road at their left flank. Snow fell, covering their dug-in fortifications inside the woods, leaving them virtually invisible from the road below.\nThey took advantage of a small log hut behind their position, which they used as a warming hut. Bouck had augmented the unit's weaponry with four extra carbines, two Browning automatic rifles, and one light .30 caliber machine gun. Outside official channels, he had also traded his unit's collection of German memorabilia with an ordnance supply officer for an armored Jeep with a mounted .50 caliber machine gun. His men dug an emplacement for the armored jeep and its .50 caliber gun, placing it in enfilade down the road along the Germans' possible line of advance.\nOnce an hour, in an attempt to fill the gap in their sector, they ran a jeep patrol up and down the line to stay in contact with units on their right and left flanks and to watch for any enemy movement. They hoped they would be relieved soon: \"We weren't trained to occupy a defensive position in the front lines. We were trained to patrol and get information about the enemy,\" Bouck said in an interview 60 years later. On the night of December 16, they heard the clanking of armor and the sound of vehicles in the distance. Bouck ordered his men to remain awake. The temperature ranged from  to the low  during the day.\nGerman plans\nMany of the German units were recent conscripts with very little experience. Sergeant Vinz Kuhlbach's platoon was typical. Most of his soldiers had little combat experience and even less training. The German units had been formed by conscripting teenage boys and men over 50, men previously rejected as physically unfit for service, wounded soldiers newly released from hospitals, and men transferred from the \"jobless\" personnel of the shrinking Kriegsmarine and Luftwaffe. The German 3rd Fallschirmjäger  Division, which had previously acquired a superb combat reputation, had been virtually destroyed during the Normandy Invasion in the Falaise pocket. It had been resurrected by using replacements from the 22nd, 51st and 53rd Luftwaffe Field Regiments. The German units were usually organized around small cadres of seasoned veterans. Although they carried the new StG 44 and were equipped with rifle grenades, few had ever fired them in combat. The German recruits were told the American soldiers they faced would not have the nerve to stand and fight. Their officers said the Americans were \"a gum-chewing, undisciplined half-breed with no stomach for real war.\"\nTo preserve the available armor, the infantry of the 9th Fallschirmjäger Regiment, 3rd Fallschirmjäger  Division, had been ordered to lead the attack through Lanzerath and clear the village before advancing towards Honsfeld and then Büllingen. The German commanders estimated they would face a full division of U.S. troops at Büllingen.\nKampfgruppe Peiper's initial position was in the forest around Blankenheim, Germany, east of the German-Belgium border and the Siegfried Line.  Once the infantry captured Lanzerath, Sepp Dietrich's Sixth Panzer Army led by Kampfgruppe Peiper would proceed without delay. The infantry would then secure the right flank of the attack route near Losheimergraben. Peiper's goal was to cross the Meuse River at Huy, Belgium.\nDespite the losses that had brought the Allies to the border of their homeland, German morale was surprisingly strong. The men knew the Allies were demanding an unconditional surrender. They were now fighting for the fatherland, defending the soil of their country, not just fighting for Hitler.\nDietrich knew the plan had flaws. The Germans had captured the same terrain during the spring of 1940 in three days. Now they were being asked to do it in winter in five days. The plan counted on bad weather to keep the Allied planes grounded. Dietrich only had one-quarter the fuel needed; the plan counted on capturing Allied fuel depots and keeping to an ambitious timetable. Dietrich's assigned route (or Rollbahn) included narrow roads – in many places single tracks – which would force units of the Kampfgruppe to tail each other, creating a column of infantry and armor up to  long. The roads would prevent the attackers from concentrating their forces in the blitzkrieg fashion which had served them so well in the past. The main roads designated for their use had many hairpin turns and traversed steep hillsides that would delay his already slow-moving towed artillery and bridging trains. Dietrich knew that a determined fight at one of these critical choke points by even a token American force could seriously impede his schedule. When Hitler's operations officer, Generaloberst Alfred Jodl, gave him his orders, Dietrich yelled, \"I'm a general, not a bloody undertaker!\"\nBattle\nGerman barrage\n, in which Bouck's unit held up the German advance through a key intersection near Lanzerath for nearly a full day.]]\nOn December 16, 1944, at 05:30, the Germans launched a 90-minute artillery barrage using 1,600 artillery pieces across an 80-mile (130&nbsp;km) front, although the American platoon was only aware of what was happening in their sector. Their first impression was that this was the anticipated counterattack resulting from the Allies' recent attack in the Wahlerscheid crossroads to the north where the 2nd Division had knocked a sizable dent into the Siegfried Line.}}\nMany shells exploded in the trees, sending shards of steel and wood into the ground, but the men were protected by their reinforced foxholes. The German guns cut deep holes the size of trucks in the pasture.\nGerman advance\nGerman infantry began to advance near Losheim before the artillery barrage lifted, preparing to cross the front line as soon as it ended. They marched under the glow of massive searchlights, bouncing light off the clouds. The armor was located farther back, near Blankenheim, Germany. At 08:00, as the sun rose, the American platoon heard explosions and guns around Buchholz Station and Losheimergraben to the east and north where the 3rd and 1st Battalions of the 394th Infantry Division were located. The 55 soldiers of U.S. 2nd Platoon, Company A, 820th Tank Destroyer Battalion, 14th Cavalry Group was initially ordered south to help protect Manderfeld, but shortly afterwards were redirected to join the active battle near Buchholz Station. They withdrew from the village and left without contacting the I&amp;R platoon. This left the platoon as the only unit in the sector and without armor support.\nBouck sent James, Slape and Creger to set up an observation post in a house on the eastern side of the village that had been abandoned by Task Force X. Accompanying them, he spotted in the dawn light a long column of what appeared to be about 500 German troops headed toward them from the east. Their distinctive helmet style told Bouck they were Fallschirmjäger, among the best soldiers Germany could field. None of his training or experience prepared him for this situation, outnumbered as he was by perhaps 20 to 1. Bouck and James scrambled back to the ridge top and the rest of their unit. The platoon's telephone land line to 1st Battalion headquarters in Losheimergraben had been knocked out, but their SCR-300 radio still worked. Bouck reached regimental headquarters at Hünningen on the radio and requested permission to withdraw and engage in a delaying action. He was told to \"remain in position and reinforcements from the 3rd Battalion will come to support you.\"\nIn town, Creger watched as a forward element of the German infantry advanced, with weapons slung, into Lanzerath. They obviously did not expect to encounter any Americans. Creger radioed Bouck and told him of the Germans advancing through Lanzerath on the road between Creger and Bouck's position. Bouck sent Robinson, McGeehee and Silvola to assist Creger, who crept down to the Bucholz Station road and thence up a ditch towards Lanzerath. Before the three men reached Creger, he left the village using a more direct route. As he returned to the American lines, he engaged and killed or wounded most of a German platoon.\nOn the eastern side of the road, Robinson, McGeehee and Silvola attempted to rejoin their platoon, but found the way blocked by German soldiers who threatened to flank them. They decided to head for Losheimergraben and seek reinforcements. They crossed a  deep railroad cut and once on the far side encountered soldiers from Fusilier Regiment 27 of the 12th Volksgrenadier Division. Trying to outflank the 1st Battalion, 394th Infantry Regiment in Losheimergraben, they spotted the three men. After a brief firefight, Robinson and McGeehee were wounded and all three were captured.\nGermans entered the home that Creger and Slape were using as an observation post. Slape climbed into the attic, while Creger only had time to hide behind a door. He pulled the pin on a grenade as the door knob jammed into his ribs. Bullets from the I&amp;R platoon struck the building, and the Germans suddenly left. Creger and Slape exited by the back door and ducked into a nearby cowshed. They crossed a field and then found themselves in a minefield. Picking their way forward, they circled through the woods until they encountered a handful of Germans. Opening fire, they killed them. Creger and Slape spotted Bouck and Milosevich across the road and sprinted towards them, drawing German fire. They made it back to their ridge-top position and Bouck called regimental headquarters. He requested artillery support, but when he reported the German column advancing on his position, the voice on the other end of the radio told him \"he must be seeing things\". Bouck told them he had 20-20 vision and demanded artillery fire on the road in front of his unit.\nU.S. artillery unavailable\nThe platoon's position at the southern end of the 99th Division's sector was not only outside their own regimental boundary, it was outside their division's boundary and V Corps' boundary. The division prioritized artillery fire for targets within its boundary. Bouck waited in vain for the sound of incoming artillery. He called regimental headquarters again, asking for directions. He was told to \"hold at all costs,\" which essentially meant until dead or captured. Bouck knew that if his platoon gave way, the 99th Division's right flank, already thin and undermanned, could be in grave danger.\nFour members of a Forward Observation Team from Battery C, 371st Field Artillery had been in the village when the tank destroyer unit withdrew. Lieutenant Warren Springer and the other three men, Sergeant Peter Gacki, T/4 Willard Wibben, and T/5 Billy Queen joined Bouck's unit on the ridge, where they could continue to observe the enemy movement. Bouck distributed them among the foxholes to help reload magazines and reinforce their position.\nRadio operator James Fort attempted to contact headquarters on the SCR-284 radio mounted on a jeep by the command post and found that German martial music jammed the channel. He then used a side-channel and Morse code, hoping the Germans were not listening in, to send a status report to regimental headquarters.\nPlatoon's defensive action\nAs the German forces moved through Lanzerath and in front of their positions, Bouck and his men allowed lead members of the unit to pass, hoping to surprise the Germans. They were preparing to fire on three men who they believed were the regiment's officers when a girl from the village emerged from one of the homes. Talking to the officers, she pointed in their general direction. An officer yelled a command, and the paratroopers jumped for ditches on either side of the road. The Americans thought she had given their position away and fired on the Germans, wounding several. (In October 2006, more than 60 years later, a writer found the now adult woman, still living in the village. She told him she did not know the Americans were still in the area, and was pointing out the direction the tank destroyer unit had departed, towards Bucholz Station.)\nThe German infantry deployed, and about two platoons of the 2nd Company, 1st Battalion, 9th Fallschirmjäger Regiment, 3rd Fallschirmjäger Division, attacked the Americans head-on, bunched together in the open and charging straight up the hill, directly at the platoon's hidden and fortified positions. The Americans were surprised at the inexperienced tactics. For the Americans, it was like \"shooting clay ducks in California at an amusement park.\" Several attackers were killed trying to climb over the -high barbed wire fence that bisected the field, often shot at close range with a single shot to the heart or head. Springer used his jeep-mounted SCR-610 radio to call in coordinates for artillery fire. A few shells landed near the road outside Lanzerath, but they did not hinder the German attack. His jeep was then struck by machine-gun or mortar fire, and his radio was destroyed.\nSlape and Milosevich fired continually, as fast as they could reload. Slape thought the Germans were mad to attack in such a suicidal manner, straight across the open field. He later recalled that it was one of the \"most beautiful fields of fire\" he had ever seen. After only about 30 seconds, the firing stopped. Nearly all of the attacking Germans had been killed or wounded. McConnell, shot in the shoulder, was the only American casualty.\nDuring a second attack made around 11:00, Milosevich fired the .50 caliber jeep-mounted machine gun until enemy fire drove him back into his foxhole. In both the first and second attack that morning, no German soldier got past the fence in the middle of the field. Bodies were piled around it. German medics waved a white flag late in the morning and indicated they wanted to remove the wounded, which the American defenders allowed. However, during the ceasefire American soldiers noticed what they thought were German medics transmitting coordinates of the American position, nullifying the ceasefire. The Americans suffered only one wounded in the second attack, when Private Kalil was struck in the face by a rifle grenade that failed to explode.\nThe Germans mounted a third attack late in the afternoon, around 15:00. Several times German soldiers attempted to penetrate the American lines. The Americans left their foxholes and in close combat fired on the attackers to push them back down the hill. At one point Private First Class Milsovech spotted a medic working on and talking to a soldier he felt certain was already dead. As mortar fire on his position got more accurate, Milsovech noticed a pistol on the supposed medic's belt, and decided he must be calling in fire on their position. He shot and killed him. Bouck contacted regimental headquarters once more, seeking reinforcements. At 15:50, Fort sent the unit's last update to regimental headquarters in Hünningen. He reported they were still receiving some artillery fire, but were holding their position against an estimated enemy strength of about 75, who were attempting to advance from Lanzerath towards the railroad to the northwest.\nAs dusk approached and their ammunition ran dangerously low, Bouck feared they could be flanked at any time. He planned to pull his men back just before dusk, when they would have enough light to escape through the woods. Bouck ordered his men to remove the distributor caps from their Jeeps and to prepare to evacuate to the rear. He dispatched Corporal Sam Jenkins and PFC Preston through the woods to locate Major Kriz at Regimental HQ and seek instructions or reinforcements.\nBouck tried to contact regimental headquarters on the SCR-300 radio for instructions. A sniper shot the radio as Bouck held it to his ear. The sniper also hit the SCR-284 radio mounted in the Jeep behind Bouck, eliminating any possibility of calling for reinforcements or instructions.\nThe German troops were reluctant to attack head on once again, and Sergeant Vinz Kuhlbach pleaded with the officers of the 9th Fallschirmjäger Regiment to allow his men to flank the Americans in the dusk. Fifty men from Fusilier Regiment 27 of the 12th Volksgrenadier Division were dispatched to attack the Americans' southern flank through the woods. Just as Bouck was about to blow his whistle to indicate withdrawal, German soldiers penetrated their lines and began overrunning their foxholes. Several attackers were killed by grenades rigged to wires and triggered by Americans in their foxholes. Each of the positions spread out over the ridge top were overrun in turn. Surprisingly, the Germans did not simply kill the defenders in their foxholes. Bouck was pulled from his foxhole by an officer with a machine gun, and he thought he would be shot when the German put his weapon in his back and pulled the trigger; it was empty. Both Bouck and the German officer were then struck by bullets. The German fell seriously wounded, while Bouck was struck in the calf. Sergeant Kuhlbach asked Bouck who was in command, and Bouck replied that he was. Kuhlbach asked him why the Americans were still shooting, and Bouck said it was not his men doing it. Bouck surrendered and helped carry his wounded men down to the village.\nConclusion\nDuring their dawn-to-dusk fight, the 15 remaining men of the I&amp;R platoon plus the four men of the 371st Artillery Forward Observation Team repeatedly engaged elements of the 1st Battalion, 9th Fallschirmjäger Regiment, 3rd Fallschirmjäger Division of about 500 men. The Germans reported 16 killed, 63 wounded, and 13 missing in action. Other reports suggest the Americans inflicted between 60 and five hundred casualties on the Germans. Only one American, forward artillery observer Billy Queen, was killed; in Bouck's platoon, 14 out of 18 men were wounded. The small American force had seriously disrupted the scheduled advance of the entire 6th Panzer Army's drive for Antwerp along the critical northern edge of the offensive. After virtually no sleep during the preceding night and a full day of almost non-stop combat, with only a few rounds of ammunition remaining, flanked by a superior enemy force, the platoon and artillery observers were captured.\nAftermath\nThe German military took over several homes in Lanzerath and turned them into aid stations for the wounded of both sides. The rest of the homes were commandeered as temporary quarters.\nGerman armor advance\nKampfgruppe Peiper, the lead element of the Sixth Panzer Army's spearhead, 1st SS Panzer Division, consisted of 4,800 men and 600 vehicles. On December 16, it started as much as  to the east in Tondorf, Germany, and was unable to advance at its scheduled rate because of road congestion. The road from Scheid to Losheim was one solid traffic jam, in part due to two blown railroad overpasses blocking the advance of the 3rd Fallschirmjäger Regiment and the 12th Volksgranadier Division to Losheimergraben, but also due to the stiff American resistance. Peiper's lead units did not reach Losheim until 7:30&nbsp;pm, when he was ordered to swing west and join up with the 3rd Fallschirmjaeger Division, which had finally cleared the route through Lanzerath. Peiper was furious about the delay. En route to Lanzerath, Peiper's unit lost five tanks and five other armored vehicles to American mines and anti-tank weapons. Kampfgruppe Peiper finally reached Lanzerath near midnight.\nBouck, held in Café Scholzen, turned 21 years old at midnight on December 17. At midnight, he watched as a senior German officer (who he later identified as Peiper) attempt to obtain accurate information about the U.S. Army's strength in the area. Peiper was told by Obersturmbannführer I. G. von Hoffman, a former Luftwaffe general staff officer from Berlin and commanding officer of the 9th Fallschirmjäger Regiment, 3rd Fallschirmjäger Division, that his men had run into stiff resistance. He reported that the woods and road ahead were packed with American troops and tanks. He had bedded his troops down for the night and planned to probe the forest for Americans at first light. Their expectations of further resistance was all based on the stiff defense offered by Bouck's force of just 18 men.\n, commander of the 1st SS Panzer Division.]]\nPeiper asked the battalion commander and a Hauptmann (captain) in the same unit about the American resistance. Peiper later commented,\nI asked him for all the information that he had on the enemy situation. His answer was that the woods were heavily fortified, and that scattered fires from prepared \"pill boxes\" plus mines in the road were holding up his advance. He told me that it was impossible to attack under these circumstances. I asked him if he had personally reconnoitered the American positions in the woods, and he replied that he received the information from one of his battalion commanders. I asked the battalion commander, and he said that he had got the information from a Hauptmann (captain) in his battalion. I called the Hauptmann and he averred that he had not personally seen the American forces but it had been \"reported to him.\" At this point I became very angry and ordered the Fallschirmjäger Regiment to give me one battalion and I would lead the breakthrough.\nAt 04:30 on December 17, more than 18 hours behind schedule, the 1st SS Panzer Division rolled out of Lanzerath and headed northwest for Bucholz Station. The entire timetable of their advance on the River Meuse and Antwerp had been seriously slowed, allowing the Americans precious hours to move in reinforcements.\nThe German advance never recovered from its initial delay, and Kampfgruppe Peiper only got as far as Stoumont, where the remaining vehicles ran out of fuel and came under heavy attack from American aircraft, artillery, and tanks. Having advanced less than halfway to the Meuse, they were forced to abandon more than a hundred vehicles in the town, including six Tiger II tanks. The soldiers were ordered to find their way east on foot. The elements of Peiper's battle group that entered Stoumont, retreated with 800 men.\nThe task of defeating the 99th Division was the objective of 12th SS Panzer Division, reinforced by additional Panzergrenadier and Volksgrenadier divisions. On December 17, German engineers repaired one of the road bridges over the railroad along the Losheim-Losheimergraben road and the 12th Division's armor began advancing towards the key road junction at Losheimergraben and the twin villages of Rocherath and Krinkelt. However, in more than ten days of intense battle, the 12th SS Panzer Division was unable to dislodge the Americans from Elsenborn Ridge, where elements of the V Corps of the First U.S. Army prevented the German forces from reaching the key road network to their west.\nDue to the determined resistance of the 99th Division, which was composed of relatively inexperienced troops, along with the experienced 2nd and 30th Divisions, the northern shoulder of the Battle of the Bulge was a sticking point for the entire offensive operation. Had the Americans given way, the German advance would have overrun the vast supply depots around Liège and Spa and possibly have changed the outcome of the Battle of the Bulge.\nPrisoners of war\nThe I&amp;R platoon members who were able to walk were sent to Germany. James was so seriously wounded he could not speak. He and Kalil, who was also seriously wounded, were loaded onto trucks and eventually put aboard trains. Bouck was jammed into a single railroad cattle car with 71 other POWs and traveled for days without food or water. By Christmas Day, seven men in Bouck's car had died, and the rest were barely hanging on. The prisoners were transported to hospitals in Frankfurt and Hanover. McConnell, also wounded, ended up like James in Stalag XI-B near Bad Fallingbostel, the most primitive POW camp in Germany. Bouck and his men were finally imprisoned in Stalag XIII-D in Nuremberg and later in Stalag XIII-C in Hammelburg, where the non-commissioned and enlisted men were split, with the officers sent to Oflag XIII-B. Hammelburg was designed for 300 prisoners, but it soon housed more than 1500 POWs.\nInfantry of the 19th Armored Infantry Bn. with supporting M4 medium tanks from the 47th Tank Bn. (both units of the 14th Armored Division), during the successful drive to Hammelburg, April 5, 1945, following the failed Task Force Baum of March.]]\nCorporal Sam Jenkins and Private First Class Preston were captured before they reached Allied lines, and they later joined Bouck and the rest of the platoon in prison. The men barely survived, most suffering from the advanced effects of malnutrition. When Task Force Baum from Patton's 4th Armored Division attempted to liberate the camp, Captain Abe Baum was surprised at the large number of prisoners and was unable to rescue them all. Almost all of Baum's unit was captured; Bouck was recaptured and was finally released one week before the war ended. He was too weak to file a combat report, and hospitalized for several months after the war ended. He did not think his men had accomplished that much. \"We were in those foxholes and ... what we did was to defend ourselves and try to live through it.\"\nUnit recognition\nAll who were wounded and captured recovered to return home after the war. In 1965, the U.S. Army published a multi-volume history of World War II, including one on The Ardennes: The Battle of the Bulge. Author Hugh M. Cole only briefly mentioned Bouck's platoon, which upset former platoon member William James (who had changed his name from Tsakanikas). James contacted Bouck and encouraged him to get his men proper recognition.\nBouck contacted his former division commander, Lauer, who nominated Bouck for a Silver Star. In June 1966, a Silver Star arrived in Bouck's mailbox, but no other platoon member was recognized. Bouck was shortly afterward interviewed by John S. D. Eisenhower for his book The Bitter Woods, which described the actions of the unit in detail. Columnist Jack Anderson unsuccessfully campaigned for William James (Tsakanikas) to be awarded the Medal of Honor. Congressional hearings on the men's action resulted in a recommendation to the Secretary of Defense that James be awarded the Medal of Honor. The U.S. Army and U.S. Air Force concurred, but the Marine Corps responded that James failed to show sufficient \"intrepidity\". The hearings also resulted in Public Law 96-145, which waived the time limitation exclusively for members of the platoon. It was signed by President Jimmy Carter on December 14, 1979.\nOn October 26, 1981, after considerable lobbying and letter-writing by Bouck, the men of the unit were finally decorated. Fourteen of the 18 were present at the ceremony hosted by Secretary of the Army John O. Marsh. Every man was awarded the Presidential Unit Citation. Four received the Distinguished Service Cross (DSC), five the Silver Star, and nine the Bronze Star with V device for their 10-hour struggle against a 500-man strong German battalion. They were the most decorated unit for their size in all of World War II.\nAll members of the platoon who received individual awards also received the Presidential Unit Citation. Platoon members and the citations they received were:\n* First Lieutenant Lyle J. Bouck Jr. (DSC) °\n* Technical Sergeant William L. Slape (DSC)\n* Private First Class William James Tsakanikas (DSC)\n* Private First Class Risto \"Milo\" Milosevich (DSC)\n* Private John B. Creger (Silver Star)\n* Private Louis J. Kalil (Silver Star)\n* Corporal Aubrey P. \"Schnoz\" McGeehee (Silver Star)\n* Private First Class Jordan H. \"Pop\" Robinson (Silver Star)\n* Private James R. \"Sil\" Silvola (Silver Star)\n* Private Robert D. Adams (Bronze Star with Distinguishing Device for Valor)\n* Private Robert D. Baasch (Bronze Star with Distinguishing Device for Valor)\n* Sergeant William D. Dustman (Bronze Star with Distinguishing Device for Valor)\n* Private Clifford R. Fansher (Bronze Star with Distinguishing Device for Valor)\n* T/3 James Fort (Bronze Star with Distinguishing Device for Valor)\n* Corporal Samuel L. Jenkins (Bronze Star with Distinguishing Device for Valor)\n* Private Joseph A. McConnell (Bronze Star with Distinguishing Device for Valor)\n* Corporal Robert H. \"Mop\" Preston (Bronze Star with Distinguishing Device for Valor)\n* Sergeant George H. \"Pappy\" Redmond (Bronze Star with Distinguishing Device for Valor)\n* Private First Class Carlos A. Fernandez (Presidential Unit Citation)\n* Private First Class John P. Frankovitch (Presidential Unit Citation)\n* T/5 Robert L. Lambert (Presidential Unit Citation)\n* Private Vernon G. Leopold (Presidential Unit Citation)\n* Private First Class Elmer J. Nowacki (Presidential Unit Citation)\n* Private Samuel J. Oakley (Presidential Unit Citation)\n° Bouck was awarded a Silver Star while a prisoner of war in 1945, although he did not receive it until 1966. This was superseded by his DSC award later.\nLieutenant Warren Springer and his three-man artillery observation unit — Sergeant Peter Gacki, T/4 Willard Wibben, and T/5 Billy Queen - also joined the men in battle. Queen was killed in action before the remainder were captured. All four were awarded the DSC for their valor at Lanzerath.\nIn 2004, the book The Longest Winter was published, documenting the defensive actions of the platoon. Bouck cooperated with the author, Alex Kershaw, but imposed one condition, \"I told him that other authors never wrote about the other men in the platoon, just me. I said I wouldn't talk to him unless he promised that he'd also write about the other men.\"\nOn May 12, 2005, veterans of the 99th Infantry Division and local citizens of Lanzerath, Belgium, dedicated a monument composed of a small brass plaque alongside a bench and a United States flag to commemorate the fight on the grassy hill overlooking the village.\nReferences\nFurther reading\n*\n*\n*\n*\n*\n*\n*\nExternal links\n*\n*"
    }
  ]
}