{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Zelengora\n\n| combatant2        =\n| commander1        =\n| commander2        =  Dragoljub Mihailović Miroslav Trifunović\n| units1            =\n| units2            =\n| strength1         =\n| strength2         = 3,000–4,000\n| casualties1       =\n| casualties2       =\n| campaignbox       =\n}}\nThe Battle of Zelengora was the final battle between the Partisans and the Chetniks that was fought between 12 and 13 May 1945. At the time of the battle, World War II in Europe had already officially ended and Partisan units had reorganized into the Yugoslav Army. Chetnik forces attempted to reach Serbia from Bosnia, through Zelengora, Drina and Sandžak. The Partisans prevented their attempt by creating a \"buffer zone\" in the area around River Bosna-Kalinovik-Motajica-Travnik. The Partisans were ultimately victorious, inflicting heavy losses to the Chetniks, who were de facto destroyed as a movement.\nBackground\nAfter his split with forces loyal to Pavle Đurišić, Dragoljub Mihailović's remaining Chetniks from Serbia and Bosnia relocated to the vicinity of Modriča in late March 1945. Đurišić took his forces toward Slovenia, believing that Dimitrije Ljotić could save them from destruction and unite them with the forces of Momčilo Đujić and Dobroslav Jevđević. Ljotić was certain that an armed conflict between the Soviet Union and the Western Allies (who would accept a defeated Nazi Germany as an ally) was inevitable. Mihailović himself was in correspondence with Ljotić via radio, and also met a delegation sent by Ljotić and Hermann Neubacher, led by Ljotić's personal secretary Boško Kostić and Milan Aćimović, the former head of the Commissioner Government and Minister of Interior in Milan Nedić's Government of National Salvation. Kostić tried to persuade Mihailović to join them, too, but Mihailović refused. He agreed to send General Miodrag Damjanović to Slovenia to take command of Serbian quisling forces who were already there. Kostić returned with Damjanović, while Aćimović decided to stay with Mihailović.\nMihailović did not want to go to Slovenia due to false information given to him that purported Serbians were dissatisfied with communist rule. Mihailović was fed this false information by OZNA, the security agency of Tito's partisans, which wanted to prevent Mihailović from escaping Yugoslavia. OZNA had earlier obtained ciphers and call signs from killed Chetnik commander Predrag Raković, and, by January 1945, with the help of a former Chetnik radio-telegraphist, was able to establish contact with and convince Mihailović to believe that he was keeping correspondence with the genuine Chetnik mayor Trivun Ćosić, who supposedly led skirmishes against Tito's partisans. Mihailović was so taken by this facade that he unwillingly revealed to OZNA his plans to send groups of saboteurs and commandos over the Drina River. OZNA and KNOJ were subsequently able to capture or kill all the members of these groups.\nOn 13 April, Mihailović's Chetniks began their march, but, instead of going towards the lower course of the Drina River, where it was impossible to cross the river without boats at this part of year, they went westward along the eastern bank of the Sava River, until they approached the mouth of the Vrbas River. This course was supposed to mislead units of the Yugoslav Army into thinking that the Chetniks were heading towards Slovenia. Mihailović's plan didn't work, as his forces' movements were monitored meticulously by units of the Yugoslav Army. On 15 April, Mihailović's forces arrived in the area around Bosanski Brod and Derventa. The group suddenly turned south and southeast through the mountains, all the way to a point east of Konjic on the Neretva, then to the southeast in the direction of Kalinovik and Zelengora and to the east, again towards Drina, to the point near village Brod, where it was possible to cross the river without difficulty. Along the way, Chetniks had skirmishes with HOS, and arrived in the Fojnica region on 19 April.\nBattle\nOn 7 May, Mihailović's forces numbered some 5,000 to 6,000, among them a few hundred Bosnian Chetniks. However, at Zelengora only 3,000 to 4,000 men arrived, as a column led by Dragoslav Račić separated and went towards Jahorina and Rogatica. In contrast to the Chetniks, the Yugoslav Army was militarily superior, with artillery and an air force.\nThe final battle between the Chetniks and the Yugoslav Army was waged from 10 to 13 May. The Yugoslav Army pushed the Chetniks into a high and steep gorge of the Jezerica River. The Chetniks were consequently exposed to land, artillery and air attacks. During the descent and crossing of the river, the Chetniks were inflicted with heavy losses—a large number of men, all their horses, heavy equipment, archives and radio stations were destroyed, the latter interrupting the radio link between Mihailović and \"Mayor Ćosić\". Only a few hundred Chetniks managed to survive; among them were Mihailović and Nikola Kalabić. General Miroslav Trifunović, Milan Aćimović, Miodrag Palošević, and Neško Nedić, were a notable few among the dead.\nAftermath\nThe battle was a decisive defeat for the Chetniks, after which they became groups of scattered men, chased by the Yugoslav Army, KNOJ and OZNA. Mihailović was able to evade capture and traps set up by Yugoslav security forces, until he was caught ten months later by agents of OZNA, who disguised themselves as Chetniks and were led by his once most trusted ally, Nikola Kalabić.\nReferences\nLiterature\n*\n*\n*"
    }
  ]
}