{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Hatikvah Neighborhood\n\n}}\n| conflict          = Battle of Hatikvah Quarter\n| place             = Hatikvah Quarter, Jaffa, Mandatory Palestine\n| date              = 8 December 1947\n| combatants_header = Belligerents\n| combatant1        = Army of the Holy War\n| combatant2        = Haganah Givati Brigade\n| commander1        = Hasan Salama\n| commander2        = Ze'ev \"Zonic\" Steinberg\nIsrael Schouri\n| combatant1a       = Salameh residents\n| combatant2a       = civilian militia\n| strength1         = 400\n| strength2         = 100\n| partof            = 1948 Arab–Israeli War\n| casualties1           = 70\n| casualties2           = 2\n| result            = Haganah victory\n}}\nOn the evening of December 8, 1947, about four-hundred well-trained Palestinians led by Hasan Salama attacked Hatikva a dense, working-class Temani neighborhood, and were repelled by 100 Jewish fighters, including elements of the recently formed Haganah Givati Brigade.\nThe neighborhood's civilian inhabitants, primarily old Yemenite Jews, responded quickly by rushing into the city's theaters and restaurants and raising the alert.\nThe Arab attack was launched from Salameh, a village near Jaffa, which had also sent 150 gunmen to attack Kibbutz Ef'al days earlier on 4 December and which was believed to be Hasan Salama's base for the Army of the Holy War.\n'The Battle of Hatikvah' was the first military battle of the 1947-48 Civil War in Mandatory Palestine.  On the night of December 8, 1947, 400 Arab Nationalist fighters commanded by Hasan Salama attacked the Hatikvah and Beit Yaakov neighborhoods. The attack was repulsed with heavy Arab losses.\nBackground\nMore than 7,600 Palestinian Arabs lived in Salameh.  Until the events of 1947, the village elders and notables tried to maintain good relations with the Jews.  Salameh residents often sold eggs and produce to the Jews of the Hatikva neighborhood.  With the UN Partition declaration and subsequent tumult, unrest began in the village and the extremist youth (the Shabab), influenced by outside agitations, prevailed over the elders of the village.\nThe border between Salameh and Hatikvah was undefended and unfenced, and considered difficult to defend due to being mostly tangled orchard. To address the issue, the Haganah strategically placed a line of guard dogs, the \"Dog Line,\" to serve as an alert in the case of Anti zionist attacks.\nThe British timid response to the violence was blamed for encouraging the disorder to continue. The Yeshuv planned a retaliatory attack against the Arabs to blow up a house in Salameh as a \"warning shot\". The saboteurs successfully detonated the building on 7 December and returned unscathed under heavy Arab fire.\nIn response, Hasan Salama took advantage of the situation and planned to \"teach the Jews a lesson\" by executing a battleplan he'd already prepared.\nThe low-income Beit Yakov neighborhood, to the south of Hatikvah and also bordering Salameh, was also challenging to defend due to the layout of the houses at the foot of Salameh.\nNeighborhood residents were recruited to its defense by Ze'ev \"Zonik\" Steinberg, part of the Givati Brigade's 53rd.\nHostilities broke out immediately after the Partition Plan was approved by the UN on November 30, 1947.  150-200 gunmen from Salameh launched an attack on Ramat Ef'al on 4 December.\nThere were days of unrest and skirmishes on the outskirts of Tel Aviv in the days before the battle. On 4 December, a minor incursion by Arabs into Tel Aviv torched several buildings and their steady gunfire kept Yeshuv firefighters unable to reach the scene. On 5 December, a Haganah defense patrol was fired on by Salameh residents, resulting in one death, Nissim Aziz, the first casualty of Israel's War of Independence.  A unit sent to recover the body was fired upon by a British patrol car, resulting in the death of Micah Fischer. Soon, Yaakov Schiff was killed by a unit under the command of British Sergeant Fleur (who was already controversial from the killing of Bracha Fuld, after men under his command took her to an interrogation room instead of hospital while she bled out from gunshot wounds).  Schiff's comrades were arrested for the possession of weapons.\nThe killing of Schiff provoked an uproar, and a mob of Jewish residents of Hatikvah surrounded a patrol car demanding the release of the arrested fighters and Fleur's arrest. Fleur was subsequently released on lack of evidence, while the arrested fighters from Schiff's unit were sentenced to five years in prison.\nThe three deaths––Aziz, Fischer and Schiff––are considered the first Haganah deaths of the 1948 Palestine war and are commemorated at the Three Fighters Circle in northern Tel Aviv.\nSalama recruited 800 Arab fighters from the villages of Lod, Ramla and Nablus for the attack. He instructed the civilians of Salameh to prepare sacks and torches to loot the Beit Yakov and Hatikvah neighborhoods, planning the attack for Monday, 8 December.  He hoped a successful attack would inspire more Arabs to enlist.\nOn the morning of 8 December, Tel Aviv headquarters received warning that 400 Arab fighters were seen mobilizing in the area and declared a \"very serious situation.\"  They did not know where the attack would come from but instructed militia to be ready.  \"We must wait for an attack on Tel Aviv\"\nAttack preparations\nImmediately after the UN Partition vote on 30 November 1947, the Supreme Muslim Council headed by Amin al-Husseini appointed Hasan Salama to command the Arab forces in the Lod-Ramla area.\nBattle\nAt 19:00, intense machine gun fire erupted. Salama's forces breached the \"Dog Line\" and defenders noticed Arab fighters moving into the orchards. Ze'ev Steinberg and five other fighters responded immediately and managed to stop the Arabs' advance.  This advance was a feint attack, intended to trick the defenders to the neighborhood of Beit Yakov instead of the main assault at Hatikvah.\nSoon, the real battle began.  Hundreds of Arab soldiers and torch-and-pitchfork wielding Salameh residents stormed the neighborhood in waves.  The Haganah defenders had difficulty with most of its weapons and grenades malfunctioning, due to improper storage, and ordered a tactical retreat.\nThe attackers encroached several hundred meters. Rather than advance further into the breach, the Arabs instead began looting and torching Jewish homes and shops.\nsoldiers to die in the Israeli War of Independence, Nissim Aziz (18), Micah Fischer (21) and Yaakov Schiff (19)]]\nSoon, Haganah reinforcements arrived to Beit Yakov and plugged the holes in the defensive line. A 16-year old defender figured out the Arabs were using \"Arab-al-Arab\" as a code phrase and thus tricked several attackers into advancing into his grenade range.\nAt the same time, Haganah reinforcements, a machine gun unit, reached the road to Salameh. They opened fire on the Arab looters, who were clearly illuminated against the blaze.  As Arab forces began retreating towards Salameh, they were flanked by machine gun fire.\nThe battle lasted until 22:00, ending in a decisive Arab defeat, with 70 Arab casualties. It took all night for British and Red Crescent to retrieve the bodies of the attackers. Two Jewish civilians were killed, elderly residents who had refused to evacuate their shack and were burned alive. 32 homes were burned and 60 Jewish families were left homeless.  It was the second night of Chanukah.\nAftermath\nThe Battle of Hatikva was the first battle between the Haganah and the Arab irregulars.\nThe Arabs initially spread the false rumor that they had prevailed and burned Hatikvah neighborhood to the ground, but once the truth was clear, the jubilation in Ramle turned to a day of mourning.\nThe defeat struck a blow to Hasan Salama's reputation and failed to motivate recruitment to his Antizionist forces. He restrategized to less ambitious attacks on Jewish transportation and supply lines.\nAfter the battle, Ze'ev \"Zonik\" Steinberg and his men went to celebrate at a cafe where they were happily received by artists and poets. When Hanna Rovina was asked to read Nathan Alterman's pacifist poem, (\"Don't Give Them Guns\"), she looked at the boys and declared, \"give them guns!\"\nThe village of Salameh engaged in sniping attacks for the rest of the war, until 28–30 April, when the village was depopulated.  The IDF surrounded the village minus a narrow escape corridor, and the Arab forces and residents retreated without firing a shot.  The emptied homes were used to house half Tel Aviv residents who had lost their homes to Antizionist attacks, and half newly arrived olim.\nReferences\n* Ettinger, Amos (1994). ''My land of tears and laughter: the story of \"Zonik\" (Col. Ze'ev Shaham), a man of many friends''. New York: Cornwall Books. ."
    }
  ]
}