{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Saločiai (1794)__disambig_1\n\nRussian Empire\n| commander1        =  Romuald Giedroyć\n| commander2        =  Sergey Golitsyn\n| strength1         = About  6004 cannons\n| strength2         = 2,500–3,000 11 guns\n| casualties1       = Light\n| casualties2       = Heavy\n| image             = Tadeusz Brodowski - Kosynier.jpg\n| image_size        = 290px\n| caption           = Tadeusz Brodowski Kosynier\n}}\nBattle of Saločiai (, , ) was a battle fought during the Kościuszko Uprising on July 29, 1794, between the troops of Grand Duchy of Lithuania under the command of General Prince Romuald Giedroyć and the Russian troops of Prince Sergei Fedorovich Golitsyn.\nBattle\nEarly in the morning, after four o'clock, the insurgents came across the Russians in formation, who, trusting in their numerical superiority, began to attack. The Lithuanians greeted the enemy infantry with a massive and very effective artillery fire, which embarrassed the overconfident Russians.\nThen, for almost four hours, an exchange of artillery fire was conducted. The Lithuanian artillerymen showed better training, because they blew up two of the enemy's ammunition wagons while losing only one. General Giedroyć pushed his entire infantry into the attack, including pikemen and scythemen. This unexpected attack completely discouraged the Russians, who, having formed a square, began to withdraw from the square.\nThis retreat assured Giedroyc of the possibility of completely crushing the enemy. Staking everything on one card, the general pushed his cavalry to the rear of the Russians, and once again threw the infantry supported by artillery fire to the side of the square. The violent attack led to the breaking of the square and the panicky escape of the Russians. The retreat ended only beyond the Mūša River, in which many Russian soldiers drowned. Giedroyc was content with collecting weapons, ammunition and a large amount of equipment from the battlefield. Only the recovery of the Russian cannons and ammunition wagons sunk in the retreat had to be postponed, as they were protected by fire from the opposite bank.\nThe battle of Saločiai demonstrated the great determination and bravery of the insurgent army, which, despite being several times superior in men and firearms, defeated the regular tsarist troops.\nReferences"
    }
  ]
}