{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Nsamankow\n\n| place             = Ghana\n| coordinates       =\n| map_type          =\n| map_size          =\n| map_marksize      =\n| map_caption       =\n| map_label         =\n| territory         =\n| result            = Ashanti victory\n| status            =\n| combatant1        =  United Kingdom of Great Britain and Ireland\nFante Confederacy\n| combatant2        =  Ashanti Empire\n| combatant3        =\n| commander1        =  Sir Charles MacCarthy\n| commander2        = Amankwatia\n| commander3        =\n| units1            =\n| units2            =\n| units3            =\n| strength1         = 80 British troops\n170 Cape Coast militia\n240 Fante allies\n| strength2         = Over 10,000 troops\n| strength3         =\n| casualties1       = 187 killed\n92 wounded\nunknown number captured\n| casualties2       = Unknown\n| casualties3       =\n| notes             =\n| campaignbox       =\n}}\nThe Battle of Nsamankow was a battle between the United Kingdom and the Ashanti Empire that took place in 1824 as part of the First Anglo-Ashanti War.  The British force under Charles MacCarthy was defeated by an Ashanti force.\nBackground\nIn late 1823, following the disagreements between the Fante and the Ashantis, the British declared war on the king of the Ashanti; after organising the defences of Cape Coast, MacCarthy set out with an expedition of some 80 men of the Royal African Colonial Corps (RACC), 170 men of the Cape Coast Militia, and 240 Fanti tribesmen under their local chiefs. He was accompanied by a captain and an ensign of the 2nd West India Regiment, as aides-de-camp, a surgeon of the same regiment, and J. T. Williams, his colonial secretary. This was not the only part of his force; three other groups of infantry were in the region, one of 600 regulars of the RACC and 3,000 native levies, one of 100 regulars and militia and 2,000 levies (under Major Alexander Gordon Laing), and a third of 300 regulars and militia and 6,000 levies. The plan was for the four groups to converge and then engage the enemy with overwhelming force.\nThe battle\nOn the night of the 20th, still without having joined forces with the other three groups, MacCarthy's force camped by a tributary of the Pra River. The next day, at around 2pm, they encountered a large enemy force of around ten thousand men; believing that the Ashanti army contained several disaffected groups whose chiefs were willing to defect, MacCarthy instructed the band to play God Save the King loudly. The Ashanti responded by approaching closer, beating war drums, and his beliefs were swiftly dispelled.\nFighting started shortly thereafter; the two sides were separated by a -wide stream, which the Ashanti attempted to cross by felling trees for bridges.  The British opened fire on the Ashanti troops who tried to cross the exposed tree trunks.\nHowever, the British forces were lightly supplied; the bearers bringing the supplies up in the rear, which included most of the gunpowder and ammunition, mostly fled after hearing the firing in the distance and encountering deserters straggling back. Four cases of supplies arrived; the first was opened and the shot inside was distributed, but the other three were found to contain only macaroni. As the British ran out of ammunition, the Ashanti advanced across the river.  Most of the Fante militia fled, and the British who stood and fought were overwhelmed in hand-to-hand combat.\nMacCarthy, along with the ensign and his secretary, attempted to fall back; he was wounded by gunfire, however, and killed himself rather than be taken prisoner. MacCarthy's gold-rimmed skull was later used as a drinking-cup by the Ashanti rulers.\nEnsign Wetherell was killed whilst trying to defend MacCarthy's body and Williams taken prisoner. On his return, he related that he had only survived through being recognised by an Ashanti chief for whom he had done a small favour, and was spared; he was held prisoner for several months, locked in a dwelling which he shared with the severed heads of MacCarthy and Wetherell, kept as trophies of war.\nAftermath\nSome weeks after the battle, a larger British force made up of White and Native troops came to a standstill with the same Ashanti army that defeated McCarthy's force. Casualties on the British side included 176 dead and 677 men wounded. After the battle, the British army along with their regular troops withdrew back the coast.\nLiterary References\nThe battle and the wider campaign features in Flashman and the Golden Sword, written by Robert Brightwell. This, in turn, was based on the first-hand account of the battle by Captain Ricketts, one of the few survivors.\nReferences\nBibliography\n*"
    }
  ]
}