{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Bình Lệ Nguyên\n\nBạch Hạc, Vĩnh Phúc province, Northern Vietnam\n|result= Mongol victory; Trần Thái Tông and the Viet court abandoned capital Thang Long.\n|combatant1=Đại Việt (ruled by the Trần dynasty)\n|combatant2=Mongol Empire\n|commander1=Trần Thái Tông Lê Tần\n|commander2=UriyangqadaiChechegtuAju  Qaidu\n|strength1= –\n|strength2= 13,000–25,000  Atwood: 3,000 Mongols and 10,000 Yunnanese  Taylor: 5,000 Mongols and 20,000 Yunnanese\n|casualties1=\n|casualties2=\n|}}\nThe Battle of Bình Lệ Nguyên was a battle between the invading Mongol forces led by Uriyangkhadai and Đại Việt forces led by king Trần Thái Tông. The battle took place on the field of Bạch Hạc, now located in Vĩnh Phúc province, northwest of Hanoi in mid-January 1258. The Mongol army defeated the Vietnamese counter forces of war elephants but failed to capture Trần Thái Tông as he escaped by boat, and the capital Thang Long, which was captured and sacked by the Mongols five days later.\nPrelude\nUriyangqadai, the son of Sübedei, along with Kublai and Wang Dezhen, commanded more than 100,000 soldiers marching south and conquered the Dali Kingdom in Yunnan in winter 1253–1254. He and his son Aju, spent years in the region to pacify local Yunnanese tribes and receive the surrender of Dali King Duan Xingzhi in 1255. Having Yunnan pacified under Mongol rule, in the autumn of 1257, Uriyangqadai addressed three letters to the Vietnamese king Trần Thái Tông demanding passage through to southern China. After the three successive envoys were imprisoned in the capital Thang Long (modern-day Hanoi) of Dai Viet, Uriyangwadai invaded Dai Viet in December 1257 with generals Chechegtu, Qaidu, and his son Aju in the rear, departed from modern-day Kunming in three columns.\nBattle\nOn 17 January 1258, king Trần Thái Tông led his army from atop an elephant to confront the Mongols in the field of Bach Hac, south bank of the Red River, 35 kilometers west of Hanoi–with elephants and infantry. The Mongol army consisted of Yunnanese foot soldiers and Mongol cavalry arrived shortly after, from the northern banks of the Red River. Uriyangqadai however ordered his men to not engage the Viet forces. One of his commanders, Chechegtu, however, crossed the river and engaged the Viets, which tasked Uriyangqadai to follow him. Despite the uncoordination and facing Vietnamese war elephants, the Mongols fought off the battle. Aju ordered his troops to fire arrows at the elephants' feet. The panicking animals turned back and trampled their own infantry lines, and caused disorder in the Vietnamese army, which was routed. Thái Tông's vanguard commander had persuaded the king to flee the despairing battle. The Vietnamese senior leaders were able to escape on pre-prepared boats while part of their army was destroyed at No Nguyen (modern Viet Tri on the Red River).\nAftermath\nThe Yuan Shi tells the initial aftermath of the battle:\n}}\nKing Thái Tông fled to an offshore island while the Mongols occupied Hanoi and massacred all of its civilians in revenge for the death of one imprisoned Mongol envoy. Fearing of his disobeyment to Uriyangqadai during the battle, Chechegtu drank poison and committed suicide during brief Mongol occupation of Hanoi. After 9 days, Uriyangqadai retreated his forces back to Yunnan. In March 1258, crown prince Trần Hoảng became the new king of Đại Việt as his father king Thái Tông retired. Uriyangqadai demanded that one of the king's princes or brother would be sent to Khanbaliq as hostage, and the king began sending tribute to the Mongol court of Kublai in Khanbaliq.\nThe Shizu ping Yunnan bei (Kublai Khan’s Pacification of Yunnan) stele in Dali (erected c. 1304) praises Uriyangqadai for his brief but successful campaign against Jiaozhi (Dai Viet) and capturing its capital Hanoi.\nReferences\nNotes\nCitations\nBooks\n*\n*\n*\n*\n*\n*\n*\n*\nArticles\n*\n*\n*"
    }
  ]
}