{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Hancock__disambig_1\n\n&ndash;\n|place= near Hancock, Maryland and modern-day Burnt Factory, West Virginia\n|result=Inconclusive\n|combatant1=  United States (Union)\n|combatant2=  CSA (Confederacy)\n|commander1=Frederick W. Lander\n|commander2=Thomas J. Jackson\n|strength1=\n|strength2=\n|casualties3=25\n}}\nThe Battle of Hancock was fought during the Confederate Romney Expedition of the American Civil War on January 5 and 6, 1862, near Hancock, Maryland.  Major General Stonewall Jackson of the Confederate States Army, commanding his own Valley District and Brigadier General William W. Loring's force known as the Confederate Army of the Northwest, began moving against Union Army forces in the Shenandoah Valley area on January 1.  After light fighting near Bath, Virginia, Jackson's men reached the vicinity of Hancock late on January 4 and briefly fired on the town with artillery.  Union Brigadier General Frederick W. Lander refused a Confederate request to surrender on January 5, and that day and the next saw exchanges of artillery fire between the two sides.  The Confederates burned a bridge on the Baltimore and Ohio Railroad on January 5, but withdrew on the 7th.  Jackson later moved against Romney, Virginia, and occupied the town on January 15 after Union soldiers abandoned it.  Romney was ordered abandoned on January 30 by the Confederate States Secretary of War after Loring complained about Jackson's orders.\nBackground\nIn late December 1861, during the American Civil War, Major General Stonewall Jackson of the Confederate States Army was tasked with defending the Shenandoah Valley in the state of Virginia.  Between his own Valley District and Brigadier General William W. Loring's Confederate Army of the Northwest, Jackson had about 7,500 volunteer soldiers, as well as about 2,200 militiamen and roughly 660 cavalrymen; a force he viewed as insufficient to hold the valley against the Union Army.  After writing to General Joseph E. Johnston, Jackson received permission to attack the Union position at Romney, Virginia, before Union troops received additional reinforcements.  Jackson also intended to capture the towns of Bath, Virginia, and Hancock, Maryland, although Johnston may not have known about that portion of the plan.67}}\nThe movement for the campaign began at 06:00 on January 1, 1862, with the Stonewall Brigade leading the way followed by Loring's men.  Other units, including the militia component and the Rockbridge Artillery fell behind schedule; Jackson's train did not move until 16:00.  The weather was cold during the march and Loring strongly disagreed with Jackson's handling of the campaign.70}}  The Confederates reached Bath on January 3 and skirmished with Union troops outside the town, but were unable to capture it.74}}  The next day, the Union troops abandoned Bath and retreated after a brief fight, escaping across Sir Johns Run to Hancock.  After reaching the vicinity of Hancock with the leading elements of his force, Jackson ordered the Rockbridge artillery to fire on the civilian-filled town, in revenge for Union bombardments of Shepherdstown, Virginia, in 1861.  The artillery fire began at about 18:00 and continued to about 23:00, damaging some buildings but causing no casualties.  That night, Union Brigadier General Frederick W. Lander arrived in Hancock to take command; he planned for aggressive action against the Confederates the next day.79}}\nBattle\nBy the morning of January 5, the temperature had fallen to , where it would remain steady for the next three days.  The Stonewall Brigade was brought up that morning, and Jackson aligned his men on Orrick's Hill across the flooded and ice-choked Potomac River from Hancock.  At 09:30, Colonel Turner Ashby was sent across the river with a request for Lander to surrender; Jackson warned that he would shell and then capture the town if Lander refused.  Upon meeting Lander, Ashby was instructed to tell Jackson to \"bombard and be damned\" and was given a written rejection of the offer.  While Ashby returned to the Confederate lines, Lander ordered that civilians leave the town and assigned the 84th Pennsylvania Infantry Regiment to serve as a fire brigade in case the coming bombardment started any fires.  The 110th Pennsylvania Infantry Regiment defended warehouses, and two pieces of artillery were positioned on a hill behind the town.  The Confederate cannons opened fire at about 14:00, and a sporadic artillery duel which inflicted no casualties continued until dusk.81}}  A Confederate detachment under Colonel Albert Rust destroyed a bridge over the Big Cacapon River belonging to the Baltimore and Ohio Railroad, while another detachment failed in an attempt to destroy a dam upriver from Hancock.81}}\nWhile Jackson opened January 6 with a bombardment of Hancock by the Rockbridge Artillery, Lander still desired to take offensive action against Jackson.  He asked Major General Nathaniel P. Banks to either cross the Potomac in Jackson's rear or to send him reinforcements, with which Lander would attack the Confederates directly.  Banks had ordered Brigadier General Alpheus Williams's brigade to march towards Hancock on January 5, but sent the request for offensive action through Major General George B. McClellan, who viewed it as too risky and rejected it.  Later that day, Jackson attempted to cross the Potomac at Sir Johns Run, but was repulsed.  Having damaged the telegraph lines in the area, Jackson abandoned the attempt to take Hancock on January 7 and withdrew.83}}  The exchanges of artillery fire had caused little damage.  The National Park Service estimates that the two sides combined suffered about 25 casualties during the fighting.\nAftermath and preservation\nThe Confederate retreat was made difficult due to low wind chills and the failure to properly shoe the command's horses before the campaign.  After halting at Unger's Store, Virginia on the night of January 7/8, Jackson learned that Union forces from Brigadier General Benjamin F. Kelley's command had defeated a Confederate outpost at Blue's Gap as a diversion in support of Lander.85}}  While Jackson was informed of the Union withdrawal from Blue's Gap after the fight, he viewed it as possible that the Union forces at Romney posed a threat to Winchester, Virginia and decided to move against Romney.88}}  Poor weather kept Jackson's force stuck at Unger's Store until January 13, but the Confederates then advanced to Romney, which was evacuated by the Union soldiers on January 15.  Jackson relocated to Winchester with the Stonewall Brigade, while leaving Loring to hold Romney.  Loring complained to the Confederate government about Jackson's handling of the campaign and being left in an isolated area with his troops while Jackson was in Winchester, and Confederate Secretary of War Judah P. Benjamin ordered Romney evacuated on January 30.  Jackson resigned over the affair but was talked into rescinding the resignation by Governor of Virginia John Letcher.  Loring received a promotion and was transferred out of the region.\nA unit of the Chesapeake and Ohio Canal National Historical Park is located along the Potomac near Hancock, and includes several signs commemorating the battle.  The town of Hancock and the Confederate artillery positions can also be seen from the site.  Hancock held commemorative events for the battle from January 5 through 7th, 2012.  The battlefield is divided by US Route 522, although many of the battlefield features are still intact, including two churches damaged during the fighting.  None of the battlefield has been listed on the National Register of Historic Places, although a 2010 study by the American Battlefield Protection Program determined that  may be eligible for listing.  About  of the battlefield are owned through protective stewardship, including tracts owned by the National Park Service and the Maryland Department of Natural Resources.16}}\nReferences\nSources\n*\n*\n*"
    }
  ]
}