{
  "content": [
    {
      "type": "text",
      "text": "# Battleship Cove\n\n| established   = 14 August 1965\n| dissolved     =\n| location      = Fall River, Massachusetts\n| type          = Maritime museum\n| visitors      =\n| director      =\n| curator       =\n| publictransit = [http://www.srtabus.com Southeastern Regional Transit Authority]\n| website       = [http://www.battleshipcove.org www.battleshipcove.org]\n}}\nBattleship Cove is a nonprofit maritime museum and war memorial in Fall River, Massachusetts, United States.  Featuring the world's largest collection of World War II-era naval vessels, it is home to the highly-decorated battleship . It is located at the heart of the waterfront at the confluence of the Taunton River and Mount Hope Bay and lies partially beneath the Braga Bridge and adjacent to Fall River Heritage State Park.\nThe memorial traces its origins to the wartime crew of Massachusetts, who fought to save it from being broken up and ensure its preservation as a museum ship.\nThe battleship forms a small cove which serves as a protected harbor for pleasure craft during the summer months. The Fall River Yacht Club maintains a dock nearby. The site also contains the historic 1920 Lincoln Park Carousel made by the Philadelphia Toboggan Company, PTC #54, originally located at Lincoln Park in nearby North Dartmouth, Massachusetts, restored by local vocational high school students and installed in a new pavilion in the early 1990s. A fairground organ provides the carousel's music. The type of organ is unknown, but it plays Wurlitzer 150 rolls.\nHistory\nFormally registered as the U.S.S. Massachusetts Memorial Committee, Inc., Battleship Cove was incorporated as a nonprofit educational organization and granted §501(c)(3) status by the Internal Revenue Service in 1964. Led by veterans who had served aboard Massachusetts during World War II, the group was responsible for the U.S. Navy's donation of the decommissioned vessel and its subsequent public display.\nIn its first year open to the public, more than 250,000 visitors explored the ship. Soon after, the battleship was recognized as the official memorial to Massachusetts citizens who gave their lives in World War II and her interior spaces were reconfigured to accommodate exhibits.\nExpansion\nIn 1972, , a World War II-era , joined the battleship for public display. Also that year, the Nautical Nights overnight camping program commenced as a model program, enrolling more than 500,000 youths to date. The following year, , a , was added to the fleet and immediately designated as the Commonwealth’s official memorial to the Korean and Vietnam Wars.  Massachusetts was subsequently designated the Commonwealth's official memorial to veterans of the Gulf War.\nSoon after the arrival of the USS Joseph P. Kennedy Jr., the Mayor of Fall River christened the site “Battleship Cove”. In 1975 Tin Can Sailors, Inc., a national organization of 24,000 destroyer veterans, was founded at Battleship Cove.\nIn 1984 a North American T-28 Trojan was added. This aircraft served as a US trainer, and also served in the VNAF Republic of Vietnam Air Force, reflecting immigrants in the Commonwealth who had served in the Vietnamese armed forces. A new gift shop helped fuel the organization’s growth. In 1985, the Commonwealth awarded a $2.5 million grant for the preservation of Joseph P. Kennedy Jr., and in that same year the National Park Service designated Massachusetts, Lionfish, and PT-796 as National Historic Landmarks (NHL). Subsequently, both Joseph P. Kennedy Jr. and PT-617 received NHL status, giving Battleship Cove the highest concentration of such south of Boston. Comprising eight vessels, the Battleship Cove fleet is the largest and most diverse collection of historic naval ships in the world.\nIn the 1990s the organization continued to improve with over sixty new exhibitions related to the historic ships and veterans. The success of the overnight program, high visitation from school groups, and general admissions supported an expanded staff and improved ship maintenance efforts. On June 14, 1997, the Cove acquired a Cold War relic: the Soviet-built East German Navy missile corvette . Three years later, the Commonwealth awarded Massachusetts and Lionfish a $10 million grant for significant, dry-dock restoration work.\nSince 1964, Battleship Cove has hosted more than 5 million youth, veterans, and tourists. As goals for continued success as an educational, historical museum, the Cove is dedicated to expanding and sustaining its outreach with programs like the Battleship Cove Community Boating Program, the Raytheon Inspiring Technological Exploration (RITE) Program, and the Veterans’ Voices Oral History Program\nExhibits\nUSS Massachusetts\nThe largest vessel in the Battleship Cove fleet, the  battleship , is the centerpiece of the collection. Known as \"Big Mamie\" to her crewmembers during World War II, she was the seventh ship of the United States Navy to be named in honor of the sixth state. Her keel was laid down 20 July 1939 at the Fore River Shipyard of Quincy, Massachusetts. She was launched on 23 September 1941 sponsored by Mrs. Charles Francis Adams III, and commissioned on 12 May 1942 at Boston, Massachusetts, with Captain Francis E. M. Whiting in command.\nMassachusetts received eleven battle stars for World War II service and earned a reputation as a \"Work Horse of the Fleet\". During World War II, no United States Navy personnel were killed in action while aboard Massachusetts. It is said that \"Big Mamie\" fired both the first US Navy  shells of World War II (at the Vichy French battleship  in the Naval Battle of Casablanca during Operation Torch); and the last (at a Japanese steel works at Hamamatsu), hours before the war ended.\nUSS Massachusetts is one of eight United States battleships of the many that were produced in the first half of the 20th century remaining as museum ships.\nUSS Joseph P. Kennedy Jr.\nUSS Joseph P. Kennedy Jr. (DD-850) is a Gearing-class destroyer of the United States Navy. The ship was named after Joseph P. Kennedy Jr., a naval aviator, son of the former Ambassador to Britain Joseph P. Kennedy Sr. and older brother of future President John F. Kennedy. Joseph P. Kennedy Jr. is on display as a museum ship in Fall River, Massachusetts. Among the highlights of its service are the blockade of Cuba during the Cuban Missile Crisis and the afloat recovery teams for Gemini 6 and Gemini 7. Joseph P. Kennedy Jr. was decommissioned in 1973, and brought to Battleship Cove the following year.\nIn the spring of 2000, Joseph P. Kennedy Jr. was brought to Rhode Island Sound for the movie Thirteen Days, portraying both herself and .\nUSS Lionfish\nUSS Lionfish\nUSS Lionfish (SS-298), a Balao-class submarine, was the only ship of the United States Navy named for the lionfish, a scorpaenoid fish found in the West Indies and the tropical Pacific. After completing her shakedown cruise off New England, she began her first war patrol in Japanese waters on 1 April 1945. Ten days later, she dodged two torpedoes fired by a Japanese submarine and on 1 May destroyed a Japanese schooner with her deck gun. After a rendezvous with the submarine , she transported B-29 survivors to Saipan and then made her way to Midway Island for replenishment.\nOn 2 June she started her second war patrol, and on 10 July fired torpedoes at a surfaced Japanese submarine, after which Lionfishs crew heard explosions and observed smoke through their periscope. She subsequently fired on two more Japanese submarines and ended her second and last war patrol performing lifeguard duty (the rescue of downed fliers) off the coast of Japan. When hostilities ended on 15 August she headed for San Francisco and was decommissioned at Mare Island Navy Yard on 16 January 1946.\nLionfish was recommissioned on 31 January 1951, and headed for the East Coast for training cruises. After participating in NATO exercises and a Mediterranean cruise, she returned to the East Coast and was decommissioned at the Boston Navy Yard on 15 December 1953.\nIn 1960, the submarine was called to duty again, this time serving as a reserve training submarine at Providence, Rhode Island. In 1971, she was stricken from the Navy Register, and in 1973, she was unveiled for permanent display as a memorial at Battleship Cove, where she has evolved into one of the museum’s most popular exhibits and a monument to all submariners.\nHiddensee\nOriginally commissioned by the East German Navy as Rudolf Egelhofer, Hiddensee was a  built at the Petrovsky Shipyard in 1984, located near the former Soviet (now Russian) city of Leningrad (now St. Petersburg). An example of a Soviet-built missile corvette, Hiddensee was designed to oppose any naval threat to the East German coast, and to fulfill this mission carried long-range Styx anti-ship missiles and an array of defensive weapons designed to ensure her own survival.\nFollowing the reunification of Germany, Hiddensee served with the Federal German Navy until her decommissioning in April 1991. Shortly thereafter she was reactivated and transferred to the U.S. Navy. Joined briefly by a crew of 20 former East German sailors, a small civilian U.S. crew conducted extensive testing with the vessel at the U.S. Navy's Solomons, Maryland facility in the Patuxent River. After 50 underway deployments in the Chesapeake Bay and Virginia Capes areas, Navy budget cutbacks severely curtailed operations, but she continued on as a research vessel until April 1996.\nHiddensee joined the Battleship Cove fleet in Fall River on June 14, 1997, where she spent 26 years. During her time there, she was moored on the port side of Lionfish. Hiddensee was closed to the public after December 2021 following a gangway collapse. Due to a lack of funding, Battleship Cove was unable to maintain her and quietly sold her for scrap in October 2023.\nPT boats\nPT-796 was acquired 1975, followed in 1984 by PT-617, forming the only pair of restored PT boats on display in the world. PT-617 is the only remaining Elco PT boat on display similar to that of John F. Kennedy's PT-109.\nUSS Fall River\nUSS Fall River (CA-131) was a  heavy cruiser launched 13 1944. In 1946 she participated in the Operation Crossroads nuclear weapons tests in the Marshall Islands, followed by a short tour of duty in the Far East in 1947, after which she was placed out of commission in reserve at the Puget Sound Navy Yard.\nThe tip of her bow is now on display at Battleship Cove.\nSee also\n* Battleship Cove (MBTA station)\n* List of battleships of the United States Navy\n* List of maritime museums in the United States\n* List of museum ships\n* U.S. Navy museums (and other battleship museums)\nReferences\nExternal links\n* [http://www.battleshipcove.org Battleship Cove Naval Museum homepage]\n* [http://www.williammaloney.com/Aviation/PTBoat/index.htm PT-617]—Photos of the Elco PT boat PT-617\n* [http://www.williammaloney.com/Aviation/HigginsPTBoat/index.htm PT-796]—Photos of the Higgins PT boat PT-796\n* [http://www.williammaloney.com/Aviation/DestroyerJosephPKennedy/index.htm USS Joseph P. Kennedy]—Photos on board the destroyer Joseph P. Kennedy Jr. DD-780\n* [http://www.williammaloney.com/Aviation/SubmarineLionfish/index.htm USS Lionfish]—Photos on board the submarine USS Lionfish SS-298 in Fall River, MA\n* [http://www.williammaloney.com/Aviation/Hiddensee/index.htm Hiddensee]—Photos on board the Soviet missile corvette Hiddensee at the Battleship Cove Naval Museum in Fall River, MA\n* [http://www.williammaloney.com/Aviation/BattleshipUSSMassachusetts/index.htm USS Massachusetts]—Photos on board the battleship USS Massachusetts BB-59 in Fall River, MA"
    }
  ]
}