{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Sant Llorenç de la Muga\n\nFrance\n|combatant2= Spain Portugal\n|commander1= Jacques Dugommier Pierre Augereau\n|commander2= Luis Fermín de Carvajal, Conde de la Unión John Forbes\n|strength1=10,000\n|strength2=20,000\n|casualties1=800\n|casualties2=1,400\n}}\nThe Battle of Sant Llorenç de la Muga  (in Catalan,  in ) was fought on 13 August 1794 between an attacking Spanish–Portuguese army led by the Conde de la Unión and a French army commanded by Jacques François Dugommier. The local French defenders headed by Pierre Augereau and Dominique Pérignon repulsed the allies. The Spanish garrison of Fort de Bellegarde surrendered a month later.\nBackground\nIn 1793 the Spanish army defeated the ill-trained French armies where the Franco-Spanish border touches the Mediterranean Sea. The Siege of Bellegarde resulted in the surrender of the fort to the Spanish army on 24 June. The Spanish army won the Battle of Truillas and several other actions, and seized the port of Collioure in December. In January 1794, the Army of the Eastern Pyrenees received a new commander in General of Division Jacques François Dugommier. Fresh from his triumph at the Siege of Toulon, the new leader reorganized the army. Dugommier set up supply depots, established hospitals, and improved local roads. By the time the French assumed the offensive in April 1794, their army numbered 28,000 regular soldiers, 20,000 garrison troops, and 9,000 hastily trained volunteers.\nDugommier organized the infantry divisions of Generals of Division Pérignon, Augereau, and Sauret, backed by a cavalry reserve under MG André de La Barre. The French defeated their adversaries at the Battle of Boulou on 1 May. Immediately after their victory, they pushed the Allied army south of the Pyrenees and invested both Collioure and the Fort de Bellegarde. Collioure fell on 29 May, but Bellegarde proved to be much more difficult to capture. In a combat at La Junquera on 7 June, Pérignon repulsed a Spanish attempt to relieve Bellegarde, though La Barre was killed while leading his troopers.\nBattle\nAnxious about the beleaguered garrison of Bellegarde, de la Unión assembled an army of 45,000 infantry and 4,000 cavalry. He emerged from his fortified lines covering the Alto Ampurdán to attack Augereau's division on the western flank. The fighting took place near Sant Llorenç de la Muga, the site of a cannon ammunition foundry. The Spanish assault, carried out by 14,000 regular infantry and 6,000 provincial militia, failed to break the French defenders, who received some help from Pérignon's division in the center. Sauret's defenses, on the eastern flank, were not threatened.\nGeneral John Forbes covered the retreat with a Portuguese division consisting of one battalion each of the 1st, 2nd, Olivença, Cascais, Peniche, and Freire de Andrade Infantry Regiments. The French counted 800 casualties, including General of Brigade Guillaume Mirabel killed. The Spanish suffered losses of 1,400 soldiers killed, wounded, and missing.\nAftermath\nThe Marquis of Val-Santaro surrendered Bellegarde to Pérignon on 17 September. The 1,000 starving survivors of the garrison became prisoners, while 68 cannon and 40,000 rounds of cannon shot fell into French hands. French losses during the blockade were light. The next action of the war was the Battle of the Black Mountain in November 1794.\nFootnotes\nReferences\n* [http://www.fortified-places.com/bellegarde.html fortified-places.com Bellegarde by Dominic Goode]\n* Chandler, David, ed. ''Napoleon's Marshals. New York: Macmillan, 1987.\n* Ostermann, Georges. \"Pérignon: The Unknown Marshal\".\n* Smith, Digby. The Napoleonic Wars Data Book.'' London: Greenhill, 1998."
    }
  ]
}