{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Uijeongbu (1951)\n\n:\n*\n*\n| combatant2 =\n| commander1 = * Basil Aubrey Coad\n* Ian Ferguson\n| units1      =  27th British Commonwealth Brigade\n* 3 RAR\n* 1 MR\n* 1 ASHR\n| units2      = Unknown\n| commander2  = Unknown\n| strength1   =\n| strength2   =\n| casualties1 =  9 wounded\n| casualties2 = 7+ killed, unknown wounded\n| campaignbox =\n}}\nThe Battle of Uijeongbu, also known as the Battle of Uijongbu, was fought between 1 and 4 January 1951, at Uijeongbu, South Korea, as part of the United Nations Command (UN) retreat after the third Chinese People's Volunteer Army (PVA) offensive after entering the Korean War. The 3rd Battalion, Royal Australian Regiment (3 RAR) had been defending the approaches north of Seoul, as part of the withdrawal of the United Nations forces and tasked with slowing the Chinese advance to allow the withdrawal of the United States 8th Army.\nBackground\nAfter the PVA launched their Second Phase Offensive on 25 November 1950, UN forces retreated from North Korea towards a defensive line north of Seoul. The 27th British Commonwealth Brigade having withdrawn some  formed the UN rearguard in the Uijeongbu Valley,  north of Seoul, covering the approach to Seoul.\nBattle\nThe 27th British Commonwealth Brigade was sent north on 1 January 1951 to cover the withdrawal route of the US 8th Army, with the 3 RAR in the most forward position at Tokchon. By dusk, the Australians were cut off by forward PVA forces and under increasing risk of being wiped out, 3 RAR was ordered to withdraw south to Uijeongbu. During the withdrawal south the battalion came under heavy fire and the lead elements had to drive through PVA roadblocks, suffering one wounded, while \"A Company\" and \"C Company\" 3 RAR went into action to clear the road, killing seven and suffering four wounded.\nAfter reassembling on 2 January, 3 RAR was tasked to undertake company strength patrols north of Seoul and manning Seoul's northern perimeter with the 1st Battalion, Middlesex Regiment. The 1st Battalion, Argyll and Sutherland Highland Regiment meanwhile protected the main bridges out of Seoul across the Han River.\nOn 3 January, 3 RAR was again sent to Tokchon to cover the withdrawal of the last elements of the US 8th Army, which filtered through the lines of 3 RAR by 20:00. At 23:30, \"D Company\" 3 RAR came under heavy fire from the enemy's forward patrols, suffering four wounded and throughout the night enemy attacks were repulsed. The outposts of 3 RAR were withdrawn back to company headquarters at 05:30 on 4 January to prevent being cut off by increasing PVA forces sweeping in from the west. The expected major attack did not take place, however, and by 08:30 after being ordered south to Seoul, the soldiers saw the PVA taking up the positions just vacated by them.\nWithdrawn to the northern perimeter of Seoul, positions were held while the city was evacuated. At 20:30 on 4 January, 3 RAR were ordered to withdraw south across the Han River, south of Seoul.\nAftermath\nThe fighting at and around Uijeongbu, allowed the US 8th Army to withdraw and Seoul to be evacuated. PVA casualties were at least seven killed and an unknown number wounded, while Australian casualties were at least nine wounded. The 1st Battalion, Argyll and Sutherland Highland Regiment was the last UN unit out of Seoul, while 3 RAR were the last troops across the railway bridge across the Han River. The bridges across the Han River from Seoul were then blown up by US Army Engineers. The 27th British Commonwealth Brigade withdrew to positions around Yoda-nae.\nNotes\nReferences\n*\n*\nFurther reading\n*\n*"
    }
  ]
}