{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Linz-Urfahr\n\n|result=Allied victory\n|combatant1= First French Empire K. of Württemberg Kingdom of Saxony\n|combatant2= Austrian Empire\n|commander1= Jean Bernadotte D. Vandamme\n|commander2= Johann Kollowrat\n|strength1=10,000&ndash;18,000\n|strength2=15,000&ndash;20,000\n|casualties1=391\n|casualties2=883, 4 guns&nbsp;&ndash;&nbsp;891, 6 guns\n}}\n|  zoom = 5\n|   float = right\n|    nolabels = 1\n|     width = 304\n|     height = 160\n| title = War of the Fifth Coalition\n| caption =\n| shapeD=n-circle\n| shape-colorD=navy\n| shape-outlineD=white\n| label-colorD = navy\n| label-sizeD = 12\n| label-posD = left\n| label-offset-xD =\n| label-offset-yD =\n| label1 =\n| mark-coord1 =\n| mark-title1 = Battle of Sacilefrom 15 to 16 April 1809\n| label2 =\n| mark-coord2 =\n| mark-title2 = Battle of Teugen-Hausenon 19 April 1809\n| label-color2 = maroon\n| shape-color2 = maroon\n| label3 =\n| mark-coord3 =\n| mark-title3 = Battle of Abensbergon 20 April 1809\n| label4 =\n| mark-coord4 =\n| mark-title4 = Battle of Landshut (1809)on 21 April 1809\n| label-color4 = maroon\n| shape-color4 = maroon\n| label5 =\n| mark-coord5 =\n| mark-title5 = Battle of Eckmühlfrom 21 to 22 April 1809\n| label-color5 = maroon\n| shape-color5 = maroon\n| label6 =\n| mark-coord6 =\n| mark-title6 = Battle of Ratisbonon 23 April 1809\n| label-color6 = maroon\n| shape-color6 = maroon\n| label7 =\n| mark-coord7 =\n| mark-title7 = Battle of Neumarkt-Sankt Veiton 24 April 1809\n| label8 =\n| mark-coord8 =\n| mark-title8 = Battle of Caldiero (1809)from 27 to 30 April 1809\n| label9 =\n| mark-coord9 =\n| mark-title9 = Battle of Ebelsbergon 3 May 1809Battle of Linz-Urfahron 17 May 1809\n| label-color9 = black\n| shape-color9 = black\n| label10 =\n| mark-coord10 =\n| mark-title10 = Battle of Piave River (1809)on 8 May 1809\n| label11 =\n| mark-coord11 =\n| mark-title11 = Battle of Wörglon 13 May 1809\n| label12 =\n| mark-coord12 =\n| mark-title12 = Battle of Tarvis (1809)from 15 May to 18 May 1809\n| label14 = Aspern\n| mark-coord14 =\n| mark-title14 = Battle of Aspern-Esslingfrom 21 to 22 May 1809\n| label-pos14 = bottom\n| label-offset-x14 = -20\n| label-offset-y14 = -6\n| label-color14 = maroon\n| shape-color14 = maroon\n| label15 =\n| mark-coord15 =\n| mark-title15 = Battle of Sankt Michaelon 25 May 1809\n| label16 =\n| mark-coord16 =\n| mark-title16 = Battle of Raabon 14 June 1809\n| label17 =\n| mark-coord17 =\n| mark-title17 = Battle of Grazfrom 24 to 26 June 1809\n| label18 = Wagram\n| mark-coord18 =\n| mark-title18 = Battle of Wagramfrom 5 to 6 July 1809\n| label-pos18 = right\n| label-color18 = maroon\n| shape-color18 = maroon\n| label19 =\n| mark-coord19 =\n| mark-title19 = Combat of Korneuburgon 7 July 1809\n| label20 =\n| mark-coord20 =\n| mark-title20 = Combat of Stockerauon 8 July 1809\n| label21 =\n| mark-coord21 =\n| mark-title21 = Battle of Hollabrunn (1809)on 9 July 1809Combat of Schöngrabernon 10 July 1809\n| label22 =\n| mark-coord22 =\n| mark-title22 = Armistice of Znaimfrom 10–11 July 1809\n| label-color22 = maroon\n| shape-color22 = maroon\n}}\nThe Battle of Linz-Urfahr on 17 May 1809 saw soldiers from the Austrian Empire fighting against troops from two of Emperor Napoleon's allies, the Kingdom of Württemberg and the Kingdom of Saxony. An Austrian corps led by Feldzeugmeister Johann Kollowrat attacked General of Division Dominique Vandamme's Württembergers who held a fortified bridgehead on the north bank of the Danube opposite the city of Linz. As the combat got underway, Saxons led by Marshal Jean-Baptiste Bernadotte began reinforcing the defenders. This prompted Kollowrat to order a retreat, which was followed up by Napoleon's German allies.\nThe Austrian commander-in-chief, Generalissimo Archduke Charles, Duke of Teschen detached Kollowrat's III Armeekorps from the main army to guard Bohemia. Later, Charles directed his subordinate to threaten Napoleon's long and vulnerable supply line which followed the Danube valley. Accordingly, Kollowrat descended upon the Linz bridgehead, but the presence of a strong defending force thwarted his plans. The action was fought during the War of the Fifth Coalition, part of the Napoleonic Wars. Urfahr is part of the modern city of Linz, on the north bank of the Danube.\nBackground\nAfter his defeat at the Battle of Eckmühl on 21 and 22 April 1809, Archduke Charles withdrew to the north bank of the Danube with 92,000 troops. Of these, the I Armeekorps numbered 28,000, the II counted 20,000, the III had 13,000, the IV included 15,000, the I Reserve mustered 12,000, and General-major Josef Mayer's V Armeekorps brigade had 4,000. Charles regrouped his army at Cham, which is just west of the Bohemian frontier. Convinced that his army was demoralized by its defeat, Charles gave up any thought of counterattacking Napoleon. Instead, he intended to retreat from Cham to Vienna via České Budějovice (Budweis). For his part, Napoleon made up his mind to plunge forward on the south bank toward Austria's capital, Vienna. Consequently, the French emperor called off the brief pursuit by Marshal Louis-Nicolas Davout's III Corps and allowed Charles an untroubled retreat.\nAt the outbreak of the war, Napoleon ordered Bernadotte to march the Saxon army, known as the IX Corps, to the Danube at Regensburg (Ratisbon). Because this left the Kingdom of Saxony unprotected, Bernadotte evacuated the Saxon royal family and the military stores from Saxony's capital Dresden. By 20 April the Saxon troops were at Gera on the way south. Jérôme Bonaparte was ordered to march his Kingdom of Westphalia army, named the X Corps, to hold Saxony.\nWith the Saxon army at large, Archduke Charles worried that Bohemia might be overrun and decided to leave one army corps to defend the province. For this task, he chose the III Armeekorps with its 23 battalions and 15 squadrons. To this were added 23 badly-organized battalions of Bohemian landwehr. Kollowrat was appointed to lead the III Armeekorps, while Prince Friedrich Franz Xaver of Hohenzollern-Hechingen exchanged his old corps for Kollowrat's former II Armeekorps.\nOn the south bank of the Danube, Napoleon's forces relentlessly pressed back the outnumbered Austrian left wing of Feldmarschall-Leutnant Johann von Hiller, which consisted of the V, VI, and II Reserve Armeekorps. After brutal fighting at the Battle of Ebelsberg on 3 May, the Franco-Allied army appeared before Vienna. After a perfunctory resistance, Archduke Maximilian of Austria–Este abandoned the Austrian capital which was handed over to the French early on 13 May.\nOn 4 May, Vandamme and his VIII Corps reached Linz. He found General-major Joseph von Richter and an Austrian landwehr brigade opposite Linz on the Danube's north bank. Earlier in the campaign, this unit had assisted in the blockade of the Bavarian garrison of Passau. After Passau was relieved, Richter fell back on the north bank to Linz. Aggressively, Vandamme lined up his artillery on the south bank and began to bombard Richter's men. Under cover of the cannonading, the Württembergers crossed over in boats and attacked. Richter's poorly trained landwehr were overrun and most were captured.\nOn the 6th, Bernadotte's Saxons reached Rötz near Cham in their march around the west side of Bohemia. Napoleon wanted the IX Corps to be at Passau on the 9th, with the possibility of being ordered from there to Linz. On 7 May, Archduke Charles left Budweis with his main army. He ordered Kollowrat to move from Plzeň (Pilsen) and guard his southern flank. On the 8th, the Austrian army commander ordered Kollowrat to menace the French supply line near Linz. Charles reunited with Hiller's wing on the north bank of the Danube on 16 May.\nCarrying out his orders of 8 May, Kollowrat concentrated the III Armeekorps at Budweis on 13 May. To guard the city of Cheb (Eger) in western Bohemia, Kollowrat detached two line (regular) and 12 landwehr battalions. Moving south, the Austrians reached Neumarkt im Mühlkreis on the 16th. Kollowrat divided the III Armeekorps into three columns for the assault on the Linz bridgehead. He ordered two columns under Feldmarschall-Leutnants Hannibal Sommariva and Josef Philipp Vukassovich to attack the bridgehead from either side. He sent Feldmarschall-Leutnant Franz Xaver Saint-Julien with the third column toward Mauthausen in a feint attack to divert attention from the main blow. Kollowrat held back a powerful reserve force.\nAllied forces\nMarshal Bernadotte was in overall command of the forces of Napoleon's German allies. The 12,000-strong VIII Corps was composed of Württemberg troops and commanded by Vandamme. The corps was made up of one infantry division under General-Leutnant von Neubronn and one cavalry division led by General-Leutnant von Wöllworth.\nGeneral-major Frederic von Franquemont's 1st Infantry Brigade included two battalions each of the Crown Prince and Duke Wilhelm Line Infantry Regiments and the 1st Battalion of the Neubronn Fusilier Regiment. The 2nd Infantry Brigade of General-major von Scharffenstein had two battalions each of the Phull and Cammerer Line Infantry Regiments and the 2nd Battalion of the Neubronn Fusiliers. General-major von Hügel's 3rd Brigade comprised the 1st König Jäger Battalion, 2nd Neuffer Jäger Battalion, 1st Wolff Light Battalion, and 2nd Brüselle Light Battalion.\nThe 1st Cavalry Brigade of General-major von Röder included four squadrons each of the Leib and Duke Heinrich Chevau-léger Regiments. General-major von Stettner's 2nd Cavalry Brigade was made up four squadrons each of the König and Duke Louis Jäger zu Pferde Regiments. Oberst (Colonel) von Schnadow's corps artillery had 22 guns in three companies. The 1st Foot Company consisted of eight 6-pound cannons and two 7-inch howitzers. The 1st and 2nd Horse Companies each had four 6-pound cannons and two 7-inch howitzers.\nOf the Saxon IX Corps, only the 1st Division of General-Leutnant von Zeschwitz was engaged in the battle. General-major von Hartitsch's 1st Brigade included the Leib Grenadier Guard Battalion, Bose Grenadier Battalion, two battalions of the König Line Infantry Regiment, the 1st Battalion of the Dyherrn Line Infantry Regiment, and the Metzsch Light Infantry Battalion. The 2nd Brigade of General-major von Boxberg was made up of two battalions each of the Prince Maximilien, Prince Frederick August, and Prince Anton Line Infantry Regiments. General-major von Gutschmid's Cavalry Brigade consisted of one squadron of the Prince Albert Chevau-léger Regiment, three squadrons of the Hussar Regiment, four squadrons of the Prince Clement Chevau-léger Regiment, and two squadrons each of the Garde du Corps and Carabinier Regiments. Of these units, the Metzsch, Prince Anton, Prince Clement, Garde du Corps, and Carabiniers were not engaged. Also arriving too late was the 2nd Division of General-Leutnant von Polenz.\nAustrian forces\nSommariva's Right Column consisted of three battalions of the Wenzel Colloredo Infantry Regiment Nr. 56, one battalion of the Peterwardeiner Grenz Infantry Regiment Nr. 9, the 5th Jäger Battalion, three battalions of the Pilsen Landwehr, two squadrons of the Merveldt Uhlan Regiment Nr. 1, and 12 guns in two foot artillery batteries.\nVukassovich commanded the Center Column. This body included three battalions each of the Manfreddini Infantry Regiment Nr. 12 and the Schröder Infantry Regiment Nr. 7, two battalions of the Wurzburg Infantry Regiment Nr. 23, one battalion of the Peterwardeiner Grenz Infantry Regiment Nr. 9, the 6th Jäger Battalion, four squadrons each of the Merveldt Uhlan Regiment Nr. 1 and the Hessen-Homburg Hussar Regiment Nr. 4, and 24 guns in four foot artillery batteries. Saint-Julien directed the Left Column. Of this force, only two squadrons of the Hessen-Homburg Hussar Regiment Nr. 4 were engaged.\nBattle\nAt 2:00 PM on 17 May, Kollowrat's attacks began. At that time, intelligence was received that Bernadotte's Saxons had arrived in Linz, having marched from Passau. Kollowrat immediately suspended the assault and determined to retreat. In fact, Bernadotte reached Linz at 7:00 AM that morning with his leading infantry and cavalry brigades. He crossed into the bridgehead in the afternoon and attacked the Austrian column on the east side, pushing it back with loss. Having disposed of Vukassovich, he turned on Sommariva on the west side and defeated his force as well.\nOne notable feature of the fighting was a successful allied cavalry charge against an Austrian artillery battery on the Pfennigberg hill. The Württemberg Duke Louis Jäger zu Pferde Regiment and the Saxon Hussars overran the battery, capturing six guns. The Jägers were allowed to claim four of the captured pieces as prizes while the Hussars got the other two. One authority wrote that Bernadotte had no more than 10,000 troops available, while Kollowrat commanded over 20,000. Historian Digby Smith stated that 15,000 Austrians and 36 guns were engaged against 6,000 Saxons and 12,000 Württembergers with 22 guns.\nResult\nThe Württembergers lost 35 killed, 228 wounded, and 40 missing, for a total of 303. Saxon casualties numbered 88, with seven killed, 74 wounded, and seven captured. The Austrians counted 49 killed, 263 wounded, 455 captured, and 124 missing, for a total of 891. They also lost six guns and two ammunition wagons. Another authority lists Austrian losses as 883 and four guns. After his defeat, Kollowrat fell back first to Gallneukirchen to the northeast of Linz. Later his corps marched north to Freistadt. Archduke Charles failed to call the III Armeekorps to return to the main army north of Vienna and it missed the Battle of Aspern-Essling on 21 and 22 May.\nAround 26 May, Archduke Charles recalled the III Armeekorps to join the main army opposite Vienna. Following his instructions, Kollowrat left Sommariva's division at Freistadt to observe Linz while bringing his other two divisions to link up with Charles. To insure the safety of his communications, Napoleon ordered the fortifications at the Linz bridgehead to be improved. Leaving Vandamme's Württembergers behind, Bernadotte hurried to join Napoleon with his Saxons. In addition to Sommariva's force, Feldmarschall-Leutnant Emmanuel von Schustekh-Herve with 9,000 men and 13 guns had been hovering near Krems an der Donau since 10 May.\nAt Villach on 17 May, Archduke John received orders to move against Napoleon's communications from the south. These instructions proved impossible to execute because Marshal François Joseph Lefebvre defeated Feldmarschall-Leutnant Johann Gabriel Chasteler de Courcelles on 13 May at the Battle of Wörgl. Instead, John recalled Chasteler and Feldmarschall-Leutnant Franz Jellacic from the Tyrol in the hope of adding their forces to his weakened army. As it happened, Jellacic's division was crushed at the Battle of Sankt Michael on 25 May and only remnants joined John. Chasteler escaped but never caught up with John's army in its operations against Eugène de Beauharnais' French Army of Italy.\nNotes\nReferences\n*\n*\n*\n*\nFurther reading\n*\n*\n*\n* The following two items are excellent sources for the full names of Austrian and French generals.\n* [http://www.napoleon-series.org/research/biographies/Austria/AustrianGenerals/c_AustrianGeneralsIntro.html napoleon-series.org Austrian Generals 1792-1815 by Digby Smith, compiled by Leopold Kudrna]\n* [http://www.napoleon-series.org/research/c_frenchgenerals.html Broughton, Tony. napoleon-series.org Generals Who Served in the French Army during the Period 1789-1815]\nExternal links\n*"
    }
  ]
}