{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Dallas__disambig_1\n\nUnited States\n| combatant2    =  Confederate States\n| commander1    = William T. ShermanJohn A. Logan\n| commander2    = Joseph E. JohnstonWilliam B. BateFrank C. Armstrong\n| units1        = Military Division of the Mississippi\n| units2        = Army of Tennessee\n| strength1     = Dallas: ~11,500May 23–June 6: ~100,000\n| strength2     = Dallas: ~10,000May 23–June 6: ~65,000\n| casualties1   = Dallas: 379May 23–June 6: 4,500\n| casualties2   = Dallas: 1,000–1,200May 23–June 6: 3,000\n| campaignbox   =\n}}\nThe Battle of Dallas (May 28, 1864) was an engagement during the Atlanta campaign in the American Civil War. The Union army of William Tecumseh Sherman and the Confederate army led by Joseph E. Johnston fought a series of battles between May 25 and June 3 along a front stretching northeast from Dallas toward Acworth, Georgia. At Dallas a probe launched by William B. Bate's and William Hicks Jackson's Confederate divisions accidentally turned into a full-scale assault against the defenses of John A. Logan's XV Corps. The attack was driven off with heavy Confederate losses. The previous Union defeats at New Hope Church and the Pickett's Mill are sometimes considered with Dallas as part of one battle.\nOn May 23, Sherman moved away from his railroad supply line when he launched a wide sweep that aimed to turn Johnston's left flank. Johnston adroitly shifted his army toward Dallas to block Sherman's maneuver. The result was ten days of close fighting that resulted in more Union than Confederate casualties. After the Dallas battle, Sherman shifted his army to the northeast, looking for a way to turn the right flank of Johnston's entrenched defenses. On June 1, Union forces occupied Allatoona Pass on the Western and Atlantic Railroad line. This allowed the railroad to be repaired as far as that location and promised that future supplies could reach Sherman's army by train. On June 3, Union troops arrived at a flanking position that convinced Johnston to abandon his lines and fall back to another entrenched position that covered Marietta.\nBackground\nUnion Army\nGeneral-in-chief of the Union Army Ulysses S. Grant ordered Sherman, \"to move against Johnston's army, to break it up, and to get into the interior of the enemy's country as far as you can, inflicting all the damage you can against their war resources\". Sherman commanded elements of three armies. The Army of the Cumberland under George H. Thomas was made up of the IV Corps led by Oliver Otis Howard, the XIV Corps under John M. Palmer, the XX Corps commanded by Joseph Hooker, and three cavalry divisions led by Edward M. McCook, Kenner Garrard, and Hugh Judson Kilpatrick. The Army of the Tennessee led by James B. McPherson included the XV Corps under John A. Logan and the Left Wing of the XVI Corps under Grenville M. Dodge. The XVII Corps under Francis Preston Blair Jr. did not join until June 8. The Army of the Ohio commanded by John Schofield consisted of the XXIII Corps under Schofield and a cavalry division commanded by George Stoneman. The XIV Corps had 22,000 men, the IV and XX Corps each numbered 20,000 soldiers, the XV Corps totaled 11,500, and the XVI and XVII Corps had about 10,000 men each.\nConfederate Army\nJohnston's Army of Tennessee included two infantry corps led by William J. Hardee and John Bell Hood, and a cavalry corps under Joseph Wheeler. The army was soon reinforced from the Army of Mississippi by the corps of Leonidas Polk and the cavalry division of William Hicks Jackson. Hardee's corps included the divisions of William B. Bate, Benjamin F. Cheatham, Patrick Cleburne, and William H. T. Walker. Hood's corps comprised the divisions of Thomas C. Hindman, Carter L. Stevenson, and Alexander P. Stewart. Polk's corps was made up of the divisions of James Cantey, Samuel Gibbs French, and William Wing Loring.\nEarly battles\nSherman began his campaign on May 7, 1864 with the Battle of Rocky Face Ridge during which he turned Johnston's western flank with McPherson's forces while Thomas and Schofield threatened his front. After Johnston withdrew, the Battle of Resaca was fought on May 13–16 at which time Polk's corps began arriving. After Sherman turned his western flank again, Johnston withdrew. At the Battle of Adairsville, Johnston planned to counterattack Sherman's widely-spread army, but it miscarried when Union cavalry arrived from an unexpected direction. On May 19, Polk and Hood talked Johnston into retreating to Allatoona Pass. Johnston's retreat south of the Etowah River was done skillfully. Schofield's corps passed through Cartersville and reached the Etowah to find the bridges burned and the Confederates gone. The Western and Atlantic Railroad ran through a gorge at Allatoona Pass and Johnston posted his army there in a very strong defensive position.\nSherman aimed to force Johnston's army to withdraw behind the Chattahoochee River. To achieve this he tried to outflank Johnston's army on the west by marching to Dallas and then Marietta. Sherman ordered his army to be ready to move on May 23. Since it would be leaving the railroad line, the army packed 20 days of supplies into its wagons and sent all its wounded and unfit men to the rear. Sherman ordered McPherson's two corps on his right wing to march from Kingston south to Van Wert and then east to Dallas. Since Jefferson C. Davis division (XIV Corps) was already to the west at Rome, Georgia, it moved with McPherson. Thomas' three corps were directed to march south through Euharlee and Stilesboro toward Dallas. Garrard's cavalry scouted ahead of McPherson's wing, while McCook's horsemen moved ahead of Thomas's center. Schofield's left wing marched from Cartersville to the Etowah with Stoneman's cavalry riding ahead. Kilpatrick's cavalry stayed north of the Etowah to guard the railroad.\nOn the morning of May 23, Lawrence Sullivan Ross, leading one of Jackson's cavalry brigades, reported that major Union forces were crossing the Etowah at Milam's and Gillem's bridges. Keeping Hood's corps at Allatoona Pass, Johnston quickly ordered Hardee's and Polk's corps to move southwest to Dallas. The Confederates marched all day and into the evening, briefly rested, then continued marching through the night. On May 24, McPherson reached a point  west of Dallas. Riding ahead of McPherson, Garrard's troopers reported that Confederate infantry was at Dallas. Hooker arrived at Burnt Hickory ahead of Thomas' other two corps and Schofield's corps. Alerted by reports from Jackson's cavalry division, Johnston deduced that the Union army was maneuvering to turn his left flank and ordered Hood's corps to follow the other two corps toward Dallas. On the afternoon of May 24, McCook's cavalry captured a Confederate courier with a message that Johnston's army was marching toward Dallas. Even so, Sherman believed that Johnston would not attempt to stop him at Dallas; he directed his army to push forward.\nLate May fighting\nNew Hope Church\nBy the morning of May 25, Hardee's corps reached a defensive position east of Dallas and Polk's corps deployed on Hardee's right flank. Farther to the northeast, Hood's corps arrived at New Hope Church and began digging rifle pits and building breastworks. Hood placed Stevenson's division on the right flank, Stewart's division in the center, reinforced by one of Stevenson's brigades, and Hindman's division on the left flank. Confederate observers on Elsberry Mountain reported dust clouds approaching from the north. Hooker's XX Corps left Burnt Hickory and crossed a bridge over Pumpkinvine Creek after driving off some Confederates trying to burn the span. At a fork in the road, John W. Geary's division took the left fork, while the divisions of Alpheus S. Williams and Daniel Butterfield took the right fork. When Geary's troops discovered that they were facing Hood's corps, the other two divisions were hastily recalled to the left fork.\nSherman ordered an attack, believing that only a token Confederate force was in front of the XX Corps. By 5 pm, all three of Hooker's divisions were assembled and they began to advance with Williams on the right, Butterfield on the left and somewhat behind, and Geary in support. Each division was arranged in a column of brigades, that is, with three brigades lined up one behind the other. After advancing  through dense woods and underbrush, the 16,000 Union soldiers ran into an intense storm of rifle fire from Stewart's 4,000-man division and artillery fire from 16 guns. Those Federals still unwounded threw themselves on the ground and fired back. When Williams' leading brigade ran out of ammunition, it was replaced in the front line by the second brigade. Asked if he needed help, Stewart replied, \"My own troops will hold the position.\" The Battle of New Hope Church went on for three hours, and during its final hour a storm added its thunder and rain to the noise of battle. Hooker reported losing 1,665 killed and wounded. The Union troops called the battlefield the \"Hell Hole\". Hooker's troops retreated out of range when night fell. Stewart reported losing only 300–400 casualties.\nPickett's Mill\nThomas brought forward Howard's IV Corps, which deployed on the left of Hooker's corps and was in position by the morning of May 26. Davis' division moved forward on the left of McPherson's two corps. Of Palmer's other two XIV Corps divisions, Absalom Baird's remained at Burnt Hickory to guard Thomas' wagon train and Richard W. Johnson's was retained as a reserve. McPherson occupied Dallas on the morning of May 26 and pressed forward  until his troops were in contact with Hardee's corps. McPherson posted Davis' division on his left, Dodge's XVI Corps in the center, and Logan's XV Corps on his right. Garrard's horsemen watched the country to the right and skirmished with Jackson's cavalry. Schofield's XXIII Corps came up behind Hooker's and Howard's corps, except for Alvin Peterson Hovey's division which was left to guard the corps trains. Sherman ordered Schofield's corps to move to Brown's saw-mill on Little Pumkinvine Creek which was on Howard's left. After marching northeast through dense forest to reach Howard's left, both the XXIII Corps and IV Corps performed a right wheel in order to come face-to-face with the Confederate defenses. During May 26, both sides entrenched and there was continuous skirmishing all along the front lines.\nThwarted in his attempt to move around Johnston's left flank, Sherman decided to turn the Confederate right flank. He also wanted to extend his left flank until he reconnected with the railroad near Allatoona Pass. Conscious of his numerical superiority, Sherman knew he could hold his entrenchments with part of his forces while using another part for a flanking maneuver. On May 27, he ordered Thomas to pull Thomas J. Wood's division from Howard's corps and use it to turn Johnston's right flank. Wood would be supported by Johnson's division (XIV Corps) and Nathaniel McLean's brigade of XXIII Corps. On Sherman's left flank, McCook's cavalry clashed with Wheeler's cavalry, inflicting losses and capturing about 50 Confederates. Reports of this action led Sherman to believe that Johnston's right flank was only held by Wheeler's horsemen.\nWhen Thomas and Howard examined the place selected for Wood's attack, they found that it was an open field exposed to crossfire. Thomas ordered Wood to march farther to the left. Accompanied by Howard, Wood's division deployed into six lines, one behind the other, and moved  through densely wooded terrain. Johnson's division was in a similar formation to Wood's left. Finding that there were Confederate entrenchments opposite Wood's division, Howard ordered the march to continue. Unknown to the Federals, Johnston anticipated Sherman's maneuver and detached Cleburne's division from Hardee's corps, moving it to the right flank of Hood's corps. Johnston also ordered Stewart's division to be pulled out of the line and sent to the right flank to help Cleburne. Wood's division marched an additional  through dense forests and Howard ordered it to attack. At 5 pm, Wood sent William B. Hazen's brigade forward, but it was repulsed by Hiram B. Granbury's Texas brigade after bitter fighting. Belatedly, Wood sent in a second and finally a third brigade, but they also were beaten. Weakly supported on the left by Johnson's division and on the right by McLean's brigade, Wood's attack failed and the Battle of Pickett's Mill was a Union defeat. Federal casualties numbered 1,600, including an unusually high proportion of dead. The Confederates reported 448 casualties.\nAction at Dallas\nFinally convinced that Johnston's entire army was facing him from well-established entrenchments, Sherman planned to shift his troops from the right to the left flank. His goal was to reach a position beyond Johnston's right flank and seize the railroad near Acworth. Once this movement was completed, Blair's XVII Corps would move from Rome to Allatoona Pass and Sherman's work gangs could rebuild the railroad bridge across the Etowah. Sherman's divisions were not all with their proper corps. From left to right they were Johnson (XIV Corps), Wood (IV Corps), Milo S. Hascall and Jacob D. Cox (XXIII Corps), David S. Stanley and John Newton (IV Corps), Hooker's three divisions (XX Corps), Davis (XIV Corps), and McPherson's divisions (XVI and XV Corps). Sherman's orders for May 28 were for McPherson to send Davis' division back to Thomas and shift his position toward the left, taking over Hooker's lines. Hooker was directed to occupy Schofield's lines. Schofield was instructed to move to the extreme left flank after picking up Hovey's division. Baird's division (XIV Corps) would guard all the wagon trains at Burnt Hickory.\nOn the evening of May 27, Wheeler reported that Sherman's left flank along Little Pumpkinvine Creek was exposed and Hood convinced Johnston to attack it. That night Hood's corps pulled out of line and was replaced by Polk's corps without the Union troops discovering the move. From midnight to 6 am, Hood's troops marched  through the dense woods to reach their jumping off point. However, Wheeler's morning report notified Hood that the Union lines were now behind the creek and bolstered with breastworks. Hood passed this information to Johnston, who called off the assault and ordered Hood's sleepy troops to take position on Polk's right flank. In fact, Sherman was so anxious about his left flank that the previous evening he ordered Howard to bend his line back and barricade it against attack.\nOn May 28, Johnston received reports that Sherman's right flank troops were shifting northward. The reports were mistaken, but Johnston ordered Hardee to have Bate's division probe the Union defenses near Dallas. If the Union defenses were abandoned or weakly-held, Bate was ordered to seize them with his 5,000-man division. Jackson's cavalry division, also about 5,000-strong, was ordered to assist. Bate's division was deployed with Joseph Horace Lewis's Kentucky brigade on the right, Jesse J. Finley's Florida brigade in the center, and Thomas Benton Smith's Georgia-Tennessee brigade on the left. Jackson's division included Frank Crawford Armstrong's Mississippi brigade, Ross' Texas brigade, and Samuel W. Ferguson's Alabama-Mississippi brigade. After meeting with his brigade commanders and Jackson, Bate outlined his plan. Bate directed Armstrong's dismounted troopers to attack first, and if they ran into little or no resistance, four cannon shots would be fired as a signal for the infantry brigades to attack. If the cavalrymen encountered strong defenses, no cannons would be fired and the attack would be canceled. Bate and the others were sure that they would meet only token forces.\nThe Union defenses were held by Logan's XV Corps, from right to left, the divisions of William Harrow, Morgan Lewis Smith, and Peter J. Osterhaus. On Osterhaus' left flank was James C. Veatch's division of Dodge's XVI Corps. Worried about the rifle fire coming from the Union lines, Lieutenant Colonel Frank A. Montgomery of the 1st Mississippi Cavalry Regiment went to a hilltop battery position to observe the Federal defenses. He was nearly killed by a sniper, but in his brief glimpse was able to see that the Union lines were well-manned. He tried to warn his immediate superior Colonel R. A. Pinson, but Armstrong and Bate were convinced they faced only a skirmish line. At 3:45 pm, Armstrong's dismounted cavalrymen rushed Harrow's division, overran the picket line, and captured three guns from the 1st Iowa Battery. They penetrated a gap in the defenses, but Logan galloped up, bringing reinforcements and shouting, \"Give them hell boys!\" A counterattack by the 6th Iowa Infantry Regiment threw back Armstrong's men and recaptured the guns. Armstrong's men quickly retreated to their trenches.\nAfter witnessing the brusque repulse, Bate ordered the signal guns not to fire and sent couriers to each of his brigade commanders to cancel the planned assault. Thomas Smith received the message and had his troops stand down. However, Lewis and Finley did not get the message in time and they believed that they missed the signal amid all the shooting. They ordered their troops to attack and hundreds of them were shot down by Logan's and Veatch's well-entrenched soldiers. Again and again, the Confederates tried to rush the Union lines but were unable to get closer than , finally stopping their attacks at 6 pm. Impressed by the bravery and persistence of their enemies, the Federals believed that they defeated an entire corps. Johnston only reported a loss of 300, but Lewis' Kentuckians lost 51% out of 1,100 soldiers. Bate's division and Armstrong's cavalry suffered at least 1,000 casualties and possibly as high as 1,500. Logan reported 379 casualties and Veatch's right-most brigade did not report a single casualty. The American Battlefield Trust stated that Union casualties were 379 while Confederate casualties were 1,200.\nAftermath\nThe fighting at Dallas on May 28, caused McPherson to ask Sherman to postpone the planned shift to the left. Sherman called off the move and May 29 was spent in skirmishing along the  long opposing front lines. Sherman's shift to the left was rescheduled for the night of May 29, but on McPherson's front, soldiers thought they were being attacked and both sides fired at phantom enemies all night long. Sherman again postponed the shift to the night of May 31. Meanwhile, Garrard's division moved from the extreme right to the extreme left where it joined Stoneman's cavalry with orders to head for Allatoona Pass. At the appointed hour, McPherson carefully pulled out from the area near Dallas and marched to occupy the Union lines farther north. By the morning of June 1, McPherson's transfer was in progress without alerting the Confederates facing them. That day, Stoneman's horsemen occupied Allatoona Pass and the repair of the railroad line was begun from Kingston to the Etowah. Schofield's and Hooker's corps pulled out of line near New Hope Church and were replaced by McPherson's two corps.\nOn June 2, Schofield's XIII Corps moved to the intersection of the Allatoona road and the road from Burnt Hickory to Marietta (see the upper right of the New Hope Church map near Cross Roads Church). He deployed the divisions of Hovey, Cox, and Hascall, from right to left. Supported by Butterfield's division (XX Corps), Schofield's divisions moved east, driving back enemy skirmishers. The advance was made through forest so thick that the skirmish line could not be seen  away and the troops were guided by compass. Cox's division crossed Allatoona Creek in a thunderstorm and found itself faced by a line of Confederate entrenchments. Hascall and Hovey came up on the left and right, respectively, and all three divisions entrenched. They were faced by the Confederate divisions of Cleburne and Walker. That day, the divisions of Baird and Johnson from Palmer's XIV Corps filled the gap between Schofield's new position and Pickett's Mill. On June 3, Hooker extended his corps to the left of Schofield. Stoneman's and McCook's cavalry arrived at Acworth and Garrard's cavalry occupied the railroad south of the Etowah. Sherman's engineers and railroad crews were now able to repair the track as far as Acworth. Schofield pulled Hovey's division out of line and ordered it to move to Allatoona Church, which it reached in the evening. The Confederates evacuated the trenches in front of Schofield and took up a new line facing north.\nBelieving that Sherman was about to sweep around his right flank to seize Marietta, on the night of June 3, Johnston ordered a  retreat. On June 4, Sherman directed McPherson to pull his troops from the area around New Hope Church, march behind the other Union forces, and take a position on the far left flank. When Johnston's soldiers abandoned their lines on the night of June 4, the Federals did not even realize they were gone. The Confederate retreat was conducted in the rain and the soldiers arrived at their new defenses muddy and exhausted. Johnston's line ran from Lost Mountain in the southwest to Brushy Mountain to the northeast, with a salient in the center at Pine Mountain. Sherman rearranged his forces so that Schofield was on his right flank, Thomas in the center, and McPherson on his left flank at the railroad. Blair's XVII Corps arrived at Acworth on June 8, joining McPherson. The next action was the Battle of Gilgal Church on June 15.\nStrengths and losses\nBetween May 23 and June 6, Sherman's Union forces sustained 4,500 casualties while Johnston's Confederate army lost 3,000 casualties. During the month of May, Sherman's troops suffered 12,000 casualties out of 100,000 while Johnston's losses numbered 9,000 out of a total of 65,000–75,000. Sherman's losses were soon replaced by the addition of Blair's XVII Corps and other units, but Johnston's army had only the Georgia militia to rely on for reinforcements. Unfortunately for Johnston, by the beginning of June, Sherman's army grew stronger relative to the Confederate army despite heavier losses. In the fighting around New Hope Church and Dallas, Johnston held up Sherman's advance for two weeks by effectively countering his opponent's maneuvers. However, in May, Sherman's forces advanced  into Georgia and forced the Confederates to give up a number of excellent defensive positions. The bitter fighting and harsh conditions also taxed the soldiers' physical and mental health. Hundreds of men from both armies were sent to the rear sick or exhausted while others deserted. Marauders from both armies stole from the local inhabitants. Cox claimed that both Union and Confederate armies sustained 9,000 casualties in the month of May. In the battles of New Hope Church and Dallas, Gaston Bodart stated that the Union army numbered 80,000 and the Confederate army 40,000, and that Union casualties were 2,400 and Confederate casualties were 3,000.\nOn April 30, 1864, Sherman's forces counted 110,000 soldiers of which 99,000 and 254 guns were available for \"offensive purposes\". The 25,000 non-combatants with the army included railroad employees and repair crews, teamsters, medical staff, and Black camp servants. According to Albert Castel, Thomas' Army of the Cumberland numbered 73,000 troops and 130 guns, McPherson's Army of the Tennessee counted 24,500 soldiers and 96 guns, and Schofield's Army of the Ohio was made up of 11,362 infantry, 2,197 cavalry, and 28 guns. Cox asserted that Sherman began the campaign with nearly 100,000 men and 254 guns. The Army of the Cumberland had 60,000 men and 130 guns, the Army of the Tennessee had 25,000 men and 96 guns, and the Army of the Ohio had 14,000 men and 28 guns. Battles and Leaders stated that on May 1, Sherman's army included 88,188 infantry, 4,460 artillery, and 6,149 cavalry, a total of 98,797 soldiers. On June 1, there were 94,310 infantry, 5,601 artillery, and 12,908 cavalry, a total of 112,819 soldiers. The June figure may include Blair's XVII Corps.\nOn April 30, Johnston's Army of Tennessee reported 41,279 infantry, 8,436 cavalry, and 3,227 artillerymen serving 144 guns. Battles and Leaders calculated Johnston's reinforcements as follows: Hugh W. Mercer's brigade (2,800) from the Atlantic coast on May 2, Cantey's division (5,300) from Mobile, Alabama on May 7, Loring's division (5,145) from Mississippi on May 10–12, French's detachment (550) on May 12, Jackson's cavalry (4,477) on May 17, French's division (4,174) on May 19, and William Andrew Quarles' brigade (2,200) on May 26. Jackson's cavalry received 643 more soldiers on June 10. Other possible reinforcements were from Georgia state regiments (1,200), men returned from furlough (3,399), recruits (799), and returned deserters (649). There were about 8,000 non-combatants supporting the army, many of whom were men unfit for combat.\nBattlefield\nThe site of the battle is now Paulding County High School. The Confederate trenches lay along the southern edge of the campus, as marked by a Civil War Marker sign along Highway 61. The American Battlefield Trust and its partners have acquired and preserved 64 acres at the battlefield through mid-2023.\nSee also\n* Dallas Union order of battle\nNotes\n.]]\nReferences\n*\n* |title=Battles and Leaders of the Civil War |volume=4 |year=1987 |orig-year=1883 |publisher=Castle |location=Secaucus, N.J. |isbn=0-89009-572-8 }}\n*\n*\n*\n* |title=Dallas Battlefield |year=2021 |publisher=American Battlefield Trust |access-date=October 2, 2021 |url=https://www.battlefields.org/visit/battlefields/dallas-battlefield }}\n*\nSee also\n* This is an excellent map.\n*\n*"
    }
  ]
}