{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Boulikessi (2025)\n\nMalian Army Wagner Group\n| combatant2        =  Jama'at Nasr al-Islam wal Muslimin\n| strength1         = Unknown\n| strength2         = ~100 fighters\n| casualties1       = ~100 dead22 captured\n| casualties2       = Unknown\n}}\nOn June 1, 2025, jihadists from Jama'at Nasr al-Islam wal-Muslimin attacked Malian and Russian forces in Boulikessi, Mali. Around 100 Malian soldiers were killed in the attack, and the jihadists seized control of the Malian military base in the town.\nBackground\nSince the spring of 2025, JNIM has intensified their attacks on Malian forces, leading to a string of deadly attacks. A week prior to the attack in Boulikessi, JNIM killed forty Malian soldiers in Dioura, and several military bases across the border in Burkina Faso were attacked by the militant group. Boulikessi is a prime target for JNIM attacks due to its remote location, inhibiting the arrival of Malian reinforcements. In 2019, JNIM attacked Malian soldiers in Boulikessi and killed 40, at the time making it the deadliest attack in Malian history after the Second Battle of Kidal.\nBattle\nThe attack occurred on June 1, when a number of JNIM fighters assaulted the Malian military barracks in the city. JNIM fighters released photos and videos of them roaming the base and of the fighting for it. The Malian army stated they reacted \"vigorously to the attack in central Mali before withdrawing\". Footage from the attack showed over 100 attackers participating. The jihadists looted the weapons in the barracks before retreating.\nJNIM claimed responsibility for the attack on June 4, saying they killed over 100 soldiers and captured 22 others. Shortly after the attack, JNIM released a video of the captives divided into small groups. On June 10, they showed another video of 20 captured soldiers from Boulikessi.\nAccording to RFI, between 75 and 90 Malian soldiers were killed during the battle for the base as of June 3. Following the discovery of new graves the next day, that toll was increased to 100 dead. RFI also stated that Russian soldiers from the Wagner Group were killed, although JNIM didn't publish any photos of Russian casualties. The Malian government hasn't issued any casualty figures.\nAftermath\nThe Malian government attempted to retake the Boulikessi camp on June 5, but was ambushed again and suffered several casualties. The base was abandoned on June 6.\nOn June 2, a day after the initial attack on Boulikessi, JNIM launched a similar attack on Malian forces in Timbuktu, hitting the Sidin Bekaye base and the airport.\nReferences"
    }
  ]
}