{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Herbsthausen__disambig_1\n\nElectorate of Bavaria\n| combatant2        =  Kingdom of France\n| commander1        =  Franz von Mercy   Johann von Werth\n| commander2        =  Vicomte de Turenne   Reinhold von Rosen\n| strength1         = 9,650 total 4,300 infantry, 5,300 cavalry, 9 guns\n| strength2         = 6,000 men\n| casualties1       = 600 killed and wounded\n| casualties2       = 4,400 killed, wounded and captured\n}}\nThe Battle of Herbsthausen, also known as the Battle of Mergentheim, took place near Bad Mergentheim, in the modern German state of Baden-Württemberg. Fought on 5 May 1645, during the Thirty Years War, it featured a French army led by Turenne, defeated by a Bavarian force under Franz von Mercy.\nIn February 1645, Mercy detached 5,000 of his veteran Bavarian cavalry to support the Imperial army in Bohemia, most of whom were lost in the defeat at Jankau on 6 March. Thereafter, he avoided battle until he had assembled enough troops, then surprised Turenne at Herbsthausen on 5 May. The inexperienced French infantry quickly disintegrated and suffered over 4,400 casualties, compared to Bavarian losses of 600.\nDespite his victory, Mercy was unable to gain a clear strategic advantage and was killed at Second Nördlingen in August. Although fighting continued, both sides accepted their inability to impose a military solution and stepped up the negotiations that ultimately concluded with the 1648 Peace of Westphalia.\nBackground\nThe Thirty Years War began in 1618 when the Protestant dominated Bohemian Estates offered the Crown of Bohemia to fellow Protestant Frederick V of the Palatinate, rather than the Catholic Emperor Ferdinand II. However, most members of the Holy Roman Empire remained neutral, and the revolt was quickly suppressed, while in 1621 a Catholic League army invaded the Palatinate and sent Frederick into exile.\nHis replacement as ruler of the strategically vital Palatinate by the Catholic Maximilian of Bavaria changed the nature and extent of the war. It drew in Protestant German states like Saxony and Brandenburg-Prussia, as well as external powers like Denmark-Norway. In 1630, Gustavus Adolphus of Sweden invaded Pomerania, partly to support his Protestant co-religionists, but also to control the Baltic trade which provided much of Sweden's income.\nSwedish intervention continued after Gustavus was killed in 1632, but their objectives increasingly conflicted with those of other Protestant Imperial states like Saxony, as well as regional rivals such as Denmark. Following Sweden's defeat at Nördlingen in 1634, most of their German allies made peace with Emperor Ferdinand II in the 1635 Treaty of Prague. The war lost much of its religious nature and became another chapter in the long-standing rivalry between the Habsburg emperors and France, which was supported by Sweden and George Rákóczi, Prince of Transylvania.\nFerdinand III, who succeeded his father in 1637, agreed to peace talks in 1643, but ordered his diplomats to delay since he stilled hoped for a military solution. However, in 1644 the Swedes defeated the Danes, who re-entered the war as an Imperial ally, then destroyed an Imperial army in Saxony. Despite victory at Freiburg in August 1644, the Bavarians under Franz von Mercy were unable to prevent the French capturing Philippsburg, and occupying Lorraine. Mercy withdrew into Franconia, and established winter quarters at Heilbronn.\nIn 1645, Swedish commander Lennart Torstensson proposed a three part attack on Vienna, to compel Ferdinand III to agree terms. While the French advanced into Bavaria, Rákóczi would join forces with the Swedes in Bohemia, who would then move against Vienna. Mercy sent 5,000 veteran Bavarian cavalry under Johann von Werth to reinforce the Imperial army in Bohemia, which was heavily defeated at Jankau on 6 March.\nArmies of this period relied on foraging, both for men and the draught animals essential for transport, and cavalry; by 1645, the countryside was devastated by years of constant warfare, and units spent much of their time finding supplies. This limited operations and materially impacted the battle, since Turenne had widely distributed his army in order to support themselves. Of his 9,000 soldiers, 3,000 never made it onto the battlefield, while many others arrived too late to influence the outcome.\nBattle\nVictory at Jankau seemed to provide an opportunity to knock Bavaria out of the war, and French chief minister Cardinal Mazarin ordered Turenne to bring the Bavarians to battle. Mercy evaded him until he had more troops and after a month of counter-marching, the French were exhausted and short of supplies; in mid-April, Turenne halted and distributed his army between Rothenburg and Bad Mergentheim while he awaited reinforcements from Hesse-Kassel; most of the veteran French infantry had been lost at Freiburg and Turenne did not yet trust his new recruits.\nAlthough only 1,500 of Werth's 5,000 cavalry returned from Bohemia, Mercy gathered 9,650 men and nine guns at Feuchtwangen, and marched north on 2 May. By the evening of the 4th, they were two kilometres from Herbsthausen, a small village south-east of Bad Mergentheim. They made contact with French cavalry patrols under Rosen around 2:00 am; Turenne ordered Rosen to position his cavalry on the right, while Schmidberg assembled the infantry along the edge of a wood overlooking the main road.\nTaken by surprise, Turenne was unable to deploy his guns, while 3,000 of the 9,000 troops in the area did not arrive at all. The Bavarian artillery opened fire, splinters and branches from the trees increasing its effectiveness, and Mercy ordered a general advance. As was common with inexperienced troops, the French infantry opened fire at too great a distance, and dissolved in panic. Turenne led a cavalry charge that scattered Werth's veterans, and fought his way out with 150 others, reaching Hanau in southern Hesse. The infantry was forced to surrender, along with the garrison at Mergentheim, and 1,500 cavalry; Rosen and Schmidberg were taken prisoner, while total French casualties amounted to 4,400. The Bavarians lost 600.\nAftermath\n; killed at Second Nordlingen in August 1645]]\nMost modern descriptions suggest Turenne was simply taken by surprise, but many nineteenth century French writers blamed Rosen for the defeat. Described as a \"better soldier than general\", in 1647 Rosen was arrested by Turenne for mutiny and only released after 14 months. Although victory restored Imperial morale after the defeat at Jankau, it left the strategic position largely unchanged. Condé, victor of Rocroi, assumed command, and by early July had some 23,000 men.\nMercy returned to Heilbronn, where he received 4,500 men from Ferdinand of Cologne, bringing his army up to 16,000. The Bavarian once again demonstrated his ability to out manoeuvre his opponents, but on 3 August was killed at the battle of Second Nördlingen. Despite their victory, the French had also suffered heavy losses and by the end of the year were back where they started, while in September the Swedes agreed a six month truce with John George of Saxony. Both sides accepted a military solution was no longer possible, and in October they recommenced peace negotiations.\nReferences\nSources\n*\n*\n*\n*\n*\n*\n*\n*\n*"
    }
  ]
}