{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Globe Tavern__disambig_1\n\nUnited States (Union)\n| combatant2  =  CSA (Confederacy)\n| commander1  = Gouverneur K. Warren\n| commander2  = A. P. Hill P.G.T. Beauregard\n| strength1   = 20,000\n| strength2   = 14–15,000\n| casualties1 = 4,296  251 killed  1,148 wounded  2,897 missing/captured\n| casualties2 = 1,620   211 killed   990 wounded  419 missing/captured\n}}\nThe Battle of Globe Tavern, also known as the Second Battle of the Weldon Railroad, fought August 18–21, 1864, south of Petersburg, Virginia, was the second attempt of the Union Army to sever the Weldon Railroad during the siege of Petersburg of the American Civil War. A Union force under Major General Gouverneur K. Warren destroyed miles of track and withstood strong attacks from Confederate troops under General P.G.T. Beauregard and Lieutenant General A.P. Hill. It was the first Union victory in the Richmond–Petersburg Campaign. It forced the Confederates to carry their supplies  by wagon to bypass the new Union lines that were extended farther to the south and west.\nBackground\nAs the siege of Petersburg began to take hold, Union lieutenant general Ulysses S. Grant continued to look for ways to sever the railroad links supplying the city of Petersburg, Virginia, Confederate general Robert E. Lee's army, and the Confederate capital of Richmond. One of these critical supply lines was the Petersburg Railroad, also called the Petersburg and Weldon Railroad, which led south to Weldon, North Carolina, and connected to the Wilmington and Weldon Railroad which led to the Confederacy's only remaining major port, Wilmington, North Carolina. In the Battle of Jerusalem Plank Road, June 21–23, the II Corps was able to destroy a short segment of the Petersburg Railroad before being driven off by the Third Corps of Lee's Army of Northern Virginia.\nIn August, the II Corps operated north of Petersburg, threatening Richmond and its railroads in the Second Battle of Deep Bottom. Simultaneously, Grant planned another attack against the Weldon. The V Corps supported by units from the IX Corps, II Corps, and a small cavalry division commanded by Brigadier General August Kautz, was chosen for the attack under the overall command of the V Corps commander, Major General Gouverneur K. Warren. While the overall Confederate commander, General Robert E. Lee, was observing at the Deep Bottom battle, General P.G.T. Beauregard was the senior commander at Petersburg. Lieutenant General A.P. Hill commanded the Third Corps, Beauregard's primary infantry force.\nIn preparing his attack, Grant was encouraged by a message he received August 17 from President Abraham Lincoln:\nGrant remarked to his staff, \"The President has more nerve than any of his advisors.\"\nOpposing forces\nUnion\nConfederate\nBattle\n]]\nAt dawn on August 18, Warren advanced to the south through rain and over muddy roads, pushing aside Confederate pickets and a cavalry brigade, and reached the railroad at Globe Tavern around 9 a.m. Parts of the division under Brigadier General Charles Griffin began to destroy the track while a brigade from Brigadier General Romeyn B. Ayres's division formed in line of battle and moved north to block any Confederate advance from that direction. Brigadier General Lysander Cutler's division was held in reserve. Ayres encountered Confederate troops at about 1:00 p.m. and Warren ordered the division under Brigadier General Samuel W. Crawford to move forward on Ayres's right in an attempt to outflank the Confederate left.\nA.P. Hill sent two brigades of Major General Henry Heth's division and a brigade from Major General Robert F. Hoke's division to meet the advancing Union divisions. At about 2:00 p.m. they launched a strong attack and pushed the Union troops back to within less than a mile of Globe Tavern. Warren counterattacked and regained his lost ground. His men entrenched for the night.  Lieutenant William Taylor is recognized in his Medal of Honor citation for undertaking a hazardous reconnaissance during the night, beyond the army's lines of entrenchment, during which he was captured and taken prisoner by Confederate forces.\nReinforcements arrived during the night—the Union IX Corps under Major General John G. Parke (which had been relieved from duty in the trenches around Petersburg as Hancock's II Corps troops returned from Deep Bottom) and Confederate Major General W.H.F. \"Rooney\" Lee's cavalry division and three infantry brigades from the division of Major General William Mahone. Contact was limited to skirmishing through the heavy rain most of the day on August 19. In the late afternoon, Mahone launched a flanking attack that found a weak spot in Crawford's line, allowing the Confederates to rush into the Union rear, causing hundreds of Crawford's men to flee in panic from the fire they were receiving from two directions. Crawford galloped amongst his men, attempting to rally them, and was almost captured. Almost two full brigades were lost as prisoners. While Mahone attacked the Union right, Heth launched a frontal assault against the center and left, which was easily repulsed by Ayres's division. The IX Corps counterattacked and the widespread hand-to-hand fighting ended at dusk.\nHeavy rains prevented any significant fighting on August 20 and on the night of August 20–21, Warren pulled his troops back two miles (3&nbsp;km) to a new line of fortifications, which were connected with the main Union lines on the Jerusalem Plank Road (present-day U.S. Route 301, Crater Road). Fair weather returned on the morning of August 21 and the Confederates attacked beginning at 9:00 a.m., with Mahone striking the Federal left and Heth the center. Both attacks were unsuccessful against the strong entrenchments and resulted in heavy losses, particularly in the brigade of Brigadier General Johnson Hagood. Brigadier General John C. C. Sanders of Mahone's division, at 24 one of the youngest Confederate generals during the war, was killed during the assault. By 10:30&nbsp;a.m., the Confederates withdrew, leaving several miles of the Weldon railroad in Union hands.\nAftermath\nUnion casualties at Globe Tavern were 4,296 (251 killed, 1,148 wounded, 2,897 missing or captured), Confederate 1,620 (211 killed, 990 wounded, 419 missing or captured). The Confederates lost a key section of the Petersburg Railroad and were forced to carry supplies by wagon  from the railroad at Stony Creek up the Boydton Plank Road into Petersburg. The Union army gained its first victory during the siege of Petersburg and achieved a major objective. Grant severed the Weldon and extended his siege lines to Globe Tavern, but this was not yet a critical problem for the Confederates. A member of Lee's staff wrote, \"Whilst we are inconvenienced, no material harm is done us.\"\nGrant was not entirely satisfied with Warren's victory, which he rightly characterized as wholly defensive in nature:\nWanting to complete his army's control over the railroad, Grant recalled the II Corps from its failed attempt at Deep Bottom to destroy the Petersburg Railroad further south, an action that resulted in the Second Battle of Ream's Station on August 25, 1864.\nNotes\nReferences\n* Bonekemper, Edward H., III. ''A Victor, Not a Butcher: Ulysses S. Grant's Overlooked Military Genius. Washington, DC: Regnery, 2004. .\n* Davis, William C., and the Editors of Time-Life Books. Death in the Trenches: Grant at Petersburg. Alexandria, VA: Time-Life Books, 1986. .\n* Eicher, David J. The Longest Night: A Military History of the Civil War. New York: Simon & Schuster, 2001. .\n* Heidler, David S., and Jeanne T. Heidler. \"Globe Tavern, Virginia.\" In Encyclopedia of the American Civil War: A Political, Social, and Military History, edited by David S. Heidler and Jeanne T. Heidler. New York: W. W. Norton & Company, 2000. .\n* Horn, John. The Petersburg Campaign: June 1864 – April 1865. Conshohocken, PA: Combined Publishing, 1999. .\n* Kennedy, Frances H., ed. The Civil War Battlefield Guide. 2nd ed. Boston: Houghton Mifflin Co., 1998. .\n* Salmon, John S. The Official Virginia Civil War Battlefield Guide. Mechanicsburg, PA: Stackpole Books, 2001. .\n* Trudeau, Noah Andre. The Last Citadel: Petersburg, Virginia, June 1864 – April 1865. Baton Rouge: Louisiana State University Press, 1991. .\n* [https://web.archive.org/web/20050409181725/http://www.cr.nps.gov/hps/abpp/battles/va072.htm National Park Service battle description]\n* [https://web.archive.org/web/20121108215324/http://www.nps.gov/hps/abpp/CWSII/VirginiaBattlefieldProfiles/Gaines%20Mill%20to%20Guard%20Hill.pdf CWSAC Report Update]\nFurther reading\n* Horn, John. The Petersburg Campaign: The Destruction of the Weldon Railroad: Deep Bottom, Globe Tavern, and Reams Station, August 14–25, 1864. Lynchburg, VA: H. E. Howard, Inc., 1991. .\nExternal links\n*[http://encyclopediavirginia.org/Weldon_Railroad_Battle_of_the Battle of Weldon Railroad in Encyclopedia Virginia'']\n*[https://web.archive.org/web/20130510210726/http://www.civilwar.org/battlefields/reamsstation/reams-station-history-articles/weldonreamscalkins.html Cutting the Supply Lines: The Battle of Weldon Railroad, August 18–21, 1864 & Reams Station, August 25, 1864] (Civil War Trust)"
    }
  ]
}