{
  "content": [
    {
      "type": "text",
      "text": "# Battle of the Barracks__disambig_1\n\n)\n|conflict=Battle of the Barracks\n|partof=the Croatian War of Independence\n|place=Croatia\n|result=Croatian victory\n|combatant1=\n|combatant2=  Yugoslavia\n|commander1=  Anton Tus\n|commander2=  Veljko Kadijević Milan Tepić Rajko Kovačević\n|units1=  Croatian National Guard (until November 1991) Armed Forces of Croatia (from November 1991)\n* Croatian Army\nCroatian Police\n|units2=  Yugoslav Ground Forces Yugoslav Air Force Yugoslav Navy\n|strength1=\n|strength2=\n|casualties1= Unknown\n|casualties2=\n300-500 killedCaptured:250 tanks400–500 artillery pieces36 naval vessels180,000 small arms3,000 JNA officers defected to Croatia\n}}\nThe Battle of the Barracks () was a series of engagements that occurred in mid-to-late 1991 between the Croatian National Guard (ZNG, later renamed the Croatian Army) and the Croatian police on one side and the Yugoslav People's Army (JNA) on the other. The battle took place around numerous JNA posts in Croatia, starting when Croatian forces blockaded the JNA barracks, weapons storage depots and other facilities. It formally began on 14 September; its objective was to neutralise the JNA positions in ZNG-held territory and to secure arms and ammunition supplies for the poorly equipped ZNG.\nThe Battle of the Barracks was an escalation of the conflict between Croatian authorities and Croatian Serbs who openly revolted in August 1990 and the JNA's efforts to preserve the Yugoslav federation. At the same time, Croatia made moves towards achieving independence from Yugoslavia. The Battle of the Barracks briefly preceded the start of the JNA's campaign in Croatia—itself amended in early September to add relief of the blockaded barracks to the operation plans. However, the JNA's advance was largely blocked by the ZNG and it relieved few JNA facilities.\nThe ZNG and the police captured small, isolated JNA posts, and a number of large weapons depots and barracksincluding those of the entire 32nd (Varaždin) Corps of the JNA. This provided the Croatian forces with a sizable number of weaponsincluding 250 tanks, hundreds of artillery pieces and a large supply of small arms and ammunitionwhich proved crucial in defending against JNA advances in the early stage of the Croatian War of Independence. Some of the JNA facilities were surrendered without fighting, while there was armed resistance to the takeover in others. In some places, this caused civilian casualties because the barracks were situated in urban areas. Legal charges of abuse or killing of captured JNA personnel and charges of war crimes against the civilian population were filed in Croatia, but most defendants remain at large.\nIn November, the JNA and Croatia reached several agreements to end the blockade and have the JNA withdraw from Croatia. The pullout was completed by 4 January 1992, except in areas around Dubrovnik and on the islands of Vis and Lastovo. The JNA maintained its presence there until the summer of 1992. As the JNA withdrew from the areas it controlled in Croatia, it was replaced by the UN peacekeepers agreed upon by the Vance plan.\nBackground\nIn 1990, ethnic tensions between Serbs and Croats worsened after the electoral defeat of the government of the Socialist Republic of Croatia by the Croatian Democratic Union (Hrvatska demokratska zajednica, HDZ). The Yugoslav People's Army (Jugoslovenska Narodna Armija – JNA) confiscated Croatia's Territorial Defence (Teritorijalna obrana – TO) weapons to minimize resistance. On 17 August, the tensions escalated into an open revolt of Croatian Serbs, centred in the predominantly Serb-populated areas of the Dalmatian hinterland around Knin (approximately  north-east of Split), parts of the Lika, Kordun, Banovina and eastern Croatia. Serbia, supported by Montenegro and Serbia's provinces of Vojvodina and Kosovo, unsuccessfully tried to obtain the Yugoslav Presidency's approval of a JNA operation to disarm Croatian security forces in January 1991. The request was denied and a bloodless skirmish between Serb insurgents and Croatian special police in March prompted the JNA itself to ask the federal Presidency to give it wartime authority and declare a state of emergency. Even though the request was backed by Serbia and its allies, the JNA was denied on 15 March. Serbian President Slobodan Milošević, preferring a campaign to expand Serbia rather than to preserve Yugoslavia with Croatia as a federal unit, publicly threatened to replace the JNA with a Serbian army and declared that he no longer recognized the authority of the federal Presidency. The threat caused the JNA to gradually abandon plans to preserve Yugoslavia in favour of expansion of Serbia as the JNA came under Milošević's control. By the end of  March, the conflict had escalated to the first fatalities. In early April, leaders of Serb revolt in Croatia declared their intention to integrate the area under their control with Serbia. The Government of Croatia viewed the area as a breakaway region.\nAt the beginning of 1991, Croatia had no regular army. To bolster its defence, Croatia doubled police personnel to about 20,000. The most effective part of the force was 3,000-strong special police deployed in twelve battalions and adopting military organization of the units. There were also 9,000–10,000 regionally organized reserve police set up in 16 battalions and 10 companies. The reserve force lacked weapons. As a response to the deteriorating situation, the Croatian government established the Croatian National Guard (Zbor narodne garde – ZNG) in May by merging the special police battalions into four all-professional guards brigades together consisting of approximately 8,000 troops subordinate to the Ministry of Defence headed by retired JNA General Martin Špegelj.  The regional police, by then expanded to 40,000, was also attached to the ZNG and reorganized in 19 brigades and 14 independent battalions. The guards brigades were the only units of the ZNG that were fully armed with small arms; throughout the ZNG there was a lack of heavier weapons and there was no command and control structure. The shortage of heavy weapons was so severe that the ZNG resorted to use of World War II weapons taken from museums and film studios. At the time, Croatian stockpile of weapons consisted of 30,000 small arms purchased abroad and 15,000 previously owned by the police. A new 10,000-strong special police was established then to replace the personnel lost to the guards brigades.\nPrelude\nCroatian views of the JNA's role in the Serb revolt gradually evolved in January–September 1991. Croatian President Franjo Tuđman's first plan  was to win support from the European Community (EC) and the United States for Croatia; he dismissed advice to seize JNA barracks and storage facilities in the country. Capture of the JNA barracks and storage depots was first advocated by Špegelj in late 1990; he again urged Tuđman to adopt the plan in early-to-mid 1991 while the JNA fought Slovenia's TO in the Ten-Day War in June–July 1991. Špegelj's calls were echoed by Šime Đodan, who succeeded Špegelj as the Defence Minister in July. Špegelj remained in command of the ZNG.\nTuđman's stance was motivated by his belief that Croatia could not win a war against the JNA. The ZNG was limited to defence, even though the actions of the JNA appeared to be coordinated with the Croatian Serb military. The impression was reinforced by buffer zones established by the JNA after armed conflicts between the Croatian Serb militia and the ZNG—the JNA intervened after the ZNG lost territory, leaving the Croatian Serbs in control of areas they captured before the JNA arrived. The JNA provided weapons to the Croatian Serbs, although most of the weaponry was provided from Serbia's TO and Ministry of Internal Affairs stocks.\nIn July 1991, Špegelj and Đodan's demands were backed up by a number of Croatian Parliament members during a parliamentary debate. This led Tuđman to dismiss Đodan the same month he was appointed Defence Minister, and Špegelj resigned his post on 3 August. The deteriorating situation in eastern Croatia including JNA forces' removal of the ZNG from Baranja, intermittent fighting around Osijek, Vukovar and Vinkovci increasing losses and the growing conviction that the JNA actively supported the Croatian Serb revoltforced Tuđman to act. On 22 August, he issued an ultimatum to the federal Yugoslav authorities demanding the withdrawal of the JNA to its barracks by the end of the month. The ultimatum stated if the JNA failed to comply, Croatia would consider it an army of occupation and take corresponding action. On 1 September, the EC proposed a ceasefire and a peace conference was accepted by Tuđmandespite his ultimatumand by the Yugoslav Presidency. The conference started on 7 September, but only four days later, the Croatian member and chair of the presidency Stjepan Mesić ordered the JNA to return to its barracks within 48 hours. The move was motivated by Tuđman's impression that the conference would continue while the ZNG lost ground. Even though the order was disputed by other members of the body, it gave Croatia a justification to openly confront the JNA.\nTimeline\n}}\nPrime Minister Franjo Gregurić proposed Tuđman to implement Špegelj's plan. According to General Anton Tus, Tuđman ordered the ZNG to capture JNA barracks on 12 September, but rescinded the order the next day. The order was reinstated on 14 September after Tus pleaded with Tuđman to authorize the move, arguing that the ZNG was running out of time. The same day, the ZNG and the Croatian police blockaded and cut utilities to all JNA facilities it had access to, beginning the Battle of the Barracks. The move blockaded 33 large JNA garrisons in Croatia, and numerous smaller facilities, including border posts and weapons and ammunition storage depots. The blockade forced the JNA to amend its campaign in Croatia plans to accommodate the new development. Several JNA posts were attacked by the ZNG before the blockade was officially sanctioned, largely in response to local battlefield situations. The first such incident was a failed attack on JNA barracks in Sinj on 25 August, in response to the deterioration of ZNG positions in the nearby village of Kijevo. On 3 September, the ZNG captured a barracks in Sisak, and on 13 September a weapons storage depot in Gospić area was captured amid fighting for control of the city. In May, 21 M-84AB tanks were captured in a Đuro Đaković factory. The tanks were due to be shipped to Kuwait, but a part of the shipment was kept by Croatia. A train transporting JNA weapons from Slovenia to Serbia was captured in Slavonski Brod on 21 August. The ZNG seized its first anti-aircraft weapons, anti-tank weapons, and artillery pieces there while adding to its small stock of mortars. The ZNG forces besieging the JNA facilities were mainly drawn from the local populace; reinforcements deployed from other cities were relatively few.\nSeptember\nOn 14 Septemberthe day Croatian forces were ordered to blockade the JNA facilitiesthe ZNG and the police captured the JNA barracks in Ploče, one of several barracks in Gospić, and one in nearby Perušić. The JNA garrison in Otočacnorth of Gospićalso came under attack as the ZNG started to assault the barracks in the town. The \"Sopnica\" JNA depot near Zagreb and a JNA-manned post on the Hungarian border near Pitomača were captured that day. In response to the blockade of their barracks in Vukovar, the JNA dispatched a force to relieve the siege. The next day, the ZNG and the police captured a JNA depot near Popovecwest of Zagreband another depot near Slavonski Brod. At the same time, fighting erupted around JNA facilities in Varaždin, and two JNA border posts were captured north of Virovitica.\nOn 16 September, Croatian forces captured a JNA barracks and another storage depot in Slavonski Brod, and two barracks in Ogulin, while fighting erupted around a JNA post in Oštarije. Croatian forces also captured the Žrnovnica missile base and JNA weapons storage facilities near Daruvar, Otočac, Križevci and Virovitica. On 17 September, Croatian forces captured the JNA barracks in Daruvar, Ogulin, Čakovec, Križevci, Virovitica, Požega, two JNA barracks in the Šibenik–Rogoznica area and one in Varaždin. A JNA depot was captured near Zagreb (Duboki Jarak). On 18 September, three additional barracks in Varaždin, one near Rogoznica and two in Đakovotogether with all remaining JNA facilities in Gospić, a nearby weapons storage facility, a communications facility near Garešnica and dozens of border postssurrendered to Croatian forces.\nOn 19 September, the ZNG clashed with the JNA garrison at the Logorište barracks in Karlovac, captured a communications facility at Platak near Rijeka an additional JNA barracks and a storage depot in Varaždin, restricting the JNA to the barracks housing headquarters of the JNA Varaždin Corps. By 20 September, when the JNA launched a campaign against the ZNG throughout Croatia, more than 60 JNA facilities in Croatiaincluding 15 barracks and 11 storage depotshad surrendered or were captured. The JNA barracks in Našice surrendered on 21 September. The JNA Varaždin Corps surrendered the next day, providing the ZNG with a major cache of weapons. In the first few days of the blockade, the Croatian forces also captured several small JNA posts in Split, but no large JNA facility in the city.\nIn mid-September, seven JNA facilities in Zadar, including three barracks, were captured. The most significant  captured facility was the \"Turske kuće\" barracks, which contained a large cache of small arms and ammunition. The Yugoslav Air Force carried out air strikes against the facility the next day—following a pattern that was established at the time—to hinder the removal of weapons from captured JNA facilities. On 23 September, a ZNG assault on a large JNA weapons storage site in Sveti Roklocated between Gospić and Zadarfailed. The two remaining JNA barracks under Croatian blockade—in Vinkovci and Osijek—were abandoned by the JNA by 26 September. The Osijek garrison managed to break out from its besieged barracks and joined the JNA troops south and east of the city, while the evacuation of the Vinkovci barracks was negotiated between Croatian authorities and the JNA. The negotiations were initiated after the JNA 1st Guards Mechanised Division reached Vinkovci on 25 September, forcing the ZNG to accept the evacuation. A JNA facility on the island of Korčula surrendered its equipment to the ZNG on 26 September.\nOn 29 September, Croatian forces captured two barracks and three storage depots in and around Bjelovar after a day-long battle, while the fourth storage facility was blown up by its commanding officer, JNA Major Milan Tepić. The explosion killed Tepić and eleven members of the besieging force. It was heard  away and caused damage in nearby villages. The same day, a weapons storage facility in Koprivnica and a border post near Virovitica were captured by the ZNG and the Croatian police. The JNA 73rd Motorized Brigade surrendered in Koprivnica the next day.\nOn 14/15 September, Croatian forces seized a DJČ-612 landing craft from the Yugoslav Navy while it was undergoing repairs in Vela Luka shipyard; they sailed the vessel the same night into the Cetina River. Between 16 and 22 September, Croatian forces captured the Kuline barracks in Šibenik and the 15 Yugoslav Navy vessels based there, as well as a further 19 vessels that were being overhauled in the \"Velimir Škorpik\" shipyard. The vessels, comprising approximately one-quarter of the Yugoslav Navy's assets, included: the Vlado Ćetković (RTOP-402) Končar-class fast attack craft (renamed  later on), the Velimir Škorpik (RČ-310) Osa-class missile boat, the Partizan II (TČ-222) Shershen-class torpedo boat and the Biokovo (PČ-171), Cer (PČ-180) and Durmitor (PČ-181) Mirna-class patrol boats. Also, a ship in the final stages of construction was captured in the Kraljevica Shipyard the same month. She was launched in 1992 as  missile boat. In September, seven coastal artillery bases near Šibenik and on the islands of Šolta, Brač and Korčula were captured.\nOctober\nplan]]\nOn 3 October, Croatian forces captured the \"Joža Vlahović\" JNA barracks in Koprivnica, and a communications post and a border post near the city. The next day, the JNA barracks in Sinj and its nearby land mine storage facility were abandoned after a negotiated agreement. In early October, two JNA artillery regiments based in the \"Šepurine\" barracks near Zadar broke through a siege of their base and joined the JNA attack on the city. By 5 October, Zadar was completely surrounded by the JNA and the situation prompted Croatian authorities in the city to seek a ceasefire and negotiations. The ceasefire was arranged the same day, while the negotiations, held on 7–9 October, brought about the lifting of the JNA siege of Zadar and the evacuation of the remaining JNA garrison and its equipment from the city. The evacuation, involving seven JNA facilities, started on 11 October and took 15 days. The agreement stipulated that the evacuated units would leave Croatian soil and the JNA generally respected the obligation, even though twenty truckloads of weapons were left to the Serbian population in the hinterland around Zadar.\nIn the wake of the bombing of Banski Dvori of 7 October, Croatian authorities instructed the ZNG to assault and capture JNA barracks in the Zagreb area if commanders considered it possible. The instructions did not result in attacks in Zagreb itself, but JNA barracks in Samobor were captured by Croatian forces on the day of the bombing. The declaration of the independence of Croatia came into force the next day.\nOn 13 October, the JNA mostly destroyed and abandoned its barracks at Oštarije, and a JNA weapons storage facility in Rijeka was damaged in a fire caused by a thunderstorm. The ZNG removed some weapons from the latter while the firefighters were called in to save individual storage structures. The next day, the JNA began moving the remaining weapons from the damaged storage to elsewhere in the city. While a convoy of 18 trucks was moving through Rijeka, 15 vehicles carrying weapons were diverted and captured by the ZNG. At the same time, personnel at the JNA's Borongaj barracks in Zagreb were allowed to evacuate in return for free passage of a convoy carrying humanitarian aid to Vukovar, where the battle to control the city was in progress.\nNovember\nAfter a period of siege with little or no activity, the JNA forces in the Logorište barracks in the Karlovac area broke through the blockade towards the JNA-held territory to the east of the city in the Battle of Logorište, which lasted from 4 to 6 November. The Croatian forces besieging the barracks were more numerous, but the JNA had superiority in armour and artillery. After it was abandoned by the JNA, the barracks still contained weapons which were taken away by the Croatian troops by 13 November. The ZNG was renamed the Croatian Army (Hrvatska vojskaHV) in early November. It captured the Jamadol barracks and storage facility in Karlovac on 4 November, while the fighting around the Logorište barracks was in progress. The following day, the HV captured JNA barracks and several weapons storage facilities in Delnice. The attacks were ordered to capture ammunition needed by the HV because its stockpile was running low.\nOn 8 November, Davorin Rudolf representing Croatian authorities, and Lieutenant Colonel General Marijan ČadJNA commanding officer of the 13th (Rijeka) Corpsagreed to evacuate the corps personnel and equipment from Croatia. The agreement, made after negotiations supervised and supported by the European Community Monitor Mission (ECMM) would later serve as a model for similar agreements elsewhere in Croatia. Čad made the agreement at his own initiative, with the support of the JNA Fifth Military District, after receiving an order from the JNA Chief of Staff Colonel General Blagoje Adžić to destroy the JNA facilities in Rijeka and to attack industrial plants and infrastructure in or near the city. The agreement was not affected by the HV capture of the Draga barracks and weapons stored there on 9 November. The JNA 13th (Rijeka) Corps started to evacuate by sea to Montenegrin ports on 18 November.\nFollowing negotiations, the JNA evacuated its Jastrebarsko barracks on 13 November. The garrison left, under ECMM escort, to Bosnia and Herzegovina. The next day, an agreement to evacuate the JNA from Šibenik was made in the village of Žitnić near Drniš. The Yugoslav Navy's bombardment of Split, Šolta and Brač on 15 Novemberin response to the loss of a Mukos (PČ-176) patrol boatand the subsequent Battle of the Dalmatian channels appeared to have derailed the Žitnić agreement.\nIn Žitnić on 21 November, another agreement to evacuate the JNA and the Yugoslav Navy from the Šibenik–Split area and surrender of the confiscated TO weapons stored there was signed by Rudolf and the JNA Maritime-Military District commanding officer Major General Nikola Mladenić. It was followed by another agreement to the same effect\nwhich was signed in Split two days later by Mladenić and Croatian Admiral Sveto Letica, defining that the pullout should be completed within 30 days. The agreement also provided for a cease-fire in northern Dalmatia and the lifting of the Yugoslav Navy's blockade of the Croatian coast. The agreement did not include evacuation of the Yugoslav Navy from its bases on the islands of Vis and Lastovo. Tensions remained high throughout the process and the JNA made contingency plans to break through from Knin to Šibenik and Split and relieve the siege of its forces there—these plans were codenamed Operation Coast-91 (Operacija Obala-91) and Operation Hurricane-91 (Operacija Orkan-91) respectively.\nAmid international pressure on Croatia to end the siege of the JNA garrison in Zagreb, Croatian authorities and the JNA signed an agreement on 22 November to evacuate all remaining JNA forces from Croatia. The agreement was signed in Zagreb, by HV Colonel Imra Agotić and Lieutenant Colonel General Andrija Rašeta in presence of the ECMM monitors. The agreement was confirmed the next day in Geneva when the Geneva Accord was signed by Tuđman, Milošević and the Yugoslav defence minister, JNA General Veljko Kadijević.\nAftermath\nThe ZNG quickly captured isolated JNA facilities, depots and several major posts, seizing a large quantity of weapons, including the entire stocks of the JNA 32nd (Varaždin) Corps and nearly all the weapons previously confiscated from the Croatia's TO. The JNA lost control of eight brigadesincluding one armoured brigade, two mechanized brigades and three artillery regimentsand additional forces in the JNA Fifth Military District and the Military-Maritime District remained pinned down by the blockade. The significance of the Battle of the Barracks was reinforced by introduction of a United Nations (UN) arms embargo on 25 September. The Battle of the Barracks resulted in a large increase of ZNG/HV capabilities—allowing complete arming of its existing units, raising of additional 40–42 brigades and fielding 200,000 troops and 40,000 police by the end of the year. In the battle, the ZNG/HV captured 250 tanks, 400–500 heavy artillery pieces, 180,000 small arms and 2&nbsp;million tonnes of ammunition. In addition, 3,000 officers left the JNA and joined the HV.\nWhile there is no information on the number of troops involved or casualties sustained on either side, the JNA garrisons in Croatia were significantly undermanned at the time. The JNA order of battle, developed in the 1980s, specified a handful of battalions at full combat readiness in Croatia. Those were elements of the 140th Mechanised Brigade in Zagreb, the 31st Armoured Brigade in Dugo Selo near Zagreb, the 12th Proletarian Mechanised Brigade in Osijek, the 11th Marine Infantry Brigade in Šibenik and the 139th Marine Infantry Brigade in Pula. In 1990, the \"A\" classificationrequiring 60–100% troop levels, was assigned to the 4th Armoured Brigade in Jastrebarsko, a battalion of the 622nd Motorised Brigade in Petrinja, the 13th Proletarian Motorised Brigade in Rijeka, and the 265th Mechanised Brigade in Bjelovar and Koprivnica. The 221st Motorised Brigade based in Knin was reinforced with \"A\" class armoured and mechanised battalions. In addition, an armoured battalion was added to the 622nd Mechanised Brigade, and a mechanised battalion to JNA garrisons in Vinkovci and Vukovar each in May 1991. Likewise, Croatian forces were strained between maintaining the blockade and manning the positions held against the JNA and Croatian Serb militias elsewhere. Surrendered JNA troops were either transported to Serbia, exchanged for prisoners of war captured elsewhere, or were given civilian clothing and released.\nBoth in 1991 and years later, Špegelj criticised Tuđman's decision to disregard his advice to attack the JNA barracks earlier than September—specifically during the Ten-Day War in Slovenia in June–July 1991. Špegelj said that an earlier move, preempting deterioration of the strategic situation in Croatia, would best serve Croatian defensive needs. Furthermore, he said that the JNA would be unable to respond in force because it would need two months to mobilise the required forces and that all prerequisites for a decisive victory against the JNA were met. Tus thought that Tuđman kept postponing the blockade because of the pressure applied by the international community against confrontation with the JNA. Zdravko Tomac, deputy prime minister of a national unity government in Croatia at the time, and later an opposition leader, stated that while Špegelj's view was militarily correct, Tuđman's position was politically better. Kadijević conversely said that the JNA would have fared better if Croatian forces had confronted it earlier because the JNA's capabilities declined during the summer of 1991.\nVance plan\nThe JNA campaign in Croatia ended in a stalemate, leading the belligerents to accept an internationally supervised ceasefire, formulated as the Vance plan—a result of a diplomatic mission by the Special Envoy of the Secretary-General of the United Nations Cyrus Vance, aided by United States diplomat Herbert Okun, and Under-Secretary-General of the United Nations for Special Political Affairs Marrack Goulding, to Yugoslavia aimed at securing a negotiated end to hostilities in Croatia. The plan proposed a ceasefire, the protection of civilians in specific areas designated as UN Protected Areas and deployment of a UN force to Croatia. The Vance plan provided for the end of the Croatian blockade of the JNA barracks, the withdrawal of all JNA personnel and equipment from Croatia, the implementation of a ceasefire and the facilitation of delivery of humanitarian aid. The parties to the accord also agreed to the deployment of a UN peacekeeping mission in Croatia, later initiated through the subsequent United Nations Security Council Resolution 721 of 27 November.  As a consequence of organizational problems and breaches of the last ceasefire agreement, the UN peacekeepers only started to deploy on 8 March 1992.\nEvacuation of the JNA\nThe JNA continued to evacuate following the Geneva Accord. The remaining seven JNA facilities in Rijeka area were evacuated during November, and the last barracks evacuated were those in Trsat on 10 December. In Šibenik, the JNA evacuated two barracks and four depots from 25 November until 24 December, turning the confiscated Croatian TO weapons over to the HV on 10 December—but the weapons remained in a sealed storage under ECMM supervision until 25 December as required by the Žitnić agreement. Most of the evacuation took place by rail via Knin, and part of the force was moved by sea to Montenegro. The evacuation agreement requiredas in case of the Zadar evacuationthe removal of the evacuated units from Croatian soil; the JNA only partly fulfilled that criterion. The \"Divulje\" base of the JNA near Trogir started to evacuate by sea on 4 December, after an additional agreement signed by Rudolf and Mladenić regulating surrender of the TO weapons to the HV and the evacuation of the Lora naval base in Split.\nThe evacuation was halted again when it was determined that some of the TO weapons were missing from the JNA facilities in Split. The issue was resolved through an agreement of 18 December made between Rašeta and Agotić stipulating that the JNA would provide the HV with the missing weapons from its own stocks, and the evacuation resumed. Since the JNA did not have sufficient weapons to achieve that criterion in Split, a Yugoslav Navy ship delivered  of weapons and ammunition from Kumbor in Montenegro to Split on 1 January 1992. The last JNA forces left the area of Split on 4 January.\nThe JNA also evacuated its facilities elsewhere in Croatia. Pullout from the Maršal Tito and Kerestinec barracks in Zagreb started on 30 November, and was completed by the end of 1991. Istria was evacuated by the JNA and the Yugoslav Navy on 15 December, handing over the Croatian TO weapons to the HV. The quantity of the TO weapons handed over in Istriawhere the JNA evacuated 78 facilitieswas enough to arm two combat brigades. In December 1991, only minor clashes occurred around the JNA facilities that were still under the HV blockade, including a minor, unsuccessful HV attack on Mekušje barracks in Karlovac. Despite the Geneva Accord requiring an immediate withdrawal of JNA personnel and equipment, the JNA remained for seven to eight months. When its troops eventually withdrew from Croatia, the JNA left their equipment to the Republic of Serbian Krajina, established in the JNA-held areas of Croatia on 19 December. The JNA and the Yugoslav Navy kept their bases on Vis and Lastovo islands until early June 1992 before pulling out unilaterally. The JNA maintained positions near Dubrovnik until July, while the naval blockade of the city was lifted on 26 May 1992.\nWar crimes charges\nCroatian authorities charged the deputy head of the Bjelovar police operations department and three special police force members with the deaths of five JNA prisoners and the shooting of a civilian following the surrender of the Bjelovar barracks. They were acquitted after 12 years of legal proceedings, after the Supreme Court of Croatia twice ordered a re-trial. The Head of Bjelovar crisis centre was also charged with war crimes in 2012, but  his trial is still pending. Croatia also charged numerous JNA officers who held posts in the blockaded garrisons. In Osijek, 13 JNA officers were charged with war crimes against the civilian population, including causing the deaths of 307 persons and severe injuries to 171 persons, but none were arrested .\nWar crime charges were brought against JNA commander of the 32nd (Varaždin) Corps, General Vladimir Trifunović. He was charged by Croatia with the deaths of six individuals and the wounding of a further 37. After a trial in absentia, he was found guilty and sentenced to 15 years in prison in 1991. Three years later, in 1994, Trifunović was charged in Yugoslavia with treason because he surrendered the entire JNA corps to the ZNG. He was convicted and sentenced to 11 years in prison. In early 1996, he was pardoned and released, and the Yugoslav authorities paid him  compensation for spending nearly two years in a prison. In 2013, Trifunović formally requested re-trial in Croatia. He died in Belgrade in January 2017.\nFootnotes\nReferences\n;Books\n*\n*\n*\n*|url=https://books.google.com/books?id=it1IAQAAIAAJ|title=Balkan Battlegrounds: A Military History of the Yugoslav Conflict, 1990–1995|publisher=Central Intelligence Agency|author=Central Intelligence Agency, Office of Russian and European Analysis|year=2002|oclc=50396958|location=Washington, D.C.|isbn = 9780160664724}}\n*|publisher=Routledge|isbn=978-1-85743-058-5|location=London, England}}\n*\n*\n*\n*\n*\n*\n*\n*\n;Scientific journal articles\n*\n*\n*\n*\n*\n*\n*\n* of The Yugoslav People's Army on the Republic of Croatia 1990–1992|first=Davor|last=Marijan|volume=1|issue=1|date=December 2005|pages=295–318}}\n*\n*\n*\n*\n*\n*\n;News reports\n* |newspaper=The Independent |url=https://www.independent.co.uk/news/world/croatia-built-web-of-contacts-to-evade-weapons-embargo-1556500.html |title=Croatia built 'web of contacts' to evade weapons embargo |first=Christopher |last=Bellamy |date=10 October 1992 |archive-date=10 November 2012 |archive-url=https://web.archive.org/web/20121110025827/http://www.independent.co.uk/news/world/croatia-built-web-of-contacts-to-evade-weapons-embargo-1556500.html |url-status=live }}\n* |newspaper=Posavska Hrvatska |url=http://www.posavskahrvatska.hr/Novost.aspx?kat=28&id=28_2011091612240 |title=Mala, ali značajna bitka |language=hr |trans-title=Small, but significant battle |date=16 September 2011 |first1=Karolina |last1=Bognar |first2=Marija |last2=Kovačević |first3=Dunja |last3=Vanić |first4=Marija |last4=Ravlić |first5=Irena |last5=Vukas |first6=Marin |last6=Kovačević |archive-date=2 December 2013 |url-status=live |archive-url=https://web.archive.org/web/20131202120551/http://www.posavskahrvatska.hr/Novost.aspx?kat=28&id=28_2011091612240 }}\n* |date=14 October 1991 |newspaper=Delo |url=http://arhiv.mm.gov.si/vlada/20/Delo/1991_14_10_Delo.pdf |title=Težavna pot konvoja s pomočjo v Vukovar |trans-title=Hard road ahead of the relief convoy for Vukovar |language=sl |first1=Milovan |last1=Dimitrič |first2=Goran |last2=Moravček |archive-date=2 December 2013 |archive-url=https://web.archive.org/web/20131202120712/http://arhiv.mm.gov.si/vlada/20/Delo/1991_14_10_Delo.pdf |url-status=live }}\n* |newspaper=The New York Times |url=https://www.nytimes.com/1991/03/03/world/belgrade-sends-troops-to-croatia-town.html |first=Stephen |last=Engelberg |title=Belgrade Sends Troops to Croatia Town |date=3 March 1991 |archive-date=2 October 2013 |archive-url=https://web.archive.org/web/20131002222925/http://www.nytimes.com/1991/03/03/world/belgrade-sends-troops-to-croatia-town.html |url-status=live }}\n* |date=10 May 2011 |newspaper=Večernji list |url=http://www.vecernji.hr/vijesti/general-vlado-trifunovic-ce-pravdu-potraziti-hrvatskoj-clanak-286048 |language=hr |title=General Vlado Trifunović će pravdu potražiti i u Hrvatskoj |trans-title=General Vlado Trifunović will seek justice in Croatia too |first=Miroslav |last=Flego |archive-date=6 December 2013 |archive-url=https://web.archive.org/web/20131206125136/http://www.vecernji.hr/svijet/general-vlado-trifunovic-ce-pravdu-potraziti-i-u-hrvatskoj-286048 |url-status=live }}\n* |url=http://www.glasistre.hr/vijesti/pula_istra/prije-tocno-21-godine-pulu-napustila-jugo-vojska-369606 |language=hr |newspaper=Glas Istre |date=15 December 2012 |first=Cristian Bruno |last=Galić |title=Prije točno 21 godine Pulu napustila jugo-vojska |trans-title=Yugo-army left Pula 21 years ago to the day |archive-date=2 December 2013 |archive-url=https://web.archive.org/web/20131202121014/http://www.glasistre.hr/vijesti/pula_istra/prije-tocno-21-godine-pulu-napustila-jugo-vojska-369606 |url-status=live }}\n* |url=http://www.dulist.hr/kolumna/16206/igra-na-male-bare-ii |newspaper=Dubrovački list |date=23 November 2011 |title=Igra na \"Male Bare\" II |trans-title=Male Bare games II |first=Varina |last=Jurica Turk |archive-date=8 October 2013 |archive-url=https://web.archive.org/web/20131008221817/http://www.dulist.hr/kolumna/16206/igra-na-male-bare-ii |url-status=live }}\n* |url=http://arhiv.slobodnadalmacija.hr/20070218/novosti01.asp |date=18 February 2007 |newspaper=Slobodna Dalmacija |first=Zvonimir |last=Kirlan |title=Gregurić Miloviću: JNA neće tenkove upotrijebiti protiv vlastitoga naroda |language=hr |trans-title=Gregurić to Milović: JNA will not use tanks against its own people |archive-date=22 July 2009 |archive-url=https://web.archive.org/web/20090722135439/http://arhiv.slobodnadalmacija.hr/20070218/novosti01.asp |url-status=live }}\n* |url=http://www.zadarskilist.hr/clanci/23092011/zauzimanjem-vojarni-sprijecen-pakleni-plan-jna-da-u-zadar-udu-tenkovskim-snagama |date=23 September 2011 |newspaper=Zadarski list |first=Siniša |last=Klarica |title=Zauzimanjem vojarni spriječen pakleni plan JNA da u Zadar uđu tenkovskim snagama |language=hr |trans-title=Capture of the barracks foiled JNA's deadly plan to enter Zadar with tanks |archive-date=25 August 2013 |archive-url=https://web.archive.org/web/20130825191551/http://zadarskilist.hr/clanci/23092011/zauzimanjem-vojarni-sprijecen-pakleni-plan-jna-da-u-zadar-udu-tenkovskim-snagama |url-status=live }}\n* |date=17 November 2008 |newspaper=Jutarnji list |url=http://www.jutarnji.hr/osjecku-katedralu-gadali-za-gajbu-piva/194503/ |title=Osječku katedralu gađali za gajbu piva |trans-title=Osijek cathedral shot at for a case of beer |language=hr |first=Suzana |last=Lepan |archive-date=2 December 2013 |archive-url=https://web.archive.org/web/20131202122123/http://www.jutarnji.hr/osjecku-katedralu-gadali-za-gajbu-piva/194503/ |url-status=dead |access-date=23 May 2013 }}\n* |url=http://www.novossti.com/2010/05/covjek-ciji-je-neposluh-spasio-rijeku/ |language=hr |title=Čovjek čiji je neposluh spasio Rijeku |trans-title=Man whose disobedience saved Rijeka |first=Ernest |last=Marinković |date=14 May 2010 |publisher=Novosti |archive-date=27 September 2012 |archive-url=https://web.archive.org/web/20120927040811/http://www.novossti.com/2010/05/covjek-ciji-je-neposluh-spasio-rijeku/ |url-status=live }}\n* |date=15 November 2010 |newspaper=Večernji list |url=http://www.vecernji.hr/vijesti/jure-simic-osumnjicen-ratni-zlocin-branit-ce-se-sa-slobode-clanak-215644 |first=Darko |last=Marčinković |title=Jure Šimić, osumnjičen za ratni zločin, branit će se sa slobode |language=hr |trans-title=Jure Šimić, suspected of a war crime, will stand trial on bail |archive-date=6 December 2013 |archive-url=https://web.archive.org/web/20131206210155/http://www.vecernji.hr/crna-kronika/jure-simic-osumnjicen-za-ratni-zlocin-branit-ce-se-sa-slobode-215644 |url-status=live }}\n*|url=https://balkaninsight.com/2017/01/17/disputed-ex-yugoslav-general-dies-in-belgrade-01-17-2017/|date=17 January 2017|website=Balkan Insight|title=Yugoslav General Who Staged Croatia Retreat Dies|first=Sven|last=Milekic|archive-date=27 April 2021|archive-url=https://web.archive.org/web/20210427155151/https://balkaninsight.com/2017/01/17/disputed-ex-yugoslav-general-dies-in-belgrade-01-17-2017/|url-status=live}}\n* |url=http://arhiv.slobodnadalmacija.hr/20000915/novosti2.htm |date=15 September 2000 |newspaper=Slobodna Dalmacija |title=Orešković i Norac zaslužni što Gospić danas nije Teslingrad! |language=hr |trans-title=Orešković and Norac take credit that Gospić is not called Teslingrad today |first=Marko |last=Marković |archive-date=25 September 2010 |archive-url=https://web.archive.org/web/20100925061835/http://arhiv.slobodnadalmacija.hr/20000915/novosti2.htm |url-status=live }}\n* |newspaper=Novi list |date=14 October 2006 |first=Dragan |last=Ogurlić |title=Osvajanje vojarni u Rijeci |trans-title=Conquest of barracks in Rijeka |language=hr |url=http://udruga128brhv.com/pdf-15-god-nl/2.pdf |archive-date=2 December 2013 |archive-url=https://web.archive.org/web/20131202133530/http://novine.novilist.hr/Default.asp?WCI=Rubrike&WCU=2859285C2863285928582863285A28582858285E286328962897289E2863289628972897288A28942892288D2863285A285A285D2858285E285B2863286328632863K |url-status=dead }}\n* |date=21 October 2003 |newspaper=Nacional |url=http://www.nacional.hr/clanak/10744/htjeli-su-da-poginem-da-dokazu-da-su-hrvati-genocidni |title=Htjeli su da poginem da dokažu da su Hrvati genocidni |language=hr |trans-title=They wanted me to get killed to prove that Croats are genocidal |first=Davor |last=Pašalić |archive-date=17 July 2012 |archive-url=https://web.archive.org/web/20120717003436/http://www.nacional.hr/clanak/10744/htjeli-su-da-poginem-da-dokazu-da-su-hrvati-genocidni |url-status=live }}\n* |newspaper=Slobodna Dalmacija |date=25 August 2010 |first=Toni |last=Paštar |title=Vijenci, svijeće i molitve u Sinju i Vrlici za poginule branitelje |language=hr |trans-title=Wreaths, candles and prayers for dead in Sinj and Vrlika |url=http://www.slobodnadalmacija.hr/Split-županija/tabid/76/articleType/ArticleView/articleId/113660/Default.aspx |archive-date=19 October 2012 |archive-url=https://web.archive.org/web/20121019085644/http://www.slobodnadalmacija.hr/Split-%C5%BEupanija/tabid/76/articleType/ArticleView/articleId/113660/Default.aspx |url-status=live }}\n* |newspaper=Slobodna Dalmacija |date=16 January 2012 |first=Toni |last=Paštar |title=Snažno uporište JNA |language=hr |trans-title=Strong JNA base |url=http://www.slobodnadalmacija.hr/Split-županija/tabid/76/articleType/ArticleView/articleId/161380/Default.aspx |archive-date=6 March 2012 |archive-url=https://web.archive.org/web/20120306142145/http://www.slobodnadalmacija.hr/Split-%C5%BEupanija/tabid/76/articleType/ArticleView/articleId/161380/Default.aspx |url-status=live }}\n* |newspaper=Večernji list |url=http://www.vecernji.hr/vijesti/20-godina-priznanja-otkrivamo-nepoznate-detalje-novije-povijesti-clanak-366171 |title=20 godina od priznanja – otkrivamo nepoznate detalje novije povijesti |trans-title=20 years since recognition – we reveal unknown details of the recent history |language=hr |first=Silvana |last=Perica |archive-date=6 December 2013 |archive-url=https://web.archive.org/web/20131206054219/http://www.vecernji.hr/hrvatska/20-godina-od-priznanja-otkrivamo-nepoznate-detalje-novije-povijesti-366171 |url-status=live }}\n* |publisher=Lika online daily e-newspaper |first=Dražen |last=Prša |language=hr |title=Na današnji dan osvojena vojarna u Otočcu |trans-title=Anniversary of Otočac barracks capture |url=http://www.lika-online.com/na-danasnji-dan-osvojena-vojarna-u-otoccu/ |date=17 September 2012 |archive-date=17 October 2012 |archive-url=https://web.archive.org/web/20121017200701/http://www.lika-online.com/na-danasnji-dan-osvojena-vojarna-u-otoccu/ |url-status=live }}\n* |date=13 November 2010 |publisher=Radio Jaska |url=http://www.radio-jaska.hr/index.php?option=com_content&view=article&id=1439%3A-dananji-13-ti-studeni-dan-je-grada-jastrebarskog&Itemid=103 |language=hr |title=Današnji 13. studeni, dan je grada Jastrebarskog! |trans-title=Today, 13 November, is the day of the city of Jastrebarsko! |archive-date=2 December 2013 |archive-url=https://web.archive.org/web/20131202131834/http://www.radio-jaska.hr/index.php?option=com_content&view=article&id=1439%3A-dananji-13-ti-studeni-dan-je-grada-jastrebarskog&Itemid=103 |url-status=live }}\n* |date=22 September 2008 |publisher=Radio Našice |url=http://www.radionasice.hr/?p=551 |title=Obilježen Dan pobjede nad JNA u Našicama |language=hr |trans-title=Victory day over the JNA marked in Našice |archive-date=2 December 2013 |archive-url=https://web.archive.org/web/20131202132549/http://www.radionasice.hr/?p=551 |url-status=live }}\n* |date=6 July 2012 |newspaper=Novi list |url=http://www.novilist.hr/Vijesti/Hrvatska/Skupa-pravda-Sud-mora-platiti-milijun-kuna-za-12-godina-dug-proces |language=hr |title=Skupa pravda: Sud mora platiti milijun kuna za 12 godina dug proces |trans-title=Expensive justice: The court ordered to pay a million Kuna for 12-years-long trial |first=Ana |last=Raić Knežević |archive-date=22 August 2012 |archive-url=https://web.archive.org/web/20120822072237/http://www.novilist.hr/Vijesti/Hrvatska/Skupa-pravda-Sud-mora-platiti-milijun-kuna-za-12-godina-dug-proces |url-status=live }}\n* |date=9 April 2013 |newspaper=Večernji list |url=http://www.vecernji.hr/hrvatska/general-bivse-jna-vladimir-trifunovic-trazi-novo-sudjenje-536424 |title=General bivše JNA Vladimir Trifunović traži novo suđenje |language=hr |trans-title=Former JNA General Vladimir Trifunović seeks new trial |first=Kristijan |last=Skočibušić |archive-date=2 December 2013 |archive-url=https://web.archive.org/web/20131202132821/http://www.vecernji.hr/hrvatska/general-bivse-jna-vladimir-trifunovic-trazi-novo-sudjenje-536424 |url-status=live }}\n* |newspaper=The New York Times |url=https://www.nytimes.com/1991/04/02/world/rebel-serbs-complicate-rift-on-yugoslav-unity.html |title=Rebel Serbs Complicate Rift on Yugoslav Unity |first=Chuck |last=Sudetic |date=2 April 1991 |archive-date=2 October 2013 |archive-url=https://web.archive.org/web/20131002222938/http://www.nytimes.com/1991/04/02/world/rebel-serbs-complicate-rift-on-yugoslav-unity.html |url-status=live }}\n* |date=14 September 2010 |newspaper=Slobodna Dalmacija |language=hr |title=Dan kada je osvojena prva vojarna u Hrvatskoj |trans-title=The day when the first barracks in Croatia were captured |first=Ante |last=Šunjić |url=http://www.slobodnadalmacija.hr/Dubrovnik/tabid/75/articleType/ArticleView/articleId/115447/Default.aspx |archive-date=2 December 2013 |archive-url=https://web.archive.org/web/20131202124949/http://www.slobodnadalmacija.hr/Dubrovnik/tabid/75/articleType/ArticleView/articleId/115447/Default.aspx |url-status=live }}\n* |newspaper=The New York Times |url=https://www.nytimes.com/1990/08/19/world/roads-sealed-as-yugoslav-unrest-mounts.html |agency=Reuters |title=Roads Sealed as Yugoslav Unrest Mounts |date=19 August 1990 |archive-date=21 September 2013 |archive-url=https://web.archive.org/web/20130921063029/http://www.nytimes.com/1990/08/19/world/roads-sealed-as-yugoslav-unrest-mounts.html |url-status=live }}\n* |newspaper=The New York Times |date=30 November 1991 |url=https://www.nytimes.com/1991/11/30/world/serbian-troops-pull-out-of-croatian-barracks.html |title=Serbian Troops Pull Out of Croatian Barracks |archive-date=2 December 2013 |archive-url=https://web.archive.org/web/20131202125126/http://www.nytimes.com/1991/11/30/world/serbian-troops-pull-out-of-croatian-barracks.html |url-status=live }}\n* |date=28 May 2011 |newspaper=Jutarnji list |url=http://www.jutarnji.hr/antun-tus--petar-stipetic--martin-spegelj-i-imra-agotic--ljudi-koji-su-stvorili-hrvatsku-vojsku/949293/ |language=hr |title=Tus, Stipetić, Špegelj i Agotić: Dan prije opsade Vukovara Tuđman je Imri Agotiću rekao: Rata neće biti! |trans-title=Tus, Stipetić, Špegelj and Agotić: A day ahead of the siege of Vukovar, Tuđman said to Imra Agotić: There will be no war! |first=Krešimir |last=Žabec |archive-date=21 April 2012 |archive-url=https://web.archive.org/web/20120421001532/http://www.jutarnji.hr/antun-tus--petar-stipetic--martin-spegelj-i-imra-agotic--ljudi-koji-su-stvorili-hrvatsku-vojsku/949293 |url-status=live }}\n;International, governmental, and NGO sources\n* |title=17. rujna – oslobođenje vojarne \"Polom\" i Dan branitelja Daruvara |language=hr |trans-title=17 September – liberation of \"Polom\" barracks and the day of the defenders of Daruvar |publisher=City of Daruvar |url=http://www.daruvar.hr/info.php?kateg_info=3 |archive-date=5 September 2013 |archive-url=https://web.archive.org/web/20130905043230/http://daruvar.hr/info.php?kateg_info=3 |url-status=dead |access-date=23 May 2013 }}\n* |date=6 November 2011 |publisher=City of Delnice |url=http://www.delnice.hr/vijesti_11_11_07.html |language=hr |title=Gorski kotar upisan je zlatnim slovima |trans-title=Gorski kotar inscribed in gold |archive-date=2 December 2013 |archive-url=https://web.archive.org/web/20131202122848/http://www.delnice.hr/vijesti_11_11_07.html |url-status=live }}\n*|url=http://www.duro-dakovic.com/_data/files/99EN.pdf|chapter=Wartime history of the factory|page=13|publisher=Đuro Đaković|title=Unstoppable on all terrains|archive-url=https://web.archive.org/web/20131202122951/http://www.duro-dakovic.com/_data/files/99EN.pdf|archive-date=2 December 2013|url-status=live}}\n* |title=Narodna zaštita i dobrovoljački odredi |language=hr |trans-title=National guard and volunteer detachments |publisher=City of Ogulin |url=http://www.ogulin.hr/povijest/domovinski-rat/narodna-zastita |archive-date=13 August 2011 |archive-url=https://web.archive.org/web/20110813044957/http://www.ogulin.hr/povijest/domovinski-rat/narodna-zastita |url-status=dead |access-date=23 May 2013 }}\n* |title=Branitelji grada Siska proslavili svoj dan |language=hr |trans-title=Defenders of the city of Sisak celebrate their day |date=3 September 2012 |publisher=City of Sisak |url=http://www.sisak.hr/clanak_/14652/branitelji-grada-siska-proslavili-svoj-dan |archive-date=2 December 2013 |archive-url=https://web.archive.org/web/20131202123147/http://www.sisak.hr/clanak_/14652/branitelji-grada-siska-proslavili-svoj-dan |url-status=live }}\n* |publisher=Hrvatski vojnik |url=http://www.hrvatski-vojnik.hr/hrvatski-vojnik/3132010/domovinskirat.asp |language=hr |title=Dokumenti o napadnim operacijama JNA i pobunjenih Srba u Dalmaciji 1991. (III. dio) |trans-title=Documents on offensive operations of the JNA and the rebel Serbs in Dalmatia 1991 (part 3) |first=Ante |last=Nazor |date=October 2010 |archive-date=30 November 2013 |archive-url=https://web.archive.org/web/20131130120732/http://www.hrvatski-vojnik.hr/hrvatski-vojnik/3132010/domovinskirat.asp |url-status=dead |access-date=23 May 2013 }}\n* |publisher=Hrvatski vojnik |url=http://www.hrvatski-vojnik.hr/hrvatski-vojnik/772001/hrm.asp |language=hr |title=Hrvatska ratna mornarica u obrani Jadrana |trans-title=Croatian Navy in defence of the Adriatic |first=Marijo |last=Reljanović |date=November 2001 |archive-date=2 October 2013 |archive-url=https://web.archive.org/web/20131002133723/http://www.hrvatski-vojnik.hr/hrvatski-vojnik/772001/hrm.asp |url-status=dead }}\n*|title=The Prosecutor vs. Milan Martic – Judgement|url=http://www.icty.org/x/cases/martic/tjug/en/070612.pdf|publisher=International Criminal Tribunal for the former Yugoslavia|date=12 June 2007}}\n* |publisher=Hrvatski vojnik |url=http://www.hrvatski-vojnik.hr/hrvatski-vojnik/3612011/veza.asp |language=hr |title=20. obljetnica pukovnije veze |trans-title=20th anniversary of the signals regiment |first=Domagoj |last=Vlahović |date=September 2011 |archive-date=2 December 2013 |archive-url=https://web.archive.org/web/20131202123358/http://www.hrvatski-vojnik.hr/hrvatski-vojnik/3612011/veza.asp |url-status=live }}"
    }
  ]
}