{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Asculum\n\n}}\n|year=2020 |publisher=Routledge |isbn=978-1-138-54382-9}}\n| combatant1        = *Roman Republic\n*Marsians\n*Marrucinians\n*Paelignians\n*Frentanians\n*Daunians\n*Umbrians\n| combatant2        = *Epirotes\n*Aetolians\n*Acarnanians\n*Athamanians\n*Macedonians\n*Thessalians\n*Tarantines\n*Samnites\n*Lucanians\n*Bruttians\n| commander1        = Publius Decius MusPublius Sulpicius Saverrio\n| commander2        = Pyrrhus of Epirus\n| strength1         = |300 anti-elephant devises|4,400 Apulian allies}}\n| strength2         = |19 war elephants}}\n| casualties1       = 6,000 (Plutarch) over 15,000 (Dionysius of Halicarnassus)\n| casualties2       = 3,505 (Plutarch) over 15,000 (Dionysius of Halicarnassus)\n}}\nThe Battle of Asculum was a poorly documented battle that took place near Asculum (modern Ascoli Satriano) in 279 BC, and was thought to have lasted either one or two days, between the Roman Republic under the command of the consuls Publius Decius Mus (who by some accounts died before the battle) and Publius Sulpicius Saverrio, and the forces of King Pyrrhus of Epirus. The battle took place during the Pyrrhic War, after the Battle of Heraclea of 280 BC, which was the first battle of the war. There currently exist accounts of this battle only by three ancient historians: Dionysius of Halicarnassus, Plutarch, and Cassius Dio, although these historians in turn reference other historians whose work is now lost. Asculum was in Lucanian territory, in southern Italy. The Battle of Asculum was the original \"Pyrrhic victory\". Two main accounts of the battle survive. Plutarch describes a two-day battle where Pyrrhus attacked the Romans on the first day over rough terrain before on the second day Pyrrhus secured flat terrain which allowed his elephantry and cavalry to defeat the Romans. Dionysius of Halicarnassus, followed by Dio and Zonaras, instead presents a single-day battle in which Roman forces break through the Epirote centre, producing an inconclusive engagement that ended in the night. Plutarch's narrative however is the more reliable. A third variant tradition, rather than marking a Epirote victory or indecision, instead reports that the Romans won; the historian Patrick Kent dismisses these claims as products of patriotic Roman historiography, attributing them to the poet Ennius and later Roman historians' biases. Jeff Champion suggests that it was a narrow tactical victory to Pyrrhus.\nPrelude and armies\nCassius Dio wrote that during the winter of 280/279 BC both sides prepared for the next battle. In the spring of 279 BC, Pyrrhus invaded Apulia. Many places were captured or capitulated. The Romans came upon him near Asculum and encamped opposite him. In Plutarch's account, after resting his army, Pyrrhus marched to Asculum to confront the Romans.\nAccording to Dionysius of Halicarnassus, Pyrrhus had 70,000 infantry, of whom 20,000 were phalangites (including 4,000 Macedonians from Ptolemy Ceraunus). The Romans had more than 70,000 infantry, of whom about 20,000 were Romans (four legions which at the time had 4,000 men each), the rest being troops from allies. The Romans had about 8,000 cavalry and Pyrrhus had slightly more, plus 19 war elephants. The 1st century AD Roman senator Frontinus estimated a strength of 40,000 men for both sides. Pyrrhus had men from Thesprotia, Ambracia, and Chaon, two cities and a district in Epirus, and mercenaries from the Aetolians, Acarnanians, and Athamanians. These Greeks fought in the Macedonian Phalanx battle formation. He had cavalry squadrons from Thessaly. The Greeks of the city of Tarentum, in southern Italy, were allies of Pyrrhus. Pyrrhus also had allies from three Italic peoples in southern Italy: the Bruttii, Lucani, and Samnites. Among the allies of Rome mentioned by Dionysius of Halicarnassus there were the Frentani, Marrucini, Paeligni, Dauni, and Umbrians. There might also have been contingents from the Marsi and Vestini, who were also allies of Rome.\nSince Pyrrhus' elephants had caused much terror and destruction in the Battle of Heraclea, the Romans devised special wagons against them. They were four-wheeled and had poles mounted transversely on upright beams. They could be swung in any direction. Some had iron tridents, spikes, or scythes, and some had \"cranes that hurled down heavy grappling irons\". Many poles protruded in front of the wagons and had fire-bearing grapnels wrapped in cloth daubed with pitch. The wagons carried bowmen, hurlers of stones, and slingers who threw iron caltrops and men who threw grapnels on fire against the trunks and faces of the elephants. The Romans had 300 such wagons.\nPyrrhus lined up the Macedonian phalanx of the Epirots and Ambracians, mercenaries from Tarentum with white shields, and the Bruttii and Lucani allies on the right wing. The Thesprotians and Chaonians were deployed in the centre next to the Aetolian, Acarnanian, and Athamanian mercenaries. The Samnites formed the left wing. On the right wing of the cavalry were the Samnite, Thessalian, and Bruttii squadrons and Tarentine mercenaries. On the left wing were the Ambracian, Lucanian, and Tarentine squadrons and Acarnanian, Aetolian, Macedonian, and Athamanian mercenaries. Pyrrhus divided the light infantry and the elephants into two groups and placed them behind the wings, on a slightly elevated position. Pyrrhus had an agema of 2,000 picked cavalrymen behind the battle line to help hard-pressed troops. The Romans had their first and third legions on the right wing. The first faced the Epirot and Ambracian phalanx and the Tarentine mercenaries. The third faced the Tarentine phalanx with white shields and the Bruttii and Lucani. The fourth legion formed the centre. The second legion was on the right wing. The Latins, Volsci, and Campanians (who were part of the Roman Republic) and Rome's allies were divided into four legions which were mingled with the Roman legions to strengthen all the lines. The light infantry and wagons which were to be deployed against the elephants were outside the line. Both the Roman and the allied cavalry were on the wings.\nBattle\nIn Plutarch's account, the battle was fought over two days. In the accounts of Cassius Dio and Dionysius of Halicarnassus it lasted one day. According to Plutarch the battle was won by Pyrrhus; according to Cassius Dio, it was won by the Romans. Dionysius of Halicarnassus did not state the outcome of the battle.\nPlutarch's account\nBy Plutarch's account the battle lasted two days. After resting his army, Pyrrhus marched to Asculum to confront the Romans. However, he was forced into an area where, due to the wooded banks of the river, he could not deploy the cavalry or use his elephants against the Romans. The fighting was fierce and many were killed or wounded, before the battle was interrupted by nightfall. During the night Pyrrhus sent a detachment to occupy the unfavourable areas of the field so that he could fight and deploy his elephants on level ground. He put many archers and slingers between the elephants and charged in compact formation. The Romans could not use sidelong shifts or make counter-movements as on the previous day. They had to fight on level ground in a frontal attack. They fought fiercely with their swords against the Macedonian pikes, in an attempt to repulse the enemy troops before the elephants could charge. Despite their resistance, they were eventually driven back by the elephants and fled to their camp.\nCassius Dio's account\nCassius Dio wrote that the two sides avoided each other for several days. There were rumours that Publius Decius Mus (one of the two consuls for 279 BC) was getting ready to devote himself like his father and grandfather. In a devotio a Roman commander sacrificed his life by launching himself into the enemy ranks as a vow to the gods in exchange for victory when the Roman troops were overwhelmed. This galvanised the Roman soldiers. The rumour alarmed the Italic followers of Pyrrhus, who believed that Decius' death would ruin them. Pyrrhus endeavoured to reassure them and ordered them to seize alive anyone who wore the garments the Decii family used when devoting themselves. He sent a man to tell Publius Decius that he would not succeed in his intent and after being taken alive he would die miserably. The Roman consuls replied that there was no need to resort to a devotio because the Romans would defeat him without it.\nIn Cassius Dio's version of the battle, the river between the two camps was not easy to ford. The Romans asked whether Pyrrhus would choose to cross it unmolested or whether he would allow them to do so unharmed so that the two forces would fight intact, thus giving an accurate test of their valour. Pyrrhus, confident of the strength of his elephants, allowed the Romans to cross the river. However, the Romans deployed their wagons against the elephants, shooting fire and missiles. The Romans gradually forced the Epirotes back until Pyrrhus moved the elephants to the other end of the line, away from the wagons. He used them to charge the Roman cavalry, which was routed by the elephants before they even got close. Meanwhile, some Dauni had set out against the camp of the Epirotes. This won the battle for the Romans because when Pyrrhus sent some of his men against them, the rest suspected that the camp had fallen and that their companions had fled. Because of this they gave way. Many fell and Pyrrhus and many of his officers were wounded. Others died later because of a lack of food and medical supplies. Pyrrhus withdrew to Tarentum before the Romans became aware of this. The Romans did not pursue him because many of their men were wounded. They went into winter quarters in Apulia, while Pyrrhus sent for soldiers and money from home and went on with his other preparations.\nDionysius of Halicarnassus' account\nIn the account of Dionysius of Halicarnassus, the Roman cavalry engaged in hand-to-hand, stationary combat, and the Greek cavalry engaged in flanking manoeuvres. When the Romans were pursued by the Greeks, they turned their horses around and fought the infantry. When the battle was even, the Greeks swerved to the right, counter-marched past one another and then turned to charge the enemy. The right wing of the infantry of each army was the stronger one. The Macedonian phalanx repulsed the first Roman legion and the Latins who fought alongside it. Pyrrhus ordered the elephants to charge the part of the Roman line which was in difficulty. The Romans sent the wagons against them, with some initial success. Then the men leading the elephants stopped driving them forward and threw down spears. Lightly-armed Greek troops attacked the wagons and those who manned them fled into the nearest infantry line, throwing it into confusion. The Bruttii and Lucanians in the middle of the formation of Pyrrhus fled when they were repulsed by the Roman fourth legion. When the line was broken through, the Tarentines also fled. Pyrrhus sent part of the agema and part of the cavalry on the right wing to help this weakened line.\nSome of the Daunians from Arpi (4000 infantry and 4000 cavalry), who had been sent to help, got close to Pyrrhus’ camp by chance while travelling on a road that led to the enemy's rear. They decided to attack the camp, and after having heard from some prisoners that it had but a few guards, attacked on all sides. Pyrrhus sent the elephants and the bravest cavalrymen to the camp, but it was taken and set on fire before they arrived. The Daunians fled to a hill which could not be ascended by horses or elephants. The enemy detachment then attacked the third and fourth legions, which had routed their opponents. After fleeing up a steep and wooded hill, they lined up in battle order. Although the horses and elephants of Pyrrhus could not pursue them, many were killed or wounded by bowmen and slingers. Pyrrhus sent forward the Athamanians, the Acarnanians and some of the Samnites. The Romans sent forward some cavalry squadrons, and the two forces clashed with many casualties at the bottom of the hill. Both sides recalled their troops just before sunset. The Romans crossed the river to reach their camp. Pyrrhus, whose forces had lost the tents, pack-animals and baggage which were kept in the camp, encamped on a hill and spent the night outdoors and without food. Many of the wounded died as a result of the conditions.\nAftermath\nPlutarch noted that according to Hieronymus of Cardia the Romans lost 6,000 men and that, according to Pyrrhus' own commentaries, he lost 3,505 men. He wrote that Dionysius of Halicarnassus made \"no mention of two battles at Asculum, nor of an admitted defeat of the Romans\" and that (in a passage which is now lost) Dionysius wrote that over 15,000 men on both sides fell in the battle. Plutarch also wrote that Pyrrhus said to someone who was congratulating him: \"If we are victorious in one more battle with the Romans, we shall be utterly ruined.\" This was because he lost a great part of the forces he had brought to Italy and most of his commanders. He could not call up more men from home and his allies in Italy were becoming indifferent. The Romans, instead, could quickly replenish their forces \"as if from a fountain gushing forth indoors\", and did not lose courage or determination in defeat.\nRealising that he could not win a war against the Romans, Pyrrhus accepted a request from the Greek city-states of eastern and southern Sicily to help them against the Carthaginians in western Sicily. He went to Sicily and campaigned there for three years. His allies in southern Italy were aggrieved because he abandoned them. He took over all the Carthaginian domains in Sicily except for the stronghold of Lilybaeum. His siege of this city was unsuccessful. After this he wanted to build a large fleet to invade Carthage's home territory in Africa. He needed to man and equip these ships and to do this he treated the Greek city-states despotically. These cities turned against him. He was forced to return to southern Italy. He fought the Romans at the Battle of Beneventum (275 BC), where he was defeated. He then left Italy and returned to Epirus.\nNotes\nReferences\nPrimary sources\n*\n*\n*\n*\nSecondary sources\n*\n*\n*"
    }
  ]
}