{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Trent's Reach\n\n|date=January 23–25, 1865\n|place=James River,Henrico County, Virginia\n|result= United States victory\n|combatant1=  United States\n|combatant2=  Confederate States\n|commander1= William A. Parker Henry H. Pierce Ulysses S. Grant\n|commander2= John K. Mitchell Charles W. Read\n|strength1=Land:~30 artillery pieces1 fort4 shore batteriesRiver:1 monitor2 gunboats1 torpedo boat1 torpedo launch\n|strength2=Land:~16 artillery pieces2 shore batteriesRiver:3 ironclads5 gunboats3 torpedo boats\n|casualties1=3 killed~40 wounded1 monitor damaged1 gunboat damaged1 fort damaged\n|casualties2=4–10 killed15 wounded1 gunboat sunk1 torpedo boat sunk3 ironclads damaged3 gunboats damaged1 torpedo boat damaged\n}}\nThe '''Battle of Trent's Reach' was one of the final major naval battles of the American Civil War.  Beginning on January 23, 1865, a powerful flotilla of Confederate warships bombarded Fort Brady along the James River and engaged four Union Navy ships with the intention of breaking through the blockade to attack City Point, the base of General Ulysses S. Grant who was besieging Petersburg, Virginia. After two days of fighting, the rebels withdrew back up the river without completing their objectives.\nBackground\nConfederate forces were under the direction of Commodore John K. Mitchell who commanded the James River Squadron in his flagship, the ironclad CSS Fredericksburg. Weighing 700 tons, the Fredericksburg was a formidable opponent armed with one 11-inch smoothbore cannon and three smaller rifled guns. The ironclad rams CSS Richmond and CSS Virginia II also participated in the attack. Richmond weighed an estimated 800 tons and carried six guns. The 650 ton Virginia II was armed with four guns and had a crew of about 150 officers and men, the same complement as the other two ironclads. Confederate forces deployed eight other vessels, three of which were lashed to the sides of the ironclads and the torpedo boat CSS Scorpion was towed down river by the gunboat Drewry. The other vessels were the gunboats Nansemond, Hampton, Beaufort and Torpedo, each armed with one or two guns and displacing 100 to 200 tons. The torpedo boats CSS Wasp and CSS Hornet'' were the last two ships in the fleet. All three of the torpedo boats carried only one spar torpedo and they were not used in the engagement at Trent's Reach. Commodore Mitchell's orders were to take his squadron down the James River to attack a supply base at City Point which belonged to General Grant's Union Army that had recently taken over the area as part of the Petersburg Campaign. However, to get to the base, the rebels had to fight their way past multiple obstacles in and along the river, including warships, a naval mine field and net, Fort Brady, and four shore batteries.\nNaval mines, then known as torpedoes, were widely used in the war due to their effectiveness, so to keep the rebels from sailing down the James River, the federals established a line of them from bank to bank, behind it was a net in case any of the explosives came free. The Union fortifications were under the command of Colonel Henry H. Pierce of the 1st Connecticut Heavy Artillery Regiment, mounting over thirty guns altogether. The naval forces were under Captain William A. Parker of the James River Flotilla, who led his force from the 2,592 ton ironclad monitor  which carried two 15-inch smoothbore Dahlgren guns and two 150-pounder Parrott rifles. At the time Onondaga was the only Union monitor on the river though she was accompanied by the side-wheel gunboats  and .  USS Massasoit was a large ship, weighing 974 tons, so she was fitted out for ten guns of different sizes, including two 100-pounders. Hunchback weighed 512 tons and had an armament of four guns, one a 100-pounder. The small torpedo boat  was involved in the battle as well, though because she was an experimental craft, equipped with a spar, the vessel did not participate in any actual fighting.\nOpposing forces\nUnited States Navy\n*USS Onondaga, monitor, 2,592 tons, 4 guns, flagship\n*USS Massasoit, gunboat, 974 tons, 10 guns\n*USS Hunchback, gunboat, 512 tons, 4 guns\n*USS Spuyten Duyvil, torpedo boat, 207 tons, 1 spar torpedo\n*Torpedo Launch No. 4, torpedo launch, 1 spar torpedo\nConfederate States Navy\n*CSS Fredericksburg, ironclad, 700 tons, 4 guns, flagship\n*CSS Richmond, ironclad, 850 tons, 6 guns\n*CSS Virginia II, ironclad, 600 tons, 4 guns\n*CSS Hampton, gunboat, 166 tons, 2 guns\n*CSS Drewry, gunboat, 166 tons, 2 guns\n*CSS Nansemond, gunboat, 166 tons, 2 guns\n*CSS Beaufort, gunboat, 85 tons, 1 gun\n*CSS Torpedo, gunboat\n*CSS Scorpion, torpedo boat, 1 spar torpedo\n*CSS Wasp, torpedo boat, 1 spar torpedo\n*CSS Hornet, torpedo boat, 1 spar torpedo\nBattle\nThe Confederate Navy's attack began on the night of January 23 of 1865. Commodore Mitchell lifted anchor at Chaffin's Bluff just after sunset, his first task would be to sneak by the Union battery on Signal Hill and Fort Brady in the darkness. Colonel Pierce reported that at 8:00 pm one of his lookouts on the fort's parapet spotted the three rebel ironclads and a few of the other vessels moving down the river so immediately Pierce ordered his gunners to begin firing. The first shot of the battle was from a \"heavy gun\" mounted in the fort, it was followed by additional rounds from the battery. Due to the \"mal-construction\" of Fort Brady, as Pierce said, the artillery could not be fired down river so not long after the rebels were spotted they were out of range of the Union guns and thus slipped by apparently without damage or casualties. Some twenty-five rounds were discharged by the federal gunners in this first action. After getting past the fort, Commodore Mitchell continued on for the naval mine field at Trent's Reach. Meanwhile, two Confederate batteries, consisting of at least sixteen cannon, opened up on Pierce's position and continued to bombard it throughout the night. The Union garrison returned fire and in the exchange one 100-pounder in the fort was destroyed though Colonel Pierce reported having dislodged two rebel pieces before receiving orders to cease the engagement.\nThe Confederates arrived at Trent's Reach at 10:30 pm, CSS Richmond and Virginia II were anchored a half a mile from the obstruction to provide covering fire while the Fredericksburg and a few of the smaller vessels cleared the way. Among the mine field were the hulks of several sunken vessels, in between them there was placed a spar torpedo, preventing any ship from passing through. The crew of the Fredericksburg went to work on removing the spar while the three torpedo boats under Lieutenant Charles \"Savvy\" Read, made a reconnaissance of the channel. All of this was done under \"a perfect rain of missiles\" from three Union shore batteries and sharpshooters who were in control of the area. Clearing the obstruction lasted into the next morning. By this time the few federal warships in the area had been dispatched to defend Trent's Reach, USS Ononadaga was the first to make it to the battle area but Captain Parker decided to withdraw back down river to a pontoon bridge at Aiken's Landing where he would have more maneuverability in a fight. Parker was later criticized for not engaging the rebels as soon as possible and he defended himself by stating that he thought his \"chances of capturing the whole fleet would be increased by allowing them [the rebels] to come down river to the bridge.\"\nThe action at Trent's Reach then ceased until the next day when General Grant was informed of the situation. The general, who was not happy about Captain Parker's decision to withdraw, ordered the Onondaga to form up with the gunboats Massasoit and Hunchback for an attack on the rebel fleet. The Spuyten Duyvil had arrived in the area on the night before, under orders from Rear Admiral David Dixon Porter to sink any of the ironclads that attempt to sail on to City Point in the darkness. Parker refused to attack though and after Grant complained to  Secretary of the Navy Gideon Welles, the captain was relieved of duty. President Abraham Lincoln suggested that Admiral David G. Farragut take command of the operations. Admiral Farragut, who led federal forces in the New Orleans Campaign, was elsewhere at the time so while he made it to the James, Commodore William Radford was placed in charge temporarily. However, Radford was on board the USS New Ironsides at Norfolk so the defense of the James fell onto the second officer of Onondaga, Commander Edward T. Nichols, who Grant had expressed confidence in. But when it came time for battle, Captain Parker re-assumed authority and led the federal attack on January 24.\nFortunately for the Union, four of the rebel ships grounded when the tide lowered that morning. At 1:45 am, Commodore Mitchell and his men finished clearing the obstructions so he steamed the Fredericksburg back over to where the remaining ships were anchored. It was then that Mitchell discovered the Virginia II, the Richmond, the Drewry, and the Scorpion were all resting on the river bottom and could not be freed until high tide which would come at about 11:00 am. The situation was complicated further at day break when the Union batteries started to become more accurate. The Richmond was hit repeatedly by artillery rounds but her armor protected her from serious damage. It was different for the unarmored gunboats, because these ships were mainly wooden vessels, they were \"torn to pieces\" by enemy fire. Drewry was so heavily damaged that her crew abandoned ship just in time because fifteen minutes later, at 6:55 am, a round from one of the batteries ignited the vessel's powder magazine. Instantly the gunboat exploded violently and sank. The large shock wave also heavily damaged the nearby Scorpion which had to be abandoned as well. Two men were killed on the torpedo boat and it sank along with the Drewry. To make matters worse for Commodore Mitchell, at 10:30 am lookouts spotted the Onondaga, the two gunboats, and the Spuyten Duyvil heading for them.\nAt 10:45 am, the Onondaga opened up on the grounded ironclads at a distance of around a half of a mile but the rebels could not return the fire because of the positions in which their ships were stuck, Mitchell wrote; \"During the whole time while aground, neither the Richmond nor the Virginia [II] could get a gun to bear upon the enemy.\" By 11:00 am the tide had been lifting for hours and just when it seemed that the Confederates were helpless to resist, their ironclads began to float again and their guns were brought to bear. Onondaga fired around seven rounds at Virginia II and when she was refloated a single shot was returned that, according to Mitchell, was \"observed to take effect\" upon the monitor. The naval duel did not last long compared to the other actions and it ended as the Confederates withdrew up river a short distance. The Union ships did the same and they pulled off heading down stream but the batteries kept firing all day and night. At 9:00 pm Commodore Mitchell ordered his men to make the final cruise to City Point but it was found that the Virginia II was unmanageable. She had been struck by cannon fire seventy times already and it caused steam to leak from the ironclad's deck which impaired the pilots visibility. The Drewry and the Scorpion were lost and one other torpedo boat was disabled by the federals.\nUnion troops had also erected \"Drummonds lights\" that illuminated the area around the mine field, allowing the batteries to fire nearly as accurately at night as they had in the daytime. It finally became apparent to Mitchell that the mission was lost so on the next morning, at 2:45 am, the rebel fleet was turned around and went back up the James. The battle at Trent's Reach was over but in order for the rebels to get back to friendly waters they had to pass Fort Brady and the Signal Hill battery. When the time came another exchange of artillery ensued but this time the rebels stayed a while to try to silence the Union gunners. Colonel Pierce expected the ironclads to return so while they were engaging at Trent's Reach, the garrison of Fort Brady and the surrounding batteries focused on improving the defenses of their positions. Pierce placed pickets down the river and at 3:00 am one of them returned and told the colonel that the rebels were coming back. When the fighting began again it was described as being very intense but at no time were the Confederates able to silence the Union guns and they eventually broke off the action. Between 1,000 and 1,500 rounds were fired by Mitchell's ships in this final battle.\nIn cooperation with the naval effort, Confederate troops made \"two heavy attacks\" on the Union Army's picket line at Bermuda Hundred on January 23 and 24. \"Both of these attacks were handsomely repulsed,\" a member of the 10th New York Heavy Artillery reported, \"though pressed with great vigor.\" The 10th New York suffered one man killed.\nAftermath\nThree Union troops were known to have been killed in the battle and more than forty were slightly wounded by splinters. The Onondaga was only slightly damaged in the action and none of her crew are known to have been harmed. According to official records the rebels lost four killed on the Drewry and the Scorpion plus fifteen wounded. However, some sources cite the rebels as having lost at least six men on the Virginia II alone. Ultimately the Confederate force failed in its main objective of attacking City Point and they had to return to Chaffin's Bluff with nothing to show for the advance other than a mess for ships, most of which sustained some type of battle damage. Commodore Mitchell was relieved of command and replaced by Admiral Raphael Semmes, who commanded CSS Alabama in her battle with USS Kearsarge off Cherbourg, France. Exactly two months after the battle, the Petersburg Campaign ended with General Robert E. Lee's final decision to evacuate the city. When the Southern capital of Richmond fell on April 3, the James River Squadron was scuttled to prevent their falling into enemy hands. The battle of Trent's Reach was the last important naval engagement of the Main Eastern Theater.\nReferences"
    }
  ]
}