{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Furuholm\n\nSweden\n| combatant2           =  Denmark–Norway\n| commander1           =  G. H. Nordberg\n| commander2           =  Lorentz Fisker\n| units1               =  Swedish Navy\n| units2               =  Dano-Norwegian Navy\n| strength1            = 5 gun sloops\n----\n249 men27 guns\n| strength2            = 16 gun sloops11 gun yawls\n----\n750–1,000 men77 guns\n| casualties1          = 4 killed6–7 severely wounded\n| casualties2          = 10 killed4 severely wounded0 or 3 boats sunk\n}}\nThe Battle of Furuholm was a naval battle that took place at Furuholm outside Strömstad on 28 April 1808 as part of the Dano-Swedish War of 1808–1809.\nBackground\nAt the outbreak of the war between Denmark-Norway and Sweden on 14 March 1808, Commander Lorents Fisker was appointed head of the naval defence of Norway. From the naval base at Gravningsundet in Hvaler, Fisker's task was to act as a hedge against Swedish movements by sea, at the same time as he were to support a possible offensive into Sweden.\nThe short distances between Hvaler and the northern coast of Bohuslän quickly led to clashes between the naval forces, and since the Swedish naval officers had been ordered to seek battle against the Danish-Norwegian fleet the skirmishes became quite frequent.\nRaids around Strömstad\nSeveral raids were also conducted by the Norwegians from their base at Gravningsundet, and during a reconnaissance mission outside Strømstad on the morning of 20 April, Fisker had sent a troop of sailors and infantry towards Seläters pier south of Svinesund under cover of darkness. This troop managed to capture 9 Swedish soldiers before they returned to the ships and went on to Strømstad, and after a demonstration of power in the sound between Furuholm and Killingholm, just a mile from the harbor, returned to Hvaler.\nOn the morning of April 23, a group of 100 Norwegian soldiers under the command of First Lieutenant Jochum Nicolay Müller, also managed to get ashore south of Sponvigen. From there they marched inland and captured 11 Swedish soldiers and 6 corporals, and confiscated some military equipment, before heading back to the ships.\nBattle\nOn 27 April, Fisker received reports that a small Swedish fleet had put into port at Strömstad, and decided to head out with 11 small gun yawls and 16 large gun sloops, hoping to surprise and destroy that part of the Swedish fleet.\nCaptain G.H. Nordberg had arrived at Strömstad on 22 April with five gun sloops, far fewer vessels than on the Norwegian side, but he had sent out vessels that guarded the coast and got a message from them that the Norwegian vessels had left Hvaler. This gave him time to prepare for a possible attack against Strömstad, so he ordered the creation of a land battery at Furuholm, which guarded the (approximately) 200 meters wide entrance to the harbour.\nLorents Fisker began his attack on Strömstad on 28 April, but was met by Captain Nordberg and his five large gun sloops who pulled up to the middle of the entrance at Furuholm. The Swedes had chosen a good place to defend the entrance, and along with the land battery, they held out against the Danish-Norwegian fleet which in the narrow waters failed to exploit their numerical superiority.\nAfter an hour and a half of fighting the Norwegians had to withdraw with their damaged gun sloops and a loss of 10 killed (of which three self-inflicted), and 4 severely wounded and an unknown number of lightly wounded. According to Swedish reports, two Norwegian boats had also sunk and one exploded. The Swedish loss was 4 killed and 20 wounded, of which only 6 or 7 severely wounded and the rest lightly wounded (However, it was alleged by the Norwegian author Constantius Flood that the Swedish losses may have been as high as between 30–40 dead and wounded).\nAftermath\nAfter the battle, Nordberg's fleet was reinforced with a two gun sloops and two smaller gun yawls, and on 2 May the fleet was enlarged with eight new gun sloops. These should be used as support during the planned offensive of General Eberhard von Vegesack against Frederikshald following the Swedish left wing's invasion of Norway in early May.\nParts of the Swedish fleet would nevertheless suffer defeat at the battle of Grævlingesund southeast of Hvaler in May.\nReferences\nBibliography\n*\n*Ulf Sundberg (1998). Svenska krig 1521-1814 p.&nbsp;388\n*"
    }
  ]
}