{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Balikpapan (1945)\n\n| combatant2  =\n| commander1  =  Edward Milford Kenneth Eather\n| commander2  =  Michiaki Kamada\n| strength1   = 33,000\n| strength2   = 3,100 – 3,900 soldiers  1,100 – 4,500 armed labourers\n| casualties1 = 229 killed 634 wounded\n| casualties2 = 2,032  killed 63 captured\n| casualties3 =\n| campaignbox =\n}}\nThe Battle of Balikpapan was the concluding stage of Operation Oboe, the campaign to liberate Japanese-held British and Dutch Borneo. The landings took place on 1 July 1945. The Australian 7th Division, composed of the 18th, 21st and 25th Infantry Brigades, with a small number of Netherlands East Indies KNIL troops, made an amphibious landing, codenamed Operation Oboe Two, a few miles north of Balikpapan. The Allied invasion fleet consisted of around 100 ships. The landing had been preceded by heavy bombing and shelling by Australian and US air and naval forces. The Allied force totalled 33,000 personnel and was commanded by Major General Edward Milford, while the Japanese force, commanded by Rear Admiral Michiaki Kamada, numbered between 8,400 and 10,000, of which between 3,100 and 3,900 were combatants. After the initial landing, the Allies secured the town and its port, and then advanced along the coast and into the hinterland, capturing the two Japanese airfields. Major combat operations concluded around 21 July, but were followed by mopping-up operations, which lasted until the end of the war in mid-August. Australian troops remained in the area until early 1946.\nBackground\nGeography\nSituated  northwest of Darwin, on the east coast of Borneo, Balikpapan's importance lay in its oil production facilities and port facilities. Prior to the war, the area produced 1.8 million tons of oil products a year. The town's port, sitting inside Balikpapan Bay, consisted of seven piers and a large number of warehouses. The port area was serviced by well-developed roads. At its mouth, the bay was  wide, and was suitable for medium-sized ships. To the south of the port, an oil refinery with 40 storage tanks and a cracking plant lay along a steep ridge, separating the port from the European suburb of Klandasan, which looked out on the open sea from the cape that sat at the eastern part of the bay. Two roads fanned out from Balikpapan town, one running north-east to Samarinda – dubbed the \"Milford Highway\" by the Australians – while the other – the \"Vasey Highway\" – stretched south along the coast towards Sambodja.  The oil refinery in Balikpapan was supplied with oil from fields around Sambodja and Sangasanga to the north-east.\nTo the east of the cape, the narrow coastal strip was serviced by road that extended east from Klandasan to Stalkoedo, Sepinggang, Batakan Besar, Manggar, and Sambodja crossing many rivers and streams. This road sat on a thick sandy strip of ground, just inland from the beach. The ground around the coast was largely flat, although there were some low hills which rose steeply further inland up to heights of ; while the area around the town and coast was largely open, the interior was heavily covered with thick rainforest. The dense vegetation limited cross country movement, although the rivers and streams were partially navigable. Two airfields had been established to the east of Balikpapan around Sepinggang and Manggar. Manggar was the larger of the two, consisting of two runways that had been graded out of coral. At the time of the Allied landings, the airfield had been badly damaged by aerial bombardment, while the second, smaller airfield, at Sepinggang had also been rendered unserviceable.\nBalikpapan is located one degree south of the equator and has a tropical rainforest climate. The maximum temperature for most days in south-east Borneo in 1945 was about , and relative humidity was consistently high ranging from 74 to 93 percent. Monthly rainfall was fairly constant, averaging  in July. Allied intelligence estimates assessed that the July to September period represented that best period for military operations. In terms of cloud cover, July was generally clear and visibility was assessed as generally good. Wind speeds averaged  with south-south-westerly winds being the most prevalent during the May to November period.\nStrategic situation\nPrior to World War II, Balikpapan was under Dutch control, and formed part of the Netherlands East Indies. The Japanese occupied British Borneo and the Netherlands East Indies in late 1941 and early 1942. Balikpapan itself was seized on 25 January 1942. British and Dutch forces attempted to resist, but were quickly overwhelmed, but not before destroying or damaging the oil facilities and other important infrastructure. The destruction of these facilities led to harsh reprisals against civilians, particularly at Balikpapan, which was occupied in late January 1942, after which the entire European population – around 80 to 100 people – was executed. The facilities were subsequently repaired and by 1943–1944, Borneo had become one of Japan's main sources of fuel, crude and heavy oil; in 1943, Balikpapan provided  of fuel oil to the Japanese war effort.\nThroughout 1943 and 1944 the Allies attempted to reduce Japanese oil production at Balikpapan with air power. The first strategic bombing raids began in October 1943, undertaken by US Liberator bombers, flying 17 hours from bases around Darwin. Further raids took place in December 1943 and January 1944. In the early months of 1944, Royal Australian Air Force Catalina flying boats carried out a series of highly successful mining operations, which reduced the output of Balikpapan's facilities by an estimated 40 percent. In late September and early October 1944, the US Thirteenth and Fifth Air Forces began long range bombing raids from Noemfoor. The first two raids suffered heavy losses due to the lack of escort fighters and inflicted minimal damage; however, after a brief pause and a change of tactics by the US airmen, the final three raids resulted in heavy damage to the refineries and the destruction of most of the Japanese aircraft defending Balikpapan. This, coupled with Allied operations along Japanese sea lanes of communication, effectively cut off Japan from Balikpapan's oil supply line. The Japanese decided not to repair the damaged facilities, and those that remained were used for local supply only; indeed after October 1944, no more Japanese oil tankers were sent to Balikpapan; nevertheless, this simply diverted Japanese efforts to oil fields in Sumatra instead.\nThe Japanese advance in the Pacific was halted in early 1943, by Australian troops in New Guinea and US troops in Guadalcanal, after which the Allies went on the offensive, advancing through New Guinea and the Solomon Islands towards the Philippines. Throughout 1944, the Allies began planning to retake Borneo. The General Headquarters of General Douglas MacArthur's South West Pacific Area was responsible for planning the operation, but due to the commitment of US forces to the recapture of the Philippines, the task of recapturing Borneo was allocated primarily to Australian ground forces. Allied operations in Borneo consisted of landings at Tarakan, Labuan, and Balikpapan. Originally, MacArthur had intended to use Borneo as a stepping-stone to re-taking Java, but this operation was later cancelled and responsibility for the Netherlands East Indies transferred to the British-led South East Asia Command. In the planning phase the commander of the Australian Military Forces, General Thomas Blamey recommended against the landing at Balikpapan, believing that it would serve no strategic purpose. After much consideration, the Australian Government agreed to provide forces for this operation. The US Joint Chiefs of Staff also had concerns about the strategic necessity of the operation, but according to historian Garth Pratten, MacArthur manipulated both the Australian Government and the Joint Chiefs into approving the capture of Balikpapan.  The stated purpose of the operation was, according to historian Chris Coulthard-Clark, \"secure the port and oilfields in the area, and to establish a base from which to launch\" future operations. Additionally, Netherlands East Indies governmental control would be re-established.\nOpposing forces\nJapanese preparations to defend against Allied landings in Borneo commenced in 1944, with the garrison forces being reorganised and an operational command being set up under the Thirty-Seventh Army. In early 1945, the Thirty-Seventh Army began reorientating its troops towards Borneo's west coast. The number of Japanese defending the area around Balikpapan in 1945 was around 8,400 – 10,000. Of these, between 3,100 and 3,900 were combatants. About 1,500 infantry and field artillery soldiers were in the Balikpapan–Manggar area, along with 1,500 anti-aircraft gunners. Base troops made up the rest of the number, along with between 1,100 and 4,500 armed Japanese, Formosan and Indonesian civilian labourers. Another 1,500 troops were  away at Samarinda. The main Japanese units were Rear Admiral Michiaki Kamada's 22nd Naval Base Force and elements of the 71st Independent Mixed Brigade. The 22nd Naval Base Force's I Battalion was located around Klandasan and the Sumber River while the II Battalion was positioned around Batuchampar. Two other companies were around Penadjam. The Imperial Japanese Army's 454th Battalion had also been deployed to the Manggar area, having been transferred from Tarakan in March 1945. The Japanese holding Balikpapan town consisted of the 2nd Garrison Force – armed labourers, base troops, artillerymen along with a small number of marines – and elements of the 454th Independent Infantry Battalion. These troops possessed varying levels of training and their morale had been affected by weeks of preliminary bombardment. They were well equipped with heavy calibre weapons, but lacked lighter weapons. As a result, they were largely static in posture.\nDue to the Allied interdiction of sea lanes of communication throughout the Pacific, Japanese troops on Borneo had found themselves increasingly isolated and by the end of 1944 supply shipments essentially ended. Food and supplies dwindled and units were forced to commence subsistence operations as the majority of troops began to suffer from malnutrition. Sanitation was also poor and due to limited medical supplies many Japanese troops became non-battle casualties. Nevertheless, the area was well supported with artillery, consisting of 18 Japanese coastal guns, concentrated around the ridges overlooking Balikpapan, along with 26 heavy guns and 78 medium and light anti-aircraft guns. These were orientated to defend the airfield, port and Balikpapan town itself. The defences in the area included a  wide anti-tank ditch along the coast between Stalkoedo and Sepinggang, augmented by another around Klandasan. The beaches were dotted with Dutch-built concrete pillboxes while the Japanese had dug a complex trench system on the ridges overlooking the town. The seaward approach to Klandasan was defended by an underwater obstacle consisting of poles and barbed wire, which ran between Klandasan and Manggar. This was augmented by a large number of naval mines around the coast.\nThe operation was designated \"Operation Oboe Two\" by the Allies, who assigned 33,000 personnel. The main ground forces, amounting to 21,000 personnel, were drawn from Major General Edward Milford's 7th Division, a veteran Second Australian Imperial Force formation consisting of three infantry brigades – the 18th, 21st and 25th – along with supporting artillery, armour, engineer and logistics support units. The 7th Division had seen action earlier in the war in the Middle East and in New Guinea, but had been resting on the Atherton Tablelands in Queensland when they were assigned to the operation. The division's formation and unit-level command teams were all very experienced, but due to the high turn over of personnel that had occurred in the Australian Army in 1943–1944, many of its more junior personnel had not been in action before. Tank support was provided by the 1st Armoured Regiment, equipped with Matilda tanks. Naval support was drawn from the US 7th Fleet under Admiral Thomas Kinkaid, while air support came from the Australian First Tactical Air Force, and the US Thirteenth Air Force. Three US Navy escort carriers were also assigned to provide fighter support as the airstrip at Tarakan had not been made operational in time, and weather conditions hampered the provision of fighter support from the Philippines. A small number of Dutch KNIL troops, were also assigned to the operation, amounting to a company from the 1st Infantry Battalion (KNIL).\nPrelude\nPlanning teams from all branches of the Australian and US armed services gathered at Morotai Island to begin planning the operation, around 26 April 1945. A shortage of shipping hampered the preliminary movement of troops and a lack of co-ordination and scheduling meant that tactical level planning and battle preparation was carried out in a hasty fashion. The first combat troops began embarking from Townsville in early May; however, planners from the combat formations assigned to the operation did not arrive on Morotai on 13 June. In determining the location of the landing, the naval planners advocated for a landing around Manggar, as the water was deeper in this area; however, the beach was deemed unsuitable and a landing at Manggar would require the ground troops to advance  through difficult terrain to reach their objective around Balikpapan. Further west, around Stalkoedo and Klandasan, the beach was more suitable to a large-scale landing operation, but this area was where the majority of the Japanese defences were located. Additionally, the water in this area was not as deep, and as a result the supporting cruisers would have to stand further out to sea, which would reduce the accuracy of their guns when firing on shore targets. The approach was also covered by minefields and other obstacles. Ultimately, the Australian commander, Milford, chose to land at three beaches across a  front in the area occupied by the main Japanese forces, reasoning that the shorter approach march outweighed the risks, which would be reduced by a comprehensive pre-landing aerial and naval bombardment.\nAir support was provided by Australian and US aircraft based out of the southern Philippines, due to the unserviceability of the airfield on Tarakan. Aerial operations began 20 days before the landing, while minesweepers began clearing safe lanes and anchorages 15 days out. These operations were undertaken inside the range of Japanese coastal guns; to protect the minesweepers, naval gunfire and aerial bombardment was used to suppress and neutralise the Japanese guns. Japanese torpedo boats attacked the minesweepers on 24 June, albeit without success. Three minesweepers were lost during the clearance operations. While the assigned troops were moving from Queensland to the mounting base at Morotai, the Allies began enacting a deception plan to draw Japanese attention away from the intended landing area. This included spreading disinformation amongst the local population, as well as undertaking preparatory operations in locations away from the intended area. Advance force operations included small parties of special forces landing to carry out reconnaissance operations while minesweeping and obstacle clearance operations began 16 days before the assault. The pre-invasion bombardment expended over  of bombs, 7,361 rockets, 38,052 shells and 114,000 small arms rounds; most of the Japanese field guns were destroyed and the shore defences severely depleted. The focus of the Allied air campaign from late May was Japanese airfields throughout the Netherlands East Indies, as well as anti-aircraft facilities; attacks were also made on oil facilities around Samarinda by RAAF aircraft in contravention of an initial order not to target these facilities.\nBattle\nThe Allied fleet, consisting of over 100 mainly US and Australian ships began forming around Morotai Island on 17 June. After landing rehearsals were conducted, the fleet departed the area in the afternoon of 26 June, traversing the Strait of Macassar. On 29 June, the faster naval ships that were to carry out the pre-landing bombardment detached themselves from the convoy. Meanwhile, US underwater demolition teams worked create gaps in the off shore obstacles; this work was carried out under heavy fire. Several of the supporting Allied vessels were damaged and the operations were concluded without completely clearing the obstacles from the central landing beach, which was designated Yellow Beach. In total about  of the landing beach was cleared, while  of neighbouring beaches were also cleared as part of deception operations. Early on 1 July, the convoy reached the assembly area about  south-east of Klandasan, after which a heavy naval and aerial bombardment concentrated on the beaches around Klandasan; a total of 63 Liberator bombers as well as five cruisers and 14 destroyers were committed to this action. A total of 17,250 shells were expended by the naval bombardment group in this effort.\nMeanwhile, the assault troops aboard nine tank landing ships (LSTs) made for the transport area where they were transferred to smaller landing craft, including Alligator tracked landing vehicles (LVTs), DUKWs and LCVPs. These craft were crewed by US personnel, mainly from the 672nd and 727th Amphibian Tractor Battalions and the 593rd Engineer Boat and Shore Regiment. Under the cover of the bombardment they began their run to the shore in several waves. When they were  from the shore, the naval bombardment ceased. The ramps came down on the landing craft as they hit the beaches just before 9:00&nbsp;am. The landing was carried out on a two-brigade front. Brigadier Frederick Chilton's 18th Brigade landed two battalions (the 2/10th and 2/12th) on the left at Red and Yellow Beaches, while one battalion (the 2/27th Battalion) from Brigadier Ivan Dougherty's 21st Brigade landed on the right at Green Beach. The division's third brigade (the 25th) remained embarked initially to act as a floating reserve. The assaulting troops were landed at the wrong place due to obscuration of key features ashore as a result of the pre-landing bombardment, and a failure to clear all of the beach obstacles. As a result two of the three assault battalions landed too far left, and troops from each battalion became mixed up with others, causing some confusion. Despite this, the landing was opposed only by a small volume of fire, and within 15 to 20 minutes the assault troops had established a beachhead. The landing force suffered no casualties during this first part of the operation.\nAfter the beach maintenance area was secured, the 18th Brigade was tasked with capturing the high features north of Klandasan, which blocked the advance towards Balikpapan town, while the 21st Brigade was tasked with advancing along the coast road to capture the airfields at Sepinggang and Manggar. During the fighting around Klandasan, the 2/10th Battalion attacked a feature dubbed Parramatta Ridge, which was strongly fortified with pillboxes, tunnels, land mines and booby traps. Due to a last minute diversion and communications issues, the battalion's fire support was unavailable, and the tanks that had been assigned to support them broke down, nevertheless the battalion's commanding officer, Lieutenant Colonel Tom Daly, pressed home the attack despite likely heavy casualties. The initial infantry assault on Hill 87 was launched throughout the morning, and stalled as Japanese resistance grew; the Australians became pinned below the summit and just before noon, two supporting tanks from the 1st Armoured Regiment came forward, suppressing Japanese fire and assisting the infantry to capture the position by 12:40&nbsp;pm. After this, the indirect fire support, except for the divisional machine guns, was restored. Japanese fire from neighbouring positions was suppressed, enabling a company assault on the final objective. By 2:00&nbsp;pm, the Australians had captured Parramatta.\nMeanwhile, the 21st Brigade came up against heavy resistance after initially advancing against only desultory artillery and mortar fire. The Australian ground troops were lavishly provided with direct and indirect fire support – potentially more so than in any other Australian campaign during the war – and with the help of tanks, flame-throwers, mortars and other fire support, by the end of the first day, the Australians had extended their beachhead . The work of marking out the beaches and organising the troops as they arrived on the beach, as well as controlling the unloading of stores, was undertaken by a specially trained unit, the 2nd Beach Group, which landed in the second wave. Shortly after landing, it was found that the LSTs could not land their stores over the beaches; as a result, DUKWs were used instead to offload stores and land them.\nThe fighting for the high ground around Klandasan continued throughout 2 July where the Japanese – largely from the 2nd Garrison Force and elements of the 454th Independent Infantry Battalion – resisted strongly, during which Australian engineers worked to destroy large numbers of Japanese tunnels, as well as neutralising thousands of land mines and booby traps. The 25th Brigade landed at this time, while the 21st Brigade pushed further eastwards, with engineers supporting the multiple river crossings. The 2/14th Battalion captured Sepinggang airfield, using indirect fire support as much as possible to minimise their own casualties, while the 2/27th Battalion secured the area around Stalkoedo, and the 2/16th Battalion also took several features.\nThe next day, 3 July, the 25th Brigade, under the command of Brigadier Kenneth Eather, relieved the 18th; while the 18th secured Balikpapan town and its harbour, the 25th Brigade advanced inland along the Milford Highway. By the end of the day, the Australian beachhead had been extended out to , and the 21st Brigade had reached Manggar airfield. Elements of the Japanese 454th Independent Infantry Battalion occupied strong positions in the high ground overlooking the field, and were able to call down heavy concentrations of mortar and artillery fire.\nThe Australians captured the airfield on 4 July, but were held up for several days after coming up against Japanese artillery and mortar fire. Tanks were landed around the Manggar Besar River, but two were knocked out by Japanese fire. Naval and air support was called in, and over the course of several days the gun positions were captured.\nAfter landing, the 25th Brigade assumed a holding role in the centre of the Allied beachhead until 3 July, when it took over from the 18th Brigade, who went into reserve, but remained around Balikpapan town to continue mopping-up operations there. The 25th Brigade then began pushing inland from the urban area towards Batuchampar,  from the initial landing beaches.\nOn 5 July,  the 2/9th Battalion and the 2/1st Pioneer Battalion, supported by elements of the 2/7th Cavalry Commando Regiment as well as artillery and tanks were landed at Panadjam by LVTs and LCMs, to clear the western shore of Japanese artillery, prior to the Allies opening the port. The 2/9th sent patrols to Nanang and the Sesumpu River; before continuing down the Riko River and landing another patrol that exploited inland towards the Parehpareh River; meanwhile, the 2/1st Pioneers landed at several spots including Teloktebang, Djinabora and Tempadung, before advancing overland to Pamaluan.  Japanese opposition was limited and the area around Panadjam was cleared within two days. However, heavy fighting took place along the Milford Highway on 5–6 July as part of a Japanese battalion attempted to block the Australian advance on Batuchampar. The Japanese employed a variety of delaying tactics to slow the Australians, using the thick jungle to their advantage. The Australians brought up tanks equipped with flamethrowers, and called in a heavy artillery barrage to clear the firmly entrenched defenders; over 8,000 rounds were expended in this effort.\nBy 9 July, the two forward Japanese battalions had largely been destroyed, and the remnants were withdrawing from the east coast. The 21st Brigade continued their advance towards Sambodja. Patrols also ranged towards the Milford Highway to established contact with the 25th Brigade. The Japanese commander, Kamada, had established his headquarters around Batuchampar by this time, and the Japanese rearguard began withdrawing back to the main defensive position  inland at Batuchampar, where Kamada's third battalion was digging in. Meanwhile, the landing beaches were improved with the construction of several docks by the US 11th Naval Construction Battalion, to enable two LSTs to be unloaded at a time. On 10 July, the Allies opened another beach – designated Brown Beach – around the southern part of the bay; the protected waters there greatly increased the amount of supplies that could be brought in, allowing eight LSTs to dock at the same time.\nin support of soldiers of the Australian 2/10th Infantry Battalion]]\nOver the course of a fortnight, Allied artillery and aircraft worked to reduce the Japanese position along the Milford Highway, while the 25th Brigade felt for the Japanese flanks, attempting to encircle them. Meanwhile, patrols from the 2/7th Cavalry Commando Regiment and the KNIL company were sent along the flanks and to remote areas to gather intelligence. By 21 July, the encirclement of the Japanese defensive position was almost complete and the surviving Japanese began to withdraw. This withdrawal was conducted in good order, and the Australians noted the skill and determination with which the Japanese sited and held their defensive positions during this time. The Australians assessed that the Japanese would seek to establish a new defensive position around Samarinda, but the Australian commander, Milford, determined that the strategic situation did not require attacking this position. Following this, the Australians began deep patrolling operations. The 2/27th Battalion advanced along the Vasey Highway, ranging as far as Sambodja.\nAftermath\nMajor operations had ceased by 21 July, when the Japanese abandoned Batuchampar and Manggar, although small scale clashes continued until the end of the war. The majority of Japanese withdrew north-east, before eventually turning west and marching across the island to Kuching or to Bandjermasin. However, troops from the 22nd Special Base Force attempted to break into the port facilities around Balikpapan in August from the western side of the bay, and several minor actions were fought during this time. The 7th Division's casualties were significantly lighter than they had suffered in previous campaigns; a total of 229 Australians were killed and 634 wounded, while at least 2,032 Japanese were killed and another 63 captured.\nThe operation to secure Balikpapan was Australia's largest and last amphibious operation of the war. The battle was one of the last to occur in World War II, beginning a few weeks before the bombing of Hiroshima and Nagasaki and the Soviet invasion of Manchuria effectively ended the war. Japan surrendered while the Australians were combing the jungle for stragglers. In this regard, and in light of the strategic situation which had effectively negated many of the Allies stated reasons for the operation, historians such as Rhys Crawley and David Horner have assessed that the operation did not affect the course of the war and was \"strategically dubious\". Pratten argues that the cancellation of Allied operations to secure Java negated the need for the operation and concludes that the decision to continue with the operation was potentially influenced by the perceived importance of Balikpapan's oil facilities.\nDespite the early capture of the airfields at Sepinggang and Manggar, it was not until 15 July that the first RAAF Spitfire fighters began operating, and ultimately the airfields could not be used for bombing operations. Additionally, much of the port area and oil producing facilities were heavily damaged by the pre-invasion bombardment and by Japanese sabotage efforts, rendering them useless to the Allies in the short term. Politically, the damage inflicted on the infrastructure strained the relationship between the Australians and the returning Netherlands East Indies government. Additionally, the oilfields that supplied the damaged refineries – those around Sambodja and Sangasanga – remained in Japanese hands until the end of the war, thereby negating what little benefit the Allies gained in securing the refineries.\nDue to the limited strategic reasons for the operation, Horner argues that the operation was undertaken largely for political reasons, as MacArthur wished to \"show the Dutch government that he had attempted to recover part of its territory...\" but ultimately it did not effect the outcome of the war. Nevertheless, historian Peter Dennis concludes that the operation was of \"doubtful value strategically\" but that \"tactically...[it was]...skilfully conducted\". A key element of the success of the operation from the Australian perspective was the logistic support provided by the US, particularly in relation to the shipping that was required to transport the vast amounts of troops, stores and equipment for the operation. In comparison with the concurrent operations the Australian First Army were fighting in New Guinea at the same time, particularly around Aitape–Wewak, the I Australian Corps' operations in Borneo received considerably more resources in terms of air and naval support, and transportation.\nFollowing the Japanese surrender, the three Australian brigades were committed to occupation duties until around February 1946. The 21st Brigade was detached to Makassar in the Celebes Islands to accept surrender of the Japanese forces, release prisoners of war and maintain civil order. The 25th Brigade detached elements to occupy Samarinda, Bandjermasin, Tanahgrogot, and Pontianak.\nMemorial\nA memorial commemorating the 7th Division landing was built in a roundabout in Balikpapan (currently in East Kalimantan, Indonesia) near Merdeka Square and Pertamina complex. Known locally as Tugu Australia (Australian monument), the memorial exists as early as January 1946. A copper inscription of details about the battle, sculpted by Ross J. Bastian, was added in 1998.\nSee also\n*Naval Base Borneo\n*Operation Semut\n*Operation Agas\n*Western New Guinea campaign\n*US Naval Advance Bases\nReferences\nBibliography\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\nFurther reading\n*\n*\n*\n*\n*\n*\nExternal links\n*[http://www.britishpathe.com/record.php?id=60814 British Pathe newsreel of the Battle: 'Australians from Balikpapan']\n*[http://www.britishpathe.com/record.php?id=13332 British Pathe newsreel of the Battle: 'Pacific Island Warfare']\n*[https://chinesemoneymatters.wordpress.com/2018/05/08/japanese-occupation-money-and-the-battle-of-balikpapan/ Japanese occupation money and the Battle of Balikpapan] – by Nicholas Lua, 8 May 2018."
    }
  ]
}