{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Himera (409 BC)\n\nNear the site of the first battle and great Carthaginian defeat of 480 BC, the Second Battle of Himera was fought near the city of Himera in Sicily in 409 between the Carthaginian forces under Hannibal Mago (a king of Carthage of the Magonid family, not the famous Hannibal of the Barcid family) and the Ionian Greeks of Himera aided by an army and a fleet from Syracuse. Hannibal, acting under the instructions of the Carthaginian senate, had previously sacked and destroyed the city of Selinus after the Battle of Selinus in 409.  Hannibal then destroyed Himera which was never rebuilt.\nMass graves associated with this battle (along with the first Battle of Himera in 480 BC) were discovered in 2008-2011, corroborating the stories told by ancient historians.\nBackground\nPhoenicians of Western Sicily had aided the Elymians against the Dorian Greeks of Selinus in 580 when a Greek colonization attempt of Lilybaeum was defeated. The invasion of Spartan Dorieus was again defeated by Carthage near Eryx in 510, and a war followed where Carthage destroyed the city of Hereclea Minoa. Carthage signed treaties with the cities of Selinus, Himera, and Zankle by 490. The pretext for launching the Punic Sicilian expedition of 480 was the restoration of the deposed tyrant of Himera.  The Sicilian Greeks under the tyrants Gelo of Syracuse and Theron of Akragas had crushed the Punic expedition in the 1st battle of Himera in 480 BC.\nCarthage had stayed away from Sicilian Greek affairs following the defeat for 70 years, during which time Greek culture started to penetrate the Elymian, Sikanian, and Sicel cities. The political landscape in Sicily also changed as Greek tyrants were replaced by democracy and oligarchy, the domain of Syracuse shrunk, and infighting between Greek cities flared up in Sicily. Athens had sent fleets to Sicily in 427, 425, and 424 to intervene, which caused Hermocrates of Syracuse to request all Sicilian Greek cities to remain at peace at the congress of Gela in 424.\nThe Elymian city of Segesta had clashed with Selinus over territorial rights and marriage issues and had been worsted in the conflict. After an appeal to Carthage was turned down in 415, Athens heeded the plea for help and sent over an expedition that was ultimately defeated at Syracuse in 413. Faced with renewed hostility from Selinus, Segesta again appealed to Carthage in 410. The Carthaginian Senate, after some debate, agreed to intervene. This appeal came at a time when the mainland Greek cities were locked in the Peloponnesian War, and Syracuse, an ally of Sparta, was not focused on Sicily. The Syracusan fleet was operating in the Aegean Sea.\nPrelude\nHannibal Mago sent two expeditions to Sicily, the first one in 410 which drove the Selinute army from Segestan territory, and the second one obliterated Selinus after besieging the city in 409. The mission given to Hannibal by the Carthaginian Senate was fulfilled with the fall of Selinus. However, Hannibal chose to march on Himera and avenge the defeat of his grandfather 70 years before.\nOpposing forces\nCarthage is said to have mobilized 120,000 men, including 4,000 cavalry, recruited from Africa, Sardinia, Spain, and even Sicilian Greeks for the Selinute campaign in 409, but a realistic estimate is around 40,000 soldiers. The Carthaginian army, after the battle of Selinus, had been reinforced by 20,000 Sicel and Elymian soldiers on the way to Himera, boosting its strength to 50,000 soldiers at that point.\nCarthaginian Cohorts\nThe Carthaginian army was made up of many nationalities. The Libyans supplied both heavy and light infantry and formed the most disciplined units of the army. The heavy infantry fought in close formation, armed with long spears and round shields, wearing helmets and linen cuirasses. The light Libyan infantry carried javelins and a small shield, same as Iberian light infantry. The Iberian infantry wore purple-bordered white tunics and leather headgear. The heavy infantry fought in a dense phalanx, armed with heavy throwing spears, long body shields, and short thrusting swords. Campanian, Sicel, Sardinian, and Gallic infantry fought in their native gear, but often were equipped by Carthage. Sicels and other Sicilians were equipped like Greek hoplites.\nThe Libyans, Carthaginian citizens, and the Libyo-Phoenicians provided disciplined, well-trained cavalry equipped with thrusting spears and round shields. Numidia provided superb light cavalry armed with bundles of javelins and riding without bridle or saddle. Iberians and Gauls also provided cavalry, which relied on the all-out charge. Carthage at this time did not use elephants, but Libyans provided the bulk of the heavy, four-horse war chariots for Carthage, which were not present at Himera in 409. Carthaginian officer corps held overall command of the army, although many units may have fought under their chieftains.\nGreek forces\nThe mainstay of the Greek army was the hoplite, drawn mainly from the citizens and mercenaries. Sicels and other native Sicilians also served in the army as hoplites and also supplied peltasts, which is a unit where the poorer citizens also served. The phalanx was the standard fighting formation of the army. The cavalry was recruited from wealthier citizens and hired mercenaries. Large Sicilian cities like Syracuse and Akragas could field up to 10,000&nbsp;– 20,000 citizens,   while smaller ones like Himera and Messana mustered between 3,000–6,000 soldiers. Syracuse sent a relief force, originally recruited for aiding Selinus to Himera; it included 3,000 soldiers from Syracuse, 1,000 from Akragas, and probably 1,000 mercenaries.\nBattle\nHannibal marched to Himera probably using the same route taken by the Selinus horsemen in 480 and set up his main camp on the west of the city, while about a third of the army encamped to the south of Himera. The city of Himera sits on top of a hill 300–400 feet high on the western bank of the River Himera. The hill is steep in the northern, western, and eastern sides, but gradually slopes to the south. There are hills to the west and south of the city. Instead of building a circumvallation wall and fully investing the city, the Carthaginians assaulted the walls with the help of siege towers and battering rams after setting up their camps. However, the city walls withstood the attack and no breaches could be made for the Punic infantry to exploit. Hannibal then sent sappers, who dug tunnels under the walls and collapsed sections of it by setting fire to the wooden support beams. Carthaginian infantry then attacked through the gap, but the Himerans repulsed the Punic assault on the city, and then threw up makeshift walls to close the breaches.\nSometime after this event, Syracusan general Diocles arrived with 3,000 Syracusan hoplites, 1,000 soldiers from Akragas, and another 1,000 mercenaries, and entered the city. Joining the Himeran force of about 10,000 troops (majority hoplites with some cavalry and peltasts), the Greeks launched a surprise attack on the Punic lines, probably on the forces posted to the south of the city. The Greeks achieved total surprise and in the confusion, Carthaginian troops fought each other as well as Greeks. As the Carthaginians ultimately broke and fled after losing about 6,000 soldiers, Greek soldiers went after the scattered remnants of their enemy. At this point, Hannibal launched a counterattack with the force he had held in reserve at the other camp (to the west of Himera), routed the Greeks and chased them back into the city, with 3,000 Greeks losing their lives in the debacle.\nThe main Syracusan fleet was away from Sicily, but 25 triremes had arrived at Himera after the battle from Syracuse. As the Carthaginian fleet was at Motya, their arrival gave the Greeks command of the sea around Himera. Hannibal spread a false report that the Punic army was going to attack Syracuse after sailing there from Motya, as the main army of Syracuse was approaching Himera, thus leaving their city unguarded. This convinced the Syracusans to leave Himera for their mother city. The city of Himera had little chance of withstanding the Carthaginians on their own, so they decided to evacuate the city. Diocles marched out of the city with half the men and all his troops at night, the Syracusan ships evacuated as many of the women and children as possible. The Carthaginians resumed their assaults the next day. The city managed to hold out for one day. Just as the Syracusan fleet was returning and was within sight of the city the following day, the Carthaginians broke through. Iberian troops of the Punic army had managed to secure a gap in the wall, and also the sections of the wall flanking the gap. This held off the Greeks until the Carthaginian army stormed the city through the gap, and the reduced garrison of Himera was overcome by the weight of numbers.\nActs of vengeance\nHannibal sacrificed 3,000 Greek prisoners at the place where Hamilcar, his grandfather and leader of the 480 expedition, had fallen. The city of Himera was utterly destroyed, even all the temples were flattened to the ground, and the women and children were enslaved. Hannibal did not, however, divert a river over the city site (like the Greeks did at Sybaris in 511) to complete his revenge. The spoils of war were divided among his troops, and the prisoners were sold into slavery. The Italian mercenaries, who mostly led the assault, complained that they had been abused by their commander and that their payment was not sufficient. They were subsequently discharged, and then took service with the Greeks.\nAftermath\nHannibal did not go after Akragas or Syracuse, the Sicilian cities mainly responsible for the humiliation at Himera at 480 after sacking Himera.  He disbanded his army (the remaining Italian mercenaries chose to take service with Syracuse), garrisoned the Punic territory with sufficient troops and returned to Carthage with the fleet, where he was received with honors. Himera as a city would never be rebuilt again. The survivors of Himera built a city called Thermae nearby, which housed a mixed population of Greeks and Phoenicians.\nThe Greek response to the sack of Himera was mild. Syracuse chose to expand her fleet and Akragas began to expand her army, but no official action was taken against Carthage or the Punic territory in Western Sicily. Hermocrates, a Syracusan general, chose to use the sack of Himera to set up a base at Selinus around 407 and raid the territories of Motya and Panormus, which provoked a strong Carthaginian response and almost the whole of Sicily fell under Carthaginian domination by 405.\nReferences\nSources\n*\n*\n*\n*\n*\n*\n*\n*\nExternal links\n*[https://archive.org/details/bub_gb_agd-eLVNRMMC Diodorus Siculus translated by G. Booth (1814)] Complete book (scanned by Google)\n*"
    }
  ]
}