{
  "content": [
    {
      "type": "text",
      "text": "# Battle of La Bassée__disambig_1\n\n| map_type    = France\n| map_size    = 200\n| map_caption =\n| map_label   = La Bassée\n| result      = Inconclusive\n| combatant1  =\n*\n| combatant2  =\n| commander1  = Sir John French,  Horace Smith-DorrienJames Willcocks Louis de Maud'huy Louis Conneau\n| commander2  = Crown Prince Rupprecht\n| strength1   = II Corps2nd Cavalry BrigadeLahore DivisionFrench II Cavalry Corps (detachments)\n| strength2   = 6th Army\n| casualties1 =\n| casualties2 = 6,000\n| campaignbox =\n}}\nThe Battle of La Bassée was fought by German and Franco-British forces in northern France in October 1914, during reciprocal attempts by the contending armies to envelop the northern flank of their opponent, which has been called the Race to the Sea. The 6th Army took Lille before a British force could secure the town and the 4th Army attacked the exposed British flank further north at Ypres. The British were driven back and the German army occupied La Bassée and Neuve Chapelle. Around 15 October, the British recaptured Givenchy-lès-la-Bassée but failed to recover La Bassée.\nGerman reinforcements arrived and regained the initiative, until the arrival of the Lahore Division, part of the Indian Corps. The British repulsed German attacks until early November, after which both sides concentrated their resources on the First Battle of Ypres. The battle at La Bassée was reduced to local operations. In late January and early February 1915, German and British troops conducted raids and local attacks in the Affairs of Cuinchy, which took place at Givenchy-lès-la-Bassée and just south of La Bassée Canal, leaving the front line little changed. from the Beuvry–Béthune road to a line from Estaires to Fournes, the Battle of Armentières  from Estaires to the Douve river, the Battle of Messines  from the Douve to the Ypres–Comines Canal and the Battles of Ypres  comprising the Battle of Langemarck  the Battle of Gheluvelt  and the Battle of Nonne Bosschen (11 November), from the Ypres–Comines Canal to Houthulst Forest. James Edmonds, the British official historian, wrote that the II Corps battle at La Bassée could be taken as separate but that the other battles from Armentières to Messines and Ypres, were better understood as a battle in two parts, an offensive by III Corps and the Cavalry Corps from 12 to 18 October, against which the Germans retired and the offensive by the German 6th and 4th armies  which from 30 October mainly took place north of the Lys at Armentières, from when the battles of Armentières and Messines merged with the Battles of Ypres.}}\nBackground\nStrategic developments\nFrom 17 September to 17 October the belligerents had tried to turn the northern flank of their opponent. Joffre ordered the French Second Army to move to the north of the French Sixth Army, by moving from eastern France from 2 to 9 September and Falkenhayn ordered the German 6th Army to move from the German-French border to the northern flank on 17 September. Next day, French attacks north of the Aisne led to Falkenhayn to order the 6th Army to repulse the French and secure the flank. When the French advanced on 24 September, they met a German attack rather than an open flank and by 29 September, the Second Army had been reinforced to eight corps and extended north but was still opposed by German forces near Lille, rather than an open flank. The German 6th Army had also found that on arrival in the north, it was forced to oppose the French attack rather than advance around the flank and that the secondary objective of protecting the northern flank of the German armies in France, had become the main task.\nTactical developments\nBy 6 October, the French needed British reinforcements to withstand German attacks around Lille. The British Expeditionary Force (BEF) had begun to move from the Aisne to Flanders on 5 October and reinforcements from England assembled on the left flank of the Tenth Army, which had been formed from the left flank units of the Second Army on 4 October. The Allies and the Germans attempted to take more ground, after the \"open\" northern flank had disappeared, Franco-British attacks towards Lille in October, being followed up by attempts to advance between the BEF and the Belgian army by a new French Eighth Army. The moves of the German 7th Army and then the 6th Army from Alsace and Lorraine, had been intended to secure German lines of communication through Belgium, where the Belgian army had sortied several times from the National redoubt of Belgium, during the period between the Franco-British retreat and the Battle of the Marne. In August British marines had landed at Dunkirk. In October a new German 4th Army was assembled from the III Reserve Corps, the siege artillery used against Antwerp and four of the new reserve corps training in Germany.\nFlanders terrain\nThe North-east of France and the south-west Belgium are known as Flanders. West of a line between Arras and Calais in the north-west, lie chalk downlands covered with soil sufficient for arable farming. To the east of the line, the land declines in a series of spurs into the Flanders plain, bounded by canals linking Douai, Béthune, Saint-Omer and Calais. To the south-east, canals run between Lens, Lille, Roubaix and Courtrai, the Lys river from Courtrai to Ghent and to the north-west lay the sea. The plain is almost flat, apart from a line of low hills from Cassel, east to Mont des Cats, Mont Noir, Mont Rouge, Scherpenberg and Mont Kemmel. From Kemmel, a low ridge lies to the north-east, declining in elevation past Ypres through Wytschaete, Gheluvelt and Passchendaele, curving north then north-west to Diksmuide where it merged with the plain. A coastal strip about  wide was near sea level and fringed by sand dunes. Inland the ground was mainly meadow, cut by canals, dykes, drainage ditches and roads built up on causeways. The Lys, Yser and upper Scheldt had been canalised and between them the water level underground was close to the surface, rose further in the autumn and filled any dip, the sides of which then collapsed. The ground surface quickly turned to a consistency of cream cheese and on the coast troops were confined to roads, except during frosts.\nThe rest of the Flanders Plain was woods and small fields, divided by hedgerows planted with trees and cultivated from small villages and farms. The terrain was difficult for infantry operations because of the lack of observation, impossible for mounted action because of the many obstructions and difficult for artillery because of the limited view. South of La Bassée Canal around Lens and Béthune was a coal-mining district full of slag heaps, pit heads () and miners' houses (). North of the canal, the city of Lille, Tourcoing and Roubaix formed a manufacturing complex, with outlying industries at Armentières, Comines, Halluin and Menin, along the Lys river, with isolated sugar beet and alcohol refineries and a steel works near Aire-sur-la-Lys. Intervening areas were agricultural, with wide roads on shallow foundations and unpaved mud tracks in France and narrow pavé roads, along the frontier and in Belgium. In France, the roads were closed by the local authorities during thaws to preserve the surface and marked by , which were ignored by British lorry drivers. The difficulty of movement after the end of summer absorbed much local labour on road maintenance, leaving field defences to be built by front-line soldiers.\nPrelude\nFranco-British offensive preparations\nBy 4 October, the troops under Maud'huy were in danger of encirclement, German troops had reached Givenchy, north-west of Vimy and the French division on the northern flank was separated from the cavalry operating further north; a gap had also been forced between X Corps and the Territorial divisions to the south. Castelnau and Maud'huy wished to withdraw but rather than lose all of northern France, Joffre created a new Tenth Army, from Maud'huy's forces and gave Castelnau a directive, to maintain the Second Army in its positions, until the pressure of operations further north, diminished the power of German attacks between the Oise and the Somme. Foch was appointed deputy to Joffre and given command of all French troops in the north. On 6 October, the French line from the Oise to Arras was secured; Joffre and French had also agreed to concentrate the BEF around Doullens, Arras and St Pol, ready for operations on the left of the Tenth Army.\nBy 8 October, the French XXI Corps had moved its left flank to Vermelles, just short of La Bassée Canal. Further north, the French I and II Cavalry corps (General Louis Conneau) and de Mitry, part of the 87th Territorial Division and some Chasseurs, held a line from Béthune to Estaires, Merville, Aire, Fôret de Clairmarais and St Omer, where the rest of the 87th Territorial Division connected with Dunkirk; Cassel and Lille further east were still occupied by French troops. Next day, the German XIV Corps arrived opposite the French, which released the German 1st and 2nd Cavalry corps to attempt a flanking move between La Bassée and Armentières. The French cavalry were able to stop the German attack north of the La Bassée–Aire canal. The 4th Cavalry Corps further north, managed to advance and on 7 October, passed through Ypres before being forced back to Bailleul, by French Territorial troops near Hazebrouck.  From 8 to 9 October, the British II Corps arrived by rail at Abbeville and was ordered to advance on Béthune.\nThe British 1st and 2nd Cavalry divisions covered the arrival of the infantry and on 10 October, using motor buses supplied by the French, II Corps advanced . Indian Army units were numbered but these were not used in France, to obviate confusion with similarly numbered metropolitan units.}} By the end of 11 October, II Corps held a line from Béthune to Hinges and Chocques, with flanking units on the right  south of Béthune and on the left  to the west of the town. On 12 October, the II Corps divisions attacked to reach a line from Givenchy to Pont du Hem,  north of La Bassée Canal, across ground which was flat and dotted with farms and buildings as far as a low ridge  east of Béthune. The German defenders of I and II Cavalry corps and attached  disputed every tactical feature but the British advance continued and a German counter-attack near Givenchy was repulsed. The British dug in from Noyelles to Fosse. On 13 October, the II Corps attack by the 3rd Division and the French 7th Cavalry Division gained little ground and Givenchy was almost lost when the German attacked in a rainstorm, the British losing\nGerman offensive preparations\nThe 6th Army had arrived in northern France and Flanders from the south and progressively relieved German cavalry divisions, VII Corps taking over from La Bassée to Armentières on 14 October, XIX Corps next day around Armentières and XIII Corps from Warneton to Menin. Attacks by the British II and III Corps caused such casualties that XIII Corps was transferred south from 18 to 19 October in reinforcement. The 6th Army line from La Bassée to Armentières and Menin, was ordered not to attack until the operations of the new 4th Army in Belgium had begun. Both armies attacked on 20 October, the XIV, VII, XIII and XIX corps of the 6th Army making a general attack from Arras to Armentières. Next day the northern corps of the 6th Army attacked from La Bassée to St Yves and gained little ground but prevented British and French troops from being moved north to Ypres and the Yser fronts. On 27 October, Falkenhayn ordered the 6th Army to move heavy artillery north for the maximum effort due on 29 October at Gheluvelt, to reduce its attacks on the southern flank against II and III corps and to cease offensive operations against the French further south.  was formed from XIII Corps and reinforcements from the armies around Verdun, which further depleted the 6th Army and ended the offensive from La Bassée north to the Lys.\nBattle\nBritish-French attacks\n14–20 October\nOn  October, II Corps attacked on both sides of La Bassée Canal and German counter-attacks were made each night. The British managed short advances on the flanks, with help from French cavalry but lost  From 16 to 18 October, II Corps attacks pivoted on the right and the left flank advanced to Aubers, against German opposition at every ditch and bridge, which inflicted another thousand casualties. Givenchy was recaptured by the British on 16 October, Violaines was taken and a foothold established on Aubers Ridge on 17 October; French cavalry captured Fromelles. On 18 October, German resistance increased as the German XIII Corps arrived, reinforced the VII Corps and gradually forced the II Corps to a halt. On 19 October, British infantry and French cavalry captured Le Pilly (Herlies) but were forced to retire by German artillery-fire.\nThe fresh German 13th Division and 14th Division arrived and began to counter-attack against all of the II Corps front. At the end of 20 October, the II Corps was ordered to dig in from the canal near Givenchy, to Violaines, Illies, Herlies and Riez, while offensive operations continued to the north. The countryside was flat, marshy and cut by many streams, which in many places made trench digging impractical, so breastworks built upwards were substituted, despite being conspicuous and easy to demolish with artillery-fire. (It was not until late October that the British received adequate supplies of sandbags and barbed wire.) The British field artillery was allotted to infantry brigades and the 60-pounders and howitzers were reserved for counter-battery fire. The decision to dig in narrowly forestalled a German counter-offensive which began on 20 October, mainly further north against the French XXI Corps and spread south on 21 October, to the 3rd Division area.\n21 October\nThe II Corps brigades in line (from south to north) were the 15th, 13th, 14th, 7th, 9th and 8th; at  the Germans attacked through a mist, mainly opposite the 7th and 9th brigades from Le Transloy to Herlies and surprised one company, forcing it back. The Germans widened the breach on the right of the 7th Brigade, but flanking units repulsed the German attackers. Elsewhere, the Germans maintained an extensive bombardment against the 9th Brigade but they did not attack, and one battalion at Violaines was able to fire in enfilade at German infantry, as they crossed its front towards Le Transloy. An infantry company and the 7th Brigade Signal Section engaged the Germans at  as they apparently lost direction in the mist and more troops arrived to close the gap. As the mist dispersed British artillery fired on the German infantry who retreated at speed. A British counter-attack was made at  which retook most of the lost trenches. Most of the British reserves had been committed but German attacks at  and  were also repulsed, troops from all three regiments of the German 14th Division and one from the 13th Division being identified.\nAt  news of the retirement of the 19th Brigade from Le Maisnil arrived and the 3rd Division was ordered back from Herlies and Grand Riez for about  to a line from Lorgies to Ligny and south of Fromelles, the junction with a French cavalry unit, which improved the line in the 8th Brigade area; later on the left flank of the 14th Brigade moved back to link with the 3rd Division at Lorgies. On 21 October II Corps had  During the fighting Smith-Dorrien had ordered the digging of a reserve line which was about  in the rear on the northern flank, where the danger of envelopment was greatest. The line ran from east of Givenchy, east of Neuve-Chapelle to Fauquissart on ground easier to defend but had little barbed wire and the ground was too marshy for deep dugouts. The engineers of the 3rd and 5th divisions prepared the defences, with help from French civilians. Next day the French cavalry were driven from Fromelles and a retirement to the new line was agreed by French and Smith-Dorrien, for the night of  French ordered elements of the Lahore Division  to move to Estaires, behind the left (northern) flank of II Corps, to support the French II Cavalry Corps (Général Louis Conneau).\nGerman attacks, 20 October – 2 November\n22–25 October\nEarly on 22 October, the British were forced out of Violaines and German attacks began along all of the 5th Division front. On the night of  II Corps retired its left (northern) flank, to a line which had been reconnoitred from La Bassée Canal east of Givenchy to La Quinque Rue, east of Neuve-Chappelle and on to Fauquissart. A lack of labour, tools and barbed wire meant that the troops found little more than an outline of the position and began to dig in. The 3rd Division was on the left flank, at the junction with the French II Cavalry Corps and the 19th Brigade, which had closed a gap with the III Corps. The Germans spent 23 October bombarding the old British positions and probing forward, as the Lahore Division (Lieutenant-General Henry Watkis) reached Estaires, which had been made the assembly point for the Indian Corps, to be convenient to support II Corps or III Corps as necessary. the Ferozepore Brigade having been detached to the Cavalry Corps (Lieutenant-General Edmund Allenby) and the Sirhind Brigade still being in Egypt.}} The Jullundur Brigade relieved the II Cavalry Corps on  from the II Corps left flank at Fauquissart to the 19th Brigade at Rouges Bancs, which created a homogeneous British line from Givenchy northwards to Ypres.\nOpposite the Anglo-French south of the British III Corps, was part of the German XIV Corps and the VII, XIII, XIX and I Cavalry Corps. At  on 24 October, German artillery began a bombardment and just after dawn many German infantry were seen approaching the 3rd Division positions in the north.}} The German troops were easily visible and repulsed by artillery-fire before they reached the British front line. German attacks were suspended until dusk when an attack began south of Neuve-Chapelle on the right flank of the 3rd Division, until after midnight, eventually being repulsed, with many casualties. In the early hours of 25 October, German infantry were able to overrun some British trenches but were forced out by hand-to-hand fighting and at  the trenches were overrun again until reinforcements from the 9th Brigade forced the Germans back. On the left flank of the 3rd Division the 8th and Jullundur brigades were attacked from  on 24 October and the left flank battalion of the 8th Brigade was forced back. The flanking units fired into the area and a counter-attack at midnight by the brigade reserve battalion, managed to restore the position in costly fighting. Many German troops of the 14th and 26th divisions were killed in the attacks and several prisoners taken.\nBy morning, the II Corps headquarters staff were relieved, that despite  of battle, exhaustion and the loss of many pre-war regulars and experienced reservists, a determined German attack had been defeated. The corps front was not attacked on 25 October but German guns accurately bombarded the British positions, with assistance from observation aircraft, flying in clear weather. German infantry kept  back, except for areas in front of the 5th Division. Some positions were evacuated during daylight hours to escape German shelling and engineers collected fence posts and wire from farmland, ready to build obstacles in front of the British positions overnight. Smith-Dorrien forecast a lull in German attacks but requested reinforcements from French who agreed, because a defeat at La Bassée would compromise offensive operations in Belgium. A cavalry brigade, some artillery and an infantry battalion were moved to Vieille Chappelle behind the 3rd Division, two 4.7-inch gun batteries and Jellicoe a Royal Navy armoured train, were sent and the field gun ammunition ration was doubled to  per gun per day. Maud'huy added two more battalions to the one in Givenchy and Conneau moved the II Cavalry Corps behind the 3rd Division flank. About  replacements had arrived by 27 October, which brought the infantry battalions up to about  each.\n26–27 October\nThere was much German patrolling before dawn on 26 October and at sunrise the Germans attacked north of Givenchy, having crept up in the dark but were repulsed by small-arms fire aimed at sounds because the British had no Very pistols or rockets. Later on, French reinforcements arrived so that the British battalion could move into divisional reserve, with the two already withdrawn. Another German attack began in the afternoon on the left of the 5th Division, in which the German infantry broke into the British trenches before being annihilated. Another attack began near Neuve-Chappelle at  against the extreme left flank of the division and the right of the 3rd Division, after an accurate artillery bombardment. The British infantry had many casualties and some units withdrew from their trenches to evade the German artillery-fire. A battalion was broken through and the village was occupied but the flanking units enfiladed the Germans until the reserve company, down to  held the western exits and forced the Germans back into the village, which was on fire.\nAt  a reserve battalion and  cyclists reached the area as did the rest of the brigade reserve but the darkness and disorganisation of the troops took time to resolve. A counter-attack by three companies began from the west after dark and pushed the Germans back to the former British trenches east of the village. Attacks were then postponed until dawn and Smith-Dorrien Trench, a new line east of the village was dug and linked to the defences north and south of the village. British casualties were severe and when French visited II Corps headquarters on 26 October, more reinforcements were promised and French ordered a defensive front to be maintained, with local attacks to keep German troops from moving from the area into Belgium. When dawn broke, the situation at Neuve-Chapelle was seen to be worse than expected, since the Germans had consolidated positions in outlying buildings and the old British trenches. A battalion attempted to recapture the trenches at  but the Germans got round a flank and almost surrounded the battalion; the last two companies lost  their men retreating through the village.\nNorth of Neuve-Chapelle the counter-attack on a triangle of houses nearby did not begin until  such was the confusion. Elements of three battalions and the French cyclists, with support from four British and seven French cavalry batteries were quickly stopped by German machine-gun fire and snipers, who had been able to consolidate the captured houses. At  two companies and 600  arrived and six companies of the Indian Corps were dispatched. German activity opposite the rest of the 3rd Division was slight but the Jullundur Brigade to the north was attacked several times, as the German 14th Division massed in Bois du Biez, about  from Neuve-Chapelle. By  the British-French counter-attack had pushed forward north of the village and British troops held out in Smith-Dorrien Trench to the east. The German attack began at  and quickly got behind the defenders, who were almost cut off an hour later and were pursued through the village, the two battalions involved being reduced to about  including replacements.\nSome of the German troops pressed on through the village but  to the west, met a party of about  troops, who pushed them back to the village and frustrated several attempts to advance again. The Germans shifted the weight of the attack to the south and got round the left flank of the neighbouring battalion, which pulled the flank back at right angles. German rifle-fire from behind killed the commander and adjutant but the survivors held on until the 9th Bhopal Infantry battalion arrived, got behind the German flank and drove them back to the village. The 20th and 21st companies of the 3rd Sappers and Miners, the last British reserve, were sent to link the 9th Bhopal and the Northumberland fusiliers to the north of the village. Brigadier-General Frederick Maude the 14th Brigade commander to the south, had sent his reserve battalion which arrived after the 9th Bhopal and moved, north to make a flank attack on the Germans in the village but night fell before the troops were ready.\nMajor-General Thomas Morland the 5th Division commander, ordered Maude to lead another counter-attack reinforced by ten more companies. Maude cancelled the attack when he found that the British line had been restored and the village could only be attacked from the north-west. On the northern flank of the village, the British counter-attack which had begun at  had reached the western fringe of the village after an hour but had then been pinned down by machine-gun and sniper fire from the many houses thereabouts. Around  about  of the 47th Sikhs arrived but were insufficient to restart the advance. German small-arms fire enfiladed both flanks and every other reinforcement had been sent to fill the gap at Neuve-Chapelle. The counter-attack was ended and after dark the troops dug in around the west end of the village. Later that night the 3rd Division commander, Major-General Colin Mackenzie, approved the decision to relinquish the village and the survivors of the three British battalions, fewer than  were collected at Richebourg St Vaast with the 2nd Cavalry Brigade, which had arrived from the north. The new line curved around Neuve-Chapelle, with no man's land reduced to . was defeated and four companies of Chasseurs à pied, with three dismounted cavalry squadrons from the II Cavalry Corps, were moved into reserve behind the brigade. German prisoners had been taken from eight regiments of three corps on the 3rd Division front, along with the 14th Division troops. Gas shell was used on 27 October, when  shrapnel shells carrying an additional eye and nose irritant (Dianisidin) were fired at the British, although the effect was so insignificant that no-one noticed.}}\n28 October\nThe II Corps orders to maintain a defensive front but to exploit local opportunities for attack were echoed by GHQ and French, Smith-Dorrien and Willcocks met to arrange for II Corps to be relieved by the Indian Corps. French wanted the corps to rest for several days and then be the BEF reserve. The 3rd Division was ordered by Smith-Dorrien to recapture Neuve-Chapelle, because the German position there threatened the inner flanks of the 3rd and 5th divisions. Every second available man was made available to the Corps Chief Engineer (Major-General C. Mackenzie) to dig a second line and Smith-Dorrien oversaw the preparations at the 3rd Division headquarters for the counter-attack. The 7th Brigade (Brigadier-General McCracken) was to conduct the attack with support from the Indian Corps troops nearby, the 24th Brigade on the right flank and the 2nd Cavalry Brigade at Richebourg St Vaast, though down to  was made ready to follow up the attack on the right flank. To the north on the left flank a 6th Division battalion, French chasseurs and cyclists from the II Cavalry Corps and a battalion of the 9th Brigade (Brigadier-General Shaw) were also to support the attack.\nFog led to the attack being postponed until  after a short bombardment from thirteen Anglo-French batteries. After fifteen minutes the bombardment was moved  forward, ready for the infantry advance but disorganisation, language difficulties and exhaustion led only about four companies advancing, despite the presence of 3rd Division staff officers acting as liaison officers. The flank support was also inadequate due to German return fire and exhaustion, soldiers falling asleep as they fired. Two companies of the 47th Sikhs and the 20th and 21st Sappers and Miners attacked, as the 9th Bhopal Infantry was quickly forced under cover on the right. The attackers advanced by fire and movement over  of flat ground, drove the Germans out of the village and reached the eastern and northern fringes. German artillery and machine-gun fire supported constant German counter-attacks, which eventually forced the Indians to retire despite the German fire, the 47th Sikhs losing  men and the Sappers losing  of their manpower in casualties. The 9th Bhopal Infantry also retired from a captured trench, which led to two flanking companies being overrun.\nDuring the attack the 2nd Cavalry Brigade occupied the Indian jumping-off trenches and gave covering fire during the retreat. The last cavalry reserve moved forward, to stop the German infantry debouching from Neuve-Chapelle advancing further south, until  when the last  of an infantry battalion arrived. Further north the chasseurs and a British infantry battalion had advanced over much more difficult terrain and were too late to reinforce the Indian troops when their advance faltered. When the Indian troops retired, the attack was stopped and trenches west of the village were re-occupied. North of the village, the 9th Brigade was bombarded and sniped all day and but stood fast. Around  the Germans attacked south of the village, after five hours of bombardment, against the two northernmost battalions of the 13th Brigade, while other troops kept up the attack on the 2nd Cavalry Brigade and attached infantry. At  the Germans made a maximum effort along all of the attack front, advancing to within  of the British positions in places. Exhausted troops were brought back into line to reinforce the cavalry and the German attacks diminished until  when a final attack was made in the south.\n29 October\nDuring the night the cavalry were relieved and a small salient opposite Bois du Biez relinquished to straighten the line; a patrol entered Neuve-Chapelle and found it empty but during the day German bombardments and probing attacks were received all along the line. The junction of the 13th and 14th brigades near La Quinque Rue and Festubert was attacked at about  when the Germans moved quietly forward in mist but were then caught by artillery and small arms fire. A second attack just to the north occupied a British trench and at noon another attack was attempted after French shells were seen to drop short. This attack was also repulsed and a brief respite followed until after dark when German troops moved stealthily into the village. In the subsequent fighting they were repulsed three times. Successive attacks on the Indian Corps troops further north were mostly defeated by artillery-fire. During the day, most of the Indian Corps arrived in the area and began to relieve the remnants of II Corps overnight.\n30 October – 2 November\nMovement forward to the British positions was difficult in daylight, due to a lack of communication trenches, so Indian troops moved along wet ditches in the dark and conducted the relief over two nights. Exchanging two battalions took about 2½ hours and a German attack on 30 October pushed a Gurkha battalion back and exposed the flank of the neighbouring battalion until a counter-attack could be arranged to regain the line. Early on 31 October, Willcocks, the Indian Corps commander, took over from Smith-Dorrien from Givenchy to Fauquissart, who left about ten severely depleted infantry battalions and most of the corps artillery behind. The II Corps troops had been promised ten days to rest but troop movements towards Wytschaete began immediately, some on foot and some by bus. On 1 November the last seven battalions in the area were sent north to Bailleul behind III Corps. The 5th Division artillery was sent north to the Cavalry Corps by 2 November and the remaining II Corps engineer companies built more field fortifications.\nAftermath\nAnalysis\nThe French had been able to use the undamaged railways behind their front to move troops more quickly than the Germans, who had to take long detours, wait for repairs to damaged tracks and replace rolling stock. The French IV Corps moved from Lorraine on 2 September in  and had assembled by 6 September. The French had been able to move troops in up to  per day and use hundreds of motor-vehicles which were co-ordinated by two staff officers, Commandant Gérard and Captain Doumenc. The French used Belgian and captured German rail wagons and the domestic telephone and telegraph systems. The initiative held by the Germans in August was not recovered as all troop movements to the right flank were piecemeal. Until the end of the Siege of Maubeuge  only the single line from Trier to Liège, Brussels, Valenciennes and Cambrai was available and had to be used to supply the German armies on the right as the 6th Army travelled in the opposite direction, limiting the army to forty trains a day which took four days to move a corps. Information on German troop movements from wireless interception enabled the French to forestall German moves but the Germans had to rely on reports from spies, which were frequently wrong. The French resorted to more cautious infantry tactics, using cover to reduce casualties and a centralised system of control as the German army commanders followed contradictory plans. The French did not need quickly to obtain a decisive result and could concentrate on preserving the French army.\nIn 1925, the British official historian James Edmonds, wrote in the History of the Great War that from 13 to 31 October, the twelve 3rd Division battalions had been opposed by thirteen German infantry regiments, four  battalions and  regiments. The British troops had succeeded in repulsing German attacks through endurance and fire-discipline, which had multiplied the effect of a small number of troops. The German 6th Army had been reinforced and originally been intended to break through from Arras to La Bassée and Armentières, until 29 October when all available heavy artillery was transferred north for the Battle of Gheluvelt. Attacks against II Corps were reduced to holding operations and the front opposite the French at Arras was kept passive. When the Indian Corps took over, the German offensive in the area had almost ended. Edmonds wrote that in defence, soldiers sheltered in improvised positions with little protection from artillery and little barbed wire. Much of the country was wooded, which obscured large areas of the front from aeroplane observers, who spent more time grounded by the October weather. The Allied force was made up of Belgian, French and British army units and faced a homogeneous opponent with unity of command but the main German advantage was in heavy artillery and trench warfare equipment, much of which did not exist in the Allied armies.\nCasualties\n{|class=\"wikitable\"  align=right style=\"margin:0 0 1em 1em\"\n|+BEF casualties, 1914\n|-\n! Month\n! Losses\n|-\n| August||14,409\n|-\n| September||15,189\n|-\n| October||30,192\n|-\n| November||24,785\n|-\n| December||11,079\n|-\n| Total||95,654\n|-\n|}\nThe II Corps had  from 12 to 31 October. The 3rd Division had  with the 8th and 9th brigades reduced by about  The 5th Division casualties were similar and the Indian Corps up to 31 October had  On 31 October II Corps had only  of the original  establishment, of which  were inexperienced drafts. The Germans recorded  during the battles with II Corps.\nSubsequent operations\nII Corps was withdrawn for ten day's rest, from the night of  and relieved by the Indian Corps but within days, most of its battalions had to be sent to I and III corps as reinforcements. Smith-Dorrien returned to England on 10 November and Willcocks assumed command of the 14th Brigade of the 5th Division, which acted as a mobile reserve. The Indian Corps battalions came under much shellfire during the relief and remained in the front-line trenches, instead of retreating further back temporarily, a practice which had been adopted by experienced units. On 2 November, a bigger German attack north-west of Neuve-Chapelle drove a Gurkha battalion back until local counter-attacks recovered the ground by 5 October and the old trenches were filled in and abandoned.\nBy 3 November, the Indian Corps had suffered  along its  front. Some historians have written that  of Indian casualties were self-inflicted wounds, not always punished by court martial but a study by Sir Bruce Seton in 1915, found no evidence to support such an allegation. On 7 November, the 14th Brigade relieved the 8th Brigade near Laventie until 15 November. Winter operations from November 1914 to February 1915 in the II Corps area took place and were called the Defence of Festubert  Defence of Givenchy  the First Action of Givenchy  and the Affairs of Cuinchy.\nNotes\nFootnotes\nReferences\n*\n*\n*\n*\n*\n*\n*\n*\n*\n* |title=Statistics of the Military Effort of the British Empire During the Great War, 1914–1920 |author= |year=1922 |publisher=HMSO |location=London |url=https://archive.org/details/statisticsofmili00grea |access-date=18 August 2014 |oclc=610661991}}\n*\nFurther reading\n*\n*\n*\n*\n*\n*\n*\n*\nExternal links\n* [http://www.historyofwar.org/articles/battles_la_bassee.html Battle of La Bassée, 10 October – 2 November 1914]\n* [https://web.archive.org/web/20160303064236/http://www.warpath.orbat.com/battles_ff/1914.htm British order of battle]\n* [http://podcasts.ox.ac.uk/indian-sepoy-first-world-war Das, S. Podcast: Sepoys in the Great War]"
    }
  ]
}