{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Ravenna (476)\n\nBattle of Ravenna}}\n* Fall of the Western Roman Empire\n* Deposition of Romulus Augustulus\n* Kingdom of Odoacer established\n* Odoacer proclaims himself King of Italy\n| combatant1        = Germans:\n* Heruli\n* Sciri\n* Turcilingi\nSegments of the Western Roman army\n| combatant2        = Western Roman Empire\n| commander1        = Odoacer\n| commander2        = Paulus\n| strength1         = Unknown\n| strength2         = Unknown\n| casualties1       = Unknown\n| casualties2       = Unknown\n}}\nThe Battle of Ravenna, capital of the Western Roman Empire, between the Heruli under their King Odoacer and the remnants of the Western Roman army in Roman Italy occurred in early September 476, and represented a culminating event in the ongoing fall of the Western Roman Empire. The Western Roman Empire had been in relative decline since the beginning of the barbarian invasions and Rome, the symbolical heart and largest city of the Western Empire, was sacked in 410 by the Visigoths and in 455 by the Vandals. By 476 the Roman emperor was little more than a puppet, having very little de facto control of any territory outside of Italy. The last Roman emperor, Romulus Augustulus, was not recognized as a legitimate ruler outside of Italy; the Eastern Roman Empire recognized Julius Nepos as the true Western Roman Emperor.\nHerulians were foederati of the Western Roman Empire; they were mercenary troops of the Roman army of Italy. They envied the fortune of their brethren in Gaul, Spain, and Africa, whose victorious arms had acquired an independent and perpetual inheritance; and they insisted that a third part of the lands of Italy should be immediately divided among them. Orestes, the father of emperor Romulus Augustus, rejected their demand – causing their revolt. From all the camps and garrisons of Italy the confederates flocked to the standard of Odoacer, their leader; Orestes later retreated to Pavia. Pavia was subsequently pillaged and Orestes was executed.\nThe decisive battle was fought on 2 September 476 near Ravenna, the capital of the Western Roman Empire: it saw the foederati defeat the largely depleted Roman garrison. The city, defended by Paulus (the brother of Orestes) was captured swiftly and easily. Two days later, the sixteen-year-old emperor Romulus Augustulus was forced to abdicate by Odoacer. Romulus was sent into retirement in Campania.\nSee also\n* Battle of Ravenna (475)\n* Kingdom of Odoacer\nReferences"
    }
  ]
}