{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Ormskirk\n\nRoyalists\n|combatant2= Parliamentarians\n|commander1=Lord ByronViscount Molyneux\n|commander2=Sir John Meldrum\n|strength1=\n|strength2=\n|casualties1=100 killed300 prisoners\n|casualties2=\n}}\nThe Battle of Ormskirk was fought on 20 August 1644 during the First English Civil War. It was a decisive victory for the Parliamentarian force commanded by Major-General Sir John Meldrum over the Royalist force commanded by Lord Byron.\nBackground\nAfter their defeat at the Battle of Marston Moor on 2 July 1644, the remaining Royalist cavalry army abandoned the city of York to its fate and retreated over the Pennines. Prince Rupert went to Chester, and it was agreed that Richard, Lord Molyneux and Sir Thomas Tyldesley would venture north into Lancashire on a recruitment sweep. While there, they were joined by Royalist stragglers including Lord Byron, Lord Goring, and Sir Marmaduke Langdale until they numbered a force of some 2,500 horse. However, they were tracked and harried by a force of Lancastrian infantry and horse under the command of Sir John Meldrum who finally caught up with the Cavaliers on Aughton Moor (or Aughton Moss), on the hill to the south-west of Ormskirk in Lancashire on 20 August 1644.\nBattle\nThe Cavaliers, forced to make a stand, stood in battalia upon the Moor. The Roundhead infantry advanced and fired a volley upon which the Cavaliers retreated in disorder, and were then routed by a charge from the Parliamentarian horse. About three hundred Royalist prisoners were taken.\nThe Royalist commanders Byron and Molyneux were forced to leave their horses and hide in a cornfield. Had it not been late in the evening there would probably have been a greater victory for Meldrum; as it was, the scattered fragments of the defeated party made their escape into Cheshire.\nByron attributed the defeat to the poor performance of Molyneux's regiment:\n}}\nThe Perfect Diurnal, a contemporary Parliamentarian newspaper, said of the battle:\nAnother account from a letter in Perfect Occurrences, dated Manchester four days after, had the following:\nThe letter is followed by \"A List of the names of such persons of Quality as were taken near Ormskirk\":\n}}\nCitations\nReferences\n*\n*\n*\n*\nFurther reading\n*\n*\n*"
    }
  ]
}