{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Zeila (1841)\n\n| combatant1        =  Sharmarke Ali Saleh’s forces\n| combatant2        =  Sayyid Mohamed El-Barr's forces\n| commander1        =  Sharmarke Ali Saleh Mohamed Diban\n| commander2        =  Sayyid Mohamed el-Barr\n| strength1         = 2 battleships4 cannons50 musketeers\n| strength2         = 40 Yemeni matchlock men\n| casualties1       = Unknown\n| casualties2       = Entire garrison captured\n| notes             =\n}}\nThe Battle of Zeila (1841) was an armed confrontation between the Ottoman governor of Zeila and  50 Somali musketmen led by Sharmarke Ali Saleh who would end up succeeding Sayyid Mohamed el-Barr as governor of Ottoman Zeila.\nBackground\nAs a tributary of Mocha, which in turn was part of the Ottoman possessions in Western Arabia, the port of Zeila. The Ottomans based in Yemen held only nominal authority of Zeila when Haji Sharmarke Ali Saleh, a successful and ambitious Somali merchant, purchased the rights of the town from the Ottoman governor of Mocha and Hodeida. However, the previous governor was not eager to relinquish his control of Zeila, which lead to Sharmarke mobilizing troops in order to plan an assault on the city.\nBattle\nWith the town rights bought by Sharmarke, and Syed Mohammed refusing to give up his power, Sharmarke sailed two ships equipped with two to four cannons and with fifty Somali musketmen. Sayyid, then based at Al-Hudaydah, confirmed his authority, and sent to Zeila a small garrison of about 40 matchlockmen from Yemen. Sharmarke reached Zeila and tried to negotiate with Syed Mohammed, but this failed. Instead Sharmarke started to prepare for an assault on the city\nSharmarke initially only directed his cannons at the city walls, which frightened some of Al Barr's followers into fleeing. When Sharmarke actually fired his cannons, the rest of Al Barr's troops fled. The remaining fighters were defeated and routed after a short battle and Sharmarke immediately deposed the defeated governor, claiming the city for himself.\nAftermath\nDuring Sharmarke Ali Saleh's governorship of Zeila, Sharmarke's pre-existing trading activities with Southern Arabia and India continued unabated. Out of the twenty local vessels docked in Zeila, ten were owned by Sharmarke himself, with two of the ships being \"large trading dhows which convey yearly, about 300 tons of coffee and other goods\" to Bombay.\nIn the year 1855, Sharmarke was deposed by his Danakil rival, Abu Bakr, who gained control of Zeila with the support of the French. However, Sharmarke was restored to power in 1857 and became the governor of Zeila again, ruling the historic port town. Following the assassination of Henri Lambert preumably by Sharmake Ali Saleh a French Consul and naval officer Fleuriot de Langle launched a complex into the matter as Commander of the Naval Station for the East African Coasts. De Langle proposed Aboubakr Pasha as Provisional Governor. In a secret meeting with de Langle, Aboubeker requested ratification of prior negotiations with France regarding territorial occupation. He also clarified the origins of Tadjoura's customs payments to Zeila, tracing them back to agreements under Yemeni Imams and later Turkish oversight, detailing the overthrow of Sayyid Mohammed El-Barr. Sharmarke and some of his supporters were arbitrarily arrested and handed to the French navy for a trial in Constantinople (although the trial was later moved to Jeddah). However, Sharmarke died during the journey, and whether foul play was involved or not remains unknown.\nSee also\n* Ottoman Zeila\n* Habesh Eyalet\n* Richard Francis Burton\n* Sharmarke Ali Saleh\nReferences"
    }
  ]
}