{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Elizabeth City__disambig_1\n\n| combatant2  =\n| commander1  =  Stephen C. Rowan\n| commander2  =  William F. Lynch\n| strength1   = 13 gunboats\n| strength2   = Land:~34 men4 artillery piecesSea:5 gunboats1 schooner\n| casualties1 = 2 steamers damaged2 killed7 wounded\n| casualties2 = 1 steamer sunk1 armed tug captured1 steamer scuttled1 armed tug scuttled1 schooner scuttled5 killed7 wounded34 captured\n| campaignbox =\n}}\nThe Battle of Elizabeth City of the American Civil War was fought in the immediate aftermath of the Battle of Roanoke Island. It took place on 10 February 1862, on the Pasquotank River near Elizabeth City, North Carolina. The participants were vessels of the U.S. Navy's North Atlantic Blockading Squadron, opposed by vessels of the Confederate Navy's Mosquito Fleet; the latter were supported by a shore-based battery of four guns at Cobb's Point (now called Cobb Point), near the southeastern border of the town. The battle was a part of the campaign in North Carolina that was led by Major General Ambrose E. Burnside and known as the Burnside Expedition. The result was a Union victory, with Elizabeth City and its nearby waters in their possession, and the Confederate fleet captured, sunk, or dispersed.\nBackground\nAt the outset of the American Civil War, the Union sought to implement its Anaconda Plan to isolate and defeat the Confederacy.  The crucial first step was to blockade the Confederate coast to prevent access to Europe; this was relatively easy, as the pre-war navy was almost entirely from the Union states.  The Union then sought to use its naval advantage to advance the rest of the Anaconda Plan by cutting parts of the Confederacy off from one another.\nElizabeth City lies near the mouth of the Pasquotank River, where it flows into Albemarle Sound from the north. North of the city is the Dismal Swamp Canal. To the east is the southern segment of the Albemarle and Chesapeake Canal, separated from the Pasquotank River by only a narrow neck of land. Much of the food and forage delivered from North Carolina to southeastern Virginia was transported along these two canals. In particular, Norfolk, Virginia depended upon continued access to the canals for its subsistence. So long as the North Carolina Sounds remained in Confederate hands, Norfolk could be well supplied despite the blockading efforts of the Union Navy at the mouth of the Chesapeake Bay.\nThat changed, however, in early February 1862. In a battle fought on 7–8 February, the joint operation of a Union Army division under Major General Ambrose E. Burnside and a naval flotilla under Flag Officer Louis M. Goldsborough captured Roanoke Island, a position in Croatan Sound that had previously shielded the sounds from Federal encroachment. Earlier, Union ships trying to enforce the blockade on the canals would have had to enter Pamlico Sound through Hatteras Inlet, then pass several Confederate batteries on Roanoke Island before they could get into Albemarle Sound. With the elimination of the batteries, however, all that stood in the way of the Union Navy was the Mosquito Fleet of the Confederate States Navy.\nPrelude\nDefense: the Mosquito Fleet\nThe first shots of the Burnside Expedition were fired on 7 February 1862, in the Battle of Roanoke Island. On that first day of the two-day battle, a force of 19 Union gunboats bombarded, rather inconclusively, four Rebel forts facing Croatan Sound and eight ships of the Confederate States Navy. The Federal ships were parts of the North Atlantic Blockading Squadron, commanded by Flag Officer Goldsborough. The Confederate vessels were drawn from a unit led by Flag Officer William F. Lynch, termed the Mosquito Fleet, intended to serve on Albemarle Sound and nearby waters. Two vessels of the Mosquito Fleet were not present: CSS Appomattox had been sent away to Edenton for supplies and did not return in time for the battle, and schooner CSS Black Warrior was left out, presumably because she lacked the mobility that steam power gave the rest of the fleet.\nThe gunnery duel lasted from noon until sunset. The only significant casualty among the fleets was the loss of CSS Curlew, holed at the waterline and beached to avoid sinking; when Roanoke Island was surrendered the next day, she was burned in order to keep her out of Federal hands. One other ship was damaged, but not by enemy action: CSS Forrest damaged her screw by running on a submerged obstacle, and was thereafter unable to move under her own power. The remainder of the Mosquito Fleet suffered only minimal damage. They had to retire at the end of the day, with Forrest in tow, solely because they had nearly run out of ammunition.\nFlag Officer Lynch took his fleet to Elizabeth City, to resupply and to repair Forrest. Failing to find ammunition to replenish his magazines, he sent Commander Thomas T. Hunter, former captain of CSS Curlew, to Norfolk. He later sent CSS Raleigh up the Dismal Swamp Canal for the same purpose. Hunter returned with enough to resupply only two ships; Lynch divided it among all of his remaining serviceable ships. Raleigh, however, was not able to return in time.\nNo further changes of status affected the Mosquito Fleet. On the eve of battle, Lynch had at his disposal six ships in the water, each with only enough shot and powder to be able to fire ten times. His flagship, Sea Bird, carrying two guns, was a converted sidewheel steamer. Three of his other vessels were former tugs: Appomattox and Ellis, each with two guns, and Beaufort, with only one. Fanny, with two guns, had been a transport vessel used by the United States Army until she was captured by Confederate forces near Cape Hatteras. The last vessel, CSS Black Warrior, a schooner that had been pressed into service only four days before the battle, was armed with two 32-pounder guns. In addition to the eleven guns of his fleet, Lynch counted on the four guns of the Cobb's Point battery for support.\nOffense: the Union fleet\nThe surrender of Roanoke Island on 8 February included all the Rebel forts that had faced on Croatan Sound, so they would no longer be able to prevent passage of Union ships from Pamlico into Albemarle Sound. Flag Officer Goldsborough therefore ordered his gunboats to pursue the Mosquito Fleet and destroy it. Although none of his vessels had been seriously hit in the bombardment of the preceding day, some were damaged enough that he decided not to include them in his order. Fourteen ships remained, however, and they carried a total of 37 guns. Goldsborough himself did not accompany the pursuit; in his stead was Commander Stephen C. Rowan. The fourteen were all, like their Confederate counterparts, converted from civilian vessels in the first days of the war. Rowan's flagship , , , , , and  had all been sidewheel steamers before being acquired by the navy.  was also a sidewheel steamer, and like two of her opponents was a former tug. Two other sidewheel vessels,  and , had been ferries. The remaining five ships, , , , , and  were screw steamers.\nIf Captain Lynch had known that the Federal fleet faced a shortage of ammunition very much like his own, he perhaps would have altered his tactics, although the outcome would likely have been the same. As it was, Rowan ordered the captains in his fleet to conserve their ammunition. They were told to use ramming and boarding, so far as was possible, to disable or capture the enemy ships.\nOn 9 February, Rowan's gunboats passed the now-silent guns of Croatan Sound and crossed Albemarle Sound. Darkness fell as they approached Elizabeth City, so they anchored for the night.\nBattle\nLynch used the time that the Union flotilla was anchored to arrange his own ships for the coming battle. He decided to base his position on the battery of four guns at Cobb's Point, placing schooner CSS Black Warrior opposite the point, and his five remaining steamships in line across the river a short distance upstream. He took this position because he expected the Union to try to reduce the battery before proceeding, as they had done three days previously in the opening phase of the Battle of Roanoke Island. His final instructions to his captains included the order not to let the ships fall into enemy hands; if all else failed, they should try to escape, or else destroy their vessels.\nAt dawn on 10 February, Lynch made his first visit to the Cobb's Point battery, to coordinate its defense with his fleet.  He found it manned by only seven militiamen and a single civilian. Because the battery was the strong point of his planned defense, he was constrained to order Lieutenant Commander William Harwar Parker, captain of CSS Beaufort, to come ashore with most of his crew to man the guns. He left only enough on the ship to take her up the canal. With the additional men, only three of the four guns could be manned. When battle was joined, the militiamen promptly deserted; henceforth, only two guns could be used against the enemy.\nThe battery turned out to be irrelevant. Because his ammunition was low and his mission was to destroy the Rebel fleet, Rowan ordered his ships to bypass the battery. Parker and his men got off a few wild shots that did no harm, but they found that their guns would not bear once the Federal fleet was upstream. They therefore could only watch as their ships were destroyed by the attacking Federal fleet.\nFirst of the Confederate fleet to be lost was schooner Black Warrior. She was fired on by the entire attacking force as they passed the Cobb's Point battery, so her crew abandoned her and set her afire. Likewise, Fanny was run ashore and burned. A boarding party from  captured CSS Ellis in hand-to-hand combat. Her captain would have blown up Ellis but a coal heaver discovered the charges and revealed them to the boarding party. CSS Sea Bird attempted to escape, but was run down and sunk by . CSS Beaufort and Appomattox made good their escape into the Dismal Swamp Canal. There, Appomattox was found to be  too wide to pass through a lock, so she was burned. CSS Forrest, on the stocks to repair the damaged screw she had sustained on 8 February, was burned, along with an unnamed and uncompleted gunboat. CSS Raleigh was still at Norfolk, so she was not harmed. She and Beaufort were the only vessels in the Mosquito Fleet to escape either capture or destruction.\nCasualties were modest. The attacking Federal fleet lost two men killed and seven wounded, while the Rebels lost in all four killed, six wounded, and 34 captured.\nQuarter Gunner John Davis was awarded the Congressional Medal of Honor for his actions on board the  during the engagement.\nAftermath\nWhen they learned of the destruction of their fleet and the surrender of the Cobb's Point battery, Confederate troops retreating from Roanoke Island set fires in Elizabeth City, acting under orders from Brigadier General Henry A. Wise to destroy the town. About two blocks had been consumed when sailors from the Union flotilla arrived and were able to save the rest.\nThe Albemarle and Chesapeake Canal was blocked near its entrance at the North River. The retreating Rebels started the obstruction. It was completed by the victorious Federal forces, acting under the orders of Flag Officer Goldsborough.\nThe town of Edenton was taken without bloodshed on 12 February by four of Commander Cowan's gunboats. Two schooners were captured and another destroyed, and eight cannon were seized. More generally, there was no longer a Confederate presence on Albemarle Sound. It remained so for most of the rest of the war; the only significant challenge to Union dominance was the short-lived experiment of CSS Albemarle in the summer of 1864.\nAlthough Norfolk was not attacked, it was isolated and increasingly worthless to the Confederate Army. In May, the city was abandoned.\nOrder of battle\nConfederate:\nCSS Sea Bird, sidewheel steamer, flagship\nCSS Fanny, tug boat\nCSS Appomattox, tug boat\nCSS Ellis, tug boat\nCSS Beaufort, tug boat\nCSS Black Warrior, schooner\nUnion:\nUSS Delaware, sidewheel steamer, flagship\nUSS Hetzel, sidewheel steamer\nUSS Isaac N. Seymour, sidewheel steamer\nUSS John L. Lockwood, sidewheel steamer\nUSS Ceres, sidewheel steamer\nUSS Shawsheen, sidewheel steamer\nUSS Commodore Perry, sidewheel steamer\nUSS Morse, sidewheel steamer\nUSS Louisiana, screw steamer\nUSS Underwriter, screw steamer\nUSS Valley City, screw steamer\nUSS Whitehead, screw steamer\nUSS Henry Brinker, screw steamer\nNotes\nAbbreviations used in these notes:\n:ORA (Official records, armies): War of the Rebellion: a compilation of the official records of the Union and Confederate Armies.\n:ORN (Official records, navies): Official records of the Union and Confederate Navies in the War of the Rebellion.\nReferences\n*Browning, Robert M. Jr., From Cape Charles to Cape Fear: the North Atlantic Blockading Squadron during the Civil War. Tuscaloosa: University of Alabama, 1993.\n*Campbell, R. Thomas, ''Storm over Carolina: the Confederate Navy's struggle for eastern North Carolina. Nashville, TN: Cumberland House, 2005.\n*Parker, William Harwar, Recollections of a naval officer, 1841–1865.'' New York: Charles Scribner's Sons, 1883; reprint ed., Annapolis: United States Naval Institute, 1985.\n*Trotter, William R., Ironclads and columbiads: the coast. Winston-Salem: John F. Blair, 1989.\n*US Navy Department, Official records of the Union and Confederate Navies in the War of the Rebellion. Series I: 27 volumes. Series II: 3 volumes. Washington: Government Printing Office, 1894–1922.\n* US War Department, A compilation of the official records of the Union and Confederate Armies. Series I: 53 volumes. Series II: 8 volumes. Series III: 5 volumes. Series IV: 4 volumes. Washington: Government Printing Office, 1886–1901."
    }
  ]
}