{
  "content": [
    {
      "type": "text",
      "text": "# Battle of the Persian Border__disambig_1\n\nKyros IIOebaresUnknown others\n| strength1         = 60,000 cavalry3,000 chariots\n| strength2         = 50,000 cavalry100 chariotsUnknown amount of peasants defending the city walls\n| casualties1       = Heavy\n| casualties2       = Light\n}}\nThe Battle of the Persian Border was the second encounter between the forces of Media and Persia. Though not a decisive victory for Persia, it signaled the diminishing power of Media in southwest Asia. It was the first battle Cambyses I had fought in, and the first which he had fought with his son, Cyrus the Great. The first major battle, which lasted two days, was an attempt to bring freedom to Persia. It also prompted the Persians to retire south and fight a third battle.\nIt was narrated by Nicolaus of Damascus, who also mentioned the Battle of Hyrba, but Herodotus does not. Most historians on the battle consider Herodotus to be saying only the first and last battles in the war, which is partly based on the description of his two battles. This became the first major battle between the two powers at the border. Cyrus managed to escape the enemy without retreating, thus ending the battle and prolonging the struggle without a complete victory for Astyages, the king of the Medes. The next battle, the Battle of Pasargadae, became the last stand for the Persians, as their very existence relied on the outcome.\nBackground\nCyrus had retired to the border of the Median province to protect the Persian border against Astyages. After the Battle of Hyrba, Astyages invaded Persia. The battle that was to come was composed of cavalry from both sides, and chariots that in most part were used for the battle, for they were never used again. A small part of the invasion force from the Medes participated in the battle, while the Persians spent all their cavalry from their reserves. Astyages had tried to persuade Cyrus to surrender, but he now preferred to show no mercy even though he had better relations with Atradates (the variant name of Herodotus' Mitradates, which Nicolaus mistakenly uses for Cambyses, the father of Cyrus).  The name of the city that Cyrus and his father were protecting was not given.  Nevertheless, the city was an important frontier town worth protecting. When Astyages came within reach of the city, Persian civilians were ready to evacuate if necessary.  Meanwhile, Cyrus and Cambyses assembled the army, but it is not exactly known whether Oebares (who helped Cyrus to the throne) or Harpagus participated on the side of Cyrus in the battle, it is known that the original Oebares was an advisor to Cyrus. So Nicolaus, as he is known to change names around, may most likely be saying Harpagus was in the battle, as he was historically Cyrus's second in command and the only other choice available. Still, in this battle, it seems Oebares was on Cyrus's side. Then it could also be said, as Herodotus mentions, that Harpagus was the most likely candidate in this battle that occurred about a year after the first battle.  Therefore, Astyages had his special troops positioned to attack at the rear as battle began.\nMotives\nBattle\nAftermath\nAfter the first day's battle, the Persians had inflicted massive casualties on Astyages' personal guard, that was made up of cavalry, and the rest of his army, that was also cavalry. Nevertheless, the Persians still claimed victory on the first day. The second day of the battle, Cyrus, assuming the battle had ended, secretly retired south with the rest of the armed forces, while only Cambyses and a few old men remained in the city. When Cyrus was forced to fight again, Astyages' ingenious move of cavalry occurred, which was aimed at capturing the poorly guarded city. As he assumed the battle had not ended, he easily captured the city, while only Cambyses was reportedly wounded and later died. It is debated among today's historians whether the second day should be counted as part of the original battle, or it should be counted as a separate battle. As the Persians retired south, Astyages readily abandoned the city, which is based partly on the scant sources from Nicolaus, therefore not becoming a complete victory for Astyages, as he is not known to put a garrison there after he and his forces went south after the Persians. It was, however, a psychological blow to the Medes as they thought the Persians were lucky in the first battle, but again the Persians won, this time tactically. Both armies later returned to their camps and organized their armies while deciding where to meet for the next fight. Then, as the year passed, both forces agreed to meet at the Persian capital, which Astyages wished to capture.\nNotes\nReferences\n*Max Duncker, The History of Antiquity, tr. Evelyn Abbott. London, Richard Bentley & Son (1881).\n*Anderson Edward, Robert, The Story of Extinct Civilizations of the East, Published by McClure, Phillips, (1904).\n*Fischer, W.B., Ilya Gershevitch, and Ehsan Yarshster, The Cambridge History of Iran, Cambridge University Press (1993). In 1 volume.\n*Chisholm, Hugh, The Encyclopædia Britannica: A Dictionary of Arts, Sciences, Literature and General Information, Cambridge, England; New York: At the University Press, (1910).\n*Laymon, Charles M., ''The Interpreter's One Volume Commentary on the Bible: Introduction and Commentary, Abingdon Press, (1971).\n*Clare, Israel Smith. The unrivaled history of the world, containing a full and complete record of the human race from the earliest historical period to the present time, embracing a general survey of the progress of mankind in national and social life, civil government, religion, literature, science and art... Chicago, The Werner Co., (1893).\nBibliography\nClassical sources\n*Ctesias (Persica)\n*Fragments of Nicolaus of Damascus\nModern sources\n* Rawlinson, George (1885).The Seven Great Monarchies of the Eastern World, New York, John B. Eldan Press, reprint (2007) p.&nbsp;120-121. In 4 volumes.\n* Fischer, W.B., Ilya Gershevitch, and Ehsan Yarshster, The Cambridge History of Iran, Cambridge University Press (1993)  p.&nbsp;145. In 1 volume.\n* Stearns, Peter N., and Langer, William L. (2004).The Encyclopedia of World History: Ancient, Medieval, and Modern, Chronologically Arranged, Boston, Houghton Mifflin Press, (2001) p.&nbsp;40. In 6 editions.\nExternal links\n*[https://books.google.com/books?id=ms30qA6nyMsC&dq=ancient+history+battle+of+hyrba&pg=PA16   M. A. Dandamaev, A Political History of the Achaemenid Empire, tr. W. J. Vogelsang, (1989)] the battle.\n*[https://books.google.com/books?id=wYIPAAAAYAAJ&dq=battle+of+hyrba&pg=PA774  James Orr, The International Standard Bible Encyclopaedia'', Chicago, The Howard-Severance Co. (1915)] the combatants.\n* Hastings' Dictionary of the Bible other details."
    }
  ]
}