{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Papudo__disambig_1\n\n|result         = Chilean victory\n|combatant1     =\n|combatant2     =\n|commander1     =  Luis Fery\n|commander2     =  Juan Rebolledo\n|strength1      = 1 schooner3 guns\n|strength2      = 1 corvette18 guns\n|casualties1    = 4 dead22 wounded122 captured1 schooner captured\n|casualties2    = None\n}}\nThe Naval Battle of Papudo was a naval engagement fought between Spanish and Chilean forces on November 26, 1865, during the Chincha Islands War. It was fought  north of Valparaiso, Chile, near the coastal town of Papudo.\nBackground\nUntil November 1865, Chile had been the only country firm in its declaration of war against Spain, which desired to recapture its lost South American colonies. Through the efforts of its president, Mariano Ignacio Prado, Peru was subsequently galvanized into action against Spain.\nEvents of the Battle\nFamiliar with Spanish naval movements, the Chilean corvette Esmeralda, under the command of Juan Williams Rebolledo, and whose crew included Arturo Prat, Juan José Latorre and Carlos Condell, waited for any Spanish ships to appear between Coquimbo and Valparaíso.\nThe Chileans hoisted a British flag on their ship and maneuvered themselves close to the Spanish ship , under the command of Luis Fery (or Ferry), who thought that the ship may have been one of the similarly built British vessels Shearwater, Colombina, or Mutine. The Esmeralda opened fire on the Covadonga, which returned fire, but the Chilean gunners proved more skillful. The Covadonga received severe hits that incapacitated its crew, causing the Spaniards to attempt a retreat. The Esmeralda followed her, maintaining fire. Fery called out his surrender to Williams Rebolledo, who ordered Manuel Thomson to take possession of the Spanish ship. Chilean engineers then worked to save the captured vessel, the success of which is considered to be a high point in the Chincha Islands War for the Chileans. The events of the battle lasted only half an hour.\nAftermath\nIn addition to Commander Fery, six Spanish officers, and 115 sailors were taken as prisoners. The Chileans also captured the correspondence of Spanish Admiral Juan Manuel Pareja. This action, together with the general failure of Spanish operations during the Chincha Islands War, led to Pareja committing suicide on board his flagship, the screw frigate , on 28&nbsp;November&nbsp;1865.\nCovadonga, now a vessel in the Chilean Navy, later saw combat in the Battle of Iquique during the War of the Pacific.\nExternal links\n* [https://web.archive.org/web/20051024045639/http://www.armada.cl/arm_tradicion_hist/site/artic/20030513/pags/20030513135801.html Description of the battle]\nReferences"
    }
  ]
}