{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Djicoroni\n\n33rd Parachute Commando Regiment (Red Berets)\n| combatant2        =  Malian Ministry of Defense\n*National Guard of Mali\n*Malian Air Force\n*Gendarmerie Nationale (Mali)\n| casualties3       = 2–6+ killed13+ injured (mostly civilians)\n}}\nOn February 8, 2013, fighting broke out between the Red Berets of Mali's 33rd Parachute Commando Regiment and the Green Berets in the military camp in Djicoroni, Bamako, Mali. The  Red Berets supported the regime of Amadou Toumani Touré, who was overthrown in a coup led by Amadou Sanogo and supported by the Green Berets in 2012.\nBackground\nAmadou Sanogo overthrew the administration of Malian president of Amadou Toumani Touré (ATT) in 2012 due to grievances within the army, police, and national guard over ATT's lackluster handling of the Tuareg rebellion in 2012. The Red Berets of Mali's 33rd Parachute Commando Regiment, one of the most elite military units in Mali, supporting the ousted ATT, launched a counter-coup in Kati in April 2012, but failed.\nOn January 30, 2013, twenty-nine prisoners from the counter-coup attempt, including twenty-six soldiers and three civilians, were released from Malian detention. One of those released was Malamine Konaré, son of former Malian president Alpha Oumar Konaré. Twenty putschists remained imprisoned however, with their families organizing a protest at the Malian military camp in Djicoroni on January 31 to free them. Remaining red berets sent a message to president Dioncounda Traoré, requesting authorization to be sent to northern Mali to fight the jihadist insurgency.\nOn Malian national television, General Tahirou Dembélé stated that the Red Berets will be sent north to fight the Islamists alongside French forces, although in different units. Red Berets who did not oblige would be disbanded from the regiment. 417 men joined the front alongside the French, but 800 remained in Bamako out of protest.\nBattle\nClashes broke out at the Djicoroni military camp on February 8, where the Red Berets lived with their families. Both Red Berets and Green Berets blamed the other for instigating the clashes. The Malian Ministry of Defense stated that the Red Berets were revolting due to the \"disciplinary measures\" against them, while the Red Berets stated Green Berets planned and conducted the attack in defense of Sanogo.\nA doctor living in the camp stated that troops of the Malian National Guard and national police invaded the camp around 5am. He stated that the Green Berets and allies \"fired warning shots into the camp. Then, an 18-year-old was shot and killed. There were five women and around ten children injured by bullets.\" Women and children blocked the entrance to the camp by the Green Berets and allies, after they claimed they needed \"to secure it.\" As tensions increased, one protestor stated that the Green Berets would enter the camp \"over our dead bodies.\" This sparked clashes as the women and children picked up sticks and stones, and the Green Berets shot at them. Elements of the National Guard, Gendarmerie, the Malian Air Force, and Green Berets took part in the attack, using BRDM-2's.\nAnother source reported that shots first broke out in the camp around 7am, and the clashes continued until midday. A local resident testified that Green Berets arrived and surrounded the camp. Women and children were chased out of the camp, following Green Berets. Police present at the scene did not shoot, and just ran off. Further reinforcements arrived at the camp around 7am, sparking the battle.\nAftermath\nThe first assessment detailed by a Malian official stated that one person was killed and six were wounded. Both sides had injuries, but the dead soldier was a Red Beret. A civilian nearby stated that three people were killed, a boy and two women. Five women were injured in the crossfire as well. A Malian government press release later stated that two teenagers were killed and thirteen were injured. The Red Berets stated that six people were killed, including two women and four teenagers. Another Malian military official stated that three soldiers were killed between both sides.\nPresident Dioncounda Traoré urged calm between the two sides, and a French mission that arrived in Bamako that same day stated the \"army was in a state of despair.\" Malian junta officials arrested various Red Berets, with General Yamoussa Camara siding with Sanogo on a military crackdown on the Red Berets, labeling them as deserters. Prime Minister Django Sissoko led political negotiations with the Red Berets in the days after the battle. Sissoko on February 15 stated that the Red Berets would no longer be disbanded, and instead \"restructured\".\nExternal links\n* [https://webarchive.archive.unhcr.org/20230527190635/https://www.refworld.org/docid/512b60862.html ''Red Berets, Green Berets: Can Mali's Divided Military Restore Order and Stability?'' - Jamestown Foundation, February 22, 2013]\nReferences"
    }
  ]
}