{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Civitate__disambig_1\n\n*Byzantine Empire\n**Swabians\n**Italians\n**Lombards\n| commander1        = Humphrey of HautevilleRobert GuiscardRichard Drengot\n| commander2        = Rudolf of BeneventoGerard of LorrainePope Leo IX\n| strength1         = 3,000 horsemen' 500 infantry\n| strength2         = ' 6,000, infantry and horsemen\n| casualties1       =\n| casualties2       =\n}}\nThe Battle of Civitate was fought on 18 June 1053 in southern Italy, between the Normans, led by the Count of Apulia Humphrey of Hauteville, and a Swabian-Italian-Lombard army, organised by Pope Leo IX and led on the battlefield by Gerard, Duke of Lorraine, and Rudolf, Prince of Benevento. The Norman victory over the allied papal army marked the climax of a conflict between the Norman mercenaries who came to southern Italy in the eleventh century, the de Hauteville family, and the local Lombard princes. By 1059 the Normans would create an alliance with the papacy, which included a formal recognition by Pope Nicholas II of the Norman conquest in south Italy, investing Robert Guiscard as Duke of Apulia and Calabria, and Count of Sicily.\nBackground\nThe arrival of the Normans in Italy\nThe Normans had arrived in Southern Italy in 1017, in a pilgrimage to the sanctuary of St. Michael Archangel in Monte Sant'Angelo sul Gargano (Apulia). These warriors had been used to counter the threat posed by the Saracens, who, from their bases in Sicily, raided South Italy without much resistance from the Lombard and Byzantine rulers of the affected lands.\nThe availability of this mercenary force (the Normans were famous for being militariter lucrum quaerens, \"seeking wealth through military service\") could not escape the notice of the Christian rulers of Southern Italy, who employed the Normans in their internal wars. The Normans took advantage of this turmoil; in 1030, Rainulf Drengot obtained the County of Aversa.\nAfter this first success, many other Normans sought to expand into Southern Italy. Among their most important leaders were Hauteville family members. In short time, the Hauteville created their own state: William Iron Arm became, in 1042, Count of Apulia.\nThe anti-Norman coalition\nThe Norman advances in southern Italy had alarmed the papacy for many years, though the impetus for the battle itself came about for several reasons. First, the Norman presence in Italy was more than just a case of upsetting the power balance, for many of the Italian locals did not take kindly to the Norman raiding and wished to respond in kind, regarding them as little better than brigands. An abbot from Normandy, John of Fécamp, for example wrote of such local sentiments in a letter to Pope Leo himself:\n}}\nThe raiding activities which brought about such hatred also occurred in the see of Benevento, a deed not emphasized in the Norman chronicles, but for Pope Leo this was the more significant concern in the political instability of the region. In fact, according to Graham Loud, the Beneventians, who previously had been approached by both the German Emperor Henry III and by the Pope previously to swear fealty, finally appealed and submitted to Leo to personally take over the control of the city (as well as lifting a previous excommunication) in 1051. At this point, Benevento was also the border and march land between Rome and the German Empire and the newly established Norman holdings.\nThe second reason behind the conflict of Civitate was the instability brought about on the Norman side by the murder in unclear circumstances of Drogo de Hauteville, who up to that time had been the nominal war leader of the Normans and Count of Apulia. According to Malaterra's account, the native Lombards were responsible for the plot, and a courtier named Rito committed the deed at the castrum of Montillaro. Despite the benefit the pope and both Greek and German emperors would have drawn from his murder, it is difficult to speculate beyond Malaterra's report since the details of the murder do not appear in most other sources, particularly the Norman chronicles. Nevertheless, there was certainly a strong reaction to Drogo's death, with his brother Humphrey taking over the leadership position and in response scoured the countryside for his enemies:\nFinally, in 1052, Leo met his relative Henry III, Holy Roman Emperor in Saxony, and asked for aid in curbing the growing Norman power. Initially, substantial aid was refused and Leo returned to Rome in March 1053 with only 700 Swabian infantry. Adalbert II, Count of Winterthur (modern day Switzerland), their leader, raised the 700 Swabian knights from the very House out of which the House of Kyburg would later emerge. The Duchy of Swabia, at the time, included most modern day German-speaking Cantons of Switzerland.\nBut there were others worried about the Norman power, in particular the Italian and Lombard rulers in the south. The Prince of Benevento, Rudolf, the Duke of Gaeta, the Counts of Aquino and Teano, the Archbishop and the citizens of Amalfi — together with Lombards from Apulia, Molise, Campania, Abruzzo and Latium — answered the call of the Pope, and formed a coalition that moved against the Normans. However, while these forces included troops from almost every great Italian magnate, they did not include forces from Prince of Salerno, who would have gained more than the others from a Norman defeat.\nThe Pope had also another friendly power, the Byzantine Empire ruled by Constantine IX. At first, the Byzantines, established in Apulia, had tried to buy off the Normans and press them into service within their own largely mercenary army; since the Normans were famous for their avarice. So, the Byzantine commander, the Lombard Catepan of Italy Argyrus, offered money to disperse as mercenaries to the Eastern frontiers of the Empire, but the Normans rejected the proposal, explicitly stating that their aim was the conquest of southern Italy. Thus spurned, Argyrus contacted the Pope, and when Leo and his army moved from Rome to Apulia to engage the Normans in battle, a Byzantine army personally led by Argyrus moved from Apulia with the same plan, catching the Normans in a pinch.\nThe Normans understood the danger and collected all available men and formed a single army under the command of the new Count of Apulia and Drogo's eldest surviving brother, Humphrey of Hauteville, as well as the Count of Aversa, Richard Drengot, and others of the de Hauteville family, amongst which was Robert, later known under the name of Robert Guiscard.\nThe battle\nDespite several contemporary sources of the background and lead-up to the battle, the narrative source which gives the most detail of the battle itself is the Gesta Wiscardi of William of Apulia.\nTo begin with, Leo moved to Apulia, and reached the Fortore River near the city of Civitate (or Civitella, northwest of Foggia). The Normans went forth to intercept the Papal army near Civitella and prevent its union with the Byzantine army, led by Argyrus. The Normans were short on supplies because of the harvest season, and had fewer men than their enemies, with no more than 3,000 horsemen and 500 infantry against 6,000 horsemen and infantry. Both Amatus' account and William of Apulia agree that the Normans were suffering from hunger and lack of nutrition, and both also add that the Normans forces were in fact so lacking that they, \"by the example of the Apostles took the heads of grain, rubbed them in their hands, and ate the kernels,\" some may have cooked them over the fire beforehand as well.  Because of this, the Normans were driven to ask for a truce, but were refused, though there is some disagreement on who the greater enemies of the Normans were in refusing the negotiations, varying between the Lombards, the Germans, and the curia of Pope Leo himself, whom the Normans in fact wished to swear their fidelitas.\nThe two armies were divided by a small hill. The Normans put their horsemen in three companies, with the heavy cavalry of Richard of Aversa on the right, Humphrey with infantry, dismounted knights and archers in the center, and Robert Guiscard, with his horsemen and his infantry (the sclavos, the Slavic infantry), on the left. Other Norman commanders included  Peter and Walter, the illustrious sons of Amicus, Aureolanus, Hubert, Rainald Musca, and Count Hugh and Count Gerard, who commanded respectively the Beneventans and the men of Telese, and also Count Radulfus of Boiano.   In front of them, the Papal army was divided into two parts, with the heavy Swabian infantry on a thin and long line from the center extending to the right, and the Italian levies amassed in a mob on the left, under the command of Rudolf. Pope Leo was in the city, but his standard, the vexillum sancti Petri, was with his allied army.\nThe battle started with the attack of Richard of Aversa against the Italians on the left with a flanking movement and charge. After moving across the plain, they arrived in front their opponents, who broke formation and fled without even trying to resist. The Normans killed many of them as they retreated and moved further towards the Papal field-camp, before eventually attempting to return to the main engagement.\nThe Swabians, in the meantime, had moved to the hill, and came into contact with the Norman center and the forces of Humphrey, skirmishing with arrows and archers before entering a general melee. Most likely, this engagement was primarily on foot, as the Germans are often referred to as \"taking up their swords and shields\", William of Apulia adds that this was a part of their German character:\n}}\nThe fight with the Swabians was the main focus of much of the battle, with the Normans attempting to flank the Swabians while Humphrey engaged them. Robert Guiscard, seeing his brother in danger, moved with the left wing to the hill, and succeeded in easing the Swabian pressure, and also displayed his personal bravery with the aid of the Calabrians under the command of Count Gerard.\nThe situation on the center however, remained balanced. Yet thanks to the continued Norman discipline in holding the line against the Swabians, the day was at last decided by the return of Richard's forces from pursuing the Italians, which resulted in the defeat of the Papal coalition.\nAftermath\nAfter preparing a siege of the town of Civitate itself, the Pope was taken prisoner by the victorious Normans.\nThere is some uncertainty over how this happened. Papal sources say that Leo left Civitate and surrendered himself to prevent further bloodshed. Other sources including Malaterra indicate that the inhabitants of Civitate handed over the Pope and drove him \"out of the gates,\" after seeing the Norman threat manifested in siege towers and earthen ramparts.  He was treated respectfully but was imprisoned at Benevento for almost nine months, and forced to ratify a number of treaties favorable to the Normans. However, according to the Norman accounts, Leo was treated more as an honored guest than as a prisoner, and by no means lacked for comforts, Amatus claims that \"they continually furnished him with wine, bread, and all the necessities,\" and was \"protected\" by the Normans until he returned to Rome ten months later. According to John Julius Norwich, Leo attempted a long, passive resistance to agreeing to anything for the Normans, and was waiting for an imperial relief army from Germany. In addition, Norwich believes that despite the lack of concrete support until later popes, Leo did eventually acknowledge the Normans as the rulers of the South in order to get a release for his freedom. Meanwhile, Argyros and the Byzantine army were forced to disband and return to Greece via Bari, since their forces were not strong enough to fight the Normans now that the papal forces had been defeated. Argyros may even have been banished from the Empire by Constantine himself.\nMore importantly, the Battle of Civitate proved to be a turning point in the fortunes of the Normans in Italy, who were able to win a victory despite their differences even among themselves, and solidifying their legitimacy in the process. Not only that, it was the first major victory for Robert Guiscard, who would eventually rise to prominence as the leader of the Normans in the South. In terms of its implications, the Battle of Civitate had the same long-term political ramifications as had the Battle of Hastings in England and Northern Europe, a reorientation of power and influence into a Latin-Christendom world. Finally, while Leo attempted to maintain an anti-Norman alliance with the Byzantines in hopes of driving them out on religious grounds, the inability of the papal legates to negotiate with the Greek court in addition to Leo's untimely death negated any hope for aid from the Byzantines, except at the command of the Eastern emperor himself. The schism, in this case, worked to the favor of the Normans at least in the political realm.\nAfter six more years, and three more anti-Norman popes, the Treaty of Melfi (1059) marked the recognition of the Norman power in South Italy. There were two reasons for this change in papal politics. First, the Normans had shown themselves  to be a powerful (and nearby) enemy, whereas the emperor was a weak (and far off) ally. Second, Pope Nicholas II had decided to cut the bonds between the Roman Church and the Holy Roman emperors, reclaiming for the Roman cardinals the right to elect the pope (see Investiture Controversy), thus reducing the importance of the emperor. And in the foreseeable struggle against the Empire, a strong ally was more desirable than a strong enemy.\nReferences\nSources\nPrimary sources\n*[https://web.archive.org/web/20150107181751/http://www.medievalsicily.com/Docs/05_links/Chronicles.htm medievalsicily.com The Medieval Mediterranean Islamic and Norman Sicily (800–1200)], Chronicles and Narrative Sources with English translations by Graham Loud\n*Amatus of Montecassino (translated by Prescott N. Dunbar and edited by Graham Loud). The History of the Normans. Rochester: The Boydell Press, 2004.\n*Gaufredo Malaterra, [http://www.thelatinlibrary.com/malaterra.html De rebus gestis Rogerii Calabriae et Siciliae comitis et Roberti Guiscardi ducis fratris eius] at The Latin Library\n*William of Apulia, [http://www.thelatinlibrary.com/williamapulia.html Gesta Roberti Wiscardi] at The Latin Library\nSecondary sources\n*\n*Eads, Valerie. \"Civitate, Battle of,\" in The Oxford Encyclopedia of Medieval Warfare and Military Technology. Edited by Clifford J. Rogers. Vol. 1. Oxford: University Press, 2010. pp.&nbsp;402–403.\n*Chalandon, Ferdinand. Histoire de la domination normande en Italie et en Sicilie. Paris: 1907.\n*Joranson, Einar. \"[https://www.jstor.org/stable/2848427 The Inception of the Career of the Normans in Italy: Legend and History.]\" Speculum, Vol. 23, No. 3. (Jul., 1948), pp.&nbsp;353–396.\n*Le Patourel, John. \"Normans and Normandy,\" in Dictionary of the Middle Ages. Edited by Joseph R. Strayer. Vol. 9. New York: Charles Scribner's Sons: New York, 1989. pp.&nbsp;159–170.\n*Loud, Graham Alexander. \"Continuity and change in Norman Italy: the Campania during the eleventh and twelfth centuries.\" Journal of Medieval History, Vol. 22, No. 4 (December, 1996), pp.&nbsp;313–343.\n*Loud, Graham Alexander. \"How 'Norman' was the Norman Conquest of Southern Italy?\" Nottingham Medieval Studies, Vol. 25 (1981), pp.&nbsp;13–34.\n*Loud, Graham Alexander. The Age of Robert Guiscard: Southern Italy and the Norman Conquest. New York: Longman, 2000.\n*Meschini, Marco, Battaglie Medievali, pp.&nbsp;13–36.\n*Norwich, John Julius. The Other Conquest. New York: Harper and Row, 1967.\nExternal links\n*[https://web.archive.org/web/20120205212130/http://www.norman-world.com/angleterre/index.htm The Normans, a European People], by the European Commission\n*[http://www.storiaonline.org/normanni/breve.htm Breve Chronicon Northmannicum] (Latin).\n*[https://web.archive.org/web/20090326114613/http://www.jerseyheritagetrust.org/edu/resources/pdf/normans.pdf The Normans] Jersey heritage trust\n*Patrick Kelly [http://www.albion-swords.com/articles/norman.htm The Normans: their history, arms and tactics]"
    }
  ]
}