{
  "content": [
    {
      "type": "text",
      "text": "# Battle Formation__disambig_1\n\n| prilithology   = Mudstone, clay\n| otherlithology = Siltstone, sandstone\n| namedfor       =\n| namedby        = G.M. Furnival, 1955\n| region         = Alberta\n| country        = Canada\n| coordinates    =\n| unitof         = Edmonton Group\n| subunits       = Kneehills Tuff\n| underlies      = Scollard Formation\n| overlies       = Whitemud Formation, Wapiti Formation\n| thickness      =\n| extent         =\n| area           =\n| map            =\n| map_caption    =\n}}\nThe Battle Formation is a geologic formation of Late Cretaceous (Maastrichtian) age in the Western Canada Sedimentary Basin. It is present throughout much of the central Alberta plains, where it is an important stratigraphic marker in the nonmarine Upper Cretaceous sequence. It was formally named by G.M. Furnival in 1942 and given formation status by E.J.W. Irish in 1970.\nStratigraphy\nThe Battle Formation forms part of the Edmonton Group. A marker bed called the Kneehills Tuff is present in the upper part of the formation.\nLithology\nThe Battle Formation is easily recognized in outcrop and in geophysical well logs. It consists of distinctive mauve-grey to purplish brown mudstones with minor siltstone and rare sandstone. The mudstones contain a large component of volcanic ash that has been altered to bentonitic and montmorillonitic clay, and they form a porous, popcorn-like crust upon weathering. The Kneehills Tuff bed consists of brown-grey, hard siliceous rock.\nThickness and Distribution\nThe Battle Formation is reaches thicknesses of up to about , but in some areas it was partially or completely removed by erosion prior to or during the deposition of the overlying Scollard Formation. The Kneehills Tuff occurs as one bed about  to  thick, or as two or three beds each about  to  thick in the upper part of the Battle.\nRelationship to Other Units\nThe Battle Formation unconformably overlies the Whitemud Formation. It is overlain by the Scollard Formation and the contact is erosional in some areas where basal Scollard paleochannels have cut into or eroded through the Battle. In other areas the contact may be conformable. In the southern Alberta plains it is overlain, apparently conformably, by the Willow Creek Formation, and in Saskatchewan it is overlain by the Frenchman Formation.\nThe Battle Formation is equivalent to part of the St. Mary River Formation in the southern Alberta plains and is correlative with part of the Brazeau Formation in the foothills of the Alberta Rockies. It is correlated with the part of the Fox Hills Formation in Montana and North Dakota.\nPaleontology\nThe Battle Formation is thought to have been deposited in sediment-starved lacustrine and marsh environments. It is poorly fossiliferous, but arthropods including insects and arachnids preserved in amber, spores, bone fragments, algal remains and carbonized wood have been reported.\nReferences"
    }
  ]
}