{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Isted__disambig_1\n\n| commander1  = 22px Karl Wilhelm von Willisen\n| commander2  =  Gerhard Christoph von Krogh Friderich Adolph Schleppegrell\n| strength1   = 26,800\n| strength2   = 37,000\n| casualties1 = 2,808 killed, wounded or captured\n| casualties2 = 3,615 killed, wounded or captured\n| casualties3 =\n| notes       =\n}}\nThe Battle of Isted (; ) took place on 25 July 1850 near the village of Idstedt (Danish: Isted), in what is today Schleswig-Holstein, Germany. The battle was part of the First Schleswig War. The Danes won the battle.\nThe battle began early in the morning at around 2:00 and lasted until 19:00.  The Danish took 1,072 unwounded and 411 wounded prisoners. The Danish victory failed to break the Schleswig-Holsteinian army, and the war continued until 1851.\nThe Isted Lion commemorates the battle, which was at its time the largest in Scandinavian history.  The battle's anniversary, 25 July, is a military flag day in Denmark.\nN. F. S. Grundtvig's song \"Det var en sommermorgen\" (\"It was a summer morning\") touches on the battle of Isted.\nBackground\nAs a result of pressure from the major European powers, Schleswig-Holstein stood alone in the summer of 1850. The Danish High Command had no overall plan for the coming campaign in 1850, but during July a number of reports were received that the Schleswig-Holsteinian army had taken up positions north of the town of Schleswig. The Danish High Command now saw a chance to defeat the rebels in a last, decisive battle. Just like the Danes, the Schleswig-Holsteinian High Command hoped to lure the Danish army into giving battle at Isted and being defeated. The two armies were in many respects equal. Though the Danish army was considerably larger, the Schleswig-Holsteinian army held a strong defensive position.\nBattle\nThe battle began early in the morning of 24 July, when the Danish vanguard clashed with the Schleswig-Holsteinian outposts and pickets. During the day, the Schleswig-Holsteinian troops were pushed back all along the line. The fighting of the day climaxed in a larger engagement at the Helligbæk (a stream) that involved substantial forces on both sides.\nThe battle proper began on the night of 24 July when the Danish main force attacked. During the early morning hours of 25 July, fighting raged back and forth at several places, including Bøgmose, north of Isted Lake, as well as Grydeskov between Isted Lake and Langsø. To the east, between Bøglund and Nørre Farensted, Danish troops pushed back the Schleswig-Holsteinian troops, who then fell back and took up position at Vedelspang.\nAbout this time, the weather dramatically changed. The previous days of warm weather, was suddenly replaced by heavy mist and pouring rain, which made it almost impossible for the officers on both sides to maintain an overview of the battlefield and their forces. At 5&nbsp;am, the Schleswig-Holsteinian army took the initiative and two brigades counter-attacked the Danish troops at the village of Stolk and, around 6&nbsp;am, against the Danes in Isted. At Stolk the Danish forces were pushed back in disarray and during the frenzied fighting, Danish General F. A. Schleppegrell fell. After their success at Stolk, the Schleswig-Holsteinian army continued their advance and attacked Isted town. The fighting soon devolved into house-to-house fighting. The Danish Division Reserve were sent forward, and around 7:45&nbsp;am the Danish forces managed to first stop, and then counter attack the Schleswig-Holsteinians. During the fighting the Danish Colonel Baggesen sent a series of alarming messages to General Krogh and his staff, which caused General Krogh to cancel an ongoing flanking maneuver west of the battlefield. By chance, the Schleswig-Holsteinian army had escaped an attack that would have surprised their troops at a critical time.\nAround noon, General Krogh ordered a general advance. The Danish infantry attacked without support of the cavalry and without preliminary fire from the artillery. Despite this, the timing of the attack was fortunate. As the attack began, the Schleswig-Holsteinian artillery was being withdrawn from their current positions, preventing them from firing on the advancing Danes. Around 2:15&nbsp;pm, General Krogh ordered a cavalry brigade forward to attack the enemy in the center.\nThe fierce fighting was described by William Howard Russel, correspondent for The Times:\nThe firing was now heavier than ever, and at last the Schleswig-Holsteinian center gave way and retreated towards Schleswig: the right wing bent back and retired towards the town while the left fell back through the open ground to the west. At the time of the Danish cavalry attack at 2.15&nbsp;pm, the Schleswig-Holsteinian army was in full retreat, but they were not molested for long during their retreat as the cavalry pursuing them south of Husby, inexplicably and suddenly, retreated after only a minor skirmish. Despite the withdrawal of the cavalry brigade the Danish advance continued. By late afternoon the Danes reached Skovby and the town of Schleswig, which was quickly occupied while the Schleswig-Holsteinian army retreated, ending the battle.\nAftermath\nThe Danish victory at Isted had not been the decisive victory the Danish High Command had hoped it would be, and Danish losses exceeded those of Schleswig-Holstein. While defeated, the Schleswig-Holsteinian army had escaped to fight another day and the war continued. In September the Schleswig-Holsteinians launched an attack at Mysunde, which was repulsed by the Danes. In October, the Danes managed to thwart the siege of Frederiksstad, but again failed to defeat the Schleswig-Holsteinians. The war then entered a lull until January 1851, when the Great Powers finally pressured both sides to end the war, and the Provisional Schleswig-Holstein government and its army disbanded.\nThe course of the battle was largely affected by the difficult weather conditions during which the battle was fought. Still, senior officers on both sides have since been criticized for their actions during the battle. On the Danish side these were Colonel Baggesen and General Flindt. Baggesen was criticized for his frantic messages to the army commander after the death of General Schleppegrell, which caused the flanking attack that could have secured a major victory to be called off. Flindt, commander of the cavalry brigade, was criticized for half-hearted pursuit of the Schleswig-Holstein army after the noon attack. Had he pursued  with greater vigor, the enemy could have suffered considerable losses. These criticisms, however, are likely based on a good deal of hindsight. Overall, the determining factor in the Danish victory was the superiority of the Danish infantry in morale and training.\nThe Battle of Isted was the largest in the history of the Nordic countries until the Winter War of 1939-1940. In the years after the First Schleswig War, Isted became a symbol of the Danish victory. In memory of the battle, the famous Isted Lion was erected on the cemetery of Flensburg where many of the fallen soldiers were buried.\nMaps\nFile:Idsted-Isted in Schleswig-Holstein.png|Location of Idstedt/Isted in present-day Schleswig-Holstein, Germany. Dark grey: present-day Denmark.\nFile:Istedstillingen.png|Idstedt/Isted in 1850\nReferences"
    }
  ]
}