{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Sidi Ali Ben Aoun\n\nSidi Ali Ben Aoun, Tunisia\n| map_type          = Tunisia\n| map_mark          = red_pog.svg\n| coordinates       =\n| combatant1        =  Tunisian National Guard\n| combatant2        =  Ansar al-Sharia\n| date              = October 23, 2013\n| commander1        = • Imed Hizi †\n• Socrates Cherni †\n| strength1         = Unknown\n| strength2         = ~20 men\n| commander2        = Unknown\n| casualties1       = 6 dead\n4 injured\n| casualties2       = 3\n}}\nThe Battle of Sidi Ali Ben Aoun was a conflict that took place in Tunisia on 23 October 2013, between the Tunisian National Guard and jihadists from Ansar al-Sharia during the Jihadist insurgency in Tunisia.\nProcedure\nOn October 23, 2013, men of the Tunisian National Guard reach a house in the small town of Sidi Ali Ben Aoun where people suspected of being jihadists have been reported. The officers were about to search the building when armed men open fire on them. Estimated at twenty men divided into two groups hidden in trenches dug around and near the house, the jihadists engage in the shooting when the gendarmes receive reinforcements. Three jihadists were killed during the engagement.\nMedia and investigation\nAfter the confrontation, the police discovered a car bomb being constructed, as well as weapons and explosives. Mohamed Ali Aroui, spokesman for the Ministry of the Interior, said: “We seized weapons, explosives, two explosive belts and a car bomb containing three cylinders ready to explode”. TNT and ammonium nitrate were also discovered according to the spokesperson, who also stated that a suspect was on the run.\nThe day after, the building where the encounter took place was destroyed along with the car bombs. A corpse with an explosive belt is then discovered as well. On the 25th, the security forces discovered numerous weapons concealed in a well near the house, fifteen people suspected of being linked with the jihadists were also arrested.\nThere are six police officers killed, four injured and an armed man killed according to the spokesman. The bodies of the six national guards are buried the next day and were identified as: Imed Hizi, head of the anti-terrorism unit, First Lieutenant Socrate Cherni (brother of Majdouline Cherni), First Corporals Mohamed Marzouki and Anis Salhi, Corporals Ridha Nasri and Tahar Chebbi.\nReferences"
    }
  ]
}