{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Spicheren__disambig_1\n\n|caption= \"Bataille de Forbach\" by Jean-Adolphe Bocquin after Jules Férat\n|date=6 August 1870\n|place=Spicheren, France\n|coordinates=\n| map_type    = France Grand Est\n| map_relief  = Yes\n| map_size    =\n| map_marksize =\n| map_caption = Grand Est Region\n| map_label   = Spicheren\n|result=German victory\n|combatant1= North German Confederation\n* Prussia\n|combatant2= France\n|commander1= Karl Friedrich von Steinmetz\n|commander2= Charles Auguste Frossard\n|strength1=37,000}}\n|strength2=29,000\n|casualties1=843 killed3,656 wounded372 captured\n|casualties2=1,982 killed or wounded2,096 captured\n|}}\nThe Battle of Spicheren, also known as the Battle of Forbach, was a battle during the Franco-Prussian War. The German victory compelled the French to withdraw to the defenses of Metz. The Battle of Spicheren, on 6 August, was the second of three critical French defeats. General (later field marshal) Helmuth von Moltke had originally planned to keep Bazaine's army on the Saar river until he could attack it with the 2nd Army in front and the 1st Army on its left flank, while the 3rd Army closed towards the rear. The aging General von Steinmetz made an overzealous, unplanned move, leading the 1st Army south from his position on the Moselle. He moved straight toward the town of Spicheren, cutting off Prince Frederick Charles from his forward cavalry units in the process.\n, 1890.]]\nBackground\nThe French declared war before their troops were in position to invade Germany. The Germans, commanded by Field Marshal von Moltke, began to assemble into three armies, which were to invade France and to occupy Paris. On 4 August they crossed the frontier, where 3rd Army conquered the walled city of Wissembourg. Two days later they defeated the French again at Wörth. On the same day 2nd Army was marching westward, even though one of its corps was still on the railroad.\nWhen Napoleon III arrived to take command of the French field army, he followed the urging of his generals and ordered General Lebœuf to besiege Saarbrücken.  Following a vigorous defense the outnumbered Germans evacuated the city, which the French occupied without crossing the river Saar. Lebœuf had been warned by his chief Intendant, Charles Joseph Francois Wolff, not to cross the Saar because they would be unable to supply men on the further bank.  Therefore, the armies of France, led by Field Marshal Bazaine, took up defensive positions that would protect against every possible attack, but which also left their armies unable to support one another.\nMoltke assembled his forces into two wings. On the right, 2nd Army, with 134,000 men under Prince Frederick Charles of Prussia containing the III, IV, IX, X, XII Corps, and the Prussian Guard, advanced towards Saarbrücken.  The 1st Army's 60,000 men under General Steinmetz, consisting of  the I, VII and VIII Corps, was moving in line with  2nd Army from the lower Moselle river towards Saarlouis.\nPrelude\nThe Germans crossed the frontier on 4 August.  They encountered lively opposition before the walls of Wissembourg which they subdued by bringing up artillery,\nThis battle had not been planned by Moltke, who wished to keep Bazaine's army along the Saar river until he could attack it with the 2nd army in front and 1st army on its left flank, while 3rd army was closing towards its rear. However, General von Steinmetz disobeyed and made an overzealous, ill-considered move, leading 1st army south from his position on the Moselle straight toward the town of Spicheren, in the process cutting Prince Frederick Charles off from his forward cavalry units. The 1st Army advance guard, the (14th Division, VII Corps) under General Georg von Kameke advancing west from Saarbrücken on the morning of 6 August found the bridges still intact and seized the opportunity to occupy the high ground just beyond the town. The French II Corps under General Frossard had abandoned these heights in order to take up what he considered to be a position magnifique, a fortified line between Spicheren and Forbach. Frossard distributed his corps as follows: holding the right and centre was the 3rd Division of General Laveaucoupet, which was deployed along the heights, with two companies entrenched on the Rotherberg. On the French left General Charles Nicolas Vergé's 1st Division occupied Stiring and the Forbach valley. General Bataille’s division was held back in reserve around Spicheren; in all, counting the corps cavalry and artillery, some 27,000 men with 90 guns.\nBattle\nWhile the French army under General MacMahon engaged the German 3rd Army at the Battle of Wörth, the German 1st Army under Steinmetz advanced west from Saarbrücken. Early on the 6th, a patrol from the German 2nd Army under Prince Friedrich Karl of Prussia spotted decoy fires ahead and saw Frossard's army farther off on a plateau south of the town of Spicheren. Ignoring Moltke's instructions, both German armies attacked Frossard's French II Corps fortified line.\nKameke believed that Frossard's Corps was retreating: hence he would only be engaging its rear guard.  He ordered an all out attack, committing the 74th and the 39th Regiments of the 27th Brigade under Gen. Bruno von François to the hill wall extending between Spicheren and Forbach.\nAt the beginning of the battle the French were unaware that the Germans had numerical superiority because only units of the German 2nd Army attacked. Fossard regarded the attackers as skirmishers and therefore did not request reinforcements.   By the time he realized the strength of the force he was opposing, it was too late. Seriously flawed communications between Frossard and Bazaine's headquarters slowed responses: by the time the reserves received orders to move to Spicheren German troops from the 1st and 2nd Armies had moved across the open ground to shelter at the base of the heights, arriving at one o'clock.\nAt the base of the hill, General François waited for reinforcements, unsure of how many French opposed him. French counter-attacks by infantry and Cuirassiers were stopped bloodily by 3 nearby Prussian batteries which despite heavy losses from French fire had deployed on Galgenberg Hill just  from Rotherberg Hill. Kameke's 28th Brigade under Wilhelm von Woyna arrived in the afternoon to bring the battle back to life, but again the Prussian attacks were repulsed.\nThe French counter-attacked. General François was at the front encouraging the troops of the 74th Regiment which had reached the edge of Rotherberg Hill, drew his sword, ordered the bugler to sound the call to attack and led the newly arrived 9th Company of the 39th Regiment in a charge: he was killed, being struck by 5 bullets.  Gen. Laveaucoupet's 40th Regiment pushed back François's badly demoralized survivors while Gen. Charles Vergé's 2nd Brigade pushed back Woyna's troops.\nBy this time, General Constantin von Alvensleben, commander of the III Corps of the Prussian 2nd Army had come to the aid of his compatriots and the Prince had taken overall command.  Drawn by the sound of battle, more and more Prussian troops appeared on the battlefield. Alvensleben decided to attack Frossard's left flank.\nAfter 5pm the tide of  battle turned again, as General Battaile's 2nd Division attacked with 15 battalions near Stiring and Spicheren, breaking the Prussian lines and pushing them back almost to Saarbrücken. If Frossard had continued these counter-attacks he might have won the battle: but because reserves had not arrived, Frossard waited and reinforced his left flank, believing that he was in grave danger of being outflanked because German soldiers under General Adolf von Glümer were spotted in Forbach. Frossard stopped his successful attack and around 7pm wired headquarters that he would have to retreat back to the heights to avoid being outflanked. They were pressed by a combination of overlapping infantry and artillery attacks.  Frossard's troops started an orderly retreat from Rotherberg Hill and Stiring, though by some reports some fled in panic, with 3,000 arriving in Strasburg without arms. The French rear guard resisted strongly so there was bloody house to house fighting in Forbach and Stiring. Alvensleben's infantry charge with more than 5000 men overran the French rear guard at dusk, thus gaining control of the Rotherberg Hill. Instead of continuing to defend the heights, Frossard retreated in an orderly fashion to the south. By 9 o'clock, the Prussians occupied the entire Spicheren plateau. They celebrated with a salute of one hundred and one guns.\nThe German infantry was exhausted and needed to rest and re-group, so even though fresh cavalry units were available the retreating French were allowed to slip away.\n}}\nAftermath\nThe Prussian casualties were 4,871, due to attacking and the effectiveness of the French chassepot rifle. French losses were 4,078.   In the morning when they had found out that their efforts were not in vain: Frossard had abandoned his position on the heights  and had ordered a retreat towards Moselle where he planned to withdraw and move to the fortress of Verdun, en route he was reinforced by Bazaine's division. They were again attacked by Steinmetz at the Battle of Borny-Colombey.\nAnalysis\nFrance had lost another battle; the incompetence of its military commanders and their lack of initiative mainly to blame. The German casualties were relatively high due to lack of planning and the effectiveness of the French chassepot rifle.\nCommemoration\nThere are numerous memorials on the plateau of Rotherberg Hill and at the various military cemeteries in Spicheren, many of them German, and at the Forest Cemetery and the German-French-Garden in Saarbrücken, commemorating the fallen soldiers or officers of the individual formations, as well as a big memorial for the fallen French. Many of these memorials became a theme for postcards in the decades after the battle. There is a trail named after General François which passes the memorials on the Spicheren heights.\nIn the 21st century, groups from France and Germany regularly collaborate to re-enact the battle.\nFile:Spicheren Ehrenmal 39er.jpg|German memorial for the Lower Rhenish Fusilier Regiment No.&nbsp;39\nFile:Spicheren Ehrenmal 40er.jpg|German memorial for the Hohenzollerian Fusilier Regiment No.&nbsp;40\nFile:Spicheren Ehrenmal 48er.jpg|German memorial for the 5th Brandenburgian Infantry Regiment No.&nbsp;48 \"Von Stülpnagel\".\nFile:Spicheren Ehrenmal 74er total.jpg|German memorial for the 1st Hanoverian Infantry Regiment No.&nbsp;74\nFile:Spicheren Ehrenmal 74er Detail.jpg|Detail of the memorial for the 1st Hanoverian Infantry Regiment No.&nbsp;74\nFile:Spicheren Ehrenmal 12er total.jpg|German memorial for the 2nd Brandenburgian Grenadier Regiment No.&nbsp;12\nFile:Spicheren Ehrenmal 12er Detail1.jpg|Detail of the memorial for the 2nd Brandenburgian Grenadier Regiment No.&nbsp;12\nFile:SB Ehrenmal 77er total.jpg|German memorial for the 2nd Hanoverian Infantry Regiment No.&nbsp;77 at the Forest Cemetery in Saarbrücken\nFile:Spicheren Sterbeort Bruno von Francois.jpg|German memorial at Rotherberg Hill marking the place where General Bruno von François died\nFile:Spicheren Grab Bruno von Francois.jpg|French plaque indicating the General Bruno von François memorial trail\nFile:Spicheren Kreuz 06 August 1870.jpg|French battle of Spicheren memorial\nFile:Spicheren Ehrenmal 1.JPG|French memorial on the Spicheren heights with a view of Forbach valley\nSee also\n* Forbach\nNotes\nReferences\nSources\n*\n*\n*\n*\n*\n*\n*}}\nExternal links\n* ''Compton's Home Library: Battles of the World CD-ROM\n* https://web.archive.org/web/20080907020125/http://homepages.paradise.net.nz/mcnelly/vb/scenarios/spicheren.htm\n* Henderson, G.F.R. Stonewall Jackson and the American Civil War.'' Longmans, Green and Co. 1949"
    }
  ]
}