{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Loznica\n\n| casus             =\n| territory         =\n| result            = Serbian victory\n| combatant1        =\n*  Revolutionary Serbia\n| combatant2        =  Ottoman Empire\n*\n| commander1        =\n*  Karađorđe Petrović\n*  Jakov Nenadović\n*  Luka Lazarević\n*  Joseph O'Rourke\n| commander2        =  Ali Vidajić\n| strength1         =  1,200reinforced by 10,000\n| strength2         =  30,000\n| units1            =  First Serbian Army\n| units2            =  Ottoman Army\n*  Bosnian militia\n| casualties1       = 121 dead, 178 wounded\n| casualties2       = 484 dead, 712 wounded\n| campaignbox       =\n}}\nThe Battle of Loznica () also known as the Battle of Tičar (бој на Тичару) was fought on 17–18 October 1810 between Serbian Revolutionaries and Ottoman forces in Loznica, at the time part of the Sanjak of Zvornik, a region of the Ottoman Empire, (today Serbia).\nFollowing their defeat at the Battle of Varvarin, a large Ottoman force from Bosnia poured across the Drina and struck against the Serbian entrenchments at Loznica west of Belgrade. After a fierce battle and the arrival of reinforcements, the Serbs were victorious and Serbia was liberated. The battle has been called one of the greatest victory of the First Serbian Uprising.\nBattle\nAround 30,000 Ottomans composed of regional Ottoman Bosnian militia, under the command of Ali Pasha Vidajić descended the Drina river with boats to the Tičar field near Loznica, west of Belgrade. The fortified city walls were defended by 1,200 Serb rebels led by local vojvode Anta Bogićević. Estimating that the defense would be unable to resist, Anta requested aid from Luka Lazarević. Learning of the planned siege, Karađorđe sent a message to Petar Dobrnjac urging him to also send reinforcements as soon as possible. Around 10,000 rebels, of the Šabac and Valjevo nahije under the command of Luka Lazarević and Jakov Nenadović as well as several of Joseph O'Rourke's Cossack units rushed to bolster the Serbian positions. Karadjordje also hastened, from the Deligrad front to relieve Loznica.\nThe fight began in the morning, with two hours of swordfighting, and then shootouts with artillery and rifles, ending after eight hours in a Serbian victory. Cincar-Janko was wounded in the battle. The Serbs had 121 dead and 178 wounded, while the Ottomans, according to historic records, suffered three times more casualties.\nAftermath\nThe blind guslar Filip Višnjić, who was present at the battle rallying the troops, wrote an epic poem of the battle, Boj na Loznici, recorded in the Šišatovac monastery in 1815. Less than two years later, under threat by Napoleon, Russia chose to make peace with Turkey at Bucharest abandoning Serbia to the Turks who then invaded in full force.\nReferences\nSources\n*\n*\n*\n*\n*\n*\n* }}"
    }
  ]
}