{
  "content": [
    {
      "type": "text",
      "text": "# Battle of the Defile\n\n| combatant1        = Umayyad Caliphate\n| combatant2        = Türgesh Khaganate and Transoxianian allies\n| commander1        = }}\n| commander2        = Suluk\n| strength1         = Over 40,000\n| strength2         = Unknown\n| casualties1       =\n| casualties2       = 10,000 (Ibn A'tham)\n| campaignbox       =\n| result            = See aftermath section\n}}\nThe Battle of the Defile or Battle of the Pass () was fought in the Takhtakaracha Pass (in modern Uzbekistan) between a large army of the Umayyad Caliphate and the Turkic Türgesh khaganate over three days in July 731 CE. The Türgesh had been besieging Samarkand, and Samarkand's commander, Sawra ibn al-Hurr al-Abani, had sent a request for relief to the newly appointed governor of Khurasan, Junayd ibn Abd al-Rahman al-Murri. Junayd's 28,000-strong army was attacked by the Türgesh in the pass, and although the Umayyad army managed to extricate itself and reach Samarkand, it suffered enormous casualties; Sawra's 12,000 men, who had been commanded to attack the Türgesh from the rear in a relief effort, were almost annihilated.\nThe battle, for which one of the most detailed accounts of the entire Umayyad era survives in the History of al-Tabari, halted or reversed Muslim expansion into Central Asia for a decade. The losses suffered by the Khurasani army also led to the transfer of reinforcements from the metropolitan regions of the Caliphate, which in the long term weakened the Umayyad regime and helped bring about its collapse twenty years later in the Abbasid Revolution that began in Khurasan.\nBackground\nThe region of Transoxiana had been conquered by the Muslim Arabs of the Syria-based Umayyad Caliphate under Qutayba ibn Muslim in the reign of al-Walid I (), following the Muslim conquest of Persia and of Khurasan in the mid-7th century. The loyalties of the region's native Iranian and Turkic inhabitants and autonomous local rulers remained volatile, and in 719, they sent a petition to the Chinese and their vassals the Türgesh (a Turkic tribal confederation) for military aid against the Muslims. In response, Türgesh attacks began in 720, and the native Sogdians launched uprisings against the Caliphate. These were suppressed with great brutality by the governor of Khurasan, Sa'id ibn Amr al-Harashi, but in 724 his successor, Muslim ibn Sa'id al-Kilabi, suffered a major disaster (the so-called \"Day of Thirst\") while trying to capture Ferghana. For the next few years, Umayyad forces were limited to the defensive. Efforts to placate and win the support of the local population by abolishing taxation of the native converts to Islam () were undertaken, but these were half-hearted and soon reversed, while heavy-handed Arab actions further alienated the local elites. In 728 a large-scale uprising, coupled with a Türgesh invasion, led to the abandonment of most of Transoxiana by the Caliphate's forces, except for the region around Samarkand.\nIn the hope of reversing the situation, in early 730 Caliph Hisham ibn Abd al-Malik () appointed a new governor in Khurasan: the experienced general Junayd ibn Abd al-Rahman al-Murri, who had been recently engaged in the pacification of Sindh. The difficult security situation at the time is illustrated by the fact that Junayd needed an escort of 7,000 cavalry after crossing the Oxus River, and that he was attacked by the Türgesh  Suluk while riding to link up with the army of his predecessor, Ashras al-Sulami, who in the previous year had advanced up to Bukhara in a hard-fought campaign. After difficult fighting, Junayd and his escort were able to repel the attack and link up with al-Sulami's forces. Bukhara and most of Sogdia was recovered soon after, as the Türgesh army withdrew north towards Samarkand. The Muslim army followed and scored a victory in a battle fought near the city. Junayd then retired with his troops to winter in Merv. During the winter, rebellions broke out south of the Oxus in Tokharistan, which had previously been quiescent under Muslim rule. Junayd was forced to set out for Balkh and there dispersed 28,000 of his men to quell the revolt. This left him seriously short of men when, in early 731, the Türgesh laid siege to Samarkand and appeals for aid arrived from the city's governor, Sawra ibn al-Hurr al-Abani. Despite the opinion of the army's veteran Khurasani Arab leaders, who counselled that he should wait to reassemble his forces and not cross the Oxus with fewer than 50,000 men, Junayd resolved to march immediately to Samarkand's rescue.\nBattle\nJunayd could not advance along the old Persian Royal Road, which led from Bukhara east to Samarkand and was held by the Türgesh. Instead, he led his army to Kish, about  due south from Samarkand. There he received news from his scouts that the Türgesh had sent detachments of their own to spoil the wells on his line of march. His counsellors initially suggested a route west around the mountains of the Zarafshan Range, which lay between Kish and Samarkand, through the village of al-Muhtaraqah. Al-Mujashshir ibn Muzahim al-Sulami, one of the Khurasani leaders, advised against this, since the Türgesh could easily set fire to the uncultivated grasslands along that route. Instead, he favoured a more direct approach over the steep but short () Takhtakaracha Pass, and suggested the possibility that this would catch the Türgesh by surprise. Junayd followed al-Mujashshir's counsel, and encamped before the entrance of the defile. The decision was unpopular with the army, largely Khurasani Arabs who distrusted the \"outsider\" Junayd. and their descendants, who retained their tribal organization. As an exclusive warrior caste, they were jealous of their privileges, and for a long time limited the number of natives allowed to take up arms, apart from the forces provided by allied native rulers. In , according to al-Tabari, next to 47,000 Khurasani Arabs there were only about 7,000 native converts (). Cases of the recruitment of 10,000–20,000 native levies are reported in the following decades, but it appears that these were not permanent additions to the army, but rather auxiliaries recruited for specific campaigns or emergencies.}} The usual quarrels between the Qays–Yaman factions also re-emerged, and some men deserted. Undeterred, Junayd pressed on with 28,000 men. The subsequent events are described in detail in al-Tabari's 10th-century History of the Prophets and Kings, which in turn draws upon the work of the earlier historian Abu'l-Hasan al-Mada'ini, written about a century after the events. As a result, according to the historian Khalid Blankinship the Battle of the Defile is \"by far the best-documented one to occur during Hisham's reign\".\nThe two armies that met at the Takhtakaracha Pass represented two different military philosophies. The Umayyad armies fielded a sizeable cavalry contingent, both light and heavy, but their mainstay was their infantry. In battle, the Arab cavalry was often limited to skirmishing during the initial phases, before dismounting and fighting on foot. In contrast the Türgesh, a typical Central Asian nomadic empire, had an army composed exclusively of cavalry. Their unmatched skill in horsemanship, especially as horse archers, and their natural hardiness combined to make them extremely dangerous opponents. They were adept at a fluid and highly mobile fighting style of feints, ambushes, and feigned retreats, which they exploited to outmanoeuvre the slower-moving Arabs. As the historian Hugh N. Kennedy writes, \"when the nomad [Türgesh] allied with the local Iranian princes, they provided what was perhaps the fiercest opposition the early Muslim armies ever encountered\".\nSupported by troops from the rulers of Sogdia, Shash, and Ferghana, the Türgesh attacked the Umayyad army in the pass, two days after they had left Kish (a Friday), six  (}}) from Samarkand. The Türgesh attacked while the Arab army had stopped to take a meal. The Arab vanguard, under Uthman ibn Abdallah ibn al-Shikhkhir, was overwhelmed, but Junayd was able to hurriedly deploy the main body of his army, placing his troops according to their tribal affiliations, with the Tamim and Azd on the right and the Rabi'ah on the left. The Arabs hurriedly erected earthworks in front of their lines, and the initial Türgesh attack, directed against the Arab right, was pushed back. Junayd, who had placed himself in the centre to direct the battle, then joined the ranks of the Azd, who greeted him with hostility: their standard-bearer is reported to have told him \"If we win, it will be for your benefit; if we perish, you will not weep over us. By my life, if we win and I survive, I will never speak a word to you.\" Al-Tabari reports that this man and seventeen successive bearers of the same standard were killed during the battle, indicative of the fierceness of the fight. The Arabs initially met the Türgesh attack on horseback, but as their casualties mounted, Junayd's herald ordered them to dismount and fight on foot, crouching down behind the trenches and forming a spear wall. This measure helped the Muslims hold their ground. Eventually both sides wearied, and the battle ceased for the day. The most grievous casualties among the Arabs were suffered by the stragglers and baggage train, who gathered under Abdallah ibn Mu'ammar ibn Sumayr al-Yashkuri near Kish; they were virtually annihilated.\nThe next day, the Türgesh launched renewed attacks on the Arabs, but these were repelled. The Arabs engaged in vigorous counterattacks whenever the Türgesh drew near, and the  ordered his troops to besiege the Arab camp instead of attacking it. Having persevered through the initial onslaught, Junayd sent messengers to Sawra in Samarkand, ordering him to come to his assistance with a diversionary attack. Sawra and the Samarkand garrison were initially reluctant as they were aware that this was effectively a suicide mission, but Junayd's threats forced Sawra to comply. Leaving behind a small garrison, Sawra led 12,000 men out of Samarkand and with the help of a local guide managed to reach within a  (roughly ) of Junayd's force by crossing over the mountains. There he was confronted by the Türgesh, who, reportedly on the advice of Ghurak, the Sogdian king of Samarkand, set fire to the dry grasslands. Sawra's lieutenants advised a slow infantry advance fronted by a spear-wall (the standard Umayyad anti-cavalry tactic) but Sawra, knowing his troops to be weary and desperate, decided instead to launch a cavalry charge against the Türgesh in the hopes of breaking through with at least part of his force and reaching Junayd. Sawra's troops, \"maddened by heat and thirst\" in the description of H.A.R. Gibb, charged the Türgesh and broke their front, but the battle soon became a confused affair with both sides hindered by the smoke, dust, and flames. In the end, the Umayyad army lost its cohesion, scattered, and was destroyed piecemeal by the Türgesh cavalry. All but a thousand of Sawra's force perished, including Sawra himself.\nJunayd used the diversion to break through to Samarkand, but as his army exited the defile, his officers persuaded him to make camp and spend the night there instead of making for the city. The advice proved sound, as the Türgesh caught up with them and would likely have annihilated Junayd's army on open ground. As it was, the camp's fortifications could not be completed before the next day, when the Türgesh renewed their attack. At this point, the Arabs were so hard-pressed that Junayd promised the army's slaves their freedom if they would fight. Many did so, using saddle blankets as armour. The Türgesh attacks were repelled, and despite its heavy casualties the Umayyad army reached Samarkand after almost three days of battle.\nAftermath\nAccording to Bartold, The Battle of the Defile stands as a landmark victory for the Türgesh, demonstrating their control over mountain passes and their ability to resist Arab incursions effectivelyBarthold, W. (1968). Turkestan Down to the Mongol Invasion. The Battle of the Defile stands as a landmark victory for the Türgesh, demonstrating their control over mountain passes and their ability to resist Arab incursions effectively Bosworth note, The Arab defeats in battles such as the Defile undermined their attempts to fully integrate Transoxiana into the Caliphate. He further adds, the Türgesh were able to exploit their knowledge of the terrain to inflict a crushing defeat on the Umayyad army at the Defile, effectively halting their progress into Central Asia for a generation.Bosworth, C.E. (1994). The History of the Saffarids of Sistan and the Maliks of Nimruz. The Arab defeats in battles such as the Defile undermined their attempts to fully integrate Transoxiana into the CaliphateBosworth, C.E. (1993). Encyclopaedia Iranica, Vol. XXXII. The Türgesh were able to exploit their knowledge of the terrain to inflict a crushing defeat on the Umayyad army at the Defile, effectively halting their progress into Central Asia for a generation Hugh Kennedy also hold similar view and wrote, the defeat of the Umayyad army in the Defile at the hands of the Türgesh was a significant blow to Arab efforts to control Transoxiana. The rugged terrain favored the Türgesh's ambush tactics, exposing the vulnerability of Arab forces far from their base, and further adds Though the Arabs survived, the defeat at the Defile was a significant victory for the Türgesh and their allies, who halted further Umayyad expansion.Kennedy, Hugh N. (2001). The Armies of the Caliphs. Though the Arabs survived, the defeat at the Defile was a significant victory for the Türgesh and their allies, who halted further Umayyad expansion According to Richard Frye,  The Türgesh victory in the Defile battle exemplified the complex dynamics of Central Asian resistance to Arab conquests, rooted in both military strategy and cultural autonomy.Frye, Richard (1996). The Heritage of Central Asia. The Türgesh victory in the Defile battle exemplified the complex dynamics of Central Asian resistance to Arab conquests, rooted in both military strategy and cultural autonomy\nJunayd remained in Samarkand for about four months, until October 731, allowing his army to recover. The Türgesh meanwhile made for Bukhara, which they besieged. Junayd again resolved to meet them in battle and managed to inflict some defeats on the Türgesh in early November and raise the siege of Bukhara, which he entered on the day of Mihragan. Junayd then returned to Merv, leaving a token garrison of 800 men behind in Samarkand. Once the Türgesh had withdrawn north for the winter, he evacuated the city of its Muslim inhabitants.\nAlthough Samarkand was relieved and the Umayyad army escaped annihilation, the battle \"was not wholly an Arab victory\", according to the historian M. A. Shaban. According to Khalid Yahya Blankinship, it was \"a Pyrrhic victory at best\", due to the high casualties suffered by the Muslims; indeed, the sources record both Junayd and the Caliph Hisham publicly equating it with the disastrous defeat suffered at the hands of the Khazars in the Battle of Marj Ardabil a year before. The 10th-century historian Ibn A'tham al-Kufi gives the Muslim casualties as at least 20,000 out of a total of 43,000 or 48,000, while poets of the time raise the number to 50,000. Judging by the numbers of replacements ordered sent to or levied in Khurasan in the aftermath of the battle, Blankinship estimates the Arab losses at between 25,000 and 30,000, and that \"probably not more than fifteen thousand Khurasani troops were left alive\". Although the Türgesh also suffered heavy casualtiesIbn A'tham gives the unverifiable figure of more than 10,000 deadthe Arab losses at the Battle of the Defile led to a rapid deterioration of the Umayyad position in Central Asia. Junayd remained as governor of Khurasan until his death in early 734, but by this time the Muslims had lost control of everything north of the Oxus save for Bukhara, Kish, and the region of al-Saghaniyan.\nTo make up for the losses and shore up the depleted army of Khurasan, the Umayyads were forced to resort to mobilizing some 20,000 Iraqis and sending them to Khurasan, a potentially very dangerous move and a sign of desperation. The Iraqis were notoriously hostile to the Umayyad regime, and had been demilitarized and subject to virtual occupation by Syrian troops since the failed uprising of Ibn al-Ash'ath in 700–703. Junayd was also forced to levy 15,000 native troops to deal with the emergency.\nThe events during and after the battle increased Khurasani disaffection with the Umayyad regime and its representatives, as exemplified by the words of the Azdi standard-bearer to Junayd. Al-Tabari also reports the wordsalbeit possibly a later additionof another Khurasani to Junayd before the battle: \"It used to be said that certain of the troops of Khurasan would perish at the hands of a luxury-loving man from the Qays. We now fear that you may be he\". According to Blankinship, these passages, as well as poems disparaging Junayd's leadership, are an eloquent testimony to the Khurasanis' frustration at being \"forced to fight continuous, unrewarding campaigns for the benefit of vainglorious generals on one of the caliphate's worst fronts, by a central government whose special Syrian army had not hitherto, in the Khurasanis' opinion, faced similar hardships\". Blankinship observes that:\n}}\nThe subsequent period in Khurasan was turbulent, with revolts and anti-Umayyad agitation among the local Khurasani Arabs, necessitating the introduction of 20,000 Syrian troops into the province, in addition to the Iraqis sent in after the Battle of the Defile. Only in 739–741, after the Türgesh Khaganate collapsed following the murder of its leader Suluk, was the new governor of Khurasan, Nasr ibn Sayyar, able to largely restore the Caliphate's position in Transoxiana, and extend Muslim control again up to Samarkand.\nIn the aftermath of the setbacks at the battles of the Defile, Marj Ardabil, and other similar disasters, the Umayyad government was forced to take urgent measures to reinforce the buckling frontiers of the empire. As the defeats also increased the bitterness and reluctance of the local frontier armies to campaign, the caliphs were left with little choice but send out detachments of the trusted Syrian army to the threatened fronts. This move proved doubly destabilizing for the Umayyad regime: the introduction of the Syrians in the frontier provinces further alienated the local troops, who saw their hitherto privileged position being threatened by the regime's favourites; while the parcelling out of the Syrian army to distant areas, and the losses it suffered, weakened the dynasty's main power base. This would be the major factor in the fall of the Umayyad Caliphate during the civil wars of the 740s and the subsequent Abbasid Revolution, which began in Khurasan.\nNotes\nReferences\nSources\n*\n*\n*\n*\n*\n*"
    }
  ]
}