{
  "content": [
    {
      "type": "text",
      "text": "# Battle Hunter\n\n|designer =\n|engine =\n|released = }}\n|genre = Tactical role-playing\n|modes = Single-player, multiplayer\n|platforms = PlayStation\n}}\nBattle Hunter, known in Japan as  and in Europe as The Hunter, is an anime-styled tactical role-playing game, released for the PlayStation in 1999. It was released in Japan as part of the SuperLite 1500 series of budget games. The game revolves around a player-controlled hunter that must compete with three other hunters in order to win a relic, and makes heavy use of traditional RPG conventions such as dice and tile-based movement.\nStory\nIn the years after a major world war, the few scientists remaining on Earth set out to develop a formula to protect humanity from extinction. To be successful they require vital information from the ruins of cities around the world, and assign the task of collecting it to an elite task force known as the Hunters. The story revolves around the player getting jobs from the shop owner to recover relics of interest from dungeons. Eventually the player will compete against a secret organization known as B PHS for the target relics.\nGameplay\nGameplay centers around hunting and retrieving relics in a dungeon represented by a randomly generated grid. Four hunters are always present in the dungeon, with the computer controlling any hunters that are not controlled by the players. Before entering a dungeon, the player(s) are given a mission to retrieve a key relic hidden in one of the treasure boxes in the dungeon. Other treasure boxes contain other relics, but only the key relic is required to win any one mission. The player has 3 options: moving, attacking and resting (which will give him/her 2 cards and quarter of his/her Hit Points back).\nCharacter development\nWhen creating a hunter, players are given 11 initial ability points to spend on Movement, Attack, Defense, and Hit Points. Raising stats uses the following system:\n* 3 points spent on Movement will raise the Movement statistic by 1.\n* 1 point spent on Attack will raise the Attack statistic by 1.\n* 2 points spent on Defense will raise the Defense statistic by 1.\n* 1 point spent on Hit Points will raise maximum number of Hit Points by 3.\nEvery time a level is gained, that hero gains 1 Hit Point as well as the stat gained from spending points.\nCards\nEach hunter begins the game with 5 cards drawn randomly out of a deck of 100. Other players are always able to see each other's hands at all times. Cards can be used at different times throughout the game for different effects, but they are color-coded to the types of effects they cause. Blue and Yellow cards can be used on the map or in combat, but Red and Green cards can only be used in combat or on the map, respectively.\nBlue cards affect movement ability. They range from +1 to +3 and E. There are only 2 blue E cards in the deck. When used on the dungeon grid map, blue cards increase the hunter's movement range for that round. If an E card is used, it will warp the hunter directly to the exit. When used in combat, they increase the hunter's ability to escape from battle for one round. If an E card is used in combat, it will result in definite success in escaping.\nYellow cards affect defense and evasion. They range in value from +3 to +9, as well as A, and D. If used on the dungeon grid map, the cards increase the hunter's ability to avoid traps by a percentage of the card's value x10. For example, a yellow +3 will grant a 30% chance of evading a trap. Both D and A cards will grant total trap protection, increasing the rate to 100%. Cards only last for the round in which they are used, then they expire. If used in combat, they increase the hunter's defense by the amount on the card. Using a D card will double the hunter's defense, and an A card will maximize the defense.\nRed cards affect attack. They can only be used in combat. Values on red cards range from +3 to +9, as well as C, and S. The C Card gives an attack bonus equal to the amount of the opponent's attack stat. The S card doubles your own attack stat. Just like there is only one each of the A and D Defense Cards, there is only one each of the C and S cards too.\nGreen cards represent traps and can only be used on the dungeon grid map. The traps are placed before the hunter moves, and remains in the space the hunter just vacated. Traps are not visible on the grid until they are stepped on and triggered by a hunter. There are 4 types of green card, each representing a different kind of trap. The maximum amount of traps on 1 space is 3 traps\n* E - Empty: All cards in the hunter's hand are discarded, and they cannot pick any up until the effect wears off.\n* S - Stun: The hunter is stunned and loses their next turn. While stunned, the hunter has a defense stat of 0 and cannot perform any actions, both on the map and in battle, and is also rendered unable to use cards for that turn.\n* D - Damage: The hunter takes damage.\n* L - Leg Damage: The hunter's legs are damaged, causing their movement score to drop to 0 for the rest of the mission or until he reaches the EXIT tile. Leg damage can be repaired by surrendering in a battle or landing on a blue or green flag. If they have a Crutch that they identified however, it becomes a movement of 1 instead. This trap effect will instead cause the hunter to gain movement if their movement is originally 0.\nCombat\nCombat can take place between two hunters or a hunter and a monster. Combat in Battle Hunter is different from most RPGs because combat ends after one exchange of actions, as opposed to fighting to the death. The majority of combat sessions end with both combatants still standing. If a character is afflicted with the Panic status effect, the computer automatically controls the panicked player's actions. If a character is stunned, they are not able to act at all, and have a defense stat of 0 if they are attacked in that state.\nWhen attacked, the hunter that is being attacked can choose whether to counterattack, defend, run away, or surrender, assuming that they are not stunned. After choosing any action (other than surrender) the hunter will then choose a card to use, or use none if desired. Then, the attacking combatant will choose his/her card. The system will roll two 6-sided dice for each combatant: two for the attacker's attack strength, and two for the defender's defense strength. Each hunter's modifiers will be applied and damage will be resolved.\nExample: Hunter A attacks Hunter B. Hunter A has 3 attack and 0 defense, Hunter B has 1 attack and 2 defense. Hunter B chooses to counterattack and uses a +5 yellow Defense modifier. Hunter A chooses to use a +3 red Attack modifier. The system then rolls a 6 and a 5 for Hunter A, and a 4 and a 4 for Hunter B. Hunter A's attack is 6+5 +3 bonus +3 = 17. Hunter B's defense is 4+4 +5 bonus +2  = 15. Hunter B will take 2 damage. The system will then calculate Hunter B's counter-attack in a similar fashion.\nIf Defend is chosen, the defender makes no counterattack roll, but the character's defense stat is doubled when considering damage taken. In the case of the above example, if Hunter B defended, they would have taken 0 damage.\nIf Escape is chosen, the defender makes an escape roll. The defender can use any blue movement cards to aid in their chance to escape, and the attacker can use them to aid in their chance of catching the defender. Both players roll two diсe, and add their move bonus and the effects of any blue cards used to their totals. If the defender rolls a higher total score, they escape. If the attacker rolls a higher total score, then they catch the defender, and are allowed to make an attack. If this happens, the caught character's defense stat is 0 for the duration of damage calculation.\nIf Surrender is chosen, the defender gives up an item and is warped to a random spot on the map, just as if they were killed. However, the differences between this and actually dying are that if one surrenders, they get to choose what item they give to their attacker, and do not lose half of their max HP.\nIf a hunter loses all HP in a battle, They are not killed. Instead, the hunter is warped to a random location in the dungeon and his/her maximum HP is reduced by 50%. The hunter will allow the attacker to choose an item to take from their inventory, if it is another player. If GON, the monster that appears when there are no cards left in the deck, defeats the character with the Key Relic, the mission ends and all hunters lose all credits and any relics in their possession.\nRelics\nAfter completing a dungeon, the player can ask the shop keeper to examine the relics they have found. Some of them are useless (like the empty bottle), but some others have effects, such as weapons which increase the hunter's Attack, or disks which contain wallpapers for the main menu. Some others give a handicap to the hunter who possesses it, such as becoming confused at the end of their turn. Those can be used to escape a fight by giving it to the enemy which will be handicapped. Only relics which give a malus are effective when not examined, others need to be examined to profit from their bonuses. The relics can also be sold to the shop keeper, whether they are examined or not. The Key Relic can not be examined and is automatically sold.\nLeveling up\nTo level up, the players have to gather enough money (credits) by selling relics or winning dungeons. Then, they can go to the clinic to buy level up. When leveling up, Hit Points automatically increase by 1, and the players can add 1 point to the statistic of their choice. The maximum level is 15.\nDeck running out of cards\nIf the deck runs out of cards (which usually does not occur), then GON, the dungeon beast, is sent out. He is considered a monster (as he does not attack monsters but attacks hunters) and is very hard to beat. This wolf-like creature has a high attack and can take some hunters out in one hit.\nReception\n| Fam = 24/40\n| GI = 5/10\n| GSpot = 5.7/10\n| OPM =\n}}\nThe game received \"mixed\" reviews according to the review aggregation website GameRankings. In Japan, Famitsu gave it a score of 24 out of 40.\nReferences\nExternal links\n*"
    }
  ]
}