{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Radviliškis__disambig_1\n\n| combatant2        =  West Russian Volunteer Army\n| commander1        =  Kazys Ladiga\n| commander2        =  Pavel Bermondt-Avalov Rüdiger von der Goltz Yevgeny Vyrgolich\n| units1            =  2nd Infantry Regiment\n| units2            =  Baltische Landeswehr\nIron Division\n| strength1         = 2231 infantry\n| strength2         = 800 infantry\n| casualties1       = 11 killed30 wounded\n| casualties2       = 210 killed430 wounded131 captured\n| campaignbox       =\n}}\nThe Battle of Radviliškis (Lithuanian: Radviliškio kautynės) was fought between the Lithuanian Armed Forces and the Western Russian Volunteer Army, also known as Bermontians, a pro-German military formation, commanded by Pavel Bermondt-Avalov near the city of Radviliškis as part of the Lithuanian Wars of Independence. Fought on 21–22 November 1919, it saw the decisive defeat of the Bermontians and their subsequent retreat from the Baltic States.\nBackground\nThe West Russian Volunteer Army, led by cossack warlord and adventurer Pavel Bermondt-Avalov and general Rudiger von der Goltz, had already suffered a defeat in Riga at the hands of the Latvian army. The army was ordered to evacuate from the Baltic States by the German government. Consequently, the Bermontian army began traveling south and attacking Lithuania along the cities of Biržai, Jurbarkas, Linkuva, Raseiniai, Šiauliai, and Radviliškis, the latter being an important railway city. After the Lithuanian victory over the Bolshevik forces in the east, more troops could be allocated to fight Bermondt-Avalov's forces. Kazys Ladyga was appointed as the commander of the new front, and ordered the 2nd Infantry Regiment to begin an attack on Radviliškis on 20 November. As the Bermontians were expected to retreat, the future battle was given to the 1st Battalion, composed mainly of young and inexperienced soldiers.\nBattle\nOn 21 November, at 3 PM, the 2nd Infantry Regiment began their attack in the direction of Šiauliai, with the 1st Battalion forwarding the attack. , a soldier volunteer, recalled that the day was marked by heavy snowing, during which his contingent was led by a local Lithuanian farmer who showed them the trail. Lieutenant Serafinas Oželas managed to break through into Radviliškis, briefly capturing the cemetery before retreating due to a lack of support. Oželis sustained heavy injuries and died soon after. He would be later awarded the Cross of Vytis. Around 9 PM another attack commenced but failed due to stiff resistance from the enemy. Later, commander Ladyga decided to call up the reserve consisting of the 1st Infantry Regiment's 3rd battalion and a part of the 1st battalion. The new offensive commenced on 22 November, 7 AM. Artillery support suppressed enemy fire as small parts of the army broke into the city and fell back. The 2nd Infantry Regiment's 2nd Battalion occupied the Radviliškis manor. A new offensive commenced five hours later as various infantry companies surrounded the city, with the heaviest fighting occurring at Maironis street and the local windmill, which was used as a fortification consisting of machine guns. The Bermontians subsequently retreated from the city. French general and delegate Henri Niessel, representing the Entente powers, demanded that the fight with Bermontians be halted and that they would be safely evacuated into Germany.\nAftermath\nA total of 11 Lithuanian soldiers died and 30 were injured. Out of the 800-men contingent of Bermontians, about 210 died, 430 were injured, and 131 became prisoners of war. The Lithuanian army collected significant spoils of war, including planes, bombs, ammunition, guns, and artillery such as mortars, which startled the Lithuanian soldiers who hadn't seen this type of weapon at the Bolshevik front. The spoils were transported to Kaunas via train. The battle meant the Bermontian retreat from Lithuania and the Baltic States as a whole. The army retreated into Tilsit, while Bermondt-Avalov himself escaped through Klaipėda.\nRemembrance\nIn 1930 a monument was built to commemorate two young volunteer soldiers who died in the fighting. In 1989, at the village of , near the local Radviliškis windmill, a park was built in commemoration of the event. A monument was built at the site of the battle of Radviliškis in 1990, entitled Nikė.\nReferences\nBibliographical sources\n*Eidintas, Alfonsas; Vytautas Žalys; Alfred Erich Senn; Edvardas Tuskenis (1999). Lithuania in European Politics: The Years of the First Republic, 1918-1940. New York: St. Martin's Press\n*Lesčius, Vytautas. Lietuvos kariuomenė Nepriklausomybės kovose 1918-1920.\n*Šapoka, Adolfas (1989). Lietuvos istorija. Švietimo ministerijos knygų leidimo komisija.\nSee also\n*History of Lithuania\n*Aftermath of World War I"
    }
  ]
}