{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Aqra Dagh\n\n| result            = Assyrian victory\n* Kurds flee to Sharwaneh Mezin\n* Kurdish villages looted\n| combatant1        =  Assyrian Levies\n| combatant2        = Kurdish Tribesmen\n*  Zebari tribesmen\n*  Barzani tribesmen\n*  Sherwani tribesmen\n| commander1        =  Agha Petros Malik Khoshaba\n| commander2        =  Faris Agha Ahmed Barzani\n| strength1         = 4,000–6,000\n| strength2         = 3 tribes\n| casualties1       =\n| casualties2       =\n| partof            = Surchi Revolt\n| image             = Akra from the southwest, early twentieth century.jpg\n}}\nThe Battle of Aqra Dagh, which took place on 27 October 1920, refers to the Assyrian advance into the Aqra mountains toward the Zab river, during which a Kurdish resistance attempt failed. The Assyrian force, numbering between 4,000 and 6,000 men, and led by Agha Petros and Malik Khoshaba, was marching through northern Iraq at the time.\nBackground\nThe Kurdish rebellions had all previously been defeated in northern Iraq, but the Surchi Kurds of Aqra began an uprising in 1919.\nIn 27 October 1920, Assyrian forces led by Agha Petros and Malik Khoshaba marched on the Kurds of Aqra in order to take back the lands from occupied Assyria, but were met with resistance while crossing Aqra Dagh and the Zab river.\nThe Assyrians had advanced into northern Iraq with the goal of taking back their own land and suppressing rebellions, with the aim to establish a potential independent state. This effort was arranged by Agha Petros and British officer Colonel Colin Owen amongst others.\nBattle\nUpon reaching the mountains behind Aqra, the Assyrians confronted the enemy and engaged in fierce battle. The Assyrian advance was firm but met resistance, especially upon reaching the Zab River. The Zaibari Kurds assembled in full force, managing to halt the Assyrians for several days, due to the obstacle of the river.\nIn order to overcome this challenge, the Assyrians constructed small boats (kalaks) using goatskin. At night, a part of the Assyrian army crossed the river undetected. At dawn, they launched a surprise attack, leading to enemy trenches under heavy machine-gun fire.\nDuring this attack, three notable Assyrian fighters—Jejji Easho of Beillata, Israel Benyamin of Upper Tyareh, and Khiu of Lagippa—were killed. These warriors, described as giants and valiant fighters, played a crucial role in opening the way for the Assyrian advance near the village of Billeh. Their efforts forced the enemy into retreat.\nA heated battle took place, with heavy casualties on both sides as the Assyrians took control of the enemy's trenches. Eventually, the Kurdish forces fled towards Sharwaneh Mezin, leading to the Assyrians’ victory in this engagement.\nAftermath\nThe Kurds retreated to Sharwaneh Mezin, clearing the way for the Assyrians to reach the Zab River, cross it, and continue their advance to occupy additional territory. The Assyrians looted Kurdish villages who had no involvement in the conflict, and stole their goods.\nSee also\n* Barzani (tribe)\n* Assyrian Levies\n* Agha Petros\n* Malik Khoshaba\nReferences"
    }
  ]
}