{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Ferkeh__disambig_1\n\nMahdist State\n| combatant2        =  United Kingdom Egypt\n| strength1         = 3,000–4,000 men\n| strength2         = 9,000–9,500 men\n| commander1        = Osman AzrakHammuda\n| commander2        = Sir Herbert Kitchener\n| casualties1       = 44 emirs killed4 emirs captured  800–1,500 soldiers killed  500 soldiers wounded  500–600 prisoners of war\n| casualties2       = 20 soldiers killed81–83 soldiers wounded\n| campaignbox       =\n}}\nThe Battle of Ferkeh (or Firket) occurred during the Mahdist War in which an army of Mahdists was surprised and routed by Egyptian forces, led by Sir Herbert Kitchener, on 7 June 1896. It was the first significant action of the reconquest of Sudan, which culminated in the September 1898 Battle of Omdurman.\nBackground\nIn June 1896, at the start of the Sudan campaign, Kitchener's Anglo-Egyptian force was advancing on Dongola, in Northern Sudan. Ferkeh was a small fortified village on the banks of the Nile. It was the first important Mahdist position that was encountered and was occupied by 3,000 Mahdist warriors, led by the Emirs Hammuda and Osman Azrak.\nKitchener's force, nominally in service of the Khedive of Egypt but in fact under direct British control, was composed of Egyptian and Sudanese soldiers, led by British officers. It numbered 9,000 men, accompanied by three batteries of field guns and one battery of Maxim guns. Apart from officers with the Egyptian Army, the Maxim battery were the only European troops present and was manned by detachments from the North Staffordshire Regiment and the Connaught Rangers. The latter, according to some sources, wore red coats, not khaki. If so, that would be the last time in which British troops fought in red (the Battle of Ginnis, on 30 December 1885, was the last time that it certainly occurred.)\nBattle\nKitchener divided his force into two columns. One was formed mostly of infantry and had to march along the Nile to attack Ferkeh from the North. The other consisted of cavalry, camel-mounted infantry and horse artillery units and was sent through the desert to attack from the Southeast. Both columns departed in the evening of the 6th and marched through the night, deploying at dawn in the morning of the 7th.\nThe attack caught the Mahdists completely by surprise, and they made only uncoordinated attacks against the deploying Egyptians during which Emir Hammuda was killed. Many of the Mahdists then turned and fled. The cavalry column should have cut off their retreat but were hidden from view by the terrain. Many, including Osman Azrak, made good their escape along the Nile. Other Mahdists stayed in their fortifications in the village and fought to the end. The Egyptians had to clear the position with bayonets.\nThe battle lasted less than three hours, from 04:30 to 07:20, and resulted in the deaths of 20 Egyptians and 800 to 1,000 Mahdists.\nAftermath\nIn strategic terms, Ferkeh was not a major battle since it was only an outpost of the Mahdist State that had been surprised and overrun. However, the battle had a significant psychological effect since it was the first substantial victory of the Egyptian Army after it had been reorganised by the British. Also, the battle showed that the Mahdist forces could be defeated, which boosted the Egyptian Army's morale, and unsettled their opponents at the onset of the reconquest campaign.\nThose present were later awarded the Khedive's Sudan Medal with clasp 'Firket' and Queen Victoria's Sudan Medal.\nReferences\nBibliography\n*Barthorp, Michael. (1984), War on the Nile, Blandford Press, London\n*Bruce, George. (1981), ''Harbottle's Dictionary of Battles, Van Nostrand Reinhold ().\n*Churchill, Winston S. (1899), The River War - an account of the Reconquest of the Sudan, volume I, Longmans, London.\n*Joslin, Litherland and Simpkin (eds). (1988), British Battles and Medals, Spink\n*Ziegler, Philip (1974), Omdurman'', Collins, London\nExternal links\n*\n*"
    }
  ]
}