{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Fengwudong\n\n*\n| combatant2        =\n*  Korean Northern Army Command\n| commander1        =  Yasukawa Jiro Nihimi Jiro\n| commander2        =  Hong Beom-do    Han Gyeong-se\n| strength1         = 500\n| strength2         = About 1,200 ~1,300\n| casualties1       = Japanese record:1 killed and 2 woundedKorean claim:157 killed and 300 wounded\n| casualties2       = 4 killed and 2 wounded\n}}\nThe Battle of Fengwudong () was a battle between Korean independence militias and Japanese forces in Manchuria. It took place between 6 and 7 June 1920, and was one of the earliest domestic support operations of the Korean independence forces. It was a battle in which independence army units defeated the Japanese regular army in Bongo-dong, Manchuria in 1920. The battle began when the independence armies led by Hong Beom-do and Choi Jin-dong attacked and destroyed the Japanese military police border post. The independence army that lured out the Japanese soldiers killed 120 Japanese soldiers and then carried out an operation to continue luring the Japanese soldiers to Bongo-dong. The independence army, which reorganized the combined forces and was in ambush in the Bongo-dong Valley, opened fire all at once when the Japanese army entered the siege, killing 157 Japanese regular soldiers and injuring about 200 others. The reason for this overwhelming victory was the independence army's heightened morale, the commander's foresight, and excellent operational planning.\nBackground\nAfter the March 1st Movement, the local Koreans' passion and efforts for the anti-Japanese armed struggle were growing rapidly. According to statistics from the Provisional Government of the Republic of Korea, from March 1, 1920 to early June, independence army units entered the country 32 times, and 34 Japanese government offices and police stations were damaged. The Battle of Bongo-dong was the first clash between the independence army and the Japanese regular army under these circumstances, and it was a battle in which the independence army won a major victory.\nPrelude\nOn June 4, 1920, a platoon of the Hong Beom-do and Choi Jin- dong units of the Independence Army attacked Samdunja, Wolsingang, Hwaryong - hyeon, Bukgan-do. Departing from , they crossed the Duman River and attacked and destroyed a 1-platoon-sized Japanese military police border post stationed in Gangyang-dong , Jongseong -gun, Hamgyeongbuk-do.\nAt the time, the Japanese army was seeking defense measures against the independence army's entry into the country and the active activities of the independence army in Daean, so the Battle of Gangyang-dong became the trigger for the great battle. After receiving urgent information, the Japanese Army's Namyang Garrison dispatched a company and launched a counterattack.\nBattle of Samdunja\nOn June 4, 1920, One platoon of the Gando National Association's National Army, commanded by Park Seung-gil, arrived at around 5 am on this day. After crossing the Duman River, they entered Gangyang-dong, Jongseong-gun, Hamgyeongbuk-do, attacked and defeated a military police patrol platoon led by Japanese military police officer Bok-gang, and returned in a battle.\nThe Japanese army, which was defeated in a series of battles with the independence army, organized the Wolgang Pursuit Force of 500 troops centered around the Japanese 19th Division, which had the division headquarters in Nanam, North Hamgyong Province, and one battalion led by Major Cho An-mu was one of the independence army's bases in Fengwudong. Accordingly, Lieutenant Jiro Nihimi, commander of the Japanese Army's Namyang Garrison, led one company and attacked them without permission. At 10 a.m. on June 6, the Japanese army pursued the independence army unit. They crossed over the Duman River and pursued Park Seung-gil's platoon and reached Samdunja. The Korean Northern Army Command ambushed one platoon in Bonghwa-ri, southwest of Samdunja. Park Seung-gil's unit was lying in ambush to the southwest of Samdunja, waiting for Lieutenant Jiro Shinmi's company. Then they fired simultaneously from a height of 100 meters and killed 60 people at around 10:00 pm on June 6. At this time, two independence fighters were killed and nine Korean residents were killed by stray bullets. The clever guidance operation of Platoon Commander Yi Hwa-il, who displayed outstanding skills in this battle, is highly regarded. This is the first time the Japanese military invaded Manchuria to pursue the independence army.\nBattle\nMeanwhile, as the Japanese army's Wolgang pursuit force advanced toward Bongo-dong, the situation was reported.\nThe leadership of the Korean Northern Army Command, including Hong Beom-do and Choi Jin-dong, judged that the best way to confront a superior enemy with inferior troops was to occupy key operational points. Hong Beom-do and Choi Jin-dong decided to annihilate the Japanese army in Bongo-dong, first issued an evacuation order to the village residents, took measures to evacuate to a safe place, and then began a specific response operation. Then, they retreated to the north and took up a defensive position on the high ground behind the village of Ansan.\nPursuit\nIn the early morning of June 7, when the Yaskawa unit entered the empty Ansan village 300 meters ahead, the lurking independence fighters opened fire all at once. The Yaskawa unit joined forces with the Nihimi Company to fight, but suffered significant damage due to adverse geographical conditions and a surprise attack.\nAt this point, the commander of the Japanese 19th Division mobilized an infantry and machine gun battalion of 500 troops commanded by Infantry Major Jiro Yasukawa. Jiro Yasukawa's unit, which reorganized its ranks, pursued the independence army with Yamazaki Company as the main force. When the Yaskawa unit arrived in the western part of the Goryeo region, it suffered a crushing defeat after coming under fierce fire from a small number of independence forces ambushed in the northern and northeastern highlands. Even after the Japanese army suffered 120 casualties in the two battles of Ansan and Goryeoryeong, they were repeatedly caught up in the independence army's induction operations and lured to Bongo-dong.\nBongo-dong is located 40 ri from the Duman River, and is a valley extending for tens of ri, surrounded by the rugged mountain ranges of Goryeo like a folding screen on all sides. There were about 100 private houses scattered around Bongo-dong, and as one of the independence army bases, Choi Jin-dong's family lived there. These private houses were scattered across three villages: Sangchon (Bukchon), Jungchon (Namchon), and Hachon. Sangchon was the representative place of Bongo-dong and was the location of the independence army's training ground.\nPreparations\nFrom the morning of June 7, the Hong Beom-do and Choi Jin-dong reorganized the Korean Northern Army Command forces of 1,300 in preparation for the Japanese attack. Hong Beom-do ordered 1st Company Commander Lee Cheon-oh (李千五) to lead the company members into an ambush at the northwest end of Sangchon, Bongo-dong, 2nd Company Commander Kang Seong-mo (姜尙模) to Dongsan (東山), and 3rd Company Commander Kang Si-beom (姜時範) to Buksan, 4th Company Commander Jo Kwon-sik (曺權植) set up an ambush at the southern end of Seosan. Cho An-mu (安武) was appointed as the command adjutant, Lee Won (李園) was appointed as the regimental officer, Choi Jin-dong was appointed as the commander, and Hong Beom-do was appointed as the regimental commander. However, this was just a formality, and the person who actually led the Battle of Bongo-dong to victory was General Hong Beom-do. The operation progress is as follows. The 1st Company was to be laid in ambush at the northwest end of Sangchon, the 2nd Company was to be on the eastern hill, the 3rd Company was to be ambushed at the northern hill, and the 4th Company was to be ambushed in the jungle at the southern end of Seosan. Regiment commander Hong Beom-do personally led two companies and positioned them halfway up Mt. Seonamsan to guide the Japanese army's vanguard through the Bongo-dong fishing port. The main force of the Japanese army was ordered to fire all at once when it entered the siege where the independence army was lurking, and ordered Director of Military Affairs Lee Won (李園) to lead the headquarters troops and the remaining companies, supply ammunition, etc., and secure a retreat route in case of emergency. In addition, Lee Hwa-il of the 3rd Platoon of the 2nd Company was given some troops to stand by on the hill north of Goryeoryeong, and when the Japanese army appears, retreat while pretending to engage and lure the Japanese army into the encirclement. Hong Beom-do used an ambush operation to repel the enemy by launching an all-out attack at once when the main Japanese army entered the siege of the independence army ambushed in Bongo-dong.\nAmbush\nAt around 1:00&nbsp;p.m. on June 7, Japanese scouts arrived within range, but the Independence forces let them pass and the main Japanese army entered deeper into the trap. According to the independence army's operational plan, the Japanese army entered the middle of the siege where 1300 independence fighters from Bongo-dong and Sangchon were hiding. Following General Hong Beom-do's orders, they launched a joint attack from three sides: east, west, and north. At 3 p.m., Major Yasukawa led the Kamiya Company and the Nakanishi Platoon and attempted a counterattack against Kang Sang-mo's Company, which was ambushed on the eastern hill. The Japanese army also put the Shingok Company and the Jungseo Company to the front and desperately resisted by firing machine guns, but they had already occupied an advantageous position. However, Kang Sang-mo's company repulsed them and killed about 100 people. It was pushed out by the independence army and suffered enormous damage. The Japanese army collapsed in disarray and retreated to Yuwonjin, Onseong.\nAftermath\nAccording to the Chinese newspaper 『Shanghai New News』 dated June 27, 1920 and an announcement by the Provisional Government Military Affairs Department published in the December 25, 1920 issue of the Independence Newspaper, the Japanese army was completely defeated with 157 dead, 200 seriously wounded, and 100 lightly wounded. The Japanese army reported one dead and 2 wounded and that they retreated to the closing passage to the Heukgang ferry under the jurisdiction of China's Hwaryong County, confirming the independence army's victory. The Korean Northern Army Command was minor, with 4 dead and 2 seriously injured, and they captured 160 rifles and 3 machine guns. The reason for this overwhelming victory was the independence army's heightened morale, the commander's foresight, and an excellent operational plan that took advantage of geographical locations.\nLegacy\nIn June 2020, South Korean President Moon Jae-in gave a speech in which he acknowledged the centennial of the battle.\nIn popular culture\n* Depicted in the 2019 film The Battle: Roar to Victory\nSee also\n*Battle of Qingshanli\n*Gando Massacre\n*Battle of Pochonbo\n*Memorial Day\n*19th Division\nReferences\nSources\n*JACAR Ref.C03022770200, Chōsengun Shireibu (朝鮮軍司令部): Kantō shuppeishi (間島出兵史)\n*Sasaki Harutaka (佐々木春隆): Kankoku dokuritsu undōshi jō no \"Seizanri taisen\" kō (韓国独立運動史上の「青山里大戦」考), Gunji shigaku (軍事史学), Vol.15 No. 3, pp.&nbsp;22–34, 1979.\n*Sasaki Harutaka (佐々木春隆): Chōsen sensō zenshi to shite no Kankoku dokuritsu undō no kenkyū (朝鮮戦争前史としての韓国独立運動の研究), 1985.\n* 윤병석, 《간도역사의 연구》(국학자료원, 2006)\n* 박은봉, 《한국사 100 장면》 (가람기획, 1993)"
    }
  ]
}