{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Paso de Patria\n\n}}\n*Paraguayan Army\n| combatant2        =\n}}\n*  Imperial Army\n* Imperial Navy\n**Marine Corps\n| commander1        =  Unknown\n| commander2        =  Joaquim M. Lisboa Manuel Luís Osório\n| strength1         = Unknown\n| strength2         = More than 10,000 soldiers  17 warships\n| casualties1       = Probably high\n| casualties2       = Unknown\n| image_size        = 300\n}}\nThe Battle of Paso de Patria was a battle of the Paraguayan War, which took place between April 16 to 23, 1866, on the banks of the Paraná River, in the then fortified position in Paso de Patria, in which the Empire of Brazil emerged victorious. It took place simultaneously with the Battle of Itapirú, during the so-called \"crossing of the Paraná River\".\nThe strategy\nPaso de Patria was a Paraguayan village, north of the Fortaleza de Itapiru, on the right bank of the Paraná River. The plan was for the Brazilian\nImperial Navy, under the command of Joaquim Marques Lisboa, Admiral Tamandaré, to bomb the positions occupied by the Paraguayan Army in Passo, jointly with the Imperial Army, distracting the Paraguayans and enabling a naval invasion. Thus, the ships that transported Brazilian soldiers would land approximately 10,000 soldiers under the command of General Osório, the Itapiru Fortress.\nThe Battle\nOn April 16, the Paraguayan soldiers who defended the Paso were repelled under heavy fire from Brazilian vessels, so, shortly afterwards, combat was fought between the first companies that landed, from the 2nd Volunteer (Rio de Janeiro), to at the time, Major Deodoro da Fonseca, thus, Osório's forces stopped any Paraguayan counter-advance. Paraguayan soldiers who attempted a counter attack, retreated to the region of Lake Laguna-Sirena, where they were unable to contain the Brazilian soldiers. On the night of the same day, Uruguayan and Argentine forces, allied with Brazil, disembarked. The Itapiru Fort was conquered on April 18 and the fortified position of Passo da Pátria, resisted Brazilian bombing and attacks until the 23rd of the same month. Thus, with the free route, the allied troops began to enter Paraguay.\nAfter the battle\nWith the taking of the fortified position, the place started to be used as an outpost of the Brazilian Imperial Army, being an essential way to supply the forces entering Paraguay, with even a light trade developing in the region.\nReferences"
    }
  ]
}