{
  "content": [
    {
      "type": "text",
      "text": "# Battle of the Braes of Strathdearn\n\nThe Battle of the Braes of Strathdearn was a Scottish clan battle that took place in 1645 in Strathdearn, Scottish Highlands. It was fought by the Clan Grant who defeated the Clan Cameron, after the Camerons had raided the Grant's lands.\nBackground and the raids of Moyness\nForty-seven years earlier in 1598 the Camerons had raided the lands of Moyness when they were then held by the Clan Dunbar. In 1645, the Camerons again raided Moyness when they were then held by the Clan Grant. However, according to the Clan Cameron Association, Allan Cameron of Lochiel, chief of Clan Cameron, had little to do with this raid as at the time he was in his eighty-third year of age and in Argyll when it took place.\nThe battle\nThe Camerons having stolen a large number of cattle were chased by the Grants who overtook them the next day. The commander of the Grant clansmen, Grant of Lurg, sent forward a powerful man named Lawson who requested that the Camerons leave them the cattle to avoid blood-shed. On his return the Camerons shot him dead with an arrow and the battle then took place between the two sides in which the Grants defeated the Camerons. According to Mackenzie, nineteen men from one branch of Clan Cameron were left dead on the battlefield and many were seriously wounded. The Grants also recovered all of their cattle.\nAftermath\nIn the aftermath of the battle Sir James Grant complained to Cameron of Lochiel who replied in writing to say that the Camerons did not know the lands belonged to the Grants, and if they had then they would not have carried out the raid. In his letter Cameron of Lochiel said that he had already had eight men dead and another twelve or thirteen wounded who he did not know if they would live or die. The Earl of Seaforth, chief of Clan Mackenzie had also complained about the Cameron's conduct and Lochiel replied to say that at the time of the battle and raid he had been in Argyll.\nReferences"
    }
  ]
}