{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Claremore Mound__disambig_1\n\nThe Battle of Claremore Mound, also known as the Battle of the Strawberry Moon, or the Claremore Mound Massacre, was one of the chief battles of the war between the Osage and Cherokee Indians. It occurred in June 1817, when a band of Western Cherokee and their allies under Chief Spring Frog (Too-an-tuh) attacked Pasuga, an Osage village at the foot of Claremore Mound (in present-day Rogers County, Oklahoma). The village was nearly empty; only women, children, and the very sick and elderly remained there. Most of the village was then away on a seasonal hunt that often lasted three to four months. The Cherokee killed or captured every remaining member of Chief Clermont's band and destroyed everything they could not carry away. Historians consider it one of the bloodiest Native American massacres in modern history.\nConflict between Osage and Cherokee\nOn November 10, 1808, at Fort Osage, Missouri, the Osage Nation made a treaty with the United States, ceding all of its land east of a line that ran south from Fort Clark to the Arkansas River and all of its land west of the Missouri River. The land reserved to the Osage Nation was further reduced by treaties signed at St. Louis (June 2, 1825, Fort Gibson (January 11, 1839) and Canville, Kansas (September 29, 1865).\nAccording to Eaton, the Osage established two main villages about 1800, when they migrated to the area between the Verdigris and Grand Rivers. These were called Pasona (near present-day Claremore, Oklahoma) and Pasuga (at the foot of Claremore Mound).\nIn the early 1800s, a portion of the Cherokee people, who had been living in the Southeastern United States, had begun moving to land historically claimed by other tribes west of the Mississippi River. These were those Cherokees referred to as the Old Settlers, or Western Cherokee. This produced a long period of conflict between the Cherokee migrants and the Osage. The Osage tribes had dominated the Central Plains area in today's Kansas, Missouri, Oklahoma, and Arkansas. The Osage often took captives (mostly women and children), and killing others, trying to drive out the invaders. Cherokees retaliated in kind, but were ineffective at stopping the raids. By 1817, an estimated 3000 Western Cherokees had settled in the area known as Lovely's Purchase in the Arkansas district of the Missouri Territory.\nThe Cherokee-led attack\nIn January 1817, the Arkansas Cherokee began planning a retaliatory attack against the Osage and began asking their relatives from the east to aid them in a battle against the Osage. They also asked for help from the Choctawe, Chickasaw, Delaware, Shawnee and others, including Whites.\nthey [the Osage] have stolen all our best horses, and have reduced us to work with our naked hands. [W}ith the few horses we have left, we intend to go to the Osages and hunt for those horses taken; we are going to do mischief.\n-->\nThe Cherokee knew that Osage men left their villages lightly guarded during the Strawberry Moon to go on a long-distance hunt for bison. Therefore, this would be the most opportune time to attack.\nThe Cherokee were enraged by the treatment they had endured at the hands of the Osage, which helped offset the greater numbers of the Osage had. The Cherokee had another advantage, as they had acquired more modern weapons—rifles—and were well-experienced in their use. This finally gave them a match in force against the Osage tribe, who had acquired guns in the 1600s from their trading with the French and with which all warriors were well acquainted.\nSome 500 Cherokee, along with a number of Choctaw, Chickasaw, and Whites, convened at a place on the Arkansas River. (The modern city of Russellville, Arkansas, developed here.) They traveled upriver into Indian Territory and went overland to the Osage villages.  After luring a representative of the Southern Osage away from the village, the invading party attacked, killing 38 Osage and taking 104 captives.  According to Eaton, Chief Clermont was present at the time of the attack and was killed during the fighting. He was later buried on Claremore Mound. Another source indicates that Pasuga was attacked first, and that the inhabitants of Pasona had been alerted by the sounds and smells of smoke when the marauders burned the village. The Pasugans hid in a cave previously discovered and prepared as a hideout by Black Dog, who had gone on the buffalo hunt. Thus, they survived the raid on their village and could care for the few survivors from Pasuga.\nThe aftermath\nMost of the Osage warriors had been away on a hunt when their village was attacked.  In an attempt to maintain peace with the U.S. government, they did not retaliate immediately. Sometime later (1820), the Cherokee followed the Osage further up the river. The Osage knew they were coming and were ready and had gathered numbers and allies. The Osage decimated the Cherokee. Instead of cowing the Osage, the defeat at Claremore Mound stirred them to greater fury. The bitter frontier war continued in unabated with Osage's raiding and killing indiscriminately as they retreated down the river, their Osage sons (Mad Buffalo) and grandsons were waiting in ambush. At every Cherokee retreat, an Osage ambush party of Claremore descent was waiting to slaughter the fleeing Cherokees. For 20 years, the descendants of Claremore attacked the Cherokees. The Osage who were taken captive were given to the Eastern Cherokee as payment for their contributions in the battle. In December of the same year, construction began on Fort Smith between the Cherokee and Osage settlements. The following summer, the U.S. forced the Osage to cede more land to the Cherokee, who were settling in the area, apparently because of their victories after the Battle of Claremore Mound.\nIn December 1818, the U.S. government began construction of a fort on the Arkansas River, close to the western border of Arkansas Territory. When completed, Fort Smith was staffed with troops whose primary mission was to prevent further hostilities between the Osage and the Western Cherokee. In 1824, this function was transferred to Fort Gibson, which was built near the confluence of the Grand and Verdigris Rivers in Indian Territory. Fort Smith was abandoned until a replacement was constructed several years later.\nThe Osage continued to live in the area until they moved to the Osage Reservation in 1839.\nSite marker\nThe Oklahoma Historical Society erected a marker at the site of the battle,on State Highway 88, about  north of the Will Rogers Memorial in Claremore. Coordinates of the marker are: .\nSee also\n* List of battles fought in Oklahoma\nNotes\nReferences\nFurther reading\n* Eaton, Rachel Caroline. [http://digital.library.okstate.edu/chronicles/v008/v008p369.html \"The Legend of the Battle of Claremore Mound\"] , Chronicles of Oklahoma 8:4 (December 1930) 369-376 (retrieved August 16, 2006).\n* Rollings, Willard H. The Osage: An Ethnohistorical Study of Hegemony on the Prairie-Plains (University of Missouri Press, 1992), pp.&nbsp;230–255\n* Mathews, John Joseph. The Osages: Children of the Middle Waters. (University of Oklahoma Press, 1961) pp.&nbsp;416–418\nExternal links\n* [http://www.oklahomagenealogy.com/rogers/ Rogers County, Oklahoma]\n* [https://www.okhistory.org/publications/enc/entry.php?entry=CL003 Encyclopedia of Oklahoma History and Culture - Claremore's Mound, Battle of]"
    }
  ]
}