{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Sedgemoor__disambig_1\n\nThe Battle of Sedgemoor was the final and decisive engagement of the Monmouth Rebellion, between forces loyal to James II and rebel forces led by the Duke of Monmouth. It was fought on 6 July 1685 at Westonzoyland near Bridgwater in Somerset, England.\nThe battle followed a series of skirmishes around south-west England between these two forces. King James' forces won the battle, and took about 500 prisoners. Monmouth escaped from the battlefield but was captured, taken to London and executed nine days later. Many of Monmouth's supporters were tried during the Bloody Assizes. Many were transported abroad, while others were executed by drawing and quartering.\nBackground\n(1662)]]\nIt was the final battle of the Monmouth Rebellion, by which the rebel James Scott, 1st Duke of Monmouth, attempted to seize the English throne from his uncle James II of England. James II had succeeded to the throne on the death of his brother Charles II on 2 February 1685; James Scott was Charles's illegitimate son.\nAfter Monmouth landed from the Dutch Republic at Lyme Regis in Dorset, there had been a series of marches and skirmishes throughout Dorset and Somerset. Eventually Monmouth's poorly equipped army was pushed back to the Somerset Levels, becoming hemmed in at Bridgwater on 3 July. He ordered his troops to fortify the town. The force was made up of around 3,500, mostly nonconformist, artisans and farm workers armed with farm tools (such as pitchforks).\nThe government troops, led by Louis de Duras, 2nd Earl of Feversham, and Colonel John Churchill, were camped behind the Bussex Rhine at Westonzoyland on Sedgemoor. The infantry included:\n* 500 men of the 1st Regiment of Foot (the Royal Scots), known as Dumbarton's Regiment, under Lieutenant-Colonel Douglas;\n* two battalions of the 1st or King's Royal Regiment of Guards (Grenadier Guards), respectively led by Henry FitzRoy, 1st Duke of Grafton, and Major Eaton;\n* 600 men of the Second Regiment of Guards (later the Coldstream Guards) under Lieutenant-Colonel Sackville;\n* five companies of the Queen Dowager's or the Tangier Regiment (later 2nd Foot), known as \"Kirke's Lambs\"; and\n* five companies of the Queen Consort's Regiment (Kings Own Royal Regiment), also known as Trelawny's Regiment, which was commanded by Lieutenant-Colonel Charles Churchill, Colonel John Churchill's younger brother.\nIn addition there were:\n* The Horse and Foot, the Royal Train of Artillery was camped along the road to Bridgwater.\n* The Royal Cavalry, with seven troops of 420 men of the Earl of Oxford's,\n* The Kings Regiment of Horse (Blues and Royals), led by Colonel Sir Francis Compton\n* The King's Own Royal Dragoons;\n* Three troops of the King's Horse Guards (Lifeguards).\nGovernment forces\nThe government forces included the following regiments:\n* Royal Regiment of Horse, commanded by Lieutenant General Aubrey de Vere, 20th Earl of Oxford KG\n* Queen's Regiment of Horse, commanded by Lieutenant General Sir John Lanier\n* King's Own Royal Regiment of Dragoons, commanded by General John Churchill\n* 1st Regiment of Foot Guards, commanded by Brigadier General Henry Fitzroy, 1st Duke of Grafton KG\n* 1st Battalion, Earl of Dumbarton's Regiment of Foot, commanded by Lieutenant General Lord George Douglas, 1st Earl of Dumbarton KT\nBattle\nThe Duke eventually led his troops out of Bridgwater at around 10:00&nbsp;pm to undertake a night-time attack on the King's army. They were guided by Richard Godfrey, the servant of a local farmer, along the old Bristol road towards Bawdrip. With their limited cavalry in the vanguard, they turned south along Bradney Lane and Marsh Lane, and came to the open moor with its deep and dangerous rhynes.\nThere was a delay while the rhyne was crossed and the first men across startled a government patrol. A shot was fired and a horseman from the patrol galloped off to report to Feversham. Lord Grey of Warke led the rebel cavalry forward and they were engaged by the King's Regiment of Horse which alerted the rest of the government forces. The superior training of the regular army and their horses enabled them to rout the rebel forces by outflanking them.\nAftermath\nMonmouth escaped from the battlefield with Grey and they headed for the south coast disguised as peasants. They were captured near Ringwood, Hampshire. Monmouth was taken to the Tower of London, where he was, after several blows of the axe, beheaded.\nA letter written by the Earl of Shaftesbury in 1787 provides more detail as to Monmouth's capture:\nThe family of the woman who betrayed him were ever after holden in the greatest detestation, and are said to have fallen into decay, and to have never thriven afterwards. The house where she lived, which overlooked the spot, has since fallen down. It was with the greatest difficulty that any one could be made to inhabit it.}}\nAfter the battle, about 500 of Monmouth's troops were captured and imprisoned in the Church of St Mary the Virgin, Westonzoyland, while others were hunted and shot in the ditches where they were hiding. More were hanged from gibbets erected along the roadside. The royalist troops were rewarded, with Feversham being made a Knight of the Garter, Churchill promoted to major-general and Henry Shires of the artillery receiving a knighthood. Other soldiers, particularly those who had been wounded, received allowances ranging from £5 to £80. Some of the wounded were among the first to be treated at the newly opened Royal Hospital Chelsea.\nThe king sent Lord Chief Justice Jeffreys to round up the Duke's supporters throughout the south-west and try them in the Bloody Assizes at Taunton Castle and elsewhere. About 1,300 people were found guilty, many being transported abroad, while some were executed by drawing and quartering. Daniel Defoe, who would later write the novel Robinson Crusoe, had taken part in the uprising and battle. He was heavily fined by Jeffreys, losing much of his land and wealth. Two brothers Benjamin Hewling, a commander of a troop of horse, and William Hewling, lieutenant of foot, were among those condemned to death. Benjamin Hewling was hanged rather than drawn and quartered following a payment of £1000 by his sister.\nJames II was overthrown in a ''coup d'état'' three years later, in the Glorious Revolution.\nLast battle on English soil\nThe Battle of Sedgemoor is often referred to as the last pitched battle fought on English soil, but this depends on the definition of 'battle', for which there are different interpretations. Other contenders for the title of last English battle include: the Battle of Preston in Lancashire, which was fought on 14 November 1715, during the First Jacobite Rebellion; and the Second Jacobite Rebellion's Clifton Moor Skirmish, near Penrith, Cumberland, on 18 December 1745. The Battle of Culloden, fought on Drumossie Moor to the north-east of Inverness on 16 April 1746, was the last pitched battle fought on British soil.\nCultural references\n]]\nLiterature\n* The Battle of Sedgemoor is depicted in detail at the climax of Arthur Conan Doyle's historical adventure novel Micah Clarke.\n* The battle also appears in Blackmore's Lorna Doone, where the hero arrives on the battlefield as the battle is finishing, and is then escorted home to safety by the king's soldiers.\n* Likewise, The Royal Changeling (1998) by John Whitbourn describes the rebellion, with some fantasy elements added. The Battle of Sedgemoor both opens and concludes the novel.\n* A collection of poems (Sedgemoor), exploring the battle and consequences of the rebellion, was written by poet and academic Malcolm Povey and published by Smokestack Books in 2006. The poems move between 1685 and the present day, as a narrative technique. Povey's book received praise, especially for its originality: \"Not many poets try something as different and ambitious as this. It deserves to be widely read.\"\n* The battle is commemorated in Val Wake's poem \"Dead Willows Mourn\". Wake, an Australian born journalist and author, lived in Westonzoyland from 1973 to 1979.\n* Events surrounding the battle occupy the first few chapters of Rafael Sabatini's novel Captain Blood. The battle is also mentioned in the beginning of the 1935 movie Captain Blood.\n* The battle serves as the historical background to a series of murders in the novel Down Among the Dead (2020) by Damien Boyd.\nOther portrayals\n* The Sealed Knot re-enactment society have re-enacted important parts of the rebellion's campaign, on the 300th anniversary in 1985, and again in 2005. For the first re-enactment, the folk trio Strawhead produced an album of various songs from the time and written especially, entitled Sedgemoor.\n* The Battle of Sedgemoor was also a central plot element in the 1972 HTV series Pretenders, which was broadcast in 13 half-hour episodes.\n* A mural depicting the battle is on display at Sedgemoor motorway services on the North carriageway of the M5 motorway.\nReferences\nFurther reading\n* David G. Chandler, Sedgemoor 1685: An Account and an Anthology (Anthony Mott, 1985); reprinted as: ''Sedgemoor 1685: From Monmouth's Invasion to the Bloody Assizes'' (Spellmount, 1999)\n*\n*"
    }
  ]
}