{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Varese__disambig_1\n\nSardinia\n| combatant2        =  Austrian Empire\n| commander1        = Giuseppe Garibaldi\n| commander2        = Karl von Urban\n| strength1         = 3,000 Cacciatori delle Alpi\n1,000 Civil Guards (approx.)\nEFFECTIVE: 4,000 (approx.)\n| strength2         = 4,000 Division Urban8 guns\nEFFECTIVE: 2,000 (approx.)\n| casualties1       = 18 killed66 wounded\n| casualties2       = 105 killed75 wounded(including 4 Officers)\n}}\nThe Battle of Varese was fought on 26 May 1859 at Varese (Lombardy). It was an engagement of the Second Italian War of Independence, fought between the Italian volunteers formation of the Hunters of the Alps, led by Giuseppe Garibaldi, against Austrian troops led by Karl von Urban. The Austrian defeat allowed the movement of the Hunters towards Como, and obliged the Austrians to keep troops on the northern part of the front.\nPrelude to battle\nFollowing the Battle of Montebello, Napoleon III and Victor Emmanuel II decided Ferenc Gyulay was tied down at the Po. The Franco-Piedmontese forces were then moved from Alessandria and then to Vercelli. This strategic flanking movement was conducted from 27 May through 29 May 1859. Cialdini's 4th Division led the advance guard, supported by Manfredo Fanti and Giovanni Durando. Achille Baraguey d'Hilliers' I Corps and MacMahon's II Corps deployed along the Po, blocking the Austrians.\nOn 23 May, Garibaldi took the Austrian garrison at Sesto Calende\nIn the meantime, on the 25 May, 500 Austrian riflemen, 130 Uhlans, and two guns from Gallarate attacked a company led by Carlo De Cristoforis at Sesto Calende, but were rejected to Somma Lombardo.\nBattle\nOn 23 May, Garibaldi took Varese. Gyulai then sent Karl von Urban's force of 4,000 northward. However, the Austrian Feldmarschall-leutnant only had at his disposal approximately 2.000 infantry at the time of the engagement.\nOn the 26 May, at dawn, Urban arrived at Varese, where Garibaldi already had placed two robust defensive lines. The Italians were deployed as: one battalion (Enrico Cosenz) on the right, two battalions on the left (Giacomo Medici), one battalion in the middle (Nicola Ardoino); two reserve battalions, one at Varese (Nino Bixio), and one at the Biumo Superiore hill.\nThe Austrians opened fire with the guns, then moved three columns against the enemy. Cosenz's battalion attacked the incoming Austrians, and routed them into the other columns, repulsing the Austrian attack with the help of the Medici battalion. Urban, evaluating correctly that the enemy forces were more numerous and well entrenched, ordered a retreated on Binago and . At San Salvatore the Austrians resisted the advance of Medici and Ardoino, who were charged by Garibaldi to attack the retreating Austrians. The encounter that followed was a victory to Urban, who, after repulsing the Cacciatori delle Alpi, proceeded to reentry Como in good order.\nSources"
    }
  ]
}