{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Barak\n\nPoland\n| result            = Polish victory\n| combatant2        =\n| units1            = 37th Infantry Division (Poland)\n| units2            = 3rd Light Division (Wehrmacht)\n| commander1        =  Boleslaw Ostrowki\n| commander2        =  Walter von Reichenau (army group commander)\n| date              = 7th – 8th September 1939\n| campaignbox       =\n}}\nThe Battle of Barak was fought on September 7–8 between Polish and German forces during the 1939 German invasion of Poland.\nPrelude\nBefore the battle a meeting took place between the commanders of the 3rd Legions Infantry Division (Poland) and 12th Infantry Division (Poland). Originally it was planned that the commander of the 36th Infantry Division (Poland) would attend but he was busy controlling Polish forces fighting close to Końskie. After this meeting both the 3rd and 12th and 36th Infantry Divisions were given orders to retreat across the Vistula by commander in chief of the Polish armed forces Edward Rydz-Śmigły. The plan was for the three divisions to reach the area west of Iłża on 8 September and then to cross the Vistula on 10 September near Solec. However the 36th Division had not received the order to retreat due to being caught up in fighting near Konskie. The task of giving the retreat order to the 36th Division was entrusted to 2nd lieutenant Dziedzicowi who used a car to drive through enemy territory to reach and inform the 36th Division of the order to retreat. On the evening of September 7 while concealing themselves from German aircraft to hide the fact they were retreating the 3rd and 12th Division began moving to Iłża. The 36th Division also moved on Iłża just before dusk at 8pm on September 7 after back and forth fighting between the Division and German forces at Kazanów for 4 days. Due to the large distance of  they had to cross and the fighting they were involved in they said they would arrive later than the 3rd and 12th Divisions on the morning of September 8. Last of the 36th Division to being retreating was the Konskie battalions of the 165th Regiment who were commanded by Lt. Z. Gromadzki. The 2nd Battalion of the 165th Regiment commanded by Major Inglot formed the rear guard. Lt. Przemysław Nakoniecznikoff commander of the 163rd Regiment took command of the retreating 36th Division column. The 36th Division column soon found the presence of German forces in front of their retreat at a forest by the Warsaw-Kraków Road near the village of Barak. The 36th Division command at Szydłowiec was surprised by the arrival of the 2nd Light Division armour in front of their retreat composed of Panzer I and Panzer II tanks. Following this the 36th Division staff company attempted to make contact with the German forces blocking their advance but were dispersed.\nBattle\nAfter the 36th Division staff company had been dispersed a cavalry unit under Captain Bronisław Riczki came to the battlefield and attacked the German forces collapsing the German wing and temporarily halting the German attacks. Soon after the attack of the cavalry under Bronisław Riczki the Germans regrouped and attacked again this time isolating Riczki's unit and destroying it. No reserves were available to replace Riczki's unit and the column commanded by Lt. Przemysław Nakoniecznikoff was very distance putting the 36th Division command in a perilous situation. This was further made worse by news of the German occupation of Radom and Opoczno which was poorly defended. In these circumstances the commander of the 36th Division Colonel Boleslaw Ostrowki choose to retreat from the battlefield and find an alternative route to Iłża where his forces could link up with the 3rd and 12th Division. Meanwhile Lt. Przemysław Nakoniecznikoff column approached the Skarżysko-Szydłowiec road and prepared to fight their way across. On the left was the 165th Regiment under Lt. Z. Gromadzki minus a Battalion of survivors from the 7th Infantry Regiment. On the right was the 2nd Battalion of the 163rd Regiment under Major Andrychowski which included soldiers from the Podole Brigade of the Border Protection Corps who had already seen combat in the campaign. Lastly in the centre was the 1st Battalion under Major Tint with some of the 165th Regiment. Near Skarżysko Książęce Major Andrychowski spotted a column of German armour approaching. The Polish column started defensive preparations against the German armoured column setting up anti-tank guns under 2nd Lt. Halicki and concealed machine guns that would only fire when the enemy was close. When the armoured column came they immediately started attacking Halicki's anti-tank guns as they opened fire and set the first tank in the column alight. Despite the first tank in the column being out of action the tanks pressed forward to take out the anti-tank guns. As this was happening a 3 gun artillery battery under Captain Pruski opened fire on the German tanks. German infantry were then sent forward to help the tanks. Polish forces took out 5 or 6 German tanks. The Germans then called in support from the Luftwaffe and a Liaison aircraft was soon over the battlefield and shortly afterwards German heavy artillery came into action which destroyed Halicki's anti-tank guns. Lt. Col. Nakoniecznikoff then sent his entire force to break through the road and support the Battalion of the 163rd Regiment and 6th company of the 165th Regiment. Lt. Z. Gromadzki's force was first to breakthrough the road. Just as dusk settled the Germans withdrew from Barak and the Polish troops advanced to the eastern part of Barak without any fighting but they were shelled by German artillery.\nAftermath\nAfter the battle the column of Lt. Col. Nakoniecznikoff went to the area of Big Trębowiec to the west of Iłżą in which it partly take part in the Battle of Iłżą. The units of the 36th Division disbanded upon reaching the Vistula near Narożnik forester's Lodge. The remaining men of the 165th Regiment still under the command of Lieutenant Colonel Gromadzki on the night between September 8 and 9 from forests near Sadek and Kierz Niedźwiedzi marched in the direction of Wierzbica. At Wierzbica they were attacked by German tanks but as it was night, the infantry were able to fight them off due to the tanks having little awareness of their surroundings in the dark. After this the remaining men of the 165th Regiment marched east. They then reached the Iłża-Skaryszew road where they were again attacked by tanks this time in the morning. The soldiers took cover in forests. They were being blocked by the tanks and could not break through. Lieutenant Colonel Gromadzki ordered his men to cross the vistula in small groups although some did this alone. The soldiers of the former 36th Division continued to fight in other units. Casualties during the battle were high on both sides.\nSee also\n* List of World War II military equipment of Poland\n* List of German military equipment of World War II\nReferences"
    }
  ]
}