{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Old Baldy__disambig_1\n\n| casus             =\n| territory         =\n| result            = Korean victory in 1952 actionChinese victory in 1953 action\n| combatant1        =\n*\n*\n*\n| combatant2        =\n| commander1        =\n| commander2        =\n| strength1         = 38,000\n| strength2         = 20,000\n| casualties1       = US: 1,952 casualties307 killedColombian:97 killed33 wounded\n| casualties2       = 3,000+ killed and wounded\n| notes             =\n| campaignbox       =\n}}\nThe Battle of Old Baldy was a series of five engagements for Hill 266 in west-central Korea. They occurred over a period of 10 months in 1952–1953, though there was also vicious fighting both before and after these engagements.\nBackground\nAs May turned to June, Major General David L. Ruffner of the 45th Division holding the right of the flank of the I Corps' line, was frustrated by the view that enemy observers had of his division’s positions. Opposing the 45th Division from east to west were elements of the Chinese 338th and 339th Regiments (113th Division, 38th Army), the 350th and 349th Regiments (117th Division, 39th Army), and the 344th Regiment (115th Division, 39th Army). The other infantry components of the 113th, 115th, and 117th Divisions were in reserve, as was the 116th Division, 39th Army. The Chinese had over ten battalions of artillery positioned along the front in direct or general support roles. Maj. Gen. Ruffner laid plans for Operation Counter, a two-phase operation to capture and hold 12 outposts a few thousand yards in front of the main line. One of the most prominent hills came to be called \"Old Baldy\", which earned its nickname after artillery and mortar fire destroyed the trees on its crest. But as the highest point on a prominent east-west ridge, Old Baldy held strategic importance because it dominated terrain in three directions.\nBattle\nOpening attack\nPersonnel of the Korean Service Corps unload logs—for the construction of bunkers—from an M-39 Armored Utility Vehicle at the RHE 2nd US Inf Div supply point on \"Old Baldy\" near Chorwon, Korea.\nSeveral air strikes on known enemy strongpoints close to the outpost objectives took place during the daylight hours of June 6, 1952. Then, after dark, various units ranging from a squad to almost a company, advanced to take possession of the outposts. Evidently the Chinese had not anticipated the operation, because the attack units encountered little opposition except at Outpost 10 on Hill 255 and Outpost 11 on Hill 266. The former, which was to become better known as Porkchop Hill, was taken by two platoons from I Company, 180th, after a 55-minute fire fight with two Chinese platoons. On Old Baldy, two squads from A Company, 180th Infantry, exchanged small arms and automatic weapons fire with two Chinese squads, then withdrew and directed artillery fire upon the Chinese.\nPrivate First Class James Ortega, a forward observer for the 171st Field Artillery Battalion, jumped into a trench and directed the artillery concentration which pounded the top of the hill with 500 rounds. When the artillery ceased, the men from A Company again probed the enemy's positions. Meeting intense fire, MSG John O. White took a squad, reinforced by a BAR and machine gun, and made a sweep to the rear of the enemy where they advanced to within 25 feet of the Chinese before attacking. As the Chinese resistance crumbled, the infantrymen from A Company pushed their way toward the crest of Old Baldy, where Chinese artillery immediately began to come in. Despite the Chinese fire, the A Company squads hung on and took possession of Old Baldy shortly after midnight.\nOnce the outposts were seized, the task of organizing them defensively got under way. Aided by Korean Service Corps personnel the men of the 279th and 180th Infantry Regiments brought in construction and fortification materials and worked through the night. They built bunkers with overhead protection so that their own artillery could use proximity fuze shells when an enemy attack drew close to the outpost. They ringed the outposts with barbed wire and placed mines along the avenues of approach which were also covered by automatic weapons. Whenever possible, they sited their machine guns and recoilless rifles in positions where they could provide support to adjacent outposts. Signal personnel set up communications to the rear and laterally to other outposts by radio and wire and porters brought in stockpiles of ammunition. Back on the main line of resistance, infantry, tank, and artillery support weapons had drawn up fire plans to furnish the outposts with protective fires and a prebriefed reinforcing element was prepared to go to the immediate assistance of each outpost in the event of enemy attack. By morning the new 24-hour outposts were ready to withstand counterattacks, and garrison forces of 18 to 44 men were left behind as the bulk of the forces from the 279th and 180th Infantry Regiments withdrew to the main line of resistance.\nRecollection from March 1952 of the Battle for Old Baldy, “The Ethiopians took Old Baldy from the ‘Chinks’ but when they turned it over to us, we lost it again.  The Ethiopians are going to try to get it back.” --Edward L. Pierce\nFirst battle\nThe contest for Old Baldy became very heated on June 26, 1952. Almost 1,000 feet (300 m) west of the crest the Chinese had established positions that posed a constant threat to the 45th Division outpost and the 179th Infantry Regiment's troops in the area. Colonel Sandlin decided to destroy the Chinese positions. Early in the morning the 179th Infantry Regiment vacated its outpost on Old Baldy to permit air strikes and artillery and mortar barrages to be placed on the Chinese positions. Eight fighter-bombers from the Fifth Air Force dropped bombs and strafed the positions with rocket and machine gun fire; then the 45th Division artillery and mortar units began to bombard the Chinese positions.\nC Company (Reinforced), 179th Infantry, under 1st Lt. John B. Blount, and F Company, 180th Infantry, commanded by Captain Tiller, which was attached to the 179th, attacked after the artillery and mortar fire. With C Company moving in from the left and F Company, supported by a tank, coming in from the right finger of Old Baldy, the assault forces soon ran into heavy small arms and automatic weapons fire from the two Chinese companies who comprised the defense force. After an hour of fighting the Chinese suddenly pulled back and directed artillery and mortar fire upon the attacking units. When the fire ceased, the Chinese quickly came back and closed with the men of C and F Companies in the trenches. A Company, 179th Infantry, under 1st Lt. George L. Vaughn, came up to reinforce the attack during the afternoon, for the Chinese machine guns were making it difficult for men of C and F Companies to move over the crest of the hill. The attack force regrouped, with F Company taking over the holding of the left and right fingers of Old Baldy, C Company holding the old Outpost 11 position, and A Company working its way around the right flank of the enemy defenders. For two hours the battle continued as the Chinese used hand grenades and machine guns to repel each attempt to drive them from their positions. Late in the day two tanks lumbered up the hill to help reduce the Chinese strongpoints; one turned over and the second threw a track, but they managed to inflict some damage before they were put out of action. Gradually the Chinese evacuated their positions, and the 179th was able to send engineers and several more tanks up to the crest.\nDuring the night of June 26 and the following day, the three companies dug in to consolidate their defense positions on Old Baldy. On the afternoon of June 27 L Company, 179th Infantry, under 1st Lt. William T. Moroney, took over defense of the crest and F Company, 180th Infantry, moved back to a supporting position. C Company and elements of A Company held the ground northwest of the crest.\nWhen night fell, Chinese activity around Old Baldy increased. Mortar and artillery fire began to come in on the 179th Infantry Regiment's positions and Chinese flares warned that the Chinese were on the move. At 22:00, the Chinese struck the defenders of L Company from the northeast and southwest. An estimated reinforced battalion pressed on toward the crest until it met a circle of defensive fire. From the main line of resistance, artillery, mortar, tank, and infantry weapons covered Chinese avenues of approach. L Company added its small arms, automatic weapons, and hand grenades to the circle which kept the Chinese at bay. Unable to penetrate the ring, the Chinese withdrew and regrouped at midnight.\nThe second and third attacks followed the same pattern. Each lasted over an hour during the early morning of June 28, and each time the Chinese failed to break through the wall of defensive fires. After suffering casualties estimated at between 250 and 325 men, the Chinese broke off the fight. The 179th Infantry reported six men killed and sixty-one wounded during the three engagements.\nLate in the evening of June 28, the Chinese artillery and mortar fire on Old Baldy signaled the approach of another attack. Four Chinese squads reconnoitered the 179th positions at 22:00, exchanging automatic weapons and small arms fire. About an hour later the main assault began with a force estimated at two reinforced battalions moving in from the northeast and northwest behind a very heavy artillery and mortar barrage. This time the Chinese penetrated the perimeter and hand-to hand fighting broke out. Shortly after midnight a UNC flare plane began to illuminate the battle area and the defensive fires from the main line of resistance, coupled with the steady stream of small arms and automatic weapons fire from the three companies of the 179th on the hill, became more effective. By 01:00 on June 29, the Chinese disengaged to the north, having suffered losses estimated at close to 700 men. In return the Chinese had fired over 4,000 rounds of artillery and mortar fire and the 179th Infantry had suffered 43 casualties, including 8 killed in action.\nAs June ended, the 45th Division, despite the lack of combat experience of many of its troops, had acquitted itself well on the battlefield. In the fight for the outposts the division had withstood more than twenty Chinese counterattacks and inflicted an estimated 3,500 casualties on the Chinese. It had also won a commendation from General Van Fleet. The Chinese made one more attempt to wrest control of Old Baldy from the 45th Division's possession on the night of July 3. Three separate attacks, the last in battalion strength, met the same fate as their predecessors as the concentration of defensive firepower first blunted and then forced the Chinese to desist in their assaults.\nSecond battle\nThe Chinese had not attempted to take the hill again until the U.S. 2nd Division relieved the 45th Division during mid July. All of the Eighth Army's corps followed a policy of rotating their divisions periodically on the line and the 45th had spent over six months at the front. The Chinese took advantage of the relief as they mounted two attacks on the night of July 17 in strengths exceeding a reinforced battalion. Through quick reinforcement of the Old Baldy outpost and heavy close defensive fires, E and F Companies, 23rd Infantry Regiment, who were defending the hill managed to repel the first Chinese assault. But the second won a foothold on the slopes which the Chinese reinforced and then exploited. Chinese artillery and mortar fire became very intense; then the Chinese infantry followed up swiftly and seized the crest. Counterattacks by the 23d Regiment supported by air strikes and artillery and mortar fire, did not succeed in driving the Chinese from the newly won positions. By July 20 the 2nd Division elements had regained only a portion of the east finger of Old Baldy. The onset of the rainy season made operations exceedingly difficult to carry out during the rest of the month.\nAs the torrential downpours converted the Korean battleground into a morass in the last week of July, the U.N. Command counted its losses on Old Baldy during the month. Through July 21 the tally showed 39 killed, 234 wounded, and 84 missing for the UNC and an estimated 1,093 killed and wounded for the Chinese.\nThird battle\nPvt Eulogio Santiago-Figueroa, 38th Infantry Regiment, 2d U.S. Infantry Division, who was wounded by fragments from a 102-mm Communist shell which was dropped during the celebration of the first mass on \"Old Baldy,\" is carried by litter to a jeep for transfer to the 38th Infantry Regiment Collecting Station and further evacuation to the 8055th Mobile Army Surgical Hospital. August 29, 1952.\nWhen the rain eased off at the end of July, the 23rd Infantry Regiment again sought to secure complete control of Old Baldy. Since the Chinese had an estimated two platoons on the crest, the 23rd sent two reinforced companies up the slopes after artillery and mortar preparatory fires on the Chinese positions. Edging toward the Chinese defenses, the 2nd Division forces used small arms fire and hand grenades as they reached the trenches. After bitter hand-to-hand combat, the two companies finally gained the crest early on August 1 and dug in to prepare for the customary counterattack, 200 flares were distributed around the UNC positions and 42 air sorties were flown during the day in support. That night the Chinese sent first mortar, then artillery fire at the crest, dropping an estimated 2,500 rounds on the 23d Regiment elements. But counterattacks were driven off.\nMines, bunkers, and additional wire helped to strengthen the UNC hold on Old Baldy on August 2, and extremely heavy and effective artillery fire broke up another enemy assault on August 4.\nFourth battle of Old Baldy – October 5–7\nFifth battle of Old Baldy – March 23–26, 1953\nThe Colombian Battalion\nColombia was the only Latin American country that participated in the United Nations Forces in Korea. A frigate, the ARC Almirante Padilla and an infantry battalion with 1080 men were sent to join the UN Forces in August 1951. The Colombian ground forces had been awarded for their exemplary performance in previous fighting and combat, Operations Nomad, Thunderbolt, Climber (Hill 400) and Barbula (Hill 180) with Presidential Unit Citations from the United States and South Korea and U.S. Legion of Merit, Silver Stars and Bronze Stars awarded to the men.\nAt the time of Old Baldy, the Colombian Battalion was within the 7th Division under Major General Wayne C. Smith. The South American unit was the fourth battalion in the 31st Regiment commanded by Colonel William Kern who had ordered Lt. Colonel Alberto Ruiz Novoa, the Colombian commander to relieve the Regiment's 1st Battalion on Old Baldy.\nThe Colombian Unit had just been engaged in the Battle of Yeoncheon Hill (Bárbula) in which its troops attacked the Communist's outpost, 500m from the enemy's main defense line, while carrying out preliminary duties at Mageo-ri, northwest of Yeoncheon. At dawn the Colombian Battalion C Company initiated an operation to capture Hill No.180, a strongly built outpost by the Chinese Communist Army but faced stiff resistance. After capturing Hill No.180, the C Company destroyed the enemy’s defense facilities. But the intel of the Regiment had failed. The attack should have been carried out by at least one full battalion and not just one company. The Colombian ground forces had been hit hard and had 11 men KIA, 43 WIA, and 10 were missing in action. Intercepted communications from the Chinese confirmed the struggle and hand-to-hand combat. The casualties were too high for C Company. They could not hold the position and were ordered to retreat.\nTwo days later the Battalion received orders for Old Baldy.\nOn their new post, Company A was placed at Dale and B Company on Old Baldy, going west to east and C Company was behind both, between them. The fourth company of the Colombian Battalion was used to fill in the missing men in the other three Companies which meant the whole battalion was used in the frontline. Lt. Colonel Ruiz Novoa asked the Regiment Commander Kern for reserve troops and a U.S. Company from the Regiment was assigned to the Battalion as a reserve unit.\nLt. Alfredo Forero Parra, B Company on Old Baldy: \"Once I finished signing the act in which I received and assumed responsibility over my section, I asked the Puerto Rican sergeant whom I was replacing about the time on the position and the situation surrounding it.\"\n\"Lieutenant, we've been here for five days and the troops we replaced lasted here just about the same. This is a real cemetery. It's been taken and recovered by us about a hundred times. Our men are rotated about every five to eight days because it's hit hard by enemy fire causing innumerable casualties, demoralization and sheer tiredness.\"\nOn 20 March artillery fire was felt all over the 31st Regiment. The Colombian Battalion was on Baldy in the middle with 2nd Battalion to its left and 3rd Battalion was on Pork Chop Hill.  Intercepted communications from the Chinese command and deserters confirmed the imminence of the attack, Regiment Commander Kern remained skeptical of the South Americans.\nOn the 21st, five bodies were exposed by the Chinese on the crest of Hill 180. Four Colombians and an American. The enemy wanted to tempt the Colombians in trying to recover them. The Colombian Commander ordered a rescue mission which caused complete awe in the Regiment and Division Commanders. The mission concluded with the entering enemy lines by a patrol of voluntary men from C Company. Private Alejandro Martínez Roa reached the crest, deactivated a mine under one of the bodies, descended with one of the corpses, escaped enemy fire and when he encountered other Colombian troops, returned to the crest with Corporal Pedro Limas Medina and the patrol and rescued the others. The heroic action was rewarded with four Silver Stars on the combat grounds.\nOn the 22nd the softening of the Colombian position on Baldy was increased. More than 2000 rounds of cannon fire was dropped over the area.\nOn the 23rd, since B Company had been on the line of fire for 11 days, Colonel Kern ordered C Company to rotate with B. Lt. Colonel Ruiz objected the order. He was expecting a Chinese attack on Baldy and considered it a mistake to move his troops, his reserve unit was the American Company which he did not know, and C Company had been hit very hard on Hill 180 so he did not want to expose them yet, to another hell of heavy fire. But Kern kept the order and the Companies started rotation. The movement began toward 1500 hours under heavy fire, making it difficult for C Company to advance toward their new position. Once again the Company began receiving heavy losses. B Company was completely demoralized and demotivated. It had been under constant artillery fire since their arrival. Men were eager to rotate as soon as they heard the new orders.\nLt. Alfredo Forero Parra: \"By that day our positions were seriously weakened by the enemy artillery fire. The position for my men was on the crest of Old Baldy. We were the Second Platoon in B Company. Past noon, I received orders to prepare my men to be relieved by C Company, next to us.\"\n\"All of us, from our combat positions were anxious to be relieved, but C Company did not arrive. I was convinced we were in for a major attack so I went and spoke with American tank Commander which supported our position, and I convinced him to give us a .30 machine gun in order to enhance our defense. We had everything ready, including the flamethrower assigned to us.\"\nThe 1st Battalion of the Chinese 423rd Regiment, 141st Division, commanded by Hou Yung-chun, was selected to assault Old Baldy. The unit's political officer hand picked the 3rd Company to lead the attack and plant the \"Victory Flag\" on the hill. The Chinese were directly facing the battered Colombian B Company. At 2030 hours, Second Lt. Alvaro Perdomo from A Company on Dale was attacked brutally. After a tenacious resistance and heavy support from B and C Companies he had to give up his position.\"\nPork Chop Hill was also hit with the same heavy fire. The Third Battalion could not hold its position and lost the hill. Colonel Kern thinking that the main objective of the attack had been Pork Chop Hill sent in two Companies to reinforce the men in the 3rd Battalion, but the fighting diminished making it possible for the 3rd Battalion to retake its position on the hill two hours later with the reinforcements received from the Regiment Command.\n\"Forty minutes after the attack on Dale and Pork Chop Hill, tremendously heavy artillery and mortar fire fell on Old Baldy. The earth shook as if in an earthquake accompanied by flashing and deafening explosions all around B Company's position. The fleeting silhouettes of men, weapons and weakened fortifications seemed ghosts within the enemy bursts. Cries of anguish and agony mingled with our own and enemy machine gun rattle. The battle raged at every moment. We could hear at a short distance the firing of 60 and 82&nbsp;mm. mortars from the enemy. Communications were lost, no one answered, not even the squadron commanders. Suddenly, I was reported the death of my platoon Sergeant replacement, Azael Salazar Osorio, then the commander of the third squad, Corporal Jose Narvaez Moncayo, who had been severed by the waist and shouted near death, to be lifted by the feet to relieve his suffering. Nothing could be done for him. At my battle station the death of Corporal Ernesto Gonzalez Varela, commander of the second squadron, was atrocious. We were almost touching elbows. He fired his machine gun on an onslaught of Chinese who came upon us when a bazooka shell hit him on the face, leaving his head tangling on his back. I thought I was living a nightmare or horror movie until new explosions on my bunker brought me back to reality. I encouraged my men and I continued to communicate with machine guns and gave instructions for a corporal to take out the flamethrower and prepare himself to shoot the enemy when they appeared.\"\n\"A few minutes later two soldiers came running to my trench shouting, the Chinese are coming, the Chinese are coming! The enemy was trying to overcome our position shouting and shooting their machine guns and throwing grenades.\"\nThe attack was unsuccessful. The Chinese again attacked, breaking the defense and heading for our trenches. That moment C Company started arriving to relieve B Company. They were unaware of the ammo deposits, trench and foxhole distribution and defense sectors. B Company still had command over the position on the crest of the hill, but half of the men were C Company.\nLt. Colonel Ruiz was right, the attack was imminent and what was worse, the main attack was on Baldy, not Pork Chop Hill, as Colonel Kern had considered. The rotation in which Kern, commander of the regiment, had insisted, had left in a very poor situation the two South American companies involved. Now the Colombians were paying for it. C Company which had been hard hit in Hill 180 still had its men under the influence of that nightmare, and now unable to fully come to occupy their combat positions in Baldy.\nA Chinese regiment had launched the attack on Dale. While the command of the regiment was distracted by with the previous attack that touched the U.S. battalion adjacent to the Colombian company, another Chinese regiment moved amid the darkness to Old Baldy, taking assault positions as an awful rain of artillery shells fell upon B Company's position on the crest of the hill. The bombing of that and previous days had weakened the Colombian positions, destroying much of the barbed wire and mines, leaving defenses open to a direct attack. All night they fought fiercely in the midst of the confusion caused by darkness and by the presence of the two Colombian units, half of B and half of C Companies. The situation for the defense could not be weaker. A full Chinese Battalion attacking, reinforced by two additional companies was too great a force against mere three companies of the Colombian Battalion.\nColonel Ruiz advised his intention to use the U.S. reserve company assigned to the battalion in order to counterattack, protect the troops engaged in combat and retake the lost positions. The U.S. liaison officer paled when he heard the order. With trembling voice said that the reserves had been used to contain the Chinese penetration on Pork Chop Hill in defense of the U.S. Third Battalion. With it, Pork Chop Hill had been recovered and had helped the Americans. There had been no notice or warning mediated to Colonel Ruiz.\nThe Colombians Battalion was on its own. The unit had no reserves to counterattack and fight back. Company A had had to retreat with the ferocity of the attack that preceded the one on Old Baldy, but was determined to recover their positions from the Chinese without any backup or reinforcements. B and C, in middle of the confusion of the rotation, could do absolutely nothing but try to survive.\nDespite the adversity, the Colombian troops almost broke the force of the assault, as was shown by an anguished communication intercepted by Division intelligence, in which the Chinese battalion commander Hou Yung-chun said the assault was unsuccessful and the capture of Hill 266 (Old Baldy) was impossible. The Chinese response was a ruthless command: take it or suffer the consequences. Moments later, they announced the dispatch of reinforcements.\nThe efforts in defending the position depleted dramatically as the number of attackers increased and the defenders were reduced by casualties. The smell of gunpowder and blood filled the air. It became an inferno. However, the Colombians fought with their customary and recognized bravery . The assailants, taking advantage of their enormous numerical superiority, had to conquer the position trench by trench, stronghold by stronghold in fierce hand-to-hand combat.\nAt about 1am, both parties, UN Forces and Chinese, believing that the other had captured the hill, began bombing with heavy artillery fire. Both armies despite having troops on the battlegrounds, unloaded a rain of bullets and shells on the men stranded in hand-to-hand combat trying maintain their positions. Casualties came from friendly and enemy fire alike.\nAt midnight only one platoon had managed to reach West View and tried to help contain part of the attack. There the Colombians awaited for reinforcements to retake the lost position. These of course never arrived.\nAlfredo Forero: \"At 4:30 AM we were only six men left in B Company's Second rifle platoon, with exhausted ammunition and harassed by the enemy. We made our way towards the tank path, losing three more men due to the continuous artillery fire.\"\n\"Before midnight, the tanks in the valley were removed, leaving free entrance to the enemy. A truck with our ammunition stopped at the entrance of the position on road in the valley. From it descended Lieutenants Leonidas Parra and Miguel Ospina Rodríguez, the sappers and transmission officers, as a heavy fog covered the morning and we could hear sporadic gunshots and screams.\"\nLieutenant Ospina arrived with orders to try to restore communications with the Command of the Battalion, but in the stark reality of Old Baldy, there was nothing to do.\nAt 8:00 am a U.S. platoon arrived and was asked by the Colombians for fire support in order to retake the lost hill, but after a short reconnaissance they withdrew.\nIf not for the heroic resistance of the Colombian troops at Old Baldy, the Chinese forces could have broken the 7th Division's Main Line of Resistance, entering deep into allied territory with very serious consequences, since the road could lead troops and armored enemy vehicles directly to Seoul.\nAt this point the command of the Division orders the hill a no man's land, and the most fearsome bombardment begins on Old Baldy. The Colombian Battalion had been unable to regain her men behind lines, stranded, wounded or dead. All were at the mercy of the U.S. Air Force, relentless in its action.\nThe Colombian casualties were 95 KIA, 97 WIA and 30 MIA, over 20% of the Battalion. The 7th Division considered 750 KIA the losses for enemy troops on Baldy.\nAftermath\nThe battle for the 1952 Battle of Old Baldy was costly to both sides. U.S. forces suffered 307 killed. Chinese forces suffered 1,100 dead. Like for most of the 1951-53 battles in the Korean War there is not much detail about the aftermath of the publicized battles. The communist forces took back Old Baldy by March 1953. In the end both sides lost many men with the battle lines ending up the exact same as in May 1952 before the first battle, emblematic of the whole Korean War.\nReferences\n*"
    }
  ]
}