{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Maniaki__disambig_1\n\nFirst Hellenic Republic\n| combatant2        =  Egypt Eyalet\n| commander1        = Grigorios PapaflessasPieros Voidis\n| commander2        = Ibrahim Pasha of Egypt\n| strength1         = 1,000–1,500\n| strength2         = 6,000+\n| casualties1       = 800–1,000 dead\n| casualties2       = 400–600 dead\n}}\nThe Battle of Maniaki was fought on May 20, 1825, in Maniaki, Greece (in the hills east of Gargalianoi) between Egyptian forces led by Ibrahim Pasha and Greek forces led by Papaflessas.\nThe battle ended in an Egyptian victory, during which both Greek commanders, Grigorios Papaflessas and Pieros Voidis, were killed in action.\nBattle\nAfter the Greek defeat in Sphacteria and the fall of Neokastro, Papaflessas decided to repulse the Egyptians himself. With a force of 3,000 Greek soldiers, Papaflessas marched south to offense Ibrahim and chose to position his troops near Mount Malia in order to acquire a decent view of the plain near Navarino. From that entrenched position, Papaflessas awaited Ibrahim's forces, even though he had not military quality. During the night of 19 - 20 May, many Greeks from within Papaflessas's ranks deserted after seeing Ibrahim's enormous armies. Only half of the Greek forces remained in their positions with Papaflessas and Pieros Voidis., after his death, became a great exemplar of heroism to the Greeks.|left]]\nIbrahim, in person, advanced towards the Greek position leading a force of over 6,000 soldiers. (Phillips calls the Egyptian force 'innumerable'). Papaflessas provided an eloquent speech that enhanced the morale of the remaining Greeks that decided to stay and fight. As the Egyptians in Ibrahim's army attacked, the Greeks held their positions staunchly but were eventually overwhelmed. Ultimately, a large part of the remaining Greeks, of 800 or 1,000 men, including Papaflessas and four hundred Egyptians perished in the aftermath of the battle.  The head and body of Papaflessas were recovered and placed upright on a post; not in dishonour, but as a mark of respect for a valiant foe. It is said that Ibrahim even kissed his head and said \"If all Greeks were like him, I would not take charge of this campaign\".\nAftermath\nDespite the defeat of Papaflessas, a defrocked Orthodox priest turned revolutionary, he became a symbol of spiritual and national resistance, and his death at Maniaki is often viewed as martyrdom for the Greek cause. The battle itself helped to change and strengthen the declining morale of other Greeks who contributed to the independence movement.\nSee also\n*List of battles\nReferences\nSources\n*Finlay, George. History of the Greek Revolution. Blackwood and Sons, 1861 (Harvard University).\n*Phillips, Walter Alison. The War of Greek Independence, 1821 to 1833. Smith, Elder and Company, 1897 (University of Michigan).\n*Newspaper To Vima, 6/4/2003.\n*Brewer, David. The Greek War of Independence: The Struggle for Freedom from Ottoman Oppression. Overlook Press, 2001."
    }
  ]
}