{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Ayn al-Tamr\n\n| result            = }}\n| status            =\n| combatant1        = Rashidun Caliphate\n| combatant2        = Sasanian EmpireArab Christians\n| commander1        = Khalid ibn al-Walid\n| commander2        = Mihran Bahram-i ChubinAqqa ibn Qays ibn Bashir\n| units1            =\n| units2            =\n| strength1         = 500–800|group=\"Notes\"}}\n| strength2         = 1,000-2,000(modern estimates)\n20,000-30,000\n| casualties1       = 20-30\n| casualties2       = Entire field army executedPersian garrison defenders of the town slaughtered\n| notes             =\n| campaignbox       =\n}}\nThe Battle of Ayn al-Tamr () took place in modern-day Iraq (Mesopotamia) between the early Muslim Arab forces and the Sassanians along with their Arab Christian auxiliary forces. Ayn al-Tamr is located west of Anbar and was a frontier post which had been established to aid the Sassanids.\nThe Muslims under Khalid ibn al-Walid's command soundly defeated the Sassanian auxiliary force, which included large numbers of non-Muslim Arabs who broke earlier covenants with the Muslims. According to William Muir, Khalid ibn al-Walid captured the Arab Christian commander, Aqqa ibn Qays ibn Bashir, with his own hands, which matched the accounts of both Ibn Atheer in his Usd al-ghabah fi marifat al-Saḥabah, and Tabari in his Tarikh.\nBattle preparation\nBefore the battle, Khalid ibn al-Walid placing his cavalry in both flanks, while he himself commanded the centre, surrounded by commando forces which surrounding him. Khalid plan the flanks of the Muslim army to start skirmishes without launching a major attack to distract the flanks of the Arab Christian army, while the centre remained passive until Khaled gave his signal to launch the attack.|group=\"Notes\"}}\nWhile the coalition army are formed in the front of Ayn al-Tamr castle. Aqqa' were assigned to face Khalid with his soldiers while he is positioned in the centre. Meanwhile, Mihran Bahram-i Chubin and his Persian troops are waiting in the fortress|group=\"Notes\"}}.\nBattle\nThe battle started immediately according to plan of Khalid, as the two cavalry force in the flank immediately moved and engaged the Sasanid coalition flanks, while Khalid himself and the centre of the army stayed behind. This caused 'Aqqah surprised by the inactivity of the Muslim centre and decided to ignore Khalid while focusing on the flanks battle.\nAs the Arab Christian forces were occupied by Muslim flanks, Suddenly, Khalid and his small bodyguards unis covering him in the centre galloped their horses swiftly towards Aqqa' position and caught the tens of thousand Arab Christian soldiers in surprise as they cannot react. Khalid and his forces immediately reached Aqqa' and engaged him in duel.  Ibn Athir recorded that Khalid \"''captured Aqqa' and carried him in his hands like small child\", and returned with his guard soldiers to the Muslim camp. The capture of Aqqa by Khalid also cited by Ibn Kathir in his book, Al-Bidaya wa'l-Nihaya''|group=\"Notes\"}}\nThe entire Arab Christian forces shocked as they now realized their commander captured alive and paraded around, causing them to stopped fighting and immediately surrender entirely to the Muslim force|group=\"Notes\"}}\nAftermath\nThe Muslim armies marched to the town garrison while parading their prisoners and lining them up in the front of defenders of the garrison and threaten to execute them if they did not surrender and open the gates. The garrison defenders instead rejected the threat and fight behind the wall, which caused Khalid to immediately commanded all prisoners to be executed immediately, including Aqqa'\nThen Khalid instructed the entire forces to storm the city of Ayn al-Tamr and slaughter the Persian inside the garrison after they breached\nAfter the city has been subdued, some Persians had hoped that the Muslim commander, Khalid ibn al-Walid, would be \"like those Arabs who would raid [and withdraw].\". However, Khalid continued to press further against the Persians and their allies in the subsequent Battle of Dawmat al-Jandal, while he leave two of his deputy, Al-Qa'qa' ibn Amr al-Tamimi and Abu Layla, to lead a separate forces in order to intercept another Persian-Arab Christians enemy coming from east, which led to the Battle of Husayd\nWhen the Muslim army conquered the town of Ayn al-Tamr they found 40 Arab Christian choirboys within a monastery. All of those 40 children were brought by the Muslim troops to Medina.\nMost of these choirboys are known as the ancestors of important figures of Islam in the later era, including:\n* Nusair, the father of Musa bin Nusayr, the supreme commander of the forces which later conquered Spain under the leadership of Tariq bin Ziyad, the second in command for Musa bin Nusayr.\n* Sirin, the other convert, was the father of the scholar Ibn Sirin who became one of the more celebrated Muslim theologians.\n* Yassar, the grandfather of famous Abbasid historian Ibn Ishaq\n* Abu Amrah, the grandfather Abdallah ibn Abu Amrah, a famous poet of later era.\nSee also\n* Abu Bakr\n* Umar ibn al-Khattāb\nNotes\nReferences\nBibliography\n* A.I. Akram, The Sword of Allah: Khalid bin al-Waleed, His Life and Campaigns, Nat. Publishing. House, Rawalpindi (1970) .\n*\n*\n*\n*\n*\n*\nExternal links\n* [https://web.archive.org/web/20041210000537/http://www.swordofallah.com/html/bookhome.htm A.I. Akram, The Sword of Allah: Khalid bin al-Waleed, His Life and Campaigns Lahore, 1969]"
    }
  ]
}