{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Coștangalia__disambig_1\n\n*Capitulation of the Polish insurrects two days later\n| combatant1        =  Polish National Government\n* Polish insurgents\n| combatant2        =  Romanian United Principalities\n| commander1        = Zygmunt MiłkowskiJózef Jagmin\n| commander2        = Athanasie Călinescu\n| strength1         = 213 soldiers\n| strength2         = 1,260 soldiers60 cavalrymen\n| casualties1       = 6 dead25 wounded\n| casualties2       = 18 dead40 wounded\n| campaignbox       =\n}}\nThe battle of Coștangalia was the battle fought on 15 July 1863, near the village of Coștangalia, Romanian United Principalities (now located in Moldova). It was fought by the Romanian forces, against the Polish rebels marching through territory of Romanian United Principalities, to join the rebels fighting in the January Uprising, in Poland.\nBackground\nFollowing the start of the January Uprising in January 1863 in Poland by the insurgent forces against the Russian Empire, the government of the Ottoman Empire, allowed Polish expatriates to form revolutionary forces on their territory that would aid the rebellion in Poland. The unit was formed in the city of Tulcea, and included 213 armed people. It was commanded by colonel Zygmunt Miłkowski. The unit marched through Ottoman territory towards the border of the Romanian United Principalities, with the plan of crossing its territory, to reach the Bessarabia Governorate, Russian Empire, and then move to the Podolian Governorate, where they hoped to reactivate fighting in the region of modern Ukraine.\nBattle\nAfter the Polish insurrectionaries crossed the border, Alexandru Ioan Cuza, the ruler of the Romanian United Principalities, sent forces to stop them from marching through his country. These forces (a regiment from Ismail, with reinforcements from Galați and Reni) consisted of 7 companies of infantry, counting 1,260 soldiers, with additional aid of 60 cavalrymen, all commanded by colonel Athanasie Călinescu. The Polish insurrectionaries were ordered to disarm, which they refused. As such, both sides began the fight on 15 July 1863, near the village of Coștangalia (now located in Moldova).\nMiłkowski ordered the infantry under the command of Józef Jagmin to scatter across the valley. On the right wing, the insurgents had captured local houses, and on the left, they had hidden behind trees. Soon after that, the Romanian forces began firing at the insurgents. In response, Polish infantry charged at the enemy. At the same time, the Romanian cavalry charged and  defeated the soldiers with bayonets, while the central line of the Romanian forces had been breached by the insurgents. Due to the casualties and the chaos of the battlefield, most of the Romanian forces retreated. The exception was the left wing of the infantry, which charged at Polish forces. However, they were not able to reach their target, and under heavy fire, were forced to retreat as well.\nAftermath\nThe Polish forces continued the retreat at ismail crossing the Prut River. Two days later, on 17 July, without high hopes to continue the march to the Russian border, the soldiers surrendered their weapons to Romanian soldiers and were interned at Cahul. Subsequently, they were allowed to continue their travel to Poland individually, without their weapons.\nNotes\nReferences"
    }
  ]
}