{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Ponte Novu__disambig_1\n\n| map_type    =\n| latitude    =\n| longitude   =\n| map_size    =\n| map_caption =\n| map_label   =\n| territory   =\n| result      = French victory\n| status      =\n| combatant1  =  Corsican Republic\n| combatant2  =\n| commander1  =  Carlo Salicetti\n| commander2  = Noël Jourda\n| strength1   = 15,000\n| strength2   = 15,000\n| casualties1 = Unknown\n| casualties2 = Unknown\n| notes       =\n}}\nThe Battle of Ponte Novu took place on May 8 and 9, 1769, between royal French forces under the Comte de Vaux, a seasoned professional soldier with an expert on mountain warfare on his staff, and the native Corsicans under Carlo Salicetti. It was the battle that effectively ended the fourteen-year-old Corsican Republic and opened the way to annexation by France the following year.\nThe Corsican commander-in-chief, Pasquale Paoli, was trying to raise troops in the vicinity but was not present in person. He trusted the defence to his second-in-command, Salicetti. His forces included a company of Corsican women under a female captain named Serpentini.\nPonte Novu is a Genovese bridge over the river Golo in north central Corsica in Castello-di-Rostino commune. The battle opened the route through the rugged mountains to the Corsican capital of Corte.  The battle is important as it marked the end of the Corsican war and paved the way for the incorporation of Corsica into France.\nVoltaire, in his Précis du Siècle de Louis XV, admiringly wrote about the battle: \"The principal weapon of the Corsicans was their courage.  This courage was so great that in one of these battles, near a river named Golo, they made a rampart of their dead in order to have the time to reload behind them before making a necessary retreat; their wounded were mixed among the dead to strengthen the rampart.  Bravery is found everywhere, but such actions aren't seen except among free people.\"\nStrategy\nThe French strategy\nThe French strategy was to disembark at Bastia, follow the current course of Route N193 (built over the old road) up the Golo River valley and over the passes to Corte, seizing the strategic center of Paoli's political power.\nThe Corsican strategy\nThe Corsican strategy was to block the passage at Ponte Novu, a choke point where the road had to cross the river on the bridge. To do this Paoli stationed substantial forces on either side of the bridge. Gaffori was posted to the north above the road at Lento and Grimaldi at Canavaggia. These forces were intended to prevent a build-up before the bridge. To that end the militia was placed on the road before the bridge as well. Paoli had his headquarters at Rostino above the bridge.\nTactics\n, when the bridge was destroyed by the retreating Germans.]]\nTactically the battle was something less than a model. Different historians give rather different pictures of the battle, but there are some elements in common. The bridge was actually being held by a unit of Prussian mercenaries which formerly had worked for the Genoese but whom Paoli had managed to employ once the Genoese no longer needed their services. Though working for Paoli, this unit opened fire on Corsican troops trying to retreat over the bridge under pressure from the French. A slaughter resulted from the crossfire, the river ran red and the rest of the Corsican army retreated in disorder. Bodies began showing up downstream.\nThe circumstances under which the Corsicans were trying to cross the bridge and the reasons why the Prussians opened fire and continued with a sustained fire are not clear. The accounts vary on this point but the courage and loyalty of the Corsican troops and their officers are clearly in question, with a suggestion of divisiveness regarding the French. Politically Corsica was not of one mind (as it is not today). Paoli found it necessary to enforce unity by burning the farms and executing the relatives of dissidents to Corsican rule, and everywhere the French were rewarding the cooperation of the Corsicans.\nIn the most flattering account, the Corsicans began the attack, splitting their forces to send 2000 men across the bridge against a much superior force, hence their reputation for bravery. Discovering the foolishness of their choice, they attempted to retreat across the river but for an unknown reason were met by the volley fire of the Prussians. Apparently, the shooters believed they were stopping an unauthorized retreat. Fortifying themselves as best they could, the majority of the 2000 died in the crossfire. Seeing their defeat, the confused troops on the other side retreated in disorder, pursued by the French.\nA less flattering version accuses Grimaldi of treachery and Gaffori of cowardice. Grimaldi, it asserts, was paid by the French to take no action and Gaffori feared to do so alone. Seeing the French come up with fixed bayonets, the militia before the bridge ran for their lives, attempted to force the bridge and were fired upon by the Prussians in self-defense.\nThe stories are not compatible, but Napoleon himself testified to the defense behind the rampart of the slain before the bridge and he is known to have gone over the battlefield with Paoli in 1790. One can only presume that Paoli had stationed his best and most loyal troops along the opposite bank and that, seeing the rout, they ran forward over the bridge to rescue the situation. This possibility places the Prussian unit in a very bad light. There appears to be no possibility, in this version, that they kept up a sustained fire by mistake, but evidence of collusion with the French, though a logical circumstance, did not survive.\nPaoli at his headquarters was then faced with a general rout. It must have been at this time that the coat he brought to England, if genuine, was shredded by French musket balls. Militarily it is striking that he did not tour the front line or station himself behind it as did both Napoleon and Wellington in all their battles. The more inexperienced troops were left to feel that they were acting on their own. In summary, it is probably safe to say that Corsica was not sufficiently unified for Paoli to make an effective defense, his top officers defected, his troops lacked motivation, and he relied on mercenaries of dubious loyalty to save the day against numerically superior and skilled French veterans and professional officers.\nGallery\nFile:Bridge of Ponte Novu Corsica restaured.jpg\nFile:Bridge of Ponte Novu Corsica 2008 cobblestone.jpg\nFile:Bridge of Ponte Novu Corsica 2008 arches.jpg\nFile:Bridge of Ponte Novu Corsica 2008 corbels.jpg\nNotes"
    }
  ]
}