{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Tal Afar (2005)\n\nUnited States Iraq\n| combatant2        =  Al-Qaeda in Iraq\n| commander1        = H. R. McMasterKhursheed Saleem Daski\n| commander2        = 22px Amir Mohammed Abdul Rahman al-Mawli al-Salbi\n| strength1         =  5,000  3,500\n| strength2         = Unknown\n| casualties1       =  4 killed  15 killed\n| casualties2       = 163 killed440–700 captured\n}}\nThe Battle of Tal Afar also known as Operation Restoring Rights was a military offensive conducted by the United States Army and supported by Iraqi forces, to eliminate Al Qaeda in Iraq and other insurgents in the city of Tal Afar, Iraq in response to the increase of insurgent attacks against U.S. and Iraqi positions in the area and to end the brutal tactics against the population by the terrorists. Coalition Forces consisted of 3rd Armored Cavalry Regiment, elements of the 82nd Airborne Division, and two brigades of the Iraqi 3rd Division, all were under the command of Col. H.R. McMaster. AQI had used the city as a staging ground for moving foreign fighters into Iraq since early 2005. The city was temporarily cleared for elections in 2005, but was not secured in a long-term view.\nThe offensive was launched on September 1, 2005, in a joint United States Army and the New Iraqi Army operation to destroy suspected insurgents' havens and base of operations in Tal Afar. The initial fighting was heavy, but most of the city was secured on September 3. Sporadic fighting and attacks would continue through most of September until the operation was declared finished on September 18.\nBattle\nCoalition forces developed and executed a detailed, painstaking methodology, that combined intelligence gathering, combat missions and stability programmes to reconstruct Coalition control of the city, one neighbourhood at a time. McMaster directed civilians to evacuate from the city in order to allow his forces to use artillery and attack helicopters to overcome the insurgents' makeshift Fortifications. The local rebels were reportedly led by Amir Mohammed Abdul Rahman al-Mawli al-Salbi, an AQI judge and official. Coalition forces fought street-to-street engagements with AQI terrorists and other insurgents, AQI insurgents tried to hold their ground, they also planned and executed coordinated attacks against Coalition troops, they also demonstrated the ability to somewhat command and control the insurgents in the City. Groups of insurgents perhaps hundreds massed to counterattack the advancing US and Iraqi forces, but Abrams tanks and Bradley IFVs \"tore them apart.\" In early September, the insurgents launched a counter-information propaganda campaign; over 17 days, US forces systematically destroyed insurgent cell throughout the city. Despite being encircled, some AQI terrorists escaped the city.\nBy September 18, the battle was over, Coalition forces succeeded in significantly eliminating AQI and other insurgents from the city, thereby creating a secure environment for the referendum in October and national elections in December 2005, Tal Afar went from being the city with the lowest number of voters to the highest in the country, schools and businesses reopened and the population transitioned back to living a normal life as possible. After the battle, McMaster positioned his troops 29 combat outposts throughout the city to hold the cleared areas, from these outposts they saturated Iraqi neighbourhoods with patrols, once civilians returned to the city, the use of force was minimized. 2nd Battalion 325th Infantry Regiment did not kill any civilians which won the appreciation of the locals; building intelligence on insurgents was made easier with the cooperation of the Shia minority in the city. Similarly McMaster could recruit a police force because the Shia were willing to serve, whereas Sunnis considered the Iraqi Army and police to be their enemy. The operation was considered one of the first successful counterinsurgency operations of the war and President George W. Bush remarked that \"the story of Tal Afar gives me confidence in our strategy, because in that city we see the outlines of the Iraq we've been fighting for.\"\nReferences"
    }
  ]
}