{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Llano El Espino\n\nThe Battle of Llano El Espino was a military confrontation fought between troops of the Province of San Salvador (present El Salvador) and the Captaincy General of Central America  (First Mexican Empire) on March 1, 1822.\nProvince of San Salvador\n| combatant2        =  First Mexican Empire\n| commander1        = Manuel José Arce\n| commander2        = Sergeant José Nicolás de Abós y Padilla\n| strength1         = 800\n| strength2         = 120\n| casualties1       = 5 killed, 8 wounded\n| casualties2       = 30 killed\n}}\nBattle on the Espino plain\nTroops from San Salvador were led by General Manuel José Arce who, after rejecting proposals to join the Empire of Mexico, sent troops into the Royalist city of Santa Ana to enforce the decision. The city requested Mexican military support leading to the arrival of Sergeant José Nicolás de Abós y Padilla, who would confront Arce's troops in Santa Ana. Santa Ana quickly surrendered and integrated itself into San Salvador.\nArce sent a few hundred troops to confront Abós y Padilla's army which retreated to the Sonsonate area and left many of the towns of the Ahuachapán Department in the hands of Arce's army. Arce then headed towards Sonsonate but learned of Abós y Padilla's plan to attack the Salvadoran army, leading Arce to lure and confront him on the Espino plain.\nBy the night of March 11, the Salvadorans had won the battle and the Guatemalan's had fled. Mexico-Guatemala suffered 13 casualties while San Salvador only suffered around 5.\nAftermath\nThe battle resulted in a temporary setback for the Mexican forces who were forced to retreat. San Salvador would continue its campaign of resistance against the attempts at annexation for the coming months and years. In the following year, San Salvador would eventually face defeat at the Battles of Mejicanos, Ayutuxtepeque, San Salvador and Gualcince. San Salvador was forced to integrate into the Mexican Empire until eventually joining the Federal Republic of Central America.\nSee also\n* Act of Independence of Central America\n* Central America under Mexican rule\n* History of El Salvador\nReferences"
    }
  ]
}