{
  "content": [
    {
      "type": "text",
      "text": "# Battle of São Vicente__disambig_1\n\n| status            =\n| combatant1        =\n| combatant2        =  England\n| commander1        = Andrés de Equino\n| commander2        = Edward Fenton\n| strength1         = 3 galleons\n| strength2         = 2 galleons1 pinnace\n| casualties1       = 1 galleon sunk1 galleon heavily damaged36 killed and 100 wounded\n| casualties2       = 8 killed and 20 wounded\n| campaignbox       =\n}}\nThe Battle of São Vicente was a minor naval engagement that took place off São Vicente, Portuguese Brazil on 3 February 1583 between three English ships (including two galleons), and three Spanish galleons. The English under Edward Fenton on an expedition having failed to enter the Pacific, then attempted to trade off Portuguese Brazil but were intercepted by a detached Spanish squadron under Commodore Andrés de Equino (a.k.a. Andres de Eguino or Andrés Higino). After a moonlit battle briefly interrupted by a rainstorm the Spanish were defeated with one galleon sunk and another heavily damaged along with heavy losses. Fenton then attempted to resume trading but without success and thus returned to England.\nBackground\nIn June 1582 after a troublesome delay, an English expedition had set off to reach the South China Sea via the Cape of Good Hope on a voyage of exploration. Their commander was Captain Edward Fenton with his 400-ton flagship galleon Leicester (ex-galleon Bear) under second-in-command Sir William Hawkins Jr (the nephew of Sir John Hawkins). Following Fenton was the 300-ton vice-flagship Edward Bonaventure under Luke Warde; the 50-ton pinnace Elizabeth under Thomas Skevington and the 40-ton bark Francis under John Drake (Sir Francis Drake’s nephew). The fleet's chaplain Richard Madox recorded the events of the voyage in a diary.\nOn 11 December 1582 Fenton arrived off Portuguese Brazil, the original plan having been changed with the hope of going through the Straits of Magellan instead of the Cape. On 17 December, after having refreshed with victuals ashore the English sighted and then captured the 46-ton Spanish bark Nuestra Señora de Piedad. The ship was bound from Brazil towards the River Plate with twenty one settlers under Francisco de Vera. From the Spaniard they had learned of Pedro Sarmiento de Gamboa's departure from Rio de Janeiro to fortify the Strait of Magellan. Three days later the English released their prize and by the 31st were unsure of being able to win past Sarmiento's new settlement in the Strait. Fenton after heated discussion with Hawkins reversed course the same evening, and headed north towards São Vicente hoping to do trade with the settlers there. The same night a storm dispersed the ships resulting in the loss of John Drake's eighteen-man Francis, never to be seen or heard of again.\nOn 30 January 1583 Fenton reached the bay of São Vicente with Leicester, Edward Bonaventure, and Elizabeth, and were in talks with the Portuguese residents of nearby Santos. Trade was refused on the account that Spain would react to this as hostile as they were now in Union. Fenton then went on to São Vicente itself hoping for better fortune.\nBattle\nOn 3 February three Spanish galleons, the largest being the 500-ton San Juan Bautista, the 400-ton Santa María de Begona and the 300-ton Concepción, entered the bay of São Vicente. They had been detached from the fleet of Diego Flores Valdez (Sarmiento's second-in-command) at Santa Catarina Island to return to Rio de Janeiro. Led by Commodore Andrés de Equino, they had some of the sick and injured from the Spanish expedition. They knew of the presence of the English ships by way having caught up with the Piedad that had been released by them.\nAt 11 pm in the moonlight, Equino had cleared for battle, stood in and bore down upon the three English ships. The English were surprised with many still on shore in the dark but as the Spanish approached, they placed and anchored themselves in seven fathoms of water just off a sandbar. Spanish combat tactics during this time was an attempt to grapple and then board. English tactics on the other hand was the heavy use of firepower to batter opponents into submission.\nThe Leicester being the main ship that stood the nearest as they approached opened a heavy fire. The Spanish ships were repelled and then tried to pass Leicester and move onto the next ship Edward Bonaventure. They were again repelled with heavy fire from the English cannons. The moonlit exchange continued with the English ships standing their ground and repelling the Spanish until about 4 am, when a rainstorm interrupted the battle. The Spanish ceased fire and moved off to effect repairs, with the English doing the same and collecting the rest of the men onshore.\nBoth sides had no idea what damage they had done to each other until dawn broke the next day. The English as a result of their firepower could then see that the Spanish ship Begonia had sunk revealing only her masts in the shallow water. This time in daylight at 10 am Equino's two galleons attacked but were repelled again by the anchored English ships.\nFinally the Spaniards with rising casualties and a lack of ammunition then broke off the fight, then stood out to sea before retreating towards Santos. Fenton's ships also running low on ammunition had been victorious and stayed put on the bar for the time being.\nAftermath\nThe battle had only cost eight Englishmen killed and twenty injured and only moderate damage to their ships. An indigenous who went aboard the Leicester told Fenton that the Spanish who had landed at Santos further down had suffered heavily. As well as Begonia sunk with the loss of 32 men killed, the galleon Concepción was heavily damaged bringing the total to nearly a hundred dead and many more wounded. The indigenous also said that the Spanish had carried the casualties to the shore in three small boats a number of times.\nFenton's ships stayed at São Vicente for only the rest of the day trying to at least do some trade but the Portuguese answer was the same as before.  Fenton fearing more Spanish ships then moved off to Espírito Santo where news of the battle had been received but with mixed feelings with the populace and trade was again refused. Disappointed, Fenton realized that trade with the Portuguese here was at an end. With supplies running low and quarrels with Hawkins decided to sail for England. Spanish sources argue that even if defeated, de Equino's action was pivotal in Fenton's decision to withdraw.\nWarde's Edward Bonaventure got separated from its consorts on 8 February and sailed alone towards England. After touching at Fernando de Noronha Island, Fenton then reached Salvador to refresh before returning to England. Richard Maddox died on the 27th but his diary proved invaluable and is now preserved at the British Museum.\nReferences\nCitations\nBibliography\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*"
    }
  ]
}