{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Chenab (1764)\n\n}}\nThe Battle of Chenab was fought in early 1764 between the forces of the Durrani Empire, led by Ahmad Shah Durrani, and the combined armies of several Sikh Misls, commanded by Charat Singh Sukerchakia, Hari Singh Bhangi, and Jassa Singh Ramgarhia. The battle took place near the Chenab River in Punjab and resulted in a Sikh victory, forcing Ahmad Shah Durrani to retreat to Afghanistan.\nIn the months leading up to the engagement, Ahmad Shah had made repeated attempts to secure Lahore, but each success proved temporary. In 1763, he appointed his commander Jahan Khan Popalzai governor of the city, while Zain Khan Sirhindi, the Durrani faujdar of Sirhind, was defeated by Jassa Singh Ahluwalia, who captured large amounts of booty and weakened Afghan authority. As Ahmad Shah crossed the Indus in January 1764 to assist his officials, the Sikh chiefs gathered over one hundred thousand horsemen, divided their forces into three divisions, and waited for him near the Chenab.\nWhen Ahmad Shah's force of around forty thousand men began to cross the river, the Sikhs attacked, leading to a fierce battle in which many soldiers on both sides were killed or drowned. The Durrani army broke and fled in confusion despite Ahmad Shah's attempts to rally his men. Following the battle, the Sikh chiefs celebrated Holi, sent letters to Durrani governors in Kashmir and Multan demanding revenue payments, and their forces entered Lahore, where heavy exactions were imposed on the city's inhabitants.\nBackground\nDuring the early 1760s, the Sikh Misls emerged as the dominant military power in Punjab, reducing the influence of the Durrani Empire. In 1762, Ahmad Shah Durrani marched from Kabul to suppress the Sikhs, who had gathered near the village of Kup with their families. His troops surrounded and attacked them, resulting in heavy casualties in an event later termed the Vadda Ghalughara (“Great Carnage”). Although thousands were killed, Durrani authority in Punjab remained unstable, and Sikh resistance quickly revived.\nPrelude and preceding campaigns\nAfter Ahmad Shah Durrani's withdrawal from Punjab in early 1763, the Sikh Misls emerged from the Lakhi Jungle and divided itself into two groups. The Budha Dal under Jassa Singh Ahluwalia, and the Taruna Dal led by Hari Singh Bhangi and Charat Singh Sukerchakia, started separate operations across the Punjab province. The Budha Dal advanced on Lahore, defeated local Afghan detachments, and briefly occupied the city, while the Taruna Dal remained at Amritsar to restore and repair the Golden Temple.\nThe Sikhs strengthened their hold in 1763 with small-scale offensives. The Taruna Dal attacked Kasur in May, killing Afghan leader Usman Khan there and gaining a substantial amount of wealth. At about this time, another Sikh faction, the Budha Dal, entered Jullundur Doab, forcing the Afghan governor Saadat Yar Khan to stay in his capital. Later that year, the Durrani commander Jahan Khan Popalzai attempted to cross the Chenab River near Wazirabad but was defeated and forced to withdraw toward Sialkot, abandoning his camp and family, including his wife and daughters, who were captured by the Sikhs.\nBy the close of 1763, the Sikhs had established control over most of central Punjab. The state of Malerkotla was destroyed, and its ruler, Bhikhan Khan, was killed during resistance. In early January, the Sikhs attacked several locations, resulting in the massacre of Brahmins and Muslim Ranghars. On January 14, 1764, the Misls captured Sirhind, where Zain Khan Sirhindi was killed in combat. The fall of Sirhind marked the elimination of one of the last Durrani-controlled strongholds in eastern Punjab and signified a decisive shift in regional power toward the Sikh confederacy.\nBattle\nIn early 1764, Ahmad Shah Durrani advanced from Kabul to reassert control over Punjab. After crossing the Indus River, he remained for some time at Hasan Abdal before proceeding toward Rawalpindi with his commanders Shah Wali Khan, Shah Pasand Khan, and Jahan Khan Popalzai. The Sikh Misls, under Charat Singh Sukerchakia, Hari Singh Bhangi, and Jassa Singh Ramgarhia, assembled large forces in the region of Gujrat, Sodhra, and Shah Daula. Reports indicate that the Sikhs numbered over one hundred thousand men, divided into several divisions, while the Durrani army fielded about forty thousand.\nThe Sikh leadership resolved not to engage the Durrani army until Ahmad Shah Durrani had crossed the Chenab River, believing that the area east of the river provided better defensive ground and supplies. When the vanguard of the Durrani army began to cross the river followed shortly after by Ahmad Shah Durrani and his main force the Sikh divisions had advanced from Chak Guru and engaged them. Contemporary reports describe severe fighting along the riverbanks, with heavy losses on both sides and many soldiers drowning while attempting to cross the river amid the confusion of battle. After several hours of fighting, Ahmad Shah Durrani's army was forced to withdraw from the battlefield. During the engagement, his horse drowned while crossing the river, leading to uncertainty among his troops as to whether he had survived. The Afghan line collapsed, and the retreat soon turned into a rout leading to the Shah's camp being Sacked. Contemporary reports describe how, after the defeat, Ahmad Shah's forces reached the Jhelum River in disorder. Despite the Shah's efforts to rally his men removing his turban and urging them to stand firm no one obeyed, and units fled across the river “pell-mell, like an army without defence or transport.”\nTravelling nearly thirty kurohs (approximately 90 kilometres) within a single day and night, the remnants of Ahmad Shah’s army reached Hasan Abdal, abandoning the camp, baggage, and supplies to plunder. Rumours soon circulated that the Shah had been killed, though his supporters claimed that he had survived and crossed the Indus River with the remaining troops on 25 February 1764.\nAftermath\nFollowing the battle, the Sikh chiefs including Charat Singh Sukerchakia, Hari Singh Bhangi and Jassa Singh Ramgarhia assembled at Amritsar during the festival of Holi. Afterward, they advanced toward the Jhelum River, establishing outposts across the area and planning to extend their authority toward Potohar on the eastern side of the Indus River. Letters were dispatched to regional governors and zamindars, including Ghulam Shah Latti of Multan and Muhammad Sarbuland Khan, the Governor of Kashmir, demanding that revenues formerly paid to Ahmad Shah be remitted to the Sikhs. The correspondence warned that in the event of delay, armed action would follow.\nAfter celebrating Holi at Amritsar, Hari Singh Bhangi and Charat Singh advanced to Lahore and captured the city. Fighting broke out between their contingents, causing several hundred casualties before peace was arranged. Charat Singh's forces retained control of the city and reinstated Kabuli Mal as finance minister, who was ordered to collect large sums from the inhabitants. Soon afterward, Hari Singh Bhangi sent his son Jhanda Singh Bhangi southward to extend Sikh influence toward Multan. Sikh forces attacked Kiri Sultan Hayat Khan, seizing the Sadozai treasury valued at several million rupees and setting the complex ablaze. Members of the Sadozai household were killed or taken captive, and Afghan sources reported that women of Ahmad Shah's family were subjected to humiliation during the assault.\nRecognizing the deteriorating situation in Punjab, Ahmad Shah Durrani organized another expedition in the latter part of 1764 to recover his authority. As reported by Qazi Nur Muhammad, who travelled with the force, the Shah sought the support of Nasir Khan I Ahmadzai and framed the campaign as a Jihad against the Sikhs. This seventh invasion of India (1764–65) reached as far as Sirhind, but the Durrani troops were repeatedly checked in minor engagements. Sikh detachments followed the retreating Afghans toward the Indus River, leaving the two sides roughly equal in military strength and confirming the Sikh control over most of Punjab.\nReferences\nCitations\nWorks cited\n*\n*\n*\n*\n*\n*\n*\n*"
    }
  ]
}