{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Las Piedras (1811)\n\nSpain\n}}\n*Royalist Army of Montevideo\n| combatant2   =  Revolutionaries of the United Provinces of the Rio de la Plata\n| commander1   =  José Posadas\n| commander2   =  José Gervasio Artigas  Manuel Francisco Artigas\n| strength1    =\n| strength2    =\n|casualties1   = 638\n|casualties2   = Negligible\n}}\nThe Battle of Las Piedras was fought on May 18, 1811 as part of the Rio de la Plata war of independence. It was a resounding victory for the revolutionary forces, led by José Gervasio Artigas.\nBackground and development of events\nIn 1810, the May Revolution forced the Spanish to abandon Buenos Aires, but they held on to the Banda Oriental (present-day Uruguay), as Spain moved the headquarters of the Viceroyalty of the Río de la Plata to Montevideo. At the beginning of April 1811, the revolutionary José Gervasio Artigas returned to the Banda Oriental with approximately 180 men provided by the Government of Buenos Aires. On April 11, he issued the Mercedes Proclamation, assuming control of the revolution.\nThe Governor of Montevideo, Francisco Javier de Elío, appointed frigate-captain  as the head of the forces loyal to Spain. Posadas installed his headquarters at San Isidro Labrador de Las Piedras near Montevideo, to provoke a decisive battle against the revolutionaries.\nMeanwhile, José Artigas was camped near Nuestra Señora de Guadalupe with an army of a thousand men. The army of Posadas counted 1230 men, of which some 200 would defect to Artigas in the midst of battle.\nThe battle happened on May 18 at Las Piedras, and resulted in a total victory for the revolutionaries. José Posadas capitulated. It was at this occasion that Artigas pronounced his famous sentence \"Clemencia para los vencidos, curad a los heridos, respetad a los prisioneros\" (Mercy to the vanquished, cure the injured, respect the prisoners), an unusual decision in those times, referring to the Spanish wounded and prisoners. One of the casualties on the revolutionary side was Manuel Artigas, nephew of José Artigas.\nBoth armies fought in the name of King Ferdinand VII of Spain.\nThe Battle of Las Piedras by Diógenes Hequet\nImportance of the battle\nSome historians consider the victory in the Battle of Las Piedras as crucial for the survival of the revolution in Uruguay and Argentina, after the defeats of General Manuel Belgrano in Paraguay and Paraná.\nAfter the battle, the Royalists remained in control of only Colonia del Sacramento and Montevideo, which was finally taken by Carlos María de Alvear on June 20, 1814.\nThe day of the battle, May 18, is now an official holiday in Uruguay. The date is also commemorated in the military and civilian honour, the 18 May 1811 Medal.\nSee also\n* First Siege of Montevideo\nExternal links\n* [https://web.archive.org/web/20110420192935/http://www.bicentenario.gub.uy/ Official website of the Bicentennial]"
    }
  ]
}