{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Silistra__disambig_1\n\n.\n| place             = near Silistra, Bulgaria or Romania\n| result            = Rus' victory\n| territory         =\n| combatant1        = Bulgaria\n| combatant2        = Kievan Rus\n| commander1        = Peter I of Bulgaria\n| commander2        = Sviatoslav Igorevich\n| strength1         = 30,000\n| strength2         = 10,000–60,000\n| casualties1       = Heavy\n| casualties2       = Heavy\n}}\nThe Battle of Silistra/Dorostolon occurred in the spring of 968 near the Bulgarian town of Silistra, but most probably on the modern territory of Romania. It was fought between the armies of Bulgaria and Kievan Rus' and resulted in a Rus' victory. Upon the news of the defeat, the Bulgarian emperor Peter I abdicated. The invasion of the Rus' prince Sviatoslav was a heavy blow for the Bulgarian Empire, which by 971 lost its eastern provinces to the Byzantine Empire.\nOrigins of the conflict\nFrom the 940s the Magyars began repeatedly to launch pillage raids into the Bulgarian Empire. Emperor Peter I was unable to stop them and as the Byzantines were unwilling to send any help he finally allied with the Magyars and gave them safe passage through Bulgaria to attack Byzantine Thrace. In 968 the Byzantine emperor Nikephoros II Phokas paid the Kievan knyaz Sviatoslav Igorevich to attack Bulgaria in answer of the alliance between the Bulgarian emperor Peter I and the Magyars.\nBattle\nSviatoslav Igorevich gathered 10,000 or 60,000 troops and started his campaign in the early spring of 968. He met the Bulgarians, who were less than his army, near Silistra. The battle continued the whole day and until dark the Bulgarians seemed to have overwhelmed the Kievans, but, elated by Sviatoslav's personal example, the latter were victorious. The loss forced the Bulgarian tsar to shut himself up in Druster. During this time, Svetoslav plundered the Bulgarian lands unhindered, but soon a message about a Pecheneg attack on Kiev made him return to his homeland, taking with him a rich booty.\nAftermath\nThe Rus' forces continued their victorious campaign. According to the Bulgarian historian Vasil Zlatarski, Sviatoslav seized 80&nbsp;towns in northeastern Bulgaria. They were looted and destroyed but not permanently occupied. Tsar Peter I suffered an epileptic stroke when he received news of the defeat. The Rus' wintered at Pereyaslavets, while the Bulgarians retreated to the fortress of Dorostolon (Silistra). Sviatoslav Igorevich was eventually forced to return to Kiev after Bulgarian diplomacy inspired the Pechenegs to besiege his capital. During his absence, the new Bulgarian army managed to temporarily recapture the fortress of Pereyaslavets and repulse the Rus' garrisons from the remaining conquered fortresses out of the Bulgarian lands.\nSiege\nThe reality of what happened during the siege remains a debatable issue, Russian sources claim that after the victory in the battle, the Rus' warriors took the remaining Dorostolon and other cities in Bulgaria, Bulgarian sources claim that the Bulgarians successfully repelled the siege of the Rus. Some sources do not mention the siege at all after the battle.\nReferences\nBibliography\n*\n*\n*\n*\n* Атанас Пейчев и колектив, 1300 години на стража, Военно издателство, София 1984.\n* Йордан Андреев, Милчо Лалков, Българските ханове и царе, Велико Търново, 1996.\n* Божидар Димитров, Българите-първите европейци, София, 2002.\n*\n*\n*\n*\nNotes"
    }
  ]
}