{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Kufra (1931)\n\n| combatant2        =  Senussi\n| commander1        =  Rodolfo Graziani Amedeo D'Aosta\n| commander2        =  ‘Abd el Galil Seif en Naser (?)\n| strength1         = 4,000 men20 airplanes5,000 camels\n| strength2         = 600 men\n| casualties1       =  2 killed and 16 wounded\n| casualties2       =  100 killed, 14 wounded and 250 capturedOnly a few escaped\n| notes             =\n| partof            = the Second Italo-Senussi War\n| image_size        = 300\n| territory         = Awjila, Jalu, Zella and Tazirbu are incorporated into Italian Libya\n}}\nThe Battle of Kufra occurred during the Italian colonization of Libya and was a climactic moment in the Second Italo-Senussi War. The Italians were divided into divisions which attacked Awjila, Jalu, Zella, and Tazirbu, fighting mainly against the Zuwayya tribe.\nGraziani's campaign against the Sanussi was at that time one of the largest desert campaigns committed, and was likewise a navigational and organizational accomplishment, given that Italian troops had to cross hundreds of miles of waterless desert before engaging in battle.\nBackground\nThe Sanussi transferred their headquarters to Kufra in 1895. During this time, they encouraged trade and agriculture, and developed several wells at various locations, as well as negotiated peace between the Zwaya and Tibbu tribes. In 1902, the Ottomans were called in there by the Sanussi to prevent the French from going any further within their territory. Kufra is likewise an important spot along an important trade route going from Benghazi to Ouaddaï. Reportedly, no European had ever even seen the city until the time of World War I.\nPrelude\nAfter taking command of Libya, Graziani began to isolate the Sanussi in Libya, first by constructing a large wall along the border with Egypt, then by launching offensives to take important oases and waterholes, pushing the Bedouins out into the desert. Many of them fled to Kufra, which was positioned five hundred miles out in the desert. To overcome this, Graziani designed a mobile units he named \"Auto-Saharan\" companies. They combined armored cars, scouting vehicles, and motorized infantry. Light aircraft were also designed to accompany the units, not only for attacks but also to report enemy positions and assist with ground commands. In Autumn of 1930, Graziani made careful reconnaissance of the routes to Kufra from the north and the west. Two columns were designed to attack the city (some sources wrongfully say three): the first would march from Wau el Kebir and march east towards the city, while a second column would head south from Ajedabia. The first column ended up not materializing, but the second column pushed forward.\nIn late 1930, Graziani took advantage of the colder winter months and launched his attack. Italian soldiers planted iron posts at every kilometer, so that supply units in the rear could easily follow the route to the army.\nBattle\nThe Italians encountered Sanussi resistance at Hauuari, north of the town, on January 19, 1931. 'Abd el Galil Seif en Naser, who had fought against the Italians in 1915 and defeated them at Qasr bu Hadi, contributed to the defense.\nThe resistance was overcome, and the Italians began to siege outlying villages. Tribesmen who retreated from the battle were strafed by Italian aircraft. Some fell back to the date palms of the oasis, only to be overrun by the Italians. Muhammad Asad, who claims to have spoken to a survivor of the battle in his book The Road to Mecca, copied the man's report as follows:They came upon us in three columns, from three sides, with many armoured cars and heavy cannon. Their aeroplanes came down low and bombed houses and mosques and palm groves. We had only a few hundred men able to carry arms; the rest were women and children and old men. We defended house after house, but they were too strong for us, and in the end only the village of Al-Hawari was left to us. Our rifles were useless against their armoured cars; and they overwhelmed us. Only a few of us escaped.The city was eventually taken on February 20.\nItalian atrocities\nMany Arab civilians fled to British or French territories. Galil himself fled into Egypt. His brother, Ahmed, fled into Chad, where he hoped to raise an army to fight the Italians again. Many refugees had to flee without grabbing provisions or water. Some refugees had to cross over three hundred miles of the Great Sand Sea in order to reach safety. On the way, they were often strafed or bombed by pursuing Italian airplanes. For years after the battle, explorers continued to find the bodies of refugees who perished in the desert, their remains mummified in the desert aridity.\nThe survivor Asad spoke with gave a report on what he claims happened within Kufra after the battle:I hid myself in the palm orchards waiting for a chance to make my way through the Italian lines; and all through the night I could hear the screams of the women as they were being raped by the Italian soldiers and Eritrean askaris. On the following day an old woman came to my hiding place and brought me water and bread. She told me that the Italian general had assembled all the surviving people before the tomb of Sayyid Muhammad al-Mahdi; and before their eyes he tore a copy of the Koran into pieces, threw it to the ground and set his boot upon it, shouting, \"Let your beduin prophet help you now, if he can!\" And then he ordered the palm trees of the oasis to be cut down and the wells destroyed and all the books of Sayyid Ahmad's library burned. And on the next day he commanded that some of our elders and ulama [scholars] be taken up in an aeroplane - and they were hurled out of the plane high above the ground to be smashed to death...And all through the second night I heard from my hiding place the cries of our women and the laughter of the soldiers, and their rifle shots...\nAftermath\nThe taking of Kufra broke Sanussi power in Libya. Graziani organized a major Italian compound and base of operations in the city, and used it to further Italian control in southern Libya. Omar Mukhtar, the leader of the rebellion, would be captured during the battle of Uadi Bu Taga and would be hanged by Italian forces in September of that same year. Graziani later boasted that the Battle of Kufra was \"the greatest operation ever accomplished in the Sahara\", and one which stunned Italy's British and French neighbors. For the Italians, it was a major morale boost, as it meant that, after fighting a war for nearly twenty years, they were at last masters of the country.\nKufra remained an Italian stronghold in Libya until its capture by British and Free French forces in World War II.\nIn popular culture\nThe battle is portrayed in the Libyan-funded film Lion of the Desert, with Oliver Reed playing the role of Graziani.\nReferences"
    }
  ]
}