{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Kashmir (1814)\n\n| combatant1        = Afghan EmpirePoonchRajouri\n| combatant2        = Sikh Empire\n| commander1        = Azim KhanRuhullah KhanRaja Aghar Khan\n| commander2        = Ranjit SinghRam DayalHari Singh Nalwa\n| strength1         = Unknown\n| strength2         = 30,000 under Ram Dayal\n| casualties1       = Unknown\n| casualties2       = Heavy\n}}\nThe Battle of Kashmir took place in 1814 after the battle of Attock. Ranjit Singh began planning to invade Kashmir, leading to the Sikh invasion led by Hari Singh Nalwa and Ram Dayal.\nSikh forces entered the valley led by Ranjit Singh, Ram Dayal, and Hari Singh Nalwa. As they progressed into Kashmir, they faced exceeding difficulties with local rulers, the terrain, and heavy rains. Guerilla attacks also plagued the Sikh armies rear, with desertion rampant and the plundering of the Sikh camp. Finding Azim Khan firmly entrenched in the Tosa Maidan pass, Ranjit Singh ordered a complete withdrawal of the expedition.\nKashmir remained under Afghan control until the battle of Shopian in 1819.\nBackground\nRanjit Singh established ambitions over conquering Kashmir as early as 1799 following the withdrawal of Zaman Shah Durrani after his invasions in the Punjab. Ranjit Singh mustered his forces under Sahib Singh Bhangi, but the force did not advance farther than Bhimber, as Ranjit Singh thought to consolidate his position in Lahore first rather than face retaliation.\nIn 1808, Ranjit Singh expanded his ambitions once again and deployed spies on the road to Kashmir, and began encroaching on it by subjugating Bhimber in 1811, and Rajouri in 1812. The Afghan governor of Kashmir at the time was Ata Muhammad Khan.\nFateh Khan Barakzai, the Afghan Wazir, wished to depose Ata Muhammad Khan from his governorship due to his previous aid towards Shah Shuja Durrani, as well as he had never gave tribute to the government. The vast riches of the region also attracted Fateh Khan, leading to him creating an alliance with the Sikhs in case they attempted to cut off his forces while he campaigned in Kashmir. Ranjit Singh also wished for his soldiers to accompany this expedition to acclimatize towards the harsh climate, and to secure the release of Shah Shuja Durrani and to take the Koh-i-Noor diamond from him.\nA treaty was thus made at Rohtas on 1 December 1812, where Ranjit Singh offered 12,000 men under Dewan Mokham Chand.\nAt Rajouri, both Afghan and Sikh armies met. They then proceeded towards Kashmir. Difficulties with snowfall, and enmity with the Sikhs saw the Afghans leave the Sikh force behind and instead advance forward by forced marches. Mohkam Chand, the commander of the Sikh forces, found a route that led quicker to Srinagar and arrived there. Kashmir was then captured by the Afghan-Sikh forces, but remained under Afghan control with Fateh Khan Barakzai. Fateh Khan later awarded the government of Kashmir to his brother, Azim Khan.\nAfter the battle of Attock, Ranjit Singh's ambitions over Attock continued despite the combined Afghan-Sikh expedition. Having forced to submission much of the hill states south of the Pir Panjal Range, including the states of Akhnoor, Bhimber, Rajouri, and Poonch.\nIn preparations for a campaign to Kashmir, Ranjit Singh inspected his troops before returning to Lahore in December 1813.\nExpedition\nIn March 1814, Ranjit Singh mobilized his armies and began advancing on Kashmir. Sikh forces reached Bhimber in June 1814, and Rajouri following it. The chief of Rajouri, Raja Aghar Khan, misled the Sikhs, having them leave all their heavy cannons at Rajouri, while only light guns accompanied the Sikhs. The Sikh army split into two, with one contingent of 30,000 men led by Ram Dayal alongside Khushal Singh Jamadar and Hari Singh Nalwa. The contingent under Ram Dayal was ordered to march to the Pir Panjal Pass, while Ranjit Singh led his own contingent to march on the Tosa Maidan.\nThe force under Ranjit Singh continued onto Poonch, and then beyond Rajauri on 16 June 1814. Mazhar Ali then sent artillery pieces to the Tosa Maidan pass, but his route was blocked by the Ruhullah Khan, ruler of Poonch. In a skirmish, around 500 men were killed and wounded on both sides. Aghar Khan joined Ruhullah Khan, and spread rumors that the Sikhs had been defeated. As the local population heard this, they began plundering the Sikh army. The Sikh forces lost much of their equipment, including 2,000 guns and 2,000 swords. With this, the two chiefs began harassing Sikh forces with their armies.\nTowards the end of June, Ranjit Singh arrived in Poonch only to find the town entirely empty and deserted. Supplies continued to diminish, and on 2 July 1814, it was reported to Ranjit Singh by Fateh Singh Ahluwalia and Jodh Singh of Kalsia that the Sikh forces depleting due to starvation. Sujan Rae Adalti and his contingent of 4,000 men deserted in desperate need of food, returning to the Punjab on 5 July. To further worsen the situation, Ruhullah Khan ordered the destruction of all food materials in nearby towns, and to desert towns. He also encouraged resistance by guerilla attacks on the flanks or rears of the Sikh armies.\nThis caused further delays in the Sikh army. On 18 July, the Sikhs arrived at Tosa Maidan. However, Ranjit Singh was opposed by Ruhullah Khan, who opened numerous battles with the Sikhs on 29 and 30 July and compelled Ranjit Singh to retreat to Mandi with the loss of many men. Rain also continued to hamper both sides. On 5 August, the Sikh forces arrived at Sandha, and after advancing forward, Ranjit Singh found that his guns could not pass a stream. To his further annoyance, he found Azim Khan firmly entrenched in the defenses of the Tosa Maidan pass.\nWith all the factors weighing in, Ranjit Singh ordered a complete retreat, dispatching 5,000 men to reinforce Ram Dayal under Bhayya Ram Singh. Mit Singh Bharania was killed by enemy fire sometime during this expedition, and the Sikh armies retreated to Lahore. Much of their luggage accompanying the expedition was plundered, and Ranjit Singh returned to Lahore in August 1814.\nThe expedition was considered a miserable failure.\nAftermath\nKashmir remained part of the Durrani Empire until 1819 when it was finally conquered by the Sikhs.\nReferences"
    }
  ]
}