{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Ningpo\n\n| result            = British victory\n| combatant1        =\n* British East India Company\n| combatant2        =  Qing China\n| commander1        = Sir Hugh Gough\n| commander2        = Yijing\n| strength1         = 700\n| strength2         = 3,000\n| casualties1       = 5 wounded\n| casualties2       = 500–600 killed\n| notes             =\n}}\nThe Battle of Ningpo was an unsuccessful Chinese attempt to recapture the British-occupied city of Ningbo (Ningpo) during the First Opium War. British forces had bloodlessly captured the city after their victory at Chinhai, and a Chinese force under the command of Prince Yijing was sent to recapture the city but was repulsed, suffering heavy casualties. The British eventually withdrew from the city the following spring.\nBackground\nPrior to the outbreak of the First Opium War, the city of Ningbo had roughly 250,000 inhabitants and was frequented by warships of the British Royal Navy. On 15 September 1840, after the outbreak of war between China and Britain, the British warship HMS Kite became grounded near Ningbo. The survivors of the shipwreck were captured by Chinese forces and paraded through the city and countryside in small cages. The mistreatment of the captured sailors by the Chinese influenced the attitudes of the occupying British forces in Ningbo as the event became widely known.\nThe following year, on 10 October 1841, the British captured Chinhai after a fierce engagement between Chinese and British forces. The British soon dispatched HMS Nemesis up the Yong River to discover if it was navigable. Upon discovering that the river could accommodate their large steamers, a Royal Navy fleet sailed to Ningbo. On 13 October, British troops entered Ningbo under the tune of \"Saint Patrick’s Day in the morning\" (sung by the Royal Irish band) and occupied the city unopposed. The capture of Ningbo was a stepping stone in British plans to launch an attack on Nanjing (Nanking) as part of their larger strategy to capture Beijing (Peking). The British planned to occupy Nanjing and move up the Grand Canal towards Beijing.\nOccupation of Ningbo\nUpon occupying the city, several British soldiers, infuriated by the mistreatment of the prisoners of war from the Kite, began to loot the city, though many in the occupation force condemned looting and prevented their comrades from undertaking any such action. The British burned down the prison where the prisoners from the Kite had previously been kept, along with confiscating the city's municipal funds, which consisted of over £160,000; a ten percent increase in taxation was also levied on the citizens of Ningbo. Due to the Ningbo police having fled prior to the British occupation, local Chinese freebooters looted the city and extorted money from other locals, many of whom expressed their anger by throwing trash and feces at unaccompanied British soldiers. The British officers in charge of the occupation force, Sir William Parker and Sir Hugh Gough, publicly expressed their disapproval at incidents of looting and mistreatment of the Ningbo citizenry. On the other hand, Anglo-Irish soldier and colonial administrator Sir Henry Pottinger, who arrived on 13 January 1842, felt \"considerable satisfaction\" in looting the city. After Pottinger arrived to Ningbo, he \"ordered the confiscation of all the Chinese ships and provisions and other property, including the main Pagoda's bell, which was sent to India as another symbolic prize.\" He also appointed Lutheran Reverend Karl Gutzlaff, a German missionary, as the highest ranking civil magistrate in Ningbo. Gutzlaff strictly enforced the laws of the new administration and hired a small group of spies to monitor the city and the activities of the residents, allowing British officials to impose higher taxes on the upper class citizens in Ningbo. The British also opened up the public granary and began to sell the grain contained within to local citizens at cheap prices.\nFollowing the loss of Ningbo, the Emperor sent his cousin, Prince Yijing, to Suzhou (Soochow) to recruit men to recapture the city and \"drive the English into the sea.\" However, most of the recruits were poorly trained and unprepared for combat. Despite this, Yijing ordered his force to go on the offensive. They fought several minor skirmishes with British troops outside of Ningbo, being defeated each time. Fearful of possible infiltration by British spies, security was heightened in the Chinese camp, with the stated aim of preventing those disloyal to the Emperor from coming near Prince Yijing. Plans were drawn up to recapture the city and destroy the Royal Navy's warships in the Yung River. One plan called for the destruction of the warships via using firecrackers tied to monkeys who would be flung onto the ships. This plan, as well as plans to use fire rafts to light the Royal Navy's warships alight, were both discarded prior to the battle.\nBattle\nThe Chinese, under the command of Prince Yijing, gathered over 3,000 men for the assault on the city. The original plan had been to assault Ningbo with almost 50,000 troops; however, most of these men failed to muster in time. The British occupation force was also depleted in number, with fewer than seven hundred soldiers stationed in the city. However, the Chinese plan of attack was exposed when a group of local boys who had befriended the British warned them of the coming attack. On March 10 at roughly 4:00am, a British sentry spotted a Chinese soldier advancing towards the western city gate. The sentry repeatedly shouted \"Wei lo\" (go away in Cantonese) at the advancing soldier, who eventually responded \"Wei loa moa\" (will not go) before being shot dead. Some Chinese soldiers had misunderstood their orders and were only equipped with knives during the battle.\nThe Chinese attacked the southern and eastern city walls, overwhelming the British soldiers stationed at the southern city gate. At the western city gate, a group of Chinese soldiers under the command of Tuan Yu-Fang approached the walls, and upon seeing that the gate was opened and seemingly undefended, were ordered to capture it by Tuan. However, the British had mined the gate and deliberately left it open \"in order to give the impression that they did not mean to defend it\", and one hundred attacking Chinese soldiers were killed in the ensuing blast, forcing them to call off the attack. Meanwhile, at the southern city gate, the attacking Chinese had pushed back the British soldiers stationed there into the city streets, but were eventually repelled by 150 British soldiers under the command of Sir Hugh Gough, with the British deploying a field artillery piece directly in a city street. British and Chinese officials alike noted that many of the Chinese soldiers were under the influence of opium during the battle, which notably decreased their combat effectiveness. The Chinese retreated, having suffered between 500 and 600 casualties while the British suffered 5. Historians have noted that heavy rains and mud had delayed the Chinese from swiftly bringing in reinforcements before and during the battle.\nAftermath\nFollowing the battle, the British continued to occupy Ningbo until the following spring when they looted the city one final time before departing. The defeated Chinese armies retreated from Ningbo to the town of Cicheng (Tz’uch’i), eighteen miles north of Ningbo. The wounds suffered by Chinese soldiers in the battle, including shrapnel and bullet wounds, proved exceptionally difficult to treat. During the final phases of the British occupation, kidnappings and murders in Ningbo experienced a massive increase as law and order continued to break down, with portions of the city being set aflame. The British administration executed numerous local citizens found guilty of such crimes. The 1842 Treaty of Nanking, which ended the war, stipulated that Ningbo would become one of five \"treaty ports\", which would be permanently opened to foreign trade. Following the end of the war, the city became part of the British sphere of influence in China.\nNotes\nReferences\n*\n*\n*\n*\n*\n*\n*\n*\n*"
    }
  ]
}