{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Malcolm's Mills\n\nUnited States\n|combatant2  =\n|commander1  = Duncan McArthur\n|commander2  = Henry BostwickJoseph RyersonAdam Muir\n|strength1   = 700\n|strength2   = 550\n|casualties1 = 1 killed6 wounded\n|casualties2 = 18 killed9 wounded126 taken prisoner450 killed, wounded or captured during entire raid\n}}\nThe '''Battle of Malcolm's Mills''' was the last battle of the War of 1812 fought in the Canadas. A force of American mounted troops overran and scattered a force of Canadian militia. The battle was fought on November 6, 1814, near the village of Oakland in Brant County, Upper Canada, and was part of a series of battles fought by American Brigadier General Duncan McArthur on an extended raid into Upper Canada, known variously as McArthur's Raid or Dudley's Raid. Marching over  into Canada, the Americans returned to Detroit on November 17 after 11 days of raiding the Ontario Peninsula.\nMcArthur's raid\nIn October 1814, the American force of about 700 mounted riflemen under Brigadier General Duncan McArthur advanced rapidly as they left Detroit and raided the Thames Valley. The plan was to devastate the Grand River settlements and the region around the head of Lake Ontario which supplied flour to the British forces on the Niagara frontier. When the raid was launched, the British Army had just raised the Siege of Fort Erie on the Niagara River at the eastern end of the Niagara peninsula, and an American army under Major General George Izard was beginning a cautious advance from Fort Erie.\nMcArthur was delayed for two days in crossing the swollen Thames, but his force subsequently moved so rapidly that they reached the weak British post at Delaware on October 30 before any warning of their approach was received. McArthur maintained his rapid pace partly by leaving exhausted horses wherever fresh horses could be commandeered from Canadian farms or settlements.\nMajor Adam Muir, the local British commander, ordered the Norfolk Militia to assemble, first at Culver's Tavern in Woodhouse township, then in Burford. McArthur arrived at Oxford on November 4, where his men ransacked the village in search of forage and provisions. He learned that the militia were assembling at Burford and warned the inhabitants of Oxford that the property of anyone who warned them would be destroyed. Two men nevertheless alerted the militia under Bostwick, they were betrayed and their dwellings were duly razed.\nBostwick, having been warned, retired to Malcolm's Mills. He was joined by Lieutenant Colonel Joseph Ryerson and Major George Salmon with further members of the Nolfolk Militla. Major Muir had gone forward to secure the ford over the Grand River, and enlist warriors of the Six Nations. However, Lieutenant Colonel Parry of the 103rd Regiment, commanding at Burlington had feared for his post and had already summoned most of the warriors there. Bostwick was left with a force of about 400 men, who were discouraged by reports of overwhelming American strength.\nOn November 5, McArthur advanced to Burford, where there was no opposition, and continued on to Brant's Ford on the Grand River. The ferry had been destroyed, the river was swollen and an unknown number of enemy disputed the crossing. As it was growing dark, McArthur encamped for the night. During the night, he learned that the American army under Major General Izard had called off its advance and was retiring across the Niagara River. As there was no longer any need to make a distraction to assist Izard, McArthur therefore decided against attacking Burlington and instead decided to disperse the militia at Malcolm's Mills before continuing his raid.\nBattle of Malcolm's Mills\nEarly on November 6, 1814 McArthur's men encountered 550 Canadian militia commanded by Colonels Ryerson and Bostwick at Malcolm's Mills. The militia occupied what appeared to be a strong position, on high ground behind an unfordable creek. While a Kentucky battalion began careful skirmishing to pin down the defending force, a dismounted flanking force went downstream unseen to ford the creek at an unguarded dam of logs and driftwood. Two columns outflanked the defenders' position on both sides. The militia were caught by surprise and the Americans quickly drove them from the field. The Americans destroyed the local mills and stores of grain, depriving the British and Canadian forces in Canada of their major source of flour.\nIn his journals, McArthur stated that his cavalry lost 1 man with 6 wounded. The Canadian militia suffered 18 dead and 9 wounded, and 126 taken prisoner, the remaining troops escaped in the panic that ensued during the rout. One British sergeant, attached as an instructor to the militia, and a militiaman were reportedly butchered and scalped.\nBattles of Dover and Savareen Mills\nMcArthur next turned westward towards Dover in pursuit of the recently routed forces. The Americans captured 65 Canadians at Savareen Mills and burned the mills and continued to Dover, where another thirty militia surrendered and two more mills were burned.\nAmerican withdrawal\nFinding himself and his forces over two hundred miles from the American border, and in the midst of hostile country where the population, militias and hostile Indian tribes were seeking them, McArthur began his withdrawal on November 10. He was shadowed by over 1,100 of the combined British and Canadian forces, including a troop of the 19th Light Dragoons led by Major Peter Chambers, for a large part of their return to Detroit, but they were never able to get within seven miles of the Americans.\nMcArthur's force rode along the Lake Erie shore, then headed north and back to the Thames and along the southern shore of Lake St. Clair They reached Sandwich, Ontario, across the Detroit River from Detroit on October 16. They crossed the river the next day, and the men were honorably discharged to return home to Ohio and Kentucky.\nAftermath\nThe battle at Malcolm's Mill was the last land battle of the War of 1812 fought in Upper Canada and was a complete American victory.\nMcArthur's Raid destroyed many of the mills on which the British army on the Niagara depended for flour and bread. Only three mills in the southern part of the Niagara peninsula were spared, either because of the close pursuit, as the British claimed, or through the entreaties of some American officers to spare the district from famine during the coming winter. Although the British commanded Lake Ontario at the time and were able to use their fleet to resupply their army on the Niagara before the lake froze, the region was so badly stripped of resources that the British were unable to mount any operations against Detroit before the end of the war.\nAdditionally, the Americans killed, wounded or captured and paroled over 450 of their enemy, which was accomplished with only the loss of one killed and six wounded. The raid has also been known as \"Dudley's Raid\", after the commander of the 550 Kentucky mounted riflemen.\nOrders of battle\nAmerican forces participating in McArthur's raid\n*Commander - General Duncan McArthur\n**Adjutant General - Major Charles S. Todd\n**Brigade Major - Captain William Bradford, 17th U.S. Infantry\n*Mounted Ohio Infantry (250 men)\n*Battalion - Mounted Kentucky Infantry (550 men)\n**Major Peter Dudley, Kentucky\n***Adjutant - Captain Elisha Berry\n** Kentucky - Companies\n***Captain Thomas P. Moore - Boyle County\n***Captain John Miller - Hardin County\n***Captain Elijah McClung - Montgomery County\n***Captain James Sympson - Clark County\n***Captain Martin H Wickliffe - Nelson County\n***Captain Isaac Watkins - Franklin County\n***Joseph B. Lancaster - Fayette County\nCanadian forces engaged at Malcolm's Mills\n*1st Regiment of Middlesex Militia - Major John Eakins\n*1st Regiment of Oxford Militia - Lt. Col. Henry Bostwick\n*1st Regiment of Norfolk Militia - Lt. Col. Joseph Ryerson and Major William D. Bowen\n*2nd Regiment of Norfolk Militia - Major George C. Salmon\nCitations\nReferences\n* Anderson Chenault Quisenberry, Kentucky in the War of 1812, first published 1915, Kentucky State Historical Society, Kentucky, USA. Reissued by Genealogical Publishing Co. 1996\n*\n* Major R. Cuthbertson Muir, The Early Political and Military History of Burford, La Cie D'Imprimerie Commerciale, 1913.\n* Stuart A. Rammage, ''The Militia Stood Alone - Malcolm's Mills, 6 November 1814, Valley Publishing, 2000.\n* Zaslow, Morris (ed) The Defended Border, Macmillan of Canada, 1964,\n* Zig Misiak, Western Hooves of Thunder, McArthurs Raid on the Six Nations, 1814'', , Published 2011, Brantford, Ontario, Canada"
    }
  ]
}