{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Tuyú Cué\n\n*\n}}\n|combatant2  =\n|commander1  =  Manuel Marques de Sousa, Count of Porto Alegre\n|commander2  =  Bernardino Caballero\n|strength1   = 1,000 men\n|strength2   = 300 infantrymen400 cavalrymen\n|casualties1 = 2 dead, \"a few wounded\"\n|casualties2 = 80 dead, 10 prisoners\n|campaignbox =\n}}\nThe Battle of Tuyú Cué was a minor Paraguayan ambush against the allied army's supply lines in August 1867, during the Paraguayan War. The Paraguayan troops, led by major Bernardino Caballero, managed to surprise a convoy and its guards, but were driven back after a quick allied reaction.\nBackground\nThe Paraguayan War had raged for more than two years when this battle happened; the allied armies had already pushed deep into Paraguay, aided by the superiority of the Brazilian Navy in the Paraguay River after the victory at Riachuelo in 1865. The main obstacle standing between them and Asunción, the Paraguayan capital, was the Fortress of Humaitá, which blocked the river and had shown itself to be too formidable to take in direct assault. This had been proven in the Battle of Curupayty a little less than a year earlier, where a mostly Argentine force had been dealt a bloody defeat in an assault against a supporting position to Humaitá. A siege then started, one where both the allied and Paraguayan armies had supply difficulties.\nBattle\nBetween Humaitá and Tuyutí, a swamp which anchored the allied position, there were some key roads that were used both by the allied and Paraguayan forces, for supplies and communications. Laid amongst them was Tuyú Cué.}} The position, a little village with some orange groves, had been used by the Paraguayan Army before allied advances made it untenable; the allies then took control over it, and it was part of many of their larger supply trails. By the end of July 1867, it would house most of the allied army engaged in the Humaitá campaign.\nand the further inland Tuyú Cué, 13 kilometers. The Paraguay River is at the map's bottom left.]]\nThe Paraguayan leader Francisco Solano López decided to disrupt allied supply lines with an ambush, with the added goal of capturing materiel and wreaking havoc in general. Major Bernardino Caballero led the operation, being in charge of a mobile unit designed for this sort of irregular warfare.\nThe Paraguayan force, composed of between 300 and 400 infantrymen, supported by more than 400 cavalrymen at a distance, set up an ambush in the trail between Tuyutí and Tuyú Cué. When a supply convoy passed through, the ambushers fired two volleys at them, which forced the convoy's guards and drivers to run. In response, the Count of Porto Alegre sent three cavalry corps and an infantry brigade against the enemy; two of the cavalry units were sent to cut off the Paraguayan retreat. Amongst the Paraguayan cavalry, which was charged upon by the allied cavalry, there were more than 80 deaths and 10 prisoners; amongst the allies, two officers were killed and a few men were wounded. The convoy was recovered, albeit severely damaged, according to the official report by the Count.\nAftermath\nThis engagement, while small in comparison to other ones to take place in the Humaitá campaign, such as the Battle of Curupayty and the Second Battle of Tuyutí, was part of the reason why the Siege of Humaitá took so long to be concluded despite the disparity of strength between the allied and Paraguayan armies. Jourdan mentions this sort of skirmishing over supplies to have been common in this phase of the campaign, citing another Paraguayan ambush that took place in the 24th of September with a far larger number of casualties for the allies, the Battle of Estero Rojas.\nIn the accounts of Paraguayan soldier Leandro Pineda, it is mentioned that through this action \"[they] gained possession of soap, biscuits, clothes, a few rolls of paper, and other\nitems I cannot recall\".\nNotes\nReferences\nSources\n*\n*\n*\n*\n*\n*\n*"
    }
  ]
}