{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Vitebsk (1812)\n\n| result            = French victory\n| combatant1        = French Empire\n| combatant2        = Russian Empire\n| commander1        = Napoleon I\n| commander2        =\n| strength1         = 28,000\n| strength2         = 20,000\n| casualties1       = 3,400 killed, wounded300 captured\n| casualties2       = 2,700 killed, wounded1,100 captured\n| map_type          = Europe\n| map_relief        = 1\n| map_size          = 300\n}}\n|  zoom = 4\n|   float = right\n|    nolabels = 1\n|     width = 304\n|     height = 140\n| title = French invasion of Russia\n| caption =\n| shapeD=n-circle\n| shape-colorD=navy\n| label-colorD=navy\n| shape-outlineD=white\n| label-sizeD = 8\n| label-posD = right\n| mark-sizeD=16\n| label1 = Kowno\n| mark-coord1 =\n| mark-title1 = Kowno 24 June 1812: Napoleon crossed the border\n| label-pos1 = top\n| shape-color1 = dark red\n| label-color1 = dark red\n| label2 = Vilna\n| mark-coord2 =\n| mark-title2 = Vilnius June 1812: Napoleon Retreat 5 December 1812: Napoleon\n| label-pos2 = top\n| shape-color2 = dark red\n| label-color2 = dark red\n| label3 = Vitebsk\n| mark-coord3 =\n| mark-title3 = Battle of Vitebsk 26 July 1812: Napoleon\n| label-pos3 = top\n| shape-color3 = black\n| label-color3 = black\n| label4 = Smolensk\n| mark-coord4 =\n| mark-title4 = Battle of Smolensk 16 August 1812: NapoleonNovember 1812: : Napoleon's retreat\n| shape-color4 = maroon\n| label-color4 = maroon\n| label5 = Borodino\n| mark-coord5 =\n| mark-title5 = Battle of Borodino 7 September 1812: Kutuzov, NapoleonOctober 1812: Napoleon's Retreat\n| label-pos5 = top\n| shape-color5 = maroon\n| label-color5 = maroon\n| label6 = Moscow\n| mark-coord6 =\n| mark-title6 = Moscow 14 September to 19 October 1812: Napoleon\n| shape-color6 = maroon\n| label-color6 = maroon\n| label-pos6 = top\n| label7 = Maloyaroslavets\n| mark-coord7 =\n| mark-title7 = Battle of Maloyaroslavets 24 October 1812: Kutuzov, Napoleon\n| shape-color7 = maroon\n| label-color7 = maroon\n| label8 = Berezina\n| mark-coord8 =\n| mark-title8 = Battle of Berezina 26–29 November 1812: Napoleon, Chichagov, Wittgenstein, Kutuzov only pursuit\n| shape-color8 = maroon\n| label-color8 = maroon\n| label-pos8 = right\n| label9 = Warsaw\n| mark-coord9 =\n| mark-title9 = Warsaw December 1812: Napoleon's retreat\n| label-pos9 = left\n| shape-color9 = maroon\n| label-color9 = maroon\n| label10 = Tilsit\n| label-pos10 = left\n| mark-coord10 =\n| mark-title10 = Tilsit 24 June 1812: Macdonald's Prussians crossed the border\n| shape-color10 = olive\n| label-color10 = olive\n| shape-outline10 = white\n| label11 = Riga\n| mark-coord11 =\n| mark-title11 = Siege of Riga 24 July – 18 December 1812: Macdonald's Prussians\n| shape-color11 = olive\n| label-color11 = olive\n| shape-outline11 = white\n| label12 = Tauroggen\n| mark-coord12 =\n| mark-title12 = Tauroggen 30 December 1812: Ludwig Yorck's Prussians signed the Convention of Tauroggen\n| shape-color12 = olive\n| label-color12 = olive\n| shape-outline12 = white\n| label-pos12 = top\n| label13 = Drohiczyn\n| mark-coord13 =\n| mark-title13 = Drohiczyn June 1812: Schwarzenberg's Austrians crossed the border\n| shape-color13 = navy\n| label-color13 = navy\n| label14 = Gorodeczno\n| mark-coord14 =\n| mark-title14 = Battle of Gorodechno 12 August 1812: Schwarzenberg's Austrians\n| shape-color14 = navy\n| label-color14 = navy\n| label-pos14 = right\n| label15 = Pultusk\n| mark-coord15 =\n| mark-title15 = Pultusk December 1812: Retreat of Schwarzenberg's Austrians\n| shape-color15 = navy\n| label-color15 = navy\n| label-pos15 = left\n}}\nThe battle of Vitebsk, sometimes spelled Witepsk (), was a military engagement that took place on 26 and 27 July 1812 during the French invasion of Russia. The battle put a French force, under the command of Emperor Napoleon I, in combat with Russian rearguard forces under General Pyotr Konovnitsyn (on 26 July) and Peter von der Pahlen (on 27 July) and ended with the Russian forces making a strategic retreat from the battlefield.\nThe battle occurred as Napoleon was trying to envelop the Russian First Army at Vitebsk and force them to accept battle. The commander of the Russian First Army, General Michael Andreas Barclay de Tolly, was himself aiming to fight and thus massed the bulk of his forces at Vitebsk, even though he was aware that his chances to win against Napoleon were not good. Barclay's motivation to make a stand resulted from political pressures and from his own desire to improve the army's morale, after weeks of retreating without a fight.\nThe fighting on 26 July had General Konovnitsyn's rearguard division taking on elements of the French IV Corps and ended with the Russians managing to delay the enemy for the entire day, allowing the bulk of the army to mass at Vitebsk. Meanwhile, Barclay received intelligence that Pyotr Bagration's Second Army had been defeated three days earlier, which forced Barclay to abandon his plan to mount a major action against Napoleon.\nBarclay's main concern for the day of 27 July was to keep the French at bay long enough to allow his main force to escape towards Smolensk, where he planned to unite with Bagration. The task of delaying the French was assigned to General Pahlen, who succeeded in frustrating any French breakthrough attempts for half a day, before Napoleon decided to stop the fighting and wait for reinforcements, convinced that he would be able to renew battle the next day.\nUnbeknownst to Napoleon, the Russian army retreated during the afternoon and night, which meant that the Emperor's plans for a major battle collapsed. Meanwhile, the Russian army made a hasty retreat and safely reached Smolensk, where they were able to unite with Bagration, just as planned.\nBackground\nDuring the early stages of the Russian campaign, Emperor Napoleon I sought to force the Russian army to commit the bulk of its forces to a major battle, in order to defeat it and thus avoid a protracted campaign. Towards mid-July, he thus launched a part of his forces in an enveloping action towards Vitebsk, with the first engagement taking place at Ostrovno on 25 July.\nThere, a French force under Marshal Joachim Murat and General Etienne de Nansouty tried to pin down a superior force under Russian General Alexander Ivanovich Ostermann-Tolstoy. While the Russians registered relatively high casualties, they were able to retreat in good order and the French did not manage to concentrate enough forces to launch an immediate pursuit. The Russians themselves inflicted significant casualties on the enemy and crucially, delayed them for long enough to allow the concentration of significant forces around Vitebsk.\nMeanwhile, with the Russian army having continually retreated before the enemy ever since the campaign started a month earlier, morale among the rank and file had begun to decline. Discontent was also growing at the Russian Imperial Court in Saint-Petersburg, with courtesans failing to understand why the commander of the Russian field army, General Michael Andreas Barclay de Tolly, was abandoning vast territories of the Empire to the enemy without making a stand. Barclay was thus under serious pressure to fight and decided to do so at Vitebsk, where he had managed to concentrate a large part of his forces. However, Napoleon's superior numbers and the weaknesses of Barclay's battlefield position meant that the chances for a Russian victory were very weak at best.\nBattle\nFollowing the engagement at Ostrovno, Ostermann-Tolstoy's IV Corps retreated  towards Kakuviachino, where they were relieved by the 3rd Infantry Division under General Pyotr Konovnitsyn, who took up the rearguard responsibilities. Konovnitsyn was extremely adept at leading rearguard actions and he managed to block all the enemy's attempts to advance, delaying them for an entire day. The French were thus unable to make contact with the bulk of the Russian forces on 26 July.\nMeanwhile, at nightfall, Prince Aleksandr Meshikov, aide-de-camp to General Pyotr Bagration arrived at Barclay's headquarters. Meshikov brought alarming news of the defeat of Bagration's Second Army at the battle of Saltanovka, three days earlier, at the hands of Marshal Louis Nicolas Davout. Davout's victory meant that Second Army would not be able to link up with Barclay's First Army and there was a danger that Napoleon might drive a wedge between the two armies, separating them for good and getting to the strategic city of Smolensk before them.\nThe Russians thus needed to abandon any plans to give battle, urgently break contact with the pursuing enemy and move southeast, in an attempt to draw closer to Bagration's force. Despite these considerations, Barclay still wanted to give battle the next day and was only dissuaded from doing so by his advisers, late on 26 July. That night, the commander issued orders for retreat, but the proximity of Napoleon's force meant that a retreat would not be easy to operate.\nAt daybreak on 27 July, Napoleon set his troops in motion, thrilled that he finally faced a massed enemy army, apparently willing to fight. Napoleon was unaware that the bulk of the Russian force was already making arrangements for an immediate retreat and that they had pushed forward only a rearguard, under General Peter Graf von der Pahlen, with orders to fight a delaying action and thus allow the army to slip away unmolested. The battlefield at Vitebsk was a vast and flat plain and only the river Dvina separated the French forces from the Russians, who were occupying a slightly elevated position on the eastern bank.\nFrom his position, Napoleon could see the steeples of the town of Vitebsk, as he watched his forces begin to cross the ravine that separated them from the enemy. Napoleon only had two infantry divisions (13th and 14th) from Viceroy Eugène's \"Army of Italy\" (also called IVth Corps), under his immediate command and was aware that the enemy possessed superior numbers of some 90,000 men. Elements of Etienne de Nansouty's mighty Ist Cavalry Corps were also in the vicinity, but these forces were by far insufficient for a pitched battle, so the Emperor planned to pin down the enemy forces, without pushing them to commit significant forces, and then wait for reinforcements of his own.\nThe French 14th division, under General Jean-Baptiste Broussier moved forward first, with its left leading but he was attacked by surprise by enemy cavalry. The Russian commander, General Pahlen, first launched the Life Guard Cossacks, and then the bulk of his cavalry against Broussier's men. Pahlen's cavalry skillfully harassed the French infantry, preventing them from moving forward and brilliantly traded ground for time. The Russian cavalry organised repeated actions, which lasted for several hours. Broussier did his best to push through, using his divisional artillery, which fired deadly salvos at the Russian horse, but, without cavalry support of his own, he was not able to break through.\nThree hundred voltigeurs from the 9th Line regiment, which had been sent forward to skirmish were caught in an awkward position by superior Russian forces, but the French valiantly held their ground against all odds. The timely arrival of Alexis Joseph Delzons's 13th infantry division and most of all the cavalry from Nansouty's Ist Cavalry Corps persuaded Pahlen to cross to the other bank of the small Luchenza (Luchosa) river, where the bulk of his forces waited, ready for battle.\nTowards 11:00, Napoleon realised that the forces under his immediate control were insufficient for a prolonged battle and stopped the advance. The men bivouacked where they stood, while the Emperor went off to reconnoiter the situation in person. Napoleon was pleased to see that the Russians had taken battle positions, which seemed to reconfirm that they were finally ready to fight. The Emperor made arrangements for the continuation of the battle the next day, and praised the voltigeurs of the 9th Line for their gallantry. The Russians took advantage of this respite and began to move out towards 16:00, leaving behind Cossack parties, which kept camp fires burning at night, in order to deceive the French into thinking that the army had not moved.\nAftermath\nThe Russian were able to extricate themselves from a dangerous position and make a dash for Smolensk, where Barclay planned to unite his force with Bagration's Second Army, what subsequently led to the Battle of Smolensk. For a while, however, Barclay feared that Napoleon might get there before him and thus made dispositions for a particularly hasty retreat, which was nevertheless conducted in perfect order. Napoleon was in fact in no position to get to Smolensk before the Russians, as he needed to rest his exhausted troops and actually had no intelligence as to the direction of the Russian retreat.\nThe battle of Vitebsk, whilst in fact no more than a rearguard combat, was disputed in terms of French casualties. Riehn estimates 400 killed, 900 wounded, and 70 captured whilst Bodart estimates 3,400 killed and wounded and 300 captured. The French lost Colonel Liédot, a distinguished officer, commander of the general staff of the army's military engineer corps, who was killed in action. Russian losses amounted to some 3,000 men, killed and wounded. Their main strategic goal, namely to fight a delaying action aimed at allowing the army to retreat unmolested, was achieved.\nGeneral Pahlen received high praise for this action from an otherwise reserved Barclay de Tolly. The battle is often seen by French historians as a missed opportunity for Napoleon, who failed to press Pahlen hard and thus render the Russian retreat difficult. Indeed, Napoleon took for granted the fact that the Russians would fight the next day and stopped his attack early on, unwilling to risk high losses against an enemy who vastly outnumbered the forces that he had available.\nSee also\n*List of battles of the French invasion of Russia\nNotes\nReferences\n*\n*\n*\n*\n*\nExternal sources\n*\nExternal links\n*"
    }
  ]
}