{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Karbala (1991)\n\nBa'athist Iraq\n*Republican Guard\n*Ba'ath Party-loyalist among other Iraqi Security forces\n| combatant2        =  Shi'a rebels:\n* SCIRI & Badr\n* Islamic Dawa Party\n* Iraqi Army deserters\n| commander1        =  Hussein Kamel al-Majid\n| commander2        = Unknown\n| strength1         = Unknown\n| strength2         = Unknown\n| casualties1       = Unknown\n| casualties2       = Unknown\n| image_upright     =\n}}\nThe Battle of Karbala was fought during the 1991 uprisings in Iraq which followed the Gulf War. The battle started after demoralized troops throughout Iraq began to rebel against Saddam Hussein. From 5 to 19 March 1991, the city of Karbala became a chaotic battlefield as the result of bitter fighting between the insurgents and the Iraqi Republican Guard. After the failure of the uprising, citizens were killed in large numbers. Parts of the city were nearly leveled.\nPrelude\nIn the years leading up to the Gulf War, the city of Karbala boasted that it had a population of over 150,000 inhabitants. Tourists from Africa all the way to Pakistan flocked to the city in order to go on pilgrimages to the Imam Husayn Shrine. In the months of the Gulf War, the city was carefully spared by the Coalition during its bombing campaign due to the significance of its mosques. The city suffered little damage throughout the war in general.\nIn the days leading up to the uprising, some believed that agents from Iran moved into the city and hid amongst its population for the future purpose of channeling an Islamic revolution; an unsubstantiated claim which the Ba'athist regime was all too eager to propagate as part of its attempt to discredit the uprising. Finally, on 1 March, the uprising began in the southern city of Basra. With this, the tides of revolt spread throughout Iraq, from the southern marshes to the Kurdish mountains.\nUprising\n5 March\nSome of the opposition groups had already distributed pamphlets to the local population, feeding anti-Saddam sentiment to the people. It was also reported that a number of these opposition groups consisted of former regular Iraqi Army soldiers who had served in Kuwait during the Persian Gulf War. Earlier that day, soldiers who were returning from the front arrived in Karbala.\nThe revolt began at 2:30 PM when youths began to ride through the streets with weapons, attacking government buildings and loyalist soldiers. This action encouraged the people to come out of their homes with light arms and knives, known as \"white weapons,\" and join in the attack. Such weapons were supplemented with heavier weapons which were captured from Baath Party forces. The Holy Endowments administration building was the first to be sacked, followed by the sacking of several other buildings. The rebels also stormed the al-Husseini hospital and took over its wards. Many of the holy Shia shrines immediately became the main headquarters of the insurgents, the two main headquarters being the Shrines of Husayn ibn Ali and Al-Abbas ibn Ali.\nSome of the local Baathist officials and some of the top security agents, including the chief of police and the deputy governor, were killed in brutal ways because they did not retreat in time. Many of their bodies were left lying in the streets and some of them were burned. On the loudspeakers which were located inside the Shia Shrines, insurgents called for prisoners to be brought to the Shrine of Abbas for execution. By morning, the city was under complete rebel control.\n6–11 March\nThe insurgents hoped that Saddam's regime would not be able to quell the rebellion without air power. But issues had been provoked throughout the city, which was blocked by the coalition forces as a condition of the Gulf War ceasefire. However, US Forces did not prevent Saddam's forces from using overwhelming force to suppress the uprising. Karbala was subjected to severe artillery shelling and rebel holdouts were attacked with helicopter gunships. The US and allies did not create Iraqi no-fly zones south of the 32nd parallel until 1992, extending to the 33rd parallel and covering Karbala in 1996.\nThroughout the counterattack, voices could be heard on loudspeakers which were located in the shrines of Abbas and Hussein, directing the insurgents to attack the Republican Guards. In the closing days of the uprising, the shrines were heavily damaged by artillery shells and rockets which were fired from helicopters. Many rebels and many civilians who supported them barricaded themselves in the buildings. In video recordings of the uprising, the people are dancing in euphoria and they are also requesting aid from America and Iran, aid which never came. Once the loyalist forces surrounded the shrine, the leader of the assault and a henchman of Saddam, Kamal Hussein Majid, stood on a tank and shouted: \"Your name is Hussein and so is mine. Let us see who is stronger now.\" He then gave the order to open fire on the shrine. After blowing down the doors of the shrine, the Guards rushed in and killed the majority of the people who were inside the shrine with automatic weapons fire.\nOnce it was in control of the city, the army encircled each district of it and looked for young men. At first, the soldiers shot whoever they saw. After a day or so, they arrested every male who was over the age of 15. Shia clerics who were seen walking on the streets were rounded up and never seen again. Dead bodies were mined and people were not allowed to remove them from the streets. Helicopter gunships which were located on the outskirts of the city reportedly strafed civilians while they were fleeing from the city.\n19 March\nSoldiers took vengeance on rebels and civilians who had not fled. Moving from district to district, they rounded up young men who they suspected of being rebels, transported them to stadiums and executed some of them. Others were reportedly sent to a large detention facility outside Baghdad. Such marks indicated that the uprising was officially suppressed.\nAftermath\nReports indicated that no neighborhood was left intact after the uprising. In the vicinity of the shrines of Husayn ibn Ali and Abbas ibn Ali, most of the buildings which surrounded the shrines were completely reduced to rubble. The shrines themselves were scarred by bullet marks and tank fire. However, they were quickly restored thanks to donations which were received by the Shiite community.\nIn December 2005, workers who were maintaining water pipes which were located 500 meters from the Imam Hussein Shrine unearthed a mass grave which contained dozens of bodies, apparently, the bodies were those of Shiites who were killed after the uprising.\nAnother mass grave was discovered south of Karbala on 10 January 2010, it contained the bodies of 23 people who were members of both sexes.\nPopular culture\nThe 2014 film The Blue Man, which is related to The New York Times article titled \"Uncovering Iraq's Horrors in Desert Graves\" written by John F. Burns, is about rebels who were killed during the uprising and buried in The Blue Man mass grave.\nSee also\n*1915 uprising in Karbala\n*Battle of Karbala (10 October 680 CE) (10 Muharram 61 AH)\n*1991 uprising in Sulaymaniyah\n*List of conflicts in the Middle East\n*Iran–Iraq War\n*Gulf War\n*1935–36 Iraqi Shia revolts\nReferences\nExternal links\n* [https://www.hrw.org/reports/1992/Iraq926.htm The 1991 Uprising in Iraq And Its Aftermath]"
    }
  ]
}