{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Cunaxa__disambig_1\n\n| result            = Indecisive\n| combatant1        = Cyrus loyalists\n| combatant2        = Artaxerxes loyalists\n| commander1        = |Clearchus|Cheirisophus}}\n| commander2        = |Gobrias|Tissaphernes|Orontes}}\n| strength1         = 25,700\n: 15,700 Greeks\n: 10,000 Persians\n| strength2         = 40,000\n| casualties1       = Unknown\n| casualties2       = Unknown\n}}\nThe Battle of Cunaxa was fought in the late summer of 401 BC between the Persian king Artaxerxes II and his brother Cyrus the Younger for control of the Achaemenid throne. The great battle of the revolt of Cyrus took place 70&nbsp;km north of Babylon, at Cunaxa (), on the left bank of the Euphrates. The main source is Xenophon, a Greek soldier who participated in the fighting. Despite the success in the battle achieved by the interaction of the Greek mercenaries and the Persian troops of Cyrus, the outcome of the battle and the death of the pretender to the throne led to the defeat of the entire uprising and forced Greeks to commit Anabasis.\nPreparations\nCyrus gathered an army of Greek mercenaries, consisting of 10,400 hoplites and 2,500 light infantry and peltasts, under the Spartan general Clearchus, and met Artaxerxes at Cunaxa. He also had a large force of levied troops under his second-in-command Ariaeus. The strength of the Achaemenid army was 40,000 men.\n.]]\nWhen Cyrus learned that his elder brother, the Great King, was approaching with his army, he drew up his army in battle array. He placed the Greek mercenaries on the right, near the river. In addition to this they were supported on their right by some cavalry, 1,000 strong, as was the tradition of battle order in that day. To the Greeks, this was the place of honor. Cyrus himself with 600 body guards was in the center, to the left of the Greek mercenaries—the place where Persian monarchs traditionally placed themselves in the order of battle. Cyrus' Asiatic troops were on the left flank.\nInversely, Artaxerxes II placed his left on the river, with a unit of cavalry supporting it also. Artaxerxes was in the center of his line, with 6,000 units of Persian cavalry (which were some of the finest in the world) which was to the left of Cyrus, his line being so much the longer. Artaxerxes line overlapped Cyrus' line quite significantly, since he was able to field many more troops.\nCyrus then approached Clearchus, the leader of the Greeks, who was commanding the phalanx stationed on the right, and ordered him to move into the center so as to go after Artaxerxes. However, Clearchus, not desiring to do this—for fear of his right flank—refused, and promised Cyrus, according to Xenophon, that he would \"take care that all would be well\". Cyrus wanted to place him in the center as the Greeks were his most capable unit, and were thereby most able to defeat the elite Persian cavalry and in the process kill the Great King, thereby gaining the Persian throne for Cyrus. Clearchus refused this owing to the insecurity that the Greeks had for their right flank, which tended to drift and was undefended, as the shields were held in the left hand. That Clearchus did not obey this order is a sign of the lack of control that Cyrus had over his army, as a couple of other occasions throughout this campaign prior to the battle reveal also.\nBefore the final attack began, Xenophon, the main relater of the events at Cunaxa, who was probably at the time some kind of mid-level officer, approached Cyrus to ensure that all the proper orders and dispositions had been made. Cyrus told him that they had, and that the sacrifices that traditionally took place before a battle promised success.\nBattle\nFile:Persepolis Tomb of Artaxerxes II Mnemon (r.404-358 BCE) Upper Relief soldiers with labels.jpg|upright=1.8|Army of Artaxerxes II, as depicted on his tomb at Persepolis.\nFile:Battle_of_Cunaxapng_Stage_1.png|First phase of battle\nFile:Battle_of_Cunaxapng_Stage_2.png|Second phase of battle\nBattle of Cunaxa.jpg|19th Century English School depiction of the Battle of Cunaxa\nThe Greeks, deployed on Cyrus's right and outnumbered, charged the left flank of Artaxerxes' army, which broke ranks and fled before they came within arrowshot. However, on the Persian right the fight between Artaxerxes' army and Cyrus was far more difficult and protracted. Cyrus personally charged his brother's bodyguard and was killed by a javelin, which sent the rebels into retreat. (The man who threw the javelin was known as Mithridates; he would later be executed by scaphism because while drunk at a celebratory feast, he bragged about the kill, offending Artaxerxes, who had initially been grateful and richly rewarded him).  Only the Greek mercenaries, who had not heard of Cyrus's death and were heavily armed, stood firm. Clearchus advanced against the much larger right wing of Artaxerxes' army and sent it into retreat. Meanwhile, Artaxerxes' troops took the Greek encampment and destroyed their food supplies.\nAftermath\ninvited the Greek generals to a feast, then had them arrested and executed.]]\nAccording to the Greek soldier and writer Xenophon, the Greek heavy troops scattered their opposition twice; only one Greek was even wounded. Only after the battle did they hear that Cyrus himself had been killed, making their victory irrelevant and the expedition a failure. They were in the middle of a very large empire with no food, no employer, and no reliable friends. They offered to make their Persian ally Ariaeus king, but he refused on the grounds that he was not of royal blood and so would not find enough support among the Persians to succeed. They offered their services to Tissaphernes, a leading satrap of Artaxerxes, but he refused them, and they refused to surrender to him. Tissaphernes was left with a problem; a large army of heavy troops, which he could not defeat by frontal assault. He supplied them with food and, after a long wait, led them northwards for home, meanwhile detaching Ariaeus and his light troops from their cause.\nThe Greek senior officers foolishly accepted the invitation of Tissaphernes to a feast. There they were made prisoner, taken up to the king and there decapitated. The Greeks elected new officers and set out to march northwards to the Black Sea through Corduene and Armenia, to reach the Greek colonies on the shore. Their eventual success, the march of the Ten Thousand, was recorded by Xenophon in his Anabasis.\nCtesias\nAnother famous writer of Antiquity, besides Xenophon, was present at the Battle of Cunaxa. Ctesias, a native of Caria, which belonged to the Achaemenid Empire at the time, was part of the entourage of King Artaxerxes at the Battle of Cunaxa, and brought medical assistance to the king by treating his flesh wound. He reportedly was involved in negotiations with the Greeks after the battle, and also helped their Spartan general Clearchus before his execution. Ctesias was the author of treatises on rivers, and on the Persian revenues, of an account of India entitled Indica (Ἰνδικά), and of a history of Assyria and Persia in 23 books, called Persica (Περσικά), written in opposition to Herodotus in the Ionic dialect, and professedly founded on the Persian Royal Archives.\nIn popular culture\n* The battle is referenced at the start of The Warriors (1979).\n* The battle features predominantly in the novel The Lost Army (2007) by Valerio Massimo Manfredi.\n* The battle forms the basis of the novel The Falcon of Sparta (2018) by Conn Iggulden.\nReferences\nFull text of Xenophon's Anabasis online:\n* Freely downloadable, at Project Gutenberg [https://www.gutenberg.org/ebooks/1170]\n* Directly readable, at The University of Adelaide Library, Australia [https://web.archive.org/web/20080327185249/http://etext.library.adelaide.edu.au/x/xenophon/x5an/]\nFurther reading\n*\n* Xenophon, The Persian Expedition, trans. by Rex Warner, Penguin, 1949.\n* Montagu, John D. Battles of the Greek and Roman Worlds, Greenhill Books, 2000.\n* Prevas, John. ''Xenophon's March: Into the Lair of the Persian Lion, Da Capo, 2002.\n* Waterfield, Robin. Xenophon's Retreat: Greece, Persia, and the End of the Golden Age'', Belknap Press, 2006."
    }
  ]
}