{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Mbororé__disambig_1\n\n}}\nThe Battle of Mbororé, which occurred on 11 March 1641, was a conflict between the Guaraníes inhabiting the Jesuit Missions and the bandeirantes, Portuguese explorers and slavers based in São Paulo and allied with the Tupíes. The battle is site is near Cerro Mbororé, Panambí, in the province of Misiones, Argentina. The battle ended in a Guarani victory. It took place at the beginning of the Portuguese Restoration War.\nHistoric Antecedents\nNeed for Slaves and the beginning of the 'bandeiras'\nIn the early 17th century, the Dutch landed on the Brazil coasts intending to settle there. They did this by using piracy to control navigation along the Atlantic coast, disrupting the Brazilian slave trade. This was a heavy blow to the Portuguese Empire, which needed slave labor to cultivate sugar and raise livestock, the industries which prevailed on the Atlantic coast of Brazil. As a result of this disruption, the Portuguese plantation owners began to make inroads into the local Indian population to make up for the shortfall in slave labor. Moreover, due to the small quantities of silver, gold and precious stones found in the region of Piratininga, the scouts began to move towards the unknown interior of Brazil.\nThese exploration and slave hunting groups, called bandeiras, were organized and managed as a business for the leading sectors of São Paulo, and their ranks included Mamluks (Portuguese/Indian Mestizos), indigenous Tupi and Dutch who came to Brazil to try their luck. They had the support of Spanish and Paraguayan officials.\nIn their advance toward the west, the frontiersmen never crossed the threshold specified by the Treaty of Tordesillas. Indirectly, the Bandeirantes of São Paulo became the vanguard of the Portuguese territorial expansion, which was consolidated by recovering Portugal's independence from Spain.\nFirst Attacks on the Jesuit Missions\nBy decree in 1608, the governor of Asuncion, Paraguay, Hernando Arias de Saavedra ordered the Jesuits to areas surrounding the Parana River, Guayrá and areas inhabited by guaycurúes to found towns and evangelize the natives who inhabited these regions. Later, he included the peoples of Itatin (north of Asuncion) and Tape (the current state of Rio Grande do Sul, Brazil).\nThe Jesuits had begun this evangelization when the frontiersmen began arriving in eastern Guayrá. At first, they respected the indigenous peoples so treated by the Jesuits. However, the Guarani, concentrated in towns and skilled in various trades, represented a highly skilled workforce, defenseless because they could not bear arms as a result of another of the governor's decrees. Beginning in 1620, bandeiras' raids became increasingly aggressive, forcing the abandonment or relocation of some villages.\nBetween 1628 and 1631 the bandeirantes' leaders, Raposo Tavares and Manuel Antonio Pires Preto and their men periodically struck Guayrá, capturing thousands of Guarani who were then auctioned off at São Paulo. It is estimated that in the years 1628–1629, raids captured some 5,000 Indians, of which only 1,200 reached São Paulo. The vast majority of them died in transit as a result of the slave traders' treatment.\nBy the year 1632, 12,000 Guarani had been forcibly moved south, leaving the Guayrá region virtually deserted, in addition to population reductions in the nearby regions of San Ignacio Mini and Loreto in the territory of the present Province of Misiones.\nThe Bandeirantes continued westward, striking Itatin in 1632. Then followed the Tape, invaded during the years 1636, 1637 and 1638 by successive bandeiras Raposo Tavares led by André Fernandes and Fernando Dias Pais.\nThe Jesuits' Defence\nMontoya's Mission to the Crown\nIn 1638, priests Antonio Ruiz de Montoya and Francisco Diaz Tano traveled to Spain in order to report to the King Felipe IV recent events in the missions. They wanted the King to lift his restrictions on the use of firearms by the natives.\nThe recommendations of Ruiz de Montoya were accepted by the King and Council of the Indies, and dispatched several royal charters to Paraguay. By Royal Decree of 12 May 1640, the Guaraní were allowed to take firearms for their defense, but if so directed by the prior Viceroy of Peru. The priests returned to Lima, with the intent of providing weapons to the natives, while Father Tano went to Rome to inform the Pope of the slave-hunting missions in order to obtain a papal protection.\nThe Apostles of Caazapaguazú skirmish\nMeanwhile, prior to the imminent danger of the frontiersmen crossing the Uruguay River, the regional priest Diego de Boroa, with the consent of the Governor of Asuncion and Real Audiencia of Charcas, decided that the mission troops should receive firearms and begin military training.  Eleven Spanish men were sent from Buenos Aires to organize the defense forces.\nIn late 1638, Father Diego de Alfaro crossed the Uruguay River with a number of Guaraní, armed and trained, with the intention of recovering indigenous territory and eventually face the bandeirantes who roamed the region.\nAfter some sporadic encounters with the forces of São Paulo, the troops were joined by Father Alfaro and 1,500 Guarani led by Father Romero. He then formed an army of 4,000 missionaries who advanced to the ravaged reduction Apostles Caazapaguazú where bandeirantes were entrenched after several partial defeats. The armed clash was the first decisive victory of the Guarani over the Paulistas, who abruptly fled after surrendering.\nSão Paulo's government prepares the counterattack\nTorn apart, the Bandeirantes forces returned to São Paulo to tell authorities what happened.\nCoincidentally, at that same time, Father Tano came to Rio de Janeiro from Madrid and Rome. He had in his possession royal charters and Papal Bulls condemning the bandeiras' conducting human trafficking with the indigenous people.\nBoth events produced a backlash in the government of São Paulo which, in agreement with the plantations, expelled the Jesuits from the city. The city organized a huge bandeira with 450 Dutch and Portuguese armed with rifles and muskets, 700 canoes and 2,700 Tupi archers, led by Manuel Pires. The aim of the expedition was to take and destroy everything that was along the Uruguay and Paraná Rivers, taking all potential slaves.\nReferences"
    }
  ]
}