{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Petrovaradin__disambig_1\n\n| result            = Habsburg victory\n| combatant1        =  Habsburg monarchy Württemberg\n| combatant2        =  Ottoman Empire\n*\nHungarian Kuruc\n}}\n| commander1        =  Eugene of Savoy\n| Alexander von Württemberg\n| Count von Mercy\n| Count János Pálffy\n| Guido Starhemberg\n| Sigbert Heister\n}}\n| commander2        =  Silahdar Damat Ali Pasha\n}}\n| strength1         = 60,000 men}}\n| strength2         = 150,000 men}}\n| casualties1       = 4,500 killed and wounded\n| casualties2       = 20,000 killed}}\n| campaignbox       =\n}}\n| zoom = 5\n| float = right\n| nolabels = 1\n| width = 340\n| height = 200\n| title = Austro-Turkish War of 1716–18\n| caption =  2 = Karlowitz & Petrovaradin  3 = Temeșvar, 5 = Trebinje, 7 = Belgrade  11 = Vučitrn\n| shapeD=n-circle\n| shape-colorD=navy\n| shape-outlineD=white\n| label-colorD = navy\n| label-sizeD = 10\n| label-posD = left\n| label-offset-xD = 0\n| label-offset-yD = 0\n| label1 =\n| mark-coord2 =\n| mark-title2 = Battle of Petrovaradin on 5 August 1716\n| label-color2 = maroon\n| shape-color2 = maroon\n| label2 =\n| mark-coord3 =\n| mark-title3 = Siege of Temeşvar (1716) from 31 August 1716 to 12 October 1716\n| label-color3 = navy\n| shape-color3 = navy\n| label3 =\n| mark-coord5 =\n| mark-title5 = Siege of Trebinje on 26 November 1716\n| label-color5 = navy\n| shape-color5 = navy\n| label4 =\n| mark-coord7 =\n| mark-title7 = Siege of Belgrade (1717) from 18 June 1717 to 21 August 1717\n| label-color7 = navy\n| shape-color7 = navy\n| label5 =\n| mark-coord11 =\n| mark-title11 = Uprising in Vučitrn from fall 1717 to summer 1718\n| label-color11 = green\n| shape-color11 = green\n}}\nThe Battle of Petrovaradin also known as the Battle of Peterwardein, took place on 5 August 1716 during the Austro-Turkish War when the Ottoman army besieged the Habsburg-controlled fortress of Petrovaradin on the Military Frontier of the Habsburg monarchy (today Novi Sad, Vojvodina, Serbia). The Ottomans attempted to capture Petrovaradin, the so-called Gibraltar on the Danube, but experienced a great defeat by an army half the size of their own, similar to the defeat they had experienced in 1697 at the Battle of Zenta. Ottoman Grand Vizier Damad Ali Pasha was fatally wounded, while the Ottoman army lost 20,000 men and 250 guns to the Habsburg army led by Field Marshal Prince Eugene of Savoy.\nThe Austrians consolidated this victory by marching into the Banat and conquering Temesvár, the last remaining Turkish fortress in Hungary, followed by Belgrade.\nBackground\nIn the summer of 1715, the Ottoman Empire started to reclaim the Peloponnese, which had been ceded to the Republic of Venice by the Karlowitz Treaty in 1699. The Turks, led by Grand Vizier Damat Ali Pasha, easily reconquered the Venetian Kingdom of the Morea (the Greek Peloponnese). Having made an alliance with Venice in April 1716, Austria demanded full withdrawal from the Ottoman Empire as well as compensation to Venice for the continued violation of the stipulations of the Karlowitz treaty; the Ottoman grand-vizier, confident that he could defeat the Habsburgs and even regain Hungary, responded by declaring war on 15 May 1716.\nPrelude\nDamat Ali Pasha, the Sultan's son-in-law, left Constantinople with a 120,000 strong Turkish Army taking nearly three months to cover the  to Belgrade. There he consolidated an Ottoman force of 150,000 soldiers, at the core of which were 41,000 elite Janissaries and 30,000 Sipahi Ottoman cavalry, along with Tatar and Wallachian auxiliaries. They crossed the Sava at Zemun on 26 July, and moved on the right bank of the Danube towards Sremski Karlovci in Habsburg territory.\nThe commander of the Austrian forces, Prince Eugene of Savoy, decided to engage the Ottomans at Petrovaradin. Eugene arrived at the fortress on 9 July. He had arranged for the construction of a fortified encampment within the Petrovaradin fortress which was nicknamed Gibraltar on the Danube. Eugene set the 60,000-strong Imperial army on the march from their quarters in Futog. Inside the Petrovaradin garrison were 8,000 men consisting primarily of Serbs. Serving in the Austrian army were Croatian and Hungarian infantry and cavalry regiments (approx. 42,000 men); Serbian border soldiers from Vojvodina; and the auxiliaries from Württemberg. On 2 August, the first skirmish between the Imperial vanguard and Ottoman horsemen occurred when Field Marshal Count János Pálffy, with a small body of men, lead a group on reconnaissance but ran into more than 10,000 Turkish cavalry in the area of Karlowitz. The Austrian forces managed to make it back to camp but lost 700 men in the engagement and Field Marshal Count Siegfried Breuner was captured. By the next day, the Grand Vizier had reached Petrovaradin and immediately dispatched 30,000 Janissaries against the imperial positions. The Janissaries dug saps and began to bombard the fortress. The bulk of the Austrian army crossed the Danube on 4 August by two pontoon bridges of boats, after which on the night of 4–5 August they encamped south of Petrovaradin. Their arrival was made under the cover of an unusual summer snowstorm.\nBattle\nGiven their numerical disadvantage, Prince Eugene decided to station his men with one flank on the Danube and the other on the fortifications, using an entrenchment left from a battle that occurred outside Petrovaradin's southern walls. A storm had damaged the bridges on the Danube delaying the deployment of the Imperial forces. Eugene took a high position from where he could command his troops.\nReady for battle were 64 battalions, 187 cavalry squadrons and 80 guns. The infantry behind the foremost entrenchment formed the centre in three lines under the command of Field Marshal Sigbert Heister and Guido Starhemberg; to the left most of the cavalry under János Pálffy; and on the right wing a separate group of four cavalry regiments under Sigbert Heister and General of Cavalry Ebergenyi. A completely independent group of six battalions outside the ramparts, under the command of Alexander von Württemberg, acted as a liaison between the centre army and the left wing cavalry, ready to advance in support. The Ottoman commander, feeling confident after defeating the reconnaissance group, demanded the surrender of the fortress. Eugene responded, \"We will attack!\"\nOn 5 August at seven o'clock in the morning, Eugene launched the Austrian offensive with a massive attack supported by frigates in the Danube river. The Imperial left wing infantry of Württemberg easily took the first Ottoman positions and a battery of ten guns while the cavalry of Pálffy drove the opposite riders from the field. At the same moment, the Imperial centre ran into over-powering numbers of Janissaries who managed to push Starhemberg's troops back into their entrenchments. Another infantry charge from Heister this time was again repulsed despite help from the Imperial cuirassiers; when the Austrian lines started breaking up, the Janissaries decided to push forward at the Habsburg centre but in doing so exposed both their flanks.\nAt this decisive moment, Eugene sent Ebergenyi's cavalry to attack the left wing while ordering Württemberg's battalions to attack the right supporting by cuirassiers. At the same time Eugene sent the reserve of Lõffelholz to secure the centre that was now moving forward. Meanwhile, the cannons of the fortress started ripping into the Turkish lines. János Pálffy with the Habsburg cavalry pushed back the Ottoman cavalry blocking simultaneously the escape route of the Janissaries, the Habsburg infantry moved in after the remaining Turks. Eugene launched a general attack leading the charge himself against the Ottoman's encampment. Damat Ali Pasha who, at the head of his bodyguard, plunged into the battle in a desperate charge, was killed,}} as well as the governors of Anatolia and Adana, Türk Ahmed Pasha and Hüseyn Pasha, along with 20,000 men. The Imperial losses were 3,695 common soldiers and 469 officers. The battle was over by 2 pm. Eugene of Savoy had taken only five hours to rout the Ottomans. Eugene wrote his report on the battle from Damad Ali's tent, reporting the seizure of 172 cannons, 156 banners, and five horse-tail standards as well as the Turkish war chest.\nAftermath\nThe Austrian Army spent 5 and 6 August on the battlefield, on 7 August it crossed the left bank of the Danube. A cavalry group made up of 1,400 riders, including 200 hussars, under General Carl Graf von Eckh set out in pursuit of the Turks.\nWithin 20 days, Eugene had marched his army into the Banat, subduing the countryside with the help of Serbian irregulars and besieged the fortress of Temeşvar, which had been in Ottoman hands since 1552; on 16 October, after a siege of 43 days, Temeşvar surrendered. It was followed by Belgrade, which fell to the Habsburg armies on 18 August 1717, when once again Eugene led the Austrian army to victory against superior forces, advancing for the first time deep into Ottoman territory.\nLegacy\nA pilgrimage church was built at Tekije (part of Petrovaradin), on the hill overlooking the battlefield. It houses the shrine of Our Lady of the Snows. The site is a place of pilgrimage every 5 August.\nAt the place of the battlefield on Vezirac hill in Petrovaradin, a monument that honours the victory of the Austrian army was erected in 1902, designed by Zagreb architect Hermann Bollé.\nFile:Petrovaradin, The Our Lady of Snow ecumenic Church.jpg|Church of St Mary of the Snows\nFile:Petrovaradin Fortress (Péterváradi vár, Peterwardein).JPG|Petrovaradin fortress\nFile:HGM Türkisches Staatszelt.jpg|Turkish state tent captured in the battle, on display in the Museum of Military History, Vienna\nSee also\n* Ottoman wars in Europe\n* Ottoman–Habsburg wars\n* Treaty of Passarowitz\nNotes\nCitations\nReferences\nBibliography\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\nWebsites\n* }}\n* }}\n*\nFurther reading\n*\nExternal links\n* [https://web.archive.org/web/20100129121853/http://www.petrovaradinskatvrdjava.rs/ Petrovaradin Fortress]\n* [http://scindeks.ceon.rs/Article.aspx?artid=0354-32931603053E The Battle of Petrovaradin and the siege of Belgrade in the autobiographical writings of Jean-Frédéric Diesbach]"
    }
  ]
}