{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Lesnaya__disambig_1\n\n|map_type=Belarus#European Russia\n|map_relief=1\n|image=\n|caption=Battle of Lesnaya, by Nicolas IV de Larmessin\n|date=9 October 1708\n|place=Lyasnaya, Polish–Lithuanian Commonwealth (present-day Belarus)\n|result=Russian victory\nSee Result\n|combatant1=25px Swedish Empire\n|combatant2=20px Cossack Hetmanate  Kalmyk Khanate\n|commander1=\n*Berndt Otto Stackelberg\n}}\n|commander2=\n*\n}}\n|strength1=\n* 25px 11,000–13,000\n**  9,000 at Lesnaya\n|strength2=\n*  24,000\n** 17,000 at Lesnaya\n* 20px 2,500–5,000\n**  3,000 at Lesnaya\n|casualties1= 3,414–5,000...other estimates\n|casualties2= 3,967–8,000...other estimates\n|campaignbox=\n}}\nThe Battle of Lesnaya; ; ; ; .}} was fought on 9 October during the Swedish invasion of Russia in the Great Northern War. Russia was the sole remaining enemy of Sweden following the dissolution of the anti-Swedish coalition in 1706. Peter I of Russia led a flying corps ( [ru]), supported by two additional divisions, to destroy a convoy under general Adam Ludwig Lewenhaupt that was heading for the Swedish main army in Ukraine with reinforcements and supplies. Peter caught up with the convoy at the village of Lesnaya (Lyasnaya) in the Polish–Lithuanian Commonwealth, present-day Belarus.\nThe Swedes were attacked in the rear at 11:00 as they were crossing the stream of Lesnyanka, at Lesnaya, heading for Propoysk (Slawharad) on the river Sozh behind which Charles XII's army was expected. The initial phase of the battle was fought over a forest clearing a distance from Lesnaya, where a Swedish outpost attempted to stall the attack. The Swedes were pushed back to the village after some hours, where Lewenhaupt ordered a general assembly. The following phase saw Russian attempts to capture the Lesnyanka bridge, to cut him off from the road to Propoysk. Reinforcements arrived successively on both sides during the battle, which continued until 19:00 when the approach of night and a sudden snowfall compelled the Russians to disengage.\nLewenhaupt decided to continue the march in the night, but thousands of troops were either too exhausted to keep up the pace or got lost in the dark. The bulk of his forces arrived at Propoysk the next day, where most wagons were abandoned or destroyed in fear of a Russian pursuit. His army crossed the Sozh over the following days. Peter, who refrained from a general pursuit, sent only smaller units to round up Swedish stragglers along the road to Propoysk, which was taken by storm. Lewenhaupt rendezvoused with Charles at Rukova on 23 October with about half of his forces remaining. The next year, Peter defeated the Swedes at Poltava and forced them to surrender at Perevolochna, resulting in the formation of a new anti-Swedish coalition.\nBackground\nIn 1700, Sweden and its ally Holstein-Gottorp were attacked by a coalition of Saxony, Russia, and Denmark–Norway. Saxony, under Augustus II, who also ruled the Polish–Lithuanian Commonwealth, invaded Swedish Livonia and besieged Riga early in the year. Meanwhile, Frederick IV of Denmark invaded Holstein-Gottorp and laid siege to Tönning, but was quickly defeated following a Swedish landing at Humlebæk under Charles XII of Sweden. Subsequently, Peter I of Russia swept into Swedish Ingria and besieged the city of Narva.\nCharles dealt the Russians a crushing blow at Narva, resulting in their withdrawal out of Ingria. The Saxons and their allies were beaten at the battle of Düna near Riga in 1701, which paved the way for a Swedish invasion of the Commonwealth to have Augustus removed from the Polish throne. In 1704, following the defeats at Kliszów, Kraków, Pultusk and Toruń, Augustus was replaced on the throne by the Swedish-installed Stanisław Leszczyński, who made peace with Sweden the next year. By this time, the Russians had captured several Swedish possessions in their Baltic Dominions, among others, the fortresses of Nöteborg, Nyenskans, Dorpat and Narva.\nIn 1705, the Commonwealth became the theatre of a major confrontation as the Russians intervened in force to restore Augustus on the throne. Following the battles of Gemauerthof, Warsaw, Grodno and Fraustadt, the Swedes were able to clear most of Poland from enemies and invade Saxony, forcing Augustus into an unfavourable peace in 1706. With Russia being the last remaining major threat, the Swedes launched an invasion in 1708. After some time of campaigning, Charles called upon reinforcements from Swedish Livonia where the general and governor of Riga, Adam Ludwig Lewenhaupt, was the acting Commander-in-chief.\nPrelude\nAssembling the convoy\n'', by David von Krafft]]\nOn 5 March 1708, Lewenhaupt received orders from Charles XII to assemble a convoy with as much men as possible without leaving Swedish Livonia exposed. For further planning, he visited the king's winter quarters at Radashkovichy from 4 April to 17 May,}} arriving at Riga seven days later. The convoy would rendezvous with Charles at Mogilev in the first weeks of August, but its assembling was complicated by the war-torn and crop-failing region. When royal orders arrived on 13 June to start campaigning, it was nowhere ready to leave. Charles struck camp three days later, while Lewenhaupt ordered his troops in Livonia and Courland to move no sooner than 6 July. Some 6,000 men were concurrently being raised to act as a reserve in Livonia by late summer.\nLewenhaupt's convoy included, apart from three-months' worth of provisions for its own troops, or not. Konovaltjuk and Lyth speculates that it carried just enough to assist Charles' in reaching and establishing winter quarters at Smolensk.}} about six-weeks' worth of ammunition and other materiel for the main army. It could potentially feed their combined armies for two to four weeks in an emergency, which was inadequate for a joint invasion deep into Russia. Hence, it is suggested that its role was more independent; perhaps to secure the route along the Daugava (Düna), to pave the way for more supplies and reserves to reach the envisioned Swedish winter quarters at Smolensk. The convoy included anything from 10,914 to 13,000 soldiers, but, according to historian Otto Haintz, this figure was meant for the public and never expected in reality, while estimates of 13,000 men includes departures. Nicholas Dorrell believes that the Swedes had a theoretical strength of 14,000 men.}} of which 1,950–4,950 were used to drive the wagons and cattle. Konovaltjuk and Lyth estimates that it had at least 4,500 wagons, some 13,000–18,000 livestock, 16,500–18,000 draught horses, 7,000 riding horses and 1,000 pack horses, as well as 4,100–7,100 civilian coachmen and officers' servants.\nOn the march\n'', by Johan David Schwartz]]\nReports soon arrived of a Russian force under Rudolph Felix Bauer that was ravaging Swedish Livonia. This compelled Lewenhaupt, who was reluctant of leaving an enemy in his rear, to stall the marching pace in expectance of a counter-order from Charles. Once having reached at least  into Lithuania, Lewenhaupt was informed that Bauer had withdrawn. Subsequently, he received confirmation of previous orders, to continue over Berezino in the Vitebsk region to the operating base at Mogilev. The convoy marched from Anykščiai on 11 August, whereas Lewenhaupt's column long – a marching distance of approximately six days. In three columns it had a depth of .}} stayed at Dawhinava from 26 August to 10 September for repairs and supplies; continuous torrential rain, which turned the roads into mud and flooded the streams, was especially damaging to the wagons. The convoy crossed the Berezina at Berezino, before halting at Chereya from 18 to 25 September where Lewenhaupt learnt that the Russians had recently burned Mogilev.\nFollowing the Battle of Holowczyn, Charles quit Mogilev on 15 August and commenced a demonstrative march southeast to draw the enemy's attention away from the convoy whilst collecting supplies. He turned north at Cherikov, reaching Tatarsk (in the Smolensk Oblast) on 21 September where he stopped to await Lewenhaupt. On 25 September, as supplies were running dangerously low and with no words heard from the general, Charles deviated from his plans of attacking Moscow via Smolensk. Instead, he marched south to establish a base of operation in Severia to exploit its rich granary; incorrect reports falsely informed him that the convoy had already crossed the Dnieper river at Mogilev, thus being relatively safe. In reality, it was still about  west of the Dnieper and  from him at the time.\nPeter left Boris Sheremetev in command of the main army to shadow Charles, while he assembled an army, including a flying corps, to intercept the convoy at the Dnieper. Lewenhaupt reached Talachyn on 26 September and Vorontsevichi the following day, where he received instructions from Charles to rendezvous at Starodub in Severia. Reports informed him that Russian forces were gathering about  east of the river. He beat the Tsar to the Dnieper at Shklov, of which crossing between 2 and 3 October has been considered a \"military masterpiece\" in retrospect. But with the Swedish main army gone east over the next major natural barrier, the Sozh river, the convoy was left isolated between the two rivers. The Russians made contact with it in the following days as it had turned south, now heading for Propoysk (Slawharad) on the Sozh via Belitsa and the marshy Dolgii Mokh. The Swedes had to march in defencive formation as the number of shadowing Russians steadily grew.\nBelitsa and Dolgii Mokh\n'', by Paul Delaroche]]\nSome 4,000 Russian dragoons along with irregular light cavalry under Gebhard von Pflug approached the Swedish rear at Belitsa on 7 October. The road network forced the convoy into a single column, resulting in bottlenecks. Lewenhaupt prepared an ambush for them with 60–70% of his army drawn up in battle formation. The Russians, discouraged from attacking, were driven off when 4,000 Swedish cavalry counter-attacked, killing 40 Russians and capturing three to eleven, to only four wounded Swedes. The Swedish vanguard reached the small village of Lesnaya (Lyasnaya), about  south of Belitsa, that same day and began setting up camp for the army.\nEarly on 8 October, the Russians launched a two-front attack on the Swedish rear as it was crossing the Rasta at Dolgii Mokh; von Pflug with up to 5,000 men confronted Berndt Otto Stackelberg from the west, who was protecting the crossing with two or three regiments of infantry, while Mikhail Golitsyn and Alexander Menshikov sought to ford the stream further up north with several thousand men. Lewenhaupt arrived in time with a contingent to block them. The two sides exchanged musket- and cannon fire from 12:00 to 16:00 before the Russians gave up their efforts.\nThe whole convoy arrived at Lesnaya later that night, situated a day's march from Propoysk – behind which both Lewenhaupt and the Tsar expected it to reach the protection of the Swedish main army. But Peter's flying corps was closing in from the north, and two Russian divisions under Nikolai Grigorovitj von Werden and Bauer approached from the northeast and east, respectively. A small detachment was also sent to block the Swedes at Propoysk in the south.\nBattlefield\nTo the immediate south of Lesnaya was the unwadable and swampy Lesnyanka stream, running parallel to the village in a northeast to southwest direction; its bridge in the western outskirts led the Swedish convoy south through the forest, on the road to Propoysk at a distance of . The Lesnaya-field, a 1,400 square metre large open plain, surrounded the village from the east, north and west, ending with forests in all three directions. A further 200 metres northwest, through the southern forest curtain, a clearing appeared – also referred to as the Middlefield – over which the highway leading to Lesnaya went. At the southern end of the forest clearing a crossroads was formed with a road coming from the southwest over the Krivl bridge. To the west of the clearing was the northern forest curtain and the road leading to Lopatichi. Apart from the open fields and forest clearings, the battlefield was dominated by bogs, swamp streams and wild forests, with minimal differences in elevation.\nOpposing forces\nSwedish army\nGeneral Adam Ludwig Lewenhaupt commanded the Swedish army with major General Stackelberg assisting. According to Lewenhaupt, the army consisted of 10,914 men at the beginning of the campaign, of which 2,900 were employed to guard and drive the wagons. At the day of battle, a vanguard of 700 men was sent towards Propoysk, with 2,806 more crossing the Lesnyanka to follow them; this was done in response to reports of a Russian detachment at Propoysk. Hence, only 4,508 effectives remained at the north side of the stream to receive the initial Russian onslaught. Some 970 men employed at the baggage that still remained at Lesnaya were quickly recalled to the lines, as were the 2,806 sent towards Propoysk, increasing the effectives north of the Lesnyanka to 8,284 throughout the action.\nOther estimates include that of lieutenant Friedrich Christoph von Weihe of the Uppland reserve regiment, who puts the Swedish force available for the campaign at 6,800 infantry and 4,650 cavalry, and ensign Robert Petre of the Hälsinge Regiment, with 8,000 and 4,950, respectively; Petre states that there were only 4,300 Swedes available for battle in the beginning, with the rest marching for Propoysk. Modern estimates by Eggenberger, Uddgren, Dorrell and Ulfhielm puts the Swedish army at 11,000, 12,000 (with 9,000 available for battle), 12,500 (with at least 9,700 at Lesnaya), and 13,000 men (with 8,700 at Lesnaya), respectively. It had six 8-pounder cannons and 10 or 11 4-pounder cannons and a few hand mortars at its disposition, and included both allotted and reserve regiments, and a few militias.\nAccording to the official Russian accounts, based on the testimonies of Swedish prisoners captured on 6 October, the Swedish convoy had a strength of 16,000 men, of whom 13,000 had fought at Lesnaya from the beginning and 3,000 at Propoysk. In his later accounts, Lewenhaupt ascribed this data to one of his captured adjutant generals, Lode or Knorring,}} but stated that it was at the time outdated by four months, and included non-participating units as well as sick soldiers and non-combatants. According to Friedrich Christoph Schlosser, the Swedish army consisted of 10,000 men.\nRussian army\nTsar Peter commanded the Russian army, which consisted of three formations. The flying corps was the largest with 13,000 regular troops and an estimated 2,000–4,000 light cavalry of Cossacks and Kalmyks. It included eight generals,}} which was a notably high number for its size. Two additional divisions were on the march; the most imminent one under General Bauer with 4,976 dragoons and 500–1,000 light cavalry, and another under General von Werden with 6,191 infantry. The Russians had at least 30 cannons with 60 six-pounder mortars at their disposal. Before arriving at the battle, Bauer detached 900 or more dragoons with accompanying light cavalry to Propoysk, while von Werden failed to arrive before it was over. Hence, no more than 17,000 regulars However, this number was quickly reduced for propaganda reasons, with 100 men or more being subtracted from each regiment. The revised number of 15,802 became the accepted one for centuries.}} and 2,000–4,000 light cavalry would fight at Lesnaya. Excluding the light cavalry, the army commanded against Lewenhaupt included Russia's best troops, with the guard regiments of Peter, Sheremetev and Menshikov.\nAccording to Alexander Gordon, a Scottish-born Russian general who fought in the campaign at the time and later wrote a biography about the Tsar, the flying corps and Bauer's division consisted of 20,000 and 8,000 men, respectively. Based on the reports from captured Russians on 7 October at Belitsa, Peter followed the convoy with 20,000 cavalry, 12,000 infantry and four cannons. The following Swedish proclamation depicts 6,000 Swedes fighting against 40,000 Russians for most of the battle. Gustaf Adlerfelt, the court historian of Charles XII, stated that the 6,000 Swedes who fought on the actual battlefield defended themselves against at least five times as many Russians. Swedish historian Ulfhielm estimates that the flying corps had 16,600 men, and Bauer's division 3,000 men.\nBattle\nRather than concentrating his troops at Lesnaya on 9 October, Lewenhaupt decided to continue the march in accordance with Charles XII's instructions to avoid a main battle. Bad weather had prevented a thoroughly reconnaissance of the Russian dispositions. Peter formed up his flying corps on the Lopatichi-field. To attack the Swedish rear as it was crossing the bridge, he first had to secure the road going over the forest clearing. That morning, he was informed that von Werden's division was force-marching to Chavusy,  from Lesnaya, and would not arrive that day. But Bauer's division had reached Berezovka and was expected to arrive in the afternoon. Peter split his flying corps into two columns; the eastern (left) one marched at the clearing from the northwest with 7,040 regulars under Aleksandr Menshikov, while Peter officially commanded the western (right) one – in reality, Golitsyn was the commander and Peter his assistant – with 5,910 regulars, which made a wide flanking manoeuvre to seize the crossroads from the southwest via the Krivl bridge. The left column traversed  of road and the right  of dense forest.\nBauer detached over 900 dragoons and some light cavalry under Fastman to Propoysk, to prevent the Swedes from crossing the Sozh. Bridges in the area had been partially destroyed and trees felled along the road to slow them down. A firefight broke out between this unit and a 700-man strong Swedish vanguard, which put a halt to the convoy at near 11:00. Lacking intelligence, the vanguard decided to await Lewenhaupt's orders before taking action. Light cavalry also started to harass the wagon train at this time. Lewenhaupt sent near 3,000 more troops over the bridge to protect the wagon train and ordered his front to hold position. More than half of his troops and wagons were thus on their way to Propoysk as the battle commenced. The others remained near Lesnaya, except for three battalions of 900 men under Lieutenant Colonel Freijbourg who functioned as an outpost at the forest clearing, facing the flying corps.\nForest clearing\nAt around 10:00, the first salvos could be heard from the forest clearing as the outpost discovered the forward element of Menshikov's column. Freijbourg seized the initiative and launched a Carolean-style attack within the next hour which brought the Russians, who were in the process of forming up, into confusion. The sounds of combat alerted the Swedish army further south. Following this success, Freijbourg's battered detachment was forced back into the southern forest curtain where five fresh Swedish battalions arrived under Stackelberg, beating back a Russian pursuit. Six more battalions were on their way from Lesnaya, while near 1,000 men serving at the wagons still north of the stream were recalled to their companies.\nBattle of Lesnaya by Jean-Marc Nattier, depicting the fighting in the forest\nBy 11:00, the front of Peter's western column had reached the crossroads from the southwest after having crossed the Krivl bridge. Stackelberg shifted focus to this new threat and drove it back to the forest it came from, but where the terrain proved more difficult for the aggressive Swedish style. The inability of Peter's column to win ground prevented it from crossing the bridge in force. The Russian guards managed to halt the Swedish advance, after which the fighting began surging back and forth. Four Russian cannons were temporarily captured. Stackelberg, whose right flank got under pressure from Menshikov column while his left was simultaneously being circumvented by Peter's column, withdrew into the southern forest curtain where the fighting resumed. The forest clearing and the crossroads were then in Russian hands. Around 12:00, 1,400 Swedes of the near 3,000 previously sent towards Propoysk returned to Lesnaya, where a general assembly had been ordered.\nAs Lewenhaupt formed up his cavalry northeast of Lesnaya to support Stackelberg, several Russian squadrons that went around Stackelberg's position to the east suddenly appeared on the Lesnaya-field. After some success, having reached as far as Lesnaya, the Russian dragoons were driven back into the forest by a Swedish cavalry attack, which was stopped by musket- and canister shots therein. Deprived of cavalry-support and seemingly hemmed in at the forest curtain by the two Russian columns, whose troops could now form up en masse, Stackelberg ordered a withdrawal to the Lesnaya-field at around 13:00 – against the wishes of Lewenhaupt. The six Swedish battalions which had yet to arrive also retreated. A Swedish battalion got isolated and was nearly annihilated as a result, and the four captured Russian cannons were retaken.\nLesnaya\n, Russian general]]\nAfter having won the forest curtain, the Russians prepared for an attack on Lesnaya and the bridge, to cut Lewenhaupt off from Propoysk. Lewenhaupt organised a battle order under the cover of his artillery to retake the forest, or in the least to prevent the Russians from reaching the Lesnaya-field. The attack was repulsed, allowing the Russians to deploy their artillery at the forest edge. After several more attacks, the Swedes withdrew to a distance of about 550 metres from the forest, losing several cannons in the process. They formed up in one thin line protecting the wagons and the bridge, while the Russians formed up in two lines with additional units in-between. The Russians focused their attacks on the right and centre, but were thrown back into the forest by Swedish counterattacks. Russian reserves, and light cavalry exploiting any openings in the Swedish formation, would in turn force the Swedes back to their starting positions. At little past 15:00, having moved his artillery closer to the centre, Peter ordered his army to stand-down in anticipation of Bauer's imminent arrival.\nBoth sides, exhausted by the day's intense combat and separated by only 150–200 metres, sank down on the field and rested. During this interlude, in which only three Russian cannons sounded off, the ranks distributed food, water and ammunition, issued orders and deployed reinforcements in preparation for the final confrontation. A Russian general, Friedrich von Hessen-Darmstadt, was shot and mortally wounded as he rode back and forth between the armies in a provocative manner. The hour-long pause concluded some time between 16:00 and 17:00, with the arrival of Bauer's division of 4,000 Russian dragoons. The Swedish artillery opened fire on Bauer's dragoons, who were forming up in five or six lines on the Russian left. This provoked an attack, pulling the bulk of the Russian forces with it. The Swedes, formed up in a tight crescent with their flanks anchored to the Lesnyanka,}} were able to closely coordinate their infantry, cavalry and artillery. Concerted Russian attacks, mainly focused against the bridge, were received with musket- and canister shot to great effect and hit in the rear by Swedish cavalry when repulsed. But additional Russian lines enabled their fleeing troops to rally and attack anew. Bauer was shot in the face in the fighting and was carried off the battlefield.\nAt 17:00, with 800–900 Swedish infantry arriving as reinforcements, Lewenhaupt launched a major counterattack against the Russian right flank. The attack broke down with heavy losses against the continuous Russian fire, causing a split in the Swedish line; the bulk withdrew towards Lesnaya, east of the bridge, and the outermost left flank towards the forest west of it. At around 18:00, as the bridge was on the verge of being lost, Lewenhaupt's last reserve of 584–700 dragoons arrived from across the stream and drove the nearby Russians back. Confused fighting followed until 19:00, when the approach of night and a sudden snowfall disorganised the combatants; the Swedes in particular suffered with the wind in their faces. Peter ordered a withdrawal to the forest curtain at 19:30 under the cover of his artillery, which kept firing throughout the night. The Swedes remained in their formations for several hours in case of a night attack.\nAftermath\nAt midnight, Lewenhaupt, who was wounded to an arm and both legs, began withdrawing his army across the Lesnyanka under the cover of darkness to continue the march. Reports of 10,000 imminent Russian reinforcements, gained from a captured officer whom referred to von Werden's division, heavily contributed to this decision. The army, reportedly 6,000 men, marched across first, except for some 1,000 who formed a square near the bridge in case of a Russian attack and to collect stragglers. As the train began moving after them, some wagons broke down and blocked the path so that the remaining baggage and possibly also a few cannons had to be abandoned.\nPropoysk\nOnce across, the Swedish army continued on towards Propoysk. Many stragglers, who either looted the wagons that were abandoned in the fast marching pace or who got lost in the dark, became easy prey for the pursuing light cavalry.\n(1870)]]\nAt his arrival, Lewenhaupt discovered that Propoysk and its bridge had been burned by Fastman's troops, who were preventing the Swedes from crossing the Sozh. Fearing a general Russian pursuit, he formed his troops for battle; Petre claims that 3,451 infantry and 3,052 cavalry were mustered in condition to fight. Subsequently, with fears of becoming trapped and with no suitable bridge-material, Lewenhaupt decided to march south to find a suitable crossing elsewhere. Most livestock and wagons were either killed, destroyed or abandoned, and their horses used to transport the combatants. Some 1,000–1,500 wounded and sick were left at Propoysk as they were deemed too weak to follow the pace Lewenhaupt intended.\nAt daybreak, Peter discovered the abandoned Swedish positions at Lesnaya and sent a dragoon detachment under Pflug in pursuit. Many drunk or wounded Swedish soldiers were killed or captured along the road, as was their artillery. When Pflug arrived at Propoysk at 16:00, he discovered the remaining Swedish troops whose numbers had allegedly swollen to 3,000 men with the addition of stragglers. The Swedes responded to the Russian demands to surrender with musket fire, after which the town was taken by storm in an hour of fighting. About 2,000 survivors made it over the river and began marching back to the Swedish Baltic provinces. Towards the evening, von Werden's infantry division arrived at Lesnaya and could participate in the pursuit. The Swedish army was, however, allowed to withdraw relatively unmolested as the Russians were mostly content with rounding up stragglers.\nContinued march\nOn 11 October, Lewenhaupt found a crossing at Glinki, which was used over the two following days. Order had now been restored in his army, which made good speed to rendezvous with Charles XII near Russian-controlled Starodub in Severia. On 20 October, several thousand Russians from Sheremetev's army attacked Lewenhaupt's rearguard at Lyshchichi, killing 30 and wounding 50 more before being repulsed. Later that day, Lewenhaupt unexpectedly stumbled upon one of Charles' detachments at Truchanovo under major General Lagercrona. On 23 October, his troops reached Charles at Rukova, with 6,000–6,700 men remaining and but few of the wagons. Some 800–1,500 Swedes turned up in Mitau and Riga a few months later. The most battered units in Lewenhaupt's army were incorporated into regiments of the Swedish main army.\nCharles failed to secure Severia for a base of operation against Moscow, and marched further south into Ukraine to feed the army. With the convoy destroyed, ammunition, gunpowder and materiel had to be obtained from the Cossack hetman, Ivan Mazepa, whose capital of Baturyn held large supplies. However, the city was sacked by the Russians shortly after Mazepa defected to the Swedes. The campaign of 1709 ended with the disastrous Swedish defeat at Poltava and subsequent surrender at Perevolochna, in which all Swedish troops were lost but a few who followed the king into exile in the Ottoman Empire. As a result, the anti-Swedish coalition resurrected with the treaties of Thorn and Copenhagen later that year.\nResult\nBoth sides declared themselves victorious after the battle. Russian official declarations and leaflets announced the complete destruction of the Swedish army, while the Swedes emphasised that Lewenhaupt had managed to break through, despite being heavily outnumbered, and kept the field at the day of battle. Historians generally view it as a Russian victory, or a draw but with an aftermath, in which the wagon train was lost, favouring the Russians. A few believe it was a Swedish victory. Swedish historians has described it as a \"[Swedish] victory that became a defeat\", and a victory for Lewenhaupt but a defeat for the main army. In Russian historiography, the battle is sometimes styled the \"Mother of Poltava\" in reference to, among other things, a Russian morale boost which paved the way for the decisive victory the following year. Charles referred to it as the \"fortunate action\" in a letter to Lewenhaupt.\nThe battle has widely been seen as a great Russian victory and first indication of the campaign's result, but this view has also come to be challenged. Dorrell argues that it was far from a Russian triumph, since they had failed with their goal of destroying Lewenhaupt's heavily outnumbered army while also suffering greater losses; the Swedes withdrew in good order and, instead of leading a major pursuit, Peter marched in the opposite direction to celebrate and propagandise the outcome, having little direct responsibility for their subsequent losses.\nConsequences\nWhile the loss of the wagon train deprived the Swedish main army of ammunition and materiel, and Lewenhaupt's troops of their provisions, it was other circumstances that led to their failure in reaching Moscow; the Smolensk-operation was aborted due to logistic reasons, and the Severia-operation}} because Charles was unable to secure the region for a base of operation. Some authors attest that the battle shattered the Swedish notion of invincibility and hurt their reputation in Europe, most importantly among their allies in Poland, but also the Ottoman Empire and other Great Powers. Others say that the Tsar's propaganda, which was spread for this purpose, had little effect among the Great Powers at the time. According to the Slovakian evangelist Daniel Krman, who visited Charles during the campaign, the battle and the subsequent Swedish propaganda influenced Mazepa to switch sides.\nCasualties\nSwedish casualties\nBecause of the destruction of Swedish documents after the battle, and before the surrender at Perevolochna in 1709, only three secondary Swedish sources but no official records exist of the Swedish strength and casualties.\nContemporary Swedish sources\n'', ending the Swedish invasion of Russia.]]\nDuring his captivity in Russia following the Surrender at Perevolochna, General Lewenhaupt gained access to Russian reports, which he used to write his account; it has been viewed as a statement of defence of questionable historical objectivity by later historians. He concludes that, while 8,284 Swedes were engaged, his strength never exceeded 6,000 men at any point in the battle, which suggests a loss of at least 2,284 on the battlefield (unless units were dispatched elsewhere). Of these, slightly over 1,000 were killed or captured. According to his estimations, 6,000 men reached Charles XII and 1,500 Riga; 1,614 were killed or captured on the battlefield and the Propoysk road, and 1,800 were captured afterwards. In all, 3,414 killed and captured out of 10,914 men.\nLieutenant von Weihe and Ensign Petre provides alternative numbers. von Weihe states that 2,000 Swedes were killed in the battle, and 1,800 captured in total. Petre, presenting a detailed list of each regiment's serviceable strength at Propoysk, claims that 6,503 Swedes marched therefrom with the rest being either killed or captured; Petre, however, includes the thousand Swedes who made it back to Riga among these losses. Uddgren questions whether Petre's account should be viewed as a diary and not more as a memoir of less historical value.\nOther estimates and calculations\nSeveral authors have attempted to calculate the Swedish losses sustained in the battle and retreat on the basis of Petre's estimation of 12,950 men at the beginning of the campaign. By subtracting an overall 1,000 captured Swedes, some 500 killed at Propoysk and 6,500 who marched therefrom, as well as the 2,500 who got dispersed (of whom 1,250 made it back to Sweden), Konovaltjuk and Lyth concludes that less than 2,500 Swedes died in the battle and the road towards Propoysk; for a total of 4,000 killed and captured in the battle and pursuit. Artamonov, subtracting 877 captured based on Russian reports, 1,500 who made it back to the Swedish Baltic provinces and 6,700 who reached the main Swedish army, concludes that 3,873 Swedes died since having crossed the Dnieper on October 3 to rendezvousing with Charles twenty days later. For a total of 4,750 killed and captured. Additional calculations have been made by Uddgren, subtracting a patterned 6,000 at Propoysk and 1,500 arriving at Riga, and Dorrell, subtracting 6,503 survivors reaching Charles and 1,000 Riga, for total losses of 4,500 and 5,000 men, respectively.\nWithout specifying any sources, authors Dowling and Glaeser puts the Swedish casualties at 3,000, and Bodart, in his Militär-historisches Kriegs-Lexikon, at 6,000. Azyassky, writing for the Great Russian Encyclopedia, and Shkvarov estimates a Swedish loss of 6,400 and 6,396 men, respectively. The Russian proclamation claims that 8,000 Swedes were killed on the battlefield and 500 more at the Sozh, while other relations speak of 3,500 captured. According to General Gordon, 6,700 Swedes were killed or wounded on the battlefield and 5,000 in the pursuit. However, such numbers are viewed as unrealistic when comparing the amount of survivors with the initial strength, and because no other major battle at the time exceeded 40% losses for any side. Apart from the artillery, the Russians claimed to have captured 40–47 Swedish military colours.\nRussian casualties\nContemporary Russian sources\nAccording to the official accounts, there were 1,111 killed and 2,856 wounded Russians in the battle; Konovaltjuk and Lyth regard them as incomplete and contradictory – among other things, they do not report on missing men, killed in Bauer's division, or losses for officers and light cavalry – and increases the losses to 1,192 killed and 2,924 wounded, excluding light cavalry and 190 officers. According to the pseudonym \"J. H. v. L.\", writing for the Tsar, the losses were 1,277 and 2,734, respectively, numbers which gains support from Krotov. Lyth notes, in the Great Northern War Compendium, that \"the real figures are unknown but were probably much higher\".\nAlternative sources include that of General Gordon, according to whom 3,000 Russians were killed and 4,000 wounded. And field marshal Boris Sheremetev, concurrently watching Charles with the main army, stating that 8,000 of Russia's best troops were lost and that no clear victory was achieved. Author Bushkovitch, entrusting himself to the official accounts, calls this a \"wild exaggeration\" in his biography about Tsar Peter.\nOther estimates\nWithout specifying any sources, Bodart puts the Russian losses at 4,000, and Dowling and Eggenberger at 10,000. Adlerfelt declared that the Russians lost 6,000 men killed and many more wounded; referring to the \"confession\" of a Russian Adjutant-General named Schultz, who was captured by the Swedes in early December 1708. Hence, a subsequent Swedish proclamation stated that the Russians had lost 6,000 killed and at least 12,000 wounded on the battlefield, while Swedish newspapers boosted the figure to 20,000 in total. During his captivity in Moscow, Lewenhaupt gained access to, according to him, trustworthy accounts from foreign officers in Russian service who assured him that no less than 9,000 Russians had been killed or wounded in the battle. Artamonov questions the reliability of this claim. The Swedes claimed that 17 Russian colours and two military drums were captured.\nNotes\nReferences\nSources\n*  |first=Gustavus |last=Adlerfeld |authorlink=Gustaf Adlerfelt |language= |year=1740 |publisher=J. and P. Knapton |location=London |oclc=1422375281}}\n*  |date=2008 |publisher=Общество памяти игумении Таисии |location=Saint Petersburg |isbn=9785910410330}}\n*\n*\n*  |first=Carl |last=Bennedich |language=sv |year=1912 |publisher=Karolinska förbundet |location=Lund |oclc=936696934}}\n*  |first=Per Gustaf |last=Berg |language=sv |year=1847 |publisher=P. G. Berg |location=Stockholm |oclc=162519711}}\n*\n*\n*  |first=Claes |last=Bratt |language=sv |year=1931 |publisher=C. W. K. Gleerups förlag |location=Lund |oclc=464118790}}\n* |year=2001 |publisher=Cambridge University Press |location=Cambridge |isbn=9781139430753}}\n*  |first=Nicholas |last=Dorrell |year=2009 |publisher=Partizan Press |location=Nottingham |isbn=9781858185941}}\n*  |last=Dowling |first=Timothy C. |year=2015 |publisher=ABC-CLIO |location=Santa Barbara, California |language= |isbn=9781598849479}}\n*  |last=Eggenberger |first=David |year=2012 |publisher=Dover Publications |location=Newburyport, Massachusetts |language= |isbn=9780486142012}}\n*  |first=Peter |last=Englund |authorlink=Peter Englund |language= |year=2013 |publisher=I.B. Tauris |location=London |isbn=9781780764764}}\n*  |first=Peter |last=From |language=sv |year=2007 |publisher=Historiska Media |location=Lund |isbn=9789185377701}}\n*  |first=Robert I. |last=Frost |authorlink=Robert I. Frost |language= |year=2000 |publisher=Longman |location=Harlow |isbn=9780582064300}}\n*  |author=Generalstaben |author-link=General Staff (Sweden) |language=sv |year=1918 |publisher=P. A. Norstedt & söners förlag |location=Stockholm |oclc=163888651}}\n*  |date=2020 |publisher=Helion & Company |location=Warwick |isbn=978-1-913336-46-2}}\n*  |last=Gordon |first=Alexander |authorlink=Alexander Gordon (general) |year=1755 |publisher= F. Douglass and W. Murray |location=London |language= |oclc=907922720 }}\n*  |first=Otto |last=Haintz |language=de |year=1958 |publisher=Walter de Gruyter & co. |location=Berlin |oclc=265456819}}\n*  |first1=Per |last1=Iko |first2=Martin |last2=Hårdstedt |language=sv |year=2003 |publisher=Wahlström & Widstrand |location=Stockholm |isbn=9789146202257}}\n*  |last1=Konovaltjuk |last2=Lyth |first1=Pavel |first2=Einar |year=2009 |publisher=Svenskt Militärhistorisk Biblioteks Förlag |location=Hallstavik |language=sv |isbn=978-91-85789-14-6}}\n*\n*  |last1=Lewenhaupt |last2=Creutz |first1=Adam Ludwig |first2=Carl Gustaf  |authorlink1=Adam Ludwig Lewenhaupt |authorlink2=Carl Gustaf Creutz |year=1757 |publisher=Wildiska tryckeriet |location=Stockholm |language=sv |oclc=985360466 }}\n*  |first1=Einar |last1=Lyth |first2= Stephen L |last2= Kling, Jr|language= |year=2015 |publisher=THGC Publishing |location=St. Louis |isbn=9780996455701}}\n*  |last=Moltusov |first=Valerij Aleksejevitj |year=2010 |publisher=Svenskt Militärhistorisk Biblioteks Förlag |location=Stockholm |language=sv |isbn=978-91-85789-75-7}}\n*  |first=Patrik |last=Nilsson |language=sv |year=2023 |publisher=Svenskt Militärhistoriskt Biblioteks Förlag |location=Stockholm |isbn=9189780051}}\n*  |last1=Petre |last2=Quennerstedt |first1=Robert |first2=August Wilhelm |year=1901 |publisher=Distribuent Gleerupska univ.-bokhandeln |location=Lund |language=sv |oclc=245711232}}\n*  |last=Schlosser |first=Friedrich Christoph |author-link=Friedrich Christoph Schlosser |translator-last=Davison |translator-first=David |year=1843 |publisher=Chapman & Hall |location=London |oclc=1051485017}}\n*\n*  |first=Arthur |last=Stille |language=sv |year=1908 |publisher=Berlingska boktryckeriet |location=Lund |oclc=38702063}}\n*  |first=Spencer C. |last=Tucker |authorlink=Spencer C. Tucker |language= |year=2010 |publisher=ABC-CLIO |location=Santa Barbara, California |isbn=9781851096725}}\n*  |first=Hugo E. |last=Uddgren |language=sv |year=1919 |publisher=A.B. Nordiska Bokhandeln |location=Stockholm |oclc=891463792}}\n*  |first=Hugo E. |last=Uddgren |language=sv |year=1950 |publisher=Författarens Eget Förlag |location=Uddevalla |oclc=979134014}}\n*  |first=Hans |last=Ulfhielm |language=sv |year=1993 |publisher=Militärhistoriska Förlaget |location=Stockholm |isbn=9185266531}}\n*  |last=Урланис |first=Борис Цезаревич |year=1960 |publisher=Изд-во социально-экон. лит-ры |location=Moscow |language=ru |oclc=12895780}}\n*  |last1=von Weihe |last2=Carlson |first1=Friedrich Christoph |first2=Ernst |year=1902 |publisher= Norstedt |location=Stockholm |language=de |oclc=314612564}}\nExternal links\n*[http://www.historyofwar.org/articles/battles_lesnaja.html Description of the battle at www.historyofwar.org (English)]\n*[https://web.archive.org/web/20071013082524/http://hronos.km.ru/sobyt/lesnaya1708.html Battle of Lesnaya at Hronos.km.ru (Russian)]\n*[https://books.google.com/books?id=XfIIAAAAQAAJ Военный энциклопедический лексикон]. СПб. Часть 8. 1844."
    }
  ]
}