{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Chinsurah__disambig_1\n\n|map_type    = India West Bengal#India\n|map_relief  = Yes\n|map_label   = Chinsurah\n|result      = British victory\n|combatant1  =    Bengal Subah\n|combatant2  =\n|commander1  =  Francis Forde   Charles Wilson   Mir Jafar\n|commander2  =  Jean-Baptiste Roussel\n|strength1   = 300 European infantrymen  800 sepoys  50 European cavalrymen  200 Indian cavalrymen  3 warships  100 Bengali cavalrymen\n|strength2   = 150 Europeans (garrison)  300 sepoys (garrison)  700 Europeans (reinforcements)  800 Malays (reinforcements)  7 warships\n|casualties1 = Unknown\n|casualties2 = 320 killed  300 wounded  550 captured  6 warships captured  1 warship grounded\n|campaignbox =\n}}\nThe Battle of Chinsurah, also known as the Battle of Biderra or the Battle of Hoogly, took place on 25 November 1759 near Chinsurah during the Seven Years' War. It was fought between forces of the British East India Company (EIC) and the Dutch East India Company (VOC), the latter of whom had been invited in 1759 by the Nawab of Bengal, Mir Jafar, to help him expel the EIC and establish the VOC as the leading European power in Bengal.\nDespite the Kingdom of Great Britain and the Dutch Republic not formally being at war, the VOC's forces advanced up the Hooghly River. They met a force of Bengal Army troops under Francis Forde at Chinsurah on 25 November, fifty kilometres from Calcutta. Forde's troops defeated the Dutch, forcing them to withdraw. Several EIC ships had earlier engaged and defeated the ships the VOC used to deliver the troops in a separate naval battle on 24 November.\nBackground\nFollowing the British capture and demolition of the French outpost at Chandernagore in 1757, Mir Jafar, the Nawab of Bengal, opened secret negotiations with representatives of the Dutch East India Company to bring troops into Dutch holdings in the area with the goal of using them against the British. Britain and the Dutch Republic were at peace, although tensions were high due to the Seven Years' War, and British East India Company administrator Robert Clive was preoccupied with fighting the French. The Dutch directors of the outpost at Chinsurah, not far from Chandernagore, seeing an opportunity to expand their influence, agreed to send additional troops to Chinsurah. A fleet of seven ships, containing more than fifteen hundred European and Malay troops, came from Batavia and arrived at the mouth of the Hooghly River in October 1759, while the Nawab was meeting with Clive in Calcutta.\nThe Nawab had been forced to ask the British for assistance against threats on his northern border in the interim, and told Clive that he would return to Hooghly, summon the Dutch directors, and demand the departure of their ships. After meeting with the Dutch, he informed Clive that he had granted the Dutch some privileges, and that they would leave as soon as circumstances permitted. This news, combined with reports that the Dutch were recruiting in and around Chinsurah, led Clive to treat the situation as a real military threat.\nOf four ships he had available, Clive sent one out in an attempt to request assistance from Admiral Cornish, who was patrolling the coast. The Dutch captured this ship when they seized several smaller British vessels on the Hooghly River. Clive called out the militia and put out calls for volunteers, increased the fortifications on the river batteries, and sent Colonel Francis Forde with five hundred men toward Chandernagore with an eye toward capturing the Dutch outpost at Baranagore and intercepting the Dutch should they try to take Chandernagore. The Dutch landed their troops on the northern shore of the Hooghly on 21 November, just beyond the range of the British river batteries, and marched for Chinsurah.\nBattle\nThe three remaining British ships had followed the Dutch ships up the river at some distance. When the Dutch had finished landing the troops, the Dutch ships began moving down the river. On 23 November, Commodore Charles Wilson, commander of the British flotilla, indicated that he wanted to pass the Dutch, who threatened to fire on the British if they did. The next day, after the rejection of an ultimatum from Clive demanding restitution for the earlier Dutch seizures, the two fleets engaged. In a two-hour battle, the Duke of Dorset forced the Dutch flagship Vlissingen to strike her colours, while Hardwicke and Calcutta chased off two ships and grounded a third before the remaining ships also struck their colours. (Other British ships arriving at the mouth of the river eventually captured the two remaining fleeing Dutch ships.)\nOn the night of 23 November, Forde and his men encamped near Chandernagore, having successfully taken control of Baranagore (Now Baranagar). The Dutch, hoping to trap Forde between the arriving troops and the Chinsurah garrison, sent their arriving troops out to camp in the ruins of Chandernagore that night. The following morning the two forces engaged. Forde's men routed the Dutch, forcing them back to Chinsurah, and captured the Dutch field artillery. Additional troops sent from Calcutta joined Forde there, raising the size of his force to about 1200 men. The Nawab also sent 100 cavalry to the British camp, ostensibly to assist the British; these were likely placed to observe the battle and side with the victors. With reports from prisoners that the Dutch reinforcements would be arriving the next day, Forde rushed a message to Clive in Calcutta requesting advice, as attacking the Dutch force could be viewed as an act of war. Clive responded by writing on the back of Forde's message, \"Dear Forde&mdash;Fight them immediately\", and sending it back.\nForde chose as his location the plain of Biderra, between Chinsurah and Chandernagore. His troops occupied the village of Biderra on the right and a mango grove to the left; a wide ditch secured the center. At about 10 on the morning of 25 November, the Dutch force arrived. As soon as they came within range, Forde ordered his field artillery to fire. The Dutch continued to advance in spite of the British fire until they reached the ditch, something they had not apparently been aware of. When the front of the Dutch lines stopped, the rear continued to press forward, throwing the Dutch forces into confusion. As their position was then within range of British musket fire, they suffered significant casualties before managing to turn retreat. At this point Forde sent out his cavalry, inviting the nawab's men to join the charge. However, the nawab's men held back and did not join the British until the second charge, when it seemed clear they would be victorious.\nAftermath\nThe British victory was so complete that, of the Dutch troops sent, only sixteen Europeans successfully reached Chinsurah. In the wake of their victory, Clive overthrew Mir Jafar and replaced him with his son-in-law Mir Kasim Ali Khan. Along with the Battle of Plassey, the battle helped establish British control over Bengal. The battle did not affect Dutch neutrality and they remained one of the few European states not involved in the war.\nReferences\nBibliography\n* Harvey, Robert. Clive: The Life and Death of a British Emperor. Sceptre, 1999.\n* Keay, John. The Honourable Company: A History of the English East India Company. HarperCollins, 1993\n* McLynn, Frank. 1759: The Year Britain Became Master of the World. Pimlico, 2005.\n* [https://books.google.com/books?id=2YUBAAAAQAAJ&dq=forde+Chinsurah&pg=PA120 Malleson, George Bruce. The decisive battles of India: from 1746 to 1849 inclusive]"
    }
  ]
}