{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Kunlun Pass__disambig_1\n\n| place             = Suburbs of Nanning city in Guangxi province, Republic of China\n| casus             =\n| territory         = Chinese hold the pass\n| result            = Chinese victory\n| combatant1        =\n| combatant2        =\n| commander1        =  Bai Chongxi Du Yuming Qiu Qingquan Li Mi Liao Yaoxiang  Dai Anlan\n| commander2        = border Masao Nakamura\n| strength1         = 5th corps : 60,000200th Division:54 tanks out of 82 T-26 M1935/M1937 tanks and ~30 CV-35 tankettes\n3rd PG, 32nd PS,Capt. Wei Yiqing:14 I-15, 7 Gladiators, ? O-25th PG, 28th PS,Capt. Arthur Chin:? I-15, 3 Gladiators\n| strength2         = 5th division (particularly the 21st Brigade) plus various other units, total fighting strength of 45,000100 planes70 warships2 aircraft carriers\n| casualties1       = 5th corps :123 officers and 5,560 soldiers killed265 officers and 10,847 soldiers wounded896 soldiers missing\n4 T-26s\n4 CV-35s\n11 T-26s recovered and repaired\n5 CV-35s recovered and repaired\n| casualties2       = Official Chinese Army claim :4,200 killed or wounded7 capturedOther Chinese claim : 10,000 casualties, including 5,000 killed and 102 capturedJapanese claim :Colonel Miki's troops (21st infantry regiment) : 376 killed, 755 wounded, and 37 missingOikawa's detachment (9th infantry brigade) : 112 killed, 481 woundedThe 21st Infantry Regiment and 42nd Infantry Regiment of the Japanese 21st Brigade received 2,662 additional soldiers in January 1940 to supplement the combat and non-combat losses in the battle.\n}}\nThe Battle of Kunlun Pass () was a series of conflicts between the Imperial Japanese Army and the Chinese forces surrounding Kunlun Pass, a key strategic position in Guangxi province. The Japanese forces planned to cut off Chinese supply lines linking to French Indochina, but the Chinese forces managed to fight off the attacks.\nThe battle\nThe Imperial Japanese Army launched a major offensive into Guangxi province with the intention of eliminating the Chinese supply route through French-controlled Vietnam.  The elite Japanese 5th Division was given the task of spearheading the Japanese offensive. After occupying Nanning in November 1939, the Japanese captured the key point of Kunlun Pass and were poised to attack the Chinese forces that protected Chongqing, the wartime capital.\nRealizing that inaction would result in being cut off, General Bai Chongxi, himself a native of Guangxi, asked the Nationalist Government for reinforcements. Chiang Kai-shek in turn, dispatched the 5th Corps from Hunan province to fight the Japanese.\nThe 5th Corps was the most elite unit in the National Revolutionary Army, and it was also the only Chinese unit that had tanks and armored vehicles. Its soldiers were combat-hardened veterans from previous engagements against Japanese forces, and as a result, morale was high. General Du Yuming, commander of the 5th Corps, dispatched two divisions to attack the Japanese-held Kunlun Pass. The New 22nd Division's attack ended up cutting off Japanese reinforcements from the rear and also resulted in the death of the Japanese commander, Major General Masao Nakamura.\nThe Japanese reacted immediately by sending in the elite unit of the Japanese 5th Division, the 21st Brigade, which had also participated in the Russo-Japanese War, nicknamed the \"unbreakable sword\".  Faced with the serious possibility of being completely cut off, the Japanese army ended up relying on air power for the delivery of vital supplies. Before Major General Nakamura's death, he admitted in his diary that the Chinese soldiers' fighting ability had surpassed the Russians whom the Brigade encountered in Manchuria. At a heavy cost, the Chinese army claimed to have inflicted a total of 10,000 casualties on the Japanese. Among the claimed Japanese casualties were 5,000 fatalities, including over 85% of all officers, such as Major General Nakamura, Colonel Sakata Gen'ichi (commander of the 42nd Regiment and acting commander of the 21st Brigade), Colonel Miki Kichinosuke (commander of the 21st Regiment), Colonel 生田滕一 (deputy commander of the 21st Regiment), 杵平作 (commander of the 1st Battalion), 官本得 (commander of the 2nd Battalion), 森本宮 (commander of the 3rd Battalion), among others. Additionally, the Chinese claimed to have taken 102 Japanese troops as prisoners, and captured 79 horses, 10 mountain guns, 12 field guns, 10 anti-tank guns, 102 light machine guns, 80 heavy machine guns, and 2,000 rifles.\nWhile Major General Masao Nakamura (中村正雄) was indeed killed in action in the battle of Kunlun Pass, neither of the regiment commanders the Chinese claimed to have killed actually died in the battle. Colonel Miki Kichinosuke (三木吉之助) continued serving as the commander of the 21st regiment until October 1940, and died of illness on 26 February 1944. Sakata Gen'ichi (坂田元一) served as the commander of the 42nd regiment until December 1940, was later promoted to Major General, and died in 1988. There is no Ikuta Tetsuichi (生田滕一) who served as the deputy commander of the 21st regiment. Instead, Ikuta Tetsuichi was the commander of the 56th regiment of the 18th division in 1945. There are no information regarding the three battalion commanders who were claimed to have been killed in this battle. The only notable officers confirmed to have been killed in the battle of Kunlun Pass are Major General Nakamura and two company commanders.\nThe Japanese army reported Colonel Miki's 21st infantry regiment (including Matsumoto's battalion of the 42nd infantry regiment temporarily under Colonel Miki's command) as 376 killed, 755 wounded, and 37 missing. The losses of the 9th infantry brigade and the two regiments of the Taiwan Mixed Brigade are 112 killed and 481 wounded. The total amounts to 1,761 killed, wounded, or missing. The losses of the 42nd infantry regiment (excluding Matsumoto's battalion) and units directly under the 5th division are unknown.\nDu Yuming, commander of the 5th corps, reported his army's losses as 5,664 killed, 11,112 wounded, and 896 missing. However, his statistics of losses differ from ones compiled by each division and the 'List of Fallen Soldiers of the Fifth Corps in Kunlun Pass'. According to the battle report of the 5th Corps, the 1st honor division suffered 1,680 killed, 3,411 wounded, and 189 missing, while the battle report of the 1st honor division reported its losses as 994 killed, 2,448 wounded, and 36 missing. The 'List of Fallen Soldiers of the Fifth Corps in Kunlun Pass' puts the total number of martyrs for the division at 998, nearly matching up the number of killed soldiers reported by the 1st honor division. The 200th division have the same issue, with the 5th Corps reporting the division's losses as 1,870 killed, 3,626 wounded, and 442 missing, which would mean the 200th division suffered more losses than the 1st honor division. The 200th division reported its own losses as 794 killed, 1,210 wounded, and 113 missing, while the 'List of Fallen Soldiers of the Fifth Corps in Kunlun Pass' puts the number of martyrs of the 200th division at 565, much less than either reports. Finally, the battle reports of the 5th Corps and the new 22nd division for the losses of the division give the same losses at 1,563 killed, 3,199 wounded, and 221 missing, but the 'List of Fallen Soldiers of the Fifth Corps in Kunlun Pass' puts the number of dead for the new 22nd division at 1,055. Overall, the total number of soldiers recorded in the 'List of Fallen Soldiers of the Fifth Corps in Kunlun Pass' only totaled 2,953, just over half of the number of killed soldiers reported by the 5th Corps. Moreover, Du Yuming in his eulogy for the fallen soldiers of the Fifth Corps said that in the three-month battle of Southern Guangxi from November 1939 until January 1940, his army had 4000 soldiers killed in action, less than his initial report of losses for just the battle of Kunlun Pass, which would mean that he exaggerated his army's losses in his report to the Fourth War Zone for this campaign.\nKaji Wataru, a Japanese member of the Chinese Resistance, and his Anti-War League, which was made up of Japanese POWs who had defected to the Chinese resistance, were sent to Kunlun during the battle to launch a psychological warfare campaign against  Japanese troops in the region. Their operations were reported by an Australian Newspaper during the war.\nOrders of battle\nChinese\n*5th Corps - Commander Du Yuming\n**200th Division - Commander Dai Anlan\n**1st Honor Division - Commander Zheng Dongguo\n**New 22nd Division - Commander Qiu Qingquan\nJapanese\n*21st Brigade / 5th Division\n**21st Infantry Regiment\n**42nd Infantry Regiment\n*Cavalry Regiment / 5th Division\n*5th Artillery Regiment / 5th Division\n*Two Regiments / Taiwan Mixed Brigade\nNotes\nReferences\n*Hsu Long-hsuen and Chang Ming-kai, History of The Sino-Japanese War (1937–1945) 2nd Ed., 1971. Translated by Wen Ha-hsiung, Chung Wu Publishing; 33, 140th Lane, Tung-hwa Street, Taipei, Taiwan Republic of China. Pg. 311–318, Pg. 325–327,\n*[http://www.lib.utexas.edu/maps/ams/china/ Perry–Castañeda Library Map Collection], China 1:250,000, Series L500, U.S. Army Map Service, 1954- . Topographic Maps of China during the Second World War.\n*Xu Fan and Zhen Rui Zhu, Iron War: The Complete History of Sino-Japanese Force 1938-1945 (Chinese Edition), 2015-12-01\nBibliography\n* Cheung, Raymond. OSPREY AIRCRAFT OF THE ACES 126: Aces of the Republic of China Air Force. Oxford: Bloomsbury Publishing Plc, 2015. .\n* 徐 (Xú), 露梅 (Lùméi). 隕落 (Fallen): 682位空军英烈的生死档案 - 抗战空军英烈档案大解密 (A Decryption of 682 Air Force Heroes of The War of Resistance-WWII and Their Martyrdom). 东城区, 北京， 中国: 团结出版社, 2016. .\nExternal links\nTopographic maps\n*[http://www.lib.utexas.edu/maps/ams/china/txu-oclc-10552568-nf49-1.jpg Lai-pin NF49-1]\n*[http://www.lib.utexas.edu/maps/ams/china/txu-oclc-10552568-nf49-5.jpg Nanning NF49-5]"
    }
  ]
}