{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Herat (1598)\n\nSafavid Iran\n| combatant2        =  Shaybanids\n| commander1        =  Abbas the Great\n| commander2        = Din Mohammad Khan\n| strength1         = 10,000–15,000\n| strength2         = 20,000\n| casualties1       = 5.000 killed\n| casualties2       = 15.000 killed\n}}\nBattle of Herat took place on August 9, 1598, between the Shaybanid Khanate and the Safavid Empire for Khorasan and Balkh. The battle resulted in the complete defeat of the Uzbeks and Safavid Empire fully restored its power in Khorasan and got back the region.\nBackground\nDuring the reign of Shah Muhammad Khudabanda, the Safavid Empire was experiencing deep internal turmoil. During this period of turmoil, in which the Shah's weakness played an important role, the empire was attacked by its neighbors to the east and west. In 1578, Shaybanids which took an advantage of the Ottoman Empire's declaration of war on the Safavid Empire, attacked the Safavids from the east. The Ottoman-Shaybanid alliance forced the Safavid Empire to wage war on two fronts. After the defeat against the Ottoman Empire in the west, the Astrakhanid dynasty, which replaced the Shaybanid dynasty, attacked Khorasan and captured it.\nIn 1587, Shah Mohammad Khodabanda was succeeded by his young son Shah Abbas. He set himself the task of returning all the lost lands. Shah Abbas, who signed an unpleasant peace with the Ottoman Empire, started reforms including an active army and tried to centralize his state. Despite the fact that the most dangerous enemy of the Safavid Empire was on its western border, Shah Abbas was aware that it would be very difficult to fight them yet. Therefore, he decided that it would be more appropriate to eliminate the threat of the enemy in the east at the first stage. In 1597, Shah Abbas began a campaign against the Uzbeks. Many of the main cities of Khorasan were captured. Mashhad was easily subordinated to the Safavid army. However, the Uzbek commander Din Mohammad escaped alive and managed to escape to Herat. On August 9, 1598, the Safavid army approached Herat.\nBattle\nShah Abbas, seeing the strengthening of Herat's fortress walls, was aware that the siege of the fortress could last for a very long time. Therefore, he was able to force the Uzbek army to leave the castle by using false retreat tactics. The Uzbek army that left the fortress was surrounded and defeated by the Safavid army. Din Mohammad, the Uzbek commander, was wounded in the battle and killed by his own fighters on the way back.\nResult\nWith the successful conclusion of this campaign, the Safavid Empire not only regained Khorasan, but also dealt a blow to its main rival in the east, which ensured the security of its eastern borders. Thus, the Uzbek army was dealt such a heavy blow in the battle of 1598 that they could not recover their forces for a long time and enter into an open struggle with the Safavid Empire. Shah Abbas focused on the issue of war with the Ottoman Empire only after ensuring the security of the eastern borders, which he attached great importance to, and started this war in 1603. As a result of this war, great victories were won over the Ottoman army.\nSee also\n*Uzbek invasion of Khorasan (1578)\n* Safavid-Shaybanids wars\nReferences\nSources\n*"
    }
  ]
}