{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Tres Castillos\n\nNana\n| strength1         = 260\n| strength2         =  150\n| casualties1       = 3 killed\n| casualties2       = 62 warriors and 16 non-combatants killed68 captured\n| campaignbox       =\n}}\nThe Battle of Tres Castillos, October 14–15, 1880, in Chihuahua State, Mexico resulted in the death of the Chiricahua Apache chieftain Victorio and the death or capture of most of his followers. The battle ended Victorio's War, a 14-month long odyssey of fight and flight by the Apaches in southern New Mexico, western Texas, and Chihuahua. Mexican Colonel Joaquin Terrazas and 260 men surrounded the Apache and killed 62 men, including Victorio, and 16 women and children, and captured 68 women and children. Three Mexicans were killed. Victorio had little ammunition to resist the attack.\nBackground\nIn 1879, the veteran Chiricahua war chief, Victorio, and his followers were facing forcible removal from their homeland and reservation at Ojo Caliente, New Mexico,  north of present-day Monticello, and transfer to San Carlos Apache Indian Reservation in Arizona. On August 21, 1879, Victorio, 80 warriors, and their women and children fled the reservation.  Victorio was joined by other Apache, especially Mescalero, and his force may have reached a maximum of 200 warriors, an unusually large force of Apache warriors assembled under a single leader.\nFor 14 months, Victorio led a guerrilla war against the U.S. and Mexican armies and civilians in southern New Mexico, western Texas, and northern Mexico. He fought more than a dozen battles and skirmishes and raided several civilian settlements. Several thousand American and Mexican soldiers and Indian scouts pursued him, as he fled from one stronghold to another.  Although he won most of the battles, the manpower and resources arrayed against his band became overwhelming.\nVictorio's Achilles heel was that he needed to resupply himself regularly with ammunition and to get it he had to trade stolen cattle and horses or steal it from Americans and Mexicans.  A source of supply for him was the Mescalero Apache Reservation near Fort Stanton, New Mexico, but after the Battle of Hembrillo Basin in April 1880 the U.S. army cracked down hard on the Mescaleros and occupied their reservation.\nIn May 1880, Victorio suffered his first defeat and it was at the hands of his fellow Apaches at the Palomas River in the Black Range of New Mexico near the hamlet of Chloride.  He led his band into Mexico for a respite, collected a large herd of livestock, and appeared in west Texas in July, attempting to drive the livestock to the Mescalero Reservation where he could trade them for ammunition. However, in Texas he faced off against another veteran warrior, Colonel Benjamin Grierson, commander of the 10th Cavalry consisting of African-American soldiers.  Grierson adopted a new strategy to combat Victorio.  Rather than chasing him, as previous army commanders had done, Grierson adopted a defensive strategy, guarding springs, river crossings, and mountain passes. His strategy was to block Victorio's access to New Mexico and supplies of ammunition and prevent him from accessing the widely scattered waterholes in the desert. Plus, Grierson cooperated with Mexican troops who had crossed the Rio Grande River into Texas to join the hunt for Victorio.  Grierson was unable to defeat Victorio in battle, but prevented him from getting to New Mexico and replenishing his supply of ammunition.\nRetreating to Mexico again about August 13, 1880, Victorio's fortunes were in decline, his force reduced by desertions of supporters who found the hardships of the campaign unbearable\nFinding Victorio\nRather than the usual mountain strongholds he sought, Victorio chose to rest and refit on a remote desert plain with a small lake and three rockpiles called the Tres Castillos (Three Castles). He explained to his followers that his enemies would be hunting him in the mountains, rather than scouring the desert.  He sent his lieutenant, Nana, and a few men on a raid to seek ammunition. Victorio and his diminished supporters had a respite of peace in the austere Chihuahua Desert, reaching Tres Castillos in early October.  Meanwhile, Mexican and American military forces scoured northern Mexico for him.\nBy September 29, the commander of Mexican forces in Chihuahua, Col. Joaquin Terrazas, collected a force of 350 men, some soldiers and some volunteers, at Tres Patos Lake,  northwest of Tres Castillos.  On October 1, his force separated into several groups and fanned out across the desert moving eastward. Terrazas found a muddy pond with freshly-butchered livestock nearby which indicated that Victorio and his followers had passed that way. On October 8, one of his Tarahumara scouts reported that Victorio might be in the direction of Tres Castillos,  distant. Terrazas dismissed 90 \"worthless civilians\" from his force and marched south with 260 men. He also declined help from an American force of 13 Texas Rangers commanded by George W. Baylor, and told them to return to the U.S.  On October 13 Terrazas found fresh tracks indicating that Victorio was at Tres Castillos. Ten companies of the 10th Cavalry that entered Mexico in early October operated with the Chihuahua state militia until the discovery of Victorio at Tres Castillos when Col. Terrazas demanded the American troops withdraw back into the United States.\nTres Castillos consists of three low rocky hills rising less than 100 feet above a wide plain.  They are a prominent landmark of the area and in October, the end of the rainy season, the ephemeral lakes and streams nearby contained water and Tres Castillos was an oasis.  Approaching Tres Castillos, Terrazas sent his second in command, a veteran Indian fighter named Juan Mata Ortiz, to circle the Tres Castillos to the north and he himself circled south.\nThe battle, October 14–15\nThe Apaches discovered Terrazas' advance on Tres Castillos when he was still about  distant and sent out 30 warriors to contest his passage.  They killed a Tarahumara scout, but quickly retreated to the rocky hills when they discerned the size of the approaching force. Terrazas and Mata Ortiz captured the Apache's horse herd and forced the Indians to retreat to the southernmost of the Tres Castillos.  About 10 p.m. that night, Terrazas saw a fire to his south and sent a 30-man patrol to investigate. Several Apaches not trapped on Tres Castillos had set the fire to attract the Mexicans away from Tres Castillos, but after a brief skirmish with the Mexican patrol, they fled, presumably escaping the area.\nVictorio and his followers continued to resist the Mexicans all that night, building rock defenses and retreating to caves.  Terrazas described desperate fighting as the Mexicans advanced—but the Apaches probably soon exhausted their ammunition.  The last two warriors held out in a cave for two hours before they were killed at 10:00&nbsp;a.m. A single rifle cartridge has been found in the cave, indicating that they could engage only in a token defense.Three Mexican soldiers were killed in the battle. Terrazas reported that he killed 62 warriors, some of whom were probably boys, and 16 women and children and took 68 prisoners. The surviving women and children were sold into slavery in Mexico. Some Apaches claim that Victorio committed suicide by stabbing himself; other reports claim he was killed by a Tarahumara sharpshooter. The survivors of Victorio's followers were two groups of absent men, Nana with 17 men on a raid and 15 men on a different raid.  A small number of Mescaleros were hunting and thus were not at Tres Castillos and a few women and children managed to escape.\nAftermath\nScholar Dan L. Thrapp called Tres Castillos a \"massacre, rather than a battle\" due to the Apaches' shortage of ammunition. Victorio's followers who were absent and thus survived Tres Castillos, including Nana, quickly took revenge. Nine Mexican soldiers were killed in an ambush.  Nana led the survivors to a refuge in the Sierra Madre Occidental and in 1881 undertook a long and successful raid into the United States.\nThe city of Chihuahua feted Terrazas, Mata Ortiz, and Mauricio Corredor, the Tarahumara who reputably killed Victorio.  The townspeople held a parade to display the captives and the scalps of Victorio and other Apaches. The Apache children were separated from their mothers and distributed as servants to prominent families of Chihuahua.\nThe Mexican second-in-command at Tres Castillos, Juan Mata Ortiz, was killed by Juh in an ambush on November 13, 1882. The Tarahumara sharpshooter, Mauricio Corredor, was killed in 1886 in an altercation between American and Mexican forces which also resulted in the death of the prominent American scout Emmet Crawford.  Colonel Terrazas died in bed in 1901.  A monument in honor of him and his victory at Tres Castillos was erected in Chihuahua City in 1910.\nThe Battle of Tres Castillos ended the era of large-scale conflict between Apache bands and American and Mexican forces. After the death of Victorio \"never again were [Apache] fighters in such numbers to roam and ravage that country, nor were they again to be so ably led and managed.\" Raids and conflicts by Apaches after Victorio were \"brief and simply small affairs compared to the size of Victorio's force and the destruction it caused.\"\nBibliography\n*\n* Kathleen P. Chamberlain, Victorio: Apache Warrior and Chief, University of Oklahoma Press, 2007\n* Kendall D. Gott, In Search of an Elusive Enemy: The Victorio campaign, 1879–1880, Combat Studies Institute Press\n* Spencer Tucker, James R. Arnold, Roberta Wiener (2011), The Encyclopedia of North American Indian Wars, 1607–1890,\n* John Wilson, ''Victorio's War'', Orca Book Publishers, 2012\nReferences"
    }
  ]
}