{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Amba Alagi (1941)\n\n| result            = Allied victory\n| combatant1        =\n*\n| combatant2        =\n*\n| commander1        =  Prince Amedeo, Duke of Aosta\n| commander2        =  Sir Alan Cunningham  William Platt Mosley Mayne\n| strength1         = 7,000 (4,000 Italians and 3,000 colonials)\n| strength2         = 41,000 (regulars & irregulars)\n| casualties1       = 3,500 killed or wounded, all survivors captured\n| casualties2       = Unknown\n| campaignbox       =\n}}\nThe Battle of Amba Alagi was fought in May 1941, during World War II, part of the East African Campaign.\nAfter the Italian defeat at Keren in April 1941, Prince Amedeo, Duke of Aosta withdrew his forces to the mountain stronghold at Amba Alagi. The mountain had galleries carved into the rock to protect the defending troops and hold ample ammunition and stores and the Italian troops thought themselves to be impregnable. According to other sources, however, the fortress was easily defendable thanks to its position and the mountainous terrain, but lacked food and water, so that Marshal Enrico Caviglia later criticised the Duke for having chosen it for his last stand, calling the Amba Alagi \"''uno scoglio senz'acqua e senza viveri''\" (\"a rock with neither water nor food\"). The initial attacks on the approaches to Amba Alagi by British troops under Major-General Mayne from the north, commenced on 4 May with a pincer from the eastern and western sides.\nThere was hard fighting in the jagged mountainous terrain but Mayne's troops were joined on 12 May by Brigadier Dan Pienaar's 1st South African Brigade, which had captured the Italian garrison of Dessie (20 April) located  south of Amba Alagi, and by 14 May Amba Alagi was completely surrounded. A final assault was planned for the next day but a lucky strike by an artillery shell hit an Italian fuel dump, sending a stream of oil into the last remaining Italian drinking water, forcing the garrison to end its resistance.\nThe Italian commander began ceasefire negotiations on 16 May 1941. The Duke of Aosta and his garrison surrendered to the British commander, Lieutenant-General Sir Alan Cunningham, on 19 May 1941. The Duke and the garrison were accorded the honours of war. This capitulation marked the end of any significant Italian control on East Africa, although some garrisons would continue to fight until 1943.\nThe film ''La pattuglia dell'Amba Alagi'', shot in 1953 by Flavio Calzavara, glorifies the Italian defence against the British.\nGallery\nFile:Italian vehicles abandoned in Amba Alagi.jpg|Italian vehicles abandoned on the road to Amba Alagi.\nFile:Seyoum Mengesha addressing his troops.jpg|Seyoum Mengesha speaks to Ethiopian irregulars under his command.\nFile:25-pounder gun in Amba Alagi.jpg|South African 25-pounder gun fires on Amba Alagi.\nFile:SAF-East-Africa-79.jpg|A battery of 4.5-inch howitzers from the South African Army's 4th Field Brigade in action.\nFile:Surrender of the Duke of Aosta.jpg|Prince Amedeo speaks to Mosley Mayne (leftmost) during the surrender.\nSee also\n* List of British military equipment of World War II\n* List of Second Italo-Ethiopian War weapons of Ethiopia-Arbegnoch used Ethiopian and captured Italian weapons.\n* List of Italian Army equipment in World War II\nReferences\nSources\n*\n* Diamond, John. Archibald Wavell. Osprey Pub, 2012.\n* Jaques, Tony. Dictionary of Battles and Sieges. Westport, Conn. Greenwood, 2007\n* Shinn, David Hamilton., Thomas P. Ofcansky, and Chris Prouty. Historical Dictionary of Ethiopia. Lanham, MD: Scarecrow, 2004."
    }
  ]
}