{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Semarang\n\n}}\n| place             = Semarang, Central Java, Indonesia\n| territory         =\n| result            = Ceasefire\n| combatant1        =\n| combatant2        =\n| commander1        =\n| commander2        =  Kido Shinichirō\n| units1             = People's Security Army (TKR)   (POLRI) Youth volunteers (pemuda)\n| units2            =  5th Special Infantry Battalion (Kido Butai), Yagi Butai (battalion of  42nd  Infantry  Regiment, 5th  Division, 2nd  Army), and smaller units\n| strength1         = 7,000\n| strength2         = 441–949\n| casualties1       = 2,000 dead (including civilians)\n| casualties2       = 150 dead61 wounded231 missing\n}}\nThe Battle of Semarang (), in Indonesia also known as Pertempuran Lima Hari (Five Days' Battle) was a clash between Japanese forces of the Sixteenth Army and Indonesian forces consisting of People's Security Agency personnel and pemuda in October 1945 at the city of Semarang, Central Java. The battle is considered as the first major clash involving the Indonesian military.\nWith the Japanese surrender, Indonesian authorities attempted to seize Japanese arms in anticipation for a Dutch return. Tensions rose after the Semarang garrison refused to hand over their weapons, and after an incident sparked a massacre of Japanese civilians, fighting broke out between the Japanese and Indonesian forces.\nBackground\nAfter the August 1945 surrender of Japan in the Pacific War, Allied commander in Southeast Asia Louis Mountbatten following negotiations with a Japanese delegation tasked existing Japanese forces in Southeast Asia to maintain law and order until Allied forces could arrive. By September 1945, many Japanese units in Java had disarmed, surrendering weapons and ammunition to Indonesian nationalists. The city of Semarang in Central Java was also by then largely controlled by Indonesian authorities in form of the Tentara Keamanan Rakyat (TKR) and the pemuda. RAF Wing Commander T.S. Tull arrived in Central Java on 18 September as part of a Recovery Allied Prisoners of War and Internee (RAPWI) delegation and concluded that Japanese cooperation was vital to repatriating Allied prisoners.\nIn early October, the 16th Army issued an order for local commanders to let the Indonesian authorities maintain law and order, with the Japanese garrisons to provide assistance. On the other hand, Indonesian authorities and the pemuda wanted to acquire arms in anticipation of a Dutch return to Java. Following negotiations between the Indonesian pemuda, Wongsonegoro (then governor of Central Java), Major General Nakamura Junji (Commander of Japanese forces in Central Java), and Major Kido Shinichirō (Commander of the Semarang garrison), the Japanese garrison at Semarang handed out around 660-700 rifles and 1,600 between 5 and 7 October 1945.\nDespite having acquired a number of weapons, the Indonesians pressed the Japanese again on the 12th of October for more weapons, but this time the negotiations dragged on, and in the end, Major Kido asserted that the Japanese forces would not transfer further weapons to the Indonesian authorities. This refusal was then followed by Japanese plans to seize Semarang and the Indonesian ''pemuda's'' attempts to imprison Dutch and Japanese civilians.\nPrison massacre\nAccording to Indonesian accounts, on 14 October, Kido's men disarmed Indonesian guards of a water reservoir. Later that day, an Indonesian doctor named Kariadi was shot and killed while he was heading to the reservoir to check the water for any poison. Near the location, over 300 Japanese civilians who had been relocated from Kendal were temporarily stationed at Bulu prison. The Indonesian Special Police tried to lead the group away around 10:30 PM that day, but the group offered resistance with melee weapons and some small arms smuggled in by Kido's men. The group was slaughtered, with only a handful managing to escape.\nFighting\nPrior to learning about the massacre, Kido ordered his men to launch an offensive against Indonesian forces at around 2&nbsp;a.m. on 15 October, though gunshots had been heard in the city the night before. In another account, Kido only ordered an offensive after Indonesians burned an ammunition depot at around 3&nbsp;a.m. For the ordered offensive, Kido divided his forces into two groups, comprising 383 and 94 men respectively. By 3&nbsp;p.m. that day, Kido had mobilized all Japanese around the area under his command.\nThe BKR sent reinforcements to the city from various locations across Central Java. Japanese forces captured the Bulu prison around 4:30&nbsp;p.m. on 16 October and discovered the remnants of the slaughter. Afterwards, accounts noted that Kido's men began \"fighting mad\", taking no prisoners and conducting large-scale executions of captives. Some accounts also noted that the executions had started prior to the capture of the prison.\nOn 19 October, soldiers from the British 10th Gurkha Rifles landed in Semarang. After a brief shootout with the Japanese forces who mistook them for Indonesian reinforcements (killing two Gurkhas and four Japanese), Japanese soldiers handed control of the city to the Gurkhas. Japanese soldiers proceeded to assist Allied forces in Magelang and Ambarawa afterwards.\nAftermath\nJapanese historian Kenʼichi Gotō wrote that around two thousand Indonesians in Semarang were killed due to the incident, while on the other hand Dutch historian P. M. H. Groen suggested that less than 300 were killed. Eyewitness accounts suggested that some streets in Semarang were \"littered with corpses\" and in one locale a ditch was blocked by corpses. Japanese historian Kenʼichi Gotō wrote that 187 were killed in fighting, while Kido reported forty-two soldiers killed, forty-three wounded and 213 missing, not including those massacred at Bulu which consisted of 108 killed, 18 wounded and 18 missing.\nIndonesian army general Abdul Haris Nasution wrote in 1977 that the battle was \"the first major battle of the Indonesian nation\". British accounts of the events generally praised Kido's actions, with Tull writing that \"the Japanese [...] protected the internment camps from molestation and released numerous Dutch and Eurasian captives\". Hubertus van Mook remarked that the Japanese actions caused the European POWs, who had been mistreated in the prisoner camps for years, to change their attitudes towards the Japanese to that of gratitude.\nIn 1953, Tugu Muda in Semarang, which commemorated the battle, was inaugurated by Sukarno.\nNotes\nReferences\nBibliography\n:\n:\n:\n:\n:\n:\n:"
    }
  ]
}