{
  "content": [
    {
      "type": "text",
      "text": "# Battleaxe (band)\n\n}}\nBattleaxe are  an English heavy metal band from Sunderland. As one of the bands of the new wave of British heavy metal scene, they started out with the name Warrior and morphed into Battleaxe  in early 1981. The band consisted of Dave King (vocals), Brian Smith (bass), Steve Hardy (guitar), and Ian Thompson (drums). After playing around the area and honing their craft, they entered the recording studio to make a demo called \"Burn This Town\". In doing so, they garnered the attention of Roadrunner Records, and the result was their first album, Burn This Town.\nCover art controversy\nOnce a release deal had been struck with Roadrunner Records, the master tapes were forwarded to the record production and the album title Burn this Town was created. The company requested some concept ideas for the cover artwork, so the band asked a friend and local artist Arthur Ball if he could come up with suggestions. He then produced the first Burn this Town cover artwork as it is known now, however only as a rough proof drawing. Arthur planned to re-draw the whole thing again to a much higher standard once it was to be approved by the record company. However, when Roadrunner received the proof artwork for approval, they went ahead and pressed 2000 units for a worldwide release without the band's consent. The graphic looked amateurish, and the band worried what this might do to their reputation. However, the album sold well. The band began developing a reputation in the region as a solid heavy metal outfit.\nChanging of \"Ians\"\nA short time after finishing the recordings of the album Burn This Town at Guardian studios County Durham, Ian Thompson was badly injured with a skull fracture when attacked by someone with an iron bar. Thompson's injuries were extensive and required a long time to heal. During this time, the band's momentum was still growing as they were signed by Roadrunner Records and contracted to complete a second album by the end of the year. Ian McCormack, Satan's ex-drummer, was asked to fill the drum position until Thomson had recovered. However, when Power from the Universe was released on both the Roadrunner and Music for Nations labels, the band suddenly found themselves garnering unexpected fame. Listeners stated that this album showed a more refined and mature sound, and the album was voted as having one of the best heavy metal openers of the time with the song \"Chopper Attack\".  Battleaxe continued on with the same lineup to complete a BBC Radio One Session on the Tommy Vance Friday Rock show. They were included in a nationwide tour supporting Saxon, and invited to a Leeds Queens Hall Festival with Twisted Sister, Girlschool, Anvil, Spyder and Plus.\nPersonnel changes\nOn the eve of a major appearance at Hammersmith Odeon London in support of Saxon on their Crusader tour, some A&R staff from Atlantic Records were showing interest. After the show, they wanted the band to organize a showcase for them. However, Steve Hardy unexpectedly quit, and they had to pull out of what could have been a major signing. It took almost two years before a new lineup was found that was somewhere near the quality and spirit to what they had. This was a severe blow to their career and put the band on hold until they could regain their footing. They toured the UK in support of Madam X, who had to pull out of the tour due to an illness, leaving Battleaxe to headline. They finished the tour at the Dominion Theatre in London.\nThe new lineup included Mick Percy and John Stormont. Their lead and rhythm guitar combination gave band's performances a fuller sound live as well as in the studio. Soon after, they went into Neat Records studio to record the tracks \"Radio Thunder,\" \"Girl Crazee,\" and \"Killer Woman.\" These tracks were added to their 1987 EP, Nightmare Zone. John Stormont contributed a lead break performance on the track \"Killer Woman.\" John left the band and there was a rotating door of musicians until 1987 when they recruited Jason Holt on guitar and Stew Curtan on drums (after Ian McCormack retired). During this period of instability, the band met drummer Paul AT Kinson from Newcastle, who filled in now and then but didn't officially join the band until a later date. With this lineup, their sound had strengthened, becoming more powerful and adding versatility that was not possible with one guitarist. However, this new lineup lasted only a short time as it became hard for Battleaxe to tour. Metallica, who had recently appearing on the metal scene, wanted to tour the UK and Europe with Battleaxe but changed their minds because of politics. However, Battleaxe was added to a compilation album with Metallica, Manowar, and other major bands. From 1995-1998, the band hired another guitarist for a short while and did a one-off show to a small audience at Klenal Hall Biker's Festival. Plans were made to record a third album, and they went into the studio to record the demos that would become the Nightmare Zone EP. The third album was originally going to be called Metal Edge, but they were not able to secure interest from a record label, and the band began to lose interest. Due to financial limitations, touring and performing live gigs simultaneously was impossible. In 2007 the four piece, Mick Percy (guitar), Paul AT Kinson (ex Jess Cox/Skyclad/Bob Dee-USA) and the two founding members, Brian Smith (bass), and Dave King (vocal) (not the Fastway vocalist Dave King) shot a video to the track Chopper Attack. The video appeared to relaunch the band onto the reemerging new wave of British heavy metal scene.\nLater developments\nIn 2008, some Swedish fans set up a website dedicated to Battleaxe, which caught the attention of a new generation of fans. In 2010, the band returned to the metal scene, performing their first live show in Europe at Headbangers Open Air.\nIn 2011 and 2012 the band played Hard Rock Hell (UK), Hammerfest (UK) and Heavy Metal Night (Italy).\nDave King and Brian Smith rejected an album deal with Limb Music (Germany).\nDave King and Brian Smith signed a four-album (re-release/new album) deal with SPV Steamhammer in 2013. For unknown reasons, drummer Paul AT Kinson and guitarist Mick Percy were written out of the contract.\nThey re-released the first two albums, Burn This Town and Power From The Universe, on the band's thirtieth anniversary along with the third release of their newest album Heavy Metal Sanctuary. In 2020, SPV Steamhammer re-released Power from the Universe.\nThe first three albums received mixed reviews from around the world and a prominent rock journalist reviewed the re-release of Power From The Universe.\n2014 saw the departure of drummer Paul AT Kinson following the Keep It True Festival (Germany). Kinson had worked with the band on various demos and small shows since the early 1990s. He also helped to relaunch the band along with Dave King between 2007 and 2014, and was the producer of two official videos for the band during that period, as well as the main producer and co-writer the 2014 album Heavy Metal Sanctuary.\nRicky Squires (ex Heavy Metal Kids etc.) joined Battleaxe, replacing Kinson on drums, in May 2014, prior to their debut show at Bloodstock Open Air Festival. However, the distance between Squires (living in Ayrshire) and the band in Newcastle upon Tyne, made it difficult to continue.\nBattleaxe is using stand-in session drummer Steve Rix who played regularly with the late Chris Tsangarides (the band had planned to use Tsangarides to produce their new album in 2017/2018).\nGary Young (Avenger) stood in on drums for Battleaxe at metal festival BroFest (UK).\nAs of 2022, the band is working on a new album at White Wolf Recording Studios in County Durham. They hope to go back on tour in the future.\nMembers For Burn This Town\n* Dave King&nbsp;— vocals\n* Brian Smith&nbsp;— bass\n* Steve Hardy&nbsp;— guitar\n* Ian Thompson&nbsp;— drums\nMembers For Power from the Universe\n* Dave King&nbsp;— vocals\n* Brian Smith&nbsp;— bass\n* Steve Hardy&nbsp;— guitar\n* Ian McCormack&nbsp;— drums\nPost Universe Lineup 1\n* Dave King&nbsp;— vocals\n* Brian Smith&nbsp;— bass\n* Ian McCormick&nbsp;— drums\n* John Stormont&nbsp;— guitar\n* Mick Percy&nbsp;— guitar\nPost Universe Lineup 2\n* Dave King&nbsp;— vocals\n* Brian Smith&nbsp;— bass\n* Mick Percy&nbsp;— guitar\n* Jason Holt&nbsp;— guitar\n* Stewart Curtan&nbsp;— drums\nNightmare Zone Lineup\n* Dave King&nbsp;— vocals\n* Brian Smith&nbsp;— bass\n* Mick Percy&nbsp;— guitar\n* John Stormont&nbsp;— guitar\n* Ian McCormack&nbsp;— drums\nHeavy Metal Sanctuary: Line Up\n*Dave King – vocals\n*Mick Percy – guitar\n*Brian Smith – bass\n*Paul Kinson – drums\nLineup\n2007 – 2014\n* Dave King&nbsp;— vocals\n* Brian Smith&nbsp;— bass\n* Mick Percy&nbsp;— guitar\n* Paul AT Kinson – drums\n2014 – Present\n*Dave King&nbsp;— vocals\n* Brian Smith&nbsp;— bass\n* Mick Percy&nbsp;— guitar\n*Ricky Squires / Steve Rix – drums\nDiscography\n* \"Burn This Town\" - Single&nbsp;— Burn This Town/Battleaxe (1981)\n* Burn This Town - Album (Original Sleeve) (1983)\n* Burn This Town - Album (Redesigned Sleeve) (1984)\n* Power from the Universe - Album (1984)\n* Burn This Town - CD Reissue (2005)\n* Power from the Universe - CD Reissue (2005)\n* Nightmare Zone - EP CD (Recorded 1987) (2005)\n* Heavy Metal Sanctuary - Album (2014)\nDiscography compilations\n* Roxcalibur - Burn This Town & Battleaxe (1982)\n* Hell on Earth - Ready to Deliver (1983)\n* Metal Battle - Ready to Deliver (1983)\n* Metal Hammer Sampler - Running out of time (1984)\n* Welcome to the Metal Zone - Chopper Attack (1985)\nSee also\n* List of new wave of British heavy metal bands\nReferences\nExternal links\n*\n*"
    }
  ]
}