{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Najafgarh__disambig_1\n\nwest of Delhi, India\n| result            = British victory\n| combatant1        =  East India Company\n| combatant2        =  Mughal Empire\n| commander1        =  John Nicholson\n| commander2        =  Bakht Khan\n| strength1         = 2,50016 guns\n| strength2         = Approx. 6,00013 guns\n| casualties1       = 25 killed70 wounded\n| casualties2       = Approx. 800 killed13 guns captured|\n}}\nThe Battle of Najafgarh was a subsidiary engagement of the Siege of Delhi during the Indian Rebellion of 1857. A large Indian force sortied from Delhi, intending to attack the rear of the British force besieging the city. A detachment from the besiegers marched to intercept them, and defeated them while they were disordered by difficult terrain and by quarrels among their commanders.\nSiege of Delhi\nDuring the earliest days of the Rebellion, sepoys (Indian soldiers) of the British East India Company's Bengal Army stationed at Meerut rose in revolt against their British officers, and marched to Delhi. When they arrived there, they were joined by mobs from the city and sepoys from regiments stationed near Delhi. They captured the city on 11 May 1857, killing British officers and civilians. They proclaimed themselves to be at the disposal of the Mughal Emperor, Bahadur Shah II, who reluctantly gave his support to the rebellion. News of the restoration of the Empire's authority induced many other regiments of sepoys, and other irregular bodies, to rebel and to march to Delhi.\nA small British force advanced on Delhi and occupied a ridge outside the city, where they awaited reinforcements before they could consider storming the city. Sepoys and other forces repeatedly attacked the ridge but were defeated and driven back into Delhi. There was no coordinated leadership among the Indians at first; each sepoy regiment refused to accept orders from the officers of other regiments, and although Bahadur Shah appointed his son Mirza Mughal as Commander in Chief of his armies, Mirza Mughul had no military experience and was ignored by most of the sepoys.\nOn 1 July, the sepoy regiments which had rebelled at Bareilly arrived in Delhi, together with 4,000 Muslim ghazis. They were led by Bakht Khan, a veteran artillery officer of the East India Company. Pleased with the numbers of troops (and treasure) he had brought, Bahadur Shah appointed him Commander of his armies. However, the officers of other sepoy regiments were jealous of his authority. Under Bakht Khan's direction, a major attack was launched on the British positions on 9 July, but was driven back after coming close to success. By the end of the month, after further attacks had failed, Bakht Khan's critics induced Bahadur Shah to place a committee of ten men headed by Mirza Mughal at the head of the army.\nIndian movements\nBy mid-August, the last substantial reinforcements of sepoys had reached Delhi, but large numbers of sepoys had become discouraged by successive failures, quarrels among their commanders and shortage of supplies, and were deserting. Bakht Khan belatedly suggested attacking the rear of the British position. A large detachment would leave the city and head west, as if making for Jaipur, but instead double back to cross the Jumna Canal, which protected the British rear, at a bridge at Najafgarh. The force left Delhi on 24 August, in heavy rain. It consisted of the sepoy regiments which had moved to Delhi from Bareilly, Nasirabad and Nimach, and numbered about 8,000 in total, with 13 guns.\nThey reached the Jumna Canal late that day, but found that the bridge at Palam which they intended to use had been destroyed earlier by the British. They had anticipated this, but it took them 24 hours to repair the bridge properly, during which the troops were drenched by rain and had no food, as supplies in Delhi were very short. On 25 August, the Nimach brigade of sepoys led the advance, skirting the edge of the Najafgarh jhil (swamp).\nBritish moves\nBakht Khan's attack had been launched at least ten days too late. On 14 August, the British had been reinforced by the Punjab Moveable Column, numbering 4,200 and consisting of British, Sikh and Punjabi units. Its commander was Brigadier John Nicholson, who was well known as a forceful and uncompromising soldier, in contrast to the nervous and infirm commander of the troops on Delhi Ridge, Major General Archdale Wilson.\nOn 24 August, Bakht Khan's force was seen departing Delhi and moving west. Nicholson was detached to intercept them. He set out early on 25 August. Sir Theophilus Metcalfe, who had narrowly escaped from the city on 11 May, accompanied him as a guide. In spite of the heavy rain and floods, Nicholson drove his men to make a rapid march.\nBy 4.00 pm, Metcalfe had discovered the position of the Nimach troops. Their main body, with four guns, occupied a caravanserai, behind a stream. Nine more guns were posted between the serai and the bridge at Palam. Most of the exhausted Indian troops were pitching camp, and had piled their arms and equipment.\nBattle\nThe Indians' guns covered the bridge over the stream, but Nicholson's troops crossed by a ford upstream, and formed up in two lines while the British artillery shelled the serai. Nicholson sounded the advance, and himself led the 61st Foot and 1st Bengal Fusiliers as they charged across  of mud to storm the serai. On their right, the 2nd Punjab Infantry (Greene's Rifles) attacked the village of Najafgarh itself.\nAs they tried to retreat, the Nimach troops suffered heavy casualties from artillery fire as they tried to cross or skirt the Najafgarh swamp. The survivors were rescued by the Nasirabad brigade, which advanced on the British right. The Punjab infantry lost their commanding officer and were held up until the 61st went to their aid. However, Bakht Khan did not move his own Bareilly brigade forward, instead retiring to Delhi once the routed Nimach soldiers retreated through his position.\nThe British had captured all Bakht Khan's guns, and inflicted heavy casualties. Nevertheless, Nicholson had not been aware of the presence of the Bareilly brigade at Palam, and was disappointed not to have been able to attack them the next day. He complained to his friend John Lawrence, the Commissioner for the Punjab, \"...I had no information, not even a guide I did not pick up for myself on the road\".\nResults and aftermath\nThe British rejoiced at their first definite success against a rebel force in the field for over two months. On the Indian side, the sepoys became increasingly disillusioned. Their defeat had been caused largely by poor administration, which left the troops hungry and exposed to the monsoon rains, and quarrels among their commanders. Only three days before the battle, the commanders of the Nimach troops (General Sudhari Singh and Brigade Major Hira Singh) had attempted to depose Bakht Khan from his command, and Bakht Khan's refusal to move to their aid when they came under attack caused further dissensions.\nNotes\nReferences\n*\n*"
    }
  ]
}