{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Darak\n\nCameroon\n| combatant2        =  Boko Haram - Shekau faction\n| strength1         = Unknown\n| strength2         = 300\n| casualties1       = 17–21 killed8 injured\n| casualties2       = 64 killed (per Cameroon and MNJTF)8 captured16 arrested\n| casualties3       = 8–16+ civilians killed1 civilian injured\n}}\nThe Battle of Darak, also called the Darak massacre, occurred on June 9, 2019, when Boko Haram fighters loyal to Abubakar Shekau attacked a Cameroonian and MNJTF military base in Darak, Far North Region. The attack was the deadliest in Cameroonian history since the start of the Boko Haram insurgency.\nBackground\nCameroon's Far North region has seen a spate of attacks by Boko Haram, a Nigerian jihadist organization based around Lake Chad, since the group's emergence in the early 2010s. In Darak, six soldiers and seventeen civilians were killed in an attack by Boko Haram on the village in 2016.\nBattle\nAccording to Cameroonian security sources, the attack began when over three hundred Boko Haram fighters attacked Darak around 3:45am. The jihadists arrived via boats, attacking an outpost of soldiers from Sector 1 of the Multinational Joint Task Force and a Cameroonian brigade. The fighting lasted for several hours, and MNJTF fighters shot at least three jihadist boats. The jihadists were able to capture the city, and held it until 2pm on June 10. Residents of Darak holed up in their homes while Boko Haram was in control of the city. While fleeing, Boko Haram fighters flew their black flag and claimed the city still belonged to them.\nAftermath\nThe initial death toll of the attack was nineteen soldiers killed, and eleven civilians, according to a Cameroonian source speaking to Xinhua. This later increased to a total of thirty-seven killed, including twenty-one soldiers and sixteen civilians. By June 21, this number was revised to seventeen soldiers killed. The Cameroonian government later stated that sixteen soldiers were killed and eight were injured, and eight civilians were killed as well. The Cameroonian government also claimed the deaths of sixty-four Boko Haram fighters. Eight fighters were captured as well. Later, Cameroonian officials said 16 suspects were arrested.\nA statement from the MNJTF stated that 10 Cameroonian soldiers were killed and eight were injured, eight civilians were killed and one was injured, and at least eight jihadists captured and an unknown number of injured. VOA Africa reported that the Cameroonian government and MNJTF officially reported the deaths of seventeen soldiers and eight civilians, while local sources claimed twenty-one soldiers and sixteen civilians were killed.\nOn June 21, the Cameroonian government ordered all flags at half-mast out of respect for the soldiers who died in Darak. The head of state, Paul Biya, the head of the Cameroonian armed forces, and other top leaders all sent condolences to the families of the slain soldiers.\nReferences"
    }
  ]
}