{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Mahoetahi\n\n| place       = Mahoetahi, Taranaki, New Zealand\n| coordinates =\n| map_type    =\n| map_relief  =\n| map_size    =\n| map_marksize =\n| map_caption =\n| map_label   =\n| territory   =\n| result      = British victory\n| status      =\n| combatants_header =\n| combatant1  =\n*\n*  New Zealand\n| combatant2  =  Kingitanga\n* Ngāti Hauā\n| combatant3  =\n| commander1  =  Thomas Pratt Thomas Mould\n| commander2  = Te Wetini Taiporutu\n| commander3  =\n| units1      =\n| units2      =\n| units3      =\n| strength1   = 9913 24-pounder howitzers\n| strength2   = Approximately 150\n| strength3   =\n| casualties1 = 4 killed17 wounded\n| casualties2 = At least 52 killed or died of woundsUnknown wounded3 captured\n| casualties3 =\n| notes       =\n| campaignbox =\n}}\nThe Battle of Mahoetahi was fought as part of the First Taranaki War. In November 1860 a small force of around 150 Ngāti Hauā warriors travelled to Taranaki from the Waikato and challenged the British to battle at Mahoetahi, near New Plymouth. The British replied with a much larger force of British Army regulars and New Zealand colonial units and effectively encircled and defeated the Ngāti Hauā force.\nBackground\nIn March 1860 war had broken out in Taranaki between the European settlers and local Maori over land ownership. In November Te Wetini Taiporutu, a chief of Ngāti Hauā and a passionate supporter of the Maori King Movement, lead a warband of some 150 warriors from the Waikato to \"kill soldiers\" in Taranaki.\nTe Wetini's force crossed the Waitara river and established themselves at Mahoetahi on 5 November 1860. Mahoetahi was located along Devon Road, the primary land communication line between the European settlements at New Plymouth and Waitara. It consisted of a small volcanic mound or hill surrounded by raupō swamp. The site had historically been used as a settlement or pā by Te Āti Awa soon after their migration to Taranaki in the early 19th century, but by 1860 little remained other than a few eroded terraces and embankments.\nBy coincidence, plans had been made for the New Plymouth and Waitara garrisons to erect a stockade at Mahoetahi on 6 November. In preparation, a preliminary party from Waiatara had gone out to Mahoetahi on the 5th in order to repair the roadway and bridge around the swamp. The British encountered Te Wetini Force and a small skirmish broke out resulting in one man of the 65th Regiment being mortally wounded. The outnumbered British retreated to Waitara and sent word of Te Wetini's occupation of Mahoetahi to New Plymouth.\nAt the same time Te Wetini, desperate for a battle sent a letter to the assistant native secretary in New Plymouth, Robert Parris, calling for the British to meet them in battle.\nMajor General Thomas Pratt, commander of the British troops in Australasia and at this time directing the British war effort in Taranaki, received the news of the Maori force and was quick to dispatch orders to meet them in battle with overwhelming force. Pratt assembled two columns, one from New Plymouth which he would personally lead north east to Mahoetahi, while Colonel Thomas Mould would lead a smaller column from Waitara south-west and block the Maori line of retreat. The British forces were organised as follows:\nNew Plymouth Column – Major General Pratt (684 all ranks)\n*12th Regiment (3 officers and 84 men)\n*40th Regiment (6 officers and 168 men)\n*65th Regiment (5 officers and 218 men)\n*Taranaki Volunteer Rifles (7 officers and 90 men)\n*Taranaki Militia (30 men)\n*Taranaki Mounted Volunteers (1 officer and 20 men)\n*Royal Artillery (1 officer, 13 men and 2 24-pounder howitzers)\n*Royal Engineers (1 officer and 10 men)\nThe New Plymouth Column was also accompanied by a contingent of around 100 \"friendly\" Maori, although they did not take part in the battle.\nWaitara Column – Colonel Mould (307 all ranks)\n*40th Regiment (6 officers and 157 men)\n*65th Regiment (2 officers and 102 men)\n*Naval Brigade (1 officer and 22 men)\n*Royal Artillery (1 officer, 11 men and 1 24-pounder howitzer)\n*Royal Engineers (1 officer and 3 men)\nThe exact strength and disposition of Te Wetini's force is unknown, but many sources settle on around 150 warriors. Although the force is generally attributed to Ngāti Hauā, bodies recovered after the battle were identified as coming from a large number of different Waikato tribes.\nBattle\nThe two British Columns formed up early in the morning of 6 November and left their respective garrisons at times such that they would converge on Mahoetahi at 8:30 in the morning. Pratt's column arrived at Mahoetahi first and found the hill apparently undefended and with no evidence of new palisades or earth works. The attack would continue regardless as it was possible the Maori were hidden amongst the fern in the swamp at the base of the hill, rather than behind palisades, as had occurred at Puketakauere earlier that year. At the last minute, Captain Harry Atkinson approached General Pratt and requested that the volunteers be given the honour of leading the assault. The general obliged and replaced the left most company of the 65th Regiment, who were originally to lead the assault, with the volunteers and militia.\nUnlike most other engagements the attack was not preceded by an artillery bombardment. The 65th, volunteers and militia advanced towards the pa and only once the reached the bushes at the base of the hill did the Maori expose themselves and fire upon the British. One of the 65th were wounded and the British returned fire, but the Maori retreated through the scrub and preprepared crawl tunnels. The attackers paused briefly while the 24-pounder howitzers opened fire on the Pa, throwing up dirt, but not causing any material damage. Pratt had joined the men at the front of the assault and when he received news that the Waitara Column was in sight gave the order to halt the bombardment and continue the attack.\nThe British charged up the hill reaching the crest to find Te Wetini's force dug in on the opposite side of the crest. Both sides opened fire at close range inflicting casualties on one another, but the attackers continued onward into hand-to-hand combat with the Ngati Haua defenders. The Volunteers and Militia on the left flank swung right as they continued down the hill, while the Waitara force had also arrived from the east and were immediately being sent into action. The Maori were forced into a retreat through the swamp to the south. A single 24-pounder shell was fired by the Waiatara force into the swamp, but proved ineffective due to the deep mud. The 12th and 40th regiments extended the line to the right of the 65th, and Te Wetini's force was in risk of being encircled, but many managed to escape to the south due to a number of factors. While the volunteers swung to the right and continued into the swamp, the men of the 65th crowded on the hill and did not execute a right hook to complete the encirclement. The volunteers were also under the false impression that the \"friendly\" Maori had been placed on the far right of their line. As they were unable to distinguish between friendly or hostile Maori they held their fire. Even despite this miscommunication, the British forces were unable to fire their weapons as the encirclement of the Maori by the New Plymouth and Waitara columns meant a high risk of friendly fire.\nAfter the dead and wounded had been accounted for, Pratt led a party in search of the remainder of Te Wetini's force, but was unsuccessful in pursuit. Colonel Mould and 300 men remained at Mahoetahi to occupy the position and complete a stockade, while the rest of the force returned to New Plymouth in the evening.\nAftermath\nTotal British casualties during the battle were 4 killed and 17 wounded. The bulk of the casualties were suffered during the bayonet charge, with the 65th Regiment suffering 2 killed and 11 wounded, while the Taranaki Volunteer Rifles suffered 2 killed and 4 wounded. A single staff officer and one man from the 40th Regiment were also wounded.\nFollowing the battle the majority of the Maori dead were collected and buried in a mass grave at the site of the battle. The British captured 7 Maori prisoners, 6 of whom were wounded. One of the wounded prisoners soon died at the site of the battle, while a further 3 died during or soon after the return to New Plymouth. The unwounded prisoner was able to identify and name many of the dead, which included Te Wetini and two lesser chiefs. The bodies of the three chiefs, as well as the three Maori prisoners who subsequently died of their wounds, were buried in St Mary's Churchyard. In total some 52 Maori dead were accounted for by the British, although the number of dead or wounded Maori who were carried off by their comrades is unknown. General Pratt estimated that total Maori casualties were likely between 80 and 100 killed and wounded.\nThe battle was lauded as a great victory by colonial newspapers. General Pratt, however, feared that he may have over-stepped and the high casualties among the Ngati Haua may only lead to further escalation of the war in Taranaki and its spread across New Zealand. Growing fears of an attack against Auckland by Waikato Maori led to 400 British soldiers being withdrawn from Taranaki on 10 November. In contrast news of the death of Te Wetini had a sobering effect on Te Ati Awa and their Waiakto allies. The direct attack at Mahoetahi meant that the British could not be relied on to spend time shelling a pa during which the defenders could make an escape. The good treatment by the British towards the prisoners taken during the battle also had the effect of mellowing the temper of the Waikato Maori. British soldiers and colonists were now more likely to be taken prisoner rather than killed on the spot.\nMemorials\nA wooden cross was erected at the mass grave at Mahoetahi in 1911 and replaced by a more permanent stone cross in 1941.  A granite memorial was also erected in St Mary's Churchyard in 1930.\nReferences"
    }
  ]
}