{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Gamenario__disambig_1\n\n*Partition of Piedmont|\ncombatant1=Kingdom of Naples and Angevin lands|\ncombatant2=March of Montferrat(Ghibellines)Asti Pavia\n|commander1=Reforce d'AgoultJean de Cimiers||\ncommander2=John II of MontferratOtto of Brunswick|\nstrength1=|\nstrength2=|\ncasualties1=|\ncasualties2=|\n}}\nThe Battle of Gamenario, fought on 22 April 1345, was a decisive battle of the wars between the Guelphs (represented by the Angevins) and Ghibellines (Lombard communes). It took place in north-west Italy in what is now part of the commune of Santena about 15&nbsp;km southeast of Turin.\nIn the spring of 1344 Queen Joan I of Naples sent royal seneschal Reforce (Reforza or Rinforzato) d'Agoult to northern Italy in hopes of putting an end to the war with John II, Marquess of Montferrat. The latter had subjugated Mondovì, Cherasco, and Savigliano, ousted the Falletti from Alba, and later moved against Chieri, a stronghold of the Angevine possessions in Piedmont.\nReforza conquered Verzuolo May 1344. In the following year he took Alba and besieged Gamenario, a castle in the neighbourhood of Santena. Lombard Ghibellines formed an anti-Angevin alliance, choosing John II as their leader. On 22 April, he confronted Reforza d'Agoult and battle was joined. The meeting was brief and bloody. Initially uncertain, the outcome was a victory for the Ghibellines, who recovered the besieged fortress and dealt a severe blow to Angevin influence in Piedmont. To celebrate his victory, John built a new church in Asti in honour of Saint George, near whose feast day the battle was won.\nIn the aftermath, Piedmont was partitioned between the victors. John received Alba, Acqui Terme, Ivrea, and Valenza. Luchino Visconti received Alessandria and the House of Savoy (related to the Palaiologos of Montferrat) received Chieri. The Angevins lost almost complete control of the region and many formerly French cities declared themselves independent.\nThe defeat of the Angevins was also a defeat for Angevin-supported Manfred V of Saluzzo and the civil war in that margraviate was ended at Gamenario.\nReferences\nSources\n*[https://web.archive.org/web/20070926221447/http://www.ilmonferrato.info/storia/storia2.htm Storia del Monferrato.]\n*Giuseppe Cerrato: \"In Atti della Società ligure di storia patria\" &mdash; S. 2, vol. 17 (1885), p.&nbsp;382&ndash;542\n*Studi Piemontesi: VII (1978), 2, pp.&nbsp;341–51"
    }
  ]
}