{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Mokra (1445)\n\n}}\n| image             =\n| caption           =\n| partof            = the Albanian–Ottoman Wars (1432–1479)\n| date              = October 10, 1445\n| place             = Mokra (today in Makedonski Brod, North Macedonia)\n| result            = Albanian victory\n| combatant1        = League of Lezhë\n| combatant2        = Ottoman Empire\n| commander1        = Skanderbeg\n| commander2        = Firuz Pasha\n| strength1         = 3,500 men (2,000 cavalry, 1,500 infantry)\n| strength2         = 9,000–15,000 men\n| casualties1       = Unknown\n| casualties2       = 1,500 dead1,000 captured\n}}\nThe First Battle of Mokra () took place on October 10, 1445, near mountain Mokra (today in Makedonski Brod, North Macedonia). It was an Ottoman retaliation to a message sent by Skanderbeg to Murad II. The Albanian forces under Skanderbeg defeated the Ottoman forces under Firuz Pasha. It was the second major Albanian victory over the Ottoman Empire.\nBackground\nAfter his victory at Varna, Murad II attempted to establish peace with Skanderbeg. Murad sent a message to Skanderbeg in which he reminded him of how he had taken the Albanian as his son and raised him in his court and tried to intimidate him by reminding him of the size and power of the Ottoman army. Skanderbeg received the letter and decided to respond. Skanderbeg reminded Murad how he had broken the Ottoman army at Torvioll and that with \"the true faith of Jesus Christ, [he was] sure that [he] had chosen the greatest side.\" When the Turkish ambassador left to send the message to Murad, Skanderbeg told his men to prepare for an incursion.\nBattle\nWhen the sultan had received the message, he gave command to Firuz Pasha a force of about 9,000 men. His task was to control Skanderbeg's movements and prevent him from moving into Macedonia. Firuz set out from Skopje planning to move quickly into Krujë and surprising the Albanians. A large number of soldiers advanced thinking that they were going to battle with Hunyadi, who was regathering his army. Firuz had heard that the Albanian army had disbanded for the time being, so he planned to move quickly around the Black Drin valley and through Prizren. These movements were picked up by Skanderbeg's scouts who moved to meet Firuz. Kastrioti awaited the Turkish army at a valley near Prizren, and only brought along his personal guard of 3,500 men, composed of 2,000 cavalry and 1,500 infantry, while sending the rest of his troops home. The Albanian troops were commanded to move into forest of Mokra inside of a thin valley of which they knew the terrain. The Turks entered the valley and could not find an easy way out since the Albanians had blocked most of the main trails. The Ottoman cavalry were allowed limited movement due to the woods and were assaulted by the Albanian infantry. The Ottoman force routed leaving behind 1,500 dead and 1,000 wounded men or stragglers that were imprisoned by the Albanians. Firuz Pasha died in the battle.\nAftermath\nThe Europeans were reassured by the battle of Mokra after the loss at Varna. Pope Eugene IV raised a hymn as a praise that Christendom has been provided with a new defender after he heard of the battle. Alfonso V of Aragon sent many praises to Skanderbeg along with the papacy to Durazzo. The papal ambassadors arrived at Krujë sending the news that a new bishop, Peter Perlati, had been appointed. Skanderbeg sent four Ottoman standards that he had captured to Alphonso to prove his victories. Skanderbeg and Alphonso became close allies while also establishing connections with other European states.\nReferences\nSources\n*"
    }
  ]
}