{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Tsarichanka (1709)\n\n| result            = Cossack victory\n| combatant1        =  Zaporozhian Sich\n| combatant2        =  Tsardom of Russia\n| commander1        =  Kost Hordiyenko\n| commander2        =  Brigadier Kampell\n| strength1         = 800 men\n| strength2         = 3,000 men\n| casualties1       = 30 killed\n| casualties2       = 100 killed90–100 captured\n| units1            = Unknown\n| units2            = 3 dragoon regiments\n}}\nThe Battle of Tsarichanka was a battle that took place in March 1709 between the Zaporozhian Cossacks led by Kost Hordiyenko and the 3,000-strong Russian unit of brigadier Kampell, during the Swedish campaign in Ukraine as a part of Great Northern War. The Cossacks of Hordiyenko inflicted a defeat on Kampell's unit and forced it to withdraw.\nBattle\nKnowing about Hordiyenko defecting to the Swedish side, the Russian commandership sent three units with goal of stopping him from joining the Swedish army. This forced Hordiyenko to start military actions - as soon as his Cossacks crossed the borders of Zaporozhian Sich, they started attacking the Russian units and outposts. On 6 of April, a unit of 800 Cossacks led by Kost Hordiyenko approached Tsarichanka, where a Russian unit of brigadier Kampell, with 3,000 men, was stationed. The Cossacks attacked it and a battle took place, as a result of which, the Russians had lost 100 men killed and 90 or 100 men captured, and retreated from Tsarichanka, allowing Cossacks to capture the settlement. The Cossack forces lost 30 people.\nAftermath\nFollowing the battle, Hordiyenko captured several cities on the Vorskla, Oril and Dnieper and placed the Zaporozhian garrisons there, while himself approaching Dykanka, in order to meet up with Mazepa and, from there, to depart to Velyki Budyshcha, where Charles XII had stationed himself. This battle, although had tactical importance, did not affect the course of Charles XII's campaign in Russia, which had eventually ended with a Swedish defeat at Poltava, while the Zaporozhian Sich was sacked for defecting to the Swedes.\nLegacy\nThe battle is most famously known for being depicted on Nikolay Samokish's painting \"Battle of Tsarichanka in 1709\".\nReferences"
    }
  ]
}