{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Elsenborn Ridge__disambig_1\n\n| result            = American victory\n| combatant1        =\n| combatant2        =\n| commander1        =\n| commander2        =\n| units1            =\n| units2            =\n| strength1         = 38,000 men initially, increasing to >80,000\n| strength2         = 56,000 men initially\n| casualties1       =\n| casualties2       = |}}\n| campaignbox       =\n}}\nThe Battle of Elsenborn Ridge refers to the northernmost German attacks during the Battle of the Bulge. The area from Elsenborn Ridge itself to Monschau was the only sector of the American front line attacked during the Battle of the Bulge in which the Germans failed to advance. The battle centred on the boomerang-shaped Elsenborn Ridge east of Elsenborn, Belgium. In this region, Elsenborn Ridge marks the westernmost ridge of the Ardennes, rising more than  above sea level; unlike the uplands further north, east and south, it has been extensively logged. West of Elsenborn Ridge, where the land descends in gentle hills to the cities of Liège and Spa, was a network of Allied supply bases and a well-developed road network. The Germans planned on using two key routes through the area to seize Antwerp and force a separate peace with the United States and Britain. Capturing Monschau, the nearby village of Höfen, and the twin villages of Rocherath-Krinkelt just east of Elsenborn Ridge, were key to the success of the German plans, and Hitler committed his best armored units to the area.\nThe untested troops of the US 99th Infantry Division had been placed in the sector during mid-November because the Allies thought that the area was unlikely to see battle. The division was stretched thin over a  front, and all three regiments were in the line with no reserve. In early December, the 2nd Infantry Division was assigned to capture a road junction named Wahlerscheid, at the southern tip of the Hurtgen Forest. German forces counterattacked in what the Americans initially thought was a localized spoiling action, but was actually a leading element of the Battle of the Bulge. The 2nd Division consolidated its lines, pulling back into Hünningen, then Rocherath-Krinkelt, and finally to the dug-in positions held by the 99th Division at Elsenborn Ridge.\nIn a fierce battle lasting ten days, the American and German lines were often confused. During the first three days, the battle raged in and around Rocherath-Krinkelt. Attacking Elsenborn Ridge itself, the Germans employed effective combined arms tactics and penetrated the American lines several times, but their attacks were not well coordinated and were frustrated by the rugged terrain and the built-up area. To push the Germans back, the U.S. Army called in indirect fire on their own positions, and at one point rushed clerks and headquarters personnel to reinforce their lines. The Americans had positioned considerable artillery behind Elsenborn Ridge and these artillery batteries repeatedly pounded the German advance. The Germans, although possessing superior armor and numbers, were held in check by the Americans' well-prepared defensive positions, new proximity fuses for artillery shells, and innovative tactics, which included coordinated time on target artillery strikes.\nThe Sixth Panzer Army was unable to take its immediate objectives on the Meuse River. The stubborn American resistance forced Kampfgruppe Peiper to choose an alternative route well south of Monschau and Elsenborn Ridge. Peiper was able to advance about  west to Stoumont before his column was stopped by the 2nd Infantry Division, 30th Infantry Division, and the 82nd Airborne. In the end he ran out of fuel and ammunition. On 24 December, Peiper abandoned his vehicles and retreated with the remaining 800 men. German wounded and American prisoners were also left behind. According to Peiper, 717 men returned to the German lines out of about 3,000 at the beginning of the operation.\nDuring the battle the Americans suffered approximately 5,000 casualties, and many more wounded; exact German losses are not known, but they included a significant amount of armored vehicles. While the Americans had considerable supplies and enough troops to replace their losses, German losses could not be replaced.\nBackground\n\"We gamble everything!\" were the words used by Gerd von Rundstedt, commander-in-chief of the German Western Front, to describe Unternehmen Wacht am Rhein (\"Watch on the Rhine\"). Adolf Hitler first officially outlined his surprise counter-offensive to his astonished generals on 16 September 1944. The assault's ambitious goal was to pierce the thinly held lines of the U.S. First Army between Monschau and Wasserbillig with Army Group B (Model) by the end of the first day, get the armor through the Ardennes by the end of the second day, reach the Meuse between Liège and Dinant by the third day, and seize Antwerp and the western bank of the Schelde estuary by the fourth day. The Germans had designated five routes, or rollbahns, through the sector near Elsenborn which would give them direct access to the road network leading to the port of Antwerp; capturing this would split the American and British armies. Hitler believed the attack would inflame rivalries between the Americans and the British, and that the two countries would negotiate a peace as a result. His generals tried to persuade him to set a less ambitious goal, but he was adamant. As they had done in 1914 and 1940, the Germans planned to attack through the Losheim Gap in Belgium.\nGerman units\nSixth Panzer Army armored strength\nForces deployed north to south:\nI SS Panzer Corps (SS-Gruppenführer Hermann Priess)\n: 277th Volksgrenadier Division\n:: 6 Jagdpanzers\n: 12th SS Panzer Division Hitler Jugend\n:: 38 Panzerkampfwagen Vs (\"Panthers\")\n:: 39 Panzerkampfwagen IVs\n:: 47 Jagdpanzers\n: 12th Volksgrenadier Division\n:: 6 Sturmgeschütz\n: 1st SS Panzer Division Leibstandarte SS Adolf Hitler\n:: 37 Panzerkampfwagen Vs (\"Panthers\")\n:: 34 Panzerkampfwagen IVs\n:: 10 Jagdpanzers\n:: 30 Tiger IIs\n: 3rd Fallschirmjäger Division\n: 150th Panzer Brigade (Skorzeny)\nII SS Panzer Corps (SS-Obergruppenführer Willi Bittrich)\n: 2nd SS Panzer-Division Das Reich\n:: 58 Panzerkampfwagen Vs (\"Panthers\")\n:: 28 Panzerkampfwagen IVs\n:: 28 Sturmgeschütz\n: 9th SS Panzer Division Hohenstaufen\n:: 35 Panzerkampfwagen Vs (\"Panthers\")\n:: 39 Panzerkampfwagen IVs\n:: 21 Jagdpanzers\n:: 30 Tiger IIs\n:: 56 Sturmgeschütz\nLXVII Army Corps  (Generalleutnant Otto Hitzfeld)\n: 272nd Volksgrenadier Division\n: 326th Volksgrenadier Division\nHitler personally selected the best troops available and officers he trusted for the counter-offensive. The lead role was given to Sepp Dietrich's 6th Panzer Army, while 5th Panzer Army was to attack to their south, covering their flank. 6th Panzer Army was given priority for supply and equipment and was assigned the shortest route to the ultimate objective of the offensive, Antwerp. 6th Panzer Army included the elite of the Waffen-SS, and totalled four armored, or panzer, divisions and seven infantry divisions in three corps. 6th Panzer Army's 1,000-plus artillery pieces and 90 Tiger tanks made it the strongest force deployed. Although Dietrich's initial sector frontage was only , his assault concentrated on less than half that ground. Relying on at least a 6:1 troop superiority at the breakthrough points, he expected to overwhelm the Americans and reach the Meuse River by nightfall of the third day. The German assault force also included many volksgrenadier units. These were new units formed in the fall of 1944 by conscripting boys and elderly men, men previously rejected as physically unfit for service, wounded soldiers returning from hospitals, and transfers from the quickly shrinking German navy and air force. They were usually organized around cadres of veterans.\nVon Rundstedt believed the operation would decide the outcome of the war. A German document captured by the 394th Infantry Regiment on 16 December contained his orders:\nGerman dispositions\nThe Sixth Panzer Army commanded by Dietrich comprised three corps containing nine divisions.\n* The LXVII Armeekorps included the 326th, 272nd and 246th Volksgrenadier divisions.\n* I SS Panzer Corps had been formed from Hitler's personal bodyguard regiment. It included the 1st SS Panzer, 12th SS Panzer, 12th Volksgrenadier, 277th Volksgrenadier, and 3rd Fallschirmjäger divisions.\n* II SS Panzer Corps were in reserve. It was made up of the 2nd SS and 9th SS Panzer divisions.\nThe LXVII Armeekorps commanded by General der Infanterie Otto Hitzfeld were ordered to the region around Monschau. Their sector covered about , from a point just south of Vossenack,  northeast of Monschau, to southeast of Camp d'Elsenborn in the south.  The 326th was designated to take the area north and south of Monschau. The 246th and 3rd Panzergrenadier Division were tasked with taking Höfen and Monschau and nearby villages and then driving northwest to seize the Eupen road, which would allow I SS Panzer Corps to attack west over Rollbahn B.\nI SS Panzer Corps, positioned south of LXVII Armeekorps, had the primary responsibility for breaking through the Allied lines and reaching the Meuse River and then Antwerp. Its 12th SS Panzer Division was composed of junior officers and enlisted men who had been drawn from members of the Hitler Youth, while its senior non-commissioned officers and officers were generally veterans of the Eastern Front. It was assigned the job of breaking through to an east–west road in the northern sector of the Ardennes, code-named Rollbahn B, through Spa.\nThe 3rd Fallschirmjäger Division and 12th Volksgrenadier Division were responsible for opening the way to Rollbahn D for SS Standartenführer Joachim Peiper's Kampfgruppe Peiper, the lead element of 1st SS Panzer Division.\nAccording to Dietrich's plan, LXVII Armeekorps would secure 6th Panzer Army's northern flank. By sidestepping Monschau to seize the area of poor roads, forested hills, and upland moors of the Hohe Venn, LXVII's divisions would block the main roads leading into the breakthrough area from the north and west. Simultaneously, I SS Panzer Corps to the south would use its three infantry divisions to punch holes in the American line and swing northwest to join the left flank of LXVII Corps. Together, the infantry divisions would form a solid shoulder, behind which the tanks of I and II SS Panzer Corps would advance along 6th Panzer Army's routes leading west and northwest.\nTo maximize the speed of the operation, and to avoid potential bottlenecks and logistical confusion, the two armored divisions of 1st SS Panzer Corps were assigned separate routes west. 12th SS Panzer Division was to utilize three routes (Rollbahn A, B and C) to the north through Elsenborn, Bütgenbach, Malmedy, Spa, and Liège. 1st SS Panzer Division was given two routes in the south (Rollbahn D and E) through Losheim, Lieugneville, Vielsalm, Werbomont and Huy. The German plan of advance included Rollbahn A passing through a crossroads in the center of Rocherath and Rollbahn B skirting the southern edge of Krinkelt and continuing on toward Wirtzfeld. The Germans' first objective was to break through the defending line of the inexperienced 99th Infantry Division and the positions of the battle-hardened 2nd Infantry Division. Once they broke through the Americans, they needed to seize Elsenborn Ridge so they could control the roads to the south and west and ensure supply to the German troops.\nThe plan also included Operation Stößer, a paratrooper drop behind American lines in the High Fens at the Baraque Michel crossroads  north of Malmedy. Its objective was to seize terrain and bridges ahead of the main body after the two corps broke through the American defenses. The drop was set for 03:00 on 17 December and the units dropped were ordered to hold the crossroads for 24 hours until the arrival of 12th SS Panzer Division.\nDietrich planned to commit his third corps, II SS Panzer Corps in the second wave. Once I SS Panzer had broken the American lines, II SS Panzer would exploit the opening. Among the thirty-eight Waffen-SS divisions, these were among the most elite units.\nInitial Allied positions\nMonschau, on the northernmost sector of the German attack, was an essential objective of their offensive; a key road led northwest  to Eupen where V Corps headquarters was located. That same road continued  further to Liège where General Courtney Hodges maintained First Army Headquarters. This included several large supply depots in the Namur-Liège areas. On 16 December, the only combat unit guarding the highway to Eupen was 38th Cavalry Reconnaissance Squadron.\nExcept for their positions around Höfen, 99th Division and its three regiments, 393rd, 394th and 395th, were positioned within towns and villages to the east and south of Elsenborn Ridge and in the thick coniferous forest around them. The division had not yet fired its weapons in combat. There were insufficient troops to man defensive positions along the entire front, and the Americans could only maintain a series of strong points. Each regiment was responsible for protecting approximately  of front, roughly equivalent to one front-line infantry man every . There were undefended gaps in many places along the line which could only be patrolled. There were no units in reserve. Lt. Col. McClernand Butler, commanding officer of the 395th, later wrote:\n}}\nWith such a long front to watch over, Maj. Gen. Walter E. Lauer found it necessary to place all three regiments of his division in the frontline. 1st and 3rd Battalions of 395th Infantry Regiment in the north, about 600 front-line infantry men, held a position about  long and had no units in reserve. The infantry at Höfen occupied a line of foxholes along  of the front to the east of the village, backed up by dug-in support positions.\n99th Infantry Division used the relatively quiet period to prepare an extensive defensive system, including redundant lines of communication, precise positioning of weapons to provide interlocking grazing fire, and aggressive patrols that kept the Germans off guard. They also carefully integrated artillery support; registered on likely targets based on probable enemy approaches. 393rd Regiment held the center and 394th watched over the south. By mid-December, the troops were well dug in and had wired their positions with barbed wire and trip flares. They covered their fox holes with felled timber. The weather was unusually calm and cold. Between 19 December 1944 and 31 January 1945, the average maximum temperature at the front lines in Europe was 33.5&nbsp;°F. (0.83&nbsp;°C.), and the average minimum temperature 22.6&nbsp;°F. (−5.2&nbsp;°C.).\nThe American defensive line in the Ardennes had a gap south of Losheimergraben. General Leonard T. Gerow, in command of V Corps, recognized it as a possible avenue of attack by the Germans. This area, which lay between V Corps and Troy H. Middleton's VIII Corps to its south, was undefended apart from jeep patrols.\nBattle of Heartbreak Crossroads\nThe Battle of Heartbreak Crossroads, part of the Battle of Hürtgen Forest, in turn part of the attempt to capture the Roer River dams, was fought at a crossroads near the Siegfried Line that ran along the Hoefen-Alzen and Dreiborn ridges, about  north of Krinkelt-Rocherath. In early December, the experienced 2nd Infantry Division was tasked with capturing the crossroads. After attacking for two days without result, on 14 December two squads found a way through the well-emplaced German guns on the south side of the road. They cut the barbed wire and forged a path between the German defenses. They penetrated a trench line behind the pillboxes and held off German patrols for five hours, but when darkness fell they returned to the American lines. On 15 December, an American patrol advanced once more through the breach in the barbed wire and captured a portion of the trench line. They alerted the regimental command post, and Lieutenant Colonel Walter M. Higgins, Jr, commanding officer of 2nd Battalion, led two companies into the trenches behind the pillboxes. By the early morning of 16 December, 9th Infantry Regiment pressed the attack another  against stubborn resistance, capturing the crossroads and the road network around it. They had insufficient TNT to destroy the pillboxes.\nGerman attack\n:\n16 December\nOn the morning of Saturday, 16 December, a snowstorm blanketed the forests and the temperature dropped to . The German attack opened with a massive artillery bombardment along a  wide front just before 05:30. American commanders initially believed that the German fire was a retaliatory assault in response to the American advance at the Wahlerscheid crossroads. Large numbers of German infantry followed the barrage and attacked.\nThe northern assault was led by the I SS Panzer Corps. 1st SS Panzer Division was the spearhead of the attack, led by SS Obersturmbannführer Joachim Peiper's kampfgruppe, which consisted of 4,800 men and 600 vehicles, including 35 Panthers, 45 Panzer IVs, 45 Tiger IIs, 149 half-tracks, 18 105&nbsp;mm and 6 150&nbsp;mm artillery pieces, and 30 anti-aircraft weapons. Dietrich's plan was for the 12th Panzer Division to follow 12th Volksgrenadier Division's infantry who were tasked with capturing the villages and towns immediately west of the International Highway along the Lanzerath-Losheimergraben road and to advance northwest towards Losheimergraben. From there they would capture Bucholz Station and then drive  through Honsfeld, Büllingen and a group of villages named Trois-Ponts, to Belgian Route Nationale N-23, and cross the River Meuse. During the actual battle the 1st SS instead bypassed Elsenborn, taking a route further south than planned.\nThe 277th Volksgrenadier Division, assigned the task of capturing Krinkelt-Rocherath, just southeast of Elsenborn Ridge, was composed for the most part of inexperienced and poorly trained conscripts. Rocherath to the north and Krinkelt to the south share the same main street. The infantry advance was supported by an array of searchlights that lit up the clouds like moonlight allowing the inexperienced German infantry to find their way, but in some locations the German troops, backlit by the searchlights, became easy targets for American forces. These clouds, and the snowstorms over the following days, prevented the superior Allied air forces from attacking German forces. The American troops in the forward positions near the International Highway were quickly overrun and killed, captured, or even ignored by the Germans, intent on keeping to their timetable for a rapid advance.\nHowever, during their retreat earlier that autumn they had destroyed the Losheim-Losheimergraben road bridge over the railway. German engineers were slow to repair the bridge on the morning of 16 December, preventing German vehicles from using this route. A railroad overpass they had selected as an alternative route could not bear the weight of the German armor. Peiper received new orders directing him west along the road through Lanzerath to Bucholz Station. Before even reaching Lanzerath, Peiper lost three tanks to German mines and was slowed by mine-clearing operations.\nGerman advance delayed\nThe small village of Lanzerath—about 15 homes—lay astride a road junction southeast of Krinkelt-Rocherath. It was held by a single intelligence and reconnaissance platoon of the 394th Infantry Regiment, which was dug into a slight ridge northeast of the village and parallel to the road. They were initially supported by Task Force X, made up of 2nd Platoon, Company A, 820th Tank Destroyer Battalion; and 22 men of the 820th's 2nd Recon Platoon, commanded by Lieutenant John Arculeer, who were mounted on an armored half-track and two jeeps. Shortly after the early morning German bombardment ended, Task Force X pulled out without a word and headed south. That left the 18 men of the reconnaissance platoon alone, along with four forward artillery observers, to fill the gap.\nDuring a 20-hour-long battle, the 18-man platoon, led by 20-year-old lieutenant Lyle Bouck, inflicted around 93 casualties on the Germans. The American troops seriously disrupted the entire Sixth Panzer Army's schedule of attack along the northern edge of the offensive. The entire platoon was captured, and only many years later were they recognized with a Presidential Unit Citation. Every member of the platoon was decorated, making it the most highly decorated platoon of World War II.\nBattle near Monschau and Höfen\nU.S. 3rd Battalion, 395th Infantry Regiment was positioned about  to the north of Elsenborn Ridge near the towns of Monschau and Höfen. From 05:25 to 05:30 on 16 December, the battalion's positions \"in and around Höfen received a heavy barrage of artillery and rockets covering our entire front line.\" The enemy artillery, rocket and mortar fire cut all landline communications between the front-line units and headquarters. Only some radio communications between front line and the heavy weapons company remained operational. Twenty minutes after the barrage lifted, German infantry from the 753rd Volksgrenadier Regiment attacked the 395th in the dark in strength at five points. The German attack concentrated in the battalion's center, between I and K Companies. Another German force attempted to penetrate the Monschau area, immediately north of the Battalion's left flank. The 395th was outnumbered five to one and was at times surrounded.\nIt initially pushed the Germans back with machine gun, small arms and mortar fire, and hand-to-hand combat and stopped the German advance. Without radio communication between the front-line artillery liaison officer and 196th Field Artillery, their guns could not be brought to bear on the German assault until communication was restored at 06:50. The artillery had registered the forward positions of the American infantry and shelled the advancing Germans while the American soldiers remained in their covered foxholes. It was the only sector of the American front line attacked during the Battle of the Bulge where the Germans failed to advance. By 07:45, the Germans withdrew, except for a group which had penetrated the Battalion's center and was soon repulsed. At 12:35, the Germans launched their attack again, and were pushed back by artillery and mortar fire. The result of the first was 104 Germans dead \"in an area  yards in front of our lines to  behind the line, and another 160 wounded counted in front of battalion lines.\" The 3rd Battalion lost four killed, seven wounded and four missing. \"We learned from a German Lieutenant prisoner of war that the enemy's mission was to take Höfen at all costs.\"\nLauer ordered Col. Robertson at Wahlerscheid on 16 December to hold his position until at least the next morning when more orders would be forthcoming. Robertson was concerned that the 395th Combat Engineers and two regiments of the 2nd Division would be cut off by the advancing Germans. He told his men to hold and to be prepared for an orderly withdrawal in the morning. Early the next morning Gerow told Robertson to turn south and withdraw to a crossroads just north of Rocherath-Krinkelt where they were to establish a road block. Robertson's troops were heavily engaged and withdrawal was complicated, but successfully completed. 9th Infantry Regiment pulled back to the Baracken crossroads at the edge of the forest, about  to the south of the cross roads at Wahlerscheid. The other units moved south through the area near Rocherath-Krinkelt. Robertson moved his headquarters from Wirtzfeld, south and west of Rocherath-Krinkelt, to Elsenborn, just west of the ridge line. Robertson also informed Gerow that he intended to hold Rocherath-Krinkelt until troops east of the villages had retreated through them to the ridge line, which then would become the next line of defense. This defensive line was intended to safeguard the key high ground on Elsenborn Ridge from the German advance. The area around Elsenborn Ridge became a collection point for ragtag groups of American troops whose units had been broken and scattered at the start of the enemy offensive. With so many troops from different units arriving in every kind of condition, organizing a coherent defense was a huge task, but one that occurred with surprising speed under the circumstances. Intelligence about the attack that reached the Americans was spotty and contradictory.\nTo the east of Rocherath-Krinkelt, the Germans had made a deep penetration. Rocherath-Krinkelt had to be held to allow 2nd Infantry Division with its heavy weapons and vehicles to reach positions around Elsenborn. The 99th Division had already put its last reserve into the line. The 2nd Infantry Division, with the attached 395th, was left to defend the endangered sector of the corridor south.\nGerman paratrooper drop\nThe Germans' Operation Stößer was a plan to drop paratroopers in the American rear in the High Fens area,  north of Malmédy, and to seize the key Baraque Michel crossroads leading to Antwerp. The operation, led by Oberst Friedrich August Freiherr von der Heydte, was a complete failure. To conceal the plans from the Allies and preserve secrecy, von der Heydte wasn't allowed to use his own, experienced troops. Most of the replacement paratroops had little training. The Luftwaffe managed to assemble 112&nbsp;Ju 52 transport planes, but the pilots were inexperienced. They took off on the night of 16–17 December into strong winds, snow, and limited visibility with around 1,300 fallschirmjäger.\nIt was the German paratroopers' only nighttime drop during World War II. The pilots dropped some behind the German front lines, others over Bonn, and only a few hundred behind the American lines, in widely scattered locations. Some aircraft landed with their troops still on board. Only a fraction of the force landed near the intended drop zone. These were buffeted by strong winds that deflected many paratroopers and made for difficult landings. Since many of the German paratroopers were inexperienced, some were crippled on impact and others died where they landed. Some of their bodies were not found until the following spring when the snow melted.\nThe wide scattering of the drops led to considerable confusion among the Americans, as fallschirmjäger were reported all over the Ardennes, and the Allies believed a division-sized jump had taken place. The Americans allocated men to secure the rear instead of facing the main German thrust at the front. By noon on 17 December, von der Heydte's unit had scouted the woods and rounded up a total of around 300 fallschirmjäger. The force was too small to take the crossroads on its own, and had limited ammunition.\n17 December\nThe main drive against Elsenborn Ridge was launched in the forests east of Rocherath-Krinkelt on the early morning of 17 December. This attack was begun by tank and panzergrenadier units of 12th SS Panzer Division. 989th Infantry Regiment of 277th succeeded, after heavy and costly combat in the woods, in overrunning the forward American positions guarding the trails to the villages, capturing a large number of prisoners and leaving many small units isolated. By 11:00, this attack had driven units of 99th Infantry Division back into the area of Rocherath-Krinkelt. These units were joined by forces of 2nd Infantry Division moving into the villages from the north. The German attack swiftly bogged down against the heavy small arms and machine gun fire from the prepared positions of 99th Infantry Division on their flanks. The German infantry struggled to make their way through the dense woods and heavy brush in their path. The German forces also drew a rapid response from American artillery, who had registered the forward positions of their infantry. The artillery fired on the exposed advancing Germans while the American troops remained in their covered foxholes. The troops around the villages were assisted by tanks from 741st Tank Battalion, assisted by a company of 644th Tank Destroyer Battalion equipped with M10 tank destroyers, a company of 612th Tank Destroyer Battalion, and a few towed 3-inch guns from the 801st Tank Destroyer Battalion. They were instrumental in helping hold back the German advance in the fighting in and around Rocherath-Krinkelt.\nTo the northeast of the 99th Division, the 1st Infantry Division had been recuperating near Liege, from nearly constant combat since it took part in the Normandy landings on 6 June. When the German counterattack broke the division hastily relocated to the unguarded southern end of the 99th's line near Bütgenbach. Troops from the 1st and 9th Infantry Divisions, moved into position to fortify Elsenborn Ridge and complete the defense. The 9th Division held positions on the northern portion of the ridge, in the vicinity of Kalterherberg.\nHeld up by their inability to cross the railroad bridge that German engineers were slow to repair, and by the Intelligence and Reconnaissance platoon of 394th Infantry Regiment at Lanzerath Ridge, elements of 1st SS Panzer Division did not arrive in force at the 99th's positions until the afternoon of 17 December. Finding Rollbahn C blocked, 1st SS Panzer Division initially moved south for Rollbahn D. The Germans changed their mind about routing both units through the southern rollbahns, and on 18 December 12th SS Panzer Division was given the task of opening up the road to Rollbahn C. They made a probing attack that afternoon which failed. In the early morning of 17 December, Kampfgruppe Peiper quickly captured Honsfeld and shortly afterward Büllingen. Peiper's unit seized  of fuel for his vehicles; a Tiger II's consumption was about . The Germans paused to refuel before continuing westward. They had been assigned Rollbahn B which would take them through Spa. At 09:30 on 17 December, Peiper sent a section of the Kampfgruppe north to reconnoiter, but they encountered strong resistance, improvised by tank-destroyers of the 644th Tank Destroyer Battalion and lost two Panzer IVs. Two days into the offensive, the high ground of Elsenborn Ridge and two of the three routes the Germans planned to use remained within the American fortified defense zones.\nBelieving the way north to Rollbahn B was blocked, and knowing that 12th SS Panzer was well behind him, unable to dislodge the Americans from either Elsenborn Ridge or Domaine Butgenbach, Peiper and the 1st SS Panzer Division were forced to choose the more difficult Rollbahn D to the south. The road was narrow, in many places single-track, at times unpaved. When Peiper reviewed his newly assigned alternative route on a map, he exclaimed that the road was \"suitable not for tanks but for bicycles!\"\nOrders from Model and von Rundstedt that Elsenborn Ridge be captured and the advance of Sixth Panzer Army resume were being sent down the chain of command to 12th SS Panzer Division Headquarters with increasing urgency. General Hermann Priess, commander of the 1st SS Panzer Corps, ordered Obersturmbannführer Hugo Kraas, Commander of the 12th SS Panzer Division, to take command of all forces facing Elsenborn Ridge and capture it. The battle-seasoned veteran American tankers resisted repeated attacks by lead elements of Sixth Panzer Army from 16–19 December. Fighting against the superior German Panther and Tiger tanks, supported by infantry, the battalion fought many small unit engagements. Using their size and mobility to their advantage, their Shermans stalked the German tanks in twos and threes until they could destroy or immobilize them with shots from the flanks or rear.\n18 December\nThe American withdrawal was hastened by an increasing shortage of ammunition. Fortunately for the defense, three tank destroyers of 644th Tank Destroyer Battalion arrived with a good supply of bazookas and anti-tank mines. These reinforcements were put to good use when the 12th SS Panzer Division launched a powerful tank and infantry attack on Rocherath-Krinkelt. The American forces responded with a powerful artillery barrage supported by mortar fire, bazooka rockets, and anti-tank mines that repelled the German attack around midnight of 18 December. The German attack failed to clear a line of advance for the 12th SS.\nOn 18 December, German infantry and armor resumed their attack on Rocherath-Krinkelt. They were supported by the German 560th Heavy Antitank Battalion equipped with the state-of-the-art Jagdpanther tank destroyer. The Jagdpanther was armed with an 88&nbsp;mm cannon and the German leadership expected it to be a decisive element of the battle. The encounter opened with both sides targeting the village area with repeated artillery strikes, and German armored vehicles advanced into Rocherath-Krinkelt. All that day and night, the battle raged, with SS tank and assault guns hitting the villages from the east, supported by a barrage of nebelwerfer rockets. These forces were met in turn by heavy artillery shells with proximity fuses and about 20 Sherman tanks belonging to 741st Tank Battalion, and several M10 tank destroyers. The narrow streets of the town made effective maneuver difficult. Bazooka rounds fired from rooftops and artillery air bursts caused by proximity fuses created a lethal rain of splinters. Sherman tanks, hiding in alleyways and behind buildings, quickly knocked out six German tanks; eight more were destroyed by 57&nbsp;mm anti-tank guns, anti-tank rockets, bazookas, and mines. Neither side was inclined to take prisoners, and the losses on both sides were heavy.\nWithdrawal stopped\nDuring the night of 18–19 December, 1st and 2nd Battalions, 395th IR occupied positions in the woods north of Krinkelt and south of the Whalerscheid road junction. Col. A. J. MacKenzie, acting on orders he thought were from Lauer, ordered the units to withdraw. During the withdrawal, MacKenzie reported to Lauer on his progress. Lauer told MacKenzie he had given no such order and ordered MacKenzie back into his previous positions. The gap in the lines was undetected by the Germans. Had they been able to exploit the weakness in the American lines, they could have moved in behind the 2nd Division, possibly threatening the entire unit. MacKenzie ordered the troops back into the positions they had held only a few hours before, made extremely difficult due the darkness and risk of being detected. The 2nd Battalion commander refused and was immediately replaced by Lt. Col. Robert Boyden. The troops successfully slipped back into their old foxholes before dawn.\n19 December\nAt dawn on 19 December, the third day of the offensive, the Germans decided to shift the main axis of the attack south of Elsenborn Ridge. A new armored attack, led by 12th SS Panzer Division and supported by 12th Volksgrenadier Division, was launched against Domäne Bütgenbach, south east of Bütgenbach, in an attempt to expose the right flank of the Americans. 3rd Panzer Grenadier Division, supported by elements of the 12th and 277th Volksgrenadier Divisions to its left and right, made a frontal attack on the Elsenborn Ridge, with the objective of seizing the high feature called Roderhohe. The soft ground in front of the ridge was almost impassable, one Sturmgeschütz assault gun after another got stuck, and the 3rd Panzer Grenadier Division lost 15 tanks that day to American artillery.\nDuring 19 December, about 100 Germans seized four buildings in the village of Höfen, opening a wedge in the American lines about  by . After American rifle and mortar fire failed to dislodge them, 612th Tank Destroyer Battalion brought their 57&nbsp;mm anti-tank guns to bear directly on them. Follow-up attacks with white phosphorus grenades finally caused the surviving 25 Germans to surrender, while 75 were found dead within the buildings. The German attack on the American extreme left flank was repulsed by artillery and rifle fire. Despite the fierce onslaught, the battalion did not commit its reserves, which in any case only consisted of one platoon of forty men.\nThe Americans abandoned the rubble of Rocherath-Krinkelt, and Robertson ordered the remnants of 2nd Division to withdraw to defensive positions dug into the open terrain along the ridge. Troops from the remaining elements of 99th Infantry Division also used this time to withdraw to Elsenborn Ridge and fortify positions on it. They found it required dynamite to blow holes in the frozen ground. Elements of 741st Tank Battalion formed the rearguard to allow an orderly withdrawal from Rocherath-Krinkelt to positions behind Wirtzfeld to the west and northwest. By the afternoon the tankers had reported destroying 27 tanks, two Jagdpanzer IVs, two armored cars, and two half-tracks while losing eight of their own tanks. At the battalion level, units reported killing sixteen tanks; regimental 57&nbsp;mm guns claimed nineteen; and bazooka teams claimed to have killed seventeen more. While the numbers were undoubtedly exaggerated, they indicate the ferocity of the fighting. The German tank companies were rendered ineffective and played no significant role in later fighting.\nAt 17:30 that evening, the remaining troops of 393rd and 394th Infantry Regiments withdrew from their positions around the Baracken crossroads, just north of Krinkelt-Rocherath, and retreated along a boggy trail about  toward Elsenborn Ridge. American lines collapsed on either side. \"We were sticking out like a finger there\", Butler said. Increasingly isolated, the unit was running low on ammunition. A resourceful platoon leader found an abandoned German ammo dump. Butler claimed that \"We stopped the tail end of that push with guns and ammunition taken off the German dead\".\nBy the time the fight for the villages ended, five American soldiers had earned the Medal of Honor: Sgt. Jose M. Lopez, Sgt. Richard Cowan, Pvt. Truman Kimbro, Sgt. Vernon McGarity, and Sgt William Soderman. Another Medal of Honor was posthumously awarded to Henry F. Warner of the 26th Infantry Regiment, 1st Infantry Division.\n20–22 December\nOn 20 December, bolstered by reinforcements from the 12th Volksgrenadier Division, the Germans attacked from the south and east. This assault also failed. On 21 December, the Germans tried to bypass Dom Butgenbach to the southwest. A few German armored units penetrated Butgenbach, but the 2nd Battalion, assisted by some reinforcements, stopped them again.\nIn an effort to bolster command and control of the northern shoulder, Eisenhower gave Field Marshal Bernard Law Montgomery, commander of the 21st Army Group, command of all troops north of the German advance on 20 December. On the same day, Sixth Panzer Army made several all-out attempts to smash the American lines. It committed artillery, tanks, infantry, and self-propelled guns, supported by a Jagdpanther battalion and remnants of the Panzer IV and Jagdpanzer IV units.\nEarly on 21 December, SS Panzergrenadiers supported by Nebelwerfers and heavy German artillery attacked the 26th Infantry Regiment's/1st ID defenses in and around Dom Butgenbach at 09:00, 11:00 and 17:30. The fight lasted all day and into the night. The Germans successfully penetrated American lines several times but were pushed back by a combination of American infantry, the 613th Tank Destroyer Battalion equipped with the new M36 tank destroyer, and artillery. At the end of the battle, the field was strewn with destroyed German armor and scores of enemy dead, many as young as 15 and 16 years old. American graves registration troops counted 782 German dead in front of the 26th's positions alone. The Americans had destroyed 47 German tanks.\nOn 22 December, the Germans attacked on the right of Elsenborn Ridge. Their action was once again smothered by heavy American artillery fire from M1 howitzers, which fired 10,000 rounds on the 22nd. The 26th Infantry Regiment and a company of Sherman tanks from 745th Tank Battalion played key roles. On 23 December a cold wind from the northeast brought clear weather and froze the ground, allowing free movement of tracked vehicles and the return of effective air support. The German attack on the 22nd was their last attempt to capture the ridge. While the Americans anticipated another assault, the Germans only sent patrols against the battalion front lines until the Germans retreated. The air attacks played a significant role in defeating the German attack.\nKampfgruppe Peiper's route forced his vehicles to tail each other, creating a column of infantry and armor up to  long, and prevented them from concentrating their force. Peiper was able to advance about  west to Stoumont before his column was stopped by the 2nd Infantry Division, 30th Infantry Division and the 82nd Airborne. In the end he ran out of fuel and ammunition. On 24 December, Peiper abandoned his vehicles and retreated with the remaining 800 men. German wounded and American prisoners were also left behind. According to Peiper, 717 men returned to the German lines out of about 4,800 men at the beginning of the operation.\nVon Rundstedt had sacrificed most of two of the best divisions on the Western Front during his repeated attempts to overrun the Elsenborn Ridge and Monschau. Unable to access the Monschau-Eupen and Malmedy-Verviers roads, he was unable to commit II Panzer Corps, which was still waiting in reserve on the east flank of I SS Panzer Corps. Von Rundstedt's hopes of reaching Liège via Verviers were stopped cold by the stubborn American resistance.\nAttack stalls\nof the U.S. 7th Armored Division on 23 December 1944 in Vielsalm, Belgium]]\nOn 26 December, 246th Volksgrenadier Division made a final, forlorn, attack on the Elsenborn Ridge against units of the U.S. 99th Infantry Division. This attack by infantry conscripts was mowed down by artillery fire virtually at the moment of its start. The artillery concentration of an entire American army corps made the Elsenborn Ridge position virtually unassailable.\nAt sunrise on 27 December 1944, Dietrich and his 6th Panzer Army were in a difficult situation east of Elsenborn Ridge. 12th SS Panzer Division, 3rd Panzergrenadier Division, and its supporting volksgrenadier divisions had beaten themselves into a state of uselessness against the heavily fortified American positions. They could advance no further, and as the Americans counter-attacked, on 16 January 1945, the Sixth Panzer Army was transferred to the Eastern Front.\nThe weather improved in late December and early January, allowing Allied planes to attack the Germans from the air and seriously hinder their movement. The Germans launched an air offensive of their own in the Netherlands, destroying many Allied aircraft but sacrificing even more of their own irreplaceable aircraft and skilled pilots. They also launched a major ground offensive in Alsace on 1 January, but failed to regain the initiative. The end of Battle of the Bulge is officially considered to be 16 January, exactly one month after the Germans launched it, but fighting continued for three more weeks until early February when the front lines were reestablished on the positions held on 16 December.\nImpact of the battle\nThe organized retreat of 2nd and 99th Divisions to the Elsenborn Ridge line and their subsequent stubborn defense blocked the 6th Panzer Army's access to key roads in northern Belgium that they were relying on to reach Antwerp. It was the only sector of the American front line during the Battle of the Bulge where the Germans failed to advance. Historian John S.D. Eisenhower noted, \"...the action of the 2nd and 99th divisions on the northern shoulder could be considered the most decisive of the Ardennes campaign.\" Peiper's forces were plagued by overcrowding, flanking attacks, blown bridges, and lack of fuel, meaning that the Germans were unable to repeat the rapid advances they achieved in 1940 in the same area. The Germans were denied access to three of five planned routes of advance across their northern sector of the battle and were required to significantly alter their plans, considerably slowing their advance in the north. This success allowed the Americans to maintain the freedom to effectively maneuver across the north flank of the Germans' line of advance.\nLiège,  northwest of Spa, was the location of one of the largest American supply centers in Europe and the headquarters of First Army. Only  from Spa lay Verviers, an important and densely stocked rail head. Had the Germans been able to capture this area, the outcome of the battle may have been different. General Courtney Hodges, Commanding General of the First U.S. Army, wrote to the commanding general of 2nd Division, \"What the Second Infantry Division has done in the last four days will live forever in the history of the United States Army.\" After the war, Hasso von Manteuffel, Commanding General of the Fifth Panzer Army, wrote that the German counteroffensive \"failed because our right flank near Monschau ran its head against a wall.\"\n}}\nDisproportionate German casualties\nThe cost of the relentless, close-quarters, intense combat was high for both sides, but the German losses were irreplaceable. An exact casualty accounting for the Elsenborn Ridge battle is not possible. The American 2nd and 99th Infantry Divisions' losses are known, while only the Germans' armored fighting vehicles losses are accounted for. During the battle, small American units, company and less in size, often acting independently, conducted fierce local counterattacks and mounted stubborn defenses, frustrating the Germans' plans for a rapid advance, and badly upsetting their timetable. By 17 December, German military planners knew that their objectives along the Elsenborn Ridge would not be taken when planned.\nThe 99th Division devastated the attacking volksgrenadier formations. The 99th lost about 20% of its effective strength, including 465 killed and 2,524 evacuated due to wounds, injuries, fatigue, or illness. This performance prevented the Sixth Panzer Army from outflanking Elsenborn Ridge, and resulted in many commendations and unit citations for the 99th.\nMedia attention\nDespite the success on Elsenborn Ridge, other units' actions during the Battle of the Bulge received greater attention from the press. This was due in part to Bastogne having been a rest and recreation area for many war correspondents. The rapid advance by the German forces that resulted in the town being surrounded, the spectacular resupply operations via parachute and glider, along with the fast action of General Patton's Third U.S. Army, all captured the public's imagination and were featured in newspaper articles and on radio. But there were no correspondents in the area of Saint-Vith, Elsenborn or Monschau. The public had less interest in the static, stubborn resistance of the troops in the north.\nWeapons and tactics\nGerman combined arms\nThe force and mobility of the attack depended on the commitment of Germany's latest weapons and armored fighting vehicles. At the beginning of World War II, the German army had led the world in mechanized warfare tactics, overwhelming enemies repeatedly with their rapid Bewegungskrieg or \"Blitzkrieg\" tactics of combined warfare. Late in the war, the Germans had developed a number of advanced armored vehicles. The Tiger II, Panther and Jagdpanther were armed with new, high velocity 8.8&nbsp;cm KwK 43, and the 7.5&nbsp;cm KwK 42 cannons. Due to the flat trajectory and greater armor penetration of these guns, and the fact that thicker armor was used to shield them, German tanks enjoyed a superiority in firepower over nearly every American vehicle in use. Despite their superiority, the advanced German tanks were few in number and often experienced breakdowns because of unreliable mechanical parts.\nThese units were supported by new volks-werfer brigades: artillery units firing masses of 150&nbsp;mm and 300&nbsp;mm rockets. Although lacking in accuracy, a barrage from these units could cover a large area with high explosive. For more infantry firepower, SS Panzergrenadiers were equipped with the new Sturmgewehr 44. This was the world's first mass-produced assault rifle and more advanced than any other military rifle at the time. The new Panzerfaust 100 was an improved short range anti-tank rocket grenade that could penetrate any armor fielded by the American army.\nGerman tactics for the offensive involved an initial intense artillery barrage, followed by immediate infantry attacks by the volksgrenadier divisions supported with light assault guns such as the Sturmgeschütz IV. This initial attack with relatively non-mobile and more expendable troops were used to clear major roads for use by the SS panzer divisions, which would then rapidly move to capture bridges on the Meuse river for the final drive to Antwerp. These armored divisions were employed in a much more organized and controlled fashion, and with better leadership, than was usual for the Americans. The German concept of the armored division was an independent unit that carried with it all its supporting elements, making it more mobile and flexible than an American armored division, and able to concentrate greater force at the point of attack. Shock and high speed were intended to overwhelm resistance, as it did during the first drive from the Ardennes in 1940. These tactics made up what was referred to as blitzkrieg, or lightning war. The German command expected that the allied high command would take weeks to adjust to the impact. But Hitler failed to consider the constricted, winding, often unpaved roads of the northern Ardennes and underrated the capabilities of the American units on the northern shoulder.\nAmerican innovations and tactics\nOn the American side, the defense depended on field fortifications, innovative use of light anti-tank weapons such as the bazooka and anti-tank mines, and most importantly the support of a formidable array of indirect fire. American tanks and anti-tank guns were considered ineffective against the newer German fighting vehicles. This was compensated to some extent by use of the 76 mm (76.2 mm) M1A1 gun, mounted on the Sherman tank and the M18 Hellcat tank destroyer. The 3-inch cannon of the Wolverine tank destroyer was similar and a bit more effective than the M1A1 76&nbsp;mm gun. The British had also designed high-velocity anti-armor ammunition for the 57&nbsp;mm anti-tank cannon, which gave this gun a new lease of life against the heavier German tanks. American gunners were quick to trade for whatever their allies wanted for this highly effective ammunition. The Americans also adapted the 90&nbsp;mm anti-aircraft gun as an anti-tank cannon, and mounted it on an open turret of a Sherman tank chassis as the M36 Jackson tank-destroyer.\nSince the Normandy invasion, the American army had suffered greater than expected losses, and found countering German armored counter-attacks particularly difficult. Learning from this, American tactical doctrine began to include a defense in depth, using mobile armored cavalry squadrons with light tanks and anti-tank guns to screen defensive positions. When attacked, these cavalry units would delay the Germans for a short time, then retreat through defensive positions to their rear. These positions consisted of fortifications set around terrain choke points like villages, passes and bridges; in the area of Elsenborn Ridge, the twin villages of Domäne-Bütgenbach and the area around them proved to be the best areas for defense. Machine gun and infantry positions would be protected by barbed wire and mine fields. Anti-tank mine \"daisy chains\" were also used; these were composed of a line of mines lashed in a row which would be dragged across a road with a rope when a column of German tanks approached. This defensive line would be backed by bazooka positions in buildings, dug-in anti-tank guns, and tank destroyers firing from covered positions further to the rear.\nArtillery role\n, one of the \"Black Dragons\", the largest field gun in American service during World War II.]]\nAs German mobile units backed up against the American defenses, the Americans utilized their superior communications and artillery tactics, such as \"time on target\", a sequence of firing so that all shells impacted on the target simultaneously. This allowed large numbers of artillery pieces, distant from the battle, to concentrate unprecedented firepower on attacking German units.\nAlso new to the European battlefield were artillery proximity fuses. These had been developed in 1942 and were first used by ships in anti-aircraft guns. From June 1944, they helped bring down V-1 flying bombs aimed at London. Rather than exploding upon direct impact, the shells detected when they were near a target and detonated before contact, maximizing the effect of the shrapnel.\nShells armed with these fuses were very effective, but the Allies limited their use in Europe. The Pentagon feared that a dud would be recovered by the Germans who would reverse engineer it and use the information to design radar countermeasures or employ them against the Allies. Near Monschau, 326th Volksgrenadier Division quickly overran the Americans forward positions. Colonel Oscar A. Axelson, commanding officer of 405th Field Artillery Group, saw a need and ignored orders, and 196th Battalion was one of the first to use the fuses.\nThe American Army was also lavishly supplied with the self-propelled artillery and ammunition it took to make these firepower-based tactics successful. When effectively employed and coordinated, these attacks negated the advantage of superior German armor and armored tactics. The effectiveness of the new fused shells exploding in mid-air stirred some German soldiers to refuse orders to move out of their bunkers during an artillery attack. General George S. Patton said that the introduction of the proximity fuse required a full revision of the tactics of land warfare.\nThe American defense also involved abundant tactical air support, usually by P-47 Thunderbolt fighter bombers. These \"flying tanks\" were armed with air to surface rockets which were very effective against the thinly armored upper decks of German armored vehicles. Snowstorms prevented the utilization of these aircraft in the battle until the weather cleared on 23 December.\nLegacy\nMedal of Honor recipients\nPfc José M. López, a machine gunner with Company K, 393rd Infantry Battalion, was awarded the Medal of Honor for his courage while conducting a fighting withdrawal with his unit from tree to tree.\nSgt Richard Cowan killed about one hundred enemy while covering the retreat of Company I, 393rd Infantry Battalion, and was awarded the Medal of Honor.\nT/5 Sgt Vernon McGarity was wounded early in the battle, and after receiving first aid, returned to his unit. As squad leader, he directed and encouraged his soldiers throughout the intense fight which ensued. He repeatedly braved heavy fire to rescue wounded men, attack the advancing Germans, and retrieve supplies.\nPvt Truman Kimbro led a squad that was assigned to mine a crossroads near Rocherath, Belgium; the road was under direct fire. Kimbro left his men and although wounded, successfully laid mines across the road before he was killed.\nSgt William A. Soderman faced German tanks three times on an open road and destroyed the leading tank with a bazooka, stopping or slowing the German advance, allowing his fellow troops to safely withdraw.\nCpl Henry F. Warner of the 26th Infantry Regiment was posthumously awarded the Medal of Honor for single-handedly disabling several German tanks during a running battle near Bütgenbach.\nMemorials\nSeveral monuments have been built to commemorate the battle. As well as the memorials below, there are monuments in Ligneuville, Stavelot, Stoumont, and near Cheneaux at the Neufmolin Bridge.\n1031321-22 Rocherath-Krinkelt Mahnmale.jpg|Monuments to the battles in the twin villages of Rocherath-Krinkelt\nLanzerath memorial.jpg|Memorial to the Battle of Lanzerath Ridge\nUS memorial Hoscheid 01.jpg|U.S. Army memorial in Hoscheid\nUS memorial Hoscheid 02.jpg|U.S. Army memorial in Hoscheid\nReferences\nBibliography\n*\n*\n*\n*\n*\n; Attribution\nExternal links\n* [https://web.archive.org/web/20110202180541/http://www.eucmh.com/ European Center of Military History (Belgium)]\n* [https://web.archive.org/web/20061030042035/http://www.historynet.com/wars_conflicts/world_war_2/3031946.html Battle of the Bulge : US Troops Fight along the Ridge in Elsenborn Belgium]\n* [https://web.archive.org/web/20101126122141/http://www.wwiivehicles.com/germany/tank-hunters/jagdpanther.asp The German 560th Heavy Antitank Battalion]\n* [https://www.tracesofwar.com/persons/34753 Major General Walter Melville Robertson]\n* [http://www.heroesforever.nl/William%20R%20Hinsch%20Jr.htm The 2nd Infantry Division Defends the Twin Villages]\n* [http://www.644td.com/ The 644th Tank Destroyer Battalion]\n* [https://web.archive.org/web/20120527122723/http://en.allexperts.com/q/Military-History-669/WWII-artillery-ammo-fitted.htm Colonel Oscar A. Axelson and the Proximity Fuse]\n* Fritz, Ernest W. [https://digital.library.unt.edu/ark:/67531/metadc1539134/m1/25/ A Pictorial Account of 393d Infantry Regiment In Combat, 1944-1945] 1946. 74 pages."
    }
  ]
}