{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Ugentana\n\n*1 nau\n*1 square-rigged caravel\n*18 light oarvessels\n400 Portuguese soldiers400 combat slaves\n| strength2         = 7,000 men\n| casualties1       = 5 dead, many wounded\n| casualties2       = Unknown\n}}\nThe Battle of Ugentana, also known as Battle of Ugentana River was a military operation that took place in 1535, between Portuguese forces and those of Sultan Alauddin Riayat Shah II of Johor.\nThe Battle\nIn 1511, the second Governor of Portuguese India Afonso de Albuquerque captured the Malay city of Malacca from its sultan, who survived the battle and fled with his Court and most of his forces to Bintan, where he built a new city. After he was defeated in 1526, his son moved to the Malay Peninsula and founded a new sultanate, seated at a city the Portuguese identified as Ugentana, from where he continued hostilities against Portuguese Malacca.\nAfter the death of his brother Paulo by men employed by the Sultan of Johor, the captain of Malacca Estevão da Gama (son of Vasco da Gama) set sail to attack the sultan's city on June 1535, with a force consisting of one carrack, one square-rigged caravel and 18 light oarvessels with about 400 Portuguese soldiers plus 400 \"combat slaves\" (escravos de peleja).\nUpon arriving at the Johor River, which led to the city further upstream, Estevão left the carrack at its mouth, to prevent his forces from being attacked from behind by the fleet of the sultan, which was rumoured to be out at sea at that time. Because the river current was exceptionally strong up stream, the Portuguese proceeded by tying their vessels to the trees along the banks and pulling the cables, while a detachment of infantry proceeded by land.\nThe Portuguese found a stockade the sultan had built across the river, which was attacked and captured after a brief fight. Half a league before the city they found another river stockade protected by a fortified complex that included wooden stockades, barricades, and a stone fort, protected by 6,000 men. The Portuguese attacked the stockade with their caravel, and set an artillery battery on a nearby hill, from where they bombarded the stone fort. The Sultan's forces were reinforced by 1,000 men under the command of Tuão Mafamede, who attempted to dislodge the Portuguese, but was repulsed. Unable to oppose the Portuguese, the sultan ordered the evacuation of the fort and also his capital under the cover of the night, and fled into the jungle.\nThe Portuguese captured a number of artillery, vessels, and spoils left behind within the city, which was then burned.\nSee also\n*Portuguese Malacca\n*Capture of Malacca (1511)\n*Siege of Bintan\n*Battle of Ugentana (1536)\nReferences"
    }
  ]
}