{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Slobozia\n\n| result            = Russian victory\n| territory = Treaty of Bucharest\n| combatant1        =  Russian Empire\n| combatant2        =  Ottoman Empire\n| commander1        = Mikhail KutuzovYevgeny Markov\n| commander2        = Ahmed PashaIsmail Bey\n| strength1         = 37,000 soldiers\n| strength2         = 56,000 soldiers\n| casualties1       = Unknown}}\n| casualties2       = 22,000–24,000 killed and died of starvation/disease12,000 captured\n}}\nThe Battle of Slobozia was fought between Russia and the Ottoman Empire as a part of the Napoleonic Wars during the Rusçuk–Slobozia operation to .}} within the Russo-Turkish War of 1806–1812. The primary battle occurred on the left bank of the Danube River near the small village of Slobozia in Wallachia. Four miles (6.4 km) to the southeast on the right bank of the Danube was the Ottoman fortress at Rusçuk. The Russian investment of the Ottoman forces at Slobozia, including the final battle, lasted approximately two and a half months, from 28 August to 14 November 1811, ending when Russian Commander Mikhail Kutuzov ultimately accepted the surrender of the Ottoman forces commanded by Ahmed Pasha.\nBackground\nIn 1810, Russian forces crossed the Danube and invaded Ottoman Bulgaria. Numerous Ottoman fortresses along the Danube were attacked and captured including those at Silistra and Rusçuk. In the spring of 1811, Tsar Alexander became concerned that war with Napoleon would be renewed and prepared for a conflict by moving five of the nine Russian infantry divisions in Wallachia to northern Europe. Tsar Alexander also put Mikhail Kutuzov in command of the Russian forces along the Danube and ordered him to end the war as soon as possible.\nWhen Kutuzov reached Bucharest and took charge of Russia's armed forces in April, he immediately moved the bulk of his troops out of the Ottoman fortresses along the Danube and retreated back across the river into Wallachia. The fortress at Silistra was completely evacuated and the fortress at Rusçuk was vacated of everyone with the exception of a small covering force of 12 infantry battalions.\nPrelude to the battle\nInduced by the retreat of the Russians, Ahmed Pasha set about that spring assembling an army of close to 60,000 men. In June, he then set out to attack Rusçuk. Before Ahmed Pasha arrived in Rusçuk, however, Kutuzov re-crossed the Danube with his army of 18,000 and took a position  south of town. When Ahmed Pasha attacked the Rusçuk fortress on 22 June, Kutuzov attacked the Turks from the rear and successfully drove them back. At the end of the day, the Russians suffered 800 casualties but maintained control of the fortress. The Turks suffered 1,500 casualties, but still held a substantial numerical superiority.\nDuring the days following the battle, the armies spent time consolidating their forces and recovering. Kutuzov moved his army into the Rusçuk fortress; Ahmed Pasha organized a fortified field camp. Then on 27 June, Kutuzov surprised his adversary by razing the works of the fortress and moving his entire army across the Danube back into Wallachia. After vacating the fortress and assuring that all his men were on the left bank of the Danube, Kutuzov destroyed all the nearby bridges. For the next two months the two armies entered into a prolonged standoff during which they called for reinforcements and built their armies for an expected battle. The only offensive maneuver during this time was a failed attempt by an independent Turkish detachment of 20,000 men commanded by Ismail Bey to cross the Danube and flank the Russian lines.\n, 1829]]\nBattle\nOn 28 August, Ahmed Pasha finally initiated a direct confrontation with the Russians when he sent his forces to invade Wallachia by crossing the Danube  upstream from Rusçuk. Upon reaching the left bank of the Danube, the Turkish forces established a small bridgehead along the river in the vicinity of the village of Slobozia. Fortifications were begun and Russian defenders were fended off. Within a week, 36,000 men had crossed the Danube to the bridgehead where they were joined by Ahmed Pasha. The remainder of Ahmed Pasha's army, some 20,000 men, stayed on the right bank of Danube at their fortified camp near Rusçuk. Ismail Bey and his detachment were not a part of Ahmed Pasha's initiative and remained on the Bulgarian side of the Danube with a continuing objective being to cross the river and flank the Russians.\nKutuzov reacted quickly to the Turkish offensive by moving his headquarters from the fortress at Giurgiu to Slobozia and surrounding the Turks with two divisions of Russian Moldavian troopers that had been returned to his command. Fortifications were built directly in front of the Turks and extended on the sides to the banks of the Danube. Immediately thereafter, both armies were content to remain inactive for a period of time knowing that Ismail Bey and his sizable force remained free in the field. During this time, Ahmed Pasha was able to suitably provision his forces on the bridgehead by ferrying food and supplies across the Danube from the Turkish camp near Rusçuk. While the two armies stood steadfast facing each other, Ismail Bey attempted to find a way to cross the Danube and relieve Ahmed Pasha's army by flanking the Russians. Two crossing attempts were made by Ismail Bey at Vidin upstream from Slobozia. In both cases, however, the Turks were repelled by Russian Lieutenant General Andrey Zass. After the second failed attempt, Ismail Bey's forces were so depleted that they were no longer a threat to Kutuzov's army at Slobozia.\nOn the night of 1 October, Kutuzov took the action of secretly sending a detachment of 7,500 men commanded by Lieutenant General Yevgeny Markov across the Danube to the right bank. The next morning, Markov's forces surprised and overwhelmed the Turkish troops at their camp near Rusçuk. Even though the Ottoman forces outnumbered the Russians 3 to 1, the Turks panicked and scattered, suffering casualties of 2,000 men killed, wounded, or captured. With the loss of the forces protecting his back, Ahmed Pasha was now completely surrounded at the bridgehead.\nKutuzov then moved quickly to end the battle by initiating an all-out artillery attack upon the Turkish bridgehead. The bombardment was directed onto the Turks from all directions including from a small mid-river island on which the Russians constructed a battery and from a flotilla of 14 ships on the Danube. As the days and weeks went on, Turkish casualties accelerated not only from the artillery attack but also from a lack of food and supplies. Food stores were exhausted and extreme measures were taken to try and feed the troops. Cold, wet weather and the lack of firewood helped to spread illness and disease. Many men lost their lives as they attempted to desert. Ahmed Pasha finally met with Kutuzov and sought an armistice.\nOn 25 October, a ceasefire was agreed upon and approximately three weeks later on 14 November 1811, Ahmed Pasha agreed to a truce and formally surrendered to Kutuzov. Of the 36,000 men that crossed the Danube to establish the bridgehead at Slobozia, it was estimated that 2,000 men successfully deserted; 12,000 men surrendered and were taken captive, and 22,000 lost their life to warfare, starvation, or disease.\nFile:Окружение турок у Слободзее 1.jpg|Markov's crossing to the right bank and capturing the camp\nFile:Окружение турок у Слободзее 2.jpg|Encirclement of the Ottoman army on the left river bank\nAftermath\nThe loss of such a magnitude as that suffered at Slobozia forced the Ottoman Empire to enter into a general peace treaty with the Russians. Although the Turks were in no position to make demands, Sultan Mahmud was aware that Tsar Alexander desired to reach an agreement quickly and held out for better terms. Ultimately, Russia and the Ottoman Empire signed the Treaty of Bucharest on 28 May 1812.\nPer the terms of the treaty, Russia relinquished the conquests that it had made in Serbia and Bulgaria. Turkey retained control of Bulgaria, but lost nearly half of Moldavia when the Prut River was established as the new border between Moldavia and Bessarabia. Russia gained control over a new larger Bessarabia composed in part of territory formerly under the rule of Moldavia.\nFinally, five divisions were taken from Russia's Army in Wallachia and sent to Northern Europe to guard against an attack from Napoleon which ultimately occurred on 24 June 1812.\nCitations\nReferences\n*\n*\n*\n*}}\n* |archive-date=28 October 2021 |archive-url=https://web.archive.org/web/20211028105922/https://bigenc.ru/military_science/text/3625706 |url-status=dead }}\n*\n*\nGeneral References\n*Petrov, А.N. The War between Russia and Turkey, 1806—1812, vol. 1–3. SPb, 1885—87."
    }
  ]
}