{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Villers-en-Cauchies\n\n|map_type=Europe\n|map_relief=1\n|map_size=300\n| result      = Anglo-Austrian victory\n| combatant1  =  French First Republic\n| combatant2  =\n| commander1  =  René-Bernard Chapuy\n| commander2  =  Rudolf von Otto Daniel Mécsery Merveldt\n| strength1   = 7,000\n| strength2   = 300\n| casualties1 = 1,200 killed, wounded or captured, 5 cannons\n| casualties2 = 95 killed, wounded or missing\n}}\nIn the Battle of Villers-en-Cauchies, fought on 24 April 1794, a small Anglo-Austrian cavalry force routed a vastly more numerous French division during the Flanders Campaign of the French Revolutionary Wars. Villers-en-Cauchies is 15&nbsp;km south of Valenciennes.\nBackground\nAt the beginning of the Flanders Campaign in 1794, the main Coalition army led by the Prince Josias of Saxe-Coburg-Saalfeld advanced against the French Army of the North under Charles Pichegru. By mid-April the Coalition began the Siege of Landrecies while the observation army took position in a broad semi-circle to cover the operation.\nOn 23 April a French force was mustered in an attempt to cut off the Allied column of Ludwig von Wurmb from the rest of the observation army which consisted of the corps of François Sébastien de Croix de Clerfayt and Prince Frederick, Duke of York and Albany. Wurmb's command lay in a cordon of detachments between Denain and Hellesmes. All the available French troops from Cambrai and Bouchain were assembled under the command of René-Bernard Chapuis, the commandant of Cambrai. These were reinforced by troops that had been dispatched from Caesar's Camp on 21 April by André Drut, comprising 5,000 infantry commanded by Jean Proteau and 1,500 cavalry with four light cannons under Jacques Philippe Bonnaud. The combined command was 15,000 foot and 4,500 horse (Austrian reports estimate them as 30,000). This command crossed the Scheldt River on 23 April and advanced in four columns, the first from Bouchain towards Douchy-les-Mines, the second from Hordain on Noyelles-sur-Selle; the third from Iwuy on Avesnes-le-Sec, and the last from Cambrai against Iwuy. The French debouched onto the heights of Douchy and drove back Wurmb's Austrian outposts before crossing the Écaillon River, then sent detachments towards Le Quesnoy and Valenciennes. This movement had the effect of cutting direct communication between Le Cateau-Cambrésis and Denain, causing Clerfayt to dispatch reinforcements to Wurmb. However the French dared not push further for fear of attacks on their flanks, so they halted their advance and limited themselves to cannonades and skirmishing.\nOn hearing reports of the combat the Duke of York at Le Cateau sent his deputy, the Austrian Feldmarschall-Leutnant Rudolf Ritter von Otto in the direction of Villers-en-Cauchies to reconnoitre the enemy. Otto took two squadrons of the Austrian 17th Archduke Leopold Hussars and two squadrons of the British 15th Light Dragoons to scout the movement. Realising there was a substantial force before him Otto withdrew and called for reinforcements. During the evening, 10 more squadrons were sent forward, consisting of two squadrons of the Austrian Zeschwitz Cuirassiers, two squadrons of British light dragoons and a British heavy dragoon brigade of six squadrons commanded by John Mansel. As these were not able to join Otto before nightfall, the attack was postponed until the next morning.\nBattle\nOn the morning of the 24 April patrols informed Otto that the French were in the same position as the previous evening, and he immediately resolved to attack, deploying the four advanced squadrons with him. The two squadrons of Leopold Hussars (112 men) on the right commanded by Colonel Sigismund Ladislaus Szent-Kereszty; the 15th Light Dragoons (160 men) drew up on the left under Major William Aylett. The Advance Guard was guided by Otto's aide-de-camp Captain Daniel Mécsery, who had an intimate knowledge of the terrain. Behind and in support lay Mansel's British heavy dragoon brigade consisting of two squadrons each of the Royal Horse Guards, 1st Dragoon Guards and 3rd Dragoon Guards. Much further back in reserve lay the Zeschwitz Cuirassiers and British Light Dragoons.\nAt 7.00 am the Advance Guard rode from Saint-Python via the valley of the Selle towards Montrécourt to turn the French right. Near there Mécsery spotted in the underbrush 300 French chasseurs and 400–500 hussars of the former Esterhazy Regiment (the French 3rd Hussars). The Advance Guard was halted and Mécsery climbed a slight hill, from which he could see the bulk of the French cavalry (Bonnaud's command) hidden likewise in the underbrush, with a screen of scouts to their front. The Allied advance guard therefore moved towards their right, followed 600 paces behind by their support, obliging the French to mount the plateau and form up facing Otto at 400 paces. After observing for a moment, the French cavalry then retired and reformed near to and to the east of six battalions of infantry assembled between Viller-en-Cauchies and Avesnes-le-Sec.\nAt this time, the Austrian leader heard that Emperor Francis II was nearby with a small retinue.\nMécsery's Advance Guard, thinking they were supported by Mansel's brigade began to charge the left flank of Bonnaud's cavalry, but when they reached 60 paces the French cavalry made a half turn and galloped off, exposing the six battalions behind. Seeing themselves thus uncovered the French infantry formed square and opened fire on the advancing enemy Advance Guard. The Allied cavalry halted while Szent-Kereszty and Mécsery gave energetic speeches, then they charged straight onto the oblong square formed by the French battalions, rupturing one wall and seizing four cannons. A part of the infantry took to flight, the rest continued to fire, and were joined by flanking artillery support fire from supporting columns on each side, but Mécsery's Advance Guard charged again, the remainder of the infantry broke and ran in the direction of Caesar's Camp. These infantry units, who belonged to Chapuis' command at Cambrai had been defeated some days earlier on the same plains while under Nicolas Declaye, so their discouragement can be understood.\nOtto attributed the success to Mécsery, and noted that had they been supported by Mansel's brigade the French would have been utterly destroyed. But for some reason, later explained as a 'mix-up of orders' Mansel's command had halted, the entire attack was made by the vastly outnumbered members of the Advance Guard.\nThe Allied horse pursued the fleeing Frenchmen for  in the direction of Bouchain. Seeing the defeat, two French flank guards of 5,000 men each on each side of the defeated column hastily retired on Cambrai, covered by cavalry. Otto's men withdrew on Saint-Aubert to reform, but Bonnaud's cavalry had meanwhile recovered and counterattacked. Otto however, was now reinforced with three squadrons of Austrian Hussars, one from the Archduke Ferdinand and two from the Karaczay Regiments. Two pieces of Austrian horse artillery bombarded the French and menaced their flank, forcing them to retreat once more.\nBonnaud blamed Chapuis' infantry in his report, \"...we were attacked on all sides and they threw a lot of cavalry on our right which, supported by nothing, was at first forced back. The infantry were placed in route, the cavalry, especially the Carabiniers, the 13th Dragoons, the 5th and 6th Hussars, did their duty well and had to repair the lack of energy displayed by the infantry\".\nResults\nThat afternoon, as Otto re-established communications between the Duke of York and Denain, Clerfayt did the same thing on the side of Valenciennes. The Hanoverian General Maydel had been reinforced, giving him a total of 7 battalions, 2 companies and 13 squadrons. Leaving part of these at Douchy, with the rest he drove the French from Haspres, supported on the opposite side by Mansel's brigade which Otto had detached. This double movement against the French advanced on Douchy threatened to cut their retreat on Bouchain, causing them to hastily withdraw. The retreat became a rout when the French artillery drivers panicked and cut their traces, the whole column then took to flight.\nPichegru made light of the French losses and exaggerated the bravery of the French troops, claiming among other things that \"a single squadron of the 6th Hussars had sabred 600 Hungarian Hussars and made 60 prisoners\"\nChandler says the French admitted 1,200 killed, wounded and captured out of a force of 7,000 men. These figures are not backed up by other sources and may be totals for the whole operation.\nYork's report states that at Villers-en-Cauchies the French lost 900 killed, 400 wounded and only 10 unwounded prisoners. They also lost 5 cannons.\nThe Austrians lost 10 killed and wounded and 10 missing. British casualties were 58 killed and 17 wounded.\nEmperor Francis II awarded 8 British officers involved in this action with a special gold medal since at that time it wasn't possible to award the Military Order of Maria Theresia upon foreigners; later, in 1801, after a change in the order's statutes, these same officers were appointed Knights of the Military Order of Maria Theresia. The recipients were Major William Aylett; Captain Robert Pocklington; Captain Edward Michael Ryan; Lieutenant Thomas Granby Calcraft; Lieutenant William Keir; Lieutenant Charles Burrell Blount; Cornet Edward Gerald Butler and Cornet Robert Wilson. Of this medal only 9 pieces have been struck: 8 awarded and one preserved at the \"Münzkabinett\" in Vienna. Besides the mentioned piece preserved in Vienna, two original groups of medal and Maria Theresia's Cross appeared on the collecting market resp. in 1966 (belonged to Cornet E. Butler) and in 1967 (Capt. R. Pocklington), both sold by Spink & Son, London; the second, auctioned by Sotheby's in 1903, later in the Whitaker collection, this dissolved from 1959 onwards.\nCommentary\nDuring the early years of the French Revolutionary Wars, the French cavalry was particularly weak compared to the cavalry of their enemies. Historians blame this weakness on the loss of many aristocratic cavalry officers who fled France during the Revolution. In addition, the French infantry was filled with raw conscripts who were still learning their trade. Soon, the quality of the French cavalry and infantry would greatly improve as the officers and soldiers absorbed hard lessons at the hands of their enemies.\nChapuis would suffer a further and even greater humiliation at Beaumont-en-Cambresis (Troisvilles) on the 26th. The next major engagement would be the Battle of Tourcoing on 17–18 May.\nReferences\n* Coutanceau, H & Jonquiere, C de la. ''La Campagne de 1794 a l'Armée du Nord; IIe Partie: Operations Volume 1 (Chapelot, Paris 1907)\n* Wylly, Colonel H.C. XVth (The King's) Hussars 1759 to 1913 p.&nbsp;95-99 (Caxton publishing 1914)\n* Chandler, David. The Campaigns of Napoleon. New York: Macmillan, 1966.\n* Chandler, David. Dictionary of the Napoleonic Wars. New York: Macmillan, 1979.\n* Glover, Michael. The Peninsular War 1807-1814. London: Penguin, 2001.\n* London Gazette nr. 15025 of June 9, 1798\n* London Gazette nr. 15370 of June 2, 1801\n* Mericka, Vaclav: Orden und Ehrenzeichen der Oesterreichisch Ungarischen Monarchie Vienna, Praha, Schroll, 1974\n* Smith, Digby. The Napoleonic Wars Data Book.'' London: Greenhill, 1998.\nFootnotes\nExternal links\n* [https://www.napoleon-series.org/research/biographies/Austria/AustrianGenerals/c_AustrianGeneralsO.html#O29 Otto by Digby Smith, compiled by Leopold Kudrna]\n* [https://www.historyofwar.org/articles/battles_villers_en_cauchies.html Account of the Action by J Rickard]\n*"
    }
  ]
}