{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Focchies__disambig_1\n\n| result      = Venetian victory\n| combatant1  = Venice\n| combatant2  = Ottoman Empire\n| commander1  = Giacomo da Riva\n| commander2  = Mehmed Pasha\n| strength1   = 19 warships\n| strength2   = 11 warships 10 galleasses  72 galleys\n| casualties1 = 105 killed and wounded  1 warship destroyed\n| casualties2 = Unknown killed and wounded  9 warships destroyed  3 galleasses destroyed  2 galleys destroyed  1 warship captured  1 galleass captured  1 galley captured\n| campaignbox =\n}}\nThe Battle of Focchies was a significant naval engagement that took place on 12 May 1649, in the harbour of Focchies, Smyrna between a Venetian force of nineteen warships under the command of Giacomo da Riva, and an Ottoman force of eleven warships, ten galleasses, and seventy-two galleys, with the battle resulting in a crushing victory for the Venetian fleet. The battle was an episode in the Cretan War from 1645 to 1669 between the Venetian Republic (along with its allies, the Knights of Malta, the Kingdom of France and the Papal States) and the Ottoman Empire over dominance of various territories in the Mediterranean Sea. The war was one in a series of wars between the two warring powers, which contested for control of the Adriatic and Mediterranean trade routes. The primary territory that was contested during the war was Crete, the largest and most profitable of the overseas holdings of the Venetian Republic. The battle came after a squadron of Venetian ships under the command of Giacomo da Riva, a Venetian admiral, came to the rescue of the blockading Venetian force in the Dardanelles Straits, after the blockade had run into unexpected weather conditions and many ships sunk as a result.\nAdmiral da Riva moved to engage the Ottoman fleet, attempting to prevent them from sailing to Crete and reinforcing the Ottoman forces that were laying siege to the island. To reinforce his fleet before engaging the Ottomans, da Riva hired several English and Dutch armed merchantmen, promising to their captains that he would compensate them for any damages or casualties that they suffered. The Venetian fleet set sail towards the harbour, with the intention to destroy the Ottoman fleet while it was trapped. When the Ottomans saw that the Venetian fleet advancing, ten galleasses were placed in front of the harbour entrance to cover the other ships. The Venetians easily broke through the galleasses, and intense combat began and lasted for four hours, with the Venetian (and hired) warships engaging the Ottoman fleet, easily overwhelming them with superior firepower. The Ottomans put up a spirited defence, but could not stop the Venetians from destroying a significant portion of the fleet. Despite the overwhelming victory, it was not a complete one, and Ottoman naval forces were able to sail to Crete to bring reinforcements, with Crete falling to the Ottomans two decades later.\nBackground\n]]\nAfter the loss of Cyprus to the Ottomans in the fourth Ottoman–Venetian War (1570–1573), the island of Crete (the \"Kingdom of Candia\") was the last major overseas possession of the Venetian Republic. Its important strategic position made it an obvious target for future Ottoman expansion, while its size and fertile ground, together with the bad state of its fortresses, made it a more tempting prize than Malta. On the Venetian side, the Serenissima, with its weak military and great dependence on uninterrupted trade, was anxious not to provoke the Ottomans. Hence Venice scrupulously observed the terms of its treaty with the Ottomans, securing over sixty years of peaceful relations. By the early 17th century moreover, Venetian power had declined considerably. Its economy, which had once prospered because of its control over the Eastern spice trade, had suffered as a result of the opening of the new Atlantic trade routes, and from the loss of the important German market because of the Thirty Years' War. In 1645, the war broke out as Ottoman forces moved to capture Crete from the Venetians.\nA Venetian fleet had been ordered to blockade the Dardanelles Straits since April of 1648. On 19 November, most of the fleet withdrew, leaving thirteen warships, under da Riva to maintain the blockade. In Spring 1649, he was joined by Bertucci Civrano with seven more warships, bringing up the total strength of his fleet to nineteen warships, as he had lost a warship to bad weather in the previous months. In early May, the Ottoman fleet appeared from the direction of Istanbul. Only two of Riva's ships actually managed to engage them, and in the ensuing chaos, the Ottoman fleet safely made it out of the Strait and headed southwards. Giacomo da Riva, marshaling his fleet, ordered them to follow and successfully trapped the Ottoman fleet at the port of Focchies, on the mainland. Many of the Venetian ships were hired Dutch or English armed merchantmen, and da Riva had to promise to compensate their captains for any damage, due to da Riva realizing that the Dutch or English captains would be unwilling to risk their ships unless they knew that they were going to be adequately compensated for their efforts. On May 12, da Riva ordered his fleet to sail into the harbour and engage the Ottoman ships lying at anchor.\nBattle\n]]\nLeading the action from his flagship, the Rotta Fortuna, da Riva led his ship into the harbour. The larger and taller Venetian warships easily smashed aside the galleasses, and the minuscule amount of cannon that a single galleass could carry was no match for the dozens of cannons carried by the Venetian warships. Three galleasses were destroyed, with the rest being damaged and scattered, leaving the path into the harbour clear. The warships, one by one, sailed into the harbour and began engaging the Ottoman warships, aiming to use their overwhelming power to capture the warships and sink the galleys, which carried only a few cannons. The warships moved to engage, as they could withstand the broadside of the Venetian ones in a one-on-one engagement. However, da Riva was short one warship during the engagement, as the captain of the Esperienza had refused to sail into the harbour at all, instead keeping out to sea and only rejoining the fleet on the next day. During the action, the Ottoman fleet was slowly overwhelmed and destroyed, as the crews proved no match for Venetian, English and Dutch ones in terms of gunnery skill and seamanship, with many abandoning their ships as they sunk in the harbour.\nOnce the battle looked to be clearly in the Venetians favour, da Riva ordered men from his ships to set alight and burn the sinking Ottoman ships, as there was still a risk they could be re-floated, and being impossible to be towed out the harbour. In an unusual occurrence during a naval engagement, the galley slaves of one of the Ottoman galleys managed to overwhelm her crew and row towards a Venetian warship, whereupon the liberated slaves promptly surrendered the galley. Two of the smaller warships, the San Bartolamio, and the Francese, were abandoned by their crew due to damage incurred by Ottoman cannonade. The San Bartolamio was able to be successfully regained by the crew of the Tre Re, whereas the Francese drifted onto the shore and was burnt and destroyed by Ottoman soldiers while beached. When the action was concluding, da Riva surveyed the scene to see a spectacular success- nine warships burnt, three galleasses burnt, two galleys burnt, and one of each type captured. However, at midnight, the wind changed, and the fires set by the Venetians threatened to burn their own warships to the waterline. Upon seeing this, da Riva gave the order to retreat, and the action concluded.\nAftermath\n]]\nIn total, the Venetian fleet suffered 105 men killed or wounded, alongside one warship destroyed, burnt by the Ottomans after it drifted onto the shore after being abandoned. The Venetian fleet suffered another loss just ten days later- the James, which had captured the galleass during the battle and was dismasted during the fighting- sunk in heavy weather due to damage sustained during the battle. The casualties for the Ottoman fleet was devastating, although not absolute- they still had one warship, seven galleasses, and sixty-nine galleys still intact alongside their crews. The reason for so many ships surviving was due to the wind moving the direction of the flames away from the rest of the Ottoman fleet, and causing the Venetian fleet to withdraw. In the days following the action, da Riva made no attempt to follow up on his victory, but after waiting near Focchies ordered his fleet to weigh anchor and sail towards the Gulf of Smyrna, where he hoped to prevent Christian ships from entering in the service of the Ottoman Navy. Failing to sight any ships, da Riva instead ordered his fleet to sail towards Crete, to link up with Captain General Alvise Mocenigo, who da Riva had written a letter to when he saw the Ottoman fleet leaving the Dardanelles Strait.\nOn May 23, da Riva, along with his fleet reached Nixa, waiting there for six days until Mocenigo joined forces with him. Mocenigo brought with him four warships, six galleasses and twenty-one galleys from Crete. Mocenigo dissuaded da Riva from launching patrols in the region to search for Ottoman ships, instead holding their position and stopping any significant Ottoman force from reaching Chania. In early June, the Kapudan Pasha left for Rhodes, merging the ships that had not been destroyed into a larger fleet. This fleet was joined by warships and galleys from Egypt and the Barbary States, and reached a size of eighty-three galleys and seventy-four warships, along with countless smaller vessels such as xebecs and gunboats. By late June his fleet arrived at Tine, and from there he sailed towards Milo in preparation for the final journey to Chania. Around the same time, da Riva was stationed at Santorin, but was able to sail to Milo to intercept the Ottoman fleet. However, neither fleet was willing to risk an all-out engagement, and both sides withdrew, the Ottoman fleet allowed to sail unmolested towards Chania. The fleet was able to assist in the ongoing siege, which eventually fell to the Ottomans in 1669, bringing an end to the war in favour of the Ottomans.\nSee also\n* Cretan War (1645-1669)\n* Venetian Navy\n* Ottoman Navy\nReferences\nBibliography\n*"
    }
  ]
}