{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Yongsan\n\n| result      = United Nations victory\n| combatant1  =\n*\n| combatant2  =\n| commander1  =  Laurence B. Keiser Edward A. Craig\n| commander2  = Pak Kyo SamLee Kwon Mu\n| units1      =  2nd Infantry Division 1st Provisional Marine Brigade\n| units2      = 9th Division4th Division\n| strength1   = 20,000\n| strength2   = 14,500\n| casualties1 =\n| casualties2 =\n| campaignbox =\n}}\nThe Battle of Yongsan was an engagement between United Nations Command (UN) and North Korean forces early in the Korean War from September 1–5, 1950, at Yongsan in South Korea. It was part of the Battle of Pusan Perimeter and was one of several large engagements fought simultaneously. The battle ended in a victory for the UN after large numbers of United States Army (US) repelled a strong Korean People's Army (KPA) attack.\nDuring the nearby Second Battle of Naktong Bulge, the KPA broke through the US 2nd Infantry Division lines along the Naktong River. Exploiting this weakness, the KPA 9th and 4th Divisions attacked to Yongsan, a village east of the river and the gateway to the UN lines of supply and reinforcement for the Pusan Perimeter. What followed was a fight between KPA and US forces for Yongsan.\nThe KPA were able to briefly capture Yongsan from the 2nd Infantry Division, which had been split in half from the penetrations at Naktong Bulge. Lieutenant General Walton Walker, seeing the danger of the attack, brought in the US Marine Corps 1st Provisional Marine Brigade to counterattack. In three days of fierce fighting, the Army and Marine forces were able to push the KPA out of the town and destroy the two attacking divisions. The win was a key step toward victory in the fight at the Naktong Bulge.\nBackground\nPusan Perimeter\nFrom the outbreak of the Korean War and the invasion of South Korea by the North, the KPA had enjoyed superiority in both manpower and equipment over both the Republic of Korea Army (ROK) and the UN forces dispatched to South Korea to prevent it from collapsing. The KPA tactics were to aggressively pursue UN forces on all avenues of approach south and to engage them aggressively, attacking from the front and initiating a double envelopment of both flanks of the unit, which allowed the KPA to surround and cut off the opposing force, which would then be forced to retreat in disarray, often leaving behind much of its equipment. From their initial June 25 offensive to fights in July and early August, the KPA used these tactics to effectively defeat any UN force and push it south. However, when the UN forces, under the Eighth United States Army, established the Pusan Perimeter in August, the UN troops held a continuous line along the peninsula which KPA troops could not flank, and their advantages in numbers decreased daily as the superior UN logistical system brought in more troops and supplies to the UN forces.\nWhen the KPA approached the Pusan Perimeter on August 5, they attempted the same frontal assault technique on the four main avenues of approach into the perimeter. Throughout August, the KPA 6th Division, and later the KPA 7th Division, engaged the US 25th Infantry Division at the Battle of Masan, initially repelling a UN counteroffensive before countering with battles at Komam-ni and Battle Mountain. These attacks stalled as UN forces, well equipped and with plenty of reserves, repeatedly repelled KPA attacks. North of Masan, the KPA 4th Division and the US 24th Infantry Division sparred in the Naktong Bulge area. In the First Battle of Naktong Bulge, the KPA division was unable to hold its bridgehead across the river as large numbers of US reserve forces were brought in to repel it, and on August 19, the KPA 4th Division was forced back across the river with 50 percent casualties. In the Taegu region, five KPA divisions were repulsed by three UN divisions in several attempts to attack the city during the Battle of Taegu. Particularly heavy fighting took place at the Battle of the Bowling Alley where the KPA 13th Division was almost completely destroyed in the attack. On the east coast, three more KPA divisions were repulsed by the ROK at P'ohang-dong during the Battle of P'ohang-dong. All along the front, the KPA troops were reeling from these defeats, the first time in the war their tactics were not working.\nSeptember push\nIn planning its new offensive, the KPA command decided any attempt to flank the UN force was impossible thanks to the support of the UN naval forces. Instead, they opted to use frontal attack to breach the perimeter and collapse it; this was considered to be the only hope of achieving success in the battle. Fed by intelligence from the Soviet Union, the North Koreans were aware of the UN forces building up along the Pusan Perimeter and that they must conduct an offensive soon or they could not win the battle. A secondary objective was to surround Taegu and destroy the UN units in that city. As part of this mission, the KPA would first cut the supply lines to Taegu.\nOn August 20, the KPA commands distributed operations orders to their subordinate units. The plan called for a simultaneous five-prong attack against the UN lines. These attacks would overwhelm the UN defenders and allow the KPA to break through the lines in at least one place to force the UN forces back. Five battle groupings were ordered. The center attack called for the KPA 9th, 4th, 2nd and 10th Divisions to break through the US 2nd Infantry Division at the Naktong Bulge to Miryang and Yongsan.\nBattle\nawait North Korean attacks across the Naktong River, September 3]]\nOn the morning of September 1 the 1st and 2nd Regiments of the KPA 9th Division, in their first offensive of the war, stood only a few miles short of Yongsan after a successful river crossing and penetration of the US line. The 3rd Regiment had been left at Inch'on, but division commander Major General Pak Kyo Sam felt the chances of capturing Yongsan were strong.\nAs the KPA 9th Division approached Yongsan, its 1st Regiment was on the north and its 2nd Regiment on the south. The division's attached support, consisting of one 76&nbsp;mm artillery battalion from the KPA I Corps, an anti-aircraft battalion of artillery, two tank battalions of the KPA 16th Armored Brigade, and a battalion of artillery from the 4th Division, gave it unusually heavy support. Crossing the river behind it came the 4th Division, a greatly weakened organization, far understrength, short of weapons, and made up mostly of untrained replacements. A captured KPA document referred to this grouping of units that attacked from the Sinban-ni area into the Naktong Bulge as the main force of KPA I Corps. Elements of the 9th Division reached the hills just west of Yongsan during the afternoon of September 1.\nOn the morning of September 1, with only the shattered remnants of E Company at hand, the US 9th Infantry Regiment, 2nd Infantry Division had virtually no troops to defend Yongsan. Division commander Major General Laurence B. Keiser in this emergency attached the 2nd Engineer Combat Battalion to the regiment. The US 72nd Tank Battalion and the 2nd Division Reconnaissance Company also were assigned positions close to Yongsan. The regimental commander planned to place the engineers on the chain of low hills that arched around Yongsan on the northwest.\nNorth Korean attack\nA Company, 2nd Engineer Combat Battalion, moved to the south side of the Yongsan-Naktong River road; D Company of the 2nd Engineer Battalion was on the north side of the road. Approximately  west of Yongsan an estimated 300 KPA troops engaged A Company in a fire fight. M19 Gun Motor Carriages of the 82nd AAA Battalion supported the engineers in this action, which lasted several hours. Meanwhile, with the approval of the Assistant Division Commander Brigadier General Joseph S. Bradley, D Company moved to the hill immediately south of and overlooking Yongsan. A platoon of infantry went into position behind it. A Company was now ordered to fall back to the southeast edge of Yongsan on the left flank of D Company. There, A Company went into position along the road; on its left was C Company of the Engineer battalion, and beyond C Company was the 2nd Division Reconnaissance Company. The hill occupied by D Company was in reality the western tip of a large mountain mass that lay southeast of the town. The road to Miryang came south out of Yongsan, bent around the western tip of this mountain, and then ran eastward along its southern base. In its position, D Company not only commanded the town but also its exit, the road to Miryang.\nThe KPA had also approached Yongsan from the south. The US 2nd Division Reconnaissance Company and tanks of the 72nd Tank Battalion opposed them in an intense fight. In this action, Sergeant First Class Charles W. Turner of the Reconnaissance Company particularly distinguished himself. He mounted a tank, operated its exposed turret machine gun, and directed tank fire which reportedly destroyed seven KPA machine guns. Turner and this tank came under heavy KPA fire which shot away the tank's periscope and antennae and scored more than 50 hits on it. Turner, although wounded, remained on the tank until he was killed. That night KPA soldiers crossed the low ground around Yongsan and entered the town from the south.\nThe KPA now attempted a breakthrough of the Engineer position. After daylight, they were unable to get reinforcements into the fight since D Company commanded the town and its approaches. In this fight, which raged until 11:00, the engineers had neither artillery nor mortar support. D Company remedied this by using its new 3.5-inch and old 2.36-inch rocket launchers (Bazookas) against the KPA infantry. The fire of the 18 Bazookas plus that from machine guns and the small arms of the company inflicted very heavy casualties on the KPA, who desperately tried to clear the way for a push eastward to Miryang. Tanks of A and B Companies, 72nd Tank Battalion, at the southern and eastern edge of Yongsan shared equally with the engineers in the intensity of this battle. The company commander was the only officer of D Company not killed or wounded in this melee, which cost the company 12 men killed and 18 wounded. The edge of Yongsan and the slopes of the hill south of the town became covered with KPA dead and destroyed equipment.\nReinforcements\nWhile this battle raged during the morning at Yongsan, commanders reorganized about 800 men of the 9th Infantry who had arrived in that vicinity from the overrun river line positions. Among them were F and G Companies, which were not in the path of major KPA crossings and had succeeded in withdrawing eastward. They had no crew-served weapons or heavy equipment. In midafternoon September 2, tanks and the reorganized US 2nd Battalion, 9th Infantry, attacked through A Company, 2nd Engineer Combat Battalion, into Yongsan, and regained possession of the town at 15:00.  Later, two bazooka teams from A Company, 2nd Engineer Combat Battalion, knocked out three T-34 tanks just west of Yongsan. US ground and air action destroyed other KPA tanks during the day southwest of the town. By evening the KPA had been driven into the hills westward. In the evening, the 2nd Battalion and A Company, 2nd Engineer Combat Battalion, occupied the first chain of low hills  beyond Yongsan, the engineers west and the 2nd Battalion northwest of the town. For the time being at least, the KPA drive toward Miryang had been halted. In this time, the desperately undermanned US units began to be reinforced with Korean Augmentees (KATUSAs) However, the cultural divide between the KATUSAs and the US troops caused tensions.\nAt 09:35 September 2, while the KPA were attempting to destroy the engineer troops at the southern edge of Yongsan and clear the road to Miryang, Eighth United States Army commander Lieutenant General Walton Walker spoke by telephone with Major General Doyle O. Hickey, Deputy Chief of Staff, Far East Command in Tokyo. He described the situation around the Perimeter and said the most serious threat was along the boundary between the US 2nd and 25th Infantry Divisions. He described the location of his reserve forces and his plans for using them. He said he had started the 1st Provisional Marine Brigade, under Brigadier General Edward A. Craig, toward Yongsan but had not yet released them for commitment there and he wanted to be sure that UN commander General of the Army Douglas MacArthur approved his use of them, since he knew that this would interfere with other plans of the Far East Command. Walker said he did not think he could restore the 2nd Division lines without using them. Hickey replied that MacArthur had the day before approved the use of the Marines if and when Walker considered it necessary. A few hours after this conversation, at 13:15, Walker attached the 1st Provisional Marine Brigade to the US 2nd Division and ordered a co-ordinated attack by all available elements of the division and the Marines, with the mission of destroying the KPA east of the Naktong River in the 2nd Division sector and restoring the river line. The Marines were to be released from 2nd Division control as soon as this mission was accomplished.\nSeptember 3 counterattack\nA conference was held that afternoon at the US 2nd Division command post attended by leaders of the Eighth Army, US 2nd Division, and 1st Marine Brigade. A decision was reached that the Marines would attack west at 08:00 on September 3 astride the Yongsan-Naktong River road;  the 9th Infantry, B Company of the 72nd Tank Battalion, and D Battery of the 82d AAA Battalion would attack northwest above the marines and attempt to re-establish contact with the US 23rd Infantry Regiment; the 2nd Engineer Combat Battalion, remnants of the 1st Battalion, 9th Infantry and elements of the 72nd Tank Battalion would attack on the left flank, or south, of the Marines to reestablish contact with the 25th Division. Eighth Army now ordered the US 24th Infantry Division headquarters and the US 19th Infantry Regiment to move to the Susan-ni area,  south of Miryang and  east of the confluence of the Nam River and the Naktong River. There it was to prepare to enter the battle in either the 2nd or 25th Division zone.\nThe troops holding this line on the first hills west of Yongsan were G Company, 9th Infantry, north of the road running west through Kogan-ni to the Naktong; A Company, 2nd Engineer Combat Battalion, southward across the road; and, below the engineers, F Company, 9th Infantry. Between 03:00 and 04:30 September 3, the 1st Provisional Marine Brigade moved to forward assembly areas. The 2nd Battalion, 5th Marines assembled north of Yongsan, the 1st Battalion, 5th Marines south of it. The 3rd Battalion, 5th Marines established security positions southwest of Yongsan along the approaches into the regimental sector from that direction.\nDuring the night, A Company of the engineers had considerable fighting with KPA and never reached its objective. At dawn September 3, A Company attacked to gain the high ground which was part of the designated Marine line of departure. The company fought its way up the slope to within  of the top, which was held by the firmly entrenched KPA. At this point the company commander caught a KPA-thrown grenade and was wounded by its fragments as he tried to throw it away from his men. The company with help from Marine tank fire eventually gained its objective, but this early morning battle for the line of departure delayed the planned attack.\nThe Marine attack started at 08:55 across the rice paddy land toward KPA-held high ground  westward. The 1st Battalion, 5th Marines, south of the east–west road, gained its objective when KPA soldiers broke under air attack and ran down the northern slope and crossed the road to Hill 116 in the 2nd Battalion zone. Air strikes, artillery concentrations, and machine gun and rifle fire of the 1st Battalion now caught KPA reinforcements in open rice paddies moving up from the second ridge and killed most of them. In the afternoon, the 1st Battalion advanced to Hill 91.\nNorth of the road the 2nd Battalion had a harder time, encountering heavy KPA fire when it reached the northern tip of Hill 116,  west of Yongsan. The KPA held the hill during the day, and at night D Company of the 5th Marines was isolated there. In the fighting west of Yongsan Marine armor knocked out four T-34 tanks, and KPA crew members abandoned a fifth. That night the Marines dug in on a line  west of Yongsan. The 2nd Battalion had lost 18 killed and 77 wounded during the day, most of them in D Company. Total Marine casualties for September 3 were 34 killed and 157 wounded. Coordinating its attack with that of the marines, the 9th Infantry advanced abreast of them on the north.\nSeptember 4 counterattack\nJust before midnight, the 3rd Battalion, 5th Marines, received orders to pass through the 2nd Battalion and continue the attack in the morning.  That night torrential rains made the troops miserable and lowered morale. The KPA were unusually quiet and launched few patrols or attacks. The morning of September 4, the weather was clear.\nThe counterattack continued at 08:00 September 4, at first against little opposition. North of the road the 2nd Battalion quickly completed occupation of Hill 116, from which the KPA had withdrawn during the night. South of the road the 1st Battalion occupied what appeared to be a command post of the KPA 9th Division. Tents were still up and equipment lay scattered about. Two abandoned T-34 tanks in excellent condition stood there. Tanks and ground troops advancing along the road found it littered with KPA dead and destroyed and abandoned equipment. By nightfall the counterattack had gained another .\nThat night was quiet until just before dawn. The KPA then launched an attack against the 9th Infantry on the right of the Marines, the heaviest blow striking G Company. It had begun to rain again and the attack came in the midst of a downpour. In bringing his platoon from an outpost position to the relief of the company, Sergeant First Class Loren R. Kaufman encountered an encircling KPA force on the ridge line. He bayoneted the lead scout and engaged those following with grenades and rifle fire. His sudden attack confused and dispersed this group. Kaufman led his platoon on and succeeded in joining hard-pressed G Company. In the ensuing action Kaufman led assaults against close-up KPA positions and, in hand-to-hand fighting, he bayoneted four more KPA soldiers, destroyed a machine gun position, and killed a mortar crew. US artillery fire concentrated in front of the 9th Infantry helped greatly in repelling the KPA in this night and day battle.\nSeptember 5 counterattack\nThat morning, September 5, after a 10-minute artillery preparation, the American troops moved out in their third day of counterattack. It was a day of rain. As the attack progressed, the marines approached Obong-ni Ridge and the 9th Infantry neared Cloverleaf Hill where they had fought tenaciously during the First Battle of Naktong Bulge the month before. There, at midmorning, on the high ground ahead, they could see KPA troops digging in. The Marines approached the pass between the two hills and took positions in front of the KPA-held high ground.\nAt 14:30 approximately 300 KPA infantry came from the village of Tugok and concealed positions, striking B Company on Hill 125 just north of the road and east of Tugok. Two T-34 tanks surprised and knocked out the two leading Marine M26 Pershing tanks. Since the destroyed Pershing tanks blocked fields of fire, four others withdrew to better positions. Assault teams of B Company and the 1st Battalion with 3.5-inch Bazookas rushed into action, took the tanks under fire, and destroyed both of them, as well as an armored personnel carrier following behind. The KPA infantry attack was brutal and inflicted 25 casualties on B Company before reinforcements from A Company and supporting Army artillery and Marine 81&nbsp;mm mortars helped repel it.\nSeptember 5 was a day of heavy casualties everywhere on the Pusan Perimeter. Army units had 102 killed, 430 wounded, and 587 missing in action for a total of 1,119 casualties. Marine units had 35 killed, 91 wounded, for a total of 126 battle casualties. Total American battle casualties for the day were 1,245 men. It is unknown how many KPA were killed or wounded on that day, but they likely suffered heavy casualties.\nNorth Koreans repulsed\nDuring the previous night, at 20:00 September 4, General Walker had ordered the 1st Provisional Marine Brigade released from operational control of the 2nd Division effective at midnight, September 5. He had vainly protested against releasing the brigade, believing he needed it and all the troops then in Korea if he were to stop the KPA offensive against the Pusan Perimeter. At 00:15, September 6, the Marines began leaving their lines at Obong-ni Ridge and headed for Pusan. They would join the 1st Marine Regiment and 7th Marine Regiment in forming the new 1st Marine Division. This was done after a heated disagreement between Walker's command and MacArthur's command. Walker said he could not hold the Pusan Perimeter without the Marines in reserve, while MacArthur said he could not conduct the Inchon landings without the Marines. MacArthur responded by assigning the US 17th Infantry Regiment and later the US 65th Infantry Regiment to Walker's reserves, but Walker did not feel the inexperienced troops would be effective. Walker felt the transition endangered the Perimeter at a time when it was unclear if it would hold.\nThe American counteroffensive of September 3–5 west of Yongsan, according to prisoner statements, resulted in one of the bloodiest debacles of the war for a KPA division. Even though remnants of the KPA 9th Division, supported by the low strength KPA 4th Division, still held Obong-ni Ridge, Cloverleaf Hill, and the intervening ground back to the Naktong on September 6, the division's offensive strength had been spent at the end of the American counterattack. The KPA 9th and 4th divisions were not able to resume the offensive.\nAftermath\nThe KPA 4th and 9th Divisions were almost completely destroyed in the battles at Naktong Bulge. The 9th Division had numbered 9,350 men at the beginning of the offensive on September 1. The 4th Division numbered 5,500. Only a few hundred from each division returned to North Korea after the Second Battle of Naktong Bulge. The majority of the KPA troops had been killed, captured or deserted. The exact number of KPA casualties at Yongsan is impossible to determine, but a substantial amount of the attacking force was lost there. All of KPA II Corps was in a similar state, and the KPA, exhausted at Pusan Perimeter and cut off after Inchon, was on the brink of defeat.\nThe US casualty count at Yongsan is also difficult to know, as the division's scattered units were engaged all along the Naktong Bulge without communication and total casualty counts in each area could not be ascertained. The US 2nd Infantry Division suffered 1,120 killed, 2,563 wounded, 67 captured and 69 missing during its time at the Second Battle of Naktong Bulge. This included about 180 casualties it suffered during the First Battle of Naktong Bulge the previous month. American forces were continually repulsed but able to prevent the KPA from breaking the Pusan Perimeter. The division had numbered 17,498 on September 1, but was in excellent position to attack despite its casualties. The 1st Provisional Marine Brigade suffered 185 killed and around 500 wounded during the Battle of Pusan Perimeter, most of which probably occurred at Yongsan.\nOnce again the fatal weakness of the KPA had cost it victory after an impressive initial success. Its communications and supply were not capable of exploiting a breakthrough and of supporting a continuing attack in the face of massive air, armor, and artillery fire that could be concentrated against its troops at critical points. By September 8, the KPA attacks in the area had been repulsed.\nReferences\nCitations\nSources\n*\n*\n*\n*\n*\n*\n*\n*"
    }
  ]
}