{
  "content": [
    {
      "type": "text",
      "text": "# Battle Blaze\n\n| composer = Megumi MatsuuraMasaki Kase\n| released =\n| genre = Fighting\n| modes = Single player  Multiplayer\n| platforms = Super NES\n}}\nis a 1992 medieval fighting game released for the Super Nintendo Entertainment System by Sammy Studios. Players use swords, morningstars, knives, and other weapons to beat up their opponents. The player can either play in a colosseum or on a quest. The eventual goal is defeat the Dark Lord who lives in a castle in the sky.\nPlot\nA land known as Virg was under the command of a powerful king. Every king was selected at the \"Tournament of Champions\". A demon from Hell, was hell-bent on world domination, so he sent five phantoms to possess every combatant in the tournament. The demon turned the contenders into enemies where they would have them battle one on one (similar to battle royale). The phantoms possessed every contender except for one. As one phantom ambushed Durill, the strongest of the competitors, an unknown disease struck him. Durill ended up defeating the phantom, but collapsed due to mind poisoning. After he died, his son Kerrel vowed to avenge his father, and defeat the evil demon.\nCharacters\n*Kerrell (known in Japan as Faud) - This is the main hero of the game. He vowed to avenge his father, and destroy the dark lord.\n*Shnouzer (known in Japan as Shazzer) - This is the leader of the mountain beast pack. He is widely regarded as the most feared competitor, as he has good close-combat skills.\n*Adrick (known in Japan as Werleck) - The knight from Naxus, who relies on his long-reaching Dark Blade (known in Japan as Hell Blade).\n*Tesya (known in Japan as Filea) - An agile warrior from Flynn, who uses twin daggers as her weapon of choice.\n*Lord Gustoff - The half-orc ruler of a peaceful farm village, makes use of a morningstar/flail combination weapon.\n*Lang - The twin brother of Kerrell. He has the same ability set as his brother. Only appears in The Battle mode.\n*Autarch (known in Japan as Gilformoth) - The game's final boss, only encountered in The Hero mode. A powerful demon whose claws are as deadly as any sword. Seeks to wipe out the champions and conquer all of Virg. Not playable outside cheat mode.\nCover art\nThe illustration from the Japanese cover art was made by .\nDevelopment\nThe North American release was originally announced for October 1993, but did not hit shelves until January 1994. According to American Sammy, a combination of bugs in the game, Nintendo's \"lengthy approval process\", and American Sammy's move from California to Illinois caused the game to be delayed.\nReferences\nExternal links\n*[http://www.giantbomb.com/battle-blaze/3030-16573/images/ Promotional flyer (Super Famicom)]"
    }
  ]
}