{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Faesulae (225 BC)\n\n| map_type    = Italy\n| map_relief  = yes\n| map_size    =\n| map_marksize =\n| map_caption =\n| map_label   =\n| map_mark =\n| casus       =\n| territory   =\n|result=Gallic victory\n|combatant2=Roman Republic\n|combatant1=Gauls\n|commander1=Unknown\n|commander2=Roman Praetor\n|strength1=Unknown\n|strength2=Unknown\n|casualties1=Unknown\n|casualties2=6,000 killed\n}}\nThe Battle of Faesulae was fought in 225 BC between the Roman Republic and a group of Gauls living in Italy. The Gauls defeated the Romans, but later the same year, a decisive battle at Telamon had the opposite outcome.\nHistory\nA general call to arms was issued throughout Italy in the early months of 225 BC because of the growing threat of the Gauls to the Romans. Seventy thousand Samnites, Etruscans, Umbrians, Campanians, and Romans joined forces to meet the common threat that faced them to the North. Roughly a quarter of this huge force was called up for active service, while the rest was employed in garrison duty, or held back in reserve. One of the consuls, Gaius Atilius Regulus, who was fighting in Sardinia, received orders to return immediately without delay. The other consul, Lucius Aemilius Papus, with a full consular army, took up position at Ariminum, to guard the eastern coast route. Another army, composed of Sabines and Etruscans, and commanded by a praetor, advanced into Etruria, and it was here that the engagement took place. The Gauls, wishing to avoid an encounter with Aemilius, marched rapidly through the central passes of the Apennines, and, entering Etruria, passed on unopposed as far as Clusium, plundering and burning as they went. Here they were brought to a stand by the praetor, who had made a hasty retrograde movement on perceiving that the enemy had got between him and Rome. The Gauls then fell back toward Faesulae, leaving their cavalry to cover their retreat, and the Roman general, pursuing them incautiously, allowed himself to be drawn into an ambush and suffered a grave defeat. The Roman force was only saved from total destruction by the arrival of Aemilius Papus, who had left his position at Ariminum as soon as he learned that the Gauls were on the march to Rome.\nUnless there was another small town with the name Faesulae that later ceased to exist, the site of the battle of Faesulae is problematic: the distance between Clusium and Faesulae is 125&nbsp;km; a little too far for one night's march. But even a move of the Gauls in the direction of Faesulae (near Florence) is unlikely, as the Romans were in between. It is more likely that they moved a couple of miles in the direction of Telamon, where they laid a trap for the Romans.\nSee also\n* Roman Republican governors of Gaul\nReferences\nFurther reading\n* Polybius Histories Book 2(25)"
    }
  ]
}