{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Barcelona (512)\n\nin Aquitaine (507-509), triggers of the conflict for the Visigoth throne.\n| place             = Near Barcelona\n| partof            = Franco-Gothic War (507-511)\n| date              = 512\n| result            = Ostrogothic victory\n| combatant1        = Ostrogothic Kingdom\n| combatant2        = Visigothic rebels\n| commander1        = Ibbas\n| commander2        = Gesalec\n| strength1          = Unknown\n| strength2          = Unknown\n| casualties1        = Unknown\n| casualties2        = Unknown\n}}\nThe Battle of Barcelona in 512 was the culmination of the conflict for the Visigoth crown following the death of Alaric II, which pitted the supporters of the deposed king Gesalec against the Ostrogothic troops of General Ibbas, who supported the regency of Theodoric the Great in Hispania on behalf of his grandson Amalaric. The battle, fought near Barcelona, ended with a decisive victory for Ibbas, which eliminated any real possibility of Gesalec's restoration.\nBackground\nIn 507, the Franks of Clovis I, together with their Burgundian allies, defeated the Visigoths at the Battle of Vouillé and killed their king Alaric II. Meeting no resistance, Clovis marched on the Visigothic holdings in Gaul, advancing to besiege the remnants of the Visigothic army in Narbonne, where the new pretender to the throne, Gesalec, was in command, while threatening Carcassonne. It was then that Ostrogothic reinforcements sent from Italy by Theodoric the Great intervened, under the command of General Ibbas, who lifted the siege and secured Provence when a subordinate of Ibbas, Tuluin, also managed to break the Frankish siege of Arles in 508.\nClovis did not give up on his attempt to secure his kingdom an outlet to the Mediterranean Sea, and in 510 he ordered his forces to carry out another offensive on Arles, which was however repelled by Ibbas. After the expulsion of the Franks, Provence passed into the hands of the Ostrogoths and Theodoric found himself in a good position to overthrow Gesaleic, so he sent his general to take Carcassonne and Narbonne in 509, forcing the Visigoth to take refuge in Barcelona. Gesalec was able to escape and seek asylum in the Vandal kingdom of Thrasamund in North Africa, where he asked for help in regaining his status. The Vandal, fearful of the power accumulated by Theodoric, refused to lend him troops and sent him into exile in Aquitaine, where he was to maintain certain friendships but had to remain in hiding for a year. At that time Theodoric had proclaimed his grandson Amalaric king, son of Alaric II and an illegitimate daughter of the Gothic monarch of Italy. As Amalric was only five years old, Theodoric assumed his regency and had his army withdrawn from Visigothic territory, since Arles was declared the capital of the prefecture of Gaul in the Ostrogothic kingdom, governed by the prefect Liberius.\nBattle\nIn 512, Gesalec finally decided to raise an army in Aquitaine made up of his supporters and contingents of mercenaries, with whom he crossed the Pyrenees by the eastern passes. The campaign in Tarraconensis was short, because Ibbas inflicted a severe defeat on the exiled king 20 km from Barcelona.\nConsequences\nGesaleic retreated this time to the north, and after crossing Narbonensis attempted to penetrate into Burgundia, but was captured and killed while crossing the Durance River in 514, probably by Ostrogothic soldiers.\nReferences\nBibliography\n*\n*\n*\n*\n*\n*"
    }
  ]
}