{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Horodok (1655)\n\n| image             = Пам'ятний знак на честь битви під Городком.jpg\n}}\nThe battle of Gródek Jagielloński or battle of Horodok took place during the Russo-Polish War (1654–67) on 29 September 1655. Russian and Ukrainian Cossack forces under Vasily Borisovich Sheremetev and Bohdan Khmelnytsky engaged a Polish–Lithuanian army under Stanisław \"Rewera\" Potocki near Gródek Jagielloński, which at that time was part of Polish–Lithuanian Commonwealth's Ruthenian Voivodeship (now Horodok, Lviv Oblast, Ukraine). Polish forces were defeated and forced to retreat, losing their supplies to the Russians. The Russians advanced, besieging Lwow, and Potocki with the remains of his army was soon forced to surrender to the invading Swedes.\nIn August 1655, Russian-Cossack forces moved into Red Ruthenia, which at that time was one of few provinces of the Commonwealth still controlled by Polish forces, as in July of that year, Poland–Lithuania had been invaded by the Swedish Empire. Russian-Cossack forces were faced by a numerically inferior Polish Crown army commanded by Hetman Stanislaw \"Rewera\" Potocki. The Poles were supported by light Crimean Tatar cavalry, but their forces were inadequate to stop the Russians, and were steadily pushed westwards by the invaders. Near Grodek Jagiellonski Russian cavalry forced their opponent to fight among swamps and ponds.\nFirst Russian charge was repulsed, and Polish cavalry followed the retreating enemy, getting between two columns of Cossack infantry. Hetman Potocki ordered a retreat, which turned into panic. Potocki managed to regain the control of his army, but Russian-Cossack forces were too numerous, and despite desperate resistance, they managed to capture Polish camp, chasing retreating Poles as far as Jaworow.\nAfter the victory, Russians and Cossacks besieged Lwow: to save itself, the city paid an enormous sum of money. The invaders then headed to Lublin, reaching as far west as the Vistula near Pulawy and Kazimierz Dolny. To save his army from complete annihilation, Potocki surrendered to King of Sweden Charles X Gustav, on October 28, 1655.\nReferences\n*Karol Marcinkowski, Cień złotego cielca nad walczącą Rzeczpospolitą 1655 r., Nakładem i drukiem \"Straży,\", 1957, [https://books.google.com/books?id=6TsaAAAAIAAJ&q=1660+Gr%C3%B3dkiem+Jagiello%C5%84skim Google Print, p.51]\n*"
    }
  ]
}