{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Assietta__disambig_1\n\n| map_type    =Italy#Europe\n| map_relief  = yes\n| map_size    =\n| map_marksize =\n| map_caption =\n| map_label   =\n| territory   =\n| result            = Sardinian victory\n| combatant1        =  Sardinia\n| combatant2        =  France\n| commander1        = Giovanni di Bricherasio\n| commander2        = Chevalier de Belle Isle\n| strength1         = 7,000–15,000\n| strength2         = 25,000–40,000\n| casualties1       = 299 killed or wounded\n| casualties2       = 5,300–6,400 killed or wounded\n| campaignbox       =\n}}\nThe Battle of Assietta was a significant engagement of the War of the Austrian Succession and pitted a numerically superior French force of 25,000-40,000 men under the command of Louis Fouquet, Chevalier de Belle-Isle against a Sardinian army of 7,000-15,000 men led by Giovanni Bricherasio. The French were soundly defeated and their commander, Belle-Isle, killed during the course of the battle. The siege was part of the Italian campaign of the War of the Austrian Succession, in which Habsburgs and Bourbons contested for domination over Northern Italy and the various Italian states. The Kingdom of Sardinia joined the war on the side of the Pragmatic Allies in 1742 and rallied itself to Maria Theresa's cause. There were also concerns about growing French influence in its territories. The war in Italy had already been going on for seven years, and the Sardinian army had already suffered several defeats in the field, leading to them opting for a more defensive approach. The French led several expeditions in Italy during the war, combining their forces with the Spanish Bourbons to accomplish their political aims.\nBy 1747, the war was coming to an end, but the French were still interested in acquiring more influence in Italy, and so dispatched an army under the command of Belle-Isle to capture Colle dell'Assietta from the Sardinians. The French army organised into thirty-two battalions, encountered fortified Sardinian positions at the Susa Valley, and launched wave after wave of fruitless assaults on their fortifications. The French divided their forces into four columns and launched several assaults personally led by Belle-Isle. They were all repulsed with heavy casualties inflicted, and Belle-Isle himself was killed, whereupon a retreat was ordered. The Sardinians suffered only light casualties, while the French had over a fifth of their force killed or wounded. The Sardinian victory proved to be the last major battle in the Italian campaign of the war.\nBackground\nThe cause of the War of the Austrian Succession was Maria Theresa's alleged ineligibility to succeed to the hereditary lands of her father, Emperor Charles VI, because Salic law precluded royal inheritance by a woman. This became the key justification for the Kingdom of France and the Kingdom of Prussia, joined by the Electorate of Bavaria, to challenge Habsburg power. Maria Theresa was supported by the Kingdom of Great Britain, the Dutch Republic, the Kingdom of Sardinia and the Electorate of Saxony. Since 1739, Spain had been fighting the separate War of Jenkins' Ear with Britain, which primarily took place in the Americas. It joined the war in Europe, hoping to recapture its former possessions in Northern Italy, now held by Austria. Having previously re-gained the Kingdom of Naples in 1735, doing so would restore the territories the Spanish lost under the 1713 Treaty of Utrecht.\nIn the late phase of the War of the Austrian Succession, France had decided to eliminate the Sardinian army, which they considered a threat due to the strong strategic position the Sardinians held. King Louis XV of France had already dispatched forces into Sardianian territory, besieging Cuneo and engaging the Sardinians at Madonna dell'Olmo and Bassignana, winning both battles but gaining little strategic advantage overall. A French army comprising one hundred and fifty infantry battalions, seventy-five cavalry squadrons and two artillery brigades, under the command of Marshal Charles Louis Auguste, duke of Belle-Isle, and Marquis De La Mina, was dispatched into Italy. The two commanders had different views on how to conduct the campaign: Belle-Isle favoured menacing Turin directly via crossing the Alps, while his Spanish colleague instead wished to send troops to relieve the Austro-Sardinian siege of Genoa. Belle-Isle's ideas prevailed and the French troops occupied Antibes as well as the county of Nice. However, they were halted by the strong Sardinian defence of the southern Alpine passes. Belle-Isle's brother, the Chevalier de Belle-Isle, led an army of fifty infantry battalions, fifteen cavalry squadrons and numerous cannons, and advanced towards the northern Italian mountain passes.\nBattle\nThe French army was divided into two corps: one descended from the Moncenisio towards Exilles while the other advanced towards Fenestrelle from the Assietta Pass. The latter formed a bare plateau, at an altitude of 2,500 meters. Although he outnumbered the French in the area, Charles Emmanuel III of Savoy was forced to dispatch forces to defend all the passes into his country while the French could concentrate their forces and needed attack only one mountain pass to enter Sardinian territory. The decision was made by the French to advance through Assietta. The Sardinians had fortified the area with thirteen infantry battalions: nine were Sardinian, with the remaining being Austrian and Swiss battalions which were taken from the troops that had unsuccessfully besieged Genoa. French scouts had notified their commander that the Sardinians were fortifying the pass, and a decision to launch an attack immediately was taken. Numerous obstacles, redoubts and an eighteen foot high palisade had been built on the slope by the Sardinian defenders. The forces involved amounted to thirty two French battalions against thirteen Sardinian battalions. The French troops were divided into three columns with the center column pressing the attack and the flank columns launching various half-hearted attacks from the side.\nThe attacks began at about 16:30 in the afternoon. Despite the desperate attempts by the French soldiers and the personal show of valour of their officers, all four attacks were repulsed by the Sardinian forces with heavy losses inflicted upon their ranks. After five hours of battle, the French made the decision to retreat. The French commander, Chevalier de Belle-Isle, was killed while raising the French flag near the top of the slope. What ensued in the late afternoon was celebrated as the most one-sided victories of the war. Neither flanking columns engaged the Sardinians significantly enough to influence the catastrophe that was befalling the center column. These battalions, led by determined officers, struggled up the slope, disassembling the various man-made impediments as they proceeded, while suffering withering musket fire from concealed and protected Sardinian hideouts, which exacted the heavy toll on the flanking columns. Four separate times the French faltered before the onslaught; each time they returned to the struggle. The living climbed over the dead as they tried to surmount the palisades. Sardinian defenders rained bullets and rocks down on the relentless blood-drenched attackers. A retreat, which proved more orderly then the previous butchery, was portended. The one-sided character of the slaughter was apparent. French casualties totaled 6,400 killed and wounded including 400 officers, and for the first and the only times in the war the majority of them, 3,700, were fatalities while only 299 Sardinians were killed or wounded.\nAftermath\nThe beaten French troops retreated from the field. This would be their last engagement on the Italian front as they entirely withdrew from Italy after it, although minor skirmishes continued between Hapsburg and Italian forces and the remaining Franco-Spanish troops in the region. The body of Belle-Isle, carefully preserved during the march home, was buried in the Embrun Cathedral with full military honours. His death was immortalised in a painting, depicting his moment of death when attempting to plant the French flag at the top of the Sardinian redoubt. The valour of the Sardinian troops became household news in Europe, and King of Prussia, Frederick II, upon hearing of news of the Sardinian defence at Assietta, declared that, if he had such valorous troops under his command, he could easily become King of Italy. The following year, by the terms of the Treaty of Aix-la-Chapelle, the Kingdom of Sardinia obtained the territories around Lake Maggiore and Ticino.\nThe battle of Assietta, from a strategic point of view was a stalemate in regards to the military operations that were being conducted in Italy, while from a tactical point of view, it was a clear success that made apparent the failure of combat tactics employed by the French troops under Belle-Isle, which primarily consisted of massed bayonet assaults in column formations without bothering to ensure the columns had sufficient support in the form of covering fire.\nAfter the war, a long peace reigned in Italy between the various Italian states until the French Revolution and the ensuing French Revolutionary and Napoleonic Wars.\nSee also\n*War of the Austrian Succession\n*Kingdom of Sardinia\n*Kingdom of France\nReferences\nBibliography\n*Browning, Reed (2008). The War of the Austrian Succession. St. Martin's Griffin.\n*\n*\n*"
    }
  ]
}