{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Berezhany\n\n(See Aftermath)\n| date              = 16–21 June 1919\n| combatant1        =  West Ukrainian People's Republic\n| combatant2        =  Second Polish Republic\n| commander1        =  Oleksander Hrekov Osyp Mykytka Arnold Wolf\n| commander2        =  Władysław Jędrzejewski Zygmunt Zieliński\n| units1            =  I Corps II Corps III Corps\n| units2            =  3rd Legions Infantry Division\n| strength1         = 20,000 men\n| strength2         = 4,000 men\n| casualties1       = Heavy }}\n| casualties2       = Heavy\n* 76 French officers killed\n| partof            = Polish–Ukrainian War\n| territory         = * UGA seizes Berezhany\n* Ukrainian offensive towards Lviv halted\n}}\nThe Battle of Berezhany was a five-day battle over the city of Berezhany in Eastern Galicia, which was the key point of Polish defence. The battle took place between the Ukrainian Galician Army from one side and a several Polish regiments from the other. This battle was a turning point of the entire Polish-Ukrainian war, as it weakened UGA to the phase that it could not continue its offensive.\nBackground\nOn 7 of June, Ukrainian Galician Army launched an offensive, and as of June 15, it recaptured Chortkiv, Buchach, Terebovlya, Tarnopol and Pidhaytsi. After the series of defeats, Polish commandership decided to stop the Ukrainian offensive near the city of Berezhany.\nOleksandr Hrekov's plan was to encircle and destroy the Polish garrison in the city, which would allow him to continue the offensive towards Lwów.\nStrenght of parties\nAll corps of the UGA were involved in the battle, and the total number of Ukrainian soldiers involved in a battle was approximately 20 thousand soldiers.\nMeanwhile, the town was controlled by 3rd Legions Infantry Division, and the total number of soldiers on the Polish side was approximately four thousand.\nBattle\nOn 16 of June, the UGA began a series of an unsuccessful attacks on Berezhany and on the Polish defensive positions. Ukrainians also launched an attacks on mountain Łysonia, which changed hands several times. At the same time, Ukrainian artillery shelled Polish positions, however despite the attacks, Polish forces counterattacked and recaptured the area they previously lost. Later unsuccessful attacks on the city by the II Corps occurred on 17 and 18 of June and were repelled, although Ukrainians managed to defeat the Poles near Zboriv. On the 18 of June, a small reinforcement was sent from Lwów. On June 19, UGA launched an offensive with goal of capturing Berezhany. Ukrainians captured Łysonia and shelled the city with machine guns from it. Attacks that occurred a day later, on 20 of June, were unsuccessful. However, after days of fighting, a breach was created in a Polish frontline north of the city, which forced the Polish army to eventually withdraw from the city. On 21 June, Zygmunt Zieliński ordered to withdraw from the city and on the same day it was captured by the Ukrainian Galician Army, thus ending the 5-day battle for the city.\nAftermath\nThe battle was a turning point of the Polish–Ukrainian War. The Ukrainians achieved a pyrrhic victory in the battle and captured the city. However, Poles managed to evactuate most of the ammunition that was needed by the Ukrainians and to stop a Ukrainian offensive towards Lviv, which was of the reasons of an eventual defeat of the Ukrainian Galician Army in the war. 76 French mercenaries were killed during the battle.\nNotes\nReferences\nBibliography\n*  }}\n*  }}"
    }
  ]
}