{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Francavilla__disambig_1\n\n|combatant2  = Spanish Empire\n|commander1  =Count of MercyFriedrich von Seckendorff\n|commander2  =Marquis of Lede\n|units1      =\n|units2      =\n|strength1   =21,000\n|strength2   =29,000\n|casualties1 =3,100 killed or wounded\n|casualties2 =2,000 killed or wounded\n|notes       =\n|campaignbox =\n}}\nThe Battle of Francavilla was fought on 20 June 1719 near the city of Francavilla di Sicilia in Sicily, Italy between Spain and Austria as part of the War of the Quadruple Alliance.\nPrelude\nAfter the destruction of the Spanish fleet in the Battle of Cape Passaro in August 1718, the invading army of 30,000 men under the Marquis of Lede were isolated on the island of Sicily. In 1718, the Austrians still had most of their troops in the Balkans until the conclusion of the Austro-Turkish War of 1716–18 in the Treaty of Passarowitz on 21 July 1718.\nA first Austrian attempt to attack the Spanish from Naples had failed, when they were defeated in the Battle of Milazzo on 15 October 1718.\nThey did succeed to hold a small bridgehead around Milazzo.\nBy June 1719 the Austrians had moved an experienced army of 24,000 men under the Count de Mercy from the Balkans to the south of Italy, where they were sailed across the Messina Strait by the British fleet.\nThe Spanish had abandoned the siege of Milazzo and pulled back to a more favorable position around the village of Francavilla di Sicilia, where they were covered by a river and a monastery on a hill.\nBattle\nOn the morning of 22 June, the Austrians attacked the fortified Spanish positions in three columns. The first column attacked the fortified village of Francavilla three times, but was pushed back every time. The second column succeeded in conquering the trenches on the foot of the monastery hill, but were stopped by the second Spanish line. The Count de Mercy was wounded in this phase of the battle. The third column attacked the Spanish left flank, drove them off the San Juan hill, but were themselves pushed back under heavy Spanish fire and had to take cover in a crevice, suffering many casualties including general Holstein, who led the attack.\nThe Spanish artillery under the Marquis of Villadarias played a crucial role during the battle, causing many casualties and confusion in the Austrian army.\nThe battle raged until evening, when a counterattack by the Spanish cavalry removed all hopes of an Austrian victory. The Austrians withdrew, leaving 3,100 dead and wounded. The Spanish losses were 2,000 dead and wounded.\nAftermath\nThe Marquis de Lede didn't pursue the Austrians, giving them the opportunity to recover from this defeat. The Austrians later besieged Messina, which fell after 9 enemy attacks.\nThe war continued until the peace was signed in the Treaty of The Hague (1720) on 17 February 1720. The Spanish troops had to evacuate Sicily, and were transported back to Spain by the British Navy. The island of Sicily became an Austrian possession.\nReferences\nBibliography\n*Chandler, David G. The Art of Warfare in the Age of Marlborough. Spellmount Limited, (1990).\n*[https://web.archive.org/web/20080521140806/http://www.ingenierosdelrey.com/guerras/1717_cuadruple/1719_francavilla.htm BATALLA DE FRANCAVILLA (20 de junio de 1719)]"
    }
  ]
}