{
  "content": [
    {
      "type": "text",
      "text": "# Battle of the Cumberland Gap (1863)\n\n|result=Union victory\n|combatant1=  United States (Union)\n|combatant2=  CSA (Confederacy)\n|commander1=Ambrose E. Burnside\n|commander2=John W. Frazer\n|strength1=3 brigades\n|strength2=2,400\n|casualties1=0\n|casualties2=2,300 surrendered\n}}\nThe September 7–9, 1863 fall of the Cumberland Gap was a victory for Union forces under the command of Ambrose Burnside during his campaign for Knoxville. The bloodless engagement cost the Confederates 2,300 men captured and control of the Cumberland Gap.\nBackground\nMajor General Ambrose Burnside, commander of the Department and Army of the Ohio, began to advance against Knoxville, Tennessee. Burnside left Cincinnati, Ohio in mid-August 1863. The direct route ran through the Confederate-held Cumberland Gap. Burnside had been delayed in earlier attempts to move out against Knoxville and thus chose not to spend the time to force a passage of the gap. Instead he detached one brigade under Colonel John F. DeCourcy to pose a threat to Brigadier General John W. Frazer's 2,300 man garrison, while the rest of the army bypassed to the south over 40 miles in rugged mountainous terrain.  DeCourcy had previously led a brigade in the 1862 operations against the Cumberland Gap under George W. Morgan.\nDespite this, Burnside made a rapid advance on Knoxville. Many of the Confederates in eastern Tennessee had been withdrawn for the upcoming Battle of Chickamauga, leaving only two brigades under General Sam Jones (including Frazer's). Having successfully occupied Knoxville on September 2, Burnside could now return his attention to the Cumberland Gap.\nBattle\nFrazer and his 2,300-man garrison had little combat experience, yet they had the benefit of a strong natural defense. Frazer's men supplemented this by digging their own trenches. General Simon B. Buckner had given Frazer orders to hold the gap at all cost, yet when Buckner and all his troops were redeployed, no contingency had been formulated for retreat and therefore Frazer continued following his orders from Buckner to hold the gap. DeCourcy's brigade threatened the Confederates from the north, but his brigade alone was not enough to force Frazer out of the gap. Burnside dispatched a second brigade under Brigadier General James M. Shackelford. Shackelford approached from the south and, on September 7, asked for Frazer's surrender. There were still not enough Union troops to convince Frazer to surrender. An ineffectual exchange of artillery followed but that evening Union soldiers captured Gap Springs, the Confederate water supply. On September 8 Burnside personally left Knoxville with a brigade under Colonel Samuel A. Gilbert and marched 60 miles in just over a day.  Meanwhile, both DeCourcy and Shackelford sent messages demanding surrender. Attempting to buy time, Frazer met with the two Union commanders separately, but rejected surrender demands from both.\nAround 10:00&nbsp;a.m. on September 9, Burnside sent a message to Frazer stating he now had a large enough force to carry the gap by storm. The large Union force, little combat experience and low morale (after news of Vicksburg and Gettysburg) all factored into Frazer's decision to surrender. Around 3:00&nbsp;p.m. Frazer agreed to an unconditional surrender of all the Confederates guarding the Cumberland Gap.  Between 100 and 300 men managed to escape through DeCourcy's lines after the surrender had taken place, but the rest of the soldiers, arms, 14 pieces of artillery and the strategic location were now in Union control. This was the last major operation against the Cumberland Gap and it would remain in Union hands for the rest of the war.\nOpposing forces\nUnion\nDepartment of the Ohio - Maj. Gen. Ambrose E. Burnside\n*Independent Brigade, IX Corps - Colonel John F. DeCourcy\n**8th Tennessee Cavalry\n**9th Tennessee Cavalry\n**11th Tennessee Cavalry\n**86th Ohio Infantry\n**129th Ohio Infantry\n**22nd Ohio Battery\n*3rd Brigade, 4th Division, XXIII Corps - Brig. Gen. James M. Shackelford\n**2nd Ohio Cavalry\n**7th Ohio Cavalry\n**9th Michigan Cavalry\n**2nd Tennessee Mounted Infantry\n**1st Tennessee Battery\n**11th Michigan Battery\n*1st Brigade, 3rd Division, XXIII Corps - Colonel Samuel A. Gilbert\n**44th Ohio Infantry\n**100th Ohio Infantry\n**104th Ohio Infantry\nConfederate\n*5th Brigade, Army of Tennessee - Brig. Gen. John W. Frazer\n**55th Georgia Infantry Regiment - Major Daniel S. Printup\n**62nd North Carolina Infantry Regiment - Major Bryan G. McDowell\n**64th North Carolina Infantry Regiment - Lieutenant Colonel William N. Garrett\n**64th Virginia Infantry Regiment - Colonel Campbell Slemp\n**1st Tennessee Cavalry Regiment - Colonel James E. Carter\nSee also\n* List of battles fought in Kentucky\nNotes\nReferences\n*Eicher, John H., & Eicher, David J., Civil War High Commands, Stanford University Press, 2001, .\n* Korn, Jerry, and the Editors of Time-Life Books. The Fight for Chattanooga: Chickamauga to Missionary Ridge. Alexandria, VA: Time-Life Books, 1985. .\n*[https://dlxs2.library.cornell.edu/cgi/t/text/pageviewer-idx?c=moawar;cc=moawar;idno=waro0054;node=waro0054%3A5;frm=frameset;view=image;seq=310;page=root;size=s Official Records of the War of the Rebellion]"
    }
  ]
}