{
  "content": [
    {
      "type": "text",
      "text": "# Battle of the Windward Passage\n\n|combatant2=\n|commander1= Charles Holmes\n|commander2= Unknown\n|strength1=2 frigates1 post ship\n|strength2=4 frigates1 corvette3 merchant ships\n|casualties1=light\n|casualties2=200 casualties3 frigates lost1 corvette lost3 merchant ships lost\n|campaignbox=\n}}\nThe Battle of the Windward Passage was a small naval action between French and British fleets that occurred on 17 to 19 October 1760 during the Seven Years' War. The action took place in the Caribbean between Cap-Français and Eastern Cuba and resulted in a British victory.\nAt dawn on 17 October 1760, Admiral Charles Holmes in the 50-gun , Captain Coningsby Norbury, took , Samuel Uvedale, and the 20-gun , Frederick Lewis Maitland, to intercept a French convoy they had sighted in the Windward Passage. The convoy was escorted by the 32-frigates Sirène, Duc de Choiseul, Prince Edward, and Fleur de Lys, and the 20-gun corvette Valeur.\nThe British gave chase but light winds slowed hampered them so it was evening before the lead ship Boreas could engage Sirène. French fire disabled Boreas aloft with the result that Boreas could not engage Sirène again until the following afternoon. Boreas emerged victorious from the engagement, capturing Sirène, which suffered about 80 men killed and wounded, most of whom died later; Boreas lost only one man killed and one wounded.\nThe next day Lively, using her sweeps, caught up at daybreak with the rearmost French vessel, Valeur. She had a crew of 160 men under the command of a Captain Talbot. Lively overhauled her off the eastern tip of Cuba and pounded her into submission after an engagement of 90 minutes. Lively had two men killed but no wounded; Valeur had 38 killed and 25 wounded, including her captain, master, and boatswain.\nAt the same time Hampshire, off the coast of Sainte Domingue, chased the frigate Prince Edward on shore where the 180 crewmen under the command of Captain Dubois set fire to her, causing her to blow up. Duc de Choiseul, with 180 men under the command of Captain Bellevan, escaped into Port-de-Paix. Fleur de Lys, with 190 crewmen under the command of Captain Diguarty, was found in an unprotected bay to leeward on 19 October; her crew scuttled her to prevent capture by Hampshire. The British also captured three merchant frigates – two carried cargoes of sugar and indigo and had only been a day out of Cap-Français.\n, Boreas, , and , shared by agreement in the prize money for Sirene, Valeur, the merchant ships Maria, Elizabeth, and Pursue.\nSee also\n* Great Britain in the Seven Years' War\nReferences\nNotes\nCitations\nBibliography\n*\n*\n*"
    }
  ]
}