{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Lokot\n\nLokot Autonomy\n*People's Militia\n| combatant2        =  Soviet Partisans\n| commander1        =  Konstantin Voskoboinik\n| commander2        =  Alexander Saburov\n| strength1         = 350 militiamen\n| strength2         = A few hundred\n| casualties1       = 50 killed\n| casualties2       = 80 killed\n| image             = Lokot republic map.png\n| caption           = Map of the Lokot Autonomy\n| partof            = Eastern Front (World War II)\n| campaignbox       =\n| coordinates       =\n}}\nBattle of Lokot, was a partisan attempt to capture the capital of the Lokot Autonomy - Lokot. The battle took place during the night between the 7th and 8 January 1942. The battle was a victory for the Lokot Autonomy.\nBackground\nThe Lokot Autonomy was established in 1941, after the Germans entered the Soviet territory. It was a collaborationist semi-autonomous state led by Bronislav Kaminski. Its army was mostly known for fighting partisans during World War II, in which it had been very effective, according to the Germans.\nTheir anti-partisan operations have inflicted heavy casualties against partisans. Some sources claiming they killed around 1584 partisans, and capturing 1568 too. Bronislav Kaminski created Lokot's People Militia in order to maintain order in said territory. The partisan forces of Alexander Saburov have been ordered to wipe out the Lokot Autonomy in \"one blow\".\nBattle\nThe Partisans led by Alexander Saburov left their camp in the night between 7–8 January and started marching towards Lokot, the capital of Lokot Republic. The People's Militia of the Lokot Autonomy did not expect any attacks, and most of their army was sleeping.\nAs the first gunshots were fired, the soldiers of the Lokot Autonomy quickly woke up, dressed up and went outside to defend the city from the attack. Despite the sudden ambush, the Lokot army quickly organised and started gaining advantage in the battle, pushing the partisans out of the city in the same night that the battle begun in.\nKonstatin Voskoboinik - Starosta of the Lokot Autonomy was killed in the battle.\nAftermath\nThe battle did not make a decisive change in the region, but forced the partisans to retreat, and led to no partisan attempts to take the city in the future. It did boost the local support and propaganda for the Lokot autonomy.\nReferences\nFurther reading\n[https://royallib-com.translate.goog/book/gribkov_ivan/hozyain_bryanskih_lesov.html?_x_tr_sl=ru&_x_tr_tl=en&_x_tr_hl=en&_x_tr_pto=sc Ivan Gribkov, \"Master of the Bryansk forests\", 2008]\n[https://www.researchgate.net/publication/323086201_The_'Lokot'_Republic'_and_the_RONA_in_German-Occupied_Russia_1941-1943 Alan Donohue, \"The ‘Lokot’ Republic’ and the RONA in German-Occupied Russia, 1941–1943\", January 2018]"
    }
  ]
}