{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Hunayn__disambig_1\n\n}}\n| combatant1        = First Islamic State\n| combatant2        = Qays  Hawazin  Thaqif  Nasr  Jusham  Sa'd bin Bakr  Bani Hilal  Bani 'Amr bin Amir  Bani 'Awf bin Amir   Banu Sulaym\n| commander1        = Muhammad Ali (standard bearer)Abu Bakr  Umar  Al-Abbas ibn Abd al-Muttalib  Khalid ibn al-Walid  Zubayr ibn al-Awwam  Abu Sufyan ibn Harb  Abu Qatada al-Ansari\n| commander2        = Malik ibn Awf  Dorayd bin Al Soma  Abu al-A'war\n| strength1         = 12,000\n| strength2         = 20,000\n| casualties1       = 4 killed\n| casualties2       = 70 killed from Hawazin 300 killed from Thaqif many killed from Sulaym6,000 captured\n| combatant3        =\n| casualties3       = 24,000 camels\n40,000 goats\n160,000 dirhams in silver\n}}\nThe Battle of Hunayn () was a conflict between the Muslims of the Islamic prophet Muhammad and the tribe of Qays in the aftermath of the conquest of Mecca. The battle took place in 8 AH () in the Hunayn valley on the route from Mecca to Taif. The battle ultimately ended in a decisive victory for the Muslims, and it is one of the few battles mentioned by name in the Quran, where it appears in Surat at-Tawbah.\nPreparations\nBackground\nThe Hawazins had been long-standing enemies of Meccans. They were located north-east of Mecca and their territory sat beside the trade route to Al-Hirah in Iraq. The Hawazins were allied with the Thaqifs, which had settled in Ta'if, a town south-east of Mecca whose trade routes ran through Hawazin territory. The alliance had engaged in several wars probably concerning trade routes between Ta'if and Mecca. Given this history they saw Muhammad as another powerful Quraishi leader who had come to lead his people. They thought among themselves that a war with Muslims was imminent and that the once-persecuted minority of Muslims had gained the upper hand against their non-Muslim Arab enemies, and they may have wanted to take advantage of the likely chaos in Mecca after the Muslim takeover. Some tribes favoured fighting him and the Muslims. Ahead of these were the tribes of Hawazin and Thaqif. According to the Muslim scholar Safiur Rahman Mubarakpuri \"They thought that they were too mighty to admit or surrender to such a victory\". So, they met Malik bin 'Awf An-Nasri and made up their minds to proceed fighting against the Muslims. Malik persuaded other tribes to fight and gathered them before him. The confederation of tribes consisting of Nasr, Jusham, Sa'ad bin Bakr, Bani Hilal, Bani 'Amr bin Amir and Bani 'Awf bin Amir gathered at Autas along with the Thaqif and Hawazin.\nOn that day Muhammad had twelve thousand armed soldiers under his standard. Ten thousand of them were those who had accompanied him from Medina and had taken part in the conquest of Mecca, and the other two thousand were from amongst Quraysh, who had embraced Islam recently. The command of this group rested with Abu Sufyan. In those days such an army was hardly found anywhere and this numerical strength of theirs became the cause of their initial defeat. It was because, contrary to the past, they prided themselves on the large number of their soldiers and ignored military tactics. When Muslim soldiers including the new Meccan converts who saw their own large numbers they said: \"We shan't at all be defeated, because our soldiers far outnumber those of the enemy.\nSpying\nThe Hawazin and their allies, the Thaqif, began including their forces when they learned from spies that The Prophet Muhammad and his army had departed from Medina to begin an assault on Mecca. The confederates apparently hoped to attack the Muslim army while it besieged Mecca. The Prophet Muhammad, however, uncovered their intentions through his own spies in the camp of the Hawazin, and marched against the Hawazin just two weeks after the conquest of Mecca with a force of 12,000 men. Only four weeks had elapsed since the Muslim forces had left Medina to conquer Mecca.\nCourse\nOn Wednesday night, the tenth of Shawwal, the Muslim army arrived at Hunain. Malik bin 'Awf, who had previously entered the valley by night, gave orders to his army of four thousand men to hide inside the valley and lurk for the Muslims on roads, entrances, and narrow hiding places. His orders to his men were to hurl stones at Muslims whenever they caught sight of them and then to make one-man attacks against them. When Muslims started camping, arrows began showering intensely at them. Their enemy's battalions started a fierce attack against the Muslims, who had to retreat in disorder and utter confusion. It is reported that only a few soldiers stayed behind and fought, including Ali bin Abu Talib, the standard bearer, Abbas ibn Abd al-Muttalib, Fadl ibn Abbas, Usamah, and Abu Sufyan bin al-Harith\nIbn Kathir writes that according to Ibn Ishaq, Jabir ibn Abdullah, who witnessed the battle, the Muslim army were panicked by a surprise attack from the enemy and many men fled the battlefield. However, a group of Muhajirun stood firmly and defended the Prophet on the battlefield. There were only 8 men who did not leave the Battle field. Ali ibn Abi Talib, Abdullah Ibn Mas’ud, Abbas ibn Abd al-Muttalib, Abu Sufyan ibn al-Harith, Fadl ibn Abbas, Rabi' ibn al-Harith, Usama ibn Zayd and Ayman ibn Ubayd. Ayman ibn Ubayd was killed that day whilst defending the Prophet Muhammad.\nProphet Muhammad stood firmly in the intense battlefield sitting on his ride and prayed to Allah to send help and called his people to return to the battlefield. He said \"I am the Messenger of Allah. I am Muhammad, the son of Abdullah.\" Later Muslims returned to the battlefield. Muhammad, then picking up a handful of earth, hurled it at the faces of their enemies while saying: \"May your faces be shameful.\" Their eyes were thick with dust and the enemy began to retreat in utter confusion, according to the Muslim scholar Safi-ur-Rahman Mubarakpuri.\nAfter the enemy was defeated. About seventy men of Thaqif alone were killed, and the Muslims captured all their riding camels, weapons and cattle. The Quran verse 9:25 was also revealed in this event according to Muslim scholars:\n}}\nSome of the enemies fled, and Muhammad chased after them. Similar battalions chased after other enemies, Rabi'a bin Rafi' caught up with Duraid bin As-Simmah who was an old man and killed him. Durayd was an important asset of the pagan forces due to his great number of experiences in battle and knowledge of terrain and war tactics.}}\nAftermath\n, Hunayn]]\nBecause Malik ibn Awf al-Nasri had brought the families and flocks of the Hawazin along, the Muslims were able to capture huge spoils. 6,000 prisoners taken and 24,000 camels were captured. Some Bedouins fled, and split into two groups. One group went back, resulting in the Battle of Autas, while the larger group found refuge at At-Ta'if, where Muhammad besieged them. William Montgomery Watt states that Muhammad took on the role as the hero of Meccans by facing their Bedouin arch-enemies, the Hawazins and the Thaqifs of the city of Al-Ta'if.\nIslamic primary sources\nThe event is mentioned in the Hadith collection Sahih Bukhari as follows:\n}}\nThe event is also in Imam Maliks Al-Muwatta as follows:\n}}\nSee also\n* Adnanites\n* Islam and violence\n** Military career of Muhammad\n*** List of expeditions of Muhammad\nReferences\nExternal links\n*"
    }
  ]
}