{
  "content": [
    {
      "type": "text",
      "text": "# Battles of Acapulco\n\n| place       =Acapulco, Guerrero, Mexico\n| coordinates =\n| result      = French victory, city evacuation, three forts rendered unoperational\n| combatant1  =  Mexican Republicans\n| combatant2  =  French Empire\n| combatant3  =\n| units1      = Southern Army\n| units2      = French naval division of the Pacific ocean\n| units3      = Pacific Squadron\n| commander1  = Diego Álvarez BenítezJuan ÁlvarezLuis Ghilardi\n| commander2  = Captain Eugène Mathurin Marie Le Bris DurumainRear Admiral Adolphe Charles Émile Bouët\n| commander3  = John Augustus Sutter, Jr.\n| strength1   = ~Dozen garrison\n| strength2   = 4 men-o-wars100 marines\n| strength3   = Warship Saranac\n| casualties1 = 12–13 dead\n| casualties2 = Possibly none\n| casualties3 = Possibly none\n| notes       = Americans remained neutral. According to the accounts Don Juan Sutter raised the American flag onto a boat and sailed to the French flagship Pallas across the cannon fire. He convinced Admiral Bouet to stop the shelling of civilian houses.\n}}\nThe Battle of Acapulco were a series of battles during the Second French intervention in Mexico. Acapulco was a key port of the Pacific trade routes and thus changed hands several times in the course of the Franco-Mexican War. In this period, the population of the city had decreased from 6000 to 2000.\nFirst battle\nJuan Álvarez and a group of Indian guerrillas were still in control of Guerrero as well as Acapulco, which were not reached by the French army in the early stages of the intervention. On the morning of January 8, 1863, a French war steamer, the Diamant, anchored in the Acapulco port. Captain Le Bris asked for General Diego Álvarez, son of Juan Álvarez, and made several demands: that the Diamant be allowed to take on coal and water, that the General officially denounce the anti-French statements of the Italian-born Mexican officer Luis Ghilardi published in a local newspaper last year, which resulted in the repelling of the French warship La Bayonnaise, the removal of Ghilardi from his position and that all fort defenses be dismantled on sight. On the following day, an apology was sent back, but the first two demands were declined, and the city began its preparations against the expected attack. At ¾9 am on the 10th, a squadron under Rear-Admiral Bouët, consisting of the Diamant, the war steamer Pallas, and two corvettes, the Bayonnaise and the Galathée, approached the bay and was immediately opened fire at the forts. The forts returned the fire, and after one hour of constant barrage, the artillery of Fort Guerrero was eliminated. Ten minutes later, Fort Iturbide was silenced, and at ten in the morning, Fort Galeana had the same fate. Fort Álvarez still actively exchanged shots with the fleet, though the Mexican firing range was half of that of the French. During the bombardment, several French shells also ripped into the town, until an American envoy objected to it, and thus it ceased.\nThe next day at 6 o'clock, the siege of Fort Álvarez continued into the afternoon when the ships withdrew from its range. Their fire was returned effectively from one of the forts by Luis Ghilardi  and his company. Some of the bigger caliber guns did significant damage to the flagship Pallas, which almost sank in the clash. The bombardment of Acapulco by the French Pacific fleet lasted for one more day, and shortly thereafter, a squadron of one hundred sailors marched into Acapulco on January 16 and fired bullets into the town for three days, which was deserted at that time except for the local garrison that lost some men in the skirmishes. Finally the French spiked some of the fort guns, throwing a number into the sea and returned to the ships and left the bay to Siguantanejo, where they assessed the condition of Pallas and came to the conclusion that it was hit by about 15–16 shells in the hull and moved to Mazatlán dockyard for repair.\nSecond battle\nMexican Republicans\n|combatant2= French Empire\n|combatant3= United States\n|units1=Southern Army\n|units2=Algerian Riflemen Battalion, French naval division of the Pacific ocean\n|units3=Pacific Squadron\n|commander1=Rafael Solís\n|commander2=Adolphe Charles Émile Bouët\n|commander3=Charles Henry Bell\n|strength1=581 men\n|strength2=860 men5 vessels\n|strength3=Warship Saginaw\n| casualties1 = 581 POWs\n| casualties2 = Possibly none\n| casualties3 = Possibly none\n|notes = Americans remained neutral. US Navy only observed the blockade and defended its trade interests but also protected the city from looting during the interregnum.\n}}\nThe second battle of Acapulco was preceded by a three-month blockade implemented by French naval division of the Pacific Ocean and ordered by the French Consul of San Francisco in March 1864. The city surrendered on June 3, and the French troops entered the town without resistance. The French captured three smaller boats and relieved the siege allowing American ships to dock in the harbor unless they unload passengers or goods. Admiral Bouët sent for a garrison of Algerian Riflemen Battalion of 474 men from Vera Cruz in May and they took the city on June 3–4. They pursued the retreating republicans to Puebla Nuevo where they clashed a smaller force of 200 soldiers, killing 50 of them and capturing four cannons. The Algerian Battalion had four men injured. They pushed forward along the road to Los Cajones, where they were stopped by the Liberals and lost their commander in the fight. They fled back to Acapulco where they strengthened the forts with guns and assigned a warship to guard the port.\nFirst evacuation\nThe city was beleaguered from the start, cutting all provision to relieve the garrison of 250 of the famine. In June 1864 General Juan Vicario attempted to break through the siege by 3000 Mexicans of Álvarez to the city but were seriously defeated and gave up that last effort. Álvarez fired bullets onto Acapulco as a sign of superiority The French Admiral issued an order to evacuate Acapulco that was due to come into effect on December 11, 1864. Three French vessels were in port ready to sail for Mazatlán, with about 200 refugees, who feared possible revenge from the Mexican forces. A representative group of foreign residents met with General Álvarez, who assured them of protection of person and property. Despite such assurance, the lack of confidence in the Mexican regulars led to a mass emigration of this group.\nThe  was in port as well as the steamship Golden Age to monitor events. The evacuation was carried out by Captain Thomas Louis Le Normant de Kergrist, while Commodore Poor representing the American Navy offered 20 men to guard those inhabitants of the city who feared their safety.\nThird battle\n|result= Imperial victory, city surrender\n|combatant1= Mexican Republicans\n|combatant2= Mexican Empire French Empire\n|units1=Southern Army\n|units2=Manzanillo detachment, French Navy\n|commander1= Diego Álvarez Benítez\n|commander2= General Apolonio Montenegro\n|strength1=4,000 (Sacramento Daily Union est.)1,500 (New York Times est.)(withdrawn)\n|strength2=400 soldiers, two French vessels\n| casualties1 =\n| casualties2 =\n}}\nThe success obtained by the Liberals in the state of Michoacán in the first half of 1865 had given several anti-imperialist party leaders the idea to push the center of resistance closer to Mexico and thus to trigger and benefit more of the local uprisings in the region. Even the high clergy devoted supporters of the Empire agreed on the restoration Santa Anna.\nFrench intelligence tracked the outlines of the planned movement; Santa Anna was to land on the coast from Vera Cruz or on the Pacific; the guerrillas in Michoacán, the Guerrero state Indians led by Álvarez, and the possibly available corps of Porfirio Díaz stationed in the State of Oaxaca could have easily launched a general insurrection, which could have led to the dethronement of Maximilian. Santa Anna was working on this plan with passion never seen before. He chose one of his nephews to be his agent in Mexico. He declared that he would devote all his fortune of 20 million francs to the \"holy war\". He purchased 4000 carbines, 4000 pistols, and a dozen cannons from the United States and also hired an American frigate to sail to St. Thomas with him on board. Under these circumstances it was vital for the Imperialists to reoccupy Acapulco. Two of the ships of their squadron, Victoire and Lucifer, in Manzanillo took four hundred Mexican troops under the command of General Apolonio Montenegro, and on September 11, landed without opposition at Acapulco. The city was almost entirely abandoned by its inhabitants. Marshall sent scouts to Guerrero, and opened a secure road between Rio Mescala and Cuernavaca. Although no permanent presence of French troops was established in the area south of Mexico as the nearest Mexican Imperialist brigade of la Peña (former brigade \"Vicario\") was only in the vicinity of the valley of Rio Mescala.\nSecond evacuation\nImmediately after the third occupation, General Álvarez cut off all communication with the mainland and prevented any supplies or reinforcements from reaching the city. Colonel Montenegro, the commander of Acapulco, had been ordered to hold himself in readiness to evacuate Acapulco right after the completion of the evacuation of Mazatlán, which it was supposed would take place about October 15, 1866. His orders were to begin the evacuation 24-hours after receiving the notice and to destroy all stores and supplies that could not be carried on board. However French troops requested a delay from the Republicans in February 1867, while the commanding Imperialist General issued an emergency tax of $20,000 exclusively on the American citizens of the port to fund the costs of the evacuation and his own emigration and permanently left Acapulco along with his last 200 men on the 19th to San Blas aboard the steamship Victoire.\nSee also\n*List of battles of the French intervention in Mexico\nNotes\n* Luis Ghilardi is falsely identified as being German in contemporary newspapers such as the Wellington Independent and the Sacramento Daily Union. In reality, he was born in Lucca, Tuscany, in 1800, was a former officer of Giuseppe Garibaldi and a veteran of the First Italian War of Independence and the Revolutions of 1848 in general. He arrived to Mexico in 1853 and fought for the Plan of Ayutla and in the Reform War. After the battle of Acapulco he joined the Eastern Army in the Battle of Puebla. He was captured in 1864 in Colotlán and was charged with guerrillaism and executed the same year in Plaza de Burros.\n* Gustave Niox falsely gives the name of the Imperialist commander as \"Carlos Oroñoz\" instead of Apolonio Montenegro and the date as August 11, while actually it did take place on September 11.\nReferences"
    }
  ]
}