{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Vizagapatam__disambig_1\n\n| result      = See Aftermath\n| combatant1  = France\n| combatant2  = United Kingdom\n| commander1  = Charles-Alexandre Linois\n| commander2  = James Lind\n| strength1   = 1 ship of the line  2 frigates\n| strength2   = 1 ship of the line  2 merchant ships  Unknown number of shore artillery\n| casualties1 = 11 killed or wounded\n| casualties2 = 10 killed or wounded  1 merchant ship destroyed  1 merchant ship captured\n| campaignbox =\n}}\nThe Battle of Vizagapatam was a minor naval engagement fought in the approaches to Vizagapatam harbour in the Coastal Andhra region of British India on the Bay of Bengal on 15 September 1804 during the Napoleonic Wars. A French squadron under Counter-Admiral Charles-Alexandre Léon Durand Linois in the ship of the line Marengo attacked the British Royal Navy fourth rate ship HMS Centurion and two East Indiaman merchant ships anchored in the harbour roads.\nLinois was engaged in an extended raiding campaign, which had already involved operations in the South China Sea, in the Mozambique Channel, off Ceylon and along the Indian coast of the Bay of Bengal. The French squadron had fought one notable engagement, at the Battle of Pulo Aura on 15 February 1804, in which Linois had attacked the Honourable East India Company's (HEIC) China Fleet, a large convoy of well-armed merchant ships carrying cargo worth £8 million. Linois failed to press the attack and withdrew with the convoy at his mercy, invoking the anger of Napoleon when the news reached France.\nSince his failure at Pulo Aura, Linois had been cruising the Indian Ocean, and during August and September 1804 had seized a number of valuable merchant ships as his squadron travelled north from Ceylon along the Indian coast of the Bay of Bengal. Linois already had experience in repelling an attack on an armed port at the first battle of Algeciras; in the battle of Vizagapatam he himself was the one attacking an armed harbour. From a ship captured off Masulipatam, Linois learned of the presence of the East Indiamen at Vizagapatam and determined to attack, unaware that British Rear-Admiral Peter Rainier had replaced the small frigate HMS Wilhelmina with the larger Centurion as the convoy's escort. Arriving off the port at 06:00, Linois advanced on the convoy, causing one of the East Indiamen to drive ashore in panic. The other merchant vessel failed to support the outnumbered Centurion and was captured, but Centurion continued fighting alone.\nInitially supported by the fire of gun batteries on shore, Centurion later moved out of their range while engaging the French flagship Marengo, which remained well offshore to avoid the coastal shoals. After an engagement lasting four hours Marengo withdrew, the badly damaged Centurion attempting to pursue but without success. Linois's squadron was forced to return to Île de France in the aftermath of the engagement, where Marengo required six months of repairs.\nBackground\nDuring the Napoleonic Wars, the British economy depended on the movement of trade from the British Empire, particularly the trading posts and colonies in British India, managed by the Honourable East India Company (HEIC). This company transported goods from India to Europe using a fleet of large and well-armed merchant ships named East Indiamen, which travelled in convoys for protection, and were escorted during wartime by ships provided by the Royal Navy. The main Royal Navy base in the Bay of Bengal was at the city of Madras, but East Indiamen sailed from ports all around the Bay. As a result, the force in Madras was often dispersed to provide escorts to smaller convoys travelling to Madras or Calcutta to merge with other ships to form the large oceanic convoys. At the outbreak of the Napoleonic War, the commander of British forces in the Indian Ocean was Rear-Admiral Peter Rainier. The principal threat to British control of the region was a squadron sent from France shortly before war broke out, led by Counter-Admiral Charles-Alexandre Léon Durand Linois in the ship of the line Marengo.\nRainier and Linois had clashed in June 1803, before news of the outbreak of war had reached India. Linois had anchored at Pondicherry, a French Indian port, and Rainier had led a powerful squadron to anchor off the harbour in anticipation of the declaration of war. Concerned that Rainier's numerically superior force would overwhelm his squadron before they could operate against the British merchant convoys in the region, Linois slipped away under cover of darkness and eventually reached Île de France, where he learned that the Napoleonic Wars had begun on 16 May. Sailing to Batavia in the Dutch East Indies, Linois resupplied and then departed for a cruise in the South China Sea on 28 December, seeking the large annual convoy of HEIC merchant ships from Canton, known as the China Fleet. This convoy was normally escorted from Canton by several Royal Navy ships of the line, but in 1804 the escort had been delayed. Linois discovered the convoy near the island of Pulo Aura at the eastern entrance to the Strait of Malacca at 08:00 on 14 February and advanced. The convoy commander Commodore Nathaniel Dance had disguised several of the East Indiamen as ships of the line in the hope of convincing Linois that the convoy was well protected. Linois hesitated for over a day, eventually attacking on the morning of 15 February. Dance resisted and Linois withdrew without contesting the engagement. Dance's merchant ships chased Linois's squadron away before resuming their course and meeting their escorts several days later. Linois's failure to engage and defeat the China Fleet infuriated a number of his officers and provoked an angry letter from Napoleon, who accused Linois of believing \"that war can be made without running risks\".\nIn the aftermath of the engagement, Linois returned to Batavia and then to Île de France, arriving on 2 April. There he was criticised by the governor, General Charles Decaen, who wrote a letter to Napoleon complaining of Linois's conduct at the Battle of Pulo Aura. In mid-June 1804, Linois departed Île de France with Marengo and the frigates Atalante under Captain Camille-Charles-Alexis Gaudin-Beauchène and Sémillante under Captain Léonard-Bernard Motard, cruising off Madagascar in stormy weather before sailing to the coast of Ceylon. He enjoyed some success against individual merchant vessels, and gradually moved northwards during the late summer. The squadron passed Madras  off the coast to avoid encountering Rainier's squadron and raided along the Coastal Andhra region, visiting Masulipatam and Coasanguay. On 14 September 1804 off Masulipatam, Linois captured a country ship and learned from the crew that a small convoy was anchored at Vizagapatam to the north. The convoy was reported to consist of two East Indiamen with the 36-gun frigate HMS Wilhelmina, a former Dutch vessel captured in 1798, as their escort. Linois immediately sailed for Vizagapatam, expecting an easy victory over the convoy.\nBattle\n, the French commander during the battle]]\nAt Madras Admiral Rainier had become increasingly concerned during September by Linois's depredations, and had decided to strengthen his convoy escorts. He replaced Wilhelmina with the 50-gun HMS Centurion. Centurion was under the nominal command of Captain John Spratt Rainier, who was seriously ill at Madras, so Captain James Lind assumed temporary command. Lind sailed from Madras to Vizagapatam earlier in the month with the Indiamen Barnaby and Princess Charlotte and anchored in the roads, while the Indiamen loaded cargo ready for the return journey to Madras.\nThe ships were still anchored in the roads at 06:00 on 15 September when Linois's squadron appeared on the horizon to the south-west, approximately  away. The only flag visible on the strange ships was on board one of the frigates, which displayed the St George's Cross. Lieutenant James Robert Phillips, in command of Centurion while Lind was ashore, was not convinced by this ensign: he was aware that a French squadron was in the region, and positioned his ship so that his broadside faced the approaching vessels. At 09:45 the French came within range and Phillips opened fire, cautiously at first until he could be sure of the identity of the strangers.\nThe ship of the line exchanged signals with the frigates as Centurion began to fire, and as the signals were different from those used by the Royal Navy, Phillips was certain he was facing an overwhelming enemy squadron. Centurion made urgent signals to the Indiamen, warning them of the approaching threat. The crew of Barnaby panicked and cut her anchor cables, causing her to drift on shore where she was wrecked. Captain John Logan on Princess Charlotte was calmer and remained at anchor, although he ignored requests from Phillips for assistance from his ship's gun battery. Linois's ships spread out, Atalante closing to within  of Centurion, with Sémillante close behind. Marengo remained out of range, as Linois was unwilling to risk his flagship in shallow coastal waters for which he did not have accurate charts: the approaches to Vizagapatam were protected by a series of sandbars and if Marengo grounded during the engagement then his flagship could have been wrecked.\nWhen the French frigates came within , Phillips opened fire on Atalante as Sémillante attempted to reach the other side of the British ship to batter from the other side. The French frigates also came under long range fire from the three-gun battery at Vizagapatam, under the command of Lieutenant Colonel Alexander Campbell, on detached service from the 74th Regiment of Foot. Campbell despatched 50 sepoys in small boats to assist the crew of Princess Charlotte, whose armament of 24 guns continued to remain silent.\nBy 10:00, all three French ships were within range of Centurion and a heavy exchange of fire began. Within 15 minutes, both Centurion and Marengo had their colours shot away and at 10:45 the ship of the line turned away for open water, followed by the frigates, her rigging in disarray. Damage had rendered Centurion unable to manoeuvre rapidly and she began slowly limping inshore to shelter from Marengo among the coastal shoals. Captain Lind rejoined his ship by boat, hailing the Princess Charlotte, which had still not participated in the battle, to cut her anchor cables and go ashore to avoid being captured. Logan refused and at 11:15 surrendered without a fight as the whole French squadron moved back towards the harbour. Marengo again remained beyond the sandbars that marked the entrance. The boatloads of sepoys, who were still en route to Princess Charlotte, turned about and rowed back to shore to avoid capture. Sémillante took possession of the merchant ship while Marengo and Atalante engaged Centurion, which had moved out of range of support from the shore batteries.\nDespite her 50 guns, Centurions armament left her vulnerable as most were carronades, short-range heavy cannon that were useless in the face of the long-range gunnery from Marengo. Centurion consequently suffered severe damage and by 13:15 had been holed, with her rigging wrecked and her anchor cable shot through, which caused her to slowly drift away from the shore, out of control. Seeing that his opponent was disabled, Linois decided not to press the attack and issued orders for his squadron, accompanied by their prize, to sail away. Lind gradually regained control of his ship and even managed to raise some sail in pursuit, but the French were too far ahead. After some final parting shots, Centurion anchored as her crew set about repairing the damage. Linois remained within sight for the rest of the day, but showed no sign of renewing the action; he disappeared on the north-east horizon at dusk.\nAftermath\nDespite the destruction of Barnaby and the capture of Princess Charlotte, British losses were mild, Centurion having one man killed and nine wounded. The ship was very badly damaged, however, with a number of holes shot in her hull and badly torn rigging and masts. There were no recorded casualties among the troops onshore. The French suffered slightly heavier losses, Marengo having two men killed and an officer wounded and Atalante with three killed and five wounded. Sémillante, which had not been closely engaged in the battle, suffered no casualties. Damage to the French ships was severe, and Linois was forced to abandon further operations and slowly make his way back to Île de France, arriving in November. There Marengo underwent a full refit, lasting six months.\nBoth nations claimed the encounter as a victory, the French for the capture of Princess Charlotte and the British for the survival of Centurion in the face of overwhelming French numerical superiority. Linois justified his withdrawal in a letter, explaining that risking irreparable damage his squadron in a close engagement with Centurion would have curtailed his raiding operations. Privately however, Napoleon was angered by the survival of Centurion and wrote in response that \"France cared for honour, not for a few pieces of wood.\" British historians have echoed Napoleon's criticism, judging that Centurion was at Linois's mercy and that he had failed to destroy her, in words of William Laird Clowes, because of his \"half-hearted and timid action . . . [that] cannot but provoke censure.\"\nNotes\nReferences\n*\n*\n*\n*\n*\n*\n*\n*"
    }
  ]
}