{
  "content": [
    {
      "type": "text",
      "text": "# Battenburg markings\n\nA Volvo pump truck from South Australian Fire with red-and-yellow Battenburg markingsBattenburg markings or Battenberg markings are a pattern of high-visibility markings developed in the United Kingdom in the 1990s and currently seen on many types of emergency service vehicles in the UK, Crown dependencies, British Overseas Territories and several other European countries including the Czech Republic, Iceland, Sweden, Germany, Romania, Spain, Ireland, and Belgium as well as in Hong Kong and Commonwealth nations including Australia, New Zealand, Pakistan, Trinidad and Tobago, and more recently, Canada. The name comes from its similarity in appearance to the cross-section of a Battenberg cake.\nHistory\nvehicles that were changed to Battenburg markings]]\nBattenburg markings were developed in the mid-1990s in the United Kingdom by the Police Scientific Development Branch (which later became the Home Office Centre for Applied Science and Technology) at the request of the national motorway policing sub-committee of the Association of Chief Police Officers. They were first developed for traffic patrol cars for United Kingdom police forces; private organisations and civil emergency services have also used them since then.\nThe brief was to design a livery for motorway and trunk road police vehicles that would maximise the vehicles' visibility, from a distance of up to , when stopped either in daylight or under headlights, and which distinctively marked them as police vehicles.\nThe primary objectives were to design markings that:\n* Made officers and vehicles more conspicuous (e.g. to prevent collisions when stopped)\n* Made police vehicles recognisable at a distance of up to  in daylight\n* Assisted in high-visibility policing for public reassurance and deterrence of traffic violations\n* Made police vehicles nationally recognisable\n* Were an equal-cost option compared to existing markings\n* Were acceptable to at least 75% of the staff\nConspicuity\nambulance with green-and-yellow Battenburg markings]]\nBattenburg design uses a regular pattern and the contrast between a light and a dark colour to increase conspicuity for the human eye.\nThe lighter colour is daylight-fluorescent (such as fluorescent-yellow) for better visibility in daytime, dusk and dawn.\nFor night-time visibility, the complete pattern is retroreflective.\nThe Battenburg design typically has two rows of alternating rectangles, usually starting with yellow at the top corner, then the alternating colour, along the sides of a vehicle. Most cars use two block rows in the design (so-called full-Battenburg scheme). Some car designs use a single row (so-called half-Battenburg scheme) or one and a half rows.\nUnless precautions are taken, pattern markings can have a camouflage effect, concealing a vehicle's outline, particularly in front of a cluttered background.\nWith Battenburg markings, this can be avoided by:\n* Making rectangles large enough for optical resolution from distance—at least 600 × 300&nbsp;mm. A typical car pattern consists of seven blocks along the vehicle side. (An odd number of blocks also allows both top corner blocks to be the same fluorescent colour.)\n* Clearly marking cars' outlines in fluorescent colour along the roof pillars\n* Avoiding designs with more than two block rows (even for higher vehicles) by including a large area of plain or daylight-fluorescent colour.\n* Avoiding hybrid designs of Battenburg markings and other high-visibility patterns or check patterns.\nThe Battenburg livery is not used on the rear of vehicles; upward-facing chevrons of yellow and red are most commonly used there.\nSillitoe tartan\nvehicle with blue-and-white Sillitoe tartan]]\nIn the development of Battenburg markings, one of the key goals was to clearly identify vehicles associated with police. In this regard, the pattern was reminiscent of the Sillitoe tartan black-and-white or blue-and-white chequered markings first introduced by the City of Glasgow Police in the 1930s, which were subsequently adopted as a symbol of police services throughout the United Kingdom; they are also used by the Chicago Police Department, Australia, and on the New Zealand Police uniform.\nMany police services have since phased out the Sillitoe tartan markings on vehicle liveries as they are not highly visible, replacing them with Battenburg markings. Although many police services such as the New Zealand Police still use reflective Sillitoe tartan markings on their uniforms to be easily identified and seen at night.\nSafety\nambulances with yellow-and-green Battenburg markings on the side and chevrons on the rear]]\nBattenburg side markings and chevron front-and-rear markings provide conspicuity for emergency vehicles, helping to reduce accidents, especially when they are in unusual traffic situations—e.g. stopped in fast-moving traffic, or moving at different speeds or in different directions.\nSeveral criticisms of the Battenburg scheme were stated at the 3rd Annual US Emergency Medical Services (EMS) Safety Summit in October 2010 about their use on ambulances, including:\n* The difficulty of applying them to small, curved, and oddly-shaped surfaces\n* The high costs of adopting the markings\n* The confusing pattern caused when several parked Battenburg vehicles visually overlap\n* Obscuring the vehicle's shapes against complex backgrounds, or with open doors and hatches\n* Combinations other than police yellow-and-blue being less effective, and sometimes even making emergency personnel harder to see\n* Confronting the public with unfamiliar markings\nThe pattern's use by services other than UK police, and in other countries, was also criticised.\nThe high-visibility chevrons often used on the rear and front of Battenburg-marked vehicles, \"through popular opinion rather than by a scientific process of testing and research\", were found ineffective at reducing rear-end collisions. Stationary vehicles on high-speed roads were likely to be noticed, but not the fact that they were stopped. Parking at an angle was found a far more effective way of indicating the vehicles were stopped.\nUsage by country\nAustralia\nresponse vehicle, with red-and-white Battenburg markings and additional reflective stripes intended to increase overall visibility]]\nIn Western Australia, St John Ambulance Western Australia uses green-and-yellow markings, while New South Wales Ambulance uses red-and-white Battenburg markings on ambulances and patient transport vehicles. Australian police utilise the similar Sillitoe tartan markings.\n{| class=\"wikitable\"\n|+Battenburg markings used in Australia\n|-\n!Battenburg\n!Service\n!Colours\n!Example\n|-\n|80px\n| St John Ambulance Western Australia\n| Yellow and green\n|\n|-\n|\n|New South Wales Ambulance\n|Red and white\n|120px\n|-\n|\n| South Australian Country Fire Service\n|Yellow and red\n|120px\n|-\n| 80px\n| State Emergency Service\n| White and orange\n|\n|-\n|\n| New South Wales Rural Fire Service\n| Red and lime green\n|\n|}\nBarbados\nThe Barbados Police Service uses yellow-and-blue half-Battenburg markings on most of their fleet. However, some police vehicles in Barbados use white-and-blue half-Battenburg markings.\n{| class=\"wikitable\"\n|-\n!Battenburg\n!Service\n!Colours\n!Example\n|-\n|\n| Barbados Police Service\n|Yellow and blue\n|\n|-\n|\n|Barbados Police Service\n|White and blue\n|\n|}\nBelgium\nIn response to the terrorist attacks on 13 November 2015 in Paris and 22 March 2016 in Brussels, the Belgian federal government conducted an analysis on the functioning of the emergency services during terrorist attacks. The main issue identified regarding the emergency medical services was that their recognizability (of both vehicles and personnel) had to improve, so that emergency workers would be able to identify qualified medical providers more quickly during an intervention.\nAn agreement was made between the federal government and the communities and regions to implement the same new vehicle markings and uniforms. Specifically, emergency ambulances and response vehicles would keep the yellow base colour, whilst non-emergency ambulances would get a white base colour. Both types of vehicles would be marked with retroreflective yellow-and-green Battenburg markings, similar to British ambulances.\nA new uniform for medical personnel was also introduced, with different colours for the Star of Life for the different types of workers.\nAside from medical vehicles, some new fire brigade, Civil Protection and highway services vehicles also use respectively yellow-and-red, blue-and-orange and yellow-and-black Battenburg markings.\n{| class=\"wikitable\"\n|+Battenburg markings used in Belgium\n|-\n!Battenburg\n!Service\n!Colours\n!Example\n|-\n| 80px\n| Emergency medical services\n| Yellow and green\n|120px\n|-\n| 80px\n| Police\n| Yellow and blue\n|120px\n|-\n|\n| Fire services\nLifeguard\n| Yellow and red\n|120px\n|-\n|\n| Roadside assistance\nTaxicabs in Brussels\n| Yellow and black\n|120px\n|-\n|\n| Belgian Civil Protection\n| Orange and blue\n|120px\n|}\nCanada\nIn Canada, Battenburg markings on law enforcement vehicles are uncommon. However, in recent decades, Canada has slowly integrated some Battenburg markings on EMS vehicles, particularly in Ontario and Quebec.\nwith yellow-and-black Battenburg markings]]\nBattenburg markings are used on plow trucks for transportation and infrastructure in some parts of Canada, primarily on the back to increase visibility and alert people driving on a highway during poor road conditions that there is a plow truck in use and they must slow down. The general colour scheme for a snowplow's rear reflective panel is yellow-green and black.\nOntario\nThe parts of Ontario that utilize Battenburg markings, which are generally used by EMS vehicles, include the Region of Niagara, Greater Sudbury, Peterborough, Lanark County, and Frontenac County.\nBattenburg markings on police vehicles are not a common sight. The first regional police service to ever officially use Battenburg markings on its vehicles was the St. Thomas Police Service when it tested its new police interceptors with Battenburg markings, which were inspired by the UK's Battenburg design with the familiar blue and yellow reflective markings, in order to help enhance visibility within the city.\nThe Barrie Police Service later took a similar approach to redesigning its vehicle wraps, which was announced on 26 July 2022, when it unveiled a half-Battenburg marked police cruiser as part of a pilot project to evaluate its visibility within the community. This design featured the same blue and yellow reflective markings as those seen on many European police cars. As of 12 May 2023, the Barrie Police Service has officially adopted half-Battenburg markings on all of their fleets, eliminating stealthy dark navy body-colored vehicles and replacing them with white instead.\nDuring the autumn of 2023, the Cobourg Police Service (CPS) announced it would be the third police service in Canada to adopt Battenburg markings. A high-visibility Ford Explorer police vehicle with the markings is to be used by the service as part of a pilot project for 24 months.\nQuebec\nIn Quebec, Battenburg-style markings are used on various EMS vehicles, though some of the markings are reminiscent of Sillitoe tartan.\nEMS vehicle in Montreal, featuring white-and-blue Battenburg markings]]\nEMS supervisor cruiser in Montreal with half-Battenburg markings]]\n{| class=\"wikitable\"\n|+Common Battenburg markings used in Canada (by region)\n|-\n!Battenburg\n!Service\n!Colours\n!Example\n|-\n|\n|Barrie Police Service\nCobourg Police Service (pilot project)\nSt. Thomas Police Service (pilot project)\nLanark County Paramedic Service (Ambulance/EMS)\nFrontenac Paramedic Services (Ambulance/EMS)\n|Yellow and blue\n|120px\n|-\n|\n|Peterborough County-City Paramedics (Ambulance)\n|Orange and blue\n|\n|-\n|\n|Niagara Region EMS (Ambulance/EMS)\n|Oxford blue and green\n|120px\n|-\n|\n|Provincial Transportation and Infrastructure (Snowplow)\n|Yellow and black\n|\n|-\n|\n|Greater Sudbury Paramedic Services (Ambulance/EMS)\nQuébec Urgences-santé/Health Emergencies (EMS vehicles, optional)\n|White and blue\n|120px\n|-\n|\n|Québec Urgences-santé/Health Emergencies (EMS supervisor vehicles)\n|Yellow and ultramarine blue\n|120px\n|}\nChina\nMainland\n, Suzhou; two of them have yellow-and-blue Battenburg markings.]]\nSome police departments in Mainland China use battenburg markings on their police motorcycles, but there is no unified standard on the usage of battenburg markings.\n{| class=\"wikitable\"\n|+Battenburg markings used in China\n|-\n!Battenburg\n!Service\n!Colours\n!Example\n|-\n| 80px\n| Police\n| Yellow and blue\n|-\n| 80px\n| Shenzhen Traffic Police\n| Yellow and red\n|-\n|}\n]]\nBattenburg markings are also used as surface markings on some roads in Wuxi, Jiangsu. These markings are set in front of the pedestrian crossing, which improves road safety along with other markings.\nHong Kong\nHong Kong was a British Dependent Territory until 1997. Some emergency vehicles and special vehicles in the Hong Kong Police Force, Hong Kong Fire Services Department, Auxiliary Medical Service, and Hong Kong St. John Ambulance use Battenburg markings.\n{| class=\"wikitable\"\n|+Common Battenburg markings used in Hong Kong\n|-\n!Battenburg\n!Service\n!Colours\n|-\n| 80px\n| Police Force, Traffic Branch Headquarters\n| Yellow and blue\n|-\n| 80px\n| Police Force, a few other vehicles\n| White and blue\n|-\n| 80px\n| Fire Services Department, Mobile Casualty Treatment Centre\n| Yellow and green\n|-\n| rowspan=\"3\" |80px\n| Fire Services Department, Hazmat Tender, and Fire Motorcycle\n| rowspan=\"3\" |Yellow and red\n|-\n| Fire Services Department, Mobile Publicity Unit, and Fire Safety Education Bus\n|-\n| Fire Services Department, Emergency Medical Assistant Motorcycle, Rapid Response Vehicle and Paramedic Equipment Tender\n|-\n| 80px\n| Fire Services Department, Mobile Command Unit, and Forward Command Car\n| White and red\n|-\n| rowspan=\"2\" |80px\n| Auxiliary Medical Service, Paramedic motorcycle\n| rowspan=\"2\" |Yellow and green\n|-\n| Hong Kong St. John Ambulance, Ambulance\n|}\nCzech Republic\nAll Czech emergency vehicles, such as ambulances, use yellow-and-green Battenburg markings.\n{| class=\"wikitable\"\n|+Common Battenburg markings used in the Czech Republic\n|-\n!Battenburg\n!Service\n!Colours\n!Example\n|-\n|\n|Emergency medical services\n|Yellow and green\n|\n|}\nDenmark\nDanish emergency vehicles can have one of two options: a series of diagonal lines, or a Battenburg pattern. The diagonal lines must be either red-and-white or red-and-yellow at an angle of 45° ± 5° and have a width of 100&nbsp;mm ± 2,5&nbsp;mm. In the front and rear of the vehicle, the markings must be made symmetrical in a way that traffic is lead around the vehicle.\n{| class=\"wikitable\"\n|+Common Battenburg markings used in Denmark\n|-\n!Battenburg\n!Service\n!Colours\n!Example\n|-\n| 80px\n| Police\n| Yellow and blue\n|\n|-\n| 80px\n| Ambulances, doctor cars and similar\n| Yellow and green\n|\n|-\n| 80px\n| Fire Department\n|Yellow and red\n||\n|}\nVehicles may have a reflective text in the above colours, describing their function; for example  (), ALARM 112, AMBULANCE,  (),  () or similar text.\nThe above patterns are not obligatory. For example, the Danish Emergency Management Agency have chosen to simply not have any reflective marking on their vehicles.\nGermany\nAll rescue vehicles in Bavaria which have been procured uniformly since 2017 have a foiling in the Battenburg marker. From 2019 the ambulance service in Schleswig-Holstein started to adopt the design.\n{| class=\"wikitable\"\n|+Battenburg markings used in Germany\n|-\n!Battenburg\n!Service\n!Colours\n!Example\n|-\n| 80px\n| Bavarian Red Cross\nSchleswig-Holstein Ambulance\n|Orange and yellow\n|\n|}\nIceland\nIn 2018 the Icelandic police started marking new police cars with blue and neon yellow markings similar to Battenburg markings used in Europe. Since then the police cars in the capital region have been made even more visible. In 2020 were Icelandic ambulances changed to look more like ambulances in Europe, adopting yellow and green markings. Icelandic Search and Rescue started adopting Battenburg markings in 2016 with red and yellow markings similar to the fire services.\n{| class=\"wikitable\"\n|+Battenburg markings used in Iceland\n|-\n!Battenburg\n!Service\n!Colours\n!Example\n|-\n| 80px\n| Police\n| Yellow and blue\n|-\n| 80px\n| Ambulances\n| Yellow and green\n|-\n| rowspan=\"3\"|80px\n| Fire Department\n| rowspan=\"3\"|Yellow and red\n|-\n| rowspan=\"4\"|Icelandic SAR\n|-\n|}\nIreland\nLand Rover Defender field ambulance with blue and orange Battenburg markings]]\nIreland's Garda Síochána first introduced blue and yellow Battenburg style markings in 2004 with the formation of the Garda Traffic Corps. This rollout was expanded in 2008 with the formation of Regional Support Units (later renamed to the Garda Armed Support Unit), equipped with Battenberg liveried Volvo XC70s with removable red \"ARMED SUPPORT UNIT\" lettering; this livery was changed in 2016 with the purchase of new Audi Q7 SUVs and BMW 3 Series estates to include permanent lettering and a red stripe running along both sides of the vehicle. Battenburg markings would be rolled out onto most new Garda vehicles (excluding vans) regardless of their role from 2021 onwards.\nAmbulances in Ireland originally had similar striped markings to those in the United Kingdom. The Battenburg green and yellow markings and standard base yellow began to be adopted on Irish ambulances following the formation of the HSE National Ambulance Service in 2005. Notably, the Dublin Fire Brigade's ambulance operations and the Order of Malta Ambulance Corps use the same red and yellow Battenburg markings used on fire appliances.\n{| class=\"wikitable\"\n|+Common Battenburg markings used in Ireland\n|-\n!Battenburg\n!Service\n!Colours\n!Example\n|-\n| 80px\n| Garda Síochána (police)Airport Police ServiceMilitary Police\n| Yellow and blue\n|120px\n|-\n| 80px\n| HSE National Ambulance Service\nSt John Ambulance Ireland\n| Yellow and green\n|\n|-\n| 80px\n| Fire and RescueOrder of Malta\n| Yellow and red\n|\n|-\n| 80px\n| Civil Defence\n| Blue and orange\n|\n|-\n| 80px\n| Coast Guard\n|Orange and yellow\n|\n|-\n| 80px\n| Mountain Rescue\n| White and orange\n|\n|-\n|\n| Red Cross\n| Red and blue\n|\n|}\nMalta\nMalta's first emergency vehicles with Battenburg style markings, 11 Fiat Ducatos for Mater Dei Hospital, were delivered between 2012 and 2014. Further ambulances supplied new or as second-hand imports from the United Kingdom would be liveried in Battenburg markings.\nThe Civil Protection Department took delivery of its first fire appliances, Iveco, MAN and Volvo based appliances, with an orange and yellow Battenburg-like scheme between 2018 and 2019, with some specialist appliances later built by UK-based EmergencyOne being liveried in UK-style yellow and red markings. However, from 2021, a new livery was introduced for new Civil Protection Department fire appliances in 2021 that retained the yellow/orange and red colour scheme but disposed of the Battenburg pattern.\nThe Malta Police Force first began rolling out Battenburg style markings in 2021 amid investments in new fleet vehicles in line with the force's Transformation Strategy 2020–2025, replacing a silver/grey and black livery. The first new vehicles delivered in the new livery were 20 new Hyundai Tucsons for use as Rapid Intervention Units. The rollout continued in 2022 with the delivery of 12 SsangYong Mussos marked in the livery for use in rural areas, followed in 2024 with deliveries of new traffic police BMW motorcycles and MG5 electric neighbourhood police cars.\n{| class=\"wikitable\"\n|+Common Battenburg markings used in Malta\n|-\n!Battenburg\n!Service\n!Colours\n!Example\n|-\n| 80px\n| Malta Police Force\n| Yellow and blue\n|[https://www.flickr.com/photos/149686767@N06/51959488359/ Link to image]\n|-\n| 80px\n| Mater Dei Hospital\nEmergency Malta\n| Yellow and green\n|\n|-\n| 80px\n| Civil Protection Department (Fire appliances)\n| Yellow/orange and red\n| [https://www.flickr.com/photos/149686767@N06/51964288602/ Link to image]\n|-\n| 80px\n| Civil Protection Department (K9 Unit)\n| Blue and orange\n|\n|}\nNew Zealand\nSkoda Superb with Battenburg markings parked outside Wellington District Court]]\nAll four main emergency services in New Zealand use reflective Battenburg markings on their liveries. Military Police, NZDF Fire Service, private ambulances and other smaller emergency services also sometimes use Battenburg markings.\nThe New Zealand Police use a reflective chequered yellow-and-blue Battenburg markings on their frontline liveried vehicles. The markings used by police are a different form of Battenburg to those seen in the United Kingdom being checkered with breaks instead of the conventical alternating rectangles. Police started to use Battenburg markings in 2000, the markings were exclusively for Highway Patrol vehicles with general duties vehicles receiving Battenburg markings in 2004.\nWellington Free Ambulance was the first ambulance service in New Zealand to adopt Battenburg marking doing so by 2006. Vehicles in Wellington Free Ambulance fleet are marked with reflective green-and-white Battenburg markings similar to those used in the United Kingdom. Hato Hone St John followed suit in 2014 adopting Battenburg markings on new vehicles. When Hato Hone St John introduced Battenburg markings, they used conventional green-and-yellow alternating rectangles. However in 2023 Hato Hone St John updated their livery with a new, adapted, highly visible, reflective green-and-yellow Battenburg marking livery with chevrons and special Māori cultural designs integrated.\nOn 1 July 2017, the New Zealand urban and rural firefighting organizations amalgamated into Fire and Emergency New Zealand. Fire and Emergency started to use a new livery that includes Battenburg markings used on all new vehicles with many older vehicles retrospectively receiving the new livery. The Battenburg markings on Fire and Emergency vehicles are similar to the conventional red-and-yellow alternating rectangles used by fire services across the world, but has some subtle differences such as one of the rectangles being dark blue with Fire and Emergency branding.\n{| class=\"wikitable\"\n|+Common Battenburg markings used in New Zealand\n|-\n!Battenburg\n!Service\n!Colours\n!Example\n|-\n| 80px\n| New Zealand Police\n| Yellow and blue\n|\n|-\n|80px\n|Wellington Free Ambulance\n|Green and White\n|\n|-\n| 80px\n| Hato Hone St John\n| Yellow and green\n|\n|-\n| 80px\n| Fire and Emergency New Zealand\n| Yellow and red\n|\n|}\nPakistan\nIn Pakistan, the National Highways & Motorways Police use yellow-and-blue Battenburg markings on most of their fleets.\n{| class=\"wikitable\"\n|+Battenburg markings used in Pakistan\n|-\n!Battenburg\n!Service\n!Colours\n!Example\n|-\n| 80px\n| National Highways & Motorways (Police)\n| Yellow and blue\n|\n|}\nSpain\nThough many municipal police forces of the Autonomous communities of Spain, such as Castile and León, Catalonia, Galicia and the Basque Country, have adopted standardised liveries, some autonomous communities give their municipal police greater freedom to choose their vehicle liveries. As a result, municipal police forces of Alcobendas, Alcorcón, Colmenar Viejo and Rivas-Vaciamadrid in the Community of Madrid, the city of Seville, Benacazón and Paradas in the Province of Seville, Algeciras in Andalusía, and Barañáin in Navarre have adopted either blue-and-yellow Battenburg-style markings or a livery based on the markings.\n{| class=\"wikitable\"\n|+Battenburg markings used in Spain\n|-\n!Battenburg\n!Service\n!Colours\n!Example\n|-\n| 80px\n| Some municipal police forces\n| Yellow and blue\n|\n|}\nSweden\n(2011)]]\nOriginally Swedish Police vehicles were painted with black roofs and doors or black roofs, bonnet, and boot. During the 1980s the cars became white with the word  written on the side. Later the livery became simply blue and white. In 2005 they began using a light blue and fluorescent yellow Battenburg livery. Swedish police cars have been Saabs, Volvos or Volkswagens, with the same livery all over Sweden. Many Swedish road agencies, contractors and consultants use Battenburg markings on road maintenance vehicles, with an orange-and-blue colour scheme, as in the UK rail response type shown above. This practice was established after a study in 2008 by the Swedish Road Administration, which showed a significant traffic calming effect when using orange-and-blue Battenburg marking to improve the visibility of road maintenance vehicles.\n{| class=\"wikitable\"\n|+ Common Battenburg markings used in Sweden\n|-\n!Battenburg\n!Service\n!Colours\n!Example\n|-\n| 80px\n| Police\n| Yellow and blue\n| 120px\n|-\n| 80px\n| Ambulance\n| Yellow and green\n| 120px\n|-\n| 80px\n| Fire Brigade\n| Yellow and red\n| 120px\n|-\n| 80px\n| Road maintenance\n| Blue and orange\n| 120px\n|}\nSwitzerland\nThe first Swiss ambulance service with Battenburg markings was the emergency medical services in Zofingen. Since 2008, they have used Battenburg markings on their Volkswagen Crafters and Mercedes-Benz Sprinters. They use white-and-red markings on their ALS units.\nAnother Swiss service with Battenburg markings is the Swiss Border Guard agency, which uses yellow block markings on its vehicles.\n{| class=\"wikitable\"\n|+Battenburg markings used in Switzerland\n|-\n!Battenburg\n!Service\n!Colours\n!Example\n|-\n|\n| Swiss Border Guard\n| Yellow and navy blue\n|\n|}\nTaiwan\nTaipei City Fire Department ambulances began using yellow and red Battenburg markings beginning in March 2020; Taoyuan City Fire Department ambulances followed shortly after in late 2021. By 2025, all ambulances in Taipei were expected to display Battenburg markings. All ambulances across Taiwan are expected to use Battenburg markings as equipment is replaced, with the Taipei City government noting that the markings are in accordance with the Reflective Markings Format for Fire Fighting Vehicles of the National Fire Agency.\n{| class=\"wikitable\"\n|+Battenburg markings used in Taiwan\n|-\n!Battenburg\n!Service\n!Colours\n!Example\n|-\n|80px\n|Ambulances operated by local fire departments\n|Yellow and red\n|}\nThailand\nIn Khon Kaen Province of Thailand, the Kohn Kaen Hospital features yellow-and-green Battenburg markings on their ambulances.\n{| class=\"wikitable\"\n|+Battenburg markings used in Thailand\n|-\n!Battenburg\n!Service\n!Colours\n!Example\n|-\n| 80px\n| Khon Kaen Hospital (Ambulance)\n| Yellow and green\n|\n|}\nTrinidad and Tobago\nThe T.T.P.S. Police of Trinidad and Tobago uses half Battenburg yellow-and-blue Battenburg reflective markings on some of their vehicles.\n{| class=\"wikitable\"\n|+Battenburg markings used in Trinidad and Tobago\n|-\n!Battenburg\n!Service\n!Colours\n!Example\n|-\n| 80px\n| National Highways & Motorways (Police Force)\n| Yellow and blue\n|\n|}\nUnited Kingdom\nof the Metropolitan Police Service in London, with half-Battenburg markings]]\nof the British Transport Police in Chester Train Station, with Battenburg markings in full]]\nIn the United Kingdom, the majority of the emergency services have adopted the Battenburg style of markings; nearly half of all police forces adopted the markings within three years of their introduction, and over three quarters were using it by 2003.\nIn 2004, following the widespread adoption and recognition of the Battenburg markings on police vehicles, the Home Office recommended that all police vehicles, not just those on traffic duty, use \"half-Battenburg\" livery, formalising the practice of a number of forces.\nIn the United Kingdom each emergency service has been allocated a specified darker colour in addition to yellow, with the police continuing to use blue, ambulances using green, and the fire service their traditional red. Other government agencies such as immigration enforcement have adopted a variation, without using the reflective yellow.\nThe use of these colours in retro-reflective material is controlled by the Road Vehicle Lighting Regulations 1989, with vehicles only legally allowed the use of amber reflective material (and red near the rear of the vehicle). A number of civilian organisations have also adopted the pattern, which is not legally protected, and a number of these also use other reflective colours.\nAn alternative to the use of reflective materials is the use of fluorescent or other non-reflective markings, which may be used by any vehicle.\n{| class=\"wikitable\"\n|+Common Battenburg markings used in the United Kingdom\n|-\n!Battenburg\n!Service\n!Colours\n!Example\n|-\n| 80px\n| Police\n| Yellow and blue\n|\n|-\n| 80px\n| Ambulance and Doctors\n| Yellow and green\n|\n|-\n| 80px\n| Fire and Rescue, occasionally beach lifeguards\n| Yellow and red\n|\n|-\n| 80px\n| NHS Blood and Transplant, Blood Bikes and some 4×4 responders\n| Yellow and orange\n|\n|-\n| 80px\n| National Highways traffic officers, Welsh Government traffic officers and DVSA\n| Yellow and black\n|\n|-\n|\n| Rail Response\n| Red and blue\n|\n|-\n| 80px\n| Mountain Rescue, Lowland Rescue, and Cave Rescue and most 4×4 responders\n| White and orange\n|\n|-\n|\n| HM Coastguard\n| Yellow and navy blue\n|\n|-\n|\n|Civil Defence, such as [https://jcac.org.uk/ The Joint Civil Aid Corps]\n|Orange and blue\n|[https://jcac.org.uk/wp-content/uploads/2022/08/DSC0618-2048x1362.jpg Link to image]\n|-\n|\n| Immigration Enforcement, Border Force, HM Customs and Excise\n| Sky blue and navy blue\n|\n|-\n|\n| Mine Rescue Service\n| Green and Blue\n|[https://external-content.duckduckgo.com/iu/?u=https%3A%2F%2Fwww.mrsl.co.uk%2Fsites%2Fdefault%2Ffiles%2Fnews%2Fbody%2F5m-min.jpg&f=1&nofb=1&ipt=de1f47746def237a3459fad31a31fd4f6db31fe673490d4356dc610b98cc970b&ipo=images Link to image]\n|}\nUnited States\nBattenburg markings on emergency vehicles are generally uncommon in the United States, though some municipalities have begun using them in recent years.\nThe Miami Township Police Department in Ohio has previously used ones similar to those found in the UK on their police cars. Battenburg markings are also used in South Carolina's Charleston County for EMS vehicles.\nFrom 2017 to 2021, the Pittsburgh Police used Sillitoe tartan markings on some of their fleets. The design was updated to include black-and-gold Battenburg markings in 2021 to represent the city's official colours. City authorities stated that the markings would also be applied to all future municipal vehicles.\nThe Chicago Police Department began using Sillitoe tartan markings on their police vehicles in 2018, while the hats of officers have used them since 1967.\nRed and yellow Battenburg markings can be seen on most of the ambulances in the City of Chicago for the Chicago Fire Department.\nGreen and yellow Battenburg markings are also used on ambulances operated by Michigan-based Life EMS Services.\nSee also\n* Sillitoe tartan\n* Aerial roof markings\n* Blues and twos\n* Panda car\n* Jam sandwich (police car)\nNotes\nReferences\nExternal links\n*[http://webarchive.nationalarchives.gov.uk/20100413151441/http://scienceandresearch.homeoffice.gov.uk/hosdb/publications/road-policing-publications/14-04-High-Conspicuity-Li13319.html?view=Standard&pubID=385504 High Conspicuity Livery for Police Cars 14-04]\n*[http://webarchive.nationalarchives.gov.uk/20100413151441/http://scienceandresearch.homeoffice.gov.uk/hosdb/publications/road-policing-publications/47-06_-_High_Conspicuity_Li1afa5.html?view=Standard&pubID=423053 High Conspicuity Livery for Police Motorcycles 47-06]"
    }
  ]
}