{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Krasne\n\n, Bratslav Regiment, Cossack Hetmanate\n| result            = Polish–Lithuanian victory\n| combatant1        =  Polish–Lithuanian Commonwealth\n| combatant2        =  Cossack Hetmanate\n| commander1        =  Marcin Kalinowski   Stanisław Lanckoroński\n| commander2        =  Danylo Nechay   Hryhoriy Kryvenko\n| strength1         = 10,000–12,000 Polish–Lithuanian hussars, cavalry and infantry\n| strength2         = 12,000 Zaporozhian Cossacks\n| casualties1       = Unknown\n| casualties2       = 8,000–10,000\n}}\nThe Battle of Krasne or the Defense of Krasne (Ukrainian: Битва під Красною, Красненська оборона; Polish: Bitwa pod Krasnem, Obrona Krasny; 20–23 February 1651) was fought between the Polish–Lithuanian Commonwealth against the Cossack Hetmanate as a part of the Khmelnytsky Uprising. Near the site of the present-day village of  in Ukraine, the Polish–Lithuanian Commonwealth’s forces under the command of Hetmans Marcin Kalinowski and Stanisław Lanckoroński attacked and defeated a forces of the Zaporozhian Cossacks under the command of Colonel Danylo Nechay, who was killed in the battle and Hryhoriy Kryvenko.\nThe Cossack Hetmanate violated the Treaty of Zboriv which was signed in 18 August 1649 and attacked the Bratslav Voivodeship of the Polish–Lithuanian Commonwealth in January 1651, then the Crown Army started a military campaign against the Zaporozhian Cossacks and Crimean Tatars which lasted until 28 September 1651, then the Polish–Lithuanian Commonwealth was defeated by the Cossack Hetmanate and Crimean Khanate in the Battle of Bila Tserkva and was signed the Treaty of Bila Tserkva after the battle. Colonel Danylo Nechay ordered his troops to gather in the village of  on the border territories with the Cossack Hetmanate and Polish–Lithuanian Commonwealth in the Bratslav Regiment to defend the castle and village from the Crown Army.\nIn 20–23 February 1651, the Polish–Lithuanian Commonwealth’s forces numbered around 12,000–20,000 troops crossed the border of the Cossack Hetmanate and approached .  The Ukrainian castle guards mistook the Crown Army as a Zaporozhian Cossacks and let them inside. The Crown Army entered into the village and a fierce battle began between the two sides. The Poles and Lithuanians began to retreat under the strong onslaught of the Zaporozhian Cossacks numbered around 3,000 troops, but at the same time the main forces of the Polish–Lithuanian Commonwealth approached. The battle turned into a massacre; defenders of the castle, civilian people like men, women and children were brutally killed by the forces of the Polish–Lithuanian Commonwealth, the entire village was destroyed and burned.\nAfter this success, Hetmans Marcin Kalinowski and Stanislaw Lanckoroński marched deeper into Podolia, seizing several towns, such as Sharhorod, Yampil and Chernivtsi. After losing a siege against the Zaporozhian Cossacks in Vinnytsia in 11–12 March 1651, the Crown Army had to retreat back to Volhynia.\nReferences\nBibliography\n*Władysław Andrzej Serczyk: Na płonącej Ukrainie. Dzieje Kozaczyzny 1648–1651. Warszawa: Książka i Wiedza, 1998, p.&nbsp;328-329. .\n* Maciej Franz: Wojskowość Kozaczyzny Zaporoskiej w XVI-XVII wieku. Geneza i charakter. Toruń: Adam Marszałek, 2004, p.&nbsp;222. ."
    }
  ]
}