{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Trans-la-Forêt__disambig_1\n\nThe Battle of Trans-la-Fôret was fought on 1 August 939 between the occupying Vikings and the Bretons, led by a joint army of Alan II, Hugh II of Maine, and Judicael Berengar.\nPolitical landscape\nThroughout the early 900's, the states of Brittany and West Francia were in a state of flux having both being invaded by the Vikings:\n* By 907, a Dane called Hastein conquered an area now called Upper Brittany, with Nantes renamed to Namsborg as their capital.\n* In 931, the Vikings assembled an army on the Loire river to attack the Franks. The occupied Bretons seized this opportunity and rebelled. The Vikings appear to have been taken by surprise but a counterattack ensured Brittany was reconquered.\n* By 935, the Vikings in Brittany became isolated after William Longsword of Normandy reconciled with the Franks and exiled Bretons started returning from Anglo-Saxon England. Alan Barbetorte returned to Brittany from Anglo-Saxon England between 936 and 938, and engaged the Vikings. A Viking leader Incon was slain and Nantes recaptured in 937.\n* Receiving support from  the Anglo-Saxon King Athelstan, the Bretons spread their rebellion throughout the peninsula and this brought them into direct confrontation with the Scandinavian colonists.\nThrough the course of three years, the campaign against the Vikings reached a conclusion at Trans-la-Fôret.\nOrder of battle\nOn 1 August 939, a united Breton army led by Alan II, a Breton count Judicael Berengar of Rennes and elements from a Frankish count Hugh II of Maine decisively attacked and defeated the Viking stronghold, bringing an end to the occupation.\nThe site of the battlefield is considered to be south of Mont St Michel over the river Couesnon within a kilometre from Trans-la-Fôret.\nOutcome\nThe Breton victory at Trans-la-Forêt freed Brittany of Viking occupation and led to the re-establishment of the Breton State, not as a fully independent Kingdom but as a Sovereign Duchy under Alan II, Duke of Brittany, due to a new fealty owed to the Franks for helping remove the Vikings.\nThe occupation resulted in Brittany becoming more fortified on the seaward side by returning Breton lords.\nViking piracy continued to affect a previously vibrant maritime trade between the Bretons and their Welsh cousins, isolating the Bretons.\nArmorican texts protected by monks for centuries were lost after this period.\nThe Breton capital was moved from Nantes to inland Rennes as it was regarded as more defensible. This would become a point of discord between the two cities.\nReferences"
    }
  ]
}