{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Rich Mountain__disambig_1\n\n| result            = Union victory\n| status            =\n| combatants_header =\n| combatant1        =  United States (Union)\n| combatant2        =  CSA (Confederacy)\n| commander1        = George B. McClellanWilliam S. Rosecrans\n| commander2        = John Pegram\n| strength1         = 7,000\n| strength2         = 1,300\n| casualties1       = 46\n| casualties2       = 300\n550 including General Pegram surrendered next day\n| notes             =\n| campaignbox       =\n}}\nThe Battle of Rich Mountain took place on July 11, 1861, in Randolph County, Virginia (now West Virginia) as part of the Operations in Western Virginia Campaign during the American Civil War.\nBackground\nMaj. Gen. George B. McClellan assumed command of Union forces in western Virginia in June 1861. On June 27, he moved his divisions from Clarksburg south against Lt. Col. John Pegram's Confederates, reaching the vicinity of Rich Mountain on July 9. Meanwhile, Brig. Gen. Thomas A. Morris's Union brigade marched from Philippi to confront Brig. Gen. Robert S. Garnett's command at Laurel Hill. On July 10–11, Brig. Gen. William Rosecrans led a reinforced brigade by a mountain path to seize the Staunton-Parkersburg Turnpike in Pegram's rear.\nOpposing forces\nUnion\nConfederate\nBattle\n]]\nLaurel Mountain\nUnion forces under Thomas A. Morris, totaling approximately 4000 troops, beset Confederates under General Garnett at Laurel Mountain starting July 7. After less than a week of skirmishing Morris’ force came to a standoff against Garnett’s Confederate force on Laurel Hill. Occasional sniper and artillery fire plagued both sides amidst inclement weather. Stiff resistance convinced Morris he faced the main Confederate force. On July 11, Garnett learned of the Union flanking maneuver at Rich Mountain and decided to withdraw from Laurel Mountain. The 44th Virginia Infantry was ordered to hold the Beverly Road by engaging Federals to give the appearance of an attack. With Gen. William Rosecrans’ Union brigade approaching from the South, Garnett abandoned the Beverly Road and withdrew toward Corrick’s Ford on the Cheat River, where he was killed.\nRich Mountain\nUnion forces under the direct command of General McClellan greatly outnumbered Pegram’s Confederates on Rich Mountain. Nevertheless, the Confederates held a strong position and inexperienced soldiers in his own command convinced McClellan to precede any action with an artillery duel. A local boy named David Hart entered Gen. William Rosecrans’ Union camp and said he knew a way around to the rear of the Confederate lines, for which he was offered one hundred dollars in gold. McClellan agreed to let Hart lead Rosecrans’ brigade of 1,900 men through the woods. The route took roughly 10 hours through wet, rough terrain which forced Rosecrans to leave his artillery behind. During this time, Col. Pegram was able to learn from a captured sergeant of the Union flanking movement. Pegram incorrectly assumed the attack was coming from the north and positioned a lone 16-pound artillery piece with most of his command in defense.  Captain Julius A. De Lagnel, Garnett’s chief of artillery, assumed command of this force around David Hart’s family farm. At 2:30pm Rosecrans’ force appeared at the pass on Rich Mountain and attacked. Confederates quickly redeployed their artillery piece and twice repulsed Union skirmishers from behind crude breastworks. Assuming they had defeated the enemy, Pegram’s men began cheering. The cheering was enough to also convince McClellan that Rosecrans had been defeated. However, most of the Union soldiers were well concealed behind trees and logs. Rosecrans counterattacked and routed the Confederates in his front, wounding De Lagnel.  McClellan shelled the Rebel position, but did not make the expected assault. Half the Confederates escaped to Beverly and on over the Shawnee Trail. Pegram and the others (including the \"Sydney Boys\", a regiment formed from the students of Hampden-Sydney College) attempted to make their way north to link up with Garnett. Pegram’s force was too exhausted to make it and 555 men surrendered on July 12.\nAftermath\nHearing of Pegram's defeat, Garnett abandoned Laurel Mountain in great disorder. The Federals pursued, and, during fighting at Corrick's Ford on July 13, Garnett was killed; he was the first general officer to be killed in the war. On July 22, McClellan was ordered to Washington, and Rosecrans assumed command of Union forces in western Virginia. The Union victory at Rich Mountain was met with great celebration in the north, and was instrumental in propelling McClellan to command of the Army of the Potomac. After the victory at Rich Mountain and failure of Morris to pursue the confederate troops at Laurel Mountain fast enough to catch them before crossing Shavers' fork, McClellan severely criticized Morris in his report to Washington.\nPreservation\nThe battlefield and Camp Garnett today are owned and protected by the Rich Mountain Battlefield Foundation. The Civil War Trust (a division of the American Battlefield Trust) and its partners, including the foundation, have acquired and preserved  of the battlefield. The site is listed on the National Register of Historic Places.\nSee also\n*West Virginia in the American Civil War\nGallery\nFile:The soldier in our Civil War - a pictorial history of the conflict, 1861-1865, illustrating the valor of the soldier as displayed on the battle-field, from sketches drawn by Forbes, Waud, Taylor, (14576128308).jpg|Battle at Laurel Mountain (several kilometers away from Rich Mountain) fought concurrently. Confederates on Laurel Mountain retreated in great disorder after hearing of the defeat of Confederate forces on Rich Mountain.\nFile:\"Battle of Rich Mountain.\".jpg\nFile:Frank Leslie's scenes and portraits of the Civil War (1894) (14576458077).jpg|'''Frank Leslie's scenes and portraits of the Civil War'\nFile:Sketch of the Site of the O(pe)rations of the 10th, 11th, & 12th, July 1861, at Rich Mountain near Beverly... - NARA - 305586.tif|Sketch of the Site of the Operations of the 10th, 11th, & 12th, July 1861, at Rich Mountain near Beverly.\nFile:Sketch of the battle of Rich Mountain, July 11-12, 1861. LOC 2003629669.tif\nFile:Rough sketch of the battle of Rich Mountain, July 11-12, 1861. LOC 2003629677.jpg\nFile:Area of the battle of Rich Mountain, July 11-12, 1861. LOC 2003629670.jpg\nFile:Battle of Rich Mountain-Camp Garnett.jpg|Camp Garnett\nFile:Battle of Rich Mountain-Hart House.jpg|Marker on site of Hart House\nFile:Battle of Rich Mountain-Historical Marker.jpg|Historical Marker on Rich Mountain\nFile:Battle of Rich Mountain-Uphill.jpg|Looking at summit of Rich Mountain\nFile:Battle of Rich Mountain-Downhill.jpg|Looking westward (downhill) from Rich Mountain summit\nNotes\n}}\nReferences\n* Fout, Frederick W., The Dark Days of the Civil War, 1861 to 1865, The West Virginia Campaign of 1861, The Antietam and Harper's Ferry Campaign of 1862, The East Tennessee Campaign of 1863, The Atlanta Campaign of 1864, F.A. Wagenfuehr, 1904.\n* Kennedy, Frances H., ed. The Civil War Battlefield Guide. 2nd ed. Boston: Houghton Mifflin Co., 1998. .\n* Taylor, Paul. Orlando M. Poe: Civil War General and Great Lakes Engineer. Kent, OH: Kent State University Press, 2009. .\n* Zinn, Jack. The Battle of Rich Mountain''. Parsons, WV: McClain Printing Company, 1971. .\n*[https://www.nps.gov/history/hps/abpp/CWSII/WestVirginiaBattlefieldProfiles/Rich%20Mountain%20to%20Summit%20Point.pdf CWSAC Report Update and Resurvey: Individual Battlefield Profiles]\nExternal links\n*\n* [https://web.archive.org/web/20150124062733/http://www.nps.gov/abpp/battles/wv003.htm National Park Service Battle Summary]\n* [http://www.richmountain.org Rich Mountain Battlefield Foundation]\n*The West Virginia & Regional History Center at West Virginia University houses a [https://archives.lib.wvu.edu/repositories/2/resources/1087 brief account of the battle written by L. Johnson] and includes drawings of the Union camp\n* [http://www.wvculture.org/history/journal_wvh/wvh28-1.html Rich Mountain Revisited] Dallas B. Shaffer, October 1966"
    }
  ]
}