{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Purutué Bank\n\n}}\n*Paraguayan Army\n| combatant2        =\n}}\n*Imperial Army\n* Imperial Navy\n*National Guard\n| commander1        =  José E. Díaz  Leonardo Riveros\n| commander2        =  Villagran Cabrita\n| strength1         = 1,266 soldiers\n| strength2         = 900 soldiers\n| casualties1       = 900 dead\n| casualties2       = 100 dead\n| image_size        = 300px\n}}\nThe Battle of Purutué Bank (also called Redemption Island, Itapirú Bank, Carayá Island, Carvalho Island, Cabrita Island or Vitória Island) took place on 10 April 1866, during the Paraguayan War.\nPreparation\nAlmost in the middle of the Paraná River, bordering the , there was an island - in fact a sand bank - covered by vast grassland, which would later be called Ilha da Redenção, Ilha de Carvalho or Ilha do Cabrita. The Imperial Brazilian Army decided to occupy the island, important for its position in relation to the fort and the enemy camp, to serve as a point of support against the Paraguayans. On 5 April 1866, lieutenant colonel of engineers José Carlos de Carvalho was ordered to ship a 12-inch La Hitte battery and a 4-inch mortar, in addition to the corresponding material to cover them. The garrison of the island, composed of the aforementioned batteries, 100 soldiers of the Battalion of Engineers, the 7th infantry battalion of Fatherland Volunteers and the 14th Battalion of the National Guard, was commanded by lieutenant colonel João Carlos de Villagran Cabrita.\nThe Battle\nAt 4 am on 10 April 1866, a Paraguayan force landed on the island trying to dislodge the Brazilian troops from their position. They were repelled with great losses and withdrew under the fire of the Brazilian fleet, which, in turn, was forced to withdraw before the fire of the Itapirú fort.\nColonel Villagran Cabrita was killed by a bomb fired from the Itapirú fort when, aboard a boat that contained ammunition for the island's garrison, he dictated the victory report. His name was given to the island.\nGuerre du Paraguay. - Combat de l’isle de la Rédempcion das le Paraná (10 avril) - la 19ª brigade brésillienne commandée par le colonel Willagran-Cabrita repoussant l’assaut des paraguayens.jpg|Combat of Ilha da Redenção, on the Paraná River (April 10, 1866): the 19th Brazilian Brigade repels the Paraguayan assault.\nAtaque de los paraguayos á la Isla Carayá.jpg|Paraguayan attack on Carayá Island.\nAtaque da Ilha do Carvalho e Derrota dos Paraguayos no Dia 10 de Abril de 1866.jpg|Attack on Carvalho Island.\nEpisódio do combate na ilha do Carvalho.jpg|Episode of the combat on the Carvalho Island (Semana Ilustrada, nº 283, 13/05/1866).\nReferences"
    }
  ]
}