{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Tettenhall__disambig_1\n\nHalfdan Ingwær\n| commander2  = Not known\n| casualties1 = Heavy, in the thousands\n| casualties2 = Unknown\n}}\nThe Battle of Tettenhall (sometimes called the Battle of Wednesfield or Wōdnesfeld) took place, according to the chronicler Æthelweard, near Tettenhall on 5 August 910. The allied forces of Mercia and Wessex met an army of Northumbrian Vikings in Mercia.\nBackground\nAfter successful raids by Danish Vikings, significant parts of northeastern England, formerly Northumbria, were under their control. Danish attacks into central England had been resisted and effectively reduced by Alfred the Great, to the point where his son, King Edward of Wessex, could launch offensive attacks against the foreigners. Edward was allied with the Mercians under his sister Æthelflæd, and their combined forces were formidable. The allies launched a five-week campaign against Northumbrian Danes in 909.\nBattle\nThe Vikings quickly sought retaliation for the Northern excursion. In 910, King Edward was in Kent waiting for a fleet he had summoned, and the Vikings, believing that most of the king's troops were on board ship, launched an invasion of Mercia. They raided as far as the Avon near Bristol, and then harried along the Severn until they reached the Bridgnorth area. They now moved east, followed by a joint Mercian and West Saxon army, which caught up with the Vikings near Tettenhall. The raiders were annihilated and three kings were killed: Ingwær, Eowils and Halfdan.\nAftermath\nWith the Northern Danes subdued, the forces of Wessex and Mercia could be focused against the Vikings who had settled further south, and there was no further incursion from the north for a generation.\nReferences\nExternal links\n*[http://www.anglo-saxons.net/hwaet/?do=get&type=person&id=EdwardtheElder Anglo-Saxon Monarchs – Edward the Elder]\n*[http://www.anglo-saxons.net/hwaet/?do=get&type=day&id=08050910 Anglo-Saxons Online]\n*[http://www.oxforddnb.com/view/article/8514/8514?back=,52311 Sean Miller, \"Edward the Elder\", Oxford Dictionary of National Biography]"
    }
  ]
}