{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Shakopee\n\n| map_type          =\n| map_relief        =\n| map_size          =\n| map_marksize      =\n| map_caption       =\n| map_label         =\n| territory         =\n| result            = Uncertain, both sides claimed victory\n| status            =\n| combatants_header =\n| combatant1        = Ojibwe\n| combatant2        = Dakota\n| combatant3        =\n| commander1        = Chief Noonday\n| commander2        = Chief Wau-ma-nuag\n| commander3        =\n| units1            =\n| units2            =\n| units3            =\n| strength1         = 150 – 200\n| strength2         = 60 – 70\n| strength3         =\n| casualties1       = 4 - 5\n| casualties2       = 2 – 10\n| casualties3       =\n| notes             =\n| campaignbox       =\n}}\nThe Battle of Shakopee occurred on the morning of Thursday, May 27, 1858, between Murphy's Landing in Shakopee and Eden Prairie, Minnesota, on the banks of the Minnesota River. It was the last major conflict, notably after centuries of conflict, between the Dakota and Ojibwe Native American tribes.\nBackground\nThe two Native tribes warred frequently for decades, even prior to European colonization; settler-colonists in the region noted fighting between the tribes as far back as the 15th century. Both moved seasonally to hunt for deer, gather wild rice, and make maple sugar. Situated in close proximity, these resources were competed for. Brief ceasefire periods were often squandered by local, bloody skirmishes. Fighting was prevalent hundreds of years before the founding of the Minnesota Territory. The intensity of the conflict in the specific region to be later known as Minneapolis and its surrounding areas was one of the many factors leading to the creation of Fort Snelling at the confluence of the Minnesota and the Mississippi rivers in 1825.\nSettler-colonist immigration, reliance on the fur trade, and the founding of the Minnesota Territory on March 3, 1849, further intensified the two tribes' competition for resources. The addition of firearms added to the brutality of the conflicts. By the late 1850s, treaties with the United States government had confined the Dakota tribe to a reservation straddling the upper Minnesota River, and the Ojibwe to lands further north and east. However, this nominal separation did not prevent Ojibwe-Dakota tensions from turning violent again in 1858; Minnesota entered the Union as the 32nd state on May 11 of that year, just over two weeks before the Battle of Shakopee.\nThough their explanations of the battle's direct cause contradicted each other, many observers stated that the Ojibwe looked for retribution against the Dakota for a recent series of attacks on their people. In one such attack the previous April, a family of eleven women and children near Crow Wing, Minnesota were murdered in their sleep.\nPrelude\nOn the night of Wednesday, May 26, 150-200 Ojibwe warriors laid in wait in the woods on the north bank of the Minnesota River, outside of a Dakota encampment on the south side of the river at Murphy's Landing, in modern-day Shakopee, Minnesota. The Dakota camp was occupied by 60-70 men. The Ojibwe planned to ambush the camp early in the morning.\nBattle\nSometime between 4:30 and 5:00 am, ten men from the Ojibwe party opened fire on, and fatally wounded, a young Dakota man fishing from a canoe along the south side of the river. The Ojibwe proceeded to scalp him. The camp immediately awoke, and 30-50 Dakota warriors armed themselves and charged for the riverbank.\nBoth sides exchanged gunfire from their respective sides of the Minnesota River; the Dakota were out of range and boarded Murphy's Ferry to cross and meet their attackers on the north of \"Big Creek\". As the Dakota disembarked on the north riverbank, the rest of the Ojibwe party ambushed them, to limited success.\nDespite being greater in number, the Ojibwe men were not able to take full advantage of their surprise attack. The Dakota, lesser in number, fought with \"characteristic vigor and desperation\", but were unable to fully drive off the Ojibwe.\nIn the midst of the skirmish, a Dakota warrior fell, and his tribe attempted to carry his body back to their camp. The Ojibwe gave chase, stealing the body. Three brothers of the fallen warrior stayed behind, despite a Dakota retreat, to retrieve the body. These men called to their fellow tribesmen to assist them, but were cut down before reinforcements could reach them. Enraged by this, the Dakota cancelled their retreat and fully engaged the Ojibwe with ferocity.\nThe sounds of gunfire attracted the attention of Shakopee residents, who observed the skirmish from the safety of the bluffs above.\nAt 10 am, the fighting ceased. An estimated seven to 11 men lost their lives: four or more Ojibwe killed and at least one, Kawetahsay, wounded after taking a shot to the mouth, and two to three Dakota killed and 10 wounded. The Ojibwe retreated north to Lake Minnetonka, and the Dakota returned to their encampment to fortify it in the event of a follow-up attack.\nAmong the trophies of the Dakota was the body of Noon Day, the leader of the Ojibwe. Dakota chief Wau-ma-nuag mutilated Noon Day's corpse, cutting out Noon his heart, drinking the blood from it and then scalping and decapitating the corpse, before carrying it on a pole back to Shakopee. The victory was celebrated by a scalp dance, lasting several days, and then Noon Day's corpse was burned.\nAftermath\nDaniel Buck, Supreme Court justice of Minnesota and witness to the battle, remarked that the Dakota appeared \"demoralized\" after the battle, \"with their blankets shot and torn, and carrying their wounded home toward their reservation. On their way to their reservation the [Dakota] held a war dance on the levee in the city of Mankato. They had the hand of a[n Ojibwe man] (possibly Chief Noon Day) fastened to a long pole, and danced around it...\"\nEyewitness Phillip Collins, who had witnessed the mutilation of Chief Noon Day's body, retrieved a pouch containing the pipe, kinnickinnkh and more personal effects of a fallen Dakota warrior, a crude map on birch bark that bore, besides the localities of hills, lakes and rivers of that vicinity, several mysterious characters, among them figures representing cows, foxes, and more. This irreplaceable relic was later lost.\nWhile the Dakota were greatly outnumbered, a significant number of Ojibwe held off from the engagement to fill in the lines when their men fell. This may explain eyewitness accounts that during the battle, the numbers on both sides were relatively equal. Ojibwe agents later reported on behalf of their tribal leaders that only 34 of the warriors from their group fought at Shakopee; a number corroborated in subsequent written accounts of the battle from onlookers, such as the residents of Shakopee. While there were casualties on both sides, both the Dakota and the Ojibwe claimed victory; no clear victor was established. Some accounts report that some of the Ojibwe men held back in fear of the conflict; one observer noted an Ojibwe warrior \"vocalizing and jumping\" in the hollow of a tree during the skirmish.\nAfter the fighting ceased, the Shakopee community speculated that the Ojibwe make another attempt on the Dakota tribe, as the long history of conflict between the two nations had shown a pattern of attacks and counter-attacks. Governor Henry Hastings Sibley decided that separating them was the only way to prevent this, and on June 2, he demanded that the Dakota still in the valley pack up their belongings and return to their reservation land. While there were rumors of both tribes assembling in the area for a second conflict, these were ultimately proved unsubstantiated.\nLegacy\nThe Battle of Shakopee is considered the final conflict between the Ojibwe and Dakota tribes, a long-lasting and bloody rivalry. A marker that once stood at the 1938 National Youth Administration overlook of U.S. Highway 212 stated the same; \"This was the last important battle between these tribes in Minnesota.\" Additionally, many of the land treaties between the Dakota and the United States government that put the two warring tribes in close proximity in the first place, as well as constant encroachments on Dakota territory by the United States government, ultimately enraged the Dakota, and only four years after the Battle of Shakopee, possibly as a direct consequence of it, Dakota gunfire rang out once more across Minnesota.\nReferences"
    }
  ]
}