{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Hemmingstedt__disambig_1\n\n}}\nKalmar Union\n* Denmark\n| commander1        = Wulf Isebrand\n| commander2        = }}\n| strength1         = approx. 6,000 peasants\n| strength2         =\n| casualties1       = 60\n| casualties2       = 7,000, thereof 360 nobles\n}}\nreciting the battlecry: \"Wahr di, Garr, de Buer de kumt\" (Beware guard, the farmer is coming)]]\nThe Battle of Hemmingstedt took place on 17 February 1500 south of the village of Hemmingstedt, near the present village of Epenwöhrden, in the western part of present-day Schleswig-Holstein, Germany. It was an attempt by King John of Denmark and his brother Duke Frederick, who were co-dukes of Schleswig and Holstein, to subdue the peasantry of Dithmarschen, who had established a peasants' republic on the coast of the North Sea. John was at the time also king of the Kalmar Union.\nForces\nThe ducal army consisted of the \"Great Guard\", 4,000 Landsknechts, commanded by a petty noble (Junker) named Thomas Slentz, 2,000 armoured cavaliers, about 1,000 artillerymen, and 5,000 commoners. The defenders were at most 6,000 men, all peasants.\nUse of terrain\nAfter seizing the village of Meldorf, the ducal army advanced, but was stopped at a barricade equipped with guns. The defenders opened at least one dike sluice in order to flood the land, which quickly turned into morass and shallow lakes. Crammed together on a narrow road with no solid ground on which to deploy, the ducal army was unable to make use of its numerical superiority. The lightly equipped peasants were familiar with the land and used poles to leap over the ditches. Most of the ducal soldiers were not killed by enemy arms, but drowned. The conquest attempt was thus repelled. The casualties among the Dithmarsians are not known, but the Danish and the Dutch lost together more than half of their army, making about 7,000 men killed and 1,500 men wounded.\nFollowing the battle, the Dithmarsians buried the bodies of the enemy's common soldiers, but in their contempt for the nobility, the bodies of the nobles were left to rot in the fields.\nPersonalities; real and imagined\nof 1910 by Max Friedrich Koch, assembly hall of the former District Building in Meldorf. The legendary virgin Telse waving the banner of the then Ditmarsian patron saint Mary of Nazareth.]] The farmer  (died 1506) was the leader and organiser of the peasants' defence. While he was a real person, the existence of other participants of the battle is not proven. For instance, the legendary Reimer von Wiemerstedt is said to have killed Junker Slentz, the chief of the Great Guard. Another doubtful participant was the virgin Telse.\nPropaganda use\nMany details about the battle were made up later in order to heroize the defenders. In 1900 a monument to the defenders was raised. The cult reached its peak in the Nazi era, when local party members used the names of the battle participants for their propaganda. Today there is a more neutral museum at the site commemorating the battle.\nLegacy\nThe Battle of Hemmingstedt is a prime example of the use of terrain in military tactics. The Ditmarsians had taken a vow to donate a monastery in honour of the then national patron saint Mary of Nazareth if they could repel the invasion. In 1513 the Ditmarsians founded a Franciscan Friary in Lunden fulfilling their vow. The Ditmarsians also captured diverse banners and standards of the defeated enemies, among them the Dannebrog. They were presented in St. Nicholas Church in Wöhrden until Frederick II of Denmark, victorious in the Last Feud against Dithmarschen in 1559, forced the Ditmarsians to return them.\nReferences\nExternal links"
    }
  ]
}