{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Orihuela (713)\n\n| commander2        = Abd al-Aziz ibn Musa\n| strength1         = Unknown\n| strength2         = Unknown\n| casualties1       = Heavy\n| casualties2       = Unknown\n}}\nThe Battle of Orihuela  was a military engagement between the Umayyads and the Visigoths near Oriheula. The battle ended in Muslim victory.\nBackground\nThe Umayyad generals Tariq ibn Ziyad and Musa ibn Nusayr rendezvous together at Toledo. There, both generals continued the conquest. Tariq marched northward and captured Zaragoza while Musa captured Huesca, Lleida, Tarragona, Barcelona, and Girona. The region to the east of Jaén remained unconquered and had a good number of forces to resist the Muslims. The Visigoths at the east were led by Theodemir, Governor of the province of Aurariola, in the southeast of Spain, with his capital at Orihuela. The Muslims were led by Musa's son, Abd al-Aziz ibn Musa.\nBattle\nAbd al-Aziz began his advance from Seville in early March 713. The Muslims had not gone far beyond Granada when they made their first contact with the Visigoths. Theodmir had no intention to fight on an open battlefield but rather in valleys and hill passes. He began harassing Muslims as they marched, sallying out to attack isolated groups, appearing where least expected and vanishing again into the safety of his hills. The location of the battle is unknown, but it was probably fought on a plain near Orihuela at the end of March 713.\nBoth sides fought with each other until they reached Segura River which was an ineffective obstacle. At the plain, the Visigoth had no cover, which allowed the Muslims to attack and slaughter them, routing the Visigoth. Theodmir survived the battle with little of his forces. He crossed the river and arrived in Orihuela. There he had little men to defend the city, which forced Theodmir to surrender to the Muslims. The Muslims granted him safe conduct and a favorable treaty, which allowed him to retain his wealth and lands. There would be no violance in his lands.\nReferences\nSources\n*Agha Ibrahim Akram (2004), The Muslim Conquest of Spain.[https://archive.org/details/TheMuslimConquestOfSpain_201807/page/n76/mode/1up]\n*David James (2012), A History of Early Al-Andalus, The Akhbar Majmu'a.[https://archive.org/details/culture-and-civilization-in-the-middle-east-david-james-a-history-of-early-al-an/page/52/mode/1up]\n*Ulick Ralph Burke (1900), A History of Spain from the Earliest Times to the Death of Ferdinand the Catholic, Vol I.[https://www.google.ae/books/edition/A_History_of_Spain_from_the_Earliest_Tim/nqRgSfXeZucC?hl=ar&gbpv=1&dq=Orihuela+Abdul+Aziz+713&pg=PA124&printsec=frontcover]"
    }
  ]
}