{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Ocotal\n\n|combatant2=  Sandinistas\n|commander1=  Maj. Ross E. Rowell Cap. Gilbert Hatfield Grover C. Darnall Thomas G. Bruce\n|commander2= Augusto César Sandino Rufo Marín Porfirio Sánchez\n|strength1=37 marines47 national guard7 aircraft\n|strength2=500–600 guerrillas\n|casualties1=9 killed & wounded(according to Beckett)1 killed5 wounded(according to Nalty)\n|casualties2=40–80 killed(according to Beckett)56 killed100 wounded(according to Nalty)\n}}\nThe Battle of Ocotal occurred in July 1927, during the American occupation of Nicaragua.\nA large force of rebels loyal to Augusto César Sandino attacked the garrison of Ocotal, which was held by a small group of US Marines and Nicaraguan National Guards. Ultimately the rebels were defeated with heavy losses, while the Americans and their Nicaraguan allies suffered very light casualties.\nBattle\nBy June 1927, United States Marine Corps Captain Gilbert D. Hatfield's original eight men at Ocotal had been augmented to forty-one men, with the intention of patrolling the Nueva Segovia area, and further augmented on July 11 by ''Guardia Nacional's 1st Co.  Upon arriving at the town of Ocotal, Captain Hatfield expected enemy activity so he had his men build an airstrip and establish telegraph service with the surrounding town.\nThe United States Marines and the Nicaraguan guards did not have to wait long for a battle. On July 15, Captain Hatfield doubled his watch and that same night, Sandino's rebels began entering the town, two or three men at a time. At 1:15 am on July 16, a lone marine patrolling the town spotted a suspicious man walking through a street, so he fired what became the first shot of the engagement.\nWith the element of surprise lost, Sandino immediately ordered his men to charge the marines and the guards. Around 4 AM, three charges were made on city hall, resulting in the death of Rufo Marin. The second push lasted more than four hours. At daybreak, heavy fighting began again until 8:00 am, when Sandino demanded Hatfield's surrender. Captain Hatfield refused to concede, apparently believing that his fortified positions were strong enough to repel any further attack.\nDaylight brought two marine aircraft into the battle. At around 10:00 am, one of the planes, piloted by Lieutenant Hayne D. Boyden, landed near Ocotal to inquire about the seriousness of the situation, while the other plane, piloted by Gunner Michael Wodarczyk, strafed the enemy's positions. A little later, Lieutenant Boyden reboarded his plane, made a few more strafing runs and then flew back to Managua where he informed Major Ross E. Rowell of the battle.\nMajor Rowell responded by forming a squadron of five De Havilland DH-4 biplanes armed with machine guns and four twenty-five pound bombs each. At 2 PM, Rowell's squadron arrived at Ocotal and began dropping bombs on the rebels at 300 to 1,000 feet for about forty-five minutes. Sandino's men, who had never been attacked by aircraft before, began a panic retreat in what was history's first dive bombing attack in tactical support of ground troops.\nAftermath\nFifty-six dead rebels were collected and over 100 more were wounded, while the US Marines and the Nicaraguan National Guards suffered only light casualties. The exact casualties suffered by the victors vary between accounts: Nalty stated only one man killed and five wounded, while Beckett stated a total of nine killed and wounded.\nWhile this action was by no means the end of the insurgency – it was to last another five years – it was the last time that the rebels attempted to concentrate for a massed attack of this kind. As with early British successes with aircraft in counterinsurgency in Somaliland in 1920, it had forced the insurgents to change their tactics.\nMajor Oliver Floyd's Nueva Segovia expedition soon arrived in Ocotal, and on 25 July, marched for San Fernando.\nSee also\n*Banana Wars\n*Chesty Puller\nReferences\nBibliography\n*Beckett, I.F.W. (ed., 1988) The Roots of Counter-Insurgency, Blandford Press, London:\n*"
    }
  ]
}