{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Shimbra Kure__disambig_1\n\n}}  Robēl  Aqbā   Mikā’īl   Jūhar   Mendel   Jān Balaw Rās   Zamanjān   ‘Amdu  Wajāmū\n| strength1         = 12,560 men(per Arab Faqīh)\n| strength2         = 216,000+ men(per Arab Faqīh)\n| casualties1       = 5,000 men\n| casualties2       = 10,000 archers, 600 Horses, 114 Patricians and an uncountable amount of infantry.\n| coordinates       =\n| image             = Illustration of Ahmad Gragn at war.jpg\n}}\nThe Battle of Shimbra Kure was fought on 9 March 1529 between the forces of Adal led by Imam Ahmad ibn Ibrahim al-Ghazi, and the Abyssinian army, under Dawit II (Lebna Dengel). It was the first major battle of the Ethiopian–Adal War.\nArab Faqīh states numerous Somalis on the left flank fled while the Abyssinians pursued killing a large number of their men, but the Harla on the right flank held their ground. According to Merid Wolde Aregay, the Harari cavalry or the Malassay in the center with support from the Arab mounted troops shifted the momentum in favor of the Adalites. The army of Imam Ahmad prevailed, and were in control of the field at the end of the battle. Abyssinians suffered heavy casualties.\nDespite this success, and despite his desire to capture and hold the Emperor's palace at Badeqe, Imam Ahmad, in part also to appease his restive men, withdrew from the highlands and did not return to directly engage the Ethiopian army for two years. Enrico Cerulli asserts that following the battle, the Harari troops refused to carry out Imam Ahmad's orders to subjugate Abyssinia, stating that doing so would defy the tradition of their ancestors. According to Cerulli, the Harari aristocracy dreaded the potential consequences of the Muslim base relocating to Abyssinia.\nBattle\nAccording to Arab Faqīh, a Muslim Convert who was formerly a Christian rearguard commander during the battle, by the name of Haibi reported that Lebna Dengel had 16,000 cavalry with 200,000 foot soldiers.\nArab Faqih notes:Each of the infidel lines was five times bigger than that of the Muslims  who were like the white birth mark on the hide of a black bull\nThe Imam organised his battle formation and the Muslim Adalites prayed two Rak’at prayers 2 fold prostrations. The Imam organised his formation he split the Adalites into three The right flank was held by the Harla tribes. The right flank was held by the Harla while the left flank which was held by the Somali Adalites under the brother in law of the Iamm, Matan ibn Uthman, The middle flank was the elite Malasay troops being led by Imam Ahmed himself. Then the Qur’ānic teacher Abu Bakr, also known as Arshuta gave the Adalites a fiery speech encouraging the Adalites to fight\nO band of Muslims, paradise is beautifully ornamented  and Hell-fire is shut tight. The angels are gazing down, The Houris with wide black eyes are preening themselves rejoice at this prospect\nSome academics, such as Richard Pankhurst, attributes Imam Ahmad's success to the presence amongst his followers of an elite company of matchlockmen. If this is the case, then this battle was the first time Ethiopian forces had to fight against a force equipped with firearms.\nImam Ahmed also gave a speech encrouaging the Adalites to hold their positions and let the Abyssinians strike first. He admonished them to persevere through the heat of battle and remain steadfast.\nThereupon the Muslims said to the imam Ahmad, may the Most High God have mercy upon him, 'Let us attack them'. But the imam held them back from fighting. He said, 'Maintain your positions. Don't begin to fight them until they have begun to fight you. Hold your spears on the ready, cover yourselves with your shields made of hide, and don't make a move with your feet without keeping God in mind.'\nAs the Muslims moved from their position to do battle with their enemies, the imam was saying to them, O people of Islam, steadfastness means resolution, faint-heartedness means failure. Be sure of this, those who persevere are those who will vanquish. Faint-heartedness and cowardice are the twin causes of disappointment. God will see that whoever is constant triumphs over his enemy, for God is with him. Whoever holds his ground against the cutting edge of a sword, he is the achiever of the future; and will never again suffer fatigue. If he walks with God, his dwelling place shall be the more honoured, his efforts acknowledged, for God loves those who persevere.'\nLebna Dengel charged his troops they began attacking the Muslims it was bloody battle, they began attacking the right flank but the Muslims managed to resist them. On the left flank the Somalis were hugely outnumbered they fought a bloody battle against the Abyssinians but were overwhelmed, Some of Somalis retreated and 3000 of them were killed. Holding Firm & not retreating was Garad Matan Bin Uthman  & Ahmed Girri Bin Hussein. The battle intensified went on until cloud dusts formed no one could see each other some of Abyssinians mistakenly attacked each other. The fighting continued until the Adalites managed to push them out.\nArab Faqih narrates:\nAs for what happened to the Somalis on the Muslim left wing, when the fighting became unbearable they took to flight, with the infidels in pursuit, and were massacred by them in a devastating slaughter. Some of them were captured, but three-thousand of them died.\nNow for what happened to those from the people of Harla who were holding the Muslim right wing: the first, second and third ranks [of the Abyssinians] charged them, and the fighting between them revolved like a mill-stone, with men's heads being cut off. The Abyssinians committed more forces against the Muslim right. But the Muslims endured with a remarkable endurance.\nThe fighting went on between the various parties until the Abyssinians were pushed back into those who were following them and thousands of them perished, with the ground being covered with the bodies of those who died. The numbers of wounded on both sides grew, but they were higher for the Abyssinians.\nCasualties\nAbyssinian casualties\nArab Faqīh mentions that the number of dead Abyssinians was uncountable including many of their leader including Za Wengal, King of Medri Bahri, and the Two Slaves who were standard-bearers. 10,000 Noblemen were killed as well as 114 patricians outside of those mentioned by name in the text. Each Patrician 200-1,000 cavalrymen at his command.\nHow many thousands of infidels were killed, God alone knows. Many of the patricians were killed, among them the patrician Robel, from the patricianate of Tegre. He was killed by Ara'di, the equerry of the imām. Also killed was Aqbä Mika'il, younger brother of Robel, powerfully intrepid and intractable. He was killed by the imam Ahmad, may God the Most High have mercy upon him, who struck him with his spear, and its tip emerged from his back, glistening.\nAlso killed were two slaves, eunuchs attached to the treasury of the king. One of them was named Jühar and the other was named Mendel. On that day the two of them were standing, with the king's standard above their heads; the infidels put them on almost the same level as the king. Jühar was killed by the emir Muhammad, son of the emir Muhammad bin Zaharbüi Utman. Mendel was killed by Del Sagad, a knight from Sim.\nThe patrician Sire Sum was killed by Garad Din, governor of Maya after the conquest. A notable patrician, a relative of the king on his mother's side, named Yona'al, had his hand cut off by Garad Sama'un, and Abd an-Nasr struck him in the back with his spear, but he fled and was saved. One of the Muslims, named Utman, a sheikh from the tribes of Gedaya, was riding his mule on this occasion, and attacked a patrician named Jan Balaw Rās, striking him in the back. The patrician was wearing protective armour, but the sword sliced through the armour and the coat of mail, and cut him in half. The top half flew to the side while the other half remained on the horse, and finally tumbled off.\nThe sum of Salam was killed by one of the Muslims, as was the patrician Gabra Madhen one of the king's vassels. His killer was a shrivelled-up toothless man called Aumäyāda, the patrician Zamanjän, nephew of the patrician Wasan Sagad, was killed by the wazir 'Addoli. The patrician Maha Tenta was struck in the eye by a spear thrown by a\nSomali spearman called Adam, the commander of the spearmen. God cast his soul into Hell, 'an evil place to settle in', The patrician Wajämu was killed by Takla bin Agaw.\nThe patrician Za-Wangel, the Bahr Nagas, lord of Dokono was killed by 'Abd al-Razāq bin Suha, brother of the emir Mujähid. The patrician Sum of Agame, and the Sum of Sajarah were killed, as was the patrician of Tamben and the Sum of Abargale. The patrician 'Amdu was killed by a foot-soldier called Addamu.\nAdalite casualties\nHowever Muslim casualties were also steep with Arab Faqīh recording 5,000 dead Muslims including Hamza Al Jūfi, an Arab Knight who served as an Infantry commander, and Jadid Kurju, who served as a Muezzin for Garad Abun Adashe\nAmong the leaders of the Muslims who were killed was Hamzah al-Jufi who died a martyr on this day, may God the Most High have mercy upon him. Also killed was Jadid Kürjü; and the muezzin of Garād Abūn, Kabir Ibrahim; and the Qur'ānic teacher Muhammad the preacher from Sim; Dallū of Bali; Muhammad of Dawäro. Five-thousand Muslims from the tribes of the Somalis, Harla, Malasay and desert Arabs were killed. God put his seal of martyrdom upon them, introducing them to the Garden of delights, bestowed upon them the pleasures of the table, houris with black eyes, and lavished on them his all-pervasive Favour. \"In it [the garden of paradise] lasting blessing shall be theirs; abiding there for ever. Surely God carries a mighty reward with him'.\nAftermath\nArab Faqīh mentions that the Muslims captured an uncountable amount of weapons, horses, swords, and chainmail along with as well Takla Madhen, The brother-in-law of Dawit II, who was ransomed for 250 ounces of Gold.\nDespite this success, and despite his desire to capture and hold the Emperor's palace at Badeqe, Imam Ahmad, in part also to appease his restive men, withdrew from the highlands and did not return to directly engage the Ethiopian army for two years.\nThe storyteller, Shihab al-Dīn Aḥmad ibn ʿAbd al-Qādir ibn Sālim ibn ʿUthmān, wrote that:After the infidels had taken to flight, and God had granted the victory to the Muslims, the imam Ahmad said this day to his companions, 'Now that God has given us the victory over them, and has humiliated them, now let us march on to Badge the place where the king's residences are, to take him, and to demolish it. Let us occupy Abyssinia, conquering the country, and weakening them.'They replied, O imam of the Muslims, you have already seen what has happened to us, how many of our soldiers have been killed, the injuries that we have sustained, the scarcity of our provisions. So now lead us back down to our own country. If you mobilise afterwards, then we will mobilise our army; and then we will set off on a second expedition. Yet, if you tell us to stay here, we will stay here in order to fight alongside you.'Enrico Cerulli asserts that following the battle, the Harari troops refused to carry out Imam Ahmad's orders to subjugate Abyssinia, stating that doing so would defy the tradition of their ancestors. According to Cerulli, the Harari aristocracy dreaded the potential consequences of the Muslim base relocating to Abyssinia. Historians have stated the victory for Adal Sultanate at Shimbra Kure was pivotal for Ahmed Ibrahim eventually gaining considerable influence over the entire East Africa.\nUse of firearms\nSome academics, such as Richard Pankhurst, attributes Imam Ahmad's success to the presence amongst his followers of an elite company of matchlockmen. If this is the case, then this battle was the first time Ethiopian forces had to fight against a force equipped with firearms. However Merid Wole Aregay suggests that a careful examination of relations between the Ottoman Empire and the Red Sea ports of Yemen shows that Adal did not, before 1539, receive a substantial number of matchlocks or artillery pieces from the Ottoman Empire or any other state.\nReferences"
    }
  ]
}