{
  "content": [
    {
      "type": "text",
      "text": "# Battle Games in Middle-earth\n\nBattle Games in Middle-earth (BGiME) was a fortnightly magazine published by De Agostini in conjunction with British games manufacturer Games Workshop. Unlike White Dwarf, which generally features content regarding Games Workshop's flagship Warhammer brands, BGiME was entirely dedicated to The Lord of the Rings Strategy Battle Game.\nAccording to the magazine itself, as well as it was sold in Ireland, the United Kingdom, Australia, New Zealand, Malta and South Africa. It also became available, through their sponsors, in the Netherlands, Belgium, France, Germany, Spain, Austria, Greece and Poland. The magazine became more popular than the publishers had anticipated, and the deadline was extended several times. Having completed the series of magazines relating to the films, it then went on to explore the rest of The Lord of the Rings universe, includes miniatures that were featured in The Lord of the Rings book but not the films. The last issue was Pack 91, featuring Sharkey from the Scouring of the Shire.\nContent\nEach pack came with a free Lord of the Rings Strategy Battle Game miniature, including some exclusive to the publication at the time. Exclusive miniatures were much sought after in countries where the magazine was not sold, and included Háma, Théodred and a much sought after conversion kit. However, these have become available as separate components on the Games Workshop website or as miniatures released with new supplements. The magazine itself featured five consistent parts:\n* Guide to Middle-earth, introducing the theme of the magazine from the works of Tolkien.\n* Playing the Game, introducing the full rules (including some exclusive ones) in installments.\n* Battle Game, featuring a themed battle that can be played using armies built up from previous packs.\n* Painting Workshop, a step-by-step guide to converting and painting the free miniature featured in the pack\n* Modelling Workshop, a full guide to building terrain and scenery for playing battle games on.\n* The content grew knowledge and skill over time, building on previous articles. This 'Hobby Arc' was devised by Design Manager, and series creator Rowland Cox.\nEarly subscribers to the magazine received three free gifts of a magnifying glass, a modelling tool kit and an exclusive Balin's Tomb stand for you to paint and display your Fellowship models that was not available to buy in the shops.\nThere were also three special editions of the magazine, following the specific themes of The Fellowship of the Ring, The Two Towers, and The Return of the King.\nAlan and Michael Perry, who sculpted several of the special edition miniatures, agreed that the magazine was \"a good thing for LotR\", that encouraged people to take up the miniature wargaming hobby.\nThe original deadline for the magazine was Pack 65; however, this was extended to 78, and later extended again to 91. When BGiME finished its series, two members of its team (Mark Latham and Glenn More) joined the White Dwarf team; Mark Latham later became the editor of White Dwarf in July 2007. On the official Games Workshop forum, the forum moderator Steve Hammatt expressed hope that ''White Dwarf's future articles would be improved to the BGiME standard:\n:\"Hopefully this will mean good things for future LOTR content in White Dwarf''.\"\nFootnotes\nExternal links\n* [https://web.archive.org/web/20141016161441/http://www.azog.co.uk/BGIMEIndex/BGiMEIndex1-78.htm Issue Content (1-78) Original Series]"
    }
  ]
}