{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Jaffa (1917)\n\n| partof     = the Middle Eastern theatre of World War I\n| date       = 20–21 December 1917\n| place      = Auju River, Jaffa\n| result     = British victory\n| combatant1 =\n| combatant2  =\n| commander1  =Lieutenant General Edward Bulfin\n|commander2   =Jawad Pasha\n| units1   = XXI Corps\n| units2   = Eighth Army\n| casualties1 =\n| casualties2 =\n| campaignbox =\n}}\nThe Battle of Jaffa was an engagement fought during the Southern Palestine Offensive of the Sinai and Palestine Campaign in World War I, between the Egyptian Expeditionary Force of the British Empire on one side and the Yildirim Army Group of the Ottoman Empire and German Empire on the other.\nThe port of Jaffa had been occupied by the New Zealand Mounted Rifles Brigade on 16 November, as a result of the victory gained by that brigade and the 1st Light Horse Brigade at the Ayun Kara two days before, but the Ottoman forces were only  away across the Auju River (now better known in Arabic as 'Auja River, and in Hebrew as Yarkon River). The closeness of the Ottoman army made the port and town unusable to shipping, still being within range of Ottoman artillery.\nOver the night of 20–21 December 1917, the 52nd (Lowland) Division carried out an assault river crossing. With the far side of the river taken, the other divisions of the XXI Corps with their supporting artillery crossed and forced the Ottoman defenders to withdraw . With the Ottoman forces pushed back, Jaffa and communications between it and Jerusalem were made secure. The night crossing of the river has been regarded as one of the most remarkable feats of the Palestine campaign.\nBackground\nOn 16 November 1917 the British forces occupied the port of Jaffa on the Mediterranean coast. However, the Ottoman forces forced out of the town were still able to interdict shipping and stop troop movements from their positions on the northern bank of the Yarkon River—the Nahr el Auja as it was called in Arabic.\nThe British commander General Edmund Allenby needed to establish a defensive line running from the Mediterranean Sea which could be held with reasonable security once his right flank was secured on the Dead Sea. In order to consolidate a strong British line, it was necessary to push the 3rd and 7th Divisions, part of the XXII Corps, of the Ottoman Eighth Army away from the Nahr el Auja  north of Jaffa on the Mediterranean coast.\nThe river was defended on the northern bank, by a trench system, from Mulebbis and Fejja to Bald Hill.\nFrom Mulebbis to the sea the river is between  wide and  deep except for the ford. The first attack across the Nahr el Auja, was little more than a raid, on the night of 24/25 November by two infantry battalions from the 54th (East Anglian) Division and the New Zealand Mounted Rifles Brigade. The outnumbered battalions, were driven back by the Ottoman defenders, as they recaptured the bridgeheads and restored the tactical situation.\nBritish attack\nBuild up\nThree infantry divisions of the British XXI Corps, under the command of Lieutenant General Edward Bulfin, began moving their units into position on the coastal plain on 7 December. The 75th Division was on the right with the 54th (East Anglian) Division in the centre and the 52nd (Lowland) Division on the left at the coast. The 162nd (East Midland) Brigade, relieved the New Zealand Mounted Rifles Brigade in the front line on 11 December and the mounted riflemen, who had been heavily involved in the earlier attempt to capture the Nahr el Auja, moved back to bivouac near Ayun Kara.\nOn 14 December Major General John Hill, the commanding officer of the Lowland Division, submitted a plan for a surprise assault across the river by his division. Artillery was concentrated behind the lines, while the division's Royal Engineers, formed pontoons and canvas coracle boats, that were large enough to accommodate twenty men.\nIt had initially been planned for a heavy artillery bombardment to proceed the attack, however Hill suggested they instead try a surprise attack without the artillery bombardment. Then in the days preceding the attack, the artillery batteries conducted several engagements, mostly to suppress Ottoman patrol activity and registrar the guns on targets, in case they were needed in the coming assault.\nOver the night of 18/19 December, the 161st (Essex) Brigade from the 54th (East Anglian) Division and the Auckland and Wellington Mounted Rifles Regiments, from the New Zealand Mounted Rifles Brigade, moved into the front line replacing the 52nd (Lowland) Division. To cover the gap in the line left by the redeployment of the 161st Brigade the 75th Division extended its front westwards to include Ludd.\nThe preparations for the attack were hindered by the sodden state of the low and swampy ground on the southern banks of the Nahr el Auja where the attack would be launched, made worse by three days of rain.\nAssault\nOver the night of 20/21 December in heavy rain the division carried out an assault river crossing, using pontoon bridges and boats. The 155th (South Scottish) Brigade crossed the river east of Jerisheh, and then turned right attacking the Turkish position. The 156th (Scottish Rifles) Brigade and the 157th (Highland Light Infantry) Brigade both crossed the river west of Jerisheh.\nThe first unit to cross about a  from the river mouth was a company of the 7th Battalion, Cameronians (Scottish Rifles), of the 156th Brigade. Several of the flimsy boats collapsed, and the men were forced to wade across the chest deep river. Once across they established a bridgehead on the Ottoman bank of the river. When they were secure the engineers started building a pontoon bridge, for the main force to cross. By 23:00 almost three of the division's battalions had crossed the river. The 8th Battalion, Cameronians (Scottish Rifles) and the 4th Battalion, Royal Scots, from the 156th Brigade and the 7th (Blythswood) Battalion, Highland Light Infantry, from the 157th Brigade.\nbuilt by British engineers]]\nBy midnight all the 156th Brigade had crossed over attacked the Ottoman position on a hill at Sheikh Muannis, which overlooked the river and all the other positions in the area.\nThe rest of the 157th Brigade were not as fortunate, when they were crossing the river, being targeted by an Ottoman artillery barrage. However, by 01:30 two other battalions—the 6th Highland Light Infantry and the 5th Argyll and Sutherland Highlanders—had crossed the river and secured the high ground overlooking the crossing point by 03:30. The 157th also secured the northern bank of a ford to assist the crossing.\nThe 155th Brigade mounted two distraction attacks to cover their real attempt by the 5th Battalion King's Own Scottish Borderers who, using rafts, crossed the river. By dawn the whole brigade had crossed the river and secured the heights at Khirbet Hadra.\nThe whole division had crossed the river in darkness, and all Ottoman resistance was overcome by British troops using their bayonets and no shots were fired. The attack completely surprised the Ottoman defenders and their front line were forced back . By dawn the British held a line from Hadrah to Tel el Rekkeit, around  north of the river. It had been intended for the ANZAC Mounted Division, to cross over and pursue the retreating Ottomans. However the rainfall over the preceding days and the damp boggy ground, prevented them from following the retreating Ottoman survivors, who escaped unhindered.\nWith the northern river bank in British hands, the engineers constructed bridges to allow their artillery to cross the river. The next day, 22 December, the British position was made even more secure when the 54th (East Anglian) Division captured Bald Hill to the right of the 52nd. In doing so the Ottoman defenders lost fifty-two killed and forty-four more were taken prisoner. By dawn the 54th Division had advanced further north occupying Mulebbis and Fejja; later in the day they also captured Rantieh.\nThe 52nd Division continued the advance on the left, supported by naval gunfire from a Royal Navy flotilla. Three destroyers Grafton, Lapwing and Lizard and two monitors M29, and M32. By the end of the day they had secured Tel el Mukhmar the Wadi Ishkar and the Auja-Sheikh el Ballutah-Arsuf, on the cliffs above the sea  north of Jaffa. During the battle of Jaffa the attacks by the two British divisions had forced the Ottoman forces back .\nAftermath\n, with the river in the background]]\nThe battle was a success for the British, with 316 Ottoman prisoners taken and ten machine guns captured. The battle was mentioned in General Sir Edmund Allenby's despatch; \"The successful crossing of the Nahr el Auja reflects great credit on the 52nd (Lowland) Division. It involved considerable preparation, the details of which were thought out with care and precision. The sodden state of the ground, and, on the night of the crossing, the swollen state of the river, added to the difficulties, yet by dawn the whole of the infantry had crossed. The fact that the enemy were taken by surprise, and, that all resistance was overcome with the bayonet without a shot being fired, bears testimony to the discipline of this division....The operation, by increasing the distance between the enemy and Jaffa from three to eight miles, rendered Jaffa and its harbour secure, and gained elbow-room for the troops covering Ludd and Ramleh and the main Jaffa-Jerusalem road.\"\nThe British official history described the battle;The passage of the Auja has always been regarded as one of the most remarkable feats of the Palestine campaign...its chief merits were its boldness&nbsp;— justifiable against troops known to be sluggish and slack in outpost work and already shaken by defeat&nbsp;— its planning, the skill of the engineers;the promptitude with which unexpected difficulties in the bridging the river were met; finally, the combined discipline and dash of the infantry which carried out the operation without a shot being fired and won the works on the right with the bayonet.\nThis was one of the last actions the 52nd (Lowland) Division fought in this campaign. In March 1918, they were ordered to move to the Western Front in France. The 54th (East Anglian) Division remained in Palestine taking part in operations at Berukin in April 1918 and the battle of Sharon in September.\nThe British units involved in the battle were awarded the distinct battle honour Jaffa.\nReferences\n;Citations\n;Bibliography\n*\n*\n*\n*\n*\n*\n*\n*\n*"
    }
  ]
}