{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Firebase Anaconda__disambig_1\n\n|combatant2= Taliban\n|commander1=\n|commander2=\n|strength1=Unknown\n|strength2=~75 insurgents\n|casualties1=None\n|casualties2=20\n}}\nThe Battle of Firebase Anaconda (not to be confused with Operation Anaconda) was a military engagement that took place on August 8, 2007, during the War in Afghanistan. A group of roughly 75 Afghan militants mounted a rare frontal assault on a United States' Firebase Anaconda, but was repulsed with approximately 20 fatalities. No Americans were killed.\nThe attack was rare in that, instead of using asymmetric warfare tactics such as launching mortars at the base and quickly retreating, the Taliban forces staged a direct assault on U.S.-led forces.\nAttack\nThe attacking force never passed the \"Entry Control Point\" and failed to penetrate the base's defences.\nAftermath\nA month after the initial assault, a second attempt was made to overrun one of the firebase's outer observation posts after a mortar attack. Ten militants were killed, again without inflicting any coalition casualties.\nShortly after the second attempt, the Australian SOF elements from the 4th Battalion Royal Australian Regiment (Commando) and Special Air Service Regiment (SASR) conducted a road-move from their operating base in Tarin Kowt to reinforce the combat fatigued US SOF elements based at FOB Anaconda. On arrival, the Australian SOF elements were met with some resistance but quickly gained control of the Khas Uruzghan district centre. Over the next two weeks, Australian and US SOF elements conducted a range of direct action operations from FOB Anaconda which degraded the adversaries' confidence and pushed their combat power out of the Khas Uruzgan District Centre. The Australian SOF elements subsequently extracted from the Khas Uruzgan area back to their base in Tarin Kowt before moving into the Chora area to conduct advanced targeting and screening operations in support of the \"Battle of Chora\" in September 2007. During this operation, Sgt Matthew Locke from the Special Air Service Regiment was killed. Following the operation and while en route to Tarin Kowt, Private Luke Worsley of the 4th Battalion Royal Australian Regiment (Commando) was killed in a direct action operation against known IED facilitators and leadership figures in the north of Mirabad in a village called Musoud Kalay.\nReferences"
    }
  ]
}