{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Okpo__disambig_1\n\n| partof            = Imjin War\n| date              = June 16, 1592 (Gregorian Calendar); May 7, 1592 (Lunisolar calendar)\n| place             = Okpo Bay, Gyeongnam, Korea\n| result            = Korean victory\n| combatant1        = Toyotomi Japan\n| combatant2        = Kingdom of Joseon\n| commander1        = Tōdō Takatora\n| commander2        = Yi Sun-sinWŏn KyunEo Yeong-dam\n| strength1         = 50 transports\n| strength2         = 43 warships2 small ships46 fishing boats\n| casualties1       = 26 transports\n| casualties2       = 1 wounded|\n}}\nThe Battle of Okpo was a military engagement which took place during the Japanese invasions of Korea (1592–98), also known as the Imjin War. Korean commanders Yi Sun-sin and Wŏn Kyun's fleet destroyed a group of anchored Japanese transport ships. It was the first naval battle of the Imjin War, and the first victory of Admiral Yi against the Japanese naval fleet of Todo Takatora. A day later, after destroying an additional 18 Japanese transport vessels in nearby waters, Yi Sun-sin and Wŏn Kyun parted ways and returned to their home ports after receiving news of the fall of Hanseong. The Battle of Okpo caused anxiety and nervousness among the Japanese, because afterward Yi began to deploy his navy to attack Japanese supply and carrier vessels.\nYi's headquarters were at Yeosu, which is west of Namhae Island of the southern coast of Korea. The surrounding area of Okpo and Yeosu is dotted with numerous islands and narrow straits. It was in that area where many of the naval battles in which Yi defeated the Japanese took place.\nBackground\nThe Japanese invasion of Korea began with the arrival of 400 transports bearing 18,700 men under the command of Konishi Yukinaga on 23 May 1592 for the Siege of Busanjin. Over the next several weeks, the Japanese fleet ferried Toyotomi Hideyoshi's invasion force of 158,000 men to the Busan area, and the Japanese armies had advanced rapidly northward, and had seized the Korean capital of Hanseong by 16 June. As the Japanese now prepared to advance further north, logistics became an issue, and Japanese transports began exploring further up the west coast of the Korean peninsula as it was not practical to carry large amounts of supplies overland given the rough terrain and poor state of the roads.\nAt the time of the invasion, the Korean naval forces were divided into regional commands. Panicking after the fall of Busan to the Japanese, Gyeongsang Left Navy Commander Bak Hong ordered his weapons and stores destroyed, and scuttled his fleet of 100 warships without giving combat. Likewise, after the fall of Dongnae, Gyeongsang Right Navy Commander Wŏn Kyun attempted to withdraw his ships to Hansando but mistook a bunch of fishing ships for the Japanese fleet. He proceeded to destroy his weapons and stores, and to scuttle his fleet. He was dissuaded from deserting his command by his subordinates, by which time he had only four vessels remaining.  Wŏn Kyun called on Yi Sun-sin for assistance; however, as commander of the Cholla Left Navy, he was not allowed to leave his region without permission from his superiors. Yi also had a number of other reasons to delay. He needed to acquire charts of the rocky coastal waters of Gyeongsang Province for his fleet to navigate safely, and he was also uncertain of the discipline of the men under his command and was forced to execute deserters to set an example, including on 12 June, the day Hanseong fell to the Japanese. Yi Sun-sin had hoped to combine his forces with that of Cholla Right Navy Commander Yi Ŏkki; however, when orders came from the capital, he was ordered to combine with the now non-existent forces of Wŏn Kyun instead. With Wŏn Kyun's remaining four vessels, Yi Sun-sin had 39 warships under his command (24 large  and 15 smaller hyeupson) and 46 smaller open boats.\nWhen Yi Sun-sin and Wŏn Kyun arrived near Geojedo on 16 June, a scouting vessel alerted them to the presence of Japanese ships anchored at the port of Okpo.\nBattle\nYi Sun-sin's fleet approached Okpo on 17 June. Yi's flagship was in the center of a line with the other heavy warships in the center and light vessels to the left and right, and Wŏn Kyun lingering at the rear of the formation. When they entered the harbor they found more than 50 Japanese transport ships, mostly unmanned, and the crews looting in the village. Angered, Yi attacked. Due to smoke around Okpo, the Japanese did not notice the arrival of the Korean fleet until it was upon them. The Japanese panicked and quickly boarded their ships in an attempt to escape, but found they were surrounded and hemmed into the port. After encircling the Japanese, the Koreans then commenced firing with their cannons. Under order from Todo Takatora, the Japanese tried to fight back with their firearms but the arquebus, while effective on land, did little damage to the thick wooden hulls of the Korean warships. Yi Sun-sin proceeded to bombard the trapped Japanese transports with his cannon and fire arrows until the Japanese threw their weapons and armor overboard, abandoned ship, and jumped into the water. In total, 26 Japanese transports were destroyed during the bombardment.\nYi Sun-sin resisted the impulse to land his men and to pursue the surviving Japanese on the island, as the risk was great and such an action would leave his fleet undermanned and vulnerable. When a group of Yi Sun-sin's men seized a Japanese ship, Wŏn Kyun's ships fired on them, mistaking them for enemies.\nAftermath\nAfter the battle Yi Sun-sin immediately received news of five other Japanese ships within their vicinity and gave chase. The Japanese fled to Happo harbor and abandoned their ships, which Yi ordered to be burned.\nSoon after sunrise on 17 June, Yi Sun-sin received news of another 13 Japanese ships nearby and on setting sail, found the Japanese transports at Jeokjinpo. As at Okpo, the Japanese were engaged in looting and burning the village. Admiral Yi was again saddened by the Japanese harassment of the Koreans and ordered his men to throw a heavy volley of arrows and cannonballs upon the Japanese. They destroyed 11 out of 13 ships. The Koreans then took the treasures from the Japanese wrecks and sailed back to Yeosu. Enraged by the looting and encouraged by the ease of their success, Yi Sun-sin and Wŏn Kyun briefly considered continuing on to Busan to attack the main Japanese fleet. However, word came of the fall of Hanseong eight days before, and Yi Sun-sin and Wŏn Kyun decided to part ways and return to their home ports. Yi Sun-sin arrived back at Yeosu on 18 June, from which he wrote a long report to the court.\nYi Sun-shin's view of the Japanese slaughtering and looting local towns made him very determined to protect the Korean people by preventing the Japanese ships from even landing on shore. Later, at the Battle of Sacheon, he first used his \"secret weapon\", the turtle ships, and defeated the Japanese again.\nSee also\n*List of naval battles#Later 16th century\nCitations\nBibliography\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n* 桑田忠親 [Kuwata, Tadachika], ed., 舊參謀本部編纂, [Kyu Sanbo Honbu], 朝鮮の役 [Chousen no Eki]　(日本の戰史 [Nihon no Senshi] Vol.&nbsp;5), 1965.\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*"
    }
  ]
}