{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Dogali__disambig_1\n\n|combatant2  =\n|commander1  = Tommaso De Cristoforis\n|commander2  = Ras Alula Engida\n|strength1   = ~550 infantry\n|strength2   =15,000\n|casualties1 =430 killed80 wounded\n|casualties2 =730or1,071 killed\n}}\nThe Battle of Dogali was fought on 26 January 1887 between Italy and Ethiopia in Dogali near Massawa, in present-day Eritrea.\nHistory\nThe Italians, after their unification in 1861, wanted to establish a colonial empire to cement their great power status. Their occupation of coastal Eritrea brought Italian interests into direct conflict with those of Ethiopia (Abyssinia).\nAs soon as the Italians considered they were strong enough to advance into Abyssinia, they seized the villages of Ua-à and Zula along with the town of Sahati, in modern-day Eritrea, and erected a small redoubt on the heights commanding the water supply for the caravans. Ras Alula Engida, the governor under Emperor Yohannes IV, had at the time left Asmara, his headquarters, for the Basen country, in order to punish the Dervishes for raiding the Dembala provinces. On hearing the news of the Italian advance, he returned to Asmara and informed the Italian officials that they were violating the treaty between Abyssinia, Egypt, and Britain, and that any further movement of troops toward Sahati – the fortification of which could only be directed against Abyssinia – would be considered a hostile action and be treated accordingly. The Italians responded by strengthening their redoubt and reinforcing their garrison. By 25 January, the fort at Sahati was held by 167 Italians and 1,000 native troops. On his own initiative, Ras Alula attacked Sahati. Hundreds of his men were slaughtered by cannon and rifle fire, while only four Italians were injured, forcing Ras Alula to pull his men back. The besieged Italians, however, needed more ammunition and requested supplies.\nOn 26 January, a battalion of roughly 550 men (mostly Italians, including 22 officers, and a few Eritrean Askari) under Colonel Tommaso De Cristoforis, were sent to reinforce the Italian garrison at Sahati. The ras learned of their departure from spies, and before they could arrive at the fortification they had erected, he attacked them at Dogali and entirely defeated them. Although the Italians were well-armed with modern rifles, cannon, and machine guns, they were outnumbered 27 to 1; they fought back against the Ethiopians and held out for hours, but they eventually exhausted all their ammunition. Nearly all were killed, except for eighty wounded men who were able to escape, unnoticed by the Ethiopians.\nAlthough Dogali was only a small victory for the Ethiopians, Haggai Erlich notes that this incident encouraged the Italians to plot with Yohanne's rival Menelik, the ruler of Shewa, to encourage his insubordination towards the Emperor.\nItalians felt that the battle of Dogali was an insult to be avenged, and started to attack Ethiopia for revenge. They were able to occupy Eritrea in 1887–89, although they failed in the occupation of the remaining Ethiopian territory in the First Italo-Ethiopian War. In 1936, Fascist Italy launched a second invasion which resulted in the Italian victory and the occupation of Ethiopia, until it was liberated during WW2.\nModern Ethiopian celebrations\nThis battle was celebrated under the Derg regime, and Mengistu Haile Mariam commemorated the centennial with much attention, including the erection of a monument topped with a red star on the battlefield. Following Eritrean independence, the monument was removed. Paul B. Henze diplomatically notes in a footnote, \"When I crossed the battlefield in 1996, I could detect no trace of the monument.\"\nErlich provides more information: when Eritrean troops gained control of the area in 1989, \"a prominent commander of the Eritrean People's Liberation Front, and a former Minister of Foreign Affairs, Petros Solomon himself was delighted to blast Mengistu's monument of Ras Alula.\"\nThis could be attributed to the fact that while Alula was an administrator appointed by Yohannes IV over part of the Eritrean highlands, he committed many atrocities against the local Biher-Tigrinya population, sowing seeds of discord. Observers, including Erlich and others, attribute this to Eritrean Tigrinya views of their own relationship with Ethiopia as a whole.\nTributes\nThe 4-hectare square in Rome in front of Termini railway station is the Piazza dei Cinquecento, named in honor of the 500 Italian soldiers killed in the Battle of Dogali. Near the square is also a monument to those soldiers.\nThe  was named for the engagement.\nThe Ethiopian government of Mengistu Haile Mariam erected a monument at Dogali to commemorate its 100th anniversary in January 1987. The monument was designed to stress Ethiopia's historical rule in Eritrea amidst the ongoing Eritrean War of Independence. The monument was topped by a red star, a communist symbol of the People's Democratic Republic of Ethiopia. Eritrea won its independence in 1991 and by 1996 the monument had disappeared.\nNotes\nSources\n*"
    }
  ]
}