{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Donbas (2022)\n\nBattle of Donbas}}\ntemplate -->\n| map_type          =\n| map_relief        =\n| map_size          =\n| map_marksize      =\n| map_caption       =\n| map_label         =\n| territory         = Russia and separatist forces capture the cities of Sievierodonetsk, Lysychansk, Svitlodarsk, Lyman, Sviatohirsk, all remaining Luhansk Oblast cities, and many villages.\n| result            = Inconclusive\n| status            =\n| combatants_header =\n| combatant1        =  Donetsk People's Republic Luhansk People's Republic\n| combatant2        =\n| commander1        =\n| commander2        =\n| units1            = See order of battle\n| units2            = See order of battle\n| strength1         = 55,000–70,000\n| strength2         = 40,000–50,000\n| casualties3       = ~5,154+ civilians killed, 5,605+ woundedReports vary widely. See Casualties for more details.\n| notes             =\n| campaignbox       =\n| casualties1       =\n| casualties2       =\n}}\nThe battle of Donbas was a military offensive that was part of the wider eastern Ukraine campaign of the Russian invasion of Ukraine. The offensive began on 18 April 2022 between the armed forces of Russia and Ukraine for control of the Donbas region. Military analysts consider the campaign to have been the second strategic phase of the invasion, after Russia's initial three-pronged attack into Ukraine.\nRussia's strategy in the sector was to encircle Ukrainian troops in the Donbas and to annex the entire Donetsk and Luhansk oblasts to the Russian-backed separatist states of the Donetsk People's Republic (DPR) and Luhansk People's Republic (LPR). Russia claimed to have controlled 55% of Donetsk Oblast by 23 June 2022 and all of Luhansk Oblast by 3 July 2022, with Russian and separatist forces controlling the cities of Mariupol, Sievierodonetsk, Lysychansk, Rubizhne, and many others.\nThe Russian offensive stalled in September 2022 and some of the gains were reversed after Ukraine launched its Kharkiv offensive, with Ukrainian forces recapturing the cities of Lyman and Sviatohirsk in the Donetsk region and Bilohorivka in Luhansk oblast. The Ukrainian counteroffensive also stalled east of the Oskil river, and by November 2022 Russian assaults renewed in Luhansk and Donetsk oblasts.\nBackground\nWar in Donbas\nSince 2014, the Donbas region had been the site of protracted fighting between Russian-backed separatists from the self-proclaimed Donetsk and Luhansk People's Republics and the Ukrainian Armed Forces in the war in Donbas. Between 2014 and late 2021, the war had taken the lives of more than 10,000 combatants (including Ukrainian soldiers, Russian soldiers, and separatist combatants), as well as 3,095 civilians.\nPrior operations\n, 19 February 2022]]\nIn February 2022, mass evacuations and general mobilization began in the DPR and LPR quasi-states following aggravations along the \"line of contact\", the front line which had more or less remained static since 2014. On 21 February 2022, Russia officially recognized the DPR and LPR as sovereign states.\nOn 24 February 2022, the Russian Armed Forces and the DPR and LPR launched a full-scale invasion of Ukrainian territory across numerous fronts, including in the Donbas. North of the Donbas, Russian and loyalist forces began fighting in the battle of Kharkiv, as well as numerous other smaller battles aimed at capturing key Ukrainian cities and towns. In southern Donbas, the siege of Mariupol began, which would eventually kill over 25,000 civilians and destroy 95% of the city.\nOn 25 March, Russian officials declared that the first phase of their military operation in Ukraine was complete, announcing that its main objectives had \"generally been accomplished.\" Sergei Rudskoi, head of the Main Operational Directorate of the General Staff of the Russian Armed Forces, claimed that the combat potential of the Ukrainian Armed Forces had been \"considerably reduced,\" which would make it possible for Russian forces to focus their efforts on their main goal, the \"liberation\" of the Donbas region. A diplomatic official in Moscow described the announcement to Reuters as a \"face-saving move,\" arguing that Russia had launched the war with much more ambitious aims than just the Donbas.\nOn 29 March 2022, Russian officials declared that they intended to scale back their military operations in the region around the capital city of Kyiv. This effectively ended Russian operations in northern Ukraine. Russian military officials declared that the Ukrainian Navy and Air Force had been neutralized. They also stated that the DPR and LPR controlled 54% and 93% of Donetsk and Luhansk Oblasts, respectively. The tactical withdrawal of Russian forces from the north was completed by 6 April 2022.\nRussian forces captured Izium, a strategic city in eastern Kharkiv Oblast, on 1 April. After taking Izium, Russian troops then advanced south towards , which lies on the road to the strategically positioned city of Sloviansk. On 6 April, an Izium government official told CNN that intercepted radio communications revealed Russian plans \"to capture the Donetsk region from the north\". The Institute for the Study of War (ISW) predicted that \"efforts by Russian forces advancing south from Izium to capture Sloviansk\" would become \"the next pivotal battle of the war in Ukraine\", with the 1st Guards Tank Army having been redeployed to this direction from the Kharkiv and Sumy fronts.\nPrelude\nIn mid-April 2022, U.S. intelligence reported that Russia was \"repositioning\" its military units to the Donbas. Russian units from northern Ukraine battlefronts in Kyiv, Sumy, Chernihiv, and elsewhere were noted by Maxar satellite imagery to be relocating to the Donbas region, while reinforcements from regions in Belarus and Russia supplemented these units. By 13 April, military analysts expected Russia to imminently launch a \"battle for Donbas\" as new reinforcements arrived from Russia, Belarus, and northern Ukraine.\nRussian Foreign Minister Sergey Lavrov acknowledged the beginning of a new offensive in Donbas, claiming it to be a \"very important moment in this entire special operation.\" To address the new stage of the Russian offensive in Ukraine, French President Emmanuel Macron and US president Joe Biden held a meeting with representatives from France, Germany, the United Kingdom, Canada, Italy, Poland, and Romania. They were joined by NATO Secretary General Jens Stoltenberg, European Commission President Ursula von der Leyen and European Council President Charles Michel.\nRussian objectives\nOn 22 April 2022, a commander of Russia's Central Military District, Rustam Minnekayev, declared that the aim of the \"second phase\" of the country's invasion of Ukraine was to fully seize Donbas and Southern Ukraine and to establish a land corridor with Transnistria, a Russian-occupied, internationally unrecognized breakaway republic that is internationally recognized as part of Moldova. He alleged that there was \"evidence that the Russian-speaking population is being oppressed\" in Transnistria. The Ministry of Defence of Ukraine replied to this announcement by describing Russia's intentions as imperialism, saying that it contradicted previous Russian claims that assured that Russia did not have territorial ambitions over Ukraine and that Russia had admitted that \"the goal of the 'second phase' of the war is not victory over the mythical Nazis, but simply the occupation of eastern and southern Ukraine\".\nIn mid-April 2022, Western defense and intelligence officials told Financial Times that Russia's main targets were the cities of Sloviansk and Kramatorsk, described as holding the key to control over Donbas. The Russian military was expected to advance on these cities from three directions: south from Izium, west from Sievierodonetsk, and north from the city of Donetsk.\nOn 30 June 2022, ISW assessed that despite Russia's concentration in the east, they still had territorial ambitions beyond Luhansk and Donetsk Oblast. According to Russian sources, the official representative of the LPR forces, Andrey Marochko, stated on 3 July 2022 that in order to secure the LPR land, their, DPR and Russian forces must push the Ukrainian forces away from the LPR's borders for no less than 300 kilometers. The 300&nbsp;km claim would mean the full Kharkiv Oblast and Donetsk region, parts of Dnipropetrovsk Oblast, Zaporizhzhia Oblast, Sumy Oblast and Poltava Oblast. Russian sources said that the LPR's ambassador in Russia, , confirmed on 4 July 2022 that LPR troops would continue to participate in the Donbas offensive, saying the presence of Ukrainian units along the LPR's borders would threaten security.\nOpposing forces and foreign involvement\nRussian and pro-Russian forces\nKadyrovites in the Donbas in June 2022]]\nOn 18 April, a U.S. Department of Defense official said Russia had deployed an additional 11 battalion tactical groups (BTGs) days before launching the offensive, resulting in a total of 76 BTGs operating in both Donbas and southeastern Ukraine. An estimated 12 BTGs were engaged in the siege of Mariupol. According to The Guardian, the 76 battalion tactical groups constituted approximately 60,000 soldiers, which was about three-fourths of the manpower of the invasion force. However, the Ukrainian General Staff said on the same day that there were 87 Russian BTGs across Ukraine with a total of 70,000 soldiers.\nA senior U.S. defense official said that two more Russian battalion tactical groups were deployed between 18 and 19 April, for a total of 78 BTGs across southern and eastern Ukraine. AP News estimated that Russia had 55,000–62,000 troops in Ukraine, based on an earlier Pentagon statement that the typical size of a BTG was 700-800 soldiers.\nWestern media, citing European officials, reported that 10,000–20,000 Libyan, Syrian, and Wagner Group mercenaries were deployed for the offensive in the Donbas.\nBritish military expert Frank Ledwidge wrote on 12 April that Russian forces were \"nowhere near\" the three-to-one ratio that attacking forces should number over their opponents, according to what he called \"one of the firmest rules of warfare.\" However, Russian forces achieved a three-to-one numerical superiority over their Ukrainian counterparts by 25 April, according to the BBC and the Financial Times, citing Western experts.\nUkrainian forces\ngreets soldiers of the 24th Mechanized Brigade in the Donbas on 5 June 2022]]\nBefore the February invasion, 40,000 Ukrainian troops were stationed in the Donbas. Financial Times called those forces, veterans of the Joint Forces Operation, \"some of Ukraine's best trained and most battle-hardened soldiers\".\nPresident Volodymyr Zelenskyy said on 14 April that Ukrainian forces numbered 44,000 in the Donbas region. On 19 April, the BBC reported that Ukrainian troops in the Donbas numbered 40,000–50,000 men.\nForeign support for Ukraine\nThe Ukrainians continued a campaign of targeting Russian ammunition depots and logistics sites in Donetsk province with air strikes and, reportedly, U.S.-supplied M142 HIMARS or M270 rocket artillery systems. Video emerged of an apparent ammunition depot in Snizhne, Donetsk Oblast exploding, with pro-Ukrainian sources suggesting Ukrainian forces used M142 HIMARS supplied by the U.S. to attack the depot deep behind Russian-DPR front lines. Oleksiy Arestovych, a Ukrainian presidential advisor, claimed that continued attacks on Russian ammunition depots and increased Ukrainian artillery supplies from NATO countries were forcing the Russians to conserve artillery shells and rockets for the first time. He argued that if this trend continued, the Ukrainians would, eventually, achieve artillery and logistical superiority on the battlefield in the Donbas. President Zelenskyy, in his nightly public address, also hailed the impact Western-supplied artillery pieces were reportedly having on Russian logistics and strike capabilities. In late July 2022, Ukrainian soldiers and officers fighting in Donetsk offered anecdotal evidence of a significant reduction in Russian artillery fire.\nThe Mozart Group, a group of former Western soldiers serving as volunteers in Ukraine, was evacuating civilians and offering informal combat training to Ukrainian troops, primarily on casualty care and medical evacuation.\nBattle\nEarly operations (April–May 2022)\nwith pontoon bridges, April 2022]]\nOn the night of 18 April 2022, Russian forces launched an intensive bombardment campaign against positions in Luhansk, Donetsk, and Kharkiv Oblasts. Ukrainian president Volodymyr Zelenskyy announced that the \"battle for Donbas\" had begun. Russian artillery pounded cities in the Donbas, aiming at destroying critical infrastructure.\nOn 18 April, in the Slobozhansky and Donetsk operational districts, Russian troops intensified offensive operations in some areas, attempting to break through the Ukrainian defenses along almost the entire front line in Donetsk, Kharkiv and Luhansk regions. The head of the Luhansk regional military administration and effective governor of the oblast, Serhiy Haidai, called on the region's residents to evacuate immediately so as to not become hostages or be killed by the Russians.\nPopasna\nLarge areas of Popasna were occupied during the first week of the battle of Donbas. On 20 April, Libyan and Syrian mercenaries likely associated with the Wagner Group allegedly clashed with Ukrainian forces in Popasna. The Ukrainian government claimed that 20–25 mercenaries had been killed.\nIn late April, Russian forces were said to be preparing to capture Popasna and advance past it. By 7 May, the now largely destroyed city of Popasna was captured by Russian and Luhansk People's Republic forces, with this being confirmed by the regional governor.\nDonetsk Oblast\nIn the first week of the battle of Donbas, a Ukrainian official claimed that  Russian forces captured 42 villages in the Donetsk Oblast, though she did not specify which villages had been captured. Meanwhile, the Ukrainian government stated their forces launched a counterattack and recaptured the town of Marinka. Russian shelling overnight in Donetsk Oblast on 20 April killed two civilians and wounded nine, according to online news sources. , in northern Donetsk Oblast was captured by Russian and LPR forces on 23 April, followed by Yatskivka and  on 26 April, and Zarichne on 27 April.\nBetween 22 April and 29 April, 110 DPR servicemen were killed and 451 were injured. On 24 May, Russian forces intensified artillery strikes against Avdiivka and took advantage of their previous capture of Novoselivka to advance on Avdiivka and gain highway access toward Sloviansk.\nLuhansk Oblast\nKreminna was captured by Russian and separatist forces overnight between 17 and 18 April, becoming the first city to fall since the beginning of the offensive. Ukrainian officials reported on 25 April that Russian forces were killed in a gas explosion in the Russian-occupied Kreminna City Hall.\nOn 24 April, Russian and LPR forces seized the small towns of Popivka, Pishchane, and Zhytlivka northwest of Sievierodonetsk, establishing a bridgehead over the Krasna River, though ISW assessed that Russian troops in the region remained unlikely to be able to launch large offensive operations. South of the Seversky Donets river, the Ukrainian military announced that Novotoshkivske fell on 27 April.\nduring the battle of the Siverskyi Donets.]]\nRussian forces advanced in Rubizhne between 19 and 20 April. In late April, ISW said that Russian forces were pushing to encircle and fully capture Rubizhne, which fell on 12 May.\nFrom 5–13 May, a major battle on the Donets river took place, with Ukrainian defenders successfully repelling multiple Russian attempts to cross the river. The Ukrainian armed forces claimed to have destroyed an entire battalion of Russian forces, killing up to 1,000–1,500 soldiers. The Institute for the Study of War (ISW) think tank reported that out of a force of 550 Russian troops, 485 were killed and wounded, as well as 80 vehicles lost.\nAccording to Ukrainian sources, the Russian military had allegedly planned to capture the entire Luhansk Oblast by 9 May.\nIzium–Sloviansk front\nRussian forces on the Izium front were reinforced in late April, amid continued attacks toward Sloviansk, Kramatorsk, and Barvinkove. Russian sources identified Dovhenke as the last Ukrainian-held settlement on the Sloviansk front before the Kharkiv–Donetsk Oblast border. ISW assessed that the Russian advances from Izium were intended to merge with offensives from territory held by the Donetsk People's Republic.\nKharkiv Oblast governor Oleh Syniehubov claimed the Ukrainian military launched a counterattack against Russian forces near Izium on 14 May. On the same day, however, pro-Russian Telegram channels claimed that Russian forces entered Dovhenke, but the ISW assessed that they were unable to secure the settlement due to heavy fighting, and suggested that a Ukrainian counteroffensive in the region had yet to begin.\nBy 15 May, ISW noted that Russian forces had likely been scaling down their operations from Izium toward Sloviansk, which they characterized as \"slow\" and \"unsuccessful\".\nCapture of Sievierodonetsk and Lysychansk, attempted advance on Sloviansk (May–July 2022)\nBy 15 May, the Institute for the Study of War assessed that Russian military command had likely abandoned its \"more ambitious\" goal of seizing the Donetsk Oblast through a large encirclement, predicting that the battle of Sievierodonetsk and the capture of Luhansk Oblast would be prioritized going forward.\nBy late May, Russian forces had broken through in many regions across the front line. Russian troops were seen to be using a new \"cauldron\" approach to their efforts, abandoning large encirclements in favor of smaller ones, which enabled them to make the first major gains of the battle.\nCapture of Lyman and Sviatohirsk\nPro-Russian separatist officials announced that their forces had begun an assault on Lyman on 24 May; they captured the city by the 26th or 27th. Ukrainian forces were also reported to have been leaving Sviatohirsk, the last Ukrainian-controlled city north of the Donets river, which fell to Russian and separatist forces by 8 June.\nIzium–Sloviansk front\nAccording to the Ukrainian News Agency, Ukrainian soldiers repelled a new assault on Dovhenke on 6 June. On 7 June, combined Russian and LPR forces launched an offensive through the forests south of Izium towards the city of Sloviansk, but were stopped at Bohorodychne and Krasnopillia.\nThe Ukrainian military frequently reported combat in the areas of Dovhenke, Mazanivka, Krasnopillia, Dolyna, and Bohorodychne throughout June. By capturing Bohorodychne and Krasnopillia, Russian and separatist forces would be able to push southwards to Sloviansk and Kramatorsk, two of the last major Ukrainian-held cities in Donetsk Oblast.\nPopasna–Bakhmut front\nOn 20 May, Russian forces made further advances in the west and south of Popasna, with the aim of cutting off the road to Sievierodonetsk. Despite stiff Ukrainian resistance, Russian forces finally broke through in the Popasna area on 20 May. By 22 May, Russian forces managed to secure their route of advance and attempted to simultaneously push west towards Bakhmut and north to cut off-road links to Sievierodonetsk. By 24 May, Russian forces captured the town of Svitlodarsk.\nSievierodonetsk front\nOn 1 June, Ukraine announced that 7080% of Sieverodonetsk had been captured by Russian forces. On 3 June, Ukraine claimed to have launched a counterattack to take back 20% of the city. On 8 June, however, the Ukrainian Army was pushed back to the outskirts of the city.\nWith the breakthrough west of Popasna significantly slowed by Ukrainian heavy guns, Russia began an offensive to the northeast of Popasna, aiming to bypass the Siverskyi Donets river and bombard Lysychansk from the south. The ISW assessed that Russian commanders had been given the deadline of 26 June to make a breakthrough and seize Luhansk Oblast's full administrative territory.\nFall of Sievierodonetsk and Lysychansk\ntroops advance towards Lysychansk, June 2022]]\nafter Russian shelling on 27 June 2022]]\nThe Russian military began breaking through in the south by 21 June, seizing Toshkivka and capturing , Myrna Dolyna,  and  all on 22 June. On 23 June, Russian forces cut off and surrounded the towns of Hirske and Zolote, which they claimed to have fully captured by next day. In addition, Russia made a push to fully secure the Azot chemical plant in Sievierodonetsk, which by 14 June had become the last refuge for Ukrainian soldiers in the city. Russian troops were less successful on the northern axis, attempting to make breakthroughs near Mykolaivka and Bohorodychne, in an attempt to advance on the Donetsk city of Sloviansk. Nonetheless, the Russian advance ground on, with Russia's breakthrough in the south putting pressure on the few remaining Ukrainian defenders of Luhansk Oblast to withdraw to defensive lines near the border with Donetsk Oblast.\nRussian forces had fully encircled Hirske and Zolote in their drive north to Lysychansk by 24 June. Russian sources claimed that Ukrainian forces had suffered over 1,000 casualties, including 800 prisoners, in Hirske, Zolote and near Lysychansk over the previous two days.\nAlso on 24 June, Ukrainian Deputy Defense Minister Hanna Malyar claimed that the Russians were firing 60,000 shells per day, 10 times more than the Ukrainians.\nBy 25 June, Ukrainian officials had announced that their troops had retreated from Sievierodonetsk in order to avoid being surrounded by Russian troops, signalling the city's capture. By 1 July, Russian forces continued encircling Lysychansk from the south and west, attempting to cut off the T1302 Lysychansk-Bakhmut highway from the city. As part of the encirclement, Russian forces claimed to have also seized Pryvillia, northwest of Lysychansk, after units made river crossings to the north and west of the town. Ukrainian positions near Siversk, Bilohorivka, Vovchoyarivka, Berestove, Yakovlivka, Vidrodzhennia, Mayorsk, and the Vuhlehirska thermal power plant were shelled by artillery.\nOn 2–3 July, Russia and LPR separatist forces claimed to have captured and controlled Lysychansk, however Ukrainian officials, including president Volodymyr Zelenskyy, had yet to officially acknowledge the strategic city's capture, only saying there were ongoing fierce clashes for the city. The Institute for the Study of War (ISW) supported the Russian claim that Lysychansk had fallen on 2 July, suggesting the Ukrainian defenders likely \"deliberately withdrew\" from the city. Furthermore, the Russian defence ministry claimed to have captured and were in the process of clearing many settlements on the Lysychansk outskirts, including Verkhniokamianka, Zolotarivka, Bilohorivka, Novodruzhesk, Maloriazantseve, and Bila Hora. Ukrainian officials subsequently conceded that Lysychansk was captured.\nWith the fall of Lysychansk and its western outskirts, Russia and the Luhansk People's Republic declared full control of Luhansk Oblast for the first time, achieving an objective of the Russian-led campaign. Russian shelling of Sloviansk intensified on 3 July.\nRussian operational pause (4–16 July 2022)\nRussian rocket in Oleksandrivka on 6 July 2022]]\non 11 July 2022]]\nAfter fully capturing and occupying Luhansk Oblast, Russian president Vladimir Putin ordered defence minister Sergei Shoigu to continue the offensive in Donbas as planned, adding that units that fought on the Luhansk front \"should certainly rest and increase their combat capabilities.\" According to the Institute for the Study of War, Russian forces made no claimed or assessed territorial gains \"for the first time in 133 days of war\" and suggested that Russia was likely taking an \"operational pause\" to rest and regroup its forces before a planned renewed assault. The UK defence ministry expected the city of Siversk to be the immediate tactical objective of their renewed assault. By 14 July, Haidai said that Russian forces were trying to take Siversk in order to eventually advance on Bakhmut.\nAn intelligence briefing by the UK defence ministry on 4 July said Russian forces would \"almost certainly\" transition to capturing the rest of Donetsk Oblast, around 55 percent of which was already in control by Russian and Donetsk People's Republic (DPR) separatist forces. The ministry predicted the fighting in Donetsk would continue to be \"grinding and attritional,\" typified by massive artillery shelling leveling towns and cities amid slow ground advances. Ukraine's governor of Luhansk, Serhiy Haidai said he expected Donetsk cities such as Sloviansk and Bakhmut to soon come under heavy Russian attack, and said both cities were increasingly being shelled. Similar to UK intelligence reports, the Ukrainians expected the Russians to push west along the Bakhmut-Lysychansk highway. On 5 July, the mayor of Sloviansk, , urged residents to evacuate the city. \"The nearest Russian positions are 7–10 km from the city,\" said Liakh. The governor of Donetsk Oblast, Pavlo Kyrylenko, urged the 350,000 remaining residents to evacuate the province. All civilians remaining in the unoccupied parts of Donetsk region were later ordered to evacuate by Zelenskyy on 30 July. According to Ukrainian estimates, 200,000–220,000 civilians still lived there at the time.\nHaidai claimed that an attempt by Russian regular and reserve troops to expand a bridgehead on the Donets river had been stalled by a Ukrainian artillery attack. Pro-Russian sources claimed the village of Spirne had been captured and advances were made during renewed ground assaults on the northern Donetsk village of Verkhnokamyansk; the claims were not independently confirmed at the time. Reportedly, both Russian and Ukrainian sources confirmed that Ukrainian forces had recaptured the village of Solodke in a limited counterattack. A separatist official claimed that Russian forces captured the village of Hryhorivka on 9 July.\nOn 11 July, President Zelenskyy dismissed the notion that there was an ongoing \"operational pause\" by the Russians, citing continued deadly shelling, air strikes, and continued reports of Ukrainian troops \"repelling\" various Russian assaults. Zelenskyy insisted that 34 Russian airstrikes in the past 24 hours were not indicative of an \"operational pause\".\nBritish intelligence assessed that the Russian army's next focus would be small towns on the approach to Sloviansk and Kramatorsk, two cities which it said remained main Russian targets. The Ukrainian General Staff similarly expected future Russian assaults with the aim of creating more favorable conditions for an offensive from Izium to Sloviansk. Sloviansk was both geographically strategic and symbolically significant for its role in the earlier war in Donbas.\nAmid small-scale Russian ground assaults near Sloviansk, Siversk, and Bakhmut on 15 July, ISW suggested that Russian forces were emerging from their operational pause. The next day, the Russian Ministry of Defense announced that the operational pause had effectively finished.\nRenewed assaults in Donetsk Oblast (17 July–6 September 2022)\ntroops in the Donbas, July 2022]]\nBy 17 July, Russian forces were in control of about 55% of Donetsk Oblast. Donetsk People's Republic (DPR) Deputy Minister of Information Daniil Bezsonov stated on 25 July that the DPR expected to capture the entirety of Donetsk Oblast by the end of August. Various Russian and Western sources had previously reported that Russia intended to hold referendums in occupied areas by the first half of September, likely sometime around 11 September, which is the unified voting day in the Russian Federation.\nAccording to ISW, Russian forces had yet to make any meaningful forward progress by 20 July. Efforts to advance on Sloviansk had \"mostly ground to a halt\", with no significant Russian advances in weeks. Russian troops had yet to reach Siversk despite trying to capture it since taking Lysychansk, and were said to be degrading their combat power in localized fights for small, \"unimportant\" settlements south and east of Bakhmut. The think tank expected the renewed Russian offensive to culminate along the E40 highway without seizing Sloviansk or Bakhmut.\nBy late July, The Washington Post said that Russian advances in Ukraine had slowed \"almost to a standstill\". George Barros, an ISW analyst, told the newspaper that Russian forces were close to exhausting their ability to gain territory. He said the Russians might succeed in capturing \"one or two more\" towns, namely Siversk and Bakhmut, but would be unable to conquer the entirety of the Donbas region.\nRussian assaults near Bakhmut, Soledar, and Siversk\nDPR forces claimed to have taken control of Berestove on 20 July, suggesting that control over the village would be advantageous for future operations towards Soledar and Bakhmut. ISW assessed that Russian forces had prepared three directions of advance toward Bakhmut: southwest from Berestove and Soledar, west from Pokrovske, and north from Novoluhanske and the Vuhlehirska power station. Meanwhile, the group of Russian forces outside of Siversk was said to be downgraded by its earlier operations.\nOn 21 July, the British defence ministry warned that the Russians were closing in on the Vuhlehirska power station, the second largest power plant in Ukraine, and were attempting to make a breakthrough there.\nOn 25 July, Russian forces gained control of Berestove. An LPR representative posted video footage of Wagner Group mercenaries in front of the entrance sign to Novoluhanske online, indicating that Russian troops had advanced into the town located roughly 25&nbsp;km southeast of the Bakhmut outskirts. Several Russian sources also claimed that Russian forces had captured the Vuhlehirska power plant, located on the northern edge of Novoluhanske, and were actively clearing it, meanwhile the Ukrainian General Staff reported that the Russians only had \"partial success\" on that front. Pro-Russian sources said Wagner mercenary fighters took part in storming the power station and the fighting lasted several days before the plant was fully controlled by 26 July. The ISW suggested Ukrainian troops likely conducted a \"controlled withdrawal\" from the Vuhlehirska reservoir area north-west towards Semyhirya. A Ukrainian official confirmed the power plant's capture on 27 July.\nOn 26 July, the Ukrainian General Staff stated that Russian forces were fighting in the village of Semyhirya, west of the Vuhlehirska power plant. On 27 July, geolocated video footage posted online showed that Wagner mercenaries had reached Klynove, while pro-Russian Telegram channel Readovka claimed that Russian forces established control over Pokrovske.\nOn 28 July, the Ukrainian General Staff said the Russians made small gains near Soledar and Vershyna. The Ukrainian military claimed to have neutralised 270 Russian and pro-Russian troops and destroyed seven tanks on 28 July, and that they successfully repelled all assaults on the Soledar-Vershyna front. On this date, ISW suggested that the Russian force grouping in Donetsk Oblast may have deprioritized attempts to take Siversk in order to capitalize on their recent gains near Bakhmut, noting that the Russians had made no confirmed advances towards Siversk since taking control of the Luhansk Oblast in early July.\nOn 1 August, the British defence ministry said Russia had made slow progress on the Bakhmut axis during daily assaults in the last four days.\nOn 2 August, Russian defence minister Sergei Shoigu stated that Russian forces had captured six front line settlements in recent days: Berestove, Pokrovske, Novoluhanske, Semyhiria, Hryhorivka, and Stryapivka. The Ukrainian General Staff also stated that Russian forces had \"partial success\" along the Vidrodzhennia-Kodema line, about 20&nbsp;km southeast of Bakhmut.\nOn 5 August, Russian sources claimed that Russian troops were actively fighting at the Knauf Gips Donbas gypsum factory on the southeastern outskirts of Soledar. Geolocated footage posted by DPR troops suggested Travneve was likely captured by 5 August.\nRussian sources claimed the villages of Volodymyrivka and Stryapivka, located southeast of Soledar, were captured by 9 August. On 10 August, the DPR claimed to have captured Hladosove, west of Travneve.\nRussian and allied forces reportedly captured Kodema on 6 September.\nRussian assaults near Avdiivka, Pisky, and Marinka\nOn 28 July, the Ukrainian General Staff said the Russians had resumed assaults on Avdiivka and Pisky. The Ukrainians accused Russian troops of wearing Ukrainian uniforms during their ground assaults. The Ukrainian military claimed to have neutralised 270 Russian and pro-Russian troops and destroyed seven tanks on 28 July, and that they successfully repelled all assaults on the Avdiivka-Pisky front.\nHowever, the separatists claimed Russian and DPR forces in the Avdiivka area had made significant advances north and east of the city.\n's Kalmius Brigade fires Giatsint-B artillery on Ukrainian positions in July 2022. Video released by the Russian Ministry of Defence.]]\nOn 2 August, Russian forces captured Ukrainian positions around the Butivka Coal mine, southwest of Avdiivka, dislodging Ukrainian positions that had been held there since 2015.\nOn 5 August, separatist authorities claimed that separate DPR brigades and Wagner Group forces had taken control of half of Marinka, but the Ukrainians reported the assaults on Marinka were unsuccessful. On 6 August, combat footage confirmed that Russian forces advanced into the eastern outskirts of Marinka. On 7 August, Russian forces pierced through the defenses of Pisky and reached the center of the settlement.\nOn 11 August, Russian and DPR sources claimed that roughly 90 percent of Pisky had been captured, and combat footage purportedly showed the Russians bombarding the village with TOS-1A thermobaric artillery. The ISW assessed that Pisky had been captured by Russian forces by 24 August.\nRussian assaults near Sloviansk, Ukrainian counteroffensive\nRussian forces launched an unsuccessful attack on Bohorodychne, Krasnopillia, and the nearby village of Dolyna on 7 July. That same day, Russian forces also unsuccessfully tried to bypass Barvinkove from the east with the intention of cutting the E40 Izium-Sloviansk highway, a key supply route for Ukrainian troops. A major offensive took place in Krasnopillia on 11 and 12 July, with fierce shelling taking place in Dibrivne, Mazanivka, Adamivka, and Kurulka, all villages near Bohorodychne and Krasnopillia. The following day, on 13 July, further Russian attacks were repelled from the northern part of Krasnopillia and Dolyna, reportedly in an attempt to further cut off the Izium-Sloviansk highway.\nRussian offensives against Bohorodychne and Krasnopillia renewed unsuccessfully on 17 and 18 July, with heavy shelling taking place against the towns and nearby settlements. Shelling resumed again at Bohorodychne, Krasnopillia, and surrounding villages on 21 July. On 26 July, Russian forces began another offensive against Krasnopillia and Bohorodychne, although were again unsuccessful. Attacks restarted again on 31 July, when Russian forces began shelled Bohorodychne, Krasnopillia, and surrounding villages from the Russian-held village of Dmytrivka.\nOn 5 August, presidential advisor Oleksiy Arestovych announced that the Ukrainian army had started a new counteroffensive near Izium against Russian forces and that fighting had started again in Dovhenke. The next day, there was heavy Russian bombardment in the area, including in Dovhenke; this continued on 7 August. On 8 August, Arestovych said that, according to some sources, Dovhenke had been recaptured by the Ukrainian Armed Forces and that Ukraine was successfully advancing towards Izium. On 9 August, Arestovych said that \"Dovhenke is already behind us, according to some data. We have moved them.\" That day, the General Staff of the Ukrainian Armed Forces reported that Dovhenke and several other villages were being attacked by Russian forces. On 9 August, Ukrainian forces recaptured Mazanivka.\nRussian forces shelled Dovhenke and the villages around on 10 August. Fighting stagnated until 6 September, when a counteroffensive drove Russia from Dovhenke. It later pushed Russia from most of the Kharkiv oblast.\nRussian ground offensives relaunched on 21 August south and southeast of Izium, aiming to recapture villages retaken by Ukraine in the previous weeks. Ukrainian sources reported on 22 August that Russian troops attempted to advance on Dmytrivka and Nova Dmytrivka, along with launching more attacks on Krasnopillia. Ukrainian forces also managed to capture the villages of Dibrivne and Dmytrivka in these counterattacks.\nAftermath\nSome of the gains of the offensive were reversed in September 2022, after Ukraine launched a counteroffensive in Kharkiv Oblast, recapturing the cities of Lyman and Sviatohirsk in the Donetsk region, and Bilohorivka, a village close to Lysychansk in the Luhansk Oblast.\nMilitary analysts Rob Lee and Michael Kofman wrote that \"Ukraine's successes in Kherson and Kharkiv were largely a result of the losses it inflicted on the Russian military in the Battle for the Donbas in the spring and early summer.\" Despite Russia's territorial gains, they nevertheless called the outcome of the Donbas offensive a \"pyrrhic victory\" for Russia, citing long-term negative impacts on Russia's ability to hold the territory it gained during the offensive and the war in general. Namely, Russia expended vast amounts of manpower and artillery ammunition to take territory in the Donbas. Lee and Kofman noted that Russia compensated for losses in manpower and artillery shells by introducing mobilization, but interpreted Russia's restricted artillery shelling of Bakhmut in December 2022 as a result of resources being depleted during the Donbas offensive.\nUkraine's counteroffensive in Kharkiv Oblast largely stalled as their ground forces approached the Svatove–Kreminna line, returning to mostly positional warfare on this front by November–December 2022. In early November 2022, Russia launched a renewed offensive in northern and southern Donetsk Oblast, especially on the approach to Bakhmut.\nCasualties\nMilitary casualties\nThe Ukrainian government refrained from providing overall numbers of casualties to their own forces in the Donbas, although they did periodically offer various estimates of daily casualty counts. According to Ukraine, between 50 and 100 Ukrainian soldiers were being killed daily on the Donbas front as of late May 2022. By early June 2022, up to 200 Ukrainian soldiers were killed and 800+ wounded daily in the Donbas. By mid-June, some Ukrainian officials estimated that Ukrainian forces were sustaining well over the previous mark of 1,000 casualties per day, including 200–500 killed.\nWith respect to Russian casualties, the Ukrainian Operational Command East provided daily casualty claims of Russian troops until 2 July 2022.\nDuring the fighting, an LPR battalion commander was killed when he and his fighters were surrounded by Ukrainian forces close to Kreminna and \"fought to the last\", according to the LPR. The clashes left an unknown number of killed and wounded.\nOn 18 July 2022, two Americans, a Canadian, and a Swedish national were killed during a Russian tank ambush during clashes near Hryhorivka, northeast of Siversk. The foreign fighters were part of a special operations unit of Ukraine's Territorial Defence Forces.\n{|class=\"wikitable plainrowheaders\"\n|-\n!scope=\"col\"|Breakdown\n!scope=\"col\"|Casualties\n!scope=\"col\"|Time period\n!scope=\"col\"|Source\n|-\n! scope=\"row\" |Ukrainian forces(ZSU, NGU)\n|15,680+ killed\n|21 April – 2 July 2022\n|Russian Ministry of Defence\n|-\n! scope=\"row\"|Russian and allied forces(RAF, DPR, LPR, PMC Wagner)\n|19,063-19,563+ killed, excluding the Avdiivka front (see  note) However, these claimed figures have been verified by independent observers, and are probably inflated, as are most other casualty claims made by the two combatants.}}\n|18 April 2022 – 2 October 2022\n|Ukrainian Eastern Command\n|-\n!scope=\"row\"|Donetsk PR forces\n|2,575+ killed, 11,139+ wounded\n|23 April – 2 December 2022\n|Donetsk PR\n|}\nCivilian casualties\n(Donetsk) to Dnipro on 23 June 2022.]]\nDuring the battle, Russia intensified its attacks on civilian-populated areas. 60 civilians were believed to be killed and at least seven wounded due to a Russian airstrike on a school sheltering about 90 civilians in Luhansk Oblast, whereas the bodies of 44 civilians were recovered from rubble underneath an apartment building in Izium. During the battle of Kreminna, near Rubizhne and Lysychansk, Ukrainian forces lost control amid heavy fighting. More than 200 civilians were killed during the battle, with four additional civilians being killed and one more wounded as they attempted to escape the fighting. The Ukrainian government claimed that over 1,500 civilians were killed in Sievierodonetsk on 26 May. On 10 July, a Russian rocket attack in Chasiv Yar struck a multi-story residential building, killing at least 34 people.\nAs of 1 June, military activity related to the battle was confirmed to have killed at least 5,154 civilians and wounded over 5,605 more. As of 10 October, the United Nations counted 2,964 civilians killed in the Donetsk and Luhansk regions alone, in addition to 3,683 civilians wounded.\nThe true number of civilian deaths and injuries is guaranteed to be significantly higher. Civilian casualties are impossible to tabulate due to the fog of war and lack of information flow due to the military occupation of segments of Ukrainian territory. For example, according to Ukrainian sources, \"thousands\" of civilians were killed in Lysychansk, although official data only accounted for 150 killed civilians.\n{| class=\"wikitable plainrowheaders\"\n|+Civilian deaths by area\n|-\n! scope=\"col\" | Area\n! scope=\"col\" | Casualties\n! scope=\"col\" | Time period\n! scope=\"col\" | Source\n|-\n! scope=“row” |Bakhmut\n|204+ killed, 505+ wounded\n|1 August 2022 - 1 June 2023\n! scope=“row”|Ukrainian government\n|-\n! scope=\"row\" |Bilohorivka\n|60 killed, 7 wounded\n|8 May 2022\n! scope=\"row\"|Ukrainian government\n|-\n! scope=\"row\" |Donetsk Oblast(excluding Mariupol)\n|959 killed, 1,899 wounded\n|18 April – 13 November 2022\n! scope=\"row\"|Ukrainian government\n|-\n! scope=\"row\" |Kreminna\n|200 killed\n|18–19 April 2022\n! scope=\"row\"|Ukrainian government\n|-\n! scope=\"row\" |Sievierodonetsk\n|1,100+ killed, 52+ wounded\n|27 May 2022\n! scope=\"row\"|Ukrainian government\n|-\n! scope=\"row\" |Lysychansk\n|158+ killed, 42+ wounded\n|25 May 2022\n! scope=\"row\"|Ukrainian government\n|-\n! scope=\"row\" |Kharkiv Oblast(excluding Izium)\n|723+ killed, 328+ wounded\n|18 April – 30 September 2022\n! scope=\"row\"|Ukrainian government\n|-\n! scope=\"row\" |Izium\n|1,000+ killed\n|13 September 2022\n! scope=\"row\"|Ukrainian government\n|-\n! scope=\"row\" |Luhansk Oblast(excluding Sievierodonetsk)\n|90 killed, 72 wounded\n|18 April – 16 June 2022\n! scope=\"row\"|Ukrainian government\n|-\n! scope=\"row\" |Azovstal\n|600 wounded\n|29 April 2022\n! scope=\"row\"|Ukrainian government\n|-\n! scope=\"row\" |Donetsk PR\n|571 killed, 1,765 wounded\n|23 April – 11 November 2022\n! scope=\"row\"|Donetsk PR\n|-\n! scope=\"row\" |Luhansk PR\n|101+ killed, 314+ wounded\n|28 April – 6 October 2022\n! scope=\"row\"|Luhansk PR\n|-\n! scope=\"row\" |TOTAL\n|5,154+ civilians killed, 5,605+ wounded\n|18 April – 1 June 2023\n|}\nSee also\n* Outline of the Russo-Ukrainian War\n* War in Donbas (2014 to the start of the Russian invasion of Ukraine)\n* List of military engagements during the Russian invasion of Ukraine\n* Timeline of the Russian invasion of Ukraine\nReferences"
    }
  ]
}