{
  "content": [
    {
      "type": "text",
      "text": "# Battle of the Sinai (1973)\n\nIsrael\n|combatant2=\n|commander1= Albert Mandler Chaim Bar-Lev Abraham Adan Ariel Sharon Moshe Dayan\n|commander2= Saad El Shazly Saad Mamoun Abdul Munim WasselAhmad Ismail Ali\n|strength1=800–900 tanks60,000 soldiers\n|strength2=400 tanks5,000 soldiers\n|casualties1= 50–150 tanks destroyed60 other armored vehicles destroyedsome aircraft shot down656 killed and wounded\n|casualties2= 200–264 tanks destroyed/captured~1,000 killed and wounded (Israeli estimate)\n}}\nThe Battle of the Sinai was one of the most consequential battles of the Yom Kippur war. An Egyptian attacking force that advanced beyond their line of defense at the Bar-Lev Line was repulsed with heavy losses by Israeli forces. This prompted the Israelis to launch Operation Abiray-Lev (Stouthearted Men) the next day, penetrating the Egyptian line of defense and crossing the Suez Canal.\nBackground\nAfter Egyptian infantry had successfully crossed the canal and captured the Bar-Lev Line on October 6, Israeli forces made several counterattacks in attempts to push the Egyptians back across the Suez Canal. The Israelis suffered heavy losses in these attacks, and by October 9 Egyptian forces in the Sinai had managed to destroy 500 Israeli tanks. Following this both sides dug in. The Egyptians would not attack for fear of extending their forces beyond the cover of their SAM defences.\nIn the Golan Heights, Israel had reversed Syria’s gains and pushed into Syria itself beyond the Golan, capturing the towns of Hadhr, Khan Arnabah, and Mazraat Beit Jinn. By the time the Syrians, now aided by Iraqi and Jordanian expeditionary forces managed to put a halt to the Israeli advance, Israeli forces were 40&nbsp;km from Damascus. Syrian president Hafez al-Assad requested his Egyptian ally, Anwar El-Sadat, order an attack in the Sinai, which would draw Israeli attention away from the Syrian front. Sadat consented and ordered the attack. His war minister, Ahmed Ismail, and his chief of staff, Saad El Shazly, opposed the idea; Shazli in particular stated that for Egyptian forces to advance outside their SAM defences would mean their exposure to the Israeli Air Force, which the Egyptian Air Force was too weak to challenge. Sadat insisted that the attack proceed, however, and both Ahmed Ismail and Shazli had no choice but to acknowledge the order.\nPrelude\nThe attack was to proceed on October 13, but was postponed to October 14. Four armored brigades and one mechanized infantry brigade under the command of the Second and Third Armies were to make four independent thrusts. Awaiting for them was a dug-in force of 800 Israeli tanks supported by infantry equipped with SS.11 missiles, as well as American-made LAW and TOW anti-tank missiles. Israel had in the Sinai by October 14 around fifteen brigades totaling nearly 60,000 infantry. The Israeli air force provided intense air cover during the battle.\nBattle and aftermath\nThe Egyptians launched their offensive in the early morning of October 14, at 6:30. The mechanized infantry brigade was to attack in the direction of the Gidi Pass, one armored brigade was to attack in the direction of the Mitla Pass, one brigade was to attack towards Baluza, and two brigades were to attack in the direction of Tasa. As anticipated by many Egyptian officers, the attack was a failure. Encountering stiff Israeli resistance, the Egyptian assault came to a halt after suffering heavy losses, and Egyptian troops retreated back to their lines on the Suez Canal.\nEgyptian losses in the battle were 200–250 tanks and up to 1,000 men killed and wounded in action. The 3rd Egyptian Armored Division was eliminated and 120 Egyptian prisoners were taken in the battle at Wadi Mab'uk. The Egyptians also lost their Second Army Commander, Saad Mamoun, who suffered a heart attack at the beginning of the day. By contrast, Israeli losses were 50–150 tanks, 60 other armored vehicles and some aircraft. The following day, the Israelis launched Operation Abiray-Lev, crossing the Suez Canal and cutting off the Egyptian Third Army's supply lines.\nReferences"
    }
  ]
}