{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Whampoa\n\n|result = British victory\n|combatant1 =\n* British East India Company\n|combatant2 =  Qing China\n|commander1 = Gordon BremerEdward Belcher\n|commander2 = Unknown\n|strength1 = 1 ship of the line2 corvettes1 bomb ketch\n|strength2 = 250 troops25 guns\n|casualties1 = 1 killed\n|casualties2 = 15–20 killed\n|notes =\n}}\nThe Battle of Whampoa was fought between British and Chinese forces at Whampoa Island (modern-day Pazhou Island) on the Pearl River near the city of Canton (Guangzhou), Guangdong, China, on 2March 1841 during the First Opium War.\nBattle\nOn 2March 1841, Commodore Gordon Bremer, commander-in-chief of British forces, sent Capt. Edward Belcher of the Sulphur to reconnoitre the Junk River. The ship was towed by three of the Wellesleys boats under Lt. Richard Symonds. As they approached the northeast end of Whampoa Island, a Chinese battery of about 25 guns, which were masked by thick tree branches, opened fire on the ships. Lt. Symonds immediately cut the tow line, the boats sailed towards the shore and the boat crews landed. The battery was defended by 250 Manchu Tartar troops. They fled for shelter in the neighbouring jungle, but were dislodged by artillery from the Sulphur. After the British captured the forts, the guns were destroyed and the works and magazines blown up.\nBremer reported 15 or 20 Tartars killed. One British seaman from the Wellesley died from wounds after being shot through the lungs with grapeshot. Bremer resigned the command of the land forces to Maj. Gen. Hugh Gough, who joined the fleet on board the Cruizer. Former Imperial Commissioner Lin Zexu wrote in his diary entry for 2March: \"I hear that the English rebel ships have already forced their way to the fort at Lieh-te. Early in the morning I went to talk things over at the General Office in the Monastery of the Giant Buddha.\"\nNotes\n;Footnotes\n;Citations\nReferences\n*[https://books.google.com/books?id=J9Q1AAAAMAAJ Bulletins of State Intelligence]. Westminster: F. Watts. 1841.\n*Belcher, Edward (1843). [https://archive.org/details/narrativeofvoyag02belc Narrative of a Voyage Round the World]. Volume 2. London: Henry Colburn.\n*Bingham, John Elliot (1842). [https://books.google.com/books?id=8TGwqgOCFR0C Narrative of the Expedition to China, from the Commencement of the War to Its Termination in 1842] (2nd ed.). Volume 2. London: Henry Colburn.\n*Hall, William Hutcheon; Bernard, William Dallas (1846). [https://books.google.com/books?id=2pZFAAAAIAAJ The Nemesis in China] (3rd ed.). London: Henry Colburn.\n*Ouchterlony, John (1844). [https://archive.org/details/chinesewaraccoun00ouchrich The Chinese War]. London: Saunders and Otley.\n*Waley, Arthur (1958). The Opium War Through Chinese Eyes. Stanford, California: Stanford University Press. ."
    }
  ]
}