{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Sialkot (1763)\n\n| status            =\n| combatant1        = Sukerchakia Misl\n| combatant2        = Durrani Empire\n| commander1        = Charat Singh\n| commander2        = Sardar Jahan Khan\n| strength1         =\n| strength2         =\n| strength3         =\n| casualties1       =\n| casualties2       =\n| casualties3       =\n| notes             =\n| campaignbox       =\n}}\nThe Battle of Sialkot took place on 12 November 1763, between the Durrani Empire, led by Jahan Khan, and the Sukerchakia Misl, led by Charat Singh, as part of the Afghan–Sikh wars which concluded with Sikh victory.\nBackground\nDuring the battle of Kasur, another battle was occurring at the same time between the Buddha Dal under the leadership of Jassa Singh Ahluwalia and Sa’adat Khan, the governor of Jullundar Doab, where the Sikhs invaded the whole doab, defeating Diwan Bishambar Das of Lasara in the battle of Urmar Tanda, taking possession of many villages and causing terror-stricken Sa’adat Khan to confine himself within the fort. When Ahmad Shah Abdali was informed of such news and activities of the Sikhs, he appointed Jahan Khan to lead an expedition against the Sikhs, who reached Rachna Doab in November 1763 and headed straight for Sialkot.\nBattle\nJahan Khan and his forces met the Sikhs in the city of Sialkot, northeast of Lahore where in the ensuing battle, Jahan Khan and his forces faced much ferocity by the Sikhs, shooting down his horse from under and causing him to fall to the ground. The Sikhs continued to attack, causing significant loss of Afghan soldiers, making both Jahan Khan and the remaining Afghan soldiers to flee the battle, leaving behind all their relatives, dependents including Jahan Khan's wife and camp equipments, into the possession of the Sikhs. The battle ended in a Sikh victory.\nAftermath\nAll the Afghan women left behind were set free by the Sikhs and sent safely to Jammu. After this success, the Buddha dal marched over to Malerkotla to avenge the participation of Bhikhan Khan in the Vadda Ghalughara, by besieging the fort and killing him in the battle of Malerkotla. The Sikhs then sacked the town of Morinda, killed Jani Khan and Mani Khan, who were the descendants of Ranghars, moving on with the capture of Sirhind and killing Zain Khan Sirhindi.\nReferences\nBibliography\n* Gupta, Hari Ram, History of the Sikhs: Sikh Domination of the Mughal Empire, 1764–1803, second ed., Munshiram Manoharlal (2000)\n* Gupta, Hari Ram, History of the Sikhs: The Sikh Commonwealth or Rise and Fall of the Misls, rev. ed., Munshiram Manoharlal (2001)\n*\n*"
    }
  ]
}