{
  "content": [
    {
      "type": "text",
      "text": "# Battle of the Ligurian Sea\n\n|date        = 18 March 1945\n|place       = Ligurian Sea\n|coordinates =\n|map_type    = Italy\n|map_size    = 200\n|map_caption =\n|map_label   = Ligurian Sea\n|result      = British victory\n|combatant1  =\n|combatant2  =\n|commander1  =  Derick Hetherington\n|commander2  =  Franz Burkart\n|strength1   = 2 destroyers\n|strength2   = 1 destroyer2 torpedo boats\n|casualties1 = 1 destroyer damaged\n|casualties2 = 60 killed244 captured2 torpedo boats sunk1 destroyer damaged\n|campaignbox =\n}}\nThe Battle of the Ligurian Sea was a naval surface action of the Second World War fought on 18 March 1945, in the Gulf of Genoa in the Mediterranean Sea. A Kriegsmarine flotilla of two torpedo boats and one destroyer was conducting an offensive mine laying operation at night when it was intercepted by two Royal Navy destroyers;   and . The British destroyers sank two of the German ships and severely damaged the third; it was the last German naval surface action of the war.\nBackground\nAt the Malta Conference (30 January – 3 February 1945), it was decided to transfer air force and army units from Italy to the Western Front in France and Belgium in Operation Goldflake. In February and March 1945, the I Canadian Corps was moved from Italy to the French port of Marseille. Escorts for the troopships were provided by Flank Force (Admiral Robert Jaujard) British, French and US ships, with air cover from the Mediterranean Allied Coastal Air Force (MACAF).\nPrelude\nOn the night of 17 March 1945, the last three operational ships of the German 10th Flotilla (Korvettenkapitän Franz Burkart) conducted an offensive mine-laying operation north-east of Corsica. After sailing from Genoa, s  (ex-Italian Arturo) and  (ex-Italian Eridano) laid 56 mines south of Gorgona Island, while the destroyer TA32 (a Torpedoboot Ausland, the ex-Yugoslavian Dubrovnik) placed 76 mines north of Cap Corse. The flotilla rendezvoused for the return to Genoa and was about  north of Cape Corse, when they were detected by an Allied shore radar at Livorno. Four Allied destroyers of the 3rd Destroyer Flotilla were patrolling in the area; the French   and the  ; the British s  and .\nIn the early hours of 18 March, all but Meteor received the radar report from Livorno. Captain André Léon Jean Marie Morazzani, the senior officer aboard Tempête, ordered the British ships to intercept the intruders, while he led the older and slower French destroyers south-east, in case the Germans doubled back to intercept a convoy near Cape Corse. Lookouts commander, Derick Hetherington, coordinated with Meteor via Talk Between Ships (TBS) and the British ships went on separate courses north-east at full speed. By the time Morazzani was sure that the German ships were no threat to the convoy, he was too far away to join the action.\nAction\nLookout established radar contact with the Germans at 03:00 on 18 March, sailing at  just west of north. Lookout approached at high speed from ahead and opened fire at about . Minutes later she swung around, moving parallel to the Germans and launched torpedoes. The Germans were surprised and Lookouts radar-directed guns quickly scored hits on TA24 and TA29. TA29 dropped out of formation while the other two ships retreated north. Lookout let them go to concentrate on the crippled TA29 and circled it, firing continuously with its six 4.7-inch guns from as close as . TA29 replied, her gunners almost hitting Lookout several times. One burst of 20&nbsp;mm shells hit some smoke floats and started a small fire that was quickly extinguished.\nLookout continued to fire at TA29 until just after 04:00; after more than 40 hits, TA29 caught fire and sank. She lost only 20 men despite Lookouts intense and accurate salvos. Meteor altered course to intercept the other German ships and about the time that Lookout engaged TA29, Meteor made radar contact at  with the two German ships retreating north. Meteor opened fire at  and hit TA24 almost immediately. Seeing the hit in the dark, she launched a salvo of torpedoes a few minutes later, one of which struck TA24. Meteors commander, Richard Pankhurst, saw a \"geyser of flame and metal\" and TA24 sank just after 04:00, losing thirty men in 13 minutes.\nAftermath\nThe Battle of the Ligurian Sea was the last surface action fought by  of the Second World War. The British destroyers ended any possibility of German deep water offensive operations in the Ligurian Sea, let alone anywhere else in the Mediterranean. The engagement was also the last surface naval action the British fought in the western theatre and the last substantial surface action fought on the Mediterranean Sea. TA32 was damaged but managed to escape; she was scuttled by her crew in Genoa on 25 April 1945. The British destroyers rescued 244 survivors, including Franz Burkart, in rafts and boats from TA24 and TA29 and took them prisoner. In 2011, Spencer Tucker wrote that \"the British destroyers achieved decisive results against a German unit... and their victory effectively ended the Kriegsmarine's ability to undertake deep water offensive operations\".\nReferences\nBibliography\n*\n|first1=W. |last1=Jackson |author1-link=William Jackson (British Army officer) |first2=T. P. |last2=Gleave |author2-link=Tom Gleave |editor-last=Butler |editor-first=J. R. M. |editor-link=J. R. M. Butler |title=The Mediterranean and Middle East: Victory in the Mediterranean November 1944 to May 1945 Part III |volume=VI |series=History of the Second World War United Kingdom Military Series |year=2004 |orig-year=1987 |publisher=HMSO |location=London |edition=pbk. Imperial War Museum and Naval & Military Press |isbn=978-1-84574-072-6}}\n*\n*\n*\nFurther reading\n*\n*\nExternal links\n* [http://uboat.net/allies/warships/ship/4468.html HMS Lookout (G 32) – U-Boat.net]\n* [http://www.naval-history.net/xGM-Chrono-10DD-43M-Meteor.htm  Service Histories of Royal Navy ships in WWII – HMS Meteor (G 73) (M-class Destroyer)]"
    }
  ]
}