{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Arlington Mills\n\n|result      =Inconclusive\n|status      =\n|combatants_header =\n|combatant1  = United States (Union)\n*  1st Michigan Volunteer Infantry\n*  11th New York Infantry\n|combatant2  = CSA (Confederacy)\n|commander1  =Irvin McDowell\n|commander2  =Milledge Luke Bonham\n|strength1   =Two companies, as many as 200\n|strength2   =Squad, as few as 9\n|casualties1 =1 killed1 wounded\n|casualties2 =1 wounded\n|notes       =\n|campaignbox =\n}}\nThe Battle of Arlington Mills, Virginia, was one of the first military engagements of the American Civil War, a week after the Union occupation of that part of Virginia opposite Washington, D.C. It occurred on June 1, 1861, at about 11:00&nbsp;p.m., a few hours after the Battle of Fairfax Court House.\nUnder cover of darkness, a squad of just nine Virginia soldier fired at troops of the 1st Michigan Volunteer Infantry and the 11th New York Volunteer Infantry, who were performing picket duty at Arlington Mills, Virginia. The Virginians were technically still Virginia militiamen although Virginia forces had been acting under the direction of Confederate President Jefferson Davis after an agreement on April 24, 1861, between Virginia and the Confederate States as well as after approval on May 23, 1861, by Virginia voters of the ordinance of secession enacted by the Virginia legislature on April 19, 1861.\nDuring a brief and confused exchange of fire, one Union soldier was killed and another was wounded, while one Virginian was wounded. It demonstrated that Union forces were vulnerable to enemy attacks, even when close to the capital.\nBackground\nThe U.S. Army surrendered Fort Sumter in the harbor Charleston, South Carolina, to Confederate forces on April 14, 1861. The next day, President Abraham Lincoln called for 75,000 volunteers to serve for 90 days to reclaim federal property and to suppress the rebellion begun by the seven Deep South states which had formed the Confederate States of America (Confederacy). Four Upper South States, including Virginia, refused to furnish troops for this purpose. Instead, political leaders in these states began the process of secession from the Union with the intent of joining the Confederacy. On April 17, a convention for the purpose of considering the secession of Virginia began in Richmond, Virginia. The convention immediately passed an ordinance of secession and authorized the governor to call for volunteers to join the military forces of Virginia to defend the state against Federal military action. Despite scheduling a popular vote to ultimately determine whether Virginia would secede from the Union, the actions of the Virginia Secession Convention and of the state government, especially Virginia Governor John Letcher, effectively took Virginia out of the Union.\nGovernor Letcher appointed Robert E. Lee, who had just resigned as a colonel in the U.S. Army, as commander in chief of Virginia's army and navy forces on April 22, at the grade of major general. On April 24, Virginia and the Confederate States agreed that the Virginia forces would be under the direction of the Confederate President, Jefferson Davis, pending completion of the process of Virginia joining the Confederate States. On April 27, 1861, Virginia formed the Provisional Army of Virginia in addition to its actively maintained state militia. The Provisional Army of the Confederate States was organized beginning on the same date. Confederate States Army soldiers, except for state militiamen, were in this organization.\nThe 1st Michigan Volunteer Infantry Regiment, under the command of Colonel Orlando Willcox, was a three-month regiment, the only such regiment from Michigan. The unit was organized at Fort Wayne, Detroit, Michigan, and mustered into United States service on May 1. The regiment left the State of Michigan for Washington, D.C., on May 13, reached Washington on May 16, and occupied Arlington Heights, Virginia, and Alexandria, Virginia, on May 24. Willcox was soon given brigade command. With Willcox in command of the brigade, the regiment was commanded by Major Alonzo F. Bidwell. The 1st Michigan Infantry (90-day) was attached to Orlando Willcox's Brigade, Samuel Heintzelman's Division, Irwin McDowell's Army of Northeastern Virginia. A three–year regiment with the same regiment number replaced the 90–day 1st Michigan Infantry Regiment after the original 1st Michigan Infantry Regiment was mustered out of the Union Army at the end of its term of service.\nOn May 7, the 11th New York Volunteer Infantry Regiment (1st New York Fire Zouaves) was mustered into Federal service to serve for the duration of the war, not just for three months or a limited period of time. Colonel Elmer E. Ellsworth commanded the regiment. The secession of Virginia was ratified by a popular vote on May 23.\nDespite the presence of Virginia forces in league with the Confederacy in Arlington and Alexandria, Virginia, just across the Potomac River from Washington, D.C., President Lincoln did not wish to make a provocative military move into Virginia until after the popular vote on secession of the state had taken place. In the early morning hours of May 24, the day after the vote, the 1st Michigan Volunteer Infantry Regiment and the 11th New York Volunteer Infantry Regiment crossed the Long Bridge into Arlington and occupied Arlington Heights. Part of the 1st Michigan Infantry, along with part of the 11th New York Infantry, continued to Alexandria while the other companies of the 11th New York Infantry crossed the Potomac by boat and occupied the town. It was during this operation that Colonel Ellsworth took down a secessionist flag at the Marshall House hotel and was killed by its proprietor James W. Jackson. Jackson, in turn, was immediately killed by Private Francis E. Brownell of Ellsworth's regiment. The 69th New York State Militia, a 90-day regiment, later the 69th Infantry New York State Volunteers (NYSV), under Colonel Michael Corcoran, also participated in the operation, crossing the Potomac River over the Chain Bridge.\nVirginia Governor Letcher issued a proclamation officially transferring Virginia forces to the Confederacy on June 6. Major General Robert E. Lee, commanding the state forces, issued an order in compliance with the proclamation on June 8. The Virginia soldiers at Arlington Mills were technically Virginia militia men (or Provisional Army of Virginia soldiers) although they were acting in accordance with the April 24, 1861, agreement between Virginia and the Confederate States, the Virginia forces would be under the direction of Confederate President Jefferson Davis, pending completion of the process of Virginia joining the Confederate States.\nThe Union regiments established camps, performed picket duty and later built part of the defenses of Washington on high ground near the river and up to about  away from the river. Companies from both the 1st Michigan Infantry under Captain Brown and the 11th New York Infantry under Captain Roth performed picket duty and camped at Arlington Mills (or Arlington Mill as later named), Virginia, about  from the Long Bridge at Washington.\nBattle\nOn the night of June 1, Arlington Mill was a grist mill that had been built in 1836 by George Washington Parke Custis on the Arlington estate where Columbia Turnpike crossed Four Mile Run. Company E of the 1st Michigan Volunteer Infantry Regiment was on picket duty at Arlington Mills. Company G of the 11th New York Volunteer Infantry Regiment (1st New York Fire Zouaves), was in a nearby house, preparing to relieve the Michigan company. At about 11:00&nbsp;p.m., nine Virginia militia men, according to contemporary accounts, fired a volley on the Union sentinels. At least one newspaper reported that in the confusion the Michigan men and the New York Zouaves fired on each other as well as at the Virginia soldiers. In any event, the Virginians were driven off or withdrew after the brief exchange of fire. The Union forces suffered one killed and one wounded among the New York men while the Virginians (soon-to-be Confederates) suffered one man wounded. The web site of a re-enactor group as well as William S. Connery's book state with respect to the picket duty performed by the regiment in the early days of the war: \"21-year-old Henry S. Cornell of Company G, a member of Engine Co. 13, was killed and another man wounded one night on the picket line.\"\nAftermath\nFollowing the Battle of Fairfax Court House and the skirmish at Arlington Mills on the same day, the Union Army did not attempt to move farther into northern Virginia until June 17, when a Union reconnaissance in force led to the Battle of Vienna, Virginia. Historian Charles Poland, Jr. says that the Arlington Mills skirmish and the Battle of Fairfax Court House were \"among the antecedents of the forthcoming first battle at Bull Run.\" He also noted that small actions early in the war received major news coverage and attention because the war was new.\nThe 1st Michigan Volunteer Infantry Regiment fought at the Battle of First Bull Run on July 21. The regiment, under Major Bidwell, was mustered out August 7. A reorganized 1st Michigan Volunteer Infantry Regiment (three years) then was organized at Detroit, Michigan, and mustered into United States service on September 16. The reorganized regiment served until July, 1865. The 11th New York Volunteer Infantry Regiment (1st New York Fire Zouaves) also fought at the Battle of First Bull Run, where they suffered many casualties, had hundreds taken prisoner and incurred some desertions. The regiment could not be completely and successfully reorganized. Many of its men re-enlisted in other New York regiments.\nCurrent use of location\nArlington Mill was destroyed by fire in 1920. In 2011, Arlington County, Virginia began work on a new community center to replace one just demolished on the site. The new center was completed in 2013 and is located at 909 S Dinwiddie St, Arlington, VA 22204.\nNotes\nReferences\n* [https://web.archive.org/web/20130124052901/http://www.arlingtonva.us/departments/ParksRecreation/scripts/comm_center/ParksRecreationScriptsComm_centerArlingtonMill.aspx Arlington County, Virginia]. Retrieved January 13, 2013.\n* [https://web.archive.org/web/20121226202949/http://www.arlingtonhistory.org/learn-2/historic-sites/commercial-properties/ Arlington Historical Society] Retrieved January 13, 2013.\n* [http://www.waymarking.com/waymarks/WM28BB_The_Arlington_Mill The Arlington Mill - Virginia Historical Markers on Waymarking.com]. Retrieved June 2, 2011.\n* [http://www.civilwararchive.com/Unreghst/unmiinf1.htm 'The Civil War Archive, Michigan Regimental Histories']. Retrieved January 13, 2013.\n* Connery, William S. Civil War Northern Virginia 1861. Charleston, SC: The History Press, 2011. .\n* Detzer, David. Dissonance: The Turbulent Days Between Fort Sumter and Bull Run. New York: Harcourt, 2006.  (pbk.)\n* Dunbar, Willis Frederick and George May. [https://books.google.com/books?id=HqGWEAnByeMC Michigan: a history of the Wolverine State]. Grand Rapids, MI: Erdmann, 1980. . Retrieved June 15, 2011.\n* Eicher, David J. The Longest Night: A Military History of the Civil War. New York: Simon & Schuster, 2001. .\n* Eicher, John H., and David J. Eicher, Civil War High Commands. Stanford: Stanford University Press, 2001. .\n* Hannings, Bud. [https://books.google.com/books?id=BC2Qbpa8OjgC Every Day of the Civil War: A Chronological Encyclopedia]. Jefferson, NC: McFarland & Co., 2010. . p.&nbsp;47. Retrieved May 30, 2011.\n* Hansen, Harry. The Civil War: A History. New York: Bonanza Books, 1961. .\n* Long, E. B. The Civil War Day by Day: An Almanac, 1861–1865. Garden City, NY: Doubleday, 1971. .\n* Lossing, Benson John and William Barritt. [https://books.google.com/books?id=gmvkkyCLMv8C Pictorial history of the civil war in the United States of America, Volume 1]. Philadelphia, George W. Childs, 1866. . Retrieved May 1, 2011.\n* Poland, Jr., Charles P. The Glories Of War: Small Battles and Early Heroes Of 1861. Bloomington, IN: AuthorHouse, 2006. .\n*\n* United States War Dept, Robert Nicholson Scott, et al. [https://books.google.com/books?id=vo8tAAAAIAAJ The War of the Rebellion: a compilation of the official records of the Union and Confederate Armies]. Series I - Volume II. Washington, Government Printing Office, 1880.  Retrieved January 13, 2013."
    }
  ]
}