{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Yassıçemen\n\n| caption           =\n| conflict          = Battle of Yassıçemen\n| part of           =\n| date              = August 10–12, 1230\n| place             = Yassıçemen, between Sivas and Erzincan\n| result            = Seljuk–Ayyubid victory\n| combatant2        = Khwarezm Shahs Seljuk rebelsEmpire of Trebizond\n| combatant1        = Seljuk Sultanate of RûmAyyubid SultanateCilician ArmeniaCrusaders\n| commander2        = Jalal al-Din Mangburni Jahan Shah\n| commander1        = Kayqubad I Al-Ashraf\n| strength2         = 10,000–40,000\n| strength1         = 25,000–70,000\n20,000+ Seljuk Sultanate of Rum soldier,5,000–15,000+ Kurds\n}}\nThe Battle of Yassıçemen was fought in Anatolia, in what is now Erzincan Province, Turkey in 1230.\nBackground\nJalal al-Din Mangburni was the last ruler of the Khwarezm Shahs. The territory of the empire had been annexed by the Mongol Empire during the reign of Jalal al-Din’s father Muhammad II; but Jalal al-Din continued to fight with a small army. In 1225, he retreated to Azerbaijan and founded a principality around Maragheh, East Azerbaijan. Although he formed an alliance with the Seljuk Sultanate of Rûm against the Mongols, for reasons unknown he later changed his mind and began hostilities against the Seljuks. In 1230, he conquered Ahlat, (in what is now Bitlis Province, Turkey) an important cultural city of the era from the Ayyubids which led to an alliance between the Seljuks and Ayyubids. Jalal al-Din on the other hand allied himself with Jahan Shah, the rebellious Seljuk governor of Erzurum.\nBattle\nThe battle took place in Yassıçemen, a location west of Erzincan. Jalal al-Din tried to attack before the merging of the Seljuk and Ayyubid armies, but it was too late, as the Ayyubids had already sent a reinforcement of 10,000 to the Seljuks. The commander of the Seljuk-Ayyubid army was the Seljuk sultan Ala-ad Din Kayqubad I. The battle continued for three days. The alliance's numerical superiority was at least two-folds.\nPrelude\nBoth armies sent their detachment forces. The two detachment forces met on the 10th of August, 1230. The Khwarezmian detachment consisting of 700 strong defeated the detachment forces of the alliance consisting of 3,000 strong. The alliance's morale was low after the defeat of their detachment but as new reinforcements came, the morale was restored.\nMain battle\n.]]\nThe Khwarezmian army was structured enclosing the plain. The alliance units attacked on the Khwarezmian army and the Khwarezmian retaliated in the same way. Jalal al-Din stood on a hill and coordinated his army. During the first day, the alliance seized some positions from the Khwarezmians but the occupiers abandoned the newly captured positions at night. Jalal al-Din refrained from attacking.\nThe alliance again started an attack on the next dawn but they were repelled back. After repelling the allied army, the Khwarezmians charged forward and forced Kaykubad I to retreat further. The lost positions were captured back. Al-Ashraf, the commander of the Mamluk army, reinforced Kaykubad's divisions. After seeing the reinforcements, Jalal al-Din concluded that the battle is lost, due to the numerical superiority of the alliance and abandoned the battlefield.\nAftermath\nThis battle was Jalal al-Din’s last battle, as he lost his army, and while escaping in disguise he was spotted and killed in 1231. His short-lived principality was conquered by the Mongols. The Seljuk Sultanate of Rum gradually absorbed Ahlat, Van, Bitlis, Malazgirt and Tbilisi. The Seljuk Sultanate of Rum attained a border with the Mongol Empire as they occupied the former territories of Jalal al-Din Mangburni. After the death of Jalal al-Din, Kaykubad I hired Jalal al-Din's former lieutenants to use them as a shield against possible Mongol invasion. After the death of Aladdin Kayqubad, Seljuks shared the same fate in 1243 following the Battle of Kösedağ.\nReferences\nResources\n*"
    }
  ]
}