{
  "content": [
    {
      "type": "text",
      "text": "# Battle Creek Transportation Center\n\n| line               =\n| other              =\n| bus_stands         =\n| bus_operators      =  Amtrak Thruway| Greyhound Lines| Indian Trails| Battle Creek Transit}}\n| platform           = 1 side platform\n| tracks             = 2\n| parking            = Yes\n| bicycle            =\n| mpassengers        = |pass_year= }}\n| opened             =\n| rebuilt            = June 12, 2012\n| accessible         = Yes\n| code               =\n| owned              =\n| zone               =\n| services           =\n| other_services_header = Former services\n| other_services_collapsible = yes\n| other_services     =\n| mapframe           = yes\n| mapframe-custom    =  |zoom=15 }}\n}}\nBattle Creek Transportation Center is an intermodal station in Battle Creek, Michigan, used by Amtrak, Indian Trails and Greyhound Lines. It is at the split between the routes of Amtrak's Blue Water and Wolverine passenger trains. The International Limited, which had started in 1982 as joint operation by Via Rail and Amtrak between Chicago and Toronto, was discontinued in 2004.\nThe intermodal facility reopened in 2012 following an extensive renovation. New finishes give the depot a fresh, modern appeal, and new canopies and mechanical systems were also installed.\nHistory\nThe current Amtrak station was built to replace two older train stations, the Battle Creek Grand Trunk Station and the Michigan Central Railroad Depot (also known as the Penn Central Railway Station). The Michigan Central Railroad depot has been on the National Register of Historic Places since April&nbsp;16, 1971, while the Grand Trunk Depot has been on the NRHP since 1980.\nThe Grand Trunk Depot is now the headquarters for the local branch of Community Action and the Michigan Central Railroad Depot  is now a restaurant called Clara's on the River.\nIn September 2010, the state of Michigan got $3.6 million from the federal government to refurbish the station, including renovations to parts of the interior and exterior and bringing the station to accessible standards.  On August 3, 2011, a temporary station operated out of a trailer to the northwest of the station building was planned to open while renovations took place for the next nine months.\nThe new station, which opened on June 12, 2012, features a new entrance and passenger drop-off area, secure long-term parking lot, improved exterior lighting and landscaping. The interior was completely remodeled, with office space for Amtrak and other tenants and an upgraded passenger waiting area.\nEight Amtrak trains serve Battle Creek daily, with three round-trips from Chicago to Detroit/Pontiac on the Wolverine and one Blue Water round-trip from Chicago to Port Huron, along with Amtrak Thruway Motorcoaches to and from Flint.\nReferences\nExternal links\n*\n*[http://www.trainweb.org/usarail/battlecreek.htm Battle Creek Amtrak Station (USA Rail Guide – Train Web)]\n*[https://web.archive.org/web/20070927044747/http://user.mc.net/~louisvw/depot/bc-amt/bc-amt.htm Battle Creek Station (Michigan Passenger Stations)]"
    }
  ]
}