{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Brunete__disambig_1\n\nSpanish Republic\n* International Brigades\n|combatant2= Nationalist Spain\n*Condor Legion\n|commander1= José Miaja Vicente Rojo Lluch\n|commander2= José Varela\n|strength1=Thomas: 85,000Beevor: 70,000Jackson: 50,000 infantryThomas: 300 aircraftBeevor: 50 bombers, 90 fighters (only 50 serviceable)Jackson: 100 aircraft 100 tanks~130 tanks\n|strength2=65,000 infantry105 aircraft\n|casualties1= 10,000–25,000 dead or wounded60–100 aircraft\n|casualties2= 7,000 dead or wounded23 aircraft\n|}}\nThe Battle of Brunete (6–25 July 1937), fought  west of Madrid, was a Republican attempt to alleviate the pressure exerted by the Nationalists on the capital and on the north during the Spanish Civil War. Although initially successful, the Republicans were forced to retreat from Brunete after Nationalist counterattacks, and suffered devastating casualties from the battle.\nPrelude\nAfter the capture of Bilbao by the Nationalists on June 19, the Republicans devised the attack on Brunete to divert Nationalist forces from the north and allow the fleeing Republicans time to reorganize. In addition, Brunete was also chosen because it was situated on the Extremadura road and its capture would make it harder for the Nationalists to resupply their forces besieging Madrid, defeat here perhaps even forcing the Nationalsts to withdraw. Once Brunete had been taken, and after some reorganization, the plan was that the offensive would then in a second phase continue in the direction of Talavera de la Reina, a move that would eventually cut off the Nationalist forces outside Madrid. At the same times as the offensive on Brunete started an enveloping attack would be launched from the Carabanchel area just south of Madrid.\nFrom a political standpoint, the offensive was chosen for Brunete to satisfy communist demands and to prove to the Russians that the Spanish possessed military initiative. In fact, Russian advisors had been pressing for an attack on Brunete since the spring of 1937. Furthermore, assistance from the Soviet Union had decreased due to the successful blockade of Republican ports by the Nationalists. Prime Minister Juan Negrín needed to convince the French Premier Camille Chautemps that the Spanish Republic was still capable of military action after the disastrous losses of Málaga and Bilbao. It was expected by the Republicans that a show of force at Brunete would persuade France to open its border for arms shipments.\nThe Brunete offensive followed two previous Republican offensives, one at Huesca in Aragon, a second in the area of Segovia, northwest of Madrid, both of which had failed. Despite these setbacks, the Brunete offensive was the subject of significant planning by Soviet officials supporting the Republican military; in addition, it received significant combat resources, the Republicans deploying some 50,000 troops, including five of the International Brigades. Whether logistic planning for the attack matched planned combat operations remains a matter of historical contention.\nThe offensive had been preceded both by major reorganizations of the government's forces as well as an influx of modern war material, mainly from the Soviet Union. Nine new brigades had been set up, and the number of heavy machine guns in the units had been increased. The command control expertise demonstrated by Republican formation commanders, along with  problems involving all-arms coordination (particularly Republican air support), would, however, cause significant issues. The offensive was meant as a surprise attack, and the Nationalists were indeed caught unaware – despite the fact that \"it had been discussed in the cafés of the Republic for three months\".\nThe terrain where the battle was to be fought is pretty hilly, with many ridges and small creeks, but for the most part open, and thus accessible to the Republicans new Soviet tanks, which they now intended to put to their first full use.\nCombatants\nRepublicans\nGeneral Miaja initially commanded two Spanish Republican Army corps.\n*V Army Corps commanded by Colonel Juan Modesto with some 22,000 soldiers (among them five of the International Brigades) and 100 tanks:\n**11th Division, led by Enrique Líster.\n**35th Division, led by General Walter.\n**46th Division, led by El Campesino.\n*XVIII Army Corps commanded initially by Colonel Enrique Jurado and later by Segismundo Casado with some 20,000 men:\n**10th Division, led by Major José Maria Enciso.\n**15th Division, led by Colonel Janos \"Gal\" Galicz.\n**34th Division, led by Colonel Francisco Galán.\nIn reserve were Cipriano Mera's 14th Division, General Kléber's 45th Division, and Gustavo Duran's 69th Division. The reserve forces consisted of some 25,000 men and 40 tanks.\nNationalists\nThe site of the offensive was well chosen. Initially facing the Republican attack was not a continuous Nationalist line of defense but (as in many parts of Spain in the initial phase of the war) a series of outposts in villages, defended by small detachments able to take the terrain between the outposts under flanking fire. This part of the front was part of the Nationalist Army of the Center, under the command of General Andrés Saliquet Zumeta. However, pretty soon after the battle had started the overall command was shifted to General José Enrique Varela Iglesias. The units that fought during the battle were:\n*The VII Army Corps commanded by General José Varela consisted of:\n**71st Division, led by Colonel Ricardo Serrador Santés. It was composed chiefly of Falangists and approximately 1,000 Moroccans.\n*The I Army Corps commanded during the battle by Colonel Juan Yagüe Blanco included:\n**11th Division, led by General José Iruretagoyena Solchaga.\n**12th Division, led by General Carlos Asensio Cabanillas.\n**13th Division, led by General Fernando Barrón y Ortiz.\n**14th Division, led by Colonel Juan Yagüe Blanco.\nTransferred to the front were the 150th Division led by General Sáenz de Buruaga, the 4th Brigade of Navarre led by Colonel Juan Bautista Sánchez and the 5th Brigade of Navarre led by Colonel Alonso Vega.\nRepublican offensive\nJuly 6\nThe first attacks started already during the night of July 5/6, with Republican forces in the cover of darkness penetrating deep into the thinly held Nationalist lines. At daybreak on July 6, the Republicans bombarded the Nationalist positions using artillery and air power, plus targets in the rear, including the local Nationalist HQ at Navalcarnero. Immediately after the bombardment, the Republican 11th Division commanded by Líster advanced  and encircled Brunete. The Nationalist forces there were completely taken by surprise, and it wasn't until the morning attacks started that they realised the full extent of the Republican operation. Brunete fell to the Republicans by noon.\nThe Nationalists placed overall command of the battle in General Varela. During the morning all available manpower was rushed into the faltering front line, these included personnel from local staffs, field hospitals and supply units, and by noon the 12th, 13th and 150th Divisions along with parts of the Condor Legion were on their way to help bolster the defense.\nLater that day the Republican attacks by the 34th and the 46th Divisions on the flanks of Líster's 11th Division stalled upon meeting fierce resistance by the Nationalists and forced Líster to halt his advance south of Brunete. Attempts by the Republican forces to widen the gap by attacking towards the west was also stopped, in front of Quijorna. The assault on Quijorna was then reinforced by tanks and given the support of both artillery and air assets, but the attackers were again repulsed.\nThus far the offensive had almost exclusively been carried out by the V Army Corps. The Republican command seems to have been surprised by their initial success, and there was obviously some confusion which meant that the deployment of XVIII Army Corps was delayed. (This confusion was probably compounded by the fact that many non-communists and regular army officers were reported to be sceptical towards the whole enterprise, which probably made them over-cautious.)\nThe planned east-wing of the enveloping attack, from Carabanchel south of Madrid, never broke the enemy line, despite heavy artillery bombardment.\nJuly 7\nThe Republican Colonel Jurado diverted the 15th Division to end the stalemate at Villanueva de la Cañada and the British Battalion of the XVth Brigade managed to clear the village of Nationalists by 7 am on July 7. The Nationalists in the nearby villages of Villanueva del Pardillo and Villafranca del Castillo continued to hold out.\nTo allow Gal's 15th Division to continue towards Boadilla on the Republican left flank, the 10th Division under Enciso attacked Asensio's 12th Division defending the Mocha Ridge. The Nationalist troops there were driven back and they fell back to the hills near Boadilla.\nOutside Brunete the day was spent in inconclusive and incoherent fights. The bombardments in the dry landscape, that was parched by the heat, resulted in many wildfires.\nThe Republican insistence on reducing pockets of resistance, rather than bypassing them, gave the Nationalists time to bring up fresh reserves. On the afternoon Nationalist aircraft shifted from the Northern Front started to arrive, and they immediately went into action. Varela was also told that all attacks up north had been suspended, to allow ground units to be rushed to the Brunete sector.\nJuly 8&ndash;9\nDuring the night of the 7/8 July general Miaja committed his reserve, the XVIII Army Corps, in an attack towards the east, in the direction of the Guadarrama River. It was performed in the morning hours.   After crossing the river the 15th Division assaulted the newly fortified positions held by the 12th Division for two days. All of the attacks were repulsed and when an attack did succeed in evicting the Nationalist defenders, a counterattack quickly eliminated the gains made by the Republicans. Meanwhile, the nationalist position at the village of Quijorna on the Republican right flank continued to hold out. The attack south of Madrid was renewed, but failed once again. Nothing more came of this part of the plan.\nWith the Republican attack on the right flank of Líster remaining held up at Quijorna, Modesto ordered the 35th Division to assist ''El Campesino's'' 46th Division. The original intent of the 35th Division was for it to be used in support of Líster's attack through the center. Without the 35th Division, Líster's 11th Division would be unable to advance any further. On the morning of July 9, two Republican brigades attacked at Quijorna, and, after taking heavy casualties, they were able to finally clear the village of Nationalist defenders. On the Republican left flank attacks towards Boadilla del Monte initially made progress, but even though the assaulting units were well supported by tanks, armoured cars and aircraft their losses were so high that the attacks stranded. The fighting continued though, especially on and around the so-called Mosquito ridge in front of the village.\nIn the first attack the Spanish Republican Air Force was very active, attacking both ground targets and rebel-held airfields. But the Republican planes were slow and obsolete, which would assure the German Legion Condor almost total control of the air as the battle would unfold.\nJuly 10&ndash;11\nOn July 10 Villanueva del Pardillo was taken by the XIIth International Brigade of Durán's 69th Division, supported by tanks. Some 500 defenders with weapons, ammunition and material were captured. Villafranca del Castillo was slowly being surrounded by Enciso's 10th Division and Kléber's 45th Division. Colonel Jurado made plans for an assault on the village on July 11, but he became ill and was replaced with Colonel Casado. Citing poor morale and fatigue, Casado requested to cancel the attack, but General Miaja ordered for the attack to proceed as planned.\nThe Republicans were able to trap the Nationalist garrison in Villafranca del Castillo, forcing General Varela to send the 5th Brigade of Navarre to relieve the pressure. The arrival of the Navarrese tipped the balance in favor of the Nationalists as the Republicans were forced from their positions and fled back across the Guadarrama River. A Nationalist attempt to recapture Villanueva del Pardillo on July 11 failed.\nThe activity in the air was very high, as more and more Nationalist air units were committed to the fight. It was not uncommon to see aircraft in groups of thirty or more appear over the battlefield, and clash with equally big squadrons of opponents.\nJuly 12&ndash;17\nAs large Nationalist ground and air reinforcements had arrived to the threatened front, and as the planned pincer movement from the Carabanchel area south of Madrid had failed to make any impression, the Republican offensive was clearly grinding to a halt. Some minor diversionary attacks were still performed, but on July 15 general Miaja finally ordered an end to the offensive. (Major George Nathan, a battalion commander in the XV International Brigade, was killed by bomb fragments the day after.) At this moment, the Republicans held Brunete and had cut the Extremadura road. And the offensive had indeed relieved the Nationalist pressure on the Basque country, and it had proved to friend and foe that the Republican forces were rapidly increasing in both strength and capacity. At the same time the Nationalists had prevented their forces besieging Madrid from being cut off and with reinforcements having arrived were able to prepare to counterattack.\nThe Republican forces had suffered big losses, not only from the actual fighting, but also due to the extreme heat, which, combined with lack of water, had incapacitated many soldiers. Many brigades had lost between 40–60% of their numbers – killed, wounded, sick and missing – and one brigade (the XIVth) is said to have lost 80% of their manpower during this week.\nThe exhausted Republicans dug in and waited for the Nationalist counterattack that they knew probably would come.\nNationalist counterattack\nThe nationalist commander general Varela planned to retake the terrain lost to the Republicans with a three-pronged attack. The main force consisted of some 20.000 men, that would attack from the west of the salient towards Quijorna. At the same time another force of some 10.000 men would strike from the east from Boadilla del Monte towards and over the Guadarrama river. Finally some 8.000 men would also attack from the south, towards Brunete itself.\nJuly 18\nThe counteroffensive started early that morning with a lengthy artillery barrage over the Republican front lines, together with heavy aerial attacks by Nationalist air units. However the Nationalists made only small gains this day: the western group managed to capture some hills northwest of Quijorna, while the eastern force took some ground east of the Guadarrama. The Republican troops defended their position stubbornly. The fighting west of Quijorna was particularly fierce. There Republican units made several countercharges, trying to recapture the hills which they had lost. The fighting in the air was also unusually heavy, as both sides threw large number of aircraft into the struggle: at one time around 80 Nationalist aircraft were involved in a massive dogfight with some 60 opponents. (On this day the British poet Julian Bell was killed by bomb fragments, whilst driving an ambulance for a volunteer British Medical Unit.)\nJuly 19&ndash;20\nThe three pronged attack by the Nationalists failed to achieve any substantial gains on July 19, but the next day the eastern forces, heavily supported by aerial units, managed to make some gains on the east side of the salient, close to the Guadarrama.\nJuly 21&ndash;23\nIn order to stabilize the situation on the eastern side of the pocket Miaja ordered a counterattack along the Guadarrama, which led to several days of bitter fighting in the stifling heat. The terrain initially taken by the Nationalists on July 20 switched hands several times. At the same time three Republican Brigades supported by 20 tanks made a small push from Las Rozas towards the south-east. While the see-saw battle raged on the eastern flank of the salient, the Republican forces on the west side held their ground, despite heavy attacks concentrated mainly on the terrain around Quijorna. However, on July 23 the eastern forces finally made a major breakthrough, and managed to fight their way across the Guadarrama, close to the place where the small Aulencia flows into the larger river.\nJuly 24&ndash;25\nOn July 24 the Nationalists started attacking from the south towards Brunete in earnest. They had managed to concentrate some 65 artillery batteries at this part of the front, against a mere 22 Republican. With this support plus bombing from the air the Nationalist breached the Republican lines south of the city. A counterattack supported by tanks had no success. On the afternoon the attackers entered Brunete, while the remnants of Líster's 11th Division retreated to positions just north of the city, clustering around the cemetery. At the same time the Nationalist east group managed to widen their breach on the Guadarrama. Miaja rushed reinforcements from Madrid, and the Republican 14th Division commanded by Cipriano Mera made yet another counterattack, but it failed, and on July 25 the defenders from the 11th Division around and on the cemetery – which included the division commander Líster himself – withdrew from their positions. After this there were no more large-scale attacks in the battle – save for some ineffectual Republican attempts to counterattacks – and the fighting petered out. Varela wanted to continue his attacks but Franco ordered them to halt so that troops could be moved north for the start of the offensive against the strategically important port of Santander. (On July 25 the German war photographer Gerda Taro was fatally wounded when the car she was riding in was hit by a Republican tank more or less out of control due to a Nationalist air attack.)\nDuring the final days of the battle there were clear signs of the morale cracking on the Republican side, due to both exhaustion and the often terrible losses. Even among the volunteer International Brigades there were grumbling, insubordination and outright desertion.\nAftermath\nAt the close of the battle, the Republicans failed to cut the Extremadura road, but they still held Villanueva de la Cañada, Quijorna and Villanueva del Pardillo from the Nationalists. From this point of view, both sides were able to claim victory.\nThe losses of men and equipment in the battle were much heavier for the Republicans than the Nationalists. Indeed, the Republican army lost much of its indispensable equipment and so many of their best soldiers in the International Brigades that the battle can be seen as a strategic Nationalist victory.\nPolitically, the communists suffered a loss of prestige because the offensive failed to stop the Nationalist troops from completing the conquest of the north.\nThe frenetic conditions at Brunete for the Nationalists enabled the Germans to acquire favorable trade concessions because of the effectiveness of the Condor Legion. The Nationalists granted most favored nation status to Germany and acquiesced in sending raw materials to Germany as repayment for the debt incurred.\nLater the battle was commemorated in the name given to Armoured Division No. 1 \"Brunete\", formed in the mid-1940s.\nSee also\n* List of Spanish Republican military equipment of the Spanish Civil War\n* List of Spanish Nationalist military equipment of the Spanish Civil War\nReferences\n* Hugh Thomas: \"The Spanish Civil War\". New York 1961.\n* Jose Manuel Martinez Bande: \"La ofensiva sobre Segovia y la batalla de Brunete\". 1972\n* Manuel Aznar: \"Historia Militar de la Guerra de Espana\", 3 vols. 1969.\n* Jesus Salas Larrazabal: \"Air War over Spain\". London 1974.\n* Richard K. Smith & R. Carghill Hall: \"Five Down No Glory – Frank G. Tinker, Mercenary Ace of the Spanish Civil War\". Annapolis 2011.\nNotes\nExternal links\n*[http://www.spartacus-educational.com/SPbrunete.htm Spartacus Educational – Battle of Brunete]\n*[http://www.international-brigades.org.uk/content/battle-brunete www.international-brigades.org.uk]\n*[https://web.archive.org/web/20190507053351/http://spanish-civil-war.org/brunete.shtml spanish-civil-war.org]\n*[https://www.youtube.com/watch?v=pZEYUX3tgz0 Spanish short film on the Battle on YouTube]\n*[http://spanishsites.org/gerda-taro-and-the-battle-of-brunete/ Gerda Taro and the Battle of Brunete]\n*[http://pdlhistoria.wordpress.com/brunete/ Spanish Civil War blog]"
    }
  ]
}