{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Aguere__disambig_1\n\nThe Battle of Aguere, or Battle of San Cristóbal de La Laguna, was fought between forces of the Crown of Castile, led by the Adelantado (military governor) Alonso Fernández de Lugo, and the natives of Tenerife, called Guanches. The battle took place on 14-15 November 1494.\nFernández de Lugo had suffered defeat by Guanche forces at the First Battle of Acentejo. The Battle of Aguere was a Castilian victory; whereas in the First Battle of Acentejo the Guanches had been favored by their knowledge of the mountainous terrain, in this engagement, the native forces found themselves at a disadvantage on the plain of Aguere.\nThe Battle of Aguere was later followed by the decisive Second Battle of Acentejo more than a month later, which resulted in the complete Castilian conquest of Tenerife.\nPreparations\nAfter the First Battle of Acentejo, Alonso Fernández de Lugo returned to Gran Canaria, practically without troops, as the Castilian forces had suffered between 1,000 and 2,000 casualties at the First Battle of Acentejo. At Gran Canaria, Fernández de Lugo established contact with the merchants Francisco de Palomar, Nicolás de Angelote, Guillermo del Blanco, and Mateo Viña in order to seek financial support for his planned conquest of Tenerife.\nThe group enlisted the aid of Juan Alfonso Pérez de Guzmán, the Duke of Medina Sidonia, who contributed 600 soldiers and 30 horsemen, veterans of the conquest of Granada. (Béthencourt Alfonso cites, however, 670 foot soldiers and 80 horsemen). Five hundred Castilian soldiers were added to this force, a group that included survivors of the First Battle of Acentejo and a small contingent sent by Doña Inés Peraza, a noblewoman of Lanzarote.\nFernández de Lugo also had the support of Ferdinand and Isabella, who had given him ten more months to complete his conquest of the Canaries. During this time of regrouping, he also captured many slaves in Gran Canaria.\nThe Castilian force embarked from Gran Canaria on 6 November in caravels and about a dozen smaller ships, and headed towards the port of Santa Cruz de Tenerife. The total force numbered about 1,200 men, with a small company of knights and some artillery –a force comparable in size to that which was defeated at Acentejo, but much more experienced and better trained and prepared.\nCastilian advance\nStatue of Bencomo at Candelaria, Tenerife.\nThe expedition, which Lugo had also funded with the sale of all of his properties, had landed at Santa Cruz, where he built two towers on the spot where he had constructed his first fort before his prior defeat.\nAfter fortifying Santa Cruz, the Castilian marched on 13–14 November towards La Cuesta, a strategic high point to which the forces ascended to San Cristóbal de La Laguna from the coast.\nThe Castilians maintained Santa Cruz as their base of operations, with their fleet waiting there in case of a defeat.\nIn terms of strategy, the tableland of San Cristóbal de La Laguna was of vital importance to the conquest of the island. The path to reach the tableland from the coast, the path of La Cuesta, in those days was covered by thick vegetation that included Canarian pine, broom, beech, heather, palm trees, dragos, savin, and other species, and so the accession up the hill was a dangerous undertaking.\nFernández de Lugo garrisoned Santa Cruz to prevent a surprise attack. Meanwhile, the Guanches, alerted by inhabitants on the coast, gathered their forces. The mencey (the native term for a king) Bencomo sent emissaries to the other menceys, and gathered about 2,000 warriors at La Cuesta before the Castilians had reached that point.\nBencomo sent two spies to observe the strength and size of the Castilian forces. However, the spies were discovered by the Castilians, and Bencomo could not benefit from any intelligence regarding the enemy forces. This gave the Castilians an early advantage, although they suffered from the disadvantage of advancing up a difficult height surrounded by Guanche warriors. However, having garrisoned Santa Cruz, Fernández de Lugo decided to take a risk in advancing this way, while Bencomo did not have sufficient forces to cover a possible retreat or defeat.\nFernández de Lugo was able to determine the movements of the Guanche forces thanks to their campfires, and ordered the advance of his 70 horsemen and 1,000 soldiers up La Cuesta under the cover of darkness, gaining the highest point of La Cuesta without being seen by the enemy.\nBattle\nThe next day the Guanche forces were surprised that the Castilians had ascended La Cuesta and were dominating the rising grounds in the midst of the plain of Aguere. The laurisilva-covered area called Aguere by the natives included Las Mercedes, parts of present-day San Cristóbal de La Laguna, Ortigal, and other bordering regions.\nBencomo reorganized his forces and with 5,000 men rushed to what are now the outskirts of San Cristóbal, intending to cut off the Castilians. However, before the Guanche forces could do this, Fernández de Lugo's army had already appeared before them.\nThe Guanche center was commanded by Bencomo, the right flank by Acaymo, mencey of Tacoronte; and the left flank by Tinguaro.\nThe Castilian army extended from the present-day hermitage of Gracia, which was selected by Fernández de Lugo due to its height, dominating the plain, to the positions on the field taken by Bencomo's contingent of troops. Based on this information, Buenaventura Bonnet believes that the battle took place in the area now known as Barrio del Timple, Barrio Nuevo or Viña Nava, and the Urbanización de la Verdellada.\nFernández de Lugo's forces included natives from the other Canary Islands, including the Christianized Guanche prince of Gran Canaria, Fernando Guanarteme; Fernando's brother Maninidra; Gomerans, Palmeros, and Guanches from the Christianized menceyato or kingdom of Güímar.[https://archive.today/20070705223816/http://www.canalboinc.org/modules/news/print.php?storyid=33]\nThe battle began with an assault by the Guanche troops, who were armed with traditional weapons like the banote or banot (a lance whose point was hardened by fire). They had no shields or armor, and wore the tamarco, a sheep or goat skin used for protection and warmth. The Guanche forces also hurled rocks.\nThe Castilian vanguard consisted of harquebusiers and crossbowmen who mowed the attacking Guanche ranks with their projectiles. The Castilian pikemen and horsemen then attacked the Guanches who were fleeing the crossbow and harquebus fire. This first engagement lasted several hours, and consisted of continual frontal attacks by Bencomo's forces.\nThe flat terrain of the plain of Aguere benefited the Castilians, and Bencomo's troops began to waver, suffering from a disorderly retreat, especially when the Guanche allies of the Castilians under Fernando de Guanarteme, arriving from Santa Cruz, began to arrive on the field of battle. The Castilian cavalry wreaked terrible losses on the Guanche forces. Miguel de Unamuno compared Fernández de Lugo's cavalry charge with the military actions of Hernán Cortés in Mexico: \"And then into the fray entered the horse, that monster that always put so much fear into the poor Indians... The result of those battles was always inevitable... Bencomo and his troops had to abandon the field of La Laguna.\"\nRetreat of Guanche forces and Tinguaro's death\nBencomo, Acaymo, and Tinguaro were all badly injured. They ordered their forces to retreat towards Tacoronte. The Castilians attacked again, preventing an orderly Guanche retreat. At the end of the day, Bencomo ordered a retreat towards the peak of San Roque, a move that would prevent cavalry attacks and where his men could defend themselves more effectively.\nTinguaro, injured in battle, continued to defend himself against seven horsemen as he retreated up the peak of San Roque. However, at the height of San Roque, a Castilian soldier named Martín Buendía was waiting for him on a cliff. Buendía had arrived on the field of battle separately from the rest of the Castilian troops, and had walked from Santa Cruz via the ravines of Santos and Drago.\nTinguaro, badly hurt and weakened by the loss of blood, spoke to Buendía in the Guanche language, informing the Castilian of his status as a prince. Buendía, ignoring Tinguaro's entreaty, ran the Guanche through with a pike.\nHowever, some historians contradict this account. Francisco P. De Luka writes, in the magazine Awañac (no. 1, 2004, pp.&nbsp;124–125), that on 14 November 1494, Bencomo, not Tinguaro, was killed by Buendía. Francisco P. De Luka writes that on the slopes of San Roque in Laguna, Bencomo, armed with a lance, fought against ten Castilian soldiers, and that one Pedro Martín Buendía mortally wounded Bencomo with a pike. Tinguaro was injured in the fight at San Roque as well, but died two days later at Taoro.\nAs it happened, the body of the fallen Guanche prince was so badly disfigured that when the Castilians translated it to Santa Cruz and made inquiries amongst the Guanche prisoners, the Guanches were unable to determine whether the body was that of Tinguaro or Bencomo.\nIn any case, Fernández de Lugo had the body decapitated. The head of the Guanche prince was placed on a pike and Fernández de Lugo ordered it to be taken to the enemy camp. The Guanches of Acentejo received the head to honor it in a funeral ceremony; a retinue, which included Tinguaro's wife Guajara, traveled to the kingdom of Taoro for this ceremony.\nIn one last and final stand, the reduced Guanche forces, led by an injured Bencomo, tried to reach the heights of La Laguna, but they were cut to pieces by the Castilian cavalry. The cavalry was followed by the Castilian pikemen and rodeleros (\"shield bearers\"), who were equipped with steel shields or bucklers known as rodela and swords (usually of the side-sword type). One of these rodeleros killed Bencomo, and hundreds of Guanche warriors also fell at this time. The Guanche survivors headed towards Taoro, and the next day elected Bencomo's son Bentor as their new king.\nSome historians doubt that the death of Bencomo occurred at this time, but most historians base the fact that he died at this time on the testimony of witnesses such as Margarita Guanarteme, who declared in 1526 that in the battle, \"they killed the Great King who was called King Venitomo [sic] of Taoro...\"\nIn terms of Guanche casualties, Marín y Cubas cites 2,600, while Viana has a lower figure: 1,700 casualties. Figures on Castilian casualties are held as being between 30 and 55 dead and dozens of injured.\nGuanche casualties are said to have been so high that it caused an epidemic, which is also said to have forced Fernández de Lugo to move towards Acentejo.\nAfter the battle\nBy the end of the year, Fernández de Lugo would penetrate the north of the island at Taoro, where some 6,000 Guanches waiting for him at Acentejo. Fernández de Lugo would decisively defeat these forces at the Second Battle of Acentejo. Bentor would commit suicide, throwing himself off the cliff of .\nReferences\nFurther reading\n* Viera y Clavijo, Noticias de la Historia General de las Islas canarias. Goya ediciones, 4 volúmenes, Tenerife.\n* Rodríguez Moure, J: Tenesor Semidan, o Don Fernando Guanarteme, Imprenta y librería de M. Curbelo, La Laguna, 1922.\n* Espinosa, Alonso (fray). Historia de Nuestra Señora de Candelaria, Goya ediciones, Tenerife.\n* Buenaventura Bonnet, La Batalla de La Laguna y la muerte de Tinguaro. Estudio Hermenéutica Histórica. Comisión provincial de Monumentos Históricos de Canarias, Tenerife, 1916.\n* Abreu y Galindo, J. de, Historia de la conquista de las siete islas de Canarias, en A. Cioranescu (ed) Goya ediciones, Tenerife, 1977 .\n* Bethencourt Alfonso, J: Historia del Pueblo Guanche II Lemus editor, La Laguna, 1997.\n* Berthelot, Sabino. Etnografía y Anales de la Conquista de Las Islas Canarias. Ed. Goya. Santa Cruz de Tenerife. 1978. .\n* Blanco, Joaquín. Breve Noticia Histórica de las Islas Canarias. Ed. Rueda. Madrid 1983. .\n* Acosta, José Juan; Rodríguez Lorenzo, Félix; L. Quintero, Carmelo Padrón, Conquista y Colonización. Santa Cruz de Tenerife, Centro de la Cultura Popular Canaria, 1988.\n* VV.AA. Historia de Canarias. Vol. I Ed. Prensa Ibérica. Valencia 1991. .\nExternal links\n* [https://web.archive.org/web/20080521083909/http://elguanche.net/29abril3mayo.htm Web de AMAGA, Perspectiva nacionalista de la batalla.]\n* [http://www.palimpalem.com/1/MELODAIT/index.html?body4.html RSEAPT: Real Sociedad de Amigos del País de Tenerife.]\n* [http://www.mgar.net/docs/wendt.htm Documentos y bibliografía histórica sobre Canarias.]\n* [https://web.archive.org/web/20080521140520/http://www.mundoguanche.com/portada/articulo.php?id_articulo=104 revista digital sobre cultura guanche.]"
    }
  ]
}