{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Fishing Creek__disambig_1\n\n| result      = British victory\n| combatant1  =  United States\n| combatant2  =\n*  Loyalists\n| commander1  =  Thomas Sumter\n| commander2  =  Banastre Tarleton\n| strength1   =100 regulars700 militia2 guns\n| strength2   = 160 regulars and militia\n| casualties1 = 150+ killed300 captured\n| casualties2 = 16 killed and wounded\n}}\nThe Battle of Fishing Creek, also called the Battle of Catawba Ford, was an American Revolutionary War battle fought on August 18, 1780, between American and British forces including the 71st Foot.  It was fought near the junction of Fishing Creek and the Catawba River in South Carolina.  British forces under Banastre Tarleton surprised the militia company of Thomas Sumter, killing a significant number, taking about 300 captives, and very nearly capturing Sumter, who some say was asleep at the time of the attack.\nBackground\nFollowing the routing of Continental Army forces from South Carolina in the May 1780 Battle of Waxhaws, the British \"southern strategy\" for reconquering the rebellious United States in the American Revolutionary War appeared to Lord Cornwallis, the British commander in the south, to be going well.  British and Loyalist outposts were established throughout South Carolina and Georgia.\nIn the absence of Continental Army units in South Carolina, militia commanders like Francis Marion, Andrew Pickens, and Thomas Sumter began to form units to contest the British presence.  Sumter had been particularly successful in the northern part of the state, making attacks on Rocky Mount and Hanging Rock in early August 1780.  In August a new Continental Army threat began to form in North Carolina, as General Horatio Gates began moving a regrouped army formation, accompanied by a large number of militia, south to dispute the British outpost at Camden, South Carolina.  Cornwallis moved reinforcements to Camden from Charleston, while Sumter, in some coordination with Gates' movements, harassed British communication and supply lines.  The armies of Gates and Cornwallis met north of Camden on August 16, and Gates was decisively routed.\nOne day before, Sumter had twice fallen on British supply convoys, and his forces were slowed by prisoners and eighty wagons of supplies.  He was moving north toward Charlotte, North Carolina when he learned of the disaster at Camden.  In spite of this news, he failed to take some basic precautions when his column took a break near Fishing Creek on August 17.  After his victory at Camden, Cornwallis had ordered troops, including Banastre Tarleton and the Loyalist British Legion, to locate and neutralize Sumter.\nBattle\nTarleton, commanding about 350, left the main army on August 17 and headed first toward Rocky Mount, where he had heard that Sumter was encamped.  He arrived there late in the day only to learn that Sumter had already moved further north and was encamped on the far side of the Catawba River.  Crossing over the next morning and moving with characteristic speed, he reached the site of Sumter's camp, once again finding that Sumter had already moved on.  Picking 160 men from his company and leaving the rest to cover his rear, Tarleton continued the pursuit, and finally caught up with Sumter at Fishing Creek.\nWhile Sumter had posted guards at some distance from his camp, Tarleton was able to overwhelm them before they could raise the alarm.  Forming up the cavalry, he charged into Sumter's unprepared camp, quickly gaining control of the stands of arms.  Sumter, asleep under a wagon, barely got away in the ensuing panic.\nAftermath\nTarleton freed prisoners and recaptured the wagon trains of supplies that Sumter had taken, as well as taking 300 of Sumter's men prisoner.\nSumter arrived in Charlotte, alone, two days later.  He eventually reformed his militia, and got a measure of revenge against Tarleton at Blackstock's Farm in November 1780 -- even though Sumter himself was wounded early in the battle and Col. John Twiggs of Georgia took over command.\nReferences\nNotes\nSources\n*[https://books.google.com/books?id=4C1CAAAAIAAJ&dq=sumter%20%22Fishing%20Creek%22&pg=PA682 History of South Carolina]\n*\n*\nExternal links\n*[http://www.revolutionarywar101.com/battles/800818-fishing-creek/ The Battle of Fishing Creek] at www.revolutionarywar101.com"
    }
  ]
}