{
  "content": [
    {
      "type": "text",
      "text": "# Battle of the Virilla River\n\n| place             = Paso Real,  Virilla River, between San José and Heredia, Free State of Costa Rica\n| result            = Decisive victory for San José\n| combatant1        =  San José\n| combatant2        =  Alajuela Heredia\n| commander1        = Antonio Pinto SoaresCol. Rafael García Escalante\n| commander2        = Commander José Ángel Soto\n| strength1         = 1,000 men\n| strength2         = ~3,000 men\n| casualties1       = Unknown\n| casualties2       = Unknown\n}}\nThe Battle of the Virilla River was a battle fought on 28 October 1835 on the western bank of the Virilla River, in the context of the League War, the second Costa Rican civil war. It opposed the main League army, composed of combined forces from Heredia and Alajuela, against the militia of San José.\nBackground\nThe battle took place during the so-called League War (1835), a Costa Rican civil war sparked by the opposition of the cities of Heredia, Alajuela and Cartago to the repeal of the Ambulance Law. This law established the periodic rotation of the capital among the main cities of the country, but its repeal by the government of Braulio Carrillo Colina, based in San José, led to the formation of a military alliance among the other cities known as the League.\nAt the beginning of the conflict, San José forces dug trenches and minor skirmishes took place, while the approximately 4,300 men of the League camped outside San José. Carrillo attempted negotiations, but they were interrupted by an attack from Cartago troops at Cuesta de Moras on 14 October, where they were defeated by the San José troops, who soon after occupied Cartago.\nOn 15 October, Carrillo wrote to Commander José Ángel Soto, leader of the League, inviting him again to negotiate peace. Soto promised a quick reply, but never delivered. After the San José victory over Cartago, the forces of Heredia and Alajuela abandoned their positions at San Juan del Murciélago on the night of the 15th and relocated their headquarters to Santo Domingo, occupying the bridgeheads over the Virilla River's western bank.\nThe League fortified the area with trenches defended by seven artillery pieces and awaited further weapons purchased from an American merchant in Puntarenas. To unify command, Nicolás Ulloa was elected dictator of the League on 18 October, while Soto continued peace overtures. On 24 October, Soto and Ulloa met in Tibás with government delegates, including Juan Mora Fernández. However, the treaty's ratification was blocked by Joaquín de Iglesias, from Cartago and the true leader of the League, who opposed any settlement that excluded Cartago, the city most punished by the revolt. Despite Carrillo's generous guarantees, Iglesias prevented peace, keeping the League in resistance.\nBattle\nAfter the events of 14 October, the rebels lost much of their confidence and took a defensive stance. They destroyed the bridges over the Virilla River, blowing up the stone arch bridge and leaving only a single beam on the wooden one. On 19 October, San José forces attempted to seize the strategic crossing, defended by Heredian troops, and nearly captured the enemy artillery. However, Florentino Alfaro Zamora arrived with Alajuelan reinforcements, forcing the San José troops to retreat.\nAfter the breakdown of peace talks, Carrillo resolved to end the war militarily. On the morning of 28 October 1835, about 1,000 San José troops under Antonio Pinto Soares and Col. Rafael García Escalante attacked the League's fortified positions at the Paso Real. The rebels had entrenched themselves with seven artillery pieces on the heights. The destruction of the bridges forced the San José troops to descend and cross the deep river canyon under heavy fire, an extremely risky maneuver. Despite their numerical disadvantage, the San José forces launched a three-pronged attack against the League's center and right flank. After two hours of fierce combat, they broke through the defenses and forced the rebels to retreat.\nOutcome\nBy 3 p.m. on 28 October 1835, the San José troops occupied Heredia, while Commander Soto withdrew in good order toward Alajuela. At the outskirts of Alajuela, the League forces resisted with artillery support from 5 to 7 p.m., but eventually San José troops entered the city. Most of the League's army dispersed, though about 500 men remained. At dawn on 29 October, one of these detachments, under Soto and other leaders, surrendered on condition that their lives and property would be respected.\nAmong the trophies captured was the League's flag, raised at their main fortification at the Virilla and bearing a royal crown emblem. This flag was sent to Francisco Morazán, President of the Federal Republic of Central America, along with a rocket seized from the Cartagineses on 14 October. The San José troops refrained from looting or abuses in either Heredia or Alajuela, thus bringing the civil war to an end.\nSee also\n* League War\n* Localism (politics)\nReferences\nBibliography\n*\n*\nExternal links\n*"
    }
  ]
}