{
  "content": [
    {
      "type": "text",
      "text": "# Battles of the Loxahatchee\n\n| combatant2        = Seminole\n| commander1        =  Levin M. Powell (WIA)\n| commander2        = Abiaka\n| strength1         = 80 (55 Navy, 25 Army)\n| strength2         = 300 (estimated)\n| casualties1       = 4 killed22 wounded\n| casualties2       = Unknown\n}}\n| combatant2        = Seminole\n| commander1        = Thomas Jesup (WIA)William HarneyWilliam Lauderdale\n| commander2        = Abiaka\n| strength1         = 1,500  Unknown number of Congreve rockets and cannons\n| strength2         = 300 (estimated)\n| casualties1       = 7 killed31 wounded\n| casualties2       = 1 killed\n| image             = Loxahachee River, looking west from Jupiter Tower, from Robert N. Dennis collection of stereoscopic views.jpg\n| caption           = The Loxahatchee River area during the 1800s\n}}\nThe Battles of the Loxahatchee occurred west of Jupiter Inlet in South Florida in January 1838 between the United States Military and the Seminole Indians led by Chief Abiaka. The First Battle of the Loxahatchee (Powell's Battle) occurred on January 15, involving a joint Navy-Army unit led by U.S. Navy Lieutenant Levin M. Powell. The Second Battle of the Loxahatchee (Jesup's Battle) occurred on January 24 involving a large army under U.S. Army General Thomas Jesup. The two battles were fought around the same area against the same group of Seminoles.\nBackground\nThe Seminoles in the Loxahatchee area in January 1838 were the same group of Seminoles who had just fought at the Battle of Lake Okeechobee a month earlier. Seminole historian Billy Bowlegs III stated that Chief Abiaka led this Seminole group after the battle to the coast of Palm Beach County in order to loot shipwrecks for valuable supplies of gunpowder, clothing, and food.\nThe Battle of Lake Okeechobee and the Battles of the Loxahatchee were all part of a broader offensive into Southern Florida that was planned by General Thomas Jesup.\nBattle name\nThe names of the two battles have not been historically consistent. Older sources sometimes erroneously refer to Powell's Battle as the Battle of Jupiter Inlet (including Guinn), probably because contemporary newspaper accounts described it as occurring \"near\" the inlet.\nThe modern name of both battles refers to the Loxahatchee River (not the modern community of Loxahatchee, Florida). \"Loxahatchee\" is an Anglicized version of the waterway's Seminole name, \"Locha-hatchee\" (turtle river). Historical spellings have varied, including Lockahatchee (Mahon) and Locha-Hatchie (Buker).\nFirst Battle of the Loxahatchee (Powell's Battle)\nNavy Lieutenant Levin M. Powell was put in charge of the Everglades Expeditionary Unit, a joint Navy-Army unit tasked with launching an amphibious expedition into South Florida to search for Seminole villages. Among the unit was a German doctor named Frederick Leitner who volunteered to be a combat medic for Powell's troops. Future Confederate General Joseph E. Johnston was also part of this unit as a topographical engineer.\nThe expedition began at Fort Pierce, where Powell and his men boarded onto boats and shipped down the east coast of Florida until they landed at Jupiter Inlet on January 15, 1838. Soon after they landed, Powell's troops captured a Seminole woman and ordered her to lead them to her village. Leaving 23 of his men to guard the boats, Powell divided the rest of his men under Lt. William P. McArthur (Navy), Lt. Horace N. Harrison (Navy), and Lt. Henry W. Fowler (Army) and marched inland.\nAfter marching  inland along the Loxahatchee River, Powell's troops were suddenly fired upon by the Seminole Indians. Powell then ordered his men to charge, and the Seminoles fell back into a dense cypress swamp where they made a defensive stand. As Powell's troops advanced towards the swamp, they began to take many casualties as they were put under intense rifle fire from the Seminole warriors. Powell, McArthur, and Harrison were all wounded and the medic Frederick Leitner was killed. The loss of the officers caused Powell's men, who were mostly inexperienced Navy sailors, to flee in panic. Lt. Fowler was also wounded as he attempted to cover the retreat. With all of the officers down, Joseph E. Johnston took charge and managed to rally some of the men to cover the retreat. The U.S. troops retreated back to their boats and left after dark to flee to Fort Pierce. One boat, containing a barrel of gunpowder, was accidentally left behind during the retreat and was captured by the Seminoles. After recovering a lost man initially thought to be killed, Powell reported his losses as 4 killed and 22 wounded.\nSecond Battle of the Loxahatchee (Jesup's Battle)\nNotified that Powell had definitively located a group of Seminoles, Major General Thomas S. Jesup brought his army overland from Fort Pierce, passing west of the St. Lucie River and approaching the Seminole encampment from the west. Jesup had a force of about 1,500 men: 600 dragoons (2nd Dragoons under Lieutenant Colonel William S. Harney), 400 artillerymen (part of the 3rd Artillery Regiment under Colonel Lemuel Gates), 400 Tennessee Militiamen (under Major William Lauderdale), 100 Alabama Militiamen, and 35 Lenape Indian scouts. The Seminoles facing Jesup would utilize the same defensive tactics they used a month earlier at the Battle of Lake Okeechobee, such as cutting the sawgrass in front of their position to give them a better view of the enemy, and putting notches in the trees to steady their rifles.\nOn the afternoon of January 24, Jesup's scouts located the Seminoles in a dense hammock. Jesup's dragoons and infantry advanced towards the Seminole position, with support fire from cannons and Congreve rockets. The heavy cannon and rocket fire made the Seminoles fall back across the Loxahatchee River as they took up a second position on the east bank of the river. As the Seminoles fell back, General Jesup charged ahead on horseback towards the river.\nAs soon as General Jesup reached the bank of the Loxahatchee River, a Seminole bullet grazed Jesup's face, cutting open his left cheek and shattering his glasses. The U.S. troops and Seminole warriors then began to fire at each other across the Loxahatchee River. During this shooting battle, the Tennessee Militia troops under Major Lauderdale took the heaviest casualties. Lieutenant Colonel Harney and some of his dragoons managed to cross the river and flanked the Seminoles on the east bank. After holding off the U.S. troops long enough for their women, children, and elderly to safely evacuate, the Seminole warriors withdrew deeper into the Everglades.\nShortly after the battle, Jesup's men found the dead body of a U.S. Navy sailor from Levin M. Powell's unit, showing that both battles took place around the same area. Only one body of a Seminole warrior was found after the battle. This battle would be the last pitched battle of the Seminole Wars.\nAftermath\nGeneral Jesup complained in his report that the battle he fought was \"productive of no results\", and that it only caused the Seminoles to escape further into the Everglades, making it harder for the U.S. troops to catch them. The battle convinced Jesup that defeating the Seminole Indians was impossible, and he later wrote a letter to Secretary of War Joel Poinsett requesting that the U.S. Government allow the Seminole tribe to remain in Florida.In May 1838, Jesup was replaced by General Zachary Taylor as the commander of all U.S. troops in Florida.\nIn the meantime, Jesup's troops built Fort Jupiter near Jupiter Inlet. Major William Lauderdale would remain in the area with his Tennessee Militiamen, and two months later he would march further south to New River and build the eponymously named Fort Lauderdale. Chief Abiaka and the Seminoles would move south to Broward County, where they would be pursued again by U.S. troops at the Battle of Pine Island Ridge in March 1838.\nBattlefield today\nThe exact location of both battlefields was unclear for most of the 20th century. At one time it was incorrectly identified as having taken place in modern Jonathan Dickinson State Park, with a marker placed there accordingly. In the 1980s, numerous avocational archaeologists, not all of them working together, concluded Jesup's battle occurred in Jupiter Farms along the Loxahatchee River Northwest Fork around and south of Indiantown Road (SR 706). An extensive archaeological survey by professional archaeologist Robert S. Carr and his Archaeological and Historical Conservancy (AHC) confirmed the location of the battlefield as well as numerous Seminole and pre-Seminole archaeological sites in Riverbend Park. The part of the park where the battle took place is now Loxahatchee River Battlefield Park. The park is managed by Palm Beach County Parks and Recreation.\nThe exact location of Powell's Battle is less clear, but probably occurred east of Riverbend Park.\nThe Loxahatchee Battlefield Preservationists (LBP) have held an annual reenactment of the battle in late January since 2007.\nSee also\n*List of battles won by Indigenous peoples of the Americas\n*West Indies Squadron\nNotes\nReferences\n*\n*\n*\n*\n*\n*\n*\n*}}\nExternal links\n* [https://www.loxahatcheebattlefield.com/ Loxahatchee Battlefield Preservationists]\n* [http://apps.flheritage.com/markers/markerDetail.cfm?id=637&keyword=&city=jupiter&county= Florida State Historical Marker - Powell's Battle]\n* [http://apps.flheritage.com/markers/markerDetail.cfm?id=649&keyword=&city=jupiter&county= Florida State Historical Marker - Jesup's Battle]\n* [http://www.onlinebiographies.info/va/powell-lm.htm Levin M. Powell Biography]"
    }
  ]
}