{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Cisterna__disambig_1\n\n|result = German victory\n|combatant1 =\n|combatant2 =\n|commander1 = Mark Wayne ClarkJohn P. LucasWilliam Orlando Darby\n|commander2 = Eberhard von MackensenTraugott Herr\n|units1 = 3rd Infantry Division504th Parachute Infantry Regiment6615th Ranger Force\n|units2 = Fallschirmjäger-Lehr-Batallion\n1st Paratroop Panzer Division15th Panzergrenadier Division (elements) 1st Parachute Division (elements)\nReinforcements:71st Infantry Division26th Panzer Division\n|casualties1 = 311 killed 450 POWs761 Casualties\n|casualties2 = 400 Casualties\n|campaignbox=\n}}\nThe Battle of Cisterna took place during World War II, on 30 January–2 February 1944, near Cisterna, Italy, as part of the Battle of Anzio, part of the Italian Campaign. The battle was a clear German victory which also had repercussions on the employment of U.S. Army Rangers that went beyond the immediate tactical and strategic results of the battle.\nDuring this battle, the 1st, 3rd, and 4th U.S. Army Ranger battalions, the 83rd Chemical Mortar Battalion, and the 509th Parachute Infantry Battalion, which had been brigaded as the 6615th Ranger Force (Provisional) commanded by Colonel William O. Darby, were assigned to support the renewal of an attack by Major General Lucian Truscott's 3rd Infantry Division, which had previously failed to take Cisterna from 25 to 27 January. The 3rd Division's attack was part of a large offensive by Major General John Lucas's U.S. VI Corps to break out of the Anzio beachhead before German reinforcements could arrive and concentrate for a counterattack.\nBackground\nplan of attack and force dispositions at Cisterna 30 January 1944.]]\nOn 22 January 1944, the Allies launched Operation Shingle, the amphibious landing by the U.S. and British divisions of U.S. VI Corps in the area of Anzio and Nettuno. This was designed to unhinge the formidable German Gustav Line defenses some  to the southeast which had been under attack from the south by the other three corps (one British, one French and one U.S.) of Mark Clark's United States Fifth Army since 16 January in the first Battle of Monte Cassino. Following the landings, which had been virtually unopposed, John P. Lucas—the VI Corps commander—had chosen a cautious strategy of consolidating the beachhead and building up his force strength, which also allowed time for the Germans to reinforce their defensive positions. By 29 January, there were 69,000 men in the beachhead, but the Germans had also had time to react and move 71,500 troops to face them.\nOn 31 January, Lucas launched a two-pronged attack. The main attack, by British 1st Infantry Division, was to advance northeast up the Via Anziate toward Campoleone and the Alban Hills. In a secondary simultaneous attack, a Ranger force was to infiltrate Cisterna and clear the Conca-Cisterna Road during the night preparatory to an attack in the morning by 15th Infantry Regiment on the town and supporting attacks by 504th Parachute Infantry Regiment on their right and 7th Infantry Regiment on their left. 7th Infantry was to cut Route 7, the main supply line to the German Tenth Army on the Gustav Line, at Cassino.\nHowever, the plan had been based on the misinterpretation of reconnaissance intelligence, which had concluded that the main line of German resistance was behind Cisterna. In fact, the Wehrmacht had designated Cisterna as an assembly area for its reserve divisions and had begun moving units into the area. Although a Polish conscript in the German Army had deserted to the U.S. lines immediately before the attack, warning of the buildup, the message was not relayed promptly and the attack proceeded as planned.\nThe Rangers, who expected to encounter a line of thinly held outposts advanced unknowingly towards a large enemy force.\nContrary to their designated function as an elite raiding force, the Rangers had been involved in much of the front line fighting around the Anzio beachhead. Ranger casualties meant many replacements were recruits who lacked the experience and quality of training of the original members. The growing presence of green troops in an otherwise skilled force degraded its ability to conduct successful infiltration and night operations.\nBattle\nThe 1st and 3rd Ranger Battalions—preceding the main attack by the 4th Ranger Battalion and the 3rd Battalion, 15th Infantry Regiment—attempted a night infiltration behind German lines into the town of Cisterna. Their objective was to seize the town in a surprise attack and hold it until the main attack came through.\nThe two battalions—totaling 767 men and supported by a platoon of 43 men of the 3rd Reconnaissance Troop—moved out at 01:30 and moved in the darkness along a drainage ditch (Mussolini Canal) in column formation. Although they were able to bypass numerous German positions, at first light they were still short of their objective and needed to cross open ground for the final section of the approach. At this point the Rangers were attacked by strong German forces of the 715th Infantry Division and Hermann Göring Panzer Division, including at least seventeen German Panzer IV tanks. According to the Army history of the operation, the infiltration movement had apparently been discovered and an ambush prepared.\nThe 1st Battalion commander—Major Dobson—personally knocked out one tank by shooting the commander with his pistol, climbing atop the tank, and dropping a white phosphorus grenade down the hatch. Two other tanks were captured by Rangers, but then knocked out by other Rangers who did not know they had been captured. Despite fierce fighting, there was little chance of success once the Rangers were attacked on the open ground. German units put Ranger prisoners in front of their tanks and commanded other Rangers to surrender. Over 700 POWs were captured.\nAttempted relief of the Rangers\nThe main assault also jumped off in an  attempt to rescue the trapped battalions. Led by the 4th Ranger Battalion, it encountered serious opposition and failed to break through. However, the overall attack—which also included an attack by the 7th Infantry Regiment and 504th Parachute Infantry Regiments—did push the Allied lines forward  on a  wide front on 31 January and 1 February, although failing to achieve the desired breakthrough and Cisterna was to remain in German hands until May 1944. However, German counterattacks on 1–2 February—conducted by the Hermann Göring Panzer and 71st Infantry Divisions—failed to recapture any of the ground from the Allies and suffered severe casualties.\nAftermath\nLater intelligence revealed that the American efforts had hindered the planned German counterattack on the Allied forces at Anzio.\nGen Lucas' employment of the lightly armed Rangers to spearhead the attack was heavily criticized. The shattered Ranger forces within Italy were subsequently disbanded, and as many as four-hundred surviving Rangers served as replacements in the US/Canadian First Special Service Force, an elite raiding force in need of qualified replacements.\nWilliam O. Darby had commanded the American Ranger Force during the battle. When the 179th Infantry Regiment of the 45th Infantry Division was nearly overrun on 18 February during the major German attempt to take out the beachhead, Darby was sent to take command and hold the ground. Darby later was assistant division commander of the 10th Mountain Division. He was killed in action on 30 April 1945, and was the only U.S. officer honored with a posthumous promotion to General during World War II.\nA fictionalized account of the battle was depicted in the motion picture Anzio (1968) and at the end of the film ''Darby's Rangers (1958).\nSee also\n* Cisterna di Latina''\n* Ivor Parry Evans\nReferences\n*\n*\n*\n*\n*\n*\nNotes\nExternal links\n* [http://darbysrangers.tripod.com/id6.htm Battle of Cisterna at Darby's Rangers website]"
    }
  ]
}