{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Dibrivka\n\n| map_type          =\n| map_relief        =\n| map_size          =\n| map_marksize      =\n| map_caption       =\n| map_label         =\n| territory         =\n| result            = Insurgent victory\n*Insurgent movement extends throughout Katerynoslav\n*Subsequent reprisals against each other by the Central Powers and insurgents\n| status            =\n| combatants_header =\n| combatant1        = Central Powers\n* Austria-Hungary\n* Ukrainian State\n| combatant2        =  Anarchists\n| combatant3        =\n| commander1        = Unknown\n| commander2        =  Nestor Makhno Fedir Shchus\n| commander3        =\n| units1            =   Ukrainian State Guard|uk|Державна варта}}\n| units2            =  Insurgents\n| units3            =\n| strength1         = 500 Austrians200 Haydamaks\n| strength2         = 30 Insurgents\n| strength3         =\n| casualties1       = 620 killed80 captured\n| casualties2       = Unknown\n| casualties3       =\n| notes             =\n| campaignbox       =\n}}\nThe Battle of Dibrivka was a military conflict between Ukrainian insurgents, led by Nestor Makhno and Fedir Shchus, and the Central Powers that were occupying southern Ukraine. It took place on 30 September 1918, towards the end of World War I. The battle began when Makhno, Shchus, and a group of anarchist supporters ambushed Austrian and Ukrainian detachments stationed in Dibrivka. The anarchists were armed with machine guns and were assisted by local peasants, who together captured ammunition, arms, and prisoners of war. It resulted in an insurgent victory and the establishment of an autonomous territory in the region, following the subsequent defeat of the Central Powers.\nBackground\nFollowing the October Revolution, a civil war broke out in Ukraine between supporters of the Central Council and the Soviets. During the conflict, Ukrainian anarchists had sided with the Soviets. But following the Treaty of Brest-Litovsk, the Central Powers were invited to invade Ukraine. The anarchists were forced to retreat to Russia, where they regrouped in Taganrog and planned to launch a war of independence against the occupying powers.\nIn July 1918, the anarchists returned to Ukraine, finding a situation of unrest among the peasantry, who were beginning to resist the newly established Ukrainian State, a client state of the German Empire. The insurgent leader Nestor Makhno clandestinely returned to his hometown of Huliaipole, where he held secret meetings with other anarchists, with whom he made plans to ignite an insurrection against the occupation forces. On 26 September, Makhno's insurgent group ambushed the Austrian detachment in Huliaipole and seized their weapons and horses. The anarchists then withdrew north to Pokrovske, where they launched another surprise attack against the Austrians and briefly captured the town from the occupying powers.\nBattle and planning\nAfter receiving a number of new recruits into their ranks, Nestor Makhno's detachment withdrew north to the village of Dibrivka. Following an attack by Austrian reinforcements from Polohy, Makhno's detachment retreated into the nearby forest where they joined forces with another small insurgent detachment led by Fedir Shchus. Shchus's detachment had been sheltering in the forest since July, after a defeat at the hands of the Austrians.\nWhile the insurgents discussed the recent advance of Anton Denikin's Volunteer Army in South Russia, on 30 September, the Austrians set up roadblocks around the village, isolating the insurgents in the forest. The combined insurgent forces found themselves surrounded with Austrians stationed along the Vovcha river in the south-east; a German detachment stationed on the high ground with an artillery piece; another Austrian infantry brigade stationed in the north; 200 cavalry of the Ukrainian State Guard stationed in the west; and reinforcements on the way. Makhno devised a plan to break the encirclement—a surprise attack against the troops in the village itself—and managed to convince Shchus to join.\nMakhno and Shchus selected 30 men to carry out the attack, which was to take place during the day, while the Austrians were resting. Shchus led his smaller detachment to flank from the other side of the village and prepare a Maxim gun for flanking fire. Makhno's larger detachment covertly approached the town square with a Lewis gun, undetected by the Austrians. Most of the Austrian detachment was wiped out in the crossfire. Others turned and fled in a panic. Retreating towards Pokrovske, the Austrians were pursued and captured by the local peasantry, who were themselves armed only with pitchforks. Makhno himself prevented the peasantry from lynching the Austrians.\nIn the course of the battle, the insurgents managed to capture four machine guns, two truckloads of ammunition and 80 prisoners of war. The captured members of the Ukrainian State Guard and local collaborationist landowners were executed, while the captured Austrians were fed and released on condition of their demilitarisation, stripping them of their kepis before sending them on their way. For his role in their victory, the insurgents bestowed Makhno with the title Batko (Father), which remained his moniker throughout the remainder of the war.\nAftermath\nFollowing the victory at Dibrivka, the insurgents went on to briefly occupy Huliaipole, which became a center of peasant resistance against the Central Powers. They were swiftly joined by Vasyl Kurylenko in Berdiansk and Petro Petrenko in Hryshyne, which greatly expanded the insurgents' sphere of influence to cover most of Katerynoslav and Northern Tavria. The German commander-in-chief responded by ordering the liquidation of the Ukrainian insurgents. The Austrians and Haydamaks subsequently returned to Dibrivka and bombarded the village with artillery, forcing the insurgents to retreat as the occupation forces set fire to the village, destroying over 600 houses. This prompted fierce reprisals from the insurgents, who in turn set fire to the houses of the wealthy in  and Ivanivka|uk|Іванівка (Васильківський район)}}, and carried out attacks against the region's Mennonites that had collaborated with the occupation forces.\nSupported by seizures from the local landowners and with increasing disaffection among the ranks of the occupying forces, the insurrection spread throughout southern and eastern Ukraine, with Tsarekostyantynivka and Dibrivka both briefly falling under anarchist occupation. The insurgents were then pushed south to Temyrivka, where they were defeated in a surprise attack by a Hungarian detachment, killing half the insurgents and wounding their commanders. But following reinforcements by another insurgent detachment led by Simeon Pravda, on 27 November, the anarchists decisively reoccupied Huliaipole, where they established a general staff for an organised Revolutionary Insurgent Army. The Central Powers were subsequently driven out of southern Ukraine and, following their surrender to the Allies, the Ukrainian State was overthrown by the Directorate, which reestablished the Ukrainian People's Republic.\nOn 23 January 1919, Dibrivka played host to the First Regional Congress of Peasants, Workers and Insurgents, which discussed how to strengthen the frontlines against the forces of the Ukrainian nationalists and the White movement. Soon after, the Makhnovshchina made a pact with the newly established Ukrainian Soviet Socialist Republic and the insurgents were integrated into the Red Army.\nReferences\nBibliography\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*"
    }
  ]
}