{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Ouled Bouachra\n\ntemplate -->\n| map_type    =\n| map_relief  =\n| map_size    =\n| map_marksize =\n| map_caption =\n| map_label   =\n| territory   =\n| result      = ALN victory\n| status      =\n| combatants_header =\n| combatant1  =  ALN\n| combatant2  =  France\n| combatant3  =\n| commander1  =  Lakhdar Bouregaa\n| commander2  =  Jacques Massu\n| commander3  =\n| units1      =  Zoubiria Unit El Omaria Unit El Hamdania Unit\n| units2      =  French Sniper Brigade\n| units3      =\n| strength1   = 540–600\n| strength2   = Unknown\n| strength3   =\n| casualties1 = 140~ men\n| casualties2 = 600 or 900 men\n| casualties3 =\n| notes       =\n| campaignbox =\n}}\nThe Battle of Ouled Bouachra or most commonly known as the Battle of Mount Mokorno was a battle between the ALN and the French colonial forces on 30 December 1958.\nBackground\nOn December 29, 1958, the Zoubiria, El Hamdania, and El Omaria units, deployed throughout Wilaya IV, gathered near the commune of Ouled Bouachraa, located west of Medea where the headquarters of Wilaya IV was situated. A meeting was planned to consolidate these units into a single division. However, before this could happen, they were alerted to the unusual presence of French colonial forces around Ouled Bouachraa. In response, the command of Wilaya IV ordered the deployment of these units and preparation for combat.\nBattle\nThe scheduled meeting was subsequently canceled, and on December 30, the three units were deployed to wooded highlands to facilitate the withdrawal of the main unit at Ouled Bouachra. The confrontation became unavoidable due to the significant presence of French military forces in the area, marking the commencement of Massu’s offensive. The battle commenced at 10 AM with the first shots fired. Despite their reluctance, the El Omaria, El Hamdania, and Zoubiria battalions managed to halt the French advancement towards Ouled Bouachra and were drawn into the battle. The intensity of the conflict escalated over time, spreading to neighboring areas. ALN forces also successfully delayed the progress of a French sniper battalion stationed in Berrouaghia, causing substantial damage to their semi-commando elements. With the intervention of French tanks, aircraft, and artillery, the battle intensified further. Witnesses of the battle noted gunfire originating from the air and French bombing raids on the villages. Many French soldiers refused to participate in the battle due to fear, opting to face military court rather than what they described as \"Hell.\" Additionally, numerous members of the Sniper Brigade disobeyed Massu’s orders. Consequently, France had to reinforce its troops from Blida and Algiers, the ALN forces managed to escape by evading enemy lines.\nThe ALN lost about 140 men mainly cause of Napalm Bombs and Artillery Bombardement, while the French lost 600 or 900 men.\nReferences"
    }
  ]
}