{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Wyse Fork__disambig_1\n\n&ndash;\n| place             = Lenoir County,near Kinston, North Carolina\n| result            = Union victory\n| combatant1        =  United States (Union)\n| combatant2        =  CSA (Confederacy)\n| commander1        = John M. SchofieldJacob D. Cox\n| commander2        = Braxton Bragg\n| units1            = Cox's Provisional Corps\n| units2            = Department of North Carolina\nHoke’s Division (Army of No. Virginia)\n| strength1         = 12,000\n| strength2         = 8,500\n| casualties1       = 1,257\n| casualties2       = 1,500\n| campaignbox       =\n}}\nThe Battle of Wyse Fork, also known as the Battle of Kinston, was fought in the Carolinas campaign of the American Civil War, resulting in a Union Army victory.\nBackground\nAt the end of February 1865 the port city of Wilmington had fallen to Union troops under the command of Maj. Gen. John M. Schofield. Schofield was then to move his forces inland from the coast and join with Maj. Gen. William T. Sherman's forces at Goldsboro, North Carolina, where three Union armies would move against a Confederate army being gathered under Confederate General Joseph E. Johnston. Schofield, with the units from Alfred Terry's Expeditionary Corps, moved north from Wilmington, while Maj. Gen. Jacob D. Cox took his XXIII Corps division and sailed up the coast and landed at New Bern, North Carolina.\nAt New Bern, the Union forces were increased to three divisions and formed into a Provisional Corps with Cox in command.  Moving towards Goldsboro, the Union forces repaired the railroad which was to function as a supply route for Sherman's Army Group. Johnston's army was too far away to move against Schofield's divided forces, but General Braxton Bragg's forces, falling back from Wilmington, were within striking distance. Bragg moved against Cox near Kinston.\nOpposing forces\nUnion\nUnion order of battle}}\nConfederate\nConfederate order of battle}}\nBattle\n.]]\nOn March 7, Federal advance units encountered Bragg's entrenched forces along Southwest Creek east of Kinston. Bragg's position not only blocked Cox's path but threatened a vital cross road and the New Bern-Goldsboro Railroad. Cox saw the importance of this position and moved forward the divisions of Brig. Gen. Innis N. Palmer to protect the railroad and Maj. Gen. Samuel P. Carter to protect the roads. Bragg's forces were also reinforced by veterans from the Army of Tennessee and the North Carolina Junior Reserves, all under the command of General D.H. Hill. Reinforced, Bragg went on the offensive and sent a division under North Carolina native Robert Hoke into the Union left flank. Hoke's attack hit a New England brigade in Carter's division, capturing an entire regiment (the 15th Connecticut Volunteer Infantry). Hill joined the advance with the Junior Reserves but they panicked and refused to go any further. Hill left them behind and moved on with his veterans, hitting the Union brigade and defeating it. Disaster threatened the Union flank when Bragg stopped Hill's advance and sent him far to the north to counterattack a Union threat. When Hill arrived he found no Federals in sight. At this time Cox, who had been away from the front lines, returned and moved up his reserve division under Maj. Gen. Thomas H. Ruger to plug the gap between Palmer and Carter.\nSkirmishing continued for the next few days until Hoke tried again to turn the Federal left flank on March 10. The Federal position had been strongly fortified by artillery and repulsed Hoke's attack within an hour. Hill then moved against the Union center but again Federal artillery proved decisive and the attackers were repulsed. The remaining elements from the Federal XXIII Corps, which had just arrived in New Bern from Tennessee, were moving on Kinston. Facing five Union divisions, Bragg withdrew.\nAftermath\nBragg had only momentarily been able to check Cox's advance. Schofield's forces reached two full corps and were organized into the Army of the Ohio. Sherman's armies, which had just defeated Johnston's army at Bentonville, joined with Schofield at Goldsboro on March 23. Facing three Union armies, Johnston retreated to the north and on April 26 Johnston surrendered to Sherman.\nBattlefield preservation\nThe American Battlefield Trust and its partners have acquired and preserved more than  of the Wyse Fork battlefield. The battlefield is listed on the National Register of Historic Places in Lenoir County, North Carolina.\nThe battlefield is now under threat by an NCDOT project to create a bypass around Kinston. It currently faces local opposition from lawmakers and the public.\nU.S. 70 Kinston Bypass-Wyse Fork Interchange\nThe N.C. Department of Transportation (NCDOT) has proposed upgrading the existing four-lane US 70 in the Kinston area to interstate standards as part of the I-42 project. The proposed project is known as R-2553 in the NCDOT's Statewide Transportation Improvement Program. The current roadway designs include an interchange with a bridge and ramps at the intersection of Wyse Fork Road and US 70, along with associated service roads that would be built. This is currently a conventional intersection with stop signs on Wyse Fork Road.\nNCDOT is working with federal and state partners to minimize all environmental impacts, including to the historic battlefield. Specifically, NCDOT is working with the U.S. Army Corps of Engineers and the N.C. State Historic Preservation Office by following the National Historic Preservation Act of 1966 Section 106 review process for determining impacts to the battlefield and developing mitigation efforts.\nNCDOT has created a project website  that includes more details, such as the project's timeline and estimated costs and preliminary roadway design maps of the 21-mile section of U.S. 70 to be upgraded to interstate standards. The website also features a Frequently Asked Questions page  section and a virtual room  with video simulations showing how the upgraded highway would look and function.\nAlternative names\nThe battle was also known by the following names:\n*Battle of Wyse's Fork\n*Battle of Wise's Forks\n*Battle of Wilcox's Bridge\n*Battle of Kelly's Mill Pond\n*Second Battle of Kinston\n*Second Battle of Southwest Creek\nReferences\n*\n* [https://web.archive.org/web/20121108205114/http://www.nps.gov/hps/abpp/CWSII/NorthCarolinaBattlefieldProfiles/Monroes%20Cross%20Roads%20to%20Wyse%20Fork.pdf CWSAC Report Update]\n*\n*\n*\n*"
    }
  ]
}