{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Bhagalpur (1745)\n\n| map_type          = Bihar#India\n| map_relief        = Solid\n| map_size          = 320px\n| map_marksize      = 12\n| map_caption       =\n| map_label         = Battle of Bhagalpur\n| map_mark          = Big battle symbol.svg\n| territory         = Status quo ante bellum\n| result            = Bengal Subah victory\n| status            =\n| combatants_header =\n| combatant1        =   Bengal Subah\n| combatant2        =\n* Maratha Empire\n**Nagpur State\n| combatant3        =\n| commander1        = Alivardi KhanDost Mohammad KhanJaswantnagarMir Ghulam Ashraf\n| commander2        = Raghuji Bhonsle\n| units1            =\n| units2            =\n| units3            =\n| strength1         = 600 cavalry\n| strength2         = 6,000 cavalry\n| strength3         =\n| casualties1       = Unknown\n| casualties2       = Heavy\n| casualties3       =\n| notes             =\n}}\nBattle of Bhagalpur in 1745 was a military conflict between Marathas under Raghuji I of Nagpur and Nawab Alivardi Khan in the Bihar province of Bengal Subah.\nBackground\nIn September 1745, Raghoji attacked Bihar. This strong team of Marathas and Afghans was a big challenge for Alivardi. Also, his main Afghan generals, Shamshir Khan and Sardar Khan, were not loyal to him. They betrayed Alivardi against the Marathas in a battle near Naubatpur on the bank of Sone River in November.\nBattle\nWhen Alivardi was away from Murshidabad, the Marathas led by Raghuji quickly rode their light horses to attack and destroy the city.\nThe Nawab's forces crossed the Son River under considerable difficulty, enduring severe shortages of provisions. Two prominent officers under Zain ud-Din, Jaswantnagar and Mir Ghulam Ashraf joined the Nawab's army after facing significant hardships en route due to Maratha interference. Alivardi subsequently directed his advance toward Bengal via Maner and Patna.\nAlivardi rushed back to Murshidabad, but on the way, Raghuji and his 6,000 men ambushed Alivardi near Bhagalpur. Despite being outnumbered, Alivardi bravely fought back with his 600 men and managed to drive the Marathas away. Alivardi was helped by his own officer named Dost Mohammad Khan, who surrounded Raghuji in a way that forced him to leave the area.\nAftermath\nTo avoid facing the Bengal army again, Raghuji decided to take a different route through the hills and jungles of Santhal Parganas and Birbhum on his way to Murshidabad.After suffering a defeat at Bhagalpur, Raghuji crossed Murshidabad and reached Katwa, where he faced a crushing defeat at the hands of Nawab and was forced to retreat back to his state.\nSee also\n*Battle of Katwa (1742)\n*Battle of Jagdishpur (1745)\n*Battle of Naubatpur (1745)\n*Siege of Barabati (1745)\nReferences\nBibliography\n*\n*\n*\n*"
    }
  ]
}