{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Fitjar__disambig_1\n\n|combatant2  =Sons of Eirik Bloodaxe\n|commander1  = King Haakon the GoodThoralf Skolmsson the Strong\n|commander2  =Harald GreycloakEyvind skreyja (‘the wretch’)\n|strength1   = The king's retinueMen from across Norway, including Hålogaland and RogalandLocal farmers from Stord\n|strength2   = Unknown, although it is said they outnumbered the Norwegians six to one\n|casualties1 =Unknown\n|casualties2 =Unknown\n|notes       =\n|campaignbox =\n}}\nThe Battle of Fitjar (Slaget ved Fitjar på Stord) took place in 961 in Fitjar on the island Stord in the county of Hordaland, Norway.\nBattle and aftermath\nThe Battle of Fitjar at Stord was the last battle in a war between the sons of Eric Bloodaxe and their uncle King Haakon the Good for power over Norway. It also formed part of a contest between Norway and Denmark to control the area of Oslofjord.\nErling Eiriksson, Sigurd Sleva and Harald Greycloak, three of the sons of Eric Bloodaxe (Eirikssønnene) landed unnoticed on Hordaland in 961 and surprised the king at Fitjar. The battle was won by the forces of King Haakon, but he was wounded in the battle and died soon after it. According to Fagrskinna and Heimskringla, the dying king, wishing to end the conflict, handed over his kingship and retinue (hird) to Harald Greycloak, sending a letter to that effect.\nAfter Haakon's death, Harald Greycloak and his brothers became kings of Norway, but they had little authority outside western Norway. The third son of Eric Bloodaxe, Harald was the most powerful of the brothers by right of being the eldest surviving son. The succession issue was finally settled after Harald ascended the throne as Harald II of Norway. However, the Norwegians were severely tormented by years of war, and many were dissatisfied by the destruction of pagan shrines by the hands of the Christian sons of Eric. After the assassination of Harald II, Harald Bluetooth (Harald I of Denmark) managed to force the people of Norway into temporary subjection.\nLegacy\nIn memory of Haakon, his follower the skald Eyvindr skáldaspillir composed the poem Hákonarmál. The poem tells of the battle, the king’s death, and how he is greeted by the gods in Valhalla.\nAt Håkonarparken in Fitjar, a statue of King Haakon serves as a memorial to the Battle of Fitjar. The coat-of-arms of the municipality of Fitjar show a golden helmet. This is derived from the fact that King Haakon wore a golden helmet at the Battle of Fitjar.\nReferences\nOther sources\n* Enstad, Nils-Petter Sverd eller kors? Kristningen av Norge som politisk prosess fra Håkon den gode til Olav Kyrre (Kolofon forlag, 2008)\n* Krag, Claus (1995) Vikingtid og rikssamling 800-1130 (Aschehoug's History of Norway, 2.)\nExternal links\n* [https://skaldic.ku.dk/q?p=skp/skalds/poem/1187 Hákonarmál] in Old Norse and English translation"
    }
  ]
}