{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Vyborg Bay (1944)\n\n| territory         = Soviets capture the main Vyborg Bay islands\n| result            = Finnish defensive victory\n| status            =\n| combatant1        =   Soviet Union\n| combatant2        =\n| combatant3        =\n| commander1        =  Leonid Govorov Vladimir Tributs\n| commander2        =  Pekka Enkainen Hero Breusing\n| commander3        =\n| units1            =  59th Army\n*43rd Corps\n**124th Rifle Division\n**224th Rifle Division\nBaltic Fleet\n*260th Marine Regiment\n| units2            =  V Corps\n*22nd Coastal Artillery Regiment\n*Cavalry Brigade\n* 122nd Infantry Division\nFinnish Navy\n| units3            =\n| strength1         =\n| strength2         =\n| strength3         =\n| casualties1       =\n| casualties2       =\n| casualties3       =\n| notes             =\n}}\nThe Battle of Vyborg Bay () was fought in the Finnish-Soviet Continuation War (1941–1944).\nBackground\nThe Soviet offensive against the Finns started on 10 June and managed to break through the Finnish defensive lines at Valkeasaari and Kuuterselkä on 15 June. This forced the Finnish forces on the Karelian Isthmus to withdraw to the still incomplete Finnish VKT-line. Although Soviet advance forces captured Vyborg on 20 June, the main offensive got stuck in the stubborn Finnish defense of the Tali-Ihantala region. Despite heavy fighting and use of fresh reserves, the VKT-line bent but did not break, forcing the Leningrad Front to seek alternate routes past the Finnish defenses. The Leningrad Front followed roughly the same plan as in the Winter War and made plans for a crossing of Vyborg Bay.\nOrder of battle\nSoviet\nSoviet forces that took part in the battle were part of the Leningrad Front under Leonid Govorov's command. The attack across the Bay of Vyborg was assigned to the 59th Army (Ivan Korovnikov) to which the 43rd Rifle Corps (Andreyev) was subordinated. Infantry forces involved in the offensive were the 124th and 224th Rifle Divisions with the 80th Rifle Division being kept in reserve. Only a few Soviet tanks were assigned to support the offensive. Several artillery regiments were assigned to the offensive, it also had air support from the Baltic Fleet and light naval forces of the Soviet Baltic Fleet as well as the 260th Naval Infantry Regiment also supported the offensive.\nFinnish\nInitially the forces responsible for the defense were the 22nd Coastal Artillery Regiment (RTR 22) of the Eastern Bay of Finland Coastal Brigade (Enkainen), under the command of the Commander of the Finnish Navy, and parts of the Cavalry Brigade (Tähtinen) under the Finnish V Corps (V AK). Both the 22nd Coastal Artillery Regiment and the newly arrived German 122nd Infantry Division (Breusing) were subsequently subordinated to the Finnish V Corps. A large portion of the Finnish Navy supported the defensive operations.\nBattle\nInitially the Vyborg Bay islands were in a fairly strong position with the Finnish garrison on the Koivisto islands preventing Soviet naval forces from gaining access to the bay. The Soviet Baltic Fleet landed a small assault force on the islands, but the Finnish garrison managed to keep the bridgehead contained. Nevertheless, Finnish headquarters decided it would be impossible to keep the troops in the islands supplied given Soviet air supremacy, and withdrew their forces from the islands unopposed. This opened the route for the Baltic Fleet to get safely into the bay.\n30 June and 1 July: Initial assaults\nBattles in Vyborg Bay started on 30 June with the Soviet 224th Rifle Division's attempt to capture the islands of Teikari and Melansaari.\nThe 3rd Battalion of the 224th's 185th Rifle Regiment landed on Teikari from ships of the Kronstadt Naval Defense Region late in the evening on 30 June, after a fifty-kilometer foot march that exhausted the troops. The artillery group was still on the march and could not offer effective support. The Soviets carried out artillery and aerial bombardment of the island. Under the cover of a smokescreen, the battalion landed on the southern and eastern parts of the island and at first did not encounter serious Finnish resistance. However, the Finnish defenders transported three companies to the island and counterattacked from three sides. By the morning of 1 July, the Soviet battalion exhausted its ammunition and lost radio contact. After intense night battles, the Finnish defenders wiped out the Soviet landing force almost fully, as the Baltic Fleet ships were unable to provide support. Finnish losses were 117 men killed and wounded, while the Finnish estimated Soviet losses at 326 men killed and captured.\nThe Soviet landings fared no better closer to Vyborg. The 1st and 2nd Battalions of the 185th Regiment were tasked with seizing the islands of Ravansari, Esisaari and Suonionsaari. The rifle companies began crossing the Trongzundsky bay by improvised means at 22:30 on 30 June. The 3rd Rifle Company, crossing to the southeast part of Ravansaari, came under intense fire that prevented it from landing and retreated back to its starting positions having lost 75 percent of its personnel. The 2nd Rifle Company managed to take the southern part of Ravansaari in the region of the spit of the burned port at a cost of 35 percent losses. The 1st Rifle Company began to cross from the pier to Suonionsaari. Two boats managed to creep into the channel, and land their troops. By the evening of 1 July, six more boats from the 1st and 4th companies crossed through the channel. The 5th and 6th companies remained in reserve on the Soviet bank and prepared for landing.\nDuring 1 July, the companies of the 185th Regiment were unable to clear the Finnish defenders from Ravansaari and Suonionsaari. When the destruction of the Teikari landing force was made clear, 224th Division commander Colonel Fyodor Burmistrov decided to pause the operation and thoroughly prepare for the next landings. A new order for the offensive was ready at 15:50 on 2 July, which stipulated that all three regiments of the division were to seize all four islands in cooperation with the ships of the Kronstandt Naval Defense Region. The offensive was postponed until 4 July due to a lack of time to train for the offensive and organize cooperation with the navy, artillery and aviation.\n4 July\nAfter a long artillery and aerial bombardment, the 143rd and 185th Regiments crossed to Suonionsaari and Ravansaari and by the evening of 4 July had taken full control of the islands. The regiments were supported by five T-26 tanks landed on Suonionsaari.\nThe 160th Rifle Regiment landed on Teikari, but several landing ships lost their bearings in the smokescreen and mistakenly landed the 7th and 8th companies on the neighboring island of Melansaari. Reinforced from the mainland, the Finnish defenders wiped out these two companies, with a few survivors escaping by swimming to Teikari. On the approach to Teikari itself, one cutter hit a mine, killing almost all the headquarters of the 160th Rifle Regiment, including its chief of staff. The regimental mortar company was lost when its cutter also fell victim to a mine. Regimental commander Major S. N. Ilyin landed on an unnamed island east of Teikari by mistake. Soon afterwards landing commander Captain 2nd Rank Gerasimov was killed when his subchaser BMO-503 struck a mine. The cutters carrying the five T-26 tanks assigned to support the landing turned around and made no attempt to land. These casualties weakened the Soviet assault group and resulted in loss of command and control.\nNonetheless, the 160th Regiment cleared part of Teikari. The first Soviet landing parties disembarked on the eastern bank at 10:50. The 2nd Rifle Battalion cleared the southern bank of the island and consolidated its positions. The 1st Rifle Battalion faced sustained Finnish resistance in the northern part of the island and a counterattack forced it back to the bay in the eastern part of the island. Both sides suffered heavy losses, and almost all of the Finnish officers were killed in action, leaving Corporal Viljo Vyyryläinen in command. During the day, the Finnish reinforced the defense of Teikari with the 3rd company and 2nd machine gun company of the 7th Coast Defense Battalion. These fresh units went on the offensive but halted in the middle of the island after the 3rd company commander, Captain Lars Westerholm, was mortally wounded. On the night of 4–5 July, an assault group led by Captain Salomaa with 110 soldiers armed with submachine guns and forty sappers landed, and 1st Motorized Coastal Battalion commander Major Kauko Miekkavaara arrived to ascertain the situation and correct artillery fire. Miekkavaara was killed in an attack early in the morning. Under the cover of a smoke screen, the Finnish troops went on the offensive again. As a result of sustained battles elements of the 160th Regiment were driven back to the shore near the settlement, where 50 soldiers were picked up from the water by Baltic Fleet ships. A second small group retreated to the southeastern end of the island, where they made a last stand on the cliffs. The 160th Regiment was almost entirely killed, with only 82 men returning out of the 1,136 involved in the landing. The regiment lost four 45 mm anti-tank guns, four regimental guns and six 120 mm mortars on Teikari.\n5 July\nThe third Soviet landing attempt on Teikari began on the morning of 5 July. The 406th Rifle Regiment of the 124th Rifle Division embarked on nine cutter and nine torpedo boats with mortars and artillery. Two battalions landed on the northeastern part of the island and despite Finnish fire and the mines on the shore, managed to secure a bridgehead. The landing ships with the 3rd battalion came under powerful Finnish artillery fire. By mistake the battalion disembarked on the unnamed islet east of Teikari, and right away came under short-range submachine gun fire. According to Finnish reports all who tried to swim to Teikari from the islet were killed in the water by submachine gun fire. Only a small portion of the battalion was landed on Teikari itself together with regimental commander Lieutenant Colonel Golovin.\nAt 13:00, the 1st battalion of the 124th Division's 622nd Rifle Regiment landed on the southern part of Teikari. The battalion was supported by three T-26 tanks, having lost another tank sunk during the landing. 124th Division commander Colonel Mikhail Papchenko arrived to direct operations on the island. By 20:00, the Soviet landing cleared the island. During the fight, the companies of the 124th Division linked up with the remnants of the 160th Rifle Regiment that had clung to the rocks on the southeastern part of the island for more than a day. During the battle, more than thirty captured soldiers from the 160th were freed. Soviet units captured nine guns, 47 machine guns, 100 submachine guns and more than 500 rifles, as well as 36 soldiers and one officer, a company commander. In the evening of 5 July, the 2nd battalion of the 406th Regiment seized Melansaari. The Finnish estimated their losses in the battles for Teikari at 300 killed and 530 wounded and missing.\nOn 4 and 5 July, the Finnish Navy, supported by several German AFP gunbarges, made several raids on Vyborg Bay in an attempt to disrupt the Soviet landings on the islands. Heavy Soviet resistance from shore artillery, numerous Motor Torpedo Boats, (MTB)s, and the Soviet air force forced the Finns to withdraw without reaching the intended target area. Although none of the Finnish ships were sunk, most of them suffered casualties among their crews and were badly damaged, requiring immediate repairs. This situation effectively forced Finnish naval forces to withdraw from the battle. Of the Finnish ships, the worst damage was suffered by the auxiliary gunboat Viena during a Soviet air attack on its anchorage. The ship came close to sinking but was still able to return to Helsinki for repairs.\nConclusion of fighting\nSoviet units seized the nearby small islands in a series of small-scale landings on 6 July. They continued the offensive to the mainland to the north on 7 July. At this time, the German 122nd Infantry Division began to take over the defensive positions from the Finns. Its four artillery battalions had already taken part in the battle for the islands from the first days of July. The German artillery included a battalion of StuH 42 assault guns, which fired on Soviet landing craft at point-blank range from the shores of the bay. On Hapenensaari, elements of the 224th landed just as the Germans relieved the Finns. The battle on the island continued all night, and by the morning of 8 July, the Soviet troops were repulsed. The last attempt of the 59th Army to land on the northwestern coast of the Gulf of Vyborg began on 9 July. The 224th managed to direct about a battalion against Cape Haryuniemi. Just one cutter approached the cape with 25 soldiers, who were killed or captured by the Germans in an hour. The battalion lost a total of roughly 150 men. The landing detachments sent towards Niemilautta cape from Teikari managed to capture only Koivusaari island, while the Germans repulsed other landing attempts. After 9 July, the 59th Army ceased offensive operations in the archipelago. The 224th and 124th Rifle Divisions sustained heavy losses and were thus unable to continue attacks, with the Vyborg bay front stabilizing until the end of the Continuation War on 4 September.\nIn the battle of Vyborg Bay, the 224th Rifle Division lost 2,623 men, more than half its troops, between 30 June and 9 July, including 1,280 killed, 1,167 wounded and 176 missing. The losses of the 124th Rifle Division in the battle were roughly 500 men.\nAftermath\nIn costly battles the 124th and 224th Rifle Divisions of the Soviet 59th Army managed to capture the islands dominating Vyborg Bay, but failed to gain a bridgehead on the northern shore of the bay. With both the initial attempt at Tali-Ihantala and the crossing at Vyborg Bay blocked, the Leningrad Front turned its attention to the still undecided battles raging in the Äyräpää-Vuosalmi region.\nReferences\nBibliography\n*\n*\n*"
    }
  ]
}