{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Coilsfield\n\nThe Battle of Coilsfield was a legendary conflict associated with the vicinity of Coilsfield and Coylton near Tarbolton and Ayr in South Ayrshire, Scotland. According to antiquarian and traditional accounts of the past few centuries, the conflict took place between an allied force of Picts and Scots under Fergus I and an army of Britons led by 'Coilus', who in the context of the legend is identified with Coel Hen of the northern British Welsh genealogies rather than the earlier second century mythical British King Coilus. The authenticity of the battle and its associations have little credibility, especially owing to evidence of deliberate conflation with Ayrshire in the mid-17th century by the Dutch cartographer Joan Blaeu or his textual editor Sir John Scot, Lord Scotstarvit. The site is associated with the legendary grave of King Coil near Coilsfield Mains at NS 44699 26247.\nTraditional Narrative\nThe popular traditional narrative states that the Britons had invaded Ayrshire in response to an uprising and established a substantial camp on or near the banks of the River Doon, south of the town of Ayr. Fergus allowed the Britons to languish in their camp well into winter, so as to exhaust their supplies and whittle down their numbers through disease and desertion. Taking advantage of a drunken Yule-tide revelry in the camp, the Picts and Scots attacked at night during the first watch. The camp, which according to Vegetius had no ramparts or palisade, was successfully overrun. The army of Coilus fled the Doon-side camp in complete panic. After a circuitous retreat south around the 'Craigs of Kyle', over the flooded 'Water of Coyle' at a place remembered as 'the King's Steps' and back again northwards. Fergus cornered the remaining foes west of the hamlet of Failford, and slaughtered Coilus and his men at the place now called Coilsfield. The few survivors rallied around the remnants of the baggage train, and after a brief truce the following day, Fergus wisely allowed them to depart.\nPlace-names in the area associated with this legend or at least inspired by it, include 'Dead-mens Holm', 'The Bloody Burn', 'Fergus-lea', 'Cairn-gillan Hill', 'Shackle Hill', and 'King Coil's Grave'.\nHistoriography\nThe legend, as provided in the popular literary narrative, is given little attention in mainstream Scottish historiography where it regarded as mostly fictitious, principally because it is only known from relatively recent and low quality source material, the main one being popular literature. This issue was already apparent to relatively naïve Georgian writers, who commented in or before the 1840s that \"it is very certain that the date assigned to [Coil's] existence, being so long antecedent to the dawn of genuine history in our island, must be fabulous; but we are disposed to pause before dismissing him altogether from the page of history\".\nCritically, all the key historical works dealing with Ayrshire, including important early works, make no mention of the tradition, which is unlikely for such an important association had it been genuinely known and regarded as true. No Medieval literature records such an event at or near Coilsfield, and evidence in the tradition itself points to its fabrication by later actors unaware of key aspects of Scottish and Roman history. This includes the suggestion of a British invasion in an area that was already a British territory, and a mention of a Scottish state (Scots) many centuries before such existed. A main early inspiration for the popular traditions is a short version provided by the Dutch cartographer Joan Blaeu, whose 1654 Atlas novus included published refinements of the maps surveys of Timothy Pont, as well as literary accompaniments by Bleau himself and his editors. This publication talks of Coilsfield on the following terms -\n\"The Sheriffdom of Ayr embraces in its midst Kyle, named from Coil, King of the Britons, whom Fergus, first King of the Scots, defeated in a severe battle and killed there in 325 B.C. Several monuments of this famous victory are even now in existence. The plain in which it was fought retains the King’s name; and not far off the church of Coylton; the River Kyle, which flows into the Ayr about four miles above the market-town, quite a famous name for the river; there is also in the vicinity Fergus Loch, near which the Scots pitched camp, and finally it was by the good fortune of that battle, that the Scots offered the kingship to Fergus [...] On the field of battle a curved trumpet, resembling a horn in shape and extremely melodious, was dug up many years later; it is used by the lairds of Caprington, whose principal seat in that region is called Field of Coil, in the vernacular Coilfield, to summon their tenants and workers\".\nIt is probable from the self-apparent contents of the text, and the analysis of the same by Ian Cunningham, that Blaeu's source of this content was Buchanan's History of Scotland published in 1582, which provides a bearer version of the later popular literary legend, albeit stripped of modern place-names and other familiar associations. It includes important identification points such as 'in this battle Coilus himself fell, with the greater part of his army, and made the place in which it was fought famous, from his name'.\nHowever, Buchanan made no reference to Ayrshire, Coilsfield, or any other local associations. The text does state that the locus of the event was the river Don, but this could well represent several watercourses called Don in Scotland, such as the River Don, Aberdeenshire, and there is nothing in the text to imply it represents the River Doon in Ayrshire. As Joan Blaeu's atlas is the first proven example in print of this narrative being applied to Ayrshire, long before other printed legends appear, then it may represent the progenitor of the folklore that developed in Ayrshire on this subject over the next few centuries.\nKing Coil's Grave & Place-names\nThe site identified as King Coil's Grave was partly excavated and was dated using morphological and typological approaches. It was dated as prehistoric, likely with Bronze-age origins as a burial mound, but with no evidence of possible later use. A cist containing a food vessel filled with burnt bones was found when digging a gravel pit at Coilsfield. The cover-stone, which measured about 5ft by 2 1/2 ft was sculptured with cup and ring marks, spirals etc, thus further indicating its period of origins.\nThe tradition that this is the burial site of Coel Hen does not appear in the oldest known material of Buchanan concerning the River Don area, nor explicitly in Bleau's reference which only goes as far to say 'several monuments of this famous victory are even now in existence'. Written descriptions became much more detailed during the later Georgian and Victorian eras. The eminent Professor John Wilson (Scottish writer), alias Christopher North, noted that - \"a circular mound, enclosed by a hedge, and planted with oak and other trees: on the top of this eminence, in its centre, are two large stones, masses of basalt, which, according to tradition, mark the spot where the remains of 'old king Coil' were deposited\".\nRobert Burns' poem The Vision written in an earlier period also probably alluded to the traditions surrounding this mound -\n\"There where a sceptred Pictish shade,\nStalk'd round his ashed lowly laid,\nI marked a martial race portray'd,\nIn colours strong ;\nBold, soldier-featured, undismay'd,\nThey strode along. \"\nBurns made frequent references to Coila as a poetic embodiment, a pseudo-female goddess or Coila (muse) of the territory of Kyle, quite detached from the Kingly origins of the legend.\nReferring to the analysis of the grave finds that point to a prehistoric origin, some may argue that other archaeological evidence supports the possibility that a battle of some form did take place nearby. In the New Statistical Account of the parish of Tarbolton, 1842, the author noted that an old man remembered that his father spoke of the discovery of 'pieces of ancient armour and fragments of bones when ploughing the 'dead men's home [holm]'. These artifacts are not known to survive. Regardless of the veracity of this claim, the author of the Statistical Account also spuriously claimed that the early historical accounts, such as Buchanan, placed the battle in Carrick near the Doon. He also sought to summarise the available evidence, some discussed above, and in doing so sought to reconcile the provenance issues with an early-seventeenth century metrical extract that includes the lines:\n\"The country people fra thenceforth does it call\nCoylsfield in Kyle as ever more it shall.\"\nAccording to William Robertson writing some decades later, who provides a fuller version of this rhyme, it was authored by a John Bonar, a schoolmaster in Ayr about the year 1631. Predating the Bleau Atlas, and evidently using language appropriate for the early 17th century, Robertson claimed that this was evidence of a continued tradition in the area, and that it favoured a conclusion that Coil was not only a real king but also met his death in battle in the local area. He admitted that doubters would demand more tangible proof. This lack of corroboration was easy to justify in his view because it concerned an age of which no surviving literature survives for Ayrshire. An issue with this evidence is that the original is not known to survive, and there may be doubt over the dating of 1631.\nThe fuller version of the relevant verses is contained in a footnote in the said Statistical Account, and was said to be derived from a manuscript volume of poems and miscellaneous pieces written around the year 1631, and in the possession of David Constable, Advocate. The verses are as follows:\n\"The britones marchet, tuo dayes before the feild\nTo Marrok's mote, for easement and for beild;\nAfore the night they waughtet liquor fyne,\nLyke filthie beasts lying like drunken swine.\nQuhen fergus heare they wer in sutch a pley,\nDoune fra Craigsbian he came right suddenly,\nAnd tooke his will upon his traitrous foes,\nQuhair thousands lay skatteret like windlestroes.\nCoylus he fledd unto the river Doune,\nQuher drownet were many yt thair did runn,\nAnd northward held, quhil they cam till a muir.\nAnd thair wes stayet be Scots that on him fuir.\nFergus he followet and came right heastilie,\nQuhair Coyll wes killet and all his hole armie;\nThe cuntry people fra thenseforthe does it call\nCoylsfield in Kyll, as ever more it sall.\nWithin twelve years, or litle mor's I guess,\nA trew story ane ditcher told me these;\nTirring the earth for fewell to his flett,\nHis spead did run upon ane stane bot lett,\nQuhilk, quhen he hade espyet earnestlie,\nA tomb it wes buildet full curiouslye;\nHe roll'd awaye, and fund a pitcher law\nWith ashes, and bones, that all men might it knaw,\nUpon the stone wer graven letters fayre,\nKoyl's cij-p of this as now 1 speak no more...\"\nThe manuscript is not known to have survived, although a commonplace book by the same author is preserved in New Zealand and was compiled in the period c. 1649-72.\nAll place-names, if truly associated with the event, are clearly recent Scots constructions which probably owe to inspiration from the recent folklore rather than any seed of historical fact. Nonetheless, a comparatively uncritical perspective on the matter of place-name studies in the Victorian era is evinced in the same Professor Wilson's analysis. He used the local battle-themed place-names and kingly associations to lend authenticity to the tradition of the mound, thus - \"with the name of the man thus so fixed on the locality, and so many traces of the sanguinary battle in which he is said to have fallen,-with topography thus giving her voice so loudly in support of history, - it could never have appeared to us reasonable altogether to disbelieve the traditionary tale of Coil\".\nWilson went further to take note of the accounts of the battle provided by 'the early unscrupulous historians of Scotland' - surely a reference to Buchanan - and the observations of Bleau, and instead of noting the lack of an Ayrshire context, instead implies that these authors pointed to Ayrshire's Loch Fergus as a commemoration of one of the key protagonists of the tradition. In reality, only Bleau makes such a suggestion, whereas Buchanan in the sixteenth century only noted Carrickfergus in Ireland. Similar if comparatively crude summaries also appeared in the works of Robert Chambers (publisher, born 1802) and Orr's The land we live in. The latter notes many of the same place-name associations and wider contemplation of the toponym Kyle, Ayrshire as being possibly derived from Coel.\nWith such eminent attention paid by Wilson as an editor of Robert Burns' works, and Robert Chambers, it led later popular authors printing in Ayrshire to clutch at such associations as ready confirmation of the tradition. Macintosh in his 1894 work Ayrshire Nights' Entertainments, for example, simply stated that 'antiquarian research confirms' the traditions as a nod to these and other earlier works.\nOther contributions in this period included popular descriptions of the origin of the song Old King Cole that sought to contextualise the association with Coel Hen with the events alleged in Ayrshire. James Paterson in his Ballads and Songs of Ayshire included the excavation report of the alleged King Coill's Grave. This source, which reached a popular instead of antiquarian audience, conflated the notice by Hector Boece of Ayrshire's 'Kyle' being derived from 'Coyll', with Buchanan's statements about a battle near the River Don. In doing so it furthered the older suggestion in Bleau's Atlas, without evidence, that Ayrshire's Coilsfield was where the legendary battle took place.\nA sense of authenticity over the tradition may have developed before the main period of antiquarian and literary interest so described in the 1800s. In addition to the early notices of Bleau in 1654, the local Ayrshire lairds, who may themselves have possessed copies of Bleau's Atlas, could have embellished or perpetuated the tradition based on the findings on their own lands.\nBlaeu did not in his 1654 account that \"On the field of battle a curved trumpet, resembling a horn in shape and extremely melodious, was dug up many years later; it is used by the lairds of Caprington, whose principal seat in that region is called Field of Coil, in the vernacular Coilfield, to summon their tenants and workers\". James Boswell, the diarist and pioneering biographer associated with the nearby Auchinleck Estate, wrote the following sidenote on the subject of sounding horns in his Account of Corsica published in 1768 -\n\"Sir John Cuningham of Caprinton has shewn me a Lituus in his possession, of which mention is made in Bleau's Atlas [p.71]. It was dug up in an ancient field of battle at Coilsfield in Ayrshire, and served the old barons of Caprinton to call together their followers\". The wider reception of eminent and up to date observations by Boswell may have furthered public interest, especially in wider national circles without ready access to copies of Blaeu 1654.\nR. W. Cochran-Patrick attempted to approach the horn matter with a critical eye in his 1878 paper to the Ayrshire and Galloway Archaeological Association, but he was limited to the extent he only hinted at some similarity to early Irish (Celtic) examples, and that such horns were very rare in Britain. He provided the measurements as 25 inches in length, a circumference of 1 inch at the mouthpiece, and almost 8 inches at its opening sound-expelling end\".\nVegetius\nThe significant development of the legend in the 1800s includes the addition of several fallacious associations. For example, Vegetius never wrote about Ayrshire, particular battles, or any Northern British material. He simply authored a treatise to Roman Army practices and conduct, namely De re militari. The Scots and the 'Fergus I' figure alluded to were not an entity or a figure that existed in the time of Coel Hen. Indeed, Fergus is a mythical king, and if he existed then his association with Ayrshire is unlikely because it was a British territory in that period rather than an invaded one. On the whole, the narrative of the Battle of Coilsfield belies a sound understanding of Scottish history.\nThe name Coilsfield\nThat the name 'Coilsfield' may truly derive from an association with Coel Hen or another figure is plausible. Indeed the contemporary or close contemporary praise poetry in the old Welsh languages does place the kindred of Coel Hen in this region. This seems to be as far as any potential true link goes because of the dearth of authentic Early Medieval records dealing with this part of Scotland.\nAlthough some early historical seed of truth may have influenced the creation of Early Modern traditions, there is little in the way of evidence to this effect. Equally, any true origins may not have any similarity to the later legend first documented in the 1600s by Bleau and allegedly by John Bonar. Thus, the Battle of Coilsfield may be entirely fabricated or may have origins in some true event. The author James Paterson, in his key 1847 work on the History of the County of Ayr, does tread much of the same ground and uses the same reverse reasoning that affects the other literature, but he also provides a reference to the 1594 writings of the Scottish Isles chronicler Donald Monro (priest), who himself cites Irish chronicles on the subject of the Isle of Iona and the Ayrshire associations -\n\"Upon the north syde (Colmkill) of our Scots tombe, the inscriptione bears Tumulus Regum Norwegiae; that is, the tomb of the Kings of Norroway; in the quhilk tombe, as we find in our ancient Erische Cronickells, ther layes eight Kings of Norroway; and als we find, in our Erische Cronickells, that Coelus King of Norroway commandit his nobils to take his bodey and burey it in Colmkill, if it chancit him to die in the Isles; bot he was so discomfitit, that there remained not so maney of his armey as wald burey him there; therefor he wes eirded in Kyle, after he stroke ane field against the Scotts, and [was] vanquished be them.\"\nThe veracity of his reference to alleged Irish chronicles may require checking to determine if such an account exists. As Paterson notes, the period of Norwegian involvement in Scotland is relatively late in the 8th-9th centuries onwards, and that such a reference was missing from most key early Scottish histories. He also observed that the chances of this giving rise to the name of Coilsholm but not to that of the older Kyle, seemed unlikely. Therefore, he concluded that any true association with any Coel or Coilus must be much older, and he implied that the account of Monro or his sources were spurious. Importantly, the late-1500s date may point to an example of folk etymology of Coilsfield which predates the example found in Blaeu's atlas of the mid-17th century.\nSummary\nThe purported Battle of Coilsfield, set near Coylton in Ayrshire, rests on scant historical evidence and likely misinterpretation, some of which may be intentionally fabricated. The legend, originating more from Early Modern folklore and first robustly documented by Blaeu in 1654, lacks support in any early Scottish records where such evidence is expected to be recorded. No medieval sources corroborate such a battle in Ayrshire. Place names like 'Dead-mens Holm' and 'King Coil's Grave' appear to stem linguistically from local tradition after the fact of the folklore rather than authentic history. Similar early attempts at folk etymology of the Ayrshire site may be evinced in the account by Donald Munro (priest). Critical reasoning flaws, including confirmation bias and some antilogic, permeate the analyses, as later historians projected assumed evidence backwards, selectively citing place-names and moulding unsupported literary sources to fit a narrative. The earliest pseudo-historical account by Buchanan ambiguously placed the event by a 'river Don,' possibly the one in Aberdeenshire where a British incursion into Scots and Pictish territory is truly tenable. There are no clear ties to Ayrshire. Therefore, the narrative of a 'Battle of Coel Hen]' at Coilsfield is unsubstantiated, and is likely a fabrication inspired by place-name folklore and Victorian antiquarian enthusiasm. Contrary to this, the possible etymological derivations of 'Kyle' and 'Coilsfield', as well as an alleged discovery of bones and armour, may provide a different set of evidence that suggests a link with Coel Hen. The more familiar popular versions of the tradition represent variations of a form published in the late nineteenth century, such as that intended for mass entertainment in the work ''Ayrshire Nights' Entertainments''.\nReferences\nExternal links\n*[https://www.youtube.com/my_videos?o=U Video footage of the King's Steps]\n*[https://commons.wikimedia.org/wiki/File:The_King%27s_Steps,_Water_of_Coyle,_Drongan,_Ayrshire,_Scotland._Old_stepping_stones_site.jpg]"
    }
  ]
}