{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Gayaza Hills\n\n| caption     =\n| date        = 21 or 23 February 1979\n| place       = near Gayaza, Uganda\n| result      = Tanzanian victory\n| territory   = Gayaza Hills captured by Tanzanian forces\n| combatant1  =\n| combatant2  =\n| commander1  = Silas MayungaN. D. Nshimani\n| commander2  = Yorokamu Tizihwayo\n| units1      = 206th Brigade\n*20th Battalion\n| units2      = 2nd Paratrooper Battalion\n| strength1   = 1 brigade\n| strength2   = Unknown\n| casualties1 = 24 killed2 tanks damaged\n| casualties2 = Unknown\n| campaignbox =\n}}\nThe Battle of Gayaza Hills or the Battle of Kajurungusi (Kiswahili: Mapigano ya Kajurungusi) was a conflict of the Uganda–Tanzania War that took place in late February 1979 around the Gayaza Hills and Lake Nakivale in southern Uganda, near the town of Gayaza. Tanzanian troops attacked the Ugandan positions in the hills, and though suffering heavy casualties in an ambush, they successfully captured the area by the end of the day.\nColonel Idi Amin had seized power in a military coup in Uganda in 1971 and established a repressive dictatorship. Seven years later he attempted to invade Tanzania to the south. Ugandan troops occupied the Kagera Salient and subsequently murdered local civilians and destroyed property. The attack was eventually repulsed, and Tanzanian President Julius Nyerere, unsatisfied with Amin's refusal to renounce his claims to Tanzanian territory and the international community's failure to strongly condemn the invasion, ordered his forces to advance into southern Uganda with the aim of capturing the towns of Masaka and Mbarara.\nBetween Mbarara and the Tanzanian border were the Gayaza Hills, which overlooked Lake Nakivale. Retreating Ugandan troops occupied them, and on 21 or 23 February 1979 the Tanzanian 206th Brigade attacked their positions. The fighting was fierce, and 24 Tanzanian soldiers were killed when Ugandan troops ambushed a battalion at Kajurungusi that was trying to pursue them. By the end of the day the Tanzanians outflanked the Ugandans and secured the hills. The Tanzanians captured Mbarara on 25 February. The ambush remained one of the few military operations well-executed by the Uganda Army during the entire war, while the casualties the Tanzanians suffered represented their largest loss in a single engagement.\nBackground\nIn 1971 Colonel Idi Amin launched a military coup that overthrew the President of Uganda, Milton Obote, precipitating a deterioration of relations with the neighbouring state of Tanzania. Amin installed himself as president and ruled the country under a repressive dictatorship. In October 1978 he launched an invasion of Tanzania. On 1 November he announced the annexation of the Kagera Salient, an 1800 square kilometre (720 square mile) strip of land between the Ugandan border and the Kagera River. Uganda Army troops subsequently pillaged the area they occupied, murdering civilians, stealing cattle, and destroying property, triggering the flight of 40,000 inhabitants southward. Tanzania eventually halted the assault, mobilised anti-Amin opposition groups, and launched a counter-offensive. In January 1979 the Tanzania People's Defence Force (TPDF) seized the Ugandan border town of Mutukula to counter any further threats to Kagera. Though many international actors were sympathetic with the Tanzanian position, numerous African states and the Organisation of African Unity (OAU) strongly encouraged Tanzanian President Julius Nyerere to exercise restraint and not act beyond defending his territory. He had originally not intended to expand the war, but with Amin refusing to renounce his claims to Tanzanian territory and the OAU's criticism of the Kagera invasion being muted, he decided that Tanzanian forces should occupy southern Uganda—specifically the two major towns of Masaka and Mbarara.\nPrelude\nand Mbarara]]\nThe Tanzanians began careful planning for an offensive on the two towns. Major General David Musuguri was appointed commander of the TPDF's 20th Division and tasked with overseeing the advance into Uganda. The TPDF assigned the 201st, the 207th, and the 208th Brigades to attack Masaka, while the 206th Brigade led by Brigadier Silas Mayunga was instructed to move on Mbarara. The TPDF began its advance in mid February. Whereas the Tanzanian forces fighting towards Masaka enjoyed considerable success—particularly at the Battle of Simba Hills—the 206th Brigade struggled in its advance along twisting roads through rough, hilly terrain. The situation was further complicated by the fact that some Ugandan troops were fleeing away from the front lines to Mbarara while reinforcements were being deployed from Mbarara towards the Tanzanian border. Small pockets of resistance delayed the Tanzanians and put their advance behind schedule. At a village called Ishozi, the 206th Brigade's 2nd Battalion encountered the Ugandan 2nd Paratrooper Battalion. In this clash, the Tanzanians were partially dispersed, but destroyed several vehicles of the Uganda Army contingent.\nApproximately 45 kilometres (28 miles) from the border and south of Mbarara was the town of Gayaza. Near the town were the hills of Busaga, Kibingo and Gayaza—collectively known as the Gayaza Hills—which overlooked Lake Nakivale. On 20 February the 206th Brigade, bolstered by a group of Ugandan rebels, occupied the villages of Murema, Kasese and Kigaragara. Ugandan forces retreated from the area and took up position in the Gayaza Hills.\nBattle\nOn 21 or 23 February the TPDF's 206th Brigade attacked the Gayaza Hills. The fighting was fierce, and near Gayaza town Ugandan troops struck two Tanzanian tanks with rockets. The Ugandans retreated, but they were pursued by the 20th Battalion, led by Lieutenant Colonel N. D. Nshimani. Close to Lake Nakivale, the road crossed rougher terrain and the Ugandan 2nd Paratrooper Battalion entrenched themselves and set-up an ambush under the leadership of Yorokamu Tizihwayo at Kajurungusi, which lay west of the lake. Fearful that he may have been leading his men into a trap, Nshimani paused before a bend in the road to ask an old man if he had seen any Ugandan soldiers nearby. The man was working with the Ugandans and thus lied to Nshimani, telling him that all the Ugandan troops had retreated from the area.\nOnce the 20th Battalion rounded the bend, the Ugandan troops opened fire with machine guns from three positions of attack. Some of the Tanzanian soldiers scattered and fled into the bush, where they were lost for three days. For most of the rest of the day the remainder of the battalion held its position, exchanging fire while two other Tanzanian battalions sent by Mayunga moved to outflank the Ugandans. The fighting was intense, and at some points soldiers resorted to hand-to-hand combat, while the Tanzanians brought up tanks to reinforce their position. Once the Tanzanians' flanking manoeuvre was achieved the two battalions were able to put enough pressure on the Ugandans to allow Nshimani to withdraw his men to higher ground. A total of 24 Tanzanians were killed in the ambush.}} The Tanzanians secured Gayaza Hills at the end of the day and the surviving Ugandan soldiers fled.\nAftermath\nThe ambush was one of the few military operations skillfully carried out by the Uganda Army during the entire war. The casualties the Tanzanians suffered in the battle were the largest they lost in a single engagement over the course of the conflict. The Tanzanian soldiers who survived the ambush were dubbed the \"Red Army\" by their comrades in recognition of their intense combat experience. In the battle's aftermath the TPDF slowed its advance on Masaka and Mbarara, engaging groups of Ugandan soldiers along the way. Regardless, the capture of Gayaza Hills gave the 206th Brigade a position from which to strike Mbarara with artillery. On 24 February the TPDF captured Masaka. On 25 February the 206th Brigade and several dozen Ugandan rebels bombarded Mbarara. The Uganda Army garrison retreated and the Tanzanians and rebels seized it.\nNyerere originally planned to halt his forces in southern Uganda and allow the Ugandan rebels to attack Kampala and overthrow Amin, as he feared that scenes of Tanzanian troops occupying the city would reflect poorly on his country's image abroad. However, Ugandan rebel forces did not have the strength to defeat Libyan troops sent to Amin's aid, so Nyerere decided to use the TPDF to take Kampala. The city fell on 11 April. Combat operations in Uganda continued until 3June, when Tanzanian forces reached the Sudanese border and eliminated the last resistance. After a brief occupation, the TPDF withdrew from the country in 1981.\nNotes\nCitations\nReferences\n*\n*\n*\n*\n*\n*"
    }
  ]
}