{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Drenogllava\n\nThe Battle of Drenogllava (), also known as the Battle of Karadak (), was a battle between Albanian rebels led by Idriz Seferi and Isa Boletini and Ottoman forces during the Revolt of 1910. The clashes represented an attempt by the Ottomans to break the Albanian rebels in the region.\nBackground\nAfter the losses in the Battles of Kaçanik and Carraleva, during the Albanian revolt of 1910, Albanian rebels such as Idriz Seferi, Abaz Bekteshi, Islam Pra, Sinan Maxhera etc. withdrew to the mountains of Karadak and organized small military formations (Chetas). These formations inflicted significant damage on the Ottoman forces in Karadak, using captured weapons and limited ammunition to conduct surprise attacks on difficult and unfamiliar terrain, the Ottomans lost over 2,000 men in Karadak alone. In 1910, the Albanian insurgents would barricade themselves in Drenogllava. They chose Drenogllava for several strategic reasons: the Ottomans were unfamiliar with the rugged mountainous terrain, the landscape hindered a full-scale Ottoman assault, and the insurgents could retreat safely if necessary. The insurgent leaders, including Idriz Seferi, called for the supply of arms and provisions for at least 4-5 days.\nBattle\nOn March 2, 1910, Osman Pasha assembled the Ottoman army consisting of around 15,000 men, detailing their tasks. Around 3,000 troops under Feyza Bey were to march from Preševo towards Karadak, while another group from Skopje approached Drenogllava under Sahid Bey. Osman Pasha himself led 6,000 troops from the Morava Valley. Idriz Seferi and Isa Boletini mobilized quickly to counter the Ottoman advance. The initial skirmishes took place in the mountains to the south of the village of Smirë, at locations such as Kodra e Shati, Livadhi i Isufit, Udha e Quqe, and Ara e Hana. In these areas, the contingent under Fejza Bey from Preševo had been repulsed, and hundreds of Turkish soldiers were killed, while 120 were captured and imprisoned in the mosque of Smirë. The second engagement took place in the village of Korbliq on 27 April. Two columns under Sahid Bey, coming from Skopje, were attacked by the insurgents and swiftly destroyed. The victory over Sahid Bey's forces would later determine the outcome of the battle. On May 5, 1910, the first Ottoman column, led by Sadedin Bey, approached Drenogllava. Albanian fighters, under Halim Begunca, diverted this column into an ambush. The surprise attack and difficult terrain resulted in significant Ottoman casualties. Despite their numerical superiority, the Ottoman forces were overwhelmed by the guerrilla tactics of the Albanian insurgents. Osman Pasha attempted to encircle the ambushing insurgents, but failed after his forces were split into three, each surrounded by Albanian rebels. After hours of fighting the Ottoman troops were broken and forced to withdraw.\nLegacy\nThe battle became known as the second bloodiest conflict between Albanian rebels and Ottoman troops in the Kosovo Vilayet, following the Battle of Kaçanik during the Albanian Revolt of 1910. Turkish historian Süleyman Külçe, claimed that the Ottomans lost 8 officers and 113 soldiers, and that Albanians had around 500 killed. However, the Serbian consulate in Skopje concluded that over 2,000 Ottoman soldiers had been killed in Karadak and the Kaza of Gjilan after the Battle of Kaçanik.\nReferences\nSources"
    }
  ]
}