{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Piotrków Trybunalski__disambig_1\n\n| combatant2        =\n| commander1        =  Stefan Dąb-Biernacki Wiktor Thommée\n| commander2        =  Erich Hoepner\n| units1            =  Army Łódź:\n* 2nd Legions' Infantry Regiment\n* 2nd Tank Battalion\n* Wołyńska Cavalry Brigade\nArmy Prusy:\n* 19th Infantry Division\n* 29th Infantry Division\n* Wileńska Cavalry Brigade\n| units2            =  XVI Panzer Corps:\n* 4th Panzer Division\n* 1st Panzer Division\n* 31st Infantry Division\n* 14th Infantry Division|\n| strength1         =\n| strength2         =\n| casualties1       = 2 tanks, two battalions of the 19th infantry division lost 80% of their personnel.\n| casualties2       = 17 Panzers, 2 self propelled guns, 14 armoured cars\n}}\nThe Battle of Piotrków Trybunalski was a battle in the German Invasion of Poland from 4 to 6 September 1939, which involved Polish and German tank formations.\nOpposing forces\nPolish Army\nThe core of the Polish force consisted of most of the Prusy Army's Northern Group. The army, created as the main operational reserve of Polish commander in chief Marshall Edward Rydz-Śmigły, was also the last to be mobilised in the summer of 1939. Intended as a reserve of Łódź Army and Kraków Army, the Prusy Army was to support its neighbours and relieve them once the main German attacks were slowed. However, the Battle of the Border did not gain the Poles enough time to fully mobilise the reserves.\nWhile most of Polish Army had been successfully mobilised prior to 1 September 1939, many sub-units of Prusy Army were still being formed or transported. By 4 September 1939, when the German forces broke through the overstretched Polish defences, the Prusy army was far from battle-ready. Its Northern Group at that date consisted of 29th Infantry Division and Wileńska Cavalry Brigade, with 19th Infantry Division still being formed in the forests to the north-east of Piotrków Trybunalski while the 13th Infantry Division was still waiting for some of its sub-units near the railway hub of Koluszki and did not become available until 6 September. The army was strengthened by a mobile reserve formed by the 1st Light Tank Battalion (armed with modern 7TP tanks) stationed between Opoczno and Końskie, and the 81st Motorised Sappers Battalion.\nApart from units of the Prusy Army, the Polish side also included a number of smaller units from Łódź Army. In the city of Piotrków Trybunalski itself the 146th Infantry Regiment was being mobilised for the 44th Reserve Infantry Division and was dispatched to the front as part of an improvised battle group under Col. Ludwik Czyżewski. In addition, 2nd Light Tank Battalion including elements of the Wołyńska Cavalry Brigade and the 2nd Legions' Infantry Regiment of the 2nd Legions Infantry Division also took part in the battle as part of Col. Czyżewski's group.\nWehrmacht\nThe German force fighting in the battle consisted of the entire XVI Panzer Corps. The unit, part of German 10th Army, was the strongest Panzer corps in the Wehrmacht and on 1 September 1939 included between 616 and 650 tanks of all types (the entire Polish Army had 313 proper tanks altogether, not including reconnaissance tankettes). The XVI Corps included the 1st and 4th Panzer Divisions as well as the 14th and 31st Infantry Divisions.\nBattle\nOn the morning of 4 September, Hoepner’s XVI Panzer Corps reached Rozprza, just 12km south of Piotrków.  It was a defensive position of the \"Lodz\" army under command of general Thommee, defended by an improvised infantry battalion without anti-tank weapons, supported by two artillery pieces. The Germans managed to throw off the defenders and build bridges across the river. In the afternoon a Polish 2nd tank battalion was sent to counterattack but withdrew under artillery fire. In the evening Thomme decided to make another counterattack the next day using the 2nd tank battalion and an infantry battalion from Wolynska Cavalry Brigade. At the same time, Hopener decided to regroup his 1st and 4th panzer divisions, and attack Piotrków next day using the captured bridgeheads. The city was defended by 19th infantry division from \"Prusy\" army. In addition, there was a Wilenska Cavalry Brigade and 29th infantry division nearby, which Biernacki intended to use for a night attack on the armored troops attacking Piotrków. Permission for this attack was given at night and the attack was scheduled for the night of 5/6 September.\nAt dawn on 5 September, Hoepner moved north and at 10 a.m. 1st panzer division attacked Piotrków. This was a surprise to Biernacki who thought that Rozprza was still defended by the \"Lodz\" army. The attack was repelled with the participation of 2nd tank battalion which counterattacked on the flank. However, the Polish tanks soon began to retreat due to the numerical superiority of the Germans. Hoepner collected more forces and after a strong artillery fire at 2 p.m. the second attack on the city began. This time, the Polish defensive line was pierced and german tanks began to pour through. The two battalions of the 19 infantry division were decimated, having lost more than 80 percent of their personnel and equipment. The Germans occupied the city by evening.  At the same time, Biernacki, unaware of the loss of the city due to missing reports, continued to prepare for a night attack. However, 19th division was badly battered and Wilenska Cavalry Brigade began to retreat to the northeast. Only 29th division continued the advance by marching into the fighting area. At midnight the Biernacki realized the situation and ordered to recapture the city with the forces of 29th infantry division and four battalions from 19th infantry division that had not yet taken part in the fighting. The attack, however, was not carried out and the troops withdrew to the north. 29th division lost two infantry battalions already fighting near Piotrków, which did not receive new orders.\nSee also\n* List of World War II military equipment of Poland\n* List of German military equipment of World War II\nReferences"
    }
  ]
}