{
  "content": [
    {
      "type": "text",
      "text": "# Battle of the Aous (274 BC)\n\nThe Battle of the Aous was fought in 274 BC between the invading Epirote army of Pyrrhus of Epirus and the army of Antigonus II Gonatas of Macedon near the Aous (or Aoös, Greek Αώος, modern Vjosa) river.\nIn 275 BC Pyrrhus retreated from Italy and returned to Epirus. He came with a large army but had little money left to pay them. Pyrrhus planned a campaign into Macedonia for the next year with 8,000 infantry and 500 cavalry to which he added Gallic mercenaries. The expedition originally planned as a limited raid turned into a full-scale invasion when Pyrrhus met with more success than he expected. Pyrrhus captured a number of Macedonian towns and over 2,000 Macedonian soldiers had switched sides and joined the Epirote ranks.\nWhile Pyrrhus was fighting in Italy, Antigonus had recovered the throne of Macedon in 277 BC, and he benefited from Pyrrhus' absence to secure his hold over Macedon.\nAntigonus marched against the invaders and met them in battle in a narrow gorge near the Aous River. Pyrrhus' attack threw the Macedonian army into disorder. He began by destroying Antigonus' rearguard and after a hard fight with the Gauls guarding the Macedonian elephants they surrendered themselves and the elephants. He attacked the Macedonian phalanx. Demoralized by the loss of the elephants, the Macedonians agreed to Pyrrhus' offer to switch sides. Antigonus escaped by concealing his identity. Pyrrhus now took control of upper Macedonia and Thessaly while Antigonus held onto the coastal towns.\nBut Pyrrhus now wasted his victory. Taking possession of Aegae, the ancient capital of Macedonia, he installed a garrison of Gauls, who greatly offended the Macedonians by digging up the tombs of their kings and leaving the bones scattered about as they searched for gold. He also neglected to finish off his enemy. Leaving him in control of the coastal cities, he contented himself with insults. He called Antigonus a shameless man for still wearing the purple, but he did little to destroy the remnants of his power.\nNotes\nReferences\n*"
    }
  ]
}