{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Kismayo (2012)\n\n)\n| image             = Kismayo.jpg\n| image_size        = 300\n| caption           = Overview of Kismayo\n| place             = Kismayo, Somalia\n| result            = Kenyan-Somali victory\n*Al-Shabab withdraws from Kismayo on 29 September\n*Kenyan and Raskamboni forces capture city on 1 October\n| combatant1        =  Al-Shabaab\n| combatant2        =\n* Kenya Defence Forces\nRaskamboni movement\nAlleged:\nUnited States\n| commander1        =  Sheikh Mohamed Abu-Fatma\n| commander2        =\n* Brigadier General Anthony Ngere\n* Lt. Col. Hassan\n| strength1         =\n| strength2         =\n| casualties1       = 118 dead, 60 injured\n| casualties2       =\n| casualties3       = 1 killed; 3 wounded civilians\n}}\nThe Battle of Kismayo was an offensive led by the Kenya Defence Forces, under the codename Operation Sledge Hammer, to seize the port city of Kismayo, Somalia, from Al-Shabaab from 28 September 2012. Members of the Raskamboni movement militia were part of the amphibious force.\nBackground\nIn August 2008, Al-Shabaab and Islamic Courts Union fighters captured the southern port city of Kismayo during the first battle of Kismayo. A town with a large ethnic minority constituency Kismayo became the Islamist group's strategic headquarters after Transitional Federal Government (TFG) forces and allied African Union troops expelled the militants from Mogadishu during the Battle of Mogadishu (2010–2011). Control of the harbor, among other things, allowed the insurgents to import weapons and supplies.\nIn October 2011, the Kenya Defence Forces entered southern Somalia to fight Al-Shabaab, under the codename Operation Linda Nchi. Officially, the offensive was led by Somalis, with the Kenyan forces in support. In early June 2012, Kenyan forces were formally integrated into AMISOM.\nIn the four weeks leading up to the battle, around 12,000 people reportedly fled the city out of an estimated total population of 160,000 to 190,000 inhabitants.\nBattle\nOn 28 September at approximately 2:00 am EAT, Kenyan Defence Forces and Somali government troops landed approximately six kilometres north of Kismayo, close to the main road to Mogadishu. Residents indicated that seven ships were involved in the operation. It was reported that KNS Nyayo, KNS Umoja, KNS Galana, KNS Shujaa and KNS Jasiri were present during the operation.\nAccording to AMISOM official Colonel Cyrus Oguna, the Somali National Army and Kenyan AU naval, air and ground forces launched a surprise attack on Kismayo, capturing the city with little resistance mounted by Al-Shabaab. The spokesman asserted that the insurgents incurred \"heavy losses\" during the offensive, whereas no allied soldiers were wounded or killed. Fighters from the Raskamboni militia also reportedly assisted the SNA and AU troops, who led the charge. Al-Shabaab's military operations spokesman Sheikh Abdiasis Abu Musab stated that \"fierce fighting\" was underway between his comrades and the Kenyan forces. Al-Shabaab also claimed to have destroyed two Kenyan armoured personnel carriers with an improvised explosive device (IED) and another one with a rocket-propelled grenade during the fighting, and denied that it had lost control over the city.\nLocal residents indicated that the allied troops had seized the port, but the militants were still present elsewhere in the town and were quickly making their way toward the frontlines in vehicles. Al-Shabaab's propaganda radio station was also still reportedly attempting to trick residents into fleeing toward the oncoming Somali government and AMISOM troops.\nOne eyewitness additionally claimed that among the Kenyan AMISOM troops, on the land side, were white soldiers. \"There have been numerous reports of US special forces operating against the Islamist militants in Somalia.\"  However, United States Africa Command denied supporting the Kenyans.\nOn 29 September, Al-Shabaab fighters officially pulled out of the town. Its HSM Press Office tweeted that \"Last night, after more than 5 years the Islamic administration in #Kismayo closed its offices.\" This was confirmed by residents who said that no armed forces were left in the city and that looters had begun to raiding administration buildings. KDF spokesperson Colonel Oguna indicated that the AMISOM forces would first consolidate their position before moving into areas of the city on 5 October that were vacated by the militants. It is unclear what Al-Shabaab will do next. However, in areas where they have been pressured to give up fixed positions, they have resorted to using hit-and-run tactics.\nAccording to an eyewitness, Somali government soldiers in armoured vehicles entered Kismayo's center on 1 October 2012, three days after allied forces had laid siege to the city's perimeter. AU troops reportedly followed suit a few hours later. The next day, huge blasts hit the city. A land mine first struck a military base, though no casualties were confirmed. The second blast detonated within the port and was apparently aimed at Somali government and AMISOM forces. However, no losses were reported. A few minutes later, a third set of explosives went off in an army base where pro-government Raskamboni militia fighters had been positioned. Somali military officials and Kenyan AMISOM officers subsequently convened at the local airport to discuss the security situation. The Somali Ministry of Defence and SNA commanders concurrently alerted the coalition forces of the possibility of further attacks and advised them to enter the city with caution, as the insurgents may have planted bombs in the bases that they had vacated.\nKismayo was regarded as Al-Shabaab's last major stronghold on account of the revenue that the group has been able to generate for itself through exporting charcoal and levying port taxes on imported goods. According to Al-Jazeera, the offensive represented a major, morale-dampening loss for the rebel group, as the militants were reportedly left with few areas from which to safely launch attacks on \"soft-targets\". Colonel Oguna indicated that capturing the city \"may signal the end of al-Shabab because Kismayo has been the bastion which has financed activities of the al-Shabab in other regions of Somalia\". So as to avoid complications as to who will administer the town after the rebels have been completely ousted, the AU spokesman added that the offensive was \"meticulously planned\". The Somali government is also reportedly preparing mediations between the city's stakeholders in order to establish an inclusive local administration.\nReferences"
    }
  ]
}