{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Zhovkva\n\n)\n| date              = 6–11 January 1919\n| combatant1        =  West Ukrainian People's Republic\n| combatant2        =  Poland\n| commander1        =  Bogusław Shashkevych Viktor Kurmanovych\n| commander2        =  Jan Romer\n| casualties1       = Unknown\n| casualties2       = Heavy combat losses;50 captured\n| image             = General UHA Viktor Kurmanovych.jpg\n| strength1         = Unknown\n| strength2         = 6,000\n| caption           = Viktor Kurmanovych who led the Ukrainian forces during the battle\n| image_size        = 200px\n| campaignbox       =\n| units1            = Ukrainian Galician Army\n*Northern group\n| units2            = Polish Military Organisation\n*Operational group \"Bug\"\n}}\nThe Battle of Zhovkva (Ukrainian: Битва під Жовквою) was a battle that took place between the Ukrainian Galician Army and the Polish army for the strategically important city of Zhovkva during the Polish–Ukrainian War from January 6 to 11, 1919 as a part of larger Polish offensive against the UGA.\nPrelude\nZhovkva was strategically important as it was located on the road to the city of Lviv, which was besieged by Ukrainians. In January 1919, Józef Piłsudski ordered to launch an offensive against the Ukrainian forces north and north-east of Lviv in order to seize Zhovkva-Rawa-Ruska-Lviv line. Polish forces numbered around 6,000 soldiers from the operational group \"Bug\" led by Jan Romer. Number of Ukrainian soldiers is unknown, but it is known that as of 8 January there was one kurin inside the city.\nBattle\nOn 6 January, the Polish army launched an offensive on Rava-Ruska and Zhovkva with goal of breaking into besieged Lviv.\nOn 7 January, Ukrainian units led by Boguslav Shashkevych tried to halt the Polish offensive but failed. On the next day, after a short battle, Kurmanovych ordered Ukrainian units inside the city to retreat. Zhovkva, which was located in the rear of the UGA \"North\" group, was captured by the Polish army, as well as Ugniv and Kulykiv. However, on the same day, Northern group of the UGA counterattacked and recaptured Zhovkva and Kulykiv, thus dissolving the Polish \"corridor\" to Lviv. Poles managed to temporarily break through to besieged Lviv but after a Ukrainian counterattack they were forced to retreat from Zhovkva.\nOn 10 January, UGA have recaptured Dubliany and on the next day launched an offensive on Lviv to counter the Polish offensive planned on 14 January.\nAftermath\nPolish army suffered heavy casualties – Ukrainian Galician Army captured part of the supply trains with weapons that Polish army was trying to deliver to Lviv. According to Kurmanov, the Polish losses were: 50 POWs, 17 machine guns, 5 cars and several cannons captured. Another attempt to capture Zhovkva and break to Lviv occurred in March of 1919 during the Vovchukhiv offensive, but this attempt was also defeated. The city was finally captured by the Poles only on May 16, 1919.\nReferences"
    }
  ]
}