{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Arghandab (2008)\n\nIslamic Republic of Afghanistan\n| combatant2        =  Taliban\n| commander1        =\n| commander2        =\n| strength1         =  700 soldiers\n| strength2         = 300–600 insurgents\n| casualties1       = 2 killed4 wounded\n| casualties2       = 96 killed (ANA claim)\n| casualties3       = 1 civilian killed1 civilian wounded3 contractors wounded\n}}\nThe Battle of Arghandab, codenamed Operation IBRAT (lit. admonition) by the insurgents, began on June 18, 2008, when NATO-led forces attacked Taliban militants in response to Taliban attacks in Arghandab District and Kandahar in Afghanistan. The battle in Arghandab marked the second time in less than a year that the Taliban tried to take control of the area.\nBackground\nOn June 13, 2008, Taliban fighters attacked the Sarposa Prison in a co-ordinated assault which freed the 800-900 prisoners, approximately a third of whom were believed to have past ties to the insurgency. Coalition forces swept the area for escaped convicts, leading to the deaths of 15 militants in an air strike against a farm.\nIn the following days, it was widely reported that as many as 18 towns surrounding Kandahar had been overrun by Afghan militants, and that approximately 500 insurgents had moved into the neighbouring Arghandab District  north of the city, to make use of its grape and pomegranate groves to conceal themselves while they prepared to re-take Kandahar. The insurgents warned locals to flee the area before heavy fighting began, while Coalition planes dropped leaflets suggesting that civilians remain indoors. On June 16, 2008, Afghan National Army (ANA) and Coalition forces conducted a five-hour patrol through the area, and reported that they had seen no sign of an insurgent build-up and that any reports suggesting otherwise were \"unfounded\".\nBuild-up\nDespite reassurances a battle was not looming, the Canadians called an emergency meeting with the ANA on June 16, 2008, and the following day coalition forces flew 700 ANA troops from Kabul into the region on June 17, 2008, as hundreds of civilians fled the area, and Canadian Forces reported a small gunbattle with insurgents on the outskirts of the city.\nAfghan insurgents destroyed culverts and bridges around Kandahar, while planting minefields in an attempt to limit Coalition mobility. The insurgents began sending shipments of weapons and ammunition into their neighboring towns, while Taliban commander Mullah Ahmedullah suggested that the insurgents were waiting for the NATO-led forces to make the first move.\nCanadian soldiers increased their presence at \"high-risk\" targets in Kandahar, including a power station, the residence of governor Ahmed Wali Karzai, Sarposa Prison and their own reconstruction base. A 22:00 curfew was placed on vehicles in the city.\nAkhtar Mohammad, who had been among the escapees from the Sarposa Prison, reported that he was among approximately 200 insurgents in Zhari, preparing to enter Arghandab in advance of the battle.\nThe battle\nNATO-led forces entered Arghandab on June 18, 2008, and were met by only small pockets of resistance. An air strike in Tabin was reported to have killed 20 insurgents, while two ANA soldiers were killed in a firefight that left 16 insurgents dead in Khohak. On June 19, Brigadier General Denis Thompson confirmed that the insurgents had been defeated outside of Kandahar City, but also added that they could regroup and attack again.\nAustralian journalist Jamie Kidston was shot in the arm while working for NATO and filming Canadian troops in combat.\nOne local resident was killed, and another wounded. Three other civilian contractors working for ISAF were also wounded.\nReferences"
    }
  ]
}