{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Kronstadt\n\n|map_type    =\n|map_relief  =\n|latitude    =\n|longitude   =\n|map_size    =\n|map_marksize =\n|map_caption =\n|map_label   =\n|territory   =\n|result      = Strategic Russian victory (see below)\n|status      =\n|combatant1  =\n|combatant2  =\n|commander1  =Duke Charles of Södermanland\n|commander2  =Admiral Alexander Kruse\n|units1      =\n|units2      =\n|strength1   =\n|strength2   =\n|casualties1 =84 killed281 wounded\n|casualties2 =89 killed218 wounded\n|notes       =\n|campaignbox =\n}}\nThe Battle of Kronstadt () was a naval battle fought in the Gulf of Finland west of Kronstadt on 3–4 June 1790. The Swedish naval forces sought to engage the Kronstadt squadron of Russian fleet and defeat them both to prevent Russian squadrons from joining and also to open the sea route to Kronstadt and Saint Petersburg.\nBackground\nSwedish open sea fleet under Duke Charles of Södermanland had failed to inflict defeat to considerably smaller Russian naval squadron located instead suffering losses in the action at Reval and chose to withdraw to Gogland on 25 May 1790 to wait for further instructions. On 29 May King Gustav III ordered the open sea fleet to sail towards Kronstadt in order to protect the coastal fleets flank. Meanwhile, coastal fleets had managed to maul the Russian coastal units at Frederikshamn making it possible for the coastal fleet to continue towards the eastern Gulf of Finland. Coastal fleet continued towards Vyborg while repeatedly raiding the coast finally reaching Beryozovye Islands on 3 June.\nBattle\nSwedish open sea fleet was met by the Russian Kronstadt squadron while approaching Kronstadt on 3 June 1790. The engagement between the two roughly equal strength fleets lasted for four hours without success on either side. Swedish coastal fleet sortied ships to support the open sea fleet but by the time they reached the open sea fleet battle had already ended for the day and since the small coastal vessels were unable to keep up with open sea fleet they had to withdraw back to Beryozovye Islands. Several more clashes were fought between the fleets during the day. Fighting started again on 4 June with even less results than on the previous day. Admiral Kruse apparently had no intention to actually engage the Swedish fleet, only to delay them long enough for the other Russian naval squadrons to reach them. Duke Charles became aware of Russian squadrons approaching from the west and withdraw to north-west with Kruse following close behind and already on 6 June Russian squadrons had managed to link up.\nAftermath\nAfter Russian naval squadrons from Kronstadt and Reval had linked up Swedish naval commanders chose not to challenge them and instead withdrew. Initially Duke Charles would have preferred to retire to Sveaborg where the damage could have been properly repaired but King Gustav III insisted on keeping the open sea fleet near the coastal fleet. To accomplish this the open sea fleet under Duke Charles sailed to the mouth of the Bay of Viborg and anchored for repairs on 6 June. Russian fleet which consisted at this point of 29 ships of the line, 11 frigates, 11 brigs and 8 rowed archipelago frigates under Admiral Vasily Chichagov approached slowly approached the Swedish fleet arriving on sight already on 7 June but steadily moved their positions closer coming with 2 nautical miles on 26 June 1790 trapping both Swedish fleets in addition to the king, his brother and 30,000 men. By this time it had been joined with the rest of Russian open sea and coastal fleet elements.\nAnalysis\nKing Gustav III's decision to move the fleets to the eastern Gulf of Finland was an inspired action which according to historians caused severe problems for the Russians as at time, 2 June 1790, Swedish fleets arrived to the vicinity of Saint Petersburg there were practically no Russian ground forces to oppose the Swedes in the area. On the other hand, the failure of Duke Charles fleet to prevent Russian squadrons from joining was in practice a strategic Russian victory which blocked the approach to Saint Petersburg.\nRefs\nBibliography\n*"
    }
  ]
}