{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Chorupań__disambig_1\n\nThe Battle of Chorupan took place near the village of Chorupan, northwest of Dubno Volhynia, on July 13–19, 1920, during the Polish–Soviet War. Polish Army Group of General Franciszek Krajowski, which was based mostly on 18th Infantry Division clashed with Soviet 1st Cavalry Army, commanded by Semyon Budyonny.\nThe Group of General Krajowski made left wing of Polish 6th Army (General Jan Romer), attacked by Budyonny's cavalry. On July 13, 1920, 18th Infantry Division attacked Dubno, capturing the town, after heavy fighting with Soviet 11th Cavalry Division. General Krajowski, who was trying to get in touch with Polish 2nd Army, decided to send 36th Infantry Brigade to Chorupan. The village was seized by Poles, whose forces were reinforced by field artillery. Despite this local success, no contact with 2nd Army was made.\nIn the morning of July 14, Soviet assault was repulsed, but some time later, Poles were ordered to abandon Chorupan. As a result, Budyonny managed to cross the Ikva river, and capture both Chorupan and Dubno. On July 16, Polish 18th Division initiated a counterattack, hoping to push the Soviets back behind the Ikva. 36th Infantry Brigade, supported by 18th Field Artillery, attacked Chorupan. A bloody battle began, in which Soviet cavalry lost some 100 men. The village was recaptured by Poles in the morning of July 17, but was again lost after a fierce Soviet counterattack. In the evening of July 17, reinforced Polish units once again assaulted Soviet positions, and Chorupan changed hands.\nOn July 19, Soviet cavalry concentrated near Chorupan, and General Krajowski, aware of the situation, ordered 49th and 145th Infantry Regiments to attack. Surprised, the Red Army cavalrymen scattered in the area, but fighting continued well into the night, ending after Soviet retreat. Due to heavy Polish losses and lack of information about the fate of the 2nd Polish Army, General Krajowski decided to abandon Chorupan on July 19 in the night. Last Polish units left Chorupan on July 20, at 3&nbsp;am. Altogether, Poles lost some 800 dead, missing and wounded. Soviet losses are unknown.\nThe battle is commemorated on the Tomb of the Unknown Soldier, Warsaw, with the inscription \"CHORUPAN kolo DUBNA 19 VII 1920\".\nSources\n*"
    }
  ]
}