{
  "content": [
    {
      "type": "text",
      "text": "# Battle of San Cesario\n\nThe battle of San Cesario in August 1229 was the culmination of a civil war between the members of the Lombard League. In the pitched battle, Modena and its allies defeated Bologna and its allies.\nThe war, which began in 1226, pitted Bologna, supported by Milan and Piacenza, against Modena, supported by Cremona and Parma. Bologna's former ally, Reggio, remained neutral. In 1228, Bologna invaded the territory of Modena, but an epidemic forced its withdrawal.\nIn August 1229, Bologna laid siege to the Modenese castle of San Cesario. According to the Guelph Annals of Piacenza, the commune of Piacenza sent 174 knights to assist Bologna. According to Salimbene de Adam, the castle was captured within sight of the armies of Modena, Parma and Cremona. The result was that \"one night there was a great fight between them ... and there was a great slaughter of men, footsoldiers and knights, on both sides.\" The Bolognese were forced to retreat, \"leaving their carroccio and all their equipment in the field\".\nBologna and its  neutral  and the site of the\n| alt            =\n| places         =\n}}\nIn the aftermath of their victory, the Modenese intended to take the abandoned carroccio back to Modena, but the Parmesans intervened on Bologna's behalf. Salimbene has them saying that \"it was not good to do all the harm they could to their enemies, and that\" taking the carroccio \"would be an indelible affront and would provoke many evils.\" As a result, the carroccio was taken to the Bolognese castle of Piumazzo and returned.\nOne of the victims of the battle was Salimbene's father's first cousin, Berardo Oliverio di Adamo, who fought on the side of Parma. As an honour, his body lay in state before the font of the Parma Baptistery. His obituary in the Chronicon Parmense calls him \"an eloquent judge and a proven soldier\" who died \"in the battle of San Cesario\" and was buried in \"the church of Sant'Agata, which is the chapel of the greater church of the city of Parma.\"\nAccording to Pietro Cantinelli, elements of the Bolognese militia mutinied after the retreat. There was a riot and the Palazzo Communale was occupied. The rioters demanded peace and the communal authorities opened negotiations with Modena. Bishop Enrico della Fratta served as one of the Bolognese negotiators. Guala de Roniis mediated. A truce was signed on 11 December 1229 for nine years, although Bologna broke it in 1234.\nThe Bolognese–Modenese war and battle of San Cesario took place while Pope Gregory IX was trying to rally the Lombard League to fight for him against the league's erstwhile enemy, Emperor Frederick II, in the so-called War of the Keys. A comparison of the number of troops committed by the communes to the war against Frederick and the war between themselves indicates how much greater importance they attached to the latter.\nNotes\nBibliography\n*\n*\n*\n*\n*\n*"
    }
  ]
}