{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Mu'tah__disambig_1\n\n| partof            = the Arab–Byzantine wars\n| image             = Mausoleum ,Jafer-ut-Tayyar,Jordan.JPG\n| caption           = The tomb of Muslim commanders Zayd ibn Haritha, Ja'far ibn Abi Talib, and Abd Allah ibn Rawahah in Al-Mazar near Mu'tah, Jordan\n| date              = September 629\n| place             = Mu'tah, Palaestina Salutaris\n| coordinates       =\n| map_type          = Jordan\n| map_relief        = yes\n| map_size          =\n| map_marksize      =\n| map_caption       =\n| map_label         =\n| map_mark          =\n| territory         =\n| result            = Byzantine victory\n| combatant1        = First Islamic State\n| combatant2        = Byzantine EmpireGhassanids\n| commander1        = Zayd ibn HarithaJa'far ibn Abi TalibAbd Allah ibn RawahaKhalid ibn al-Walid\n| commander2        = TheodoreMālik ibn Zāfila\n| strength1         =\n| strength2         =  according to Al-Waqidi or  according to Ibn Ishaq both statements are greatly exaggerated}}\n| casualties1       = Muslim sources:12  Modern sources:Heavy or most of the army\n| casualties2       = Unknown\n}}\nThe '''Battle of Mu'tah (, or  ') took place in September 629 (1 Jumada al-Awwal 8 AH), between the forces of Muhammad and the army of the Byzantine Empire and their Ghassanid vassals. It took place in the village of Mu'tah in Palaestina Salutaris at the east of the Jordan River and modern-day Karak.\nIn Islamic historical sources, the battle is usually described as the Muslims' attempt to take retribution against a Ghassanid chief for taking the life of an emissary. According to Byzantine sources, the Muslims planned to launch their attack on a feast day. The local Byzantine Vicarius learned of their plans and collected the garrisons of the fortresses. Seeing the great number of the enemy forces, the Muslims withdrew to the south where the fighting started at the village of Mu'tah and they were either routed or retired without exacting a penalty on the Ghassanid chief. According to Muslim sources, after three of their leaders were killed, the command was given to Khalid ibn al-Walid and he succeeded in saving the rest of the force.\nThree years later the Muslims would return to defeat the Byzantine forces in the Expedition of Usama bin Zayd.\nBackground\nThe Byzantines were reoccupying territory following the peace accord between Emperor Heraclius and the Sasanid general Shahrbaraz in July 629. The Byzantine sakellarios Theodore, was placed in command of the army, and while in the area of Balqa, Arab tribes were also employed.\nMeanwhile, Muhammad had sent his emissary to the ruler of Bostra. While on his way to Bostra, he was executed in the village of Mu'tah by the orders of a Ghassanid official Shurahbil ibn Amr.\nMobilization of the armies\nMuhammad dispatched 3,000 of his troops in the month of Jumada al-Awwal 7 (AH), 629 (CE), for a quick expedition to attack and punish the tribes for the murder of his emissary by the Ghassanids. The army was led by Zayd ibn Harithah; the second-in-command was Ja'far ibn Abi Talib and the third-in-command was Abd Allah ibn Rawahah. When the Muslim troops arrived at the area to the east of Jordan and learned of the size of the Byzantine army, they wanted to wait and send for reinforcements from Medina. 'Abdullah ibn Rawahah reminded them about their desire for martyrdom and questioned the move to wait when what they desire was awaiting them, so they continued marching towards the waiting army.\nBattle\nThe Muslims engaged the Byzantines at their camp by the village of Musharif and then withdrew towards Mu'tah. It was here that the two armies fought. Some Muslim sources report that the battle was fought in a valley between two heights, which negated the Byzantines' numerical superiority. During the battle, all three Muslim leaders fell one after the other as they took command of the force: first, Zayd, then Ja'far, then 'Abdullah. The leader of the Arab vassal forces, Mālik ibn Zāfila, was also killed in battle. After the death of 'Abdullah, the Muslim soldiers were in danger of being routed. Thabit ibn Aqram, seeing the desperate state of the Muslim forces, took up the banner and rallied his comrades, thus saving the army from complete destruction. After the battle, ibn Aqram took the banner, before asking Khalid ibn al-Walid to take the lead.\nMuslim losses\nFour of the slain Muslims were Muhajirin (early Muslim converts who emigrated from Mecca to Medina) and eight were from the Ansar (early Muslim converts native to Medina). Those slain Muslims named in the sources were Zayd ibn Haritha, Ja'far ibn Abi Talib, Abd Allah ibn Rawaha, Mas'ud ibn al-Aswad, Wahb ibn Sa'd, Abbad ibn Qays, Amr ibn Sa'd, Harith ibn Nu'man, Suraqa ibn Amr, Abu Kulayb ibn Amr, Jabir ibn Amr and Amir ibn Sa'd.\nDaniel C. Peterson, Professor of Islamic Studies at Brigham Young University, finds the ratio of casualties among the leaders suspiciously high compared to the losses suffered by ordinary soldiers. David Powers, Professor of Near Eastern Studies at Cornell, also mentions this curiosity concerning the minuscule casualties recorded by Muslim historians. Montgomery Watt argues that a low casualty count is possible if the nature of this encounter was a skirmish or if the Muslims completely routed the enemy. He further notes that the discrepancy between leaders and ordinary soldiers is not inconceivable in view of Arab fighting methods.\nAftermath\nAfter the Muslim forces arrived at Medina, they were reportedly berated for withdrawing and accused of fleeing. Salamah ibn Hisham, brother of Amr ibn Hishām (Abu Jahl) was reported to have prayed at home rather than going to the mosque to avoid having to explain himself. Muhammad ordered them to stop, saying that they would return to fight the Byzantines again. According to Watt, most of these accounts were intended to vilify Khalid and his decision to return to Medina, as well as to glorify the part played by members of one's family. It would not be until the third century AH that Sunni Muslim historians would state that Muhammad bestowed upon Khalid the title of 'Saifullah' meaning 'Sword of Allah'.\nToday, Muslims who fell at the battle are considered martyrs (shuhadāʾ). A mausoleum was later built at Mu'tah over their graves.\nSecond battle of Mu'ta\nIn June 632 Usama ibn Zayd led a military campaign against Byzantine Syria three years after the Battle of Mu'tah. Following the Farewell Pilgrimage, Muhammad appointed Usama to lead an invasion force into Balqa, aiming to avenge those killed at Mu'tah, including Usama's father and Muhammad's adopted son, Zayd ibn Harithah.\nUsama's campaign was successful and his army was the first Muslim force to successfully invade and raid Byzantine territory, thus paving the way for the subsequent Muslim conquest of the Levant and Muslim conquest of Egypt.\nHistoriography\nAccording to al-Waqidi (d. 823) and Ibn Ishaq (d. 767), the Muslims were informed that 100,000 or 200,000 enemy troops were encamped at the Balqa'. Some modern historians state that the figure is exaggerated. According to Walter Emil Kaegi, professor of Byzantine history at the University of Chicago, the size of the entire Byzantine army during the 7th century might have totaled 100,000, possibly even half this number. While the Byzantine forces at Mu'tah are unlikely to have numbered more than 10,000.}} Montgomery Watt indicates anywhere from 3,000 to 20,000 for the Byzantine force, but that it was unlikely the Muslims fought the entire opposing army.\nMuslim accounts of the battle differ over the result. According to David S. Powers, the earliest Muslim sources like al-Waqidi record the battle as a humiliating defeat (hazīma). However, Montgomery Watt notes that al-Waqidi also recorded an account where the Byzantine forces fled. Powers suggests that later Muslim historians reworked the early source material to reflect the Islamic view of God's plan. Subsequent sources present the battle as a Muslim victory given that most of the Muslim soldiers returned safely.\nSee also\n*Military career of Muhammad\n*List of expeditions of Muhammad\n*History of Islam\n*Jihad\n*Muhammad's views on Christians\nNotes\nReferences\nSources\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\nFurther reading\n*[http://www.archive.org/details/TheSealedNectar_201802 Ar-Raheeq Al-Makhtum (The Sealed Nectar)]\n*[https://web.archive.org/web/20061231061738/http://www.witness-pioneer.org/vil/Books/MH_LM/campaign_of_mutah.htm The Life of Muhammad]\n*[http://drive.google.com/drive/folders/0B2NPAUkyo-6wfnpWaW9tVi13YlMzcmprRTNYQ3B0OXIzRGFXMy1kclE1dmtvS2JTLWl6RTA Ikoalag Historical]\n*[https://web.archive.org/web/20080303102120/http://www.grandestrategy.com/2007/12/sword-of-allah-chapter-6-mutah-and.html Sword of Allah]"
    }
  ]
}