{
  "content": [
    {
      "type": "text",
      "text": "# Battle of the Imjin River__disambig_1\n\n| result            = See }}\n* Chinese forces push UN back 25 mi (40 km) but fail to achieve breakthrough\n| combatant1        =\n*\n*\n*\n*\n*\n| combatant2        =\n| commander1        =  Matthew Ridgway Thomas Brodie Ralph Monclar Albert Crahay Joseph Wagener Dionisio S. Ojeda Kang Mun-bong\n| commander2        =  Peng Dehuai Yang Dezhi Fu Chongbi Zeng Siyu Xiao Yingtang\n| units1            =  29th Infantry Brigade\n* 1st Fusiliers\n* 1st Glosters\n* 1st Ulster Rifles\n* 8th King's Royal Irish Hussars\n*  3rd Ranger Infantry Company\n* French Battalion\n*  Belgian Volunteer Corps\n**  Luxembourg Detachment\n10th Battalion Combat Team 1st Infantry Division\n| units2            =  19th Army Group\n* 63rd Army\n* 64th Army\n* 65th Army\n* 8th Artillery Division\n| casualties1       =  Unknown\n*  141 killed1,169 wounded, missing or captured\n*  129 killed\n*  12 killed\n*  5 killed\n| casualties2       = Around  20,000–30,000 (estimated)\n| map_type          = South Korea\n| map_size          =\n| map_caption       =\n| campaignbox       =\n}}\nThe Battle of the Imjin River (), also known as the Battle of Solma-ri () or Battle of Gloster Hill () in South Korea, or as Battle of Xuemali () in China, took place 22–25 April 1951 during the Korean War. Troops from the Chinese People's Volunteer Army (PVA) attacked United Nations Command (UN) positions on the lower Imjin River in an attempt to achieve a breakthrough and recapture the South Korean capital Seoul.  The attack was part of the Chinese Spring Offensive, the aim of which was to regain the initiative on the battlefield after a series of successful UN counter-offensives in January–March 1951 had allowed UN forces to establish themselves beyond the 38th Parallel at the Kansas Line.\nThe section of the UN line where the battle took place was defended primarily by British forces of the 29th Infantry Brigade, consisting of three British, one French and one Belgian infantry battalions (Belgian United Nations Command) supported by tanks and artillery. Despite facing a greatly numerically superior enemy, the brigade held its general positions for three days. When the units of the 29th Infantry Brigade were ultimately forced to fall back, their actions in the Battle of the Imjin River together with those of other UN forces, for example in the Battle of Kapyong, had blunted the impetus of the PVA offensive and allowed UN forces to retreat to prepared defensive positions north of Seoul, where the PVA were halted. It is often known as the \"Battle that saved Seoul.\"\n\"Though minor in scale, the battle's ferocity caught the imagination of the world\", especially the fate of the 1st Battalion, The Gloucestershire Regiment, which was outnumbered and eventually surrounded by Chinese forces on Hill 235, a feature that became known as Gloster Hill. The stand of the Gloucestershire battalion, together with other actions of the 29th Brigade in the Battle of the Imjin River, has become an important part of British military history and tradition.\nBackground\nFollowing the Soviet-backed North Korean invasion of South Korea on 25 June 1950, a UN counter-offensive had reached the North Korean border with China. On the premise of fearing for its own security, China committed troops it had already moved to the border and began three offensives between 3 November 1950 and 24 January 1951 which pushed the UN forces south of the original border between North and South Korea along the 38th Parallel and captured Seoul. A fourth offensive in mid-February was blunted by UN forces in the Battle of Chipyong-ni and Third Battle of Wonju. At the end of February the UN launched a series of offensive operations, recapturing Seoul on 15 March and pushing the front line back northwards. In early April Operation Rugged established the front in a line that followed the lower Imjin river, then eastwards to the Hwacheon Reservoir and on to the Yangyang area on the east coast, known as the Kansas Line. The subsequent Operation Dauntless pushed out a salient between the Imjin river as it dog-legged north and the Hwacheon Reservoir, known as the Utah Line.\nUN Forces\nOn 22 April the front line in the west along Lines Kansas and Utah was held by the United States Army (US) I Corps comprising, from west to east, the South Korean Republic of Korea Army (ROK) 1st Division, the US 3rd Division with the attached British 29th Brigade, the US 25th Division with the attached Turkish Brigade and the US 24th Division. The 29th Infantry Brigade, commanded by Brigadier Tom Brodie, consisted of the 1st Battalion Gloucestershire Regiment (Glosters), under Lieutenant-Colonel James P. Carne; the 1st Battalion Royal Northumberland Fusiliers (Fusiliers), under Lieutenant-Colonel Kingsley Foster; the 1st Battalion Royal Ulster Rifles (Rifles), under the temporary command of Major Gerald Rickord; and the Belgian Battalion, under Lieutenant-Colonel Albert Crahay (700 men), to which Luxembourg's contribution to the UN forces was attached. The brigade was supported by the 25 pounders of 45 Field Regiment Royal Artillery (RA) commanded by Lieutenant-Colonel MT Young, the 4.2&nbsp;inch mortars of 170 Independent Mortar Battery RA, the Centurion tanks of C Squadron 8th King's Royal Irish Hussars under the command of Major Henry Huth, and by 55 Squadron Royal Engineers.\nThe four battalions of 29th Brigade covered a front of . Gaps between units had to be accepted because there was no possibility of forming a continuous line with the forces available. \"Brigadier Brodie determined to deploy his men in separate unit positions, centred upon key hill features\" On the left flank, the Glosters were guarding a ford over the Imjin  east of the ROK 1st Division; the Fusiliers were deployed near the centre, around  northeast of the Glosters; the Belgians, occupying a feature called Hill 194 on the right, were the only element of the 29th Brigade north of the river. Their connection with the rest of the brigade depended on two pontoon bridges about  apart. These bridges connected the Belgians with Route 11, the 29th Brigade's main line of supply and communication. The Rifles served as the brigade's reserve and were deployed along Route 11. Extensive defensive preparations were not completed because the British expected to hold the position for only a short time. Neither minefields, deeply dug shelters nor extensive wire obstacles had been constructed. The British position on the Imjin river \"was deemed safe\" but vulnerable in case of an attack.\nChinese forces\nThe commander-in-chief of the PVA and North Korean Korean People's Army (KPA) forces in the Field, Marshal Peng Dehuai, planned to \"wipe out...the American 3rd Division...the British 29th Brigade and the 1st Division of the Republic of Korean Army...after this we can wipe out the American 24th Division and 25th Division\", and promised the capture of Seoul as a May Day gift to Mao Zedong. To achieve the objective Peng planned to converge on Seoul with three PVA army groups and a KPA corps; a total strength of some 305,000 men. The III and IX Army Groups were to attack the right flank of the US 3rd Division and the 24th and 25th Divisions on the Utah Line, east of the Imjin where it turned north. The XIX Army Group on the PVA right flank, west of the Imjin river where it turned north, were to attack the remainder of the 3rd Division and the ROK 1st Division. On the XIX Army Group front, the KPA I Corps and PVA 64th Army would attack the ROK 1st Division, while the 63rd Army would attack on their left, pitting it against 29th Brigade. The 63rd Army comprised three divisions, the 187th, 188th and 189th, with each division comprising three regiments, each of which comprised three battalions. Some 27,000 men in 27 battalions would be attacking 29th Brigade's four battalions, albeit in echelon, one division after the other.\nBattle\nThe first night\nThe battle opened on the night of 22 April 1951. A PVA patrol on the north bank of the river moved around the Belgians on Hill 194 and continued to advance east towards the two bridges on which the Belgians depended.  Elements of the 29th Brigade's reserve, the 1st RUR, were deployed forward at about 22:00 to secure the crossing but were soon engaged by PVA forces trying to cross the river. The Royal Ulster Rifles were unable to secure the bridges.  This development meant that the Belgian battalion on the north bank of the river was in danger of being isolated from the rest of the 29th Brigade.\nPVA forces following the initial patrol either attacked the Belgian positions on Hill 194 or continued their advance towards the bridges. Those who were able to cross the Imjin attacked the Fusiliers' right rear company, Z Company, on Hill 257, a position close to the river and almost directly south of the crossings.  Further downstream, PVA forces managed to ford the Imjin and attacked the Fusiliers' left forward company, X Company, on Hill 152. The retreat of X Company from Hill 152 had serious consequences for Y Company, which occupied the right forward position of what can be described as a squarish fusilier position marked out by four widely spaced company perimeters at the corners.  Although Y Company was not attacked directly, PVA forces threatened its flanks by forcing Z and X Companies from their positions. After unsuccessful British attempts to regain those lost positions on Hill 257 and 194, Y Company's position was abandoned, the retreat being covered by C Squadron, 8th Hussars.\nOn the left of the brigade's line, a patrol of 17 men from the Glosters' C Company lying in wait on the river bank repulsed three attempts by a battalion of the 559th Regiment, 187th Division to cross the river, eventually retiring without loss when their ammunition ran low and assaulting troops finally gained the opposite bank. During the night the Glosters' A and D Companies were attacked, and by 07:30 A Company, outnumbered six to one, had been forced from its position on Castle Hill. An attempt to retake it failed, during which Lieutenant Philip Curtis single-handedly destroyed a PVA machine-gun position with a grenade but was himself killed by a burst of machine-gun fire in the process. He was posthumously awarded the Victoria Cross.\nThe Glosters' withdrawal to Hill 235\nOn 23 April, attempts by the Fusiliers and forces from the US 3rd Infantry Division's reserve to regain control of areas lost during the night failed. An attack by the US 1st Battalion, 7th Infantry, on enemy forces near Hill 257 was ordered to support the Belgian withdrawal from the north bank of the Imjin River. Despite losing seven vehicles, the Belgian Battalion successfully withdrew to the east and took up new positions south of the Glosters and the Fusiliers before moving to the vicinity of the 29th Brigade's command post.\nfive weeks after the battle]]\nlight tanks in Korea.]]\nAt around 20:30 on 23 April, the Glosters' A Company, now at less than half strength and with all officers killed or wounded, fell back to Hill 235. The withdrawal left D Company's position exposed, and with one of its platoons badly mauled in the overnight fighting, it too withdrew to the hill. B Company had not been pressed during the night, but the withdrawal of D Company on their left and the Fusiliers on their right left them exposed, and they were withdrawn to Hill 316,  east of C Company.\nDuring the night of 23/24 April, the Glosters' B Company, outnumbered 18:1, endured six assaults, calling in artillery on their own position to break up the last of them. Low on ammunition and having taken many casualties, the seventh assault at 08:10 forced them to abandon their position, and just 20 survivors made it to Hill 235, to which battalion HQ, the Support Company and C Company had already withdrawn.}} As B Company fought for its life, the PVA 188th Division crossed the Imjin and attacked the Fusiliers and the Royal Ulster Rifles on the right of the brigade's line. The 187th Division also engaged the brigade's battalions on the right, while the 189th Division kept up the pressure on the left.\nMost dangerous for the integrity of the 29th Brigade was the deep penetration of the line between the Glosters and the Fusiliers which had cut off the former. To counter the PVA attack and protect the Glosters from being completely surrounded, the Philippine 10th Battalion Combat Team (BCT) was temporarily attached to the 29th Brigade. A combined force of 3 M24 tanks from the 10th BCT's reconnaissance company and 10 Centurions from C Squadron of the 8th Hussars supported by infantry reached a point  from Hill 235 on 24 April. However, the column failed to make contact as the lead M24 tank was hit by PVA fire and knocked out, blocking the route and making any further advance against heavy resistance impossible. At this point, according to an official American narrative of operations, \"the brigade commander considered it unwise to continue the effort to relieve the Gloucester Battalion and withdrew the relief force\".\nThe Glosters were not alone on Hill 235. Throughout the battle, they were supported by the men of C Troop 170th Mortar Battery, Royal Artillery.\nAs with The Glosters, C Troop lost men and fought to the end.\nThose who survived were taken prisoner with the Glosters and marched North.\nRetreat of the 29th Brigade\nContinued PVA pressure on the UN forces along the Imjin prevented a planned attack by the US 1st and 3rd Battalions, 65th Infantry, to relieve the Glosters. When two further attempts by a tank troop to link up with the Glosters failed, Brodie left the decision to Carne whether to attempt a break-out or surrender. No further attempts to relieve the Glosters were undertaken because, at 08:00 on 25 April, US I Corps issued the order to execute Plan Golden A, which called for a withdrawal of all forces to a new defensive position further south.\nIn accordance with orders issued by I Corps, the Fusiliers, Rifles and Belgians, supported by the tanks of the 8th Hussars and the Royal Engineers of 55 Squadron, withdrew to the safety of the next UN position. The Belgians occupied blocking positions west and southwest of the 29th Brigade's command post in order to allow the other units of the brigade to fall back through the battalion's positions. The withdrawal under intense enemy pressure was made even more difficult by the fact that PVA forces dominated parts of the high ground along the line of retreat; they were able not only to observe any movements by the 29th Brigade, but also to inflict heavy casualties on the retreating units. Among those killed was the commanding officer of the Fusiliers, Lieutenant-Colonel Foster, who died when his jeep was hit by PVA mortar fire. In the words of Major Henry Huth of the 8th Hussars, the retreat was \"one long bloody ambush\". When B Company of the Ulsters, which had acted as rearguard during the retreat, reached the safety of the next UN line, all elements of the 29th Brigade except for the Glosters had completed the withdrawal.\nThe Glosters on Hill 235\nThe Glosters' situation on Hill 235 made it impossible for them to join the rest of the 29th Brigade after it had received the order to retreat. Even before the failed attempts to relieve the battalion on 24 April, B and C Companies had already suffered such heavy casualties that they were merged to form one company.  Attempts to supply the battalion by air drop were unsuccessful. Despite their difficult situation, the Glosters held their positions on Hill 235 throughout 24 April and the night of 24/25 April. In the morning of 25 April, 45 Field Regiment could no longer provide artillery support. Since Brodie had left the final decision to Carne, the Glosters' CO \"gave the order to his company commanders to make for the British lines as best as they could\" on the morning of 25 April. Only the remains of D Company, under the command of Major Mike Harvey, reached the UN lines after several days. The rest of the battalion surrendered and 459 of them were taken prisoner, including Carne.\nAftermath\nImportance of the battle\nHad the PVA achieved a breakthrough in the initial stages of their assault, they would have been able to outflank the ROK 1st Division to the west and the US 3rd Infantry Division to the east of the 29th Brigade. Such a development would have threatened the stability of the UN line and increased the likelihood of success for a PVA advance on Seoul. Although the PVA benefited from the brigade's scattered deployment and lack of defensive preparations, they were nevertheless unable to take the positions before UN forces could check further advances. In three days of fighting, the determined resistance of the 29th Brigade severely disrupted the PVA offensive, causing it to lose momentum, and allowed UN forces in the area to withdraw to the No-Name Line, a defensive position north of Seoul, where the PVA/KPA were halted.\nThe scope and the outcome of the Imjin River engagement have been subjected to several interpretations according to different historiography traditions. According to official Chinese history, the elimination of the 1st Battalion, Gloucestershire Regiment by the Chinese 63rd Army is considered to be an important victory, although the failure of the 64th and the 65th Army to eliminate the entire British 29th Independent Infantry Brigade and capture Seoul due to the defense of ROK 1st Infantry Division was a serious setback.  On the other hand, the South Korean contributions to the Imjin River battle are only recorded in sparse detail by the official South Korean history, but historian Allan R. Millet has argued that the ROK 1st Infantry Division's performance in battle demonstrated the potential of South Korean armed forces, in the wake of serious failures during the period of 1950–51. In British Empire countries, the engagement has been interpreted as the 29th Brigade's sacrifice, against impossible odds when facing the Chinese 63rd Army, which ultimately prevented the Chinese from capturing Seoul. Regardless of the interpretations, independent research from historians Zhang Shu Guang and Andrew Salmon concluded that the actions of the 29th Brigade had disrupted the Chinese advance sufficiently to affect the outcome of the First Chinese Spring Offensive.\nCasualties\nAccording to a memorandum presented to the British cabinet on 26 June 1951, 29th Brigade suffered 1,091 casualties, including 34 officers and 808 other ranks missing. These casualties represented 20 to 25 percent of the brigade's strength on the eve of battle. Of the 1,091 soldiers killed, wounded or missing, 620 were from the Gloucestershire Regiment, which could muster only 217 men on 27 April..}} 522 soldiers of the Gloucestershire Regiment became prisoners of war.  Of those taken prisoner, 180 were wounded and a further 34 died while in captivity. 59 soldiers of the Gloucestershire Regiment were killed in action. Based on estimates, PVA casualties in the Battle of the Imjin River were at least 10,000, with some sources stating upwards of 15,000. As a result of the casualties suffered during the battle, the PVA 63rd Army, which had begun the offensive with three divisions and approximately 27,000 men, had lost over a third of its strength and was pulled out of the front line.\nMemorial\nThe Gloucester Valley Battle Monument was later built at Gloster Hill , beside the Seolmacheon stream.\nThe British Embassy in Seoul organises a service, officially called the Gloster Valley Memorial Service, for veterans on every anniversary of the battle. In 2008, it took place on 19 April as part of formal commemoration ceremonies that were held during 14–20 April. The outline of the commemorations in 2008 encompassed a service of commemoration, including the laying of wreaths and the presentations of Gloster Valley Scholarships – financial assistance to deserving children in the area where the battle took place&nbsp;– as well as a picnic lunch that offered visitors the opportunity to mingle with veterans. About 70 British veterans and the British ambassador to South Korea took part in the event.\nAwards and citations\nIndividual awards\nIn the Battle of the Imjin River two Victoria Crosses and one George Cross were awarded to soldiers of the Gloucestershire Regiment:\n* Lieutenant colonel James P. Carne, who commanded the battalion, was awarded the Victoria Cross. He was also awarded the US Army's Distinguished Service Cross.\n* Lieutenant Philip Curtis, who had recently learnt of his wife's death and who died in a lone counter-attack on enemy machine-guns, was posthumously awarded the Victoria Cross.\n* Lieutenant Terence Edward Waters, who died in captivity, was awarded a posthumous George Cross for his conduct shortly after capture.\nIn addition, several soldiers were awarded the Distinguished Service Order:\n* Captain Anthony Farrar-Hockley, 1st Battalion, Gloucestershire Regiment\n* Major Edgar Denis Harding 1st Battalion, Gloucestshire Regiment OC B Coy\n* Major Henry Huth, Officer Commanding, C Squadron, 8th King's Royal Irish Hussars\n* Major John Winn, Officer Commanding, Z Company, Royal Northumberland Fusiliers\nThe Military Cross was awarded to:\n* Major Mike Harvey, 1st Battalion, the Gloucestershire Regiment, for his leadership of a group of 5 officers and 41 men of D Company who escaped and evaded the Chinese encirclement.\n* Major Leith-MacGregor DFC, Officer Commanding, Y Company, Royal Northumberland Fusiliers\n* Captain Peter Ormrod, 8th King's Royal Irish Hussars\n* Lieutenant Guy Temple, for his actions when a platoon from C Company, 1st Battalion, Gloucestershire Regiment stopped four attempts by Chinese Communist Forces to cross the river on 22 April, only withdrawing when the platoon ran short of ammunition.\n* Captain Charles Stanfield Rutherford Dain, 45, Field Rgt, Royal Artillery, for manning a forward observer post for 2 days and nights whilst wounded.\nThe Military Medal was awarded to:\n*Warrant Officer Class 2 G E Askew, C Troop 170 Independent Mortar Battery\nLieutenant-Colonel Crahay received the U.S. Army's Distinguished Service Cross for his leadership of the Belgian battalion during the battle.\nUnit citations\nThree units were awarded the US Presidential Unit Citation for their part in the Battle of the Imjin River:\n* 1st Battalion Gloucestershire Regiment\n* C Troop, 170 Independent Mortar Battery, Royal Artillery\n* Belgian battalion\nOn 8 May 1951, by the command of U.S. President Harry S. Truman, General James Van Fleet presented the President's Distinguished Unit Citation to the Glosters, together with C Troop, 170 Heavy Mortar Battery, which had given invaluable support throughout the battle. The citation says:\nstand at ease during ceremonies in which the American Presidential Unit Citation was awarded to the Gloucestershire Regiment and the 170th Independent Mortar Battalion, Royal Artillery, 8 May 1951.]]\nBATTLE HONOURS – By direction of the President, under the provisions of Executive Order 9396 (Sec 1, WD Bul. 22.1943), superseding Executive Order 9075 (Sec.III, WD Bul.II, 1942) and pursuant in authority in AR 260-15, the following units are cited as public evidence of deserved honor and distinction. The citation reads as follows:\nThe 1ST BATTALION GLOUCESTERSHIRE REGIMENT, BRITISH ARMY and TROOP C, 170TH INDEPENDENT MORTAR BATTERY, ROYAL ARTILLERY, attached, are cited for exceptionally outstanding performance of duty and extraordinary heroism in action against the armed enemy near Solma-ri, Korea on 23, 24 and 25 April 1951.  The 1st BATTALION and TROOP C were defending a very critical sector of the battle front during a determined attack by the enemy. The defending units were overwhelmingly outnumbered.  The 83rd Chinese Communist Army drove the full force of its savage assault at the positions held by the 1st BATTALION, GLOUCESTERSHIRE REGIMENT and attached unit. The route of supply ran Southeast from the battalion between two hills. The hills dominated the surrounding terrain northwest to the Imjin River. Enemy pressure built up on the battalion front during the day 23 April. On 24 April the weight of the attack had driven the right flank of the battalion back. The pressure grew heavier and heavier and the battalion and attached unit were forced into a perimeter defence on Hill 235. During the night, heavy enemy forces had by-passed the staunch defenders and closed all avenues of escape.  The courageous soldiers of the battalion and attached unit were holding the critical route selected by the enemy for one column of the general offensive designed to encircle and destroy 1st Corps . These gallant soldiers would not retreat. As they were compressed tighter and tighter in their perimeter defence, they called for close-in air strikes to assist in holding firm.  Completely surrounded by tremendous numbers, these indomitable, resolute, and tenacious soldiers fought back with unsurpassed fortitude and courage. As ammunition ran low and the advancing hordes moved closer and closer, these splendid soldiers fought back viciously to prevent the enemy from overrunning the position and moving rapidly to the south.  Their heroic stand provided the critically needed time to regroup other 1st Corps units and block the southern advance of the enemy.  Time and again efforts were made to reach the battalion, but the enemy strength blocked each effort. Without thought of defeat or surrender, this heroic force demonstrated superb battlefield courage and discipline. Every yard of ground they surrendered was covered with enemy dead until the last gallant soldier of the fighting battalion was over-powered by the final surge of the enemy masses. The 1st BATTALION, GLOUCESTERSHIRE REGIMENT and TROOP C, 170th INDEPENDENT MORTAR BATTERY displayed such gallantry, determination, and esprit de corps in accomplishing their mission under extremely difficult and hazardous conditions as to set them apart and above other units participating in the same battle. Their sustained brilliance in battle, their resoluteness, and extraordinary heroism are in keeping with the finest traditions of the renowned military forces of the British Commonwealth, and reflect unsurpassed credit on these courageous soldiers and their homeland.\nBY COMMAND OF LIEUTENANT GENERAL VAN FLEET.\nOFFICIAL\nLEVEN C ALLEN\nMajor General US Army.\nChief of Staff.\nL. W. STANLEY.\nColonel AGC.\nAdjutant General.}}\nThe Belgian United Nations Command, which was attached to the British 29th Brigade and replaced the 900 men of the Royal Ulster Rifles on 20 April 1951, initially held the brigade's right flank on the north bank of the river.  It also included a Luxembourg platoon.  It fought the Chinese there and then conducted a fighting withdrawal, supported by U.S. forces, before taking position in the center of the brigade's line, ahead of brigade headquarters, for the attempts to relieve the Glosters.  The Belgian battalion was awarded the United States Distinguished Unit Citation and the Republic of Korea Presidential Unit Citation for their conduct during the battle.\n}}\nReferences\nNotes\nCitations\nSources\n* .\n* .\n* .\n* .\n* .\n* .\n* .\n* .\n* .\n* .\n* .\n* .\n* .\n* .\n*\n*\n*\n**\n*\n*\n*\n*\n*\nFurther reading\n* .\n* .\n* .\n* .\n* .\n* .\n* .  1955 edition was published by the Companion Book Club.\n* .\n* .\n* . Resissued as Now Thrive the Armourers: A story of Action with the Gloucesters in Korea (November 1950-April 1951) by Bantam Books in 1989.\n* .\n* .\n* .\nExternal links\n* .\n* .\n* , including a map showing the deployment of 29th Brigade's units.\n*  which holds the archives of the Gloucestershire Regiment including documents and artefacts related to the battle.\n* .\n* : Royal Engineer pictures of the Korean War.\n* .\n* , including their efforts to relieve the Gloucestershire Regiment.\n*  with reports of the battles they participated in, unit awards and personal decorations."
    }
  ]
}