{
  "content": [
    {
      "type": "text",
      "text": "# Battle of the Lerna Mills__disambig_1\n\n| map_type          = Greece#Balkans#Mediterranean\n| map_relief        = yes\n| map_size          =\n| map_marksize      =\n| map_caption       =\n| map_label         =\n| casus             =\n| territory         =\n| result            = Greek victory\n| combatant1        =  First Hellenic Republic\n| combatant2        =  Egypt Eyalet\n| commander1        = Yannis MakriyannisAndreas MetaxasDemetrios Ypsilantis Konstantinos Mavromichalis\n| commander2        = Ibrahim Pasha of Egypt\n| strength1         = 3502 gunboats\n| strength2         = 5,000\n| casualties1       = Minimal\n| casualties2       = 50 dead\n}}\nThe Battle of the Lerna Mills was fought on 25 June 1825, in Lerna, Greece between the Egyptian forces of Ibrahim Pasha and Greek forces led by General Yannis Makriyannis, Demetrios Ypsilantis, Andreas Metaxas and Konstantinos Mavromichalis. It was the first Greek success against Ibrahim and saved the city of Nafplio, seat of the government, from capture.\nBefore the conflict\nAfter the Greek army (led by Theodoros Kolokotronis) fled to Karitena, Ibrahim's forces captured Tripolitsa, which was completely abandoned. Immediately afterwards, Ibrahim led an army of 5,000 soldiers to the plains of Argos to seize Nafplio. When Ibrahim's forces approached the Mills of Lerna on 24 June 1825, general Yannis Makrygiannis and Minister of War Andreas Metaxas organized a resistance force containing 350 Greek soldiers. General Demetrios Ypsilantis, Konstantinos Mavromichalis, Panagiotis Rodios and several philhellenes (such as François Graillard and Heinrich Treiber) volunteered in the defense of the garrison. Protecting Lerna was vital since the mills contained large quantities of grain that supplied food to Nafplio. The mills of Lerna were surrounded by a stone wall that was flanked by a deep pond and a marsh. Moreover, the garrison was supported by two gunboats that were anchored a short distance (or \"musket-shot distance\") from the shore.\nThe position was weak and they were very few compared to Ibrahim's army. Thus many were eager to leave using their horses or by boats but Makriyannis made sure all horses and boats were gone in secret. This made everybody more resolute in defending the position and they started digging trenches. Admiral Henri de Rigny watched from aboard the helplessness of the Greeks and advised Makriyannis against defending the position but Makriyannis ignored him by saying:\n\"They are many indeed but we few have decided to die and have God on our side... And when the few decide to die, most times win... And if we die today we will die for our country and our religion and this death is a good one\". \"Tres bien\" replied de Rigny.\nBattle\nThe battle began during the afternoon of 25 June, and the Egyptians were able to enter the stone wall during their first assaults. In the ensuing combat, however, the Greeks managed to repel their opponents by concentrating their fire on their officers. The morale of the Egyptians collapsed, and the revolutionaries carried out a counterattack using their swords. At the same time, 50 regulars under the command of a captain from Nafplio, Mitros Liakopoulos, arrived at the battle to help the defenders. Despite the constant reinforcements he received, Ibrahim was aware of the fact that the Greeks were prepared to staunchly defend the Lerna Mills and he eventually retreated to the plains of Argos. From there, Ibrahim took his army to Tripolitsa on 29 June, without attacking neither the Lerna Mills again, nor charging against Nafplio. The Greeks had minimal casualties, while the Egyptians had 50 dead (or 500 according to Makriyannis).\nAs soon as the Egyptian forces were repelled successfully, some French naval officers came ashore and congratulated Makriyannis, who had been shot in the right hand from musket fire but kept it secret until the end of the battle. He was taken to the French frigate of Admiral de Rigny to be treated afterwards.\nSee also\n*List of battles\n*Yannis Makriyannis\n*Demetrios Ypsilantis\nNotes\nReferences\nSources\n*Finlay, George. History of the Greek Revolution. Blackwood and Sons, 1861 (Harvard University).\n*Phillips, Walter Alison. The War of Greek Independence, 1821 to 1833. Smith, Elder and Company, 1897 (University of Michigan).\n* Makriyannis, Memoirs, IX Archived October 2, 2009, at the Wayback Machine.\n* Paparigopoulos, K, History of the Greek Nation (Greek edition), vol. 6, p. 164-165\nFurther reading\n* General Makriyannis, Ἀπομνημονεύματα (Memoirs), Athens: 1907 (preface by Yannis Vlahogiannis; in Greek)."
    }
  ]
}