{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Nawzad\n\nUnited States United Kingdom Estonia\n| combatant2        =  Taliban\n| strength1         =  Approx. 300 Marines Unknown Approx. 105\n| strength2         = |\n| casualties1       =  30 killed, 6 wounded 19 killed, 62 wounded  3 killed  1 killed, 3 wounded\n| casualties2       = 680+\n}}\nThe Battle of Nawzad (also called the Battle of Now Zad) (2006–2014) was a battle between ISAF (coalition) forces and Taliban insurgents in Nawzad at the center of Nawzad district in the northern half of Helmand Province, southern Afghanistan.\nMuch of the coverage around the battle considered it to be an example of why the United States' strategy for the war in Afghanistan had to change, as limited troop numbers hampered the ISAF forces' ability to eradicate the Taliban from the strategically vital south for three years prior to the arrival of reinforcements in August 2009.\nUntil that time, U.S. Marines were locked in a stalemate with the insurgents. British, Gurkha, and Estonian forces had fought to similar standstills before the Marines arrived.  After several major offensive operations from August through December 2009, ISAF claimed to have regained control over the district and began reconstruction.\nBackground\nThe town of Nawzad (also the capital of Nawzad district) is situated 65 kilometres north of Camp Bastion and Camp Leatherneck, the conjoined main ISAF bases in Helmand province. Surrounded to the southwest and east by mountains, the town consists of a bazaar, one road, and a maze of mud-brick houses and compounds, interspersed with narrow alleys. The local economy traditionally revolves around opium poppy farming. Like much of Afghanistan, Nawzad and the surrounding area were largely peaceful after the 2001 invasion. The United Nations, European Union, and other Western-funded agencies sent staff to Nawzad to build wells and health clinics.\nEscalation of fighting\nIn the spring of 2006, as part of the stage three expansion of the ISAF mandate to cover the southern provinces of Afghanistan, a contingent of British troops was deployed to Helmand. At the same time, while most United States military attention was focused on Iraq, the insurgency stepped up in the south. The governor of Helmand province, Mohammad Daoud, urged the British commander Brigadier Ed Butler, to defend government positions in Nawzad and Musa Qala, that had come under attack by Taliban insurgents. Butler was at first reluctant to see his small force tied down to fixed positions in remote outstations, but when Daoud threatened to resign over the issue, he relented, and dispatched a small force to protect Nawzad.\nDuring the campaign in 2006, the town began to sustain damage and aid workers fled. By 2007, fighting had escalated between Taliban insurgents and contingents of the 2nd Battalion The Royal Regiment Of Fusiliers prompted almost all of the 35,000 residents to flee. British soldiers of the ISAF force stationed in the village, gave the town the nickname of \"Apocalypse Now Zad\" in light of the heavy fighting they faced in late 2006 and early 2007, in reference to the Vietnam War film Apocalypse Now. A wall of the compound the soldiers were based in had \"Welcome to Apocalypse Now Zad\" painted on its side.\nIn 2008, an Estonian Army peacekeeping force joined the British contingent. The two forces conducted numerous operations to push Taliban fighters out of the town. Despite their joint efforts however, it was not enough to clear the town of Taliban insurgents and the stalemate continued.\nAt this point in time the total British force was estimated to be 82 troops. 37 from 7 Parachute Regiment Royal Horse Artillery (7 Para RHA), 5 from C Battery 3 RHA, roughly 20 troops from Royal Irish Regiment, and 20 troops from 9 Parachute Squadron Royal Engineers, Royal Logistics Corps, Mortar Fire Controllers from 5th Battalion The Royal Regiment of Scotland and British Medics. The troops from 7 Para RHA were sent to replace the 100 Estonian troops (Estcoy-5 Scoutspataljon). The 42 troops from F Parachute Battery RHA, 7 Para RHA patrolled the area for about 6 weeks. The 42 troops from 7 Para RHA handed over to 200 US Marines and 105 Estonians (Estcoy-5 Scoutspataljon) leaving a troop number of around 340 in the town.\nCampaign of 2008–2009\nArrival of U.S. Marines\nIn March 2008, marines of Fox Company, 2nd Battalion, 7th Marines arrived to reinforce the British and Estonian forces. The Marines' mission was to \"train police\", but they were surprised to discover the town a ghost town.  The city was in ruins, mined and dangerous. The local police were poorly trained and ill-equipped to combat Taliban fighters without ISAF support, and so had fled with the townspeople. The Marines' mission in Nawzad soon changed to securing the town so that the people and their police could return, and for the next six months they battled alongside British and Estonian forces (Estcoy-6 Scoutspataljo \"Polar Bears\" C-company) to regain control of the area immediately surrounding the district center. The 200-strong Marine company soon found themselves embroiled in heavy combat on a daily basis.\nIn late 2008, Lima Company, 3/8 arrived to replace Fox 2/7.  At the same time, the remaining British and Estonian forces (Estcoy-7 Scoutspataljon) were reassigned to other areas as part of the re-alignment of forces that came with increased US presence in Helmand.  Nawzad District remained one of the most violent areas of Afghanistan, with regular firefights and airstrikes by the US Marines trying to solidify control of the still abandoned city.\nOn April 3, 2009, two mortar sections of 3/8 fired over 3,236 81mm and 120mm rounds in support a major combat operation by other elements of 3/8 against insurgent forces. The Marines bombarded the insurgent front line, with jets dropping bombs and attack helicopters firing rockets into buildings where insurgents had holed up while ground forces raided several targets. From their base, the Marines fired mortars into insurgent fortifications. The attack and other operations during the winter and spring of 2009 succeeded in pushing back the front line by a few hundred yards and creating a larger buffer around the U.S. positions in preparation for future operations as larger forces became available.\nOperation Khanjar\nOn July 4, 2009, 4,000 Marines from the 2nd Marine Expeditionary Brigade launched a major offensive, dubbed Operation Khanjar into the province's Taliban-held territory.  This offensive and others to follow were a result of reinforcements ordered to Afghanistan by President Obama shortly after he took office, which increased the number of US Marines in Helmand from roughly 2,000 in January 2009 to 10,000 by June.\nCoalition offensive operations\nJust prior to Operation Khanjar in the spring of 2009, Golf Company, 2nd Battalion, 3rd Marines arrived to replace Lima 3/8.\nIn August 2009, Golf Company was reinforced by approximately 400 more US personnel and 100 Afghan National Army soldiers, the first Afghan Security Force presence in the area in over two years. On August 12, 2009, this combined force launched an attack on Dahaneh, a village of 2,000 about five kilometers southeast of the district center.  The village of Dahaneh controlled Dahaneh Pass, the best vehicle route connecting Taliban safe havens in Northern Helmand Province and the more populated agricultural areas further south. After three days of fighting, the US Marine and Afghan forces gained control of the village (which also allowed its residents to vote in the 2009 election). ISAF control of the pass reduced the insurgents' ability to reinforce their forces in the district and also set the stage for later operations to secure the area.\nOperation Cobra's Anger\nOn December 4, 2009, the US Marines pressed into a remote Taliban stronghold in their first major assault since President Barack Obama had announced the deployment of 30,000 more troops in Afghanistan against the Taliban insurgency. Operation Cobra's Anger involved 900 US Marines and sailors, as well as British troops, and 150 Afghan soldiers and police who all pushed into the Nawzad district. In addition to a ground assault, 300 Marines from the 3rd Battalion, 4th Marines and the Marine recon unit Task Force Raider dropped into the Nawzad valley via helicopters and MV-22 Osprey aircraft. This was the first time the Osprey were used in combat operations in Afghanistan. In preparation for the Marine offensive the Taliban planted thousands of homemade bombs and dug in positions throughout the valley at the foot of the craggy Tangee Mountains.  There were no reported ISAF fatalities in the operation and insurgent loses were estimated as 16 killed and 5 captured.\nAfter securing the district center, the offensive later expanded to Taliban strongholds in outlying villages, including the holdout insurgent stronghold Bar Nowzad. ISAF reported this mission as a success.  They claimed that the population began to return to the District Center three years after they fled the heavy fighting and coalition forces cooperated with returned local government leaders to rebuild the city.\n2013 Taliban attacks on Georgian Forces\nOn May 13, three Georgian soldiers of the 42nd Battalion were killed when a suicide bomber drove a truck carrying explosives into their base.\nOn June 7, a similar bombing took place outside a Georgian military base when a Taliban suicide bomber detonated a small truck laden with explosives. The blast killed seven soldiers and wounded six others.\nSee also\n*Helmand Province campaign &ndash; ISAF campaign in Helmand Province, Afghanistan\n*Operation Khanjar &ndash; 2009 offensive into Helmand Province\nReferences\n*\nExternal links\n* [https://www.wsj.com/articles/SB10001424052970203771904574179672963946120#project%3DSLIDESHOW08%26s%3DSB10001424052970203771904574181670489130410%26articleTabs%3Dslideshow Lima 3/8 Marines in Now Zad] &ndash; Wall Street Journal slideshow\n* [https://www.youtube.com/watch?v=8Q_VBOL7KAY 3/8 Marines in Now Zad firefight video] &ndash; ITN News video\n* [https://www.youtube.com/watch?v=Z-bzNQs6xeM AP News report on Now Zad] &ndash; June 30, 2009 AP News report on Now Zad\n* [https://archive.today/20130128103823/http://www.marinecorpstimes.com/mobile/news/2012/10/marine-presidential-unit-citation-102912 Marines eligible for presidential, Navy ribbons]"
    }
  ]
}