{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Taierzhuang__disambig_2\n\n}}\n)\n| place             = Tai'erzhuang town in Shandong province and Pizhou city in Jiangsu province, Republic of China\n| territory         =\n| result            = Chinese victory\n| combatant1        =\n*  National Revolutionary Army\n| combatant2        =\n*  Imperial Japanese Army\n| commander1        =  Li Zongren Deng Xihou Pang Bingxun Sun Lianzhong Han Deqin Bai Chongxi Sun Zhen Tang Enbo Wang Mingzhang Zhang Zizhong Guan Linzheng\n| commander2        =  Rensuke Isogai (10th Division)  Itagaki Seishiro (5th Division)\n| units1            =  National Revolutionary Army\n* 3rd and 4th PG Squadrons, Nationalist Air Force of China\n| units2            =  North China Area Army, 2nd Army\n* 10th Division Seya Task Force\n* 5th Division Sakamoto Task Force\n| strength1         = 100,000–288,000 troops in 10 divisions\n| strength2         = 17,000–60,000 troops7 tanks39 tankettes\n| casualties1       = Western claims: 20,000–30,000+ killed and woundedChinese records: 22,000–23,000 casualties (including 7,000+ killed)\n| casualties2       = Modern Western estimate:8,000 killed12,000 woundedContemporary Western estimates:16,000–20,000 killed40 tanks destroyed70 armored cars100+ trucksJapanese records:\n* Seya Task Force:411 killed1,319 wounded4 tanks7 tankettes\n* Sakamoto Task Force:unknown\nUnder 2,500 total casualtiesOfficial Japanese newspaper claim:636 combat deaths.\n* Seya Task Force: 448 combat deaths\n* Sakamoto Task Force: 188 combat deaths\n----Chinese claim: 20,000+ killed and wounded10000+ rifles931 HMGs77 infantry guns40 tanks50+ cannonsCountless POWs\n| casualties3       =\n| notes             =\n| campaignbox       =\n| coordinates       =\n}}\nThe Battle of Taierzhuang (|p=Tái'érzhuāng Huìzhàn}}) took place during the Second Sino-Japanese War in 1938. It was fought between the armies of the Republic of China and the Empire of Japan in the peak of the Xuzhou Campaign. The battle was the war's first major Chinese victory. The battle was a setback for the Japanese military and its reputation as an invincible force. For Chinese forces, it became a tremendous morale boost.\nThe battle was characterized by vicious close quarters combat. The cramped conditions of urban warfare neutralized Japanese advantages in cannon and heavy artillery. In these circumstances, the Chinese were able to fight the Japanese as equals. Unlike previous engagements, the Chinese managed to resupply their troops while also preventing the Japanese from doing the same. After two weeks of heavy fighting, the Japanese were bled dry of men and material. The Japanese were then virtually encircled by a Chinese counterattack, and were forced out of Taierzhuang with heavy casualties.\nTaierzhuang is located on the eastern bank of the Grand Canal of China and was a frontier garrison northeast of Xuzhou. It was also the terminus of a local branch railway from Lincheng. Xuzhou itself was the junction of the Jinpu railway (Tianjin-Pukou), the Longhai railway (Lanzhou-Lianyungang), and the headquarters of the KMT's 5th War Zone.\nBackground\nPolitical and strategic situation\nBy 1938, the Chinese military had suffered tremendous losses in the campaigns of Shanghai and Nanjing. In particular, its air force and navy had both been virtually wiped out. Nonetheless, China's resolve in resisting the Japanese invasion showed no signs of weakening. On 30 January, the Japanese military high command, after evaluating the situation in China, decided that no new offensive operations should be conducted until August. Emperor Hirohito's stance was even more conservative: he believed that it would take at least a year for the Japanese to solidify their positions in their newly captured territory and consolidate their strength before conducting any further operations. Thus, the Japanese high command decided to wait until 1939 before conducting a swift, aggressive offensive in order to decisively end the war in China.\nAt the same time, Chiang Kai-shek refused to accept the Japanese terms for surrender. On 20 February, China withdrew its ambassador Xu Shiying from Japan. The next day, Japan followed suit, withdrawing its ambassador Kawagoe Shigeru. Earlier that year, Chiang had also resigned from his post as Premier of the Executive Yuan, in order to fully dedicate his efforts to the war. The respective actions taken by both sides indicated their attitude towards the war: China was now fully committed, while Japan still showed some signs of hesitation.\nMilitary situation\nDespite Hirohito's declaration that no new offensives would be conducted in 1938, the Japanese forces in China were eager to continue their offensive, with morale reaching a peak following the Fall of Nanjing. The IJN's preferred strategy would have been to continue advancing westwards along the Yangtze River to invade Wuhan.\nHowever, the IJA was reluctant to continue following this approach of following waterways, and instead pursued the Chinese army retreating from the Shanghai-Nanjing theatre, driving northwards into the three provinces of Jiangsu, Shandong and Henan.\nA significant proportion of the Chinese forces that withdrew from Shanghai crossed the Yangtze River northwards into the Jiangbei region. During the retreat from Nanjing, many scattered Chinese troops also found themselves drifting down the Yangtze and into Jiangbei. The IJA saw this as an opportunity to pursue and destroy this cluster of disorganized Chinese troops, thus ignoring the IJN's strategy of following the Yangtze westwards.\nThroughout December 1937, Rippei Ogisu's 13th Division pursued the fleeing Chinese forces, capturing Jiangdu, Shaobo, and advancing into Anhui to capture Tianchang. Simultaneously, in Northern China, Rensuke Isogai's 10th Division, advanced southwards between Qingcheng and Jiyang to cross the Yellow River, approaching the Jiaoji railway. Gaining access to the railway would enable it to move westwards then southwards to clear the Jinpu railway and join forces with the 13th division at Xuzhou. From there, the combined Japanese forces could attack Wuhan and force the KMT into surrender. The war had thus moved from the 3rd to the 5th War Area.\nArmies\nChinese\nChiang sent his Vice Chief of Staff Bai Chongxi to Xuzhou in January 1938. Li Zongren and Bai were old comrades from the New Guangxi Clique, and had served alongside each other since the Battle of Longtan in the Northern Expedition.\nChiang sent Li the 3rd War Area's 21st Group Army. Also a unit from Guangxi, the 21st was commanded by Liao Lei and consisted of the 7th and 47th Army. At this time, Sun Zhen's 22nd Group Army, a unit from the Sichuan clique also arrived at the Shanxi-Henan region, only to be rejected by both Yan Xishan (commander of the 2nd War Area and chairman of Shanxi) and Cheng Qian (commander of the 1st War Area and chairman of Henan). Both Yan and Cheng disliked units from Sichuan for their poor discipline, particularly their rampant opium consumption.\nUnder the command of Sun Zhen, the 22nd Group Army had deployed four of its six divisions to assist the war effort in Northern China. Organized under the 41st and 45th Army, the contingent began its foot march towards Taiyuan on 1 September, marching for more than 50 days continuously and covering some 1400 kilometers. When they arrived in Shanxi, they were confronted with an icy winter. Despite lacking winter uniforms or even a single map of the province, they immediately engaged the Japanese for 10 days at Yangquan (阳泉), incurring heavy casualties. Desperately low on supplies, they broke into one of the Shanxi clique's supply depots, infuriating Yan Xishan, who expelled them from the province. The 22nd then withdrew westwards into the 1st War Area, only for its commander, Cheng Qian to reject its request for resupplies.\nJapanese\n{| class=\"wikitable\"\n|Southern\n|Commanded by Rippei Ogisu, the Japanese 13th Division, drove westwards from Nanjing via two columns in early February: the northern column advanced towards Mingguang (明光), while the southern column advanced towards Chuxian . Both columns were checked by Wei Yunsong's 31st Army, which had been tasked with defending the southern section of the Jinpu railway by Li Zongren. Despite facing a completely inferior enemy, the Japanese were unable to make any progress even after more than a month of continuous attacks. The Japanese then deployed armoured and artillery reinforcements from Nanjing. The Chinese responded by withdrawing westwards to the southwestern outskirts of Dingyuan in order to avoid direct confrontation with their reinforced foes.\nBy this time, Yu Xuezhong's 51st Army had already positioned itself defensively on the northern banks of the Huai River, forming a defensive line between Bengbu and Huaiyuan. The Japanese proceeded to successively capture Mingguang, Dingyuan, and Bengbu before advancing towards Huaiyuan.\nHowever, their supply routes were then intercepted by the Chinese 31st Corps, which conducted flanking attacks from the southwest. The Japanese situation was worsened further when the Chinese 7th Army (led by Liao Lei) then arrived at Hefei, reinforcing the 31st Army. Engaged by three Chinese corps simultaneously, the Japanese were trapped south of the Huai River and unable to advance any further despite enjoying complete air superiority and having a complete advantage in firepower.\nThe Chinese had thus foiled the Japanese plan of advancing their 13th Division northwards along the Jinpu railway and joining forces with Isogai Division (10th Division) to launch a pincer attack on Xuzhou.\n|-\n|Northeastern\n|After amphibiously landing at Qingdao, the Japanese 5th Division (commanded by Seishiro Itagaki), advanced southwestwards along the Taiwei Highway, spearheaded by its 21st Infantry Brigade. There they faced the Chinese 3rd Group Army, commanded by Pang Bingxun. Despite being designated as a Group Army, Pang's unit only consisted of the 40th Army, which itself only consisted of the 39th Division, a unit from the Northwestern Army. Led by division commander Ma-Fawu, the 39th's five regiments ended up delaying the Japanese advance towards Linyi for over a month. The Japanese captured Ju County  on 22 February and pushed towards Linyi on 3 March.\nHowever, they were met by a stiff Chinese counterattack, which checked them at the Taoyuan region. The Japanese then conducted heavy aerial bombardment on the single Chinese division, forcing it to withdraw into Linyi. During this time, Zhang Zizhong's 59th Army, also a Northwestern unit, had moved eastwards from Xuzhou along the Longhai railway, passing Tai’erzhuang before advancing northwards towards Linyi. It crossed the Yi River on 12 March and attacked the Japanese left flank, engaging them from 13 to 18 March, during which the 39th Division managed to push the Japanese out of the Linyi region. Pursued by the Chinese from two directions, the Japanese were forced to withdraw, losing almost two entire battalions in the process. This engagement broke the myth of Japanese invincibility and also humiliated Japanese commander Seishirō Itagaki, even shocking the IJA headquarters. Although the Japanese 5th Division later regrouped and tried again, it had lost the element of surprise. The Japanese defeat at Linyi at the hands of the inferiorly trained and equipped Chinese regional units set the scene for the eventual battle at Tai’erzhuang .\n|-\n|Northern\n|Of the three Japanese divisions driving into the Chinese 5th War Area, the 10th Division, commanded by Rensuke Isogai, was the most successful. Setting out from Hebei, it crossed the Yellow River and moved southwards along the Jinpu railway. With KMT General Han Fuju having ordered his forces to desert their posts, the Japanese successfully captured Zhoucun and moved into Jinan without meeting any resistance at all. The Japanese then advanced southwards along two columns from Tai'an. The eastern column captured Mengyin  before pushing westwards to capture Sishui .\nThe western column advanced south-westwards along the Jinpu railway, capturing Yanzhou, Zouxian, and Jining, before driving north-westwards to capture Wenshang. Chiang Kai-shek then ordered Li Zongren to utilize 'offensive defense' ), i.e. seizing the initiative to actively attack, instead of passively defending. Thus, Li deployed Sun Zhen's 22nd Group Army to attack Zouxian from the south while Pang Bingxun's 40th Division advanced northwards along the 22nd's left flank to attack Mengyin and Sishui. Sun Tongxuan's 3rd Group Army also advanced from the south, launching a two-pronged attack on the Japanese at Jining. Fighting fiercely from 12 to 25 February, the respectable combat performance of the 12th Corps in particular helped to ameliorate the reputational damage that Han Fuju had otherwise inflicted upon on the Shandong units. The Japanese made some strategic changes as a result of these Chinese counterattacks: they cancelled their original plan of directly advancing westwards from Nanjing to Wuhan, so that more troops could be spared for the push towards Xuzhou.\n|}\nBattle\nOpening shots (March 15 – March 21)\nOn March 15, the Japanese 10th Division attacked the Chinese 122nd Division centered around Tengxian and Lincheng. Chinese reinforcements from the 85th Corps arrived the next day, but were forced back on March 17. The Japanese, with the support of planes, tanks and heavy artillery, broke through the Chinese lines on March 18.\nThe Chinese remnants, bolstered by the 52nd Corps, retreated to the town of Yixian. The Japanese attacked the town, and destroyed an entire Chinese regiment in a fierce 24-hour battle. On March 19, the Japanese began their advance on the walled town of Taierzhuang.\nFighting outside Taierzhuang (March 22 – March 28)\nTo counter the threat, the Chinese 2nd Army Group under General Sun Lianzhong was deployed to Taierzhuang. The 31st Division under General Chi Fengcheng reached the town on March 22, and was ordered to delay the Japanese advance until the rest of the Army Group arrived.\nOn March 23, the 31st Division sallied out of Taierzhuang towards Yixian, but was attacked by two Japanese battalions reinforced by three tanks and four armored cars. The division took positions on a series of hills, and were able to defend against a Japanese regiment of 3,000 men for the rest of the day.\nOn March 24, a Japanese force of 5,000 men attacked the 31st Division. Another Japanese unit attacked the Chinese from Yixian, forcing them to withdraw to Taierzhuang itself. The Japanese attacked the town, and a 300-strong contingent successfully breached the north-eastern gate at 8pm. However, they were then forced back into the Chenghuang temple. The Chinese then set fire to the temple, killing the entire Japanese force. The next day, the Japanese launched another assault through the breached gate and secured the eastern portion of the district, before also breaching the north-western corner from the outside and capturing the Wenchang Pavilion.\nOn March 25, a Japanese morning attack was repelled. The Japanese followed up by shelling the Chinese positions with artillery and airstrikes. In the afternoon, the Chinese deployed an armored train towards Yixian. The train ambushed a column of Japanese soldiers near a hamlet, killing or wounding some 70 Japanese troops before quickly retreating back to Taierzhuang. When night fell, three thousand Chinese troops rushed out of the gates and attacked the Japanese lines under cover of darkness, forcing them back to the northeast by dawn.\nThe next three days would see the Chinese defenders subjected to continuous aerial and artillery bombardment. The Chinese were able to repulse several successive Japanese assaults, but suffered thousands of casualties in the process. On March 28, Chinese artillery support arrived in the form of two 155mm and ten 75mm pieces. On the night of March 29, the Japanese finally managed to breach the wall.\nSetting out from the south of the district, a Chinese assault squad stormed the Wenchang pavilion from the south and east, killing the entire Japanese garrison with the exception of four Japanese troops taken as POWs. The Chinese had thus retaken the north-western corner of the district.\nUrban fighting inside Taierzhuang (March 29 – April 5)\nThe Japanese attack into Taierzhuang devolved into a desperate hand-to-hand combat that lasted into the next day. The fighting in Taierzhuang's streets and alleys was characterized by fierce close quarters combat \"very similar to the costly urban battles that Europe was soon to see,\" with combatants often confronting each other face to face.\nOut of an initial squad of 57 Chinese soldiers tasked with capturing a building, only 10 survived. One participant described the brutal conditions of the battle:\n\"The battle continued day and night. The flames lit up the sky. Often all that separated our forces was a single wall. The soldiers would beat holes in the masonry to snipe at each other. We would be fighting for days over a single building, causing dozens of fatalities.\"The conditions were so brutal that Chinese officers implemented severe measures to maintain discipline. Junior officers were repeatedly forbidden to retreat, often ordered to personally replace casualties within their ranks. Li Zongren personally threatened Tang Enbo that if he did not carry out his duty, he would \"be treated as Han Fuju had been.\"\nIn Taierzhuang's cramped conditions, Japanese advantages in artillery and air superiority were rendered useless; whenever either was employed in the congested melee, as many Japanese were killed as Chinese. The fighting in Taierzhuang's streets was thus fought almost entirely by infantry, with each side relying on rifles, pistols, hand grenades, bayonets, and knives. The battle was fought hand-to-hand, often in darkness. The stone structures of Taierzhuang also provided sufficient cover from fire and projectiles. Historian Peter Harmsen notes that it was in these close-quarters conditions where Chinese soldiers were able to fight as the equals, if not the superiors of their Japanese enemies, as shown in the Shanghai suburb of Luodian the year prior.\nantitank gun]]\nSheng Cheng, based on the battle memories of General Chi Fengcheng, described the fighting: \"We had a battle for the little lanes [of the town], and unprecedently, not just streets and lanes, but even courtyards and houses. Neither side was willing to budge. Sometimes we'd capture a house, and dig a hole in the wall to approach the enemy. Sometimes the enemy would be digging a hole in the same wall at the same time. Sometimes we faced each other with hand grenades - or we might even bite each other. Or when we could hear that the enemy was in the house, then we'd climb the roof and drop bombs inside - and kill them all.\" On March 31, General Sun Lianzhong arrived to take command of the 2nd Army Group. A Japanese attack later that day was repulsed, but a Chinese counterattack was also fought to a halt.\nto use in an attack on Japanese tanks. ]]\nAt 4am on April 1, the Japanese attacked the Chinese lines with support from 11 tanks. The Chinese defenders, equipped with German-made 37mm Pak-36 antitank guns, destroyed 8 of the armored vehicles at point-blank range. Similar incidents would repeat throughout the battle, with many Japanese tanks being destroyed by Chinese artillery and suicide bombers. In one skirmish, Chinese suicide bombers obliterated four Japanese tanks with grenade bundles.\nThat same day, Chiang ordered via telegram to his generals that \"the enemy at Taierzhuang must be destroyed.\"\nOn April 2 and 3, the Japanese deployed tear gas against Chinese positions in the town's north station, but failed to dislodge the defenders. They then followed up with a massive armored attack outside the city walls with 30 tanks and 60 armored cars, but were only able to push the Chinese 27th Division back to the Grand Canal.\nThe fighting continued to rage throughout April 4 and 5. By this point, the Japanese had taken two thirds of Taierzhuang, although the Chinese still held Taierzhuang's South Gate. It was through this entry point where the Chinese command was able to resupply their troops successfully. The Chinese were also able to prevent the Japanese from restocking their own supplies of arms and bullets. In doing so, the Japanese attackers were worn down slowly.\nChinese encirclement outside Taierzhuang (March 26 – April 7)\nThe deadlock of the battle was broken by events occurring outside Taierzhuang, where fresh Chinese divisions had encircled the Japanese forces in Taierzhuang from the flanks and rear. Having consulted their German advisors earlier, the commanders of the 5th War Area had prepared a double envelopment of the outstretched Japanese forces in Taierzhuang.\nBetween March and April 1938, the Nationalist Air Force of China deployed squadrons from the 3rd and 4th Pursuit Groups of fighter-attack planes in the long-distance air-interdiction and close-air support of the Taierzhuang operations. Some 30 aircraft, mainly Soviet models, were deployed in bombing raids against Japanese positions.\nOn 26 March, Tang Enbo's 20th Army, whom were equipped with artillery units, attacked Japanese forces in Yixian, killing half of the Japanese defenders and routing the rest. Tang then turned his forces south and attacked the Japanese flank northeast of Taierzhuang. At the same time, the Chinese 55th Corps of two divisions made a surprise crossing across the Grand Canal and cut the railway line near Lincheng. As a result, Tang had cut off the Japanese attackers from the rear, severing their supply lines.\nOn April 1, the Japanese 5th Division dispatched a brigade to relieve the surrounded 10th Division. General Tang countered this move by blocking the brigade's advance and then attacking from the rear, forcing them south into the encirclement. On 3 April, the Chinese 2nd Group Army launched a counter-offensive, with the 30th and 110th Divisions fighting northwards into Beiluo and Nigou respectively. On 6 April, the Chinese 85th and 52nd Army linked up at Taodun, just west of Lanling. The combined force then drove north-westwards, capturing Ganlugou. Two more Chinese divisions arrived a few days later.\nJapanese retreat (April 5–7)\nBy April 5, The Japanese units inside Taierzhuang were surrounded by seven Chinese divisions to the north and four more to the south. By this point, the Japanese divisions in Taierzhuang had run critically low on ammunition, fuel, and food and water, and many of their troops were suffering from fatigue and dehydration after over a week of intense fighting.  The Chinese forces, sensing victory, were reinvigorated with rage and attacked the trapped Japanese troops, executing wounded Japanese soldiers where they lay with rifle and pistol shots. Chinese soldiers also deployed Soviet tanks against the Japanese defenders. Japanese artillery were unable to return fire for lack of shells, whilst their tanks were immobilized without fuel. Japanese attempts at airdroping supplies failed, and most of the packages fell into Chinese hands. Gradually, Japanese infantry were reduced to machine gun and mortar fire, then their rifles and machine guns, and finally bayonet charges.\nWith the various Chinese counter-attacks all accomplishing their objectives, the Japanese line finally collapsed on April 7. Both the 10th and 5th Divisions, having been bled dry of men and ammunition, were forced into retreat.\nAround 2,000 Japanese soldiers fought their way out of Taierzhuang, leaving behind thousands of their dead. Some of the soldiers who left committed hara kiri. Chinese casualties were roughly the same, a significant improvement over the costly campaigns in Shanghai and Nanjing.\nReasons for the Japanese failure\nSome of the most critical reasons for the Japanese failure are as follows:\n#In the prelude to the battle, the Japanese were hampered by the 'offensive defensive' operations conducted by the various Chinese regional units, which effectively prevented the three Japanese divisions from ever achieving their objective of linking up with one another.\n#Despite repeatedly deploying heavy artillery, air strikes, and gas attacks, the Japanese were unable to force the Chinese 2nd Group Army from Tai’erzhuang and its surrounding regions, even as the defenders risked complete annihilation.\n#The Japanese failed to prevent the Chinese 20th Group Army's maneuver around their rear positions, which cut off their retreat routes and gave the Chinese the advantage of a counter-encirclement.\n#Following Han Fuju's insubordination and subsequent execution, the Chinese military's high command rigorously adjusted the tone at the top by clamping down on military discipline, which pervaded down throughout the ranks and resulted in even the most junior soldiers willing to risk their lives in the course of carrying out their orders. For example, a \"dare to die corps\" was effectively used against Japanese units. They used swords and wore suicide vests made out of grenades.\nDue to lack of anti-armor weaponry, suicide bombing was also used against the Japanese. Chinese troops, as part of the \"dare-to-die\" corps, strapped explosives like grenade packs or dynamite to their bodies and threw themselves under Japanese tanks to blow them up. Dynamite and grenades were strapped on by Chinese troops who rushed at Japanese tanks and blew themselves up.\nCasualties\nFrank Dorn, an American military officer stationed in China between 1934 and 1939, recorded that some 16,000 Japanese soldiers were killed in action on the Taierzhuang battlefield. American historian Stephen MacKinnon estimates between 15,000 and 20,000 Japanese troops died in the fighting. The Chinese claimed to have killed upwards of 24,000 Japanese troops, in addition to shooting down 3 aircraft and destroying or capturing 40 tanks.\nBritish historian Rana Mitter provides a lower number, estimating that roughly 8,000 Japanese soldiers died in the fighting. Western historians Richard B Frank and Hans Van De Ven provide similar numbers, both estimating the number of fallen Japanese to be about 8,000. Western historians Peter Harmsen and Micheal Clodfelter estimate the Japanese suffered 20,000 killed and wounded, including 8,000 killed in action.\nThe Japanese also suffered significant losses in material. Due to a lack of fuel and the hasty Japanese retreat, many of their tanks, trucks and artillery pieces were abandoned on the battlefield to be captured by the Chinese. Frank Dorn recorded the Japanese lost 40 tanks, over 70 armored cars, and 100 trucks of various sizes. In addition to vehicles, the Japanese also lost dozens of artillery pieces and thousands of machine guns and rifles. Many of these weapons were collected by the Chinese forces for future use.\nThe Chinese for their part also suffered grievous casualties. Peter Harmsen and Stephen MacKinnon wrote that Chinese casualties matched Japanese losses in magnitude, roughly 20,000 in total. Frank Dorn reported that over 15,000 Chinese soldiers perished in the fighting, with at least that many wounded for a total of over 30,000 Chinese casualties. In General Chi Fengcheng's 31st Division alone, only 2,000 survivors out of an initial strength of 9,000 were fit to assemble for roll call after the battle. Taierzhuang itself was almost completely destroyed.\nThe Japanese claim in their combat reports that the withdrawal was due to command and communication failures, and do not portray a decline in ammunition types amongst their troops. A Japanese historical team listed figures of some 2,130 killed and 8,580 wounded for Japanese casualties in the Taierzhuang area. The Imperial Japanese Army's 5th and 10th Divisions recorded that between February and May 1938, they lost some 2,369 killed and another 9,615 wounded, however these figures include other operations and units not present at Taierzhuang.\nChinese Historian Jiang Keshi analysis of Japanese records indicated that of the two main units present, the 10th Division's Seya Task Force suffered 411 dead and 1,319 wounded. Another 392 horses, four artillery pieces, 17 machine guns, 145 rifles, 4 tanks, and 7 tankettes, along with some fifty vehicles were also lost. Jiang was unable to locate complete records for the other main unit—the 5th Division's Sakamoto Task Force—but based on surviving partial records estimated their losses could be around 600-700 casualties and concluded the total casualties for the Japanese participating forces at Taierzhuang were less than 2500.\nAftermath\nThe defeat was a significant blow to the Japanese military. It was the first major Japanese defeat since the beginning of the war, broke the myth of Imperial Japanese military invincibility, and resulted in an incalculable benefit to Chinese morale, military and non-military. Li Zongren said that the victory \"was the first happy occasion since the war of resistance had started,\" and that Taierzhuang became \"a symbol of national renaissance.\" General Feng Yuxiang compared the trapped Japanese in the Ta Kung Pao newspaper to \"soft-shelled turtles in a closed jar.\"\nAmid the celebrations of the victory in Hankou and other Chinese cities, Japan initially denied its defeat and ridiculed the reports of the battle for days. The battle was reported on by the New York Times.\nCommemoration\nIn 2006, the  became a National priority protected site as no. 981 of the .\nReferences\n*\n*\n*\n*\n}}\n;Sources\n* Cheung, Raymond. Osprey Aircraft of the Aces 126: Aces of the Republic of China Air Force. Oxford: Bloomsbury Publishing Plc, 2015. .\n* Hsu Long-hsuen and Chang Ming-kai, History of The Sino-Japanese War (1937–1945) 2nd ed., 1971. Translated by Wen Ha-hsiung, Chung Wu Publishing; Taipei, Taiwan. pp.&nbsp;221–230. Map. 9–1\n* Xú, Lùméi. Fallen: A Decryption of 682 Air Force Heroes of The War of Resistance – WWII and Their Martyrdom. 东城区, 北京， 中国: 团结出版社, 2016. .\nExternal links\n*"
    }
  ]
}