{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Lababia Ridge\n\n| result      = Allied victory\n| combatant1  =\n| combatant2  =\n| commander1  =  Frederick Wood Walter Dexter\n| commander2  =  Katsutoshi Araki\n| units1      = 2/6th Infantry Battalion\n| units2      = 66th Infantry Regiment\n| strength1   = 80–150\n| strength2   = 1,500\n| casualties1 = 11 killed, 12 wounded\n| casualties2 = 41 killed, 131 wounded\n}}\nThe Battle of Lababia Ridge was fought from 20–23 June 1943 in the Territory of New Guinea during World War II. Part of the Salamaua–Lae campaign, the battle involved Australian and Japanese troops who clashed on the ridge, which was about  south of Salamaua, near Mubo, over the course of several days. The battle was fought in conjunction with several other actions in the region as the Allies attempted to draw Japanese attention away from Lae, where they launched seaborne landings in mid-September 1943, in conjunction with airborne landings around Nadzab. The fighting around Lababia Ridge took place at the same time as the Battle of Mubo, after two battalions of Japanese infantry launched a counter-attack on a depleted Australian company. The Australians, supported by Royal Australian Air Force fighter-bombers, managed to hold off the initial Japanese attacks before being reinforced by another depleted company. Fighting continued over the course of three days before the Japanese withdrew.\nBackground\nIn March 1943, Australian troops from the 2/7th Infantry Battalion had pushed forward from Wau, which had been secured in late January and set up a defensive position on Lababia Ridge a  feature about   south of Salamaua, near Mubo, which was situated around the Bitoi and Buyawim Rivers that was, according to historian John Miller, strategically important as it provided clear observation of \"Nassau Bay to the southeast, Bitoi Ridge to the north, and the Komiatum Track which served as the line of communications from Salamaua to the Japanese facing the Australians\".\nAfter several failed attacks on the Pimple in early May during the fighting around Mubo, Captain Leslie Tatterson's company, consisting of just 65 men, had withdrawn from the Pimple towards Lababia Ridge, establishing a position was forward of the main Australian base camp on the western end of the ridge. On 9 May, they came under heavy attack as the Japanese launched a concerted counter-attack over the course of several days. It was eventually turned back, with heavy Japanese casualties.\nBattle\nOn 23 May, the commander of the Australian 17th Brigade, Brigadier Murray Moten, issued orders for the 2/6th Infantry Battalion, under the command of Lieutenant Colonel Frederick Wood, to relieve the 2/7th around Lababia Ridge. The advanced elements of the battalion stepped off on 27 May. Moving along the narrow Buisaval Track, the going was slow; while they waited for their relief, the 2/7th continued patrolling the area and the day that the 2/6th set out towards them, there was further fighting around the Pimple when a small group of Australians were engaged by a Japanese strong point during a reconnaissance patrol, resulting in the loss of two Australians killed. The 2/6th arrived on 11 June, after which the 2/7th moved back towards Wau and Bulolo, where they were placed into the role of divisional reserve.\nUpon effecting their relief of the 2/7th, Wood positioned his battalion with companies at Mat Mat Hill, Waipali and the Saddle, while battalion headquarters was positioned at Guadagasal. Another company, 'D' Company, under the command of Captain Walter Dexter occupied Lababia Ridge,  occupying a position further up the slope, but further south than that which Tatterson's company had held. They had been dispatched earlier in May to support the 2/7th's right flank, and had carried out several reconnaissance patrols towards Duali and the coast, to gather information prior to the landing of US troops around Nassau Bay. In late May, the Japanese high command determined that they would attempt to force the Australians off Lababia Ridge, and began making preparations for an assault, rotating their forces in the area, with the exhausted 102nd Infantry Regiment, which had been fighting the Australians since the Battle of Wau, being replaced by two battalions of the 66th Infantry Regiment, under the command of Colonel Katsutoshi Araki.\nSupplies and ammunition were brought up towards the position along the steep slope from the Komiatum Ridge, and on 20 June, Japanese patrols from the 66th, with guides from the 102nd, began probing the Australian position on Lababia Ridge, which was held by about 80 men. Japanese sappers defused the booby traps that the Australians had created out of piano wire and hand grenades, but being unfamiliar with the mechanisms of the Australian grenades, left them in place, rather than using them against the defenders. Sporadic firing occurred throughout the day, but no major attack developed. The following day, 21 June, Australian patrols noticed signs of Japanese activity along the track towards the observation post that had been established further east along the ridge. Around 07:30 the telephone line to the post was cut and shortly afterwards, Japanese troops approaching the main Australian position began setting off booby traps that had been set up as early warning devices. Around 14:00 the Japanese launched an assault from the north and north-east of the Australian position, supported by mortars. This was repelled, but followed up by another attack in the early afternoon, including a bayonet charge. Over the course of the afternoon, a total three attacks were made to the sound of bugle calls. While intended to frighten the Australian soldiers, these actually served to warn the defenders of their approach.\nThese attacks were as turned back and during the night the Australian company was reinforced by another platoon &ndash; 'C' Company's 13 Platoon, under Corporal Keith Mew &ndash; consisting of about 70 men. As it grew dark, the Australians sent out a patrol to make contact with their forward positions, and subsequently found that they had been wiped out in the attack. Meanwhile, amidst heavy rain, the Japanese recovered their wounded and continued to reduce the booby traps in front of the Australian positions. Over the course of 22 and 23 June more Japanese attacks took place as Araki's two battalions from the  66th Infantry Regiment, consisting of about 1,500 men, attempted to take the position. Despite numerical superiority, these attacks were repelled by the Australians who received close air support from Royal Australian Air Force Bristol Beaufighter aircraft, which strafed the attacking Japanese infantrymen after the Australians marked their forward positions with smoke. During 22 June, the Japanese brought up a mountain gun, but this proved inaccurate and ineffective, with only two rounds landing within the Australian position; meanwhile, probing attacks on the Australian flanks were broken up by Australian mortar fire. The fighting continued early the following day, with the Japanese laying down heavy machine gun and mortar fire, but this was only designed to help cover their withdrawal. The fighting subsequently ceased early in the afternoon of 23 June when the Japanese, lacking further reinforcements with which to continue the fight, discontinued their attacks.\nAftermath\nCasualties amounted to 41 or 42 killed and 131 wounded for the Japanese, and 11 killed and 12 wounded for the Australians. Left mainly to his own devices during the battle, for his leadership during the main Japanese assault on the Australian positions around Lababia Ridge, Dexter was later awarded the Distinguished Service Order, while several of the Australian platoon commanders &ndash; Lieutenants Edward Exton and Laurence Roach &ndash; received Military Crosses, and one of the platoon sergeants, Sergeant John Hedderman, received a Military Medal. The Australian brigade commander, Moten, later singled Dexter out for praise, stating that he had taken \"...every trick\" during the battle. One of his peers, Captain Jo Gullett described him as a \"...too exacting to be popular\" although he was a \"...thorough soldier, a good trainer of men and a painstaking tactician\". He later went on to command the 61st Infantry Battalion.\nFollowing actions around Lababia Ridge, further fighting in the Salamaua area followed as the Allied advance towards the coast pushed the Japanese back. Advancing towards Salamaua in an effort to draw reinforcements away from Lae, where a seaborne landing was planned for mid-September in conjunction with an airborne landing at Nadzab to capture the town in a pincer movement, further actions were fought by Australian and US forces at Bobdubi, Mount Tambu, Nassau Bay, and Roosevelt Ridge. Salamaua was eventually taken on 11 September 1943. Lae fell shortly afterwards. In the aftermath, the Japanese withdrew towards the north coast. The Australians subsequently pursued them into the Markham and Ramu Valleys.\nReferences\nCitations\nBibliography\n*\n*\n*\n*\n*\nExternal links\n* [http://www.diggerhistory.info/pages-battles/ww2/salamaua.htm The Battles For and Around Salamaua]\n* [https://web.archive.org/web/20080116014658/http://www.ww2australia.gov.au/pushingback/wausalamaua.html Pushing Back: Wau to Salamaua]"
    }
  ]
}