{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Fair Garden__disambig_1\n\n}}\n|place=Sevier County, Tennessee\n|result=Union victory\n|combatant1=  United States (Union)\n|combatant2=  CSA (Confederacy)\n|commander1=Samuel D. Sturgis  Edward M. McCook\n|commander2=William T. Martin\n|units1=Army of the Ohio\n|units2=Department of East Tennessee\n|strength1=1 cavalry division\n|strength2=1 cavalry division\n|casualties1=100\n|casualties2=165\n|}}\nThe Battle of Fair Garden was a minor cavalry battle of the American Civil War between the Army of Ohio and The Department of East Tennessee, occurring on January 27, 1864, in Sevier County, Tennessee. Despite the small size of the battle, both sides incurred considerable casualties.\nBackground\nFollowing the Battle of Dandridge on January 16–17, Union cavalry moved to the south side of the French Broad River, where they disrupted Confederate foraging parties and captured numerous loaded supply wagons in that area. On January 25, 1864, Lt. Gen. James Longstreet, commander of the Department of East Tennessee, instructed his subordinates to curtail Union operations south of the French Broad. On January 26, Brig. Gen. Samuel D. Sturgis, having had previous brushes with Confederate cavalry, deployed his troopers to watch the fords in the area. Two Confederate cavalry brigades and artillery advanced from Fair Garden in the afternoon but were checked about four miles from Sevierville. Other Confederates attacked a Union cavalry brigade, though, at Fowler's on Flat Creek, and drove it about two miles. No further fighting occurred that day.\nFair Garden Road\nUnion scouts observed that the Confederates had concentrated on the Fair Garden Road, so Sturgis ordered an attack there in the morning of January 27. In a heavy fog, Col. Edward M. McCook's Union division attacked and drove back Maj. Gen. William T. Martin's Confederates. At about 4:00&nbsp;p.m., McCook's men charged with sabers and routed the Confederates. Sturgis set out in pursuit the next day, capturing and killing more of the routed and disorganized Rebels. As the Union force reached the French Broad River near Dandridge, they saw three of Longstreet's infantry brigades crossing the river. Realizing that he was outgunned, Sturgis prudently decided to evacuate the area. Sturgis then tried to attack Brig. Gen. Frank C. Armstrong's Confederate cavalry division encamped about three or four miles away by the river. Unaware that Armstrong had been reinforced, Sturgis suffered severe casualties in the assault. The battle continued until dark, when the Federals retired from the area. The Federals had initially won the tactical battle, but then lost the foraging grounds when forced to withdraw. There were about 100 Union casualties, and the Confederates lost about 165 men.\nMisjudged\nSturgis set out in pursuit on January 28, and captured and killed more of the routed Rebels. The Union forces, however, observed three of Longstreet's infantry brigades crossing the river. Realizing his weariness from fighting, lack of supplies, ammunition, and weapons, and the overwhelming strength of the enemy, Sturgis decided to evacuate the area. But, before leaving, he determined to attack Brig. Gen. Frank C. Armstrong's Confederate cavalry division, which he had learned was about three or four miles away, on the river. Unbeknownst to the attacking Federals, Armstrong had strongly fortified his position and three infantry regiments had arrived to reinforce him. Thus, the Union troops suffered severe casualties in the attack. The battle continued until dark, when the Federals retired from the area.\nReferences\nSources\n}}\nExternal links\n*[https://web.archive.org/web/20060526093851/http://www.cr.nps.gov/hps/ABPP/battles/tn029.htm National Park Service battle description]\n*[https://web.archive.org/web/20121024050445/http://www.cr.nps.gov/hps/abpp/CWSII/TennesseeBattlefieldProfiles/Dandridge%20to%20Fort%20Henry.pdf CWSAC Report Update and Resurvey: Individual Battlefield Profiles]\n*https://web.archive.org/web/20140524014512/http://www.tnvacation.com/civil-war/place/2093/battle-of-fair-garden/"
    }
  ]
}