{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Velasco__disambig_1\n\n|result      = Texian victory\n|combatant1  =\n|combatant2  =  Texian Militia\n|commander1  =  Domingo de Ugartechea\n|commander2  =  John Austin\n|strength1   = ~100 infantry1 artillery piece1 fort\n|strength2   = ~125\n|casualties1 = 5 killed16 wounded\n|casualties2 = 7 killed14 wounded\n}}The Battle of Velasco, fought June 25-26, 1832, was the first true military conflict between Mexico and Texians in the Texas Revolution, colloquially referred to as the \"Boston Harbor of Texas\". It began when the Texian Militia attacked Fort Velasco, located in what was then Velasco and what is now the city of Surfside Beach. The Mexican commander during the conflict, Domingo de Ugartechea, tried to stop the Texians, under John Austin, from transporting a cannon down the Brazos River to attack the city of Anahuac. The Texian Militia eventually prevailed over the Mexicans. Ugartechea surrendered after a two-day battle, once he realized he would not be receiving reinforcements, and his soldiers had almost run out of ammunition.\nBackground\nAfter Mexico won independence from Spain in 1821, it legalized immigration from the United States. It granted contracts to empresarios to settle immigrants from the United States and Europe in Mexican Texas.  There were few Mexicans living at the time in the eastern section of this territory but, as the number of Anglo speakers living in Texas increased, Mexican authorities began to fear the United States would want to annex Texas. On April 6, 1830 the Mexican government passed a series of laws restricting immigration from the United States into Texas. The laws also canceled all unfilled empresario contracts and established customs houses in Texas to enforce the collection of customs duties. Mexican military officer Juan Davis Bradburn, formerly a United States citizen, was appointed commander of a new customs and garrison post on Galveston Bay. In October 1830, Bradburn established a post atop a  bluff at the entrance to the Trinity River. The post became known as Anahuac.\nIn 1832, Mexican authorities established a small garrison at Velasco, a small community on the eastern bank of the Brazos River.  The new post would have jurisdiction over all commerce entering the river from the Gulf of Mexico. A log stockade was built on flat ground approximately  from the Brazos River, and an equal distance from the Gulf of Mexico. The stockade had an inner and an outer wall, with the  between them filled with sand, earth, and shells. An embankment along the inner wall allowed musketeers to shoot without exposing more than their heads. In the center of the stockade, another embankment provided a mounting place for a nine-pound cannon. The cannon was on a swivel and could guard the entire mouth of the river, but was unable to point downwards to aim into the immediate vicinity. Approximately 100&nbsp;troops were garrisoned at the fort, under the command of Colonel Domingo de Ugartechea.\nPrelude\nBradburn was deeply unpopular with the Texian settlers. Tensions escalated in May 1832, when Bradburn arrested a local man, William Barret Travis, on charges of attempted insurrection to separate the territory from Mexico. Conviction on this charge would lead to Travis's execution. When Travis's business partner, Patrick Jack, made threats against Bradburn, he was also arrested. Jack's brother organized a contingent of men to march from Brazoria to Anahuac. As the march began, John Austin, a member of the Brazoria Ayuntamiento, stopped to consult with Ugartechea, who recommended that Austin request that the men be remanded into civilian custody while they awaited a ruling from Bradburn's superior. When presented with this request, several Mexican officers explained to Austin that the laws prevented them from turning the men over to civilian authorities. Placated, Austin returned home; on his arrival he learned that Bradburn's men had arrested several Texians on suspicion of stealing horses. Austin was outraged and returned to Anahuac to join other Texian volunteers.\nBy early June, over 150 Texian Militia had gathered under the command of Frank W. Johnson. On June 10, the insurgents occupied Anahuac and after a brief engagement with Mexican troops, the Texians withdrew to Turtle Bayou. Taking advantage of the civil war engulfing the Mexican interior, the Texians drafted the Turtle Bayou Resolutions. In this document, they declared themselves federalists who supported rebellious Mexican general Antonio López de Santa Anna and decried \"the present dynasty\" that gave them military order instead of civil authority. The resolutions encouraged other colonists to join them in laying siege to Anahuac.\n|align=right|width=25em}}\nAfter the resolutions were adopted on June 13, the group determined that Austin, Henry Stevenson Brown, and William J. Russell would go to Brazoria to recruit reinforcements and retrieve several cannon that belonged to private citizens. No further attacks would take place in Anahuac until the cannon and reinforcements arrived.\nOn June 20, residents of Brazoria gathered in a town meeting to decide whether to support further armed resistance. The residents appointed a five-member committee to determine future actions. After some debate, the committee, which included Edwin Waller and Russell, unanimously voted for war. The larger group accepted their recommendations and declared opposition to the current administration. Austin was appointed to command the Texian Militia company, which comprised between 100 and 150 men. Austin quickly proposed that the group be given permission to attack the closest Mexican military installation, Fort Velasco, if necessary. This was the second time Austin had tried to get support to attack Velasco; his first attempt, on May 11, had been defeated by a single vote.  This time, the new company agreed to the plan.\nDeciding that it would be easiest to transport the cannon by boat down the Brazos River to the Gulf of Mexico, the men loaded the cannon onto the schooner Brazoria. Austin sent four men to Velasco to inform Ugartechea of their intent to transport cannon down the Brazos River. Ugartechea indicated that he would not allow the ship to pass; he knew that the cannon were most likely intended to create additional havoc in Anahuac.\nBattle\nAt 10 a.m. on June 22, Austin and his men left Brazoria for the  trip to the fort. Approximately 40 men boarded the Brazoria for the journey downstream, while the remaining men travelled overland. Russell was given command of the men aboard ship. Because only three of the volunteers had any familiarity with sailing, one of the mates of the Brazoria agreed to accompany the Texian Militia to ensure the ship arrived at its destination. Russell agreed that the seaman would not have to participate in the battle.\nOn the night of June 25, the Texians approached the fort. The schooner was anchored at a spot  from the fort. Ground forces were split into two groups, commanded by Brown and Austin. Brown's men would circle the fort and approach from the Gulf of Mexico side, using driftwood as cover. Austin's men would approach from the north, where there was no natural cover. To protect themselves, this group fashioned makeshift shields out of cypress. The shields were  thick and were supported by moveable legs.\nShortly before midnight, the Texians attacked. During the incessant firing that followed, Mexican troops shot out the Brazorias mooring lines. The ship ran aground on the bank. Texians soon ran low on ammunition for the cannon, but as the ship was fairly close to the fort, riflemen continued to fire. Mexican troops charged the schooner but were driven back. Austin's men discovered that their portable palisades were ineffective against Mexican marksmen; after the battle one shield alone had 130&nbsp;holes. To protect themselves, Austin's men took time to dig trenches in the sand.\nThirty minutes after sunrise, a downpour began and the Texians retreated. Austin sent James Bailey back to Brazoria to gather reinforcements. Mexican troops were almost out of ammunition and Ugartechea surrendered.\nAftermath\nTexians refused the first surrender proposal, which would allow the Mexican soldiers to leave Texas with all of their arms. After further negotiations between two of Ugartechea's representatives, Lieutenant More and Ensign Rincon, and two of Austin's representatives, William H. Wharton and Russell, Mexican soldiers were given permission to march out \"with their arms, ammunition, and baggage\" to a ship which would take them to Matamoros. The Mexican cannon and swivel gun would remain at Fort Velasco in the custody of the Texians. Wounded Mexican soldiers would remain in Texas and be cared for with \"good treatment and hospitality\". Soldiers would take only the provisions they needed for the journey, with the rest remaining with the Texians.\nFive Mexican troops were killed and sixteen were wounded. The Texians lost seven killed and fourteen wounded. One of the Texian casualties was the seaman from the Brazoria. When the battle began, Russell had sent the seaman below decks so that he would be safe. The man was killed when a Mexican cannon shot crashed through the side of the ship. The sustained bombardment had damaged the Brazoria, making it ineffective for transportation of the cannon. The Texians regrouped and prepared to march overland to Anahuac. As they readied for departure, they learned that Bradburn had resigned his position and the prisoners had been released. Austin and his men chose to remain in Brazoria.\nSee also\n*Texian Militia\n*List of conflicts involving the Texas Military\nReferences\nSources\n*\n*\n*\n*\n*\n*\n*"
    }
  ]
}