{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Bathys Ryax__disambig_1\n\n, [http://asiaminor.ehw.gr/forms/fLemmaBodyExtended.aspx?lemmaid=7934&boithimata_State=&kefalaia_State=#chapter_3 Chapter 3].\n| place       = Bathys Ryax (modern Kalınırmak pass, Sivas)\n| result      = Byzantine victory\n| combatant1=Paulician principality of Tephrike\n| combatant2=Byzantine Empire\n| commander1  = Chrysocheir\n| commander2  = Christopher\n| casualties1 = Extremely heavy\n| casualties2 = Light\n|campaignbox=\n}}\nThe Battle of Bathys Ryax was fought in 872 or 878 between the Byzantine Empire and the Paulicians. The Paulicians were a Christian sect which—persecuted by the Byzantine state—had established a separate principality at Tephrike on Byzantium's eastern border and collaborated with the Muslim emirates of the Thughur, the Abbasid Caliphate's borderlands, against the Empire. The battle was a decisive Byzantine victory, resulting in the rout of the Paulician army and the death of its leader, Chrysocheir. This event destroyed the power of the Paulician state and removed a major threat to Byzantium, heralding the fall of Tephrike itself and the annexation of the Paulician principality shortly after.\nBackground\n.]]\nThe Paulicians were a Christian sect whose precise origins and beliefs are somewhat obscure: Byzantine sources portray them as dualists, while Armenian sources maintain that they were an adoptionist sect. The Paulicians were fiercely iconoclastic, adhered to a very distinct Christology, and rejected the authority and practices of the official Byzantine Church, following their own leaders. Consequently, they were persecuted by the Byzantine state as early as 813, despite the emperors' official support for iconoclasm. After the definitive end of Byzantine Iconoclasm in 843, that persecution was intensified: in an attempt, unique in Byzantine history, to eradicate an entire \"heretical\" sect, orders were sent out to kill anyone who would not recant. According to the chroniclers, up to 100,000 Paulicians were massacred, while the remnants fled from their strongholds in east-central Anatolia, and found refuge among the Empire's Muslim enemies, the Arab emirates of the Thughur, the Arab–Byzantine frontier zone along the Taurus–Antitaurus mountain ranges. With support from the emir of Melitene, Umar al-Aqta, the Paulician leader Karbeas founded a separate principality at Tephrike, and for the next decades, the Paulicians campaigned alongside the Arabs against Byzantium.\nThe Arabs and Paulicians suffered a critical blow in 863 with the defeat and death of Umar at the Battle of Lalakaon and the death of Karbeas in the same year, but under their new leader, Chrysocheir, the Paulicians resumed their raids deep into Byzantine Anatolia, raiding as far as Nicaea and sacking Ephesus in 869/870. The new Byzantine emperor, Basil I the Macedonian (), sent an embassy for negotiations to Tephrike. After the talks failed, Basil led a campaign against the Paulician state in the spring of 871, but was defeated and only narrowly managed to escape himself.\nBattle\nEncouraged by this success, Chrysocheir then staged another deep raid into Anatolia, reaching Ancyra and ravaging southern Galatia. Basil reacted by sending his relative, the Domestic of the Schools Christopher, against them. The Paulicians managed to avoid a clash, and as the campaigning season drew to a close, they began retiring towards their own territory. They encamped at Agranai (modern Muşali Kalesı) in the theme of Charsianon, with the shadowing Byzantine army making their camp at nearby Siboron (Σίβορον, modern Karamağara) to the west. From there, the Paulicians marched northeast to the pass of Bathys Ryax or Bathyryax (Βαθυρύαξ, \"Deep Stream\", modern Kalınırmak pass west of Sivas in Turkey), a location of strategic importance, as indicated by the fact that it served as a fortified assembly point (aplekton) for Byzantine expeditions to the East. Christopher sent the strategoi of the themes of Armeniakon and Charsianon ahead with some four to five thousand men, to make contact with the Paulician army, shadow it as far as the pass, and report on its intentions, i.e. whether it intended to double back westwards to resume raiding Byzantine territory or whether it headed back to Tephrike, in which case they would have to rejoin the Domestic's forces.\nWhen the two generals with their men reached the pass, night had fallen, and the Paulicians, apparently unaware that they were being followed, had made camp in the valley of the pass. The Byzantines took up position in a wooded hill called Zogoloenos that overlooked the Paulician encampment, which further concealed them from their enemy. At this point, the sources record that a dispute broke out between the men of the two thematic corps as to who was the bravest; the two generals decided to take advantage of their troops' high morale and impetuousness to attack, despite their orders. A picked detachment of 600 men from both divisions launched a surprise attack at dawn, while the rest of the army remained behind and made loud clamour with trumpets and drums, so as to suggest the imminent arrival of the entire Byzantine field army under Christopher. The ruse worked perfectly: the Paulicians, taken by surprise, panicked and dispersed without offering any serious resistance. The Paulician rout was completed as they fell upon the main Byzantine army while fleeing. Their remnants were pursued by the victorious Byzantines up to a distance of 50&nbsp;km. Chrysocheir himself managed to escape with a small detachment of bodyguards, but he was brought at bay at Konstantinou Bounos (probably modern Yildiz Dagı). In the ensuing engagement, he was wounded by Poulades, a Byzantine soldier who had been formerly a captive of the Paulicians, and fell from his horse. He was then captured and beheaded by the advancing Byzantines, and his head was sent to Emperor Basil in Constantinople.\nAftermath\nThe defeat at Bathys Ryax signalled the end of the Paulicians as a military power and a threat to Byzantium. Basil followed this success by a series of campaigns in the East against the Paulician strongholds and the Arab emirates. Tephrike itself was taken in 878 and razed to the ground. The remaining Paulicians were resettled in the Balkans, while a large contingent was shipped off to Southern Italy to fight for the Empire under Nikephoros Phokas the Elder.\nQuestions of chronology\nThe chronology and sequence of events regarding the battle and the fall of the Paulician state is unclear, since the Byzantine sources are contradictory: a number of scholars place the battle in 872, others in 878, in both cases either before or after the capture and razing of Tephrike itself by the Byzantines. Thus Alexander Vasiliev proposed a first victorious battle for the Byzantines, followed by the sack of Tephrike and the final Paulician defeat at Bathys Ryax, all in 872. Most recent historians place the battle before the sack of the city, but disagree in the dates of the two events. Some, like Nina Garsoïan or John Haldon, place both events in 878; the French Byzantinist Paul Lemerle, followed by other scholars like Mark Whittow and Warren Treadgold, placed the battle in 872 and the final subjugation of Tephrike years later, in 878 (Treadgold in 879).\nReferences\nSources\n*\n*\n*\n*\n*\n*\n*\n*"
    }
  ]
}