{
  "content": [
    {
      "type": "text",
      "text": "# Battle Circus (film)\n\n| runtime        = 90 minutes\n| language       = English\n| country        = United States\n| budget         = $1,201,000\n| gross          = $2,362,000\n}}\nBattle Circus is a 1953 American war film directed by Richard Brooks, who also co-wrote the screenplay with married writing duo Laura Kerr and Allen Rivkin.  The movie stars Humphrey Bogart and June Allyson, and costars Keenan Wynn and Robert Keith.\nThe film is set in South Korea during the Korean War. Bogart (in his only film for Metro-Goldwyn-Mayer) plays Major Jed Webbe, a surgeon and commander of Mobile Army Surgical Hospital (MASH) 8666 (shortened to \"66\" in the dialogue), with Allyson playing Lieutenant Ruth McCara, a newly arrived nurse. Despite initial obstacles, their love flourishes against a background of war, enemy attacks, death and injury.\nPlot\nA young Army nurse, Lieutenant Ruth McCara, is newly assigned to the 8666th MASH, a mobile field hospital constantly on the move during the Korean War. Ruth's personal mission is to serve suffering humanity. She initially experiences an uncomfortable welcoming by the unit's hard-drinking, no-nonsense chief surgeon, Major Jed Webbe. Jed engages in a helicopter rescue of army casualties while under fire. He is a much-tried doctor by the continual movement of the outfit due to the changing battle lines. Responsible for the dismantling and re-pitching of the tent hospital is Sergeant Orvil Statt, a former circus roustabout.\nAt first, Ruth is a bumbling addition to the nurse corps, but she attracts the attention of Jed immediately because of the needless risks she takes. Against her resilience, he continues with sequential passes. After seeing that he is beloved by the unit, she agrees to his advances. He later cautions her that he wants a \"no strings\" relationship. Ruth is warned by the other nurses of his womanizing ways, and that he is probably married. When she asks him if he has someone else back home, he refuses to answer, and they separate.\nWhen a young Korean child needs special care, Ruth entreats Jed to perform an open-heart operation, despite the reservations of the unit commander, Lieutenant Colonel Hilary Whalters. Jed ends up saving the life of the child. Jed is a relentless taskmaster, demanding Captain John Rustford fly desperately needed blood supplies at night, even in the teeth of a fierce storm. After the helicopter lands safely, Jed goes on a binge, forcing Whalters to tell his chief surgeon either straighten up or ship out. When a now more assured Ruth treats some North Korean prisoners of war, a frightened prisoner with a concealed grenade is calmly disarmed by her soothing words and manner.\nAfter a North Korean advance forces the MASH unit to escape through enemy lines, the lovers are temporarily separated. When the unit's commander is wounded in an attack, Jed has to take command to lead the unit out of danger. Traveling cross-country, he sets out on a perilous journey, attempting to meet up with the nurses who have gone on ahead by rail to a preset rendezvous. Eventually the two caravans safely negotiate the battlefield, and Jed and Ruth are reunited.\nCast\nAs appearing in Battle Circus, (main roles and screen credits identified):\n* Humphrey Bogart as Major Jed Webbe\n* June Allyson as Lieutenant Ruth McCara\n* Keenan Wynn as Sergeant Orvil Statt\n* Robert Keith as Lieutenant Colonel Hilary Whalters\n* William Campbell as Captain John Rustford\n* Perry Sheehan as Lieutenant Laurence\n* Patricia Tiernan as Lieutenant Rose Ashland\n* Adele Longmire as Lieutenant Jane Franklin\n* Jonathan Cott as Adjutant\n* Ann Morrison as Lieutenant Edith Edwards\n* Helen Winston as Lieutenant Graciano\n* Sarah Selby as Captain Dobbs\n* Danny Chang as Korean child\n* Philip Ahn as Korean prisoner with hand grenade\n* Steve Forrest as Sergeant\n* Jeff Richards as Lieutenant\n* Dick Simmons as Captain Norson\nProduction\n.]]\nAccording to Richard Brooks (in an interview filmed for the 1988 Bacall on Bogart documentary), Battle Circus was originally called MASH 66, a title rejected by MGM because the studio thought people would not understand the connection to a military hospital. The title of the film actually refers to the speed and ease with which a MASH unit, with its assemblage of tents, and portable equipment, can, like a circus, pick up stakes and move to where the action is. The film's technical advisor, Col. K. E. Van Buskirk, had commanded one of the first MASH units in Korea, and ensured that the MASH and aerial scenes were authentic.\nBrooks also noted that Humphrey Bogart agreed to do the film because the script's humor, set in a story showing the tragedy of war, would make the film seem more realistic to an audience. Bogart was teamed with an old pal, Keenan Wynn and June Allyson who was also a friend. Allyson was initially afraid of acting with Bogart, but her recent roles in light romantic comedy had typecast her and she was encouraged by the studio to attempt more serious fare.\nIn retrospect, Bogart did not enjoy working on the film, the least of which was when he burned his left thumb, a scene that was left in the final production. His $250,000 fee was the sole compensation. Bogart told Brooks, a close friend, \"let's not make any more movies together.\"\nPrincipal photography took place on location in Calabasas, California, and Camp Pickett, Virginia, where MASH units trained. The aerial sequences with the Bell 47 helicopters were filmed there. The camp commandant offered the film crews use of the base facilities, including his house for the lead actors, after initial scenes were finished.\nThe film's sets were designed by the art director James Basevi.\nBox office and reception\nWhile commending Battle Circus for being a revealing and engrossing wartime drama, reviewers noted that the tepid love story distracted. The review in The New York Times read,\nBob Thomas of the Associated Press wrote: \"Battle Circus is a war story that has everything but a plot. The purpose of the film is noble enough: to show the operations of the mobile hospital units in Korea. This is done graphically and with a great deal of excitement. Unfortunately, the only semblance of a plot is a rather whimsical romance between Humphrey Bogart and June Allyson. It's a change of pace for Bogart, who is seldom required to be grim-faced and is actually likable. Little is required of Miss Allyson, but she displays moments of her unique charm.\"\nA retrospective review in TV Guide noted,\nAccording to MGM records, the film earned $1,627,000 in the US and Canada and $735,000 overseas, resulting in a profit of $265,000.\nSee also\n* List of American films of 1953\n* M*A*S*H, 1970 film directed by Robert Altman\nReferences\nNotes\nBibliography\n* Allyson, June and Frances Spatz Leighton. June Allyson by June Allyson. New York: G.P. Putnam's Sons, 1982. .\n* Porter, Darwin. Humphrey Bogart: The Making of a Legend. New York: Blood Moon Productions, 2010. .\n* Sperber, A.M. and Eric Lax. Bogart. New York: William Morrow & Co., 1997. .\nExternal links\n*\n*\n* [https://web.archive.org/web/20060321011934/http://www.amctv.com/show/detail?CID=8497 Synopsis from American Movie Classics]\n* [http://www.juneallyson.com/1953.htm Film summary from the official June Allyson website]"
    }
  ]
}