{
  "content": [
    {
      "type": "text",
      "text": "# Battle of the Caudine Forks__disambig_1\n\n|\nstrength2= Unknown|\ncasualties1= None|\ncasualties2= None|\n}}\nThe Battle of Caudine Forks, 321 BC, was a decisive event of the Second Samnite War. Its designation as a battle is a mere historical formality: there was no fighting and there were no casualties. The Romans were trapped in an enclosed valley by the Samnites before they knew what was happening and nothing remained but to negotiate an unfavorable surrender. The action was entirely political, with the magistrates on both sides trying to obtain the best terms for their side without disrespecting common beliefs concerning the rules of war and the conduct of peace. In the end the Samnites decided it would be better for future relations to let the Romans go, while the Romans were impeded in the prosecution of their campaign against the Samnites by considerations of religion and honor.\nDescription\nAccording to Livy's account, the Samnite commander, Gaius Pontius, hearing that the Roman army was located near Calatia, sent ten soldiers disguised as herdsmen with orders to give the same story, which was that the Samnites were besieging Lucera in Apulia.  The Roman commanders, completely taken in by this ruse, decided to set off to give aid to Lucera.  Worse, they chose the quicker route, along a road later to become the Appian Way, through the Caudine Forks (), a narrow mountain pass near Benevento, Campania. The area round the Caudine Forks was surrounded by mountains and could be entered only by two defiles.  The Romans entered by one; but when they reached the second defile they found it barricaded.  They returned at once to the first defile only to find it now securely held by the Samnites.  At this point the Romans, according to Livy, fell into total despair, knowing the situation was quite hopeless.\nThe Samnites had no idea what to do to take advantage of their success.  Hence Pontius was persuaded to send a letter to his father, Herennius.  The reply came back that the Romans should be sent on their way, unharmed, as quickly as possible.  This advice was rejected, and a further letter was sent to Herennius.  This time the advice was to kill the Romans down to the last man.\nNot knowing what to make of such contradictory advice, the Samnites then asked Herennius to come in person to explain.  When Herennius arrived he explained that were they to set the Romans free without harm, they would gain the Romans' friendship.  If they killed the entire Roman army, then Rome would be so weakened that they would not pose a threat for many generations.  At this his son asked was there not a middle way. Herennius insisted that any middle way would be utter folly and would leave the Romans smarting for revenge without weakening them.\nModern account\nModern historians have cast doubt on the details of Livy's account. Neither defile leading to the central plain is as narrow and steep as Livy's dramatic description would suggest. The western defile (near the town of Arienzo) is over a kilometre wide, and it is unlikely that the Samnites would have had time to block it effectively in the brief time the Romans would have taken to cross the plain to the eastern defile (near Arpaia) and return. (The distance is 4.5&nbsp;km, or just under 3 miles.) Even the eastern end, which is narrower, is wide enough to make it possible to march through while keeping out of range of missiles thrown from the hills on either side. Horsfall suggests that Livy's geography may have been influenced by accounts of the campaigns of Alexander the Great which were contemporary with this event.\nAftermath\nby the Samnites (Pseudo-Melioli, c. 1500)]]\nAccording to Livy, Pontius was unwilling to take the advice of his father and insisted that the Romans surrender and pass under a yoke.  This was agreed to by the two commanding consuls, as the army was facing starvation.  Livy describes in detail the humiliation of the Romans, which serves to underline the wisdom of Herennius's advice.\nLivy contradicts himself as to whether Rome honored or quickly repudiated the Caudine Peace.  Livy claims the Roman Senate rejected the terms but, elsewhere, claims Rome honored the Caudine Peace until hostilities broke out afresh in 316.\nReferences\nFurther reading\n* Rosenstein, Nathan S. Imperatores Victi: Military Defeat and Aristocratic Competition in the Middle and Late Republic. Berkeley:  University of California Press, 1990. http://ark.cdlib.org/ark:/13030/ft967nb61p/\n* Hammond, N.G.L. & Scullard, H.H. (Eds.) (1970). The Oxford Classical Dictionary (p.&nbsp;217). Oxford: Oxford University Press. .\nExternal links"
    }
  ]
}