{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Gaza (312 BC)\n\nBattle of Gaza}}\n| map_type          = West Asia\n| map_relief        = yes\n| map_size          = 300\n| map_marksize      =\n| map_caption       = Location of the Battle of Gaza.\n| map_label         =\n| conflict          = Battle of Gaza\n| partof            = the Wars of the Diadochi\n| date              = 312 BC\n| place             = Gaza, Macedonian Empire\n| result            = Ptolemaic–Seleucid victory\n| combatant1        = PtolemaicsSeleucids\n| combatant2        = Antigonids\n| commander1        = PtolemaiosSeleukos\n| commander2        = DemetriosPeithonNearchosAndronikos\n| strength1         =\n*c. 22,000 total\n**18,000 infantry\n**4,000 cavalry\n| strength2         =\n*c. 17,000 total\n**12,500 infantry\n**4,400 cavalry\n**43 war elephants\n| casualties1       = Unknown\n| casualties2       = 500 killed8,000 captured\n| campaignbox       =\n}}\nThe Battle of Gaza of 312 BC, was fought between the invading army of Ptolemy I Soter and his ally Seleucus I Nicator and the defending army of Demetrius I of Macedon, son of Antigonus I Monophthalmus. The battle was part of the Third War of the Diadochi and was fought near the city of Gaza.\nIn late 312 BC, Ptolemy launched an invasion into the Levant from Egypt, he marched with 18,000 infantry and 4,000 cavalry along the northern edge of the Sinai Peninsula. Receiving timely intelligence, Demetrius recalled his troops from their winter quarters and concentrated them at Gaza. Demetrius' advisors had apparently told him to avoid a military confrontation with Ptolemy and Seleucus, who had more military experience, but he ignored their advice; the conflict ended in a decisive defeat for Demetrius, subsequently enabling the absorption of his controlled territory by Ptolemy and Seleucus.\nArmies and deployment\nTroop strength\nDemetrius deployed 2,900 elite cavalry, 1,500 light infantry, and 30 Indian war elephants under his command on the left. The Antigonid phalanx of some 11,000 was deployed in the center, with 13 war elephants in front and light infantry protecting the main line. On the Antigonid right, there were 1,500 cavalry.\nPtolemy and Seleucus originally put most of their cavalry on the left, but when they learned of Demetrius' disposition, they massed their 3,000 heavy cavalry to the right, under their personal command. An anti-elephant corps of 3,000 light infantry (peltast, archers and slingers) equipped with anti-elephant devices (spikes connected by chains) were positioned in front of the cavalry,– with orders to throw the devices in the path of the elephants and then target the mahouts. Their phalanx was stationed in the center, with the remaining 1,000 cavalry deployed on the right.\nOrder of battle\nAntigonid:\n* left wing: 2,900 cavalry, 1,500 light infantry and 30 war elephants under Demetrius command\n* center: 11,000 infantry phalanx and 13 elephants\n* right wing: 1,500 cavalry\nPtolemaic:\n* left wing: 3,000 cavalry, under Ptolemy and Seleucus\n* center: 18,000 phalanx\n* right wing: 1,000 cavalry\nEngagement\nThe battle opened with the advance guards of the stronger cavalry wings engaging each other. Demetrius drove off the enemy. Ptolemy and Seleucus responded by riding around Demetrius's left flank to attack. A fierce melee ensued, with the cavalry of both sides fighting with their swords after their lances had been shattered. While the cavalry battle on the flank was taking place, Demetrius brought forward his elephants apparently hoping to demoralize the Ptolemaic phalanx. As the elephants approached, the Ptolemaic archers and javelinmen began showering the elephants and their crews. This, along with some elephants stepping on the spiked chains, led to them becoming panicked. After shooting down nearly all the crews, the Ptolemaic light infantry were able to capture and kill most of the elephants. The loss of the elephants panicked Demetrius' cavalry and many of his men retreated. The infantry then engaged, and the fight was stiff. However, neither phalanx could gain the upper hand. After trying to keep more  cavalry from retreating, Demetrius and the remaining cavalry fell back but still managed to stay in formation while retiring over the open plain. This discouraged Ptolemy and Seleucus from pursuing the enemy. The Ptolemaic phalanx began to push back the Antigonid phalanx, and the Antigonid Phalangites threw down their arms and retreated in chaos. Ptolemy and Seleucus had won a hard-fought victory.\nAftermath\nDemetrius lost 8,500 men (500 were killed in battle, a further 8,000 taken prisoner), including generals such as Andronicus of Olynthus, and all his elephants. He retreated to Tripolis in Phoenicia, and started to rebuild his army. He also sent a report to his father, who had just finished his campaign in Caria, urging him to send help.\nMeanwhile, Seleucus had convinced Ptolemy to release him from service and give him an army to try and take back his old province of Babylonia which was now without a governor (Peithon had died in the battle). Ptolemy agreed, and sent off Seleucus with a small force of around 1,000 troops.\nIn popular culture\nAlfred Duggan's novel on the life of Demetrius, Elephants and Castles, covers the battle.\nThe third novel in Christian Cameron's Tyrant series, Funeral Games features the Battle of Gaza.\nReferences\nExternal links\n*  [https://web.archive.org/web/20050220061736/http://ccwf.cc.utexas.edu/~warfare/Lectures/lect14.html Lecture Notes for Week Fourteen]"
    }
  ]
}