{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Tarbes\n\n| place       = Tarbes, Hautes-Pyrénées, France\n| result      = Allied victory\n| combatant1  =  |  |  }}\n| combatant2  =\n| commander1  = Arthur Wellesley\n| commander2  = Jean-de-Dieu Soult\n| strength1   =\n| strength2   =\n| casualties1 = 375 killed and wounded\n| casualties2 = 1,000 killed, wounded and missing\n}}\nThe Battle of Tarbes was a rearguard action fought on 20 March 1814 between the French Army of the South, commanded by Marshal Nicolas Jean-de-Dieu Soult, and the Allied forces under Field Marshal Arthur Wellesley, Marques of Wellington, during the final phase of the Peninsular War.\nBackground\nFrom Saint-Sever Soult turned eastwards to Aire-sur-l'Adour, where he covered the roads to Bordeaux and Toulouse. Beresford, with 12,000 men, was now sent to Bordeaux, which opened its gates as promised to the Allies. Driven by Hill from Aire-sur-l'Adour on 2 March 1814, Soult retired by Vic-en-Bigorre, where there was a combat (19 March), and Tarbes, where there was a severe action (20 March), to Toulouse behind the Garonne. He endeavored also to rouse the French peasantry against the Allies, but in vain, for Wellington's justice and moderation afforded them no grievances. Wellington wished to pass the Garonne above Toulouse to attack the city from the south—its weakest side—and interpose between Soult and Suchet. But finding it impracticable to operate in that direction, he left Hill on the west side and crossed at Grenade below Toulouse (3 April).\nPrelude\nThe Allies had divided the army in three parts; General Hill following a road on the west bank of a major tributary of the Adour river running north from the Pyrenees, Wellington and Beresford by the eastern bank. Three roads were available to the French, and on March 19th Beresford blockaded the first road, blocking the second road the next . Two divisions of the French Army formed Soult's rearguard. Clausel commanded two divisions, with his northern division under Harispe and the southern under Villatte. Behind Clausel's defensive line, across the Larret and Larros tributaries, Marshal Soult had positioned two divisions under D'Erlon and two more under Reille along the main road leading east from Tarbes. When Soult received word from his brother at Trie about Allied movements, he realized the road from Pau through Tarbes to Toulouse was likely their target. That meant the French might be forced to retreat along a single route, taking a longer path to Toulouse and potentially leaving part of their force cut off. Marshal Soult's rearguard was composed of several divisions and brigades positioned around Tarbes. General Darmagnac held the town itself, with Fririon to the east. To the southeast, Reille's corps, including Maransin's and Taupin's divisions, formed the left flank. On the right, Clausel's corps was stationed near Orleix, supported by Berton's cavalry brigade. A small detachment under Clausel occupied Aureilhan, northeast of Tarbes. To avoid that risk, Soult ordered all baggage and non-essential vehicles to be sent ahead. He also dispatched scouts to mark field paths from Oleac that Clausel's men could use if they had to fall back quickly toward the main road southeast of Tarbes. Clausel's forward line was anchored on the heights of Orlieux, stretching south to Oleac. Harispe held the high ground, which was strong defensively but vulnerable to flanking if the Allies moved along the Tarbes road. Villatte's division was placed at Oleac to block that maneuver. On March 20th, Wellington launched a coordinated attack. Hill advanced toward Tarbes to engage Harispe head-on and keep Villatte occupied. Meanwhile, Clinton's 6th Division moved through the hamlet of Dours, aiming to strike the French right flank and wedge itself between Harispe and Villatte a classic pincer move designed to break the French line.\nThe battle\nBy the morning of 20 March 1814, Marshal Soult had arranged his forces in a broad arc around Tarbes. General Darmagnac's division held the town itself, with Fririon's troops positioned to the east. To the southeast, Reille's corps, made up of Maransin's and Taupin's divisions, formed the left of the French line. A sizeable contingent of cavalry and infantry guarded the road north toward Vic-de-Bigorre, anticipating Allied pressure from that direction. On the French right, Clausel's corps was stationed around Orleix, supported by Berton's cavalry brigade. A smaller detachment — a battalion, a squadron, and two guns — held the village of Aureilhan, just northeast of Tarbes. As the day began, Darmagnac's division pulled back from Tarbes to Barbazan, about three miles to the southeast, where it took up a new position on the left flank of Reille's corps. With this adjustment, Soult's army now faced west, directly opposing Wellington's advance along the road from Vic-de-Bigorre. The Allied forces were spread across both banks of the Adour River. Hill's corps moved directly on Tarbes, while the Light Division advanced toward the high ground south of Orleix. Meanwhile, Clinton's Sixth Division swung wide to the east, marching toward Pouyastruc in an effort to outflank the French right.Around midday, the 95th Rifles, leading the Light Division, engaged French skirmishers in the valley below Orleix. The riflemen drove them back up the slope, only to find themselves facing the full weight of Harispe's division. A sharp fight followed, with the British inflicting heavy casualties and forcing Harispe's men to fall back. As pressure mounted, Clausel began a fighting withdrawal, pulling his corps back from ridge to ridge in the direction of Tournay, seeking to avoid being cut off by Clinton's flanking column. On the opposite flank, Hill's troops fought their way into Tarbes, but it was not until 2 p.m. that the town was fully cleared. By then, Soult had already begun his retreat toward Tournay. The British cavalry attempted to pursue, but the narrow lanes and enclosed terrain made it difficult to press the retreating French. By 10 p.m., Soult's forces had reached Tournay, this ended the engagement.\nAftermath\nThe Battle of Tarbes marked a tactical success for the Allied forces, who succeeded in dislodging Marshal Soult's rearguard and clearing the road to Toulouse. Though not a decisive engagement, it demonstrated Wellington's ability to coordinate multi-pronged attacks and exploit terrain to pressure French withdrawals. Soult's army, though forced to retreat, maintained cohesion and avoided encirclement thanks to Clausel's staged withdrawal and the use of pre-marked field routes. Clausel's corps, particularly Harispe's division, suffered notable casualties during the British assault led by the 95th Rifles, but managed to fall back toward Tournay without collapse. Hill's corps secured Tarbes by mid-afternoon, while Clinton's flanking maneuver threatened the French right, prompting Soult to accelerate his retreat. The British cavalry, hampered by enclosed terrain and narrow lanes, were unable to mount an effective pursuit, allowing the French to reach Tournay by nightfall. Strategically, the battle paved the way for the Battle of Toulouse (10 April 1814), the final major engagement of the Peninsular War.\nReferences"
    }
  ]
}