{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Knockdoe__disambig_1\n\n4,000\n|strength2= 6,000\n|casualties1= 1,500\n|casualties2= 1,000\n}}\nThe Battle of Knockdoe took place on 19 August 1504 at Knockdoe, in the Parish of Lackagh (Irish Leacach), County Galway, between two Hiberno Norman lordsGearóid Mór FitzGerald, 8th Earl of Kildare, the Lord Deputy of Ireland, and Ulick Fionn Burke, 6th Clanricarde (d. 1509)along with their respective Irish allies. The cause was a dispute between Maelsechlainn mac Tadhg Ó Cellaigh (Mod. Irish Maoilseachlainn mac Thaidhg Uí Cheallaigh)(O'Kelly), King of Ui Maine – Mod. Irish Uí Mháine) and Clanricarde.\nThe major contemporary sources for this battle are the Gaelic Irish annals and a sixteenth-century manuscript written in the Pale known as \"the Book of Howth\".\nBackground\nUlick Finn, as Burke was called, was an aggressive local magnate. He had become The Clanricarde in the year 1485, and sought to establish his authority over all Connacht, including County Mayo, where the other branch of the great de Burgh or de Burgo (Burke) family held power. He also pursued his family’s interests at the expense of the towns of Galway and Athenry, two urban centres in Connacht which, despite their remoteness from the Pale, were notable for their loyalty to Crown government in Ireland. Although both families were of Norman stock, the western de Burghs (or Burkes) were integrated into the Gaelic world, whereas the Fitzgeralds of the Pale, though Gaelicised, retained cultural, social and political links to England.\nThe King's Deputy, Gerald, Earl of Kildare (Gearóid Mór), became concerned that Ulick Burke's attempt to gain supremacy in Connacht could simultaneously threaten the Crown's interests in that province and his claim to be the paramount magnate in Ireland. He had tried to persuade Ulick to acknowledge his authority by giving him his daughter Estacia in marriage. But Ulick Burke resisted all attempts to have his power subordinated by the Earl of Kildare, forming an alliance with O'Brien of Thomond and the magnates of Munster.\nThe Burkes of Mayo, on the other hand, joined forces with Kildare with a view to suppressing their dangerous neighbour.\nIn 1503 Ulick Burke attacked and destroyed the castles of O'Kelly, Lord of Hymany, at Monivea (Muine Mheá), Garbally (Gallach) and Castleblakeney (Garbhdhoire). The Irish sources attest that O'Kelly complained of this to the Lord Deputy. Burke then occupied Galway. Since the city had a royal charter (from 1484), as the Crown's representative in Ireland, Kildare was forced to act.\nPersonal reasons\nBurke appears to have also taken up with O'Kelly's wife, and there may  have been ill-feeling between the Lord Deputy and Burke because of the latter's treatment of Gearóid Mór's daughter.\n{| class=\"wikitable\"\n|-\n! The Battle of Knockdoe\n|-\n|\n''Loud blares the trumpet, the field is set. Loud blares the trumpet, the foe men are met. Steep slopes the hill, at Knockdoe in the West. There stood in Battle, the South at its best. Hi Manny O'Kelly, with the Burkes is at War, and Clanrickard has gathered his friends from afar. Kildare he advances like the fox that doth stalk, O'Kelly sweeps down with the speed of a hawk. Loud sounds the trumpet, the sunset is fair. Hi Manny triumphant. The Earl of Kildare.''\n(Local folklore has it that the above poem was found in the pocket of a slain soldier.)\n|}\nThe battle\nIt appears that for political (and possibly personal) reasons the Lord Deputy was eager to help O'Kelly weaken the prestige of Clanrickarde. Both sides gathered to their side a large contingent of lesser magnates and their armies. The Lord Deputy's forces included contingents from Leinster, Ulster, and Connacht, among which were the armies of Red Hugh O'Donnell (Aodh Ruadh Ó Domhnaill) and Art Ó Néill, the McDermotts and Morrisroes of Connacht and a contingent provided by O'Kelly. Facing them were the forces of Burke and his allies – the O'Briens of Thomond, the McNamaras, the O'Kennedys, and the O'Carrolls.\nThe armies met on the slopes of Knockdoe, almost a mile to the north of Lackagh Parish Church, with heavily armed Gallowglass playing a large part on both sides. The battle appears to have lasted all day, with the heaviest fighting (according to tradition) taking place along the River Clare in the townland of Ballybrone (Baile Bhróin). The precise number of casualties is unknown, though contemporary observers, as evidenced in later chronicles, were impressed by the extent of the slaughter. Round the summit of Knockdoe are many cairns (burial mounds)\nThe Lord Deputy, though victorious, had many among the slain. His army remained the night on the field as a token of victory, then marched to Galway, looting Claregalway castle en route and taking as prisoners the two sons and daughter of Ulick Burke. They remained in Galway for a few days and then travelled to Athenry.\nThe Clanrickarde Burkes faded into obscurity for some decades, with their rivals, the Mayo Burkes, gaining influence as a consequence.\nIt is said that firearms were employed in the course of the battle, an early instance of their use in Ireland. According to the Book of Howth, one soldier of the Clanrickarde Burkes was beaten to death with a handgun.\nSee also\n* History of Ireland\n* Irish battles\nBooks\n* Blackmore, Liz, John Cronin, Donal Ferrie agus Bríd Higgins (ed.), 2001. In Their Own Words: The Parish of Lackagh-Turloughmore and its People. Galway.\n* McCollough, David W. (ed.), 2000. Wars of the Irish Kings: A Thousand Years of Struggle, from the Age of Myth through the Reign of Queen Elizabeth 1. Crown Publishing Group.\nReferences\nExternal links\n* [http://www.ucc.ie/celt/published/G100005D/index.html  Annals of the Four Masters, a major chronicle incorporating a range of earlier sources. Online edition in Irish, with English translation.]\n* [http://rmchapple.blogspot.ie/2014/03/knockdoe-1504-archaeological-historical.html Knockdoe (1504): the archaeological & historical significance of one of Ireland's great but forgotten battles.]"
    }
  ]
}