{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Daugavgrīva (1609)__disambig_1\n\n| result            = Polish-Lithuanian victory\n| combatant1        = Polish–Lithuanian Commonwealth\n| combatant2        = Sweden\n| commander1        = Jan Karol Chodkiewicz\n| commander2        = Joachim Frederick von Mansfeld\n| strength1         = 2,500 men\n| strength2         = 5,000 men\n| casualties1       = Unknown\n| casualties2       = Several hundred killed, 100 captured, 14 banners\n}}\nThe Battle of Daugavgrīva took place on October 6, 1609 during the Polish–Swedish War (1600–1611).\nHistory\nWhen Jan Karol Chodkiewicz (2500 soldiers) moved in September from Pärnu to Daugavgrīva, went too him the Swedish army (5000 soldiers) under the command Joachim Frederick von Mansfeld. Lithuanian troops stopped the march on September 29 to establish a confederation in connection with overdue wages.\nThe arrival of October 2 Mansfeld resulted that the Polish-Lithuanian army subordinate to Chodkiewicz. Chodkiewicz, in order to unhindered besiege of Daugavgrīva castle, decided to destroy the army of Mansfeld. He, however, for four days managed to avoid battle. On the other hand, the Swedes did not manage to break through and help the starving crew of Daugavgrīva, which Lithuanians blockaded for months.\nUnable to force Mansfeld to battle, Chodkiewicz prepared an ambush by the river Gauja. For this purpose, he abandoned camp, leaving a small force there. Himself with the rest of the forces hid in the nearby woods.\nThe Swedes couldn't resist the temptation and on 6 October attacked the weakly defended Lithuanian camp.\nThen Chodkiewicz ordered to attack the regiment under the leadership of Tomasz Dąbrowa. The surprising impact of the Lithuanian cavalry led to the breakdown of Mansfeld's army.\nThe Swedes suffered heavy losses. The victory at Daugavgriva, prejudged the Polish-Lithuanian troops regaining Daugavgrīva.\nSee also\n* Daugavgrīva castle\nReferences\n* Leszek Podhorodecki, \"Rapier i koncerz\", Warszawa 1985, , str. 116-117"
    }
  ]
}