{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Marj al-Saffar (1126)\n\nBattle of Marj al-Saffar}}\n*Formation of Nizari-Burid alliance|\ncombatant1=Kingdom of Jerusalem|\ncombatant2=Burids of DamascusNizari Ismailis of Syria|\ncommander1=Baldwin II of Jerusalem|\ncommander2=Toghtekin of Damascus|\nstrength1=Unknown|\nstrength2=Unknown|\ncasualties1=Heavy|\ncasualties2=Unknown|\n}}\nThe Battle of Marj al-Saffar was fought on January 25, 1126 between a Crusader army led by King Baldwin II of Jerusalem and the Seljuk Emirate of Damascus, which was ruled by Toghtekin. The Crusaders defeated the Muslim army in the field but failed in their objective to capture Damascus.\nBackground\nAfter winning the Battle of Azaz northeast of Antioch, Baldwin II led an army of Franks to attack Damascus in early 1126. Baldwin's army consisted of the usual mounted knights and men-at-arms supported by spearmen and bowmen on foot. At Marj al-Saffar, 30 kilometers outside Damascus, the Crusaders encountered the army of Damascus which offered battle. Toghtekin, founder of the Burid dynasty, ruled Damascus at that time.\nBattle\nOnly a few details are known about the battle. The sources are not in agreement about tactical details, but they concur that the Crusaders failed to seize Damascus. The Franks lost many men to Turkish archery in a very close-fought engagement. \"But a strong attack made late in the day gave them a hard-won victory. Their tactical success left them unable to achieve their object in undertaking the campaign, which was the conquest of Damascus.\"\nAnother historian writes, \"Crusader forces had a clear win but were unable to press home their advantage.\" A third writer notes that the Crusader victory occurred because Toghtekin \"fell from his horse and, thinking that he had been killed, his companions fled.\" Because of their heavy casualties, the Crusaders were forced to retreat.\nAftermath\nSome Nizari Ismailis from Homs and elsewhere were involved in the defense of Damascus. This contributed to the establishment of the alliance between the Nizari leader Bahram al-Da'i, who was the Chief Da'i of Syria, and the Burids.\nIn 1129, the Franks attacked Damascus again, but their siege of the city was unsuccessful.\nNotes\nReferences\n* Burns, Ross. Damascus: A History. Routledge, 2005.\n* France, John. Western Warfare in the Age of the Crusades, 1000-1300. Ithaca, NY: Cornell University Press, 1999.\n* Hillenbrand, Car. The Crusades: Islamic Perspectives. Routledge, 1999.\n* Smail, R. C. Crusading Warfare 1097-1193. New York: Barnes & Noble Books, (1956) 1995."
    }
  ]
}