{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Baideng__disambig_1\n\nThe Battle of Baideng (Chinese: }},}} ,}} ) was fought between the Han Empire and the Xiongnu in 200&nbsp;BC.\nBackground\nThe nature of the conflict is uncertain. During the Fall of Qin, Liu Bang had risen from a peasant rebel to king of Han and then, during the Chu–Han Contention, overwhelmed Xiang Yu and established himself as emperor of the new Han dynasty. During this period, Han Xin, the legitimate heir of the Warring States-era Han Kingdom, had supported Liu but came under suspicion as his fief was moved from Yangzhai (, present-day Yuzhou, Henan) to Jinyang (, present-day Taiyuan, Shanxi) to Mayi (present-day Shuozhou, Shanxi).\nBattle\nAccording to the biographies of the Book of Han, ten envoys to the Xiongnu reported that they were weak and easily defeated while Lou Jing alone surmised that the nomads were hiding their strength to lure the Chinese into an ambush. The Emperor imprisoned Lou in annoyance, only to repent after the Han army ran into a formidable Xiongnu host and was hemmed in, besieged for seven days at Pingcheng (, present-day Datong, Shanxi) before being able to break free. Subsequently, Liu Bang executed the other envoys while freeing and apologizing to Lou Jing.\nThe account of René Grousset alters this, saying the Xiongnu invaded Han Shanxi and besieged Jinyang before being routed by Liu Bang's army. Chasing the nomads north, however, the Emperor was blockaded by them on the Baideng Plateau near Pingcheng.\nChinese sources list the Xiongnu host at 400,000 and the Han army at around 320,000, although it is uncertain how much of the vanguard was trapped in the fort with the emperor before the main host arrived to relieve them. It was reckoned as a Xiongnu victory, although the nomads supposedly suffered heavier casualties than the Chinese army.\nAftermath\nIn the wake of the battle, Liu Bang ultimately followed Lou Jing's advice to marry his eldest daughter to the Xiongnu leader Modu Chanyu, beginning the Han's  policy.\nSee also\n* Han–Xiongnu Wars\n* Xiongnu invasion of Donghu\nReferences\nCitations\nBibliography\n* Book of Han, Volume 43: Biography of Lou Jing (in Chinese).\n* 1600 B.C. A.D. 8'' |location=Ann Arbor |publisher=University of Michigan Press |isbn= }}.\n* ."
    }
  ]
}