{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Lipnic__disambig_1\n\n| combatant2        =  Golden Horde\n| commander1        =  Stephen III\n| commander2        =  Ahmed Khan\n| strength1         =  Unknown\n| strength2         =  Unknown\n| casualties1       =  Light\n| casualties2       =  Heavy, the brother and son of the khan were taken captive.\n}}\nThe Battle of Lipnic (or Lipnica, or Lipniți) was a battle between the Moldavian forces under Stephen the Great, and the Volga Tatars of the Golden Horde led by Ahmed Khan, and which took place on the August 20, 1470.\nBattle\nIn the summer of 1470 (other sources give 1469), Ahmed Khan, the Great Khan of the Great Horde, the central principality of the Mongol-Tatar Golden Horde, organized an attack against Moldavia, the Kingdom of Poland, and Lithuania.\nStephen and the Polish king Casimir IV Jagiellon were previously informed of the future attack by the Khan of the Crimean Khanate, Meñli I Giray (1466-1515, with intermittence), who was an occasional ally of Stephen the Great, and had a clear stance against the Golden Horde.\nThe hordes unleashed a three-directional attack via Podolia, being conducted by the brother and son of the Khan. They first raided and pillaged the eastern territories of Poland, and as Casimir failed to gather enough forces to attack them, the Tatars then headed southwards against Moldavia. Chronicles speak of several clashes and two other battles both of which being won by the Moldavians. Nevertheless, the final and most violent was to take place at Lipniți, a village near the Dniester, in the Soroca County, modern Republic of Moldova.\nBy this time, the Tatars had started to retreat carrying into slavery several thousand women and children, hundreds of herds of cattle, horses, and flocks of sheep. By August 20, Stephen managed to swerve this Tatar convoy, and to divert them to a trap set at the edge of the lime tree forest near Lipnic, and to force the Tatars to face the Moldavians in an open battle.\nThere are no actual descriptions of the battle, but it is accounted as to have been a bloody and violent one. Large numbers from the ranks of both the Moldavians and of the Tatars perished. While most of the Tatars died in the battle itself, a large number of them actually drowned in the Dniester while attempting escape by fleeing. Numerous Tatars were captured, including the Khan’s son. The Khan’s brother died in the battle.\nAftermath\nStephen conditioned the life of the Khan's son on his father's making peace with Moldavia, stating that his son would live until the exact day that a Tatar would touch the land of Moldavia. However, the Khan's son was eventually killed, after an episode at Stephens's court. This episode is mentioned by Stanislaus Sarnicius (Sarnicki), as well as by Jan Długosz in his Historia Polonica:\nAhmed Khan failed to organize a new attack against Stephen. By 1502, the Great Horde was completely destroyed by Meñli I Giray of the Crimean Khanate. Stephen took measures to protect his eastern frontier, strengthened the Orhei and Tighina fortresses, and built the Soroca fortress, thus completing the Eastern line of defence along the river Nistru. Tatar attacks continued against Moldavia, this time from the other Tataric states from north of the Black Sea.\nFootnotes and References\nInline\nGeneral\n*Șerban Papacostea: Relaţiile internaţionale ale Moldovei in vremea lui Ştefan cel Mare.\n*Collection of historic sources on [https://web.archive.org/web/20061114112449/http://www.stefancelmare.ro/izvoare.htm stefancelmare.ro] (Romanian)\nSee also\n*Tatar invasions\n*Moldavian military forces\n*Battle of the Vorskla River\n*Borzeşti Church"
    }
  ]
}