{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Bến Tre__disambig_1\n\n| result            = US–South Vietnamese victory\n| combatant1        =\n| combatant2        =  Viet Cong\n| units1            = MACV Advisory Team 93U.S. Navy River Section 53439th Infantry Regiment60th Infantry Regiment\n| map_type          = Vietnam\n| units2            = 518th Main Force Battalion516th Local Force Battalion\n| commander1        = Anthony P. DeLuca\n| commander2        =\n| casualties1       =  150 killed\n| casualties2       =  328 killed\n| casualties3       = 528 civilians killed and over 5,000 homes destroyed\n}}\nThe Battle of Bến Tre took place during the Tet Offensive of the Vietnam War when Vietcong (VC) forces attacked Bến Tre, the capital of Kien Hoa Province, on 31 January 1968. The battle lasted until 5 February when U.S. and South Vietnamese forces ejected the VC who suffered 328 killed.\nIn the United States, the battle is best remembered for a quote from an unnamed American Major, reported by journalist Peter Arnett, that \"It became necessary to destroy the town to save it.\" This quote has often been paraphrased as \"We had to destroy the village in order to save it.\" The veracity of the original quote has often been questioned.\nBackground\nWedged between two branches of the Mekong River and crisscrossed by several smaller canals and rivers, Bến Tre lies 13.3&nbsp;km south of Mỹ Tho. In 1967 it had a population of approximately 74,544 and was the capital of Kien Hoa Province, an island province surrounded by water with no bridge links to any of its four neighboring provinces.\nIn January 1960, one of the very few high-ranking VC women, Nguyễn Thị Định, led the first large-scale armed rebellion against the South Vietnamese government at Bến Tre. Định's insurgents captured ten government buildings and assassinated 43 individuals before an Army of the Republic of Vietnam (ARVN) force retook the city ten days later. Although Định was unable to establish a permanent liberated zone, the rebellion provided great inspiration for VC insurgents in the south. Because of Bến Tre's significance as the cradle of the southern insurgency, and also because the rural area surrounding it provided excellent terrain for guerrilla operations, the VC utilized this area as an important base for much of the 1960s. Army Brigadier General William Robertson Desobry, the IV Corps advisor, noted in a 1968 debriefing report: \"The population is fractured, is dissident and in general has little if any history of loyalty to Saigon. The 7th ARVN Division has had little success in operating here in the past two years.\"\nDespite the heavy VC presence in the Kien Hoa Province countryside, Bến Tre itself was relatively peaceful just months before Tết.\nBattle\nOn 31 January the VC attacked 13 of the 16 provincial capitals in the Mekong Delta and captured large sections of Mỹ Tho, Cai Lậy, Bến Tre, Cái Bè and Vĩnh Long.\nAt 04:15 on the morning of the 31st, a force of approximately 800 VC from the 518th Main Force and the 516th Local Force battalions began their attack on Bến Tre. On that day the city was defended by two battalions of the ARVN 1st Brigade, 7th Division, and about 70 American advisors from Military Assistance Command, Vietnam (MACV) Advisory Team 93 and Central Intelligence Agency (CIA) personnel housed in the MACV compound (), a full city block of military buildings surrounded by a  tall masonry wall in downtown Bến Tre. Within 16 hours of the first attack, the VC controlled virtually the entire city and a string of fishing villages on the south bank of the Bến Tre River. The only territory still in Allied hands was a four-square-block area surrounding the MACV compound, the Provincial headquarters, the main Republic of Vietnam National Police station and an ARVN logistics compound. Two battalions from the ARVN 10th Regiment were trying to fight their way into town, but the regimental commander had been killed leading an attack. With the U.S. Mobile Riverine Force (MRF) focused on saving Mỹ Tho, Bến Tre's defenders had to rely mainly on airpower and naval gunfire support from Patrol Boat, Rivers (PBRs) of U.S. Navy River Section 534 to keep the VC from completely overrunning their positions.\nPBRs 7-20 and 7-21 were patrolling along the Hàm Luông River not far from Bến Tre when they heard gunfire coming from the city. They first thought that Vietnamese soldiers might be celebrating Tết, but soon noticed the telltale green VC tracer rounds and moved down the Bến Tre River to investigate. About  down the river they came across six Republic of Vietnam Navy LCVPs along the north bank firing at targets on the south bank. Shortly thereafter, the MACV Compound requested gunfire support from the PBRs, and the boats headed up the river to assist. They soon came under fire from the VC, but low tide and high riverbanks made it difficult for the VC gunners to hit the PBRs, and most of the rounds passed harmlessly over the boats. The PBRs' .50-caliber machine guns returned fire with a combination of full-metal jacket, red tracer and armor-piercing incendiary (API) rounds at the VC. Less than a minute after the firefight began the VC guns went silent and the shooting subsided. The two PBRs then idled offshore from the MACV compound before being relieved by PBRs 7-13 and 7-14, and they headed to , anchored on the Hàm Luông River, for more fuel and ammunition.\nPBRs 7-13 and 7-14 got as far as the Bến Tre Bridge when they were hit by fire from the south bank of the canal. A rocket or mortar round hit PBR 7-14, lightly wounding several crewmen. Other PBRs, some from other river sections, soon began arriving on-scene, and their gunfire began killing VC trying to cross the bridge from the south to the north bank near the Bến Tre Marketplace (). PBR 7-18 a Mark II PBR outfitted with a 60mm mortar, shelled targets near the MACV compound with white phosphorus and high explosive rounds. Sailors equipped with M72 LAW rockets fired on VC hiding in buildings, setting them on fire. Other buildings were burned down with API and tracer rounds. VC Rocket-propelled grenades hit PBR 7-18, knocking out its controls. PBRs 7-17 and 7-16 soon rushed to the aid of the crippled boat, expending nearly all of their machine-gun ammunition trying to neutralize fire from the south bank. All boats were hit by small arms fire, and the 7-18 took over 40 hits before it was finally towed to safety by PBR 7-16.\nAir support began arriving just after the marketplace attack. Among the first to reach the scene were Navy helicopters from HA(L)-3, which immediately began attacking VC positions near the MACV Compound. Other aircraft soon followed, including U.S. Air Force AC-47 Spooky gunships. USS Harnett County also lent firepower to the effort by attacking targets near the confluence of the Bến Tre and Hàm Luông Rivers. During the course of the offensive, the Harnett Countys Bofors 40 mm guns delivered over 20,000 rounds of API shells in the Bến Tre area, destroying 30 structures, three bunkers, a sampan, and a brick factory.\nAt 18:10 on 1 February, reinforcements from the US 9th Infantry Division began arriving at Bến Tre. Company B, 3rd Battalion, 39th Infantry Regiment and Company B, 2nd Battalion, 60th Infantry Regiment landed by helicopter in the MACV Compound to bolster its defensive perimeter. On the morning of 2 February the rest of the 3/39th Infantry was landed at the MACV Compound and the 2/39th Infantry was landed east of the city and moved west in an attempt to link up with the 3rd Battalion, which was supposed to break out from its defensive position and begin moving east. Both units encountered fierce opposition. Unfamiliar with urban warfare, the 3rd Battalion fought a slow, house-by-house advance, until it stalled near the main highway on the eastern edge of the city unable to advance further and link up with its sister battalion. The 2nd Battalion encountered a battalion-size force of VC, forcing it to move from its landing zones to the northern edge of the city. By this point the two battalions had lost 16 soldiers and were completely pinned down, unable to advance. Air support was called in on the eastern portion of the city with seven sorties going into one eight-block area. These strikes broke up the VC formations and forced them to flee across open rice fields, where they were attacked by helicopter gunships, artillery and fixed-wing strikes. With the air support, the 2nd and 3rd Battalions began making significant progress. The brick factory, near the mouth of the Bến Tre River (), was one of the last structures destroyed. A group of VC holdouts had retreated to the beehive-shaped structure and the Army tried to negotiate a surrender, but the VC refused. Rather than sending troops into the building, the Army requested 40mm gunfire support from the Harnett County, which destroyed the building. After three days of relatively light fighting, these units cleared the area of VC and on 5 February returned to Dong Tam Base Camp. As the 3rd Brigade's after-action report stated, \"With the enemy in control of virtually the entire city, it became a matter of door-to-door, street-by-street advance under constant sniper fire to drive him [the Viet Cong] out in the open.\"\nAftermath\nU.S. forces killed 328 VC, mostly during the battle of Bến Tre. Civilian casualties in Kien Hoa Province included 528 killed and 1,219 wounded. Bến Tre suffered major damage during the battle with over 5,000 homes destroyed and generated over 30,000 refugees in Bến Tre and the neighboring Mỏ Cày District.\nU.S. Air Force Major James K. Gibson, a Forward Air Controller pilot who fought at Bến Tre, blamed the VC for choosing Bến Tre as the battleground: \"The way we selected these targets was determined by the VC. They chose the battleground and we really had no choice where we put the target.\"\n\"Destroy the town to save it\" quote\nOn 7 February Associated Press journalist Peter Arnett flew into Bến Tre to report on the fighting there. In a report he filed he quoted an unnamed US Major as saying \"It became necessary to destroy the town to save it.\" Arnett's quote rapidly disseminated throughout the American media and, according to William H. Hammond, a historian with the United States Army Center of Military History, soon \"passed into the lore of the war to become one of the most serviceable icons of the anti-war movement.\" Arnett never divulged which officer he was quoting; according to a 2018 Bloomberg News article, \"Among some on the right, it's become an article of faith that Arnett invented the quote.\" The article cites several historical uses of the \"destroy in order to save\" phrasing and suggests that rather than inventing the metaphor, the unnamed major was employing one long in use.\nReferences"
    }
  ]
}