{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Paitilla Airport\n\n| caption           =\n| date              = 20 December 1989\n| place             = Paitilla Airport, Panama\n| coordinates       =\n| result            = American victory\n| combatant1        =  United States\n| combatant2        =  Panama\n| commander1        =  Cmdr. Tom McGrath Lt. Cmdr. Patrick Toohey\n| commander2        =  Lt. Octavio Rodriguez\n| units1            = SEAL Team 4\n| units2            =  Panama Defense Forces\n| strength1         = 48\n| strength2         = 28–56\n| casualties1       = 4 killed9 wounded\n| casualties2       = 1 Learjet 35A private jet destroyed\n| campaignbox       =\n}}\nThe Battle of Paitilla Airport took place between members of the Panama Defense Forces and United States Navy SEALs, on 20 December 1989, in the opening hours of the United States invasion of Panama. The US force consisted of forty-eight members of SEAL Team 4 (Platoons Golf, Bravo, and Delta) under the command of Lt. Cmdr. Patrick Toohey. The team was tasked with destroying Manuel Noriega's private jet on the ground at the Punta Paitilla Airport, in Panama City.\nBattle\njet.]]\nLaunched in the starting hours of Operation Just Cause, this operation was handled by 48 United States Navy SEALs of SEAL Team 4 (Platoons Golf, Bravo, and Delta). Under the command of Lt. Cmdr. Patrick Toohey (executive officer of Team 4), this team was tasked with destroying Noriega's private jet Learjet 35A on the ground at the Punta Paitilla Airport, a coastal airport in Panama City.\nThe main force of SEALs landed just south of the airport at approximately 0030, shortly before the initial combat operations started within Panama City itself. Several reconnaissance teams were hidden on the north side of the airfield to provide real-time data on enemy movements. Once the SEALs landed, Lt. Cmdr. Toohey established a command post near the southern edge of the runway. At this time Cmdr. McGrath, a SEAL officer stationed on a patrol boat offshore coordinating several operations, passed on information implying that the aircraft was to be disabled with \"minimal damage\" (defined as shot out tires and cut control wires), rather than destroyed. This became a point of controversy after the operation, as the message was poorly worded and forced the SEALs to change their tactics at the last minute and approach the aircraft more closely than anticipated.\nThe three platoons then began advancing up the airfield, with Golf platoon taking up final assaulting positions outside the hangar at roughly 0105. At this point, Lt. Cmdr. Toohey received a message stating that PDF V300 Cadillac Gage armored cars were heading towards the airport. To counter the threat, a Squad One of Golf Platoon was ordered to move into ambush positions on a nearby road. As they stood up to move, the Panama Defense Forces (PDF) soldiers stationed in the airfield immediately opened fire, killing two SEALs and wounding five others. The other two platoons moved to reinforce Golf, and within several minutes had secured the hangars, with two more SEALs killed and four more wounded. The SEALs then disabled Noriega's private plane by shooting it with an M136 AT4 anti-tank weapon. Shortly after, a MEDEVAC helicopter arrived and transported the injured SEALs to the Joint Casualty Collection Point at Howard Air Force Base. The SEALs held the area throughout the night, and disabled the runway for use by any PDF transport planes by rolling other aircraft onto it. The next day, the SEALs were replaced by a company from the 75th Ranger Regiment.\nAftermath\nDue to the high level of casualties sustained (amounting to one-quarter of the assaulting force) and several inconsistencies regarding planning and command and control during the battle, the Battle of Paitilla Airport is considered one of the most controversial operations within Operation Just Cause from the US military perspective. The battle led to the death of four Navy SEALs:\n* Lt. j.g. John Patrick Connors, 25, of Arlington, Mass.\n* Chief Engineman Donald Lewis McFaul, 32, of San Diego, Calif.\n* Boatswain's Mate 1st Class Christopher Taylor Tilghman, 30, of Kailua, Hawaii\n* Torpedoman's Mate 2nd Class Isaac George Rodriguez III, 24, of Missouri City, Texas\nNine further Navy SEALs were wounded in the battle.\nSee also\n*List of special forces units\nReferences\nExternal links\n*\"[https://archive.org/stream/soldma00unit/soldma00unit_djvu.txt|Soldiers in Panama: stories of Operation Just Cause]\"\n*\"[https://nsarchive2.gwu.edu/NSAEBB/NSAEBB443/docs/area51_22.PDF Operation Just Cause Panama]\", Ronald H. Cole, Joint History Office, Office of the Chairman of the Joint Chiefs of Staff, 1995"
    }
  ]
}