{
  "content": [
    {
      "type": "text",
      "text": "# Battle of South Mills__disambig_1\n\n| place       = Camden County, North Carolina\n| result      = Inconclusive\n| combatant1  =  United States (Union)\n| combatant2  =  CSA (Confederacy)\n| commander1  = Jesse L. Reno\n| commander2  = Ambrose R. Wright\n| units1      = Department of North Carolina\n| units2      = 3rd Georgia Infantry  Ferebee's North Carolina Militia  McComa's Battery  Gillett's Southampton Cavalry Co.\n| strength1   = 3,000\n| strength2   = ~1,000\n| casualties1 = 13 killed101 wounded13 missing\n| casualties2 = 6 killed19 wounded3 captured\n| campaignbox =\n}}\nThe Battle of South Mills, also known as the Battle of Camden, took place on April 19, 1862 in Camden County, North Carolina as part of Union Army Maj. Gen. Ambrose E. Burnside's North Carolina expedition during the American Civil War.\nLearning that the Confederates were building ironclads at Norfolk, Burnside planned an expedition to destroy the Dismal Swamp Canal locks to prevent transfer of the ships to Albemarle Sound. He entrusted the operation to Brig. Gen. Jesse L. Reno's command, which embarked on transports from Roanoke Island on April 18. By midnight, the convoy reached Elizabeth City and began disembarking troops.\nOn the morning of April 19, Reno marched north on the road to South Mills. At the crossroads a few miles below South Mills, elements of Col. Ambrose R. Wright's command delayed the Federals until dark. Reno abandoned the expedition and withdrew during the night to the transports at Elizabeth City. The transports carried Reno's troops to New Bern where they arrived on April 22. Union forces later pushed Confederate units out of the coastal areas, which they occupied for the duration of the war.\nNotes\nReferences\n* [https://web.archive.org/web/20080518001925/http://www.nps.gov/hps/abpp/battles/nc005.htm CWSAC Battle Summaries, National Park Service]\n* [https://web.archive.org/web/20121108205114/http://www.nps.gov/hps/abpp/CWSII/NorthCarolinaBattlefieldProfiles/Monroes%20Cross%20Roads%20to%20Wyse%20Fork.pdf CWSAC Report Update]"
    }
  ]
}