{
  "content": [
    {
      "type": "text",
      "text": "# Battle of San Jerónimo\n\n| image_size  =\n| alt         =\n| caption     = The exact location of the battle\n| date        = April 9–11, 1881\n| place       = San Jerónimo, Department of Lima, Peru\n| coordinates =\n| map_type    =\n| map_relief  =\n| map_size    =\n| map_marksize =\n| map_caption =\n| map_label   =\n| territory   =\n| result      = Chilean victory\n| status      =\n| combatants_header =\n| combatant1  =  Chile\n| combatant2  =  Peru\n| combatant3  =\n| commander1  =  José M. Alcérreca\n| commander2  =  José A. Bedoya\n| commander3  =\n| units1      =  Soldiers of Buin\n| units2      =  Guerillas of San Jerónimo\n| units3      =\n| strength1   =\n| strength2   =\n| strength3   =\n| casualties1 = 3 killed, 11 wounded\n| casualties2 = Unknown\n| casualties3 =\n| notes       =\n| campaignbox =\n}}\nThe Battle of San Jerónimo was the first battle of the Breña campaign of the War of the Pacific between April 9 and 11, 1881. The battle was fought between the newly formed Peruvian guerillas commanded by Colonel José Agustín Bedoya which were defending the town of San Jerónimo within the Department of Lima against the Chilean occupation force commanded by General José Miguel Alcérreca.\nBackground\nAfter the Occupation of Lima and the disastrous Battle of Miraflores, Colonel Andrés Avelino Cáceres would organize the Peruvian resistance to continue the fight against the Chilean Army. Being able to speak Quechua, Cáceres would organize a defense system within the Andes Mountains with Colonels Gregorio Albarracín and Juan Pacheco de Céspedes in the south and Colonel Miguel Iglesias in the north.\nIn April 1881, the occupational governor of the Peruvian capital of Lima, Pedro Lagos invited José Miguel Alcérreca and would order him to send the Soldiers of Buin and the  to battle the guerilla rebels as well as find survivors of the Battle of San Juan and Chorrillos and the Battle of Miraflores. Determined to receive results, the Chilean forces began the expedition of trekking uphill towards the Andes.\nThe Battle\nIn the town of San Jerónimo, Huarochirí Province would the Breña campaign begin with the forces under Colonel José Agustín Bedoya confronting those of Alcérreca with the latter attempting to capture in the city by the front but would be repulsed by the Peruvians through the stone walls in the town's vicinity. This would leave three Chileans killed and six wounded.\nThe next day, Major Cámus would reinforce Alcérreca with 100 soldiers as they were dispatched via train from Chosica to San Jerónimo where eight wounded from the battle would also arrive. On April 11 at 7:20 PM would Alcérreca request a further 75 soldiers which would be commanded by Colonel Adolfo Silva Vergara while simotaniously request information about their respective soldiers and the Peruvian forces. He would obtain his response by 8:45 PM that the Chileans had received three more wounded and the Peruvians had suffered enough casualties to withdraw from the town.\n}}\nFaced with this predicament, Silva Vergara ordered the town to be razed and retreat back to Chosica. On April 12 and at 3 PM, the Chileans would abandon the place \"after punishing the civilians of San Jerónimo, Cayagance, Santa Eulalia and the valley in between\" according to Alcérreca's report.\nReferences"
    }
  ]
}