{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Nauplia (1822)\n\nFirst Hellenic Republic\n| combatant2        =\n| commander1        = Andreas Miaoulis\n| commander2        = Mehmet Pasha\n| strength1         = 56 ships16 fireships\n| strength2         = 84 ships\n| casualties1       = Two fireship spent\n| casualties2       = One ship lost\n| campaignbox       =\n}}\nThe Battle of Nauplia, also known as the Battle of Spetses, was a series of naval engagements lasting from 8 to 13 September (O.S.) 1822 in the Gulf of Nauplia (Argolic Gulf) between the Greek Fleet and the Ottoman Navy during the Greek War of Independence. Although neither side sustained significant losses (according to general descriptions, it consisted of distant and ineffectual cannonade between the two fleets), the Ottomans withdrew after three failed attempts to break through the Greek fleet, and the battle is considered a Greek victory. The Ottoman fleet of eighty-four vessels under the command of Kara Mehmet Pasha (also known as Mohammed Ali) was sent to destroy Greek forces at Hydra and Spetses and to relieve the besieged Ottoman garrison at Nauplia (Nafplio).\nAdmiral Andreas Miaoulis commanded the Greek fleet. Miaoulis based his strategy on an ancient Greek admiral, Themistocles, in the Battle of Salamis, hoping to lure the superior Ottoman fleet into a narrow strait to deprive it of its freedom of manoeuvre. He divided his forces (sixteen fireships and fifty-six vessels) into three squadrons, one of which was to lure the Ottomans into the straits, another to engage them if they fell into the trap, and the final one was to defend the Greek coast between Spetses and the Peloponnesus in case the Ottomans would want to land ground troops. The first engagement took place on 8 September. Calm winds prevented the Greeks from carrying out their planned withdrawal, and two fireships were lost during a six-hour engagement; however the Ottomans withdrew to regroup rather than continue to attack – according to Greek historian Anastasios Orlandos the retreat of the Ottoman fleet occurred thanks to the conduct of Kosmas Barbatsis (1792–1887) who directed his fireship against the Ottoman flagship, which fled to avoid it, followed by the other Ottoman ships. On 10 September, the Ottomans attempted another breakthrough, but again retreated before the Greek trap was sprung. Finally, a third attack took place on 13 September; according to Konstantinos Varfis, a fireship sank an Ottoman brig: this single loss broke the Ottoman spirits, and they chose to retreat.\nAfter the battle, the Ottoman vice admiral was beheaded for his loss. The battle is considered a major victory for Miaoulis, who is said to have received \"a hero's welcome\" upon his return. Soon after the battle, the siege of Nauplia ended as the Ottoman garrison at Nauplia capitulated and surrendered the fortresses of Nafplion in December.\nSee also\n* Antonios Kriezis, another participant in the battle\nFurther reading\n*\nReferences\n}}"
    }
  ]
}