{
  "content": [
    {
      "type": "text",
      "text": "# Battlehawks 1942\n\n|genre = Combat flight simulator\n|modes = Single-player\n|platforms = MS-DOS, Amiga, Atari ST\n}}\nBattlehawks 1942 is a naval air combat combat flight simulation game released in 1988 by Lucasfilm Games. It is set in the World War II Pacific air war theatre, and was the first of Lucasfilm Games' trilogy of World War II flight simulations, followed by Their Finest Hour (1989) and Secret Weapons of the Luftwaffe (1991). The 127-page manual for Battlehawks 1942 includes a 100-page illustrated overview of the Pacific War. The preface to the manual was written by Richard Halsey Best, who commanded the dive bomber squadron that sank two Japanese aircraft carriers during the Battle of Midway.\nGameplay\nIn Battlehawks 1942, the player can participate in four pivotal naval battles of the Pacific war:\n* The Battle of the Coral Sea (May 4–8, 1942)\n* The Battle of Midway (June 4–5, 1942)\n* The Battle of the Eastern Solomons (August 23–25, 1942)\n* The Battle of the Santa Cruz Islands (October 26, 1942)\nIn each of these battles, the player can experience the same situation from the U.S. side or the Japanese side of the battle. The player can fly authentic aircraft of the era such as Grumman F4F Wildcats, Douglas SBD Dauntlesses and Grumman TBF Avengers on the U.S. side and Mitsubishi A6M Zeros, Aichi D3A \"Vals\" and Nakajima B5N \"Kates\" on the Japanese side. Realism settings such as invincibility, unlimited ammo and unlimited fuel, starting altitude and the caliber of the opposition pilots were present, so Battlehawks was customizable.\nEach mission started with a briefing, giving the pilot a general outline of what was needed to do. In a departure from the usual flight-sim standards requiring players to perform take offs and landings,  Battlehawks 1942 allowed players to get immediately into the action.\nAs with most flight simulators, Battlehawks has a cockpit view, switchable with the keypad for a look around the aircraft. Instruments are few: airspeed, altimeter, bank and pitch, fuel, rate-of-climb, RPM, compass and indicators for fuel and engine/airframe damage. The cockpit also had levers for landing gear, speed brakes (if equipped) and flaps.\nThe Battlehawks 1942 manual includes details Fighter Tactics instructions, such as deflection shooting or how to perform overhead approaches from the same or the opposite course. Mission types included escorting bombers as well as fighter interceptions, which were generally quite challenging and gave a great view of the diversity of the missions that were flown in the Pacific in 1942. Allied players flying Grumman F4F Wildcats would find themselves often vastly outnumbered in a desperate attempt to save their carriers from waves of Japanese Aichi D3A Val dive bombers.\nThere are also dive-bombing and torpedo-bombing missions on both sides. Dive-bomber and torpedo-bomber tactics were also discussed in the manual.\nThe graphics throughout the game use a sprite-based (so-called) 3D engine, which is based on bitmaps which are rotated and scaled depending on the player's view. Muzzle flashes and tracers were present, the aircraft took hits and caught fire, smoked or exploded with the pilot bailing out with a parachute.\nEnemy artificial intelligence (AI) also was of high quality. Enemy aircraft would twist, turn, jink and realistically evade enemy fire. The performance characteristics of the various aircraft were realistically modeled so that, for example, the more nimble Japanese Zeros were very good at outmaneuvering U.S. fighters such as the F4F Wildcat.\nExcellent pilots achieved promotions and several medals in Battlehawks (Air Medal, DFC, Bronze Star, Silver Star, Navy Cross and the Medal of Honor - if the player's own aircraft received severe hits, the Purple Heart was awarded).\nPacific theater air combat simulation successors of Battlehawks include: Aces of the Pacific (1992), 1942: The Pacific Air War (1994), Pacific Strike (1994), WarBirds (1997), and Pacific Fighters (2004).\nReception\nComputer Gaming World very favorably reviewed the game, citing its graphics, historical accuracy, and innovative replay feature, giving the player a free-roaming camera with which to view the action. The magazine later awarded the game as \"Action Game of the Year\", reiterating those praises, a 1991 survey in the magazine of strategy and war games gave it four stars out of five, and a 1993 survey gave the game three stars. Compute! also praised the game's graphics, accuracy, and replay, and also cited its unpredictable enemies as a virtue. According to the review in STart, \"if you're an aviation enthusiast at all, you'll want Battlehawks 1942 just for its extensive manual. It's 127 pages of history, tactics, theory and aviation lore and includes fold-out maps of the battles in which you can fly. It's truly a spectacular production and almost worth the price of the game by itself.\"  The game was also well received by the reviewers of Dragon, where it was given 5 out of 5 stars.\nAccording to the game's designer Lawrence Holland, Chris Roberts told him at an industry conference that he had reverse-engineered Battlehawks 1942 to create the game engine for Wing Commander. Holland said: \"Many years ago, while working at Skywalker ranch on Battlehawks 1942, I overheard two people talking over my shoulder about the game I was working on. Imagine my surprise when I turned around and saw Steven Spielberg and George Lucas discussing it and learning further that Steven Spielberg was playing and enjoying it. He was an early video game convert.\"\nReviews\n*''Isaac Asimov's Science Fiction Magazine v13 n6 (1989 06)\n* #58\n*Fire & Movement'' #76\nReferences\n}}\nExternal links\n*\n*\n*[https://web.archive.org/web/20070403095628/http://www.thelegacy.de/Museum/3766/ The Legacy museum]"
    }
  ]
}