{
  "content": [
    {
      "type": "text",
      "text": "# Battle of the North Fork of the Red River__disambig_1\n\n|result=U.S. victory\n|combatant1=4th Cavalry Regiment (United States), Tonkawa scouts\n|combatant2=Comanche Kotsoteka Band\n|commander1=Ranald S. Mackenzie\n|commander2=Kai-WotcheMow-way (escaped)\n|strength1=12 officers and 272 enlisted men, 20 Tonkawa scouts\n|strength2=Unknown, but the best guesses are 160 in the band, including 100 women and children\n|casualties1=3 killed7 wounded\n|casualties2=Approximately 50 killed130 captured\n|map_type= Texas\n|map_caption= Location within Texas\n|map_label= North Fork of Red River Battlefield\n}}\nThe Battle of North Fork or the Battle of the North Fork of the Red River occurred on September 28, 1872, near McClellan Creek in Gray County, Texas, United States.  A monument on that spot marks the site of the battle between the Comanche Indians under Kai-Wotche and Mow-way and a detachment of cavalry and scouts under U.S. Army Colonel  Ranald S. Mackenzie. There was an accusation that the battle was really an attempt \"to make a massacre,\" as during the height of battle some noncombatants were wounded while mixed in with the warriors.\nThis battle is primarily remembered as the place where the army for the first time struck at the Comanches in the heart of the Llano Estacado in the western panhandle of Texas.\nPrelude to the Red River War\nThis battle was a precursor to the Red River War of 1873–4. In early 1872, the new Military Commander of the District of Texas decided it was time to strike at the Comanches in the heart of their homeland on the Comancheria, much as the Texas Rangers had done 14 years before at the Battle of Little Robe Creek. The Grant administration's \"Quaker Peace Policy\" was still in effect, which placed the appointment of Indian agents in the hands of Protestant religious organizations (Quakers were the first to participate, thus the name of the policy), not political patrons. In addition, Indians were to be moved to reservations peacefully or forcefully, and U.S. troops were not to engage in combat against them. Under the policy, federal troops at Fort Sill could not be deployed against the Comanche. Troops from the Texas District, however, could be.\nCampaign in the Staked Plains\nMackenzie marched out of Fort Concho in early July 1872, to begin his campaign.  He reestablished Camp Supply on Duck Creek, on the edge of the Llano Estacado where he established his command.  From there, McKenzie dispatched several scouting parties, one of which discovered a well-traveled path with hoof prints of a large herd of cattle stretching west. This find caught Mackenzie's attention, and on July 28, 1872, he marched 272&nbsp;troopers, 12&nbsp;officers, and 20&nbsp;Tonkawa scouts into the heart of the Comancheria. On August 7, 1872, the detachment obtained supplies and rested at Fort Sumner, New Mexico.  They then marched north to Fort Bascom, New Mexico, arriving August 16, 1872.\nOrtiz, who accompanied Mackenzie, led the command to the east, skirting Palo Duro Canyon.  Mackenzie split off smaller detachments to search possible locations of the Indian camps but with no success. They returned to Camp Supply on August 31, 1872.  The expedition had marched close to  over a five-week period, and discovered two new routes through the Staked Plains.  These routes were reported to be shorter and had better water access than the Goodnight–Loving Trail that was being used to drive cattle to markets in Kansas.\nMackenzie rested his men until September 21, when he marched his troops north to search the last potential campsite of the Comanche, on the north fork of the Red River. On September 28, a scouting patrol under Lt. Boehm and Captain Wirt Davis, discovered a large Kotsoteka Comanche village. The cavalry moved within a half mile of the village before they were seen by the Indians. From there, they charged the village, capturing it after a half-hour battle. Mackenzie lost three men and three were wounded. The Comanche lost an estimated fifty or more, including Chief Kai-Wotche and his wife, who were both killed.  Mow-way (Shaking Hand) escaped.\nThe Battle of North Fork\nThe army had caught the village completely unaware, and captive Clinton Smith in later years would accuse Mackenzie and the army of a massacre.  Mackenzie reported officially twenty-three Comanches killed, although there may have been more.  The warriors, who sustained heavy casualties, threw some of their dead into a ten-foot-deep pool to keep them away from the Tonkawas' knives and cooking pots; the Tonkawas were reputedly cannibals.\nAs justification for the attack, the army claimed it found overwhelming proof of the band's raids on white settlements in the wreckage of the village.   For instance, a survivor of the wagon train massacred at Howard's Wells the previous spring recognized forty-three of its mules.\nAlmost 800–3000 horses were rounded up by the troops while the lodges, along with the stores of meat, equipment, and clothing, save for a few choice robes, were burned.  About 130 Comanches, mostly women and children, were taken prisoner, but six of these were too badly wounded to be moved long distances.\nAfter dark, Mackenzie's command moved to the hills several miles away from the burned village and camped. Fearing that the captured pony herd would stampede the cavalry horses, Mackenzie had them corralled. That night and the next, however, the Comanches succeeded in recovering most of their horses, plus those of the Tonkawa scouts.   The Comanche prisoners were kept under guard as the command rejoined its supply train and retraced its route back south to the main supply base on Duck Creek, where the Indians were transferred to Fort Concho, where they were kept prisoner through the winter.  MacKenzie used the captives as a bargaining tool to force the off-reservation Indians back to the reservation, and to force them to free white captives.\nAftermath\nMacKenzie's stratagem worked, for shortly after the battle, Mow-way and Parra-o-coom (Bull Bear) moved their bands to the vicinity of the Wichita Agency. The Nokoni chief Horseback, who himself counted family members among the Indian prisoners, took the initiative in persuading the Comanches to trade stolen livestock and white captives, including Clinton Smith, in exchange for their own women and children.\nCorporal William O'Neill, Blacksmith James Pratt, Farrier David Larkin, Privates Edward Branagan and William Rankin, Corporal Henry McMasters, Sergeant William Wilson, Sergeant William Foster, and First Sergeant William McNamara were awarded the Medal of Honor.\nThe Red River Campaign\nThis marked the first time the United States had successfully attacked the Comanches in the heart of the Comancheria and showed that the Llano Estacado were no longer a safe haven.  Further, this battle emphasized that if the army wished to force the free Comanches onto reservations, the way to do it was destroy their villages and leave them unable to survive off-reservation.  MacKenzie's tactics were such a success that William T. Sherman empowered him to use them further during the Red River War of 1874.  Mackenzie's attack on the village at the Battle of Palo Duro Canyon and his destruction of the Comanche horse herd at Tule Canyon, both in 1874, mirrored this battle in strategy and effect.\nSee also\n*Texas-Indian Wars\nReferences\nFootnotes\nBibliography\n* Bial, Raymond. Lifeways: The Comanche. New York: Benchmark Books, 2000,\n* Brice, Donaly E. The Great Comanche Raid: Boldest Indian Attack on the Texas Republic – McGowan Book Co. 1987,\n* \"Comanche\" [https://web.archive.org/web/20050711082454/http://www.gbso.net/Skyhawk/comanche.htm Skyhawks Native American Dedication] (August 15, 2005)\n* [https://www.youtube.com/watch?v=jyR4KKXgTiE \"Comanche Warrior\" – Documentary Excerpt, Part 1] – History Channel (November 27, 2005)\n* [https://www.youtube.com/watch?v=rp9ZTa0waVs \"Comanche Warrior\" – Documentary Excerpt, Part 2] – History Channel (November 27, 2005)\n* Dunnegan, Ted. [https://web.archive.org/web/20080509122616/http://www2.itexas.net/~teddun/tedspage.htm Ted's Arrowheads and Artifacts from the Comancheria] (August 19, 2005)\n* Fehrenbach, Theodore Reed The Comanches: The Destruction of a People. New York: Knopf, 1974, . Later (2003) republished under the title The Comanches: The History of a People\n* Foster, Morris. Being Comanche.\n* Frazier, Ian. Great Plains. New York: Farrar, Straus, and Giroux, 1989.\n* Hacker, Margaret S., Cynthia Ann Parker: The Life and the Legend – Texas Western Pr; 1st edition 1990,\n* John, Elizabeth and A.H. Storms ''Brewed in Other Men's Worlds: The Confrontation of the Indian, Spanish, and French in the Southwest, 1540–1795. College Station, TX: Texas A&M Press, 1975.\n* Jones, David E. Sanapia: Comanche Medicine Woman. New York: Holt, Rinehart and Winston, 1974.\n* Lodge, Sally. Native American People: The Comanche. Vero Beach, Florida 32964: Rourke Publications, Inc., 1992.\n* Lund, Bill. Native Peoples: The Comanche Indians. Mankato, Minnesota: Bridgestone Books, 1997.\n* Mooney, Martin. The Junior Library of American Indians: The Comanche Indians. New York: Chelsea House Publishers, 1993.\n* [http://www.nativeamericans.com/Comanche.htm Native Americans: Comanche]  (August 13, 2005).\n*Powell, Jo Ann, Frontier Blood: the Saga of the Parker Family\n* Richardson, Rupert N. The Comanche Barrier to South Plains Settlement: A Century and a Half of Savage Resistance to the Advancing White Frontier. Glendale, CA: Arthur H. Clark Company, 1933.\n* Rollings, Willard. Indians of North America: The Comanche. New York: Chelsea House Publishers, 1989.\n* Secoy, Frank. Changing Military Patterns on the Great Plains. Monograph of the American Ethnological Society, No. 21. Locust Valley, NY: J. J. Augustin, 1953.\n* Streissguth, Thomas. Indigenous Peoples of North America: The Comanche. San Diego: Lucent Books Incorporation, 2000.\n* [http://www.texasindians.com/comanche.htm \"The Texas Comanches\" on Texas Indians] (August 14, 2005).\n* Wallace, Ernest, and E. Adamson Hoebel. The Comanches: Lords of the Southern Plains. Norman: University of Oklahoma Press, 1952.\nExternal links\nAnderson, H. Allen: [http://www.tshaonline.org/handbook/online/articles/qfn02 Battle of the North Fork] – from Handbook of Texas online''\n* [https://www.flickr.com/photos/lakota_sioux_and_comanche_indians/11282928623/sizes/o/in/photostream/ Map of Comancheria]"
    }
  ]
}