{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Taipale__disambig_1\n\n&nbsp;–\n| place             = Metsäpirtti, Karelian Isthmus\n| coordinates       =\n| map_type          = Russia Leningrad Oblast#Finland\n| map_relief        = yes\n| map_size          =\n| map_marksize      =\n| map_caption       =\n| map_label         =\n| map_mark          =\n| casus             =\n| territory         =\n| result            = Finnish victory\n| combatant1        =\n| combatant2        =\n| commander1        =  Hugo Österman\n| commander2        =  Vladimir Grendal }}\n| units1            =  10th Division\n| units2            =  4th Rifle Division\n49th Rifle Division\n142nd Rifle Division\n150th Rifle Division\n39th Armored Brigade\n}}\n| casualties1       = 2,250 killed and wounded\n| casualties2       =  10,000+\n| campaignbox       =\n}}\nThe Battle of Taipale was a series of battles fought during the Winter War between Finland and Soviet Union from 6 to 27 December 1939. The battles were part of a Soviet campaign to penetrate the Finnish Mannerheim Line in the Karelian Isthmus region to open a route into southern Finland. Despite their numerical superiority, the Soviet forces were unable to break through the Finnish defences.\nPrelude: 30 November – 6 December\nat eastern end of Mannerheim Line.]]\nOn 30 November, Soviet forces crossed the Finnish border and bombarded civilian targets from the air. The Karelian Isthmus was split into two military sectors by both belligerents: one on the side of Lake Ladoga and the other on the side of the Gulf of Finland. In the Ladoga sector, the Soviet commanding officer was Vladimir Grendahl and on the Finnish side, Erik Heinrichs. On 3 December, Grendahl received orders to make a breakthrough in his sector, as the defenders in the other sector were more numerous and offered fiercer resistance. The former objective of reaching Viipuri on the Gulf side of the Karelian Isthmus became a secondary priority. The attack began on 6 December, when the Finns had retreated to the Mannerheim Line.\nThe battle: 6–27 December\nThe Battle of Taipale began on 6 December, started when the Soviet 49th and 150th Rifle Divisions of the 7th Army tried to cross the Taipale River at three locations.\nAccording to Chew, \"The 7th Army's offensive began in earnest on 15 December, when a new attack was launched against the eastern sector of the Line near Taipale. The same bloody scenario was repeated with fresh Soviet troops the next two days. Having an excellent field of fire, the Finnish gunners inflicted prohibitive losses on the enemy who had to advance across open fields and ice.\"\nChew further states, \"The endurance of the 10th Division at Taipale was remarkable. No other sector was subjected to such prolonged punishment - by artillery, aircraft, and ground attacks which frequently developed into major offensives. With the failure of these attacks, the fighting on the Isthmus reached a stalemate. Already on 27 December Soviet troops had been observed building field fortifications in the Summa sector, indicating a defensive posture.\"\nNotes\nReferences\nCitations\nSources\n;In English\n*\n*\n*\nOnline sources\n*\n;In Finnish\n*\n*\n*\n*\n;In Russian\n*\n*\nOnline sources\n*\n}}\n*\n}}\nFurther reading\n*\nExternal links\n*[http://waralbum.ru/category/war/east/winter_war/ Военный альбом] (photographs of the Soviet–Finnish War 1939–1940)\n*[http://www.arkistot.info/jr28/jr28.php JR28 War diaries]  (The digitized contemporary war diaries of the Finnish regiment that fought in the Taipale front 1939–1940. In Finnish.)"
    }
  ]
}