{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Quebracho Herrado\n\n| map_type    = Argentina\n| map_relief  = 1\n| map_size    =\n| map_marksize =\n| map_caption =\n| map_label   =\n| territory   =\n| result      = Federal victory\n| status      =\n| combatants_header =\n| combatant1  =  Federalists\n| combatant2  =  Unitarians\n| commander1  = Manuel Oribe\n| commander2  = Juan Lavalle\n| strength1   = Total: 4,250–4,600350 infantry4,250 cavalry(1,200 dismounted)4 cannons\n| strength2   = Total: 6,5001,600 infantry4,900 cavalry5 pieces of artillery\n| casualties1 = 36 killed and 50 wounded\n| casualties2 = 500–1,500 killed500–1,000 prisoners\n| notes       =\n| campaignbox =\n}}\nThe Battle of Quebracho Herrado, fought on 28 November 1840 in the east of Córdoba Province, Argentina, was a victory for the Argentine federal army, led by former Uruguayan president, Brigadier Manuel Oribe over the Unitarian army led by Brigadier Juan Lavalle, during the Argentine Civil Wars.\nBackground\nIn 1840, a revolt against the dictatorial rule of Juan Manuel de Rosas began in the interior of Argentina.\nBrigadier Juan Lavalle assembled about 4,000 men, mostly from Corrientes Province but with some exiles from Buenos Aires Province.\nHe invaded Entre Ríos Province with this force.\nHe fought a Federal army of about 5,000 men under the command of the Governor, Brigadier Pascual Echagüe at the Battle of Don Cristóbal (10 April 1840) and the Battle of Sauce Grande (16 July 1840).\nAbout the same time, the Unitarian Coalition of the North was formed by the governments of five provinces opposed to Rosas.\nThe Coalition forces numbered about 2,000 men under the command of Colonel Major Gregorio Aráoz de Lamadrid.\nLamadrid managed to stop an attack led by the governor of San Juan Province, Colonel Nazario Benavídez, and the governor of Santiago del Estero Province, Brigadier Juan Felipe Ibarra.  Lamadrid later held Córdoba Province, helping to install a liberal government there as a coalition ally.\nAfter Sauce Grande, Lavalle was expelled from Entre Ríos by Echagüe.\nHe moved down the Paraná River and invaded Buenos Aires Province with 2,500 men, but failed in his attempt to defeat Rosas due to federal resistance from Buenos Aires and the lack of French support.\nHe therefore returned to Santa Fe Province, pursuing the federal forces of that province commanded by Brigadier Juan Pablo López, who had gone down to Buenos Aires to support Rosas.  He occupied Rosario and the capital city of Santa Fe.  He was held up for a month by indecision and by the tenacious defense of López and his deputy, Lieutenant Colonel Jacinto Andrada.\nHe became surrounded by the Federal army led by General Oribe, whom the government of Buenos Aires had placed in command of their army.\nLavalle agreed with Lamadrid, who already occupied Córdoba Province, to move to that province and join forces.\nThey agreed to meet at the post of Romero, in the center of Santa Fe Province, on 20 November.\nLavalle left Santa Fe on 18 November and headed towards Romero, closely pursued by the forces of Oribe and Juan Pablo Lopez.\nOribe had made a march that is perhaps unique to the history of Argentina, covering about  in two days through a desert region. Oribe's persecution was so intense that Lavalle, handicapped by a convoy of anti-Rosas civilians from Santa Fe, had to stop every few minutes to force him to form up for battle, even when he did not mean to give battle. After a few days with no news of Lavalle, Lamadrid retreated some distance to the west without warning Lavalle or their allies.\nWhen Lavalle reached his destination, Lamadrid was not there and nobody knew where he was.\nLavalle, harried by the federals, went to the post of Quebracho Herrado in the eastern part of Córdoba Province.\nDevelopment of the battle\nForced by circumstances, Lavalle waited Oribe's attack on 28 November. The battle began at noon.\n4600 Unitarian soldiers clashed (350 infantry, 4000 cavalry, of which 1200 were dismounted, and 4 guns) against over 6500 Federals (1600 infantry and nearly 5000 cavalry with five pieces of artillery). Lavalle decided to place the burden of the battle on his right wing, led by Colonel Niceto Vega.\nIts rapid charge arrested the Federal cavalry of the left wing, under the orders of Colonel Hilario Lagos, some distance from the battlefield, but failed to make it retreat.\nTherefore, Lavalle's cavalry could not attack the Federal reserve or the infantry.\nOn the other federal wing, however, the cavalry led by Colonel Major Ángel Pacheco, including the first division of Santa Fe led by commander Andrada, easily overcame the Unitarian cavalry on the left under Colonel José María Vilela,\nand went on to attack the Unitarian army reserves.\nIn the center, the balance between the Unitarian infantry of Colonel Pedro José Díaz and the Federal infantry of Lieutenant Colonel Jerónimo Costa held for four hours.\nThe Unitarian right was demoralized being seeing the rest of the army losing, was surrounded by the forces of General Pacheco and had to withdraw.\nIn a last effort, Lavalle took personal command of the reserve and launched into the fight.\nAt 4 pm, the horses of the Unitarian army stopped moving and Oribe had the victory.\nMore than 500 men were killed during the battle and more than a thousand Unitarian soldiers were taken prisoner, as the cavalry were on foot and could no longer protect the infantry. Colonel Diaz was taken prisoner and would spend several years in Rosoas' prisons.\nYears later he would fight beside him in the Battle of Caseros.\nThe federal army also captured several hundred civilians, who accompanied Lavalle from Buenos Aires and Santa Fe.\nThey also took the artillery and baggage. The federal army lost 36 killed and 50 wounded.\nThe soldiers who escaped the massacre fled in disorder to the city of Córdoba. Oribe's men, however, due to the long chase they had done,\nhad to rest before making a thorough pursuit. They stayed on the battlefield, and set about plundering the baggage of the civilians who had marched with the army.\nAftermath\nAfter the terrible defeat, Lamadrid rushed to help the remnants of the defeated army with 1,500 men.\nHe met Lavalle at El Tío, and the two men each bitterly reproached the other for being absent from the post of Romero.\nThat led to a series of conflicts between the two Unitarian heads, who could not stay in Córdoba.\nAs a result of the defeat, and the misunderstandings between Lavalle and Lamadrid, both decided to withdraw to the north.\nThey attempted a reorganization. Months later they separated and Lamadrid, with a new army, invaded Cuyo, while Lavalle remained in Tucumán.\nUltimately, eight months later, Lavalle was defeated at the Battle of Famaillá and Lamadrid in the Battle of Rodeo del Medio, in Mendoza Province.\nWith that the Northern Coalition disappeared.\nThe Battle of Quebracho Herrado was the largest of the civil war that shook Argentina between 1839 and 1842, one of several civil wars suffered by that country in the nineteenth century. It was not absolutely decisive, but the situation turned dramatically in favor of the federal party,\nwho would eventually triumph in the Battle of Caseros in 1852.\nReferences\nNotes\nCitations\nSources\n* |url=http://www.lanacion.com.ar/674376-el-pueblo-testigo-de-una-batalla-historica |title=El pueblo testigo de una batalla histórica |work=La Nación |year=2004 |access-date=5 November 2012 |archive-date=9 November 2013 |archive-url=https://web.archive.org/web/20131109124600/http://www.lanacion.com.ar/674376-el-pueblo-testigo-de-una-batalla-historica |url-status=dead }}\n* |url=http://www.legionunitaria.granaderos.com.ar/historial.htm\n|title=Granaderos - Historial. Cronología 1935-1946}}\n*\n*\n|title=Quebracho Herrado (28 de noviembre de 1840)}}\nFurther reading\n* Quesada, Ernesto, Lavalle y la batalla de Quebracho Herrado, Ed. Plus Ultra, Bs. As., 1965.\n* Aráoz de Lamadrid, Gregorio, Memorias, Bs. As., 1895.\n* Saldías, Adolfo, Historia de la Confederación Argentina, Bs. As., 1892.\n* Sosa de Newton, Lily, Lavalle, Ed. Plus Ultra, Bs. As., 1973.\n* Beverina, Juan, Las campañas de los ejércitos libertadores 1838-1852, Bs. As., 1923."
    }
  ]
}