{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Picenum\n\nThe Battle of Picenum was one of the major battles of the Third Servile War, between the slave army of Spartacus and the combined consular forces of the Roman Republic led by the two consuls Lucius Gellius and Gnaeus Cornelius Lentulus Clodianus. It took place in Picenum region in 72 BC. It was a victory for Spartacus, and it proved to be his greatest triumph of the war.\nBackground\nThe slave revolt in southern Italy that was initiated by the former gladiator Spartacus along with other slave leaders in 73 BC was at first given little regard by the Senate. However, as the rebels kept piling on victories in battle since their first major victory at the Battle of Mons Vesuvius, wiping out small Roman army units and garrisons as they went, the Senate grew considerably alarmed, such that they finally sent consular and legate armies south to crush the revolt. This endeavor initially succeeded, with the consul Gellius leading an army to crush a rebel force led by Spartacus' colleague Crixus at the Battle of Mons Garganus in Gargano which also led to Crixus' death. With the word of Crixus' defeat having reached him, Spartacus had the 300 Roman prisoners that he held captive to fight each other to the death in a manner similar to the gladiatorial combats as revenge for and in honor of Crixus.\nSpartacus then marched northward from his base in central Apulia via the Apennines towards Cisalpine Gaul, probably in the intent to plunder the rich harvests of the region to feed his huge slave army of 70,000 and hopefully turn the cities there against Rome. Gellius then maneuvered at the rear of Spartacus' army and also moved northwards, while another force led by the other consul Lentulus attempted to block the enemy advance from the far north. But the operation by the two consuls ended in a fiasco when Spartacus rapidly ordered an attack on Lentulus' force, defeated it, and then turned to the rear against Gellius and similarly defeated him; both consular armies retreated in disorder in different directions.\nAs Spartacus marched on, many escaped slaves and gladiators as well as deserters and disaffected peasants from nearby towns continued to join his cause, increasing the size of his army to 120,000 men. Spartacus then made the decision to march directly on Rome itself to force the issue, having beforehand burnt all material deemed useless, killed all prisoners, and butchered his pack-animals to maximize the movement of his force. Meanwhile, the two consuls, Gellius and Lentulis, returned to Rome with the remainder of their forces, regrouping and enlarging their legions. The consuls then decided to combine their forces and intercept Spartacus' army.\nBattle\nSpartacus and his slave army was maneuvering around the Apennines to get to Rome, while the combined consular army led by Gellius and Lentulus was on its way to meet the rebels. The two sides finally met in Picenum. Once again, with the numbers on his side, Spartacus spectacularly defeated and inflicted heavy losses on the combined consular army, which then retreated to Rome in disorder for the second time. Spartacus now experienced the greatest victory of his military career, having routed and crushed two large consular armies in a single battle. The battle at Picenum was the most spectacular victory of Spartacus' slave army during the conflict, and proved to be the gravest Roman defeat of the war.\nAftermath\nWith his triumph in Picenum, Spartacus was poised to finally march on Rome and afterwards his army were just a few kilometers northeast of the city. But as the routed remnants of the combined consular armies reached Rome just in time, Spartacus came to the realization that he was not yet ready for the final battle on the city, considering that his motley army was not suitably armed for such an operation. Despite marching for hundreds of kilometers across Italy, aside from bands of escapees and criminals, no city had yet joined his cause. He then withdrew back to southern Italy, taking the town of Thurii and the surrounding countryside, and trading plunder with merchants for bronze and iron for manufacture of more weapons. Meanwhile, several Roman forces were sent south to deal with the rebels and were repeatedly defeated by the same.\nIt would be the next year in 71 BC when the Senate finally realized the grave danger the seemingly unstoppable slave rebellion led by Spartacus posed to the Republic. The two Roman consuls were dismissed as commanders to give way for a new leadership under Marcus Licinius Crassus, who would prove instrumental in reversing the tide of the conflict in Rome's favour during the battles to come.\nReferences\n* T. Robert S. Broughton, The Magistrates of the Roman Republic, Vol II (1952)."
    }
  ]
}