{
  "content": [
    {
      "type": "text",
      "text": "# Battle Cry (Havana Brown song)\n\n| recorded   =\n| studio     =\n| venue      =\n| genre      = Dance-pop\n| length     =\n| label      = Universal Music Australia\n| writer     =\n| producer   =\n| chronology = Havana Brown\n| prev_title = Bullet Blowz\n| prev_year  = 2015\n| next_title = Ba*Bing\n| next_year  = 2015\n| misc       =\n|header=Music video}}\n}}\n\"Battle Cry\" is a song by Australian DJ and singer Havana Brown featuring Bebe Rexha and Savi. The song was released as a single on 24 July 2015 and debuted on the Australian ARIA Singles Chart at number 59 for the week commencing 17 August 2015.\nBackground and release\nBy the end of 2014, Havana Brown had scored her fourth consecutive number one single in the US on the US Dance Club Songs chart.\nIn early 2015, Brown released two singles; both collaborations and both dance tracks. On 7 July, Havana announced the release of a new single via a short video message upload onto her Facebook page.\nSong and video previews followed before the song made its premiere on Nova on 23 July 2015.\nThe single is described as a change from her usual dance anthems and she credits her 30th birthday with the new sound. In discussing the song, Brown said, “I still love my club music but there are different things that are inspiring me now.”\nIn an interview with Vegas Magazine, Savi discussed having met Havana Brown in 2009/10 when Brown travelled to the United States, promoting “We Run the Night”. Savi remixed the track and said the two had talked about working on something together. In 2015, Savi remixed Bebe Rexha’s song, \"I'm Gonna Show You Crazy”. “Battle Cry” provided the opportunity for all three to work together.\nMusic video\nThe music video was directed by The Squared Division and released on Havana Brown's Vevo account on 30 July 2015 at a total length of 3 minutes and 29 seconds.\nThe video has been described as \"glam-western\" and sees Brown wearing a '70s-inspired outfit as she goes \"bad girl\" in the desert, exacting revenge on several shirtless men.\nIn an interview, Brown explained the reason for the western-themed video, saying \"I think in the song, there's a lot of metaphors that relate to the Western [theme], the bangs, and the gun, talking about rifles, it's a very tough song. It's a song about not allowing people to walk all over you and demanding some sort of respect.\"\nCritical reception\nMike Wass of Idolator gave the song a positive review saying, \"A fiery kiss-off anthem, 'Battle Cry' finds the divas coming to terms with their bad boyfriends. Bebe sings in a hook-filled verse, while Havana handles the chorus over a light dub-step breakdown [and] the track exceeds all expectations.\"\nHowever, Kevipod on Direct Lyrics expected better, writing \"I find it to be a bit disappointing\".\nCharts\n{| class=\"wikitable plainrowheaders\" style=\"text-align:center\"\n|-\n! Chart (2015)\n! Peakposition\n|-\n! scope=\"row\"| Australia (ARIA)\n| 59\n|-\n|}\nReferences"
    }
  ]
}