{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Gjorm\n\nBalli Kombëtar LANÇ\n| combatant2        =\n| commander1        = Hysni Lepenica\n| commander2        =  Franco Clementi\n| commander3        =\n| strength1         = Initially 1,600 Balli Kombëtar troops\n| strength2         = Initially 2,000 troops\ntroops500 field gunstanks\n| strength3         =\n| casualties1       = Minimal\n| casualties2       = 186 KIAseveral thousands wounded80 POW2 tanks29 machine guns3 field guns\n| casualties3       =\n| notes             =\n}}\nThe Battle of Gjorm () was a battle of the Albanian Resistance of World War II against the Kingdom of Italy. The battle took place on January 1–2, 1943, in the areas of Gjorm, Vranisht, Dukat, Tragjas and Tërbaç in south-western Albania.\nPrelude\nAfter the occupation of the Kingdom of Albania by the Kingdom of Italy in 1939, several resistance groups were formed. The most important of these groups were Balli Kombëtar, a nationalist organization formed by Mit'hat Frashëri and Ali Këlcyra and the Albanian National Liberation Front, which later became a communist group led by Mehmet Shehu and Enver Hoxha.\nDukat and Gjorm became two of the centers of Balli Kombëtar, whose forces in the region  were led by Euklid Karistopoli, a military commander, and Hysni Shehu, a prominent lawyer from Tragjas. Dimitro Kokalari, a commander of the Albanian National Liberation Front, created a partisan unit in the wider region of Mallakastër.\nBeginning in mid-1942, there were frequent minor attacks against the Italian troops located in the area. In November 1942, these attacks intensified. The commander of the heavily armed Italian troops in the area, which initially numbered 2,000, was Colonel Franco Clementi.\nBattle\nThe main battle, which lasted thirty-six hours, took place on January 1–2, 1943. The Albanian units were supported during the battle by 5 local volunteers. During the battle, the Italian army used tanks as well as field guns and many machine guns.\nThe battle ended with the decisive defeat of the Italians, who were completely routed from the battlefield, which came under Albanian control. A total of 186 Italian soldiers and officers were killed, including the commander of the Italian troops, Colonel Clementi, while thousands were wounded and 80 were taken prisoner. Two Italian tanks were destroyed, while military equipment captured by the Albanians included three field guns, twenty-nine machine guns, large quantities of ammunition, and hundreds of rifles.\nAftermath\nAfter being defeated and routed from the battlefield, the Italian army engaged in reprisals against the civilians of the five villages of Dukat, Gjorm, Trëbaç, Tragjas, and Vranisht. The Italian air force bombed the villages.  During these attacks, there were many civilian victims including the mayor of Dukat, Shukri Cane. As a consequence of another punitive expedition, Gjorm was also mortared until it was completely ruined.\nA 1981 painting by Fatmir Haxhiu, entitled Gjorm War (), commemorates the Battle of Gjorm. The painting is on display in the National Historical Museum of Albania.\nReferences"
    }
  ]
}