{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Ayacucho__disambig_1\n\n* Capitulation of the Royal Army of Peru under command of Viceroy la Serna (siege of the bastions of Chiloé and Callao are extended until 1826)\n* Consolidation of the independence of the Peruvian Republic\n|combatant1 = Patriots:  Peru\n|combatant2 = Royalists:\nSpanish Empire\n*Viceroyalty of Peru\n*Governorate of Chiloé\n|commander1 =  Antonio de Sucre Agustín Gamarra\n|commander2 =  José la Serna   José de Canterac\n|strength1  = 5,780–8,500\n|strength2  = 6,906–9,310\n|casualties2 = 2,500 killed and wounded  2,000–3,000 captured\n|casualties1 = 979 killed and wounded\n|campaignbox =\n| map_type    = Peru#South America#America\n| map_relief  =\n| map_size    = 300px\n| map_marksize =\n| map_caption =\n| map_label   =\n}}\nThe Battle of Ayacucho' (, ) was a decisive military encounter during the Peruvian War of Independence. This battle secured the independence of Peru and ensured independence for the rest of belligerent South American states. In Peru it is considered the end of the Spanish American wars of independence in this country, although the campaign of Antonio José de Sucre continued through 1825 in Upper Peru and the siege of the fortresses Chiloé and Callao eventually ended in 1826.\nAt the end of 1824, Royalists still had control of most of the south of Peru as well as of the Real Felipe fortress in the port of Callao. On 9 December 1824, the Battle of Ayacucho (Battle of La Quinua) took place between Royalist and Independentist forces at Pampa de Ayacucho (or Quinua), a few kilometers from Ayacucho, near the town of Quinua. Independentist forces were led by Simón Bolívar's lieutenant Antonio José de Sucre. Viceroy José de la Serna was wounded, and after the battle second commander-in-chief José de Canterac signed the final capitulation of the Royalist army.\nThe modern Peruvian Army celebrates the anniversary of this battle.\nBackground\nIn January 1820, Spain underwent a political upheaval, beginning with a revolt against the king, Ferdinand VII. An expedition of 20,000 soldiers was to be sent to Río de la Plata (roughly the present-day territories of Argentina, Chile, Bolivia, Paraguay and Uruguay) to help the royalists of America, but instead, they revolted with the encouragement of General Rafael Riego. In the subsequent weeks the revolt spread, and King Ferdinand was forced to restore the liberal Spanish Constitution of 1812, which he had suppressed six years earlier. The revolt meant Spain no longer had reinforcements to send to America, which in turn eventually forced the royalist armies of the viceroyalties of Peru and New Spain (today's Mexico), which had held back the Spanish-American revolution until then, to deal with the patriot forces on their own. The royalists in each viceroyalty, however, took different paths.\nIn New Spain, after the royalists defeated the insurgents, they proclaimed a negotiated separation from Liberal Spain to create a new monarchical state. This was done through the Plan of Iguala, which they negotiated with the remaining patriots, and the Treaty of Córdoba, which they negotiated with the new head of government, Juan O'Donojú. Further south, however, the absence of reinforcements due to Riego's revolt allowed Patriot forces to make progress. The defeat of the royalist expedition into Chile under Mariano Osorio and advances into Peru made by José de San Martín left Viceroy Joaquín de la Pezuela politically discredited. The viceroy was overthrown on 29 January 1821, in Aznapuquio, in a coup by General José de la Serna against Viceroy Pezuela; the royalist general proclaimed his adherence to the restored Spanish Constitution in the \"Proclamation of Aznapuquio\" ().\nThe Patriots started the new year with a promising victory. At Cerro de Pasco they defeated a Peruvian royalist army commanded by Diego O'Reilly. However, the royalists had received solid military training. Their first victory came against the patriot army commanded by Domingo Tristán and Agustín Gamarra in campaigns in the Ica Region. A year later, San Martín had withdrawn from the scene after the Guayaquil conference, and Royalist forces had smashed Rudecindo Alvarado's Liberating Expedition in the Battles of Torata and Moquegua. The year 1823 ended with De La Serna destroying another patriot army commanded by Andrés de Santa Cruz and Agustín Gamarra in yet another open campaign in Puno, which started with the Battle of Zepita and resulted in the occupation of La Paz on 8 August. After scattering Santa Cruz's isolated troops, De La Serna recaptured Arequipa after beating Antonio José de Sucre's Gran Colombian force on 10 October. Sucre decided to evacuate the Gran Colombian troops, setting sail on 10 October 1823, saving himself and his troops, although losing the best of his cavalry. Viceroy De La Serna ended the campaign after reaching Oruro in Upper Peru.\nOn the political front, the last remnants of optimism among patriots faded away with accusations of treason against Peruvian presidents José de la Riva Agüero and José Bernardo de Tagle. Riva Agüero deported deputies of the Peruvian Congress and organized another congress in Trujillo. After being found guilty of high treason by the Peruvian Congress he was banished to Chile. Simón Bolívar in turn considered this treasonous. Tagle, who had earlier ordered all armies under his command to support Bolívar against the royalist enemy, was now pursued by Bolívar, who was looking to capture and execute him. Tagle took shelter with the royalists in the besieged fortress of Callao.\nNevertheless, by the end of 1823, the situation had also become critical for those who defended the king's cause. In spite of the impressive military triumphs, Bolívar's request for reinforcements from Colombia made him a threat to the royalist army. Both sides prepared for the confrontation they knew was coming:\nBuenos Aires truce and Callao revolt\nHistorian Rufino Blanco Fombona says that \"By 1824, Bernardino Rivadavia had made a pact with the Spanish, obstructing the Ayacucho Campaign\": on 4 July 1823 Buenos Aires made a truce with Spanish commissionaires (Preliminary Peace Convention (1823)) that required it to send negotiators to other South American governments before it would take effect. It stipulated that hostilities would cease 60 days after its ratification and that the truce would last a year and a half; meanwhile, a definitive peace and friendship would be negotiated. Juan Gregorio de Las Heras met in Salta with Brigadier Baldomero Espartero, but did not reach an agreement. Among other measures taken by the viceroy to contain the imminent rebellion, on 10 January 1824 Casimiro Olañeta was ordered:\nRivadavia – who believed that the project would establish peace – paralyzed the authorities of Upper Peru (today's Bolivia), refused assistance, and withdrew the garrisons of advance posts near the border, to the detriment of the cause of the Peruvian patriots. The Irish military historian Daniel Florencio O'Leary was of the opinion that with the truce \"Buenos Aires (had) implicitly withdrawn from the struggle\", and that \"the Buenos Aires Government's pacts with the Spanish, were to the detriment of the American cause\".\nOn 1 January 1824, Bolívar fell terribly ill in Pativilca. , plenipotentiary minister of Río de la Plata arrived in Lima, asked Peru to adhere to the truce, but the Peruvian Congress rejected it. Nevertheless, beginning on 4 February 1824, various quarters of Callao mutinied, leading to the whole Argentine infantry of the Expedición Libertadora, together with some Chileans, Peruvians and Colombians (nearly two thousand men) going over to the royalists, raising the Spanish flag and handing over the fortresses of Callao. The mounted grenadier regiment of the Andes also revolted in Lurin on 14 February: two squadrons went over to the Callao to join the mutiny, but when they noticed that they had joined the royalists, a hundred of them, with their regiment commanders, went to Lima to join the independentists. The unit was then reorganized by General Mariano Necochea. In the midst of these events, the minister of Colombia, Joaquín Mosquera \"fearing the ruin of our army\" asked Bolivar \"and what do you plan to do now?\". Bolívar, in a decided manner, answered: \"Triumph!\".\nThe events at El Callao extended the war until 1826, and had the immediate result that Lima was occupied by José de Canterac. It is said that had there been military action against Bolívar on 26 May, it \"would have given the final blow to independence in this part of America\".\nOlañeta's rebellion\n, José de la Serna e Hinojosa, Count of the Andes.]]\nAt the beginning of 1824, the entire royalist army of Upper Peru revolted, led by royalist Pedro Antonio Olañeta, against the liberal Viceroy of Peru, after receiving the news that the constitutional government had fallen in Spain. King Ferdinand VII of Spain and his absolutist followers recovered control of the government, supported by 132,000 French soldiers from the Holy Alliance army, and they would control Spain until 1830. Rafael del Riego was hanged on 7 November 1823, and the other leaders of the liberal movement were executed, outlawed, or exiled from Spain. On 1 October 1823, Ferdinand decreed the abolition of everything approved during the prior three years of constitutional government, which included annulling the appointment of La Serna as viceroy of Peru. The purge of the constitutionalists of Peru seemed absolute.\nOlañeta then ordered an attack of the Upper Peruvian royalists on the constitutionalists in the Peruvian viceroyalty. La Serna changed his plans and went to the coast to fight Bolívar. He sent Jerónimo Valdés with 5,000 men across the Desaguadero River, which he did on 22 January 1824, in order to drive them to Potosí against his former subordinate \"because there are indications of a meditated treason, joining the dissidents of Buenos Aires\". Memorias para la historia de las armas españolas en el Perú (\"Memories of the history of the Spanish armies in Peru\") by peninsular official Andrés García Camba (1846) detailed the radical change that the events in Upper Peru produced in the viceroy's defensive plans. After the battles of Tarabuquillo, Sala, Cotagaita, and finally La Lava on 17 August 1824, the royalist forces of both the Viceroyalty of Peru (liberals) and of the provinces of Upper Peru (absolutists) were decimated.\nBolivar, hearing of Olañeta's actions, took advantage of the dismantling of the royalist defences and \"moved the whole month of May to Jauja\", to face José de Canterac, who was isolated in Junín on 6 August 1824. Unrelenting prosecution of the war began, and 2700 royalists deserted and went over to the independentists. On 7 October 1824, with his troops before the gates of Cusco, Bolívar gave General Sucre command of the new battlefront, which followed the course of the Apurímac River, and withdrew to Lima to negotiate more loans to keep the war going in Peru, and to receive a Colombian division of 4000 men from José Antonio Páez, which would arrive after Ayacucho.\nAyacucho campaign\n.]]\nThe defeat of Canterac forced La Serna to bring Jerónimo Valdés in from Potosí on a forced march with his troops. The royalist generals debated their plans. In spite of the signs of support from within the besieged Cusco, the viceroy rejected a direct assault because of his army's lack of training, having been enlarged by the massive return of peasants a few weeks earlier. Instead, he intended to cut Sucre's rearguard through march and countermarch maneuvers, which led to the encounter in Ayacucho along the Andean range. The royalists planned a quick strike which they made on 3 December in the Battle of Corpahuaico or Matará, where they cost the liberator army more than 500 casualties and much of its ammunition and artillery, vs their own losses of only 30 men. However, Sucre and his adjutant managed to keep his troops organized and prevented the viceroy from exploiting this success. Although he had suffered great losses of men and materiel, Sucre kept the United Army in an orderly retreat, and always situated it in secure positions that were difficult to access, such as quinoa fields.\nIn his memoirs, In the Service of the Republic of Peru, General Guillermo Miller explained the point of view of the independentists. Besides Bolívar and Sucre, the United Army drew on a large body of experienced soldiers; for example, the rifles battalion of the army of Colombia was composed of European troops, mostly British volunteers. This unit was substantially damaged at Battle of Corpahuaico. Among its ranks were veterans of the Peninsular War, the American War of Independence, and the Spanish–American Wars, and individuals such as the Anglo-German major , a veteran of the 1812 Battle of Borodino against Napoleón Bonaparte in Russia. A number of British and Irish volunteer officers fought with Bolívar's forces in Ayacucho, including general William Miller. But the bulk of the foreign troops, who had taken part in most of the campaign, remained at the rear in reserve during this battle.\nThe royalists had exhausted their resources in a marching war without achieving a decisive victory against the liberator army. Because of the extremely harsh conditions in the Andes, both armies felt the effects of disease and desertion. The royalist commanders positioned themselves in the heights of Kunturkunka, a good defensive position but one they couldn't hold for long, given that they had food supplies for less than five days. This would mean certain defeat upon the arrival of the expected Colombian reinforcements. The royalist army had to make a desperate decision: the Battle of Ayacucho was about to begin.\nBattle disposition\nDebate exists regarding the number of troops on each side, but both armies initially had similar forces (8,500 independents vs. 9,310 royalists), however these numbers dropped over the next weeks until the day of the battle, when there were perhaps 5,780 independentists vs. 6,906 royalists.\nUnited Liberation Army\n* Commander: Marshal Antonio José de Sucre\n* Chief of High Command – General Agustín Gamarra\n* Cavalry – General William Miller\n* First Division – General José María Córdoba (2,300 men)\n* Second Division – General José de La Mar (1,580 men)\n* Reserve – General Jacinto Lara (1,700 men)\nBefore the battle began, de Sucre addressed his troops assembled in the field:\nMarshal Sucre does not mention in this part the mounted grenadiers of Río de la Plata. General Miller in his Memoirs of General Miller: in the service of the republic of Peru described the composition of the armies under Sucre:\nMiller's assertion that the Junín Hussars were in his division contradicts what Sucre said in the part.\nRoyalist Army of Perú\n* Commander: Viceroy José de la Serna\n* Chief of the High Command – Lieutenant General José de Canterac\n* Cavalry Commander – Brigadier Valentín Ferraz\n* Vanguard Division – General Jerónimo Valdés (2,006 men)\n* First Division – General  (2,000 men)\n* Second Division – General Alejandro González Villalobos (1,700 men)\n* Reserve Division – General José Carratalá (1,200 men)\nBattle\nThe plan, devised by Canterac, envisaged that the vanguard division would flank the enemy force, crossing the river Pampas to secure the units to the left of Sucre. Meanwhile, the rest of the royalist army would descend frontally from the Condorcunca hill, abandoning its defensive position on the high ground and charging against the main body of the enemy, which they expected to be disorganized. The 'Gerona' and 'Ferdinand VII' battalions served as reserves, deployed in a second line to be sent in wherever they were required.\nSucre immediately realized the risky nature of the royalists' maneuver, which became clear as the royalists found themselves moving onto an exposed slope, unable to protect their movements. José María Córdova's division, supported by Miller's cavalry, strafed the disorganized bulk of royalist troops, incapable of forming into battle-lines and descending in waves from the mountain. As the attack started, Independentist general Córdova uttered his famous words \"Division, armas a discreción, de frente, paso de vencedores\" (Division, arms at ease; at the pace of victors, forward!).\nshows General José María Córdova leading the 2nd Colombian division into their assault. ]]\nColonel , who commanded the first royalist regiment, had to protect the artillery, which was pulled by mules. He moved forward carelessly into the plain, where his unit was exposed and badly mauled. He himself was killed during the attack by Córdova's division, whose effective fire on the royalist formations pushed back the scattered fighters of Villalobos’ Second Division.\nSeeing the misfortune suffered by his left flank, royalist general Monet, without waiting for his cavalry to form in the plain, crossed the ravine and led his First division against Córdova, managing to form two of his battalions into battle order but, suddenly attacked by the independents' division, he was surrounded before the rest of his troops could also form into battle order; during these events Monet was wounded and three of his commanders killed; the scattered divisions of the royalists dragged with them the masses of militia. The royalist cavalry under Valentín Ferraz y Barrau charged upon the enemy squadrons that pursued Monet's broken left but the confusion and the crossfire from the infantry, caused heavy casualties to Ferraz's horsemen, whose survivors were forced to hastily leave the battlefield.\nAt the other end of the line, the Independentist Second Division of José de La Mar plus the Third Division of Jacinto Lara altogether stopped the assault made by the veterans of Valdés’ vanguard, who had launched themselves to take an isolated building occupied by some independentist companies. Although defeated at first, the independentists were soon reinforced and went back to the attack, eventually helped by the victorious Córdova's division.\nSeeing the confusion in the royalist lines, Viceroy La Serna and the other commanders tried to regain control of the battle and reorganize the scattered and fleeing men. General Canterac himself led the reserve division across the plain; however, the 'Gerona' battalions were not the same veterans who fought in the battles of Torata and Moquegua. In Olañeta's rebellion these divisions lost almost all their veterans and even their former commander, Cayetano Ameller, and this unit, composed of raw recruits, quickly scattered before it met the enemy. The 'Ferdinand VII' battalion followed, after a feeble resistance. By one o'clock the viceroy had been wounded and made prisoner, along with many of his officers. Even though Valdés’ division was still fighting to the right of his front, the battle was a victory for independentists. Independentist casualties, according to Sucre, were 370 killed and 609 wounded, and the royalists lost about 1800 dead and 700 wounded.\nWith the remnants of his division, Valdés managed to retreat to the hill held by his rearguard, where he joined 200 cavalrymen who had gathered around general Canterac and some scattered soldiers from royalist divisions, whose fleeing and demoralized men shot and killed their own officers, who were trying to regroup them). The now heavily reduced force had no hope of defeating the independentist army. With the main body of the royal army destroyed and the viceroy himself in the hands of his enemies, royalist leaders surrendered.\nCapitulation of Ayacucho\n).]]\nWith Viceroy de la Serna seriously injured, the agreement between the two sides was negotiated by royalist commander Canterac and general Sucre. Canterac wrote:\nThe principal terms of the agreement were:\n* The royalist army under command of viceroy La Serna agreed to end hostilities.\n* Remaining royalist soldiers were to remain in the Callao fortresses.\n* The Peruvian republic should pay the debt to the countries that gave military contributions to the independence movement.\nIn Lima, Bolívar summoned the Congress of Panama, on 7 December, to unite the new independent countries. The project was ratified by Gran Colombia only. Four years later, due to the personal ambitions of many of its generals and the absence of a united vision that foresaw South America as a single nation, Gran Colombia would end up splitting into the countries that exist today in South America, frustrating Bolívar's dream of union.\nConspiracy theories about the Battle of Ayacucho\nSpanish historian Juan Carlos Losada calls the surrender of the royalists the \"Ayacucho betrayal\". He says that the result of the battle had already been agreed between opposing commanders, arguing that Juan Antonio Monet was responsible for the agreement: \"the main characters kept a deep pact of silence and, therefore, we can only speculate, although with little risk of being wrong\" (Page 254). He argues that a capitulation without battle would have been undoubtedly judged as treason, but defeat allowed the losing commanders to retain their honour.\nThe theory assumes that liberal-minded commanders in the royalist army preferred an independentist victory to the triumph of an absolutist authoritarian Spain. In the conspiracy-minded atmosphere of the time, several commanders were accused of belonging to the Freemasons, as were independentist leaders, and certainly did not sympathise with king Ferdinand VII's ideas, considering him a tyrannical absolutist monarch. Spanish commander Andrés García Camba says in his memoirs that returning Spanish officers, latter known as \"ayacuchos\", were unjustly accused of betrayal upon their arrival to Spain, being told by one general, in an accusatory manner, \"sirs, in this case we suffered a Masonic defeat\"; the veterans replied - \"it was lost, my general, in the way battles are lost\".\nAftermath\n.]]\nAfter the victory at Ayacucho, following strict orders from Bolívar, general Sucre entered Upper Peru (today's Bolivia) on 25 February 1825. Besides having orders to immediately install an independent administration, he was to give an appearance of legality to a process that Upper Peruvians themselves had already started. Royalist general Pedro Antonio Olañeta stayed in Potosí, where by January he received the \"Union\" Infantry Battalion coming from Puno under the command of Colonel . Olañeta then summoned a war council, which agreed to continue the resistance in the name of Ferdinand VII. Next, Olañeta sent to the Cotagaita fortress the \"Chichas\" Battalion under Colonel Medinacelli, and Valdez to Chuquisaca with the \"Union\" Infantry Battalion and loyalist militias. Olañeta himself marched toward Vitichi with 60,000 pieces of gold from the coinage factory in Potosí. But for the Spanish military personnel in Upper Peru, it was too little too late, as all-out guerrilla warfare had raged in this part of the continent since 1821.\nHowever, in Cochabamba the First Battalion of the \"Ferdinand VII\" Infantry Regiment, led by Colonel José Martínez, rebelled and sided with the independence movement, to be followed later by the Second Battalion of the \"Ferdinand VII\" Infantry Regiment in Vallegrande, resulting in the forced resignation of Brigadier Francisco Aguilera on 12 February. Royalist colonel José Manuel Mercado occupied Santa Cruz de la Sierra on 14 February, as Chayanta stayed in the hands of Lieutenant Colonel , with the \"Santa Victoria\" (Holy Victory) cavalry squadrons and the \"Dragones Americanos\" (American Dragoons), and in Chuquisaca the \"Dragones de la Frontera\" (Frontier Dragoons) cavalry squadron under colonel Francisco López claimed victory for the independence forces on 22 February. At this point, the majority of the royalist troops of Upper Peru refused to continue fighting against Sucre's powerful army. Colonel Medinacelli with 300 soldiers also revolted against Olañeta, and on 2 April 1825, they faced each other in the Battle of Tumusla, which ended with the death of Olañeta. A few days later, on 7 April, general José María Valdez surrendered in Chequelte to general José María Pérez de Urdininea, putting an end to the war in Upper Peru and signalling victory to the local independence movement, which had been active since 1811.\nBolivian Declaration of Independence\n'', Sucre.]]\nSucre reconvened the constituent assembly in Chuquisaca on 8 July 1825; it declared the complete independence of Upper Peru, as a republic. Assembly president José Mariano Serrano, together with a commission, wrote the \"Independence Act of the Upper Peruvian Departments\" dated 6 August 1825, in honor of the Battle of Junín won by Bolivar. Independence was declared by seven representatives from Charcas, 14 from Potosí, 12 from La Paz, 13 from Cochabamba and two from Santa Cruz. The Declaration of Independence, written by the president of the Congress, Serrano, states in its expositive part:\nThe origin of the name of Bolivia\nThrough a decree, it was determined that the new state in Upper Peru would carry the name of República Bolívar, in honor of the liberator, who was designated as \"Father of the Republic and Supreme Chief of State\". Bolívar thanked them, but declined the presidency, a duty he gave instead to the victor of Ayacucho, Grand Marshal Antonio José de Sucre, who was sworn in the same day as the first President of Bolivia. After some time, the subject of the name of the young nation arose again, and a Potosian deputy named Manuel Martín Cruz suggested as Rome came from Romulus, from Bolivia could come from Bolívar.\n}}\nBolívar felt flattered by the young nation, but he hadn't accepted Upper Peru's presidency because he was worried about its future, due to its location in the very center of South America and therefore would face many future wars, which curiously did happen. Bolivar wished that Bolivia would become part of another nation, preferably Peru (given that it had been part of Viceroyalty of Perú for centuries), or Argentina (since during the last decades of colonial dominion it had been part of Viceroyalty of Río de la Plata), but what deeply convinced him otherwise was the attitude of the people. On 18 August, upon his arrival to La Paz, there was popular rejoicing. The same scene repeated when the Liberator arrived to Oruro, then to Potosí and finally to Chuquisaca. Such a fervent demonstration by the people touched Bolívar, who called the new nation his \"Predilect Daughter\", and was called by the peoples of the new republic their \"Favorite Son\".\nBolívar's acknowledgement of Sucre\n, (Caracas, Venezuela).]]\nIn the aftermath, the Congress of Colombia rewarded Sucre with the rank and dignity of General in Chief of the Army of the Republic, and the Congress of Peru awarded him with the rank of Grand Marshal of Ayacucho as the field commander responsible for the victory in Ayacucho, which not only finished the war of Peruvian independence, but also signalled the termination of the Latin American wars of independence.\nIn 1825, Bolívar had published his Resumen sucinto de la vida del general Sucre, the only work of its kind by Bolívar. In it, he spared no praise of the crowning achievement of his faithful lieutenant:\nSee also\n* Battle of Junín\n* Ayacucho Declaration\n* British Legions\nNotes\nReferences\n* Hughes, Ben. ''Conquer or Die!: British Volunteers in Bolivar's War of Extermination 1817–21. Osprey Publishing 2010\n* El Perú Republicano y los fundamentos de su emancipación. Jorge Basadre.\n* Historia extensa de Colombia. Luis Martínez Delgado, Academia Colombiana de Historia.\nFurther reading\n* Higgins, James (editor). The Emancipation of Peru: British Eyewitness Accounts'', 2014. Online at [https://sites.google.com/site/jhemanperu jhemanperu]\nExternal links\n*  [https://web.archive.org/web/20080229000748/http://www.wombastis.com/1900_ayacucho/ Ayacucho República Aristocrática photo gallery]"
    }
  ]
}