{
  "content": [
    {
      "type": "text",
      "text": "# Battle of San Juan del Monte\n\n* Captaincy General of the Philippines\n| combatant2        =  Katipunan\n* Sovereign Tagalog Nation\n| commander1        =  Ramón Blanco Camilo Rambaud Bernardo Echaluce\n| commander2        =  Andrés Bonifacio Emilio Jacinto Ramon Bernardo\n| strength1         =  100+ combined civil guards, infantrymen and artillerymen\n| strength2         =  800~1,000+\n| casualties1       = 2 killed, several wounded\n| casualties2       = 150 killed 200 captured\n}}\nThe Battle of San Juan del Monte, also referred to as Battle of Pinaglabanan, took place on August 30, 1896. It is considered as the first major battle of the Philippine Revolution, which sought Philippine independence from Spain. The first battle cry of the Katipunan coincided with the pealing of church bells at nine o'clock on the night of August 29, 1896.\nBackground\nAt 5 pm on the 29th, the Supremo Andrés Bonifacio and 800 Katipuneros met up with Katipunero Felix Sanchez, chairman of the Sapa chapter, at Hagdang Bato in San Felipe Neri. By 7 pm, with a thousand men, including the local police force, they attacked the civil guards, who surrendered immediately. However, the Tala chapter chairman, Katipunero Buenaventura Domingo, allowed the parish priest to escape. Troops under General Ramón Bernardo then took the town hall of Pandacan and, by , were dispatched to Santa Mesa. Troops under Santiago V. Alvarez, Artemio Ricarte and Mariano Trías were deployed in Noveleta and San Francisco de Malabon in Cavite. Bonifacio, along with Genaro de los Reyes and Vicente Leyba, proceeded to San Juan del Monte.\nBattle\nAfter the discovery of Katipunan on August 19, 1896, Andrés Bonifacio became aware of the Spanish government's plans for military action. On August 25, Bonifacio deployed several of his men around the Pasong Tamo bridge when he heard infantrymen and Spanish guardia civil coming to raid communities around the bridge.\nOn the evening of August 29, Bonifacio, with his aide Emilio Jacinto, led a group of Katipuneros towards El Polvorin, a Spanish powder magazine situated in San Juan del Monte. Spanish infantry and artillerymen (twelve Philippine soldiers and two Spanish officers), armed with German Mauser rifles, guarded Polvorin; the Katipuneros were generally armed with bolo knives, a few assorted guns, sharpened Bamboo spears and anting-antings.\nAfter two successful skirmishes with the civil guards, Bonifacio was joined by 300 men from Santolan.  The chapter chairman was Valentin Cruz.\nBy midnight, a small second group of Katipuneros, under the command of Sancho Valenzuela, and coming from Santa Mesa, arrived at Polvorin. This group was composed of 100 Katipunan members, two of them women: Luisa Lucas and Segunda Fuentes Santiago.\nBefore noon, the 73rd \"Jolo\" Regiment, composed of Filipino soldiers under Spanish officers, under the command of General Bernardo Echaluce y Jauregui, arrived as Spanish reinforcements at San Juan del Monte to assist in suppressing the rebellion. The 73rd Regiment, like most of the native conscripts in the Spanish army in the Philippines, were armed with the Remington Rolling Block rifle.\nThe revolutionaries regrouped at Santa Mesa and engaged the arriving Spanish troops. The 73rd Regiment, together with the garrison of the magazine, almost wiped out Bonifacio's men, leaving about 150 dead and capturing over 200. Despite the Katipunaneros being numerically superior, the Spaniards inflicted heavy losses to Bonifacio which he will never recover. This disastrous outcome forced Bonifacio to retreat towards the Pasig River.\nReactions\nAfter the unsuccessful attack at Polvorin, armed resistance spread towards Central Luzon and provinces along Southern Tagalog.\nAt 8:00&nbsp;p.m. on August 30, Governor-General Ramón Blanco y Erenas issued an executive order placing the eight provinces of Manila, Pampanga, Laguna, Cavite, Batangas, Bulacan, Nueva Ecija and Tarlac under martial law. As a lesson to revolutionaries, the Katipuneros captured at Polvorin were summarily tried and executed. One of them was Sancho Valenzuela, who was dragged off in chains together with his men, Modesto Rivera, Eugenio Silvestre and Ramon Peralta, towards the tribunal.\nTo ease the increasing tension throughout the colony, Blanco offered a pardon to Filipino rebels who would lay down their arms and surrender to the Spanish authorities. Dr. Pío Valenzuela, the chief physician and aide of Bonifacio, was one of the first Katipuneros who availed himself of this amnesty. However, after his surrender, he was deported and imprisoned in Madrid, and later incarcerated in a Spanish outpost in Africa.\nAside from granting amnesties to returning rebels, the Spanish colonial government also assisted on trying and executing several members of the Katipunan. Fifty-seven of the revolutionaries at San Juan del Monte were executed on August 31, 1896. On September 4, Sancho Valenzuela, Rivera, Silvestrre and Peralta were executed, on the Campo de Bagumbayan, facing the Luneta Esplanade. On September 12, thirteen revolutionaries were executed in Cavite.\nLegacy\n]]\nThe present-day design of the Philippine flag features the eight-ray sun, which, some of the provinces that Blanco took under martial law on August 30, 1896, took a representation. The eight rays of the sun represent the eight provinces that initiated revolution against Spain: Manila, Cavite, Bulacan, Pampanga, Nueva Ecija, Bataan, Laguna and Batangas, though historian Ambeth Ocampo listed Tarlac instead of Bataan.\nOn July 25, 1987, former President Corazon C. Aquino signed Executive Order 292 which declared the last Sunday of August each year as a public holiday in the Philippines. This commemorates the Cry of Pugad Lawin and the start of the Philippine Revolution.\nIn 1974, the Pinaglabanan Shrine was unveiled in San Juan, along Pinaglabanan Street. \"Pinaglabanan\" is a Tagalog word for \"fought over\". The present-day San Juan Elementary School stands on the former grounds of the ruined El Polvorín. In 2006, a museum for the Katipunan was opened by the San Juan city government located by the shrine.\nFile:SanJuanCityjf2992 03.JPG|Pinaglabanan Shrine Park\nFile:SanJuanCityjf2992 02.JPG|Restoration, Phase I\nReferences\nExternal links\n*\nBibliography\n*\n*\n*\n*\n*"
    }
  ]
}