{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Marihueñu__disambig_1\n\nThe Battle of Marihueñu was one of the early decisive battles of the Arauco War; it took place between the Mapuche leader Lautaro and the Spanish general Francisco de Villagra on 23 February 1554.\nHistory\nAfter the defeat at the Battle of Tucapel, the Spanish had hurriedly reorganized their forces, reinforcing fort La Imperial for its defense and abandoning Confines and Arauco in order to strengthen Concepción. Araucanian tradition had dictated a lengthy celebration after their victory, which kept Lautaro from exploiting the weakness of the Spanish position as he desired. It was only in February 1554 that he succeeded in putting together an army of 8,000 men, just in time to confront a punitive expedition under the command of Francisco de Villagra at the Battle of Marihueñu.\nLautaro chose the hill of Marihueñu to fight the Spanish, and subsequently organized his forces in four divisions: two had the mission of containing and wearing down the enemy, another would be held in reserve to launch a fresh attack as the Spanish were about to crumble, and the last would work to cut off their retreat.  Additionally, a small group was sent to destroy the reed bridge the Spanish had erected across the Bío-Bío River, which would further disrupt the anticipated retreat of Villagra.\nThe Spanish attack broke the first Mapuche lines, but the quick action of the third group maintained the Mapuche position. Later, the wings of this division began to attack the Spanish flanks, and the fourth division attacked from behind.  After hours of battle and the loss of their artillery, only a small group of Spanish were able to retreat after a desperate fight to break through the Mapuche that blocked their escape in their rear.\nReferences\nSources\n* Jerónimo de Vivar, [https://web.archive.org/web/20080526101641/http://www.artehistoria.jcyl.es/cronicas/contextos/11498.htm  Crónica y relación copiosa y verdadera de los reinos de Chile (Chronicle and abundant and true relation of the kingdoms of Chile)] ARTEHISTORIA REVISTA DIGITAL; Crónicas de América (on line in Spanish)\n* de Góngora Marmolejo, Alonso, [https://web.archive.org/web/20160303195617/http://www.historia.uchile.cl/CDA/fh_complex/0%2C1393%2CSCID%3D10200%26ISID%3D404%26JNID%3D12%2C00.html  Historia de Todas las Cosas que han Acaecido en el Reino de Chile y de los que lo han gobernado (1536-1575) (History of All the Things that Have happened in the Kingdom of Chile and of those that have governed it (1536-1575))], University of Chile: Document Collections in complete texts: Cronicles (on line in Spanish)\n* Mariño de Lobera, Pedro, [http://www.cervantesvirtual.com/servlet/SirveObras/13582842323460728544424/index.htm  Crónica del Reino de Chile, escrita por el capitán Pedro Mariño de Lobera....reducido a nuevo método y estilo por el Padre Bartolomé de Escobar.  Edición digital a partir de Crónicas del Reino de Chile Madrid, Atlas, 1960, pp. 227-562, (Biblioteca de Autores Españoles; 569-575).]  Biblioteca Virtual Miguel de Cervantes (on line in Spanish)"
    }
  ]
}