{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Mogadishu (2009)\n\nAl-Shabaab Hizbul Islam Foreign Mujahideen Al-Qaeda\n|combatant2=:\n: ARS-D-TFG coalition\n:AMISOM\n|commander1=\nMoktar Ali Zubeyr \"Godane\"\nDahir gacamey\nMukhtar Robow\nAli Mohamed Hussein\nHussein Ali Fidow\nAli Mohamud Raghe \"Dheere\"\nXasan Xuseen\nIbrahim \"al-Afghani\"\nHassan Dahir Aweys\nHassan Turki\nOmar Iman \"Abubakr\"\nHassan Mahdi\nMusa Arale\nAbdulkadir Hamsa \"Qatatow\"\n[Da2\nAhmed \"Lashin\" Sheikh Muhiyadin 2\nMo'alin Hashi\nIndho Ade 1\nAli Saleh Nabhan\nFazul Abdul Mohammed\n|commander2= Sharif Ahmed\nOmar Hashi Aden\nOmar Abdirashid Ali Sharmarke\nMohamed Abdi \"Gandhi\"\nSaid Mohamed Hersi (resigned)\nMohamed Husein Adow\nYusuf Hussein Dumal\nAbdirahman Abdishakur Warsame\nMuhiddin Hassan Juris\nAli Said\nMuse Sudi Yalahow\nNur Daqli\nAbdulkadir Ali Omar\nIndho Ade 1\nAbdirisak Mohamed Qeyloy\nLevi Karuhanga\nJuvenal Niyoyunguruza\n|strength1=Al-Shabaab: 2,500\n|strength2=TFG: 2,900\nAMISOM: 4,350\n|casualties1=94+ killed*\n|casualties2=Total: 126+ KIA\n*  97+ KIA\n*Amisom 29 KIA\n|casualties3=1,497 civilians killed34,911 civilians injured*\n223,000 displaced\n|notes=*Casualty figures do not include those killed by criminal related violence, accidents or infighting among their factions.\n1 Sheik Yusuf Mohamed Siad \"Indho Ade\" (a warlord who is notorious for switching sides), and his militia were part of Hizbul Islam until 17 May, when he defected to the government.\n2 Abdulkadir Hamsa \"Qatatow\" was first a government commander but he defected to Hizbul Islam. Soon after, he was assassinated. Ahmed \"Lashin\" Sheikh Muhiyadin was also an ICU commander but defected on 10 June.\n3 Casualty figures of 1,739 killed were reported for the whole of 2009, at least 242 of which were combatants. The 1,497 remaining civilian dead includes both people killed before 7 May and people killed after 1 October.\n}}\nThe Battle of Mogadishu (2009) started in May with an Islamist offensive, when rebels from al-Shabaab and Hizbul Islam attacked and captured government bases in the capital of Mogadishu. The fighting soon spread, causing hundreds of casualties, and continued on at various levels of intensity until October.  The battle's name usually includes the year, when referenced, in order to distinguish it amongst the nine major Battles of Mogadishu during the decades long Somali Civil War.\nThe Islamist offensive lasted from 8 to 14 May and ended with relative success as they managed to take control over most of the capital, while ARS-D and government (TFG) forces withdrew into AMISOM protected territories. But despite major gains, the rebels failed to topple the government during the eight days of fighting and small scale clashes continued until 22 May, when the government launched a major offensive to retake the city, as Islamist forces had mostly withdrawn into the Central Region and the government was now backed by powerful warlord Indho Ade.\nThe government offensive initially had some success as they captured a few bases, however in a matter of hours the Islamist launched a successful counter offensive and re-captured the lost areas and made even more gains. As a result, the government offensive was aborted on 23 May.\nThe offensive was however resumed on 1 June, resulting in a third round of fighting which lasted until 4 June and saw the government make enormous gains. Islamists launched a new offensive on 16 June, lasting until 23 June, entering government strongholds in Eastern Mogadishu for the first time, the offensive was relatively successful and saw most neighbourhoods in Kaaraan, Shibis, Abdiaziz and Wardhigley fall to their control.\nThe government launched another offensive on 1 July, insurgents however successfully repelled the offensive, making gains until 5 July, when al-Shabaab's leader Sheikh Moktar Ali Zubeyr gave government forces a five-day ultimatum to hand over their weapons. The ultimatum was however rejected  and so, al-Shabaab launched several attacks on key sites in the city  provoking a major government offensive on 11 – 12 July, which led to a total expulsion of Islamist forces from the city. Islamists however returned on 13 July, with large re-enforcements from the South Eastern Region, government forces withdrew from all captured positions  and minor clashes continued. A Seventh round of fighting was finally held between 21 and 27 August, which ended mostly indecisive. In early October the Al-Shabaab-Hizbul Islam alliance  was broken by a power struggle in Kisimayo  were after the two groups turned on each other. Both groups kept up their fight with the TFG  however the split between the two groups marked a downwards trend in violence.\nA report Elman Peace and Human Rights group at the end of the year said that 1,739 people had been killed throughout 2009 by violence in Mogadishu.\nPrelude\nSheikh Sharif Ahmed assumed the presidency on 31 January 2009, which marked the start of a new phase in the Somali Civil War as Islamist hardliners such al-Shabaab and newly created Hizbul Islam vowed to continue the war. Throughout February there were clashes in Mogadishu, but they were mostly attacks on AMISOM forces.\n2 February 2009\nA bomb hit an AMISOM convoy killing 18 civilians; AMISOM peacekeepers responded by opening fire on al-Shabaab insurgents, leaving over 20 people killed.\n4 February 2009\nTahlil Ahmed, the director of independent news agency, HornAfrik was shot and killed by gunmen in the city, insurgents denied any involvement.\n8 February\nA gunbattle between AMISOM peacekeepers and al-Shabaab insurgents resulted in the death of three civilians that were caught in the crossfire, after rebels attacked the peacekeepers.\n12 February 2009\nTwo civilians were killed when al-Shabaab fired 11 mortars into the government-controlled seaport.\n20 February 2009\nAnother ambush on AMISOM forces resulted in a gun battle which left one civilian dead.\n22 February 2009\nWhen a double suicide bombing by Hizbul Islam targeting an AMISOM convoy peace keepers leaving 11 dead and 15 injured. The attack was widely condemned by international observers as well as government and opposition leaders.\nA clash in Afgoy, on the same day, left one insurgent and one soldier dead.\n24-25 February 2009\nFrom 24 to 25 February, there was a battle of South Mogadishu which killed nearly 50 and wounded over 300. Among the dead where, at least six policemen and 15 Insurgents. The battle was condemned by both sides due to the large number of civilian casualties.\nMarch–May 2009\nIn March, April and May there were several mortar attacks, killing dozens. The mortar attacks were usually aimed at the presidential palace or the parliamentary building but sometimes also AMISOM bases, usually only resulting in civilian casualties.\n16 April 2009\n16 April, Somali lawmaker Abdulahi Isse Abtidon was assassinated in Mogadishu. Before that, mortar attacks had already injured 2 MPs. Though no group claimed responsibility, the government blamed al-Shabaab for it. On 21 April a second MP was assassinated: Mohamed Mohamud Jimale (\"Agaweyne\") This man was also a military commander of the ICU. On 23 April, Abdi Mohamed Dhabaney, the Hodan district commissioner escaped explosion attack on Maka al-Mukarama road which was intended to kill him. ICU leaders were also targeted on 5 May, though that attack killed only a bodyguard. In total ICU militia commanders and a Somali lawmaker with close ties to the ICU were gunned down in Mogadishu in April.\n23 April 2009\n23 April, Sheikh Hassan Dahir Aweys, leader of the Asmara-based wing of the ARS and most important figure of Hizbul Islam, returned to Mogadishu after 2 years of exile in Eritrea. He refused to talk to Somali President: Sheikh Sharif Ahmed, demanding an AMISOM withdraw first. The two, traded though words, heavily criticizing each other. Sheikh Sharif ruled out an AMISOM withdraw. Sheikh Aweys' security advisor later also accused Somali Security Minister Omar Hashi of \"inciting war\".\n30 April 2009\nOn 30 April, senior al-Shabaab commander Sheikh Muktar, was assassinated in the Bakara market in response to attacks on Somali MPs. 7 May an al-Shabaab officer escaped an assassination attempt resulting in a heavy gunfight between his security guards and ICU forces.\nEarly May 2009\nIn early May, opposition fighters were pouring weapons and fighters into Mogadishu, preparing for their 8 May, offensive. The government accused Eritrea of providing these weapons, something which opposition figures denied.\n4 May 2009\n4 May, forces loyal to Sheikh Aweys and al-Shabaab attacked the ex-pasta factory in Northern Mogadishu which was used as Ethiopian base and then as base for Sheikh Indho Ade's militia which were at the time (May 2009) still part of Hizbul Islam, though involved in a power struggle with the rest of the group. On the same day, some government forces sold their armed trucks to al-Shabaab. On 7 May, Indho Ade even met with President Sheikh Sharif to discuss peace.\nDeathtoll from 26 February to 6 May\nPer these reports: between 26 February and 6 May 2009, some 21 Insurgents, 23 Government Forces, two AMISOM Peacekeepers and 31 Civilians (including several aid workers) were killed in Mogadishu clashes.\nThe battle\n7 May 2009\nThe Battle started on 7 May, as pro-government Islamist forces and al-Shabaab militants fought over Mogadishu stadium.\n8 May 2009\nOn 8 May both sides started amassing their forces in the city. That day 15 people were killed and 50 injured. Sheikh Sharif Ahmed, Somalia's president, accepted a ceasefire that day, proposed by the Islamic mediation committee. However al-Shabaab continued fighting, as they were on the winning hand.\n9 May 2009\nThis came after an al-Shabaab commander was gunned down. 9 May, at least seven people were killed and 10 were injured as pro-government Islamists and other Islamist rebels fought for control of Yaqshid police station in north Mogadishu. The fighting soon spread to other parts of the city and Medina hospital said that 120 injured people were brought to there. The fighting came as government forces attacked the police station which was under control of the Hizbul Islam, rebel group. On the same day, a gun battle was held along Industry Road in Mogadishu between al-Shabaab and the ICU, al-Shabaab fighters were said to include foreign fighters (Arabs, Afghans and Pakistanis). Masked gunmen, then gunned down and killed two ICU militiamen in the Bakara market. Also the homes of MP Mohamud Mire and MP Yusuf Hayle were attacked, the lawmakers were unharmed but 6 people, including a bodyguard were injured.\n10 May 2009\n10 May, during the fourth day of battle, at least 10 people were killed and 30 injured, five of which were injured during a mortar attack. Most of the fighting was centered in the Wardhigley district as explosions targeted a Somali MP's convoy, two people were killed and three injured. The attack came as the MP traveled passed a Hizbul Islam police station. A mortar which hit a house in Ged-jacel killed 1 and injured 3. Hundreds of civilians fled the fighting in Yaqshid and Wardhigley districts this day. Al-Shabaab and Hizbul Islam were said to have taken control of many government bases and large parts of the city.\n11 May 2009\n11 May, Abdifatah Ibrahim Shaweye, the deputy governor of Banadir region said that his men had taken control of an Ex-control Afgoi checkpoint in Southern Mogadishu, from Islamist fighters. Ex-control Afgoi is a key checkpoint that connects the main road of Mogadishu to the town of Afgoi. Also Mortar shells were fired at the Presidential palace, but caused no casualties. Gunfire was also exchanged at the palace. Further the two sides clashed in the Wardhigley, Yaqshid (particularly at the Fagah intersection) and Hodan districts of the city. Insurgents also attacked Jalle Siyad Academy, a base of Burundian troops from AMISOM. 15 were killed when a mortar shell hit a mosque in Wardhigley. Rebels then made large gains, taking control of the ex-Defense Ministry building, Stadium Mogadishu and Wardhigley police station as ICU militiamen were forced to flee. Rebels also took control of Industry Road and 30th Avenue, the two most important roads in Mogadishu. Three journalists were injured as a shell fired by ICU militia hit a building where a press conference was being held by senior al-Shabaab commander: Ali Dheere, who was telling about the major gains their forces had made that day. Ali \"Dheere\" was among those who were wounded by the shelling. Sheikh Abubakar Sayli'i, the (al-Shabaab appointed) mayor of Kismayo said that the fighting in Mogadishu would not end until \"the Mujahedeen have taken over Mogadishu\", he also said that Islamists had sent weapons and fighters from Kismayo as reinforcements to Mogadishu. Casualties at this time hit 60 killed and 100 injured. Thousands of civilians fled the city this day, mostly in the Yaqshid district. Meanwhile, President Sheikh Sharif Ahmed said the government was making efforts to end the fighting.\n12 May 2009\n12 May, the civilian death toll hit 113, with 345 being injured. Also, 15 pro-government fighters and 19 foreign insurgents, 12 Pakistanis and seven Yemenis, had been killed. As al-Shabaab and Hizbul Islam had taken control of key areas and roads in Southern Mogadishu and some areas in Northern Mogadishu. It was also reported that at least 27,500 people had fled their homes since 7 May. The displacement was said to be caused by indiscriminate shelling, as heavy shelling hit the city on 11 May. Meanwhile, reinforcements arrived from Kismayo as Hassan Turki, leader of the Ras Kamboni Brigades (which is now a part of Hizbul Islam) and a notorious militant commander in the Jubba regions arrived with reinforcements for Hizbul Islam, from Kisimayo.\n13 May 2009\n13 May, at least 11 people were injured in a gunbattle between ICU and al-Shabaab militants at 4 Jardin intersection, this sparked violence in the rest of Yaqshid. The fighting ended with al-Shabaab taking control of the contested areas. Al-Shabaab and Hizbul Islam militants attacked Villa Somalia, the presidential palace, with a force which came from outside the city. They failed to capture it, however they did manage to take control of almost all of the city, the government was still in control of only a few square kilometers of the city, which is defended by AMISOM peacekeepers. 10 people were killed and 76 injured, in the clashes at the palace.\nGovernment soldiers attacked rebel positions near the Sinay intersection but they were defeated and rebels then took control of Suk Ba'ad, Mogadishu's second-largest market. During these clashes, at least eight people were killed and 20 injured. Government officials described the latest rounds of violence as a \"failed coup\" and vowed they would crush the opposition which they described as \"Islamic gangs\".\n14 May 2009\n14 May, heavy fighting broke out between al-Shabaab and TFG soldiers in the Sinaay and Jardinka areas in northern Mogadishu. Fighting continued around the presidential palace(in Wardhigley). Locals reported that AMISOM forces shelled buildings around it, which were being used by al-Shabaab to fire mortars at the palace. However, AU spokesman Barigye Ba-Hoku, denied any involvement in the fighting or shelling. A witness said 10 rebels and at least three government soldiers were killed during these clashes. Other reports say a toal of 10 people were killed in the fighint (including civilians) and 30 people were wounded, including two reporters. The Islamist rebels continued to make gains and the fighting started to spread to other districts, most notably, Kaaraan. In Yaqshid the fighting became so bad that the international medical humanitarian organization Médecins Sans Frontières had to close down their outpatient clinic there to ensure its medical staff doesn't get caught in the cross-fire. Yaqshid was mostly deserted by the civilians. By the end of the day, calm returned to Mogadishu and roads were re-opened, the battle was over. This came as the fighting shifted to Hiraan. Due to government forces' poor performance, Somalia's top military commander, General Said Mohamed Hersi (better known as Said Dere) resigned. He was replaced by Yusuf Hussein Dumal.\n15 May 2009\nBy 15 May, calm had returned to the city. Rebels had taken over most of the city, however they failed to topple the government, which remained in control of small pockets of the city. Though the rebel offensive was finished, they continued attacks on government and AMISOM peacekeepers, which they view as an occupation force.\n17 May 2009\n17 May, President Sheikh Sharif Ahmed visited a military academy and rebels fired mortar rounds at the academy. The mortars, however, missed their target and hit civilian homes, killing three and injuring 16 civilians. No group claimed responsibility. On the same day, Jima'ale Mohamud Nur (\"Jebweyne\"), deputy chairman of the Hawiye Clan traditional elders said they would try to mediate between the two sides to stop the fighting. Later in the day an accidental explosion of al-Shabaab explosives, killed 17 people including civilians and al-Shabaab fighters, at least 4 foreign fighters were among the dead. Al-Shabaab leader, Muktar Abdirahman (\"Godane\") was injured by the blast. Sheik Yusuf Mohamed Siad (Indho Ade), whose forces are in control of the former pasta factory, which was a key Ethiopian base until January 2009, defected the government with his militia, putting Sheikh Sharif Ahmed in a more powerful position.\n20 May 2009\n20 May, at least one civilian was killed and five people were injured after al-Shabaab attacked an AMISOM base. The gunfight lasted for two hours and both sides used heavy weapons such as heavy machine guns, mortars, and rockets. Meanwhile, the number of people displaced due to the fighting reached 45,000.\n22 May 2009\nOn 22 May, pro-government forces attacked Islamist militants in Mogadishu. Among those killed in the fighting was a local journalist from Radio Shabelle. The offensive came as rebels had sent most of their forces into Central Somalia to take part in their offensive there. 53 people were killed and 181 were injured, though other sources report only 25 people killed and 90 injured, during the fighting in Mogadishu, on 22 May. Of those 53: 39 were civilians, three were government soldiers and the rest were presumed to be insurgents. Though government forces initially captured insurgent positions and even advanced to main al-Shabaab stronghold of the Bakara market, the fighting ended with Islamist insurgents taking back all lost territory. Colonel Farhan confirmed that government forces had been pushed out of captured positions but said the war wasn't over yet and they intended to re-take Mogadishu with force. Hizbul Islam spokesman Muse Arale claimed they had defeated the Djibouti group (the branch of the ARS which had joined the government) and that they were not in control of even more territory.\n23 May 2009\nBy 23 May, insurgents had advanced to the presidential palace and they started shelling it, with government soldiers returning fire. Three civilians were killed and 13 people were injured by the shelling. Government forces also shelled the Bakara market, this day. Later in the day, calm returned to Mogadishu, the government offensive was over.\n24 May 2009\n24 May 10 people, including 6 soldiers, were killed and 9 people, including 4 soldiers, were injured in a suicide car bombing. The bomber tried to drive a Toyota packed with explosives into a military base, soldiers stopped him from entering and then he blew the car up. Government forces blamed the attack on foreign fighters. Al-Shabaab claimed responsibility for the attack but denied the bomber was a foreigner.\n26 May 2009\n26 May, overnight Islamist rebel forces withdrew from Galbeed police station in Derkenley district. Soon government forces were deployed in Derkenley and they started a military manoeuver there. They also stationed forces South of an al-Shabaab base in Medina. The flow of traffic was halted as tensions are high in Medina and Derkenley and civilians feared for another round of fighting. The reason for the withdrawal is unknown, also there was no word on this by the rebels or the government, it was reported by local residents who informed Shabelle radio. Mortars were launched at the presidential place, killing 2 members of government forces and 5 civilians. Seven people, including insurgents were injured when government forces returned fire.\n28 May 2009\n28 May, a handgrenade was thrown at a government, military base in Dharkaynley district. No group claimed responsibility and no casualties were reported.\n29 May 2009\n29 May, militants loyal to the government, killed 3 teenage boys for unknown reasons in the Dharkaynley district. According to locals, the teenagers were not involved in the conflict between the government and the rebels. In the bakara market, unknown gunmen assassinated Abdulkadir Hamsa (\"Qatatow\"), he was a member of Sharif Ahmed's ARS and was most known for fighting the Ethiopian forces during the insurgency, however, recently he defected to Hizbul Islam with his fighters. It is not clear who killed him as ICU spokesman, Abdirisak Ahmed Qeylow, condemned Qatatow's killing.\n31 May 2009\n31 May, at least 7 civilians were injured after government forces and rebels exchanged mortars in Sinay and Harayale neighborhoods, another 7 were injured.\n1 June 2009\n1 June, ICU spokesman Abdirisak Mohamed Qeyloy announced the government would start crackdown operations restoring the security situation in parts of Hamarweyne district in Mogadishu especially around Guriga Hoyoyinka. TFG-forces launched an offensive in Yaqshid and after heavy fighting re-took the Hizbul Islam controlled Yaqshid police station. Also a bomb blast, targeting a military vehicle on patrol in Mogadishu, killed 5 government forces and 5 civilians.\n2 June 2009\n2 June, clashes in Yaqshid continued as its last inhabitants fled. The number of displaced reached 70,000. Heavy fighting broke out in Derkenley between government forces and Islamist rebels. Rebels control the police station and both sides had been amassing troops in there since 26 May.\n3 June 2009\n3 June, the government re-captured the Yaqshid police station from Hizbul Islam forces and claimed victory. Muhiddin Hassan Juris, Yaqshid district commissioner reported that government forces managed to retake large areas from Hisbul Islam including the contested police station.  Sheik Ali Mohamed Hussein, the al-Shabab commander in charge of Banadir district, however claimed victory for the fighting in Dharkenley and said they killed 10 government soldiers and captured 6. In total, 25 people were killed in the 3 days of violence.\n4 June 2009\n4 June, fighting shifted from Dharkenley and Yaqshid to Hodan were al-Shabaabn and TFG forces battled for the district police station. Though heavy weapons were used, no casualties were reported.\n5 June 2009\n5 June, there was an IED-attack on an AMISOM convoy in Mogadishu, casualties are yet unknown. Fighting in Yaqshid, that day left 4 people dead and over 20 injured. The number of civilians displaced, hit 96,000 that day.\n10 June 2009\n10 June 30 soldiers under command of Ahmed \"Lashin\" Sheikh Muhiyadin defected from the ICU to Hizbul Islam.\n14 June 2009\n14 June, clashes between government forces controlling Ex-control Afgoi and government forces escorting a convoy with food for the displaced people erupted at Ex-control Afgoi when the soldiers manning the checkpoint tried to take taxation money from the other soldiers. 3 government soldiers were killed in the clashes and several people were injured. In the end the death toll rose to 5 killed, 9 injured. Separately, Justice Minister Sheikh Abdirahman Janakow was targeted by a bomb blast, by insurgents, he survived the attack.\n16 June 2009\n16 June, fresh fighting broke out in Northern Mogadishu between al-Shabaab and forces loyal to the government. The fighting started when al-Shabaab attacked government bases in the long road that passes beside the coastline especially Galgalato and El Adde (Northern outskirts of the city). Al-Shabaab spokesman Sheik Ali Mohamud Rage claimed victory in the fighting and Sheikh Ali Dere told reporters that they had captured the area where they were fighting, from the government and captured battle wagons from government forces. Independent sources said there were no civilian casualties as the area where the fighting started was not a residential area. 10 combatants were killed and 20 injured during the fighting.\n17 June 2009\n17 June, ICU forces attacked an Hizbul Islam base in Taribunka Square, in the Hodan district. ICU spokesman Sheik Abdirisak Mohamed Qeyloy claimed victory for the fighting. Ali Sa'id Sheik Hassan the head of police in Banadir was killed during the fighting. Fighting spread to Hodan, Waberi, Hawl-wadag and Karan districts, at the end of the day over 40 people had been killed and over 100 injured by the fighting. Clan elders condemned AMISOM for shelling civilian areas during the day of fighting. During the fighting 1 Ugandan peacekeeper was killed and another one was injured by IED attack.\n19 June 2009\n19 June, heavy fighting started in Karan, Shibis and Yaqshid, rebels managed to capture the Karan police station and other important locations after government forces had made some gains in the fighting on 17 June. At least 8 people were injured during the fighting. Mohamed Husein Adow, a Somali MP was killed during the fighting, it was said he was commanding TFG forces in Karan. Hizbul Islam commander, Mo'alin Hashi told Shabelle radio that they have the upper hand in the fighting in Yaqshid. Military spokesman Farhan Asanyo denied these claims and said government forces were getting near the pasta factory, a main insurgent stronghold. An independent journalist confirmed the success of rebels and said they had now reached the Nasin-Bundo neighborhood in Shibis district. In total 20 people were killed and 60 were injured in Karan only, among the dead were Mohamad Husein Adow and 2 of his bodyguards. Karaan had been under government control since 2007 and was one of the main government strongholds in the city. Casualties for the fighting in Shibis, Abdiaziz and Wardhigley are unknown, these were also government held districts which were attacked by Islamist Insurgents. The fighting lasted until 20 June\n21 June 2009\n21 June, heavy fighting began in Yaaqshiid and Kaaraan districts, the fighting came along with mass shelling by insurgents. At least 12 people were killed and 20 were injured as thousands of civilians started fleeing Karaan. Water and electricity was cut off in these districts and food was said to be scarce. Notorious ex-warlord Muse Sudi Yalahow was said to be commanding the TFG forces. The clashes continued throughout the night and only ended in the morning of 22 June. In response, Sharif Ahmed declared state of emergency and called on the international community for help. Between 19 and 22 June some 26,000 people were displaced bringing the total figure to 160,000 with over 250 civilians killed and 1,000 injured.\n23 June 2009\n23 June, sporadic fighting between the government soldiers and Islamist forces started in parts of Karan districts both sides used heavy gunfire near the police station and mortar attack injured several children.\n28 June 2009\n28 June, heavy shelling started in Hodan district, which is disputed territory. Islamist insurgents control several of its neighbourhoods such as KPP and Sigale. Hodan had been relatively quiet during the battle and many displaced from other neighroubhoords were residing in Hodan. A total of 25 mortar shells were fired, they killed 4 people and injured 13. On the same day, insurgents shelled the presidential palace with mortars, killing 1 person working there. Government forces responded with artillery fire which killed 4 civilians. President Sheikh Sharif, in a press-conference media speculation that they were targeting civilians and claimed only to be shelling rebel positions.\n30 June 2009\n30 June, a bombing killed 1 government soldier and 1 civilian, injuring 3 government soldiers and 5 civilians.\n1 July 2009\nFighting restarted and 15 were killed and 42 injured during fighting in Yaqshid.\n2 July 2009\nFighting broke out in Karan district, as government forces attacked Hizbul Islam positions. Sheikh Muse Arale said that they defeated the government forces, took over the control of Marino and Jiro-Wa'abudan neighbourhoods in Karan district and the Golobal hotel. 7 were killed and 30 were injured during the fighting.\n3 July 2009\nAfter a short period of calm fighting continued for a third day and total casualties were reported at 25 killed and 70 injured. Fighting was centered mostly in Yaqshid, Bondheere, Shibis and Kaaraan. Yusuf Indho Ade claimed they had killed a number of foreign fighters, these claims were rejected by Muse Arale.\n4 July 2009\nA reporter, Mohamed Yusuf \"Ninile\", was killed by unidentified gunmen in Yaqshid, 2 civilians were killed alongside him. Separately, in Howlwadaag district 2 civilians were killed in the cross-fire and 5 were injured. There was reports of explosions in Hamar Weyne and Hamar Jabab, but no casualties were reported. In total, 30 people were confirmed to have been killed in the 3 days of fighting but unconfirmed reports suggest the number was as high as 90.\n5 July 2009\nShelling killed 10 and injured 3 in Karan district as fighting continues and many fled the town. Number of displaced reached 170,000. The total casualties for this round of fighting were: 105 killed and 382 injured. The number of displaced had hit 204,000.\nFighting ended as Sheikh Moktar Ali Zubeyr, the Amir (leader) of al-Shabaab gave government forces an ultimatum of 5 days (until 10 June) to hand over their weapons. The ultimatum was rejected by Indho Ade.\n9 July 2009\nOn the last day of Ali Zubeyr's ultimatum some clashes erupted between al-Shabaab and TFG forces in Derkenley district where both sides had military bases. According to local sources, some casualties reached both sides but exact figures remained unknown.\n10 July 2009\n16 were killed in Mogadishu during an attack by Islamists. Forty people, including many civilians, were injured in the fighting. Also a landmine attack, killed 1 government soldier and injured 1 soldier and 1 civilian in Jiro-Miskin neighborhood in Wadajir.\n11 July 2009\nHeavy fighting broke out in Northern Mogadishu around Golobla hotel in the Abdula Azis district. Fighting continued through 12 July until Government forces defeated the rebels and took control of Abdula Azis. Several foreign fighters were killed and two were captured. Col. Nur Daqle, a senior government commander, was killed in the fighting. 25 people were killed in the fighting. At Mogadishu's presidential palace, at least three AMISOM peacekeepers were killed by a mortar attack, government forces claimed to have killed 40 al-Shabaab fighters who were attacking the palace.\nThe total casualties for the two days of fighting (11 July & 12 July) was over 70 with more than 125 injured. Government forces claimed that among the dead were over 40 al-Shabaab fighters and only three of their own soldiers and three Ugandan peacekeepers.\n13 July 2009\nAl-Shabaab and Hizbul Islam forces re-took control of positions in Abdula Azis, which they lost on 11 July to government forces. The Insurgents had retreated from the city on 12 July, Sharif Ahmed claiming a \"historical victory, but on this day they returned to their positions after receiving reinforcements from Gedo, Middle Shabelle and Jubba regions.\n16 July 2009\nFighting and shelling between TFG and Insurgent forces killed at least 2 people and injured at least 15. Calm returned to the city on the morning of 17 July.\n17 July 2009\n40 mortar shells fired by government forces hit the districts of Kaaraan, Yaaqshiid and Wardhigley which are mostly under insurgent control. Insurgents fired dozens of mortars at Hamarweyne district (a government controlled district) in response. At least 5 civilians were killed and 7 injured. Separately, 2 French security advisors to the government were captured by insurgents. The Somali government gave permission for French commandos to launch operations inside Somalia to free the 2 French nationals that held by al-Shabaab.\n19 July 2009\n4 civilians were wounded in an explosion targeting government forces in Derkenley district. In Hodan district, Islamist forces attacked an AMISOM base and a TFG base in Hodan's Taleh neighborhood. A fierce gunbattle along with shelling left at least 13 people injured.\n20 July 2009\nAl-Shabaab attacked AMISOM forces stationed at the KM4 area. Witnesses reported that heavy shelling shook the city, as artillery fire hit neighborhoods around the Bakara Market. A total of 3 people were killed and 14 were injured, all of which civilians. On 21 July, the amount of displaced was said to have hit 223,000 with over 20,000 fleeing in the last 2 weeks.\n22 July 2009\nFrench Warships and Helicopters were seen near the port of Mogadishu as France declared they would undertake military operations to free the two French military advisers who had been captured by insurgents.\n23 July 2009\nHeavy shelling hit the Wardigley, Bondere and Karan districts in the North of the city. In the South of the city there was heavy gunfire in a battle for the Km4 intersection in Hodan district, which is an AMISOM base. In total 25 people were killed and 60 were injured, most of which civilians.\n25 July 2009\n13 TFG-soldiers were injured in a vehicle accident near Sayidka tower in Mogadishu.\n27 July 2009\nAfter a gunbattle between insurgents and pro-government forces at the Maka Al Mukarrama Road, an important street used by government and AMISOM forces, heavy shelling broke out that resulted in the death of seven and injury of 15 civilians, most of which were killed as government artillery shells hit the Bakara market, an insurgent stronghold.\n29 July 2000\nInsurgent mortar fire hit the parliamentary building during a meeting, separately insurgents also fired mortars into the government controlled Hamarweyne district. A total of 15 people were injured by the mortar attacks.\n30 July 2009\nEight Ugandan peacekeepers from AMISOM were sent to the intensive care after an alleged poisoning case. It was suspected that the peacekeepers were poisoned by al-Shabaab insurgents. Separately four people were killed and six injured during a gunbattle between bodyguards of Somali Justice Minister Sheikh Abdirahman Janakow and another group of government soldiers. The dead and wounded included civilians. The fighting erupted after Minister Janakow's soldiers attacked a convoy of soldiers at Zope intersection while traveling to Villa Baidoa military compound in Mogadishu, the battle then spread into parts of Bulo Hubey neighborhood.\n3 August 2009\nIn Hodan district at Km4 intersection, two Somali soldiers fought each other. Both men were heavily injured by each other's gunfire and were brought to hospital, where they died. Two civilians died on the spot. It was said that the two soldiers disagreed over extortion money they were forcefully collecting from civilians using the road. Separately one soldier was killed and five were injured as an insurgent through a grenade at a group of soldiers. Another two civilians were killed and 12 were injured as government artillery fire hit the Bakara market, this was in response to Hizbul Islam attacking the presidential palace, starting a large gunbattle with AMISOM and government forces.\n5 August 2009\nAs 20 Somali MPs landed at Mogadishu's Aden Adde International Airport a series of fighting and bombings killed seven and injured 15 in the city. Two civilians were killed at an intersection in Hodan as insurgent forces attacked the government forces which were controlling the intersection, the civilians were caught in the crossfire. Two soldiers and one civilian were killed by a bombing in Waberi district. In Dharkinley district, government forces shot and killed two unarmed civilians.\n8 August 2009\n10 civilians were killed and 22 were injured after mortar shells hit the Bakara market. Insurgent and AMISOM forces both accuse each other of the shelling.\n9 August 2009\nA big explosion targeting government forces in the Afisyone neighborhood in Waberi district killed two policemen and one civilians.\n12 August 2009\nFresh fighting broke out in the Zobe neighborhood in the Hodan district as government troops fought each other. The fighting left four soldiers and two civilians dead as well as 20 people injured. They were fighting for control of a key intersection. The battle was between fighters loyal to General. Abdi Qeybdiid, Somalia's national police chief, and fighters loyal to Abdifatah Shaweye, Mogadishu's deputy mayor.\n13 August 2009\nClashes between government and insurgent forces broke out in Kahda neighborhood in Derkenley district. This led to, insurgents launching mortars at Somali government bases in Medina. The shells however hit civilian areas in Dherkenley and caused the death of 2 civilians (one of which being an old man) and the injury of 4 civilians (including a 10-year-old girl).\n16 August 2009\nInsurgents fired mortars at the port, but they missed and hit civilian homes. 5 civilians were killed and 20 were injured.\n17 August 2009\nA government soldier was killed and a young boy was injured as an IED targeted a government patrol in Nasteho neighborhood in Wadajir district.\n21 August 2009\nInsurgents equipped with machine guns and rocket-propelled grenades attacked military forces and African Union peacekeepers, leaving 21 dead and injuring 40. Most of the victims were civilians who were hit by shrapnel or stray fire.\n22 August 2009\nFighting in the Hodan and Holwadag neighbourhoods left six civilians and several Islamist fighters dead, another 17 civilians were wounded. The street battles started after insurgents attacked a government base in the area. Total casualties said to have reached 30 killed and 120 wounded. Indho Ade claimed his forces were victorious and captured \"new territory\".\n25–26 August 2009\nIslamists attacked Dabka intersection, a base for the TFG troops, fighting continued overnight and the TFG claimed victory for this 24-hour battle.\n27 August 2009\nAt least four were killed and 8 were injured during a heavy gunbattle at a government checkpoint, linking Mogadishu to Afgoy.\n1 September 2009\nTwo civilians were killed and 9 were injured during a fierce gunbattle at the Sayidka intersection as Islamist Insurgents attacked a government base, there.\n3 September 2009\nAt least five civilians have been killed and nine others have been injured in Mogadishu after heavy fighting between AMISOM and Insurgent forces. The fighting started as Insurgents attacked the AMISOM base: Kuliyadda Jale Siad, in Daynile district. 5 civilians were killed and 9 were injured during the fighting and the shelling that followed.\n4 September 2009\nAbdifatah Ibrahim (\"Shaweye\") said the government forces were planning an offensive to drive out all opposition forces from the capital. This is not the first time that government commanders made such claims.\n5 September 2009\nAt least ten civilians were injured as heavy fighting broke out, 6 of which as mortar hit the neighborhood of 5-ta Ged in Hawl-wadag district, some reports say the casualties might have been even higher.\n11 September 2009\nMortars fired by al-Shabaab hit a residential area, the city jail and De Martino Hospital, killing at least 10 people and injuring 25.\n12 September 2009\nHeavy fighting started early in the morning in around Kulliyada Jalle Siad building (the largest Burundian base in the city), between Islamic Insurgents and AU forces, they continued exchanging fire for the rest of the day however casualty figures are unknown for the incident.\n17 September 2009\nTwin suicide bombings killed 17 AMISOM soldiers (including Brigadier General Juvenal Niyoyunguruza of Burundi) and 4 Somali civilians (as well as the two suicide bombers), wounding 40 people including Ugandan commander: General Nathan Mugisha. A further 19 Somali civilians were killed in the shelling that followed. Al-Shabaab claimed responsibility for the attack and said it was a reprisal for the US air strike which killed Ali Saleh Nabhan.\n29 September 2009\n12 civilians were at Bakara after the market was shelled. African Union peacekeepers. On 1 October, another 2 civilians were killed during the shelling of Bakara market, one of the main insurgent strongholds.\nSee also\n*Somali Civil War\n*Battle of Mogadishu (1993)\n*Battle of Mogadishu (2006)\n*Fall of Mogadishu (2006)\n*Battle of Mogadishu (March–April 2007)\n*Battle of Mogadishu (November 2007)\n*Battle of Mogadishu (2008)\n*Battle of South Mogadishu (2009)\n*Battle of Mogadishu (2010–11)\nReferences\nExternal links\n*[http://psugeo.org/Africa/DMS/Hard%20Copy%20Maps/Somalia_Mogadishu_city_plan.jpg Mogadishu City Map]"
    }
  ]
}