{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Oranik (1456)\n\n}}\n| image             =\n| caption           = 16th century engraving by Jost Amman\n| partof            = Albanian–Ottoman Wars (1432–1479)\n| date              = 18 May 1456\n| place             = Plains of Oranik (Debar in modern day Macedonia)\n| coordinates       =\n| map_type          = Macedonia\n| result            = Albanian victory\n| combatant1        =  Albanian rebels\n| combatant2        =  Ottoman Empire\n| commander1        =  Skanderbeg\n| commander2        =  Moisi Arianit Golemi\n| strength1         = 10,000 men\n| strength2         = Unknown but larger\n| casualties1       = 1,000 dead\n| casualties2       = Unknown\n}}\nThe Second Battle of Oranik () took place during the spring of 1456 in the plains of Oranik (Debar in modern-day Macedonia). Moisi Arianit Golemi, lord of Debar, and one of Skanderbeg's officers, deserted to the Ottomans following the defeat at Berat in 1455. Golemi set off from Adrianople with an army to capture Albania but was swiftly defeated by Skanderbeg's smaller forces.\nBackground\nSkanderbeg's resistance had been going on for over a decade, during which time he defeated many Turkish armies. The Ottoman Turks sent an invasion force under Isak Bey Pasha to subdue southern Albania. In this invasion, Isak captured the Albanian stronghold of Berat and crippled the Albanian resistance. Moisi of Dibra, one of Skanderbeg's most trusted officers, deserted to the Ottomans and made an attempt to defeat Skanderbeg by using the Ottoman army. He left Adrianople with 15,000 soldiers and marched towards Albania. Because of the knowledge Moisi possessed of Skanderbeg's strategies and of the Albanian terrain, Skanderbeg made all his dispositions for defense.\nPre-battle\nSince Moisi was a master in sleights and subtleties, Skanderbeg let the invader march through Oranik without any interruptions. Even when Moisi arrived, Skanderbeg was ready to deal with him by sending envoys but Moisi did not stop his march. The two armies met and the battle began with man-to-man combat between one soldier from each army. A Turk named Ahimaz stepped out and issued a challenge, which was taken up by an Albanian, Zaharia Gropa. Both men rode out on horse and both men were dismounted. The fight continued on foot until Zaharia stabbed Ahimaz in the throat and cut off his head whilst the two horses rode towards the Albanian lines, which was taken as a good omen by Skanderbeg's forces. Moisi then stepped out and challenged Skanderbeg to personal combat. As Skanderbeg began to move towards him, Moisi turned around and fled back to his own army, giving orders to begin the attack on the Albanians.\nThe battle\nThe Ottoman forces were in two lines, the second consisting of picked soldiers who were to support the first in case of trouble. Behind these two lines was Moisi with his reserves of Albanians, probably his tribal supporters. Skanderbeg's force, comprising 6,000 men on horse and 4,000 on foot, were divided into three lines with the commander in charge of the middle. Both Turkish lines quickly broke under the shock of the Albanian cavalry attack and the battle turned to hand-to-hand fighting with both commanders dangerously involved. Skanderbeg was thrown off his horse, but the initial impetus gave Skanderbeg an advantage that he never lost. Moisi escaped with about one third of his army.\nAftermath\nMoisi wandered around the frontier area for some time and then returned to Adrianople, where he was regarded with contempt. He found himself in debt, and lived in an atmosphere of fear and foreboding. He suddenly decided to throw himself to Skanderbeg's mercy. He left Adrianople at night and rode to Debar, where he was well received. Skanderbeg was at a nearby garrison and Moisi went there to ask for forgiveness. Skanderbeg pardoned him and restored his lands. Bonfires were lit to celebrate his return, and people were warned that his offense should never be publicly referred to.\nReferences and notes\nSources\n*Hodgkinson, Harry. Scanderbeg: From Ottoman Captive to Albanian Hero. London: Centre for Albanian Studies, 1999. ."
    }
  ]
}