{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Prachuap Khiri Khan\n\n|result=Ceasefire\n|combatant1=\n|combatant2=\n|commander1= Prawat Chumsai\n|commander2= Maj. Kisoyoshi Utsunomiya\n|units1= Royal Thai Armed Forces\n* RTAF Fifth Wing\n* 5th Infantry Division\n|units2= 55th Division\n* 143rd Infantry Regiment\n** 2nd Battalion\n|strength1=\n|strength2=\n|casualties1=42 killed27 wounded3 aircraft destroyed\n|casualties2=115 killed (Japanese claim)217 killed300+ wounded(Thai estimates)\n}}\nThe Battle of Prachuap Khiri Khan () was an early engagement of the Japanese invasion of Thailand in the Southeast Asian theatre of World War II. It was fought on 8–9 December 1941 at the airfield of Prachuap Khiri Khan, on the coast of the Gulf of Thailand along the Kra Isthmus. The Japanese meant to use Thailand as a base to strike at British possessions in Burma and Malaya and attacked Thailand without warning.\nThe last Thai veteran to have fought in this battle, Choi Lodthanong, died on 2 June 2021 at the age of 100.\nBattle\nAbout 03:00 on 8 December 1941, the 2nd Battalion, 143rd Infantry Regiment, 55th Division of the Imperial Japanese Army, under the command of Major Kisoyoshi Utsunomiya, began landing troops at Prachuap Khiri Khan. When informed of the invasion, Wing Commander Mom Luang Prawat Chumsai of Kong Bin Noi (Squadron) 5 immediately gave orders to resist.\nThe units on the airfield were equipped with six heavy and two light machine guns, which they immediately turned against the Japanese troops trying to surround the airfield. The small garrison of pilots and ground crew was reinforced by members of the constabulary and the Yuwachon Thaharn (a quasi-military teenage auxiliary) who had managed to escape from the town of Prachuap Khiri Khan after the Japanese captured the telegraph office and the police station.\nDespite the fact that the Japanese occupied part of the airfield, Kong Bin Noi 5's pilots attempted to take off at sunrise to bomb and strafe the advancing Japanese.\nChief Warrant Officer Prom Chuwong was first to take off in a Hawk III. Japanese ground fire quickly shot him down, killing him. The Japanese shot down two more Hawks as they took off, killing both pilots, and wounded a third pilot as he brought his Hawk onto the runway. Only one other pilot managed to get airborne. Flying Officer Man Prasongdi took off in a Hawk III armed with four 50&nbsp;kg bombs and attempted to attack Japanese transports in Ao Manao harbor, but he could not locate them due to heavy fog and rain.\nBy 08:00, most of the northern hangars were in Japanese hands. The Thais smashed the instruments of the isolated airfield control tower and set fire to it, as the runways were abandoned. A new perimeter was set up and the withdrawing airmen were covered by a machine gun positioned in the clubhouse's tennis court, manned by Airmen Singto Saensukh and Kasem Wongkangya. The machine gun kept firing throughout the morning and into the afternoon.\nPilot Officer Somsri Suchrittham and his men, whose strength was now around thirty, were forced to withdraw when their northern flank was threatened by the abandonment of the runways.\nHaving successfully secured the beachhead, the Japanese proceeded to occupy what was left of the hangars and runways, and reinforcements, including artillery and ten tanks, were landed from the transports.\nThe families of the airmen took refuge in guesthouses on Mount Lom Muak. The evacuation of the living quarters was supervised by Pilot Officer Phol Thongpricha.\nAnother position was set up by defenders, who divided themselves into three groups. One group was stationed by the guest houses on Prachuap Bay and fired on anything coming up the road from the guard house. A second group, under the immediate command of Wing Commander Prawat, placed itself in the area around the command and administrative buildings. The final group occupied houses facing Manao Bay. These two groups fired on the approaches from the hangars and the runways.\nFighting continued into late evening, but with lessening intensity. The machine gun at the tennis court held back the Japanese, while a light machine gun was held in reserve and moved to plug gaps in the perimeter.\nRumours that Royal Thai Navy sailors were fighting their way through to relieve the airmen kept up Thai hopes through the night. Ammunition was low, and at one point the airmen fired blank rounds at the Japanese.\nThe following morning, the exhausted Thais received a telegram from the Ministry of the Interior, brought in by a postman during a lull in the battle. The telegram ordered the defenders to cease fighting, as an armistice had been arranged by the government. The Thai defenders suspected this was a trick by the Japanese and continued to resist. The infuriated invaders now mounted assaults with renewed vigor. The defenders were slowly pushed back. About this time, the lone machine gun in the tennis court was taken out, both gunners severely wounded.\nBy 10:00, with the Japanese closing in, Wing Commander Prawat ordered the command building to be burned, along with all military documents. As flames engulfed the building, Flying Officer Prayad Kanchonwiroj, the senior medical officer, ordered the hospital building evacuated and set on fire.\nWing Commander Prawat ordered all officers to save a bullet for themselves and said those who wanted to were free to try to break out on their own. The others, including the wounded, were to fall back on Mount Lom Muak.\nAt noon, a civilian car with a small white flag arrived. It contained a number of Thai government officials, including the provincial undersecretary, Jarunphan Isarangun na Ayutthaya. Jarunphan handed Wing Commander Prawat a direct order from the Prime Minister, Field Marshal Plaek Phibunsongkhram, telling him to cease resistance immediately. Fighting officially ended at 12:35 on 9 December 1941.\nCasualties\nThe Thais suffered 42 killed and 27 wounded, including airmen, police, and civilians. Wing Commander Prawat's pregnant wife was among the dead, killed by a stray bullet.\nJapanese sources stated that the Japanese suffered 115 dead. However, Thai estimates of Japanese losses were put at 217 killed and more than 300 wounded. (The Japanese had cremated their dead and prevented the Thais from counting them.)\nMemorials\nA monument to the Thai defenders stands on the Royal Thai Air Force base at Prachuap Khiri Khan. Each December a memorial is held to honour those who fought and died defending their country from invasion.\nReferences\nExternal links\n*\n*[https://web.archive.org/web/20091027105023/http://geocities.com/thailandwwii/prachuap.html The Japanese Invasion of Prachuap Khiri Khan]"
    }
  ]
}