{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Point 4875__disambig_1\n\n| combatant2        =\n| commander1        = Mohinder PuriRakesh Kumar KakkarYogesh Kumar JoshiS Vijay BhaskerGurpreet SinghVikram Batra  Naveen Nagappa\n| units1            = 13th Jammu and Kashmir Rifles\n| units2            =  Northern Light Infantry Regiment\n| commander2        = Unknown\n}}\nThe Battle of Point 4875 took place from 4 to 7 July 1999 and was a pivotal military offensive carried out by the 13th Jammu and Kashmir Rifles battalion in the Kargil War of 1999. The battle was an Indian success.\nBackground\nThe 13 JAK Rifles was placed under the command of the 79 Mountain Brigade after their victory at point 5140. The next assignment for Lt Col YK Joshi's battalion was to capture Point 4875, a strategically important peak located in the Mushkoh Valley. Since the feature dominated the National Highway 1 completely from Dras to Matayan, it became imperative for the Indian Army to capture Point 4875. A stretch of 30–40 kilometres of the national highway was under direct observation of the infiltrators. From Point 4875, Pakistani artillery observers could easily see Indian gun positions, army camps and troop movement, and bring down effective artillery fire at will.\nOverview\nOn 1 July 1999, Major S Vijay Bhaskar, 'A' Company commander, and Lt. Col. Joshi, commanding officer of the 13 JAK Rifles, conducted their preliminary reconnaissance, after climbing to a vantage point, and formulated an attack plan. Subsequently, on 2 July, GOC-8 Mountain Division, Maj Gen Mohinder Puri and Brig Rajesh Kumar Kakkar Commander 79 Mountain Brigade and Lt Col Y.K. Joshi, Commanding Officer 13th JAK Rifles gathered at 79 Mountain Brigades headquarters, to discuss the plan.\nThe battalion was deployed to firebase, located in a defiladed area, approximately 1500 metres from Point 4875. Over the two days, on 2 and 3 July, weapons carriers from the 13 JAK Rifles and 28 Rashtriya Rifles dumped ammunition and heavy weapons. During the day of 4 July, the company commanders of 'A' and 'C' Companies, Major S.V. Bhaskar and Major Gurpreet Singh, conducted their final reconnaissance and showed the objectives to their 'O' groups.\nAt 1800 hours that same day, artillery bombardment of the infiltrator positions on Point 4875 commenced, and continued throughout the whole night. 155 mm Bofors Howitzers, 105 mm Field Guns, and multi barrel rocket launchers were used in the bombardment of Point 4875. At 2030 hours, under cover of artillery fire, 'A' and 'C' Companies began climbing the Point 4875. Capt Vikram Batra was excused from the offensive because he was down with fever and fatigue.\nBoth the assault companies were leading the offensive from the right flank. The soldiers had to take out enemy pockets of resistance which they encountered en route. However at one point, a strategically located machine gun halted the advance, and by first light the troops were still 50 meters short of the target. Now it was getting dangerous because in daylight, Indian soldiers could easily be seen by the Pakistanis. The attack was also halted by very effective sniper fire from Pakistani soldiers hiding behind rocks.\nAt 0430 hours, the two companies deployed their automatic weapons and began to fire at the well-fortified Pakistani positions at the top of the feature. The infiltrators were bringing down small arms fire and sniper fire, which effectively blocked the advance of the Indian troops. At around 1015 hours on 5 July, the commanding officer of 'C' company spoke to the battalion commanding officer and explained his company's predicament and the area from where the enemy was bringing in fire on them. Brigadier Kakkar was personally supervising operations. At this juncture, the battalion commanding officer, Lt Col Joshi personally fired two Fagot missiles in quick succession from the fire base and neutralised the position. Brigadier Kakkar watched the firing of the missiles through his binoculars. The bunker received a direct hit and the Pakistani soldiers were seen fleeing from it. The Indian troops then promptly began advancing again. Soon, Company C with two sections, led by Major Gurpreet Singh assaulted the enemy position. By 1300 hours, these troops had captured Point 4875. Subsequently, both 'A' and 'C' Companies linked up. They then consolidated their hold on Point 4875, however the Indian troops continued to receive artillery and machine-gun fire from Pimple 2 and area North of Point 4875.\nAt 2200 hours on 5 July, from a Pakistani position north of Point 4875, the infiltrators brought heavy and accurate fire on the two companies. In the early hours of the following morning at 0445 hours, 'C' Company reported they were in a heavy firefight and were running out of ammunition. Company B, the reserve company, promptly brought up the ammunition after which the firefight continued.\nThe Indian victory would not have been complete without the capture of 'Area Flat Top', an adjacent peak and part of Pakistani defences on Point 4875. But the infiltrators launched an immediate counterattack to take back the Area Flat Top they had lost. Young Captain NA Nagappa was holding Flat Top. He had a small force but he fought ferociously to beat back the offensive. The first counter-attack was beaten back. The Pakistanis too were facing the same problem of climbing, with the Indian Army on top shooting at them. A shell hit Area Flat Top, seriously injuring Captain Naveen Nagappa who was shooting at the advancing Pakistani soldiers. Splinters pierced through both his legs and he fell unconscious. Taking advantage of this situation, the Pakistanis started climbing faster.\nCapt Vikram Batra, who was observing the situation from base, went to his commanding officer and volunteered. Despite not in favor of deploying Batra to the field, he was deployed because of urgent need of reinforcement on the area flat top. Several of his battalion's soldiers volunteered to accompany Batra even before any Company could be ordered.\nIt was pitch black night when the newly formed Delta company under Capt Batra began the climb. On the night of 6–7 July, the opposing forces were so close that besides exchanges of small arms fire, verbal exchanges continued throughout the night. It was at this stage where it became imperative for Indian troops to destroy this Pakistani post, located north of Point 4875, from where fire was coming as otherwise the situation could become worse. At this juncture, the Indian troops detected the Pakistani presence on a long and narrow ledge, running north from Point 4875. On the ledge, the enemy were holding strong sangars echeloned one behind the other. En route to the top, Batra spotted a Pakistani machine gun position firing at the trapped Indian soldiers. Crouching, he moved toward the machine gun position, hiding behind rocks whenever possible. As he reached close to the enemy's machine gun position he lobbed a grenade, destroying the machine gun position. Before first light on the 7th, the troops succeeded in knocking out two more enemy machine guns, however, firing from the ledge continued. Batra's platoon soon reached the ledge, though by this time it was broad daylight.\nAt 0530 hours Lt. Col. Joshi spoke to Batra and asked him to reconnoiter the area. Batra, accompanied by Subedar Raghunath Singh and Major Bhat, his artillery observation officer, took out a patrol to recce a route to re-inforce Naveen from a flank. Batra located the position of the sangar on the ledge from which enemy machine guns were holding up the advance of his company. At this juncture, Batra, realising there was no way from the left or right, decided to make a direct assault in daylight itself. Under heavy fire from enemy machine guns and grenade firing launchers, Batra moved forward, screaming the battle cry of JAK RIF – Durga mata ki jai, and charged the sangar firing incessantly from his AK-47. He sustained grievous injuries in the process, yet he continued his charge, with supporting fire from the rest of the patrol, and upon reaching the very narrow entrance of the sangar and taking the enemy by complete surprise, he killed 5 Pakistani soldiers in a close-quarter battle. The attack resulted in seven Pakistani soldiers killed after which the Indians gained a foothold on the ledge. Taken by surprise by the attack, Pakistanis started retreating. Batra and his men had gained the upper hand by now. Batra pulled out a bleeding Naveen from the bunker. However, there was still a machine gun nest in action on that ledge that had to be silenced. Four Pakistani soldiers including a junior commissioned officer (JCO), who was guiding the fire on the Indian soldiers fighting outside, were manning the machine gun nest. Batra charged forward alone, killing all four members of the crew.\nBatra realised one of his men had been shot. Batra was shot in the chest by an enemy sniper from very close range in the process of rescuing this soldier, and a split-second later, by a splinter from an RPG which hit him in the head. Batra collapsed next to the injured soldier, succumbing to the fatal wounds.\nReferences\nBibliography\n*\n*\n*\n* }}\n*\n*\n*\n*\n*\nExternal links\n* [https://economictimes.indiatimes.com/news/defence/remembering-kargil-veterans-recollect-battle-of-point-4875/videoshow/70242026.cms?from=mdr Remembering Kargil: Veterans recollect Battle of Point 4875], The Economic Times (July 2019)"
    }
  ]
}