{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Drocourt-Quéant Line__disambig_1\n\n(Hindenburg Line)\n| coordinates = North end   South end\n| result      = Canadian and British victory\n| territory   = German army withdrew  to the Hindenburg Line, February–March 1917\n| combatant1  =\n| combatant2  =\n| commander1  =  Henry Horne Arthur Currie\n| commander2  =  Otto von Below\n| strength1   =\n| strength2   =\n| casualties1 =\n| casualties2 =\n| campaignbox =\n}}\nThe Drocourt-Quéant Line (; ) was a set of mutually supporting defensive lines constructed by Germany between the French towns of Drocourt and Quéant during World War I. This defensive system was part of the northernmost section of the Hindenburg Line, a vast German defensive system that ran through northeastern France.\nIt was attacked and captured by Canadian and British troops in the closing months of the war as part of Canada's Hundred Days of successful offensive campaigning that helped end the war.\nDescription\nThe Drocourt–Quéant Line (also referred to as the Drocourt–Quéant Switch) ran between the French cities of Drocourt and Quéant and was part of a defensive system that ran from a point within the Hindenburg Line,  west of Cambrai, northward to within  west of Douai and terminated along the front east of Armentières. The Drocourt–Quéant Line was a system in depth and incorporated a number of mutually supporting lines of defence. The system consisted of a front line system and a support line system, each consisting of two lines of trenches. The system incorporated numerous fortifications including concrete bunkers, machine gun posts and heavy belts of barbed wire.\nPrelude\nIn the days leading up to the attack, the Drocourt–Quéant Line was obscured from Canadian observation west of Cagnicourt due to a hill. An attack was ordered, with the 72nd Battalion on the left and the 5th Battalion on the right.\nAt 4:50&nbsp;am on 1 September 1918, the Canadian soldiers attacked and captured high ground northwest of Cagnicourt, securing observation into the Drocourt–Quéant Line, but suffering heavy losses in the process.\nCapture\nAt 5:00&nbsp;a.m. on 2 September 1918, Canadian and British forces attacked the Drocourt–Quéant Line supported by tanks and aircraft. In twilight, the Canadian 1st Division attacked the line south-eastwards, on the extreme right, south of the Arras–Cambrai road, The Canadian 4th Division attacked in the centre between Dury and the main road and the British 4th Division attacked south of the River Sensee.\nSeven Canadians were awarded VCs individually that day: Bellenden Hutcheson, Arthur George Knight, William Henry Metcalf, Claude Nunney, Cyrus Wesley Peck, Walter Leigh Rayfield and John Francis Young.\nThe next day the Germans retreated to the Hindenburg Line with the Allies taking many prisoners. The Canadian and British troops then moved on to their next battle, the Battle of the Canal du Nord.\nMemorials\nThe Canadian Dury Memorial commemorates the Canadian Corps attack on the Drocourt–Quéant Line in 1918.\nFootnotes\nReferences\n*\n|author= |title=History of the Corps of Royal Engineers |volume=V |year=1952 |publisher=The Institution of Royal Engineers |location=Chatham |isbn=0-90353-010-4}}\n*\nExternal links"
    }
  ]
}