{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Grodno (1708)\n\nBattle of Grodno}}\n| result            = Swedish victory\n| combatant1        =  Swedish Empire\n| combatant2        =  Tsardom of Russia\n| commander1        =  Charles XII\n| commander2        =  Peter I\n| strength1         = 800\n| strength2         = 9,000\n| casualties1       = 11 killed  43 wounded\n| casualties2       = 150 killed  50 captured\n| campaignbox       =\n}}\nThe Battle of Grodno (1708) was the first battle of the Swedish invasion of Russia on 26 January 1708, during the Great Northern War. Grodno was a city of the Polish–Lithuanian Commonwealth at this time.\nBattle\nDuring the start of the Swedish invasion of Russia, Charles XII of Sweden was informed of Peter I's presence at the town of Grodno and immediately marched there with his vanguard of approx 800 men. While awaiting the rest of his army, Peter had 9,000 men for use in Grodno. 2,000 of these had been stationed near the bridge leading to the town. On his arrival, the Swedish king charged with his cavalry in a surprise to drive the Russians away.\nAfter a short but fierce fight which had cost them some 100 killed and 50 captured, the Russians guarding the bridge retreated into the town. Shocked by the news of a sudden Swedish attack, Peter I, who was said to have been in danger of capture, ordered a retreat to Berezina with his army, leaving Grodno defenseless for Charles to enter only two hours later.\nThus, the Swedish king, with his smaller army, forced a much larger Russian force away from their advantageous position. However, while discovering the numbers of the Swedish vanguard, Peter I immediately ordered 3,000 of his troops back in an attempt to recapture the town and possibly the Swedish king himself. As night fell and the soldiers were sleeping, the Russians reached the gates of Grodno, but were halted by the 30 men guarding there. As fighting arose, Charles and his men were alerted and a new fight took place inside the town which forced the Russian army back, leaving being 56 killed; the Swedes lost 11 killed and 43 wounded.\nReferences\nBibliography\n*\n*\n*"
    }
  ]
}