{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Elmina (1781)\n\n| combatant2  =\n| commander1  =  Adam Mackenzie Thomas Shirley\n| commander2  =  Jan Pranger\n| strength1   = 4 Warships\n* 500–600 Soldiers\n| strength2   = Garrison of 1,500 (including slave soldiers)\n| casualties1 = Unknown\n| casualties2 = Unknown\n| campaignbox =\n}}\nThe Battle of Elmina was a significant engagement that transpired during the Fourth Anglo-Dutch War. In this military encounter, British forces undertook an operation with the aim of capturing the strategic Elmina Fort. However, their efforts ended in failure, as the British were unable to secure control of the fortification.\nBackground\nDuring the Fourth Anglo-Dutch War, the British undertook an expedition led by Thomas Shirley with the objective of capturing Dutch forts situated along the Gold Coast. This military endeavor was prompted by the outbreak of hostilities between the two nations. Thomas Shirley's first destination was Elmina, a strategic location within the Gold Coast region.\nBattle\nOn the 18th of February, Captain Mackenzie and his forces shot the signal to prepare for an attack on Elmina. He initiated the offensive by discharging one of his lower deck guns and subsequently raising the British flag atop the mast of the ship. The engagement commenced with an immediate exchange of fire directed at the fort. The artillery exchange persisted for approximately 20 minutes, causing noticeable disturbance and potential damage. This initial exchange of fire provoked a reaction from the Dutch defenders. However, a timely cessation of hostilities transpired, preventing further escalation of the conflict. This pause in combat was particularly favorable for the British forces, as it likely averted significant casualties. Resuming hostilities at a quarter to six, the fire exchange recommenced and continued until 8 o'clock. During this period, the British encountered formidable resistance from the Dutch defenders, as well as African slaves who were participating in the defense. The intensity of the battle escalated swiftly, but the Dutch forts exhibited robust defensive capabilities, including effective bombardment of the British forces.The relentless barrage of fire had a considerable impact on the British forces, causing significant annoyance and inflicting notable damage. Consequently, the British forces opted to retreat rapidly from the engagement. At half past 11, both sides agreed to cease fire. This decision was likely influenced by the realization that the British forces were unable to sustain their position any longer. Additionally, it was noted that the British had suffered the destruction of their siege equipment, further impairing their ability to continue the capture of the fort.\nReferences"
    }
  ]
}