{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Prinitza\n\nThe Battle of Prinitza was fought in 1263 between the forces of the Byzantine Empire, marching to capture Andravida, the capital of the Latin Principality of Achaea, and a small Achaean force. The Achaeans launched a surprise attack on the greatly superior and overconfident Byzantine force, defeated and scattered it, saving the principality from conquest.\nBackground\nAt the Battle of Pelagonia (1259), the forces of the Byzantine emperor Michael VIII Palaiologos () killed or captured most of the Latin nobles of the Principality of Achaea, including the Prince William II of Villehardouin (). In exchange for his freedom, William agreed to hand over a number of fortresses in the southeastern part of the Morea peninsula. He also swore an oath of allegiance to Michael, becoming his vassal and being honoured by becoming godfather to one of Michael's sons and receiving the title and position of grand domestic. In early 1262, William was released, and the forts of Monemvasia and Mystras, as well as the district of Mani, were handed over to the Byzantines.\nThe agreement was bound to be of short duration, however: the establishment of a small province in the Morea was for Palaiologos but the first step towards reclaiming all of the peninsula, and William likewise was involved in the Latin efforts to counter the emperor and regain Constantinople. Consequently, soon after his return to the Morea, William settled his differences with the Venetians over Negroponte, and negotiated with them and the Pope for joint action against Palaiologos. In July, Pope Urban IV nullified William's oaths to the emperor, and appealed to the Western princes for aid against the \"schismatic\" Byzantines.\nIn late 1262, William visited the region of Laconia accompanied by an armed retinue. Despite his concessions to the Byzantines, he still retained control of most of Laconia, in particular the city of Lacedaemon (Sparta) and the baronies of Passavant (Passavas) and Geraki. This display of armed strength worried the Byzantine garrisons, and the local governor, Michael Kantakouzenos, sent to Emperor Michael to ask for aid.\nSources\nThe subsequent events, including the battle, are described only in the Greek and Aragonese versions of the Chronicle of the Morea; Byzantine sources (chiefly George Pachymeres) are mostly uninterested in events in the Morea and mention them cursorily, and of the Western historians, only the Venetian Marino Sanudo Torsello mentions a battle at \"Brenizza\", but conflates it with the Makryplagi campaign of the next year. Written by and for the Frankish nobility of the Morea, as a source it is very biased against the Byzantines, who are stereotypically \"depicted as effeminate, devious and cowardly\", while the Franks are portrayed as \"virtuous and almost suicidal in their courage\". This hostility is particularly pronounced in the Greek version, which along with the French one are the closest to the early 14th-century original text; the Aragonese version is more even-handed, although still biased. This bias, as well as outright errors and the huge discrepancy between the forces reported for the two sides have led scholars to challenge the veracity of the account, both in details and as a whole.\nByzantine landings and campaign in Laconia\nThis first major Byzantine expedition to the Morea is traditionally considered to have comprised two waves, one in autumn 1262 and one in the following spring. Michael VIII initially sent the parakoimomenos John Makrenos to the Morea with 1,500 Turkish mercenaries and about 2,000 Anatolian Greeks, as well as with grants of privileges for the local potentates of Laconia, with the names localeft blank for Makrenos to fill. Upon his landing, people from Tsakonia, the district of Kinsterna, and the Slavs of Mount Taygetos all flocked to enlist with the Byzantine commander. Makrenos reported back on the favourable conditions he found, and told Michael VIII that the entire peninsula was ripe for the taking with a few more men. The Emperor then sent his half-brother, the sebastokrator Constantine Palaiologos, at the head of a further 1,000 men, and with more money, to the Morea. As part of their treaty with Michael, and their traditional rivalry with the Venetians, the Genoese provided ships and crews to transport the Byzantines to the Morea, while the small Byzantine fleet was sent to harass the Latin island holdings in Euboea and the Cyclades.\nAfter arriving at Monemvasia, the sebastokrator Constantine proceeded to cement and expand imperial authority in Laconia: he erected a number of forts to keep the Slavs of Taygetos in check, and then laid siege to Lacedaemon, while the imperial fleet seized the southern coasts of Laconia. The Chronicle does not report on these events apart from the siege of Lacedaemon, but Pachymeres, Nikephoros Gregoras, and Sanudo record that \"daily clashes\" took place with the Franks, and that several strongholds fell to the imperial troops; these are not named, but must have included the castles of Passavant, Geraki, and Beaufort (Leuktron). By 1264, only Lacedaemon appears to have remained in Frankish hands in the region. In the meantime, William travelled to Corinth to request the assistance of the other Latin princes of Greece. They, however, proved unwilling to come to his aid, all the while many of William's Greek subjects openly sided with the Byzantines. Constantine Palaiologos saw this as an opportunity to conquer William's principality outright. Abandoning the fruitless siege of Lacedaemon, he marched his army up the rivers Eurotas and Alfeios towards the Achaean capital, Andravida, on the northwestern coast of the Morea.\nThe battle\nDuring William's absence, Andravida had been left in the charge of John of Katavas, a man known for his bravery but now old and suffering from gout. Although the general outline of the subsequent events is confirmed from the report of the Venetian historian Marino Sanudo, the only detailed account available is the narrative of the Chronicle of the Morea, whose accuracy has been questioned. According to the Chronicle, upon learning of the approach of the imperial army, Katavas took the 300 or 312 men available and marched out to meet the Byzantines, whose numbers are variously given in the Chronicle as fifteen, eighteen, or twenty thousand. It is certain that these figures are greatly inflated, and the Byzantine army must have numbered a few thousand at most. Either way, it considerably outnumbered the Latin force.\nThe Byzantines were confident of their own strength, and were reportedly dancing and singing. At a narrow defile at Prinitza (near Ancient Olympia), Katavas attacked the Byzantine army and inflicted a resounding defeat upon it: many Byzantine soldiers were killed, while the remainder scattered and sought refuge in the surrounding woods. The sebastokrator Constantine himself barely escaped with his life, and fled with the remainder of his troops to the safety of Mystras. Having won a major victory, Katavas prudently refused to pursue the Byzantines and returned to Andravida.\nAftermath\nConstantine Palaiologos regrouped his forces, and in the next year launched another campaign to conquer Achaea. His efforts, however, were thwarted, and the Turkish mercenaries, complaining of lack of pay, defected to the Achaeans. William II then attacked the weakened Byzantines and achieved a major victory at the Battle of Makryplagi. The two battles of Prinitza and Makryplagi thus put an end to Michael Palaiologos's efforts to recover the entirety of the Morea, and secured Latin rule over the Morea for over a generation.\nReferences\nSources\n*\n*\n*\n*\n*\n*"
    }
  ]
}