{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Cape Espichel (1180)\n\ntemplate -->\n| territory         =\n| result            = Portuguese victory\n| status            =\n| combatants_header =\n| combatant1        = Kingdom of Portugal\n| combatant2        = Almohad Caliphate\n| commander1        =  Fuas Roupinho\n| commander2        = Gamin ben Mardanis\n| strength1         = 20 galleysOther small transport ships\n| strength2         = Unknown\n| casualties1       = Unknown\n| casualties2       = Many vessels capturedMany dead\n| notes             =\n| campaignbox       =\n}}\nThe Battle of Cape Espichel took place on 29 July 1180 between the fleets of the Kingdom of Portugal and the Almohad Caliphate, off Cape Espichel, Atlantic Ocean, on the coast of Setúbal. The Portuguese left the battle victorious and it marked their first naval battle in history.\nBackground\nDue to the great maritime activity by the Almohads near the Portuguese coasts, King Afonso I of Portugal decides to create a powerful fleet, appointing Fuas Roupinho to be its admiral. At the time, Fuas was already a very respected Portuguese. In 1179, he was Mayor of Coimbra and was at the Castle of Leiria when he heard about the presence, of the Moorish King of Mérida, Gamir. He left the castle with his forces and attacked the Moors, who were defeated. He then went, with King Gamir and almost the entire Moorish army captive, to Coimbra, where he was received with triumphant acclamations.\nBattle\nThe Almohad fleet, led by Gamin ben Mardones, departed from Sevilla with the aim of attacking Lisbon once again. The Portuguese, after receiving news of the attack, quickly put together a powerful fleet to try to combat the Muslim threat.\nAfter some time, the two nations entered into direct combat. The Portuguese sailors were inexperienced, after all it was their first naval battle. However, their courage made up for the lack of experience and so they ended up managing to defeat the enemy, inflicting many losses, capturing several vessels and killing the Muslim commander.\nAftermath\nWith victory assured, the Portuguese chased the Almohads to Algarve and then to Ceuta, where Fuas Roupinho captured more vessels in the harbour, doing great damage.\nAfter these great victories, Fuas Roupinho tried again to attack Ceuta in 1182, but this attempt did not go well for the Portuguese, where they ended up losing their admiral in combat.\nSee also\n* Battle of Silves (1182)\n* Portuguese conquest of Ceuta\n* Reconquista\n* Moroccan–Portuguese conflicts\n* Siege of Lisbon\nReferences"
    }
  ]
}