{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Qurna__disambig_1\n\n| territory         = British capture of Qurna\n| result            = British-Indian victory\n| combatant1        =\n*\n*\n| combatant2        =\n| combatant3        =\n| commander1        =  Major General Charles Irwin Fry\n| commander2        =  Colonel Subhi Bey\n| commander3        =\n| strength1         = 2,100\n| strength2         = 1,000\n| strength3         =\n| casualties1       = 281\n| casualties2       = 1,000\n| casualties3       =\n| notes             = Approximate figures\n}}\nThe Battle of Qurna, (3 to 9 December 1914) was between British forces and  Ottoman forces that  had retreated from Basra, which they lost at the Battle of Basra (1914) during the Mesopotamian campaign of World War I.\nBackground\nBy capturing Basra, the British had taken an important communications and industrial centre. The Ottomans retreated up the Tigris River. The British needed to secure their position in Basra and the oil fields at Abadan.\nAfter the defeat at Basra, the Ottomans decided to take up a defensive position at the small town of Qurna to the north. Since both the Tigris and Euphrates join at Qurna, it made for an ideal position to make a stand, since the British would have to cross the two rivers.\"The Capture of Qurna, 1914\"[http://www.1914-1918.net/meso_bat2.htm The Capture of Qurna, 1914]   The Ottomans had about 1,000 men under the command of Colonel Subhi Bey, the Wali or Governor of Basra.  The British had about 2,100 under Major General Charles Irwin Fry.\nThe battle\nOn 3 December, the Ottomans were dug in at Qurna.  A British force of two Indian battalions; the 104th Wellesley's Rifles and the 110th Mahratta Light Infantry, and a double company of British soldiers from the Norfolk Regiment accompanied by several gunboats attacked them.  The Royal Navy vessels on the Euphrates kept the Ottomans under fire while British troops managed to cross the Tigris.\"The Capture of Qurna, 1914\">[http://www.1914-1918.net/meso_bat2.htm The Capture of Qurna, 1914]  The British and Indian troops advanced across open ground, but no crossing could be made across the river into Qurna itself.  The British force retired.  On the 6th, reinforced by the rest of the Norfolk Regiment, the 7th Rajputs and 120th Infantry and some mountain guns, they tried again.   The Ottomans had moved back into positions they had lost in the previous engagement, so the British and Indian troops had to re-take those positions.  Again they drove the Ottomans back, but could not cross the river into Qurna.  On the 8th, the 104th and 110th Infantry were sent up the Tigris to find a place to cross.  They did, and in doing so cut the Ottomans off from retreat to the north while the gunboats kept up an effective bombardment of their positions in the town.  The night of the 8th, an Ottoman steamer sailed down the river with lights and sirens blazing.  Lieutenant Commander Wilfrid Nunn of the British gunboat Espiegle took aboard three Ottoman officers.  The Ottomans wanted to surrender the town and march away.  Nunn, who was not in touch with Fry, insisted on unconditional surrender, which upset the Ottomans.  However, they eventually agreed.  On 9 December, the Ottoman commander, Colonel Subhi Bey, the Wali or Governor of Basra, surrendered his forces.  Going into captivity were 42 Ottoman officers and 989 soldiers.  The British/Indian losses were 27 soldiers killed and 242 wounded, and two sailors killed and 10 wounded.\nAftermath\nDespite being more of a skirmish than a battle, the Battle of Qurna is important because it gave the British a secure front line in Southern Mesopotamia.  Basra was secure, and the oil refineries at Abadan in Persia were safe.   However, the Ottomans would try again at Shaiba and the British would later launch an offensive to take Baghdad.\nSee also\n* Middle Eastern theatre of World War I\n* Technology during World War I\n* al-Qurnah\nReferences\nFurther reading\n*\n*\n*\nExternal links\n*[https://web.archive.org/web/20070811033821/http://www.1914-1918.net/meso_bat2.htm Further reading on the battle]\n*[http://www.firstworldwar.com/battles/qurna.htm As depicted at firstworldwar.com]"
    }
  ]
}