{
  "content": [
    {
      "type": "text",
      "text": "# Battle Lines (Star Trek: Deep Space Nine)\n\n| story = Hilary J. Bader\n| teleplay =\n* Richard Danus\n* Evan Carlos Somers\n| director = Paul Lynch\n| music = Dennis McCarthy\n| guests =\n* Camille Saviola as Kai Opaka\n* Paul Collins as Zlangco\n* Jonathan Banks as Shel-La\n| prev = Vortex\n| next = The Storyteller\n| episode_list = List of Star Trek: Deep Space Nine episodes\n| season_article = Star Trek: Deep Space Nine season 1\n}}\n\"Battle Lines\" is the 13th episode of the first season of the American science fiction television series Star Trek: Deep Space Nine.\nSet in the 24th century, the series follows the adventures on Deep Space Nine, a space station located adjacent to a wormhole between the Alpha and Gamma quadrants of the galaxy, near the planet Bajor; the Bajorans have recently liberated themselves from a decades-long occupation by the imperialistic Cardassians. In this episode, the spiritual leader of Bajor, Kai Opaka, is stranded on a world where the dead are resuscitated.\n\"Battle Lines\" aired on syndicated television the week of April 26, 1993.\nPlot\nKai Opaka, the spiritual leader of the Bajorans, requests a tour of Deep Space Nine from Commander Sisko. During the tour, she subtly asks him to take her through the wormhole. Against his better judgment he complies, and he, Dr. Bashir, Bajoran liaison officer Kira, and Opaka travel to the Gamma Quadrant. There they receive a distress signal from an unknown source. Opaka tells Sisko not to hold back on her account, so the group goes to investigate.\nThey find a moon with a network of satellites, one of which is malfunctioning. The runabout approaches the moon and one of the satellites attacks it, forcing them to crash-land. Opaka dies in the landing, which devastates Kira; however, her mourning is interrupted by a group of people called the Ennis, led by Golin Shel-la (Jonathan Banks).\nThe Ennis explain that they are at war with a group called the Nol-Ennis, who could attack at any minute. They take Sisko, Bashir, and Kira to a cave-like dwelling, and as predicted the Nol-Ennis attack within minutes. Many of the Ennis are killed fending off the attack, but after the battle, Kai Opaka enters the cave, resuscitated by some form of nanotechnology that pervades the moon. The same technology revives the Ennis and Nol-Ennis, but rather than a blessing it is a curse; both groups were sent to the moon as punishment for centuries of conflict, doomed to die over and over.\nAs Deep Space Nine officers Dax and O'Brien search for the group, Sisko gets the Ennis and Nol-Ennis to agree to meet in an effort to negotiate peace. Meanwhile, the conflict between the groups reminds Kira of her own trauma, which she discusses with Opaka: years of fighting the Cardassians on Bajor have taken their toll on her and she has known nothing but violence since she was a child. However, while Kira is reconciling her problems, the Ennis and Nol-Ennis refuse to fix theirs and resume fighting.\nThe groups are revived once more and return to their respective camps, but by this time Bashir has discovered that the technology prevents those it revives (including Opaka) from leaving the moon. O'Brien and Dax find Sisko, and Opaka informs him that she will stay with the Ennis and Nol-Ennis. She says it is time for them to begin their healing process just as Kira has begun hers. Meanwhile, the Ennis and Nol-Ennis resume fighting. Before O'Brien transports Sisko, Bashir, and Kira to the runabout, Opaka tells Sisko that her work is there now, but reassures him that their paths will cross again.\nReception\nIn 2013, Keith DeCandido gave the episode a rating of 6 out of 10 for Tor.com, writing that it was \"not a great episode by any means, but a pretty decent, if standard, science fiction story.\"\nZach Handlen of The A.V. Club called the episode frustrating and promising, but that it is \"filled with a lot of bland angry people, one that keeps hinting at more interesting directions, but never having the courage to follow them.\"\nSyFy recommended this as an essential episode to watch for an abridged Star Trek: Deep Space Nine binge.\nIn 2015, Den of Geek's David Burszan called the episode one of Jonathan Banks' 10 most geek-friendly roles for his portrayal of Ennis leader Golin Shel-la, writing: \"Apparently in the future, someone took that 'Send the mutants to the moon forever' protest sign from X-Men seriously, as the episode revealed that the two factions were sent there by their planet’s leaders because they couldn't stop fighting.\"\nHome video releases\n\"Battle Lines\" was released on LaserDisc on March 18, 1997. Published by Paramount Home Video and made by Pioneer USA, the double sided disc had runtime of 92 minutes and also included the following episode \"The Storyteller\".\nReferences\nExternal links\n*\n*\n*"
    }
  ]
}