{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Yongyu\n\n*\n*\n*\n|combatant2=\n|commander1= Frank S. Bowen   Basil A. Coad Charles H. Green\n|commander2= Unknown\n| units1= 187th Abn RCT   27th British Commonwealth Brigade\n* 1 ASHR\n* 1 MR\n* 3 RAR\n| units2= 239th Regiment\n| strength1=~3,000 men\n|strength2=~2,500 men\n|casualties1=  49 killed\n|casualties2=1,075 killed1,200+ captured\n|campaignbox=\n}}\nThe Battle of Yongyu (), also known as the Battle of the Apple Orchard or the Battle of Yongju by the Australians who fought in it, took place between 21 and 22 October 1950 during the United Nations Command (UNC) offensive into North Korea against the Korean People's Army (KPA) that had invaded South Korea during the Korean War. The battle was fought between the 3rd Battalion, Royal Australian Regiment (3 RAR) of the 27th British Commonwealth Brigade and the KPA 239th Regiment.\nOn 20 October, the US 187th Airborne Regimental Combat Team (187 RCT) staged a parachute assault at Sukchon and Sunchon, about  north of Pyongyang, with the objectives of cutting off KPA forces retreating ahead of the US Eighth Army general advance from the south, capturing important North Korean government officials evacuating Pyongyang, and liberating American prisoners of war (POWs) being moved out of Pyongyang. On 21 October, two 187th Airborne Infantry Regiment (187 ABN) combat teams started southwards in a reconnaissance-in-force to clear the Sukchon–Yongyu highway and rail line and to establish contact with the 27th British Commonwealth Brigade that was leading the Eighth Army advance northwards from Pyongyang. 187 ABN came under fire from the KPA 239th Regiment in the vicinity of Yongyu. As a result of the US airborne operation, the KPA 239th Regiment found itself caught between the Eighth Army advance and the 187 ABN attack in its rear. The KPA 239th Regiment attempted a breakout to the north just after midnight on 21–22 October. Facing determined attacks, the American paratroopers at Yongyu requested armoured assistance from the 27th British Commonwealth Brigade on the Pyongyang–Sukchon road just south of Yongyu.\nThe 27th British Commonwealth Brigade had departed from Pyongyang at noon on 21 October, headed north on the Sukchon highway, tasked with reaching the Chongchon River. The 1st Battalion, Argyll and Sutherland Highland Regiment (1 ASHR), leading the brigade advance, pushed up the highway until fired upon by KPA in the hills south of Yongyu. By nightfall, the hills were cleared by the Highlanders and the brigade halted for the night. The British could hear the sounds of a heavy battle taking place to the north. 3 RAR was directed to take the lead when the brigade moved out the following morning. C Company, 3 RAR, was selected to lead the Australian advance. C Company, with elements mounted on US tanks and the rest of the company following in motorised transport, was to pass through Yongyu as rapidly as possible and effect a relief of the 187 ABN defenders to the north. At first light on 22 October, 1 ASHR and the 1st Battalion, Middlesex Regiment (1 MR) advanced into Yongyu to clear the town of KPA. 3 RAR, with C Company on point, passed through 1 ASHR and 1 MR and moved through Yongyu, headed north on the Yongyu–Sukchon road.\nC Company, 3 RAR, came under fire from a KPA 239th Regiment rearguard force entrenched in a hillside apple orchard north of Yongyu and aggressively counterattacked off the line of march into the orchard, routing the KPA from the high ground. The KPA 239th Regiment, now on open ground between 3 RAR and 187 ABN, was forced to withdraw westwards with heavy casualties. 3 RAR then relieved the American paratroopers in their defensive positions. By midday, after three hours of fighting, the battle was mostly over. Many KPA soldiers who had been unable to escape hid or feigned death until captured or killed. With the linkup completed, the 27th British Commonwealth Brigade relieved 187 RCT at Sukchon and passed through for the continuation of its drive to the Chongchon River. The Australians had distinguished themselves in their first major battle in the Korean War, and the battalion was later praised for its performance.\nBackground\nOn 26 July, the Australian government announced that it would commit the under-strength and poorly equipped 3rd Battalion, Royal Australian Regiment (3 RAR) then in Japan to South Korea, following a period of preparation. Training and re-equipment began immediately, while hundreds of reinforcements were hastily recruited in Australia as part of K Force; they soon began arriving to fill out the battalion. The battalion's commanding officer, Lieutenant Colonel Floyd Walsh, was replaced by Lieutenant Colonel Charles Green. An officer with extensive operational experience fighting the Japanese in New Guinea during the Second World War, Green took over from Walsh due to the latter's perceived inexperience.\nOn 23 September, 3 RAR embarked for Korea, arriving at Pusan on 28 September. There it joined the British 27th Infantry Brigade, a garrison formation hurriedly committed from Hong Kong by the British as the situation deteriorated around the Pusan Perimeter in late August to bolster the US Eighth Army under the command of Lieutenant General Walton Walker. Commanded by Brigadier Basil Coad, the brigade was renamed the 27th British Commonwealth Brigade and consisted of the 1st Battalion, Argyll and Sutherland Highland Regiment (1 ASHR), the 1st Battalion, Middlesex Regiment (1 MR) and 3 RAR. The two understrength British battalions had each mustered just 600 men of all ranks, while the brigade was also short on transport and heavy equipment, and had no integral artillery or armour support, for which it would rely entirely on the Americans until the 16th Field Regiment, Royal New Zealand Artillery arrived in January 1951. As such, with a strength of nearly 1,000 men, the addition of 3 RAR gave the brigade increased tactical weight as well as expediently allowing the Australians to work within a familiar organisational environment, rather than being attached to a US formation. Also under the command of the brigade were a number of US Army units, including 155&nbsp;mm howitzers from the US 90th Field Artillery Battalion, M4 Sherman tanks from the US 89th Tank Battalion and a company of US combat engineers.\nPrelude\nOpposing forces\n, 1950]]\nBy the time 3 RAR arrived in the theatre, the North Koreans had been broken and were in rapid retreat, with General Douglas MacArthur's UNC forces conducting a successful amphibious assault at Inchon and breakout from the Pusan Perimeter on the southern tip of the Korean Peninsula. A steady advance began, driving the North Koreans northwards towards the 38th Parallel. The 27th British Commonwealth Brigade was airlifted from Taegu to Kimpo Airfield north of Seoul on 5 October. However, its vehicles had to move by road, driving  and did not arrive until 9 October. It was attached to the US 1st Cavalry Division under the command of Major General Hobart R. Gay. The brigade would function as a separate task force at a considerable distance from, and without physical contact with, that division or other friendly units. On 16 October, the brigade took over from the US 7th Cavalry Regiment as the vanguard of the UNC advance into North Korea, its axis intended to take it through Kaesong, Kumchon County and Hungsu-ri to Sariwon, then through Hwangju to Pyongyang. Although the North Koreans had suffered heavily in the preceding weeks, they continued to resist strongly, while a lack of accurate maps and the narrowness of the roads made rapid movement difficult for the advancing UNC forces. During this time, 3 RAR had a platoon of US M4 Sherman tanks attached and a battery of field guns in direct support.\nThe 27th British Commonwealth Brigade moved  from Kumchon, with the Argylls capturing Sariwon, an industrial town  south of Pyongyang, on 17 October. Supported by 3 RAR and US tanks, the Highlanders killed 215  KPA and took several thousand prisoners for the loss of one man killed and three wounded in a one-sided action. Prior to the attack, the Australians had moved through the town to establish a blocking position  to the north. During the evening, 3 RAR encountered a KPA force withdrawing north. Using the same road and moving in the same direction, the KPA mistook the Australians and Argylls for Russians in the poor light and were bluffed into surrendering, with the Australians capturing thousands of KPA and their weapons and equipment following a brief exchange. Mounted on a tank, the 3 RAR second-in-command, Major Ian Ferguson, captured over 1,600 KPA soldiers with just an interpreter. Australian involvement had been limited, however, and they regarded their first exposure to the fighting in Korea as a relatively minor incident. Pyongyang fell to US and South Korean troops on 19 October. On 21 October, the 27th British Commonwealth Brigade passed to the command of the US 24th Infantry Division under the overall command of Major General John H. Church, while the US 1st Cavalry Division remained in Pyongyang to complete its capture. Coad had hoped to rest his men at Pyongyang; however, the advance continued north with little respite and the brigade moved through the village of Samgapo. The British and Australians were ordered to seize Chongju.\nThe previous day, Colonel Frank S. Bowen's US 187th Airborne Regimental Combat Team (187 RCT) had parachuted into drop zones around Sukchon and Sunchon. 187 RCT was tasked with cutting off retreating KPA forces withdrawing up the west coast of the Korean Peninsula and releasing US and South Korean POWs. The 187th Airborne Infantry Regiment's 1st and 3rd Battalions (1/187 and 3/187 ABN) dropped southeast of Sukchon to seize the town, hold the high ground to the north and block the highway and rail line south of Sukchon, cutting off the main supply route and line of communication that led north from Pyongyang; the 2nd Battalion (2/187 ABN) was dropped near Sunchon,  east of Sukchon to seize the town, block another highway and rail line, and intercept a POW train that US intelligence indicated was moving northwards by night from Pyongyang. The US paratroopers were to hold their positions until relieved by the US Eighth Army push northwards to link up with them, a task that was expected to be completed within two days. After observing the airdrop, General MacArthur flew to Pyongyang where he announced to the press that the airborne operation was a brilliant tactical maneuver that seemed to have been a complete surprise to the North Koreans. Estimating that 30,000 KPA, perhaps half of those remaining in North Korea, had been caught between 187 RCT in the north and the US 1st Cavalry Division and ROK 1st Infantry Division to the south at Pyongyang, he predicted that they would soon be destroyed or captured. He termed the airdrop an “expert performance” and said, “This closes the trap on the enemy.” MacArthur's optimism would not be supported by events. Anxious not to expose the lightly armed and lightly equipped paratroopers by projecting them too far forward of the Eighth Army advance, MacArthur had kept them back too long. The operation came too late to intercept any significant KPA elements. By this time, most of the KPA remnants had already succeeded in withdrawing north, and had crossed safely behind the Chongchon River, or were in the process of doing so, while Premier Kim Il Sung's government and most important officials had moved to Kanggye in the mountains  southeast of Manpojin on the Yalu River. Through no fault of their own, the paratroopers were less successful on one other score, that of rescuing POWs who were being moved northwards from Pyongyang; most of the American POWs had been moved to more remote parts of North Korea and were unable to be rescued. Although sound in concept, the US airborne operation may have had more chance of success had a complete airborne division been employed.\nOnly the KPA 239th Regiment remained, having been ordered to delay the UNC forces as they attempted to follow up. With a strength of 2,500 men, the regiment occupied positions on the high ground astride the road and rail lines east of Yongyu,  south of the US drop zone at Sukchon.\nBattle\nKPA 239th Regiment is encircled, 21 October 1950\nThe most important action growing out of the 187 RCT airdrop occurred in the 3/187 ABN sector, about  south of Sukchon in the vicinity of Op'a-ri and Yongyu. At 02:30 on 21 October, K Company repulsed an attack on its Sukchon–Pyongyang highway roadblock by an estimated company-sized KPA force that attempted to break through to the north. At 09:00, the 3/187 ABN command post (CP) advanced two combat teams from the roadblock position in a reconnaissance-in-force to clear the Sukchon–Yongyu road towards Pyongyang and establish contact with the 27th British Commonwealth Brigade that was leading the 24th Infantry Division northwards from Pyongyang. I Company was assigned to clear the rail line and K Company was given the mission of clearing the highway. I Company reached Op'a-ri at 13:00, where it was attacked by an estimated battalion-strength KPA force equipped with heavy mortars and automatic antiaircraft guns. After a two-and-a-half-hour firefight, I Company, with two rifle platoons overrun by the KPA and 90 men missing, was forced to withdraw west of the rail line to Hill 281. Failing to exploit the advantage, the KPA withdrew to defensive positions on the high ground around Op'a-ri. Meanwhile, K Company, receiving harassing fire during its advance along the highway, proceeded to a point about  north of Yongyu, where it encountered a KPA force of about three companies. After a heavy firefight, the Americans forced the KPA to withdraw to defensive positions on the high ground to the south and east of the town. K Company continued into Yongyu, taking up defensive positions in the town and on Hill 163 to the north of the town.\nI and K Companies now occupied defensive positions roughly opposite each other—at Op'a-ri (Hill 281) overlooking the rail line and at Yongyu (Hill 163) overlooking the highway—yet these positions were now almost  apart and unable to mutually support each other. The distance separating the highway and the railway which ran north either side of Yongyu was greater at that point than anywhere else between Sukchon and Pyongyang. Extending on a southwest–northeast axis, and cutting across both the highway and rail line at Yongyu and Op'a-ri, is a line of high hills offering the best defensible ground between Pyongyang and the Chongchon River. Here, the KPA 239th Regiment had taken up defensive positions, deploying a battalion in each locality. The last organised KPA unit to leave Pyongyang, its mission was to fight a delaying action against the expected UNC advance from Pyongyang. Now, as a result of the unexpected US airborne operation, it was encircled and found itself attacked from two separate points in its rear. The KPA 239th Regiment, by this time convinced that both routes to the north had been blocked by the US airborne forces, would attempt one last push to regain contact with the other KPA forces that had infiltrated northwards.\nBritish and Australians advance to Yongyu, 21–22 October 1950\nIn the days prior, the US I Corps had continued its movement northwards as part of the general advance of the US Eighth Army. Following the capture of Pyongyang, the corps commander, Major General Frank W. Milburn, ordered the advance to continue to the MacArthur Line, running approximately  south of the Yalu River. The US 24th Infantry Division, to which the 27th British Commonwealth Brigade was now attached, was ordered to lead this attack. On the division's right flank three ROK divisions, the ROK 1st Infantry Division, under the US I Corps, and the ROK 6th and 8th Infantry Divisions under control of the ROK II Corps, were deployed to the east and would also be committed to the attack northwards. The British and Australians had covered  in the previous two days, advancing rapidly until slowed by rain. A Company, 3 RAR, was engaged by snipers from a nearby village without suffering casualties. The Sherman tanks proceeded to heavily engage the KPA positions in the village, which was then cleared by the Australian infantry who killed five KPA and took three prisoners. As the rain ceased a KPA T-34 tank, which had remained concealed during the earlier fighting, engaged D Company, 3 RAR, and was knocked out by the US tanks. An unmanned SU-76 self-propelled gun was also located nearby and neither it nor the tank were found to have any fuel.\nNow the vanguard of the Eighth Army, the British and Australians crossed the Taedong River using a sandbag bridge at Pyongyang at noon on 21 October, moving north on the main highway to Sukchon with the task of reaching the Chongchon River. Under the command of Lieutenant Colonel George Nielson, 1 ASHR pushed up the road until fired upon by KPA forces in the hills to the south of the town, with snipers engaging the column as it turned west out of the river valley around 16:00. Encountering only light resistance from a small KPA force of approximately 75 men which was then scattered by tank fire, the Argylls successfully cleared the foothills by last light on 21 October. Approaching Yongyu, Coad decided to halt for the night. The Argylls sent a patrol into the town, establishing initial contact with 3/187 ABN, marrying up with K Company which was established in a number of houses on the northern edge of Yongyu and on Hill 163 immediately above their position. A strong KPA force was believed to be nearby, with at least 300 men thought to remain in the town.\nKPA 239th Regiment breakout, 22 October 1950\nAt 00:15, the KPA 239th Regiment attempted a breakout to the north, launching multiple attacks against K Company, 187 ABN, at Yongyu. During the first attack, K Company's positions in the town and at its roadblock on the northern outskirts of town were assaulted by a large KPA force estimated at two battalions. Nearby, the British and Australians could hear the sounds of heavy fighting between the Americans and KPA  to the north. Half an hour later, a small KPA force attacked A Company, 1 ASHR, with grenades, killing two men and wounding two more before being repulsed, having suffered one killed and one wounded. Following two more KPA attacks, the Americans abandoned the roadblock after running out of ammunition and withdrew to 3/187 ABN's main defensive position  to the north. Detecting the withdrawal, the KPA attacked again at 04:00, leaving a small blocking force to hold the remnants of K Company in place in Yongyu, and concentrated the majority of its forces on the road to Sukchon. To the south, the British and Australians began to fear that the Americans had been overrun. A short time after the KPA 239th Regiment's main body passed through, the remaining elements withdrew from Yongyu and moved to join the main body. The KPA 239th Regiment moved north along the road, arriving at a point  south of the 3/187 ABN CP at around 05:00. The KPA stopped to reform, not realizing that 3/187 ABN's Headquarters and Headquarters Company (HHC) and L Company, 187 ABN were dug in along the road.\nAt 05:45, the KPA 239th Regiment started moving north again and ran blindly into 3/187 ABN's HHC and L Company's perimeter elements. They were immediately engaged with heavy losses, not only by direct fire from the HHC but also by enfilading fire from L Company. Stunned by the volume and severity of the fire, it took the KPA 239th Regiment about an hour to reorganize and deliver an attack. A group of about 300–350 KPA engaged L Company and attempted to flank and envelop its positions. Another group of about 450 KPA engaged the HHC. The KPA fire became exceedingly accurate as the firefight progressed. Hard-pressed, the 3/187 ABN CP radioed the 187 RCT CP at Sukchon describing the situation and requesting reinforcement. 187 RCT's request for armoured reinforcement was received by the 24th Infantry Division's headquarters in Pyongyang. Yet, with the US division still well to the rear, the Sherman tanks of the US 89th Tank Battalion encamped with the 27th British Commonwealth Brigade on the Pyongyang-Sukchon road just south of Yongyu was the closest formation, and they were ordered forward to assist 3/187 ABN.\nBy dawn, the North Koreans and Americans had fought each other to a standstill after heavy fighting overnight and the previous day; the KPA 239th Regiment was almost exhausted, yet, in danger of being destroyed, it prepared for a final attempt to break out.\nFighting in the apple orchard, 22 October 1950\nOvernight, Brigadier Coad had directed Lieutenant Colonel Green's 3 RAR to take the lead when the brigade moved out the following morning and Green decided to send Captain Archer P. Denness' C Company through Yongyu to advance as rapidly as possible to effect the relief of 3/187 ABN to the north.\nAt first light on 22 October, A and C Company, 1 ASHR, advanced into Yongyu to clear the town of any remaining KPA before the Australians passed through. Elsewhere, 1 MR took up defensive positions to the north of Yongyu. The Argylls moved through the town, using high-explosive and white phosphorus hand grenades to flush out the KPA, setting fire to many of the buildings. As planned, at 07:00, 3 RAR was ordered to move through Yongyu towards Sukchon to link up with 187 RCT and close the gap between the two forces. C Company, 3 RAR, passed through the burning town mounted on the Sherman tanks of D Company, US 89th Tank Battalion, and headed north on the Yongyu–Sukchon road.\nAt 09:00, the Australian column was stopped by small arms and light mortar fire from a hillside apple orchard about  north of Yongyu. Lieutenant Colonel Green, traveling with the 3 RAR headquarters group, proceeded forward to Captain Denness' location. C Company had driven into the rearguard of the KPA 239th Regiment as it was forming up for a final assault on 3/187 ABN. The strong KPA force of approximately 1,000 men allowed C Company, 3 RAR and the battalion's tactical headquarters group to pass before engaging them. Denness did not have a lot of information; there had been no contact with the Americans who were believed to be located nearby. The KPA-held apple orchard lay between the advancing Australians and the US paratroopers, blocking any relief attempt. Brigadier Coad's order citing the urgent need to link up with the Americans dictated Green's decision. Rather than preparing a deliberate attack and potentially allowing the KPA time to organise their defences, Green chose to force his leading company through at once in order to seize the initiative and continue the pursuit. An encounter battle developed as 3 RAR carried out an aggressive quick attack from the road, with US tanks in support.\nPreparing for the assault, Lieutenant Colonel Green informed brigade headquarters of his plans and was advised that 3/187 ABN was believed to be about  further north; however, as the exact location of the Americans was unclear, the indirect fire available to support the attack would be limited. The US tanks were also initially under orders not to fire for fear of hitting their own men. With mortars and artillery unavailable, the Australians proceeded to attack regardless, with the tanks carrying C Company turning east towards the KPA positions in the apple orchard. At 09:30, Captain Denness dismounted 7 and 8 Platoons and aggressively counterattacked off the line of march into the apple orchard, while 9 Platoon, commanded by Lieutenant David Butler, was left near the road to protect the Australian flank. Supported by the Sherman tanks' cannons and coaxial machine guns, the Australians charged the KPA positions with bayonets, Bren guns, Owen guns, Lee–Enfields, and hand grenades. In the face of this determined attack, many of the KPA left their pits in an attempt to move to safety, only to suffer heavy casualties after exposing themselves to the fire of the two assaulting platoons, the flanking platoon and the US tanks in support. The speed and ferocity of the attack surprised the defenders, and the Australians quickly overran the KPA outposts despite the lack of indirect fire. The KPA, many of whom were recently trained conscripts, were then forced to withdraw for the loss of only four Australians wounded. For his leadership in coordinating the assault, Denness was later awarded the Military Cross, while Private Charles McMurray received the Military Medal for bravery.\nMore than 70 KPA were killed in the initial attack, while a further eight or nine were killed as the Australians cleared the position, setting fire to the KPA dug-outs and forcing the remaining defenders to flee.  As the KPA broke, Lieutenant Colonel Green pushed A and B Company onto the higher ground to the right of C Company with the intention of clearing the ridge overlooking the highway, while D Company moved forward on the left of the road towards 9 Platoon. Meanwhile, the battalion tactical headquarters, which had followed closely behind C Company as they assaulted, came under attack in the apple orchard east of the road and was forced to fight off a group of KPA, with the regimental police and the battalion signallers fighting back-to-back to defend themselves. Withstanding the attack, the Australians eventually killed 34 KPA for the loss of three men wounded. Despite becoming personally involved in the heavy fighting, Green continued to skilfully control the battle throughout. D Company was ordered to clear the KPA threatening battalion headquarters, as well as sending a platoon forward to establish contact with the Americans. Running low on ammunition, 3/187 ABN had been in contact throughout the morning and continued to suffer casualties. However, having been forced off the high ground, the KPA were now caught between the advancing Australians and the US paratroopers to the north.\n{| class=\"toccolours\" style=\"float: right; margin-left: 1em; margin-right: 2em; font-size: 85%; background:whitesmoke; color:black; width:29em; max-width: 40%;\" cellspacing=\"5\"\n| style=\"text-align: left;\" |\"I saw a marvellous sight. An Australian platoon lined up in a paddy field and walked through it as though they were driving snipe. The soldiers, when they saw a pile of straw, kicked it and out would bolt a North Korean. Up with the rifle and down with a North Korean and the Australians thoroughly enjoyed it! They did that the whole day, and they were absolutely in their element.\"\n|-\n| style=\"text-align: left;\" |— Brigadier Basil Aubrey Coad\n|-\n| style=\"text-align: left;\" |\n|}\nUnable to move north, the KPA attempted to escape across the open rice fields to the west, through the gap between the 27th British Commonwealth Brigade and 3/187 ABN. The KPA again suffered heavy casualties, with many cut down by tank and rifle fire from C Company, 3 RAR. Some of the survivors took refuge among a number of haystacks and rice stooks in front of 9 Platoon, from where they engaged the Australians with sniper fire. Others fled east, escaping to the higher ground where they dispersed. D Company, 3 RAR, was ordered to clear pockets of resistance remaining within the battalion position. Meanwhile, 1 MR passed through the Australians and with the tanks linked up with 3/187 ABN at 11:00. Following three hours of fighting the battle was largely over by midday; however, many of the KPA that had been unable to escape continued to refuse to surrender, hiding or feigning death until individually flushed out. After clearing their objectives 7 and 8 Platoon had moved forward towards 9 Platoon, which then clashed with a number of KPA stragglers in the paddy fields. C Company, 3 RAR, deployed in an extended line and a substantial action soon developed. In a scene Coad later likened to driving snipe, the Australians proceeded to sweep the area, kicking over stacks of straw and shooting the KPA soldiers they found hiding in them as they attempted to flee. For his leadership, Lieutenant Butler was awarded the US Silver Star, while Private John Cousins received the US Bronze Star for his role in the action.\nAftermath\nCasualties\nDespite the uncertain situation and the lack of indirect support, Lieutenant Colonel Green's tactical handling of the Australian battalion had been bold, and his decision to move quickly through Yongyu and to attack off the line of march proved decisive. Preoccupied with fighting the Americans to their north, the KPA were unprepared for the Australians to attack from the rear. Caught between the US paratroopers and the 27th British Commonwealth Brigade, the KPA 239th Regiment was practically destroyed. KPA casualties in the apple orchard were 150 killed, 239 wounded and 200 captured, while Australian casualties numbered just seven men wounded. Including those engaged by the Argylls, total KPA losses during the fighting with the 27th British Commonwealth Brigade exceeded 200 killed and 500 captured. The survivors fled westwards. In their first major battle in Korea, the Australians had distinguished themselves, and the battalion was later praised for its performance. The action became known as the \"Battle of the Apple Orchard\", while the Royal Australian Regiment was later granted the battle honour \"Yongju\". Boosting their confidence, the success prepared the Australians for the battles which they were to face in the months that followed. Meanwhile, 3/187 ABN reported killing 805 KPA and capturing 681 in the fighting around Yongyu. Altogether, US casualties during the Sukchon-Sunchon operation were 48 killed in action and 80 wounded and a further one killed and 56 injured in the jump.\nThe Middlesex Battalion was ordered to push on to Sukchon, and after successfully relieving the Americans in place by nightfall, the battalion occupied a defensive position  north. The 27th British Commonwealth Brigade and US 24th Infantry Division continued their advance up the highway. Intending to defeat the KPA and bring the war to a close, the UNC forces pushed towards the Yalu River, on the Chinese border. However, resistance continued to be met as the 27th British Commonwealth Brigade crossed the Chongchon River, and they now moved towards Pakchon. On 24 October, General MacArthur had removed all restrictions on the movement of his forces south of the Yalu River and prepared for the final phase of the UNC advance, defying a directive of the US Joint Chiefs of Staff and risking Chinese intervention on behalf of North Korea. An intense period of fighting followed and the Australians were involved in a number of major battles over the coming days.\nSubsequent operations\nOn the afternoon of 25 October, a platoon from 3 RAR was fired on by two companies of KPA as they crossed the Taeryong River to conduct a reconnaissance of the west bank, and although they were forced to withdraw, the Australians took 10 prisoners with them. Acting as the forward elements of the brigade, that evening Lieutenant Colonel Green sent two companies across the river to establish defensive positions and they broke up a frontal assault on their positions with mortars while the KPA were in the process of forming up. Sixty KPA supported by a T-34 tank then attacked the forward Australian companies at Kujin early the following morning, resulting in Australian losses of eight killed and 22 wounded. However, the KPA suffered heavy casualties including over 100 killed and 350 captured, and the Australians succeeded in defending the bridgehead after the KPA withdrew. Intelligence indicated that the British and Australians were facing the KPA 17th Tank Brigade, which was preparing a last line of defence at Chongju,  away. With the war considered all but over, the 27th British Commonwealth Brigade continued to pursue the KPA towards Chongju; however, the advance increasingly encountered strong resistance as they approached the Manchurian border.\nNotes\nFootnotes\nCitations\nReferences\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\nFurther reading\n*\n*\n*\n*\n*\n*\nExternal links\n* [https://www.awm.gov.au/exhibitions/korea/operations/yongju/ Out in the Cold: Australia's involvement in the Korean War – Yongju/The Apple Orchard – 22 October 1950]"
    }
  ]
}