{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Maida__disambig_1\n\n| result            = British victory\n| combatant1        = United Kingdom\n| combatant2        = France\n| commander1        = John Stuart\n| commander2        = Jean Reynier\n| strength1         = >5,0005,236\n| strength2         = 5,0506,440\n| casualties1       = 45 killed  282 wounded\n| casualties2       = 490 killed  870 wounded  722 captured\n| campaignbox       =\n}}\nThe Battle of Maida, fought on 4 July 1806 was a battle between the British expeditionary force and a French force outside the town of Maida in Calabria, Italy during the Napoleonic Wars. John Stuart led 5,236 British troops to victory over about 5,400 troops under the command of French general Jean Reynier, inflicting significant losses while incurring relatively few casualties. Maida is located in the toe of Italy, about  west of Catanzaro. The Battle of Maida demonstrated the effectiveness of the double-line formation employed by J. Stuart against the triple line used by J. Reynier; two ranks in linear formation allowed the British to stretch a longer line, delivering a more powerful simultaneous volley.\nIn early 1806, the French invaded and overran the Kingdom of Naples, forcing King Ferdinand I of the Two Sicilies and his government to flee to Sicily. The Calabrians revolted against their new conquerors and Stuart's expeditionary force tried to exploit the unrest by raiding the coast. While ashore, the British encountered Reynier's division and the two sides engaged in battle. The 19th-century historians presented the action as a typical fight between French columns and British lines. This view of the battle has been called into doubt by at least one modern historian who argued that the French deployed into lines. Nobody questions the result which was a one-sided British victory.\nAfter the battle, Stuart captured some isolated garrisons in Calabria and was transported back to Sicily by the Royal Navy. Two weeks after the battle, the city of Gaeta fell to the French after a long siege. While Stuart succeeded in preventing a French invasion of Sicily and sustained the revolt in Calabria, he missed an opportunity to assist the defenders of Gaeta.\nBackground\nFollowing the decision by King Ferdinand to side with the Third Coalition against Napoleon I of France, French forces had invaded the Kingdom of Naples in the spring of 1806, after the British and Russian forces supposedly defending the kingdom evacuated Italy altogether: the British to Sicily and the Russians to Corfu. The Neapolitan-Sicilian army was crushed at the Battle of Campo Tenese, forcing Ferdinand to flee to Sicily and concede the Neapolitan crown to the French. Napoleon then installed his brother Joseph Bonaparte on the Neapolitan throne.\nBy July 1806, the French had crushed all Neapolitan resistance except for the uprising in Calabria and a garrison at Gaeta. There, André Masséna's force become embroiled in a lengthy siege. The British decided to organise an expedition into Calabria to further the insurrection against the French, and prevent any potential invasion of Sicily.\nBattle\nA British force of over 5,000 men commanded by Major-General John Stuart sailed from Messina on 27 June, landing in the Gulf of Sant'Eufemia three days later. At the same time a French force under the command of General Jean Reynier, the only French force in Calabria, moved to confront them. The exact size of the French force is unknown. Contemporary French sources range between 5,050 and 5,450. Some later historians have suggested a force as large as 6,400 but the most recent estimates are closer to 5,400.\nOn the morning of 4 July, Reynier broke camp and advanced toward level terrain along the shallow Lomato River. Believing his army superior in numbers, Stuart marched toward the same location nearly parallel to the French column. As both forces deployed from march column, they ended up in echelon formation. On the French side, the left flank was leading, while on the British side the right flank was leading. On the French left, General of Brigade Louis Fursy Henri Compère was echeloned forward, with the 1st Light Infantry Regiment on the left and the 42nd Line Infantry Regiment to its right. The center, commanded by General of Brigade Luigi Gaspare Peyri, included two battalions of Poles and the 4th battalion of the 1st Swiss Regiment. On the right flank, General of Brigade Antoine Digonet trailed the other two formations. Digonet's command comprised the 23rd Light Infantry and 9th Chasseurs à Cheval Regiments and the field guns. Opposing the French was Colonel James Kempt's Advanced Guard on the British right flank, echeloned forward. To Kempt's left rear was Colonel Wroth Palmer Acland's 2nd Brigade. Well to Acland's left rear marched Colonel John Oswald's 3rd Brigade, which formed the center. Colonel Lowry Cole's 1st Brigade deployed on the left flank with the artillery. Cole was closer to the French than Oswald. Off conducting diversionary actions was the 20th Foot, which would be late.\nOnly when the armies were nearly in contact did Stuart realize that he was outnumbered, but he allowed the battle to commence without changing any orders. Kempt detached the Royal Corsican Rangers and Royal Sicilian Volunteers as skirmishers. These got into a brawl with Compère's voltigeurs (light companies) and fell back. Kempt sent the flankers of the 35th Foot and the light company of the 20th Foot to help. Once the British troops halted the French skirmishers, they rejoined Kempt. At this time, Compère launched the 1st Light at Kempt, while the 42nd Line aimed to strike Acland. Since it had a head start, 1st Light's attack columns met Kempt's troops first. At 150 yards, the Advanced Guard fired its first volley but the 1st Light continued to advance. Kempt's second volley was fired at a range of 80 yards, wounding Compère, who nevertheless urged his men on. Though disordered by their losses, the French closed to 20 yards, where they absorbed a third volley. This fire completely broke up the 1st Light and its soldiers turned and fled. Compère, who literally rode into the British line, and others were captured in the brief melée that followed.\nAs the 1st Light's attack collapsed, Kempt's men charged their shaken enemies. As the French formation disintegrated, the Advanced Guard went out of control, chasing the fleeing French as far as Maida. Meanwhile, the 42nd advanced on Acland in two battalion columns. The British fired at a range of 300 yards and blazed away until the French attack ground to a halt. Aware that their neighboring regiment was fleeing from the battlefield, the 42nd also decamped. Seeing his left wing in rout, Reynier sent Peyri's brigade to face Acland. After a brisk action, the Poles were routed at bayonet point. The Swiss, however, maintained order and gave a good account of themselves. After Stuart sent reinforcements into the fight, the Swiss battalion fell back to join Digonet's brigade. Acland and Cole now advanced on Digonet and the Swiss. The 9th Chasseurs charged, forcing the British battalions to form square. Oswald's brigade appeared on the scene, but Digonet still held his ground, supported by the cavalry and the guns. Finally, the 20th Foot arrived from the coast and began firing at the exposed right flank of the 23rd Light. At this, Digonet and the Swiss began an orderly retreat and the battle was over.\nStuart's 5,196-man force suffered 45 killed and 282 wounded for a total of 327 casualties. Out of a total of 6,440 soldiers, Reynier lost 490 killed and 870 wounded. In addition, the British captured 722 French soldiers and four cannon. Another authority asserts that the French saved their guns. The 1st Light Infantry lost 50% of its strength between killed, wounded, and prisoners. The action involving the 1st Light Infantry lasted only fifteen minutes.\nAftermath\nStuart ordered Kempt's Advanced Guard to observe Reynier's withdrawal while he and Sidney Smith discussed future actions. On 6 July, they decided to move south and pick off Reynier's garrisons. That day, a half-battalion of the Polish-Italian Legion in the town of Vibo Valentia (Monteleone di Calabria) surrendered to Stuart. On 7 July, three more companies of Poles laid down their arms in Tropea when summoned by Captain Edward Fellowes in the frigate . Reggio Calabria surrendered on 9 July to Brigadier General Broderick with 1,200 British and Neapolitan troops. The allies were transported from Sicily in the frigate  under Captain William Hoste. On this occasion, 632 soldiers from the 1st Light and 42nd Line Infantry Regiments were captured.\nMarching south, Stuart reached Reggio on 23 July. Before returning to Sicily, he and Smith mopped up all of Reynier's garrisons in southern Calabria. On 24 July, the fortress of Scilla and 281 soldiers of the 23rd Light Infantry surrendered to Oswald. The British had one battalion each of the 10th Foot, 21st Foot, and Chasseurs Britanniques. The 3rd battalion of the Polish-Italian Legion, 500 strong, surrendered to Captain Hoste in the Amphion and the 78th Foot at Crotone on 28 July. Stuart received the Order of the Bath and an annuity of £1,000 a year from the British crown, and the title Count of Maida from King Ferdinand, for the victory.\nThe allies suffered a major setback on 18 July when the long Siege of Gaeta ended. After the French siege artillery breached Gaeta's walls, the Neapolitan garrison capitulated. By marching south, Stuart and Smith missed a chance to intervene in the siege or to land at Naples and attempt to overthrow Joseph's government. The surrender freed Masséna's force for operations in Calabria. In Stuart's defence, his expedition had successfully accomplished its main objective, which was to prevent any early invasion of Sicily. He also lengthened the revolt, which the French would not bring under control until 1807.\nThe political situation in southern Italy would remain unchanged until 1815, with the British and Sicilian troops guarding the Bourbon King Ferdinand in Sicily and the Napoleonic King of Naples controlling the mainland. The British failed to use their naval superiority around Italy and did little to harass the French on the mainland. In 1808, Joachim Murat became the King of Naples after Joseph Bonaparte was sent to govern Spain. Murat made various attempts to cross the Strait of Sicily, which all ended in failure, despite once managing to secure a foothold in Sicily. It was not until Austria defeated Murat in the Neapolitan War in 1815, that King Ferdinand was finally restored to the Neapolitan throne.\nLegacy\nMaida Hill and the suburbs of Maida Vale in London and Maida Vale in Perth, Western Australia, are all named after this battle.\nThe Royal Navy named the recently (in 1806) captured Jupiter HMS Maida.\nOrders of battle\n{| class=\"wikitable\"\n!British order of battle\n!French order of battle\n|-\n|valign=\"top\" style=\"width:50%\"|\nMajor General John Stuart (236 officers, 4,960 men)\n* Advance Guard: Colonel James Kempt (47 officers, 919 men)\n** Combined Light Infantry Battalion (25 officers, 510 men)\n*** Light companies of 20th, 1/27th, 1/35th, 1/58th, 1/61st, 1/81st and De Watteville's regiments\n** \"Flankers\" of 35th Foot (8 officers, 151 men)\n** Two companies of Royal Corsican Rangers, one company Royal Sicilian Volunteers (14 officers, 258 men)\n* 1st Brigade: Colonel Lowry Cole (48 officers, 1,218 men)\n** Combined Grenadier Battalion (21 officers, 464 men)\n*** Grenadier companies of 20th, 1/27th, 1/35th, 1/58th, 1/81st, and De Watteville's regiments\n** 1st Battalion, 27th (Inniskilling) Regiment of Foot (eight companies, 27 officers, 754 men)\n* 2nd Brigade: Colonel Wroth Palmer Acland (69 officers, 1,272 men)\n** 2nd Battalion, 78th (Highland) Regiment of Foot (\"Ross-shire Buffs\") (eight companies, 36 officers, 702 men)\n** 1st Battalion, 81st Regiment of Foot (Loyal Lincoln Volunteers) (eight companies, 33 officers, 570 men)\n* 3rd Brigade: Colonel John Oswald (49 officers, 1,151 men)\n** 1st Battalion, 58th (Rutlandshire) Regiment of Foot (eight companies, 22 officers, 554 men)\n** De Watteville's Regiment (four companies, 16 officers, 271 men)\n* Detached from 3rd Brigade\n** Battalion, 20th (East Devonshire) Regiment of Foot (eight companies, 27 officers, 597 men)\n* Artillery\n** Royal Horse Artillery: Three 6-pound guns (7 officers, 129 men)\n|valign=\"top\" style=\"width:50%\"|\nGénéral de Division Jean Reynier (6,029 men)\n* 1st Brigade: Général de Brigade Louis Fursy Henri Compère\n** Two Battalions, 1st Légère Regiment (1,810 men)\n** Battalion, 42nd Ligne Regiment (1,046 men)\n* 2nd Brigade: Général de Brigade Antoine Digonet\n** Two Battalions, 23rd Légère Regiment (1,266 men)\n** Four Squadrons, 9th Chasseurs à Cheval Regiment (328 men)\n* 3rd Brigade: Général de Brigade Luigi Gaspare Peyri\n** Two Battalions, 1st Regiment of Polish Infantry (937 men)\n** 4th Battalion, 1st Swiss Regiment (630 men)\n* Artillery (Four guns, 112 men)\n** 1st Horse Artillery: 3-pound guns\n** Foot Artillery: 6-pound guns\n|}\nHistorical reanalysis\nIt was traditionally thought that in the Battle of Maida the British deployed in a line while the French attacked in columns, allowing the British to fire full strength volleys into the French columns, while only the first two ranks of the French could fire, similar to Crossing the T in naval combat.  However, modern historians dispute this claim. The military historian James R. Arnold argues:\n:\"The writings of Sir Charles Oman and Sir John Fortescue dominated subsequent English-language Napoleonic history. Their views [that the French infantry used heavy columns to attack lines of infantry] became very much the received wisdom. ... By 1998 a new paradigm seemed to have set in with the publication of two books devoted to Napoleonic battle tactics.  Both claimed that the French fought in line at Maida and both fully explored French tactical variety. The 2002 publication of The Battle of Maida 1806: Fifteen Minutes of Glory, appeared to have brought the issue of column versus line to a satisfactory conclusion: \"The contemporary sources are...the best evidence and their conclusion is clear: General Compère's brigade formed into line to attack Kempt's Light Battalion.\" The decisive action at Maida took place in less than fifteen minutes. It had taken 72 years to rectify a great historian's error about what transpired during those minutes.\"\nThe British fired volleys then charged with the bayonet, and the French, failing to withstand the onslaught, broke and fled, suffering heavily in the rout.\nArnold was cruel, if not incompetent, in his criticism. The military historian Charles Oman said in his 1913 book:\n}}\nSee also\n* Maida (dog) – named after this battle\nReferences\nSources\n* War Monthly Issue 12\n*\n* [http://www.clash-of-steel.co.uk/pages/battle_details.php?battle=MAIDA01 Details of battle at Clash of Steel]\n* Schneid, Frederick C. ''Napoleon's Italian Campaigns: 1805–1815. Westport, Conn.: Praeger Publishers, 2002.\n* Smith, Digby. The Napoleonic Wars Data Book.'' London: Greenhill Books, 1998.\nExternal links\n*"
    }
  ]
}