{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Guruslău__disambig_1\n\n| map_type          =\n| latitude          =\n| longitude         =\n| map_size          =\n| map_caption       =\n| map_label         =\n| result            = Wallachian–Austrian victory\n| territory         = Transylvania is taken out from Ottoman suzerainty\n| status            =\n| combatant1        = WallachiaHabsburg MonarchyCossacks\n| combatant2        = Principality of Transylvania\n| combatant3        =\n| commander1        = Michael the Brave  Giorgio Basta\n| commander2        = Sigismund Báthory\n| commander3        =\n| strength1         = 20,000\n| strength2         = 40,00045 cannons\n| strength3         =\n| casualties1       = Unknown\n| casualties2       = 10,000, all cannons captured\n| casualties3       =\n| notes             =\n}}\nThe Battle of Guruslău or Battle of Goroszló  () was fought on 3 August 1601, between the troops of the Habsburg monarchy led by Giorgio Basta, the Cossacks and Wallachia led by Michael the Brave on one side, and the Transylvanian troops led by Sigismund Báthory on the other side. It was part of a series of military encounters between the Ottoman Empire and opposing European states during 1591–1606 (see also The Long War).\nBackground\nMichael asked for assistance from Emperor Rudolf II during a visit in Prague between 23 February and 5 March 1601. The visit was granted when the emperor heard that General Giorgio Basta had lost control of Transylvania to the Transylvanian Hungarian nobility led by Sigismund Báthory, who accepted Ottoman protection. Meanwhile, Wallachian forces loyal to Michael and led by his son, Nicolae Pătrașcu, drove out Simion Movilă from Moldavia and prepared to re-enter Transylvania.\nBattle\nThe battle was carried out by two armies, those of Michael the Brave (Wallachians and Cossacks) together with Giorgio Basta, on one side and those of Sigismund Báthory on the other side. The battle happened between 9 am and 7 pm on 3 August 1601. The Battle of Guruslău took place in the plain of the river Guruslău, a small right tributary of the Zalău.\nLegacy\nA monument was built to commemorate the victory of Michael the Brave.\nGallery\nFile: Guraslau-1601.jpg|\nFile: Guraslau1601.jpg|Michael and Basta defeating the Hungarian nobility of Transylvania\nImage:Hans von Aachen - Allegory of the Turkish war- Battle of Kronstadt (Braşov).jpg|Battle of Braşov (1603): Different flags captured by Giorgio Basta\nExternal links\n* [http://cat.inist.fr/?aModele=afficheN&cpsidt=14911501 The representation of Guruslau battle: 3 August 1601]\nNotes"
    }
  ]
}