{
  "content": [
    {
      "type": "text",
      "text": "# Battle pass__disambig_1\n\n, showing its original two-tier, multi-level reward system of Chapter 1 Season 8 (2019)]]\nIn the video game industry, a battle pass or rewards track is a type of monetization approach that provides additional content for a game usually through a tiered system, rewarding the player with in-game items for playing the game and completing specific challenges. Inspired by the season pass ticketing system and originating with Dota 2 in 2013, the battle pass model gained more use as an alternative to subscription fees and loot boxes beginning in the late 2010s. Battle passes tend to offer free passes, which are available to all users, and premium passes that require annual or seasonal charges in exchange for enhanced items and cosmetics.\nBattle passes may be given different terms depending on the game. For example, Rocket League and PlayerUnknown's Battlegrounds'' offer a \"Rocket Pass\" and \"Survivor Pass\" respectively.\nConcept and design\nA battle pass may be offered free to a player, or may require the player to purchase it through microtransactions. Once obtained, the battle pass presents the player with a number of reward tiers; by earning enough experience to complete the tier, the player gains the rewards offered at that tier. These rewards are typically cosmetic in nature, such as character and weapon customization options (also known as \"skins\"), emotes, and other non-gameplay affecting elements. More desirable rewards are provided at higher levels, which offer a way for players to show off these unique customization options to other players as a status symbol. Experience is gained through normal gameplay, and often through in-game challenges, while some games offer a way to accelerate progression through a battle pass by using microtransactions. In games that offer both free and paid-for battle passes, the free pass may have a very limited number of tiers or offer fewer or less-desirable rewards, but will track player's progression through the paid-for battle pass, allowing them to buy that battle pass at any time to collect the rewards.\nOther battle passes, such as in Helldivers 2, Call of Duty, or Marvel Rivals, use block sets of rewards instead of a direct linear progression. In these cases, a player earned some type of in game currency to unlock one of a page or subset of rewards on the pass; once all the rewards on that page have been earned, the player moves onto the next page, and may be given a bonus reward for completing the page. This approach gives the play some freedom in selecting the order of rewards they want.\nIn addition to monetization, the battle pass helps with player retention. The battle pass employs multiple psychological tricks in how it is made and presented to ensure its success. The first is the principle of progression or achievement, where unlocking each level of the battle pass feels like a success and the players can see how far away they are from each tier. Additionally, the quests that are used to unlock the battle pass are often simple things that the player might not realize they are doing, and once progress is made towards the goal, the player is incentivized to just complete the quest. Another psychological effect used is the fear of missing out (FOMO) generated by creating artificial scarcity. Each battle pass has rewards that can only be unlocked during that season of the battle pass before it is replaced by another battle pass, which makes players feel like they need to play in order to obtain those rewards. The sunk cost fallacy is also present in the battle pass system, where the players feel that in order to gain the most value from the time they have already spent, they need to complete the battle pass, even if their enjoyment of the game decreases over time.\nBattle passes and the rewards contained are only available for a limited time, most commonly a few months, after which a new season battle pass, with a new set of rewards, is available to be acquired. This approach follows the model of season passes used in other business areas. Most battle pass items are unobtainable after the season ends. To this end, a battle pass's progression towards rewards has to be balanced against expected gameplay time and what gameplay elements contribute towards this to avoid making the progression feel like grinding. For example, Halo Infinite multiplayer debuted with a battle pass that was criticized for being too slow in progression, which developer 343 Industries stated they would observe and balance in the future. In contrast, Helldivers 2, Halo Infinite and Marvel Rivals allow players to continue to work towards rewards on battle passes they have purchased, even beyond the bounds of the season that the pass was offered for.\nThere are various types of battle passes that differ from the common battle pass, which is defined by linear progression through a set of rewards made accessible by completing challenges. For example, some games may offer different tiers based on payment. For a greater price than the common battle pass, luxury passes offer additional rewards, such as exclusive cosmetics or extra premium currency, as seen in games like Apex Legends, Brawl Stars, Clash of Clans and Clash Royale. There are also passes that deviate from linear progression. Rather than earning experience points through challenges, players instead earn a special currency they can spend, such as Chrono-Tokens in Marvel Rivals and, formerly, Battle Stars in Fortnite Battle Royale. These currency-based battle passes have multi-leveled rewards where players progress through levels upon meeting spending requirements.\nHistory\nOne of the first known examples of a battle pass concept was seen in Valve's Dota 2 during an event that surrounded The International 2013, the annual e-sports tournament for the game. Called the \"Compendium\", it provided unique in-game content and other features for those players that purchased it, with 25% of all revenue made from it going towards the prize pool for the event. In 2016, Valve included the Compendium into the larger International Battle Pass, and later introduced a monthly form of one with their Dota Plus subscription feature in 2018. Valve also added \"campaign passes\" to Team Fortress 2 with special events in 2015. The campaign pass gave the player that purchased it a number of goals to complete during the event to receive unique customization options.\nThe popularity of these passes grew significantly in 2018 with the use in Epic Games' Fortnite Battle Royale. This game's success drew attention to its monetization strategies. As a free-to-play game, Fortnite adopted a \"season\"-driven release schedule with each season lasting about 10–20 weeks. During each season, a new set of cosmetic items and emotes were offered, while items from the previous pass becoming permanently unobtainable. The newly coined \"Battle Pass\" was added starting in its second season, during a time when the game was seeing a large growth in its player base and has been used by the game since. Battle passes are purchased through an in-game currency called V-Bucks, which either must be purchased with real-world funds via microtransactions, or earned via Fortnite: Save the World, as well as through the battle pass itself. Analyst Michael Pachter estimated that on the first day of the third season, in February 2018, Epic sold more than five million battle passes, generating over  in revenue in a single day. With expansion of Fortnite to mobile devices in March 2018, revenue estimates from the game were in the hundreds of millions of dollars per month in the following months, primarily from battle pass sales. Starting in mid-2024, Fortnite announced that all future battle pass cosmetics may return in the item shop 18 months after the pass expires.\nAt the same time as Fortnite was becoming a success, the video game industry had been dealing with the issue of loot boxes, another monetization scheme where players spend funds to open boxes containing a random assortment of in-game items. In the late 2010s, loot boxes faced scrutiny from several government-related groups, believing they encouraged gambling, particularly for young players. Battle passes were then seen as a preferable option to loot boxes, as players would be able to see all the rewards they could earn, even if they needed to spend a great deal of time completing all the tiers, assuring players continued to play the game. Further, by offering the means for players to buy into completing tiers, publishers could also see additional revenue.\nCoupled with the success of Fortnite battle pass approach and exhaustion over loot box controversies, other publishers started to evaluate battle pass use, with gaming journalists theorizing that games which formerly relied on loot boxes or worked as a service could begin to offer battle passes as a replacement. An increasing number of mobile games including but not limited to Call of Duty Mobile, PUBG Mobile, Clash Royale, Clash of Clans, and Brawl Stars have started using the battle pass system in their games. Some games, such as Super Animal Royale and Halo Infinite, use non-expiring battle passes, where old battle passes remain purchasable and usable even after their respective season ends, but only one pass may be enabled at a time. Deep Rock Galactic distributes items from seasonal passes into other cosmetic pools when the season concludes so that players are able to access cosmetics even after it has ended.\nThe game, Call of Duty: Modern Warfare, added a battle pass system similar to that of Fortnite when it was first released in October 2019; this system includes free and purchasable rewards. Players can earn rewards by simply playing the game after purchasing the premium battle pass. However, to ensure fairness of game play, players who purchase the premium battle pass do not have gameplay advantages over those who choose not to purchase it. Instead, the premium battle pass rewards players with cosmetic items that enhance the appearance of characters and weapons, as well as in-game currency called COD points, which can be used to purchase the next season's battle pass.\nIn Diablo IV, the battle pass offers 90 levels of items for players to unlock, including both free and premium rewards. However, there was some internal company debate as to whether there should be alternate forms of the battle pass system to elicit more player enthusiasm. Although Blizzard, the maker of Diablo IV, has not yet decided how to present the new battle pass system in Diablo IV, there is some indication that possible designs may be inspired from Call of Duty’s map battle pass that allows players to unlock the desired items first.\nThe game, Overwatch 2, introduced a new battle pass system in 2022. Unlike Overwatch where all new heroes are made available to players, in Overwatch 2, new heroes are awarded by the new battle pass system at level 55. In addition, heroes awarded by the battle pass do not have over-enhanced abilities that can result in unfair advantages.\nThe debut of Overwatch 2 battle pass system, replacing the previous loot box system, was criticized by players as Blizzard Entertainment stated that new playable heroes would be available through the free tiers of the battle pass, though could be obtained earlier by paying for the premium battle pass. Blizzard also confirmed that players who miss the free hero during one season would be able to obtain the hero by a free route in future seasons. This was in contrast to Overwatch where all players had access to new heroes for free once they were released. Players considered this change a pay to win approach by Blizzard as well as forcing players to grind to get access to new heroes.\nCriticism\nThe battle pass design has been criticized for being predatory by nature; players are forced to either spend extra money to skip tiers or put in long hours of playtime because many of the most desirable rewards are at the end of the pass. Nearly all battle passes exploit the fear of missing out by making the cosmetics in the battle pass solely obtainable through its purchase and completion. These cosmetics often never return for purchase, making some become extremely coveted by a significant portion of the playerbase.\nSome complaints about the battle pass include the degradation of game quality. Particularly for multiplayer games, rather than playing the game to win, players will play only to complete challenges that progress their battle pass.\nReception\nEver since its introduction in Dota 2, the battle pass has been associated with free to play games like Valorant and Fortnite Battle Royale. Some free to play titles such as Multiversus, League of Legends, and Apex Legends lock characters behind a pay or grind wall while claiming to be competitive, something that some people are against on principle. Locking characters in the battle pass, especially with a paid option that automatically unlocks the character, can cause contention between the game developers and the players. If the character is overpowered, players will accuse the game developers of purposely making the character strong to incentivize the purchase of the battle pass. Alternatively, if the character is underpowered, then the players who paid for the pass or spent a lot of time grinding will feel like they are not being adequately rewarded. Additionally, any quick nerfs made to the character in order to adjust the balance of the game will make those who unlocked the character feel like they are being cheated.\nSome games, such as Diablo IV and Call of Duty: Modern Warfare have decided to release a battle pass that only contains cosmetic items rather than game essentials. Additionally, to combat criticism from their previous titles, the Diablo IV developers have said they will interact continuously with players for feedback on their shop and battle pass.\nReferences"
    }
  ]
}