{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Miahuatlán__disambig_1\n\n|result      =Republican victory\n|combatant1  = Mexican republicans\n|combatant2  =\n|commander1  =Porfirio Díaz\n|commander2  =Carlos Oronoz\n|units1      =\n|units2      =\n|strength1   =880\n|strength2   =1,400\n|casualties1 =59 killed14 wounded\n|casualties2 =70 killed400 captured2 guns captured\n|notes       =\n|campaignbox =\n}}\nThe Battle of Miahuatlán took place on 3 October 1866 in the vicinity of the current municipality of Miahuatlán de Porfirio Díaz in the state of Oaxaca, Mexico. It was fought between elements of the Mexican republican army under General Porfirio Díaz and troops of the Second Mexican Empire during the Second French intervention in Mexico.\nThe Imperial troops were defeated, opening the way for Díaz to advance on the city of Oaxaca.\nBackground\nNapoleon III, announced his plans on withdrawing his troops from the Second French Intervention in Mexico in January 1866, and the Second Mexican Empire he had set up began to collapse in the wake of the French withdrawal. At the time of the Battle of Miahuatlán, General Porfirio Díaz had escaped French captivity and was advancing from the south towards the city of Oaxaca, his hometown, and former headquarters .\nBattle\nDíaz's forces at Miahuatlán were almost out of food and ammunition, drenched by rain and demoralized.\nHe took a defensive position facing northwest, where he was found and attacked by 1,100 Imperial troops under General Carlos Oronoz assisted by a French officer, Enrique Testard. The attackers bombarded the republican positions from long range, then closed in on them with a skirmishing line followed by three columns. Díaz skillfully held off the attackers, then sent his cavalry across the Miahuatlán river to unexpectedly attack the right rear of the Imperial troops. Facing certain defeat, General Oronoz fled the battle. His forces lost 70 dead and 400 prisoners, against Republican losses of 59 killed and 14 wounded.\nThe victory was due to Díaz's imaginative use of terrain and deception. He placed riflemen in the Nogales Ravine, and a group of armed peasants in a maguey field opposite them, hidden from view. Díaz then made himself conspicuous on the crest of a hill behind them. His cavalry retreated towards Díaz pursued by the imperial forces, who were caught in a lethal cross-fire from the concealed republican troops.\nWhile Díaz launched a frontal assault led by Manuel González (later to become President of the Republic) on the imperial forces, the surprise cavalry attack from rear decided the day.\nAftermath\nAs a result of the battle, Díaz's forces were replenished with about 1,000 captured rifles, two field pieces and over 50 mules loaded with ammunition. He was able to continue his advance with little opposition, reaching Oaxaca on 8 October 1866.\nIn his memoirs, Díaz described the battle as the most strategic and brilliantly fought action during the Second French intervention in Mexico. This victory, and that of the Battle of La Carbonera, gave Díaz national fame and would solidify him as a hero of the war for many decades.\nSee also\n*List of battles of the French intervention in Mexico\nReferences"
    }
  ]
}