{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Talahandak (2015)\n\nMNLA CMA (ambush only)\n| combatant2        =  Ansar Dine\n| commander1        = Trois-Trois\n| commander2        = Unknown\n| casualties1       = 15–21 killed (per UN and CMA)20 prisoners (per Ansar Dine)\n| casualties2       = 15 killed\n}}\nBetween December 24–25, 2015, Ansar Dine militants attacked National Movement for the Liberation of Azawad (MNLA) positions in Talahandak, Mali. Ansar Dine captured the MNLA outpost, and then ambushed CMA reinforcements.\nBackground\nIn 2012, the MNLA rebelled against the Malian government in favor of Tuareg independence. This rebellion was hijacked by jihadist organizations like Ansar Dine shortly afterward, sparking a conflict between the MNLA and jihadist groups. In 2014, Sidi Mohamed Ag Said, also known as Trois-Trois, was the head of an anti-jihadist faction of the MNLA that consisted of about 250 men. Trois-Trois was put under the command of Mohamed Ag Najem, the head of the MNLA military, and Trois-Trois conducted anti-jihadist activities around Abeïbara, Tessalit, Aguelhok, and Boghassa. In these areas, Trois-Trois claimed the assassinations of fourteen to sixteen of Ansar Dine's hisba, or Islamic police, and sixty motorcycles between 2014 and 2016. Trois-Trois and his contingent garnered attention from Ansar Dine militants in those areas, which had around 250-300 men.\nA skirmish in Aguelhok in January 2014 were the first major hostilities between Trois-Trois and Ansar Dine. Four jihadist minelayers were captured by MNLA and handed over to Chadian MINUSMA troops. Trois-Trois promised \"to destroy the terrorists who kill our populations and illegally occupy our lands\", leading Ansar Dine leader Iyad Ag Ghaly to put a bounty on him. This dispute was eventually settled between Ghaly and MNLA commander Bilal Ag Acherif.\nHowever, Trois-Trois continued anti-jihadist operations in northern Kidal region afterwards. On December 19, 2015, an MNLA raid led by him near Boghassa intercepted a group of eight men on motorcycles. Four jihadists were killed in the ensuing shootout, and four others were taken prisoner by the MNLA.\nBattle\nOn the morning of December 24, 2015, Ansar Dine forces attacked an MNLA outpost in the town of Talahandak, on the Malian-Algerian border. Ambery Ag Rhissa, a member of the CMA, stated that the jihadists launched the assault with fifteen armed pickups, and entered the village by disguising themselves with the population. The attack was carried out in retaliation for the Boghassa skirmish. After three hours of fighting, MNLA forces retreated. The house of the MNLA commander was torched, and nearby businesses were destroyed as well.\nAnsar Dine forces held the outpost for a few hours, and then retreated. The MNLA fighters returned to the village in the evening. The Coordination of Azawad Movements sent reinforcements to Talahandak, but they were ambushed by Ansar Dine.\nAftermath\nThe MNLA announced in a December 25 press release that six fighters were killed, several injured, and two vehicles destroyed. They stated that they did not know how many jihadist casualties there were, although that there were casualties. The next day, Sidi Ould Ibrahim Sidat, the leader of the CMA and Arab Movement of Azawad, claimed that four CMA fighters were killed in the ambush against CMA reinforcements. In its March 2016 report, the United Nations assessed the deaths of fifteen MNLA fighters in Talahandak, and eleven injuries.\nAnsar Dine claimed responsibility for the attack on December 26, stating it carried out the attack against a barracks commanded by Trois-Trois. The group claimed eleven \"agents of France\" were killed in the attack, and that \"mujahideen prisoners\" were freed. Baba Ahmed, a journalist at Jeune Afrique, stated that twenty-one MNLA fighters were killed in Talahandak and the ambush, and twenty men were captured. A brother of Trois-Trois and a brother of Ag Acherif were among the dead.\nVideography\n* [https://archive.org/stream/Mali_Azawad/format=MPEG4 Ansar Dine video of the Talahandak attack]\n* [https://www.longwarjournal.org/archives/2016/01/ansar-dine-highlights-attack-on-tuareg-separatists-in-mali.php Screenshots from the attack published by Ansar Dine]\nReferences"
    }
  ]
}