{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Nesbit Moor (1355)\n\nBaron Dacre\n| strength1         =\n| strength2         =\n| casualties1       = Low\n| casualties2       = High|\n}}\nThe Battle of Nesbit Moor was an engagement fought in August 1355 between forces of the Kingdom of Scotland and the Kingdom of England.\nBackground\nHostilities broke out in early 1355, following the end of a truce, and the breakdown of negotiations for the release of David II from English captivity. Immediately after the end of the truce, the English raided Scotland and burnt the lands of Patrick V, Earl of March.\nRaid at Norham\nThe Earl of March in retaliation, with William, Lord of Douglas, with their contingents, supplemented by a force of sixty French knights marched to the Merse in August. Douglas sent Sir William Ramsay of Dalhousie, and a force of men to despoliate and raid the country around Norham Castle, captained by Sir Thomas Grey. Douglas' ploy was to encourage Grey into an ambush.\nRamsay called on Grey and his garrison to come out of the castle and fight them. Grey, suspicious of other marauding Scots forces, sent scouts to look for evidence of them, but kept behind the stout walls of the castle. Ramsay's men burnt the village, and drove off the chattels and beasts. The scouts returned with nothing to report. Incensed at Ramsay's depredations, Grey and Lord Dacre led a force of men-at-arms to pursue the Scots and recover the stolen gear and livestock.\nBattle\nMarch and Douglas meanwhile had hidden in woods to the south of Duns. Ramsay abandoned the livestock and rode north to lure Grey into the ambush. Grey left the cattle to be collected later, pursued Ramsay, and led his men directly into the trap. Douglas and March's main force then cut off any chance of Grey's retreat by moving between them and the border. As soon as Grey saw the banners of March and Douglas battle was joined.  The Englishmen rushed the Scots, but soon the superior Scottish numbers began to tell. The Scots won the day and took many prisoners, including Dacre, Grey, and his newly knighted son Sir Thomas Grey, and losing very few of their own, excepting John Haliburton of Dirleton.\nAftermath\nThe important English prisoners were taken away into captivity. Most of the common soldiers were bought by one of the French knights, who had them massacred in revenge for the earlier death of his father at English hands. This incident gave rise to a local landmark known as \"Slaughter Hill\". The garrison at Berwick, on hearing of the fight, marched on Norham, expecting it to be under siege. March, Douglas, and Thomas Stewart, 2nd Earl of Angus, aided by the French knights, counter-attacked and captured Berwick. Unable to take the Castle, March ordered Berwick set ablaze. The Scots retreated following news of a large army advancing under Edward III of England, who then proceeded into Scotland and laid waste to Lothian, killing and burning as he went, in an episode that would be remembered as the Burnt Candlemas.\nReferences\nNotes\nSources\n*Fordun, John of, Chronica Gentis Scotorum, ed. Skene. Edinburgh 1872. [https://archive.org/stream/johannisdefordun02ford#page/n3/mode/2up]\n*Fraser, Sir William, The Douglas Book IV vols. Edinburgh 1885. [https://archive.org/stream/douglasbook01fras#page/n5/mode/2up]\n*Maxwell, Sir Herbert. A History of the House of Douglas II. Freemantle. London, 1902"
    }
  ]
}