{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Khorramshahr (1982)\n\n)\n| place             = Khorramshahr, Khuzestan, Iran\n| territory         = Iran retakes the southwestern port city of Khorramshahr and pushes Iraqi forces back to the international border\n| result            = Iranian victory\n| combatant1        =  Iraq\n}}\n| combatant2        =\n}}\n| commander1        =  Ahmad Zeidan\n*  Salah al-Qadhi\n*  Juwad Shitnah\n*  Muhsin Abd al-Jalil\n*  Ali Hassan al-Majid\n}}\n| commander2        =  Ali Sayad Shirazi\n*  Ahmad Motavaselian\n*  Hooshang Samadi\n*  Mohsen Rezaee\n}}\n| strength1         = 80,000 troops100 tanks\n| strength2         = 100,000 troops400 tanks\n| casualties1       = 8,000 killed\n15,000 wounded\n19,000 captured\n----\n250 tanks, 300 APCs, 100 artillery pieces destroyed or captured (In all sectors)\n| casualties2       = 12,000–15,000 killed\n25,000 wounded\n----\n400 tanks destroyed (In all sectors)\n| notes             =\n| coordinates       =\n| map_type          = Iran\n| map_size          = 250px\n| map_mark          = red_pog.svg\n| map_label         = Khorramshahr\n| map_caption       = Location of Khorramshahr within Iran\n}}\nThe Second Battle of Khorramshahr, also known in Iran as the Liberation of Khorramshahr''' () was the Iranian recapture of the city of Khorramshahr on 24 May 1982, during the Iran–Iraq War. The city had been captured by the Iraqis earlier in the war, on 26 October 1980, shortly after the Iraqi invasion of Iran. The successful retaking of the city was part of Iran's Operation Beit ol-Moqaddas. It is perceived as a turning point in the war; and the liberation of the city is annually celebrated in Iran on 24 May.\nBattle\nFollowing its capture, the Iranian city of Khorramshahr remained under Iraqi control until April 1982, when the Iranians launched Operation Beit ol-Moqaddas to recapture the province of Khuzestan. The initial phase of the operation took place from 24 April to 12 May 1982 and consisted of approximately 70,000 Iranian Army troops and Revolutionary Guards, who succeeded in pushing the Iraqi forces out of the Ahvaz–Susangerd area while sustaining heavy casualties. The Iraqis withdrew to Khorramshahr and, on 20 May, launched a vigorous but unsuccessful counterattack against the Iranians. Iran then launched an all-out assault on Khorramshahr and overran two Iraqi defensive lines in the Pol-e Now and Shalamcheh region. The Iranians concentrated near the Shatt al-Arab (known as the Arvand Rud in Iran) waterway, besieged Khorramshahr, and recaptured the city on 24 May 1982, after two days of intense and bloody fighting.\nThe mobile bridge constructed by the Iraqi army, connecting the islands of Bowarin and Umm Rasas, to the southern shore of the Arvand River, was rendered inoperable by the fighters of the Islamic Republic of Iran. Consequently, the Iraqi forces were unable to utilize it. The Iraqi soldiers, faced with the obstruction on the Shalamcheh road, were mentally shaken, causing them to surrender.\nAftermath and legacy\nIn retaking Khorramshahr, the Iranians captured approximately 19,000 soldiers from a now-demoralized Iraqi Army. Saddam Hussein was shocked and infuriated by the defeat and by the fact that the Iranians had pushed on despite sustaining heavy casualties. The Iranians had even committed their reserves in order to keep on driving back the Iraqis. After the defeat, Saddam Hussein executed several of his top generals, such as the commander of the 9th Armoured Division.\nCalls for a United Nations-mandated ceasefire in the Iran–Iraq War were made three days after the liberation of Khorramshahr, and officials of both countries began discussing such a possibility.\nThe anniversary of the liberation of Khorramshahr is annually observed in Iran on 24 May.\nSevom Khordad, an Iranian air defence system, is named after the battle.\n}}\nIn popular culture\nThe liberation of Khorramshahr is the subject of a number of wartime films, such as 1982's Another Growth by Homayun Purmand, the Pasdaran Army (Revolutionary Guard) Television Unit's 1983 documentary Recapturing Khorramshahr, and Kiumarth Monazzah's Forty Witnesses – The Second Narrative: Liberation of Khorramshahr (1983).\nA popular sad Persian song, \"Mammad Naboodi\" (, meaning \"Mammad [colloquial variant of Mohammad], you were not there [to see the city liberated]\"), by Gholam Koveitipoor, is about Mohammad Jahanara, the Revolutionary Guard commander who was one of the last few Iranians to leave Khorramshahr when it fell to the Iraqis. He subsequently fought in the Siege of Abadan and lead Iranian forces to recapture Khorramshahr; but he died on 24 May, in a plane crash, before the liberation of the city.\nGallery\n}}\nFile:Liberation of Khorramshahr (Operation Beit al-Moqaddas) (045).jpg|Iranians celebrating the liberation of Khorramshahr\nFile:Liberation of Khorramshahr (Operation Beit al-Moqaddas) (118).jpg|Khorramshahr Grand Mosque after the liberation by Iranian forces\nFile:Liberation of Khorramshahr - May 1982 (3).jpg|Iranian forces celebrate after liberating Khorramshahr\nFile:Liberation of Khorramshahr - May 1982.jpg|Iranian people commemorating the retaking of Khorramshahr\nSee also\n* Karun River\n* Chess with the Doomsday Machine\n* Eternal Fragrance\n* Noureddin, Son of Iran\n* ''One Woman's War: Da (Mother)''\n* Liberation of Susangerd\n* History of Khuzestan province\n* Abadan building collapse\n* 2005–06 Ahvaz bombings\n* Al-Ahwaz theater (Zanj Rebellion)\n* Apollodorus of Susiana\n* Battle of the Uxian Defile\n* Battle of Ulai\n* Operation Beit ol-Moqaddas\n* Operation Cedar\n* Cinema Rex fire\nReferences\nExternal links\n* [https://www.youtube.com/watch?v=tfJPS6aeUXA Khorramshahr Battle Continues (Video)]\n* [https://www.britannica.com/place/Khorramshahr Khorramshahr: Persian Gulf, Oil City, Battle of 1982]\n* [https://en.mehrnews.com/news/232180/Iran-marks-anniversary-of-Epic-of-Khorramshahr Iran marks anniversary of Epic of Khorramshahr]\n* [https://www.youtube.com/watch?v=ActjXHxExNk The Epic of Khorramshahr - Iran '82]"
    }
  ]
}