{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Saint-Omer\n\ntemplate -->\n| result            = French victory\n| combatant1        = Kingdom of France\n| combatant2        = County of FlandersKingdom of England\n| commander1        = Eudes IV of BurgundyJean I of Armagnac\n| commander2        = Robert III of Artois\n| strength1         = 3,000 (mostly mounted men-at-arms)\n| strength2         = 11,000–16,000 men\n*10,000–15,000 Flemings\n*1,000 English archers\n*Unknown number of English men-at-arms\n| casualties1       = Light\n| casualties2       = *8,000 dead\n*Unknown wounded\n}}\nThe Battle of Saint-Omer, fought on 26 July 1340, was a major engagement in the early stages of the Hundred Years' War, during Edward III's 1340 summer campaign against France launched from Flanders. The campaign was initiated in the aftermath of the English naval victory at the Battle of Sluys but was far less successful than Edward had hoped. At Saint-Omer, the heavily-outnumbered French men-at-arms, tasked with defending the city and awaiting reinforcements, unexpectedly defeated the Anglo-Flemish forces on their own. The allies suffered heavy losses and the French captured their camp intact, taking many warhorses, draft animals and carts, all the tents, huge quantities of supplies and most of the Flemish standards. Edward's campaign of 1340 had begun badly. On the bright side, the loss of several thousand men was bearable, as the survivors, which included most of the precious English longbowmen, eventually rejoined him at Tournai. The defeat had serious strategic consequences. It exposed southern Flanders to the wrath of Philip VI and enabled the French to concentrate their forces against the main army of the coalition in the siege of Tournai.\nFrench border in 1340\nBy 1340, Flanders had reluctantly been under French suzerainty for centuries and frequent uprisings and wars of independence between the two nations had studded the Middle Ages. In the late 1330s, Flanders again struck out for self-determination; Louis I of Flanders, who had abandoned his father's anti-French policies, was overthrown in a bloody coup and fled to France. Jacob van Artevelde gained control of this insurrection and became as captain general of Ghent, Flanders' semi-dictatorial ruler. Edward III, seeking allies for his war against France, made an alliance with Artevelde and promised to fund his government and supply the wool vital for the Flemish economy provided the Flemish supported his operations and allowed Flanders to be used as a staging point for an invasion of France.\nArtevelde agreed, but was secretly unwilling to commit all his resources to this war and also was not fully in control of the mercantile city states which emerged in the semi-independent region. Thus when Edward demanded 150,000 Flemish troops to be awaiting his arrival in 1340, he was somewhat surprised to discover on arrival that barely a fraction of this number had gathered. On Edward's passage he had won the great naval victory at Sluys and buoyed by this success was determined to press his advantage on land too. He ordered Robert III of Artois, an old pretender to the title of Count of Artois to take 1,000 English archers and  10,000 to 15,000 Flemish troops which had gathered in Artois to conduct a chevauchée in the region, attempting to provoke the French into action and perhaps to capture an important fortified town such as Saint-Omer. Meanwhile, Edward remained in Flanders to raise another army in order to besiege Tournai.\nThe French were well aware of Edward's preparations and began strengthening their forts and positions in Northern France. By July, King Philip VI had an army of 24,000 men gathered in the region and formidable defensive arrangements were set up. Along the marches of Flanders and Hainaut, strong garrisons were placed. In addition, Eudes IV, Duke of Burgundy, in his capacity as ruler of Artois maintained garrisons of his own in the western and coastal sector of the frontier\nRobert's campaign\nThe French had not expected an attack on Saint-Omer but the lumbering progress of Edward III's preparations gave them plenty of warning of what was afoot. On 13 July, Philip dispatched a force of several thousand men-at-arms to Saint-Omer under Eudes of Burgundy, who began the work of demolishing the suburbs. Robert was still 15 miles away haggling with his own troops. Contrary to the belief of Robert of Artois, there were no pro-Flemish supporters in the town and Robert's plan of simply marching up to the gates and being admitted in was thus impossible. Nevertheless, he continued to close on the town and on the 25th of July razed the neighbouring town of Arques to the ground before spreading out across the eastern fringes of Saint-Omer.\nBehind Robert, Philip VI's army was making swift progress towards his position and it became immediately obvious to the Anglo-Flemish commanders that there was no time for a siege and that in just a few days their army would be crushed between the French Royal army and the garrison of Saint-Omer. Aware that he might be forced to withdraw, Robert drew his forces up in front of Saint-Omer offering the garrison the chance of battle. Robert placed the cream of his troops in the front line: the English men-at-arms and longbowmen and the troops of Bruges. Behind them, in three battalions, stood the men of Ypres on the left, the men of Veurne and Bergues in the centre and on the right a contingent of the outlying territory of Bruges. And finally, in the rear, remained the other Flemings to serve as a reserve and guard the Allied camp. Across the front of the army and along its left flank, Robert had constructed lines of ditches and outworks defended by anti-cavalry obstacles carefully camouflaged. Thus protected he waited for the enemy.\nBattle\nBurgundy and Armagnac were aware of the advance of Philip VI and resolved to await his arrival without giving battle. This plan came to nothing when a number of French knights, eager to engage with the enemy and disdainful of orders from their commanders urging restraint charged from the town and into the defended outworks of the allied left wing and were repulsed. However, the men of Ypres, who were defending the barrier, leaped over it and rushed into the open country in pursuit of their adversaries. They were followed by the entire rest of the second line. Seeing that the Flemings no longer had the protection of their outworks, the French turned and counter-attacked, creating a vicious melee which continued for most of the afternoon. Burgundy, who could see all this from the wall, could bear it no longer. He and Armagnac led their retinues of about 850 men, including 300 heavy cavalry, out of the town gates at the end of the afternoon. Armagnac and his men galloped round to the southern edge of the battlefield to join the melee which has been in progress since mid-day.\nThe men of Ypres and the other Flemings who had once formed the second line of Robert's army were driven back with heavy losses and eventually took their heels. Fleeing through the open encampment of the Anglo-Flemish army, they spread panic among the rearguard who were waiting there. The French crashed into the encampment after them, and trapping the fleeing Flemings in the bend of the river Aa, slaughtered many thousands of them.\nMeanwhile, Burgundy who did not accompany Armagnac to the battle on the southern flank, road straight down towards the front lines of the Anglo-Flemish army. Robert of Artois and the English and Brugeois had stood there all afternoon behind their fieldworks. When they saw Burgundy's banners approaching them, they charged. The duke's horsemen were unprepared and overwhelmed by the weight of numbers. They fell back into the south-eastern suburbs of Saint-Omer. A fierce rearguard action by French townsmen and archers was all that prevented Robert's men from breaking into the town and it was some time before the gates could be finally forced shut behind the remnants of Burgundy's force. Nobody in the town or Robert's army was aware that a mile behind them the French held the field. As darkness fell, Robert and Armagnac trooped back to their respective positions on the same road resulting in a number of frantic skirmishes in the dark but little significant fighting.\nAftermath\nWhen the morning came, the full extent of the disaster which had befallen his troops on the southern flank became apparent to Robert. The Flemings with Robert did not wait for the French to return. They fled to Cassel and Ypres. And Robert himself, after a moment of hesitation, followed them. Having failed to capture the town or defeat the French force in open battle, he knew there was no choice but to abandon the campaign before Philip's superior army cut him off from Flanders. Abandoning all that could not be rapidly carried, Robert returned to Edward with the remaining of his army. On the field behind him he had left some 8,000 Flemish soldiers dead. Both sides were still battle worthy however as his first line which consisted of his best troops, the English longbowmen, mostly survived the confrontation. There still were some significant effects; morale amongst the Flemish contingents of Edward's army collapsed, denting the prestige of the coalition and undermining its cohesion. Southern Flanders was now undefended as the men intended for this purpose were lying dead outside Saint-Omer. Within a few days of the battle, representatives of the towns which had suffered especially badly such as Ypres, Bruges and van Artevelde's enemies in Ghent made peace overtures towards Philip, undermining English support in the region. Edward nonetheless pursued his campaign and left Ghent to besiege Tournai.\nReferences\n*"
    }
  ]
}