{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Los Horcones\n\n| map_type    =\n| map_relief  =\n| latitude    =\n| longitude   =\n| map_size    =\n| map_marksize =\n| map_caption =\n| map_label   =\n| territory   =\n| result      = Patriotic victory\n| status      =\n| combatants_header =\n| combatant1  = 20px Patriotas\n| combatant2  = 20px Spanish Empire\n| commander1  = José Félix RibasJacinto LaraJosé Florencio Jiménez\n| commander2  = Francisco ObertoP. González de FuentesManuel Cañas\n| units1      =\n| units2      =\n| strength1   = 500 men60 cavalry\n| strength2   = 700 men100 cavalry4 artillery pieces\n| casualties1 = Many dead\n| casualties2 = Many dead300 capturedArtillery, weapons, medical supplies and transports captured.\n| casualties3 =\n| notes       =\n| campaignbox =\n}}\nThe Battle of Los Horcones, part of the Admirable Campaign, was a military conflict in Venezuela during the Spanish American wars of independence fought on 22 July 1813 between the pro-independence forces led by José Félix Ribas and Spanish Royalist troops under colonel Francisco Oberto at the plain of Los Horcones. Ribas was victorious, capturing much of the Spanish equipment and more than 300 prisoners.\nBackground\nOn 6 July, Simón Bolívar entered the city of Barinas, evacuated just the day before by Antonio Tíscar. On 9 July, Bolívar ordered José Félix Ribas to advance through El Tocuyo to Chabasquén, where Royalist lieutenant Pedro González de Fuentes was located at the head a Royalist column, which included infantry and cavalry reinforcements just incorporated from Coro.\nRibas marched through the ordered route and, on 18 July, took El Tocuyo for the Patriots.\nOn 20 July, the Royalist troops incorporated the men that ship lieutenant Manuel Cañas had saved from the Battle of Agua Obispo against lieutenant colonel Atanasio Girardot, now counting 400 infantry and 100 cavalry, plus 4 artillery pieces of calibers 6 and 8, two of each. At the same time, Ribas marched to Quíbor and Barquisimeto.\nBeing aware of these events, colonel Francisco Oberto marched from Araure to Barquisimeto with 300 men and incorporated González's column, with the Royalists forces finally counting a total of 700 men plus the cavalry and artillery.\nBattle\n[Francisco Oberto, the Spanish commander, took defensive positions with his Royalist troops at Los Horcones plain, 5&nbsp;km away from Barquisimeto on the route to Quíbor, where they waited for the arrival of the Patriot column, commanded by José Félix Ribas and Jacinto Lara.\nThe battle started at 11:00 and the Royalist troops repulsed the first two attacks thanks to its artillery, but a third attack finally overran the Spanish positions. This was largely thanks to sub-lieutenant Gabriel Picón González, who then aged 14 years old and became a hero by rushing and taking a Spanish cannon despite getting his right femur shattered due to shrapnel.\nWhen the battle was lost for the Royalists, Oberto and Cañas fled with 15 soldiers through San Felipe, with Ribas chasing them with 50 horsemen and finally capturing them at Cabudare.\nAftermath\nBoth sides suffered heavy human losses, but otherwise Ribas achieved a complete victory for the Patriots, capturing all four artillery pieces as well as other weapons, medical supplies, transport vehicles and over 300 prisoners.\nGabriel Picón became a hero for Simón Bolívar, who quickly wrote a letter to Antonio Rodríguez de Picón, Gabriel's father and commander of Mérida, saying that his son would become \"eternal in the annals of Venezuela\" due to his courageous action that day. Afterwards, Bolívar kept Picón under his protection, who wouldn't be able to pursue a military career and instead focused on politics, and later would become the governor of Mérida. Picón would get known as the \"boy-hero of the Battle of Los Horcones\" due to his young age.\nGabriel Picón is buried in the National Pantheon of Venezuela, resting place for Venezuelan national heroes, and has a parish named after him in the Alberto Adriani Municipality.\nReferences"
    }
  ]
}