{
  "content": [
    {
      "type": "text",
      "text": "# Battle Cry (Imagine Dragons song)\n\n| recorded      = 2014 atImagine Dragons Studio(Las Vegas, Nevada)\n| studio        =\n| venue         =\n| genre         = *Electronic rock\n*arena rock\n*progressive rock\n| length        = 4:34\n| label         =\n| writer        =\n}}\n| producer      =\n}}\n| chronology    = Imagine Dragons\n| prev_title    = Radioactive (Remix)\n| prev_year     = 2014\n| next_title    = Warriors\n| next_year     = 2014\n| misc          = }}\n}}\n\"Battle Cry\" is a song by American rock band Imagine Dragons. It was released on June 2, 2014, as a single promoting Transformers: Age of Extinction, a 2014 science fiction action film based on the Transformers franchise. The song, which appears in the end credits of the film, was also included on the super deluxe version of the band’s second studio album, Smoke + Mirrors (2015). It is the first theme song in the live-action Transformers film franchise not to be performed by Linkin Park, though the latter's \"Until It's Gone\" is included on the accompanying video game.\nBackground\nAs part of his efforts to distance Age of Extinction from the previous films in the series, Transformers director Michael Bay sought out a new musical act to soundtrack the film and hand picked Imagine Dragons for the job. \"Battle Cry\" was written by the group members specifically for use in the film, inspired by the story as pitched to them by Bay. Lead singer Dan Reynolds revealed to Billboard that the aim with \"Battle Cry\" was to write \"in a more cinematic way\" to compose a song that was satisfying as a piece of music but also benefited the visual it was set to accompany.\nTrack listing\nPersonnel\nImagine Dragons\n*Dan Reynolds&nbsp;– vocals, piano\n*Wayne Sermon&nbsp;– acoustic and electric guitars\n*Ben McKee&nbsp;– bass guitar, keyboards\n*Daniel Platzman&nbsp;– drums, percussion\nAdditional Musicians\n*Hans Zimmer&nbsp;– production\n*Steve Jablonsky&nbsp;– production\nCharts\n{| class=\"wikitable\"\n! Chart (2014)\n! Peakposition\n|-\n|-\n|-\n| UK Singles (Official Charts Company)\n| align=center| 111\n|-\n|-\n|}\nCertifications\nReferences"
    }
  ]
}