{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Glen Affric\n\nor \"a small company\"\n| casualties2 =Unknown\n| notes=\n}}\nThe Battle of Glen Affric () took place in 1721 in Glen Affric, in the Scottish Highlands. It was fought between Government backed forces of the Clan Ross against rebel forces of the Clan Mackenzie and their allies the Clan Macrae.\nBackground\nDuring the Jacobite rising of 1715 the chiefs of the Highland Clan Ross had supported the British-Hanoverian Government. The rising of 1715 was ultimately defeated at the Battle of Sheriffmuir and another rising had been defeated at the Battle of Glenshiel in 1719, where troops from the Clan Ross had fought in support of the Government and defeated the likes of the Jacobite Clan Mackenzie. William Mackenzie, 5th Earl of Seaforth, chief of Clan Mackenzie, had been exiled in France for his part in the Jacobite rising of 1715 and had also returned briefly to Scotland to take part in the Jacobite rising of 1719, before returning to exile in France.\nIn 1720 two members of the Clan Ross - William Ross, 6th of Easter Fearn (ex-Provost of Tain) and his brother Robert Ross (Baillie of Tain) - had been appointed factors on the estates of Mackenzie of Seaforth, Chisholm and Glenmoriston. The following year, in 1721, they went on an expedition to collect rents on these estates. The Rosses set off from Inverness with thirty armed men, picking up a further fifty armed men from Bernera Barracks. The Murchison family being a sept of the Clan Mackenzie, Colonel Donald Murchison was Mackenzie of Seaforth's factor who had been collecting rents and sending them to his master in France.\nBattle\nWhile on their journey to Mackenzie of Seaforth's lands in Kintail, the Rosses who were attended by just a small company of soldiers met three hundred men of the Clan Mackenzie and their allies the Clan Macrae in Glen Affric. Historian Alan Mackenzie says that the Rosses were \"ambushed\" at near Loch Affric. The Mackenzies and Macraes were commanded by Colonel Donald Murchison of Auchtyre and Lochalsh who had been sending the rents to Mackenzie of Seaforth in France.\nA skirmish took place between the two sides in which the Rosses were outnumbered. William Ross of Easter Fearn was the first to be wounded by shots fired at him from his right. However, he continued to give orders to his troops to advance and clear the ground of lurking clansmen. They had some success in this respect and were able to proceed to a narrow gorge in Kintail which led into Loch Affric, where they were ambushed by Murchison's men. William Ross's son Walter Ross and also his nephew William Ross (son of his brother Robert Ross) were also wounded. Realizing that further resistance was useless William Ross met Colonel Murchison between the lines and discussion took place. The Rosses agreed to return home, promising never again to officiate as factors and as a token of sincerity handed their commissions to Donald Murchison.\nAftermath\nWalter Ross died of his wounds. Colonel Murchison insisted on escorting his foes past a thicket where he alleged a \"blood thirsty\" party from the Clan Cameron lurked. On reaching Beauly, Walter Ross was buried in Beauly Priory. A second unsuccessful attempt was made by Government troops to seize Mackenzie of Seaforth's lands by force, in which the Battle of Coille Bhan was indecisive.\nReferences"
    }
  ]
}