{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Iller River\n\n| result      = French victory\n| combatant1  =  Republican France\n| combatant2  =  Habsburg Austria\n| commander1  =  Jean Moreau Antoine Richepanse Michel Ney\n| commander2  =  Paul Kray Archduke Ferdinand Count Baillet\n| strength1   = 55,000 infantry,2,780 cavalry\n| strength2   = 28,000\n| casualties1 = 700 killed & wounded,300 captured\n| casualties2 = 800 killed & wounded,1,100 & 4 guns captured\n| map_type=Germany\n| map_relief=1\n| map_size=200\n}}\nThe Battle of Iller River or Battle of Erolzheim (5 June 1800) saw a French Republican army led by Jean Victor Marie Moreau fight a Habsburg Austrian army led by Paul Kray. In late May, the adversaries reached a stalemate with the Austrian army holding Ulm and the French army facing it from the south. Both armies numbered about 80,000 men. Kray launched an attack against the French left wing along the Iller River at Erolzheim and Illertissen, but he withdrew his troops when Moreau sent reinforcements. The action occurred during the War of the Second Coalition, part of the French Revolutionary Wars.\nThe Iller River flows north past Memmingen, Erolzheim, and Illertissen in southern Germany and enters the Danube at Ulm.\nBackground\nForces and plans\nAt the start of 1800, Paul Kray commanded the Austrian army in southern Germany. Kray enhanced his reputation by winning the Battle of Magnano in 1799. According to James R. Arnold, Kray commanded 120,000 troops, though 25,000 of these were posted farther east to defend the Tyrol and Vorarlberg. One liability was that several allied contingents were less than first-class value, including 12,000 men from the Electorate of Bavaria, 7,000 Tyrolean militia, 6,000 soldiers from the Duchy of Württemberg, and 5,000 militia from the Electorate of Mainz. The Aulic Council planned for the Austrian army in Italy to strike first, forcing the French to weaken their army on the Rhine River. Kray would then cross the Rhine and invade France via the Belfort gap. Meanwhile, Kray distributed his troops in a  long cordon defense. One weakness of Kray's position was the magazine that he established at Stockach was very close to French-held Switzerland. Another flaw was that the Austrian army's supply services began to break down due to dissension among his staff, leading to low morale and a spike in desertions. Historian Theodore Ayrault Dodge claimed that Kray's army numbered 110,000 infantry, 25,000 cavalry, and 4,000 artillerists with 500 guns.\nOn 1 March 1800, First Consul Napoleon Bonaparte of the new French Consulate government ordered Moreau to reorganize his army into four corps. Moreau's Army of the Rhine got the best soldiers and was well supplied. The Right Corps was led by Claude Lecourbe and the Center Corps was commanded by Laurent de Gouvion Saint-Cyr. Each contained three large infantry divisions and a small reserve. The Left Corps was under Gilles-Joseph-Martin Bruneteau Saint-Suzanne and included two medium and two small divisions. The Reserve Corps was led by Moreau and had three large divisions and a small cavalry reserve. Altogether, Moreau's army counted 89,585 infantry, 14,065 cavalry, and 4,000 artillerists. Switzerland was garrisoned by 8,234 soldiers and the Rhine fortresses were held by 16,758 men. Moreau rejected a bold strategy proposed by Bonaparte. Instead, Moreau planned to feint with his Left Corps and cross the Rhine at Basel with the Reserve. He would then march east, join with the Center and Right Corps, and confront Kray near Stockach.\nOperations\nKray's 25,000-man left wing under Heinrich XV, Prince Reuss of Greiz held the Vorarlberg. The Austrian center led by Friedrich Joseph, Count of Nauendorf numbered 40,000 men and was deployed from Donaueschingen to Villingen. It held an outpost line on the Rhine River from Basel to Lake Constance. The right wing consisted of Michael von Kienmayer's 15,000 men holding the Black Forest and Anton Sztáray's 16,000 soldiers defending the Rhine north of the Black Forest. A 20,000-strong reserve was posted near Stockach and 8,000 men held Frankfurt. There was an entrenched camp and a major supply base at Ulm.\nOn 25 April 1800, Saint-Suzanne's Left Corps thrust out of its bridgehead at Kehl and drove Kienmayer's forces back. It then turned northeast and advanced toward Rastatt, which was defended by Sztáray's corps. Saint-Cyr's Center Corps crossed to the east bank of the Rhine at Alt-Breisach, pushed back Ignaz Gyulai's division, and seized Freiburg im Breisgau. Kray reacted by ordering 7,000 troops to reinforce Kienmayer. Having drawn Kray's attention away from Moreau's main attack, Saint-Suzanne withdrew to the west bank of the Rhine at Strasbourg. His corps marched upstream, crossed the Rhine at Alt-Breisach, and marched from Freiburg to Neustadt. Saint-Cyr's corps moved southeast through the Black Forest from Freiburg toward Sankt Blasien.\nLecourbe's Right Corps crossed the Rhine between Schaffhausen and Stein am Rhein and headed for Stockach. Moreau's Reserve Corps crossed the Rhine at Basel and advanced toward Engen where he planned to join with Saint-Cyr's corps. Kray reacted by canceling the reinforcement to Kienmayer. Kray suddenly realized that his Stockach magazine was threatened, but it was too late. The Battles of Stockach and Engen occurred on 3 May 1800. At Engen, the two armies fought to a draw, but at Stockach, 20,000 French troops faced 12,000 Austrians. Lecourbe defeated Joseph Louis, Prince of Lorraine-Vaudémont and captured the Stockach supply base, causing Kray to withdraw north to Messkirch. The Battle of Messkirch on 5 May was stoutly contested between 50,000 French and 40,000 Austrians. That night, Kray retreated north to Sigmaringen where he crossed to the north bank of the Danube on 6 May.\nKray moved to the northeast, crossed to the south bank of the Danube at Riedlingen, and marched east to protect his magazine at Biberach. While Moreau was with Saint-Suzanne's Left Corps, Saint-Cyr with 25,000 men defeated Kray with 20,000 troops at the Battle of Biberach on 9 May. The supply base fell into French hands and Kray retreated to Ulm. On 10 May, some French elements reached the Iller River at Memmingen. At about this time, Lazare Carnot delivered the orders of the French government to detach a strong reinforcement to Italy, so 15,000 troops were sent under Bon-Adrien Jeannot de Moncey. This left Moreau and Kray with about 80,000 men each. On 13 May, Moreau's Right, Reserve, and Center Corps crossed to the east bank of the Iller at Memmingen.\nOn 14 May 1800, Saint-Suzanne's corps arrived at Erbach an der Donau on the north bank of the Danube near Ulm. Kray attacked Saint-Suzanne, but when Saint-Cyr marched back west and appeared on the south bank, Kray suspended the operation. The Austrian commander thus passed up an opportunity to maul Saint-Suzanne's corps. On 25 May, Moreau sent Lecourbe's Right Corps to occupy Augsburg and brought Saint-Suzanne's Left Corps to the south bank of the Danube. This extended the French across a  front. By doing so, Moreau hoped to tempt Kray into coming out to fight. However, Kray would not take the bait and stayed in his entrenched camp at Ulm. Moreau seemed unable to maneuver Kray out of Ulm. Moreau wrote to Bonaparte, admitting that he and Kray, \"were fumbling against one another.\" Unhappy with Moreau's leadership, Saint-Cyr resigned his command, pleading bad health. On the Austrian side, morale was low because of Kray's lack of success.\nBattle\nMoreau reorganized his army, sending Saint-Suzanne and one of his division commanders, Joseph Souham, to the lower Rhine to take charge of reserve troops. Antoine Richepanse assumed command of part of Saint-Suzanne's corps which became the flying left wing. Paul Grenier took charge of Saint-Cyr's corps, which was now the left wing. Moreau took personal control of the center and reserve. Lecourbe retained command of the right wing and Gabriel Jean Joseph Molitor took control of the flying right wing in Switzerland. On 5 June, Kray mounted an attack against Richepanse's flying left wing in the area of Erolzheim and Illertissen.\nIn the Battle of Erolzheim, Archduke Ferdinand Karl Joseph of Austria-Este commanded the main column of 23 battalions and 26 squadrons, but \"was not favored by the luck of arms\". Kray placed Ludwig Anton, Count Baillet de Latour in command of the third attacking column. It consisted of 8 infantry battalions and 10 cavalry squadrons. Baillet's column successfully ousted Louis Michel Antoine Sahuc's French brigade from Balzheim and Wain on the west bank of the Iller. However, Moreau quickly sent Richepanse reinforcements. Michel Ney's French division from Grenier's corps attacked Count Baillet's division and forced it to retreat after sustaining serious losses. Johann Rudolf von Sporck, who commanded the reserve, was captured by a French patrol while carrying out a personal reconnaissance.\nKray ordered a withdrawal after the French reinforcements arrived on the field. Out of 55,000 infantry and 2,780 cavalry, the French sustained losses of 700 killed and wounded plus 300 captured. The Austrians engaged 28,000 troops in the battle and lost 800 killed and wounded plus 1,100 men and 4 guns captured.\nAftermath\nOn 9 June 1800, Moreau received news that Bonaparte's army occupied Milan; this spurred him to make a new effort. Moreau realized that Kray would not budge unless he mounted a serious threat to the Austrian line of communications leading back to Vienna. Therefore, he determined to thrust with his right wing to cross the Danube near Dillingen an der Donau or Donauwörth. Using Richepanse's flying left wing as a stationary pivot, Moreau wheeled his right wing north. On 19 June, Lecourbe defeated Sztáray at the Battle of Höchstädt and gained a bridgehead on the north bank of the Danube. This setback caused Kray to withdraw northeast to Nördlingen. Kray left a garrison to hold the Ulm fortress which the French blockaded.\nForces\nAside from the units under Richepanse and Ney, the source does not list which French divisions were engaged. The French \"Flankers of the Left\" were commanded by Richepanse. Grenier's left wing included the divisions of Ney, Louis Baraguey d'Hilliers, Claude Juste Alexandre Legrand, and Jean-Louis-François Fauconnet.\n{| class=\"wikitable\" style=\"text-align:center; width:60%;\"\n|+List of Austrian Army units at Battle of Iller River\n! Units\n! Battalions\n! Squadrons\n|-\n| rowspan=1 | Archduke Ferdinand Infantry Regiment Nr. 2 || 3 || 0\n|-\n| rowspan=1 | Archduke Charles Infantry Regiment Nr. 3 || 3 || 0\n|-\n| rowspan=1 | Benjowski Infantry Regiment Nr. 31 || 3 || 0\n|-\n| rowspan=1 | Bender Infantry Regiment Nr. 41 || 3 || 0\n|-\n| rowspan=1 | Beaulieu Infantry Regiment Nr. 58 || 1 || 0\n|-\n| rowspan=1 | Fleming Grenadier Battalion || 1 || 0\n|-\n| rowspan=1 | Rüffer Grenadier Battalion || 1 || 0\n|-\n| rowspan=1 | Wouvermanns Grenadier Battalion || 1 || 0\n|-\n| rowspan=1 | Wurmser Freikorps || 2 || 0\n|-\n| rowspan=1 | Deutsch-Banater Grenz Infantry Nr. 12 || 1 || 0\n|-\n| rowspan=1 | Tyrolean Sharpshooters ||  || 0\n|-\n| rowspan=1 | Kaiser Cuirassier Regiment Nr. 1 || 0 || 6\n|-\n| rowspan=1 | Zeschwitz Cuirassier Regiment Nr. 5 || 0 || 6\n|-\n| rowspan=1 | Coburg Cuirassier Regiment Nr. 6 || 0 || 6\n|-\n| rowspan=1 | Kinsky Cuirassier Regiment Nr. 12 || 0 || 6\n|-\n| rowspan=1 | Kronprinz Dragoon Regiment Nr. 2 || 0 ||\n|-\n| rowspan=1 | vacant Dragoon Regiment Nr. 13 || 0 ||\n|-\n|}\nNotes\n;Footnotes\n;Citations\nReferences\n*\n*\n*\n*\n*\n*"
    }
  ]
}