{
  "content": [
    {
      "type": "text",
      "text": "# Battle of the Salnitsa river\n\nCuman–Kipchak Confederation\n| combatant2        = 22px Kievan Rus'\n| commander1        = BoniakAyyub Khan (D)KoktusAklan BurchevichAzgulai\n| commander2        = 22px Vladimir II Monomakh22px Sviatopolk II of Kiev22px Davyd Sviatoslavich\n| strength1         = Unknown; Much more than in Rus'\n| strength2         = Unknown\n| casualties1       = Heavy\n| casualties2       = Unknown\n}}\nThe Battle of the Salnitsa. .}} was the main battle in the final phase of the great campaign of a coalition of Kievan Rus' princes against the Polovtsians in March 1111 on the Salnica River. In this battle, the Polovtsian army was completely defeated by Rus' princes led by Grand Duke Svyatopolk Izyaslavich of Kiev, Prince Davyd Sviatoslavich of Chernigov and Prince Vladimir Monomakh southern Pereyaslavl.\nCampaign\nOn 26 February 1111 (the 2nd Sunday of Great Lent), the Rus' army, led by a coalition of princes (Svyatopolk with his son Yaroslav, Davyd with his son, Vladimir with his sons), moved in battle order to the city of Sharukan.\nThe place where the Rus' troops gathered was allegedly Lake Dolobsk, after the 1111 Council of Dolobsk. The route passed through the rivers Sula (day 5), Khorol (day 6), Psel (day 7), Golty, Vorskla (day 10), after which they reached the banks of the Seversky Donets (day 23).\nOn 24 March, the first fierce battle took place near the Donets, in which Rus' soldiers took the upper hand. On the morning of 27 March, at the full moon, the second, main battle began on the Salnitsa River.\nThe Rus' troops were surrounded, but the Polovtsi could not withstand their coordinated direct attack. The Rus' captured a large number of prisoners of war and loot.\nAftermath\nIt was the decisive battle of the 1111 Rus'-Cuman campaign. The victory of Kievan Rus' ensured victory in the war, the Polovtsi began to be pushed back and the only thing they could do was small raids, some of which the Rus' repelled.\nIn 1116, the Rus' again gathered on a campaign and robbed the Polovtsi villages on the Don. Vladimir Monomakh's son Yaropolk in 1120 also gathered troops to strike, but the Polovtsi went far into the steppe.\nAs a result, Kievan Rus' annexed a huge part of the Polovtsi territories between the Don and the Carpathians.\nNotes\nReferences\nLiterature\n*\n*"
    }
  ]
}