{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Matasiete\n\n|map_type    =Venezuela\n|map_relief  =\n|map_size    =\n|map_marksize =\n|map_caption =\n|map_label   =\n|territory   =\n|result      = Venezuelan victory\n|status      =\n|combatants_header =\n|combatant1  = Venezuela\n|combatant2  = Kingdom of Spain\n|combatant3  =\n|commander1  =Francisco Esteban Gómez\n|commander2  =Pablo Morillo\n|units1      =\n|units2      =\n|strength1   =300–1,300  Another source says there were 1,300 defenders in total, supported by the population of the town. Morillo said in his report on the battle that the Patriots had lost 200 killed and 450 wounded.  }}\n|strength2   =3,000\n|casualties1 =Unknown\n|casualties2 =559 killed or wounded\n|notes       =\n|campaignbox =\n}}\nThe Battle of Matasiete was a battle in the Venezuelan War of Independence that took place on 31 July 1817 near the city of La Asunción on Isla Margarita in Venezuela.\nIt was fought between pro-independence Republican revolutionaries led by Francisco Esteban Gómez and Spanish Royalist forces under the command of Pablo Morillo.\nThe outcome was a Spanish defeat.\nBackground\nThe revolutionary leader Simón Bolívar arrived in the island of Margarita in May 1816. On 6 May 1816 Bolívar declared the Third Republic of Venezuela and an Assembly of Notables recognized Simón Bolívar as Supreme Chief in the church of Santa Ana. Bolívar then went on to the mainland. That year the Republicans were generally successful in their struggle with the Royalist forces. The Spanish general Pablo Morillo returned to Venezuela in December 1816, and decided to first take Margarita, then move on to Guayana Province, both important Republican bases. After some difficulties in collecting supplies and troops, Morillo sailed to Margarita in late June 1817, where he steadily gained control in a hard-fought campaign.\nOn 24 July 1817 Morillo occupied the San Carlos de Borromeo Fortress at Pampatar, at the southeast tip of the island a few miles from Asunción. The Revolutionaries had evacuated the castle and withdrawn to Asunción, where they concentrated. They were followed by Morillo's forces. The Spanish occupied the hill of Matasiete, which overlooked the city and its surroundings from the east, with a force of 2,000 infantry and 600 cavalry. There was no resistance to this move. The approach to the town was difficult, however, due to the rugged terrain that the defenders had fortified with redoubts, moats and parapets.\nBattle\n, the Spanish commander]]\nOn 31 July 1817 Morillo launched the assault, which began at eight thirty in the morning. The struggle was fierce, with the Spanish pressing hard against the defensive front. In his later report on the battle, Morillo paid tribute to the stubborn courage of the Republicans, who repelled repeated cavalry charges. During the course of the fighting, many unarmed men and women from the town joined the defenders, taking up the arms of those who had been killed or wounded. General Esteban Gómez himself was hit by bullets several times, and his horse was killed under him.\nThe Republican artillery batteries Carante and Libertad played an important role in the defense.\nThe Libertad, commanded by Felipe Villalba, fired incessantly. The Patriots also rolled huge boulders down the slope into the Spanish line. By four in the afternoon the battle had been decided, with the Republicans the victors. 559 of the Royalist troops had been killed or wounded. On 1 August Morillo retired to the fortified position of Pampatar, followed by Gómez with a harassing force of 200 infantry and 300 horsemen.\nAftermath\nThe battle had saved the city, but the Revolutionaries continued to lose ground to the Spanish in the island. By mid-August they held only Asunción and the fortaleza del norte.\nMorillo then heard that the Revolutionaries on the mainland had captured Ciudad Guayana on 18 July, occupied Baja Guayana on 3 August, and were threatening Caracas. Morillo left the island without completing the conquest, but was unable to recover Guayana. The Republicans were in a stronger position after the campaign of 1817 than they had been before. La Asunción became the provisional capital of the independent Republic of Venezuela.\nA column has been erected on the site of the battle. The Castillo de San Carlos de Borromeo in Pampatar displays a painting that commemorates the battle, the most popular item in its collection. In 1974 Matasiete hill was decreed a Natural Monument of Margarita. Gómez Municipality, Nueva Esparta, birthplace of the victorious general, is named in his honor. The anniversary of the battle is now celebrated as a special holiday on Margarita. On 31 July 2012 a reenactment of the battle was staged at the site by over 500 volunteers.\nReferences\nNotes\nCitations\nSources\n*\n*\n*|url=http://www.enoriente.com/canales/cronicas-orientales/1156-batalla-de-matasiete|archive-url=https://web.archive.org/web/20130504074925/http://www.enoriente.com/canales/cronicas-orientales/1156-batalla-de-matasiete|url-status=dead|archive-date=4 May 2013|title=Batalla de Matasiete|journal=En Oriente|date=13 March 2006|access-date=2013-05-20|language=Spanish}}\n*\n*\n*\n*\n* |url=http://www.margaritaentusmanos.com/_municipio/mun005.htm\n|title=Gómez|work=Margarita en tus manos|access-date=2013-05-21|language=Spanish}}\n*\n*\n*\n*\n*"
    }
  ]
}