{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Jijiga\n\n(1978)\n| strength1         = 1977:25,000 soldiers108 tanks, mostly M47s and M41s\n| strength2         = 1977:unknown soldiers124 tanks, mostly T-54/551978:30,000 soldiers30,000 militias\n| combatant1        =  Ethiopia\n| combatant2        =\n| casualties1       = 1977: Ethiopia:43 tanks destroyed28 APCs1978: Cuba:6 T-62 destroyed8 T-62 damaged\n| casualties2       =\n| campaignbox       =\n}}\nThe Battle of Jijiga was a series of battles that was part of the Ogaden War. The battles were fought in Jijiga, Ethiopia and was one the largest battles of the conflict.\nHistory\nFirst Battle of Jijiga (September 1977)\nIn mid-September 1977, during the Somali invasion of the Ethiopian Somali region, Somalia National Army forces attacked the Ethiopian held garrison in Jijiga. By September more than 90% of Somali Region was in SNA control and on September 12 the Somalia forces captured Jijiga, a strategic success. Jijiga overlooked the nearby Marda Pass where Ethiopian troops were entrenched, halting any further Somali advance deeper.\nLocal defenders at Jijiga garrison consisted of roughly 25,000 Ethiopian infantrymen. The SNA attack on Jijiga came the same day Dire Dawa came under siege.\nThe Ethiopian army had begun to receive Soviet aid by the time of the battle, however morale was low and when a British journalist visited the battlefield afterwards, he claimed that large quantities of weapons had been abandoned by fleeing Ethiopian forces.\n124 Somali tanks, mostly T-55s, defeated 108 Ethiopian tanks, mainly M47 Pattons and M41 Walker Bulldogs. The Ethiopians lost 43 tanks during the battle, including 11 T-34/85 and 32 US made tanks as well as 28 Armoured personnel carriers.\nParts of the battle, including the massacre of both Jijiga's Somali population by the Ethiopian Army and the Somali army's shelling and sniping of refugees attempting to flee the city, are described by Nega Mezlekia in his autobiographical book, ''Notes from the Hyena's Belly.\nSecond Battle of Jijiga (March 1978)\nAfter the Somali advance on Harar had been turned back at the Battle of Harar, the Ethiopian forces launched a counter-attack against the Somali Army (starting on January 22, 1978) with the help of Cuban forces. The Ethiopian forces outflanked the Somali forces and inflicted major losses on them. On March 5, 1978 the Ethiopians recaptured Jijiga and on March 9, 1978, Somalia's President, Siad Barre announced that all Somali forces would leave the Somali Region of Ethiopia, ending the war.\nReferences"
    }
  ]
}