{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Placito\n\n| combatant2        = Apache\n| commander1        =  John Pulliam\n| commander2        = Unknown\n| strength1         = ~20\n| strength2         = Unknown\n| casualties1       = Unknown\n| casualties2       = claim of 5 killed\n}}\nThe Battle of Placito or Battle of the Placito. September 8, 1861, was an engagement between ethnic Hispanic settlers, Confederate soldiers, and Apache warriors. It took place at the village of Placitas (present-day Lincoln) in Confederate Arizona. The action is a part of the Apache Wars of the mid to late nineteenth century.\nBackground\nFollowing the Gallinas massacre, Lieutenant John Pulliam of the Confederate garrison at Fort Stanton returned from his patrol in the Gallinas Mountains where he had searched for three dead soldiers, massacred a week earlier. He arrived at Fort Stanton on September 8, 1861. That same evening, a dispatch arrived from Placitas, a settlement occupied by Hispanic settlers. The dispatch asked help from the Fort to fend off a Apache attack on the town,  east of the fort. Pulliam was ordered to proceed to the village with fifteen soldiers to help protect its citizens.\nBattle\nPulliam and his 15 men arrived at Placitas that night.  The Confederates and an unknown number of Hispanic men drove the Apaches out of town and then fought the Apaches all night at long range. Eventually, the Apache gave up the attack and withdrew back into the surrounding countryside. Casualties are unknown. Pulliam claimed to have killed at least five Apaches Pulliam and his men arrived back at Fort Stanton the following afternoon. Fort Stanton was abandoned by the Confederates on September 10 as the commander decided he didn't have the resources to contest the Apaches.\nSee also\n*New Mexico campaign\nReferences\n* Thompson, Jerry Don, Colonel John Robert Baylor: Texas Indian Fighter and Confederate Soldier. Hillsboro, Texas: Hill Junior College Press, 1971.\n* Katheder, Thomas, The Baylors of Newmarket: The Decline and Fall of a Virginia Planter Family. New York and Bloomington, Ind., 2009.\n*\nExternal links\n*[https://web.archive.org/web/20090630002604/http://www.fortstanton.com/History.htm Friends of Fort Stanton historical page]\n*[https://web.archive.org/web/20090621112626/http://www.billybyway.com/fort-stanton-a.html Fort Stanton, Lincoln County New Mexico]\n*[https://web.archive.org/web/20070704151027/http://www.nps.gov/history/nr/travel/amsw/sw57.htm American Southwest, a National Park Service Discover Our Shared Heritage Travel Itinerary]\n*[https://web.archive.org/web/20100917043713/http://aerc.org/Photo_Gallery/FS2005/cave/Fort_Stanton_Cave.html AERC.org: Fort Stanton Cave] (slideshow)\nReferences"
    }
  ]
}