{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Misiche__disambig_1\n\n| map_type          = Iraq\n| map_relief        = yes\n| map_size          =\n| map_marksize      =\n| map_caption       =\n| map_label         =\n| map_mark          =\n| casus             =\n| territory         = Philip the Arab paid 500,000 denarii to the Sasanian Empire and cedes Armenia and Mesopotamia to them\n| result            = Sasanian victory}}\n| status            =\n| combatants_header =\n| combatant1        = Sasanian Empire\n| combatant2        = Roman EmpireGothsGermans\n| commander1        = Shapur I\n| commander2        = Emperor Gordian IIIPhilip the ArabGaius Julius Priscus\n| units1            =\n| units2            =\n| strength1         =\n| strength2         =\n| casualties1       =\n| casualties2       =\n| notes             =\n| campaignbox       =\n}}\nThe Battle of Misiche (Greek: ), Mesiche, or Massice (𐭩𐭪}} mšyk; 𐭔𐭉𐭊}} mšyk) (dated between January 13 and March 14, 244 AD.) was fought between the Sasanians and the Romans in Misiche, Mesopotamia.\nBackground\nThe initial war began when the Roman Emperor Gordian III invaded the Sasanian Empire in 243 AD.  His troops defeated the Sasanian forces at the Battle of Resaena and advanced as far as Misiche. The location of that city (or maybe a district) is conjectural, but is placed at modern Anbar.\nBattle\nInscription at Naqsh-e Rustam\nThe Battle is mentioned on the trilingual inscription king Shapur I made at Naqsh-e Rustam:\nWhen at first we had become established in the empire, Gordian Caesar assembled from all of the Roman, Goth and German lands a military force and marched on Asorestan (Mesopotamia) against Ērānšahr (Sasanian Empire) and against us. On the border of Asorestan at Misiche, a great frontal battle occurred. Gordian Caesar was killed and the Roman force was destroyed. And the Romans made Philip Caesar. Then Philip Caesar came to us for terms, and to ransom their lives, gave us 500,000 denars, and became tributary to us. And for this reason we have renamed Misiche Peroz-Shapur [literally \"Victorious Shapur\"].\nThe Roman sources never admitted the defeat. The contemporary and later Roman sources claim that the Roman expedition was entirely or partially successful, but the emperor was murdered after a plot by Philip the Arab. However, some recent sources speculate that the Sasanian victory must not be invented and reject Philip's plot as the ultimate reason of Gordian's death. While some sources claim that it isn't likely that Gordian died during the battle, as Shapur's inscription claims, others state he died on the battlefield. The confusion of the sources about the expedition and the death of the emperor makes it possible that, after the defeat, Roman army was frustrated enough to get rid of the teenage emperor.\nThe third tradition, reported in 6th century by John Malalas and three more eastern historians in 9th to 12th century, specifies that Gordianus crushed his thigh falling off his horse in battle and died of his injury, Malalas further specifying that he died on the way back. Roman sources claim that the soldiers proclaimed Philip emperor, that he made peace with Shapur on \"shameful\" terms, and that Gordian died as the Roman forces departed for the west. Zonaras says that Gordian died after falling from his horse during a battle. Scholarly analyses suggest the Sasanian version, \"while defective[,] is superior\" to the Roman one, which provides no explanation for why the victorious Roman army had to make peace on disadvantageous terms. some other source states that Gordian III died under uncertain circumstances.\nThe two historians, Ilkka Syvänne, and Katarzyna Maksymiuk have stated in their book:\n}}\nAftermath\nGordian's successor, Philip the Arab, was proclaimed emperor of Rome and made peace with Shapur. The next major clash between the two empires took place in 252, when Shapur defeated a large Roman force at the Battle of Barbalissos and successfully invaded Syria and part of Anatolia.\nAfter, Phillip signed a treaty between him and Shapur I, giving away Armenia and Mesopotamia. He later broke the treaty and seized both of Mesopotamia and Armenia back under the Roman domain.\nNotes\nReferences\n*  | editor-first = Ehsan | editor-last = Yarshater | isbn = 0-521-20092-X }}\n* Rostovtzeff, Michael I. \"[https://web.archive.org/web/20110610011837/http://ddc.aub.edu.lb/projects/archaeology/berytus-back/berytus08/17.html Res Gestae Divi Saporis and Dura].\" Berytus 8:1 (1943): 17&ndash;60.\n* Farrokh, Kaveh. Sassanian Elite Cavalry AD 224&ndash;642. Osprey, 2005.\n*\n*\n*\n*\n*\n*"
    }
  ]
}