{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Saltanovka__disambig_1\n\nSiege of Mogilev}}\n| result            = French victory\n| combatant1        =  French Empire\n| combatant2        =  Russian Empire\n| commander1        =  Louis-Nicolas Davout\n| commander2        =  Pyotr Bagration Nikolay Raevsky\n| units1            = Elements of I Corps\n| units2            = VII Infantry Corps\n| strength1         = 21,500–28,000 men\n* 22,000 infantry\n* 6,000 cavalry\n55 guns\n| strength2         = 17,000–20,000 men90 guns\n| casualties1       = 1,200 killed, wounded and missing\n| casualties2       = 2,548 killed, wounded and missing\n}}\n|  zoom = 4\n|   float = right\n|    nolabels = 1\n|     width = 304\n|     height = 120\n| title = French invasion of Russia\n| caption =\n| mark-coord16 =\n| label16 = Saltanovka\n| mark-title16 = Davout in Saltanovka 23 July 1812\n| shape16 = diamond\n| shape-color16 = black\n| label-color16 = black\n| label-offset-x16 = -5\n| label-offset-y16 = 12\n| shapeD=n-circle\n| shape-colorD=navy\n| label-colorD=navy\n| shape-outlineD=white\n| label-sizeD = 12\n| label-posD = right\n| mark-sizeD=12\n| label-offset-xD = 0\n| label-offset-yD = 0\n| label1 = Kowno\n| mark-coord1 =\n| mark-title1 = Kowno 24 June 1812: Napoleon crossed the border\n| label-pos1 = left\n| label-offset-y1 = 7\n| label-offset-x1 = 10\n| shape-color1 = dark red\n| label-color1 = dark red\n| label2 = Vilna\n| mark-coord2 =\n| mark-title2 = Vilnius June 1812: Napoleon Retreat 5 December 1812: Napoleon\n| label-pos2 = top\n| label-offset-x2 = 10\n| label-offset-y2 = 4\n| shape-color2 = dark red\n| label-color2 = dark red\n| label3 = Vitebsk\n| mark-coord3 =\n| mark-title3 = Battle of Vitebsk 26 July 1812: Napoleon\n| label-pos3 = top\n| label-offset-y3 = 3\n| shape-color3 = dark red\n| label-color3 = dark red\n| label4 = Smolensk\n| mark-coord4 =\n| mark-title4 = Battle of Smolensk 16 August 1812: NapoleonNovember 1812: : Napoleon's retreat\n| label-offset-x4 = -10\n| label-offset-y4 = 10\n| shape-color4 = maroon\n| label-color4 = maroon\n| label5 = Borodino\n| mark-coord5 =\n| mark-title5 = Battle of Borodino 7 September 1812: Kutuzov, NapoleonOctober 1812: Napoleon's Retreat\n| label-pos5 = top\n| label-offset-x5 = -10\n| label-offset-y5 = 3\n| shape-color5 = maroon\n| label-color5 = maroon\n| label6 = Moscow\n| mark-coord6 =\n| mark-title6 = Moscow 14 September to 19 October 1812: Napoleon\n| shape-color6 = maroon\n| label-color6 = maroon\n| label7 = Maloyaro-\n| labela7 = slavets\n| mark-coord7 =\n| mark-title7 = Battle of Maloyaroslavets 24 October 1812: Kutuzov, Napoleon\n| shape-color7 = maroon\n| label-color7 = maroon\n| label8 = Berezina\n| mark-coord8 =\n| mark-title8 = Battle of Berezina 26–29 November 1812: Napoleon, Chichagov, Wittgenstein, Kutuzov only pursuit\n| label-offset-x8 = -10\n| label-offset-y8 = 10\n| shape-color8 = maroon\n| label-color8 = maroon\n| label9 = Warsaw\n| mark-coord9 =\n| mark-title9 = Warsaw December 1812: Napoleon's retreat\n| label-pos9 = bottom\n| label-offset-y9 = -6\n| shape-color9 = maroon\n| label-color9 = maroon\n| label10 = Tilsit\n| label-pos10 = left\n| mark-coord10 =\n| mark-title10 = Tilsit 24 June 1812: Macdonald's Prussians crossed the border\n| shape-color10 = olive\n| label-color10 = olive\n| shape-outline10 = white\n| label11 = Riga\n| mark-coord11 =\n| mark-title11 = Siege of Riga 24 July – 18 December 1812: Macdonald's Prussians\n| shape-color11 = olive\n| label-color11 = olive\n| shape-outline11 = white\n| label12 = Tauroggen\n| mark-coord12 =\n| mark-title12 = Tauroggen 30 December 1812: Ludwig Yorck's Prussians signed the Convention of Tauroggen\n| shape-color12 = olive\n| label-color12 = olive\n| shape-outline12 = white\n| label-pos12 = top\n| label-offset-y12 = 3\n| label13 = Drohiczyn\n| mark-coord13 =\n| mark-title13 = Drohiczyn June 1812: Schwarzenberg's Austrians crossed the border\n| shape-color13 = navy\n| label-color13 = navy\n| label14 = Gorodeczno\n| mark-coord14 =\n| mark-title14 = Battle of Gorodechno 12 August 1812: Schwarzenberg's Austrians\n| shape-color14 = navy\n| label-color14 = navy\n| label-pos14 = left\n| label-offset-x14 = 5\n| label-offset-y14 = -2\n| label15 = Pultusk\n| mark-coord15 =\n| mark-title15 = Pultusk December 1812: Retreat of Schwarzenberg's Austrians\n| shape-color15 = navy\n| label-color15 = navy\n| label-pos15 = left\n| label-offset-x15 = 4\n| label-offset-y15 = -2\n}}\nThe Battle of Saltanovka, also known as the Battle of Mogilev (French: Bataille de Mogilev), took place on 23 July 1812 during the early stages of the 1812 French invasion of Russia.\nPrelude\nAvoiding French envelopment attempts at the beginning of the invasion, the Russian Second Western Army under Prince Pyotr Bagration was ordered on 7 July to join, via Mogilev, the First Western Army of Barclay de Tolly. Bagration was threatened with encirclement by French emperor Napoleon's forces under King Jerome to the west and Marshal Louis-Nicolas Davout's I Corps to the north. The Russian Prince moved rapidly to cross the Dnieper river at Mogilev to link up with Barclay. Davout was faster, however, and 28,000 of his troops took Mogilev on 20 July. The Russians arrived before Mogilev on 21 July and their vanguard under Colonel Vasily Sysoev drove out Davout's forward detachments near the village of Dashkovka to the south of Mogilev.\nOpposing forces\nRussian\nBagration had 45,000 men available but assigned only General Nikolay Raevsky's 17,000–20,000-strong VII Corps to attack Davout. Bagration's order was essentially for an aggressive reconnaissance in force. Depending on the strength of the French, Raevsky would either drive the French out and capture Orsha, thereby covering the First Western Army's crossing of the Dnieper or delay them long enough for Bagration to cross south of Mogilev.\nFrench\nWeakened by the transferral of his troops elsewhere and fatigue, Davout had 21,500–28,000 effectives on hand at Mogilev, including 22,000 infantry and 6,000 cavalry, in three infantry division under generals Jean Dominique Compans, Joseph Marie Dessaix and Michel Marie Claparède and cavalry under generals Étienne de Bordesoule and Valence.v Davout deployed his forces at Saltanovka, a naturally strong position. The left flank was covered by the bogs of the Dnieper. A stream ran through a ravine across his front, with a bridge inside Saltanovka. The village itself was surrounded by forests. Davout constructed earthworks to strengthen his line, fortified the buildings on the main road and set up artillery batteries. The bridge at Fatova was destroyed.\nBattle\nInitial stages\nAt 07:00 on 23 July, VII Corps' advance guard of two Jäger battalions under Colonel Andre Glebov drove out Davout's outposts on the French left flank. By 08:00, the bridge on the left was in Russian hands and the Jäger continued their advance. Davout deployed the 85th Line Regiment for a counterattack, backed by artillery. The Russian attack failed as crushing French artillery and infantry firepower mowed down the unprotected Russian infantry, who died where they stood rather than break for cover. While the Russian attack was faltering, Bagration sent Raevsky a new order to storm Mogilev.\nFatova\nThe 26th Infantry Division under Ivan Paskevich assaulted Fatova in extended column formation, forcing I/85 to retreat. Davout sent a battalion of the 108th Line Regiment and some artillery to help out.  The two French battalions redeployed on the heights south of Fatova and defeated the Russian attacks.  Backed by 12 guns, Paskevich opened another assault that bashed through the French defenders to take the village. Past Fatova, Davout had prepared an ambush with four battalions from the 108th Line, lying low amidst the wheat fields behind the village. The concealed French troops launched a devastating counterattack that caused heavy losses on the Russians and threw them back in disarray. Fatova was recaptured by the French. Paskevich attacked and captured the village again. Davout now moved forward the 61st Line from his reserve. All Russian attacks were repulsed and on the right, two French battalions overran the Nizhniy-Novgorod and Orlov regiments, crossing the stream. Paskevich deployed the Poltava regiment to prevent his right flank from being enveloped.\nSaltanovka\nThe Russian attack's main point of effort was Saltanovka. Raevsky personally led the Smolensk Infantry Regiment to capture a dam and shield the attack of his main force. The 6th and 42nd Jäger Regiments would act as support, along with artillery on both sides of the main road. Paskevich's assault on Fatova would take place at the same time. Raevsky blundered, however, not hearing the agreed-upon artillery fire that would signal the advance. His own attack started too late. French artillery inflicted huge losses on Raevsky's men. Raevsky personally led a charge, allegedly with his 11 and 16-year old sons Nikolai and Aleksandr (although Raevsky denied it), but the attempt failed regardless. French prisoners informed Raevsky that French reinforcements were on the way. Bagration ordered a full retreat to Dashkovka. Davout attacked the Russian rearguard later that day but did not achieve a result. Tolstoy gives an account of the storming of the dam in War And Peace, Book III, Chapter 12 when an officer describes the event to a sceptical Count Nikolai.\nAftermath\nThe Second Western Army constructed a bridge south of Mogilev at Novy Bikhov and crossed the Dnieper toward Smolensk. The battle prevented Bagration from joining the First Western Army under Barclay de Tolly at Vitebsk, forcing Bagration to retreat to Smolensk. Saltanovka is generally seen as a French victory but despite failing to link up with Barclay at Vitebsk, Bagration accomplished his objective of joining the main Russian force later at Smolensk, and avoided Napoleon's encirclement.\nCasualties\nThe Russian losses were 2,584 men killed and wounded, although Marshal Davout officially declared that they lost 1,200 dead and 4,000 wounded. Davout admitted to only 900 casualties, which include 100 prisoners from the 108th line regiment and were officially reported by him. The Russians claimed French casualties of 4,134 killed, wounded and missing. Actual French losses were about 1,200.\nSee also\n*List of battles of the French invasion of Russia\nNotes\nReferences\n*\n*\n*\n*\n*\n*\nExternal links\n*"
    }
  ]
}