{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Rivoli__disambig_1\n\n| map_type          = Italy North#Europe\n| map_relief        = 1\n| map_size          = 300\n| result            = French victory\n| territory         =\n| combatant1        = French Republic\n| combatant2        = Habsburg monarchy\n| commander1        =\n| commander2        =\n| strength1         = 22,000\n| strength2         = 28,000\n| casualties1       = –5,000| 3,200 killed and wounded| 1,000 captured}}\n| casualties2       = –14,300| 4,000 killed and wounded| 8,000–10,000 captured}} 40 guns captured\n}}\n|  zoom = 6\n|   float = right\n|    nolabels = 1\n|     width = 304\n|     height = 180\n| title = War of the First Coalition:Italian Campaign\n| caption =\n| shapeD = n-circle\n| shape-colorD = maroon\n| shape-outlineD = white\n| label-colorD = maroon\n| label-sizeD = 12\n| label-posD = left\n| label-offset-xD = 0\n| label-offset-yD = 0\n| label1 =\n| mark-coord1 =\n| mark-title1 = Second Battle of Saorgio (1794) from 24 to 28 April 1794\n| shape-color1 = navy\n| label-color1 = navy\n| label2 =\n| mark-coord2 =\n| mark-title2 = Montenotte campaign from 10 to 28 April 1796\n| label3 =\n| mark-coord3 =\n| mark-title3 = Battle of Fombio from 7 to 9 May 1796\n| label4 = Lodi\n| mark-coord4 =\n| mark-title4 = Battle of Lodi on 10 May 1796\n| label5 =\n| mark-coord5 =\n| mark-title5 = Battle of Borghetto on 30 May 1796\n| label6 =\n| mark-coord6 =\n| mark-title6 = Battle of Lonato from 3 to 4 August 1796\n| label7 =\n| mark-coord7 =\n| mark-title7 = Battle of Castiglione on 5 August 1796\n| label8 =\n| mark-coord8 =\n| mark-title8 = Battle of Rovereto on 4 September 1796\n| label9 =\n| mark-coord9 =\n| mark-title9 = Battle of Bassano on 8 September 1796Second Battle of Bassano on 6 November 1796\n| label10 =\n| mark-coord10 =\n| mark-title10 = Battle of Caldiero (1796) on 12 November 1796\n| label11 =\n| mark-coord11 =\n| mark-title11 = Battle of Arcole from 15 to 17 November 1796\n| label12 =\n| mark-coord12 =\n| mark-title12 = Battle of Rivoli from 14 to 15 January 1797\n| shape-color12 = black\n| label-color12 = black\n| label13 =\n| mark-coord13 =\n| mark-title13 = Siege of Mantua (1796–1797) from 27 August 1796 to 2 February 1797\n| label14 =\n| mark-coord14 =\n| mark-title14 = Battle of Valvasone (1797) on 16 March 1797\n| label15 =\n| mark-coord15 =\n| mark-title15 = Battle of Tarvis (1797) from 21 to 23 March 1797\n}}\nThe Battle of Rivoli (14 January 1797) was a key military engagement during the War of the First Coalition near the village of Rivoli, then part of the Republic of Venice. In the climax of the Italian campaign of 1796–1797, the outnumbered French Army of Italy, commanded by General Napoleon Bonaparte, decisively defeated the attacking Austrian army led by General of the Artillery József Alvinczi. Alvinczi was attempting to march south in a fourth and final effort to relieve the siege of Mantua, despite his deteriorating health. The French victory at Rivoli demonstrated Bonaparte's capability and deftness as a military commander, though very few of Napoleon's battles would be as resourcefully brilliant as Rivoli. The French victory also led to the Austrian surrender of Mantua in February, French consolidation of northern Italy, and ultimately France's victory over Austria in the war later that year.\nForces\nSee order of battle at the Battle of Rivoli.\nPrelude\nAlvinczi's plan was to rush and overwhelm Barthélemy Joubert in the mountains east of Lake Garda by concentrating 28,000 men in five separate columns, and thereby gain access to the open country north of Mantua where Austrian superior numbers would be able to defeat Bonaparte's smaller Army of Italy. Alvinczi attacked Joubert's 10,000 men on 12 January. However Joubert held him off and was subsequently joined by Louis-Alexandre Berthier and, at 2 am on 14 January, by Bonaparte, who brought up elements of André Masséna's division to support Joubert's efforts to form a defensive line on favorable ground just north of Rivoli on the Trambasore Heights. The battle would be a contest between Alvinczi's efforts to concentrate his dispersed columns versus the arrival of French reinforcements.\nBattle\nThe morning of Saturday 14 January found Alvinczi engaging the division of Joubert. He had united three Austrian columns between Caprino on the right and the chapel of San Marco on the left; the brigade of Franz Josef de Lusignan was advancing to the north of Monte Baldo; and the troops of Peter Vitus von Quosdanovich and Josef Philipp Vukassovich were pouring down the roads on either side of the Adige. Before daybreak as the French were moving on the road from Rivoli to Incanale Joubert attacked and drove the Austrians from the chapel of San Marco.\nAt 9 a.m., the Austrian brigades of Samuel Koblos and Anton Lipthay counterattacked the French forces on the Trambasore Heights. Another column under Prince Heinrich of Reuss-Plauen attempted to turn the French right via the Rivoli gorge. Meanwhile, on the French right flank, Vukassovich had advanced down the east bank of the Adige and had established batteries opposite Osteria. The fire of his guns and the pressure from Quosdanovich forced the French out of the village of Osteria and onto the Rivoli plateau. By about 11 a.m. the position of Bonaparte was becoming desperate: an Austrian column under Lusignan was cutting off his retreat south of Rivoli. To reopen his line of retreat Bonaparte turned to Massena's 18th Demi-brigade (\"the Brave\"), newly arrived from Lake Garda. Meanwhile, Alvinczi was on the Trambasore Heights urging his victorious battalions forward, though they were unformed by combat and rough terrain.\nWith the 18th dispatched to check Lusignan, Bonaparte turned all his attention to Quosdanovich. He understood the defeat of this column was the key to the battle. Unfortunately the French had very few reserves left and mostly had to accomplish this with troops already at hand. Making the best of interior lines and his advantage in artillery, Bonaparte thinned out Joubert's lines facing the Austrians frontally at the Trambasore Heights as much as possible and concentrated them before the gorge. A battery of 15 French guns were massed and poured canister shot at point blank range into the advancing Austrian column that was emerging from the gorge. This devastating firepower struck first on the advancing Austrian dragoons who broke and stampeded through their own infantry causing mass chaos. At this juncture the brigade of Charles Leclerc assaulted the column frontally while Joubert laid down heavy flanking fire from San Marco. Here Antoine Charles de Lasalle with just 26 horseman of the 22nd Horse Chasseurs charged into the melee. Lasalle's men captured a whole Austrian battalion and seized 5 enemy flags.\nIn the centre the battle was not yet won; Joseph Ocskay renewed his attack from San Marco and drove back the brigade of Honoré Vial. But at midday French cavalry under Joachim Murat charged the flanks of Ocskay's troops, which were driven back to the positions they occupied in the morning.\nQuosdanovich realized he could not force the defile and ordered his troops to fall back out of artillery range. Meanwhile, while Lusignan was being engaged frontally by the brigade of Guillaume Brune, the division of Gabriel Rey, coming up from Castelnuovo and the brigade of Claude Victor (reserve) began to arrive. They crushed the Austrian column of Lusignan who fled west with less than 2,000 men remaining.\nThe French lost 3,200 killed and wounded and 1,000 captured, while the Austrians suffered 4,000 killed and wounded, plus 8,000 men and 40 guns captured. Although the number of prisoners can reach 10,000, the total losses exceed two-thirds of the total number of the army. One authority gives the French 5,000 and the Austrians 14,000 total losses.\nAftermath\n.]]\nThe next day Joubert and Rey began a successful pursuit of Alvinczi, all but destroying his columns, the remnants of which fled north up into the Adige Valley in confusion. The Battle of Rivoli was Bonaparte's greatest victory at the time. After that he turned his attention to Giovanni di Provera. On 13 January his corps (9,000 men) had crossed north of Legnano and driven straight for the relief of Mantua which was besieged by French forces under Jean Sérurier. At night on 15 January Provera sent a message to Dagobert Sigmund von Wurmser to break out in a concerted attack. On 16 January, when Wurmser attacked he was driven back into Mantua by Sérurier. The Austrians were attacked from the front by Masséna (who had force marched from Rivoli) and from the rear by the division of Pierre Augereau, and were thus forced to surrender the entire force. The Austrian army in North Italy had ceased to exist. On 2 February Mantua surrendered with its garrison of 16,000 men, all that remained of an army of 30,000. The troops marched out with the 'honours of war', and laid down their arms. Wurmser with his staff and an escort were allowed to go free. The remainder were sent to Austria after swearing an oath to not serve against the French for a year, 1,500 guns were found in the fortress. On 18 February Bonaparte proceeded with 8,000 men to Rome, determined to come to a settlement with the Papal States, which had shown covert hostility so long as the campaign had proceeded with uncertainty as to the fate of Italy. But with the fall of Mantua the Austrians were finally driven from Italian soil, and Pope Pius VI agreed to an armistice dictated by Bonaparte in Tolentino. Snow had closed the Alpine passes, but Austria still refused Bonaparte terms of a peace agreement. He prepared one last campaign to the east, into the heartland of Austria to the gates of Vienna itself.\nLegacy\nThe Rue de Rivoli, a street in central Paris, is named after the battle.\nNotes\nReferences\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\nExternal links\n* [https://web.archive.org/web/20090424125841/http://www.historydata.com/places/rivoli-panorama.php Photographs of the battlefield of Rivoli]\n*"
    }
  ]
}