{
  "content": [
    {
      "type": "text",
      "text": "# Battle of the Chernaya\n\n| result            = Allied victory\n| combatant1        = French Empire  (reserve troops)\n| combatant2        =\n| commander1        =  Aimable Pélissier Alfonso La Màrmora Giovanni Durando   Osman Nuri Pasha\n| commander2        =  Mikhail Gorchakov Pavel Liprandi\n| strength1         = 36,000:27,000 French9,000 Piedmontese10,000 Ottomans (reserve)\n| strength2         = 60,000\n| casualties1       = 1,800–1,900 casualties:&nbsp;1,700 French, 200 Sardinians250 killed1,550 wounded\n| casualties2       = 8,800 casualties:3,330 killed3,370 wounded1,500 captured\n| partof            = Crimean War\n}}\nThe Battle of the Chernaya (also Tchernaïa; Russian: Сражение у Черной  речки, Сражение у реки Черной, literally: Battle of the Black River) was fought at the Traktir Bridge on the Chernaya River during the Crimean War on August 16, 1855. The battle was fought between Russian,  French, Piedmontese and Ottoman troops. The Chernaya River is on the outskirts of Sevastopol, near the line of the allies' siege of the city.\nThe Russian attack was poorly organised and conducted, and was defeated by the numerically inferior allied forces under commanders A. Pélissier and A. La Marmora.\nM. Gorchakov personally participated in the heat of battle, but was unable to tilt the outcome in Russia's favor.\nPlanning\nThe battle was planned as an offensive by the Russians with the aim of forcing the Allied forces (French, British, Piedmontese, and Ottoman) to retreat and abandon their siege of Sevastopol. Tsar Alexander II had ordered his commander-in-chief in the Crimea, Prince Michael Gorchakov to attack the besieging forces before they were reinforced further.The Russian generals prepared a massive force: a 47,000-strong infantry, supported by a 10,000-strong cavalry, which were organized in 6 divisions: the IV, the V, the VI, the VII, the XII, the XVII, together with another division, the II, in reserve.The Tsar hoped that by gaining a victory, he could force a more favorable resolution to the conflict. Gorchakov did not think that an attack would be successful but believed the greatest chance of success to be near the French and Piedmontese positions on the Chernaya River. The Tsar ordered the hesitating Gorchakov to hold a war council to plan the attack. Many senior commanders were against the offensive. Dmitri Osten-Sacken, a notable commander of the November Uprising, was affected by Pavel Nakhimov's death and proposed leaving Sevastopol altogether and stopping the bloodshed. Most wanted to attack. Very radical measures were proposed by , who fought an unsuccessful action at Eupatoria in February. Khrulev proposed the complete destruction of Sevastopol (bettering the Moscow in 1812) followed by a mass storming of the allied position by every man available. When Osten-Sacken claimed that the doomed plan would lead to tens of thousands of unnecessary deaths, Khrulev responded: Well, so what? Let everybody die! We will leave our mark upon the map! In the end, Gorchakov himself decided that Sevastopol had to be saved by a decisive assault, \"otherwise Sevastopol would be lost.\" But Gorchakov refused to take responsibility in case of failure, as he wrote to Minister of War Vasily Dolgorukov, and will \"try to evacuate Sevastopol with as little loss as possible\" if there is a fiasco. The attack was planned for the morning of August 16 in the hope to surprise the French and Piedmontese as they had just celebrated the Feast day of the Emperor (France) and Assumption Day (Piedmontese). The Russians hoped that because of these feasts the enemy would be tired and less attentive to the Russians.\nThe battle\n'', Gerolamo Induno, 1857]]\n58,000 Russian troops in two army corps under Prince Michael Gorchakov fought against 36,000 French and Sardinian troops under French General Aimable Pélissier and Piedmontese General Alfonso Ferrero La Marmora. Ottoman forces—six battalions of infantry and one artillery battery—were commanded by  (Ottoman name \"Sefer Pasha\"). Although the British correspondents were amazed at the courageousness and impetuosity of the Russian attack, the assault was handicapped by poor organization and lack of experienced soldiers which, due to Sevastopol, forced their corps to consist mostly of militia.\nIn the cover of the morning fog, the Russians advanced towards Traktir Bridge with 47,000 infantry, 10,000 cavalry and 270 cannon under command of General Pavel Liprandi on the left and General  (the son of a Scottish engineer-immigrant) on the right. The two generals had been ordered by Gorchakov not to cross the river until given explicit orders. Annoyed that things weren't happening fast enough, Gorchakov sent a note to his generals with the words ''\"Let's start it.\"'' Read asked himself: \"What exactly should we start?\" which he also tried to find out from the aide-de-camp Lieutenant Krasovsky who had handed over the note; Krasovsky himself did not know; the artillery duel was already underway. By this, Gorchakov, possibly, only meant that the Russians should start to deploy their forces. His generals interpreted his words as his order to attack and they acted accordingly, although reserve forces were still en route to the battlefield.\nThe attacking Russians immediately met stiff resistance from the French. Only Liprandi's Russians were able to quickly push back the Sardinian posts from Telegraph Hill, but they could not achieve more. Read's forces crossed the river near the Traktir Bridge but without cavalry and artillery support, they were easily stopped by the French infantry and artillery on the slopes of the Fedyukhin Heights (Федюхины высоты): in 20 minutes, 2,000 Russian soldiers died on the spot. Read then ordered his reserve formation, the 5th Infantry Division, to attack the Heights but instead of launching a coordinated assault, he fed them piecemeal into the fray. Going in regiment by regiment, the assaulting reserve troops accomplished nothing. Seeing this, Gorchakov ordered Read to deploy the entire division against the French. This forced the French back up the hill but the Russians could not capture the Heights. In the following retreat General Read was killed. Upon the death of Read, Gorchakov took personal command of the right and ordered 8 battalions of Liprandi's left wing to reinforce the right wing. These forces came under fire from the Sardinians and were driven back. At 10 o’clock in the morning, Gorchakov concluded that the situation was hopeless and ordered a general retreat.\nThe bravery of Sardinian troops and the French soldiers of the 50th, 82nd, 95th, 97th of the line; the 19th Foot Chasseurs; and the 2nd and 3rd Zouaves was especially noted. The Sardinian troops' valiant effort at the battle was a contributing factor to their inclusion at the negotiation tables at the end of the war; it was there that the Kingdom of Sardinia began looking for the aid of other European nations towards the Unification of Italy. Sardinian general  died from wounds received in the battle.\nTolstoy\nRussian Count Leo Tolstoy was a participant in the Battle of the Chernaya River. He witnessed as the Russians crossed the river and started up the hillside in the morning sunlight. Tolstoy saw Russian soldiers being killed in clusters as shells exploded around them. Before the morning was over, the Russians were forced to retreat. They left thousands of their dead comrades behind. Tolstoy was depressed and angered by the slaughter. He believed much of it was due to incompetent generals and staff. Tolstoy vented his anger by composing a satiric stanza, an approximate translation of which reads:\nThe toppest brass\nSat down to meet\nAnd pondered long;\nTopographers\nLined paper black\nBut all forgot\nThe deep ravine\nThey had to cross!\nThis humorous song soon gained widespread popularity among the Russian soldiers, and is the only piece of verse Tolstoy is known to have written. The stanza from Tolstoy's song \"Гладко вписано в бумаге, Да забыли про овраги\" (\"It was smoothly written into the papers / But it was forgotten about the ravines\") entered as a catch phrase, in a slightly modified form \"Гладко было на бумаге...\" (\"It was\nsmooth on the paper, ...\").\nAftermath\nThe battle was a disaster for the Russians. Even with numerical superiority, the Russians had managed to lose the battle and suffer almost five times as many casualties as the Allies. Tsar Alexander had hoped for a Russian victory so that he could negotiate a peace with favorable terms. That hope was now lost. As a result of the slaughter that took place at the battle, the Russian soldiers had lost their trust in the Russian commanders and it was now only a question of time before the Russian army would be forced to surrender Sevastopol.\nCitations\nReferences\n*\n*\n* }}\n*\n*\n*\n*\n*\n*\n*\n*\nExternal links\n*"
    }
  ]
}