{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Giria\n\nThe Battle of Giria refers to two battles that took place in Giria, a census town in Bengal,  that were significant in the history of Bengal. The first occurred in 1740, arising due to a succession dispute in the Bengal Subah, while the second was fought between the East India Company and Mir Qasim in 1763, during the former's campaign in bengal.\nLocation\nLocated at  and within 10&nbsp;km from Jangipur on NH-34 close to where the river Ganges enters Bangladesh on one side; and within 10&nbsp;km in the Indian side of the Indo-Bangladesh border, Giria is located in the alluvial sediment plain if the river Padma, a distributary of the river Ganges and Bhagirathi.  It falls in the modern day district of Murshidabad in the state of West Bengal, India.\nBattles\nFirst Battle of Giria, 1740\nSarfaraz Khan\n| combatant2        = Alivardi Khan Governor of Azimabad (Patna)\n| commander1        =   Ghaus Khan  Haji Lutfullah  Sarfaraz Khan  Alam Chand (defected)\n| commander2        = Alivardi Khan Nandalal Nawazish Muhammad Khan\n| strength1         = 20,000 infantry10,000 cavalry20 artillery.\n| strength2         = 10,000 cavalry\n| casualties1       =\n| casualties2       =\n| image             = Battle of Giria march.jpg\n| caption           = First Battle of Giria march from Azimabad and Murshidabad.\n}}\nAlivardi Khan the then Subahdar of Azimabad was not satisfied with the position of Governor and had always harboured ambitions of becoming the Nawab of Bengal and had real ambitions of deposing Sarfaraz Khan. He was willingly aided and abetted in this treacherous activity by his brother Haji Ahmed.\nTo effect this, he required an imperial commission directed to himself, empowering him to wrest the three provinces out of the hands of the present viceroy, Sarfaraz Khan. After having dispatched these letters, he gave out that he intended marching against the zamindars of Bhojpur, and under that pretence he mustered his troops, which he always kept in constant readiness. At the same time, he had the art to give Sarfaraz Khan public notice of his project, though he in reality waited ready to avail himself of the first opportunity to effect his true purpose.\nHaji Ahmed and then Alivardi Khan entered the city and laying hold of the treasures, which were seventy lakhs in Cash and fifty crores in jewels, placed them in charge of Yeasin Khan. As Alivardi did not care to have more than one wife, the seraglio of Sarfraj Khan, including five hundred beautiful women, was taken possession of by his relatives, while the principal wife, with two sons, was sent by the Nawab to Dacca, with a scanty allowance for their support, from the revenue of the Khas Mahal (private estate) of Sarfraj Khan. His sister, Nafissa Begum (w/o Syud Reza Khan), condescended to the post of waiting-maid in the seraglio of Nawajesh Muhammad Khan, and thus contrived to save the son of her brother Aka Baba, whom she had adopted.\nEventually, ten months after Nadir Shah's departure for Persia, and just thirteen months after Shuja-ud-Din Muhammad Khan's death, he received the imperial commission, drawn up in the style he had requested. Being now resolved on marching against Sarfaraz Khan, he wrote secretly to Jagat Seth Fateh Chand that on a certain day he would commence his march. In March 1740; Alivardi Khan, set out for Murshidabad, on the context of expedition to Bhojpur, and encamped at some distance from the city of Patna.\nAlivardi Khan, in a message to Sarfaraz Khan, suggested that he was not marching on him but was arriving to pay homage to the Nawab. Initially satisfied, Sarfaraz Khan eventually decided to march on the head of his army and arrived at the town of Comrah on 9 April 1740. Alivardi, in the interim, secured the Teliagarhi pass and camped at Rajmahal. The Nawab's army was being led by a seasoned general, Ghaus Khan. Ray-Rayan, and Alam Chand also accompanied him. The rebel army was being led by Alivardi Khan with Nandalal and Nawazish Muhammad Khan as his deputies.\nThey opposing armies marched on to Giria (Battle of Giria), a village on the banks of the river Bhagirathi for a showdown on 26 April 1740.\nNawab Sarfaraz Khan commanded an army consisting of 20,000 infantry, 10,000 cavalry of which 4,000 were under his direct command, and 20 artillery pieces. Alivardi Khan commanded 10,000 cavalry including 3,000 Afghan cavalry, along with infantry and a number of guns.\nSecond Battle of Giria, 1763\nOn the first of August, 1763, the Bengal Army crossed Bansli river, and the following day was the start of the Second Battle of Giria against Mir Qasim's army. The battle was about a mile from the village of Giria. After his losses in Katwa, Mir Qasim, determined to fight a decisive battle, assembled his troops at Suti. This position was naturally strong and artificial as entrenchments covered the whole front. Using his superior numbers to his favor, Mir Qasim ordered a heavy cavalry assault on the Company's left flank. This attack was headed by Mir Badr ud din who managed to drive the battalion into the Bansali river. This gap in the Bengal Army's formation left their 84th Regiment to be attacked from the front and back.\nMajor Adams would bring up reserves from Major John Carnac, who was handling the right wing and managed to send reinforcements to them. The 84th freed themselves from Mir Badr ud din's cavalry troops and recovered their guns. With Mir Badr ud din getting wounded in battle and his troops weakened, Adams seized the opportunity and charged in for another attack. The exchange would result in a victory for Major Adams, with Mir Qasim's army falling back to the fortified hilltop of Udhua Nullah.\nReferences"
    }
  ]
}