{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Birten\n\nThe Battle of Birten was a 10th century battle important to East Frankish (German) king Otto I's effort to secure his power in the early years of his reign.  The battle took place in March 939 on the left bank of the Rhine at Birten, near the town of Xanten, which now lays in North Rhine-Westphalia in Germany.   In this battle, Otto defeated the troops of his brother-in-law, Gilbert, Duke of Lorraine, who had aligned with Otto's younger brother Henry in Henry's fight for control of the kingdom.  Along with the Battle of Andernach, which Otto fought against Duke Eberhard of Franconia and Gilbert later that same year, the Battle of Birten paved the way for Otto to assert his royal power over his rivals in the kingdom.\nBackground\nOtto, due to his father Henry the Fowler's abandonment of the prior Carolingian rule of division of the kingdom among sons, ascended to the throne as his father's chosen successor on August 7, 936 at Aachen Cathedral.  He was confronted with numerous conflicts within the Old Saxon royal family and East Francian nobility, and thus faced a number of looming crises in the first five years of his reign.\nOtto's older half-brother Thankmar, being deprived of the crown and also frustrated when Gero was appointed by Otto to rule the Saxon Eastern March in 938, struck an alliance with Duke Eberhard of Franconia and Duke Eberhard of Bavaria against Otto.  Wichmann the Elder also rebelled because his younger brother Herman had been given military command of the northern reaches of the Duchy of Saxony over him, though he later reconciled with Otto.  Thankmar was besieged by Otto at Eresburg, and although he tried to surrender on July 28, 938, was killed by a soldier named Maincia.  Otto mourned for Thankmar, but had his followers killed.\nBattle\nSoon afterwards, Otto's brother Henry also began to revolt, aligning himself with Duke Eberhard of Franconia, Gilbert, Duke of Lorraine, and other nobles.  When Otto learned that Henry and Gilbert had positioned themselves across the Rhine, he first went with his forces to Dortmund, and sent the fortress's commander (or Burgvogt) named Agina to Henry to try to persuade him to give up.  When this failed, Otto and his troops went to the Rhine to confront him.\nSince Otto only had a few boats, he could only move his troops gradually across the Rhine.  This was a problem.  While Otto and most of his forces were still on the right (east) bank of the river, Otto's advance guard which had already crossed was now at high risk of an attack by a much larger force.  According to the account of Liutprand of Cremona, Otto realized he would be unable to bring all his troops across the river before the battle started, and recalled the Biblical story of Moses praying for help when the Israelites were facing the Amalekites.  Otto then threw himself before the Holy Lance he was carrying (believed to be the lance that pierced the side of Jesus as he hung on the cross), and prayed for help.\nAccording to Widukind of Corvey, a ruse helped lead to victory for Otto.  Using the protection offered by an oxbow of the Rhine which prevented the Lotharingian forces from a direct attack on Otto's forces that had already crossed, those forces split into two parts.  One group, on horseback, rode to the back of the enemy and surprised them.  Some of these Saxon troops knew Old French, and shouted to their French-speaking opponents that they should flee.  In the confusion of battle, the Lotharingian forces did not realize these calls came from their opponents, and they did soon flee.  During the battle, Otto and the rest of his troops crossed the river and pursued the enemy.\nOtto's brother Henry was wounded in the battle and retreated to Saxony.  To prevent a revolt there, Otto pursued him and spread claims that Henry had died so that many castles that Henry had previously taken would return to Otto's fold.   According to Widukind, the soldier who had killed Thankmar died in the Battle of Birten.\nReferences\nSources\n* Karl Ferdinand Werner: Birten, Schlacht bei (939). In: Lexikon des Mittelalters. Volume 2 (1983), p.&nbsp;226.\n* Helmut Hiller: Otto der Große und seine Zeit. List, München 1980, p.&nbsp;4.\n* Widukind of Corvey: The Deeds of the Saxons Book 2 ([https://www.digitale-sammlungen.de/de/view/bsb10800556?page=69])."
    }
  ]
}