{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Piacenza (217 BC)\n\ntemplate -->\n| map_type    =\n| map_relief  =\n| map_size    =\n| map_marksize =\n| map_caption =\n| map_label   =\n| territory   =\n| result      = Indecisive\n| status      =\n| combatants_header =\n| combatant1  = Roman Empire\n| combatant2  = Carthaginian Empire\n| combatant3  =\n| commander1  = Tiberius Sempronius Longus\n| commander2  = Hannibal Barca\n| commander3  =\n| units1      =\n| units2      =\n| units3      =\n| strength1   = 10,000\n| strength2   = 12,000 Infantry, 5,000 Calvalry\n| strength3   =\n| casualties1 = ~900\n| casualties2 = ~900\n| casualties3 =\n| notes       =\n| campaignbox =\n}}\nThe Battle of Piacenza, which took place in January 217 B.C. during the Second Punic War, represented a double clash of secondary importance between the army of the consul Tiberius Sempronius Longus and the Carthaginian army led by Hannibal. This occurred following Hannibal's victories at the Ticinus.\nBackground\nIn December 218 B.C., approximately ten thousand Romans who survived the defeat at the Trebia retreated to the fortified city of Piacenza, They successfully defended the city against an attack by Hannibal's cavalry.\nBattle\nAfter a brief wintering, Hannibal, unable to cross the Apennines due to harsh weather, returned to Piacenza, where Consul Tiberius Sempronius Longus had recently arrived. Hannibal deployed with twelve thousand infantry and five thousand cavalry. The consul left the city, initiating the battle. Initially, the Romans had the advantage, pushing the Carthaginians back into their camp and beginning a siege. Hannibal, leaving only a few troops in the entrenchment, regrouped the majority toward the center with orders not to move. Frustrated in their attempts to take the camp by force, the Romans eventually withdrew. Hannibal counterattacked with cavalry on both flanks and personally led his elite troops in the center. A bloody combat ensued, halted by nightfall.\nAftermath\nAccording to Livy, the losses were balanced, with 600 infantry and 300 cavalry casualties on each side. However, the Romans suffered the loss of several knights, five military tribunes, and three allied prefects. Following this inconclusive clash, both parties abandoned the Po Valley. Sempronius retreated to Lucca, while Hannibal headed to Liguria.\nReferences"
    }
  ]
}