{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Morgarten__disambig_1\n\nSwiss victory\n| combatant1  =\n*  Forest Cantons (Swiss Confederacy):\n**  Schwyz\n**  Uri\n**  Unterwalden\n| combatant2  =  Duchy of Austria\n| commander1  =  Werner Stauffacher\n| commander2  =  Leopold I, Duke of Austria\n| strength1   =  ~1,000 (Schwyz)\n| strength2   =  ~2,000–3,000\n| casualties1 =  Minimal\n| casualties2 =  Hundreds\n}}\nThe Battle of Morgarten took place on 15 November 1315, when troops of Schwyz, supported by their allies of Uri and Unterwalden, ambushed an Austrian army under the command of Leopold I, Duke of Austria on the shores of Lake Ägeri, in the territory of Schwyz.\nAfter a brief close-quarters battle, the Austrian army was routed, with numerous slain or drowned. The Swiss victory consolidated the League of the Three Forest Cantons, which formed the core of the Old Swiss Confederacy.\nBackground\nToward the end of the 13th century the House of Habsburg coveted the area around the Gotthard Pass, as it offered the shortest passage to Italy. However, the Confederates of Uri, Schwyz and Unterwalden, which had formalized the Swiss Confederacy in 1291, held imperial freedom letters from former Habsburg emperors granting them local autonomy within the empire. In 1314 tensions between the Habsburgs and Confederates heightened when Duke Louis IV of Bavaria (who would become Louis IV, Holy Roman Emperor) and Frederick the Handsome, a Habsburg prince, each claimed the crown of the Holy Roman Emperor.\nThe Confederates supported Louis IV because they feared the Habsburgs would annex their lands (which they had tried to do in the late 13th century). War broke out after the Confederates of Schwyz raided the Habsburg-protected Einsiedeln Abbey.\nThe conflict with Einsiedeln had begun when settlers moved from Schwyz into unused parts of the territories claimed by Einsiedeln. The settlers cleared the primal forest and established farms or pastures. The abbot of Einsiedeln carried his complaint to the bishop of Constance, who moved to excommunicate Schwyz.\nAs revenge, men of Schwyz under the leadership of Werner Stauffacher raided Einsiedeln abbey on the night of 6 January 1314. They plundered the monastery, desecrated the church, and took several monks as hostages. The abbot managed to escape to Pfäffikon, from where he alerted the bishop. The bishop reacted by including Uri and Unterwalden in the excommunication.\nBattle\nFrederick's brother, Habsburg duke Leopold of Austria, led a large army to crush the rebellious Confederates.\nJohannes von Winterthur's chronicle of the battle puts the Habsburg forces at 20,000, although that number is likely an exaggeration.\nA 19th century account by Rudolf Hanhart states that there were 9,000 men in the Habsburg army.\nHistorian Hans Delbrück estimated in 1907 that the Habsburg army consisted of only 2,000–3,000 men, but that these were mainly well-trained and -equipped knights. Delbrück's view is shared by Kelly DeVries.\nThe Confederates of Schwyz were supported by the Confederates of Uri and Unterwalden.\nThe size of the Confederate force is unknown, with estimates ranging from 1,500 to around 3,000-4,000.\nRegardless of  numerical considerations, the main contrast between the two forces was that a well-equipped and trained medieval army was meeting an improvised militia of farmers and herdsmen.\nAccording to the 15th-century Swiss chronicles, Leopold upon reaching Ägeri debated with his nobles how to best invade Schwyz, with several possible routes under consideration. After the decision was taken to take the direct approach, marching to Sattel from the north, Leopold is said to have asked his court jester, one Cuoni von Stocken, for his opinion. The fool expressed misgivings, quipping that \"you have all deliberated on how to reach that land, but none of you deliberated how you will get out again\".\nIn order to hide his intentions to attack from the north, Leopold sent a number of smaller detachments in order to create diversions. One such attack was sent to Arth, attacking from the northwest, one from Entlebuch attacking Unterwalden from the north, one from Lucerne attacking Schwyz from the west across Lake Lucerne, and one under the command of count Otto von Strassberg was sent across Brünig Pass to Obwalden. When news of the Habsburg defeat at Morgarten reached von Strassberg, he decided to turn back. He was reportedly injured on the retreat and died from his wounds soon after.\nAccording to Konrad Justinger's chronicle, written c. 1430, the people of Schwyz were warned by their neighbours, the lords of Hünenberg.\nThe warning is said to have been delivered by the means of arrows fletched with parchment, with the message written on the fletching, \"beware near Morgarten\" (hütend üch am morgarten), thus indicating the route chosen by Leopold for entering Schwyz.\nUpon receiving this warning, the men of Schwyz, with the support of 600 men of Uri and Unterwalden, hurried to Sattel to intercept the enemy. Between Lake Ägerisee and Sattel, where a small path led between a steep slope and a swamp, they prepared an ambush.\nThe marching army would have been stretched out in a column of some 2&nbsp;km along the path when the vanguard encountered a roadblock near Schafstetten.\nThe Confederates attacked the column, frightening the horses by throwing rocks from above and engaging the mounted knights with halberds.\nAbout 1,500 men were said to have been killed in the attack; according to Johannes von Winterthur (writing ca. 1340), this number does not include those drowned in the lake.\nAccording to Karl von Elgger, the Confederates, unfamiliar with the customs of battles between knights, brutally butchered retreating troops and everyone unable to flee. He records that some infantry preferred to drown themselves in the lake rather than face the brutality of the Swiss.\nThe earliest mentions of the battle, in chronicles of the 14th century, identify it as having taken place in the land of Schwyz, or Schwyz and Uri (Peter of Zittau has Sweicz et Uherach).\nThe name of Morgarten is recorded by Konrad Justinger in the context of the written warning attached to arrows. The toponym Morgarten originally refers to an alpine pasture near  (now Chli Morgarten). The name translates to \"pig corral\", \"enclosure for swine\".\nThe entire passage between Lake Ägeri and Sattel is now known as Morgarten, but this is in reference to the battle.\nUse of halberds\nThere is some evidence to suggest that the attack at Morgarten involved the first recorded use of halberds against knights, the weapon that would become iconic of the Old Swiss Confederacy.\nMatthias of Neuenburg writing in Latin around 1350 uses the term jesa to describe a type of polearm used by the Confederates; this has been interpreted as referencing an early form of the halberd.\nKonrad Justinger, writing in German in c. 1430, cites the use of halberds explicitly: \"the Swiss held in their hands certain most terrible murder weapons, known in the vernacular as helnbarten, by means of which even the best armed opponents were cut apart as with a razor blade, and hacked to pieces: this was no 'battle', but, for the reasons mentioned, so to speak a mere butchering of the men of duke Leopold by those mountain dwellers, as with a herd led to slaughter\".\nIn the assessment of John Guilmartin, writing for Encyclopædia Britannica (2015, s.v. \"Military technology\", section \"The infantry revolution, c. 1200–1500\"):\n}}\nAftermath\nof 1547]]\nWithin a month of the battle, in December 1315, the Confederates renewed the oath of alliance made in 1291, initiating a period of growth within the Confederacy. In March 1316 Emperor Louis IV confirmed the rights and privileges of the Forest Cantons. However, Leopold prepared another attack against the Confederacy. In response, Schwyz attacked some of the Habsburg lands and Unterwalden marched into the Bernese Oberland. Neither side was able to prevail against the other, and in 1318 the isolated Forest Cantons negotiated a ten-month truce with the Habsburgs, which was extended several times. By 1323 the Forest Cantons had made alliances with Bern, and Schwyz had signed an alliance with Glarus for protection from the Habsburgs. Within 40 years cities including Lucerne, Zug and Zürich had also joined the Confederacy. The Confederate victory gave them virtual autonomy and, for a time, a peace with the Habsburgs that lasted until the Battle of Sempach in 1386.\nCommemoration\nAs the first military success of the Confederacy, Morgarten became an important staple of\nSwiss patriotism in the early modern period.\nRecords of formal commemorations of the battle go back to the 14th century;\nJohannes von Winterthur in the 1340s records the decision of Schwyz to hold a yearly commemoration. The existence of a chapel at the site of the battle is recorded in 1501.\nWriting in 1530, Joachim Vadian suggests that the first such chapel may have been built immediately after the battle, with the proceeds from the spoils. The modern chapel dates to 1604.\nIn 1891, in the context of the 600-years anniversary of the Confederacy, plans were made to erect a new memorial at the site of battle.\nThere was some dispute as to the appropriate location (not least because the \"battle\" was an attack on a marching column stretched out for some 2 kilometres), with both the cantons of Schwyz and of Zug claiming the site of the battle.\nA monument was eventually inaugurated in 1908 at the southern shore of Lake Ägeri, in the village of Hauptsee, in the canton of Zug. On this occasion, the village was renamed to \"Morgarten\" (part of Oberägeri municipality). The authorities of Schwyz refused to acknowledge a site of the battle outside of their territory and did not send any official representation to the monument's inauguration ceremony.\nSince 1912, a yearly target shooting event has been held on the day of the battle in the vicinity of the monument, the Morgartenschiessen. The competition is over the distance of 300m. In addition, a pistol competition over a distance of 50m was introduced in 1957, taking place in the territory of Schwyz, near the battle chapel.\nA large celebration for the 600-year anniversary of the battle was organised in 1915, held in two locations at the chapel and the monument.\nIn the context of the 650-year anniversary in 1965, efforts were made to preserve the site of the battle. Money was raised for the canton of Schwyz to buy up private land in the area.\nFelicia Hemans's poem Song of The Battle of Morgarten was published in The Edinburgh Magazine in 1822.\nSee also\n*Battles of the Old Swiss Confederacy\nReferences\nBibliography\n*\nFurther reading\n*\n* Magill, Frank N. Great Events from History: Ancient and The medieval Series, Volume 3:951–1500 (1972), pp.&nbsp;1603–1607, historiography\n* Winkler, Albert (2008). [https://scholarsarchive.byu.edu/sahs_review/vol44/iss3/3/ \"The Battle of Morgarten in 1315: An Essential Incident in the Founding of the Swiss State,\"] Swiss American Historical Society Review, vol. 44, no. 3, pp.&nbsp;3–25."
    }
  ]
}