{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Jeddah (1925)\n\n| combatant2        = Support: United Kingdom Mandatory Iraq\n| commander1        =  Abdulaziz bin Saud Sultan bin Bajad Eqab bin Mohaya\n| commander2        =  Hussein bin Ali' Ali bin Hussein Shirokoff\n| strength1         = 6,000 men\n| strength2         = 1,650 men8 combat aircraft40 artillery30 machine gunsSome combat tanks\n| casualties1       = Unknown\n| casualties2       = Unknown killed5 combat tanks1 combat aircraft\n}}\nThe Battle of Jeddah or the siege of Jeddah took place in 1925, as part of the Abdulaziz Ibn Saud's campaign to conquer the Kingdom of Hejaz. Jeddah was the last major stand of the Hashemites against the Saudis.\nOverview\nFollowing the fall of Mecca to Ibn Saud in early December 1924, King Ali bin Hussein moved back to Jeddah, trying to defend it against the Nejd Army. Ali's remaining Sharifian Army started to build fortifications around the city and place mines. Ali requested help and supply from his brothers, Emir Abdullah of Transjordan and King King Faisal of Iraq. They both supplied Ali with arms and men. Also, Ali's two old airplanes were not enough for the impending battle so he bought five aircraft from Italy and several tanks from Germany.\nRegardless, Ali could not stand for long. The nearby clans were Ibn Saud's allies. The supplies from Aqaba traveled slowly to Jeddah, besides he had only two pilots, one of whom died during the battle. Eventually, the chiefs of Jeddah decided to surrender the city to Ibn Saud, while King Ali escaped to Baghdad over the Red Sea. The siege ended on 23 December 1925 (1343 A.H.).\nConsequently, Ibn Saud was declared the new King of Hejaz. The following year, Ibn Saud merged the Hejaz with the Nejd as one state, the Kingdom of Hejaz and Nejd.\nSee also\n* Battle of Jeddah (1813)\n* History of Saudi Arabia\nNotes and references\nBibliography\n* Al-Harbi, Dalal: King Abdulaziz and his Strategies to deal with events: Events of Jeddah. 2003, King Abdulaziz national library. ."
    }
  ]
}