{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Jezzine (1982)\n\nIsrael\n| combatant2        =  Syria\n| combatant3        =\n| commander1        =  Lt. Col. Sefi Schauman Lt. Col. Benny Lidor Col. Hagai Cohen Capt. Tzur Maor\n| commander2        =  Hafez al-Assad Mustafa Tlass\n| commander3        =\n| strength1         = 2 tank battalionsA reconnaissance companyAn engineering platoon\n| strength2         = 1 battalionSeveral commando companies\n| strength3         =\n| casualties1       = 6 dead11 wounded4 tanks destroyed5 tanks damaged(Israeli claim)10 tanks destroyed/damaged(Syrian claim)\n| casualties2       = 20 tanks destroyed4 tanks damaged3 armoured vehicles destroyed1 commando unit destroyed\n| casualties3       =\n| notes             =\n}}\nThe Battle of Jezzine was fought on June 8, 1982 between the Israeli Army and the Syrian Army in the Lebanese town of Jezzine. It was the first battle between Israel and Syria in the 1982 Lebanon War. It resulted in Israel capturing the town.\nPrelude\nJezzine was considered strategically important due to its location near a junction in which one road passed through the town and led to the southern Beqaa Valley and the other led north to Jebel Baruk, passing west of Lake Qaraoun. Menachem Einan's division was driving down a road that ended in a fork west of Jezzine and had to pass through the town. Control of both the town and the junction would have given the IDF access to the southern Beqaa Valley from the west. The Syrian 424th Infantry Battalion was stationed in the town. On June 7, Syria detected an Israeli division advancing north and sent several commando companies and a tank battalion to ambush the Israelis on their way to Jezzine.\nOn the night of Tuesday June 8, Israeli Defense Minister, Ariel Sharon, said at a meeting in the Northern Command headquarters \"We know today that there will be a direct confrontation with the Syrians\" and argued that it would be best to move deeper into Lebanon. He said to the other officers that \"We have to build a context because we know that tomorrow we will take on the Syrians\". Israel was not yet aware that a reduced Syrian battalion of tanks and a commando unit had joined the defending forces in Jezzine.\nEinan was ordered to reach the main highway as quickly as possible. He avoided the crossroads as he closed in on the town at 1:00 AM on Tuesday, June 8. He left a blocking force behind as he pushed north. The blocking force spilled over the slope above the town and opened fire on the Syrians. It did not assault the town, but a battle ensued and the IDF lost two tanks. Meanwhile, an Israeli drone had discovered a Syrian force moving south through the Shouf Mountains toward Jezzine. Israeli Air Force planes accurately attacked that Syrian force. The Syrian surface-to-air missiles (SAMs) were not activated against them.\nBattle\nIsraeli Merkava tank of Captain Tzur Maor passing two [[T-62 tanks which he destroyed, near Jezzine, a few minutes before Maor was killed when the tank was ambushed]]\nThe 460th Armor Brigade, under Colonel Hagai Cohen's command, had crossed the Litani River on the Hardele Bridge on Monday, June 8. It was supposed to follow the column headed for the Beirut-Damascus Highway. After the Syrian force moving south was detected, it was ordered to change course and move east through Jezzine. At that point, Hagai Cohen was convinced that a fight with the Syrians was imminent. Shortly after 1:30 PM, Major General Avigdor Ben-Gal, commander of the eastern sector, ordered Cohen to prepare for an attack on the town. Cohen had no artillery or infantry. He tried to get Einan's artillery officer to send him an artillery unit, but by 2:00 PM Ben-Gal ordered him to attack immediately.\nOne tank company of 198th Battalion waited on the outskirts of the town while another moved up the main street. When it reached the center of town, it was assaulted by RPGs and grenades from several buildings. The company made it across town and destroyed three T-62 tanks stationed to block the exit. The former company was attacked by Syrian commandos using Sagger missiles, who knocked out three tanks. The company retreated. The Israeli battalion was now split between the two sides of town while the Syrians were firmly positioned in it.\nAt this point, Col. Cohen sent his second battalion, the 196th, to the front. One of its companies entered the town, but then it took a wrong turn at a fork in the road and reached a dead end. It was now positioned in a high commanding area, but exposed to Syrian armor fire behind the opposite ridge, southeast of the town. In a few minutes, two of its tanks were lost, but the company continued to provide cover fire from the ridge for the rest of the force. The other companies continued fighting the Syrians, until the company which entered the town had reached the nearby village of Huna. On the way there, the tank commanded by Captain Tzur Maor, the company commander, destroyed six Syrian T-62 tanks, which were well positioned and ambushed around each corner of the winding road. Maor's tank was then knocked out by a Syrian tank and he was killed. The Syrian tank was subsequently destroyed by the Israelis. Jezzine had fallen by nightfall. During the night, the armor crews, not being trained in infantry warfare, were fighting until dawn against dozens of Syrian commando troops trying to attack the tanks. The commando teams were destroyed without further casualties to the Israelis that night.\nAftermath\nSyrian President, Hafez al-Assad, was convinced that the Israelis were lying when they said they were only interested in striking at the Palestine Liberation Organization (PLO), and were in fact interested in fighting Syria. He decided to speed up the deployment of the 3rd Armored Division in the Beqaa Valley, and sent additional commando battalions to Lebanon.\nOn Tuesday afternoon, Syria sent five additional SAM batteries into Lebanon, bringing the system to a total of nineteen. Israel saw the fact that those SAMs were brought to Lebanon from the Golan Heights as a sign that Syria was not interested in expanding the war. The Israeli Air Force considered this to be an encouraging sign, and decided to launch Operation Mole Cricket 19.\nNotes\nReferences\n*\n*"
    }
  ]
}