{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Bayona Islands (1590)\n\nDutch Republic\n|combatant2=\n|commander1=Unknown\n|commander2=Pedro de Zubiaur\n|strength1=14 ships\n|strength2=3 flyboats\n|casualties1=14 ships captured (7 ships boarded)(Flagship boarded and captured)\n|casualties2=Unknown\n}}\nThe Battle of Bayona Islands, also known as the Battle of Bayona Bay, was a naval engagement that took place in early 1590, off Bayona Islands (present-day Cíes Islands), near Bayona (or Baiona) and Vigo, Spain, between a small Spanish naval force commanded by Captain Don Pedro de Zubiaur, and an Anglo-Dutch flotilla of 14 ships, during the Eighty Years' War, and in the context of the Anglo-Spanish War (1585–1604) and the French Wars of Religion. After several hours of hard combat, the Spanish naval force composed of three flyboats achieved a great success, and the Anglo-Dutch fleet was totally defeated. The flagship of the Dutch was boarded and captured, including another six ships more. Finally, the rest of the Dutch fleet was forced to surrender. Shortly after, Pedro de Zubiaur arriving at Ferrol, along with the captured ships, with great surprise for the Spanish authorities of the port.\nSee also\n* Cies Islands\n* English Armada\n* Battle of the Strait of Gibraltar (1590)\n* Siege of Rheinberg (1586–1590)\n* French Wars of Religion\n* Anglo-Spanish War (1585–1604)\nNotes\nReferences\n* Arsenal, León./Prado, Fernando. Rincones De Historia Española. Editorial EDAF S.L. Madrid 2008.\n* Fernández Duro, Cesáreo (1898). Armada Española desde la unión de los reinos de Castilla y Aragón. Vol. III. Instituto de Historia y Cultura Naval. Madrid.\n* [https://books.google.com/books?id=h5sEAAAAQAAJ Extractos de las juntas celebradas por la Real Sociedad Bascongada de los amigos del país, en la villa de Bilbao por julio de 1790.] Vitoria. 1790.\n* Gracia Rivas, Manuel. [http://www.untzimuseoa.net/images/itsas_memoria_05/11graciarivas.pdf En el IV Centenario del fallecimiento de Pedro Zubiaur, un marino vasco del siglo XVI]. Itsas Memoria. Untzi Museo Naval. San Sebastián 2006.\n* Rodríguez González, Agustín Ramón (2006). Victorias por Mar de los Españoles. Biblioteca de Historia. Grafite Ediciones. Madrid.\nExternal links\n* [https://web.archive.org/web/20161030010505/http://blog.todoavante.es/?p=3904 Biografía de Don Pedro de Zubiaur]"
    }
  ]
}