{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Amritsar (1634)\n\n| place             = Near Amritsar\n| coordinates       =\n| map_type          =\n| latitude          =\n| longitude         =\n| map_size          =\n| map_caption       =\n| map_label         =\n| territory         =\n| result            = Sikh victory\n| status            =\n| combatant1        =  Akal Sena (Sikhs)\n| combatant2        =  Mughal Empire\n| commander1        =  Guru Hargobind  Bhai Bidhi Chand  Bhai Kirat BhattBhai BhannoBhai Peda DasRao BalluPainde KhanSingha PurohitBhai Mohna\n| commander2        = Mukhlis KhanShamas KhanMurtaza KhanMustafa KhanAnwar KhanSultan BegSayyad Muhammad Ali\n| units1            = 700\n| units2            = 7,000\n| units3            =\n| notes             =\n}}\nThe Battle of Amritsar was fought during Mukhlis Khan's campaign against Guru Hargobind and the Sikhs on 14 April 1634. The battle took place over two days and was a result of increasing tensions between the Mughal government and Guru Hargobind.\nBackground\nAfter persecution from the Mughal government the Sikhs began organizing regular training exercises and became a rallying point for people disaffected by the Mughals. Increasing tensions erupted during a clash between a group of Sikh and Mughal hunting parties. On Vaisakhi day, a hunting party of Sikhs set their hawk upon an imperial hawk and brought it down. When the Mughal hunting party came to retrieve their hawk they used abusive language and the Sikhs then refused to part with it. This altercation led to blows and the Mughals were forced to leave after   two Mughals were killed and the leader of the hunting party, Faujdar Ghulam Rasul Khan, was injured.  The  incident with the hunting parties was used as an excuse to send out 7,000 soldiers with Mukhlis Khan to attack Guru Hargobind. The Sikhs were unprepared to face the Mughal force because of the impending marriage of Guru Hargobind's daughter.\nBattle\nThe battle took place at Amritsar over two days. The day before the Mughals attacked, the Sikhs received information that they would be attacking and evacuated Lohgarh, a small mud fort on the outskirts of the city, except for a small garrison.\nThe second day of the battle saw fierce fighting where Khalsa College, Amritsar is located now. Bhai Bhanno was killed in the fighting and Guru Hargobind took up command when he died.  The battle ended when Mukhlis Khan's head was \"cleft in twain\" by a blow from Guru Hargobind.\nAftermath\nThis was the second conflict between the Mughals and Sikhs and legitimized the affirmation of Guru Hargobind's efforts to militarize his followers. First two battles of Sikh's were Battle of Rohilla (1621) against a Khatri resulting in Sikh victory and Battle of Sangrana (1628) against Mughals resulting in Sikh victory (first of many Sikh battle against Mughals), followed by the Battle of Amritsar (1634) against Mughals with another Sikh victory (second battle against Mughals). All these battles were fought by the Akal Sena founded by the Guru Hargobind.\nIn addition, the Sikh victory destroyed the idea of Mughal invincibility and increased the Guru's support among peasants in Punjab.\nBhatt Kirat and Balu (son of Baba Mula) were killed in this battle fighting on the Sikh side.\nReferences\nSources\n*\n*\n*\nExternal links\n*"
    }
  ]
}