{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Laukkai\n\n| date              = 15 November 2023 – 5 January 2024()\n| place             = LaukkaiLaukkaing TownshipChina-Myanmar border\n| coordinates       =\n| territory         = MNDAA captures Laukkai and surrounding areas\n| result            = MNDAA victory\n| combatant1        =  State Administration Council\n* Kokang Military Administration Committee\n* Border Guard Force 1006\n| combatant2        =  Myanmar National Democratic Alliance Army and allied forces\n| commander1        =  Min Aung Hlaing\n*  Tun Tun Myint\n*  Bai Suocheng}}\n*  Col. Wei Huairen}}\n*  Maj. Yang Xiaojian}}\n}}\n| commander2        =  Peng Daxun\n}}\n| units1            =\n*\n**  Northeastern Command\n***  55 LID\n*\n*  Border Guard Force\n| units2            = Three Brotherhood Alliance:\n*  Myanmar National Democratic Alliance Army\n*  Arakan Army\n*  Ta'ang National Liberation Army\n| strength1         = 2,400+\n| strength2         = Unknown\n| casualties1       = 90+ killed2,479 surrendered.\n| casualties2       = Unknown\n| casualties3       = 8+ civilians killed, 25+ injured.\n| notes             =\n| campaignbox       =\n}}\nThe Battle of Laukkai was a military offensive conducted by the Myanmar National Democratic Alliance Army (MNDAA) encircling and capturing Laukkai, the capital of the Kokang Self-Administered Zone (Kokang SAZ) in northeastern Myanmar. The battle was part of the larger Operation 1027, a joint military operation conducted by the Three Brotherhood Alliance coalition of three ethnic armed organisations and part of the overall renewed civil war in Myanmar.\nChinshwehaw, a key border town and main entrypoint into Kokang on the Lashio-chinshwehaw Road was seized on the first day of Operation 1027. In the second half of November, the MNDAA encircled the town of Laukkai taking several key outposts. They began attacking in southeastern Laukkai city on 1 December. On 3 December, they captured the Four Buddhist Statues Hill capturing all territory south of Laukkai. There was a brief respite in fighting in mid-December as peace talks were attempted. They were unsuccessful and on 18 December, fighting resumed north of Laukkai. The MNDAA captured key border towns and gates on 19 December and began pushing into the city.\nOn 26 December, the Tatmadaw's military and the Border Guard Forces led by Bai Suocheng in Laukkai surrendered to the MNDAA. By 28 December, the MNDAA had taken control of most of the city. Remaining junta personnel surrendered on 4 January and up to 1000 personnel evacuated to Lashio.\nBackground\nKokang and Myanmar's civil war\nAfter the collapse of the Communist Party of Burma in 1989, Kokang became the autonomous First Special Region in Shan State. The MNDAA, then led by Peng Jiasheng, took control of the region and signed a\nceasefire with Myanmar's armed forces, the Tatmadaw. In 2009, the Tatmadaw asked MNDAA to become a Border Guard Force under the army's direction. The MNDAA refused, and the armed forces ousted the group and took over the region during the 2009 Kokang incident. In 2015, the MNDAA launched the 2015 Kokang offensive, causing the area to enter a state of emergency and a three-month period of martial law in response to fighting.\nAfter renewed civil war following the 2021 Myanmar coup d'état, the MNDAA's close ally the Arakan Army entered a ceasefire in November 2022. A few days later, the State Administration Council military junta attacked the MNDAA using heavy weapons on a base near Chinshwehaw by the Chinese border. This assault continued into 2 December, reportedly sending 500 junta soldiers.\nOperation 1027\nBy October 2023, the Myanmar military found its resources increasingly strained following two years of persistent anti-junta efforts across various regions of Myanmar. On 9 October, the military attacked a base, escalating the conflict with the Kachin Independence Army (KIA) one of the MNDAA's close allies and third part of the Three Brotherhood Alliance. At the same time, fraud factories along the Chinese border had become a large issue with the junta working with Chinese gangs to traffic over 120,000 people into Myanmar and earning billions of dollars in revenue for the junta. To exert pressure, China worked actively with the Three Brotherhood Alliance to extricate and arrest Chinese citizens involved.\nThe Three Brotherhood Alliance declared the start of Operation 1027, on 27 October 2023 with the primary objectives of safeguarding civilians, asserting self-defence rights, maintaining control over territory, responding to artillery attacks and airstrikes, eradicating military rule and combating the widespread online gambling fraud.\nInternational observers have pointed to the influential role of China as a key factor in the operation's launch, while others have cautioned against reducing the motives of the rebels to simply an extension of China's wishes. Analysts have highlighted that the cooperation between the PDFs and EAOs during Operation 1027 is a continuation of Myanmar's Spring Revolution, countering narratives that attribute its formation to Chinese influence.\nand Myanmar]]\nOn the first day of Operation 1027, the MNDAA seized control of the border town of Chinshwehaw and blocked the Lashio-Muse Highway and Lashio-Chinshwehaw Road to prevent the regime from bringing reinforcements along these routes. On 1 November, the junta detained over 200 foreign nationals in a border guard post near Laukkai as leverage to prevent the growing Three Brotherhood Alliance presence from attacking the city or its key military outposts. On 12 November 2023, 127 junta soldiers from the 129th Infantry Battalion stationed in Laukkai and their family members surrendered to the MNDAA within the city. On the same day, martial Law would be declared across northern Shan State, including in Laukkai Township. The State Administration Council further announced that junta-aligned Kokang SAZ chairman Myint Swe would be temporarily replaced by Brigadier General Tun Tun Myint. Tun Tun Myint was previously the commander in charge of northern Shan State operations. The move was suggested to be in anticipation of Operation 1027 moving towards Laukkai.\nBattle\nInitial fighting\nOver the second half of November, the MNDAA encircled the city by capturing a number of junta outposts. The junta found it difficult to retain its foothold after losing Chinshwehaw, which was a key entry point into the Kokang SAZ along the main Lashio-Chinshwehaw road. The Chinese embassy in Yangon urged citizens to leave Laukkai and the city was mostly deserted by 1 December. On 1 December, the MNDAA started penetrating the Tong Chain neighbourhood in southeastern Laukkai and focused fire on military targets as hundreds of civilians still remained trapped in the city.\nOn 3 December, the MNDAA attacked the military's outpost on Four Buddhist Statues Hill immediately south of Laukkai. The battle lasted eight hours as the junta had a substantial presence on the hilltop base. This was the last junta outpost between the Brotherhood Alliance and Laukkai proper. The following day, the MNDAA separately attacked retreating junta soldiers who had abandoned positions in north of the city On 6 December 2023, The MNDAA completed capturing the Four Buddhist Statues Hill outpost and established control of the southern side of Laukkai. Remaining junta troops were positioned north of the city, keeping it well-guarded.\nChinese-brokered ceasefire talks\nOn either 7 or 8 December, China allegedly held talks with the Three Brotherhood Alliance in Kunming, Yunnan regarding the fate of Laukkai. According to an alleged leaked draft consensus, the Brother Alliance and Lieutenant General Min Naing of the junta agreed on a ceasefire by the end of December, making political arrangements between the MNDAA and the SAC to \"return to the Old Street\". \"Old Street\" was literal translation of the Chinese name for the city and the details of the consensus was left vague.\nA few days later on 11 December, China helped to hold peace talks between the Tatmadaw and various rebel groups in the North, including the alliance. The talks focused on Operation 1027 generally but also discussed the fate of Laukkai. According to the junta, the talks went positively and announced plans for a follow-up meeting at the end of the month. The Brotherhood Alliance announced later on 13 December that these peace talks \"lasted only 10 minutes\" and vowed to continue fighting.\nResumption of fighting\nOn the evening of 18 December, the Myanmar Air Force carried out three airstrikes on MNDAA targets in Htin Par Keng, a village directly north of Laukkai's northern city gates. Junta troops stationed in Laukkai shelled the village after the initial airstrikes, continuing shelling and using airstrikes well into the following evening. Many remaining residents continued to shelter in their homes.\n]]\nOn 19 December, the MNDAA gained control of the Yanlonkyaing border gate (Border Point 122) on the Chinese border with Nansan, Yunnan, three miles north of Laukkai. The MNDAA also seized Border Point 125, a smaller border crossing and site of an IDP camp with 30,000 people. MNDAA forces took down the Flag of Myanmar and raised the flag of the MNDAA at the Chinese border.\nAs the battle moved into the city, regime forces fired artillery at the city on 25 December killing 8 civilians and injuring 24 others in the Tong Chain neighbourhood hotel. On 26 December, 90 soldiers of the Tatmadaw's 55th Light Infantry Division and BGF troops reportedly surrendered to the MNDAA, while another 90 junta troops were killed in previous fighting. Some local Border Guard Forces under warlord Bai Suocheng also surrendered. Bai was the former deputy commander of the MNDAA who switched allegiances in 2008 to take control of the Kokang SAZ under the Tatmadaw's directive. After the surrender, the MNDAA took over the police compound and the junta's military presence dropped significantly. MNDAA troops began patrolling the city and posting videos on TikTok to demonstrate their control. Two days later on 28 December, the MNDAA had taken control of most of the city.\nIn a New Year's Day address, MNDAA commander Peng Daxun vowed to eradicate online scams in Kokang and noted that while they had taken most of Laukkai, Operation 1027 was still ongoing. Concerns grew over the fate of Laukkai as the junta typically bombed fallen towns into complete destruction. On 3 January, junta artillery shells fired at Laukkai landed in China and injured 5 people in Zhenkang sparking protestation and a call for peace from China.\nSurrender and aftermath\nOn 4 January, the junta's military personnel surrendered their Laukkai operations headquarters and handed weapons and ammunition to MNDAA troops as they and their families evacuated the city. Up to 1000 regime troops, family and civil servants were evacuated to Lashio, which itself is surrounded by the Three Brotherhood Alliance. According to The Irrawaddy, the surrender was mediated by China for a more stable border and pre-approved by the junta. Six brigadier generals, including commander of the Laukkai Regional Operations Command Moe Kyaw Thu, were evacuated to Lashio on a helicopter. All six were detained by the junta upon their arrival in Lashio. On 20 January, a military tribunal in Naypyidaw sentenced three of the generals to death and the others to life imprisonment for the crime of \"shamefully abandoning\" their positions.\nOn 5 January 2024, The MNDAA gained full control of Laukkai, capital of the Kokang Self-Administered Zone following the mass surrender of the last junta forces and officials within the city. According to the MNDAA, 2389 junta personnel and about 1600 family members laid down their arms and surrendered. A junta spokesperson stated that they made the decision prioritizing the safety of their families. The surrendering personnel and families who had not already left the previous day were evacuated to Lashio.\nHaigeng ceasefire\nIn the wake of these gains and the fall of Laukkai, on 12 January, China announced that it had negotiated another ceasefire between the junta and the Three Brotherhood Alliance, known as the \"Haigeng Agreement\". The two sides agreed to disengage personnel and pledged not to compromise the safety of Chinese border residents. According to the Brotherhood Alliance, they had agreed not to seize more towns in northern Shan and that the junta had agreed not to shell or strike that area. However, the following day, the TNLA reported that the junta had broken their ceasefire agreement with airstrikes in various townships in Northern Shan, including Lashio Township and Kyaukme Township.\nReferences"
    }
  ]
}