{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Basra (2008)\n\n)\n| place             = Basra, Iraq\n| territory         = Mahdi Army withdraws from the city\n| result            = * Tactically Inconclusive\n* Strategic Iraqi army victory\n| combatant1        =\nSupported by:\nBadr Brigades\n| combatant2        =  Mahdi Army Special GroupsFadhila MilitiaThar Allah\n| commander1        =  PM Nouri al-Maliki Lt. Gen. Ali Ghaidan Majid Lt. Gen. Mohan al-Furayji\n| commander2        =  Muqtada al-SadrShiek Ali al-SauidiYusuf al-Mosawi\n| units1            = *\n** 1st Division from Al-Anbar, embedded US Marine MiTT team\n***1st Brigade\n** 7th Division\n***26th Brigade from Ramadi, embedded US Army MiTT team\n**9th Division\n***36th Brigade (Mechanized)\n****1st BN/36th BDE (M)IN BMP-1s with one company of T-55 Tanks\n***35th Brigade (Armored)(Two battalions, reconditioned T-55s & BMP-1s)\n** 4th Division\n***14th Brigade\n**14th Division\n***50th Brigade\n***51st Brigade\n***52nd Brigade\n*\n**  23rd Squadron\n***C-130s\n** 70th Squadron\n* Iraqi Police\n** National Police QRF Battalion\n** embedded National Police Transition Team\n**Hillah SWAT unit\n* Iraqi Special Operations Forces\n**1st Brigade\n| units2            = *Mahdi Army\n*Fadhila Militia\n*Thar Allah\n| strength1         =  Iraqi Security Forces\n* 16,000 (Iraqi Police)\n* 14,000 (Iraqi Army)\n* 4 Mi-17 and 2 UH-1 helicopters\n* 2 C-130 cargo aircraft\n* 3 CH2000 reconnaissance aircraft\n| strength2         = 16,000\n| casualties1       = Losses in personnel:30 killed (15 soldiers,15 policemen);400 wounded;1,000–4,000 defected or capturedLosses in equipment:1 Mi-17 helicopter shot down1 BMP-1 and 5 Dzik armored vehicles destroyed9 armored vehicles captured\n| casualties2       = 210 killed,600 wounded 155 captured (Iraqi Interior Ministry claim)\n| casualties3       = Civilian casualties:50 killed\n}}\nThe Battle of Basra began on 25 March 2008, when the Iraqi Army launched an operation (code-named Saulat al-Fursan, meaning Operation Charge of the Knights in Arabic) to drive the Mahdi Army militia out of the southern Iraqi city of Basra. The operation was the first major operation to be planned and carried out by the Iraqi Army since the invasion of 2003.\nCoalition and Iraqi aircraft patrolled the skies above Basra providing intelligence and carrying out air strikes in support of Iraqi forces on the ground. Coalition forces provided embedded military transition teams (MiTTs) in Iraqi Army units and American special forces also conducted joint operations with ISOF units.\nIraqi forces faced heavy resistance from Mahdi Army militia inside the city and the offensive stalled, requiring American and British air and artillery support, eventually resulting in a stand-off. More than 1,000 casualties resulted in six days of heavy fighting.\nFollowing a ceasefire negotiated in Iran on 31 March, Muqtada al-Sadr withdrew his fighters from the streets, but had gained a major political victory. However, the Iraqi Army, reinforced with brigades from other parts of Iraq, including the 1st Division from al-Anbar, continued to carry out slower, more deliberate clearing operations in militia strongholds. The Hillah Special Weapons and Tactics Unit, as well as Iraqi Special Operations Forces (ISOF), carried out a number of targeted raids on militia leaders. By 20 April, the Iraqi Army had taken control of the last major district controlled by the Mahdi Army, and by 24 April, Iraqi forces claimed to be in full control of the city centre.\nBackground\nDuring the invasion of Iraq, Basra was the first city to fall to Coalition forces, following two weeks of fighting between the British and Iraqi forces. Following the collapse of the Iraqi government, a number of Shi'ite Islamist groups, including the Sadrist Trend led by Muqtada al-Sadr, the Supreme Islamic Iraqi Council and Fadhila, were able to expand their influence in Basra, solidifying their standing following the January 2005 elections. Basra became a center of smuggling activity in Iraq, including cigarette smuggling, opium from Afghanistan via Iran, oil and gas smuggling, illegal weapons, and other criminal rackets. Violence steadily increased as the three parties vied for control of Basra's resources, continuing through 2005 and 2006. At the same time, attacks on British forces increased following the use of highly sophisticated explosively formed penetrators (EFPs) smuggled in by Iran restricting the British to their bases, which militia then targeted with rocket and mortar fire on a regular basis. The Mahdi Army also enforced strict Islamic rule in Basra, threatening women for wearing makeup and punishing individuals for playing secular Western and Arabic music.\nIn late September 2006, British forces launched Operation Sinbad, a six-month operation originally intended to purge militia from the Iraqi police but eventually targeted the militias directly. However, British forces did not have sufficient numbers and despite a temporary decrease in violence, British troops were again under attack and withdrew to their positions at the palace and the airport.\nThe UK military returned control of Basra to the Iraqi forces in December 2007 and concentrated its forces at the city airport.\nIn February 2008, Muqtada al-Sadr's followers renewed a ceasefire which had been declared in August 2007, under which they pledged not to attack rival armed groups or American forces in Iraq. General Qasem Soleimani of the Iranian Revolutionary Guard Corps (IRGC) ordered this truce. The truce, however, came under strain in the weeks before the battle as Iraqi forces detained \"rogue\" militia members.\nPreparations\nIn 2007, the Iraqi Army moved 4 brigades, including one of its two tank brigades from the 9th Division, and a special forces battalion to Basra. The existing brigade was transferred to Wasit province to break its ties to militia groups in Basra. The Iraqi National Police also moved two battalions to Basra.\nIn August 2007, the Iraqi Army established the Basra Operational Command, a Corps-level command in charge of 2 Iraqi Army divisions (the 10th and the 14th), under the command of Lt General Mohan al-Furayji.\nThe Vice Chief of Staff of the Iraqi Joint Staff said \"We do not have enough forces there. That is why we are having a new division, the 14th Division, to be built in Basrah, especially with the possibility that the British might be leaving us in time.\" The formation of this new division was not scheduled to be completed before June 2008 and was accelerated to deal with the upcoming operation. The 3rd brigade of the division graduated from the Besmaya Combat Training Center Program on 13 February 2008, five weeks before the battle and the 4th brigade was still forming.\nIn mid-March, the deputy prime minister, Barham Salih, called for a \"very strong military presence in Basra to eradicate the militia\". He also indicated possible Coalition force involvement in the plan. On Thursday, 20 March, Lt General Mohan al-Furayji warned his troops to prepare for a \"final battle\" in Basra to defeat Shia militia before provincial elections in October later that year.\nOn 22 March, the Iraqi prime minister Nouri al-Maliki met with the commander of US forces in Iraq, General David Petraeus. During the meeting, al-Maliki explained that the impending operation would be an \"entirely Iraqi affair ... to take on criminals and gang leaders\" in Basra. General Petraeus advised al-Maliki not to rush into a fight and that the large scale movement of Iraqi forces would put strains on the Iraqi logistical and command and control networks, as well as \"putting at risk\" a lot of the gains made since the start of the US \"Surge\" in 2007 by threatening the ceasefire imposed on the Mahdi Army by Muqtada al-Sadr.\nThe Mahdi Army had long been well-entrenched in their districts with sniper positions, ambush sites, roadside bombs and booby trapped buildings.\nDuring the reign of Saddam Hussein over 202,000 refugees fled Iraq to refugee camps in Iran. Many of the young men and children who lived in these camps were recruited by Iran's Revolutionary Guard Corps in anticipation of repatriation back into Iraq.\nTimeline of the battle\nNote that not very much is actually known about the tactical operations. Because so few Coalition forces were involved in the operation there were no embeds in Basra and most broadcasts and print reports originated from Baghdad. Field reports from Basra have generally been filed by news agency \"stringers\", sometimes of dubious credibility.\n24 March\nThe Iraqi Prime Minister Nouri al-Maliki and the commander in charge of all Iraqi ground forces, Lt General Ali Ghaidan Majid, arrived in Basra to oversee the operation, taking over from the Basra police chief, Maj. Gen. Abdul-Jalil Khalaf, and the head of the Basra Operational Command, Lt. Gen. Mohan al-Furayji. An indefinite nightly curfew was announced in Basra, as well as in al-Kut and Nasiriyah. Routes into Basra were sealed off, according to reports, and vehicles were also prohibited from entering the city. Sadr's organization promised violent retaliation in Basra if members of his Mahdi Army were targeted.\n25 March\nIn the early morning, security forces entered the neighbourhood of al-Tamiya, a Mahdi Army stronghold. Shortly after, fighting erupted and the clashes later spread to five other neighbourhoods, including al-Jumhuriya, Five Miles and al-Hayania, the Mahdi Army's main stronghold in Basra.\nNassar al-Rubaie, an official in al-Sadr's political movement, accused the Iraqi government of trying to weaken the Sadr trend ahead of provincial elections. In response to the fighting the political movement of powerful Shiite cleric Muqtada al-Sadr launched a nationwide civil disobedience campaign across Iraq to protest the raids and detentions against the Mahdi Army.\n26 March\nBy late in the evening, the assault on the port city stalled, as Shiite militiamen in the Mahdi Army fought day-long hit-and-run battles and refused to withdraw from their positions. The Mahdi Army fighters also managed to overrun a number of police stations and checkpoints.\nThe Iraqi Prime Minister set a 72-hour deadline for militia in Basra to surrender their arms. A statement from the Basra Operational Command quoted Maliki: \"We are not going to chase those who hand over their weapons within 72 hours. If they do not surrender their arms, the law will follow its course.\"\n27 March\nBy 27 March, residents in the city were beginning to run out of food and water. They said Iraqi army deserters broke into shops, took food and water, then set fire to shops and cars on the street. An oil pipeline near Basra, which carries oil for export, was damaged by a bomb.\nMahdi Army fighters paraded around the wreckages of two Iraqi Army AMZ Dzik armored vehicles and a BMP infantry fighting vehicle which were seen destroyed on the streets. A captured Iraqi Army Humvee along with 20 Iraqi soldiers that were said to have surrendered voluntarily to the militants were also presented. At this point, reports were circulating that Iraqi policemen and soldiers were refusing to fight or deserting their posts and abandoning their uniforms. Overnight, the chief of the police force escaped a roadside bomb attack on his convoy just outside the city which killed three of his bodyguards. The deputy police chief was also attacked in central Basra.\nLate in the evening an Iraqi Army helicopter was shot down by militants.\n28 March\nOn Friday, Major Tom Holloway, spokesman for the British Armed Forces, reported two air strikes were made in support of Iraqi forces in Basra overnight. The air strikes, which occurred at 21:00 on Thursday and shortly after midnight involved US Navy or Marine F/A-18 fighters firing cannon rounds at a militia stronghold and on a mortar team in Basra. Major Holloway reported coalition aircraft had been flying surveillance operations over Basra since the beginning of the fighting in support of the Iraqi offensive.\n29 March\nIn the early hours of the morning, a US airstrike on the city killed eight Iraqi civilians, including 2 women and a child, according to Iraqi police. The Coalition spokesman, Major Brad Leighton, denied this report, saying an AC-130 gunship strafed heavily armed militants on the rooftops of three buildings, killing 16 militants. Major Leighton also reported the targets were identified by special operations forces before the attack. According to a US military statement, the strike occurred during an Iraqi special forces operation in western Basra to \"disrupt criminal activities and capture criminal leaders\" in a \"known criminal stronghold\". In addition, 6 Insurgents were killed by the Iraqi special forces after being engaged by small arms fire and RPGs at the target building. Two Iraqi soldiers were wounded and a vehicle damaged during the operation.\nUK artillery based at Basra airport fired 155mm shells into the city at a militia mortar position which had been firing at Iraqi security forces.\nBy this point, the Iraqi military offensive against the city was faltering in the face of stiff resistance, as the 72-hour ultimatum by the government passed and the militants refused to surrender. Reports of defecting and deserting soldiers and policemen were circulating and the Mahdi Army confirmed that seven American-made Humvees were given to them by sympathisers within the Iraqi Army. An Iraqi Army battalion commander and two other Iraqi soldiers were killed during the night by a roadside bomb in central Basra. Iraq's defense minister, Qadir Obeidi, stated that \"We were surprised by a very strong resistance that made us change our plans.\"\n30 March\nOn 30 March, militia fighters stormed a state TV facility in Basra forcing Iraqi military guards surrounding the building to flee and setting armored vehicles on fire. A mortar attack against the palace that houses the military operations center killed one of al-Maliki's top security officials.\nLater in the day, after running low on ammunition, al-Sadr ordered his followers to cease fighting. In a statement to the media, Sadr said: \"Because of the religious responsibility, and to stop Iraqi blood being shed, and to maintain the unity of Iraq and to put an end to this sedition that the occupiers and their followers want to spread among the Iraqi people, we call for an end to armed appearances in Basra and all other provinces,\"\nThe New York Times reported that as of 30 March, Shiite militiamen still controlled large parts of Basra and were continuing to stage raids on Iraqi government forces.\nUSA Today reported that after the Mahdi Army requested a ceasefire, a negotiating team was sent by the Iraqi Government to Iran where an agreement for ceasefire was negotiated.\nMcClatchy Newspapers reports that the Iraqi Central Government sent representatives of five Iraqi political parties to Qom, Iran to negotiate with Moqtada al-Sadr and Brig. Gen. Qasem Soleimani, the Commander of Iran's Quds Force.\n\"Ali al Adeeb, a member of Prime Minister Nouri al Maliki's Dawa party, and Hadi al Ameri, the head of the Badr Organization, the military wing of the Islamic Supreme Council of Iraq, had two aims, lawmakers said: to ask Sadr to stand down his militia and to ask Iranian officials to stop supplying weapons to Shiite militants in Iraq.\"\nGeneral Suleimani was instrumental in the negotiations that put Maliki in power. Suleimani traveled into the Baghdad Green Zone to negotiate with the relevant parties. The IRGC has been a player in Iraqi politics for some time.\n31 March\nFollowing the ceasefire, armed Mahdi Army militiamen no longer openly appeared on the streets and Basra appeared to be returning to normal with shops and schools starting to reopen. The commander of the 14th Division, Major-General Mohammed Jawan Huweidi, said his forces had control of the towns around Basra, as well as inside the city. He reported that his troops were now beginning to clear roadside bombs in the city. According to a spokesman for Nouri Al Maliki, Iraqi troops and police were in control of much of Basra, and local security forces were going house-to-house in some districts to confiscate weapons.\nTime magazine reported that there had been \"a large-scale retreat of the Mahdi Army in the oil-rich Iraqi port city because of low morale and because ammunition was low due to the closure of the Iranian border.\" A US military officer confirmed that assessment to the Long War Journal, saying \"In short [the Mahdi Army] had no ability to sustain the effort\".\nNouri al-Maliki said security operations against \"criminals and terrorist activities\" would continue in Basra. The Iraqi defense spokesman said that reinforcements were being sent to Basra and preparations for fresh military operations to clear the city were being made.\nAccording to a US military statement, Iraqi Special Forces raided a school being used by \"criminals\" to store weapons, ammunition and explosives. The special forces, supported by US special forces and Coalition aircraft, killed 14 of the criminals and released six Iraqi soldiers being held at the school.\nAftermath\nFollowing the handover by British armed forces military to local governance in 2007, Basra had become a lawless place with widespread violence, kidnappings, sectarian attacks against Sunnis and Christians and attacks on alcohol and music shops and women not wearing head scarves. By contrast, after the army had regained control of the city, it was described by a foreign visitor as a \"very safe\" city with only the presence of troops as a sign of abnormality.\nThe outcome of the battle has been a subject of much public debate with British military commanders calling it a 'complete disaster'. Militarily, the battle ended indecisively with the Iraqi security forces clearing some districts but facing ferocious resistance in others. Although Mahdi Army fighters withdrew from the streets, clashes between Iraqi Security Forces and militia continued.\nThe battle triggered a nationwide political debate on the role of militias in the future Iraq. It seemed as if most political parties were leaning towards Maliki's position, which was basically that militias have no place in the future of Iraq.\nIran's actions in Iraq were described by Ryan Crocker, US Ambassador to Iraq, as a proxy war and evidence of Iran's negative role in Iraq.\nAdministration officials have long accused Iran of supporting Shiite militias in attacks on American forces in Iraq. The difference now is that administration officials are trying to convince the Iraqi government that Iran may not be the ally it thought, and is behind attacks against Iraqi government forces. That is a harder sell, given that Iran has supported Iraq’s government.\nAfter the battle, the Iraqi government dismissed 1,300 soldiers and policemen who deserted or refused to fight during the operation.\nCasualties\nPolice and health workers said at least 236 people were killed and 600 wounded in the fighting in districts of central and northern Basra, with at least 50 civilians among the dead. These claims are questionable though, since Al Sadr followers are known to be prominent in the health organization. Among the dead were at least 30 members of the security forces, including 15 soldiers and 15 policemen.\nThe Iraqi interior ministry chief, Maj. General Abdul-Kareem Khalaf, claimed 210 militiamen killed, 600 wounded and 155 captured since the beginning of the operation.\nReactions\n* Kurdish and Sunni political parties expressed support for the operation. Massoud Barzani, the head of the Kurdish controlled region offered Kurdish troops to help fight the Mahdi Army. The Sunni Vice President, Tariq al-Hashemi signed a joint statement between the Kurdish President, Jalal Talabani and the Shi'ite Vice President, Adil Abdul-Mahdi, expressing support for the Basra operation.\n* US President George W. Bush praised the Iraqi offensive, describing it as \"a defining moment in the history of a free Iraq\". He emphasized the operation was al-Maliki's decision. \"People were wondering if Iraq was going to be able to do this and it's happening,\"\n* Iran's ambassador, Hasan Kazemi Qomi, said his government backed the Iraqi offensive against \"outlaws\" in Basra. \"We are in favor of a strong army in Iraq. All weapons must be in the hands of the government. There are 28 militias that exist in Iraq. We want to see all of them dissolved,\" Qomi said, while criticizing the American offensive against Sadr City.\n* Des Browne, the British defense minister, announced troops levels in southern Iraq would remain constant at the current level of around 4,000. \"In the light of the last week's events, however, it is prudent that we pause any further reductions while the current situation is unfolding\", Browne said. UK troop levels were expected to drop to 2,500 before the Iraqi offensive and subsequent violence.\nSee also\n*Iraq spring fighting of 2008\nReferences\nExternal links\n*[http://www.lib.utexas.edu/maps/middle_east_and_asia/basrah_2003.jpg Detailed map of Basra from 2003] - University of Texas\n*[https://www.independent.co.uk/news/world/middle-east/the-man-left-to-pick-up-the-p.htmls-in-basra-401617.html Article about General Mohan from the UK newspaper] The Independent\n*[http://baghdadbureau.blogs.nytimes.com/2008/05/13/a-new-basra-something-like-the-old-one/ A New Basra Something Like the Old One] - New York Times article on the situation in Basra, May 2008.\n*[http://edition.cnn.com/2008/WORLD/meast/05/20/basra.killings/index.html Iraqi: 'I killed her with a machinegun] - CNN.com article on militia control of Basra before the battle."
    }
  ]
}