{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Punnaikayal\n\nVijayanagara Empire\n** Madurai NayakasKingdom of Calicut Ottoman Empire\n| combatant2        =  Portuguese Empire\n| commander1        =  Vitthala Vishwanatha Nayak Seydi Ali Reis Piri ReisIrapali (Ali)\n| commander2        =  Manoel Rodrigues Coutinho\n| strength1         = Unknown\n| strength2         = 50\n| casualties1       =\n| casualties2       =\n| caption           =\n}}\nThe Battle of Punnaikayal (1553) was a conflict between the Portuguese and a combined force of Ottomans, Kingdom of Calicut and Vijayanagara troops. Seeking to end Portuguese dominance over the Coromandel Coast and its pearl fisheries, Vitthala of Vijayanagar allied with the Ottoman-Calicut Muslim fleet under Irapali. The Muslim forces attacked by sea while Vishwanatha Nayak’s troops advanced by land. Despite fierce resistance from a small Portuguese garrison led by Captain Manoel Rodrigues Coutinho, the outnumbered defenders were eventually forced to retreat. However, they were captured by Vitthala’s forces before reaching safety. The victorious forces burned down churches, imprisoned Portuguese soldiers and priests, and proclaimed the end of Portuguese rule forcing locals to convert to Islam or face execution.\nBackground\nIn 1552, a noble from the Kingdom of Travancore led a forceful incursion into several villages in the southern Coromandel region near Cape Comorin looting and capturing them. These villages were home to Christian inhabitants who, in distress, sought protection from the Nayak of Madurai Vishwanatha Nayak. Seeing this as an opportunity, Vishwanatha launched a counterattack with his army, reclaiming the villages and inflicting severe destruction upon the invaders. The Maharaja of Travancore, enraged by these actions but unable to confront the Madurai forces directly, allied with Vitthala to retaliate against the Christian villagers who had sought Vishwanatha Nayak’s aid. Under the cover of night, their combined forces launched a brutal assault, massacring many before dawn. Among the victims was a Portuguese missionary, Luis Mendez, a lay brother of the Society of Jesus, who perished in the carnage.\nDespite the apparent submission of the Coromandel villages, Vitthala remained unsatisfied, as the Portuguese continued to dominate the region’s pearl fisheries and effectively controlled the land. Determined to eliminate their presence entirely, he devised a more aggressive strategy. Aware that the Portuguese had previously evaded defeat by retreating to the sea, he sought allies with strong naval capabilities. He formed an alliance with the Muhammadan pirate Irapali (Ali) a subject of the Zamorin of Calicut, who had long harbored hostilities against the Portuguese. Additionally, Vitthala secured the support of the powerful Ottoman fleet under the command of Seydi Ali Reis and Piri Reis both of whom were experienced in naval warfare against Portuguese forces. With this formidable coalition, he launched a renewed campaign aimed at eliminating Portuguese influence in the region.\nBattle\nWith a coordinated strategy the combined forces prepared for an assault on the Portuguese stronghold. While the Muhammadans, led by Irapali (Ali) and the Ottoman commanders Seydi Ali Reis and Piri Reis launched a naval attack on the coast, Vishwanatha Nayak commanding a formidable army of Telugu troops, advanced by land. Their target was Punney Kayal, the capital of the Portuguese settlements along the Fishery Coast, a strategically vital location known for its control over the lucrative pearl trade. The Portuguese garrison stationed there, consisting of only 50 soldiers under the command of Captain Manoel Rodrigues Coutinho.\nBy the end of June 1553, the Muslim fleet consisting of several galleons and forty swift sloops, arrived off the Coromandel Coast ready to strike. Their first target was the newly established village of Mugel which had existed for barely a year. The attack was swift and brutal twenty fishing boats were seized, and many Paravas the local Christian fishermen, were captured. Emboldened by this success, the fleet proceeded directly to Punney Kayal, the capital of the Portuguese presence on the Fishery Coast. On the first of May, five hundred Muhammadan soldiers landed on the shore, intent on overwhelming the small Portuguese garrison. However, the fifty defenders, under Captain Manoel Rodrigues Coutinho, put up fierce resistance. Among the bravest was Antonio Franco de Gusmão the Portuguese standard-bearer who charged at the enemy’s own standard-bearer an Abyssinian soldier. In a  duel, Gusmão seized the enemy standard and struck down his opponent on the battlefield.\nAs the initial assault failed, the Muslim commander aboard his galleon swiftly dispatched reinforcements, swelling the attacking force to fifteen hundred men. Realizing that they were vastly outnumbered most of the Portuguese defenders chose to retreat. However, Captain Manoel Rodrigues Coutinho displaying remarkable courage stood his ground with just seventeen loyal soldiers. Determined to fight he was eventually persuaded by his men that their best chance of survival lay behind the fortified brick walls of the town. he led his small band in a retreat toward the town hoping to mount a stronger defense. However, their hopes were quickly dashed the forces of Vitthala had already occupied the area. Before they could reach safety Coutinho and his men were surrounded and captured while the Muslim forces seized control of both the town and its fortress.\nAftermath\nAfter securing victory at Punnaikayal the Muslim forces wreaked havoc on the settlement. The churches were set ablaze. Portuguese soldiers, including their captain, Manoel Rodrigues Coutinho, and several priests, were taken as prisoners. the pirate commander Irapali issued a proclamation across the Coromandel Coast declaring the end of Portuguese rule. he called upon the local inhabitants to embrace Islam and become followers of the Prophet Muhammad warning that those who refused would face the sharp edge of the Muhammadan sword.\nSee also\n* Ottoman Empire\n* Piri Reis\n* Vijayanagara Empire\nReferences"
    }
  ]
}