{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Loma del Gato\n\ntemplate -->\n| map_type          =\n| map_relief        =\n| map_size          =\n| map_marksize      =\n| map_caption       =\n| map_label         =\n| territory         =\n| result            = Spanish victory\n| status            =\n| combatants_header =\n| combatant1        =  Cuban rebels\n| combatant2        =  Spain\n| combatant3        =\n| commander1        =  José Maceo Pedro Agustín Pérez  Agustín Cebreco\n| commander2        =  Tirso Albert Joaquín Vara de Rey\n| commander3        =\n| units1            = 1st Corps\n| units2            = Two columns\n| units3            =\n| strength1         =\n| strength2         =\n| strength3         =\n| casualties1       = 16 killed and 40 or 50 wounded\n| casualties2       = 80 dead and 160 wounded\n| casualties3       =\n| notes             =\n| campaignbox       =\n}}\nThe Battle of Loma del Gato took place during the Cuban War of Independence on July 5, 1896 at Santiago de Cuba, Oriente Province. It is notable for the death of Mambí General José Maceo.\nThe Battle\nAfter spending the night camped outside the village of La Isabelita, the Mambí forces crossed the railroad at La Maya in the direction of El Espartillo, as a part of their Oriente campaign.\nWhen the Mambises reached El Espartillo, they were fired upon from the Spanish-held outposts of Sangre de Toro and Camarones.\nGeneral Maceo reached El Espartillo and from there arranged the disposition of his forces: Colonel  was to march with his Prado Regiment in the direction of La Jagüita whilst Colonel Agustín Cebreco marched towards the Loma del Gato; Brigadier Pedro Agustín Pérez was to cover the position of El Mamón, and Brigadier  was to provide support to Cebreco's forces.\nAbout fifteen minutes later, Maceo sent Colonel Luis Aranda towards La Jagüita, so that Colonel Bonne would move in to attack the Spanish, and ordered Lieutenant Colonel Francisco Sánchez Hechavarría's flying column Maceo, to advance towards the Loma del Gato and support Cebreco's forces, which were already fighting.\nAfter about twenty minutes, Maceo became impatient because he did not hear fighting in the direction in which Sánchez Hechavarría was supposed to be attacking and decided to march with his escort and adjutants to meet the Spanish, who were engaging Cebreco's forces.\nDeath of General Maceo\nUpon reaching Loma del Gato, General Maceo quickly rallied the troops that accompanied him and charged into battle.\nA few minutes later, whilst fighting on horseback, Maceo came too close to the Spanish positions, drawing fire from them. A bullet struck him in the head and he collapsed from his horse.\nHis aide, Lieutenant Salvador Durruty, tried to lift him off the ground, receiving a bullet in the groin. Mambí medic Porfirio Valiente extracted the projectile from General Maceo while the battle raged around them. Moments later, the general succumbed to his wounds.\nThe Cubans suffered another 15 casualties in the course of the battle and were routed; the battle was a blow for the Mambises, having lost an important general.\nReferences"
    }
  ]
}