{
  "content": [
    {
      "type": "text",
      "text": "# Battle Picture Weekly\n\nBattle Picture Weekly (at various times also known as Battle and Valiant, Battle Action, Battle Action Force, Battle and Battle with Storm Force) was a British weekly boys' war comic published by IPC Magazines from 8 March 1975 to 23 January 1988, when it merged with the new incarnation of Eagle after 644 issues. Most stories were set in World War II, with some based on other conflicts, while factual features also focused on warfare.\nDevised by Pat Mills and John Wagner in response to rival DC Thomson's similarly themed Warlord, the title was an instant success. Many of the stories printed in the comic have since received critical acclaim and been published in collected editions, notably \"Charley's War\". Since 2016 Rebellion Developments have owned the majority of Battle Picture Weekly's characters and material, and have published revival publications.\nCreation\nBy the 1970s, IPC Magazines were one of the largest comics publishers in Britain, their portfolio centred around a stable of weekly anthologies that sold around a quarter of a million copies each. However, since being appointed Editorial Director, John Sanders became increasingly aware the market as a whole was shrinking, with television the main threat. He found many of his attempts frustrated by the structure of the company; many of the company's staff (including board members) had been with the company for decades since their days as Amalgamated Press and Fleetway Publications, and were strict traditionalists. IPC launched a slew of titles from 1969 to 1971, but few survived for long.\nThere was also an archaic internal structure where the company's titles were divided into various departments – boy's adventure, humour, girls and so forth – which rarely exchanged staff between each other. Having left staff jobs at IPC's largest rival DC Thomson, Pat Mills and John Wagner began working as freelancers and submitting scripts for the London company's girls comics. Their work for the likes of Tammy, Jinty and Princess Tina featured a degree of social realism and freshness that stood out to Sanders, who looked for an opportunity to work with the pair further. Mills interviewed for IPC's vacant position of Managing Editor, but his forthright criticism of the company's failings went down poorly with the board, but reaffirmed Sanders' belief that fresh blood was needed.\nAn opportunity to recruit Mills and Wagner came in 1974, when DC Thomson launched Warlord. While war comics had been a staple of British boys' titles since the fifties – both as features in anthologies and as a staple of picture library titles like Commando and War Picture Library – Warlord was the first ongoing weekly to centre on the genre entirely. The variety was instead provided by the stories being spread between different theatres and services; the result was a smash hit. IPC had a firm policy of responding to any new hit by DC Thomson or any other rival by launching a similar title of their own in response, even keeping an inventory of unpublished strips in various genres to speed up the process. However, Sanders wanted a different approach for IPC's answer to Warlord, turning to Mills and Wagner.\nDespite initial reluctance to work in the genre, Mills and Wagner took the offer. One of their key aims was to provide a more working class makeup to the characters, something they felt was sorely lacking in other boys' comics. With a tight lead-in of between 6 and 8 weeks the pair started assembling the new title. To keep friction with other staff to a minimum the pair were placed in an office in the girls' department, and told any staffers who asked they were working on a comic for the blind. When word did get out the decision was not popular with the IPC staffers, not least because as freelancers Mills and Wagner were paid better. However, Sanders stuck to his guns.\nThe plan was the pair would set up an initial round of stories and edit the opening issues before handing over to a staff editor. However, slow progress meant the more experienced Dave Hunt was assigned to help. He was one of the more flexible staffers however and largely tried to curb the pair's perfectionism rather than resisting their ideas. Other important figures in the creation of what would become Battle Picture Weekly were writer Gerry Finley-Day (who Mills and Wagner had worked with on girls' comics); sub-editor Steve MacManus; Eric Hebden, a military veteran who served as technical advisor; and art director Doug Church, who used the web offset printing method to give the comic a clean, detailed look. Mills meanwhile insisted on the use of machine lettering for the strips, a trademark of DC Thomson, as he felt it was superior to the hand lettering available from the time. The only thing they were refused revolved around the free gift cover-mounted on the first issue – a set of transfers depicting military emblems, Mills and Wagner had requested it include German insignia. IPC's competitions editor Peter Lewis, responsible for sourcing the items and a decorated World War II veteran, threatened to resign if they were included; the pair backed down, and Wagner later admitted they had been insensitive.\nPublishing history\nBattle Picture Weekly (1975–1976)\nDespite the meticulous approach of Mills and Wagner, the first issue of Battle Picture Weekly met its launch date, appearing on 2 March 1975. It contained eight initial stories. \"D-Day Dawson\" featured a British soldier with an inoperable bullet lodged near his heart; according to Finley-Day, the strip's title was chosen due to prominent coverage of D-Day's 30th anniversary in 1974. \"Rat Pack\" featured a group of four convict soldiers given suicide missions, which Finley-Day acknowledged was heavily influenced by film The Dirty Dozen; art was provided by Spaniard Carlos Ezquerra, initially on a part-time basis while he worked through commitments to DC Thomson. \"The Bootneck Boy\" featured the travails of an aspiring Royal Marine; it was again written by Finley-Day, who based the protagonist's attitude on that of Alf Tupper from DC Thomson's \"The Tough of the Track\" story in Victor. \"Lofty's One-Man Luftwaffe\" featured a bilingual Allied pilot mistaken for a German counterpart and working to sabotage the Luftwaffe from within. The Day of the Jackal-influenced \"Day of the Eagle\" introduced Special Operations Executive agent Mike Nelson, whose first mission was to kill Adolf Hitler. \"The Flight of the Golden Hinde\" concerned an obsessive captain trying to complete a voyage in a replica of the Golden Hind during wartime and \"The Terror Behind the Bamboo Curtain\" was set in a Japanese prisoner-of-war camp in occupied Burma, which Hunt recalled was constantly rewritten by Mills and Wagner in an attempt to get it right.. The title was a strong seller from the start, and with the setup done Mills and Wagner moved on, the former to begin work on all-new boys' comic Action and the latter to work as editor on the flagging Valiant.\nThe contents of the comic saw their first shake-up in May 1975, decided by the standard IPC research of requesting readers write in ranking the stories and dropping the least popular. \"The Terror Behind the Bamboo Curtain\" and \"Flight of the Golden Hinde\" were the two dropped, making way for \"Coward's Brand on Bradley\" and \"The Fortrose Falcon\"; the latter was the first Battle Picture Library strip to not entirely revolve around World War II. However, the new arrivals were based on Mills and Wagner ideas bumped from the launch issue, and neither lasted long. Another thing thrown up by the research was that while Battle attempted to split stories between land, sea and air forces, readers far preferred those about the army to the rest. It wasn't until January 1976 that Battle found another enduring character in the form of Major Eazy – a laconic cheroot-smoking soldier modelled on Britt, James Coburn's character in classic Western film The Magnificent Seven. Drawn by Ezquerra and written by Alan Hebden (son of Eric), the Bentley-driving British officer was instantly popular with readers. Three months later IPC changed printers and Battle was forced to switch from web offset to letterpress. Another popular new arrival was \"The Team That Went To War\" by writer Tom Tully and artist Mike Western, which featured football team Barchester United enlisting – and getting butchered – en masse in 1940.\nIPC meanwhile had launched Mills' brainchild Action to strong sales and critical reaction. The comic's increased level of violence and nihilism spurred Hunt on; he was particularly envious of the title's war strip \"Hellman of Hammer Force\", launching \"Fighter from the Sky\" (with a German paratrooper as the protagonist) in response, as well as the experimental \"Hold Hill 109\", featuring a unit of thirteen Desert Rats whittled down over the course of a defensive action. More whimsical was \"Rattling Rommel\", which centred on a sentient scout car. August 1976 saw an overhaul of the title caused by the availability of Wagner, who had quit as editor of Valiant in frustration over the resistance he found to his radical changes. His contribution was the brutal \"Darkie's Mob\", featuring a rogue unit behind Japanese lines in Burma led by the fearsome Captain Joe Darkie. The strip was one of four new stories in the 14 August 1976 edition, which featured a cover by Don Lawrence. The other debutants were \"Operation Shark\" (young boys in the Channel Islands begin resistance efforts against the German occupation forces), \"Yellow Jack\" (about a greedy British soldier who fought like a demon for the chance to loot) and \"The Unknown Soldier\" (about an amnesiac Tommy unaware he's marked for death).\nBattle and Valiant 1976–1977)\nDespite the public campaign that forced Action out of circulation in the autumn, Battle Picture Weekly remained relatively untouched despite its violence. Hunt would recall receiving a letter of complaint about an episode of \"Darkie's Mob\", but replied that the content was based on a real-life incident and received no further censure. Instead the next change to Battle would come in October when the flagging Valiant was absorbed into the comic. Three strips were continued from the cancelled title from 23 October 1976 – two were war-themed, \"Soldier Sharp: The Rat of the Rifles\" and \"The Black Crow\", while Wagner's Clint Eastwood-inspired Judge Dredd-prefiguring maverick cop One-Eyed Jack wasn't. Hunt was not in favour of diluting Battles all-war content; nevertheless the merger considerably boosted the comic's sales. The other new arrival was Valiant's long-running flagship character Captain Hurricane; however his action-comedy would have fit badly with the rest of the comic, and he was instead assigned as host of the letters page. The unexpected merger saw three stories – \"Operation Shark\", \"The Unknown Soldier\" and \"Yellow Jack\" – cut short to make space. Battle and Valiant also received the Airfix Modeller's Club page, hosted by club president and comedian Dick Emery. The manufacturer paid a £100 a week for the page, a sum which Hunt recalled paid for around half of the scripts in the issue.\nD-Day Dawson finally met his end in the 22 January 1977 edition. The following week three new stories debut in the hundredth issue – \"Johnny Red\" followed pilot Johnny \"Red\" Reburn, who seized an opportunity to fly a Hurricane in support of the Red Air Force's Falcon squadron on the Eastern Front, by Tully and his frequent Roy of the Rovers collaborator Joe Colquhoun. The series was a then-rare positive portrayal of Russian characters in a British comic of the time. \"Joe Two Beans\" followed a taciturn Native American fighting for the US in the Pacific War, while a rare crossover saw Major Eazy take command of the Rat Pack. Mills and Wagner meanwhile were working on new science fiction title 2000 AD. Hunt was wary of the pair poaching Ezquerra, and had Alan Hebden create the American Civil War-set \"El Mestizo\" specifically to keep the artist on Battle. As it was, Ezquerra was overlooked for \"Judge Dredd\" in favour of Mike McMahon, a snub he took with considerable umbrage. \"Darkie's Mob\" meanwhile came to a violent end, and was replaced by \"The Sarge\", a similarly gritty collaboration between Finley-Day and Western, from the 25 June 1977 issue.\nBattle Action (1977–1980)\nMeanwhile, Action had returned from its six-week 1976 sabbatical heavily sanitised under the direct supervision of Sanders, himself under strict orders from IPC's board. The resulting bowdlerised version rapidly lost sales, and in November 1977 Action was folded into Battle. \"Hellman of Hammer Force\" was a suitable addition, while secret agent Dredger was reassigned to military intelligence. However, \"Spinball\" – a watered down version of Action's Rollerball-inspired \"Death Game 1999\" – was unconvincingly reworked into \"Spinball Wars\". The new arrivals meant the long-running \"The Bootneck Boy\" was among those to make way. Further change came when MacManus left his post of assistant editor to set up Starlord, a new IPC science fiction weekly. Ezquerra, still smarting from being overlooked for Judge Dredd, followed to work on Strontium Dog. He was replaced by Jim Storrie, and a fresh round of new features began in July 1978. \"Operation Shark\" returned, Hunt having never been pleased with the rushed conclusion ahead of the Valiant merger. Following the successful launch of 2000 AD Mills was free and returned to contribute \"Samurai\", which featured a Japanese protagonist; however, the writer quickly drew tired of the strip and ended it swiftly before beginning work on his next project. Storrie's tenure on Battle Action was short-lived as he was reassigned and replaced by Nick Landau – who lasted little longer, quitting IPC after feeling he was being misled about being granted editorship of 2000 AD.\nJanuary 1979 saw the debut of three new stories, as well as factual feature \"True Life Heroes\". \"Glory Rider\" focused on a reckless American tank commander, while \"HMS Nightshade\" by Wagner was an attempt to make a successful naval story, something he and Mills had found difficult. With John Cooper taking over \"Johnny Red\", Mills meanwhile worked with Colquhoun on a new strip, \"Charley's War\". Mills wanted to do an anti-war strip and found the trenches of World War I a perfect backdrop. He researched the conflict extensively to avoid repeating mainstream histories, notably consulting huge archives of soldiers' letters home which left him greatly moved. Hunt was highly impressed, and swore to keep the strip in the comic \"whether the readers like it or not\". However, the comic's most significant editorial change to date came in September 1979, when Hunt was moved over to work on new title Tornado as part of a reshuffle that saw Barrie Tomlinson appointed as group editor. Hunt's place was taken by Terry Magee, who responded to falling sales by returning the Rat Pack to service.\nBattle (1980–1983)\nIn July 1980 the comic underwent a significant redesign, with a new logo (with Action disappearing from the title, which was now simply Battle) and – for the first time – a front cover strip (typically rotated between \"Johnny Red\" and \"Charley's War\"), as well as switching to hand lettering. Another change was the appearance of creator credits, fruit of Mills and others' lobbying of Sanders to reverse IPC policy. However, sales continued to dip – not helped by the 1980 NUJ strike – and to keep profitability the title was forced to use reprints, beginning with \"Darkie's Mob\" in March 1981. Tomlinson and Magee also broke away from the all-war approach and commissioned works from other genres – \"The Fists of Jimmy Chang\" cashed in on the Bruce Lee-instigated  martial arts craze, \"Truck Turpin\" was based to the boom in interest in trucking and CB radio, while \"The Hunters S.I.6\" was effectively an unlicensed version of ITV hit The Professionals.\nThe editorial team were met with a quandary when war broke out in the Falkland Islands in 1982, causing a groundswell in British patriotism and increased interest in warfare. After some debate, the editorial team decided not to refer to the conflict until it was concluded. After the end of hostilities Wagner's \"Fight for the Falklands\" began. The writer would later admit a degree of embarrassment at the story, confessing he had got caught up in the jingoistic mood of the time and followed the initial government accounts of the fighting too closely. He was similarly unhappy with science fiction-tinged \"Invasion 1984!\", which he co-wrote with Alan Grant; the pair were so prolific at the time that Sanders insisted they use a pseudonym.\nBattle Action Force (1983–1987)\nJuly 1983 saw a four-week strip based on Palitoy's Action Force toyline – based on 3 3/4\" versions of the company's famous Action Man action figure. The strip was popular, and after a run of five free cover-mounted mini-comics, Battle was renamed Battle Action Force in October 1983. Three strips would be given over to the struggle of the multinational Action Force (consisting of infantry arm Z Force, special operations unit SAS Force, naval service Q-Force and space force Space Force)\nagainst terrorist Baron Ironblood and his endless, fanatical Red Shadows. The new arrival was a mixed blessing for the creators; Mills disliked the idea of appealing to younger readers, while others hated the silliness; John Cooper would describe the helmeted Ironblood as \"having a bucket on his head – like Ned Kelly gone mad\". Tomlinson meanwhile recalled each page of \"Action Force\" required approval from the manufacturer, complicating the production process. However it did bring an increase in sales, and as Palitoy underwrote the costs of the Action Force material it both allowed a steady stream of work and effectively halved the production costs of Battle at a time when the British comic industry as a whole was suffering declining sales. Palitoy also provided money for several circulation-boosting Action Force themed free gifts, the most remarkable of which was a bagged figure.\nAs a result of the Action Force arrival, the rest of the comic was reduced to just four other strips – \"Johnny Red\", \"Charley's War\" (which had undergone a 10-week hiatus in 1982 while Colquhoun recovered from a heart attack), \"The Hunters S.I.6\" and the reprint slot. The latter was running \"Major Eazy\";  as a result of Sanders declaring a no-smoking policy across all IPC publications, Eazy's cheroot had to be whited out of every frame, a process that Tomlinson wryly noted to many instances where the character appeared to be giving the V sign to readers.\nOne of the pitfalls of a licensed comic were shown in 1985, when Palitoy licensed American giant Hasbro's G.I. Joe: A Real American Hero line (a similar 3 3/4 downsizing of G.I. Joe) and issued them under the Action Force brand. Not only did the strip suddenly have to integrate a score of new Action Force personnel, but in the toyline terrorist organisation Cobra simply replaced the Red Shadows as the villains, leaving the comic with the unenviable task of providing a fictional transition. The same year, \"Charley's War\" also suffered upheaval. Having always envisioned the strip as a multi-generational epic that would follow Charley's descendants to the Troubles, Mills requested a research budget that would allow him to interview veterans ahead of the planned World War II arc, wanting to get the same fresh view beyond mainstream history books. He was refused, and quit; to Mills' chagrin the World War II story was written along traditional lines by Scott Goodall.\nRichard Burton took over as editor in 1986, but was unable to halt the slide in sales. The title at least outlived Warlord, which was cancelled in September 1986, but October saw the end of \"Charley's War\", the strip's popularity having nosedived after Mills' departure and encountering further problems as Colquhoun's health declined. A hammer blow to Battles hopes came in 1987, when Hasbro bought Palitoy. While they planned to continue the toyline, Hasbro had established a highly successful relationship with Marvel UK to promote their Transformers figures, and switched their backing as soon as possible. This not only greatly reduced Battle's profit margins but also left Burton and Tomlinson scrambling to fill half the comic.\nBattle with Storm Force (1987–1988)\nTheir response was to replace Action Force with the similar anti-terrorist organisation called Storm Force. To make up the budget shortfall, \"Johnny Red\" was switched to reprints; by May 1987 Battle contained four reprints – noticeably stretched out of proportion to fit a change in page size – from seven features, new material consisted of just two \"Storm Force\" strips\" – the latter was not popular and was reduced to a single strip, but the replacement for the dropped episode was another reprint. An attempt to find a new source of funding by producing a licensed strip based on Acamas' X-Changers toyline was little help, as neither the toys nor the strip were popular. In Tomlinson's words \"the end was inevitable\", and in January 1988 the title was merged into Eagle, which it bequeathed \"Storm Force\" and reprints of \"Johnny Red\" and \"Charley's War\".\nLegacy\nPreacher creator Garth Ennis was a loyal reader of Battle, and won a £2 prize in the 20 January 1979 edition after writing in to point out an error in tank identification in \"Crazy Keller\". He would later credit Mills, Wagner and Battle in general a major influence on his own writing.\nTitan Comics\nThe rights to the original material in Battle were among the IPC Youth Group properties consolidated into the resurrected Fleetway Publications and sold to Persimmon BPCC Publishing on 6 July 1987, and were later purchased by Egmont Publishing. From 1 April 2009, Egmont UK in conjunction with W H Smith announced 4 special reprint collections from their stable, including a collection of Battle strips.\nTitan Comics subsequently licensed various titles from Egmont for reprint collections, beginning with The Best of Battle in 2009. Collections of \"Charley's War\", \"Rat Pack\", \"Johnny Red\", \"Darkie's Mob\" and two volumes of Ennis-curated Battle Classics followed. In November 2015, the character of Johnny Red was revived by Ennis and illustrator Keith Burns for a new 8-part mini-series Johnny Red: Hurricane, published by Titan Comics.\nRebellion Developments\nIn 2016 Rebellion Developments purchased the rights owned by Egmont. Two years later in August 2018, they issued a new 3-part comic series Sniper Elite: Resistance by Keith Richardson and Patrick Goddard, a spin-off from the PS-4 game Sniper Elite. The story, set in German-occupied France in 1941, included an appearance by the Rat Pack. \"Darkie's Mob\" and \"Charley's War\" had previously been reprinted under license in Judge Dredd Megazine from 2003 onwards, while \"Lofty's One-Man Luftwaffe\" was collected in a supplement given away with Judge Dredd Megazine #397. Rebellion also reprinted stories under their Treasury of British Comics imprint, including \"El Mestizo\", \"Invasion 1984!\", \"Major Eazy vs. Rat Pack\", \"The Sarge\" and \"Clash of the Guards\".\nIn September 2020, Rebellion released a 100-page special issue of Battle, again on the Treasury of British Comics imprint. Entitled Battle of Britain Special, it featured ten new stories by various writers and artists. Several characters from past issues of Battle were revived including \"El Mestizo\", written by Alan Hebden, and a \"Rat Pack\" story by Ennis. Other stories featured new characters and settings including War Child by Dan Abnett, a story produced in association with the charity War Child. In June 2022, Rebellion published a hardcover Battle Action Special with new stories featuring characters from both comics, written by Ennis and with various artists.\nStarting in May 2023, Rebellion published a five-issue series of Battle Action, with each issue featuring two stories. In 2024, ten issues were announced for 2024 to 2025, containing ten episodes of a new \"Johnny Red\" story and also a complete story in each issue.\nStories\nTitles\n*Battle Picture Weekly (8 March 1975 [issue #1] – 16 October 1976 [issue #85])\n*Battle Picture Weekly and Valiant (23 October 1976 [issue #86] – 1 October 1977 [issue #135])\n*Battle Picture Weekly (8 October 1977 [issue #136] – 11 November 1977 [issue #141])\n*Battle-Action (19 November 1977 [issue #142] – 4 October 1980 [issue #283])\n*Battle Action (11 October 1980 [issue #284] – 25 July 1981 [issue #325])\n*Battle (1 August 1981 [issue #326] – 1 October 1983 [issue #439])\n*Battle Action Force (8 October 1983 [issue #440] – 29 November 1986 [issue #604])\n*Battle (6 December 1986 [issue #605] – 17 January 1987 [issue #611])\n*Battle Storm Force (24 January 1987 [issue #612] – 23 January 1988 [issue #664])\nSpin-offs\n*Battle Picture Weekly Summer Special (4 editions, 1975 to 1978)\n*Battle Picture Weekly Annual (7 editions, 1976 to 1982)\n*Battle Holiday Special (7 editions, 1980 to 1983 and 1987 to 1989)\n*Battle Annual (3 editions, 1983 to 1984 and 1988)\n*Battle Action Force Holiday Special (3 editions, 1984 to 1986)\n*Battle Action Force Annual (3 editions, 1985 to 1987)\n*Battle with Storm Force Annual (1 edition, 1989)\nCollected editions\n{| class=\"wikitable\" width=\"85%\"\n|-\n!width=28%| Title\n!width=10%| ISBN\n!width=15%| Publisher\n!width=13%| Release date\n!width=34%| Contents\n|-\n| The Best of Battle: Volume 1\n|\n|Titan Books\n|June 2009\n|\n|-\n| Rat Pack: Guns, Guts & Glory (Volume 1)\n|\n|Titan Books\n|September 2010\n|Material from Battle 8 March 1975 to 7 August 1976\n|-\n| Major Eazy: Heart of Iron (Volume 1)\n|\n|Titan Books\n|November 2010\n|Material from Battle 10 January to 27 March 1976\n|-\n| ''Johnny Red: Falcons' First Flight\n|\n|Titan Books\n|November 2010\n|\n|-\n|Darkie's Mob: The Secret War of Joe Darkie\n|\n|Titan Books\n|April 2011\n|Material from Battle 14 August 1976 to 18 June 1977\n|-\n| Johnny Red Volume 2: Red Devil Rising\n|\n|Titan Books\n|June 2012\n|\n|-\n| Johnny Red Volume 3: Angels over Stalingrad\n|\n|Titan Books\n|February 2013\n|\n|-\n| Garth Ennis Presents: Battle Classics\n|\n|Titan Books\n|January 2014\n|Material from Battle 14 October to 23 December 1978 and 6 January 1979 to\n|-\n| Garth Ennis Presents: Battle Classics Volume 2\n|\n|Titan Books\n|August 2016\n|Material from Battle 29 December 1979 to 19 September 1981\n|-\n| Johnny Red Volume 4: The Flying Gun\n|\n|Titan Books\n|September 2016\n|\n|-\n| Charley's War Volume 1 – Boy Soldier\n|\n|Rebellion Developments\n|18 April 2018\n|Material from Battle 6 January 1979 to 25 October 1980\n|-\n| Charley's War Volume 2 – Brothers in Arms\n|\n|Rebellion Developments\n|17 May 2018\n|Material from Battle 1 November 1980 to 10 July 1982\n|-\n|Charley's War Volume 3 – Remembrance\n|\n|Rebellion Developments\n|14 June 2018\n|Material from Battle 2 October 1982 to 26 January 1983\n|-\n|El Mestizo\n|\n|Rebellion Developments\n|15 November 2018\n|Material from Battle 4 June to 17 September 1977\n|-\n|Invasion 1984!\n|\n|Rebellion Developments\n|2 May 2019\n|Material from Battle 26 March to 31 December 1983\n|-\n|Major Eazy vs. Rat Pack\n|\n|Rebellion Developments\n|30 September 2020\n|Material from Battle 29 January to 23 April 1977\n|-\n|Death Squad\n|\n|Rebellion Developments\n|4 November 2020\n|Material from Battle 12 July 1980 to 4 June 1981 and Battle Annual 1982\n|-\n|Major Eazy Volume One: The Italian Campaign\n|\n|Rebellion Developments\n|4 March 2021\n|Material from Battle 10 January 1976 to 22 January 1977\n|-\n|The Sarge Vol. 1\n|\n|Rebellion Developments\n|12 May 2022\n|Material from Battle 25 June 1977 to 18 March 1978\n|-\n|Clash of the Guards\n|\n|Rebellion Developments\n|26 July 2023\n|Material from Battle'' 26 September 1981 to 20 February 1982\n|}\nReferences\nExternal links\n*\n*\n*\n*\n*\n*\n*"
    }
  ]
}