{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Paju__disambig_1\n\nFinnish volunteers\n| combatant2        =  Latvian Socialist Soviet Republic Soviet Russia\n| commander1        =  Hans Kalm Julius Kuperjanov Johannes Soodla\n| commander2        =  Emīls Vītols\n| units1            =  Tartumaa Partisan Battalion Pohjan Pojat\n| units2            =  Red Latvian Riflemen\n| strength1         = Estonia:300 soldiers13 machine guns2 field gunsFinnish volunteers:380 soldiers9 machine guns4 field gunsTotal:683 soldiers22 machine guns6 field guns\n| strength2         = 1,200 soldiers32 machine guns4 field guns1 armoured train\n| casualties1       = 156\n| casualties2       = 300 dead\n| coordinates       =\n}}\nThe Battle of Paju () was fought in Paju, near Valga, Estonia, on 31 January 1919 during the Estonian War of Independence. After heavy fighting, the Tartu-Valga group of the Estonian Army pushed the Red Latvian Riflemen out of the Paju Manor. It was the fiercest battle in the early period of war. Estonian commander Julius Kuperjanov fell in the fighting.\nBackground\nIn early January 1919 Estonian forces had started a full-scale counterattack against invading Soviets. Their main objective was liberating north Estonia including Narva, which was achieved by 17 January. They then started to advance into south Estonia. On 14 January the Tartumaa Partisan Battalion, organised and led by Lt. Julius Kuperjanov, and armoured trains liberated Tartu.\nAt that time the only working railway connection to Riga, which the Red Army had captured on 3 January, passed through Valga, so defending it had strategic importance for Soviet Russia. Among other units, a large part of the elite Latvian Riflemen were sent to stop the Estonians. Commander-in-chief Johan Laidoner reinforced the Estonian advance in the south, including Finnish volunteers, The Sons of the North, led by Col. Hans Kalm. Finnish Gen. Paul Martin Wetzer became commander of the southern front.\nBattle\nTo liberate Valga it was necessary to capture Paju Manor. On 30 January Estonian partisans had captured it, but were soon pushed out. With his 300 men, two guns and 13 machine guns Kuperjanov decided to recapture Paju on 31 January. Armoured trains were unable to support, due to the destruction of Sangaste railway bridge. The Latvian Riflemen had about 1,200 men with four guns and 32 machine guns. They were also able to rely on support from a Soviet armoured train and armoured cars.\nThe Tartumaa Partisan Battalion attacked the manor directly over open fields. At 400 metres the Bolsheviks opened fire, inflicting heavy casualties. Kuperjanov led the attack personally, as usual, and was badly wounded, dying two days later. When he was hit, Lt. Johannes Soodla took command of the battalion. Finnish Sons of the North units with about 380 men arrived later, bringing with them four guns and nine machine guns. They also assaulted the manor in a frontal attack, which caused heavy losses.\nIn the evening the Estonians and Finns finally pushed into the park of the estate where heavy hand-to-hand combat started, which resulted in the capture of the manor. Retreating Latvian Riflemen were subjected to heavy fire. The next day the Estonians marched into Valga without resistance.\nAftermath\nThe bloody Battle of Paju resulted in the liberation of Valga the next day. The victory cut off the Soviets' railway supply line and denied them the use of armoured trains. Soon almost all of southern Estonia was liberated and Estonian troops advanced into northern Latvia.\nTo honour Julius Kuperjanov, who died of the wounds he sustained during the battle, on 2 February, the Tartumaa Partisan Battalion was renamed Kuperjanov's Partisan Battalion. The current Estonian Defence Force still includes the Kuperjanov Battalion. The battle is commemorated by a granite monument on a three–step pyramid of earth, which was reopened by Estonian President Lennart Meri in 1994 on the 75th anniversary of the battle.\nSee also\n*Estonian War of Independence\n*Heimosodat\n*Latvian Riflemen\n*Latvian War of Independence\nFootnotes\nReferences\n*\n*\n*[https://web.archive.org/web/20071011123141/http://mil.ee/uusmil/?menu=maavagi&sisu=kuper Eesti Kaitsevägi:Kuperjanovi Üksik-jalaväepataljon]\nExternal links\n*[https://web.archive.org/web/20071206121907/http://home6.inet.tele.dk/ron/Estonia/Pohjan_Pojat.htm Pohjan Pojat]\n*[http://www.kool.ee/?5760 Kool.ee: Paju Lahing]\n*[https://web.archive.org/web/20070905151057/http://www.hot.ee/is2004/photos/photo_85.html Paju lahingu monument]\n*[https://web.archive.org/web/20070902171411/http://www.hot.ee/vabadussoda/teema.htm Vabadussõda: Uue hooga rünnakule]"
    }
  ]
}