{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Ceuta (1182)\n\ntemplate -->\n| map_type          =\n| map_relief        =\n| map_size          =\n| map_marksize      =\n| map_caption       =\n| map_label         =\n| territory         =\n| result            = Almohad victory\n| status            =\n| combatants_header =\n| combatant1        =  Kingdom of Portugal\n| combatant2        = Almohad Caliphate\n| combatant3        =\n| commander1        =  Fuas Roupinho\n| commander2        = Unknown\n| commander3        =\n| units1            =\n| units2            =\n| units3            =\n| strength1         = 21 ships\n| strength2         = 54 ships\n| strength3         =\n| casualties1       = 11 ships lost\n| casualties2       = Unknown\n| casualties3       =\n| notes             =\n| campaignbox       =\n}}\nThe Battle of Ceuta took place in 1182, pitting the Portuguese and Almohad fleets off the coast of Ceuta. The Portuguese suffered a bitter defeat, losing a significant portion of their fleet, including their renowned admiral Fuas Ropinho.\nBackground\nIn 1180, Portugal commissioned its inaugural fleet in history And achieved significant successes against Almohad ships at Cape Espichel then Ceuta In June 1182, the Portuguese fleet faced a severe setback against the Almohad fleets of Ceuta and Seville in the Battle of Silves. The Portuguese lost 20 to 30 ships and 1,800 prisoners in this defeat.\nBattle\nIn 1182, following the setback near Silves, Fuas Ropinho, the admiral of the Portuguese fleet, decided to launch a new raid on Ceuta with a naval force of 21 galleys. However, the Portuguese navy was struck by a storm on the Algarve coast, forcing him to enter the Mediterranean. On 17 September, Fuas found himself in Ceuta, surrounded by a large Almohad fleet of 54 galleys who had already learned of the upcoming raid. The Portuguese chose to fight despite the inequality of the forces. The Portuguese were defeated with a loss of 11 galleys, and Fuas was killed. The remaining ships returned to the kingdom, reporting the news of the defeat.\nReferences"
    }
  ]
}