{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Seedaseer__disambig_1\n\n| casualties2 = 150\n| campaignbox =\n}}\nThe Battle of Seedaseer was a battle of the Fourth Anglo-Mysore War on 6 March 1799 at Seedaseer (near present-day Siddapura, Karnataka), a hill and pass on the border of the Coorg and Mysore country 7 miles from Piriyapatna and with a view almost as far as Seringapatam.\nBattle\nLieutenant-General James Stuart and the Bombay Army of 6,500 under his command advanced from Cannanore, aiming to cross the Western Ghats and converge at Seringapatam with the larger Madras Army advancing from the east. He then took up a defensive position on the Anglo-Mysore frontier to await further orders from General George Harris, placing his right brigade in an advanced position at Seedaseer on 2 March so as to better receive Harris's orders. This was under Lieutenant-Colonel John Montresor and was made up of what are now the 1st and 2nd Maratha Light Infantry battalions and the now-defunct 1st Bombay Pioneers. He kept his other 2 brigades, the main body of his force, at Siddapura and Ahmootenaar 8 to 12 miles from Seedaseer.\nReceiving news of a possible Mysorean march Stuart reinforced the advanced position with one more battalion of Sepoys. This advance was Tipu's main force moving to destroy the Bombay Army (whilst a small Mysorean force held off the Madras Army), and reached Seedaseer at 9am on 6 March 1799.  Stuart led the Left Brigade there as reinforcements by 2pm, forcing Tipu to withdraw.\nThe place where this battle took place was in the Jagir of Nawab Subhan Khan, father of Nawab Qutub Ali Khan. This place was taken over by Government of India after Police action in 1948.\nEstimation\nThe Governor-General Richard Wellesley, Earl of Mornington wrote in his despatches to the British East India Company's directors \"I am confident that your most honourable Court will be of the opinion that the conduct and success of the Army of Bombay on that day [at Seedaseer] has seldom been equalled and never surpassed.\", and the battle's anniversary has been celebrated annually ever since as \"Seedaseer Day\" with regimental sports and, in the case of the 2nd Battalion, with a pageant of episodes during the battle in replicas of the 1799 uniforms.\nReferences\nExternal links\n*http://www.britishempire.co.uk/forces/armyunits/indianinfantry/103rdmahratta.htm\n*https://web.archive.org/web/20081013133631/http://www.lib.mq.edu.au/digital/seringapatam/letter.html\n*https://web.archive.org/web/20081120194931/http://www.lib.mq.edu.au/digital/seringapatam/other/stuart1799.html\n*https://web.archive.org/web/20110726145613/http://www.burmastar.org.uk/mli_chapter_9.htm"
    }
  ]
}