{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Bab El Oued\n\nFrench Republic\n| combatant2        =  OAS\n| commander1        =  Charles Ailleret\n| commander2        =  Raoul Salan\n| strength1         =\n| strength2         =\n| casualties1       = 15 killed77 wounded\n| casualties2       = 20 killed60 wounded\n}}\nThe Battle of Bab el Oued () was an armed confrontation which occurred during the latter stages of the Algerian War (1954–1962) between the French Army and the Organisation armée secrète (OAS) which opposed Algerian independence. It took place in Bab El Oued, then a working-class European quarter of Algiers, from 23 March to 6 April 1962.\nContext\nOAS uprising (19 March)\nThe OAS was an organization of hard-line European \"Pied-Noirs\" living in (the then-French territory) Algeria who were opposed to the cease-fire announced by French president Charles de Gaulle on 19 March 1962 between French forces and the Front de libération nationale (FLN) forces fighting for Algerian Independence. The OAS decided to dig in at their stronghold of Bab El Oued (a traditionally European working-class area) to fight the Evian Agreements by force.\nSiege of Bab el Oued (from 23 March to 6 April)\nThe Battle of Bab el Oued was principally a battle between the French Gendarmerie Mobile and the OAS Commando Delta. The French government forces used M8 Greyhound armoured cars to control the exits to the town whilst suspicious buildings were surveilled from the air by T-6 and T-28 aircraft departing from Boufarik Air Base. Four T-6s strafed the roofs to clear them from snipers after Army helicopters dropped canisters with tear gas.\nAs part of the attack, naval artillery support from the s  and  was planned, though it soon became evident that this was not practical and the bombardment was called off. Most of the troops setting siege to the quarter had been ferried to Algeria by Surcouf and Maillé-Brézé, along with other three destroyers, on 2 March.\nIn support of Bab-el Oued, 200 OAS maquis marched from Algiers to Ouarsenis, a mountainous region between Oran and Algiers. They tried to capture two French military outposts and gain support from local Muslim tribes loyal to France, but instead these forces were harassed and eventually defeated by French Foreign Legion units led by Colonel Albert Brothier after several days of fighting.\nArrest of General Jouhaud (25 March)\nOn 25 March 1962, General Edmond Jouhaud (adjutant to the commander of the OAS Raoul Salan and commander of the OAS-Oranie, the Oran branch of the OAS) was arrested at the Hôtel Panoramic d'Oran with his adjutant, Commander Julien Camelin.\n1962 Isly massacre\ntook place. After independence, the rue d'Isly'' (which was named after the Battle of Isly) was renamed in honour of FLN commander Larbi Ben M'hidi.]]\nThe 1962 Isly massacre was an incident which occurred on 26 March 1962 in which a largely peaceful demonstration of anti-independence Pied-Noirs attempted to force their way through French Army roadblocks around the Great Post-Office of Algiers. The demonstrators encountered a roadblock manned by 45 soldiers from the 4th Tirailleur Regiment who fired on the crowd with machine guns. Between 50 and 80 Pied-Noirs demonstrators were killed in the massacre.\nCasualties\nAccording to the historian Benjamin Stora, 15 French soldiers and 20 OAS members were killed during the Battle of Bab el Oued, and around 150 were wounded. Six French soldiers were killed by the OAS in a previous ambush.\nReferences\nExternal links\n* [http://www.adimad.fr/pour-lhistoire/la-bataille-de-bab-el-oued-23-mars-6-avril-1962/ Chillet, La Bataille de Bab-el-Oued, article from the journal Accent Grave n.14 April 1963]\n* [http://www.ecpad.fr/fusillade-a-bab-el-oued-dirigee-sur-le-2e-bataillon-du-73e-rima-au-poste-de-zouaves Fusillade à Bab-el-Oued dirigée sur le 2e bataillon du 73e RIMa au poste de zouaves,'' ECPAD]"
    }
  ]
}