{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Wassaw Sound\n\nUnited States (Union)\n|combatant2  =  CSA (Confederacy)\n|commander1  = John Rodgers\n|commander2  = William A. Webb\n|strength1   = 2 ironclads1 gunboat\n|strength2   = 1 ironclad ram2 wooden steamers\n|casualties1 = none\n|casualties2 = 1 killed16 wounded1 ironclad captured\n}}\nThe Battle of Wassaw Sound (or the Capture of CSS Atlanta) was an American Civil War naval battle between the Confederate ram CSS Atlanta under Captain William Webb and the  ironclad monitors  and  and the gunboat USS Cimmerone (later named Cimmaron), which took place on 17 June 1863 in Wassaw Sound,  a bay in the present day state of Georgia.  Atlanta ran aground while attempting to break the Union blockade, and after a short battle surrendered to the Union forces.  Captain Rodgers became a national hero, and he was promoted to commodore and received the Thanks of Congress as a result of his decisive victory.\nBackground\nOn 10 June 1863, Rear Admiral Du Pont had received reports  was about to descend the Wilmington River for a foray into Wassaw Sound and ordered monitors  and  and gunboat USS Cimmerone to enter Wassaw Sound to stop the Confederate ironclad ram's attack, should she make one, and to prevent her escape. Captain John Rodgers in Weehawken had overall command of the Union force.\nFive days later, in the early evening of 15 June, Atlanta got underway and passed over the lower obstructions in the Wilmington River to get into position for a strike at the Union forces in Wassaw Sound. Webb dropped anchor at 8:00&nbsp;p.m. and spent the remainder of the night coaling. The next evening \". . . about dark . . .,\" Webb later reported, he \". . . proceeded down the river to a point of land which would place me in 6 or 7 miles of the monitors, at the same time concealing the ship from their view, ready to move on them at early dawn the next morning.\"\nBattle\nAtlanta, accompanied by wooden steamers  and , got underway before daylight on 17 June. A percussion torpedo was fitted to a long spar projecting forward from the ram's bow which Webb intended to detonate against Weehawken.  During battle maneuvers Atlanta suddenly ran aground and swayed at an angle which made it difficult to shoot. Weehawken held fire until she was at  and then pounded the immobile ship. Nahant had \"drawn the fire\" of Atlanta allowing Weehawken to draw within firing distance.\nAfter receiving five of Weehawkens  shots, which knocked a hole in her casemate, crushed the pilot house and port shutter and severely wounded its pilots and several helmsmen, Webb was compelled to surrender immediately.  The battle lasted only a few minutes, and Atlanta became the first Confederate ironclad to surrender to the Union.  Meanwhile, the two boats escorting Atlanta sailed upriver for safety.\nAftermath\nAtlanta suffered the sole fatality of the battle, as well as 16 wounded. At the time of capture, 21 officers and 124 men, including marines were taken captive. Atlanta was condemned by a prize court in September 1863, repaired and commissioned as  on 2 February 1864.  Captain Rodgers became a national hero, and received the Thanks of Congress along with a promotion to commodore.\nNahant was involved in the action but withheld fire, which later led to a Supreme Court case which determined the commander and crew of Nahant deserved participation in the prize for the captured vessel.\nReferences\nBibliography\n*"
    }
  ]
}