{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Little Robe Creek__disambig_1\n\n|result=United States victory\n|combatant1=TonkawaCaddoAnadarkoWacoShawneeDelawareTawakoni\n|combatant2= ComancheKiowaApache\n|commander1= John Salmon FordShapley Prince RossPlacido-TonkawaO'quinn-TonkawaJim Pockmark-Caddo-AnadarkoJose Casa Maria-CaddoShot Arm-WacoJim Linney-Shawnee-DelawareNid-e-wats-Tawakoni\n|commander2=Iron JacketPeta Nocona\n|strength1=100 Americans113 Indian allies\n|strength2=200–600\n|casualties1=2 killed and 4–5 wounded\n|casualties2=76 killed60 captured400 horses captured\n|map_type=Oklahoma\n|map_caption=Location within Oklahoma\n|map_label=Little Robe Creek Battlefield\n}}\nThe Battle of Little Robe Creek, also known as the Battle of Antelope Hills and the Battle of the South Canadian, took place on May 12, 1858. It was a series of three distinct encounters that took place on a single day, between the Comanches, with Texas Rangers, militia, and allied Tonkawas attacking them. The military action was undertaken against the laws of the United States at the time, which strictly forbade such an incursion into the Indian Territories of Oklahoma, and marked a significant escalation of the Indian Wars. It also marked the first time American or Texas Ranger forces had penetrated the Comancheria as far as the Wichita Mountains and Canadian River, and it marked a decisive defeat for the Comanche.\nMilitary historians distinguish between the Antelope Hills expedition by the Texas Rangers and the Battle of Little Robe Creek, with the former being the entire campaign against the Comanche conducted from January to May 1858, starting in Texas above the Edwards Plateau, and continuing on to the Indian Territories in what is now Oklahoma. The latter is the specific May 12 battle at Little Robe Creek, with all three encounters counting as one sustained, day-long battle. Since federal troops would not attack the Comanche and Kiowa in that portion of the Comancheria, the Texas Rangers launched the incursion into the Antelope Hills.\nBackground\nThe years 1856 to 1858 were particularly vicious and bloody on the Texas frontier, as settlers continued to expand their settlements into the Comanche homeland, the Comancheria. Valuable Indian hunting grounds were plowed under, and grazing ranges for the Comanche horse herds were lost. The Comanche realized their homeland of the Comancheria was increasingly encroached on by Anglo-Texas settlers, so they struck back with a series of ferocious and bloody raids into Texas.\nThe United States Army proved wholly unable to stem the violence. Federal units were being transferred out of the area for reasons that seemed driven more by political than military considerations. At the same time, federal law and numerous treaties forbade incursion by state forces into the federally protected Indian Territories. The U.S. Army was likewise instructed not to attack Indians in the Indian Territories or to permit such attacks. The reasoning behind the order was that many native tribes, such as the Cherokee, were engaged in farming, and living as peaceful settlers, while other tribes, such as the Comanche and Kiowa, continued to use that part of the Indian Territories that was the Comancheria to live in while raiding white settlements in Texas.\nThe relationship between the federal government, Texas, and the native tribes was further complicated by a unique situation that arose as a result of Texas' annexation. The federal government is charged by the U.S. Constitution to be in charge of Indian affairs and took over that role in Texas after it became a state in 1846, but under the terms of Texas' accession to the Union, the new state retained control over virtually all of public land within its boundaries. In most other new states, the overwhelming majority of publicly owned land belonged to the Federal government as well as sole jurisdiction over Indian affairs, in particular the authority to make treaties guaranteeing reservations for various tribes. However, Texas adamantly refused to contribute public land in the state for Indian reservations, but still expected the federal government to be responsible for the cost and details of Indian affairs. Since federal Indian agents in Texas believed that Indian land rights were the key to peace on the frontier, little progress towards a peaceful settlement was even attempted on account of the attitude of Texas officials on the question of Indian homelands.\nAs the Civil War loomed, federal forces were moved off the frontier with greater frequency. These troop movements, including the transfer without replacement of the 2nd Cavalry in Texas, left much of the frontier of the Great Plains without protection from Indian attacks. The loss of the 2nd Cavalry in Texas was a particularly bitter blow to settlers. Texas Governor Hardin Runnels had campaigned for office in 1856 on a platform to put an end to the raids. He publicly expressed astonishment and rage when the 2nd Cavalry was transferred to Utah and ultimately disbanded altogether. Governor Runnels determined to re-establish disbanded Ranger battalions, which were reduced after Texas' annexation. On January 27, 1858, Runnels appointed John Salmon \"Rip\" Ford, a veteran Ranger who had fought both in the Mexican–American War and on the frontier against the Indians, as captain and commander of the Texas Rangers, militia, and allied Indian forces, and ordered him to carry the battle to the Comanche homeland of Comancheria.\nwas made captain and commander of the Texas Ranger, Militia, and Allied Indian Forces]]\nFord, whose habit of signing the casualty reports with the initials \"RIP\" for \"Rest In Peace,\" was known as a ferocious and no-nonsense Indian fighter. Commonly missing from the history books was his proclivity for ordering the wholesale slaughter of any Indian, man or woman, he could find. Ford's reason for this was simple: Comanche raids were brutal in their treatment of settlers. The Comanche, at that time, generally made no distinction between age and race of victims, except that men old enough to fight were expected to fight to the death as most Native Americans would, never allowing themselves to be captured alive by the fierce Comanche, who regarded surrender as cowardice. Girls, (females below puberty) and young boys (generally up to a year or two below puberty) were generally tested and if found to be strong, healthy, and intelligent, were adopted into the band. Women over puberty were raped and used as slaves.\nThe Comanche as a people had originated as a branch of the Shoshone people living along the upper Platte River in Wyoming. The Comanche emerged as a distinct group shortly before 1700, when they broke off from the Shoshone as they migrated south. This coincided with their acquisition of the horse from the Spaniards, which allowed them greater mobility in their quest for better hunting grounds. Their population explosion as a distinct tribe of their own came in part from the huge numbers of women and children adopted into the tribe. As the original Comanche moved southward into a swath of territory extending from the Arkansas River to the area of central Texas north of the Edwards Plateau, their population increased dramatically because of the abundance of buffalo as an easy food supply, an influx of Shoshone migrants, and the adoption of significant numbers of women and children taken captive from rival groups. The Comanche made no distinction between those born into the tribe, and those adopted into the tribe. Military historians believe the Comanche's relatively recent acquisition of their domain made them all the more determined to fight to keep it. Their success against the Spanish, Mexicans, and early Texans led them to believe the tactics that had enabled them to win, including unrelenting raids and thefts against settlements, would continue to be successful.\nThis violence towards settlers cost roughly 17 settler lives per mile for settlement of the Comancheria. Thus, Ford determined to meet brutality with brutality. Governor Runnels issued explicit orders to Ford, \"I impress upon you the necessity of action and energy. Follow any trail and all trails of hostile or suspected hostile Indians you may discover and if possible, overtake and chastise them if unfriendly. The governor's instructions were simple, and Ford intended to follow them. He then raised a force of about 100 Texas Rangers and state militia. Realizing that with Sharps rifles and modern Colt revolvers he needed additional men, Ford set out to recruit ones he did not have to pay, as he did his Rangers and militia.\nRecruiting \"friendly\" Indians\nAmong the traditional enemies of the Comanche were the Tonkawa Indians, then on a reservation on the Brazos River in Texas. Immortalized and praised in Texas history as friends and allies of the Texas settlers, these histories generally downplay the fact the Tonkawa were cannibals and were despised by virtually every other Indian tribe. Ford, who had witnessed Tonkawa brutality to other Indians, had no reservations about using cannibals to help him, as long as they were eating Comanches, not Rangers.\nOn March 19, 1858, Ford went to the Brazos Reservation, near what today is Fort Worth, Texas, and recruited the Tonkawa into his forces. Indian agent Captain S. P. Ross, (father of the future Texas Governor Lawrence Sullivan Ross) called Chief Placido of the Tonkawa to a war council, where he used rhetoric to stir Placido's anger against their mutual traditional enemies, the Comanches. At least 120 warriors volunteered, 111 of them Tonkawa, led by Placido, and scouts were sent to locate Comanche camps north of the Red River in the Comancheria in the Oklahoma Indian Territories.\nThe Tonkawa Indians, commanded by their \"celebrated\" chief, Placido, were hailed as the \"faithful and implicitly trusted friend of the whites\" (with limited mention of their cannibalism) and undertook a campaign with approximately an equal number of Texas Rangers against the Comanches. Ford and Placido were determined to follow the Comanche and Kiowa up to their strongholds amid the hills of the Canadian River and into the Wichita Mountains, and if possible, \"kill their warriors, decimate their food supply, strike at their homes and families, and generally destroy their ability to make war.\"\nAntelope Hills expedition\nIn February 1858, Ford established Camp Runnells near what used to be the town of Belknap. Ford, still operating under Governor Runnell's explicits orders to \"follow any and all trails of hostile and suspected hostile Indians, inflict the most severe and summary punishment,\" and to \"allow no interference from any source.\" (That source was interpreted to mean the United States, whose Army and Indian agents might try to enforce federal treaties and federal statutory law against trespassing on the Indian territories in Oklahoma).\nOn April 29, Ford's Rangers, accompanied by Tonkawa warriors, Caddo, Anadarko, Shawnee, and other allied Indian scouts from the Brazos Indian Reservation, crossed the Red River into the Indian Territory. The force then advanced into the portion of the Comancheria in the Indian Territories in Oklahoma. Ford and S. P. Ross led the men across the Red River, into the Indian Territory, violating federal laws and numerous treaties, with Ford stating later that his job was to \"find and fight Indians, not to learn geography.\"\nBattle\nFirst encounter\nThe first of three distinct encounters between the invading Texas forces and the Comanche occurred at sunrise on May 12, 1858. Ford considered his attack—and the entire campaign—a just response to the Comanche raids on settlers. Neither side observed rules concerning not harming noncombatants. Thus, at the break of dawn at Antelope Hills on Little Robe Creek in the heart of the Comancheria, Ford's men attacked the first Comanche camp they found. The Tonkawa asked, and were granted, permission to attack the sleeping Comanche lodges, which were less than a dozen in number.\nWhat Comanche women and children were able to get out of the lodges without being killed or captured by the Tonkawa fled for their lives, while the few men who survived the original attack tried desperately to cover their flight. Ford's Ranger forces attacked the fleeing Comanche, effectively using their pistols, killing every warrior during their retreat and numerous women and children, Ford reported, \"it was not an easy matter to distinguish Indian warriors from squaws\".\nFehrenbach and other historians have labelled this a massacre, where a sleeping village was attacked without warning, and the population slaughtered, the dead later eaten (by the Tonkawas) or enslaved among the allied Indian tribes. Historian Jerry Denson notes that Ford joked about the deaths of \"squaws and such.\"  Ford's own memories, though, captured in ''Rip Ford's Texas'', edited by Stephen B. Oates, makes clear that he considered the Indian Wars a ruthless struggle for the very survival of Texas, in which the only rule was to protect the settlers, by \"whatever means were necessary.\"\nSecond encounter\nThe second encounter was not as easy as the first, though Ford's official reports made clear the Texans had every intention of doing to the second encampment what they had done to the first. The mixed force under Ford proceeded on, and attacked a moderately large encampment of about 70-100 lodges further upriver. Fortunately for the Comanche, a warrior saw the Texan forces advancing upriver after the original dawn attack on the solitary encampment and had ridden hastily to warn the larger village. Thus, the Comanche were able to mount a defensive action, protecting their women and children at the cost of many warriors' lives.\nMost devastating to the Comanche, their legendary Chief, Phohebits Quasho, Iron Jacket, \"professed to blow arrows aside from their aim\", was killed in the fighting. He had worn a Spanish coat of mail in battle which had earned him a reputation of invincibility as it evidently protected him from some light weapons fire. However, Jim Pockmark, a Tonkawa sharpshooter, managed to hit him with a Sharps rifle, something no mail could protect him from, although Ford reports he was taken down when \"six rifle shots rang on the air\".\nIron Jacket, an older man, probably in his 60s at the time, had rallied his men after warning had arrived of the attack on the first small group of lodges a short distance from his encampment, and had ridden directly in front of the attacking Rangers and Indians, challenging them to individual combat. While this had worked in his battles with previous foes, who lacked the powerful weapons able to penetrate the armor he wore, it got him killed at Little Robe Creek. His warriors were badly distressed by his death, as Iron Jacket had explained his breath could blow bullets away. The Comanche second in command was killed by a shot from Chul-le-quah, the Shawnee captain. Had reinforcements not speedily arrived, his followers might have been killed in the chaos after his death.\nThird encounter\nAfter Iron Jacket was killed, Ford's lieutenants expected him to immediately attack the outnumbered warriors. They believed they could kill them, kill or capture the fleeing women and children, and continue on upriver. Ford's lieutenants and Placido were surprised when he ordered the force to hold fast. Ford had seen movement in the hills above Little Robe Creek and believed a large force of Indians was coming. His feeling may have saved his forces from disaster. Iron Jacket had sent messengers to warn others and summon help, especially the nearest encampment, led by his son Peta Nocona, the husband of Cynthia Ann Parker. Nocona arrived on the scene with at least 100, and perhaps more, Comanche reinforcements. (Ford claimed in his report to the governor that Peta Nocona commanded at least 500 warriors, but this is highly unlikely, as he rarely had more than 100 men under his command, and additional warriors would have taken more time arriving from more distant encampments).\nRealizing that his warriors, with their bows and lances, could not fight at close quarters with the Rangers and their revolvers, and not intending to repeat the mistake of his father, Peta Nocona attempted to lure them into the woods surrounding Little Robe Creek, where the Comanches' legendary skill on horseback and with bows and lances could be brought into play, with the woods negating some of the advantages of the Texan superior firepower.  Ford, though, was having nothing to do with that. Despite the attempts of the Comanche to lure their traditional enemies, the Tonkawa, to single combat, and repeated challenges to the Rangers to do the same, Ford ordered the Tonkawa to cease after a number were killed in single combat by Comanche warriors. Ford later reported of the Comanche challenges to single combat:\nIn these combats the mind of the spectator was vividly carried back to the days of chivalry; the jousts and tournaments of knights; and to the concomitants of those scenic exhibitions of gallantry. The feats of horsemanship were splendid, the lances and shields were used with great dexterity, and the whole performance was a novel show to civilized man.\nHowever much he admired the show, Ford had no intention of either engaging a Comanche in single combat, allowing any of his troops to do so, nor did any express any desire to go out and meet a Comanche challenge to single combat. Ford put an end to his Indian allies accepting these challenges when they lost most of the combats.\nAfter the end of the single battles between Tonkawa and Comanche, he first ordered the Tonkawa to attack the Comanches in mass, hoping that this would lure Peta Nocona to commit his forces wholesale to battle, at which point Ford would order in his Rangers, with their far superior firepower. The strategy failed, though, when he realized that the Tonkawa had removed the white bands he had ordered them to put on their heads so he could differentiate between Indian allied and enemy warriors in the heat of battle. (Ford and the most experienced Indian fighters probably could tell the difference, as the Comanche used distinctive dress, headdress (buffalo horns), and paint, but most of his men could not tell one from the other. Seeing the Tonkawa apparently being defeated, he signaled them with bugles to retreat. As the Tonkawa withdrew, Ford then ordered a wholesale charge by his Rangers and militia.\nPeta Noncona and his warriors responded by retreating from the massed deadly revolver fire. Noncona already knew this weaponry was far different from the single-shot weapons they had mastered facing. They had, before the advent of repeating weapons, allowed the gunmen to fire their single-shot weapons while the Comanche swirled about. Then, the typical Comanche warrior could fire as many as six arrows in the space of a minute, long before their opponent could reload, usually killing their opponent.\nPeta Nocona had no intention of allowing his men to be caught in the open facing numerous repeating weapons. Therefore, in response to the charge from Ford's forces, the Comanche retreated instead of standing to fight. At that point, the entire battle turned into a chaotic running fight over several miles, which negated much of the massed firepower of the Texans. In the end, the vast bulk of the Comanche force under Peta Nocona safely retreated, having bought time for Iron Jacket's people and their own families up the Canadian to flee. Nocona's band was able to even pack up their lodges, food supplies, and possessions, and move them as well.\nWarriors from more distant encampments of Kiowa, Kiowa Apache, and Comanche were now arriving. The odds increasing against him, and with ammunition limited, Ford chose to end the battle and the campaign in Antelope Hills. At twilight, Ford began an orderly withdrawal and retreated back to Texas. Before he left, however, he burned the lodges of Iron Jacket's people and destroyed their food stores and possessions, reaching Camp Runnells on May 21.\nAftermath\nThe Tonkawa warriors with the Rangers celebrated the victory by decorating their horses with the bloody hands and feet of their Comanche victims as trophies. They also had containers with various other body parts, which they cut off and ate in a \"dreadful feast\". \"The Rangers noted most of their dead foes were missing various body parts, and the Tonkawa had bloody containers, portending a dreadful victory feast that evening.\" \"The coat of mail worn by old Iron Jacket covered his dead body \"like shingles on a roof.\" The Rangers cut up the mail and divided the pieces as trophies.\nFord triumphantly returned to Texas, claiming he had killed 76 Indians and captured 16, though official Army records state 60 casualties. Ford requested that the governor immediately empower him to raise additional levies of Rangers and return north at once to continue the campaign in the heart of the Comancheria. Runnels had exhausted half the budget for defense for the year, though, and disbanded the Rangers at the end of six months.\nThe overall impact of the campaign was significant. For the first time, Texan or American forces had penetrated into the heart of Comancheria, attacked Comanche villages with impunity, and successfully made it home. The U.S. Army later adopted many of Ford's tactics, including attacking civilians as well as warriors, and destroying the buffalo herds that were a main source of food for their enemies, in their campaigns against the Plains tribes following the Civil War.\nReasons for success\nAs Frank Secoy and John C. Ewers emphasize in their military history book Changing Military Patterns on the Great Plains, the Comanche and other Plains Indians had combined mastery of horsemanship while incorporating first, their native weapons of bow and lance, then single-shot firearms, with the horse, but two things combined to alter this battlefield dynamic: first, the Rangers adopted the nomad tactics of cold camp and relentless pursuit to the Indian encampments; second was the introduction of rapid-fire pistols and rifles. Thus, the Texans had surprised the Comanche in the heart of their homeland. The invention and deployment of rapid-rate firearms destroyed the tactics the Plains Indians had developed and used with such success against the Spanish, Mexicans, and early Americans.\nIn this battle, the two factors combined to give a glimpse of what would end the Plains Indians' way of life since horses had made them true nomads. Although the \"Comanche\" had always been a nomadic people, the horse transformed them into a true nomadic culture, and a very warlike one. In the Journal of American History, Pekka Hämäläinen estimates, as do most military historians and cultural anthropologists, that around 1700, the Comanche accessed a sufficient number of Spanish horses that they were able to make the leap from dog- and human-assisted nomadic hunter-gatherer to a true nomadic culture. The effects of this transformation were radical. Because they were the first Plains tribe to fully incorporate the horse into their way of life, and into their way of making war, they were far and away the best at it. Though rare, the only successes the Spanish ever had in battle with the Comanche were on occasions that they were able to take them by surprise. Since the Comanche became classic horse nomads, though, this was never easy to do. Only when the Rangers had adopted classic Comanche tactics of cold camps, forced marches, and use of scouts were they able to alter the dynamic of nomadic cavalry attacking fixed settlements. At Little Robe Creek, they in large part succeeded in surprising the Comanche.\nTechnology had changed weapons vastly in favor of the settlers. Certainly the Spanish, then the Mexicans, and later the Texans had learned that single-shot weapons were not enough to defeat the deadly Comanche light horsemen, whose mastery of cavalry tactics and mounted bowmanship were renowned. The Comanche's constant movement caused many of their opponent's older single-shot weapons to miss their target in the chaos of battle. The Comanche could then easily kill their enemies before they had a chance to reload. Though it was understated, the Comanche learned to use single-shot firearms quite well, though they found bows superior in terms of rate of fire. The Comanche put an end to Spanish expansion in North America. They did what no other indigenous peoples had managed, defending and even expanding their homelands, in the face of the best military forces the Spanish could bring against them. In the late 18th century, the Comanche were said to have stolen every horse in New Mexico. Their raids into Mexico were so devastating that one primary goal of the Mexican government after the Mexican–American War was a treaty that would compel the United States to end the Comanche raids into Mexico. In addition, the United States promised compensation for those raids that made it to Mexico. In the years between 1848 and 1853, Mexico filed 366 claims for Comanche and Apache raids originating from north of the border.\nThe scorched earth tactics employed by the Rangers resulted in the destruction of Comanche lodges, food supplies, and horse herds. This left the survivors without even the most limited means to survive. The killing of women and children had occurred before, on both sides, but this marked a watershed in terms of open use as of attacks on noncombatants as a tactic of war. The Texans had had limited success against the Comanche until repeating firearms ended their battlefield domination, and new Ranger fighting tactics took the battle to the Comanche heartland. In the face of the attack on their homeland, the Comanche were defeated and forced to retreat. Only Peta Nocona's leadership saved the day, as he was able to retire skillfully enough that the entire battle disintegrated into a running individual gun battle over several miles.\nSee also\n* List of battles fought in Oklahoma\nReferences\nFurther reading\n* Exley, Jo Ella Powell, Frontier Blood: The Saga of the Parker Family,\n* Fehrenbach, Theodore Reed The Comanches: The Destruction of a People. New York: Knopf, 1974, . Later (2003) republished under the title The Comanches: The History of a People\n* Foster, Morris. Being Comanche.\n* Frazier, Ian. Great Plains. New York: Farrar, Straus, and Giroux, 1989.\n* Lodge, Sally. Native American People: The Comanche. Vero Beach, Florida 32964: Rourke Publications, Inc., 1992.\n* Lund, Bill. Native Peoples: The Comanche Indians. Mankato, Minnesota: Bridgestone Books, 1997.\n* Mooney, Martin. The Junior Library of American Indians: The Comanche Indians. New York: Chelsea House Publishers, 1993.\n* [http://www.nativeamericans.com/Comanche.htm Native Americans: Comanche]  (August 13, 2005).\n* Richardson, Rupert N. The Comanche Barrier to South Plains Settlement: A Century and a Half of Savage Resistance to the Advancing White Frontier. Glendale, CA: Arthur H. Clark Company, 1933.\n* Rollings, Willard. Indians of North America: The Comanche. New York: Chelsea House Publishers, 1989.\n* Secoy, Frank. Changing Military Patterns on the Great Plains. Monograph of the American Ethnological Society, No. 21. Locust Valley, NY: J. J. Augustin, 1953.\n* Streissguth, Thomas. Indigenous Peoples of North America: The Comanche. San Diego: Lucent Books Incorporation, 2000.\n* Moore, R Edward. [http://www.texasindians.com/comanche.htm \"The Texas Comanches\" on Texas Indians] (August 14, 2005).\n* Wallace, Ernest, and E. Adamson Hoebel. The Comanches: Lords of the Southern Plains. Norman: University of Oklahoma Press, 1952.\nExternal links\n* Fort Tours: [http://www.forttours.com/pages/antelope.asp Antelope Hills]\n* Denson, Jerry & The Ellis County Historical Society: [http://www.usgennet.org/usa/ok/county/ellis/littlerobe.html The Battle of Little Robe Creek, 1858]  – \"Our Ellis County Heritage 1885-1979\" - AHGP/ALHN Independent Oklahoma Genealogy & History (OkGenNet)"
    }
  ]
}