{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Sacramento (Kentucky)\n\n|combatant2=\n|commander1= Lieutenant Colonel Nathan Bedford Forrest\n|commander2= Maj. Eli H. Murray\n|strength1=200–300\n|strength2=500\n|casualties1=2 killed, three wounded.\n|casualties2=10 killed and 13 captured according to Union sources, nearly 100 killed and thirty-five captured according to Confederate sources.\n}}\n| locmapin    = Kentucky#USA\n| built       =\n| architect   =\n| added       = March 24, 1998\n| area        =\n| refnum      = 97000875\n}}\nThe Battle of Sacramento was an engagement of the American Civil War that took place in Sacramento, Kentucky on December 28, 1861. Confederate cavalry under Lieutenant Colonel Nathan Bedford Forrest, numbering between 200 and 300, attacked, encircled and defeated a Union force of 500 under Major Eli H. Murray which had been watering south of the town after moving across the bank of the Green River. Though exact casualty information is disputed, with differing accounts from each side, several eyewitnesses attested to the personal courage of Forrest, and the Confederate commander was praised by his superiors for his bravery.\nThe engagement was one of the earliest of Forrest's career as a commander of the cavalry, and it featured several examples of tactics and traits which would become hallmarks of his military career, including the division of his forces, outflanking and encirclement, concealment, and personally leading cavalry charges. It was also an early battle for Brigadier-General Stovepipe Johnson, who was then a private. The Union force was decisively routed, and the battle became known as \"Forrest's First Fight\" and is annually re-enacted by local residents.\nPrelude\nBoth the Union Army and the Confederate forces recruited and drilled within Kentucky, as the state's population \"displayed divided loyalties\" during the early stages of the Civil War. Confederate Major-General Leonidas Polk began taking Kentucky villages in September 1861 with the blessing of Jefferson Davis, despite the protests of Confederate commanders Simon Bolivar Buckner and Leroy Walker. Union Brigadier-General Ulysses S. Grant approached using the Ohio River and stationed himself at Paducah, arriving to face newly appointed Confederate General Albert Sidney Johnston. By October, with both armies maneuvering in an attempt to gain the upper hand, Forrest's battalion was ordered to Kentucky from Memphis, Tennessee, reporting to Colonel Adolphus Heiman. Heiman was charged with constructing Fort Henry and Fort Donelson and had requested a unit of cavalry to support him.\nForrest had with him eight companies recruited from Alabama, Kentucky, Tennessee and Texas. Drilled for close combat, the majority of the force was armed with shotguns. He quickly established himself in the region, laying an ambush for a Union gunboat on November 20 and forcing it back. He continued to skirmish with gunboats for the remainder of the month, captured a Union supply center on November 24 - narrowly avoiding a sniper's bullet that instead took the life of his surgeon - and received reinforcements of two new companies from Huntsville, Alabama.\nThe battle\nOn the morning of the battle, Forrest and his cavalry corps were approaching Sacramento when they were informed by a sympathizer named Mollie Morehead that the Union force led by Eli H. Murray was watering their horses nearby. Forrest, who had been wintering in camp near Hopkinsville with his family since Christmas, had already taken scouting reports that morning which stated that the enemy force had been nearby moving along the banks of the Green River, and was keen to attack. Despite cold weather and light rain, Forrest led his forces in pursuit. Morehead rode alongside Forrest, and the latter would later remark that \"her untied tresses, floating in the breeze, infused into my arm and kindled knightly chivalry in my heart.\"\nFile:Eli Houston Murray.jpg | Major Murray\nFile:NathanBedfordForrest.jpg | Colonel Forrest\nForrest led two hundred cavalry troopers divided into three groups: one dismounted to attack from the front while concealed by bushes and fences, while two - one of thirty men and one of sixty - remained mounted to outflank the Union forces, which were five hundred strong. The Union forces were at first unsure as to the identity of the arriving troops, however they returned fire once Forrest had fired the opening shot himself. He then led the cavalry charge personally, signaled it with a cry to the bugler of \"blow the charge, Isham.\" The outflanking forces then became embroiled in hand-to-hand combat with the now fleeing Union troops.\nAn eyewitness account by Confederate Private James Hammer noted that Forrest personally killed nine enemy soldiers, despite having his horse shot out from under him. Many of Forrest's officers, who had not seen him fight before, were surprised by his aggression that replaced his \"usually mild\" demeanour. Union and Confederate sources disagree on the number of casualties, with Union accounts recording the deaths of two officers and eight men, with thirteen prisoners. Confederate sources state that \"closer to a hundred\" were killed, and thirty-five captured. Forrest himself suffered a dislocated shoulder after being dismounted by a collision with two riderless horses.\nThe battle was Forrest's first combat victory, and during it he demonstrated several tactics for which he would later become known: in particular, the division of his forces into groups, employment of deception and encirclement, and leading the cavalry charge personally. The battle is often nicknamed \"Forrest's First Fight\", and his superior at the time, Brigadier-General Charles Clark, took note of his \"skill, energy and courage.\" Clark wrote to his government that \"I am assured by officers and men that throughout the entire engagement he was conspicuous for the most daring courage; always in advance of his command. He was at one time engaged in a hand-to-hand conflict with 4 of the enemy, 3 of whom he killed, dismounting and making a prisoner of the fourth.\" The battlefield was listed on the National Register of Historic Places in 1998, and the battle is annually re-enacted by local residents.\nSee also\n* List of Kentucky Civil War Confederate units\n* Kentucky in the Civil War\nReferences\n;Notes\n;Sources\n*\n*\n*"
    }
  ]
}