{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Lincelles\n\nFrench Republic\n|combatant2=|}}\n|commander1= Jean Baptiste Jourdan\n|commander2= Duke of York| Prince of Orange}}\n|strength1= 5,000\n|strength2= 10,000\n|casualties1=\n|casualties2=\n}}\nThe Battle of Lincelles was an action that took place as part of a larger manoeuvre on 17 August 1793 in the Flanders Campaign of the War of the First Coalition. It was fought between the forces of Revolutionary France under the command of Jean Baptiste Jourdan and , versus those of Great Britain under Frederick Augustus, Duke of York and Albany and the Dutch Republic under the Hereditary Prince of Orange. The action resulted in a coalition victory.\nThe battle\nIn the Autumn of 1793 the Allied forces of Prince Josias of Saxe-Coburg-Saalfeld were poised to invade France. The Hereditary Prince of Orange held Menin with 10,000 Dutch troops, with instructions to cover the movement of the corps of Prince Frederick, Duke of York and Albany in his advance towards Dunkirk. To facilitate this and take advantage of York's nearby support Orange decided to lead a column against the French-held village of Lincelles, while another under the Friedrich Karl August, Prince of Waldeck and Pyrmont attacked La Blaton slightly to the north.\nNews of the attack reached the French forces under command of Jean-Baptiste Jourdan and Antoine Anne Lecourt Béru, who were mustering to launch their own raid against Menin. Immediately Jourdan directed these forces, 5,000 strong, to retake the lost posts. This was achieved, Béru's column retaking Lincelles, whilst the brigade of Jacques MacDonald advanced from Quesnoy-sur-Deûle, surprised the Dutch at Blaton and captured 7 cannon. Representative Jean Pierre Dellard, who came up after the action, later wrote, \"The interior of the redoubts, which had just been taken, afforded a spectacle of fearful carnage\".\nThe Prince of Orange appealed to the Duke of York for reinforcements, and at around 2.00 pm the nearest troops, Gerard Lake's brigade consisting of three battalions of Foot Guards, were dispatched. Lake arrived on the field at 6.00 pm and attempted to rally some of the scattered Dutch, but it quickly became apparent they had no more stomach for fighting. So, despite being vastly outnumbered, he determined to attack alone with just 1,122 men.\nThe Diary of Lieutenant Thomas Powell (14th Foot) records \"It was about 1 of clock at night before we could get clear of the Dutch\"  On top of the hill in front of Lincelles the French held two large redoubts plus other works that covered the road, as well as their flanks being covered by woods and ditches. Lake deployed on the hill under a heavy artillery fire, the 1st Guards at the front, with the Coldstream Guards and 3rd Guards forming up on their left. The Guards delivered three or four musket volleys and charged the position, stormed the earthworks, chased the Republicans through the village and captured 10 guns. Lake then re-formed on the other side of the hill. Béru attempted another stand but was again charged and broken, his men fleeing to Bondues. Jourdan, who tried to stem the flight with a battalion in reserve, wrote, \"It was not a retreat but a rout\".\nAftermath\nAt Blaton to the left Macdonald heard the news of the rout and withdrew in good order to Quesnoy-sur-Deûle. The French then retreated to Lille where they were reformed.\nLake held the position until nightfall supported by two Dutch battalions, until relieved by six battalions of Hessians and two British. He'd captured 12 guns (two of them Dutch pieces lost during the retreat of Orange's men), 70 prisoners and a colour, for the loss of 39 dead and 139 wounded men and officers, Captain-Lieutenant Colonel Thomas Bosville of the 2nd Guards being one of the dead.\nThe Duke of York then continued his advance towards Ypres and Furnes, before opening the Siege of Dunkirk.\nAssessment\nFortescue wrote of Lake's intervention, \"The action was undoubtably most brilliant, and the conduct of the men beyond all praise... but it is a grave reflection on the Duke of York that he should so thoughtlessly have exposed some of his best troops to needless danger, leaving them isolated and unsupported for several hours\". Alfred Burne disagreed, \"Lake did indeed call for help, but on what seems inadequate grounds: he was in no real danger. To have diverted a bigger proportion of the British army from the march to Dunkirk merely to engage in a transient fight in order to oblige the Dutch would have been to infringe the principle of economy of force\".\nNotes\nReferences\n*\n*\n*\n*"
    }
  ]
}