{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Tallinn\n\nBattle of Tallinn may refer to:\n* Battle at the Iron Gate, a possible 1032 Novgorod failed naval attack near the Estonian stronghold.\n* Battle of Lindanise, a 1219 Danish conquest of the Estonian stronghold in the Livonian Crusade.\n* Siege of Tallinn, a 1221 failed Estonian siege of the Danish stronghold in the Livonian Crusade.\n* Siege of Lindanise, a 1223 failed Estonian siege of the Danish stronghold in the Livonian Crusade.\n* Siege of Lindanise, a 1223 failed Russian and Estonian siege of the Danish stronghold in the Livonian Crusade.\n* Battle of Lindanise, a 1227 Livonian Brothers of the Sword capture of the Danish stronghold in the Livonian Crusade.\n* Battle of Sõjamäe, a 1343 Livonian Order attack on Estonian forces near the town in the St. George’s Night Uprising.\n* Battle of Jerusalem Hill, two 1560 de facto independent Reval attacks against Muscovite forces near the town in the Livonian War.\n* Battle of Reval, a 1569 Danish and Lübecker naval bombardment and sack of Reval Harbour in the Livonian War.\n* Siege of Reval, a 1570–1571 failed \"Livonian\" and Muscovite siege of the Swedish town in the Livonian War.\n* Siege of Reval, a 1577 failed Muscovite siege of the Swedish town in the Livonian War.\n* Battle of Reval, a 1602 Polish-Lithuanian attack on Swedish forces near the town in the Polish–Swedish War (1600–11).\n* Siege of Reval, a 1710 Russian siege to capture the Swedish town.\n* Battle of Reval, a 1790 failed Swedish naval attack on the Russian fleet at the harbor roadstead in the Russo-Swedish War (1788–1790).\n* Bombing of Tallinn in World War II, 1941–1944 German and Soviet aerial bombing raids of the city.\n* Two battles during the Summer War of World War II:\n** Battle of Tallinn, a 1941 German capture of the city from Soviet forces.\n** Soviet evacuation of Tallinn, a 1941 naval evacuation of the city and the Gulf of Finland.\n* Tallinn Offensive, a 1944 offensive to retake the city from German forces in World War II.\n** Attempt to restore independence, a 1944 failed Estonian attempt to recapture the city from German forces and to hold it against Soviet forces.\n** Battle of Tallinn, the final battle of that offensive."
    }
  ]
}