{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Hawija\n\n)\n| place             = Eastern Iraq\n* Eastern Saladin Governorate\n* Kirkuk Governorate\n* Northern Diyala Governorate\n| territory         = The Iraqi Army recaptures Hawija, 155 villages, and the rest of the eastern Salahuddin and Diyala Provinces\n| result            = Iraqi victory\n| status            =\n| combatant1        = Supported by: CJTF–OIR\n*\n| combatant2        =\n| commander1        = Abdel Emir Yarallah() Qais Khazali() Akram al-Kaabi() Abu Mushtaq()\n| commander2        =  Qusay Hassan Wali Al-Bayati \"Abu Haytham\"() Abu Nasser al-Zawbaei() Abu Abdullah al-Tajiki()\n| units1            =\n*  Iraqi Security Forces\n**  Iraqi Armed Forces\n***\n**** 9th Division\n**** Emergency Response Division\n****  Iraqi Special Operations Forces\n***\n**  Iraqi Police\n* Popular Mobilization Forces\n**  Asa'ib Ahl al-Haq\n** Harakat Hezbollah al-Nujaba (HHN)\n** Badr Organization\n** Quwat al-Shaheed al-Sadr al-Awal\n** Liwa al-Taff\n**  Turkmen Brigades\n*** 16th Brigade\n*\n| units2            =\n*  Military of the Islamic State\n** Garrison of Wilayat Kirkuk and Wilayat Dijlah\n*** Saladin Battalion\n** Elite forces\n*** Seekers of Martyrdom\n| strength1         = 42,000 soldiers\n| strength2         = 1,500–2,000 militants\n| casualties1       = Unknown\n| casualties2       = 942 killed (Iraqi claim)1,000 captured or surrendered\n| casualties3       =\n| campaignbox       =\n}}\nThe Battle of Hawija was an offensive launched in September 2017 by the Iraqi Army, in order to recapture the town of Hawija and the surrounding areas from the Islamic State (IS).\nThe offensive was concurrent with the 2017 Central Syria campaign by the Syrian Army to capture IS territory towards Deir ez-Zor, as well as with the Raqqa campaign (2016–17) conducted by the Syrian Democratic Forces (SDF) against IS's de facto capital city and stronghold in Syria.\nBackground\nHawija, which is located  west of Kirkuk city, had been a bastion of Sunni Arab insurgents since the United States-led invasion of Iraq in 2003. In 2013, Iraqi Prime Minister Nouri al-Maliki ordered his forces to open fire on peaceful protesters in Hawija. In return, Sunnis became convinced of using violence to counter Maliki's sectarian policies while also giving substantial support to Islamic State of Iraq and the Levant. The group captured the city in June 2014 when it seized control of most of northern and western Iraq. It became isolated from the rest of the group's territory in July 2016 during the Mosul offensive and was its last stronghold in Iraq. The offensive had been repeatedly delayed due to various sectarian issues, as well as disagreements over the involvement of the Peshmerga and the Popular Mobilization Forces militia.\nTimeline of the offensive\nPMF reject claims according to which they harass local Sunnis as suspected IS supporters.]]\nThe offensive began on 20 September, from the northwest of Hawija, as Iraqi forces recaptured four villages northeast of al-Shirqat (which itself was captured a year earlier during the 2016 Mosul offensive). On the following day, the Iraqi forces managed to liberate at least 11 villages in the Hawija pocket, killing and wounding several terrorists in the process. The goal of Iraqi forces is penetrating the city of Hawija with several side wings, as they want to secure these important areas in the Kirkuk Governorate. On 22 September, Iraqi forces liberated approximately 140 square kilometers of territory north of the district of Hawija from the Kirkuk Governorate. Led by Hashd Al-Sha'abi (Popular Mobilization Forces), Iraqi forces have liberated at least 15 villages in the Al-Shirqat district, located directly northwest of the country. On 24 September, the Iraqi forces declared that they had finished Phase 1 of the offensive, having liberated all of the areas north of the Al-Zab River, along with some other areas west of the Tigris River and in the northern Makhoul Mountains. They also stated that they killed 200 IS militants during the operation. On 29 September, Iraqi forces launched the second phase of the offensive, capturing four villages and entering the town of al-Abbassi. Iraqi forces reported that they killed another 200 IS militants on the first day of Phase 2 of the offensive.\ncommanders with IRGC advisors during the 2017 Hawija offensive]]\nOn 4 October, Iraqi troops entered the city of Hawija; with the local IS garrison showing relatively little resistance, the government forces quickly sized several neighborhoods. On the following day, Iraqi forces took control of the city centre and liberated the entire city. On October 8, the Iraqi Army cleared out the remaining IS-held points, and with the victory in Hawija, Iraqi Defense Ministry's War Media Cell released an updated map of the country, showing the remaining areas of Iraq under IS control now limited to the western Anbar Province and southwestern Nineveh Province.\nThis offensive saw the first time that large numbers of IS fighters had surrendered en masse, instead of fighting to the death. It was also noted that in the \"Hawija Pocket,\" IS fighters put up little to no resistance at all, other than planting bombs and booby traps.\nIraqi war hero Abu Tahsin al-Salihi was killed in action within this operation, on September 29, 2017.\nAftermath\nSee also\n* 2017 Western Nineveh offensive\n* Battle of Tal Afar (2017)\n* Abu Tahsin al-Salhi\n* 2017 Western Iraq campaign\nReferences"
    }
  ]
}