{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Aydın__disambig_1\n\nGreece\n| combatant2        =  Kuvva-i Milliye\n| commander1        = Georgios Kondilis  Colonel SchinasColonel Stavrianopoulos\n| commander2        = Yörük Ali Efe\n| strength1         = 2 regiments (~3,000 men)\n| strength2         = 1,920 infantry and 17 cavalry\n| casualties1       =\n| casualties2       =\n| casualties3       = 1,500 to 2,000\n| notes             =\n}}\nThe Battle of Aydın (Modern Turkish: Aydın Savunması, literally: \"The defence of Aydın\", 27 June 1919 to 4 July 1919), was a series of wide-scale armed conflicts during the initial stage of the Greco-Turkish War (1919-1922) in and around the city of Aydın in western Turkey. The battle resulted in the burning of several quarters of the city (primarily Turkish, but also Greek) and massacres which resulted in the deaths of several thousand Turkish and Greek soldiers and civilians. The city of Aydın remained in ruins until it was re-captured by the Turkish army on 7 September 1922, at the end of the Greco-Turkish War.\nBackground\nAydın was a central town of the fertile Menderes River (Meander) valley in western Turkey. Although Menderes River valley was not mandated for an occupation by Greek troops by the Paris Peace Conference, 1919, Italian Navy's movements off the coast of Kuşadası had oriented the Greek high command towards becoming the first power to establish an influence in this region.\nExtension of occupation zone\nThe Greek High Commissioner Aristidis Stergiadis, who had arrived in Smyrna on 21 May, authorised on 23 May the troops commanded by Colonel Nikolaos Zafeiriou to issue orders for the occupation of Aydın, Manisa and Turgutlu. The subject of the size of the territory to be occupied by Greek forces were to be governed by uncertainty until 2 June, when Commodore Maurice FitzMaurice from the Royal Navy was appointed to determine the limits of the occupation zone.\nInter-Allied Commission\nThe principal source on the fighting and the massacres remains the Report of the Inter-Allied Commission of Inquiry of October 1919. This report was ordered by the Paris Peace Conference acting on a July 1919 letter by the Ottoman sheikh ul-Islam and prepared by four generals of the Allied powers following their on-the-spot checks and presented to the Conference in October. In Aydın, the Inter-Allied Inquiry Commission had held several meetings for a week in early September 1919, in the city of Aydın self, in Çine in the Italian zone, to hear the statements of Turkish refugees from Aydın, and in Nazilli in the zone occupied by the forces of the Turkish national movement, where it interrogated refugees, including Greek refugees, also from Aydın.\nActive stage\nAfter its occupation of Smyrna, the Greek army had started to advance into inner Western Anatolia from the first day of their landing at Smyrna and the incursion had extended into the Menderes valley in the second week of the occupation. Aydın, the central city of the region, was occupied on 27 May. The rapid advance of Greek troops into the country had increased the agitation of the population.\nThroughout the Aydın region the population was armed, Turks as well as Greeks. The Greek Command also erred in tolerating the action of armed Greek civilians, armed by Greece since February, who, under the pretext of assisting the Greek troops, began looting and committing all manner of excesses.\nInitial Armed conflicts, 27 June\nleft\nThe warfare around Aydın started by an ambush on 27 June of a Greek patrol by irregular Turkish forces led by Yörük Ali Efe at Malgaç train station, south of Aydın.\nConflicts in downtown, 28 June\nAccording to the Inter-Allied Inquiry Commission's report, in the course of reconnaissance patrols around Aydın, some of the villages were burned down by Greek detachments. They were repulsed in Malgaç and the efe pursued the troops till the outskirts of the city of Aydın.\nOn 28 June, the attackers began to use 105-mm guns. Some of the fires that broke out in the quarter of Cuma, one of Aydın's Turkish quarters, in the morning of 29 June started during this engagement. Other fires also broke out in this quarter at various isolated points. A large number of Turkish men, women and children who were trying to leave the burning quarter were killed for no reason by the Greek soldiers, who were guarding all the exits that led from this quarter to the northern part of the town. The report observes that there was no doubt that the Greek Command and troops ran amok. The Greeks evacuated the town in the night of 29 June and early hours of 30 June after having committed numerous attacks and other crimes. A large number of Greek civilians hoping to escape by accompanying the troops as they retreated were prevented from doing so by the Command.\nA subsequent fire in the Greek quarter was started by Turkish gangs under their leader Yöruk Ali, once they took control of the city. The gangs entered the quarter in the morning of 30 June and burnt it down after having looted the houses, killing the occupants. Irrespective of age or sex, a number of Greek inhabitants encountered by the gangs as they roamed through the town were ruthlessly killed. Around 2000 or 3000 inhabitants were robbed but not killed. They had managed to take refuge in the French convent before the gangs arrived, after which they sought the protection of Colonel Şefik Bey, Commander of the small Ottoman Division present in the city.\nReoccupation, 4 July\nThe Greek troops, with the help of reinforcements sent by General Konstantinos Nider, headed by lieutenant Colonel Stavrianopoulos recaptured Aydın on 4 July. The reoccupation of Aydın was ordered by the Greek High Command in spite of the express orders of the representative of the Entente. The Greek authorities acted on orders received from Venizelos in Paris on 2 July. These orders prevented the representative of the Entente from intervening in the matter. Once in Aydın, they set fire to the Turkish quarter situated in the western part of the town, where there were also some Greek factories.\nAccording to the Inter-Allied Inquiry Commission report, all the fires that were started between 29 June and 4 July most probably had destroyed two thirds of the city of Aydın, which had a population of 20,000, including some 8000 Greeks.\nMost of the villages situated along the railway track between Balacık and Aydın were also destroyed by fires started in the course of the military operations that took place in the region. The occupation of the vilayet of Aydın by the Greek forces had caused significant material losses to crops and property, some attributable to looting, theft and the destruction of livestock. Considerable losses were also suffered due to the burning of houses, villages and the town of Aydın.\nAftermath\nBefore the Greek army returned to Aydın, most of the Turkish population had already left the town and surrounding area, with the Turkish soldiers, in order to take refuge in the Italian zone or in the Nazilli-Denizli region, where they remained till the end of the war.\nOn the other hand, the Greek population of the town was either massacred by the Turks (the dead bodies found by the Greek army after the retake of the town), or taken to captivity in the interior of Anatolia.\nColonel Georgios Kondylis with his regiment took orders to hunt the Turkish and did so by passing the Meander river and entering the Italian zone.\nEnd of hostilities\nThe city of Aydın remained in ruins until it was re-captured by the Turkish army on 7 September 1922, at the end of the Greco-Turkish War (1919-1922).\nCasualties\nIt has not been possible for the Inter-Allied Inquiry Commission to ascertain the total number of Greek or Turkish victims. The representative of the Greek Government, who gave evidence before the Commission on 7 September, estimated the number of Greek victims to be in the region of 2000. Some 900 bodies had already been recovered by that time. An English witness put this number at about 400. A French officer conducting an on-the-spot investigation several days after the events took place put the number of victims at 1500 to 2000 Greeks and 1200 to 1500 Turks, however acknowledging that estimating the number of Turkish victims was a very difficult task.\nResults\nInter-Allied Inquiry Commission valued the losses resulting from the burning of Aydın at approximately eight million Pounds sterling (1919 currency terms). When the Turkish inhabitants abandoned their houses and fled from the districts occupied by the Greeks, they also abandoned their crops, leaving them unharvested. The indirect losses were estimated to be at one million two hundred thousand Pounds by the Commission. The total losses (direct and indirect) in 2005 values using the UK Retail Prices Index [http://www.measuringworth.com/calculators/ppoweruk/] were in the order of 283,160,000 Pounds sterling (about five hundred million United States dollars roughly).\nSee also\n* Turkish War of Independence\n* Greco-Turkish War (1919-1922)\n* Chronology of the Turkish War of Independence\n* Occupation of Smyrna\n* Menemen massacre\n* The Greek genocide\n*King–Crane Commission\n*Alexandros Mazarakis-Ainian\nReferences"
    }
  ]
}