{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Punta Colares\n\n| result            = Inconclusive\n| combatant1        =\n| combatant2        =  United Provinces\n| commander1        =  Rodrigo Lobo\n| commander2        =  William Brown\n| strength1         = Ships:\n3 corvettes\n5 brigs\n2 brigantines\n2 schooners\n2 gunboats\nTotal guns: ~155\n| strength2         = Ships:\n1 corvette\n4 brigs\n2 schooners\n12 gunboats\nTotal guns: ~126\n| casualties1       = 8:3 killed5 woundedNo ships lost\n| casualties2       = 21:6 killed15 woundedNo ships lost\n| caption           = Combate de Punta Colares, by José Murature, 1865\n}}\nThe naval Battle of Punta Colares, also known as the Battle of Corales, was the first major naval engagement of the Cisplatine War. It took place between a fleet of the Empire of Brazil, commanded by admiral Rodrigo José Ferreira Lobo, and a squadron of the United Provinces of the Río de la Plata under the command of admiral William Brown. The confrontations began at around 10 o'clock on 9 February 1826 and lasted for seven hours.\nBackground\nAfter war broke out between the Empire of Brazil and the United Provinces of the Río de la Plata on 10 December 1825, the Brazilian government responded by imposing a naval blockade on the port of Buenos Aires on 31 December 1825, aiming to cripple Argentine finances. Since then there had been no major naval engagements between both belligerent states. In the early morning of 9 February 1826 the Argentine squadron left the port of Buenos Aires and made its first attempt to break the blockade.\nOrder of battle\nEmpire of Brazil\n{| class=\"wikitable\"\n! style=\"text-align: left;\" | Ships\n! style=\"text-align: left;\" | Type\n! style=\"text-align: left;\" | Guns\n|-\n| Liberal\n| Corvette\n| 22\n|-\n| Itaparica\n| Corvette\n| 22\n|-\n| Maceió\n| Corvette\n| 18\n|-\n| 29 de Agosto\n| Brig\n| 18\n|-\n| Caboclo\n| Brig\n| 18\n|-\n| Real Pedro\n| Brig\n| 18\n|-\n| Dona Januária\n| Brig\n| 14\n|-\n| Rio da Prata\n| Brig\n| 10\n|-\n| Pará\n| Brigantine\n| 8\n|-\n| Leal Paulistana\n| Brigantine\n| 6\n|-\n| Liberdade do Sul\n| Schooner\n| Unknown\n|-\n| Conceição\n| Schooner\n| Unknown\n|-\n| N° 8\n| Gunboat\n| 1\n|-\n| Montevideana\n| Gunboat\n| Unknown\n|-\n|}\nUnited Provinces of the Río de la Plata\n{| class=\"wikitable\"\n! style=\"text-align: left;\" | Ships\n! style=\"text-align: left;\" | Type\n! style=\"text-align: left;\" | Guns\n|-\n| 25 de Mayo\n| Corvette\n| 28\n|-\n| Congreso Nacional\n| Brig\n| 18\n|-\n| Republica Argentina\n| Brig\n| 18\n|-\n| General Belgrano\n| Brig\n| 16\n|-\n| General Balcarce\n| Brig\n| 16\n|-\n| Sarandí\n| Schooner\n| 3\n|-\n| Pepa\n| Schooner\n| 3\n|-\n| 12 Gunboats\n| Gunboat\n| At least 2 guns each\n|-\n|}\nBattle\nThe Argentine squadron was spotted leaving the port of Buenos Aires in the early morning of 9 February 1826. Admiral Rodrigo Lobo gave orders to the Brazilians to lift the anchors and set sail. Only at 10 o'clock admiral Lobo ordered the ships to turn to their sides and start the confrontations. Both squadrons approached each other and the Brazilians took the offensive. At 14:45 the Brazilians spotted more Argentine ships. The corvettes Liberal and Itaparica opened fire against the 25 de Mayo and the Argentine brigs. The Argentine brigs abandoned the combat and were soon followed by the gunboats. Isolated and sustaining the enemy fire alone, the corvette 25 de Mayo also fled.\nAt 5 o'clock the Brazilians once again managed to approach the Argentine squadron. The corvette Liberal and the brig 29 de Agosto opened fire against the 25 de Mayo and the Congreso Nacional, firing at them for one and a half hour.\nAftermath\nIt was the first time that admiral William Brown had tried to face the Brazilian fleet. The result was not favourable to Brown and the Argentine squadron, although the Brazilian admiral did not take advantage of the situation to further attack them. After the battle, at night, the Brazilians anchored between the Ortiz and the Chico sandbanks. Admiral William Brown then planned a combined attack against the city of Colonia del Sacramento, which was controlled by the Brazilians and was under siege by troops on land, on 25 February 1826.\nReferences\nCitations\nBibliography\n*\n*\n*"
    }
  ]
}