{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Matapan__disambig_1\n\n| combatant1        =  Ottoman Empire\n}}\n| combatant2        =\n*\n* Malta\n*\n}}\n| commander1        =  Ibrahim Pasha\n| commander2        =  Marcantonio Diedo\n* Lopo F. de Mendonça\n}}\n| strength1         = 34 ships  24 galleys  1 frigate\n| strength2         = 22 ships  21 frigates  9 galleys\n| casualties1       = Unknown\n| casualties2       = Unknown\n}}\nThe Battle of Matapan, also known as the Battle of Cape Matapan, was a naval battle in the Laconian Gulf, an arm of the Mediterranean Sea, fought between the Republic of Venice and the Ottoman Empire on 19 July, 1717, off Cape Matapan in southern Greece. It was part of the Seventh Ottoman-Venetian War of 1714 – 1718. Reliable details are scarce and the battle was inconclusive, although the Venetian side declared themselves victors. Venice would go on to lose the war and its major possession in southern Greece, the Kingdom of the Morea on the Peloponnese.\nThe Venetian fleet was supported by a mixed squadron of allied ships from Portugal, the Papal States and the Knights Hospitaller of Malta. The Ottoman fleet was commanded by Kapudan Pasha Ibrahim Pasha.\nPrelude\nOn July 2, two Venetian squadrons joined forces off of Cape Matapan. The first squadron, composed of 24 sailing ships, was led by  Capitano delle Navi Marcantonio Diedo. The second was a squadron of 24 galleys commanded by Captain General of the Sea Andrea Pisani. They met a small squadron of nine mixed Portuguese and Maltese ships led by the Maltese knight Bellefontaine.\nThe combined fleet, facing unfavorable winds, was unable to reach the island of Sapientza as planned. Desperate for water, they risked being trapped in the Laconian Gulf and sailed to the island of Cranae (Marathonisi), located off of Gytheio, to resupply.\nBattle\nThe allied fleet was organized into four divisions: Diedo was in the van; following was the center led by his second-in-command Correr. The third or rear division was commanded by Dolfin. The fourth or allied division was commanded by Bellefontaine.\nOn 19, July the Venetians sighted the Ottoman fleet of 30 sailing ships and 4 galleys to their south, on the west side of the gulf entrance. The Ottomans, with a light wind from the south-southeast, had the advantage. Diedo was unable to sail to the west of the Ottoman fleet, and he decided to sail east across the gulf.\nAt sunrise, Ibrahim attacked Venice's rear division with six of his ships; the rest of the Ottoman fleet sailed ahead and attacked the Venetian van and center. At noon the two fleets approached the eastern side of the gulf. The leading ships then turned as the wind shifted from the southeast, which put the leading Venetian ships to windward of the Ottoman fleet for the first time. Seeing his advantage, Diedo attacked. In the early afternoon the Ottoman fleet retired, sailing for the Cervi–Cerigo (Elafonisos–Kythira) passage; the Venetians and allies sailed for Cape Matapan, the southern tip of the Mani Peninsula. Neither side wished to continue the fight.\nAftermath\nThe battle was considered a victory for Venice and her allies. Each allied state gave their own ships complete credit for any achievements. Accounts are highly unreliable; many list forces which were not actually present at the battle.\nIn Lisbon, the victory off Matapan was celebrated and served to enhance John V's international prestige. For the support given to the allied Catholic forces, the Portuguese King received the title of the \"Most Faithful\" and the arch-episcopacy of Lisbon was elevated to the status of a patriarchate.\nThe Seventh Ottoman–Venetian War was the last conflict between the two powers. It ended with an Ottoman victory and Venice losing its major Greek possession, the Kingdom of the Morea. The war ended with the Treaty of Passarowitz in 1718.\nShips involved\nVenice and allies\n*Blue Division - Vanguard\n**''Madonna dell'Arsenal (Madonna of the Arsenal) 68 guns\n**Costanza 70 guns\n**Trionfo (Triumph) 70 guns (flagship of Admiral Diedo)\n**Leon Trionfante 80 guns\n**San Francesco da Paola 54 guns\n**Aquila Valiera (Valieran Eagle) 70 guns\n**Fenice (Phoenyx) 60 guns\n**Sant'Andrea 60 guns\n**Gloria Veneta (Venetian Glory) 68 guns\n*Yellow Division - Center\n**Corona (Crown) 74 guns\n**Madonna della Salute (Madonna of Health) 70 guns (flagship of Almirante Ludovico Diedo, )\n**Terror 70 guns\n**San Pio V (Saint Pius V) 70 guns\n**San Pietro Apostolo, bought in Livorno, 50 guns\n**Aquila Volante (Flying Eagle) 52 guns, also reported as Aquiletta\n**Fede Guerriera (Warrior Faith) 60 guns\n**Nettuno (Neptune) 52 guns\n**Sacra Lega (Holy League) 50 guns\n*Red Division - Rear\n**San Gaetano 70 guns\n**Fortuna Guerriera (Warrior Fortune) 68 guns\n**Venezia Trionfante (Triumphant Venice) 52 guns\n**San Lorenzo Zustinian II 70 guns\n**Grand'Alessandro (Big Alexander) 70 guns (flagship of Almirante Dolfin)\n**Colomba d'Oro (Golden Dove) 70 guns, also reported as Colomba\n**Rosa (Rose) 60 guns, also reported as Rosa Moceniga\n**Valor Coronato (Crowned valour) 52 guns\n**São Lourenço 58 guns (Portuguese)\n*Allied Division\n**San Raimondo 46 guns (Maltese)\n**Fortuna Guerriera 70 guns (Venetian)\n**Rainha dos Anjos 56 guns (Portuguese)\n**Nossa Senhora das Necessidades 66 guns (Portuguese)\n**Santa Catarina 56 guns (Chevalier de Bellefontaine - Maltese)\n**Nossa Senhora do Pilar 84 guns (Portuguese)\n**Santa Rosa 66 guns (Portuguese)\n**Nossa Senhora da Conceição 80 guns (General-Admiral Lopo Furtado de Mendoça - Portuguese)\n**Nossa Senhora da Assunção 66 guns (Portuguese)\n*Auxiliaries\n**Captain Trivisan (fireship) - Scuttled\n**Madonna del Rosario (hospital ship) - Sunk\nGalleys\n13 Venetian\n5 Maltese\n4 Papal\n2 Tuscan\nOttomans\nShips of the Line\nKebir Üç Ambarlı (The Great Three Decker) 114 (Flagship of Ibrahim Pasha)\nEjder Başlı (The Dragon) 70\nÇifte Ceylan Kıçlı (The Two Gazelles) 70\nYaldızlı Hurma (The Gilded Date) 70\nŞadırvan Kıçlı (The Sprinkling Fountain) 66\nSiyah At Başlı (The Black Horse) 66\nBeyaz At Başlı (The White Horse) 66\nKula At Başlı (The Grey Horse) 66\nBüyük Gül Başlı (The Great Rose) 66\nYılan Başlı (The Snake) 34 (unique ship with 2x372 pdr \"üç kantar\" monster guns firing marble balls)\nIfrit Başlı (The Demon) 62\nKüçük Gül Başlı (The Little Rose) 60\nÇifte Teber Kıçlı (Two Halberds) 58\nYıldız Bagçeli (The Star Garden) 58\nZülfikâr Kıçlı (The Two Pointed Sword) 56\nAkçaşehir (Town of Akçaşehir) 56 guns\nServi Bagçeli (The Cypress Garden) 54\nAy Bagçeli (The Moon Garden) 54\nYeşil Kuşaklı (Green Belted) 54\nSarı Kuşaklı (Yellow Belted) 54\nKırmızı Kuşaklı (Red Belted) 52\nAl At Başlı (The Red Horse) 52\nYaldızlı Nar Kıçlı (The Gilded Pomegranate) 52\nCaravellas\nMavi Arslan Başlı (The Blue Lion) 44\nSiyah Arslan Başlı (The Black Lion) 44\nTaç Başlı (The Crown) 44\nGüneş Kıçlı (The Sun) 44\nKuş Bagçeli Karavele (The Bird Garden Caravella) 44\nYıldız Kıçlı (The Star) 40\nMavi Kıçlı Karavele'' (The Blue Caravella) 38\nReferences\nSources\n* História da Marinha de Portugal, Editora das Forças Armadas\n*\n*\n*"
    }
  ]
}