{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Xiangyang__disambig_1\n\nThe Battle of Xiangyang () was a protracted series of battles between the Yuan dynasty and the Southern Song dynasty from 1267 to 1273. The battle was a significant victory for the Yuan dynasty and ended a 30-year defensive campaign waged by the Southern Song dynasty, allowing Yuan forces to advance into the Southern Song heartland. The capture of Xiangyang also allowed the Yuan dynasty to take control of the Han and Yangtze rivers, thereby depriving the Southern Song dynasty of two formidable natural barriers. The defeat devastated the Southern Song dynasty, which collapsed several years later at the Battle of Yamen.\nThe battle consisted of skirmishes, ground assault, and the siege of the twin fortified cities of Fancheng and Xiangyang in modern-day Hubei, China. Lü Wenhuan, commander-in-chief of the Southern Song dynasty, surrendered to Yuan Emperor Kublai Khan in 1273. The conventional use of Mongol cavalry was restricted by the woody terrain and numerous military outposts of the Southern Song. Chinese firearms and cannons were employed by the Yuan in the victorious siege of Fancheng after capturing the outposts and relieving Southern Song forces from Sichuan and Yuezhou, which broke through the siege but was eventually defeated. The use of the counterweight trebuchet by the Yuan proved especially effective.\nBackground\nBefore the rule of Kublai Khan, the Mongols had launched military campaigns as far as Eastern Europe, and had conquered Russia, Siberia, Tibet, Korea, North China, Yunnan, Iraq, Anatolia and Iran. However, the Song dynasty was difficult to conquer because of the strategic location of Xiangyang, which became a vital position for Kublai to capture and hold. The city guarded the waterways of South China because the Han River was a major tributary into the Yangtze river. Once the city fell, the Mongols obtained easy access into important Southern cities in China and the Southern Song would collapse shortly after.\nThe Southern Song knew the importance of this vital spot, and treated the defense of Xiangyang as important as their capital. The city was surrounded by mountains on three sides, and a river (Han river) on one side. Song stored massive amount of supplies inside the fortress, as preparation for long sieges. They also built high walls and towers on all four sides of the fortress. Each entrance of the fortress had at least two layers of walls, used to trap enemy sieging forces inside.\nIn 1133, the famous Song general Yue Fei led many successful campaigns against the Jin dynasty, in the Xiangyang area. From there, he pushed the Jin army back north as far as Kaifeng. In 1234, the Jin dynasty was conquered by the Mongols under the leadership of Ögedei. At that time, Mongols and the Southern Song dynasty were allies. After that, the two former allies did not have any common enemy. The Song killed Mongol envoys and attempted to invade the Mongol territories.\nXiangyang surrendered to the army of the Mongol Empire without resistance in 1236. But the Mongols voluntarily left the city after it was briefly held by them in 1236–38. The twin cities of Xiangyang-Fenchang, with walls almost 5 kilometers around and 200,000 people, withstood a Mongol assault in 1257. The Mongolian cavalry were lured in Xiangyang where they were slaughtered by the Song defenders due to the fortress's double-layered wall design. When a Mongol contingent entered the entrance of the fortress, the Mongol forces would be slaughtered to the last man, while trapped between four walls. The Mongols lifted the siege of Xiangyang. The sudden death of Möngke Khan forced the imperial army of the Mongol Empire to withdraw from the Song territory in 1259–60.\nIn 1260, Kublai Khan was proclaimed successor to the throne after the death of his brother Möngke, as was his youngest brother Ariq Böke. The succession war between him and Ariq Böke began. Kublai Khan won the war eventually, though his claim as the successor to Möngke was only partially recognized by the Mongols in the west. In 1271, Kublai Khan renamed his empire \"Yuan\", establishing the Yuan dynasty, instead of \"Ikh Mongol Uls\" (Great Mongolian Nation or Great Mongol Empire). After defeating his rivals and opponents in Mongolia and Northern China, Kublai Khan also wanted to continue his grandfather Genghis Khan's conquest of China. In 1267, Kublai Khan ordered Aju and the Song defector Liu Zheng to attack Xiangyang and Fancheng. General Lu Zende had levied corruption charges against Liu Zheng, the Luzhou prefect, causing Liu Zheng to defect to the Mongols in 1261\nSiege\nIllustration of a Xuanfengwupao (旋風五砲) from the Wujing Zongyao\nIllustration of a hinged counterweight trebuchet prepped for transit from the [[Wujing Zongyao, late Ming (Wanli Period) edition]]\nAju and Liu Zheng arrived in 1268 and blockaded the city with a ring of forts. Liu Zheng had advised the cities be starved from Sichuan by building forts there. The Mongols probed the defenses of Xiangyang and Fancheng. The Yuan-Mongols learned from their mistake, and this time brought along with them about a hundred trebuchets. These trebuchets had a shooting range of around 100 metres, and could use projectiles of around 50&nbsp;kg. During Mongol campaigns against the Jin dynasty, the Mongols used about 5,000 trebuchets, and they were very successful in destroying the Jin fortresses. Lu Wende commanded the Song dynasty's Yangtze and his son-in-law Fan Wenhu and son Lu Wenhuan commanded Xiangyang.\nHowever the twin cities had expected an assault by bombardment and prepared for it. The city moat was expanded to a width of 150 metres, forcing Yuan siege weapons to set up at a distance. In addition to reinforcing their walls with clay, they made netting screens ten centimetres thick and ten metres in length to cover them and dampen projectile impact. As a result, the Yuan siege weapons were both ineffective and inaccurate, and the few shots that did land bounced off the wall harmlessly.\nMongol entrapment\nThe Mongols then started to block Xiangyang off from the rest of Song. A Yuan fleet of 5,000 ships was established, to stop any Song supplies from the Han river. The Han River was blockaded with five stone platforms capped by arbalests. The Mongol trained 70,000 marines but Song food supplies still held out in 1271. The Yuan also sent forces to go around the fortress, and set up camps at the key roads, to stop Song supplies from land. Eventually, Yuan built their own forts at these key locations.\nFrom late 1267 to 1271, Song reinforcements from the south tried, many times, to attack the Mongol positions, in order to supply Xiangyang, but outside of Xiangyang, the Song forces were no match for the Mongolian cavalry. The catalog of useless thrusts continued, the Chinese losing 1,000 in October 1270, 2,000 in August 1271, and most of a 3,000 strong force was destroyed the following month. Once the Yuan forts were completed, the situation became hopeless. As a result, the Song forces inside Xiangyang had to depend on themselves.\nThe Song had stored years of supplies within Xiangyang. However, by 1271, the fortress finally ran low on their supplies. Still, the Song troops chose to hang on. Finally, in 1272, a small Song force of 3,000 men was able to break through the Yuan naval blockade, and supplied Xiangyang from the Han river. The force, led by two men both named Zhang, commanded a hundred paddle wheel boats, travelling by night under the light of lantern fire, was discovered early on by a Mongol commander. When the Song fleet arrived near the cities, they found the Mongol fleet to have spread themselves out along the entire width of the Yangtze with \"vessels spread out, filling the entire surface of the river, and there was no gap for them to enter.\" Another defensive measure the Mongols had taken was the construction of a chain, which stretched across the water. The two fleets engaged in combat and the Song opened fire with fire-lances, fire-bombs, and crossbows. A large number of men died trying to cut through chains, pull up stakes, and hurl bombs, while Song marines fought hand to hand using large axes, and according to the Mongol record, \"on their ships they were up to the ankles in blood.\" With the rise of dawn, the Song vessels made it to the city walls and the citizens \"leapt up a hundred times in joy.\" This was a major morale boost to the defenders. However, no one could get back out to inform others of the success. The Song officials considered that reinforcement lost and Xiangyang, doomed to fall from the lack of supplies, did not send more Song reinforcements afterwards. The high casualties and low success rates ended the transportation of further supplies.\nAju realized that the twin cities were hard to take with Mongol cavalry and wrote to Kublai that he needed Chinese infantry. Kublai reinforced him with 20,000 men.\nNew weapon of the Yuan forces\nThe defense of Xiangyang came to an end in 1273, with the introduction of the counterweight trebuchet. Because the Han Chinese commander Guo Kan fought with the Mongols under Hulagu in the Middle East, Kublai had heard of siege engines of great effectiveness. Experts Ismail and Al al-Din were sent by Abaqa, Ilkhan of Persia, to China by the decree of Kublai Khan in 1272. They built the powerful siege engines under the Uyghur general Arikhgiya by March, 1273. These counterweight trebuchets had a shooting range of , and could launch projectiles weighing over . On top of their power, these new trebuchets were much more accurate than the old ones, and were the only artillery capable of reaching the walls of Xiangyang. Yuan forces built about 20 of them, and used them to assist the siege of Xiangyang.\nThe Mongols started the siege with Fancheng in early 1273. Song soldiers in Xiangyang witnessed a giant rock which flew right over the gigantic walls of Fancheng, and hit the houses inside. Under the cover of bombardment, the Yuan army was able to fill the moat and take the walls, after which followed an assault by cavalry. The storming of the city resulted in high casualties on both sides. Fancheng, after holding out for years, suddenly fell within a few days.\nThe Yuan Mongol army then turned their attention to Xiangyang. Lu Wenhuan sent a messenger to Emperor Duzong of Song, to request immediate reinforcements. The messenger successfully got by the Yuan forts and reached the emperor. But upon hearing the effectiveness of these new trebuchets, the emperor considered Xiangyang lost and did not send reinforcements.\nFor the next few days, Song soldiers looked to the south for reinforcements, but all they saw were Yuan siege weapons and the Mongols waiting to end their lives.\nThe position of Song forces worsened when, in February, Yuan siege weapons began bombarding the city. A shot happened to hit a stone bridge inside the city. When the stone landed, it made a thunderous noise. Song soldiers went to check the damage, and saw that the stone had sunk a few feet into the solid ground.\nThe Yuan bombardment began to collapse the city structures as well as reduce the drum tower and turrets on the city walls. Lu Wenhuan surrendered the city on 14 March 1273; he was made governor of Xiangyang and Fancheng under Yuan rule as part of the terms.\nAftermath\nXiangyang, the strongest fortress of the Song dynasty, had fallen. As a result, Yuan forces were free to conquer the rest of southern China. Everywhere else Yuan went, Song fortresses defected as the defecting Song commander in Xiangyang, Lu Wenhuan, ordered other members of his family commanding Song forces to defect to the Yuan. In 1275, the Song government unsuccessfully attempted to negotiate a truce, but by then it was too late.\nMany people agree that the fall of Xiangyang essentially marked the end of the Song dynasty. For example, Paul K. Davis wrote, \"Mongol victory broke the southern Song dynasty, leading to the establishment of the Yuan dynasty.\" For the six years that Yuan sieged Xiangyang, Song were unable to regroup and strike back at Yuan with their resources in the south. In fact, they could not even get much reinforcements and supplies to Xiangyang, to support the hard-working defense there. The emperor of the Song dynasty abdicated on 4 February 1276.\nRole of Chinese-designed gunpowder weapons\nChuangzi Nu\nBoth the Song and Mongol forces had thunder crash bombs during the siege, a type of gunpowder weapon. The Mongols also utilized siege crossbows and traction trebuchets. The Song forces used fire arrows and fire lances in addition to their own thundercrash bombs. The Song forces also used paddle ships. Siege crossbows and firebombs were also deployed on Song ships against Mongol forces, in addition to fire lances. The name of the bombs in Chinese was Zhen tian lei. They were made from cast iron and filled with gunpowder, the Chinese Song forces delivered them to the enemy via trebuchets. Armor made out of iron could be penetrated by pieces of the bomb after the explosion, which had a 50-kilometre noise range.\nRole of the counterweight trebuchet\nSince the Yuan employed Muslim engineers for the designing of the counterweight trebuchets, they were designated in Chinese historiography as the \"Muslim\" trebuchet (hui-hui pao''). The Chinese scholar Zheng Sixiao (1206–1283) indicates that, \"in the case of the largest ones, the wooden framework stood above a hole in the ground\". After Aju spoke with Kublai, the Emperor of the Mongol Empire, about the powerful siege machines of the Ilkhanate, the engineers Ismail and Al-aud-Din from Iraq arrived in South China to construct a new type of trebuchet, one which used explosive shells. These Muslim engineers built mangonels and trebuchets for the siege. Explosive shells had been in use in China for centuries but what was new was use of the counterweight type of trebuchet, as opposed to the torsion type, the counterweight giving greater range and accuracy as it was easier to judge the weight of the counter weight than the torsion generated by repeated windings.\nunder siege by Mahmud of Ghazni in 1003 CE. From the illuminated manuscript of Rashid al-Din's ''Jami' al-tawarikh, dated 1314 CE. Edinburgh University Library]]\nThe counterweight trebuchet, built under guidance from the Muslims from Mosul, were longer in range and assisted in destroying Fancheng. It became common for Chinese and Muslim engineers to operate artillery and siege engines for the Mongol armies. The design for the Mongol weapons was taken from those used by Hulegu to batter down the walls of Baghdad.\nThe Chinese were the first to invent the traction trebuchet, now they faced Muslim designed counterweight trebuchets in the Mongol army. The Chinese responded by building their own counterweight trebuchets, an account from the Chinese said in 1273 \"the frontier cities have all fallen. But Muslim trebuchets were constructed with new and ingenious improvements, and different kinds became available, far better than those used before.\"\nThe design of the trebuchets deployed at Xiangyang\nThe Chinese scholar Zheng Sixiao (1206–1283) indicates that, \"in the case of the largest ones, the wooden framework stood above a hole in the ground\".\nAnother version is given by Marco Polo in his book Il Milione'' where he claims having been responsible for teaching the Mongols how to build and use catapults during the siege of Xiangyang. However, the names of the Muslim engineers were given by Muslim sources as Talib and his sons Abubakr, Ibrahim and Muhammad, respectively, by Chinese sources as Ala-ud-Din and Isma'il. Moreover, it has been claimed the siege had already ended before Marco Polo's arrival in China.\nRole of political infighting in the Song Court\nPolitical infighting among the Song also contributed to the fall of Xiangyang and Fancheng; due to the power of the Lü family, many questioned their allegiance to the Song. The Emperor barred Jia Sidao himself from the command, so Li Tingzhi, an enemy of the Lü family, was appointed commander. Jia permitted the Lü family to ignore Li's orders, resulting in a fractious command. Li was then unable to relieve Xiangyang and Fancheng, managing only temporary resupply during several breaks in the siege.\nSee also\n*Siege of Diaoyucheng\nReferences\nBibliography\n* .\nExternal links\n* [http://zhidao.baidu.com/question/13449675.html?fr=qrl3 Xiangyang really that hard to conquer?]: (Chinese)"
    }
  ]
}