{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Hausbergen\n\n}}\n| map_type          =\n| map_relief        =\n| latitude          =\n| longitude         =\n| map_size          =\n| map_marksize      =\n| map_caption       =\n| map_label         =\n| territory         =\n| result            = Citizen victory\n| status            =\n| combatants_header =\n| combatant1        = City of Strasbourg\n| combatant2        = Prince-Bishopric of Strasbourg\n| combatant3        =\n| commander1        = Reimbold Liebenzeller, Nicolaus Zorn\n| commander2        = Bishop Walter of Geroldseck\n| commander3        =\n| units1            =\n| units2            =\n| units3            =\n| strength1         = Unknown. Mainly militia on foot including 300 crossbowmen. Small number of horsemen.\n| strength2         = 300 horsemen and at least 5,000 infantrymen\n| strength3         =\n| casualties1       = Allegedly 1 killed.\n| casualties2       = Allegedly 1,300 foot soldiers and 70 knights killed, and 86 noblemen made prisoner.\n| casualties3       =\n| notes             =\n| campaignbox       =\n}}\nThe Battle of Hausbergen (or Battle of Oberhausbergen) was a historic military engagement that took place in the Alsace region of northeastern France on 8 March 1262. The battle marked the release of the 'burghers' (citizens) of Strasbourg from episcopal authority and gave the bourgeoisie control over politics and commerce. The battle occurred on the fields of Hausbergen, an area of countryside a few miles northwest of the city of Strasbourg. It resulted in the decisive victory of the townsmen over the forces of the Bishop of Strasbourg,  and the granting of free imperial city status by King Philip of Swabia to Strasbourg.\nBackground\nFor background of the City of Strasbourg see History of Strasbourg.\nBetween 362 and 1262, Strasbourg was governed by the bishops of Strasbourg. This period of the settlements history was marked by a long conflict between its bishop and its citizens over the application of ecclesiastic authority and its control of administrative offices. As a major commercial centre, the town came under the control of the Holy Roman Empire in 923, through the homage paid by the Duke of Lorraine to German King Henry I. Strasbourg continued to develop as an economic, cultural and religious centre for the region. From the end of the 12th century onwards the Bishops of Strasbourg gave greater juridical and economic privileges to the 'burghers'. This came to an end in 1260 when Walter of Geroldseck was installed on the episcopal throne as 'prince-archbishop' and sought to regain the powers granted over the previous century to citizen officials. This included the publication of a manifesto of grievances against the citizens, stating his intention to re-establish his temporal rights as Count-Burgrave of Strasbourg. He accused the leading 'burghers' of acting only for their self-interest and having misgoverned the town. Geroldseck threatened the use of all the means of constraint conferred on him by his episcopal authority, foremost among which were prohibition and excommunication. This led to conflict between the commune and the bishop that expanded into the countryside and resulted in a regional clash that came to a head in 1262.\nThere is no direct evidence that the burghers ever responded directly to the accusations of the bishop. However, what resulted was the rise of an organized opposition to him. In September 1261 the first league was formed by four powerful lords of Strasbourg with a further three town-leagues at Neuenburg, Colmar and Basle created in the following two months. Jurisdictionally, these four leagues held no legal authority and existed with the sole purpose of opposing the bishop and his supporters. This division of allegiances escalated into distinct factions and quickly militarised. One of the most decisive individuals in this division of allegiances was Count Rudolf of Habsburg. Previously an ally of the bishop, he became one of the founding lords of the first league and brought with him significant military resources.\nPreparations for war\nFaced with rising discontent, Walter of Geroldseck sought reinforcements, and 1,500 men were sent by the Bishop of Trier along with others from the abbots of St Gall and Murbach. Geroldseck made a demonstration of strength in front of the city, which resulted in Geroldseck placing Strasbourg under siege. During a truce for the harvest, Count Rudolf of Habsburg changed his allegiance and sided with the Strasbourgers, who proclaimed him the gonfalonier (standard-bearer) of their army on 18 September 1261. This marked a decisive turning point in the conflict and resulted in further military escalation.\nOn Christmas Day 1261, a sortie by the Strasbourgers in the direction of Dachstein did not resolve the conflict, as Geroldseck's forces avoided a clash with Rudolf's. The growing tensions and the build-up of troops would lead to a battle early in the following year.\nBattle\nOn 8 March 1262, Reimbold Liebenzeller led half of the Strasbourg garrison to Mundolsheim, at the northern end of the Hausbergen hill, to capture the bell tower which was thought to be a lookout post for Geroldseck's blockade. The bishop, after being warned, set out from Molsheim with his army of 300 knights and 5,000 infantrymen. Sighting the enemy approaching, Liebenzeller sent messengers to Strasbourg to call for help. He then climbed the hill of Hausbergen and awaited the reinforcing troops, led by his colleague Nicolaus Zorn. When Zorn arrived, the combined force fell back toward the village of Oberhausbergen. Geroldseck, observing this, thought the army was trying to return to Strasbourg. Seeking to crush them with his cavalry before they escaped, he led his horsemen in a rapid advance, leaving his infantry to catch up as best they could. The Strasbourgers were not in flight, however, and deployed to face the bishop's men in good order.\nThe battle began with a challenge to single combat by the knight Marcus of Eckwersheim from the army of Strasbourg. This was accepted by a knight called Beckelar of the episcopal army. Both parties were unhorsed, but Eckwersheim was rescued by his comrades, while Beckelar was killed.\nImmediately after this, the cavalry of the two sides clashed. Liebenzeller led forward the militia, armed with spears and Danish axes, and ordered them to attack the horses of the knights. Meanwhile, Zorn had led the 300 crossbowmen out to the flank of the fight to engage the bishop's advancing infantry and prevent them from interfering in the fight with the knights. The shooting of the bowmen was so effective that the infantry declined to advance further. The bishop’s cavalry was overwhelmed. Sixty knights were killed and another 73 captured. Geroldseck was engaged in the struggle, having two horses killed under him before fleeing from the field on a third. His brother, Hermann, lay among the dead. Geroldseck retired to Molsheim and abandoned his prerogatives over Strasbourg. He died in February 1263.\nConsequences\nPeace was concluded between the city and the new bishop, Henry of Geroldseck, cousin of the deceased Walter. It confirmed the complete independence of the Council on 21 April 1263. The past and future ducal pretensions of the Bishop of Strasbourg were declared null and void. Strasbourg became a free city of the Holy Roman Empire and its future was entrusted to its Council. In addition, management of the Notre-Dame Cathedral was taken from the bishop and entrusted to the cathedral chapter.\nCommemoration\nThe 750th anniversary of the battle was celebrated in 2012. A comic album was published about the event and a seminar was organised by the University of Strasbourg.\nReferences"
    }
  ]
}