{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Oravais__disambig_1\n\n}}\nThe fight lasted a total of 17 hours (from 8 a.m. on 2 September), but some sources erroneously call only the 15 September of the battle.}}\n| place             = Oravais, Swedish Finland\n| coordinates       =\n| map_type          =\n| map_relief        =\n| map_size          =\n| map_caption       =\n| result            = Russian victory\n| territory         =\n| combatant1        =  Sweden\n| combatant2        =  Russian Empire\n| commander1        =  Wilhelm Mauritz Klingspor   Carl Johan Adlercreutz\n| commander2        =  Nikolay Kamensky Nikolay Demidov Yakov Kulnev\n| strength1         = Swedish accounts:3,500–5,500Russian accounts:7,000\n| strength2         = Russian accounts:6,000–7,000(less than 5,000 engaged)Swedish accounts:8,500\n| casualties1       = Swedish accounts:740–1,200Russian accounts:1,000–1,500\n| casualties2       = Russian accounts:895–1,100\n* 1,000\n* 1,100\n}}\n}}\nThe Battle of Oravais (occasionally Orawais; ; ) from September 14 until September 15 was one of the decisive battles in the Finnish War, fought from 1808 to 1809 between Sweden and the Russian Empire as part of the wider Napoleonic Wars. Taking place in modern-day Vörå in western Finland, it is sometimes regarded as the turning point of the Finnish War: the last chance for Sweden to turn the war to her advantage. It was the bloodiest battle of the conflict, along with the Battle of Sävar, which some historians attribute to the exhaustion, resignation and desperation of the Swedish army: it was losing the war, and defeat led to its loss of Finland to Russia.\nIn this battle Count Nikolay Mikhailovich Kamensky, who was in charge of the Russians, displayed outstanding military qualities, showing himself a worthy disciple of Suvorov. Considering the uncertain situation before the battle, he deploys his forces in echelons; but, as soon as the main Swedish force at Oravais is determined, he endeavours to bring everyone onto the battlefield at a crucial moment.\nThe Swedish army was commanded by Count Wilhelm Mauritz Klingspor, who decided to accept the battle on a fortified position.\nPrelude\nAt the beginning of the war, Swedish forces had retreated to Oulu. They had then managed to repel the Russians and reach Savonia despite the capitulation of the fortress of Sveaborg by the end of summer 1808. Russia recuperated quickly, and by the end of August the Swedish army was again retreating northwards along the coastal road. To avoid being encircled, Colonel Georg Carl von Döbeln was sent in advance to Nykarleby with a brigade. The threat of encirclement was exaggerated, but the Swedish army was at this point showing signs of panic and collapse. On 13 September the army left for Oravais and it halted to await news from von Döbeln, who was fighting the Russians at Jutas. The sound of a cannon was heard in Oravais, and a brigade was sent to reinforce von Döbeln.\nThe Russian main army had marched from Vasa in furious pursuit of the Swedish forces. The night before 14 September was spent in bivouacs along the road between Vörå and Oravais. The impulsive General-Major Yakov Kulnev's troops had taken the lead and were the first to make contact with the Swedes.\nThe Swedes had between 3,500 and 5,500 men available for the battle, with the most likely figure being near 5,000 men according to Hugo Schulman. The Russians had 6,000 or over 7,000 men. According to some Swedish and Russian estimates, their enemies had 7,000 and 8,500 men respectively.}}\nBattle\nAt dawn the first shots were exchanged between Kulnev's troops and a Swedish outpost by a bridge in the forest. Firing intensified, the Swedish position was reinforced continuously while the remainder of the Russian forces behind Kulnev arrived.  Fighting continued with heavy losses on both sides until the situation became untenable for the Swedes, who retreated to their defensive positions at 10 a.m. The retreat was covered by a single artillery piece commanded by the fifteen-year-old sublieutenant Wilhelm von Schwerin.\nThe Swedish main position was deployed along a ridge which was protected to the north (on the Swedish right wing) by an inlet from the Baltic, and the Fjärdså stream with its south to north flow provided added defensive potential. The forest in front of the ridge had been cleared to afford the artillery a better view of the arriving Russians, who were regrouping at the edge of the forest.\nArtillery bombardment then began between the two forces, and continued for an hour until the Russians mounted a frontal assault against the Swedish positions. Kulnev, on the Russian left wing, struck the Swedish right, but was repelled when his force became bogged down in the Fjärdså stream. The Russians now reinforced their right wing, under Nikolay Demidov, and another assault was made. It was also repelled, but this time the Swedish unexplainably left their positions and counterattacked; Adlercreutz had issued no order to that effect. The Swedish counterattack met overpowering fire and was forced to withdraw with heavy losses.\nAt 2 p.m. the battle was far from decided. The Russians made a second attempt at turning the Swedish left flank. This thinned the Russian center, and Adlercreutz ordered a forceful attack to exploit the weakness.  Despite the intensive Russian fire, the attack proceeded swiftly, and the whole Swedish line was carried along by the movement. The entire Russian line was forced to retire back into the forest where the battle had begun earlier in the morning.\nHowever, dwindling of ammunition frustrated Adlercreutz's attempted decisive stroke. As Russian reinforcements arrived, the spent Swedish army retired to their defensive positions again. At this point the battle was still undecided (the gunfire and bloodshed continued), but General Kamensky said \"don't stop fighting until the Swedes are forced out of position\" and ordered Demidov's right wing to make yet another attempt on the weak Swedish left wing. When this maneuver started night had fallen and the battle had already raged for fourteen hours; it became too much for the Swedish army, which hastily retreated to the north from the Russian bayonet attack. A brief Russian pursuit also followed, which ended with the Swedes burning the bridge.\nThe soldiers enthusiastically greeted Kamensky, who went round all the camps, thanking everyone from small to great for their victory. This seventeen-hour battle was the longest and bloodiest of the campaign.\nAftermath\nThe Swedish lieutenant Carl Johan Ljunggren retold the retreat from Oravais like this:\n\"The darkness was such that despite continuous shovings one could not recognize the shover... Hundreds of noises came out of the night; everywhere the wounded wailed, each in his own language; artillerymen and coachmen yelled at their exhausted horses and bellowed scores of curses each time they became stuck, which happened all the time; wheels and weapons rattled, soldiers bellowed; all staggered from tiredness and hunger. Thus came the army finally to Nykarleby. The Russians hadn't followed, for their forces were also completely spent.\nThe battle of Oravais had shown that the Swedish army was not tactically inferior to the Russian counterpart. But the Swedish strategic situation seemed hopeless; allied only with Great Britain, it faced the overnight of Napoleon's Europe and its Russian ally. Oravais was merely one battle on the road to final Swedish defeat.\nFollowing the battle, Adlercreutz estimated between 1,100 and 1,200 Swedish losses. Hornborg, however, considers these figures exaggerated, instead citing the reports of each regiment's losses; accordingly, the Swedes had 103 killed, 276 wounded, and 361 missing (presumed to be either killed or captured). Russian sources puts the Swedish casualties at between 1,000 and 1,500 men. The Russians reported their own loss to 121 killed, 665 wounded and 109 missing (presumed to be either killed or captured), or between 1,000 and 1,100 men. Micheal Clodfelter agrees with some Russian figures, indicating 1,000 casualties on each side.\nSwedish regiments and losses\n*Swedish headquarters and General Staff; 6 wounded\n*Uppland Regiment (2 battalions); 1 killed, 20 wounded and 54 missing\n*Västmanland Regiment (1 battalion); 11 killed, 57 wounded and 27 missing\n*Hälsinge Regiment (3 battalions); 52 killed, 131 wounded and 59 missing\n*Västerbotten Regiment (1 battalion); 4 killed, 20 wounded and 10 missing\n*Österbotten Regiment (1 battalion); 9 killed, 20 wounded and 89 missing\n*Savolax Infantry Regiment (2 battalions); 1 killed, 7 wounded and 53 missing\n*Savolax Jäger Regiment (2 battalions); 7 killed, 2 wounded and 16 missing\n*Karelia Jäger Corps; 16 killed, 6 wounded and 43 missing\n*Life Guards of Horse (2 squadrons); –\n*Nyland Dragoon Regiment (1 squadron); 2 missing\n*Svea, Finnish and Savolax artillery contingents (18 guns); 2 killed, 7 wounded and 8 missing\nTotal: 740; 103 killed, 276 wounded and 361 missing; of which at least 150 unharmed Swedes captured and the rest either killed or wounded-and-captured (a few might have been dispersed).\nNotes, citations and sources\nNotes\nCitations\nSources\n*Svenska Slagfält (2003), Wahlström & Widstrand, 2003.\n*\n*\n*\"Оровайс\". Military Encyclopedia: In 18 Volumes. 1911–1915.\n*\"Каменский 2-й, Николай Михайлович\". Russian Biographical Dictionary: In 25 Volumes. St. Petersburg. 1896–1918.\n*\n*\n*\n* |first=Gustaf |last=Montgomery |author-link=Gustaf Adolf Montgomery|language=sv |year=1842|publisher=Lindh |location=Örebro}}\n*\n*  |first=Paul|last=van Suchtelen |author-link=|translator-first=William |translator-last=Monteith |year=1854|publisher=Lionel Booth|location=London}}\n*\n*\nExternal links\n* [http://www.multi.fi/~goranfri/batoravais.html Battle of Oravais]\n* [https://web.archive.org/web/20040508082244/http://www.nykarlebyvyer.nu/SIDOR/TEXTER/PROSA/SANDSTRA/SVESISKR/Oravais.htm A page (in Swedish) about the battle]"
    }
  ]
}