{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Ascurum\n\n}}\nThe Battle of Ascurum took place in 46 BC during Caesar’s Civil War and saw the defeat of a force under Pompey the Younger in battle against the Mauretanians.\nIn 49&nbsp;BC, a civil war broke out within the Roman Republic between Julius Caesar and the senate, which was led by Pompey the Great. The Kingdom of Mauretania decided to support Julius Caesar in this struggle, probably because their rivals Numidia supported Pompey. When an anti-Caesarian rebellion broke out in Spain, Bogud of Mauretania intervened and helped put down the rebellion.\nThe Mauretanians seemed to have picked the right side as the war swung in the favour of Julius Caesar following the Battle of Pharsalus and Pompey the Great’s murder in Egypt. The remaining Pompeians fled to North Africa and set up at Utica. There, Cato chastised Pompey's son, stating how his father had achieved much more at his age. This convinced Pompey the Younger to go on a campaign of his own and he decided to attack Mauretania to neutralise what was a potential threat.\nWith a small force numbering around 2,000, Pompey landed on the Mauretanian coast and approached the town of Ascurum. The garrison of the town let Pompey approach very close until he was right outside the walls before launching a sudden sally. The surprised Pompeians, possibly outnumbered by the garrison whose size is unknown, were quickly broken and fled back to their ships. Full of shame, Pompey did not return to Utica but instead fled to the Balearic Islands.\nThis attack spurred the Mauretanians into action, and with the help of the mercenary Publius Sittius they invaded and seized much of Numidia. Following Caesar’s invasion of Africa and victory at the Battle of Thapsus, many Pompeians fled westward, only to find their escape blocked by the Mauretanians, with many captured and killed and others committing suicide. Pompey the Younger, still in the Balearics, would later go to Spain and meet with the remaining anti-Caesarians. They launched a final rebellion against Caesar which was put down at the Battle of Munda where the younger Pompey was killed.\nSee also\n* Caesar's Civil War\n* Julius Caesar\n* Gnaeus Pompey\nReferences"
    }
  ]
}