{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Baltim__disambig_1\n\n|map_type    =\n|map_relief  =\n|latitude    =\n|longitude   =\n|map_size    =\n|map_marksize =\n|map_caption =\n|map_label   =\n|territory   =\n|result      =Israeli victory\n|status      =\n|combatant1  =\n|combatant2  =   PLO\n|commander1  =Michael Barkai\n|commander2  =  Muhammad Zikry   Fuad Yahya\n|units1      =\n|units2      =\n|strength1   =2 Sa'ar 4 boats2 Sa'ar 3 boats1 Sa'ar 2 boat1 Sa'ar 1 boat\n|strength2   =4 Osa boats\n|casualties1 = None\n|casualties2 =3 Osa boats sunk42 killed\n|notes =\n|campaignbox =\n}}\nThe Battle of Baltim (also Battle of Damietta, Battle of Baltim–Damietta, Battle of Damietta–Baltim or Battle of Damietta – El Burelos) was fought between the Israeli Navy and the Egyptian Navy on 8–9 October, 1973, during the Yom Kippur War. It took place off the Nile Delta, between Baltim and Damietta. The battle began when six Israeli ''Sa'ar-class missile boats heading toward Port Said were engaged by four Egyptian Osa-class missile boats coming from Alexandria. It lasted about forty minutes. The Osas fired Styx missiles, missed, and began to withdraw back to Alexandria when the Israelis began to give chase. Two Osas were sunk by Gabriel missiles within a span of ten minutes, and a third was sunk twenty-five minutes later. The fourth made it back to base.\nBackground\nOn 8 October, the third day of the war, the Israel Defense Forces launched a counterattack in the Sinai in an attempt to push the Egyptian Army back across the Suez Canal. Israeli naval command expected ground pressure on Port Said to prompt a withdrawal of Egyptian naval assets from the local harbor to Alexandria,  to the west. A flotilla of Israeli missile boats was therefore ordered to proceed to Port Said. The boats, having just arrived back in Haifa after the Battle of Latakia, had not yet completed refueling. Nevertheless, within 25 minutes eight boats were heading south at 30 knots. These arrived off Port Said five hours later, meeting Commander Michael Barkai who was already on station with two boats. By that time, the counterattack in the Sinai had failed and the Egyptian boats did not leave the port.\nBarkai and Admiral Binyamin Telem decided to lure the Egyptians out by shelling coastal targets along the Nile Delta. At 21:00, just as they began shelling, they detected targets to the west. The Israeli boats charged at forty knots, but after about thirty minutes it turned out that they had been chasing electronic shadows. Halting to regroup, Barkai asked his ships to report the state of their fuel and munitions supply. The boat he was on, INS Miznak, and three others were very low on fuel. He contemplated a return to Haifa, but eventually decided to send back the boats that were low on fuel and remain on site with the remaining six.  As he was moving from the Miznak to INS Herev, four Osa-class missile boats were detected coming out of Alexandria, heading east. When Barkai climbed aboard the Herev'', he ordered his force to move toward Alexandria.\nPrelude\nBarkai had two Sa'ar 4-class missile boats, INS Reshef and INS Keshet; two Sa'ar 3-class missile boats, INS Soufa and INS Herev; one Sa'ar 2-class missile boats, INS Eilat (named after the INS Eilat sunk six years earlier); and one missileless Sa'ar 1-class patrol boat, INS Misgav. At 23:00, Barkai formed his boats into three pairs, moving in parallel lines across a broad front. The northern pair included the Reshef and the Keshet, the central pair the Eilat and the Misgav, and the southern pair the Herev and the Soufa. At this point, the Osas did not appear on the radar or the long-range electronic sensors, and it was not clear if they were moving toward the Israeli force.\nClose to midnight, Barkai took the southern pair to shell targets at Damietta on the delta. As they prepared to fire, their radars detected something off Baltim, to the west. Barkai ordered the northern pair to disperse long-distance chaff to his north, to see if that would draw fire. After a few moments, the chaff cloud was targeted by missiles from the west. The Sa'ar boats switched on their electronic defenses and opened full throttle, while Barkai decided not to call for help from the Israeli Air Force.\nBattle\nThe Israeli battle line was crescent-shaped, with the northern pair positioned further forward from the rest. Two pairs of Osas were moving towards the Israeli force but were still outside the forty-five kilometer range of their Styx missiles. The range of the Israelis' Gabriel missiles was twenty-five kilometers, forming a  gap the Israelis hoped to bridge unharmed using their electronic warfare equipment which offered the Styx missiles more targets than were available. At 00:15, Israeli sensors detected an Egyptian missile launch at a range of . After two minutes, these missiles exploded harmlessly in the sea. The Egyptians continued their advance and fired three more salvos in the following ten minutes, their fire aimed mostly at the chaff clouds dispersed by the northern Israeli pair. After firing their last barrage at a range of thirty kilometers, the Osas made a figure-eight maneuver and began speeding back to Alexandria, with the Sa'ars giving chase. Barkai warned his commanders not to fire at any range longer than . His calculations suggested that they could catch the slower Osas before they could reach the port.\nAfter a twenty-five-minute chase, INS Keshet entered the seventeen kilometer range and fired a missile which hit an Osa. At this point, Keshet's engine room began taking water from a burst pipe. Firing off another missile, Keshet stopped  from the damaged Osa while INS Misgav closed in and hit it with gunfire. Meanwhile, INS Reshef fired and hit the second Osa, while INS Eilat also fired one missile. The Reshef charged at the damaged Osa and sank it with gunfire. The southern pair of Osas split, one of which was then hit and came to a standstill, although it did not sink. The Herev and the Soufa fired dozens of rounds into the Osa before discovering that it had in fact run aground. The other Osa headed west toward Alexandria, and got out of range. The Reshef was closest to it and began chasing the Osa, but the weapons officer reported an electrical malfunction preventing a missile launch. INS Reshef kept pursuing, hoping to reach gun range, but Barkai noticed that it was breaking away from the rest of the force and was getting dangerously close to the coast. Fearing it would be vulnerable to air attacks, he ordered it to withdraw. The commander of the Reshef asked for a few more minutes, but eventually rejoined the force.\nAftermath\nNoting that the force was too close to Alexandria, Telem ordered Barkai to stop the chase. At 13:30, the force headed back to Haifa. The fourth Osa reached Alexandria. Egypt claimed to have sunk four Israeli \"targets\", three they believed to be motor torpedo boats and one missile boat. Years after the battle, the commander of the Reshef met an Egyptian naval officer who commanded one of the Osas at the US Naval War College. He said that he and two or three crew members survived the explosion and managed to swim ashore.\nReferences\nBibliography\n*\n*\n*"
    }
  ]
}