{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Nimla (1809)\n\n| place             = Kabul-Jalalabad Road\n| map_type          =\n| map_relief        =\n| map_size          =\n| map_marksize      =\n| map_caption       =\n| map_label         =\n| territory         = Durrani Empire usurped by Shah Mahmud\n| result            =\n*Mahmud Shah restored as ruler of the Durrani Empire\n| combatants_header =\n| combatant1        = Coalition of Shah Mahmud\n| combatant2        = Durrani Empire\n| commander1        = Mahmud Shah Durrani Kamran Shah DurraniFateh Khan BarakzaiDost Mohammad Khan\n| commander2        = Shah Shuja DurraniAkram KhanAbd al-Ghafur\n| strength1         = ~4,000\n| strength2         = ~3,000\n| casualties1       = Unknown, believed to be light\n| casualties2       = Unknown, believed to be heavy\n| notes             =\n| campaignbox       =\n}}\nThe Battle of Nimla took place on 29 June 1809, due to a conflict between Mahmud Shah Durrani and Shah Shuja Durrani over the succession for the Afghan Durrani throne. The battle resulted in a victory for Mahmud Shah and allowed him to secure the throne, where he reigned from 1809 to 1818. This was his second reign before he was deposed.\nAt the beginning of the conflict, Shah Shuja had managed to depose Mahmud Shah in the wake of a greater conflict that had spilled over after the death of Timur Shah Durrani, leading to a succession crisis where Mahmud Shah would eventually take rule, and be deposed by Shah Shuja, as a result, Mahmud Shah had returned in 1809 and had occupied Kabul, Shah Shuja had rallied his forces near Jalalabad to meet Shah Mahmud in battle near Nimla.\nBackground\nFollowing the death of Timur Shah Durrani, the Durrani Empire was plunged into a succession crisis with Timur Shah's 24 sons. Prominent among these sons were Mahmud Shah Durrani, Zaman Shah Durrani, and Shah Shuja Durrani. Zaman Shah Durrani would take the throne after the death of Timur Shah in a succession crisis, where Mahmud Shah Durrani was confined to ruling the Realm of Herat, while Shah Shuja would work for Zaman Shah ordinated at Peshawar. Mahmud Shah would be forced to flee to Persia after Zaman Shah would invade Herat. Mahmud Shah returned in multiple attempts to seize the throne from his brother, finally succeeding in 1801. Shah Shuja Durrani attempted to thwart Mahmud Shah's attempts, but was repelled and forced to flee.\nShah Shuja would return with rebel leader Sher Muhammad Khan to topple Mahmud Shah and would succeed, placing himself on the throne in 1803, making Mahmud Shah's reign last just under 2 years.\nMahmud Shah Durrani returned in 1809, plotting to usurp the throne once again. Mahmud centralized his forces with Fateh Khan and his son, Kamran at Kandahar before marching to Kabul. Shah Shuja Durrani, seeing this had scrambled his forces at Jalalabad and met Mahmud Shah's army at the old Kabul-Jalalabad Road near Nimla. Shah Shuja had previously attempted a campaign in Kashmir, and his forces were repelled, hence he was unable to bring together a proper army to try and repel Mahmud Shah Durrani and his allies. Nonetheless the battle began.\nBattle\nThe battle took place on 29 June 1809, where Shah Shuja Durrani was strategizing and aligning his army for battle against Shah Mahmud, upon his arrival. However, during the preparation, Shah Shuja and his forces were ambushed by Shah Mahmud's much larger army, while being strung out across the road. Shah Mahmud's cavalry made several quick attacks on Shah Shuja's split forces, with coordinated attacks, pulling and wiping them apart with lancers. Witnessing this string of victories by Shah Mahmud, many of the noblemen on Shah Shuja's side defected or fled, likely due to bribes from Fateh Khan, Wazir to Shah Mahmud. A split force from the road led by Akram Khan met Fateh Khan. Akram Khan prepared for battle against Fateh Khan and fired a shot at him, which missed and killed an officer next to Fateh Khan. Fateh Khan, infuriated, charged and struck off Akram's head, and raised it in the air. By the time Shah Shuja heard of Akram's death, his army had disintegrated and fallen, resulting in a victory for Shah Mahmud. Shah Shuja was forced to flee from the battle.\nAftermath\nWith this victory, Mahmud Shah Durrani was able to usurp and secure the Durrani throne, starting his second reign on the Durrani Empire. Mahmud Shah Durrani reigned until his second deposition in 1818.\nReferences"
    }
  ]
}