{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Sobral\n\n| result      = Anglo-Portuguese victory\n| combatant1  =  French Empire\n| combatant2  =  United Kingdom   Portugal\n| commander1  =  Jean-Andoche Junot\n| commander2  =  Brent Spencer Lowry Cole\n| units1      =  VIII Corps\n| units2      =  1st Division 4th Division\n| strength1   = 16,939\n| strength2   = 1st Division:7,0534th Division:7,400Total:14,453\n| casualties1 = 13 October:15714 October:120\n| casualties2 = 13 October:13914 October:67\n}}\n| zoom= 8\n| float= right\n| nolabels= 1\n| width= 304\n| height= 140\n| title= Peninsular WarBattle of Sobral\n| shapeD= n-circle\n| shape-colorD= navy\n| shape-outlineD= white\n| label-sizeD= 12\n| label-posD= left\n| label-colorD= navy\n| label-offset-xD= 0\n| label-offset-yD= 0\n| mark-sizeD= 12\n| label1= Lisbon\n| mark-coord1=\n| mark-title1= Invasion of Portugal (1807) on 19 November 1807\n| label2 = Sobral\n| mark-coord2 =\n| mark-title2 = Lines of Torres Vedras November 1810\n| label-pos2 = bottom\n| label-offset-y2 = -5\n}}\nThe Battle of Sobral (13–14 October 1810) saw an Imperial French army led by Masséna probe the Lines of Torres Vedras, built and defended successfully by Wellington's Anglo-Portuguese Army. Masséna had to order a retreat at the beginning of March 1811 having lost 21,000 men from hunger and disease induced by the scorched earth policy of Wellington.\nBackground\nThe Peninsular War had started in Portugal with the Invasion of Portugal (1807) and went on till 1814. In September 1810 Masséna made the third French attempt to occupy Portugal with his 65,000 strong army fighting in the Battle of Bussaco, but Wellington pulled back his army southwards. The French army under Masséna pursued Wellington and discovered a barren land without inhabitants, as the Portuguese peasants had left their farms after destroying all food they could not take with them and anything else that might be useful to the French as required by the scorched earth policy. On 11 October 1810, Massena with 61,000 men found Wellington behind an almost impenetrable defensive position, the Lines of Torres Vedras consisting of forts and other military defences built in absolute secrecy to defend the only path to Lisbon from the north.\nBattle\nJean-Andoche Junot's VIII Corps was engaged in the fighting on both days. On 13 October, the French drove back the skirmish line of Lowry Cole's 4th Infantry Division. The following day, Junot's troops seized an outpost belonging to Brent Spencer's 1st Infantry Division, but were quickly ejected from the position by a British counterattack.\nAftermath\nMasséna soon decided that Wellington's defensive lines were too strong to crack and elected to wait for reinforcements. But the lack of food and fodder meant that Masséna was forced to retreat northwards, starting on the night of 14/15 November 1810, to find an area that had not been subjected to the scorched earth policy. The French held out through February although the Iberian peninsula had suffered one of the coldest winters it had ever known, but when starvation and diseases really set in, Masséna ordered a retreat at the beginning of March 1811 having lost another 21,000 men.\nThe Third Portuguese campaign proceeded with the Battle of Sabugal.\nSee also\n*Fort of Alqueidão\n*List of forts of the Lines of Torres Vedras\n*Attrition warfare against Napoleon\nNotes\nReferences\n*\n*\n*\n*\n*\n*\n*\nExternal links\n*"
    }
  ]
}