{
  "content": [
    {
      "type": "text",
      "text": "# Battles of the Hundred Days\n\n]]\nBattles of the Hundred Days is a board wargame published by Operational Studies Group in 1979 that simulates the final Hundred Days of Napoleon's reign, culminating in the Battle of Waterloo. The game rights were purchased by Avalon Hill who retitled it Hundred Days Battles.\nBackground\nIn March 1815, Napoleon escaped from his exile on Elba, returned to France, raised another army and began the campaign of a Hundred Days that would end at the Battle of Waterloo.\nDescription\nBattles of the Hundred Days is a two-player game in which one player controls the forces of France, while the other controls the Anglo-Prussian forces. The game uses a rule system devised by Kevin Zucker called the \"Campaigns of Napoleon\" system—also used in the other board wargames such as The Emperor Returns (1986), Napoleon at Bay (1978), and Arcola, The Battle for Italy 1796.\nThe game is small, with only 100 counters, an 11\" x 17\" map and an 8-page rule book.\nGameplay\nOnly the counters for leaders and commanders appear on the board, while counters for military units are kept on an organizational chart, so the strength of units is not known to the opponent until they engage in combat. Each player starts their turn by consulting the administrative points table to see how many (if any) extra points the player can add to their points pool. These points are used to create movement commands, and to ameliorate march attrition. There are special rules for reinforcements, French garrisons, weather, and morale.\nMovement\nEach leader has an Initiative rating, and cannot move unless the player successfully rolls the leader's initiative or lower. The Austrians are given one free movement not requiring an Initiative check as long as the leader is within ten Cavalry Movement Points of a Dispatch Hex.\nCombat\nAs a result of combat, the losing unit loses strength points and is required to retreat a certain number of hexes. The victorious player rolls a die to see how far their unit may move in pursuit. The retreating unit must lose strength points equal to what the victorious unit lost or the number of hexes the victorious unit can pursue, whichever is greater. If the victorious unit catches the defending unit, the retreating unit is eliminated. In addition, units that lose too many strength points become offensively ineffective, although they can still fight defensively.\nPublication history\nKevin Zucker, a managing editor for wargame publisher Simulations Publications, Inc., decided to start up his own games company, Tactical Studies Group, in 1978. One of his first product was Battles of the Hundred Days, released as a ziplock bag game in 1979 with cover art on the rule book by the Victorian artist Lady Butler. Due to the similarity between the company name \"Tactical Studies Group\" and \"Tactical Studies Rules\" (TSR – the publisher of Dungeons & Dragons) — Zucker quickly changed the company name to Operational Studies Group (OSG).\nAs would happen with several other OSG games such as Arcola and The Legend of Robin Hood, industry giant Avalon Hill bought Battles of the Hundred Days, retitled it Hundred Days Battle and published it as a boxed set in 1983 with the same cover art.\nReception\nIn Issue 25 of the British wargaming magazine Phoenix, Rob Gibson warned players that because the game only had a hundred counters \"one might be forgiven for thinking that this is yet another simple if not simplistic game — but you would be wrong.\" Gibson concluded \"This is not really a game for a beginner: it is fairly complex to learn, but repays in the accuracy of the simulation and the enjoyment to be had in the tense situations it produces. I would even go so far as to recommend it to all gamers, no matter what your period — it's a cracker!\"\nIn Issue 28 of The Grenadier, Marion Bates commented, \"Removing tactical considerations makes for a very different game than one is accustomed to on this subject.\" Bates concluded, \"Even with its weaknesses and simplifications, this may be the best treatment of the subject at this level currently available. Extremely fluid and fast-paced despite the added complexity, it can be played in just a  couple of hours.\"\nIn Issue 52 of Moves, Ian Chadwick was not impressed, writing, \"This is really an attempt to cram an excellent operational system into a tactical matrix; where the rules work in the open, they feel cramped in a  smaller game. The entire feeling for manoeuver is removed and is dominated by the rules structure, not by the flow of the game.\" Chadwick concluded, \"It's simply not worth the effort to learn the long rules to play such a small game.\"\nReferences\nExternal links\n*"
    }
  ]
}