{
  "content": [
    {
      "type": "text",
      "text": "# Battles for Karlivka\n\n}}\n| combatant2        =  Donetsk People's Republic\n| commander1        =  Semen Semenchenko\n| commander2        =  Igor Strelkov  Igor Bezler(Bezler Group commander)\n| units1            =  Armed Forces of Ukraine\n* 93rd Mechanized Brigade\nNational Guard of Ukraine\n* Donbas Battalion\nDnipro-2 Battalion\nRight Sector\n*Ukrainian Volunteer Corps\n| units2            = Donbass People's Militia Vostok Battalion Bezler Group\n| campaignbox       =\n| casualties1       = 80+ killed200+ wounded7 captured1 tank destroyed 4 armoured vehicles destroyed\n| casualties2       = 167+ killed500+ wounded38 captured8+ tanks destroyed19+ armoured vehicles destroyed\n| date              = 22 May — 23 July 2014()\n}}\nDuring May–July 2014, a series of military engagements took place for control of the village of Karlivka in Donetsk Oblast, in eastern Ukraine.\nGeographic location\nThe village of Karlivka is located 28 kilometers west of Donetsk and was considered the \"western gate\" of the capital of the DPR, so control over this village was important for the militia. The Karlovskoye reservoir was a reserve source of fresh water for Donetsk. A highway of republican significance passed by the village, which was a direct road from Donetsk to Dnipropetrovsk and further to Kyiv. In Karlivka there was the only bridge across the Vovcha River, capable of withstanding heavy military equipment. The settlement is also located near Pervomaiske and Netailove.\nBattle\nFrom about mid-May 2014, one of the companies (which included about 110-120 fighters) Insler's rebel group under the command of a militia member with the call sign \"North\", with a platoon from the Vostok (brigade) and other militias began the defense of Karlivka. The militia dug trenches with passages, reports, mined areas to which Ukrainian units were withdrawn. Also, the militia partially damaged the dam of the Karlovsky reservoir, thereby flooding some lowlands so that it was difficult to pass through them.\nChronicle of fighting\nOn the morning of May 23, 2014, near a gas station near Karlivka, a convoy of cars and minibuses, on which a platoon of the Ukrainian volunteer battalion Donbas was moving, was ambushed by the DPR militia. Some of the fighters managed to break out of the encirclement and reach the checkpoint of the Ukrainian military near the city of Krasnoarmeysk (Pokrovsk). As a result of about four hours of fighting, almost half of the platoon's men were injured of varying severity, and there were also dead. Subsequently, Bezler said that all the soldiers of the Donbas battalion captured by the DPR militiamen were shot.\nThroughout June and part of July, medium-intensity fighting continued in the vicinity of Karlivka. These battles were fought with the use of barrel and rocket artillery, as well as tanks on both sides.\nOn June 30, 2014, the Ukrainian battalion Donbas began the assault on Karlivka. This attack was repulsed, during the battle around fifteen soldiers of Donbas battalion were killed. The separatists also suffered casualties.\nOn the morning of July 6, 2014, the Donbas battalion launched a second assault on Karlivka. This attack of the Donbas battalion was also unsuccessful, during the battle the battalion suffered heavy losses.\nOn July 7, 2014, a group of DPR militia consisting of 27 fighters of Bezler's detachment and fighters of the Vostok Battalion, supported by one T-64 tank, two BRDM and three pickup trucks with heavy machine guns mounted on them, attacked the checkpoints Ukrainian army near the village of Umanske and in Novoselivka. As a result of the battle, two checkpoints, one tank, two BMPs, one APC, one ZU23-2, a mortar battery were destroyed. One soldier of the Ukrainian army was taken prisoner. The commander of Company North was wounded in the battle. Despite the request of Bezler Zakharchenko, the DPR authorities did not set up their checkpoints on the site of the defeated Ukrainian ones.\nOn July 10, 2014, the offensive of the DPR militia near Karlivka was stopped by units of the 93rd brigade, parts of the Donbas and Dnipro-2 battalions.\nOn July 12, 2014, Bezler received an order from the DPR Defense Minister Igor Strelkov to relocate the \"North\" company from Karlivka to his zone in Horlivka. Over the past month and a half of the defense of this village, seventeen soldiers of the Bezler group were killed, thirty wounded and eleven were captured. A phased withdrawal of the company \"North\" to Horlivka began.\nOn July 18, 2014, the last fighters of the company \"North\" left Karlivka, and the commander of the \"North\" himself remained to transfer the affairs to the command of the unit that replaced him from the Strelkov group. The village began to be defended by several platoons of the DPR militia.\nOn July 20, 2014, protracted fighting took place in the area of Karlivka. During July 21, 2014, fighting continued near Karlivka and Netailove. The attacks of the Ukrainian side did not bring much success, and the Armed Forces of Ukraine began to pull up to 40 armored vehicles and 350 personnel from the vicinity of Selydovo.\nOn the night of July 22–23, 2014, the DPR militia fighters, suffering heavy losses from the fighting, were forced to retreat from Karlivka, Netailove and Pervomaiske. According to Strelkov, these settlements were left under the threat of encirclement and subsequent destruction of the DPR militia forces there.\nDPR withdrawal\nOn July 23, 2014, Karlivka was captured by the units of the Armed Forces of Ukraine. The Donbas battalion and several other military units of Ukraine took part in the clearing of the village from the remaining separatist forces. After the withdrawal from Karlivka and the surrounding area due to unequal forces, the main hostilities were conducted for the capture of the village of Pisky. There, the forces of the tank battalion of the Armed Forces of Ukraine tried to push the militia inside Donetsk. In the village of Pervomayskoye, the Armed Forces of Ukraine deployed four D-30 howitzers and three BM-21. Mortar attacks by the DPR militia from the vicinity of Nevelske destroyed two Grad installations and half of the howitzers of the Armed Forces of Ukraine. In addition, within a few days after the retreat in the vicinity of Karlivka, the militia carried out pinpoint strikes on the positions of the Armed Forces of Ukraine.\nAs a result of the retreat of the DPR militia from Karlivka, the confrontation line approached Donetsk.\nReferences"
    }
  ]
}