{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Erigon Valley\n\n| strength1         = 10,000 infantry600 cavalry\n| strength2         = 10,000 infantry500 cavalry\n| casualties1       =  killed\n| casualties2       =  killed\n}}\nThe Battle of Erigon Valley or the Battle of Lyncus Plain took place in 358&nbsp;BC between the Illyrians under Bardylis and the Macedonians under Philip II. After forty years on continuous Illyrian dominance and expansion under Bardylis, Philip II after marrying Audata, an Illyrian princess, marched into Illyria and confronted the Illyrian tribesmen. The battle described by Diodorus and Frontinus shows the power and excellence of both the Macedonian and Illyrian armies.\nBackground\nMacedonian campaigns\nIt seems that Bardylis opposed the deal with Amyntas II and Sirras and invaded Macedonia in 393&nbsp;BC. Bardylis used new warfare tactics never before used by any of the Illyrians. He won a decisive battle against Amyntas III, expelled him, and ruled Macedonia through a puppet king. In 392&nbsp;BC, Amyntas III allied himself with the Thessalians and took Macedonia under his rule from the Illyrians. However, the Illyrians were constantly raiding and ruling over the northern frontiers of Macedonia. After continuous invasions, Bardylis forced the Macedon's to pay him an annual tribute in 372&nbsp;BC.\nIn 370&nbsp;BC, Amyntas died after a long life, having restored the fortunes of his kingdom after the Illyrian disasters. His marriage to Eurydice of the Illyrian Sirras produced three sons and a daughter. His eldest son was Alexander II. In 369&nbsp;BC, Bardylis prevented Alexander II from eliminating the Illyrians from Macedonia. After the battle, Bardylis was said to have briefly held Philip II, the youngest brother of Alexander II, as a hostage. In 365&nbsp;BC, Alexander II was succeeded by his brother Perdiccas III.\nThe Paeonians began a series of raids against the Macedonians in support of a Illyrian invasion from the north. Perdiccas, humiliated by the indignity of having to pay tribute to the Illyrians, marched north in the spring of 358&nbsp;BC with the Macedonian army to resolve the issue by battle. This was not the first occasion in which he had fought against Bardylis, but the Macedonians lost the battle. The king himself was among the 4,000 Macedonian dead. The remainder, panic-stricken and scared of the Illyrian army, lost heart for continuing the war. This was the worst loss suffered by the Macedonians in the range of their efforts to free themselves from the Illyrians. The Illyrians followed up their victory by expanding their control southward to Lake Lychnitis (Lake Ohrid) and westward into upper Macedonia. By the actions of Bardylis, the Illyrians had brought Macedonia close to collapse.\nWhen Philip II, the youngest of the three brothers, assumed the throne, he was determined to subdue the Illyrians under Bardylis once and for all, destroying the Illyrian menace.\nReign of Philip II\nIn 359&nbsp;BC, Macedonia could come back to the field of battle against the Illyrians, after it had overcome the internal state of political chaos and removed the risk of attack from other opponents. When Philip II assumed the Macedonian throne, substantial areas of upper Macedonia remained in control of Bardylis. In order to concentrate on the internal struggle necessary to secure his crown, Philip reaffirmed the treaty the Illyrians had imposed on Macedonia by force of arms and sealed the alliance by his marriage of Audata, probably a niece or daughter of Bardylis. This action undoubtedly deterred a full-scale Illyrian invasion of Macedonia at a time when the country was most vulnerable.\nBy the spring of 358&nbsp;BC, Philip had at last secured his throne and was now able to address the occupation of northwestern Macedonia by Bardylis. When word of the mobilisation of the Macedonian army came to Bardylis' attention, he proposed to Philip that they sign a treaty to maintain the status quo, provided that both parties maintain the cities that were already in their possession at the time. This was, of course, unacceptable to Philip because he was not prepared to accept any terms other than a full Illyrian withdrawal from northwestern Macedonia. Bardylis, however, was not inclined to give up his winnings without a fight. Philip mobilised every able-bodied soldier in Macedonia for the battle. Bardyllis, as before, was not likely to take any prisoners, so any Macedonian defeat would result in crippling casualties.\nBattle\nWith his northern frontier safe for the time being, Philip turned westward that summer to regain the territory lost by his brother. The Illyrians presented a daunting challenge, able to match Philip's manpower with 10,000 infantry and 500 cavalry of their own against Philips slightly advantageous 10,000 infantry and 600 cavalry. Moreover, Bardylis' infantry had a strong component of shock fighters, possibly making up 7,000 of the total. The Illyrian warriors used a heavy-headed sibyna spear and bossed shield. Philip had to have known that they would put his as yet untried hypaspists and native phalangites to a stern test of hand-to-hand combat. The Macedonians weren't facing a newly enfranchised king like Philip, but rather a grizzled veteran of many wars, as Bardyllis might have been 90 years old, yet was still sturdy enough to take the field on horseback.\nThe Illyrians moved to offer battle on open ground. Hammond suggests (1994, 26) that this was just west of Kirli Dirven pass on the plain of Lyncus. Philip arrived and deployed his phalanx much as he had done in its first action, with the phalangites at left and centre, hired hoplites and hypaspites from the right in that order again and cavalry and light infantry split off both wings. As for Bardylis' arrangements, Diodorus' claim of a square formation (16.4.6) is confused even in context of his own battle description and, since such tactics are unattested elsewhere save in retreat for either Illyrians or Greeks in this area, the version of Frontinus (2.3.2) is to be preferred. This indicates that Bardylis set up in a linear fashion, his heavy infantry matching the phalanx's width with even deeper files and having the best men fronting in the middle with cavalry and skirmishers outboard.\nThe formations had closed together, Illyrian at quick pace and Macedonian slowly as to keep good order. When they finally met, a vicious melee was set in motion from one end of the field to the other. All the elements of the phalanx at this point moved in chorus to execute their deadly tasks. Left through centre the pikemen held firm, their long weapons keeping Illyrian spear points out of range as they wounded at least a few among those leading the Illyrian effort. At the same time, Philip and his spear-men made progress on the right striking into the Illyrians as momentum from the rear ranks pushed them relentlessly ahead. The Illyrian front-fighters opposing them got much less help from behind and were powerless to resist the intense, file-length pressure coming at them. In the end, the Illyrians had no choice but to yield ground. As the Illyrians left began edging back, it was the hetairoi and their skirmishers that now excelled, easing the way for the hoplites and hypaspists by clearing all Illyrian cavalry and light infantry from that flank. Exposed and put beyond endurance, the Illyrian left now gave way completely and sent the rest of their formation into a frantic flight under fierce pursuit.\nDiodorus Siculus (1st century BC) writes this of the event:\nAnd at first for a long while the battle was evenly poised because of the exceeding gallantry displayed on both sides, and as many were slain and still more wounded, the fortune of battle vacillated first one way then the other, being constantly swayed by the valorous deeds of the combatants; but later as the horsemen pressed on from the flank and rear and Philip with the flower of his troops fought with true heroism, the mass of the Illyrians was compelled to take hastily to flight. When the pursuit had been kept up for a considerable distance and many had been slain in their flight, Philip recalled the Macedonians with the trumpet and erecting a trophy of victory buried his own dead, while the Illyrians, having sent ambassadors and withdrawn from all the Macedonian cities, obtained peace. But more than seven thousand Illyrians were slain in this battle.\nDiodorus' tally of 7,000 slain among the Illyrians in this action (16.4.7) is clearly an exaggeration. It might be better seen as a reckoning of the heavy infantry defeated than as an actual toll of the dead. At the same time Illyrian casualties must have been very high (\"several thousand\" per Justin (7.6.7)), with a likely 20-30 percent killed. Philip's cost would have been quite a bit lower, perhaps some 3–5 percent going down in the fight or dying shortly thereafter. Bardylis appreciated the scope of his defeat and lost no time in suing for peace. The Illyrians later sent representatives and settled terms for peace, releasing all the cities they had conquered from Macedonia. In this battle, the troubling issue of Lynkestis was solved, changing the situation in the western borders in favour of Macedonia. Philip secured Macedonians northwestern frontier by annexing Illyrian territory as far as Lynkestis. This would form a defensive buffer against any future Illyrian raids attempted through the Drilon Valley. The borders between the Illyrian and the Macedonians remained around Lake Ohrid for a long time.\nNotes\nReferences\nBibliography\n*\n*"
    }
  ]
}