{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Derapet__disambig_1\n\n| combatant2        =  Taliban\n| combatant3        =\n| commander1        =  Chris Wallace James Fanning Tim Hurley\n| commander2        =  Various\n| commander3        =\n| strength1         =  20 infantrymen  Two ASLAV-25s 20 soldiers\n| strength2         = 90–100 insurgents\n| strength3         =\n| casualties1       = 1 killed\n| casualties2       = 30+ killed\n| notes             =\n| campaignbox       =\n}}\nThe Battle of Derapet was fought near the village of Derapet in the Tangi Valley in Deh Rahwod, Orūzgān Province, southern Afghanistan, between a combined Australian Army and Afghan National Army patrol and Taliban forces on 24 August 2010. Australian forces had only recently taken over responsibility for Deh Rahwod as part of a major expansion of their area of operations which took place following the Dutch withdrawal from Afghanistan in August. The combined coalition patrol included 20 Australians and 20 Afghan National Army troops. The small Australian force from 1st Mentoring Task Force (MTF-1) based in Tarin Kowt included two sections of dismounted infantry and two ASLAV-25 guncars and was tasked with a fighting patrol to find and inflict damage on insurgent forces known to be in the area.\nThe patrol used an aqueduct to move into Derapet after engineers nearby had identified fighting-aged males moving into the area while women and children were seen leaving the valley. Initially contacted by a large Taliban force of 90–100 insurgents from positions less than  away, the Australian and Afghan troops counter-attacked from six different positions, engaging the insurgents with small arms, machine-gun fire and anti-armour rockets, while the cavalry engaged from the high ground in fire support. AH-64 Apache attack helicopters also provided close air support, while one round of precision-guided  medium artillery from a US M777 howitzer was also used in support. A quick reaction force (QRF) was available nearby but was not required. Finally, after three and half hours of intense fighting the Australians and Afghans were running low on ammunition and broke contact, moving back through the QRF which was holding the rear, to their Bushmaster PMVs at the vehicle drop-off point, prior to moving back to the patrol base at Anar Juy.\nOne Australian soldier was shot and killed during the fighting Jared MacKinney, 28, a lance corporal in the 6th Battalion and, was subsequently evacuated by helicopter which took fire in conducting the medical evacuation, while no Afghan National Army casualties were reported. The ASLAVs had proven decisive, with the range and accuracy of their weapons and sensors allowing them to provide very effective support to the Australian infantry. Over 30 Taliban insurgents were reportedly killed during the battle, while more were thought to have been killed or wounded and then carried away by other fighters as they retreated. The surviving Taliban subsequently retreated into the mountains.\nCorporal Daniel Keighran was awarded the Victoria Cross for Australia for his actions during this battle. Keighran \"with complete disregard for his own safety, broke cover on multiple occasions to draw intense and accurate enemy fire to identify enemy locations and direct return fire from Australian and Afghan fire support elements\". Later in the battle Keighran \"when his patrol sustained a casualty, again on his own initiative and in an act of exceptional courage, ... moved from his position of cover to deliberately draw fire away from the team who were treating the casualty.\" Other soldiers awarded for their actions in the battle were Lieutenant James Fanning (Distinguished Service Medal), Sergeant Sean Lanigan and Private Paul Langer (Medal of Gallantry) and Private Sean Parker (Commendation for Gallantry).\nSee also\n*Operation Slipper\nReferences"
    }
  ]
}