{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Mud Springs\n\n|map_type=Nebraska\n|result=inconclusive\n|combatant1=United States of America\n|combatant2=Cheyenne, Lakota Sioux, and Arapaho tribes\n|commander1=William O. Collins\n|commander2=\n|strength1=230 soldiers\n|strength2=500–1,000 warriors\n|casualties1=1 dead, 8 wounded\n|casualties2=few, if any\n|}}\nThe Battle of Mud Springs took place February 4–6, 1865, in Nebraska between the U.S. army and warriors of the Lakota Sioux, Cheyenne, and Arapaho tribes. It was part of a series of retaliations by the Native American alliance after the U.S. army committed the Sand Creek Massacre. The battle was inconclusive, although the Indians succeeded in capturing some Army horses and a herd of several hundred cattle.\nMud Springs is located 8&nbsp;mi northwest of Dalton, Nebraska, and is today a National Historic Site.\nBackground\n, a Brulé Lakota, was probably in the battle. The Lakota tribes participating in the battle were Brule and Oglala.]]\nAfter the United States Army committed the Sand Creek Massacre in November 1864 in Colorado, the Plains Indians of the three tribes in that region decided to move northward to the more isolated Powder River Country of Wyoming. En route, they sought revenge for Sand Creek, spending most of the month of January raiding along the South Platte River in Colorado and burning the settlement of Julesburg on February 2. On February 3, they burned a telegraph station on Lodgepole Creek and the next day an advance party of Sioux warriors appeared at Mud Springs, a stagecoach station with a telegraph. Only 14 men, including nine soldiers, were behind the sod and log walls of the station.\nBoth Indians and soldiers appear to have been well-armed; bullets from 21 different types of firearms have been found at the battle site. The most common firearm of both sides may have been the Spencer carbine. The Indians also used bows and arrows. They had abundant food and other supplies obtained from their raids in the South Platte Valley, thus were able to remain together in a large group for an extended period of time.\nBattle\nThe advance party of Indians stole 18 horses and a large herd of cattle. The telegraph operator cabled for help to Fort Mitchell, 55&nbsp;mi west, and Fort Laramie, 105&nbsp;mi west. At daybreak the next morning, after an all-night ride, Lt. William Ellsworth and 36 men reached Mud Springs from Fort Mitchell to reinforce the station. A number of Indians, estimated at more than 1000, arrived shortly thereafter.  Ellsworth sent 16 men to occupy a bluff and prevent the Indians from getting too close to the station, but the troopers were attacked by 500 Indians and retreated to the station, suffering one man killed and one wounded. In the afternoon, the soldiers in the station opened the corrals and let their horses run loose. This had the desired effect of dispersing the Indians surrounding the station as they attempted to capture the animals. By that time, also, the Indians had tired of exchanging fire with the soldiers inside the thick-walled station and retired to their encampment about 10&nbsp;mi east.\nAt 2:00&nbsp;am on February 6,  Col. William O. Collins, with a 25-man escort, arrived at Mud Springs and early the next morning, the remainder of his command of about 120 men arrived from Fort Laramie, bringing the total in the station up to 170. His soldiers were exhausted after a two-day march with little sleep, and many had been frostbitten in the bitter cold. The main body of Indian warriors returned to Mud Springs soon afterward that morning (Collins estimated their number at 500–1,000). Collins secured his horses in a makeshift corral formed by four wagons, but about 200 Indians began showering the horses and men in the corral with arrows from 75 yards away, killing and wounding horses and injuring some of the men. Collins sent out two groups of soldiers to drive the Indians out of bow-and-arrow range and capture and hold the higher ground. With the advance of the soldiers, the Indians slowly withdrew and departed the battlefield. That night, 50 additional troopers under Lt. William Brown arrived at Mud Springs with a 12-pounder mountain howitzer. Collins prepared to take the offensive the next day, February 7, but the Indian forces did not return to Mud Springs.\nCasualties among the soldiers were one man dead and eight wounded. Col. Collins estimated the Indian casualties at 30.  The Cheyenne warrior George Bent said no Indians were killed.\nAftermath\nThe large Indian encampment—composed possibly of 4,000-5,000 men, women and children—moved leisurely to the North Platte River on February 6. They crossed the frozen river and camped among bluffs about 5&nbsp;mi north of the river. They were joined by the warriors returning from the battle. The Indians planned to remain there for four days to rest their horses, not anticipating that the outnumbered soldiers would follow them. Col. Collins, however, left a garrison at Mud Springs and picked up the Indian trail with 185 men. He found an abandoned camp littered with the spoils of the Indians' plunder—codfish, flour, and empty cans of oysters, meat, and fruit—and followed their trail to the North Platte. There, he found the Indians and re-engaged them in the Battle of Rush Creek. One soldier would comment sarcastically that catching the Indians \"was an easy enough matter, but we had a terribly hard time letting them go.\"\nSee also\n* List of battles fought in Nebraska\nReferences"
    }
  ]
}