{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Rahon (1710)\n\nMughal Empire\n| commander1        =  Unknown\n| commander2        =  Shamas Khan\n| strength1         = 70,000–80,000\n| strength2         = 100,000\n| casualties1       = Unknown\n| casualties2       = Heavy\n}}\nThe Battle of Rahon was fought between Sikhs and the Mughal Empire on 11 October 1710.\nBackground\nBanda Singh Bahadur captured almost half of Punjab, east of Lahore and became the ruler of a region in eastern Punjab from river Indus to Satluj. This encouraged other local Sikhs who resided in districts of Jalandhar Doab, to pick up arms, appoint their own tehsildars and thanedars and considered themselves capable enough to face Shamas Khan, the faujdar of Jalandhar Doab. They addressed a letter to Shamas Khan demanding his submission and conveyance of all his treasure. Shamas, in an act of subterfuge, assumed a compliant disposition and sent a small consignment of goods hoping to placate the Sikhs, and in the meantime gathered his army and materials and advanced towards Rahon. Initially elated by Shamas' apparent submission, the Sikhs were disillusioned upon hearing the war preparations against them and decided to move their forces and call for reinforcements.\nBattle\nThe Sikhs arrived at Rahon, hastily built a fortress, and issued threatening orders to the revenue payers and revenue officers for their submission. Shamas Khan and his army reached Rahon and surrounded the fort from all sides to attack the Sikhs, while the Sikhs responded with shelling with cannons. The Sikhs realizing that they were outnumbered, retreated back to the fort of Rahon where they were besieged for several days. The Sikhs would attack the imperial forces at night, causing heavy casualties but it did not have much impact as the imperial force was overwhelmingly large, and realizing it as a disadvantage, they changed their strategy to mislead the Imperial Army, and departed surreptitiously in the middle of the night. Shamas Khan stopped the pursuit only after a few miles as he assumed a reinforcement by Banda Singh could arrive. Content with the seizure of the fort of Rahon and some treasure, Shamas Khan assumed the campaign to be a success and subsequently ordered the breaking up of the camp and the demobilization of his troops who were sent to their homes, stationed a garrison at the fort of Rahon, and returned to Sultanpur. However, as the Sikhs strategized, they remained hidden around the neighborhood of Rahon, and right after the evacuation, one thousand Sikhs attacked the garrisoned troops stationed in the fortress, routed them, and recaptured the fort.\nOutcome\nThe result of the battle is disputed among historians. According to some accounts, the Sikhs would occupy the fort of Rahon and would subsequently capture the Jalandhar Doaba from the Mughals. According to Hari Ram Gupta, following the capture of Rahon by the Sikhs, the Mughals would fight a battle with the Sikhs in the garden of Yaqub Khan. The Sikhs were defeated in the garden, forcing their retreat towards the fort of Rahon. After a short siege, Rahon fell in November 1710, and the Sikh forces were forced to retreat. After the capture of Rahon, the Mughals under Shamas Khan would advance and capture Sirhind, resulting in the death of 1,000 Sikhs. However, according to Ganda Singh, the Mughal army, under the command of Shamas Khan, advanced upon Sirhind. Sukha Singh and Sham Singh would fight the Mughals in the garden of Yaqub Khan. The Sikhs were defeated, Sukha Singh was killed, and the Sikhs were forced to retreat towards the fort of Sirhind. Surjit Singh Gandhi also states that the fight between Sukha Singh and the Mughals occurred within the outskirts of Sirhind. Sirhind would be recaptured by the Mughals, and the severed heads of the slain Sikhs would be sent to the Mughal Emperor Bahadur Shah.\nAftermath\nShortly after the capture of Sirhind, Shamas Khan was dismissed as faujdar of the Jalandhar Doaba by the Mughal authorities. This was largely due to Muhammad Amin Khan's resentment towards Shamas, as Shamas was the one who recaptured Sirhind. Resentful that he was not the one that recaptured the city, Muhammad Amin Khan managed to convince the Mughal authorities in removing Shamas Khan as Faujdar of Jalandhar. He accused Shamas of endangering Mughal authority, and as a result, Shamas was dismissed from his post as faujdar of Jalandhar.\nSee also\n* Rahon\nReferences"
    }
  ]
}