{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Attock (1813)\n\n*Capture of Attock\n| status            =\n| combatant1        =  Sikh Empire\n| combatant2        =  Durrani Empire\n| commander1        =  Dewan Mokham Chand Hari Singh Nalwa Sham Singh Attariwala Sultan Mahmud Khan\n| commander2        =  Fateh Khan Barakzai Dost Mohammad Khan\n| units1            =\n| units2            =\n| strength1         = 20,000\n| strength2         = 15,000\n| casualties1       = Unknown\n| casualties2       = 2,000\n| notes             =\n| campaignbox       =\n}}\nThe Battle of Attock (also known as the Battle of Chuch or the Battle of Haidru) took place on 13 July 1813 between the Sikh Empire and the Durrani Empire. The battle was the first significant Sikh victory over the Durranis.\nBackground\nIn 1811–12, Ranjit Singh invaded the hill states of Bhimber, Rajauri, and Kullu in preparation for an invasion of Kashmir. In late 1812, Fateh Khan, the Vizier of Kabul, crossed the Indus river under orders from Mahmud Shah Durrani to raid Kashmir and to free Shuja Shah Durrani from its renegade vizier, Atta Muhammad Khan. In an 1812 interview with Ranjit Singh, Fateh Khan agreed to a joint invasion of Kashmir. He could not invade Kashmir if he was opposed by the Sikh Empire, and agreed that a small Sikh force under Dewan Mokham Chand Kochhar would receive one third of the plunder.\nBoth invasions began at Jhelum, but once the armies reached the Pir Panjal Range, Fateh Khan used a heavy snowfall to double march his veteran mountain troops through the range. However, Dewan Mokham Chand offered the Rajauri raja a large jagir if he could find a path through the range that would allow the Sikhs to reach the valley of Kashmir at the same time as the Afghan troops and was able to have a small body of troops under Jodh Singh Kalsia and Nihal Singh Attari present at the captures of Hari Parbat and Shergarh. The vizier of Kashmir, Atta Muhammad Khan, had offered no resistance to either army but Fateh Khan refused to share the spoils. Shuja Shah Durrani chose to be escorted by Dewan Mokham Chand Kochhar to Lahore, the capital of the Sikh Empire, out of fear of becoming a prisoner at Kabul.\nRanjit Singh became annoyed at Fateh Khan's refusal to share the plunder and opened negotiations with the renegade governor of Attock, Jahandad Khan, brother to the recently deposed Atta Muhammad Khan of Kashmir, and took control of the fort at Attock. After Jahandad Khan accepted his jagir, Dia Singh, a Sardar with a small contingent of troops in the area, took control of Fort Attock including 3,510 Maunds of grain, 439 rounds of cannon shot, 70 cannon and small mortars, and 255 Maunds of rock salt. Hari Singh Nalwa arrived with Dewan Devi Das and a detachment of cavalry to support the garrison at an unknown date.\nBattle\n, whose capture by the Sikh Empire led to the Battle of Attock]]\nFateh Khan set off from Kashmir in April 1813 and invested Attock Fort. At the same time Ranjit Singh rushed Dewan Mokham Chand and Karam Chand Chahal from Burhan with a force of cavalry, artillery, and a battalion of infantry to meet the Afghans.\nDewan Mokham Chand encamped  from the Afghan camp, unwilling to risk a decisive engagement, although both sides engaged in numerous skirmishes and took losses. On 12 July 1812, the Afghans' supplies were exhausted and Dewan Mokham Chand marched  from Attock to Haidaru, on the banks of the Indus River, to offer battle. On 13 July 1812, Dewan Mokham Chand split the cavalry into four divisions, giving command of one division to Hari Singh Nalwa (and to Sardar Gurmukh Singh Lamba >), and taking command of one division himself. The lone battalion of infantry formed an infantry square protecting the artillery, with Gouse Khan commanding the artillery. The Afghans took up positions opposite the Sikhs, with a portion of their cavalry under the command of Dost Mohammad Khan.\nFateh Khan opened the battle by sending his Pathans on a cavalry charge which was repulsed by heavy fire from the Sikh artillery. The Afghans rallied under Dost Mohammad Khan, and according to Griffin, led a \"brilliant\" cavalry charge which threw one wing of the Sikh army into disarray and captured some artillery. When it appeared the Sikhs had lost the battle, Dewan Mokham Chand led a cavalry charge atop a war elephant that repulsed the Afghans \"at all points\", and routed the remaining Afghan troops. Fateh Khan, fearing his brother, Dost Mohammad Khan, had died, escaped to Kabul and the Sikhs captured the Afghan camp, including the lost artillery pieces.\nAftermath\nAmritsar, Lahore, and other large cities across the Sikh Empire were illuminated for two months afterwards in rejoicing over the victory. After his defeat at Attock, Fateh Khan made further multiple attempts to get Attock back, even writing a letter to Dewan Mokham Chand, asking to return Attock which could lead to good relations between the two parties, but Mokham Chand refused and warned that the conquest of Kashmir would be next. In 1814, Yar Mohammad Khan, governor of Peshawar, attacked Attock but was repulsed, following which Fateh Khan again sent a letter in 1815, asking to hand over Attock and restore it under Mahmud Shah's authority in exchange for Multan and paying the tax revenue of Kashmir. During the last five years of his life from 1813 to 1818, Fateh Khan remained distressed over the loss of Attock.\nNotes\nReferences\n*\n*\n*\n*\n*"
    }
  ]
}