{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Nibley Green__disambig_1\n\n|commander2= William Berkeley, 2nd Baron Berkeley\n|strength1=1,000\n|strength2=1,000\n|notes=\n}}\nThe Battle of Nibley Green was fought near North Nibley in Gloucestershire on 20 March 1470, between the troops of Thomas Talbot, 2nd Viscount Lisle and William Berkeley, 2nd Baron Berkeley. It is notable for being the last battle fought in England entirely between the private armies of feudal magnates.\nPrelude\nLisle and Berkeley had long been engaged in a dispute over the inheritance of Berkeley Castle and the other Berkeley lands, Lisle being heir-general to Thomas de Berkeley, 5th Baron Berkeley and Berkeley heir-male. Lisle impetuously challenged Berkeley to a battle, and the latter agreed, the battle to be fought the next day at Nibley Green. Lisle paid for his rashness with his life.\nIn the little time available, Lisle could only raise a force among his ill-equipped local tenants. Berkeley, however, could draw upon a garrison from Berkeley Castle as well as his local levies, and he was reinforced by men led by his brother Maurice Berkeley, 3rd Baron Berkeley and miners from the Forest of Dean. This gave him a considerable advantage in numbers, about 1,000 to 300. Philip Mede of Wraxall, an alderman and mayor of Bristol in 1459, 1462, and 1469, sent some men on the Berkeley side. Maurice Berkeley, William's younger brother, had married Isabel Mede, Philip's daughter, for which act of marrying beneath his social status he had been disinherited of the Berkeley lands by his elder brother, William.\nBattle\nLisle led his men in a charge against Berkeley's troops as they emerged from a stand of woods. Berkeley's archers loosed arrows and broke up the charge. One of the Dean Foresters, an archer named \"Black Will\", shot Lisle in the left temple through his open visor and unhorsed him. A few dagger-strokes from the archers ensured Lisle's death, and his leaderless army broke and fled.\nAftermath\nAs Lisle's army dispersed, Berkeley advanced to Lisle's manor of Wotton-under-Edge and sacked it.\nFurther reading\n*Fleming, Peter & Wood, Michael. Gloucestershire's Forgotten Battle: Nibley Green 1470, 2003\nExternal links\n* [http://www.rotwang.co.uk/hob_chapter_05.html History of Berkeley]\n* [https://sites.google.com/site/meadfamilyhistory/home/counties/bristol Mead Genealogy]\n* [http://www.northnibley.org.uk/battle.php North Nibley website]\nReferences"
    }
  ]
}