{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Lewes Road\n\nThe Battle of Lewes Road was a confrontation that took place in Brighton during the 1926 United Kingdom general strike.\nBackground\nThe tensions that led to the general strike were exacerbated locally by the policies of the Brighton Corporation and the fears of members of the Middle Class Union. Their concerns, however, were misplaced since local socialists and unemployed people were not revolutionaries, and when the strike began on 4 May, only 6000 workers, a small proportion of the town's workforce, came out. Of them, transport workers were seen to represent the greatest threat and succeeded in stopping service on the town's external rail links and internal tramway.\nOn 8 May, a group of strikers marched to the Town Hall in response to the council considering the use of volunteer labour on the trams but were turned away by police at the entrance. The police were supported by special constables known as \"Black and Tans\", who included \"farmers, sportsmen, hunting men, and retired cavalry officers\".\nConfrontation\nOn 11 May, a group of middle-class volunteers, including some students, attempted to break the strike and to remove trams from the depot on Lewes Road. The volunteers were blocked by strikers and their families, and curious local residents also gathered. Chief Constable Charles Griffin ordered the crowd to disperse and, on receiving no response, ordered officers to advance on foot, backed up by special constables on horseback. As the crowd was driven back towards Hollingdean Road, fighting broke out, and apparently without warning, the \"Black and Tans\" charged the crowd, striking out indiscriminately. The strikers retaliated, but the crowd was successfully dispersed. Two were seriously injured, and many others were hurt. Seventeen strikers were arrested.\nAftermath\nThe same night, there was a further disturbance outside the Brighton and District Labour Club on London Road, following which another five people were arrested. All 22 arrestees were imprisoned for an average of three months each.\nThe general strike was called off the following day by the Trades Union Congress, and some transport workers who struck were not reinstated by their employers. A celebratory dinner was held for the benefit of the special constables.\nSignificance\nThe local authority saw the \"Battle of Lewes Road\" as having served to crush revolutionary politics in Brighton, and for working-class activists, it was celebrated as a day of heroism and martyrdom. Following the events, there was little complaint from workers about the regular police, but much about the allegedly politically-motivated special constables.\nFurther reading / external links\n* Ernie Trory, Brighton and the general strike (1975)\n* Andy Durr, Who were the guilty?  General Strike Brighton 1926 (1976)\n* [https://www.crowdfunder.co.uk/p/plaque-for-the-battle-of-lewes-road-brighton-1926 Brighton and Hove TUC campaign for a plaque on Tramway House, Lewes Road to commemorate the Battle of Lewes Road]\nSee also\n* History of Brighton\nReferences"
    }
  ]
}