{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Kakarong de Sili\n\nKatipunan\n* Kakarong Republic\n| combatant2        =  Spain\n| commander1        =  Eusebio Roque Canuto Villanueva Gregorio del Pilar\n| commander2        =  José Olaguer Feliú\n| units1            =\n| units2            =\n| strength1         = 6,000 men, 1 fort\n| strength2         = 600 cazadores soldiers\n| casualties1       = 1,000+ killed, wounded, and captured (estimated) 1 fort\n| casualties2       = 24 killed, 76 wounded\n| notes             =\n| campaignbox       =\n}}\nThe Battle of Kakarong de Sili was fought on January 1, 1897, at Pandi, Bulacan, in the Philippines. The Kakarong Republic, based in the little fort in Pandi, was attacked by a force of Spaniards who massacred the Katipuneros there. At the end of the battle, General Eusebio Roque (also known as Maestrong Sebio and Dimabungo) was captured by the Spaniards. The Kakarong Republic was considered the first republic formed in Bulacan and in the Philippines.\nBackground\nWhen the revolution began at Balintawak, Katipuneros to the north of Manila, in the central plains aimed to join in the fight, but after the unsuccessful Battle of San Juan del Monte with Spanish forces and Bonifacio, the central Luzon Katipuneros lost heart and postponed most of their revolts. However, in Pandi, Bulacan and San Isidro, Nueva Ecija, the revolution had heated up. The Katipuneros in Bulacan established the Kakarong Republic and built a fort in the Real de Kakarong area. According to Life and Death of a Boy General, Teodoro Kalaw's biography of Gregorio del Pilar (then an officer of the military forces of the Kakarong area), a fort was constructed at \"Kakarong de Sili\" that was like a miniature city. It had streets, an independent police force, a military band, a military arsenal with factories for bolos and field artillery, and repair shops for rifles and cartridges. The \"Kakarong Republic\" was established in 1896. It had a complete set of officials, with Canuto Villanueva as Supreme Chief and Captain General of the military forces, Eusebio Roque, also known by his nom-de-guerre \"Maestrong Sebio\", then head of the Katipunan local organization (Balangay Dimas-Alang serving the town of Pandi), as Brigadier General of the Army and Casimiro Galvez. Roque was born on August 14, 1865 at Barangay Kaingin, Bocaue, Bulacan.\nBattle\nOn January 1, 1897, a massive force of fresh Spanish \"Cazadores\" marching in six columns, arrived at the fort, led by the Commandant José Olaguer Feliú. They besieged the fort for a number of hours, fighting Roque and del Pilar's forces.\nFinally, the walls and the men defending them gave way and Roque's forces were forced to retreat further into the fort. After breaching the walls, the Spaniards started to burn down the settlements, arms repairs and shop houses. The remaining Katipuneros there were massacred by the oncoming force.\nDel Pilar, just a lieutenant at the time, was wounded and he and the rest of his men retreated to the nearby Barangay Manatal. Villanueva managed to escape and retreat, but Sebio and the rest of his men were captured and imprisoned by the Spaniards.\nSebio was executed by firing squad, along with his men, on January 16, 1897. Eventually, Bulacan became a center of rebellion and guerilla tactics began being used by rebels there.\nThe commandant Olaguer Feliú captured six fortifications, seven guns, an ammunition factory and a large number of firearms. The Spanish troops had only one officer and 23 soldiers dead. The injured were one officer and 75 soldiers.\nAftermath\nThough a victory for the Spaniards, they did not manage to completely pacify the province from the rebels, as some who escaped during the battle retreated to nearby towns and villages and waged guerrilla rebellion there. The Spaniards did not have enough men to completely crush rebel resistance there as most of its men are fighting the rebels in Manila, Morong, Cavite, and Laguna Provinces.\nLegacy\n)]]\nThe battle was considered del Pilar's first \"baptism of fire\" as a revolutionary general. The Kakarong Republic, though hardly recognized or even remembered by historians today, was considered the first organized republic of the Philippine Revolution.\nIn 1924, the Kakarong Lodge No. 168 of the 'Legionarios del Trabajo', named in memory of the 1,200 Katipuneros who perished in the battle, erected a monument, the Inang Filipina Shrine (Mother Philippines Shrine) in the barrio of Kakarong of Pandi, Bulacan. The actual site of the battle is now a part of the barangay of Real de Kakarong.\nGeneral Emilio Aguinaldo became the first Philippine president to visit this ground in the late 1950s.\nEusebio Roque monuments stand at Bagumbayan, Bocaue and at Bulacan Heroes Park, Bulacan Provincial Capitol in his honor.\nViews of Kakarong de Sili\nFile:Ckakarongjf.JPG|The Kakarong Republic was considered the first and truly organized republic formed in the Philippines.\nFile:Kakarongjf.JPG|Inang Filipina Shrine in memory of the Philippine heroes of the Battle of Kakarong De Sili.\nFile:Ekakarongjf.JPG|Commandant Olaguer Feliu achieved victory with 600 men over 6,000 Katipuneros.\nReferences\n*\n*\n*\n*\nExternal links\n* [http://www.watawat.net/_the_republic_of_real_de_kakarong_de_sili.html The republic of Real de Kakarong de Sili]\n*"
    }
  ]
}