{
  "content": [
    {
      "type": "text",
      "text": "# Battle Organization of Russian Nationalists\n\nBorn}}\n* Nikita Tikhonov\n}}\n| activities = Murder\n}}\nThe Battle Organization of Russian Nationalists () or the Combat Organization of Russian Nationalists, often abbreviated as BORN (), was a Russian neo-Nazi group based out of Moscow. Members were accused of a series of murders and attempted murders, leading to the deaths of at least ten people.\nBackground\nBORN was one of the numerous far-right groups that arose in post-Soviet Russia between the late 1990s and early 2000s. This trend was seen as a direct result of  the economic, cultural and social changes in Russian society that came following the dissolution of the Russian SFSR and the Soviet Union.\nNumerous extremist cells similar to BORN participated in militaristic training and embarked on violent campaigns of attacks towards their perceived opponents: typically non-Slavic immigrants, radical anti-fascist protesters, Jewish persons, left-wing activists who opposed racism, ethnic Gypsies, members of the LGBT community, Muslims  - and, to a lesser extent, civilians with stigmatized lifestyle situations such as transients or prostitutes.\nFormation\nand Nikita Tikhonov founded the group in 2007. Goryachev had previously been the leader of the Russian Image organization in the early 2000s. Goryachev was reported to have Kremlin contacts. Goryachev and Tikhonov had met at Moscow’s Historical Library in 2002. It was the militant wing of the Russian Image (Russkii obraz) organization.\nIt is alleged that Goryachev maintained connections with high-ranking Kremlin personnel in Russia’s presidential administration who knowingly turned a blind eye to the group's illicit actions. This theory goes on to insinuate that the Russian government officials were attracted to Goryachev and BORN's extreme patriotic support for the nation and some of the overlapping ideals that the Russian government shared with them - such as Anti-LGBT rhetoric. Goryachev would later appear in public wearing a shirt which celebrated Russia's 2014 annexation of Crimea.\nCrimes\nUnder the direction of Goryachev, several murders were committed by members of BORN. Such homicides had been carried out with the intent to spread  far-right ideals as well as propagate fear amongst their political adversaries. Not all of BORN's followers approved of such killings, however - as some of its members claimed they merely wanted the group to simply be a political organization rather than an extremist paramilitary gang of combatants. The actions of the group involved numerous murders and attempted murders, leading to the deaths of at least ten people.\nOn the early morning of October 10th, 2008, 27-year-old Antifa leader and anti-racist Trojan skinhead Fyodor \"Nok\" Filatov was approached by four to eight BORN members armed with knives who cornered the unsuspecting Filatov as he was departing from his apartment building on his way to work. He would end up dying later that day in a Moscow-area hospital via the lethal stab wounds he sustained from the attack. Two days after Fyodor Filatov's murder, the group promptly boasted about killing him on neo-Nazi internet forums.\nA human rights lawyer and a journalist, Stanislav Markelov and Anastasia Baburova, were gunned down by BORN member Nikita Tikhonov in broad daylight on 19 January 2009. This crime drew international attention.\nAlexei Korshunov, a member of the group, was suspected of killing Ivan Khutorskoy, and fled to Zaporizhzhia, Ukraine. Khutorskoy, the leader of a local Antifa faction, was shot twice in his head inside his apartment building. Korshunov later died in September 2011, having blown himself up with a grenade he was carrying.\nOn 16 November 2009 an outspoken anti-fascist activist, Ilya Dzhaparidze was killed after being ambushed by BORN militants who were equipped with knives and air pistols. In addition to his antifascist stance, Dzhaparidze was also thought to be targeted by the group because of his ethnicity.\nOn 12 April 2010, federal city court judge  of the Moscow City Court, who handed down a verdict in the case of the murders of Markelov and Baburova, was murdered by BORN member Alexei Korshunov, who fired gunshots into his chest and head. Chuvashov was selected by the group on account that he had issued numerous guilty verdicts on dozens of high-profile criminal cases involving hate crimes. Prior to his demise, many Russian far-right political figures and like-minded ultranationalist organizations similar to BORN had called for Eduard Chuvashov to be killed.\nInvestigation and legal proceedings\nRyno and Skachevsky were sentenced on 7 April 2010. As they were both under the age of majority, neither could be sentenced to more than ten years in prison. After the arrests of Khasis and Tikhonov in November 2009, the group ceased its activities, and disbanded entirely in 2010.\nIn 2011, Tikhonov, one of the organization's leaders and founders, was sentenced to life imprisonment for the murders of Markelov and Baburova, and his roommate Yevgenia Khasis received 18 years in a penal colony. The court ordered a review of the case in 2021. In April 2015, Maxim Baklagin and Vyacheslav Isayev were sentenced to life imprisonment, and Mikhail Volkov was sentenced to 24 years in prison. In July 2015 Goryachev was sentenced to life imprisonment for organizing a gang, five murders, and arms trafficking. During the trials, the defendants repeatedly claimed that BORN did not exist.\nThe members of BORN were charged with racketeering, illicit arms trafficking and several counts of mission-oriented killings, in addition to attempted murder of law enforcement personnel. The Supreme Court of Russia sentenced Goryachev to life imprisonment on 24 July 2015 after he was found guilty for ordering five killings, creating and running an extremist cell, and illegal possession of firearms.\nReferences"
    }
  ]
}