{
  "content": [
    {
      "type": "text",
      "text": "# Battle Angel (OVA)\n\n| first           = June 21, 1993\n| last            = August 21, 1993\n| runtime         = 30 minutes\n| episodes        = 2\n| episode_list    =\n}}\nBattle Angel, known in Japan as , is a 1993 original video animation (OVA) based on the Battle Angel Alita manga series by Yukito Kishiro.  It is directed by Hiroshi Fukutomi, and jointly produced by KSS Inc., Movic, Animate and Madhouse.  The OVA comprises two episodes, Rusty Angel and Tears Sign, corresponding respectively to volumes 1 and 2 of the manga with some differences, serving as a compressed preview for the manga.\nAccording to Kishiro, only two episodes were originally planned since at the time he was too busy with the manga \"to review the plan \" and he was not serious about an anime adaptation.  He has no plans to revive the anime.\nPlot\nRusty Angel\nAs he scavenges the Zalem dump heap for useful parts, cyberphysician Daisuke Ido comes across the remains of a female cyborg, who is still alive. Ido takes her home and decides to restore her, transferring her into a new cyborg body.\nShortly after, the cyborg, now called Gally, becomes interested in Yugo, a local boy who is performing maintenance work for Ido. After Ido returns home late that night, the following day Gally notices his injured arm, which he explains away as the result of a fall. After introducing herself to Yugo, he convinces her to go with him and the two leave just as Chiren arrives.\nYugo and Gally try to climb onto the roof of an abandoned factory, but they both fall. Instinctively, Gally manages to catch Yugo and land safely. On the roof, they contemplate Zalem as Yugo discusses his interest in the floating city. Gally makes her interest in him known, but Yugo's obsession with Zalem blinds him to this.\nIdo and Chiren go out for a drink. Chiren is obsessed with returning to Zalem, and views being in Scrap Iron City and Ido's acceptance of his lot in life as a waste. He warns her not to get involved with The Factory, and says he has no regrets about what happened in Zalem.\nThat night, Gally is awakened by Ido going out. Curious, she decides to follow. Elsewhere in Scrap Iron City, a lone woman on her way home runs into the criminals Rasha and Grewcica. Before they can do anything to her, Ido appears and attacks Rasha with his rocket hammer, slicing off his left arm, but getting stabbed in the shoulder. Gally then arrives, killing Rasha by punching his head off. Grewcica, enraged at Rasha's death, manages to deflect one of Ido's attacks. He then fights Gally, who slices off his right arm with a kick before knocking him into the sewers. Surprised at Gally's abilities, Ido also notices her bloodlust and regret at not being able to finish Grewcica off.\nIdo takes Rasha's head to The Factory to collect the bounty, explaining the nature of his work as a hunter-warrior. Gally, realizing that something has awakened within her, decides to become one as well, but Ido will have none of it, so she runs off.\nAfter sealing their deal with sex, Vector tells Chiren that her part of the bargain involves upgrading the coliseum gladiators. Soon after, a damaged Grewcica arrives at Chiren's apartment, begging for help. His mention of Ido and Gally catches Chiren's attention.\nThe next day, Ido realizes that Gally's life is hers to lead, but wonders if her desire to follow him as a hunter/warrior is a result of some residual memory. Gally returns to The Factory and registers herself as a hunter-warrior, but when she asks about Zalem, the only answer she gets is \"no comment\". In the meantime, Chiren starts to rebuild and upgrade Grewcica to defeat Gally. Gally returns to Ido's, where he accepts her decision to become a hunter-warrior. That night, they head out to Bar Kansas, while elsewhere in Scrap Iron City, Yugo robs a cyborg of his spinal column.\nJust as they arrive at Bar Kansas, Gally and Ido are confronted by a newly rebuilt and upgraded Grewcica, who uses a cutter installed in one of his fingertips to shred to pieces a stray dog that Gally picked up. Without help from the other hunter-warriors, Gally accepts Grewcica's challenge. Chiren then appears, wondering which of the two cyborgs will prevail.\nThe scene shifts to the Zalem dump heap, where Gally and Grewcica's fight is watched by Ido, Chiren, and an unnamed hunter-warrior (Gime). Grewcica has an initial advantage, but Gally is able to dodge his subsequent attacks. Using her superior speed and ability to generate plasma, she first disables one, then both of Grewcica's arms before slicing him in two, killing him. Chiren hysterically acknowledges her loss, but vows vengeance. As they leave the dump heap, Gally assures Ido that she will still remain Gally no matter how much she changes.\nTears Sign\nAs Yugo and Tanji prepare to leave an alley with their cyborg victim's spinal column, Vector appears and kills the cyborg to eliminate him as a witness, then admonishes Yugo for his carelessness.\nAt Yugo's place, Gally waits for Yugo with his neighbors, who are skeptical of his plan to get to Zalem. After turning down Vector's offer of a role in his business operations, which include control of the resources sent to Zalem via The Factory tubes, Yugo - intoxicated - is dropped off by Vector, who notices Gally. In his apartment, Yugo discusses his dream of Zalem with Gally. To help him out, she embarks on a bounty spree, earning bags of credit chips.\nLater, a customer who has taken Yugo up on his offer for a lube job reveals himself as a hunter-warrior in disguise (Zapan) who realizes that Yugo is about to paralyze him from behind. Tanji attacks Zapan, who deflects his attack and kills him. Yugo throws a fire bottle on Zapan, engulfing him in flames and enabling him to flee, but Zapan knows that there will soon be a bounty on Yugo.\nVector, who is with Chiren at his office, gets a call from Yugo apprising him of the situation and tells Yugo to bring his chips to his office. After the call, a news broadcast reveals that Zahriki, the reigning coliseum champion after Grewcica's disappearance, has lost again. Vector tells Chiren that it will be time to rebuild Zahriki, but Chiren complains that this is moot as all her efforts seem to be fruitless. Vector then notices a newspaper piece on Gally, recognizing her. Chiren also recognizes her, and is surprised at Vector's scheme to have Gally fight in the coliseum for him by using Yugo as leverage. He gives Chiren the task of tracking Gally down with the promise of sending her to Zalem if she succeeds.\nOutside The Factory, Ido is surprised at Gally having collected fourteen bounties in seven days, as she did not become a hunter-warrior for the money. As they discuss how Yugo and Gally feel about each other on the way home, they discover from a bounty update broadcast that Yugo is now a bounty. Gime is shown receiving the news as well. Gally sets off to look for Yugo, not finding him at his place. Chiren, who has been on stakeout, follows her.\nAt the same abandoned factory he visited with Gally in Rusty Angel, Yugo finds that he is 500,000 short of the 10 million chips he needs to buy passage to Zalem from Vector. Gally finds him here, after which they discuss what Yugo will do next. He refuses to relinquish his dream of reaching Zalem. Gally confesses her love for him, but Yugo brushes it off. Desperate to know how he feels about her, Gally confronts him. Yugo admits that they are now partners in crime, and Gally kisses him.\nAfterwards, Gally asks Yugo about the scar on his right wrist. As Chiren eavesdrops on their conversation, Yugo reveals his personal history about how the hand is a keepsake of his older brother, an engineer of The Factory who planned to fly to Zalem by constructing an airship. His wife however, betrayed him to The Factory and he was killed by a hunter-warrior (Gime) on the night the airship was finished. Gally reveals that she empathizes with Yugo's sister in-law, and offers to help Yugo get to Zalem. The discussion changes something within Chiren.\nAfter the storm abates, Yugo heads outside. Hearing him suddenly scream, Gally rushes out to find Gime standing over Yugo, whose right arm has been cut off. She attacks Gime, who blocks her attack and claims his right to the bounty on Yugo. He also reveals his jealousy at Gally's having beaten him to all the bounties since Grewcica. Realizing that the relationship between her and Yugo has more meaning, Gime fights her with a double-edged sword. He gets Gally in position to deliver a killing blow, but she blocks his blade with her hands while charging it with electricity. A bolt of lightning that is attracted to the electric charge hits Gime, incinerating him. As Gally holds a dying Yugo and wonders how she can save him, Chiren appears.\nGally then goes to Ido's with Yugo's body and head and begs him to save Yugo. After successfully transplanting Yugo's head onto a cyborg body, Ido reveals that bypassing her life support system and connecting it to Yugo's head kept his brain alive. Gally reveals that Chiren did this, which surprises Ido.\nBack at Vector's, Chiren tells him Yugo was killed by a hunter-warrior and that she cannot find Gally. As she is about to leave, Vector tells her that he will now send her to Zalem.\nAs Yugo lies on the operating table, he overhears Ido tell Gally that the idea of buying passage to Zalem is a lie and no one knows this better than he does, being a former citizen of Zalem. Yugo wakes up screaming in denial and escapes from the clinic. Gally races off in pursuit, while Ido sees the bag of Yugo's chips and becomes enraged.\nGoing to Vector's office, Ido confronts Vector about lying to Yugo. He also discovers what is left of Chiren: organs and body parts in preservation tubes. Vector reveals that this is to fulfill a monthly quota that comes down from Zalem, and presses a button that reveals Zahriki from behind a screen. Zahriki attacks Ido, who dodges the attack and slices Zahriki in half with his rocket hammer, which flies into and kills Vector.\nHigh above the city, Yugo has started to walk on a Factory tube towards Zalem. Soon, a massive spiked ring comes hurtling down the tube, forcing him to jump to avoid it, but his feet are destroyed in the process. Gally reaches the base of the tube and prepares to follow Yugo, who has survived the first ring to come down, but has lost his feet.\nAfter emerging past the clouds, Yugo can clearly see Zalem. Gally, who has caught up with him, pleads with him to return. Yugo is still adamant about reaching Zalem, but Gally convinces him that they can find a way to live in Scrap Iron City together. Another ring comes hurtling down the tube and Gally's warning comes too late as Yugo is shredded by the ring and thrown into the air. Leaping after him, Gally manages to grab his remaining arm and use her knife to secure herself to the tube. His elbow joints cannot hold however and break loose, but not before Yugo is able to say goodbye, leaving Gally on the tube clutching his forearm.\nAt sunset, Ido and Gally are in the Zalem dump heap. They place Yugo's forearm and Chiren's earring into a basket attached to a balloon, and release it in the direction of Zalem.\nDifferences between the OVA and manga\nNames used\nIn its translation, ADV Films used the Japanese names for Tiphares and the Scrapyard as well as several characters. These names differ from the names used by Viz Media in its translation of the manga. There are also slight differences in other character names used. The equivalent anime and manga names are outlined below. Discussion of the anime characters will utilize the names used by ADV, while discussion of the manga equivalents will utilize the names used by Viz.\nThe Manga Entertainment translation, released only in the United Kingdom, Europe, and Australia on VHS, used some of the names from the Viz translation and went by the title of Battle Angel Alita. There is no information about a Region 2 Battle Angel Alita DVD.\n{| class=\"wikitable\" align=\"left\"\n|-\n! ADV translation\n! Viz translation\n|-\n| Gally\n| Alita\n|-\n| Yugo\n| Hugo\n|-\n| Zahriki\n| Zaariki\n|-\n| Rasha\n| Izuchi\n|-\n| Gonz\n| Gonzu\n|-\n| Gime (in credits)\n| Clive Lee\n|-\n| Zavan (in credits)\n| Zapan\n|-\n| Scrap Iron City\n| The Scrapyard\n|-\n| Tiphares\n| Zalem\n|-\n|}\nCharacter differences\n* The cyborg body that Gally is transferred into is the Berserker Body from the manga. It is implied that Ido created this body. In the manga, this was the second cyborg body Alita received after her first civilian body was destroyed in her first fight with Makaku. Ido had previously found the Berserker Body in a crashed spaceship and kept it in storage.\n* A key difference is that Panzer Kunst is never mentioned in the OVA as Gally's fighting style. In the manga, Ido recognizes it immediately after she dispatches the mutant woman who nearly kills him.\n* Gonz's role in the OVA is reduced, as he is portrayed as a friend of Ido's in Scrap Iron City. Ido transplants Gally onto the Berserker Body and also transplants Yugo's head onto a cyborg body by himself. In the manga, Gonzu transferred Alita into the Berserker Body under Ido's supervision because of the injuries Ido had sustained in fighting Makaku, and also helped Ido with the transplant for Hugo.\n* Chiren only appears in the OVA. In the manga, Ido is not shown to have a love interest or woman whom he used to be involved with in Tiphares who is now in the Scrapyard. He does get involved with a woman named Carol five years before the start of the main story in Battle Angel Alita: Holy Night & Other Stories.\n* Grewcica is an amalgamation of the Makaku and Kinuba characters from the manga, being the former coliseum champion who has become a bounty due to his brain-eating habit. The cutters have been switched to being placed on his right hand, whereas they were on Kinuba's left.\n* Although he is not named, Clive Lee is given a larger role in the OVA than he is in the manga. He makes more incidental appearances and is portrayed as a professional rival of Gally's, who has been so good a hunter-warrior that she beat him to all the bounties since Grewcica. This rivalry is so strong that Lee has no compunctions about killing Alita over it. He is shown to have acted alone when he killed Yugo's brother, wields an extendable double-bladed sword, and his appearance is different. In the manga, Lee only appears twice: to kill Hugo for the bounty, and in Hugo's flashback of how his brother was killed, when he had a team help him with the body. He also uses a technique called the \"White Hot Palm\", which can make his forearms hot enough to cut through human limbs and melt cyborg limbs. There is no rivalry between him and Alita, and he primarily fights her over the bounty for Hugo, not for personal reasons. It is later revealed that Lee was a famous hunter-warrior. No one knows who killed him however, as the fight between him and Alita had no witnesses and occurred while Hugo was unconscious.\n* Zapan's role is reduced in the OVA because of the changes made to the storyline, and he is not named, only playing a role in exposing Yugo as a spinal column thief. In the manga, he also tries to stop Alita from fleeing with Hugo and later becomes a major adversary.\n* Zahriki (Zaariki) makes more appearances in the OVA than he does in the manga, being shown on TV in addition to his appearance as hired muscle working for Vector. His OVA appearance is also drastically different from his manga appearance. In the manga, he is only shown fighting the then-reigning champion Kinuba and later as Vector's muscle when Hugo and Alita confront him in his office.\n* Vector's operations encompass control of the exports which are sent to Zalem via the Factory tubes. He also comes up with the moniker \"Battle Angel\" for Gally as a coliseum gladiator working for him. In the manga, Vector offered Hugo control of one of six intermediate Factory supply routes that he got control of due to Factory reorganization. He does not have a vested interest in the coliseum gladiators and never showed the same kind of interest in Alita that he does in the OVA. Thus, he never coined the \"Battle Angel\" term.\nPlot differences\nRusty Angel\n* Gally encounters Yugo much earlier in the storyline and under different circumstances. In the OVA, she met him on the rooftop of Ido's clinic soon after Ido gave her a new cyborg body. In the manga, they first meet at an abandoned factory after Alita fought and defeated Makaku, when she was after the bounty Megil the Pharmacist.\n* Ido has several bounty reports taped to a wall of his clinic that can be seen when Gally and Yugo go out. One of them is for Grewcica, and Ido appears to have targeted both him and Rasha in the OVA. In the manga, it appears that Ido and Alita teamed up to go after Izuchi and Makaku in his first cyborg body, as Ido went after Izuchi while Alita confronted Makaku.\n* When Ido confronts Rasha and Grewcica, they are together. Rasha is able to wound Ido, and Grewcica witnesses his death at Gally's hands. In the manga, Ido is able to ambush and kill Izuchi without taking any injuries. Izuchi was also not right next to Makaku when he was killed, although they were in close proximity to each other.\n* Rasha is the first person killed by Gally. Ido takes his head to Factory 33 to collect the bounty and is assisted by Deckman 10. In the manga, a mutant woman was the first person killed by Alita. Ido takes her head to Factory 33, where Deckman 12 assists him.\n* When Gally registers as a hunter-warrior, she is shown being given her hunter-warrior barcode by Deckman 10. In the manga, when Alita went to Factory 33 to register, she was accosted by several deckmen before being directed to Deckman 10.\n* Gally smears the dog's blood under eyes as an indication that she will fight Grewcica. In the manga, the first time that Alita does something like this is when she smears blood from Makakus eye from where Duke Fang pulled out her arm embedded in their last confrontation (she calls it the \"tan\") below her eyes during a lull when fighting Makaku a second time, indicating that she has gotten serious about the fight.\nTears Sign\n* Tanji is Yugo's only accomplice in his spinal column thefts. In the manga, another teenager named Van also assisted him.\n* Gally receives the news of Yugo becoming a bounty from a bounty terminal she passes. In the manga, Zapan breaks the news when he encounters Alita and Ido at a factory he visits to collect the bounties on Van and Tanji.\n* The abandoned factory where Yugo had his stash of chips is the same factory he took Gally to in Rusty Angel, from which he claims the best view of Zalem can be seen. In the manga, this factory was where Alita tracked Megil the Pharmacist down to and fought him. It is where Hugo and Alita meet for the first time, and Hugo also takes Alita to the roof to get a good view of Tiphares. It also happens to be the same factory that Hugo's brother used to secretly construct his airship, and where Hugo stashes his chips.\n* When Yugo turned 10, Clive Lee killed his brother on the day the airship he constructed to fly to Zalem was finished. In the manga, the airship was also completed when Hugo turned 10, but Lee appeared on the night that his brother planned to leave.\n* Yugo's sister in-law is not named. In the manga, her name is Nana.\n* Gally runs out of the abandoned factory and attacks Lee with her knife, which he blocks. In the manga, she jumped through a factory wall and hit him with a kick.\n* The fight between Gally and Clive Lee is slightly longer than it is in the manga, as Lee's weapon is different.\n* Chiren performed the bypass of Gally's life support system which kept Yugo alive, after which she heads straight to Ido's. In the manga, Alita did this bypass herself. On her way to Ido's she is stopped by Zapan, who has gathered hunter-warriors and a netman because she is suspected of rebellion. Zapan is also the first to discover the bypass procedure, not Ido.\n* In the manga, Alita smears some of Hugo's blood (presumably) under her eyes after she defeats Lee. In the OVA, she does not do this.\n* Vector is told by Chiren that Yugo was killed by a hunter-warrior then struck by lightning. In the manga, he reads about Hugo's death in a newspaper.\n* When Yugo finds out the truth about the impossibility of buying passage to Zalem, he escapes from Ido's clinic on his own. In the manga, he angrily confronts Ido about this.\n* Ido confronts Vector about lying to Yugo and physically assaults him. In the manga, Hugo and Alita confront Vector in his office, but Vector comes off from the encounter uninjured.\n* Ido kills Zahriki. In the manga, Alita defeats him.\n* Vector seems to have been killed by Ido in the OVA, but in the manga he survives the confrontation with Alita and Hugo, continuing to play a role in the manga as well as in Battle Angel Alita: Last Order.\n* Gally realizes that Yugo is climbing a Factory tube when she sees them against the sky. In the manga, she was alerted to this when some of Hugo's high value chips fall from the sky on a crowd of Scrapyard residents who then fight over the chips.\n* The events from when Gally meets Yugo at the abandoned factory to his climbing the Factory tube take place on the same day, making the weather overcast when Gally goes after him on the tube. In the manga, the time frame between these two events is two days, and it is raining when Alita goes after Hugo on the tube.\n* The final scene in which Ido and Gally release a balloon carrying a basket aloft in the direction of Zalem containing Yugo's arm and Chiren's earring is unique to the OVA. The manga does not state what Alita did with Hugo's forearm.\nSoundtracks\nGunnm: Image Album\nGunnm: Image Album is primarily an image album with songs inspired by the OVA. The exceptions are \"Cyborg Mermaid\", the ending theme song, and two instrumentals. The album included a sticker and short filmstrip from the OVA.\n{| class=\"wikitable\" style=\"width:65%;\"\n|-\n! !! Track name !! Type !! Length\n|-\n|1. || \"Rusty Angel\" || Vocal || 4:19\n|-\n|2. || \"Absolute Miracle\" || Vocal || 3:36\n|-\n|3. || \"Gunnm I\" || Instrumental || 3:14\n|-\n|4. || \"Aim\" || Vocal || 4:55\n|-\n|5. || \"Cyborg Mermaid\" || Vocal || 5:13\n|-\n|6. || \"Dear Sweet Heart\" || Vocal || 4:34\n|-\n|7. || \"Keep My Dream\" || Vocal || 4:25\n|-\n|8. || \"Gunnm II\" || Instrumental || 3:59\n|-\n|9. || \"The One I Love\" || Vocal || 5:32\n|-\n|10. || \"Believe in the Fate\" || Vocal || 4:23\n|-\n|}\nGunnm: Another Story\nGunnm: Another Story is primarily a soundtrack with the exception of \"Cyborg Mermaid\", the ending theme song, an image track, and two drama tracks.\n{| class=\"wikitable\" style=\"width:65%;\"\n|-\n! !! Track name !! Type !! Length\n|-\n|1. || \"Satsuriku no Enjeru (Angel of Massacre) Part I\" || Drama || 8:39\n|-\n|2. || \"Believe in the Fate\" || Vocal || 4:24\n|-\n|3. || \"Satsuriku no Enjeru (Angel of Massacre) Part II\" || Drama || 13:18\n|-\n|4. || \"Cyborg Mermaid\" || Vocal || 5:12\n|-\n|5. || \"Ido's Theme\" || BGM || 1:41\n|-\n|6. || \"Infinity\" || BGM || 1:54\n|-\n|7. || \"Joh's Bar\" || BGM || 1:36\n|-\n|8. || \"Gally's Theme\" || BGM || 1:31\n|-\n|9. || \"Scrap Iron\" || BGM || 1:14\n|-\n|10. || \"Action\" || Choral || 2:05\n|-\n|}\nReferences\nCitations\nSources\n*\n*\n*\n*\n*\n*\nExternal links\n*\n*"
    }
  ]
}