{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Glen Shiel__disambig_1\n\n| map_type            = Scotland\n| map_relief          = Yes\n| latitude            =\n| longitude           =\n| map_size            =\n| map_marksize        =\n| map_caption         =\n| map_label           =\n| territory           =\n| result              = Government victory\n| status              =\n| combatant1          =  British government\n| combatant2          =  Jacobites   Spain\n| commander1          = Joseph Wightman\n| commander2          = William Murray  James Keith  Cameron of Lochiel  Nicolás Bolaño\n| units1              =\n| units2              =\n| strength1           =  1,100\n| strength2           = 1,440\n| casualties1         = 141 killed and wounded\n| casualties2         =  100 killed and wounded\n| notes               =\n}}\n| campaignbox         =\n}}\nThe Battle of Glen Shiel}} took place on 10 June 1719 in the Scottish Highlands, during the Jacobite rising of 1719. A Jacobite army composed of Highland levies and Spanish marines was defeated by British government troops.\nThe Rising was backed by Spain, then engaged in the 1718–1720 War of the Quadruple Alliance with Britain. Originally intended to support a landing in south-west England, which was cancelled several weeks earlier, its failure was seen as having fatally damaged the Jacobite cause.\nThe battlefield is now included in the Inventory of Historic Battlefields in Scotland, and protected by Historic Scotland.\nBackground\nWhen the War of the Spanish Succession ended in 1713, Spain lost its Italian possessions of Sicily and Sardinia, and their recovery was a priority for Giulio Alberoni, the Chief Minister. Sardinia was reoccupied in 1717 but when they landed on Sicily in July 1718, the Royal Navy destroyed the Spanish fleet at the Battle of Cape Passaro, beginning the War of the Quadruple Alliance.\nTo divert British resources from the Mediterranean, Alberoni devised a plan for 7,000 Spanish troops to land in south-west England, march on London and restore James Stuart. Historians question how serious he was; since Alberoni was one of the few contemporary statesmen with experience of amphibious operations, he was well aware of how unlikely this was. Cape Passaro demonstrated the Royal Navy's power in far less favourable circumstances, which meant the Spanish fleet was unlikely to even reach England, let alone be allowed to disembark large numbers of troops. When the Spanish fleet finally left Cádiz in March, it was battered by a ferocious storm, and took refuge in Coruña, where it remained.\nThe plan included a simultaneous rising in Scotland, whose purpose was to capture the port of Inverness, and allow a Swedish expeditionary force to disembark. Driven by Charles XII of Sweden's dispute with Hanover, it shows the complexity caused by its ruler George I also being British monarch. Charles died in November 1718, ending any hope of Swedish support, and thus the entire purpose of the Scottish uprising.\n, Jacobite commander at Glen Shiel]]\nIn the end, only two frigates carrying George Keith and 300 Spanish soldiers reached Stornoway in the Isle of Lewis. Here they were joined by exiles from France, including the Earl of Seaforth, James Keith, the Marquess of Tullibardine, Lord George Murray and Cameron of Lochiel. On 13 April, they learned of the failure elsewhere; Tullibardine, who was commander of Jacobite land forces, recommended retreat, but Keith prevented this by ordering the two frigates back to Spain.\nWith no other option, the main force of some 1,000 Highlanders plus the Spanish troops prepared to march on Inverness, leaving their excess stores at Eilean Donan guarded by 40 Spaniards. On 10 May, a British naval squadron captured the castle, blocking any escape by sea, while Joseph Wightman's force of around 1,000 men with four Coehorn mortars advanced towards Glen Shiel. On 9 June, they reached Loch Cluanie, less than 8 miles (13&nbsp;km) from the Jacobite camp. Jacobite\n* 300 men of the Regiment Galicia from Spain, under its Colonel, Don Nicolás de Castro Bolaño, along with Brigadier Mackintosh of Borlum.\n* 150 men of the Clan Cameron, under their chief Cameron of Lochiel.\n* 150 men of Lidcoat's and 20 volunteers.\n* 40 men of Clan MacGregor, under Rob Roy MacGregor.\n* 50 men of Clan Mackinnon.\n* 200 men of Clan Mackenzie, under their William Mackenzie, 5th Earl of Seaforth, on the extreme left, up on the side of Scour Ouran, along with a rebel Brigadier Campbell.\n* 200 men of Clan Mackenzie, under Sir John Mackenzie of Coul.\n* 150 men of Clan Murray, under William Murray, Marquess of Tullibardine and his younger brother, Lord George Murray, positioned on the hill on the south bank of the river.\n* Men of the Clan Keith, under their chief, George Keith, 10th Earl Marischal.\nGovernment Order of Battle; right wing under Colonel Clayton:\n* 150 grenadiers under Major Milburn; Montagu's Regiment, Lieutenant Colonel Lawrence.\n* 50 men under Colonel Harrison.\n* Huffel's Dutch Regiment.\n* Three Independent Highland Companies from the Clan Fraser of Lovat, Clan Ross and Clan Sutherland\n* 80 men of the Clan Mackay, under their chief Ensign Mackay, Lord Strathnaver, on the flank.\nLeft wing, south side of the river, consisted of:\n* Clayton's Regiment, commanded by Lieutenant Colonel Reading.\n* 100 men of the Independent Highland Company from the Clan Munro, under George Munro, 1st of Culcairn.\n* The Government dragoons and the four mortars remained on the road}}\nBattle\nJohn Henry Bastide, a subaltern in Montague's regiment who had a long career as a military engineer drew a detailed plan of the battlefield and the movements of the opposing forces soon after the battle. The section detailing the battle itself is missing but it is possible to reconstruct the main elements.\nTullibardine prepared a strong position near the Five Sisters hills, with the Spanish in the centre and the Highlanders on the flanks behind a series of trenches and barricades. Wightman's force arrived about 4:00 pm on 10 June and began the attack an hour later by firing their mortars at the Jacobite flanking positions. This caused few casualties but the Scots had not encountered mortars before, allowing four platoons of Clayton's and Munro's to advance up the hill to their lines, then use grenades to bomb them out of their positions.\nOnce the Jacobite right had been dislodged, Harrison and Montague attacked the Jacobite left under Lord Seaforth. This was strongly entrenched behind a group of rocks on the hillside but skilful use of the mortars forced Seaforth's men to give way while he himself was badly wounded. Commanded by Colonel Nicolas de Castro Bolaño, the Spanish in the centre stood their ground, but had to withdraw up the mountain as their flanks gave way.\nThe battle lasted until 9:00 pm; several accounts claim the heather caught fire and smoke combined with failing light enabled the bulk of the Scots to disappear into the night. The Spanish surrendered the next morning, meanwhile Lord George Murray, Seaforth and Tullibardine were wounded but the Jacobite leaders also managed to escape. An analysis by historian Peter Simpson attributes Wightman's victory to skilful use of mortars, the superior firepower of his grenadiers and the aggression shown by his infantry.\nAftermath\nmortars used by Wightman's troops, a weapon the Highlanders had not previously encountered]]\nJacobite casualties were hard to estimate since few bodies were left on the field and most of the wounded escaped, among them Seaforth and Lord George Murray, while Wightman lost 21 killed and 120 wounded. Lord Carpenter, commander in Scotland, advised London pursuing the rebels was impractical, and it was best to let them go, arguing the Rising had only damaged the Jacobite cause. Tullibardine concurred; in his letter of 16 June 1719 to the Earl of Mar, he provides a description of the battle, and states \"it bid fair to ruin the King's Interest and faithful subjects in these parts\".\nThe captured Spanish regulars were sent to Edinburgh Castle where they were held for four months, before returning to Spain. In October 1719, a British naval expedition captured the Spanish port of Vigo, held it for ten days, destroyed vast quantities of stores and equipment, then re-embarked unopposed, with huge quantities of loot. This demonstration of naval power led to Alberoni's dismissal, and ended Spanish support for the Jacobites.\nSenior Jacobites like Bolingbroke, Seaforth and Lord George Murray were allowed home, while others took service elsewhere. James Keith became a Prussian general, and was killed at Hochkirch in 1758. George Keith joined the Prussian diplomatic corps; he refused to join the 1745 Rising, and was ambassador to Spain from 1759 to 1761. Although pardoned in 1763, he died in Potsdam in 1778.\nTullibardine remained in exile, took part in the 1745 Rising, and died in the Tower of London in July 1746. Lord George served as one of Prince Charles' senior commanders, and died in the Dutch Republic in October 1760.\nConservation of battlefield\nThe mountain where the action was fought is called Sgurr na Ciste Duibhe; a subsidiary peak named Sgurr nan Spainteach, or 'Peak of the Spaniards', commemorates the Spanish marines.\nNow owned by the National Trust for Scotland, the stone breastworks built on the northern slope are a rare example of surviving fieldworks in Britain, and designated a scheduled monument.\nIn advance of the 300th anniversary of the battle, the National Trust for Scotland was involved in an archaeological survey of the site. Finds included ammunition from the mortars which were deployed against the Jacobite forces.\nFootnotes\nReferences\nSources\n*\n*\n*\n*\n*\n*\n*\n*\n*\n* Jonathan Oates, \"Dutch Forces in Eighteenth-Century Britain: A Perspective\", Journal of the Society for Army Historical Research, Vol. 85, No. 341 (Spring 2007), pp.&nbsp;20–39\nBibliography\n*\nExternal links\n* Digitised copy of the [http://maps.nls.uk/military/record.cfm?id=262 \"A Plan of the Field of Battle that was fought on ye 10th of June 1719, at the Pass of Glenshiels in Kintail North Britain\"] drawn by John Henri Bastide in 1719 from National Library of Scotland\n* [https://web.archive.org/web/20070930181746/http://www.historynet.com/magazines/military_history/3823161.html Battle of Glen Shiel@Historynet.com]"
    }
  ]
}