{
  "content": [
    {
      "type": "text",
      "text": "# Battle Grand Prix\n\n|designer      = Motoyuki Inoue\n|programmer    = Shinobu Yagawa\n|artist        = Kazuhiro Iizuka\n|composer      = Yusuke Takahama (uncredited)\n|platforms     = Super Nintendo Entertainment System\n|released      = }}\n|genre         = Racing\n|modes         = Single-player, multiplayer\n}}\nis a 1992 Formula One racing video game developed by KID. One or two players can pit themselves in three Grand Prix races. Each of the different team cars have different color schemes. The courses vary from blacktop to concrete, and rain is also included and is implemented in the game.\nGameplay\nBattle Grand Prix is a formula one racing game.\nDevelopment and release\nBattle Grand Prix was developed by KID. It was published in Japan by Naxat Soft and in North America by Hudson Soft.\nReception\n|CVG = 52/100\n|EGM = 5.5/10\n|Fam = 19/40\n|NP = 3.075/5\n|JP = 53%\n|JS = 71%\n|VGS = 53%\n|rev1 = Play Time\n|rev1Score = 66%\n|rev2 = Super Pro\n|rev2Score = 63%\n}}\nBattle Grand Prix received mixed reception from critics, most of which reviewed it as an import title. Joysticks Jean-Marc Demoly commended the game's audiovisual presentation and controls. In contrast, Joypads Ho U. felt more mixed when it came to the graphics, sprite animations, controls and sound. The British magazine Super Pro noted that it was difficult getting to grips with but claimed that the title was more enjoyable than F-1 Grand Prix due to its two-player mode and realism. Nintendo Power gave positive remarks to the amount of game modes, car customization and number of tracks but criticized the car sprites for their small size and lack of realistic driving fell, lack of race track map and inability to choose a computer opponent to race against. Likewise, Electronic Gaming Monthlys four reviewers commended its numerous option settings to customize the game, as well as the different types of modes and courses but criticized its gameplay for lacking in the controls department and the overhead split screen perspective for being annoying and blocking incoming obstacles, regarding it to be a simple and average racer.\nReviewing the Japanese release, Computer and Video Games Paul Rand commended its clear and bright visuals but criticized the sound for its engine noise and poor music, irritating gameplay and poorly-implemented control system, ultimately calling the game \"dull\" and \"insipid\". Video Games Jan Barysch found the idea of changing weather during the race to be nice and the distance bar as useful to avoid collision with an opponent, but stated that its graphics were mediocre and gameplay was below-average. Play Times Robert Reischmann noted its split screen perspective, two-player mode and lack of saving options. While giving positive remarks to the visuals, Reischmann felt mixed when it came to the sound and controls, stating that the game's ideas got \"miserably\" lost in a concept. Aktueller Software Markts Michael Suck praised the title for its audiovisual presentation and realism.\nNotes\nReferences\nExternal links\n* [https://gamefaqs.gamespot.com/snes/588211-battle-grand-prix Battle Grand Prix] at GameFAQs\n* [https://www.giantbomb.com/battle-grand-prix/3030-35953/ Battle Grand Prix] at Giant Bomb\n* [https://www.mobygames.com/game/snes/battle-grand-prix Battle Grand Prix] at MobyGames"
    }
  ]
}