{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Dagupan\n\n| combatant1        =  Philippines\n| combatant2        =  Spain\n| commander1        =  Francisco Macabulos Vicente del Prado Juan Quezada Daniel Maramba Eliseo Arzadon\n| commander2        =  Joaquin de Orengochea Federico Ceballos\n| strength1         = 5,000\n| strength2         = 1,500\n| casualties1       = Unknown\n| casualties2       = Entire force\n}}\nThe Battle of Dagupan (, ) was fought on June 2, 1898, between the Philippine rebel forces and Spanish and loyalist forces. It took place in Dagupan in the province of Pangasinan in the Philippines during the Philippine Revolution. Filipino forces won a victory in this battle in which an entire Spanish army, fighting in a last stand, ceased to exist. It resulted to all of Pangasinan being controlled by the Philippine revolutionary government.\nPrelude\nWhile the Tagalog-led rebellion against Spain began in earnest in 1896, it would only be on November 18, 1897 when a full-fledged Katipunan council was formed in the western edges of Pangasinan, with Roman Manalang and Mauro Ortiz presiding as provincial leaders. They were later joined in early 1898 by general Francisco Macabulos of Tarlac, who refused to join the revolutionary leader Emilio Aguinaldo and his staff with their exile to Hong Kong after the Pact of Biak-na-Bato and, whilst there, established a provisional revolutionary government that acts as the proxy to the Philippine revolutionary government-in-exile based in Hong Kong while the ceasefire with the Spanish was kept in place.\nThe Philippine rebellion in Pangasinan never ceased for the most part despite the armistice agreed on by both sides during the Biak-na-Bato Pact. Starting on March 1898, led by Macabulos and accompanied by Don Daniel Maramba of Santa Barbara, the local Pangasinense rebels began overruning towns such as Santa Barbara which the Spanish failed to assault and take back, Malasiqui, Urdaneta and Mapandan. By April, much of Pangasinan including the provincial capital of Lingayen and the port town of Sual are now rebel-controlled, with only Dagupan, Mangaldan, San Jacinto, Pozorrubio, Manaoag and Villasis remaining under Spanish control.\nThe return of Aguinaldo and his staff to the Philippine in May 1898 only further escalated the rebellion in Pangasinan. This time, more Pangasinense locals enthusiastically joined the rebellion and in a revolutionary frenzy attacked all Spanish garrisons in the province. By June, what remained of the Spanish forces in Pangasinan , some 1,500 strong led by general Federico Ceballos and the provincial governor Joaquin de Orengochea, gathered in Dagupan, the primary economic center of the  province and the last town in the province still under their control, along with the image of the Most Holy Rosary of the Virgin of Manaoag which is the patroness of Pangasinan. By mid-July, all Filipino revolutionary forces, led by Maramba, Don Vicente del Prado of San Jacinto, and both Don Juan Quezada and Don Eliseo Arzadon hailing from the town itself, began converging on the town in the hopes of permanently ending the Spanish control in the province.\nBattle\nThe battle was joined in July 18 when the Filipinos attacked Dagupan through an all-out infantry assault but, lacking adequate weaponry, failed due to the Spanish and loyalist Filipino troops firing with their rifles from a long distance in the town's main church. The Filipino rebels switched tactics by bringing with them banana trunks bundled together by sawali to protect themselves from enemy projectiles. Gradually, the Filipinos made headway and, joined by Macabulos who brought his own command of rebels from Tarlac five days later on July 23, eventually forced Ceballos and de Orengochea to request an honorable surrender to Macabulos and his Pangasinense subordinates, which the latter accepted. The last Spanish army in Pangasinan ceased to exist as its remnants were forced into captivity, and the Filipinos fully secured the province under their control.\nSee also\n*Battle of San Jacinto (1899)\nReferences"
    }
  ]
}