{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Sabana de San Pedro\n\nKingdom of Spain\n| combatant2        =\n| commander1        =  Antonio Abad Alfau Juan Suero\n| commander2        =  Gregorio Luperón José Antonio Salcedo Matías Ramón Mella Antonio Caba Florencio Hernandez\n| strength1         = Unknown\n| strength2         = 3,000\n| casualties1       = Unknown\n| casualties2       = Unknown\n| partof            = the Dominican Restoration War\n}}\nThe Battle of Sabana de San Pedro  was a military confrontation of the Dominican Restoration War that occurred on January 23, 1864. The Spanish army under the command of Field Marshal Antonio Abad Alfau would prevent the Dominican Liberation Army commanded by General Gregorio Luperón from penetrating where the defense line that protected the City of Santo Domingo passed and would reconquer the town of San Pedro in the process.\nThe Spanish victory would become for the independentists the most disastrous defeat suffered by the Dominican Liberation Army during the entire course of the war. General José Fco. López, who participated in the battle as a Sergeant of the San Quintín Regiment, would say, being an independentist, that \"for a long time afterwards, he was worried about what the reason for that weakness of the Dominicans would be.\"\nBackground\nDominican General José Fco. López wrote a letter to the writer and historian Miguel Ángel Monclús y Brea about Spanish knowledge prior to combat. He wrote:\nOn January 20, 1864, the president of the Provisional Government insurgent based in Santiago, General José Antonio Salcedo, had granted him the command of second chief of the Dominican Liberation Army along with an amnesty to General Gregorio Luperón who had previously been sentenced to death. However, thanks to the intervention of  Ulises Francisco Espaillat and General Matías Ramón Mella, they would convince General José Salcedo to revoke the sentence.\nIn San Pedro, General Luperón would change the usual direction of the previous battles because he had disobeyed the prohibition of fighting battles in open fields, far from the mountains and forests that could protect the rebels, given in October 1863 by the Minister of War and Navy of the Government of Santiago, Matías Ramón Mella, who stated that the Dominican forces should avoid frontal combats, because the Spanish were generally superior in number, had better weapons and greater discipline.\nBattle\nOn January 23, 1864, in the Sabana de San Pedro near Guanuma, the confrontation between the royal army and the independence insurgents began. They attempted to penetrate through the defense line with which the Spanish protected the city of Santo Domingo had passed. In the heat of battle, Colonel Florencio Hernández would resist the Spanish attacks that tried to seize a cannon that had been placed under his responsibility. General Luperón while he was fighting a hand-to-hand combat was knocked down, wounded by three saber blows, his shirt was completely torn and practically waiting for the final blow would appear a soldier inseparable from his commander from Azua who managed to grab the mule of the insurgent General by the bridle and General Antonio Caba along with other soldiers seeing the desperate situation of their boss who was surrounded by the Spanish cavalry under the command of General Juan Suero urgently came to his aid to save him, among whom were the artillery commander Pedro Faustino Royer, Antonio Estrella and Colonel Florencio Hernández. The situation of General Luperón was so desperate that he shouted to Commander Royer: \"Shoot the cannon at him even if it kills me.\" The cannon would kill several Spanish soldiers, and General Luperón at full gallop riding bareback on his mule passed through the Spanish cavalry who could not believe what they saw and although the independence commander was saved, General Antonio Caba would not have the same luck; while he bravely clung to the bayonets of the hunters of the Queen's Battalion until he could not take it anymore. When the situation of the insurgents was most compromised, Colonel Florencio Hernández, who was already fighting almost hand to hand with the Spanish soldiers, received the order to retreat and in those circumstances Field Marshal Antonio Abad Alfau, his personal enemy, challenged him to a duel and, considering himself challenged in his dignity, he would accept, ultimately dying in combat. The battle would last no more than minutes, the necessary for the Spanish to reach the independence center that disbanded under the astonishment of the Spanish and the two Cibao coastal chiefs, Luperón and Salcedo, left San Pedro hastily, crossed without stopping in Arroyo Bermejo, and the defensible mountain pass of the same name, and took refuge in Sillón de la Viuda, abandoning the attempt to go to the Santo Domingo. After the combat was concluded, Field Marshal Abad Alfau would communicate that \"his soldiers had maneuvered as if in an exercise field.\"\nAftermath\nReport by Matías Ramon Mella\n, Vice President of the Restoration Government.]]\nOn January 26, 1864, General Matías Ramón Mella reiterated the instructions he had given to use guerrilla warfare as a form of combat, and not those of the pitched battles typical of regular armies. In a part of Mella 's report that is addressed to Generals Salcedo, Eusebio Manzueta, Gaspar PoIanco and Aniceto Martínez, he would refer to the events that occurred in the Sabana de San Pedro in an alarming way, stating that:\nLuperón and the guerrilla\nOn the following occasions after that serious failure for the independentists for having taken the decision to fight in open field, General Luperón would obey the decision of General Mella and helped by Marcos Evangelista Adón from his camp in what is currently La Victoria, he undertook a guerrilla war in the area between Monte Plata, Guanuma and Bayaguana, attacking the Spanish convoys that were going to carry ammunition, food and reinforcements to the troops camped there, although he would not obtain with the command of chief any victory against the Spanish.\nSee also\n*Mambises\n*Guerilla warfare\n*Matías Ramón Mella\nReferences"
    }
  ]
}