{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Cape Orlando__disambig_1\n\nThe naval Battle of Cape Orlando took place on 4 July 1299 at St Marco di Val Demone, north-western Sicily, when an Aragonese and Angevin galley fleet commanded by Roger of Lauria defeated a Sicilian galley fleet commanded by Conrad d'Oria. King James II of Aragon and Frederick III of Sicily were present with their fleets at the battle. The larger Aragonese–Angevin fleet was trapped on a lee shore but was able to win the battle with the intervention of its six-galley reserve that attacked the rear of the Sicilian fleet. The Sicilians fled when the flagship, with Frederick aboard, pulled back after the king collapsed from heat and exhaustion. Eighteen Sicilian vessels were captured and their crews massacred. The battle allowed for the invasion of Sicily but James, breaking with his Angevin allies, withdrew his force to Aragon and Frederick was able to defeat the Angevin army on land and secure the independence of Sicily in the Peace of Caltabellotta.\nBackground\nAs part of his attempt to conquer Sicily, James II of Aragon amassed a fleet of 46 Aragon (or Catalan) and 10 Angevin galleys at Naples, together with several cargo ships.  James intended to use his fleet to carry an army to Patti, around 30 miles west of the Sicilian capital of Messina.  However, he learned his enemy, Frederick III of Sicily, had put 40 galleys to sea in an attempt to intercept the invading force. To try to avoid the Sicilian fleet, James altered his plans and instead landed further to the west at Cape Orlando.\nAware that the Sicilian fleet was not far off, James disembarked his stores, horses, and sick at Cape Orlando and transferred infantrymen from his transport ships to his fighting galleys. Frederick delayed his fleet at sea, awaiting the arrival of an additional 8 vessels from Cefalu, some 40 miles away, and in doing so, lost the element of surprise. James gave command of his fleet to his admiral Roger of Lauria.\nBattle\nLauria, caught in a lee shore and unable to put to sea, positioned his fleet close to the shore, with his centre slightly further forward and all ships closely chained together to strengthen his formation.  It is considered probable that Lauria also ordered flying bridges constructed to allow the reinforcement of his crews by soldiers from the shore.  Frederick approached with his flagship in the centre of his line, 20 vessels to his left and 19 to the right, in a closely chained formation.\nInitially, the battle was conducted at a distance with both lines of ships exchanging crossbow fire. However, one of Frederick's captains, eager to close with the enemy, cut his chains and pushed forward. Other Sicilian vessels followed his lead, resulting in both battle lines broken, with all vessels engaging in close-quarters fighting. James' fleet had just captured the first Sicilian ship when a force of six of his vessels, held back in reserve by Lauria, attacked the Sicilian rear.\nAt about this time, King Frederick is said to have collapsed from heat exhaustion, causing his flagship to withdraw to ensure his safety.  This caused the flight of the Sicilian fleet.  Lauria, who had fought for Frederick when Aragon was allied to Sicily, captured 18 Sicilian galleys and ordered the massacre of their crews in revenge for the recent death of his nephew at the hands of Frederick. Some sources state that James ordered that Frederick be allowed to escape unharmed.\nAftermath\nDespite the battle wiping out the Sicilian defense fleet and leaving the island open to invasion, James did not make use of his good fortune. He fell out with his Angevin allies and returned to Spain. The Angevin force was defeated in land battles and by the signing of the Peace of Caltabellotta in 1302, Frederick had guaranteed the independence of Sicily.  The battle secured Lauria's position as commander of the Angevin navy.\nReferences"
    }
  ]
}