{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Stäket__disambig_1\n\n| strength1         = About 1,200\n| strength2         = About 3,000\n| casualties1       = 30 killed71 wounded\n| casualties2       = 428–500 killed and wounded\n}}\nThe Battle of Stäket was a minor battle during the Great Northern War. A probing Russian force, circumventing Vaxholm Castle, attempted to pass through Baggensstäket, a very narrow passage in the Stockholm archipelago. After a counterattack by Södermanlands regemente the Russian force were defeated and departed.\nPrelude\nAfter the death of Charles XII of Sweden at Fredriksten in 1718, the Swedish armies had pulled back from all fronts. Surrounded by hostiles, it was clear that a peace treaty would not be forthcoming without large territorial losses. An attempt was made to play the adversaries against each other, but Russia forced the issue by building and equipping a large Baltic fleet with orders to pillage and harass the eastern Swedish seaboard. On 11 July 1719 the fleet was spotted off the Swedish coast. The Swedish navy was shattered after the long war, but still offered some resistance. The Russian fleet on its side did not commit to a battle, but proceeded burning cities (like Norrköping) and farmsteads.\nAdmiral Fyodor Matveyevich Apraksin had already investigated Baggensstäket, \"the backdoor to Stockholm\" as a way to reach the capital city without passing the fortress at Vaxholm. The Russian's interest was noticed. Under the supervision of the colonel of fortifications Baltzar von Dahlheim boulder-filled boats were towed into the very narrow strait, where they were sunk in the shallowest and narrowest parts to render it impassable. A small redoubt with three cannon and 400 men guarded the channel, while four galleys were anchored in the Lännersta sound beyond.\nProbably in order to apply more pressure on Sweden in the peace negotiations, Apraxin decided to attempt an attack on Stockholm. On 10 August, Russian units were spotted around Gålö, Muskö, and Ornö, about 20 kilometers from Baggenstäket. If they could pass through Baggenstäket it would be possible to reach the capital while completely out of reach of the cannon of Vaxholm.\nBattle\nOn the morning of 13 August, generaladjutant Filip von Tessin returned from a scouting mission to Baggenstäket to report that Russian galleys had been spotted at the entrance to the passage. The closest large Swedish army unit, the 800-man Södermanlands regemente, was alerted and under its commander Rutger Fuchs force marched 19 kilometers to meet the enemy. Lieutenant-colonel Johan von Essen was sent ahead with a force to protect the arrival of the rest of the regiment. After a rapid march through rocky and densely forested terrain under a hot summer sun, von Essen reached Baggenstäket before 7pm without encountering any fire. However the Russians by then had disembarked their forces, on both sides of the channel's eastern entrance. Continuing their rapid march, von Essen's unit suddenly came under fire from the fields around Skogsö gård. Its position was very exposed and the unit took losses; von Essen himself was wounded.\nAt 8 pm, Fuchs' battalion arrived and received news of von Essen's situation. To his right von Essen had a marsh, which forced Fuchs to pass von Essen on his left, a difficult move through snarled and hilly terrain as darkness was falling. The Russians heard Fuchs' approach and opened fire. Fuch's battalion responded and caused losses to the tightly grouped Russians, but was soon also in danger of being outflanked, on its left. Fuchs' started to withdraw into the woods and the Russians did not pursue. After two hours of confused fighting the battle was over, and the Russian soldiers retreated into their landing craft.\nAftermath\nApraksin's probe had been repulsed and the immediate threat to Stockholm had been averted.  Due to unfavorable winds, Apraksin's fleet was forced to remain in Baggensfjärden the next day, but eventually left before the arrival of an English fleet commanded by Admiral John Norris and the Karlskrona squadron.\nRutger Fuchs was acclaimed as a hero and \"saviour of Stockholm\" after the action and was promoted to Major General and made friherre. However, the Russian fleet was untouched and would continue to harass the eastern coast of Sweden the next year until it suffered heavy losses in the battle of Ledsund.\nSee also\n* Hamn (museum)\nReferences\n* Svenska Slagfält, 2003,   (Wahlström & Widstrand).\n* The Action at Stäket, 1719 per Russian Regimental Archive, 2014,  by Boris Megorsky https://www.academia.edu/9864999/The_Action_at_Stäket_1719_per_Russian_Regimental_Archive"
    }
  ]
}