{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Gefrees__disambig_1\n\n| result      = Austrian victory\n| combatant1  =  Austria Black Brunswickers\n| combatant2  =  First French Empire Kingdom of Westphalia Kingdom of Saxony\n| commander1  =  Michael von Kienmayer Frederick William\n| commander2  =  Jean-Andoche Junot Jérôme Bonaparte Johann von Thielmann\n| strength1   = Entire campaign:13,000 Austrians2,000 BrunswickersAt Gefrees:6,000 Austrians\n| strength2   = Entire campaign:15,000 French15,000 Westphalians5,000 SaxonsAt Gefrees:7,500 French\n| casualties1 = Entire campaign:unknownAt Gefrees:100 killed or wounded\n| casualties2 = Entire campaign:unknownAt Gefrees:185 killed or wounded\n}}\n|  zoom = 5\n|   float = right\n|    nolabels = 1\n|     width = 304\n|     height = 160\n| title = War of the Fifth Coalition:Rebellion Brunswick\n| caption = The color black indicates the current battle.\n| shapeD=n-circle\n| shape-colorD=dark blue\n| shape-outlineD=white\n| label-colorD = dark blue\n| label-sizeD = 12\n| label-posD = left\n| label-offset-xD =\n| label-offset-yD =\n| label1 = Gefrees\n| mark-coord1 =\n| mark-title1 = Battle of Gefreeson 8 July 1809\n| label-color1 = black\n| shape-color1= black\n| label2 = Halberstadt\n| mark-coord2 =\n| mark-title2 = Battle of Halberstadtfrom 29 to 30 July 1809\n| label3 = Ölper\n| mark-coord3 =\n| mark-title3 = Battle of Ölper (1809)on 1 August 1809\n}}\nThe Battle of Gefrees was fought on 8 July 1809 during the War of the Fifth Coalition between a joint force of Austrians and Brunswickers under the command of General Kienmayer and a French force under the command of General Junot, Duke of Abrantès. The battle ended in victory for the Austrians who avoided being trapped by Junot and a force of Saxons and Westphalians led by Jérôme Bonaparte, King of Westphalia. After Jérôme's troops were defeated at the Battle of Hof, the Austrians effectively had control over all of Saxony. However the victory was in vain, due to the major Austrian defeat at Wagram and the Armistice of Znaim.\nBackground\nWhen Austria declared war on France and her allies, including Saxony, on 9 April 1809, a small force of Austrians together with a force of Brunswickers under the command of Frederick William, The Black Duke was based in Theresienstadt, Bohemia (now Terezín, Czech Republic) and acted as a defensive force whilst the bulk of the Austrian army was engaged in southern Bavaria and Italy. There was little action in the region until 25 May, when a Saxon force under Colonel von Thielmann invaded Bohemia. In response Duke Frederick William invaded Saxony and took the city of Zittau, forcing von Thielmann to retreat back to Dresden.\nAfter the Battle of Aspern-Essling, Archduke Charles reinforced the Austrian troops in Bohemia to a total strength of over 12,000 men and ordered a diversionary attack into Saxony. These Austrian reinforcements entered Saxony on 10 June and by the third day, an Austrian force of over 6,000 men under Major Am Ende captured the capital, Dresden. Von Thielmann and his Saxons were forced back to Gorbitz, whilst the Saxon Royal Family hurriedly fled west. Meanwhile, another force of 6,000 men under Paul von Radivojevich wheeled south into Bavaria, another French ally, capturing Bayreuth on 14 June. From here, Radivojevich could threaten an invasion of the Kingdom of Württemberg or an attempt to reinforce the Tyrolean uprising.\nOn 22 June, in face of the worsening situation in Saxony and northern Bavaria, Napoleon's brother Jérôme, who was also King of Westphalia, left Kassel with a force of 15,000 men including his Royal Guard Division. On the same day the Austrian forces had occupied Leipzig but were quickly forced to retreat by the arrival of Jérôme's troops. By 26 June, Jérôme had retaken the city and two days later the Westphalians clashed with the Austrians and Brunswickers for the first time.\nIn addition, General Junot had arrived in Frankfurt and took command of the Corps of Observation of the Elbe, an army hastily assembled to guard the Confederation of the Rhine. Deciding to seize the initiative rather than engaging in a defensive campaign, Junot began marching east to confront Radivojevich. Outnumbered, Radivojevich chose to fall back towards am Ende's troops to the north. Meanwhile, Jérôme's forces had retaken Dresden forcing am Ende's to form a new defensive line further south.\nIn an attempt to reclaim their lost momentum, the Austrian and Brunswicker troops were reorganised into the new XI. Corps and placed under the command of General Michael von Kienmayer, who had arrived with reinforcements. However, on the same day Kienmayer took up his command, Jérôme had left Dresden and headed south in pursuit of am Ende. Kienmayer and his 15,000 troops had found themselves dangerously positioned in the middle of a Franco-Westphalian pincer movement.\nBattle\nHowever, what followed was the most successful series of battles for the Austrians in over a decade. Jérôme was slow in his pursuit, allowing Kienmayer to head south and confront Junot. The Austrians first managed to stop Junot's advanced guard and then engaged Junot's main force on 8 July 1809 at Gefrees. This was the largest battle on the northern front during the whole war and ended in a decisive victory for the Austrians.\nAt Gefrees, the Austrians under Kienmayer had 2 regiments of regular Grenzer troops (about 5,300 men) and several hundred irregular Landwehr militia. The Black Brunswickers remained to the north guarding against any move by Jérôme and were not engaged at Gefrees. The French under Junot, on the other hand, had 2 regular line infantry regiments (about 6,000 men), a Bavarian depot battalion (about 1,000 men), and a dragoon regiment (about 500 men and horses). However, Junot's Corps of Observation of the Elbe were mainly conscripts who were poorly trained in comparison to the Austrian Grenzers. In particular, Junot's cavalry was not able charge effectively, therefore failing to exploit the lack of Austrian cavalry, and allowing the Austrians to remain in line formation. This meant the Austrians were able to deliver heavy and sustained volley fire throughout and by the end of the day, most of the French infantry had fled the field of battle. The Austrians had only suffered minimal casualties, whilst inflicting a substantial blow against the French. Junot's pursuit was not only stopped, but he was forced to retreat to Amberg.\nWith the southern pincer defeated, Kienmayer turned his attention to Jérôme who was still slowly advancing south. He rejoined with the rest of his forces, including the Black Brunswickers, and finally engaged Jérôme's forces on 11 July at Hof. Jérôme had been expecting to fight an Austrian army being pursued by Marshal Junot. Instead, Jérôme found himself outnumbered and facing an army buoyed by a recent victory.\nJérôme, sensing defeat was inevitable, ordered a general retreat to Schleiz and the battle was merely a rear guard engagement. Duke Frederick William and his Black Brunswickers gave chase forcing Jérôme all the way back to Erfurt and the western borders of Saxony. The Austrians retook Dresden and the whole of Saxony had been evacuated. However, by the time Jérôme and his army had arrived safely in Erfurt, news of the French victory at Wagram and the resulting armistice at Znaim had reached Saxony. The Austrians were forced to concede all their gains and Jérôme and his Westphalians headed safely back to Kassel.\nAftermath\nDuke Frederick William, however, was appalled by the Armistice of Znaim. He had hoped with the help of Kienmayer and the Austrians to start a popular uprising against Napoleon in northern Germany. Refusing to agree to the peace between Austria and France, the Black Duke decided to take matters into his own hands and make for the North Sea with his 2,000 troops. He still hoped to start popular uprising and in the following weeks, the Black Duke caused Jérôme major problems, defeating his Westphalian troops twice at the battles of Halberstadt and Ölper, as well as reinforcing his army with Westphalian deserters from both battles. The Black Brunswickers even managed to temporarily retake the city of Brunswick but Jérôme had ordered three generals to find and destroy the Duke Frederick William's forces. Despite this the Black Brunswickers still managed to reach the coast and were evacuated to the Isle of Wight in August 1809 on the ships used to land troops at Walcheren.\nNotes\nReferences\n*\nFurther reading\n*\n*\nExternal links\n*"
    }
  ]
}