{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Babeli\n\nBritish Empire\n*  British Raj\n**  British Punjab\n| commander1        = Lt. Karam SinghUdai SinghBishen SinghMohinder Singh\n| commander2        = Lt. Gen. Sir Arthur Francis Smith\n| strength1         = 4\n| strength2         = 2,200\n| casualties1       = 4\n| casualties2       = Unknown\n| units1            = -\n| units2            = *  British Indian Army\n* Indian Imperial Police\n}}\nThe Battle of Babeli was fought on 1 September 1923 between four Babbar Akalis and the British.\nBackground\nOn the night of 31 August 1923, a group of 18 Babbar Akalis in Babeli village took shelter in the house of their associate Shiv Singh Chahal. Anup Singh, one of the Babbars, betrayed them; he told the British colonial police to destroy all of the party's ammunition with the exception of the gun Karam Singh carried with him. A contingent of 2,200 British soldiers and policemen under the command of Mr. Smith encircled the village next morning.\nBattle\nThe four Babbars were fighting near Gurudwara Chaunta Sahib. Smith challenged them that he would have them arrested alive before 12 o'clock. The Babbars refused to surrender and replied, \"What good was taking you who have brought a posse of 2,000 soldiers just to arrest four men. We will not be caught by you alive.\" Udai Singh and Mohinder Singh were killed by gunshots while Bishen Singh managed to crawl towards the Gurudwara in a wounded state but eventually died due to the loss of blood. The 2,200 soldiers and police officers all attacked Karam Singh who was killed.\nAftermath\nImmediately after the killings, the bodies of the Babbars were brought under a huge tree in the village and a post-mortem was conducted on the site. After the Babbar Akalis were shot dead, the British Army threatened the villagers not to cremate them or else they would face dire consequences. With no one coming forward, Sadhu Singh, an old man from nearby Babiana village came forward and cremated them later at the night in the light of a lantern. He later threw their ashes into a stream. Due to his daring act, folklore says the British ‘awarded’ him with 100 lashes.\nSee also\n* Babbar Akali Movement\n* Martyrdom and Sikhism\nReferences"
    }
  ]
}