{
  "content": [
    {
      "type": "text",
      "text": "# Battle of the Altai Mountains\n\n| commander2        = Dou XianDeng HongTuntuheAnguo\n| strength1         = 200,000\n| strength2         =  18,000\n* 8,000 Han Chinese regulars\n* 10,000 Qiang\n| casualties1       = Entire Xiongnu's army destroyed (with more than 200,000 prisoners)\n| casualties2       = 3,400+\n| campaignbox       =\n}}\nThe Battle of Altai Mountains (), was a major expedition launched against the Northern Xiongnu by the Han dynasty in June 89 AD. The battle was a success for the Han under Dou Xian.\nIn June 89 AD, the Han dispatched a force which promptly advanced from Jilu, Manyi, and Guyang in three great columns that included their allies, specifically the main army of the Southern Xiongnu. The force of General Dou Xian advanced towards the Northern Chanyu into the Altai Mountains. A large detachment then moved to the northwest, and in the major battle of the campaign they defeated the Northern Chanyu at the Altai Mountains and pursued them westwards. The Han forces killed 13,000 Xiongnu troops and accepted the surrender of 200,000 Xiongnu from 81 tribes.\nDou Xian brought the main body of his troops in triumphal progress north to the Khangai Mountains, west of present-day Kharkhorin. There he carved the cliff Inscription of Yanran, composed by his client, the historian Ban Gu, which celebrated the achievement of the battle. This inscription was identified in Dundgovi Province by scholars from Mongolia and China in August 2017.\nAftermath\nAfter the successful campaign of 89 AD, the Xiongnu state was destroyed. After the battle, Dou Xian led his forces back, and the \"Northern Chanyu\", whose name is unknown, sought to negotiate peace. Tuntuhe Chanyu of the Southern Xiongnu, however, was anxious to destroy his rival completely, and early in 90 AD, as embassies were still being exchanged, Dou Xian launched an attack, captured his rival's seal, treasure, wives and daughters.\nGeneral Dou Xian soon initiated a punitive expedition against the remaining hostile Xiongnu tribes, subsequently causing the tribes to flee westwards. Dou Xian had reported that the Northern Chanyu was so weak that there was no point in treating him further. In February 91 AD, he mounted a final invasion, with two of his generals, Geng Kui and Ren Shang in charge. They advanced from Juyan and defeated the Northern Xiongnu ruler, captured his mother, killed 5,000 of his armies, and drove him in flight again to the west from Altayn Nuruu. He was not heard from again. The rest of the Xiongnu left in Dzungaria, specifically near Lake Barkol, had not been directly affected, and some part of the shattered polity was reconstructed under a new chanyu. The new chanyu, however, was killed in 93 AD, and after him, no chanyu of the Northern Xiongnu was ever heard of again, ending the Xiongnu state.\nReferences\nBibliography\n*\n*Fan Ye et al., Hou Hanshu. Beijing: Zhonghua Shuju, 1965.\n*\n*Sima Guang, comp. Zizhi Tongjian. Beijing: Zhonghua Shuju, 1956.\n*\n* Tucker, Spencer C. et al. (2010). A global chronology of conflict: From the ancient world to the modern Middle East''. Santa Barbara: ABC-CLIO .\n*An, Tian, [http://www.wordpedia.com/search/Content.asp?ID=11239 \"Dou Xian Po Beixiongnu Zhi Zhan\" (\"The Battle of Dou Xian's Defeating on the Northern Xiongnu\")]. Encyclopedia of China, 1st ed.\n*"
    }
  ]
}