{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Gray\n\ntemplate -->\n| map_type          =\n| map_relief        =\n| map_size          =\n| map_marksize      =\n| map_caption       =\n| map_label         =\n| territory         =\n| result            = German victory\n| status            =\n| combatants_header =\n| combatant1        =\n| combatant2        =\n*\n| combatant3        =\n| commander1        =  Colonel Lavalle\n| commander2        =  August von Werder Prince Wilhelm of Baden\n| commander3        =\n| units1            =  Garde Mobile\n| units2            = A brigade of the XIV Corps\n| units3            =\n| strength1         =\n| strength2         =\n| strength3         =\n| casualties1       = 15 officers and 500 soldiers taken prisoner\n| casualties2       = Unknown\n| casualties3       =\n| notes             =\n| campaignbox       =\n}}\nThe Battle of Gray (also called Battle of Talmay), fought on 27 October 1870, was a part of the Franco-Prussian War that occurred in Haute-Saône France.\nBattle\nOn 22 October 1870, the XIV Corps, mostly composed of troops from the Grand Duchy of Baden under General August von Werder defeated the Army of the Rhône under General Albert Cambriels at the Battle of Ognon. Werder had orders from chief of staff Helmuth von Moltke to march through Dijon to Bourges. In engagements at Essertenne and Talmay near Gray, troops under Prince William of Baden quickly defeated a French Army force of the Garde Mobile under Colonel Lavalle, sent to defend the Vingeanne river, and forced them to withdraw from Gray. But a new enemy, the famous Italian general of the French Army, Giuseppe Garibaldi, and his forces were ordered to march to the Gray railroad station. From there, they advanced on Dijon.\nOn 24 October 1870, the XIV Corps assembled at Gray. In the days that followed, its units searched for French troops.\nOn 27 October 1870, German forces that had already crossed the Saône River performed a reconnaissance towards Dijon after encountering and repelling several Garde Mobile soldiers from the forests northwest of Gray. In the direction of the Vingeanne, the German army was already fighting the enemy at several points. Two regiments of soldiers firing muskets of the Regiment Baden 2, with 4-gate fireworks of the 3rd heavy battery, which had sailed from Autrey to face an attack by several hundred French Garde Mobile soldiers who had retreated from La Fahy and the Pomilly woods to Mornay and St. Seine L'Eglise. After a skirmish, the Garde Mobile were driven out with the loss of their handheld equipment, and 60 prisoners fell to the Germans.\nFurther down the area, there were several isolated French outposts. The stronger troops, stationed at the junction of Mirabeau and Pontailler-sur-Saône, retreated from Essertenne and the forest to the west after a minor skirmish with the 2nd battalion of the Baden Guards Regiment. As the army continued through the forest, some German soldiers gained access to the entire military wing, which was not supported by a vertical lineup Garde Mobile marching from Talmay to L'Eglise Renève. The French were driven back to Vingeanne and Talmay. At Talmay, another German company surrounded all 15 French officers and 430 soldiers. Later, General Werder ordered General Gustav von Beyer to conduct further reconnaissance towards Dijon.\nAftermath\nAs a result of the victory at Gray, German forces captured a large number of French prisoners. Not long after, Lavalle was brought before a French military court.\nReferences"
    }
  ]
}