{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Cimarron\n\nThe Battle of Cimarron was a famous gunfight that occurred on January 12, 1889, during the Gray County War, between the people of Cimarron, Kansas, and a group of lawmen led by Bill Tilghman. The gunfight, which lasted several hours and resulted in the death of at least one man and the wounding of seven others, began when Tilghman and his raiders attempted to take the county records from the Old Gray County Courthouse back to Ingalls.\nBackground\nIn the late 1880s, Cimarron and its neighbor to the west, Ingalls, were locked in a contest to decide which town would become the new county seat. Because towns in the 19th century often relied on their county seat status to survive, the county seat contests often resulted in violence. After an election to decide the contest ended with accusations of fraud and protests from both sides, the matter was sent to the Kansas Supreme Court.\nMeanwhile, a man from Ingalls named Newt Watson became the new county clerk, and he demanded that the county records in Cimarron be taken from the courthouse and brought to him. When the citizens of Cimarron refused to turn over the records, the Ingalls faction organized a group of raiders to go into town and take them by force.\nThe raiding party, led by Bill Tilghman, also included Jim Masterson, brother of the famous Bat Masterson, Ben Daniels, \"Neal\" Brown, and Fred Singer, who were all former Dodge City peace officers, in addition to some \"cowtown mercenaries,\" George Bolds, Ed Brooks, and Billy Allensworth. To give them \"semi-official status,\" all of the men in the group were deputized by Tilghman, who was appointed temporary Gray County Sheriff by Watson after the current sheriff, Joe Reynolds, was put in a hospital with a gunshot wound to the stomach.\nThe battle\n.]]\nThe raid was set to take place on January 12, 1889. That day, Tilghman and the others arrived in Cimarron with a wagon to carry the records. After pulling up to the courthouse, Watson, Masterson, Singer, and Allensworth quickly entered the building to begin loading the documents into the back of the wagon, while the rest of the men waited outside. In the meantime, some armed Cimarron men were moving into position to attack.\nSuddenly, the Cimarron men opened fire on the raiders waiting by the wagon. Tilghman was hit in one of his legs, Brooks \"doubled over\" with a gunshot, and Bolds was struck three times, once in the leg and twice in the abdomen. The wagon driver, a man by the name of Charlie Reicheldeffer, was also hit, but somehow they all managed to climb back onto the wagon and drive it out of town without being killed.\nMasterson and the others were left inside the courthouse, so they immediately took up positions on the second floor to return fire. The Cimarron men attempted to storm the building by rushing the front door, but were beaten back by \"deadly shots\" from the remaining raiders. After that failed, the Cimarron men attempted to breach the building by raising a ladder up to a window in the back of the building. This plan was also thwarted when Masterson found out and kicked down the ladder.\nEventually the townsfolk made it into the first floor of the building and from there they fired up through the ceiling and into the second floor. The raiders, however, climbed on top of the filing cabinets, desks, and a steel safe to protect themselves. Ultimately, the battle lasted for about six hours and finally came to an end when the Cimarron faction received a telegraph from Bat Masterson in Dodge City warning that unless his brother and his friends were allowed to leave town, he would \"hire a train and come in with enough men to blow Cimarron off the face of Kansas.\" After that, the raiders put down their guns and were briefly taken prisoner.\nAftermath\nAccording to Richard M. Patterson's Historical Atlas of the Outlaw West, only one man – a Cimarron resident named J. W. English – was killed in the entire shootout, although other sources say that as many as three men died as result. Patterson also says that in total one man was killed and three wounded on the Cimarron side, and that four men were wounded on the Ingalls side. The raiders were later tried for the killing of English, but they were eventually acquitted.\nThe dispute over the new county seat did not end either, although there was no further violence. It was finally settled in February 1893, when Cimarron became the permanent seat of Gray County. The Old Gray County Courthouse, which was replaced in 1927, is now open to the public and serves as a meeting hall. It has been listed on the National Register of Historic Places since 2009 for its association with the Kansas County Seat Wars.\nSee also\n* List of Old West gunfights\n* County seat war\nReferences"
    }
  ]
}