{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Ganale Doria\n\n1936\n| date              = 12–20 January 1936\n| place             = Valley of the Genale Doria River, Ethiopia\n| result            = Italian victory\n| combatant1        =\n* Italian Eritrea\n* Italian Somaliland\n*Italian Libya\n| combatant2        =\n| commander1        =  Rodolfo Graziani   Olol Dinle  Pietro Maletti\n| commander2        =  Desta Damtew Beine Merid\n| units1            = 29th Infantry DivisionLibyan Division6th CC.NN. Division\n| units2            = Army of SidamoArmy of Bale\n| strength1         = 20,000\n| strength2         = 24,000\n| casualties1       = 900 killed or wounded\n| casualties2       = 1000 killed or wounded\n}}\nThe Battle of Ganale Doria (also known as the Battle of Genale Dorya or as the Battle of Genale Wenz) took place in 1936 during the Second Italo-Abyssinian War. It was fought on the \"southern front\". The battle consisted largely of air attacks by the Italian Royal Air Force (Regia Aeronautica), under the command of General Rodolfo Graziani, against an advancing and then withdrawing Ethiopian army under Ras Desta Damtu. The battle was primarily fought in the area along the Genale Doria River valley between Dolo and Negele Boran.\nRas Damtew launched an Ethiopian offensive against the Italian forces in Italian Somaliland. However, Graziani carried out his active defense so vigorously that it became an offensive.\nBackground\nIn early 1935 Italian forces were preparing to invade Ethiopia from Eritrea. Only one Italian division, the 29th Infantry Division \"Peloritana\", had been allotted to the southern front, while the northern front had ten. General Rodolfo Graziani was in charge of the southern front; his role was expected to be entirely defensive. His orders from General Emilio De Bono were to dig in and wait for the Ethiopians to attack.\nGraziani set out to convince De Bono's commander, Italian dictator Benito Mussolini, that the plans for the campaign needed to be changed to allow him and his army on the southern front to play a more active role. Mussolini wanted action and was willing to listen. In the end, Graziani's plan for an offensive on the \"southern front\" had the tacit approval of Rome if not De Bono. Between April and December, Graziani opened up new roads, developed the port facilities at Mogadishu, solved a difficult water supply problem, stocked up provisions and munitions, and purchased hundreds of motor vehicles. He successfully acquired American-made trucks from British dealers in Mombasa and Dar es Salaam.\nOn 3 October 1935, when De Bono launched his invasion in the north without a declaration of war Graziani was logistically prepared for an advance on Harar in the south. However, Graziani's forces were still relatively few in number and they faced an enemy numbering approximately 80,000 strong. In addition to numbers, the soldiers of the two principle Ethiopian armies on the \"southern front\" were said to be better trained and better equipped than the soldiers of the armies De Bono faced in the north. The Ethiopian commanders in the south were young, progressive, and loyal; dedicated to Haile Selassie's cause.\nInstitution of the Milan plan\nWhen De Bono's forces crossed the Mareb River in the north, Graziani instituted what he called the Milan Plan in the south. The initial objectives of this plan were to eliminate Ethiopian frontier posts and to test the Ethiopian reaction to a series of probes. Despite the incessant rains, within three weeks the Italians had captured the villages of Kelafo, Dagnerai, Gerlogubi, and Gorahai.\nmakes agreements with General Frusci and the Sultan Olol Dinle for the action on Imi.]]\nGorahai, the most important of the villages, was known as an old stronghold of the Dervish movement and Diriye Gure's emir, called the \"Mad Mullah\" by the British. With approximately 3,000 fighters under his command, Grazmach and Balambaras Afawarq Walda Samayat had turned Gorahai into an armed camp. Capronis of the Italian Royal Air Force (the Regia Aeronautica) regularly bombed Gorahai and Afawarq himself directed the fire of the lone anti-aircraft gun, a 37 mm Oerlikon.  The gun was mounted in one of the old-style turrets of the Mad Mullah's antiquated fort. During one of the regular bombings, Afawarq was seriously wounded. He refused to be taken to the hospital because he feared that the morale of his men would suffer in his absence. Within 48-hours the wound became gangrenous and Afawarq collapsed and died. He was posthumously promoted to Dejazmach by the Emperor.\nAfawarq was correct about the morale of his men and, after his death, they abandoned Gorahai. After taking the position, Graziani sent a flying column under Colonel Pietro Maletti to catch and harass the fleeing Ethiopians. Maletti caught up with the Ethiopians only to have them turn back and attack. At Anale, the Ethiopian force fleeing from Gorahai was joined by a relief force sent to reinforce the garrison at Gorahai. A meeting encounter ensued and casualties were high among the Ethiopians and the Italians. After several hours, both sides withdrew and both claimed victory. While better equipped in all ways, the Italians were never able to get the upper hand. The small two-man, turretless L3/35 tankettes sent against the Ethiopians quickly bogged down in the rough terrain and were put out of action by Ethiopians who crept up on them and fired through the weapon slits in the armor.\nThe Italians advanced 145 miles in four days. This brought them almost within striking distance of Jijiga, Harar, and Ethiopia's only railway. But the forces available to Graziani remained limited and by November the initiative on the southern front passed to the Ethiopians, as it did in the north.\nBattle\nRas Desta descended from the Bale Plateau, assembling the Army of the Sidamo at Negele Boran. This army was considered to be well armed by Ethiopia standards and numbered approximately 20,000 men. His goal was to advance down the Ganale Dorya River and to then continue his advance down the Juba River. From Negele Boran, Ras Desta planned to march approximately 200 miles south and capture the border town of Dolo, then invade Italian Somaliland itself. This plan was ill-conceived and overly ambitious. It also lost the element of surprise as it became common knowledge and was the subject of marketplace gossip. In addition to the Army of the Sidamo, the 4,000 strong Army of the Bale, under Dejazmach Beine Merid, was to advance down the Shebelle River and invade the center of Somalia. The bulk of the Bale army, under Beine Merid, along with a strong detachment of Hararghe troops, was sent to counter Olol Dinle's advance.\nRas Desta's forces advanced in three columns. Two columns were led by his two Fitauris Ademe Anbassu and Tademme Zelleka. Kenyazmach Bezibeh Sileshi commanded a relatively modern guards battalion. The Army of the Bale was able to move forward more quickly due to the better terrain in its area. In November, advancing elements of this force clashed with about 1,000 dubats of the pro-Italian Sultan Olol Dinle. Both sides eventually withdrew from the battlefield, with Beine Merid seriously wounded. Its commander stricken, the army of the Bale retreated, leaving the army of the Sidamo was on its own. Olol Dinle managed to complete the main objective of his mission which was to immobilise Beine Merid. Meanwhile, Italian General Graziani was preparing an offensive aimed at dislodging Abyssinian forces from their positions on the Dawa Parma. Dinle then led irregular bands along the upper course of the Webi Shebeli River, advancing into the Imi region. This movement allowed for reconnaissance of the area and diverted hostile forces away from reinforcing Ras Desta's troops. On his return, Dinle’s column occupied Danano in the Bawa Valley, where they joined forces with Hassan Ali, Chief of the Ogaden Rar Dalal tribe, who had pledged allegiance to the Italians.\nOn 13 November Graziani moved his headquarters to Baidoa. The 29th Infantry Division \"Peloritana\" was still the only full division available to him. By mid-November limited elements of the Libyan Colonial Division and the 6th CC.NN. Division \"Tevere\" were in Somalia. As additional forces arrived later in November, Graziani formed them up at Dolo near the border. By early December, Graziani's forces were in a state of readiness to launch a counterattack against Ras Desta's offensive and Graziani's new commander, Marshal of Italy Pietro Badoglio, noted this preparedness. Badoglio sent Graziani a telegram reminding him of his \"strictly defensive\" role. Graziani feigned compliance with Badoglio but communicated privately with Rome and urged that he be given authorization for an offensive. Mussolini gave Graziani permission for \"a limited attack in the case of absolute necessity\" and Graziani took this as the authorization he needed.Even as the Ethiopians advanced, Graziani continued his preparations. He organized his forces into three columns. On the Italian right was the first column which was to advance up the valley of the Genale Doria River. In the center was the second column which was to advance towards Filtu. On the left was the third column which was to advance up the valley of the Dawa River. All three columns had access to motor transport and were equipped with a few tanks. They could be thought of as \"mechanized\" by the standards of 1936. In addition to the three columns on the ground, Graziani had at his disposal the 7th Bomber Wing of the Royal Air Force.\nOn 10 December, a strategic reconnaissance was launched with Olol Dinle's bands along the Webi Shebeli River, heading towards Imi. By late November, it was learned that Beiene Merid was between the Gestro and Webi Shebeli Rivers, near Mount Ellot, with strong contingents marching along the Gestro. As a result, Olol Dinle was ordered not to proceed to Imi but to move into the recently subdued territory of the Ghelimes and then march on Ellot to attack the forces descending from the Gestro from behind, which could cause significant trouble to our right flank in case of a counteroffensive along the Doria River. A column under Bertello, already concentrated at Goddere, would also support Olol Dinle’s action.\nOn 23 December, Olol Dinle arrived at Gabba. On the 24th and 25th, three enemy columns marched against him: one along the Webi Shebeli, one from Mount Ellot, and another from the southwest, from Barrei, aiming to cut off his retreat. Although free to withdraw, Olol Dinle decided to fortify his position and requested air support. The resulting \"Christmas battles\" caused heavy losses for his forces, also due to the hostile local population. Nevertheless, the enemy, having lost at least a thousand men, retreated. On the opposing side, it was feared that Olol Dinle’s bands were merely the vanguard of a larger force advancing from the Webi Shebeli. Nasibu was alarmed, and fearing for Harar, motorized troops were dispatched from Shoa to the Errer Valley. Marshal Graziani wrote: \"Wehib has lost both his bearings and his mind,\" and indeed, he told a foreign journalist that he couldn’t understand where the enemy armies in the South were or what the Command wanted to do: \"With this, the war becomes impossible to conduct!\" This phrase echoes Ferravilla's quip in the duel of Sur Panera: \"If he doesn’t stand still, how can I stab him?\"\nOn 12 January the Royal Air Force started the Italian response to the Ethiopian advance by dropping two tons of mustard gas on the Ethiopians. For three days the advancing Ethiopians were attacked incessantly from the air. The Ethiopian force that the Italian outposts already had taken casualties and been disorganised. The combination of air attacks, a long march through a desert, inadequate rations, as well as dysentery and malaria, had shattered the morale of Ras Desta's army.\nOn 15 January when the three Italian columns advanced Ras Desta's battered forces repeatedly retreated without putting up serious resistance. Even so, the Ethiopians did stand and hold their ground in the area where the Ganale Dorya River and the Dawa River joined to become the Juba River. This was referred to by the Italians as the Battle of the Three Rivers.\nThe Italian mechanized columns responded with a series of out-flanking maneuvers which quickly compelled the Ethiopians to withdraw. Unfortunately the weary army could not withdraw fast enough as it was again assaulted from the air. The Ethiopians' withdrawal quickly became a disorganized retreat. In this unequal chase, the Ethiopians were on foot and the Italians were generally in motor vehicles. The Italians blocked the few wells that lay along the way and closely pursued the parched Ethiopians. Ras Desta's army soon disintegrated.\nAftermath\nOn 20 January, within five days of their start, all three of Graziani's columns had reached their objectives. As a testament to the thoroughness of the job that the Royal Air Force had done, no shots were fired when the Italians converged on and entered their ultimate objective, Negele Boran. The rout of Ras Desta's army was complete. On 24 January, during the mopping up actions which followed, Graziani gave orders to the air commander:  \"Burn and destroy all that is inflammable and destructible&nbsp;... bomb neighboring woods with gas and incendiaries.\"  Mussolini said that there was to be no truce.  Ras Desta fled by mule to Addis Ababa, narrowly escaping capture.\nOne detail did detract from Graziani's triumph. About halfway through the battle, over nine hundred of his Eritrean troops deserted. Graziani's response was to order the corpses of the Eritrean dead left to rot on the field where they fell. Over 1,000 Eritrean deserters were said to have fought on the Ethiopian side at the Battle of Maychew.\nHaving taken the ground intended and having reached Wadera, Graziani now cautiously withdrew his forces approximately 60 miles to Negele Boran to allow food and munitions to catch up. The southern front was the subordinate front and the war on the northern front was not yet going well for the Italians. The Christmas Offensive was pressing the Italians hard, and they had priority for supplies and reinforcements.\nSee also\n* Ethiopian Order of Battle Second Italo-Abyssinian War\n* Army of the Ethiopian Empire\n*List of Second Italo-Ethiopian War weapons of Ethiopia\n* Italian Order of Battle Second Italo-Abyssinian War\n* Royal Italian Army\n*List of Italian military equipment in the Second Italo-Ethiopian War\nNotes\n;Footnotes\n;Citations\nReferences\n*\n*\n*\n*\n*\nFurther reading\n*"
    }
  ]
}