{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Seseña__disambig_1\n\nSpanish Republic Soviet Union\n| combatant2        =  Nationalist Spain\n| commander1        =  Enrique Líster Ildefonso Puigdendolas Pols Armāns\n| commander2        =  Felix Monasterio\n| strength1         = 1st Mixed Brigade: (around 3,800 men)15 T-26 tanks\n| strength2         = One cavalry column: ?regulares:?At least 11 Italian L3/33 tankettes\n| casualties1       = 8 dead3 tanks destroyed\n| casualties2       = Soviet claim: 600 dead11 tankettes destroyed\n| campaignbox       =\n}}\nThe Battle of Seseña was a Republican-Soviet assault on the Nationalist stronghold of Seseña, near Toledo, 30&nbsp;km south of Madrid in October 1936 during the Spanish Civil War. After the fall of Talavera de la Reina and Toledo in September 1936, the Nationalist troops pushed towards Madrid and in October they were 30&nbsp;km from the city. The Republican government which had received new Soviet weapons decided to launch a counteroffensive in order to stop the Nationalist offensive at Seseña. The attack failed and the Nationalists resumed their advance towards Madrid. The battle is notable for being the first time that massive tank warfare was seen in the Spanish War and for the use by Nationalist troops of Molotov cocktails against Soviet T-26 tanks.\nBackground\nThe professional troops of the Spanish Army of Africa had started their drive to Madrid in August 1936. Equipped with modern weapons they had received from Germany and Italy (Ju 52 and Savoia SM-81 planes, and Italian L3/35 tankettes), the Nationalist troops, had defeated the government militias in the battles of Mérida, Badajoz, Sierra de Guadalupe and Talavera de la Reina, and had occupied Toledo on September 27, 1936. In late October 1936 the Nationalists took several towns near Madrid (Torrejon de Velasco, Seseña, Torrejón de la Calzada and Griñon), breaking the first defensive line of Madrid.\nMeanwhile, the Republican government had requested aid and weapons from France in order to defeat the Nationalist forces and the president of the French Republic, Léon Blum, initially decided to send help because a Nationalist victory could damage the international position of France. Nevertheless, on July 25, 1936 Blum decided not to send weapons to the Republic, because the opposition of the British government and the French right., and on August 8, 1936 decided to close the frontier, Then, the Spanish government decided to buy weapons from the Soviet Union. The first Soviet ship with weapons reached Cartagena on October 15, 1936. On 28 October 1936, the Republican prime minister Largo Caballero decided to launch a counter-offensive with the recently arrived Soviet weapons in order to detain the Nationalists advance towards Madrid.\nThe battle\nOn October 29, 1936, the Spanish Republican Army launched an attack against the Nationalist-held town of Seseña. The Republicans attacked with a force of 15 T-26 tanks, armed with a 45mm cannon, led by a Latvian tank specialist, Captain Pols Armāns, and driven by Soviets with Spanish gunners, and the 1st Mixed Brigade, a newly established mixed brigade led by Enrique Líster. Opposing them, the Nationalists had a force of cavalry led by colonel Monasterio, Moroccan regulares and some Italian tankettes. The Soviet tanks were massed together for a shock attack and entered in Seseña. Arman claimed that the Soviet tanks destroyed two infantry battalions, two cavalry squadrons, ten 75&nbsp;mm guns, two tankettes and 20-30 trucks. The tanks crossed Seseña and reached Esquivias, nevertheless, the Mixed Brigade of Lister never entered into the town and the tank force had to retreat. Mikhail Koltsov, a Russian journalist at Seseña said: \"Lister...explained, a grimace upon his face, that his units, had been moving well at first, but after 1,500 metres, they had felt tired and sat down...\". Furthermore, the Nationalists managed to destroy three Russian tanks and damage three more with Molotov cocktails and artillery fire. Four Soviet and four Republican Spanish tankers were killed in action, and other six wounded. The same day, the Republican army, led by Colonel Ildefonso Puigdendolas, launched another assault against the nearby town of Illescas, but the attack was beaten off. Puigdendolas was killed by his own men when trying to prevent desertion.\nAftermath\nThe attack failed, because the Spanish Republican infantry had no training to operate with tanks, but the Soviet tanks were shown to be effective. According to Thomas, one Soviet tank destroyed 11 Italian tankettes. The same day a squadron of Russian Katiuska bombers attacked Seville. Because the arrival of the Soviet weapons Nazi Germany decided to increase their aid to the Nationalists and to organize the Legion Condor.\nThe Nationalists resumed their offensive, Getafe (13&nbsp;km south of Madrid) fell on November 4 and on November 8 the Nationalists started their frontal assault on Madrid. Nevertheless, Mola decided to retire a part of their troops from the assault on Madrid, in order to reinforce the flanks, because he feared another tank attack.\nSee also\n* List of Spanish Republican military equipment of the Spanish Civil War\n* List of Spanish Nationalist military equipment of the Spanish Civil War\nNotes\nBibliography\n*Beevor, Antony. (2006). The Battle for Spain. The Spanish civil war, 1936–1939. Penguin Books. London. .\n*Jackson, Gabriel. (1967). The Spanish Republic and the Civil War, 1931–1939. Princeton University Press. Princeton.\n*Preston, Paul. (2006). The Spanish Civil War. Reaction, revolution & revenge. Harper Perennial. London.\n*Thomas, Hugh. (2001) The Spanish Civil War. Penguin Books. London.\nExternal links\n*[http://bobrowen.com/nymas/soviet_tank_operations_in_the_sp.htm Soviet tanks operations in the Spanish Civil War]\n*[http://www.gutenberg-e.org/kod01/kod21.html Stalin and the Spanish Civil War]"
    }
  ]
}