{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Doctor Coss\n\n| place             = Doctor Coss, Nuevo León, Mexico\n| result            = Gulf Cartel victory\n| combatant1        =  Gulf Cartel\n| combatant2        =  Cártel del Noreste\n| commander1        =\n| commander2        =\n| strength1         =\n| strength2         =\n| casualties1       = None\n| casualties2       = 10 killed and 5 Narco tanks destroyed\n| campaignbox       =\n}}\nThe Battle of Doctor Coss was an armed conflict in Mexico between the Gulf Cartel and the Cártel del Noreste faction of Los Zetas in the municipality of Doctor Coss, Nuevo León. The confrontation was one of the most serious in the region, disputed by both cartels due to their proximity to border municipalities of the neighboring state of Tamaulipas.\nBackground\nAfter the split of Los Zetas from the Gulf Cartel in 2010, both the organizations started to fight each other for the control of the drug trade and the territories of the coast and for the border territories. From 2011 the Los Zetas Cartel had internal conflicts which are still ongoing that formed small rival factions, the most powerful faction is Cártel del Noreste formed in 2014. From its creation, the organization started fighting the Gulf Cartel and in the same time the other rival factions and  other cartels.\nDoctor Coss is a rural community located 60 kilometers from the Mexican border town Miguel Alemán, which together with other neighboring communities is literally a battlefield between Cártel del Noreste and Gulf Cartel.\nAs a precedent to the violence suffered in the municipality, was the murder of Francisco Leónides Cruz, secretary of public security of the municipality, on November 24, 2020. The attackers ambushed the police command with assault rifles, fired from vans with artisanal armor. In the attack, an officer died trying to repel the attack, and other unspecified people were injured. The former secretary had already been the target of an attack in May 2020, repelling an attack.\nIn a study carried out by the Consejo Ciudadano para la Seguridad Pública y la Justicia Penal (Citizen Council for Public Security and Criminal Justice in Spanish), it was detailed that the proximity to the border municipalities causes the climate of violence, which according to the study made it the most violent municipality in Mexico with 1,691 per 100 thousand inhabitants (with only 1,360 inhabitants and 23 murders in 2021).\nThe Battle\nOn March 13, 2021, the city was the scene of a violent battle between the two cartels in which about ten narco tanks were used. The battle lasted until the next day. The Gulf Cartel prevailed, destroying 5 armored vehicles and killing 10 Zetas.\nSee also\n*Infighting in Los Zetas\n*Mexican drug war\nReferences"
    }
  ]
}