{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Egypt Station\n\nUnited States\n|combatant2 =  Confederate States\n|commander1 = Benjamin Grierson\n|commander2 = Franklin GardnerSamuel J. Gholson\n|strength1  = 3,500\n|strength2  = 1,200–2,000, 4 guns\n|casualties1= 128\n|casualties2= Over 500 captured\n|campaignbox=\n}}\nThe Battle of Egypt Station (December 28, 1864) was an engagement in Mississippi that took place during a successful Union cavalry raid during the American Civil War. A 3,500-man Union cavalry division under Brigadier General Benjamin Grierson defeated Confederate troops led by Franklin Gardner and Samuel J. Gholson. Grierson's raiding cavalry left Memphis, Tennessee on 21 December and first demolished a Confederate supply depot at Verona. Moving south while wrecking bridges and track along the Mobile and Ohio Railroad, the Union raiders encountered the Confederate defenders at Egypt Station. After their victory, Grierson's cavalry headed southwest to Vicksburg which it reached on January 5, 1865. The raiders destroyed a large amount of Confederate supplies and also damaged the Mississippi Central Railroad. Some of the men captured by Grierson's raiders proved to be former Union soldiers who volunteered to fight for the Confederacy rather than languish in prison camps. When John Bell Hood's army retreated into northern Mississippi after the Battle of Nashville, it was unable to obtain supplies because Grierson's raiders had damaged the railroad so badly.\nBackground\nThe Battle of Nashville ended on December 16, 1864, with Hood's Confederate Army of Tennessee fleeing from the battlefield after being routed by the Union army under George Henry Thomas. The Federal troops inflicted losses of about 2,300 killed and wounded and 4,462 captured on their opponents, while seizing 53 artillery pieces. At Franklin on December 17, the retreating Confederates managed to destroy the bridges, but James H. Wilson's Union cavalrymen forded the Harpeth River to capture 2,000 enemy soldiers too badly wounded to be moved. Later that day, Wilson's troopers overran Douglas's Texas Battery, capturing its three guns. Yet the Confederate rearguard was able to fend off Wilson's pursuit. Meanwhile, a blunder by Thomas sent the pontoon train by the wrong road so that the Federal pursuit was delayed. After bitter rearguard actions conducted by Nathan Bedford Forrest, the survivors of Hood's army crossed the Tennessee River on December 28 and passed out of the reach of Thomas and Wilson.\nVerona\nThe commander of the Military Division of West Mississippi, Major General Napoleon J.T. Dana ordered Grierson and 3,300 cavalry to leave Memphis and attempt to break the Mobile and Ohio Railroad. Grierson ordered his 1st Brigade under Colonel Joseph Kargé to move northeast on December 19 from Memphis toward Bolivar, Tennessee in a feint, then move south and join the main column near Ripley, Mississippi. Because the 1st Brigade was unable to cross a flooded river, it returned to Memphis without accomplishing this mission. Grierson's expedition left Memphis on December 21, 1864, and headed east along the Memphis and Charleston Railroad in the direction of Corinth, Mississippi. Grierson reported having 3,500 men, including 11 cavalry regiments organized into three brigades led by Colonels Kargé, Edward Francis Winslow, and Embury D. Osband. In addition, there was a 40-man company acting as escort, 50 African-Americans acting as pioneers, and 20 days' rations carried by pack mules. Grierson reported having no artillery and no wagons. However, historian Frederick H. Dyer stated that Battery \"K\", 2nd Illinois Light Artillery Regiment accompanied the raid and fought at Egypt Station.\nWhen the Union column reached a point  west of Moscow, Tennessee, it veered to the southeast and passed through Lamar, Mississippi before arriving at Ripley. The 10th Missouri Cavalry Regiment left the column and cut the telegraph lines at LaGrange and Grand Junction, Tennessee and rejoined Grierson's division before it reached Ripley. From Ripley, a detachment from the 2nd New Jersey Cavalry Regiment marched to Booneville and the 4th Illinois Cavalry Regiment moved to Guntown to damage the Mobile and Ohio Railroad at those places. They destroyed four bridges, several miles of track, and military supplies before rejoining the main column.\nIt was learned that a Confederate supply depot existed at Verona. Since civilians encountered had expressed complete surprise at the Union raiders' presence, Grierson detached Kargé's brigade and authorized that officer to attack Verona on the night of December 25. Federal troopers of the 7th Indiana Cavalry Regiment scattered the Confederate garrison and destroyed 200 wagons captured at the Battle of Brices Cross Roads and loaded with stores for Hood's army, eight warehouses filled with military stores, 450 English carbines, 500 Austrian rifles, and a train of 20 cars. Kargé then withdrew his brigade to the sound of exploding shells from the burning warehouses. At the same time, Grierson sent the 11th Illinois Cavalry Regiment to wreck the bridge at Old Town Creek and tear up track between there and Tupelo.\nEgypt Station\nOn December 26–27, Grierson's division moved south along the Mobile and Ohio, destroying track and culverts. An enemy force was reported at Okolona, but it withdrew to the south as the Union column approached. At Okolona, the raiders tapped the telegraph line and discovered that Confederate reinforcements were being sent from Mobile, Alabama and other points along the railroad. Getting information from deserters that the reinforcements would not arrive until 11:00 am, Grierson determined to attack the Confederate force at Egypt Station on the morning of December 28. Grierson estimated the Confederate force at 1,200–2,000 men and four train-mounted guns. Kargé's brigade marched at 7:00 am that morning, brushed aside the Confederate cavalry, and encountered a defense line about  north of Egypt Station.\nAt 8:15 am, Kargé ordered the 2nd New Jersey Cavalry to drive back the Confederate skirmish line which was done. He then deployed the 2nd New Jersey on the left and the 7th Indiana and 4th Missouri Cavalry on the right. The Unionist 1st Mississippi Mounted Rifles guarded the pack train. Despite firm resistance, the Confederate line was pressed back. After shelling the Union cavalrymen, the train with its four-gun battery began to withdraw. Kargé ordered the 7th Indiana and 4th Missouri to seize the train. Grierson arrived on the field and led these two regiments after the train. By this time, the defenders had fallen back to a wooden stockade on the east side of the railroad. Two mounted companies charged the stockade on the left while three dismounted companies rushed the right side. The stockade's defenders then surrendered, altogether about 500 men including a lieutenant colonel and 15 officers. The 7th Indiana captured an additional 47 men including a lieutenant colonel. During the action, two trains of reinforcements under Major General Franklin Gardner appeared from the south, but these were stopped and prevented from joining the battle. From Osband's brigade, the 4th Illinois supported the action on the right while the 11th Illinois and 3rd United States Colored Cavalry Regiments helped in the attack on the stockade.\nIn the battle, the 2nd New Jersey lost three officers killed and two wounded, and 16 enlisted men killed and 69 wounded. The 7th Indiana lost two killed and 11 wounded while the 4th Missouri lost one officer wounded and captured and one enlisted man wounded. The 4th Illinois lost two enlisted men wounded while the 11th Illinois lost one enlisted man killed and two officers and 13 men wounded. One officer and 39 men from the 2nd New Jersey were left at Egypt Station under the care of the regiment's assistant surgeon because they were too badly hurt to be moved. Nine enlisted men from the 11th Illinois in the same condition were also left behind. At the time, it was believed that Confederate Brigadier General Samuel J. Gholson was mortally wounded, but he lived until 1883, though he lost his left arm. After the action, Grierson ordered his column to move west to Houston. The 2nd Wisconsin Cavalry Regiment was assigned to guard the over 500 captured Confederates.\nFranklin\nFrom Houston, Grierson ordered feints north toward Pontotoc and southeast toward West Point. However, the main Union column marched southwest through Bellefontaine to Winona on the Mississippi Central Railroad. At Winona, the depot, two locomotives, and Confederate supplies were destroyed. From Winona, a detachment from the 4th Iowa Cavalry Regiment moved to Bankston where it destroyed the cloth and shoe factories making equipment for Confederate soldiers. A detachment of 300 horsemen from Winslow's brigade under Colonel John W. Noble of the 3rd Iowa Cavalry Regiment went north from Winona toward Grenada, wrecking the railroad and Confederate facilities. Noble's force rejoined the main column at Benton. Grierson sent Osband's brigade to the south with the mission of tearing up additional railroad track. The remainder of Grierson's column moved southwest to Lexington and then Benton.\nOn January 1, 1865, Osband's brigade marched south through Vaiden and West Station, destroying an estimated  of track, plus bridges, culverts, stations, and water tanks. The following day, a Confederate force was reported assembling at Goodman so Osburn moved his brigade southwest toward Ebenezer. Near Franklin, the 3rd U.S. Colored Cavalry ran into a Confederate force led by Brigadier General William Wirt Adams. The 11th Illinois took position on the right flank while the 4th Illinois supported the 3rd U.S. Colored. After a struggle lasting one hour and a half, both sides disengaged. Osband lost one officer killed and one wounded, and three enlisted men killed, seven wounded, and two missing. Two enlisted men were too severely wounded to be moved and were left at Franklin. Osband's brigade moved through Ebenezer and joined Grierson's main column at Benton at night on January 2. Adams reported 22 casualties: two officers and five enlisted men killed, and three officers and 12 men wounded.\nVicksburg\nGrierson's division rode into Vicksburg on January 5, 1865. Grierson claimed to have destroyed four running locomotives, 10 locomotives under repair, 95 railroad cars, 300 army wagons, two caissons,  of bridges and trestles,  of railroad track,  of telegraph poles and wire, 30 warehouses of military stores, seven depots, 500 bales of cotton, 700 hogs, and various other Confederate property. The Union column was accompanied by 1,000 escaped slaves and brought in an estimated 600 Confederate prisoners and 800 horses and mules. Grierson noted that at least 100 prisoners were Union soldiers who had been confined at Southern prison camps and recruited into the Confederate army; he recommended leniency. Grierson reported the following casualties: four officers and 23 enlisted men killed, four officers and 89 men wounded, and seven men missing.\nHood's defeated soldiers reached Corinth, Mississippi, hoping to be issued new clothing, but there was none there. Grierson's cavalry had wrecked large sections of the Mobile and Ohio Railroad. Unable to resupply his troops at Corinth, Hood was compelled to order a  retreat to Tupelo on January 3. Even when the last unit trudged into camp on January 12, there was a shortage of food and equipment. Unable to feed his soldiers from his inadequate supplies, Hood resorted to a system of furloughs from which many of the men never returned to the ranks.\nUnion order of battle\n{| class=\"wikitable\" style=\"text-align:center; width:70%;\"\n|+Division of West Mississippi, Cavalry Division: Brig. Gen. Benjamin Grierson\n! Brigade\n! Strength\n! Units\n! Commander\n! Strength\n! Losses\n|-\n| rowspan=5 | 1st BrigadeColonelJoseph Kargé\n| rowspan=5 | 1,101\n| 7th Indiana Cavalry Regiment || Capt. Elliott || 167 || 13\n|-\n| 1st Mississippi Mounted Rifles Battalion || Lieut. Holman || 88 || 0\n|-\n| 4th Missouri Cavalry Regiment || Capt. Hencke || 104 || 2\n|-\n| 2nd New Jersey Cavalry Regiment || Lieut. Col. Yorke || 742 || 95\n|-\n| Pack train with 90 mules || - || 65 || 0\n|-\n| rowspan=4 | 2nd BrigadeColonelEdward F. Winslow\n| rowspan=4 | 825\n| 3rd Iowa Cavalry Regiment || Col. John W. Noble || 320 || 5\n|-\n| 4th Iowa Cavalry Regiment || Maj. William W. Woods || ? || 2\n|-\n| 10th Missouri Cavalry Regiment || Capt. F. R. Neet || ? || 3\n|-\n| Pack train with 42 mules || - || 19 || 0\n|-\n| rowspan=5 | 3rd BrigadeColonelEmbury D. Osband\n| rowspan=5 | 1,726\n| 4th Illinois Cavalry Regiment || Capt. Anthony T. Search || 260 || 5\n|-\n| 11th Illinois Cavalry Regiment || Lt. Col. Otto Funke || ? || 16\n|-\n| 3rd U.S. Colored Cavalry Regiment || Maj. E. M. Main || ? || ?\n|-\n| 2nd Wisconsin Cavalry Regiment || Maj. William Woods || ? || ?\n|-\n| Pack train || - || ? || ?\n|}\nNotes\nReferences\n*\n*\n*\n* |title=The War of the Rebellion: A Compilation of Official Records of the Union and Confederate Armies, Vol. XLI Part 1 |volume=41 |year=1893 |publisher=Government Printing Office |location=Washington, D.C. |access-date=October 18, 2020 |url=https://collections.library.cornell.edu/moa_new/waro.html |pages=999–1000 }}\n* |title=The War of the Rebellion: A Compilation of Official Records of the Union and Confederate Armies, Vol. XLV Part 1 |volume=45 |year=1894 |publisher=Government Printing Office |location=Washington, D.C. |access-date=October 18, 2020 |url=https://collections.library.cornell.edu/moa_new/waro.html |pages=844–875 }}"
    }
  ]
}