{
  "content": [
    {
      "type": "text",
      "text": "# Battleford Industrial School\n\n-->\n| other_name             =\n| former_name            =\n| type                   =\n| religious_affiliation  = Anglican\n| established            = 1883\n| founder                =\n| closed                 = 1914\n| school_board           =\n| district               =\n| authority              =\n| oversight              =\n| principal              =\n| head                   =\n| staff                  =\n| faculty                =\n| grades                 =\n| gender                 =\n| age_range              =\n| enrollment             =\n| language               =\n| campus_size            =\n| campus_type            =\n| colors                 =\n| accreditation          =\n| publication            =\n| newspaper              =\n| yearbook               =\n| affiliation            =\n| website                =\n| footnotes              =\n}}\nBattleford Industrial School was a Canadian Indian residential school for First Nations children in Battleford, Northwest Territories (now Saskatchewan) operating from 1883 to 1914. It was the first residential school operated by the Government of Canada with the aim of assimilating Indigenous people into the society of the settlers.\nThe Truth and Reconciliation Commission of Canada noted in its final report:\"The opening of the Battleford industrial school in 1883 marked a turning point in Canada’s direct involvement in residential schooling for Aboriginal people. Prior to that, the federal government had provided only small grants to boarding schools in Ontario and the Northwest that had been founded and operated by Christian missionary organizations. By 1884, there were three industrial schools in operation: Battleford, High River, and Qu’Appelle.\" Battleford Industrial School was therefore the first Indian Industrial / Residential School opened in Canada that was directed and funded solely by the Department of Indian Affairs rather than by a church which sought funding from the government. The school was opened as an “industrial” school where children lived and attended school for a few hours per day, but also worked in various occupational roles within the school such as the dairy, bakery, printshop, laundry, carpentry, shoe making, and farming. The male students were often sent out as cheap labour for farmers harvesting produce or constructing buildings. They were also employed to construct buildings in the community. Girls would be sent out for periods of time “on service” as cheap labour for families in the region where they would work as nannies or help in family homes. Battleford Industrial School was run by the Anglican Church with Department of Indian Affairs / Government of Canada funding from 1883 to 1914 when it was closed.\nThe school was one of three industrial schools opened by the Government of Canada in the early 1880s. The senior officials of the Department of Indian Affairs arranged for various religious denominations to administer and operate the schools. The federal government delegated responsibility for the Battleford school to an Anglican minister.\nHistory\nEarly years (1883–1885)\nBattleford Industrial School opened December 1, 1883.\nThomas Clarke served as the first principal.  The school opened at Old Government House. Built in 1876, the building had been the seat of the capital of the North-West Territories from 1878 to 1883, at which time the capital was relocated to Regina, District of Assiniboia.\nThe Truth and Reconciliation Commission of Canada (TRC) stated that the school \"marked a turning point in Canada's direct involvement in residential schooling for Aboriginal people.\" Within a year of the Battleford school opening, two other government-funded schools, the High River Industrial School and Qu'Appelle Industrial School, had begun operations.\nThe TRC linked the creation of the Battleford, High River and Qu'Appelle schools to a 1879 report authored by Nicholas Flood Davin. Now known as the Davin Report, the Report on Industrial Schools for Indians and Half-Breeds was submitted to Ottawa on March 14, 1879, and made the case for a cooperative approach between the Canadian government and the church to implement the \"aggressive assimilation\" pursued by President of the United States, Ulysses S. Grant. Prior to the opening of the school the government's involvement with residential schools had been limited to providing grants to boarding schools operated by churches.\nImpact of the North-West Rebellion (1885)\nStaff and students abandoned the school during the North-West Rebellion of 1885, and the building was used for a time as barracks by the military. Indigenous people damaged the interior of the school in the Looting of Battleford during the rebellion. Later that year on November 27 the students were taken to Fort Battleford to witness the hanging of eight Indigenous men convicted of murder during the uprising. Most of the students were from the Ahtahkakoop, Mistawasis, and John Smith reserves.\nGrowth and development (1885–1900)\nThe school had less than 30 students when it first opened. They were taught trades related to agriculture, carpentry, and blacksmithing. Academic courses were reading, writing, and English. The school grew to over 100 students by the early 1900s. A girl's wing was added to the school. Students typically spent half of the day in standard school classes and the other half of the day engaged in some form of manual labour. For the girls, this included baking, laundry, and cleaning. For the boys, they would be involved in blacksmithing, carpentry, shoemaking, printing, and farming under the tutelage of dedicated instructors and hired teachers.\nA new east wing was added in 1889.\nDecline and closure (1900–1914)\nBy 1912 attendance at the school had dropped to 35 students and Duncan Campbell Scott, superintendent of Indian Education at the Department of Indian Affairs, believed that the school was no longer useful. The school had the capacity to accommodate 150 students. It was officially closed two years later on May 31, 1914. After its closure, many Indigenous children from around the Battlefords were sent to different schools in Saskatchewan, including Thunderchild Residential School at Delmas.\nThe building then became the Seventh-day Adventist Battleford Academy from 1916 to 1931 with enrolments of between 114 and 160 students. A farm of  was attached.\nFrom 1932 to 1972 it was the Oblate House of Studies and the St. Charles Scholasticate (seminary) which closed in 1972. The Oblates left the building in 1984. Old Government House was designated a national historic site of Canada in 1973. The building was destroyed by fire in 2003.\nCemetery\nThe Battleford Industrial School has a cemetery located 700 metres due south of the site of the school. A 1974 excavation of the site revealed that 72 people were buried in the cemetery. The Battleford Industrial School Cemetery was marked with a cairn, chain fences, and numbered grave markers on August 31, 1975. The cemetery was noted at page 119 in Volume 4 of the Truth and Reconciliation Commission of Canada final reports:  during summer 1974.]]\nIt is unknown exactly how many children died at Battleford Industrial School during its operation. Seventy-four bodies were found to be buried in the Battleford Industrial School Cemetery when the site was exhumed in 1974 by five anthropology students working with Professor Patrick Hartney from the University of Saskatchewan: Marlyss Anderson of Naicam, Dianne Carlson of Saskatoon, Joan Beggs of Weyburn, Jane Plosz of Canora, and Jean Prentice of Abbey. Records were found for approximately fifty of the students and others buried there by the Anglican Church of Canada. A cairn was erected in 1975 bearing the names of identified students and people buried in the cemetery. There are names of other students that died in Battleford Industrial School that are identified in the student newsletter and the local newspaper which are not on the cairn. Similarly, the historical record indicates that in the earlier days of the school’s operation, students nearing death were often sent home to their families to die and be buried in their home communities.\n}}\nIn 2019 the cemetery was designated provincial heritage property by the Government of Saskatchewan.\nNotable alumni\nAlex Decoteau - Olympic athlete and the first Indigenous police officer in Canada, joining the Edmonton Police Service in 1911. He died serving in World War I in 1917.\nMonument\nOn September 27, 2024, a monument commemorating the school was unveiled in North Battleford by Lieutenant Governor of Saskatchewan Russell Mirasty. The monument was created by Saskatchewan artist Lionel Auburn Peyachew and consists of a bronze sculpture of Annie Peyachew, a former student of the school who died in 1911 at the age of seven.\nSee also\n* Canadian Indian residential school system\n* List of residential schools in Canada\nReferences\nExternal links\n*[http://www.bac-lac.gc.ca/eng/discover/aboriginal-heritage/Pages/residential-schools-photo-sets-sk.aspx Residential Schools: Photographic Collections - Saskatchewan]\n*[https://web.archive.org/web/20130611193904/http://www.collectionscanada.gc.ca/aboriginal-heritage/020016-2108-e.html Aboriginal Documentary Heritage (Examples of students handwriting]"
    }
  ]
}