{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Welfesholz__disambig_1\n\n|\nplace=Welfesholz, present-day Saxony-Anhalt, Germany|\nresult=Saxon victory|\ncombatant1=Duchy of Saxony|\ncombatant2=Holy Roman Empire|\ncommander1=Lothair of Supplinburg|\ncommander2=Hoyer of Mansfeld (†)|\nstrength1=|\nstrength2=|\ncasualties1=|\ncasualties2=|\n}}\nThe Battle of Welfesholz was fought on 11 February 1115 between the Imperial army of the Emperor Henry V and a rebellious Saxon force led by Lothair of Supplinburg, who would later become the Holy Roman Emperor.\nBackground\nHenry V, scion of the Frankish Salian dynasty and uncontested King of the Romans since 1106, had inherited both the Investiture Controversy and the Saxon conflict from his father Henry IV. In 1110 he moved to Italy and, after negotiation failed, captured Pope Paschal II and several cardinals to enforce his coronation as Holy Roman Emperor. Having returned from Rome he was immediately excommunicated by the papal legate in Germany Cuno of Praeneste and again by Archbishop Guy de Vienne, the later Pope Callixtus II. His excommunication encouraged the Imperial princes in their rising against the emperor—most of all the Saxon Duke Lothair of Supplinburg and Archbishop Adalbert of Mainz, Henry's long-time supporter who after his investiture had deserted him.\nHenry entrusted the Saxon affairs to his field marshal Count Henry of Mansfeld, a Saxon noble himself. However, though he had Adalbert imprisoned at Trifels Castle and forced Lothair to submit himself after a court hearing at the Imperial Palace of Goslar, the smouldering Saxon conflict broke out again in March 1113 over the succession in the Thuringian territories left by late Count Ulric II of Weimar and Orlamünde. In order to create a base of power of his own, Henry had made attempts to confiscate the county as a ceased fief but met obstinate resistance by Ulric's heir, the Count Palatine of the Rhine Siegfried, son of the Ascanian count Adalbert II of Ballenstedt. The insurgents gathered under the lead of the Osterland count Wiprecht of Groitzsch and the Thuringian count Louis the Springer, but were repulsed by Henry's troops under Mansfeld in a battle at Warnstedt near Thale. Wiprecht was captured and at first sentenced to death for high treason. Later he was reprieved, imprisoned at Trifels and divested of his possessions, which passed to the House of Mansfeld.\nThe next year Duke Lothair had to attend Henry's wedding with Matilda of England in a hairshirt. Subdued though not deposed, he had continued intriguing against Henry, who saw himself confronted with the increasing opposition of the Imperial princes. In October 1114 the conflict again culminated in violent fights, when Rhenish insurgents led by Archbishop Frederick I of Cologne had attacked the Imperial troops in October 1114 at Andernach.\nBattle\nMeanwhile, several nobles like the deposed Duke Henry of Lower Lorraine and the Saxon bishop Reinhard of Halberstadt, disgusted by Henry's haughty behaviour, had joined the insurgents. According to the chronicles of Pegau Abbey, on 10 February 1115 the Imperial forces gathered at the Kaiserpfalz of Wallhausen and moved about  towards Welfesholz (today part of Gerbstedt in Saxony-Anhalt) to meet the united Saxon troops led by Duke Lothair, with first skirmish occurring already on the same evening.\nThe next day Henry's commander Hoyer of Mansfeld started an offensive whereby he was killed in a sword combat by the young robber knight Wiprecht II, son of the arrested Count Wiprecht of Groitzsch. The incident decided the battle: the tackling Saxon armies of Lothair were victorious, forcing Henry's troops to take flight. In his 12th century Chronica Slavorum the Saxon chronicler Helmold described the battle as \"the largest encounter in our time\".\nAftermath\nThe emperor's power to rule Saxony was denied, the Bishop of Halberstadt even refused a Christian burial of the killed enemies. In November, the Mainz citizens enforced the release of Archbishop Adalbert. However, Henry could still rely on the loyal support by his Hohenstaufen nephew Duke Frederick II of Swabia and his brother Conrad III. When the emperor again moved to Italy for the inheritance of Countess Matilda of Tuscany the next year, Duke Frederick was appointed regent, which laid the grounds for the rise of the Hohenstaufen dynasty.\nContemporaneously, Lothair's position in Saxony was stabilized. Count Wiprecht of Groitzsch was released in 1117, he was appointed burgrave of the Magdeburg archbishop the next year. When Emperor Henry V vested him with the marches of Meissen and Lusatia in 1123, Duke Lothair opposed his former ally, expelled him and granted the marches to Conrad of Wettin and the Ascanian count Albert the Bear. When the Salian dynasty became extinct with Henry's death in 1125, Lothair, strongly backed by Archbishop Adalbert of Mainz, was elected King of the Romans against the Hohenstaufen duke Frederick of Swabia.\nThe fate of Count Hoyer of Mansfeld was perpetuated in a poem by Theodor Körner (1791–1813).\nReferences"
    }
  ]
}