{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Haditha__disambig_1\n\n| combatant1  =\n| combatant2  = 23px Al-Qaeda in IraqAnsar al-SunnaOther Iraqi insurgents\n| strength1   = ~1,000 marines\n| strength2   = Unknown\n| commander1  = Col. Stephen W. Davis\n| commander2  = Saeed Huwair (former army officer)\nHatim Muslim (Ansar al-Sunnah commander for western Anbar)\n| casualties1 = 21 killed1 wounded[http://icasualties.org/oif/prdDetails.aspx?hndRef=8-2005 Period Details]\n| casualties2 = 40 killed\n}}\nThe Battle of Haditha took place between U.S. forces and Ansar al-Sunna in early August 2005 on the outskirts of the town of Haditha, Iraq, which was one of the many towns that were under insurgent control in the Euphrates River valley during 2005.\nThe battle was initiated when a pair of three-man United States Marine Corps STA (Surveillance, Target, and Acquisition) teams in Haditha were surprised and overrun by a small insurgent force. All six men were found dead after the battle.\nTwo days after the killings, Marine forces launched Operation Quick Strike to disrupt insurgent presence in the Haditha area. On the second day of that operation, a Marine Amphibious Assault Vehicle hit a large roadside bomb, killing 15 out of the 16 on board.\nMarine snipers overrun\nOn the morning of 1 August 2005, a pair of three-man USMC Reserve STA teams on the outskirts of Haditha was attacked by a small insurgent force from the Ansar al-Sunna group and in moments was overrun. Five members of the unit were killed. One was missing and initially was hoped to have escaped. Later he was reported to have been seen alive but wounded and being driven through the streets of Haditha, handcuffed, by insurgents.\nOperation Quick Strike\nTwo days after the killing of the USMC sniper teams, around 1,000 members of the USMC's Regimental Combat Team 2 (RCT-2), along with Iraqi soldiers, started \"Operation Quick Strike\", which included efforts to find the insurgents responsible; however, the primary intent was to interdict and disrupt militants' presence in the Haditha, Haqliniyah, and Barwanah areas. The operation began when Marines and Iraqi soldiers moved into Haqliniyah, about seven kilometers southwest of Haditha. 40 insurgents were killed, including four in a Super Cobra helicopter gunship attack.\nOn the second day of the operation, a USMC amphibious assault vehicle, which was transporting men to the initial assault, hit a large roadside bomb. The vehicle was completely destroyed and 15 out of the 16 men that were inside it were killed, with only one occupant surviving. The sole survivor was a young man from Mississippi; among the killed was also an Iraqi civilian interpreter.\nAll but three of the marines killed were assigned to 3rd Battalion, 25th Marines (3/25). The marines not assigned to 3/25 were assigned to 4th Amphibious Assault Battalion. The driver of the vehicle was ejected when the amphibious assault vehicle (also known as \"amtracs\", \"'tracs\", \"tractors\" etc.) was thrown through the air. Though he did live he received severe burns on a majority of his body. Eleven of them were members of the battalion's Lima Company. The company had already lost twelve servicemen since the beginning of the war, including eight members in Operation Matador in May. In May, out of the 9 marines killed and 40 wounded during Matador, five killed and nine wounded were from the same squad of Lima company. During 2005, Lima Company was the workhorse of both RCT-2 and 3/25, participating in 15 regimental and battalion operations throughout their tour. The company saw combat from Hīt, Iraq in the east to Al-Qa'im in the west. During Operation Matador, all members of one squad were killed or wounded in 96 hours of fighting. By the end of their deployment the Ohio Marine battalion lost 48 marines and sailors and another 150 wounded out of a complement of 1,350 marines.\nSmall Craft Company USMC assisted in locating the bodies of the slain snipers and were engaged in a large fire fight on the east bank of the Euphrates River in the city of Haditha.\nAftermath\nOn 1 August 2005, Lima Company, 3/25 had detained two \"military-aged\" males in the home next to the site where the snipers had been killed and had found large quantities of blood in the house. Both these Iraqi males were flown to Al Asad Airbase for interrogation. In late August 2005, Lima Company, 3/25 conducted a raid on the same house and detained seven Iraqi males. A large weapons cache of small arms and explosives was discovered buried behind the house. These Iraqi males were also transported to Al Asad Airbase where six of them subsequently confessed to the killing of the snipers.\nIn September 2005 3rd Battalion, 1st Marines surrounded the Haditha Triad (Haditha, Barwanah, Haqlaniyah) and assaulted Haditha. The city was proclaimed to be another Fallujah-esque battle, i.e., heavy house to house fighting. 3/1 would hold the entire Triad area of Haditha, Barwanah, and Haqlaniyah until March 2006 when 3/3 relieved them. During 3/1's deployment, they found over 1,000 caches, detained over 400 known insurgents and lost four marines during their entire deployment.\nIn early 2006, eight Iraqi men involved in the sniper incident were tried by an Iraqi court in Baghdad, found guilty, and executed. This raid is referenced in the A&E documentary Combat Diary: The Marines of Lima Company which premiered in May 2006.\nReferences\nExternal links\n*\nSee also\n*Haditha killings"
    }
  ]
}