{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Firaz__disambig_1\n\n| place             = Mesopotamia\n| result            = Disputed (see )\n| territory         =\n| combatant1        = 20px Rashidun Caliphate\n| combatant2        = 20px Sasanian Empire Byzantine Empire\n| commander1        = Khalid ibn al-Walid\n| commander2        = Hormozd Jadhuyih\n| strength1         = 500–800 men (modern estimates)\n| strength2         = Unknown, possibly slightly more (modern estimates)\n| casualties1       =\n| casualties2       =\n| units1            =\n| units2            =\n}}\nThe Battle of Firaz () also known as Battle of Firad, took place around January 634 between the Rashidun Caliphate and the combined armies of the Sasanian Empire and the Byzantine Empire.\nBackground\nBy the end of 633, the Muslims were the masters of the Euphrates valley. In this valley, Firaz at the outermost edge of the Persian Empire still had a Persian garrison. Khalid decided to drive away the Persians from this outpost as well fearing that the Persians would execute a well planned re-invasion of lost territory. He marched to Firaz with a Muslim force and arrived there in the first week of December 633. Firaz was the frontier between the empires of Persia and Byzantium, and the garrisons of the Persians as well as the Byzantines were cantoned there. In the face of the Muslims, the Byzantine garrison decided to come to the aid of the Persian garrison.\nEngagement\nKhalid gave the enemy the option to cross the Euphrates. As soon as the enemy had crossed the Euphrates, Khalid commanded the Muslim force to go into action. The united forces of the Persians and the Byzantines had the river at their back. At Firaz, Khalid adopted the same tactics as he had adopted at Mazar. As the front ranks of both the forces committed themselves in the fighting, Khalid fixed his enemy on either flank with the help of his rear wings. Making a swift movement, the Muslims dashed for the bridge on the river, and succeeded in occupying it. The enemy was thus held in a pincer movement.\nAftermath\nSir William Muir noted that the casualties of the coalition army \"must have been great, for tradition places it at the fabulous number of a hundred thousand\" as the remaining fleeting soldiers were pursued and cut down by the cavalry of Rashidun.\nAccording to Peter Crawford, Heraclius could not have provided a garrison along the Euphrates of such a scale so that the opposition against Khalid in Firaz numbered tenfold against the Arab force and it is possible the Byzantines at that point would have still seen the Arab incursion as a mere raid against Persian land. According to Michael Morony, professor of history at UCLA, Khalid won the battle.\nKonstantinos Takirtakoglou, professor of Byzantine history believes that, firstly, a very limited contingent of the Sassanids and their allies participated in the battle, most likely their survivors of the defeats before last and retreated to the safety of the Byzantine fortress, against which Khalid went on the orders of the caliph to march to Syria, but was defeated and forced to undertake a dangerous trek through the desert rather than a safe one traveling along the river. However, this defeat was disguised by Arab contemporaries as a legendary victory with one hundred thousand dead enemies.\nDespite accounts of the victory against combined Byazantine-Sasanian forces, modern research doubts the existence of Persian forces at the battle, and if there were any, they were \"most likely disorganized Persian and Christian Arab elements which escaped to a region guarded by a Byzantine garrison after the earlier Persian defeats.\" Furthermore, the account of the battle contains suspect elements, such as the number of casualties and the absence of reference to the names of commanders of the allied forces, which ultimately \"gives rise to the suspicion that Islamic historiography has attempted to cover up another, less glorious, event.\" Khalid may have in fact been defeated at the battle.\nIslamic legend\nThere is an Islamic legend, which runs as follows:\nAt the beginning of the battle of Firaz when the odds appeared to be against the Muslims, Khalid undertook an oath that if he was victorious, he would undertake pilgrimage (Hajj) to Mecca, the House of God. After the victory of Firaz, Khalid stayed at Firaz for some days and made the necessary arrangements for the administration of the territory. In January 634, while a garrison was kept at Firaz, orders were issued to the main Muslim army to return to Al-Hirah. Khalid stayed behind with the rear of the army. As the army moved forward on the road to Al Hirah, Khalid separated himself from the army and took an unfrequented route to Mecca with a small escort. Khalid reached Mecca in time to perform the Hajj. After performing the pilgrimage secretly and fulfilling his vow, Khalid and his party rode back to Al Hirah. Before the last contingent of the main army from Firaz had entered Hirah, Khalid was also there, as if he had been all the time with the rear guard.\nReferences\nSources\n*[https://web.archive.org/web/20041210000537/http://www.swordofallah.com/html/bookhome.htm A.I. Akram, The Sword of Allah: Khalid bin al-Waleed, His Life and Campaigns Lahore, 1969]\n*\n*\n*\n*\n*\n*"
    }
  ]
}