{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Näfels__disambig_1\n\n| result      = Swiss victory\n| combatant1  =  Old Swiss Confederacy\n*\n*\n*  Schwyz\n| combatant2  = 15px Duchy of Austria\n| commander1  =\n| commander2  =   Donat von Toggenburg\n| strength1   = ~400\n| strength2   = ~5,000\n| casualties1 = 54\n| casualties2 = Several hundred\n}}\nThe Battle of Näfels was fought on 9 April 1388 between the Swiss canton of Glarus, supported by its allies of the Old Swiss Confederation, and the Duchy of Austria ruled by the House of Habsburg. It was a decisive victory for Glarus and led to its independence from Habsburg rule. The battle was the last of the Swiss-Austrian conflicts that stretched through most of the 14th century.\nBackground\nA few weeks after the Battle of Sempach on 9 July 1386, the Swiss Confederation captured the Habsburg village of Weesen on the Walensee. The following year, Glarus rose up against the Habsburgs and destroyed Burg Windegg. Then, on 11 March 1387, the valley council declared itself free of Habsburg control.\nIn response, on the night of 21–22 February 1388, an Austrian army attacked Weesen and drove off the Swiss forces. At the start of April, two Austrian armies set out to isolate Glarus from the rest of the Confederation. The main army, with about 5,000 men, marched toward Näfels under the command of Count Donat von Toggenburg and Knight Peter von Thorberg. A second column, with about 1,500 men under the command of Count Hans von Werdenberg-Sargans, advanced through the Kerenzerberg Pass.\nBattle\n, the patron saint of Glarus, which according to tradition was used in the Battle of Näfels]]\nOn 9 April 1388 the main Austrian army, under Toggenburg and Thorberg, attacked and captured the fortifications (letzi) around Näfels. The garrison, comprising about 400 troops from Glarus and a few dozen troops from both Schwyz and Uri, held out for a short time, but was forced to withdraw into the hills. As they retreated, the Austrian army spread out to plunder the villages and farms. The Glarners then emerged from the snow and fog to take the Austrians by surprise as they were preoccupied with looting.\nFollowing a brief battle, the disorganized Austrians broke and fled toward Weesen, but the collapse of the bridge over the Maag or Weeser Linth dropped much of their army into the river where they drowned. Seeing the destruction of the main column, Werdenberg-Sargans' army retreated to the village of Beglingen (now in the municipality of Mollis).  The Swiss had 54 men killed, who were buried at the parish church of Mollis. Habsburg losses are less well known, but are estimated to be between several hundred and 1,700 killed. On 29 November 1389, the Abbot Bilgeri had about 180 bodies moved from the battlefield and buried at Rüti Abbey in the choir of the present Rüti Reformed Church.\nAftermath\nIn 1389, a seven-years' peace was signed at Vienna, leaving the Confederation in undisputed possession of all the territory it had acquired in the recent war.  In the same year, the first Näfelser Fahrt, a pilgrimage to the site of the battle, was held.  This pilgrimage, which still occurs, happens on the first Thursday in April and is in memory of the battle. The pilgrimage played an important role in the creation of the unified canton of Glarus.\nSee also\n* Battles of the Old Swiss Confederacy\nReferences"
    }
  ]
}