{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Ladeira da Velha\n\nThe Battle of Ladeira da Velha was fought on 2 August 1831, between Portuguese Liberal and  Miguelist forces on the island of São Miguel in the Azores, as part of the larger Portuguese Civil War. It resulted in a Liberal victory, that led to the control of the island of São Miguel and a wider victory of Liberal forces in the islands of the Azores.\nBackground\nSince the Battle of Praia in 1829, the island of Terceira, had become the center of Liberal activities in Portugal. While the Miguelists still maintained control over São Miguel and the Portuguese mainland, insurrections on the remaining islands chipped away at their control of the archipelago.\nOn 28 July 1831, around 6:00 in the afternoon, two divisions comprising irregular forces, infantrymen and artillerymen were assembled at the Relvão in Angra. The commander, António José Severim de Noronha, Count of Vila Flor, proclaimed his intention to retake the island of São Miguel for Liberal forces, the Charter and Queen Maria II, referring to their successes in recapturing the islands of São Jorge, Pico and Faial, and the resulting spontaneous movements on the islands of Graciosa, Flores and Corvo. On 30 July 1831, around midday, the Liberal forces embarked and the flotilla wayed anchor around 5:00 in the afternoon for São Miguel.\nBattle\nOn 1 August 1829, a liberal force under the command of Count of Vila Flor, disembarked at the mouth of the ravines east of Ponta da Ajuda, which were unguarded, on the northern coast of São Miguel (near the parish of Achadinha). Miguelist forces upon sighting the flotilla, marched forces from Ribeira Grande and a contingent from Furnas.\nLiberal forces encamped in the hills above Maia, near Ribeira dos Moinhos on the first night. In the morning, they continued their march, crossing Maia, where the inhabitants had abandoned their homes. They encountered few obstacles and advanced to Porto Formoso, whose fort and other defenses were also abandoned.\nTwo days later a battle was fought at Ladeira da Velha near Porto Formoso, between the invading Liberal army and troops loyal to King Miguel.\nThe battle ended in a victory for the Liberals, which enabled them to firmly establish their control over the entire archipelago of the Azores. They used the islands as a base to invade the Portuguese mainland the next year, landing at Mindelo on 8 July 1832.\nReferences\n;Citations\n;Bibliography\n*\n*[https://www.geocaching.com/geocache/GC556F6_a-batalha-da-ladeira-da-velha-s-miguel-azores?guid=8d8c0c0e-7427-4ca0-b5a4-558b98068a2d A Batalha da Ladeira da Velha (S.Miguel - Azores).]"
    }
  ]
}