{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Britain Day\n\n| combatant2  =\n| commander1  =  Hugh Dowding| Keith Park}}\n| commander2  =  Hermann Göring| Albert Kesselring}}\n| units1      =  Fighter Command\n| units2      =  Luftflotte 2\n| strength1   =\n| strength2   = 1,120 aircraft (620 fighters and 500 bombers)\n| casualties1 =\n| casualties2 =\n|campaignbox =\n}}\nBattle of Britain Day is the day on which a large-scale aerial battle in the Battle of Britain took place.\nOn Sunday 15 September 1940, the Luftwaffe launched its largest and most concentrated attack against London in the hope of drawing out the RAF into a battle of annihilation. Around 1,500 aircraft took part in the air battles, which lasted until dusk. The action was the climax of the Battle of Britain.\nRAF Fighter Command defeated the German raids; the Luftwaffe formations were dispersed by a large cloud base and failed to inflict severe damage on the city of London. In the aftermath of the raid, Hitler postponed Operation Sea Lion. Having been defeated in daylight, the Luftwaffe turned its attention to the Blitz night campaign, which lasted until May 1941.\nBackground\nIn June 1940, the  had conquered most of Western Europe and Scandinavia. At that time, the only major power standing in the way of a German-dominated Europe was the British Empire and the Commonwealth. After having several peace offers rejected by the UK, Adolf Hitler ordered the  to destroy the RAF in order to gain air superiority or air supremacy as a prelude to launching Operation Sea Lion, an amphibious assault by the  onto the British mainland.\nThe Battle of Britain began on 10 July 1940, when the first  bomber fleets began attacking convoys and Royal Navy forces in English ports and the Channel. The results were positive and the Germans succeeded in forcing the British to abandon the channel convoy route and to redirect shipping to ports in north-eastern Britain. With this achieved the  began the second phase of its air offensive, attacking RAF airfields and supporting structures on the British mainland. The codename of the offensive was  (\"Operation Eagle Attack\"). On 12 August, it flew its first missions in this regard. On 13 August, the  carried out its largest attack to date on the mainland. Christened  (\"Eagle Day\"), the attack was a failure. Nevertheless, the raids continued, at great cost to both sides. The impact of the German offensive on RAF airfields and Fighter Command is disputed. Some historians believe that the attacks were not having much effect and that the Germans were losing the attrition battle, while others believe the RAF was faltering.\nEither way, Hitler was dissatisfied with the lack of progress being made. Prompted by an RAF raid on Berlin in late August 1940, he ordered the  to concentrate its attacks upon London. It was thought the move would draw RAF Fighter Command up into a large, decisive battle. Initially, the change in strategy caught the British off-guard. The first daylight attack of this type occurred on 7 September and caused extensive damage and civilian casualties. Some  of shipping was damaged in the Thames Estuary and 1,600 civilians were killed or injured. Still, Hitler was critical of the  and its failure to destroy Fighter Command quickly. He dismissed over-optimistic reports from the  (OKL or High Command of the Air Force), particularly the Chief of the  general staff Hans Jeschonnek, who asserted the RAF was on its last legs. Confident the RAF was nearly defeated, Jeschonnek requested terror bombing to be enacted as a final blow. Hitler refused, and only allowed attacks on industry, communications and public utility targets.\nOver the next few days, bad weather prevented more large attacks. On 9 and 11 September, only smaller raids were carried out. The respite gave Hugh Dowding, AOC (Air Officer Commanding) Fighter Command, the chance to prepare and reinforce his forces. The British, possibly through the use of Ultra intelligence, recognised the German change in strategy and duly prepared for further attacks on the capital. Ultra's contribution to the preparations for 15 September is disputed, as intelligence from Ultra at this stage in the war tended to be fragmented, and as the Germans launched attacks whenever there was clear weather, it would not have been difficult for RAF Fighter Command to have predicted an attack on 15 September, which was to be a clear day.\nGerman strategy\nOn the afternoon of 14 September, Hitler and his command held a conference at the Reich Chancellery in Berlin to discuss the future direction of the war. Göring was not present; he was inspecting  units in Belgium. Erhard Milch replaced him. Hitler praised the attacks which had caused heavy damage to the RAF and London. He blamed the failure to achieve more decisive results on the weather. Nevertheless, it was clear to Hitler that victory had still not been attained by the . Under those circumstances, Operation Sea Lion could not take place.  Erich Raeder, commander-in-chief of the , agreed. He argued that Sea Lion should only be carried out as a last resort regardless of gaining air superiority.\nHitler wanted to maintain the threat of invasion by continuing air attacks on military targets in the British capital. Hans Jeschonnek still pushed for attacks on civilian morale. He argued that military and civilian industries were located too far apart to achieve a collapse of morale by attacking the former. Instead, he pressed for attacks against residential areas. Hitler refused. He ordered that only military targets in London were to be attacked.\nThe  intimated that a period of good weather was now due over France, Belgium and southern Britain. They prepared for an attack along the lines set by Hitler. Staff officers of  2 based in Brussels began planning for a two-pronged offensive on 15 September.\nThe targets were purely military. The first target selected was the Battersea railway station on the West London Extension Railway in Battersea district. The tracks were 12 abreast in some places and linked London to the heavy industries of the West Midlands and other industrial cities on the north and south-east of Britain. The conglomeration of lines included rail-over-rail bridges which were vulnerable to air attack. This was what air planners referred to as \"choke points\", which if cut could erode enemy communication efficiency.\nThe second target, for the larger second attack during the afternoon would be the dock areas of the Thames Estuary including the warehouse of the East End of London, Surrey Commercial Docks, south of the river, and Royal Docks (Royal Victoria Dock, West India Docks, Royal Albert Dock and King George V Dock).\nHitler was satisfied. The reasoning of the  seemed sound. Should the bombing achieve its aim, it offered considerable strategic value. The strike against London meant that most of the fighting on 15 September would take place between  2 under Albert Kesselring and Keith Park's No. 11 Group RAF.\nIntelligence\nThe strategy could only be valid if intelligence assessments were correct. To German intelligence, it seemed as if the RAF might be on the verge of collapse. The attacks on London, thus far, seemed to confirm the assumption. None of the  bomber formations had encountered the well organised, effective and ferocious defence that had characterised the battles in August 1940. If the German intelligence was correct, then by striking against vital choke points in London that the RAF would be forced to defend, the  had the opportunity to destroy the remaining RAF fighter forces. Not only would the attacks allow for the attainment of air superiority, they would eliminate a vital rail network, destroy shipping and supplies brought in from North America, and affect civilian morale by demonstrating London's vulnerability to air power.\nThe policy of attacking London after the successful 7 September raid quickly became counter-productive, and in this matter the  suffered from serious misjudgement resulting from their intelligence service. The crews had been told the RAF was down to its last reserves and that one more assault would clinch victory. This was incorrect, which meant bomber crews would be in for a shock on 15 September. The RAF had been given much needed rest after intense operations by the shift in German strategy. British radar, having been virtually untouched, was still able to follow the slow German build-ups over France long before the first German aircraft reached British airspace. It would give the rested Fighter Command units plenty of warning. Moreover, by choosing to attack London, it exposed the bombers to greater danger by forcing them to fly greater distances in hostile air space. German crews would be forced to fight all the way to London and back. As it happened, all the German bomber units were at least intercepted on 15 September, and were then scattered as they withdrew.\nBritish strategy\nAir Vice-Marshal Trafford Leigh-Mallory and Squadron Leader Douglas Bader came to play significant roles in the September fighting. Bader commanded 242 Squadron flying Hurricanes in Leigh-Mallory's 12 Group, which defended the vital industrial targets in the West Midlands. A source of frustration to Leigh-Mallory was the way in which his squadrons were used. During Luftwaffe attacks on south-east England 12 Group units were tasked with protecting 11 Group sector stations north of the Thames Estuary, while Leigh-Mallory believed his units should be in action south of the Thames. Mallory also criticised the way Park and Dowding were conducting the battle. The popular image of outnumbered Spitfires and Hurricanes meeting an enemy with huge numerical strength preyed upon his mind. He favoured a reverse of the image.\nBader was bored and frustrated at being left out of the major actions in the south. To Bader, it did not make sense for 12 Group to apparently sit idle while 11 Group suffered heavy losses and fought at a numerical disadvantage. Bader advocated scrambling 12 Group fighters as soon as German aircraft were detected forming up over France or Belgium. He asserted 12 Group was quick enough to reach  over the Thames Estuary before the enemy reached the area. He planned to use large forces (three to five squadrons) to engage the enemy. Should this succeed, 11 Group, following up attacks, might have found broken enemy formations whose crews had lost the determination to press on to their targets. Bader implied that this might reduce the losses of fighter pilots in 11 Group. After the war, Bader insisted that both he and Leigh-Mallory wanted the Big Wing tactic enacted in 12 Group only. They both believed, according to Bader, that it was impractical to use 11 Group as the command was located too close to the enemy and would not have enough time to assemble.\nDowding saw 12 Group as the protector of the Midlands and a reserve for 11 Group. Mallory and Bader wanted to ignore both the defence of the Midlands and keeping a reserve in order to commit 12 Group to battle. In essence, they proposed the opposite of Dowding and resolved to commit the reserves before the front-line units. While this method might have spared 11 Group, it had its problems. Although Mallory and Bader wanted to stop the enemy before it hit RAF airfields, the amount of time it took to position large formations for interception meant that the Big Wing often failed to achieve this. Instead, they engaged the enemy as he withdrew. Prompted by a supporting comment from Leigh-Mallory, to the effect that it did not matter when an interception was made, as long as it accounted for a large number of enemy aircraft, Bader announced that he would rather destroy 50 German bombers after hitting their targets than 10 before. The argument was strong; crippling losses would act as a deterrent, so that damage sustained on an occasion when the Germans did get through would have to be offset against later occasions when they did not even care to try.\nThe counter-arguments were much stronger. The assumption that the Germans would be put off by losses was wrong; it would have taken severe losses for the OKL to change its mind on target selection. The targets were also vital. The airfields themselves supported the squadrons in the field, while the loss of the vital sector-stations could well have crippled the defence system. Thus the possibility of allowing the bulk of the German bombers to reach their target unscathed was unacceptable. The idea that the Big Wing could inflict heavier losses than had been achieved up until then was based on an overestimate of the numbers of aircraft shot down by the Big Wing. Leigh-Mallory and Bader, together with their supporter Sholto Douglas, the deputy Chief of Air Staff, had based their opinions on claims made by RAF units in battle. However, particularly when a large number of aircraft were engaged, it was possible for the same aircraft to be claimed by more than one pilot. As a result, the RAF claimed 100 or more German aircraft shot down in one day on five occasions, while analysis of Luftwaffe losses has shown that there were only four occasions on which the Luftwaffe lost more than 50 aircraft, and never did they lose 100 or more in a day. Nevertheless, while it is not known whether Mallory and Bader were aware that the claims of the RAF and Big Wings were exaggerated, they certainly tried to use them as a potent tool with which to remove Park and Dowding from command and pursue the Big Wing tactic.\nNon-attrition\nKeith Park, with endorsement from Dowding, opted for the opposite strategy. Park maintained that it was unimportant to inflict large losses on the Germans in comparison to safeguarding his own forces. Park believed the Germans would give up if they could not achieve their aim of air superiority. This, simply put, meant avoiding the destruction and/or depletion of Fighter Command, as it was the primary factor in England's air defence. This would be achieved by sending small numbers of fighters to intercept, minimising losses in the air. By remaining to offer undiminished and constant air opposition, the RAF ensured the Luftwaffe could not win. As long as some sort of cost was imposed before the enemy dropped his bombs and impaired the defence system, the RAF could remain intact to meet the threat again the next day. To this end, Park favoured the 10 bomber kills before the attack, rather than the 50 shot down after it. The strategy suggested an enemy would give up if he felt he was getting nowhere. For even while his losses remained moderate, it would be senseless to suffer those casualties for no return. Park and Dowding's strategy, under the circumstances, was the wiser choice.\nForces involved\nforces\nThe  had suffered heavy attrition since the beginning of the Battle of Britain. Just over a month earlier, on 17 August, it had possessed 2,226 operational aircraft. By 7 September, it had 1,895 aircraft, a drop of 15 percent. Still, most of the losses were being made good by production. During the battle, the Luftwaffe had undergone a major reorganisation.  5 in Norway had sent most of its Messerschmitt Bf 110 and medium bomber units ( or Bomber Wings) to  2 and 3.  3 then passed most of its Messerschmitt Bf 109 units to  2, which was based in the Netherlands, Belgium and France.\nAccording to the  order of battle dated 7 September, the nearest date covered by the list, the three Air Fleets contained 1,895 aircraft.  2 had 1,311 machines, including 533 Bf&nbsp;109s, 107 Bf&nbsp;110s, 51 reconnaissance and 484 medium bomber aircraft. A further 120 Junkers Ju&nbsp;87 dive bombers were on the order of battle, but were not used.\nreadiness was less than ideal. In August, 211 pilots had been killed, including 105 fighter pilots and 91 bomber pilots. Missing pilots amounted to 132 fighter and 94 bomber pilots alone, with a further respective loss of 47 and 28 wounded. The effect on operation-ready crews was significant. Messerschmitt Bf&nbsp;110 units had 60% of crews against authorised strength. For bomber units, it was 65%, while Bf&nbsp;109 units had 81% of crews ready, a 5% increase from the 76% level in the first week of September. However, by 14 September, Bf&nbsp;109 units possessed only 67% of crews against authorised aircraft. In Bf 110 units, it fell to just 46%, and in bomber units it dropped to 59%. One week later, the figures were 64, 52 and 52% respectively.\nRAF forces\nIn the six weeks of intensive combat, RAF strength had been maintained to an extent far greater than the  intelligence had believed possible. On the evening of 14 September, Fighter Command could muster 269 Supermarine Spitfire and 533 Hawker Hurricane fighters. The two key groups could put up just over 500 fighters: No. 11 Group RAF had 310 fighters, including 92 Spitfires and 218 Hurricanes; No. 12 Group RAF could field 85 Spitfires and 109 Hurricanes. Should No. 10 Group RAF come into the battle, a further 48 Spitfires and 78 Hurricanes could be committed. Compared with 17 August, there were just 22 fewer Spitfires and Hurricanes.\nDuring the battle, the RAF had suffered a serious loss of experienced pilots. In mid-September, Fighter Command could call upon 1,492 operational pilots against an establishment of 1,662 – a deficiency of 10%. Many of the pilots were ineffective unless led into battle by experienced men. Dowding's policy was to move in fresh squadrons from quieter areas to replace losses in the units in the south-east as they became exhausted. By early September, the system was breaking down as squadrons were becoming depleted before fresh units could be formed and take their place.\nReluctantly, Dowding defined three categories, A, B and C. Category A units were to bear the brunt of the fighting, and were to be kept at full strength in aircraft and pilots. Only if the A units suffered exceptionally high losses would they be replaced. B units were relief units, to be maintained at operational strength and only used if absolutely necessary. C units were generally stripped down to just five or six pilots. These units were devoted to training new pilots. Although not fit for fighter-fighter action, they could defend quieter areas. The system potentially could have had fatal results for Fighter Command, with C units becoming less and less effective. But the system had not been running long enough by 14 September for it to have a serious impact on Fighter Command's strength. The replacement units were sufficient in number and effectiveness to continue to replace exhausted units. By 15 September, the C units could still give a good account of themselves in battle.\nPreliminary engagements\nThe  began its eighth consecutive night of bombing London on 15 September. Soon after midnight, 13 unidentified Dornier Do&nbsp;17 light bombers attacked the capital. At 00:15 two Junkers Ju&nbsp;88s followed from  (KG&nbsp;51, or 51st Bomber Wing). A further 11 Heinkel He 111s from an unidentified unit bombed the city again at 00:50. At 02:00, five He 111s from Kampfgeschwader 4 (KG&nbsp;4) bombed the city. A full strike by the  had been planned, but bad weather had forced a cancellation after five He 111s had taken off. Most of the damage was done to residential areas in Fulham, Chelsea and Westminster. Around 19 people were killed and 31 injured. The heaviest casualties were caused when a bomb fell on a church in Chelsea, killing 14 and injuring 26. Small raiding forces bombed Cardiff, Bootle (in Liverpool), Leicester and Ipswich. At Bootle, only slight damage was done to rail tracks and facilities at West Alexandra Dock. At sea, a Heinkel He 115 floatplane attacked and sank the  freighter Mailsea River off Montrose with a torpedo. Soon after, the freighter Halland was sunk by the same method in the area. At 03:30, He 115s flew up the Thames Estuary and dropped magnetic anti-shipping mines. Further mines were dropped in the Bristol Channel, Liverpool Bay and Milford Haven and off Hartlepool, Berwick-upon-Tweed and Aberdeen. Though in later years, Britain's night-fighter defences would be highly sophisticated, in 1940 RAF night-fighter defences were still in their infancy. Most fighters lacked radar and radar was in any case short-range and unreliable. Instead, they flew outside the anti-aircraft guns' fields of fire on likely approach routes using the pilots' vision to locate enemy aircraft. Just 28 sorties were flown against the nocturnal raids.\nThere was also air activity over German-held territory. RAF Bomber Command flew 92 sorties against German invasion targets at Boulogne, Calais, Ostend, Dunkirk, and Antwerp. The remaining sorties were directed at Brussels marshalling yards, Hamm and Krefeld. One Armstrong Whitworth Whitley failed to return, being lost to ground fire over the Netherlands. A total of 157 sorties were flown overall. As a result of Bomber Command's operations, some 10–13% of invasion barges had been sunk.\nThe first combat in daylight began just after 08:00. A He&nbsp;111 from &nbsp;51 (Long-range Reconnaissance Group 51), based near Paris, was intercepted and shot down over the Channel by Hurricanes from No. 87 Squadron RAF. A Heinkel He&nbsp;59 air-sea rescue aircraft was dispatched, but found no trace of the Heinkel or its five crew.\nFurther flights were made by high altitude Ju&nbsp;88s. One photographed RAF Sealand, RAF Pembrey and RAF Woodward. It also managed to reach Manchester, Liverpool and Birkenhead without interception. Another managed to photograph the Thames Haven, RAF Netheravon, RAF Benson and the Royal Navy base at Chatham Dockyard. Interception of these high altitude aircraft was difficult, and none were lost on 15 September 1940.\nNoon attack: 10:10 to 13:00\nThe offensive got under way at 10:10 in the morning. Major Alois Lindmayr,  (Group Commander) of I./KG&nbsp;76, led the entire formation. Lindmayr was an experienced combat veteran, having won the Knight's Cross of the Iron Cross for his effective low-level attacks in France. III./ (KG 76) took off with 19 Do 17s from their base at Cormeilles-en-Vexin. At the same time,  to the north, I./KG 76 took off. Usually a  (Group) could field 27 bombers. After weeks of attrition, I./KG&nbsp;76 could put up only eight Do&nbsp;17s: the  had to field two  to do the work of one. Most of the Dorniers were in bad shape, worn down by intensive operations. The two groups rendezvoused at Amiens then proceeded to Cap Gris Nez to pick up their Bf 109 fighter escort. The attacks on Britain had caused heavy losses to the ; German crews and  experimented with innovative ways to defend themselves. One pilot,  Rolf Heitsch, had his Dornier fitted with an infantry flame thrower in its tail. If it failed to down a fighter that got too close, it might drive the enemy off: if it worked, it could be fitted to other bombers. After take-off, the formation broke up in cloud and was delayed for 10 minutes to allow reforming. Two bombers failed to do so and returned to base.\nBritish reaction\nInitially, the operations room at RAF Uxbridge was disturbed by a visit from Prime Minister Winston Churchill. Most of the plotting tables were bare, save for a few plots indicating German reconnaissance machines. Most of the Women's Auxiliary Air Force (WAAF) were relaxing, in spite of Churchill's presence (he had ordered that they not behave any differently). However, at 10:30 the first German aircraft triggered the alarm at Chain Home radar station at Dover. The filter room at Stanmore recognised the formation as hostile. The WAAF detailed group and sector commands throughout the south that 40-plus enemy aircraft were entering Kentish airspace.\nBy 11:04, Lindmayr's Dorniers had reached Calais. Wing Commander Lord Willoughby de Broke, Park's senior fighter controller, watched with the Prime Minister and Park as the Germans moved closer. De Broke had a problem of his own. He had no way of knowing which plots represented bombers and fighters. Bombers had to be intercepted, fighters could be ignored. The trick was to strike a balance and time the interception as well as possible. On one hand he had to scramble early and allow enough time to get into a favourable attack position; but on the other hand he had to avoid scrambling them too early lest the fighters run short of fuel before they met the enemy. Park joined de Broke. After a brief discussion he decided to commit several squadrons from RAF Biggin Hill. Park realised the raid could be a trap. Though the target seemed to be London, the aircraft, comprising 120–150 in number, may be an advanced guard of Bf 109s sent to clear the skies or disrupt fighter defences. Still, he gambled and sent nine squadrons into action at 11:15.\nNo. 92 Squadron RAF and No. 72 Squadron RAF scrambled Spitfires from Biggin Hill. Their orders were to cover the air space over Canterbury at . De Broke sensed by this time that nothing else was coming in. If this was the main attack, he decided it must be met with force. He ordered squadrons from RAF Northolt, RAF Kenley and RAF Debden to stand by. At 11:20, he ordered RAF Hornchurch and RAF North Weald and No. 10 Group's RAF Middle Wallop into the air. Park now had two squadrons over Canterbury, four over Biggin Hill and Maidstone with further back up of two squadrons over Chelmsford at .\nThe plan was for Nos. 72 and 92 to engage the high escort. No. 603 Squadron RAF would arrive on the scene just afterward and get at the close escort (JG&nbsp;3). The pair from North Weald would go to Maidstone, so if the bombers got through, they would run into them over London. Despite Park's reservations about Leigh-Mallory's Big Wing, he ordered that it was time for it to be tested. If the Germans attempted to use the Thames Estuary as a navigation aid, as so often before, fighters from 12 Group's RAF Duxford could meet them over Hornchurch at . They would have a  height advantage to the west of the bombers and attack out of the Sun, if Leigh-Mallory could get them there in time. The order was sent to Stanmore at 11:20 and Duxford scrambled No. 19, 310, 302 and No. 611 Squadron RAF. Bader, as No. 242 Squadron's commander, led the assembled Duxford Wing, composed of 56 fighters. They were airborne at 11:22.\nClose to contact\nThe Dorniers were supported by German fighter aircraft that had been sent out in advance of the main strike.  (JG&nbsp;27) and I./ (JG&nbsp;52) Bf 109s flew in toward London at , while  (JG 53) flew top cover over the bombers. Some 30  (JG 3) flew close escort. The bombers were travelling slowly, forcing the fighters to lower their flaps to stay with the bombers, which made them easy targets. They crossed the coast at Folkestone at 11:36. Fighters from II. (Demonstration Wing 2) were also to form part of the escort. They flew in advance of the main force to drop  bombs and then resume their role as fighters. The strong head wind slowed the Dorniers, which meant that the Germans took longer than hoped to reach the target, while burning up the Bf 109s' limited fuel supplies. Conversely, the wind sped up the RAF fighters coming in from the north.\nLG 2 took off as the bombers crossed the English coast. Even with bombs, the Bf 109s were expected to overtake the bombers and attack London a few minutes before the main raids began. Park interpreted the LG 2 raid as a major thrust and was determined to meet the \"second wave\" as he saw it. He scrambled six more squadrons but kept four reserve squadrons at Hornchurch and RAF Tangmere. As the forces closed, around 120 Bf 109s and 25 Do 17s were facing 245 Spitfires and Hurricanes.\nCombat\nPark's plan worked. The Biggin Hill squadrons, 72 and 92 Squadrons, made contact with the enemy over Canterbury. Arriving at , they found themselves  above the top covering German fighters (JG 53). Beyond Canterbury, they could also see KG 76 and JG 3 over Ashford. At 11:50, they attacked out of the sun. Taken by surprise, four or five of I./JG&nbsp;53's Bf&nbsp;109s were hit by the Spitfires. Spitfires of 92 Squadron tried to charge through the fighter screen to get at the Dorniers but were blocked. Soon afterwards, No. 603 Squadron joined the fight. Park had broken up the top level escort. Some 23 Hurricanes of Nos. 253 and 501 Squadrons arrived at the same height as the bombers and delivered a head-on attack. Lindmayr's crews were experienced and the formation held its nerve and remained intact. JG&nbsp;3 in turn attacked the Hurricanes, dispatching two from 501 Squadron. Northolt's No. 229 and No. 303 Squadron RAF were also arriving and engaged JG&nbsp;52. One of 239 Squadron's Hurricanes and a JG&nbsp;52 Bf&nbsp;109 collided. The bombers ploughed on and reached Lewisham. However, the formation was now isolated. The escorts were embroiled in dogfights all over Kent and half the RAF fighters were yet to engage. JG 53 were further engaged by No. 1, No. 46, No. 249 and No. 605 Squadron RAF. No. 605, led by Archie McKellar, broke away and delivered a 12-fighter attack, scoring some hits on the bombers. JG&nbsp;27, meanwhile, suffered two casualties, one possibly against No. 19 Squadron. It claimed only one British fighter that day. JG&nbsp;3 claimed two fighters for one loss.\nUp until that point, the Bf&nbsp;109s had successfully blocked attacks on the bombers. However, Park's tactics of attacking the Germans all along the route forced their fighters to use up fuel more quickly in dogfights. When the outskirts of London came into view, at 12:07, the Bf 109s began to break away and commence their return to France.\nThe North Weald squadrons, No. 504 and 257, engaged the Dorniers with 20 Hurricanes. One German pilot, Feldwebel Robert Zehbe, developed engine trouble and lagged half a mile behind the main bomber stream. His Dornier attracted a swarm of fighters. Eventually Ray Holmes of 504 Squadron, out of bullets, rammed the bomber, sending it into a dive. The Dornier's tail separated and its wings snapped off outboard of the engines. The bomber crashed onto the forecourt of London Victoria station. While diving, its bombs became detached and hit or landed near Buckingham Palace, damaging the building. Zehbe bailed out, landed near The Oval, and was severely wounded by a civilian mob. He was rescued by the British Army but died of his wounds. Holmes' Hurricane was badly damaged, crashing near the grounds of Buckingham Palace. Holmes bailed out injured, but survived.\nBader's Duxford Wing arrived directly over the target, and attacked while the Germans were on the bomb-run. Thirty seconds after the release of the bombs, they hit the target area, the Battersea rail lines next to Battersea Park on the Thames south bank. Each Dornier's payload of twenty  bombs carved a run  long and  wide. Some fell on the high-density civilian housing. The bombs missed Clapham Junction but fell across the rail network tracks that connected it to Victoria station north of the Thames and the main line heading north east on the south side of the river. The bombs cut the tracks in Battersea in several places, and a viaduct collapsed over some rails. Rail traffic was halted. Four unexploded bombs delayed repairs, but the rail lines were only out of action for three days.\n. The flame throwing device is just visible on the aft fuselage.]]\nWithin minutes, the Do 17 formation had been reduced to 15 aircraft, most of which were damaged. Six had been shot down and four were attempting to make a run for home. The remainder dropped their bombs and were met by a covering force of Bf&nbsp;109s and landed back in France without further combat. Meanwhile, Park decided to ignore the raid by LG&nbsp;2. LG&nbsp;2 saw one rail station, released their bombs, and returned home, seeing only one British fighter, No. 46 Squadron's Pilot Officer Gunning, who reported the make up of the formation.\nOverall, the attackers lost six bombers and 12 Bf&nbsp;109s, some 12.5% of its strength. However, the British claimed 81 aircraft, 26 by the Duxford Wing. Zehbe's Dornier alone was claimed nine times. Among the German casualties that day was Rolf Heitsch and his flame-throwing Dornier: the device had not been tested at high altitude and, when used, squirted black oil over Holmes' windshield and attracted the attention of British fighters. Park would not have been pleased that despite being stripped of protection the small force of bombers lost only a quarter of its strength while surrounded by 100 fighters. Still, the operation had been a victory. Fighter Command lost 13 fighters; eight were claimed by JG&nbsp;52.\nInterlude: 13:00 to 13:45\nAt 13:00, the German formations were plotted making their way back to France. Churchill was delighted with the results. The WAAF had been due to change shift, but the scheduled relief time could not take place during an operation. By 13:05 the fighters were back on the ground. Rearming and refueling began immediately to return the machines back to battle ready status as soon as possible, while the pilots wrote their combat reports, which included filing claims and details of their battle to the best of their recollections. Bader's Duxford Wing landed. Owing to battle damage, only 49 of Duxford's 56 fighters were operational by the afternoon.\nBy this time, the German bombers were touching down in the Pas de Calais. Two were so badly damaged that they were written off in crash landings, bringing the total losses to eight Do 17s. Almost all bore the scars of battle. One machine had sustained 70 hits, another 200.\nIn the afternoon, RAF Bomber Command abandoned more attacks on invasion ports because of insufficient cloud cover. Six Bristol Blenheims undertook an armed reconnaissance over the North Sea. RAF Coastal Command flew 95 sorties for anti-invasion, anti-submarine, mine laying and reconnaissance missions. Spitfires photographed every port from Antwerp to Cherbourg. They returned with evidence of a gradually increasing buildup of amphibious forces. All the Command's aircraft returned.\nMid-afternoon attack: 13:45 to 15:45\nEven before the Do 17s of KG 76 had touched down, the next wave was already getting airborne. II and III./ (KG 2) (from Boissy-Saint-Léger and Cambrai), II./ (KG&nbsp;3) (from Antwerp), I and II./ (KG&nbsp;53) (from Lille) and I and II./ (from Wevelghem and Gilze en Rijen) took off to target the West India Docks and Royal Victoria Dock north of the Thames as well as the warehouses of the Surrey Commercial Docks in the south. JG 53 and Adolf Galland's Jagdgeschwader 26 (JG 26) were to escort the bombers. The fighters met them as the bombers formed up over Calais.\nThe phalanx of German bombers headed for Dungeness. At the head were 43 Do 17s from KG 2; next, a couple of miles behind, came 24 He 111s of KG 53; a couple of miles further behind came 19 Do 17s from KG 3; and finally 28 He 111s of KG 26. The headwind was present again, and the 114 bombers battled against it. The German fighter pilots kept close escort. They detested the tactic. It handed the initiative to the British regarding how and when to attack. Moreover, if they were bounced by Spitfires, the Bf 109s would take too long to accelerate to full throttle in order to escape.\nThe German fighter escort consisted of five  from JG&nbsp;3, JG&nbsp;53 and  (JG&nbsp;77). LG&nbsp;2 Bf&nbsp;109s flew top cover while Adolf Galland's JG&nbsp;26 and  (JG&nbsp;51) conducted fighter sweeps in advance of the main bomber stream. For the sake of the morale of the bomber crews,  (Destroyer Wing 26 or ZG&nbsp;26) flying the Messerschmitt Bf&nbsp;110 flew close escort to KG&nbsp;26. It was half the size of the formation that hit London on 7 September, but instead of having two fighters for every bomber, there were four. Nor could the German pilots complain about being tied to the bombers. Sufficient numbers of fighters were allowed to roam on free-ranging patrols.\nAt 13:45, Chain Home radar picked up the German raids. No. 11 Group scrambled one Spitfire from RAF Hawkinge on the channel coast. Flown by No. 92 Squadron Pilot Officer Alan Wright, his job was to climb as quickly as possible over the sea and act as a spotter. He was to report on the direction, height, composition and strength of the German formation. The radar operators assessed the strengths of the three largest formations at 30, 50, and 60 plus. Five smaller formations added up to 85 plus. In fact, the British estimate of 225 aircraft proved too small. The German force was 475 aircraft strong. Shortly before 14:00, the German formation left the French coast. Park ordered his forces to repeat the earlier interception tactic. Four pairs of squadrons were ordered to patrol Sheerness, Chelmsford, Hornchurch, and RAF Kenley.\nRAF scramble\nAt 14:00, No. 11 Group released 68 fighters. Hornchurch's No. 603 and No. 222 Squadron RAF committed 20 Spitfires to Sheerness at . The squadrons would fail to find each other, going into action singly. At Debden, No. 17 Squadron RAF, No. 257 Squadron RAF sent 20 Hurricanes to Chelmsford at . Kenley dispatched No. 501 and 605 Squadrons with 17 Hurricanes to Kenley at just . North Weald ordered No. 249 and 504 Squadrons to cover Hornchurch at .\nJust five minutes later, the German bombers began splitting into three groups, heading for the coast between Dungeness and Dover. Park decided to scramble four more squadrons. When it became apparent that five concentrations of Bf 109s were taking the direct route to London on free-hunting patrols, Park scrambled eight more squadrons. No. 11 Group dispatched Biggin Hill's No. 41 Squadron RAF, followed by 92 Squadron. The force could put up 20 Spitfires. They were directed to Hornchurch at . At 12:10, Northolt No. 1 (Canadian) and 229 Squadrons sent 21 Hurricanes to Northolt. North Weald sent nine Hurricanes of No. 46 Squadron to the London Docks. Biggin Hill sent another wave, No. 72 and No. 66 Squadron RAF, with 20 Spitfires to Biggin Hill at . Debden was called into action again and ordered No. 73 Squadron RAF to Maidstone at . Beginning at 12:15, Kenley dispatched No. 253 Squadron RAF with nine Hurricanes to guard the airfield. RAF Tangmere was in action for the first time, sending Nos. 213 and No. 607 Squadron RAF's 23 Hurricanes to defend Kenley and Biggin Hill. The largest contingent came from No. 12 Group. Duxford, or the \"Big Wing\", No. 19, 242, 302, 310 and 311 Squadrons, with 20 Spitfires and 27 Hurricanes, were ordered to Hornchurch at . Middle Wallop committed No. 238 Squadron and 12 Hurricanes to the Kenley area.\nBy the time Park decided to launch his third wave, the first engagements were taking place. At 14:20, he ordered No. 11 Group's No. 303 (Polish) Squadron and its nine Hurricanes to Northolt at . Tangmere scrambled No. 602 Squadron RAF and 12 Spitfires to loiter over Kenley, Biggin Hill and Gravesend. Meanwhile, No. 10 Group RAF were ordered into action. A request was made for No. 609 Squadron and 13 Spitfires to climb to  over Kenley. This squadron left Middle Wallop at 14:28.\nThe RAF now had 276 Spitfires and Hurricanes in the air. The Germans outnumbered the British in this raid by two to one. More seriously, for every two RAF fighters, there were three Bf&nbsp;109s.\nInitial clashes\nOver Romney Marsh Nos. 41, 92 and 222 Squadrons engaged JG&nbsp;26, losing one of their number to the Bf&nbsp;109s. The second wave of RAF fighters arrived on the scene, comprising 607 and 213 Squadrons with 23 Hurricanes. They initiated a head-on attack against the Do&nbsp;17s of KG&nbsp;3. A Hurricane and a Dornier collided, both going down. The Bf&nbsp;109s did their best to break up attacks and the bombers held a tight formation, putting up withering cross-fire. The Bf&nbsp;109s were not permitted to leave the bombers and chase enemy fighters. Time and again, they were forced to break off and return to the bomber stream, allowing the RAF fighters to return and repeat the process. Soon after, No. 605 and No. 501 Squadron arrived with 14 Hurricanes. One fighter was hit by return fire, but the pilot aimed his aircraft at a Dornier and bailed out. The fighter collided and destroyed the bomber. The German bomber crews had no way of knowing that the crashes were not premeditated. It seemed as if the British were desperate. Nevertheless, they thought the 'tactic' was devastatingly effective. Chastened by losses, the Dorniers closed ranks to snuff out the gaps and continued to their target.\nAt 14:31, they reached the Thames and British anti-aircraft artillery opened up. The bombers were forced to evade their fire. One Dornier was damaged.  lost a He&nbsp;111 following up KG&nbsp;3 over the area.\nAt 14:35, Park and Churchill watched the battle unfold in Uxbridge's operations room. The Prime Minister saw that every squadron was being used and asked what reserves were available. Park said there were none. He was referring only to 11 Group, as there were more aircraft in nearby sectors, but at this point Park was stretched. At Park's request, he had sent all the Squadrons from No. 10 and 12 Group that were adjacent to 11 Group to the capital. If the  launched a follow-up attack, there were only three Squadrons available, in 12 and 10 Group (based in Norfolk and Dorset) and none in the Kent region. All other day squadrons were based too far away to get involved. Nevertheless, Park knew that a low cloud base over RAF Croydon (), Hornchurch (), Northolt (), RAF Hendon (), and Biggin Hill () would make a low-level accurate strike the Germans' only option. High-altitude attacks were improbable. Possibly to create a reserve, Park ordered 41, 213 and 605 Squadrons to return early though they had only been airborne for 45 minutes and had plenty of fuel left, even if ammunition was short. The vast bulk of the remaining squadrons were heading to London. A total of 185 fighters in 19 Squadrons were ready to engage. The battle would involve over 600 aircraft.\nMain battle\nbomber over the Surrey Commercial Docks in South London and Wapping and the Isle of Dogs in the East End of London on 7 September 1940]]\nIn the vicinity of Gravesend, the right-hand German formation – comprising the Do&nbsp;17s of KG&nbsp;3, trailed by the He&nbsp;111s of KG&nbsp;26 – would bear the brunt of the next attack from 63 fighters from 17, 46, 249, 257, 504 and 603 Squadrons. The Hurricanes of 249 and 504 squadrons went into action first. Their first pass saw three Do 17s go down, including  Ernst Püttmann, leading  of KG&nbsp;3 (5./KG&nbsp;3). The Bf 109s escorting KG&nbsp;26 could only watch, forbidden to leave their Heinkel charges. As the first attack finished, No. 257 Squadron, led by Squadron Leader Robert Stanford Tuck, attacked the Heinkels with nine Hurricanes. The escorts had their work cut out and were scattered. No. 257 targeted the badly protected bombers.\nAs 257 engaged KG&nbsp;26, KG&nbsp;53 came under attack from No. 1 (Canadian), 66, 72, 229 Squadrons. No. 66 attacked first, followed by 72 and 229. Some Spitfires climbed over the bombers to seek cover from the Bf&nbsp;109s. The British were surprised to see an unidentified formation of Bf&nbsp;109s continue on without interfering. Two He&nbsp;111s were forced back to France and another was shot down. Nine Bf&nbsp;109s were providing close escort for I./JG&nbsp;3. They claimed one Canadian Hurricane and one Spitfire from No. 66 Squadron.  in the left-hand column came under attack from 23 Hurricanes from Nos. 73, 253 and 303 Squadrons. JG&nbsp;53 were alert to the danger and shot down one 303 Hurricane and damaged five more. No. 73 Squadron made a head-on attack, damaging one bomber.\nMeanwhile, Park was hoping for Bader's Wing to turn up and deliver its promised results. As soon as the Duxford Wing did arrive it was intercepted. Arriving between Kenley and Maidstone at varying altitude (), it emerged from cloud in the vicinity of KG&nbsp;2's stream. Galland's JG&nbsp;26 was directly above it. In a reversal of their roles, the Hurricanes engaged the Bf&nbsp;109s while the Spitfires went for the bombers. While they failed to deliver their anti-bomber attacks, they drew in the Bf&nbsp;109 escorts and free-hunting German fighters, making it easier for other RAF fighters to reach the bombers. No. 310 Squadron lost two Hurricanes to JG&nbsp;26, one to Adolf Galland, as the battle became a confusing mess of combats. By 14:40, the bombers reached London.  had lost three Do&nbsp;17s destroyed and two damaged while KG&nbsp;26 had suffered only one damaged bomber.  in the central column had lost one and three more were forced to turn back owing to battle damage, while only one KG 2 machine had been forced to do the same. Despite the British presence, 100 bombers carrying 120 tons of bombs prepared to drop their bombs.\nOne of the reasons the bombers had sustained so little damage was the cloud base. Its density had made it difficult for RAF fighter controllers to direct their squadrons with accuracy. The same cloud that helped shield the bombers was to obscure the target area. Its base started at  and its top reached . The bombers reached the Victoria Docks, but it and the other targets were covered. The skies were clear over West Ham and the bombers concentrated on the borough, in particular the Bromley-by-Bow gas works. , 26 and 53 dropped their bombs at 14:45.\nMost of the targeted area was three square miles in extent, bounded on the north by the overground railway of the District line, on the west by the River Lea, on the east by the Plaistow Marshes and on the south by the Royal Victoria Dock. The gas works were targeted by KG&nbsp;26. Heavy high explosive bombs severely damaged the plant. Upton Park tube station was also hit and an electric sub-station was hit, causing a power-cut. Residential areas were badly damaged.  was unable to find the Surrey Commercial Docks. It turned away and dropped its bombs over a wide area. According to West Ham borough records, 17 people were killed, or died of wounds sustained in the attack. Another 92 were seriously injured, while 40 were slightly injured. As the Germans retreated back out over the English Channel, some bomber groups scattered while others formed uneven formations and were pursued by RAF fighters. With fuel dwindling, the Bf 109s headed back to France, unable to help the hard-pressed bombers.\nThe German bombers that had been forced out of formation attempted to make it to France using the cloud as cover. However, virtually all were destroyed. Four Do&nbsp;17s and six He&nbsp;111s were shot down by fighters that were now swarming over Kentish air space. The main formations withdrew as more RAF squadrons closed in. The escort plan held up, and 50 Bf&nbsp;109s met the withdrawing units, though it appears that the German fighters sent to cover the retreat made little impact and were hardly noticed by RAF fighters: two RAF fighters were lost to the escorts. It appears I./ (LG&nbsp;1) formed part of the withdrawal force, losing three Bf&nbsp;110s to No. 303 (Polish) Squadron RAF at 15:50. Nos. 238, 602 and 609 Squadrons exploited gaps in the formation. No. 238 Hurricanes engaged KG&nbsp;53 while the others shot down two Do&nbsp;17s from KG&nbsp;2. Bader's squadron also took part, shooting down one Dornier. No. 303 Squadron claimed three Dorniers and two Bf&nbsp;110s while No. 602 claimed seven bombers and two fighters. The RAF grossly over-claimed German losses, claiming 77 bombers and 29 fighters.\nGerman losses on that raid had been heavy.  had lost eight Do&nbsp;17s while seven were damaged. Personnel losses of the unit amounted to nineteen crew killed, nine captured and ten wounded.  had fared little better, with six aircraft destroyed and four damaged. In II./KG&nbsp;3, fifteen personnel were killed, ten were captured and four were wounded. The He 111s were to suffer lightly. One He 111 was lost, its crew captured. Three more were damaged and two crewmen were wounded.  lost six Heinkels with another two damaged. It lost twelve aircrew killed, eighteen captured and four wounded, including Major Max Gruber, II./KG&nbsp;53's  (Group Commander). The German fighter screen suffered as well. In the battle, JG&nbsp;51 lost two Bf&nbsp;109s, JG&nbsp;52 a single Bf&nbsp;109, JG&nbsp;53 lost seven Bf&nbsp;109s and one damaged, JG&nbsp;77 lost one and one damaged, while LG&nbsp;2 lost two Bf&nbsp;109s. Two more Bf&nbsp;109s were lost owing to the pilots running out of fuel or being shot down in combat.\nIn total, the  had lost 21 or 23 bombers destroyed, and scores damaged. It also lost at least 12 fighters. The RAF had lost 15 fighters destroyed while 21 were damaged.\nFrom 15:00, III./ (KG 55) took off from Villacoublay led by Major Schlemell. It headed towards Southampton before diverting to bomb Royal Navy targets at Portland. British radar reported them as six intruders. There were actually more than 20 He&nbsp;111s without fighter escort. They were intercepted by six Spitfires from No. 152 Squadron from RAF Warmwell. The bombers dropped their bombs, but only five fell among naval installations, causing minor damage. The RAF fighters claimed one destroyed and another damaged. KG&nbsp;55  lost one He 111P-2 (one survivor) and  suffered one bomber damaged and one of the crew killed.\nEvening and night actions\n, which attacked Southampton in the afternoon.]]\nThere was one more noteworthy operation before the Germans ceased their attacks for the day. At 17:40, 20 aircraft from  took off. It was picked up just off the Cherbourg peninsula as it made its way across the central Channel to the Isle of Wight. By 17:50, it had reached St. Catherine's Point. Nos. 213 and 602 Squadrons were patrolling nearby at Tangmere, where they were kept for the duration of the raid. No. 607 Squadron, also from Tangmere, was flying to the airfield over Southampton at  and No. 609 Squadron was on its way from Middle Wallop to patrol Portsmouth. At 18:00, by which time the German operation was virtually over, the British dispositions were completed when No. 238 Squadron took off from Middle Wallop to patrol the airfield.\nThe German target was the Spitfire factory at Woolston. They arrived near it at 17:55. The Southampton guns engaged them for the entire time over the target. RAF fighters arrived as the Germans retired. Fortunately for the British, the Germans missed the factory. They did manage to rupture a number of gas and water mains while damaging nearby residential areas. Slight damage was done to the shipbuilding yard in Southampton Harbour. According to German records,  of bombs were dropped. Had they succeeded in hitting the Spitfire factory, they could have seriously reduced British fighter production. As it was, nine civilians were killed, 10 seriously injured, and 23 slightly injured in the attack.\nThe make up of the formation is unclear. An eye-witness, air enthusiast Alexander McKee, 22, was drinking tea at a café in Stoneham when the attack began:\nto me. The aircraft had twin-rudders, and might have been Dorniers or Jaguars [a bomber version of the Bf&nbsp;110 thought to be in use at the time]. The dives were fast but shallow, and they pulled out of them at about 2,000 feet. It was not a dive-bombing attack proper. Soldiers passing made inane remarks about 'nothing could live in that barrage', although the Germans were very obviously living in it, too. The barrage was quite good, but none of the Huns were brought down.&nbsp;... Very quickly and efficiently the Germans re-formed and disappeared into the cloud. I have never seen a better bit of flying than those Nazi pilots put up – they got into formation like a well-drilled team, in the teeth of the guns.}}\nNos. 607 and 609 Squadrons engaged the Germans south-west of The Needles. The British reported 30–40 Bf&nbsp;110s with 15 Do&nbsp;17s in support. The tonnage of bombs dropped suggested there were fewer bombers than claimed. The RAF fighters claimed four Do&nbsp;17s. The fact remains that the Germans penetrated the airspace without interception and came very close to inflicting critical damage to the Spitfire factory. The radar had done its job and alerted No. 11 and 10 Group 20 minutes before the bombs started to fall. The fault lay either with the No. 10 or 11 Group controllers who were late in ordering their Squadrons to scramble.\nMore interceptions took place in the evening. The interception of two separate He&nbsp;111s near London at 19:00 signalled the last engagement of daylight. It is likely they were on reconnaissance missions to assess the damage done in the attacks. The interception was made by No. 66 Squadron RAF. One of the He 111s was chased out to sea and was last seen flying on one engine. It was likely to have belonged to I./ (KG&nbsp;1), which reported one He&nbsp;111 destroyed upon crash landing back in France after combat.\nSmall groups of German bombers attempted to attack London in the afternoon, causing little damage. II./ (KG&nbsp;4) had one He&nbsp;111 crash land near Eindhoven after combat with the crew unhurt. The bomber was 30 percent damaged.  (KG&nbsp;30) lost one Junkers Ju&nbsp;88 to fighters when it crashed in France and another force landed after combat. I. and II./ (KG&nbsp;51) lost one Ju&nbsp;88 each and another damaged. In the lost Ju&nbsp;88s, all crews were reported missing.\n(KG&nbsp;27) bombed Liverpool during the night at 22:48. Widespread damage was caused in the city and neighbouring Birkenhead, but only nine casualties were inflicted. Elsewhere damage was reported at Eastbourne, Worthing, Bournemouth, Cardiff, Avonmouth, Manchester, Warrington, Bootle and Preston. RAF night fighters flew 64 sorties and intercepted two bombers. Neither the fighters or ground defences claimed any successes.\nAftermath\nOverclaiming and propaganda\nOverclaiming in aerial warfare is not uncommon. During the Second World War, pilots often claimed more aircraft shot down than was actually the case. The Air Ministry released a press statement on 15 September that 175–185 German aircraft had been shot down. The actual number of aircraft destroyed was two-thirds lower and significantly less than the number of German losses on 15 and 18 August (The Hardest Day), in which the  lost 75 and 69 respectively.\nAt 20:00, Churchill, who had returned to 10 Downing Street, was awakened. He received bad news from the navy. In the Atlantic sinking of shipping had been bad, but his Secretary informed him that all had been redeemed in the day's air battle. He was told the RAF had downed 183 enemy aircraft for under 40 losses.\nOn 16 September, a British flying boat arrived in New York City delivering news of a \"record bag\" of 185 enemy aircraft. The German Embassy tried in vain to correct the total. The Germans were ignored and The New York Times ran several excited stories calling for a military alliance with Britain and her Commonwealth. The Germans were slower in putting their story together. On 17 September, the Nazi Party newspaper  announced that attacks had caused considerable damage to London. It claimed the  destroyed 79 RAF aircraft for 43 losses. This was also a severe over claim. RAF losses amounted to 29 fighters.\nAOC 11 Group Keith Park was livid with the claim returns. As far as he was concerned, claiming 200 on one day was nonsense. He placed particular blame on Leigh-Mallory's Big Wing which had claimed one third, around 60, of the 185 'victories' (total claims were 81 in the morning and 104 in the afternoon). More damage should have been done to German bombers inbound to the target rather than destroying stragglers that were no military threat as they made their way to the coast. He complained that there were too many inexperienced leaders and interceptions were being missed. Park's lesson for 15 September was that things needed \"tightening up\". Park was aware the ratio of losses was 2:1 in the British favour. It had been a decent performance, but not Fighter Command's best.\nEvaluation of the day's events\nIn the two main engagements, the fighter losses had been about equal. The big difference was the bomber losses. Fighter Command had greater success against the afternoon attack than the morning assault, which it outnumbered 2:1. The ratio of German fighters to bombers had been 3:1 in the morning but 5:1 in the afternoon, so there were more targets. The more bombers Kesselring sent, the more were lost.\nKesselring was back where he started. Park's handling of the actions was a masterpiece of aggressive defence, yet he was not under the same pressure as he had been during August when air battles were so confusing they were hard to control. A big set-piece offensive played into his hands.\nLeigh-Mallory claimed the Big Wings had destroyed entire formations of enemy aircraft upon seeing them. He even claimed the RAF outnumbered their opponents in several engagements. In the afternoon battle, he claimed that the Wing could not get into position to break up the bombers in time and was intercepted by German fighters. While that was true, he also claimed his units had shot down 105 enemy aircraft and probably destroyed a further 40. He claimed another 18 damaged for the loss of 14 and six pilots. These claims were a massive exaggeration. But while the Big Wing had proven tactically ineffective for the most part, its biggest contribution to the day was its effect on German morale. German aircrews had been told the RAF was a defeated force and the German bomber units that had seen the Big Wing form up were quite shocked, and those crews in the badly hit units, including KG&nbsp;2 and KG&nbsp;3, that had witnessed head-on collisions with German aircraft were badly shaken.\nA German victory on the Battle of Britain Day was unlikely. It could only have been possible if Park had made crass errors and had been caught on the ground. Stephen Bungay postulates that had the loss rates been reversed, Dowding could have replaced those with reinforcements from his C units and carried on. Moreover, during both major engagements Fighter Command had used less than half of its strength. It would have been able to meet the  again on the morrow.\nHermann Göring met his staff at Karinhall the following day for a conference. Their assessments of the air battle verged on pure fantasy. They concluded the RAF had withdrawn all available fighter units from all over the country to concentrate on London. The fact that the Western afternoon raids against ports were uncontested led them to believe the enemy was breaking. Another four or five days, they thought, would be sure to break them.\nThe OKL believed that the British were down to their last 300 fighters, with only 250 being produced. To stop fighter production, factories in Bristol were to be attacked. London was also to be subjected to round the clock bombing.\nTheo Osterkamp pointed to the massed formations used by the British (Big Wing), and put their use down to the ineffectiveness of the 15 September raids. Göring was delighted with the news that the British were committing mass formations to battle. The Big Wing's use would allow the German fighters to engage and destroy RAF fighters in large numbers; the Germans had not realised this stratagem was by no means uniform in Fighter Command. Thus the OKL remained confident of victory. It blamed the bad weather and RAF's last-minute change of strategy for prolonging summer operations. Still, the  bomber crews were ordered to prepare winter quarters. The campaign turned to London for the duration of 1940. It would witness some large-scale daylight air battles, but it gradually turned to a campaign by night. It would become known as The Blitz.\nHitler's reaction and strategic overview\nHitler did not seem overly bothered with the outcome of the air battle. For him, Operation Sea Lion had also been a huge risk, even with air superiority, and he had been convinced since the end of August the  would not achieve it anyway. The war with Britain would have to go on. He would maintain the threat of invasion until 1941 through the use of strategic bombing. Then, he would turn against the Soviet Union and eliminate Britain's last possible ally in Europe. With the Soviets defeated, he believed the British would negotiate. On 17 September, he sent out a directive to the three armed services informing them of Sea Lion's delay. On this date, the date for S-Day had been 21 September. It was now postponed until further notice. It is likely that Hitler did not want to gamble his new-found military prestige by launching a hazardous venture across the Channel unless the  had crushed all opposition. At the beginning of December 1940, Hitler told the  (OKW) that they could forget Sea Lion, although he did not formally cancel the operation until 3 March 1942.\nGöring had never believed in Sea Lion, while Hitler had never believed  could achieve victory without Sea Lion. Both went their own ways. Hitler needed someone to keep up the pressure on Britain, and Göring was willing to do it. On 19 September, Hitler ordered that no further barges were to be added to Sea Lion ports, but those under assembly were to continue. But the damage being done by RAF Bomber Command now meant sustaining the army in readiness was becoming a strain. The invasion forces were broken up and moved East on the understanding that they could be reassembled with only three weeks notice.\nThere was no clear solution to combating Britain from the air. Göring had not given up hope of winning a victory by airborne assault. He discussed the possibility of invading Ireland (Fall Grün, or Operation Green) with Kurt Student in January 1941, in order to surround Britain by land, sea and air. The operation was shelved. Instead, the , with varying degrees of success, carried out the strategic bombardment of British industrial cities. The lack of RAF night defences in this stage of the war enabled the German bombers to inflict extensive damage without suffering the heavy losses of the daylight campaign. It is estimated that the  lost around 500 aircrews during the Blitz, whereas in the Battle of Britain it lost around 2,800 killed, 340 wounded, 750 captured. Overall losses were cut by one-third of daylight operations.\nStill, perennial problems with spares meant serviceability rates remained at about 50%. The s bomber crews had never been trained for bad weather or night operations. To support them, navigation aids in the form of  (Crooked Leg) were made available. They allowed German crews to navigate effectively to their targets. For the most part, crews were confident in using them, with the exception of poorer quality replacement crews. These systems were responsible for a few very successful attacks, such as the Coventry operation on 14 November. Operations against Liverpool were also successful. Some 75% of the port's capacity was reduced at one point, and it lost  of shipping to air attacks, with another  damaged. Minister of Home Security Herbert Morrison was also worried that morale was breaking, noting the defeatism expressed by civilians. Operations against London up until May 1941 could also have a severe impact on morale.\nThe campaign's ultimate limitation was the poor formulation of military strategy. The types of targets selected from one operation to the next differed radically and no sustained pressure was put on any one type of British target. The s strategy became increasingly aimless. Disputes among the OKL staff revolved more around tactics than strategy. This method condemned the offensive over Britain to failure before it had begun.\nThe result of the air campaign against Britain in 1940 and 1941 was a decisive failure to end the war. As Hitler committed Germany to ever increasing military adventures, the  became increasingly overstretched and was unable to cope with a multi-front war. By 1944, the Allies were ready to launch Operation Overlord, the invasion of Western Europe. The Battle of Britain ensured that the Western Allies had a base from which to launch the campaign and that there would be a Western Allied presence on the battlefield to meet the Soviet Red Army in central Europe at the end of the war in May 1945.\nCommemoration\nBattle of Britain Day is now an annual commemoration of the battle in the United Kingdom, specially commemorated on 15 September. In Canada, the commemoration takes place on the third Sunday of September.\nSee also\n* May Day in England\n* Minden Day\n* Oak Apple Day\n* St Crispin's day\n* St George's Day in England\n* Feast day of St Thomas Becket\n* Trafalgar Day\nReferences\nCitations\nBibliography\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*"
    }
  ]
}