{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Arlon (1793)\n\nFrench Republic\n|combatant2   =  Habsburg monarchy\n|commander1   =  Jean Houchard Amable Delaage\n|commander2   =  Gottfried von Schröder\n|strength1    = 9,500\n|strength2    = 6,000\n|casualties1  = 900\n|casualties2  = 600, 5 guns\n|notes        =\n}}\nThe Battle of Arlon (9 June 1793) saw a French Republican force under the command of Amable Henri Delaage face the Austrian force led by Gottfried von Schröder. The French were victorious though they suffered higher casualties than the Austrians. The action was fought during the War of the First Coalition, part of the larger French Revolutionary Wars. Arlon is located in Belgium, a distance of  west of Luxembourg city.\nCampaign\nDuring the Siege of Mainz, the Army of the Rhine, under the orders of Alexandre François Marie de Beauharnais (who had come to replace Adam Philippe de Custine), was entrenched on the Lauter. After taking up his positions, the commander in chief had reorganised his troops and incorporated the recruits who had arrived from all sides.\nAt the same time the Army of the Moselle was retiring behind the Blies and Saar. This inaction displeased the National Convention and the two generals were strongly ordered by the Committee of Public Safety to reassume the offensive and march to the aid of the army blockaded in Mainz by all the efforts of the Coalition forces. The surest means of raising the siege was to carry out a two-pronged simultaneous attack on the enemy, with the Army of the Moselle attacking by Pirmasens or Kaiserslautern and the Army of the Rhine by the left bank of the river.\nIn 1793 the Army of the Moselle counted 27 battalions of line infantry, four battalions of light infantry, 42 battalions of National Guards and 12 mounted regiments. The line infantry included the 1st and 2nd Battalions of the 30th, 33rd, 96th, 99th and 103rd Demi Brigades, the 1st Battalions of the 1st, 5th, 27th, 41st and 81st Demi Brigades and the 2nd Battalions of the 2nd, 8th, 17th, 18th, 19th, 40th, 47th, 54th, 55th, 58th, 71st and 100th Demi Brigades. The light infantry consisted of the 6th, 13th, 16th and 17th Battalions. The cavalry regiments were the 4th, 10th, 11th and 14th Cavalry, 1st, 11th and 14th Dragoons, 1st, 9th, 18th and 19th Chasseurs à Cheval and the 2nd Hussars.\nThe National Guards were made up of the 1st Battalions of the Ardennes, Creuse, Paris Butte de Moulins, Saône-et-Loire and Yonne, the 2nd Battalions of the Lot and Haute-Marne, the 3rd Battalions of the ''Côte-d'Or, Manche, Paris Sections Armée and Haut-Rhin, the 4th Battalions of the Oise and Var, the 5th Battalion of the Orne, the 6th Battalions of the Basses-Pyrénées and Seine-et-Oise, the 7th Battalion of the Marne, the 9th Battalion of Paris Ste. Margueritte, the 1st and 2nd Battalions of the Cher, 2nd and 3rd Battalions of the Loiret, the 4th, 6th and 7th Battalions of the Meurthe, the 1st, 3rd and 5th Battalions of the Meuse, the 2nd, 3rd, 4th and 5th Battalions of the Moselle, the 1st and 3rd Battalions of the Paris République, the 3rd and 4th Battalions of the Bas-Rhin, the 1st and 7th Battalions of the Rhône-et-Loire, the 1st and 4th Battalions of the Haute-Saône and the 1st and 6th Battalions of the Vosges.\nBattle\nThe Austrians at Arlon were under the command of Feldmarschall-Leutnant Gottfried von Schröder. His approximately 6,000 troops were organized into seven battalions and eight squadrons. The Austrian infantry was made up of three battalions of the Infantry Regiment Franz Kinsky Nr. 47, one battalion of the Infantry Regiment Murray Nr. 55, the 1st Battalion of Infantry Regiment Alton Nr. 15 and the 3rd Battalions of Infantry Regiments Devins Nr. 37 and Johann Jellacic'' Nr. 53. Schroder's mounted contingent consisted of six squadrons of the Kinsky Chevau-léger Regiment Nr. 7 and two squadrons from an unknown unit. The French forces were led by General of Division Amable Henri Delaage and counted 8,500 infantry and 1,000 cavalry from the Army of the Moselle.\nJean Nicolas Houchard, commander of the Army of the Moselle, believed in the same goal, advancing on the left on 9 June to attack Arlon, on the heights, defended by 8,000 men, 30 artillery-pieces and a chain of echelon trenches overlooking all points from which it could be attacked. The Republican columns advanced at the charge in good order, shouting \"Vive la République!\" and under fire from these batteries, with the French artillery being of too low a calibre to reply with any advantage. The right was more exposed than the rest and was charged by the Austrian cavalry, but the columns in the centre and the artillery came to the right's aid and repulsed the enemy. During the fight near Arlon the future general Claude François Duprès, then only a lieutenant, distinguished himself by capturing a whole Austrian company.\nDuring this time, Pierre Raphaël Paillot de Beauregard was marching on Arlon from the right and took the heights overlooking the town. 400 carabiniers attacked a square of 1,500 Austrians. Several volleys of grapeshot, fired at only 50 footsteps from the front of the square, threw it into disorder and the carabiniers finished routing it. Arlon remained in French hands and the army set up its base there, but its capture was of no use to the besieged troops in Mainz, and Houchard's poor judgement in taking this action was not punished (he was made commander of the Army of the North the following August).\nThe French suffered 900 killed and wounded. Austrian losses were fewer at 600 killed, wounded and captured. The French also captured five artillery pieces and four ammunition wagons.\nDuring the battle, Captain Jean-Barthélemot Sorbier's horse artillery company carried out an artillery charge: first, Sorbier unlimbered his guns and fired at a range of . The guns were then limbered up and brought closer to the enemy before being unlimbered and fired again. This procedure was repeated at ever-decreasing ranges until the cannons were delivering a very destructive fire at close range.\nNotes\nBibliography\n* Général de Jomini: Histoire critique et militaire des campagnes de la Révolution (1811);\n* A. Hugo: Histoire des armées françaises de 1792 à 1837 (1838);\n* P. Giguet: Histoire militaire de la France (1849);\n* C. Clerget: Tableaux des armées françaises pendant les guerres de la Révolution (Librairie militaire 1905).\n*\n*\n*"
    }
  ]
}