{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Surabaya__disambig_1\n\n)\n| place             = Surabaya, East Java, Indonesia\n| coordinates       =\n| territory         = British military forces successfully occupy Surabaya until November 1946\n| result            = British victory\n| combatant1        =\n| combatant2        =\n*\n**\n| commander1        =  Ario Soerjo| Sutomo| | Moestopo| Muhammad Mangundiprojo| Muhammad Yasin| | Joop Warouw}}\n| commander2        =  A.W.S. Mallaby| Robert Mansergh}}\n| units1            = * Indonesian People's Revolutionary Front\n* Special Police Unit\n* People's Security Army\n* Loyalty of the Indonesian People from Sulawesi (KRIS)\n| units2            = *5th Indian Infantry Division\n* 23rd Indian Infantry Division\n* 49th Indian Infantry Brigade\n| strength1         =\n}}\n| strength2         = 30,000\n| casualties1       = 6,300–15,000 dead20,000 wounded\n| casualties2       = 295–2,000 dead210 wounded\n| casualties3       =\n| notes             =\n| campaignbox       =\n}}\nThe Battle of Surabaya () was a major battle in the Indonesian National Revolution fought between regular infantry and militia of the Indonesian nationalist movement and British and British Indian troops against the re-imposition of Dutch colonial rule. The peak of the battle was in November 1945, and was the largest single battle of the revolution and became a national symbol of Indonesian resistance. Considered a heroic effort by Indonesians, the battle helped galvanise Indonesian and international support for Indonesian independence. 10 November is celebrated annually as Heroes' Day ().\nBy the time British forces arrived at the end of October 1945, the Pemuda (\"youth\") foothold in Surabaya was described as \"a strong unified fortress\". Fighting broke out on 30 October after the British commander, Brigadier A. W. S. Mallaby was killed in a skirmish. The British retaliated with a coordinated sweep that began on 10 November, under the cover of air attacks. Although the colonial forces largely captured the city in three days, the poorly armed Republicans fought for three weeks, and thousands died as the population fled to the countryside.\nDespite the military defeat suffered by the Republicans and a loss of manpower and weaponry that would severely hamper Republican forces for the rest of the revolution, the battle and defence mounted by the Indonesians galvanised the nation in support of independence and helped garner international attention.\nFor the Dutch, it removed any doubt that the Republic was not simply a gang of collaborators without popular support. It also convinced Britain that wisdom lay on the side of neutrality in the revolution; within a few years, in fact, Britain would support the Republican cause at the United Nations.\nBackground\nOn 17 August 1945, Sukarno and Hatta declared the independence of Indonesia in Jakarta, two days after the Japanese emperor's surrender in the Pacific. As the news about the independence declaration spread throughout the archipelago, ordinary Indonesians felt a sense of freedom that led most to regard themselves as pro-Republican. In the following weeks, power vacuums existed, both from outside and within Indonesia, creating an atmosphere of uncertainty, but also one of opportunity. On 19 September 1945, a group of Dutch internees supported by the Japanese raised the Dutch flag outside the Hotel Yamato (formerly Hotel Oranje, now Hotel Majapahit) in Surabaya, East Java. This provoked nationalist Indonesian militia, who overran the Dutch and Japanese and tore off the blue part of the Dutch flag, changing it into the Indonesian flag. The leader of the Dutch group, Ploegman, was killed because of mass anger.\nin Surabaya, one of the most revered revolutionary leaders, wearing an Imperial Japanese Army uniform. This photo became an iconic image of the revolution.]]\nThe senior Japanese commander in Surabaya, Vice Admiral Shibata Yaichiro, threw his support behind the Republicans and gave Indonesians ready access to arms. On 3 October, he surrendered to a Dutch Navy captain, the first Dutch representative to arrive. Yaichiro ordered his forces to hand over their remaining weapons to the Indonesians. The Indonesians were expected to hand them to the newly arrived Dutch forces, but did not do so.\nThe Nederlandsch-Indische Civiele Administratie (Netherlands Indies Civil Administration; NICA), which was part of the Royal Netherlands East Indies Army (Dutch: Koninklijk Nederlands Indisch Leger; KNIL), arrived in September 1945, with the intention of performing basic governmental duties, until the pre-war colonial government could be reinstated. In the meantime, British commanders had become preoccupied with the increasing boldness and apparent strength of the nationalists, who attacked demoralised Japanese garrisons across the archipelago with rudimentary weapons such as bamboo spears to seize their arms. The \"bamboo spear\" monument is still a common feature in Indonesian cities, e.g. Jakarta, Surabaya, and Pontianak. The main goals of British troops in Surabaya were seizing weapons from Japanese troops and Indonesian militia, taking care of former prisoners of war (POWs), and sending the remaining Japanese troops back to Japan.\nspeaks with Indonesian soldiers prior to the Battle of Surabaya. The battle saw the birth of the Tentara Keamanan Rakyat, a predecessor of the Indonesian National Armed Forces.]]\nIn September and October 1945 a series of incidents took place involving pro-Dutch Eurasians, and atrocities were committed by Indonesian mobs against European internees. In late October and early November, the leadership of the mass Muslim organisations Nahdlatul Ulama and Masyumi declared that war in defence of the Indonesian motherland was holy war, and thus an obligation for all Muslims. Kyai and their students began to stream into Surabaya from Islamic boarding schools throughout East Java. The charismatic Bung Tomo made use of local radio to encourage an atmosphere of fanatical revolutionary fervor across the city. Six thousand British Indian troops were sent into the city on 25 October to evacuate European internees and within three days fighting began. After heavy fighting between the British Indian forces and around 20,000 Indonesian armed regulars of the newly formed People's Security Army (TKR) and mobs of 70,000–140,000 people, the British flew in the influential President Sukarno, Vice-President Hatta, and the minister Amir Sjarifuddin, and a ceasefire was achieved on 30 October.\nPrelude\nOn 26 October 1945, Brigadier A. W. S. Mallaby reached an agreement with Suryo, the Republic of Indonesia's governor of East Java, that the British would not ask Indonesian troops or militia to hand over their weapons. An apparent misunderstanding about the agreement between British troops in Jakarta (led by Lieutenant General Sir Philip Christison) and Mallaby's troops in Surabaya was to have serious ramifications.\nInitially, British troops in the city comprised some 6,000 lightly armed British Indian soldiers from the 49th Infantry Brigade of the 23rd Indian Division. When the battle reached its peak, the British sent in additional troops which consisted of 24,000 fully armed soldiers from the 5th Indian Division, 24 US M4 Sherman medium tanks, along with a similar number of M3 Stuart light tanks, 24 battle-ready aircraft, together with two British Royal Navy cruisers and three accompanying destroyer escorts.\nIndonesian forces consisted of 20,000 soldiers from the newly formed Tentara Keamanan Rakyat (TKR; People's Security Armed Forces) from its East Java Regional Command and an estimated 100,000–120,000 irregulars and militias. The TKR was formed partly by the former members of PETA, a semi-military organisation of volunteer cadre during the Japanese occupation and a few local officers of the former KNIL. The irregulars consisted of pro-Independence mobs, armed with rifles, swords, and bamboo spears. Some of their weapons were taken from surrendered Japanese troops.\nBattle\nBeginning\nOn 27 October 1945, a British plane from Jakarta dropped leaflets over Surabaya urging all Indonesian troops and militia to surrender their weapons. The leaders of the Indonesian troops and militia were angered, seeing it as a breaking of the agreement reached with Mallaby earlier. On 28 October 1945, they attacked the British-Indian troops in Surabaya after cutting off all water supply to the British-occupied area. On 30 October the British flew Sukarno (president of RI), Hatta (the vice-president of RI), and Amir Syarifuddin Harahap (the minister of information of Indonesia) into Surabaya to possibly negotiate a cease fire. A ceasefire was negotiated with Major General Hawthorn (the commander of the 23rd British Indian Division) and Mallaby and immediately adhered to. Fighting, however, soon recommenced due to confused communications and mistrust between the two sides, leading to the outbreak of the battle.\nDeath of Brigadier Mallaby\nOn 30 October 1945, Brigadier Mallaby, the British brigade commander in Surabaya, was travelling about Surabaya to spread the news about the new agreement to his troops. At this time, Mallaby's team were forbidden to carry\nany weapons except hand grenades. Later while patrolling, they received information that there was a mass of Indonesian militia advancing to the International Bank near Jembatan Merah (the \"Red Bridge\"). The team headed to the area but were trapped by shooting between Dutch soldiers who guarded the bank and local militias.  When his car approached the British troops' post in the International building near the Jembatan Merah, it was surrounded by Indonesian Republican militia. Shortly after, Mallaby was shot and killed by the militia under confused circumstances.\nCaptain R. C. Smith, who was in the stationary car, reported that a young Republican (teen) suddenly shot and killed Mallaby after a short conversation. Smith then reported throwing a grenade from the car in the direction of where he thought the shooter had hidden. Although he was not sure whether or not it hit its target, the explosion caused the back seat of the car to ignite. Other accounts, according to the same source, stated that it was the explosion and not a shooter that killed Mallaby. The remaining members of Mallaby's team ran and jumped into the Kalimas River. The death of Mallaby had a significant impact on the British, because they considered that he was on a non-combat mission that day. Regardless of its exact details, Mallaby's death was a significant turning point in the hostilities in Surabaya, and a catalyst for the battle to come. After the death of Brigadier Mallaby, on 9 November General Robert Mansergh ordered an ultimatum using a pamphlet dropped from the plane that stated all Indonesian militias must surrender and put down their weapons at the designated place and surrender with their hands raised above with the deadline was 6.00 am on November 10, 1945. The Indonesians rejected the ultimatum and many figures encouraged the civilians to resist the British, including Bung Tomo via radio broadcasts. There were a lot of pesantrens and civilians that were mobilized by the kyai.  On 10 November, they launched a large retaliatory attack.\nMain battle\nof 3/9th Jat Regiment cover the advance of their regiment against Indonesian nationalists, circa 15–16 November 1945.]]\nLieutenant General Sir Philip Christison was angered when he heard that Brigadier Mallaby had been killed in Surabaya. During a lull in the fighting, the British brought in reinforcements and evacuated the internees. An additional two brigades (9th and 123rd Indian) of the 5th Indian Division led by Major General Robert Mansergh were deployed with Sherman and Stuart tanks, 2 cruisers and 3 destroyers (including ) in support.\nAt dawn on 10 November, a day now commemorated in Indonesia as Heroes' Day, British troops began a methodical advance through the city under the cover of naval and air bombardment. Fighting was heavy, with British troops clearing buildings room by room and consolidating their gains. Despite the fanatical resistance of the Indonesians, half of the city was conquered in three days and the fighting was over in three weeks (29 November). Indonesian irregulars would continue to infiltrate the city to launch guerilla attacks and the British forces would bombard Surabaya until 2 December. Estimates of Indonesian deaths range between 6,300 and 15,000, and perhaps 200,000 fled the devastated city. British Indian casualties totalled 295 killed and missing.\nAftermath\nThe Republicans lost much of their manpower, but it was the loss of weaponry that would severely hamper Republican military efforts for the remainder of the independence struggle. The battle for Surabaya was the bloodiest single engagement of the war, and demonstrated the determination of the rag-tag nationalist forces; their sacrificial resistance became a symbol and rallying cry for the revolution. It also made the British reluctant to be sucked into a war, considering how stretched their resources in southeast Asia were during the period after the Japanese surrender; within a few years, in fact, Britain openly supported the Republican cause in the United Nations. It was also a watershed for the Dutch as it removed any doubt that the Republic was a well-organized resistance with popular support. In November 1946, the last British troops left Indonesia. The Heroes Monument in Surabaya commemorates this battle. 10 November is now commemorated in Indonesia as \"Heroes' Day\", in memory of the battle.\nThe Scottish-American Indonesian sympathiser K'tut Tantri also witnessed the Battle of Surabaya, which she later recorded in her memoirs Revolt in Paradise. Prior to the fighting, she and a group of Indonesian rebels associated with Bung Tomo had established a secret radio station in the city which broadcast pro-Indonesian Republic messages that were directed at the British soldiers in the city. She noted that several British soldiers were unhappy with the Dutch for misleading them about the Indonesian Republicans being Japanese puppets and extremists. Following the British bombardment of the city, Tantri contacted several foreign diplomats and commercial attaches from Denmark, Switzerland, the Soviet Union, and Sweden. These countries had representatives in Surabaya. They agreed to inform their respective governments about the fighting in Surabaya and to take part in a joint broadcast protesting continuation of the fighting and calling for a ceasefire.\nIn popular culture\nThe battle of Surabaya has become the theme and background of several Indonesian films, such as the Cinema of Indonesia 1990 film ''Soerabaia 45' Merdeka atau Mati'. The battle was shown briefly in the 2013 film Sang Kiai, which depicted the death of Brigadier Mallaby at the hands of an Indonesian militiaman from Laskar Hizbullah and the first day of the battle itself.\nIn 2013, the Battle of Surabaya was commemorated in a 2D animated film called the Battle of Surabaya'', which was released in August 2015. The film was produced by Mohammad Suyanto and focuses on a teenage courier named Musa. Disney Studios took an interest in the animated cartoon, and the film became part of Disney's distribution franchise. It was stated that the film would have an English voice over for distribution outside Indonesia after the film's original release in Indonesia.\nSee also\n* History of Indonesia\n* Sutomo\nNotes\n, Petra Christian University Surabaya.\n}}\nReferences\n*\n*\n*\n}}\n*\n| hdl = 1813/53609\n| hdl-access = free\n}}\n*\n}}\n*\n}}\n*  }}\n*\n| url-access = registration\n| url = https://archive.org/details/historyofmoderni00adri\n}}\n*\n}}\nOther sources\n*\n}}\nFurther reading\n* Bayly and Harper (2007) ''Forgotten Wars: The End of Britain's Asian Empire (London:Penguin).\n* McMillan, Richard (2005) The British Occupation of Indonesia 1945–1946: Britain, the Netherlands and the Indonesian revolution'' (London:Routledge).\n* Parrott, J. G. A., Role of the 49 Indian Infantry Brigade in Surabaya, Oct.-Nov. 1945, Australian thesis\nExternal links\n* Picture of [http://digilib.petra.ac.id/jiunkpe/mmedia/pust/1945/jiunkpe-ns-mmedia-1945-na00001-31-wreckedcar-resource1.jpg General Mallaby's burnt out car] . This photograph was taken in November 1945 by Sergeants Davis and MacTavish of the British No. 9 Army Film and Photographic Unit. See Imperial War Museum Collection Search [http://www.iwm.org.uk/collections/item/object/205208464 Reference No. SE 5724]\n* Picture of the [http://digilib.petra.ac.id/jiunkpe/mmedia/pust/1933/jiunkpe-ns-mmedia-1933-na00001-10-internatio-resource1.jpg Internatio Building]  scene of 30 October Incident and Mallaby's Death."
    }
  ]
}