{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Guadiaro\n\nAbbot of (16)Sant Cugat del VallèsArnulfo Bishop of VicAecio Bishop of Barcelona\n| casualties2       = 3000 Catalan deathUnknown Córdoban losses\n| casualties1       = Unknown\n| strength1         = Unknown\n| strength2         = 30,000 Córdobans9000 Catalan\n}}\nThe Battle of Guadiaro (21 June 1010) was a battle of the Fitna of al-Andalus, that took place at the Guadiaro River near Ronda, between the Berber forces of Sulayman ibn al-Hakam with the help of berber leaders such as Zawi ibn Ziri and other Zenata chiefs, against the combined forces of the Caliphate of cordoba led by the caliph Muhammad II of Córdoba numbered at 30,000 fighter and 9000 Catalan mercenaries. The battle ended in a decisive victory for the Berbers with Muhammad II of Córdoba retreating to Córdoba.\nBackground\nThe seizure of the Caliphal throne by Muhammad II of Córdoba provoked Abd al-Rahman Sanchuelo who was raiding Léon territory. He marched to Córdoba, but many of his soldiers defected, as a result he was defeated and executed by Muhammad followers.\nMuhammad II of Córdoba then attacked the Berbers, who had chosen Sulayman ibn al-Hakam as their Caliph, they defeated Muhammad at the Battle of Qantish with Castilian help. Muhammad fled to Toledo, where he received help of 9000 Catalan soldiers and marched again on Córdoba. Sulayman met him at the Battle of Aqbat al-Bakr in 1010 where he was defeated and had to flee to the south. Muhammad II of Córdoba entered Córdoba in triumph where the people of Córdoba called him their \"Avenger and Deliverer\" and prepared for a final strike on the Berbers.\nBattle\nThree weeks later after the Battle of Aqbat al-Bakr, Muhammad II of Córdoba over confident from his hardly-won victory, rashly ventured to attack the Berbers before his troops had recovered from a forced march. He pursued the Berbers, who had retreated into southern Andalucia, where Sulayman ibn al-Hakam took advantage of Muhammad's exhausted troops. He finished his harrangue by these words : \" this day must we contend till we conquer our remain on the field, there is no hope for us save in the might of our swords, wherefore let no man bend his neck to the scimitar of his enemy, but if we may not be victors let us at least die avanged\".\nOn 21 June 1010, Sulayman ibn al-Hakam confronted the enemy force led by Muhammad II of Córdoba in Guadiaro river near the city of Ronda, and defeated them in a countercharge. Many of the Catalan troops were drowned because they were so laden down with gold and silver from their expedition. Around 3000 of them were killed, including bishops such as Abbot of Sant Cugat del Vallés, Aecio of Barcelona, Odón of Girona and Arnulfo of Vic (some sources say that Odón and Arnulfo were mortally wounded and died later). The remaining Catalan forces seeing so many men die from their side withdraw to their home refusing to help in the defense of Córdoba and Muhammad II of Córdoba retreated to the capital.\nAftermath\nMuhammad set himself to strengthen the fortifications of the city of Córdoba, the capital of the caliphate. He was forced to recruit the population of the city for work. He restored the towers, repaired parts that had become dilapidated and made trenches around the city. However people started to leave Muhammed party and his Hajib Wadih al-Siqlabi had him killed, eventually restoring Hisham II to the throne once again.\nOn the other Hands Berbers decided not to hurry back to Córdoba but to divide southern Andalusia, the Sanhaja with Zawi ibn Ziri conquered Elvira, and smaller Zenata groups took possessions in Arcos, Jaén, Morón. Four months later they started the Siege of Córdoba.\nReferences"
    }
  ]
}