{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Haman\n\n*\n*\n| combatant2        =\n| commander1        =  William B. Kean\n| commander2        = Pang Ho San\n| units1            =  25th Infantry Division\n*24th Infantry Regiment\n*27th Infantry Regiment\nNational Police\n| units2            = 6th Division\n| strength1         = 5,500\n| strength2         = 10,000\n| casualties1       = ~150 killed~400 wounded\n| casualties2       = ~8,000 killed, captured and deserted\n| campaignbox       =\n}}\nThe Battle of Haman was one engagement in the larger Battle of Pusan Perimeter between United Nations Command (UN) and North Korean forces early in the Korean War from August 31 to September 19, 1950, in the vicinity of Haman County in South Korea.  The engagement ended in a victory for the UN after large numbers of United States Army (US) and Republic of Korea Army (ROK) troops repelled a strong Korean People's Army (KPA) attack on the town of Haman.\nOperating in defense of Masan during the Battle of Masan, the US 24th Infantry Regiment was stretched along a long line on a ridge to the west of the town, at Haman. When the KPA 6th Division attacked the town, the US troops fought to repel their advance in a weeklong battle in which the 24th Infantry performed poorly, and other US reinforcements were brought in to assist in fighting off the attack.\nBackground\nPusan Perimeter\nFrom the outbreak of the Korean War and the invasion of South Korea by the North, the KPA had enjoyed superiority in both manpower and equipment over both the Republic of Korea Army (ROK) and the UN forces dispatched to South Korea to prevent it from collapsing. The KPA tactics were to aggressively pursue UN forces on all avenues of approach south and to engage them aggressively, attacking from the front and initiating a double envelopment of both flanks of the unit, which allowed the KPA to surround and cut off the opposing force, which would then be forced to retreat in disarray, often leaving behind much of its equipment. From their initial June 25 offensive to fights in July and early August, the KPA used these tactics to effectively defeat any UN force and push it south. However, when the UN forces, under the Eighth United States Army, established the Pusan Perimeter in August, the UN troops held a continuous line along the peninsula which KPA troops could not flank, and their advantages in numbers decreased daily as the superior UN logistical system brought in more troops and supplies to the UN forces.\nWhen the KPA approached the Pusan Perimeter on August 5, they attempted the same frontal assault technique on the four main avenues of approach into the perimeter. Throughout August, the KPA 6th Division, and later the KPA 7th Division, engaged the US 25th Infantry Division at the Battle of Masan, initially repelling a UN counteroffensive before countering with battles at Komam-ni and Battle Mountain. These attacks stalled as UN forces, well equipped and with plenty of reserves, repeatedly repelled KPA attacks. North of Masan, the KPA 4th Division and the US 24th Infantry Division sparred in the Naktong Bulge area. In the First Battle of Naktong Bulge, the KPA division was unable to hold its bridgehead across the river as large numbers of US reserve forces were brought in to repel it, and on August 19, the KPA 4th Division was forced back across the river with 50 percent casualties. In the Taegu region, five KPA divisions were repulsed by three UN divisions in several attempts to attack the city during the Battle of Taegu. Particularly heavy fighting took place at the Battle of the Bowling Alley where the KPA 13th Division was almost completely destroyed in the attack. On the east coast, three more KPA divisions were repulsed by the ROK at P'ohang-dong during the Battle of P'ohang-dong. All along the front, the KPA troops were reeling from these defeats, the first time in the war their tactics were not working.\nSeptember push\nIn planning its new offensive, the KPA command decided any attempt to flank the UN force was impossible thanks to the support of the UN naval forces. Instead, they opted to use frontal attack to breach the perimeter and collapse it; this was considered to be the only hope of achieving success in the battle. Fed by intelligence from the Soviet Union, the North Koreans were aware of the UN forces building up along the Pusan Perimeter and that they must conduct an offensive soon or they could not win the battle. A secondary objective was to surround Taegu and destroy the UN units in that city. As part of this mission, the KPA would first cut the supply lines to Taegu.\nOn August 20, the KPA commands distributed operations orders to their subordinate units. The plan called for a simultaneous five-prong attack against the UN lines. These attacks would overwhelm the UN defenders and allow the KPA to break through the lines in at least one place to force the UN forces back. Five battle groupings were ordered. In the southern part of its sector, where the US 25th Infantry Division held the UN line, KPA I Corps planned a strong attack, coordinating it with an attack against the US 2nd Infantry Division to the north. The KPA 6th and 7th Divisions received their attack orders on August 20. The plan called for KPA I Corps to assault all along the line at 22:00 on August 31. The 6th Division, farthest south on the right flank, was to attack through Haman, Masan, and Chinhae and then capture Kumhae, on the west side of the Naktong River delta  from Pusan, by September 3. The division zone of attack was to be south of the highway from Chinju to Komam-ni to Masan. The 7th Division, next in line north of the 6th Division, was to attack north of the Masan highway, wheel left to the Naktong, and wait for the 6th Division on its right and the KPA 9th Division on its left to join it. Part of the 7th Division was concentrated in the Uiryong area west of the Nam River. This plan pitted the 6th Division against the US 24th Infantry Regiment and the 7th Division against the US 35th Infantry Regiment. As a part of this plan, the KPA 6th Division had been engaging the 24th Infantry at Battle Mountain for several weeks prior, with no gains for either side. 25th Division commander General William B. Kean, aware of a pending offensive and distrusting the 24th Infantry's ability, began to compile a report on the regiment's performance to determine how to improve its capabilities.\nBattle\nNorth Korean attack\nIn the left center of the 25th Division line, Lieutenant Colonel Paul F. Roberts' 2nd Battalion, 24th Infantry, held the crest of the second ridge west of Haman,  from the town. From Chungam-ni, in KPA territory, a secondary road led to Haman along the shoulders of low hills and across rice paddy ground, running east  south of the main Chinju–Masan road. It came through Colonel Roberts' 2nd Battalion position in a pass  west of Haman. Late in the afternoon of August 31, observers with G Company, 24th Infantry, noticed activity  in front of their positions. They called in two air strikes that hit this area at dusk. US artillery sent a large concentration of fire into the area, but the effect of this fire was not known. All US units on the line were alerted for a possible KPA attack.\nThat night the KPA launched a coordinated offensive against the entire UN force. The KPA 6th Division advanced first, hitting F Company on the north side of the pass on the Chungam-ni-Haman road. The ROK troops in the pass left their positions and fell back on G Company south of the pass. The KPA captured a 75&nbsp;mm recoilless rifle in the pass and turned it on US tanks, knocking out two of them. They then overran a section of 82&nbsp;mm mortars at the east end of the pass. South of the pass, at dawn, First Lieutenant Houston M. McMurray found that only 15 out of 69 men assigned to his platoon remained with him, a mix of US and ROK troops. The KPA attacked this position at dawn. They came through an abandoned opening in the barbed wire perimeter. Throwing grenades and spraying the area with sub-machine gun fire, the KPA quickly overran the position. Numerous officers and non-commissioned officers attempted to get the men back into line, but they would not follow these orders. In one instance ROK troops killed their own company commander when he tried to stop them from escaping.\nOn the line farther to the south, KPA T-34 tank fire hit E Company at midnight. First Lieutenant Charles Ellis, the company commander, attempted to rally his men but they crumbled under fire, retreating without orders. During the night everyone in E Company ran off the hill except Ellis and 11 men. Several E Company men fled through a mine field they had set up and were killed. KPA fire pinned Ellis' men down after dawn on September 1. When three or four of the group tried to escape, KPA machine gun fire killed them. Ellis and the remaining men stayed in their foxholes on the hill for two days, repelling several attacks in that time. Ellis was then able to withdraw south, up the mountain to the 3rd Battalion's position. In his withdrawal, Ellis, discovering a man who had been injured earlier in a mine explosion, entered the mine field to rescue him.\n24th Infantry collapses\nShortly after the KPA attack started most of the 2nd Battalion, 24th Infantry, fled its positions. One company at a time, the battalion was struck with strong attacks all along its front, and with the exception of a few dozen men in each company, each formation quickly crumbled, with most of the troops running back to Haman against the orders of their officers. The KPA passed through the crumbling US lines quickly and overran the 2nd Battalion command post, killing several men there and destroying much of the battalion's equipment. With the 2nd Battalion broken, Haman was open to direct KPA attack. As the KPA encircled Haman, Lt. Col. Roberts ordered an officer to take remnants of the battalion and establish a roadblock at the south edge of the town. Although the officer directed a large group of men to accompany him, only eight did so. The 2nd Battalion was no longer an effective fighting force. Pockets of its soldiers remained in place and fought fiercely, but the majority fled upon attack, and the KPA were able to move around the uneven resistance. They surrounded Haman as the 2nd Battalion crumbled in disarray.\nRegimental commander Colonel Arthur S. Champeny moved the 24th Regiment command post from Haman  northeast to a narrow defile on a logistics road the regimental engineers had constructed to improve supply movement, called the Engineer Road. At this time, a KPA group attacked C Battery, 159th Field Artillery Battalion,  from Haman. Two tanks of the 88th Tank Battalion helped defend the battery until the artillerymen could pack up the howitzers and escape back through Haman and then eastward over the Engineer Road. Troops of the US 27th Infantry Regiment and the 35th Infantry Regiment were alerted to begin to reform their lines to compensate for the 2nd Battalion, 24th Infantry's collapse. At the time commanders blamed the African American troops for being sub-par soldiers, but officers later contended that poor organization of defensive positions, over-extension of the already weakened battalion, and reliance on unreliable ROK troops to plug numerous gaps in the line were the primary factors in the quick defeats of the 2nd Battalion, 24th Infantry.\nThe assault did not strike the southern part of the line held by Lieutenant Colonel John T. Corley's 3rd Battalion, 24th Infantry, and the 5th Infantry Regiment. That part of the line, however, did receive artillery and mortar fire and some diversionary light attacks. At about 02:00 on September 1, men in an outpost on the right flank of Corley's battalion watched an estimated 600 KPA soldiers file past at a distance of , going in the direction of Haman. Viewed during the night from the high ground of the 3rd Battalion, Haman seemed to be in flames. At dawn, men in the battalion saw an estimated 800 KPA troops enter the town.\nWhen the KPA attack broke through the 2nd Battalion, Champney ordered the 1st Battalion, about  south of Haman on the Chindong-ni road, to counterattack and restore the line. Roberts assembled 40 men, all he could find of the disorganized 2nd Battalion, to join in this counterattack, which got under way at 07:30. Upon contact with the KPA, the 1st Battalion broke and fled to the rear. Thus, shortly after daylight the scattered and disorganized men of the 1st and 2nd Battalions of the 24th Infantry had fled to the high ground  east of Haman. The better part of two regiments of the KPA 6th Division poured into and through the Haman gap, now that they were holding the town.\nNorth Korean breakthrough\nGeneral Kean saw the KPA breakthrough at Haman as a serious threat to his division's line. At dawn on September 1, Kean requested permission from Eighth Army commander General Walton S. Walker to commit the entire 27th Infantry Regiment, just arrived at Masan the previous evening and still held in Eighth Army reserve. Walker denied this request, but did release one battalion of the regiment to Kean's control. Kean immediately dispatched Lieutenant Colonel Gilbert J. Check's 1st Battalion, 27th Infantry from its assembly area near Masan toward Haman, to be attached to the 24th Infantry upon arrival at the regimental command post. The 1st Platoon of the 27th Regiment's Heavy Mortar Company; a platoon of B Company, 89th Tank Battalion; and A Battery, 8th Field Artillery Battalion, reinforced Check's battalion. Check with his battalion arrived at Champney's 24th Infantry command post  east of Haman at 10:00.\nThe scene there was chaotic. Large numbers of vehicles loaded with soldiers were moving down the road to the rear. Many soldiers on foot were on the road. Champney tried repeatedly but in vain to get these men to stop and turn around. The few KPA mortar shells falling occasionally in the vicinity did no damage except to cause the troops of the 24th Infantry and intermingled ROK to panic further and increase their speed to the rear. The road was so clogged with retreating troops that Check had to delay his counterattack. In the six hours he waited at this point, Check observed that none of the retreating troops of the 1st and 2nd Battalions, 24th Infantry, could be assembled as units. Military police tried in vain to reassemble troops, but they refused even at gunpoint. At 16:00, the 2nd Battalion, 24th Infantry, assembling in the rear of the 27th Infantry, could muster only 150 to 200 men.\nThe KPA, in the meantime, were suffering serious logistics problems which prevented them from supplying their troops effectively with ammunition, food, and medical care. At the same time, elements of the division, including thousands of people forcibly conscripted from South Korea, were becoming increasingly hard to keep in place. The division was having difficulty strengthening its position at Haman.\nUN counterattack\nAt 14:45 on September 1, Kean ordered an immediate counterattack to restore the 24th Infantry positions. For 30 minutes US Air Force (USAF) aircraft, including F-51 Mustangs and F-80 Shooting Stars, struck KPA positions around Haman with bombs, napalm, rockets, and machine gun fire. They also attacked the KPA-held ridges around the town. Fifteen minutes of concentrated artillery fire followed. Fires spread in Haman. Check's infantry attacked west at 16:30, reinforced by a platoon of tanks from A Company, 79th Tank Battalion. Eight tanks, mounting infantry, spearheaded the attack into Haman, capturing the city easily, as most of the KPA troops had abandoned it. KPA in force held the ridge on the west side of the town, and their machine gun fire swept every approach. KPA fire destroyed one tank and the attacking infantry suffered heavy casualties. But Check's battalion pressed the attack and by 18:25 had seized the first long ridge  west of Haman. By 20:00 it had secured half of the old battle position on the higher ridge beyond,  west of Haman. Just  short of the crest on the remainder of the ridge, the infantry dug in for the night. It had recaptured Haman and was pushing back to the 24th's old positions.\nAll day September 2, air strikes harassed the KPA and prevented them from consolidating their gains and reorganizing for further coordinated attack. Some of the planes came from the carriers  and ,  away in the Yellow Sea and steaming toward the Masan battlefield. At 10:45, Eighth Army messaged Kean that the 27th Infantry was to be alerted for a possible move north into the US 2nd Infantry Division sector. West of Haman the KPA and US troops faced each other during the night without further battle, but the KPA kept flares over their position. In the rear areas, KPA mortar fire on the 24th Regiment command post caused Champney to move it still farther to the rear.\nIn the morning, under cover of a heavy ground fog, the KPA struck Check's battalion in a counterattack. This began a heavy fight which lasted all morning. Air strikes using napalm incinerated many KPA troops and helped the infantry to gain the ridge. At 12:00, the 1st Battalion, 27th Infantry, secured the former positions of the 2nd Battalion, 24th Infantry, and took over the same foxholes that unit had abandoned two nights before. During September 2, the USAF flew 135 sorties in the 25th Infantry Division sector, reportedly destroying many KPA units, several tanks and artillery pieces, and three villages containing ammunition dumps.\nEarly the next morning, September 3, the KPA heavily attacked Check's men in an effort to regain the ridge. Artillery, mortar, and tank fire barrages, and an air strike directed from the battalion command post, met this attack. Part of the battalion had to turn and fight toward its rear. After the attack had been repulsed hundreds of KPA lay dead around the battalion position. A prisoner estimated that during September 2 and 3 the four KPA battalions fighting Check's battalion had lost 1,000 men.\nCheck's battalion held the ridge until dark on September 4, then the 1st Battalion and F Company of the 2nd Battalion, 24th Infantry, which had reorganized in the rear, relieved it. The 1st Battalion, 27th Infantry moved back into a secondary defensive position at  east of Haman. Champney moved his command post back into Haman, placing it at the base of a hill  west of the center of the town.\nInfiltration\nBefore dawn on September 5, a KPA force of two companies moved against Haman again. A part of this force approached the hill at the western edge of Haman, where H Company was posted as security for the 24th Regiment command post situated at its base. Most of the H Company men left their post without firing a shot, abandoning two new machine guns. KPA captured the guns and opened fire on the regimental command post. A small group of KPA infiltrated into Haman within  of the command post, where members of the Intelligence and Reconnaissance Platoon drove them off in a grenade battle.\nAbout 20 KPA soldiers approached, undiscovered, close enough to the 1st Battalion, 24th Infantry, command post west of Haman to throw grenades and fire into it. About 45 soldiers of the battalion command group and 20 ROK recruits were in position there at the time. The KPA were driven off at dawn, but Major Eugene J. Carson, battalion executive officer, then discovered that he had on the position with him only 30 men, 7 of them wounded. Looking back down the hill, Carson saw approximately 40 men get up out of the rice paddies and go over to a tank at a roadblock position. These men reported to the regiment that they had been driven off the hill. Three tanks near the command post helped clear the town of KPA.\nAt the time of this infiltration, a white officer and 35–40 African-American soldiers left their position south of Haman at a roadblock and fled to the rear until they reached Check's 1st Battalion, 27th Infantry, command post  away. There, at 05:00 this officer said 2,000 KPA had overrun his position and others near Haman, including the 24th Regiment command post. Check reported this story to Kean, and then sent a platoon of tanks with a platoon of infantry toward Haman to find out what had happened. Some of his officers, meanwhile, had stopped about 220 soldiers streaming to the rear. Check ordered these men to follow his tank and infantry patrol back into Haman. Some of them did so only when threatened with being shot. The tank-led column entered Haman unopposed, where they found the 24th Regiment command post intact and everything quiet. The next day, September 6, a sniper severely wounded Champney while he was inspecting his front-line positions west of Haman and Champney was evacuated. The commanding officer of the 3rd Battalion, Corley, succeeded to the command of the regiment.\nAfter the KPA infiltration on September 7 was repelled, the KPA attack on Haman ground to a halt. The KPA, racked by logistical and manpower shortages, focused more heavily on their attacks against 24th Infantry positions on Battle Mountain, as well as 35th Infantry positions at the Nam River. 24th Infantry troops at Haman encountered only probing attacks until September 18.\nNorth Korean withdrawal\nThe UN counterattack at Inchon on September 15 outflanked the KPA and cut off all their main supply and reinforcement routes. On 16 September when the Eighth Army began its breakout from the Pusan Perimeter the 25th Infantry Division was still fighting KPA forces behind its lines, and KPA strong points existed on the heights of Battle Mountain, P'il-bong, and Sobuk-san. Kean felt that the division could advance along the roads toward Chinju only when the mountainous center of the division front was clear. He therefore believed that the key to the advance of the 25th Division lay in its center where the KPA held the heights and kept the 24th Infantry Regiment under daily attack. The 27th Infantry on the left and the 35th Infantry on the right, astride the roads between Chinju and Masan, held their positions and could not advance until the situation in front of the 24th Infantry improved.\nOn September 19 the UN discovered the KPA had abandoned Battle Mountain during the night, and the 1st Battalion, 24th Infantry, moved up and occupied it. On the right, the 35th Infantry began moving forward. There was only light resistance until it reached the high ground in front of Chungam-ni where hidden KPA soldiers in spider holes shot at 1st Battalion soldiers from the rear. The next day the 1st Battalion captured Chungam-ni, and the 2nd Battalion captured the long ridge line running northwest from it to the Nam River. Meanwhile, the KPA still held strongly against the division left where the 27th Infantry had heavy fighting in trying to move forward.\nThe KPA withdrew from the Masan area the night of September 18–19. The KPA 7th Division withdrew from south of the Nam River while the 6th Division sideslipped elements to cover the entire front. Covered by the 6th Division, the 7th had crossed to the north side of the Nam River by the morning of September 19. Then the KPA 6th Division had withdrawn from its positions on Sobuk-san. The US units rapidly pursued them north, passing over the Battle Mountain positions, which were no longer of strategic importance.\nAftermath\nThe 24th Infantry suffered 267 killed, 796 wounded, one captured and two missing during its time at the Pusan Perimeter, of which 450 were wounded and 150 were killed at Battle Mountain. The 8th Field Artillery Battalion, supporting the 24th Infantry, suffered 18 killed and 26 wounded, while the 79th Tank Battalion, also in support, suffered two killed and 20 wounded.\nThe KPA suffered heavily in the fight for Masan, and most became casualties in the attack. By mid-September, the KPA 7th Division was reduced to just 4,000 men, a loss of 6,000 from when it was committed to the perimeter. Only 2,000 from the KPA 6th Division returned to North Korea, a loss of 80 percent of its strength.  Up to 3,000 troops were captured as they attempted to return to North Korea. The attacking force of over 20,000 had been reduced to only 6,000 by the end of the fights around Masan. It is nearly impossible, however, to calculate how many were lost in each individual engagement.\nDesertion was a problem for the 24th Infantry; the 25th Infantry Division had to detain 116 deserters from the 24th Infantry during August, compared to 15 from the 27th Infantry and 12 from the 35th Infantry. In late August, General Kean began investigating the unit's behavior, including its poor performance at the battle of Sangju several weeks earlier, and found its performance was affecting other units of the division. After the 24th's performance at the battles of Battle Mountain and Haman, Kean suggested to Walker that the regiment be disbanded and its troops be used as replacements for other units in the field. Virtually all of the officers and enlisted men in the regiment were supportive of this idea, but Walker declined, feeling he could not afford to lose a regiment. Even if his other units were reinforced, he did not feel they could be extended to cover the entire line. the new regiment commander, Corley instituted sweeping changes in leadership in the regiment, hoping to improve its combat performance. He was able to cut down on straggling to a degree with more strict threats of court martial, but this had a negative effect on the regiment's morale. He began a unit newspaper, eventually called Eagle Forward, and moved to allow more discourse for the soldiers and leaders of the unit, and this was shown to improve the morale to a degree. Wanting to build a sense of pride in the unit, he sought to emphasize the toughness of the battles the regiment had seen, and played up its victory at the Battle of Yechon while downplaying other poor performances.\nCitations\nNote\nReferences\nSources\n*\n*\n*\n*\n*\n*\n*\n*\nFurther reading\n*"
    }
  ]
}