{
  "content": [
    {
      "type": "text",
      "text": "# Battle of Haktang-ni\n\n| combatant1 =\n*\n*\n*\n| combatant2 =\n| commander1 =  Robert Soule Norbert Cools Georges Vivario\n| commander2 =  Ye Jianmin\n| units1     =  Belgium–Luxembourg Battalion\n| units2      =  141st Division\n| strength1   = 560\n| strength2   = Several battalions\n| casualties1 = 10 killed14 wounded\n| casualties2 = 98 killed and wounded4 captured\n|map_type=North Korea\n|coordinates =\n|map_size=\n|map_caption=\n| campaignbox =\n}}\nThe Battle of Haktang-ni was a skirmish in which elements of the People's Volunteer Army attacked an advanced position held by the Belgium–Luxembourg Battalion along a ridge-line known as \"Broken Arrow\" or \"Broken Arrow Hill\" (Hill 391) between 9 and 13 October 1951.\nBackground\nHaktang-ni (, Hakdang-ri) is an isolated ridge about 1,500 meters long, extending from south to north and dominating the surrounding plain for hundreds of metres in each direction. It is rocky and entirely clear of cover. At the northern extremity of the hill is the steepest and highest point of the hill, the centre section plateaus before a very steep rocky outcrop to the extreme south. It was labeled Hill 391 by the US Army while the South Korean Institute for Military History's official history called it Hill 388.\nBattle\n10 October 1951: Belgian contingent arrives at Haktang-ni\nThe Belgian battalion arrived at Haktang-ni at 14:00 in the no-man's land  in front of other UN positions held by the US 65th Infantry Regiment between UN and PVA lines on 10 October 1951 and dug in. C Company dug in at the northern peak, while next B Company entrenched in the northern section of the central plateau. In order that the southern point would not be taken by the PVA and used as a base for mortar attacks, the 40-men of the Heavy Weapons Company equipped with American supplied .30 Machine Guns and 75&nbsp;mm guns took up position on the southern peak 300–400 metres away from the rest of the battalion.\nThe Belgian Contingent was badly under strength at the time of the battle (comprising only 560 men instead of the more usual 900) since the battle occurred in the middle of a troop rotation in which many soldiers who had been in Korea since February 1951 (including a Luxembourg detachment, which formed part of A Company) had returned home in September 1951 – and reinforcements had not arrived.\n10–11 October: Chinese artillery attack\nAlmost immediately from their arrival at Haktang-ni, Belgian forces came under fire from artillery fire from PVA 76mm guns and mortar fire. One Belgian soldier was killed, several were wounded. In the evening of 10 October, the first PVA patrols attacked the positions of B Company. Recognising the importance of holding the position, the US 3rd Infantry Division commander Major General Robert H. Soule visited the positions at Haktang-ni by helicopter.\nAs evening fell on the night of 11 October, the Belgians again came under fire – this time from PVA 60mm mortars from neighbouring Hill 317.\n12 October 1951: Start of the battle\nIn the early morning of 12 October 1951 several small-scale PVA assaults were repelled. First, at 03:45 a PVA patrol, supported by machine gun fire, attacked the Heavy Weapons Company. It was eventually driven back by US artillery fire from 105&nbsp;mm and 155&nbsp;mm artillery. One Belgian soldier was killed during this assault with six soldiers wounded of whom two were Korean soldiers attached to the Belgian Battalion.\nLater that day, from 08:00 to 15:00, patrols from B Company, climbed nearby Palli-Bong Hill (Hill 488) which was being used as an observation post by PVA forces. A second patrol from the Reconnaissance Platoon reached nearby Hill 317 found a PVA ammunition dump, which they destroyed, and then returned to Haktang-ni.\nDuring the day, numerous squads of 5–10 PVA soldiers had infiltrated behind the Belgian lines. The thick fog that had covered the battlefield during the day dispersed at 23:30 at the same moment as the main PVA assault began on the Heavy Weapons Company.\nMorning of 13 October 1951: Main PVA assault\nand Polecharge.]]\nThe main PVA attack on the Heavy Weapons Company began at 23:30 on 12 October. The PVA troops were advancing on the front line of the Reconnaissance Platoon in perfect silence, moving through the barbed wire, when they can under fire from machine guns and flamethrowers. At the same time, B Company and the Heavy Weapons Company came under attack. PVA troops even took the position used by the HQ of the battalion. At 02:00, renewed PVA assaults began on the Heavy Weapons Company. However, by 04:00, the main attacks had been repulsed and all positions re-occupied. At daybreak, Hill 317 was re-occupied by Belgian troops, and a reconnaissance patrol from C Company came under machine gun and mortar fire from Palli-Bong hill.\nDuring the night, the bodies of many wounded and dead PVA soldiers were recovered by their comrades. Indeed, only 4 wounded PVA soldiers remained on the battlefield at daybreak. They were taken prisoner by the Belgians.\nAftermath\nOn orders from General Soule, the Belgians withdrew from positions back to the UN lines, taking up positions on Hill 362. Withdrawing from Haktang-ni, the Belgians watched a heavy artillery barrage falling on their vacated positions.\nThe Belgian Battalion was awarded the citation of \"HAKTANG-NI\" on the flag of the unit which now held by the 3rd Parachute Battalion of the Belgian Army. A \"Haktang-ni\" bar was added to the campaign medals of those who served at the battle.\nSee also\n* Battle of Chatkol\n* Battle of Arrowhead Hill\n* Battle of White Horse Hill\nNotes\n;Footnotes\n;Citations\n;Bibliography\n*\n*\n*\nExternal links\n*  [https://web.archive.org/web/20130104170523/http://korea.alamongordo.com/index_belgian_volunteercorps_korea_Haktang_Ni.html Battle of Haktang-ni]\n* [https://archive.today/20130115073043/http://users.telenet.be/belgischbataljonkorea/english/haktangni.htm Description of the Battle]\n* [http://www.belgian-volunteercorps-korea.be/english/haktangni.htm Description of the Battle with model of the hill]"
    }
  ]
}