{
  "content": [
    {
      "type": "text",
      "text": "# Bavarian Warmblood\n\nThe Bavarian Warmblood is a horse breed of southern Germany that developed from an older Bavarian heavy warmblood breed called the Rottaler. Since mechanization in the mid-20th century, the '''Bavarian Regional Horse Breeders' Society''' has concentrated on producing a riding horse for the Olympic disciplines and recreational riding based on other European warmblood bloodlines.\nCharacteristics\nThe easiest way to recognize a Bavarian Warmblood is by the brand on the left thigh, which is a crowned shield outside the letter \"B\". All colors are permitted, though dark, solid colors are preferred. The ideal height is between .\nBavarian Warmbloods are similar to other German warmbloods in type, conformation, movement, jumping ability and interior qualities. Desirable type includes an elegant, attractive horse with dry limbs and head and clear sex expression. Conformation reflects the stamp of a correct sport horse. Correct movement includes three rhythmic gaits characterized by energy, a long stride, natural self-carriage and elasticity, with some knee action. Selection processes aim for enthusiastic, capable jumpers with \"bascule\" (arc over the fence), \"scope\" (ability to respond to changes in the environment), and \"tact\" (carefully pulling the legs out of the way). Horses that are difficult, nervous, or aggressive are identified and typically are not allowed to breed.\nBreeding stallions and mares are chosen by thorough studbook selection, which eliminates horses that do not fit the breeding goal from the breeding studbooks. The Bavarian Warmblood is by no means set in type and recognizable the way that breeds from closed studbooks are; instead, they are recognizable by their athletic ability and temperament.\nBloodlines\nCurrently, the stallion roster is 45% Bavarian Warmblood stallions. Holsteiner stallions make up a further 42%. Other German warmbloods – Hanoverians, Oldenburgs, Westphalians, Württembergers, Rhinelanders, Thuringians, and German Warmbloods, (Zuchtverband fur deutsche Pferde or ZfDP) – make up 24%.\nThere are a handful of Dutch Warmblood, Trakehner and Thoroughbred stallions as well, though the Bavarian studbook is rather unusual for including a Russian Warmblood and two Budyonny stallions.\nOf the Bavarian-bred stallions, a few had Bavarian sires, though most were sired by a Hanoverian, Westphalian, Oldenburg, or Holsteiner. Several Selle Français sires also have sons in the Bavarian studbook, and one Bavarian-bred stallion each is by a Trakehner, Thoroughbred, and Anglo-Arabian.\nHistory\nThe predecessor of the Bavarian Warmblood is the Rottaler, an all-purpose horse very similar to other heavy warmbloods. The best Rottalers were calm, substantial horses suitable for plowing, carriage driving, and non-competitive riding. In 1907 a registry for Rottalers was founded. The riding horse direction began in 1963 and the Rottaler was renamed \"Bavarian Warmblood.\"\nStallions with the old type were replaced by Hanoverians, Westphalians, Holsteiners, Trakehners, and Thoroughbreds. The Rottaler blood was soon diluted and today comprises the mother line of some approved stallions. To save the old type from extinction, a preservation society was formed in 1994.\nToday, Bavarian Warmblood pedigrees are made up of blood from other German warmbloods, particularly Holsteiners, Hanoverians, Westphalians, Oldenburgs, Württembergers, Rhinelanders, and Saxony-Thuringian Warmbloods, plus a number of approved Dutch Warmbloods, Thoroughbreds, Trakehners, and even Budyonny stallions.\nIn recent years, the Bavarian Regional Horse Breeders' Society has begun co-hosting a stallion licensing event with the Horse Breeding Societies of Baden-Württemberg, Rheinland-Pfalz Saar, and Saxony-Thueringen. The South-German Stallion Licensing is held in Munich. They also hold elite foal auctions and free jumping competitions for young horses. Together, all four registries have nearly 500 stallions and over 11,000 mares. There are about 150 Bavarian Warmblood stallions and almost 4,000 broodmares.\nUses\non a Bavarian Warmblood, 2012]]\nThe Bavarian Warmblood is seen in international sport horse competition, including eventing, show jumping and dressage. In the 2006 final standings in international sport, the Bavarian Warmblood was ranked 13th in show jumping, 15th in dressage, and 12th in eventing.\nBavarian Warmbloods are also popular choices in the sport of combined driving and have been part of several World Cup teams. In the United States, there are several prominent show hunters with the Bavarian brand.\nMedical issues\nThorough health-screening of breeding stallions before they stand stud has resulted in a population largely free of congenital diseases. The size and growth rate of warmbloods in general has made Osteochondrosis (OCD) the primary health concern.\nSee also\n* List of German horse breeds\nReferences\n*\n*\n*\n*\n*\nExternal links\n* [https://www.bayerns-pferde.de/ Landesverband Bayerischer Pferdezuechter e.V.] (Bavarian Horse Breeders Association)\n* http://www.tiho-hannover.de/einricht/zucht/eaap/descript/1451.htm\n* https://web.archive.org/web/20070927215553/http://www.equiworld.net/UK/HORSECARE/BREEDS/bavarian/index.htm"
    }
  ]
}