{
  "content": [
    {
      "type": "text",
      "text": "# Baya al Ward__disambig_1\n\n| type       = Album\n| artist     = Amal Hijazi\n| cover      = Amal-baya_al_ward.jpg\n| alt        =\n| released   = 23px 2006\n| recorded   = 2005&ndash;2006\n| venue      =\n| studio     =\n| genre      = Arabic Pop\n| length     =\n| label      = Rotana\n| producer   = Jean Saliba, Fadi Bitar\n| prev_title = Bedawwar A Albi\n| prev_year  = 2004\n| next_title = Keef el Amar\n| next_year  = 2008\n| misc       =\n}}\nBaya al Ward (, ) is the fourth studio album by the Lebanese singer Amal Hijazi released under the label Rotana in 2006. For the project, Hijazi collaborated with renowned producers like Jean Saliba and Fady Bitar and worked with some of the biggest names in the industry like Elias Naser, Samer Nakhla and Haytham Ziad. Despite the negative publicity and controversies over the album's theme, it was a commercial success, topping various charts in countries like Lebanon, Egypt, Syria, Morocco, Tunisia, UAE, and Kuwait. In addition, the album received generally positive reviews in the west and was sold highly in the UK, France and Canada.\n\"Baya al Ward\" was the lead single from the album. Despite the controversies over its music video, it was a commercial success and debuted at number one in a number of countries all around the Middle East.\nAfter the release of \"Baya al Ward\", Hijazi embarked on a highly publicised world tour. She even made a number of guest appearances in talk shows and gave various live concerts. Although there was a great demand for music videos of songs like \"Rajaa\", \"Yala Lally Amaan\", \"Lemma Tghmmed Ayneik\" and \"Jnoon Bhebbak\", Hijazi refused to film any of them because of the political instabilities in her native Lebanon. In early 2007, however, she released the music video of \"Baheb Nuoa Kalamak\" which gained generally negative reviews from critics due to its low budget and the poor production by Rotana. In addition, the music video was a fail being directed by Mirna Khayat. Critics later advised Hijazi not to cooperate with Khayat for future projects.\nDespite the attacks on the album and the music video and the controversies that Hijazi was in fact promoting homosexuality and lesbianism, the album was a bestseller of 2006. According to Hijazi, the Critical reception of her album generally had a positive impact, for it propagated the album. According to the official sales charts provided by Rotana more than three editions of the album were sold in less than a year, and this made Hijazi one of the biggest-selling singers in the Middle East, and one of the most wanted performers on stage.\nSingles\n\"Ba'ad Sneen\"\n\"Ba'ad Sneen\" (\"After Years\") was released on 2005, becoming the album's lead single. The song portrays Hijazi as a young girl living in a traditional Arab village. When her lover leaves her, she is heartbroken. After many years of punishing her heart and waiting for him, she now finds it hard to accept his wish of coming back to her. There are also many flashbacks of the wonderful time Hijazi and her lover had together.\n\"Baya al Ward\"\nThe album's title track, \"Baya al Ward\", directed by Yahya Sadeh is arguably one of the most controversial songs in Lebanese music history. It tells the story of a young girl, turned almost insane by the depression she received when her lover broke his promises. The song opens with Hijazi chopping off beautiful strands of her white-blond hair. She faces the camera and the song begins.\nShe goes down the stairs and smokes and then leaves in a picturesque blue convertible, driving up a long straight road. She drives the car as if in a dream. Later, a thorny plant appears and ravages her body. This scene is mixed between reality and daydreaming and then Hijazi finds herself and her car stopped in front of a tree besides a lake. She later walks towards the water, presumably to commit suicide.\n\"Baheb Nuoa Kalamak\"\nThe album's third single, \"Baheb Nuoa Kalamak\" (\"I love what you say\") was released in early 2007, directed by Mirna Khayat and chosen over Yahia Sa’adeh. According to the Qatar-based daily Al Raya, Hijazi revealed that she had received numerous scripts for the clip by different directors because of the immense popularity of the song, even before the music video was released.\nDespite the poor reviews of the video, the song managed to become one of the greatest hits of 2007 and an essential concert song for Hijazi.\nCritical reception\nThe music video of the title track \"Baya al Ward\" was heavily criticized and caused huge controversies that Hijazi was promoting homosexuality  Hijazi denied the allegations, but critics argued that the T-shirt she was wearing in the music video had several symbols imprinted on it, which belonged to a garment manufacturer that specializes in clothing for homosexuals. At a press conference she held in Dubai to announce the launch of her album, Hijazi clarified that she did not know what the symbols on the shirt meant or that she never thought to find out when she chose to wear it.\nCritics argued that Hijazi had gone to extremes and cut her hair shorter than that of an ordinary man or in other words, the versatile once again changed her looks, trading her brown locks for short pixie whitish-blonde hair and gowns to boyish trousers and T-shirts. In a candid interview, Hijazi stated that with the immense help of her colleagues and some talented image consultants she got this new look to match the jazzy theme of her album's title track. On the other hand, critics began accusing the video of \"Baya al Ward\" of being unusual because Hijazi chops her hair off and jumps off a cliff at the end of the video brooding over the guy who left her.\nIn addition, the artwork from the album was criticised for its \"homosexual\" theme.\nTrack listing\n# \"Baya al Ward\" ( \"The Florist\")\n# \"Rajaa\" ( \"Come Back\")\n# \"Lamma Tghammad Aeinak\" ( \"When you close your eyes\")\n# \"Tesadq\" ( \"Do you believe?\")\n# \"Ya Lalally Amaan\" ( \"Oh! Safe night\")\n# \"Baheb Nuoa Kalamak\" ( \"I love what you say\")\n# \"Gharam Kebeer\" ( \"Big Love\")\n# \"Jnoon Behabak\" ( \"Your love is crazy\")\n# \"Ba'ad Sneen\" ( \"After years\")\n# \"Betsalni Meen\" ( \"You ask me who\")"
    }
  ]
}