{
  "content": [
    {
      "type": "text",
      "text": "# Be–white dwarf X-ray binary system\n\n]]\nBe–white dwarf X-ray binary systems (BeWDs) are a rare type of X-ray binary consisting of a white dwarf that accretes matter from a rapidly-rotating Be star. These systems form through binary evolution where mass transfer spins up the accretor to become a Be star while the donor evolves into a white dwarf.\nBeWDs probably originate from a Be star and a subdwarf O or B star binaries. Population synthesis models indicate these systems can evolve through two primary pathways:\n* Approximately 60-70% merge into red giants that observationally look like luminous red novae.\n* About 30-40% evolve into double white dwarf systems that may be detectable as gravitational wave sources by Laser Interferometer Space Antenna (LISA), and will be its \"most likely gravitational wave source\".\nThe formation requires specific initial conditions: the primary must transfer sufficient mass to spin up the secondary to Be star velocities without triggering common envelope evolution. Tidal synchronization mechanisms explain the observed lack of BeWDs with orbital periods shorter than 17 days.\nBeWDs can be identified by several features:\n* Supersoft X-ray emission (kT ~ 0.1 keV)\n* X-ray luminosities of 1033-1038 erg/s\n* Deep nitrogen (0.67 keV) and oxygen (0.87 keV) absorption edges in X-ray spectra\nThe white dwarfs in these systems tend to be massive (0.9-1.35 ) with surface temperatures of 20,000-40,000 K. Detection is challenging as the white dwarf is often embedded within the Be star's decretion disk, absorbing most extreme-UV and soft X-ray photons.\nSome studies suggest that γ Cas stars, a subgroup of Be stars exhibiting bright X-ray emission, likely have white dwarf companions rather than hot subdwarf stars or main sequence stars, as interferometric observations show no detectable companion flux while the systems' properties match theoretical predictions for Be+WD binaries.\nDespite theoretical predictions that BeWDs should be 7 times more common than Be-neutron star systems, only 8 have been confirmed as of 2025. According to different numerical models, 40 to 80% of Be stars should have white dwarf companions.\n{| class=\"wikitable\"\n|+ Parameters of the observed BeWDs\n|-\n! BeWD !! Porb (day) !! LX(erg s−1) !! MWD () !! Be star !! Galaxy !! Notes and References\n|-\n| XMMU J052016.0-692505 || 510 or 1020 || 1034-1038 || 0.9-1.0 || B0-B3e || LMC || observed by XMM-Newton\n|-\n| XMMU J010147-715550 || 1264 || ~4.4 × 1033 || 1.0 || O7IIIe-B0Ie || SMC || observed by XMM-Newton\n|-\n| MAXI J0158-744 || ... || >1037; 1040 (peak) || 1.35 || B1-2IIIe || SMC || observed by MAXI\n|-\n| SWIFT J011511.0-725611 || 17.402 || 2 × 1033-3.3 × 1036 || 1.2 || O9IIIe || SMC || observed by Swift\n|-\n| SWIFT J004427.3-734801 || 21.5 || 5.7-2.9 × 1036 || ... || O9Ve-B2IIIe || SMC || observed by Swift\n|-\n| RX J0527.8-6954 || ... || 4-9 × 1036 || ... || B5eV || LMC || observed by the Gemini South telescope\n|-\n| CXOU J005245.0−722844 || 17.55 (shortening to 17.14) || 6.51 × 1038 || 1.2 || O9V-B0Ve || SMC || discovered \"via a very fast, super-Eddington X-ray outburst event\"\n|-\n| EP J005245.1−722843 || 17.55 || ~4 × 1038 || ~1.2 (likely Ne-O WD) || O9V-B0Ve || SMC || observed by the Einstein Probe\n|}\nAll identified systems are located in the Magellanic Clouds rather than the Milky Way, possibly due to lower extinction rates allowing easier detection of soft X-rays, or because of the different metallicity of the Magellanic Clouds which may be related to the formation of BeWDs.\nReferences"
    }
  ]
}