{
  "content": [
    {
      "type": "text",
      "text": "# Bear Flag Monument\n\n| catalogue          =\n| height_metric      =\n| width_metric       =\n| height_imperial    =96\n| width_imperial     =72\n| condition          =\n| city               = Sonoma, California\n| museum             =\n| coordinates        =\n| owner              = City of Sonoma\n| accession          =\n| url                =\n}}\nBear Flag Monument (also known as Raising of the Bear Flag) is a public artwork located at the Sonoma Plaza in Sonoma, California in the United States. A monument to the Bear Flag Revolt, the piece is listed as a California Historical Landmark.\nDescription\nThe sculpture depicts a man holding a flag on top of a rock, which serves as base for the bronze sculpture. The rock weighs approximately 40 tons. The man holds a flagpole in his proper left hand. In his proper right hand he holds a hat. He stands up straight and is wearing a neckerchief and a long sleeve shirt that is rolled up to his elbows. Four bronze plaques are located on the rock base, two on the front and one on the back. The lower right front plaque serves as the artist signature and is inscribed with: McQuarrie. The lower left plaque states who the foundry was: L. DE ROME FOUNDERS. The main plaque shows a grizzly bear standing on all fours on top of a shield with flags of the United States and California. The flags are crossed over each other. On the front of the base is inscribed:\nTHIS MONUMENT WAS ERECTED BY THE NATIVE SONS OF THE GOLDEN WESTAND THE STATE OF CALIFORNIA TO COMMEMORATE THE RAISING OF THE BEAR FLAGON THIS SPOT ON JUNE 14 1846 BY THE BEAR FLAG PARTY AND THEIR DECLARATIONOF THE FREEDOM OF CALIFORNIA FROM MEXICAN RULE. ON JULY 9 1846 THEBEAR FLAG WAS HAULED DOWN AND THE AMERICAN FLAG HERE RAISED IN ITSPLACE BY LIEUTENANT JOSEPH W. REVERE U.S.A. WHO WAS SENT TO SONOMAFROM SAN FRANCISCO BY COMMANDER JOHN B. MONTGOMERY OF THE U.S. SLOOPOF WAR \"PORTSMOUTH FOLLOWING THE RAISING OF THE AMERICAN FLAG AT MONTEREYJULY 7 1846 BY COMMODORE JOHN DRAKE SLOAT.\nA founder's mark can also be seen on the plaque. The plaque on the rear depicts the actual revolt, with men on horseback and on foot raising the bear flag. It is inscribed:\nTHE RAISINGOF THE BEAR FLAGJUNE 14, 1846\nThe monument is located on the northeastern corner of the Sonoma Plaza. This is the presumed spot where the Bear Flag Revolt took place. Nearby the monument is another monument, a large boulder with a bronze plaque placed on it, that states that it is the location where the bear flag was raised.\nAdditional information\nThe plaque that is on the back, which depicts the raising of the bear flag, was originally on the front of the base. It was moved between the years 1914 and 1923. On June 1, 1932, the monument was declared a California Historical Landmark, making it the seventh landmark to become named to the list. The bear flag is raised at the monument at the annual Bear Flag Celebration.\nAcquisition\nThe piece was acquired by the state of California and the Native Sons of the Golden West as a tribute to the 68th anniversary of the bear flag being raised during the Bear Flag Revolt. Groundbreaking for the site took place on October 30, 1913. It was estimated that 500 members of the Native Sons of the Golden West were in attendance. After the groundbreaking, dinner was served by the Native Daughters of the Golden West. The casting of the monument cost $5,000. The rock base and sculpture were installed onsite days before the dedication. The monument was dedicated on June 14, 1914. Then California governor Hiram Johnson spoke at the dedication. An estimated \"1,000 automobiles,\" and \"at least 5,000 visitors\" attended the event. At the time, it was stated to be the \"greatest crowd Sonoma had ever seen,\" by the Sonoma Index-Tribune.\nCondition\nThe sculpture was surveyed by the Smithsonian Institution in 1994. It was noted as needing conservation treatment at that time.\nGallery\nBearFlagMonument.JPG|Front\nBearFlagMonument SOS2.jpg|Back\nBearFlagMonument SOS3.jpg|Plaque on front\nBearFlagMonument SOS4.jpg|Plaque on back\nReferences\nExternal links\n*[http://cdm15763.contentdm.oclc.org/cdm/ref/collection/p15763coll2/id/9226 Bear Flag Monument, Sonoma, California, 1967]  as photographed by Don Meacham and in the collection of the Sonoma County Library"
    }
  ]
}