{
  "content": [
    {
      "type": "text",
      "text": "# Bear River Expedition\n\nThe Bear River Expedition took place between June 12 and October 18, 1859.  Led by Major F. J. Porter, Company \"G\" from Camp Floyd was sent to investigate an incident between Native Americans and immigrants traveling on the California Trail, where it was claimed that the native peoples had murdered the travelers on that trail.\n2nd Lieutenant E. Gay, under the command of Major Porter, encountered a group of Shoshone in Devils Gate Canyon in Weber County, Utah in what was at the time the Utah Territory and assumed that this was the same group involved in the incident he was sent to investigate.  Leading a group of 42 men and some light provisions, he made an attack upon the encampment of what he estimated to be between 150 and 200 Shoshone warriors.  In the official report, Lt. Gay claims to have killed 20 \"indians\" and about 6 of his men were wounded in the action, but there were no American soldier deaths.\nThe expedition continued on to the California Trail, where Major Isaac Lynde took over command.\nWhile in what is today called Idaho, they encountered Chief Pocatello and had him arrested under suspicion of property theft and being responsible for the murder of several travelers on the road.  Pocatello was eventually released after being cleared of the charges, and a meeting was arranged with the elder leaders of some of the surrounding tribal groups.\nOther minor encounters with the native inhabitants of the area continued, and eventually the expedition returned to Camp Floyd satisfied that the issue had been resolved.\nExternal links\n*[http://www.history.army.mil/books/R&H/R&H-APP.htm Appendix. CIRCULAR-PUBLICATION COMMITTEE. THE MILITARY SERVICE INSTITUTION, GOVERNOR'S ISLAND, N. Y. H., Nov. 10, 1889.]  Reproduced at the United States Army Center of Military History.\n*[http://www.rootsweb.com/~nalakota/wotw/military/forgottenwars_wotw063030.htm Many Of America's Wars Remembered By Very Few: United States Has Taken Up Arms On Average of Every Year and a Half During Entire National Existence] by Mary Jane Moore\n*.\n* Deseret News links\n**Sept. 21,1859: The Late Massacre Near Fort Hall, The Army and the Indian Massacres. http://udn.lib.utah.edu/cdm4/document.php?CISOROOT=/deseretnews2&CISOPTR=6019&REC=39&CISOSHOW=6020\n**Aug. 17,1859: Army Intelligence, Indian Massacre, Indian Difficulties(2 articles), More Indian Difficulties, The Indian Massacre. https://newspapers.lib.utah.edu/details?id=2589007 https://newspapers.lib.utah.edu/details?id=2588991\n**Aug. 24,1859: The Late Indian Difficulties(2 articles) http://udn.lib.utah.edu/cdm4/document.php?CISOROOT=/deseretnews2&CISOPTR=5808&REC=35&CISOSHOW=5809\n**Aug. 31, 1859: The Indian War at the North. http://udn.lib.utah.edu/cdm4/document.php?CISOROOT=/deseretnews2&CISOPTR=5846&REC=36&CISOSHOW=5847\n**Sept. 9, 1859: Indian Difficulties Again. http://udn.lib.utah.edu/cdm4/document.php?CISOROOT=/deseretnews2&CISOPTR=5915&REC=37&CISOSHOW=5916\n**Sept.14, 1859: The Difficulties North. https://newspapers.lib.utah.edu/details?id=2589202&page=2 page 2\n**Oct. 19, 1859: The Indian War ended. http://udn.lib.utah.edu/cdm4/document.php?CISOROOT=/deseretnews2&CISOPTR=6287&REC=43&CISOSHOW=6288\n**Oct. 19,1859: By California Mail(the condition of massacre survivor and rape victim)http://udn.lib.utah.edu/cdm4/document.php?CISOROOT=/deseretnews2&CISOPTR=6287&REC=43&CISOSHOW=6288\n**Aug.3, 1859: Emigrant Cruelty and Indian Revenge.http://udn.lib.utah.edu/cdm4/document.php?CISOROOT=/deseretnews2&CISOPTR=5675&REC=32&CISOSHOW=5676\n**"
    }
  ]
}