{
  "content": [
    {
      "type": "text",
      "text": "# Beast Wars: Transformers (video game)\n\nMicrosoft Windows\n| genre = Third-person shooter\n| modes = Single-player, multiplayer\n| platforms = PlayStation, Microsoft Windows\n}}\nBeast Wars: Transformers is a third-person shooter video game developed by Sony Computer Entertainment Europe and published by Hasbro Interactive for PlayStation. A port for Microsoft Windows was released the following year. It is based on Hasbro's Beast Wars: Transformers animated series, specifically the first season, after the introduction of Airazor and Inferno. It is the second game to be developed at Sony's Cambridge studio. Takara, who co-owns the Transformers franchise, published the game in Japan.\nGameplay\nThe game allows the player to play as either the Maximals or the Predacons in a series of missions to sabotage the other side's attempts at gaining a tactical advantage in the Beast Wars. There are six playable characters on each side, one unlockable by finding a stasis pod in a specific level and the other only accessible in Rescue missions, each with their own unique strengths and weaknesses. They all have both a health meter and an Energon tolerance meter that slowly goes down while in Robot mode (staying in Beast Mode slowly refills this meter); once this meter is empty, the player takes damage from the ambient Energon radiation in the air. If the player fails in a mission and gets the character killed, the character can be 'revived' by finding a mini game icon in that same level. The mini game allows the player to take control of Airazor or Terrorsaur to recover the fallen ally.\nReception\n| EGM = 4.75/10 (PS)\n| GameRev = C\n| GSpot = 5/10 (PS)4.7/10 (PC)\n| IGN = 2.3/10 (PS)\n| OPM =\n| PCGUS = 28% (PC)\n| PSM =\n}}\nBeast Wars: Transformers received negative reviews. Critics were uniformly frustrated at the mechanic of transformers being unable to attack in beast mode, and being frequently forced to transform into beast mode in order to avoid dying from energon exposure. GameSpot commented, \"While this process does have a certain Power-of-Greyskull charm initially, taking damage every time you want to deal it out gets old fast.\" IGN additionally said that the game looks like a first-generation PlayStation title, the mission briefings are excessively vague, and it is too easy to get lost.\nCrispin Boyer of Electronic Gaming Monthly agreed that the lack of variety in the terrain makes it easy to get lost, and criticized that the level designs and enemies are nearly identical whether playing as the Maximals or the Predacons. His co-reviewer Sushi-X felt the game was passable but was disappointed at the job it did adapting the cartoon, remarking that \"It doesn't scream Transformers, it whimpers MechWarrior.\" GameSpot found the targeting system difficult to the point of being crippling to the player, though they concluded the game to be \"tolerable\". Game Revolution said that the terrain graphics are fairly impressive, but that the animations and the designs for the beast forms come across as a poor knock-off of the ones seen in the cartoon. He praised the use of sound to help the player locate enemies, especially those above eye-level, but found locking on to elevated enemies is cumbersome and leaves the player character vulnerable and opined that the game overall is \"not worthy to bear the Transformers name.\"\nPC Gamer described the PC version as \"just another sterile PlayStation port with a tacked-on license\", deriding the targeting, the graphics, and the mechanic which forces the player to spend much of the time haplessly running from attacks in beast form. GameSpot likewise commented that the PC version is just a straight port of the PlayStation version, with graphics that fail to hold up to contemporary PC releases even when 3D accelerators are used.\nReferences\nExternal links\n* [https://web.archive.org/web/19990116230326/http://www.beastwars.com/main.html Beast Wars: Transformers] website at archive.org\n*"
    }
  ]
}