{
  "content": [
    {
      "type": "text",
      "text": "# Beechhurst, Queens\n\n| pushpin_map             =\n| image_map \t= }}\n| mapsize \t=\n| map_caption   = Location within New York City\n| subdivision_type        = Country\n| subdivision_name        =\n| subdivision_type1       = State\n| subdivision_name1       =\n| subdivision_type2       = City\n| subdivision_name2       = New York City\n| subdivision_type3       = County\n| subdivision_name3       = Queens\n| established_title       =\n| established_date        =\n| established_title1      =\n| established_date1       =\n| founder                 =\n| named_for               =\n| area_total_sq_mi =\n| population_footnotes    =  tags -->\n| population_total        =\n| population_as_of        =\n| population_density_km2  =\n| population_density_sq_mi=\n| population_demonym      =\n| population_note         =\n| postal_code_type        = ZIP code\n| postal_code             = 11357\n| postal2_code_type       =\n| postal2_code            =\n| area_codes               = 718, 347, 929, and 917\n}}\nBeechhurst is a neighborhood in the northeastern section of the New York City borough of Queens. It is northeast of Whitestone, bordered by the East River to the north, the Cross Island Parkway to the south, and the approaches to the Throgs Neck and Whitestone bridges to the east and west, respectively. It is also bordered by the westernmost section of Long Island Sound.\nBeechhurst is an area with a diverse mix of housing. Beechhurst is part of the New York City Police Department's 109th Precinct and is part of Queens Community District 7.\nDuring the silent film era, Beechhurst was a favorite vacation area for the rich and famous. Estates lined the waterfront, including the Arthur and Dorothy Dalton Hammerstein House, the former house of Arthur Hammerstein and Dorothy Dalton, which is a New York City designated landmark. The Beechhurst Towers hotel (now a co-op apartment building) was a favorite of actress Mary Pickford and was frequented by many Broadway and early movie stars, including the Marx Brothers and W.C. Fields.\nIndustrialist Harvey Firestone owned an estate on the Beechhurst waterfront, visited frequently by his son’s friends Zelda and F. Scott Fitzgerald.\nTransportation\nThe New York City Bus's  local buses provide access to and from the New York City Subway's Flushing–Main Street station () on the IRT Flushing Line. The MTA Bus Company's  express buses run to Manhattan.\nNotable people\n* Arthur Hammerstein (1872–1955) built a mansion facing Long Island Sound. He lived there for several years with his wife, the actress Dorothy Dalton, but sold the estate during the Great Depression in order to raise money for his theater operations.\n* Anne Paolucci (1926–2012), writer, scholar and educator.\nReferences"
    }
  ]
}