{
  "content": [
    {
      "type": "text",
      "text": "# Beer in the United Kingdom__disambig_1\n\n, the UK's largest craft brewer]]\nBeer in the United Kingdom has a long history, and has quite distinct traditions. Historically the main styles were top-fermented Bitters, Porters, Stouts and Milds, but after World War II lagers took over half the market by volume. The Campaign for Real Ale (CAMRA) was founded in 1971 and has encouraged the preservation and revival of traditional styles of ale. In particular CAMRA has promoted cask conditioned beer, which completes its maturation in casks in the cellar of the pub rather than at the brewery.  the UK drank  of cask ale, representing 60% of ale in pubs and restaurants and 17% of all beer in pubs. In total 42.42 million hectolitres of beer were produced in 2013 of which 48% was sold in the off-trade (retail shops).\nHistory\nIn the Middle Ages beer was brewed by abbeys and independent alehouses, but the Dissolution of the Monasteries in the 16th century meant British brewing lost its connection with religious houses earlier than in other European countries. As a result, the industry has some of the oldest names in British corporate history – Shepherd Neame were incorporated in 1698, and the Bass Red Triangle and Diamond were the first trademarks to be registered. Family companies became national brands during the 19th century, many based in Burton-on-Trent which had particularly good water for brewing. By the 1970s brewing became concentrated in a handful of large national companies, which became building blocks of major multinationals such as AB InBev. A tax cut for small breweries in 2002 has seen an explosion of new breweries –  there were over 1472 breweries in the UK, with three new breweries starting every week. This is the most breweries per capita in the world; they produce over 8,000 regular beers and thousands more seasonal and one-off brews.\nThe first tax on beer in the United Kingdom was the Saladin tithe, introduced in 1188 by Henry II to raise money for the crusades\nof hops were grown in 2014, down from a peak of  in 1878. British varieties and their offspring have come to dominate world hop production, both landraces such as Fuggles or Goldings and products of the breeding programme at Wye College such as Challenger and Target. The cool maritime climate means that British-grown hops have less myrcene than the same varieties grown elsewhere, allowing more delicate, complex aromas to come through. British ales tend to reflect these characteristics and have more of a balance between bitterness and aroma compared to New World craft ales, although in the 2010s many British breweries added an American Pale Ale to their range with very citrussy, hoppy aromas.\nEconomy\nProduction of beer in the UK faces a challenge from the rising cost of raw materials. The regional breweries are developing contract brewing to keep up production, while the production of ale by the newer, smaller breweries grows. Despite an overall drop in beer sales, real ale has increased its market share.  Brewers such as Shepherd Neame, Greene King and Marston's have invested in cheaper, faster and more efficient production facilities which increase capacity.\nImported beers are increasingly popular. Brewers from Eastern Europe are introducing their brands to the UK. Polish brands Okocim, Lech, Tyskie and Żywiec have also gained a foothold in some areas, especially amongst young Polish migrant workers.\nThe growth in microbreweries in the UK led CAMRA to announce in September 2014 that 'Britain now has more breweries per person than anywhere in the World after two years of continued growth'. A year later CAMRA announced that 'Micropubs leading the way for better beer as new research shows 70% of pubs now serve real ale'. There being 53,444 pubs in the UK, of which 37,356 serve real ale.\nMuch of the growth in microbreweries can be put down to reductions in Excise Duty, an idea which began in 2002. Currently, a single producer of less than 5,000 hectolitres per annum receives a 50% reduction in the duty payable and tapered relief for production from 5,000 to 60,000 hectolitres.\nIn 2016 a study showed around 1,700 breweries now operate in the UK, an increase of 8% on the previous year.\nAn increase in the popularity of low-alcohol beers has resulted in the emergence of new brands including Lucky Saint, a pale lager with 0.5% ABV introduced in 2018 which is now one of the most popular low-alcohol beers in the UK.\nConsumption statistics\n{| class=\"wikitable mw-collapsible\"\n! colspan=\"2\" |Beer consumption, England and Wales;\n1800 - 1914\n|-\n!Years\n!Consumption\n|-\n|1800 - 04\n|33.9\n|-\n|1805 - 9\n|32.8\n|-\n|1810 - 14\n|30.2\n|-\n|1815 - 19\n|28\n|-\n|1820 - 24\n|29\n|-\n|1825 - 29\n|28.4\n|-\n|1830 - 34\n|33.8\n|-\n|1835 - 39\n|35.4\n|-\n|1840 - 44\n|30.5\n|-\n|1845 - 49\n|29.2\n|-\n|1850 - 54\n|29.5\n|-\n|1855 - 59\n|29.3\n|-\n|1860 - 64\n|31.6\n|-\n|1865 - 69\n|35.9\n|-\n|1870 - 74\n|38.2\n|-\n|1875 - 79\n|40.5\n|-\n|1880 - 84\n|33.6\n|-\n|1885 - 89\n|32.5\n|-\n|1890 - 94\n|33.4\n|-\n|1895 - 99\n|34.5\n|-\n|1900 - 04\n|34.3\n|-\n|1905 - 9\n|30.9\n|-\n|1910 - 13\n|29.4\n|}\n{| class=\"wikitable mw-collapsible\"\n! colspan=\"2\" |Beer consumption in the UK based on standard barrels\n(excluding the Republic of Ireland);\n1919 - 1938\n|-\n!Year\n!Consumption\n|-\n|1919\n|19.34\n|-\n|1920\n|20.66\n|-\n|1921\n|18.05\n|-\n|1922\n|14.87\n|-\n|1923\n|16.99\n|-\n|1924\n|17.82\n|-\n|1925\n|17.78\n|-\n|1926\n|16.57\n|-\n|1927\n|16.68\n|-\n|1928\n|15.92\n|-\n|1929\n|16.28\n|-\n|1930\n|15.47\n|-\n|1931\n|12.93\n|-\n|1932\n|10.73\n|-\n|1933\n|12.42\n|-\n|1934\n|12.84\n|-\n|1935\n|13.44\n|-\n|1936\n|13.74\n|-\n|1937\n|14.37\n|-\n|1938\n|14.32\n|-\n|1939\n|14.6\n|}\n{| class=\"wikitable mw-collapsible\"\n! colspan=\"2\" |Beer consumption of the UK (based on bulk barrelage);\n1945 - 1995\n|-\n!Year\n!Consumption\n|-\n|1945\n|22.3\n|-\n|1950\n|18.4\n|-\n|1955\n|17.8\n|-\n|1958\n|17.1\n|-\n|1960\n|18.9\n|-\n|1965\n|20.1\n|-\n|1970\n|22.6\n|-\n|1975\n|25.5\n|-\n|1979\n|27.1\n|-\n|1980\n|26\n|-\n|1985\n|24.2\n|-\n|1990\n|24.3\n|-\n|1993\n|22.4\n|-\n|1995\n|21.9\n|}\nTraditional beer styles originating in the United Kingdom\n*Brown ale\n*Mild ale\n*Pale ale\n*Burton Ale\n*Porter\nNations of the UK\n* Beer in England\n** List of breweries in England\n* Beer in Northern Ireland\n* Beer in Scotland\n** List of breweries in Scotland\n* Beer in Wales\nSee also\n* Beer and breweries by region\n* Progressive beer duty\nReferences\nExternal links\n* [https://web.archive.org/web/20120205120652/http://siba.co.uk/ Society of Independent Brewers]\n* [http://www.camra.org.uk/ CAMRA]\n* [http://www.quaffale.org.uk/php/index.php Directory of UK Real Ale]"
    }
  ]
}