{
  "content": [
    {
      "type": "text",
      "text": "# Beerburrum, Queensland\n\n| pushpin_label_position = left\n| pop                 = 941\n| pop_year            =\n| pop_footnotes       =\n| lga                 = Sunshine Coast Region\n| postcode            = 4517\n| area                = 96.1\n| est                 =\n| county              = Canning\n| parish              = Beerwah\n| stategov            = Glass House\n| fedgov              = Fisher\n| dist1               = 12.6\n| dir1                = S\n| location1           = Beerwah\n| dist2               = 14.9\n| dir2                = N\n| location2           = Caboolture\n| dist3               = 61.6\n| dir3                = N\n| location3           = Brisbane CBD\n| near-n              = Glass House Mountains\n| near-ne             = Coochin Creek\n| near-e              = Bribie Island North\n| near-se             = Welsby\n| near-s              = Donnybrook\n| near-sw             = Elimbah\n| near-w              = Woodford\n| near-nw             = Woodford\n}}\nBeerburrum is a rural town and coastal locality in the Sunshine Coast Region, Queensland, Australia. In the , the locality of Beerburrum had a population of 941 people.\nGeography\nThe locality is  north of the state capital, Brisbane. The Bruce Highway passes from south to north through the locality approximately  east of the town. Beerburrum Road enters from the south and ends at an intersection with Glass House Mountains Road (Steve Irwin Way) which continues to the north. The North Coast railway line also passes from south to north through the locality which is served by Beerburrum railway station on the eastern edge of the town.\nThe proposed Bruce Highway Western Alternative will have its northern entry point in Beerburrum.\nThe locality is predominantly on the mainland but includes a number of undeveloped islands in the Pumicestone Passage between the mainland and Bribie Island. The named islands are Long Island () and Thooroola Island (known as Goat Island until 1981, ).\nThe eastern part of the locality is low-lying land with many creeks which drain into the Pumicestone Passage. The western part of the locality is higher hillier land and includes two of the Glass House Mountains: Mount Beerburrum and Mount Tibberoowuccum, both of which are protected within the Glass House Mountains National Park.\nBeerburrum is a mountain () which rises to  above sea level. It is composed of porphyritic trachyte. The mountain has complex rainforest, with some endangered plant species such as Tindal's stringybark (Eucalyptus tindaliae), Pink bloodwood (Corymbia intermedia) and Smooth-barked apple (Angophora leiocarpa). Scribbly gum (Eucalyptus racemosa) is locally predominant in places, with the largest tract retained on Mount Beerburrum. The mountain has a forestry fire tower with a viewing platform at the summit.\nMount Tibberoowuccum () is composed of alkali rhyolite. It is  high. The mountain is a dome-shaped rock surrounded by eucalypt open forest, as well as complex rainforest, although the area is not extensive. There is a small population of Narrow-leaf bitter-pea (Daviesia Mimosoides) present on the southern slope of the mountain. This shrub is widespread in Victoria and New South Wales, but rare in Queensland, and the Mount Tiberoocwuccum population is the most northerly known.\nHistory\nThe name is derived from that of the mountain Beerburrum. In the language of the Indigenous Kabi nation, bir means green parrot and burru mountain.\nOn 26 July 1799, Matthew Flinders and two sailors from the ship Norfolk climbed Mount Beerburrum accompanied by Aboriginal man Bongaree from Sydney. They were the first Europeans to climb one of the Glass House Mountains.\nThomas Martin Tripcony was one of the first European settlers to settle along the Pumicestone Passage (which separates the mainland from Bribie Island). In 1861 he selected coastal land on the mainland side of the passage between Hussey Creek () and Glass Mountain Creek () which he called Cowrie Bank. He made his living by lime burning and oystering there and at a number of locations in the passage, but in 1876 settled permanently at Cowrie Bank, building a family home (also called Cowrie Bank) in 1877.\nThe North Coast line from Caboolture to Landsborough (which included a siding at Beerburrum) was completed on 1 February 1890. This opened up access to the district for settlement.\nA cemetery was established at Beerburrum circa 1908. It was officially closed in 1970 with about 12 graves still visible.\nIn 1916, Beerburrum was chosen to be a soldier settlement with over  subdivided into more than 550 farm lots, making the Beerburrum Soldier Settlement the largest soldier settlement in Queensland. The expectation was that hilly land would be suitable for growing pineapples and other fruits. However, by 1929, it was generally acknowledged that the scheme had failed (like many others), due to the farms being too small to be economically viable. This was compounded by shortages of skills, capital, and markets.\nBeerburrum Post Office opened by 1917 (a receiving office had been open from 1893).\nBeerburrum State School opened on 22 April 1918.\nThe Beerburrum School of Arts was opened on Thursday 9 May 1918.\nIn 1920, a memorial avenue of trees (camphor laurels and weeping figs) was planted in the town's main street to commemorate those who had served in World War I. The street was renamed Anzac Avenue.\nCirca 1920, the Beerburrum Bakery opened as part of a group of shops in Anzac Avenue. With the failure of the soldier settlement, most of the shops closed and the buildings relocated elsewhere. The bakery is the only surviving shop building from the settlement.\nA School of Arts hall was established circa 1920 in Anzac Avenue and remains one of the few buildings that survive from the settlement.\nOn 4 February 1922, the Queensland Treasurer John Fihelly officiated at the opening of the cottage hospital at Beerburrum. It closed in 1931 following the failure of the settlement.\nSt George's Anglican Church was dedicated on 20 August 1922 by Canon D.J. Garland. The building was originally built as a chapel at the Enoggera army barracks during World War I by the Soldiers' Church of England Help Society. Many of the furnishings and ornaments in the Enoggera barracks church were donated in memory of soldiers who had died, including the altar and its furnishings which were donated in the memory of Earl Kitchener. Due to the failure of the soldier settlement, the church fell into disuse. It was officially closed in August 1931, after which the church was moved to Maleny, where it was dedicated to St George on 6 September 1931 by Archbishop Sharp.\nAfter World War II, pine plantations were developed in the area as state forests creating a local forestry industry. Circa 1947 a Forestry Station Barracks was built to accommodate forestry workers.\nThe Bruce Highway originally passed along the western boundary of the town (later known as Old Bruce Highway and now as Beerburrum Road). In the early 1970s, the town was bypassed to its immediate east in the early 1970s, and that road (called Glasshouse Mountains Road and now Steve Irwin Way) was itself superseded by the current alignment of the highway further to the east in 1985.\nDemographics\nIn the , the town of Beerburrum had a population of 287 people.\nIn the , the locality of  Beerburrum had a population of 600 people.\nIn the , the locality of Beerburrum had a population of 763 people.\nIn the , the locality of Beerburrum had a population of 941 people.\nHeritage listing\nBeerburrum has a number of heritage-listed sites, including:\n* Anzac Avenue Memorial Trees, Anzac Avenue\n*Beerburrum Bakery, 6 Anzac Avenue\n*Beerburrum School of Arts Hall, 7 Anzac Avenue\n*Beerburrum Cemetery, via Beerburrum Road ()\n*Beerburrum Forestry Station Barracks, Red Road\n*Campbellville Settlement and Cemetery, Roys Road\n*Cowriebank Site, Tripcony Bight, Pumicestone Passage\nEducation\nBeerburrum State School is a government primary (Prep-6) school for boys and girls at 8 Beerburrum Road (). In 2017, the school had an enrolment of 92 students with 11 teachers (7 full-time equivalent) and 6 non-teaching staff (4 full-time equivalent).\nThere are no secondary schools in Beerburrum. The nearest government secondary schools are Beerwah State High School (to Year 12) in Beerwah to the north, Woodford State School (to Year 10) in Woodford to the west, and Caboolture State High School (to Year 12) in Caboolture to the south.\nAmenities\nThe Sunshine Coast Regional Council operates a mobile library service which visits the school on Beerburrum Road.\nBeerburrum School of Arts is at 7 Anzac Avenue (). It has capacity for 100 people.\nTransport\nThe Beerburrum railway station, situated in Beerburrum, QLD, serves as a vital stop along the North Coast railway line—a key link connecting Brisbane to Cairns over a 1,681-kilometre stretch. Translink operates a number of bus routes across Beerburrum that provide further connectivity within the Sunshine Coast Hinterland.\nReferences\nAttribution\nExternal links\n*\n* [https://gisservices.information.qld.gov.au/arcgis/rest/directories/historicalscans/cad_scans/cad-map-town-beerburrum-1973.jpg Town map of Beerburrum, 1973]\n* [http://www.chapelhill.homeip.net/FamilyHistory/Photos/Beerburrum_Cemetery-Caloundra/ Beerburrum cemetery]"
    }
  ]
}