{
  "content": [
    {
      "type": "text",
      "text": "# Behold the Kingdom\n\n–\n| label           = Rottweiler\n| associated_acts =\n| website         =\n| past_members    = Josh MoonRiley SnyderDerrik YoungMark BakerSebastian SalinasZach Robbins  Cliff Deweese\n}}\nBehold the Kingdom was an American Christian metal and Christian hardcore band, and they primarily played deathcore, metalcore, and hardcore punk. They come from Sidney, Ohio. The band started making music in 2009, and their membership was lead vocalist, Josh Moon, lead guitarists, Riley Snyder and Derrik Young, bassist, Mark Baker, and drummer, Cliff Deweese. Their first studio album, The Eyes of the Wicked Will Fail, was released by Rottweiler Records, in 2011, which was the only album from the band, who disbanded in 2013.\nBackground\nBehold the Kingdom is a Christian metal and Christian hardcore band from Sidney, Ohio. Their members were lead vocalist, Joseph Bellmer, lead guitarists, Riley Snyder and Derrik Young, bassist, Mark Baker, and drummer, Sebastian Salinas.  Started in 2009 by Riley Snyder, Cliff Deweese, and Josh Moon, Behold The Kingdom performed under the name Arelim before adding Mark Baker and Derrik Young into the fold.  Shortly after the additions of Baker and Young, the group underwent a name change and became Behold The Kingdom.\nAfter beginning to play shows across Ohio and Indiana, Behold The Kingdom gained the attention of Standby Records (Before Their Eyes, Emarosa, Black Veil Brides) CEO Neil Sheehan.  The band recorded two singles, \"Poveglia\" and \"185,000\" at Chin Music Studios in Cleveland, Ohio, a studio owned by Neil Sheehan.  Shortly after recording both songs, vocalist Josh Moon parted ways with the band and vocalist Zach Robbins was chosen as his replacement.  After the addition of Zach Robbins to the band, Behold The Kingdom began touring and expanding their fan base again.  The band once again hit the studio with Saud Ahmed (The Crimson Armada, The Holy Guile) with Robbins on vocals.  Soon after recording with Saud Ahmed, Zach Robbins parted ways with Behold The Kingdom and the band began searching for a new vocalist.\nRumors that original vocalist Josh Moon would rejoin the band began circulating, before the band settled on Joseph Bellmer as their new vocalist.  After adding Bellmer, Behold The Kingdom began touring again and quickly grabbed the attention of Ft. Wayne, Indiana based Rottweiler Records.  After negotiations, Behold The Kingdom was signed to Rottweiler Records and began recording their first full-length studio album, The Eyes of the Wicked Will Fail.  Shortly after recording the album and following tours to support the release of the album, drummer Cliff Deweese decided to part ways with the band.  After the departure of Deweese, the band began searching for a new drummer, before settling on Colorado native Sebastian Salinas to fill the void.  After the addition of Salinas, the band continued to tour in support of the album, before disbanding in 2013.\nIt was recently announced on the group's Facebook page that there will be a reunion in 2017 or 2018, featuring the original members of the band (Moon, Snyder, Young, Baker, and Deweese).\nMusic history\nThe band commenced as a musical entity in 2009, with their first release, The Eyes of the Wicked Will Fail, a studio album, that was released on August 12, 2011, by Rottweiler Records.\nMembers\n;Last Known Line-up\n* Joseph Bellmer - vocals\n* Riley Snyder - guitar\n* Derrik Young - guitar\n* Mark Baker - bass\n* Sebastian Salinas - drums\n;Past Members\n* Zach Robbins - vocals\n* Josh Moon - vocals\n* Cliff Deweese - drums\n;Timeline\nImageSize = width:800 height:250\nPlotArea = left:115 bottom:90 top:0 right:10\nAlignbars = justify\nDateFormat = mm/dd/yyyy\nPeriod = from:01/01/2009 till:12/31/2013\nTimeAxis = orientation:horizontal format:yyyy\nScaleMajor = increment:2 start:2009\nScaleMinor = increment:1 start:2009\nColors =\nid:Vocals value:red legend:Vocals\nid:Guitar value:green legend:Guitars\nid:Bass value:blue legend:Bass\nid:Drums value:Orange legend:Drums\nid:Lines value:black legend:Studio_albums\nid:bars value:gray(0.95)\nLegend = orientation:vertical  position:bottom columns:4\nBackgroundColors=bars:bars\nScaleMajor = increment:1 start:2009\nLineData =\nat:08/12/2011 color:black layer:back\nBarData =\nbar:Josh text:\"Josh Moon\"\nbar:Zach text:\"Zach Robbins\"\nbar:Joseph text:\"Joseph Bellmer\"\nbar:Riley text:\"Riley Snyder\"\nbar:Derrik text:\"Derrik Young\"\nbar:Mark text:\"Mark Baker\"\nbar:Cliff text:\"Cliff Deweese\"\nbar:Sebastian text:\"Sebastian Salinas\"\nPlotData=\nwidth:10 textcolor:black align:left anchor:from shift:(10,-4)\nbar:Josh from:start till:01/01/2011  color:Vocals\nbar:Zach from:01/01/2011 till:01/01/2011 color:Vocals\nbar:Joseph from:01/01/2011 till:end color:Vocals\nbar:Riley from:start till:end color:Guitar\nbar:Derrik from:06/01/2009 till:end color:Guitar\nbar:Mark from:06/01/2009 till:end color:Bass\nbar:Cliff from:start till:09/01/2011 color:Drums\nbar:Sebastian from:09/01/2011 till:end color:Drums\nDiscography\n;Studio albums\n* The Eyes of the Wicked Will Fail (August 12, 2011, Rottweiler)\nReferences\nExternal links\n*[https://www.facebook.com/beholdthekingdom/ Facebook page]"
    }
  ]
}