{
  "content": [
    {
      "type": "text",
      "text": "# Beinn na Foghla agus Uibhist a Tuath (ward)__disambig_1\n\nwas one of the nine wards of . Created in 2007, the ward elected three councillors using the single transferable vote electoral system. As a result of the Islands (Scotland) Act 2018, the ward was abolished in 2022.\nIndependents have dominated elections in the Western Isles and all but one of the councillors elected in the area had no party affiliation.\nBoundaries\nThe ward was created following the Fourth Statutory Reviews of Electoral Arrangements ahead of the 2007 Scottish local elections. As a result of the Local Governance (Scotland) Act 2004, local elections in Scotland would use the single transferable vote electoral system from 2007 onwards so Beinn na Foghla agus Uibhist a Tuath was formed from an amalgamation of several previous first-past-the-post wards. It contained all of the former Lochmaddy, North Benbecula and Paible wards as well as the northern half of the former Eochar ward and a few islands in the south of the former Harris West ward. The ward centred around the islands in the middle of the Outer Hebrides island chain and included Benbecula and North Uist as well as a number of uninhabited surrounding islands and the remote, uninhabited island of St Kilda in the Atlantic Ocean. Proposals in the Fifth Statutory Reviews of Electoral Arrangements ahead of the 2017 Scottish local elections would have seen the ward's boundaries unchanged. However, these were not adopted by Scottish ministers as plans for the Islands (Scotland) Act 2018 would bring forward an interim review following the 2017 elections.\nThe Islands (Scotland) Act 2018 allowed for the creation of single- and dual-member wards to allow for better representation of island areas. As a result, the ward was abolished and replaced by the Uibhist a Deas, Èirisgeigh agus Beinn na Faoghla and Uibhist a Tuath wards.\nCouncillors\n{|class=\"wikitable\" style=\"text-align:center\"\n!Year\n!colspan=8|Councillors\n|-\n!2007\n|rowspan=4; style=\"background-color: \" |\n|Martin Taylor(Independent)\n|rowspan=4; style=\"background-color: \" |\n|rowspan=4|Uisdain Robertson(Independent)\n|rowspan=2; style=\"background-color: \" |\n|rowspan=2|Archie K. Campbell(Labour)\n|-\n!2012\n|rowspan=2|Neil M. Beaton(Independent)\n|-\n!2015\n|rowspan=2; style=\"background-color: \" |\n|Andrew Walker(Independent)\n|-\n!2017\n|Iain MacLeod(Independent)\n|Roddy McKay(Independent)\n|}\nElection results\n2017 election\n2012 Election\n2012 Comhairle nan Eilean Siar election\n2007 Election\n2007 Comhairle nan Eilean Siar election\nReferences"
    }
  ]
}