{
  "content": [
    {
      "type": "text",
      "text": "# Belarusians in the United Kingdom\n\nBelarusianRussian\n|rels     = Eastern Orthodox ChurchRoman CatholicismGreek CatholicismJudaism\n|related  =  Baltic people, Polish British, Ukrainian diaspora in the United Kingdom, Russians in the United Kingdom, Belarusian Americans}}\nBelarusians in the United Kingdom () are Belarusians living in the United Kingdom and British people of Belarusian background or descent. The 2001 UK census recorded 1,154 Belarus-born people living in the UK. The 2011 census recorded 4,031 Belarus-born people resident in England, 102 in Wales, 211 in Scotland and 62 in Northern Ireland. Nowadays, organised community life exists only in London.\nTerminology\nBelarusians or Byelorussians have been researched, and written of academically and journalistically, as a distinct ethnic group within the United Kingdom.\nHistory\nin memory of people of Belarus, who lost their lives in Jersey during the Second World War]]\nAccording to researcher Natallia Hardzijenka, the first significant wave of immigration from Belarus to the UK took place in late 19th and the beginning of 20th century.\nAnother significant wave came after the Second World War. A large number of those were former Belarusian military personnel of the Polish Anders Army. According to estimates, ten to twelve thousands of Belarusians arrived to the UK in the aftermath of the war. A significant number of them later emigrated to other countries (mainly the US, Canada and Australia). Many of the Belarusians who resettled in Britain during this period were registered or counted as Polish people, despite being ethnic East Slavs. This was due to Belarus not yet being considered an independent nation, and therefore the Belarusian ethnic group was similarly disregarded in statistics.\nDuring the 1960s, Ceslaus Sipovich and Alexander Nadson became notable religious figures for Belarusians in London, and were involved with the Belarusian Memorial Chapel.\nCommunity\n]]There have been Belarusian community centres in London, Manchester and Bradford as well as several religious centres.\nThe Belarusian St. Cyril of Turau Boys' School was active in London in the 1960s and 1970s. This school was reopened in 2015 and has classes for children and adults on Saturdays and Sundays.\nThe Anglo-Belarusian Society was founded in 1954 to promote contacts between the Belarusian diaspora and the British establishment.\nThere are several other Belarusian organisations in the UK, including the Association of Belarusians in Great Britain, the Anglo-Belarusian Society and the Professional Union of Belarusians in Britain.\nThe Belarusian Catholic Mission was established in 1946. In addition to its religious work, it has contributed to various secular initiatives of the Belarusian community in the UK, including the Francis Skaryna Belarusian Library and Museum. The Mission built the church of St Cyril of Turau and All the Patron Saints of the Belarusian People – the first Belarusian Catholic church outside Belarus and the first wooden church in London since the Great Fire of 1666.\nExternal links\n* [http://belarusians.co.uk Belarusians in Britain blog]\n* [http://absociety.org.uk Anglo-Belarusian Society]\n* [http://www.zbvb.org.uk/ Association of Belarusians in Great Britain]\n* [http://www.skaryna.org.uk/ Francis Skaryna Belarusian Library and Museum]\n* [http://belarusjournal.com/ Journal of Belarusian Studies]\n* [http://pubb.uk/ Professional Union of Belarusians in Britain (PUBB)]\nBritish people of Belarusian descent\nSee also\n*Belarusian Americans\n*Belarusian Canadians\n*Russians in the United Kingdom\n*Ukrainians in the United Kingdom\nReferences"
    }
  ]
}