{
  "content": [
    {
      "type": "text",
      "text": "# Belgium–United Kingdom relations__disambig_1\n\nRishi Sunak with Belgian Prime Minister Alexander De Croo in 10 Downing Street, January 2024.]]\nBelgium–United Kingdom relations are diplomatic and foreign relations between Belgium and the United Kingdom.\nIn addition, both countries' royal families are descended from the House of Saxe-Coburg and Gotha, with the British branch being known as the House of Windsor and the Belgian branch as the House of Belgium.\nBoth countries share common membership of the Atlantic Co-operation Pact, the Council of Europe, the European Court of Human Rights, the International Criminal Court, NATO, the OECD, the OSCE, the United Nations, and the World Trade Organization. Bilaterally the two countries have a Classified Information Protection Agreement, a Double Taxation Convention, and a Maritime Cooperation Agreement.\nHistory\nin 1917]]\nIn the early years of the Hundred Years' War, Edward III of England allied with the nobles of the Low Countries and the burghers of Flanders against France.\nof 1849: French and Belgian warships attack British traders]]\nWith the British Liberation Army in Belgium, October 1944]]\nBelgium established its independence in the revolution of 1830. Like the other European Great Powers, Britain was slow to recognise the new state. Even the election of Leopold of Saxe-Coburg, former son-in-law of Britain's King George IV and uncle to the future Queen Victoria, as King of the Belgians failed to win diplomatic recognition from London. Belgium's emergence had caused the break-up of the United Kingdom of the Netherlands, one of several buffer states established after the end of the Napoleonic Wars as a check against future French expansion, and London feared this newly formed nation would be unable to survive hostile expansion by its neighbours. A British-organised European Congress produced the Treaty of London of 1839, whereby the Great Powers (and The Netherlands) all formally recognised the independence of Belgium, and (at Britain's insistence) guaranteed its neutrality.\nAt the Berlin Conference (1884), Britain had recognised the Congo Free State as the personal domain of the King of the Belgians. Britain was subsequently to become a centre for opposition to Leopold II's personal rule in the territory through organisations such as the Congo Reform Association. At one point, Britain even demanded that the 14 signatories to the Berlin Conference meet again to discuss the situation. In 1894, the British East Africa Company led by Queen Victoria and the British Prime Minister Lord Rosebery had established and declared Uganda a protectorate of the British Empire next to the border of Belgium's African colony in the Congo. In 1908, Belgium's parliament took control of the Congo, which became a conventional European colony. In the years prior to World War I, many Belgians bore considerable resentment over Britain's campaign against Leopold II's activities in the Congo. In 1916, the Belgians advanced the German territory of East Africa such as the Battle of Tabora during the First World War and forced Germany to cede Ruanda-Urundi to Belgium as a Class-B Mandate.\nThe guarantees of neutrality of 1839 failed to prevent the invasion of Belgium by Germany in 1914. It was the final straw for an element of the Liberal Party that needed a moralistic reason to enter the war, beyond the need to prevent the defeat of France. Historian Zara Steiner says of German's invasion:\n:The public mood did change. Belgium proved to be a catalyst which unleashed the many emotions, rationalizations, and glorifications of war which had long been part of the British climate of opinion. Having a moral cause, all the latent anti-German feelings, that by years of naval rivalry and assumed enmity, rose to the surface. The 'scrap of paper' proved decisive both in maintaining the unity of the government and then in providing a focal point for public feeling. Much of the British fighting took place on Belgian soil, around Ypres. (Western Front). During World War II, the Belgian government in exile based itself in London, as did the governments of many other countries; including France, Poland and Czechoslovakia.\nAround 250,000 Belgian refugees came to the UK during World War I; about 90% returned to Belgium soon after the war ended. Agatha Christie's fictional detective Hercule Poirot was depicted as one of them.\nSouth Africa was ruled by the Dutch and then the British colonization as the Union of South Africa, while the Belgians ruled as the Belgian Congo until its independence from Belgium on 30 June 1960, while South Africa became a republic during the Apartheid era from 1948 until 1994, when Nelson Mandela was elected and became the first President of South Africa following the landslide victory of 1994 South African general election. With Mobutu ruled as the dictator of Zaire which has its name from 1971 to his overthrow in 1997 by the rebel leader Laurent Kabila during the First Congo War and has renamed originally as the Democratic Republic of the Congo which then forced Mobutu to leave Kinshasa and heading for exile in Morocco, as he later died in the same year.\nEconomic relations\nconnects London and Brussels by train]]\nHistorically, the south eastern parts of Great Britain and the area that is now Belgium has evidence of trade since the 1st century and wool exports from the UK to cloth imports in the 10th-century County of Flanders. Flemish bricks were used on work to the Tower of London in 1278. Today as much as 7.8% of Belgium’s exports are to the UK. with just over 5% of Belgium's imports, over €12,000,000 coming from the UK. Belgium is the UK's sixth-largest export market, worth £10,000,000 a year. The UK is Belgium's fourth-largest export market with two-way trade worth in the region of £22,000,000,000 of which £2,000,000,000 is in services. The Golden Bridge Awards were established in 2012 for UK export success in Belgium and recognising the importance of a close by market.\nFollowing Brexit, Trade between the United Kingdom and Belgium is governed by the EU–UK Trade and Cooperation Agreement since 1 January 2021.\nModern relations\nToday, there are roughly 30,000 British people living in Belgium, and 30,000 Belgians living in the UK. In 2014, the UK government announced £5,000,000 for the restoration of First World War graves in Flanders.\nQueen Elizabeth II made four state visits to Belgium during her reign; in 1966 (being received by King Baudouin), and in 1993, 1998 and 2007,  where she was received by King Albert II.\nResident diplomatic missions\n* Belgium maintains an embassy in London.\n* The United Kingdom is accredited to Belgium through its embassy in Brussels.\nSee also\n* Anglo-Belgian Memorial (Brussels)\n* Anglo-Belgian Memorial, London\n* EU–UK relations\n* List of Ambassadors from the United Kingdom to Belgium\nReferences\nFurther reading\n* Allen, Robert W. ''Churchill's Guests: Britain and the Belgian Exiles During World War II (Praeger, 2003).\n* Allen Jr, Robert W. \"Britain revives the Belgian army 1940–45.\" Journal of Strategic Studies 21.4 (1998): 78-96.\n* Asquith, Herbert H. “Britain’s Tribute to Belgium.” Current History 4#6 (1916), pp.&nbsp;1057–58, [http://www.jstor.org/stable/45327965 online].\n* Bond, Brian. Britain, France, and Belgium, 1939-1940'' (Brassey's, 1990). [https://www.jstor.org/stable/44227218. online review]\n* Declercq, Christophe. \"The odd case of the welcome refugee in wartime Britain: uneasy numbers, disappearing acts and forgetfulness regarding Belgian refugees in the First World War.\" Close Encounters in War Journal 1.2 (2020): 5-26. [https://lirias.kuleuven.be/retrieve/562604 online]\n* Demoor, Marysa. A Cross-Cultural History of Britain and Belgium, 1815–1918. Mudscapes and Artistic Entanglements (Palgrave/Macmillan, 2022). https://doi.org/10.1007/978-3-030-87926-6\n* François, Pieter. \"'A little Britain on the Continent': the British perception of Belgium (1830-70)\" (Pisa University Press, 2010). [https://uhra.herts.ac.uk/handle/2299/15488?show=full link]\n* “German East Africa Divided Up: Belgium Gets Two Large Provinces, and Great Britain Takes the Rest, Renaming It Tanganyika Territory.” Current History 12#2 (1920), pp.&nbsp;350–51 [https://www.jstor.org/stable/45325304 online].\n* Green, Leanne. \"Advertising war: Picturing Belgium in First World War publicity.\" Media, War & Conflict 7.3 (2014): 309-325. [http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.829.4303&rep=rep1&type=pdf online]\n* Hayes, Paul. Modern British Foreign Policy: The Nineteenth Century 1814-80 (1975) pp.&nbsp;174–93.\n* Helmreich, Jonathan E. Belgium and Europe: A Study in Small Power Diplomacy (Mouton De Gruyter, 1976).\n* Helmreich, Jonathan E. \"Belgium, Britain, the United States and Uranium, 1952-1959.\" Studia Diplomatica (1990): 27-81 [https://www.jstor.org/stable/44836213 online].\n* Ward, Adolphus William, and George Peabody Gooch. The Cambridge history of British foreign policy, 1783-1919. Vol. 1 (1929).\n* Wilson, Trevor. \"Lord Bryce's Investigation into Alleged German Atrocities in Belgium, 1914-15.\" Journal of Contemporary History 14.3 (1979): 369-383."
    }
  ]
}