{
  "content": [
    {
      "type": "text",
      "text": "# Belgian Antarctic Expedition\n\n]]\nThe Belgian Antarctic Expedition of 1897–1899 was the first expedition to winter in the Antarctic region. Led by Adrien de Gerlache de Gomery aboard the RV Belgica, it was the first Belgian Antarctic expedition and is considered the first expedition of the Heroic Age of Antarctic Exploration. Among its members were Frederick Cook and Roald Amundsen, explorers who would later attempt the respective conquests of the North Pole.\nPreparation and surveying\nIn 1896, after a period of intensive lobbying, Adrien Victor Joseph de Gerlache de Gomery purchased the Norwegian-built whaling ship Patria, which, following an extensive refit, he renamed . Gerlache had worked together with the Geographical Society of Brussels to organize a national subscription, but was able to outfit his expedition only after the Belgian government voted in favor of two large subsidies, making it a state-supported undertaking. With a multinational crew that included Roald Amundsen from Norway, Emil Racoviță from Romania, and Henryk Arctowski from Poland, Belgica set sail from Antwerp on 16 August 1897.\nEn route to the Antarctic, the expedition visited Madeira, Rio de Janeiro, and Montevideo. Belgica was received particularly enthusiastically in Rio, where a large Belgian community lived. Frederick Cook, an American, joined the expedition there. The Brazilians were also very interested in the Belgian scientific undertaking. The Historical and Geographical Society of Rio held a special meeting where the scientists and officers of the expedition were offered membership. A few weeks later, in Montevideo, Amundsen wrote in his diary that he had never seen so many beautiful women \"in one place at the same time\".\nDuring January 1898, Belgica reached the coast of Graham Land. On 22 January, Carl Wiencke was washed overboard during a storm and drowned. Wiencke Island was named in his honor. Sailing in between the Graham Land coast and a long string of islands to the west, Gerlache named the passage \"Belgica Strait\"; it was later renamed Gerlache Strait in his honor. After charting and naming several islands from some twenty separate landings, the expedition crossed the Antarctic Circle on 15 February.\nFailing to find a way into the Weddell Sea on 28 February, Gerlache's expedition became trapped in the ice of the Bellingshausen Sea, near Peter I Island. It is likely that Gerlache intentionally sailed deep into the pack ice in order to freeze his vessel into the ice for the winter. Despite the crew's efforts to free Belgica, they quickly realised that they would be trapped for the duration of the Antarctic winter.\nWinter\nThe Belgica expedition was poorly equipped and did not have enough winter clothing for every man on board. There was a shortage of food, and what there was lacked in variety. Penguins and seals were hunted and their meat stored before the onset of winter left the region devoid of wildlife. Warm clothing was improvised from the materials available. On 21 March 1898, Cook wrote: \"We are imprisoned in an endless sea of ice&nbsp;... We have told all the tales, real and imaginative, to which we are equal. Time weighs heavily upon us as the darkness slowly advances.\" Several weeks later, on 17 May, the perpetual darkness of polar night set in, and lasted until 23 July.\nGerlache disliked the penguin and seal meat that had been stored and initially tried to ban its consumption, but eventually encouraged it. Signs of scurvy began to show in some of the men. Gerlache and Captain Georges Lecointe became so ill they wrote their wills. Two of the crew started to show signs of mental illness and morale in general was extremely poor. Lieutenant Danco fell ill from a heart condition and died on 5 June. Danco Island was named in his honor. Several men reportedly lost their sanity at this point, including one Belgian sailor who left the ship \"announcing he was going back to Belgium.\"\nCook and Amundsen took command as Gerlache and Lecointe were unable to fulfill their roles due to scurvy. The true cause of scurvy as a deficiency of Vitamin C was not discovered until the 1920s, but Cook was convinced that raw meat was a possible cure for scurvy due to his experiences with Robert Peary in the Arctic. He retrieved the frozen penguin and seal meat and insisted that each man eat some each day. Even Gerlache began to eat the meat and slowly the men recovered their health. It is now known that raw meat and organs contain a small amount of Vitamin C.\nSeveral months of hardship followed. Even as spring and summer arrived, attempts to free the ship and its crew from the grip of the ice failed. By January 1899, Belgica was still trapped in ice about  thick and the possibility of another winter in the ice seemed real. Open water was visible about  away and Cook suggested that trenches be cut to the open water to allow Belgica to escape the ice. The weakened crew used the explosive tonite and various tools to create the channel. Finally, on 15 February, they managed to start slowly down the channel they had cleared during the weeks before. It took them nearly a month to cover  and, on 14&nbsp;March, they cleared the ice. The expedition returned to Antwerp on 5 November 1899. Though the circumstances had been severe, the expedition had nevertheless managed to collect scientific data, including a full year of meteorological observations.\nReception\nIn Antwerp, the return of the expedition was heartily welcomed. A special committee had been planning the festivities for months. Typical for polar expeditions in this age, feelings of national and regional pride surrounded the homecoming celebrations. On the day they first set foot on Belgian soil again, La Brabançonne sounded and the national flag was seen waving from many houses. The Belgian state honored Gerlache and his men by making them members of the Royal Order of Leopold, and the municipal government of Antwerp honored the men with medals and by writing their names in the Golden Book of the city.\nPersonnel\n, Nansen, Somers, Danco, Amundsen, Bryde, Van Rysselberghe, Andvord]]\nThe expedition team included many notable individuals:\n* Adrien de Gerlache – Belgian – commander\n* Georges Lecointe – Belgian – captain, executive officer, and hydrographer\n* Roald Amundsen – Norwegian – first mate\n* Henri Somers – Belgian – chief engineer\n* Frederick Cook – American – surgeon, anthropologist, and photographer\n* Henryk Arctowski – Polish – geologist, oceanographer, and meteorologist\n* Émile Danco – Belgian – geophysical observations; died on June 5, 1898, from heart problems and exhaustion\n* Emil Racoviță – Romanian – zoologist, botanist, and speleologist\n* Antoni Bolesław Dobrowolski – Polish – assistant meteorologist\n* Jules Melaerts – Belgian – third lieutenant-->\n* Max Van Rysselberghe – Belgian – second engineer-->\n* Louis Michotte – Belgian – steward and cook  This affected the expedition's nutrition negatively, since Gerlache tried to ban the consumption of fresh seal and penguin meat after sampling Michotte's badly prepared dishes. Frederic Cook convinced the sick expedition members much later to eat it, as a medicine rather than as food. On his return to Belgium he became the butler of Philippe d'Orléans, and in this capacity participated in the 1905 Belgica expedition to Spitsbergen and Greenland, with Gerlache as captain.-->\n* Adam Tollefsen – Norwegian – able seaman; suffered a mental breakdown during the expedition and had to be committed to a mental institution on his return\n* Ludvig-Hjalmar Johansen – Norwegian – able seaman\n* Engebret Knudsen – Norwegian – able seaman\n* Gustave-Gaston Dufour – Belgian – able seaman\n* Jan Van Mirlo – Belgian – able seaman-->\n* Carl August Wiencke – Norwegian – able seaman; washed overboard and drowned on January 22, 1898, on the way to Antarctica. Wiencke Island was named in his honor.\n* Johan Koren – Norwegian – cabin boy and assistant zoologist-->\n** Koren brought on board Nansen, the ship's cat, named after Fridtjof Nansen. She died on 22 June 1898, and was buried in the Antarctic.\nPersonnel resigned or let go:\n* Johansen – Norwegian – boatswain; resigned on 22 August 1897\n* Julliksen – Norwegian – carpenter; resigned on 22 August 1897\n* Josef Duvivier – Belgian – mechanic; fired on 26 October 1897 in Rio de Janeiro, rehired in Montevideo, fired again in Punta Arenas due to incompetence\n* Lemonier – French – cook; fired on 13 November 1897, due to insubordination\n* Jan Van Damme – Belgian – sailor; fired on 11 December 1897, due to insubordination\n* Maurice Warzee – Belgian – sailor; fired on 11 December 1897, due to insubordination\n* Frans Dom – Belgian – sailor; fired on 11 December 1897, due to insubordination\n* Roald Amundsen - Norwegian - first mate; while he completed the voyage, he technically resigned from his position as officer of the ship. On November 14, 1898, he announced his resignation to Commander de Gerlache, and did so again in writing on November 19. Despite having technically resigned, he continued to perform his duties and reside in officer's quarters.\nSee also\n* Belgian Antarctic Program\n* Heroic Age of Antarctic Exploration\n* List of Antarctic expeditions\nFootnotes\nBibliography\n* ''Bulletin de la Société Royale de Géographie d'Anvers. vol. 20–24 (1896–1900).\n* Bulletin de la Société Royale Belge de Géographie. vol. 20–24 (1896–1900).\n* [http://www2.limburg.be/Pub/%28670%29-Internet/%28670%29-Internet-Deelsites/PBL/Topnavigatie/Oude-boeken/books.html?b=LA-E-17744 Expedition Belge au Pôle Sud: la Belgica et son Equipage]  (Anvers: Bellemans, s.a. 1897)\n* Amundsen, Roald, Decleir, H. (ed), Roald Amundsen's Belgica Diary. The first scientific expedition to the Antarctic (Bluntisham 1999)\n* Baughman, T.H. Before the heroes came. Antarctica in the 1890s (Nebraska 1994)\n*\n* Decleir, H., de Broyer, C. (eds), The Belgica expedition centennial: perspectives on Antarctic science and history (Brussels 2001)\n* Gerlache de Gomery, A., M. Raraty (translation), Fifteen months in the Antarctic (Bluntisham 1998)\n*Lambrechts, J., Antarctica. De Belgen op de pool'' (Antwerp 2011). ISBN 9789081833509\n*\n* Lecointe, G., C. Kaiser and H. Goldfine (translation), In the Land of the Penguins (Erskine 2020)"
    }
  ]
}