{
  "content": [
    {
      "type": "text",
      "text": "# Belgian annexation plans after the Second World War\n\nAfter the defeat of Nazi Germany in World War II in 1945, Belgium planned to annex parts of the territory along the Belgian–German border. In addition to monetary compensations and the lending of labour forces, this was considered a way of reparations. In mid-April 1949, Belgium surprisingly waived any interest in most of the previously claimed areas.\nActual assignments\nOn 1 April 1949 (prior to the founding of the Federal Republic of Germany), the border areas in the territories of North Rhine-Westphalia and Rhineland-Palatinate were temporarily divested to Belgium. These included the following areas:\n* The Aachen neighbourhood of Bildchen (a small hamlet west of Aachen).\n* Some parts of the village  and several farms in the Monschau district of .\n*  in Hellenthal municipality.\n* Losheimergraben.\n* , Winterspelt municipality in Rhineland-Palatinate.\nOriginally, several German exclaves enclosed by Belgian territory were planned. These enclaves still exist, as the route of the Vennbahn railway is Belgian territory and thus divides the populated places west of it from the rest of the German territory. These places are:\n* .\n* Mützenich.\n* The farm Rückschlag near Konzen.\n* The western part of the village  near Simmerath.\n* Parts of Roetgen.\nFurthermore, there are several forested areas in the region between the Belgian town of Elsenborn and the German Kalterherberg.\nIt was planned that the inhabitants of these areas should provisionally remain German citizens in spite of the shifted border.\nAfter the war, Belgium had gradually withdrawn its territorial claims. According to the Allied order of 26 March 1949, several populated places and the Vennbahn, which was of special interest for Belgium (as it had become permanent Belgian territory in 1922 under an article of the Treaty of Versailles) should be handed over. However, on 15 April 1949, a sudden change of mind occurred in Belgium. The Belgian government officially declared that it waived the claims to most places and territories that been assigned to Belgium. This waiver was allegedly not the result of the ongoing protest by the state government of North Rhine-Westphalia, but an insight into the inefficiency of the boundary corrections by Belgium. Because establishing the Vennbahn railway would require huge resources over the years, as had been assessed by Belgium, it was decided to refrain from adding adjacent villages to the military administration. Moreover, the Belgian government did not see any support from a majority of the Belgian population for these measures.\nThe return of the annexed territories to Germany took place on 28 August 1958 due to a German-Belgian border treaty from 24 September 1956. The place Losheimergraben and the western part of the Leykaul municipality, as well as some forests, were excluded from this restoration. These areas remained in Belgium, and so did the previously Belgian municipalities of Eupen and Malmedy that had been incorporated into the German Reich in 1940.\nIn January 2008, it was announced by Belgian Deputy District Commissioner Marcel Lejoly that the planned removal of the Vennbahn rails could have \"international consequences\", and it was speculated that the neighbouring areas had to be returned to Germany. But both the Belgian Foreign Ministry as well as the Foreign Office in Germany declared, that the boundaries were ultimately covered by contract and therefore no change would take place. The German-Belgian border treaty of 1956 cited by the Foreign Office does, however, not contain any indications as to what should happen if the railway facilities mentioned in the contract cease to exist. Therefore, the provisions of the Treaty of Versailles that are not superseded still govern the current borders. Moreover, the option of restoring the railway traffic has not been abandoned and also a bicycle route that has been planned on the former Vennbahn track would not change the borderline.\nSee also\n*Belgium–Germany border\n*Dutch annexation of German territory after World War II\n*Luxembourg annexation plans after the Second World War\n*Recovered Territories\n*Saar Protectorate\n*List of enclaves and exclaves\nReferences\n;Notes\n;General references\n*\n*\nExternal links\n*[https://archive.today/20130221072702/http://geo.uni.lu/joomla/index.php?option=com_content&task=view&id=1507&Itemid=335 A map of borderline shifts]. University of Luxembourg"
    }
  ]
}