{
  "content": [
    {
      "type": "text",
      "text": "# Belgian Army order of battle (1914)\n\n, photographed during the Battle of the Frontiers in August or September 1914]]\nThis is the order of battle for the Belgian Army at the start of the German invasion of Belgium in August 1914.\nBackground\nAt the outbreak of World War I, the Belgian Army was in the middle of a reorganisation. From Belgium's independence in 1830 until 1909 it had comprised a mixed force of volunteers and conscripts recruited by lot. Historically Belgium had a reputation for neglecting its military, due in large part, to its enforced political neutrality. During the 19th century, military reform had been a major political issue as successive governments remained unsure of whether the signatory nations of the 1839 Treaty of London would intervene to guarantee Belgian neutrality if the country were invaded. Belgian politicians were also aware of the rapid expansion of French and German armies during the period. From the 1880s onwards, the Belgian government embarked on an ambitious series of fortress construction but failed to expand or reform the military itself. In 1902, the regular army stood at just 42,800 men with a potential post-mobilisation strength of 180,000.\nAware of the country's precarious geopolitical situation, a new military bill was signed by King Leopold II in 1909, initiating major military reforms. These put an end to the system of remplacement, in which wealthy conscripts could pay a replacement to take their place in the army, and introduced a more egalitarian form of military conscription based on age group. Beyond the acquisition of a few new Krupp artillery pieces, there was little attempt to modernise the army's equipment. Further reforms were launched after the Agadir Crisis in 1911 under the leadership of the Charles de Broqueville government. After several years of discussion, a major military reform bill was ratified by the parliament in 1913 by which the total possible strength of the army would be gradually increased from 180,000 to 350,000 men. Military spending also rose. This reform had only been partially implemented by the outbreak of war and the Belgium Army was still considered to be weak by the German military leadership.\nStrength and equipment\nArmy\nin 1914]]\nThe Belgian government ordered a general mobilisation on 31 July 1914. During the early stages of the 1914 campaign, the military had a strength of nearly 220,000 men:\n*120,500 regular soldiers.\n*65,000 reservists assigned to fortress units\n*46,000 militia of the Garde Civique\n*18,000 new volunteers.\nAll of the units suffered from lack of equipment, including ammunition. There was a shortage of capable officers, and only 120 machine guns in the whole army. The army possessed no field howitzers or heavy artillery. In terms of appearance, the \"royal\" dark-blue, dark-green and crimson uniforms and personal equipment issued to soldiers in 1914 had not changed visibly since 1853. Standards of discipline were frequently lax and Belgian soldiers were often seen as \"indisciplined and careless\". The army had no coherent doctrine and it had as many as five strategic plans, none of which commanded total support from the High Command.\nThe Belgian Army was divided into two, with the majority assigned to the Field Army and lower-quality troops to guard the country's three fortified zones.\nGarde Civique\nby the artist Jules De Bruycker ]]\nBesides the regular army, the Belgian government in 1914 could call on a large militia known as the Garde Civique (Burgerwacht in Dutch). Formed soon after the Belgian Revolution in 1830, the Garde was a paramilitary organisation, which was intended to supplement the small professional army as a reserve and also serve as a police force in periods of civil disorder. Because of the requirements for membership, the organisation was dominated by middle-class volunteers.\nThe Garde was divided into \"active\" and \"non-active\" sections. In towns and cities, the local Garde was considered \"active\" and would incorporate infantry, cavalry, and artillery formations with a wide variety of equipment and different uniforms. By 1913, the \"active\" Garde numbered some 46,000 members. The \"non-active\" Garde (described by historians as a \"paper formation\") was located in smaller settlements and in the countryside where its membership was technically much wider but, like the \"active\" formations, also dominated by the middle-classes. In 1914, 100,000 men of the \"non-active\" Garde were mobilised although they frequently lacked regulation uniforms and were poorly equipped.\n, Belgique]]\nLocal Garde Civique units fought at the Battle of Liège and many other engagements during the initial German invasion in 1914. During the early stages of the war, as many as 1,000 civilians were volunteering for the force every day. Although numerous, modern historians have argued that \"the significance of the Garde Civique should not be exaggerated\", highlighting its \"marginal\" role in the actual fighting. The members of the Garde were often seen by the Germans as francs-tireurs, encouraging them to engage in atrocities against Belgian civilians. The Garde played only a small role in the campaign after 18 August 1914. On 13 October 1914, Albert I ordered the remaining formations to disband and their members incorporated into the regular Belgian army.\nMilitary aviation\nIn 1913, the Belgian government created the Company of Aviators (Compagnie des Aviateurs), the antecedent of the Belgian Air Force, just two years after the inauguration of the country's first airfield at Brasschaat in 1911. Attached to the fortresses, the company was equipped with a total of 16 Maurice Farman biplanes. The Belgian army also had had four observation balloons which, like the aircraft, were also attached to the fortresses, and two small airships.\nOrganisation\nField Army\nThe Field Army (Armée de Campagne) was the largest component of the Belgian Army, which numbered some 117,000 men. King Albert I was in direct command with Lieutenant-General Antonin de Selliers de Moranville as Chief of the General Staff. It was divided into seven army divisions (''divisions d'armée):\n*1st Division (Lieutenant-General Baix) – Ghent.\n**2nd Mixed Brigade (Ghent)\n***2nd Regiment of the Line\n***22nd Regiment of the Line\n**3rd Mixed Brigade (Ostend)\n***3rd Regiment of the Line\n***23rd Regiment of the Line\n**4th Mixed Brigade (Bruges)\n***4th Regiment of the Line\n***24th Regiment of the Line\n**Divisional Cavalry (Bruges)\n***3rd Lancers Regiment\n**Divisional Artillery (Ghent)\n***1st Artillery Regiment\n**Auxiliary units (engineers and logistics)\n*2nd Division (Lieutenant-General Dossin) – Antwerp.\n**5th Mixed Brigade (Antwerp)\n***5th Regiment of the Line\n***25th Regiment of the Line\n**6th Mixed Brigade (Antwerp)\n***6th Regiment of the Line\n***26th Regiment of the Line\n**7th Mixed Brigade (Antwerp)\n***7th Regiment of the Line\n***27th Regiment of the Line\n**Divisional Cavalry (Leuven)\n***4th Chasseurs à Cheval Regiment (provisional)\n**Divisional Artillery (Lier)\n***2nd Artillery Regiment\n**Auxiliary units (engineers and logistics)\n*3rd Division (Lieutenant-General Leman) – Liège.\n**9th Mixed Brigade (Brussels)\n***9th Regiment of the Line\n***29th Regiment of the Line\n**11th Mixed Brigade (Hasselt)\n***11th Regiment of the Line\n***31st Regiment of the Line\n**12th Mixed Brigade (Liège)\n***12th Regiment of the Line\n***32nd Regiment of the Line\n**14th Mixed Brigade (Liège)\n***14th Regiment of the Line\n***34th Regiment of the Line\n**Divisional Cavalry (Liège)\n***2nd Lancers Regiment\n**Divisional Artillery (Liège)\n***3rd Artillery Regiment\n**Auxiliary units (engineers and logistics)\n*4th Division (Lieutenant-General Michel) – Namur.\n**8th Mixed Brigade (Laken)\n***8th Regiment of the Line\n***28th Regiment of the Line\n**10th Mixed Brigade (Namur)\n***10th Regiment of the Line\n***30th Regiment of the Line\n**13th Mixed Brigade (Namur)\n***13th Regiment of the Line\n***33rd Regiment of the Line\n**15th Mixed Brigade (Charleroi)\n***1st Chasseurs à Pied Regiment\n***4th Chasseurs à Pied Regiment\n***24th Regiment of the Line\n**Divisional Cavalry (Namur)\n***1st Lancers Regiment\n**Divisional Artillery (Tienen)\n***4th Artillery Regiment\n**Auxiliary units (engineers and logistics)\n*5th Division (Lieutenant-General Ruwet) – Mons.\n**1st Mixed Brigade (Ghent)\n***1st Regiment of the Line\n***21st Regiment of the Line\n**16th Mixed Brigade (Mons)\n***2nd Chasseurs à Pied Regiment\n***5th Chasseurs à Pied Regiment\n**17th Mixed Brigade (Tournai)\n***3rd Chasseurs à Pied Regiment\n***6th Chasseurs à Pied Regiment\n**Divisional Cavalry (Mons)\n***2nd Chasseurs à Cheval Regiment\n**Divisional Artillery (Leuven)\n***5th Artillery Regiment\n**Auxiliary units (engineers and logistics)\n*6th Division (Lieutenant-General Latonnois van Rode) – Brussels.\n**18th Mixed Brigade (Brussels)\n***1st Grenadier Regiment\n***2nd Grenadier Regiment\n**19th Mixed Brigade (Brussels)\n***1st Carabiners Regiment\n***3rd Carabiners Regiment\n**20th Mixed Brigade (Brussels)\n***2nd Carabiners Regiment\n***4th Carabiners Regiment\n**Divisional Cavalry (Tournai)\n***1st Chasseurs à Cheval Regiment\n**Divisional Artillery (Brussels)\n***6th Artillery Regiment\n**Auxiliary units (engineers and logistics)\n*Cavalry Division (Lieutenant-General de Witte) – Brussels.\n**1st Brigade (Brussels)\n***1st Guides Regiment\n***2nd Guides Regiment\n**2nd Brigade (Ghent)\n***4th Lancers Regiment\n***5th Lancers Regiment\n***4th Chasseurs à Cheval Regiment\n**Carabiniers-cyclistes battalion\n**Horse Artillery\n|AlternativeMap=Belgium location map 1839-1919.svg}}]]\nEach division contained three or four mixed brigades (each with two infantry regiments and one artillery contingent group), one cavalry regiment, and one artillery regiment, as well as various support units. Each infantry regiment contained three battalions, with one regiment in each brigade having a machine-gun company of six guns. An artillery group had three batteries of four guns.\nThe nominal strength of a division varied from 25,500 to 32,000 all ranks, with a total strength of 18 infantry battalions, a cavalry regiment, 18 machine-guns, and 48 guns. Two divisions (the 2nd and 6th) each had an additional artillery regiment, for a total of sixty guns. The Cavalry Division had two brigades of two regiments each, three horse artillery batteries, and a cyclist battalion, along with support units; it had a total strength of 4,500 all ranks with 12 guns, and was therefore little more than a reinforced brigade.\nOn 13 October 1914, the Garde Civique'' was formally disbanded by Albert I and its members officially incorporated into the regular army.\nFortifications\nThe second component of the army were the garrisons deployed to Belgium's three fortified cities. These fortress garrisons numbered approximately 80,000 men. The fortress troops were under local command and the soldiers themselves were generally older and less well-trained than soldiers in the Field Army.\nBefore the war, the Belgian government invested resources in constructing and reinforcing fortifications around the country. These included the National Redoubt at Antwerp, with further fortified chains around the cities of Namur and Liège. The forts, many designed by Henri-Alexis Brialmont, a noted military architect of the nineteenth century, formed an integral part of the Belgian strategy. Between 1859 and 1870, 13 forts had been built around Antwerp and a further 17 were still unfinished by 1914. 12 were built at Liège and eight at Namur.\nSee also\n*German Army order of battle (1914)\n*French Army order of battle (1914)\n*British Expeditionary Force order of battle (1914)\nReferences\nBibliography\n*|title=Belgian Army, 1914|url=http://www.cgsc.edu/CARL/nafziger/914WAAA.PDF|website=Combined Arms Research Library|publisher=United States Army Command and General Staff College|accessdate=15 May 2016|date=2005|archive-url=https://web.archive.org/web/20160308204317/http://cgsc.edu/carl/nafziger/914waaa.pdf|archive-date=8 March 2016|url-status=dead}}\n*\n*\n*\n*\nFurther reading\n*\n*\n*\n*\n*\n*\nExternal links"
    }
  ]
}