{
  "content": [
    {
      "type": "text",
      "text": "# Belle Island (Kingston, Ontario)__disambig_1\n\n| archipelago      =\n| total_islands    =\n| major_islands    =\n| area_km2         =0.44\n| highest_mount    =\n| elevation_m      =\n| country          = Canada\n| country_admin_divisions_title     = Province\n| country_admin_divisions           = Ontario\n| country_admin_divisions_title_1   =\n| country_admin_divisions_1         =\n| country_admin_divisions_title_2   = City\n| country_admin_divisions_2         = Kingston, Ontario\n| country_capital_city              =\n| country_largest_city              =\n| population       =\n}}\nBelle Island is a forested island located in the Cataraqui River, north of downtown Kingston, Ontario. The island is noted for evidence of prehistoric Native use such as hunting and fishing, and for the existence of a burial ground. The island is about 44 hectares in size.\nHistory\nThe island was named Isle aux Recolets during the years of occupation by the French, and Isle au Père after the British occupied the area. The current name, Belle Island, appears after 1828.\nEvidence of use by Native groups for hunting and fishing in the Middle Woodland Period have been discovered on the island. A burial ground was uncovered by accident in 1988 when the City was constructing a beach. The remains of three males, one female, and three children were uncovered by archaeological work in 1990 and reburied in a nearby location in 2000. One of the males was determined to have died because of a bone projectile point which had entered the chest area. Fragments of early tools, pottery and other items were also found. These remains and the found artifacts date from about 1100 years ago.\nBelle Island was acquired by the City of Kingston in 1956. Although there has never been any development on the island, the area between the island and the west shore of the Cataraqui River, known as Belle Park or Cataraqui Park, was once an extensive marsh that was gradually filled in. A landfill occupied this area from 1952 to 1974, and from 1978 to 2017 the landfill was covered and used for a golf course.\nThe City of Kingston and the Mohawk Council of Canada have agreed to collaborate to manage the island. A local group known as the Belle Island Caretakers Circle undertakes annual clean-up events and have plans to protect the island.\nNatural environment\nThe island is located in the Mixedwood Plains Ecozone. Within the island's boundaries, many species of birds, mammals, reptiles, amphibians, fish, insects, plants, and fungi are known to live. A few of the many species that are found here or have been seen here include: American bullfrog, American toad, common watersnake, common snapping turtle, pileated woodpecker, eastern screech-owl, great horned owl, wild turkey, great egret, great blue heron, tundra swan, Canada goose, osprey, bald eagle, American beaver, muskrat, common raccoon, North American river otter, coyote, northern pike, yellow perch, monarch butterfly, eastern red cedar, common juniper, eastern white pine, white spruce, red maple, sugar maple, white oak, and basswood.\nRecreation\nHiking, bird watching, picnicking, mountain biking, and cross country skiing are popular activities. A  km trail traverses the island.\nReferences"
    }
  ]
}