{
  "content": [
    {
      "type": "text",
      "text": "# Belted kingfisher__disambig_1\n\n| status = LC\n| status_system = IUCN3.1\n| status_ref =\n| synonyms = *Alcedo alcyon\n*Ceryle alcyon\n}}\nThe belted kingfisher (Megaceryle alcyon) is a large, conspicuous water kingfisher, native to North America.\nTaxonomy\nThe belted kingfisher received its scientific name from the Swedish naturalist Carl Linnaeus in 1758 in the tenth edition of his Systema Naturae. He introduced the binomial name Alcedo alcyon. He based the name on descriptions and images published by Mark Catesby (1731), John Ray (1713) and George Edwards (1750). The current genus Megaceryle was erected by the German naturalist Johann Jakob Kaup in 1848. Megaceryle is from the Ancient Greek megas, \"great\", and the existing genus Ceryle. The specific alcyon is Latin  for  \"kingfisher\".\nThe Megaceryle large green kingfishers were formerly placed in Ceryle with the pied kingfisher, but the latter is closer to the Chloroceryle American green kingfishers. The belted kingfisher's closest living relative is the ringed kingfisher (M. torquata), and these two in all probability originated from an African Megaceryle which colonized the Americas.\nDescription\nThe belted kingfisher is a stocky, medium-sized bird that measures between  in length with a wingspan of between . This kingfisher can weigh from . The adult female averages slightly larger than the adult male.\nThis species has a large head with a shaggy crest. Its long, heavy bill is black with a grey\nbase. These features are common in many kingfisher species. This kingfisher shows reverse sexual dimorphism, with the female more brightly coloured than the male. Both sexes have a slate blue head, large white collar, a large blue band on the breast, and white underparts. The back and wings are slate blue with black feather tips with little white dots. The female features a rufous band across the upper belly that extends down the flanks. Juveniles of this species are similar to adults, but both sexes feature the rufous band on the upper belly. Juvenile males will have a rufous band that is somewhat mottled while the band on juvenile females will be much thinner than that of adult females.\nDistribution and habitat\nThe only kingfisher in the majority of its range, the belted kingfisher's breeding habitat is near inland bodies of waters or coasts across most of North America, within Canada, Alaska and the United States. They migrate from the northern parts of its range to the southern United States, Mexico, Central America, and the West Indies in winter.  It is a rare visitor to the northern areas of Colombia, Venezuela, and the Guianas. During migration it may stray far from land; the species is recorded as an accidental visitor on several Pacific islands, such as Cocos Island, Malpelo Island, Hawaii, the Azores, Clarion Island, and has occurred as an extremely rare vagrant in Ecuador, Greenland, Ireland, Netherlands, Portugal, and the United Kingdom, with the latter country having five records of the species occurring since 1908. The southernmost records of M. alcyon are from the Galapagos Archipelago, insular Ecuador, where it occurs as a migrant in small numbers but apparently not every year.\nIt leaves northern parts of its range when the water freezes; in warmer areas, it is a permanent resident. A few individuals may linger in the north even in the coldest winters except in the Arctic, if there are remaining open bodies of water.\nEcology and behaviour\nThe belted kingfisher is often seen perched prominently on trees, posts, or other suitable watchpoints close to water before plunging in headfirst after its fish prey. They also eat amphibians, molluscs, small crustaceans, insects, small mammals, small birds, reptiles and berries.\nAs the kingfisher flies about its habitat, it frequently emits a characteristic rattling call. Accordingly, a small group of belted kingfishers is known as a rattle, concentration, or kerfuffle.\nThis bird nests in a horizontal tunnel made in a river bank or sand bank and excavated by both parents. The female lays five to eight eggs and both adults share the task of incubating the eggs and feeding the young. During the breeding season, males may also exhibit a strong degree of territoriality in the immediate vicinity of their nest, chasing away conspecifics and predators alike.\nThe nest of the belted kingfisher is a long tunnel and often slopes uphill. One possible reason for the uphill slope is that, in case of flooding, the chicks will be able to survive in the air pocket formed by the elevated end of the tunnel.\nReferences\nFurther reading\n*\n*\nExternal links\n*[https://www.mbr-pwrc.usgs.gov/id/framlst/i3900id.html Belted Kingfisher – Ceryle alcyon]  – USGS Patuxent Bird Identification InfoCenter\n*\n*\n*[http://www.oiseaux.net/birds/photos/belted.kingfisher.html Oiseaux.net] Photos\n* [https://web.archive.org/web/20110817234636/http://www.flmnh.ufl.edu/wwwsounds/birds/hardy34sh.wav Belted Kingfisher Bird Sound] at Florida Museum of Natural History"
    }
  ]
}