{
  "content": [
    {
      "type": "text",
      "text": "# Belz (Hasidic dynasty)\n\nBelz () is a Hasidic dynasty founded in the town of Belz in Western Ukraine, near the Polish border, historically the Crown of the Kingdom of Poland. The group was founded in the early 19th century by Rabbi Shalom Rokeach, also known as the Sar Shalom, and led by his son, Rabbi Yehoshua Rokeach, his grandson, Rabbi Yissachar Dov, and great-grandson, Rabbi Aharon, before the Nazi invasion of Poland in 1939. While Aharon managed to escape Europe, together with his brother Rabbi Mordechai Rokeach, most of the Belz Hasidim were murdered in the Holocaust. Aharon re-established the Hasidic community in Israel following World War II. As of the 2020s, Belz has sizable communities in Israel, Western Europe, and the Anglosphere.\n]]\n]]\nHistory\nThe founder of the dynasty was Rabbi Shalom Rokeach, also known as the Sar Shalom, who was inducted as rabbi of Belz in 1817 and helped build the city's synagogue. Dedicated in 1843, the building resembled an ancient fortress, with  walls, a castellated roof and battlements adorned with gilded balls, and could seat 5,000 worshippers. It stood until the Nazis invaded Belz in late 1939. The Germans attempted unsuccessfully to destroy the synagogue, by fire and then by dynamite. Afterwards they conscripted Jewish men in forced labour to take the building apart brick by brick.\nWhen Shalom died in 1855, his youngest son, Rabbi Yehoshua Rokeach (served 1855–1894), became the next Rebbe. His son and successor, Rabbi Yissachar Dov Rokeach was in office 1894–1926.\nWhen Yissachar Dov died in 1926 his eldest son, Rabbi Aharon Rokeach, who was 49 years old at the time, succeeded him.\nEscape from Belz\nWith the outbreak of World War II, and the Nazi invasion of Poland (1939), the town of Belz was thrown into turmoil. From 1939 to 1944, it was occupied by Nazi Germany, as a part of the General Government. Belz is situated on the left, north waterside of the Solokiya river (affluent of the Bug river), which was the German-Soviet border in 1939–1941.\nRabbi Aharon Rokeach, known as the \"Wonder Rebbe\", was at the top of the Gestapo's \"wanted list\" of rabbis targeted for extradition and extermination during the Nazi occupation of Poland. With cash inflow from Belzer Hasidim in Switzerland, England, and the United States, the Rebbe and his brother, Rabbi Mordechai of Bilgoray, 22 years younger than his brother, managed to stay one step ahead of the Nazis in one escape attempt after another. Notwithstanding the watchful presence of Gestapo patrols at every turn, the pair was spirited out of Premishlan into the Kraków Ghetto, and then to the Bochnia ghetto. In their most hair-raising escape attempt, the brothers were driven out of occupied Poland, and into Hungary, by Major General István Újszászy, head of the Vkf2 Hungarian counter-intelligence, who was friendly to Jews and acting on orders of Hungarian Regent Admiral Miklós Horthy. The Rebbe, his brother, and his attendant, shorn of their distinctive beards and payot (sidelocks), were disguised as Russian generals who had been captured at the front and were being taken to Budapest for questioning.\nRebbe Aharon and Rabbi Mordechai spent eight months in Budapest, before receiving highly rationed Jewish Agency certificates to enter Palestine. In January 1944, they boarded the Orient Express to Istanbul. Less than two months later, the Nazis invaded Hungary, and began deporting its 450,000 Jews.\nRebuilding the dynasty in Israel\n]]\n, Purim 2006]]\nAlthough he had lost his entire family — including his wife, children, grandchildren, and in-laws and their families — to the Nazis, Rebbe Aharon re-established his Hasidic court in Tel Aviv, where there was a small Hasidic community. Both he and Rabbi Mordechai (who had lost his wife and daughter) remarried, but only Rabbi Mordechai had a child, Yissachar Dov Rokeach, in 1948. Rabbi Mordechai suddenly died a year later, at the age of 47. Rebbe Aharon took his brother's son under his wing to groom him as the future successor to the Belz dynasty.\nLike nearly all of the other groups originating in Poland, Belzer Hasidism was nearly wiped out by the Holocaust. Some Hasidic followers from other communities joined Belz after the war, following the deaths of their rebbes. Belz, like Ger and Satmar, was comparatively fortunate in that its leadership remained intact and survived the war, as opposed to many other Hasidic groups which suffered losses both in terms of rank-and-file supporters, as well as the murder of their leaders.\nRebbe Aharon became an acknowledged leader of Haredi Judaism in Israel. He laid the groundwork for the spread of Belzer Hasidism through the establishment of schools and yeshivas in Tel Aviv, Bnei Brak, and Jerusalem. In 1950, the Rebbe moved his court to the Jerusalem neighborhood of Katamon and established a yeshiva there. His sights set on expanding Belz, he drew up plans for a large yeshiva and study hall in downtown Jerusalem, on a hill behind the original Shaarei Tzedek Hospital. The cornerstone was laid in 1954, and the building was completed in the summer of 1957. One month later, however, the Rebbe died.\nTens of thousands of admirers followed his casket to his burial site in Jerusalem. His nephew, Yissachar Dov, was nine years old at the time. For the next nine years, the movement did not have an active Rebbe. Yissachar Dov married at the age of 18 to the daughter of the Vizhnitzer Rebbe, Rabbi Moshe Yehoshua Hager, and moved to Bnei Brak to be close to his new father-in-law. A year later, he returned to Jerusalem to assume leadership of the Belz movement. His son and heir, Aharon Mordechai Rokeach, was born in 1975.\nBelz today\nin Jerusalem]]\nSince 1966, Rabbi Yissachar Dov Rokeach has presided over both the expansion of Belz educational institutions and the growth of Hasidic populations in Israel, the United States, Canada, and Europe. Like other Hasidic groups, the Belz community has established a variety of self-help organizations, including one of the largest patient-advocacy organizations of its kind, a free medical counseling center, and an affordable medical treatment clinic in the New York area.\nUnder the Rebbe's leadership, the Belz Hasidut has grown from a few hundred families at the time of his accession to leadership in 1966, to over 10,000 families, as of 2024.\nUnited Kingdom\nIn London, the Belz community is now centred in Stamford Hill. In the 1930s, an early Belz synagogue was on Commercial Road, Limehouse, in the East End.\nBelz also maintains a sizable community with 2 synagogues in Manchester. As well as in Westcliff-on-Sea.\nUnited States and Canada\nBelz in the USA was founded in the 1800s, in the time of the Third Belzer Rebbe, Yissachar Dov Rokeach. The first Belz synagogue was rented in East Side Manhattan. Today, the largest number of Belzer Hasidim outside of Israel lives in the United States, mostly in the Borough Park neighborhood of Brooklyn, New York, which has twelve Belzer synagogues and more than twenty Dayanim rabbis. Belz is one of the biggest Hasidic communities in Borough Park, exceeding Vizhnitz, and Ger. Belz in the New York metropolitan area also has communities and synagogues in Williamsburg, and in Staten Island. More Belz communities in New York State are located in Monsey, New York, and Spring Valley, New York. A new Belz development site was built in 2015 in Lakewood, New Jersey and today more than three hundred families live there. Belz operates five local summer camps—three in the Catskill Mountains, one in Saratoga Springs, New York, and one in Val-Morin, Quebec. Los Angeles is also home to a large Belz community, specifically residing in Los Angeles' Beverly-La-Brea and Hancock Park Districts. Belz in the United States and Canada counts over 4000 families; Belz operates five local Yeshiva Ketanas—three in the New York metropolitan area, one in Monsey, New York, and one in Montreal, Quebec. In December 2015, Belz bought a half-acre property in West Brighton, Staten Island, for $1.8 million, to develop a new Yeshiva Ketana complex. Belz hosted New York City mayoral candidate Bill de Blasio in 2013 at an annual dinner. The dinner took place in Brooklyn.\nThe Belz World Center\nFunds were raised in the 1980s and 1990s, for a large new Beis HaMedrash HaGadol (Great Synagogue) that was dedicated in 2000. A huge ark has the capacity to hold 70 Torah scrolls. Nine chandeliers in the main synagogue each contain over 200,000 pieces of Czech crystal.\nLineage of Belzer dynastic leadership\n]]\nRabbi Sholom Rokeach, the founder of the Belz dynasty, was a disciple of the Seer of Lublin. The Seer was a disciple of Rabbi Elimelech Lipman of Lizhensk, author of Noam Elimelech. Rabbi Elimelech was a disciple of the Rebbe Dovber, the Maggid (Preacher) of Mezeritch, the primary disciple of the Baal Shem Tov, the founder of Hasidism:\n*First Belzer Rebbe: Shalom Rokeach of Belz (1779–1855), also known as the Sar Shalom. Rebbe from 1817 to 1855. Disciple of the Seer of Lublin.\n**Second Belzer Rebbe: Yehoshua Rokeach of Belz (1825–1894) – youngest son of the Sar Shalom. Rebbe from 1855 to 1894.\n***Third Belzer Rebbe: Yissachar Dov Rokeach (1854–1926) – son of Yehoshua Rokeach. Rebbe from 1894 to 1926.\n****Fourth Belzer Rebbe: Aharon Rokeach (1877–1957), also known as Reb Arele and as the Kedushat Aharon – eldest son of Yissachar Dov Rokeach. Rebbe from 1926 to 1957.\n*****Fifth Belzer Rebbe: Yissachar Dov Rokeach (b. 1948) – only son of Rabbi Mordechai of Bilgoray; nephew to Rebbe Aharon; son-in-law of Rebbe Moshe Hager of Vizhnitz. Rebbe from 1966–present.\nBelz yeshivas\nBelz maintains 12 yeshivas in Israel: 7 yeshiva gedolas (including two in Ashdod, two in Bnei Brak and one each in Jerusalem, Beitar, and Haifa); an outreach center in Jerusalem, 5 yeshiva ketanas (in Telzstone, Bnei Brak, Ashdod, Beit Hilkia, and Komemiyut); and 7 other yeshiva ketanas around the world (in Antwerp, London, Montreal, Monsey; three in Borough Park, Brooklyn; and one in Lakewood, New Jersey).\nThe Belz network of girls' schools are under the names Bnos Belz and Beis Malka.\nThe rapper Shyne, who converted to Judaism, studied with Hasidim from the Belz group in Jerusalem.\nNotable people\n*Yaakov Yechezkiya Greenwald (1882–1941), rabbi\n*Shulem Lemmer (born 1989), singer\n*Yaakov Yitzhak Neumann (1920–2007), rabbi\n*Aharon Mordechai Rokeach (born 1975), rabbi\n*Mordechai Rokeach (1902–1949), rabbi\n* Faigy Mayer (1986-2015), entrepreneur\n* Yisrael Eichler (1955-), politician\nSee also\n*Hasidic Judaism in Poland\n*History of the Jews in Poland\n*History of the Jews in Galicia (Central Europe)\n*History of the Jews in Ukraine\nReferences\nExternal links\n*[https://www.worldofbelz.org/ World of Belz] website\n*[http://video.google.com/videoplay?docid=5447725737858098635&q=belzer&time=20000 Video tour of the Belz Beit Medrash]\nSources\n*Rossoff, Dovid (1998). Where Heaven Touches Earth: Jewish Life in Jerusalem from Medieval Times to the Present. Jerusalem: Guardian Press. ."
    }
  ]
}