{
  "content": [
    {
      "type": "text",
      "text": "# Ben 10: Alien Swarm\n\n| director       = Alex Winter\n| producer       = Gideon Amir\n| writer         = John TurmanJames Krieg\n| starring       = Ryan KelleyGaladriel StinemanNathan KeyesAlyssa DiazHerbert SiguenzaBarry Corbin\n| music          = Michael Wandmacher\n| cinematography = Anghel Decca\n| production_companies =\nCartoon Network StudiosMan of Action Studios\n|  distributor   = Warner Home Video\n| released =\n| runtime        = 74 minutes\n| country        = United States\n| language       = English\n| budget         = $40 million\n}}\nBen 10: Alien Swarm is a 2009 American superhero film directed by Alex Winter and written by John Turman and James Krieg. Based on the Cartoon Network animated series Ben 10: Alien Force (2008–2010) and the second live-action film in the Ben 10 franchise following Ben 10: Race Against Time (2007), it stars Ryan Kelley, Galadriel Stineman, Nathan Keyes, Alyssa Diaz, Herbert Siguenza, and Barry Corbin. The film takes place during the events of Alien Force, later receiving follow-up episodes in the sequel series Ben 10: Ultimate Alien (2010–2012).\nBen 10: Alien Swarm held its world premiere in London on November 15, 2009, and premiered on Cartoon Network on November 25, 2009, where it was watched by 4.02 million viewers.\nPlot\nBen Tennyson, Gwen Tennyson and Kevin Levin negotiates with a group of black market dealers attempting to sell alien nanochips, which are causing interference with the Omnitrix. One of them reveals herself to be Elena Validus, Ben and Gwen's childhood friend. Elena explains that she had set up negotiations to lure Ben to seek his help in finding her abducted scientist father. As Ben agrees to help her, the chips spring to life and attack, controlled by a man on a catwalk. The group fights them, and in the process the suspicious man and the dealers escape.\nWhile Elena claims she is not responsible for the attack, Kevin and Gwen are suspicious of her. At their headquarters, the trio, along with Grandpa Max, study one of the chips salvaged from the fight, learning that they are a hybrid of organic and technological components. Having followed the trio, Elena breaks in and Max orders her to leave, explaining that Elena's father Victor Validus was his apprentice, who was dishonorably discharged after stealing the original chips. Ben refuses to believe that Elena is like her father, and breaks ranks with Max and teammates to help her. While Max is away, Gwen and Kevin investigate Victor and discover a video of Max interrogating Victor, in which Victor insists that \"The Hive\", the mind intelligence behind the chips, is coming to take over the planet as they are revealed to be able to possess people.\nMeanwhile, Ben and Elena arrive at Victor's old laboratory which had been cleared by the Hive, where they find evidence that Victor was studying and upgrading the chips. Elena reveals that her father had become erratic before disappearing, and had stopped returning home. He also appears to be the man from the rafters controlling the chips. A mob under the control of the chips ambush Ben and Elena, forcing them to retreat. The Omnitrix again experiences interference around the chips and keeps Ben from transforming, but Ben utilizes a scanning function to temporarily repel the mob and allow him and Elena to escape. They head to the Ship-It building to investigate further, though Ben is somewhat suspicious of Elena himself, realizing the mob expected him and Elena to head towards the lab and set a trap for them.\nBen finds an order slip made out for that day when Elena claimed that Victor had already been missing for weeks. Having reached the building, Gwen and Kevin are too late to stop the distribution of the chips. Instead, they are met by one of the Ship-It employees, who is also under the chips' control. He summons another larger chip swarm, now capable of forming solid, weaponizable shapes, to attack Gwen and Kevin, damaging Kevin's car during a lengthy chase. Upon joining them, Ben uses Humongousaur to defeat the swarm, destroying Kevin's car in the process. By the time they return to headquarters, the chips have spread across the globe and number in millions.\nGwen realizes the swarm's new ability is a sign that they can adapt to threats and become smarter. The group also deduces the chips have a queen, as the chip's hosts have mentioned her. They believed that they can stop the chips by destroying her, but during their search, Max is possessed. Pulling together, the group notice that while world population centers are all infected, Barren Rock, Missouri has the highest concentration, an apparent anomaly in their distribution. Infiltrating the factory, populated by multiple infected, including Max, the group discovers that the Queen infected Victor and his body is being used as a hive to rapidly mass-produce the chips. Fearing being possessed by the chips while in his alien forms, Ben uses the Omnitrix to transform into a new alien that he calls \"Nanomech\", a hybrid of his human DNA and the chips.\nNanomech flies into Victor's head and battles the Queen, while Gwen, Kevin and Elena fight the infected. As the dormant chips in the factory activate, Nanomech uses the chips' ability to adapt to overwhelm and destroy the Queen, freeing everyone from the chips' control. After apologizing to Victor, Max decides to retire and leave his position as leader to Ben, but Ben refuses as he Gwen, Kevin and Elena drive home.\nCast\n* Ryan Kelley as Ben Tennyson\n* Galadriel Stineman as Gwen Tennyson\n* Nathan Keyes as Kevin Levin\n* Alyssa Diaz as Elena Validus\n* Herbert Siguenza as Victor Validus\n* Barry Corbin as Max Tennyson\n* Dee Bradley Baker as Big Chill, Humungousaur (voice)\n* Alex Winter as Nanomech (voice)\n* Wendy Cutler as The Queen (voice)\n* Patrick Cox as Big Ed\nProduction\nMajor hurdles for film's initial production stage included the 2007-2008 Writers Guild of America strike as well as the threat of strikes by other guilds. Prior to a potential Directors Guild of America strike, Winter began creating animatics of action sequences featuring characters rejected for the 2007 film. This would allow animators to complete sequences if the Directors Guild of America went on strike in January 2008, which ultimately did not happen. Winter considered making a small project in between Ben 10 and the movie, but decided against the idea, saying \"you have your baby and you don't want someone else to take it\".\nInspired by its use in Sam Raimi's Spider-Man, three action sequences in Ben 10: Alien Swarm were shot using IMAX cameras. Although screenwriters John Turman and James Krieg suggested that the IMAX footage would be 3D, Winter later said he found 3D too gimmicky. Winter added that shooting in IMAX was easier than using stereoscopic cameras.\nCartoon Network became more involved in the designs of the aliens than the company was for Ben 10. The company along with Boomerang, suggested to the filmmakers that combining aliens be the main draw for the movie.\nThe score to Ben 10: Alien Swarm was composed by Michael Wandmacher, who reunited with director Alex Winter to record his score with a 71-piece ensemble of the Northwest Sinfonia and Blue Man Group at the Bastyr University. Many songs were featured in the film including: \"Sharks\" by Red Fang, \"A Little Faster\" by There for Tomorrow, \"Flyentology\" by EL-P, \"Healer\" by Torche, \"Rescue Me\" by Hawthorne Heights, and \"Tell Me\" by Story of the Year.\nCancelled sequel\nThe film was successful enough to warrant a sequel. Actor Ryan Kelley, who portrayed Ben Tennyson, was asked to return for two more potential sequels. CN Real went defunct in early 2010 due to poor ratings and Cartoon Network decided to distance themselves from further live action projects.\nOn June 14, 2011, The Matrix producer Joel Silver announced that he, along with Warner Bros. and Dark Castle Entertainment, would be working on a film version of Ben 10. In January 2012, Albert Torres was announced as screenwriter. In February 2013, Ryan Engle was announced to work on Torres' script. Andrew Rona, Steve Richards, and Joel Silver were producers. Alex Heineman and Sarah Meyer were executive producers.\nIn March 2019, the project was confirmed to have been redeveloped as a live-action streaming television series, to be released on WarnerMedia's then-upcoming streaming service HBO Max. However, after the announcement, no official statements were made about the project.\nReception\nAccolades\nBen 10: Alien Swarm was nominated for 2010 Emmys for Outstanding Special Visual Effects for a Miniseries, Special or Movie - 2010.\nReferences\nExternal links\n*"
    }
  ]
}