{
  "content": [
    {
      "type": "text",
      "text": "# Bengal Film Journalists' Association Awards\n\n'''Bengal Film Journalists' Association Awards commonly referred as BFJA Awards, is given by The Bengal Film Journalists' Association'''. The BFJA is the oldest association of film critics in India, founded in 1937 to serve the developing film journalism and film industry.\nOverview\nMembers of the association are drawn from the film section of the entire press of West Bengal composed of dailies, periodicals and film journals in various languages published from Kolkata. Film correspondents and critics working for any newspaper or periodicals published outside Bengal having their base in Kolkata were also eligible to be members of this association.\nThe association was the first to institute awards in an endeavor to promote and encourage the production of better films, when in 1938, a year after its inception, the 1st Motion Picture Congress was held in Faridpur (now in Bangladesh). Representatives of the association played a vital role in its deliberations.\nIn 1952 when India staged the First International Film Festival, a large exhibition was held in Kolkata Maidan. It included an exhibit of antique movie cameras, projectors and other accessories, showing the growth of films and development of the Indian film industry. BFJA had its own stall where it displayed its various magazines, periodicals and journals published from Kolkata, as well as copies of old magazines and journals on films tracing the history of the growth of film journalism in the country.\nThereafter, when the I.F.F.I. became a regular event on the circuit of International Film Festivals, the BFJA tendered active assistance and co-operation whenever called upon to serve on any committee in the interest the festival's success. For the last four years the Association has been bringing out a special bulletin to commemorate the I.F.F.I. and hosting a reception for the visiting delegates.\nTo the members of BFJA, cinema, apart from its basic function of providing clean entertainment, is a strong social, cultural and artistic force to help the progressive development of the nation.[http://www.bfjaawards.com/bfja/index.htm 69th & 70th Annual Hero Honda BFJA Awards 2007]\nSoumitra Chatterjee is the most awarded actor of all time with 9 wins, followed by Uttam Kumar (8) and Prosenjit Chatterjee (7), Rajesh Khanna (4), Sabyasachi Chakraborty (2) and Utpal Dutt (2).\nAwards\n*Best Indian Films\n*Best Director\n*Best Actor\n*Best Actress\n*Best Supporting Actor\n*Best Supporting Actress\n*Best Screenplay\n*Best Cinematographer\n*Best Art Director\n*Best Editor\n*Best Music Director\n*Best Lyricist\n*Best Male Playback\n*Best Female Playback\n*Best Make Up Man\n*Babulal Chowkhani Memorial Trophy for Best Original Story\n*Most Outstanding Work of the Year (Actor and Actress)\n*B.C. Agarwal Memorial Award for Best Film Critic/Journalist\n*Bengal Film Journalists' Association – Best Book on Cinema Award\n*Best Clean & Entertainment Film\n*Bengal Film Journalists' Association – Most Promising Director Award\n*Most Promising Actor\n*Most Promising Actress\nDocumentary Section\n*Bengal Film Journalists' Association – Best Documentary (Jointly) Award\n*Bengal Film Journalists' Association – Best Director Documentary (Film) Award\nSpecial Awards\n*Bengal Film Journalists' Association – Hero Honda Youth Icon Awards\n*Bengal Film Journalists' Association – Hero Honda Voice of All Gen\nHindi Section\n*Bengal Film Journalists' Association – Best Film Award (Hindi)\n*Best Director\n*Best Actor\n*Best Actress\n*Best Supporting Actor\n*Best Supporting Actress\n*Best Female Playback Singer\n*Best Male Playback Singer\n*Bengal Film Journalists' Association – Best Screenplay Award (Hindi)\n*Best Lyricist\n*Best Music Director\n*Bengal Film Journalists' Association – Satyajit Ray Lifetime Achievement\nForeign Film Section\n*Bengal Film Journalists' Association – Best Foreign Film Award\n*Bengal Film Journalists' Association – Best Foreign Director Award\n*Bengal Film Journalists' Association – Best Foreign Actor Award\n*Bengal Film Journalists' Association – Best Foreign Actress Award\nSee also\n*Bengali cinema\nReferences\nExternal links\n*\n* Film & TV Database}}"
    }
  ]
}