{
  "content": [
    {
      "type": "text",
      "text": "# Bennington Battle Monument\n\n| nearest_city            =\n| area                    =\n| built                   =\n| architect               =\n| architecture            =\n| designated              =\n| added                   = March 31, 1971\n| established             =\n| visitation_num          =\n| visitation_year         =\n| refnum                  = 71000054\n| mpsub                   =\n| governing_body          =\n| nrhp_type2              = indcp\n| nocat                   = yes\n| designated_nrhp_type2   = October 4, 1984\n| partof                  = Old Bennington Historic District\n| partof_refnum           = 84000030\n}}\nThe Bennington Battle Monument is a  stone obelisk located at 15 Monument Circle, in Bennington, Vermont, United States.  The monument commemorates the Battle of Bennington during the American Revolutionary War.\nIn that battle, on 16 August 1777, Brigadier General John Stark and 1,400 New Hampshire men, aided by Colonels Warner and Herrick of Vermont, Simonds of Massachusetts, and Moses Nichols of New Hampshire, defeated two detachments of General John Burgoyne's British army, who were seeking to capture a store of weapons and food maintained where the monument now stands. While the battle is termed the Battle of Bennington, it actually occurred about  away, in Walloomsac, New York;  the Bennington Battlefield, a U.S. National Historic Landmark, is entirely within the state of New York.\nIn 1877, a local historical society began to plan a monument for the battle's centenary, and considered many designs. One which called for a slender stone column only  tall was showcased during the battle's centennial celebration, which was attended by President Rutherford B. Hayes. The committee eventually accepted J. Phillip Rinn's design with some changes. The monument's cornerstone was laid in 1887, and it was completed in November 1889 at a total cost of $112,000 (including the site). It is constructed of Sandy Hill Dolomite from present day Hudson Falls, New York, a blue-gray magnesian limestone containing numerous fossils. Dedication ceremonies were delayed until 1891, when President Benjamin Harrison attended the ceremonies and held a reception at the nearby Walloomsac Inn. Today the Bennington Battle Monument is a Vermont State Historic Site.\nFrom its observatory level at , which can be reached by elevator (but not the 417 stairs, which are closed), one can see Vermont along with the other U.S. states of Massachusetts and New York. A kettle captured from General Burgoyne's camp at Saratoga is visible in the monument along with a diorama of the second engagement, and information on how the monument was built. Statues of John Stark (\"Live Free or Die\"), Seth Warner, and other notables ornament the grounds.\nThe monument, while  from the relevant battlefield, is located very close to what was once the site of the Catamount Tavern, where Ethan Allen and the Green Mountain Boys planned the capture of Fort Ticonderoga in 1775.\nBennington Battle Memorial.jpg|Full view in late afternoon\nBennington 2.jpg|View from elevator floor facing east towards Green Mountains\nGeneralStark.jpg|Statue of Brigadier General John Stark\nSeth_Warner_Statie.png|Statue of Seth Warner\nSee also\n* Bennington Battlefield\n* Fort Rosecrans National Cemetery\n* National Register of Historic Places listings in Bennington County, Vermont\n* Saratoga Battle Monument\n* USS Bennington Monument\nReferences\nExternal links\n* [https://web.archive.org/web/20170116061913/http://historicsites.vermont.gov/directory/bennington Vermont Historic Sites: Bennington Battle Monument]\n* [https://web.archive.org/web/20090413150926/http://www.bennington.com/chamber/walking/monumentdescription.html Bennington.com: The Bennington Monument]"
    }
  ]
}