{
  "content": [
    {
      "type": "text",
      "text": "# Berajondo, Queensland\n\n| pop                 = 112\n| pop_year            =\n| pop_footnotes       =\n| established         =\n| postcode            = 4674\n| area                = 114.1\n| timezone            = AEST\n| utc                 = +10:00\n| dist1               = 8.6\n| dir1                = W\n| location1           = Rosedale\n| dist2               = 65.2\n| dir2                = NW\n| location2           = Bundaberg\n| dist3               = 121\n| dir3                = SE\n| location3           = Gladstone\n| dist4               = 427\n| dir4                = NNW\n| location4           = Brisbane\n| lga                 = Gladstone Region\n| stategov            = Burnett\n| fedgov              = Flynn\n| near-n              = Lowmead\n| near-ne             = Mount Maria\n| near-e              = Rosedale\n| near-se             = Rosedale\n| near-s              = Rosedale\n| near-sw             = Lowmead\n| near-w              = Lowmead\n| near-nw             = Lowmead\n}}\nBerajondo is a rural locality in the Gladstone Region, Queensland, Australia. In the , Berajondo had a population of 112 people.\nHistory\nMilsted Provisional School opened on 3 June 1895. On 1 January 1909, it became Milstead State School. In 1911, it was renamed Murray's Creek State School and then renamed in 1931 as Berajondo State School. It closed on 31 December 1965. It was at 173 Dawsons Road ().\nThe Cairns Tilt Train derailment occurred at 11:55 pm on 15 November 2004 when the City of Townsville diesel tilt train derailed north of Berajondo. The prima facie cause of the incident was excessive speed; the train was travelling at  when it derailed at the beginning of a curve with a speed limit of . Despite the seriousness of the incident, there were no fatalities, but some people were injured.\nDemographics\nIn the , Berajondo had a population of 61 people.\nIn the , Berajondo had a population of 112 people.\nEducation\nThere are no schools in Berajondo. The nearest government primary schools are Rosedale State School in neighbouring Rosedale to the east and Lowmead State School in neighbouring Lowmead to the north. The nearest government secondary school is Rosedale State School (to Year 12).\nReferences\nFurther reading\n*"
    }
  ]
}