{
  "content": [
    {
      "type": "text",
      "text": "# Berlin-Warszawa-Express\n\n| el              =\n| speed           =\n| owners          =\n| routenumber     = EC95 (Germany)\n| map             =\n| map_state       = hidden\n}}\nThe Berlin-Warszawa-Express (BWE) is a cross-border train service that connects Berlin and Warsaw via Frankfurt (Oder), operated jointly by Deutsche Bahn (DB Fernverkehr) and Polish State Railways (PKP Intercity). The service, classed as EuroCity, runs four times per day in each direction, with the services given the numbers 40–47. Total journey time is 4 hours, 50 minutes.\nHistory\nThe Berlin-Warszawa-Express brand began in 2002, replacing the names of individual services which had been added to the EuroCity network over the previous decade. There were four pairs of services (EC 40–47) linking Berlin Zoologischer Garten and Warsaw Wschodnia, plus a fifth (48/49), which only ran from Berlin to Poznań, and as such didn't take the BWE name. This additional service was dropped in 2004, but restored in 2007, and from 2012, continued from Poznań to Gdańsk and Gdynia, under the name Berlin-Gdynia Express. The route to Warsaw was expanded to 6 pairs of services by 2023 (EC 40-49,246-249), and as of 2025 the service to Gdynia runs under the name Gedania (EC 230/231).\nFrom 2021, services were added connecting Berlin to Wrocław, Katowice and Kraków in the South of the country. In 2023 this service was extended to connect to Przemyśl near the border with Ukraine, and the number of services expanded to three pair (EC 54-59) by 2025.\nThe service began to serve Berlin Hauptbahnhof after its opening in 2006, no longer serving Berlin Zoo.\nRolling stock\n.]]\nEach train is six coaches long, using specially branded carriages provided by both DB and PKP - the livery is white, as per DB Intercity, but with a dark blue stripe instead of the normal red. Four of them (three full 2nd class and handicap car) are provided by PKP, Restaurant/1st class and first class are delivered by DB.\nSince December 2010 the train has been hauled by Siemens EuroSprinter (ES 64) locomotives, provided by PKP and known in Poland as Class EU 44 Husarz. Prior to this the DB Class 180 was the most common traction, with Class 186 and Class 232 seen on occasion. In 2016, carriages are mainly provided by PKP Intercity, only restaurant carriage is provided by Deutsche Bahn. By 2017, all German restaurant carriages were returned to Deutsche Bahn. All carriages are provided by PKP Intercity.\nPotential Improvements\nPlans for the Polish Y High Speed Line include a route from Poznan to Warsaw, which follows the Berlin-Warszawa Express. Later phases include plans to extend to Berlin.\nSummary of services\n{| class=\"wikitable\"\n|-\n!#\n!Former name\n!Period of EC operation\n!Details\n|-\n|40/41\n|Varsovia\n|1993–\n|\n|-\n|42/43\n|Berolina\n|1991–\n|\n|-\n|44/45\n|Paderewski\n|1998–\n|\n|-\n|46/47\n|n/a\n|2002–\n|\n|-\n|48/49\n|Posnania\n|1998–20042008\n|Berlin to Poznań only\n|}\nSee also\n*Berlin–Wrocław railway\nReferences\n*\n*"
    }
  ]
}