{
  "content": [
    {
      "type": "text",
      "text": "# Bermondsey and Old Southwark\n\n|map2 =\n|map_entity = Greater London\n|map_year = 2024\n|map_size = 200px\n|year = 2010\n|type = Borough\n|previous = North Southwark and Bermondsey\n|next =\n| population = 109,200 (2022)\n|electorate = 70,602 (March 2020)\n|mp = Neil Coyle\n|party = Labour\n|region = England\n|county = Greater London\n|european = London\n|elects_howmany = One\n}}\nBermondsey and Old Southwark is a constituency in the House of Commons of the UK Parliament.  Since 2015, it has been represented by Neil Coyle of the Labour Party. He was suspended from the party in February 2022 following an accusation of racism, but reinstated in May 2023.\nConstituency profile\nComprising the northern part of the London Borough of Southwark, the constituency lies immediately to the south of the City of London. It includes the areas of Bermondsey, Southwark, Rotherhithe and parts of Elephant and Castle.\nThe constituency contains a number of London landmarks including the southern ends of London Bridge and Tower Bridge, Borough Market, Shakespeare's Globe and The Shard, the tallest building in the country. The area was historically associated with manufacturing and trade, but has now been redeveloped with commercial properties and contemporary housing.\nResidents of the constituency are generally young, unmarried and have high levels of education and professional employment compared to London averages. They have low levels of car and home ownership. The constituency is ethnically diverse; 34% are White British, 19% identify as Other White, 18% are Black and 13% are Asian. At 9.4% of the population, Bermondsey and Old Southwark has the fourth-highest proportion of LGB+ people in the country.\nAt the most recent borough council election in 2022, Southwark and Rotherhithe elected Liberal Democrat councillors, whilst the area between them, including Bermondsey, elected primarily Labour Party councillors. At the 2016 referendum on European Union membership, voters in the constituency overwhelmingly voted to remain in the EU. It is estimated that 73% opposed Brexit, making the constituency one of the top 25 most remain-supporting constituencies out of 650 nationwide.\nHistory and boundaries\n|frame=yes|text=Map of boundaries from 2024}}\nThe seat was created for the 2010 general election, almost identical to North Southwark and Bermondsey seat previously held by Simon Hughes from the 1997 general election, on a review of parliamentary representation in London by the Boundary Commission for England facing very minor boundary changes.\nThe constituency lies within the London Borough of Southwark. Prior to the 2023 boundary changes, it contained the Old Southwark area of the former Metropolitan Borough of Southwark and the neighbourhoods of Borough, London Bridge and Bankside. Within the constituency are Elephant and Castle, Walworth and Newington which were part of the old Metropolitan Borough. The eastern half of the seat includes Bermondsey and Rotherhithe which were part of the Metropolitan Borough of Bermondsey, and which had been a separate constituency also.\nThis seat is based on the 1997–2010 North Southwark and Bermondsey constituency. Following the 2002 redrawing of ward boundaries, parts of Faraday and Livesey wards that were part of North Southwark and Bermondsey transferred to Camberwell and Peckham.\n2010–2024:\nThe new seat was created from the following electoral wards within the London Borough of Southwark: Cathedrals, Chaucer, East Walworth, Grange, Newington, Riverside, Rotherhithe, South Bermondsey, Surrey Docks.\n2024–present:\nFollowing the 2023 review of Westminster constituencies, which came into effect for the 2024 general election, the constituency is composed of the following wards of the London Borough of Southwark (as they existed on 1 December 2020):\n* Borough & Bankside; Chaucer; London Bridge & West Bermondsey; North Bermondsey; Rotherhithe; St. George's; South Bermondsey; Surrey Docks.\nThe contents reflect the new ward structure which became effective in May 2018. To bring the electorate within the permitted range, Newington was transferred to Vauxhall and Camberwell Green, and North Walworth was transferred to Peckham.\nMembers of Parliament\nNote: the first MP was elected for predecessor Bermondsey seats continuously from a by-election in 1983 until the seat was created in 2010: see the former constituency of North Southwark and Bermondsey.\n{| class=\"wikitable\"\n|-\n!colspan=\"2\"|Election!!Member!!Party\n|-\n|style=\"color:inherit;background-color: \" |\n| 2010\n| Sir Simon Hughes\n| Liberal Democrat\n|-\n|style=\"color:inherit;background-color: \" |\n| 2015\n|rowspan=3 | Neil Coyle\n|Labour\n|-\n|style=\"color:inherit;background-color: \" |\n| February 2022\n| Independent\n|-\n|style=\"color:inherit;background-color: \" |\n| May 2023\n| Labour\n|}\nElections\nElections in the 2020s\n}}\n1.1\n}}\nElections in the 2010s\n{| class=\"wikitable\"\n|-\n! colspan=\"4\" | 2019 notional result\n|-\n! bgcolor=\"#DDDDFF\" width=\"130px\" colspan=\"2\" | Party\n! bgcolor=\"#DDDDFF\" width=\"50px\" | Vote\n! bgcolor=\"#DDDDFF\" width=\"30px\" | %\n|-\n|\n| Labour ||align=right| 22,776 ||align=right| 49.6\n|-\n|\n| Liberal Democrats ||align=right| 14,261 ||align=right| 31.1\n|-\n|\n| Conservative ||align=right| 7,710 ||align=right| 16.8\n|-\n|\n| Brexit Party ||align=right| 1,113 ||align=right| 2.4\n|-\n|\n| Green ||align=right| 25 ||align=right| 0.1\n|-\n|colspan=\"4\" bgcolor=\"#EAECF0\"|\n|-\n|colspan=\"2\"|Majority\n|align=right|8,515\n|align=right|18.6\n|-\n|colspan=\"2\"|Turnout\n|align=right|45,885\n|align=right|65.0\n|-\n|colspan=\"2\"|Electorate\n|align=right|70,602\n|}\n}}\n}}\n}}\n}}\n{| class=\"wikitable\"\n|-\n! colspan=\"4\" | 2005 notional result\n|-\n! bgcolor=\"#DDDDFF\" width=\"130px\" colspan=\"2\" | Party\n! bgcolor=\"#DDDDFF\" width=\"50px\" | Vote\n! bgcolor=\"#DDDDFF\" width=\"30px\" | %\n|-\n|\n| Liberal Democrats ||align=right| 17,336 ||align=right| 47.6\n|-\n|\n| Labour ||align=right| 11,645 ||align=right| 32.0\n|-\n|\n| Conservative ||align=right| 4,689 ||align=right| 12.9\n|-\n|\n| Others ||align=right| 2,742 ||align=right| 7.5\n|-\n|colspan=\"4\" bgcolor=\"#EAECF0\"|\n|-\n|colspan=\"2\"|Turnout\n|align=right|36,412\n|align=right|49.2\n|-\n|colspan=\"2\"|Electorate\n|align=right|73,944\n|}\nSee also\n*List of parliamentary constituencies in London\n*Southwark London Borough Council elections\nNotes\nReferences\nExternal links\n*[https://web.archive.org/web/20180216152334/http://www.politicsresources.net/area/uk/edates.htm Politics Resources] (election results from 1922 onwards)\n*[http://www.electoralcalculus.co.uk/flatfile.html Electoral Calculus] (election results from 1955 onwards)\n*[https://mapit.mysociety.org/area/65689.html Bermondsey and Old Southwark UK Parliament constituency] (boundaries April 2010 – May 2024) at MapIt UK\n*[https://mapit.mysociety.org/area/168523.html Bermondsey and Old Southwark UK Parliament constituency] (boundaries from June 2024) at MapIt UK"
    }
  ]
}