{
  "content": [
    {
      "type": "text",
      "text": "# Bern Historical Museum\n\n| image               = Historic museum Bern1.jpg\n| image_upright       =\n| alt                 =\n| caption             = The Museum entrance on Helvetiaplatz\n| map_type            = Switzerland Bern downtown#Canton of Bern#Switzerland\n| map_relief          =\n| map_size            =\n| map_caption         =\n| coordinates         =\n| former_name         =\n| established         =\n| dissolved           =\n| location            = Helvetiaplatz, Bern, Switzerland\n| type                = History\n| accreditation       =\n| key_holdings        =\n| collections         =\n| collection_size     = 500,000\n| visitors            =\n| founder             =\n| executive_director  =\n| leader_type         =\n| leader              =\n| director            = Jakob Messerli\n| president           =\n| ceo                 =\n| chairperson         =\n| curator             =\n| architect           = André Lambert\n| historian           =\n| owner               =\n| publictransit       =\n| car_park            =\n| parking             =\n| network             =\n| website             =\n| embedded             =\n}}\nThe Bern Historical Museum (, ) is the second largest historical museum in Switzerland. It was designed by the Neuchâtel architect André Lambert and built in 1894.\nSince it was initially conceived as the Swiss National Museum (which the city of Zurich was later chosen to host), the architect took as his model various historic castles from the 15th and 16th centuries. An extension to the original museum building was completed in 2009.\nCollections\nThe museum contains collections related to the history of Bern from prehistoric times to the present and other artefacts on permanent display from Asia, Oceania, America and Egypt.  The collection includes important tapestries and other loot from the camp of Duke Charles the Bold of Burgundy, taken after his defeat and death at the Battle of Nancy in 1477.\nThe Bern Historical Museum is a heritage site of national significance.\nOne of the most remarkable items in the collection is the Muri statuette group, a group of six Gallo-Roman bronze figurines, and the Moringen arrowhead, determined to be of meteoric origin in 2023 despite being in the collection for well over a century.\nThe museum is home to the mummified head of a man who lived in Egypt in the first or early second century BC.\nOver the museum's entrance is a glass mosaic, \"The Age of History\", featuring the figures of Poetry and History, made in 1900 by the Swiss painter Léo-Paul Robert.\nEinstein Museum\nThe Einstein Museum\nFirst conceived as a temporary exhibition in 2005, the Einstein Museum became a museum dedicated to the life and work of Albert Einstein, who developed the Relativity Theory while living in Bern. The house where he lived (Einsteinhaus) in this period is also open to the public, but is located elsewhere in the city and charges separate entry fees.\nMultaka network\nIn 2019, the museum joined six similar museums in Germany, Italy, Greece and the United Kingdom, creating the international Multaka network. This intercultural museum project organizes guided tours for refugees and migrants designed and offered for free by specially trained Arabic-speaking Multaka guides. The visitor-centered discussions with migrants in their language are focused on the historical origin and history of acquisition of cultural objects, including the visitors' own understanding of their country's cultural heritage.\nSee also\n*List of museums in Bern\n*List of museums in Switzerland\nFootnotes\nExternal links\n*[http://www.bhm.ch/ Historical Museum of Bern]\n*[http://www.einstein-bern.ch/index.php?lang=en&show=start The Einstein house]"
    }
  ]
}