{
  "content": [
    {
      "type": "text",
      "text": "# Berrien County Historical Association\n\nThe Berrien County Historical Association (BCHA) is a historical association located in Berrien Springs, Michigan.  Established in 1968 as the Berrien County Historical Commission, the organization partners with Berrien County, Michigan to operate the History Center at Courthouse Square, also located in Berrien Springs.  The Courthouse Square is home to two of Michigan's most historic properties – the 1839 County Courthouse and the 1830 Murdock Log Cabin.  In addition to permanent exhibits, the BCHA also mounts temporary exhibits throughout the year and hosts numerous programs for all ages on topics related to the history, heritage, and culture of Berrien County and the surrounding areas.\nHistory\nThe Berrien County Historical Commission (later the Association) was established in 1967 to save and restore the 1839 Courthouse to its original look. The Commission developed plans for the restoration of the Courthouse and began to raise funds to make these plans almost immediately. After receiving their 501c3 designation in 1968, fundraising increase and the group secured several grants and were the recipient of outside fundraisers and governmental funds as work continued into the early 1970s.  By 1974, work on the courthouse was considered complete and with that, the Commission chose to rebrand as the Association. It was deemed that a rebrand was necessary as the organization had grown beyond its original mission with the addition of other properties like the Murdoch Log Cabin.\nIn the early 1970s, the Commission secured enough funding to hire exhibit designer David Mohrhardt as the project manager and would later be promoted to the director position, which he held until 1979. Expansion of staff continued and by the 1980s, the BCHA regularly employed upwards to three people to handle what would become a year-round operation as the Courthouse Complex continued to grow throughout the next two decades.  In addition to preserving and interpreting the five historic structures located within the Courthouse complex, the BCHA hosted numerous programs and temporary exhibits over the years with special focus on topics related to Berrien County history, including popular bus tours in the 2000s, a film series in the 1970s, and serving as a long-time partner for the Berrien Springs Pickle Festival.\nAfter several name changes and continued confusion with the North Berrien Historical Museum in Coloma, the board of directors voted in 2007 to rebrand the museum as the History Center at Courthouse Square.\nRelationship with Berrien County\nSince 1968, Berrien County has own the grounds and buildings of the History Center at Courthouse Square, providing financial support to the BCHA to operate the property as a museum. Until 2013, the Courthouse Square remained as standalone budget item for the county. That year, the county commissioners agreed to place the complex under the auspices of the Parks Department and the transfer was completed in time for the 2014 Fiscal Year, become the departments seventh site. In addition to operational support, the county also provides building maintenance and ground care.\nArchives and collections\nThe BCHA is home to the Clark Equipment Company's corporate archives, spanning from the early 20th century until the 1980s and includes annual reports, film reels, display models, and copies of the Clark Employee News, among others. In addition to the corporate files, the museum is home to additional Clark-related memorabilia donated by former employees or their families.\nHonors and recognitions\n1977: Recipient, Award for restoration work on the 1839 Courthouse, Association for State and Local History\n2001: Recipient, Excellence in Institutional Achievement for Adeline and Julia: Growing Up on the Michigan and Kansas Frontier book, Michigan Museum Association\n2020: Recipient, PIVOT! Award, Michigan Museum Association\nPublications\nHistorical Sketches Series\nThis series of books began publication in 1988 and would eventually include three additional volumes.  Later in 2004, volumes 1 and 2 were combined into a new volume and in 2005, volumes 3 and 4 received the same treatment.  In 2009, all four volumes were re-edited and released under a single title with 152 stories included in this volume.\n* Myers, Robert C. Historical Sketches of Berrien County. 1988\n* Myers, Robert C. Historical Sketches of Berrien County, Vol 2. 1989\n* Myers, Robert C. Historical Sketches of Berrien County, Vol.3. 1994\n* Myers, Robert C. Historical Sketches of Berrien County, Vol. 4. 2001\n* Myers, Robert C. The Great Pere Marquette Train Wreck and Other Historical Sketches from Berrien County. 2004\n* Myers, Robert C. Flight of the Graf Zeppelin and Other Historical Sketches from Berrien County. 2005\n* Myers, Robert C. Historical Sketches of Berrien County. 2009\nGreetings From. . . Series\nThis series of books provided an in-depth look at various communities in Berrien County and include extensive pictorial sections pulled from the BCHA's own photography archive.\n* Goodsell, Leo J. & Myers, Robert C.  Greetings From Berrien Springs. 2003\n* Goodsell, Leo J. & Myers, Robert C. Greetings from Buchanan. 2005\n* Myers, Robert C.  Greeting from St. Joseph. 2009\n* Myers, Robert C.  Greetings from Benton Harbor. 2011\n* Myers, Robert C.  Greetings from Three Oaks. 2014\nAdditional titles\n* Coryell, Janet C. & Myers, Robert C.  Adeline & Julia: Growing Up in Michigan and on the Kansas Frontier. 1999\n* Goodsell, Leo J. & Hawes, Walter C. The Story of Buchanan. 2004\n* Myers, Robert C.  Millennial Visions and Earthly Pursuits: The Israelite House of David. 1999\n* Myers, Robert C.  Lost on the Lakes: Shipwrecks of Berrien County, Michigan. 2003\n* Myers, Robert C.  Locomotives Along the Lakeshore: Railroads of Berrien County. 2010\n* Myers, Robert C.  ''Autotram: Clark Equipment Company's Aluminum Rail Car. 2013\n* Pottle, Beverly Campbell. The Heyday of Hinchman. 2006\n* Schultz, Robert E.  Twin City Trolleys: A History of the Benton Harbor and St. Joseph Streetcar and Interurban Railway Lines''. 2004\nSee also\n* List of historical societies in Michigan\nReferences\nExternal links\n*"
    }
  ]
}