{
  "content": [
    {
      "type": "text",
      "text": "# Bethy Woodward\n\n| birth_place    = Ringwood, England\n| height         =\n| weight         =\n| website        =\n| country        =\n| sport          = Athletics\n| event          = 100m T37200m T37400m T37\n| club           = Southampton AC\n| turnedpro      =\n| coach          = Lee Doran\n| worlds         =\n| regionals      =\n| nationals      =\n| olympics       =\n| paralympics    =\n| highestranking =\n| pb             =\n| show-medals    =\n|medaltemplates =\n}}\n|100m – T35–38}}\n}}\n|updated        =\n}}\nBethany \"Bethy\" Doran (née Woodward, born 26 December 1992) is a British former Paralympic athlete who competed in sprint events in T37 events. She competed at the highest level of her sport, representing England at the 2010 Commonwealth Games and Great Britain in the IPC Athletic World Championships and the 2012 Summer Paralympics.\nWoodward ceased to compete in competitive events in 2015, claiming that more able-bodied athletes were being brought into her classification. In 2017, she handed back one of her silver medals, stating that the inclusion of one of her teammates was \"giving us an unfair advantage\".\nShe was conferred as an Honorary Senior Fellow of Regent's University London on 9 July 2015.\nEarly life\nWoodward was born in Ringwood, England in 1992. Woodward, who has cerebral palsy became interested in athletics after competing in  a school sports day at the age of eleven. After joining an athletics club she entered athletic meets competing in sprint events. She entered the School Games in 2007 and in 2009 she recorded a personal best in the 100m of 15.78s at the German Disability Championships in Sindelfingen. In 2010, she improved on both her 100m and 200m times, recording 15.10 in the 100m at the Tunis Open, while in the 200m she ran 31.31 at the same event. Woodward also began running competitively in the 400m in 2010, posting a time of 1:13.8 at the Perivale Sports Grand Prix. Woodward first represented England in the 2010 Commonwealth Games in Delhi, coming 6th in the T37 100m.\nIn 2011, Woodward was selected for the Great Britain team to compete in the 2011 IPC Athletics World Championships in Christchurch, New Zealand, entering the T37 200m and 400m races. Although she did not win a medal in the 200m, she recorded a personal best of 69.21 in the 400m final taking the gold medal. In 2012, she recorded personal bests in both the 100m and 200m sprints, and qualified for the Great Britain team for the 2012 Summer Paralympics.\nOn 5 September 2012, she won a silver medal in the 200m T37 at the 2012 Summer Paralympics.\n2013\nWoodward won silver in the 200m at the IPC World Championships in Lyon after finishing fourth in the 100m.\n2014\nWoodward switched to long jump to compete for England at the Commonwealth Games and won silver with a new personal best of 4.00m.\nAfter the injury, Woodward withdrew from the 100m at the IPC European Championships, but came back to win bronze in the 400m.\nClassification controversy\nFollowing the conclusion of the Rio 2016 Olympiad, UK Athletics launched an enquiry into the classification of its paralympic athletes. After this investigation was announced, Woodward – who had ceased to compete competitively in 2015 – released a public statement acknowledging that her decision to retire was based on her view that paralympic competition was unfair due to widespread misclassification of athletes. She said \"I represented my country for a long time but if I can't compete like I used to compete, because they've brought in people who are not like me in terms of disability, what's the point?\"  This was part of a wider backdrop of controversy surrounding the classification of paralympic athletes; for example, Helmut Hoffman – the German team doctor at the 2015 International Paralympic Committee Athletics World Championships in Doha – said \"I don't want to say it was corrupt, but it was unfair\".\nWoodward went further in 2017, when she handed back one of her silver medals, stating that the inclusion of one of her teammates was \"giving us an unfair advantage\".\nPersonal life\nWoodward was coached and married to long-term boyfriend and four-time British javelin champion Lee Doran. In 2017, the couple had their first son. She gave birth to their second son in 2021 and their third child, a daughter, was born in 2023.\nReferences"
    }
  ]
}