{
  "content": [
    {
      "type": "text",
      "text": "# Betws, Carmarthenshire (electoral ward)\n\nBetws is an electoral ward, representing part of the community of Betws, near Ammanford, Carmarthenshire, Wales.\nProfile\nIn 2014, the Betws electoral ward had an electorate of xxx. The total population was xxx, of whom xxx were born in Wales. xxxx% of the population were able to speak Welsh.\nCurrent representation\nThe Betws Ward is a single-member ward for the purposes of Carmarthenshire County Council elections. Since 2012 it has been represented by Plaid Cymru councillor Betsan Wyn Jones.\nRecent history\nThe first election to the new unitary Carmarthenshire County Council took place in 1995. Dorian Evans won the seat by a comfortable majority.\nIn 1999, Evans was re-elected.\nEvans faced opposition from Plaid Cymru in 2004 but the majority fell to 30 votes.\nIn 2008, Evans was beaten into third place as the seat was won by an Independent candidate.\nIn 2012, Labour having held the seat from 1995 until 2008, came from third place to recapture Betws with a new candidate\nEarlier History\nCounty Council Elections\nBetws first became an electoral ward for county elections in the early twentieth century, having initially been part of the Llandybie ward at the formation of Carmarthenshire County Council. In due course, it became part of one of the two Ammanford wards for county council elections and these continued to exist until Carmarthenshire was abolished in 1974.\nWith the formation of Dyfed County Council, Betws was part of one of the Ammanford wards. The two wards were merged in 1989.\nWhen the current Carmarthenshire County Council was formed in 1995, a Betws ward, based on the boundaries of the existing ward for the purposes of elections to Dinefwr Borough Council was established.\nDistrict Council Elections\nFrom 1894 until 1973, Betws formed an electoral ward for the purposes of elections to Llandeilo Rural District Council.\nFollowing re-organization in 1973, and until the creation of unitary authorities in 1996, Betws formed an electoral ward for the purposes of elections to Dinefwr Borough Council.\nExternal links\n*\nReferences"
    }
  ]
}