{
  "content": [
    {
      "type": "text",
      "text": "# Beveridge Award\n\nThe Albert J. Beveridge Award is awarded  by the American Historical Association (AHA) for the best English-language book on American history (United States, Canada, or Latin America) from 1492 to the present. It was established on a biennial basis in 1939 in memory of United States Senator Albert J. Beveridge (1862-1927) of Indiana, former secretary and longtime member of the  Association, through a gift from his wife, Catherine Eddy Beveridge and donations from AHA members from his home state. The award has been given annually since 1945.\nRecipients\n*1939 – John T. Horton for  James Kent: A Study in Conservatism\n*1941 – Charles A. Barker for  The Background of the Revolution in Maryland\n*1943 – Harold Whitman Bradley for  American Frontier in Hawaii: The Pioneers, 1780-1843\n*1945 – John Richard Alden for  John Stuart and the Southern Colonial Frontier\n*1946 – Arthur Eugene Bestor, Jr. for  Backwoods Utopias: The Sectarian and Owenite Phases of Communitarian Socialism in America: 1663-1829\n*1947 – Lewis Hanke for  The Spanish Struggle for Justice in the Conquest of America\n*1948 – Donald Fleming for  John William Draper and the Religion of Science\n*1949 – Reynold M. Wik for  Steam Power on the American Farm: A Chapter in Agricultural History, 1850–1920\n*1950 – Glyndon G. Van Deusen for  Horace Greeley: Nineteenth Century Crusader\n*1951 – Robert Twyman for  History of Marshall Field and Co., 1852–1906\n*1952 – Clarence Versteeg for  Robert Morris\n*1953 – George R. Bentley for '' A History of the Freedman's Bureau\n*1954 – Arthur M. Johnson for  The Development of American Petroleum Pipelines: A Study in Enterprise and Public Policy\n*1955 – Ian C.C. Graham for  Colonists from Scotland: Emigration to North America, 1707–1783\n*1956 – Paul W. Schroeder for  The Axis Alliance and Japanese-American Relations, 1941\n*1957 – David M. Pletcher for  Rails, Mines and Progress: Seven American Promoters in Mexico, 1867-1911\n*1958 – Paul Conkin for  Tomorrow a New World: The New Deal Community Program\n*1959 – Arnold M. Paul for  Free Conservative Crisis and the Rule of Law: Attitudes of Bar and Bench, 1887–1895\n*1960 – Clarence C. Clendenen for  The United States and Pancho Villa;: A study in unconventional diplomacy,\n*1960 – Nathan Miller for  The Enterprise of a Free People: Canals and the Canal Fund in the New York Economy, 1792–1838\n*1961 – Calvin Dearmond Davis for  The United States And The First Hague Peace Conference\n*1962 – Walter LaFeber for  The New Empire: An Interpretation of American Expansion, 1860-1898\n*1963 – no award given\n*1964 – Linda Grant DePauw for  The Eleventh Pillar: New York State and the Federal Constitution\n*1965 – Daniel M. Fox for  The Discovery of Abundance\n*1966 – Herman Belz for  Reconstructing the Union: Conflict of Theory and Policy during the Civil War\n*1968 – Michael Paul Rogin for  Intellectuals and McCarthy: The Radical Specter\n*1969 – Sam Bass Warner, Jr. for  The Private City: Philadelphia in Three Periods of Its Growth\n*1970 – Leonard L. Richards for  \"Gentlemen of Property and Standing\": Anti-Abolition Mobs in Jacksonian America\n*1970 – Sheldon Hackney for  Populism to Progressivism in Alabama\n*1971 – Carl N. Degler for  Neither Black Nor White: Slavery and Race Relations in Brazil and the United States\n*1971 – David J. Rothman for  The Discovery of the Asylum: Social Order and Disorder in the New Republic\n*1972 – James T. Lemon for  The Best Poor Man's Country: Early Southeastern Pennsylvania\n*1973 – Richard Slotkin for  Regeneration Through Violence: The Mythology of the American Frontier, 1600-1860\n*1974 – Peter H. Wood for  Black Majority: Negroes in Colonial South Carolina from 1670 Through the Stono Rebellion\n*1975 – David Brion Davis for  The Problem of Slavery in the Age of Revolution, 1770-1823\n*1976 – Edmund S. Morgan for  American Slavery American Freedom: The Ordeal of Colonial Virginia\n*1977 – Henry F. May for  The Enlightenment in America\n*1978 – John Leddy Phelan for  The People and the King: The Comunero Revolution in Colombia, 1781\n*1979 – Calvin Martin for  Keepers of the Game: Indian-Animal Relationships and the Fur Trade\n*1980 – John W. Reps for  Cities of the American West: A History of Frontier Urban Planning\n*1981 – Paul G. E. Clemens for  The Atlantic Economy and Colonial Maryland's Eastern Shore\n*1982 – Walter Rodney for  A History of the Guyanese Working People, 1881-1905\n*1983 – Louis R. Harlan for  Booker T. Washington: Volume 2: The Wizard Of Tuskegee, 1901-1915\n*1984 – Sean Wilentz for  Chants Democratic: New York City and the Rise of the American Working Class, 1788-1850\n*1985 – Nancy M. Farriss for  Maya society under colonial rule: The collective enterprise of survival\n*1986 – Alan S. Knight for  The Mexican Revolution\n*1987 – Mary C. Karasch for  Slave Life in Rio De Janeiro, 1808-1850\n*1988 – Jacquelyn Dowd Hall, James Leloudis, Robert Korstad, Mary Murphy, Christopher B. Daly, Lu Ann Jones for  Like a Family: The Making of a Southern Cotton Mill World\n*1989 – Peter Novick for  That Noble Dream: The 'Objectivity Question' and the American Historical Profession\n*1990 – Jon Butler for  Awash in a Sea of Faith: Christianizing the American People\n*1991 – Richard Price for  Alabi's World\n*1992 – Richard White for  The Middle Ground: Indians, Empires, and Republics in the Great Lakes Region, 1650-1815\n*1993 – James Lockhart for  The Nahuas After the Conquest: A Social and Cultural History of the Indians of Central Mexico, Sixteenth Through Eighteenth Centuries\n*1994 – Karen Ordahl Kupperman for  Providence Island, 1630-1641: The Other Puritan Colony\n*1995 – Ann Douglas for  Terrible Honesty: Mongrel Manhattan in the 1920s\n*1995 – Stephen Innes for  Creating the Commonwealth: The Economic Culture of Puritan New England\n*1996 – Alan Taylor for  William Cooper's Town: Power and Persuasion on the Frontier of the Early American Republic\n*1997 – William B. Taylor for  Magistrates of the Sacred: Priests and Parishioners in Eighteenth-Century Mexico\n*1998 – Philip D. Morgan for  Slave Counterpoint: Black Culture in the Eighteenth-Century Chesapeake and Lowcountry\n*1999 – Friedrich Katz for  The Life and Times of Pancho Villa\n*2000 – Linda Gordon for  The Great Arizona Orphan Abduction\n*2001 – Alexander Keyssar for  The Right to Vote: The Contested History of Democracy in the United States\n*2002 – Mary A. Renda for  Taking Haiti: Military Occupation and the Culture of U.S. Imperialism, 1915-1940\n*2003 – Ira Berlin for  Generations of Captivity: A History of African-American Slaves\n*2004 – Edward L. Ayers for  In the Presence of Mine Enemies: The Civil War in the Heart of America, 1859-1863\n*2005 – Melvin Patrick Ely for  Israel on the Appomattox: A Southern Experiment in Black Freedom from the 1790s Through the Civil War\n*2006 – Louis S. Warren for  Buffalo Bill's America: William Cody and the Wild West Show\n*2007 – Allan M. Brandt for  The Cigarette Century: The Rise, Fall, and Deadly Persistence of the Product That Defined America\n*2008 – Scott Kurashige for  The Shifting Grounds of Race: Black and Japanese Americans in the Making of Multiethnic Los Angeles\n*2009 – Karl Jacoby for  Shadows at Dawn: A Borderlands Massacre and the Violence of History\n*2010 – John Robert McNeill for  Mosquito Empires: Ecology and War in the Greater Caribbean, 1620–1914\n*2011 - Daniel Okrent for Last Call: The Rise and Fall of Prohibition\n*2012 - Rebecca J. Scott and Jean M. Hebrard for Freedom Papers: An Atlantic Odyssey in the Age of Emancipation\n*2013 - W. Jeffrey Bolster for The Mortal Sea: Fishing the Atlantic in the Age of Sail\n*2014 - Kate Brown  for Plutopia: Nuclear Families, Atomic Cities, and the Great Soviet and American Plutonium Disasters\n*2015 - Elizabeth Fenn for Encounters at the Heart of the World: A History of the Mandan People\n*2015 - Greg Grandin for The Empire of Necessity: Slavery, Freedom, and Deception in the New World\n*2016 - Ann Twinam for Purchasing Whiteness: Pardos, Mulattos, and the Quest for Social Mobility in the Spanish Indies\n*2017 - David Chang, The World and All the Things upon It: Native Hawaiian Geographies of Exploration\n*2018 - Camilla Townsend - Annals of Native America: How the Nahuas of Colonial Mexico Kept Their History\n*2019 - Nan C. Enstad - Cigarettes, Inc.: An Intimate History of Corporate Imperialism\n*2020 - Jeremy Zallen - American Lucifers: The Dark History of Artificial Light, 1750–1865\n*2021 - Thavolia Glymph - The Women’s Fight: The Civil War’s Battles for Home, Freedom, and Nation\n*2022 - Roberto Saba - American Mirror: The United States and Brazil in the Age of Emancipation\n*2023 - Kirsten Silva Gruesz - Cotton Mather’s Spanish Lessons: A Study of Language, Race, and Belonging in the Early Americas\n*2024 - Dylan C. Penningroth - Before the Movement: The Hidden History of Black Civil Rights\n*2025 - Seth Rockman - Plantation Goods: A Material History of American Slavery''\nSee also\n* List of history awards\nReferences\nExternal links\n* [http://www.historians.org/prizes/AWARDED/BeveridgeWinner.htm Albert J. Beveridge Award at the American Historical Association]\n* [https://web.archive.org/web/20110713234515/http://www.lovethebook.com/Awards.aspx?bookaward=Albert+J.+Beveridge+Award Albert J. Beveridge Award at lovethebook]"
    }
  ]
}