{
  "content": [
    {
      "type": "text",
      "text": "# Beware of ABKCO!\n\nBeware of ABKCO! is a bootleg album of songs performed by the English rock musician George Harrison in May 1970. It contains songs that were under consideration for Harrison's triple album All Things Must Pass, his first release as a solo artist following the break-up of the Beatles.\nBackground\nThe performances were taped in a single session at EMI (later Abbey Road Studios) in London, on 27 May 1970, for the benefit of Harrison's co-producer, Phil Spector. Seven of the fifteen songs were subsequently recorded formally for inclusion on All Things Must Pass, as was \"Everybody, Nobody\" after Harrison reworked it as \"Ballad of Sir Frankie Crisp (Let It Roll)\".\nFrom its 1994 release by Strawberry Records, the bootleg provided the only available record of five songs that Harrison never revisited during his career. Among these is a 1968 collaboration with Bob Dylan titled \"Nowhere to Go\".\nThe album title derives from Harrison's performance of \"Beware of Darkness\", where he altered a line to mention Allen Klein's management company ABKCO.\nRecording\nHarrison recorded the tape that subsequently became the Beware of ABKCO! bootleg at Abbey Road Studios in London, early on in the sessions for All Things Must Pass. By this time, in May 1970, he had amassed a large stockpile of songs since his level of contribution as a songwriter in the Beatles was always limited by the dominance of John Lennon and Paul McCartney.}} Harrison ran through a selection of his unused songs for the benefit of Phil Spector, his co-producer on All Things Must Pass, with a view to choosing which ones they would work on for the album.\nIn his liner notes to the 2001 reissue of All Things Must Pass, Harrison gives the recording date as 27 May. He also writes that he was not aware that his performances were being taped. When promoting the reissue, Harrison recalled that an engineer happened to set up a microphone and record him.\nThe songs are all solo performances by Harrison, except for bass guitar accompaniment on \"Wah-Wah\". He plays acoustic guitar on the majority of the tracks, changing to electric guitar for three songs: \"Wah-Wah\", \"Hear Me Lord\" and \"Nowhere to Go\".}} The performances heighten the folk aspect of Harrison's songwriting and contrast with the large-scale arrangements and Wall of Sound production employed on much of the official album. Harrison gives a brief spoken introduction before several of the songs, during which he occasionally acknowledges when the lyrics are still incomplete.\nMusical content\nSongs officially released by Harrison\nSeven of the fifteen tracks were subsequently recorded for All Things Must Pass. In addition, soon after performing it on 27 May, Harrison incorporated \"Everybody, Nobody\" into a new song, \"Ballad of Sir Frankie Crisp (Let It Roll)\", which he also included on the official release. Two of the remaining tracks were songs that Harrison returned to later in his solo career. \"Beautiful Girl\" appeared on the 1976 album Thirty Three & 1/3, and the Bob Dylan-written \"I Don't Want to Do It\" became Harrison's contribution to the soundtrack for ''Porky's Revenge! in 1985. In the case of the latter song, this was despite Harrison telling Spector on the tape that he intended to record the track at the session the following day.\nSongs exclusive to the album\n\"Window, Window\"\nOne of several Harrison compositions presented to the Beatles in January 1969, during the sessions that produced their Let It Be album and film, but rejected by the group. Harrison debuted the song at Apple Studio on 21 January, his first day of work since walking out on the band eleven days before. The group briefly rehearsed it on 26 January, until McCartney took over the singing and ensured it was no longer taken seriously. The song is in the folk style and is introduced by Harrison in his May 1970 performance as being \"a bit silly\". In his commentary on Beware of ABKCO!'', music critic Richie Unterberger describes \"Window, Window\" as a \"lilting, troubadourish ballad\".\n\"Nowhere to Go\"\nA second Harrison–Dylan collaboration from November 1968, after \"I'd Have You Anytime\", which Harrison chose as the opening track of All Things Must Pass. \"Nowhere to Go\" was originally known as \"When Everybody Comes to Town\". Harrison recorded a demo of the song at Dylan's house in Greenwich Village in late April 1970. In the lyrics, Harrison comments on his drug bust, in March 1969, and life as a Beatle.\n\"Cosmic Empire\"\nTheologian Dale Allison describes \"Cosmic Empire\" as a \"happy song\" that \"obviously expresses a religious worldview and sets forth a religious goal\" although the lyrics are \"cryptic\". Unterberger describes it as \"buoyant, jaunty\" and says that it demonstrates Harrison's sense of humour. At the start of the performance, Harrison announces that he envisions the song \"full of chorus voices\".\n\"Mother Divine\"\nOlivia Harrison says she came across the lyrics to \"Mother Divine\" when compiling the 2017 revised edition of her late husband's autobiography, I, Me, Mine, and that they suggest Harrison wrote the song while in India in the late 1960s. The song has a medium tempo and its meaning invites interpretation as being about a woman as well as a deity – a style of songwriting that Harrison introduced in 1968 with \"Long, Long, Long\" and would return to frequently as a solo artist.}} It consists of frequent repetition of the chorus; in the first of its two verses, Harrison sings: \"Haloed in splendour / Her face, tenderly smiling too / Was beauty itself / And I know that she loves me.\" Olivia has also said of the song: \"It's a lovely sentiment, and something he did sing over the years, maybe as a mantra.\"\n\"Tell Me What Has Happened to You\"\nIn Unterberger's description, the song contains an \"ominous ascending riff\" and sections set in a more standard folk style.\nOfficial releases\n\"Beware of Darkness\" and \"Let It Down\" were included as bonus tracks on the 2001 reissue of All Things Must Pass (with lead guitar and keyboard overdubs added to \"Let It Down\");\n\"Run of the Mill\" appeared on the 2012 outtakes and demos compilation Early Takes: Volume 1.\nAll fifteen songs were officially released in August 2021, as part of the Uber and Super deluxe editions of the All Things Must Pass: 50th Anniversary box set.\nTrack listing\nAll songs written by George Harrison except where noted otherwise.\n#\"Run of the Mill\"\n#\"Art of Dying\"\n#\"Everybody, Nobody\"\n#\"Wah-Wah\"\n#\"Window, Window\"\n#\"Beautiful Girl\"\n#\"Beware of Darkness\"\n#\"Let It Down\"\n#\"Tell Me What Has Happened to You\"\n#\"Hear Me Lord\"\n#\"Nowhere to Go\" (Harrison, Bob Dylan)\n#\"Cosmic Empire\"\n#\"Mother Divine\"\n#\"I Don't Want to Do It\" (Dylan)\n#\"If Not for You\" (Dylan)\nPersonnel\nAccording to authors Chip Madinger and Mark Easter:\n*George Harrison – vocals, acoustic guitar (tracks 1–3, 5–9, 12–15), electric guitar (4, 10–11), dialogue\n*unnamed session musician – bass guitar (4)\nNotes\nReferences\nSources\n*\n*\n*  }}\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*"
    }
  ]
}