{
  "content": [
    {
      "type": "text",
      "text": "# Beware of Young Girls\n\n| production     = 1AYD07\n| airdate        =\n| length         = 44 minutes\n| guests         = * Ariana Grande as Chanel #2 / Sonya Herfmann\n* Breezy Eslin as Jennifer \"Candle Vlogger\"\n* Tavi Gevinson as Feather McCarthy\n* Philip Casnoff as Steven Munsch\n* Jim Clock as Detective Chisolm\n* Elise Fyke as Nurse Fine\n* Judy Durning as Painter\n| prev           = Seven Minutes in Hell\n| next           = Mommie Dearest\n| episode_list   =\n}}\n\"Beware of Young Girls\" is the seventh episode of the horror black comedy series Scream Queens. It premiered on November 3, 2015 on Fox, after a week hiatus due to the 2015 World Series. The episode was directed by Barbara Brown and written by Ryan Murphy. The episode centers around the Chanels' effort to contact the deceased Chanel #2 (Ariana Grande) using a Ouija board to dig information about the killer, and Dean Munsch (Jamie Lee Curtis) dealing with facing her ex-husband (Philip Casnoff) and his young mistress (Tavi Gevinson).\nThis episode was watched live by 2.44 million viewers and received negative reviews from critics.\nPlot\nIn the Kappa House, Chanel #3, Chanel #5, and Hester/Chanel #6 convince Chanel to use a Ouija board to contact Chanel #2 . Via the board, Chanel #2 claims that Chanel is the Red Devil killer and Hester convinces the others to kill Chanel. At night, Chanel #2's ghost visits Chanel and warns that her minions are plotting against her. Chanel convinces them that Grace and Zayday are the Red Devil.\nMeanwhile, Gigi advises Grace and Pete to investigate Feather McCarthy, a former Wallace University student who had a feud with Dean Cathy Munsch. Feather reveals that she had an affair with the Dean's ex-husband, professor Steven Munsch. After the divorce finalized, Steven and Feather moved in together, which enraged Dean Munsch. She attempted to murder Feather by pushing a transistor radio into the bathtub while Feather was bathing.\nWhen they visit Dean Munsch at the asylum, she insists Feather is Steven's true murderer. The girls find evidence that points to Feather as Steven's murderer and she is arrested.\nAn ending sequence reveals that Cathy had in fact killed her ex-husband and framed Feather.\nProduction\nAriana Grande returns as a special guest star, portraying Sonya Herfmann / Chanel #2, the deceased member of the Chanels and Kappa Kappa Tau. Many fans and viewers express disappointment regarding her death in the Series Premiere, and in response, Ryan Murphy tweeted about her return in later episodes. On August 4, 2015, it was announced that Tavi Gevinson would be joining the cast as Feather, the mistress of Jamie Lee Curtis's character's ex-husband. Philip Casnoff was cast as Cathy's ex-husband on August 9, 2015. Returning recurring characters in this episode are Breezy Eslin as Jennifer \"Candle Vlogger\", Jim Clock as Detective Chisolm, Elise Fyke as Nurse Fine,\nand Judy Durning as a Painter in the asylum.\nThe episode features the song \"Beware of Young Girls\", by Dory Previn.\nReception\nRatings\n\"Beware of Young Girls\" was watched live by 2.44 million U.S. viewers and got a 1.0 rating/3 share in the adult 18–49 demographic.\nCritical reception\n\"Beware of Young Girls\" received mostly mixed to negative reviews from critics. Patrick Sproull from Den of Geek stated, \"overall, the performances remain superlative and the underlying postmodern fun remains infectious - but the script, while not messy per se, was focussed on areas that don't need to be touched on.\" The A.V. club LaToya Ferguson gave the episode a D, citing \"What's worst about \"Beware Of Young Girls\" is that it's neither aggressively bad nor aggressively good enough to make it even a middle of the road episode. Instead, it's merely a nothing episode.\" Terri Schwartz from IGN gave the episode 7.4 out of 10. She said that \"\"Beware of Young Girls\" felt too much like a filler episode that was trying to buy more time until Scream Queens needs to resolve the whodunnit mystery.\"\nReferences"
    }
  ]
}