{
  "content": [
    {
      "type": "text",
      "text": "# Bhilwara district__disambig_1\n\n| image_caption            = Clockwise from top-left: Bijolia Parshvanath temple, Shahpura Palace, Jahazpur Fort, Lake near Bhilwara, Amargarh Fort\n| image_map                = Bhilwara in Rajasthan (India).svg\n| map_caption              = Location of Bhilwara district in Rajasthan\n| coordinates              =\n| coor_pinpoint            =\n| subdivision_type         = Country\n| subdivision_name         =\n| subdivision_type1        = State\n| subdivision_name1        = Rajasthan\n| subdivision_type2        = Division\n| subdivision_name2        = Ajmer\n| established_title        = Established\n| established_date         =\n| seat_type                = Headquarters\n| seat                     = Bhilwara\n| parts_type               = Tehsils\n| parts_style              = para\n| p1                       =\n| area_total_km2           = 10,455\n| area_footnotes           =\n| population_as_of         = 2011\n| population_total         = 2,408,523\n| population_footnotes     =\n| population_urban         =\n| population_density_km2   = auto\n| demographics_type1       =\n| demographics1_title1     = Literacy\n| demographics1_info1      =\n| demographics1_title2     = Sex ratio\n| demographics1_info2      =\n| leader_title             = Administration\n| leader_name              =\n| leader_title1            = District Collector\n| leader_name1             = Ashish Modi\n| leader_title2            = Superintendent of Police\n| leader_name2             = Adarsh Sidhu\n| timezone1                = IST\n| utc_offset1              = +05:30\n| registration_plate       =\n| website                  =\n| official_name            =\n| Government               =\n}}\nBhilwara district is a district of the state of Rajasthan in western India. The city of Bhilwara is the district headquarters.\nHistory\nStone Age tools dating from 5,000 to 200,000 years were found in Bundi and Bhilwara districts of the state.\nGeography\nThe district has an area of 10,455&nbsp;km², and a population of 2,408,523 (2011 census), which increased 19.60% from 2001 to 2011. Famous for its textile & minerals Industries. It is bounded on the north by Ajmer District, on the east by Bundi District, on the south by Chittorgarh District and on the west by Rajsamand District. State Highway (Jaipur-Udaipur) passes through the district, as does a broad gauge railway line measuring 84&nbsp;km and connecting Ajmer with Khandwa in Madhya Pradesh. The nearest airport is at Udaipur (171&nbsp;km).\nAdministration\nThere are 7 sub-divisions in the district: Bhilwara, Shahpura, Gangapur, Gulabpura, Asind, Mandalgarh and Jahazpur. Under these sub-divisions there are 12 Tehsils as per Census of India 2011 report and these 12 Tehsils are Panachayat Samitis: Bhilwara, Banera, Mandal, Mandalgarh, Beejoliya, Kotri, Hurda, Shahpura, Jahazpur, Sahada, Asind and Raipur. There are four Sub Tehsils under the Tehsils mentioned in () also named Bagor (Mandal), Badnor (Asind), Hamirgarh and Puliakalan (Shahpura). Similarly there are 1783 villages as per census of 2001.\nDemographics\n|titlebar=#Fcd116\n|left1=Religion\n|right1=Percent\n|float=left\n|bars=\n|caption=Distribution of religions\n}}\nAccording to the 2011 census Bhilwara district has a population of 2,408,523, roughly equal to the nation of Kuwait or the US state of New Mexico. This gives it a ranking of 184th in India (out of a total of 640). The district has a population density of  . Its population growth rate over the decade 2001-2011 was 19.7%. Bhilwara has a sex ratio of 969 females for every 1000 males, and a literacy rate of 62.71%. 21.28% of the population lives in urban areas. Scheduled Castes and Scheduled Tribes make up 16.94% and 9.52% of the population respectively. This district, rather pretentiously, is boastfully called Textile City or Manchester of Rajasthan.\nAt the time of the 2011 census, 53.08% of the population spoke Rajasthani, 27.50% Mewari, 15.00% Hindi and 1.82% Marwari as their first language.\nSee also\n*Ojhiyana archaeological site\nReferences\nExternal links\n*\n* [https://web.archive.org/web/20091008160221/http://www.rajasthan.gov.in/rajgovt/Districtprofile/bhilwara.html Bhilwara district Profile]"
    }
  ]
}