{
  "content": [
    {
      "type": "text",
      "text": "# Bhoomi (software)__disambig_1\n\n| commercial = No\n| type = Government Site\n| registration = none\n| language = English and Kannada\n| content_license = Free Documentation License\n| owner = Revenue department, Government of Karnataka\n| author = National Informatics Centre, Karnataka\n| launch_date =\n| revenue =\n| current_status = Online\n| footnotes =\n}}\nBhoomi is a project jointly funded by the Government of India and the Government of Karnataka to digitize the paper land records and create a software mechanism to control changes to the land registry in Karnataka.  The project was designed to eliminate the long-standing problem of inefficiency and corruption in the maintenance of land records at dispersed and poorly supervised and audited block-level offices known as \"taluka\" offices in South India and \"tehsildar\" offices in North India. The project development and implementation was done by National Informatics Centre.\nMany experiments with computerization have failed due to corruption and other factors.\n}}\nBackground\nThe idea to computerize land records was first mooted by Chief Minister of Karnataka S. M. Krishna in 1999. In his 2000–01 budget speech, he stated: \"I am making a solemn commitment in this House that by March 31, 2001, RTCs in computerised format will be made available to every single farmer in the State.\" In his next budget speech, he said that RTCs were \"available at kiosks in 40 taluks across the State. In a few months the remaining 125 taluks will be able to get RTCs.\" It was reported in 2004 that the Bhoomi project included demographic and economic data and legal rights, and that it also had 47 information fields on owner, tenant, crops, yield, irrigation sources, mortgage details, nature of soil and bank loans.\nSee also\n* HALRIS\n* Girdawari\n* Project Nemmadi\nReferences\nExternal links\n* [http://ia.rediff.com/money/2007/apr/10spec1.htm Rediff Article (10/4/2007) on Rajeev Chawla and Bhoomi]"
    }
  ]
}