{
  "content": [
    {
      "type": "text",
      "text": "# Bibliography of works on Stephen King\n\nThere have been many books published about Stephen King and his works.\n* 1981: Edward J. Zagorski: ''Teacher's Manual: Novels of Stephen King\n* 1984: Douglas E. Winter: Stephen King: The Art of Darkness: The Life and Fiction of the Master of the Macabre\n* 1986: Tim Underwood and Chuck Miller: Kingdom of Fear: The World of Stephen King\n* 1988: Don Herron: Reign of Fear: The Fiction and Film of Stephen King (1982-1989)\n* 1988: Tim Underwood and Chuck Miller: Bare Bones: Conversations on Terror with Stephen King (1988)\n* 1989: Tim Underwood and Chuck Miller: Feast of Fear: Conversations with Stephen King (1989)\n* 1989: George Beahm: The Stephen King Companion\n* 1989: Tyson Blue: The Unseen King\n* 1990: Stephen Spignesi: The Stephen King Quiz Book\n* 1991: Stephen Spignesi: The Complete Stephen King Encyclopedia (includes art by Steve Fiorilla, Jim McDermott and others)\n* 1992: Tony Magistrale (Ed.): The Dark Descent: Essays Defining Stephen King's Horrorscape\n* 1992: Stephen Spignesi: The Second Stephen King Quiz Book\n* 1998: Harold Bloom (Ed.):  Stephen King (part of series Modern Critical Views)\n* 1998: Stephen Spignesi: The Lost Work of Stephen King\n* 2001: Stanley Wiater, Christopher Golden, Hank Wagner: The Stephen King Universe; A Guide to the Worlds of Stephen King\n* 2001: Stephen Spignesi: The Essential Stephen King\n* 2003: Rocky Wood, David Rawsthorne, Norma Blackburn: The Complete Guide to the Works of Stephen King First and Second Editions 2004: Third Edition [http://www.horrorking.com/order/index.html The Complete Guide To The Works Of Stephen King]\n* 2004: Bev Vincent: The Road to the Dark Tower[http://www.cemeterydance.com/sh/vincent01.html The Road to the Dark Tower: Cemetery Dance Publications]\n* 2006: Rocky Wood, with David Rawsthorne and Norma Blackburn: Stephen King: Uncollected, Unpublished[http://www.kanrockpublishing.com/ advertising agency business advice news at kanrockpublishing.com]\n* 2007: Rocky Wood and Justin Brooks: The Stephen King Collector's Guide''[http://www.horrorking.com/collector/ The Stephen King Collector's Guide]\n* 2008: Justin Brooks: Stephen King: A Primary Bibliography of the World’s Most Popular Author[http://www.cemeterydance.com/sh/brooks01.html Stephen King: A Primary Bibliography of the World's Most Popular Author: Cemetery Dance Publications]\n* 2008: Rocky Wood and Justin Brooks: Stephen King: The Non-Fiction[http://www.cemeterydance.com/sh/wood02.html Stephen King: The Non-Fiction: Cemetery Dance Publications]\n* 2009: Bev Vincent: The Stephen King Illustrated Companion: The Life and Works of the Master of Horror\n* 2011: Andrew J. Rausch and Ronald Riley: The Stephen King Movie Quiz Book\n* 2011: Andrew J. Rausch: The Wit and Wisdom of Stephen King\n* 2011: Rocky Wood and Justin Brooks: Stephen King: A Literary Companion\n* 2011: John Sears: \"Stephen King's Gothic\"\n* 2025: Yernar Shambayev: \"Stephen King Behind the Iron Curtain\" (The Story of Stephen King's Books in the USSR and Russia, 1981–2025)\nMaterial about King can also be found in his own partly autobiographical On Writing: A Memoir of the Craft (2000), as well as scattered throughout King's Danse Macabre (1981).\nA critical analysis of King's work can be found in S. T. Joshi's The Modern Weird Tale (2001).\nNotes"
    }
  ]
}