{
  "content": [
    {
      "type": "text",
      "text": "# Bideford Railway Heritage Centre\n\n|originalrack   =\n|originalelec   =\n|preservedgauge =\n|preservedrack  =\n|preservedelec  =\n|era            =\n|owned          =\n|operator       =\n|stations       = 1\n|length         =\n|originalopen   = 2 November 1855\n|closed         = 6 November 1982\n|stageyears     = 1988\n|stage          = Society formed\n|years          =\n|events         =\n|years1         =\n|headquarters   = Bideford, Devon\n|website        =\n}}\nThe Bideford Railway Heritage Centre CIC (previously the Bideford and Instow Railway Group) in Devon, England is a community interest company that is responsible for the management of the site of Bideford railway station.\nThe company is also responsible for Instow signal box which opens on occasional Sundays and bank holidays from Easter to October.\nHistory\nThe line was opened from Barnstaple to Fremington in 1848. Passenger trains ran throughout from Barnstaple railway station to Bideford from 2 November 1855 as the Bideford Extension Railway. The line was further extended to Torrington in 1872 when the current Bideford railway station was opened.\nPassenger services ceased on 2 October 1965 although ball clay traffic continued until 1982. The track was removed in 1985 after some interest by British Rail in reintroducing a passenger service to Bideford. The trackbed was later converted into the Tarka Trail, a walkway using the formation between Petrockstow (later the terminus of services after the line was truncated in the 1960s) and Barnstaple Junction.\nIn 2009, James May attempted to reconnect the former Bideford station with Barnstaple Junction using an OO scale model train as part of ''James May's Toy Stories''. Unfortunately, the last train - a Hornby Class 395 \"Javelin\", and the prototype model for the production models - burnt out at Instow at 12:18am the day after the trains left Barnstaple.\nIn 2011, May returned to complete the challenge with the help of the German model railway attraction Miniatur Wonderland, racing several model trains over the  from Barnstaple to Bideford. The first train to arrive at Bideford was a Hornby Intercity 125, followed by a hydrogen-powered train and finally, May's own model of LNER 'Pacific' 4472 Flying Scotsman.\nVisitor attractions\nThe Bideford Railway Heritage Centre has developed the site since 1989 to ensure a preservation presence at the old Bideford station. A replica of the original signal box was built in 1992 and signal levers were installed later.  An interactive interpretation centre was opened in the green PMV (Parcels and Miscellaneous Van) in 2019. Short passenger rides are given at Bideford on dates announced on the website www.bidefordrailway.co.uk, using the Planet diesel locomotive. The site has been fully renovated and is open from Easter to the end of October at weekends and school holidays. A cafe in the Mark 1 coach at these times for walkers and cyclists on the Tarka Trail. The site is accessible from the Tarka Trail even when the station site is not open.\nRolling stock\nThe Railway has the following items of rolling stock.\n*Hibberd Planet diesel locomotive No.3832, operational.\n*BR Mk1 TSO 4489, Used as a cafe and is painted in BR Green.\n*SR PMV 2142, Holds the Interactive Interpretation Centre.\n*BR Toadfit brake van B954757,Under overhaul.\nSee also\n*Other local railway attractions:\n**Lynton and Barnstaple Railway\n**Lynton and Lynmouth Cliff Railway\n**Dartmoor Railway\nReferences\nExternal links\n*\n*[https://web.archive.org/web/20080513043544/http://www.devon.gov.uk/index/learning/learning_resources/museums_heritage/guide_to_devon_museums-3/museums_torridge/mus_bideford.htm Bideford Railway Museum] – Information from Devon County Council\n* [http://www.information-britain.co.uk/showPlace.cfm?Place_ID=11605 Entry at Information Britain]\n* [https://www.youtube.com/watch?v=IOBdAS4mpow Video footage of the museum]"
    }
  ]
}