{
  "content": [
    {
      "type": "text",
      "text": "# Big Brother Awards (Australia)\n\nOverview\nSince 1998, over 50 Big Brother Awards ceremonies have been held in 16 countries. They are presented around the world by the national members and affiliated organisations of Privacy International to corporations, public officials and governments that have shown a blatant disregard for privacy, or who have done the most to threaten personal privacy in their countries.\nThe Australian Big Brother Awards (the \"Orwells\"), hosted by the Australian Privacy Foundation, were established in 2003. The awards also feature categories for individuals and organisations who have made a major positive contribution to protecting the privacy of Australians.\nNomination Process\nNominations for the awards are solicited from the public either by mail or email to the APF (Australian Privacy Foundation). Nominations are then forwarded to a panel of judges who identify winners in each category. The judges have absolute discretion, and are not confined to the nominations received by members of the public. The winners are announced at a ceremony.\nThe Award Categories\n'''The Big Brother Awards for privacy invaders ('The Orwells')\n#Lifetime Menace' – for a privacy invader with a long record of profound disregard for privacy.\n#Greatest Corporate Invader – for a corporation that has shown a blatant disregard of privacy.\n#Worst Public Agency or Official – for a government agency or official that has shown a blatant disregard of privacy.\n#Most Invasive Technology – for a technology that is particularly privacy invasive.\n#Boot in the Mouth – for the ‘best’ (most appalling!) quote on a privacy-related topic.\n#People’s Choice – this is decided by popular vote, and given to the individual or organisation most frequently nominated by the public.\nThe ‘Smith’ Awards for privacy defenders\n#Best Privacy Guardian – for a meritorious act of privacy protection or defence.\n#Lifetime Achievement – for provision of outstanding services to privacy protection.''\nSee also\n* [http://www.bigbrotherawards.org Big Brother Awards Main Website]\n* Big Brother Awards in Wikipedia\n* [http://www.privacy.org.au Australian Privacy Foundation Webpage]\nSources"
    }
  ]
}