{
  "content": [
    {
      "type": "text",
      "text": "# Bileshwar\n\nBhilleshwar is a village in Ranavav Taluka of Porbandar district in Gujarat, India.\nGeography\nBhilleshwar is located near to the village of Ashiyapat, and east of the Barda hill on the banks of the Bhilleshvari river.\nThe river called Bhil Ganga rises in the Barda hills, and flows past this village and joins the Minsar river near Khirsara.\nDemographics\nThe population of Bileshwar by the census of 1872 was 172, but it was increased to 211 souls in 1881. According to the 2011 Census of India, the population had grown to 1,748 by 2011, divided over 364 households living on 522 hectares of land.\nPlaces of interest\nBileshwar Mahadev temple\nBileshwar Mahadev temple is a fine temple sacred to Shiva, of some antiquity, and in excellent preservation. The Rabaris of the neighbouring states and villages have much faith in this Mahadev and many vows are made to the shrine, several lamps of ghee are constantly burning here; one of these was kept up at the cost of the Rana of Porbandar.\n;History\nPorbandar State had endowed this shrine with some land, and Navanagar State had granted it the village of Sajdiali in dharmada or religious tenure. The Rabaris and Charans of the neighbouring districts used give one day's churning of butter to the shrine yearly, and the Bava of the temple goes to collect it even as far as Okhamandal.\n;Legends\nIt is said that a Muslim army once captured the village and attempted to break the ling, but the ling burst of itself and hundreds of wasps issued therefrom and put the army to flight after killing many of them.\nThe origin of the Bileshwar Mahadev is attributed to Krishna. It seems that Satyabhama, one of Krishna's wives, asked him to procure for her the parijatak tree  which only grows in Indra's garden. Krishna sent Narad muni to bring the tree from Indra, but he refused to part with it and challenged Krishna to fight with him. Krishna went to the garden where the tree was growing and took it. Fighting now ensued in heaven between Indra and Krishna, but when the sun set both the combatants rested on the Pariyatra mountain which is now called Barda hill. In the morning Krishna offered prayers to Ganga and the goddess issued out of a cave and was named by Krishna Bil-Ganga. Krishna now adored Shiva who instantly appeared and was much pleased with Krishna's worship and promised to fulfil his desires. Krishna then installed him at that spot and named him Bilvadakeshvar which has since been corrupted to Bileshwar. Others say that Krishna adored Shiv here with great devotion for seven months, and as he used to strew bili leaves on the symbol he called it Bileshwar.\n;Fairs\nThree fairs are annually held here, one on the last day of the dark half of Shraavana in August, another on the fourteenth day of the dark half of the month of Maha (the Shivaratri), and a third on the eighth of the dark half of Shravan, when hundreds of people assemble here to worship the Mahadev.\nReferences"
    }
  ]
}