{
  "content": [
    {
      "type": "text",
      "text": "# Bille kingdom\n\n| seat               = Bille Town\n| government_type    = Traditional Monarchy\n| governing_body     = Council of Chiefs\n| leader_title       = Amanyanabo or Siyedabo\n| leader_name        = HRM Hon. King Igbikingeri Ngowari Cornelius Herbert (AgbaniyeJike XVIII)\n| population_est     = 77000\n| pop_est_as_of      = 2016\n| timezone1          = West African Time (WAT)\n| postal_code_type   = Zip Code\n| postal_code        = 504102\n}}\nThe Bille Kingdom, located in Rivers State, Nigeria, is an Ijaw clan positioned west of Bonny Island and south of Port Harcourt. Located in Degema local government area of Rivers State, it comprises 30 settlements, including Bille Town, which serves as the kingdom's headquarters and is home to approximately 41,000 residents out of a total population of about 77,000.\nThe Bille people are a distinct ijaw group within the Eastern Niger Delta region and are one of the Eastern Ijaw clans, alongside Kalabari, Bonny, Andoni (Obolo), Opobo, Nembe, and Okrika.\nThe current traditional ruler of the Bille Kingdom is His Royal Majesty, Hon. King Igbikingeri Ngowari Cornelius Herbert (AgbaniyeJike XVIII), the Amayanabo of Bille. He was crowned on Saturday, April 4, 2021, following a 12-year interregnum after the passing of His Royal Majesty, King Justus H. Igolima-Dappa (AgbaniyeJike XVII).\nHistorical records indicate that the Bille people migrated from Akpata-Bille to their current location in the 9th century. Bille Town, the administrative center of the kingdom, is traditionally believed to have been founded by Queen Ikpakiaba during this period.\nBille is recognized for its rich cultural heritage, which is deeply rooted in the traditions of the Ijaw people. The community emphasizes principles of democracy and equal rights, which contribute to its inclusive social structure.\nBefore the emergence of the oil industry, Bille’s economy was primarily based on fishing and trade. Community development was largely driven by self-help initiatives, with residents pooling resources to build infrastructure such as schools, a health center, and a town hall. Land reclamation projects were also undertaken through collective efforts. However, with the rise of the oil economy, these self-reliant practices declined as reliance on oil companies increased, shifting the economic focus away from traditional activities.\nHistory\nOral tradition holds that the Bille's southward migration was sparked by a dispute over a prized fish—tilapia—which led to a split within their community. The migration journey of the Bille began with their settlement near the Tarakiri clan in Central Ijaw. From there, they moved to Okolo Bille, in present-day Abua, north of Degema, before ultimately settling in their current homeland, Bille Town, along the southern coast of Nigeria.\nEarly Encounters and Spiritual Connections\nA defining element of the Bille's early history was their encounters with water spirits, locally known as owama be apu. These spirits played a significant role in shaping both the spiritual and cultural identity of the Bille people. According to tradition, these ethereal beings manifested as mermaids performing masquerades, and their presence was integral to the community's understanding of their environment and existence. As the Bille settlers made their way southward, they negotiated with these spirits, who initially seemed to threaten their settlement. However, through sacrifices and spiritual rituals led by Queen Ikpakiaba, the spirits ceased their appearances, allowing the settlers to remain and eventually thrive in their new homeland.\nThe Rise of the Bille Kingdom\nBy the 15th century, the Bille clan had established a powerful kingdom. This was a time when the Bille's influence began to grow across the region. King Agbaniye Jike, Amanayabo of Bille became prominent in the 17th century, expanding the kingdom through military campaigns against neighboring communities. Under his rule, Bille solidified its dominance in the region, ensuring its place as a key player in the complex trade networks of the time.\nLike other ijaw clans, bille participated in the slave trade. By 1520, Bille's involvement in the transatlantic slave trade had been documented in early European records, signaling the kingdom’s growing importance in international trade.\nMigration and the Establishment of New Settlements\nAs the Bille people migrated southward, various branches of the community settled in different regions, establishing several towns that claim Bille origins. Notably, Kula was founded by Opu Ada ye Sira, a member of the Sira community in Bille, while Agbaniye Kio, a brother of King Jike, established Idama after a dispute. Over time, some of these towns sought alliances with other kingdoms, such as the Kalabari, particularly during the colonial era.\nDuring their migration, the Bille also saw the emergence of settlements founded by offshoots of their community. Opu Ogulaya and Opu Suma are credited with founding Ogoloma, which later became anglicized as part of Okrika. Opu Okurukuru founded Kugbo, Opu Ikiya established Ikiakiama, and Opu Ogini settled in Oginiama. Meanwhile, Opu Krobo moved to what is now Nkoro, in Andoni Local Government Area. Interestingly, the people of Nkoro continue to uphold a taboo on tilapia, a cultural memory from the original conflict over the fish that led to the Bille migration.\nQueen Ikpakiaba: The Spiritual Matriarch\nAccording to oral history, the role of Queen Ikpakiaba, known as the Amabinbo of Bille, is pivotal in the history of the Bille people. As a legendary leader, she guided her people on a significant southward migration from Okolo Bille. Her leadership during the journey is described in oral traditions as being crucial to the survival and success of the Bille settlers. According to these legends, the Bille people passed through barren lands such as Ogonobe Ingbetokuru (modern-day Obuama) and Sukube Ingbetokuru (now the site of the Degema consulate), before reaching the land they would settle in—Bille Town.\nThe area was initially an island divided by a small channel, which was later closed, although traces of it still remain today. Upon their arrival, the settlers encountered the water spirits owama be apu, marking the beginning of their spiritual connection to the land. Queen Ikpakiaba is credited with performing the necessary sacrifices to ensure that the Bille people could settle permanently in the region, laying the foundations for the kingdom that would grow and thrive.\nOverview of Bille kingdom\nThe Bille Kingdom consists of numerous settlements that, together with Bille Town, form the heart of this historic region. These settlements are scattered across areas traditionally controlled by the Bille people during pre-colonial times. At the center is Bille Town, the largest settlement and the administrative hub of the ancient Bille kingdom.\nGeography of Bille town\nLocated in the southeastern part of the Degema Local Government Area in Rivers State, Bille Town is a low-lying island in the vast mangrove forests of the Niger Delta. Positioned a few feet above sea level, it lies along the Bille Creek, a tributary of the Sombrero River (locally known as Akuku Toru). Historically, the town was divided by a natural channel into two sections: kala anga and opu anga. However, in the late 1970s, sand-filling efforts expanded the town into the southern areas of Angula and Osia, merging the reclaimed land with the existing settlement and extending into the surrounding mangrove forests.\nAccess routes to Bille town\nTraveling from Degema\nVisitors from Degema can access Bille Town by sailing south along the Sombrero River, entering the Opu Bille Kubu Creek, and navigating through the Kala Bille Kubu Creek. After a few turns, the town comes into view, offering a warm welcome.\nTraveling from Port Harcourt\nTravelers from Port Harcourt typically board speedboats or other vessels at jetties along Creek Road. The journey crosses the New Calabar River within 15 minutes and follows a route through the Awun Toru, Touma Creek, and Oro Kubu before reaching Bille Town. The town's first visible landmark is Iwo-Ama, a newly reclaimed area with schools and playing fields. Boats then pass various waterways—such as Green Poku, Asuka Poku, and Abekereme Poku—before arriving at Sira Poku, where the main jetty is located.\nKey entry points and creeks\nBille Town has five primary entry points, all through creeks: Kala Bille Kubu, Besi Kubu, Oliyama Anga, Oro Kubu, and Oruama Boko. These creeks also provide access to other areas within the kingdom, including fishing ports and smaller settlements. For example, Oliyama Anga connects to southern locations such as Bille 1 Flow Station, Krikama, Gogoboama, Ekema, Ke, Kula, and Abissa.\nCommunities and settlements in Bille kingdom\nThe Bille Kingdom is made up of numerous communities where Bille natives, fishermen, and traders live. These communities are categorized into major settlements and smaller villages, often used for plantations. Some of them include;\nMajor Settlements\n* Touma\n* Oruama\n* Imopeleama\n* Krikama\n* Kariama\n* Opu Bille Boko\n* Oruama Boko\nSmaller Villages\n* Enesirama\n* Kinibapu piri\n* Furuapu\n* Makiridikianga\n* Momuapu ama\n* Egbe Piri\n* Fingiapu\n* Borma\n* Amabiofiema\n* Oboma\n* Maduama\n* Ariapu ama\n* Ninama\n* Kalatirama\n* Ekema\n* Emmanuelama\n* Feni Paan\n* Nonjuama\n* Owu Poky-Obu\n* Ele\n* Ibi-Iriawoama\n* Gogoboama\n* Dappama\n* Ibia-Ama\n* Bebeama\n* Ibidaboama\n* Iwoama\n* Ikpakiaba Ama\nThese communities collectively surround Bille Town, the central settlement and administrative center of the kingdom.\nHistorical territorial boundaries\n1935 Intelligence Report on Bille Clan\nHistorical records provide insights into Bille’s territorial boundaries. In a 1935 intelligence report on the Bille Clan in Degema Division, District Officer Captain Kelsey noted that Bille shared river rights with Bonny, particularly along the New Calabar River, originating from Anya Creek. The report also detailed the locations of Bille fishing ports along key rivers and creeks, such as Tunduro Bokobe Kiri, Green Kiri, Wosaba, and Touma. Additionally, the report identified rivers controlled by Bille, including stretches of the Sombrero River and others extending to Anya Creek.\n1949/50 Commission of Inquiry Findings\nThe Bille territory's boundaries were further confirmed in the 1949/50 Commission of Inquiry into the Okrika-Kalabari dispute, led by Justice G.G. Robinson. The commission upheld the independence of Bille, stating that its lands were distinct from the Kalabari territories. This was echoed in a memorandum submitted by Chief (Dr.) Harold J. Dappa-Biriye in 1997, which reinforced the boundary between Bille and Kalabari as the middle of the New Calabar River.\nReferences"
    }
  ]
}