{
  "content": [
    {
      "type": "text",
      "text": "# Bill King\n\n|birth_place= Bloomington, Illinois, U.S.\n|death_date=\n|death_place= San Leandro, California, U.S.\n|team=San Francisco Giants (1958–1962)San Francisco/Golden State Warriors (1962–1983)Oakland/Los Angeles Raiders (1966–1992)Oakland Athletics (1981–2005)\n|genre=Play-by-play\n|sport=Major League BaseballNational Basketball AssociationNational Football League\n}}\nWilbur \"Bill\" King (October 6, 1927 – October 18, 2005) was an American sports announcer. In 2016, the National Baseball Hall of Fame named King recipient of the 2017 Ford C. Frick Award, the highest honor for American baseball broadcasters.\nKing was the radio voice of the Oakland Athletics for more than 20 seasons as well as the longtime radio play-by-play announcer for the Oakland/Los Angeles Raiders and the San Francisco/Golden State Warriors. Earlier in his career, he had been a member of the San Francisco Giants original broadcasting team (together with Russ Hodges and Lon Simmons) when the Giants moved west from New York in 1958, and had called football and basketball games for the University of California.\nKing was widely recognized by his distinctive handlebar moustache and Van Dyke beard, as well as his broadcasting catchphrase, \"Holy Toledo!\".\nEarly broadcasting career\nKing was born in Bloomington, Illinois, and was stationed on the island of Guam at the end of World War II when he began his broadcasting career with the Armed Forces Radio Network, converting play-by-play accounts of games as they came in over the wire and broadcasting them in a manner that made it sound as if he were actually at the game. After the war, he began his professional sportscasting career in Pekin, Illinois, broadcasting high school football and basketball games as well as Minor League Baseball games. In the early 1950s, King served as the lead play-by-play announcer on WTAD 930 AM in Quincy, Illinois. He later announced basketball games for Bradley University and basketball and football games for the University of Nebraska. King moved to the Bay Area in , when the San Francisco Giants hired him as an announcer.\nOakland sports\nVoice of the Warriors\nA major turning point in King's career came in 1962, when the Philadelphia Warriors of the National Basketball Association moved to San Francisco and hired him as their play-by-play announcer. King announced Warrior games from 1962 to 1983, through the Wilt Chamberlain, Nate Thurmond, and Rick Barry eras and the team's first NBA Championship on the West Coast, in 1974–1975.\nFranklin Mieuli, the owner of the Warriors upon their transfer to the Bay Area, had worked with King on Giants baseball on KSFO and the Golden West Radio Network, serving as executive producer for the broadcasts.\nKing was not shy about disagreeing with the referee's calls during the course of his play-by-play work, and was a notorious ref-baiter.  In his most infamous incident, he used an expletive on the air to describe a referee's call, and the Warriors were charged with a technical foul.  He may be the only professional sports announcer ever charged with an infraction during the course of play.\nVoice of the Raiders\nIn 1966, while continuing to call Warriors games, King was hired as the play-by-play announcer for the Oakland Raiders, then of the American Football League, a post he held until after the 1992 season. For a time, he commuted to Los Angeles when the Raiders relocated to Southern California from 1982&ndash;1994. He announced the Raiders' three Super Bowl victories, as well as countless other memorable games.\nPerhaps King's most famous call came during the Raiders' infamous Holy Roller game against the San Diego Chargers on September 10, 1978. In the final seconds of the game, Raider quarterback Ken Stabler tossed the ball forward, and tight end Dave Casper grabbed it in the end zone for a disputed, game-winning touchdown. King's description:\nAnother famous call came on November 8, 1970, when George Blanda came off the bench in the fourth quarter against the Cleveland Browns, threw for a tying touchdown with less than 2 minutes left, and kicked the winning field goal as time ran out. King reacted by declaring \"George Blanda has just been elected King of the World!\"\nVoice of the Athletics\nThough carrying a substantial workload as the announcer for two professional sports teams, King was persuaded by the new owners of the Oakland Athletics to become their lead announcer in . King continued to call Raider and Warrior games, though he retired as the Warriors' announcer after 1983 and left the Raiders after the 1992 season when he and the team's new radio rights holder, Nederlander Sports, couldn't come to an agreement on an extension. According to the Los Angeles Times, Nederlander Sports offered King just $50,000 per season, which King's agent, Hugh Lawrence, said was an \"entry level\" figure and would have been 47% of what he made the season before.\nFor the first 15 years as A's announcer, King was paired with another legendary Bay Area sports announcer, Lon Simmons, with whom King had worked briefly with the Giants in . He was there during the \"Billyball\" and \"Bash Brothers\" eras, as well as the Moneyball era of the late 1990s and early 2000s.\nFormer Athletics announcer Greg Papa, who worked alongside King for 13 years, says of King:\nRenaissance man\nKing was often described as a Renaissance man who was a voracious reader, loved to watch the ballet and opera in his spare time, and studied Russian history. He lived in Sausalito, California, and would often go on long sailing trips in the baseball off-season on his ketch, Varuna.\nCalls and phrases\nKing's trademark phrase was \"Holy Toledo\", which he used when a stupendous event occurred for the team he was announcing for. Other well known calls are \"Not in your wildest alcoholic nightmare would you ever imagine such events unfolding!\" which he said during an Oakland Athletics game against the Texas Rangers and \"Crazy...just plain crazy!\" which he voiced when Scott Hatteberg hit his walk-off home run against the Kansas City Royals to push the Athletics’ historic win streak to twenty games. He also described a grinning John Madden as a \"slit watermelon\" as a compliment when Raiders won the Super Bowl in 1977 with Madden as a coach.\nDeath\nKing died of a pulmonary embolus in San Leandro, California, on October 18, 2005, at the age of 78. Although King had long refused to reveal his age, a search of the Social Security Death Index revealed he had been born on October 6, 1927 a year also confirmed by his son, Michael.\nTributes\nOn November 1, 2005, in conjunction with the Oakland A's, Golden State Warriors, and Oakland Raiders, a private ceremony celebrating the life of Bill King was attended by family, friends, and the media at The Arena in Oakland. There were performances by the Smuin Ballet and tributes from Bill's former broadcast partners. Hank Greenwald, who worked with King during his Warriors tenure, was the master of ceremonies.\nThe most memorable tributes were from Greenwald, Ken Korach, and Raider owner Al Davis. In his speech, Korach mentioned that King had three rules in his broadcasts. He hated it when an announcer mentioned a \"grand slam home run\", because saying \"home run\" was redundant; he disliked the usage \"early on\", believing that the word \"on\" was unnecessary and grammatically incorrect; and he never liked to be thanked by his broadcast partner when he \"tossed\" to him for his innings. Korach said, \"sorry partner, but thanks for everything.\"\nAl Davis gave arguably the most commanding and entertaining eulogy. When he first met him at Raider training camp in 1966, Davis didn't know what to make of the small-statured King with his handlebar mustache and beard, who was sitting shirtless on a blanket and holding a yellow pad making notes of what the players were doing on the field. \"You've got to be kidding me!\" Davis said. \"What could this little fella possibly know about football?\" Noting that it's a rare day when all three Oakland teams are represented in one room, Davis said, \"To think it was Bill King who brought us together. Bill King never played for the Oakland Raiders, nor did he play for the Los Angeles Raiders. Nor did he wear the famed colors of silver and black. If he had worn them, he would have worn them with poise and with pride and with class, because he was a star.\" Davis added that King gets a cloak of immortality, because time never stops for the great ones. He said it was his dream to have a sold-out stadium seating 1 to 2 million Raider fans, all listening to the voice of Bill King.\nBruce MacGowan of radio station KNBR also gave a moving speech about how he met King through Lon Simmons and even worked as a Raider statistician in the early 1970s. He once asked King for a ride home and noted how beat-up King's car was. On the drive to Marin County, MacGowan noticed that there was a draft, even though the windows were rolled up. To his dismay, he discovered there was a hole in the floorboard by his feet. MacGowan asked how long King had been driving his car. King replied, \"I just got it a week ago. No sense in paying more than $250 for a car.\"\nIn the 2006 Oakland A's season, the A's players on their home white jerseys bore a patch depicting an old-style radio microphone with a yellow sunburst around the microphone and the words \"HOLY TOLEDO\" across the center which was King's signature call on a home run, and at the base of the microphone was the name KING.  A sign was placed above the radio booth with the same logo, and was unveiled Opening Night by colleagues Ray Fosse and Ken Korach.  Subsequently, the radio booth at the Oakland-Alameda County Coliseum is the \"Bill King Radio Booth\". On Opening Night, a video tribute was played on the Diamond Vision screen, and in lieu of the ceremonial first pitch, Bill King's chair, a baseball, and his headset were on the pitcher's mound.\nDuring the 2017 season at the Coliseum, a sign was installed in the centerfield wall just to the right of the 400 foot marker depicting the worlds \"Holy Toledo\" in a script font. The sign's lighting effects are controlled by a large button in the home radio booth. When Ken Korach deems a great Oakland A's play Bill King worthy, he presses the button, and the sign flashes. It can also be used for other occasions during the course of the game, as controlled by the A's production crew.\nBesides the tributes, there was a Bill King \"uncensored\" segment which really opened up some eyes as the audience heard King's off-air banter with his broadcasters, which included some rather colorful language. The best segment was the actual audio call of the \"Mother's Day\" incident from the Warriors' game at Seattle on December 6, 1968. King was outraged by (ostensibly) poor officiating from official Ed T. Rush in his rookie season. After several calls had gone against the Warriors, King took off his headset, turned off his microphone, cupped his hands and yelled a certain expletive at Rush. Unbeknownst to King, the crowd mic was on and Bill's insult went over the airwaves. The Warriors were assessed a technical foul and owner Franklin Mieuli later had to pay a fine to the Federal Communications Commission for the incident.\nLegacy\nKing is one of only three people ever awarded both a World Series ring and a Super Bowl ring. The others were Bob Sheppard, the long-time stadium voice of the New York Football Giants and New York Yankees, and sports executive Larry Lucchino.\nAs noted in the San Francisco Chronicle, \"King was believed to be 78. The lack of knowledge of his exact age was one of the many quirks that made King one of the great characters in Bay Area sports.\"\nBill King was a member of the first class of inductees into the Bay Area Radio Hall of Fame in 2006.\nOn December 7, 2016, he was named the 2017 recipient of the Ford C. Frick Award by the National Baseball Hall of Fame.\nThe NFL Network named King the #6 greatest NFL announcer of all time.\nIn August 2024, King was inducted into the Oakland Athletics Hall of Fame.\nPublication of Holy Toledo\nIn September 2013, Wellstone Books released Ken Korach's Holy Toledo – Lessons from Bill King: Renaissance Man of the Mic. San Francisco Chronicle columnist Bruce Jenkins wrote that the book \"beautifully captured\" King; Lowell Cohn, of the Santa Rosa Press-Democrat, said it was \"soon to be a legend among sports books\"; and Bay Area News Group columnist Carl Steward called Holy Toledo a \"fabulous, engaging read.\"\nReferences\nExternal links\n* [https://baseballhall.org/discover/former-colleagues-remember-bill-king Bill King] Ford C. Frick Award biography at the National Baseball Hall of Fame\n* [http://www.sfgate.com/cgi-bin/article.cgi?file=/c/a/2005/10/19/SPGD1FANUT1.DTL Obituary from the San Francisco Chronicle]\n* [https://archive.today/20130102070329/http://vault.sportsillustrated.cnn.com/vault/article/magazine/MAG1089824/index.htm Fimrite, Ron. \"Lucky Devil, He Found Heaven,\" Sports Illustrated, May 12, 1975.]\n* [http://www.sfgate.com/cgi-bin/article.cgi?f=/c/a/2010/02/03/SPUN1BRG4J.DTL Ratto, Ray. \"It's time to give announcer King his due,\" San Francisco Chronicle , February 3, 2010.]"
    }
  ]
}