{
  "content": [
    {
      "type": "text",
      "text": "# Bill Warner (writer)\n\n| birth_place      =\n| occupation       = Founder and President of the Center for the Study of&nbsp;Political Islam International (CSPII)\n| language         =\n| residence        =\n| nationality      = American\n| citizenship      =\n| education        = North Carolina State University (PhD)\n| alma_mater       =\n| subject          = Writer\n| movement         =\n| website          =\n}}\nBill Warner is the pen name of Bill French (born 1941), a former physics professor and anti-Islam writer. He founded the Center for the Study of Political Islam International, which is based in the Czech Republic. The Southern Poverty Law Center in 2011 described him as one of a core group of ten anti-Islam hardliners in the United States. He has also been described as a part of the counter-jihad movement.\nBiography\nWarner graduated from North Carolina State University where he got his PhD in physics and mathematics in 1968. He is a former Tennessee State University physics professor. Warner does not have an academic background in religious studies. He participated in the Murfreesboro protests where he spoke to a group of opponents of the mosque and sold his books. The protests included a legal case arguing that Islam is not a religion.\nReception\nMiddlebury Institute professor and terrorism expert Jeffrey M. Bale refers to Warner as an example of writers who identify Islam with Islamism. According to Bale, these writers relate all the characteristics associated with Islamism with Islam as a whole, alleging that \"such characteristics are intrinsic to Islam itself, and therefore that Islamism and jihadism are simply logical extensions - or simple applications in practice - of the authentic tenets and core values of Islam.\" He argues that, what they \"fail to acknowledge is that these particular interpretations are by no means the only possible interpretations of core Islamic doctrines, traditions, and values, nor are they necessarily the most authentic, valid, or widely shared interpretations.\" This he says, is like claiming that Christian Reconstructionism is identical to Christianity.\nAmerican Muslim religious liberty lawyer Asma Uddin considers groups like Warner and his organization as anti-Muslim entities that mainstream the idea that Islam is not just a religion but also a political ideology which aids in legitimizing restricting the religious freedom of American Muslims. Warner's organization has said that “Statistics show that Islamic politics is what brought Islam success, not religion” and journalist Uddin described the organization's statement that Islam is mainly a political ideology as \"pseudoscience and these quote, unquote ‘think tanks’... are responding to the work of actual legitimate think tanks using the language of statistics.\"\nZafar Iqbal, professor at Pakistan's International Islamic University, has compared Warner to Geert Wilders in that both consider Islam to be a totalitarian political ideology demanding complete submission.\nCzech politician Jiří Kobza lists 4 publications by Warner in his \"list of the most important books that every citizen should read\".\nCenter for the Study of Political Islam International\nThe Center for the Study of Political Islam International (CSPII), based in the Czech Republic, was formed by Warner and Milan Podlipný from the Czech Republic  in 2014. According to its website it has branches in 11 countries.\nThe Southern Poverty Law Center states that the CSPII ran two lectures in the Czech Republic in 2017 where lecturers described \"Muslims as being encouraged to promote principles in contradiction with a European understanding of human rights.\"\nThe Council on American–Islamic Relations has described the CSPI as Islamophobic, listing it as part of the\" U.S.-based Islamophobia network’s inner core\".\nThe Czech branch distributed one of Warner's books to the Slovak National Council in 2016. Luboš Kropáček, a Czech Islamologist at Charles University stated that \"As far as I know, no Orientalist, Arabist or Islamologist pays attention to this man, he has no business in our field of science.\"\nBronislav Ostřanský, a researcher at the Oriental Institute, ASCR, said that his apparently scientific approach impresses many people \"including otherwise educated and politically influential personalities\" but that he should be quoted \"in a professional work in only one context, namely as relevant source material for the study of contemporary Islamophobia.\"\nIn 2010 the Royal Aal al-Bayt Institute for Islamic Thought commented on Warner's article \"Is a nice Muslim a Good Muslim?\" which is now on the CSPII site.\nSee also\n* Political Islam\nBibliography\n*\n*\n*\n*\n*\nReferences\nExternal links\n*"
    }
  ]
}