{
  "content": [
    {
      "type": "text",
      "text": "# Billboard Latin Music Award for Reggaeton Song of the Year\n\nThe 'Billboard Latin Music Award for Reggaeton Song of the Year' was an honor that was presented annually at the Billboard Latin Music Awards, a ceremony which honors \"the most popular albums, songs, and performers in Latin music, as determined by the actual sales, radio airplay, streaming and social data that informs ''Billboard's weekly charts.\"\nThe accolade for Reggaeton Song of the Year was first presented at the twelfth Billboard Latin Music awards in 2006 to the collaborative single \"Mayor Que Yo\", performed by Baby Ranks, Daddy Yankee, Wisin & Yandel, Héctor el Father and Tony Tun Tun. The song was produced by Dominican producers Luny Tunes and featured on their second compilation album Mas Flow 2. \"Mayor Que Yo\" reached number three on the Billboard Latin Songs chart, spending 46 weeks on the chart. Puerto Rican duo R.K.M & Ken-Y received the accolade twice, first at the Billboard Latin Music Awards of 2007, for their reggaeton and R&B single \"Down\" and again at the Billboard Latin Music Awards of 2008 for \"Igual Que Ayer\". At the Billboard Latin Music Awards of 2009, thirteen newly created categories expanded the Billboard Latin Music Awards, with the accolade for Reggaeton Song of the Year being replaced for the Latin Rhythm Airplay Song of the Year award.\nRecipients\n{| class=\"wikitable plainrowheaders sortable\" style=\"text-align:center;\"\n! scope=\"col\" style=\"width:5em;\" | Year\n! scope=\"col\" | Performing artist(s)\n! scope=\"col\" style=\"width:10em;\" | Nationality\n! scope=\"col\" | Work\n! scope=\"col\" class=\"unsortable\" | Nominees\n! scope=\"col\" class=\"unsortable\" | Ref.\n|-\n! scope=\"row\"|2006\n| scope=\"row\"|Luny Tunes & Baby Ranks featuring Daddy Yankee, Wisin & Yandel, Héctor el Father and Tony Tun Tun\n| scope=\"row\"| &\n| scope=\"row\"|\n| scope=\"row\"|\n*Angel & Khriz&nbsp;— \"Ven Bailalo\"\n*Daddy Yankee&nbsp;— \"Lo Que Pasó, Pasó\"\n*Wisin & Yandel&nbsp;— \"Rakata\"\n| style=\"text-align:center;\"|\n|-\n! scope=\"row\"| 2007\n| scope=\"row\"|R.K.M & Ken-Y\n| scope=\"row\"|\n| scope=\"row\"|\n| scope=\"row\"|\n*Daddy Yankee&nbsp;— \"Machucando\"\n*Tito \"El Bambino\" &nbsp;— \"Caile\"\n*Wisin & Yandel&nbsp;— \"Pam Pam\"\n| style=\"text-align:center;\"|\n|-\n! scope=\"row\"| 2008\n| scope=\"row\"|R.K.M & Ken-Y\n| scope=\"row\"|\n| scope=\"row\"|\n| scope=\"row\"|\n*Casa de Leones&nbsp;— \"No Te Veo\"\n*Don Omar&nbsp;— \"Ayer La Vi\"\n*Héctor el Father&nbsp;— \"Sola\"\n| style=\"text-align:center;\"|\n|-\n|}\nNotes\nEach year is linked to the article about the Billboard'' Latin Music Awards held that year.\nThe nationality of the performing artist(s).\nThe name of the performer and the nominated song\nReferences"
    }
  ]
}