{
  "content": [
    {
      "type": "text",
      "text": "# Bill Ward (cartoonist)\n\n| birth_place   = New York City, U.S.\n| death_date    =\n| death_place   = New Jersey, U.S.\n| area          =\n| cartoonist    = Y\n| write         = Y\n| pencil        = y\n| ink           =\n| letter        =\n| color         =\n| edit          =\n| alias         = Bill\n| notable works = Torchy\n| awards        =\n| website       =\n}}\nWilliam Hess Ward (March 6, 1919 – November 17, 1998), was an American cartoonist notable as a good girl artist and creator of the risqué comics character Torchy.\nBiography\nEarly life and career\nBorn in Brooklyn, New York, Ward grew up in Ridgewood, New Jersey, where his father was an executive with the United Fruit Company.\nAt age 17, Ward, already an art hobbyist, began his professional career by illustrating \"beer jackets\", a type of white denim jacket with text or design printed or drawn on the back; Ward charged one dollar a jacket, and by his own count drew hundreds during that summer. He went on to attend Pratt Institute in Brooklyn, New York City, New York, where one classmate was future naturist painter Bob Kuhn. Ward graduated in 1941, and through the university's placement bureau obtained a Manhattan art-agency job at $18 a week, sweeping floors, running errands and serving as an art assistant. He was fired after accidentally cutting in half a finished Ford automobile illustration with a matte knife.\nStill rooming at his college fraternity house, he received a call from Pratt regarding another job, assisting comic book artist Jack Binder. He joined Binder's small art studio, a \"packager\" that supplied outsourced comics pages to fledgling comic book publishers, where Pete Riss was his assistant. The studio was relocating from The Bronx to, coincidentally, Ward's hometown of Ridgewood, New Jersey, to the upstairs loft of a barn. There, Binder drew layouts for Fawcett Comics stories, for which Riss penciled and inked figures and Ward drew the backgrounds. Features included Mister Scarlet and Pinky, Bulletman, Ibis the Invincible, Captain Battle, the Black Owl, and the adapted pulp magazine features Doc Savage and The Shadow. The studio grew to about 30 artists, with Ken Bald as the art director.\nWard's first credited works are writing and drawing an episode each of the two-page humor features Private Ward in Fawcett's Spy Smasher #2 (cover-dated Winter 1941) and Bulletman #3 (January 14, 1942), published closely with each other.\nShortly thereafter, Quality Comics editor George Brenner hired Ward to write and pencil the hit aviator feature Blackhawk of World War II. Ward artwork for Military Comics #30-31 (July–August 1944), with the next several issues generally but unconfirmably credited to Al Bryant. Ward stated that he succeeded Reed Crandall, the preeminent Blackhawk artist, when Crandall was drafted into the U.S. Army, but Crandall first drew the feature in Military Comics #12-22, and he was succeeded primarily by the team of penciler John Cassone and inker Alex Kotzky before Ward took over.\nTorchy\nTorchy made her comic-book debut as star of a backup feature in Quality Comics' Doll Man #8 (Spring 1946), and continued in all but three issues through #28 (May 1950), as well as in Modern Comics #53-89 (Sept. 1946 - Sept. 1949). A solo series, Torchy, ran six issues (Nov. 1949 - Sept. 1950).\nSeveral Torchy stories, including some Fort Hamilton strips, were reprinted in Innovation Comics' 100-page, squarebound comic book ''Bill Ward's Torchy, The Blonde Bombshell #1 (Jan. 1992). Others have been reprinted in fy Pages #1 (1987); AC Comics anthology Good Girl Art Quarterly'' #1 (Summer 1990), #10 (Fall 1992), #11 (Winter 1993), and #14 (Winter 1994), and in AC's ''America's Greatest Comics'' #5 (circa 2003). Comic Images released a set of Torchy trading cards in 1994.\nWard drew an original cover featuring Torchy for Robert M. Overstreet's annual book The Comic Book Price Guide (#8, 1978).\nLater career\n\"]]\nWard's last confirmed American comic-book work is at least one Blackhawk story in Blackhawk #63 (cover-dated April 1953; another story in that issue is unconfirmed but generally credited to Ward). His last unconfirmed but generally accepted comic-book works both appeared two months later: a Blackhawk story in Blackhawk #65 and a Captain Marvel Jr. tale in Fawcett Comics' The Marvel Family #84 (both June 1953).\nWard turned to magazine cartooning afterward, doing humorous spot illustrations, some featuring Torchy, for such publications as editor Abe Goodman's Humorama. Some of Ward's gag comics were collected in the Avon Books paperback Honeymoon Guide (#T-95, 1956; reprinted as #T282, 1958). Ward was also a regular artist for the satirical-humor magazine Cracked.\nHe did very occasional comic-book humor stories, such as the four-page \"Play Pool\" in Humor-Vision's satiric Pow Magazine #1 (Aug. 1966), and, that same decade, episodes of \"The Adventures of Pussycat\", a risqué feature about a sexy secret agent, which ran in various men's adventure magazines published by Martin Goodman's Magazine Management Company. Ward dabbled in underground comics, drawing a pornographic \"Stella Starlet\" story in publisher John A. Mozzer's Weird Smut Comics #1 (1985) and a \"Sugar Caine\" story in issue #2 (1987); both were written by Dave Goode.\nWard wrote and illustrated erotic stories for such men's magazines as Juggs and Leg Show &mdash; an article a month for the former in his later years. During this period he also did cover and interior illustrations for various paperback publishers of softcore and hardcore pornography, especially those owned by William Hamling; and illustrations (primarily covers) for Screw.\nIn a rare turn doing a mainstream comics character, Ward drew the four-page part one of a Judge Dredd story, \"The Mega-City 5000,\" in the weekly British comic book 2000 AD #40 (November 26, 1977), reprinted in Judge Dredd: The Early Cases #3 by Eagle Comics (April 1986).\nReferences\nFurther reading\n*Kroll, Eric, and Martin Holz, ed., The Wonderful World of Bill Ward, King of the Glamour Girls (Taschen, 2006)\n*Chun, Alex, ed., The Pin-Up Art of Bill Ward (Fantagraphics, 2007)\n*Chun, Alex, ed., The Glamour Girls of Bill Ward (Fantagraphics, 2007),\nExternal links\n*[http://lambiek.net/artists/w/ward_bill.htm Bill Ward] at the Lambiek Comiclopedia\n*Agena, Eric, ed. [http://www.comicstripfan.com/gga/other/w/wardbill.htm \"Other Adult Publication GGA - Bill Ward\"], ComicStripFan.Com, n.d. [https://web.archive.org/web/20101125102041/http://www.comicstripfan.com/gga/other/w/wardbill.htm WebCitation archive].\n*Courtney, Bill. [http://my.opera.com/billinbeijing/blog/the-sexy-cartoon-world-of-bill-ward-in-progress \"The Sexy and Patriotic Cartoon World of Bill Ward\"], The Uranium Cafe (fan site), June 18, 2007. [https://web.archive.org/web/20101024044710/http://my.opera.com/billinbeijing/blog/the-sexy-cartoon-world-of-bill-ward-in-progress WebCitation archive].\n*[https://archive.today/20080117220338/http://scoop.diamondgalleries.com/scoop_article.asp?ai=4117&si=126 \"Did You Know? Torchy Todd\"], Scoop (column), Diamond Galleries, December 25, 2003. [https://web.archive.org/web/20110523160300/http://scoop.diamondgalleries.com/public/default.asp?t=1&m=1&c=34&s=264&ai=44845&ssd=12/25/2003&arch=y WebCitation archive]."
    }
  ]
}