{
  "content": [
    {
      "type": "text",
      "text": "# Bill Ward (British artist)\n\nWilliam Ward (1927–1996) was a British erotic artist. He is best known for his strips featuring bear-like men and in particular his Adventures of Drum series for Drummer magazine.\nLife and work\nBorn in London, he lived almost all his life in the city with exception of a three-year tour in the Army. His publishing career began as a copyboy in newspaper publishing before becoming an art editor for children's comics and then a freelance graphic artist. He worked as a graphic artist for Amalgamated Press and Fleetway on children's comics, notably their Thriller series (November 1951 – May 1963).\nHis influences were Burne Hogarth's Tarzan, Hal Foster's Prince Valiant and Milton Caniff.\nThere is some evidence Ward had his first erotic drawings published discretely in the British physique magazine Male Classics and also in Physique Pictorial. Unusually these were initialled and credited to him by name. It is possible that he also used the pseudonym Tristano. He did not produce sexually explicit works until he had retired from reliance on mainstream comic work. Gay sex and images portraying or 'encouraging it' were illegal in the period before 1967. During the 1970s he was working for the Mansell Collection, a commercial picture archive which was housed at 42 Linden Gardens; he was living there with actor Brian Rawlinson in an outbuilding that served as his own studio. The picture library and the house was owned by Louie Boutroy (1903–1993) and run with her unofficial adopted son and protégée George Anderson and his life partner Harold, who also lived at the house.\nCareer after 1970\nWard began to produce strips (King) for both the British and American magazines from about 1976. In Britain these appeared in Him and Zipper magazines under the editorship of Alex McKenna, as well as Sam and Daddy. It was his work for the American magazines Manifest Reader, Stroke and Drummer that made him well known. Apart from King, his characters included the muscular sexual adventurer Drum, a clueless comic character Zeke and Rogan a space cop, as well as illustrations to John Embry's story The Exchange (writing under the pseudonym Robert Payne). His work features in the same issue of Drummer that includes Robert Mapplethorpe's first commissioned cover (issue 24, September 1978) under the editorship of Jack Fritscher. Collections were published by Alternate Publishing in San Francisco (The Adventures of Drum, The Fantastic Adventures of Bill Ward) and under the Meatmen imprint of gay comics. The artist was in regular contact with others in the field: he corresponded with Al Shapiro (\"A. Jay\") arts editor at Drummer, Bill Schmeling (\"The Hun\") and Harry Bush. The artist Rex met him and was an admirer, owning work by Ward.\nIn 1986, Ward was featured in Naked Eyes, an artist showcase organized by Olaf Odegaard that highlighted gay men's visual art for the International Gay and Lesbian Archives. In the 1990s, now living in Stratford with his then-partner Christie's silver expert Stephen Helliwell, both were diagnosed with AIDS and died within a few months of each other in 1996.\nLegacy\nWard lost the majority of his original drawings for American strips for Drummer during a change of ownership. He tried, with the help of John Embry to have them returned but failed. Some of his work remained with his \"dowager partner\" Brian Rawlinson in a space he used for drawing but eventually the studio (at Linden Gardens), filled with piles of magazines and detritus, needed clearing. With no idea what to do with the explicit drawings he had been left, Rawlinson's houseclearers were due put them in the same skip as the rest of the contents. Fortunately Bill's model for his character Drum, Robert Bremner (1947-2003), a fellow member with Bill of the London  [https://archiveshub.jisc.ac.uk/search/archives/f6ac5fae-dba7-3832-b737-8f3476cf2ff4 MSC] leather club heard about it with only a day to spare. With Rawlinson's blessing and the help of artist Guy Burch, they sifted the material to extract an archive of work and related ephemera. Bremner also died of AIDS but the works were kept together by Burch but the explicit nature of many drawings made display or publication difficult. Burch supplied information for ‘Comics Unmasked, Art and Anarchy in the UK' at the British Library, which featured him as one of two British gay erotic comic illustrators. Ward's work was included in [http://www.guyburch.co.uk/?p=4604 'Model Men'], an exhibition commemorating the 50th anniversary of the 1967 Sexual Offences Act in 2017. The Japanese Manga artist Gengoroh Tagame cites Ward as an influence.\nThe bulk of his surviving the work from the archive is now held by the Bishopsgate Institute in conjunction with the Queer Britain Museum. The Leather Archives and Museum in Chicago, the Tom Of Finland Foundation, [https://www.come.net.au/mission/ The Collection of Male Art (Tazmania)] and the Australian Queer Archives also hold works.\nSee also\n* Beefcake magazines\n* Gay comics\nNotes\nExternal links\n*"
    }
  ]
}