{
  "content": [
    {
      "type": "text",
      "text": "# Bindeshwari Dubey\n\n}}\n}}\n| birth_date          =\n| birth_place         = Mahuaon, Bihar and Orissa Province, British India\n| death_date          =\n| death_place         = Chennai, Tamil Nadu, India\n| resting_place       = Ganges, Varanasi\n| party               = Indian National Congress\n| occupation          = Trade unionist, politician\n}}\nBindeshwari Dubey (14 January 1921 – 20 January 1993) was an Indian independence activist, trade unionist and politician who served as Chief Minister of Bihar between 12 March 1985 and 13 February 1988.\nDubey was involved in the nationalisation of Indian collieries, especially in the Chhotanagpur region that was then a part of Bihar (now Jharkhand). He held the portfolios of Law, Justice and Labour in the Union Council of Ministers in Rajiv Gandhi's cabinet. Earlier, he had held offices at state level as Minister of Education, Transport and Health. He was a member of the Seventh Lok Sabha  between 1980 and 1984, representing the Giridih constituency in Bihar. He was a member of the Rajya Sabha from 1988 until his death. Earlier he had been a member of Bihar Legislative Assembly during 1952–57, 1962–77 and 1985–88. He had also been a National as well as State President of INTUC besides being a Bihar Pradesh Congress Committee President.\nEarly life\nBindeshwari Dubey was the second of four sons born to a humble farming Kanyakubja Brahmin family in the village of Mahuaon, Bhojpur, Bihar. His father, Shiv Naresh Dubey, was a peasant and despite showing promise in school, Dubey's education was not considered important. This caused him to run away to Patna, where he lived with his maternal uncle and continued his studies at St. Michael's High School, Patna After his matriculation he worked on night-shifts in a factory as well as continuing to offer tuition to people as he had done during his school days in order to fund his education. He was eventually offered a place at Bihar college of engineering (today's National Institute of Technology, Patna) in Patna.\nDubey left his engineering studies to join the Quit India Movement in 1942.\nPolitical career\n, 1979]]\nDubey was a member of Bihar Legislative Assembly for five periods as a representative of the Bermo constituency, being 1952–57, 1962–67, 1967–69, 1969–72, 1972–77. Between 1985 and 1988 he was again a member, this time for the Shahpur constituency.\nFor a short period between 28 May and 24 June 1973, Dubey served as Education Minister for the state government headed by Kedar Pandey. He was Transport Minister from 25 September 1973 until 18 April 1974 in an Abdul Gafoor-led government, and from 11 April 1975 to 30 April 1977 he was in Jagannath Mishra's government of Bihar as a Cabinet Minister of Health & Family Planning and Science & Technology.\nChief Minister of Bihar\nDubey became Chief Minister in 1985 and held the post until 1988. However, his Chief Ministership was controversial and there were accusations of genocide and corruption. He launched the 'Operation Black Panther' in Champaran to free the area from the criminals and other anti-social elements. He also launched 'Operation Siddhartha' and 'Mafia Trial' to combat the MCC terrorist group and the Coal Mafias of Dhanbad, respectively.\nControversies\nThe short tenure of Bindeshwari Dubey witnessed the atrocities against the backward caste in Pararia village, in Deogarh district of Bihar. In the Pararia mass rape incident, the policemen of Bihar Police Force raped women belonging to twenty six families and looted the valuables from their houses. The contemporary media reports criticised Dubey government on not taking appropriate action on the incident in which backward caste women were raped and humiliated. The Congress (I) politicians under him were accused of falsifying the incident and unilaterally declaring that no rape or assault has happened.\nBesides  corruption which swept  every part of Bihar's administration, Dubey government is also accused of patronising political criminals. The Police's excesses also reached a new height during his tenure.\nNational offices\nDubey was a member of the Seventh Lok Sabha between 1980 and 1984 as a representative of the Giridih constituency in Bihar. He was a member of the Rajya Sabha from 3 April 1988 until his death on 20 January 1993.\nWhile in the Rajya Sabha, he was Union minister for Law and Justice between 14 February and 26 June 1988, and then Minister for Labour from 26 June 1988 until 1 December 1989.\nTrade unionism\nDubey was closely connected with the trade union movement in the coal, steel, engineering, power and sugar industries. He was also closely associated with Indian National Trade Union Congress and became its national president in 1984, having previously been a state president until his last breath. He was also the president of many other labour unions, such as the Rastirya Colliery Mazdoor Sangh (RCMS), the Indian National Mineworkers' Federation (INMF), and the Bokaro Steel Workers Union.\nDubey started his Trade Union movement in the mid-1940s before independence when the collieries of India were in private hands where colliery owners and contractors used to exploit the contract labourers. He campaigned for better wages and working conditions for coal miners, visiting many countries like West Germany, the United Kingdom, Belgium, the Netherlands, France, Yugoslavia, Switzerland and Japan to acquaint himself with employment conditions in mines and factories. He represented the country at many international labour conferences and seminars.\nLegacy\nAmong the numerous structures and institutions named in Dubey's honour are:\n* Bihar Government organize Birth Anniversary of Dubey as a State Function every year on 14 January.\n* 'Bindeshwari Dubey Smriti Granth' was published by Dubey lovers after few days after the death of Dubey.\n* A statue of him at Collectory Talaab, Ara, Bhojpur, Bihar.\n* Bindeshwari Dubey Awasiya Mahavidyalaya, Pichhri, Bokaro, Jharkhand\n* Bindeshwari Dubey Inter College, Bihiyan, Bhojpur, Bihar\n* Bindeshwari Dubey Bridge\n* Bindeshwari Dubey Smarak Complex, Bhojpur District, Bihar\nSee also\n* List of chief ministers of Bihar\nReferences"
    }
  ]
}