{
  "content": [
    {
      "type": "text",
      "text": "# Bishweshwar Nath Reu\n\nBisheshwar Nath Reu (2 July 1890 – 1947) was an Indian historian. He started his career as an assistant to Gaurishankar Hirachand Ojha, and learned the ancient Dingal language from him. Later, he was appointed as the head of the Department of History (by Maharaja Sumer Singh of Jodhpur), Department of Archaeology (by Maharaja Ummed Singh of Jodhpur), the Sardar Museum, the Pustak Prakash (Manuscript Library) and Sumer Public Library of the erstwhile princely state of Jodhpur.  Mahamahopadhyaya He made his mark as a historian, epigraphist, numismatist and Sanskritist, he is best known for his history of Marwar.\nAuthorship\nReu published Bharat ke Prachin Rajvansh with the three volumes being released in 1920, 1921 and 1935 respectively. Raja Bhoja was published in 1932, these books were written  in Hindi. In 1933, a revised and enlarged version of material from volume 3 of Bharat ke Prachin Rajvansh was published (in English) as History of the Rashtrakutas. The two volumes of Marwar ka Itihas (in Hindi) reached the public in 1938 and 1940. Coins of Marwar was published in 1946 and a biography of Rathod Durgadas was released in 1948.\nBibliography\n*Bharat ke Prachin Rajvansh (Kingdoms of Ancient India) Editor: Bhagwatilal Rajpurohit, Publisher: Jaipur Publication Scheme 2000.\n*Raja Bhoja Publisher: Hindustan Akademi 1932.\n*History of the Rashtrakutas from the beginning to the migration of Rao Sihaji towards Marwar. Publisher: Archaeological Department, Jodhpur 1933.\n*Rashtrakuton ka itihasa: prarambha se lekar Rao Sihaji ke marwar mein ane tak (Hindi translation of above). Publisher: Archaeological Department, Jodhpur 1934.\n*Marwar ka Itihasa (History of Marwar) Publisher: Archaeological Department, Jodhpur 1938.\n*Glories of Marwar and the glorious Rathors. Publisher: Archaeological Department, Jodhpur 1943.\n*Coins of Marwar: from 400 B.C. to 1945 A.D. Published 1946.\n*Rathod Durgadas: a well known hero of Marwar. Publisher: Archaeological Department, Jodhpur 1948.\n*Rigveda ka samajika sanskritaka aur aitihasika sara (Social, cultural and historical material in the Rigveda) in Hindi. Publisher: Rajasthan Sahitya Akademi, 1964.\n*Rigveda para eka aitihasika drishti (Historical perspective on the Rigveda) in Hindi. Publisher: Motilal Banarsidass, Delhi 1967.\nReferences\nExternal links\n*Bisheshwar Nath Reu at google books [https://books.google.com/books?as_q=&num=100&btnG=Google+Search&as_epq=&as_oq=&as_eq=&as_brr=0&as_pt=ALLTYPES&lr=&as_vt=&as_auth=Bisheshwar+Nath+Reu&as_pub=&as_sub=&as_drrb_is=q&as_minm_is=0&as_miny_is=&as_maxm_is=0&as_maxy_is=&as_isbn=&as_issn=]"
    }
  ]
}