{
  "content": [
    {
      "type": "text",
      "text": "# Black May (World War II)\n\n|combatant2    =\n|commander1    =  Max Horton   John Slessor\n|commander2    =  Karl Dönitz\n|strength1     = Royal Navy  Merchant navy\n|strength2     =  U-boat arm\n|casualties1   = 58 ships sunk\n|casualties2   =\n|campaignbox   =\n}}\nBlack May refers to May 1943 in the Battle of the Atlantic campaign during World War II, when the Kriegsmarine U-boat arm () suffered high casualties with fewer Allied ships sunk; it is considered a watershed in the Battle of the Atlantic.\nBackground\nMarch\nAfter February battles around Convoy SC 118, Convoy ON 166 and Convoy UC 1, Black May was the culmination of the March–May 1943 crisis in the Battle of the Atlantic. The U-boat offensive reached its peak in March, with big convoy battles, first around Convoy HX 228, Convoy SC 121, and Convoy UGS 6; then followed the battle for Convoy HX 229/Convoy SC 122, the largest convoy battle of the war. Allied losses for March totalled 120 ships of  of which 82 () were lost in the Atlantic. The  lost 12 U-boats. The official Royal Navy historian, Stephen Roskill, concluded, \"The Germans never came so near to disrupting communications between the New World and the Old as in the first twenty days of March 1943\".\nApril\nSome respite for the Allies came in April, as Karl Dönitz, the  (BdU, commander U-boats) was unable to maintain as many U-boats in the Atlantic. Many of the boats involved in March had headed for their bases but the boats still operational in the month remained active. A particular shock at the end of April was the attack by  on Convoy TS 37, which saw the loss of four tankers in three minutes and another three over the next six hours. Allied losses in April were 64 ships totalling ; 39 ships () were lost in the Atlantic. Fifteen U-boats were lost from all causes. In the following month, the strategic and tactical advantages swung to the Allies, where it remained for the rest of the campaign.\nBlack May\nIn May 1943, U-boat strength reached its peak, with 240 operational U-boats, of which 118 were at sea, yet the sinking of Allied ships continued to decline. May 1943 also had the greatest monthly losses suffered by U-boats up to that time, with 41 being destroyed, 25 per cent of the operational U-boats. The month opened with the battle for Convoy ONS 5, which was costly for both sides, with the loss of 13 merchant ships and six U-boats. The tactical improvements of the escorts began to take effect; the next three convoys that were attacked resulted in seven ships sunk and an equal number of U-boats. Five U-boats were sunk attacking Convoy SC 130, with Admiral Karl Dönitz's son, Peter, among those lost aboard , while no convoy ships were lost.\nAllied losses in May were 58 ships of , of which 34 ships of  were lost in the Atlantic. On 24 May 1943, Admiral Dönitz, shocked at the defeat suffered by the U-boats, ordered a temporary halt to the U-boat campaign; most were withdrawn from operational service. The U-boats were unable to return in significant numbers until autumn and never regained the advantage. During May there had been a drop in Allied losses, coupled with a tremendous rise in U-boat losses; 18 boats were lost in convoy battles in the Atlantic in the month, 14 were lost to air patrols; six of these in the Bay of Biscay. With losses in other theatres, accidents and other causes, the total loss to the U-boat arm in May was 43 boats.\n{| border=\"1\" style=\"margin: 1em auto;\"\n|-\n! Cause of loss\n! No.\n|-\n| Ship\n| 12\n|-\n| Shore-based aircraft\n| 14\n|-\n| Ship-based aircraft\n| 2\n|-\n| Ship + shore-based aircraft\n| 4\n|-\n| Ship + ship-based aircraft\n| 1\n|-\n| Submarine\n| 1\n|-\n| Collision\n| 2\n|-\n| Other causes\n| 1\n|-\n| Missing\n| 3\n|-\n| Bombing raid\n| 3\n|-\n| Total lost\n| 43\n|}\nThis month had the most losses suffered by the U-boat Arm in the war so far, nearly three times the number of the previous highest, and more boats than had been lost in the whole of 1941. Equally significant was the loss of experienced crews, particularly the junior officers, who represented the next generation of commanders. Black May signalled a decline from which the U-boat arm never recovered; efforts were made over the next two years but the U-boats were never able to re-establish their threat to Allied shipping.\nAllied success\nThis change was the result of a combination of the sheer numbers of Allied ships at sea, Allied air power at sea, and technological developments in anti-submarine warfare. These had been introduced over the period and came to fruition in May, with devastating results. Operational analysis was used here, too, to improve the efficiency of attack methods and the weapons in use.\nEscort tactics and weapons\nThe most important factor in the Allied success was that the escorts were getting better; escort groups were becoming more skilled and scientific analysis was producing better tactics. New weapons such as the Hedgehog, and Mark 24 FIDO Torpedo, were coming into use and new tactics, such as the creeping attack pioneered by Captain \"Johnnie\" Walker, proved effective.\nMore escorts became available from American production and the return of escorts involved in the North African landings during November and December 1942. IDestroyer escorts (DEs) (similar British ships were known as frigates) were built economically, compared to fleet destroyers and sloops whose warship-standards construction and sophisticated armaments made them too expensive for mass production. Destroyer escorts and frigates were also better designed for mid-ocean anti-submarine warfare than corvettes, which, although manoeuverable and seaworthy, were too short, slow, and inadequately armed to match the DEs.\nWith the greater numbers of escorts to protect convoys, support groups were organised, to be stationed at sea instead of being tied to a convoy, ready to reinforce convoys under attack and to have the freedom to pursue U-boats to destruction rather than just drive them away. The advantage conferred by Ultra, conversely, became less significant. Its value had been to enable convoys to be re-routed away from trouble but now the escorts could repel or destroy attackers. The Admiralty baulked at using convoys as bait, out of regard for Merchant Navy morale but there was considerably more safety in sailing through U-boat patrolled waters by mid-1943.\nAir power\nThe introduction of \"very long range\" aircraft, such as the Liberator, helped to close the air gap. They were ordered to engage only in \"offensive\" search and attack missions and not in the escort of convoys. Merchant aircraft carriers (MAC ships), which carried Swordfish to attack U-boats and their presence deterred or drove off U-boat as well as raising the morale of the merchant marine. Soon there were growing numbers of American-built escort carriers, which were considerably less expensive and quicker to build than fleet carriers, and while slower and lacking protection these were considered sufficient for their convoy duties. Escort carriers usually carried Avengers and Wildcats. The carrier mechanics quickly improvised equipment for these aircraft for anti-submarine duties, adding drop tanks  and UP rockets that could punch though a U-boat's pressure hull. MAC ships and escort carriers sailed with the convoys and provided much-needed air cover and patrols all the way across the Atlantic, plus escort carriers often formed hunting groups not tied to a convoy with freedom to seek out U-boats. The re-introduction of air patrols over the Bay of Biscay by long range Beaufighters and Mosquitoes, to attack U-boats as they came and went from base, also began to take effect.\nNumbers\nThe Atlantic campaign was a tonnage war; the  needed to sink ships faster than they could be replaced to win, and needed to build more U-boats than were lost to avoid defeat. Before May 1943, even in their worst months, the majority of convoys arrived without being attacked, while even in those that were attacked, the majority of ships survived. In Convoy HX 229/Convoy SC 122, nearly 80 per cent of the ships arrived. At the start of the campaign, the  needed to sink  per month to win; this was seldom achieved. Once the huge shipbuilding capacity of the US began, this target leapt to  per month. U-boat losses were manageable; German shipyards were producing 20 U-boats per month, while losses for most months prior to Black May were less than half that. What changed in May was that the  lost 43 U-boats (25 per cent of the  operational strength) a big defeat outstripping production that became commonplace until the end of the war.\nU-boats\nThe Germans introduced tactical and technological changes. U-boats starting operations in distant waters like the Indian Ocean against targets less well-defended. Although the U-boats found fewer escort ships, there were also fewer merchant ships to sink. The far-away U-boats were called the .\nThe Germans tried to counter Allied air power by fighting on the surface rather than diving. When  came under attack from an aircraft in March 1943, it stayed on the surface and shot down the aircraft. It was hoped that this success could be repeated if U-boats were given better anti-aircraft armament. Several U-boats were converted to flak U-boats. The flak U-boats gave Allied pilots a shock but they soon welcomed attempts by U-boats to stay on the surface. Additional defences against aircraft were offset by the U-boat having to remain on the surface longer, increasing the chance of the submarine's pressure hull being punctured. The U-boat gunners' effectiveness was limited by the lack of protection from return-fire and Allied pilots often called on ships to deal with flak U-boats. The extra anti-aircraft guns caused drag when the U-boat was submerged. The U-333 incident had proved to be an exception, and the experiment was abandoned after six months; the best defence for U-boats against aircraft  remained diving.\nIn mid-1943, the  (Bug) radar warning device and  (Wren) torpedoes were introduced.  was designed to give U-boats advance warning of aircraft by detecting radar waves so that the U-boats could dive before the aircraft could attack. The  torpedoes were designed to zig-zag in the hope that they would have a better chance of finding a target within a convoy. The Allies introduced the Foxer noisemaking decoy to defeat the acoustic homing device of the T5 torpedo. The Germans developed the T11 torpedo that was designed to ignore noisemaking decoys, but the war ended before it came into use. The first U-boats fitted with snorkels () went into service in August 1943. The snorkel was an extendable pipe that allowed U-boats to take in air without surfacing, allowing the U-boat's diesel engines to run submerged for longer periods. The snorkel suffered from technical problems and did not see mass use until mid-1944. Allied radar also became precise enough to pick up the snorkel.\nThe  developed a radically new submarine design, the  (the Type XXI and Type XXIII boats).  did not need to surface during operations but the first  were commissioned too late to see combat in the war. None of the new tactics or technologies turned the tide of war and losses of U-boats continued. After May 1943, the rate of loss of U-boats was greater than the rate at which new boats were commissioned and the number of operational U-boats slowly declined.\nNotes\nFootnotes\nReferences\n*\n*\n*\n*\n*\n*\nFurther reading\n*\n*\n*\n*\n*\n*"
    }
  ]
}