{
  "content": [
    {
      "type": "text",
      "text": "# Black queen cell virus__disambig_1\n\nBlack queen cell virus (BQCV) is a virus that infects honey bees, specifically Apis mellifera, Apis florea, and Apis dorsata. Infection of the latter two species is more recent and can be attributed to genetic similarity and geographical closeness.\nDescription\nBlack queen cell virus was originally described in 1977, but its genome was not sequenced until 2000. BQCV can currently be found most commonly in Australia and parts of South Africa. BQCV visibly affects the pupae of queen bees, causing them first to turn yellow and then black, and eventually die. These pupae come from queen bees that seem healthy and show no symptoms of being infected with this virus, as it only manifests itself with visible symptoms in the larvae. Although only the larvae are visibly affected by this disease, adults can also be infected, but asymptomatically. Transmission occurs by a parasite called Nosema apis, which lives in the intestines of honey bees. BQCV can also be transmitted from nurse bees to larvae when they feed, and from hive to hive when the bees travel between them and when infected queen bees are distributed to other hives, There are no vaccines or treatment forms available to treat bees infected with this virus, therefore sanitation is the best way to prevent the spread. Sanitation practices include replacing the comb of the hive and requeening. Requeening simply means that the queen of the hive is replaced with a new, and in the case of infected hives, healthy queen.\nViral classification\nBlack queen cell virus comes from the order Picornavirales, which are also known as picorna-like viruses. Families within the Picornavirales order include Picornaviridae, Comoviridae, Dicistroviridae, Marnaviridae, and Sequiviridae. Of these, BQCV belongs to the Dicistroviridae family, which means that it is a virus that infects arthropods. This family contains twelve viruses within the genus Cripavirus, and others in the genera Aparavirus and Triatovirus.\nVirus structure\nThe black queen cell virus contains 60 copies of the capsid proteins VP1, VP2, and VP3. The capsid is the shell of the virus that holds the virus's genetic material. VP4 proteins, which are sometimes also found in the capsid, do not affect the virus's infectivity, or ability to be transmitted. The surface of the virion has large protrusions, which are formed by the VP1 and VP3 proteins and are located between the 5- and 3-fold axes of the icosahedral capsid. An icosahedral capsid is formed from 20 triangular faces, put together in such a way that it resembles a sphere. The axes are found where the faces come together.\nDue to these protrusions, BQCV is larger than most other picornaviruses. The capsid is also characterized by plateaus (around the 3-fold axes) and depressions (around the 2-fold axes).\nViral genome\nBlack queen cell virus is a nonenveloped RNA virus. It has a linear, single-stranded, positive sense RNA genome encased in an icosahedral capsid (described above). Viruses with icosahedral symmetry have triangulation numbers, which describe the faces in terms of the number of facets (smaller triangles inside the faces) each contains. BQCV is a pseudo-T=3 capsid, meaning that it is mathematically a T=1 capsid, but the way the capsid is structured makes it look like T=3. The genome of this virus contains 8550 nucleotides and it is polyadenylated. Nucleotides \"are organic molecules that serve as the monomer units for forming the nucleic acid polymers deoxyribonucleic acid (DNA) and ribonucleic acid (RNA)\". There are four different nucleotides that can make up a genome. In BQCV, 29.2% of its genome is made up of A nucleotides, 30.6% is U nucleotides, 18.5% is C nucleotides, and 21.6% is G nucleotides. A genome is polyadenylated when it has a poly(A) tail at the end, or a string of only adenine (A) bases. The black queen cell virus contains two open reading frames (ORFs), which is a \"continuous stretch of codons that contain a start codon (usually AUG) and a stop codon (usually UAA, UAG or UGA)\". ORF1 and ORF2 \"encode polyproteins containing non-structural and structural (capsid-forming) subunits, respectively\".\nReplication cycle\nThe family Dicistroviridae, as a whole, will be used as the model to explain replication of black queen cell virus.\nEntry into cell\nThe virus enters the host cell by clathrin-mediated endocytosis. Clathrin-mediated endocytosis \"is a process by which cells absorb metabolites, hormones, other proteins – and in some cases viruses – by the inward budding of plasma membrane vesicles\". This absorption begins after the virus binds to a receptor on the cell membrane. Once the virus is inside the cell, the virus is uncoated and the genome (RNA) is released into the cytoplasm.\nReplication\nAfter the virus has entered the host cell, it must replicate its genome. In dicistroviruses, the 5’ VPg protein primes synthesis of RNA and inhibits translation of cellular mRNA, which improves translation of viral mRNA. The ORF1 (discussed earlier) codes for the replication enzymes, specifically RNA-dependent RNA polymerase, which helps with RNA replication. The genome of the virus has a positive strand of RNA, which is used as a template to synthesize the negative strand RNA. This negative strand is then used as a template to synthesize more genomic RNA.\nViral interaction with host\nThe main host of black queen cell virus is the honey bee genus Apis. There are also several bumblebee species that are now hosts for this virus. One major impact that this virus has on its host is its ability to produce offspring. The offspring are still produced by infected individuals, but they do not survive. Another way that this virus interacts with its host is by interfering with cellular mRNA production, in favor of its own mRNA production.\nAnother important interaction that BQCV has with its host is its resistance to host cell mechanisms. This resistance is accomplished by a cap structure that black queen cell virus has on the 5’ end of its genome. A cap structure has many functions. It protects the mRNA from being degraded, it ensures efficient translation, and it helps the mRNA travel from the cytoplasm to the nucleus, which is the site of replication. It is possible to study these viral interactions with host cells because of the ability that scientists have to produce mutations in the viral genome and analyze the effect that it has on the host cell.\nAssociated diseases\nThere are many diseases or viruses that can be associated with black queen cell virus. One such disease is Nosema disease. If a honey bee is infected with Nosema apis, there is a much higher chance that that same bee will contract BQCV. Nosema disease can be treated in infected honey bees with Flumidil-B. Another virus that can be associated with BQCV is Sacbrood virus. This virus manifests itself with similar symptoms to those of BQCV but it affects the worker bees of the hive, instead of the queen bee.\nBlack queen cell virus is also similar to a few other viruses within the family Dicistroviridae. Kashmir bee virus (KBV), Israeli acute paralysis virus (IAPV), and acute bee paralysis virus (ABPV) all are related to BQCV very closely, but all have much less easily defined symptoms. Structurally, BQCV is the most similar to TrV and to iflaviruses. Iflaviruses also infect insects, just like black queen cell virus.\nThe human viruses that are closest to BQCV include hepatitis A and human parechovirus. These are both from the family Picornaviridae and they may “form evolutionary intermediates between human and insect viruses”.\nInteractions\nBQCV interacts with parasites to make the virus more prone to causing mortality. Parasites, particularly Varroa destructor, are commonly found in bee colonies that are also infected with viruses. The parasites can activate the virus if it is latent and can also act as a vector to transmit the virus to other uninfected bees. The results of both of these functions of the parasite in these colonies is the increase of the infectivity and the mortality rate related to the virus.\nSome members of the family Dicistroviridae are being used as pest control. Some examples include the control of the olive fruit fly with CrPV and the control of Helicoverpa armigera with Helicoverpa armigera stunt virus. However, black queen cell virus is not used in this way because bee colonies are important to agriculture and to economics.\nReferences"
    }
  ]
}