{
  "content": [
    {
      "type": "text",
      "text": "# Blackbeard in popular culture\n\nEdward Teach, better known as Blackbeard (c. 1680 – 22 November 1718), was a notorious English pirate who operated around the West Indies and the eastern coast of the American colonies during the early 18th century. He captained the ''Queen Anne's Revenge, a 200-ton frigate originally named the Concord'', and died in a fierce battle with troops from Virginia on November 22, 1718, at Ocracoke Island.\nLiterature\n*Tim Powers's historical fiction novel On Stranger Tides has a fictionalized version of Blackbeard searching for the Fountain of Youth in 1718.\n*In Rick Riordan's novel The Sea of Monsters, Blackbeard is shown to be stranded on the evil sorceress Circe's island. He, along with his crew, has been turned into guinea pigs. Annabeth and Percy inadvertently turn them back to human and escape on his ship, the ''Queen Anne's Revenge, leaving Blackbeard and his crew stranded. Here Blackbeard is shown to be a demigod son of Ares. In The Son of Neptune, The Mark of Athena and The Blood of Olympus'', it's mentioned that Blackbeard subsequently destroyed Circe's island resort and escaped with Reyna and Hylla Ramírez-Arellano as his slaves before the two were able to force him to let them go.\n*Blackbeard makes an appearance in Neal Stephenson's The System of the World.\n*A younger Blackbeard appears in Wayne Thomas Batson's Isle of Fire as the new quartermaster of notorious pirate captain Bartholomew Thorne.\n*Blackbeard is a member of the jury in the short story \"The Devil and Daniel Webster\" by Stephen Vincent Benét.\n*The 2016 fiction novel Blackhearts by Nicole Castroman describes Edward Teach in his younger days.\nTelevision\n*Malachi Throne plays Blackbeard's ghost in the Voyage to the Bottom of the Sea season four episode The Return of Blackbeard.\n*In the 1968 Doctor Who serial, The Mind Robber, the Master of the Land of Fiction summons Blackbeard in his mental battle with the Second Doctor in episode 5. Blackbeard is portrayed by Gerry Wain.\n*In the 2000 action-comedy series Jack of All Trades, Blackbeard appears in two episodes played by Hori Ahipene.\n*In the 2001 Time Squad episodes \"Blackbeard Warm Heart\" and \"Repeat Offender\". Blackbeard (voiced by Roger Rose) is more concerned with saving the environment, rather than taking his rightful place in history as one of the most feared pirates. He was later taken in by Time Squad and placed in a cell adjacent to Mahatma Gandhi (who was taken in for wanting to tap dance rather than lead his people against the British).\n*In the 2005 BBC miniseries Blackbeard, Blackbeard was played by James Purefoy.\n*In the 2006 Hallmark Channel miniseries Blackbeard,  the famed pirate (Angus Macfadyen) searches for Captain Kidd's treasure.\n*The 2006 Bones episode \"The Man with the Bones\" centers around a murder on Assateague Island, the legendary home of Blackbeard's hidden treasure.\n*In series two of the 2009 CBBC sketch-comedy series Horrible Histories, Jim Howick plays Blackbeard in the song depicting Blackbeard's life.\n*In the 2014 Once Upon a Time episodes \"The Jolly Roger\", \"Snow Drifts\" and \"Fall\", Blackbeard is featured as an enemy of Captain Hook. He is portrayed by Charles Mesure.\n*The 2014 series Crossbones features Blackbeard (John Malkovich) as the main character.\n*Ray Stevenson portrays Blackbeard in the third and fourth seasons of the Starz series Black Sails.\n*The 2018 ''DC's Legends of Tomorrow'' third-season episode \"The Curse of the Earth Totem\" features Blackbeard, portrayed by Jonathan Cake, after coming into possession of the mystical Earth Totem. Cake reprises his role in the season's finale \"The Good, the Bad, and the Cuddly\".\n*Taika Waititi plays Edward “Ed” Teach in the HBO Max series Our Flag Means Death, in which he is portrayed as being romantically involved with Stede Bonnet, as well as, possibly, a former lover of John Rackham.\n*In 2023, in the end of the Outer Banks season 3 finale, a man offered the six main characters a chance to look for Blackbeard's treasure.\nFilm\n*Blackbeard the Pirate (1952), stars Robert Newton as Blackbeard.\n*The Boy and the Pirates (1960), stars Murvyn Vye as Blackbeard.\n*''Blackbeard's Ghost (1968), based on the novel by Ben Stahl. Peter Ustinov plays Blackbeard as a harmless, socially-inappropriate drunkard.\n*Franco, Ciccio e il pirata Barbanera (1969), stars the comedy duo Franco and Ciccio and with Fernando Sancho  as Blackbeard.\n*Pirates of the Caribbean: On Stranger Tides'' (2011), adapted from Powers' novel, features Ian McShane as Blackbeard, the film's main antagonist, who somehow survived the battle at Ocracoke Island with the help of his quarter master who has foreseen his fate. This Blackbeard is a master of black arts and wields a sword with supernatural powers which allows him to make his ship come alive to attack his foes. He is also described by Jack Sparrow as \"the pirate that all pirates fear\". He seeks the Fountain of Youth so that he can redeem his soul and escape his prophesied death.\n*Pan (2015) stars Hugh Jackman as Blackbeard. Blackbeard and his pirates are the tyrannical rulers of Neverland. For generations they have forced hundreds of boys kidnapped from London to dig in vast underground mines for an immortality-granting dust called pixium.\nComics\n*The Japanese manga One Piece and its related media, features five characters named for Blackbeard&nbsp;— major antagonist Marshall D. Teach, also known as Blackbeard, his former crew mate Thatch, his former captain Edward Newgate, also known as Whitebeard, as well as minor characters Chadros Higelyges, who is known as Brownbeard, and Peachbeard, a subordinate of Teach.\n*Blackbeard was an antagonist in the Belgian comics series Vieux Nick et Barbe-Noire by Marcel Remacle.\n*In Shazam! Vol 1 #27, Blackbeard was one of several historic figures villains resurrected by evil scientist Doctor Sivana to cause chaos in Pittsburgh. Another DC Comics depiction of Blackbeard appears in Modern Comics Vol 1 #72.\n*A minor character named Edward Teach appears in the Dutch comic book series Drakenbloed. In 1709 he joins the pirate crew of Captain Hannibal Meriadec who predicts that Teach would one day become a legend in his own right.\n*Appears as an antagonist in Top Cow Comics' Tales of the Witchblade #1 where he challenges Anne Bonny's crew for a treasure discovered on an island where the Witchblade was hidden. Bonny herself, who has now bonded with the Witchblade, attacks his crew and slaughters them.\nVideo games\n*Blackbeard appears in the 2004 video game ''Sid Meier's Pirates! This portrayal of Blackbeard correctly depicts him with lit cigars in his beard. However, the Queen Anne's Revenge is under the control of Henry Morgan, with a ship called the Adventurers Prize.\n*He appears as an NPC in the 2013 video game Assassin's Creed IV: Black Flag, voiced by Mark Bonnar. In the game, Blackbeard (who is always referred to as Thatch as opposed to Teach or any other aliases) is an infamous English pirate captain who sails the West Indies and the eastern seaboard of the American colonies during the early 18th century, aboard the Queen Anne's Revenge''. He aids and acts as a mentor-figure to the game's protagonist, Captain Edward Kenway, during various missions throughout the game. In this rendition, Thatch is portrayed as a fierce and short-tempered, but also warm and friendly man who seeks to protect his dream of an independent pirate republic at all costs. Through the use of acting, showmanship and stunts such as lighting fuses in his hair and growing his beard long, he has cultivated a reputation of himself as a ferocious, bloodthirsty savage to those who do not know him in order to terrify other ships into submission whilst avoiding violence. In his final appearance, Thatch holds his retirement party in North Carolina (as his former home, Nassau, Bahamas, is blockaded by the British), although it is interrupted by a British man-of-war which opens fire on the small dock that Thatch and company are celebrating on, on the grounds that Thatch has been pirating at a more active rate to fund his retirement. Edward's ship, the Jackdaw, is the only ship to survive the barrage of cannon fire, and with Edward, he subdues the man-of-war and boards it with him. However, the pirates are still outnumbered, and Thatch is shot and slashed at until his death. Edward is subsequently knocked off the man-of-war and is forced to escape. Thatch becomes a playable character in multiplayer modes with the downloadable content \"Blackbeard's Wrath\".\n*Blackbeard was a playable character in the video game Arena of Fate.\n*Blackbeard appears in Hell in Saints Row: Gat Out of Hell. He apparently wants nothing more than to rule the deserted lands near the city, and cannot move his ship as it bursts into flames on the lava surrounding the city. He assists Johnny Gat with his quest to fight The Devil, and believes the heist that would make him the absolute greatest pirate ever was his theft of Lucifer's Halo, which he sold to Dan Vogel. His missions in the game involve finding several runes and then opening a treasure chest to get an upgrade.\n*He appears as a Rider class Servant in Fate/Grand Order.\n*He appears as a boss in the video game Pirates: The Legend of Black Kat.\n*He appears in the Civilization VII expansion Tides of Power. He was added as the leader of the Pirate Republic in November 2025.\nMusic\n*Blackbeard's nickname \"Eddie Thatch\" is referenced in the first verse of \"Welcome to Tally Hall\", a song by Michigan-based band Tally Hall.\nOther media\n*In 1999, the website Snopes (which normally proves or debunks urban legends) posted a series of fabricated urban legends known as \"The Repository of Lost Legends\" (whose initials read \"TROLL\") as red herrings to test people's common sense with an outlandish story. One Lost Legend dealt with the nursery rhyme \"Sing a Song of Sixpence\" and claimed that its lyrics was a code created by Blackbeard to recruit pirates for his raids. The opening lyrics \"Sing a song of sixpence, A pocket full of rye\" purportedly referred to Blackbeard paying his pirates everyday with a Sixpence coin (a decent amount of money at the time) and a bag (\"pocket\") with whiskey (\"rye\", one of the ingredients of whiskey) to drink. Blackbeard is also said to be the \"king\" in the lyrics \"Wasn't that a dainty dish, To set before the king.\" and the lyrics immediately after, \"The king was in his counting house, Counting out his money\" which is claimed to refer to a captured ship (the \"dainty dish\") which was easily captured by pirates (the \"blackbirds\" in previous lyrics) led by Blackbeard and to Blackbeard having enough money to pay his pirates the sixpence salary regardless if they captured ships that day or not which the page claims was appealing to pirates as most captains didn't pay salaries and depended on often unsuccessful raids with pirate ships often forced to return to shore after several months due to lack of funds. Each Lost Legend linked to a page explaining that it was fictional and the reason for posting it. In 2003, an episode of the TV series Mostly True Stories?: Urban Legends Revealed used this story as a true or false question \"Was the nursery rhyme 'Sing a Song of Sixpence' used as a code to recruit pirates?\" before a commercial break but after the break, the show mistakenly claimed it was \"true\" and mentioned its supposed connection to Blackbeard, implying that they used Snopes as a source. Snopes then posted a page on their website noting that they fell for a story that was fictional and had apparently not seen the explanation. In later airings of the episode, it was corrected to say the story was \"false\" with Snopes' page on Mostly True Stories? was edited to note the correction.\n*In the anime television series Dinosaur King, Blackbeard plays a role in the second season. He is voiced by Dan Green.\n*In 2013, Blackbeard was portrayed by Nice Peter in his web series Epic Rap Battles of History, where he faces gangster Al Capone (portrayed by EpicLLOYD) in episode 35 \"Blackbeard vs Al Capone\" (aired on 21 October), in a rap battle.\n*Blackbeard, and his flagship the ''Queen Anne's Revenge, has been focus of numerous documentaries including; Journeys to the Bottom of the Sea: Blackbeard's Revenge (BBC), Real Pirates of the Caribbean (History Channel), Secrets of the Dead: Blackbeard's Lost Ship (PBS), Secrets: Blackbeard's Ship (Smithsonian Channel), the \"Pirates\" episode of Biography, Blue World - Queen Anne's Revenge: Blackbeard's Shipwreck, and Night of the Mantas (PBS) and the \"Pirate Tech\" episode of Modern Marvels.\n*In 2019, the Perth Mint issued silver and gold commemorative coins (under the authority of Tuvalu) featuring Queen Anne's Revenge'' and Blackbeard, as the first release in a new pirate-themed series.\n*Blackbeard's final battle and death in 1718 are the subject of a song by Scottish \"pirate metal\" band Alestorm, from their 2022 studio album \"Seventh Rum of a Seventh Rum.\" The song's title, however, is \"The Battle of Cape Fear River,\" which is an incorrect reference. Blackbeard was killed in battle at Ocrakoke Island, NC on 22 November, 1718; whereas the Battle of Cape Fear River was a different event that took place five days later and saw the defeat and capture of pirate captain Stede Bonnet, Blackbeard's sometime partner.\nLegislation\n*In 2015 the North Carolina Legislature passed \"Blackbeard's Law,\" N.C. Gen Stat §121-25(b), which stated, \"All  photographs,  video  recordings,  or  other  documentary  materials  of  a  derelict vessel  or  shipwreck  or  its  contents,  relics,  artifacts,  or  historic  materials  in  the  custody  of  any agency  of  North  Carolina  government  or  its  subdivisions  shall  be  a  public  record  pursuant  to Chapter  132  of  the  General  Statutes.\"\nReferences"
    }
  ]
}