{
  "content": [
    {
      "type": "text",
      "text": "# Blackboard Wars\n\n| country            = United States\n| language           = English\n| num_seasons        = 1\n| num_episodes       = 6\n| runtime            = 40–43 minutes\n| network            = Oprah Winfrey Network\n| executive_producer =\n| company            = Discovery Studios\n| first_aired        =\n| last_aired         =\n}}\nBlackboard Wars is an American reality documentary television series on the Oprah Winfrey Network that premiered on February 16, 2013, at 9/8c.\nPremise\nThe series encompasses John McDonogh High School, a school stricken with violence and failing academic performance, as they work to transform the school into the best it's been in years. Steve Barr and new principal Marvin Thompson have trained the new staff to maintain a standard for student behavior and daily attendance all the while providing a safe environment. Viewers also see challenges the staff face as their students struggle with a range of emotionally demanding obstacles which includes teenage pregnancy, gang violence, homelessness and drug abuse.\nCast\n* Dr. Marvin Thompson - Principal\n* Steve Barr - CEO of charter organization Future is Now Schools.\n* Ms. Baye Cobb - Math Teacher\n* Ms. Emily Wilcox - Math Teacher\n* Ms. Irnessa Marie Campbell - Head of the Math Department\n* Ms. Neisha Riley - Student Counselor\nEpisodes\n| ShortSummary      = Principal Dr. Marvin Thompson and his staff begin to their journey to transform one of the worst-performing high schools in the country, John McDonogh High, in New Orleans, Louisiana.\n| Viewers           = 0.61\n| LineColor         = E9C2A6\n}}\n| ShortSummary      = The staff and students return to school following the wrath of Hurricane Isaac.\n| Viewers           = 0.33\n| LineColor         = E9C2A6\n}}\n| ShortSummary      = Principal Thompson sits down with the teachers to create a resolution for the disciplinary problems with students.\n| Viewers           = 0.34\n| LineColor         = E9C2A6\n}}\n| ShortSummary      = As the students and staff prepare for the upcoming homecoming celebration, tensions rise as the community becomes resistant to the charter organization.\n| Viewers           = 0.25\n| LineColor         = E9C2A6\n}}\n| ShortSummary      = The staff come together as they receive the news that one of their students is involved in a shooting while a motivational speaker enlightens the students about creating their futures.\n| Viewers           = 0.32\n| LineColor         = E9C2A6\n}}\n| ShortSummary      = A suicidal student reaches out Principal Thompson for help. Tempers are boiling as disagreeing community activists voice their opinions about the charter school.\n| Viewers           = 0.32\n| LineColor         = E9C2A6\n}}\n}}\nAwards and nominations\n* 2013 CableFAX's Program & Top Ops Awards - Best Show or Series Documentary – Other – NOMINATION\n* 2013 CableFAX's Program & Top Ops Awards - Best Show or Series – Professions – WINNER\n* Fall 2013 CINE Golden Eagle – Televised Reality Division – Verite/Lifestyle – WINNER\n* 2014 New York Festivals TV & Film Awards – BRONZE MEDAL WINNER\nReferences\nExternal links\n*\n*"
    }
  ]
}