{
  "content": [
    {
      "type": "text",
      "text": "# Blackie and the Rodeo Kings__disambig_1\n\n–present\n| label           = True North, File Under: Music, High Or Hurtin Records\n| website         =\n| current_members = Stephen FearingColin LindenTom WilsonAccompanied By:John Dymond (Bass)Gary Craig (Drums)John Whynot (Keyboards)\n| past_members    = Richard Bell (Keyboards)\n}}\nBlackie and the Rodeo Kings are a Canadian folk rock–alternative country band with blues and country influences. The band was formed in 1996, in Hamilton, Ontario, by Tom Wilson, Stephen Fearing, and Colin Linden.\nCareer\nEarly period: 1990s\nTom Wilson (former lead singer of Junkhouse and Tom Wilson & the Florida Razors), solo artist Stephen Fearing, and guitarist and producer Colin Linden started Blackie and the Rodeo Kings as a tribute to one of their favorite Canadian folk artists, the singer-songwriter Willie P. Bennett. Their name was taken from Bennett's 1978 album Blackie and the Rodeo King. What started as a side project soon turned into a full-fledged band after their first album, ''High or Hurtin': The Songs of Willie P. Bennett, was a critical success and popular with fans of both Bennett and each individual artist. Blackie and the Rodeo Kings have released numerous full-length studio albums and received many awards and nominations. In 1999, the band recorded Kings of Love, which received a Juno Award for Best Roots & Traditional Album – Group in 2000.\nThe band originally performed at such venues as the Black Sheep Inn in Wakefield, Quebec.\n2000s\nIn 2003, the band recorded Bark. Kings of Love and Bark'' still had cover versions of Bennett's songs, but they also included some original material by the band members and cover versions of songs by Bruce Cockburn, Fred Eaglesmith and David Wiffen. In 2005, the band was included in a list published by the New York Times of songs found on President George W. Bush's iPod. In 2006, the band recorded ''Let's Frolic!, consisting of all-original material.\nIn 2008, the band were the winners of the 7th annual Independent Music Awards Vox Pop vote for best band venue poster. It was designed by Michael Wrycraft.\nIn 2009, the compilation album Swinging from the Chains of Love'' was released, which included the previously unreleased \"Caves of Jericho\" and a cover of Johnny Cash's \"Folsom Prison Blues\".\nFor their 2011 album, Kings and Queens, the band teamed up with singers Emmylou Harris, Pam Tillis, Lucinda Williams, Rosanne Cash, Cassandra Wilson, Serena Ryder and Patti Scialfa. Each of the 14 tracks featured a duet with one of the singers. The band then went out on tour in support of the album. In 2012, they performed at the Calgary Folk Music Festival.\nIn 2014, the band released the album South, which was made up of new, original songs, as well a cover of Willie P. Bennett's \"Driftin' Snow.\"\nTheir 2017 album, Kings and Kings, revisited the format of their 2011 album, Kings and Queens, this time pairing the band with different guest male vocalists. Contributing to the album were Eric Church, City and Colour, Bruce Cockburn, Rodney Crowell, Vince Gill, Jason Isbell, Nick Lowe, Raul Malo (of The Mavericks), The Men of Nashville, Buddy Miller, Keb' Mo', and Fantastic Negrito.\nAccompanying musicians\nJohn Dymond, Bassist for Blackie and the Rodeo Kings and other well-known Canadian artists, such as Amanda Wilkinson, the Wilkinsons, k.d. lang and Bruce Cockburn.\nGary Craig: Drummer and percussionist for Blackie and the Rodeo Kings. He has performed with numerous Canadian musicians, from Anne Murray to Terri Clark.\nRichard Bell (March5, 1946, TorontoJune15, 2007, Toronto): Pianist for Janis Joplin and The Band. He was the keyboardist for Blackie and the Rodeo Kings for a number of years before his death.\nJanice Powers has handled occasional keyboard duties as well as various production assistance roles on several albums, and the band has recorded several of her songs. She is also the wife of Colin Linden.\nJohn Whynot, who has played with many folk and roots artists, and who has recorded occasionally with the band since their first album now handles keyboard duties.\nDiscography\nAlbums\nStudio albums\n{| class=\"wikitable\"\n! Year\n! Album\n! Label\n|-\n| 1996\n| ''High or Hurtin': The Songs of Willie P. Bennett\n| True North\n|-\n| 1999\n| Kings of Love\n| True North\n|-\n| 2003\n| Bark\n| True North\n|-\n| 2006\n| Let's Frolic\n| True North\n|-\n| 2007\n| Let's Frolic Again\n| True North\n|-\n| 2011\n| Kings and Queens\n| File Under: Music\n|-\n| 2014\n| South\n| File Under: Music\n|-\n|2017\n|Kings and Kings\n| File Under: Music\n|-\n|2020\n|King of This Town\n| Warner Music\n|-\n|2022\n|Oh Glory\n|Warner Music Canada\n|}\nCompilation album\n{| class=\"wikitable\"\n! Year\n! Album\n! Label\n|-\n| 2009\n| Swinging from the Chains of Love\n| File Under: Music\n|-\n|}\nSingles\n{| class=\"wikitable\"\n! rowspan=\"2\"| Year\n! rowspan=\"2\"| Single\n! colspan=\"2\"| Chart Positions\n! rowspan=\"2\"| Album\n|-\n! width=\"50\"| CAN Country\n! width=\"50\"| CAN Rock\n|-\n| 1996\n| \"Lace & Pretty Flowers\"\n| align=\"center\"| 94\n|\n| rowspan=\"2\"| High or Hurtin'\n|-\n| 1997\n| \"White Line\"\n|\n|\n|-\n| rowspan=\"2\"| 1999\n| \"The Lucky Ones\"\n| align=\"center\"| 82\n|\n| rowspan=\"2\"| Kings of Love\n|-\n| \"Lean on Your Peers\"\n|\n| align=\"center\"| 19\n|-\n| rowspan=\"2\"| 2003\n| \"Swinging from the Chains of Love\"\n|\n|\n| rowspan=\"4\"| Bark''\n|-\n| \"Had Enough of You Today\"\n|\n|\n|-\n| rowspan=\"2\"| 2004\n| \"Water or Gasoline\"\n|\n|\n|-\n| \"You're So Easy to Love\"\n|\n|\n|-\n| 2006\n| \"That's What I Like\"\n|\n|\n| rowspan=\"3\"| ''Let's Frolic''\n|-\n| rowspan=\"2\"| 2007\n| \"The Fool Who Can't Forget\"\n|\n|\n|-\n| \"Buried in Your Heart\"\n|\n|\n|-\n| 2011\n| \"Got You Covered\" (with Rosanne Cash)\n|\n|\n| Kings and Queens\n|-\n| 2019\n| \"Cold 100\"\n|\n|\n| King of This Town\n|}\nContributions to other recordings\n*Borrowed Tunes II: A Tribute to Neil Young includes the band's cover version of \"Unknown Legend\". All proceeds from this album go to Safe Haven and the Bridge School.\n*Weirdsville Soundtrack features their song \"Stoned\", from the album Bark (2003).\n*''Johnny's Blues: A Tribute to Johnny Cash'' (NorthernBlues Music, 2003) includes the band's cover version of \"Folsom Prison Blues\".\n*Beautiful: A Tribute to Gordon Lightfoot includes the band's cover version of \"Summer Side of Love\".\nReferences\nExternal links\n*\n*\n*"
    }
  ]
}