{
  "content": [
    {
      "type": "text",
      "text": "# Blake Ward__disambig_2\n\n| birth_place = Yellowknife, Northwest Territories, Canada\n| education   = University of Alberta\n| occupation  = Sculptor, artist\n| spouse      = Boky Hackel-Ward\n}}\nBlake Ward (born June 3, 1956) is a Canadian-born sculptor best known for his contemporary approach to the classical figure. Contrary to the trend toward abstraction that was taught during his formal education in Canada, Ward's early work centred on the figure. Evolving through the 1990s and early 2000s into contemporary partial figures created as excerpts of the human condition. In the words of Art Critic Jacqueline Ceresoli \"Bodies in metamorphosis, balanced between apocalypse and the Postmodern, steeped in a lost Classical age, echoed through an ever-evolving Renaissance, in vibrant tension or torsion as they head toward some future utopia.\" Ward has been exhibited in France, Monaco, Italy, Germany, England, Singapore, India, Hong Kong, the United States and Canada.\nEarly life\nBlake William Ward was born on June 3, 1956, in Yellowknife, Northwest Territories. Canada and raised in Edmonton, Alberta. Born to Maxwell W. Ward (1922-2020) and Marjorie Dortha (née Skelton) Ward, (born 1923). Blake was the youngest of four children. Encouraged by his parents, his love for art developed through his travels to Europe and the United States as a young man. \"He credits his mother who he said was instrumental in exposing him to art and instilling in him this passion of creation.\" Greek sculpture seen in London and Athens remained among the most influential, followed by the works of Auguste Rodin and finally a fascination with the work of Marcel Duchamp.\nEducation\nWard attended the University of Alberta, where he studied abstract welded steel sculpture under Peter Hide, a graduate from St. Martins School of Art, London, and a student of the English sculptor Anthony Alfred Caro. Although, figurative sculpture was always the discipline of choice for Ward, it was unavailable in Canada as a field of study. Ward's University studies also included art history. He completed a summer course in Rome, which greatly influenced his artistic journey. \"I was fortunate to have had the opportunity early in life to see churches and cities covered in figurative sculpture.\"\nAfter receiving his Bachelor of Fine Arts degree, with honours in 1979, Ward worked for Wardair Canada Ltd., in the US, Mexico, England, France, Spain, Italy and briefly in Egypt and Saudi Arabia. While living in Paris, (1985 - 1989), Ward had the opportunity to delve into 18th and 19th century sculpture, earnestly studying works by Auguste Rodin, Jean-Baptiste Carpeaux, Jean-Antoine Houdon, Aimé-Jules Dalou and Aristide Maillol.\nAs a pupil of American sculptor, Cyril Heck, Ward learned a classical method of sculpting the figure that was said to have been developed by the ancient Greeks. Ward has credited Heck as the most knowledgeable teacher he had ever studied under. \"I was lucky and was able to study under an excellent teacher for four years and that was the beginning of what I can only qualify today as both a blessing and an obsession,\" Beginning in 1985 Ward spent most of his free time studying with Heck in his atelier in the 11th arrondissement of Paris.\nThe method taught by Heck emphasized the importance of proportions obtained through the measurement of the skeletal structure, and the realisation of the figure by concentrating only on the silhouette of the live model, placing each silhouette side by side in a circle. This method discouraged any abstraction insisting that the sitter is the dominant reference, above the imagination, in realising the figure in clay.\nOther influences on Ward's work are diverse, although Ward credits the most important contemporary persuasion being the sculpture of Stephen De Staebler and Antony Gormley.\nMethod, inspiration & evolution\nFor most of his career, Ward has used traditional materials and techniques, creating the original sculpture in water-based modelling clay, and producing a plaster cast of the clay model. Finally, the finished work was cast in bronze, using the lost-wax method, or alternatively hand carved in Carrera marble. \"He states that it was people that sparked his interest and continue to inspire him.\"\nDuring the early years, Ward's figurative style was formed by his academic foundation, sculpting representational figures and concentrating on the beauty of the human form. The influence on the work during this period (1990 - 2005) came from the subject matter, as political events of the time charged the artwork and inspired socio-political statements. Ward used the figure as a language to speak of a political and moral perspective, eventually focusing on the struggle for Human Rights in a series entitled ReThink Collection. The events of June 3 and 4 1989 Tiananmen Square protests and massacre, inspired the first work of this series.\nIn 2003, Ward was invited to teach figurative sculpture at the University of Hanoi. This time in Vietnam inspired the creation of the Fragments Collection (2005 - 2012), influenced by the enduring effects of explosive military waste left behind from the many wars in Vietnam. Consequently, Ward began to deliberately disfigure his completed clay figures as an expression of both tragedy and hope. Thus, this body of work became art that was meant to foster social engagement. Specific to a form of Activist Art that Ward refers to as \"Intentional Art\"; art that conveys a \"call to action\"; to lend assistance to a cause. \"I think what I'm trying to represent in my work is our tragic and violent nature. I destroy the work in order to create the fragments, and the fragments stand as symbols of hope\".\nIn 2011, Ward began to explore alternative ways to transform the figure.\nThe resulting Spirit Collection (2011–present), incorporated the idea of a \"partial figure\" explored earlier in the Fragments Collection. Early in the development of the Spirit Collection, his collaboration with conceptual artist, Beatrice (Boky) Hackel, later to become Ward's wife, materially influenced this body of work. \"…a restorer, painter, musician, photographer, performance and conceptual artist, who trained in Florence where she breathed, lived and absorbed the ‘grammar’ of the Renaissance. A polyglot, obsessed with language, she conjugates poetry and figuration resulting in an autonomous, recognizable code.\" It became a collaborative undertaking between Ward and Hackel to create a distinctive and innovative interpretation of the figure; designed to suggest our distinctive levels of consciousness and spiritual transcendence; inviting us to become aware of the mysteries that lie within and beyond ourselves. \"Blake and Boky share the body as a material extension, a fragment, mortified on the net in the digital age. We are nothing but a sum of destinies without an identity, in an infinitude of places.\"\nDeparting further from the traditional techniques of sculpting, Ward broadened his creative process by employing technology centred on the use of computer assisted design (CAD) software and 3D printing. The Andromeda Collection (2017–present) began with a year of study in 2016 to acquire the necessary skill to create this digitally enhanced work. The result is a process that permits the realization of sculptural forms that previously could only be imagined and designing elements that would be impossible to create by hand.\nNotable works, series, & collaborations\nCollaborations with Boky Hackel\nWard and Hackel began working together in 2013 as Hackel shared her knowledge and experience as a conceptual artist and an old masters painting restorer, in developing and painting the graffiti that covers many of the ReThink Collection sculptures. Ceresoli added of Hackel's contribution \"…in her experimental eclecticism…autonomous and self-aware,(Hackel) finds in sculpture a code of renewal of the intangible and the spiritual, practiced assiduously from 2013 and 2016, years of fervent study and work.\" The Spirits Collection, a series that Ward had begun earlier, also benefited from the amalgamation of the two artists’ respective methods. The freedom of her approach to building sculpture was a perfect fusion to Ward's academic style and brought about something new. Ward said \"…she wasn't concerned with the technical principles of the pour; she was fearless. I liked that energy. I watched her pour and copied her abandonment.\"\nIn acknowledgement of her contribution Ward insisted she start signing the works that they co-authored in 2014. However, this caused some difficulties and resulted in the couple stepping away from fellow associates who were not aligned with their beliefs. That incident ran counter to Ward's support for Women's rights and although they were exhibiting the co-authored sculpture as a couple, acceptance was slow to be granted. Hilton Asmus Contemporary in Chicago was the first to publicly acknowledge the couple with a joint exhibition \"Somewhere Within\" in 2019 as published in ARTNET.\".\nHackel's sculpture, Losing Myself In You (Bronze with Gold Leaf) is based on her self-portrait embodying the self-effacing position of women in our society; a strong reflection of her personal feelings working in the shadow of Ward. \"Creating in the shadow of my husband's work has been as painful for me, as working in the vast emptiness alone was for Blake.\"\nFragments collection\nFragments Collection is a series of 19, one-quarter life-size bronze figures. \"Each sculpture is named after a different type of landmine - Butterfly PFM 1, Pineapple Cluster BLU 3, Putkimiina M68 and Apple P-40.\"\nInspired by the continuing devastation left by remnants of war witnessed by Ward during his time teaching in Vietnam. Within this series Ward subverts the traditions of figurative sculpture to create an interpretation illustrating both the fragile character of beauty and man's enduring ability to survive. Through a process of de-construction, the \"shocking yet hauntingly beautiful sculptures\" portray a paradoxical vision of beauty while underlying a menacing historical reality.\nThe destruction of an artwork is a crime against art itself. It denies the principal upon which the creative spirit is based and flourishes. This defiant and desperate act has become an aesthetic endeavour within this series of sculpture. The pieces physically demonstrate the targeted demolition of the human form representing the desecration of life, with a display of disrespect for humanity that only the power of war could possibly accomplish. It exposes the coercive authority of the military and thus the state in the collateral death of civilians as an unwanted but acceptable consequence. This work is designed to cause offence in the physical representation of a disregarded, innocent and disenfranchised public.\nFragments are exclusively shown in association with organizations that aid in landmine removal and survivor support, \"No More Landmines\",  and Adopt-A-Minefield 57 was among the many organizations that endorsed this series of \"Intentional Art.\" As the sculpture became more widely exhibited they were also sold to support the Canadian Landmine Foundation, Mines Advisory Group in the UK, the Landmine Relief Fund in the United States supporting Cambodian Self Help Demining. The sale of Fragments sculptures continues to donate proceeds to these sponsoring organizations.\nIn 2007 the Fragments Collection was exhibited at the Canterbury Festival in Cathedral Chapter House, Canterbury Cathedral, Kent, England.\nReThink collection\nThe ReThink Collection explores urgent concerns; it is art filled with self-reflective interrogation, seeking to examine the context of each artwork within a specific social, cultural and political circumstance. These works speak of the fragile character of truth, comprising diverse perspectives and intimating contemplative messages revolving around the consolations of hope, justice and human rights.\nDesigned to be adversarial in nature, ReThink fuses political commentary with perspectives that challenge the ideologies and prejudice found within various societies. The artworks confront common stereotypes, inviting viewers to contemplate their perception of the issues. These provocative sculptural works challenge subjects of diverse socio-political convictions that subvert human rights and threaten modern notions of veracity, freedom and the law as an agent of social change.\nThis collection exposes certain human convictions with an aesthetic sensitivity that re-establishes a relationship between art and socio-political turmoil. Thereby creating a statement in which the value of the message resides within the ability of the viewer to question the certainty of their opinions. Using the figure as the medium to convey the message these artworks bring to light issues of concern that encourage both inquiry and tolerance.\nThe Burning Buddha sites the worlds countries where Human Rights are not granted to their citizens\nSpirit collection\nIn this body of work Ward began to explore alternative ways to transform the figure, ways not traditionally seen in bronze statuary. Typically, the interior of a bronze sculpture is never visible and rarely, if ever, had moving parts. Ward decided to open the sculpture and show the inside, as well as allowing for movement of some of the parts of the sculpture by building an independent inner structure. Ward said he wanted to take bronze figurative sculpture and \"make it everything it has never been.\"\n\"Over time a desire took Ward to develop his work into a more modern style. With these sculptures he wanted to reflect on the inner consciousness of people through the literal investigation of their ‘insides’.\" Further, Ward/Hackel address the concept of humanity within the bronze work, in a reference to Hackel's love of Renaissance Humanism; a homage to antiquity, innovation, and their exaltation of the human form. \"Imperfection is one of the wonderful parts of my work because they are terribly imperfect. I love that portion of it because it is so human and it is humanity that I am trying to address.\"\nTogether with Hackel, their combined impulse for innovation brought an alternative assessment of the figure on both an aesthetic as well as a conceptual level. Within the creative process new techniques of building and editing the figures evolved, engineered to pay homage not only to negative space itself, but give importance to the uniqueness of each individual inner core structure. This co-authored work became less concerned with the portrayal of the figure than with the idea behind the figure, and together they developed a new set of criteria physically illustrating our interior essence and complexity. \"The ‘Spirit’ collection is all about inner beauty, self-awareness and mindfulness. It relates directly to how we perceive our world. The deeper we look, the more we see.\"\nAndromeda collection\nIn Ward's most recent series of works, Andromeda Collection (2017 - present) the figure has evolved to another level of creative requirements through the use of computer aided design (CAD) software and 3D printing. This series combines the use of digital technology with traditional sculpting, in order to enhance the design of the \"open partial figure\" originally created in the Spirit Collection.\nThe process began by taking a high-resolution 3D scan of a bronze sculpture created specifically for this purpose. The resulting digital data file is then re-sculpted in the 3D sculpting software program and a central supporting structure added in. Finally, the digital files are printed employing a SLS 3D printer in a wax polymer and a lost-wax bronze cast is made in the traditional manner. The finished sculpture takes advantage of the unique capability of sculpting at a microscopic level and the freedom of being able to create a structure without having to support it during construction in cyberspace. The resulting artwork would be impossible to create by hand.\nCreating the figure using this technology changed everything about modeling the sculpture and allowed a previously inconceivable amount of freedom for the imagination. The choice to combine traditional hand-made/analogue sculptural methods with digital techniques, allowed Ward to maintain certain elements unique to the traditional materials used that were absent in the digital world of mathematics and geometry. In contrast, the development of an interior structure to serve as a central core for these sculpture became the ideal element in which to employ these new digital resources. Some of digital interior structural features designed for the Andromeda Collection also transferred over to the Spirits Collection in 2019.\nReferences\nExternal links\n* [https://vimeo.com/37466860 The Burning Buddha Video]\n* [https://vdocuments.net/the-figure-by-blake.html The Figure Catalogue online]\n* [https://www.figurativeartist.org/blake-ward/ General Showcase of work]\n* [https://www.flickr.com/photos/steveweaver/1877071857/ Canterbury Fragments live link]\n* [https://www.hrbeklaw.com/blake-ward-sculptor-art-activist.html The Interdependent]\n* [https://www.youtube.com/watch?v=ducBpBE82g4 Fragments Video]\n* [https://www.delhievents.com/2012/03/fragments-bronze-sculptures-by-blake.html Fragments New Delhi India]\n* [https://issuu.com/ukecomag/docs/fragments%20brochure-final Fragments Catalogue Issue]\n* [https://vdocuments.net/fragments-by-blake.html Fragments Catalogue]\n* [https://www.artstno.com/news/fragments-sculptures-blake-ward Fragments NWT Museum Exhibition]\n*[https://www.artoronto.ca/?p=35646 Fragments Exhibition Canadian Sculpture Centre Toronto]\n*[https://thebulletin.ca/blake-ward-sculpture-at-the-canadian-sculpture-centre/ Fragments Exhibition Canadian Sculpture Centre Toronto]\n*[https://www.1888pressrelease.com/fragments-art-and-the-explosive-remnants-of-war-sculpture-b-pr-592835.html Fragments Exhibition Canadian Sculpture Centre Toronto Press Release]\n*[https://www.sjartscentre.ca/2016-exhibitions/blake-ward/ Fragments Saint John Arts Centre]\n*[https://www.cbc.ca/player/play/2694677708 CBC Canada Fragments Saint John Arts Centre Broadcast]\n*[https://news.artnet.com/partner-content/blake-ward-and-boky-hackel-hilton-asmus Collaboration With Boky]\n*[https://www.artsy.net/show/sahar-k-boluki-gallery-evolving-identities-blake-ward-and-boky-hackel-ward?sort=partner%20show%20position General Spirit Collection Found Online Artsy Show Toronto Sahar K. Boluki Gallery 2021]\n*[https://artpriceindex.ca/artist/15932932/Blake-Ward/ Artprice Auction results]\n*[https://amymhaddad.medium.com/the-beauty-and-complexity-of-blake-wards-sculptures-8f0d8a5798f1 Hilton Asmus Chicago 2016 Spirits]\n*[https://www.artoronto.ca/?p=25662 Spirits Art Toronto]\n*[https://issuu.com/iantangallery/docs/blake_april_2013_pdf_booklet Spirits Catalogue Ian Tan Gallery]"
    }
  ]
}