{
  "content": [
    {
      "type": "text",
      "text": "# Blekinge duck\n\n|country=Sweden\n|latin=Anas platyrhynchos domesticus\n|type=Duck\n|maleweight=\n|femaleweight=\n}}\nThe Blekinge duck,, }} or the Coast Duck,, }} is Swedish breed of domestic duck.\nIt is the oldest Swedish duck breed and was rediscovered in 1994 in the Blekinge archipelago, after having been thought extinct. The breed resembles a pale mallard and is maintained today through conservation programmes in Sweden.\nHistory\nThe Blekinge duck is a traditional Swedish landrace that was long believed to have died out. In 1994, however, a small flock of two drakes and five ducks was rediscovered on Ungskär island in the outer Blekinge archipelago. The birds had been kept by a fishing family for generations, wintered in stables and released to fend largely for themselves during the summers, with only minimal feeding such as fish scraps.\nThe flock had been maintained in relative isolation and showed no signs of crossbreeding with modern domestic ducks or wild mallards, making the Blekinge duck a likely remnant of Sweden's older, unrefined domestic duck population. The breed is thought to descend directly from the half-tame mallards that were kept in Sweden from the Middle Ages onward.\nDescription\nThe Blekinge duck resembles a larger and paler variant of the wild mallard. Most individuals are wild-coloured, though entirely white ducks occasionally occur. A white neck ring is commonly present, varying in size between individuals. The bill is yellowish-green in drakes and yellow to yellow-brown in ducks, both with a distinctive black tip. The legs are orange to yellow-orange. Individual ducks are often very similar in appearance, and the shape of the black bill tip and variation in the neck ring are among the most reliable ways to distinguish them.\nFemales weigh around  and males . The breed typically lays 60–100 eggs per year, each weighing about . Eggshells range from off-white to greenish in colour. Roughly 30–50% of females will brood if provided with a quiet nesting place, incubating their eggs for about 28 days until hatching.\nStatus\nThe Blekinge duck is a local native breed from south-eastern Sweden. In the late 1990s, the population was critically small: only 55 breeding animals were registered within the Nordic Gene Bank recording system, and the total population was estimated between 100 and 1,000 individuals. At that time, the Food and Agriculture Organization (FAO) classified the breed as \"endangered\", although the population trend was considered stable.\nBy 2007, the FAO had reassessed the Blekinge duck as \"critical\". During this period, Swedish conservation programmes began to expand, with management centred on in vivo flocks supported by cryogenic storage, as well as structured pedigree and performance recording. The breed has been maintained through pure-breeding, with defined goals for preserving genetic variation; artificial insemination has not been used. Nationally, efforts are coordinated by the Swedish Poultry Organisation, which oversees the registration of flocks in the Swedish genebank system.\nBy 2012, 208 ducks were recorded across 43 registered flocks. More recent figures indicate a decline, with 153 animals reported in 2023. The breed's risk classification also varies: while DAD-IS lists it as \"not at risk\", the FAO's global survey continues to describe the Blekinge duck as \"endangered\", and the Sustainable Development Goals (SDG) indicator framework places it as \"at risk\".\nFootnotes\nReferences\nSources\n*\n*\n*\n*\n*\n*\n*\n*\n*"
    }
  ]
}