{
  "content": [
    {
      "type": "text",
      "text": "# Blizzard warning__disambig_1\n\npolice and Office of Emergency Management vehicles parked near Times Square in New York City during a 2015 blizzard warning.]]\nA blizzard warning (SAME code: BZW) is a hazardous weather statement issued by Weather Forecast Offices (WFO) of the National Weather Service (NWS) in the United States, which indicates heavy snowfall accompanied by sustained winds or frequent gusts of  or greater are forecast to occur for a minimum of three hours. A blizzard tends to reduce visibilities to  or less.\nA severe blizzard warning is a variation issued in some cases of winds above  and temperatures below . Most local weather offices will activate and broadcast the SAME alarm tone on relevant NOAA Weather Radio stations for both varieties of warning. When the Wireless Emergency Alerts system was launched in 2012, blizzard warnings were initially sent as alerts to mobile phones; this practice was discontinued in November 2013.\nIn Canada, comparable warnings are issued by Environment and Climate Change Canada through the Meteorological Service of Canada (MSC). As of 2010, blizzard warnings issued by local MSC forecast offices are based on sets of regionally determined criteria:\n* National warning below tree line – warning requires sustained winds of  or greater with widespread reductions in visibility to  or less from blowing snow or a combination of blowing and falling snow to occur at least four hours.\n* Northern (Arctic) warning above tree line – criteria are the same as national warning but for blizzard conditions forecast to occur for at least six hours.\nThe warnings are relayed by Weatheradio Canada and media outlets like The Weather Network.\nExample of a blizzard warning (US)\nThe following is an example of a blizzard warning issued by the National Weather Service Office in Duluth, Minnesota.\n028\nWWUS43 KDLH 040931\nWSWDLH\nURGENT - WINTER WEATHER MESSAGE\nNational Weather Service Duluth MN\n331 AM CST Sat Dec 4 2021\nMNZ021-042145-\n/O.UPG.KDLH.WS.A.0005.211205T0600Z-211206T1200Z/\n/O.NEW.KDLH.BZ.W.0001.211205T1100Z-211206T1200Z/\nSouthern Cook-\nIncluding the city of Grand Marais\n331 AM CST Sat Dec 4 2021\n...BLIZZARD WARNING IN EFFECT FROM 5 AM SUNDAY TO 6 AM CST\nMONDAY...\n* WHAT...Blizzard conditions expected. Total snow accumulations\nof 10 to 16 inches. Winds gusting as high as 40 mph.\n* WHERE...Southern Cook County. This includes the Tribal Lands\nof the Grand Portage Reservation.\n* WHEN...From 5 AM Sunday to 6 AM CST Monday.\n* IMPACTS...Travel could be very difficult to impossible. Patchy\nblowing snow could significantly reduce visibility.\n* ADDITIONAL DETAILS...The worst conditions should be during the\nday on Sunday.\nPRECAUTIONARY/PREPAREDNESS ACTIONS...\nTravel should be restricted to emergencies only. If you must\ntravel, have a winter survival kit with you. If you get stranded,\nstay with your vehicle.\nThe latest road conditions can be obtained by calling 5 1 1.\nRoad conditions can also be found at 511mn.org for Minnesota or\n511wi.gov for Wisconsin.\n&&\n$$\nExample of a blizzard warning (Canada)\n9:19 AM EST Monday 17 January 2022\nBlizzard warning in effect for:\nCity of Toronto\nBlizzard conditions are occurring.\nHazards:\nHazardous blizzard conditions with heavy snow and strong winds resulting in widespread near zero visibilities.\nTotal snowfall amounts of 40 to 60 cm.\nHeavy snow with peak snowfall rates of 8 to 10 cm per hour this morning.\nBlowing snow due to winds gusting up to 60 km/h.\nWhen: Now through this evening. Worst conditions expected between now until 11:00 A.M. EST.\nDiscussion: A low pressure system tracking south of the Great Lakes is currently bringing significant snowfall and blizzard conditions to the region. This will significantly impact the commute this morning.\nImpacts:\nTravel is expected to be extremely hazardous due to widespread poor visibility. Travel is expected to be very difficult or impossible due to near-zero visibility. There may be a significant impact on rush hour traffic in urban areas. There may be a significant impact on rush hour traffic in urban areas. If you become stranded in a vehicle do not leave. The vehicle offers a form of protection from the cold. A single person walking through the snow is harder to find than a stranded car or truck. If you do travel and become lost, remain where you are until the blizzard has passed. Protect yourself from wind, cold and disorientation by staying sheltered, indoors or with your vehicle.\nPlease continue to monitor alerts and forecasts issued by Environment Canada. To report severe weather, send an email to ONstorm or tweet reports using #ONStorm.\nSee also\n* Blizzard watch\n* Winter storm warning\n* Severe weather terminology (United States)\nReferences\nExternal links\n* [http://www.nws.noaa.gov/ National Weather Service]\n* [https://web.archive.org/web/20070927204433/http://weathereye.kgan.com/expert/blizzard/bliz_glossary.html Blizzard Attack: Glossary]"
    }
  ]
}