{
  "content": [
    {
      "type": "text",
      "text": "# Blood Money (Breaking Bad)\n\n| length         = 47 minutes\n| guests         = * Matt Jones as Badger Mayhew\n* Charles Baker as Skinny Pete\n* Lavell Crawford as Huell Babineaux\n* Tina Parker as Francesca Liddy\n* Cheryl Ford-Mente as Carol\n* Wayne Dehart as Homeless Man\n| prev           = Gliding Over All\n| next           = Buried\n| season_article = Breaking Bad season 5\n| episode_list   = List of Breaking Bad episodes\n}}\n\"Blood Money\" is the ninth episode of the fifth season of the American television drama series Breaking Bad, and the 55th overall episode of the series. Written by Peter Gould and directed by Bryan Cranston, it aired on AMC in the United States and Canada on August 11, 2013, as the midseason premiere.\nPlot\nIn a flashforward, a disheveled Walter White arrives at his abandoned, dilapidated, and fenced-off house. He enters and sees \"HEISENBERG\" spray-painted on the living room wall. He witnesses teenagers skateboarding in his empty pool in the backyard, and retrieves the hidden vial of ricin from his bedroom. As he leaves, he greets his former neighbor, Carol, who is shocked by his presence.\nIn the present, Hank Schrader reels from finding Gale Boetticher's handwritten dedication in Walt's copy of Leaves of Grass. Realizing that his brother-in-law was Heisenberg all along, Hank states that he is feeling unwell to excuse himself and his wife Marie from the party at Walt's house. While driving home, Hank suffers a panic attack and swerves off the road into a yard. Feigning illness to work from home, Hank reviews the DEA's case files on Heisenberg and Gus Fring, linking people, events, and circumstances, as well as matching the handwriting in the Leaves of Grass dedication with that in Gale's lab notebook, to confirm to his shock and dismay, that Walt is Heisenberg.\nWalt, who has left the meth business, discusses with Skyler White ways to expand their car wash business and launder his drug money faster. Lydia is at the car wash pleading for Walt's help, as the quality of the meth has fallen below acceptable standards since his retirement. Walt dismisses her, and Skyler firmly warns her never to come back. Walt's cancer returns, but he keeps this from his family and undergoes chemotherapy again.\nMeanwhile, Jesse Pinkman feels guilty over his role in Walt's meth business, and is particularly distraught over the deaths of Drew Sharp and Mike Ehrmantraut. He gives all the money he received from Walt to Saul Goodman and asks him to deliver half to Mike's granddaughter and the other half to Drew's parents. Saul refuses, advising it would raise suspicions, and reports this to Walt, who visits Jesse to return his money. Walt lies to Jesse, telling him that Mike is still alive and does not need help taking care of his granddaughter. Jesse is still distressed and later gives a $10,000 bundle to a homeless man. He then drives through a neighborhood, throwing bundles of cash onto front lawns.\nIn his bathroom, Walt finds his copy of Leaves of Grass missing. Alarmed by the coincidental timing of Hank's apparent illness, his suspicions are deepened when he discovers a GPS tracker on his car similar to the one Hank used while tracking Gus. He confronts Hank and asks about the tracker; an enraged Hank punches Walt and accuses him of being Heisenberg. Walt tells Hank it would be difficult to prove his allegations; in any case, Walt says his cancer has returned and would probably kill him before he could be jailed. Hank looks at Walt in disbelief, saying that he does not even know who Walt is any more. Walt menacingly replies that if this is true, then Hank should \"tread lightly\".\nProduction\nDedication\nThe episode is dedicated to Kevin Cordasco, a 16-year-old fan of Breaking Bad who had met several members of the series' cast and crew; Cordasco died earlier in 2013 from neuroblastoma.  This was the fourth dedication over the course of the series.\nReferences to other media\nIn the opening flashforward scene, Walt is seen by his former neighbor Carol, who drops a bag of oranges (which spill and roll across the ground) in fear. Some critics interpret this as a reference to The Godfather, in which oranges represent death. For example, in one scene of The Godfather, after Vito Corleone (Marlon Brando) is shot, he drops a bag of oranges, which subsequently roll across the ground.\nReferences to past episodes\nWalt's conversation with Lydia at the car wash references Walt and Gus' earlier conversations at Los Pollos Hermanos, with Walt's role being reversed. In another scene, Walt goes to the bathroom to vomit, turning the sink on to mask the noise and laying a towel down on the floor to kneel on, just as Gus had done in \"Salud\". Hank's neighbor's son's remote-controlled car (as seen in \"Seven Thirty-Seven\") also makes an appearance. The GPS tracker Hank places under Walt's car is the same one he planted on Gus' car in \"Hermanos\". When Jesse opens a pack of cigarettes in front of Huell, Huell seems to remember the ricin-filled cigarette he stole from Jesse in \"End Times\".\nReception\nRatings\nThe episode originally aired on August 11, 2013, in the United States and Canada on AMC. It aired the next day in the United Kingdom on the web streaming service Netflix. According to the Nielsen ratings system, \"Blood Money\" was watched in the United States by an estimated 5.92 million viewers, the most in series history at the time.\nReviews\nFor his performance, Norris was named \"Performer of the Week\" by TVLine.\nSeth Amitin of IGN called the episode a satisfying preparation and set-up for the endgame of the series. Amitin also praised the confrontation at the end between Walt and Hank and the tense dialogue that fueled it. \"Blood Money was an amalgamation of a bunch of little things to love.\"\nMark Berman of The Washington Post said the episode paid off plot points set up in previous episodes while simultaneously laying the groundwork for future episodes. Berman was also surprised at how much ground was covered in Hank's plotline in just one episode.\nDavid Berry of National Post called Walt and Hank's showdown abrupt, menacing and cathartic without relieving any of the tension of the storyline. He also praised the acting.\nAfter reading other critics' reviews, Alex Fletcher of Digital Spy wrote that \"['Blood Money'] exceeded the hype and reached new heights.\"\nIn 2019, The Ringer ranked \"Blood Money\" as the 21st best out of the 62 total Breaking Bad episodes.\nNotes\nReferences\nExternal links\n*[http://www.amctv.com/shows/breaking-bad/episodes/season-5/blood-money \"Blood Money\"] at the official Breaking Bad site\n*"
    }
  ]
}