{
  "content": [
    {
      "type": "text",
      "text": "# Blood Wars (card game)\n\nBlood Wars is an out-of-print collectible card game produced by TSR, based on the Planescape campaign setting from Dungeons & Dragons.\nPublication history\nThe game was released in March 1995 as part of TSR's 20th anniversary. The original release contained 334 cards in the set, sold in 15-card booster packs and two 50-card dual decks. Card art was designed by various artists, including Tony DiTerlizzi, Newt Ewell, Henry Higgenbotham, Jennell Jaquays, Dana Knutson, Rob Lazzaretti, Robin Raab, Robh Ruppel, and Dave Sutherland.\nA series of expansion sets called escalation packs were scheduled for publication.\n{| class=\"wikitable\"\n!Set !! Release date !! Cards in set !! Packaging !! Notes\n|-\n| Factols & Factions || June 1995 || 134 || 15-card booster packs ||\n|-\n| Powers & Proxies || August 1995 || 125 || 15-card booster packs ||\n|-\n| Insurgents of the Inner Plane || March 1996 || || || This set was not released.\n|-\n| Weapons & Warmongers || 1996 || || || This set was cancelled.\n|-\n| Hand of Fate || 1996 || || || This set was cancelled.\n|}\nInsurgents of the Inner Planes never materialized and was halted at the printer in February 1996.\nThe player guide ''Warlord's Tactical Manual'' was published in January 1996.\nGameplay\nPlayers use cards representing Warlords and Legions for combat to claim Battlefield cards.\nReception\nThe game was said to play \"pretty well as a multi-player game, and it's much better than TSR's Spellfire\" according to Allen Varney of The Duelist.\nReviews\n*The Duelist #5\n*Coleção Dragão Brasil\nLegacy\nBlood Wars was notable for the aggressive stance TSR took against fan websites displaying artwork from the game. The result was to suppress popularity of the game while it was still being published.  This was in contrast to Wizards of the Coast, which allowed fair use reproduction of Magic: The Gathering copyrighted images online. The collectability of its chase cards was also notable across collectible card games, especially \"The Lady of Pain.\"\nThe card game is not associated with the Blood Wars Polish online MMORPG, which is not based on Planescape.\nNotes\nReferences\nFurther reading\n*[https://archive.org/details/ScryeMagazineIssue4-February1995/page/n19/mode/2up Preview] in Scrye #4"
    }
  ]
}