{
  "content": [
    {
      "type": "text",
      "text": "# Blue King Brown\n\n–present\n| label           =\n| associated_acts = Skin\n| website         =\n| current_members = * Nattali Rize\n* Carlo Santone\n* Salvador Persico\n* Sam Cope\n* Julian Goyma\n* Cesar Rodrigues\n* Javier Fredes\n* Lea Rumwaropen\n* Petra Rumwaropen\n}}\nBlue King Brown is an Australian urban roots ensemble formed in 2003 in Byron Bay by mainstays Nattali Rize and Carlo Santone. They have released three studio albums, Stand Up (October 2006), Worldwize Part 1 – North & South (August 2010) – which reached the ARIA Albums Chart top&nbsp;50 – and Born Free (November 2014). They have toured nationally and internationally; and supported concerts by Santana, Michael Franti & Spearhead, Damian Marley, the John Butler Trio, the Cat Empire, Silverchair, Dispatch and Powderfinger.\nAfter the 2015 tour, the band ended; the musicians continued to be active in other formations. Lead singer Nattali Rize released albums in new constellations.\nHistory\nBlue King Brown were formed by Nattali Rize (lead vocals, lead guitar, co-songwriter) and Carlo Santone (bass guitar, co-songwriter) in Byron Bay in 2003 as an urban roots ensemble. As multi instrumentalists, they'd performed as percussionists on the streets for years, including with percussion group Skin featuring Greg Sheehan.\nTo complete the line up of Blue King Brown, the duo moved to Melbourne and recruited Julian Goyma (drums), Latin percussionist Salvador Persico, Sam Cope (keyboards), Cesar Rodrigues (lead guitar) with Javier Fredes regularly performing as a second percussionist. Rize recalled their sound, \"When it was me and Carlo it was just drums, very rhythmic, very percussive and that's what we love. We really brought a lot of that into Blue King Brown, which is why we feature two percussionists on the front line.\" The ensemble's line up has varied from a five-piece to an eleven-piece, and now features The Black Sistaz from West Papua on Backing Vocals.\nThe beats driven collaboration formed connections in the Australian roots scene guesting on percussion for the John Butler Trio (JBT). They have also supported performances with a number of local and international touring artists, including the Cat Empire. Peter Dawson of Diaspora Worldwide felt the group were \"a funky 5-piece roots-reggae outfit which has quickly established itself on the National touring circuit. Under Nattali and Carlo's strong direction the band has developed a strong fan base around the country.\"\nBlue King Brown's track, \"Water\", appeared on their six-track debut self-titled extended play in September 2005, and was added in high rotation on national youth radio, Triple J. Dawson described the track as \"Bright and bouncy [it] is pure funk, with [Cope]'s Rhodes piano and [Persico]'s timbales playing hit 'n' run.\" Blue King Brown won an Australian Independent Record (AIR) Award for Best Performing Single/EP in 2006. In mid-2006 they supported Michael Franti & Spearhead's tour of Australia. Santone described the music video for \"Water\", which had been made for $200, \"it was inspired from time we spent out in remote communities in central Australia where Traditional Owners of the land were being kept from their sacred sites and precious water holes.\"\nBlue King Brown issued their debut album, Stand Up, in October 2006 through their own label, Roots Level Records; in Japan it appeared on Village Again/Sideout with a bonus track. It was recorded at Big Jesus Burger Studios, Sydney with Rize and Santone co-producing; all the tracks were written by Rize including six co-written with Santone. A Triple J reviewer described the group, \"With their rootsy reggae and funk, they're currently packing out venues and are faves on the festival circuit.\" Stand Up was nominated for the J Award of 2006 and their track, \"Come and Check Your Head\", was listed at No.&nbsp;100 on the Triple J Hottest 100, 2006. In 2006, aside from performing at the Woodford Folk, East Coast International Blues & Roots Music and West Coast Blues & Roots Festivals, they also performed in Fiji and Japan. By 2008 Goyma had been replaced on drums by Peter Wilkins.\nTheir second album, Worldwize part 1 – North & South, was released in August 2010, which peaked at No.&nbsp;44 on the ARIA Albums Chart. The two discs were reviewed by Layla Clarke of The AU Review; she felt the first disc, North, showed that \"steady reggae guitar and drums form the base for the weaving of vocals, brass, strings, piano, and other percussion to create the sounds that make up an individual song.\" The second disc, South, was a set of \"dub tracks\" which were \"more instrumental and [the disc] is a worthy companion to the first.\"\nAt the ARIA Music Awards of 2011 it was nominated for Best Blues and Roots Album.\nTheir third album, Born Free (November 2014) had been partially recorded in Kingston's Tuff Gong Studios. AllMusic's Steve Leggett opined that it \"finds the band in full passionate flight, delivering contemporary reggae that sounds urgent, necessary, and vital\" with the group \"quickly becoming a force on the international jam band urban roots scene, mixing reggae with Afro-beat and Latin rhythms and layering them beneath lyrics that cry out for positive social change.\"\nIn January 2015 Blue King Brown toured Australia to promote Born Free with the line up of Cope, Fredes, Persico, Rize, Rodriques, Lea and Petra, and Santone. Bobby Goudie of The Clothesline caught their performance at The Gov, \"They get their audience grooving and absorbed with their up-beat tunes and messages of hope, peace and standing up to oppression around the world... [and are] a skilled, experienced band that has been spreading their ideas and conscious music for over 10 years. Enjoyment is not solely based on how many of the songs you recognise or can sing along to. They are an incredibly accessible live band to people who don’t know their music as it evokes so much hopeful energy and cool grooves.\"\nMembers\n* Nattali Rize – vocals, guitar, percussion (2003–present)\n* Carlo Santone – bass guitar, percussion, backing vocals (2003–present)\n* Salvador Persico – percussion, timbales (2005–present)\n* Julian Goyma – drums (2005–preset)\n* Sam Cope – keyboards, piano, organ, synthesiser (2005–present)\n* Cesar Rodrigues – guitar (2005–present)\n* Javier Fredes – percussion, congas (2005–present)\n* Damien Lines – synthesiser\n* Lea Rumwaropen – backing vocals (2013–present)\n* Petra Rumwaropen – backing vocals (2013–present)\nDiscography\nStudio albums\n{| class=\"wikitable plainrowheaders\" style=\"text-align:center;\" border=\"1\"\n! scope=\"col\" rowspan=\"2\" style=\"width:16em;\"| Title\n! scope=\"col\" rowspan=\"2\" style=\"width:17em;\"| Details\n! scope=\"col\" colspan=\"1\" | Peak chart positions\n|-\n! scope=\"col\" style=\"width:3em;font-size:90%;\" | AUS\n|-\n! scope=\"row\"| Stand Up\n|\n* Released: 14 October 2006\n* Label: Roots Level Records (bkb 002)\n* Format: CD, digital download\n| -\n|-\n! scope=\"row\"| Worldwize Part 1 North & South\n|\n* Released: 20 August 2010\n* Label: Lion House Records (bib 007)\n* Format: CD, digital download\n| 44\n|-\n! scope=\"row\"| Born Free\n|\n* Released: 7 November 2014\n* Label: Lion House Records\n* Format: CD, digital download\n| -\n|}\nExtended plays\n{| class=\"wikitable plainrowheaders\" style=\"text-align:center;\" border=\"1\"\n! scope=\"col\" style=\"width:11em;\"| Title\n! scope=\"col\" style=\"width:19em;\"| Details\n|-\n! scope=\"row\"| Blue King Brown\n|\n* Released: 12 September 2005\n* Label: Roots Level Records (bkb 001)\n* Format: CD, digital download\n|}\nAwards and nominations\nAIR Awards\nThe Australian Independent Record Awards (commonly known informally as AIR Awards) is an annual awards night to recognise, promote and celebrate the success of Australia's Independent Music sector.\n|-\n| rowspan=\"2\" | 2006\n|Blue King Brown\n| Best Performing Independent Single / EP\n|\n|-\n| themselves\n| Most Outstanding New Talent\n|\n|-\n| rowspan=\"2\" | 2007\n| rowspan=\"2\" |Blue King Brown\n| Best Performing Independent Album\n|\n|-\n| Best Independent Blues and Roots Album\n|\n|-\n| 2011\n| Worldwize (Part 1, The North and South)\n| Best Independent Blues and Roots Album\n|\n|-\nAPRA Awards\nThe APRA Awards are presented annually from 1982 by the Australasian Performing Right Association (APRA), \"honouring composers and songwriters\". They commenced in 1982.\n!\n|-\n| 2015\n| \"All Nations\" (Natalie Pa'apa’'a & Carlo Santone)\n| Song of the Year\n|\n|\n|-\nARIA Music Awards\nThe ARIA Music Awards is an annual awards ceremony that recognises excellence, innovation, and achievement across all genres of Australian music.\n|-\n| 2011\n|Worldwize Part 1 North & South\n| Best Blues & Roots Album\n|\nJ Award\nThe J Awards are an annual series of Australian music awards that were established by the Australian Broadcasting Corporation's youth-focused radio station Triple J. They commenced in 2005.\n|-\n| 2006\n|Stand Up\n| Australian Album of the Year\n|\nReferences\nExternal links\n*\n*\n* [https://web.archive.org/web/20061011180258/http://www.amo.org.au/artist.asp?id=4361 Blue King Brown] at Australian Music Online"
    }
  ]
}