{
  "content": [
    {
      "type": "text",
      "text": "# Blue Stockings Society\n\n. The sitters are: Anna Letitia Barbauld (1743–1825), poet and writer; Elizabeth Carter (1717–1806), scholar and writer; Elizabeth Griffith (1727–1793), playwright and novelist; Angelica Kauffmann (1741–1807), painter; Charlotte Lennox (1720–1804), writer; Catharine Macaulay (1731–1791), historian and political polemicist; Elizabeth Montagu (1718–1800); Hannah More (1745–1833), religious writer; and Elizabeth Ann Sheridan (née Linley).]]\nThe Blue Stockings Society was an informal women's social and educational movement in England in the mid-18th century that emphasised education and mutual cooperation. It was founded in the early 1750s by Elizabeth Montagu, Elizabeth Vesey and others as a literary discussion group, a step away from traditional, non-intellectual women's activities. Both men and women were invited to attend, including the botanist, translator and publisher Benjamin Stillingfleet, who, due to his financial standing, did not dress for the occasion as formally as was customary and deemed “proper”, in consequence appearing in everyday, blue worsted stockings.\nThe society gave rise to the term “bluestocking”,  referred to the informal quality of the gatherings and the emphasis on conversation rather than fashion,  and, by the 1770s, came to describe learned women in general.\nHistory\n, Bath, was used as a residence and to host Blue Stockings Society events by Elizabeth Montagu]]\nThe Blue Stockings Society of England emerged in about 1750, and waned in popularity at the end of the 18th century. It was a loose organization of privileged women with an interest in education to gather together to discuss literature while inviting educated men to participate. Led and hosted by  Elizabeth Montagu and Elizabeth Vesey, the women involved in this group generally had more education and fewer children than most Englishwomen of the time. During this period, only men attended universities, whereas women were expected to master skills such as needlework and knitting: it was considered “unbecoming” for them to know Greek or Latin, almost immodest for them to be authors, and certainly indiscreet to admit the fact. Anna Laetitia Barbauld, a member of the club, was merely the echo of popular sentiment, contrary to the general opinion of the Blue Stockings, when she protested that women did not want colleges. She wrote, “The best way for a woman to acquire knowledge is from conversation with a father, or brother, or friend.” However, by the early 1800s, this sentiment had changed, and it was more common to question “why a woman of forty should be more ignorant than a boy of twelve”, which coincided with the waning of the Blue Stockings’ popularity.\nSatiric drawing by Thomas Rowlandson (1756–1827), Breaking Up of the Blue Stocking Club (1815)\nThe group has been described by many historians and authors (such as Jeanine Dobbs) as “having preserved and advanced feminism” via the advocacy for women's education and the social complaints regarding women's status and lifestyle in their society, as seen and exemplified in the writings of the Blue Stockings women themselves:\nThe name “Blue Stockings Society” and its origins are highly disputed among historians. There are scattered early references to bluestockings including in the 15th-century Della Calza society in Venice, John Amos Comenius in 1638, and the 17th-century Covenanters in Scotland. The society's name perhaps derived from the European fashion in the mid–18th century in which black stockings were worn in formal dress, while blue stockings were daytime or more casual wear, emphasizing the informal nature of the club’s gatherings. Blue stockings were furthermore very fashionable for women in Paris at the time. Alternatively, many historians claim the term for the society was coined when Elizabeth Vesey first advised Benjamin Stillingfleet, the aforementioned learned gentleman who had distanced himself from higher society and did not have clothes suitable for an evening party, to “come in [his] blue stockings”. Stillingfleet became a frequent and popular guest at the Blue Stockings Society gatherings.\nThere are several sources linking Stillingfleet to the blue stocking appellation. Samuel Torriano uses the sobriquet blew stocking for Stillingfleet in 1756 and Elizabeth Montagu refers to his blue stockings in 1757.\nThis letter also suggests that by that time he may have stopped attending her soirees. He died in 1771 and in 1881 Samuel Johnson has to remind his friends of the origin of the Blue-Stocking Club name and the role of Stillingfleet.\nLater Admiral Boscawen and Mrs Vesey. would separately be credited with the first mention of the name.\nPurpose\nThe Blue Stockings Society had no membership formalities nor fees, and conducted small to large gatherings in which talk of politics was prohibited but literature and the arts were of main discussion. Learned women with interest in these educational discussions attended as well as invited male guests. Tea, biscuits and other light refreshments would be served to guests by the hostesses.\nThe New York Times published an article on 17 April 1881, a century after the events in question, which describes the Blue Stockings Society as a women's movement combatting the “vice” and “passion” of gambling, the main form of entertainment at higher society parties. “Instead however, of following the fashion, Mrs. Montagu and a few friends Mrs. Boscawen and Mrs. Vesey, who like herself, were untainted by this wolfish passion, resolved to make a stand against the universal tyranny of a custom which absorbed the life and leisure of the rich to the exclusion of all intellectual enjoyment... and to found a society in which conversation should supersede cards.”\nMany of the Blue Stockings women supported each other in intellectual endeavours such as reading, artwork, and writing. Many also published literature. For example, author Elizabeth Carter (1717–1806) was a Blue Stockings Society advocate and member who published essays and poetry, and translated the works of Epictetus. Literature professor Anna Miegon compiled biographical sketches of these women in her Biographical Sketches of Principal Bluestocking Women.\n*Henrietta Maria Bowdler\n*Edmund Burke\n*Frances Burney\n*Elizabeth Carter\n*Margaret Cavendish-Harley, Duchess of Portland\n*Hester Chapone\n*Mary Delany\n*Sarah Fielding\n*David Garrick\n*Samuel Johnson\n*Catharine Macaulay\n*Elizabeth Montagu\n*Hannah More\n*Amelia Opie\n*William Pulteney, 1st Earl of Bath\n*Clara Reeve\n*Sarah Scott\n*Sir Joshua Reynolds\n*Catherine Talbot\n*Hester Thrale\n*Elizabeth Vesey\n*Horace Walpole, 4th Earl of Orford\n*Anna Williams\n*Mary Wollstonecraft\n}}\nModern play\nLadies, a play by Kit Steinkellner, is a fictional account of four members of the Blue Stockings Society, and their impact on modern-day feminism. It had its world première at Boston Court Pasadena in Pasadena, California in June 2019, with direction by Jessica Kubzansky.\nReferences\nFurther reading\n;Primary Sources\n*Kelly, Gary. Bluestocking Feminism: Writings of the Bluestocking Circle, 1738–1790. London: Pickering & Chatto, 1999.\n;Studies\n*Clarke, Norma. The Rise and Fall of the Woman of Letters. London: Pimlico, 2004.\n*Eger, Elizabeth. Bluestockings Displayed: Portraiture, Performance and Patronage, 1730–1830. New York: Cambridge University Press, 2013.\n*Eger, Elizabeth. Bluestockings: Women of Reason from Enlightenment to Romanticism. Basingstoke: Palgrave Macmillan, 2012.\n*Eger, Elizabeth. Brilliant Women: 18th-Century Bluestockings. New Haven, Ct.: Yale University Press, 2008.\n*Gibson, Susannah. ''The Bluestockings: A History of the First Women's Movement. London / New York: Hachette / Norton, 2024.\n*Johns, Alesa. Bluestocking Feminism and British-German Cultural Transfer, 1750–1837. Ann Arbor: The University of Michigan Press, 2014.\n*Myers, Sylvia Harcstark. The Bluestocking Circle: Women, Friendship, and the Life of the Mind in Eighteenth-Century England. New York: Oxford University Press, 1990.\n*Pohl, Nicole and Betty A. Schellenberg. Reconsidering the Bluestockings. San Marino, Calif.: Huntington Library Press, 2004.\n*Tinker, Chauncey Brewster. \"The Bluestocking Club\". The Salon and English Letters''. New York: The MacMillan Company, 1915. 123–183. at [https://openlibrary.org/books/OL13498264M/The_salon_and_English_letters Open Library]\nExternal links\n*[http://www.bbc.co.uk/programmes/b045c0h9 In Our Time The Bluestockings]\n*[https://web.archive.org/web/20141220013228/http://www.katelynludwig.com/masters/ Reinventing the Feminine: Bluestocking Women Writers in 18th Century London]\n*[http://www.worldwidewords.org/topicalwords/tw-blu1.htm Details on origin of term] at World Wide Words\n*[http://www.faculty.umb.edu/elizabeth_fay/archive2.html Bluestocking Archive]\n*[http://www.bartleby.com/221/1502.html Mrs. Vesey, Cambridge History of English and American Literature]\n*[http://www.npg.org.uk/live/wobrilliantwomen.asp Brilliant Women exhibition] at the National Portrait Gallery\n*[https://www.newyorker.com/magazine/2024/07/22/the-bluestockings-susannah-gibson-book-review Essay, as review of Susannah Gibson's book] by Margaret Talbot in the New Yorker, July 22, 2024"
    }
  ]
}