{
  "content": [
    {
      "type": "text",
      "text": "# Bluewater, Queensland\n\n| local_map           = yes\n| zoom                = 10\n| pop                 = 1085\n| pop_year            =\n| pop_footnotes       =\n| established         =\n| postcode            = 4818\n| area                = 87.3\n| timezone            = AEST\n| utc                 = +10:00\n| dist1               = 16.9\n| dir1                = NW\n| location1           = Deeragun\n| dist2               = 32.8\n| dir2                = WNW\n| location2           = Townsville CBD\n| dist3               = 1363\n| dir3                = NNW\n| location3           = Brisbane\n| dist4               =\n| dir4                =\n| location4           =\n| lga                 = City of Townsville\n| stategov            = Thuringowa\n| fedgov              = Herbert\n| near-n              = Coral Sea\n| near-ne             = Toolakea\n| near-e              = Coral SeaSaunders Beach\n| near-se             = YabuluBlack River\n| near-s              = Lynam\n| near-sw             = Bluewater Park\n| near-w              = Clemant\n| near-nw             = Clemant\n}}\nBluewater is a town and coastal suburb in the City of Townsville, Queensland, Australia. In the , the suburb of Bluewater had a population of 1,085 people.\nThe coastal town of Bluewater Beach is also within the suburb.\nGeography\nThe suburb of Bluewater is approximately  by road north-west of Townsville CBD. It is bounded to the south-east by Althaus Creek ().\nAs its name suggests, the town of Bluewater Beach is on the coast of the Coral Sea, while the town of Bluewater is inland on the Bruce Highway, which enters the locality from south-east (Yabulu) and exits to the north-west (Clemant).\nThe suburb is popular with residents who prefer larger lot sizes and is home to a number of properties with hobby farms and horse agistment. It is also home to solar farms.\nHistory\nBluewater is situated in the traditional Nyawigi Aboriginal country. The origin of the suburb name Bluewater is from the adjacent Bluewater Creek that was shown on a district map from 1886.\nBluewater was settled in the late nineteenth century, and was close to the Purono rail siding, constructed in 1919 on the extension of the North Coast railway line from Townsville to Ingham.  During World War II, Bluewater became campground to a number of service personnel whose responsibility it was to resist Japanese invasion.\nIt was not until 1946 that land was first subdivided along Bluewater Beach, followed by subdivisions of Toolakea Beach and the Bluewater Township in the 1950s.\nBluewater Provisional School opened on 3 June 1957.In 1958 it was renamed Bluewater Creek Provisional School. In 1959 it became Bluewater Creek State School. In 1960 it was renamed Bluewater State School.\nBluewater Post Office opened by May 1960.\nThe community was badly flooded on 31 January 2019. The wet weather and consequent flooding was expected to continue for another week.\nDemographics\nIn the , the suburb of Bluewater had a population of 1,040 people.\nIn the , the suburb of Bluewater had a population of 1,085 people.\nThe census data  includes the population of neighbouring Blue Hills which is not separately reported.\nEducation\nBluewater State School is a government primary (Prep-6) school for boys and girls at 1-3 Ditton Street with its entrance on Buckby Street (). In 2018, the school had an enrolment of 438 students with 32 teachers (30 full-time equivalent) and 22 non-teaching staff (12 full-time equivalent).\nThere is no secondary school in Bluewater. The nearest government secondary school is Northern Beaches State High School in Deeragun to the south-east.\nAmenities\nThe Townsville City Council operate a mobile library service which visits the Community Centre at Bluewater on Monday afternoons.\nThere is a boat ramp at Bluewater Road on the north bank of Althaus Creek (). It is managed by the Townsville City Council.\nOther amenities in the area include a Girl Guides training and camping centre.\nThere is a waste transfer station towards the end of Bluewater Drive.\nAttractions\nBluewater Park is a popular tourist destination with designated free campsites.\nReferences\nExternal links\n*\n*"
    }
  ]
}