{
  "content": [
    {
      "type": "text",
      "text": "# Blues and Greens in the Byzantine Empire\n\nThe Blues () and the Greens () were the dominant two of the four demes in the Byzantine Empire. The other two were the Whites () and the Reds (), who cooperated with the Blues and the Greens respectively. Beginning in the days of Augustus as chariot racing factions, the colour divisions gradually covered other aspects of daily life such as theatre, and by the fifth century they became more akin to political parties.\nBetween the 5th and 8th centuries, the demes grew so powerful that they participated in the political and religious conflicts of the time, terrorised the city with their frequent riots, had their own official militias, made and unmade emperors, and were sometimes called on by the emperors for tasks like repelling invasions and repairing the city walls. Entire neighbourhoods and guilds were described as pro-Blue or pro-Green. Theodore Balsamon, in his commentary on the Council in Trullo, noted that even the emperor had no authority over the demes. However, beginning in the 7th century, the demes gradually weakened and became integrated into the imperial government.\nEtymology\nThe factions were referred to in Greek using the word  (plural ), which meant \"people\". There are two different opinions in scholarship about how the word for \"people\" came to also mean \"circus factions\". One position, that of Alan Cameron, is that it was a calque of the Latin , which meant both \"people\" and \"members of a guild\". Another view, espoused by Constantin Zuckerman, is that both senses of the word  (people and circus factions) actually referred to a specific class of citizens, who were entitled to public distributions of grain and who had an interest in public entertainment such as chariot racing.\nAnother, more technical word for the factions was .\nHistory\nillustrating a chariot race with the four factions: Blue, Green, Red and White]]\nOrigins\nThe origins of the demes lie in the Roman Republic, when certain individuals known as  would hire out horses and other necessary equipment and personnel to the agonothetes, who organised the chariot racing games. According to Tertullian, there were originally only Reds and Whites, but the Blues, Greens, Reds and Whites were established by the first century AD. The majority of the  were equites, and it concerned the senators that people of a lower class than them could earn so much wealth and power through the horse breeding industry. By the fourth century, the industry had been nationalised.\nA more fanciful origin story of the demes is given by John Malalas, who says that, when Romulus saw that the Romans \"were angry and resistant to him on account of his brother's death\", he invented the factions to divide them against each other. \"So the inhabitants of Rome were divided into factions, and no longer were in concord with each other, because they desired their own victory and devoted themselves to their faction as to some religion\". This myth, or a version of it, appears in several other chronicles, and in the writings of Isidore of Pelusium, who speaks of the demes as a political machination.\nIt is commonly assumed that the Blues, Greens, Reds and Whites were equal once, but that the Blues and Greens slowly grew to dominate the Reds and Whites. However, from as early as the Julio-Claudians, every emperor whose favourite deme is known supported either the Blues (e.g. Vitellius, Caracalla) or the Greens (e.g. Caligula, Nero, Domitian, Lucius Verus, Commodus, Elagabalus). Marcus Aurelius stated that he was \"neither Blue nor Green\". From such evidence, some historians argue that the circus faction rivalry had always been between the Blues and Greens.\nHeight\nDespite beginning as mere sports fanclubs, the demes became involved with the political and even religious disputes of the time. In the Chalcedonian Schism, the Blues generally aligned with the Chalcedonians and the Greens with the non-Chalcedonians. Chrysaphius and Theodosius II, who convened the Second Council of Ephesus, both supported the Greens, while Marcian, who convened the opposing Council of Chalcedon, supported the Blues. However, this was not a solid rule, as there were many Chalcedonian Greens (like Maurice) and non-Chalcedonian Blues (like Theodora).\nCertain neighbourhoods (like Zeugma, now ) were known to be pro-Green, and others (like Pittakia) were known to be pro-Blue. The Greens tended to be more working-class than the Blues, and were better represented among craftsmen, artisans, port-workers and countryfolk. Meanwhile, the Blues were better represented among elites and government officials, as well as the Jews. During the Nika Riots, a leader of the Greens sarcastically told Justinian that he did not know where the palace and government offices were.\nAfter the death of Anastasius I Dicorus in 518, the excubitors hoped to make a man named John the next emperor, but were unable to because the Blues disapproved. Later, the Greens blocked Germanus's imperial ambitions on account of his favouritism towards the Blues. These incidents illustrate the growing power of the demes.\nThe Nika Riots in 532 are the deadliest and most famous of the many riots caused by the demes, but there were also other times when the Blues and Greens put aside their differences and united against the government. John Malalas records another incident,}} in which the city prefect Zemarchus tried to arrest a young man from the Greens named Kaisarion, but for two days the Greens and Blues battled the imperial soldiers to protect him. Despite Justinian repeatedly sending excubitors as reinforcements, and all sides suffering heavy casualties, the Greens and Blues managed to push the soldiers to the Forum of Constantine, the Forum of Theodosius, and finally the praetorium. Justinian eventually pardoned them and dismissed Zemarchus.\nin Alexandria. 6th century graffiti on the seats shows support for the Blues and Greens.]]\nThe demes caused disturbances not only in Constantinople, but as far away as Syria and Egypt. For example, according to John Malalas, in 490 the Greens started a pogrom and massacred the Jewish population of Antioch, until Theodore, the Prefect of the East, suppressed them. When Emperor Zeno, who was a supporter of the Greens, heard of it, he joked \"Why did you burn only the dead Jews? It was necessary to burn the living Jews as well.\" On another occasion, the Greens and Blues () in Antioch rose up with the Judeo-Samaritan revolt of Julianus ben Sabar in 529, and killed their fellow Christians. The Egyptian chronicler John of Nikiu wrote about the chaos caused by the demes in Egypt, such as the Aykelah revolt, while the monk Strategius complained that the Blues and Greens in Jerusalem were fighting each other and plundering Christians.\n(c. 500)]]\nThe demes had their own militias, the demotai (), with an official registry (). The militias had a small nucleus of registered members (in 602, there were 900 Blues and Whites, and 1500 Greens and Reds) but could mobilise many more in times of need. On several occasions, they helped repair the Walls of Constantinople. When the walls were damaged by an earthquake on 26 January 447, the Blues and Greens supplied 16,000 men between them for the rebuilding effort, and restored the walls in a record 60 days. The gate now known as  was once called , or \"Gate of the Reds\". According to , it was named so because it was built by the Reds.\nThe militias sometimes also helped the government repel foreign invasions. Theophanes the Confessor reports that, when Zabergan crossed the Anastasian Walls in 559, Belisarius drove him away using the imperial cavalry, the horses of all the citizens, and the horses of the Hippodrome. ()}} The demotai similarly helped defend Constantinople when it was besieged in 626. Another example of the demotai being recruited by the government occurs in the chronicle of John of Antioch. During the Heraclian revolt in 610, when Phocas saw the fleet of Heraclius on the horizon, he ordered the Greens to guard the Harbours of Caesarion and Sophia, and the Blues to guard the quarter of Hormisdas. Heraclius later had the banner of the Blues burned in the Hippodrome to shame them for their treason.\nDecline\n, a 10th-century Byzantine silk tapestry depicting John I Tzimiskes being greeted by the Blues and Greens at a triumph]]\nBeginning in the 7th century, the demes gradually became official. The first mention of both demarchs (official leaders of a deme) and of an official registry of Blues and Greens dates back to 602, and occurs in the History of Theophylact Simocatta. A certain John Crucis was appointed by Maurice as the leader of the Greens; he started a riot}} and was later burned alive by Phocas, for which the Greens retaliated by setting fire to the praetorium''. John of Nikiu also names two demarchs who were active in Egypt during the Siege of Babylon Fortress in 640: Menas, the leader of the Greens, and Cosmas the son of Samuel, the leader of the Blues.\nIn later centuries, the demes, whose leaders were appointed by the government, came to be subordinate to it. By 899, when the  was written, only the Blues and Greens still existed. They separated further into those \"of the city\" (·, ), under a , and the \"suburban\" (, ), under a , a role which was entrusted to senior military officials: the Domestic of the Schools for the Blues, and the Domestic of the Excubitors for the Greens. Their salaries were paid by the praipositos, and they had dedicated places in the Hippodrome, in the Great Palace and in imperial processions.\nThe poems of Theodore Prodromos indicate that the demes were still performing ceremonial functions in the 12th century. But the official use of the title of  (usually in conjunction with another office like  or ) continued even after the demes themselves disappeared. The  served as military commanders during the Fall of Constantinople in 1453.\nModern parallels\nThe Blues and Greens are often compared to modern-day football hooligans. The Internet Medieval Sourcebook noted some similarities to the rivalry between Glasgow's two Old Firm football clubs: Celtic and Rangers. Celtic fans wear green to support their team, while Rangers fans wear blue. Their rivalry had religious and political aspects, with Celtics fans being generally Catholic and voting Labour, and Rangers fans being Protestant and voting Conservative.\nNotes\nReferences\nSources\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*"
    }
  ]
}