{
  "content": [
    {
      "type": "text",
      "text": "# Bluestocking\n\n]]\nBluestocking (also spaced blue-stocking or blue stockings) is a term for an educated, intellectual woman, originally a member of the 18th-century Blue Stockings Society from England led by the hostess and critic Elizabeth Montagu (1718–1800), the “Queen of the Blues”, including Elizabeth Vesey (1715–1791), Hester Chapone (1727–1801) and the classicist Elizabeth Carter (1717–1806). In the following generation came Hester Lynch Piozzi (1741–1821), Hannah More (1745–1833) and Frances Burney (1752–1840). The term now more broadly applies to women who show interest in literary or intellectual matters.\nUntil the late 18th century, the term had referred to learned people of both sexes. It was later applied primarily to intellectual women and the French equivalent bas bleu had a similar connotation. The term later developed negative implications and is now often used in a derogatory manner. The reference to blue stockings may arise from the time when woollen worsted stockings were informal dress, in contrast to formal, fashionable black silk stockings. The most frequent such reference is to a man, Benjamin Stillingfleet, who reportedly lacked the formal black stockings, yet participated in the Blue Stockings Society. As Frances Burney, a Bluestocking, recounts the events, she reveals that Stillingfleet was invited to a literary meeting by Elizabeth Vesey but was told off because of his informal attire. Her response was “don’t mind dress! Come in your blue stockings!”.\nHistory\nThe Blue Stockings Society was a literary society led by Elizabeth Montagu and others in the 1750s in England. Elizabeth Montagu was a social anomaly in the period because she took possession of her husband’s property when he died, allowing her to have more power in her world. This society was founded by women, and included many prominent members of English society, both male and female, including Harriet Bowdler, Edmund Burke, Sarah Fielding, Samuel Johnson, and Frances Pulteney. M.P., an 1811 comic opera by Thomas Moore and Charles Edward Horn, was subtitled The Blue Stocking. It contained a character, Lady Bab Blue, who was a parody of bluestockings.\nA reference to bluestockings has been attributed to John Amos Comenius in his 1638 book, where he mentioned ancient traditions of women being excluded from higher education, citing the Bible and Euripides. That second reference, though, comes from Keatinge's 1896 translation and is not present in Comenius's Latin text.}} The name may have been applied in the 15th century to the blue stockings worn by the members of the Compagnie della Calza in Venice, which then was adopted in Paris and London; in the 17th century to the Covenanters in Scotland, who wore unbleached woollen stockings, in contrast to the bleached or dyed stockings of the more affluent. In 1870 Henry D. Wheatley noted that Elizabeth Montagu’s coterie were named “blue stockings” after the blue worsted stockings worn by the naturalist Benjamin Stillingfleet.\nWilliam Hazlitt said, “The bluestocking is the most odious character in society...she sinks wherever she is placed, like the yolk of an egg, to the bottom, and carries the filth with her”.\nRecent use\nIn Japan, a literary magazine Seitō (Bluestocking) was launched in 1911 under the leadership of Raichō Hiratsuka. It ran until 1916, providing a creative outlet and political platform for Japanese feminists even as it faced public outcry and state censorship.\nThe Toledo Blue Stockings was a major league baseball team in Toledo, Ohio, from 1883 to 1885. Historically, the team is best known for being the only major league team with black players (Moses Fleetwood Walker and his brother, Weldy) until Jackie Robinson's appearance with the Brooklyn Dodgers in 1947.\nBluestockings is the name of a volunteer-run and collectively owned radical bookstore, fair-trade café, and activist center located on the Lower East Side of Manhattan, New York City, which opened in 1999.\nThe Bluestocking is the yearbook of Mary Baldwin College, a traditionally all-women’s school in Staunton, Virginia.\nBlue Stocking was an “unabashedly feminist\" (its tagline) newspaper published in Portland, Oregon, from 1993 to 1996.\nThe radical feminist group Redstockings, founded in 1969, takes its name from bluestockings as a term to disparage intellectual women, and red for its association with the revolutionary left.\nFounded in 2008 at Oxford University, [https://blue-stocking.org.uk/ Bluestocking Oxford] is a feminist magazine that publishes fortnightly profiles on women's intellectual and artistic achievements throughout history. The magazine was revived in 2023 and it has since expanded to host intellectual discussion events in a traditional salon format at Christ Church. Since 2024 the Editor in Chief has been [https://www.english.ox.ac.uk/people/olivia-hurton Olivia Hurton], author, poet and London theatre critic, who has edited the letters of original Bluestocking hostess, Elizabeth Montagu. The magazine's patron is renowned historian Lady Antonia Fraser.\nNotes\nReferences\nFurther reading\n* Burns, William E. \"Bluestockings 18th and 19th centuries\" in ''Reader's Guide to British History  (2003). [http://www.credoreference.com/entry/routbrithistory/bluestockings_18th_and_19th_centuries online]\n* Heller, Deborah. \"The Bluestockings and Virtue Friendship: Elizabeth Montagu, Anne Pitt, and Elizabeth Carter.\" Huntington Library Quarterly, vol. 81 no. 4, 2018, p.&nbsp;469-496.\n* Demers, Patricia. The World of Hannah More (University of Kentucky Press, 1996)\n* Myers, Sylvia Harcstark. The Bluestocking Circle: Women, Friendship and the Life of the Mind in Eighteenth-Century England (Oxford University Press, 1990)\n* Robinson, Jane. Bluestockings: The Remarkable Story of the First Women to Fight for an Education'' (Penguin, 2010)\n*  full text online\n*"
    }
  ]
}