{
  "content": [
    {
      "type": "text",
      "text": "# BNU (software)\n\nBNU is a high-performance communications device driver designed to provide enhanced support for serial port communications. The BNU serial port driver was specifically targeted for use with early (late 1980s - 1990s) DOS-based BBS software. The reason for BNU and other similar enhanced serial port drivers was to provide better support for serial communications software than what was offered by the machine's BIOS and/or DOS being used on the machine. Having serial port support as provided by BNU and other similar drivers allowed the communications software programmers to spend more time on the actual applications instead of the depths and details of how to talk to the serial ports and the modems connected to them. Sending communications data across a modem link was a lot more involved than sending data to a serial printer which was basically all that was originally capable of being done with the existing serial port software support.\nBNU was written by David Nugent as an experimental driver for serial communications following the FOSSIL specification. David released BNU to the public in 1989 and its use in the BBS world spread rapidly. BNU was one of only two or three available FOSSIL drivers for the IBM PC compatible hardware and MS-DOS/PC DOS operating system. Because of this, BNU has been one of the most widely used MS-DOS FOSSIL communications drivers.\nBNU was mainly used with DOS-based Bulletin Board System (BBS) software written in the late 1980s to mid-1990s. It is not used by Windows-based BBS software, but BNU can be used under Windows NTVDM to run DOS-based BBS software under Windows. BNU and other similar drivers were not limited solely to being used in the BBS world. The enhanced capabilities they offered were also used to easily communicate with other serially connected devices for the same reasons that the FOSSIL specification and FOSSIL drivers were originally created. That reason, as noted above, was to separate the details of serial port communications from the actual application. The software's programmers only needed to talk to the serial driver in a standardized way to send and receive their data.\nThe name \"BNU\" was originally a rip-off of AT&T's \"BNU UUCP\", and in that context meant \"Basic Networking Utilities\". The author of BNU, David Nugent, felt that the acronym was particularly apt for BNU's function. BNU was also called \"Bloody Nugent's Utility\" because it was written by David Nugent as one of his many BBS related utilities and it was not known at the time what the acronym \"BNU\" actually stood for.\n}}"
    }
  ]
}