{
  "content": [
    {
      "type": "text",
      "text": "# Board of Agriculture (1793–1822)\n\non British cattle, commissioned by the Board of Agriculture]]\nThe Board of Agriculture was a British voluntary association and chartered society founded in 1793 to promote agricultural improvement. Under the fuller title Board of Agriculture and Internal Improvement, it was discussed in a published paper of May 1793. The Board had the backing of William Pitt the younger the Prime Minister, and was set up at the start of the French Revolutionary Wars by the efforts of Sir John Sinclair, following a suggestion made in 1790 by William Marshall.\nFoundation\nFounded by Royal Charter on 23 August 1793 as the Board or Society for the Encouragement of Agriculture and Internal Improvement, it was dissolved in June 1822. Though its founders hoped the board would become a department of state it was never more than a private society which spread useful knowledge and encouraged improvements in farming. The president was Sir John Sinclair and the secretary was Arthur Young; it was given an annual parliamentary grant of £3,000.\nConstitution\nThe Board was a closed corporation, with a mixture of appointed, ex officio and elected members. Ehrman considers its constitution likely derived from Scottish societies familiar to Sinclair. Its charter was semi-official, and it spent public money, its finances being partly subscriptions and part government grant. It did not have to supply accounts to the Treasury, and its minutes were private. Ehrman comments on the antiquated approach taken.\nHistory\nSinclair's initial idea was for a parish-by-parish survey in England, along the lines of his Statistical Account of Scotland. The plan had to be dropped because of opposition from John Moore, the Archbishop of Canterbury. The Board was successful in commissioning a series of county reports, now known as the General Views of Agriculture.\nIt also made attempts to encourage agricultural shows, offered premiums, and held two livestock shows in London in 1821 and 1822. The government grant was withdrawn in 1820; after two years the shortage of funds from private subscriptions led to its dissolution.\nOfficers\nIn 1798 John Southey Somerville, 15th Lord Somerville replaced Sir John Sinclair as President, with Pitt's support. John Baker Holroyd, 1st Earl of Sheffield was President from 1803 to 1806. Sinclair then returned as President, to 1813. From 1816 to 1818 George Parker, 4th Earl of Macclesfield was President.\nReferences\n*Ernest Clarke, History of the Board of Agriculture, 1793–1822 (1898)\nNotes"
    }
  ]
}