{
  "content": [
    {
      "type": "text",
      "text": "# Bob Ward (American football, born 1933)\n\n| birth_place         = Huntington Park, California, U.S.\n| death_date          =\n| death_place         =\n| high_school         = Burbank (CA)\n| college             = Whitworth College\n| pastcoaching        =\n* Fullerton College (1965–1975) Head track coach\n* Dallas Cowboys (–)Strength and conditioning coach\n| highlights          =\n* Super Bowl champion (XII)\n* USATF Masters World Champion in the Weight Pentathlon (1998, 2004)\n* USATF Masters Field Athlete of the Year (2002)\n}}\nRobert D. Ward (July 4, 1933 – June 28, 2021) was an American football strength and conditioning coach in the National Football League (NFL) for the Dallas Cowboys. He also was the Fullerton College head track and field coach. He played college football at Whitworth College.\nEarly years\nWard was partially raised in an orphanage as a child. He attended Burbank High School where he was all-league in football and track. In football, he played quarterback.\nHe accepted a football scholarship from Whitworth College. As a senior, he was named to the NAIA Little All-American team. He also competed in track, in the events of Shot put, Discus throw, Pole Vault and Javelin throw. He graduated with a degree in physical education in 1955. He earned master's degree at the University of Washington in 1959.\nCoaching career\nCollege\nWard coached football and track in high school for six years. In 1965, he was hired as the head track coach at Fullerton Junior College. He spent 11 years in that role, helping his teams win three straight conference championships and a state championship. He also coached rugby for three years, winning the Southern California Championship.\nIn 1992, he was inducted into the Whitworth College Athletic Hall of Fame. In 2017, he was inducted into the Fullerton College Athletic Hall of Fame.\nNFL\nIn the spring of 1975, he was hired by the Dallas Cowboys as their new conditioning coach, replacing Alvin Roy, who left the organization to join Hank Stram's coaching staff with the New Orleans Saints. He was known for implementing a system of computer-driven analytics (ProTrain Computer Program), which enabled coaches to break down actual athletic movements rather than rely on statistics.\nHe also devised equipment and a form of psycho-cybernetics by applying the tensile strength of surgical tubing to induce greater speed. He incorporated the mixed martial arts techniques of Jeet Kune Do in training routines, which was created by the legendary martial artist Bruce Lee, in order to improve the quickness of the Cowboy players. In 1989, he was let go from the team and replaced with Mike Woicik, with the arrival of new head coach Jimmy Johnson. Ward's Cowboy teams compiled a 124-72 record that included ten winning seasons and one Super Bowl.\nIn 2003, he was inducted into the Strength and Conditioning Coaches Hall of Fame.\nPersonal life\nHis brother Paul, was the first Whitworth College graduate to play in the NFL (Detroit Lions). In 1971, he received his Doctorate in Physical Education from Indiana University. He served as a member of the United States Olympic Committee in Track and Field. In 1986, he co-founded the National Association of Speed and Explosion.\nAfter the NFL, he developed a Computer Graphic Player Analysis. He served as the Director of Sports Science and Nutrition for Mannatech from 1995 to 2001. He was the Director of Sports Sciences for AdvoCare from 2001 to 2007. Ward co-authored the books Sport Speed (1988), Encyclopedia of Weight Training: Weight Training for General Conditioning, Sport and Body Building (1997) and Building the Perfect Star: Changing the Trajectory of Sports and the People in Them (2015).\nIn addition, he began competing in Masters athletics track and field events, being named the USATF Masters World Champion in the Weight Pentathlon in 1998 and 2004. He was named the USATF Masters Field Athlete of the Year in 2002. He also held six World Records for Weight and Hammer throw, for ages 70 to 74. In 2008, he was inducted into the USATF Masters Hall of Fame.\nWard died of natural causes on June 28, 2021.\nReferences\nExternal links\n*[https://www.star-telegram.com/sports/spt-columns-blogs/mac-engel/article252728548.html The late Dallas Cowboys strength coach leaves quite a legacy]"
    }
  ]
}