{
  "content": [
    {
      "type": "text",
      "text": "# Bob King (Australian footballer)\n\n| birth_place = Fitzroy, Victoria\n| death_date =\n| death_place = Fitzroy, Victoria\n| originalteam = Fitzroy Juniors\n| height = 183 cm\n| weight = 72 kg\n| position =\n| statsend = 1923\n| years1 = 1916–1921\n| club1 = Fitzroy (VFL)\n| games_goals1 = 63 (0)\n| years2 = 1921, 1923\n| club2 = Williamstown (VFA)\n| games_goals2 = 30 (0)\n| games_goalstotal = 93 (0)\n| careerhighlights = * premiership player 1916\n}}\nRobert King (12 August 1894 – 23 February 1979) was an Australian rules football player with the Fitzroy Football Club in the Victorian Football League (VFL) and with the Williamstown Football Club in the Victorian Football Association (VFA).\nFamily\nThe son of Robert King (1862-1936), and Margaret Jane King (1869-1929), née Ryan, Robert King was born at Fitzroy, Victoria on 12 August 1894. Three of his nephews, Arthur Robert Hart (1917 –1981), Edward Ronald \"Eddie\" Hart (1922–1995), and  Donald Clement \"Don\" Hart (1930–2018), also played for Fitzroy.\nFootball\nFitzroy (VFL)\nKing became a premiership player at Fitzroy, playing in the 1916 VFL Grand Final, under the captaincy of Wally Johnson, with George Holden as coach. King made his debut against  in Round 4 of the 1916 VFL season.\nWilliamstown (VFA)\nKing, who worked at the Newport Railway Workshops, transferred to Victorian Football Association (VFA) club Williamstown during the 1921 VFL season, debuting in the round 10 match at the Williamstown Cricket Ground against Footscray, aged 26. He was best-on-ground at centre-half back in Williamstown's 1921 premiership victory over Footscray at Fitzroy's Brunswick Street Oval, and his spectacular marking in this game was still talked about years later.\nKing crossed to Williamstown Juniors as captain-coach in 1922 before returning to Williamstown for one final season in 1923. He played 29 games for Williamstown, without kicking a goal, in his two seasons with them (1921 and 1923).\nDeath\nKing died at Fitzroy, Victoria on 23 February 1979.\nNotes\nReferences\n*\nExternal links\n*\n*\n* [https://www.thevfaproject.org/pages/Players/King,_Robert.php Robert King at The VFA Project.]"
    }
  ]
}