{
  "content": [
    {
      "type": "text",
      "text": "# Bobby Warshaw\n\n| birth_place          = Mechanicsburg, Pennsylvania, United States\n| height               =\n| position             = Midfielder\n| currentclub          =\n| clubnumber           =\n| collegeyears1        = 2007–2010\n| college1             = Stanford Cardinal\n| collegecaps1         = 76\n| collegegoals1        = 18\n| years1               = 2011–2013\n| clubs1               = FC Dallas\n| caps1                = 32\n| goals1               = 1\n| years2               = 2013\n| clubs2               = → Ängelholms FF (loan)\n| caps2                = 9\n| goals2               = 8\n| years3               = 2014\n| clubs3               = GAIS\n| caps3                = 16\n| goals3               = 2\n| years4               = 2014–2015\n| clubs4               = Bærum\n| caps4                = 32\n| goals4               = 5\n| years5               = 2015\n| clubs5               = Hønefoss\n| caps5                = 10\n| goals5               = 1\n| years6               = 2016\n| clubs6               = Harrisburg City Islanders\n| caps6                = 28\n| goals6               = 4\n| totalcaps = 127\n| totalgoals = 21\n| nationalyears1       = 2005\n| nationalteam1        = United States U17\n| nationalcaps1        = 15\n| nationalgoals1       = 2\n| club-update          = October 1, 2016\n| nationalteam-update  = August 18, 2014\n}}\nWilliam Robert \"Bobby\" Warshaw (born November 21, 1988) is an American former soccer player. He now works as a writer, analyst, and author.\nSoccer career\nYouth and college\nWarshaw attended Mechanicsburg Area Senior High School, where he was a Gatorade State Player of the Year twice in 2005 and 2006. He was the Pennsylvania Soccer Coaches Association Player of the Year in 2006 and NSCAA Youth All-America Player of the Year in 2004, 2005 and 2006. He earned a place for the first time in the U-17 national team during the 2005 season. Warshaw has been quoted saying that his high school coach, Tony Lougee, was his main influence in every one of his fundamentals and credits him with much of his life success, stating in one January 2011 interview, \"Tony made me the man I am today; he is really a father figure to me.\"\nWarshaw made his college soccer debut at Stanford University in 2007, starting 17 matches and scoring 5 goals. He was chosen captain for the team for the 2008, 2009 and 2010 seasons. In 2009, Warshaw led Stanford to the Round of 16 in the NCAA tournament with wins over Saint Mary's and UC Irvine in the first two rounds, and was a Hermann Trophy (USA College Player of the Year) semi-finalist. He scored 18 goals in his career at Stanford, despite being moved to defense for his final two seasons.\nProfessional\nWarshaw was selected in the first round (17th overall) by FC Dallas in the 2011 MLS SuperDraft. He made his professional debut on May 7, 2011, coming on as a substitute in a 0–0 tie with D.C. United.\nWarshaw was loaned to Swedish Superettan club Ängelholms FF on August 11, 2013. On February 24, 2014, it was announced that Warshaw would join Swedish Superettan club GAIS on a one-year contract.\nWarshaw moved to Norwegian First Division club Bærum in August 2014. He signed with First Division side Hønefoss in August 2015.\nAfter a contract fell through with Israeli club Maccabi Netanya, Warshaw signed with United Soccer League team Harrisburg City Islanders in his home state of Pennsylvania for the 2016 season.\nInternational\nWarshaw debuted for the USA U-17 national team in 2005 against Honduras. He scored his first goal for the national team in 2007 against Venezuela in the Pan-American Games held in Rio de Janeiro, Brazil. USA ended up winning the match 2–1, with Warshaw scoring the game-winning goal.\nPersonal\nWarshaw is the son of Allen and Shirley Anne Warshaw, who is a political science professor at Gettysburg College, and also an author and political commentator.\nBesides being an athlete, Warshaw also holds a strong academic record with a 3.57 GPA in political science while at Stanford. In 2010, Warshaw was awarded an Academic All-District award. Stanford Cardinal coach Bret Simon described Warshaw as a \"true leader and fierce competitor with a proven track record in every season as a Stanford Cardinal\".\nMedia career\nDuring and after his soccer career, Warshaw contributed articles to sites such as Deadspin, FourFourTwo, Fox Soccer, MLSsoccer.com, and The Patriot-News, as well founding and writing for his own website, The Athlete Story. He also appears as an analyst on MLSsoccer.com.\nIn 2017, Warshaw published a book, When the Dream Became Reality, about his experiences as a soccer player.\nReferences\nExternal links\n*\n*[https://gostanford.com/news/2013/4/17/208439248.aspx Stanford profile]"
    }
  ]
}