{
  "content": [
    {
      "type": "text",
      "text": "# Bodymind (in meditation traditions)\n\nBodymind is a compound of body and mind and may be used differently in different meditation traditions.  These different understandings often inform each other. The Buddhist philosopher, Herbert V. Günther, has stated:\nWhat we call 'body' and 'mind' are mere abstractions from an identity experience that cannot be reduced to the one or the other abstraction, nor can it be hypostatized into some sort of thing without falsifying its very being.\nModern Western cultures inherited the concept of Cartesian dualism which isn't evident in many other cultures. As a result of multiculturalism and globalization, the bodymind philosophies found in other cultures, such as in Navajo and Tibetan societies, have been integrated into the bodymind concept adopted by the Western New Age movement.\nVajrayana and Zen Buddhism\nIn Vajrayana, Mahayana, Theravada and Zen Buddhism the concept of bodymind, or namarupa, is key. In Vajrayana, namarupa is informed by the related doctrines of heartmind and Yogachara's mindstream. Within these traditions, Bodymind is held as a continuüm and field phenomenon.  Arpaia and Rapgay discuss the connection of mindbody in the eighth chapter of their book, Tibetan Wisdom for Modern Life , entitled \"Health: strengthening the mind-body connection\".\nDavid E. Shaner, PhD, coined the compound term \"bodymind\" in his thesis work at the University of Hawai'i, \"The Bodymind Experience in Japanese Buddhism\", which he defended in 1979 and published in 1985.[2] Shaner translated the term 心身統一合氣道, Shinshintouitsu Aikidō.\nSee also\n*Bodymind (in new age)\n*Mind-body dichotomy\nNotes\nReferences\n*Arpaia, Joseph & D. Lobsang Rapgay. 2004. Tibetan Wisdom for Modern Life. Delhi, Motilal Banarsidass.\n*Benson MD, Herbert. 2000 (1975). The Relaxation Response. Harper.\n*\n*\n*Shaner, David E. The bodymind experience in dōgen's \"shōbōgenzō\": A phenomenological perspective. Philosophy East and West.35(1):17-35(1985)."
    }
  ]
}