{
  "content": [
    {
      "type": "text",
      "text": "# Bombing of Toyokawa in World War II\n\n| combatant2  =\n| combatant3  =\n| commander1  =\n| commander2  =\n| commander3  =\n| strength1   =\n| strength2   =\n| strength3   =\n| casualties1 = none\n| casualties2 = 2,544 to 2,677 killed\n| casualties3 =\n| notes       =\n}}\nThe  was part of the strategic bombing campaign waged by the United States of America against military and civilian targets and population centers during the Japan home islands campaign in the closing stages of the Pacific War in 1945.\nBackground\nAlthough the city of Toyokawa was not a major population center, it had a major target of military significance: the  one of the largest in the Empire of Japan, which produced 7.7&nbsp;mm machine guns, 13&nbsp;mm and 20&nbsp;mm aircraft cannon and 25&nbsp;mm anti-aircraft cannon and associated munitions for the Imperial Japanese Navy. By February 1945, the facility had 56,400 workers and covered an area of 330 hectares.  The Tōkaidō Main Line railway connecting Tokyo with Osaka also ran through the city.\nAir raids\nDespite its obvious military significance, Toyokawa was not bombed until the very late stages of the war. On 1 November 1944, a small scale air raid occurred. This was followed on 23 November by a midnight fly-over by a lone camera-equipped B-29 Superfortress on a reconnaissance mission.\nHowever, a major air raid did not occur until the morning of 7 August 1945. During this attack, 135 B-29 Superfortress bombers of the USAAF 20th Air Force, 58th 73rd, 313th, and 314th Bombardment Wings launched from Guam, Saipan and Tinian. They were joined by 48 P-51 Mustang escort fighters deployed from Iwo Jima. Arriving over the target area at 10:13 AM, twelve B-29s bombed the Toyokawa Naval Arsenal, while the remaining bombers concentrated on Toyokawa's civilian population center, and the P-51s strafed targets of opportunity. A total of 3,256 500-lb bombs (813 tons) was dropped on the city from an altitude of 15,000–17,000 feet. Civilian casualty estimates range from 2,544 to 2,677 people killed. Victims included 452 schoolchildren and teenaged girls, some of whom had been conscripted and many of whom had volunteered to work at the Naval Arsenal.\nJapanese anti-aircraft fire damaged 21 B-29s during the raid, one of which crashed into the ocean near Iwo Jima. There were no American fatalities. Another B-29 lost course and dropped its bombs on the rural village of Futamata (now part of Hamamatsu, Shizuoka).\nAfter the war, a memorial monument was erected within the grounds of Toyokawa Inari temple. Several other memorials exist at various locations around Toyokawa City.\nSee also\n* Evacuations of civilians in Japan during World War II\n* Grave of the Fireflies (short story), a semi-autobiographical short story set during the bombing\nReferences\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\nNotes\nExternal links\n*[https://web.archive.org/web/20110903020021/http://www.9thbombgrouphistory.org/Chapters/Chapter_14.pdf 9th Bomb Group History]\n*[http://www.toyokawa-map.net/others/kosyo.html Toyokawa Tourist Association]\n*[http://www.geocities.jp/takechan_mori/chibakengai/toyokawa.html History of Toyokawa Arsenal in Japanese]"
    }
  ]
}