{
  "content": [
    {
      "type": "text",
      "text": "# Bombing of Wilhelmshaven in World War II\n\nThe Wilhelmshaven World War II bombings by the Allies of World War II destroyed targets at Wilhelmshaven in Germany. From spring 1943 until November 1943 slave labourers of the SS-Baubrigade II from the Neuengamme concentration camp were transferred to Wilhelmshaven to clear up after air raids.\n{|class=\"wikitable sortable\"\n|-\n|+Wilhelmshaven World War II bombings\n|-\n! width=16% | Date\n!           | Mission\n|-\n| 4 September 1939\n|  First RAF Bomber Command raid of World War II. Ten Bristol Blenheims of No. 110 and No. 107 Squadrons attacked units of the German fleet at low altitude, losing seven aircraft without achieving any significantly damaging hits.\n|-\n| 18 December 1939\n|  Battle of the Heligoland Bight. The first combat success of radar used a German \"experimental Freya radar\" to detect unescorted RAF bombers approaching the German Bight en route to Wilhelmshaven. As the bombers approached their targets, they were ordered to withhold attack on targets docked or in the harbour so as to avoid civilian casualties. German fighters inflicted heavy casualties on them as they headed home, destroying 12 of the 22 Vickers Wellingtons.\n|-\n| 8 July 1941\n|  No. 90 Squadron RAF bombed the city in the first daylight attack by Fortress Is. Three bombers carrying two tons of bombs each bombed from an altitude too high for German interceptors to reach but only one was able to drop on the target.\n|-\n| 28–29 December 1941\n|  217 sorties by RAF Bomber Command; Wilhelmshaven, Hüls, and Emden were the main targets.\n|-\n| 27 January 1943\n|  VIII Bomber Command Mission Number 31 was the first daylight bombing mission flown by the Eighth Air Force against the German homeland, led by the 306th Bomb Group (H) with Brig. Gen. Frank A. Armstrong in command. 55 bombers dropped 137 tons of bombs on warehouses and industrial plants, losing three aircraft.\n|-\n| 11–12 February 1943\n|  220 sorties were flown by 177 aircraft, comprising 129 Lancasters, 40 Halifaxes and eight Stirlings from RAF Bomber Command, targeting the major Kriegsmarine bases around Wilhelmshaven. The naval arsenal, including ammunition, mine and torpedo stores, at Mariensel exploded, destroying approximately 50 hectares (120 acres). This represented the first successful use of \"blind-bombing\", i.e. radar targeting using the H2S system. Three aircraft were lost.\n|-\n| 26 February 1943\n|  On the second Wilhelmshaven bombing mission by 8AF, footage for the documentary film Memphis Belle: A Story of a Flying Fortress was filmed from the B-17 Flying Fortress Jersey Bounce of the 91st Bombardment Group.\n|-\n| 22 March 1943\n|  Attack by six groups of B-17s and B-24 Liberators on U-boat yards.\n|-\n|21 May 1943\n|  Severe German fighter reaction against 77 B-17s resulted in the loss of ten per cent of the bomber force.\n|-\n| 11 June 1943\n|  252 B-17s are dispatched against the U-boat yard at Wilhelmshaven and the Cuxhaven port area. Eight of the 218 that reach the target are lost. The raid on Wilhelmshaven demonstrated the difficulty of operating beyond range of fighters escort as enemy fighters attacks prevent accurate bombing of the target.\n|-\n|26 July 1943\n|  Wilhelmshaven bombed as a target of opportunity by the 94th Bomb Group.\n|-\n| 3 November 1943\n|  21 groups totaling 539 aircraft attacked the Wilhelmshaven harbor.\n|-\n| 3 February 1944\n|  Major attack by 609 B-17s on the port area of Wilhelmshaven.\n|-\n| 3 March 1944\n|  91 B-17s of the 1st Bomb Division bombed the city as a target of opportunity when bad weather forced the rest of the 760-bomber mission force to turn back from the first attack on Berlin.\n|-\n|27 August 1944\n|  Wilhelmshaven again bombed as a target of opportunity, by 34 B-17s originally sent to Berlin.\n|-\n| 27–28 February 1945\n|  Night mission by 8AF and RAF Pathfinder Force (PFF). 23 of 26 B-24s bombed Wilhelmshaven oil storage facilities.\n|-\n| 30 March 1945\n|  8AF Mission 918. 358 B-24s of the 2d Air Division completed the final mission against Wilhelmshaven by the Eighth Air Force. In 12 attacks on the city, 2,141 bombers of the Eighth dropped 5,327.5 tons of bombs and had 46 bombers shot down.\n|-\n|}\nReferences"
    }
  ]
}