{
  "content": [
    {
      "type": "text",
      "text": "# Bombing of Pescara in World War II\n\n| combatant2  =\n}}\nThe bombing of Pescara was a series of attacks by the United States Army Air Force on the city of Pescara in Abruzzo, Italy during World War II. The raids caused thousands of civilian casualties and left 80 % of the city destroyed or damaged.\nHistory\nPescara was the location of one of the most important marshalling yards in central Italy, of considerable importance for the transit of supplies to the Axis troops in southern Italy and later to the German forces fighting on the Winter Line. This led to the city being repeatedly bombed by the USAAF, suffering nine major raids between August 1943 and May 1944.\nThe first raid took place on 31 August 1943, by 45 Consolidated B-24 Liberators of the 376th US Bombardment Group. The target of this attack was the marshalling yard, but this was not hit; the raid was grossly inaccurate and most of the bombs fell all over the town, causing widespread damage and destruction, especially in the city centre. This was the deadliest air raid suffered by Pescara; civilian casualties in this attack have been estimated as 1,600 to 1,900.\nThe second major raid was carried out on 14 September 1943, six days after the Armistice of Cassibile, by 37 bombers of the 98th and 376th US Bombardment Group, again targeting the marshalling yard. This time 341 bombs were dropped, and the attack was fairly accurate, with most of them hitting the target; however, the railway station was crowded with passengers of several trains at the time of the raid, resulting in hundreds of civilian deaths (estimates range from 600 to 2,000). Bombs also fell on the northern districts around the marshalling yard.\nAfter these two raids, about 80 % of the population of Pescara left the town, many of them fleeing to nearby Chieti, which had been declared an open city, and to Pianella. More air raids took place on 17, 18 and 20 September, 4 October, 7 and 8 December 1943 and 12 May 1944, but these caused few casualties, as the town had become almost deserted.\nBy the time the Allies entered Pescara, on 10 June 1944, 78 % of all buildings had been destroyed or damaged (1,265 buildings had been destroyed, 1,335 had been badly damaged, and 2,150 had been lightly damaged); of a population of 54,000 people, between 2,000 and 6,000 had been killed, and 12,000 were left homeless. The part of the town located north of the Pescara river was completely destroyed.\nReferences"
    }
  ]
}