{
  "content": [
    {
      "type": "text",
      "text": "# Bonogin, Queensland\n\n| alternative_location_map = Australia Gold Coast\n| local_map           = yes\n| zoom                = 11\n| pop                 = 4896\n| pop_year            =\n| pop_footnotes       =\n| established         =\n| postcode            = 4213\n| area                = 38.7\n| timezone            = AEST\n| utc                 = +10:00\n| dist1               = 20.3\n| dir1                = SW\n| location1           = Surfers Paradise\n| dist2               = 22.7\n| dir2                = SSW\n| location2           = Southport\n| dist3               = 89.6\n| dir3                = SSE\n| location3           = Brisbane CBD\n| dist4               =\n| dir4                =\n| location4           =\n| lga                 = City of Gold Coast\n| stategov            = Mudgeeraba\n| fedgov              = McPherson\n| fedgov2             = Wright\n| near-n              = Mudgeeraba\n| near-ne             = Reedy Creek\n| near-e              = Tallebudgera Valley\n| near-se             = Tallebudgera Valley\n| near-s              = Tallebudgera Valley\n| near-sw             = Austinville\n| near-w              = Austinville\n| near-nw             = Mudgeeraba\n}}\nBonogin is a rural hinterland locality in the City of Gold Coast, Queensland, Australia. In the , Bonogin had a population of 4,896 people.\nGeography\nBonogin is on the edge of the Gold Coast hinterland. It is about  away from Brisbane.\nHistory\nThe origin of name is not known, but it is speculated that it is derived from the Aboriginal word Boonoo meaning red bloodwood.\nEuropean settlement commenced in the 1870s. The early industries were timber cutting and dairying. Later bananas were grown.\nApproval was given to establish a school in 1913. Bonogin Creek State School opened on 7 July 1913. There were closures due to teacher shortages in 1917 and 1921. The school finally closed on 30 March 1924. The school was on Bonogin Road (approx ). The school building was relocated to Wunburra (near Springbrook) in 1934.\nIn the 1980s, some of the farms were subdivided to form acreage residential developments.\nDemographics\nIn the , Bonogin had a population of 4,182 people.\nIn the , Bonogin had a population of 4,573 people.\nIn the , Bonogin had a population of 4,896 people.\nEducation\nThere are no schools in Bonogin. The nearest government primary schools are Mudgeeraba Creek State School and Clover Hill State School, both in neighbouring Mudgeeraba to the north. The nearest government secondary school is Robina State High School in Robina to the north.\nBonogin Creek\nPart of the City of Gold Coast's Beaches to Bushland volunteer restoration program includes Bonogin Creek. The primary tributary of the creek begins in the Gold Coast hinterland.  A hinterland regional park bushcare group was established in 1999 to address conservation of local plant species and also attempt to restore natural habitat of the creek. Davenport Park is a suburban park running along a lower point of the creek, within suburban Bonogin. In 2013 Bonogin Valley bushcare group formed to help with restoration of the park and creek area.\nAmenities\nThe Gold Coast City Council operates a fortnightly mobile library service which visits Davenport Park on Bonogin Road East.\nReferences\nExternal links\n*"
    }
  ]
}