{
  "content": [
    {
      "type": "text",
      "text": "# Books in the United Kingdom\n\nBooks in the United Kingdom have been studied from a variety of cultural, economic, political, and social angles since the formation of the Bibliographical Society in 1892 and since the History of books became an acknowledged academic discipline in the 1980s. Books are understood as \"written or printed work consisting of pages glued or sewn together along one side and bound in covers\".\nHistory\nScribes produced handwritten manuscript books for many hundreds of years before the printing press was introduced in the British Isles. In 1477 William Caxton in Westminster printed The Dictes or Sayengis of the Philosophres, considered \"the first dated book printed in England.\"\nPublishers\n, seven firms in the United Kingdom rank among the world's biggest publishers of books in terms of revenue: Bloomsbury, Cambridge University Press, Informa, Oxford University Press, Pearson, Quarto, and RELX Group.}}\nBookselling\nThe Antiquarian Booksellers Association formed in 1906, and the Provincial Booksellers Fairs Association in 1972.\nCollections\nThe University of Oxford's Bodleian Library was founded in 1602.\nThe British Library was formally established in 1973, its collection previously part of the British Museum (est. 1753).\nThe Legal Deposit Libraries Act 2003 stipulates that the British Library receives a copy of every printed work published in the United Kingdom. Five other libraries are entitled to copies: Cambridge University Library, University of Oxford's Bodleian Library, the National Library of Scotland, the Library of Trinity College, Dublin, and the National Library of Wales. The London-based Copyright Agency became the Edinburgh-based Agency for the Legal Deposit Libraries in 2009.\nClubs\n* \"Richard & Judy Book Club\", broadcast on Channel 4 TV\n* \"Bookclub\", on BBC Radio 4\nDigitization\nUS-based Google Inc. began scanning pages of Bodleian Library volumes in 2005, as part of its new Google Books Library Project.\nSee also\n* Copyright law of the United Kingdom\n* List of largest book publishers of the United Kingdom\n* British National Bibliography\n* English Short Title Catalogue\n* Eighteenth Century Collections Online\n*\n* Children's books: United Kingdom and List of UK children's book publishers\n* British bibliophiles\nImages\nFile:1760 Cambridge Edition King James Bible.png|King James Bible, 1760 ed.; first issued in 1611\nFile:Princess Beatrice reading.jpg|Princess Beatrice with book, circa 1925\nFile:London MMB I7 Birkbeck College.jpg|Man reading at Birkbeck College, London, 2012\nNotes\nReferences\nBibliography\n;published in 19th century\n*  + [https://archive.org/details/bibliothecabrit00wattgoog v.2]\n*\n*\n;published in 20th century\n*\n*\n*\n*\n*\n*\n*\n* J. Raven, H. Small, and N. Tadmor (eds.), The Practice and Representation of Reading in England (Cambridge UP, 1996)\n*  (6 volumes)\n;published in 21st century\n*\n*\n* . Contains chapters: \"Britain, c.1475-1800\" by Andrew Murphy; \"Britain, 1801-1914\" by Leslie Howsam; \"Britain from 1914\" by Claire Squires\n*\n*\n*\nExternal links\n*  (Bibliography of editions published in present-day UK; also browsable by [http://data.cerl.org/istc/_index/imprintplace town])\n*\n*  (Includes works about history of books in the UK)\n* .  (Includes articles on UK book history)\n* [https://uolbibliophiles.wordpress.com University of London’s Society of Bibliophiles]\n*\n*"
    }
  ]
}