{
  "content": [
    {
      "type": "text",
      "text": "# Book of Mormon and the King James Bible\n\nThe Book of Mormon contains many linguistic similarities to the King James Bible (KJV). In some cases, entire passages are duplicated in the Book of Mormon. Sometimes the quotation is explicit, as in the Second Book of Nephi, which contains 18 quoted chapters of the Book of Isaiah.\nOther significant connections between the two books include Book of Mormon words and phrases that only appear in their KJV usage, perpetuation of Bible passages considered by some scholars to have been mistranslated in the KJV, and the possible presence of English homophones.\nMost Mormons accept the miraculous origin theory of the Book of Mormon and deny that the KJV was a source for it, arguing that the alleged similarities between the two are artifacts of the divine nature of the creation of the work. In contrast, those who reject the miraculous origin of the Book of Mormon view the KJV as a major source for the Book of Mormon.\nMembers of the Church of Jesus Christ of Latter-day Saints (LDS Church) identify the Book of Mormon as the \"stick of Joseph\" and the Bible as the \"stick of Judah\" in Ezekiel 37:19:\nSay unto them, Thus saith the Lord God; Behold, I will take the stick of Joseph, which is in the hand of Ephraim, and the tribes of Israel his fellows, and will put them with him, even with the stick of Judah, and make them one stick, and they shall be one in mine hand.\nThis link comes from revelation written in Doctrine and Covenants 27:5:\nBehold, this is wisdom in me; wherefore, marvel not, for the hour cometh that I will drink of the fruit of the vine with you on the earth, and with Moroni, whom I have sent unto you to reveal the Book of Mormon, containing the fulness of my everlasting gospel, to whom I have committed the keys of the record of the stick of Ephraim.\nMiraculous origin story\nAdherents of Latter Day Saint movement generally believe the Book of Mormon has a miraculous origin. While Joseph Smith described the Book of Mormon as a \"translation\" of text written on golden plates, Smith had not studied ancient languages and did not \"translate\" in the traditional sense of the word. Smith claimed a divine origin for his ability to translate.\nThe existence of biblical passages in the Book of Mormon is explained in the text as being the result of Lehi's family bringing with them a set of brass plates from Jerusalem which containing the writings of Moses, Isaiah, and several prophets not mentioned in the Bible. Regarding this record, 1 Nephi 5:11 states:\nAnd he beheld that they did contain the five books of Moses, which gave an account of the creation of the world, and also of Adam and Eve, who were our first parents;\nWhile most contemporary secular and religious biblical scholars dates the completion of the Pentateuch to no earlier than the Persian period (538–323 B.C.), those who accept the miraculous origin theory generally subscribe to the tradition of Mosaic authorship circa 1280 B.C.\nMormon writers have noted that although the portions of the Book of Mormon that quote from the Bible are very similar to the KJV text, they are not identical. Mormon scholars have also noted that at least seven of \"the ancient textual variants in question are not significantly different in meaning.\"\nThe text of the Book of Mormon is written in an archaic style, and some Latter Day Saints have argued that one would expect a more modern 19th-century vocabulary if Smith had authored the book. The Book of Mormon also appears, according to Skousen, to use archaic phrases that are not found in the KJV but were in current usage at or around the time of its first publication in 1611. For example, in the 1830 edition of the Book of Mormon, the original text of what is now Alma 37:37 reads:\ncounsel the Lord in all thy doings, and he will direct thee for good;\nusing the word \"counsel\" to mean \"counsel with.\" When read in modern English, the text as originally written makes it sound as if \"the Lord\" was to be the one to be counseled. When the 1920 edition of the Book of Mormon was being prepared, the preposition \"with\" was added in this passage \"so that readers would not misinterpret the language.\" The text of Alma 37:37 now reads:\nCounsel with the Lord in all thy doings, and he will direct thee for good;\nThe older sense of the word \"counsel\" became obsolete about 250 years prior to Smith's birth.\nAnother example is \"but if\" in the original text of Mosiah 3:19: \"but if he yieldeth\", compared to the current reading; \"unless he yieldeth.\" The use of \"but if\" to mean \"unless\" ended around the beginning of the 17th century, predating Smith by 200 years\nQuotation of ancient sources\nThe quotation of  by , \"And upon all the ships of the sea, and upon all the ships of Tarshish, and upon all pleasant pictures\" is sometimes used as evidence of an ancient source for the Book of Mormon. The KJV contains only half the phrase, while the Septuagint contains the other half. The scholarly consensus is that the Septuagint is a mistranslation of the original Hebrew. Isaiah 2:16 is part of a poetic section and is a rhyming couplet; the Book of Mormon contains three phrases at this section where the meter dictates there should be only two. Numerous readily available bible commentaries in the early 1800s mentioned the Septaugint translation, including ones by John Wesley and Adam Clarke.\nOne FARMS researcher, John A. Tvedtnes, performed comparisons of the Isaiah variants found in the Book of Mormon with the following versions of the Book of Isaiah: the Hebrew Massoretic text, the Dead Sea Scrolls found at Qumran, the Aramaic Targumim, the Peshitta, the Septuagint, the Old Latin and Vulgate, and the Isaiah passages which are quoted in the New Testament. He argues that some of these comparisons show support for the Book of Mormon passages as having been derived from an ancient text. A rebuttal to Tvedtnes's conclusions was given by David P. Wright..This paper, in slightly revised form, is available online at:  In an analysis of each of the examples that Tvedtnes presented, Wright argues that the support given by Tvedtnes was \"problematic as proof\" and that in some cases Tvedtnes's analysis and evidence was \"highly ambiguous, substantially incomplete, strained, or simply in error.\"\nKJV as a source for Book of Mormon\nSome critics of the Book of Mormon argue that the KJV was a significant source for the Book of Mormon text.\nQuotation of KJV in the Book of Mormon\nThe Book of Mormon explicitly quotes the prophet Isaiah, containing 19 chapters of the KJV of Isaiah in their entirety, along with parts of a few other chapters. In total, approximately 30 percent of the Book of Isaiah is quoted in the Book of Mormon (Tvedtnes counts 478 verses in the Book of Mormon that are quoted from Isaiah, but notes that 207 show variations).\nThe Book of Mormon also quotes from the KJV of other books.\n{| border=\"1\" cellpadding=\"5\" cellspacing=\"0\" align=\"center\"\n|\n|Charity suffereth long, and is kind; charity envieth not; charity vaunteth not itself, is not puffed up, Doth not behave itself unseemly, seeketh not her own, is not easily provoked, thinketh no evil; Rejoiceth not in iniquity, but rejoiceth in the truth; Beareth all things, believeth all things, hopeth all things, endureth all things.\n|-\n|\n|And charity suffereth long, and is kind, and envieth not, and is not puffed up, seeketh not her own, is not easily provoked, thinketh no evil, and rejoiceth not in iniquity but rejoiceth in the truth, beareth all things, believeth all things, hopeth all things, endureth all things.\n|}\nThe Book of Mormon contains a version of the Sermon on the Mount, which some authors have claimed to be \"the Achilles heel of the Book of Mormon.\" One author makes the point that certain portions of the Greek manuscripts of Matthew 5–7 do not agree with the KJV of the text, and concludes that the Book of Mormon version of the sermon should not contain text similar to the KJV.\nPerpetuation of KJV translation variations\nThe KJV of 1769 contains translation variations which also occur in the Book of Mormon. A few examples are , , and . The Book of Mormon references \"dragons\" and \"satyrs\" in , matching the KJV of the Bible.\n{| border=\"1\" cellpadding=\"5\" cellspacing=\"0\" align=\"center\"\n|-valign=\"top\" align=\"center\"\n|\n|Isaiah 2:16\n|Isaiah 13:21\n|Isaiah 11:3\n|-valign=\"top\" align=\"center\" style=\"background: #eeeeff\"\n|Geneva Bible (1560)\n|all&nbsp;pleasant&nbsp;pictures\n|Satyrs&nbsp;shall&nbsp;dance&nbsp;there\n|shall make him prudent in the fear of the Lord\n|-valign=\"top\" align=\"center\" style=\"background: #ffeeee\"\n|King James Bible (1611)\n|all pleasant pictures\n|satyrs shall dance there\n|shall make him of quick understanding in the fear of the\n|-valign=\"top\" align=\"center\" style=\"background: #ffeeee\"\n|Book of Mormon (1830)\n|all pleasant pictures\n|satyrs shall dance there\n|shall make him of quick understanding in the fear of the Lord\n|-valign=\"top\" align=\"center\" style=\"background: #eeeeff\"\n|Webster's Revision (1833)\n|all pleasant pictures\n|satyrs shall dance there\n|will make him of quick understanding in the fear of the\n|-valign=\"top\" align=\"center\" style=\"background: #eeeeff\"\n|Young's Literal Translation (1862)\n|all desirable pictures\n|goats do skip there\n|To refresh him in the fear of Jehovah\n|-valign=\"top\" align=\"center\" style=\"background: #eeeeff\"\n|Revised Standard Version (1952)\n|all the beautiful craft\n|there satyrs will dance\n|his delight shall be in the fear of the Lord\n|-valign=\"top\" align=\"center\" style=\"background: #eeeeff\"\n|New American Standard Bible (1971)\n|all the beautiful craft\n|shaggy goats will frolic there.\n|He will delight in the fear of the LORD\n|-valign=\"top\" align=\"center\" style=\"background: #eeeeff\"\n|New International Version (1978)\n|every stately vessel\n|wild goats will leap about\n|he will delight in the fear of the LORD\n|-valign=\"top\" align=\"center\" style=\"background: #eeeeff\"\n|English Standard Version (2001)\n|all the beautiful craft\n|there wild goats will dance\n| his delight shall be in the fear of the LORD\n|}\nUse of English homophones\n{| border=\"1\" cellpadding=\"5\" cellspacing=\"0\" align=\"center\" class=\"floatright\"\n|-valign=\"top\" align=\"center\"\n|Hebrew\n|Greek\n|Latin\n|English\n|-\n|שֶׁמֶשׁshemesh\n|ἨέλιοςHelios\n|Sol\n|Sun\n|-\n|בֵּןben\n|υἱόςhuios\n|Filius\n|Son\n|}\nSome examples of homophones found in the English Book of Mormon are the words strait and straight, and the words sun and son.\nA few passages in the Book of Mormon use phrases from the KJV, but with certain words changed to English homophones. For example,  reads, \"But unto you that fear my name, shall the Son of Righteousness arise with healing in his wings; and ye shall go forth and grow up as calves in the stall.\" This is identical to , except that the word \"Son\" is used in place of \"Sun\". The two words are homophones in English but dissimilar in Hebrew and in Egyptian.\nUnique words and phrases\nThere are many words and phrases which, when found in the Book of Mormon, exist only in a KJV context, suggesting that the words were not part of the author's daily vocabulary, but were used only in borrowings from the KJV. For example, \"fervent\" and \"elements\" each appear twice, both times together in the same phrase, and in the same context as  (, ). Also, \"talent\" is used only once, in the same context as  ().\nArchaic language\nThe Book of Mormon uses an archaic vocabulary and grammar that reflects 16th- and 17th-century usage (Jacobean English) as opposed to the 19th-century American English. Examples include the use of the word \"require\" to mean \"to request\" in Enos 1:18 (compare to KJV Ezra 8:22) and use of \"to cast arrows\" to mean \"to shoot arrows\" in Alma 49:4 (compare to KJV Proverbs 26:18).\nExample parallels\nExample parallels include:\n{| border=\"1\" cellpadding=\"2\" cellspacing=\"0\" style=\"border: 1px solid black;\"\n|BOM\n| KJV\n|-\n|I am in the Father, and the Father in me; and in me hath the Father glorified his name. I came unto my own, and my own received me not. And the scriptures, concerning my coming are fulfilled. And as many as have received me, to them have I given to become the Sons of God; and even so will I to as many as shall believe on my name: for behold, by me redemption cometh, and in me is the law of Moses fulfilled. I am the light and the life of the world. I am Alpha and Omega, the beginning and the end.\n|Believest thou not that I am in the Father, and the Father in me?\nHe came unto his own, and his own received him not. But as many as received him, to them gave he power to become the sons of God, even to them that believe on his name\nI am Alpha and Omega, the beginning and the end, the first and the last.\n|-\n|And whoso believeth in me, and is baptized, the same shall be saved; and they are they who shall inherit the kingdom of God. And whoso believeth not in me, and is not baptized, shall be damned.\n|He that believeth and is baptized shall be saved; but he that believeth not shall be damned.\n|-\n|That other sheep I have which are not of this fold; them also I must bring, and they shall hear my voice; and there shall be one fold, and one shepherd.\n|And other sheep I have, which are not of this fold: them also I must bring, and they shall hear my voice; and there shall be one fold, and one shepherd.\n|}\nSee also\n* Linguistics and the Book of Mormon\nNotes\nReferences\n*.\n*.\n*.\n*.\n*.\n*.\n*.\n*.\n*.\n*.\nExternal links\n* [https://web.archive.org/web/20100218003854/http://www.moroni10.com/Mormon/Bible_References/Book-of-Mormon.html Bible References about The Book of Mormon (Mormon Source)] from \"Moroni's Latter-Day Saint Page\" at Moroni10.com\n* [http://www.mrm.org/origins-of-the-book-of-mormon Origins of the Book of Mormon (Non-Mormon Source)] from \"Joseph Smith and the Origins of The Book of Mormon\" at mrm.org"
    }
  ]
}