{
  "content": [
    {
      "type": "text",
      "text": "# Boone County Historical Society__disambig_1\n\nBoone County Historical Society was established in 1924. Located in Columbia, Missouri, United States, the Boone County Historical Museum has been collecting, preserving and exhibiting artifacts and records of the people of Boone County, Missouri.\nThe campus includes a history museum, an art gallery, a genealogical library, and a number of historic structures. The museum owns historical photographs spanning back to the late 19th century, revealing a Columbia that many people have never seen. The historical society and museum is a cultural and arts destination for Columbia, Missouri and surrounding communities.\nWalters-Boone County Museum\nThe Walters-Boone County Museum was established in 1990 by the Boone County Historical Society. Through the efforts of the historical society's board of directors, a large campaign was launched, which allowed the official construction of the museum to start in 1989. The Walters-Boone County Museum has two major exhibit halls and other display areas which make a total of 5,500 square feet of historical exhibit space. The museum also houses a nearly 10,000 square feet of climate-control vaults and storage space.\nThe Montminy Gallery\nThe 2,800-square-foot Montminy Art Gallery exhibits local, regional and state artists of importance and interest to the Boone County community. The Montminy Gallery was built in 1993 after the death of longtime Columbia artist and University of Missouri professor Emeritus Elizabeth \"Tracy\" Montminy. A wide array of art mediums can be found rotating every eight to twelve weeks. Some of the more popular mediums include paintings, photography and sculptures.\nThe society is the home to the pianist John W. Blind Boone, 125-year-old Chickering grand piano. After belonging to the Walters-Boone Historical Museum for decades, the original piano was hardly playable and continued to deteriorate as a museum piece for the historical society. The century-old piano can now be found as a centerpiece of the Montminy Art Gallery.\nBoone County History & Culture Center\nIn 1988, local businessman Raul Walters made a contribution to honor and in memory of his parents, Bucky and Lala, to the construction of a new museum building for the society.  In return, the society included the Walters name in the finished museum's name - The Walters Boone County Historical Museum & Visitors Center.  In 1993 an estate gift left by famed artist, Tracy Montminy, allowed for the addition of a 6,000-square-foot space to the west end of the original museum building.  The 3,000-square-foot ground floor was dedicated to collections storage and the 3,000-square-foot top floor became the Montminy Art Gallery.  Around 2009, the organization began to refer to its venues collectively as the Boone County Historical Museum & Galleries.  That was an effort to better describe both the history galleries and the Montminy Art Gallery, as well as the newly built Riverhorse Pavilion.  In the years since 1993, not only has the organization produced over 100 major art exhibits, but has also produced dozens of professional music concerts, book readings and other cultural programming.  In 2016, the board of directors enacted a long-term plan to improve the organization by changing the mission statement and name.\nDeciding to better embrace its role as a culture and arts center, and in addition to its long-time role as a history museum, the board of directors voted unanimously to rename the main building and its ancillary venues (consisting of the Montminy Gallery, The Village at Boone Junction, the Maplewood House and the Riverhorse Pavilion), The Boone County History & Culture Center.\nHistoric houses and buildings\nHistoric Maplewood House\nThe Maplewood House was built in 1877 by husband and wife Slater Ensor Lenoir and Margaret Bradform Lenior, each coming from Boone County pioneer families. The house and farm received its name Maplewood because it was located in a grove of large sugar maple trees. Surviving for over 139 years, the Maplewood House been visited by thousands.\nThe historical house was built with homemade brick. Showing influence of the Italianate architectural style. With an original T-shaped layout the home was remodeled in 1891. Some of the construction consisted of enclosing the sleeping decks along the south side of the home and adding an additional wing. Some of the architectural features of the home include: corbels, arched windows, bay windows, front balcony and oriel window.\nThe original farm included 427 acres. The land included: a large pond, utility house, hay barn and a large barn. The animal barn was reconstructed to a summer theater playhouse, called the Maplewood Barn Theater after the property was purchased by the City of Columbia. It was lost to a fire in 2010 and rebuilt and dedicated in 2012.\nThe City of Columbia purchased 60 acres of the farmland including the Maplewood house in 1970. On November 8, 1970 the park was formally dedicated and renamed the Frank G. Nifong Memorial Park and today is called Historic Nifong Park in recognition of the work of historic preservation undertaken by the City of Columbia Parks and Recreation Department and the Boone County Historical Society.\nVillage of Boone Junction\nThe village of Boone Junction contains a number of structures relocated from their original locations. These include:\n* Gordon-Collins Log Cabin – In 1822, David Gordon, Kentucky settler, built the Gordon-Collins Log Cabin. Serving as his families temporary home while a large house was being built. The cabin was later used a slave home and a place for hired laborers to stay. Currently, visitors can view tools that were common during the new frontier. Some of the tools include: looms, spinning wheels, candle molds and cookware. It was moved from its original location in what is today's Stephens Lake Park\n* McQuitty House – In 1910 Luther McQuitty, an African American contractor built this home. Being unique for its vernacular \"Shotgun\" style of architecture, it is one of few surviving homes of its style. It was moved from its original location in Columbia at the corner of Garth and Worley.\n* Easley Store - moved from Easley, Missouri\nCollections\n* Civil War In Missouri\n*The Columbia Daily Tribune Archives 1907-2015\n* Boone County Fire Protection District Dedication Exhibit\n* Concerned Student 1950 Protest and Hunger Strike (2015-16 University of Missouri protests) by Jon Luvelli\n* 150 Years of Boone County Education\n* The Sporting Life: Hunting, Fishing & Conservation in Boone County\n* The Civil War Letters of Joseph Cooper Babb by Joseph Babb\n* Westhoff Photo Collection by Joe Douglass, Henry Holborn, and Wesley Blackmore\n* Postcards from the St. Louis World's Fair & Exposition\nSee also\n*List of cemeteries in Boone County, Missouri\n*National Register of Historic Places listings in Boone County, Missouri\n*History of Columbia, Missouri\nReferences"
    }
  ]
}