{
  "content": [
    {
      "type": "text",
      "text": "# Booted warbler__disambig_1\n\n}}\nThe booted warbler (Iduna caligata) is a species of passerine bird belonging to the family Acrocephalidae, the reed and tree warblers. This species breeds in Eastern Europe and western Asia, wintering in south Asia. it is a regular vagrant to Western Europe.\nTaxonomy\nThe booted warbler was first formally described as Sylvia caligata by the German physician, explorer, botanist and zoologist Martin Hinrich Carl Lichtenstein with its type locality given as the Ilek River, near Orenburg. This species is now classified in the genus Iduna, the tree warblers, within the family Acrocephalidae. All the \"Old World warblers\" were formerly classified within the wastebin taxon known as Sylviidae sensu lato, but in the late 20th Century, molecular studies resulted in this taxon being divided into a number of families.\nIt was formerly considered to be conspecific with Sykes's warbler, but the two are now usually both afforded species status.\nEtymology\nThe booted warbler belongs to the genus Iduna which was proposed by Alexander Keyserling and Johann Heinrich Blasius in 1840, but they gave no explanation of the genus name, though in Norse mythology, Iðunn, or Iduna, is the goddess of spring and fertility who was changed into a sparrow (or a nut) to enable her rescue by Loki. The specific caligata is Latin for \"booted\" from caliga, \"boot\".\nDescription\nThe booted warbler is a small species of warbler, similar in size to a common chiffchaff. It has an undistinguished plumage which is plain greyish brown on the upperparts and paler on the underparts. There is a clear, pale supercilium and a short bill with a dark tip. The jizz shown is of a short-winged rather pot-bellied warbler with a square-tipped tail. This species and Sykes's warbler are challenging to identify.\nDistribution and habitat\nThe booted warbler itself breeds from central Russia to western China, and migrates to winter in the Indian subcontinent as far south as Sri Lanka. Booted warbler has expanded its breeding range westward in recent decades and nests now as far west and north as Finland.\nThis species is a regular vagrant to Western Europe with, for example, over 180 records in Great Britain up to 2023.\nBiology\nThe booted warbler nests between May and early July, building a nest which is shaped like a cup and created from twigs, roots, stems and leaves, lined with feathers, animal hair and plant down. The nest is located on or close to the ground, or at a maximum height of 1 metre above the ground, hidden among dense undergrowth. It is mainly insectivorous.\nGallery\nFile:Booted Warbler, Iduna caligata.jpg|Booted warbler seen in Udumalpet, Tamil Nadu, India\nFile:Iduna caligata MHNT ZOO 2010 11 201 Pérowsk.jpg|Eggs of Iduna caligata MHNT\nFile:Booted warbler (Iduna caligata).jpg|Booted warbler (Iduna caligata), Palakkad, Kerala, India\nReferences"
    }
  ]
}