{
  "content": [
    {
      "type": "text",
      "text": "# Booval, Queensland\n\n| local_map           = yes\n| zoom                = 12\n| pop                 = 2723\n| pop_year            =\n| pop_footnotes       =\n| established         =\n| postcode            = 4304\n| area                = 1.7\n| timezone            = AEST\n| utc                 = +10:00\n| dist1               = 2.9\n| dir1                = E\n| location1           = Ipswich CBD\n| dist2               = 36.7\n| dir2                = SW\n| location2           = Brisbane CBD\n| dist3               =\n| dir3                =\n| location3           =\n| dist4               =\n| dir4                =\n| location4           =\n| lga                 = City of Ipswich\n| stategov            = Ipswich\n| fedgov              = Blair\n| near-nw             = East Ipswich\n| near-n              = North Booval\n| near-ne             = Bundamba\n| near-w              = East Ipswich\n| near-e              = Bundamba\n| near-sw             = Silkstone\n| near-s              = Silkstone\n| near-se             = Bundamba\n}}\nBooval is a suburb of Ipswich in the City of Ipswich, Queensland, Australia. In the , Booval had a population of 2,723 people.\nGeography\nBooval contains both residential and commercial areas.\nBooval straddles Brisbane Road, the main arterial link to the Ipswich Motorway. The Booval Fair shopping centre, located on Brisbane Road, contains a number of major chain stores, including Woolworths and Big W, while a number of smaller businesses line South Station Rd and Brisbane Rd.\nHistory\nThe origin of the suburb name is the Ugarapul  language word meaning frilled lizard.\nThe first large-scale cotton crops in Queensland were grown at Booval in the 1860s.\nThe settlement of Booval derived from a private estate and its strategic location on the road and railway between Ipswich and Brisbane.\nIn December 1895, the Anglican Diocese's architect John Buckeridge called for tenders to erect the Church of All Saints in Bundanba (as Bundamba was then known) on land donated by Miss Ferrett and Mr. Harry Ferrett. Bishop William Webber laid the foundation stone on Friday, 24 January 1896. Bishop Webber opened and dedicated the new church on Saturday, 16 May 1896. In April 1897, Harry Ferrett was married in the church. In 1913, the church building was moved by rolling it on beer barrels to Silkstone. In 1930, it was moved again on a flat-top lorry to its current location in Booval. A new church hall for All Saints' Anglican Church was opened on Sunday, 10 May 1930. The second All Saints' Anglican Church was dedicated in 1983.\nBooval Primitive Methodist Church opened on Wednesday, 16 May 1900. It was established by a group of Primitive Methodist believers who disagreed with the plan to unite all the Methodist denominations into a single Methodist Church in Australia, choosing to break away and establish an ongoing Primitive Methodist congregation. Circa November 1905, the Primitive Methodist congregation sold the church building to the Congregational Church, which held its opening services on Sunday, 26 November 1905 with a celebratory tea-meeting on Saturday, 9 December 1905. The church building was at 148 Brisbane Road (north-western corner with South Station Road, ). The Congregational Church held its last service in that church building in December 1969, selling the church building to fund the purchase of a new site on the corner of Sloman Street and South Station Road where they would build a new church to replace the house on the site at the time of purchase. However, the planned amalgamation of the Congregational Church into the Uniting Church in Australia disrupted the plan, and the Congregational members became members of the Trinity Uniting Church in North Booval. The church building on the corner of Brisbane Road and South Station Road is no longer extant (the site has a Kentucky Fried Chicken store as at February 2022).\nBy the time of 1915, Booval was occupied largely by miners, many of which had Welsh origins.\nSacred Heart Catholic Primary School opened on 25 January 1931.\nIn August 1947, the Glenville Hall in South Station Road was relocated to 185 Cascade Street, Raceview, to become the Raceview Public Hall. As of 2022, the building is still extant but not in use as a public hall.\nSacred Heart Catholic Secondary School opened in 1964 and closed in 1975.\nTrinity Ipswich Uniting Church in North Booval was formed in July 1970 as an amalgamation of a number of Ipswich churches:\n* Booval Congregational Church, originally located on the corner of Brisbane Road and South Station Road until December 1969, and then at a house on the corner of Sloman Street and South Station Road where it closed in July 1970\n* North Booval Presbyterian Church on Bridge Street\n* North Booval Methodist Church on Tuggerah Street\nVision Christian School opened on 25 January 1982 and closed in 1992.\nDemographics\nIn the , Booval had a population of 2,622 people.\nIn the , Booval had a population of 2,723 people.\nHeritage listings\n, 2015]]\nBooval has a number of heritage-listed sites, including:\n* Green Street: Booval War Memorial\n* 14 Cothill Road: Booval House\nTransport\nBooval railway station provides access to regular Queensland Rail City network services to Brisbane, Ipswich and Rosewood via Ipswich. It was opened in 1876.\nEducation\nSacred Heart School is a Catholic primary (Prep-6) school for boys and girls at 25 Cothill Road (). In 2018, the school had an enrolment of 538 students with 35 teachers (31 full-time equivalent) and 21 non-teaching staff (15 full-time equivalent).\nAmenities\nThe Ipswich City Council operates a fortnightly mobile library service which visits Cole Street.\nAll Saints' Anglican Church is at 144 Brisbane Road ().\nParks and sports facilities\n*Cameron Park\n*Basketball Ipswich\n*Booval Bowls Club\nThe Booval Swifts rugby league football club bears the suburb's name. During the 1920s, two of Booval's players, Dan Dempsey and Arthur Henderson were selected to represent Australia. The club has also produced other such notable players as Des Morris and Kevin Walters.\nPlaces of worship\n*Sacred Heart Catholic Church, Cothill Rd\n*Uniting Church, Glebe Rd\n*Anglican Church, Brisbane Rd\nReferences\nExternal links\n* [http://queenslandplaces.com.au/booval University of Queensland: Queensland Places: Booval]"
    }
  ]
}