{
  "content": [
    {
      "type": "text",
      "text": "# Boris Johnson Is a Fucking Cunt__disambig_1\n\n| genre         = Punk rock, comedy\n| length        = 0:56\n| label         = Disco Minge\n| next_title    = Boris Johnson Is Still a Fucking Cunt\n| next_year     = 2021\n| misc          = }}\n}}\n\"Boris Johnson Is a Fucking Cunt\" is a single by the Kunts, a band created by Kunt and the Gang. The song is directed at the then prime minister of the United Kingdom Boris Johnson and consists of the words \"Boris Johnson is a fucking cunt\" being repeated. Originally released on the 2020 album Kunts Punk in Your Face, the track was later released as a single, and Kunt campaigned to make the single the 2020 UK Christmas number one. The song reached number five, although the BBC refused to name either the song or the artist due to the very strong language in both. In November 2021, the band announced a sequel, \"Boris Johnson Is Still a Fucking Cunt\", once again campaigning to top the Christmas chart. It also reached number five.\nHistory\nin 2019]]\n\"Boris Johnson Is a Fucking Cunt\" was based on a previous song by Kunt and the Gang entitled \"If You Don't Like This Song, You're a Fucking Cunt\" which appeared as a B-side on the extended play Men With Beards (What Are They Hiding?). It was originally released as a track on the album Kunts Punk in Your Face in July 2020. On 10 December 2020, Kunt announced that he was releasing the track as a single, with the aim of making the track the 2020 Christmas number one single. He asked fans to buy and stream the song between 18–24 December 2020. In order to increase the chances of reaching the top spot, Kunt also released multiple versions of the track with the same title. 23 versions were made, including a \"Safe-For-Work Sausage Roll Remix\", which changed the central lyric to: \"Boris Johnson is a sausage roll\", in reference to the YouTuber LadBaby, who had topped the Christmas singles chart for the past two years with charity singles that were songs reworded to mention sausage rolls, and who would ultimately top the 2020 chart with \"Don't Stop Me Eatin', a cover of \"Don't Stop Believin\" by Journey.\nThe single's artwork is a parody of The Sun newspaper.\nIn the Christmas midweek chart, the song reached 19th. On BBC Radio 1 show The Official Chart: First Look on Radio 1, presenters Vick Hope and Katie Thistleton neither named the Kunts or the song, despite the safe-for-work version, instead saying: \"Now at 19 we've got a track about Boris Johnson that has so many bad words in it we can't play it on daytime Radio 1.\" The song gained support from celebrities such as Charlie Brooker.\nThe song ultimately reached number five on the UK Singles Chart, where it became the Top 10 single with the second shortest runtime ever at 56 seconds, only beaten by the anti-Thatcher campaign record \"Ding-Dong! The Witch Is Dead\" by The Wizard Of Oz film cast (51 seconds). It also reached number two on the UK Singles Downloads Chart, number three on the UK Independent Singles Chart, and number 90 on the Official Audio Streaming Chart. It also reached number 131 in the Billboard Global 200 Excl. US. In an interview with British Comedy Guide in March 2021, Kunt said despite the success of the song his business with Johnson had not been concluded as he was still running the country. All 23 versions of the song were later released as a single extended play. JoyZine gave the song a positive review, arguing that the song summed up both the year 2020 and Johnson.\n\"Boris Johnson Is Still a Fucking Cunt\"\n| length        = 1:05\n| label         = Direct Action\n| prev_title    = Boris Johnson Is a Fucking Cunt\n| prev_year     = 2020\n| next_title    = Prince Andrew Is a Sweaty Nonce\n| next_year     = 2022\n| misc          = }}\n}}\nOn 28 November 2021, Kunt announced that he would once again campaign for the Christmas number one, releasing a follow-up to \"Boris Johnson Is a Fucking Cunt\", entitled \"Boris Johnson Is Still a Fucking Cunt\". Again, the lyrics consisted of the title of the song being repeated. The song is performed to various tunes, including \"Doctorin' the Tardis\" by The Timelords, which in turn samples \"Rock and Roll Part II\" by Gary Glitter, The Addams Family Theme, and \"Personal Jesus\" by Depeche Mode. On the day of the announcement a music video was released of the song, which depicts the Kunts as the characters from the film Ghostbusters hunting down Johnson, in a manner similar to the original music video for \"Doctorin' the Tardis\". Moreover, the single's artwork is based on the film's logo. Kunt asked people to start buying and streaming the song from 17 December 2021, in order to secure a high chart position. The track was released under a new label, Direct Action. Ten different versions of the song were initially launched, including versions by Cassetteboy, Petrol Bastard, Destruction, Rob Manuel and Armogortion, as well as several sausage roll-themed safe-for-work versions involving groups such as a local neighbourhood children's group and a three-year-old named \"BabyLad\", parodying LadBaby.\nAfter two days, the song reached No. 5 on the midweek charts, and was the second-most-downloaded track during the same period. Once again, The Official Chart: First Look on Radio 1 refused to name the Kunts or the song. They also did not mention that Johnson was the subject, only saying: \"At number five is a rude song we're not able to mention.\" On 20 December, an 11th version of the song was released for download. On 21 December, Kunt promoted the song by driving around Westminster in a lorry advertising the track. A total of 13 different versions were released, the last being at midday on 23 December on Bandcamp entitled \"The Last Night of the Kunts Mix\". The song reached number 5 in the Christmas chart.\nThe song was praised by Mark Beaumont in NME, who wrote that while Ed Sheeran, Elton John and LadBaby's version of \"Merry Christmas\" should be praised for raising money for charity with their song, the Kunts were \"tackling the root cause of the nation's poverty problem\" by dealing with Johnson directly. In an interview with Official Charts, LadBaby attacked people for supporting the Kunts, criticising the use of language while saying that their song was raising money for charity while \"Boris Johnson Is Still a Fucking Cunt\" was not. Kunt responded by saying it is within peoples' rights to express dissatisfaction with the government and that his supporters had nothing to be ashamed of. He also stated that the original \"Boris Johnson Is a Fucking Cunt\" did raise money for the charities Mind and Cardiac Risk in the Young, but they did not want to use charity to publicise their songs and wanted to avoid giving a percentage of fees to record companies and sales platforms. Kunt told Clash that he thought LadBaby's song was \"utter diarrhoea\".\nThe 2021 single charted at number 5 on the Official Singles Chart Top 100 of 24–30 December 2021, after amassing a sales total of 52,915. As a version of the 2021 Boris song was released with a runtime of 56 seconds (with other remixes stretching the track to 1 minute 41 seconds), it joins the band's previous effort in the list of shortest Top 10 singles. It was the 11th best-selling song in the United Kingdom for the year 2021. The song also reached number 175 in the Billboard Global chart.\nOn 13 January 2022, Kunt announced a 24/7 stream-a-thon between 14–20 January to try and get the song back in the charts, following the Westminster lockdown parties controversy. Cassetteboy again supported him, releasing a mash-up video of Johnson performing to \"Killing in the Name\" by Rage Against the Machine with a message to support the stream.\nAftermath\nIn July 2022, Johnson announced his resignation as Conservative Party Leader, but said he would be staying on as a caretaker Prime Minister until a new leader was elected. Following the news, the Kunts released a third song, \"Fuck Off Boris You Cunt\", marking what they described as the third of a trilogy of songs related to Johnson. The band made all three songs available for free on Bandcamp, with Kunt instead suggesting that people should donate money to Mind.\nOn 5 September 2022, the day Johnson was replaced as leader of the Conservative Party by Liz Truss, the Kunts worked with website The Rock Fix to release a limited edition run of 300 7-inch vinyl singles, coloured white with a blue and red splatter pattern. It features \"Boris Johnson Is a Fucking Cunt\" and \"Boris Johnson Is Still a Fucking Cunt\" on Side A, and \"Fuck Off Boris You Cunt\" on Side B. All money made from sales from the single went to The Trussell Trust and Mind.\nOn 17 November 2022, Kunt announced that he would be launching a third attempt at the Christmas No. 1 with a track entitled \"Fuck the Tories\". It reached No. 7.\nIn January 2023, The Kunts released \"Rishi Sunak is a Rat-Faced Cunt\", with updated lyrics targeting the then Prime Minister.\nPersonnel\nThe performers on the tracks are:\n*Kunt – vocals\n*Carsehole – lead guitar\n*Rubber Johnny – bass guitar\n*Fucksticks – drums\nCharts\n{| class=\"wikitable sortable plainrowheaders\" style=\"text-align:center\"\n|+ Chart performance for \"Boris Johnson Is a Fucking Cunt\"\n! scope=\"col\"| Chart (2020–2021)\n! scope=\"col\"| Peakposition\n|-\n! scope=\"row\"| Global 200 Excl. U.S. (Billboard)\n| 131\n|-\n|-\n|}\n{| class=\"wikitable sortable plainrowheaders\" style=\"text-align:center\"\n|+ Chart performance for \"Boris Johnson Is Still a Fucking Cunt\"\n! scope=\"col\"| Chart (2021–2022)\n! scope=\"col\"| Peakposition\n|-\n! scope=\"row\"| Global 200 (Billboard)\n| 175\n|-\n|-\n|}\nSee also\n* Tory scum\nReferences\nExternal links\n* [http://www.borisjohnson.info The official website for the song]"
    }
  ]
}