{
  "content": [
    {
      "type": "text",
      "text": "# Boston Music Awards\n\nFounded in 1987, the Boston Music Awards are a set of music awards given annually that showcase talent in the Boston, Massachusetts, area.\nPast shows have featured such notable talent as Aerosmith, Paula Cole, Esperanza Spalding, Boston, Rubyhorse, Bang Camaro, the Dresden Dolls, Dropkick Murphys, JoJo, Pat Metheny, Amanda Palmer, Phish, Donna Summer, Shea Rose, James Taylor and Jada.\nSelected highlights\n2023\nThe 2023 Boston Music Awards were held at Big Night Live on December 20, 2023. Noah Kahan won four awards including Artist of the Year.\n2022\nThe 2022 Boston Music Awards took place on December 14, 2022 at Big Night Live. Cousin Stizz regained their award for \"Best Artist of the Year\".\n2021\nAfter taking a year off due to the COVID-19 pandemic,  the Boston Music Awards took place live on December 8, 2021 at the Brighton Music Hall. Once again, BIA took home the \"Best Artist of the Year\" Award.\n2020\nThe 2020 Boston Music Awards were not conducted in person like in from previous years due to COVID-19. The \"Best Artist of the Year\" Award went to hip-hop artist, BIA.\n2019\nThe 2019 Boston Music Awards took place on December 11, 2019. Cousin Stizz made it back-to-back by winning the \"Best Artist of the Year\" Award.\n2018\nThe 2018 Boston Music Awards took place on December 12, 2018 at the\nHouse of Blues in Boston. Cousin Stizz won \"Artist of the Year\".\n2017\nThe 2017 Boston Music Awards took place on December 7, 2017, at the [http://www.houseofblues.com/boston House of Blues, Boston]. [http://bostonmusicawards.com/bma/boston-music-awards-2017/ 36 winners] were announced with PVRIS taking home the coveted Artist of the Year Award. The night saw 10 live performances from Bad Rabbits, Tall Heights, Weakened Friends, [http://www.arclassicrecords.com/stl-gld/ STL GLD], [https://www.carissajohnsonmusic.com/ Carissa Johnson], Avenue, no hope / no harm, Latrell James, Camino 84, and Sidney Gish.\n2016\nThe 2016 Boston Music Awards took place on December 8, 2016. PVRIS took home the \"Artist of the Year\" Award.\n2015\nThe 2015 Boston Music Awards were held on December 9, 2015 at the Sinclair in Cambridge. Awards included: Artist of the year: Speedy Ortiz; Album/EP of the year: Foil Deer by Speedy Ortiz; New Artist of the year: Palehound; Rock/Indie artist of the year: Dirty Bangs; Hip-hop artist of the year: Michael Christmas; Pop artist of the year: Ruby Rose Fox; International artist of the year: Shun Ng; Metal artist of the year: Worshipper; Jazz artist of the year: Lake Street Dive.\n2012\nShea Rose: Pop/R&B Artist of the Year\n2011\nDropkick Murphys: Artist of the year and live artist of the year\nShea Rose: R&B/Soul/Urban Contemporary Artist of the Year\nEsperanza Spalding: Jazz Artist of the Year\n2010\nThe 2010 Boston Music Awards were presented on December 6, 2010, at the Liberty Hotel in Boston. Peter Wolf's  Midnight Souvenirs won the prize for album of the year and Amanda Palmer was named artist of the year. The Dropkick Murphys were Live Artist of the Year, M-Dot was named Hip-Hop Artist of the year, Kingsley Flood won as New Artist of the Year, and \"Living in America\" by Dom won Song of the Year. In total, 32 awards were given.\n2007\nThe 2007 Boston Music awards took place at The Orpheum in Boston on December 1st. Kill switch Engage won Act of the Year and Most outstanding metal/hardcore band of the year.\n2006\nThe 2006 Boston Music Awards were held in the Avalon Ballroom on September 27, 2006. Awards included:\nFemale Vocalist of the Year: Amanda Palmer (Dresden Dolls); Male Vocalist of the Year: Josh Ritter; Outstanding Pop/Rock Band: Dresden Dolls; Act of the Year: Dresden Dolls; Best New Local Act: HUMANWINE; Album of the Year (Indie): Misson of Burma – The Obliterati; Album of the Year (Major): Guster – Ganging Up On the Sun; Female Singer/Songwriter: Melissa Ferrick; Male Singer/Songwriter: Will Dailey; Hall of Fame Induction: Gang Green Best Funk or Jam Band: Parker House and Theory\n2005\nRay Lamontagne: Best Male Singer/Songwriter, Album of the Year, and Song of the Year\n2004\nThe So and So's: Local Debut Album of the Year\n2002\nCatie Curtis: Song of the Year on an Indie Label\n2001\nAmerican Hi-Fi: Rising Star award\n2000\nPowerman 5000: Album Of The Year and the Rising Star award\n1999\nLori McKenna: New Contemporary Folk Act\n1998\nLaurie Geltman: Outstanding Female Vocalist.\nOrbit: Debut Album of the Year \"Libido Speedway\" A&M (Major Label)\nAmazing Royal Crowns: Rising Star, Debut Album of the Year (Indie Label), Video of the Year and Outstanding Club Band\nReferences\nExternal links\n* [https://bostonmusicawards.com/ Official website]"
    }
  ]
}