{
  "content": [
    {
      "type": "text",
      "text": "# Botswana University of Agriculture and Natural Resources\n\n| campus = Content Farm, Sebele (12km north of Gaborone city centre), Botswana\n| website =\n| location =  Botswana\n}}\nBotswana University of Agriculture and Natural Resources (BUAN) formally known as Botswana College of Agriculture (BCA) is an agricultural and natural resources University located in Gaborone, Botswana.\nHistory\nIt was established by an act of the Parliament of Botswana, Act no. 12 of 2015 as a Parastatal under the Ministry of Agricultural Development and Food Security (MoA).\nThe process of transformation was inaugurated when the, then Ministry of Agriculture announced the Government's decision at a ceremony at the Sebele campus on the 12th of November 2013. On the 1st of February 2016, BUAN became a university through the commencement of the Act of Parliament 12 of 2015 as a Parastatal under the Ministry of Agricultural Development and Food Security (MoA).\nMeat Industry Training Institute\nThe Meat Industry Training Institute (MITI) was established in 1984 through an agreement between Food and Agriculture Organisation (FAO), Rome (working in conjunction with the government of Denmark) and the government of Botswana. At that point it was called the Regional Training Centre for Meat Inspectors and Meat Technologists in Africa. The centre was handed to the government of Botswana and managed by the Department of Veterinary Services of the Ministry of Agriculture and it was renamed Meat Inspection Training Centre (MITC). On  1 April 2012, the Institution was taken over by Botswana College of Agriculture (BCA) now BUAN. The centre offers a Certificate programme in Meat Inspection and is based in the Southern part of Botswana in a town called Lobatse.\nCentre for In-service and Continuing Education\nThe Centre for In-service and Continuing Education (CICE) was opened in 1995 to extend BCA's mandate through provision of quality in-service and continuing education in agriculture and natural resources. The Centre designs, develops and delivers training [https://www.bqa.org.bw/ Botswana Qualification Authority (BQA)] accredited that are market driven.\nReferences\nExternal links\n*\n* [https://bojaas.buan.ac.bw/index.php/jaas Botswana Journal of Agriculture and Applied Sciences]"
    }
  ]
}