{
  "content": [
    {
      "type": "text",
      "text": "# Boulwarism\n\nBoulwarism is the tactic of making a \"take-it-or-leave-it\" offer in a negotiation, with no further concessions or discussion.  It was named after General Electric's former vice president Lemuel Boulware, who promoted the strategy. One example of Boulwarism is a car dealership advertising \"bottom line pricing\" on its cars, and enforcing that policy.\nIn contrast to its use in collective bargaining, Boulwarism is a lawful negotiation tactic between private parties. Nevertheless, most negotiation experts describe Boulwarism as detrimental.  (Using the above example on car sales, statistics show that buyers want a discount off the advertised price.) Experts say statistics show that while those using Boulwarism may think a take-it-or-leave-it offer shows that they are negotiators or tell all concerned that \"the client means business,\" Boulwarism may instill resentment, bitterness, or someone taking offense. It may unintentionally cut off negotiations if the offeror was bluffing about the offer being bottom line, or the tactic may result in parties walking away from the negotiations.\nIn 1950s negotiations with labor unions, Boulwarism was an offer which was ultimate and to which no further revisions would be made. Before making the offer, the offering party would check all relevant details of the labor dispute, such as competitors' policy on similar problems and industry standards. It was commonly used to refer to \"take-it or leave-it\" bargaining tactics.  According to Boulware, the position would be locked in and would not be modified unless new material facts or considerations came to light.  Events such as a strike were not considered to be a cause to change the rational solution that had been proposed.\nIt was part of a larger campaign that was formulated to undermine the authority and persuasiveness of union leadership. Boulware himself suggested that it was a comprehensive education and training path, including a constant flow of corporate messages and documents, in which the employer would try to convince both sides to avoid engaging in conduct that was contrary to their own interests.  It is in concept an alternative to traditional collective bargaining.\nIn collective bargaining (union matters), such practices and associated tactics (Boulwarism) were found by the National Labor Relations Board to be an unfair labor practice in violation of the Wagner Act and the National Labor Relations Act on a number of different grounds, particularly by breaching of the duty to bargain in good faith, bypassing the union and appealing to the union membership directly.\nSee also\n*Duty of fair representation\n*Hobson's choice\n*International Union of Electrical Workers\n*Surface bargaining\n*Ultimatum\nReferences\nFootnotes\nSources\n*\n*\n*\n*\n*\nFurther reading\n*\n*"
    }
  ]
}