{
  "content": [
    {
      "type": "text",
      "text": "# Boulia, Queensland\n\n| pop                 = 314\n| pop_year            =\n| pop_footnotes       =\n| area                = 155.1\n| timezone            = AEST\n| utc                 = +10:00\n| maxtemp             = 31.7\n| mintemp             = 16.6\n| rainfall            = 264.3\n| stategov            = Gregory\n| fedgov              = Kennedy\n| dist1               = 289\n| dir1                = SSE\n| location1           = Mount Isa\n| dist2               = 362\n| dir2                = W\n| location2           = Winton\n| dist3               = 812\n| dir3                = E\n| location3           = Alice Springs, (N.T.)\n| dist4               = 1228\n| dir4                = W\n| location4           = Rockhampton\n| dist5               = 1719\n| dir5                = WNW\n| location5           = Brisbane\n| near-n              = Wills\n| near-ne             = Wills\n| near-e              = Wills\n| near-se             = Wills\n| near-s              = Wills\n| near-sw             = Wills\n| near-w              = Wills\n| near-nw             = Wills\n}}\nBoulia () is an outback town and locality in the Shire of Boulia, Queensland, Australia. In the , the locality of Boulia had a population of 314 people.\nBoulia is the administrative centre of the Boulia Shire, population approximately 600, which covers an area of .\nThe area is best known for sightings of the Min Min lights, mysterious shimmering lights that appear at night. The lights are said to be caused by atmospheric refraction that occurs when cold air is trapped below warmer air, a phenomenon known as Fata Morgana.\nGeography\nBoulia is in the Central West Queensland and is located approximately  by road south of Mount Isa. Boulia is at the crossroads of a number of outback routes, including the Boulia Mount Isa Road (which goes north-west towards Mount Isa), the Selwyn Road (which goes north-east to Selwyn), the Winton Road, which goes east toward Winton), and the Boulia Bedourie Road (which goes south-west to Bedourie). The Donohue Highway coming from the Northern Territory joins the Boulia Mount Isa Road just outside of Boulia, which together with the Winton Road forms part of the Outback Way billed as \"Australia's Longest Shortcut\", a  gravel-and-bitumen road which runs between Laverton in Western Australia and Winton in Queensland.\nBoulia is in the Channel Country. All watercourses in this area are part of the Lake Eyre drainage basin, and most will dry up before their water reaches Lake Eyre. Boulia lies on the Burke River, which was named after the explorer Robert O'Hara Burke who passed through the area with the Burke and Wills expedition in 1860. The river flows from the north-east to the south-east through the locality.\nAlthough it is contrary to the locality boundary principles of the Queensland Government, the locality of Boulia is an \"island\" entirely surrounded by the locality of Wills.\nExtensive grazing of beef cattle on native vegetation is the predominant industry. Boulia is at the heart of the Channel Country of western Queensland where, during rain events, channels running between the rivers and creeks of the region fill with water and spread that water over expansive areas. When it does rain heavily, the Mitchell grass plains respond magnificently and result in the Channel country around Boulia, being among the finest beef producing country in Australia.\nThe town has a grid layout with 6 roads running east–west and 5 running north–south. Herbert Street is the main street where most of the civic and commercial premises are located.\nHistory\nThe town was named by surveyor Frederick Arthur Hartnell in 1882 and was derived from the name of the waterhole near the township called \"bool-yo\" in the Pitta Pitta language.\nThe township was gazetted in 1879. Boulia Post Office opened on 1 July 1879.\nBoulia Provisional School opened on 7 October 1889. It became Boulia State School on 1 January 1909. In December 1937, the school building of the closed state school in Selwyn was relocated to be used as a school building in Boulia.\nThe Good Shepherd Catholic Church was built in 1955.\nIn 2019, the Boulia Outback Chapel was established in the former Anglican church building. It is part of the Baptist Church.\nIn 2019, the Boulia Outback Chapel was established in the former Anglican church building. It is part of the Baptist Church.\nDemographics\nIn the , the town of Boulia had a population of 205 people.\nIn the , the locality of Boulia had a population of 230 people.\nIn the , the locality of Boulia had a population of 301 people.\nIn the , the locality of Boulia had a population of 314 people.\nClimate\nBoulia experiences a hot desert climate (Köppen: BWh), with very hot, occasionally rainy summers, and very mild, dry winters with cool nights and rare frosts. Average maxima vary from  in July to  in December. Average annual rainfall is very low: , occurring within 24.1 rainfall days. Rainfall is extraordinarily erratic, as while only  fell in 1905;  was recorded in January 1974 alone. The town is very sunny, averaging 186.4 clear days and only 43.6 cloudy days annually. Extreme temperatures have ranged from  on 31 August 1906 to  on 7 February 1915.\n}}\nEvents\nThe town hosts the Boulia Camel Races, the longest camel race (running a 1500m cup final) on the Australian camel racing circuit.\nEach year at Easter, the Boulia Racecourse reserve plays host to a rodeo, campdrafting, and horse racing event which is a social highlight for the district.\nDuring August drag races are held at the Boulia Airport which attracts an enthusiastic crowd.\nFacilities\nBoulia has a range of public facilities open to the community. These include a public library, public hall, sports complex, racecourse, the Min Min encounter tourist centre, museum, visitor information centre, and camel races.  The Boulia Shire Council operates a public library at 18 Burke Street.\nAn 18-hole golf course with sand greens is located on the Boulia Winton Road. Greens fees are not charged for the use of this course and a clubhouse with bar facilities is available.\nBoulia has Australia's first three-dimensional zebra crossing which is based on an optical illusion. It is to improve road safety and also to be a tourist attraction. It was introduced in 2018 after Boulia Shire Council mayor Rick Britton saw similar crossings in Iceland, Malaysia, India, New Zealand and the United States on social media.\nThe Boulia branch of the Queensland Country Women's Association has its rooms at 61 Moonah Street.\nBoulia Outback Chapel is at 49 Moonah Street ().\nThe Good Shepherd Catholic Church is at 33 Moonah Street ().\nEducation\nBoulia State School is a government primary (Early Childhood-6) school for boys and girls at Templeton Street (). In 2017, the school had an enrolment of 27 students with 4 teachers and 4 non-teaching staff (3 full-time equivalent).\nThere are no secondary schools in Boulia. The nearest government secondary schools are in Mount Isa and Winton, but these are too distant for a daily commute. The Spinifex State College in Mount Isa offers boarding facilities. Other boarding schools or distance education would be options for secondary schooling.\nMars\nThe name Boulia is used as a name for a crater on the planet Mars, specifically commemorating the town.\nHeritage listings\nBoulia has a number of heritage-listed sites, including:\n* Boulia Stone House, Pituri Street\nSee also\n* Boulia Airport\nReferences\nExternal links\n* [http://www.boulia.qld.gov.au Shire website]\n* [http://queenslandplaces.com.au/boulia-and-boulia-shire University of Queensland: Queensland Places: Boulia and Boulia Shire]\n* [https://gisservices.information.qld.gov.au/arcgis/rest/directories/historicalscans/cad_scans/cad-map-town-boulia-1974.jpg Town map of Boulia, 1974]"
    }
  ]
}