{
  "content": [
    {
      "type": "text",
      "text": "# Braden King\n\nBraden King (born 1971, North Carolina) is a New York–based filmmaker, photographer and visual artist. His feature film, Here (2011), starring Ben Foster and Lubna Azabal, premiered at the 2011 Sundance  and Berlin Film Festivals and was distributed theatrically by Strand Releasing in 2012. A multimedia installation version of the project, Here [ The Story Sleeps ], premiered at The Museum of Modern Art in 2010 and toured internationally with live soundtrack accompaniment by composer Michael Krassner and Boxhead Ensemble. King's previous work includes the feature film ''Dutch Harbor: Where the Sea Breaks It's Back (co-directed with photographer Laura Moya), the award-winning short film Home Movie'' and music videos for Glen Hansard, Sparklehorse, Sonic Youth, Bonnie 'Prince' Billy (Will Oldham) and Dirty Three.\nCareer\nIn 1998, Braden King and Laura Moya co-directed Dutch Harbor: Where the Sea Breaks its Back about crab fishing on Unalaska Island, Alaska.\nKing's short films include the award-winning Home Movie and The Story of the Lark, a film about Laurie Anderson that was released with her 2010 album Homeland (Nonesuch Records) as well as music videos featuring Sonic Youth, Will Oldham, Sparklehorse, Chan Marshall, Tortoise (band), Low, and Yo La Tengo.\nNon-narrative work includes Heaven is a Place / Nothing Ever Happens (2007), a film and video installation commissioned by Chris Doyle for the 50,000 Beds exhibition at the Aldrich Contemporary Art Museum and The Story is Still Asleep, a multi-channel video piece with live musical accompaniment that premiered at the 2008 Sundance Film Festival.\nIn 2005, King directed Looking for a Thrill: An Anthology of Inspiration, an interactive DVD project commissioned by Thrill Jockey Records.  The film features interviews with 112 musicians and artists, including Björk, Califone, Freakwater, Mouse on Mars, Sea and Cake, Tortoise, Trans Am, Yo La Tengo, Mike Watt, Thurston Moore, Jem Cohen, Vic Chesnutt, Kurt Wagner, Ian Mackaye, Steve Albini and Jon Spencer.\nIn 2002, King produced and co-curated (with curator Astria Suparak) Boxhead Ensemble’s Stories, Maps and Notes From the Half-Light tour, a program of short films with a live soundtrack at Fotofest in Houston.\nKing's work has been exhibited at international film festivals including Sundance, Rotterdam, Karlovy Vary, Berlin, London, Melbourne, Singapore and Ann Arbor; and institutions including the MoMA, The Chicago Museum of Contemporary Art, Mass MoCA, The Aldrich Contemporary Art Center; and his work has been broadcast on HBO, BBC, Sundance Channel, MTV, Channel 4 (UK) and others.  He has lectured at Yale University, The University of Southern California, Bard College, Wheaton College, the Graduate School at the City University of New York, New York Foundation for the Arts and Creative Capital.  He graduated magna cum laude from the USC School of Cinema-Television in Los Angeles in 1993.\nKing is represented for commercial work by New York–based Washington Square Films. King's commercial clients include American Airlines, Axiom Law, Microsoft, Coca-Cola, ESPN, Johnson & Johnson, Miller Beer, Nikon, The Partnership for a Drug-Free America, Samsung, Scholastic, Siemens and UNICEF.\nTruckstop Media, King's digital agency, has produced dozens of multi-media projects since 2001, including the award-winning website and mobile apps for Morgan Spurlock and Paul G. Allen's WE THE ECONOMY (2014), the project’s follow up, WE THE VOTERS (2016) and experiential installations for Google, Tumblr and The Museum of Modern Art.\nKing has shot his next feature film, The Evening Hour, a small-town West Virginia crime thriller based on the book of the same name. The Evening Hour stars Philip Ettinger, Stacy Martin, and Lili Taylor. The film was set to shoot during the fall of 2018.\nHonors and awards\n* 2011 C.I.C.A.E. Prize at the 2011 Berlin Film Festival\n* 2010 Cinereach at Sundance Institute Fellowship\n* 2008 Cannes Film Festival Atelier, Sundance / NHK International Filmmakers Award\n* 2007 Sundance Writers and Directors Lab Fellowships and grants from the Creative Capital, Rockefeller Foundation, Annenberg Foundation and Sloan Foundation.\nFilmography\n{|class=\"wikitable\"\n|-\n! Year\n! Title\n! Director\n! Producer\n! Writer\n! DoP\n! Editor\n! Notes\n|-\n| 1998\n| Dutch Harbor: Where the Sea Breaks Its Back\n|\n|\n|\n|\n|\n|\n|-\n|rowspan=2|2005\n| Looking for a Thrill: An Anthology of Inspiration\n|\n|\n|\n|\n|\n|\n|-\n| The Kills: I Hate the Way You Love\n|\n|\n|\n|\n|\n|\n|-\n| 2006\n| Sonic Youth: Do You Believe in Rapture\n|\n|\n|\n|\n|\n|\n|-\n| 2009\n| Home Movie\n|\n|\n|\n|\n|\n|\n|-\n| 2010\n| Homeland: The Story of a Lark\n|\n|\n|\n|\n|\n|\n|-\n| 2011\n| Here\n|\n|\n|\n|\n|\n| Also still photographs\n|-\n| 2020\n| The Evening Hour\n|\n|\n|\n|\n|\n|\n|}\nCamera operator\n* Screaming Masterpiece (2005)\nReferences\nExternal links\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n* HERE Filmmaker Braden King|url=https://www.indiewire.com/article/futures_filmmaker_braden_king_is_here|newspaper=Indiewire|date=May 14, 2010}}"
    }
  ]
}