{
  "content": [
    {
      "type": "text",
      "text": "# Brad Edwards (journalist)\n\nBrad Edwards (December 31, 1947, in Indiana, Pennsylvania &ndash; May 16, 2006, in Oklahoma City, Oklahoma), was a news reporter for television station KFOR-TV in Oklahoma City, Oklahoma. His investigative journalism, through which he mostly represented the city's elderly and working class, made him one of the area's most influential and well-known media personalities.\nCareer\nEdwards started his broadcasting career in radio in 1961 at WDAD in Indiana, Pennsylvania, at age 14 as a disc jockey and newscaster. Upon graduating from Indiana University of Pennsylvania, he was recruited by the U.S. Air Force and serve as a military news broadcaster in Thailand. in 1971, he became stationed at Wichita Falls and was hired as a part-time reporter, photographer, and anchor at NBC affiliate KFDX-TV. In 1973 after leaving the service, Brad joined WKY-TV (now KFOR-TV) as a general assignment reporter and photographer, before becoming the station's 10:00PM anchor. Edwards also started the annual campaign \"Warmth 4 Winter\", a partnership between the station, the Salvation Army and Oklahoma City area dry cleaners to collect coats for those less-fortunate.\nEdwards began the investigative report segment In Your Corner in 1981, reporting on consumer advocacy issues, questionable business practices and government issues, and did the segment until a few months prior his death. In 2005, Edwards contracted an unknown illness with symptoms including a heart infection, bronchitis and inflammation of the lungs. Edwards slipped into a coma and died six days later on May 16, 2006, as a result of a brain aneurysm. He was survived by his wife, Mary Ann, and a daughter, Ashton, who currently works as a news director at KPCW in Park City, Utah.\nEdwards was inducted into the Oklahoma Association of Broadcasters Hall of Fame in 2006. His In Your Corner segments continue to this day. Lance West, Ali Meyer, Cherokee Ballard and Scott Hines covered stories on a rotating basis for several months after Edwards' death, until Hines was named as the sole reporter of the segment in 2007. Oklahoma Attorney General Drew Edmondson created the Brad Edwards Consumer Champion Award to honor those who fight for consumer rights.\nReferences"
    }
  ]
}