{
  "content": [
    {
      "type": "text",
      "text": "# Braking distance\n\nBraking distance refers to the distance a vehicle will travel from the point when its brakes are fully applied to when it comes to a complete stop. It is primarily affected by the original speed of the vehicle and the coefficient of friction between the tires and the road surface,{{#tag:ref |The average friction coefficient (µ) is related to the tire's Treadwear rating by the following formula:  \\mu =\\frac{2.25}{TW^{0.15}}   See [http://hpwizard.com/tire-friction-coefficient.htmlg HPwizard on Tire Friction]|group=\"Note\" |name=\"Treadwear Rating\"}} and negligibly by the tires' rolling resistance and vehicle's air drag. The type of brake system in use only affects trucks and large mass vehicles, which cannot supply enough force to match the static frictional force.\nThe braking distance is one of two principal components of the total stopping distance. The other component is the reaction distance, which is the product of the speed and the perception-reaction time of the driver/rider. A perception-reaction time of 1.5 seconds, and a coefficient of kinetic friction of 0.7 are standard for the purpose of determining a bare baseline for accident reconstruction and judicial notice; most people can stop slightly sooner under ideal conditions.\nBraking distance is not to be confused with                      stopping sight distance. The latter is a road alignment visibility standard that provides motorists driving at or below the design speed an assured clear distance ahead (ACDA) which exceeds a safety factor distance that would be required by a slightly or nearly negligent driver to stop under a worst likely case scenario: typically slippery conditions (deceleration 0.35g) and a slow responding driver (2.5 seconds). Because the stopping sight distance far exceeds the actual stopping distance under most conditions, an otherwise capable driver who uses the full stopping sight distance, which results in injury, may be negligent for not stopping sooner.\nDerivation\nEnergy equation\nThe theoretical braking distance can be found by determining the work required to dissipate the vehicle's kinetic energy.\nThe kinetic energy  is given by the formula:\n:E=\\frac{1}{2}mv^{2},\nwhere  is the vehicle's mass and  is the speed at the start of braking.\nThe work  done by braking is given by:\n:W=\\mu mgd,\nwhere  is the coefficient of friction between the road surface and the tires,  is the gravity of Earth, and  is the distance travelled.\nThe braking distance (which is commonly measured as the skid length) given an initial driving speed  is then found by putting , from which it follows that\n:d=\\frac{v^{2}}{2\\mu g}.\nThe maximum speed given an available braking distance  is given by:\n:v=\\sqrt{2\\mu gd}.\nNewton's law and equation of motion\nFrom Newton's second law:\n:F=ma\nFor a level surface, the frictional force resulting from coefficient of friction \\mu is:\n:F_{frict}=-\\mu mg\nEquating the two yields the deceleration:\n:a=-\\mu g\nThe d_f(d_i,v_i,v_f) form of the formulas for constant acceleration is:\n:d_f=d_i + \\frac{v_f^2-v_i^2}{2a}\nSetting d_i, v_f =0 and then substituting a into the equation yields the braking distance:\n:d_f=\\frac{-v_i^2}{2a}=\\frac{v_i^2}{2 \\mu g}\nTotal stopping distance\n|content=\n}}\nThe total stopping distance is the sum of the perception-reaction distance and the braking distance.\n:D_{total}=D_{p-r}+D_{braking}=v t_{p-r}+ \\frac{v^2}{2 \\mu g}\nA common baseline value of t_{p-r}=1.5 s, \\mu=0.7 is used in stopping distance charts. These values incorporate the ability of the vast majority of drivers under normal road conditions. However, a keen and alert driver may have perception-reaction times well below 1 second, and a modern car with computerized anti-skid brakes may have a friction coefficient of 0.9--or even far exceed 1.0 with sticky tires.\nExperts historically used a reaction time of 0.75 seconds, but now incorporate perception resulting in an average perception-reaction time of: 1 second for population as an average; occasionally a two-second rule to simulate the elderly or neophyte; or even a 2.5 second reaction time—to specifically accommodate very elderly, debilitated, intoxicated, or distracted drivers. The coefficient of friction may be 0.25 or lower on wet or frozen asphalt, and anti-skid brakes and season specific performance tires may somewhat compensate for driver error and conditions.{{#tag:ref| As speed increases, the braking distance is initially far less than the perception-reaction distance, but later it equals then rapidly exceeds it after 30 MPH for 1 second p-t times (46 MPH for 1.5s p-t times): D_{p-r}=D_{braking} thus vt_{p-r}=\\frac{v^2}{2 \\mu g}. Solving for v, v=2 \\mu g t_{p-r}. This is due to the quadratic nature of the kinetic energy increase versus the linear effect of a constant p-r time.|group=\"Note\" |name=\"Speed at which braking distance equals perception-reaction distance\"}} In legal contexts, conservative values suggestive of greater minimum stopping distances are often used as to be sure to exceed the pertinent legal burden of proof, with care not to go as far as to condone negligence. Thus, the reaction time chosen can be related to the burden's corresponding population percentile; generally a reaction time of 1 second is as a preponderance more probable than not, 1.5 seconds is clear and convincing, and 2.5 seconds is beyond reasonable doubt. The same principle applies to the friction coefficient values.\nActual total stopping distance\nThe actual total stopping distance may differ from the baseline value when the road or tire conditions are substantially different from the baseline conditions, or when the driver's cognitive function is superior or deficient. To determine actual total stopping distance, one would typically empirically obtain the coefficient of friction between the tire material and the exact road spot under the same road conditions and temperature. They would also measure the person's perception and reaction times. A driver who has innate reflexes, and thus braking distances, that are far below the safety margins provided in the road design or expected by other users, may not be safe to drive. Most old roads were not engineered with the deficient driver in mind, and often used a defunct 3/4 second reaction time standard. There have been recent road standard changes to make modern roadways more accessible to an increasingly aging population of drivers.\nFor rubber tyres on cars, the coefficient of friction () decreases as the mass of the car increases. Additionally,  depends on whether the wheels are locked or rolling during the braking, and a few more parameters such as rubber temperature (increases during the braking) and speed.\nRules of thumb\nIn a non-metric country, the stopping distance in feet given a velocity in MPH can be approximated as follows:\n# take the first digit of the velocity, and square it. Add a zero to the result, then divide by 2.\n# sum the previous result to the double of the velocity.\nExample:\nvelocity = 50 MPH.\nstopping distance =  5 squared = 25, add a zero = 250, divide by 2 = 125, sum 2*50 = 225 feet (the exact value can be calculated using the formula given below the diagram on the right).\nIn Germany the rule of thumb for the stopping distance in a city in good conditions is the 1-second rule, i.e. the distance covered in 1 second should at most be the distance to the vehicle ahead. At 50&nbsp;km/h this corresponds to about 15&nbsp;m. For higher speeds up to about 100&nbsp;km/h outside built-up areas, a similarly defined 2-second rule applies, which for 100&nbsp;km/h translates to about 50&nbsp;m. For speeds on the order of 100&nbsp;km/h there is also the more or less equivalent rule that the stopping distance be the speed divided by 2 k/h, referred to as halber tacho (half the speedometer) rule, e.g. for 100&nbsp;km/h the stopping distance should be about 50&nbsp;m. Additionally, German driving schools teach their pupils that the total stopping distance is typically:\n(Speed\\div10)\\times3+(Speed\\div10)^2\nIn the UK, the typical total stopping distances (thinking distance plus braking distance) used in The Highway Code are quoted in Rule 126 as:\n* 20&nbsp;mph: 40 feet (12 metres)\n* 30&nbsp;mph: 75 feet (23 metres)\n* 40&nbsp;mph: 118 feet (36 metres)\n* 50&nbsp;mph: 175 feet (53 metres)\n* 60&nbsp;mph: 240 feet (73 metres)\n* 70&nbsp;mph: 315 feet (96 metres)\nSee also\n*Assured clear distance ahead\n*Brake\n*Cadence braking\n*Following distance\n*Skid mark\n*Stopping sight distance\n*Threshold braking\n*Vehicle metrics\n*Vehicular accident reconstruction\nNotes\nReferences\nFurther reading\n*\n*\n*\n*\n*\nExternal links\n*[http://www.random-science-tools.com/physics/stopping-distance.htm Car Stopping Distance Calculator]\n*[http://forensicdynamics.com/stopping-braking-distance-calculator Braking Distance Calculator]\n*[https://web.archive.org/web/20021113014650/http://leg1.state.va.us/cgi-bin/legp504.exe?000+cod+46.2-880 Tables of speed and stopping distances]\n*[http://en.wikibooks.org/wiki/Fundamentals_of_Transportation/Sight_Distance Wikibooks: Sight Distance]\n*[http://www.gov.uk/highway-code The Highway Code (in English)]"
    }
  ]
}