{
  "content": [
    {
      "type": "text",
      "text": "# Braking action\n\nBraking action in aviation is a description of how easily an aircraft can stop after landing on a runway. Either pilots or airport management can report the braking action according to the U.S. Federal Aviation Administration.\nWhen reporting braking action, any of the following terms may be used: Good; Medium; Poor; Nil - bad or no braking action. If an air traffic controller receives a braking action report worse than good, a pilot report (PIREP) must be completed and an advisory must be included in the Automatic Terminal Information Service (\"Braking Action Advisories are in effect\").  As of October 2019, the FAA has used mu values to describe braking conditions\nEurope\nIn Europe this differs from the above reference. Braking action reports in Europe are an indication/declaration of reduced friction on a runway due to runway contamination (see Landing performance, under the Runway Surface section) which may impact an aircraft's crosswind limits.\nEuropean reports have nothing to do with stopping distances on a runway, though they should alert pilots that stopping distances will also be affected.\nLanding distances are empirically dealt with by landing performance data on dry/wet/contaminated runways for each aircraft type.\nCrosswind limits\nWhenever braking actions are issued, they are informing pilots that the aircraft maximum crosswind limits may have to be reduced on that runway because of reduced surface friction (grip).\nThis should alert pilots that they may experience lateral/directional control issues during the landing roll-out. In a crosswind landing, the pilot tacks into wind to make allowances for the sideways force that is being applied to the aircraft (also known as using a crab angle). This sideways force occurs as the wind strikes the aircraft's vertical fin causing the aircraft to weathercock or weathervane. This manifests itself as an angular displacement of the fuselage relative to the runway centreline. This angular displacement is known as drift angle. Just before or upon initial ground contact, the pilot must re-align the fuselage to zero the drift angle (i.e. correct it to parallel with the runway's centreline). This re-alignment is accomplished using the rudder flight control surface. As the wheels make contact with the runway surface there are a lot of side forces and torsion placed on the tyres due to them countering the weathervane effect which continues to try to act upon the aircraft. A combination inherent strength of the tyres and the action of the runway surface friction with them ensures that the pilot can continue to keep the aircraft aligned with the runway as the aircraft decelerates during the landing roll. If however the surface friction is diminished because of contamination then this may upset the balance of forces resulting in insufficient directional control to keep the aircraft on the runway. To ensure this does not occur there is a pro-rata reduction in the aircraft's crosswinds limits, which in turn limits the sideways forces acting on the aircraft, thus ensuring sufficient directional control. This is the explanation for approach and landing; for takeoff the converse is true. The rudder applies a force to counter the crosswind forces as the aircraft accelerates down the runway. At the same time the tyres are accommodating these forces through sidewall torsion, and giving grip with the runway surface. As the aircraft transitions from a ground vehicle to a flying vehicle rudder input is stopped by the pilot and the aircraft will weathervane. The subsequent drift angle will allow the aircraft to fly on a straight course.\nPilots may receive this data through a \"Snowtam runway state decoder\" which forms an appendix to the internationally recognised METAR (METeorological Aerodrome Report).\nIn some countries in Europe, pilots will not receive local updated/modified braking action reports directly from an air traffic control (ATC) source unless a recent braking action test has been carried out and is being officially issued. ATC may advise other pilots that they have received a pilot report of a braking action, but since these reports can be variable and subjective, without any empirical value, it should be treated as an advisory.\nBraking action tests\nBraking action tests are subject to many variables such as:\n*It is an instantaneous report and its data integrity may not be valid after a short period of time in active or changing weather conditions. Caution, the data value is an average/mean value for the runway length (usually split into thirds) and does not rule out that localised areas are better or worse than reported.\n*The scheduled time interval frequency of such tests and their reports may not be regular. In other words, one may be reading an old braking action report attached to an up-to-date METAR.\n*Various manufacturers of friction testing equipment provide different readings (non homogenous) on the same surface.\n*Most of these friction testing devices employ using a trailing wheel or tyre combination which is in contact with the runway surface. It is not an aircraft tyre, thus they are not fully representative in size, weight or speed. Many if not all of the tests are accomplished below the normal approach/landing speeds that a code C aircraft will fly; Code C aircraft typically fly an approach speed of up to 140 kt (161&nbsp;mph or 259&nbsp;km/h) indicated airspeed (IAS) (aircraft approach speed is mass /pressure altitude/temperature/ centre of gravity/aircraft configuration/ dependent).\n*Runway condition (how old is the tarmac/concrete? is it a grooved or smooth runway surface; does it have an upward or downward slope? Is it clean or has it accumulated rubber on its surface (high/low utilisation)?\nThis reported data is used by the airport operators and authorities to determine whether the runway should be closed for de-icing or contamination removal or remain operational until the next scheduled or requested test or report.\nPilots/ATC may request that an official braking action test be carried out prior to a landing.\nFormat of braking action declarations\nIn Europe the format of braking action declarations are given using the Greek term mu which is the co-efficient of friction\nGood = a mu value of 0.4 and above; measured snowtam decode is 95\nMed/Good = a mu value of 0.36 to 0.39; measured snowtam decode is 94\nMed = a mu value of 0.30 to 0.35; measured snowtam decode is 93\nMed/Poor = a mu value of 0.26 to 0.29; measured snowtam decode is 92\nPoor = a mu value of 0.25 and below; measured snowtam decode is 91\nUNRELIABLE = reading unreliable; measured snowtam decode is 99 READING not measurable or not operationally significant; snowtam decode is\nSnowtam Format reference is International Civil Aviation Organization (ICAO) document Annex 15 Appendix 2.\nReferences"
    }
  ]
}