{
  "content": [
    {
      "type": "text",
      "text": "# Bramble: The Mountain King\n\n| platforms =\n| released =\n| genre = Action-adventure\n| modes = Single-player\n}}\nBramble: The Mountain King is a 2023 action-adventure video game developed by Dimfrost Studio and published by Merge Games. Players control a young boy named Olle who attempts to rescue his kidnapped sister Lillemor from mythological creatures.\nGameplay\nBramble: The Mountain King is an adventure game based on Scandinavian folklore. It is played from a third-person perspective and has elements of horror games. The player character Olle must traverse locales common to fairy tales. Travel is generally linear, and, to continue, the player must occasionally solve puzzles or jump across platforms, as in platform games. There are also occasional action sequences where the player must engage in boss fights.\nPlot\nIn an old Nordic land, a young boy named Olle searches for his big sister Lillemor during the night. Eventually he finds her but not long after they fall into a giant tree, which magically shrinks them, and the siblings playfully spend time with the gnomes and fairies before returning to normal size. Things turn grim, however, when a troll captures Lillemor to be taken to an unknown kingdom in a remote mountain. With a mysterious stone of light he finds, Olle traverses through the woods in search of his sister.\nOlle escapes from trolls, and also befriends a stone giant named Lemus. He is then entranced into stumbling to a pond by the hypnotic violin melody of Näcken, a sinister water spirit. Olle hides and flees from him in the riverside, and Näcken is killed in his pursuit of Olle when they both go off the edge of a waterfall. Olle meets the young witch Tuva, who encourages him and gives his stone part of her power to defend himself and push back the Bramble infesting the land. Traveling farther out into the marshes, Olle finds a shack that is home to a witch and her infant child. The marshes are filled with shadowy figures of drowned children, and Olle learns that the witch plans to sacrifice the baby in a Satanic ritual, with the child becoming a shadowed one under the watch of the demonic midwife Kärrhäxan. Olle ultimately fails to save the newborn from being drowned by the witch, who hangs herself. Olle buries the child to prevent them from becoming another shadow.\nMeeting the Lyktgubbe, a magical archivist creature, Olle enters a clearing where his library manifests, and he learns the tale of the Mountain King: King Nihls' son Ulrik was ailing, so he set out on a bloody search for the cure. Finding a kind witch, she gave him a magic flower that she warned to only use a piece of. Although the boy was healed by it, he was then killed by the servants out of vengeance towards his father's cruel campaign. The devastated King unleashed his fury with the full flower, turning into a mad giant and releasing the Bramble onto the world. The witch witnessed the King's transformation and rampage from afar and used her power to build a mountain over him and his decimated kingdom, binding him to the Bramble forever; the trolls are forced to retrieve prey for him to feed on.\nEntering a forest, Olle is lured by a vision of Lillemor created by the shapeshifter Skogsrå, who disguised herself as a beautiful woman to lure men from a nearby village to their deaths, drawing power from their hearts. Olle fights and kills Skogsrå with the light; he continues to the village destroyed by the upheaval caused by Skogsrå, later afflicted with a plague caused by the demon hag Pesta, which turned the remaining villagers into zombies. Olle uses a rowboat to cross the sea to the mountain, but is confronted by Pesta herself; Olle uses the light to overcome her nightmare and banish her.\nEntering the mountain through a magic doorway, Olle finds the Mountain King's sanctum, but is too late as he witnesses Lillemor being fed to the giant. Olle uses the light to weaken the Bramble binding the Mountain King. With the Bramble weakened, King Nihls regains his senses and destroys the rooting flower of the Bramble, decimating the cursed plant. Olle climbs onto King Nihls' beard and falls, throwing the stone of light into the King's mouth, who collapses dead. Olle is killed by the fall, and Lillemor uses the light to cut her way out of the King's stomach. The light revives Olle, and Lillemor carries him off as the castle begins to collapse; they are saved by the timely intervention of Lemus. The story ends with Lillemor searching for Olle at home in the night before he appears to reassure her, mirroring the beginning of the story.\nDevelopment\nThe developer, Dimfrost, is based in Sweden. Dimfrost's first idea had to do with Vikings, but they found the idea overplayed and chose instead to focus on Swedish mythology. The story comes from cautionary fables for children, and the monster design was inspired by John Bauer.  The developers did not want players to see the game as just a horror game; besides the grim atmosphere, they also wanted to stress the beautiful elements and Olle's growth as a character. Merge Games released it for Windows, Xbox Series X/S, PlayStation 4 & 5, and Nintendo Switch on April 27, 2023.\nReception\nBramble: The Mountain King received positive reviews on Metacritic. Although PC Gamer highly praised the game's atmosphere and said it had the potential to be an \"instant classic\", they criticized what they felt was \"archaic puzzle design\" for ruining the experience. Shacknews called it \"as gorgeous as it is horrifying\" and recommended it to fans of horror games. Nintendo Life recommended against the Switch version due to performance problems during their review, but they reported that an upcoming patch promised to address this. In the meantime, they recommended playing the game on more powerful systems. GamesRadar said it has enough jump scares and gore to satisfy horror fans, but there is also \"a lot of wonder to be found\".\nReferences\nExternal links\n*\n*"
    }
  ]
}