{
  "content": [
    {
      "type": "text",
      "text": "# Branndon Stewart\n\n| birth_place = Fort Worth, Texas, U.S.\n| death_date =\n| death_place =\n| team = Texas A&M University\n| number = 7\n| status =\n| position1 = QB\n| height_ft = 6\n| height_in = 2\n| weight_lb = 221\n| college = Texas A&MTennessee\n| playing_years1 = 1991-93\n| playing_team1 = Stephenville High School\n| playing_years2 = 1994\n| playing_team2 = Tennessee\n| playing_years3 = 1995–1998\n| playing_team3 = Texas A&M\n| career_highlights =\n}}\nBranndon Stewart (born September 23, 1975) is a former American football player. He played quarterback for the University of Tennessee and Texas A&M University.\nEarly life\nComing out of Stephenville High School led by head coach Art Briles, Stewart was the Texas high school football player of the year and was recruited by virtually every major program in the country, ultimately signing with the University of Tennessee, which had also signed highly regarded quarterback Peyton Manning as part of the same recruiting class.\nAt Stephenville, Stewart played a pivotal role in leading Stephenville High School to its first state football championship in 1993. That season, he amassed 4,704 total yards—passing and rushing—and accounted for 47 touchdowns, earning recognition as the Associated Press Class 4A Player of the Year and a high school All-American. He delivered standout performances in crucial games, including a state semifinal victory against Waxahachie, where he rushed for 122 yards, passed for 175 yards, and executed the decisive two-point conversion in a 21–20 win, ending Waxahachie’s 30-game winning streak. In the 4A championship game, Stewart threw for 205 yards and a touchdown, while also rushing for 94 yards and two scores, leading Stephenville to a 26–13 win over La Marque and completing a perfect 16–0 season. Following his senior high school season, he was selected to play in the Texas High School Coaches Association All-Star Football Game, where he was named Offensive MVP.\nHe was inducted into the 2008 Texas High School Football Hall of Fame induction class.\nCollege career\nStewart played in 11 of 12 games at quarterback for the Volunteers as a true freshman in 1994, but Manning started the final eight games of the season while exhibiting the skills that would make him a perennial All-American and, eventually, All-Pro quarterback. Realizing he was behind a potential four-year starter in the depth chart (as well as future MLB All-Star Todd Helton), Stewart transferred to Texas A&M and sat out the 1995 season, per NCAA transfer rules.\nStewart had a nice start to the 1996 season with a big game against BYU in the Pigskin Classic, completing 20 of 28 passes for 232 yards, two touchdowns and no interceptions. Despite his performance, A&M lost the game 41-37 and went on to a mediocre 6–6 season. Stewart only threw 9 touchdown passes all season and completed less than 50% of his attempts.\nStewart began the 1997 season as the Aggies starting quarterback, but in the sixth game of the season (a loss against Kansas State), backup Randy McCown was more effective than Stewart and coach R. C. Slocum named McCown the starter for the following week's game against Texas Tech. When McCown faltered, Stewart came off the bench to complete 12 of 17 second-half passes, only to see the Aggies lose on a 47-yard field goal with 19 seconds to play.\nThat performance was good enough to earn back his starting position. He started the rest of the season, leading the Aggies to the Big 12 South Division championship (the Aggies would go on to lose a very lopsided Big 12 Championship game to the Nebraska Cornhuskers). After the season, Stewart's teammates voted him most valuable offensive player. On the season, he completed 111 of 196 passes for 1,429 yards and 10 touchdowns. He led the Big 12 in Pass Completion Percentage. He went seven consecutive games without throwing an interception and threw only four all season (two in the championship game against Nebraska).\nOriginally, Stewart's transfer from Tennessee was going to cost him two years of eligibility, but Texas A&M's NCAA compliance officer recommended Stewart appeal for another year of eligibility. The NCAA granted the request, giving him another year with the Aggies.\nStewart once again began the 1998 season as the starter, but lost the job to McCown after four games. Going into the Big 12 Championship Game, Stewart had only played in six games, completing 53 of 97 passes for 668 yards, 4 touchdowns and 3 interceptions. His best performance had come against the Oklahoma Sooners, when he passed for 234 yards and two touchdowns.\nStewart's chance came once again when McCown injured his left shoulder on a touchdown dive in the last game of the regular season, a 26–24 loss to rival Texas. The injury was not confirmed as a broken collarbone until the Wednesday prior to the Big 12 Championship game against #2 ranked Kansas State. Despite suffering a hyperextended knee in the first quarter, Stewart bounced back to throw for 324 yards and three touchdown passes, including the fabled slant to Sirr Parker that sealed the 36-33 double-overtime victory, earning the Aggies an invitation to the Sugar Bowl in which they lost 24–14 to Ohio State. He was named MVP of the 1998 Big 12 Championship game.\nDespite his ups and downs, Stewart finished his Texas A&M career with a 23–11 record as a starter, and led the Aggies to their only Big 12 Championship and first BCS Bowl appearance.\nReferences\nExternal links\n*[http://www.findarticles.com/p/articles/mi_m1208/is_n34_v221/ai_19715004 Sporting News article]\n*[https://web.archive.org/web/20070929092829/http://www.texnews.com/1998/texsports/am0814.html Abilene Sports Reporter article]\n*[https://archive.today/20130120011359/http://sportsillustrated.cnn.com/football/college/1998/bowls/sugar/news/1998/12/07/aggies_stewart/ CNNSI.com article]"
    }
  ]
}