{
  "content": [
    {
      "type": "text",
      "text": "# Bray Park, Queensland\n\n| local_map           = yes\n| zoom                = 12\n| pop                 = 10271\n| pop_year            =\n| pop_footnotes       =\n| established         =\n| postcode            = 4500\n| area                = 4.5\n| timezone            = AEST\n| utc                 = +10:00\n| dist1               = 3.8\n| dir1                = NW\n| location1           = Strathpine\n| dist2               = 25.5\n| dir2                = N\n| location2           = Brisbane CBD\n| dist3               =\n| dir3                =\n| location3           =\n| dist4               =\n| dir4                =\n| location4           =\n| lga                 = City of Moreton Bay\n| stategov            = Kurwongbah\n| stategov2           = Pine Rivers\n| fedgov              = Dickson\n| near-n              = Lawnton\n| near-ne             = Lawnton\n| near-e              = Strathpine\n| near-se             = Strathpine\n| near-s              = Strathpine\n| near-sw             = Warner\n| near-w              = Warner\n| near-nw             = Lawnton\n}}\nBray Park is a suburb in the City of Moreton Bay, Queensland, Australia. In the , Bray Park had a population of 10,271 people.\nGeography\nBray Park is bounded by Four Mile Creek in the south, the North Coast railway line in the east, Francis Road in the north, and Old North Road in the west.\nThere is no railway station within Bray Park. However, Bray Park railway station is just south of the suburb in neighbouring Strathpine, providing passengers services on the  Redcliffe Peninsula Line of the Queensland Rail City network.\nHistory\nThe suburb was named on 1 April 1970 after John Sanders Bray, a former Pine Rivers Shire councillor from May 1946 to March 1973. He was shire chairman from 1950 to 1973 (the longest serving chairman of the shire). His father Thomas Nathaniel Bray moved to the district in 1900 and established a dairy farm on Gympie Road that John Bray later took over.\nBray Park State School opened on 30 January 1973. In 1981, a special education unit was opened but it closed in 1988.\nHoly Spirit Catholic Primary School opened on 6 March 1977.\nBray Park State High School opened on 27 January 1987.\nGenesis Christian College opened on 1 February 1991.\nDemographics\nIn the , Bray Park recorded a population of 10,002 people, 51.2% female and 48.8% male. The median age of the Bray Park population was 33 years, 4 years below the national median of 37. 78.4% of people living in Bray Park were born in Australia. The other top responses for country of birth were New Zealand 5.7%, England 3.4%, Philippines 0.9%, South Africa 0.8%, and Fiji 0.6%. 90% of people spoke only English at home; the next most common languages were 0.7% Hindi, 0.7% Samoan, 0.4% Tagalog, 0.4% Cantonese, and 0.3% Afrikaans.\nIn the , Bray Park had a population of 10,246 people.\nIn the , Bray Park had a population of 10,271 people.\nEducation\nBray Park State School is a government primary (Prep–6) school for boys and girls at Hopetoun Street (). In 2017, the school had an enrolment of 418 students with 32 teachers (28 full-time equivalent) and 31 non-teaching staff (19 full-time equivalent). In 2018, the school had an enrolment of 423 students with 31 teachers (29 full-time equivalent) and 33 non-teaching staff (20 full-time equivalent). The school includes a special education program.\nHoly Spirit School is a Catholic primary (Prep–6) school for boys and girls at 102 Sparkes Road (). In 2017, the school had an enrolment of 615 students with 47 teachers (39 full-time equivalent) and 25 non-teaching staff (16 full-time equivalent). In 2018, the school had an enrolment of 598 students with 47 teachers (40 full-time equivalent) and 27 non-teaching staff (18 full-time equivalent).\nGenesis Christian College is a private primary and secondary (Prep–12) school for boys and girls at 10 Youngs Crossing Road ().  In 2017, the school had an enrolment of 1,495 students with 109 teachers (99 full-time equivalent) and 96 non-teaching staff (75 full-time equivalent). In 2018, the school had an enrolment of 1519 students with 108 teachers (99 full-time equivalent) and 102 non-teaching staff (77 full-time equivalent).\nBray Park State High School is a government secondary (7–12) school for boys and girls at Lavarack Road (). In 2017, the school had an enrolment of 792 students with 74 teachers (69 full-time equivalent) and 45 non-teaching staff (31 full-time equivalent). In 2018, the school had an enrolment of 860 students with 76 teachers (72 full-time equivalent) and 45 non-teaching staff (30 full-time equivalent). The school includes a special education program.\nAmenities\nThe Moreton Bay City Council operates a mobile library service which visits Kensington Village on Sovereign Way.\nBray Park Samoan Church meets at the Norris State School Hall in Norris Road in Bracken Ridge. It is part of the Wesleyan Methodist Church.\nLes Hughes Sporting Complex is in Francis Road (). It has facilities for a range of sports, including rugby league, rugby union, baseball, basketball and netball. It also has a skate park, fitness equipment, play equipment, and barbeques.\nThere are a number of parks in the suburb, including:\n* Allena Park ()\n* Durakai Reserve ()\n* John Bray Park ()\n* John Davidson Park ()\n* Kumbari Reserve ()\n* Neilson Park ()\n* Oakley Park ()\n* Odempa Park ()\n* Wendy Allison Park ()\nReferences\nExternal links\n*"
    }
  ]
}