{
  "content": [
    {
      "type": "text",
      "text": "# Brazilian battleship Riachuelo (1914)\n\n{|\n| Ship name           = Riachuelo\n| Ship namesake       = Battle of Riachuelo\n| Ship ordered        =\n| Ship builder        = Armstrong Whitworth\n| Ship original cost  =\n| Ship yard number    =\n| Ship laid down      = 10 September 1914 (planned)\n| Ship launched       =\n| Ship acquired       =\n| Ship completed      =\n| Ship commissioned   =\n| Ship decommissioned =\n| Ship in service     =\n| Ship out of service =\n| Ship struck         =\n| Ship reinstated     =\n| Ship honours        =\n| Ship fate           = Construction cancelled\n| Ship notes          =\n}}\n| Ship length         =\n| Ship beam           =\n| Ship draught        =\n| Ship draft          =\n| Ship propulsion     = 2 steam turbine sets\n| Ship speed          =\n| Ship range          =\n| Ship complement     =\n| Ship sensors        =\n| Ship EW             =\n| Ship armament       =\n* (as planned)\n* 4 × twin 15&nbsp;in (381&nbsp;mm) guns\n* 14 × 6&nbsp;in (152&nbsp;mm) guns\n* 3 × 3&nbsp;in (76.2&nbsp;mm) AA guns\n* 2 × torpedo tubes\n| Ship armor          =\n* Belt: 13.5&nbsp;in (342&nbsp;mm)\n| Ship aircraft       =\n| Ship aircraft facilities =\n| Ship notes          =\n}}\n|}\nRiachuelo was a battleship project for the Brazilian Navy developed between 1913 and 1914. It was designed to be the most powerful warship of its time; it was a Brazilian response to the Chilean projects Almirante Latorre and Almirante Cochrane and to the Argentine projects Rivadavia and Moreno, during the naval arms race in South America. The construction would be carried out by the British construction company Armstrong Whitworth and Vickers, under the codename Project 781, a project chosen among several other plans offered to the Brazilian authorities. The battleship would be 188.98 meters long and have at least eight 381-millimeter guns, displacing up to 30,500 nautical tons.\nDue to the outbreak of World War I, construction was delayed. Although the contract for construction was signed on 14 May 1914, by November of that year little work had been done at the shipyard. Construction was officially canceled on 13 May 1915. The Brazilian Naval League tried to keep the construction alive by financing it through a national donation campaign, but the amount of funds raised was not sufficient to cover the costs. If finished, Riachuelo would have been compared to the British  and es.\nDesign\nProject 781 characteristics were: displacement of up to 30,500 tons, 188.98 meters long, 28.65 meters wide and 8.53 meters of draft. Its main armament consisted of up to eight 15-inch (381 mm) guns, divided into four turrets, two forward and two aft. Secondary armament would consist of 14 six-inch (152.4 mm) guns. It would also have three 3-inch (76.2 mm) anti-aircraft guns and two torpedo tubes of unspecified caliber. The armor was up to 13.5 inches (342.9 mm) thick. Its propulsion system comprised four Parsons steam turbines of unspecified engine and power, fed by 3,500 tons of coal and 700 tons of oil. The battleship would develop a speed of up to 23 knots or 42.59 kilometers per hour.\nHistory\nAfter the commissioning of the battleships Minas Geraes and São Paulo, Brazil began to experience severe economic difficulties caused by the decrease in coffee and rubber exports, in addition to the crisis in its navy due to the Revolt of the Lash, and the European economic recession caused by the Second Balkan War, which prevented the country from contracting new foreign loans. This prompted the Brazilian government to sell the still-under-construction battleship Rio de Janeiro to the Ottoman Empire in 1913 for £2.75 million. With the money, the country asked Armstrong and Vickers shipbuilders for projects for a new battleship, since Brazil did not want to fall behind other South American countries such as Argentina and Chile, all involved in a naval arms race at that time.\nDespite the fact that Brazil had more ships than the other two nations, including the two battleships of the Minas Geraes class, the possible commissioning of Almirante Latorre and Almirante Cochrane in the Chilean Navy and Rivadavia and Moreno in the Argentine Navy would make the naval power in those countries significantly higher than that of Brazil. The Brazilian authorities, aware of this, asked Armstrong and Vickers for projects for the development of a superior battleship named Riachuelo. If completed, Brazil would have the most powerful warship in the world once again. Writer Alan Vanterpool demonstrated several projects that were supposedly for Riachuelo, but stated that Brazil had never asked Armstrong-Vickers for plans due to its economic crisis. However, contemporary newspaper articles (The Times and Engineering) indicated that the country placed the design order on the eve of World War I, and that it also included data on the battleship's specifications.\nBoth Armstrong and Vickers agreed to build the ship without an initial payment from Brazil, offering at least fourteen designs in total, six from Vickers (December 1913 to March 1914) and eight from Armstrong (February 1914). Vickers designs ranged between eight and ten 15-inch guns and eight 16-inch guns, with speeds between 22 and 25 knots (the lowest ships having mixed fire, the highest using oil) and displacements between 26 thousand tonnes (26 thousand long tons) and 30.5 thousand tonnes (30 thousand long tons). Armstrong had two basic designs, one with eight and one with ten 15-inch guns, varying in velocity and fire. There were other projects, not considered by the Brazilian Navy, with ten to 15 cannons installed and a total displacement of 32,500 to 34,500 tons. However, only two were shortlisted: Projects 781 and 782. The Brazilian government ultimately chose 781 and signed the construction contract on 14 May 1914.\nOn 16 July 1914, some material and equipment for the start of construction had been assembled at the shipyard, with the keel laying scheduled for 10 September. However, in November it was recorded that little had been done due to the outbreak of the First World War. In early 1915, building operations were suspended, and on 13 May they were officially called off. Another reason for the cancellation would be the difficulty of Brazil in paying it. As a last attempt to keep the construction alive, the Brazilian Naval League (current Society of Friends of the Navy), tried to raise donations through a popular campaign called Fundo Riachuelo that reached all regions of Brazil. Despite the league's efforts, the funds raised were not enough to cover the costs, with the amount raised being used for the acquisition of three training aircraft that would later become the pillars of Brazilian Naval Aviation. If completed, Riachuelo would have ranked similarly to the British  and es.\nReferences\nCitations\nBibliography\n*\n*\n*\n*\n*\n*\n*\n*\n*\n* This article is based on a translation of Vanterpool (1969), but also includes original information added by the translator."
    }
  ]
}