{
  "content": [
    {
      "type": "text",
      "text": "# Brazilian presidential inauguration\n\nclimbing the ramp of the National Congress with his wife, Janja da Silva, and the vice president, Geraldo Alckmin, on January 1, 2023.]]\nThe inauguration of the president of Brazil is composed of several ceremonies that happen in the same day. Through democratic elections or coups, resignations and deaths, presidential inaugurations have been important events in Brazilian history.\nCeremonies\nThe only required part of the inauguration ceremonies, according to Brazil's Federal Constitution, is the taking of the constitutional oath of office before a joint session of the National Congress. However, other ceremonies, such as a parade leading up to the arrival of the president-elect in Congress, the transfer of the presidential sash from the former president to the new holder of the office, and a presidential reception at night also take place in the case of planned inaugurations.\nIn the case of non-planned inauguration ceremonies (such as those that take place as a result of the death or resignation of a president), the non essential festivities, including the investiture with the presidential sash, do not take place: in those cases, the inauguration of the new president consists only of the joint session of Congress, during which the new president takes the constitutional oath.\nThe ceremonies described below are those observed for planned inaugurations since Brasília became the federal capital.\nInaugural parade\nThe president-elect and the vice-president elect ride to Congress, where they are to take the oath of office, in a ceremonial parade.\nThe inauguration parade starts at the Cathedral of Brasília, located at the beginning of Ministries Esplanade. In front of the Cathedral, the president-elect and vice-president-elect take the presidential Rolls-Royce and proceed in parade down the Ministries Esplanade to the National Congress, while escorted by the Independence Dragoons.\nA number of presidents-elect have chosen to attend Mass at the Cathedral of Brasília before the start of the inaugural ceremonies. In that case, a Solemn Mass is scheduled to take place in the Cathedral before the time set for the beginning of the State-sponsored inauguration ceremonies. The president-elect then hears Mass and leaves the Cathedral at or around the time scheduled for the start of the inauguration parade.\nOther presidents-elect have chosen not to attend Solemn Mass in the Cathedral before the inauguration ceremonies (some have attended no religious service at all, and others, while still attending Mass, opted for a private celebration in the morning of inauguration day instead of a major event in the Cathedral): in that case, instead of proceeding to the Parade from the Cathedral, they simply arrive in front of the Cathedral in their private cars, and at that point enter the presidential State Car for the start of the Parade.\nDuring the parade, the Ceremonial State Cars carrying the president elect and their spouse, the vice-president-elect and their spouse are flanked by a formation of Dragoons from the presidential guard of honor. However, except in the case of a re-elected president and vice-president, the flagpoles in the Ceremonial State Cars (that usually bear the national flag and the presidential or vice-presidential standard) remain empty during that part of the ceremonies, as those being transported are not yet president and vice-president. The parade ends at foot of the entrance ramp to the Palace of Congress.\nOath of office before a joint session of Congress\nArriving at the National Congress, the president and vice-president elect are greeted by the president of the Senate (the upper house; the president of the Senate is ex officio the president of Congress, and in that capacity chairs all joint sessions) and the president of the Chamber of Deputies (the lower house). Inside the Palace of Congress, a joint session of Congress takes place. The center seat of Congress' directing board's table is taken by the president of Congress. The president-elect of the Republic is seated at the right hand side of the president of Congress, and the vice president-elect of the Republic seats at the president of Congress's left hand side. Also present at the table together with the members of Congress' directing board, are the president of the Chamber of Deputies, who sits to the right of the president-elect, and the president of the Supreme Federal Court, who sits to the left of the vice president elect. Although the president of the Supreme Court is not a member of Congress, he is invited to the table to witness the act. Other members of Congress' directing board (the vice-presidents and secretaries of Congress) take the remaining seats at the table, to the right of the president of the Chamber of Deputies, and to the left of the president of the Supreme Court.\nDuring the joint session, the president of Congress states the purpose of the meeting and acknowledges the receipt of the diplomas of election of the president-elect and of the Vice president-elect, issued by the Superior Electoral Court. All those present are then asked to stand, and the president-elect and the Vice president-elect are successively invited to take the constitutional oath. The president-elect and vice-president-elect take their oaths of office, and each oath is followed by applause. At that time, immediately upon taking the oaths, they become president and vice-president of the Republic. As soon as the constitutional oaths are taken before the assembled Congress by both the president and the vice-president, the new office holders are declared by the president of Congress to be invested in the Presidency and the Vice Presidency of the Republic. Normally, the national anthem is played at this point by a band of the Brazilian Navy Marine Corps, as soon as the oaths are taken and the declarative announcement by the president of Congress is made, and in military language the anthem is said to be played \"in salute to the President of the Republic\" (em continência ao Presidente da República). In some inaugural ceremonies, however, such as Dilma Rousseff's second inauguration in 2015, the National Anthem was not played at this point of the proceedings, being instead played at the beginning of the Congressional ceremony (in that case, the president of Congress invites those present to hear the National Anthem as soon as the joint session of Congress is declared open). Once the National Anthem ends (if it is played after the oaths of office and the declarative announcement of investiture), one of the Secretaries of Congress reads out the instrument recording the oaths taken and the investiture of the president and vice-president in their offices. If the National Anthem is played at the beginning of the joint session, then, immediately after the oaths of office and the declarative announcement by the president of Congress, the instrument recording the investiture is read out. That instrument, a proces-verbal of the constitutionally essential part of the inauguration ceremonies, is written in a special investiture book recording the investiture of all presidents and vice-presidents. Once the reading of this document finishes, the new president and the new vice-president then sign the instrument recording their investiture, and the document is also signed by the president of Congress, the president of the Chamber of Deputies and other members of Congress' directing board. The document is also signed by the president of the Supreme Federal Court. Once that deed is signed by all who are to sign it, the president of Congress then invites the president of the Republic to address the joint session. The president's inaugural address is given at this point (the president speaks standing, but from his place at the table), and the inaugural address is followed by a short speech by the president of Congress, who then finishes thanking the foreign heads of state, heads of government, Ministers of Foreign Relations and other special envoys for their presence, and also acknowledges and thanks for their presence the members of the diplomatic corps (usually saluted in the person of the Apostolic Nuncio, Dean of the Diplomatic Corps), the governors of States, the governor of the Federal District, judicial, civil and military authorities, as well as religious representatives, and after those thanks the president of Congress closes the proceedings of the joint session.\nThe inaugural address of the president of the Republic and the concluding speech by the president of Congress are only delivered in the case of planned inaugurations. In the case of a non-planned inauguration, the president of Congress closes the joint session as soon as the instrument recording the investiture of the president and the oath taken has been read out and signed.\nOnce the joint session of Congress is closed, the congressional leaders then escort the new president and the new vice-president from the Chamber and accompany them to the front ramp of the Palace of Congress.\nMilitary review in front of the Palace of Congress\nOnce the president emerges from the National Congress, he pauses at the top of the front ramp of that palace, and, upon sight of the new head of state, a 21-gun salute is immediately fired by the Cayenne Battery. During the firing of the salute, the National Anthem is again played. A brief military ceremony then takes place outdoors.\nAs the president is the commander-in-chief of the Armed Forces, he is received at the doors of the National Congress by the Presidential Guard Battalion of the Army, and by Navy and Air Force troops presenting arms.\nThe president then reviews the troops and salutes their colours. After that, the president and the vice-president take the ceremonial state cars to the Planalto Palace, the seat of the presidency of the Republic. While, except in the case of a re-elected president, on the parade leading up to Congress the car flagpoles were empty, the car flagpoles now display the national flag and the presidential standard or vice-presidential standard.\nCeremonies at the Planalto Palace\nArriving at the Planalto Palace, the new president and vice-president pause at the foot of the Palace's entrance ramp (only used in state ceremonies), while a military band of the presidential guard plays the Presidential Salute (consisting of the initial and final bars of the Brazilian National Anthem). Once the salute is given, the new president and vice-president ascend the entrance ramp, and are greeted at its top by the former president and by the former vice-president. Troops of the 1st Guards Cavalry Regiment, forming a guard of honour, are lined at both sides of the entrance ramp during the entire ceremony. This is the first time the new president and his predecessor meet during the inaugural ceremonies, since the former president and vice-president take no part in the preceding stages of the inaugural solemnities. The new president and the former president, followed by the new and former vice-presidents, then go side by side to the spot where the ceremony of the transfer of the presidential sash is to take place. The former president uses the sash up to the moment when he places it on the shoulder of the new president.\nThe presidential sash is the insignia that symbolizes the office of the president. In Brazil, the sash was created in December 1910, when it was instituted as a symbol of the presidency by a statute signed into law by President Hermes da Fonseca, Brazil's eighth president. Thus, in Brazil, unlike other Republics, the creation of the sash was not simultaneous with the establishment of the office of president. Also, while in other Latin American countries the transfer of the presidential sash takes place before Congress, in Brazil that is not the case. While in other South American countries the reception of the sash by the new president forms part of the essential solemnities of the inauguration, and takes place immediately at the moment of the assumption of office, in Brazil the transfer of the sash, while still highly symbolic of the installation of the new president, is not an essential part of the presidential investiture, and therefore it only takes place in the case of planned inaugurations. Nevertheless, the handover of the sash from the former president to the new office-holder is considered an important symbol of the peaceful transfer of power from one administration to the next, in accordance with the will of the people and the constitutional order.\nIndoors or, more commonly, in the outdoor Parlatorium of the Planalto Palace, the former president hands over the presidential sash to the new president. The National Anthem is played for the third time as soon as the sash is placed over the shoulder of the new president.\nIn the case of a re-elected president, there is, of course, no ceremony for the handing over of the presidential sash. Instead, the re-invested president merely re-assumes the use of the sash, and that is not done in the Parlatorium, but before the president's arrival there. Three Brazilian presidents have been re-elected, Fernando Henrique Cardoso, Luiz Inácio Lula da Silva and Dilma Rousseff. In Cardoso's case, as soon as he re-entered the Planalto Palace after the joint session in the Palace of Congress, he went indoors and received the presidential sash on a cushion. His chief of staff placed it on his shoulder. He then went on to present himself at the Parlatorium. In the case of President Lula's re-election for his second term, he received the sash at the foot of the entrance ramp of the Planalto Palace, and thus entered the palace via the ramp already wearing the sash, going directly to the Parlatorium. In the case of President Dilma Rousseff, she received the presidential sash from an aide at the top of Planalto Palace's entrance ramp, immediately after ascending that ramp. While reelected Presidents Cardoso and Lula had the sash placed on their shoulders by the aide who brought it to them, President Dilma Rousseff took the sash and she placed it on her shoulder herself. President Rousseff then remained at the top of the Palace's front ramp, facing the square, as the National Anthem was played, and once the National Anthem finished she then proceeded to the Parlatorium. The prior re-elected presidents merely resumed the use of the sash without the ceremony of the National Anthem being played at this point.\nIn the outdoor Parlatorium the president (new or re elected), already using the presidential sash, delivers a public address facing the Three Powers Square where the people are assembled.\nIn the case of a new president, the speech begins as soon as he has received the sash from the former president and the National Anthem has been played, and the former president listens to the speech at the side of the new president. The president then escorts the former president to the main entrance, and the former president and vice-president walk down the palace's front ramp. Reaching the foot of the ramp, the former president and vice-president take official cars that transport them home or to the airport. By entering the car at the foot of the Palace's ramp and being transported away, the former president takes his leave of the official ceremonies of his successor's inauguration. A notable exception was in Lula's third non-consecutive term where Bolsonaro was absent and it was instead handed over by members of Lula's presidential transition cabinet who were selected by voters.\nThe parts of the ceremony involving the front ramp of the Planalto Palace are also considered highly symbolic: when the new president and vice-president walk up the ramp to enter the palace, this is considered to represent the ascent of the new chief executive to power and to the exalted position of the presidency, whereas the moment when the former president and the former vice-president walk down the ramp towards the people who are assembled below is regarded as representative of the fact that they have surrendered power to the new administration, and now become once again ordinary citizens of the republic. In reality, however, there is no actual transfer of power taking place at the above-mentioned symbolic moments: the term of office of the predecessor had ended since midnight, and at that moment the four-year term of office of the successor began. His four-year term having started, the successor entered into office immediately upon taking the oath, while the predecessor, divested of the power of the presidency since midnight, was allowed to continue to use the presidential sash until the moment in the ceremonies when the sash is transferred, and reside in Planalto Palace until the moment in the ceremonies when the solemnly descends the front ramp, only as a matter of ceremony and protocol. The ceremonies only emphasise, with their symbolic ritual, the reality of the change of government.\nIf the former president desires to leave the city of Brasília immediately after leaving the palace, he is usually allowed the courtesy of a last trip in the presidential airplane, that takes the former president to his hometown or to another Brazilian city of his choice. During the flight, however, the airplane does not bear the callsign \"Brazilian Air Force One\", as the passenger is no longer the president of the Republic. Usually, when the plane carrying the former president arrives at its destination, the former president is received at the airport by a gathering of his political supporters.\nFirst duties\nThe first duty of the new president is to appoint the Minister of Justice and the rest of the Cabinet. Thus, when the former president has left Planalto Palace, the new president goes indoors and enters a hall of the Planalto Palace where his future Cabinet and several guests are already waiting. There the investiture of the president's Cabinet takes place. The president first signs a decree appointing the Minister of Justice. The appointed minister then comes forward to sign the investiture book. After the Minister of Justice signs the investiture book, the president proceeds to appoint the remainder of the Cabinet members, signing decrees that are counter-signed by the Minister of Justice.\nWhen each decree is signed, the appointed Minister comes forward and signs the investiture book. Once the entire Cabinet has been invested, the general officers chosen as professional commanders of each branch of the Armed Forces (who discharge their duties under the Minister of Defence, a civilian), are appointed and invested by the president, who is ex officio the Supreme Commander of the Armed Forces. Then follows the appointment and investiture of other senior officers of the Executive branch, such as Cabinet-level officials of the presidency of the republic.\nOnce all the Cabinet and Cabinet-level officers have been invested, the act of their investiture usually ends with a \"family photo\" of the new Administration around the new president and vice-president. For this photo, the new ministers' alignment and proximity to the president is dictated by the order of precedence, with the ministers who head older departments standing in the first row, and the heads of the newer departments standing in the back rows. Some departments, such as the Department of Defence, take precedence from prior departments now abolished.\nWhen all the Cabinet members, the professional commanders of each branch of the Armed Forces and other senior executive officials have been appointed and invested, the president then goes to another hall of the Palace: a queue is formed and the new president greets one by one the Heads of State and Heads of Government present, as well as the Heads of mission and other foreign envoys. Once all official foreign representatives have had the opportunity to greet the new president, he then goes on to greet other Brazilian authorities, such as Supreme Court justices, Congressional leaders and State Governors, as well as representatives of the civil society, such as Brazilian Cardinals, rabbis, etc.\nFor the inauguration of President Dilma Rousseff, the usual order of the presidential first duties was slightly reversed: first the new president greeted the foreign heads of state, heads of government and official envoys, and only then she proceeded to the ceremony of the investiture of the Cabinet and Cabinet-level officers. After that ceremony of investiture and the taking of the \"family photo\" of the administration, the President went on to receive the Brazilian authorities and the representatives of civil society. This change in protocol, with the meeting of the foreign representatives preceding the investiture of the Cabinet and Cabinet-level officers, was adopted so that the foreign representatives would not be left waiting for too long before having an opportunity to shake hands and exchange a few words with the President. However the ceremonial downside of the new arrangement was that, during the meeting with the queue of foreign representatives, the President of the Republic had at her side the soon-to-be Minister of Foreign Relations, but the minister-in-waiting was not yet formally appointed and invested in his office. It is unknown whether this new arrangement of the first duties will prevail in future inaugurations.\nReception\nAt the night of the inauguration, the president holds a formal reception at the Alvorada Palace, the presidential residence, or at the state rooms of Brasília's Itamaraty Palace, the seat of the Ministry of Foreign Relations. This reception is often a ball with dinner, and traditionally the presidential ball was a white-tie event (white-tie events are very rare in Brazil). However, Presidents Lula da Silva and Rousseff have opted for less formal and less lavish parties, and have instead hosted more simple cocktails, to which guests were expected to attend in suit and tie.\nFile:Secretary Pompeo and Mrs. Pompeo Pose for a Photograph With Brazilian President Bolsonaro and First Lady Bolsonaro in Brazil (31619369587).jpg|United States Secretary Pompeo at Jair Bolsonaro's Presidential Inauguration.\nFormat of presidential inaugurations when Rio de Janeiro was the Capital of Brazil\nRio de Janeiro was the Brazilian capital until the construction of Brasília in 1960.\nThe ceremonies were different but had a similar format. They started at the seat of the Chamber of Deputies (housed at the Tiradentes Palace from 1926 until the transfer of the Capital to Brasília) where the president took the oath of office before a joint session of Congress and delivered an inaugural address. Using the ceremonial state car, he then proceeded in parade to the seat of the Presidency (the Catete Palace in the later years of Rio's history as Capital of the Republic). After receiving the presidential sash indoors, in the presence of dignitaries and guests assembled in one of the Halls of Catete Palace, the president appeared on the balcony and addressed the crowds. Some presidents, instead of appearing in the balcony to deliver the speech facing the people, chose to deliver the address in the same hall of the Catete Palace where the ceremonial transfer of the presidential sash took place (in the early days of the Republic, the president only took the oath before Congress, without delivering a speech in the presence of the Legislature; thus, in those days, the Catete Palace speech was the only inaugural address delivered by a new president; the later addition of a speech before Congress created the situation of the president delivering two speeches on inauguration day, a situation that continued after the Capital's transfer to Brasília and that remains to this day). The new president then escorted the former president as he left the presidential palace. The appointments, greetings and reception were held at the Catete Palace.\nIn 1891, the first president and vice-president of the Republic were sworn-in at the Imperial Palace of St. Christopher, that in the First Brazilian Republic was known simply as Palace of the Quinta da Boa Vista (in reference to the park where the Palace stands). This Palace had been the residence of the Emperors of Brazil, and, after the military coup d'état that proclaimed Brazil a republic, it was chosen as the seat of the republican Constituent Congress (1890-1891) precisely because it had been one of the seats of the deposed Brazilian monarchy. The Chamber of Deputies and the Senate assembled there for their joint sessions during the drafting of the Constitution, and also for the election and inauguration of the first president and vice-president. Afterwards, the Chamber of Deputies returned to its seat in the now demolished Paço da Cadeia (literally, Jail Palace), a building that stood in the same site now occupied by the Tiradentes Palace, and that had served as a jail in the colonial era and was reformed several times, first to serve as the seat of Rio's municipal chamber, then to serve as the seat of the 1823 Constituent Assembly, then to serve as seat of the Chamber of Deputies from 1826 onwards. Meanwhile, after the 1890-1891 Constituent Congress, the Senate was housed in the same building that served as its seat in the imperial era, the Paço do Senado (Senate Palace) - previously known as the Conde dos Arcos Palace when it was the private residence of a Portuguese count who had served as the last viceroy of Colonial Brazil - a building adjoining the Campo de Santana park, now officially known as the Republic Square. The Senate Palace now houses the Federal University of Rio de Janeiro's National Faculty of Law. In 1922, the Senate was moved to the newly built Monroe Palace. As for the Chamber of Deputies, it was temporarily moved to the National Library of Brazil also in the year 1922, while its seat, the Paço da Cadeia was demolished, and work on the construction of Tiradentes Palace, its replacement situated in the same address, began. In 1926 the Tiradentes Palace was opened for business, and the Chamber of Deputies settled there, leaving behind its temporary quarters at the National Library. During the period when the Chamber of Deputies was temporarily housed in the National Library, joint sessions of Congress took place in the Senate's Monroe Palace. From 1926 onwards, joint sessions of Congress were held at the Tiradentes Palace. Accordingly, the presidential inaugurations from 1894 onwards were first held at the Paço da Cadeia (from the 1894 inauguration to the 1919 inauguration), then at the Monroe Palace (the 1922 inauguration only), and later at the Tiradentes Palace (from the 1926 inauguration to the 1956 inauguration).\nAs for the part of the inauguration ceremonies taking place at the seat of the Executive Branch, the Presidency was initially housed at Rio's Itamaraty Palace. The building, a former noble residence, served as the residence and workplace for the Head of the Provisional Government of the Republic from 1889 to 1891, and then, with the creation of the office of President of the Republic, it became the Presidency's seat from 1891 until 1898. Thereafter, the seat of Presidency of Brazil was moved to the Catete Palace, that served as the seat of the Presidency during two periods: between 1898 and 1926; and again between 1946 and 1960, when the newly built city of Brasília became the Capital of Brazil. In 1898, after ceasing to be a presidential palace, the Itamaraty Palace became the seat of the Ministry of Foreign Affairs (when the Brazilian Capital was moved to Brasília the Ministry's Palace in that city was also given the name Itamaraty, that had by then become synonymous with the Brazilian foreign service). Rio's Itamaraty Palace today houses a branch office of the Ministry of Foreign Affairs, while the Catete Palace is now a museum. From 1926 to 1946 the seat of the Presidency was housed in Guanabara Palace (that in the imperial era was built as the private home of the Princess Imperial Isabel, and became a government guesthouse after the proclamation of the Republic). In 1946 Guanabara Palace became the seat of the Mayor of the Federal District, and currently houses the State Government of Rio de Janeiro.\nBack in the days when Rio was still the Capital of Brazil, all the acts of a planned inauguration, including the joint session of Congress for the swearing-in of a new president, were white tie events. After the 1960 transfer of the Brazilian capital to the newly built city of Brasília, the inauguration of President Jânio Quadros in 1961 was the last inauguration during which all acts, including the joint session of Congress, were white tie events.\nImage:Rio-PalacioTiradentes.jpg|Tiradentes Palace\nImage:Catete-CCBY.jpg|Grand Staircase at Catete Palace\nInauguration Day\nIn the Old Republic era (Republica Velha), that lasted from 1889 until 1930, the Constitution adopted on 24 February 1891 established that the first presidential term would finish in 1894; the president and vice-president for the first presidential term would be elected by the Constituent Congress as soon as the Constitution was promulgated under the transitional provisions of that document (the first presidential inauguration took place on 26 February 1891). Subsequent presidents were, as per the permanent provisions of the Constitution, elected by direct popular ballot. Presidential elections were held on 1 March in the last year of a presidential term, and new presidents were inaugurated on 15 November (the anniversary of the Proclamation of the Republic). Accordingly, 15 November was inauguration day during the Old Republic era. The first inauguration under the permanent provisions of the Constitution took place on 15 November 1894.\nIn the wake of the 1930 Revolution, the Constitution adopted on 16 July 1934, in its transitional provisions, empowered the Constituent Assembly to elect the president for the first presidential term. Chosen by the Constituent Assembly, Getúlio Vargas, until then Head of the Provisional Government, took office as president on 20 July 1934. Subsequent presidents would be elected by direct popular ballot and the next president would take office on 3 May 1938. Accordingly, 3 May would be Inauguration Day under the 1934 Constitution (3 May had also been the date of the State Opening of Parliament in the imperial era). The 1934 Constitution was however short-lived due to the presidential coup d'etát of 10 November 1937, so that no presidential elections were held under its permanent provisions.\nUnder the Constitution imposed by President Vargas on 10 November 1937, the Brazilian Government was in effect a dictatorship. The referendum announced in the Constitution, in which the people would confirm or reject the new constitutional system, was never held (the date of that referendum was never set by the Government). The Constitution nominally established a six-year presidential term, with the first presidential term starting on the date of adoption the Constitution, but another provision of the document allowed the serving president (Vargas) to remain in office until the referendum on the Constitution was held. The said Constitutional provision indicated that, if the Constitution was confirmed in the referendum, then Vargas would complete his six-year presidential term. Thus, the referendum should have taken place in the first six years of the Constitution, but that was not done: Vargas ignored the duration of the presidential term mandated by the Constitution that he had imposed. In reality therefore, after the 1937 coup, Vargas retained power for more than the six-year period that had been announced, ruling Brazil as dictator for almost eight years, from his coup d'etát in November 1937 until his deposition in October 1945.\nWhen Vargas was deposed, new elections were summoned for a Constituent Assembly and a president, both chosen by direct popular ballot. The first presidential term subsequent to the deposition of the Estado Novo dictatorship began on 31 January 1946, and the Constitution adopted on 18 September 1946 established five-year presidential terms, but did not change the Inauguration Day. Accordingly, the subsequent five-year presidential terms also started on 31 January.\nIn the wake of the 1964 military coup, it was established that the president elected in April 1964 would serve until 31 January 1966. Marshal Castelo Branco subsequently extended his term until March 1967, by establishing that his successor would be inaugurated on 15 March 1967. On that same date, a new Constitution entered into force. Under the 1967 Constitution, 15 March remained as the presidential inauguration day.\nWith the adoption of Brazil's current Constitution, promulgated on 5 October 1988 in the wake of the country's transition to democracy, it was established in the permanent constitutional provisions that the presidential term of office would begin on 1 January.\nHowever, the transitional constitutional provisions stipulated that the mandate of the then serving president of the Republic would continue until he completed five years in office. Accordingly, the transitional provisions of the Constitution established that the first presidential elections under the Constitution, by direct popular ballot, would be held in 1989 and that the president and vice-president elect would be sworn in on 15 March 1990. A 1993 Constitutional Amendment reduced the presidential term of office from five to four years. Accordingly, President Collor, the first president elected under the 1988 Constitution was sworn in on 15 March 1990, but his presidential term would only end on 31 December 1995. Collor resigned the presidency in December 1992 and, was succeeded by Itamar Franco. His term of office was shortened by the Constitutional Amendment that reduced the duration of presidential terms from five to four years. As a result, Itamar Franco served until 31 December 1994, and, since 1995, Inauguration Day has been on 1 January as dictated by the permanent provisions of the Federal Constitution. Fernando Henrique Cardoso was the first president of Brazil to be inaugurated on 1 January, the current Inauguration Day under the permanent provisions of the Constitution adopted in 1988.\nForm of the oath of office\nThe oath of office taken by the president and by the vice-president, officially known as the compromisso constitucional (constitutional commitment;constitutional pledge), is prescribed by article 78 of the Constitution of the Federative Republic of Brazil. The Federal Constitution currently in force in Brazil was promulgated on 5 October 1988.\nArticle 78 of the Constitution prescribes that \"the President and the Vice-President of the Republic shall assume their offices in a sitting of the National Congress, by taking the pledge to maintain, defend and uphold the Constitution, observe the Laws, promote the general welfare of the Brazilian people, and to sustain the union, the integrity and the independence of Brazil\" (O Presidente e o Vice-Presidente da República tomarão posse em sessão do Congresso Nacional, prestando o compromisso de manter, defender e cumprir a Constituição, observar as leis, promover o bem geral do povo brasileiro, sustentar a união, a integridade e a independência do Brasil).\nNo words are added to the oath, so that the constitutional commitment consists only of the vow prescribed by the Constitution. No religious invocation, and not even the names of the officers taking the oath are added to the formula. Accordingly, the form of the oath of office, for both the president and the vice-president, runs as follows:\nRecent inauguration ceremonies\nInauguration of Luiz Inácio Lula da Silva\nPresident Luiz Inácio Lula da Silva had the most popular presidential inauguration in history. Citizens from all corners of Brazil went to the national capital for the inauguration ceremony. There were 3 innovations:\n* Concerts before the ceremony for those who arrived early. One main stage at Square of the Three Powers and others around the Ministries Esplanade.\n* Projection screens were placed around the Ministries Esplanade and secondary rooms of National Congress and Planalto Palace, allowing everyone to follow the televised ceremony.\n* A second presidential parade was held after the official ceremonies, for the president to pass through the crowds and greet them.\nInauguration of Dilma Rousseff\nDilma Rousseff was inaugurated as President of Brazil on 1 January 2011. The event &ndash; which was organized by her transitional team, the Ministries of External Relations and Defense and the Presidency of the Republic &ndash; was awaited with some expectation, since she became the first woman to hold the office of president. Important female figures in Brazilian history were honored with panels spread across the Monumental Axis.\nUntil 21 December 2010, the publishing house of the Senate had printed 1,229 invitations for Rousseff's inauguration. The National Congress had expected a total of 2,000 guests for the ceremony. The ceremony was attended by delegations from 47 countries. As reported by the press, a total of 23 heads of state and government had confirmed their presence. Among them were José Sócrates, Juan Manuel Santos, Mauricio Funes, Alan García, José Mujica, Hugo Chávez, Álvaro Colom, Alpha Condé, Sebastián Piñera, Evo Morales, and Boyko Borisov. U.S. President Barack Obama sent Secretary of State Hillary Clinton to represent him. Former Japanese Prime Minister Taro Aso also attended.\nIn addition to the formal ceremony, Rousseff's inauguration also featured concerts by five female Brazilian singers: Elba Ramalho, Fernanda Takai, Mart'nália and Zélia Duncan, and Gaby Amarantos. The Ministry of Culture organized the cultural part of the event, having provided a budget of 1.5 million reais (around 0.8 million U.S. dollars) for it. The concerts started at 10:00 hours (local time) and stopped at 14:00 hours, with the start of the official inauguration ceremony. The concerts continued at 18:00 hours until 21:00 hours. Rousseff did not attend, as she held a reception at the Itamaraty Palace to foreign authorities which attended her inauguration. Each foreign authority had the opportunity to talk to her for 30 seconds.\nInauguration of Jair Bolsonaro\nJair Bolsonaro was inaugurated as President of Brazil on 1 January 2019. The event was made secure with 3,000 police contingent patrolling the capital, with tanks and fighter jets being deployed. Bolsonaro succeeded President Michel Temer, who served as the country's president following the impeachment of Dilma Rousseff in early 2016. The inaugural events were attended by US Secretary of State Mike Pompeo, Hungarian Prime Minister Viktor Orbán, Israeli Prime Minister Benjamin Netanyahu, Portuguese President Marcelo Rebelo de Sousa, and Bolivian President Evo Morales. The ceremony notably was not attended by representatives of countries such as Cuba, Venezuela and Nicaragua, whose leaders saw a rift with a conservative Bolsonaro government and their socialist platform.\nGallery\nImage:2247RS017-1-.jpg|President Lula da Silva delivers the inaugural address at the National Congress\nImage:President Lula passing by troops.jpg|President Lula da Silva reviews the troops of the Presidential Guard Battalion\nImage:2041WD245.JPG|President Lula da Silva delivers a public address at the Parlatorium of the Planalto Palace\nImage:Planalto Palace, President Luiz Inácio Lula da Silva.jpg|Screen inside the Planalto Palace showing President Luiz Inácio Lula da Silva delivering his public address at the Parlatorium\nImage:Inauguration ceremony of President Lula.jpg|21-gun salute being fired by members of the Cayenne Battery\nFile:Posse_dilma_2010_1.JPG|The inauguration parade of President Rousseff\nReferences\nExternal links\n*[http://www.presidencia.gov.br/criancas/cerimonias/cerimoniadeposse/ Information and pictures regarding the presidential inauguration] Presidency of Brazil. Accessed on 25 July 2009.\n*[http://www.planalto.gov.br/ccivil_03/Decreto/D70274.htm Decree no. 70,274 - Presidential Inauguration Ceremonial] Presidency of Brazil. Accessed on 5 November 2010."
    }
  ]
}