{
  "content": [
    {
      "type": "text",
      "text": "# Breaking the Chains (album)\n\nSeptember 1983 (US)\n| recorded =\n| studio = Dierks Studios, Cologne\n| genre = *Heavy metal\n*glam metal\n| length =\n| label =\n| producer = Michael Wagener, Dokken\n| prev_title = Back in the Streets\n| prev_year = 1979\n| next_title = Tooth and Nail\n| next_year = 1984\n| misc =\n| single2 = Young Girls\n| single2date = 1981 (Germany)\n| single3 = We're Illegal\n| single3date = April 1982 (UK)\n| single4 = Breaking the Chains\n| single4date = November 1983 (US)\n}}\n}}\n| rev2 =''The Collector's Guide to Heavy Metal\n| rev2Score = 7/10\n| noprose = yes\n}}\nBreaking the Chains is the debut studio album by American heavy metal band Dokken. It was originally released in Europe as '''Breakin' the Chains' on the French label Carrere Records, in 1981. This version contains different mixes and titles of songs from the later U.S. edition. \"Paris Is Burning\" is called \"Paris\", and is actually a studio version as opposed to the live recording in Berlin from December 1982. The album also contains a song called \"We're Illegal\", which later turned into \"Live to Rock (Rock to Live)\".\nThe album was remixed, partially re-recorded, renamed and released in the US in 1983 by Elektra Records, and reached number 136 on the Billboard 200 chart. The album was considered a flop by the label, which had the intention to drop the band. However, Dokken management convinced Elektra they could make a more successful album, which materialized in Tooth and Nail in September 1984. Breaking the Chains' title track was named the 62nd greatest hard rock song by VH1. It is featured on the radio station \"V-ROCK\" in the 2006 video game Grand Theft Auto: Vice City Stories.\nIn a discussion with George Lynch on January 26, 2011, he mentioned the existence of 500 copies of the Carrere Records ''Breakin' the Chains'' version printed with the Don Dokken moniker, instead of Dokken. This version also featured different album cover art.\nTrack listing\n1981 Breakin' the Chains (Carrere Records)\nAll writing credited to Don Dokken and George Lynch, except where noted\n1983 Breaking the Chains (Elektra Records)\nPersonnel\n1981 Album\n*Don Dokken – lead and backing vocals, rhythm guitar, lead guitar (7, 8)\n*George Lynch – lead guitar (1–5, 9, 10), overdubbed solo (6)\n*Peter Baltes – bass (1–4, 6–8, 10), backing vocals (3, 6)\n*Juan Croucier – bass and co-lead vocals (5, 9)\n*Mick Brown – drums (1–5, 9, 10), backing vocals (3)\n*Bobby Blotzer – drums (6–8)\nTracks 6, 7 and 8 were recorded at Dierks Studios as demos for Carrere. Don Dokken, Peter Baltes, and Bobby Blotzer were involved. Later, the main album sessions commenced with Dokken and Baltes as well as George Lynch and Mick Brown. Lynch overdubbed a guitar solo on track 6. The band soon returned to Germany with Juan Croucier, their regular bassist, to record tracks 5 and 9.\n1983 Album\n*Don Dokken – lead and backing vocals, rhythm guitar\n*George Lynch – lead guitar\n*Juan Croucier – bass, backing vocals\n*Mick Brown – drums\nProduction\n*Michael Wagener – production, engineering, mixing\n*Wyn Davis – mixing\n*Joe Gastwirt – mastering\nCharts\n{| class=\"wikitable plainrowheaders\"\n|-\n! Chart (1983)\n! Peakposition\n|-\n!scope=\"row\"|Japanese Albums (Oricon)\n| align=\"center\"| 75\n|-\n!scope=\"row\"| US Billboard 200\n|\n|}\nCertifications\n}}\nNotes\nOn the original ''Breakin' the Chains'' Carrere Records version, released under the name Don Dokken, several song titles are misspelled on the back cover. Namely \"I Can't See You\" (\"I Can See You\"), \"Stick to Your Guns\" (\"Still to Your Guns\"), and \"Young Girls\" (\"Young Girl\"). On the French Carrere vinyl release, the songs are spelled correctly, but George Lynch's name is misspelled as \"Georges Lynch\".\nReferences"
    }
  ]
}