{
  "content": [
    {
      "type": "text",
      "text": "# Breaking the Girl__disambig_1\n\n| recorded   =\n| studio     = The Mansion (Los Angeles, California)\n| genre      = Alternative rock, psychedelic rock, folk rock\n| length     =\n* 4:55 (album version)\n* 4:27 (single edit)\n| label      = Warner Bros.\n| writer     = Flea, John Frusciante, Anthony Kiedis, Chad Smith\n| producer   = Rick Rubin\n| prev_title = Suck My Kiss\n| prev_year  = 1992\n| next_title = Behind the Sun\n| next_year  = 1992\n| misc       = }}\n}}\n\"Breaking the Girl\" is a song by American rock band Red Hot Chili Peppers from their fifth studio album, Blood Sugar Sex Magik (1991). It was released as the fourth single from their studio album in August 1992 and is a melodic ballad that refers to a turbulent relationship between frontman Anthony Kiedis and his former girlfriend, Carmen Hawk.\nComposition\n\"Breaking the Girl\"'s bridge is marked by a percussion break that builds through the use of increasingly complex rhythms.  The percussion instruments consisted of junkyard debris found by drummer Chad Smith, guitarist John Frusciante, and bassist Flea. Frusciante's main riff was inspired by Led Zeppelin's ballads, such as \"The Battle of Evermore\" and \"Friends\". The song also makes use of a 12-string guitar, tuned a half step down, and a Mellotron, using the flute patch. It is in the 6/8 time signature. Chad Smith said in The Chad & Flea Show that his drumming in the song was inspired by Mitch Mitchell's work in the Jimi Hendrix Experience song \"Manic Depression\".\nMusic video\nThe music video was released on July 30, 1992, and was directed by Stéphane Sednaoui, who had previously made a video for the song \"Give It Away\". It makes heavy, experimental use of vibrant colors, with the background and costumes changing constantly. The band members adopt surreal appearances and behavior, with Kiedis for example having an overall Princess Leia-esque look, complete with robes and a \"donut\" hairstyle. The \"Breaking the Girl\" video is one of only two videos to feature Arik Marshall (who briefly acted as a replacement for guitarist John Frusciante) the other video being for \"If You Have to Ask\" – though he did not play on either track. The video also features a brief cameo by River Phoenix, who was good friends with members of the band. The woman in the video is model/actress Patricia Velásquez.\nLive performances\nThe song was performed once on the Blood Sugar Sex Magik Tour opening date in 1991, and later reappeared in the band's setlist once in 2000 but not again until 2003. After an eight-year hiatus from being performed, the band added the song to a few setlists on their I'm with You Tour. Kiedis also briefly performed the song with The Roots during his appearance on The Tonight Show Starring Jimmy Fallon in November 2014. The song returned after a five-year hiatus from the band's setlist in January 2017 on The Getaway World Tour.\nTrack listings\nCD and 12-inch single (1992)\n# \"Breaking the Girl\" (edit)\n# \"Fela's Cock\" (previously unreleased)\n# \"Suck My Kiss\" (live)\n# \"I Could Have Lied\" (live)\nCD single version 2 (1992)\n# \"Breaking the Girl\" (edit)\n# \"Suck My Kiss\" (live)\n# \"I Could Have Lied\" (live)\n7-inch single (1992)\n# \"Breaking the Girl\" (edit)\n# \"Fela's Cock\" (unreleased)\nCassette single (1992)\n# \"Breaking the Girl\" (edit)\n# \"The Power of Equality\" (album version)\nPersonnel\nRed Hot Chili Peppers\n* Anthony Kiedis – lead vocals, percussion\n* John Frusciante – guitars, backing vocals, percussion\n* Flea – bass, percussion\n* Chad Smith – drums, percussion\nAdditional musicians\n* Brendan O'Brien – mellotron\nCharts\n{|class=\"wikitable sortable plainrowheaders\" style=\"text-align:center\"\n!scope=\"col\"|Chart (1992)\n!scope=\"col\"|Peakposition\n|-\n|-\n|-\n!scope=\"row\"|Europe (Eurochart Hot 100)\n|94\n|-\n!scope=\"row\"|Finland (Suomen virallinen lista)\n|20\n|-\n|-\n|-\n|-\n|-\n|-\n|}\nCertifications\nRelease history\n{|class=\"wikitable plainrowheaders\"\n!scope=\"col\"|Region\n!scope=\"col\"|Date\n!scope=\"col\"|Format(s)\n!scope=\"col\"|Label(s)\n!scope=\"col\"|\n|-\n!scope=\"row\"|United Kingdom\n|August 3, 1992\n|\n|rowspan=\"2\"|Warner Bros.\n|\n|-\n!scope=\"row\"|Australia\n|August 31, 1992\n|\n|\n|}\nReferences"
    }
  ]
}