{
  "content": [
    {
      "type": "text",
      "text": "# Breathless (Shayne Ward album)\n\n| producer   =\n| prev_title = Shayne Ward\n| prev_year  = 2006\n| next_title = Obsession\n| next_year  = 2010\n| misc       =\n}}\nBreathless is the second studio album by English singer Shayne Ward. It was released through Syco Music and Sony BMG on 26 November 2007 in the United Kingdom. Ward reteamed with previous collaborators Rami Yacoub, Arnthor Birgisson and Savan Kotecha to work on most of the material. Additional producers on the album include Jonas Jeberg, Cutfather, AJ Junior, and Ryan Tedder.\nThe album earned largely mixed reviews from music critics but was commercially successful, debuting at number one on the Irish Albums Chart, while also reaching number two on the UK Albums Chart. Two singles were released from the album, one of which was a double A-side.  Breathless earned a platinum certification in the United Kingdom and went five times platinum in Ireland.\nBackground\nWard worked on the album for nearly a year and a half, longer than he had spent on his previous solo album and The X Factor put together. Ward described the album as a more \"funky, sexy and different step from him.\" Producers Rami Yacoub, Arnthor Birgisson, and Ryan Tedder also worked on the album. The first single from the album, \"If That's OK with You\" / \"No U Hang Up\", was released to radio on 7 September 2007. The video for \"If That's OK With You\" were premiered on 18 August 2007. On 14 September, the single was released physically, and the video for \"No U Hang Up\" was released via Channel 4 and Ward's official YouTube page. The single reached number two in the Britain and number eleven in Ireland.\nThe second and final single from the album was \"Breathless\", which was released on 19 November 2007. Television promotion included appearances on the fourth series of The X Factor on 10 November 2007 and The Paul O'Grady Show on 19 November 2007. The single entered the UK Singles Chart at No. 2 on 25 November 2007. During the release of \"Breathless\", it was announced that Ward was planning a six-month-long British tour to support the album. The tour started in Glasgow, Scotland on 12 May 2008 and eventually ended in Ireland on 29 December 2008, following extra dates being added. The tour visited cities such as London, Sheffield, Aberdeen and Manchester.\nCritical reception\n| rev2 = Digital Spy\n| rev2score =\n| rev3 = The Times\n| rev3score =\n| rev4 = Virgin Media\n| rev4score =\n| rev5 = Yahoo! Music UK\n| rev5score =\n}}\nThe album has received mixed reviews from music critics. Times Online gave the album three out of five stars, stating \"With chart battles involving producers rather than artists, poor Ward finds himself fighting it out with the big budget likes of Justin Timberlake in the sweet voice stakes.\" Similarly, AllMusic editor Sharon Mawer noted that Breathless was \"vastly different\" from Ward's debut album and found that much of the \"uptempo R&B numbers\" were \"more akin to Justin Timberlake.\"\nThe BBC gave the album a mixed-to positive review, calling it \"an album that sums up the predicament of the reality pop star. Having taken the fast track to the big time, Shayne has no style of his own and is open to the whims of his production team.\" Nick Levine from Digital Spy felt that \"large portions of Breathless, they're crippled by the dry, stale whiff of anonymity.\" Andy Strickland from Yahoo! Music UK wrote that \"the overwhelming fact about ##Breathless## is that not one of these songs will be around long enough for next year's X Factor auditionees to bother learning them. There's nothing here to match the calibre of song that Ward sang to get here in the first place.\"\nCommercial performance\nOn 2 December 2007, the album reached number one in the Irish Albums Chart, knocking Leona Lewis's Spirit off the top. It debuted at number two in the UK Albums Chart selling 95,801 in its first week, being held off by Lewis On 31 October 2007, an official Breathless DVD, which included exclusive interviews and five music videos, was released via Woolworths stores in the UK, and by the end of the year, Breathless had reached 5× Platinum in Ireland. By September 2009, the album had sold over 450,000 copies in the UK.\nTrack listing\n| extra1          =\n| length1         = 4:22\n| title2          = Breathless\n| writer2         =\n| extra2          =\n| length2         = 3:47\n| title3          = If That's OK with You\n| writer3         =\n| extra3          = Arnthor\n| length3         = 3:36\n| title4          = Damaged\n| writer4         =\n| extra4          =\n| length4         = 4:03\n| title5          = Stand by Your Side\n| writer5         =\n| extra5          =\n| length5         = 3:39\n| title6          = Until You\n| writer6         =\n| extra6          =\n| length6         = 4:08\n| title7          = Some Tears Never Dry\n| writer7         =\n| extra7          =\n| length7         = 3:49\n| title8          = Melt the Snow\n| writer8         =\n| extra8          =\n| length8         = 3:47\n| title9          = Tangled Up\n| writer9         =\n| extra9          =\n| length9         = 3:53\n| title10         = Just Be Good to Me\n| writer10        =\n| extra10         =\n| length10        = 3:45\n| title11         = U Got Me So\n| writer11        =\n| extra11         =\n| length11        = 3:38\n| title12         = You Make Me Wish\n| writer12        =\n| extra12         =\n| length12        = 3:56\n| title13         = Tell Him\n| writer13        =\n| extra13         =\n| length13        = 3:59\n}}\n| extra_column    = Producer(s)\n| title14         = If That's OK With You\n| note14          = Moto Blanco Remix\n| writer14        =\n| extra14         = }}\n| length14        = 9:19\n| title15         = Breathless\n| note15          = The Snowflakers Remix\n| writer15        =\n| extra15         = }}\n| length15        = 3:46\n| title16         = Gonna Be Alright\n| writer16        = Tedder\n| extra16         = Tedder\n| length16        = 4:23\n}}\n| title1          = Interview\n| length1         = 20:00\n| title2          = That's My Goal\n| note2           = Video\n| length2         = 3:41\n| title3          = No Promises\n| note3           = Video\n| length3         = 3:44\n| title4          = Stand by Me\n| note4           = Video\n| length4         = 4:21\n| title5          = If That's OK with You\n| note5           = Video\n| length5         = 3:36\n| title6          = No U Hang Up\n| note6           = Video\n| length6         = 4:21\n}}\nNotes\n* denotes remix producer\nCharts\nWeekly charts\n{| class=\"wikitable sortable plainrowheaders\" style=\"text-align:center;\"\n|+ Weekly chart performance for Breathless\n|-\n! scope=\"col\"| Chart (2007–2008)\n! scope=\"col\"| Peakposition\n|-\n|-\n|-\n|-\n|}\nYear-end charts\n{| class=\"wikitable plainrowheaders\" style=\"text-align:center;\"\n|+ Year-end chart performance for Breathless\n|-\n! scope=\"col\"| Chart (2007)\n! scope=\"col\"| Position\n|-\n! scope=\"row\"| UK Albums (OCC)\n| 27\n|}\nCertifications\nRelease history\n{| class=\"wikitable plainrowheaders\"\n|+ Breathless  release history\n|-\n! scope=\"col\"| Region\n! scope=\"col\"| Date\n! scope=\"col\"| Edition\n! scope=\"col\"|\n|-\n! scope=\"row\"|United Kingdom\n|26 November 2007\n| rowspan=\"2\"|Standard\n| align=\"center\"|\n|-\n! scope=\"row\"|Japan\n|2 February 2008\n| align=\"center\"|\n|-\n! scope=\"row\"|Asia\n|4 November 2008\n|Special\n| align=\"center\"|\n|}\nSee also\n*The Breathless Tour 2008\nReferences"
    }
  ]
}