{
  "content": [
    {
      "type": "text",
      "text": "# Breaking the News (1912 film)\n\n| producer       = William GibsonMillard JohnsonJohn TaitNevin Tait\n| writer         = W. J. Lincoln\n| based_on       = the painting by Sir John Longstaff\n| starring       = Harrie IrelandArthur Styan\n| music          =\n| cinematography = Orrie Perry\n| editing        =\n| distributor    =\n| studio         = Amalgamated Pictures\n| released       =\n| runtime        = 4,000 feet\n| language       = Silent filmEnglish intertitles\n| country        = Australia\n| budget         =\n}}\nBreaking the News is a 1912 Australian melodrama film directed by W. J. Lincoln based on John Longstaff's 1887 painting of the same name.\nIt is considered a lost film.\nPlot\nAccording to Table Talk \"The story deals with life in a mining centre in Australia, the play opening with the rescue of Roberts by a party of prospectors after he has been deserted by his mate, who clears off\nwith the gold. The treacherous mate through threats and scheming eventually weds the daughter of the mine manager at whose mine lie is employed as foreman. Roberts also turns up at the mine and is employed; he is at times irresponsible and is ever threatening. The false mate decides to do away with him, and knocks him on the head when below, and in seeking a'place to bury him strikes water and floods the mine. They are both rescued, but the foreman dies, and the father breaks the news to his daughter, who is nursing her young infant. The story ends happily, for the true lovers are re-united and the mine strikes rich.\"\nAccording to another listing the main scenes were:\n*The Never Never Land\n*Fight for Water\n*Deep Lead Calm\n*To Win a Wife\n*Above the Plains\n*Plighted Love\n*Galatea Mine\n*Memory of the past\n*Broken Hill - chambers\n*Stock Exchange, Melbourne\n*Rise in Shares\n*Face of the Drive\n*Salting the Mine\n*The Marshes of Sin\n*Face to Face\n*The Wedding Morn\n*Crib Time\n*At the Shaft\n*Roberts Disguised\n*Dean Fraser's Home\n*Terrible Danger\n*Down the Shaft\n*Murder of Roberts\n*The Flooded Mine\n*Like Rats in a Trap\n*Fraser's Rescue\n*The Flame of True Love Never Dies\nCast\n*Harrie Ireland\n*Arthur Styan\nProduction\nThe film was shot at Diamond Creek, near Melbourne.\nReception\nThe movie was a popular success with critics drawing particular attention to a scene of an underground mine being flooded.\nThe Melbourne Herald said it \"was attracting large crowds\" and was of \"absorbing interest\".\nAccording to advertising \"It is typically Australian, and, judging by the  tremendous enthusiasm that it evokes nightly, .it appeals to Australians as no other picture-drama has ever done.\"\nIn March 1912 The Bulletin wrote \"three cheers for the big black and white item, Breaking the News.   The yarn is excellently acted and photographed, but the plot is not too conspicuous for common-sense.\"\nPunch said \"as a biographic achievement, is regarded as a work of art.\"\nThe Age said \"The tupping of an underground train and the finding of a mine are scenes of realism. The audience was enthusiastic.\"\nThe Launceston Examiner said the film was \"of great length, but never lacking in interest, is a remarkably realistic Australian mining story, embodying some of the most thrilling situations conceived in dramatic form. The acting is of a high standard, the setting true to life, and the whole atmosphere of the picture realistic and impressive. A power ful plot, abounding in exciting incidents, deals with life in the mining fields, which\nare clearly depicted as the environnient in which the film has been enacted.\"\nThe Adelaide Advertiser observed that the production \"marks a distinct advance in the colony's biograph work\". It concluded that Breaking the News \"should stand for some time as the most notable Australian dramatic subject yet presented to the public\".\nReferences\nExternal links\n*[https://www.imdb.com/title/tt0334963/ Breaking the News] at IMDb\n*[http://colsearch.nfsa.gov.au/nfsa/search/display/display.w3p;adv=no;group=;groupequals=;holdingType=;page=0;parentid=;query=%22breaking%20the%20news%22;querytype=;rec=2;resCount=10 Breaking the News] at National Film and Sound Archive\n*[http://www.austlit.edu.au/austlit/page/7592554 Breaking the News] at AustLit"
    }
  ]
}