{
  "content": [
    {
      "type": "text",
      "text": "# Breaking Point (1975 film)\n\n| runtime        = 95 minutes\n| country        = Sweden\n| language       = English\n| budget         =\n| gross          =\n}}\nBreaking Point is a 1975 Swedish adult thriller film written and directed Bo Arne Vibenius.\nIn the film, an office worker resorts to a series of rapes to deal with his sexual urges. When he is taken hostage by bank robbers, he proceeds to kill the robbers and to attack a police helicopter. Before rushing to the airport, where he is reunited with his returning wife and daughter.\nPlot\nA man named Bob Bellings rapes a woman in her apartment, then fatally bludgeons her with an ashtray. The next day, Bob goes to work at his office, where he watches a newscast in which a psychiatric expert explains that women should not resist being sexually assaulted, as that is what most predators want, and that 89% of surveyed women admitted to wanting to be raped at least once in their lives.\nOne of Bob's fellow employees (who are all female) later teases him in a sexual manner, which prompts Bob into going out for his break, during which he stalks and has sex with a woman. Bob returns to work and watches another newscast, which announces that the government will be issuing requisition cards that authorized citizens can take to gun shops and exchange for side arms.\nAfter another encounter with his promiscuous coworker, Bob leaves work, rents a car, and follows another woman to her home and rapes her. She responds by stabbing him with a pair of scissors during the act. When the woman tries to escape, Bob uses his car to knock hers off of the road and into a house, causing a fiery explosion. Bob then goes home and masturbates into a coffee cup, which he tricks the employee who had been taunting him into drinking from.\nBob proceeds to turn his requisition card in for a handgun, which the overzealous clerk provides explosive \"fragmentation ammo\" for. Upon leaving the munitions shop, Bob snatches a young girl from a playground, and eats candy with her in the woods before dropping her off at her house. Afterward, Bob practices with his gun, and picks up and has sex with a female hitchhiker, who at one point rides the gear shift of Bob's rental car (which Bob later returns, sans the gear shift's knob).\nBob is subsequently mugged, and then taken hostage by a trio of bank robbers, who decide to execute him. Bob uses his fragmentation rounds to kill the thieves before shooting down a police helicopter and escaping in a hijacked car. The film ends with Bob going to an airport and reuniting with his wife and daughter, who were away on a trip. When his wife asks him what he has been up to in her absence, Bob replies, \"Oh, you know nothing ever happens in this shit town\".\nCast\n* Andreas Bellis as Bob Bellings\n* Barbara Scott\tas Woman in Subway\n* Jane McIntosch\n* Susanne Audrian\n* Bertha Klingspor\n* Marlyn Inverness\n* Liza June\n* Adolf Deutch\n* Joachim Bender\n* Per-Axel Arosenius as Guns and Ammo Dealer\nRelease\nCreated primarily for foreign markets, Breaking Point, like Vibenius's previous film Thriller – A Cruel Picture, was banned in its home country of Sweden.\nReception\nJack Stevenson, the author of Scandinavian Blue: The Erotic Cinema of Sweden and Denmark in the 1960s and 1970s, noted that the film was \"even more bizarre\" than Thriller – A Cruel Picture, and was \"tasteless, violent, pornographic and some would certainly say misogynist - all meant no doubt to reflect the sickness endemic in society at large\". Daniel Ekeroth, author of Swedish Sensationsfilms: A Clandestine History of Sex, Thrillers, and Kicker Cinema, similarly categorized Breaking Point as \"completely crazy\" and \"one of the sickest and slowest films ever made\". In a review written for Trash Cinema: A Celebration of Overlooked Masterpieces, Michael Harris opined that the film \"creates a fantastic sense of insecurity\" and is \"a wonderful achievement in simplicity and confrontationalism without being confrontational\".\nReferences\nExternal links\n*"
    }
  ]
}