{
  "content": [
    {
      "type": "text",
      "text": "# Breaking Points\n\npresent)\n* Emily Jashinsky (2022present)\n* Griffin Davis (2025present)\n}}\n| language = English\n| length = 60 minutes\n| genre = Political news and commentary\n| format =\n| first_aired =\n| last_aired = present\n| module =\n| youtube_views         = 969.0 million\n| stats_update        = October 30, 2025\n}}\n}}\nBreaking Points with Krystal and Saagar (or simply Breaking Points) is a U.S. political news and opinion series created and hosted by Krystal Ball and Saagar Enjeti. It was launched in June 2021 by Ball and Enjeti, both former hosts of The Hills Rising web series. They publish an audio-only podcast, and the video program is available on YouTube, Rumble, Apple Podcasts, iHeartRadio, and Spotify (with the podcast version published by iHeart Podcasts). Its format includes one left-wing populist anchor (Ball) and one right-wing populist anchor (Enjeti), who provide news and commentary from an independent platform, separate from the mainstream media.\nFormat\nBreaking Points features commentary and analysis of political news and current events and in-studio interviews with journalists, politicians, and other political or cultural figures. Ball and Enjeti, the primary hosts, usually publish on Mondays, Tuesdays, and Thursdays.\nThe hosts have editorial control over the show, which focuses on the look and immediacy of live news broadcasting but with independent, populist messaging. Unlike The Hill, which has a full-time staff of 30, Breaking Points has a small crew of mainly part-time hourly contractors. Most of the show's revenue comes from premium subscribers, with some additional revenue from YouTube and podcast ads. In 2022, their expenses were said to be around $1 million per year.\nHistory\nOn May 28, 2021, Ball and Enjeti announced their departure from ''The Hill's Rising. The Breaking Points program and channel launched at YouTube on June 7, 2021, and reached 285,000 channel subscribers by June 11. Ball and Enjeti spoke about the subtle pressure they experienced working under The Hill's corporate umbrella and their dislike of working in a corporate bureaucracy.\nIn September 2022, former Rising hosts Ryan Grim (who expresses democratic socialist views) and Emily Jashinsky (who expresses conservative views) joined Breaking Points. They serve as replacement hosts when Ball and Enjeti are unavailable and host their own show, Counter Points, on Wednesdays.''\nReception\nIn July 2025, Breaking Points was the 28th-most popular podcast on YouTube in the United States and the 84th-most popular podcast on Spotify in the United States.\nReferences\nExternal links\n*\n*"
    }
  ]
}