{
  "content": [
    {
      "type": "text",
      "text": "# Breaking (film)\n\n| based_on =\n| producer =\n| starring =\n| cinematography = Doug Emmett\n| editing = Chris Witt\n| music = Michael Abels\n| studio =\n| distributor = Bleecker Street\n| released =\n| runtime = 103 minutes\n| country = United States\n| language = English\n| budget =\n| gross = $2.8 million\n}}\nBreaking is a 2021 American thriller drama film starring John Boyega as a Marine Corps veteran, Brian Brown-Easley, who is in financial trouble and robs a bank. It is written and directed by Abi Damaris Corbin and co-written by Kwame Kwei-Armah, based on the true story of Brown-Easley, detailed in the 2018 Task & Purpose article \"They Didn't Have to Kill Him\" by Aaron Gell. The film also stars Nicole Beharie, Selenis Leyva, Connie Britton, Jeffrey Donovan, and Michael Kenneth Williams.\nThe film premiered at the 2022 Sundance Film Festival under its original title 892 on January 21, 2022, and was released in the United States by Bleecker Street on August 26, 2022. It received generally positive reviews from critics.\nPlot\nBrian Brown-Easley, a former Lance Corporal in the U.S. Marine Corps, struggles with financial hardship and psychological trauma following his honorable discharge. Suffering from post-traumatic stress disorder and a back injury, he is unable to hold down a job and relies on a monthly VA disability check of $892. When the VA unexpectedly withholds his payment due to a disputed debt of $892 to a for-profit college, Easley is left homeless and increasingly desperate.\nDetermined to make his voice heard and to expose the system that failed him, Easley walks into a Wells Fargo bank branch in Marietta, Georgia. He quietly informs two bank employees—Estel Valerie, the branch manager, and Rosa Diaz, a teller—that he has a bomb in his backpack, and asks them to lock the doors. Without making demands for money, Easley tells them he doesn’t want to hurt anyone but insists that the VA must fix the error and pay him the money he’s owed.\nEasley allows the rest of the customers to leave the bank unharmed and instructs Diaz and Valerie to stay calm. He calls 911 himself to explain the situation, and later contacts a local news outlet to ensure the story is heard. While police, media, and SWAT units surround the bank, crisis negotiator Eli Bernard (based on real-life Sgt. Andre Bates) attempts to build rapport with Easley, relating to him as a fellow veteran.\nMeanwhile, the hostages begin to sympathize with Easley as they witness his calm demeanor and sincere frustration. He repeatedly assures them he doesn’t want to hurt anyone and even allows Diaz to call her child to let them know she is safe. As the hours pass, Bernard struggles with bureaucracy and miscommunication from higher-ups while trying to convince Easley to end the standoff peacefully.\nEasley grows increasingly agitated as his attempts to tell his story seem to be ignored or distorted. He releases one of the hostages in good faith, hoping it will help negotiations, and continues asking only for the VA to acknowledge and correct the mistake that led to his financial crisis. Though Bernard tries to de-escalate the situation and encourages him to surrender, a police sniper fatally shoots Easley as he walks near the front of the bank holding his backpack.\nThe film ends by revealing that Easley’s bomb threat was a bluff—his backpack contained no explosives. News coverage highlights the fatal end to the standoff, prompting public outrage and scrutiny over the treatment of veterans and the handling of the crisis by police. A postscript reveals that the VA never repaid the withheld funds, and Easley's case becomes a symbol of how bureaucratic failures and neglect can drive vulnerable individuals to desperate acts.\nCast\nProduction\nOn March 2, 2021, it was announced that Jonathan Majors would star in the film, then titled 892, as a Marine war veteran who suffers from mental scars, and his hard transition back to civilian life. The screenplay was based on Aaron Gell's article \"They Didn't Have to Kill Him\", published on Task & Purpose on April 9, 2018. On July 8, 2021, it was reported that John Boyega replaced Majors due to a scheduling conflict with Ant-Man and the Wasp: Quantumania. On August 30, 2021, it was confirmed that Connie Britton joined the cast.\nPrincipal photography began on July 6, 2021, and was scheduled to conclude on August 16, 2021, in Los Angeles.\nRelease\nThe film premiered at the 2022 Sundance Film Festival on January 21, 2022, where the cast won the Special Jury Award for Ensemble Cast in the U.S. Dramatic Competition. On February 1, 2022, Bleecker Street acquired the film's US distribution rights. The film's title was later changed from 892 to Breaking, and it was set to be released on August 26, 2022.\nReception\nBox office\nIn the United States and Canada, Breaking was released alongside The Invitation and Three Thousand Years of Longing. The film debuted to $985,921 from 902 theaters in its opening weekend. It went on to gross $2.8 million at the box office.\nCritical response\nAudiences polled by PostTrak gave the film a 55% overall positive score.\nPete Hammond of Deadline Hollywood said, \"Corbin is firmly in control behind the camera and with particular expert help with her editor Chris Witt. The British actor Boyega is superb in every aspect of the role, as is the commanding presence of the late Williams in what, sadly, is his final film role.\"\nWriting for Variety, Peter Debruge said, \"This is not an act of documentary reenactment so much as a tense, speculative drama, imagining what this man must have gone through during those hours, and how his actions rippled out to affect others' lives.\"\nAccolades\n* 2022 Sundance Film Festival: Special Jury Award for Ensemble Cast in the U.S. Dramatic Competition.\nReferences\nExternal links\n*"
    }
  ]
}