{
  "content": [
    {
      "type": "text",
      "text": "# Breaking Barriers 50km\n\nof the race course\n| date          = February or March\n| location      = Gqeberha, South Africa\n| type          = Road\n| iaaf_category =\n| distance      = 50K ultramarathon\n| sponsor       = Nedbank\n| beneficiary   =\n| est           =\n| record        =\nTete Dijana\n| 3:00:30 (2023) (women)\n|  Emane Seifu Hayile\n}}\n| homepage      = [https://www.nedbankrunningclub.co.za/DisplayLink.aspx?group=About%20Us&name=Nedbank%20Runified%2050km About Us Nedbank Runified 50km]\n| participants  =\n| 48   finishers (2022)\n}}\n}}\nThe Breaking Barriers 50km (also known as the Nedbank Runified Breaking Barriers 50km for sponsorship reasons) is an annual road-based ultramarathon hosted by Gqeberha, South Africa, since 2021.  The ultramarathon is a World Athletics Elite Label Road Race.  As of the 2023 race, a new 50K world record has been set every year the race has been held.\nHistory\nThe inaugural race was held on Sunday .  The 50K was won by Ethiopian runner Ketema Negasa and South African runner Irvette van Zyl, with finish times of 2:42:07 and 3:04:24, respectively.  Negasa set the 50K world record for men, while van Zyl set the 50K world record for women in a women-only race.\nOn , the second running of the race, South African runner Stephen Mokoka broke the world record with a finish time of 2:40:13 in his 50K debut, while Ethiopian runner Amelework Fekadu, with her winning time of 3:04:58, missed breaking the record van Zyl set the previous year by about half a minute.\nThe third running of the race was held on .  Ethiopian runner Emane Seifu Hayile set a new 50K world record for a women-only race with her finish time of 3:00:30, beating van Zyl's time by nearly four minutes.  South African runner Tete Dijana, winner of the 2022 Comrades Marathon, also set a new course record, and a new South African 50K record, with his winning time of 2:39:04. while others noted that U.S. runner CJ Albertson had run a faster 50K a few months earlier, with a finish time of 2:38:43 at the Ruth Anderson Memorial Endurance Run in San Francisco, California, although Albertson's time had yet to be ratified as a world record.}}\nCourse\n}}\nThe ultramarathon is run on a loop course along the M4 freeway in Gqeberha on Marine Drive and Beach Road.  The course runs largely along the coast.  The loop is  long and is run five times.\nThe race begins and ends in front of the Piet Retief Monument in Summerstrand, near Pollock Beach.  Runners first head southeast along Marine Drive for about  before turning around.  The course then heads northwest for about , reaching another turnaround point on Beach Road.  Runners then head back southeast to the starting point for the final  of the loop.\nWinners\nKey: Course record (in bold)\n{| class=\"wikitable sortable\"\n|-\n! class=\"unsortable\" | Ed.\n! Date\n! Male Winner\n! Time\n! Female Winner\n! Time\n! class=\"unsortable\" | Rf.\n|-\n| align=\"center\" | 1\n| 2021.05.23\n|\n| 2:42:07&nbsp;\n|\n| 3:04:24&nbsp;\n|\n|-\n| align=\"center\" | 2\n| 2022.03.06\n| }}\n| 2:40:13&nbsp;\n|\n| 3:04:58\n|\n|-\n| align=\"center\" | 3\n| 2023.02.26\n|\n| bgcolor=\"#CCFFCC\" | 2:39:04&nbsp;\n| }}\n| bgcolor=\"#CCFFCC\" | 3:00:30&nbsp;\n|\n|}\nNotes\nReferences\n}}\nExternal links\n* [https://www.nedbankrunningclub.co.za/DisplayLink.aspx?group=About%20Us&name=Nedbank%20Runified%2050km Official website]"
    }
  ]
}