{
  "content": [
    {
      "type": "text",
      "text": "# Breaking Point (1963 TV series)\n\n| last_aired           =\n| related              = Ben CaseyThe Eleventh Hour\n}}\nBreaking Point is an American medical drama that aired on ABC from September 16, 1963, to April 27, 1964, with reruns continuing until September 7, 1964. The series, which was a spin-off of Ben Casey, starred Paul Richards and Eduard Franz. The series was created by Meta Rosenberg.\nBackground\nThe NBC drama The Eleventh Hour was the inspiration for creation of Breaking Point, the characters of which were first seen on the September 9, 1963, episode of Ben Casey. Following that development, Ben Casey moved to Wednesday nights, and Breaking Point took its Monday night slot.\nProducer George Lefferts was partially inspired to create Breaking Point on the back of the success of an earlier show that also dealt with mental health issues, Special for Women.\nSynopsis\nRichards starred as Dr. McKinley Thompson (known as \"Dr. Mac\" to most of the staff), resident in psychiatry at York Hospital in Los Angeles. Franz co-starred as Dr. Edward Raymer, the hospital's psychiatric clinical director. Episodes focused more on problems of people who sought help at the clinic than on activities at the clinic.\nGuest stars\n* Bettye Ackerman\n* Martin Balsam\n* Shelley Berman\n* James Callahan\n* Michael Callan\n* John Cassavetes\n* Dabney Coleman\n* Rosemary DeCamp\n* James Daly\n* Bradford Dillman\n* Dianne Foster\n* Anthony Franciosa\n* Clint Howard\n* Lillian Gish\n* Virginia Gregg\n* James Gregory\n* Susan Harrison\n* Mariette Hartley\n* Joey Heatherton\n* Kim Hunter\n* Russell Johnson\n* Piper Laurie\n* Carol Lawrence\n* John Larkin\n* Barry Livingston\n* Robert Loggia\n* Scott Marlowe\n* Kevin McCarthy\n* Ralph Meeker\n* Burgess Meredith\n* Alan Napier\n* Kathleen Nolan\n* Sheree North\n* Edmond O'Brien\n* Arthur O'Connell\n* Jack Oakie\n* Eleanor Parker\n* Walter Pidgeon\n* Robert Redford\n* Hari Rhodes\n* Mark Richman\n* Cliff Robertson\n* Ruth Roman\n* Gena Rowlands\n* Robert Ryan\n* Telly Savalas\n* Vito Scotti\n* Jan Sterling\n* Susan Strasberg\n* Rip Torn\n* Jack Warden\nEpisodes\n| ShortSummary = A musician (Scott Marlowe) is disturbed by the conflict between  his cruelly authoritarian father (Oscar Homolka) and himself. A continuation of a two-part story that began on the Ben Casey episode \"For This Relief, Much Thanks\" (September 9, 1963), it guest-starred Vincent Edwards as Ben Casey, Russell Johnson, Dabney Coleman, Millie Perkins, and Sheree North.\n| LineColor = B11030\n}}\n| ShortSummary = A psychiatric patient (Anthony Franciosa) tries to keep his treatment secret when he returns to teaching. It also guest-starred Ed Asner and Brenda Scott.\n| LineColor = B11030\n}}\n| ShortSummary = An unhinged executive's wife (Janice Rule) seeks psychiatric help due to an avalanche of problems, including a disengaging husband and oppressive mother-in-law. It also guest-starred Kevin McCarthy and Irene Tedrow.\n| LineColor = B11030\n}}\n| ShortSummary = A disruptive group-therapy patient preys on the group to vent his hostility toward others. It also guest-starred  Robert Redford, Jack Weston, and Marisa Pavan.\n| LineColor = B11030\n}}\n| ShortSummary = A young couple (John Cassavetes and Carol Lawrence) express their rebellion through a suicide pact. It also guest-starred  J. Pat O'Malley, Virginia Gregg, Woodrow Parfrey, and Gilbert Green.\n| LineColor = B11030\n}}\n| ShortSummary = A shy, young construction worker (Lou Antonio) is troubled by his inability to engage in \"manly\" activities, and fears he may be a homosexual. It also guest-starred  Ralph Meeker, Mariette Hartley, Cece Whitney, and Carmen Phillips.\n| LineColor = B11030\n}}\n| ShortSummary = A senatorial candidate's (Mark Richman) chances for higher office are threatened by the emotional breakdown of his wife (Kim Hunter). It also guest-starred  Paul Stewart and Holly McIntire.\n| LineColor = B11030\n}}\n| ShortSummary = A rabbi (Martin Balsam) loses his faith following the accidental death of his only son. It also guest-starred  Akim Tamiroff, Noam Pitlik, Barbara Turner, Virginia Capers, and Zolya Talma.\n| LineColor = B11030\n}}\n| ShortSummary = An autistic child (Eddie Rossen) is aided by a therapist (Martine Bartlett), who seeks the key to communicating with him. It also guest-starred  Harold J. Stone, Marsha Hunt, Michael Fox, Marcia Dealy, and Donald Losby.\n| LineColor = B11030\n}}\n| ShortSummary = A frustrated salesman (Shelley Berman) is accused of attempted assault, and Dr. Thompson goes on trial for refusing to release his case history to the court. It also guest-starred  Joe Maross, Malachi Throne, Sarah Marshall, Joanna Frank, Harry Bartell, Hari Rhodes, Suzy Carnell, and Doreen Lang.\n| LineColor = B11030\n}}\n| ShortSummary = A fan-club founder attempts to live vicariously through a fading film star (Ruth Roman). It also guest-starred  Terry Becker, Sondra Blake, Hunt Powers, and Sylvia Lewis.\n| LineColor = B11030\n}}\n| ShortSummary = A psychiatric ward attendant (Rip Torn), who is impersonating a doctor, seeks the help of Dr. Thompson after he makes an enemy of a veteran nurse (Jan Sterling).\n| LineColor = B11030\n}}\n| ShortSummary = An aging actress (Lillian Gish) refuses to accept the death of her witty, nonconformist husband (Walter Pidgeon). It also guest-starred  Vito Scotti and Clint Howard.\n| LineColor = B11030\n}}\n| ShortSummary = A narcissistic model (Gena Rowlands) sees her marriage collapse due to her possessive father (Burgess Meredith), who tries to manage both her career and life. It also guest-starred  John Milford, Mary Gregory, Gloria Calomee, and Russ Bender.\n| LineColor = B11030\n}}\n| ShortSummary = A prison inmate (Sheree North) participates as a substitute mother to a difficult child in one of Dr. Thompson's rehabilitation experiments. It also guest-starred  Robert Ellenstein, Cece Whitney, Doris Dowling, and Maidie Norman.\n| LineColor = B11030\n}}\n| ShortSummary = A retired barber (Arthur O'Connell) needs a reason to live, and a warm-hearted widow (Rosemary De Camp) gives him such a reason. It also guest-starred Amanda Ames, Dean Harens, Helen Kleeb, Richard Bull, and Ralph Manza.\n| LineColor = B11030\n}}\n| OriginalAirDate =\n| ShortSummary = A World War II veteran (James Daly) involved in the bombing of Hiroshima, who married a Japanese woman from the city, is plagued by guilt over his past actions. It also guest-starred  Irene Tsu, Nobu McCarthy, Richard Webb, and Yasuko.\n| LineColor = B11030\n}}\n| OriginalAirDate =\n| ShortSummary = An author (Robert Ryan) with writer's block develops an imaginary physical paralysis, causing his wife (Bettye Ackerman) to fear he will attempt suicide. It also guest-starred  John Larkin.\n| LineColor = B11030\n}}\n| ShortSummary = A fashion designer (Eleanor Parker) compulsively seeks out liaisons with strange men, then sets her sights on seducing Dr. Thompson. It also guest-starred  Robert Brubaker and Barry Livingston.\n| LineColor = B11030\n}}\n| ShortSummary = An Italian baker (Jack Warden) suffers guilt from his early days as an immigrant affiliated with gangsters. It also guest-starred  Johnny Seven and Mariette Hartley.\n| LineColor = B11030\n}}\n| OriginalAirDate =\n| ShortSummary = A philandering publisher (Cliff Robertson) runs into trouble with his boss and attempts to reconnect with his long-suffering wife. It also guest-starred  Alan Napier, Ilse Taurins, Mari Blanchard, Bobby Byles, and Barbara Wilkin.\n| LineColor = B11030\n}}\n| ShortSummary = A young trapeze artist (Susan Strasberg) is mysteriously unable to walk following her famous father's accidental plunge to his death. It also guest-starred  Cesare Danova, Fabrizio Mioni, and James Callahan.\n| LineColor = B11030\n}}\n| ShortSummary = A widower's (Edmond O'Brien) only child (Lori Martin) goes into shock after being attacked by an intruder. It also guest-starred  Regina Gleason, Herb Armstrong, Patricia Newby, Don Kennedy, Walter Brooke, and Edward Platt.\n| LineColor = B11030\n}}\n| ShortSummary = A patient (Piper Laurie) becomes catatonic after a shattering experience brings all her childhood fears into focus. It also guest-starred  Robert Loggia, Pamelyn Ferdin, and Phyllis Love.\n| LineColor = B11030\n}}\n| ShortSummary = A doctor (Bradford Dillman), who is blinded in an automobile accident, is determined to resume his career with the aid of a guide dog. It also guest-starred  Dianne Foster, Charles Robinson, Don Hanmer, and Dan Tobin.\n| LineColor = B11030\n}}\n| ShortSummary = A perfectionist (Jessica Tandy) attempts suicide due to midlife anxieties, which belie her seemingly ideal marriage. It also guest-starred  James Gregory.\n| LineColor = B11030\n}}\n| ShortSummary = A boxer (Terry Carter) insists he was knocked out by a hard punch despite the evidence of the boxing commission that he threw the fight. It also guest-starred  Frederick O'Neal, Paul Birch, Joel Fluellen, Diana Sands, Rex Ingram, and S. John Launer.\n| LineColor = B11030\n}}\n| ShortSummary = An extremely bright, but unadoptable child (Jennifer Gillespie) shares secrets with an imaginary \"Gypsy Man\", which piques the interest of her co-therapist (Kathleen Nolan). It also guest-starred  Peter Leeds, Richard Devon, Virginia Gregg, Dennis Rush, Alice Backes, and Grace Lenard.\n| LineColor = B11030\n}}\n| ShortSummary = A jazz ballet star (Joey Heatherton) and the head of a dance school David Winters find their marriage threatened by a false philosophy. It also guest-starred  Michael Callan.\n| LineColor = B11030\n}}\n| ShortSummary = A loan shark (Telly Savalas) is suddenly marked by stigmata to the consternation of his priest. It also guest-starred  Henry Silva, Arline Sax, and Marian Seldes.\n| LineColor = B11030\n}}\n}}\nProduction\nBreaking Point was produced by Bing Crosby Productions. George Lefferts was the producer, with Sydney Pollack as the director. Lefferts and Allan Sloane were the writers. It was broadcast on Mondays from 10 to 11 p.m. Eastern Time. Its competition included East Side West Side on CBS and Sing Along with Mitch on NBC.\nAward nomination\nSloane was nominated for an Emmy Award for \"Outstanding Writing Achievement in Drama\".\nReferences\nExternal links\n*"
    }
  ]
}