{
  "content": [
    {
      "type": "text",
      "text": "# Breaking Home Ties (film)\n\n| runtime =60 minutes\n| country = United States\n| language = Silent  English intertitles\n| budget =\n| gross =\n}}\nBreaking Home Ties is a 1922 American silent drama film directed by George K. Rolands and Frank N. Seltzer and starring Lee Kohlmar, Rebecca Weintraub and Jane Thomas. It centers on Russian Jewish immigrants in Manhattan's Lower East Side.\nThe film was believed to be lost, before being rediscovered in Berlin in an archive in the 1980s. The National Center for Jewish Film led the digital restoration of the film over the ensuing decades.\nThe restored version of the film, with its newly commissioned score, premiered at the New York Jewish Film Festival on 19 January 2025.\nBackground\nDirector Frank N. Seltzer was motivated to direct a film to counter rising levels of antisemitism fuelled by Henry Ford and the Ku Klux Klan. The film has Jews as central characters, and they are presented in a normative way, with their faith and practice respectfully depicted.\nPlot\nDavid Bergmann is a young Russian Jew who flees to America after an unfortunate incident. He arrives in New York City on the Lower East Side, where his university education in St. Petersburg enables him to become a successful lawyer.\nDavid's parents and younger sister, who immigrate separately to New York from Russia, face more hardships. They struggle to find their son, who has changed his surname to Berg. David's father makes a meager income as a street vendor, and he and his aging wife cannot afford lodgings in a Jewish Aged Care Home. The film then focuses on the efforts of David and his family to find one another.\nCast\n* Lee Kohlmar as Father Bergman\n* Rebecca Weintraub as \tMother Bergman\n* Richard Farrell as David Bergman\n* Arthur Ashley as Paul Zeidman\n* Betty Howe as Esther\n* Jane Thomas as Rose Neuman\n* Henry B. Schaffer as J. B. Martin\n* Maude Hill as Mrs. Martin\n* Robert Maximillian as Moskowitz\nRelease\nThe film originally premiered at the Hotel Astor in New York City in 1922.\nReferences\nBibliography\n* Munden, Kenneth White. The American Film Institute Catalog of Motion Pictures Produced in the United States, Part 1. University of California Press, 1997.\nExternal links\n*"
    }
  ]
}