{
  "content": [
    {
      "type": "text",
      "text": "# Bremer River (Queensland)\n\n| map                =\n| map_size           =\n| map_caption        =\n| pushpin_map        = Australia Queensland\n| pushpin_map_size   =\n| pushpin_map_caption= Location of Bremer River river mouth in Queensland\n| subdivision_type1  = Country\n| subdivision_name1  = Australia\n| subdivision_type2  = State\n| subdivision_name2  = Queensland\n| subdivision_type3  = Region\n| subdivision_name3  = Scenic Rim, South East Queensland\n| subdivision_type4  =\n| subdivision_name4  =\n| subdivision_type5  = Cities\n| subdivision_name5  = , Brisbane\n| length             =\n| width_min          =\n| width_avg          =\n| width_max          =\n| depth_min          =\n| depth_avg          =\n| depth_max          =\n| discharge1_location=\n| discharge1_min     =\n| discharge1_avg     =\n| discharge1_max     =\n| source1            = Scenic Rim\n| source1_location   = Main Range National Park\n| source1_coordinates=\n| source1_elevation  =\n| mouth              = confluence with the Brisbane River\n| mouth_location     =\n| mouth_coordinates  =\n| mouth_elevation    =\n| progression        =\n| river_system       = Brisbane River catchment\n| basin_size         =\n| tributaries_left   = Western Creek, Franklin Vale Creek\n| tributaries_right  = Warrill Creek, Reynold Creek, Purga Creek, Deebing Creek, Bundamba Creek\n| custom_label       = National park\n| custom_data        = Main Range National Park\n| extra              =\n}}\nThe Bremer River is a river that is a tributary of the Brisbane River, located in the Scenic Rim and Brisbane regions of South East Queensland, Australia. The -long Bremer River drains several Scenic Rim valleys in south-east Queensland,  including the Fassifern Valley, with its catchment area covering approximately . Most valleys within the catchment have extensive river terraces. The Bremer River system is extremely degraded.\nEuropean explorers John Oxley and Allan Cunningham visited the river in 1824 and it was first named by Oxley as '''Bremer's Creek''' presumably after Captain Gordon Bremer who was in charge of , at that time performing duties in the waters of the colony of New South Wales.\nCourse and features\n, 2011]]\nThe Bremer rises in the hills of the Scenic Rim, passes close to the town of Rosewood and winds through the city of Ipswich. The catchment area is bordered by the Little Liverpool Range to the west, with the Main Range lying to the south and south-west. Towards the east is Flinders Peak and the Flinders Peak Group. The river has a number of tributaries including Deebing Creek, Bundamba Creek, Purga Creek, Reynolds Creek, Warrill Creek, Western Creek and Franklin Vale Creek. The town of Grandchester is situated on Western Creek and Rosevale was settled on the upper reaches. Its length is about .\nHistory\nThe Bremer River was known as Urarrar meaning red stemmed gum trees in Yugararpul language.\nThe first sighting of the Bremer River by Europeans was made by John Oxley and Allan Cunningham on 19 September 1824 as they explored the Brisbane River. On their return journey six days later the exploration party camped on the opposite side of the river where the tributary entered the main stream. Shortly after Oxley began to refer to the tributary as the Bremer River but didn't specify from who the name was derived from. It has been assumed to be named in honour of Gordon Bremer, a naval officer on HMS Tamar. No attempt to explore the Bremer was made at this time. Edmund Lockyer passed through the area in 1825, noting the junction of the Bremer, referring to it as Bremer's Creek but he did not explore it. The first European to travel along the river was Captain Patrick Logan who in either late 1826 or early 1827 investigated the Bremer.  He discovered deposits of limestone at the site of what was to become Ipswich.  Upstream from there the river became shallow and rocky, so Logan did not explore further.\nThe upper reaches of the river were explored by Alan Cunningham in 1828 while he was searching for a route to the Darling Downs. Cunningham made measurements and produced a map which he sent to Governor Darling.\nThe first steam vessel on the river was the Experiment on 18 June 1846 after spending the night stranded on a mud band at Goodna.\nIn 1863 an immigration depot was built on the north bank of the Bremer, after residents of Ipswich petitioned for a depot to alleviate a shortage of labour.  Immigrants were brought to Ipswich by paddle steamer.  The depot was sometimes overcrowded and continued to operate until 1900.\nBefore the railway line from Ipswich to Brisbane was completed in 1875, the river served as an important navigation route between the two towns.\nThe Bremer Catchment Association was established in 1995. The group engages small community groups in projects such as weed control and tree planting.\nDegradation\n, 2015]]\nIndustrial waste has flowed into the river soon after the catchment was settled. Photos from 1870 show the riverbanks cleared of vegetation.  This may have been from the cutting of timber or because an engineer had encouraged the clearing of trees close to the river because when they fell into the river they dragged earth with them, creating an obstacle for steamers in an already narrow channel.\nThe slow-flowing river system is known to flood and is considered to be heavily polluted, suffering from poor water quality. The Bremer as a river suffers from low flows in drought conditions and outflow constrictions from the tidal , which means water and contaminants have a high residency period catchment and only really flush in high flows or floods. This results in poor water quality with high levels of turbidity, high nutrient levels and high levels of bacteria, especially where sewage and drain runoff from the city of Ipswich is discharged into the river.\nCoordinated attempts to improve water quality began after the establishment of the Water Quality Council in 1973.  Testing revealed the worst pollution came from woollen mills and meatworks at Dinmore, where organic waste entered the river untreated.\nLand degradation was identified as a serious problem in the catchment after a Department of Primary Industries survey was conducted in 1979. Riparian vegetation has been nearly completely removed and the banks are now weed-infested. Downstream the river suffers from not only sewage and farming runoff but also abattoir effluent.\nIn 2006, 2008, 2009, 2010, 2011 and 2012 the Healthy Waterways annual assessment of water quality rated the Bremer River an F, the lowest grading possible. The Ipswich City Council has responded by increasing fines for allowing pollutants to contaminate the river.  In 2013 and 2014 the Bremer River's water quality rating improved slightly to a D−. The 2015 the Healthy Waterways assessment included additional measures in the environmental grades, resulting in grades that are not directly comparable to previous years.  The Bremer River was given a D− for 2015.\nHeavy metals including mercury, chromium, nickel and cadmium were found in Warrill Creek, a tributary of the Bremer, in 2009. The source of the contamination was discharge from the RAAF Base Amberley. The contaminates did not reach the Bremer River itself. In 2010, the Ipswich City Council and the International Riverfoundation launched a fund to help clean up the river.\nThe worst pest species was the introduced water hyacinth, which sometimes was so dense it blocked boats. Severe outbreaks occurred in 1917, 1935&mdash;36, 1941 and 1965.\nWater supply\nMoogerah Dam was built in the upper reaches of Reynolds Creek. The dam provides potable water for towns such as Boonah and is an irrigation source for crop farmers and those grazing cattle.\nSee also\n*\nReferences\nFurther reading\n*\n*\nExternal links\n*[https://web.archive.org/web/20120416054027/http://www.derm.qld.gov.au/science/state_of_rivers/bremer.html State of the River Report]\n* Available online: [http://www.ipswich.qld.gov.au/__data/assets/pdf_file/0019/7444/scholarship_report_5_bremer_river_part_1.pdf Part 1] ([https://web.archive.org/web/20170731141410/http://www.ipswich.qld.gov.au/__data/assets/pdf_file/0019/7444/scholarship_report_5_bremer_river_part_1.pdf archived]), [http://www.ipswich.qld.gov.au/__data/assets/pdf_file/0008/9746/scholarship_report_5_bremer_river_part_2.pdf Part 2] ([https://web.archive.org/web/20170731141631/http://www.ipswich.qld.gov.au/__data/assets/pdf_file/0008/9746/scholarship_report_5_bremer_river_part_2.pdf archived]), [http://www.ipswich.qld.gov.au/__data/assets/pdf_file/0017/8216/scholarship_report_5_bremer_river-part_3.pdf Part 3] ([https://web.archive.org/web/20170731141722/http://www.ipswich.qld.gov.au/__data/assets/pdf_file/0017/8216/scholarship_report_5_bremer_river-part_3.pdf archived])"
    }
  ]
}