{
  "content": [
    {
      "type": "text",
      "text": "# Brian Moore 2008 presidential campaign\n\nThe 2008 presidential campaign of Brian Patrick Moore, a local activist from Florida, began when he announced his candidacy for the presidency of the United States in St. Louis, Missouri, on October 19, 2007. The same month he was declared the nominee of the Socialist Party USA for the 2008 presidential election. The SPUSA national convention elected Stewart Alexis Alexander of California as Moore's vice presidential nominee.\nDuring his campaign, Moore focused on the American-led wars abroad, labor rights and community ownership of corporations. Throughout his campaign Moore failed to gather much support in the states he had access to, and ended in 11th place overall, receiving 6,555 votes nationwide. Moore was not able to increase the party's voter base, and instead, it lowered itself from 10 to 6 thousand votes nationwide from the previous presidential election. Moore's campaign raised $9,516.\nWhile minor, Moore managed to earn much needed media interest in the later part of the election mostly due to John McCain's red baiting against Barack Obama and making an appeal to the 5th US Circuit Court to get ballot access in the state of Louisiana. His media campaign included writing articles in several leading newspapers such as The New Republic and the National Journal and making appearances on television, most notably The Colbert Report.\nChronicle\nCampaign developments\nOn October 19, 2007, the Socialist Party USA held their national convention in St. Louis, Missouri. Brian Moore was voted the party's presidential candidate, with four out of 11 opponents earning fewer votes than him combined.  He earned the majority during the third election round. Later, Stewart Alexander was selected by the party as Moore's Vice Presidential candidate. A week later, Moore stood as a candidate for the Peace and Freedom Party, against Ralph Nader, Gloria La Riva, and Cynthia McKinney. Nader became the presidential candidate for the Peace and Freedom Party,  Moore then stood as a candidate for the Natural Law Party in Michigan, where he was again defeated by Nader. Moore won the nomination of the Natural Law Party of Mississippi.\nAfter not completing the necessary paperwork in time to field candidates in the state of Louisiana, the Socialist Party USA along with the Libertarian Party lost their respective privileges to field write-in candidates and party affiliated candidates in the state. Mark R. Brown of the Libertarian Party, along with Moore, made an appeal. The 5th US Circuit Court overturned US District Judge James Brady's order to include the Libertarian candidate on the Louisiana ballot, but upheld their ruling towards the Socialist Party USA, concluding that they had \"filed too little, too late\". Another reason is that the Socialist Party USA is an \"un-recognized\" organization according to the law of the state of Louisiana.\nThis election marked the first time since the days of the Socialist Party of America, that a socialist candidate was on a ballot in the state of Ohio. Following legal challenges, US District Court Judge Edmund Sargus ordered Moore's name placed on the Ohio ballot. During their presidential campaign, the party earned little funding from supporters, with Moore remarking that the only candidates able or having a slim chance to win were \"millionaires, or sellouts to corporate America\". He further commented that it would be impossible for a third-party candidate to win an election without ballot access in all fifty states. While highly vocal that he did not even have a slim chance of winning, he believed there would be a good chance of getting on the ballot in at least 20 states, because of the 2008 financial crisis.\nResults\nMoore ended in 11th place overall, receiving 6,555 votes nationwide out of over 125 million cast. He thus missed, by a large margin, the 5 percent needed to qualify the Socialist Party USA for federally distributed public funding in the next election. His best showings were in Tennessee, where he received 1,326 votes out of over 2 million votes cast, and in Ohio, where he managed to receive 2,731 votes. His weakest showings were in Kentucky and Minnesota, where he managed to gain 7 votes in each state. Moore was not able to enlarge the party's voter base, but instead the voter base shrunk by over 4 thousand votes nationwide from the previous election fronted by Walt Brown.\nPosition and beliefs\nBeing a former member of the Democratic Party, Brian Moore said he moved to socialism because the system wasn't as bad as it was made out to be, further stating that it was \"mixed up with McCarthy and Stalin and the Red Scare\". He ended his thoughts on the matter by clearly stating that socialism wasn't communism. He has also noted that even before joining the Socialist Party, he \"always promoted a national socialized health plan, antiwar, favored a guaranteed annual income, advocated worker control and elimination of corporate control.\" Moore has stated at various times that he promoted a platform to inform Americans of an alternative option in American politics. He believes that capitalism was a selfish system which focused on the wealthy and not the weak and the poor. Moore felt that \"capitalism is an economic system where decisions are made at the top and come down in a dictatorial fashion\" He felt that redistributing the wealth between the rich and the poor would give the United States a stronger public sector, which would in turn focus more on renewable energy and the needy. During his presidential campaign he claimed that the current economic system was falling apart because of capitalist greed. Moore guaranteed an income of \"approximately $10,000 per family a year and decent housing for all families\". He also called for the \"elimination of exorbitant executive salaries, outsourcing of jobs and companies, and calls for an end to for-profit corporations\". When asked what made socialism better than capitalism, Moore said;\nMoore has publicly criticized claims that Barack Obama is a socialist, saying he is offended by this characterization.  According to the weekly periodical, The Nation, Moore said Obama along with John McCain was \"bought and sold\" by Wall Street, saying that the two major candidates cannot change their opinion, since they are both \"imprisoned\" by the \"corporate machine\".\nMoore was against the wars in Iraq and Afghanistan, and supported free and accessible health insurance for all. He also wanted to transfer ownership of corporations to the workers. When discussing the war on terror, Moore felt it was destroying small communities throughout the country with higher taxes and more pressure on the local governments. Moore and vice presidential candidate Stewart Alexander supported a 50% reduction of the United States Department of Defense spending, and using the other 50% to improve veteran benefits. Alexander proposed that retired veterans with 10–30 years of military service should receive an income of $15–30 thousand annually from the state.\nMedia campaign\nMoore along with America First chairman Jonathan M. Hill appeared on Al Jazeera English, discussing strategic development plans for third parties in the United States. The broadcast was viewed by over 100 million viewers worldwide. He also made two appearances on Fox News, first on the TV special The Rescue Rumble and later on Your World, both shows were hosted by Neil Cavuto. He later appeared as a guest on the Comedy Central TV series The Colbert Report, a news satire show about modern American politics. According to Moore, the decision to have him on the show came from Stephen Colbert, the current host for the TV series. A spokeswoman from Comedy Central would not comment on the motives behind the selection. Moore also wrote several articles in The Nation, The New Republic and National Journal, and the newspapers St. Petersburg Times, the Los Angeles Times and the Chicago Tribune. The question of whether or not Barack Obama was a socialist, led to an increased interest in Moore during the election. The Left Party, a Swedish democratic socialist political party, officially endorsed Moore for president during a televised debate in Sweden.\nReferences\nExternal links\n* [https://web.archive.org/web/20071213102604/http://www.votebrianmoore.com/ Campaign site]"
    }
  ]
}