{
  "content": [
    {
      "type": "text",
      "text": "# Brian King (politician)\n\n|birth_place   =\n|death_date    =\n|death_place   =\n|party         = Democratic\n|spouse        = Ann Silverberg (2022–present)\n|children      = 4\n|education     = University of Utah (BS, JD)\n|website       =\n}}\nBrian Smith King (born August 19, 1959) is an American politician who has served as the chair of the Utah Democratic Party since 2025. He served as a Democratic member of the Utah House of Representatives from the 23rd district. Before redistricting following the 2020 census, he represented the 28th district since January 1, 2009. In April 2024, he became the Democratic nominee for gubernatorial election, running against Republican incumbent Spencer Cox.\nEducation\nKing earned a Bachelor of Science degree in economics from the University of Utah and a Juris Doctor from the S.J. Quinney College of Law.\nCareer\nPrior to and concurrent with his legislative service, King practiced law as a self-employed attorney with a specialization in civil litigation under the Employee Retirement Income Security Act (ERISA) and the Mental Health Parity and Addiction Equity Act (MHPAEA). He has spoken prominently on the positive benefits of residential treatment centers in addressing mental health problem in youth.\nKing served as president of the Utah Association for Justice (formerly the Utah Trial Lawyers Association), a professional organization representing civil trial attorneys in the state.\nUtah Legislature\nIn 2008, when Representative Roz McGee left the Legislature and left the seat open, King was unopposed after an opponent withdrew, and won the three-way November 4, 2008 general election with 8,487 votes (56.2%) against Republican nominee Jeffrey Morrow and Constitution candidate Jared Beck, who had run for Utah State Senate in 2006.\nHouse minority leader\nKing had the reputation as being \"more combative\" than previous minority leaders in the State House of Representatives. In 2016, King criticized Republican leadership of the House for \"shut(ing) out Democrats from discussions about whether to expand Medicaid for the poor.\" He was succeeded in 2023 by Angela Romero.\nCommittee assignments\nDuring the 2016 legislative session, King served on the Executive Appropriations Committee, the Executive Offices and Criminal Justice Appropriations Subcommittee, the House Judiciary Committee, the House Revenue and Taxation Committee, and the House Rules Committee. He also served as the House minority leader. In the 2022 legislative session, King served on the Executive Appropriations Committee, the Federalism Commission, the House Business and Labor Committee, the House Judiciary Committee, the House Legislative Expense Oversight Committee, the Legislative Audit Subcommittee, the Legislative Management Committee, Natural Resources, Agriculture, and Environmental Quality Appropriations Subcommittee, and the Subcommittee on Oversight.\nGun policy\nThroughout his career, King has sponsored gun control legislation. In 2019, King sponsored HB 148, \"Universal Background Checks for Firearm Purchasers\" that would require background checks for all gun sales, but it was not given a committee vote. In 2020, King sponsored his and it was tabled by the House Law Enforcement and Criminal Justice Committee by an 8–3 vote. In 2022, King sponsored a modified version of the bill previously sponsored, which would require background checks for all non-federal firearms licensees, law enforcement agencies and officers and family members as exceptions. The House Law Enforcement and Criminal Justice Committee rejected the bill on an 8–3 vote.\nChair of the Utah Democratic Party\nOn May 31, 2025, King was elected chair of the Utah Democratic Party, defeating campaign consultant Ben Peck with 52% of the vote.\nElections\n*2020: King was unopposed in the Democratic primary, but faced Republican challenger Carol Hunter in the general election. King won the race with 71.9% of the vote.\n*2018: King was unopposed in the Democratic primary and general election, winning with 16,494 votes (100%).\n*2016: King was unopposed in the Democratic primary and general election.\n*2014: King was unopposed in the Democratic primary and general election, winning with 9,960 votes (100%).\n*2012: King was unopposed for the June 26, 2012 Democratic primary and won the November 6, 2012 general election with 12,530 votes (67.2%) against Republican nominee Rick Raile, who had run for a House seat in 2010.\n*2010: King was unopposed for the June 22, 2010 Democratic primary and won the November 2, 2010 general election with 6,703 votes (59.9%) against Republican nominee James Farley.\nPersonal life\nKing lives in Salt Lake City and has four children.\nHe is a member of the Church of Jesus Christ of Latter-day Saints and served a full-time mission in St. Louis, Missouri.\nReferences\nExternal links\n*[https://www.kingforutah.com/ Campaign website]\n*[https://house.utleg.gov/rep/KINGBS/ Legislative website]  at the Utah State Legislature\n*\n*[http://ballotpedia.org/Brian_King Brian King] at Ballotpedia\n|-\n|-"
    }
  ]
}