{
  "content": [
    {
      "type": "text",
      "text": "# Brian Lewis (historian)\n\nBrian Lewis is a British historian known for his work on the history and sociology of Britain in the period of the 1800s and is recognized for his focus and contributions to the field of homosexuality in post-Victorian and modern England.\nEarly life and education\nBrian Lewis was born and grew up in Blackburn, Lancashire in North-West England. He attended the universities of Oxford and Harvard for his higher education studies before becoming a professor at McGill University.\nAcademic career\nSince graduating with his PhD, Lewis has been professor of history at McGill University in Montreal. Beginning with his first publication The Middlemost and the Milltowns: Bourgeois Culture and Politics in Early Industrial England (Stanford UP, 2001), Lewis has written and edited a number of significant books and essays which have contributed to the overall British history subject area. He is highly regarded for his contributions to the field of queer studies as his research has greatly unveiled and contextualized the history of homosexuality in Britain, notably through his analysis of primary sources such as the Wolfenden Committee papers.\nBrian Lewis is a central figure within McGill University's history department and on a broader scale has become an authority on the subject of the history of modern Britain, with a particular focus on issues of social identity and societal transformation. He is a member of the editorial board of the Journal of the History of Sexuality. In 2023 he was elected vice president of the North American Conference of British Studies.\nProminent work\nLewis has produced and helped bring to life a number of publications, both through original research and authorship as well as through editorial contributions. Lewis' work delves into various facets of British history, often with a particular focus on the historical evolution of social rights and identity and the related cultural dynamics.\nSo Clean: Lord Leverhulme, Soap and Civilization\nIn this research book, Lewis examines the life and impact of William Hesketh Lever, an influential historical figure in the development of contemporary style companies and consumerism. Through the vehicle of an examination of the entrepreneurial achievements of William Hesketh Lever, Lewis also describes the fast-changing changing socio-economic landscape of Victorian era England. This book also touches on colonialism, urban development and labour relations, all through the framework of the corporate practices of the era.\nWolfenden Witnesses: Homosexuality in Postwar Britain\nThis ambitious work collects and heavily annotates a selection of papers from the Wolfenden Committee, a governmental group meant to establish the legal outlines of homosexuality and prostitution in England following the second world war. Through referencing of a wide array of historical testimonies, Lewis also describes and contextualizes the complex cultural attitudes towards homosexuality in the era and ties these attitudes as well as the legal ramifications of the Wolfenden Committee to the ensuing social progression of Britain all the way until current times. This book serves as an important ressource for understanding the recent history of human rights and identity in England and offers context to many of the challenges still faced by the queer community in the 21st century.\nEditorial Work - British Queer History : New Approaches and Perspectives\nLewis served as a lead editor on this collection of essays which delves into British history through the lens of Queer theory. This work re-examines the traditional telling of British history and challenges conventional methods of historiography. This publication works to cover the intersectional nature of queer studies and contributes to widening the perspectives on queer history, thus avoiding a single-voice telling of the historical evolution of the topic. Lewis' editorial contributions to this work help to mitiguate various contentious issues in queer history and add nuance and context to the scholarly discourse.\nLewis is also currently in the process of writing a new research publication called Greek To The Soul in which he explores George Ives' contributions to 19th and 20th-century English social reform and the history of homosexuality in Britain.\nPersonal engagement and advocacy\nIn addition to his academic work, Brian Lewis is actively involved in scholarly mentorship. Notably, he established and instructs a minor concentration in gender, sexuality, feminist, and social justice studies at McGill University.\nReferences"
    }
  ]
}