{
  "content": [
    {
      "type": "text",
      "text": "# Briar (software)\n\n| logo = Briar SVG Logo.svg\n| screenshot =\n| caption =\n| author =\n| developer =\n| released =\n| ver layout = stacked\n| latest release version =\n| date1 =\n| branch2 = GNU/Linux\n| version2 =\n| date2 =\n}}\n| latest preview version =\n| date1 =\n| branch2 = GNU/Linux\n| version2 =\n| date2 =\n}}\n| discontinued =\n| operating_system = Android, Windows, macOS, desktop Linux; support for Linux mobile operating systems in beta\n| size =\n| language =\n| programming language = Java, Kotlin\n| genre = Mesh networking, instant messaging\n| license = GPL-3.0-or-later\n| website =\n| repo =\n}}\nBriar is an open-source software communication technology, intended to provide secure and resilient peer-to-peer communications with no centralized servers and minimal reliance on external infrastructure. Messages can be transmitted through Bluetooth, Wi-Fi, over the internet via Tor or removable storage, such as USB sticks. All communication is end-to-end encrypted. Relevant content is stored in encrypted form on participating devices. Long-term plans for the project include support for distributed applications such as crisis mapping and collaborative document editing.\nThe initial target audience for Briar includes \"activists, journalists and civil society\" with plans to make the system \"simple enough to help anyone keep their data safe.\" As the ability to function in the absence of internet infrastructure may also make the project valuable to disaster response and aid organizations, the developers are working with the Open Humanitarian Initiative and Taarifa. Ultimately, the developers aim to create a system which is \"as simple to use as WhatsApp, as secure as PGP, and that keeps working if somebody breaks the Internet.\" It is possible for an Android device to download Briar from another Android device which already has Briar installed.\nBriar's source code is published as free software and the Android app is distributed under the terms of the GNU GPL-3.0-or-later license, while the desktop version is released under the GNU Affero General Public License. Briar Desktop runs on Windows, macOS and Linux. Briar Desktop will also run on true Linux (non-Android) mobile phones, running operating systems like Manjaro, PureOS and postmarketOS, once it has been adapted to mobile form-factors.\nBriar’s core protocol, threat model, development process, and user experience design began development in 2011 by Michael Rogers and Eleanor Saitta.\nBriar was audited by Cure53 and spoken highly of in a report delivered 20 March 2017, and was recommended to be given a second audit after development completes. As of 2018 the project received $361,100 of funding from the Open Technology Fund.\nBriar uses the Bramble protocol suite (Bramble Handshake Protocol, Bramble QR Code Protocol, Bramble Rendezvous Protocol, Bramble Synchronisation Protocol, Bramble Transport Protocol) that is specifically designed for delay-tolerant networks. As of January 2023, these protocols are not implemented by other messengers; Briar can only talk to Briar.\niOS support\nBriar developers have no plans for providing iOS app.\nSimilar opensource alternative Berty Messenger provides both Android and iOS apps, as well desktop client for common desktop OS.\nSee also\n* Mesh networking\n* Smartphone ad hoc network\n* Specific projects/protocols\n** B.A.T.M.A.N.\n** FireChat (discontinued)\n** Jami (software)\n** Serval Project\n** Tox (protocol)\n** Bridgefy\nReferences\nExternal links\n*"
    }
  ]
}