{
  "content": [
    {
      "type": "text",
      "text": "# Bride of War\n\n| creator            =\n| writer             =\n| director           = Peter Edwards\n| creative_director  =\n| starring           =\n| composer           = Michał Lorenc\n| country            =\n| language           =\n| num_seasons        = 1\n| num_episodes       = 4\n| list_episodes      =\n| executive_producer =\n| producer           = Peter Edwards\n| location           =\n| cinematography     = Ryszard Lenczewski\n| editor             = Glyn Shakeshaft\n| camera             =\n| runtime            = 52 minutes\n| company            =\n| channel            =\n| first_aired        =\n| last_aired         =\n| related            =\n}}\nBride of War (Polish: Wojenna narzeczona) is a 1997 British–Polish biographical war melodrama miniseries directed and produced by Peter Edwards and written by David Joss Buckley and Jacek Kondracki. It was based on the diary of John Elwyn Jones, a soldier of the British Army who served during the Second World War. The miniseries is bilingual in both the English and Polish languages. It premiered on 26 October 1997, and has 4 episodes, each lasting 52 minutes.\nPlot\nIn 1940, John Elwyn Jones (Huw Garmon), a Welsh soldier from the British Army, is captured during the Battle of Dunkirk in the Second World War, and send to the prisoner-of-war camp in eastern Germany. There he meets Polish nurse named Celina Musiał, with whom he falls in love. Together, they attempt to escape.\nCast\n* Huw Garmon as John Elwyn Jones\n* Anna Wójcikiewicz-Bukowska as Celina Musiał\n* Meredith Edwards as the voice of elderly John Elwyn Jones\n* Edyta Olszówka as Stasia\n* Paweł Wilczak as Janek\n* Rhys Richards as Thomas\n* Jan Jankowski as Sven\n* Aleksander Kalinowski as Lis\n* Michał Breitenwald as a Wehrmacht officer\n* Mariusz Czajka as Schmidt\n* Alun ap Brinley as Herbert\n* Jolanta Fraszyńska as Ania\n* Jerzy Łazewski as a French Army soldier\n* Ewa Ziętek as a German woman on train\n* Mirosław Zbrojewicz as a Ukrainian sailor\n* Witold Dębicki as colonel Kowalski\n* Jacek Borkowski as Kowalski's aide-de-camp\n* Jarosław Boberek as a Home Army soldier\n* Edward Żentara as a father\n* Rafał Mohr as a man\n* Sławomir Nowak as a German guard\n* Piotr Grabowski as a police officer\n* Rhian Jones as Irma\n* Anna Kękuś as Lili\n* Glyn Pritchard as Fletcher\n* Iwan Tudor as Williams\n* Merfyn P. Jones as Lershaw\n* Małgorzata Kalamat as Fredka\nProduction\nThe miniseries was based on the diary of John Elwyn Jones, a soldier of the British Army who served during the Second World War. It was filmed and produced in 1997 in Poland and Wales, United Kingdom, by S4C, STI Studio Filmowe, and Telewizja Polska. The series was directed and produced by Peter Edwards and written by David Joss Buckley and Jacek Kondracki. The cinematography was done by Ryszard Lenczewski, music by Michał Lorenc, editing by Glyn Shakeshaft, scenography by Jacek Osadowski, and costumes by Andrzej Szenajch and Renata Własow. It stars Huw Garmon as John Elwyn Jones and Anna Wójcikiewicz-Bukowska as Celinka Musiał. The series premiered on 26 October 1997, and has 4 episodes, each lasting 52 minutes.\nHistorical accuracy\nThe miniseries was based on a diary written by John Elwyn Jones, a soldier who served in the British Army during the Second World War, based on his experiences during the conflict. The miniseries depicted John Elwyn Jones and Celina Musiał getting married in 1943 and within hours of their wedding discovered by German soldiers, and subsequently separated and sent back to the prisoner camps. After escaping the camp, Jones was informed that his wife died in the camp from tuberculosis, and decided to try to escape from Germany. The events happened as such in reality. However, while Jones was indeed informed of her death, Celina actually survived her disease, recovering after Jones had already left. The fact that she survived was only discovered after the premiere of the show when her son provided evidence of her survival. Celina died in 1990 at the age of 69. She never remarried hoping to one day be reunited with her husband. After learning of it, Peter Edwards, the director of Bride of War, planned to rewrite and reshoot the series to include the fact of Celina's survival, however, John Elwyn Jones told him that he was no longer interested in the project.\nReferences"
    }
  ]
}