{
  "content": [
    {
      "type": "text",
      "text": "# British Empire (horse)\n\nBritish Empire (1937&ndash;1960) was a British-bred thoroughbred racehorse and notable sire in Argentina.\nBackground\nBritish Empire was a bay stallion with a blaze and three white socks. He had a deep girth, and a high head carriage and withers.\nBritish Empire was bred by Lord Glanely and foaled in 1937.\nColombo, British Empire's sire, was Champion Two-Year-Old Colt in England, counting among his wins the 2000 Guineas, Craven Stakes, and National Breeders' Produce Stakes. His stud career fell short of his racing career, but he did produce Happy Knight, winner of the 2000 Guineas, Olein, winner of the Coronation Stakes, and Claro, winner of the Irish 2000 Guineas and a notable sire in Argentina.\nBritish Empire's dam Rose of England won the Epsom Oaks. She was a half sister to Coronation Cup winner Winterhalter and Yorkshire Oaks winner Star of England. As a broodmare, she produced St. Leger Stakes winner Chulmleigh, by Singapore, and Newmarket Oaks winner Fairie Queene, by Solario. Rose of England is also the third dam of Fallow, a very important broodmare in Argentina.\nRacing career\nAs a two-year-old, British Empire was unnamed, and thus raced as \"Rose of England colt\".\nBritish Empire debuted in the First Spring Stakes, running greenly to finish second by two lengths. He followed this up with a five length win, an easy three length win in the Chesham Stakes, a five length win in the July Stakes, and a two length win in the Lavant Stakes. He was first across the finish line in the National Breeders' Produce Stakes, three-quarters of a length ahead of Stardust, but was disqualified and placed last.\nBritish Empire's two-year-old season was considered very good, and he was rated co-second on the Free Handicap of 1939 with Stardust. His final results for the year were four wins (and one disqualification from first) in six starts and one second. Lord Glanely considered him a likely future champion and was impressed enough by his performances to bestow the name 'British Empire' upon him prior to his three-year-old season.\nBritish Empire ran once as a three-year-old, finishing last of fourteen in the Craven Stakes. Due to the poor performance and the start of the Second World War, Lord Glanely decided to sell British Empire to Jorge Atucha in Argentina.\nStud career\nBritish Empire entered stud in 1941 in Argentina at Haras El Pelado, where he would stand for his entire career.\nBritish Empire had only four foals in his first crop, including his first winner, Union Jack, who died shortly after passing the finish line.\nBritish Empire was the Champion Sire in Argentina in 1947 and 1954. He also finished second on the general sire list in 1946 and 1949 and third in 1948. He was the Argentine Champion Broodmare sire in 1959 and 1960 and second in 1966.\nBritish Empire is noted to have nicked well with mares by Hunter's Moon.\nIn the Roman-Miller Dosage System, British Empire is considered a Brilliant Chef-de-race.\nBritish Empire died in 1960 at the age of 23 and was buried at Haras El Pelado.\nNotable progeny\n* Endeavour, Argentine Champion Older Horse, winner of the Gran Premio Palermo, Gran Premio Montevideo, Clásico Otoño, Gran Premio General Belgrano, etc.; notable sire\n* Ensueño, Argentine Champion Older Mare, winner of the Clásico Río de la Plata, Clásico Vicente L. Casares, etc.\n* Et Bien!, Argentine Champion Older Mare, winner of the Clásico Old Man twice, Clásico Colombia, etc.\n* Estuardo, Argentine Champion Three-Year-Old Colt, winner of the Gran Premio Jockey Club, Polla de Potrillos, Clásico Santiago Luro, etc.\n* Endless, Chilean Champion Three-Year-Old Filly, winner of the Las Oaks, Clásico Arturo Lyon Peña, etc.\n* Eglantine, Uruguayan Champion Older Mare, winner of the Gran Premio Presidente de la República, Gran Premio Eduardo Vargas, etc.\n* Deming, leading sire in Peru\n* Earshot, Champion Sire in Uruguay in 1966\n* Envion, Argentine Champion Sprinter, winner of the Clásico Adolfo y Rufino Luro, Clásico Maipú, etc.\nNotable progeny of daughters\n* Escorial, Brazilian Triple Crown winner and champion, also winner of the Gran Premio Carlos Pellegrini, Gran Premio 25 de Mayo, etc.\n* Bogotana, winner of the Polla de Potrancas (Chile), Clásico Tanteo de Potrancas, etc.\n* Trousseau, Argentine Champion Two-Year-Old and Three-Year-Old Colt\n* Eutropio, winner of the Gran Premio de Honor and Clásico Chacabuco\n|f=Colombo (GB) 1931|m=Rose of England (GB) 1927|ff=Manna (GB)  1922|fm=Lady Nairne (GB)  1919|mf=Teddy (FR) 1913|mm=Perce-Neige (GB)  1916|fff=Phalaris (GB)|ffm=Waffles (GB)|fmf=Chaucer (GB)|fmm=Lammermuir (GB)|mff=Ajax (FR)|mfm=Rondeau (GB)|mmf=Neil Gow (GB)|mmm=Gallenza (GB)|ffff=Polymelus (GB)|fffm=Bromus (GB)|ffmf=Buckwheat (GB)|ffmm=Lady Mischief (GB)|fmff=St. Simon (GB)|fmfm=Canterbury Pilgrim (GB)|fmmf=Sunstar (GB)|fmmm=Montem (GB)|mfff=Flying Fox (GB)|mffm=Amie (FR)|mfmf=Bay Ronald (GB)|mfmm=Doremi (GB)|mmff=Marco (GB)|mmfm=Chelandry (GB)|mmmf=Gallinule (GB)|mmmm=Excellenza (GB)}}\nReferences"
    }
  ]
}