{
  "content": [
    {
      "type": "text",
      "text": "# British nationality law and the Republic of Ireland__disambig_1\n\nIrish citizens in the United Kingdom enjoy a special status when residing there, due to the close proximity of the island of Great Britain and the island of Ireland and the historical ties between the two islands. Irish citizens from the Republic of Ireland have automatic and permanent permission to live in the United Kingdom and are eligible to vote, stand for public office, and serve in non-reserved government positions; any children born to them in the United Kingdom are British citizens.\nBackground\nSince the Norman invasion of Ireland in the late 12th century, England has been politically and militarily involved on the island. English control was largely restricted to the area around Dublin known as The Pale until 1603, when the entire island was assimilated into the Kingdom of Ireland at the completion of the Tudor conquest. After passage of the Acts of Union 1800, Ireland was merged with the Kingdom of Great Britain to form the United Kingdom of Great Britain and Ireland. Resistance to the Union and desire for local self-governance led to the Irish War of Independence. Following the war, the island of Ireland was partitioned into two parts. Southern Ireland (which included County Donegal in Ulster) became the Irish Free State in December 1922, while Northern Ireland continues to remain part of the United Kingdom.\nPost-independence nationality arrangements\nUnder the terms of the Anglo-Irish Treaty, the Irish Free State remained part of the British Empire as a self-governing Dominion and the King continued to be the Irish head of state. Accordingly, Irish citizens from the Irish Free State remained British subjects under the prevailing theory of the British nationality law that all subjects within the Empire, including Dominions, held a common Imperial status. Holding citizenship within the Dominions had no effect on possession of the wider British nationality. Because the Irish government disputed that its citizens were British subjects and did not describe them as such on Irish passports, the Foreign Office routinely refused consular protection to Irish citizens during this time unless they possessed other passports describing them as British subjects.\nAfter the declaration of the Republic\nDispute over whether Irish citizens were British subjects continued until most of Ireland formally declared itself a republic in 1948. Since April 1949, Irish citizens who were born and raised in the Republic of Ireland have no longer been automatically considered as British subjects (unlike Irish citizens born and raised in Northern Ireland). Individuals born before April 1949 in what is now the Republic of Ireland may make formal claims to retain British subject status, though this nationality cannot be transferred by descent. The United Kingdom recognised the Republic of Ireland's departure from the Commonwealth of Nations and the end of its Dominion status with the Ireland Act 1949. Irish citizens born and raised in the Republic of Ireland continue to enjoy favoured status in the United Kingdom similar to Commonwealth citizens and are not considered aliens.\nThe Ireland Act also re-established British citizenship for Irish citizens who were domiciled outside of the Republic when the British Nationality Act 1948 came into effect. Because that Act contained provisions that dealt with \"a person who was a British subject and citizen of Éire on 31 December 1948\", the conditions laid out in British law determining who became Citizens of the United Kingdom and Colonies (CUKCs) were dependent on who were Irish citizens under the Irish nationality law. When the Irish Free State was established on 6 December 1922, it consisted of the whole of Ireland. Northern Ireland opted out of the Free State on the next day. However, all individuals domiciled on the entire island on 6 December are considered Irish citizens. Consequently, when the BNA 1948 became effective, Irish citizens living in Northern Ireland automatically lost British citizenship, although this was not intended by the Parliament of the United Kingdom. The Ireland Act restored British citizenship to any individual domiciled in Northern Ireland on 6 December 1949 who otherwise would have had the status if not for Irish law.\nThe Ireland Act additionally conferred CUKC status on Irish-born persons who did not receive Irish citizenship at any point prior to 18 April 1949. Individuals who left Ireland before 1922, and who were not resident in 1935, were possibly eligible for registration as Irish citizens while also being able to claim British citizenship. A claim to British citizenship may be established by: birth to the first generation emigrant, consular registration of later generation births by married British citizen fathers within one year of birth prior to 1983, registration of birth to unwed British citizen fathers, or registration of birth to mothers who were considered British citizens between 1949 and 1983. In some cases, British citizenship may be available to these descendants in the Irish diaspora even when Irish citizenship registration is not, as in instances of failure of past generations to timely register in a local Irish consulate's Foreign Births Register before the Irish Nationality and Citizenship Act 1986 and before births of later generations.\nPrior to 1983, anyone born in the United Kingdom other than children of diplomats were automatically British citizens at birth. After the British Nationality Act 1981 took effect, children are only citizens at birth if at least one parent is also a British citizen or considered \"settled\" in the UK. Irish citizens from the Republic of Ireland resident in the United Kingdom are automatically considered \"settled\", and any children born to them in the United Kingdom continue to be British citizens at birth.\nAfter Brexit\nIrish citizens from the Republic of Ireland retained their entitlement to enter, live, and work in the United Kingdom after the end of the Brexit transition period on 31 December 2020. Brexit did not affect the rights and status in the United Kingdom of Irish citizens who were born and raised in Northern Ireland, as these people were automatically also British citizens from birth, as Northern Ireland remained part of the United Kingdom.\nRights and privileges\nIrish citizens from the Republic of Ireland are exempted from obtaining a visa or entry certificate when entering the United Kingdom and do not require approval to live or work there. They are not considered foreign nationals and are entitled to certain rights similar to those of some Commonwealth citizens. These include exemption from voting eligibility in UK (and, formerly, EU) elections, and the ability to enlist in the British Armed Forces. They are also eligible to serve in non-reserved Civil Service posts, be granted British honours, receive peerages, and sit in the House of Lords. Additionally, Irish citizens from the Republic of Ireland may stand for election to the House of Commons and local government.\nIrish citizens from the Republic of Ireland born before 1949 may make formal claims at any time to retain status as British subjects based on: Crown service in the UK, existing passports or certificates of entitlement describing holders as British subjects, or proof of other associations with the UK or any former British territory. British subject status claimed in connection with Ireland additionally grants holders right of abode in the UK, eligibility to serve in reserved government positions, and the right to apply for British passports. While Irish citizens from the Republic of Ireland have no preferred path to citizenship, British subjects may become British citizens by registration, rather than naturalisation. However, both registration and naturalisation have the same residence requirement of five years before individuals may qualify to apply through either process.\nThe passing of the British Nationality (Irish Citizens) Act 2024 introduced a new route for all Irish citizens with five years of residence in the UK to acquire British Nationality via registration, instead of via naturalisation. As this is a registration route, there is no requirement to pass the Life in the UK test or provide any evidence of English language knowledge. The registration fee for Irish Citizens to acquire British Nationality is 50% less than for other nationalities and the \"streamlined application process\" offers reduced administrative complexity.\nReferences\nSources\n*  |ref=}}\n*  |ref=}}"
    }
  ]
}