{
  "content": [
    {
      "type": "text",
      "text": "# British Commonwealth armoured fighting vehicles of World War II\n\nThe British Army made extensive use of a variety of combat vehicles during the Second World War. This article is a summary of those vehicles.\nTankettes\nA tankette is a type of lightly armed and lightly armoured tracked combat vehicle resembling a small tank roughly the size of a car, mainly intended for light infantry support or reconnaissance. Colloquially it may also simply mean a \"small tank\".\n*Carden-Loyd tankette\nMedium tanks\nThese inter-war tanks were built to supply the British Army after the First World War. Heavier than most light tanks, they proved to be under-gunned and under-armoured. Some did see action in France and the Low Countries in 1940. They were armed with either the QF 3 pdr or the Vickers machine gun. All were withdrawn from service by 1941.\n*Vickers Medium Mark I\n*Vickers Medium Mark II\nLight tanks\nThese were a series of similar small tanks produced by Britain in the years between the First and Second World Wars mainly for use in Imperial duties. They saw use in training, and in limited engagements with British Imperial units in colonial policing actions before the war. All were about 5 tonnes, the earlier models had a crew of two and were armed with a 0.303 Vickers machine gun. The later had a crew of three and a heavy machine gun (the 0.50 inch version of the Vickers machine gun or 15mm Besa machine gun) as well as 0.303 or 7.92mm Besa machine gun.\nAlthough some were used in France and North Africa at the start of the war, they were removed as not fit for service in armoured divisions.\n*Light tank Mk I\n*Light tank Mk II\n*Light tank Mk III\n*Light tank Mk IV\n*Light tank Mk V\n*Light tank Mk VI\nThe last of the light tanks were produced during the Second World War. Not considered suitable for use in armoured divisions, they were trialled in airborne operations. All were armed with the QF 2 pdr anti-tank gun.\n*Light tank Mk VIII\n*Light tank Mk VII Tetrarch I\nCruiser tanks\nThese medium-sized cruiser tanks were the mainstay of British armoured units during the war. Weighing 10-35 tonnes, they were fast and mobile, and were designed to operate independently of the slow-moving infantry and their more heavily armoured infantry tank support. They were built specifically to fight a mobile war against other tanks. They were armed with anti-tank guns, from the QF 2 pdr to the QF 17 pdr or the general purpose 75&nbsp;mm.\n*Mk I (A9)\n*Mk II (A10)\n*Mk III (A13)\n*Mk IV (A13 Mk II)\n*Mk V, Covenanter (A13 Mk III)\n*Mk VI Crusader (A15)\n*Mk VII Cavalier (A24)\n*Mk VIII, Cromwell (A27M)\n*Challenger (A30)\n*Comet (A34)\nInfantry tanks\nThe infantry tank was a concept developed by Britain in the years leading up to the war. They generally carried more armour than the cruiser tanks, as they did not need such a high top speed. They were designed to work as close support for the infantry. They were armed with either the QF 2 pdr, QF 6 pdr, or the QF 75 mm.\n*Mk I, Matilda I (A11)\n*Mk II, Matilda II (A12)\n*Mk III, Valentine\n*Mk IV, Churchill (A22)\nSelf-propelled artillery\nSelf-propelled artillery vehicles were a way of enabling the Royal Artillery to function with the same degree of battlefield mobility as conventional tank formations. They were self-propelled guns, usually based on a tank chassis, which were normally used for long-range indirect bombardment support on the battlefield. In contrast to American doctrine, mobile anti-tank weapons were also considered self-propelled guns and were similarly operated by the Royal Artillery.\n*Bishop – 25 pdr gun-howitzer on Valentine tank chassis\n*Deacon – 6 pdr anti-tank gun on armoured truck chassis\n*Archer – a self-propelled anti-tank gun\nArmoured personnel carriers\nArmoured personnel carriers were armoured fighting vehicles developed to transport infantry\n* Universal Carrier\nArmoured cars\nLight and medium scout and reconnaissance vehicles were used by most British Army units, especially battalions of the Reconnaissance Corps and cavalry units. These fast wheeled vehicles usually weighed from 3 to 10 tonnes. Armament ranged from Bren light machine guns (or Boys anti-tank rifle), Besa machine guns, up to QF 2 pdr and 6-pdr guns.\n*AEC armoured car\n*Coventry armoured car\n*Daimler armoured car\n*Guy armoured car\n*Humber armoured car\n*Lanchester armoured car\n*Morris CS9\n*Rolls-Royce armoured car\n*Standard Beaverette\n*Humber light reconnaissance car\n*Morris light reconnaissance car\n*Otter light reconnaissance car\n*Dingo scout car\n*Humber scout car\nOther vehicles\n*Armoured Trucks\n**Armadillo – Home Guard use only\n**Bedford OXA – armoured car for home defence, Home Guard use only\n*Armoured command vehicles\n**AEC armoured command vehicle\n**Guy Lizard\nCommonwealth-produced armoured vehicles\nArmoured vehicles built outside Britain for Commonwealth forces.\n*Tanks\n**Ram tank (Canada) – only used for training; variants saw service\n**Grizzly I – license-built Canadian version of US M4A1 Sherman that never saw combat; production halted due to availability of Lend-Lease Shermans; chassis used for Sexton SPG\n**Sentinel tank (Australia) – never reached service\n**AELT \"Chassis 160\" (Australia) – never reached service\n**Bob Semple tank (New Zealand) – never reached service\n**Schofield tank (New Zealand) – never reached service\n*Self-propelled artillery\n**Sexton (Canada) – 25 pdr on Ram tank chassis\n*Armoured personnel carrier\n**Kangaroo (Canada) – conversions of armoured vehicles\n*Armoured cars and scout cars\n**Dingo Scout Car (Australia) – only saw service in Australia\n**Lynx Scout Car (Canada) – adaptation of Daimler Dingo using local chassis and engine\n**S1 Scout Car (Australian) – Australian design built for US Army service; never left Australia\n**Fox armoured car (Canada) – adaptation of Humber armoured car produced using local chassis\n**Marmon-Herrington armoured car (South Africa) – components imported from United States and United Kingdom; Marks I to IV saw service\n**Rhino heavy armoured car (Australia) – never reached service\n**Rover light armoured car (Australia) – only used for training\n**Armoured carrier wheeled Indian pattern (India) – used by Indian units\n**[https://www.keymilitary.com/article/royal-tank-museum-amman Wagner Armoured Car](Transjordan) - used by the Arab Legion\n**Lanchester 6x4 Armoured car - used in Malaya and Burma\n*Trucks\n**C15TA Armoured Truck (Canada) – used by British and Canadian units as APC and ambulance\n**Ford V8 truck - used by the Arab Legion\nLend-Lease armoured vehicles\nAmerican armoured vehicles were purchased and sometimes re-fitted with British guns, and were used by British and British-supplied Allied forces throughout the war.\n*Sherman IC and VC – Sherman I and Sherman V medium tank chassis adapted by the British with a redesigned turret to mount a British 17-pounder gun. The 17-pounder could knock out any German tank. Often referred to by the post-war nickname \"Firefly\", but during WWII this nickname was also used for the 17pdr M10.\n*Lee and Grant – M3 Lee medium tank\n*3in SP M10 – M10 tank destroyer\n*17pdr SP M10 – M10 tank destroyer equipped with a British 17-pounder gun\n*Stuart tank (nicknamed \"Honey\") – M3 Stuart light tank\n*Locust – M22 airborne light tank\n*Chaffee – M24 light tank\n*Priest – M7 self-propelled artillery\nPrototypes\nThese vehicles were never put into production.\n*Black Prince – Churchill development to carry 17-pounder\n*Excelsior – heavily armoured assault tank; designed due to concerns about unreliable early-model Churchill infantry tanks\n*Tortoise heavy assault tank – a very heavy armoured tank for use in breaching fixed defences in Europe\n*Valiant – a heavily armoured but small assault tank designed as successor of the Valentine tank and intended for use in the Far East.\n*Alecto – a self-propelled gun based on the Harry Hopkins light tank chassis\n*TOG1 – tank design suitable for crossing shelled areas and trenches\n*TOG2 – improved version of TOG with larger turret holding 17-pounder; turret and gun later reused for Challenger cruiser tank\nSee also\n*British armoured fighting vehicle production during World War II\n*British military vehicle markings of World War II\nReferences\nExternal links\n*[https://web.archive.org/web/20031202163924/http://www.geocities.com/britsatwar/tanks.html British Tanks]\n*[http://www.warlinks.com/armour/index.html?menu=click+for+menu WW2:A British Focus – Armoured]"
    }
  ]
}