{
  "content": [
    {
      "type": "text",
      "text": "# British Antarctic Monument Trust\n\n|extinction   =\n|type         = charity\n|status       =\n|purpose      = Promote the achievements of members of the British Antarctic Survey who have carried out hazardous duties in the pursuit of scientific knowledge within the British Antarctic Territory.\n|headquarters = London, UK\n|location     =\n|coords       =\n|region_served =\n|membership   =\n|language     =\n|general      =\n|leader_title = Chairman\n|leader_name  = Roderick Rhys Jones\n|main_organ   =\n|parent_organization =\n|affiliations =\n|num_staff    =\n|num_volunteers =\n|budget       =\n|website      = [http://www.antarctic-monument.org/ www.antarctic-monument.org]\n|remarks      =\n}}\nThe British Antarctic Monument Trust is a charitable trust set up in 2008 to promote the achievements of men and women of the British Antarctic Survey who have carried out hazardous duties in the pursuit of scientific knowledge within the British Antarctic Territory. The trust also aims to improve the public understanding of how Antarctic exploration and science contributes to our knowledge of Antarctica and the impacts of human activity on the natural environment.\nThe trust also maintains a complete list of all those who have perished in the British Antarctic Territory since the first permanent British base was set up at Port Lockroy in 1944.\nMemorials\nThe trust has placed The Antarctic Memorial tablet in the crypt of St Paul's Cathedral. It was dedicated by Canon Treasurer Mark Oakley on 10 May 2011. The tablet has the inscription \"For those who lost their lives in Antarctica in pursuit of science to benefit us all\". The memorial was designed by Graeme Wilson and the sculptor Fergus Wessel.\nIn addition to the tablet, the trust is organizing the British Antarctic Monument. This monumental sculpture will have a section installed at the Scott Polar Research Institute and a section located on the Falkland Islands. Sculpted by Oliver Barratt (who created the Everest Memorial), the monument features a sculpture in two parts – the northern part is made of British oak and represents the mould from which the other part, a stainless steel needle, is cast. The northern section is sited outside the Scott Polar Research Institute in Cambridge and the southern in Stanley on the Falkland Islands.\nThe northern sculpture was unveiled on 12 May 2011 by Oliver Barratt and Roderick Rhys Jones (Chairman of the British Antarctic Monument Trust). During the unveiling the Director of the Scott Polar Research Institute, Professor Julian A. Dowdeswell, welcomed friends and relatives of those who died in the Antarctic.\nAmbassadors\nThe trust has four well-known ambassadors – Felicity Aston, Paul Rose, John Killingbeck and Dr. Russell Thompson. Each promotes the trust’s work through lectures and acting as guides and interpreters on Antarctic tour ships.\nReferences\nExternal links\n* [http://www.antarctic-monument.org British Antarctic Monument Trust]\n* [http://www.antarctic-monument.org/index.php?page=those-who-did-not-return List of people who died]\n* [http://www.ukaht.org/ United Kingdom Antarctic Heritage Trust]"
    }
  ]
}