{
  "content": [
    {
      "type": "text",
      "text": "# British home army in the First World War\n\n| type = Army\n| role = Land warfare\n| size =\n| branch=\n| command_structure = British Armed Forces\n| garrison =\n| garrison_label =\n| nickname =\n| patron =\n| motto =\n| colours =\n| colours_label =\n| march =\n| mascot =\n| equipment =\n| equipment_label =\n| battles =\n| anniversaries =\n| decorations =\n| battle_honours =\n| website =\n| commander1 = General Ian Hamilton\n| commander1_label = Commander-in-Chief, Central Force\n| commander2 = Lieutenant-General Launcelot Kiggell\n| commander2_label = Director of Home Defence\n| commander3 = Field Marshal Viscount French\n| commander3_label = Commander-in-Chief, Home Forces\n| commander4 = General Sir William Robertson\n| commander4_label = Commander-in-Chief, Home Forces\n| notable_commanders =\n| identification_symbol =\n| identification_symbol_label =\n| identification_symbol_2 =\n| identification_symbol_2_label =\n| start_date =\n}}\nThe British home army in the First World War served the dual purpose of defending the country against invasion and training reinforcements for the army overseas. Initial responsibility for defending the nation lay with the Territorial Force, a part-time auxiliary designed in 1908 as a means of expanding the army in a major foreign conflict but, as a result of political compromise, implemented as a home defence army. It was supported in this role by 42,000 regular army troops, primarily belonging to the Royal Garrison Artillery and the Royal Engineers. The 14 infantry divisions and 14 mounted brigades of the Territorial Force were mainly allocated either to the Local Force, stationed near the coast and tasked with disrupting an invasion at the point of landing, or the Central Force, a mobile element tasked with defeating the invading force as it marched on London. The Local Force was augmented by units of the Special Reserve and Extra Reserve, which were the third battalions of the regular army line infantry regiments established to recruit and train replacements for their regiments' two combat battalions. The home army was also largely responsible for guarding vulnerable points, such as the communications infrastructure, rail network and munitions works.\nAlthough the territorials could not be compelled to serve outside the United Kingdom, they could volunteer to do so, and when large numbers did, units of the Territorial Force began to be posted overseas. By July 1915, the home army had been stripped of all its original territorial divisions, and their places in the home defences were taken by second-line territorial units. The new units competed for equipment with the 'New Army' being raised to expand the army overseas, the reserves of which were also allocated to home defence while they trained, and suffered from severe shortages. The second line's task in home defence was also complicated by having to supply replacement drafts to the first line and the need to train for their own eventual deployment overseas. Most of the second line divisions had departed the country by 1917, and the territorial brigades in those that remained were replaced by brigades of the Training Reserve, created in 1916 by a reorganisation of New Army reserve units.\nTo make up the losses, the duties of the home army were increasingly performed by personnel unsuitable for service at the front. The National Reserve, comprising men above military age with previous military experience, relieved territorials in guarding vulnerable points. It was re-organised in early 1916 as the Royal Defence Corps which, in 1917, also began to man coastal defences. Older members of the National Reserve played a leading role in the development of the Volunteer Training Corps. This was a spontaneous civilian movement which sprang into existence as soon as war was declared and assisted the home army in a variety of duties, including the digging of the London defences and the guarding of vulnerable points. The movement was initially met by the authorities with antipathy and censure, but it was formally recognised in 1916 as an official military auxiliary and incorporated, as the Volunteer Force, into the anti-invasion plans.\nA shortage of manpower at the end of 1917 resulted in further significant reductions in the home army. Four of its eight divisions were disbanded, and the partially trained 19-year-olds in the remainder were replaced with raw 18-year-old recruits. The problem was exacerbated by the heavy losses suffered as a result of the German spring offensive in March 1918. The home army was stripped of all available personnel, leaving its ranks populated by under-aged, largely untrained recruits and low-category territorials, supported by part-time amateur auxiliaries recruited from men exempted from conscription, the medically unfit and the over-aged. Despite the military authorities' belief that it was militarily worthless, the Volunteer Force was partially mobilised and deployed to augment the coastal defences. The crisis passed in August, and by the following the month the invasion threat was downgraded to no more than a raid not exceeding 5,000 troops. The home defences were wound down, and the home army was rationalised as a training organisation dedicated to the provision of replacements to the front-line units overseas. After the war, home defence forces were demobilised with scant recognition given for their services. The Territorial Force was reconstituted as the Territorial Army and the Royal Defence Corps reappeared as the National Defence Corps, but the National Reserve and the Volunteer Force were not revived.\nBackground\nAt the beginning of the 20th century, the British Army was a small, professional organisation designed to garrison the empire and maintain order at home. It was augmented in its home duties by three part-time volunteer institutions, the militia, the Volunteer Force and the yeomanry. Battalions of the militia and Volunteer Force had been linked with regular army regiments since 1872. The militia was often used as a source of recruitment into the regular army. The terms of service for all three auxiliaries made service overseas voluntary. At the turn of the century, the Second Boer War had revealed a number of deficiencies with British military planning. The army lacked sufficient manpower to cope with a major conflict overseas; the government was forced to reinforce it in South Africa by denuding the regular home defences and relying on auxiliaries to volunteer for foreign service. At one stage, regular forces available for the defence of the homeland comprised just nine cavalry regiments, six infantry battalions and three guards battalions. In February 1900, George Wyndham, Under-Secretary of State for War, conceded in Parliament that instead of augmenting the regular army's defence of the UK coast, the auxiliary forces were the main defence. There were doubts in both government and the military authorities about the auxiliaries' ability to meet such a challenge; the volunteers' performance in the war was questionable due to their poor standards of organisation, equipment and training.\nIn 1903, the Committee of Imperial Defence (CID) estimated that to succeed, an invasion would require 70,000 troops, over 200 transport ships and a 48-hour embarkation time to succeed. It concluded that this would give the Royal Navy enough time to intercept the invasion fleet and allow the regular and auxiliary forces to man coastal defences. Based on the CID's findings, the government adopted the 'blue water' strategy of home defence, in which the navy was the prime agent in defeating any large-scale invasion. The auxiliary forces, assisted by elements of the regular army, were given responsibility for defending against smaller-scale raids that might evade the navy. The bulk of the regular army was absolved from home defence duties, allowing it to focus on foreign commitments.\nTerritorial Force\nA royal commission on auxiliary forces concluded in 1904 that they were not fit to defend the country unaided and that the only effective solution would be to introduce conscription. This option was regarded as political suicide by all parties and immediately rejected. Efforts to reform both the regular army and the auxiliaries stalled in the face of political opposition until, in December 1905, a Liberal government took office, bringing in Richard Haldane as the Secretary of State for War. His reforms created a regular army expeditionary force of one cavalry and six infantry divisions. To reinforce the army in times of crisis, the militia was converted into the Special Reserve and the Extra Reserve, comprising volunteers who would undergo military training in their civilian lives. The Volunteer Force and yeomanry were amalgamated to form the Territorial Force with an establishment of over 300,000 men.\nHaldane's purpose in establishing the Territorial Force was to create the means by which the regular army could be expanded in a major conflict overseas. The force was better organised and integrated than the previous auxiliaries. It was organised into 14 infantry divisions and 14 mounted brigades, structured along regular army lines with integral supporting arms of artillery, engineers and signals, along with supply, medical and veterinary services. Having designed what was in effect a second line to the regular expeditionary force, Haldane was forced to compromise by opposition from the existing auxiliaries to a liability for foreign service. Although he still hoped the Territorial Force would be the primary means of expanding the army in a major war overseas, at its creation on 1 April 1908 he was forced to present it as a primarily home defence force. Territorials could not be compelled to serve outside of the United Kingdom, though Haldane hoped they would volunteer for foreign service on mobilisation. In 1910, the Imperial Service Obligation was introduced to allow them to volunteer in advance. The force was financed, trained and commanded centrally by the War Office but raised, supplied and administered by local County Territorial Associations.\nInvasion threat and conscription debate\n'' less than three months before the start of the First World War.]]\nA second CID study in 1908 reiterated the belief that an invasion would be defeated before it made landfall, rendering a large home army unnecessary in the eyes of the military authorities. The War Office considered two regular divisions and 40,000 auxiliaries would be enough to defeat any force that did manage to reach the nation's shores. The military authorities begrudged the money spent on what they perceived to be an inefficient amateur auxiliary and believed it could have been better spent on the regular army. The relationship between the County Territorial Associations and the War Office was often difficult. The associations frequently complained about excessive bureaucracy and the inadequate finance with which they were expected to forge a force capable of defeating an invasion. Because they believed the Territorial Force was of questionable utility, the military authorities prioritised expenditure on the regular army, leaving the force armed with obsolete weapons.\nPublic perception was driven in the opposite direction of military thinking by articles in the press and invasion literature such as The Riddle of the Sands and The Invasion of 1910. These raised the spectre of a surprise 'bolt out of the blue' attack which could evade naval interception. Invasion fears were also stoked by the alarmist rhetoric of former Commander-in-Chief of the Forces, Lord Roberts. He argued that reliance on a naval defence was complacent, and that Germany's modern rail and sea facilities would allow it to land 20,000 troops within an hour. His cause was echoed in The Times by Colonel Charles à Court Repington, who called for an expansion of the Territorial Force to 800,000 men. International tension in 1909 inflamed fears further, and the play ''An Englishman's Home generated 30,000 new recruits in seven weeks for the Territorial Force. It was a temporary boost, and from a peak of over 268,000 that year, the force declined to just under 246,000 men by September 1913, less than 80 per cent of establishment. As well as failing to attract sufficient new recruits, the force failed to retain large numbers of men after their initial enlistment expired. In 1910, Lord Esher, chairman of the London County Territorial Association, wrote in the National Review'' that the country would have to choose between an under-strength voluntary auxiliary and conscription.\nEsher supported conscription; in his opinion the Territorial Force was the last chance for the volunteer tradition, and its failure would pave the way for the introduction of compulsory service. Advocacy for conscription was led by the National Service League (NSL), with Roberts as its president. A bill sponsored by the NSL in 1909 proposed using the Territorial Force as the framework of a conscripted home army. When that failed, the league became increasingly antagonistic towards the force. It was denigrated for its excessive youth, poor quality and consistently low numbers, and was ridiculed in the popular press as the \"Territorial Farce\". Roberts enlisted the support of serving officers in his campaign against the force, and in 1913 the Army Council declared its support for conscription. Confidence in the nation's security suffered another blow during naval exercises in 1912 when, despite an expansion of the Home Fleet, a 'German' fleet managed to evade the Royal Navy and land a force of 28,000 men in the Humber estuary. The navy again failed to stop a landing during exercises the following year. In April 1914, the Admiralty revised its previous \"absolute guarantee\" to stop a 70,000-strong invasion force to a \"reasonable expectation\", although such an invasion was still considered unlikely.\nStrategy\nIn 1912, defence priorities were re-aligned and resources re-allocated from the Channel to the east coast defences in anticipation of war with a 'North Sea Power'. Defence planning was based on the assumption that Germany would land a 70,000-strong main force south of the Thames, in East Anglia or in Lincolnshire and then march on London. The possibility of smaller-scale raids as strong as 20,000 men on coastal and riverside facilities, and acts of sabotage against vulnerable points was also considered. Forces available for defence comprised the Territorial Force and some 42,000 soldiers of the regular army, primarily troops of the Royal Garrison Artillery and the Royal Engineers. Concerned about the ability of the Territorial Force to counter an invasion unaided, the CID recommended in 1908 and 1914 that two divisions of the Expeditionary Force be retained in the UK for home defence. In 1912, the military authorities considered invasion to be unlikely and assumed that the Expeditionary Force would proceed to the continent in its entirety. Defence plans were drawn up based on this assumption, but could assimilate the additional two divisions if it was decided that they would in fact remain.\nTerritorial units of the Royal Garrison Artillery were to augment the regular defenders of fortified ports. Additional coastal security was to be provided by the Local Force; seven territorial divisions numbering some 73,000 men, and the 101 battalions of the Special Reserve and Extra Reserve. Their task was to meet an invasion at the point of landing and, if not defeat it, at least delay and disrupt it. Wherever possible, territorial formations were to be kept intact and not dissipated as garrison troops, which were to be provided by the Special and Extra Reserves. Early warning of an enemy's approach would be provided by 66 coastguard stations manned by the Royal Navy and the Royal Naval Volunteer Reserve, and by patrols of the territorial cyclist battalions. Their intelligence gathering activities would be augmented in some maritime counties by the Corps of Guides, formed in 1912 and comprising men over military age with local knowledge, such as hunters and farmers. To make up for a shortfall of territorial cyclists, a scheme was devised in 1913 whereby secret observers would remain in the area following a landing to pass on intelligence about enemy activities.\nThe other seven territorial divisions, numbering some 195,000 all ranks, were allocated to the Central Force. This was a mobile element designed to engage the enemy once the location of the invasion became known. On mobilisation, these divisions were to concentrate mainly north of London, in locations with good transport links and which would place them on the enemy's approach to the capital. This force was organised into four commands: the Mounted Division, comprising four yeomanry brigades and two cyclist battalions, headquartered at Bury St. Edmunds, Suffolk; the First Army, comprising one infantry division and one mounted brigade, headquartered at Bedford, north of London; the Second Army, comprising two infantry divisions, two yeomanry brigades and three cyclist battalions, headquartered at Aldershot, south-west of London; and the Third Army, comprising four infantry divisions, two yeomanry brigades and one cyclist battalion, headquartered at Luton, north-west of London.\nBoth the police and the Territorial Force were to be responsible for guarding vulnerable points such as oil storage depots, munitions works and the communications network. Arrangements for the defence of less important sites, such as factories and commercial buildings, were to be made by their owners. The territorials were given specific responsibility for protecting the rail network, and the 1st London Brigade was to be dispersed by platoons to protect the lines between London and Southampton. The remainder of the 1st London Division was to concentrate with the London Mounted Brigade west and north-west of London, from where they were to conduct a fighting retreat of the capital, to the last man if necessary. Supplies for the Central Force were to be stockpiled in provincial centres so that resistance could be continued in the event that London fell. Two territorial divisions were to relieve the regular army's 6th Infantry Division and 3rd Cavalry Brigade in Ireland.\nIt was anticipated that the approach of hostilities would be signalled by worsening international relations. During this 'Precautionary Period', some 1,500 territorials assigned to Special Service Sections would begin patrolling the east coast, and 45 battalions of the Special Reserve would be put on standby ready to replace the regular units scheduled for deployment abroad. On the outbreak of war, the remaining home defence units were to be at their wartime stations within 14 days of mobilisation. It was anticipated that if an invasion did come, it would be after the dispatch of the Expeditionary Force to the continent and during the six-month post-mobilisation training period required by the Territorial Force.\nMobilisation\nAs international relations deteriorated in July 1914, the United Kingdom entered the Precautionary Period. The Royal Navy replaced its normal annual exercises with a test mobilisation, and its ships were at their war stations by the end of the month. Territorial Special Service Sections were ordered to their war stations on 28 July. By 2 August, strategic locations such as Harwich, the Tyne estuary, Thanet and Ipswich wireless stations, the cable landing point at Dumpton Gap, Grimsby docks, Kinghorn Fort and the Tay defences were manned. On 3 August, the 1st London Brigade entrained, and 18 hours before the declaration of war the stations, tunnels and signal boxes of the rail network between London and Southampton, the port of embarkation for the British Expeditionary Force (BEF), were under guard.\nAfter the declaration of war on Tuesday 4 August 1914, coastal fortifications were placed on alert, reservists were called up and the Territorial Force embodied. The regular army was mobilised, and the decision was taken to retain two of the BEF's six divisions in the UK, though they soon followed the rest of the BEF to France. The notification procedure had been well established, but for most territorials it was largely unnecessary because they had already gathered for annual camp the previous weekend. Returning to their depots, many under-strength battalions&nbsp;– some as low as 500 strong, or around half a normal infantry battalion&nbsp;– were soon brought up to establishment by a flood of ex-territorials re-enlisting and new recruits joining. Depots became swamped, and initially those territorials not immediately required to man war stations were issued with their equipment and then sent home. They were recalled after an invasion warning was issued on 7 August, and thereafter remained at or close to their drill halls.\nSome territorial battalions marched immediately to nearby locations designated to be defended by the end of the first day of mobilisation. Elements of the Wessex Division were concentrated at Plymouth, those of the Northumbrian Division took up positions in the east coast defences, two battalions of the Highland Division occupied the Forth defences, and elements of the Welsh Division were gathered in the area of Pembroke Docks. Five days after mobilisation, units of the Special Reserve and Extra Reserve began to relieve them. Other territorial formations assembled close to their bases before moving on to their war stations; the Highland Division, for example, gathered at various locations north of Edinburgh before proceeding to Bedford, north of London. Defence duties resulted in some divisions being dispersed; a brigade of the West Riding Division, for example, was deployed to watch the east coast while the rest of the division guarded railways and munitions factories further inland, and the brigades of the East Anglian Division were widely scattered about East Anglia.\nAs a part-time institution with limited peacetime training, it was always intended that the territorials would undergo six months of training on mobilisation, and they faced a number of difficulties as they did so. It proved difficult for those formations that were widely dispersed as part of their defence duties, and was complicated for all by the need to reorganise the territorial battalions' outdated eight-company structure to the army's standard four-company battalion. Many of the regular-army training staff attached to territorial units were recalled to their parent regiments, and those professionals who still remained were transferred to territorial reserve units in January 1915. For some artillery units, their first opportunity to practise with live ammunition did not come until January 1915. Rifle practice, already complicated by the variety of weapons issued to the territorials, suffered due to lack of rifles, practice ammunition and ranges on which to use them. Shortages and the competing demands of the rest of the British land forces meant that territorials often began their duties without the necessary equipment. Uniforms were in short supply, and insufficient transport resulted in a motley collection of carts, private vehicles and lorries being pressed into service. The regular army took priority in the allocation of horses&nbsp;– to the point that the London Scottish were relieved of their entire complement by a regular battalion&nbsp;– and the animals used to pull the territorial non-motorised transport or mount the yeomanry ranged in pedigree from half-blind pit ponies to show horses.\nKitchener's New Army\nOn 5 August, Lord Kitchener was appointed Secretary of State for War. Under the premiership of H. H. Asquith, he and Winston Churchill, First Lord of the Admiralty, directed the early war effort. Kitchener was one of the few leading figures who believed the war would be a long and protracted affair, and that the full British military strength could not be brought to bear until 1917. He regarded the existing military arrangements as suitable only for a limited war and immediately began the process of significantly expanding the army. Although the Territorial Force had been designed for precisely this purpose, Kitchener by-passed it and, with full approval from the army, raised instead a 'New Army' of volunteers. The County Territorial Associations were initially invited to assist, but this was rescinded in September. The territorials found themselves competing for recruits, training staff and equipment, and the War Office prioritised the New Army over the Territorial Force.\nInvasion scares\nFear of invasion persisted throughout the first months of the war, and Kitchener's decision was motivated in part by his concern that the Territorial Force should not be diverted from what he regarded as its primary task of defending the homeland. German success on the continent in September and October opened up the prospect of the French channel ports being used to launch an invasion that could outflank the main British coastal defences north of the Thames. To allow rapid redeployment of the Central Force across the river, construction was begun on a pontoon bridge between Tilbury and Gravesend. There were fears that a German fleet protected by mines and submarines could land a 100,000-strong force before the British Grand Fleet could steam the  south from its base at Scapa Flow. To counter this threat, the Admiralty redeployed pre-dreadnought battleships and submarines closer to vulnerable ports, expanded the coastwatch and increased patrolling of the North Sea. In October, Churchill responded to Kitchener's call for the Royal Navy to take more specific precautions against invasion by insisting that the role of the Grand Fleet was to eliminate an invader's covering fleet rather than defeat the invasion itself. Invasion fears peaked on 20 November, when tides and moon were considered most suitable for an attempt, and resulted in the deployment of 300,000 New Army and territorial troops along the east and south coasts. As winter set in and the training of both first-line territorials and the first of the New Army formations neared completion, invasion fears began to recede. Anxiety was renewed in December when the Imperial German Navy conducted a raid on Scarborough, Hartlepool and Whitby, followed at the turn of the year by the first Zeppelin raids.\nTerritorial re-deployments\nWithin a week of the war's start, Kitchener signalled his willingness to deploy overseas those territorial units which accepted the Imperial Service Obligation en bloc. His intention was to use the Territorial Force to release regular units from the imperial garrison and line of communications duties in France. By 25 August, he had at his disposal more than 70 territorial battalions willing to go. On 10 September, the East Lancashire Division was reassigned from its originally planned posting to Ireland and sent to replace the garrison in Egypt. In October, the Wessex Division was sent to India. By January 1915, it had been joined by its second-line 2nd Wessex Division and the Home Counties Division in freeing up the regular garrison there. Territorial battalions relieved the garrisons at Gibraltar, Malta, Cyprus and Aden, while others were deployed to France.\nAlthough Kitchener remained reluctant to deploy the territorials as reinforcements for the regular army, the heavy casualties sustained during the initial German offensive before the New Army divisions were ready forced him to use them to fill the gap. Despite the preference of General Ian Hamilton, commander-in-chief of the Home Forces, for the Territorial Force to be deployed to the Western Front in complete brigades and divisions, it was deployed piecemeal, and individual battalions were attached to regular brigades. By December, twenty-two infantry battalions, seven yeomanry regiments, one medical and three engineer units had been sent.\nBecause of the mix of home and foreign service personnel and the breaking up of its formations, there was considerable disarray in the Territorial Force which threatened its ability to successfully defend the homeland. In early October, Kitchener further complicated home defence plans by unilaterally abandoning the pre-war strategy. Instead of harassing an invasion at the point of landing and then defeating it as it marched on London, he ordered the territorials to concentrate on the coast and defeat any invasion as it landed. As invasion fears receded, more home defence units were released for service overseas. The first full territorial division, the North Midland Division, arrived in France in February 1915. By July, all fourteen of the first-line divisions had been deployed out of the country.\nTerritorial second and third lines\nCounty Territorial Associations raised second-line units to replace those deployed abroad and to accommodate territorials who could not or would not volunteer for foreign service. The second-line battalions served the dual purpose of home defence and supplying replacement drafts to their first-line counterparts. There was also a widespread belief that the second line would eventually be deployed overseas; many units enlisted only those new recruits who were prepared to accept the Imperial Service Obligation. This belief was officially endorsed in March 1915, by which time third-line units were being raised to take over the responsibility for providing replacement drafts. Officially, a unit would not be sent overseas until its second line was ready to take its place at home, though the reality was different. In late September, Kitchener explained to the senior officers of the 2nd London Division that \"not a man will leave...until your second battalions are fully equipped and ready to take your place\"; the division's London Scottish battalion had already been deployed to France, leaving in its place in the home defences a second-line battalion without uniforms or weapons.\nProblems with the supply of equipment were acute. The experience of the 2nd South Midland Division, the first of the second-line divisions to see active service abroad, was indicative of the general situation facing the home defences. Its constituent units were raised in September and October 1914, and new recruits paraded initially without uniforms. They lived at home until January 1915, when the division assembled at its temporary war station in Northampton. In April, the division moved to its permanent station at Chelmsford to replace first-line South Midland Division which had deployed to France. The second-line infantry was equipped with old Japanese Arisaka rifles, antique Maxim and dummy Lewis machine-guns constructed from wood. The divisional artillery, having initially drilled with cart-mounted logs, was equipped first with obsolete French 90 mm cannons, then with outdated 15-pounder guns and 5-inch howitzers handed down from the first line. The division was not issued with modern weapons until it began intensive training in March 1916, in preparation for its deployment to France at the end of May.\nSecond-line units were required to continue providing replacement drafts to the first line until the third line became effective. Throughout its time as part of the home defences, battalion strengths in the 2nd South Midland Division fluctuated considerably. The division was still only at two-thirds strength when it fought in the Battle of Fromelles in July 1916. In May 1915, Kitchener informed the War Cabinet that the second line was so denuded of trained men as to render it unreliable for home defence. Promises made that month to General Sir Leslie Rundle, commander of the Central Force, that the second-line divisions under his command would not be required to provide further drafts could not actually begin to be kept until 1916. By that time, battalion establishments had been reduced in steps to 700 men, then 600 and finally 400, less than half the number normally serving in an infantry battalion at full establishment. It took on average 27 months for a second-line formation to complete its training up to operational standard, compared to eight months for the first-line.\nProvisional Battalions\nUntil March 1915, territorial recruits retained the option to enlist for home service only. Provisional Battalions were established in the summer to separate home-service recruits from those preparing for foreign service. By 1916, there were 41 battalions organised into 10 Provisional Brigades. Relieved, at least in theory, from the need to provide drafts for front-line units, these battalions were deployed at the coastal defences and became the first line of resistance against invasion. In practice, they suffered from a high turnover of personnel; some men were passed medically fit for transfer back to the second or first lines, others came under pressure to volunteer for foreign service, and all fit men under the age of 41 became liable for posting overseas when conscription was introduced early in 1916. The battalions suffered from the same level of equipment shortages that afflicted the rest of the Territorial Force. By the very nature of the scheme, many territorials in the Provisional Battalions were of an age or physical condition that prevented them from becoming effective soldiers. Three brigades were allocated to Home Service Divisions in November 1916, but were replaced and disbanded in May 1917. The remaining seven were later renamed Mixed Brigades.\nAugmenting the home defences\nIn September 1914, the Territorial Force could devote to home defence some 120,000 trained men in eleven and a half infantry divisions, including the soon-to-depart Wessex Division, and thirteen yeomanry brigades. Between 75,000 and 100,000 were allocated to the Central Force, the remainder to local duties. Consideration was given to creating three Special Reserve divisions to augment the Central Force, but this idea was abandoned due to the high turnover of personnel passing through the reserve battalions.\nThe Special Reserve and Extra Reserve encountered difficulties meeting their dual obligations of defending the homeland and supplying trained troops to the regular army. As soon as they were mobilised, the reserves supplied drafts to bring their regular battalions up to strength and, once battle was joined in France, replace casualties. By September, they had provided 35,000 men. Because of the loss of so many men, the ability of the reserves to defend the coastal forts they garrisoned became doubtful. In an attempt to alleviate the reserves' difficulties, less fit reservists were transferred into new Home Service Garrison companies in early 1915. By the end of the year, 21 companies had been formed and by the summer of 1916 there were 20 Home Service Garrison battalions.\nNational Reserve\nThe National Reserve was the only surviving feature of a failed attempt in 1910 to create a reserve for the Territorial Force. It was little more than a register of former regular or auxiliary personnel who would be prepared to volunteer should their services be needed. It had no clearly defined role. By 1914, some 200,000 men had registered, though 70 per cent would not or, due to their age, could not perform an active role in home defence. On the outbreak of war, several thousand of the younger reservists enlisted into regular or territorial units on their own initiative. It took three weeks for the government to decide how best to utilise the remainder and begin calling them up, though National Reservists were under no obligation to respond.\nYounger reservists who had previously expressed a willingness to be recalled to active service were invited to enlist in the New Army, Special Reserve or Territorial Force. This still left a majority who were unwilling or too old to serve in combat units. Most County Territorial Associations, swamped in the first weeks of the war by the flood of new recruits, had no time to organise them or find uses for them. One of the few that did was Buckinghamshire Association; on 6 August, it anticipated official policy and organised its reservists into Protection Companies which could be deployed to relieve territorials guarding bridges, waterworks and other essential sites.\nBy September, National Reservists were deployed on protection duties at Dover harbour, the Manchester Ship Canal and points at Stowmarket and Lowestoft near or on the east coast in Suffolk, all on the initiative of local authorities. In October, the War Office instructed Buckinghamshire to provide a 120-strong railway protection company, while 2,000 reservists were on duty guarding strategic sites in London and 600 augmented the defences of the Tyneside shipyards and munitions works. The National Reservists were called \"watchmen\" by the army and came low in the list of priorities for equipment. Many lacked weapons and wore scarlet armbands inscribed with \"National Reserve\" for uniforms. In March 1915, the Protection Companies were re-designated as Supernumerary Companies of the Territorial Force. By December, those men under 44 years old and fit enough to march 10 miles with rifle and 150 rounds of ammunition who were willing to volunteer for garrison duties overseas had been transferred into seven new Provisional Battalions formed as part of the Rifle Brigade. The remaining older reservists for whom no employment could be found by the County Territorial Associations were released for service in the Volunteer Training Corps (VTC).\nVolunteer Training Corps\nMembers of the National Reserve without a place in the established home defence forces mounted patrols and guards on their own initiative and without official sanction. They were joined by civilian local defence groups which sprang up spontaneously as soon as war was declared. Discussions about the nature and role of the civilian movement ranged from simply drilling volunteers in preparation for their enlistment into the regular or home armies, through augmenting the home army's defence of vulnerable points, to providing a force that would actively oppose an invasion with guerrilla warfare. The author H.G. Wells wrote letters to the press advocating for the civilian population to be prepared for guerrilla operations. Opponents argued that such activity would have little benefit and succeed only in inviting German reprisals against civilians. Concerned that the movement would undermine recruitment into the regular army and hinder more than help home defence, the government banned it.\nDespite official antipathy civilians continued to organise themselves, and Harold Tennant, Under-Secretary of State for War, realised that the government could do little to prevent them. Rather than allow the movement to grow unchecked, he decided in September to allow the organising committee of the London volunteers, acting as the Central Association of Volunteer Training Corps (VTC), to become the coordinating body of the movement. The association accepted responsibility for drawing up national rules and regulations for the movement. Individual corps of volunteers remained without official recognition but were encouraged to affiliate with the association. In November, the association was officially recognised as the administrative body of the VTC and formally subjected to conditions which prevented interference with recruitment into the regular army, barred volunteers from holding military rank or wearing uniforms other than an armband while on duty and denied any state funding.\nNational Reservists played a leading role in the growth of the VTC, providing many of its recruits and lending the nascent organisation an element of martial respectability. Some 590,000 men had volunteered in 2,000 individual corps by June 1915. Members provided their own arms, and amid concerns of competition with the established forces for the limited supply of rifles then available, the government prohibited volunteers from buying service weapons. The VTC was employed in a variety of tasks, including digging trenches around London and assisting to bring in the harvest. They were employed as guards, by the Admiralty on the Scilly Isles, at the many new munitions works and on the rail network, where Motor Sections also conveyed soldiers on leave between stations.\nA private member's bill introduced in the House of Lords in October 1915 sought to place the VTC on a more official footing by applying to it the provisions of the Volunteer Act of 1863. It was supported by General Sir Horace Smith-Dorrien, commander of the Central Force First Army, who, in a letter to The Times, wrote of \"the most valuable aid the VTC are giving me\". The bill failed because of government fears that it would complicate the home rule issue in Ireland by recognising the Ulster Volunteers and the National Volunteers. The VTC remained officially unrecognised and outside of the nation's home defence scheme, thus depriving members of legal protection in the performance of their duties. There was some doubt that the armband would be recognised as a uniform by the enemy, leaving members vulnerable to execution as francs-tireurs, and when it was suggested that the VTC might guard prisoners of war, it was pointed out that, technically, a volunteer could be hanged for murder if he shot an escapee.\nNew Army reinforcements\nIn 1915, it was decided that two New Army divisions would be made available to the home army should it be required. The home defences were further augmented by the conversion of the Fourth New Army's six divisions into 2nd Reserve Battalions. The 76 battalions were organised into 18 Reserve Infantry Brigades, quartered in camps at Aldershot, Cannock Chase and on Salisbury Plain, and attached to the home army. The town committees and civic leaders who raised the Fifth New Army in late 1914 were instructed to recruit over establishment and form the surplus into Depot Companies. Where three or more such companies were concentrated together, they were amalgamated into Local Reserve Battalions. In this way, by June 1916 a further 69 battalions had been added to the Reserve Infantry Brigades.\nRe-organisation\nIn January 1916, Field Marshal Sir John French, who until the previous month had been commander of the BEF on the Western Front, was appointed to the newly created position of Commander-in-Chief, Home Forces. He inherited \"absolute chaos\" and, although he regarded the prospect of invasion to be remote, felt that if one did come, \"no-one would know what to do\". A report issued the same month concluded that a German invasion might involve a force of 160,000 men, though a more likely scenario would be a raid conducted by up to 20,000 troops on the east coast, north of the Wash. Considering an invasion of the south-east unlikely, French concentrated his forces on the east coast. The Central Force had by this time become little more than an administrative command through which territorial divisions passed on their way to being posted overseas, and in response to concerns that a coastal emphasis would degrade it further, French disbanded it.\nThe former Central Force armies were replaced by two new armies: the Northern Army, headquartered at Mundford in Suffolk and comprising a reinforced cyclist division, two second-line territorial infantry divisions, 13 Provisional Battalions organised in three brigades and another second-line territorial infantry division attached for training; and the Southern Army, headquartered at Brentwood in Essex and comprising a cyclist division, three second-line territorial infantry divisions, 24 Provisional Battalions organised in six brigades and a mounted division attached for training. Two more second-line territorial infantry divisions were available as emergency reserves. The Local Force remained, comprising in total two second-line territorial infantry divisions, two cyclist brigades, twelve cyclist battalions, three mounted brigades and some thirty battalions of the Special, Extra and Local Reserve. Additional home army forces comprised Special Reserve brigades defending seven ports, a further fifteen 2nd Reserve and eleven Local Reserve brigades located near the coast or at inland training centres, numerous third-line territorial units scattered about the country, and various cavalry and guards reserve battalions stationed in the London district.\nDespite the protests of his subordinate army commanders about the constant loss of men to the field army overseas, French fully accepted his dual obligation to defend the homeland and train reinforcements for the field army. In November 1916, he could add three newly formed Home Service divisions, the 71st, 72nd and 73rd, to the 11 second-line territorial divisions under his command. The territorials were poorly equipped and under strength, and those five that were brought up to strength with conscripts had, by March 1917, been deployed to France. With the home army in a constant state of flux, French had early turned his attention to developing a more efficient, hybrid home defence force based on a mix of regulars, territorials, National Reservists and the VTC.\nRoyal Defence Corps\nBy early 1916, the Supernumerary Companies, comprising 39,000 men of the National Reserve, were in constant demand to provide guards for munitions works and railways. Managed by individual County Territorial Associations, they were proving difficult to co-ordinate, and their fluctuating strengths often rendered them of dubious quality. On the suggestion of French, the War Office re-organised them into the Royal Defence Corps (RDC) and centralised its administration under the City of London Territorial Association in March 1916. The RDC was organised into Protection Companies of between 150 and 250 all ranks, into which the men of the Supernumerary Companies were transferred. Further recruitment was open to men between the ages of 41 and 60 with previous military or VTC experience, and included soldiers with wounds or disabilities that precluded their return to front-line units. The RDC was, as with the Supernumerary Companies which preceded it, responsible for local defence, and on its formation the National Reserve was discontinued.\nIn the summer of 1917, the Home Service Garrison battalions were disbanded and their men re-deployed to release fitter troops currently stationed behind the lines overseas. Their places in the coastal defences were taken over by the RDC, which was re-organised to do so by the formation of 18 new battalions. An additional 78 Protection Companies continued to perform the original RDC function of defending vulnerable points. Difficulties in sourcing enough manpower for these companies prompted a further re-organisation in 1918. The RDC battalions were withdrawn from the coastal defences in January, and by the summer they had been disbanded and their men distributed to the Protection Companies. Establishment was set at 35,000, though actual strength was some 2,600 short of that figure.\nTransformation of the Volunteer Training Corps into the Volunteer Force\nFrench supported the idea of giving the VTC a role in home defence, and the government came under sustained pressure from the movement's supporters to allow it to be used. It finally acceded on 29 February 1916, when it announced that the VTC would be properly constituted as a part-time military auxiliary which could be called upon under the provisions of the Volunteer Act 1863 to help repel an invasion. Earlier concerns related to Ireland were resolved by the decision not to apply the act to that province. Volunteers gained legal protection along with the right to dispense with the armband and wear a uniform while on duty, but were still not permitted conventional military ranks and still had to fund themselves.\nIn July, the county territorial associations were given administrative responsibility for the VTC, which was reconstituted as the Volunteer Force and organised into county regiments numbering almost 230 battalions. The Central Association was retained in an advisory capacity, training became the responsibility of the home army commanders, and French was given authority to call out the volunteers for military service. Although it had gained official recognition, the practical value of the VF was questionable. Volunteers were untrained, poorly equipped and, because of a provision in the Volunteer Act that allowed them to resign on 14 days' notice, could not be relied upon. It became practice for Military Service Tribunals, established to hear appeals against conscription, to require those they exempted from compulsory service to join the Volunteer Force. This generated an influx of younger men whose motivation was limited to attending only the minimum number of drills necessary to maintain their exemption, causing resentment among the original VTC men and prompting them to resign in significant numbers.\nIn an attempt to address these issues, new regulations were introduced at the end of 1916. Volunteers who enlisted in the VF for the duration of the war and who attended 40 training drills would be uniformed, armed and equipped at government expense. They would then be expected to attend 10 drills per month and be fit enough for garrison work in the home defences. The government would also pay for an adjutant and two senior non-commissioned officers to be attached to each volunteer battalion. Early in 1917, the VF was divided into sections based on age and occupation, the better to organise the disparate commitments accepted by the volunteers. The VF continued voluntarily to augment the RDC guarding vulnerable points, but were now also a military auxiliary, becoming a significant component in the mechanism by which French hoped both to defend the homeland and release as many men as possible for service in France.\nTraining Reserve\nThe flood of new recruits generated by conscription threatened to overwhelm the regimental system of reserves, and in the summer of 1916 it was centralised. The 145 2nd Reserve and Local Reserve Battalions were amalgamated into 112 battalions, organised into 24 Training Reserve brigades. The 194 territorial third-line battalions were amalgamated into 87 battalions, organised into 14 Territorial Force Reserve brigades. These were, along with the regular army's Special and Extra Reserve, to continue to recruit, but when they were at full establishment, excess numbers were sent to the Training Reserve. The Training Reserve was further re-organised in May 1917. Recruits would undergo initial training in one of 23 Young Soldier battalions and then complete their training in one of 46 Graduated battalions, by which time they would reach the age of 19, the minimum age at which they could be posted to a front-line unit overseas. From July, the Provisional and Home Service Garrison battalions in the three Home Service divisions began to be disbanded and replaced by Graduated battalions.\nLate war\nIn early 1917, the home army comprised five second-line territorial divisions, three Home Service divisions, six independent brigades, a mounted division, ten former-yeomanry cyclist brigades, twenty-one territorial cyclist battalions, three regiments of reserve cavalry, five reserve Guards battalions, one battalion of the Honourable Artillery Company and numerous 'extemporised' units of the Training, Territorial and Special Reserves. These formations were divided mainly between the Northern Army, concentrated in East Anglia, and the Southern Army, straddling the Thames estuary. The 1st Mounted, 65th (2nd Lowland) and 72nd Divisions were allocated to the General Reserve. A number of cyclist units and the extemporised units were distributed throughout the army as part of the Local Force. Total strength was 400,000 men, but only 150,000 were fully fit regular or territorial troops, and they were mainly yeomanry, cyclists and men of the Royal Garrison Artillery and Royal Engineers. The main fighting component, the infantry, numbered 230,000 troops, but 180,000 were in the early stages of training or under 19 years old.\nFrench regarded a considerable proportion of his divisions to be of poor quality, leaving him 60,000 troops short of the number he believed necessary to conduct a successful defence. In the event of invasion, infantry numbers would be boosted by the mobilisation of the VF, and he planned to attach one or two volunteer battalions to each brigade of the home army. In September, he allocated 84 battalions to line of communication duties, 71 to mobile defence, 70 to the reserve, 45 to garrisons and 42 to the defence of London. However, of the 293,000 volunteers in March, little more than 136,000 belonged to those sections able to respond immediately to the call, and only 10,000 of those had, by July, reached a satisfactory standard of musketry. French was pessimistic about the ability of the home army to defeat an invasion, going so far as to inform the War Office in February that the loss of so many of his troops to the field army overseas absolved him of the responsibility for home defence.\nAdmiral John Fisher, a former First Sea Lord, was concerned about the increasing U-boat menace, and believed that the German war leader, Field Marshal Paul von Hindenburg, would be willing to risk the High Seas Fleet in an invasion attempt. The Admiralty regarded the risk as possible rather than probable, and guaranteed to be able to disrupt an enemy fleet within 32 to 36 hours of its sighting. The area between Aldeburgh and Lowestoft on the Suffolk coastline was considered at most risk to an invasion force up to 160,000 strong. Raids of up to 20,000 men were considered possible anywhere from north of the Wash to Cromarty in the Scottish highlands. The War Office, on the other hand, believed that while Germany was heavily engaged on the Western Front it did not have the resources to pose a serious threat.\nBased on its assessment and regarding the volunteers as inefficient, expensive and of no military value, the War Office recommended in September that the VF be reduced from its existing 312 battalions to 117 and the savings re-allocated to training the remainder to a better standard. With the VF enjoying considerable political support, a compromise figure of 274 infantry battalions, totalling some 267,000 all ranks, plus supporting engineer, fortress and signals units, was reached in December. It remained, however, an auxiliary of suspect reliability, poorly trained and insufficiently equipped. Even French, long an advocate of giving the volunteer movement a role in home defence, doubted its utility. In January 1918, at the same time as recognising improvements to training, efficiency and equipment, he characterised the VF as still essentially a body of amateurs and echoed the War Office's earlier call for a smaller, better trained auxiliary.\nAt the end of 1917, the huge losses suffered by the BEF during the Third Battle of Ypres, the implications of the October Revolution in Russia, the Austro-German success in the Battle of Caporetto on the Italian Front and the anticipated German spring offensive generated a surge in demand for manpower. In December, the army was prioritised below the navy, the Royal Flying Corps, the shipbuilding, aircraft and tank manufacturing industries, and food and timber production for the allocation of personnel. At the same time, the military authorities downgraded their assessment of the scale of any German attack on the UK to no more than a raid by a force of up to 30,000 troops. As a result, in January 1918 the home army was again scoured for drafts to be sent overseas, losing around 50,000 of its 400,000 troops. The territorial 65th (Lowland) Division and the 71st, 72nd and 73rd Home Service Divisions were disbanded. With the exception of a single brigade, the 19-year-old troops with four months' training in the four territorial divisions which remained were replaced by raw 18-year-old recruits of the Training Reserve's Graduated battalions. The mobile component lost 24 cyclist regiments, four cyclist battalions and two artillery batteries, and the fixed port defences and Mixed Battalions were reduced, leaving the latter at about 50 per cent strength and largely untrained.\nCrisis\nThe onslaught of the German offensive in March 1918 significantly accelerated the transfer of home army troops to the continent, and by the end of the month plans were in place to send 20,000 troops per day. The minimum age limit was relaxed, and the Graduated Battalions were denuded of both young recruits and experienced instructors. French suggested the mobilisation of the VF as a means of filling the gaps in the home army, but before that issue was settled General Sir William Robertson replaced him as the home forces commander-in-chief in May 1918. Robertson found the home army on the verge of crisis. Communications, organisation and leadership were poor. Defences were neglected, guns were worn and small arms were in short supply. Logistics systems failed and facilities were inadequate. Morale was low, discipline lax and the troops, many of whom were in poor physical shape, lacked motivation. His suggested remedies met with negative responses from the Admiralty and War Office. Although he was able to identify improvements when he revisited some units in July, he regarded the Australian Overseas Training Brigade as \"the best material we are likely to have\". The strength of the home army was about a fifth of that considered necessary in 1914. It relied on under-aged, largely untrained regular troops and low-category territorials, supported by part-time amateur auxiliaries recruited from tribunal men, the medically unfit and the over-aged.\nIn July, relatively fit members of the VF over 35 years old and not employed in key industries were asked to volunteer for two or three months permanent service in Special Service Companies. The War Office hoped to mobilise 15,000 volunteers to reinforce the depleted ranks of the territorial cyclist battalions, but fewer than 10,000 answered the call. Most were deployed to East Anglia, while some were attached to the Humber and Tyne garrisons and others were stationed in Scotland. By August, recruitment difficulties had eased and the military situation in France improved to the extent that, on 3 August, General Sir Henry Wilson, the Chief of the Imperial General Staff, declared that there was no longer any threat of invasion. The volunteers were released with a letter of thanks and a free pair of boots. The Director-General of the Territorial Force, Lord Scarbrough, claimed that they had \"enabled the government to meet a critical situation\", but the War Office regarded the volunteers' lacklustre response as proof of their long-held view that the organisation was militarily worthless.\nWith the threat to the homeland now assessed at a raid of no more than 5,000 troops, the War Office produced plans in September for winding down the home defences to concentrate on training reinforcements for the field army. The RDC, coastal defence artillery, Royal Engineers, anti-aircraft units and some of the Mixed Brigades were to be retained. The training system was to be rationalised into two elements, the Training Reserve's Young and Graduated battalions, whose young recruits formed the mobile component of the home defences, and the Special Reserve battalions of the army's 76 line regiments. The latter would, in the event of a raid, reinforce the mobile element, as would contingents of Dominion forces then in-country. The only specific role allocated to the VF was for the 52 battalions already assigned to the defence of London. The remainder, reflecting the military authorities' assessment of their worth, were simply to be pooled and used if necessary as reinforcements. Most of the forces now allocated to home defence were organised into two concentrations: XXIII Corps, headquartered at Brentwood and comprising three second-line territorial divisions (now composed almost entirely of Graduated battalions), five Mixed Brigades, one cyclist brigade, six cyclist battalions, six batteries of heavy artillery and an armoured train; and the Independent Force, headquartered at Canterbury and comprising one cyclist division, three cyclist brigades, one cyclist battalion, two Mixed Brigades and four batteries of artillery. The Special Reserve and Dominion reinforcements would, if called upon, be organised into 22 Composite brigades, 15 of infantry and seven artillery.\nPost-war\nThe Territorial Force began to demobilise in December 1918, and an extended debate about its future was started. In the absence of any invasion threat, there was no requirement to maintain a significant force for home defence, and with conscription established as the means of expanding the regular army in a major conflict, there was no need to maintain a body of volunteers for this role. The only purpose military authorities could find for the Territorial Force was to reinforce the army in medium-scale conflicts within the empire. Accordingly, the War Office recommended in March 1919 that the force should be liable for service overseas, a condition of service that territorial representatives recognised as necessary. It was officially reconstituted in 1921 by the Territorial Army and Militia Act 1921 and renamed in October as the Territorial Army. The same legislation resurrected the militia as a replacement for the Special Reserve. The latter was only some 9,000 strong when a committee chaired by General Alexander Hamilton-Gordon recommended in July 1919 that it should be abolished, and it effectively ceased to exist by the end of the year.\nHaving been absorbed into the RDC during the war, the National Reserve was not revived. The RDC continued to guard German prisoners of war into 1919, and was gradually disbanded as the prison camps were closed. It was reconstituted in 1922 as the National Defence Corps, which became Home Defence Battalions on the outbreak of the Second World War, with the same role of guarding vulnerable points as its First World War predecessor. For the VF, drills became optional within a week of the cessation of hostilities in France, and by the end of 1918 most VF battalions had abandoned them. There was some hope within the movement that it would be continued after the war, possibly as a reserve to the Territorial Army, but in September 1919 the War Office announced that all but the motor units, regarded as useful in the event of transport strikes, would be disbanded.\nIn the absence of any invasion, the practical benefit provided by the volunteers to the home defence effort is difficult to quantify. The government invested in the volunteer movement less for its military potential and more as a political gesture, designed to appease, contain and direct the traditional Edwardian middle-class sense of patriotism and duty. Volunteers spent over a million man-hours digging the defences of London and millions more guarding vulnerable points around the country, all unpaid. But if the volunteers had been called upon in 1914, they would likely have clogged the roads and hampered the deployment of the regular and territorial forces, and risked execution as franc-tireurs while inflicting limited damage on the invader.\nThe military authorities remained entirely unconvinced of the volunteers' military value throughout, and caused great resentment by their lack of sufficient recognition after the war for the services rendered. The 4,000 volunteers who served the full three months in the Special Service Companies in 1918 were granted enlisted soldier status, entitling them to veteran's financial support, and National Reservists who served in the RDC or the Provisional Rifle Brigade battalions received a gratuity. For the vast majority of volunteers, however, there was little official recognition. Those who enrolled after May 1916 and completed the minimum standards of training were awarded a certificate signed by the king&nbsp;– a \"printed letter of lukewarm thanks, signed with a facsimile of an indecipherable signature\", according to one recipient&nbsp;– but the War Office refused to grant any home defence medal, a grievance felt also by those territorials who had been held back as training staff against their wishes.\nFootnotes\nReferences\nBibliography\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*"
    }
  ]
}