{
  "content": [
    {
      "type": "text",
      "text": "# Brit Asia TV Music Awards__disambig_1\n\n}}\nThe Brit Asia TV Music Awards, also known as Brit Asia TV World Music Awards or the abbreviation BAMA, is an awards show that has been held annually in the United Kingdom since 2010 (except in 2016), usually in October. The awards show is produced by Brit Asia TV. Award winners are decided by public voting on a website from a list of nominees presented by the event organizers at a nomination party. Website desiblitz called it \"UK's largest celebration of South Asian music\" and \"the biggest awards in the British Asian Music calendar\".\nHistory\nThe inaugural edition of the BAMA was in 2010, two years after the establishment of the Brit Asia TV channel in April 2008. The event was held in Birmingham, the so-called \"Bhangra capital of the world\". Birmingham also held most of the following editions, except the 2011 and 2018 editions held in London, and the 2019 edition held in Wembley. The editions between 2012 and 2017 were all held at the same venue, the Utilita Arena Birmingham (under different names).\nThe first event was hosted by comedian Hardeep Singh Kohli, as were the 2011 and 2012 editions. Other hosts who appeared more than once include Sunny and Shay, co-hosting in 2014 and 2015, and Sukhi Bart who hosted the 2014, 2015 and 2017 events.\nThe 2016 event, originally planned to be held on 5 November 2016 was cancelled due to Brit Asia TV re-branding and restructuring. It was rescheduled to 4 March 2017, thus making it the 2017 event, cancelling the 2016 one.\nThe 2019 event was the first event to have a title sponsor, with the title \"BritAsia TV Presents Kuflink Music Awards 2019\". , the latest edition of the BAMA was the 2019 event, and no nominees were published, nor was any other announcement made regarding the 2020 event. Another event organized by BritAsia TV, the BritAsia TV Punjabi Film Awards 2020, was postponed due to COVID-19 pandemic concerns.\nAward winners\n2010\nThe inaugural 2010 event was held at Symphony Hall, Birmingham on 2 May 2010. It was hosted by Hardeep Singh Kohli. The nominees' announcement party was held at the Ricoh Arena in Coventry. Award winners were:\n* Best Album: Unforgettable by Imran Khan\n* Best Single: \"Down\" by Jay Sean\n* Best Male Act: Jaz Dhami\n* Best Female Act: Miss Pooja\n* Best Band: DCS\n* Best Urban Act: Jay Sean\n* Best DJ: DJ H\n* Best Newcomer: JK\n* Best Producer: Sukshinder Shinda\n* Best Urban Asian: Mumzy Stranger\n* Best International Artist: Babbu Mann\n* Best Alternative Act: Shiva Sound System\n* Best Video: \"Ghum Sum\" by Sukshinder Shinda\n* Outstanding Achievement: Malkit Singh\n* Lifetime Achievement: Avtar Singh Kang\n2011\nThe 2011 event was at the Hammersmith Apollo, London, on 1 October 2011. It was hosted by Hardeep Singh Kohli. The nominations party was held on 25 August 2011 in Birmingham Award winners were:\n*Best Newcomer: Garry Sandhu\n*Best International Act: Satinder Sartaaj\n*Best Non-Asian Music Produce: rKray Twinz\n*Best Video: \"Pumbeeri\" by Foji\n*Best Male Act: Garry Sandhu\n*Best Female Act: Preeya Kalidas\n*Best Band: Jazzy B and Band\n*Best Urban Asian Act: The Truth\n*Best Single: \"Moorni\" by Panjabi MC\n*Best Album: Gabru Panjab Dha by JK\n*Best Asian Music Producer: Panjabi MC\n*Best Club DJ: DJ Kayper\n*Best Alternative Act: Nasha Experience\n*Best Song Writer: Jandu Littranwala\n*Lifetime Achievement Award: Bhujhangy Group\n2012\nThe 2012 event was held at the National Indoor Arena, Birmingham on 6 October 2012. It was hosted by Hardeep Singh Kohli. The nominations party was held on 23 August 2012 at the Jewellery Quarter, Birmingham. Award winners were:\n* Best Newcomer: Jay Status\n* Best International Act: Honey Singh\n* Best Non Asian Music Producer: Naughty Boy\n* Best Music Video: \"Hukam\" by Jazzy B\n* Best Male Act: Jazzy B\n* Best Female Act: Kanika Kapoor\n* Best Band: The Entourage live band\n* Best Urban Asian Act: Roach Killa\n* Best Single: \"Jugni Ji\" by Dr Zeus & Kanika Kapoor\n* Best Album: Judaa by Amrinder Gill\n* Best Asian Music Producer: Dr Zeus\n* Best Club DJ: Jags Klimax\n* Best Dressed Act: Sukshinder Shinda\n* Best Songwriter: Amrit Saab\n2013\nThe 2013 event was held on 12 October 2013 at the National Indoor Arena, Birmingham. It was hosted by Kulvinder Ghir. The nominations party was held on 4 September 2013 at the Edgbaston Cricket Ground in Birmingham. Award winners were:\n*Best Newcomer: San2\n*Best International Act: Diljit Dosanjh\n*Best Live Band: The Legends Band\n*Best Club DJ: Sonny Ji\n*Best Female Act: Sarika Gill\n*Best Male Act: Jaz Dhami\n*Best Non-Asian Music Producer: Naughty Boy\n*Best Urban Asian Act: Roach Killa\n*Best Songwriter: Kashmir Thakarwal\n*Best Music Video: \"We Doin’ It Big\" by RDB\n*Best Urban Asian Single: \"Satisfya\" by Imran Khan\n*Best Bhangra Single: \"Kharku\" by Diljit Dosanjh\n*Best Album: Back 2 Basics by Diljit Dosanjh\n*Best Asian Music Producer: Tru Skool\n*Lifetime Achievement: Surinder Shinda\n2014\nThe 2014 event was held on 4 October 2014 at the National Indoor Arena, Birmingham. It was hosted by Sunny and Shay and by Sukhi Bart. The nominations party was held at the Edgbaston Cricket Ground on 28 August 2014. Award winners were:\n* Best Newcomer: Bloodline\n* Best International Act: Diljit Dosanjh\n* Best Non-Asian Music Producer: Mumzy Stranger\n* Best Music Video: \"Daddy Da Cash\" by RDB feat. T-Pain\n* Best Male Act: Jazzy B\n* Best Female Act: Kanika Kapoor\n* Best Band: The Legends Band\n* Best Urban Asian Act: Raxstar\n* Best Single: \"Zulfa\" by Jaz Dhami\n* Best Album: 12B by B21\n* Best Asian Music Producer: Partners in Rhyme\n* Best Club DJ: AJD\n* Best Urban Single: \"Swag Mera Desi\" by Manj Musik and Raftaar\n* Best Songwriter: Satinder Sartaaj\n* Lifetime Achievement Award: Apache Indian\n2015\nThe 2015 event was held on 3 October 2015 at Barclaycard Arena, Birmingham. It was hosted by Sunny and Shay and by Sukhi Bart. The nominations announcement party was held at Villa Park, Birmingham, on 5 September 2015. Award winners were:\n* Breakthrough Act: Zack Knight\n* Best Songwriter: Abbi Fatehgarhia\n* Best Dance Group: Gabru Punjab De\n* Best Deejay: DJ Dips\n* Best North American Act: Mickey Singh\n* Best Live Band: The Legends Band\n* Bollywood Record of the Year: \"Lovely\" by Dr Zeus and Kanika Kapoor\n* Best Urban Asian Act: Imran Khan\n* Best Bollywood Act: Kanika Kapoor\n* Best UK Album: Chapter V by DJ Vix\n* Best World Album: Mitti Di Bawa by Ranjit Bawa\n* Best Female Act: Kanika Kapoor\n* Best Male Act: Diljit Dosanjh\n* Best Producer: Dr Zeus\n* Best Music Video: \"Imaginary\" by Imran Khan\n* Best UK Single: \"Imaginary\" by Imran Khan\n* Best World Single: \"Patiala Peg\" by Diljit Dosanjh\n* Lifetime Achievement Award: Gurcharan Mall\n2017\nThe 2017 event was held on 4 March 2017 at Utilita Arena Birmingham. It was hosted by Sukhi Bart and Mandy Takhar. The nominations party was held at the Park Regis Hotel in Birmingham on 10 February 2017. Award winners were:\n* Best Breakthrough Act: Akhil\n* Best Bollywood Act: Badshah\n* Best Music Producer: Tru Skool\n* Best Music Video: \"Do you know\" by Diljit Dosanjh\n* Best Male Act: Diljit Dosanjh\n* Best Female Act: Sunanda Sharma\n* Best Band: The Legends Live Band\n* Best Urban Asian Act: Zack Knight\n* Best Single: \"Gani\" by Manni Sandhu\n* Best Album: One Time 4 Ya Mind by Tru Skool\n* Best Club DJ: Kray Twins\n* Best Dance Group: Nachda Sansar\n* Bollywood Record of the year: Kala Chashma\n* Best Songwriter: Satinder Sartaaj\n* Lifetime Achievement Award: Channi Singh\n2018\nThe 2018 event was held on 6 October 2018 at Park Plaza Westminster Bridge in London. It was hosted by Preeya Kalidas and Apache Indian. Award winners were:\n* Best DJ: DJ Frenzy\n* Breakthrough Act: G. Sidhu\n* Best Lyricist: Sidhu Moose Wala for \"So High\"\n* Best Music Video Director: Sunny Dhinsey for \"Udaarian\"\n* Bollywood Track of the Year: \"Dilbar\" by Neha Kakkar\n* Best Male Act: Guru Randhawa\n* Best Non-Traditional Asian Act: Steel Banglez\n* Best Female Act: Jasmine Sandlas\n* Music Producer of the Year: Vee\n* UK Act of the Year: JK\n* Album of the Year: CON.FI.DEN.TIAL by Diljit Dosanjh\n* Music Video of the Year: \"Udaarian\" by Satinder Sartaaj\n* Track of the Year: \"Lahore\" by Guru Randhawa\n* Special Recognition: Raghav\n* Outstanding Achievement: Panjabi MC\n* Lifetime Achievement Award: Arif Lohar\n2019\nThe 2019 event, originally planned for 28 September 2019, was held on 30 November 2019 at SSE Arena, Wembley. It was hosted by Jassa Ahluwali and Kiran Rai. The event was sponsored by Kuflink. Award winners were:\n* Track of the Year: \"Legend\" by Sidhu Moosewala\n*Best Album: PBX 1 by Sidhu Moose Wala\n* Best UK Male Act: Gurj Sidhu\n* Best UK Female Act: Rika\n* Best International Male Act: Sidhu Moose Wala\n* Best International Female Act: Jasmine Sandlas\n* Best Breakthrough Act: F1rstman\n* Lifetime Achievement Award: Balwinder Safri\n* Best Collaboration: \"Dance\" by F1rstman, Juggy D, H Dhami, Mumzy and Raxstar\n* Best Music Video: \"Yaar Chadeya\" by Sharry Mann\n* Best Music Video Director: Navjit Buttar\n* Best Music Producer: Manni Sandhu\n* Best Lyricist: Sidhu Moosewala\n* Best Non-Traditional Asian Act: Steel Banglez\n* Best DJ: AJD\n* Best Social Media Star: Mahek Bukhari\nReferences\nExternal links\n*"
    }
  ]
}