{
  "content": [
    {
      "type": "text",
      "text": "# Britain's Great War\n\n| editor               = Andrea Carnevali\n| location             =\n| cinematography       = Ian Salvage\n| camera               =\n| runtime              = 60 minutes\n| company              = BBC Productions\n| channel              =\n| first_aired          =\n| last_aired           =\n| related              =\n}}\n'Britain's Great War' is a British documentary television series that broadcast on BBC One 27 January 2014. The documentary series is presented by Jeremy Paxman and was produced by the Open University and BBC Productions. The series shows how World War I affected Britain and its people. The series leads the BBC World War I centenary season.\nProduction\nJeremy Paxman, the presenter of the series, said: \"The trouble with so much of our understanding of World War One is that it is seen through the prism of the prejudices of the hundred years which have followed it. It's an amazing and important story which deserves to be viewed afresh.\" A re-version of the series will be released for BBC Learning. The series consists of four hour-long episodes.\nEpisode list\n{| class=\"wikitable plainrowheaders\" style=\"background:#FFFFFF;\"\n!style=\"background: #bfe0bf;\"| #\n!style=\"background: #bfe0bf;\"| Title\n!style=\"background: #bfe0bf;\"| Original air date\n!style=\"background: #bfe0bf;\"| UK viewers(millions)\n|-\n|Aux4=4.65\n|ShortSummary=The early stages of the war and fear of invasion Paxman relates how Britain expanded its small army of 80,000 men in France and mobilised 1,500,000 volunteers and how the war was brought to Britain's civilian population by German air and sea attacks.\n|LineColor=bfe0bf\n}}\n|Aux4=3.13 (overnight)\n|ShortSummary=The sinking of the Lusitania brought home the nature of modern warfare and Britain's unpreparedness. Lord Kitchener was discredited and replaced by David Lloyd George who turned the country into a war machine with women in the factories to make bombs and bullets while the men were sent to the frontline.\n|LineColor=bfe0bf\n}}\n|Aux4=3.22 (overnight)\n|ShortSummary=Britain was dependent on imported food and Germany attempted to starve Britain into submission by submarine blockade. Farms, in crisis with their men and horses on the frontline, were  worked by 84,000 disabled soldiers, 30,000 German prisoners of war and over 250,000 women.  To assist this the government ordered every scrap of land be turned over to allotments tended by the elderly, children and women. In January 1918 rationing was introduced. Women filled every job vacated by enlisted men including the police.\n|LineColor=bfe0bf\n}}\n|Aux4=3.02 (overnight)\n|ShortSummary=The final year of the war, thousands of soldiers returned with limbs missing, more with facial injuries, grieving parents held seances in the hope of contacting their dead sons. Britain was on the brink of defeat. The Germans launched their \"Spring Offensive\" that ultimately they could not maintain with a starving and demoralized homeland in contrast to Britain's well organized supply chain. In August with American reinforcements a huge force was unleashed on the Germans which within a hundred days the German's agreed an armistice. The war had changed Britain forever, nine out of ten men returned with the greatest losses in proportion among the upper classes which led to social change, with votes for some women, full employment benefitting the poorest in society and leaving the country more equal and more democratic.\n|LineColor=bfe0bf\n}}\n|}\nMedia\nThe television series is an accompaniment to Jeremy Paxman's book ''Great Britain's Great War.\nReception\nRatings\nThe four episodes had viewing audiences of 17.4%, 12.7%, 13.2% and 12.9% respectively.\nCritical reception\nDavid Chater of The Times called the series \"superb\" and said it \"does justice to the unimaginable scale of a cataclysm\". Clarissa Tan from The Spectator said Paxman presented \"with assuredness and gravitas\". Hugo Rifkind, another journalist for The Times, said: \"Documentaries must cater for those who know lots and those who know nothing. Jeremy Paxman gets the balance right\". John Crace writing in The Guardian'' described the series as disconnected. He went on to describe it as if there was a contextual void at the centre. It wasn't that the series demanded a great historical debate on the causes of the war – though it did seem perverse that the assassination of Archduke Ferdinand, the Balkans or European imperialism didn't get a mention. However Nigel H. Jones, writing for The Daily Telegraph, commented on how moving the series was, defying his low expectations.\nAfter the second episode was shown, Jeremy Paxman faced a furious backlash after calling the extreme conscientious objectors in the First World War \"cranks\". The Belfast Telegraph reported a spokesman for the campaign group Peace Pledge Union describing Paxman's remarks as \"unhelpful and silly\". The spokesman then went on to say \"One of the main issues they felt strongly about was the coercive power of the state to force people to kill, and if that is cranky I wish there were more of them. It seems to me a very laudable thing to do.\"\nReferences\nExternal links\n*\n*\n*\n* [http://www.open.edu/openlearn/tv-radio-events/tv/britains-great-war/ Open University website]"
    }
  ]
}