{
  "content": [
    {
      "type": "text",
      "text": "# British Academy Scotland Awards\n\nThe British Academy Scotland Awards are presented annually at an awards ceremony organised by BAFTA Scotland.\nHistory\nThe annual British Academy Scotland Awards were launched in 2004 to recognise outstanding achievement by individuals working in the Film and Television industry in Scotland. A long list of potential nominees is put to a popular vote of BAFTA Scotland members. A jury of industry professionals vote for the overall winner from the short list created by the members. A members of the BAFTA Scotland Committee will chair each of the juries.\nThe awards were cancelled in 2010 and prizes at the 2011 ceremony given for films released over the previous 2 years.\nOver the years the annual event has taken place at various locations including the Glasgow City Halls and the Glasgow Science centre. From 2011 to 2018 the event was held at the Radison Blu Hotel in Glasgow. As of 2019, the ceremony has been hosted at the Doubletree by Hilton Glasgow Central.\nIn 2015, the British Academy Scotland Award trophy was redesigned by Scottish designer Oliver J. Conway who was an apprentice of the original trophy designer, Allan Ross.\nHosts\n*Lorraine Kelly (2007, 2009)\n*Edith Bowman (2008, 2012, 2013, 2015–present)\n*Kevin Bridges (2011)\n*Hazel Irvine (2014)\nAwards categories (competitive)\nCategories as of 2016.\nOutstanding Contribution to Film/Television\nEvery year, a special award is presented to an individual in recognition of their contribution to Scottish Film and/or Television.\n{| class=\"sortable wikitable\"\n|+\n|-\n! Year\n! colspan=2| Recipient\n! class=unsortable| Notes\n! class=unsortable| Ref(s)\n|-\n| 2004\n|\n|\n| Actor\n|\n|-\n| 2009\n|\n|\n| Director, Screenwriter\n|\n|-\n| 2011\n|\n|\n| Actor, Author\n|\n|-\n| 2012\n|\n|\n| Actor, Comedian\n| |\n|-\n| 2013\n|\n|\n| Actor\n|\n|-\n| 2014\n|\n|\n| Television presenter, Journalist\n|\n|-\n| 2015\n|\n|\n| Actor\n|\n|-\n| rowspan=\"3\"| 2016\n|\n|\n| Film and television director (Awarded to the founders of Sixteen Films)\n| rowspan=\"3\"|\n|-\n| data-sort-value=\"O'Brien\" |\n|\n| Producer, Production Manager (Awarded to the founders of Sixteen Films)\n|-\n|\n|\n| Screenwriter (Awarded to the founders of Sixteen Films)\n|-\n| 2017\n|\n|\n| Writer\n|\n|-\n| 2018\n|\n|\n| Actor, singer, director, producer, writer, activist\n|\n|-\n| 2019\n|\n| Greg Hemphill, Ford Kiernan and Michael Hines\n| Creative team behind Still Game\n|\n|-\n| 2020\n|\n| Stanley Baxter\n| Actor, comedian, impressionist, author\n|\n|-\n| 2021\n|\n| None\n| No Award Given\n|\n|-\n| 2022\n|\n| Peter Capaldi\n| Actor, Director, Writer\n|\n|-\n|2023\n|\n|Shirley Henderson and Stuart Wilson\n|Actress, Sound Engineer\n|\n|}\nSee also\n* British Academy of Film and Television Arts\nReferences\nExternal links\n* [http://www.bafta.org/scotland/ BAFTA in Scotland]"
    }
  ]
}