{
  "content": [
    {
      "type": "text",
      "text": "# Broadway expedition\n\n|result = British victory\n|combatant1 =\n* British East India Company\n|combatant2 =  Qing China\n|commander1 = James Scott\n|commander2 = Unknown\n|strength1 = 2 steamers1 corvette3 other ships\n|strength2 = 15 junks6 forts\n|casualties1 = 3 wounded\n|casualties2 = 9 junks destroyed6 forts captured105 guns captured\n|notes =\n}}\nThe Broadway expedition was a British military expedition that explored the Broadway River (present-day Xi River) in Guangdong province, China, on 13–15 March 1841 during the First Opium War. The river was also called the Inner Passage or Macao Passage as it served as an intricate channel from the Portuguese colony of Macao to the Chinese city of Canton (Guangzhou). The expedition was the first time a European vessel traversed the passage, and was believed by the Chinese to be inaccessible to foreigners due to the shallowness and intricacy of the channel as well as the forts along the banks. The iron steamship Nemesis had a shallow draught of , which was a major advantage in navigating the river. Despite being over 600 tons burden, the ship was able to navigate through a river that frequently had less than 6 feet of water and through mud in areas of only .\nOperations began on the morning of 13 March in Macao. Captain James Scott commanded the fleet, which consisted of HMS Samarang and the East India Company steamships Nemesis and Atlanta. A further three boats accompanied the Nemesis; two from the Samarang and one from the Atlanta. On board the Nemesis of Captain William Hall was Plenipotentiary and Chief Superintendent of British Trade Charles Elliot,  Deputy Superintendent of Trade Alexander Johnston, and interpreters John Morrison and Robert Thom. A British officer wrote that the interpreters' \"knowledge of the language and their good judgment frequently enlisted in our favour the people of the country, who might have offered great annoyance, and they were often able to mitigate the hardships even of war itself.\"\nForts captured\nList of forts captured (and the number of guns) in chronological order on 13 March:\n*Motow – 13\n*Tei-yat-kok – 12 to 14\n*Houchung – 14 to 15; defended by nine war junks of which seven were destroyed and two escaped; 28 guns captured\n*Fie-shu-kok – 7\nFurther up the river, the fleet reached the trading town of Heangshan (Zhongshan). The Nemesis was in chase of the two junks, which had earlier escaped and were followed by several mandarin boats. One junk was captured; it carried four guns.\n*Sheongchap – 8\nOn 14 March:\n*Kong-how (or Hong-how) – 9\nOn 15 March:\n*One war junk – 7\nGallery\nFile:Canton River and adjacent islands.jpg|Map showing the track of the Nemesis from Macao and the forts captured\nFile:Macao Passage.jpg|Macao Passage, Canton River\nReferences\nBibliography\n*Bernard, William Dallas; Hall, William Hutcheon (1847). [https://books.google.com/books?id=2pZFAAAAIAAJ The Nemesis in China] (3rd ed.). London: Henry Colburn.\n*Bingham, John Elliot (1843). [https://books.google.com/books?id=8TGwqgOCFR0C Narrative of the Expedition to China] (2nd ed.). Volume 2. London: Henry Colburn.\nFurther reading\n*[https://books.google.com/books?id=J9Q1AAAAMAAJ&pg=PA281 Bulletins of State Intelligence]. Westminster: F. Watts. 1841. pp.&nbsp;281–286."
    }
  ]
}