{
  "content": [
    {
      "type": "text",
      "text": "# Broadmount, Queensland\n\n| pop                 =\n| pop_year            =\n| pop_footnotes       =\n| established         =\n| postcode            = 4702\n| timezone            = AEST\n| utc                 = +10:00\n| dist1               = 41.7\n| dir1                = SE\n| location1           = Rockhampton CBD\n| dist2               = 53.7\n| dir2                = S\n| location2           = Emu Park\n| dist3               = 59.1\n| dir3                = S\n| location3           = Yeppoon\n| dist4               = 665\n| dir4                 =NNW\n| location4           = Brisbane\n| lga                 = Shire of Livingstone\n| stategov            = Keppel\n| fedgov              = Capricornia\n| maxtemp             =\n| mintemp             =\n| rainfall            =\n}}\nBroadmount is an abandoned riverside town in the Livingstone Shire, Queensland, Australia. It is within the locality of Thompson Point. From 1899 to 1929 it operated as a port serving Central Queensland.\nGeography\nBroadmount is on the northern bank of the mouth of the Fitzroy River.\nHistory\nThe town was officially called Herbert until 1923. The name Herbert presumably derives from the parish name, which in turn was presumed to be named after Robert Herbert, the first Premier of Queensland. However, the local name of Broadmount was in use since the 1880s. The name Broadmount comes from the mountain Broadmount, which in turn was named by Matthew Flinders of HMS Investigator on 10 August 1802.\nOn 30 January 1866 the Queensland Government offered 44 town lots of  each in the town of Herbert (as it was then called) at £8 per acre (2 roods being half an acre). All of the lots were sold. On 8 May 1868 a further 149 town lots were offered in Herbert ranging from  in area. However, none of these lots were sold. In 1874 it was noted that none of the land sold at Herbert had been developed due to its inaccessibility overland to Rockhampton.\nMeanwhile,  Rockhampton (further upstream on the Fitzroy River) was an important port in Queensland with significant exports rising to approximately £1 million of exports each year by the 1880s and 1890s. However the Fitzroy River up to Rockhampton was not consistently deep enough with calls to the Queensland Government to dredge the river from at least 1862. As a consequence larger ships increasingly preferred to remain in Keppel Bay and use lighters to transfer their passengers and cargo up the Fitzroy River. In 1865 depth soundings at Broadmount established that there was  of water even at low tide, sufficient for even the largest ships of that time. From 1872 there were calls for Herbert/Broadmount  to be established as a port connected to Rockhampton by either rail or road. In 1874 it was suggested that coastal vessels heading north to Cooktown were no longer interested to service Rockhampton and calls made for a wharf to be established at Broadmount. However, people with vested interests in the success of the town of Rockhampton were concerned that the establishment of a port at Broadmount would create a rival to Rockhampton and in 1877 there was a counter-proposal to establish port facilities at Central Island (probably the now unnamed island at )  downstream of Rockhampton which could easily be linked by road or rail over flat land to Rockhampton. Others favoured deeping the river so that the port could remain in Rockhampton. The merits of the various port proposals and others include ports at Emu Park and a Port Alma scheme on the southern bank of the mouth of the river continued to be debated for some years without any decision being taken. In December 1893 a committee established by the Rockhampton Chamber of Commerce investigated the matter thoroughly and dismissed all but two proposals, Broadmount and Port Alma, ultimately favouring Port Alma.\nHowever, the construction of North Rockhampton to Emu Park railway line in 1888 had considerably reduced the distance (and hence the cost) for a railway link to Broadmount compared to Port Alma and the construction of the meatworks at Lakes Creek had created another significant exporter on the northern side of the river, favouring Broadmount over Port Alma. On 26 September 1895 the Queensland Government announced that it would build a railway line to Herbert/Broadmount. A Queensland Railways Department report released in October 1895 revealed their concerns about building a railway line to Port Alma over large areas of flood-prone land. Although the debate continued within the Queensland Parliament, work was already underway on the boring for the wharf at Broadmount by November 1895 and on the detailed survey of the railway route. In December 1895, the Minister for Railways announced that the cost of construction of the railway line and wharf was estimated at £5,000.  In January 1896 a provisional hotel licence was issued to Joseph Cunningham who was constructing a hotel on the corner of Wharf and Carl Streets in Broadmount.\nContrary to the estimates, in July 1896, the Queensland Government awarded the tender for the construction of the wharf to  J. Watson for £16,081 7s. However, it was not until February 1897 that the government called for tenders to extend the railway line to Broadmount together with a railway bridge across the Fitzroy River to connect the Rockhampton railway station and the North Rockhampton railway station (which were then part of disconnected railway systems). In April 1897 it was announced that the tender of G.C. Willcocks of £41,187 2s 4d had been accepted. The railway was complete and able to be used by October 1897 but the wharf was not yet complete. On 1 January 1898 railway services commenced on the new branch railway, which opened without any ceremony and despite the wharf still being 10 weeks from completion. The journey between North Rockhampton railway station and Broadmount railway station took one and a quarter hours.\nThe wharf was still not complete in August 1898 but concerns were already raised that the necessary dredging of the port area had not taken place. While the railway and the wharf were projects of the Queensland Railways Department, the dredging was the responsibility of the Department of Harbours and Rivers and outside of the Railway Department's control. Further there was a dispute about which channels should be dredged and whether one channel should be allowed to remain as a S-bend or be straightened (at considerably greater expense), raising concerns about the new port's abilities to accommodate the largest ships. In October 1897 the wharf was still incomplete and the new dam created to supply the water needed for the railway and to supply the berthed ships remained empty. By February 1899 the wharf was completed but had no lighting and so could not become operational as the coastal ships would be arriving at night. However, the dam was full of water following heavy rain. However, as the heavy rain continued through to the month, the wharves at Rockhampton were flooded and so the coastal steamer Premier was forced to use Broadmount wharf. On 1 March 1899 it was announced that the coastal steamer Premier would now berth at the new Broadmount wharf. Premier provided a daily service between Gladstone and Broadmount, travelling via The Narrows (between Curtis Island and the Queensland mainland) taking  hours each way. In June 1899, the rail bridge over the Fitzroy River was opened and officially named the Alexandria Bridge. The bridge enabled goods from Central Queensland to be carried by rail through to the new port.\nBroadmount Provisional School opened circa May 1901 and closed circa 1906 due to low student numbers.\nDespite the time and cost to establish the port at Broadmount, it never received the level of use anticipated. Ongoing issues with dredging meant it was never a deep water port capable of accommodating the largest ships. In December 1903 the North Coast railway line between Rockhampton and Gladstone was opened. As Gladstone had an excellent harbour, it quickly became the preferred port for Central Queensland. Attempting to protect their investment in Broadmount, the government introduced a system of higher freight charges on the railway line to discourage its use in favour of using Broadmount port. In 1912 a railway line was built to Port Alma which had better natural deepwater facilities than Broadmount and the Lakes Creek meatworks switched to exporting via Port Alama. The Broadmount port and rail link never generated sufficient revenue to cover the costs of its construction and was regarded as a \"white elephant\". The railway line (and hence effectively the port) was closed on 19 August 1929. In September 1930 the wharf was damaged in a fire.\nReferences\nExternal links\n* [https://gisservices.information.qld.gov.au/arcgis/rest/directories/historicalscans/cad_scans/cad-map-town-broadmount-1974.jpg Town map of Broadmount, 1974]"
    }
  ]
}