{
  "content": [
    {
      "type": "text",
      "text": "# Broadwell, Warwickshire\n\n| civil_parish=          Leamington Hastings\n| post_town=             Rugby\n| postcode_area=         CV\n| postcode_district=     CV23\n| dial_code=\n| constituency_westminster= Kenilworth and Southam\n| shire_district= Rugby\n| shire_county=  Warwickshire\n}}\nBroadwell is a village in Warwickshire, England in the civil parish of Leamington Hastings roughly midway between Dunchurch and Southam on the A426 road.\nHistory\nIn 1086, the Domesday Book records that the chief estate of Leamington was held by Hasculf Musard. Broadwell (like the neighbouring villages of Leamington Hastings, Hill and Kites Hardwick) was once a manor in its own right. Joan Hastang (of the family whose name is borne by Leamington Hastings) was allotted Broadwell in 1375. According to Prof. Louis Salzman's History of the County of Warwick, the ...last mention of Bradwell (sic) as a separate manor is in the inquisition post mortem on Humphrey Stafford in 1545. Broadwell is one of three villages of that name in central England. The other two are in Gloucestershire – one between the towns of Moreton-in-Marsh and Stow-on-the-Wold, the other a few miles west of Lechlade on the upper River Thames.\nThe villages in Leamington Hastings parish are farming settlements. Today, there is a mix of sheep and arable. However, Louis Salzman records that much of arable land had once been pasture. This is borne out in ''Mr Sponges's Sporting Tour written in 1853 by R.S. Surtees which refers to: ... the wide-stretching grazing grounds of Southam and Dunchurch.'' Today, Broadwell compromises roughly 70 households. There are four farms in the village itself (Home Farm, Croftlands Farm, Broadwell House Farm and Hospital Farm) and several smallholdings. Other farms border the village. Broadwell is in the broad flat valley of the River Leam. The valley is bounded to the north by the Rugby ridge and Lawford Heath, to the south by a low range of upland which forms part of the Northamptonshire & Warwickshire ironstone hills. The village sits on fossil-rich Blue Lias clay, hence the proximity of several cement works, all now closed.\nArchitecturally, Broadwell is somewhat unprepossessing. The village green is surrounded by 18th and 19th century cottages, post-World War II council houses, 1970s bungalows and 1990s large detached houses. The mixture on Main Street and Hayway Lane (formerly known as Green Lane and Elm Road) is similar although there is no Local Authority housing. Since the late '80s/early 90s, two bungalows and nine detached houses have been built as infill. The village has an old forge, a 17th-century blacksmith shop, which is a Grade II listed building. The building, although derelict and structurally unsafe (with an Acrow prop supporting the roof), cannot be demolished, because of the protection order, and would be unviable to restore.\nHistorically, farming has always been the principal activity, although in the 20th century some residents worked in the Charles Nelson Company's cement works in neighbouring Stockton. Today, many residents are retired; the rest work away from the village, with a considerable number commuting every day. The A426 road is just outside the village, and the M40, M1 and M6 are all within a 15-mile radius. Until the 1960s, there was a railway station ( on the Leamington to Weedon line) a mile from the village. Today, there is a bus service to neighbouring towns. However, most families in Broadwell have at least one car.\nAmenities\nThere is no shop or public house in Broadwell. In part, the lack of a pub is due to the village's nonconformist tradition; Broadwell has a substantial Methodist chapel. The village also has a small Church of England chapel, the Church of the Good Shepherd, which is in the parish of Leamington Hastings. Services are held monthly in the Church of the Good Shepherd. Previously, however, the village did have a small post office selling stamps and a small range of what might be classed as 'essential items.'  It was based at the rear of a private bungalow.  But when the Post Office insisted the elderly postmistress would have to install a computer for electronic transactions, she (politely) told them what to do with their computer – and retired! The nearest Post Office (and shop) is at Stockton, some 3 miles away.\nCommunal life centres on the village hall. Until December 2007, this was a corrugated iron sheet building. This structure was dismantled and a larger brick-built hall was erected during January and February 2008. Principal users of the hall are the Trustees of the village green, the Flower Show Committee and local art groups. Demographically, Broadwell is home to a fairly typical rural Midlands population. There is little ethnic diversity or multiculturalism and the age range is weighted towards the late middle-aged. However, there are more than a dozen families with school-age children and in 2013 at least four 'Broadwell babies' were due to be born.\nBusiness\nThere are several established businesses in Broadwell including Home Farm, Cedar Associates, Discovery CE and Raymont-Osman Product Design. The latter are both engineering consultants and are gathered in converted barns on Broadwell House Farm on the edge of Broadwell.\nReferences\n*[https://web.archive.org/web/20080629082747/http://www.warwickshire.gov.uk/Web/corporate/pages.nsf/Links/32FF6B64F2CF0E4180256D67004918A7] Warwickshire County Council, Census 2001, Ward Profiles for Leam Valley Ward\n*[https://web.archive.org/web/20081220131112/http://www.defra.gov.uk/esg/work_htm/publications/cs/farmstats_web/default.htm] June Agricultural and Horticultural Census, Dept for Environment Food and Rural Affairs (DEFRA)\n*[http://www.visionofbritain.org.uk/unit_page.jsp?u_id=10056706&c_id=10057334] Vision of Warwick Through Time website\n* The Leam Vallay Messenger parish newsletter\n*Warwickshire, Arthur Mee, Hodder And Stoughton, 1950\n*Warwickshire Towns & Villages, Geoff Allen, 2000\n*''Mr Sponge's Sporting Tour, Robert Smith Surtees, Wordsworth Editions (paperback), 1995,\n*History of the County of Warwick: Volume 6, LF Salzman, 1951, Victoria County History\n*British Railway Pre-grouping Atlass and Gazetteer'', Ian Allan Ltd,\n*Ordnance Survey, 'Pathfinder' series 1:25000 map, sheet 977,\n*Ordnance Survey, 'Landranger' series 1:50000 map, sheet 151\n*[http://www.warwickshirerailways.com/lms/leamingtonweedon.htm] Warwickshire Railways, Leamington-Weedon line page\n*[http://www.statistics.gov.uk/census2001/profiles/44ud.asp UK Statistics Authority]\n* [http://www1.landregistry.gov.uk/ The Land Registry]\n* [https://web.archive.org/web/20081204062254/http://www.bmsgh.org/parish/warw/tyaiw/leamingtonhastings.html] The Birmingham and Midland Society for Genealogy and Heraldry, Leamington Hastings parish notes\n*[http://www.genuki.org.uk/big/eng/WAR/LeamingtonHastings/Gaz1868.html] Extract from National Gazetteer, 1868 on Genuki website\n*[https://web.archive.org/web/20090130062750/http://www.traveldecourcey.com/bus/timetables/] De Coursey Travel bus timetables\n*[https://web.archive.org/web/20110616054703/http://www.warwickshire.gov.uk/corporate/BusTime.nsf/f6ba0a2f0063538180256d40003b1059/351bacbc69a474d880256d4f004b993f?OpenDocument] Warwickshire County Council, Bus Services in Warwickshire\n*[http://www.rugbytoday.co.uk/CustomPages/CustomPage.aspx?PageID=18789&sectionID=3642] Rugby Advertiser newspaper's 'District Diary' item (and similar items passim)\n*[https://cedarassociates.co.uk/] Cedar Associates Management Consulting and Training Services\n*[http://www.dce-services.co.uk/] Discovery CE Limited Specialist Geotechnical and Environmental Engineering Consultancy\n*[https://www.raymont-osman.com/] Raymont-Osman Product Design Consultancy\nExternal links"
    }
  ]
}