{
  "content": [
    {
      "type": "text",
      "text": "# Brock Stewart\n\n| birth_place = Normal, Illinois, U.S.\n| bats        = Left\n| throws      = Right\n| debutleague = MLB\n| debutdate   = June 29\n| debutyear   = 2016\n| debutteam   = Los Angeles Dodgers\n| statleague  = MLB\n| statyear    = 2025 season\n| stat1label  = Win–loss record\n| stat1value  = 10–5\n| stat2label  = Earned run average\n| stat2value  = 4.48\n| stat3label  = Strikeouts\n| stat3value  = 190\n| teams       =\n* Los Angeles Dodgers (–)\n* Toronto Blue Jays ()\n* Minnesota Twins (–)\n* Los Angeles Dodgers (–present)\n}}\nBrock Allen Stewart (born October 3, 1991) is an American professional baseball pitcher for the Los Angeles Dodgers of Major League Baseball (MLB). He has previously played in MLB for the Toronto Blue Jays and Minnesota Twins.\nCareer\nAmateur career\nStewart is the son of Jeff Stewart, who is a former college baseball coach and current San Diego Padres scout. Stewart attended Normal Community West High School in Normal, Illinois and was drafted by the New York Mets in the 40th round of the 2010 Major League Baseball Draft. He did not sign and played college baseball at Illinois State University, where he started pitching as a redshirt junior after having primarily been a third baseman before that. In 2013, he played collegiate summer baseball with the Wareham Gatemen of the Cape Cod Baseball League.\nLos Angeles Dodgers\nStewart was drafted by the Los Angeles Dodgers in the sixth round of the 2014 Major League Baseball Draft. He made his professional debut with the Ogden Raptors of the Pioneer Baseball League, where he appeared in 17 games (with one start) and was 3–2 with a 3.41 ERA.\nStewart started the 2015 season with the Great Lakes Loons of the Class-A Midwest League and was promoted after seven starts to the Rancho Cucamonga Quakes of the California League. Between the two levels, he was 4–6 with a 4.46 ERA in 25 appearances (19 starts).\nStewart returned to the Quakes to begin the 2016 season and was promoted to the Tulsa Drillers of the Texas League and Oklahoma City Dodgers of the Pacific Coast League during the season. Despite his promotion he was named to the mid-season Texas League all-star game. He was later named the Dodgers organizational minor league pitcher of the year for 2016. Between three minor league levels in 2016, he was 9–4 with a 1.79 ERA and 129 strikeouts in 21 starts.\nStewart was called up to the majors on June 29, 2016, to start for the Dodgers against the Milwaukee Brewers. He allowed five runs in the second inning and lost the game. He struck out seven and allowed eight hits in his five innings of work. He recorded his first major league win on September 7 against the Arizona Diamondbacks when he allowed only one run in five innings. Stewart made five starts and two relief appearances for the Dodgers with a 5.79 ERA in 28 innings.\nStewart suffered from  tendinitis in his right shoulder during spring training in 2017, causing him to begin the season on the disabled list. After recovering from his injury, Stewart spent 2017 bouncing between the minors and the majors, appearing in 17 games (with 4 starts) for the Dodgers with a 3.41 ERA and no decisions and also making 5 starts for Oklahoma City, where he had a 3.12 ERA. On September 2, he was placed on the 60-day disabled list to make room for Rocky Gale.\nToronto Blue Jays\nOn July 31, 2019, Stewart was claimed off waivers by the Toronto Blue Jays.  He was initially assigned to Triple-A Buffalo but was called up to the Blue Jays on August 5. He pitched  innings over 10 games with a 4–0 record and 8.31 ERA. On October 30, Stewart was removed from the 40–man roster and outrighted to the minors.\n2020–2021\nOn December 12, 2019, Stewart was selected by the Chicago Cubs in the minor league phase of the Rule 5 draft, however he did not play in a game in 2020 due to the cancellation of the minor league season because of the COVID-19 pandemic. He was released on May 28, 2020. He spent the remainder of the season with the independent Chicago Deep Dish team in the City of Champions Cup league. During the 2020 offseason, Stewart completed a program with Tread Athletics that increased the velocity of his pitches.\nOn December 11, 2020, Stewart signed a minor league contract to return to the Dodgers organization. However, he underwent Tommy John surgery in May and did not pitch in 2021.\nMinnesota Twins\nOn July 14, 2022, Stewart announced that he had signed a two-year minor league contract with the Minnesota Twins. In 11 games split between the Triple-A St. Paul Saints, High-A Fort Myers Miracle, and rookie-level Florida Complex League Twins, he posted a cumulative 0-2 record and 7.71 ERA with 16 strikeouts in 14 innings pitched.\nStewart began the 2023 season with St. Paul, appearing in seven games and registering a 2.08 ERA with 17 strikeouts in  innings of work. On April 25, he had his contract selected to the active roster. Stewart posted a 0.70 ERA with 35 strikeouts in  innings before he was placed on the injured list with right elbow soreness on June 27. Stewart was activated from the injured list on September 26, and made three scoreless appearances to end the season.\nStewart began the 2024 campaign out of the Twins' bullpen, compiling an 0.68 ERA with 17 strikeouts over his first 13 appearances. He was placed on the injured list with right shoulder tendinitis on May 3, 2024. After receiving a platelet-rich plasma injection, Stewart was transferred to the 60–day injured list on July 3. He was activated on July 24 but on August 9, it was announced that he would miss the remainder of the season after undergoing arthroscopic shoulder surgery. Overall, he made 16 appearances in 2024 with a 5.17 ERA.\nIn 2025, Stewart remained healthy for the Twins, pitching 34 innings over 39 games with a 2–1 record and 2.38 ERA while striking out 41 batters.\nLos Angeles Dodgers (third stint)\nOn July 31, 2025, the Twins traded Stewart to the Los Angeles Dodgers in exchange for James Outman. He only threw  innings for the Dodgers, allowing two runs on six hits before landing on the injured list with shoulder inflammation on August 12. He managed to pitch in a handful of rehab games for the Triple-A Oklahoma City Comets in September however he continued to experience shoulder discomfort. On September 26, it was announced that he would undergo season-ending shoulder surgery.\nSee also\n*Rule 5 draft results\nReferences\nExternal links"
    }
  ]
}