{
  "content": [
    {
      "type": "text",
      "text": "# Broom, Warwickshire\n\n|official_name=Broom\n|population = 550\n|civil_parish=Bidford-on-Avon\n|shire_district=Stratford-on-Avon\n|shire_county= Warwickshire\n|metropolitan_borough=\n|metropolitan_county =\n|region=West Midlands\n|constituency_westminster=Stratford-on-Avon\n|post_town=ALCESTER\n|postcode_district=B50\n|postcode_area=B\n|dial_code=01789\n|os_grid_reference=SP081529\n}}\nBroom is a village in the civil parish of Bidford-on-Avon in the Stratford-on-Avon district of Warwickshire, England, about  north-west of Bidford. The village lies in the north-west corner of the parish between the River Avon, which forms its western boundary, and the road from Bidford to Alcester. Broom formerly consisted of two hamlets known as King's Broom and Burnell's Broom. Burnell's Broom, the southern portion, was said to have been depopulated by Sir Rice Griffin of Broom Court during the reign of Elizabeth I. At the 2011 census Broom has a population of 550\nHistory\nBroom is known as one of the Shakespeare villages. William Shakespeare is said to have joined a party of Stratford folk which set itself to outdrink a drinking club at Bidford-on-Avon, and as a result of his labours in that regard to have fallen asleep under the crab tree of which a descendant is still called Shakespeare's tree. When morning dawned his friends wished to renew the encounter but he wisely said \"No I have drunk with \"Piping Pebworth, Dancing Marston, Haunted Hillboro', Hungry Grafton, Dodging Exhall, Papist Wixford, Beggarly Broom and Drunken Bidford\" and so, presumably, I will drink no more.\" The story is said to date from the 17th century but of its truth or of any connection of the story or the verse to Shakespeare there is no evidence.\nThe village is first mentioned in the grant of Ceolred of Mercia to Evesham Abbey of 710 and was included in the list of manors acquired by Abbot Ethelwig, who died 1077, and seized by Odo, Bishop of Bayeux, half brother to William the Conqueror. By 1086, it is recorded in the Domesday Book as part of the lands of the Bishop of Bayeaux, where it reads, \"In Ferncombe Hundred, in Brome 4½ hides. Stephen holds from him. 5 men held it freely before 1066. Land for 4 ploughs. In lordship 2; 4 villagers and 10 smallholders with 2 ploughs. Meadow, 14 acres. The value before 1066 40s; later 30s; now 60s.\"\nGovernance\nBroom is part of the Bidford and Salford ward of Stratford-on-Avon District Council and represented by Councillor Jonathan Spence, Conservative Party. [http://democracy.stratford.gov.uk/mgUserInfo.aspx?UID=694&txtonly=1] Nationally it is part of Stratford-on-Avon parliamentary constituency, whose current MP is Manuela Perteghella of the Liberal Democrats. Prior to Brexit in 2020 it was part of the West Midlands electoral region of the European Parliament.\nTransport links\nBroom is located near the A46 road giving access southbound to Evesham and junction 9 of the M5 motorway at Tewkesbury and northbound to junction 3 of the M42 motorway at Portway.\nSee also\n* Broom Junction railway station on the Gloucester Loop Line.\nReferences"
    }
  ]
}