{
  "content": [
    {
      "type": "text",
      "text": "# Brooklyn–Queens Connector__disambig_1\n\n-->\n| open                            =\n| close                           =\n| owner                           =\n| operator                        =\n| character                       = Streetcar\n| depot                           =\n| stock                           =\n| linelength_mi                   = 11\n| tracklength_mi                  =\n| tracks                          = 2\n| gauge                           =\n| old_gauge                       =\n| load_gauge                      =\n| minradius                       =\n| racksystem                      =\n| routenumber                     =\n| linenumber                      =\n| electrification                 = Hydrogen fuel cell\n| speed_mph                       =\n| elevation_ft                    =\n| website                         =\n| map                             =\n| map_name                        =\n| map_state                       = collapsed\n}}\nThe Brooklyn–Queens Connector, abbreviated the BQX, was a proposed streetcar line in New York City. It was planned to operate on a north–south corridor along the East River between the boroughs of Queens and Brooklyn. A previous plan bearing similarities to the BQX was initially proposed in 1989 as part of a Brooklyn waterfront streetcar line connecting Red Hook with Downtown Brooklyn. A study by the city, published in 2011, found the proposal to be infeasible. A later proposal by the nonprofit Friends of the Brooklyn Queens Connector, made public in January 2016, found backing from Mayor Bill de Blasio. A director for Friends of the Brooklyn Queens Connector was appointed in May 2016, and a list of possible routings was released in November 2016.\nThere was criticism of the project, namely that its completion date of mid-2020s might make it obsolete; that it did not have a clear source of funding; and that it was a poor substitute for subway service. The project was abandoned after de Blasio's mayoral term ended in 2021.\nPrevious proposal\nPCC streetcar that was to be placed on a proposed, but never used, streetcar line]]\nSince electric trolleys in Brooklyn stopped running in 1956, activists led by the Brooklyn Historic Railway Association (BHRA) had been trying to revive streetcars. In the 1990s, the BHRA received permission from New York City's government to develop a streetcar line running from Beard Street to Borough Hall. The association's president Robert Diamond collected disused PCC streetcars that had been used in Boston and Buffalo for potential use on the new line. By 1999, the group had begun laying new track for the project in Red Hook. However, in 2003, transportation officials elected to revoke Diamond's rights to the route's right-of-way. Instead, officials intended to sell the rights to the highest bidder in the event that the project ever moved forward. Diamond's efforts to secure independent funding were not successful.\nIn 2005, U.S. Representative Nydia Velázquez helped obtain a $300,000 federal grant for a six-month streetcar study.  Although the BHRA had estimated $10–$15&nbsp;million would be required to complete the project, the New York City Department of Transportation (NYCDOT) streetcar feasibility study (completed in April 2011) concluded that the  line would cost $176&nbsp;million in capital funding, plus an additional $6.2 to $7.2&nbsp;million in annual operating funds.  A significant portion of the capital cost would be required to make modifications to Red Hook's narrow streets in order to allow streetcars to make right turns. The study concluded that, due to a number of factors such as high costs, low ridership, and physical constraints like narrow streets, a streetcar line would not be an appropriate transit solution for the area. By June 2013, Diamond had partnered with John Quadrozzi of Gowanus Bay Terminal (a concrete firm), and the Gowanus Canal Community Development Corporation in an effort to revive the project, which he now envisioned running partly underground through the Cobble Hill Tunnel, a former Long Island Rail Road tunnel under Atlantic Avenue.  Diamond pursued federal funding in order to pay for the project, which he estimated would cost $50&nbsp;million.\nConnector proposal\nInitial study\nThe current line was initially proposed by a non-profit group, Friends of the Brooklyn Queens Connector, which commissioned a study to examine the corridor along the Brooklyn and Queens waterfront. First publicly reported on in January 2016, the study proposed a  route between the neighborhoods of Astoria in Queens and Sunset Park in Brooklyn, passing through several neighborhoods on the way. News media reported that the study had estimated construction costs of $1.7&nbsp;billion, annual operating costs of $26&nbsp;million, and 15.8&nbsp;million annual riders by 2035. The proposal included a branch going through Downtown Brooklyn to the Atlantic Avenue–Barclays Center station.\nThe study described a routing that would begin in Queens near the New York City Housing Authority's Astoria Houses. It would run down 21st Street south to Queensboro Plaza, west onto 11th Street to Newtown Creek. The streetcar would cross Newtown Creek into Greenpoint, then pass through Williamsburg and the Brooklyn Navy Yard using one-way streets close to the waterfront. It would turn onto Park Avenue, run to Navy Street, then through Farragut Houses, Vinegar Hill, and Dumbo. The line would then run south through Red Hook, cross the Gowanus Canal, and continue south on Third Avenue to 58th Street, where it would turn west to serve the Brooklyn Army Terminal and Industry City. From there, the line would turn east, terminating at the 59th Street subway station in Sunset Park.\nSchwartz's firm worked on the proposal for over a year and considered five options aside from streetcars. One other option, Select Bus Service, was estimated to cost $1&nbsp;billion to implement, and was not chosen since it would not raise property values as a streetcar would. The engineers projected 52,000 to 53,000 riders per day on the streetcar, which would have required a bus every minute. Each street car would be able to carry 150 to 175 passengers. Additionally, buses would also have a harder time navigating the 12 to 15 streets along the route. The engineers' route would have its own dedicated lanes for the whole route. The study recommended that two facilities for maintenance and storage would be built at a cost of $100&nbsp;million. In addition, the streetcar would need at least 140 employees to operate the streetcars and a host of other workers, including traffic enforcement agents.\nMayoral endorsement\n, one of the areas that would be served by the new streetcar]]\nOn February 3, 2016, the office of Mayor Bill de Blasio announced that the city would begin planning work for the streetcar line, with a formal announcement by de Blasio at his State of the City speech the following day. The BQX was promised as a way to reinvent the city's transit system, along with the Citywide Ferry Service (now NYC Ferry) proposal.  City officials said that several years of additional study and review would precede groundbreaking, planned for 2019, with service beginning around 2024. Since the line would be a street-level project, the streetcar would not need state approval. The city will rely on increased real estate revenues to pay for the project. Mayor de Blasio's office commissioned a study toward researching the projected effects of the streetcar.\nUnder the slightly revised plan released by the city, the route would travel  with 30 wheelchair-accessible stops, with an increased construction cost of $2.5&nbsp;billion. There would be sixty vehicles, costing $5&nbsp;million total, that would travel at , and would be separated from vehicular traffic for 70% of the route. Two bridges over the Newtown Creek and the Gowanus Canal were proposed, in the case that the Pulaski Bridge over the Newtown Creek, and the Hamilton Avenue bridge over the Gowanus Canal, aren't able to accommodate the vehicles; the Newtown Creek bridge will probably be located at Vernon Boulevard, where another bridge previously existed. A trip between Dumbo and Greenpoint would take 27 minutes via the line. The fare for the route would equal the fare of the subway and the buses.\nThe line is planned to use multi-section vehicles to negotiate sharp curves at Lorraine Street, Cadman Plaza, 21st Street, and Astoria Boulevard. Streetcars, rather than light rail vehicles (LRVs), are proposed to be used, despite the fact that LRVs have more capacity and shorter headways; this is because streetcars were determined to operate better within mixed-use rights-of-way, as opposed to LRVs, which were determined to operate better within dedicated rights-of-way. Electrification is proposed to be from hydrogen fuel cells within the streetcars themselves, as opposed to from overhead lines or from embedded rails. Since the BQX would operate on both dedicated rights-of-way and on streets, the BQX would use both standard traffic lights and dedicated signals during operation. Annual operating costs are estimated at $26&nbsp;million.\nThe new line would provide a new transit route for 45,000 public-housing residents. An additional motivation for the line has been the tremendous growth in Brooklyn and Queens waterfront areas since the early 2000s.\nDevelopment\nIn May 2016, Friends of the Brooklyn Queens Connector appointed its first executive director, Ya-Ting Liu, to oversee route operations and design. Two months later, mayor De Blasio appointed Adam Giambrone, former councilor in Toronto and chair of the Toronto Transit Commission, to serve as a consultant or \"streetcar czar\" for the project. On November 1, 2016, the city presented a list of possible routings of the BQX through several neighborhoods. The study found that four New York City Subway stations along the BQX's route—at Jay Street–MetroTech, Borough Hall, Court Square–23rd Street, and Vernon Boulevard—had high weekday ridership, and thus, would benefit from a BQX transfer. The city, citing the successes of other American cities' streetcar systems, estimated that the project will pay for itself by increasing the property values in the neighborhoods around it in a form of transit-oriented development, similar to how the 7 Subway Extension was built. It is expected to create 86,000 jobs through 2045.\nIn November 2017, Friends of the Brooklyn Queens Connector revealed a mockup of a vehicle that might be used on the BQX. The $100,000 prototype, a Citadis low-floor streetcar created by Alstom, was displayed at the Brooklyn Navy Yard. However, there was insufficient funding to start construction. Internal memos from the city around this time suggested that the project was endangered due to an ongoing dispute between Mayor de Blasio and New York State Governor Andrew Cuomo, since the state government owned some of the land that the BQX was to pass through. Shortly afterward, Liu stepped down from the director's position of Friends of the Brooklyn Queens Connector, to be replaced by Deputy Director Jessica Schumer, the daughter of U.S. Senator Chuck Schumer.\nBy April 2018, there was still insufficient funding, and de Blasio announced that the city would ask for federal aid for the BQX, despite the city's previous assurances to completely self-fund the project. Moreover, the streetcar project was already behind schedule: major design work had been slated to start that year, but the public approvals process that preceded it had not started. Officials predicted that even if the BQX were to be fully funded, construction would not start until at least 2020. Additionally, if the BQX's construction were to proceed, the project would interfere with the renovation of the Brooklyn Heights Promenade section of the Brooklyn-Queens Expressway, which would occur during roughly the same time frame.\nTruncated plans and abandonment\nThe BQX's proposed route between Red Hook and Sunset Park was eliminated in August 2018, and a routing through Dumbo was shelved in favor of a more direct routing through Downtown Brooklyn. The route was thereby shortened from a  alignment with 30 stops to an  alignment with 26 stops. This was supposedly because of cost constraints, since it was projected that the stops in Sunset Park and Dumbo would not have enough ridership to justify building the streetcar there. However, the shortened route was estimated to be more expensive than the original proposed route to Sunset Park. The new route would cost $2.73&nbsp;billion, versus the original proposal, which would have cost $2.5&nbsp;billion. The proposed completion date for the BQX was also postponed to 2029.\nThe NYCEDC announced in February 2019 that it had awarded a contract to create an environmental impact statement for the BQX. The report would be written by the firm Vanasse Hangen Brustlin, Inc., which would publish a final statement by 2020. Afterward, the city would perform a comprehensive Uniform Land Use Review Procedure zoning plan (ULURP) for the areas along the BQX. Due to the length of the ULURP process, construction would not begin until at least 2024.\nIn September 2020, de Blasio deferred decisions on the BQX to after the 2021 New York City mayoral election; de Blasio was term-limited and unable to run for reelection, which meant further action on BQX would be taken by the next mayoral administration. The city had experienced financial shortfalls that year because of the COVID-19 pandemic in New York City, making it unfeasible for de Blasio's administration to commence the project before the end of his term in 2022. By 2021, it was uncertain whether the BQX would ever be built. In the 2021 New York City Democratic mayoral primary, only one of the nine candidates (Loree Sutton, who later dropped out of the race) supported building the BQX, while five candidates opposed it. A different rail line between Brooklyn and Queens, the Interborough Express, was announced in 2022; this route would use the Bay Ridge Branch and Fremont Secondary, rather than running along the waterfront as the BQX did. The prototype vehicle had been dismantled by 2024.\nRoute\nAs proposed in November 2016, the northern end of the route would probably have been at Hoyt Avenue or along 27th Avenue, with the BQX using either 31st Street (under the Astoria subway line, carrying the ), Vernon Boulevard, 21st Street, or Crescent Street to go south to Long Island City. From there, the BQX would have used 44th Drive and then cross the Newtown Creek using one of three bridges (a new bridge at either 2nd Street or Vernon Boulevard, or the existing Pulaski Bridge). These options would have then traveled down either Franklin Street, Manhattan Avenue (over the Crosstown subway line), or McGuinness Boulevard, respectively.\n(pictured) through Greenpoint.|250x250px]]\nIn southern Greenpoint, the Franklin Street routing would have used either Kent Avenue or Berry Street (using Banker Street). The other two options could have gone down Wythe Avenue, Berry Street, or Bedford Avenue, via Nassau Avenue or Norman Street. The four options would have merged into two (Kent Avenue and Wythe Avenue) south of Division Avenue in Williamsburg. South of the neighborhood, all of the options would have then cut through the Brooklyn Navy Yard using Assembly Street. At Clinton Avenue, the BQX would have had three options to the west to access Downtown Brooklyn, Dumbo, or Brooklyn Heights. The BQX could use Market Street and Eighth Street; Flushing Avenue; or Park Avenue. The Eighth Street option would have merge onto Flushing Avenue at Cumberland Street in Fort Greene. At Navy Street, the two routings had three options: go to Dumbo using Gold Street, Front/York Streets, and Cadman Plaza East; go to Downtown Brooklyn using Navy Street, Ashland Place, Willoughby Place, and Joralemon Street; or use Tillary Street to access Brooklyn Heights. At Joralemon and Court Streets, all of the options would have turned south down Court Street and then west along Atlantic Avenue. The Dumbo option was ruled out in August 2018.\nIn Cobble Hill, the route could have gone in one of three directions. It could have continued to the west end of Atlantic Avenue and then southward down Columbia Street, serving the Columbia Street Waterfront District; serve the residential section of Cobble Hill via Henry, Congress, and Columbia Streets; or turn down Hicks Street. The two Columbia Street options would have needed to go around the Brooklyn–Battery Tunnel toll plaza, while the Hicks Street option would have used Sackett and Union Streets to use Van Brunt and Richards Streets, thus bypassing this detour. South of the Brooklyn–Battery Tunnel toll plaza, the Van Brunt/Richards Streets option would have traveled down to the streets' south end to Beard Street and turn eastward there, while the Columbia Street option could have gone down to either Mill or Bay Streets, then traveled eastward at one of these two streets. The Mill Street option would have gone across the Gowanus Canal using 10th Street, while the Bay Street option further south could have used either the existing 10th Street bridge or a new 19th Street bridge to cross the canal.\nThe BQX's southernmost leg was canceled in August 2018. As originally planned, it would have traveled down Third Avenue underneath the Gowanus Expressway. This would be parallel to the Fourth Avenue subway line, one block east under Fourth Avenue. Between either 10th or 19th Street (depending on which bridge option was chosen) and 39th Street, the BQX would have run along Third Avenue. From 39th Street to 58th Street, the BQX could have swung west to 39th Street to serve Industry City, the Brooklyn Army Terminal, and the industrial center of Sunset Park; or it could have kept running along Third Avenue and serve residents of western Sunset Park. The BQX would have ended at Third Avenue and 59th Street, a block from the entrance to the 59th Street subway station.\nCriticism\nThe Brooklyn–Queens Connector  received criticism for its operation and cost.  While it was planned to connect to 17 subway stations, it would have been far from the BMT Canarsie Line () at Bedford Avenue.  The line would also not have gone near the BMT Jamaica Line () at Marcy Avenue.  Many areas that the new streetcar would have served are  from the IND Crosstown Line (), while areas in Eastern Queens and parts of Brooklyn had no nearby subway lines.  Since the project would have been constructed and run by New York City and not the MTA, it is not known how it would have integrated with the MTA's fare system, if at all.  Public officials on Staten Island, including Staten Island Borough President James Oddo, did not oppose the plan, but they have stated that they felt under-represented after previous plans in Staten Island, including light rail along the island's North and West Shores, were rejected.\nThe line was also criticized by public officials in South Brooklyn, who stated that their areas had their express bus service cut, their subway stations lacked elevators, their neighborhoods were under-served by public transit in general, and their requests for express F subway service and more reliable R train service had not yet been heeded. The proposal has also received criticism as it was viewed as a government subsidy to property developers. In addition, the BQX would have run through several \"100-year flood zones\", meaning that the line would have been prone to flooding during heavy storms and hurricanes.\nIn a May 2016 editorial in the New York Daily News, Princeton University professor Steven Strauss stated that he was concerned that autonomous vehicles might make the project obsolete when it was completed. Further, he thought the estimated cost of $10 per person per ride might be uneconomic compared to other alternatives. Instead, Strauss recommended that the city engage in a wider Request for Expressions of Interest Process to look at other potential alternatives.\nIn February 2017, the Village Voice examined the BQX project's cost and found that the city had only tenuous sources of funding for the project. The Voice study found that the neighborhoods along the proposed BQX pay a combined $1&nbsp;billion annually in residential taxes, with the tax revenue having increased 17% since 2015. However, to pay for the BQX, the streetcar alone would need to raise tax by another 17%, or else the city would need to resort to financing the streetcar out of its own budget. In addition, there would be less benefit in building in already-gentrified neighborhoods than in neighborhoods that are gentrifying or being redeveloped. The streetcar's feasibility study estimated that property values would go up even without the streetcar.\nSee also\n* Interborough Express, a proposed rail line connecting Brooklyn and Queens on a different route\nReferences\nExternal links\n*"
    }
  ]
}