{
  "content": [
    {
      "type": "text",
      "text": "# Brown-hooded kingfisher__disambig_1\n\n| display_parents = 2\n| taxon = Halcyon albiventris\n| authority = (Scopoli, 1786)\n| subdivision_ranks = Subspecies\n| subdivision_ref =\n| subdivision =\n* H. a. albiventris - (Scopoli, 1786)\n* H. a. orientalis - Peters, W, 1868\n* H. a. prentissgrayi - Bowen, 1930\n* H. a. vociferans - Clancey, 1952\n| synonyms =\n}}\nThe brown-hooded kingfisher (Halcyon albiventris) is a species of bird in the subfamily Halcyoninae, the tree kingfishers. It has a brown head and blackish and turquoise wings. It is found in Sub-Saharan Africa, living in woodland, scrubland, forest edges, and also suburban areas. The International Union for Conservation of Nature (IUCN) has assessed it as being of least concern.\nTaxonomy\nThis species was described as Alcedo albiventris by Giovanni Antonio Scopoli in 1786. Four subspecies are recognised: Halcyon albiventris albiventris, H. a. orientalis, H. a. prentissgrayi and H. a. vociferans. Subspecies hylophila and erlangeri have also been described, but they are not considered distinct enough.\nDescription\nThe brown-hooded kingfisher is about  long. The head is brown, with blackish streaks. There is a broad buffy collar above the brownish-black mantle. The wing coverts are mostly brownish-black, and the secondary flight feathers are turquoise. The rump is azure-blue. The chin is white, the breast is tawny with some dark streaks, and the belly is buffy. The beak is red, tipped brown, the legs are carmine, and the eyes are dark brown. The female has dark brown upperparts, and its underparts are more streaked than the male. The juvenile bird is duller, with scalloped whitish underparts. The subspecies differ in shade and streaking.\nDistribution and habitat\nThis kingfisher is found in Sub-Saharan Africa, in Gabon, Congo, the Democratic Republic of the Congo, Angola, Kenya, Tanzania, Zambia, Somalia, Mozambique, Malawi, Zimbabwe, Botswana, Namibia, South Africa and Eswatini. It occurs below  in elevation, living in woodland, grassland with trees, scrubland, forest edge, and also cultivations, parks and gardens. It sometimes occurs near water, and can adapt to suburban habitats. Most populations do not migrate, but there is evidence of seasonal movements in some areas.\nBehaviour\nThis kingfisher is generally seen alone or in pairs. It usually forages on the ground, mainly feeding on insects, and also eating scorpions, reptiles, small birds, rodents and fishes. Eating snakes and lizards as long as  has been reported. The song, given while vibrating the wings, is a tiiiu or ki-ti-ti-ti trill, and a sharp cheerit is given when alarmed. The breeding season is mainly between September and April. A burrow nest is dug in a river bank, gully or road cutting. The family stays together for a few weeks after breeding.\nMale Brown-hooded Kingfisher (Halcyon albiventris) in Pigeonwood tree.jpg|\nJuvenile Brown-hooded Kingfisher (Halcyon albiventris).jpg|\nBrown Hooded Kingfisher.jpg|\nBruinkopvisvanger.jpg|\nStatus\nThis species has a large range, stable population and no substantial threats, so the IUCN has assessed it as a least-concern species.\nReferences"
    }
  ]
}