{
  "content": [
    {
      "type": "text",
      "text": "# Browser wars__disambig_1\n\nA browser war is a competition for dominance in the usage share of web browsers. The \"first browser war\" (1995–2001) occurred between proponents of Internet Explorer and Netscape Navigator, and the \"second browser war\" (2004–2017) between those favoring Internet Explorer, Firefox, or Google Chrome.\nWith the introduction of HTML5 in 2008 and CSS 3 in 2011, a new generation of browser wars began, this time considering extensive client-side scripting to the World Wide Web (WWW), and the more widespread use of smartphones and other mobile devices for web browsing. These changes have ensured that browser battles continue among enthusiasts, while the average web user is less affected.\nBackground\nTim Berners-Lee, along with his colleagues at CERN, started the development of the Internet-based hypertext system WWW in 1989. Their studies led to the creation of the HyperText Transfer Protocol, which set the protocols for client-server communication. In 1990, Berners-Lee created the first web browser, WorldWideWeb, subsequently known as Nexus, and made it available for the NeXTstep Operating System, by NeXT.\nOther browsers started to surface by the end of 1992, many of which were based on the Libwww library. These included MacWWW/Samba for the Mac and Unix browsers including Line Mode Browser, ViolaWWW, Erwise, and MidasWWW. These browsers were HTML viewers that needed third-party helpers to display multimedia content.\nMosaic wars\nIn 1993, more browsers became available, including Cello, Lynx, tkWWW, and Mosaic. The most influential of these was Mosaic, a multi-platform browser developed at National Center for Supercomputing Applications (NCSA). By October 1994, Mosaic was \"well on its way to becoming the world's standard interface\", according to Gary Wolfe of Wired.\nSeveral companies licensed Mosaic to create their commercial browsers, such as AirMosaic, Quarterdeck Mosaic, and Spyglass Mosaic. One of the Mosaic developers, Marc Andreessen, co-founded the Mosaic Communications Corporation and created a new web browser named Mosaic Netscape.\n|sign=Mark Pesce|source=ZDNet}}\nTo resolve legal issues with NCSA, the company was renamed Netscape Communications Corporation, and the browser Netscape Navigator. The Netscape browser improved Mosaic's usability and reliability and was able to display pages as they loaded. By 1995, helped by the fact that it was free for non-commercial use, the browser dominated the emerging World Wide Web.\nOther browsers launched during 1994 included IBM Web Explorer, Navipress, SlipKnot, MacWeb, and Browse.\nWhile Netscape faced new competition from OmniWeb, Eolas WebRouser, UdiWWW, and Microsoft's Internet Explorer 1.0, it continued to dominate the market for 1995.\nFirst browser war (1995–2001)\nBy mid-1995, the World Wide Web had received a great deal of attention in popular culture and the mass media. Netscape Navigator was the most widely used web browser and Microsoft had licensed Mosaic to create Internet Explorer 1.0, which had released with Microsoft Windows 95 Plus! on August 24, 1995.\nUnlike Netscape Navigator, Internet Explorer 1.0 was available to all Windows users free of charge, including commercial companies. Other companies later followed suit and released their browsers free of charge. Netscape Navigator and competitor products like InternetWorks, Quarterdeck Browser, InterAp, and WinTapestry were bundled with other applications to full Internet suites.\nNew versions of Internet Explorer (IE) and Netscape (branded as Netscape Communicator) were released often over the following few years. New features were routinely added, including Netscape's JavaScript (subsequently replicated by Microsoft as JScript) and proprietary HTML tags such as &lt;blink&gt; (Navigator) and &lt;marquee&gt; (Internet Explorer).\nInternet Explorer 3 provided services nearly identical to its competitor, Netscape, offering scripting support and implementing the market's first commercial Cascading Style Sheets (CSS) support.\nOn September 22, 1997, Internet Explorer 4 was released. The release party in San Francisco featured a ten-foot-tall letter \"e\" logo. Netscape employees showing up to work the following morning found the logo on their front lawn, paired with greeting card signed \"Best wishes, the IE team\". The Netscape employees promptly knocked it over and set a giant figure of their Mozilla dinosaur mascot atop it, holding a sign reading \"Netscape 72, Microsoft 18\", referencing the companies' market share.\nDuring these releases, it was common for web designers to display \"best viewed in Netscape\" or \"best viewed in Internet Explorer\" logos. These images often identified a specific browser and commonly linked to a source from which the stated browser could be downloaded. These logos generally recognized the divergence between the standards supported by the browsers and signified which browser was used for testing the pages. In response, supporters of the principle that websites should be compliant with World Wide Web Consortium standards and hence viewable with any browser started the \"Viewable with Any Browser\" campaign, which employed its logo similar to the partisan ones. Most mainstream websites, however, specified one of Netscape or Internet Explorer as their preferred browser while making some attempt to support minimal functionality on the other.\nWhile Netscape had accrued about 75% of the market share within four months of its release, as a relatively small company deriving the great bulk of its income from what was essentially a single product (Navigator and its derivatives), it was financially vulnerable. Microsoft's resources allowed them to make Internet Explorer available without charge, as the revenues from Windows were used to fund its development and marketing. As a result, Internet Explorer was provided free for all Windows and Macintosh users, unlike Netscape, which was free for home and educational use but would require a paid license for business use.\nMicrosoft bundled Internet Explorer with every copy of Windows, which had over a 95% share of the desktop operating system market in June 2004, allowing the company to obtain market share more easily than Netscape as customers already had Internet Explorer installed as the default browser. At this time, many new computer purchasers had never extensively used a web browser before. Consequently, the buyer did not have anything else to compare with and little motivation to consider alternatives; any difference in browser features or ergonomics paled in comparison with the set of abilities they had gained with access to the Internet and the World Wide Web.\nDuring the United States Microsoft antitrust case in 1998, Intel vice president Steven McGeady testified that a senior executive at Microsoft told him in 1995 of his company's intention to \"cut off Netscape's air supply\", although a Microsoft attorney rejected McGeady's testimony as not credible. That same year, Netscape was acquired by America Online for 4.2 billion dollars. Internet Explorer became the new dominant browser, attaining a peak of over 90% of the web browser usage share in 2001.\nSecond browser war (2004–2017)\nDecline of Netscape and entry of Firefox\nrunning on Ubuntu displaying Wikipedia]]\nAt the start of Netscape Navigator's decline, Netscape open-sourced its browser code and later entrusted it to the newly formed non-profit Mozilla Foundation &mdash; a primarily community-driven project to create a successor to Netscape. Development continued for several years with little widespread adoption until a stripped-down browser-only version of the full suite, which included new features such as a separate search bar (which had previously only appeared in the Opera browser), was created. The browser-only version was initially named Phoenix, but because of trademark issues that name was changed, first to Firebird, then to Firefox. Phoenix was chosen because \"Phoenix\", implied that it would rise like a phoenix after Netscape Navigator was killed off by Microsoft. This browser became the focus of the Mozilla Foundation's development efforts. Mozilla's Firefox 1 was released on November 9, 2004, and it then continued to gain an increasing share of the browser market until a peak of around 24% in 2010.\nIn response, in April 2004, the Mozilla Foundation and Opera Software joined efforts to develop new open-technology standards which add more capability while remaining backward-compatible with existing technologies. The result of this collaboration was the WHATWG, a working group devoted to the fast creation of new standard definitions that would be submitted to the W3C for approval.\nThe growing number of device/browser combinations in use, legally-mandated web accessibility, as well as the expansion of expected web functionality to essentially require DOM and scripting abilities, including AJAX, made web standards of increasing importance during this era. Instead of advertising their proprietary extensions, browser developers began to market their software based on how closely it adhered to standards.\nOn December 28, 2007, Netscape announced that support for its Mozilla-derived Netscape Navigator would be discontinued on February 1, 2008, suggesting its users migrate to Mozilla Firefox.\nHowever, on January 28, 2008, Netscape announced that support would be extended to March 1, 2008, and mentioned Flock alongside Firefox as alternatives to its users.\nInternet Explorer\nIn 2003, Microsoft announced that Internet Explorer 6 Service Pack 1 would be the last standalone version of its browser. Future enhancements would be dependent on Windows Vista, which would include new tools such as the WPF and XAML to enable developers to build web applications.\nOn February 15, 2005, Microsoft announced that Internet Explorer 7 would be available for Windows XP SP2 and later versions of Windows by mid-2005. The announcement introduced the new version of the browser as a major upgrade over Internet Explorer 6 SP1.\nMicrosoft released Internet Explorer 7 on October 18, 2006. It included tabbed browsing, a search bar, a phishing filter, and improved support for web standards (including full support for PNG) — all features already long familiar to Opera and Firefox users. Microsoft distributed Internet Explorer 7 to genuine Windows users (WGA) as a high-priority update through Windows Update. Typical market share analysis showed only a slow uptake of Internet Explorer 7 and Microsoft decided to drop the requirement for WGA and made Internet Explorer 7 available to all Windows users in October 2007. Throughout the two following years, Microsoft worked on Internet Explorer 8. On December 19, 2007, the company announced that an internal build of that version had passed the Acid2 CSS test in \"IE8 standards mode\" — the last of the major browsers to do so. Internet Explorer 8 was released on March 19, 2009. New features included accelerators, improved privacy protection, a compatibility mode for pages designed for older browsers, and improved support for various web standards. It was the last version of Internet Explorer to be released for Windows XP. Internet Explorer 8 scored 20/100 in the Acid3 test, which was much worse than all major competitors at the time.\nIn October 2010, StatCounter reported that Internet Explorer had for the first time dropped below 50% market share to 49.87% in their figures. Also, StatCounter reported Internet Explorer 8's first drop in usage share in the same month.\nMicrosoft released Internet Explorer 9 on March 14, 2011. It featured a revamped interface, support for the basic SVG feature set, and partial HTML video support, among other new features. It dropped support for Windows XP, and only ran on Windows Vista, Windows 7, and Windows Phone 7. The company later released Internet Explorer 10 along with Windows 8 and Windows Phone 8 in 2012, and an update compatible with Windows 7 followed in 2013. This version dropped Vista and Phone 7 support. The release preview of Internet Explorer 11 was released on September 17, 2013. It supported the same desktops as its predecessor.\nStarting in 2015 with the release of Windows 10, Microsoft shifted from Internet Explorer to Microsoft Edge [Legacy] (Commonly referred to as Edge [Legacy]). However, the new browser had failed to capture much popularity, thus Microsoft Edge switched from its own browser engine, EdgeHTML, to Chromium's Blink engine in 2020 for all platforms except for iOS, where it kept relying on WebKit due to platform restrictions.\nCompeting desktop and mobile browsers\n, 2009–2021]]\nOpera had been a long-time player in the browser wars, known for being lightweight and introducing innovative features such as tabbed browsing and mouse gestures. However, the software was commercial, which hampered its adoption compared to its free rivals until 2005, when the browser became freeware. On June 20, 2006, Opera Software released Opera 9 including an integrated source viewer, a BitTorrent client implementation, and widgets. It was the first Windows browser to pass the Acid2 test. Opera Mini, a mobile browser, has a significant mobile market share. Multiple ports, such as Opera 8.5 for the Nintendo DS and Opera 9 for the Wii, were also released.\nOn October 24, 2006, Mozilla released Mozilla Firefox 2. It included the ability to reopen recently closed tabs, a session restore feature to resume work where it had been left after a crash, a phishing filter, and a spell-checker for text fields. Mozilla released Firefox 3 on June 17, 2008, with performance improvements and other new features. Firefox 3.5 followed on June 30, 2009, with further performance improvements, native integration of audio and video, and more privacy features.\nApple created forks of the open-source KHTML and KJS layout and JavaScript engines from the KDE Konqueror browser in 2002. They explained that those provided a basis for easier development than other technologies by being small (fewer than 140,000 lines of code), cleanly designed, and standards-compliant. The resulting layout engine became known as WebKit and it was incorporated into the Safari browser that first shipped with Mac OS X v10.3. On June 13, 2003, Microsoft said it was discontinuing Internet Explorer on the Mac platform, and on June 6, 2007, Apple released a beta version of Safari for Microsoft Windows. On April 29, 2010, Steve Jobs wrote an open letter regarding his Thoughts on Flash, and the place it would hold on Apple's iOS devices and web browsers. Web developers were tasked with updating their web sites to be mobile-friendly, and while many disagreed with Steve Jobs's assessment on Adobe Flash, history would soon prove his point with the poor performance of Flash on Android devices. HTML4 and CSS2 were the standard in most browsers in 2006. However, new features being added to browsers from HTML5 and CSS3 specifications were quickly making their mark by 2010, especially in the emerging mobile browser market where new ways of animating and rendering for various screen sizes were to become the norm. Accessibility would also become a key player for the mobile web.\nGoogle Chrome's entry\nGoogle released the Google Chrome browser on September 2, 2008, using the same WebKit rendering engine as Safari and a faster JavaScript engine called V8. Shortly after, an open-sourced version for the Windows, Mac OS X, and Linux platforms was released under the name Chromium. According to Net Applications, Chrome had gained a 3.6% usage share by October 2009. After the release of the beta for Mac OS X and Linux, the market share had increased rapidly.\nDuring December 2009 and January 2010, StatCounter reported that its statistics indicated that Firefox 3.5 was the most popular browser when counting individual browser versions, passing Internet Explorer 7 and 8 by a small margin. This was the first time a browser surpassed the Internet Explorer since the fall of Netscape Navigator. However, this feat, which GeekSmack called the \"dethroning of Microsoft and its Internet Explorer 7 browser\", could largely be attributed to the fact that it came at a time when version 8 was replacing version 7 as the dominant Internet Explorer version; no more than two months later Internet Explorer 8 had established itself as the most popular browser again. Other major statistics, such as Net Applications, never reported any other browser having a higher usage share than Internet Explorer if each version of each browser was looked at individually: for example, Firefox 3.5 was reported as the third most popular browser version from December 2009 to February 2010, succeeded by Firefox 3.6 since April 2010, each ahead of Internet Explorer 7 but behind Internet Explorer 6 and 8.\nGoogle Chrome's dominance and evolving web standards\naccording to StatCounter, 2008–2019 ]]\n, initially released in 2008, had a rapidly increasing trend in usage share since its creation, dominating the browser wars in 2017.]]\nOn January 21, 2010, Mozilla released Mozilla Firefox 3.6, which introduced a new type of theme display, 'Personas'. This allowed users to change Firefox's appearance with a single click. Version 3.6 also improved JavaScript performance, overall browser responsiveness, and startup times.\nGoogle released Google Chrome 9 on February 3, 2011. New features introduced included support for WebGL, Chrome Instant, and the Chrome Web Store. The company created another seven versions of Chrome that year, finishing with Chrome 16 on December 15, 2011. Google Chrome 17 was released on February 15, 2012. In April 2012, Google browsers (Chrome and Android) became the most used browsers on Wikimedia Foundation sites. By May 21, 2012, StatCounter reported Chrome narrowly overtaking Internet Explorer as the most used browser in the world. However, the market share between Internet Explorer and Chrome meant that Internet Explorer was slightly ahead of Chrome on weekdays up until July 4. At the same time, Net Applications reported Internet Explorer firmly in first place, with Google Chrome almost overtaking Firefox as the second. In 2012, responding to Chrome's popularity, Apple discontinued Safari for Windows, making it exclusively available on OS X.\nThe concept of rapid releases established by Google Chrome prompted Mozilla to do the same for its Firefox browser. On June 21, 2011, Firefox 5.0 was the first rapid release for this browser, finished a mere six weeks after the previous edition. Mozilla created four more whole-number versions throughout the year, finishing with Firefox 9 on December 20, 2011. For those desiring long-term support, Mozilla made an Extended Support Release (ESR) version of Firefox 10 on January 31, 2012. Contrary to the regular version, a Firefox ESR received regular security updates plus occasional new features and performance updates for approximately one year, after which a 12-week grace period was given before discontinuing that version number. Those who continued to use the rapid releases with an active Internet connection were automatically updated to Firefox 11 on March 15, 2012. By the end of 2012, however, Chrome overtook both Internet Explorer and Firefox to become the world's most used browser.\nDuring this era, all major web browsers implemented support for HTML video. Supported codecs, however, varied from browser to browser. Then versions of Android, Chrome, and Firefox supported Theora, H.264, and the VP8 version of WebM. Older versions of Firefox omitted H.264 due to it being a proprietary codec, but it was made available beginning in version 17 for Android and version 20 for Windows. Internet Explorer and Safari supported H.264 exclusively on March 14, 2011 with Internet Explorer 9, and on March 18, 2008 with Safari 3.1. However, Theora and VP8 codecs could be manually installed on the desktop versions. Given the popularity of WebKit for mobile browsers, Opera Software discontinued its Presto engine upon the release of Opera 15 on July 2, 2013. The Opera 12 series of browsers were the last to use Presto with its successors using WebKit instead. In 2015, Microsoft discontinued the production of newer versions of Internet Explorer. By this point, Chrome overtook all other browsers as the browser with the highest usage share. Chrome had supported Windows XP until the end of 2015.\nBy 2017 usage shares of Opera, Firefox and Internet Explorer fell well below 5% each, while Google Chrome had expanded to over 60% worldwide. On May 25, 2017, Andreas Gal, former Mozilla CTO, publicly announced that Google Chrome won the Second Browser War.\nAftermath\nDue to Google Chrome's success, in December 2018, Microsoft announced that they would be building a new version of Edge based on Chromium and powered by Google's rendering engine, Blink, rather than their own rendering engine, EdgeHTML. The new Microsoft Edge browser was released on January 15, 2020. Though Firefox showed a slight increase in usage share as of February 2019, it continues to struggle with less than 10% usage share worldwide. By April 2019, worldwide Google Chrome usage share crossed 70% across personal computers and remained over 60% combining all devices. In June 2022, Microsoft permanently retired Internet Explorer in favor of Microsoft Edge as their sole browser. As of January 2023, Microsoft Edge was the 3rd most used web browser having 4.46% as market share. In 2023, Internet Explorer was permanently disabled by Microsoft on most versions of Windows 10.\nAs of 2023, Microsoft Edge has been noted to promote itself when visiting or searching for Google Chrome. Ignoring user settings, links from Windows integrated features, such as widgets, open in Edge.\nIn February 2024, Microsoft silently released the User Choice Protection Driver for Windows 10 and 11 that prevent software changes to the default Browser, requiring users make the changes only through Windows settings. In May 2024, a Chrome extension released by Microsoft maintains Bing as the default search engine.\nSee also\n* After the Software Wars\n* Comparison of web browsers\n* History of the web browser\n* History of the World Wide Web\n* List of web browsers\n* Usage share of web browsers\nReferences\nBibliography\n* DOJ/Antitrust: U.S. Department of Justice Antitrust Division. [http://www.usdoj.gov/atr/cases/f1700/1763.htm Civil Action No. 98-1232 (Antitrust) Complaint, United States of America v. Microsoft Corporation]. May 18, 1998. Press release:\nExternal links\n* [https://archive.org/stream/10Kahle000190#page/n77/mode/2up A March 1998 Interview with Marc Andreessen about Microsoft antitrust litigation and browser wars]\n* [http://www.netvalley.com/intvalweb.html The Roads and Crossroads of Internet History: Chapter 4. Birth of the World Wide Web by Gregory R. Gromov]\n* [https://www.w3schools.com/browsers/browsers_stats.asp Browser Statistics] – Month by month comparison spanning from 2002 and onward displaying the usage share of browsers among web developers\n* [http://www.upsdell.com/BrowserNews/stat.htm Browser Stats] – Chuck Upsdell's Browser Statistics\n* [http://marketshare.hitslink.com/ Browser Stats] – Net Applications' Browser Statistics\n* [http://gs.statcounter.com/ StatCounter Global Stats] – tracks the market share of browsers including mobile from over 4 billion monthly page views\n*\n*  – an article about the development of the browser wars\n* [http://www.cheap-web.com.au/media/webbrowsers-war-2012/ Web Browsers' War – 2012] – An article about web browsers' war in 2012\n* [http://www.tomandmaria.com/tom/Writing/ProtocolsForProfitDRAFT.pdf Thomas Haigh, \"Protocols for Profit: Web and Email Technologies as Product and Infrastructure\" in The Internet & American Business, eds. Ceruzzi & Aspray, MIT Press, 2008]– business & technological history of web browsers, online preprint\n* [http://yourbrowser.is/browser-market-share/ Browser Market Share]  – current market share of browsers and their versions, desktop and mobile"
    }
  ]
}