{
  "content": [
    {
      "type": "text",
      "text": "# Bruce Edwards Ivins\n\n| birth_place       = Lebanon, Ohio, U.S.\n| death_date        =\n| death_place       = Frederick, Maryland, U.S.\n| death_cause       = Suicide by overdose\n| education         = University of Cincinnati (BS, MS, PhD)\n| known_for         = Suspect of the 2001 anthrax attacks\n| workplaces        = United States Army Medical Research Institute of Infectious Diseases\n| field             = Microbiology\n| thesis_title      = Binding, Uptake, and Expression of Diptheria &#91;sic&#93; Toxin in Cultured Mammalian Cells\n| thesis_url        = http://www.worldcat.org/oclc/2554068\n| thesis_year       = 1976\n| doctoral_advisor  = Peter Bonventre\n}}\nBruce Edwards Ivins (; April 22, 1946July 29, 2008) was an American microbiologist, vaccinologist, senior biodefense researcher at the United States Army Medical Research Institute of Infectious Diseases (USAMRIID), Fort Detrick, Maryland, and the person identified by the FBI as the perpetrator of the 2001 anthrax attacks. Ivins died on July 29, 2008, of an overdose of acetaminophen (Tylenol/paracetamol) in a suicide after learning that criminal charges were likely to be filed against him by the Federal Bureau of Investigation (FBI) for an alleged criminal connection to the attacks.\nAt a news conference at the United States Department of Justice (DOJ) on August 6, 2008 (eight days after Ivins' suicide), FBI and DOJ officials formally announced that the government had concluded that Ivins was likely solely responsible for the deaths of five people, and the injury of dozens of others, resulting from the September–October 2001 mailings to members of Congress and to members of the media of several anonymous letters that contained Bacillus anthracis, commonly referred to as anthrax. On February 19, 2010, the FBI released a 92-page summary of evidence against Ivins and announced that it had concluded its investigation. The FBI conclusions have been contested by many, including senior microbiologists, the widow of one of the victims, and several prominent American politicians. Senator Patrick Leahy (D-VT), who was among the targets in the attack, Senator Chuck Grassley (R-IA), Senator Arlen Specter (R-PA), Representative Rush Holt (D-NJ), and Representative Jerrold Nadler (D-NY) all argued that Ivins was not solely responsible for the attacks. No formal charges were ever filed against Ivins for the crime, and no direct evidence of his involvement has been uncovered.\nThe FBI subsequently requested a panel from the National Academy of Sciences (NAS) to review its scientific work on the case. On May 15, 2011, the panel released its findings, which \"conclude[d] that the bureau overstated the strength of genetic analysis linking the mailed anthrax to a supply kept by Bruce E. Ivins.\" The NAS committee stated that its primary finding was that \"it is not possible to reach a definitive conclusion about the origins of the B. anthracis in the mailings based on the available scientific evidence alone.\"\nEarly and family life\nBruce Ivins was born and spent his youth in Lebanon, Ohio, about  northeast of Cincinnati. His parents were Thomas Randall Ivins and Mary Johnson (née Knight) Ivins, and he was the youngest of three brothers. Ivins' father, a pharmacist, owned a drugstore and was active in the local Rotary Club and Chamber of Commerce. The family went regularly to Lebanon Presbyterian Church, although Ivins was later a Catholic parishioner.\nAccording to C.W. Ivins, one of his older brothers, their mother Mary was violent and physically abusive to all three children. When she discovered she was pregnant with Bruce, a pregnancy that was unplanned and unwanted, she repeatedly tried to abort the child by throwing herself down a set of stairs. Ivins would eventually hear the story of his mother's attempt to abort him.\nAvidly interested in science, Ivins was an active participant in extracurricular activities in high school, including the National Honor Society, science fairs, the current events club, and the scholarship team all four years. He ran on the track and cross-country teams, worked on the yearbook and school newspaper, and was in the school choir and junior and senior class plays.\nIn December 1975, Ivins married nursing student Mary Diane Betsch (known as Diane), to whom he remained married until his death. The couple had two children. Diane Ivins was a homemaker and full time parent who also ran a daycare center out of the family's home. His wife, children, and brothers were all still alive at the time of his death; his parents were deceased.\nEducation and career\nIvins graduated with honors from the University of Cincinnati (UC) with a B.S. degree in 1968, an M.S. degree in 1971, and a Ph.D. degree in 1976, all in microbiology. Ivins conducted his Ph.D. research under the supervision of Dr. Peter&nbsp;F. Bonventre. His dissertation focused on different aspects of toxicity in disease-causing bacteria.\nIvins was a scientist for 36 years and senior biodefense researcher at the United States Army Medical Research Institute of Infectious Diseases (USAMRIID) in Fort Detrick, Maryland for 18 years. After conducting research on Legionella and cholera, in 1979, Ivins turned his attention to anthrax after the anthrax outbreak in the Soviet city of Sverdlovsk (now known as Yekaterinburg), which killed at least 105 after an accidental release at a military facility.\nIvins had published at least 44 scientific papers dating back to May 18, 1969. His earliest known published work pertained to the response of peritoneal macrophages, a type of white blood cell, to infection by Chlamydia psittaci, an infectious bacterium that can be transmitted from animals to humans. Ivins often cited the 2001 anthrax attacks in his papers to bolster the significance of his research in years subsequent to the attacks. In a 2006 paper published in the prestigious journal Proceedings of the National Academy of Sciences, he wrote with his co-authors\nIvins was a co-inventor on two United States patents for anthrax vaccine technology,  and . Both of these patents are owned by his employer at the time, the United States Army. On March 14, 2003, Ivins and two of his colleagues at USAMRIID received the Decoration for Exceptional Civilian Service&nbsp;— the highest award given to Defense Department civilian employees — for helping solve technical problems in the manufacture of anthrax vaccines.\nAlleged involvement in 2001 anthrax attacks and investigations\nThe 2001 anthrax attacks involved the mailing of several letters proclaiming, \"Death to America&nbsp;... Death to Israel&nbsp;... Allah is Great\", and contaminated with anthrax to the offices of U.S. Senators Tom Daschle and Patrick Leahy, as well as to the offices of ABC News, CBS News, NBC News, the New York Post, and the National Enquirer.\nInitial investigative role\nIvins became involved in the investigation of the anthrax attacks because he was regarded as a skilled microbiologist. Starting in mid-October, he and his colleagues worked long hours testing samples to distinguish real anthrax letters from the numerous hoaxes that were sent out at this time. Ivins also helped the FBI analyze the powdery material recovered from one of the anthrax-tainted envelopes sent to a U.S. senator's office in Washington, D.C.\nResults of the investigation were initially distributed to the public via ABC News, claiming \"four well placed sources\" had confirmed that \"trace amounts of the chemical additives bentonite\" were found in the anthrax samples, and that this was the chemical signature of Iraqi-made anthrax. However, it was later confirmed that no bentonite was ever found in the anthrax samples. While it is presumed that Ivins was one of ABC News' four sources, ABC refused to reveal their identities, which has contributed to a mystery surrounding Ivins' role in the initial investigation and its widely reported findings.\n2002 Fort Detrick anthrax containment breach\nIn 2002, an investigation was carried out as a result of an incident at Fort Detrick where anthrax spores had escaped carefully guarded rooms into the building's unprotected areas. The incident called into question the ability of USAMRIID to keep its deadly agents within laboratory walls seven months after the anthrax mailings.\nA coworker reportedly told Ivins that she was concerned she was exposed to anthrax spores when handling an anthrax-contaminated letter. Ivins tested the technician's desk area December 2001 and found growth that had the hallmarks of anthrax. He decontaminated her desk, computer, keypad and monitor, but did not notify his superiors.\n2008 investigation\nFor six years, the FBI focused its investigation on Steven Hatfill, considering him to be the chief suspect in the attacks. In March 2008, however, authorities exonerated Hatfill and settled a lawsuit he initiated for $5.8 million. According to ABC News, some in the FBI considered Ivins a suspect as early as 2002. FBI director Robert Mueller changed leadership of the investigation in late 2006, and at that time Ivins became the main focus of the investigation.\nAfter Hatfill was no longer considered a suspect, Ivins began \"showing signs of serious strain\". As a result of his changed behavior, he lost access to sensitive areas at his job. Ivins began being treated for depression and expressed some suicidal thoughts. On March 19, 2008, police found Ivins unconscious at his home in Frederick and sent him to the hospital.\nIn June 2008, Ivins was involuntarily committed to a psychiatric hospital. The FBI said that during a June 5 group therapy session there, he had a conversation with a witness, during which he made a series of statements about the anthrax mailings that the FBI said could best be characterized as \"non-denial denials\". When asked about the anthrax attacks and whether he could have had anything to do with them, the FBI said that Ivins admitted he suffered from loss of memory, stating that he would wake up dressed and wonder if he had gone out during the night. His responses allegedly included the following:\n:: \"I can tell you I don't have it in my heart to kill anybody\"\n:: \"I do not have any recollection of ever have doing anything like that. As a matter of fact, I don't have no clue how to, how to make a bio-weapon and I don't want to know.\"\n:: \"I can tell you, I am not a killer at heart\"\n:: \"If I found out I was involved in some way, and, and&nbsp;...\"\n:: \"I don't think of myself as a vicious, a, a nasty evil person.\"\n:: \"I don't like to hurt people, accidentally, in, in any way. And [several scientists at USAMRIID] wouldn't do that. And I, in my right mind wouldn't do it [laughs]&nbsp;... But it's still, but I still feel responsibility because it [the anthrax] wasn't locked up at the time&nbsp;...\"\nLate in July 2008, investigators informed Ivins of his impending prosecution for alleged involvement in the 2001 anthrax attacks that Ivins himself had previously assisted authorities in investigating. It was reported that the death penalty would have been sought in the case. Ivins maintained his security clearance until July 10; he had been publicly critical of the laboratory's security procedures for several years.\nW. Russell Byrne, a colleague who worked in the bacteriology division of the Fort Detrick research facility, said FBI agents \"hounded\" Ivins by twice raiding his home and that Ivins had been hospitalized for depression earlier in the month. According to Byrne and local police, Ivins had been removed from his workplace out of fears that he might harm himself or others. \"I think he was just psychologically exhausted by the whole process\", Byrne said. \"There are people who you just know are ticking bombs\", Byrne said. \"He was not one of them.\" However, Tom Ivins, who last spoke to his brother in 1985, said, \"It makes sense&nbsp;... he considered himself like a god.\"\nThe Los Angeles Times wrote that Ivins stood to profit from the attacks because he was a co-inventor on two patents for a genetically engineered anthrax vaccine. San Francisco-area biotechnology company VaxGen licensed the vaccine and won a federal contract valued at $877.5 million to provide the vaccine under the Project Bioshield Act.\nOn August 6, 2008, eight days after Ivins' self-inflicted death, U.S. Attorney Jeffrey A. Taylor officially made a statement that Ivins was the \"sole culprit\" in the 2001 anthrax attacks. Taylor stated that Ivins had submitted false anthrax evidence to throw investigators off his trail, was unable to adequately explain his late laboratory working hours around the time of the attacks, tried to frame his co-workers, had immunized himself against anthrax in early September 2001, was one of more than 100 people with access to the same strain of anthrax used in the killings, and had used similar language in an email to that in one of the anthrax mailings. Ivins was also reportedly upset that the anthrax vaccine that he had spent years helping develop was being pulled from the market.\nDeath\nOn the morning of July 27, 2008, Ivins was again found unconscious at his home. He was taken to Frederick Memorial Hospital and died on July 29 from what was then called an overdose of Tylenol with codeine, an apparent suicide. No autopsy was ordered following his death because, according to an officer in the local police department, the state medical examiner \"determined that an autopsy wouldn't be necessary\" based on laboratory test results of blood taken from the body. A summary of the police report of his death, released in 2009, lists the cause of death as liver and kidney failure, citing his purchase of two bottles of Tylenol PM (containing diphenhydramine), contradicting earlier reports of Tylenol with codeine. His family declined to put him on the liver transplant list, and he was removed from life support.\nThe FBI declined to comment on the situation. Ivins' attorney released a statement saying that Ivins had co-operated with the FBI's six-year investigation and was innocent.\nAnthrax investigation, post-death\nCriticism of the official findings\nPaul Kemp, Ivins' attorney, stated that the government's case against Ivins was \"not convincing.\" Justice Department official Dean Boyd stated that Ivins mailed anthrax to NBC in retaliation for an investigation of Ivins' laboratory's work on anthrax conducted by Gary Matsumoto, a former NBC News journalist. At the time, however, Matsumoto was working for ABC, not NBC. Boyd responded by saying that the FBI now believes that Ivins used countermeasures to deceive the polygraph examiners. \"There are clearly a lot of unanswered questions,\" said Senator Chuck Grassley, who called for a congressional investigation into the allegations that Ivins was the anthrax killer.\nThose who argue for Ivins' innocence say that the anthrax used in the attacks was too sophisticated to be produced by a lone researcher without relevant training. Richard O. Spertzel, a microbiologist who led the United Nations' biological weapons inspections of Iraq, wrote that the anthrax used could not have come from the lab where Ivins worked. \"In my opinion, there are maybe four or five people in the whole country who might be able to make this stuff, and I'm one of them,\" said Spertzel, who was also the former deputy commander of USAMRIID. \"And even with a good lab and staff to help run it, it might take me a year to come up with a product as good.\" The spores in the Daschle letter were 1.5 to 3 micrometres across, many times smaller than the finest known grade of anthrax produced by either the U.S. or Soviet bioweapons programs. An electron microscope, which costs hundreds of thousands of dollars, would be needed to verify that the target spore size had been consistently achieved. The presence of the anti-clumping additive silicon dioxide in the anthrax samples also suggests a high degree of sophistication as specialists working at Lawrence Livermore National Laboratory were unable to duplicate this property despite 56 attempts.\nWhile not outright rejecting the theory of Ivins' involvement, Senator Leahy said that \"if he is the one who sent the letter, I do not believe in any way, shape or manner that he is the only person involved in this attack on Congress and the American people. I do not believe that at all.\"\nAllegations of mental illness\nOn August 6, 2008, the FBI released a collection of emails written by Ivins. In some, Ivins describes episodes of depression, anxiety, and paranoia for which he was medicated; these are referenced in the summary of the case against Ivins. A psychiatrist engaged by The New York Times to analyze the released documents found evidence of psychoses, but could not rule out the possibility that Ivins was feigning or exaggerating mental illness for purposes of attention or sympathy.\nA United States government investigative panel, called the Expert Behavioral Analysis Panel, issued a report in March 2011 which detailed more of Ivins' mental health issues. According to the panel's report, the Army did not examine Ivins' background adequately before clearing him to work with anthrax, and such clearance should not have been given. The report endorses the government's implication of Ivins: circumstantial evidence from Ivins' psychiatric history supported the conclusion that Ivins was the anthrax killer.\nAllegations by Ivins' counselor\nSocial worker Jean C. Duley applied for a protective order, writing that Ivins had stalked and threatened to kill her and had a long history of homicidal threats. Duley stated that she had treated Ivins for six months, after which she said he threatened to \"go out in a blaze of glory\".  When she forwarded this information to the FBI, she said he left rants on her voicemail that blamed her for his legal issues.\nDuley had been set to give testimony against Ivins on August 1, 2008. Ivins, however, had no criminal record, whereas Duley had a history of convictions for driving under the influence and charges of battery of her ex-husband. The charges forced her to quit her job, and attorney costs used up her savings, according to her fiancé. In a 1999 newspaper interview, Duley described herself as a former motorcycle gang member and drug user: \"Heroin. Cocaine. PCP. You name it, I did it.\" According to an article originally appearing in the Frederick News-Post on August 12, 2009, Duley was under house arrest when she recorded Ivins' allegedly threatening messages. The News-Post also made available a recording of the allegedly threatening calls. The newspaper characterized the messages as not being threatening but instead \"the sad ramblings of a broken man who felt betrayed\".\nIn her July 2008 restraining order, Duley alleged that Ivins had a history of threats. She further alleged a \"detailed homicidal plan\" to kill his co-workers after learning he was going to be indicted on capital murder charges and stated that, upon hearing of his possible indictment, Ivins had purchased a gun and a bulletproof vest. Ivins was subsequently committed for psychiatric evaluation and his home was raided by federal agents who confiscated ammunition and a bulletproof vest. He was released from his committal on July 24, five days before his death.\nStatement by Henry S. Heine\nHenry S. Heine, a microbiologist who was Ivins' fellow researcher at the USAMRIID, told a National Academy of Sciences (NAS) panel on April 22, 2010, that he considered it impossible that Ivins could have produced the anthrax used in the attacks without detection. Heine told the 16-member panel that producing the quantity of spores in the letters would have taken at least a year of intensive work using the equipment at the USAMRIID laboratory. Such an effort would not have escaped colleagues' notice, and laboratory technicians who worked closely with Ivins have told him they saw no such work. Heine also stated that biological containment measures where Ivins worked were inadequate to prevent the spores from floating out of the laboratory into animal cages and offices, saying, \"You'd have had dead animals or dead people\".\nHeine said he did not dispute that there was a genetic link between the spores in the letters and the anthrax in Ivins' flask, which led the FBI to conclude that Ivins had grown the spores from a sample taken from the flask. Heine pointed out that samples from the flask were widely shared. Accusing Ivins of the attacks, he said, was like tracing a murder to the clerk at the sporting goods shop who sold the bullets. Asked by reporters after his testimony whether he believed there was any chance that Ivins had carried out the attacks, Heine replied, \"Absolutely not.\" At the USAMRIID, he said, \"among the senior scientists, no one believes it.\"\nNational Academy of Sciences scientific evidence review\nThe FBI asked the NAS to review the Bureau's scientific work on the case. A panel was created, chaired by Alice P. Gast, president of Lehigh University. On May 15, 2011, the panel released its findings, which \"conclude[d] that the bureau overstated the strength of genetic analysis linking the mailed anthrax to a supply kept by Bruce E. Ivins.\"\nCalls for further investigation\nFollowing the release of an NAS report in February 2011, Congressman Rush D. Holt, Jr. (D-NJ), a physicist from whose district the anthrax letters were mailed, re-introduced legislation \"to create a 9/11-style Commission, complete with subpoena power, with a mandate to review the entire matter.\" Senator Chuck Grassley told The Washington Post: \"There are no more excuses for avoiding an independent review.\" Journalist Glenn Greenwald, who was vocal in his criticism of the anthrax investigation, argued that \"[o]ther than a desire to avoid finding out who the culprit was (or to avoid having the FBI's case against Ivins subjected to scrutiny), there's no rational reason to oppose an independent investigation into this matter.\"\nInterests and beliefs\nPersonal life\nIvins was a Roman Catholic. The News-Post made public several letters to the editor written by Ivins dealing with his religious views. These were cited in the Department of Justice summary of the case against Ivins as suggesting that he may have harbored a grudge against pro-choice Catholic senators Daschle and Leahy, recipients of anthrax mailings. In a letter, Ivins stated, \"By blood and faith, Jews are God's chosen, and have no need for 'dialogue' with any gentile.\" Ivins praised a rabbi for refusing a dialogue with a Muslim cleric.\nIvins' pastimes included playing keyboard at his local church, Saint John the Evangelist; he was a member of the American Red Cross; he was an avid juggler and founder of the Frederick Jugglers. Ivins played keyboards in a Celtic band and would often compose and play songs for coworkers who were moving to new jobs.\nObsession with sororities and stalking allegation\nAccording to multiple former colleagues and acquaintances, as well as FBI investigators, Ivins maintained a decades-long obsession with college sororities, particularly Kappa Kappa Gamma (KKG), and with particular women. Ivins' attorney, Paul Kemp, described this fixation as dating back to Ivins' time as a college student at the University of Cincinnati, when he was rebuffed by a member of Kappa Kappa Gamma. But according to Dr. Rick Sams, a pharmacologist and former school friend, Ivins had described feelings of resentment toward women stemming from his high school years.\nDuring the 2001 anthrax investigations, FBI investigators learned (in part from information provided by Ivins himself) that after college, Ivins had made uninvited visits to Kappa Kappa Gamma sorority houses at multiple universities, including the University of North Carolina, the University of Maryland, and West Virginia University, and had once stolen a sorority chapter's ritual book and cipher device. In more recent years, he made extensive online posts about Kappa Kappa Gamma using various pseudonymous handles, including edits to Wikipedia on the topic.\nDr. Nancy Haigwood, the director of the Oregon National Primate Research Center and a Kappa Kappa Gamma member who was a colleague of Ivins at the University of North Carolina when he was a post-doctoral fellow, later recounted to the New York Times a series of intrusive and unsettling interactions with Ivins in the late 1970s and 80s, claiming that \"he damaged my property, he impersonated me and he stalked me\". A United States government investigative panel called the Expert Behavioral Analysis Panel issued a report in March 2011 which described in more detail Ivins' obsession with the sorority and his alleged violations of Haigwood, which included stealing a notebook documenting her doctoral research and vandalizing her residence. Such behavior does not appear to have been anomalous for Ivins, who himself admitted to FBI investigators that he once drove through the night to Ithaca, New York, to leave gifts for a young woman who had left her job in his laboratory to attend Cornell University.\nAuthorities investigating the anthrax attacks found anthrax spores in a postal drop box located at 10 Nassau Street in Princeton, New Jersey,  from a storage facility where the Princeton University chapter of Kappa Kappa Gamma kept rush paraphernalia, initiation robes, and other property as of 2001. However, no evidence was found to place Ivins in Princeton on the day the letters were mailed. Katherine Breckinridge Graham, an advisor to KKG's Princeton chapter, stated that there was nothing to indicate that any of the sorority members had anything to do with Ivins.\nBiography\nIn 2011, journalist David Willman's book on Ivins, ''The Mirage Man: Bruce Ivins, the Anthrax Attacks, and America's Rush to War'', was published. The book details Ivins' troubled history and mental problems.\nIn popular culture\nThe 2001 anthrax attack was featured in the TV series The Hot Zone. Ivins was played by actor Tony Goldwyn.\nThe 2022 Netflix documentary, The Anthrax Attacks: In the Shadow of 9/11, features Bruce Ivins prominently and shows him portrayed by actor Clark Gregg in re-enactments.\nPatents\n* November 13, 2001, Asporogenic B anthracis expression system\n* May 14, 2002, Method of making a vaccine for anthrax\nReferences\nExternal links\n* [https://www.ncbi.nlm.nih.gov/sites/entrez?cmd=search&db=pubmed&term=%20Ivins%20BE%5Bauth%5D PubMed Ivins BE as author]\n* [https://scholar.google.com/scholar?as_q=&num=100&btnG=Search+Scholar&as_epq=&as_oq=&as_eq=&as_occt=any&as_sauthors=Bruce+E.+Ivins&as_publication=&as_ylo=&as_yhi=&as_allsubj=all&hl=en&lr=&safe=off Google Scholar Bruce E. Ivins publications]\n*\n*[https://web.archive.org/web/20081120160808/http://publicservice.evendon.com/DOJAnthraxIvinsM.htm 2008 Court Documents and DOJ Report] in convenient form\n*\n*[https://www.fredericknewspost.com/news/continuing_coverage/bruce_ivins/ News articles of Bruce Ivins] in the Frederick News-Post"
    }
  ]
}