{
  "content": [
    {
      "type": "text",
      "text": "# Bryden, Queensland\n\n| pop                 = 22\n| pop_year            =\n| pop_footnotes       =\n| established         =\n| postcode            = 4312\n| area                = 79.0\n| timezone            = AEST\n| utc                 = +10:00\n| dist1               = 27.3\n| dir1                = N\n| location1           = Fernvale\n| dist2               = 41.5\n| dir2                = E\n| location2           = Esk\n| dist3               = 51.9\n| dir3                = NNW\n| location3           = Ipswich\n| dist4               = 72.4\n| dir4                = NW\n| location4           = Brisbane CBD\n| lga                 = Somerset Region\n| stategov            = Nanango\n| fedgov              = Blair\n| near-n              = CrossdaleMount Byron\n| near-ne             = Mount Byron\n| near-e              = Dundas\n| near-se             = Dundas\n| near-s              = Lake Wivenhoe\n| near-sw             = Lake Wivenhoe\n| near-w              = Lake Wivenhoe\n| near-nw             = Crossdale\n}}\nBryden is a rural locality in the Somerset Region of Queensland, Australia, approximately 50 kilometres north-west of the state capital, Brisbane. In the , Bryden had a population of 22 people.\nGeography\nThe east of Bryden contains undeveloped bushland on the western slopes of the D'Aguilar Range.\nHistory\nThe original inhabitants of the Bryden area were the indigenous Wakka Wakka people. The name Bryden comes from the name of the first European settler in the area, which was originally named Deep Creek.\nOn 17 April 1876, the Mount Brisbane Provisional School opened in a bark hut built for free by Carl Blank. There was an initial enrolment of 26 students with one teacher, Mr Goodwin. In 1879, it became Mount Brisbane State School. In 1893, it was renamed Deep Creek State School and, in 1930, it was renamed Bryden State School.\nFrom 1929, low students numbers caused a number of temporary closures, shared teacher arrangements with Dundas State School, and correspondence school arrangements. In 1936, all teaching ceased at the school. On 14 April 1947, the school reopened as Bryden Provisional School, which closed on 13 May 1963. It was on a  site on Loughrans Road ().\nOn Sunday 19  August 1900, the foundation stone was laid for a Catholic church by Reverend Father Ryan. On Sunday 17 February 1901, the church was officially opened and dedicated as St Anne's Catholic Church by Ryan, because Archbishop Dunne was unable to attend. The church with a cemetery at the rear was on a  site at 2479 Wivenhoe Somerset Road (corner of Corcorans Road, ). The church is no longer extant but the cemetery remains.\nOn Sunday 18 December 1927, the Bryden Hall burned down after having been used on Saturday night. The new Bryden Hall was officially opened on Saturday 1 September 1928 by Ernest Grimstone, the local Member of the Queensland Legislative Assembly. In 1980, the hall was relocated to the Esk Showgrounds.\nDemographics\nIn the , Bryden was included in the population statistics for a wider area including Crossdale, which recorded a population of 190.\nIn the , Bryden had a population of 33 people.\nIn the , Bryden had a population of 22 people.\nHeritage listings\nBryden has a number of heritage-listed sites, including Castleholme Homestead along Bryden-Crossdale Road.\nEducation\nThere are no schools in Bryden. The nearest government primary schools are Fernvale State School in Fernvale to the souths and Toogoolawah State School in Toogoolawah to the north-west. The nearest government secondary schools are Lowood State High School in Lowood to the south and Toogoolawah State High School in Toogoolawah to the north-west.\nFacilities\nThere is a Catholic cemetery 2479 Wivenhoe Somerset Road (corner of Corcorans Road, ) behind the former Catholic Church and adjacent to the Castleholme Homestead.\nReferences"
    }
  ]
}