{
  "content": [
    {
      "type": "text",
      "text": "# Buckingham potential\n\nIn theoretical chemistry, the Buckingham potential is a model of intermolecular interactions based on pair potentials developed by Richard Buckingham. The model describes repulsion by the Pauli exclusion principle and attraction by van der Waals forces between all atom pairs that are not directly bonded as a function of the interatomic distance r.\nThe interatomic potential,\n:\\Phi_{12}(r) = A \\exp \\left(-Br\\right) - \\frac{C}{r^6}\nis given by two terms that represent the attraction and the repulsion, respectively. The constants, A, B, and C are parametrizations of the model tuned to the specific type of each atom pair.\nBuckingham proposed this as a simplification of the Lennard-Jones potential, in a theoretical study of the equation of state for gaseous helium, neon and argon.\nAs explained in Buckingham's original paper and, e.g., in section 2.2.5 of Jensen's text, the repulsion is due to the interpenetration of the closed electron shells. \"There is therefore some justification for choosing the repulsive part (of the potential) as an exponential function\". The Buckingham potential has been used extensively in simulations of molecular dynamics.\nBecause the exponential term converges to a constant with decreasing distance, while the r^{-6} term diverges, the Buckingham potential becomes attractive as r becomes small. This may be problematic when dealing with a structure with very short interatomic distances, as any nuclei that cross a certain threshold will become strongly (and unphysically) bound to one another at a distance of zero.\nModified Buckingham (Exp-Six) potential\nThe modified Buckingham potential, also called the \"exp-six\" potential, is used to calculate the interatomic forces for gases based on Chapman and Cowling collision theory. The potential has the form\n\\Phi_{12}(r) = \\frac{\\epsilon}{1-6/\\alpha}\\left[ \\frac6\\alpha \\exp \\left[\\alpha\\left(1-\\frac{r}{r_{min}}\\right)\\right] - \\left(\\frac{r_{min}}{r}\\right)^6\\right]\nwhere \\Phi_{12}(r)  is the interatomic potential between atom i and atom j, \\epsilon  is the minimum potential energy, \\alpha  is the measurement of the repulsive energy steepness which is the ratio \\sigma/r_{min} , \\sigma\nis the value of  r  where \\Phi_{12}(r)  is zero, and r_{min}  is the value of r  which can achieve the minimum interatomic potential \\epsilon . This potential function is only valid when r>r_{max} , as the potential will decay towards -\\infty as r \\rightarrow 0. This is corrected by identifying r_{max} , which is the value of r  at which the potential is maximized; when r\\leq{r_{max}} , the potential is set to infinity.\nCoulomb–Buckingham potential\nThe Coulomb–Buckingham potential is an extension of the Buckingham potential for application to ionic systems (e.g. ceramic materials). The formula for the interaction is\n:\\Phi_{12}(r) = A \\exp \\left(-Br\\right) - \\frac{C}{r^6} + \\frac{q_1q_2}{4\\pi\\varepsilon_0 r}\nwhere A, B, and C are suitable constants and the additional term is the electrostatic potential energy.\nThe above equation may be written in its alternate form as\n:\\Phi(r) = \\varepsilon \\left\\{ \\frac{6}{\\alpha-6}\\exp \\left(\\alpha\\left[1-\\frac{r}{r_0}\\right]\\right) - \\frac{\\alpha}{\\alpha-6} \\left(\\frac{r_0}{r}\\right)^6 \\right\\}+ \\frac{q_1q_2}{4\\pi\\varepsilon_0 r}\nwhere  r_0 is the minimum energy distance,  \\alpha is a free dimensionless parameter and  \\varepsilon  is the depth of the minimum energy.\nBeest Kramer van Santen (BKS) potential\nThe BKS potential is a force field that may be used to simulate the interatomic potential between Silica glass atoms. Rather than relying only on experimental data, the BKS potential is derived by combining ab initio quantum chemistry methods on small silica clusters to describe accurate interaction between nearest-neighbors, which is the function of accurate force field. The experimental data is applied to fit larger scale force information beyond nearest neighbors. By combining the microscopic and macroscopic information, the applicability of the BKS potential has been extended to both the silica polymorphs and other tetrahedral network oxides systems that have same cluster structure, such as aluminophosphates, carbon and silicon.\nThe form of this interatomic potential is the usual Buckingham form, with the addition of a Coulomb force term. The formula for the BKS potential is expressed as\n: \\Phi_{12}(r) = \\left[ A_{12} \\exp \\left(-B_{12}r_{12}\\right) - \\frac{C_{12}}{r_{12}^6}\\right] + \\frac{q_1q_2}{r_{12}}\nwhere \\Phi_{12}(r)  is the interatomic potential between atom i and atom j, q_1 and q_2  are the charges magnitudes, r_{12}  is the distance between atoms, and A_{ij} ,B_{ij}  and C_{ij}  are constant parameters based on the type of atoms.\nThe BKS potential parameters for common atoms are shown below:\n{| class=\"wikitable\"\n|+BKS parameters\n!i-j\n!Aij(eV)\n!Bij(Å−1)\n!Cij(eV•Å6)\n|-\n|O - O\n|1388.7730\n|2.76000\n|175.0000\n|-\n|O - Si\n|18,003.757\n|4.87318\n|133.5381\n|-\n|Si - Si\n|0\n|0\n|0\n|-\n|Al - O\n|16,008.5345\n|4.79667\n|130.5659\n|-\n|Al - Al\n|0\n|0\n|0\n|-\n|P - O\n|9,034.2080\n|5.19098\n|19.8793\n|-\n|P - P\n|0\n|0\n|0\n|}\nAn updated version of the BKS potential introduced a new repulsive term to prevent atom overlapping. The modified potential is taken as\n\\Phi_{12}(r) = \\left[ A_{12} \\exp \\left(-B_{12}r_{12}\\right) - \\frac{C_{12}}{r_{12}^6}\\right] + \\frac{q_1q_2}{r_{12}} + \\frac{D_{12}}{r_{12}^{24}}\nwhere the constant parameters D_{ij} were chosen to have the following values for Silica glass:\n{| class=\"wikitable\"\n|+Parameter value for Silica glass\n!\n!Si - Si\n!Si - O\n!O - O\n|-\n!Dij(eV•Å24)\n|3423200\n|29\n|113\n|}\nReferences\nExternal links\n*[http://www.sklogwiki.org/SklogWiki/index.php/Buckingham_potential Buckingham potential] on [http://www.sklogwiki.org/SklogWiki/index.php/Main_Page SklogWiki]"
    }
  ]
}