{
  "content": [
    {
      "type": "text",
      "text": "# Buckingham Palace Conference\n\nThe Buckingham Palace Conference, sometimes referred to as the Buckingham Palace Conference on Ireland, was a conference called in Buckingham Palace in 1914 by King George V to which the leaders of Irish Nationalism, John Redmond and Irish Unionism Edward Carson, were invited to discuss plans to introduce Irish Home Rule and avert a feared civil war on the issue. The King's initiative brought the leaders of Nationalism and Unionism together for the first time in a conference.\nBackground\nSince the 1870s, a concerted campaign had been made by Irish nationalist leaders at Westminster, in particular by Charles Stewart Parnell, to have Home Rule (regional self-government) introduced into Ireland. This demand, however, was opposed by the leaders of Irish Unionism, who feared being placed under a Catholic-Nationalist dominated Irish parliament in Dublin. For Unionists, the ultimate safeguard to prevent Home Rule had been the existence of the power of the House of Lords to veto legislation. The Lords, with an inbuilt pro-Unionist Conservative Party majority, exercised its veto, in 1893, to block the Second Home Rule Bill.\nAs a result of a reduction of its powers under the Parliament Act 1911, the Lords' ability to veto Bills was greatly restricted. In 1912 the government of H. H. Asquith introduced the Third Home Rule Bill. Under the Parliament Act, the Lords could block a Bill for only three sessions. As a result, the Bill finally completed its passage and received the Royal Assent in mid-1914.\nThe threat that the Bill would this time become law led to protests among Unionists. The leaders of the opposition Conservative Party opted to play the \"Orange Card\": in 1886, Lord Randolph Churchill had used the phrase: \"Ulster will fight and Ulster will be right\". In 1912, leader Bonar Law threatened to give support for whatever actions Unionists took, whether legal or illegal, to prevent home rule.\nIllegal gun-running occurred among both unionists (at Larne) and nationalists (at Howth), and both sides openly organised mass militia movements (the Ulster Volunteers and the Irish Volunteers respectively). Faced with what seemed to be imminent civil war, King George – a strong Hibernophile since his days as a naval officer based in Cork – intervened to stop what be believed was the slide to civil war, and took the unprecedented step of inviting the leaders of both communities, along with the British government, to the Palace for a conference.\nThe Conference\nThe conference met in Buckingham Palace between 21 and 24 July 1914. Though the issue of home rule had been on the political agenda since the 1870s, the 1914 conference was the first formal peace conference involving both Nationalists and Unionists. Those who attended were the Prime Minister H. H. Asquith, Lloyd George, the Irish Parliamentary Party leader John Redmond, his deputy, John Dillon, across the table the leader of the Irish Unionist Alliance, Edward Carson together with Bonar Law, James Craig and Lord Lansdowne. The Speaker of the House of Commons presided.\nBy the second day Asquith saw that no agreement as to which counties were to be temporarily excluded was going to emerge. He wrote to an associate: \"I have rarely felt more helpless in any particular affair, an impasse with unspeakable consequences, upon a matter which to English eyes seems inconceivably small and to Irish eyes immeasurably big. Isn't it a real tragedy?\"\nThe conference broke up after three days without agreement. The issue was whether counties Fermanagh and Tyrone would be part of a proposed north-eastern state. All sides, however, stated that it had been a useful engagement, with Unionists and Nationalists for the first time having meaningful discussions on how to allay their fears about the other. A limited understanding emerged between Carson and the Nationalists that if Ulster were to be excluded, in its entirety, the province should come in or out as a whole. The conference was overtaken by developments in Europe. Eleven days after the conference ended, the King declared war on Germany and Britain entered World War I. Parliament voted for the Home Rule Act and for its suspension for the war's duration.\nA further attempt to reach an understanding with Ulster was to prove equally unsuccessful during the 1917–18 Irish Convention. This conference was seen to be a 'waste of time,' as it produced no agreement or resolutions; people saw it as a time for each party to slander the other.\nIn retrospect, the conference was the first occasion where the Partition of Ireland was discussed as a concrete political option. At the time it was envisioned as involving continued British rule over the whole island, with one part included in the autonomous \"Home Rule\" and another part excluded from it, while partition as finally realized in 1922 involved creating an international border between the Irish Free State (later Irish Republic) and the British ruled Northern Ireland. Still, the basic reason for the actual 1922 partition was the same as for the one discussed at Buckingham Palace eight years before – i.e. the total refusal of the Ulster Unionists to become part of a predominantly Irish Catholic entity, whether or not under an overall British rule.\nLong-term impact\nThe King's idea of hosting all-party talks on Ireland had echoes in later negotiations that produced the power-sharing executive in the Sunningdale Agreement in the 1970s, and in the negotiations that produced the Belfast Agreement in the late 1990s.\nLater interventions by George V on Ireland\nKing George intervened on a number of subsequent occasions on Ireland. In 1920 he made clear his opposition to the behaviour of the Black and Tans paramilitary force being used by the British Government during the Irish War of Independence and unsuccessfully intervened to try to save the life of hunger striker Terence MacSwiney. After the Government of Ireland Act 1920 was passed, he made a passionate appeal for reconciliation in Ireland at the opening of the Parliament of Northern Ireland in 1921 which contributed to a truce between the Irish Republic and the United Kingdom of Great Britain and Ireland, paving the way for the Anglo-Irish Treaty.\nIn 1932 he defused a row between the President of the Executive Council of the Irish Free State, Éamon de Valera, and the Governor-General of the Irish Free State, James McNeill, by getting de Valera to withdraw a request for McNeill's dismissal, and then getting McNeill to take early retirement. De Valera later admitted that the Irish government's criticism of McNeill had been unwarranted.\nReferences\nSources and Further reading\n* Hennessey, Thomas. Dividing Ireland: World War 1 and Partition (1998),\n* Jackson, Alvin. Home Rule: an Irish History 1800–2000, (2003),\n* Jalland, Patricia, and John O. Stubbs. \"The Irish question after the outbreak of war in 1914: some unfinished party business.\" English Historical Review 96.381 (1981): 778–807. [https://www.jstor.org/stable/569840 online]\n* Kee, Robert. The Green Flag: A History of Irish Nationalism (2000 edition, first published 1972),\n* Kennedy, Thomas C. \"War, Patriotism, and the Ulster Unionist Council, 1914-18.\" Éire-Ireland 40.2 (2005): 189–211. [https://muse.jhu.edu/article/189961/summary online]\n* Lewis, Geoffrey. Carson, the Man who divided Ireland (2005),\n* Macardle, Dorothy. The Irish Republic (Corgi, 1968)\n* Nicolson, Harold. King George V (1953) pp 233–247. [https://archive.org/details/kinggeorgefifthh00nico online]\n* Pakenham, Frank. Peace by Ordeal (1992)\n* Rast, M. C. \"'A Settlement Nobody Wants': Exclusion Gains Ground, 1913–1914.\" in Rast, Shaping Ireland’s Independence (Palgrave Macmillan, Cham, 2019) pp.&nbsp;119–161.\n* Rodner, W. S. \"Leaguers, Covenanters, Moderates: British Support for Ulster, 1913–14\" Éire-Ireland, (1982) 17#3 pp.&nbsp;68–85.\n* Smith, Jeremy. \"Bluff, Bluster and Brinkmanship: Andrew Bonar Law and the Third Home Rule Bill\" Historical Journal 35#1 (1993) pp.&nbsp;161–174 [https://www.jstor.org/stable/2639520 online].\n* A.T.Q. Stewart The Ulster Crisis, Resistance to Home Rule, 1912–14, (Faber and Faber, London, 1967, 1979),\n* Stubbs, John O. \"The unionists and Ireland, 1914-18.\" Historical Journal 33.4 (1990): 867–893. [https://www.jstor.org/stable/2639802 online]\n* de Wiel, Jérôme aan. \"The 'Irish factor' in the outbreak of war in 1914.\" History Ireland 19.4 (2011): 32–35. [https://www.jstor.org/stable/41231664 online]\n* de Wiel, Jérôme aan. \"1914: What will the British do? The Irish Home Rule Crisis in the July Crisis.\" International History Review 37.4 (2015): 657–681."
    }
  ]
}