{
  "content": [
    {
      "type": "text",
      "text": "# Buckminster-Kingsbury Farm\n\n| locmapin     = New Hampshire#USA\n| built        = c.\n| architect    =\n| architecture = Federal, Greek Revival\n| added        = December 30, 2011\n| area         =\n| refnum       = 11000964\n}}\nThe Buckminster-Kingsbury Farm is a historic farmhouse at 80 Houghton Ledge Road in Roxbury, New Hampshire.  The brick house was built c. 1825, and is a well-preserved example of vernacular Federal and Greek Revival styling.  The house was listed on the National Register of Historic Places in 2011.\nDescription and history\nThe Buckminster-Kingsbury Farm is located in a rural setting of northwestern Roxbury, at the northern end of Houghton Ledge Road, a dirt road running north from near the Granite Gorge Ski Area.  The farm occupies about  of land, which is mostly wooded except for a cleared area where the cluster of farm buildings is found.  The c. 1825 farmhouse is the dominant element of the property, with a 19th-century barn standing nearby; other elements of historic interest on the property include foundation remnants of older buildings, and a 19th-century wellhead.  The farmhouse is a brick building,  stories in height, with a gabled roof.  Attached to it are two single-story wood frame ells, which are believed to predate the construction of the main block by several years.\nThe town of Roxbury was incorporated in 1813 out of portions of neighboring communities.  Its early settlement had been in the 18th century, mainly by veterans of the French and Indian War who had received land grants in the area.  William Stoddard Buckminster, the son of one of Roxbury's first selectmen, purchased land in this area from his father Solomon in 1820.  It is believed that one of the ells, a post & beam wooden cape, of the house was the first structure built on the property in the 1790s.  Buckminster's son David operated the farm until the 1860s, when he moved to Keene, and sold it in 1878 to Elbridge Kingsbury.  The Kingsburys were also from a family of early settlers, and operated the farm until 1919.  In the 1920s and 1930s they rented the property for use as a summer camp, and it was sold out of that family in 1946.\nSee also\n*National Register of Historic Places listings in Cheshire County, New Hampshire\nReferences"
    }
  ]
}