{
  "content": [
    {
      "type": "text",
      "text": "# Buckingham Female Collegiate Institute Historic District\n\n| designated_other1_number       = 014-0127\n| designated_other1_num_position = bottom\n| image                          = Buckingham Female Collegiate Institute Historical District - Henry Brown House.jpg\n| caption                        = The Henry James Brown House, seen in April 2017\n| location                       = VA 617, Gravel Hill, Virginia\n| coordinates                    =\n| locmapin                       = Virginia#USA\n| built                          = -1863\n| builder                        = Shepard, Carrol M.; Multiple\n| added                          = October 4, 1984\n| area                           =\n| refnum                         = 84000035\n}}\nThe Buckingham Female Collegiate Institute Historic District is a historic school complex and national historic district located at Gravel Hill, Buckingham County, Virginia. It is now on private property.\nIn 1831, Samuel Shepard and Dr. John Wesley Langhorne organized Trustees of the Female Collegiate Institute to establish the first charted college for women in Virginia.  This collegiate institute, which operated from 1837 to 1863, encompassed five contributing buildings associated with it. They are of brick and frame construction:\n* the President's House (c. 1852-1853), which was demolished by the landowner in 2010, over objections from the local historical society, after it was damaged by falling trees; the owner claimed that repairs to the structure would be too costly.\n* the Henry James Brown House,\n* the John S. West store/dwelling,\n* the Institute Tavern (c. 1850), and\n* the Cobb-West-England House (c. 1850).\nIn 1837, the Buckingham Female Collegiate Institute was incorporated by the Virginia General Assembly. The college opened in 1838 to provide accommodations for 120 students. Students were offered degrees in either Mistress of English Literature or Mistress of Classic Literature. The college struggled financially and finally closed its doors in 1863.\nThe district was listed on the National Register of Historic Places in 1984.\nNotable alumni\n*Antonia Ford (1838-1871)\n*Julia A. Wood (1840-1927), writer\nReferences"
    }
  ]
}