{
  "content": [
    {
      "type": "text",
      "text": "# Buckinghamshire Examiner\n\n| ceased_publication  =\n| owners              = Reach plc\n| publisher           = Trinity Mirror Southern Ltd\n| editor              = Shujaul Azam\n| chief_editor         =\n| associate_editor         =\n| staff_writers               =\n| language            = English\n| political_position           =\n| circulation         =\n| headquarters        = Uxbridge, Middlesex\n| oclc                =\n| ISSN                =\n| website             =\n}}\nThe Buckinghamshire Examiner more usually known as the Bucks Examiner was a weekly newspaper, published on Wednesdays and  distributed in the towns of Amersham, Chesham, and the surrounding villages in the Chiltern area of Buckinghamshire, England. Its last owner and publisher was Trinity Mirror.\nIt was first published in 1889 under the banner Amersham Examiner. The paper moved to Chesham in the 1890s along with the Amersham & Rickmansworth Times. It was known for a period as the Chesham Examiner only becoming the Bucks Examiner in 1906. In the 1960s, following the introduction of lithographic technology, it was the first weekly newspaper in the UK to carry a full colour advert.  Until 2009 it had its main office in the Chesham town; when this closed the editorial office was relocated to Uxbridge.\nThe paper covered local news, features, leisure and sport including the exploits of Chesham United football club and Chesham Cricket Club.\nThe Bucks Examiner was jointly published by Trinity Mirror Group of Newspapers with the tabloid newspaper the Buckinghamshire Advertiser. The newspapers shared editorial teams and regional news reports.\nThe Buckinghamshire Advertiser was founded by William Broadwater in November 1853 as the Buckinghamshire Advertiser, and Middlesex, Herts, Berks, Beds, and Oxon Gazette. By 1861, and after several name changes, it was known as ''Broadwater's Buckinghamshire Advertiser, Uxbridge Journal, Middlesex, Herts, Berks, Beds, and Oxon Gazette''. Since then the paper was  bought and sold by a number of owners and underwent several further name changes before being purchased by Trinity Mirror in 2004. It was distributed in Beaconsfield, Chalfont St Giles, Chalfont St Peter and Gerrards Cross.\nClosure\nParent company Reach plc, (successor to Trinity Mirror), announced the closure of both the Buckinghamshire Examiner and sister paper Buckinghamshire Advertiser, effective February 2019. It cited a continued decline in local print advertising, which had rendered the titles unsustainable.\nReferences"
    }
  ]
}