{
  "content": [
    {
      "type": "text",
      "text": "# Buckinghamia celsissima\n\n|taxon             = Buckinghamia celsissima\n|authority         = F.Muell.\n|range_map         = Buckinghamia-celsissima-distribution-map.jpg\n|range_map_caption =\n}}\nBuckinghamia celsissima, commonly known as the ivory curl tree, ivory curl flower or spotted silky oak, is a species of tree in the family Proteaceae. It is endemic to the tropical rainforests of northeastern Queensland, Australia.\nDescription\nBuckinghamia celsissima is a large tree growing up to  tall in its natural rainforest habitat, but is much smaller when cultivated. The leaves are dark green above and somewhat glaucous or whitish below, held on petioles about  long. While the first few leaves on a new shoot may be deeply lobed, those on older twigs are simple with entire margins (see gallery). These mature leaves are elliptic and grow to lengths of around  and  wide.\nThe showy cream-coloured flowers appear over summer and autumn. The inflorescence is an axillary or terminal pendant raceme up to  in length. Individual flowers are densely clustered on the axis, on pedicels about  long and have tepals around  long.\nFruits of the ivory curl tree are follicles, green in colour while developing but turning brown or black on maturity. At this point they are up to  long by  wide and contain up to 6 small brown seeds, which are released as the fruit dehisces.\nTaxonomy\nThis species was described in 1868 by the German-born Australian botanist Ferdinand von Mueller, based on material collected by John Dallachy near Rockingham Bay in 1865. Mueller published his description in volume 6 of his massive work Fragmenta phytographiae Australiae. B. celsissima is one of only two species in the genus, the other being Buckinghamia ferruginiflora, described in 1988.\nEtymology\nMueller created the genus Buckinghamia in honour of Richard Temple-Grenville, the 3rd Duke of Buckingham. The species epithet celsissima is from the Latin celsus, meaning \"tall\", \"proud\" or \"noble\", combined with the suffix -issimus, \"very\".\nDistribution and habitat\nThe  natural range of Buckinghamia celsissima is northeastern Queensland from near Rossville to the Paluma Range, north of Townsville, at altitudes from  to .\nIt grows in well developed rainforest on deep red volcanic soils, as well as drier rainforest types associated with Kauri pine.\nEcology\nThe ivory curl tree is one of the host species for larvae of the cornelian butterfly. When in flower it will attract a variety of insects to the inflorescences, among them the beetle Dilochrosis brownii, which in turn attracts insectivorous birds. The seeds are eaten by crimson rosellas (Platycercus elegans).\nConservation\nThis species is listed by the Queensland Department of Environment and Science as least concern. , it has not been assessed by the IUCN.\nCultivation\nThe ivory curl tree has become a popular planting in parks, streets and private gardens in regions far beyond the natural range of the tree. Its popularity is due to the ease of cultivation, the mass flowering and its variable foliage shape and colour. It grows well even as far south as Sydney and Melbourne, but only reaches about  tall in these areas.\nGallery\nFile:Buckinghamia celsissima (Ivory Curl Tree) (6853616961).jpg |Young tree in Brisbane\nFile:Buckinghamia celsissima 1.jpg |Foliage and flowers\nFile:Buckinghamia-celsissima-SF22353-02.jpg |Dehiscing fruit\nFile:Buckinghamia celsissima (ANBG).jpg |Flowers\nFile:Buckinghamia-celsissima-SF22353-04.jpg |Young lobed leaves\nFile:Buckinghamia-celsissima-SF22354-01.jpg |Lobed and entire leaves compared\nReferences\n}}\nExternal links\n*\n*\n* [https://avh.ala.org.au/occurrences/search?taxa=Buckinghamia+celsissima#tab_mapView View a map] of historical sightings of this species at the Australasian Virtual Herbarium\n* [https://inaturalist.ala.org.au/observations?taxon_id=411170 View observations] of this species on iNaturalist\n* [https://flickriver.com/search/Buckinghamia+celsissima View images] of this species on Flickriver"
    }
  ]
}