{
  "content": [
    {
      "type": "text",
      "text": "# Buckingham House (fur-trade post)\n\nBuckingham House (HBC) and Fort George (NWC) were two trading posts on the North Saskatchewan River near Elk Point, Alberta, from 1792 to 1800. Buckingham House belonged to the Hudson's Bay Company and Fort George to the North West Company. Both posts were on a wooded north bank of the North Saskatchewan River. A gully and a few hundred yards separated them. They were important as entrepots for posts on the upper Beaver River (Canada). Dogrump Creek flows into the North Saskatchewan River nearby. Since 1993 an interpretive center operated at the location.\nFort George\nFaced with a declining supply of beaver and the increasing unrest of plains tribes at Pine Island Fort, the North West Company moved 120 miles upriver and established Fort George in 1792. It was one of several places also known as Fort des Prairies. Angus Shaw, who came south from Moose Lake, was in charge for most of its history. Two of his clerks were Duncan McGillivray and John McDonald of Garth. Sixty to eighty men and an almost equal number of women and children inhabited Fort George.\nWhen news of the massacre at South Branch House reached Fort George, the inhabitants stayed inside the fort for six weeks and the inhabitants of Buckingham House joined them.  In 1794-96 Fort George produced 325 bales of fur and 325 bags of pemmican.\nIt did not thrive for long. David Thompson spent the winter of 1799 at the post and found it dilapidated. By 1800 the local beaver had declined so much that the post was abandoned in favor of Fort de l'Isle 20 miles upriver. In 1809 Alexander Henry the younger salvaged what he could and took it downriver to Fort Vermilion.\nBuckingham House\nShortly after Angus Shaw made the move to the new location in 1792, William Tomison of the Hudson's Bay Company arrived with 28 men in October 1792. The post, originally called Moose Hills, was set up to directly compete with Fort George of the North West Company. Until 1795, it was the HBC's furthest post upstream on the Saskatchewan River.\nAt various times Peter Fidler, George Sutherland, James Pruden, and Henry Hallet were in charge. Buckingham House always had fewer men and trade goods than its rival, Fort George. Relations between the two posts were usually difficult but correct. During a drought the leadership of Buckingham House tried to deny the inhabitants of Fort George access to the Buckingham House well. Access was restored when John McDonald of Garth told William Tomison that one or the other of them would visit the bottom of the well unless access was restored.  Buckingham House was abandoned in 1800. By that time, Fort Edmonton and other forts had been built upriver from that site.\nSee also\n*Saskatchewan River fur trade\nReferences\nFurther reading\n*\nExternal links\n*"
    }
  ]
}