{
  "content": [
    {
      "type": "text",
      "text": "# Buckinghamshire Railway\n\n| length            =\n| hq_city           =\n| map               =\n| map_state         = collapsed\n}}\nThe Buckinghamshire Railway was a railway company in Buckinghamshire and Oxfordshire, England that constructed railway lines connecting Bletchley, Banbury and Oxford. Part of the route is still in use today as the Oxford to Bicester Line.\nHistory\nOrigins\nThe origins of the Buckinghamshire Railway can be traced back to the gauge and territorial wars which took place in Buckinghamshire in the 1840s. The London and Birmingham Railway (L&B) had opened a standard gauge line from  to  on 16 October 1837, extending to Birmingham in September 1838. In June of that year, the Great Western Railway (GWR) opened the first part of its broad gauge line from  to Bristol and a further branch from  to  had been opened by June 1844. The GWR subsequently looked to expand beyond Oxford by depositing bills for the Oxford, Worcester and Wolverhampton Railway and the Oxford and Rugby Railway which would take it into the heart of the Midlands.\nSeeking to prevent the GWR from annexing Buckinghamshire into its empire, the L&B, supported by the Midland Railway, countered with the London, Worcester and South Staffordshire Railway from Tring to Wolverhampton via Aylesbury. The scheme included loop lines from Bicester to Oxford and Banbury to Rugby. A third company, Mark Huish's Grand Junction Railway, supported the GWR's schemes as a means of forcing the London and Birmingham to merge with it; it proposed a Birmingham and Oxford Junction Railway which would join with the Oxford and Rugby at Fenny Compton. The GWR's schemes subsequently received parliamentary approval, whilst the London and Birmingham was obliged to withdraw its proposal. The Grand Junction Railway's scheme was also passed, giving the GWR its route to Birmingham, and it merged with the L&B in 1846 to form the London and North Western Railway (LNWR). The remains of the loop lines became the Buckingham and Brackley Junction Railway and the Oxford and Bletchley Junction Railway.\nAuthorisation\nThree bills were presented to Parliament in 1846-47 for the formation of railway companies to construct the relics of the thwarted L&B and LNWR ambitions in Buckinghamshire. The first two bills were for the establishment of the Buckingham and Brackley Junction Railway and the Oxford and Bletchley Junction Railway to construct lines from Bletchley to Oxford via Winslow and Bicester, and another from a point near Claydon House to Brackley and Buckingham. The third bill was for the amalgamation of the two companies into the Buckinghamshire Railway and the authorisation of an extension from Buckingham to Banbury. The bills were passed as the  (9 & 10 Vict. c. ccxxxiii) and the  (9 & 10 Vict. c. lxxxii) and, under the direction of the LNWR, the Buckinghamshire Railway was formed by the  (10 & 11 Vict. c. ccxxxvi) on 22 July 1847. The second Duke of Buckingham was chairman until he encountered financial difficulties and was replaced by Sir Harry Verney, with Buckingham's son, the Marquess of Chandos, taking a seat on the board.\nLater history\nRobert Stephenson was employed to construct the line, with Thomas Brassey as the civil engineering contractor. The line opened between Bletchley and Banbury (via Verney Junction) on 30 March 1850, and between Verney Junction and Oxford on 20 May 1851. The line was worked by the LNWR, which originally leased the line, eventually absorbing the Buckinghamshire Railway on 21 July 1879.\nThe Buckinghamshire Railway made modest profits until its valuable freight was re-routed through Oxford and Didcot, leaving it to sink into losses from which it never re-emerged. It continued until the chairman of the LNWR, Richard Moon, was elected to the board on 23 February 1878 and by 15 July in the same year the company's shares had been consolidated with those of the LNWR.\nIn 1879, the LNWR also absorbed the Bedford Railway which had constructed a line between Bletchley and . It had already absorbed the Bedford and Sandy Railway in 1865, which had constructed a line between Bedford and .\nPresent status\nThe line between Oxford and Cambridge was subsequently known as the Varsity Line and that between Banbury and Bletchley was worked as a separate line, the Banbury to Verney Junction Branch Line. The second line closed to all traffic by the end of 1966, while the Bedford to Cambridge section of the first line was closed as from the beginning of 1968. The section from Bedford to Bletchley remains as the Marston Vale Line and that between Oxford and Bicester was closed, but reopened to passenger traffic in 1986.\nReopening plans\nThe  section of the line has been extensively re-engineered and is in operation.  , the section from Bicester through Bletchley has also been re-engineered  and is scheduled to reopen in 2025, with a new station at .\nReferences\nNotes\nSources\n*\n*\n*\n*\n*\n* [http://www.railbrit.co.uk/Buckinghamshire_Railway/frame.htm RAILSCOT on Buckinghamshire Railway]\nExternal links\n* [http://disused-rlys.fotopic.net/c915644.html Photos of the line]"
    }
  ]
}