{
  "content": [
    {
      "type": "text",
      "text": "# Builders Warehouse\n\n| founder =\n| defunct =\n| location = Sandton, Johannesburg, South Africa\n| area_served = Southern AfricaEast Africa\n| key_people = Llewellyn Walters (CEO)\n| industry = Retail\n| products = Construction equipmentBuilding materialsHome improvement suppliesPlants\n| production =\n| services =\n| revenue =\n| operating_income = R1.18 billion (2022)\n| net_income =\n| aum =\n| assets =\n| equity =\n| owner = Massmart  (subsidiary of Walmart)\n| locations = 117\n| num_employees =\n| divisions =\n| subsid =\n| homepage =\n| footnotes =\n}}\n. The signage also includes a mention of Walmart Pickup.]]\nBuilders Warehouse (commonly referred to as Builders in South Africa), is a South African construction equipment and home improvement retail chain.\nFounded in 2003, it is a wholly owned subsidiary of holding company Massmart (who itself is a wholly owned subsidiary of Bentonville, Arkansas-based retailer Walmart), which, through its Massbuild division, operates various kinds of stores, including Builders Warehouse, Builders Express (small-format stores), Builders Trade Depot (focused specifically on construction entrepreneurs), and Builders Superstore.\nOperations\nBuilders Warehouse operates 117 stores in 4 countries across Southern and East Africa; South Africa, Botswana, Mozambique, and Zambia. It also provides an online shopping service.\nSome Builders Warehouse stores offer services such as tool hire, pool water analysis, and car key programming, and have partnered with local coffee chain Vida e Caffè.\nHistory\nMassmart began its acquisitions of the Builders brand when it acquired five Builders Warehouse stores operating in Johannesburg and Pretoria, in 2003.\nIn May 2011, Bentonville, Arkansas-based retailer Walmart acquired 51% of parent company Massmart Group's stock, at a value of R17 million (approximately US$2.54 billion or £1.54 billion), after receiving regulatory approval from the South African Competition Tribunal. By November 2020, Walmart had finalized the purchase of the remaining 49% of shares, making Massmart a wholly owned subsidiary of Walmart.\nIn 2017, the company revealed its first store that is in part powered by renewable energy. Located in Northriding, Johannesburg, the store uses 400 roof-mounted photovoltaic panels to provide 16% of its annual energy consumption. According to Massmart Group's sustainability manager Alex Haw, serves to reduce the company's greenhouse gas emissions.\nIn 2019, Builders Warehouse revealed a new store prototype in Boksburg, Gauteng, offering, among other things, 3D printing; flatpack furniture; and a smart home hub for digital, in-store shopping and retrieving product information. The store was to serve as a benchmark for all future new store builds and renovations.\nReferences"
    }
  ]
}