{
  "content": [
    {
      "type": "text",
      "text": "# Bulan-Koba culture\n\nThe Bulan-Koba culture (2nd century BCE to 5th century CE) is an archaeological culture in the Altai Mountains which replaced the Pazyryk culture. The time period of this culture occurs in the so-called Huno-Sarmatian period in Russian archaeology (2nd century BC to 5th century AD). The bearers of this culture lived during the time of Xiongnu Empire, Xianbei state and Rouran Khaganate. this culture was replaced by Turkic burial traditions in Altai\nArchaeology\nV.V. Radlov was the first to scientifically study the monuments of the Bulan-Koba culture in 1865 with excavations near the village Katanda and near the village Berel. absence of settlements in this culture points to a nomadic lifestyle. The burial tradition of Bulan-Koba culture consists of oval shaped mounds over stone cists and sacrificed horses were buried along with the deceased in most of the adult burials  The Bulan-Koba bearers erected cenotaphs for warriors who died in distant battles. The Bulan-Koba culture was a part of Xiongnu, Xianbei and Rouran political unions and received material influence from all aforementioned cultural cores. The burial practices of the Bulan-Koba culture greatly influenced the following Turkic burial traditions of the first Turkic Khaganate.\nGenetics and Anthropology\nAnalysis of skeletal remains suggests that the Bulan-Koba culture bearers were anthropologically mainly of Europoid stock, similar to preceding Iron age Eastern Scythians and different from Mongoloid groups such as Slab Grave and Xiongnu. At the end of the period of this culture, the Bulan-Koba people engaged in heavy clashes with foreign peoples.\nA genetic study published in Nature in 2015 examined the remains of three Bulan-Koba samples, the three Y-DNA samples extracted belonged to Q1a-M25/YP844 (samples RISE600 and RISE601 from Verkh-Uimon site dated to 350-450 CE) and J2a-PH358 (sample RISE602 from Sary-Bel site dated to 200 BCE to 100 CE) and three mtDNA belonged to K2a5, M8a1 and C4+152. the autosomal composition of the Bulan-Koba samples resemble preceding Iron age Eastern Scythians (50% RUS_Sintashta_MLBA, 40% RUS_Baikal_EBA, 10% BMAC) with few gene flow from Xiongnu and Slab Grave.\nReferences\nSources\n*\n*\n*\n*\n*\n*  }}"
    }
  ]
}