{
  "content": [
    {
      "type": "text",
      "text": "# Bulgarian epigraphic monuments\n\n}}\n[[File:Северный мавзолей XIV в. Болгар. Татария. Июнь 2013 - panoramio.jpg|thumb|Northern mausoleum of the 14th century. at the Bulgar settlement. Here, inside this building, 26 tombstones of the 13th–14th centuries are collected and displayed for viewing. Two more tombstones are on display at the Museum of Bulgarian Civilization.]]\n(1823 or 1828 – 1866), for the first time gave a reading of the Bulgar epigraphic monuments using Chuvash linguistic data (1863)]]\nBulgarian epigraphic monuments (, ) – tombstones with inscriptions (epitaphs) of the 13th–14th centuries on the territory of the former Bulgarian ulus of the Golden Horde. The identified gravestones can be divided into several categories. From a \"civilizational\" point of view, there are such:\n* Muslim  arabographic, of which there are currently about 400 pieces;\n* Armenian ones with their own graphics, in the amount of 5 pieces and a few more obscure fragments; They also contain Arabic letters.\nMuslim tombstones, in turn, can be classified according to language:\n* only with Arabic text;\n* having, in addition to Arabic, a text in some Turkic language\nDepending on the type of Turkic language, the last group of monuments is divided as follows:\n* tombstones in the Turkic language (r-language, this group is the largest);\n* gravestones in Turkic z-language\nThere is also a classification based on the appearance of monuments, in accordance with their artistic features – 1st style and 2nd style.\nTombstones of the 1st style usually have text in z-language, and 2nd style – text in p-language. Therefore, it was initially believed that such a classification covers all the characteristics in a complex. However, there are exceptions to this correspondence.\nHistory of the study\nThe study of Bulgarian epigraphic monuments has a three-century history. The beginning was made by the decree of Peter I in 1722, after he personally visited the Bulgar settlement.link to nowhere, what settlement?\nIn 1831, the orientalist J. Klaproth first published Bulgarian epitaphs. And in 1863, Kh. Faizkhanov read the inscriptions, relying on data from the Chuvash language. This is what it looked like in his article:\n''The expression JIATI JUR in many Bulgarian tombstones attracts special attention. In my photographs this phrase is very clear, so even with it the signs are placed like this: JIATI JUR. This phrase is usually taken to be Arabic, translated into the words: the coming of oppression, and giving it the meaning of a special era, they derive from the numerical value of the letters the year 623. In my opinion, such an explanation can hardly be correct... Shouldn't we, without going into any guesswork, simply read JIATI JUR, i.e. JIТI JUZ? My reading is supported by the Tatar custom of pronouncing and writing the initial \"I\" as \"J\"... As for the letter “R”, used instead of “Z” in the word ҖҮR, this can be explained partly by the clarity (as in the word SKR, i.e. SIKEZ) of the meaning even without a period, and partly by the use of Chuvash numerals in the epitaphs of that time.''\nDespite the fact that he actually revealed the “blatant Chuvashness” of the texts, Kh. Faizkhanov continued to consider the epigraphic monuments \"Tatar\" (this can be seen from the given fragment of his article). But this is not the main thing here.\nThe incident in the course of attempts to translate the expression JIATI JUR was described by A. I. Artemyev (1820–1874) in 1866 in a book published in St. Petersburg;\nhe actually supported Kh. Faizkhanov and showed the fallacy of his predecessors (the aforementioned Y. Klaproth, F. I. Erdman, I. Berezin and others). The mentioned year 623 AH according to the usual chronology is 1226, therefore, with the old interpretation, it would turn out that the tombstone is from the pre-Mongol time. In fact, all the monuments date back to the Golden Horde era. Kh. Faizkhanov's discovery was also supported by N.I. Ilminsky,  although he argued that \"the venerable mullah expressed... the idea not specifically, but in passing,... and therefore hesitantly and incompletely.”\nSubsequently, the work \"Bulgarians and Chuvashs\" (1902). of N.I. Ashmarin played a particularly important role in revealing the essence of epigraphic monuments.\nAs for the quantitative side, Nikolai Ashmarin considered only 93 tombstones. There is an erroneous opinion that the later researcher G.V. Yusupov considered 200 such monuments, but only 40 of them belonged to the 13th–14th centuries. The remaining monuments are of later origin. However, the total number of known r-language monuments by that time was also more than 200, it's just that G.V. Yusupov did not thoroughly study all of them, so it should be understood.\nIn the tables compiled by D. G. Mukhametshin, one can already count 362 pieces. Another source, citing the same D.G. Mukhametshin, gives a different number of the total number of gravestones examined (274) and some other figures – perhaps these are earlier data.\nIn the XX century, Bulgarian epigraphic monuments in linguistic also analyzed N.F. Katanov, N. Poppe, S.E. Malov, O. Pritsak, Róna-Tas and Fodor S., F.S. Khakimzyanov, T. Tekin, M. Erdal and others.\nMost of the identified monuments are now in museums. Including in the funds of the Bulgarian, Bilar, lawsuit-Kazansky museums-reserve, in the National Museum of the Tatarstan, in the Museum of Fine Arts of the Tatarstan, Chistopol, Tetyushsky museums of the Republic of Tatarstan, in Gima (Moscow), in the Ulyanovsk Museum of Local Lore, in the National Museum of Chuvash Republic.\nBut this is not exhausted by this. For example, there is an appropriate monument in the school museum of the village of Kurmanaevo Nurlatsky district of Tatarstan. There are those who continue to remain in their places of identification.\n(1870–1933), turkologist, researcher of Bulgarian epigraphic monuments, author of «Bulgarian and Chuvash» (Kazan, 1902)]]\nMuslim bilingual tombstones\nBulgarian monuments with only Arabic inscription, which are not very many, occupy a special place among the entire Bulgarian epigraphy. It is difficult to judge the ethno -language belonging of people, but you can learn about their social and personal life.\nA completely different thing if the monuments are bilingual, having, in addition to Arabic, and text in Turkic. There are even tombstones of single-speaking-Turkic (there are few of them), as well as one three-and-language-with Arabic, Turkic z- and r-linguistic texts.\nIt is not known what their carriers on the Volga and Kama in the XIII -XIV centuries called their Turkic languages. In any case, the R-language of this period and the region in science is called the Middle Bulgarian, Volga-Bulgarian or simply Bulgarian.\nAt the same time, as if as synonyms, the concepts of \"old chuvash language\" (L. S. Levitskaya) and \"Middle Chuvash language\" (A. V. Dybo) are found, which completely correlates with the periodization of the history of chuvash language proposed by A. Rona-Tash. According to G.V. Yusupov, \"the ancient Bulgarian language\", which, partly, echoes the term \"Hunnic-Bulgarian language\" by O. Pritsak. In a wide context, diachronically covering the entire history of the language, they say \"Bulgar-Chuvash language\".\nAs for the z-language of some monuments, D. G. Mukhametshin calls him \"Volga-Tourk language\", but he is also the \"Tatar language\". Some others resort to the last name. O. Pritsak defines it as a z-language of the common-Turkic type, standard-tulle language or \"Turkic Muslim language of the Oguzo-Kypchak coinage.\" V. G. Rodionov defines this language as the Oguzo-Kypchak language.\nThey can say Kypchak, if there is confidence that this language refers exactly to this Turkic subgroup, or even in the absence of such confidence («for the sake of brevity and convenience», as A. A. Chechenov writes). In the terminology of G.V. Yusupov – «Newbulgar language». N. I. Ashmarin defines this language as a Chagatai.\nIn quantitative terms, the identified monuments by their types (say, language) are not represented equally and unevenly. The largest group is r-speaking. Some researchers, according to various prepositions, tend to avoid such a question. At the same time, as G.V. Yusupov clearly pointed out this fact.  And who is skeptical of this, still implicitly agree with this, indicating what language the text on the monument is written.\nSometimes among the r-monuments two varieties are seen in relation to their language, thus distinguishing, in the full set, only three idioms (ǯ-dialect, j-dialect and t-dialect), but this does not change the overall picture, because the fundamental division into r- and z-languages remains unchanged: ǯ- and t-dialects belong, according to the feature of rhotacism, to the Bulgar r-language, the j-dialect, according to the feature of zetacism, to the standard Turkic z-language.\nFirst of all, of course, rotacism and zetacism.\nExamples: Bulgarian وطر ‘wutur’  ~ Chuvash vătăr ~ Common Turkic otuz; bulg. سكر ‘säkir’  ~ Chuv. sak(k)ăr ~ common Turkic. säkiz. They also differ in lambdaism and sigmatism: Bulg.بيالم ‘biyelem’  ~ Chuv. pillĕkĕm ~ common Turkic. bešim; bulg. جال ǯāl’  ~ Chuv. çul / çol ~ common Turkic. yes. This example, like the previous one, is taken from an encyclopedia. The same encyclopedia article also provides other most characteristic phonetic and morphological differences between the Middle Bulgarian r-language and the common Turkic z-languages.\n(1) v-prosthesis: bulg. ون ‘ وان‘wan, wān’  ~ chuv. вон/вун(нă) ~ common turc. ōn;\n(2) ordinal numerals on -m: bulg.تواتم ‘tüwätim’  ~ chuv. тăватăм ~ common turc. törtinč;\n(3) alternation h~q: bulg.هير ‘hііr’  ~ chuv. хĕр ~ common turc. qїїz; خرخ‘hirih’  ~ чув. хĕрĕх ~ common turc. qïrq;\n(4) preservation of the suffix q (›h): bulg.ايح ‘ayxi’  ~ chuv. уйăх ~ common turc. ау (›ayïq);\n(5) alternation w ~ γ: bulg.اول ‘awli’  ~ chuv. ывăл(ĕ), ул ~ common turc. oγul;\n(6) alternation ǯ (ç) ~у: bulg. جيرم ‘ǯiirem’  ~ chuv. çирĕм ~ common turc. yegirmi;»\nAdd to this that when N. I. Ashmarin investigated, not yet knew such an important morphological feature of the Middle Bulgarian language, as the formation of the plural by means of the suffix -säm (if more specifically, then \"mesh\"), which corresponds to modern Chuvash -sem. This follows from the tomb text from Bulgar town, dated 1308.\nIt is impossible to confuse this with anything else, because this inscription is quite similar to the texts of at least two other epigraphic monuments (from Chistopol 1311 Tagovki igoda Bhol performed in the common Turkic language with the suffixes -lar/-lär. A certain standard was observed, regardless of the type of monument. On another z-monument, dated 1317, from the co. Bulgaria, the goldsmiths of the master Shahidulla, the analogy is half-hearted – about \"respect of scholars\" is said, but \"elevated mosques\" are not mentioned. Increasingly-??? profession buried not such, to erection mosques has little relationship.\nof Tatarstan.]]\nThe meaning of the monuments\nBulgarian epigraphic monuments of the XIII-XIV centuries. It should be considered as documented sources of the Middle Ages. Therefore, these objects, in their \"undeniable authenticity\", nothing can cancel.\nFrom an archaeological point of view, they are artifacts, written sources. First of all, they allow us to judge the language (languages) of people of the era.\nTrue, there is a theory about  the «particular\"», «special», «functional», «ritual», «sacred» and «cult» character of the then Turkic r-language (G.V. Yusupov, F. S. Khakimzyanov, I. L. Sometimes such a thought is carried out without the use of such high -profile terms: “The quantitative predominance of monuments and style written in the ancient Bulgarian language, when this language has already become used as a conversational, is only an indicator of the survivability of the old tradition and affection of Bulgar to its ancient language,” said, for example, the same G.V. Yusupov. But, in any way, in this, clearly stretched, proposed, case, with inevitably the question arises: where does it come from, this \"functional\" language? After all, then, in the XIII-XIV centuries, could not be dead, because the language of this type exists now, in the 21st century. And in almost the same region. We are talking about Chuvash. It is the current, current state of the Middle Bulgarian language. A. A. Chechenov subjected the “functional” theory of sharp and extensive criticism. Long before him, the same thing was done by V. D. Dimitriev.\nIn addition to resolving language issues, monuments give, despite the poverty of texts, rich material about different aspects of the material and spiritual (social) life of people of that era. After all, the names, titles, spiritual titles, professions, the genealogies of the buried, toponyms and other related circumstances are indicated there.\nThe tombstones under consideration are recognized by works of art. This is what D. G. Mukhametshin writes about this:\nBack in the 20s of the XX century. An attempt was made to consider epigraphics as part of the history of art  rich decoration, various ornamental motifs of monuments are valuable sources for the study of the artistic plastic of the arts of the Volga Bulgarians  .\nArt critic S. A. Chervonnaya about tombstones:\n.We are interested in these monuments as a special phenomenon of artistic culture that arose on the basis of the synthesis of arts: architecture, stone carvings and calligraphy.\nThe main part of this phrase, word for word, is repeated by L. Yu. Braslavsky\nThe same S. M. Chervonny considers it necessary to emphasize the presence in the epitaphs of \"the beginnings of fiction, which includes both scientific (historical, geographical, tendoil) and inspirational-poetic, and fantastic principle. She also notes the presence on the monuments, along with solarm, astral and plant ornaments, and zoomorphic elements (\"animal style\"), which indicates the connections of the Bulgarian art of that period with more ancient pre -Islamic traditions.\nBulgarian epigraphic monuments were also considered from the point of view of artistic value by N.F. Kalinin (it was he who introduced the concept of \"first and second style\"), F. Kh. Valeev, D.K. Valeeva.\nThe formation and sunset of the Bulgarian epigraphic tradition\nBefore the Mongol invasion, the Volga Bulgaria did not know stone tombstones with inscriptions. In any case, no such monuments were revealed. Archaeologist E.A. Khalikova, who studied the regional Muslim monuments of the XI-XII centuries, notes that \"there are still no pronounced traces of tombstones on the graves\".\nAs you know, orthodox Islam does not welcome the structures of any tombstone over the grave; however, nevertheless, such a practice and tradition existed, up to the present day. D. G. Mukhametshin claims:\n«Researchers unanimously associate the tradition of establishing monuments in the Middle Volga and Urals with the penetration and spread of the Muslim religion. Numerous facts of materials from Arabia, Caucasus, Central Asia, where there are epigraphic monuments of an earlier period, allow us to speak in favor of this opinion.»\nTrue, the pre-Mongol Volga Bulgaria was already considered a Muslim country. However, for the appearance of this tradition, an impetus was needed from the outside, we needed a seed. The decisive role of Islam is also recognized by those researchers who are inclined to see other factors.\nN.I. Egorov noticed a very important circumstance: the Tahals of buried, drawn at the Bulgarian epitaphs, directly indicate the Central Asian or Caucasian origin of those who are resting under the tombstones; Compare: Hassan al-Samarcandi, Haibetel ibn Muhammad al-Genti, Shah Kurasan ibn Muhammadshekh al-Cherdari, Ismagil of Esh-Schemakhi, Mobarak Shah Kurasani, Sadreddin Esh-Shirvani, Ash-Semahi district, etc.\nD. G. Mukhametshin also agree with this:\n«... Tahals of Central Asian and Caucasian descent say that the buried  there were visitors...»\nOr here, he also:\n«... Tahallus-toponyms, mainly formed from the name of the Central Asian, Caucasian and other eastern cities and regions-Shirvani, Afrikendi, Genti, Samarkandi, Shamakhi, Kurasani, Kerdari (Turkestan). In addition to the last case, they all come from the city of Bulgarians. These pseudonyms-tahals, formed from toponyms, belonged to people of Nebulgar origin, visitors to the ministers of a religious cult, merchants and the like.»\nNext:\n«''...The titles, probably, did not have the distribution among the highest class of the Bulgarian feudal society, are rather associated with people's visitors. Many of them wear surnames-Tahalsi al-Africenta, al-Shirvani and more».\nHere, in addition to the surname-Tahalusov, another-titles join the traditional argument. The fact of the presence of Central Asian and Caucasian migrants is also noticed by S. M. Chervonnaya, it also calls their alleged ethnic origin. So, speaking the words of A. A. Chechenov:\nThe Volga Bulgar did not have the tradition of establishing stone epigraphic monuments; This tradition is brought by Muslim migrants from the outside, mainly from Central Asia (Khorezm).\n«Bulgarian epigraphic monuments, as such, practically cease to appear by the middle of the XIV century. Only single examples of such objects have been known since the second half of the century, and the r-speakers from that time will never appear.''»\nAnd only during the period of the Kazan Khanate does a \"new wave\" arise, now alone z-speaking, monuments. It is possible to discuss how much it is specifically specifying about the presence or absence  of continuity, but it is impossible to deny the existence of a simultaneous temporary gap between the \"waves\", it is evident.\nThe end of the Bulgarian erigraphic tradition was associated with the devastation of the Volga-Kama lands in the late XIV-early XV centuries and their turning into the so-called Wild field.\nFavorite attractions\n* Monument 1281/82 y. Location with v. Russian Urmat, Vysokogorsky district of the Republic of Tatarstan. Arabic and Bulgarian Languages.\n* Monument to the daughter of Ismail, Ilchi Amek 1285/1286 y. Location: Republic of Tatarstan, Bulgarian. Arabic Language.\n* Epigraphic monument to Yunus as-[Su]vari 1287/1288 Location: RT, Bolgar. Languages: Arabic and Bulgar. There is a reverse side.\n* Monument 1291/1292 Location: RT, Kazan (transported from the Bishop's dacha to the State Museum of the Republic of Tatarstan).\nLanguage: Arabic.\n* Monument 1297/1298 Location: RT, Kazan (transported from the Bishop's dacha to the State Museum of the Tatarstan).\nLanguages: Arabic and Bulgar.\n* Epigraphic monument of Ramazan's daughter, Zubeida, 1303/1304. Location: Tatarstan, Bol'shiye Atryasi village, Tetyushevsky district. Languages: Arabic and Bulgarian.\n* Monument from the city of Bolgar, 1308. Languages: Arabic and Bulgarian. As F. S. Khakimzyanov writes, \"some words are invaluable materials with precise dating for the history of the Chuvash language, this is especially true for the plural indicator -säm.\"\n* Monument, 1309/1310. Location: Tatarstan, city of Bolgar. Languages: Arabic and Bulgarian. There is a reverse side. Found in 1973.\n* Monument from the city of Chistopol. Date: 1311 Jizics: Arabic (cranial formula), commonweight (laudatory part) and Bulgarian (dating part). Found, like other Chistopol monuments, in the city cemetery in 1984 by an expedition composed of M. I. Akhmetzyanov, R. M. Amirkhanov and D. V. Mukhametshin\n* The epigraphic monument to the son of Gusman, Ibrahim of As-Surovy 1314. The location: RT, v. B. Tarkhani of the Tetyushsky district. Languages Arabic and commonweight.\n* Nonatributed (i.e. it is not known who is buried) epigraphic monument of 1316. The location is: the Russian Federation, Ulyanovsk Region, v. Arkhangelskoye Cherdaklinsky district. Languages Arabic and Bulgarian.\n* Non -applied epigraphic monument 1348. Place of location: RT, Bulgarian. Languages Arabic and Bulgarian. Discovered behind the airfield in the city of Bulgaria in 1974. Plog.\n* Monument of 1349. The location: RT, v. Old Savrushi of the Aksubaevsky district. Languages Arabic and Bulgarian\n* Non-applied epigraphic monument (lower fragment). The date is not set. Place of location: RT, Bulgar. Languages Arabic and Bulgarian\n* The epigraphic monument to the daughter of Juvalu, Hadji-Khatyn. The date is not set Place of location: RT, Bulgar Languages Arabic and Bulgarian. It was seized from the foundation of the Assumption Church in the fall of 2003.\n* Nonatributed epigraphic monument (fragment). The date is not set. Place of location: RT, Bulgar. Languages Arabic and common. It was seized from the foundation of the Church of the Assumption.\n* Nonatributed epigraphic monument. Place of location: Samara region, p. Smolkino Syzran district. Coordinates: N 53 ° 27.052 ′, E 048 ° 08.055 ′. Preservation: bad, inscriptions are interrupted, the text is completely lost. It is alleged that Orthodox local residents call this stele \"woman.\" In fact, these residents are not just Orthodox, but also Chuvash. The name \"Babaika\" is tracing paper from Chuvash. Original, in the Chuvash language, the name is “Papai Chulĕ” (Babay stone). On the official website of the Administration of the rural settlement of the Staraya Rachaka of the Municipal District, Syzran, Samara region, which includes the village of Smolkino, there is a “everyday” (non -Phessonal, amateur) description of the tombstone in its current state. (see below)\nThere is a stone on the outskirts of Smolkin, which the locals call \"Babay-tyule\" or, simply, \"babayka\". It resembles some ancient idol, or rather a tombstone, on one end of which you can discern a half-erased image of a human face in a pointed headdress with an ornament, in which a wheel with six spokes is clearly visible - a solar or thunder sign; below the face there is a protrusion, as if arms folded on the chest. Zinaida Semyonovna Molkova even managed to dig up a story in these parts about a certain old Tatar man (\"babay\" in Tatar is an old man), who helped robbers and for this was not honored with burial in a common cemetery (an ancient Tatar cemetery has been preserved in the vicinity). However, there is another version: the stone is not a tombstone at all, but... a petrified woman in a pointed Chuvash sarpan, and \"babai\" is the Mordvin pronunciation of the word \"woman\". \"They cursed this grandmother, saying: \"Be a stone\", - and she turned to stone...\".\n:The monument was brought to attention on June 17, 2019 by I. Gumerov and V. Usmanov during scientific field research and was one of the last to be introduced into scientific circulation since then.\nBibliography\nRussian:\n* Булатов А.Б. Булгарские эпиграфические памятники XIII–XIV вв. Правобережье Волги // Эпиграфика Востока, XVI. – М.-Л.: Наука, 1963. – С. 56–71.\n* Булатов А.Б. Эпиграфические памятники Закамья // Ученые записки НИИЯИИЭ. – Чебоксары, 1967. – С. 198–215.\n* Каховский В. Ф., Булгарские памятники на территории Чувашии // История исследования археологических памятников в Чувашском Поволжье и материалы по антропологии чувашей. Чебоксары, 1995.\n* Малов С.Е., Булгарские и татарские эпиграфические памятники // Эпиграфика Востока. – М.-Л., 1947. – Вып. I. – С. 38–45.\n* Малов С.Е. Булгарская и татарская эпиграфика // Эпиграфика Востока. – М.- Л., 1948. – Вып. II. – С. 41–48.)\n* Милли (Прокопьев) А Н., Отчёт о поездке с целью фотографирования древнечувашских надгробных надписей в пределах Чебоксарского и Цивильского уездов (1925 г.) // НА ЧГИГН. Отд. I. Ед. хр. 20. Инв. No. 990. Л. 248–278.\n* Михайлов Е. П. Фотоснимки надгробных камней, сделанные входе экспедиции 1984 г. в Комсомольском, Яльчикском, Батыревском, Шемуршинском районах Чувашской АССР // НА ЧГИГН. Отд. И. Ед. хр. 803. Инв. No. 7021.\n* Мухаметшин Д. Г. Эпиграфические памятники Болгарского городища. Рукопись. / Архив ИА РАН. -Ф. Р-21. – Ед. хр. 2015.\n* Хакимзянов Ф.С. Язык эпитафий волжских булгар. М.: Наука. 1978 206 с.\n* Хакимзянов Ф. С. [https://prabulgarskiezik.files.wordpress.com/2014/06/khakimzyanov-epigraficheskie-pamyatniki.pdf Эпиграфические памятники Волжской Булгарии и их язык] / Отв. ред. Э. Р. Тенишев; АН СССР, Казан. фил., Ин-т яз., лит. и истории им. Г. Ибрагимова. — М. Наука, 1987. — 191 [1] с., ил.\n* Хузангай А. П., [http://enc.cap.ru/?t=publ&hry=162&lnk=1807 БУЛГАРСКИЕ ЭПИГРАФИЧЕСКИЕ ПАМЯТНИКИ]. — Статья в электронной чувашской энциклопедии.\n* Юсупов Г. В. [https://prabulgarskiezik.files.wordpress.com/2014/06/garun-yusupov-vvedenie-v-bulgaro-tatarskuyu-epigrafiku.pdf Введение в булгаро-татарскую эпиграфику]. — М., Л.: Изд-во АН СССР, 1960. — 322 с.\n* И.И. Гайнуллин, Х.М. Абдуллин, А.В. Касимов, А.М. Гайнутдинов, С.Р. Хамидуллин, Л.Н. Багаутдинова. [https://www.geoscan.ru/ru/blog/dokumentirovanie-bulgaro-tatarskikh-epigraficheskikh-pamyatnikov-sovremennymi-metodami Документирование булгаро-татарских эпиграфических памятников современными методами.] // «Восток (Oriens)», 2023. No. 6, с. 29–41.\nin other languages:\n* Әхметҗанов М.И. [https://tashlar.narod.ru/books/Ahmznv/AHMZNV.pdf Болгар теленен язмышы (эпиграфика материаллары буенча)] // [http://www.tataroved.ru/publicat/ta_2.pdf ТА. 1998. № 1(2). С. 99–119.] (Ахметзянов М. И. О судьбе булгарского языка (по материалам эпиграфики). На татарском языке. В интернет-ресурсе имеется  сокращённый перевод статьи на русский язык — [https://tashlar.narod.ru/text/ahmetzanov-bolgtel.htm вот здесь].)\n* Pritsak O. Die bulgarische Fürstenliste und die Sprache der Protobulgaren. Wiesbaden, 1955;\n* Вепzig. J., Dаs Hunnische, Donaubolgarische and Wolgabolgarische // Philogiae Turcicae Fundamenta. Wiesbaden, 1959 Вd. I. S. 685–695.\n* Вепzig. J. Dаs Tschuwaschische // Turcicae Fundamenta. Wiesbaden, 1959 Вd. I. S. 695–751.\n* Róna-Tas A., Fodor S. Epigraphica Bulgarica: A Volgai Bolgar – török feliratok. Szeged, 1973;\n* Ligeti L. A magyar nelv török kapcsolatai a honfoglalás etőtt és az Árpádkorban. Budapest: Akadémiai Kiadó, 1986 602 I.;\n* Tekin T. Volga Bulgar kitabeleri ve Volga Bulgarcasi. Ankara, 1988;\n* Erdal M., Die Sprache der Wolgabulgarische Inschriften. Wiesbaden, 1993.\n* Ceylan E. Çuvaşça çok zamanli ses bilgisi. Ankara, 1997, 256 s.\nReferences\nExternal links\n* [https://www.tatar-inform.ru/news/uvideli-svet-novye-knigi-po-epigraficeskim-i-literaturnym-pamyatnikam-bulgarskogo-perioda-5867900 Увидели свет новые книги по эпиграфическим и литературным памятникам Булгарского периода]\n* [https://lingvoforum.net/index.php?topic=86401.0 Среднебулгарский]  — Лингвофорум.\n* [https://elibrary.ru/item.asp?id=22708467 Измайлов И. Л., Волжская Булгария XIII в.: автономия или ханский улус, 2009]"
    }
  ]
}