{
  "content": [
    {
      "type": "text",
      "text": "# Buljubaša (Serbian Revolution)\n\nwas one of the most notable commanders in the uprising. He rose from buljubaša to vojvoda (general).]]\nBuljubaša (, from , \"head of division\") was a military rank of the Serbian Army during the First Serbian Uprising (1804–13), adopted from Ottoman usage, traditionally used among the hajduks for commanders. It was the equivalent of kapetan (\"captain\"). In the initial years, it was lesser in rank than bimbaša and vojvoda (commander, general). The rank included variations such as veliki buljubaša, and mali buljubaša or buljubašica, subordinated the buljubaša. The rank of kapetan was then introduced, among others, and the rank of buljubaša subsequently was removed from usage by the end of the uprising.\nHistory\nThe rank was traditionally used among the hajduks for commanders, and was thus used in the Serbian Free Corps (which included hajduks) that fought in central Serbia during the Austro-Turkish War (1788–1791). It was then used in the Serbian militia of the Sanjak of Smederevo that aided Vizier Hadji Mustafa Pasha against the renegade Janissaries and Pazvantoglu in the 1790s. This militia allegedly numbered up to 16,000, mostly composed of rayah and also some Free Corps veterans. Of them, every fifty people had their buljubaša, over a hundred there was a harambaša and over a thousand bimbaša, adopted from the Ottoman Turkish military ranks. The knezes of the knežina (Christian self-governing village groups) mustered this militia, led by several buljubaša, all commanded by Stanko Arambašić as bimbaša. Among notable buljubaša from this period were Karađorđe, Janko Gagić, Todor Bojinović, and others. In the \"Slaughter of the Knezes\" (January 1804), several notable buljubaša were murdered by the Dahije, such as Janko Gagić, Gavrilo Buđevac and Mata from Lipovac.\nIn the beginning, the rebel army was a militia with armed civilians, with the troop size depending on liberated territories. The military organization was territorial, divided into units of desetina (\"tenth\"), četa (\"company\") and bataljon (\"battalion\"), formed according to the local administrative divisions of knežina (villages under the responsibility of a knez) or nahija (a larger group of villages) which gave their names to the individual units. Senior ranks were the kaplar (\"corporal\"), fendrek (from \"fähnrich\"), kapetan or buljubaša (\"captain\"), podvojvoda (sub-vojvoda) and vojvoda, in the beginning of the uprising. The ranks were initially given from within the army until the strengthening of central power when commander-in-chief Karađorđe with or without the Governing Council appointed them.\nThe knežina became an administrative unit in Revolutionary Serbia, where a vojvoda was appointed to lead; the knežina was further divided into smaller units known as srez, which were made up of a smaller number of villages and headed by a veliki buljubaša (\"great\" captain), later designated kapetan (captain), that had under him several mali buljubaša (\"lesser\" captain).\nThe vojvoda appointed the buljubaša. The vojvoda Jakov Nenadović sought to make the nahiyas under his command autonomous of Karađorđe's rule and wrote a draft dated 25 April 1806 that acknowledged the Valjevo nahija's subordination to the Governing Council but explicitly named Nenadović the \"supreme rule\" (vrhovna vlast). In this draft, the magistrates (courts) were to have in the first place, a villager knez as judge, and in his absence, a srez buljubaša, and in his absence the knez veliki (obor-knez).\nThe rank of kapetan was introduced into the ranks, and buljubaša was removed from usage by the end of the uprising.\nHolders\n*Hajduk Veljko (1780–1813), hajduk under Stanoje Glavaš, promoted to vojvoda.\n*Petar Dobrnjac (1771–1831), former hajduk, promoted to bimbaša and vojvoda.\n*Todor Bojinović (1750s–1813), active in Drina and Jadar, former buljubaša of Free Corps hajduk volunteers.\n*Zeka Buljubaša (1785–1813), active in Mačva.\n*Petar Jokić (1779–1852), personal guard of Karađorđe.\n*Arsenije Loma (1768-1815), active in Kačer, promoted to vojvoda in 1811.\n*Lazar Mutap (d. 1815), top buljubaša under Milan Obrenović, promoted to vojvoda of Rudnik in 1811.\n*Toša Đorđević, former hajduk, promoted to bimbaša.\n*Đorđe Zagla ( 1804–d. 1847), active in Smederevo.\n*Petar Džoda (1770–1813), former hajduk.\n*Miloje Petrović-Trnavac (1760–1810), buljubaša of his godfather Mladen Milovanović, promoted to bimbaša of bećari.\n*Raka Tešić (1773–1823), active in Kolubara, under Nikola Grbović.\n*Milić Kedić, former hajduk under Ilija Birčanin.\n*Milić Drinčić (1775–1815), promoted to vojvoda, from Teočin in Brusnica/Takovo knežina.\n*Jovan Lazić (1763–1831), also knez, from Svračkovci in Brusnica/Takovo knežina.\n*Simo Milosavljević Paštrmac, from Kamenica in Kačer knežina, also barjaktar.\n*Sima Katić-Prekodrinac (1783–1833), served Stojan Čupić who promoted him to buljubaša in the Drina area, then to bimbaša in 1808, and finally vojvoda by Karađorđe in 1812.\n*Rada Radosavljević ( 1807–17), active in Tamnava.\n*Živan Petrović ( 1791–06), former buljubaša of Free Corps hajduk volunteers.\n*Stanoje Rosić ( 1803–04), active in Resava.\n*Ranče ( 1803–04), active in Resava.\n*Mitar Janković-Manjenica ( 1804–06).\n*Maksim Filipović ( 1806).\n*Milisav ( 1810), from Kamenica in Kačer knežina.\n*Milovan Stanojčić, from Brusnica in Brusnica/Takovo knežina.\n*Đorđe from Podgorac.\n*Ilija in Šabac, from Bosnia.\n*Ilija Marković in Pocerina.\n*Jovan Drvar, under Ilija Čarapić.\n*Peja Janković, former hajduk under Aleksa Nenadović.\n*Arsenijević.\n*Erić, former hajduk under Aleksa Nenadović.\n*Isailo Lazić.\n*Šunda.\n*Vreta, Vule Ilić's father-in-law.\n*Gavra from Kragujevac.\n*Jovan Šibalija, Montenegrin volunteer.\n*Jovan Žujović, from Ješevac in Rudnička Morava knežina.\n*Jovča Konda ( 1806), under Tanasije Čarapić.\n*Nikola, from Dragolj in Kačer knežina, served under Arsenije Loma.\n*Mijat, from Rudnik in Kačer knežina, also knez.\n*Petar Dunjić, from Milićevci in Rudnička Morava knežina.\n*Pavle Erić, from Mrčajevci in Rudnička Morava knežina.\n*Pavle Simović, from Ljubić in Rudnička Morava knežina.\n*Radivoje Jaćimović, from Rošci in Rudnička Morava knežina.\n*Vasilj, buljubaša of seven villages during the Battle of Čačak (1815), from Pakovraće in Čačanska Morava–Podibar knežina.\n*Mijailo, from Karanovac in Čačanska Morava–Podibar knežina.\n*Simo Knežević (d. 1810), fell at Jasika (1810), from Vlasteljice in Dragačevo knežina.\n*Vrano, served priest and vojvoda Milutin Ilić-Gučanin, from Mirosaljci in Dragačevo knežina.\n*Periša Savić ( 1807–d. 1817), active in 1807–15, from Miokovci, knez of Karadak knežina (1816–17).\nAnnotations\n). }}\nReferences\nSources\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*"
    }
  ]
}