{
  "content": [
    {
      "type": "text",
      "text": "# Bulli Creek, Queensland\n\n| pop                 = 0\n| pop_year            =\n| pop_footnotes       =\n| established         =\n| postcode            = 4357\n| area                = 195.2\n| timezone            = AEST\n| utc                 = +10:00\n| dist1               = 24.9\n| dir1                = NE\n| location1           = Kindon\n| dist2               = 43.4\n| dir2                = SW\n| location2           = Millmerran\n| dist3               = 125\n| dir3                = SW\n| location3           = Toowoomba\n| dist4               = 282\n| dir4                = WSW\n| location4           = Brisbane\n| lga                 = Toowoomba Region\n| stategov            = Southern Downs\n| fedgov              = Maranoa\n| near-n              = Western Creek\n| near-ne             = Western Creek\n| near-e              = Wattle Ridge\n| near-se             = Woondul\n| near-s              = Kindon\n| near-sw             = Kindon\n| near-w              = Kindon\n| near-nw             = Boondandilla\n}}\nBulli Creek is a rural locality in the Toowoomba Region, Queensland, Australia. In the , Bulli Creek had \"no people or a very low population\".\nGeography\nThe watercourse Bulli Creek, as which the locality is presumably named, rises in the north of the locality and flows north where it becomes a tributary of Western Creek, then Weir River within the Murray-Darling basin.\nThe Gore Highway passes through the locality from east (Wattle Ridge) to west (Kindon).\nA large part of the north of the locality is within the Western Creek State Forest while a large part of the south of the locality is within the Bulli State Forest. Apart from these protected areas, the land use is a mixture of crop growing and grazing on native vegetation.\nDemographics\nIn the , Bulli Creek had a population of 6 people.\nIn the , Bulli Creek had \"no people or a very low population\".\nEducation\nThere are no schools on Bulli Creek. The nearest government primary school is Kindon State School in neighbouring Kindon to the south-west. The nearest government secondary school is Millmerran State School (to Year 10) in Millmerran to the north-east. There is no nearby secondary school providing education to Year 12; the alternatives are distance education and boarding school.\nReferences"
    }
  ]
}