{
  "content": [
    {
      "type": "text",
      "text": "# Bullet (software)\n\n| released               =\n| discontinued           =\n| latest release version = 3.2.4\n| latest release date    =\n| latest preview version =\n| latest preview date    =\n| status                 =\n| programming language   = C, C++\n| operating system       = Microsoft Windows, macOS, Linux, iOS, Android, PlayStation 3, Xbox 360, Wii, Xbox One, PlayStation 4, Nintendo Switch, Xbox Series X/S, PlayStation 5\n| platform               =\n| size                   =\n| language               =\n| language count         =\n| language footnote      =\n| genre                  = Physics engine\n| license                = zlib License\n| website                =\n| logo_size              = 250px\n| logo_alt               =\n| screenshot_size        =\n| screenshot_alt         =\n}}\nBullet is a physics engine which simulates collision detection as well as soft and rigid body dynamics. It has been used in video games and for visual effects in movies. Erwin Coumans, its main author, won a Scientific and Technical Academy Award for his work on Bullet.  He worked for Sony Computer Entertainment US R&D from 2003 until 2010, for AMD until 2014, for Google until 2022 and he now works for Nvidia.\nThe Bullet physics library is free and open-source software subject to the terms of the zlib License. The source code is hosted on GitHub; before 2014 it was hosted on Google Code.\nFeatures\n* Rigid body and soft body simulation with discrete and continuous collision detection\n* Collision shapes include: sphere, box, cylinder, cone, convex hull using GJK, non-convex and triangle mesh\n* Soft body support: cloth, rope and deformable objects\n* A rich set of rigid body and soft body constraints with constraint limits and motors\n* Plugins for Maya, Softimage, integrated into Houdini, Cinema 4D, LightWave 3D, Blender, Godot, and Poser\n* Import of COLLADA 1.4 physics content\n* Optional optimizations for PlayStation 3 Cell SPU, CUDA and OpenCL\nThe Bullet website also hosts a Physics Forum for general discussion around physics simulation for games and animation.\nAt AMD Developer Summit (APU) in November 2013 Erwin Coumans presented the Bullet 3 OpenCL Rigid Body Simulation.\nReferences\nExternal links\n*\n*\n* [http://pybullet.org Pybullet] Python bindings for Bullet, with support for Reinforcement Learning and Robotics Simulation"
    }
  ]
}