{
  "content": [
    {
      "type": "text",
      "text": "# Buma Export Award\n\nThe Buma Export Award (initially known as the Conamus Export Award) was a prize given to Dutch artists who sold the most records abroad, between 1972 and 2011. In 2013, it was replaced by the Buma ROCKS! Export Award, which focused on rock artists, and the Buma Award Internationaal,  awarded to the best-selling and most played songs involving Dutch recording artists, songwriters, and publishers with international success. The latter award is presented yearly during the Buma Awards ceremony.\nBackground\nThe awards were first presented in 1972. They showed the international prestige and popularity of Dutch singers, producers, musicians or bands. The first winners were pop duo Mouth & MacNeal, conductor Harry van Hoof and songwriter/record producer Hans van Hemert for the success of the hit single \"How Do You Do\". This song spent 19 weeks on the Billboard Hot 100 and won the R.I.A.A. gold disc on 2 August 1972. Selling over a million copies in the U.S. alone, global sales exceeded two million.\nSeven years later, Van Hemert won another Export award thanks to his brainchild: the girl group Luv'\n.\nViolinist André Rieu holds the record for the most export prizes (seven). Brothers duo Bolland & Bolland and symphonic metal band Within Temptation won the award several years in a row. Jaap Eggermont received the prize twice because of his world-famous Stars on 45 project. Saxophonist Candy Dulfer had three awards. Among other prestigious winners were legendary acts Golden Earring, Focus, George Baker Selection, Pussycat, Earth and Fire and Tiësto.\nIn 2012 and 2013, the award was not presented. In 2014, it was renamed Buma ROCKS! Export Award and is only awarded to rock musicians.\nList of winners\nConamus Export Prize\n* 1972: Hans van Hemert, Harry van Hoof, Mouth & MacNeal for the song \"How Do You Do\".\n* 1973: Focus for their entire repertoire.\n* 1974: Golden Earring for their entire repertoire.\n* 1975: The George Baker Selection for the song \"Una Paloma Blanca\".\n* 1976: Pussycat for their entire repertoire.\n* 1977: Champagne for their entire repertoire.\n* 1978: Pierre Kartner for his alias 'Vader Abraham'.\n* 1979: Luv', Hans van Hemert, Piet Souer, Pim ter Linde for their entire repertoire.\n* 1980: Earth and Fire for their entire repertoire.\n* 1981: Jaap Eggermont and Martin Duiser for the Stars on 45 Medley.\n* 1982: Jaap Eggermont, Martin Duiser and Tony Sherman for the Stars on Stevie medley.\n* 1983: Golden Earring; The Shorts and Jack Jersey (for the song Comment ça va).\n* 1984: VOF de Kunst for the song ’Susanna’.\n* 1985: VideoKids; Bolland & Bolland.\n* 1986: Bolland & Bolland for their entire repertoire.\n* 1987: Bolland & Bolland for the song In the Army Now performed by Status Quo.\n* 1988: Bolland & Bolland for the songs Love House and I Wanna Have Some Fun performed by Samantha Fox\n* 1989: Bolland & Bolland\n* 1990: Candy Dulfer for the album Saxuality.\n* 1991: Candy Dulfer for the album Saxuality.\n* 1992: Ten Sharp for the album Under the Water-Line; Ton van den Bremer for his label ToCo International.\n* 1993: Candy Dulfer for the album Sax-a-Go-Go.\n* 1994: Twenty 4 Seven.\n* 1995: Doop.\n* 1996: André Rieu for the albums ‘Strauss & Co’ and ‘Wiener Melange’.\n* 1997: André Rieu and the Johann Strauss Orchestra for the albums “Strauss & Co”, “Stille Nacht”, “Wiener Melange” and “In Concert”.\n* 1998: André Rieu and the Johann Strauss Orchestra (several albums).\n* 1999: Vengaboys\n* 2000: Vengaboys\n* 2001: Jan Smit\n* 2002: Marco Borsato\n* 2003: Within Temptation\n* 2004: Within Temptation\n* 2005: Within Temptation\nBuma Export Award\n* 2006: Within Temptation\n* 2007: Tiësto\n* 2008: André Rieu, Giorgio Tuinfort\n* 2009: André Rieu\n* 2010: André Rieu\n* 2011: André Rieu\nBuma ROCKS! Export Award\n* 2014: Adje Vandenberg for the creation of the band Vandenberg's MoonKings\n* 2015: Epica\n* 2016: Within Temptation\n* 2017: Textures\n* 2018: Floor Jansen\n* 2019: Anneke van Giersbergen\nBuma Award Internationaal\nSince 2013, this other prize has been awarded to the best-selling and most played songs involving Dutch recording artists, songwriters and publishers with international success. The Buma Award Internationaal is presented yearly during the Buma Awards show.\n;2013\n# Animals by Martin Garrix\n# This Is Love by Will.i.am with Eva Simons\n# Play Hard by David Guetta with Ne-Yo & Akon\n# I Could Be the One by Avicii vs. Nicky Romero\n# This Is What It Feels Like by Armin van Buuren met Trevor Guthrie\n;2014\n# Waves by Mr. Probz\n# Red Lights by Tiësto\n# Bad by David Guetta & Showtek with Vassy\n# Wasted by Tiësto with Matthew Koma and Calm after the storm by The Common Linnets\n;2015\n# Hey Mama by David Guetta & Afrojack\n# Firestone by Kygo\n# Reality by Lost Frequencies with Janieck Devy\n# Waiting for Love by Avicii\n# What I Did for Love by David Guetta\n;2016\n# ''This One's for You by David Guetta with Zara Larsson\n# In the Name of Love by Martin Garrix\n# Bang My Head by David Guetta with Sia & Fetty Wap\n# Catch & Release (Deepend-remix) by Matt Simons\n# What Is Love by Lost Frequencies\n;2017\n# 2U by David Guetta & Justin Bieber\n# Scared to Be Lonely by Martin Garrix & Dua Lipa\n# Dirty Sexy Money by David Guetta & Afrojack with Charli XCX & French Montana\n# Light My Body Up by David Guetta with Nicki Minaj & Lil Wayne\n# So Far Away by Martin Garrix & David Guetta with Jamie Scott & Romy Dya\n;2018\n# X (Equis) by Nicky Jam & J Balvin\n# Jackie Chan by Tiësto & Dzeko with Preme & Post Malone\n# Back to You by Selena Gomez\n# Like I Do by David Guetta, Martin Garrix & Brooks\n# Kika by 6ix9ine\n;2019\n# Summer Days by Martin Garrix with Macklemore & Patrick Stump\n# Undecided by Chris Brown\n# Post Malone by Sam Feldt with Rani\n# Arcade by Duncan Laurence\n# Say My Name by David Guetta with Bebe Rexha & J Balvin and Tiësto, Ritual by Jonas Blue & Rita Ora\n;2020\n# Futsal Shuffle 2020 by Lil Uzi Vert\n# The Business by Tiësto\n# Let's Love by David Guetta & Sia\n#  God Is a Dancer by Tiësto & Mabel\n# Coño by Jason Derulo x Puri x Jhorrmountain\n;2021\n# The Business by Tiësto\n# BED by Joel Corry, RAYE & David Guetta\n# Arcade by Duncan Laurence\n# Heartbreak Anthem by Galantis, David Guetta & Little Mix\n# We Are The People by Giorgio Tuinfort & Martijn Garritsen\n# Wasted Love by Ofenbach ft. Lagique\n# The Motto'' by Tiësto & Ava Max\nMost wins\n{| class=\"wikitable\"\n|-\n! Artist|| Number of awards\n|-\n| André Rieu  || align=\"center\" | 7\n|-\n| Bolland & Bolland  || align=\"center\" rowspan=\"2\"| 5\n|-\n| Within Temptation\n|-\n| Candy Dulfer || align=\"center\"| 3\n|-\n| Hans van Hemert || align=\"center\" rowspan=\"4\"| 2\n|-\n| Golden Earring\n|-\n| Jaap Eggermont and Martin Duiser\n|-\n| Vengaboys\n|}\nSee also\n* Golden Harp\n* Zilveren Harp\n* List of music awards\nReferences\nExternal links\n* [http://www.bumacultuur.nl/en Buma Cultuur]\n* [http://www.bumaharpengala.nl/archief Archives of Buma Harpen Gala including the winners of the Export Prize]\n* [http://www.popinstituut.nl/  Encyclopædia of Dutch rock and Pop music] at Pop Instituut.nl"
    }
  ]
}