{
  "content": [
    {
      "type": "text",
      "text": "# Buning Brongers Award\n\nThe Buning Brongers Award is a biennial Dutch art prize for young artists.\nThis award is the biggest private art prize of the Netherlands. The prize consists of the sum of €4500. For the winners, there is an exhibition organized, an award ceremony at Arti et Amicitiae, and a catalog published. Candidates for the prize are nominated by the Dutch art schools.\nThe Buning Brongers Prizes are awarded by the Buning Brongers Foundation from the legacy of Johan Buning, his wife Titia Brongers, and his sister-in-law Jeanette Brongers. The prize was first awarded in 1966 and has been awarded every one or two years since then.\nWinners\n*1966 - Marjan de Glopper\n*1967 - Henri Plaat\n*1968 - Antje IJpelaar\n*1970 - Paul Moedig\n*1971 - William Lindhout\n*1972 - Mariëtte Nijsten, Bart Jonkers\n*1973 - Aart Elshout\n*1974 - Rudi Maynard\n*1975 - Chris de Bueger\n*1977 - Ramon van de Werken, Wendelien Schőnfeld\n*1978 - Jaap Schlee\n*1980 - Jan Commandeur, Toon Verhoef, Emo Verkerk\n*1981 - René van den Broek, Karin Lugtigheid\n*1982 - Jan van der Pol, Peter Klashorst, Peter Zegveld\n*1983 - Gerard Prent\n*1984 - Marlijn Dunker, Willem Sanders\n*1985 - Roeland Zijlstra, Brigitte Engel\n*1986 - Gabriëlle van der Laak, Tiong Ang\n*1987 - Jan Baas, Liesbeth Bik\n*1988 - Peter Keizer\n*1989 - Peter Breevoort\n*1990 - Frans Franciscus\n*1991 - Patries\n*1992 - Ko Aarts, Bouchaib Dihaj\n*1994 - Eelco Brand, Elsa Hartjesveld, Shigeru Hasegawa, Benoît Hermans, Hella van 't Hof, Henk Jonker, Peter Miedema, Rinke Nijburg, Rosetta Spadaro, Marjolein Spitteler, Peter Westenberg.\n*1996 - Rolf Bastiaans, Frans Boomsma, Abraham de Haan, Jeroen Krielaart, Vanessa Jane Phaff, Jannie Regnerus, Wim van den Toorn, Siree van der Velde, Jeroen van der Velden, Daniel Verkerk, Bas Zoontjes.\n*1998 - Rana Berends, Henk de Bouter jr, Monique Camps, Raymond Cuijpers, Natasja Kensmil, Bas Louter, Jacco Olivier, Gertjan Scholte-Albers, Barbara Wijnveld, Ina van Zyl.\n*2000 - Antoine Adamowicz, Robert Geveke, Jasper van der Graaf, Leo Kogan, Harm Goslink Kuiper, Ellemieke Schoenmaker, Derk Thijs, Esther Tielemans, Eefje Versteegen, Barbara Wijnveld.\n*2002 - Michiel ten Bokum, Liam Dunne, Aaron van Erp, Robert Geveke, Jonathan Gold, Amber de Groot, Sara van der Heide, Hidde van Schie, Chantal Spit, Myra de Vries.\n*2004 - Wafae Ahalouch El Keriasti, Yesim Akdeniz Graf, Tjebbe Beekman, Mark Beerens, Marie Civikov, Kristine Hymøller, Chloe Morrison, Julia Münstermann, Marjolein Rothman, Myrthe Steenweg.\n*2006 - Miranda Cleary, Nathan van Heijnsbergen, Rijnder Kamerbeek, Henrik Kröner, Anna Niederbremer, Pauline Niks, Jack Ruebsaet, Lucy Stein, Evi Vingerling, Rozemarijn Westerink.\n*2008 - Niels Broszat, Vincent Dams, Dagmar Donners, Jakup Ferri, Paul Haworth, Hans Hoekstra, Jack Holden, Lilian Kreutzberger.\n*2010 - Viktor Baltus, Mitchel Breed, Thijs Jansen, Omar Koubâa, Mari Stoel, Sarah Verbeek, Jan Wattjes.\n*2012 - Maarten van Aken, Gonul Albayrak, Fritz Bornstück, Andrea Freckmann, Dimitar Genchev, Josje Peters, Thomas Raat, Sanne Rous.\n*2014 - Cian-Yu Bai, Frederique Jonker, Janine van Oene, Sam Samiee, Jisan Ahn, Jeannoux van Deijck, Saskia Blokzijl.\n*2016 - Anika Mariam Ahmed, Jurre Blom, Alex Crocker, Nancy de Graaf, Noah Ryu, Steffen Vogelezang.\nSee also\n* List of European art awards\nReferences\nExternal links\n*[http://www.buningbrongers.nl Buning Brongers Stichting]\n*[https://web.archive.org/web/20140220044650/http://www.arti.nl/tentoonstelling.php?id=310 Arti et Amicitiae] exhibition"
    }
  ]
}