{
  "content": [
    {
      "type": "text",
      "text": "# Burger King (mascot)\n\n| portrayer = Dick Gjonola (1976-1980s), Nick Kelsay (present)\n| voice = Allen Swift (1968–1976)\n}}\nThe Burger King is a king character used as the primary mascot for the fast-food restaurant chain of the same name. The first iteration of the Burger King was part of a sign at the first Burger King restaurant in Miami, Florida, in 1955. Later signs showed the King sitting on a \"burger throne\" as well as atop the BK sign while holding a beverage. In the early 1970s, Burger King started using a small and animated version of the King in its children's advertising, voiced by Allen Swift. In 1976, the original animated King was replaced by the \"Marvelous Magical Burger King\" which was a red-bearded and Tudor-era king who ruled the Burger King Kingdom and performed magic tricks that were mostly sleight-of-hand but sometimes relied on camera tricks or involved his \"Magic Ring\" which could summon copious amounts of food. The Burger King Kingdom advertisements were discontinued in the late 1980s in favor of the BK Kids Club Gang and other advertising programs.\nWhen Miami-based advertising agency Crispin Porter + Bogusky took over advertising of Burger King in 2003, they created a caricatured rendition of the Burger King character from the Burger King Kingdom advertising campaign now simply called \"the King\". During the use of CP+B's new version of the King, ads generated significant word of mouth for its new use of what various trade publications and Internet articles labeled \"the Creepy King\" persona, an appellation that BK came to favor and CP+B used in its ads. However, this iteration of the King failed to provide a consistent message regarding the company and its products, prompting the company to terminate its relationship with CP+B upon the takeover of Burger King by 3G Capital in 2010 and announced the following year that the character would be retired.\nFive years later, the company brought back the King in May 2015 with a paid appearance as a member of Floyd Mayweather Jr.'s entourage before the Mayweather vs. Pacquiao fight. The next was an appearance in the grandstands at the 2015 Belmont Stakes, with the character standing behind Bob Baffert, the horse trainer of American Pharoah. The King returned in 2017 and onward in commercials promoting the new \"Mac and Cheetos\" and flame-grilled Whoppers.\nHistory\n1960s–1980s\nDuring the late 1960s to early 1970s, the Burger King was introduced as a small and animated king character in its children's advertising voiced by Allen Swift. The animated King was featured in a series of advertisements in which he would visit a Burger King outlet for an interview with a television reporter or see a former court wizard who now worked for the chain. In all ads the King would present children with small gifts or buy them some Burger King food. Many of these commercials featured the King reciting the restaurant's slogan, \"Burger King, where kids are king!\" In 1973, the Burger King met Cap'n Crunch, which launched various promotional collaborations between the two's respective brands.\nIn 1976, the animated king was replaced by the \"Marvelous Magical Burger King\" which was a red-bearded and Tudor-era king played by Dick Gjonola, who ruled the Burger King Kingdom and performed magic tricks that were mostly sleight-of-hand but sometimes relied on camera tricks or involved his \"Magic Ring\". The King was accompanied by usually two or more children and notable characters such as \"Sir Shake-a-Lot\" (a knight that has a craving for milkshakes), the \"Burger Thing\" (a W.C. Fields-esque hamburger portrait), \"The Duke of Doubt\" who often doubted the King's abilities and the robotic \"Wizard of Fries\". This campaign paralleled McDonald's McDonaldland children's commercials, which featured \"Ronald McDonald\", \"The Hamburglar\" and \"Mayor McCheese\" among other characters and mascots. The Burger King Kingdom advertising campaign was discontinued by the late 1980s in favor of the BK Kids Club Gang ads.\nBurger King (1955-1968).png|The original Burger King as used in print campaigns from the 1950s to the late 1960s\nKurger Bing.jpg|The animated version of the Burger King used during the late 1960s and early 1970s\nMagical Burger King.jpg|The Marvelous Magical Burger King used in the Burger King Kingdom commercials from 1976 to 1989\n2004–2011\nAfter Miami-based advertising firm Crispin Porter + Bogusky (CP+B) took over advertising of Burger King on January 27, 2003, they began using a new caricatured iteration of the Burger King character who was simply called \"the King\". During production, an employee at CP+B found a 1970s'-era oversized Burger King head for sale on eBay which was originally used as inspiration for brainstorming; it was eventually decided to restore the head and use it in a campaign. The King appeared in commercials for Burger King starting in 2004. In this incarnation, the King is an unnamed actor who wears an oversized grinning mask that resembles the 1970s version of the King and who often appears in various unexpected places such as in bed with people or behind doors and walls, only to offer them Burger King food. Employing the advertising technique called viral marketing, CP+B's ads generated significant word of mouth for its new use of what various trade publications and Internet articles labeled \"the Creepy King\" persona, an appellation that BK has come to favor and CP+B uses in its ads.\nDue to sluggish sales and customer aversion, Burger King retired the 2000s version of the Burger King character in 2011 following a \"food-centric\" marketing approach. Burger King chief financial officer Josh Kobza explained that the reason behind the removal of the \"creepy\" character was because he \"scare[d] away women and children\" from the chain.\nDesign history\ntheoldking.jpg|An updated rendition of the Burger King character used in the advertising for Burger King Kids Club during the mid-2000s\nThe Burger King (2000s).jpg|The \"creepy\" iteration of the Burger King used from 2004 to 2011 and 2015 to 2025\n2015–2025\nThe character returned when Burger King paid $1 million to have him included in Floyd Mayweather Jr.'s entourage for his May 2015 fight with Manny Pacquiao. The King then appeared in a Burger King commercial for the return of  chicken nuggets in June 2015.\nHorse trainer Bob Baffert was paid $200,000 to allow the King to stand behind him in the grandstands during the televised broadcast of the 2015 Belmont Stakes, where American Pharoah won the Triple Crown. Baffert had turned down $150,000 to allow the mascot to appear with him at the 2015 Preakness Stakes. The King was also on hand with Baffert when at the 2018 Belmont Stakes, he became the second trainer to win two Triple Crowns with Justify.\nAdvertising campaigns\nVideo games\nThe first appearance of the Burger King in a video game is in the boxing game Fight Night Round 3 from EA Sports, starting with the Xbox 360 release in February 2006.  The King is available as the in-ring round guy, and later he is selectable as the player's boxing manager.\nIn October 2006, Burger King announced that it would be releasing three video games for the Xbox and Xbox 360 consoles, starring the King and other mascots such as the Subservient Chicken. In Pocketbike Racer, the mascots face off in a minibike race. Big Bumpin' pits them against each other in a game of bumper cars and finally in Sneak King,  players control the King in a third-person perspective stealth game where the King must sneak up behind hungry people and offer them Burger King products. Players are graded on how elaborately they deliver the food. The games were available at Burger King restaurants from November 19 to December 24, 2006. They were priced at  each ($4.99 Canadian) with purchase of a value meal, and have each been rated \"E for Everyone\" by the ESRB.  All three received low ratings from various game critics.\nIn 2008, a series of games were developed by Seattle, Washington, based mobile content provider Mobliss. The games, designed to run on mobile phones, were promoted in U.S. locations on menus and packaging. According to Mobliss, the goal of the first game is to become the King's protégé by facing challenges and progressing in the virtual world of a Burger King-themed city. The games could be purchased and downloaded using an SMS shortcode, and were available on all major US carriers that Mobliss had direct publishing agreements with: Sprint Nextel, AT&T Mobility, Verizon Wireless, Alltel, and T-Mobile.\nSee also\n* Fast food advertising\n* The Subservient Chicken\n* Ronald McDonald – McDonald's counterpart to Burger King\n* Colonel Sanders\nReferences\nExternal links\n* [http://www.retrojunk.com/details_commercial/83/ RetroJunk.com] A 1985 Burger King Kingdom commercial featuring the Burger King and the Duke of Doubt on Retro Junk.\n* [https://archive.today/20130105220951/http://www.tvacres.com/admascots_burger_king.htm TV Acres.com] The evolution of The Burger King"
    }
  ]
}