{
  "content": [
    {
      "type": "text",
      "text": "# Burger King games\n\n}}\nThe Burger King games, sometimes known collectively as King Games, are a series of three advertisement-based video games (advergames) sold at Burger King. The games were sold as part of a promotion during the holiday season from late November until December 24, 2006.\nAll three games were developed by the Blitz Arcade Division of Blitz Games, and were published by King Games. They advertise Burger King in-game. The games were compatible with both the original Xbox and the Xbox 360, and feature online play through Xbox Live. The games were originally created as downloadable games for Xbox Live Arcade but were considered to be of such high quality they were instead moved to 'box product' and distributed directly at Burger King stores for $3.99 apiece.\nGames\nPocketBike Racer\n''\"Pocketbikes are called pocketbikes for a reason. They're small. Tiny. Minuscule. But small doesn't scare us. And we're putting you on one.\"\nSneak King\n\"It takes a special person to sneak up on someone with a hot, delicious sandwich. It takes an even more special person to get away with it and only the King can pull it off with vigor, finesse, and a royal flourish. Because the King's sneaking talents are unmatched. Period.\"\nBig Bumpin\n\"So, you've been on a bumper car once. And it was fun. But not as much fun as it could have been if there were no rules. Here's your chance to bump like you mean it. Again and again. With 4 modes of play and make your own character mode and 10 courses this is hard to put down. But Watch out for the hazards, such as bottomless pits, ice patches, and saws that come out of the wall.\"\nReferences\n*[http://xbox360.ign.com/objects/858/858062.html Pocketbike Racer on IGN], IGN.com, retrieved November 4, 2006\n*[http://xbox360.ign.com/articles/736/736771p1.html Burger King and Xbox Team Up], IGN.com, retrieved November 4, 2006\n*[http://www.siliconera.com/index.php/2006/10/02/first-look-at-the-trio-of-burger-king-games/ First look at the trio of Burger King games], SiliconEra, retrieved November 4, 2006\n*[http://xbox360.gamespy.com/xbox-360/pocketbike-racer/ GameSpy profile for Pocketbike Racer], GameSpy'', retrieved November 4, 2006"
    }
  ]
}