{
  "content": [
    {
      "type": "text",
      "text": "# Burmese Declaration of Independence\n\n| date_repeal          =\n| location_of_document = Rangoon, Burma (now Yangon, Myanmar)\n| commissioned         =\n| writer               = Thein Han, Min Thu Wun, Ohn Pe and Win Sein\n| signers              =\n| media_type           =\n| subject              =\n| purpose              =\n}}\nThe Burmese Declaration of Independence () was officially promulgated on 4 January 1948, as a result of the Burma Independence Act 1947, which brought to an end British rule in Burma (now known as Myanmar) that lasted for six decades. The date is now celebrated as Independence Day, a national gazetted holiday. The declaration was jointly penned by Zawgyi, Min Thu Wun, Ohn Pe and Win Sein, and translated into English by Maung Maung, U Thant, Khin Maung, and Khin Zaw.\nHistory\nA Japanese invasion of Burma during the Second World War was launched from Malaya in December 1941. This led to the defeat of British and Indian forces and to Japanese rule, but during 1942 the new rulers made promises to grant Burma independence after the war, believing that this would give the Burmese a stake in an Axis victory, create resistance to future re-colonization by the western powers, and lead to greater military and economic support from Burma for the Japanese war effort. On 8 May 1943, a Burma Independence Preparatory Committee was formed under the chairmanship of Ba Maw, and on 1 August 1943 a nominally independent State of Burma was proclaimed, with Ba Maw as \"Naingandaw Adipadi\" (head of state) as well as prime minister.\nAs a result of the Burma campaign of 1944 to 1945, fought against the Japanese and the new State of Burma by the British Empire, the Republic of China, and the United States, Burma returned to British control, but it resisted this. The new Labour government of Clement Attlee resolved to grant Burma independence, and this resulted in the Burma Independence Act 1947, which conferred independence on Burma. The Act received the royal assent on 10 December 1947, and the Union of Burma came into being on 4 January 1948 as a new independent republic, outside the British Empire.\nTo this day, Burma remains an independent republic outside the Commonwealth of Nations.\nSee also\n* Independence Day (Myanmar)\n* History of Myanmar\nReferences"
    }
  ]
}