{
  "content": [
    {
      "type": "text",
      "text": "# Burma (wargame)\n\n]]\nBurma is a board wargame published by Game Designer's Workshop (GDW) in 1976 that simulates the battle between Japan and an alliance of nations for control of Burma during World War II.\nBackground\nIn December 1941, Japan invaded British-controlled Burma, opposed by a hastily arranged alliance of British, Indian and Chinese forces. By the end of 1942, Japan had taken control of Burma and threatened to invade India.\nDescription\nBurma is a two-player wargame where one player controls the Japanese invaders who are trying to open a path to an invasion of India, and the other controls the Allied defenders trying to retake control of central Burma.\nComponents\nThe game includes a hex grid map of Burma in 1942 from Ledo, Assam to Rangoon. There are 240 die-cut counters representing Japanese units as well as Allied infantry, artillery, tanks, engineers, chindits, transport aircraft, and four American counters. The rule is only eight pages long.\nGameplay\nThe game uses an alternating turn sequence. First the Japanese player has the following phases:\n#Supply Determination Phase\n#Reinforcement Phase\n#Land & Naval Movement Phase\n#Combat Phase\nThen the Allied player has these phases:\n#Supply Determination Phase\n#Reinforcement Phase\n#Land & Naval Movement Phase\n#Airpower Phase\n#Combat Phase\nThis completes one turn, which represents one month of game time. There are also rules for Long Range Penetration Forces using gliders, engineers building the Burma Road, and Chinese reinforcements. There is only one scenario, which lasts 26 turns, covering the period following the establishment of Japanese rule in Burma in 1942 until the end of the war in 1945. There are no optional rules.\nThe end of the game is dependent on how long the Japanese forces are in India, how soon the Allies occupy Rangoon, and how soon the Burma Road is built.\nPublication history\nBurma was designed by Marc Miller and was published by GDW in 1975 as a ziplock bag game. The rulebook served as the game cover, and featured artwork by Rodger B. MacGowan. Critic Brian Train, writing in 1999, noted \"The game attracted polite attention when it came out and has always been sought after by collectors and people interested in the subject.\"\nReception\nIn Issue 11 of Perfidious Albion, Geoff Barnard and Charles Vasey exchanged thoughts about the game. Barnard commented, \"This proved to be a very interesting and well produced game, and covers the campaign with considerable realism. \" Vasey replied, \"This is a needle game. One is always in a sweat over sudden enemy offensives, supply always seems to be miles away in the rear, and then a few costly offensives see your front collapsing ... The supply system is the only part of the game that could be described as complex.\" Barnard concluded, \"The game does prove to be a bit of a sudden death in that if some factor, for example supply, goes wrong for you as a result of enemy action or your own inaction, your forces can be cut up very badly.\" Vasey concluded, \"There are one or two holes in the rules but basically it is a well-designed game with the accent on good planning and a lot of hard fighting.\"\nIn his 1977 book The Comprehensive Guide to Board Wargaming, Nick Palmer commented on the \"Suitably jungley-looking map with lots of difficult terrain, which helps the thin Allied defences to stop a Japanese breakthrough.\" Palmer noted the lack of complete elimination via combat and instead called Burma \"a game of manoeuvre.\"\nIn the November 1977 issue of Fire & Movement, Raymond Lowe was displeased by the way the rules were written, calling them \"shoddy\" and \"too sketchy and full of loopholes.\" He concluded \"there are those wargamers who like to play a game when they buy it without having to finish developing it first.\"\nIn Issue 24 of the UK wargaming magazine Phoenix, J.B. Poole was initially pleased that the rulebook was only 8 pages, but then realized \"one simply cannot cover such a complex matter so briefly [...] Regrettably [the rulebook] seems to need a great deal more developing.\" Poole concluded, \"Can this game be recommended? I would say yes, with reservations. The overall conception is too good for the game to be rejected, but perhaps one should add the admonitory words: caveat emptor.\"\nIn The Guide to Simulations/Games for Education and Training, Martin Campion noted that \"This game has both sketchy rules and overly intricate rules, but it is a valuable simulation of a very unusual campaign.\"\nIn a retrospective review in Issue 5 of Simulacrum, Brian Train noted that \"The game requires a fair amount of time to play, between five and ten hours, and play tends to proceed in fits and starts. This is quite realistic: there are five monsoon turns, some of them two months in length, that prevent movement or combat.\" Train also commented \"The extremely rugged nature of the terrain and the tenuous supply situation result in a game of maneuver and logistics.\"\nOther reviews and commentary\n*Strategy & Tactics #52\n*Fire & Movement #12 & 71\n*The Wargamer Vol.1 #1\n*Outposts #8\n*Strategist #185\n*Panzer & Campaign #76\nReferences"
    }
  ]
}