{
  "content": [
    {
      "type": "text",
      "text": "# Burpengary East, Queensland\n\n| local_map           = yes\n| zoom                = 11\n| pop                 = 9654\n| pop_year            =\n| pop_footnotes       =\n| established         = 2010\n| postcode            = 4505\n| area                = 29.9\n| timezone            = AEST\n| utc                 = +10:00\n| dist1               = 10.8\n| dir1                = SE\n| location1           = Caboolture\n| dist2               = 20.5\n| dir2                = NW\n| location2           = Redcliffe\n| dist3               = 21.9\n| dir3                = N\n| location3           = Strathpine\n| dist4               = 41.8\n| dir4                = N\n| location4           = Brisbane CBD\n| lga                 = City of Moreton Bay\n| stategov            = Bancroft\n| fedgov              = Longman\n| fedgov2             = Petrie\n| near-n              = Beachmere\n| near-ne             = Beachmere\n| near-e              = Deception Bay\n| near-se             = Deception Bay\n| near-s              = Deception Bay\n| near-sw             = Burpengary\n| near-w              = Burpengary\n| near-nw             = Morayfield\n}}\nBurpengary East is a coastal suburb in the City of Moreton Bay, Queensland, Australia. In the , Burpengary East had a population of 9,654 people.\nGeography\nThe suburb is bounded by the Bruce Highway on the west. It is bounded by the Caboolture River on the north-east, where the river enters Deception Bay (the bay) which then forms a short eastern boundary to the suburb.  The southern boundary is approximates the course of Little Burpengary Creek. Burpengary Creek flows through the suburb from west to east where it empties into Deception Bay.The suburb is predominantly used for residential housing, although some areas remain rural or undeveloped.\nDeception Bay Conservation Park is in the south-east of the suburb extending south to Deception Bay (the suburb).\nThe suburb is mostly used for residential housing with a mixture of smaller suburban blocks and larger rural residential blocks. However, land along the creeks and rivers is mostly used for grazing on native vegetation or undeveloped due to being marshland.\nHistory\nBurpengary East was part of the suburb of Burpengary until it was separately gazetted in 2010.\nDemographics\n{| class=\"wikitable\"\n|-\n! width=50 | Year !! Population !! Notes\n|-\n|  || align=right| 5,762 ||\n|-\n|  || align=right| 6,433 ||\nIn the , Burpengary East had a population of 6,433 people. The median age was 45 years, 7 years above the national median of 38. 78.5% of the people living in Burpengary East reported being born in Australia. The other top responses for country of birth were England 5.9%, New Zealand 3.9%, Scotland 0.6%, Philippines 0.6%, Germany 0.6%.\n|-\n|  || align=right |  9,654 ||\n|}\nEducation\nThere are no schools in Burpengary East. The nearest government primary schools are Morayfield East State School in neighbouring Morayfield to the north-west, Bupengary State School in neighbouring Burpengary to the west, and Deception Bay North State School in neighbouring Deception Bay to the south. The nearest government secondary schools are Burpengary State Secondary College in Burpengary to the south-west and Morayfield State High School in Morayfield to the north-west.\nFacilities\nBurpengary East Sewage Treatment Plant is in the south-east of the suburb at 601 Uhlmann Road (). It is operated by Unity Water and discharges the treated wastewaster via a pipeline into the Caboolture River.\nAmenities\nKrause Park is at 289-323 Old Bay Road ().\nThere is a Church of Jesus Christ of Latter Day Saints at 33-37 Buckley Road ().\nThe Burpengary Group of the Queensland Country Women's Association meets at Burpengary & District Men's Shed on the corner of Maitland & Old Bay Roads.\nThere is a boat ramp and floating walkway on Uhlmann road on the south bank of Caboolture River (). It is managed by the Moreton Bay City Council.\nReferences"
    }
  ]
}