{
  "content": [
    {
      "type": "text",
      "text": "# Bushido: The Way of the Warrior\n\nBushido: The Way of the Warrior is a joint comic book venture of Top Cow Productions and Heroes and Villains Entertainment.\nHistory\nFirst released in October 2013, Bushido: The Way of the Warrior is a five issue comic book mini series written by Rob Levin, with art by Jessada Sutthi.\nPlot\nBushido: The Way of the Warrior tells the story of a young boy who is the sole survivor of a shipwreck following his parents' murder by a horde of bloodthirsty vampires. Isamu, a decorated samurai and head of the Shogun’s Guard, takes the boy in, renames him Kichiro and raises him alongside his own son in Bushido, the way of the warrior.\nYears later, when Kichiro is mistakenly sentenced to death for a murder he did not commit, he is forced to escape the island. But when the vampires return to invade Japan, hell-bent on conquering the country, Kichiro is the only one who holds the secret to defeating them. As the samurai prepare for war, Kichiro must rise above all to rescue the woman he loves and save his adopted homeland from certain annihilation.\nBushido: The Way of the Warrior #1\nIn 1663, a young Kichiro watches as his parents are murdered by vampires. He is rescued by Isamu, head of the Shogun's Guard and trained with Isamu's actual son Orochi in Bushido, the way of the warrior. As the boys become men, Orochi is declared a samurai and the Shogun of Nippon offers his daughter Mitsuko in marriage. Kichiro, who has fallen in love with Mitsuko, tells her goodbye and leaves after Orochi confronts him about touching his future wife. Kichiro goes to a bar only for vampires to attack. He kills them all, but not before one of them mentions fellow vampire Raven and her intent to kill the Shogun. Kichiro rides back home to find Isamu dead by Raven's hand. Orochi discovers him and blames Kichiro for their father's murder.\nBushido: The Way of the Warrior #2\nOrochi locks up Kichiro and ignores his warnings of Raven's assassination plot for the Shogun. Mitsuko visits him in prison and helps him escape. The Shogun finds out, sets the wedding for the next day, and sends Orochi and his men after Kichiro. The search party stops in the forest where vampires attack them. Kichiro appears and helps them kill the vampires. Orochi brings Kichiro back in chains and the wedding festivities begin with Raven and her fellow vampires waiting outside.\nBushido: The Way of the Warrior #3\nRaven and the other vampires attack the wedding. Orochi frees Kichiro and joins them in fighting. The sun starts to rise and the surviving vampires flee, but not before Raven bites Orochi and infects him. Kichiro is locked up again while Orochi fights becoming a vampire. Raven sneaks into his room at night and tells him that in exchange for bringing them Mitsuko, he can live amongst them rather than face exile or execution by his fellow samurai. The Shogun sends for Kichiro to hear him out, but Orochi fights his way through several samurai and demands for Mitsuko to join him.\nBushido: The Way of the Warrior #4\nKichiro is brought to the Shogun only to find all the guards killed and Mitsuko missing. Orochi delivers Mitsuko to the vampires and they send a messenger back to Nippon with word of her capture. The Shogun makes Kichiro a samurai before sending him and his men after Mitsuko. Kichiro finds the vampire base and reasons with Orochi, who reveals that the vampire army has already left for Nippon.\nBushido: The Way of the Warrior #5\nOrochi joins Kichiro and they ride back to Nippon. The vampire army confronts the Shogun and he offers his own life in exchange for Mitsuko's. Before he sacrifices himself, Kichiro arrives and the samurai battle with the vampires. Orochi kills Raven before he and Kichiro team up to decapitate the vampire leader. The rest of the vampires flee and Kichiro reunites with Mitsuko. Orochi realizes he can no longer be samurai and leaves Nippon to become something else.\nSee also\n*Top Cow Productions\n*Heroes and Villains Entertainment\nExternal links\n*https://web.archive.org/web/20131020232529/http://www.heroesandvillains-ent.com/index.html\n*http://www.comicbookresources.com/?page=article&id=46571\n*https://theroblevin.wordpress.com/2013/07/12/bushido-get-your-digital-on/\n*http://www.fanboycomics.net/index.php/blogs/kristine-chester/item/2542-bushido-the-way-of-the-warrior-1-advance-comic-book-review\n*http://www.unleashthefanboy.com/comics/bushido-1-review/73898\n*http://www.comicbookresources.com/?page=article&id=48245\n*https://web.archive.org/web/20160305001326/http://www.comicwow.com/blogs/1/2057/bushido-the-way-of-the-warrior"
    }
  ]
}