{
  "content": [
    {
      "type": "text",
      "text": "# Butler County Banner-Republican\n\nNovember 1982\n| ceased_publication =\n| owners             = Jobe Publishing, Inc.\n| publisher          = Jeffery S. Jobe\n| editor             = Lynzie Embry Jones\n| circulation        = 5,037\n| circulation_ref    =\n| headquarters       = Morgantown, Kentucky\n| ISSN               =\n| website            =\n}}\nThe Butler County Banner, also known as the Butler County Banner-Green River Republican, is a weekly newspaper based in Morgantown, Kentucky, and serving Butler County in west-central Kentucky, including Morgantown, Aberdeen, Jetson, Dunbar, Huntsville, Sugar Grove, Brooklyn, Quality, Roundhill, Rochester, and Woodbury. It is a once-a-week newspaper that publishes on Wednesdays, and it is owned by Jobe Publishing, Inc. based in Horse Cave, Kentucky.\nThis newspaper is part of Jobe Publishing's news and advertising network that also serves Allen, Barren, Cumberland, Edmonson, Hart, Metcalfe, Russell, and Monroe Counties in Kentucky in addition to Butler County, meaning that Jobe also publishes the Barren County Progress, Cumberland County News, Edmonson News, The Herald-News of Metcalfe County, Monroe County Citizen, The Times Journal, The Citizen-Times and the Hart County News-Herald. All of Jobe's newspapers, including the Banner, are members of the Kentucky Press Association.\nHistory\nThe history of the Banner dates back to 1885, when the first-ever edition of its predecessor, the Green River Republican. It was the sole newspaper covering the Butler County area for about 97 years until November 1982, when Roger and Deborah Givens established the Butler County Banner as a weekly newspaper, making Butler County one of the 36 counties in Kentucky served locally by two newspapers at that time.\nThe rivalry between the Republican and the Banner heralded stiff competition between the two newspapers. In 1985, the staff of both newspapers debated over which paper should have the rights to legal classifieds  The Banner won the rights to legal advertisements at Butler County Fiscal Court in November 1991.\nThe rivalry between the two newspapers lasted for more than nine years until 1992, when the Givenses purchased the Republican from Hartford-based Andy Anderson Corporation. Following that purchase, the Green River Republican published its final edition in the week of June 24, 1992. The following week, the two newspapers were consolidated as the once-a-week Butler County Banner-Green River Republican.\nJobe Publishing acquired the Banner-Republican in February 1998. This purchase also marked Jobe's debut as a newspaper publisher. In 2004, printing of the Banner-Republican was relocated to the Horse Cave-based Cave Country Printshop after Jobe Publishing purchased said printshop, along with the Barren County Progress, Hart County News-Herald, Metcalfe County Light, and the Monroe County Citizen. The Banner-Republican was previously printed at the facilities of the Messenger-Inquirer in Owensboro.\nNewspaper staff\nNewspaper staff as of March 2019\n*Lynzie Embry-Jones – Managing Editor\nReferences\nExternal links\n*[http://www.jpinews.com Jobe Publishing, Inc. Official website]\n*[https://www.facebook.com/BannerRepublican/ Butler County Banner/Green River Republican] on Facebook"
    }
  ]
}