{
  "content": [
    {
      "type": "text",
      "text": "# Byobu (software)\n\n| latest release version =\n| latest release date = }}\n| programming language   = sh, Python\n| operating system       = Linux, Unix-like\n| genre                  = Command-line interface\n| license                = GNU General Public License v3\n| website                =\n}}\nByobu is an enhancement for the GNU Screen terminal multiplexer or tmux used with the GNU/Linux operating system that can be  used to provide on-screen notification or status, and tabbed multi-window management.  It is intended to improve terminal sessions when users connect to remote servers.\nHistory\nVersion 1.0, under the name Screen Profiles, came out of discussions at the 2008 Ubuntu Developer Summit about how to simplify the on screen notification of an administrator connected to a server.\nThe project was renamed to Byobu for its 2.0 release, from the Japanese byōbu folding screen.  Byobu 3.0 reworked the build system to use automake and allow for porting to other Unix-like operating systems.  Byobu 4.0 introduced screen splitting, reworked the status notification system, and added support for tmux profiles. The most significant change that Byobu 5.0 introduces is a shift from GNU Screen to tmux as the default backend.\nOriginally written for Ubuntu, it has since been ported to multiple other Linux distributions and other Unix-like operating systems.\nReferences\nExternal links\n*\n* [https://web.archive.org/web/20111109104640/http://manpages.ubuntu.com/manpages/oneiric/en/man1/byobu.1.html Ubuntu Manpage]\n* [https://github.com/dustinkirkland/byobu Project home]\n* [https://www.digitalocean.com/community/tutorials/how-to-install-and-use-byobu-for-terminal-management-on-ubuntu-16-04 How To Install and Use Byobu for Terminal Management on Ubuntu 16.04], Stephen Rees-Carter, digitalocean.com, August 4, 2016\n* [https://www.serverwatch.com/servers/byobu-like-screen-but-better/ Byobu: Like Screen, but Better], Juliet Kemp, ServerWatch, October 4, 2010\n* [http://www.ghacks.net/2010/11/16/use-byobu-for-extended-features-in-your-terminal-window/ Use byobu for extended features in your terminal window],  Jack Wallen, ghacks.net, November 16, 2010"
    }
  ]
}